{"Document Name":{"0":"Diary_0053","1":"Diary_0053","2":"Diary_0053","3":"Diary_0053","4":"Diary_0053","5":"Diary_0053","6":"Diary_0053","7":"Diary_0053","8":"Diary_0053","9":"Diary_0053","10":"Diary_0053","11":"Diary_0053","12":"Diary_0053","13":"Diary_0053","14":"Diary_0053","15":"Diary_0053","16":"Diary_0053","17":"Diary_0053","18":"Diary_0053","19":"Diary_0053","20":"Diary_0053","21":"Diary_0053","22":"Diary_0053","23":"Diary_0053","24":"Diary_0053","25":"Diary_0053","26":"Diary_0053","27":"Diary_0053","28":"Diary_0053","29":"Diary_0053","30":"Diary_0053","31":"Diary_0053","32":"Diary_0053","33":"Diary_0053","34":"Diary_0053","35":"Diary_0053","36":"Diary_0053","37":"Diary_0053","38":"Diary_0053","39":"Diary_0053","40":"Diary_0053","41":"Diary_0053","42":"Diary_0053","43":"Diary_0053","44":"Diary_0053","45":"Diary_0053","46":"Diary_0053","47":"Diary_0053","48":"Diary_0053","49":"Diary_0053","50":"Diary_0053","51":"Diary_0053","52":"Diary_0053","53":"Diary_0053"},"Date":{"0":"unknown","1":1661.0,"2":1662.0,"3":1663.0,"4":1665.0,"5":1679.0,"6":1684.0,"7":1685.0,"8":1751.0,"9":1756.0,"10":1759.0,"11":1762.0,"12":1790.0,"13":1791.0,"14":1798.0,"15":1803.0,"16":1804.0,"17":1808.0,"18":1809.0,"19":1810.0,"20":1837.0,"21":1838.0,"22":1840.0,"23":1843.0,"24":1844.0,"25":1845.0,"26":1846.0,"27":1849.0,"28":1850.0,"29":1851.0,"30":1854.0,"31":1857.0,"32":1859.0,"33":1860.0,"34":1866.0,"35":1868.0,"36":1870.0,"37":1873.0,"38":1880.0,"39":1881.0,"40":1882.0,"41":1883.0,"42":1887.0,"43":1890.0,"44":1891.0,"45":1892.0,"46":1893.0,"47":1894.0,"48":1895.0,"49":1896.0,"50":1897.0,"51":1898.0,"52":1899.0,"53":1900.0},"Entry":{"0":"\n\nOn the night of ","1":" we were in the front line a mile south west of Merris and received orders that Nos 19 2 platoon of my Coy had to make a day light stunt 9 am of the","2":" Of course this meant a lot of bustling about detailing parties for carrying ammunities fatiqure party and all these being found from my je Palour N841 as we were holding the line on the left of where the stunt was to take place.\n\nThe eventful morning broke a beautiful day and as the\n\nzero hour neared the suspense of waiting grew however a few minutes to mini succession of detonations took place and we then knew the strokes mortans which was our only barrage were busing. After two to three minutes of this we were surprised to see burns suming across the platoon front and we knew then the boys were over and that Floitz preferred running to fighting. Shortly after a runner comes to the post for more bombs and told us that the objectives had been gained but the hun reseree machine guns were causing a few casualties. I then took three men and we loaded ourselves with bombs and went forward and found that the hun was forming for a counter attack. Consolidatury and preparing the position gained was being carried as by busy hand and every thing going with a saving when all of a sudden some one shouts sure they come.\n\nThey did come but not to stay for our bomb throwing and gun fire soon stops him and he off and back. I then return to my platoon to partake of our scanty breakfast I had just finished this when I received orders from the O.C to take charge of W01 platoon as went forward and did so during the rest of the day we were kept extremely busy for Fritz was determined to regain his post and kept attacking lact to no avail. The last time being about 8.30 pm and on this occasion things were looking extremely black for us for he got on three sides of us and just when we expected the worst the OC counter attack across country and so relieved up last he was hit in so doing which afterwards proved fatal and he succumed to his wound. About 11 pm I left to go to our left flank post and it was while going there fires blown out of a trunch by gas shell (phosegane) & received a fair issue. I carried on and delivered my message to the \n\npost & then went back & saw my officer & then left for the Aid post where I remained for 2 day. On the afternoon of the second day I was sent to the advanced loading field ambulance station & was put on a motor & taken to the field ambulance at Boerre & had all particulars etc recorded. Our stay there was very short for we were again put on a motor and taken to the","3":" Field ambulance at and it was here I was put into pyjamas & made a stretcher case & was again put in another motor about 12 midnight & arrived at No. 2 Aust. C.C.S. Arques at 1.30am on the","4":" The stay there was 36 hours when I was again put in a motor & taken to St Omer station & put aboard an ambulance train & went to Boulougne. On arriving at Boulougne motor again met us & I was taken to no. 53\n\nGeneral Hospital near Wimereau where I stayed until","5":" I was discharged on that date & sent to No 1 Convalesence Camp Boulogne & had two days there when we were sent to No 10 Con Camp in the same city. At Tattoo on the","6":" \nI\n We was told all Australians had to leave that camp at 7AM next morning which we did & taken by motor to Boulogne Railway station where we entrained. After about 12 hours monotonous train journey we alighted at Harfluer & marched to the","7":" Aust. Con Depot Rouelles. Here we went before our own doctors & marked for treatment & my stay in that camp lasted eight weeks. I had a real good time getting leave two & three times a week into Havre & had no camp duties so had no complaints to make. After eight weeks I was marked for medical board & was transferred to the base for same\n\nI had a week to wait for the 1 board & marked B.2 which meant a trip to England but had a wait of another week. I received orders on the","8":" that I was to proceed on the long looked for journey & left camp at 2PM on that date by motor & was taken to the wharf at Le Havre. We embarked at 7PM on the Monas Queen & sailed at 11PM & after an all night voyage landed at Southampton at 8.30AM next morning. We then had to march to the Railway station & given three hours leave & it was great to feel the English air once more. We left by train at Midday & detrained at Weymouth where motors awaited us & was taken to Westham camp & fixed up for the night. Next morning I had to go before the doctor & was classified C11 & the same on the next day & was drafted to No 4 Coy. I was finally boarded \n","9":" & marked B.2.A which meant 6 months home service in England. On the","10":" I was transferred to No 2 Coy & the next day again transferred to No 1 Coy. I lasted two days in that Coy & was then transferred to Ord Room Sgt to Staff Coy on","11":" Managed to get into Weymouth each day having a real good time so had no complaints to make.","12":" started furlo left Weymouth 8 AM arrived London about 1PM Saw “Maid of the Mountains\" ","13":" went to Brighton & saw Pictures at Academy – 26 Hippodromme – 27 Academy - 28 returned to London after having a good look round etc – 29 saw Shanghai - 30 boys on broadway – 31 look round city –","14":" went to Salisbury – 2 went to show at the Palace – 3 look round town – 4 show at palace 5 returned to London & went to Hammersmith\n\n& went to Shanghai ","15":" went to “You never know you know\" & “As you were\" ","16":" left London by 2 PM train arrived back in camp 7 PM sick sore & sorry\n","17":" Great excitement about Armistice being signed.\n","18":" Ceremonial parade into town for speech by Garrison Commander.","19":" half holiday celebrations –\n","20":" left Weymouth by train for Devonport at night. Embarked on S.S. Somali & layed in Dock at Keyclock all night. Set Sail next morning","21":" & taken through Plymouth harbour – next couple of days experienced a few heavy seas in Bay of Biscay & most of the troops were sick. Past several ship & small island or land sighted on morn of","22":" Pulled into Gibraltar 3 AM","23":" but only for half hour.\n\nPassed along the coast\n\nof Spain seeing the mountains of Sierradevarda - \n","24":" Day broke with N\/East coast Algeria of Africa in sight & followed along same during the day experiencing dinkum weather –\n","25":" day light broke with several small islands to starboard\n","26":" Passed Malta on Port Side –\n","27":" Pulled int Port Said & dropped anchor about 4.30. Troops not allowed ashore - broke ship & went into Port Said – Saw main streets & 2 horse trams & returned layed in canal all the time & weighed anchor 2.30 \n\non","28":" both entering Port Said & canal mast heads funnels etc could be seen of sunken vessels – At head of canal passed a big Armenian refugee camp on east bank – big suction of canal at midship – Passed through Suez Canal a very low ratio of speed arriving at Suez – about 6 am on","29":" – layed in Port Suez & spent Xmas took L.H. of sisters aboard – leaving at 9.30 on Xmas night\n","30":" when daylight broke we had entered Port Said & land was visible on both sides – \n","31":" passed 12 apostles & Hells gate on port side – during rough sea\n","32":" passed along coast of Africa & late afternoon passed Cape Gardafewue the most easterly point of Africa.\n","33":" 1919 had fancy chess parade & Ball on board \n\nPulled into Colombo & lay in side break water about 2AM on","34":"\n\nWeighed anchor after coaling & watering at 12 NOON","35":" – \n","36":" cross the line just before midday -\n","37":" passed Cocos Islands during the night – \n","38":" pulled into & dropped anchor at Fremantle about 6 AM. afternoon all W.A. troops left in launches took fruit & vegetables aboard – \n","39":" Weighed anchor & left Fremantle about 8.30 AM & run into fairly big Sea. - & started for Influenza -\n","40":" Followed coast along it being in sight from daybreak – Arriving & entering Albany harbour about 5PM – took water –\n","41":" Weighed anchor & left about 2PM & followed coast for a couple of hours & then out into the Bight –\n","42":" – Arrived & weighed anchor off Brighton outside outer harbour Adelaide under Strict quarantine\n","43":" troops catch shark – dissatisfaction aboard troops riot & practically take charge – ship attempt to put to sea but detained – \n\n ","44":"\n troops get ashore at Quarantine Station Torrents Island by tugs – passing through Outer Harbour & up Torrents River – \n","45":" DITTO –\n","46":" DITTO & weighed anchor & pulled into No 1 Wharf Outer Harbour at 7 PM & at night dinner & concert & cinema film by Red Cross.\n","47":" Leave to Adelaide\n\nleft ship at 9AM & returned MIDNIGHT. Had good look round City – entertained by Red Cross & went to MAJESTIC THEATRE at night.\n","48":" Left Adelaide about 7 AM\n","49":" Arrived outside heads Melbourne & waited till dawn\n","50":" under quarantine – during mist pulled inside about midday – restriction lifted – stopped opp Williamstown – \n","51":" Pulled into New Wharf Port Melbourne about 8 AM & received leave about 11 AM. Had good look round city & St Kilda – stopped in town at night\n","52":" – round city & St Kilda & returned to ship about mid night\n","53":" – left Port Melbourne about 6 AM –\n\n \n\n"}}