{"Document Name":{"0":"Diary_0009","1":"Diary_0009","2":"Diary_0009","3":"Diary_0009","4":"Diary_0009","5":"Diary_0009","6":"Diary_0009","7":"Diary_0009","8":"Diary_0009","9":"Diary_0009","10":"Diary_0009","11":"Diary_0009","12":"Diary_0009","13":"Diary_0009","14":"Diary_0009","15":"Diary_0009","16":"Diary_0009","17":"Diary_0009","18":"Diary_0009"},"Date":{"0":"unknown","1":466.0,"2":467.0,"3":468.0,"4":469.0,"5":470.0,"6":471.0,"7":472.0,"8":474.0,"9":486.0,"10":487.0,"11":488.0,"12":489.0,"13":490.0,"14":491.0,"15":492.0,"16":496.0,"17":497.0,"18":498.0},"Entry":{"0":"\n\n1915\n\n","1":"\n\nA nine mile march in full marching order. Left Mena Camp about 6 p.m. arrived at Cairo Ryl. Station 8.5 p.m.\n","2":"\n\nLeft Rly. Station for Alexandria about 1 am. Arrived at Alexandria about 5.30 a.m. We were all packed like sardines coming down by train. Feel a little bit tired and foot sore after journey, had new pair boots on and they did not fit too well. I took them off in train and it was Hell trying to get them on this morning my feet were swollen a lot. Embarked on the \"S.S. Darflinger\" a German Steamer which was captured and it is now being used as a British Transport, this is what I call rubbing it in with a vengeance. On Fatigue work all day.\n","3":"\n\nFatigue work all day.\n","4":"\n\nFatigue work all day.\n","5":"\n\nLeft Alexandria don’t know where we are going 7 p.m.\n","6":"\n\nArrived at the Island of Lemnos, not much of a place, seems to be poverty stricken, they are making their piles out of the boys by selling tobacco fruit and nuts, etc. they charge about twice the amount they ought to.\n","7":" 9th,","8":"\n\nBeen here up till the","9":" 18 Battle ships.\n","10":"\n\nLeft Lemnos about 11 a.m. came a little way on the opposite side of the Island. Left here during the night, we are all standing by.\n","11":"\n\nArrived at the spot where we have to land the Battleships. Are already at work bombarding the shore a sight worth seeing, where the Turks are all entrenched waiting to welcome us. Our ships steaming slowly towards the spot where we are to land. Have anchored now a destroyer is coming towards us got order to get ready to land. First tow don’t like the look of shore. Sand hills and cliffs rise straight from the shore. On board destroyer Jack Tars say the enemy is waiting for us with Machine Guns, looks a tough job. If I pull through I will finish this.\n\nWell I will start where I left off. The Destroyers steamed in as close as possible to the Shore, 790 yards. We then got into the small boats and rowed ashore. As we came on the enemy opened fire on us with shrapnel (exciting) from forts, reach Shore, jump out off boats into water and rush up the beach with fix bayonets, enemy knocking our men over, retreat with machine gun fire can’t see them, so we off our packs, let out a yell which must have been heard miles away, and rushed the Hill, don’t remember what happened, and I don’t think I wish to. I must have gone mad, so I will start where I came to my senses with face and hands scratched from scrambling in the bushes. The enemy now entrenched, we halt, word comes from 2nd Batt. to retire to the beach.\n","12":"\n\nAt the Beach we are sent to the left, a big battle at full length now, have about half hour spell, some of us detailed to carry ammunitions. Shrapnel bursting all round us. 2 Companies of our Battalion in firing line, fighting for position on Plateau 600 feet high. Mjr. Scob in command of A. and D. Coy. Enemy pressing our left flank our Troops N. L. are retiring slowly, order given to dig trench, starts to dig but too\n\ntoo late. Enemy have spotted us, and are firing Shrapnel on us. Ordered to advance as fast as possible. 2nd. Battalion to reinforce N.L. on extreme left. Off we go, Colonel Braund in the lead, Sid Cain and myself next, have about half a mile to go then a 500 feet climb up a fairly steep sandy slope, snipers potting us all the way, reach cliff, and start to climb (sheep track) in a single file, half way up track took a bend towards enemy, then straight up parallel with enemy lines (not aware of this till later) after getting fairly well up enemy open fire on us with machine guns. Order to take cover, we get down flat on our faces, must have lain there half an hour, Bullets spattering all round us like rain. Jimmy McEwan killed alongside of me, shot through the head, one missed Murray’s head and hit my boot, others hitting that close that the dirt flies all over you, the sensation very queer, all of thoughts running through your head. Order comes from behind find out if the Colonel still in lead. I have to crawl about 20 yards to find out, case of have to, noise of battle too great for Colonel to hear me from where I was. Not close shaves though reach Colonel, he gives orders for men to get over side of cliff, men getting hit all round now, young McColl hit. I just manage to grab him and pull him over our side, otherwise he would have rolled over the opposite side where he could have been riddled with bullets, left him with George Hitmead. Follow the Colonel on the ridge and open fire on the enemy, we advance a bit and try to help N.Z. on our right, can’t do it, only the Colonel and those of us left, Sid Cain, Carter and myself. The Colonel very brave. I did not go pots on him before but would follow him anywhere now. As darkness fell we crept to the N.Z. Colonel takes command. Carter missing. Enemy attacking very strong, our men mowing them down (as a Turk gets hit he lets out a mournful howl of Allah, Allah, Allah and judging by the noise they make you would think that the whole of the population of Turkey was wounded). We now start digging ourselves in. Colonel sends back word of reinforcements. Colonel gives order to retire. We do so, carrying our wounded and ammunitions with us. Half way down we meet N.Z. Reinforcements, so we turn about and start to climb up again, and take up our old position, and start digging decent trenches (a terrible night) they came up again and again, they would blow bugles at one part (the charge and all others all our own calls. One did not know whether they were our own men or not until we were told. Whilst they charged at another part, spies in our trenches giving us false orders to retire and don’t fire, they are our own men.\n","13":"\n\nAbout 4 a.m. I start stretcher bearers and carrying ammunition and water to firing line at about 11 a.m. I return to Mjr. Bourke, who is in command of 2 Coys. (B and C Coy) 2nd Battalion, and some N.Z. who are holding ridge on the left flank, they have dug trenches, but not deep enough, so they are still digging. I am now acting as messenger between Major Bourke and Colonel Braund, pretty risky, but don’t feel afraid, have got over my nervousness. Snipers potting at me from all directions, some snipers in the bushes on the ridge behind us, but can’t locate them. Mjr. Bourke asks me to get a party of men and locate snipers. I pick Cain, Armstrong, Marwick, Holland, Miller and put them out.\n\nI have some bully beef and Biscuits. Still acting messenger, at dark I am picked to go out on patrol.\n","14":"\n\nWe go about half a mile, and do our post, towards daylight we come in, hear Gordon and Kelly killed, Scobie Watson, Hugh, Tarrant wounded, also that English have landed further down (good news puts more life into us) great bustle expect something doing shortly. Capt. Con Cannan and C. Coy. ordered to the front firing line. N.Z. takes up position left by C. Coy, heavy fighting going on. I am running line\n\nof communication between Colonel in front firing line and Mjr. Bourke, one part I have to run has no cover at all about 40 yds. having close shaves plenty of others hit especially S.B. taking the wounded out of the firing line. Capt. Con Cannan killed. Generals Birdwood and Walker now close to firing line. Orders for all Australians to go into the front firing line. N.Z. relieve us, so that we can do so, we get to the top where we make a dash towards the firing line. We had gone about 50 yards, Mjr. Bourke dropped hit. I turn back to fix the Major, but he calls me a B. fool and tells me to take cover and crawl to the firing line. I turn to do so when he asks me to take his equipment off. I do so, and then try to fix his wound but no good he is bleeding pretty bad, shot through I think both hip-bones. I try to lift him, but no good, too heavy. I cut a path through the bush and helped him along as best I could. Tom Hammond now comes and between us we carry him to where the S.B. are. I leave him and go back for his equipment, get it and bring it back. Give Liet. Paine the revolver and equipment and the Mjr. his glasses, and go back to the firing line. Lieut. Fordinner wounded, go back into firing line towards Cpl. Peden, Miller wounded and Sgt. Birkmare killed. Cpl. Ole in charge, enemy’s shrapnel playing hell with us. I am sent to the Colonel to ask for reinforcements but Col. says can’t do it, as I am coming back the order is given to retire the Turks are on us (given by a spy in our trenches shot by Col. Owen about ½ hour afterwards whilst giving another false order) some men started to retire but Col. and Lieut. Westbrook stop them and give order to fix Bayonets and charge, the enemy retire and we occupy a trench about 150 yards ahead of our original trench, very shallow, so we start digging it deeper with our trenching tools, when dark came we got pick and shovels. I get some men together and we make to camp to bring up water, we score four kerosene full of hot tea, and take it up, running short of ammunition. I carrying ammunition to the firing line, meet Lieut. Westbrook who asks me to come over to his trench on the left. I can’t find his trench so I come back and keep on carrying ammunition.\n","15":"\n\nOrder comes","16":" Battalion to retire to the beach for a spell, we are relieved by N.Z. get down to the beach we number 180 men, but others are coming in ones and twos, I am terrible and aching all over; have a bit of a feed and go for a swim, feel much better, slept all the afternoon. At night we got ready to move our resting place, orders come for reinforcements. The Col. turns us about, starts up the hill, when the order is cancelled, we march to our quarters and lay down in the wet, under a bit of a bush, too tired to grumble, slept well, never woke until morning. When we were over the ridge on left we saw two S.B. of","17":" Batt. A fellow Weston 2nd Batt. and a N.Z. rescues wounded men about 500 yards along the beach and under fire all the time. Col. Braund patted on the back and told well done. Col. Braund by General Birdwood and Walker recommended for the D.S.O. the day we came down.\n\n29th\n\nOur new quarters on the beach would put you in mind of a piece of land badly infested with rabbits of an extremely large size, or the home of cave dwellers. We get a pick and shovel and dig a hole in the side of the bank just like a rabbit burrow so as to give us head over from shrapnel fire which keeps bursting along the beach. Snipers in the bushes knock our men over, one party of our fellows went out to try and find them but no good, you see these fellows are all dressed in our uniforms, eat with us and at times they have been in the party which was trying to get them. The spies are just the same, you have got to be pretty smart to catch them. The Colonel takes the names of Sid. Caine, Carter and myself, don’t know what for, sticks and myself sleep together, night terrible cold here, that cold that you shiver till the sweat pours from you. Carter still missing.\n\n30th\n\nSlept fairly well, enemy shrapnel and snipers still playing the devil with us. We are catching the spies now, since the order came out that every man must know his neighbour, and what he belongs to. Indian Mountain Batteries and R.M. D.I. now landed, also Maltese and Indian Transport. I have been made a full Corporal. I went out in charge of party looking for snipers, found none\n\nnearly got sniped myself by Indians. The Indians catch a sniper who potted a couple of their men, they cut his head off and brought it back, when asked for the body they replied that body too heavy. Got word that","18":" Brigade and N.Z. captured Batt. of Turks. Enemy sunk small mine sweeper close in shore. Tucker pretty good now, we get Bully, bacon, biscuits, cheese, thousands of packs lying along shore some belonging to men in firing line, others dead and wounded. I have lost my pack, and have not the slightest hope of finding it. Had an issue of rum, just about two spoonfuls, enough to rinse your canteen lid and make it smell very stingy in this line a bit off for a believe we only get it once a week.\n\n1st \n\nEnemy shrapnel and snipers still at it knocking a few of our boys, also some of the Indian A.S.C. Seen a couple of Armenian refugees, I believe they raised a Batt. of them in Egypt, they are here doing Transport work and Fatigue work. Don’t go pots on them. They look a miserable lot. Saw a lot of prisoners brought in today. Orders come 2nd Batt. to go up and support R.M.L.I. in the centre. Went up at 4 p.m.\n\n2nd\n\nNothing happened while out on out-post last night, relieved this morning at 6 p.m. have breakfast then start making roads for Artillery, very little shrapnel here, have plenty of snipers though. Dig all day, at about 5 p.m. all the Warships and our own Artillery start bombarding enemy trenches and reinforcements, which they are bringing up – a great sight, the Warships using Lydite and Common Shell. R.A. Shrapnel must have done terrible damage to enemy for when a Lydite hit it it tore up the ground for yards. We could see men, guns and earth all go up in the air together, this lasted for an hour. On digging trenches tonight.\n\n3rd\n\nOn building roads for Artillery to-day. Our old Colonel shot dead last night, hard luck for us, just as we got to like him we lose him. He was worrying too much lately, little or no sleep last night or I should say early this morning he goes out past the picket lines, don’t know what for, on returning he was challenged by the sentry one of our own Company who on receiving no reply, fired, not knowing whom he had shot. In the morning when he went out instead of finding a dead Turk we found our poor old Colonel, lying face down shot through the head. You have no idea how we felt, most of us wanted to shoot the sentry, or at least do him some bodily harm, but as we did not know who the Sentry was and it was explained to us that the Colonel was walking in his sleep, we had to let it drop; we buried him, most of us feel a bit off, a bit downhearted. We have only 2 Captains and 7 Lieutenants left out of 32, most of our N.C.O. men have been put out of action. I feel pretty upset over the poor old Colonel. Yesterday he had Sid Cain and myself up before the heads, Generals Birdwood and Walker, telling them how we had kept beside him, and that we were the only ones left out of the party he had, and we had done this and that thing, both Sid and myself had forgot about. They wanted to promote Sid but he would not have any, told them he had enough to look after himself without looking after anyone else. The Heads shook hands with us and told us Australia was proud of us and a lot more \"Bunkum\" that made a man’s head swell. I was made Sergeant.\n\nAbout 11 a.m. we got orders to relieve 5th, and 6th Battalions on right flank, we pack up and down the hill we go then up a valley to the right flank we are all pretty well done up, had very little sleep lately, at 5 p.m. we get in the trenches and relieve the 5th and 6th. This is a bit off for a Battalion of 520 strong lot of them wounded too, going to hold a position which had taken 2 batt. with 1500 to 1600 between the two of them. Something wrong somewhere, we are to arms in the trenches to-night, that means no sleep to-night for any of us.\n\n"}}