{"Document Name":{"0":"Diary_0100","1":"Diary_0100","2":"Diary_0100","3":"Diary_0100","4":"Diary_0100"},"Date":{"0":"unknown","1":1383.0,"2":1384.0,"3":1387.0,"4":1388.0},"Entry":{"0":"\n\n","1":"\n\nTo go out at 12. Woke at 11 and got our porridge and bacon. Raining a bit but I didn’t think it would set in and we were told we wouldn’t move till 3 so tried to sleep again but big gun firing and didn’t get a wink. \n\nArtillery seems quite normal. Stunt is 30 min barrage over front line then advancing 100 yards 3 min to first objective then stationary for 30 min. Moving on to end objective blue line at 100 yds per 6’ and playing for 3 hrs. approx. 1st Objective Glencorse Wood 2nd edge of Polygon wood & 3rd Middle of Polygon wd 2nd Brigade on our right & 2nd Division on our left. 11th captured 1st objective red. 12th the second objective (blue) & 10th 3rd objective green. \n\nOut at 3 and carried in battle order 3 ½ days rations (iron) including the chocolate & private sundries. Took Derby Road & then on to new road leading to dugouts behind Zillebeke Bund & a lake. Very sloppy going out. The 2nd Coy arrived before us and secured all the dugouts so we had to sit outside for an hour or two. Coming along road several high velocity shells came over against road fairly near to us and scared us a bit. \n\n2nd Coy moved out about 4 and we about 5 and along Warrington Road. Absence of traffic was surprising. Barrage opened just as we passed beyond wood about ¾ mile from top of road and German reply hardly noticeable. Along Menin Road on to our Corduroy Road & only activity was the A.M.C. people. Barrage not so great as was expected. On to our dump where all material was laid out for us except shovels which someone had commandeered. So we had to wait for them. \n\nThings fairly warm there & splinters and M.G bullets plentiful. Here we saw the first batches of prisoners returning along the plentifully directed route. Charlie Day was bruised by M. G bullet in calf of leg just missing entering and retired. On through main road past Chateau Wood and here was a formidable heavy shall barrage we had to pass and several shell bursts quite close to us but effect very local on account of soft ground. Our load of shovels & sandbags\n\nand 3 ton of pickets rather heavy & MacMillan Linton and Doyle of my party with a good few others gave up and sat in a trench I carried on until we reached some high ground and a mound where we had to stop as barrage was playing on 2nd Objective.\n\nWe were right up with infantry who were waiting for the barrage to lift. Grand sight and barrage pretty good and absence of Fritz and \nwe\n infantry nonchalantly strolling everywhere. Barrage lifted and we followed in about 30 minutes Ground area of 3rd Brigade already all marked out and we pushed on to where barrage was playing over 3rd objective and Price & MacKenzie marked out strong point and we got to work. 3rd Wave went over in artillery formation. Worked hard and soon linked up. \n\nA party of 8 germans came running over on our right from a pill box they had got out of and with hands up and very scared. They were a very laughable sight although they left behind intact a pill box 2 machine guns and a huge quantity of ammunition which might have done considerable damage. \n\nWe heard from runners Pope and Prince that enemy detachments had been observed moving up towards Polygon Wood for counter attacking about 10 and were expected at 12. Soon after 1 we observed Fritz hopping over the hill in front line into a trench & thence to the rear of a big mound in front whence they came round to an apparent trench on the mound and facing us where was situated several pill boxes. A few scraggy trees were on top of the mound and the largest had a boxlike O.P. which seemed intact. A few sniping shots were sent over and the two machine guns captured in charge \n\nof the corporal of 2nd Brigade who lectured up at Bray on the Vickers gun opened up and we saw two fall. \n\nWe continued our work and about half an hour after the artillery got on to them as they had become quite a large party by this time. The shooting was fine and 9.2\" were used as well as 18 lb guns which got direct hits in parties going into the pill boxes and stirred them up considerably for a while. One of our guns seemed to be consistently firing short all through the barrage and the shells were very fast and did more damage than whizz bangs. \n\nAbout 15 rounds were put right into us near the rear pill box and we were lucky in getting no casualties. Price & Elliott moved about a lot too much in the open and were too foolhardy. Fritz counter attacked the second division on our left rather half heartedly and got knocked back through the barrage of machine guns and shells. \n\nThe most disheartening thing occurred during the afternoon when about 30 german planes came over flying quite low and stayed over for about 3 hours doing as they liked and occasionally using M.G on us Only one of our old observation planes up and he was attacked every now and again and all over the place. We were lucky as all through we never had any shells sent directly at us although all round us. \n\nJust about dusk Fritz who had quickly registered on our new lines began to strafe fairly heavily\n\nand soon after attacked and we sent up our S.O.S signals a red green & yellow parachute flare. The barrage fell well and we all had to stand to and some of us were a bit scared. I was watching all the time and our flares were rotten. Things were fairly lively and I think our boys were driven out temporarily from the front trench as I saw about 50 dodging about alertly in the open and gathering behind a pill box in front of us. However about 9 all was quiet again. We manned our trench for the night and a corporal and three men were supposed to be on guard continuously but no one woke me up and I missed my 1-30 to 3 guard although I slept little. \n\nAbout 4-30 our barrage opened again although no S.O.S and we all stood to and things were rather lively. It was bitterly cold sleeping and we were crowded with nothing to lie on and dirt all over us. We weren’t sure if we would be relieved until next morning but an order came through the runners for us to retire at daybreak and be relieved by the","2":" Coy. We stood down about 5-30 and \nat\n filled our bottles and gathered our gear. \n\nIn late afternoon we dug a sort of communication trench and Fritz was sending over about 30 yds away a H.E. 10.5 whiz-bank uncomfortably close and we were all called in when the counter attack took place. At daybreak we marched slowly out and then naturally anxious to get out quickly avoiding all\n\nall dangerous looking localities. Seemed a good few german dead about and a lot of our boys badly blown about although right through our casualties were light. \n\nHome over Warrington Road route and caught an ammunition limber a fair distance and home very tired. Our section no casualties but Corp Sullivan, Jones, Clements, & Wickins and Beard and several others of the other sections. \nDunn & Currie\n killed.\n","3":"\n\nMono Rail given up as hopeless and we all thoroughly disgusted. New job putting in light railway on right of top of Menin Road. Woke at 3.30 and out at 4 on three pontoons. All fair till we got to Menin Road at Hell Fire Corner. Just at 5 o’clock and beginning to get light.\n\nThere was a big convoy of motor lorries at the head of the road and Fritz had two balloons up directly in front who were observing for the heavies. He sent over an incendiary shell which burst in among them and started a fire and he then poured in heavy H.E all along the road dumps of timber and shell were flying everywhere and we only had a few shell holes for shelter and I with some others was behind a low breastwork about 2 ft deep. The pontoons were sent back. \n\nThe heavy shelling was most intense but we managed to move up a bit closer to an old trench very shallow but better although the men were very scattered. Going across I got a hard smack under the left shoulder blade but didn’t penetrate & while in there Sgt Walsh got one just below the neck which stirred him up a lot. All the available drivers were with us and we cowered here for some time only occasionally getting a glance over. \n\nIt was an awful sight and the motor lorries were set on fire one by one & all the while dumps were going up and wood flying. Two traction engines were hit and abandoned above us. german planes came over in groups of 12 and observed. We then shifted to a deeper trench in good condition and felt\n\nsafer there. M. Graham was continually advising Mr. Price to abandon the job but he wouldn’t listen and together they went up and inspected it. Soon afterwards we all went up although a lot got lost and were never on the job. The pioneers were working just ahead for a while but soon got shelled out. \n\nVery hot working in open with splinters flying every and two big apparent duds came over but proved to be gas which was green and dangerous looking. Luckily we were on windward side. A shell burst about 30 yards off and we got the order to retire then at 5 to 12. It seemed useless work packing soft earth under the sleepers. \n\nIt was an awful sight seeing a shell burst and men going up some with their legs blown off and wounded were plentiful and couldn’t be helped. A gun fell on one and he was in agony. Another shell blew a man to atoms and pieces of flesh fell over us quite close. I took a circuitous route home followed by about 10 others via Warrington Road and everywhere damage was done. \n\nOur guns were powerless to reply. At Shrapnel Corner H. E had been sent over and 6 horses killed and all along men were lying about scattered very thinly. I heard of one corporals guns 3 out of a battery were out of action \nand\n of 9.2 howitzers & another 5 out of 6 field guns gone & 16 men left out of sixty. It looked as if half the guns had been destroyed at least in our sector and the front lines seemed to have had their share of bombardment.\n\nHome by a couple of rides and rested the remainder of the day. One big shell came over close to some of and wounded cpls Moloney & MacKenzie fairly badly and later Avery led a party into a barrage and Charlie Day was wounded seriously. We were lucky in having so few casualties Savage & Martier were up for a while but soon retired. \n\nNext day the","4":" Div \nseemed\n had a stunt and succeeded in their objective and it is wonderful how the guns were sufficient and reorganised. Numerous prisoners came down and I counted 50 past here. This is as correct as I could form a judgment from our part in the affair. Other 2 sections couldn’t get out although Bremner & Kernot went out and were missing for 6 hours as \n\nthey couldn’t get back.\n\n"}}