{"Document Name":{"0":"Diary_0020","1":"Diary_0020","2":"Diary_0020","3":"Diary_0020","4":"Diary_0020","5":"Diary_0020","6":"Diary_0020","7":"Diary_0020","8":"Diary_0020","9":"Diary_0020","10":"Diary_0020","11":"Diary_0020","12":"Diary_0020","13":"Diary_0020","14":"Diary_0020","15":"Diary_0020","16":"Diary_0020","17":"Diary_0020","18":"Diary_0020","19":"Diary_0020","20":"Diary_0020","21":"Diary_0020","22":"Diary_0020","23":"Diary_0020","24":"Diary_0020","25":"Diary_0020","26":"Diary_0020","27":"Diary_0020","28":"Diary_0020","29":"Diary_0020","30":"Diary_0020","31":"Diary_0020","32":"Diary_0020","33":"Diary_0020","34":"Diary_0020","35":"Diary_0020","36":"Diary_0020","37":"Diary_0020","38":"Diary_0020","39":"Diary_0020","40":"Diary_0020","41":"Diary_0020","42":"Diary_0020","43":"Diary_0020","44":"Diary_0020","45":"Diary_0020","46":"Diary_0020","47":"Diary_0020","48":"Diary_0020","49":"Diary_0020","50":"Diary_0020","51":"Diary_0020","52":"Diary_0020","53":"Diary_0020","54":"Diary_0020","55":"Diary_0020","56":"Diary_0020"},"Date":{"0":"unknown","1":1060.0,"2":1061.0,"3":1062.0,"4":1063.0,"5":1064.0,"6":1065.0,"7":1066.0,"8":1067.0,"9":1068.0,"10":1069.0,"11":1070.0,"12":1071.0,"13":1072.0,"14":1073.0,"15":1074.0,"16":1075.0,"17":1076.0,"18":1077.0,"19":1078.0,"20":1079.0,"21":1080.0,"22":1081.0,"23":1082.0,"24":1083.0,"25":1085.0,"26":1086.0,"27":1087.0,"28":1088.0,"29":1089.0,"30":1090.0,"31":1091.0,"32":1092.0,"33":1093.0,"34":1094.0,"35":1095.0,"36":1096.0,"37":1097.0,"38":1098.0,"39":1099.0,"40":1100.0,"41":1101.0,"42":1102.0,"43":1103.0,"44":1104.0,"45":1105.0,"46":1106.0,"47":1107.0,"48":1108.0,"49":1109.0,"50":1110.0,"51":1111.0,"52":1112.0,"53":1113.0,"54":1114.0,"55":1116.0,"56":1117.0},"Entry":{"0":"\n\n","1":" Last night as we moved from our wet camping ground we hsd to pass through Delville Wood & this place is alive with big guns,there are acres & acres of big gun ammunition stacked here talk about an eyeopener.i don’t know what would happen if by any chance one of them stacks exploded , as they did a few nights ago at a place called Cissy about 4o miles from here, a Zeppelin came over & dropped bombs on a French Army Coep dump, the resulting explosion lit the whole sky up,& could be heard & felt for a very great distance.\n\nJust as we were passing one of thse big guns, she let fly, we were about 10 yards to the rear of her, & I just noticed the gunner in time as he reached for his lanyard & I sort of held my breath, the next thing I remember was that I\n\nwas lifted completely off my feet & blinded for a second by the fiery flame which shot upwards from the monsters mouth, they leap like a young & and bucking horse when they are spitting these great shells out, but the funny part is that they seem to jump forwards,& then backwards.\n","2":" Still raining disma\nr\nlly & the joint looks like a sea of mud, last night we slept in long low huts made of any-thing they could lay their hand on such as old tarpaulins bags, waterproof blankets etc,it was floored with old duck boards, 2ft wide for these we slept one to a man so you can guess we had a pretty rough bed, but it was a palace compared to what we had been having lately so all were satisfied, in those long shacks were braziers for warming your\n\nself but the only thing that ever they done was to smoke you out, it used to be awful some of the boys would light up with wet wood. why,you could not see nor breathe for smoke.\n\nThis morning we all marched away on fatigue, the road we went down was swimming with soft slushy mud & thousands of Tommies were sweeping it as well as they could with big yard brooms & shovels this is the only way they can keep these roads fit for traffic, but of course you have no idea without actually seeing it of the enomorous amount of traffic there really is on these feeding roads, there are miles & miles of motors going each way & and those vehicles & w3aggons by the thousand & amp; sandwiched in between all the other traffic are constantly\n\nmoving bodies of troops also travelling both ways, it is almost impossible to croud another cart or man on to it.\n\nThe big motors are eyeopeners I never thought they could stand the rough wear & roads like they do ,but they seem to revel in them & plough their way through like steam engines\n\nWell after we had walked 3 miles or so & nearly into Fricourt we pulled up, & there we waited in the pouring rain for 3 solid hours before they could find the officer in charge of the job,at last they produced him and the work he had for us was carrying timber and old sleepers from the railway to where they were making a corsway road about ¼ of a mile away, the sleepers were not very heavy for they were old and well dried\n\nI saw a great armoured train and engine here and mounted on 2 enomorous steel trucks were 2 big guns. 1, 12 inch howitzer and 1, 9.2 naval gun, they had been firing in to Baupaume, the howitzer throws a shell weighing 880 lbs the 9.2 one 380 lbs, both nice things to be away from when they explode.\n\nThe boys finished the job about 3 oclock and we formed up and marched home again or rather limped home for practically all our boots were ruined and nails were sticking into our feet, I know they made mine bleed, and we had no chance of getting any new boots for a few days \n","3":" Moved off to the same place again this morning at 6.30. the weather looks to have taken up a bit its not wet at any rate, I had a charge of the coy this morning for there were no officers\n\n \n\non parade and I was the senior N.C.O. present, our work this morning consisted of draining principally.\n\nAfter dinner I marched the Coy down to the baths for we all wanted one badly they had no towels clean clothes or nothing at all in the baths with the exception of hot water, but we had a bath and dried ourselves with our shirts and all came away feeling much better.\n\nThe day turned out to be nice and sunny and so brought swarms of aeroplanes and balloons out and there were a great many air fights, we saw 4 Taubes come down in flames and 3 out of control and diving head first to the ground.\n\nWe had our 2 and Blanket issued to night and by Jove we want it badly for it is very cold of a night time and wet clothes are not the warmest things \n\nto sleep in at the best of times.\n\nIt was also payday and our canteen opened tonight so we will be able to buy a few luxuries for tea tonight. Saw Les Tillack and Claude Smith this evening Les has not changed much in my opinion only grown taller. \n\nMy postcards arrived this evening 40 doz they have been a long while turning up I thought they had gone astray.\n","4":" Different job again this morning widening road but it is not a bad one for it is clean work, it is nice and sunny and I counted this morning 68 aeroplanes and 47 balloons up the artillery also is more active and there is quite a decent row being kicked up Jock Mackie came back from the rest station this evening reckoned it was no good to him as he would rather be back with the battalion\n\nHad charge of the coy, again this morning, today a lot of the Guard regiments marched through here,the Irish Guard had their band playing as they came along, they are splendid looking troops alright all over 6ft and spick and span, they appeared to me to just have come over from Blighty. The Coldstream and Grenadiers also went through. \n\nSaw some great train loads of fresh meat go through for the French Army . To night the coy received 26 reinforcements most of them belonged to the 20th batt but on account of us being so weak they were sent here, they are a fine stamp.\n","5":" Road making again and nothing much to report.\n","6":" When we arrived home last night there was an order to the effect that there was to be a strict \n\nInspection of our iron rations for we were still supposed to have everything we were issued with previous to our last scrap and those who were without them had to give a suitable explanation for their shortages of course our explanations for their shortages, of course our explanations of used in action had to be accepted for the bombs sandbags extra ammunition and etc but there was no excuse for a certain number of men who were without rifle’s or equipment for everyone is supposed to have those necessaries, for without you cease to be of any use to a Batt and there was no excuse for these shortages some of them were too lazy to carry them away these were the men they were trying to find out the majority of these offenders were new men and they had\n\nto be brought up with round turn, will this parade was the fun of the world you should have seen those who were short running about looking for lost articles, however it ended up in a good number going before the Colonel and he gave them a pretty heavy punishment.\n\nThere was a pretty good excuse for B C and D Coys but none at all for A for they were not engaged in our last scrap. It was about time they put a stop to this sort of thing for there is altogether too much of it goes on after a scrap.\n\nThis morning we packed up and cleaned our billets out ready for morning and Mr Edgely run all over the place looking for anyone who was short of socks the socks he had he picked up laying about he is a good sort of chap and takes a great interest in the Coy\n\nJust before we marched off the","7":" Bde passed along the road on the way to the trenches, this delayed us for an hour or so for the road was absolutely packed and there was no room for us.\n\nAt last we got off, the roads had improved wonderfully and it was much better walking on the way down we passed some more guards all making their way to the line.\n\nWe were all very tired by the time we reached Dernacourt and here we billeted for the night, we also passed the 13 and 16th Battalions, they looked nice and fresh while we were dirty and filthy looking for we had neither razors nor towels since we left Mametz Wood.\n\nThere was a great scrambling for blankets tonight for ½ the labels were lost and all the Coys were claiming any bundle of blankets that could not be recognised\n\nThis morning we had a short little march to Bruyere, and our billets were right close to Bn Hqr’s. Here I had my first hair cut for some time I went up to the field hospital and got a cut there, a few days ago old Fritz dropped bombs on this little camp and killed 16 men and wounded as many more.\n","8":" Well we had a lovely night some of the boys got drunk and if they did not kick up a row well it was a caution first of all an argument started about reinforcements and origionals thus caused a fight and the Sergt Major shoved 2 of them in the clink not satisfied with this another argument started and thus soon developed into a fight an officer shoved one of them in, and much as I disliked it I had to put the other one in, even then another fellow\n\ncouldn’t keep his tongue quiet but abused everyone, but he was soon keeping the others company. I had 3 or 4 pretty bad characters in my platoon and they put up a pretty good stunt.\n\nThis evening part of the 29th Division passed through here (Innskillen’s) they had a very nice little string band with them and there was quite a crowd of us to see them go the majority of the British regiments have their bands with them and I think it is a good idea. A small party of prisoners passed through here this evening. Went to the pictures with a few more they had rather a nice little show it belongs to the R.F.A. and they run 2 shows per night, needless to say it is crowded both sittings for it is the only form of amusement for miles\n\nAround\n\nWe were out to-day route marching and drilling and in the afternoon we had a lecture by our officers. \n","9":" This morning we had a Batt parade and on it the Colonel gave us a good lecture, he went through all the causes that led up to the failure a little time back, he gave us a lot of advice about certain military matters he is a fine chap is our Colonel.\n\nAfter this we had some Battalion drill and then marched in, in the afternoon the Coy were out skirmishing. This evening I took a party of 20 men down on a fatigue to Bde Hqr’s the billets were in a dreadful state and no credit to the Batt who left it in such a state, thus, old clothes, bully beef and etc were all over the joint, and we had to clean it up, I got a couple of nice\n\nbombs out of it, which I intend to send home first chance I get.\n\nA fine batch of German prisoners passed through here this afternoon 400 of them, they were of all sorts and sizes some of them quite boys while others were oldish men, they looked very pale and yellowish on it, probably on account of living \nsome\n so long in their dugouts well under the ground they were part of a bunch gathered in at Beaumont Hamel, there are also great numbers of Germans working on the roads about here, some of them can speak English quite well we often used to have a yarn with them while the guards were out of the way, they wont let you talk to them if they can help it, the Germans seem quite satisfied to remain prisoners \n\nHave charge of Hqr’s guard tonight and have 5 prisoners to look after some of them bad characters, they are all waiting for Court Martials. \n","10":" Today is a beauty nice and sunny with never a cloud to be seen, but very cold, gives one a good appetite. \n\nLen has taken no 11 platoon away today on baggage guard so that means that we will be shifting tomorrow I expect. There was an issue of sheepskin gloves and socks this evening. \n","11":" Went to the pictures again last night missed the first sitting and had to wait for 2 hours in a long queque. This morning we packed up again and moved off again in motor cars.\n\nThere was also a band concert given by the 3rd Batt this morning and it was real good old Mac was the organiser of it.\n\nAs we were passing down the road we saw a lot of German working on the road and one of them stood to attention and saluted one of our officers gravely, the officer of course returned the compliment \n\nThe day was nice and sunny and we thoroughly enjoyed the ride, we passed down the high road leading to Baupaume, it is one of the National roads of France and is a beauty nice and wide and well made and it is as straight as a die for miles and miles and both sides of the road is lined with trees, now all \nlined\n stripped of their beautiful green leaves for the cold autumn winds have done their work and they look very gaunt and bare, but what a beautiful sight they are in the summer. \n\nThe cars that took us thus time were French again, we passed right through the outskirts of Amiens again and pulled up\n\nAt Fresulleu a small railway station from here we marched a mile or two to Friemont, we were supposed to be billeted here for some time but the Colonel was not satisfied with the place so he decided to move on tomorrow.\n","12":" My it was cold last night and only for the abundance of straw we would have nearly perished for during the night it snowed and heavily too, to a lot of the boys it was the first snow they had ever seen and just after daybreak we were out snowballing the Dr was one of the first out and we had a fine set to before breakfast but by jove it was cold on our hands.\n\nAfter breakfast the fun commenced we started off (C Coy) by attacking D. and there was a terrible bloodthirsty fight led by our officers who \n\nwere up to their neck in it. D Coy rushed out led by Capt Price and there was a fearful fight in the street, the French people seemed astonished, and dumbfounded at the antics of the mad Australians, however it ended up by C defeating D and chasing them back to their billets where they surrended after being pounded by snowballs till they were white all over, it was great fun, we then made it up to go and bomb B and A Coys out of their billets so C started off accompanied by D and if we did not give them a doing well it was a caution they tried to shut their doors and windows but we broke them open, and fairly smothered them with snow, officers and all got a terrible doing, one or two of them got nasty one fellow threw an axe at us and rifles and bayonets and such things\n\nflew out of the door of one particular joint pretty frequently so we beat a retreat and gathered up plenty of ammunition we then attacked them unawares and we taught them a severe lesson they will behave better next time. I think the majority of us were pretty well wet through by the time it finished \n\nI know I had enough snow down my neck to boil a billy of tea, but for all that it was the best bit of fun I have had for some considerable time. \n\nThis afternoon we saddled up again and off we trudged the road was very wet for the snow was beginning to melt, we passed through a fair sized village and started to climb a pretty steep hill this opened our lungs and you should have heard the boys coughing and spluttering it was a regular pipe opener for it is a good test with\n\nfull pack up, we had not far to walk however and soon reached our next village \"St Sauveur sur Somme\" a fair sized French village and much better than the one we had left, this village is built on both sides of the Somme and a small bridge connects the two, the Somme runs very fast here and they have a fine canal built on one side and on the other the railway runs, the town of Amiens is only 9 kilometres from here you can see her spires quite easily it is a great industrial district and factories are everywhere, there is a big electrical station quite close to us.\n\nBefore letting us into our billets the Capt gave the boys a small lecture and told them that if they did not behave themselves, they would be marched straight back to Friemont and nobody liked the idea of that.\n","13":" Parade this morning, we \"fell in\" close to our billets and marched out as a Coy to the parade ground where we formed up, after we had done a little Company drill, all men who wished to join the N.C.O.s class were called out and marched away under Mr Edgely, he is going to put them through their paces and pick some of them out for stripes, we are verry short at present especially our Coy.\n\nThe people of this town are bonzer such a difference to the French near our line, the old chap where we are camped swept our billet out as clean as anything put cinders in the little pot of water in front of our door, brought us water to wash with and drained the water from near the billet, they all seem\n\nthe same and are as friendly as anything, they will take you into their private houses and give you coffee and seem quite pleased to have you there. You have no idea of the variety of French people we come in contact with, and the further south you go the nicer they are, I have no time for the majority of those near the firing line. A big % of them I am sure are pro German.\n\nThis evening an old chap came along and we started yarning in our pidgin English and from what I could gather he is an old Crimean veterean he showed me his medals, he is 94 years old we gave him all the spare tobacco we could lay our hands on, and he was delighted, I expect that is all the luxury the poor old fellow has\n\nVery cold last night for we have only one blanket so far, the wagons appear to have got lost somewhere. Last night Jimmy Lynch, Jock Mackie Len and myself had a small dinner in one of the little café, just handy here.\n","14":" We had physical jerks this morning and I can tell you it was a great strain getting out so early. We had a route march this afternoon and a pretty rapid one too.\n\nOur blankets came this afternoon so we will have a comfortable night. Lovely day and nice and sunny, this seems to be a great farming district, the land round here is much lighter than other parts of France that I have been in and it simply swarms with partridges I suppose the war has a lot to do with it for all the\n\nmen are away and so they can breed at their own sweet will,I often long for a gun I would be in my glory then for a few hours the birds look nice and plump too a partridge looks about the size of a nice plump bronzewing and I believe they are beautiful to eat.\n\nYou ought to see the neat little threshing machines they have about here all in one piece they are driven by a motor which is built into the end of it, women do nearly all the work concerned with it and knock a fair bit of grain out. A lot of the boys were drunk last night and kicked up a nice row.\n","15":" We had some battalion drill this afternoon, it was the first I had done since leaving \"Mena\" however it soon came back, but having charge of a platoon you want to know your drill alright: or else you\n\ndo look a fool.\n\nAfter the Colonel had put us through our paces, each one of the Coy commanders had a cut, some of them made a proper mess of it, I reckon it is very interesting once you put your mind to it.\n\nThere was great excitement among the French people here today over the fall of Monaster, what fine little fighters those Servians are they seem to me to be in a different class to the Roumanians.\n","16":" Lindsay Graham went to an N.C.O. School today they a fine thing are these schools. \n\nThe Colonel and Adjutant went on leave to Blighty today lucky dogs. There has been a very strong rumour flying about here that all men who\n\nare in their wrong battalion are going to return to their proper units.\n\nThere was a pretty short issue of rations this morning I don’t know what was the cause of it. Fairly big mail in last night and a very welcome one to, seeing as how it is some time since we had our last tour. When we rose this morning it was very misty but it turned out a lovely day, the weather has been remarkably fine and mild of late nice sunny days and bright cold nights, the days though are very short it is practically dark at 6.30 in the morning when we rise and dark again at 4.30 so the nights are very long.\n\nHad to act Coy S.M. today in place of Jack Price, got on alright althow it was a bit strange.\n\nSaw a great flock of birds today they looked fine as they wheeled backwards and forwards across the sky. This evening all the platoons had to take their shortages.\n\nThere was some heavy firing last night which could be heard quite plainly down here although we are so far away from the line. Today Jock Mackie went to the Bombers, he had charge of them before he just suits the bombers and what old Jock does not know about bombs is not worth knowing.\n","17":" Was acting S.M. again today and I had rather a ticklish job on for the Batt. had to be on parade on account of the Court Martial which had to be read out to the whole Battalion, but I got on alright,\n\nafterwards a little battalion drill and to finish the afternoon we had a short march.\n\nI also got an officer for my platoon today Mr. Champion he is not a bad sort of a chap.\n","18":" Got my pass for Amiens this morning 1 man from each platoon we had to parade at the \"Orderly Room\" at (0845 military time) otherwise 8.45. We were marched to \"Ailly Sur Somme\" in the hope of catching a train but were just too late so we started out on foot to walk about three miles to where we could catch a train for Amiens.\n\nWe passed several big munitions factories just over the river and as we were passing a lot of them were coming out for breakfast, there\n\nare any amount of girls and women working in these factories a lot of them were eating their breakfast which consisted as far as I could see of dry bread and a small piece of chocolate, they are terrors for chocolate are the French, it is a part of the regular army ration and it is eaten like we would a piece of cheese a small piece of chocolate and a big mouthful of bread, all sorts of sizes work in the factories from the eldest to the youngest all find something to do.\n\nWe followed the Somme for some distance she is not a bad stream and pretty regular in its width where I saw it. I bet it is a pretty place in the summertime for it is lined with trees and good roads run\n\nalongside the stream and wind in and out among the trees.\n\nAfter walking about an hour we reached the Amiens barrier and here we had our passes examined by the military police, on most of these places there are stationed now both British and French police, and they examine the passes and passports of their own people who may be passing through they often grab a spy this way, a little further on we caught a train and travelled first class the fare was 1d. cheap enough for it was a fair distance and the compartments were well got up, the train took us right into the heart of Amiens and here we got off, she is a very fine town and modern in every respect both its trams and lightening system being good, the streets are rather\n\nnarrow but very clean, there are some fine business streets and shops there most of the shops are 5 storey high and well built, her streets at the present time are very gay with the military uniforms for the French have a very showy dress a nice blue with plenty of gold braid and red stripes and all French soldiers unlike the English wear their medals on their breast and they look alright, our kakhi uniform looks very commonplace against the blue of the French, but it has the pull over the French in the field\n\nThere are fine big shops who cater solely for the British in the matter of clothing and they have a very fine show of goods in their windows and show cases\n\nThere are some lovely buildings there. The Palace of Justice is one she is a very fine building but the principal one is of course the magnificient Catherdal. By Jove she is a beauty but very very old supposed to have been built by the Germans I don’t know how many years ago, there is a lot of Gothic archieteture in her and it is well worth a visit the sculpturing and carving are very fine and the best of it is all sandbagged up to protect it in case she should be bombed at any time, there are bonzer statues and engravings all over her outside as well as in, but what took my eye most was the beautiful and lovely tints of the stained glass windows they are splendid and such a size.\n\nMost of the good pictures have been removed I think for there are only a few left hanging in her, but nothing can rob these beautiful old churches of their lovlieness. It is funny sometimes making the French people in the shops understand what you want, I was in one trying to get some fountain pen ink and try as I would I could not get the girl to understand that I wanted a good ink and not the common stuff she was showing me but try as I would I could not think of the French word for \"better\" so at last I pulled my pen out and showed her, she disappeared and returned in a few minutes with about a score of fountain pens, I had to laugh, but eventually I found\n\nthe word and so got fixed up.\n\nI have picked the language up very badly myself but can generally make myself understood. I have never tried to learn it, but I don’t think it would be very hard, Len is pretty good he can \"parlez vous (parley voo) like an old woman he is quite at home with them.\n\nWe visited all the principal streets and buildings in Amiens and bought a fair number of things, they have a pretty good railway station. The tea rooms took my eye they are done up beautifully and prices are very reasonable, everything is of the very best in them including the china and things are spotlessly clean, the women dress very fine in fact as good as I have seen anywhere only there is never a single\n\npiece of colour catches the eye, the whole of France is mourning and the ladies dress entirely in black with a little white here and there, the widows wear weeds that nearly touch the ground, it brought back old memories I can tell you walking of your own sweet will up the brilliantly lighted streets of an evening, and really one wonders sometimes if the war will ever end it seems no closer the finish than it did in 1914.\n\nWe caught the train at 7 o’clock which brought us to Ailly about 9 kilometres, fare 1 1\/2 cheap enough once here we were soon home and fast asleep for we were tired.\n","19":" Light rain started to fall this morning so we only had\n\na short parade the men were taken into their different billets and the Sergts had to give a lecture to their men. I chose for mine \"Gas and its effects\" for I am fairly up on this subject, and can as the boys say give a bit of cheek on it.\n\nThis afternoon also I had to give my men another lecture this time I took for the lecture \"Outposts and the different ways of using them\" this lasted until it was time for the boys to fall in for their pay, then there was a rush for nearly everyone had been broke for nearly a week and money was very scarce.\n","20":" Most of the boys were drunk last night but they were very quiet for a wonder though one of them got mixed up with someone and landed\n\nhome with a beautiful black eye.\n\nHad to take a picquet out last night to see that none of the estaminets kept open after 8 o’clock, they shut strictly at 8 o'clock for you know all this part of France is under military laws and if an estaminet is found to contain soldiers after that time well they get severely punished and probably their licence taken from them, sometimes these picquets are called upon to arrest some of the more noisy ones who refuse to be out at 8 o'clock, some fun takes place then I can tell you, but it never pays them to resist and they are beginning to take a tumble.\n\nThere was a good argument last night in our billet as to who was the best soldier in our Coy the majority of them reckoned Len was and then\n\na great argument started I don’t know how it finished for I went to sleep. Out at drill this morning and I had a go at Coy drill the Major was there sizing everything up, but I only made about 2 mistakes which was not so bad, considering it was the first time I had ever had a go at so large a body of men.\n\nIt is very dull and raining slightly this afternoon.\n\nOur billet is starting to fall down and the boys upstairs have to move this afternoon or the old house will collapse and then every beam will be a \"Blighty\". There is a great scarcity of coal in France at the present time, I don’t know what the poor people will do when the real pinch of winter comes, the reason of this is plain of course but the principal causes of it can be\n\ntraced to 2 reasons, first of all the war is one for it paralizes all work and industries and secondly the Germans are in possession at the present time of the richest coalfields of France, I was talking tonight to an old gentleman who just before war broke out retired from a big Upholstering firm in Paris and he was telling me that he ordered 5 tons of coal 4 months ago for the poor people round this part and so far they had only delivered 1 ton to him, and he did not know when he would receive the balance, things are in a pretty bad state in many respects as regards the transport of goods, the military take all first calls on the lines and roads, and the traffic in this region is very heavy although they are\n\nduplicating the lines as fast as fast as possible. People in Australia \"thank Heaven\" do not understand what it is like to be deprived of fuel thanks to our warmer climate, the public supply of coal is cut down to the lowest possible limit and a good many other things besides, but still the French people never complain they are wonderfully patriotic, and will sacrifice everything so that they may win the war, that is the spirit of France still today.\n\nFor some reason or other we had no sugar in our tea today, this is the first time such a thing has happened to my memory since I have been in the Battalion. Went for a route march this afternoon we usually walk about 2 miles out and then pull up, and have a spell and a yarn for ½ an hour or so then fall in and march home again.\n\nThis evening a batch of details arrived and the S.M. being away I as senior Sergeant at the time had to take charge of them and get their particulars, most of them were returned Pozeries wounded. Sent a big parcel of curios home today.\n\nYesterday morning we were roused up at 3.30 supposed to be moving off and just as everyone was half dressed an order came round that the move for C and D Coy had been cancelled and all the boys fell back on their beds with a great sigh of relief when they heard this, the swearing stopped very suddenly,it hurts I can tell you to be roused out of a sound sleep and a warm bed and get up in the cold morning and shiver like a jelly till you get dressed, it turned out that the \"order\" only applied to A and B Coys and they had to\n\ncatch the cars at an early hour.\n","21":" The boys were a little noisy again last night, its wonderful how a little beer loosens some of their tongues and its dead funny the antics they get up to, one chap rushed in the billet in a terrible way, he was so knocked up that he could scarcely speak, he ran all the way from \"Archenves\" 4 kilometres away, reckoned he was chased by spirits and when he rushed in he blew the candle out in a jiffy, and sang out \"look out there after you\" another chap during the night fell out of an aeroplane in his dream and it so frightened him that he would not go to sleep again that night.\n\nThis morning was very misty and foggy but it turned out to be a beautiful day and the drilling was not so bad, though they kept us at it constantly for the \n\nwhole 3 hours.\n\nThe following is the way we cut the morning out, the first 15 minutes is spent in Company drill then we are formed up and the platoons march off indepentenly for physical exercise, ½ an hour is spent at this and the Sergts have to instruct, then fall in again and march off for bayonet fighting, rifle drill, squad drill, platoon drill, musketry instruction and sometimes \"open order work\" all of which the Sergeants have to instruct so you can see we have to know our work.\n\nSometimes they send a young NCO out and he has to drill the men under your supervision, and all while officers are looking on and watching for mistakes, about ¼ of an hour before our time is up we are formed up again and finish off with Coy drill and then march home.\n\nMr Edgely had a look round the platoons this morning he is very regimental and he roused a lot of the boys up for not having the mud cleaned off their equipment and puttees and he inspected their rifles minutely, he gave 4 of my men a good rousing up what for I don’t know, no more did the Captain, I think his liver must have been out of order this morning.\n\nWe got a nice issue this afternoon of \"bucksheesh\" from the \"Comforts Fund\" sardines, tinned peaches, matches, cigarettes, tobacco and several other things and there was a fair cut alround so to night we had a nice spread a most unusual thing with us for we don’t live too high I can tell you, though we nearly always have sufficient to eat, and I had a small luxury added to my tea 2 small fish which Len bought somewhere and gave them to me, the cooks fried\n\nthem and they were beautiful.\n\nThis morning the Dr held a short arm inspection out on the parade ground and he caught one of my platoon, this was the first one they have held since we first came to France.\n\nShort route march this afternoon we went a different track and struck the Somme and followed her down a little way, she is quite a nice stream at this point and runs very fast. Had to find Hqrs guard tonight.\n\nThere is a lot of English artillery billeted in the village tonight, they have just come from the Somme. A couple of them came into our billet tonight enquiring where they could buy a little bread, we gave them quite a stock of eatables, bread, sardines spare jam and a little butter which we had left over from tea.\n\nWe also gave them some cigarettes and matches and the poor fellows were grateful for these few things for they were tired and hungry and we all know they have very little money to spare, and another thing they have been very good to us on more than one occasion and we always try when possible to treat them well for we all know what it is like to be hungry and cold and there is a certain unwritten law among soldiers that to share out among your more unfortunate mates any tucker you may have you have no idea how soldiers stick to one another, while perhaps if the same men were together in civil life, they would not agree 5 minutes but while they are together in Kahki they stick solid, this is how it should be for it makes an Army all the more formidable.\n","22":" This morning broke with a very heavy \"Scotch mist\" hanging over all and when we got onto the parade ground it got worse I’m hanged if you could see more than 20 yards away and one had some difficulty when the platoons marched off to keep in touch with one another. I had a double platoon drilling this morning no 11 and 12 combined for Len was away with the Quarter Master drawing the Battalions rations so the 2 platoons were placed under me.\n\nThe Major was round again this morning and he passed the remark how well I drilled the double platoon, my chest filled out at this for it is a great complement, as the heads so very seldom pass favourable\n\nremarks, they only look for the faults and point them out to you.\n\nAn \"order\" came out last night that all men doing 2nd field punishment have to report \"battle order\" to the Corporal of the guard at 6.45 every morning and again at 4.30 5.30 and 6.30 so that will keep them busy and out of the estaminets. When we marched in we fell out and put our rifles and equipments away, and \"fell in\" again with our box helmets for they were to be dipped in \"Condy's\" the mouth pieces only, for you know when you are wearing these helmets there is a lot of saliva runs down in to the tube that brings the air from the filtering tank and this sort of thing as you know breeds disease, so every now and again the rubber mouth pieces are dipped for safety’s sake\n\nthe Q.M. had the crystals but I'm hanged if he could be found, most of us knew where he was down in a little quiet restaurant but no one let on so the parade had to be dismissed, the Q.M. turned up just after dinner and each platoon commander got the crystals off him and saw that all his men dipped their mouthpieces before going on the afternoon parade.\n\nThis afternoon there was an inspection of these same helmets by the Divisional gas experts but very few were found to be defective, after this was over there was a short route march which finished the day, but by the time we have tea it is generally dark. \n\nSome of these French people must bless the soldiers in one way when they are billeted in their buildings\n\nfor they get ½d. a head for every night and if straw is supplied that is extra it does not sound much but it soon runs into money and if any damage is done to the property the military have to pay for it, but its wonderful what little damage is done to properties, beyond breaking a few windows and pulling a bit of timber off here and there to light a fire, when troops are leaving the billets they have to get a \"character sheet\" signed by the French owners, and once only have we had \"bad\" put against our name and if ever an old swine wanted hanging well that old dog did for he was openly a pro German he used to say \"British no bon, Allemand bon\", we ought to have checked him out and dipped him in the pond a lot of the boys wanted to do it but the\n\nofficers would not allow it \n\nWe are having great trouble at the present time with our \"live stock\" how they breed it takes us all our time to keep them down, what a happy day it will be when the war is over and we get rid of these infernal wasters God how I hate them the crawling stinking rotten good for nothing dirty swines if I could only put a curse on them they would not live long.\n\nSome of the boys have been taking French leave to Amiens so today they were up before the Captain and got 10 days C.B. and 1 days pay stopped.\n\nI was looking through an old Bulletin tonight and I found this pretty little poem and so often have the same thoughts come to me when I used to watch the sunsets\n\nthat I thought I would put it in here \n\n\"Imbros\"\n\nOh misty isle of Imbros\n\nEncircled by blue seas\n\nArched over by an azure sky\n\nOn thee a weary man might lie\n\nO Gentle Isle of Imbros\n\nA man might take his ease.\n\nOh misty Isle of Imbros\n\nWe look across the blue \n\nSick men who have not ease not rest\n\nTurn wearily towards the west\n\nOh sunset isle of Imbros\n\nWe turn and look to you.\n\nOh misty isle of Imbros\n\nWe know that we must stay\n\nFor us, for us is no release\n\nSave only death or wounds or peace\n\nOh phantom isle of Imbros\n\nA thousand miles away.\n\n\"Anzac\"\n","23":" Everything half frozen this morning but so far I have not noticed the cold so much for it has been fairly dry.\n\nUsual morning parade the worst trouble drilling this weather is the cold on your hands, they turn almost blue.\n\nA lot British artillery passed through here this afternoon and nearly all new stuff too.\n\nRoute march again this afternoon and it resulted in a great argument of a challenge which led to a drilling competition, it happened this way, Capt Jacobs was taking us out and he marches too fast altogether about 140 to the minute, after we had gone a mile or so the boys began to flag and drop behind and soon the whole Coy was strung out in a most disgraceful way but still\n\nthe Capt kept going never looking back and there gradually appeared a gap between the Capt and myself which gradually widened until there was a good 80 yards separating us and the mob straggling out behind like a mob of sheep. It was too bad so I doubled forward to the Capt and told him that he was marching too fast for the men \"too fast\" he said, why can’t they keep up, I suppose it is the Coy who are so tired, no it is not the Coy I said for the Bombers are in front of us and we naturally are not going to pass them, however he said no more and I dropped back and got all the Bombers and the Coy blocked up and marching properly only at a steadier pace, about 300 yards further on the Capt halted his men and when we came up he started to lecture us and then an argument started with a big chap\n\nfrom the Bombers and myself, he started to talk about something that did not concern him in the slightest, however one thing led to another and the Bombers who by the way think they are some class at drilling threw out a challenge to drill any platoon in the Coy., before the words were hardly out of his mouth Len had accepted it, so he fell his platoon in & the Bombers done the same then Capt Jacobs stepped forward and said he would give 25 francs to the winning team and 3 judges were selected from the \"Machine gun section\" who were with us, they tossed and Jock Mackie won it. He elected to drill after no 11. So Len started off and the platoon went through their drill and done it well, real well considering it was sprung on them by surprise\n\nthey made one small blunder in the fixing bayonets but otherwise it was well done, then the Bombers went through theirs and they made several bloomers. After the teams had finished we all crowded around the judges to hear the verdict and they gave it to No 11 everyone in the Coy was as pleased as punch over it, and so ended a great argument, there is great rivalry among the platoons and Bombers this of course creates a great competitive spirit and is a good thing for it makes men take an interest in their work and this is everything.\n\nA small mail in tonight but only got a card out of it so far.\n","24":" Reveille at 5.30 this morning for the \"Transport\" were moving off early and we rose early so as we could have a hot breakfast before\n\nthe \"cookers pulled out. I had charge of the baggage guard which consisted of 12 men so we had to look alive and get packed up.\n\nI don’t know how many kilometres we travelled today a fair number for we were on the move pretty constantly from 7.30 till 2 o’clock in the afternoon they were pulled in at a dirty little village (\"La Houssaye\") one village we passed through today was a pattern of cleanliness the streets were as clean as a newly swept floor and the houses were nice and trim everything looked so nice. I expect seeing as how Army Hqr’s are here accounts for it the majority of the sentries were mounted and everything done in style.\n\nPassed a lot more Germans road-making and some of them looked very young.\n","25":" Today we enter upon the last month of the year and still the war seems no nearer finishing, surely by the time next December comes round it will all be over and we will be back in sunny Australia.\n\nI had a rag-time guard on last night they were mounted from 10 o’clock that night till 4 in the morning just as well there was no \"visiting rounds\" or there would have been trouble\n\nWe had breakfast about 8 o’clock and moved off at 9 and passed through Heilly a fair sized little town with our Brigade Hqr’s in it, just before reaching this village we all had to pull our packs off the \"limbers\" and march through the town full \"marching order\", after we had cleared Heilly we threw them on the \"limbers\" again. It was a very short march and we soon reached our destination (Ribemout).\n\nAfter the transports had unhooked we had to unload the limbers and a number of tins of sardines fell to us as spoils of war, its an alright game this carrying about such eatables as sardines, fruit, milk and its wonderful how often a man will stumble and drop them end first on the ground and if that isn’t enough to bust it open well you can always give a hand.\n\nAbout 5 o’clock the Coy arrived and there was a great bustle to get them billeted after that we had our tea, a good few details also turned up including Bill Hunt and Bluey Dimmock, the latter chap was wounded badly at Lone Pine and was afterwards sent to the 53rd and from there he was brought back to his original Battalion for this latest rule affects him and so he was enabled to get back, he is one of the old original H Coy and is one of the chaps who is taken\n\nwith me in that photograph on the camels which we had taken in Egypt.\n\nSaw Bill Ferguson tonight and had a good long yarn with him.\n\nIt is now about 8 o’clock and the Sergt Major has just come round collecting all the men he can find for a piquet, and aren't the boys going crook, for most of them are in bed and the night is very cold and frosty. \n","26":" This morning I collected all the details who came in late last night and took them and 14 of the bombers on to a job in the town 40 men in all, later I divided them into 4 working parties and each one with a limber and 2 horses, 2 parties I sent clearing up the streets, scavanging , the others I put on to a job near the old church cleaning up some surplus muck, it was good shovelling for the frost held it well together, there was a heavy frost this morning and thick ice\n\nThis afternoon while I was waiting for the carts to come down to the dump I went into a big woollen mill there are nearly all young girls and women who are working in it. I noticed most of the machinery was made in Alsace, nearly all the wool from what I could see of it was very fine and carded.\n\nPay day again and some of the boys are broke already, gambling as usual. Was down at the railway station early this morning there were hundreds of Germans unloading trucks.\n","27":" Church parade this morning and the first one we have been on for a long time the 3rd Batt had their band out and it was very poor especially the cornets.\n\nWe all got our 2nd blanket again last and by heavens it was wanted for you can’t sleep with one blanket\n\nthe cold at night time is so intence. It seems funny to me over here for nearly every night we have a severe frost and the ground remains hard all day long and the ice never melts, yet the sun never shines and the sky remains gloomy and overcast and if you pour water about it soon freezes, so you can guess it is cold, eh what.\n\nYesterday afternoon one of my fatigue parties dug up an old coffin and the remains of a woman were in it we knew, it was a woman for she had long red hair and it was in a good state of preservation a rather gruesome discovery wasn’t it, we reported it to the military and I don’t know what steps are taken we must have been digging in an old graveyard everything points to it for there is an old church about 50 yards away.\n\nThis afternoon we all went for a hot bath down to Heilly, about 2 kilometres\n\naway, there was a very poor supply of water but what there was of it was good, how we enjoyed it, it was the first hot bath we have had for a long time and it gave us a good chance to get rid of a few of our \"chats\" for we were issued with clean underclothes and shirts, socks how nice we felt, it was nearly dark when we finished and Capt Jacobs nearly ran home. I know I had my work cut out to keep up for I had my putties on too tight.\n\nReceived quite a budget of letters from this last mail today, what a suck in the Referendum was for those chaps who rushed into camp at the 11th hour. I'll bet they are moaning and groaning over their stiff luck.\n\nThere was a bit of fun here tonight Capt Jacobs was paying out a few extra francs to some of the men who were\n\nalready broke, the Capt refused to give him as much as he wanted and the chap insulted him, Capt refused to give him in charge, but he is going to make him apologise in writing and he is going to put it through \"Battalion Orders\" that will hurt more than all the fines, for everyone reads these orders sometimes they are read out on parade but generally they are hung up for all to see.\n\nAm glad to hear that Steve is getting along so well once he gets a start he is right.\n","28":" Parade again this morning and as nearly all 11 and 12 platoons were on duty of some sort or other, the 2 platoons were combined and we marched out to the drill ground what a time we had for the Captains lines must have been out of order and didn’t he roar on us especially when we were doing Coy drill, Bill Hunt and I had a nice time\n\nbut no one was killed and we scraped through alright.\n\nSaw General Birdwood pass in a car this morning going towards Albert. This afternoon we went for a route march and they were very particular about the step being kept correctly however the Battalion marched well.\n\nThe other day one of our chaps asked his officer if he could fall out for a while the officer said yes, about ½ an hour afterwards they went to look for him and found him dead. Frozen to death they reckon, the Dr reckons he must have been pretty low in health and had not sufficient vitality to fight it off, so he just laid down and died stiff wasn’t he, but Ill bet before the winter is over there will many a familiar case for I know myself once you get to a certain state\n\nyou don’t give a curse what comes or goes and you feel quite comfortable but you have not the energy to stir.\n\nThis evening the Dr lectured all N.C.O.s on \"trench feet\" and how to prevent it among your men,\"trench feet\" is a very serious thing, your feet swell up to an enormous size and you can't walk, this is caused by several things, such as boots too tight poor circulation of the blood caused by over fatigue, no hot meals, wet feet and on top of all this the freezing cold, it also affects your hands in the same way, how to combat this is every officers and N.C.O.'s duty and the platoon Sergeant has to see that every man in his charge changes his socks as often as possible, takes off his boots at every opportunity, and rub his feet briskly, we also have to see that every man uses the \"whale oil\" which is supplied to us and rubs it\n\nwell into their feet, this whale oil is a very fine thing, though it is inclined to make your feet soft for marching, by this you can see the Sergeants have no easy time while in the trenches for this is only one of the things we have to look to.\n\nLen has charge of Brigade Hqrs guard to night a nice little job.\n","29":" The frosty weather broke last night and a little shower of rain fell but this morning when we marched out she looked alright, instead of physical jerks they introduced the football instead and the whole mob got onto it and I can tell you we had some fun. After this we had some Coy drill and then extended order work. About 10.45 a heavy shower of rain came on and we marched home, among this shower there was mixed a lot of snow and wasn't it cold.\n\nThis afternoon we went for a short route march and after this we had a kit inspection for we are leaving tomorrow I think. There is a strong rumour running round here that the Divisional Medical Major resigned because the authorities would not take no notice of his report on the health condition of the Division, he reckoned the Ist Div. want a long spell for they are worn out and I think he is right.\n\nI was surprised on getting the mail from home to learn that Stan had left Tasmania and is probably in England . I expect we will soon see him at any rate I am looking forward to the time though I hope they keep him in England for some time yet.\n\nHad a great issue of clothing today a shirt for every man and a pair of warm underpants besides other things\n","30":" Reveille at 6 0clock this morning for we were moving and consequently things are very busy especially for me, for the Sergeant of a platoon is responsible for everything and there is quite a lot to do, the first thing is to get the men out of bed and these cold mornings they naturally don't like stirring, after they are up I have to see that all blankets are rolled in bundles of 10 and that they are properly labelled and then carried round to the place where the transport picks them up, this has to be done by a certain time then the rations have to be drawn and I have to distribute them to the section commanders, who in turn dish it out to their men equally.\n\nAfter breakfast the billets have to be cleaned spick and span and all rubbish carried away to the\n\nincinerator, this last thing is a most important duty and the Ist Battalion has made it a point of honour to leave all billets cleaner than they found them so you can guess they are pretty clean when we finish with them, just before moving off the officers and Dr inspect the billets and if they are not up to standard well the Sergeant gets a row.\n\nAfter this we fall the men in and inspect them, see that all packs are packed properly and are uniform and that they are short of nothing, after this we call the roll, number off and we are ready for marching off. \n\nFrom Ribemont to our present quarters is a march of about 10 miles and quite far enough with full packs up. Tonight we are comfortably quartered some difference to our last time in here we are sleeping in big semicircular\n\nhuts, built up off the ground, pine floored and lined with windows in both ends they are nice and roomy and very warm and hold about 30 men, these huts are built away back behind the lines and are brought up here in sections, and so put up rapidly the whole outside of these huts are made of steel sheets ribbed like galvanised iron, the huts at present are surrounded by a sea of mud about a foot deep and nice and sticky.\n\nAt 3 o\"clock this afternoon we had an issue of whale oil and I had to see that every man used it. \n\nJust between Dernacourt and Bruyere I counted today no less than 47 railway engines, that will give you an idea of the traffic there is on on these lines that feed just a small portion of the Somme front and most of this here has been built\n\nsince the push started.\n\nSince I have been in France I have taken particular notice of the Germans I have seen, and they have been quite a number and one thing has struck me forcibly and that is the peculiar nose that the majority have, the nose is very thin at the bridge and as it goes out it gets broad and thick and the nostrils stand out prominently, and in nearly every case the nose tilts upwards and then again the face seems to recede from the eyebrows to the mouth which gives their face a milkdished look, although we are descended in a way from certain peoples of Germany there is a great difference today, in the features of the Britisher and the Bosche.\n","31":" Did not get too much sleep last night, after the nice soft bunks we had in our last billet, the hard floor seemed much out of place.\n\nHad a good rum issue this morning and after breakfast C and D Coy’s were all at work cleaning the mud from round the huts and carrying bricks and stone to make a dry roadway for us to walk on. I kept myself warm by the use of the old pick, picking out bricks for the boys to carry, we are getting our bricks and stone from the ruins of a part of Fricourt, you would never know that once there had been a a French village here for everything is levelled with the ground and the Germans have made big dugouts many feet deep under most of the houses using the bricks etc. in the building. \n\nWe are now turning these dugouts to our own use the town Mayor of Mametz has his residence in one of them, some of them are fitted up nicely.\n","32":" On a different fatigue today had 20 men with picks and shovels\n\nloading limbers and carting it to a place where we are making horse lines for the transport, but it seems to me a farce putting this soft limestone down on top of mud a foot deep for it will only make a bog of the lot, the mud should be cleared off first.\n\nWe have a band right close to us and it is bonzer to hear it playing it cheers one up so, though we are having a pretty fair time here so far. \n\nThis afternoon 50 of our Coy, went away for a weeks fatigue.\n\nHad another row with the S.M. this afternoon he is well hated by the whole Coy, and every morning when he comes along to wake the Sergts up all the boys start singing out at him for he has a great habit of hanging round the door and yapping like a kid \"right away\" and so on, so when\n\nhe makes his appearance he is greeted with cries of \"right away\" Tumberumba (where he belongs) and a few more choice calls, this sort of chaff maddens him and the boys know it, he started complaining to me about it, but got no sympathy from this child.\n\nCollected all the dirty socks this afternoon and got a clean issue, how nice it is to have dry socks when we come in. I heard tonight that Colonel Hean got wounded seriously a couple of nights ago in the head he was out in No Mans Land when a sniper got him, I am not surprised at him getting hit though he has dodged it a long while, for he was always poking his head over, to have a look for himself, at any rate he is the best Colonel this battalion has ever had, and was a brave and fear\n\nless man and I hope he is soon alright again.\n\nHad a most enjoyable evening, Len McKay, Dimmock, and I have been playing \"Bridge\" and our big dugout was nice and warm for we had a good coal fire going, and they do throw heat out.\n","33":" What do you think they had the neck this morning to bring us out to drill and it was drizzling rain and everything sopping wet, we marched out about a mile and then took shelter in an old German truck we stopped here for ½ an hour or so then our officers decided to march us back to camp, the rest of the morning was spent carrying stone and bricks building up the paths round the huts needless to say they were a willing lot of workers; I don’t think. After dinner we were at the same \n\ngame and they worked a little better.\n\nWhat do you think of this for stiff luck last night when all the men for leave were waiting to catch the train for \"Blighty\" in Albert I’m hanged if the squareheads didn’t drop a big shell right into the mob of them killing 8 and wounding 24 more and all Australians.\n\nThough Albert is fast getting rebuilt and the people are flocking back, she is still within range of the Germans big guns and they keep on dropping shells round her in an aimless sort of way on the off chance of catching someone or something.\n\nOur big guns are very active to night and their reports make the huts tremble. It is raining steadily this evening but shows signs of breaking.\n\nLen has been exempt from all duty since coming into this camp on \n\naccount of his sore heel which is septic.\n\nI believe, got it from marching in bad boots.\n\nHave been issued with large quantities of immature cheese lately, which is a great waste for no one scarcely eats it and it is thrown away, you can’t beat the army for waste and yet in some things they are terribly closefisted\n","34":" Fatigue again this morning carting bricks and stone and we also had to dig a drain through some muddy ground. What do you think, well this afternoon I had to take all the men up I could find and go and chuck all the mud which we carted on to the horse lines the other day away on to one side. I knew very well when we put it there it was useless, you should hsve seen it over a foot deep and it would bog a duck. They have been issuing fair sized lots of rum lately don’t the boys like it.\n","35":" Had all the men I could find out this morning, we were getting a lot of old barb wire from Fritz’s entanglements and also French \"concertina\" wire and stakes this is to be used for practising so that when we go out wiring we will understand our work. This afternoon we had a go at a new type of entanglement that Brigade had recommended as being effective and quick, the Brigadier, Major and a few more of the heads were there to see it carried out but in my opinion it is a rank failure for men could creep through it quite easily. The plan of it was something like this , every 7 or 8ft we screwed one of the long steel uprights into the ground, they are shaped like a cork screw and are very fine things, opposite these steel stakes we drove a wooden stake about 4ft long into the ground\n\nthe front facing the enemy, then pegs were driven 7ft away from the screws while the back of the entanglement which would be facing the defenders the pegs were 9ft away from the centre the reason of this they reckoned was that if the enemy threw scaling ladders over the front he would have 9ft to jump to clear himself of the wire and this he couldn’t do when all the wires were connected up, which they are from stake to stake. I don’t know what kind of a report they sent in but I don’t think it would be favourable.\n\nAbout 2 o’clock last night there was an air raid some of the bombs dropped quite close to us and shook the huts like a jelly, they are exciting things I can tell you these air raids, however they done very little damage and were soon hunted off.\n\nWhat a cunning old dodger is Fritz he has a new sort of bomb which he drops sometimes and dosn’t explode for 12 hours or so after, they have some sort of mechanism which delays the explosion and sometimes hours after a raid has taken place and everything is nice and quiet these bombs start to go off. I believe there were some of them went off in Albert the other day and caused quite a sensation.\n\nSickness is very plentiful just now among the Australians and no wonder for the majority are completely run down and want a spell badly including myself.\n\nI saw General Birdwood go past in a car today.\n\nD Coy have moved further up towards the line, there are only a handful of us left down here now and we are expecting to move any day.\n\nReceived 2 fine big parcels to night one from N.S.W. and the other from home.\n","36":" Heavy rain fell last night, when we got up this morning it was snowing heavily but there was a lot of rain falling at the same time so it did not lay long. \n\nHad the usual digging fatigue this morning and we done some good work though it was cold and wet. 2 more of my men are going to hospital shortly I think and neither of them have seen a firing line as yet.\n\nA funny little incident happened this evening we were all sitting round a nice hot coal fire cracking jokes and chaffing one another for we had just finished our tea when the door opened and Charlie Harrison stepped in and I said jokingly \"hands in your pockets\" \n\nsome one else said \"stand by your packs\", and etc, this is how a chap is generally greeted when he comes into someoneselse's hut, but the funny part of it was that the Dr was just behind Charlie coming in to have a look at my sick men, everyone grinned when the Dr said, \"whats the matter\" for he heard our remarks Ill bet he laughed when he got out. \n\nA lot of the officers are making it a welter on the whisky lately, if I had my way I’d straighten these jokers up I’ll guarantee, I have no time for a drunken officer and I have told a few of them so, a lot of people think an officer is just IT but in a lot of cases they are sadly mistaken for some of them are wasters and I should be sorry to see any sister or lady friend of mine walking \n\nabout with some officers I know and there again there are some very fine fellows and I think our Battalion has been very lucky in this respect thanks chiefly to Colonel Hean, he would stand no nonsense and was a teetotaller we are all sorry he has left the Batt.\n","37":" Had charge of a big working party today and on a pretty difficult job, we are making a good path from the huts to the latrines and it has to be carried through mud and water 2ft deep in some places and there are some difficult drains to take it over, I had all the mud and slush shovelled to one side then set a party to dig a good drain on either sides just leaving a space wide enough for the path, I had it all marked out in sections and we done a section at a time, after the \n\ndraining was completed. I got the party on carrying bricks and stones and I can tell you we made a good job of it, the officers reckoned it was a fine piece of work and so it was, this is where country chaps score, they have had the experience and know how to handle things in a practical way. \n\nThere was a heavy and short bombardment last night. I believe the 2nd Bde hopped over and took a position.\n","38":" Was sound asleep last night when the S.M. rushed in at 1 o’clock and woke us up, I wondered what on earth was the matter, but it turned out that we would be moving off at 6 in the morning and he fool like had to wake us up and let us know so we rose at 4.30 had our breakfast and moved off in the dark.\n\nWe lobbed at our destination \"Adelaide Camp\" just as D Coy were moving out on fatigue and hang me after we had walked a fair distance and struggled through the mud knee deep if we did not have to dump our packs, grab a shovel and follow on after D, how the boys cursed and swore, but after we had got on to our job it was not so bad, the work we had to do was to finish sinking a 6ft trench for carrying cables, after it was down the right depth we threw a layer of soft earth on the bottom so as not to damage the cable which was a leaden one and each cable contained 6 wires, the trench was 440 yards in length and carried 6 cables, after the cables were laid, more soft earth was \n\nthrown over them and then a ft of anything to fill in with.\n\nRight close to here there were two observation balloons and they were going up and down all day, the man in the basket is connected with a telephone to those on the ground and when he sees anything he lets them know, these balloons are wound up and down by a little appliance on the back of a motor, they reckon they have an average strain of 4 cwt but the higher they go the less pull they have, they also had a few oxygen cylinders for their balloons these cylinders are about 7ft long and 6in through. \n\nWhat do you think of this; Brigade issued an order this morning to the effect that there were too many going to the hospital and that sick \n\nparade would have to be cut down for it caused a lot of uneasiness as to the health of the troops that’s about as good as ever I heard as if men could help it, anyhow it is not a very likely thing that this order will be taken to heart. \n\nThere is a lot of talk about the latest German peace proposals but every seems to think that they wont be accepted by the allies.\n\nThis evening after we had finished work Bluey Dimock and myself went for a paddle through the mud down to the railway for some coal you should the boys rush the engine drivers for coal, and they rarely refuse, I’ll bet they have to fill their bunkers every trip, the coal we got tonight was a splendid burner and gave out great heat\n\nand tonight we had coffee for supper and went to bed thoroughly dried.\n\nTonight old Fritzie dropped some very heavy shells quite close to us but I don’t think he done any damage.\n\nSaw a great quantity of German \"aerial torpedoes\" they are a huge bomb and are very dangerous. \n","39":" We (as you can see ink is plentiful) so far we have not fared to well with D Coy our rations being very scanty, this morning a small issue of bread and a box of matches was our share.\n\nTo day we have been working making a new road to the camp and not before it is wanted for the road is in a most disgraceful state 2 waggons were pulled in halves this morning and there they stand nearly floating in the stuff. \n\nPretty heavy gunfire tonight our heavies and howitzers are engaged.\n\nThe weather is very miserable, dull gloomy skies with a few scattered showers during the day and at night it rains fairly constant but thank goodness we have a dry bed and a good fire when the days work is finished. I pity the poor devils in the firing line where we will be shortly I expect.\n","40":" Out on the road job again this morning and it was real rotten for the sleepers were covered with mud and the men naturally did not like handling them, they were dodging away at every opportunity and it was over this that I had a few words with one of D Coy’s officers. I was standing down at the end of the road supervising the laying\n\nof the timber, when he came up to me and asked me what my particular job was (he thought I was a private for I had an oilsheet over my shoulders) I told him I was in charge of C Coy’s men who were working on the job, he seemed a little taken aback at this, at any rate he said where are your men, I flared up at this for he said it in such an insulting tone, however I tried to keep my rising temper down and told him that all my men were on the job which was more than his were, for most of D Coy had sneaked off to their huts to get out of the cold drizzling rain which was falling with a little extra snow chucked in to keep it company, this left the bulk of the work on my mens hands and it was not going on fast enough for him, well he said I seem to\n\nbe the only one who is keeping an eye on the men, this made me wild and we had a pretty heated argument I can tell you however at \"knock off\" time he was as friendly as anything with me. I had a row over a fatigue party one night at Ypres with this same joker.\n\nOld Fritz sent over 2 big shells today (12 inch) one lobbed right on the edge of the road just missing a traction engine and a motor lorry, it dug a hole in the ground easily 10 ft deep and 18 across it and as round as a cup she was a love, the other was rather more exciting for I’ll swear it did not miss our hut by more than a foot it landed right in the drain in front of our joint and by good luck it never exploded, if it had it would have blown our hut to pieces, its just as well \n\nFritz can't see where he is landing his shells, or we would have a lively time, he lets these big shells go at random chancing where they will fall.\n\nPay this morning and I had to act as Orderly Room clerk. \n","41":" At the road again today and the old General kept on coming round rousing the life out of the \"Tommy\" Engineer Officers who were in charge of the job, they did not seem to know what to do, hang me if they did, at last the old General done his block over them and blew them up a treat.\n\n\"Come on my Australian laddies,\" he sings out \"come and show them how you built your roads in Australia\" and with this bit of soft soap the boys set to it and didn't they work, I reckon we done more in the hour he was there than all the rest of the day simply\n\nbecause he knew his work, we will pretty well finish it tomorrow I think and by jove it is needed, the scene around where we are building this road puts one in mind of the work after the \"tornado\" has swept through a town broken vehicles are bogged to the \"body\" some with the shafts pulled out of them, others in halves, more you will see capsized and nearly out of sight in the mud and spread all over the surface of this ocean of mud and slush, is to be seen heaps of timber, galvanized iron, bags hay and etc which has been chucked out to lighten the bogged teams. I pity the poor horses and mules for they are worked nearly to death and the only time they lay down is when they fall from sheer exhaustion, and then often they are too weak to rise again.\n\nI laughed today until I nearly dropped\n\nat the antics and language of some Tommies who were bogged, the majority of them knew as much about horses or mules as a pig does of flying.\n\nReceived our xmas parcels tonight from the \"Citizens War Chest\" they were nearly all the same and contained tobacco, chewing gum, laces, notepaper, lanoline and a few more little things.\n\nHave a very sore chest tonight and it hurts every time I cough, I have taken a few drops of eucalyptus. Every day fresh \"latrines\" keep on coming to light, the latest is, that all Australian troops have to be off the Somme by the","42":" and better still that New Zealand threatens to withdraw her troops if they do not receive better treatment, they are dead rough some of these rumours we get and very funny. \n\n \n\nA terrific cannonade broke out from our guns early tonight they did shot it at them, perhaps there was a hop over. \n\n18th Very cold last night and a heavy frost this morning. Did not quite finish our road today though it was far enough advanced for traffic to pass over.\n\nThe food today was very crook and I called our officer Mr Champion down to have a look at it, he is going to kick up a row over it. Got a fine big parcel from Mr Duke today she was a bonzer and we had a fine tuck in and it came in very handy. All the talk these last couple of days has been about the French victory at Verdun and the German peace proposals there is a pretty strong opinion that peace will come within a month or two but I am hanged if I can see how\n\nit is possible, for we are out to beat them and they are a long way from that as yet, though I'm sure they are feeling the pinch bodily, and we have the upper hand, theres no one would be more pleased than I if it finished shortly but now we have fought this long I would like to see them beaten properly and for good. There has been a fair number of trench feet passing through here, some of them very bad quite black.\n\n19th Same old job again but one good thing the hard frost of last night made the mud as hard as a metalled road, when I went out to have a wash this morning I found all the taps frozen so I had to go and break an inch of ice in a shell hole and duck into that.\n\nAbout 2 o’clock this afternoon \n\nit started to snow lightly at first but it soon fell heavily, but it made no difference to us we worked all through it, the ground soon was quite white and the men looked so comical walking about in their snowy dress, but cold as snow is it is much better than rain. \n\nTonight I got another parcel this time from Jean Crawford of \"Yoorooga\". I have been very lucky with parcels lately. I heard today that the 1st and 2nd Div. are in for another hop over in 3 weeks they are making the pace a cracker with our Div. alright. \n\nThe Germans sent a lot of heavy shells over today but none landed near us fortunately. \n","43":" Very hard frost this morning and the ground was quite white with the snow which had fallen yesterday.\n\nSpent the greater part of my time today helping the Tommies out with their bogged teams, they are absolutely no class for the Australians as far as horses go, as soon as ever a Tommy gets stuck the first thing he does is to lay into his horses for all he is worth and in 9 cases out of 10 it is over the horses head that he brings his whip. I don’t like skiting but I think I opened a few of their eyes today as far as handling horses and bogged teams go.\n\nI saw a fine piece of horsemanship this afternoon on the part of a few Australians, they had a couple of G.S. waggons heavily laden with corn and chaff for some of the horses just here and they had to come through some of the awfullest ground imaginable, up to the mules\n\n shoulders and the body of the wagon was dragging on the mud, they hitched 22 mules up and dragged the waggons out one at a time, even then they could only move a few feet at a time if they had been Tommies I’ll guarantee they would have been there till the end of the war. \n\nCapt Price came on the bounce again this evening, he has got a nice set on us, I know what it is all over \"the tucker\" for Mr Champion and myself kicked up a row over it the other day and he is going to make our stay as uncomfortable as possible. \n\nThere has been a most terrific bombardment all day long on our right the \"Frenchies\" have been tearing it into them and tonight I hear that the French have taken Deromse with a lot of prisoners I hope its true. \n\nthey also say that the 3rd Division have been in action at Armentieres.\n\nA lot of details arrived tonight for D Coy. \n\nHad quite a welcome mail tonight 7 letters 5 papers and 2 parcels, there are not many things a chap looks forward to in the army but mail is always the principal one. \n\n21st A fairly warm night and the land thawed and once again we are among the mud and slush, had all my men digging a road through the huts and just about 11 o’clock it started to rain fairly heavy, but they would not knock us off but made the mob go and get their waterproofs how they swore. \n\nA big squadron of our aeroplanes flew over towards the German lines this morning.\n\nShortly after dinner today there was a terrific explosion up north from here, \"strikes me a big ammunition dump went up, the reports resembled a prolonged peal of thunder, or a sudden burst of artillery fire. \n\n\"Trench feet\" is getting very serious among some of our Div.’s, today 12 men from the 5th Div. were admitted to the \"clearing station\" and their feet were amputated at once. \n\nSaw some of the old original 1st Bn. today they had just come back from the trenches and tonight ther (the 53rd) are camping in \"Adelaide\". \n\nThe other night 2 of the","44":" Bn. chaps got hold of some bucksheesh rum, this apparently fired their courage, for what should they do but get hold of 20 bombs each and crawl over to Fritzs trenches and shot the whole\n\nlot in, by some miracle they both got back though badly wounded, not bad was it a \"two man raid\" and successful at that.\n","45":" Finished clearing all the muck away from our road and after that had to carry sleepers from the waggons to the head of the road. \n\nActually saw some brilliant sunshine this afternoon and we all were remarking on it for it so rare at this time of the year and it reminded us of our own sunny land so far away.\n\nJock Mackie came up tonight he has been on leave to England. Just lately wherever I go I seem to get into an argument with officers. This afternoon I went into our hut and there were about half a dozen officers of the 57th and a few of their lousy batmen, they were taking \n\nit over from us and we had not quite finished getting our gear out, we had cleaned nearly all the dirt out and if they had waited a few minutes longer we would have finished it. However when I went in these officers started to sling off and their cold feet batmen kept on putting their spoke in, I shut these detestable batmen up with a couple of sarcastic remarks and then I had a go at the heads and I think I held my own with them, so help me bob there was not scarcely a handful of dirt left and these rotters were kicking up a stink over it. \n","46":" About 11 o’clock last night Capt Price came round and woke us up and told us we would be moving in the morning and that we would be rejoining our Company again, I could hardly keep myself from cheering\n\nwhen he told us, for we have had a rotten time here, they have shoved the dirt into us properly, however we packed up, & sent our blankets out, didn't Capt. Price roar, reckoned we were late, & to end up with put Jock Mackie under \"open arrest\" the rotten dog, but I'll bet we beat him when the trial comes round, what a \"down\" he has on poor old C. Coy. can't make out why he did sock me for I'm sure he has only been waiting for a chance to show his dirty spite. We had about 4 miles to walk to \"Bernafay Wood\" our present camp it was rotten marching for the roads are crowded with vehicles & horses & we have to thread our way in & out among them \"single file\" all the way & the roads up this way are swimming\n\nwith water & very rough.\n\n4 days ago a big shell lobbed fair on one of the big huts & blew it to smithereens luckily no one was in it, but yesterday things were not so fortunate, a shell landed in another hut which was crowded & every man was killed 30 in all. Just here they have a wet canteen & sell English beer & stout 1 franc a pint I think they charge for it.\n\nI have been very crook the last 3 or 4 days, every bone in my body aches & I have a pet of a cold, but tonight I feel a little better, perhaps it is because we are back among our own Coy. The Sergeants are sleeping away from the men up here, we have a small hut or rather 2 of them to ourselves.\n\nIt has been very windy & showery today, but no ways cold, but the ground thawing has made it very sloppy.\n\nA lot of details have joined since I saw the Coy. last including, Bellchambers & Freddie Turner, both of these are excellent chaps & are \"origionals\". Had the first good square meal I have had for some time today, a bit of a contrast to D. Coy.\n","47":" Very windy last night & it nearly blew our little shanty down, & old Fritz kept us thinking for he was dropping an odd shell or two nearly the whole night through.\n\nWe were badly in want of a fire so Jock Mackie & I took a couple of sandbags each & went down the railway line till we struck a party of Australians who were unloading a truck of coal & carrying it over to a small engine which some Tommies were working so over we goes & asks one of\n\nthe Tommies for some but they were not game to let it go, so we went back over to the truck & asked our fellows for some & they threw us 4 sandbags full down, & we staggered back with a good load, I gave one of the chaps 5 Francs for chucking it down.\n\nThis morning Mr. Edgely came round & wanted to know how I was feeling. I told him not too good, so he said \"well you had better take it easy for the next 3 or 4 days & give yourself a chance to get over it.\n","48":" & my 3rd away from Australia, one in Cairo, one on the sea coming back to Egypt after the evacuation of Gallopoli & this time the scene is laid in France for me at any rate it has not been a very pleasant one\n\nthough tonight I am feeling very much better, but last night I felt absolutely rotten, & so I went to bed early, but could get very little rest, for the boys were celebrating Xmas Eve in our hut, & were keeping their spirits up with cocoa & rum more rum than cocoa I should judge by the row they were kicking up, these were the names of a few of them Freddic Turner, our C.S.M. Jack Hayes (Q.M.) Sgts. Price, Mackie & Bellchambers, Wilson & Cpls. Tin & Bill Bradley, all decent chaps, & songs & chorouses were going round all the evening but about 1O O'clock the performance showed signs of degenerating for the rum was beginning to tell & things were getting boisterous\n\n but you should have seen them an hour or so later, they were laying all over the place, & a few of them had to be carted home by their pals, during the evening Mr. Edgeley looked in & spent half an hour or so with us. Some of the boys were stiff today they had to go on fatigue, Len had a big party too & won't be back till midnight.\n\nWhen I woke up this morning I felt much better, but I had breakfast in bed, & did not get up till nearly 10 O'clock, first thing I done was to go out & have a wash in a shell hole. I then dressed myself lit a fire & Jock, Bellchambers & I cleaned our joint up & I can tell you it was in a nice state after the night's carousing.\n\nI did not have much of a dinner just a slice of buttered toast & a mug of tea, & for tea tonight, a chop bread & butter & a small piece of plum pudding, so our Xmas has been nothing out of the ordinary.\n\nThere was some heavy firing today our big guns were dealing it out properly Xmas day or not. The","49":" Pioneer Batt. are having a big spread tonight.\n\n\"Xmas night\". Have been playing \"Bridge\" nearly all the afternoon, we made ourselves nice & comfortable fixed a table up & had quite an enjoyable time, & this continued until tea-time, after tea, we started again & played until Len came home with his party we then set to & cooked some meat & had a good supper, & so ended our Xmas in France.\n\nDuring the evening old \"Drummie\" (our Drum Major) dropped in & played us a few carols & tunes on his \"picolo\" he is some class on it, old \"Drummie\" was going round to all the Sergeants huts on the look out for rum.\n","50":" Boxing Day, but I never spent it like I would have liked too, & that is on a good day's shooting like we used to do when we were home, we are certainly on a shooting expedition but the game is of a different species & very wily, another thing all ammunition is supplied free to us & board & lodgings found, plenty of game guaranteed & all are invited.\n\nHad quite an important job today was Battalion Orderly Sergeant, a B.O.S. is held responsible for the correct departures of all\n\nof all working parties & etc., he also has to go round all the huts twice a day with the Orderly Officer & see if there is any complaints about the food, then about 10.30 round you go again with the Colonel (sometimes) Dr. Orderly Officer, this is for the inspection of huts, & to see that everything is left clean & tidy & that no tucker is left lying about, the Orderly Sergeant goes in front, & when he comes to the door of the huts he blows his whistle & sings out \"Orderly Officer\", everyone who is in the hut is then supposed to stand to \"attention\" while the heads are in the huts, when they are finished out you go, & repeat the same performance till all the huts have been visited, besides this you generally have to collect all \"Light Duty\" men, & give them some\n\nlight job to do such as cleaning up the grounds, collecting tools & etc. one thing & another you are kept going all day & well into the night though I could not complain about my job today.\n\nSaw 2 Taubes & one of our machines brought down today.\n\nFritzie has been dropping some more heavy shells quite close to us tonight they make the ground fairly tremble. Was rather a nice day, but tonight it is raining once more.\n\nPut all the evening in playing Bridge again, it passes the time away. Lindsay Graham & Digby came back from the School today, & Arthur Sands sent on \"leave\".\n\nThe Band was going strong again tonight up at the Pioneers Batt. I suppose they were having another spread.\n","51":" Was Coy. Orderly Sergeant today a fairly soft snap, but there has been a lot of messing about what with one thing & another, for we are shifting up towards the line in a day or so.\n\nA fellow has had many opportunities now of seeing the ravages caused by war, the throwing back of the German line enables one to visit the ground which once was \"No mans land\" & German territory, & which remains in many instances littered with the debris of a series of long & terrible fights, rifles, bombs, broken machine guns are scattered all over the place, while thousands of corpses strew the ground some buried in shallow graves, so shallow that in many instances their arms & legs are sticking out as if still defying the Hun & all his frightfulness, others you\n\nwill see again grinning horribly. The ground over which both sides are fighting is one vast cemetry, & as new trenches are cut bodies come out or form part of the walls, it is a gruesome place this \"Somme\" & yet it has a certain attraction for one, thousands & thousands of exploded & unexploded shells lay all over the place, & you can see yourself by the piles of green & mildewed shell cases the places where the German gunners made their last desperate stand, there are not many of these certainly for our guns smashed them nearly all before the infantry go across, but there are a few places where I have seen them. We are still fighting over this vast cemetry where every shell throws up to the surface what remains of an old victim of an Emperor's ambition & perhaps buries a fresh one\n\nin an open tomb.\n\nIt has been simply a glorious day the sun has been shining nicely, & there has been plenty of heavy shelling & scores of air fights but the Germans have no chance now either with our artillery or aeroplanes, our guns paste them day & night, while as long as there is a streak of light left our planes are flying backwards & forwards & all round their lines.\n\nJust about starting to get my voice back again, I have been that hoarse for the last 6 or 7 days that I could hardly speak & when I did it was more like a crow.\n","52":" Was up at daybreak this morning to call the early working parties, & after I had finished I was standing at the cooker yarning with one of the cooks when an aeroplane humming drew\n\nour attention. She was right low down & right over our heads, we took no notice of her for we thought she was one of ours, but all of a sudden there was a rattle of machine gun fire from the sky, this made us look up & hang me if it wasn't a Taube never saw such a bit of cheek in my life before she emptied her belts into something or other & then started to make off, we could easily see her for she glided like a great black bird & made straight for her own lines thinking to get back safely but her luck was out for our chaps who must have been asleep to let her come over, suddenly opened with their anti-aircraft guns & they soon got the range & we watched the shots getting closer & closer & at last down she come a beautiful buster, our gunners made good shooting alright.\n\nHad charge of 60 men on a big fatigue party carrying timber, iron, & etc. up to where they are building a lot of new huts on a little rise.\n\nSaw a fine smash this morning down on the railway line, 4 trucks loaded with rails come tearing down the line completely out of hand she never struck nothing till she arrived at the dump just close to where I had a party working, & here there was a big string of trucks being unloaded you should have seen the boys leaping when they heard the shouting they fairly flew through the air, & just in time for the runaways hit them with a terrific crash, & you could see nothing for the next few minutes but flying metal logs & splinters, when the stink settled down there was a pretty sight, trucks all over the place piled on top of one another in a most bewildering way, the line\n\ntorn up & sleepers smashed, but wonderful to say no one was hurt.\n\nI was talking to an old Tommy this morning, & my feet were as cold as ice. I was telling him what a job I have to keep them warm, & he advised me to rub them with rum so I decided to try it & I was astonished at the result the feet kept as warm as toast all night & so far today they are warm, so now I intend to use the rum issue on my feet instead of giving it away, just imagine what some of the boys will say when they see the good rum going to waste like that. Wonders will never cease! this evening I had no less than 110 green envelopes to divide among 20 men, they re fairly chucking them at us now & one time you could not get one for love nor money. I have myself paid 2\/6 for a \"greenie\", & now\n\nyou can get any amount of them, but I expect this state of affairs won't last long.\n","53":" On the same job again today only the parties are all split up. We had a few anxious moments last night old Fritz dropped heavy shells all round us & the clods fell like rain on our slender little humpy, we were expecting every shell to land right on us, but they knocked off in time. A man would be dead stiff to stop a shell right back here, but you never know when one will blot you out for he drops them at random day & night & they are likely to catch some one.\n\nIt rained a fair bit last night & melted all the frozen ground, the consequence is, that today everything is soft & muck once more, & King mud reigns supreme.\n\nHave been trying for some time to find out the age of Amiens Catherdal & Jock Mackie got it the other day for me. She was constructed in the 13th Century by Jean de Lazarecks.\n","54":" Last night all the Platoon Sergts. & Officers had a confab in the Officers huts about our move to the firing line which is taking place this afternoon everything possible was thrashed out so things ought to run smoothly.\n\nRained very heavily early this morning & the ground is flooded with water won't the firing line be in a pretty state.\n\nNo one is allowed to wear their puttees this trip they reckon they help to stop the circulation of the blood & so bring on \"trench feet\" the 2nd Battalion have suffered very badly from all accounts over 80 cases of \"trench feet\" to about 30 other casualties\n\nso you can see \"trench feet\" is far worse than all the German shells & bullets. We are carrying our overcoat, watersheet & 1 blanket with us, won't we do a perish, somehow or other I am dreading this trip to the line for what reason I don't know.\n\nAll men have to wash their legs & feet this afternoon from the thigh down & then rub \"whale oil\" in, it should be a good thing, we are taking enough precautions, & besides each platoon is carrying 4 small tins of it with them. The way they are handling our socks lately is most unsatisfactory, we hand good socks in, & get dirty ones in return & sometimes none at all. I laid a complaint this morning to Mr. Edgely about the matter.\n\n31st. \"Fell in\" last night at 3 oclock & as per usual stood about\n\nlike camels for a good 1\/2 hour then they suddenly found out that it would be 15 minutes yet before we were moving off, so the order for all men to return to their huts was given, we had hardly got our packs off when they started to sing out \"fall in\" how the men swore & I don't blame them either for it is an aggravating thing to get messed about like this, this happens nearly every time we are shifting, however we got away at last & got on the duckboard tracks which led us through \"Delville Wood\" & nearly up to Flers, since we were here last they have a small train line right up to Bde. Hqrs. & they have also started a lot of tunnels some of them are over a mile long & run nearly to the \"firing line\" they will be a godsend when\n\ncompleted & the stretcher bearers will find the good of it for it will very much easier walking than over the muddy ground, once we got off the duckboards our trouble started for we had to \"light off\" across the open country & mud to your knees in place \"Oh what a picnic we had & dodging shells in between for \nall\n old Fritz knows we have to come across this country, at last we reached our trench, & like all other trenches the dugouts were half full of water, but all the men got dry quarters somehow or other, when I had got all my men in I had to go & find a dugout for myself but there was never a one to be found, so Bellchambers & I set to & built one ourselves we finished about 10 o'clock, then I had to go & hustle\n\nmy men up for a fatigue party was wanted to take hot tea to the \"firing line\", after these had got away we turned in, but could get scarcely any sleep for our possy was too narrow & water was oozing out from the sides, at 12 oclock I had to hop out & find some more of my men for another party & then again at 5 oclock I was out so you can see very little sleep came my way.\n\nThis morning the old Hun is shelling us fairly consistent but nothing like what we are giving him our guns never seem to cease. Had nothing up my sleeve this afternoon for some big shells dropped uncomfortably close, one man was killed & another wounded, its a wonder more were not skittled.\n\nThis evening my platoon had to carry our rations from Bn. Hqrs. down to the Coy. it was not a very long job & we were soon finished.\n\n\"New Years Eve\" & it is being ushered in to the sound of guns, not a very good look out for the New Year which will shortly be on us, but I am confident that 1917 will see the last of this gigantic struggle & the complete defeat of Germany & so we enter the New Year full of hope & more confident than ever of our victory for it is certain now, come what will.\n\nLast night some Germans were digging a trench about a 100 yds. from our lines, & our chaps spotted them, so they sneaked out & surprised the Huns, they never attempted to fight, but held\n\nup their hands & were quite willing to come in, 17 in all.\n\nIt has been a very miserable day, dull & overcast, & tonight it is raining.\n","55":" We gave the Huns a heavy bombardment last night, & he retaliated but not so fierce as ours he dropped shells all round our trench but hit no one luckily.\n\nThis morning the Sergt. Major, Goldsmith & myself went up to the firing line to have a look round before we go up tonight, it is a rotten trip up, & by the time you get there you are knocked out for the mud is very heavy walking to get to the firing line you have to walk over open ground to within a couple of hundred yards of the German trench, there are no communication trenches whatever & you simply drop into a ditch which represents our\n\nfront line trench, its most unatural the way you can walk about in full view of the Hun's trenches, & only get shot at by an occasional sniper & they seem to be very poor for nearly all their bullets go high, one shot at me 3 times this morning as I was going along the top having a look at the portion of trench I am taking over I have the worst part of the Coy.'s line, & I have to patrol every few hours for there is a gap of 200 yards or so between us & the next coy. & the Germans could easily sneak between this gap, so to prevent it we send patrols out from dusk till dawn.\n\nRight close to us is the village or rather what remains of it, of Guedecourt, & though there is not a single soul in it, the Germans\n\nshell it night & day, the reason they reckon why they are so keen on it is because the Germans have great stores of ammunition, clothing & etc. & there are some heavy guns abandoned in the wood, & also they have enough underground dugouts to billet a Brigade of men, so naturally they do not want us to get the loot so they shell it heavily night & day. It is now 2 oclock & our guns have opened up a heavy bombardment which is going to last for an hour, the noise they are making now is terrific.\n","56":" Last night we packed up & moved to the firing line, luck stuck to us for we never had a casuality getting in although we are in full view of the Boche, the trenches we took over are in an awful state & my platoon who are on\n\nthe extreme left had the worst place of the lot, we were up to our knees in mud & slush & had no possies at all, so we had to work all the night & make what we could of it, even then my post had no shelter whatever for the night & we did a beautiful perish, a chap does not notice the cold on his body so much it \nhis\n is his feet which suffer most & they keep one awake, we took our boots & socks off 3 times during the night & rubbed our feet with whale oil this helps to keep our feet warm, & the rubbing keeps the circulation going. I had 8 of my men on \"patrol work\" we had to report to D. Coy. every other hour, & their patrol had to report to me every 2 hours, we done the odd hours & they the even, the length we had to look after was about 200 yards in length & unoccupied.\n\nNothing eventful occured during the night but the fun started at day-break for we could see Germans all over the place, we grabbed our rifles & into them we had quite good fun for a good hour & dropped a fair number of the Huns, I know of one I accounted for & Len got 3 more they had evidently been out on a working party & had left it too late coming in so we socked it into them, it was dead funny to see them toppling head over heels & ducking in & out of shell holes as our bullets whistled past them. I first saw the Huns just as day was breaking I was looking out towards their trenches when something grey & moving caught my eye. I guessed what it was straight away & got all the boys ready\n\nwith their rifles, we had not long to wait before we spots any amount of them, weren't the boys excited for it is about the first time with the exception of \"Pozeries\" that we have seen them so distinctly, I got my eye on one chap who was trying to get in, on short rushes, but try as I would I could not clear my sights for it was scarce light enough, I let fly at him 3 times & I believe I winged him the last shot, after him I got on to another chap who was right in front of me about 400 yards off & him I know for certain I downed for good with my second shot he was too good a thing to miss. While I was after these the rest of my men were busily engaged & between them they outed a few for we could see them later on\n\nlying on the ground, Len shot 3 what a rifle shot he is! Absolutely dead one of his victims had a full pack up & was running for all he was worth when Len drew a bead on him, bang & head over heels he went, finish.\n\nBy the time the last of the Huns got in there was quite a crackle of rifle fire along the whole of our line, & every Australian has his head well over the parapet fingering his rifle & enjoying the fun, its a wonder the Germans never replied to our fire so as to give their own mates a chance of getting in, but no, they sat as silent as stones & never interfered with us.\n\nAbout an hour afterwards the Major came along & he was very pleased at our mornings work for you could see the bodies real\n\nplain with his glasses. We got odd shots all day long at their heads & I'll bet a few more of them felt our lead when least expecting it. Old Fritz seems to be in the same fix as we are with his firing line no communication trenches & all mud & water & he has more to put up with for our guns pelt his lines day & night with high explosive & shrapnel while he only drops a few now & again on to ours.\n\nHad a fairly liberal supply of dry rations this morning, but our hot meal came a \"gutser\" for some unknown reason, we are supposed to get 2 hot meals a day in the trenches, the food is cooked away back nearly a mile & a half behind the firing line & just before daylight fatigue parties carry it up to us in patent cans which\n\nare strapped on their back, something after the \"thermos\" style are these dixies & will keep food warm for 24 hours so you can see they are a good thing, what a struggle it is for the men who have to carry this food to the firing line I pity the poor devils for they have to force their way through a regular glue pot & it drags the life out of them besides they keep on falling in to big shell holes for it is almost impossible to dodge them in the dark the land is just honeycombed with them & 9 out of 10 are half full of water so the state this particular party generally arrives home in is more easily imagined than described. About 11 oclock this morning a fatigue party from B Coy. were sent up to the lines & 2\n\nof them were shot dead a machine gun got 1 put 3 neat little holes in his head, & a sniper shot the other one through the heart.\n\nThe portion of the trench I am holding is very dangerous for the Huns have a gun which enfilades us beautifully so we have to keep very quiet during the day for the least movement draws the fire of this whizz bang, if he only knew how completely we are at his mercy we would not live long I bet, last night he made our hair stand on end more than once I can tell you, for he was just grazing our heads & the shell used to burst just on the parados, we could hear her fire quite plainly, & then you should see us duck, \"what oh\".\n\n"}}