{"Document Name":{"0":"Diary_0033","1":"Diary_0033","2":"Diary_0033","3":"Diary_0033","4":"Diary_0033","5":"Diary_0033","6":"Diary_0033","7":"Diary_0033","8":"Diary_0033","9":"Diary_0033","10":"Diary_0033","11":"Diary_0033","12":"Diary_0033","13":"Diary_0033","14":"Diary_0033","15":"Diary_0033","16":"Diary_0033","17":"Diary_0033","18":"Diary_0033","19":"Diary_0033","20":"Diary_0033","21":"Diary_0033","22":"Diary_0033","23":"Diary_0033","24":"Diary_0033","25":"Diary_0033","26":"Diary_0033","27":"Diary_0033","28":"Diary_0033","29":"Diary_0033","30":"Diary_0033","31":"Diary_0033","32":"Diary_0033","33":"Diary_0033","34":"Diary_0033","35":"Diary_0033","36":"Diary_0033","37":"Diary_0033","38":"Diary_0033","39":"Diary_0033","40":"Diary_0033","41":"Diary_0033","42":"Diary_0033","43":"Diary_0033","44":"Diary_0033","45":"Diary_0033","46":"Diary_0033","47":"Diary_0033","48":"Diary_0033","49":"Diary_0033","50":"Diary_0033","51":"Diary_0033","52":"Diary_0033","53":"Diary_0033","54":"Diary_0033","55":"Diary_0033","56":"Diary_0033","57":"Diary_0033","58":"Diary_0033","59":"Diary_0033","60":"Diary_0033","61":"Diary_0033","62":"Diary_0033","63":"Diary_0033","64":"Diary_0033","65":"Diary_0033","66":"Diary_0033","67":"Diary_0033","68":"Diary_0033","69":"Diary_0033","70":"Diary_0033","71":"Diary_0033","72":"Diary_0033","73":"Diary_0033","74":"Diary_0033","75":"Diary_0033","76":"Diary_0033","77":"Diary_0033","78":"Diary_0033","79":"Diary_0033","80":"Diary_0033","81":"Diary_0033","82":"Diary_0033","83":"Diary_0033","84":"Diary_0033","85":"Diary_0033","86":"Diary_0033","87":"Diary_0033","88":"Diary_0033","89":"Diary_0033","90":"Diary_0033","91":"Diary_0033","92":"Diary_0033","93":"Diary_0033","94":"Diary_0033","95":"Diary_0033","96":"Diary_0033","97":"Diary_0033","98":"Diary_0033","99":"Diary_0033","100":"Diary_0033","101":"Diary_0033","102":"Diary_0033","103":"Diary_0033","104":"Diary_0033","105":"Diary_0033","106":"Diary_0033","107":"Diary_0033","108":"Diary_0033","109":"Diary_0033","110":"Diary_0033","111":"Diary_0033","112":"Diary_0033","113":"Diary_0033","114":"Diary_0033","115":"Diary_0033","116":"Diary_0033","117":"Diary_0033","118":"Diary_0033","119":"Diary_0033"},"Date":{"0":"unknown","1":728.0,"2":731.0,"3":732.0,"4":734.0,"5":735.0,"6":736.0,"7":737.0,"8":738.0,"9":739.0,"10":740.0,"11":741.0,"12":742.0,"13":743.0,"14":744.0,"15":745.0,"16":746.0,"17":747.0,"18":748.0,"19":749.0,"20":750.0,"21":751.0,"22":756.0,"23":757.0,"24":758.0,"25":759.0,"26":760.0,"27":761.0,"28":762.0,"29":763.0,"30":764.0,"31":765.0,"32":766.0,"33":767.0,"34":768.0,"35":769.0,"36":770.0,"37":771.0,"38":772.0,"39":773.0,"40":774.0,"41":777.0,"42":778.0,"43":779.0,"44":780.0,"45":781.0,"46":782.0,"47":785.0,"48":786.0,"49":787.0,"50":788.0,"51":789.0,"52":790.0,"53":791.0,"54":792.0,"55":793.0,"56":794.0,"57":795.0,"58":796.0,"59":797.0,"60":798.0,"61":799.0,"62":800.0,"63":801.0,"64":802.0,"65":807.0,"66":808.0,"67":838.0,"68":839.0,"69":841.0,"70":850.0,"71":851.0,"72":902.0,"73":903.0,"74":904.0,"75":905.0,"76":906.0,"77":907.0,"78":908.0,"79":909.0,"80":910.0,"81":911.0,"82":912.0,"83":913.0,"84":914.0,"85":915.0,"86":916.0,"87":917.0,"88":918.0,"89":919.0,"90":920.0,"91":921.0,"92":922.0,"93":963.0,"94":964.0,"95":965.0,"96":966.0,"97":967.0,"98":968.0,"99":969.0,"100":970.0,"101":975.0,"102":976.0,"103":989.0,"104":990.0,"105":995.0,"106":1012.0,"107":1013.0,"108":1014.0,"109":1015.0,"110":1016.0,"111":1017.0,"112":1018.0,"113":1019.0,"114":1020.0,"115":1042.0,"116":1043.0,"117":1044.0,"118":1045.0,"119":1046.0},"Entry":{"0":"\n\nI said good bye at home on ","1":" catching the 11.50 p.m. train to Tempe and arrived in camp after midnight. I had very little sleep for squads kept forming up and playing marches and popular tunes on tin plates, buckets, tins etc. and later the mob set alight to the latrines which had previously been condemned. Colonel Pearce witnessed the scene but was powerless to stop it. We fell in about 5 a.m. next morning and marched to the tram which took us right to the wharf, where a large crowd met us, many of the women crying and the men looking very miserable. Uncle Harold and Vic met me and also Terry with a Christmas billy from home. Only a short time was given for saying good-bye and then we were formed up alongside the ship and the nominal roll called. It was some time after we embarked before civilians were allowed on the wharf and in the meantime I was very much amused at the way some ladies defied the police and rushed passed the barrier, whilst the troops cheered and encouraged them and hooted the police calling out cold feet and any other epithets that came to their mind. At last the cordon was withdrawn and there was a tremendous rush whilst ladies even climbed the iron railings and uprights in order to get points of vantage. Then the streamers began to appear and soon those on shore were connected with their loved ones on board by hundreds of bright paper ribbons which reminded me of the old maypoles, except that the bright faces were replaced by strained and anxious ones, many of them tear stained and many with a smile so forced that it looked like the sun trying to shine on a rainy day. Soon we started to move and then the babel of voices was indescribable with hurried words of final advice and more cheerful words of encouragement, whilst some could only trust themselves to say good-bye. We lay in the harbour till four o’clock that afternoon whilst launches circled round and round packed with relations and friends all calling for someone they knew, whilst some endeavoured to throw fruit on board. The police boat, however, kept them at a distance. At last the anchor was weighed and I was called down from my position on the top look out where I had a splendid view. The launches followed us to the\n\nheads where they gave up the chase, the people aboard waving umbrellas, silk scarves, handkerchiefs, hats and all sorts of articles. The boys were standing or hanging to every available position on the ship in order to see the last of the dear old city which we would not see for many a day. I was standing right astern and the song \"Good-bye Sydney Town Good-bye\" was I think sung with more feeling than it has ever been since composed. The land faded all too quickly from our sight as it was a dull day and although I took a snapshot of my last glimpse of the \"Heads\" it will I am afraid be no good. Slowly and hesitatingly the men left their positions and set to work finding their bunks. Soon their faces began to assume that pasty and care for nothing look of the inevitable sea-sickness for we had struck rough weather. I slept well that night and was not sick till next morning after going into the cook-house which did not smell too appetising. However, I ate a good breakfast and have not felt any effect since.\n","2":" It is very funny to see the fellows lying about the decks looking very miserable and not caring what happens, whilst in contrast a few, not sick, are standing or walking about discussing the vessel, destination, other things about the voyage. Towards evening the weather became quite calm. The meals are very good the menu being porridge, meat (and some times rabbit) bread and tea for breakfast, soup, meat with a green vegetable and potatoes – sometimes plum duff for dinner and tea with margarine and jam for the evening meal, the tea having milk and sugar in it.\n\n","3":" We had church service 10.30 a.m. the Chaplin speaking from the saloon deck and the men congregated on the stern well deck. The service was very impressive for on looking round one sees the sky like a tremedous dome roof resting on the huge flat and bare surface of the sea, whilst the only spot in the whole scene is this little ship (for it does seem small in such a space) with all heads bowed in prayer. There is no drill to-day of course and the scene on the boat deck is a very lazy and comfortable one with the men in all sorts of conceivable positions and attired, talking writing or sleeping, whilst even the inevitable washing flapping in a soft breeze seems imbued with laziness. The only sign of duty is the sentry at his post and the ship’s officer pacing the bridge.\n\nThe weather, itself, beautiful.\n","4":" Tuesday and Wednesday 20 to 23\/12\/15\/ The sea is still calm but the sky is dull and the usual routine has been the order of the day.\n","5":" 23\/12\/15\/. To-day we had a kit and hammock inspection to see that no one had more than two blankets and regular hours made for drawing them and tags given out for our regimental and mess numbers. Each man could make sure of his own, for previously you could not keep one hammock for any more than a couple of nights. It is also very hard to keep any personal property for if left for about ten minutes in disappears.\n","6":" To-day’s Christmas eve. This morning the men who had had their hair clipped short banded together and grabbed everybody with long hair and cut big pieces out so that they would have to have it all off. This interesting performance was continued all the morning until they had such a crowd of branded ones that it took the rest of the day cutting their hair. I was done with the rest. In the evening the infantry held a concert in the forward well deck. I viewed it from a position on the saloon deck, standing on the railing and clinging to the roof with one hand. From this position I had a splendid view and indeed it was a curious spectacle. Right at the bottom of the deck was the stage like a small arena and this was surrounded by a solid mass of khaki sprinkled with dungarees fully 30 feet high formed by the soldiers sitting on the deck clinging to every available rope or spar and lining the saloon and forward decks. The whole making it look like the amphitheatre of olden times. Straight up from the centre of this mass (the only living spot within sight) rose the Australian Flag and curiously enough, just above it the evening star shone with that remarkable brilliance only seen at sea owing to the absence of dust. Some of the artists were very good especially the comic band, one man being dressed up as an old woman with the words \"I’m not married\" on her hat, two others as Charlie Chaplin, one as a nigger and the other as the Conductor. About 11 p.m. the Chaplain started carol singing at different parts of the ship till early next morning. I joined them when near my sleeping place in the saloon deck (although I generally slept on the\n\nthe boat deck) and then turned in.\n","7":" – We had church service 10.30 a.m. which was much appreciated especially the allusions to and prayers for the absent ones, which even the roughest of the men seemed to feel. After the service we had our Christmas dinner which consisted of soup, roast pork with apple sauce and harircot beans and potatoes and plum duff. I also had a billy from home and I got the lucky wishing bone out of the pudding. Brother got a 3d but Tad did not get anything. The rest of the day was just like Sunday.\n","8":" Usual routine.\n","9":" 27\/12\/15.. We arrived at Freemantle (where we had to disembark so that a lot of wheat could be loaded) about 7.30 a.m. this morning, after a very slow trip from Sydney owing to their desire not to reach here before Christmas, we disembarked at 8.15 and entrained on the wharf for Blackboy Hill where a large W.A. camp was situated. We arrived there about 10 a.m. and were first allotted to our huts, but as there were no guards or officers visible and the W.A. boys were all away on leave we dumped our kits and made post haste for Perth. Ted Mears and I went together, had dinner at the Salvation Army and then took the tram to Nedlands. The line follows the swan river all the way, so we had an excellent view of the holiday makers for it is Boxing Day. The river is shallow the whole distance for about 200 yards out and all along the bank parties were bathing in the open, with very crude dressing sheds made of rugs, upturned sulkies and carts, umbrellas and all sorts of funny things. On alighting at Nedlands we found that a Red Cross Carnival was in progress. And so we had a very enjoyable time watching the very mixed crowd arriving in all sorts of dilapidated conveyances with animals hardly fit to be called horses. In fact during my stay in W.A. I only saw one decent bit of horse-flesh and that was a trotting thoroughbred. The trams are very curious things with a big awkward scoop in front made of a rope net on an iron framework, to act as cowcatcher. They also have transfer tickets which enable you to alight at one stop stay for a period not exceeding ten minutes and then continue your journey and as the first section is 3d and the others 1d it comes in very\n\nuseful. In the evening we went to the Dandies with Ron, Keith and Billy McDougall. I happened to mention that there would be a lot of grandmothers in Perth to-morrow in order to get leave and a lady named Mrs.Tweedall, next to Keith evidently heard for she took our names and said she would write to Collins for leave to visit her.\n","10":" To-day I was on town picket and Keith, Bill and I got leave from Clive who was Sargent to go to Mrs.Tweedall to tea. We did not do much all day having plenty of time off.\n","11":" The picket had general leave to-day and so I went to Freemantle this morning and got my mail from the boat and also had a look round the town. I met Bill Wright in the afternoon and had a look round the streets and shops of Perth. The evening I spent at the Y.M.C.A. writing letters. \n","12":" Only about 75% of the troops were on parade this morning and Colonel Batty the W.A.Camp Commandant gave us a lecture saying his first good opinion of us was ruined and that we were the worst lot of soldiers he had ever seen. At that the men promptly hooted and counted him out although they were on parade. He then took us for a stiff route march, with the weather steaming hot. In the afternoon to took them for another, but I slipped off the end of the line as they marched out and spent the afternoon writing letters at the Y.M.C.A. The Y.M.C.A. is a most up to date affair this city. It is an asbestos sheeting building with reading and writing room, billiard room with 5 tables, soft drink canteen and canteen where tea was 1d a cup, cocoa and coffee 2d. milk 2 and 3d a glass and 4d a mug, which was larger than the glasses. Roll and butter was only 2d also pies. These prices are of course very low. The camp itself has very good appointments with cement floors on showers and latrines and a small meat safe for each hut. There are also a large number of tents which are lavishly shaded by gum trees. That evening I went to Perth to get any telegrams and received a lettergram from Topsy and those at Middleton, so sent one in reply. I returned to camp early. I should have mentioned that before this afternoon’s parade a great number of the troops formed up and started to march out of camp. On reaching \n\n the guards the W.A. Officers (Col. Batty did not appear) sent for Major Gallagher, our own Major who said that if the men did not go back he would resign, so they returned to camp.\n","13":" Short route march this morning – went to Perth in the afternoon where a great crowd were parading the streets whilst civilians actually took positions on the railway bridge and balconies to see, as they thought, the N.S.W. boys wreck the town. They had previously seen a few N.S.W. boys in a riot which wrecked Erpfs shop but the civilians started it. However, the papers gave our boys a bad name and to show how silly they were the following should be noted. Collins our C.C. had to take a W.A. infantry picket to night and as he would sooner have his own men he asked us to volunteer for the duty, and fall in at the Post Office at 7.30. This we did and Collins marched us to the Barracks and said we volunteered for picket, but they would not accept it. Next morning the newspapers said that about 200 men (meaning us) had surrendered. After falling in with the picket we went to the Dandies and then afterwards walked round the town till the time to catch our train at 11.50 which did not leave till about 12.15. Thus we saw the old year out and the new one in, sitting in the train at Perth Station.\n","14":"\nWe left Blackboy Hill, giving 3 hoots for Col. Batty, at about 1.15 p.m. and embarked about 2.15 p.m. We did not sail till about 4 p.m. and by that time a large crowd had congregated to see us off and the streamers again began to appear. At last we set sail and faced out to sea, the weather being beautiful and so finding a good seat on the boat deck I saw there determined to see all I could of our native land before I departed for goodness knows how long.\n\nAfter passing the breakwater the City (Freemantle) gradually became smaller till it looked like a clump of wild flowers in a big bare paddock and glancing at the coast one does not wonder that the early explorers found nothing inviting about it. Slowly we leave the land behind us fading gradually away as the distance envelopes it with a thin grey veil and the ships near the coast do the disappearing trick one after the other over the horizon. On the starboard side there is still a peninsula visable set in a \n\nBeautiful sky of grey, pink and yellow washes wonderfully blended until they are lost in the greyish sky overhead, whilst the sun makes a glorious golden path across the sea, like so many steps of shining gold, each one changing its shape continuously into even more weird figures as the rays catch one dancing wave after another. With awful certainty, this last stretch of Australia also fades out of sight, and far too quickly for us who are leaving our country for an indefinite period, whilst every now and then, as if saying good-bye and wishing us god-speed a lighthouse sends out a comforting gleam of its homely light. Even more gradually the curtain of night is drawn over it all, the lighthouse far away on the horizon gives its last flicker of farewell and then disappears as if the candle is extinguished and we turn in to bed to awake in the morning far from home and on a journey the nature and outcome of which none of us dare to guess. \n","15":" Lovely day, got sunburnt legs through wearing shorts\n","16":" Big swell to day got enoculated for third time.\n","17":" Canteen hours changed owing to men visiting it during parade.\n","18":" Awnings erected on all the decks making it nice and cool.\n","19":" Artillery held concert – I recited \"Trotty\" and \"The Girl on the Stairs\".\n","20":" A very heavy wind with rain sprang up about 10 p.m. had my hammock with others slung to a spar on boat deck, the spar split with the weight but just held us till morning.\n","21":" –","22":" usual routine.\n","23":" – Kit inspection, had game of 500 in evening Ted and I against Ron and Mears – won four games running – I had 3 good no-trump hands.\n","24":" Usual routine – noticed birds flying about therefore suppose we are nearing land.\n","25":" – Sighted small island on starboard side about 11.30 a.m. later when there was much speculation as to whether it was a cloud or island – About 2 p.m. Cape Gardafue gradually took shape on the port side and in the course of an hour we could see it clearly and I must say that the first impression was not too \n\ninviting, for there was a mass of rugged hills right to the sea separated by low depressions, all of a sandy nature, without vegetation and looking scorched up. The sunset was very pretty, whilst out to the right a lonely hill stood out sharpe against the sky and connected with the main mass of hills by a very long stretch of low lying sand, the whole lot bathed in a curious red glow.\n","26":" – We only caught a glimpse of land a couple of times to-day and these with a few passing ships kept the men occupied going from side of the ship to the other for it takes very little to interest them after the tedious run across the Indian Ocean. To-night the Sargeants held a concert in their mess for themselves and officers, I was invited so as to recite and so I gave \"Trotty\" for the Officers had not heard it the previous time and \"Guiseppe\" the Barber\". During the interval we had coffee and sandwiches and then at the close we all joined hands and sang \"Auld Lang Syne\" I was at the end of the line and the Adjutant at the end of the line of officers came and joined hands with me. The concert was certainly the best on board and oe man recited \"The game of life\" using a pack of cards.\n","27":" – Land was in sight this morning and it certainly is a curious sight being a succession of small sharpe peaks joined by strips of plain looking like sand, but they must be some sort of rock for one peak is like a very narrow pyramid going to a needle point. There is no vegetation except for dark patches looking like low scrub, which, however, proved afterwards to be rock of darker hue. Throughout the day we sighted about a dozen such islands, just masses of bare volcanic rock, absolutely void of vegetation and habitation except for a lighthouse in a couple of them. Boats of different shapes and sizes have passed us and one had four panels of red and white stripes painted on its hull, one on the stern, two amidship and one on the bow. It was possibly an American boat with stripes painted to guard against submarines. To-day we had underground mutton or rabbit for dinner.\n\n","28":" – Usual routine.\n","29":" – We had kit inspection to-day and also got out black bags from the hold. Sighted only one old Collier but \n\nseveral Islands on horizon coming sheer out of water for what must be about 6 or 7 hundred feet and forming a long succession of sharp peaks. It is very funny to see the way boys are making money. Some are selling juice made by the cooks and getting a commission and also chocolates from the ship’s stores. Others have bought post cards of the Berrima for 1d. at the Sargeants canteen and go round selling them for 2d. catching a few green ones. There has been a lot of gambling on board during the voyage, two-up, banker and another game whereby a man gives out cards with irregular numbers on them, making up 100 numbers in a bag and draws them one by one, and the man who first fills up a line in his card by those drawn out gets 4\/-.\n","30":" – We had to wear boots and leggings on parade to-day in order to get used to them before disembarking. This morning two very curious islands presented themselves to our eyes which were naturally looking for anything to interest them. They were quite extensive in area and appeared flat as a billiard table, rising only about 20 feet out of the water. They looked like huge slabs of rock floating on the surface of the water, whilst one had a lighthouse right in the centre. Later we saw the mainland which is very hilly, some of the peaks being exceedingly sharp. About 4 p.m. we entered the Gulf of Suez and saw the Sinai Peninsular on the starboard side. I have never seen land as barren, as it appeared to be a long chain of high and rugged sand hills, although owing to their steepness and sharp points they must be sandstone. In front of this chain is a tremendous smooth beach running the whole length of it and on it smaller peaks which at the distance looked as if children had been playing castles on Manly Beach. To-night everybody is cleaning his gear whilst some, thinking it is their last night on board which it probably is, are as usual kicking up a row. About tea time we passed two ships stranded on the sand. The wind this morning became almost a gale and the ship pitched a lot, whilst at times the sea became calm.\n","31":" Last night there was a bitterly cold wind which went through any number of blankets you liked to pile on. At reveilly this morning we were steaming to our anchorage in the harbour at Suez. The men had not yet risen, but there was a nearly full moon which was brilliantly reflected on the absolutely smooth \n\nfull moon which was brilliantly reflected in the absolutely smooth surface of the bay, whilst the sand ridges on either side were sharply outlined against the sky looking very grim and silent and certainly not inviting. About 6.30 we had reached our anchoring place and dropped the anchor. In front of us were three warships the first reminders of war we had had since leaving Freemantle, and just to the right in the distance one could discern the town of Suez shrouded in an early morning mist. Soon, however, a fiery ball began to creep up over those bare sand hills giving everything a reddish glow and soon the curtain of dawn was swept away and we could see the entrance to the Canal and the town quite clearly. This busy little patch was an oasis in the general scene of bare sand hills around us, which, however, with the sea a beautiful light blue, owing to the sandy bottom, forming a wonderful setting for the long even beaches and the rugged sand hills forming a back ground, was a pretty sight in the bright sunlight. We lay at this anchorage all day, and had rather an interesting time watching the passing ships and different objects of interest. The water birds come in flocks and would swarm about any rubbish squabbling and squeaking and these white creature with beautiful pink feathers on the back and wing fluttering over a sea of wonderful azure blue formed a pretty sight. The birds themselves are smaller than our sea gulls, having a great resemblance to the dove and when they alighted on the grim grey battleships in the harbour, the emblems of peace and war formed a strange contrast. To-night there is much speculations as to where we are going to as we disembark early to-morrow morning.\n\n","32":" We fell in about 9.30 and disembarked and entrained at 10 a.m. at Port Suez. The carriages were small rough ones after the style of the suburban trains, and were 3rd class. As soon as we landed the natives came along selling oranges, post cards, cigarettes and all sorts of articles, asking about twice their value and expecting to be beaten down. Then the little native children came along calling out \"Baksheesh\" which means \"nothing\" and that is they ask for things for nothing. We travelled all that day alongside the canal till about 6.30 when we disentrained and went into camp at Leitown. On \n\narriving in camp it was raining. We had no tea and in fact the heads did not know that we were coming. However, we were bundled into a big tent without even a blanket and spent a pretty cold night.\n","33":" – To-day we had to live on bully beef and biscuits and in the afternoon went for a route march seeing sights being led by a returned soldier. We first saw the obelisk at Matarich, which was built by Memphis in 1322 B.C. It is one solid pillar of rock 100 feet high – 50 feet being in the ground and 50 feet above. From here we went to a French Jesu Church called \"The Santuary of the Holy Family in their flight from Egypt.\" \"Sancta Familae in Aegypt Exsulia\". The High Priest’s altar is made of white marble and steps of alabaster, with a statue of the crucifixion in the middle and three candlesticks on each side, all of solid gold. The two altars of the second priests are made of cedar. The church is 103 years old and the paintings on the walls are exquisite (we signed our names in the Pilgrims Book) Next we saw Mary’s Well which is the well from which Mary took a sip and it immediately turned fresh. This is proved by the fact that is the only naturally fresh water within a distance of 30 miles of that spot. The well itself is 150 feet deep and over 2000 years old. We naturally had a drink of the water which was quite fresh and not at all brakish. The sycamore tree under which Mary and Christ rested in their flight from Herod is near this well, and so many people carved their names on one limb that it broke off, but the main tree is still living, and is protected by a very pretty wooden fence. I should have mentioned that in the journey from Suez yesterday we had a good view of the country which up to the region of the Nile where the irrigation reaches is one long row of sand hills inland and the canal on the other side of the line. You can see very little of the canal until the Bitter Lakes are reached when the deep blue stretch nestling in the dazzling reaches of the desert formes a pretty sight, especially as it was adorned that day with a grim grey battleship,, accompanied by some more peaceful traders. We passed a tremendous camp at \n\nTel-elKeber, which stretched for miles in the sand, and as the 5th Brigade is there I suppose we will also sample it later. At last we reach the Nile region affected by the irrigation and the change is marvellous, for mile after mile is one huge carpet of green with only dashes of brown where there are roads and native houses, the latter being made of mud or sand in clusters of about a dozen with apparently nothing but branches for roofs. There are no fences visable except along the railway line and I do not know how the boundaries of the different farms are known. The method of drawing water from the wells is very curious and interesting. Two huge wooden cog wheels are used, one paced perpendicularly and directly turning the winding shaft round which the rope is wound, and this is turned by the other cog wheel placed horizontally and turned by a bullock or camel walking round and round. These animals have to be blindfolded so as not to get giddy, a chain of buckets is fastened to the driving wheel. Although it was Sunday the Natives worked just as hard, for their real Sabbath is over Friday and at sunset the natives kneeling here and there in the long green stretches of waving lucerne, bowing reverently before the setting sun, presented a pretty sight, and made me think that perhaps they are better in their religious matter than us careless Christians, for although the lower natives of the city are moral wrecks, the agricultural class seems quieter. All day we only had a small piece of cheese and four biscuits issued, but luckily Tad, Miers and I had a loaf of bread from the ship.\n","34":" This morning they took us for a route march to Heliopolis and although we only had a hurried view, I was particularly struck by the beautiful large white buildings, every one of which was of good proportions, with only dirty or pokey little shops on the ground floor forming a strange contrast. \n","35":" We were enoculated for cholera to-day – also had leave from 3 p.m. till 10 p.m. and as Ted, Kiers, Guild and I went into Cairo, had tea at Soldiers Rest and then looked round the town. The Opera Place is a beautiful square with very fine buildings on two sides and Ezbekieh Gardens on the others. It looks especially pleasing when one comes out of the squalid native\n\nquarters only a few streets away, into the brilliantly lighted shops and fine buildings, whilst the horses flashing to and fro are simply superb. We did not go into many of the native streets leaving them for another time. A very amusing incident occurred during the day. They had a store tent near our hut with a guard placed round it, and they removed the tent but the guards are still seen marching round and round the empty space.\n","36":" To-day we had a thorough kit inspection and in the evening Tad and I played billiards in the camp saloon – Miers went to the hospital to-day with mumps.\n","37":" – Usual routine – Went shopping in Cairo in the evening and bought guide books to Pyramids Cairo.\n","38":" – We had leave this afternoon and Tad and I went to the Citadel, but were not allowed to enter owing to not having a special pass from our C.C. However we secured a guide and went to see some Mosques in the native quarter. On our way we passed through a native cemetery and could see the graves of the common people, like a stone shelf, called Mustabas, which stands for the shelf natives usually build outside their homes. The graves of the richer people are shafts sunk in the solid rock and over this they build a solid house about 14’ x 10’ in which the worshippers are supposed to offer up their prayers and look after the needs of the spirit. These rooms or houses are very quaint and in most cases quite dilapidated, being I suppose hundreds of years old. The whole cemetery looked very quaint being absolutely bare of colour, just the little mustabas all alike as two peas, made of sand on a sandy ground, whilst the dilapidated and old burial houses only made it look more monotonous. After passing through several streets of the native quarter we came to the Blue Mosque and obtained slippers at the door, for every one must either put them on or remove their boots as the natives do. \n\nThe Mosque is called after Abraham Allah and was built 700 years ago, and derived its name from the fact that the walls of many of its rooms are lined with blue tiles. Here we saw scholars repeating their lessons, all the time swaying backwards and forwards, which is supposed to be an aid to their memory. The next Mosque we visited was 1000 years old and the stairs leading to the liwan or \n\nsacred part of the church are beautifully decorated with inlaid white and ebony wood. The pulpit from which the Koran is read is made of solid stone raised about 10 feet from the ground by twelve solid stone pillars. In the courtyard is the usual fountain used by the Moslems for ablutions. On our way back to the tram we passed the gate of \"Bab-Wala\" which our guide said was the first gate built in Egypt and over 3,000 years old. This ended our sight-seeing for to-day.\n","39":" – We had church parade in the morning and no sooner had we been dismissed than we were formed up again and told to get one full marching kit ready and be in a position to fall in on the sound of the alarm. As far as rumours go there was a disturbance in Cairo, and when the order was cancelled and leave granted it was too late to go any trip so I had a good sleep instead.\n","40":" Tuesday & Wednesday 1-3\/2\/16. We had the usual route marches and a little drill, and on Wednesday were enoculated again, making the","41":" time for me and the sixth for many others. This (Wed) evening I went over to the sight of some excavation in the native cemetery and met Jones & Bondie we crawled down into the underground chambers and got some curios.\n","42":" – Route march this morning, along the railway line, where we saw a large head of camels being entrained, we also passed through the Arab camel camp and saw the camels watering. The herd certainly make a great sight.\n","43":" – This morning we made a route march to the Ostrich farm and spent a very interesting morning seeing birds of all ages. From the building here we had a splendid panorama view of the surrounding district, including the camp and all the troops training on the desert. On early morning parade we saw a fine sunrise on the desert, making a sight I will never forget. The sun rose majestically over the eastern hills as one great fiery ball making one almost understand why the susceptable natives worship it.\n\nHiding a portion of it and stretching as far as the eye could see were the hills on the horizon of rich blue colours, whilst separated from them by a band of purple was the endless red desert looking as vast and endless as the ocean we had lately crossed and as pitiless as when seen at midday when the sun makes it a waving mass of heat. Draped over it is the morning mist and through this veil thousands of camels from the camp silently wend their way across it, led by their Arab drivers swathed from head to foot in their loose black robes, making it all look like one hugh procession of spirits. However, the thoughts that such a scene as this gives rise to are dispelled only too soon by the order to double, for every one of us has sore feet, and unless spirits can use some rather strong language we could certainly not be described as above. During the afternoon we just marched to the other side of the railway line and sat there till it was time to come home. Collins has been made Adjutant of \"B\" details so we only had Sargeant McDermott over us and as there are no guns, drill except for a negligible amount of foot drill and signalling is not done.\n","44":" – To-day a lot of us went on a round trip arranged by an officer of the Engineers for 20 piastres each, for which we were to be driven to various sights in a trap (gharri) The trip was delayed just after starting by two halves of the column for there were 23 carriages altogether missing one another, but after uniting again we proceeded to Roda Island, being ferried across on a little flat punt propelled by a man sticking a long pole in the bottom of the river. The first spot of interest on the island was Pharoah’s garden, and the pool where Pharoah’s daughter was supposed to have bathed and also in which she hid Moses. This was according to our guide who was a little French Scout Boy, but the masonry around the pool was certainly not that old, and as he gave us wrong information all through he is most likely wrong. Another point of interest was the Nilometer which is a scale marked in a rock pillar, in order to show how high the Nile rose, at any time, and the Natives used to be taxed by it, for if the river rose higher one year than another they were taxed more heavily. From here we drove to the Coptu Church – Abou Sirgeh, where the wood carvings inlaid with ivory were exquisite. There were three altars, one \n\nfor the Father in the middle, one for the Son on the right and one for the Holy Ghost on the left. Underneath the church is the Crypt in which Mary and her child were supposed to have hidden in their flight from Egypt. There is also a stone basin near here in which babies were baptised. Just behind this church is the Jewish Church and here we saw a Jewish Bible on the skin of a (gagar)? and in the form of a role. We also saw one which our guide said was presented by Sir John Maxwell and which cost £200. All these bibles were encased in beautifully decorated and draped boxes cylinder shaped so that the two ends of the roll can fit in each half. One case was made of solid gold. From this spot we proceeded to the tombs of Sultan Abraham Pasha, his son and his mother. All of them were made of alabaster and beautifully carved with very intricate designs, especially the tomb of the Sultan, which had three proverbs written on the front and above them the ten commandments. The three proverbs were as follows: 1. Every man must die 2. All men are equal in the sight of God. 3. God helps those who call\n\nFrom here the road wound up through the vast ruins of the old Roman fortress, and it was indeed curious to drive along a fine asphalt road the product of modern civilisation and to see on either side the desolate waste and heaps of stones and sand which was all that was left of the genius and toil of other ancient men, whilst traces of the old walls could still be seen, giving a faint idea to where they ran, and also giving a little base for the imagination to work on, each sigthtseer I suppose building up a different picture. High up on the ridge, standing against the sky can still be seen the stumps of great pillars, weather worn and scarred but seeming to still have some of the immense strength that they once possessed. To complete the scene just as we rounded a curve in the road, a train of those picturesque donkeys came labouring up the slope, each with his very heavy load of stone, whilst the native drivers trudged alongside as they have done for ages past. Unfortunately we did not have time to go to the Citadel so we visited the Sultan Hassan Mosque, which is a building of vast proportions, and said to \n\nhave cost £600,000. On entering the courtyard which contains the fountain for ablutions, one is struck by the beautiful carving on the frieze on the wall, whilst the roof of the fountain is itself beautifully carved. Passing to the chamber where the sultan, who was assassinated in 1361, was buried, you find yourself in a room which is indeed a fine resting place for its founder, for it is a high chamber of great proportions, with a high dome roof, the top of the square corners of the room being rounded off with wood or stone work, carved to represent hanging curtains. The dome is surrounded by woodwork finely carved. From a window you can see holes in the outside walls which were supposed to have been made by cannon balls when Napoleon invaded the country. In fact one ball still nestles in the hole it has formed. The inspection of this mosque completed our sightseeing for to-day, so after having tea at Santis we made our way back to camp when we received some long looked for letters from home.\n\n","45":" This afternoon Tad stayed in camp so I took a trip to the Museum and spent a very interesting hour and a half. The Museum is at present in a rather disordered state, and a great portion of ones time on the first visit is taken up in getting the run of the place, but it will make it much more interesting for my second visit. There is no doubt the place is a gold mine of interest, and whereas one sees a few items of interest in a trip to some old site or ruins, he sees the accumulation of years of collecting from hundreds of such places, on entering the glass doors. One of the most interesting exhibits is I think the mummies, for you experience a novel feeling as you stand there and gaze on the stern old features of those great rulers who were all powerful two thousand years ago, but who now lie there shrunken and shrivelled, but the imagination easily supplies the energy and power which their face once portrayed. I hope to have the opportunity of visiting this wonderful museum again and seeing it more thoroughly. \n","46":" to","47":" Nothing of particular interest occurred during this week, except that on Thursday I took Mrs. Hyams to afternoon tea at Troppis, where it is served French fashion. On entering you take a plate and go to the cake table\n\nwhere the different varieties are all displayed, spear the ones you fancy with a fork and then after paying for them at the desk you go and find a seat in the room or the garden outside when you are served with tea.\n","48":" This afternoon Tad, Miers, Stewart, Shanks and myself all went to the Pyramids – The journey in was exciting enough for we had no sooner boarded the tram at the railway than we saw a corporal of the English troops killed by a tram. As this caused a block we decided to walk to Ezbekish Gardens and saw a soldier attacking a native, also two natives having a scrap, so that our journey was quite full of incident. At last we alighted at our destination and made our way up the winding path to the foot of the Great Pyramid, passing soldiers having races up and down on donkeys, laughing and yelling whist their long legs seemed almost to reach the ground, and behind them, waving their sticks and calling out stop, races the donkey boy fearful lest the soldiers would go off with the animal. Behind them, more sedately, ambles the ungainly camel with a Turk or a Red Cross Nurse on its back looking anything but comfortable, especially when he stops and kneels down, when the rider finds himself on a slope at an angle of 45° to the earth. The foot of the pyramids of Cheops (the Great Pyramid) reached we gaze up at the hugh pile of stone standing 450 feet high, and covering an area of 13 acres, with its faces scarred by the weather of 4,700 years, but still retaining their shape, whilst their wonderful construction soon makes itself apparent, each huge block of stone being in a sort of way dovetailed into each other. They are indeed fitting monuments to cover that great King who had such resources at his command, using 300,000 men three months every year during its construction, for carting the stone only, whilst the skilled workmen had permanent barracks there The reason why the men were used for three months only each year is that that three months was the period during which the Nile was in flood and they could not work. Miers and I climbed to the top, the others staying behind, and our energy was amply rewarded by the glorious view. The land within our vision was divided into two vast areas of different colour divided by one long straight line reaching to the horizon, formed by the edge of the irrigation area,\n\njust as if two huge pieces of cloth one yellow and the other green had been sewn together. On the one side we have the famous Sahara Desert, looking except for the white tents of Mena Camp nestling at the foot of the Pyramids, as endless, as pitiless and as bare as one could ever imagine. In great contrast is the other side with every spot except for Cairo and the roads covered with beautiful waving green crops, forming one vast paddock for there are no fences. Right underneath us is the cemetery of ancient Memphis, once capital of Egypt, with its long regular rows of mud mustabas\n\n(native tombs) and a palm tree here and there to relieve the monotony. Of course I carved my name on the stone on the top. After descending we went to the Sphinx and had a look at that great statue which was once a beautiful piece of work but now spoilt by great pieces broken off the features. Near this statue is the Valley Temple of the second pyramid, just being excavated, with its hugh pillars of granite, and floors of alabaster. Miers and I took a camel back to meet the others at the Great Pyramid and after mounting and going through the ordeal of hanging on whilst he got up, making us tilt backwards at a dangerous angle as he mount on his front feet, and then shooting us forward as his great hind legs came into play. Miers must have touched him with his spurs for he promptly sat down again. However, we managed to get him going again and at last reached our destination. We stayed in town to tea and we certainly needed it, when we got there, for a native boy offered us a card with the name of a British Restaurant on it saying it was only 2 minutes away. After we had followed him for about a quarter of an hour we reached the native quarter and so gave up the chase, turned and retraced our steps to the Café de la Paix all the more hungry for our fruitless trip.\n","49":" – This afternoon Tad, Miers Stewart and I visited the Zoo, and could hardly have spent a more interesting afternoon. There are I believe about 400 different species of animals and birds and the interest these aroused and the beautiful glimpses of scenery one gets as he walks along the shady foot paths, all decorated with pretty designs worked in different colored pebbles makes it seem like paradise after walking some of these revolting \n\nnative streets of Cairo. The monkey cage attracted a great crowd and some of their antics were very laughable, for they seemed almost absurdly human, and we even saw one mother run up to the little one, catch him by the ear and pull him along to her corner, where the little fellow looking quite guilty and crestfallen received a lecture and a parting smack before he made a rather slippery escape. There were some fine specimens of girraffs and as they walked about with their little heads on their long great necks poked over the high railings looking at us almost as if we were the exhibits and not themselves. Further along the nose and eyes of a hippopotamus were to be seen just poking out of a large pond and as we wished to see him the keeper just spoke a few words and the great grey back gradually rose out of the water and to see the look of interest one would think it was a German submarine rising to the surface and viewed from a British liner. The great animal waddled on to dry land, walked up to the iron railing and had the bad manners to open a really huge mouth and wait patiently for the keeper to put some lucerne in. This he did but when the crater opened again the handful was still there and so he put another one in, but the result was the same and it took three handfuls to make enough lucerne to go down. Evidently, the other was like a crumb to him. We had afternoon tea at a delightful spot on the edge of a pretty pond filled with ducks and their little ducklings darting hither and thither around the stately pelicans, looking like hugh battleships with their mosquito like fleet of destroyers, on the other side on a little shady promontory some more pelicans were lazily trimming up their feathers, whilst the scene was fittingly completed by the officers and men in Khaki and nurses in their uniforms of grey and red all gaily chatting together over their cup of tea, and cream puffs, making it impossible for such a thing as grim war to enter their minds.\n\nMonday – usual routine.\n","50":" –","51":" – To-day we obtained leave from 3 p.m. and visited the Native Bazaars down Mooski Street. I engaged a native guide but he lead us to a Jews place which was very dear and so we started wandering off by ourselves, going into all sorts of queer corners and seeing sights which fitted them. The general aspects \n\nof the streets was very oriental and the little sprinkling of western people only seemed to accentuate the eastern appearance by the contrast. On all sides were native shops and open stalls looking that dirty and untidy that you would think there was a competition for the dirtiest one. Standing outside thrusting some cheap trashy article under your nose was the owner, not forgetting to ask about five times its value, whilst little Arabs ran about holding their grimy hands out for \"Baksheesh\". Along the street comes the well to do, fat and contented turk, smiling complacently with his red cap on his head, his big body perched on the back of the little grey donkey, who ambles along in his gay trappings of red and gold, with the bell round his neck tinkling merrily as he wobbles his head and his long ears all the while, waving about like a pair of semaphore flags. Flashing past him is a gharry containing an officer and a red cross nurse, too absorbed to notice much. It is indeed a place of contrasts for winding its way among the broken down and dilapidated native carts with their even more broken down donkey led by their owner dirty and contentedly chewing sugar cane, is a private carriage with a beautiful pair of shining black arab horses arching their graceful necks and tossing their stately heads, whilst on the footpath, midst the slovenly natives, and unwashed children walks the overdressed French women looking like peacocks in a pigsty. In the brass bazaar you could see the natives sitting in front of their stall working on the plain brass chiselling out a design, the workers, in many cases being a mere boy. I bought three pieces of brassware after about five minutes of the usual bargaining for each piece, which generally ended by your getting it about half the price or less, I also bought an Egyptian Yahmash and a little broach set with small Abyssinian stones. \n","52":" –","53":" Usual routine.\n","54":" – To-day we moved into the D.A.C. lines so as to have all the artillery together, but we were not attached to it. Up to this date since our arrival in Egypt we have not done any training and when not on route marches or sightseeing our time was occupied by half hearted foot drill and signalling which I am afraid was not as long as the smokos.\n","55":" – Tad stayed in camp to-day, so Miers and I went and walked about Cairo, had a look at the Sultan’s Palace and then over the Kas-el-Nile Bridge, along the bank of this ancient river returning through Ghiza Gardens, there was not much life on the river and all along the bank lay a stream of white tourist streamers, which once must have rung with the gay laughter of merry tourists, but were now strangely silent and deserted like many other things since this awful war broke out and made men fly at one another’s throats and put us poor beggars on an iron ration of bully beef and biscuits with a delightful change of greasy stew for every meal for a week. Ghiza Gardens are very plain, but we could not expect too much in this direction from a country like Egypt.\n","56":" – This morning I went to Aerodrome Camp and saw Jack, and had a very welcome chat with him. In the afternoon Tad, Miers and I had a look round the central railway station of Cairo, but returned to camp early.\n","57":" – Jack and I went to the Kersail in Cairo and enjoyed the show very much.\n","58":" 22\/2\/16.- To-day we bought mats for the floor of our hut, which made it very comfortable. After parade Tad and I went down and had a game of Tennis on a court in Aerodrome Camp, where the charges for the court, loan of racquets and balls for 40 minutes is 5 piastres each for two or 4 piastres for four playing, and it seemed like home again to have a good game.\n","59":" – This afternoon Stewart, Tad and I went to the Citadel, and of course visited the Mohammed Ali Mosque, which is just inside the gates and overlooking the courtyard where the famous massacre of the Mameluke Beys took place by the above Sultan, The Mamelukes were asked to a review and they paraded on their beautiful horses into the courtyard when the portcullis fell and there was no escape from the fire from the battlements. The main entrance of the Mosque opens into the usual courtyard with its fine old fountain richly carved. Running along all sides are a large number of pillars giving a stately aspect to the general view . From here we enter the main room of worship with its beautiful red carpet, decorated with bold designs in gold. What first strikes one is the curious light which is caused by the sun shining through\n\nbrilliant coloured glass. On looking upwards I saw one of the most wonderful ceilings I have ever seen. It consisted of a number of domes with four smaller ones behind these. At the corners of the square formed by these domes are four grand stately pillars of ababaster supporting the ceiling and between these pillars and the walls still four more smaller domes are found. The whole of these domes are decorated by intricate and bold designs in gold on a black background, the whole ceiling being one of graceful curves, deep shadows and small patches of light where the suns rays vainly attempt to pierce the gloom and succeeding in bringing some of the beautiful work to light, but only in the end to be swallowed up by the shadows, which give a sort of vague endlessness to the whole ceiling making it all the more grand – from this roof which is of great height, suspended on long iron chains hangs a hugh circle of electric lights over 50’ diameter and containing as far as I could imagine over 100 lamps, the whole only being about 8 feet from the ground. There are also four huge brass chandeliers with four tiers of lights and the effect when they are all lit up must be simply wonderful. Leaving this beautiful mosque we went onto the terrace where you get one of the recognised views in the world. U are standing on the generable old walls of the Citadel,, which still seem to keep some of their ancient strength and stretching before you are the innumerable roofs of Cairo, whilst rising from their midst are the thin graceful monarchs of the mosques in their setting of sky blue and beside them are their more stolid companions the domes. Far out on the horizon to the left, winds the sinuous Nile like a huge silvery backed snake through the beautiful green crops and out further on the edge of the endless desert stands those old monarchs, the pyramids. As a contrast on our immediate right is one of those bare native cemeteries with their rows of mud tombs, far different from the richly decorated tombs of Mohammed Ali in his beautiful Mosque. Leaving this scene we met two Indian soldiers who showed us over the hospital full of wounded Indians from the Peninsular and France and then an English M.P. who was quartered in the barracks took us on the old \n\nwalls the other side and also showed us some Turkish Officers captured at Gallipoli. On returning to our tent we came down from the sublime to the ridiculous for there was one of the boys scratching another’s back with a tent peg.\n","60":" Usual routine – One of the boys actually saw a roast duck coming out of the oven in the cookhouse and on asking for a leg the cook was ungracious enough to reply \"Do you think it’s a centipede\"?\n","61":" Usual routine.\n","62":" – This afternoon I had another look around Cairo seeing many of the back streets and was absolutely disgusted with the filth and carelessness of the natives.\n\n","63":" – On fatigue to-day and had my first drive on a mule team with Tad and Donnelly as the other two. The two lead mules were very stubborn and Tad had a good deal of trouble but managed them very well. Later he gave Bray a chance but he only lasted about 10 minutes being unable to keep them in hand. When Tad took them over again he was in an awkward position and ran into a hut first and then a gate post. In the afternoon I had a cut at them, and managed without accidents although at one spot one mules wanted to go one way and one another, the first one nearly walking into the infantry lines, however, we got them going at last and altogether during the afternoon I pulled the bit clean through the mouth of the nearside mule half a dozen times, for he had a very hard mouth and had a trick of opening it to let the bit through.\n","64":" – Tuesday and Wednesday – Usual routine except that on Wednesday I was in charge of Camel Guard and had the new experience of feeding, tying down and rugging those curious animals. A rope is tied round the fore feet to keep them bent so that they cannot rise during the night.\n","65":" – This afternoon a violent dust storm sprang up and so we had the afternoon off.\n","66":" - to-day we had an organised trip to the Pyramids so of course we all went and Tad, Miers and I had a look at that grand Sphinx, riding on donkeys there and back. My donkey was much\n\nfaster than the other two, and so I left them and beat everything down the hill, coming down at a great gallop. The scene on the road leading to the Pyramids is I think one of the most interesting sights out there. The road is a steep ascent leading up between fairly high walls and at the bottom is the tram terminus. When you alight you are immediately met by a crowd of natives in their flowing robes, all babbling and gestulating at the same time, and endeavouring to hire their donkeys or camels. You leave the shady terminus with its palm trees and green crops to step out into the dazzling desert, the edge of which stands those ancient monuments. The road is a veritable kaledioscope of colours with the bright trappings of the animals and the clothes of the natives, intermingled with the more sober khaki of the soldiers. Trudging slowly up the hill side by side and with no eyes for anyone else are a wounded officer and a red cross nurse in her prim dress of grey. Just behind, joking and laughing come a group of convalescent boys in their hospital suits of bright blue flannel, and which look like gaudy pyjamas, whilst just round the bend ambles a little donkey struggling underneath a big broad shouldered Australian, whose sunburnt face is as usual lit up with the everlasting smile, prompted by that everlasting joke; probably cracked about something which to any ordinary citizen would be a terrible hardship or a great grievance. Glancing ahead of us we see the old ungainly camel ambling down the hill throwing his legs about as if they did not belong to him, his ugly body moving up and down like a ship in a heavy sea and pumping all sorts of strange noises out of his throat. Clinging to the wooden saddle on the top of this animated bundle of awkwardness is a young lady looking almost longingly at terra firma. But something more exciting catches our eye for down the hill rushes a number of boys having a donkey race, the little animals going for all their worth under the stimulus of a whack from a big bronze country lad whose long legs almost touch the ground. Down they come laughing and joking, all the time waving their arms and legs about, with the poor little donks nodding their heads, their great ears flapping about, almost as much as the men’s arms as they whack each other’s mules. The whole effect seems like a human whirlwing, with\n\nthe arab drivers panting and puffing in the rear imploring them to stop, which of course gets scant heed from the excited riders.\n","67":" after","68":" The last day for which I have so far written up my diary, we were fairly busy with many changes so that I have let it slip each day. Just after this date we moved to Moascar when we were formed into the","69":" B.A.C. and I was made an acting corporal. We were not there very long before we moved to France. The last of the days at Moascar was a brute. We struck tents about 10 a.m. and a heavy wind sprang up. Covering our baggage, which was lying on the old tent sites with sand, as we stayed like this all day and had to eat our meals in a veritable sandstorm you can tell how rotten it was. However, we managed to swallow two or three mouthfuls of stew, which by the time it reached our mouth had a nice covering of that wretched sand, whilst bread jam and sand formed our rather novel meal for tea. We left about 9 p.m. and held camp fire concerts up to that time. We travelled to Mex, a special military harbour near Alexandra, in open trenches, being in them till 12 p.m. the next day and as it poured that night and was bitterly cold the next day we had a pretty rotten journey for our last trip through Egypt. Our voyage to Marseilles in the Minnewaska was uneventful, although we learnt that we only missed a submarine by half an hour, the Minneapolis, a sister boat to ours, being torpedoed just ahead of us. Of course we had to wear the life belts every moment of the day, and sleep with them alongside. From Marseilles we journeyed by train to Le Harve and I thoroughly enjoyed the two days we were travelling. The scenery was everywhere beautiful and some of the quaint little villiages and farmhouses nestling at the foot of a mountain the long slopes of which are daubed with all colours by the different crops and ploughed fields and vineyards, really formed some dainty pictures. The views are so different from what we see in Australia. Instead of the wild grand scenery of the Australian bush, we have well ordered rows of poplars making an avenue for those beautiful white roads, with here and there an ancient church or wall. The absence of fences make the country side look like a patchwork quilt, but with what beautiful patches one can hardly imagine.\n\nHere we see a waving green crop of barley and besides it a big brown patch where a little boy of about 17 drives a beautiful big horse by one rein, up and down, adding one more furrow to take the seed which will dye the patch a different colour. In the background are large hills, the slopes being covered with thousands of grape vines,, their spring buds shyly creeping out, in the valley to the left is a picturesque French village with its ancient plateau, many of the old walls crumbling away and its quaint little church seeming to tell you of its hundreds of years existence. At Le Harve we stayed about a week and I was made No. 1 of A. Sub, the night before leaving. Our next move was to Bleringham when we were billeted in a farmhouse. Here I found my scanty knowledge of French stand me in good stead, for the old lady who could not speak a word of English would give me anything I wanted. From Bleringham we followed the Brigade, which had gone into action, to a billet near Steinwork and from here supplied them with ammunition. Here I also acted as No. 1 of A sub until a Sargeant was brought from the","70":" Battery. The work here was rotten. Reveille was at 5.30 when all but the Sub on duty exercised horses or later mules, and then turned out of stables about 7.45. Fall in 9.15 with inspection, after which exercise again and then stables with grooming, turning out about 12.45. Fall in again 2 with harness cleaning till 4.30 then stables till 5.45 or 6 p.m. After this there was feed up till 7.30. This routine went on without variation day after day and if you were out all night with ammunition well youo had to get up just the same. At 5.30 a.m. I get heartily sick of it and wrote to Lt. Dimond to see if it was possible to get in the battery as a gunner. Lt. Dimond kindly visited Capt. Jenkins and arranged it, but orders came through to sent up 1 N.C.O. and three men were to go to each battery for training and so I was sent for a month to the","71":" arriving here on the","72":"\n","73":" Arrived at the 14th Battery about 8 p.m. and had to stand to till about 2 a.m. owing to strafe expected.\n","74":" Put into B sub pit with very nice fellows. The strafe took place to-night, and we poured shells into the Germans for about 45 minutes, each gun firing about 128 shells. \n\nThe result of the strafe we heard later was four prisoners and many Germans killed, whilst we lost 1 killed and a couple wounded.\n","75":" 1916, - Joined in the mess formed in the pit and now have supper every night, either eggs, fried and scrambled, or porridge and always good rich cocoa. The pit is wonderfully comfortable with a little stove and four canvas beds made on a wooden framework. The sides are of course sandbags and the roof corrugated iron, covered with earth. We have hessian screens to go across the mouth and also behind the gun so that we can light the fire and have a light each night. After having a good big supper with plenty of the everlasting jokes, all we have to do is to tumble into bed with a sigh of contentment, hoping that both the Boches and our infantry will keep quiet for the night. The two on guard, however, have to stand to each morning from 2.15 to 3.15 as at this period attacks are most likely to happen and all branches of arms in the firing line have to do the same at this hour.\n","76":" – Usual laying to-day. To-night Postle and I went across to the old orchard and picked a great heap of rhubarb which we cook overnight and have cold next morning for breakfast. \n","77":" 9th.- We fired a few shots to-day on aerial observation, but otherwise quiet.\n","78":" – Quiet all day to-day. Had instruction in C. Pit.\n","79":" – Had instruction in C. Pit, quiet all day.\n","80":" – Had to stand to from 12.30 p.m.to about 1.15 a.m. next morning during 1st division raid.\n","81":" – Went to Bathea to-day – Aeroplane shell failed to burst in air and burst on landing about 15 yards from us.\n","82":" – Quiet day.\n","83":" – Did some shooting with aeroplane observation.\n","84":" – Fired about 32 rounds to-day otherwise quiet. Had machine gun soup for dinner (that is soup made in a hurry)\n","85":" – Germans put over 100 crumps into the old positions of the 20th cutting up the orchard a treat, and in some cases the force of the explosion has withered the little red current bushes, up to nothing. Otherwise had a very easy day. Received the four parcels from home per the Comforts Fund.\n","86":" – Had some battery action but the Germans did not retaliate.\n","87":" – Building our pit to-night, had some more shooting in afternoon – German must have thought they had a battery in the field at other side of billet for they put in over a hundred crumps.\n","88":" – On fatigue, building new positions all day\n","89":" – No shooting to day – On new pits to night till about 12.30.\n","90":" – The 42nd Battery arrived to-day and in the afternoon we fired about 30 rounds in salvos, battery fire and gun fire. We were just letting them have the gun fire for all we were worth when, bang came a crump (5.9 shell) just the other side of the hedge near D pit, then they put another in the front of C and then another just behind D again, so then we knew they were ranging on us and the Captain withdrew the detachments and we took shelter in the trenches. Altogether they put in 149 shells and lobbed them all round the pits without actually hitting them. Our gun was very lucky as they put one right in front of the gun and sending a lot of earth down the bore, whilst another actually clipped the edge of the pit. We came down to the wagon line to night only leaving the gunners in each pit to instruct the battery taking over.\n","91":" Usual routine, went to the pits on the bike.\n","92":" Usual routine, went to the bathes.\n","93":" At last I am adding a few more words to this very incomplete diary. Somewhere about the end of June we left Erquinham and after marching all day found ourselves at Neave Eglise in Belguim and relieved a Tommy battery on a portion of the front and not far fromYpres and Plug Street. At Erquinham I was made Battery Commander’s Directorman and at this front I was put on observing with Bdr. Hill. Our O.F. was on top of Hill 63 and from there we could plainly see every detail of the German’s first system of trenches, however, we only stayed here a couple of days when we went to Saint Omar breaking our march for a couple of days rest at a billet on the road. At Saint Omar we entrained and when we at last came to the end of our\n\nrun, found ourselves at a military siding near Amiens. From here after about 6 hours march we reached Bellog-sar-Somme, at which place we rested for about a week and during that time had manoeuvres every day. As I was Directorman I used to ride ahead with Captain Tanning, who explained everything as he chose the position for the battery etc. and it was great to stand at the O.F. and see the Battery come into action on the flat below. The country around here was beautiful, whilst the effect of the numberless red poppies and blue cornflowers sprinkled amongst the golden wheat all shimmering in the bright sunlight made a wonderful picture. It was great to stand on top of a hill and see miles of undulating country cut up into little squares of green, chocolate and gold and dotted here and there with picturesque little woods, out of many of which peeped an ancient chateau or the faint outlines of a little villiage. One could not possibly have thought of war as he rode on a beautiful spring morning along those white winding roads through stately avenues of elms and with such scenery surrounding him. Fromm Bellog we went to Val-de-Maison and after staying there a few days continued our marches and at last camped the night just outside Albert. Next afternoon the Captain called for me and we rode out to the position the guns were to take up, which proved to be a valley just behind Poziers. Our troops having occupied it about two day’s before. The guns came up towards nightfall and we were soon contributing our modest number of shells to the hundreds that were whistling their way across to \"Fritz\". Corp, Miller and myself have built a dugout on the side of the road just behind the guns, the battery being situated on the hill on the left and at the head of the valley (Sausage Valley) Sitting in my dugout I had a great view and the whole valley was a scene of indescribable activity, like a huge mining camp, with the road looking more like a great centipede as pack horses leaded with ammunition, travelling kitchens, artillery ammunitions wagons and transports and all sorts of vehicles of all shapes and sizes not forgetting the ever present ambulance waggons, came wending their way in and out the troops passing to and fro. Of the latter, these going into the trenches, were clean shaven and as steady as a rock, but those\n\ncoming the other way were a great contrast with their mud bespatted clothes, grimy visages with their three or four days growth, whilst their nerves were all to pieces, for when near our guns as they fired, they gave a great start and wondered how we could stand the continual road. But of course we do not notice it, and besides we have not been through that living hell which those poor chaps have braved. Nearly every evening at a given signal that valley becomes like a living monster of the mythical legends, roaring and spitting fire, as with one accord all the guns open out. Quickly the red veil of dust envelopes all and through it in every direction comes the fitful flashes, whilst we being the most forward battery, all shells pass over us or nearly so, making one continual buzz just like a hum of mosquitos, but the Germans alone knew the strength of their sting. Fluttering round these fitful flashes and lit up by their angry glare are the phantom like figures of the gunners as they feed these hungry monsters, who appear unsatiable, whilst above the din arises the clear voice of the officers calmly directing this great activity. The whole looks most weird amidst the smoke and dust.\n","94":" – To-night a big attack is to be launched and thousands of troops are winding their way, joking and laughing towards those fateful trenches, not knowing and not seeming to worry whether they will ever pass this way again. Certainly no thoughts of the inferno into which they are steadily marching, darkens their cheerful faces. Down in the valley, the long string of ambulance waggons are nearly complete, whilst the supply of ammunition, bombs and other man killing devices steadily flows along, ready to take its toll of many rounds of human flesh and blood.\n","95":" – The ridge was captured early this morning and at 2.30 a.m. I had to take the instruments and accompany the O.C. to the valley behind the ridge into which our battery was going to move. About 30 gunners also came to dig gun pits. We had to wait in some stinking trenches for dawn when I accompanied the B.C. whilst he chose the position. We had wandered all over the place for several hours, before a position was finally\n\nchosen. The gunners then started digging whilst I went on again with the B.C. which by the way, we failed to do. All this time the Germans put over occasional shells in every direction. We returned to dinner and just afterwards the enemy put a few big ones just where we were making our pits and these had to be abandoned for a time. The number of wounded coming through was very small compared to the affair, whilst the prisoners were brought in in droves, the total number running in some hundreds. The attack was highly successful whilst our artillery fire was deadly accurate and the curtain lifted just in front of the advancing men with wonderful regularity. The Germans were utterly demoralized and gave themselves up in batches, whilst as they came marching down the valley they seemed delighted to be made prisoners and were joking and laughing with our men for many of them could speak quite a lot of English. In their turn our fellows would share their water bottles and cigarettes with them and it was no uncommon sight to see half a dozen big strapping Germans marching along under the sole guard of a stumpy little Australian, sauntering along beside them with his rifle slung carelessly across his shoulder and just waving his hand when directing them which way to turn. Suddenly he would stop to have a short yarn to a mate whilst the prisoners strolled slowly on or sat on the bank waiting for him to catch up. We did not like our new position in the least, for odd crumps kept scattering us all day, so we considered ourselves very lucky when a new English battery took over in the evening and we returned to our old position prior to going for a divisional rest.\n","96":" – Had a good game of chess, this morning and as there is no observing to do I take my turn on the telephone, so as not to go back to the wagon lines and was up at O.P. this afternoon. Corporal Miller and I made a set of chess out of Varey Light cartridges, but one of the boys had a little pocket set which we used instead.\n","97":" – Last night the Germans put over a large number of\n\nheavy shells into the valley killing about 20, eleven of which were artillery. Luckily they all missed us. One Horse got blown clean in halves, half of him being in one place and the other half about fourteen yards away. It is a pitiable sight to see the dim figures wrapped in their blankets or only covered over by them, in one case the bundle being just like a ball, no vestige of the human shape being left. Their artillery fire is, however, not nearly so effective and heavy as our own, for the trenches we have captured, are know no trenches at all, but a succession of shell holes and in fact when the infantry went over to take them they could not find them, everything being so ploughed up. In the original front line, however, the Germans had constructed some marvellous dug-outs fully 30 feet under the ground, and made of reinforced concrete, whilst access was gained by a steep stairway. In cases they actually had lifts in them. The stench in these captured trenches is awful with the dead bodies of Germans, English and Australians, that have not yet been buried.\n","98":" We had another man wounded to-day making 3 in all since coming here, which is indeed very lucky as most of the batteries have been several killed and wounded. This morning I went with Fred Jones and collected different samples of bomb which I am going to try and get home. About midnight Fritz lobbed a gas shell right in front of B sub pit and so we had to done our helmets. Luckily only one came over and no one was affected, except for a slight irritation of the throat. The gas has an odour just like the sweet smell from a garden in spring, which certainly belies its deadly effects.","99":" We have had orders to pack up as we were relieved this morning having been about 14 days here and the hottest spot we have struck yet. If we are to come back here my only hope is that the Germans have been shoved right off the ridge on to the plain where our cavalry will have a chance. It has been hard enough work pushing them back from this side.\n","100":" –","101":" After leaving Sausage Valley we marched to St. Seger, taking two days on the route and stopping at\n\nVal-de-Maison on our way for the night. At St Seger we had a particularly good time, for with the exception of 2 hours exercise in the morning and cleaning harness from 2 to 3 in the afternoon we had the rest of the time to ourselves, whilst sports were arranged for us every afternoon.\n","102":" Just before tea we had orders to move within half an hour so that everything was hurry and bustle, however, we managed to be on the road on record time, and marched all night to a spot near Albert where we rested for about three hours. After that we moved out to a waggon line position just outside the town, and as it had been raining on and off throughout the march it did not look too comfortable. We had been there about an hour and a half when the Captain called for me and we went to find the sight for our gun pits. We walked all the way and eventually a site was picked out in Mash Valley. Not long after we started the rain came down in torrents and we were soon wet through and trudging over the slippery ground was no good. It was about 10.30 p.m. before we pitched camp again, wet through after having had nothing except a biscuit or an egg since dinner time the day before so you bet I was hungry. I had, however, some tea with the Captain before turning in so felt pretty right again, although very tired, for after riding from about 7 the previous evening to mid-day I had immediately to go out on this expedition walking about 10 miles in all. Next day we went into action in this place and are still here on August","103":" having had a pretty quiet time. One afternoon whilst returning from Sausage Valley where we were expected to take up a position, a crump burst about 10 yards away, but luckily I was close enough to miss it, and it went over my head. As I was walking in the open I took to the trenches immediately.\n","104":" to","105":" Things still very quiet here, although Fritz has been putting a fair amount of shrapnel over of a nighttime. Luckily no one has been hit. Whilst having a bath a couple of days ago I slipped and a nail in the board I was standing on put a gash of about 2 inches on the bottom of my foot. However, it is very clean and it only means a short time before it is quite right again. The night before last our boys supported by some\n\nTommies (or Scotchies) took Moquet Farm capturing about 1200 prisoners. The enemy’s shelling was so hot however that they retired to a line just behind it, leaving the farm in No Man’s Land. We are to leave about midday to-day for as the rumour goes some part of Ypres where most likely we will spend the winter if this rotten war continues. As you may be sure we don’t like the idea of spending the winter in France, but would much prefer Sunny New South Wales. My home here was a captured German dugout well ventilated, nice and quiet and pretty safe. Some of those captured dugouts are great pieces of work, sometimes 30 feet deep, lined with wood, with bunks built into the walls in the fashion of a ship’s cabin. Invariably they have two entrances with a passage way connecting them, so that if one should be blown in the occupants could escape by the other. Strolling amongst the ruins of Ouvilliers the other day I found what had evidently been an Officer’s dugout. It was a substantial brick vault, set well down into the earth and contained an iron ¾ bedstead and evidence of a lot of other furniture besides many empty champayne bottles and spirit flasks And yet I found in this place a couple of German Christian papers So far it has been very quite for us, except for occasional crumps and a bit of shrapnel, but it is a filthy place with the multitude of flies and dead bodies and limbs lying about, some only half buried, others with not a speck of dirt on them.\n","106":" Thursday- As I continue this diary, we are at present holding a portion of the front in the Yres salient, our pits not being far from the town itself. And what a wreck it does look with its fine buildings and finer cathedrals all a mass of ruins and riddled with shell holes. Up till to-night I was observing, but a new scheme has come into vogue whereby a sergeant goes up from each battery every day, so that my old job is now done in. The O.P. here is the ruins of an old brick kiln, the telephonist being in the vault and with a good fire going it is quite a comfortable little spot. The actual O.P. was slightly different, however, you climbed up on to the wrecked roof and sat in a little corner seat by the chimney with a sloping piece of tin overhead. In this is the peep hole for \n\nThe telescope and lo you have the scene before you and what a desolate one it is.\n\nIn the foreground are dozens of houses all in different stages of being blown to bits, and assuming some most grotesque shapes. Here also on Observatory Hill to the left, nature has certainly done some wonderful patch-work, hiding up some of the gaping holes with foliage, but Mount Sorrell, the centre of the picture is like a huge heap of rubbish, wrecked dugouts, endless shell holes, large minecraters and parapets blown to bits are all mixed up in a most chaotic manner to make up this hill actually graced by a name. To the right the trenches run in front of a wood, and what a wood it is bare and blackened by endless shell fire and with its trees standing straight and black against the corners to act as a table, the telescope poking out near his right hand and a hot cup of tea that the telephonist has brought up near his left hand, and surround this image with loose bricks, broken beams, twisted iron, and the stub of a chimney with the top blown off as the foreground and you will have a picture of \"yours truly\" observing on the western front. I am sharing a dugout here with Corporal Miller the A.M.C. Corporal attached to the battery, and we have some great games of chess. My bed is an A.M.C. stretcher which I found up at O.P. and every night we have a fire and supper consists of cocoa and biscuits or cake. The most elaborate dish we have had as yet consisted of crushed blackberries and condensed milk which went mighty well. There is a canteen and the Y.M C.A. nearby, the latter having a library which of course we patronise. Yesterday a circular from G.H.Q. called for volunteers for commissions in the R.F.C. so I promptly put my name down for it although I am afraid there is no chance, however, I wrote to Grandma asking her to find out from Colonel Byne if I could get an ordinary transfer as a Pte.\n","107":" We have now to observe from the front line of trenches, and so I went there to day with Mr.Osborne and came away with a still greater respect for the infantry for to live there for seven days during bad weather as they have to do is to have the most cheerful of spirits thoroughly squashed. At one part our front \n\nline is only about 15 yards from that of the Germans and so you have to speak in a whisper. I saw one curious thing which was that one of our periscopes had been put exactly opposite to one in Fritz trench, and as I looked in on several occasions I could see the Germans looking at me, so that we had a good look at each other. During the morning he threw over some cigarettes and the boys in return showed him a tin of bully beef by placing it in front of the periscope the image being duly reflected in his, and he nodded, so over went two tins. He then placed his rifle in front of the periscope and made the action of throwing it away from him, whereupon our boys nodded vigorously knowing that he meant fighting was not in his line. So on the spot quite an intimate friendship sprang up between otherwise deadly enemies. Things were very quiet, only a few \"minnies\" being sent over into the trenches.\n\nMet Grange and Clifford two Burwood school boys.\n","108":" – Usual routine.\n","109":" – Went to front line again with Osborne, and had a pretty hot time with shrapnel in the afternoon, one smothering me with dirt, as it hit the parapet just where I was leaning. In the morning Mr. Fisher, Birdwood and a lot of other red-caps came and visited the trenches. I had quite a yarn with Fisher and he told us about the two Zepplins being destroyed in England.\n","110":" – We made an important addition to our palatial residence (dugout) to-day, extending the front using a cupula for the roof, thus making a room designed to act as kitchen scullery, dining room and drawing room all in one. But the ingenious part of the whole business was our fire place. Mind you I said \nour\n fireplace for although it was a borrowed idea we were proud of it, being the first to make one. It consisted of a sheet of galvanised iron forming a part of the wall, with a square cut out near the bottom for the fire place. Against the out side another sheet of iron was bent in a semi-circle and placed against the flat surface of the other sheet, thus forming the fireplace where the square was cut away the rest being the flue. An old grate installed and we had the \"dinkum oil\" Had a swim.\n","111":" – Went with Mahan to the trenches to-day and had a \n\nfairly quiet time and amused myself watching Huns pass a certain place where we could see into their trenches. Had a swim on return. \n","112":" – Went to canteen in morning and read all the afternoon ending up with a swim.\n","113":" – Usual routine.\n","114":" – Went with Osborne to trenches and struck a curious character which would have delighted the heart of Dickens. There he sat on a sandbag, cramped up in the narrow trench, his heavy boots testifying to some rough work and his muddy clothes to many hours spent in those dirty quarters. Yes there he sat his unshaven face partly hidden by a hat which told its own tale of hardships and lone weary vigilences in the field of battle and yet he was writing poetry and examining through his big round glasses some really good sketches he had made whilst on our days leave to England. Some of his pieces, one of which was printed on a card were really fine, and the poor old chap’s mind was certainly not fettered by the dreary surroundings. The rum jars, minnewaefers and rifle grenades have been fairly active of late, and it is curious to watch the first two as they appear like a football kicked from the enemies trenches with every eye following its wobbling flight to see which way it is going to fall, and as it takes its downward course there is a general scatter in that direction, for as soon as they strike the ground up goes the great column of earth and stones, and it someone has been unlucky, human flesh and bones as well.\n\nIt is now","115":" and so far things have been very quiet except for the death of poor Tibby the cook, a shell killing him outright as he was coming out of his cook house.\n\nLately I have been taking a few trips into Ypres and having a look at the ruins there.\n\nSt. Peters Church is perhaps the least knocked about of the lot, portions of the altars still standing but all the work, building sculpture and decorations seems to me to be very cheap. In one corner Christ in activity from birth to Calvery is portrayed by statues set in a number of grottoes built with stones and plaster. A hill is built with a path leading to the top where stand the\n\nthree crosses. At the bottom is the stable with statues of Mary and Christ in the manger, whilst all the way up the miniature hill are statues showing different portions of Christ’s life, the whole being crowned with the Crucified Saviour, and the two thieves on either side, the whole work including the statues is very ordinary but viewed in the dull light streaming through the coloured glass, there must have been a certain impressiveness which certainly is not there now in its ruined state. We of course climbed up the Tower as far as possible. The Cloth Hall and St. Martins Cathedral has been more unfortunate and very little except the walls and Tower is left standing, and it is very hard to picture the building as it must have stood before the war in all its magnificence. The construction of the pillars struck me as very curious, consisting of a great number of round stone discs about 18\" thick and laid one on top of the other like a huge pile of pennies, all cemented together. This construction looks very weak and two hugh pillars have fallen down through being struck at the base by a shell. All the \"pennies\" slipping off their setting. However, the toll tower is still standing and so we climbed our weary way up those hundreds and hundreds of steps. Each step is a separate piece of stone, and forming a spiral stairway by being set into the outer circular wall at one end and the other end balanced on the one below. This is all very well until you come to a part where the portion balanced on the one underneath has shifted, to one side being only held up by the outer wall, then perhaps a little further up they will have shifted the other way making the whole stairway look very insecure. But at last we step out on top and see all around us are green fields fine rows of trees while on our right is the lake in its beautiful verdant setting, and its regular fringe of elms only broken where the house dips its side walls right into the shiny surface. On the horizon we see the ridge held by the Germans looking very bare and ugly as it lies in amongst those woods standing out stark and black as each limbless tree seems to tell its tale of suffering. Looking nearer our eyes are again gladdened by the green and brown tints of nature, not spoilt by the ravages of war, but letting our eyes wander still nearer they gradually become clouded because lo right at our feet is that great rubbish heap Ypres. How hard it is \n\nto imagine the grand cathedrals with all their impressive beauty or the quaint little shops and cottages which once stood in the place of those ruins, or the gay throng, the patter of whose feet those very cobble stones, now scarred and torn by hugh shell holes, once sent back their cheerful echo. Looking from such a height one can see the full effect of the desolation and havoc, and no-where is there a house that is not ruined beyond repair and nowhere is there any spot where this desolation is relieved except where nature has tried ineffecturally to weave a kindly web of green over the heaps of blown down bricks twisted iron and ruined timber as if to cover up a nasty wound. How is it you wonder that such an ugly scene so characteristic of German Culture should have such a beautiful setting. \n","116":" Left about 9 p.m. with the right section for the waggon lines, as we are leaving this position and going as rumours say to the Somme again.\n","117":" Right section left Poperinghe at 9 a.m. and arrived at our camping place near Cassel about 2.30 p.m. No leave granted. \n","118":" Left section joined us to-day and general leave granted to Cassel so Laurie and I went in. The town is on a steep high hill and owing to hostile aircraft is kept in utter darkness, so we had to grope our way along dark streets opening every door we came to in order to ascertain what sort of a shop it was. After opening what seemed to us an innumerable number of doors we at last struck a good little restaurant and had a good meal.\n","119":" They suddenly woke us up at 3 a.m. this morning and told us the Battery would move off at 6 a.m. which it did. From that hour we were riding all day, with only a short halt to feed the horses, but unluckily not ourselves, arriving at Clerques about 5 p.m. where we were billeted in a big deserted pretty chateau. As it was raining all the way we had a pretty rotten day of it.\n\nFrom Clerques we marched to St. Omar and entrained late at night.arriving \n\nAt Saileaux about 2 p.m. the next day, the train being about 9 hours late. When we again got on the road we trekked as far as Bussy halted there for the night and then went on to \n\nnear Albert.\n\nThe next day Keating Thomas Stroud and myself started off at 7.30 a.m. for the new position we were taking over from an English battery. We arrived here about 11a.m. and went from then till the following tea time with only one meal and no blankets, not forgetting the wet feet, which I managed in my case to keep warm by putting them both inside about four sandbags.\n\n"}}