{"Document Name":{"0":"Diary_0061","1":"Diary_0061","2":"Diary_0061","3":"Diary_0061","4":"Diary_0061","5":"Diary_0061","6":"Diary_0061","7":"Diary_0061","8":"Diary_0061","9":"Diary_0061","10":"Diary_0061","11":"Diary_0061","12":"Diary_0061","13":"Diary_0061","14":"Diary_0061","15":"Diary_0061","16":"Diary_0061","17":"Diary_0061","18":"Diary_0061","19":"Diary_0061","20":"Diary_0061","21":"Diary_0061","22":"Diary_0061","23":"Diary_0061","24":"Diary_0061","25":"Diary_0061","26":"Diary_0061","27":"Diary_0061","28":"Diary_0061","29":"Diary_0061","30":"Diary_0061","31":"Diary_0061","32":"Diary_0061","33":"Diary_0061","34":"Diary_0061","35":"Diary_0061","36":"Diary_0061","37":"Diary_0061","38":"Diary_0061","39":"Diary_0061","40":"Diary_0061","41":"Diary_0061","42":"Diary_0061","43":"Diary_0061","44":"Diary_0061","45":"Diary_0061","46":"Diary_0061","47":"Diary_0061","48":"Diary_0061","49":"Diary_0061","50":"Diary_0061","51":"Diary_0061","52":"Diary_0061","53":"Diary_0061","54":"Diary_0061","55":"Diary_0061","56":"Diary_0061","57":"Diary_0061","58":"Diary_0061","59":"Diary_0061","60":"Diary_0061","61":"Diary_0061","62":"Diary_0061","63":"Diary_0061","64":"Diary_0061","65":"Diary_0061","66":"Diary_0061","67":"Diary_0061","68":"Diary_0061"},"Date":{"0":"unknown","1":1814.0,"2":1815.0,"3":1817.0,"4":1818.0,"5":1819.0,"6":1820.0,"7":1821.0,"8":1822.0,"9":1823.0,"10":1824.0,"11":1825.0,"12":1826.0,"13":1829.0,"14":1830.0,"15":1831.0,"16":1832.0,"17":1833.0,"18":1834.0,"19":1836.0,"20":1837.0,"21":1838.0,"22":1839.0,"23":1840.0,"24":1842.0,"25":1843.0,"26":1844.0,"27":1846.0,"28":1847.0,"29":1848.0,"30":1852.0,"31":1853.0,"32":1854.0,"33":1855.0,"34":1857.0,"35":1858.0,"36":1859.0,"37":1860.0,"38":1861.0,"39":1862.0,"40":1863.0,"41":1864.0,"42":1865.0,"43":1866.0,"44":1867.0,"45":1868.0,"46":1869.0,"47":1871.0,"48":1872.0,"49":1873.0,"50":1874.0,"51":1875.0,"52":1876.0,"53":1877.0,"54":1878.0,"55":1879.0,"56":1880.0,"57":1882.0,"58":1883.0,"59":1884.0,"60":1885.0,"61":1886.0,"62":1888.0,"63":1889.0,"64":1890.0,"65":1891.0,"66":1896.0,"67":1898.0,"68":1907.0},"Entry":{"0":"\nSomme, ","1":" A meeting of all officers of the Bn. was held at Bn Hqrs. this morning after Church Parade \n5E\n 4D\n\nMajor Cameron who is temp. commanding the Bn. told us that we were to be prepared to move into Germany within a few days. Four Divisions of the A.I.F are to form part of one of the armies of occupation in German Territory. These four are the 1st. 2nd 4th and 5th Divisions. The 3rd Div. it is rumoured is to take part in all the reviews etc in London and Paris as the present G.O.C. A.I.F. in France was the Div Commander of the","2":" Div until July of this year.\n\nThe conditions on which the Huns were allowed an armistice stated that the German army had to evacuate not only the whole of France, Belgium and Alsace Lorraine but a very great portion of German Territory as well. The process of evacuation will be slow and armies of occupation From the North to the South are to keep within a days march of the Hun armies. The Belgians will be on the extreme left or northern end of the line, British next French and Americans on the extreme right or Southern end of the line.\n\nWe are to move fully equipped. Peace terms have not yet\n\nbeen concluded but everybody is confident that there will be no more war. However Foch is not going to take any risk at this stage of the game.\n\nWe have been informed that the censorship may now be relaxed. Men are now permitted to state where they are and where they are going to.\n\nCameras can be used at will. This will be a great piece of news for the camera fiends. The difficulty I find is to get films but maybe that difficulty will soon disappear. \n\nGermany has to hand over such of her naval craft as the Allies may ask for\n\nand these will be interned in an Allied Port, most likely a British Port.\n\nThe men are to be instructed to treat the German people civilly. They are not to be humiliated in any way. We are to occupy territory near the town of Coblenz \nand\n Our Division Commander says it is some of the most interesting country in the world. A good time is promised the men in the way of sight seeing.\n\nThe British Naval detachment under Admiral has anchored off Constantinople at last. The task of clearing the Narrows of mines was a \n\ndifficult one but it was accomplished without mishap.\n","3":"\n Winter is right here at last. The days are frosty and misty with fitful bursts of sunshine and the familiar colourless skies of 1916 and 17\n\nNow the war is about quite finished and the fighting stopped, the papers have come down to stale old political news. All the politicians are ‘pushing their frames in’ for a good job. It is generally believed that Lloyd George is just about ‘set’ for another long run \nrun\n in his position.\n\nThe Daily Mails’ offer of a \n\n£ 10,000 for the first airman to cross the Atlantic from Valentia in Ireland to Canada or New York in the States \nis\n in 72 hours is now open. Already there are four entries. One is a British R.A.F officer and another three are Americans. An aerobus service is to be opened shortly between Paris and London. Fares for passengers at present are £ 15\/15. Only a small handbag is allowed to be carried by each passenger.\n\nOur Bn played the Bde. Hqrs. at Rugby League yesterday afternoon. We won hands down scores being 53 points to \nNil\n. 2\n\nKing George has delivered a long speech to the British nation and Allies thanking all for the victory over the Huns. Marshal Foch has also delivered a short formal note of thanks to the French and Allied Armies for forcing the great struggle to a decisive and successful conclusion.\n\nPresident Wilson has arrived in Paris to assist in settling the Peace Terms. A grand parade of Allied troops is to be held in Paris soon at which all the Allied Kings or national Representatives will attend.\n","4":"\n \n\nThe result of the conference between Admiral Beatty and\n\nthe German Plenipotentiary (Rear Admiral Meurer) is not so far, published but we \nand to\n understand that the terms decided on are drastic ones. Practically the whole of the German warships and the submarines have to be handed over. The submarines at the rate of 20 per day. The first 20 submarines were handed over to the British Navy at the entrance to the Firth of Forth today. A small detachment of warships representing the French navy was present.\n\nThe handing over of the German High Sea Fleet will be forever, a memorable & historical event.\n","5":"\n We have received orders to leave this village tomorrow","6":" It is rumoured that the 1st 2nd &","7":" Aust. Divs. Have already left for Germany.\n\nSince the signing of the Armistice the civilians have taken a very keen interest in the distribution of the mail. Every evening at about 5 oclock a little knot of girls and others are to be seen gathered round the Post Office door waiting for it to open. Mr Aginoo \nh\n went off to Paris this morning after handing over the duties of Mess Secretary to me.\n\nAbout 5.30 p.m. whilst going up to the Mess to hear the latest ‘oil’ I met our little Padre dashing down the street with a purposeful look on his face. He was full and brimming over with information chief of which being the fact that all \norders\n kits had to be at the Company Quarter Master Store by 6 p.m. I retraced my steps to my billet therefore where I found my batman Peter Alexander who was of course delighted to hear the news. Peter is a cockney and is \nsome\n boy I \nf\n spent a last couple of hours in company with friend Pollock with the loved ones. We left them about 9 p.m. as\n\nduty called us away dash it.\n\nIt was the coldest farewell I have ever \nhad\n experienced with any lady friends whilst at the war. \nSh\n Cecile didn’t ever smile when I \nsaid\n took her little hand in my paw and said au revoir. Her blue eyes regarded me almost coldly as she made a stately little bow and murmured a response. She behaved as if I were a total stranger \"but then parents are always a nuisance during these critical moments.\" They always put a damper on farewells. I turned into bed about 10 p.m. but somehow the prospect of rising at 4 A.M. on the morrow\n\ndidn’t worry me a bit. I woke on the stroke of 4 this morning.\n","8":"\n and was half dressed almost before the church clock had finished striking. I douced my head with icy cold water and felt very much awake thereafter. \n\nNo sign of Peter so I packed the few things I had left myself and sneaked out of the house about 4.45 A.M. not wishing to disturb Madame (who happened to be alone in the house this night) lest she rise hastily and demand payment for a cup which was broken by Peter yesterday whilst play fully throwing it into the air and catching it. He failed to catch it once.\n\nThe men were got out of their \n\nbillets with some difficulty and we pushed off across crops and ploughed fields for the starting point of the column. We managed to get there a little before time by some extraordinary means \nnoth\n notwithstanding the fact that we got badly tangled up in the maze of tracks and streets in Grebault-Mesnil.\n\nThe whole battalion arrived at the Station in Abbeville about 11 A.M. and entrained about 12 noon. The men were sardined into trucks at the rate of 38 men per truck. It was a scandalous affair! \nand\n A hot meal was served out and we pushed off at 12.45 p.m.\n\nIt was drizzling when we left.\n\nthe billets but it had fined up by the time we reached the entraining point.\n\nI \nalways\n usually enjoy a train journey while daylight lasts and this proved to be no exception. I can spend hours gazing at things out of the window as they flit by The different views which present themselves, the peculiar twist of a tree trunk, the ripples and light coloured lane ways on the water, on a bunch of swallows dashing about all seem to have a hyponotic attraction for me. It began to rain soon and a heavy mist settled down over the country the windows clouded and nobody showed the slightest signs of happiness.\n\nWe passed through Pont Remy Longpre Ailly Sur Somme, Haugest St Roche and finally pulled up at Amiens where we had a truck taken off which had a squeaking wheel and was red hot and smoking. \nA\n Had it been left on much longer it must have set the truck on fire. A new truck was put on in its place and we started off again about 3 p.m.\n\nFrom here onwards for a considerable distance the ground was very familiar to almost every man on board; for we were passing through the now famous \nf\n battle- ground of Villers Bretonneux, the Waterloo of the German Army\n\nThe old battle scars area as prominent still as if a war were still raging round about. Shell holes, dugouts derelict tanks, trenches and tracks leading in all directions over the country.\n\nThe battle town of Corbie was the first to have in sight after leaving Amiens. The two square, damaged towers of the Cathedral can be seen for miles. Presently we came to Villers Bretonneux itself. What a fine old town it has been and now not a single house can boast a sound roof. A solitary pussy was the only form of life about the place. Pitch darkness set in and the old brain got into the familiar Military Mooch,\n\ncrawling along \nat\n a few hundred yards at a time. We arrived at Bertry about 5 A.M. and about 6 A.M. the Bde Detraining Officer Lt. Grimsley bestirred himself and began issuing short sharp orders to everybody. We tumbled that we had to get out here and crawled forth into the dawn after sorting ourselves out from the kit and sleepy peoples’ legs.\n\n‘C’ Company is the unloading Company for our group of trains so we got to work and unloaded our own train, had breakfast got the men into billets and nosed out a place for ourselves, near the Railway Transport Officers office.\n\nA French woman informed me\n\nthat this town was taken by Lord Strathorais’ Horse. Scarcely a house is injured here and what damage there is was done by our bombing planes.\n\nBrigadiers and staff Officers of almost every division are wandering about asking for information about \nab\n their unit unit. Captain Gilchrist is the Divisional Detraining Officer and is messing with us. Every few minutes a somebody \ncomes\n blows in & asks for him, some wear a worried expression but on the whole everybody is taking the situation in the right spirit confident that their \ns\n respective units will sort themselves out \nin\nas \n\ntime goes on. Trains are coming in anyhow. Their scheduled times of arrivals with their loads of troops have been knocked rotten. Accidents have occurred on the line and mines, \nare\n (the delay action variety) are still blowing up on the railways.\n\nAbout 8 P.M. I turned in and was wakened by Capt. Benson at 9 P.M. who gave me the glad news that a train had arrived and that I had charge of the first unloading party. It was pitch dark and drizzling but the boys turned out and worked with a will. We finished about 10.30 P.M. But the job had not been done smartly enough for our gallant\n\nR.T.O. who found fault with a lot of things but we didn’t give a damn for him.\n\nCaptain Gilchrist put forward a preposterous proposal to Capt. Benson after failing to do so without his (Capt. Benson’s) permission re turning \nour\n billet and company mess into a\nn\n divisional officers club for waifs and strays who came off long train journeys. He drew a storm of abuse on to himself from both the worthy skipper and myself and he received no sympathy from Captain Myrkle (Staff Trainee on Division) who was himself practically homeless and without a batman.\n\nThe siding and street near by here are a lively congestion\ns\n of troops horses wagons, automobiles, stacks of shells and mud.\n","9":"\n Two more trains came in between 11 A.M. and 12 noon with tired, fed-up troops on board. They had had a long and cramped journey. This is easily the worst move we have \nto\n ever experienced.\n\nOne battalion of the","10":" Bde. Who had made a good journey, detrained looking smart and clean and they swing out of the town in such good style that I was inclined to think \na\n that a good deal of discipline still existed in at least part of the A.I.F.\n\nAbout 8 p.m. the unloading party from the 53rd Bn. relieved us and we turned in and had an undisturbed night’s rest. Our men have thoroughly enjoyed themselves on the job. They simply walked on to a train and literally threw things off bodily. Waggons limbers and cookers were all the same to them. Every thing was landed quickly and safely to the cry of – \"Let \nher\n go.\"\n","11":"\n We left Bertry this morning at 8 A.M. in battle order Captain Benson very sensibly having arrived by motor lorry to Rejet about 14 kilometres\n\non. We passed through Marois, Honnechy \na\n St Souplet Masingheim finally arriving at an old chateau about 1 p.m. where the whole company were billeted and dinner served.\n\nWe found that our packs had been left stranded on the lorry about a kilometre away in a very muddy patch of the road. The men were ordered to collect their packs independently and they did so in good style.\n\nFires were very soon going all over the house and everybody was happy or appeared to be which is the main consideration in the Army.\n\nAn old farmer and his wife and family occupy a couple of rooms in the house. They have had a terrible time during the period of german occupation. Most of the villages between here and Bertry are more or less damaged as some of the very last battles of the war have been fought in this area. It is only about three weeks ago that the Armistice was signed.\n","12":"\n We rejoined our Bn. at the church \nof\n in Rejet de Beaulau. This morning and the column trekked to the town of La Groise a distance of about 8 kilometres\n\nwhere we were met by our Company guide Sgt. Barron and conducted to billets.\n\nThe French people in this district are in a pitiable condition for the most part. Many of them are living in badly battered houses, and have been literally starving. The tyrants have fled and taken with them \nevery\n the few cattle horses and Poultry which the people possessed. This of course is the fortune of war but the people have suffered in many \nother\n ways other than this. \n\nThe\n During & after their liberation they suffered terribly for want of food & comforts. There were many sick and no medical aid of any description available.\n\nWe have ample evidence of their complete subjugation by Germans.\n\nEverybody had to be in bed and all lights out by a certain hour each evening.\n\nIf when passing an officer in the street a civilian failed to raise his hat or a woman to curtsey they were fined 25 marks.\n\nA tax of 5 marks was imposed on everybody to enable them to live in their own homes.\n\nEven now it is a common thing to see hats doffed to officers and girls curtseying. Everybody wears a very subdued expression on their faces but they are coming out of their shells a little as each day goes by.\n\nThey are all extremely hospitable, and what little they are able to do for us they do willingly and smilingly and refuse any remuneration whatsoever.\n\nI have always admired the French spirit and I admire \ntheir\n it more so now.\n\nOn entering a town the Germans walked into the houses from the richest to the poorest, commandeered the best rooms and usually allotted two and often only one room for the whole family to live in. They then forced the people to wait on them like slaves.\n\nBefore leaving, the germans requisitioned furniture clothing and bedding from the inhabitants for which a receipt was given.\n\nsigned by the German Commandant and counter signed by the French Maime.\n\nAn old woman who is over 70 years of age had the sheets and a blanket requisitioned \nfo\n by the huns while she was in the bed very ill. She is still extremely weak and nervous and it is believed she will die.\n\nShe is living in this house.\n\nA story was told to our Padre in the town of Rejet de Beaulau of two girls who were forced to live in a cellar with two germans during the whole period of that enemy units’ occupation of the town. They were unable to escape as their clothes were taken from them.\n\nThis may \nnot\n or may not be true but certain it is that several girls have been left in this village in a wretched condition.\n\nThe hospitality of the people here-abouts was proved first of all when we were on the way from Bertry to Rejet. One of our men fainted and afterwards took a fit. He was resuscitated by Lieut. Dickinson who was in a quandry then, as to how he was to get him to hospital as we were a detached company without medical transport of any description.\n\nSome old people took him into their shell shattered hove however gave him a hot drink and looked after him for two days when we were\n\nable to get word to our Bn. H.qrs who sent a Motor Ambulance along and he was conveyed to hospital.\n\nThis clearly illustrates the hardships men are likely to encounter even – in France. If a man becomes dangerously ill on a long march, he stands a splendid chance of interviewing his Maker before medical aid arrives. At 3 p.m. this afternoon in company with Lieut. Pollock I lorry-hopped to the town of Catillon. \n\nFinding nothing of interest there we returned the same way. We saw only the same story of desolation and ruin.\n\nOur Band gave a selection on the village square this afternoon which was much appreciated by both civilians and ‘diggers’.\n\nAbout 8.30 p.m. Bn. Routine Orders came along in which a Church Parade was ordered for all Protestant Denomination\ns\n at 10.30 tomorrow. We were having a quiet game of cards \nwhe\n at the time and as the order stated that at least one officer from each Company had to accompany the parade somebody suggested dealing a Poker Hand \nto\n the loser to take ‘C’ Corp’ parade to church. I lost, having only one pair of queens against two pairs, full hands \nand\nflushes and heaven only knows what.\n","13":" I took the Church Parade along and Padre Rowell met us at the Brewery where he proposed holding the service. The place was unsuitable however so we \najd\n adjourned to a shed just in rear. There the Padre mounted a pulpit of beer cases and delivered a short sermon on the power of religion. Being bitterly cold he only kept us for about 20 minutes. He complimented us on the very fine turnout for the service. Usually only 30 or 40 men turn up for a voluntary service but this morning about half the Bn. were there. The secret of this lay in the fact that the men had all been instructed overnight that the parade would be a \n\ncompulsory one. On awaking this morning and feeling the exceeding coldness of the atmosphere the padre thoughtfully decided to have a \nvoluntary\n service and intimated as much to Bn. Hqrs. who approved but as usually forgot to inform the Companies, at any rate ‘C’ Company, with the splendid result stated above.\n\nI returned to our \"ice chest\" after parade and watched Dicko’s futile efforts to make\ning\n the fire burn.\n\nBilly Palmer blew in after a while and stated that he was orderly officer for the day, that he was about to inspect our billets in company with one, Chunder Loo and \nthat\n that he therefore\n\nhoped sincerely none of our men would be found burning the Froggies \"good timber\". The men have a trick of removing peoples furniture and parts of their houses this cold weather. Having delivered his little oration in his most bell-pealing and stately manner Billy blew out again.\n\nThe above mentioned ‘Chunder’ is a dashing Major in our Bn., that of course does not prevent him from being \nChunder\n. He is a comic-opera and a tragedy rolled into one.\n\nThis afternoon I invited myself into Capt. Benson’s billet. I saw on entering that the worthy Capitaine was not alone and with-\n\ndrew bashfully and hastily. He saw me however and persuaded me to enter and sit down which I did though reluctantly and in the capacity of a subordinate obeying the command of a superior officer. Seeing my questioning look he explained that he had been poking and cursing at his fire when a knock came at his door. He uttered a gruff \"Come in\" which was apparently well understood, as a girl floated in quickly, seized the poker from his hands and before he had recovered from his astonishment had the fire blazing (I presume that her efforts were so successful as to render the lighting of the candle to illuminate \n\nthe room quite unnecessary. At any rate there was no candle alight when I entered.) Having done this the girl made as if to leave the room but he offered her a chair and she timidly accepted. My word, I muttered, what brutes those huns must have been! Presently the door opened quietly and a startled face appeared. Apparently it became quite reassured and another fluttered in, curtseyed, and asked if she could do anything for us. The Captain said! No, merci and offered her a chair which she smilingly accepted though with many scared glances at the door.\n\nThus did I behold my captain\n\n on entering. Scarely had I been seated five minutes when in came two more girls. My amazement and embarrassment can better be imagined than described for I now had females on my left and right and I am used to having them only on my left hand side. However Lieuts. Pollock and Dickinson came along presently and retrieved the situation a little. Pollock carried on a lively conversation in French whilst Dick gazed stonily into the fire and sucked his pipe and I – looked at Dicko.\n\nBeing Sunday many people were abroad looking up their\n\nfriends and Benno seemed to be the friend of thousands today. Frank Morley rolled in first looked hard at each one in turn shifted his pipe into the other corner of his mouth and sat down. Presently came Alex. Bates, then Dad Vinehall Lt. Pickup and Barney Phillips and some more whom I did not recognise anyone except by their voice as the strategic position which I occupied did not boast a \"good \ndeal\n field of fire\". These visitors stayed and stayed and were only dispersed finally by Wilson the Capt’s groom putting his head \nb\n in the doorway and shouting\n\nthat dinner was ready Wilson appeared to be annoyed tonight. In fact all the batmen, and several outside men appeared to be very much annoyed and \"what they’ve go to be annoyed at I dunno.\"\n","14":"\n Lieut Kinsella joined our Coy. Recently returned from a trip home to Australian Kin. as he is generally known is an original 2nd Bn. man, of ‘B’ Coy. to be precise. He served through the Gallipoli Campaign and received his commission at Fleurbaix in France after our Fromelles stunt in","15":"\n\nIn giving an account of his trip he stated that his ship (a hospital\n\nship) pulled in at Melbourne to discharge her load of sick and wounded, but the Wharf Labourers refused to unload her as it was \"their holiday\". Accordingly the ship went on to Sydney. On another occasion a train load of returned sick and wounded men were held up for some hours \nwhile\nto allow a \"race train\" to pass through; and these are the patriotic countrymen for whom we have fought. These are the people who will share the honour and glory which is the property, solely of those who paid for it with their unselfish lives.\n\nAustralia, morally, is rotten to the core and parents chiefly\n\nmust take the blame. Freedom and recklessness are part of our natural heritage in Australia \nand unless\n and unless this spirit is pruned and controlled \nnow\n it will have a disastrous effect on the nation a century on or more, hence. There always has been and always will be, big troubles in all nations and most of all these troubles if not all are due principally to Selfishness on the part of a few \nand\n or a large party of the people.\n\nIn both of the above quoted cases, it was apparently national selfishness \nand\n as nobody made any effort to inquire into the matter.\n\n3 rd\n The ‘Journal’ states that the British have crossed the border and are now in German Territory.\n","16":"\n I took over duties of Battalion Orderly Officer this morning from Lieut. Adams. The New Guard consisted of men from my own platoon and a very smart guard they were too. McCarthy, Strong \nan\n Bowden & Kirby, (the \"Dinky Die Aussies\" as they style themselves) were there. The old guard looked sick beside them. Tomo (Corporal Thompson) was Corporal of the guard. A good man in the line a good instructor \nTh\n Tomo is hard to beat as an U.C.O.\n\nWhilst inspecting the leave party I had occasion to\n\nsend three men away for a shave before giving them their passes. These men however returned to their billets got drunk & waited for an opportunity to \nto\n ‘chat’ me and they were successful. I regret to say. They used up all the words in the Australian Vocabulary of Slang and even invented a few more for my especial benefit. In the midst of their wild harangue a number of their drunken cobbers joined them and yelled applause to each epithet which was hurled at me. As I hadn’t a single witness to enable me to crime any of them and as I was\n\nnot in the humour for engaging \na\n about 12 enraged men on my feet with my fists I decided to beat a retreat and did so, hoping for an opportunity to catch one of these rotters and the opportunity came, though even then I was extremely loath to \"send him up\" as the man’s mind had been completely warped by drink and furthermore I have never before crimed any man since holding my commission.\n\nBut the army laws state distinctly that such misbehaviour must be dealt with speedily and harshly if necessary & unfortunately this was a \n\nvery necessary case.\n\nDrink is the cause of most of the trouble in the army. A certain company in this battalion managed to procure a large quantity of rum and whisky from one of the dumps close by and nearly every man had a grand beano. One man was found dead in his billet this morning having drunk himself to death! a glorious finish to a life which had braved all the horrors of the greatest war in history.\n\nAn evening \nchat after\n the war! Two men sitting in easy chairs in a well appointed room before a bright fire. One is a tall, wiry chap who has been through everything from the Landing to the great Armistice in France on","17":" The other is a medium sized man also wiry with a pair of small brown eyes which glisten and have an appearance of wisdom in them. A thin pipe is held rigidly in the left hand corner of his mouth and his left eye continually opens & shuts. He also has seen much \nservice\n hard service in France. The two are remin-\n\niscing. A certain Battalion is mentioned and we recognise two old friends, the former is \nDicko\n Kin. the latter is Dicko, who is giving the \"good oil\" about a certain patrol at Villers Bretonneaux. ‘Dicko’ – Things were pretty umpty-iddy about that time. We had a man to about that time We had a man to about every hundred yards of front for over a mile. Bluffing them you know. Hell – why Fritz could have walked across and wiped everybody out and taken Amiens easily many a time but for some reason he didn’t tackle it. Our patrols used to put the wind\n\nup him I fancy. One night though – (pauses and shifts pipe to other corner of his mouth) we sent a patrol out of about 12 men under an officer to investigate a machine gun post just in front and while they were coming back \nwe\n Fritz got on to them and wiped out the of them.\"\n\nKin – \"Who was the officer in charge of the patrol\"\n\nDicko – \"Brewer\" –\n\nKin. – \"Did he get back all right\"?\n\nDicko – wiping his eyes with a silk handkerchief – \"No, he got stonkered.\"\n\nKin – in a voice full of\n\nemtion – \"Stiffness wasn’t it? I knew Hector in the old","18":" Bn you know. Did you manage to get their bodies in?\"\n\nDicko – \"Yes we crawled out the next night and dragged them in and little Mattinson buried them in a wheat crop just behind the front line.\"\n\nKin – Rising – A lot of good men gone west in the war Dicko, Well I must \"partie toute suite\". Cheero Dick and goes whistling the latest song Dicko with his head in his hands thinking of Kiplings \"Barrack Room of Ballads.\n","19":"\nToday I am orderly officer again. Whilst inspecting the food at one billet in \"C\" Company and asking for complaints I received a couple. It is an extraordinary thing about the diggers. Unless an officer asks for complaints they will grin and bear a great deal and be it said to their shame many officers abuse this fine trait in their men. On this occasion I was informed that the tea was too black, undrinkable almost and a sample was thrust under my nose. It certainly was black. The other complaint was that \"the bacon was of the Lance corporal variety and hardly discernible\". Promising\n\nto have the trouble investigated I passed on to my own platoon and expecting to find the complaint a general one I asked how the tea was this morning and received the astonishing reply that it was \"splendid\". \"Just right\" one man informed me in an emphatic manner. I therefore concluded that it was a matter of taste and as my platoon liked it decided not to have it altered. The next orderly officer may do if he so desires.\n\nThis afternoon I was called to assist in sending some poor devil to a court-martial trial. It is an Australian Court Martial however\n\n\"so he will not be shot\". \nat most\n. The little Padre was invited to dinner tonight and engaged in a terrific \ns\n area strafe with the Educational Officer Mr. McKenzie BA. who began by stating that the \"church had failed\". After terrific bombardments from both sides the Padre quoted a statement by Carlisle from his book of \"Heroes and Heroe-worship\" defining the word religion as generally accepted in the English language namely: \nman\n \"Religion is a man’s idea of himself and the things that are around him.\" Mr. McKenzie then asked him if he had read the book whereupon the Padre gasped, looked daggers, balanced\n\nhis chair on one leg thrust his hands deeply into his pockets writhed and wriggled and finally jumped up and in a petulant voice refused to discuss the subject further. Apology was instantly tendered for the unintentional hurt by Mr. McKenzie which was gradually accepted by the unhurt one who finally agreed that the church had failed but had not failed and all ended happily. It was a most interesting show from start to finish. It was like two men struggling and creating a disturbance in a dark room suddenly emerging into the light shaking each other’s hand\n\nOrders tonight contained the good news that two men in our own battalion had been awarded the Victoria Cross. The two recipients are \nP\n Corporal Buckley of our own Company and Pte. Hall of ‘D’ Coy. Unhappily the former man was killed the day following that on which he performed the deed for which he \nwas\n is awarded this highest of British Military honours.\n\nThe 53rd Bn. also had a Victoria Cross awarded a man in their Bn. All three decorations were won during the terrific fighting for Peronne on Aug. 1st-2nd this year.\n","20":"\n It has rained off and on for nearly a week now. The sky is con-\n\ntinually overcast with a thick coat of low hanging greyness.\n\nLloyd George in a speech recently, stated that the Kaiser must be punished. A lot of other people have also said much on this subject but it is quite likely something will be done now.\n\nThe British ‘Army of occupation’ crossed the border on the","21":" and are now on Hun soil.\n\nThe Yanks entered Coblenz on the","22":" and received a sulky reception from the inhabitants. The French and American Armies \nhave\n entered Aix-la Chapelle on the","23":" also.\n\nPresident Wilson is to arrive\n\nin\n at Marseilles today or tomorrow Paris has arranged a grand reception for him.\n\nMr. McKenzie B.A. is the Educational Officer attached to our Battalion and a very able and energetic officer his is too. He commenced his duties exactly nine days ago. He has been busy interviewing men in the Bn. ever since, finding out what study they wish to take up and organising classes for them. Bishop Long is supervising the Educational Scheme and Gen. Monash has the Demobilisation Scheme in hand.\n\nThe Educational Scheme forms the basis of the Demobilisation Scheme.\n\nThe difficulties of Demobilisation were foreseen by our leaders many months before the Armistice and \nhave\n an Educational Scheme was decided upon for the A.I.F. and has since been adopted and is being propelled along with surprising rapidity.\n\nThe Canadians were the first \nof\n to recognise the value of this scheme during the Demobilisation Period and the British followed closely in their wake.\n\nWe have therefore been able to profit by their mistakes in laying down the principles on which our scheme is to be worked.\n\nAs soon as the plans for Demobilisation are complete at this end and the Repatriation Scheme overhauled and completed at the home end the machinery will be set in motion and should work smoothly in the main. Foreseen and unforeseen difficulties will crop up of course but we have the right man at our end at least who will spurn all difficulties or rather welcome them so that he might have the pleasure of sweeping them away. The idea of the Educational Scheme is to fit a man, as far as it is possible, for his return to civil life. As Mr. McKenzie has said: many of the men\n\nhave partially or completely lost their individuality and initiative in things concerning their individual affairs. Army life tends to cramp these two things: and they will be cramped in a more or less degree according to the length of the man’s service principally. The Scheme is also \nto\n intended to help men regain touch with whatever trade or profession they were following prior to leaving their homes for the war.\n\nInstead of continually sloping arms and parading (now that the war is over) and worrying about their return home, the men will \nhave\n be able to occupy their mind in such a way as \nto\n will be of\n\nvalue to themselves and the country on their return.\n","24":"\n I was ordered to attend a Court Martial this morning at 10 AM. at the town of Fesmy about 5 kilometres distant. Arrived there I found that there were seven or eight cases to be dealt with. My case did not come on until about 4 PM.\n\nIt was a wretched business from start to finish.\n\nMy Accused was a tall muscular Youth of about 23 years, fair complexioned, fair hair, blue eyes and Roman Nose. He had a striking personality. Inflexibility of purpose could be read in that face. But though I searched time and again for some trace of character I found nothing which would lead me to form some opinion for good or\n\nfor bad. But something reminded me that I was not this man’s judge. We had been waiting (accused and witnesses) in the cold for several hours now, but at last prisoner’s name is called.\n\nHe steps forward boldly. His head is poised defiantly and his blue eyes flash fire; but hi is obviously ill at ease.\n\nHis countenance hitherto pale now flushes bright red. He is about to go before a Committee of Gods of Justice. Justice will be dealt \"without fear or favour,\" but justly.\n\nThe escort is near that mighty Limb of Justice, the Provost sergeant, is watching from near by. The Menial of Justice cries,\n\nHalt! Right Turn! and retires closing the door behind him. The room is warm and the warmth soothes his nerves; but his countenance remains flushed.\n\nBefore him area seated at an oblong table the Gods of Justice who look at him intently.\n\nHe glances swiftly from face to face but all look alike – only Justice can be discerned; or is it only Hate which he sees. For many a man when brought before his fellow men to answer for a wrong doing, feels nothing but Hate for all the world and not a little for himself. Or is it Fear? For Justice is terrible to the Guilty Those blue eyes flash once more those lips are set firmly, but\n\nJustice\n will not be denied him\n\nFlight is impossible.\n\nThat bayonet \nis\n gleams bright chill and merciless. A bullet rending and crashing through human flesh – horrible. That Limb of Justice is swift and possesses powerful hands. How powerful he, the accused, \nalone\n well knows.\n\nNo; he cannot escape and with this knowledge comes a deluge of Fear which floods his brain. Hate squelches and gurgles in the Deluge and is drowned and now the satellites of Fear, Mercy and Pity have come. But who will be Merciful and who will Pity? Only the Gods. A loneliness seizes him and \n\nshakes him. He appeals mutely for a friend. Who will be his friend?\n\nTragical hollow Silence answers, mockingly it seems.\n\nNow one of the Gods is droning on – \"the truth, the whole truth and nothing but the truth so help my God\". The droning ceases. Witness for the prosecution in speaking and the God of Just Laws is writing. Will they never finish? Every word that is uttered pierces and burns his brain like a hot cinder. This suspense is horrible. He breathes hard. His collar seems suddenly to have tightened about his throat. He fingers it nervously, impatiently. But at last that damning voice has finished and he breathes more\n\nfreely though still with difficulty. The God of Just Laws has ceased to write and is questioning witnesses whose reply is condemnatory. The God of Just Laws writes again, \nlays\n pauses, lays down his pencil and nods to the witness, \nsignifying\n dismissal – I saluted and hastily left the room, glad to be out of this atmosphere of revelation and condemnation.\n","25":"\n Lt. Harvey M.C. returned today from Blighty (after a short period in hospital there. He won his M.C. in the Peronne battle.\n\nHe was full of tales of stirring adventures in the Wilds of Piccadilly in company with the redoubtable Capt. John Mitchell M.C. and \n\nLieut Les. Wharton M.C. A.F.C. late of the old","26":" Battalion.\n\nHe also told us of a riot which occurred at the Base at Le Havre whilst he was passing through. It appears that the food issued to the men became considerably short for two or three days on end in the English Artillery Camp. The men therefore decided to make a stir as complaints were unheeded or had no material effect. They broke into the Officers Mess first of all put the officers to rout and passed the whisky etc over the counter to their mates until it has all disappeared.\n\nThe officer \non that occasion\n rushed away to a safe place\n\nand after waiting a reasonable time a senior officer adjusted his eyeglass and, surveying the others in his haughtiest manner, said: I think we have subdued them now, ah gentlemen, we will return.\"\n\nThe rioters on one occasion made as if to enter a hut occupied by W.A.A.C.s but somebody shouted out that the hut was occupied buy ladies and the Tommies, always \na\n gentlemen where women are concerned turn their attention elsewhere and the trouble gradually calmed down. In any case \na\n some gallant Australians had dashed across from their camp and posted themselves\n\nat either end of the hut with revolvers in their hands prepared to die if necessary.\n","27":"\n We left La Groise today and marched via Prisches to the town of Cartignies and were billeted in the midst of a quagmire at the far end of the town. It is the luck of the infantry to be always bundled into some such place so that the \"Senior Services\" might not be inconvenienced in any way.\n\nAt last we have passed out of and beyond the shelled area and are now in beautiful grazing country. The fields are bare of any living thing though as the huns have taken everything with them\n\nIn our house a fine old couple are living alone. They were very good to us and helped us in the way of obtaining a few chairs and a table to eat on as well as fossicking around for a fire-wood for us. What changes this old couple have seen! What troubles have they not had!\n\nThey had little enough to give us and we did not ask for anything but we had arrived there hungry tired \nand\n wet and cold (as it had rained heavily during the greater part of the march) and these people did what they could for us and we appreciated it. The room boasted a very fine stove which possessed in addition to the ordinary conveniences, a cinder\n\nsifter thus providing for fuel economy.\n","28":"\n We started off at 10A.M. this morning for Sains and after passing through the towns of Boulogne and Croix Rouge marched into billets at our destination about 2 p.m. Sains is a compact little town of about 2000 inhabitants. It rained and haled nearly the whole way. The roads were in a very bad condition. We march along these days with the prospect of dry billets, a warm fire and a meal in front of us which is a great deal when we consider that only a very short time back we were continually marching about in mud and slush, sorefooted,\n\nweary, hungry and cold and a battle staring us in the face. With the prospect of ultimate victory \nstaring us in the face\n moved farther from our grasp than ever. We did not know that Foch with his Magic Wand was waiting, unperturbed, contemptuous of the mad enemy on rushes, for a favourable moment to wave his Wand and annihilate or entrap the victory-intoxicated tyrants. But it has happened. Yet I believe that had we known, the British Army generally and the Aussies in particular could hardly have gone into action with better heart than they did.\n","29":"\n We left Sains this morning\n\nand marched to Sivry in Belgium a scattered town of about 2600 inhabitants. We marched via Ramousies, crossed the Grande Helpe River, passed through Liessies and lunched on the left of the road just before we entered Bois de Nostrimont at 1 P.M. sharp we trekked on again and at 1.30 p.m. crossed the belgian border and at once entered the Bois de Tout vert. After resting for a short period from 10 minutes to 2 p.m. until 2 p.m.. Billets for the men and officers both \nwere\n are not too numerous nor too comfortable as \nthe\n very few civilians have left this town\n\nand of course require their rooms \nare\n etc for themselves. However we are to be here for two or three months so will make it our business to get \"dug in\" somewhere, somehow.\n\nFood is not too plentiful and our ration supply will not be in proper working order for another day at least for some reason or other. Our commissariat department always seems to go fut or get out of joint somehow whenever we make a big move.\n\nA discussion arose at mess tonight as to the best way of obtaining supplies for a Xmas dinner for the officers. Captain Shannon the quarter Master has been away for over a week buying supplies\n\nfor a good spread for the men with Regimental Funds.\n\nNothing in the food line is to be had ahead as the country has been properly cleaned up by the retreating enemy. Our only hope to \nobt\n buy from Expeditionary Force canteens or else send someone back beyond the occupied area to Amiens or Rouen.\n","30":"","31":" Wet and uncomfortable. However it is my last Xmas Day with the Battalion. I have now spent every Xmas since leaving Australia with my unit. My leave pass has come along for 14 days in England. I was asked by Head\n\nQuarters if I desired to take any leave in view of my \nprobable\n return home to Australia at an early date. But as I have been \ngoing\n to go home now for the last 4 months and \nam\n still in France I decided to take the leave and see what could be done \nfrom\n in England at Head Quarters.\n\nLieut. Adams is also going on leave but we have both decided to wait till the morrow before pushing off. It has been a pretty dud Xmas for the men.\n","32":"","33":" I left Sivry\n\nwith all my kit in company with Lts. Meehan and Carrick for a little town on the main road where we were to pick up a bus for Charleroi. We found that Lt Adams had already arrived so we all jumped aboard a Motor lorry & were driven to Charleroi. We left our kits a the station and had a lunch at the Expeditionary Force Restaurant then had a stroll around the town after which it was time to catch our trains for Brussells as we had made up our minds\n\nto beat the leave trains down to Boulogne by catching the Paris Express at \nthe\n Brussells. Arrived at Brussells about 5 p.m. and left our kits in the cloak room. Three of us then wandered off to find out about our train for Boulogne and \nthen\n were informed buy the extremely intelligent porter that no train would be leaving Brussells for at least three days. Somewhat alarmed we asked if there happened to be another station \nat\n in Brussells and were told that the Gare du Nord was about 3 miles away. Our faces\n\ncleared a little at this and we felt a little easier. In the meantime Lts. Meehan and Adams had somehow disappeared and we wondered if they had lost themselves somewhere. However arrived at the Gare Du Nord we found out that \nour\n a train left there the next morning at 6 o’clock for Dunkirk. We reckoned it would do us nicely and after booking a room at the Palace Hotel we dashed back to the other station to get our luggage and transfer it to the Gare Du Nord. We were greatly chagrined to find the cloak room locked and\n\ndeserted. After banging on the door for a little while however, a beery eyed individual appeared to whom we appealed to have our luggage handed out. He shook his head and told us that the place did not open until 6 A.M. the following morning. Our position was a rather desperate one as we were anxious to quit Brussells for several reasons as soon as possible. We were determined to have our own kits out and shook the door and strongly stamped and swore and even threatened to take the fellows life all to no purpose though\n\nBy a lucky accident whilst passing this exasperating person I shook\ned\n some spare cash in my pockets. Instantly his eyes began to bulge, he scratched his head and disappeared returning in a few minutes with a key in his hand, with which he unlocked the door \nand\n We at one stepped in and began pulling our luggage about. But apparently our troubles were not yet over for we were asked for a ticket and were unable to produce one, where upon the allhighest began pushing us out of the room and locking the door. We were\n\njust about to bring force to bear on our arguments when another station chap presumably the night officer came on the scene. We explained the situation as well as we were able and \nthen\n he asked us to sign a paper stating our rank regiment etc. after which we were allowed to have our valises in peace. \n\nHaving placed our kits in the cloak room at the Gare Du Nord we returned to our diggings, palatial diggings I might say at the Palace Hotel.\n\nWe had a very expensive meal though not a good one\n\nhad a wander around the town and turned in. We got aboard our train as we though in good time, an hour before it started but were unable but were unable to obtain a seat even then. The train was crowded. We found ourselves in a corridor and soon made ourselves comfortable.\n\nThe train did not start off until 6.20 A.M. and then we were informed that it did not go beyond Bruges. However it was no use grumbling and as we had the money we decided to have as good a time as possible.\n\nWe crawled into Bruges 12\n\nmidday and had lunch then a stroll around the town and boarded the 4.30 train for Dunkirk we believed. After a wretched journey however we pulled up at the battered town of Ardinkirk. Here we were ordered out the conductor saying that the train did not \nleave\n go on any further: We refused to budge however believing that he was fabricating as usual. We were soon convinced \nhowever\n that for once the Froggy was right for we found ourselves in a siding \nwith\n about 12 midnight pouring with rain and the engine off.\n\nafter a little consultation it was agreed that we should all move bag and baggage to the station which was now nearly half a mile away, the train having shunted off after apparently discharging everybody. \n\nArrived at the station we found a host of civilian people and troops of all allied nationalities waiting, some for a train to Boulogne some to Abbeville some to Paris and some to Dunkirk. They were all bound for the one direction. Women with one two three or four kiddies and all their possessions beside\ns\n them had been\n\nwaiting for several hours in this awful night for a train to take them to their destination. It was \na\n cold \nand\n for a chilly wind blew right along the station from the direction of Dunkirk. It was a miserable night for these poor people. I wonder how many of them actually had a home to go to. They were Belgians who had been liberated from their awful existence under the Germans since the signing of the Armistice.\n\nThey must have had a terrible time travelling down as far Ardinkirk as the railway service throughout Belgian & Northern France\n\nis almost entirely dislocated. The Huns in their retirement have burnt hundreds of trucks and carriages, destroyed a great number of engines and Engine sheds, signal boxes, \nand\n torn up the rails at all the junctions and blown up the bridges so that it will be many many weary months before these parts are cleared up at all and the railway service in good working order.\n\nSomehow everybody got on board an already crowded train at 5.30 A.M. and we crawled along to Dunkirk and on to Calais. Here the train pulled up for a short space\n\nand we were able to get out of our dirty stuffy crowded compartment to a first class compartment. We started off about 10.30 A.M. at last with a reasonable chance of reaching Boulogne that day. But our hopes were slightly jarred by a French passenger who told us that our train did not stay at Boulogne. We made up our minds to stay at Boulogne even if the train did not. Just as we were about opposite Wimereux near Boulogne the train slowed up to about 15 miles per hour. Three of us jumped off and the other passengers bowled our kits out after us, forgetting\n\nhowever to throw out my raincoat. I came down a beautiful crash on to the line opposite, tore my great coat badly and almost ruined my best breeches. In addition I was badly shaken and my left wrist was stiff and sore for some days afterwards having taken a great deal of the weight as I fell forward. It was a most ridiculous thing to do as any of us might easily have broken our necks. We picked up our kits and trudged across a field to the main road where we caught a train into Boulogne and stayed the night at the officers\n\nclub. Whilst walking round the smoking room who should I see there but Capt. Currie Woods of the R.A.F (late R.N.A.S.) \nw.\n He it was who took me up for such a delightful trip in a DH9 aeroplane over Edinburgh and \nunder\n the Forth Bridge about the beginning of July last year.\n\nHe was on his way to Paris on duty. I saw him on to his train \nand\n after almost buying him a fight with the cloak room official and then returned to the club. and turned in.\n","34":"\n Lt. Adams myself and after some little difficulty Lt. Carrick boarded the boat\n\nfor Blighty at 9 A.M. and arrived at Folkestone at 11.30 A.M. after \nthe\n the roughest trip I have ever experienced in the channel. The many sick people around us almost made me seasick too.\n\nWe reached Victoria Station London at 2.30 p.m.\n\nHaving disposed of my valise and unnescessary kit I went out to see my friend in West Kensington to see if they could put me up for the night as I had failed to obtain lodgings in London anywhere. All the hotels were crowded and our club filled to overflowing. I found the house deserted save for the occupant of the \n\nhouse\n flat above \nwho\n a Mr. Daniels who took me in and made me very welcome until my friends arrived. Mrs. Evans soon arrived with her mother and Mr. Devas and after a long and interesting chat to everybody I turned into a comfortable bed which Mrs. Evans had very kindly placed at my disposal.\n\nMy touring ? round France and Belgium is finished I hope for ever. Tomorrow I go to Headquarters A.I.F. to try to obtain permission to stay in England until I am due to sail for Australia.\n","35":"\n I went out to Wandsworth \n\nHospital to see Arthur Wheen and found him looking bright but very pale and his left arm in a sling which he told me was useless and most likely would be for the next two or three years. He has to undergo another operation for it but expects to leave for Australia soon. After a long chat about old times and old friends at the front I arranged to have a day out with him after first obtaining the permission of the sister of his ward and promising her faithfully to have every care of him. I have since seen Sister Curtiss and she told me\n\nthat he was a great responsibility and worry to her as he was so careless of himself and evidently did not realize how dangerous his wound was. She said that she was greatly relieved to \nhear\n know he was leaving but extremely sorry to part with such a splendid patient and altogether charming boy. About 5 p.m. I decided to push off as guests are supposed to be out of the grounds by that time, but the ward sister and two nurses barred my way took my hat stick and coat and then asked me to stay to the dance which they had arranged\n\nthat night in their ward. I began stammering an apology for not being able to stay but quickly and meekly changed my tune.\n","36":"\n I went to \nthe\n see one of the best Musical Comedies in London entitled Yes Uncle\n","37":"\n I met Lt Eric Asbridge today at the Club. He is in the Aust. Flying Corps but was formerly in the old 54th Battalion. We went to see Nothing but the Truth at Her Majestys I think it was.\n","38":"\n Being a beautiful morning I went for a bus ride along High Street Kensington. Did a little shopping and went into town again.\n\nand I saw The Man From Toronto at the Duke of Yorks Theatre I enjoyed it immensely. Miss Iris Hoey is perfectly delightful.\n\nI dined at the Club \nand\n again where I met Col. Marshall and had a long chat. I told him that I was on leave from France, that I was due to \nsta\n go home to Australia and was hoping to be able to stay in England until my boat was due to sail. He promised to help me after which I left him to have a stick at Billiards with that Comedian Lt. Russell from Victoria\n\nIn the evening I book a taxi to the Coliseum Theatre where I saw a varied but splendid programme. A performing seal was the cleverest and most interesting not to say comical of all the turns.\n","39":"\n Today I made a few preparations for Leaving London for Sussex where I intended making the acquaintance of some relatives of friends at home. In the evening I went to see Jolly Jack Tar at the Princess Theatre. It was a rotten show though, and ought to have been kicked out of London.\n","40":"\n Had lunch at the Savoy Hotel with Mrs Evans and a R.A.F. Major after which I caught the 2.15 train at Charing Cross Station. Arrived at Robertsbridge at 4.30 p.m. and was met by Jack and Tommy Kemp both sons of the people whom I was going to see. They piloted me out to their home in the little town of Mountfield where I was welcomed by their mother, a little girl. Cecily and the baby boy Freddy. I found Mr. Kemp to be away on duty in Scotland unfortunately\n\nIt rained heavily all the afternoon.\n\nExplanations and a lively conversation in which the kiddies all joined in at intervals followed my reception. Then all sat down to tea. It was a pretty family group. The prettiest I have ever seen I think. After tea I soon got pally with them \nk\n and we had a great romp until nearly 10 o’clock. and then there was something doing when the\ny\n little boy had to go to bed.\n","41":"\n Mr. Walter Kemp came across from Catsfield today to see his sister and I was\n\nintroduced to him after which he took me for a stroll up to the quaint old church where he showed me the graves of his parents and younger brother.\n\nWe came back through Mountfield Park and \nand\n called in at The John’s \nA\nCross having admired the stately old oak trees along either side of the Park walk. At the John’s Cross I was introduced to his brother George and Mr Collins.\n\nAll hands had a \"sleeper\" then we wended our way back to the house again.\n","42":"\n Cummings came\n\ncame in this evening and played and sang for us. I also made a noise.\n","43":"\n Mrs. Saunders came along this morning and asked me to extract a bullet from cartridge case take out the powder and blow out the cap which I gamely consented to do.\n\nMrs. Saunders is a fine little lady but suffers badly from deafness.\n","44":"\n I went up to see the Gypsum Works this morning and was shown all around the top by the top foreman Mr. Goodsall.\n\nGypsum is the name of a rock which is blasted\n\nout from underground & is then brought up to the top in lifts where it is thrown into huge crushers and ground to a powder. From this rock, Plaster of Paris, Sirapite Plaster, Keene’s Cement, Pariah Cement and manure are extracted.\n\nThe whole household went to a concert held in the village school this evening. It was a very good show indeed for such a small village and \nthrows\n reflects a good deal of credit on the promoters.\n\nA good deal of trouble seems to be brewing\n\nover the Demobilisation question. 100,000 soldiers held a protest meeting at Folkestone and marched through the streets to show their annoyance over the delay in demobilisation. These blighters are mostly A.S.C. and Motor Transport drivers and evidently are not alive to the fact that the war is not quite settled up yet.\n\nCaptain Lang the Sydney airman \nnot\n who toppled the height record in an aeroplane has been arrested for disclosing details of flight. He reached \n\nheight of 30,500 feet. His pilot was unconscious at this height and his own eyes were watering so badly as to render \nhis\n them \neyes\n almost useless. His engine gave out next through lack of air and he had to descend.\n","45":"\n I left Mountfield today by the 2.21 p. train, train the kiddies going with me as far as the school. I reached London at 4.20 p.m. and went to the club but failed to get in so booked a room at 14 Belgrave Square. Hotels and all places of accommodation are crowded completely\n\nin London. I then booked a seat \nat\n for the Criterion Theatre and enjoyed the play \"You never know y’ know\"\n","46":"\n I booked two seats today for St. Martin’s Theatre and took my little pal along. The play was entitled the Officers Mess and is easily the funniest show I have seen in London. It was an absolute scream.\n","47":"\n I went with my little London pal to the most gorgeous \nand\n spectacular show now on in London entitled\n\n\"Hello America\". Miss Elsie Janis and Billy Merson were simply splendid.\n\nAfter the show my little pal & I sat by the fire at home until nearly 2 oclock in the morning at which ungodly hour the swain shook himself descended the stairs very stealthily and slunk home trough Piccadilly. I hailed a cabby with broken down cab horse who consented to drive me as far as Hyde Park Corner.\n","48":" \n At the Club today I met Lt Geldard of the\n\n53rd Bn. who was looking for a pal with whom to go for a trip to the country. I cottoned on to him and we both went straight away to see Lady Harroby in Grosvenor Place and were obliged at once. I have spoken of \nhad\n the good work done for Overseas Officers in a previous booklet.\n","49":"\n We lunched at the Florence Hotel & then caught the 2.55 train from Waterloo for Eastleigh. Reached our destination about 4.20 p.m. and took a taxi out to Fair Oak\n\nPark where we were very cordially received by Mr. & Mrs. Pember.\n","50":"\n Our names I notice have not appeared in the social news of the Times as having left London.\n\nT\n\nGeldard & I took a stroll into the little town of Fair Oak and saw the old oak tree from which the town derives its name. In by gone days the fairs were held under this tree hence the name Fair Oak. Fairs are still held there but they are no longer the grand affair of olden times\n","51":"\n Mrs. Pember took us for a ramble through the woods on their property. She has a great eye for landscape gardening and proved a very interesting hostess-companion. The tremendous energy displayed by all the occupants of this grand old house of Fair oak \nastoni\n is astonishing. It is perfectly bewildering.\n\nMrs. Pember of course is not quite so young as she was, yet she takes a leading part in and is closely connected with all the Parish work and \n\nindeed a great deal which is not in her own Parish work. \n\nIt is wonderful how she manages to find time to spend with us. She deals considerably with various committee meetings, & reports of same.\n\nShe is an extremely charming hostess. Mr. Pember is the typical grand old Englishman. At 74 years of age he retains his sight, hearing and mental faculties and his step is as springy almost as a youths.\n\nIn fine weather he rides his bicycle to &\n\nfrom the town.\n\nHe rises punctually at 8.30 each morning works hard all day at the Bench or on some committee and when he is not working in his office at home he works in his beautiful garden outside.\n\nHe played a game of billiards on a full sized table a few days ago with Geldard and won fairly and squarely. He is an extremely genial old man and I might safely say that he and Mrs. Pember are the happiest couple I have\n\never come across.\n\nMrs. Pember’s daughter Miss Kingsmill is the other occupant of this house, the only \nchild now at home.\n other member of the family now at home. She is an ardent worker for the land girls and is head of most of the affairs of the young women in Hampshire. Her work takes up so much of her time that she is hardly ever seen except at meal hours.\n\nMrs. Pember’s son-in law Roland Sperling is the man who signed the\n\nDeclaration of the Great War between England and the Huns and is now one of the British Representatives at the Peace Conference in Paris.\n","52":"\n A letter came along from the Manager of the Strand Branch Commonwealth bank for me this morning containing some very interesting information Geldard & I were driven over to Hensting in Mrs. Pember’s cart today by Grimes the worthy coachman. Grimes is a great character & is full of the\n\nmost enchanting little stories. We went over to see the Meet of the Hounds \nof\n and Hunters. It was a beautiful morning & we enjoyed the drive and the whole turnout very much. We saw a fierce looking person in a red cap and complete hunting costume, the most \npromising\n conspicuous part of which appeared to be his spurs, whip and fiery red moustache. His name we learned was Captain Standish. He was Master of the Hounds and is altogether a very\n\nmightly man we were told, that is on the hunting field\n","53":"\n Mr. Pember Geldard & I spent nearly all of today working in the garden. He pointed out the large monkey tree which is alleged to be the largest in the whole of England. Miss Edwards came along this evening and she & I played bridge against Mr. Pember & Geldard. The most enjoyable game of bridge I have ever had. Miss Edwards is a very charming young woman. She lives all alone in a fine house having\n\nlost her two brothers and her father during the war. Her mother died previously. \nand\n The two brothers were killed at the war over in France.\n","54":"\n A letter for me from Hqrs. London. I knew its contents before opening it pretty well. However it is not so bad as it might have been. I have to report to Hqrs. tomorrow morning at 10.30.\nA.M.\n to receive movement order etc to \nproceed to\n enable me to proceed to a wretched camp ready for an early embarkation for Australia.\n\nHowever I went to the little village church this morning with Mr. & Mrs. Pember and Geldard and tried hard to feel good about it. The service was the prettiest I have ever attended. After church Mr. Pember took Geldard & I for a stroll round his property which covers practically the whole of the town of Fair Oak & a bit more. Whilst passing the Blacksmith’s (Stubbings by name) shop, I unconsciously glanced across at it and also scanned the windows of the cottage closely. But the old man saw me and \n\nshook his head. Last night at dinner Mrs. Pember said something about the Lady Smithy of Fair Oak which so interested me that I asked for the full story. It appears that Stubbings, having lost his only assistant through being \"called up\" applied for a girl assistant and she was rewarded for his cheek. A fine strapping girl who sent along to him and she now does the striking and sometimes shoes the horses. She is evidently some girl. Mrs. Pember went on to say that this girl\n\nin conjunction with a girl pal ploughed over 500 acres of land during the war in one season. She has driven lorries of the heavy W.D. type and light cars! all war work.\n\nBut manual \naccomplish\n labouring are not her only accomplishments by any means. She is treasurer of the Girls’ League in Fair Oak, can sing, dance play and is quite a clever actress. It was only natural therefore that I should seek to know more of this wonderful girl by actually seeing her myself, and if possible, speaking to her\n\nBut my luck was out. Mr. Pember told me \nthe\n as we toddled along at about 4 miles per hour, (he is a vigorous walker) that she did not live there and as I was leaving early the following morning my hopes of at least seeing her and taking her photograph banished completely from my mind. I was keenly disappointed. I have quite forgotten to state the most important asset of this young lady. She is pretty – and I don’t even know her name. She is an emigrant to this country having\n\nbeen rared in one of the South Sea Islands. Her parents were probably Australians.\n\nWe contained our race through \nthe\n a village about 4 houses and a barn till we reached the little old English Church. Here we paused beside a huge Yew Tree and tried to guess to age. It is know as the Pre-Conquest tree having been planted before William the Conqueror came on the scene.\n\nThe church is the roughest thing in architecture I have ever struck\n\noutside Australia or Egypt. If it was designed for strength then the designer certainly knew his job. The walls are built of flint and cement and clumsily but strongly buttressed. On entering the church, our eyes were somehow instantly attracted to the roof. Instead of the neat plaster ceiling and \npretty\n spandrills usually to be inside a church there is here no ceiling at all and the spandrils consist of merely a powerful oak plate laid across apparently without purpose\n\nas the roof passes over it to the outer wall.\n\nThe rude stout oak plates and rafters were naked of any deceiptive fancy plastering.\n","55":"\n I said good bye to my very kind host, hostess and their daughter last night and left Fair Oak Park this morning about 9 oclock in the pouring rain being driven to the station by Grimes.\n\nGeldard who intended coming in with me to catch an early train for Bournemouth very sensibly decided to stay behind. I reached Waterloo Station\n\nsoon after 11 o’clock \nand\n and went straight to Headquarters where I managed to wangle an extra day before going down to Warminster to the camp.\n\nI secured a couple of seats at the Haymarket Theatre for my pal & myself \nand\n where we saw The Freedom of Seas. This is the part in which Miss Billie Carlton used to be the leading light.\n","56":"\n I left London by the 12.15 train and arrived at Warminster at 3.15 p.m. Arrived at the O.T.B. I was\n\ninformed by the Staff Capt. that I had just missed a berth on the Lancashire and would now have to wait a fortnight. I was rather relieved however at finding that I didn’t have to rush straight away to a boat as I have a lot of stray important mail wandering around the country after me. \n\nI have been allotted to a cubicle with a Capt. Butler and Lieut Owen both very decent chaps. Capt. Butler is a great hand at keeping the fire going as the weather is as frosty as the deuce I have rather a\n\nlittle more sneaking regard for him.\n\nI took a stroll down to No 1 Command Depot this morning and saw Capt. John Mitchell M.C. and also my name on a roll of 50 others recommended for early repatriation. John was extremely busy when I saw him. Shoals of men were darting over to his table pushing documents of all descriptions under his discriminating nose. He managed to put them all route after a while and we strolled across to his cubicle & had a chat. Afterwards saw\n\nMajor Simpson in the Mess & had a talk with him. He was temporarily Commanding the old 54th Bn. at Wylschalk but afterwards took charge of the 56th with the temporary rank of Lieut-Colonel. He is a gentleman to the backbone.\n","57":"\n Myself & seven others were called over to see the Staff captain this afternoon and informed that five of us are to go on board a boat which is to leave within a few days. We are to be informed tomorrow who the lucky five are and which boat they are to go on.\n","58":"\n We have had nearly a week of bright days. Cold and uncomfortable mornings & evening but beautiful between whiles.\n\nYesterday the","59":" the first batch of men to be returned to Australia through this camp came across from Le Havre and marched into this camp. They were all","60":" Div. men & I was wondering if Herbert Burrington might be amongst them when whom should \nI\n walk out of the crowd but Herb. himself. I also bumped Sgt. Billy Coulden formerly of the old 54th Bn. now in \n\nthe","61":" Bn.\n","62":" far we do not know which five out of the eight are picked for the next boat home.\n","63":"\n Herb. Left on leave this morning with the remainder of his batch. They have all been granted 14 days leave prior to going home. Yesterday I signed two more papers in connection with my going home. 50 of us are to sail by the \nfirst boat\n in February. This waiting and hanging about in this miserable hole is very trying.\n","64":"\n Went on 24 hours leave to London to do \n\na little purchasing for my voyage home. Stayed at the Jermyn Court Hotel.\n","65":"\n Bought a mandolin amongst a number of other things with which to amuse myself on the homeward trip. Met Lts. Carrick and Dodimead in Fleet Street and Regent St. and the trio strolled off to the Paladium. I had to leave at half time to catch my train back to camp and dashed if I didn’t bump into Eric Astridge and Frank Morely on the way down, both reporting to the 1 Camp at Warminster.\n\nprior to sailing for Aussie.\n","66":"\n We are still waiting for our boat. It seems as if it will never be ready. to take us away. from this wretched existence. We have had hail, rain, snow, wind and misery.\n\nIndustrial trouble has been rampant throughout Great Britain. Hundreds of thousands of shipping hands have \ncome out\n been out on strike and engineers, \nand\n tube conductors, drivers and hotel & restaurant waiters & waitresses have \nbeen\n come out \nand\n all demanding higher wages and less work. The trouble is easing down considerably, the government\n\nhaving intervened and threatened to resort to harsh measures if the strikers did not carry on with their job. Tremendous inconvenience has been caused to business and other people in London.\n","67":"\n A number of girls in Trowbridge having arranged a dance & supper in the Town Hall in Trowbridge I went with a number of others at the invitation of the ladies and we had ‘some’ time. I learnt quite a lot about dancing, I don’t think.\n","68":"\n The latest information which I have received about my going home\n\nis that I have been struck off a boat roll. No reason for this action has been given me and as late 1914 1915 1916 & 1917 officers are going by this boat, (the H.M.S. Orca) I have written an official letter to the Gvt. A.I.F. Depots in the U.K. and if I still receive no satisfaction I shall write to Gen. Birdwood from whom every man in the A.I.F. gets a square dinkum deal. Several other officers are in the same boat as myself. I have often been disgusted with the \nA.I.F.\n underhanded methods of different people in responsible positions as a private but neve have I been so fed up as now.\n\n"}}