{"Document Name":{"0":"Diary_0071","1":"Diary_0071","2":"Diary_0071","3":"Diary_0071","4":"Diary_0071","5":"Diary_0071","6":"Diary_0071","7":"Diary_0071","8":"Diary_0071","9":"Diary_0071","10":"Diary_0071","11":"Diary_0071","12":"Diary_0071","13":"Diary_0071","14":"Diary_0071","15":"Diary_0071","16":"Diary_0071","17":"Diary_0071","18":"Diary_0071","19":"Diary_0071","20":"Diary_0071","21":"Diary_0071","22":"Diary_0071","23":"Diary_0071","24":"Diary_0071","25":"Diary_0071","26":"Diary_0071","27":"Diary_0071","28":"Diary_0071","29":"Diary_0071","30":"Diary_0071","31":"Diary_0071","32":"Diary_0071","33":"Diary_0071"},"Date":{"0":"unknown","1":552.0,"2":597.0,"3":599.0,"4":600.0,"5":601.0,"6":604.0,"7":607.0,"8":609.0,"9":610.0,"10":611.0,"11":612.0,"12":616.0,"13":617.0,"14":620.0,"15":621.0,"16":622.0,"17":623.0,"18":626.0,"19":627.0,"20":628.0,"21":629.0,"22":644.0,"23":651.0,"24":653.0,"25":654.0,"26":670.0,"27":671.0,"28":672.0,"29":673.0,"30":674.0,"31":675.0,"32":677.0,"33":679.0},"Entry":{"0":"\n\nWe left Sydney on the ","1":" 1915, arriving at Port Melbourne 2 days later at 4 p.m. when after taking on board more troops we re-sailed at 6 p.m. After leaving that Port the only land visible to the eye of Australia was Cape Leuwin. Nothing of note occurred crossing the Indian Ocean in fairly fine weather. Crossing the Gulf of Aden land was sighted at times, and we passed some steamers of different types. On entering the Red Sea the heat was terrific, and we had a close view of the Soudan and African Coast. The sunsets in this sea, are the most beautiful I have seen, one being in particular worthy of mention.\n\nThe clouds were low down on the horizon resembling great mountains and the sun sinking behind them in a vivid ball of red, gave them the appearance of great snow clad peaks, outlined with a fringe of red gold. We also passed 12 little islands upon the largest one being perched a lighthouse. Those are called the twelve Apostles. Passing Aden late one evening, at a distance of 20 miles, the searchlights were plainly visible playing from that Port. After arriving at Suez a thirty one day voyage, we anchored in the stream for two days before disembarking and were beseiged by natives selling all kinds of articles at, of course, their \"verra\" cheap prices. A little time after our arrival, two\n\ntransports packed with Ghurkhas and Sikhs anchored near us. They were bound for France. We eventually disembarked at Suez, and continued our journey overland. It was a very interesting trip on account of its historical associations, and took 7 hours to accomplish before reaching our destination Cairo. Periodical and picturesque views were had of the Canal & Bitter Lakes interspersed by ships and sand storms. One would travel for miles with nothing but a sea of barren sand visible, but at other times would enter a native village surrounded by a veritable bower of green. When the train pulled up at any of these places, we were besieged by natives selling\n\ngrapes, melons and soft drinks, of which we secured a good supply. I am therefore in the position of knowing how uncomfortable one can become sitting on the burning desert devouring water melons. The natives dress in all kinds of quaint and coloured costumes, \"slightly\" different to those seen on \"the Black\" Sydney. The crops which abound, owe their success to irrigation, the water being run through wide creek like drains from the River Nile. At different points along the line, Indian and Egyptian troops were posted, who either stood to attention or waved in an excited manner, as we went by. The latter were mounted on camels, they being members of the Egyptian Camel Corps.\n\nSeveral big towns were passed on the journey, the largest being Zagazic & Abour Hamid. The smallest is Baaliva Post which consisted of a sentries Box, and about 4 Indian soldiers. The natives houses are built of mud with flat roofs, and they appear to have a mania for keeping their doors and windows closed. Donkeys are as common here, as fowls in Australia; but of course they don’t resemble the latter. We eventually arrived at Cairo at 1 a.m., and after getting our equipment off the train, marched to Helipolis, where we went into camp feeling very tired & sore from the jolting received from what I considered a springless train.\n\nOur routine at this camp is drill 6 a.m. till 9 a.m., lecture 11 till noon, and drill again from 5 till 7 p.m. After that hour we were allowed to visit Cairo & Helipolis proper a big residential suburb of Cairo and 5 minutes walk from our camp. There are some very fine buildings in this locality, especially in size and architectural design, the most imposing being the Palace Hotel containing 1400 rooms, with splendid gardens and grounds. It is called the Monte Carlo of Egypt, being built for the same purposes as places at that world famed resort. It has now been converted into a military hospital. The Abassia and Egyptian Army Barracks are also very spacious and cover\n\na good many acres of ground. One evening we marched from camp to Kasr-el-nil Barracks, situated on the other side of Cairo, and on the way passed through the following thoroughfares\n\nBoulevarde Abd-el-Moneim\n\nAvenue De Lima\n\nAvenue Ramses\n\nAvenue Du Caire\n\nWe stayed at the Barracks a few hours, before returning to camp. That building, one of the oldest of its kind, which its appearance denotes has in its time been garrisoned by most of the famous British regiments. It is an enormous structure 3 storeys high, with the railway running right into the parade ground and is built on the following\n\nplan. \n\nThe day following our return to camp we had a race meeting on the desert which was very exciting. On the","2":" a dozen of us went to Abassia, about two miles distant for horses. There are some thousands kept there and we led 50 back. On the","3":" we marched to Kasr-el-Nil Barracks to relieve the East Lancashire Regiment as garrison, but after staying one night and a day, were in turn relieved by the","4":" Aust. Brigade. On the","5":" we marched to Abassia rifle range for our shooting tests. We stayed all night, shot all the next day and returned to camp in the\n\nevening, I made the best shooting score in our section 19 out of twenty at two different ranges and won 15 piastres. Aug 15\/15 \nevening\n. Word has just been given quietly round to prepare to march out at a minute’s notice for the front. ","6":" We marched from camp at 3 a.m. this morning entraining at Zeitoun for Alexandria where we arrived at 11 a.m., going direct from the train to the transport \"Saturnia\" a high decked but very narrow looking ship, with decks as greasy as a butcher’s block. The harbour was full of transports, colliers, Hospital ships etc. which interested me, but as a beauty spot the place needs a lot of retouching. We left Alexandria at 6 p.m. As the \"Royal Edward\" a British transport was sunk two days\n\nago by enemy submarines on the route we have to follow, guns were were mounted fore and aft of our ship, lookouts have been posted, and each man given a lifebelt. The steamer steered a zig-zag course as a guard against attack, and we arrived after a three day trip at Lemnos","7":" On the way we passed Zyra, Thynos, Dhlos, and Mikonos islands belonging to Greece, very barren looking places, when compared to our own sunny shores. The entrance to Lemnos is protected by rows of mines and the harbour is full of ships of every description. The shores are hilly in most parts, but entirely void of vegetation. We anchored alongside three other ships, viz. \"Umsinga\", \"City of Edinburgh\" and the \"Hunsdon\" a captured\n\nGerman boat. It was only necessary to climb the deck rail of our ship and one could step on to the first named boat, an opportunity most of us took full advantage of. The marks of where German shells had struck the decks of the \"Umsinga\" whilst crossing the North Sea, were numerous, but very little damage had been done. The second named boat had on board a few of the Royal Welsh Fusiliers, remnants of a regiment that had suffered heavy casualties at Gallipoli a few days ago. After two days my Battalion transhipped on to the smaller but faster Egyptian mail boat \"Osmanieh\" and after dark","8":" left for Gallipoli. Our ship carries no lights, smoking is not allowed and the\n\nonly sounds that break the silence is the throb of the engines and the swish of the waves as the ship forges ahead with full steam 20 knots. Now and then like a flitting shadow, I could see in the starlight a British destroyer, our alert but silent protectors. 11 p.m. We have just anchored about a mile off Gaba Tepe, after an uneventful run from Lemnos. Strict silence was observed when an hour later we stepped on to barges that took us ashore. We can hear the roar of guns and see the flashes of rifles & machine guns near us, between Anzac and Suvla Bay. Lights in the dugouts and on the beach made portions of the beach look a little cheerful, but on the whole, the place has a grim and sinister appearance\n\nespecially where the ragged cliffs of Walkers Ridge and Quinns Post stand out against the sky line. Fortunately only a few of our men were hit going ashore, from Richotet bullets. An idea of a British naval gunners proficiency has just been shown us. A destroyer crept in close to shore and turning went slowly along,a small black shape visible faintly with the starlight. Suddenly it stopped and in the next second, sent its flash or searchlight on to the slopes running up from the shore. Almost simultaneously with the flash of the light, a shell from the Destroyer burst where the light had rested. It is no wonder that Von Tirpitz prefers the breezes of the Kiel canal to the winds of the North Sea. 1 a.m. We have just\n\nstepped ashore and single file have silently after 10 minutes walk reached Rest Gully, with a high cliff in our front and the ocean behind. We are to rest here till further orders.\n","9":" We left Rest Gully at 6 p.m. and have just come along a deep trench running along the beach to No. 3 Post. The heat was stifling marching along the trench, with the dust stirred by a thousand pairs of feet, in such a narrow passage way, and gravel loosened along the sides where enemy bullets are striking all the way along. At present my thirst feels unquenchable. We have now halted in a gully running inland with a slope in front and one on each side, and the sea behind,\n\nand our officers have given orders for us to lay down and rest. I dug a crevice in one side of the gully to relieve the half standing position I would be compelled to rest in but had only been there a few minutes when a spent bullet just missed my head. These bullets keep the same altitude for the distance the range finder is set, but after that begin to drop, and that accounted for them coming coming over the slope into our resting place. Later. We are now waiting to support the 18th Battalion who are attacking Hill 60 in our front.\n\nNoon,","10":" Through some mistake we were told to visit a well at the beach and fill our water bottles. In so doing we were seen by the Turkish\n\nobservers, who turned rifle and machine gun fire on us, wounding several men, as\nthe\n we were fully exposed crossing the open flat leading to the water. This our second day in the gully was more distrastrous than the first. Having found our position the Turks commenced dropping shrapnel shells on us. Our Farrier Sergeant had his leg blown off within ten yards of me. Our Battleships and monitors are now returning the enemy fire with a terrific bombardment & shells are flying over our heads into the enemies lines.\n\nEvening\n. We have just been marched back to our first landing place, and taken up a position on Walkers Ridge a narrow position on top\n\nof the cliffs, as relief to the 8th &","11":" Light Horse. I will never forget our second night in this position. Seven of us were put in a secret sap or trench running at an angle across the front line towards the Turks trenches 40 yds. away. It may be necessary to explain that men in a secret sap are not allowed to talk or fire. If the man nearest the Turks hears anything suspicious he passes word to the next man & from man to man word is passed in whispers back to the firing line. The sap is very narrow and shallow, and on the night in question, we were sitting with our knees touching our chins from 7 p.m. till 7 a.m. the next morning, a bitterly cold breeze\n\nis blowing through the sap, and added to this vermin are crawling all over us. The constant spray of bullets from the enemy rifles & machine guns has loosened the earth above our heads which had covered the bodies of our own men & the Turks who had been buried there, causing a fearful stench to arise, and in some places the foot or leg of a dead Turk protruded from the bank above our heads. The trenches here on Walkers Ridge are situated on top of a cliff, with only a narrow winding path down to the sea for exit. If by any chance the enemy succeed in driving us out, we would be decimated in retiring down such a steep narrow way.\n\nBack of our trenches, on a little slope facing the sea, is a spot called Happy Valley, so named by our own men. It is dotted all over with little crosses that mark the resting places of our comrades who have gone under. When one stands and looks at those rough little mounds, which in truth are nought but shrouds of honour, teeth seem to clench and the rifle grip tighten, when one can see in imagery, a grey headed old mother sitting tremblingly, expectantly, patiently, with hopes that these little crosses only too truly shatter. \n\nAll our ammunition and provisions are brought up on mules by the Indian Transport Column. That\n\nbody of men have done splendid work under exceptional difficulties since their arrival here. They and the Gurkhas have a very good opinion of our men, and in speaking we say \"Hulloa Johnny\". They say likewise. So that we are all Johnnys. Our duties in & out of the firing line are of several different kinds. For three days we are in the firing line, and would then be put on observation or sap work. One night this week I was on duty sapping, we cut through into a secret tunnel belonging to the Turks, and had to get out at once to enable our Engineers to run a fuse (electric) to the spot, there being placed some high\n\nexplosives at the end of the fuse. When everything was clear, they fired it, and the explosion that followed made the Ridge tremble. I’ve had several narrow escapes from bullets, even when off duty. One bullet struck a bank not an inch from my head whilst I was trying to have a sleep. On another occasion whilst guarding our water tanks with six comrades a Turkish shell came over & pieces of it went through a water tin a yard from me. I picked it up and it was red hot. This morning we were having breakfast just outside our firing line, and I was sitting down and one of our men named Langley was standing up near me. The Turks sent a\n\nshell over, and one pellet went right through the centre of his hand, and others spoilt all our water tins.\n","12":" Whilst on duty in the firing line at 1 a.m. my rifle became so hot from continuous fire I was compelled to let it cool. The Turks have been bombarding with big guns and machine guns for some time, and we expected them to attack at dawn, but so far, 8 a.m., nothing has happened. ","13":" p.m.\n We have been given orders to fix bayonets with as much noise as possible to give the Turks the impression of a coming attack. Being so close to our trenches they heard the sounds quite distinctly, and our parapet in return received an avalanche of bullets\n\nfrom dozens of machine guns. This was done to make them waste their ammunition.\n","14":"\n Nothing of importance has taken place since the","15":" Seven of us are at present guarding the water tanks. Between 4 & 5.30 this evening the enemy dropped a lot of shells into a gully just below us, but after that they were silenced by our Howitzers.\n","16":" \n\nSeveral shrapnel shells fired by the enemy burst about 25 yds. from us today. They also fire shells from a 75 captured by them from the French. It is the last gun they have. Two others belonging to them we christened Screechy Liz, on account of its noise going through air and Beachy Bill.\n","17":" p.m.","18":"\n\nWe have started work tunnelling to try and get under the Turks trenches. Our reason is for aerial purposes.\n","19":" I am again in the firing line and a heavy artillery duel is in progress on our front. The Turks are also dropping bombs over, one of our Corporal bombers being blown almost to pieces.\n","20":"\n\nLast night I wheeled earth in a barrow from a tunnel running almost under the Turks trenches for 4 hours, and finished another 4 shovelling. To do the former one had to stoop, because the tunnel was only 3 ft. by 4 ft. What with vermin and heat\n\ninside, and a cold wind outside, it was hard work and far from being a pleasant task. My back felt at times as though it was about to break. After getting out of the tunnel we had to wheel the earth about 40 yds. down a narrow sap where we were exposed to rifle fire. The passage was very steep and ended at a cliff, and it was necessary when wheeling to have a man hanging round one’s thighs to act as a brake. Unless something unusual occurred, or an attack was expected, both Turks & our own batteries fired most of their shells before 1 a.m. and after 4 p.m. At 7 p.m. each evening every man in the trenches stood to arms, and also from 4.30 a.m. till 5 a.m.\n\nthese being considered the most likely hours for an attack. At the same time as the order was given to stand to, the monitors in the bay just behind our position used to send 10 shells regularly to the enemies trenches immediately on our front, and do likewise at midnight. The Turks replied as a rule but seldom put many shells near our ships. The monitors are fitted with 14 inch guns a shade smaller than those carried by the \"Queen Elizabeth\" and one evening I was on duty in a tunnel working by candle light, some 30 yds. from the entrance, one of the monitors dropped a shell about 40 yds. on our front on the\n\nTurkish trenches. The concussion was so great that all our candles were extinguished and the \nthe\n ground seemed to tremble. Just behind our position here, in a deep gully where the Indian Transport Column had their camp, their mules were kept in wide crevices running into each side of the gully and were well protected. The Turks fire on our aeroplanes every afternoon, but seldom go near them. It was a fine sight watching the dozens of shells bursting in the air. From the foot of Walkers to the top is only about 400 yds. but it is so steep 2 or 3 rests are necessary on the way. As the crow\n\nflies it is about 200 yds. from the sea shore. Sometimes we only have half a bottle of water a day, but with the heat feel inclined to drink a bucket full. General Birdwood a fine Officer and kindly spoken man is often round our positions and has a cheerful word for all. Our Brigade, through I understand a mistake lost 700 men in one attack. To attack the enemy meant jumping over some trenches manned by Indians and attack the enemies trenches across a piece of ground devoid of cover. After being cut up badly our men captured 3 lines of trenches. On reaching these the enemy\n\nturned on an enfilading fire from both sides. Being so weak after heavy casualties suffered, a retirement was necessary, but lack of reinforcements, and a badly arranged attack were responsible for the true position our men were left in. The 8th &","21":" Light Horse suffered severely also before we relieved them at Walkers Ridge.\n","22":" At this time, Sept., I got a slight shell shock and was sent from Gallipoli to Lemnos \nto\n on the Hospital ship \"Glenart Castle\". From the highest Officer down to the galley cook we received the greatest kindness and attention on this boat. Leaving the \"Glenart Castle\" at\n\nLemnos I went into the","23":" Australian Field Hospital at Mudros Village. I stayed here till the","24":" I was then sent to the","25":" Clearance Hospital inland about a mile. Whilst there I went for a walk on the hills close by, on which the Turks & Greeks had some heavy fighting during the Balkan War 6 years ago. The remains of barricades and trenches were plentiful, but I was unable to secure a cartridge case as a memento. However, I secured some coloured stones, rather than come away empty handed. After a fortnight I went on board the transport & Hospital Ship \"Acquitania\" and sailed for England at 7 a.m. on","26":"\n","27":" We passed Zyra at 1 p.m. today, also a destroyer patrolling in the vicinity. At 4 p.m.","28":" we passed Sicily close in to shore, but owing to a thick haze can’t distinguish many landmarks. Today 23rd we passed close to the African Coast. At 7.40 a.m. a man jumped overboard. One of our men that saw him go, dived over also, although we were steaming 21 knots. By the time the steamer hove to, and boats had reached the would be rescuer, he had been in the water nearly 30 minutes, but had failed to find the first man that had jumped over in an attack of delirium.\n\nThe ship is a beautiful vessel of 47000 tons, and can steam 25 knots an hour. There are hot and cold running baths, ballroom in fact everything, and it is quite easy for a newcomer on board to get lost for a time. The ballroom is surrounded by a gallery supported by white pillars. In peace time the boat carries 300 stokers and firemen, and it is said burns 1000 tons of coal a day. Her crew numbers somewhere about 1500. ","29":" \ncontinued\n. We passed Malta at a long distance at 9.15 a.m. today, and at 10.15 are\n\nstill close to the African Coast in beautiful weather. At 8.15 we had a fine view of the Atlas mountains, some of the highest peaks seemingly reached to the clouds. \n\nOct. 24th. We are close to the coast of Spain. The country is mountainous, but our view is limited owing to a thick haze. At 1.25 p.m. we anchored off the Rock of Gibraltar for an hour. This fortress is said to be mounted with 300 guns the smallest being a 4.7 inch. Opposite Gibraltar and plainly visible is the town of Tangier, between that place and Bizerta being Algiers and Oran. 4.55 we have now entered the Atlantic Ocean.\n\nOct. 25th. We are just\n\nopposite Cape St. Vincent, where history was made when Nelson won a big sea battle in the vicinity. The Balines we passed a little later consist of 3 rocks, one big one upon it being a lighthouse and two smaller ones. 8.30 p.m. we are now opposite the light on Cape Finisterre, the sea being very rough. After crossing the bay of Biscay we passed the Ushant, and ran into the English Channel in a heavy fog. \nLater\n. We have entered the Solent and have a close view of the Isle of Wight including Cowes and Osborne House, an aerodrome, and Netley Hospital.\n\nLeaving the ship at the docks Southampton \nand\n we entered a train and arrived at Clapham Junction, London. We have just arrived at Fulham Hospital, Hammersmith, in private motor cars, mine being driven by a lady.\n\nThis little book would hold insufficient space for me to give an account of my experiences, impressions formed, and the wonderful kindness extended to myself and comrades after our arrival here.\n\nF.C. Burgis\n\n1363 D Coy.\n\n20th Batt.\n\n5th Brig.\n\nAt 3.25 p.m. we anchored at The Rock Gibraltar for orders. There is a big town opposite Gibraltar on the North African Coast. Proceeding we entered the Sth. Atlantic Ocean about 4.30 p.m.\n","30":" a.m. We are just opposite Cape St. Vincent, where Nelson fought one of his biggest battles, and near Lisbon. The sea is a little rough. Passed the Berlines at.\n\nThere is one flat rock \nabout\n 2 little ones at one end, and two more about a mile distant.\n\nThe big one has a lighthouse on top in the centre.\n\nNorth African Coast\n\nPassed close to Algeria\n\nBizerta\n\nAlgiers\n\nOran\n\nMorocco\n\nTangier big town opposite Gibraltar\n","31":"\n\n8.55 p.m. We are almost opposite the lighthouse on Cape Finisterre. After rounding\nBerl\n this point we cut across the Bay of Biscay. The \nweather\n water is now fairly rough.\n\nThe Officer in charge of the \nA\n hospital staff on board is Lieut. Col. Fuhr, D.S.O.\n\nWe also passed \nthe\n Lisbon on the coast of Portugal today. On the other side of the Bay of Biscay is a point called the Ushant. Anchored in the stream off Southampton 4 a.m.","32":" We can’t see land for a heavy fog.\n\n9.15 a.m. We are now sailing along the Solent opposite the Isle of Wight which we can see faintly through the fog.\n\n9.45. We are just opposite Cowes now where all the big regattas are held. I saw Osborne House.\n\n2.15 p.m. We are now anchored at the docks Southampton and large numbers of troops are marching on to the wharf. The Railway S. Western runs right on to the wharf. I have never seen such beautifully tinted leaves on trees such as you will see on the way up the Solent\n\nup to\n to anchor at Southampton, which surround the many mansions which are on the water’s edge. The Netley hospital is a very fine building. \n\nLeft for London 4 p.m. Along the line men, women and children of all classes waved and through kisses to us. There is some beautiful estates between Southampton and London, and the beautiful trees and green grass besides reminding us of home, were a pleasant relief to the barren \nland\n country we left.\n\nPlaces I have been to,\n\nPort Melbourne\n\nSuez, Egypt\n\nZagazic, Egypt\n\nCairo, Egypt\n\nZeitoun, Egypt\n\nHeliopolis, Egypt\n\nAbassia Barracks, Egypt\n\nKasr-el-Nil, Egypt\n\nAlexandria, Egypt\n\nLemnos\n\nMudros\n\nAnzac\n\nGaba Tepe\n\nRest Gully\n\nNo. 2 Post\n\nNo. 3 Post\n\nNew Zealand Gully\n\nWalkers Ridge\n\nPlaces I have seen,\n\nAbour Hamid and every town and village on the line between Suez and Cairo\n\nSuez Canal\n\nSyra, Greek possessions\n\nThynos, Greek possessions\n\nDhlos, Greek possessions\n\nMikonos, Greek possessions\n\nImbros, Greek possessions\n\nNorthern African Coast\n\nAtlas Mountains\n\nSicily Coast\n\nCoast of Spain\n\nCape Helles\n\nAchi Baba\n\nSuvla Bay\n\nChocolate Hill\n\nHill W.\n\nAt Gallipoli and Lemnos.\n","33":"\n\nI can now see two big baloons sailing over London, from the hospital balcony.\n\n"}}