{"Document Name":{"0":"Diary_0088","1":"Diary_0088","2":"Diary_0088","3":"Diary_0088","4":"Diary_0088","5":"Diary_0088","6":"Diary_0088","7":"Diary_0088","8":"Diary_0088","9":"Diary_0088","10":"Diary_0088","11":"Diary_0088","12":"Diary_0088","13":"Diary_0088","14":"Diary_0088","15":"Diary_0088","16":"Diary_0088","17":"Diary_0088","18":"Diary_0088","19":"Diary_0088","20":"Diary_0088","21":"Diary_0088","22":"Diary_0088","23":"Diary_0088","24":"Diary_0088","25":"Diary_0088","26":"Diary_0088","27":"Diary_0088","28":"Diary_0088","29":"Diary_0088","30":"Diary_0088","31":"Diary_0088","32":"Diary_0088","33":"Diary_0088","34":"Diary_0088","35":"Diary_0088","36":"Diary_0088","37":"Diary_0088","38":"Diary_0088","39":"Diary_0088","40":"Diary_0088","41":"Diary_0088","42":"Diary_0088","43":"Diary_0088","44":"Diary_0088","45":"Diary_0088","46":"Diary_0088","47":"Diary_0088","48":"Diary_0088","49":"Diary_0088","50":"Diary_0088","51":"Diary_0088","52":"Diary_0088","53":"Diary_0088","54":"Diary_0088","55":"Diary_0088","56":"Diary_0088","57":"Diary_0088"},"Date":{"0":"unknown","1":1654.0,"2":1655.0,"3":1656.0,"4":1657.0,"5":1658.0,"6":1659.0,"7":1660.0,"8":1661.0,"9":1662.0,"10":1663.0,"11":1664.0,"12":1665.0,"13":1666.0,"14":1667.0,"15":1668.0,"16":1669.0,"17":1670.0,"18":1671.0,"19":1672.0,"20":1674.0,"21":1677.0,"22":1680.0,"23":1681.0,"24":1682.0,"25":1683.0,"26":1684.0,"27":1685.0,"28":1686.0,"29":1687.0,"30":1688.0,"31":1689.0,"32":1692.0,"33":1695.0,"34":1696.0,"35":1699.0,"36":1700.0,"37":1703.0,"38":1704.0,"39":1708.0,"40":1709.0,"41":1738.0,"42":1739.0,"43":1741.0,"44":1742.0,"45":1746.0,"46":1748.0,"47":1749.0,"48":1752.0,"49":1753.0,"50":1765.0,"51":1769.0,"52":1770.0,"53":1771.0,"54":1776.0,"55":1778.0,"56":1779.0,"57":1785.0},"Entry":{"0":"\n\n","1":"\n\nAfter Breakfast I took a stroll around the Streets & along the Pier making a few purchases & arrived at my Sister’s home at 12 noon when I packed up my belongings & after a hearty Dinner I thanked my Sister & said Good Bye & left for the Station arriving there at 2 Pm & got a good seat in a 3rd class carriage and at 2-15 Pm the train Started & in a few minutes arrived at Barnham Junction where I had to change & after a few minutes wait along came the Train for London, & soon we were off again, I had some very nice companions travelling with me & soon we were chatting & the time passed very pleasantly & the Scenery all the way was very pretty, as one passed through each Town there were the usual row of Houses with their small gardens in front. We arrived into Victoria Station on time at 4.15 Pm & once outside I took a Bus to Waterloo Station passing though several crowded streets & on arrival at Waterloo I went across to the Union Jack Club where I intended \n\nmaking my quarters during my Stay in London, after Booking my Bed which was No 314 & up on the 4th Floor I then walked upstairs, as I mentioned in No1 Diary during my Stay last year before going over to France & described the Rooms, so I need not go into particulars, As usual my Room was a single one & everything nice & clean & well up to date, I then had a Wash & a Brush Up, then went down for Tea which cosisted of Boiled Cod & Potatoes, & Bread & Butter which I thoroughly enjoyed, I then took a Stroll over Waterloo Bridge & along the Strand & booked a Seat in the Stalls at the Hippodrome where Mr Harry Tate was playing in a Revue called \"Box of Tricks\" supported by Miss Dorothy Vane & a splendid Coy, likewise an Orchestra of 50 Performers, & they played beautiful & the Scenery & Effects were put on in grand style & the Singing & Dresses were first Class some very beautiful Costumes were worn by the Ladies the Revue started at 8.15 Pm & finished at 10.15 Pm & I must say I spent a most delightful Evening, afterwards as it was very light, I strolled along the Strand \n\nwhich was crowded with People, the Girls Promenading were all very nicely dressed, what with the Buses & & People promenading, it made a very nice picture, at about Eleven Pm I started on my return Journey to my Club near Waterloo Bridge & arrived there at 11.30 Pm & had a nice Supper & soon was into Bed & asleep.\n","2":"\n\nAfter a good nights sleep & a hearty Breakfast I started on my day’s Sight seeing. I took a stroll along the Strand for a while then into a Bus to New Oxford Street & then I went into Selfridges large Emporium & had a good look around for an hour buying a few things. This Emporium is a fine place but very difficult to find any particular place as there are so many turnings & windings that one get’s mixed up, the Girls in charge of the lifts, were all very smartly dressed, in Cream Coats & Trousers with Cream Leggings & Tan shoes, with Cream Caps & were very obliging, the Girls behind the Counters were all dressed in Black Sateen Dresses & also looked smart & a large number of Men, wore their Discharge Badges also their wounded stripes on their Arm, \n\nAt Dinner Time I took a Bus back to the Club where I had a hearty Dinner & then out again & spent the Afternoon Bus & Tram Riding in several directions, which was very interesting & then back again for Tea & afterwards along the Strand to the Adelphi to see the Revue called The Boy. This Theatre is not nearly so large as the Hippodrome, but is very pretty & also had a large Orchestra, I spent an enjoyable two hours, the Scenery & the Costumes & the Singing were all A.1. After another promenade I arrived back at the Club at about 11.30 Pm & had some Supper & again into Bed being very tired. I was awakened at 7.30 am next Morning by the Musical Instruement playing downstairs & after a Hot Bath & another good Breakfast. \n","3":"\n\nI took a Bus \nto\n & went for a ride down the Strand & back again & then into the Commonwealth Bank to do some business, I spent the remainder of the morning walking about then back again for Dinner, & a little rest, & off again by a Bus to Regents Park to visit the Zoo, I was \n\nnot in their long before it started to rain & everybody had to seek cover, there were a large number of people about with their children, but as it was too wet the Elephants & Llama Rides were cancelled, in between the Showers, I strolled around into several houses containing Animals of all descriptions. One house contained a lot of Australian & South African Birds of all sorts. The Bears Place is built of Stone & raised up from front to back like a Rocky Hill with stone walls around the Sides & Iron Bars in the front & their House at the Back, there were two lovely Polar Bears, pure white & beautiful specimens, the Lion & Tigers Etc are in cages inside a large house which is heated in the Winter, as it was continually raining I made my way back to a Bus & back to the Club & had Tea, & afterwards walked down the Strand to the Garrick Theatre to see the Spy Drama \"Pidgeon Post\" which was well played, & had a crowded house, coming out \nat\n after 10 Pm I promenaded until 11 Pm & then back to the Club for Supper & into Bed at Midnight. After Breakfast \n","4":"\n\nI caught a Bus for Whitehall & walked along to the Barracks to see the Guard on Parade & at 10 am the Guard headed by a splendid Brass Band of 50 Performers, 30 Drum & Fife & 4 Bag Pipe Players with their Side Drums with the Guard in the Rear marched out & around The late Queen Victoria Statue in front of Buckingham Palace to St James Palace where the change of Guard took place, when the King is home the Guard is at the Palace & when he is out at St James Palace, the Band played beautiful & the changing of the Guard very interesting which was admired by a large crowd of People, after the Releif Guard marched back I took a Bus back to the Club & obtained my Valice & caught the Tube from Waterloo Station to Euston, being met on arrival at Euston by a small Scout who directed me very nicely to a Restaurant where I obtained a Hot Dinner & then showed me to a Seat in the Glasgow Train, The Train left at 1 Pm & after an interesting run passing through Rugby Crewe, Preston Lancaster to Carlyle when the scenery \n\nwas getting more interesting as we were then in Scotland & getting into very Hilly Country & fairly well cultivated After a non stop run between Carlyle & Glasgow arrived at the latter place on time 11.10 Pm, & was then directed to the Free Soldiers Buffet where some very nice Ladies gave all the boys some Cakes & Tea which was very acceptable, we received the same at Preston & Carlyle I was then directed by a Cripple Scotch Lad to the Over Sea’s Club in Buchanan & as it was full I came back to the Y.M.C.A. where I was given No 45 Bed in a room containing 3 Beds, on going into the Room No 45 was occupied by a Soldier & then was directed to No 44 & when I was comfortable, in came another Lad who claimed No 44, another Mix up, anyhow after a few minutes this Chap was given a Bed elsewhere & I was alright & soon was fast asleep, \n","5":" \n\nAfter a good Nights Sleep & a hearty Breakfast, I took a Tram & went out to Maryhill, Glasgow has a wonderful Tram service Cars running in all directions, & there are a lot of Girl Drivers also Girl Conductors & they look quite smart in \n\nGlasgow is on the River Clyde.\n\ntheir Uniform, Green Coats & Tartan Skirts & Caps & they are very nice to the Soldiers who travel at ½ rates. The Trams are Double Deckers. The Top portion is inclosed with Glass Windows & Doors except a portion at each end for Sightseers where one can sit & have a good view of the Scenery, the Trams have strips of colours to denote what direction they are going, such as Red, Green, Blue, Yellow & so on & they are all kept in a clean condition, after returning from Maryhill I continued out to Mt Florida both these runs were interesting through some wide streets & Residential Houses, nearly all the streets in Glasgow are wide & well laid out. Cement Footpaths & Small even cobble stones on the roads, there are a large number of beautiful large Buildings in the City & in Georges Square is the G.P.O & Municipal Buildings & in the front of these buildings are Lawns & Flowers with statue’s here & there making a beautiful picture. After a good Dinner I took another Car to Anniesland in another direction & got off the Car at the Gardens & had a good look. As it was a nice Afternoon & being Sunday there were \n\na large number of People promenading. These Gardens are laid out on the slope of a Hill & the Footpaths wind around & around & Trees growing on each side make a beautiful Avenue, a large number of Seats are provided here & there, & all the Flowers are growing in Hothouses, & at this time of the Year they are at their best some beautiful Specimens of Carnations & Ferns & Flowers of different Colours, at the Foot of the Hill is a small Creek & water running & on the other side is several more nice Walks, I spent a pleasant couple of hours wandering about amongst the Flowers & Trees & at 5 Pm caught a car back to Buchanan St for Tea, After a good Tea I met a chum from France & we both went along to church, to the Glasgow Cathedral, a beautiful Building & very nice inside, on approaching the Gate there were several people congregated together holding a Service, & on Passing through the Gate the Path to the Cathedral bears off to the left, & on the Right is a large number of Tomb stones the Grounds about fall & rise & on the High ground is a large number of very large statue’s, some magnificent \n\nones & beautifully carved & as the Sun was sinking the White Monuments showed up splendid along the Skyline. As we arrived inside the Service was just starting, while the Service was on I obtained a good view from where I was sitting, & it is a beautiful place & the Glass Windows of all colours & designs were nicely arranged, the Choir was situated up above at the back portion likewise the Organ, which was played beautiful & the Singing of the Choir was a treat to listen to especially one Lady who had a beautiful Soprana & a Gentlemen a Silver Tenor & the Lady sang Lead Kindly Light assisted by the Gentlemen, & it was beautifully rendered. The Sermon was preached by the Minister from \nthe\n Edinburgh Cathedral & his address was a treat to listen to & very interesting, after the Service was finished we went for a Tram Ride until 11 Pm & back again to the Club & had Supper.\n","6":"\n\nAfter Breakfast I went along to a Studio & had my Photo taken in Kilts, the Photographer supplied me with a Highland Light Infantry Costume & I was soon fixed up, it is a Novelty & a good Sovenier \n\nof my sojourn in Glasgow, after a stroll & making a few purchases of Soveniers to send out to Ausie I went back for Dinner & at 2.20 joined a Party of Boys for a trip to Cathcart. After a few minutes Tram ride we arrived at the Munition Works of C & J Weir & after a few minutes wait along came 3 guides & we formed up into 3 Parties & started on a Tour of Inspection, one large place was full of Girls working on Aeroplane Engines others were working the Lathes, others with the Hammer & Chisel chipping & so on, they appeared to be a happy lot & well dressed, wearing Blue Overalls over their clothes, needless to say the Boys received the Glad Eye everywhere & some of the boys was that interested in the Fair Maid’s that they dawdled along & the Guide got to far ahead of them & they wandered about on their own chatting here & there with the Fair Scotch Lasses, I was informed that there are about 5000 hands, a large percentage being Girls, I saw the Shells in their rough state & through different Machines to the Finished Article, after wandering about for 1 hour we took our Departure & as it was 4.30 Pm. I decided to \n\ntake a DalmuirTram out to see the Employee’s from Singer’s Aeroplane Factory coming from the Works but after waiting some time a Tram came along & it was after 5 Pm when I left the City but as it was a long way about 5 miles, the Tram did not reach the works until 6 Pm, & all the Employee’s had departed still from the Tram I obtained a Bon View of the Works, which are very large & cover a lot of ground & right behind the Works & on the Slope of a Hill are a large number of Houses where the Employee’s reside, I was told that there were about 25000 hands engaged in the Works & that there are 7 Trains waiting every Evening to take the Employees into Glasgow, \nIn passing the\n On the way to Dalmuir the Tram passes through the suburbs called Yoker, Clydebanck Partick & Scotstown, which are well populated & contains some very nice houses, I arrived back at the Club at 6.50 Pm & had Tea then I went out to a house of Amusement, where Mr Seymour Hicks was playing in a Musical Comedy called \n\nCash on Delivery in the Glasgow Ahlambra Theatre, & as the Stall Seats were all reserved I had to content myself with a seat in the Gallery, & had to wait in a crowd for my turn, once I got my Ticket I soon was inside after climbing a number of Stairs, the Ahlambra is a very fine Theatre & very Comfortable, the Seats in the Gallery were fairly soft & not like the ordinary run of Galleries as this place provided cushion chairs & as it was the second performance it was full up in no time. I enjoyed the Comedy very much some very pretty Costumes & splendid singing not forgetting the handsome young Ladies, Mr Seymour Hicks is a splendid Actor & received a splendid ovation, After the Play terminated at 10.15 Pm I went around to the Station into the Soldiers & Sailors Welcome Room & had a nice Supper & then returned to the Club & retired. \n","7":"\n\nI arose at 8 am & after Breakfast I fixed my Valice on my back & off I went to the Buchanan St Station & was soon aboard the \n\nTrain bound for Perth, Several nice Scotch People joined me & at 9.15 am, the Train started, & I had a very enjoyable ride passing through: a lot of Rocky Fern Country with beautiful Scenery in the distance, a number of large Brick Works were passed en route & Gardens which all had a large plot of Rhubarb growing also Raspberries, the High Hills with large Towns with the tall Smoke Stacks looked very nice, we passed through the districts of Larbert, Bannockburn & Stirling were we stayed 15\" & off again passing over the Allan River to Dumblane & after 1 hours run the Train steamed into Perth on time viz 11-40 am where I had a Cup of Tea & a Sandwich at the Welcome Barrow, after obtaining particulars of the whereabouts of the Soldiers & Sailors Home, I passed out of the Station & up over a Bridge & in a few minutes arrived at the Home where I booked a Bed for the night, & after a Brush Up, I took a Train, which are very old fashioned & quite a contrast to the Glasgow Trains \n\nThe first ride took one to a place called Scone which pronounced like Sconn, passing through some very nice homes built of Granite with small gardens in the Front, Scone is about 1 mile from the centre then came back to Cherrybank in another direction, which was also a nice little place, & then out to Dunkeld Road, then to Craigie & back again to the home as it was raining & fairly cold, After Tea I was directed to Moncreif’s Glass Works & on arrival I introduced myself & was piloted by one of the Employees over the Works, the first place entered was where several Men were Glass Blowing making Globes, taking out the Red Hot Substance on a hollow Tube & rolling & blowing through the Tube causing the Substance to mould into Shape, an interesting piece of Work, next was rounding off the rough edges of chemical Bottles by holding them in front of a Furness which was a white Heat & turning the Bottles around likewise Glass jars & placeing them on a Tray which went along through a Heated Oven & a cooling \n\nprocess, at the Glasses reaching the other end for the purpose of Tempering them to withstand any heat afterwards, I was also shewn the Engine & Test Guage Glasses being rolled & blewn into long strip’s & where they were cut into different lengths, also the department where Office Paste Ink & Glue was made & bottled also the Packing Room & Sample Room where Glass Bottles, Tube’s & Glasses of every description, altogether I spent an enjoyable hour inspecting the works, & after thanking my Pilot & seeing the Sand which was made into Glass, I returned to the Home & did some writing, As this Town is the same name as my own Town in Australia, naturally I was very much interested in it, as my Town was named after this place, No doubt this Town is a pretty place, not very large but nicely laid out & had the Weather been fine, I could have had a better chance of seeing more of it. The Trains are rather on the old style, & come no where near \n\nPerth is on the River Tay.\n\nthe Glasgow ones, these Trains have no covering on the Tops, although Electric & they run fairly smooth, there are boys as Conductors & Men as Drivers & their Uniform is not smart at all. \n","8":"\n\nAfter Breakfast I intended to go out to Dewar’s Whisky Distillery, but it was too wet raining nearly all the morning, & at 11.30 am, I fixed my Valice on my back & after thanking the Ladies of the Home & bidding them good bye I went back to the Station & had a hot Dinner in the Welcome Rooms & then took a seat in the Train & at 11.50 am off the Train started for Aberdeen, After an interesting run passing through beautiful hilly Country partially cultivated & \npartially\n containing \nSheep & Cattle\n Wheat & Vegetables of all descriptions other parts were stocked with Sheep & Cattle, & the Woods were very pretty with the Ivy growing up the large Trees & along the ground & Rocks, we passed through Stonehaven where I obtained the first view of the North Sea, \n\nwhere a large number of steamers could be seen passing both Ways, we kept the view of the Ocean for a long way & eventually arrived in Aberdeen on time 2.25 Pm, had a nice Luncheon at the \nThe\n Red Cross Free Luncheon Rooms, then asked a Scotch Lad to pilot me up the Brae (Hill) to the Aston Hotel which I intended to make my quarters, It was only a few minutes walk & I soon was at the Hotel & up four flight’s of stairs & introduced myself & registered my name & book a Bed, after a Wash & Brush Up I went out & had a shave & started on a Tour until Tea Time, The first Car I took was going out to the Bridge of Dee along Union Street which is the principal street in \nGlasgow\n Aberdeen, & then along Holburn St, for about 1½ Miles passing through some beautiful House’s built of Granite, of a Grey colour, as Aberdeen is Known as the Granite City, it is a beautiful Sight, as the Houses of 1 to 4 story’s are built back from the Footpaths \n\n& has nice Gardens which are now at their best, with Granite Walls in front, the Footpaths are made of square blocks of Granite & the Roads of Granite Blocks, which look well & always clean, Coming back from the Bridge of Dee I kept going through the City until I came to the Bridge of Don, likewise a beautiful ride, along High St, passing by a Cemetery with its Granite Tombstones, & fine Residence’s, on my Tour I noticed sign board’s announcing Land to Let or Fened which on making inquiries means, that the Owner will not sell the Land rightout but will lease it for building purposes for a long term on paying a Yearly Rental, On returning to the City I went back to the Hotel & had a nice Tea where I met a Pall who had just arrived from Inverness & after a chat we decided to go out & take a Tram to the Beach, & after a ride of about 1 mile we arrived at the Beach & had a promenade along the Sea Walk, Aberdeen has a splendid \n\nSea Beach & the Walk’s are laid out well, there are two Walk’s before you come to the Beach & as it was a nice & pleasant Evening, there were a large number of people promenading, & my Pall & myself soon met two nice Scotch Lasses for a chat & stroll, & we had a Bon time for a couple of hours, I must admit these Scotch Lasses are grand, they delight in showing the Australian’s around & pointing out the places of Interest & as the Evening’s are so long being quite light & hardly any darkness this month the Twilight is beautiful, these Lasses kept us company until 11 Pm when we returned by Tram & saw them home, making an appointment for the next Evening, we strolled about until midnight, as there were still a fair number about & we were not tired,\n","9":"\n\nAfter a good night’s sleep in a Bon Bed, we had Breakfast & went for a stroll about the streets, & buying some Post Card views of the City & posting them to Ausie, things appeared to be \n\nfairly good in the City, a large number shopping here & there, As Union Street is the Main Street it was crowded, & it is very wide & the Business Houses very high & being all built of Granite & standing well back & the Footpaths of Granite Blocks also the Road of Granite, it was a treat strolling about, After a good Dinner in the West End Café both of us passed the time until 2.30 Pm when we booked two Seats in the Picture Palace & went in to see a Picture Program, this Palace is beautifully finished inside, & fairly large when a picture is being shewn there are only Red Lights’ here & there which add to the beauty & along the Steps to the Row’s of Seats are Electric Lights’ at the side to show where each step is, the Seats are all very comfortable & lined with Red Plush & in front of each Seat is an Ash Tray, everything about is well up to date, & outside of the Main Entrance Hall is small Tables where light Refreshments are served by dainty Lasses in smart Uniform, we both remained inside until close on 5 Pm enjoying a splendid \n\nprogram, & then along we went to the Hotel for Tea & a Brush Up. Afterwards we met two nice young Ladies who took us for a Walk through the Aristocratic Part of Aberdeen where we saw some beautiful Mansion’s all built of Grey Granite & standing well back from the Footpaths & each place had beautiful Lawns & Flower Beds which were at their best, the Streets were very clean & long Avenue of Chestnut Trees were growing, a number had Small Red Flowers while others were Yellow. We all promenaded about enjoying the Scenery & also the Young Ladies Company until close on 11 Pm when we said Good Bye & both returned to our Hotel, well satisfied with another day’s enjoyment. \n","10":"\n\nAfter Breakfast, both of us paid a visit to the Fish Market where we saw an enormous quantity of Fish of all sizes, names, & still more was being unloaded from the Fishing Trawlers, along the Wharves alongside, We were both interested very much in the way the Scotch Girls handled the Fish, they are big girls & very strong & their arms are as big as any Man’s Arm & they wear High Gum Boots \n\nBlue Skirts & light Blue Blouses, of course it was necessary to have a chat with them & they were very interesting after spending over an hour inspecting the Markets we strolled around & met two Scotch Lassies from a Flour Mill near by, & they looked comical in the White Trousers & Coats & Caps & their Faces & Hair was quite white, they were a happy couple & were out for their Breakfast hour, which was from 9 to 10 am, these girls work from 6 am to 5.30 Pm having 1 hour off for Breakfast & one hour for Dinner, at 10 am we said good Bye & off we went up to the Town & along to the Marischal Colledge which is a Magnificient Building of Granite & very large, it is a Colledge for Medical Students & it has a Tower 250 ft high where we both climbed up to & had a splendid View of the City of Aberdeen, the Sky was very clear & the Sun Shining & we admired the Scenery although it was very Windy, coming down again we went up the street where I bought a few things for France & back again to the Café for Dinner, Afterwards \nI\n we both went upstairs to the Hotel where my Chum had a lay down \n \n\n& I packed my Valice as I was going away at 5 oclock for Edinburgh, I spent the Afternoon chatting with the Daughter of my Hostess who is a very charming Young Lady, well Educated & had Travelled a lot, therefore in exchanging views & experiences I spent an enjoyable Afternoon until 4.30 when I said Good Bye to my Chum who was remaining for a few days more, also \nmy\n the Hostess & her Daughter & thanking them for their Kindness during my stay, off I went to the Station & was soon aboard the Train & at 5.5 Pm. it steamed away on its journey, passing through Hillside which is the Junction of the Edinburgh & Glasgow lines, we were running quite close to the Sea for a long way & what surprised me was the splendid Soil right close up to the Sea, with Gardens & crops growing splendid, the Scenery along this line was still beautiful & very hilly in places, then we passed through Montrose another Fishing Town of a fair size, then through Arbroath, still hugging the Coast to Dundee, arriving there at 7.10 Pm & only stopped for 5\" minutes & off again \n\nto Cupar, a very pretty Town although Small & then Kircaldy & over the Firth of Fourth; before arriving at Cupar the Train passed over a long Bridge over the Firth of Tay where on the Left Side was the Old Training Ship \"Mars\". The Firth of Fourth Bridge is the most Celebrated Bridge in the World the two Central spans are 1710 feet each with side spans of 690 ft beside. The Plan adopted has been to erect three Gigantic skeleton towers of Steel Tubes, upon concrete foundations, these stretch out wings as cantilevers on both sides across the Water, the Wings not meeting, but being connected by 350 ft of iron girder between them, the Towers rise 360 ft above high Water. The Rails are 150 ft above high Water, the total length of Rails are 1 mile & a quarter. There are 55.000 tons of steel & iron in the Bridge which cost over three Million Stirling, At one time there were 5,000 Men employed and 56 Fatal Accidents occurred during the Construction, The Bridge was commenced in 1883 and opened by His Majesty the King at that time was Prince of Wales on March 4th 1890, \n\nA baronetcy was conferred on Sir John Fowler, the Engineer in Chief, and Sir Benjamin Baker, assistant Engineer & Sir William Arrol the Contractor, received their Kinghthoods on the same occasion, The Bridge over the Firth of Tay also has a History, On December the","11":" 1879. when the former Tay Bridge with a train passing over it, was hurled into the River by the force of the blast sweeping down the Tay, it was only opened in","12":" & cost nearly £400,000, the Present Bridge is 20 or 30 yds Westward of the old site, It is two miles long and is carried upon 73 \npeirs\n pairs of piers built in the River, with 77ft clear above high Water, it carries two lines of Rails and cost £650,000, it was opened for Traffic in 1888, the Stumps of the Old Bridge remains & can be seen beside the new one. After a very interesting journey of four hours we arrived in Edinburgh on time 9.5. Pm, & was piloted to Ramsay Lodge where I booked for the Night & had Supper & spent 1½ hours in the Saloon writing, \n\nSaturday 22nd June,\n\nAfter breakfast I stepped on the Cable Tram & went \n\nfor a nice ride to Liberton 2 mile away passing some very nice Houses en route, built of Stone & not near so nice as the Aberdeen Houses, back again I came through the Principal Street of Edinburgh, Princess Street, & out to Murrayfield another 2 miles away, on returning I left the Car which are very slow & a long way behind the times, at the top of Princess St & took a stroll along the Wide Footpaths, this Street is recognised as the finest street in the United Kingdom, one side is the business Premises & the other is Gardens, with Monuments here & there. Edinburgh is built on 7 hills & very hilly, but very picturesque, it has only one main Street Princess St & the Gardens slope down until it reaches the Railway Lines, the Gardens are nicely laid out & kept, & then the Ground rises again where a large number of Large Flats are built, The Old Edinburgh Castle built in 626 by Edwin as a Northumbrian Fortress, stands up very high & is very large, & is supposed to be the Oldest building in Edinburgh, This \nplace\n is a beautiful City & very large & has a population of about ½ a Million People.\n\nAs it was a cold Day & a strong Wind blowing, I spent the Afternoon in the Lodge writing my Diary up to date & after Tea writing home to Australia, At 8.30 Pm I obtained my Valice & made my way to the Waverley which is the Main Station to continue on my journey to London, In a few minutes I was on the station & went into the Soldiers Buffett & had a Cup of Tea & some Cake & as I had a few minutes to spare before the train was brought in, I had a stroll around the station which is very large, & had a large number of Platforms, I counted 18 but there may have been more, there were crowds of people moving about, going to different parts & seeing friends off, at 9.15 the Train pulled in & a Porter obtained a seat for me in a Corridor Carriage, & a very nice one at that, there is no mistake the Rolling Stock on these Main line Trains are beautiful, the 3rd Class has Cushion Seats & Backs & in my Carriage the Seats on one Side were arranged for 4 Persons, two on each side with a Table in the Centre & for 2 Persons, one on each side, & one can make themselves very comfortable, my Carriage in a few \n\nmoments was full of Soldiers going to different parts, & outside of the Platform was a Barrier where the Soldier’s friends stood to say Good Bye & of course it was lined with Scotch Lasses, at 9.30 the Guard blew his Whistle which was a Signal \nfrom the\n to start & the Crowds starting cheering & waving their Hankerchief’s & the boys in the Carriage returned the cheering, it was a grand sight & showed the grand feeling which existed between the People & Soldiers, as there were a large number of Over Seas Troops it clearly showed that during their Stay in Edinburgh they had received a splendid Welcome, Once away the train soon got up speed & soon was well out of sight of Edinburgh, the Engine was a very powerful one & heavy & it was necessary to haul the big load of 20 Carriages, after a non Stop run of 3 hours we arrived in Newcastle at 12.30 am, travelling alongside of the Sea all the Way from Edinburgh, after the Engines were changed, which gave us time to have a Cup of Tea & a Sandwich at the Barrow, & at 12-45 am off again to York arriving there at 2.40 am, where the Engines were changed again & in a few moments started again & the Train did \n\nnot Stop until Kings Cross station in London was reached at 7.30 am 15\" late, the Run from Edinburgh was very comfortable & the Scenery from both Sides was very interesting, the Train took 10 hours to do the distance of about 400 miles which was a 40 miles per hour average including stops, & at times we were going some, flying through stations that fast I could not read the names of them, I took the Tube Railway from King’s Cross to Waterloo where I went over to the Club, (Union Jack) where I had a Wash & Brush up & had Breakfast & booked my Bed for the Night, After a good Breakfast I walked over the Waterloo Bridge where I took a Tram which runs alongside of the Embankment & out to East Hill about 3 miles away, the Tram runs alongside of the Embankment & over Westminister Bridge & along the other Side of the River & through several streets to East Hill, & then it returns & I came back with it to London Bridge passing again over Westminister Bridge & along the Embankment to the Terminus, London Bridge where I left the Tram & inquired my way to Whitechapel where I wish to visit Petticoat Lane on a Sunday Morn \n\nafter a Walk of about 20 minutes I reached the famous spot & went down the main street, which is Middlesex St, which was crowded with people of all nationalities, the Jews there have their stalls on each side of the Street, & what a rabble & crowds, it was a case of follow the Crowd & be merry, there is such a mixture of Wares that one can buy anything from a needle to a Haystack, I walked down & was pleased to get back & away after satisfying my curiosty, I took the Tube back to Waterloo & had Dinner, then the Tube again to Hyde Park & as it was a glorius day there were a very large crowd promenading, I met an Ausie in the Tube & we kept together & had a grand time in Hyde Park, Visiting the Serpentine which is a large sheet of Water where pleasure Rowing Boats were in large numbers & largely patronised, we both then went along to hear the Band playing in the Pavilion, there is an enormous number of \nseats\n Chairs about were one has to pay 1d for hire up to Midnight & as long as one possesses a Ticket it is good for any Chair, these Chairs are very largely availed of & in good demand, we both passed the Afternoon listening to \n\nthe Splendid Music of the Band & promenading, accompanied by two nice young Ladies until 5 Pm when we left the Ladies & made for the Tube to Holburn & along to the Y.M.C.A. where we both had a very nice Tea & a Brush up for the Evening & decided to spend the Evening again in Hyde Park & off we went again at 7 Pm & coming out of the Tube we met two nice Girls & we soon were chums & paired off & into the Park & sat down on the Grass chatting for a couple of hours & then went for a Walk right across the Park & out on the other Side & through Marble Arch & along Oxford St to New Oxford St, for a long way & we all finally boarded a Tram at Tottencourt Rd for Harringay where our companions resided, it was a long ride in the car but very enjoyable & our companions were A.1. & interesting, On arrival at Brampton Road, my Lady Friend & myself said Good bye to the other Couple, who continued on & after a few minutes walk arrived at her home & after a minutes I said Good Bye & thanked the Young Lady for a very enjoyable Evening, & made my back for a car & as it was fairly late, I had to wait some time until one came along & in I got & was advised \n\nto catch a Tube to Waterloo from Cambden Hill, where I left the Car, but my luck was out as the last Train had left, I then had to wait for another Car which only took me to the Depot, which was half way, in this Car I met an Australian Captain also my Chum & we waited for a half an hour & along came the last Car to Tottencourt Court Road & in we got & in a little while arrived at the Terminus, where my Chum left me, & the Captain & myself had to walk along Oxford St & passed \nLiester\n Leicester Square then Trafalgar Square & around into the Strand, where I said Good Night to the Officer, & continued on & over the Waterloo Bridge & arrived at the Club at 1.30 am, where I turned in & was called at 5 am, & after Breakfast caught a Tube & soon was at Victoria where I had to report for France. There were a large number of Boys returning also several Drafts & at 7.30 we all were entrained, the first Trains lef at 7.50 containing Officers who travelled in Dining Cars, & at 8.10 am we were off & after a through run without a stop arrived at Folkstone at 10 am where we were marched\n\nto a Camp which consisted of several large Houses, where we were provided with a Hot Dinner & at 1-40 had to parade & march down to the Boat & soon was on board & had our Life Belts fixed in position & at 2.30 we were off for France, after having a most glorius fortnights Holiday in England & Scotland, meeting some very nice people & receiving the best of Hospitality everywhere I went. And I wish to place on record my Best Thanks to all the Ladies who voluntary assist & provide free Luncheons to us Boys from France & there is no doubt \nit\n that the generosity of these good Folk inspire us Colonials to return to France & give of our Best to Protect these good People & our Dear Old Flag, I especially desire to thank the Ladies, at Folkstone, Victoria, Euston, Preston, Glasgow, Perth Aberdeen, Edinburgh, Newcastle, York who waited on us & give us a hearty Welcome in these Soldiers Welcome Buffets, where I had the pleasure to visit, These Notes terminate my record of my first Furlough from France,\n","13":"\n\nAfter we were supplied with a Hot Dinner of Roast Beef & Potatoes & Bread Pudding at 12 noon we were ordered to parade at 1.40 Pm. & then we were marched away from the Rest Billet, which consisted of a number of large Houses faceing the Promenade surrounded by a High Barbed Wire fence, as soon as we were all on parade we marched away & in a few minutes arrived at the Boat, & in Single file went on board after handing a card with our Name Rank No. & Regiment, where we were handed a Life Belt which had to be adjusted on shoulders & chest, On looking around I soon found out that it was the same Boat that we all came over in from France & named Invictor, A Boat ahead of us contained Drafts for different Regiments & at 2-30 pulled away from the Wharf & we followed, & in a few moments we were well under way doing 22 knots an hour, with a Torpedo Destroyer on each side patrolling, & one in the lead, As the Sea was smooth & fine Weather we made a good trip & arrived at Bolougne at 4.30 Pm & after putting our Life Belts away, we marched in Single\n\nfile down the Gangway, handing a Card to an Officer on reaching the Wharf & away over a Canal Bridge where we were lined up into four deep & away up a Hill passing through several side streets, a number of French lads running alongside asking to be allowed to carry our kits for a half a Franc, I soon handed mine to a lad as it was fairly heavy, also a number of Women met us with bottles of French Beer at 1 franc each, as we had to climb a stiff hill we all were soon thirsty & the Beer was soon sold, another chap & myself soon finished our Bottle & in a few minutes arrived on top of the hill at the rest Camp,\non passing\n where we all were lined up & an Officer detailed us to fall in into different parties according to the directions we were going to travel by Train, as there were two Trains departing, we were soon formed into two Companies, our Coy was marched then away to several Huts where we were provided with two Meal Tickets for \nDinner\n Tea & Breakfast & a certain number for each Hut, as soon as we placed our Kits in the Huts we went out & along\n\na Path to the Mess Room & at the entrance we received a Plate & Mug & in handing our Tea Ticket to a N.C. Officer, each man received some Bread, Butter & Cold Meat, also Tea & away to the Tables & soon were busy having Tea. Afterwards we were allowed to wander about the Camp which had a High Barbed Wire Fence around so as we could not wander out & into the Town. At 6 Pm a Concert was held in a large room by the Camp Concert Party, which was soon crowded, there were three Ladies & three Gentlemen in the Party & a very pleasant hour & a half was spent as each item was received with applause, at 7.30 the National Anthem was sung & away we came, As I had been on the go from 5 am I was fairly tired & after having a Blanket handed to each of us I soon made myself comfortable on the floor & asleep, The Bugle rang out at 4 am","14":" & soon all hands were up & handed in our Blanket & after a Wash away for Breakfast repeating the same precudure as we did \n\nfor Tea & at 6 am we were ordered to fall in in fours & at 6.30 am away we went on a 3 mile tramp along a dusty road to the Railway Station Pont De Bricques were we arrived at 7.30 just about full up of tramping. At 8 am in came the Troop Train & soon was all aboard & at 8.10 am off we went passing through Outreau where we branched off on to the Marquise Calais line, passing through Thurin where a large number of German Prisoners were working in the Stone Quarries, then on to Marquise & arrived at Le Fontinettes, outside of Calais, where the first lot of Lads detrained after a 10 minutes wait, we left at 10.10 am & made a good run to Audruicque, then to the Watten at each place Lads got out & left Watten at 11.15 am & arrived at St Omer at 11.45 where I left the Train & after placing my Kit in my Sleeping Van & had Dinner I reported myself at the Orderly Room, also the Low Office where I was told to start learning the Lines from St Omer next morning, I then had a couple of hours sleep & had a Wash & Tea & went up the\n\nTown for a Stroll calling in at my favorite Estaminet & having a chat for a few moments & then along to a Variety Show which was real good & then back again for a couple of drinks & at 9 Pm back to the Depot & fixed my bed & turned in for the night.\n","15":" \n\nMy first run was from St Omer to Dunkirk via Boubourg & I was called at 5.45 am & after Breakfast I signed on at 6,40 & left by the 6.50 Train on the Engine & travelled along the Calai line as far as Watten the took a line at a Junction a little further away to the right, our first stop was on a Bridge over a Canal where we picked up a Women who work’s the Semaphore Signals & then on to Zeningham, which is a very busy place, a large Ammunition Dump is situated there, also a RE Park were a large quantity of Timber was stored & supplies of all sorts, also a Locomotive Depot & large Shunting Yards, after a few minutes stay, we were off again passing through St Pierre Brouck & shortly afterwards arrived at Boubourg which is a Junction\n\nfor Calais, Dunkirk & Watten, at 7-45 am where the Train terminated & I had to wait until 8.30 for the Calais Dunkirk Passenger Train, so after having a drink at an Estaminet & a chat with the R.T.O. Staff I left Boubourg on time passing through Loon Plage, Pettite Scynthe Goodekirk which is the Junction of the Calais & Hazebruick lines & passing through the Iron Gates which is known as the Ramparts, these Ramparts are a large Wall & Gates & are built around Dunkirk for Defence purposes, the Country between St Omer & Dunkirk is all under Cultivation & looks very pretty, the Peasants working everywhere & are very busy, there is plots of Wheat, Barley, Oats, Potatoes, Beans, Peas, Sugar Beet & lots of other Vegetables everywhere, a drop of Rain would be welcome as the ground is fairly dry & watering by hand is carried on everywhere. The Train arrived in Dunkirk at 9. am, I then showed my Pass & out into the Town, which is fairly busy, but nothing to what is was when I was last there, After passing over a Canal Bridge I walked up a narrow street\n\nfollowing the Train line through the Square & in a few moments arrived at the Salvation Army Hostel where I went in upstairs & obtained a Cup of Tea & having some Rations with me I had a light Meal, then I continued on passing over another Canal to the Australian Supply Depot, where I met some friends & was invited to come back at 12 for Dinner, after a stroll around the Docks I returned & had a Bon Dinner with the Boys, after a Smoke I thanked them & off I went, I was directed to follow the Train Line & soon I would be at Milo Les Sands which was a favorite Promenade along the Beach in Pre War Times, After walking some distance I arrived at the Ramparts where a Sentry demanded my Pass & then I was permitted to proceed & arrived at Milo Les Sands in a few minutes & found the Promenade & Beach almost deserted & in a very neglected condition, Nearly all the Beautiful Buildings are nearly all empty & closed up & the place is very desolate, As my Train for my return Journey did not leave until 5 Pm\n\nI spent a couple of hours laying down reading & had a doze & at 3.30 left the Beach & walked back to Town & into the S.A. Hostel to have a cup of Tea & some Scones, & off to the Station & into the Train which left on time going in a different direction to St Omer, passing through Goodekirk, Bergues, Esquelbec; Arneke, Cassell passing through still beautiful country where all hands were busy, all along the line for a long way there are Boxes, with Danger written on the Top, as this direction is getting closer to the German Line, there are Trenches dug everywhere for our Troops to fall back on, in case Fritz makes a big Push & the Boxes along the line are no doubt filled with Explosives to blow up the Rails as we retreat, After leaving Cassell the line junction’s off to the Right & soon mets the Main line at Wallen Cappell which is the Old Main line to Hazebruick. After leaving the last place we passed through Eblingham Renescure, Milo Junction & at 7.5 Pm arrived back at St Omer, where I went out & had a Drink & back for my Hot Dinner & a rest & at 10 Pm turned in for the night.\n","16":"\n Thursday & Friday, I again journeyed to Dunkirk, Thursday I did not wander about but stayed in the Hostel reading, Friday after Lunch I took a Train out past Milo Le Sands to the Terminus about 7 Kilos away & went over to the Beach which was also deserted & very desolate, I stayed there for an hour & then returned to the Station & back again to St. Omer.\n","17":" \n\nBeing my last day learning the Road to Dunkirk I decided on arrival at Dunkirk to return at 10 am via Boubourg & Gravelines, & at that hour departed & at ","18":" am\n 11.40 am arrived at Calais. I met a chum from Audruicq who was likewise learning the roads & we went for a stroll, first into the Church Army Hut for something to eat & then up through Old Calais, where we aboarded a Tram for a ride to Les Fontinettes & back, then for a stroll again up the Streets & off at 2.30 Pm for St Omer via Les Fontinettes, Audruicq & Watten, my chum left me at Audruicq & at 4 Pm I arrived\n\nat St Omer, & signed off & after Tea I went up the Street to the New Theatre to see a Variety Show which as \nfair\n good & the Theatre was fairly crowded & the Artists received a good reception, after a Drink at the Estam I returned to the Depot, & turned in,\n","19":" \n\nI did not go over any Roads as I received permission from a Officer for a day in Camp so after Breakfast I went over to the A.V.C. Barracks & had a Hot Shower Bath which was Bon & then into the Estaminet for a Drink, where the Madam invited me to come back at 1 Pm & have Dinner with the Family which I accepted & returned to the Depot to have a Shave & Brush up & at 1 Pm duly arrived at the Estaminet where a splendid Dinner was provided for me consisting of Soup, Roast Beef Peas & Potatoes, a Glass of Ale, Wine & then Rum & Coffee, & I did not enjoy it, not half, After a smoke & a chat & thanked Madam for her Hospitality, I went for a Promenade through the Town to the Park where I expected a Band would be playing but was dissapointed, anyhow I was not there long when\n\nalong came a Young Lady & a little Girl from the Estaminet & I joined them & we all went back to the Cinema in Rue De Arras, having obtained our Tickets we all went inside & obtained a seat each, the house was almost full, with Civilians, also a large number of Chinese & a fair sprinkling of Soldiers, a good program was provided & a good Music from the Piano, the Pictures started at 4 Pm & we finished at 5.30, starting again at 6 Pm for a second time. When we came outside a large crowd was waiting to go in for the second performance, I continued promenading with my friends & went out to the Young Lady’s Home where I was introduced to her People who received me very well. We did not remain there long & soon returned to the Estaminet at 7 Pm where I had some Tea with them & at 9 Pm returned to the Depot,\n","20":" \n\nI journeyed to Dunkirk for the last time & on Tuesday signed on at 9 am to learn the Road to Bolougne, travelling on the Passenger Train,\n\nVia Arques, & over the Ranges through Devores & Samer. This was the best road of the lot for sight seeing. We made a good run to Lumbres passing through Arques, Blendeques, Wizernes to Lumbres over fairly level Country but after passing Lumbres one begins to climb the Hills up through Neilles to Lottingham, the Line winds around a number of Hills & away down in the Valley & up over other hilly country the Panorama View was magnificient, everywhere as far as the eye could see was land under cultivation, beautiful crops of Waving Corn glittering in the Sunlight, Plots of all kinds of vegetables & here & there could be seen Dark moving objects being Peasants busy in the fields, it is marvellous the amount of ground these people manage to attend to with their old fashioned implements of Agriculture, here & there could be seen Old Men cutting Oats & women following them up stacking them & so on, We still continued to climb until Deveres was reached which is the top of the Hills & then we started to go down hill passing through Samer where\n\na large number of Baskets of Strawberries we put into the Van for Bolougne, Off again down hill we soon arrived as Hesdigneul which is a Junction of the Abbeville, Bolougne & Lumbres Deveres, line, it is a very busy place & in one day a very large number of Trains pass to & fro, having made a good run we arrived in Bolougne at 1.15 Pm, after leaving the Train I went outside & had a Drink then away for a stroll until 4.15 Pm, as one passes over a Bridge over the Canal the M. Police requires to examine all Passes, after my was examined I continued on through the Streets, this Place is very busy & large crowds of Civilians, Soldiers & W.A.A.C. Girls were walking about everywhere. The Trams running to & fro were always full, I followed a Tram line until I came to the Beach & as it was a glorius day there were a large number of People promenading the Beach & Bathing, just near the Beach is a large convalescent Soldiers Home & they were all dressed in Blue Suits of a good cut & they all looked quite \n\nsmart, the W.A.A.C. Girls have two small Tents to dress in & they made good use of them as a large number went in Bathing. The Boys all hired a Bathing Box, I had a rest on the Beach & at 3.30 I had to return just as the Crowds were beginning to arrive & the Fun starting, After a walk of 25 minutes I arrived back at the Station & after a Cup of Tea & some sandwiches I boarded the Train & away we went on time, & after a good run arrived in St Omer at 8.5 Pm after a most enjoyable & interesting Day’s Outing, I continued my run to Bolougne on July 2.3.4, On arriving in Bolougne on","21":" the Place was decorated with Flags of all colours & Sizes This day is a great day in America & of course it was recognised in Bolougne as a large number of American Soldiers were granted leave for the day the Town was full of them & they made the best of their time enjoying themselves, all the Shipping in the Docks & the Shops & Houses were all decorated with Flags of course the Stars & Stripes predominated everywhere, it was a \n\ngrand Sight, The Beach & Trams were crowded with Sammies as the Americans are called here. I had a long chat with one on the Beach until my time came to return & home again I came. Friday & Saturday finished my run to Bolougne & on","22":" I stayed home & had my Hot Bath as usual & after Dinner up to the Park, where I again met my Lady friends & Promenaded with them, & returned to the Estaminet & had Tea & spent the Evening until 9 Pm with them & when the Estam closed I went with Madam out to a village called Clairmair where they seek refuge from Bombs & Shells, with her two children & was met by two other Girls & we all walked together to the house where I found two other Soldiers waiting. We soon was all well at home having Supper & afterwards a Sing Song, us Boys would sing a Song in English & the Women would sing one in French, this was kept up unto close on Midnight when we said Good Night (Bon Nuit) & returned to St Omer to our quarters, after a very \n\npleasant Day.\n","23":" According to an arrangement with the Madam of the Estaminet I promised her I would visit Dunkirk on Monday & walk out to the Cemetery & take some Flowers & place them on her late Husband’s Grave there, This late Gentleman was like myself an Engine Driver employed on the Nord Railways & while he was on his Engine in Goodekirk a Bomb from a German Aeroplane burst quite close to his Engine & killed his Fireman & seriously wounded the Driver, unfortunately he died before his Wife could see him & he & his mate were buried in the Cemetery Dunkirk, on arrival at the Cemetery I went to the Caretaker’s house where I met a young Lady & she soon was looking up the No & name & in a few moments showed me the Grave which was in good order & had some flowers growing around it as a Border. I plucked some Pansies & brought them back for the madam & little Girl, who thanked me very much, On","24":" I started to learn \n\nthe Road between St Omer & Berguette. I caught the Passenger leaving here at 8.35 & passed through Arques & then the line branches away to the left towards the Fireing line, passing through Wardreques, Aire, Icebergs & then into Berguette, as one leaves Wardresques behind, one soon notices a difference, the Civil Population is less & more Empty houses, a large number of Trenches are made & others in course of making by the Chinese Labour Coy, also post’s & Barb Wire in front of the Trenches This is all necessary in case the German’s make a big attack any tine, as the Train approaches Berguette, the large Iron Works on your left look very desolate, & some of the Works have been hit by Shells & Bombs, These works are closed & all the Civil Population of the Town has departed for other parts except a few people with their Estaminets, the Town itself is deserted & several houses have been hit & knocked about, & shell holes are here & there, all the Windows are broken also all glass\n\ndoors & skylights on the Station & Signal Boxes have been Smashed, there is very little doing there all the Traffic passes through to other parts, As the Passenger Train continued on to Colone I left it at Berguette & after a wait of about 1 hour I caught a Light Engine & returned to St Omer in time for Dinner. I must not forget to mention that all the way to Berguette the land is under cultivation the same as other parts & worked by somebody. \n","25":" & Thursday 10 & 11. \n\nI went the same way & came back on light Engines, on","26":" the engine was a French one driven by a Frenchman & a very large Engine at that, having four steamchests & Cylinders. The Cab where the men work is very large & the parts are strong, being in different positions to our Engines, & the Fireman uses a lot of Water on the Coal & as it is very fine Coal he makes it into a paste & with a long handle shovel puts it into the Fire in lumps, & now & again in goes a Pricker & he draws it through the fire several times,\n\n& it is wonderful how they keep up the Pressure by this method, the pressure hardly varied 20 lbs all the time I was on the Engine. After an hours run on this Engine I arrived back at St Omer in time for Dinner & spent the afternoon writing & tomorrow I have to go out again to Bourbourg.\n","27":" &","28":" 13th. \n\nI left by the 6.53am for Bourbourg arriving there at 7.45am & had to wait until 10.40 am for a Train to Calais so as I could get back through to St Omer in time for Tea as the Train I left St Omer by did not return until 7.30 Pm, at the same time I had the chance to learn the Road from Bourbourg through Gravelines to Calais in case at any time it was necessary for me to take a Train \nVia\n from Calais to Dunkirk through Gravelines, there is nothing important along this Road as it is almost level all the way only the Junction at Bourbourg at one end & Les Fontinettes at the other, each day I arrived at Calai at 11.40 am & after a visit to the Church Army Hut for a \n\nCup of Tea & had my rations & then a quiet stroll until 2.40 Pm when the Train left for St Omer via Les Fontinettes & Audruicq arriving at St Omer at 4.15 Pm when I signed off for the Day.\n","29":" \n\nI obtained permission for a day at home, so after Breakfast I did some Washing & then went out to the A.V.C. Barracks for a Hot Shower Bath & then into the Estaminet for a Drink & a chat for an hour, I was invited by my Lady Friend if it was fine to promenade with her & the Children after Dinner to Clairmaire where they intended visiting friends, but it came on to Rain just after Dinner so I did not venture out but spent the Afternoon Reading & Writing until after Tea when I went for a Stroll with a chum up the Town & into the Park for a while returning later on down past the Building which was used a No.10 Stationary Hospital which was Bombed some few weeks back, This Building is very large & is 5 storey high & were the Bomb or\n\nAerial Torpedo had struck the Building it made a very large hole, as the Two Top Floors had not been wrecked the Torpedo must have come down on a slant forced its way through the 3rd Floor & exploded in the Basement blowing up everything, Icould see the remains of Bent up Beds & clothes mixed up with the Stones & Bricks & the Staircase all twisted up. This Building is not used now as a Hospital & is empty, after a couple of Drinks at the Estam I returned to Camp & turned in. \n","30":" \n\nI started to learn the Road to Calais, signing on at 9 am I had to wait until 11 am for the first Train, which is called the French Permission Train which leaves Calais at 5.35 am for Dunkirk via Gravelines & Bourbourg returning from Dunkirk via Bergues, Cassell & Eblingham & St Omer to Calais, After the Train left St Omer it made a good run to Calais only making one stop at Pont De Ardres arrival at it destination at 12 noon, between Pont De Cologne & Les Fontinettes is a big Material \n\nyard where a large number of German Prisoners were working unloading & stacking Timber under the direction of their N.C.O’s, they all seemed a happy lot & in good health & condition, of course these prisoners were all under an Armed Guard, After I left the Train at Calais, I again went along for a Cup of Tea & had my lunch & a stroll & back again to the Station & left at 2.40 Pm for St Omer arriving there at 4.15 Pm.\n","31":"\n\nThis day I caught a Light Engine returning to Les Fontinettes Depot & after a good run arrived at the Depot just before 11 am & after a chat with some of our Fitters who were stationed there putting the Rods on New Engines just over from England. These Engines are known as W.D. meaning War Department & They are a fine lot weighing 123 Tons when ready for the Road. They are 8 wheel Coupled with Outside Cylinders & Stephenson’s Link Motion They are no doubt a very fine Engine & well up to date, having the Westinghouse & Steam Brake,\n\nAfter a Chat for an half an hour I left & took a walk through the Shunting Yards, through Les Fontinettes & followed the main line right around to Calais Ville so as to get a good insight to all the Signals & points enroute, then back home again at the usual time. I continued going backwards & forwards until","32":" when on Saturday I broke my journey at Audruicq & paid by chum a visit & had Dinner with him & spent the Afternoon visiting friends in the Camp & after Tea my chum took me for a stroll out to visit some French People about 1½ miles away, after a chat with his friends we went along a Canal to the Locks where a large number of Barges were being brought down containing Wounded Horses, at these locks the Barges are lowerd down about 4 ft, before the Gates of the lock are opened a slide at the bottom is drawn up & the Water rushes in & fills the Basin up to the level of the Water behind & then the Gates are opened & in goes a Barge drawn by two Horses when the Gates are closed \n& are opened at the other\n\nend by lifting up the slide\n, by lifting up the slides at the other end the Water is lowerd also the Barge about 4 ft when the Gates are opened & the Water coming in behind takes the Barge away out & on its journey, this operation was carried on for a long while as there were several Barges to go through, at about 7.30 Pm we started on our return journey & a Motor Car containing our O.C. came along & gave us a lift back to Camp, when I received a large Bag containing Parcels & Letters for \nour\n my comrades at St Omer & off over to the Railway & caught a Train straight away & soon was back at Camp & delivered the Letters & Parcels to the Boys, as this Trip completed my learning of Roads, I started work on the Engine on Sunday at 10 am on a Banking job & had to work 12 hours until 10 Pm. \n","33":" \n\nI signed on at 1.30 Pm & had to go along to Watten to shunt for 3 hours returning & signing off at 7 Pm.\n","34":" \n\nAfter Breakfast the Orderly Corporal came along to our Vans & instructed us to pack our kits & have \n\neverything in readiness as the Vans would be going down to the new Camp at Malhove about 1 mile away after Dinner, so all hands set to & packed up & at 3 Pm the Vans were pulled out & away to the new camp, so it is good Bye to St Omer, as well will only be able to go in now & again, We had a fairly wet day & the ground around the Camp was very wet & sticky, as soon as we arrived all hands set to to take their Bunks & Kits out & after obtaining the name of the Hut & number of Space inside, we soon had our bunks & kits in position, This Camp is going to be a fine Camp when finished, the Huts are built in two Rows & are numbered from A. to Z, each hut has space for 54 Men, 27 on each side, the space for each man is about 3 ft 6 inches, One Hut is the Dining Room which has a large number of Tables & Forms so one can have a meal in comfort, A large number of Men are engaged in laying down Ashes for a Footpath, others are busy fixing up the Washing\n\nTables as at present we have to go out to the lake behind the Huts to wash ourselves. Shortly there will be Hot & Cold Water provided to Wash our Clothes & Face & hands & then the Hot Baths will be fixed up so in a few Weeks everything will be A.1. the same as the staff was at Borre before the Evacuation took place last April, there must be between 800 to 1000 Men in this Camp & later on all the Engines will be stabled down here, as at present it is necessary to have to proceed to St Omer for the Engines, but that wont be for long. I have be lucky to be off duty all yesterday & up to Dinner time today Wednesday, so will report myself this Evening if not called on before, as it is necessary after being off duty 48 hours. All day Thursday I was off duty, not being required until","35":" when I was notified at 6.30 am for duty at 8 am at St Omer, where I was told off with another Driver to work the Turntable, as every Engine before being stabled has to be run on the Table\n\nto be turned into the road where it is stabled, I carried on until after Lunch when an Engine which had been turned was ready to move off, I was putting the lever over to lock & steady the Table & before I could secure the lever the Engine moved & the Lever flew back & I had the misfortune to be in the way & the lever hit me on the Forehead above the left eye, making a nasty wound & causing the Blood to flow freely, which no doubt accounted for me not being knocked unconscious, as I felt very dazed a corporal came to my assistance & helped me over to the First Aid Post at the Station where \nmy\n a Pad was placed on the Wound & bandaged up & I came back to the Camp & visited the Camp Hospital where the Medical Officer, put two Stiches in the wound & I had to rest in Camp, for a Week, & report myself to the M.O. every morning at 9 am, where the wound was bathed & examined & rebandaged again, I spent the week lying down Reading & Writing & of an Evening playing Cards or Draughts until 9.30 Pm sometimes I would dress & promenade into St Omer for exercise, \n","36":" &","37":" &","38":" after lights\n\nOut were blown & it being a fine Night Fritz paid us a visit with his Bombing Machine, The first Night he came over he was picked up by the Searchlights 11 in all & then the fun would start, the Machine Guns & Anti Air Craft Guns would ring out & a heavy Barage would be put up, anyhow Fritz was turned off before he reached the Camp & only dropped one Bomb some distance off, he was soon lost in the Dark but we could hear him prowling over St Omer & eventually he was picked up again by the lights & this time he was making straight for our Camp & what excitement there was for a moment as all hands watched him approach, anyhow he did not drop any bombs as he passed over to our relief but the Bullets & pieces from our Guns were falling all around us on the Huts, so after a little while he had dissapeared back to his lines & we were not disturbed any more that night. Last night Thursday he came over & repeated the same performance flying over the Camp amidst a hail of Bullets & Shells, some of the shells seemed to explode right on top of him but still he kept going & dropped no Bombs, there were also other Machines prowling about away in the Distant & we could hear\n\nthe Explosions from his Bombs several times, he was coming & going until Midnight when they all returned to their own lines & the Camp was not disturbed any more all night. I got a shock one time last night, as he was being fired at over head I was talking to a chum outside when a Bullet whizzed down close to me, about 3 or 4 ft away with a hiss, I did not half duck & crouched in against the Hut for Cover my chum likewise, One has to be careful because the stuff falls everywhere, anyhow no harm was done & all turned in.\n \n","39":" \n\nAfter 10 days laying off with the Wound on my Forehead & the Dr. removed the two stitches, I was reported fit for duty on","40":" & started work \non\n the next day Tuesday on a stand by job which is to prepare an Engine & remain on her for 8 hours ready for any emergency run, I continued on this work all the week until Saturday Afternoon when I received orders to work a Train of Empty Trucks from St Momolon to Lillers, St Momolon lies on a new Branch line between St Omer & Watten, this line is being extended on to Esquelbecq near Bergues on\n\nthe old Dunkirk & Hazebruick line, so after running out light Engine I arrived at St Momolon where I had to wait the arrival of my Train which did not come along for 2 hours, then after being coupled on I received the right away & off we started with 54 Empty Trucks, my Engine being No 2715 a Midland Railway Engine from England, she \nhaving\n being an 0.6.0 coupled which means 3 Wheels 5 ft high on each side & no front or back bogie Wheels & a Tender, after a short run I arrived back at St Omer & took Water & off again passing through Arques where I had to give my Engine a good run to haul my Train over the Bank to Wardreques & continued on to Berguette where this line connects with the old Main line Hazebruick Bethune, where I arrived at 8.30 Pm & after a few minutes delay I was off again & arrived at Lillers at 9 Pm & after taking water I was told my Train was extended on to Fouquereuill close to Bethune & only a few miles from the Fireing line, all the way from Berguette the Railway line runs every close to the\n\nFireing line & at times it is heavilly shelled by Fritz Large shell holes being observed on both sides of the line, still the Civilians on the Land take no notice & are working in the fields harvesting their Crops of Wheat & Oats etc, of course all the Towns are empty & in some cases are badly knocked about, also the station buildings are down, the Goods shed at Lillers of Bricks & Mortor is level with the ground, a heavy shell struck it, after a short run I arrived at Fouquereuil passing the Observation Balloons on the way which means that we were about 5 miles from the line, after my French Guard had a word with the Officer in charge of the Station, I was directed to continue on to a branch line to Bruay about 3 miles away, with a French Pilot, as I did not know the Road, so in a few minutes we were off again & eventually arrived at my destination at 9.30 Pm where I left my \nEng\n Train & started to return, as it was dark & a clear night, Fritz was expected over Bombing at any moment. we had not proceeded far when the Search lights came out & all lights in Camps were put out, then the \n \n\nexcitement started, there were 11 lights up looking for Fritz & in a few moments he was picked up flying very low & he dropped a large light attached to a parachuete which lit up all around like day, my French Guard & Pilot was very excited & tried to hurry me up because Fritz was close over head & it was a very large Machine & looked beautiful in the Search lights, like a large silver Bird gliding along, I expected every moment a Bomb to be dropped on me & kept going until I came to a stop Signal & had to pull up while the Pilot went ahead to the Junction, in the meantime Fritz was dropping his load some distance away & what a crash & a flare up as each Bomb exploded shaking the ground everywhere, my Mate & myself stopped on the Engine in the Coal Bunker & took our chance. we counted eleven explosions all in a space of a few seconds, After he had finished Bombing he cleared off, all the time being fired on by Anti Air Craft Guns & Machine guns. The shells were bursting all around him, & his Machine must have had a number of Bullet holes in it. As soon as the Signal was pulled off, I again\n\ncontinued on, but had not got far when another Fritz came over, also dropping a light, on coming to the next stop which was against me I stopped & the French Guard noticed a Dug Out near the Signal in the Cutting & we all scampered into it, when Fritz started unloading all around us, making the Dug Out tremble with the Explosions, it is an awful sensations, you can hear the Bombs & Torpedo’s coming down with a hiss & then a loud report, one does not know where the next one will fall, & we have to take our chance like the rest of the Boys about. After this Machine had cleared out after a pummelling & I received the signal & soon was off again, but only got as far as Chocques when another Machine came over & \nI\n we had to wait for the Signal, the Guard soon cleared out & my Mate & myself this time remained on the Engine as we could see Fritz in the light & he was away from us, Bombing, after receiving the Signal to proceed the Guard would not come any further with me he was very nervous & shaking like a leaf.\n\nin a few minutes we were off again to Lillers & on to Berguette, & away from the hot part & we were not sorry as we had enough of Bombing for one night. I made a good run home to St Omer arriving there at 2 am in the morning & after stabling my Engine I signed off & returned to Camp & turned in, after a nights’ Experience which I will not forget for a time.\n","41":" \n\nAfter a spell of a few weeks I now start on a few more notes in my Diary, Since I last wrote I have been working on Local Runs, Banking Trains & Standing by in case of a Breakdown & Shunting in the Yard, while I was occupied at this work, it was only to kill time until some more new Engines were ready for our Depot, So on","42":" my Mate & myself with 5 other Drivers & Fireman were told off at 10 Pm to proceed to Audruicq the Main R.O.D Depot where locomotives after their arrival from England are made ready for their work. After we all had to proceeded to St Omer Station\n\nwe caught a Train for Audruicq & after one hour run arrived & reported ourselves & each Driver was told off to an Engine, No. 840 was mine & off we went to look for them, they were all coupled up together Oiled & ready to leave, These Engines are from America, made by the Baldwin Locomotive Works & are Six wheel coupled with a Bogie in front, they have the Superheated principle & the Westinghouse Brake, Rocker Bars & a Dump plate to clean the fire quickly also two drop doors at the bottom of the Ash Pan, they are a very high Engine the Driver & Fireman are about 9 ft from the ground & the Driver is on the left side which is Bon for seeing Signals as the are all on the left hand side of the running line. The Engine & Tender complete for the road were about 100 Tons, after all the Tools were checked & signed for we all moved off at for St Omer & in 40 minutes arrived at St Omer\n\nwhere more coal was put on the Tender & then we all continued on to \nthe\n our Main Depot at Malhove, signing off at 6 am, After Breakfast I turned in for a sleep & still being off duty after Tea I went into St Omer for a walk returning before lights out was sounded at 10 Pm.\n","43":" \n\nI was notified for duty at 11 am to take a Train from Lumbres to Bolougne, leaving here at 12.30 Light Engine, As it was my new Engine’s first trip I was extra cautious, After a 40 minutes run I arrived at Lumbres & as my Train had not arrived I was utilised for some Shunting for 2 hours & at 4.30 my Train arrived & I was coupled on to it & at 5 Pm with an Engine assisting me at the rear we left on our journey, I soon was satisfied that I had a good Machine, as the road from Lumbres up to Lottingham about 9 miles is very steep my machine went splendid, my Train consisted of between 50 & 60 Empty Supply\n\nWagons, she Steamed well also pulled & soon we reached the top & down hill we went passing several Stations & eventually arrived at Hesdignel & after a delay of about 1 hour, we continued on & into Bolougne arriving there at 8.30 & after stowing our Train went into the Outreau Depot & signed off at 9.30, As the hut I had previously occupied had been pulled down we all had to sleep in a Bell Tent, as I had 2 Blankets & a Waterproof Sheet & a big sack I was OK for the night. After obtaining a drink of Tea I had some Supper & turned in sleeping very sound & warm on the ground until 9 am","44":" As I was not required for my return trip until 7.30 Pm I had a good rest all day & after obtaining my rations with a chit, which is handed to us, as we had 24 hours rations consisting of ½ loaf of Bread some Fresh Cooked Meat, Bacon, some Butter & Jam & after being away for 24 hours we \n\nobtain a chit for each Meal & going on rations I had Dinner & Tea at the Depot & my return trip rations was for 12 hours consisting of Bread & cheese & a Dixie of Tea, when I signed on I was told that I was to bank a Train to Chocques near Bethune via Hesdignel & Lumbres, as far as Wardresque, At 9.15 I was coupled on the rear of the Train of 700 Tons, consisting of Supplies of all sorts & at 9.30, we were ready & off on our return journey, my Engine did her work splendid up the Bank, running very cool on all her bearings, & down the Bank & along to Wardresque arriving there at 1 am were I was uncoupled & came back to St Omer, & eventually into Malhove being well satisfied with my new Engine, signing off at 3 am Sunda, being off duty all day. Monday & Tuesday I worked on two local Shunting jobs &","45":" was notified to sign on at 5 Pm to work a Train of Supplies to Hirson via Lillers\n\nbologne\n Colon & Bruay, Hirson is on a Branch line to Leus & Hirson is about 8 miles from Leus, After receiving 24 hours rations & preparing my engine I proceeded to St Omer & was coupled on to my Train which was 48 in length & weighed 750 Tons, being Railway Material & Supplies, I left at 6.30 & informing the Railway Transport Officer if I get a clear run through Arques I would not require a Banker for Arques Bank which was soon arranged, & off I went, & as all signals through Arques were off, I set sail & up the Bank my Engine going well & handling her load splendid & I had no trouble at all & soon was over & away towards Berguette, were I had to put some trucks off & pick up some & along to Lillers, doing the same, & after taking Water there I left the Main line & on to where I had a C.O.D. Engine to bank me to Colon. As I did not know the road from Lillers to Hirson I received an English Pilot Driver.\n\nAfter leaving Baubuerre the road is very heavy all the way to Bruay, I made a good run to Colon where the Branch line rejoins the Main line from St Pol to Chocques, my R.O.D. banker left me at Colon & a French Engine took its’ place, & off we went again, as it was very dark I had to go along cautiously still climbing, we left the main line at & turned on to a Single line towards Houdain & on to Bruay, the line from Houdain to Bruay being very heavy, especially coming into Bruay Station, I was stopped half way into the Station by the Signal Man were my French Bank Engine left me & in a few moments was called ahead, but it was impossible to lift the load, & the French Men could not understand me & me them, so we all were in a quandery, anyhow as we had 15 trucks off for Bruay, they were uncoupled & put in the Siding. Then I lifted my load & after a good delay, off again we went \nnode\n now\n\ndown hill to Barliu where another long delay took place, as I had then been on duty some 14 hours I was getting tired & during these delays I had a good sleep, leaving Barliu I soon arrived at Hirson close on 8 am where I had to shunt & place my train for unloading & then started to prepare for my return journey leaving there attatched to another Engine at 10 am. we made a splendid run through Barliu, Bruay passing in each place large numbers of Trucks of Coal waiting to be lifted, there are a large number of Coal Mines round about & the Country being very hilly & all under cultivation dotted here & there with small clumps of Trees, & with the large number of large Chimneys & rows of Houses with their tile roofs all assisted to make a beautiful picture, & a lovely panoramic view, there is no mistake the \ncountry in\n France is a beautiful Country & very charming to the Eye. I continued on after Leaving the other\n\nEngine at Colon & duly arrived home at the Depot singing off at 5 Pm being exactly on duty 24 hours, & feeling fairly well considering, & after a good wash & a hot Dinner I turned in at 7 Pm & slept very sound until 7 am next Morning","46":" & after Breakfast I obtained a Pass from 10 am until 12 noon & went into St Omer to do some shopping returning well to time & was notified to sign on at 3 Pm to work a Train from Blaringham near Berguette to Calais, after preparing my Engine I was altered to leave from St Omer instead of Blaringham at 7.30 Pm so after standing by until 7 Pm I left the Depot & soon was on my Train of 30 Empty vehicles & left at 7.30, stopping at Watten enroute to pick up about 30 more Empties & off again passing through Audruicq. As it was my first trip with an Engine & Train since I learnt the road in July last, & fairly dark I proceeded along very carefully. After leaving\n\nWatten I passed a Bifur Board which indicates a Junction ahead & which is a Triangle to a Branch line, I received the first all clear signal & crept on to the next, I could not see it for a while as it was very dim & all of a sudden I found it & applied my Brake but could not stop in time & ran past it an Engine length exploding the Detonator which is placed on the line & is removed by the signal coming off, anyhow the French Signal Man was more anxious for some Coal than the Detonator & I soon satisfied him & off again & did not stop until I was received a Red light at a Semaphore Signal outside of Vendreu Marshalling yard where it was decided where my train was to terminate as between Vendru there are several yards & Calais, after a few minutes stop I was shunted into Vendru Yard & left my train & ran Light Engine past Station & into the Loco Depot, from Vendru \n\nwas more so as there were Signals of all colours ahead, after I left the Main my Guard who was on the Engine who knew the roads & whistles directed me & I just crawled along not knowing in the Dark where I was, all I could see was stop Signals here & there & Trains & Engines moving about, after a few moments I found myself on the Main line \nlane\n to Bolougne, & passing another Signal I was turned onto the Loco Triangle so as to be able to turn my Engine, & soon was turned & arrived at the Column for Water, where I received instructions to leave at 2. am it being then 11 Pm so I had 3 hours stand by & after obtaining a Dixie of Tea I cooked some Bacon & had some supper & waited for 1.30 am where my Guard piloted me out of the Depot & into the Marshalling Yard on to my Train of 750 Tons & at 2.5 I was ready to start, but could not make out where & what direction I was going anyhow after giving several whistles\n\n& going steady all of a sudden I found my self out again on to the Main line & was not sorry as I had a very anxious time in & out of this Depot, after making a good run, receiving all clear Signals everywhere I arrived back at St Omer at 3.30 am where I was relieved also my Mate & Guard & a new crew took the Engine over & worked the Train on to Hazebruick & I signed off at 4 am.\n","47":" \n\nI worked a shift on the Shunter at St Omer starting at 9.30 & my Engine was relieved at 7 am after an easy night’s work having a spell from 1 am to 5, I brought my Engine into the Depot, & had to wait my turn for Coal & Water, I was kept waiting in my turn a long while, as they were very busy & after grumbling to the Shed Foreman as I was tired & hungry, he told me to leave my Engine at 9 am & take another down to the Main Depot at Malhove, which I soon did & eventually signed off at 10 am & into Bed after a Meal\n\n& at 4 Pm I dressed & had my hot Dinner & caught the Staff Train into St Omer & on to the French Pictures & spent an enjoyable Evening, The Hall was crowded with Soldiers & Civilians, after a couple of Drinks I bought the Daily Paper & off back to Camp & once more into Bunk, Monday I was on a Stand by job but did not leave the Depot,.\n","48":" \n\nI signed on for a run to Hazebruick to work for a Construction Coy leaving the Depot at 6 am arriving there at 6.45 am, & what a shock I got, as it was last March when I was there last & it was a very busy place & the Town full of Civilians & this time it was deserted with very little Traffic about, The Station has had a very rough handling & knocked about, the verandah’s & glass roofs are lying strewn about everywhere, the Houses all close to the station have been badly shattered, the Tile Roofs are in an awful state, the shell holes & Bomb\n\nholes are everywhere, I was told away from the Station the damage is not near so great, it is awful to think what destruction War does, Rows after Rows of Houses smashed in & not a Window left anywhere, luckily the beautiful Cathedral has not been hit & a Thanksgiving Service was held in it a few Sundays ago for the Town’s deliverance from the Enemy, as it was in great danger of being captured a little while ago. I am anxious for a trip out as far as Bailleau which we have recaptured which has been destroyed which I hope to later on. I was not long at Hazebruick having only to take some Material & Men back to St Momelin past St Omer & then I came back & at 1 Pm finished & signed off.\n\nFrom","49":" until Mon Sept 30t., \n\nvery little worth noting happened, I being on local work in the District, On this day","50":" I was booked up a Stand by Pilot at St Omer to Pilot any Driver from another Depot who did not know the Road.\n\nI was called at 4.45 am & signed on at 5.30, taking the Staff Train from the Camp up to St Omer, reporting there at 6 am & was told to wait in the Mess Room until called, I passed the time away resting as I had drawn 24 hrs rations & one never knows on this work where & when you will finish, I had by Breakfast & a smoke & laid down on a form & had a sleep until 11 am, when I obtained permission for 15 minutes to go out & into the Canteen for some Envelopes & Cigarettes also over into an Estaminet for a Drink, on my return, my services were required to pilot a Driver from the Main Depot to Boulogne, so at 11.30 the Engine arrived & I boarded same & the Driver was to proceed Light Engine to Wizernes to assist a Coal Train waiting there over the Hills to Boulogne, we arrived at Wizernes at 12 noon & soon was coupled on & on our journey, our first stop was Lumbres were both Engines took water, it is necessary on these heavy grades for one Engine to be in front & the assisting Engine in the rear, in case of the Train breaking away, after 15\" stop at Lumbres, we were off again were we\n\nstarted climbing the Hills in earnest, on reaching the first crossing Station called Nelles les Blequin, the Semaphore Signal was at danger & we both steaded up, as soon as the first Eng had reached the Signal it was pulled off & the Dr. started suddenly with the result that the Train gave a nasty jerk & broke our Coupling hook & we was only coupled up then by the Safety chains, anyhow we kept going on the Heavy Grade until we reached the top of the Hill arriving at a Station called Grande Bois, we gave several short whistles for the Leading Engine to stop for us to use the Truck Coupling hook, he stop & the Driver & Fireman got down to lift the Hook up when the Train started again, & as they had uncoupled the Safety Chains which was in the way to lift the hook, the Train left us standing there, I blew the Whistle several times, but the Train continued on its way, so we had to wait until it reached the next Station Lottinghen, were it was pulled up & we were given the Signal to proceed after it, when we arrived at Lottinghen, the Chief de Gare, which means in English, Station Master, shunted us around & put \n\nus in the lead of the front Engine, & soon we were off again, we was going along steady down the hill & going over the first knob the rear portion of the Train gave a jerk & broke the Couplings & eight Trucks of Coal, was travelling on their own, a French Madam in charge of a Telegraph Cabin noticed the breakaway & signalled for us to go faster as the runaway trucks were coming after us, the rear Guard had his brake on the runaway portion, but it did not make much impression, we continued & kept clear & after passing over the next knob the trucks slackened down & we arrived at Devres reporting the affair, Our engine had to proceed back slowly to bring them in, & found them on the top of the second knob. The Coupling gear & the Safety chains had all broken away so we luckily had a long chain on the Engine & secured it under the leading truck & on to the Engine & slowly we pulled them all into Devres, my Driver was very much upset as these mishaps were his first in France after being Driving just on two years, I told him it was all in the game as I had found out by Experience that as a rule when\n\none meets with a mishap generally two more follows & as he had had two in succession, another one was for him, then it was someone else’s turn, as it so happened before we finished. After putting the damaged truck into a Siding, we all started away again & everything went well right into Boulogne arriving there at 5 Pm. on the reaching the Main Yard our Train was required to proceed further to Bassin Lubie, another Yard along the Wharves towards the , we had a Pilot Shunter with us & had to go very slowly along several Streets & Wharves where the Traffic was very busy, Soldiers & Civilians in crowds going to & fro also Horses & Carts Motor Cars & Wagons in large numbers, we passed numbers of boys going towards the Docks on leave & numbers were returning, & what a Contrast, the boys returning were all so neat & clean & the boys going dressed anyhow, clothes shabby & dirty, some wearing their Steel Helmets, as they had lost their Caps & Hats, Trousers & Puttees all torn, but still all smiling & in a happy mood, looking forward to a Bon Holiday over the Pond in Blighty, these place is a real eyeopener to anybody\n\nit is wonderful the amount of Traffic & the number of Men employed loading Trucks for up the line, this goes on continuous day & night to keep the Troops supplied, after reaching & leaving our Train in the Yard we came back gradually after numerous delays owing to the Heavy Traffic, & arrived in the Main Yard where my Driver was instructed to report down at Outreau Depot for instructions & The other Eng was to run light to their Depot at Marquise, after several more delays we reported at the Depot, & as my Driver’s Depot was Calais, he was instructed to prepare his Engine to work a special to Marquise leaving it there & running light to Calais, after cleaning his fire & taking Water & Oiling up we went out at 7 Pm & up into Boulogne Yard for our Train, I obtained permission from the Sergeant in charge of the Depot to go with the Engine to Calais as I had not previous been over it before. Our Train was not ready, so we had to wait & by the time all was ready & we were away it was Midnight, & very dark. I had been on duty for 18½ & I was beginning to feel a bit tired, but as I was anxious to see the road to Calais I did not mind. After leaving the Yard, we crossed over a fine Steel Bridge \n\nwhich spans a wide river, called & then passing through two long Tunnels, on a fairly steep Grade & once over the first bank, we had a good run downhill & up & over the next & along to Marquise arriving there at 1.30 am, where we shunted our Train into the Yard & then had to wait 45\" before we could get away owing to the heavy Traffic, Trains coming one after another, as soon as one cleared a section, another one was entering it, at last we were let out & away, we kept going steady, climbing all the time & on approaching the top of the Bank, the Semaphore Signal was at Danger & the Driver was looking out & the Fireman was putting on a fire, when all of a sudden, the Engine received a heavy bump from the rear, the force of the compact, knocked the Driver’s Cap off, the Fireman was thrown into the Tender & received a nasty bruise in the bank, the two Guards were knocked together into the corner of the Cab, & as I was sitting up on the Tender behind the Driver, I was thrown down on to my feet, my Tucker Box & Bottle was thrown into the Coal, the Driver gave the Engine more steam to keep clear & out of the wWy, & then we stopped but could not\n\nfor the moment find out the cause, the Windows in the Cab were all broken & glass was lying everywhere. The Driver & the Guard got down at the Station & went back & found out that a heavy Canadian Engine drawing a Troop Train had run into us, he did not see us although our Tail lamp shewing a Red Light was burning brightly. The Canadian Engine had its two front buffers broken & also our two back buffers were broken & also our intermediate buffers were bent & the Plates dented in, & the Iron flap between the Engine & Tender all buckled up, & the water hose on one side was broken, as the Engine was all right to proceed & the Signal off & continued on our Journey after the","51":" Mishap for the Driver & I told him he was alright now, as it was the other fellows turn, as we continued on we passed several large Stone Quarries lit up by Electric light, which was a grand sight, a great number of Trucks were here & there being loaded up with Stone & German Prisoners were working everywhere, some pushing small wagons running on lines, others emptying the Stone into Large Crushers, others were wheeling barrows to & fro\n\n& one could hear the Roar of the Stampers breaking up the stone & shakers sifting the lumps out & the trucks were under the lines being loaded up, it was altogether a busy sight & looked well under the Electric light, we soon left the quarries behind & away down hill arriving at Calais at 3.45 am where I said Good bye to my friends & wished the Driver better luck next time, I then made for the yard for a Train to St Omer, one was just drawing out & I jumped up on the last Truck & kept the rear Guard Company in his little Dickie Box where he rides & handles the brake on the Truck, I was very tired & sleepy & soon dosed off to sleep, wakeing up at Audruicq where the Train terminated & as it was a St Omer Engine I & the rear Guard walked up to the Engine & in a few moments we were away, I sat on the Fireman’s Seat & soon was fast asleep until we reached St Omer at 5.45 am when I caught the Staff Special for Malhove signing off at 6.30 after 25 hours on duty & a day full of Adventure & Excitement. I turned in after breakfast & slept well all day, not being required for duty until next morning at 2 am when\n\nI went out on the Lumbres shunter working 13 hours signing off at 3 Pm, & today","52":" I am standing by in the Yard, in case of a breakdown or a special being required, as my Engine is still laid up, the broken castings have been sent away for new ones, I will not have her again for a week or two yet.\n","53":" \n\nI was called for duty at 9.30 to proceed to St Omer to stand by as Pilot & at Midnight was told an Engine had left Ligny at 11 Pm & required a Pilot between St Omer & Zenningham, so I proceeded up to the other end of the station to wait. I laid down in a Carriage for a sleep until the Train arrived, which was not until 6 am, so I had a fair sleep. As Zenningham is only about 8 or 9 miles from here it did not take long to reach there, The Driver & Fireman was ordered to book off & I was instructed to proceed by a special leaving at 9.30 for Audruicq & I was to leave the Train at the Junction of the Main line & Zenningham line & walk into Watten, the two Guards of the\n\nreturned with me, on arrival at Watten, we were waiting on the Platform for a Train to arrive when A French Man with Papers came up & said Bon Papier, Bon News & was all Excitement, he pulled one out from the Package & shewn us where the Central Powers had asked the Allies through President Wilson of America for a Armistice, this news caused quite a stir everywhere, & as Bulgaria had Unconditionally Surrendered on all hands had been waiting for some move on Germany & Austria & Turkey’s Part. After a few days waiting the Allies’ answer came that Germany must Evacuate all Occupied Territory first, The Germany Reichstag met on","54":" to consider the answer & Formulate replies to the President’s three questions. 1. Were they ready to withdraw their Armies, 2. Do they accept the Fourteen Points unconditionally 3 Is the Chancellor speaking merely for the Militiarists.\n\nAll Thursday Evening strong rumors were about that Germany, Austria & Turkey had accepted\n\nNo 2 question & Fighting was to cease at once, the same rumor was in Calais & Boulogne, but in Friday’s Paper the Allies were still waiting for the replies, Saturday’s Paper brought the news that the Allies meet & agree, Turkey and Austria Force Germany’s Hands, and that Austria & Turkey have intimated their Acceptance of Mr Wilson’s Terms & are seeking to force Germany to do the same. If Germany refuses, they will take separate action on their own account. I was off duty","55":" I finished duty at 6.15 Pm & stopped in Camp & at 10 Pm turned in & at 2 am News arrived that Germany’s answer was in the affirmitive to the 3 questions. The News came from all directions at the same time, it caused quite a stir in the Hut where I sleep, there was quite a chatter for an hour but in some Huts it was kept up longer. On rising this morning","56":" all hands seem to be in a good mood & the News genuine\n\n& the Day’s Paper will be waited for anxiously by the Boys. I am off duty & expect to be called on before Dinner, & as things are fairly quiet I may remain off longer, The Weather now is cold & Wintry. Yesterday was the limit, Raining all day & I was on my way home from Boulogne on a Mixed Train & had to Shunt every station enroute & I had my Over Coat on but it soon was Wet & I was glad when I reached St Omer after being on duty 13 hrs after Coaling & my Mate cleaned the Fire. I left for Malhove & soon was off duty.\n","57":" \n\nAfter resting all day I was called on at 9.30 Pm to stand by on an Engine in the Depot, & after remaining on same until 11.45 I was ordered with my Mate to leave the Eng & proceed on a Train to Hazebruick & there relieve a set of Men on 5324, a Big Great Western Engine & take a Supply Train on past Eypres as I did not know the Road beyond Castre very well, a Pilot Driver was sent with me to Hazebruick, we left Malhove at 12.30 am & after \nan hour\n a run of 1 hour arrived\n\n& took over the Engine as arranged & at 2 am left on my journey. The Engine who brought the Train from Calais broke down near Hazebruick, & the Driver on my Engine who had just returned from a Supply train to Armentieres, & his Engine was ordered to take the Train on beyond Eypres & as they had been on duty 12 hours, that was why I was ordered out to relieve him. After leaving at 2 am with slightly over 900 Tons we made good time to Castre where an Engine came on behind to give us a push up Goedersvaeldte Bank & soon we were off again & up over & into Belgium & along to Poperinghe were we put off 7 Supply Vans & continued on to Flamertinge were 17 more were put off, & off again soon arrived at Eypres, as this was my first time I took a Train into this Station & it being Daylight, I had a good look around, there is no mistake Fritz has given this place a warm time with his Shelling, the large Goods shed had been hit several time & partially destroyed, the Roof is all gone & only portions of the\n\n \n\nWalls left standing, the Fine roof of the Station is smashed likewise the Walls knocked about, Railway lines about the yard lay twisted & broken everwhere in fact the whole place is practically one ruin, As soon as we had put more Vans off we left with another Pilot to go on to Three Kings a siding about a Mile further along on the Main line towards Menin passing the new single line to Roulers, also Shrapnel Corner, which is laid bare, not a Tree left standing neither a house & shell holes everywhere, The Traffic along the main Road at Shrapnel corner being fairly heavy, mostly Motor Wagons, As soon as we had placed the remainder of our Train in the Siding, the Motor Supply Wagons came alongside & in a minute all hands were busy unloading their supplies for the Advanced Areas, As Fritz is retreating so fast it is very difficult for the Supply Wagons to keep in touch with our Boys Advancing, with the result a lot of Rations have to be carried by Aeroplane packed in bags of Sand & dropped from a low Altitude, the line to Roulers\n\n"}}