{"Document Name":{"0":"Diary_0027","1":"Diary_0027","2":"Diary_0027","3":"Diary_0027","4":"Diary_0027","5":"Diary_0027","6":"Diary_0027","7":"Diary_0027","8":"Diary_0027","9":"Diary_0027","10":"Diary_0027","11":"Diary_0027","12":"Diary_0027","13":"Diary_0027","14":"Diary_0027","15":"Diary_0027","16":"Diary_0027","17":"Diary_0027","18":"Diary_0027","19":"Diary_0027","20":"Diary_0027","21":"Diary_0027","22":"Diary_0027","23":"Diary_0027","24":"Diary_0027","25":"Diary_0027","26":"Diary_0027","27":"Diary_0027","28":"Diary_0027","29":"Diary_0027","30":"Diary_0027","31":"Diary_0027","32":"Diary_0027","33":"Diary_0027","34":"Diary_0027","35":"Diary_0027","36":"Diary_0027","37":"Diary_0027","38":"Diary_0027","39":"Diary_0027","40":"Diary_0027","41":"Diary_0027","42":"Diary_0027","43":"Diary_0027","44":"Diary_0027","45":"Diary_0027","46":"Diary_0027","47":"Diary_0027","48":"Diary_0027","49":"Diary_0027","50":"Diary_0027","51":"Diary_0027","52":"Diary_0027","53":"Diary_0027","54":"Diary_0027","55":"Diary_0027","56":"Diary_0027","57":"Diary_0027","58":"Diary_0027","59":"Diary_0027","60":"Diary_0027","61":"Diary_0027","62":"Diary_0027","63":"Diary_0027","64":"Diary_0027","65":"Diary_0027","66":"Diary_0027","67":"Diary_0027","68":"Diary_0027","69":"Diary_0027","70":"Diary_0027","71":"Diary_0027","72":"Diary_0027","73":"Diary_0027","74":"Diary_0027","75":"Diary_0027","76":"Diary_0027","77":"Diary_0027","78":"Diary_0027","79":"Diary_0027","80":"Diary_0027","81":"Diary_0027","82":"Diary_0027","83":"Diary_0027","84":"Diary_0027","85":"Diary_0027","86":"Diary_0027","87":"Diary_0027","88":"Diary_0027","89":"Diary_0027","90":"Diary_0027","91":"Diary_0027","92":"Diary_0027"},"Date":{"0":"unknown","1":1662.0,"2":1663.0,"3":1664.0,"4":1665.0,"5":1666.0,"6":1667.0,"7":1668.0,"8":1669.0,"9":1670.0,"10":1671.0,"11":1672.0,"12":1674.0,"13":1675.0,"14":1676.0,"15":1677.0,"16":1678.0,"17":1679.0,"18":1680.0,"19":1681.0,"20":1682.0,"21":1683.0,"22":1690.0,"23":1691.0,"24":1692.0,"25":1693.0,"26":1694.0,"27":1695.0,"28":1696.0,"29":1697.0,"30":1698.0,"31":1699.0,"32":1700.0,"33":1701.0,"34":1702.0,"35":1703.0,"36":1704.0,"37":1705.0,"38":1706.0,"39":1707.0,"40":1708.0,"41":1709.0,"42":1710.0,"43":1711.0,"44":1712.0,"45":1718.0,"46":1719.0,"47":1720.0,"48":1721.0,"49":1722.0,"50":1723.0,"51":1724.0,"52":1725.0,"53":1726.0,"54":1727.0,"55":1728.0,"56":1729.0,"57":1730.0,"58":1731.0,"59":1732.0,"60":1733.0,"61":1734.0,"62":1735.0,"63":1736.0,"64":1737.0,"65":1738.0,"66":1739.0,"67":1740.0,"68":1741.0,"69":1742.0,"70":1743.0,"71":1744.0,"72":1745.0,"73":1746.0,"74":1747.0,"75":1748.0,"76":1749.0,"77":1750.0,"78":1751.0,"79":1752.0,"80":1753.0,"81":1754.0,"82":1755.0,"83":1756.0,"84":1757.0,"85":1758.0,"86":1759.0,"87":1760.0,"88":1761.0,"89":1762.0,"90":1763.0,"91":1764.0,"92":1765.0},"Entry":{"0":"\n\n","1":" This book opens at Harborne Hall & I am sitting at my favourite window surveying the countryside for it is a very nice morning & the sun is trying to break through the screen of clouds, I am going away this morning to \"Harefield\" but I don’t expect to be there long for I am practically all right now & feel as fit as a fiddle.\n\nLeft the Hall this morning at 11.30 in motors which took us to Snow Hill railway station, here they dropped the whole party & never even told us where we were going nor did they leave\n\nany papers with us, things looked to be in a pretty mess, so I as a Sgt took command of the party which numbered 16, the first thing I done was to look for the R.T.O. but was informed that he was down at New St station so I had to slip down there as quick as I could they knew nothing about it, so I rang up the Hall, it appears that they had forgotten to tell us that a Sgt was coming from another Hos. with our papers & tickets & that he would take charge of the party, so back I hurried to Snow Hill St. & there I found the papers & Sgt, we left Birmingham at 12.35 & after a wearisome journey arrived at Harefield at 5.30 here\n\nwe were roughly run through & a good few of us including myself were marked for furlough, after this we went round to our various wards & then we had a real good tea to which we did full justice for we were very hungry as of course I for one always am & now here I am in the writing room scribbling away with a scratchy old pen, my first impression of this place is not very favourable, I suppose after coming out of the lovely home at Harborne Hall makes it seem crook, this place is all big huts, built on the same system as in France.\n","2":" Have just had breakfast which consisted of porridge with plenty of milk fish & potatoes\n\ntea & bread & butter, so that’s not so bad, though they have a little rougher way of serving it up. At 6 oclock this morning an orderly came round & took our destinations for leave so I expect we will be going tomorrow Done nothing but ramble round the place all the morning like a lost sheep. I took one or two snaps of different places but it was not a good morning for a camera the light was too dull in the afternoon a Sgt from the 57th Bn & I went for a stroll down to a forbidden place \"the Asbestos Works, there are hundreds of girls working there that partly accounts for its being placed out of bounds for troops & at the same time made us want to\n\nvisit the place. Since coming across to England this time I am getting a terror for breaking rules & etc I am always getting in these out of bounds places but so far have managed to get out without any great rows with the Military but one of these days I must drop in, theres a canal running past the works which lie in a fertile little valley & plenty of barges ply up & down these barges are pulled along by the horses the husband leads the horses & the wife attends to the kids does the cooking sewing & etc & at the same time steers the boat, the barge women wear many colored dresee’s & are very dark women, they live on these barges from one years end to\n\nthe other & seem perfectly satisfied with their lot, after following the canal & watching them put their boats through one of the many locks that are on these streams we struck off across country to a little village we could see in the distance but as we could get nothing to eat there we hit out for the Camp & soon got tangled up in a maze of streams which seemed to run everywhere, we dodged about all over the place, crossing by a little rickety plank, or a fallen down tree or anything but as fast as we crossed one stream we bumped another this began to get a bit monotonous & we seemed to be getting no nearer to our destination, but at last by a bit of luck we struck 4 bridges one after\n\nthe other & they led us to a big stream 60 yards wide, here was a nice kettle of fish for the only way of getting across seemed to be swimming but before we tackled this I suggested that we should go as far as the next bend & see if anything was in sight so we trudged along & our luck stuck to us for there we saw 3 men cleaning the weeds out in a punt & I put it on them to run us across which they did & so ended an adventurous afternoon, but all the same I enjoyed myself & we had a jolly good laugh over it on our way home I took a photo of the punt but I don’t expect it will be much good for the light was so bad.\n\nWas told this evening by the orderly that I would be going on leave in the morn.\n\n22nd. Left Harefield this morning for London & after a short run in the train arrived at Marylebone here we caught the tube & went as far as Charing Cross, changed there & got out at St James from we had only a short way to walk to Horsferry Road on arrival there we went through the usual lot of red tape before we finally drew our money & got off, after clearing Horsferry I went round to Peel House & dumped my bag & overcoat had a meal & then struck out for Victoria, but I could not catch a train here for Eltham for I was going to see Mrs Oliver, so I had to take the tube again & get to Charing Cross, had to wait a while here so I walked off up the Strand & bought myself\n\na new pen another Watermans She has cost","3":" & I am now using her for the first time. I hope I have better luck with her than my other old favourite, I also bought a nice pocketbook, so you can see I have started cutting into my wages early but I think I have enough to see me out, I arrived at Eltham a straggling little town about 2.30 & made off down to the address given me I found the place alright but I am not allowed inside, I made enquiries & the girl told me that Mrs Oliver at present was out shopping I swore to myself & set off for a stroll round the town for an hour or so, so here I am fed up & writing in the Public Library, this is one of my days leave being slowly murdered\n\n \n\nIt is a nasty sort of day, plenty of sunshine but the wind is blowing a gale & dust is flying everywhere Went back at 4.15 but still no sign of Mrs Oliver so I decided then back to London, I left a note for for Mrs Oliver with the gatekeeper, arrived in London & went by tube to Victoria I got a taxi & run round to Peel House where I booked my bed & had tea, I then decided to go to the Opera at Drury Lane Cavelleria Rusticania & Pagalacciao was on was luck for I got a single seat in the Grand Dress Circle & the 2nd row cost me 9\/- but the performance was easily worth it the music & singing was lovely, the theatre was packed by a most enthusiastic\n\naudience, the dresses of some of the society belles were an eye opener & jewellery sparkled everywhere. I can see very little difference in London from the first time I saw her in 1916 there seems just as many people about as ever there was, but there is a big difference in the food line, if you haven’t got your food cards you would nearly starve that’s a certainty, it was a lovely moonlight night so I strolled down the Strand into Whitehall & then went over past the House of Parliament & over Westminster Bridge the old Thames looked so quiet & peaceful with the moon shining on its silvery surface I lingered quite a while enjoying this then I walked home down Victoria Street to my diggings\n","4":" This morning as I was thinking of slipping down to Littlehampton I went round to Horsferry Road to get a reduced fare warrant, I was a bit too early so to put the time in I went round to the War Chest I had no sooner set foot inside the door than I bumps Gibson & then Len Pettit & Goggins who were on leave had a yarn with them then went round & got my warrant & round to Peel House having ½ an hour to spare I am scribbling this in the writing room.\n\nHad a weary trip to Littlehampton the train was crowded & I felt rotten & to make matters worse I was sitting next to a woman with a howling screaming brat, the young hound\n\nnever left off yelling the whole trip, we had to change at E. Croydon & again at Brighton but this infernal woman stuck to us like glue, & I only lost her when I changed for the last time at Ford, trains over here run anyhow nowadays & its pretty rotten travelling, I arrived at Littlehampton towards evening & made straight round to Mr Dukes, we then had tea & he & I & Mrs Elliott went for a stroll round the promenade it was a glorious evening & the place was crowded, there were hundreds of Yanks taking the air, they all come from the great aerodromes which they are putting up down here, by this time I was beginning to feel pretty rotten, & when we got home I was jolly glad, we stopped up fairly late yarning & when I eventually climbed into bed I was done to the world. \n","5":" Passed a real bad night & this morning I feel as if every bone in my body wants to drop out, my head is aching like mad & I feel weak all over so I have been in bed practically the whole day, I can eat nothing only drink a little port or a cup of coffee now & again they wanted to send for the Dr but I stopped them, for I kept thinking it would go as suddenly as it came but no fear as the day wore on it got worse & worse, about 2 oclock I thought I would get up & go downstairs out into the bright sun & air, but this did no good so I started unpacking all the parcels which I had sent Mr Duke during the past year I stuck at this till finished, then I had to go back to bed again, Mr Duke was beginning to get alarmed but I made out that I would be right in the \n\nmorning & that it was nothing at all.\n","6":" Still as crook as ever & can eat nothing, though this evening I went out for a stroll with Mr Duke, he took me all round his workshops coal yards & offices.\n","7":" Left for London again this morning & made straight for Horsferry Rd. where I saw the Dr & he marked me for Hospital at once temperature 103, after dumping my kit I got a taxi & run round to Victoria where I had arranged to meet Len & his girl, had a short talk with them said goodbye & went back to Hqrs. I was in a fit mood for anything didn’t care what happened I caught the train at Paddington Station after a lot of changing from one tube to another, arriving at Denham I was met by a Red Cross Orderly & put into a car & run down to the hospital\n\nhere I had to put my kahki much against my will over the counter to be stored until I was fit to come out they gave me a suit of blues in return & I was put to bed, feeling about the worst I have ever felt in my life, didn’t care what happened.\n","8":" Passed another wretched night no sleep, heavy sweats, bones aching head splitting, & as weak as a kitten a pretty state of affairs, & my chest & throat are red raw plenty of blood comes up, they say I have this \"dog disease\" (Spanish flu) in a very bad form & I believe them, this epidemic is raging throughout England & it attacks anyone & knocks you in a few minutes its that sudden, I have eaten nothing all day only lay & squirmed in my bed with the intense heat, & they don’t seem to \n\nworry their heads in the slightest over anyone, she’s the roughest joint I have ever seen, & as for tucker well dont mention it, nothing but salty kippers or rabbits make’s me sick to look at them, its a regular starvation hole for a sick man.\n","9":" Still as sick as ever & fed up with the place, the weather is very hot & this makes it worse, I managed to crawl out of bed & go along to the canteen & get a cup of tea, while there I strikes old Bandy a little bow legged chap who knocks about the wards doing any little odd jobs for the boys, by a marvellous piece of luck I got 3 rolls of films from him, I had been trying to get some everywhere but had no luck & here I went & picked a bunch up in one of the last places I expected as they are very scarce.\n\n \n","10":" Thank Heaven I feel a tiny bit better today but my cough is still very bad, & at present I have very little interest in life, I know I would make a very bad patient if it should ever be my misfortune to have a long illness stopping in bed breaks my heart, & oh the horrible & rotten medicines we have to swallow, almost as soon drink poison\n","11":" A little better again today but still have a headache & feel weak its spreading like wildfire all over this part of the world according to the papers\n","12":" Frightfully hot weather & everyone nearly dead myself included sweat all day & night, & soon will be like a matchstick.\n\nA big batch of men left here for Australia last night, nearly all had lost limbs or something\n\nRather peculiar thing hanging up in one of the recreation rooms is a big picture, \"harvesting at Colebrook, I have been trying to puzzle out whose place it can be but I can come to no settlement as yet, nor do I recognise any of the people shown in the photo.\n","13":" Was marked out by the Dr. this morning they don’t keep you here long, as soon as you can walk out you go, she’s a nice place, but thank heaven I am feeling a lot better, but I could do with a weeks spell nicely\n","14":" Fairly hot again today, nothing much doing, got a few letters & a small parcel from Mr Duke\n\nThis is a very free & easy place, no one stands to attention here when the Drs make their visits, just lay or sit on your bed while he questions you, they all smoke & talk while he is\n\nis in the room, & all this sort of thing she’s pretty good on this account, but the tucker is rotten especially these bloaters & herrings they serve up they are the limit & would make a man spit blood.\n","15":" There will be great carrings on in London today over Independence Day I thought I should have been there but I won’t be able to get out till tomorrow\n","16":" According to the list issued last night I should have gone to Sutton Veney this morning, now this would have meant me losing my 10 days leave so I could not see my clear to do a thing like that so this morning I goes round to the head office to see what could be done in the matter they referred me to the Sgt in charge but he reckoned he could do nothing & seemed inclined to do less himself, so\n\nI told him that if I could get no satisfaction from him I would go further one word brought on another so we had a good old row, I then went round to the Admission Hall & found the Orderly Sgt & got him to parade me to the Colonel, he listened to what I had to say & said straight away that I was to have my name scratched off the list & that I was to get my leave, he then went into the office & blew the Sgt up properly for it was his mistake all along only he wouldn’t admit it, you see if I had held my tongue & had not spoke up for my rights I would have lost my leave, for once you get as far as Sutton Veney you have one leg in France as the saying goes, for you will be there in no time.\n\nVery hot & cloudy this afternoon looks like a change setting in. Had a good hot bath & a proper clean up this afternoon then went for a walk round this quiet little village of Harefield, one can scarce believe that’s its only 20 minutes run by train from London, in the evening I wrote a few letters & in a few minutes I am going round to the pictures which they show nightly here.\n","17":" Left Harefield again this morning & arrived in London about 11 oclock Marched round to Horsferry Rd. to see about our leave & etc, here we were delayed for a couple of hours as per usual while the red tape was in action, got away about 1 oclock & took my things down to Peel House, then\n\nhad something to eat, & set off up the town, I went to the Queens Hall one of the biggest things in its line in London. There was a fine concert on there in aid of the Australian prisoners of war, the place was crowded for they were all noted artists who were performing, the one I liked best was Madame Ada Crossley she sang Land of hope & glory & fairly brought the house down, she has a lovely voice, she is an Australian too. After this was over I went up round Picadilly for a stroll & went into a flash restaurant to have a little lunch a plate of ham & a cup of tea cost 2\/-, but you pay through the nose for anything round this quarter theres one thing I’m satisfied about that I know less about\n\nLondon every time I see her. I got lost over & over again this afternoon, & often I found myself walking in an entirely different direction to where I wanted to go she’s a big place alright, I had a job to get home I never saw the tube so crowded before especially the \"inner circle\", it was packed & the platforms were swarming with people.\n","18":" & things are very quiet I even went round to Euston this morning to make enquires about the boats running between Liverpool & the Isle of Man, they start tomorrow so tonight I leave London & will spend a day with the Allens in Blackpool all going well.\n\nLeft Euston at 11.45 AM. for Liverpool & after a 6 hours run arrived at destination, walked\n\ndown from Lime St Station a short distance & put up at the Stork Hotel- a fairly good place 7\/- bed & breakfast I then made enquiries about the Blackpool trains & found that I could catch one from Exchange St Station at 9.40 so I hops round & books my ticket\n","19":" Arrived at Blackpool & it was raining fairly heavy so I set out for the Allens address & after a little walk found it, they were having dinner when I arrived & they were very pleased to see me especially Clarice, in the afternoon Clarice & I went out for a look round she took me up to the great pleasure joint where the scenic railway, joy wheels, boats & etc are & we had a jolly good afternoon, in the \n\nevening we went strolling on their beautiful promenade for it had turned out lovely these promenades were crowded there were thousands of girls there all on holidays & a chap would be pretty slow if he could not have a good time here, if I had not been going to Douglas I should certainly have put the remainder of my leave in here. I left that night by the 9.20 train intending to get back to Liverpool to have a good nights rest. I got it alright, all went well till we got as far as Wigan here we had to change & I by some mistake got on the wrong train & was carried as far as Earlston there she stopped So I then had to catch a train to Warrington arrived there at \n\nmidnight, I found the whole place taken up with Tommies going back to France from their leave & dozens of girls were there seeing them off singing & dancing all the time, they were kicking up a great row, while waiting here great trainloads of Yanks kept on coming through they were just off the ships & I was the first Australian they had ever seen so they were greatly interested in me & my uniform they have been hearing a good bit about the Aussies since the Yanks made that attack with our chaps & they think the Australians are \nthe\n fighters they fairly crowded round me as if I was a piece of curiosity & the questions they asked it was very amusing to me, but they are a fine lot of chaps no mistake\n\nafter a good wait at Warrington I caught the train for Crewe & here I had to wait till 2.15 finally landing in Liverpool at 4 oclock 6 hours later than I should have I slipped down to the hotel only to find the room I had booked was occupied so they had to find me another one I turned into the bed done to the world & left instructions that I should be called at 9 oclock in the morning for I wanted a few hours sleep badly.\n","20":" Left Liverpool for Douglas at 11.30 this morning & the boat (Fenella) was crowded it was interesting steaming down the Mersey which was crowded with shipping of all sorts & sizes. I was still very sleepy so I laid down on the deck & went to sleep\n\nfor about 4 hours & when I woke up my face was burning like fire oh wasn’t I sunburnt, the trip took us about 6 hours, (82 miles) looking at Douglas from the sea front she is a very fine place for all the houses are built of stone & are very fine they are all places for visitors 6 & 7 storeys high & so clean, it runs in a big semi-circle right round the bay. I laughed when I saw their tram service open trams drawn by horses which just jog along. I got on one of these for it took me within a few minutes walk of my future home for a few days \"Craigmount is built up on a hill at the end of the town & one can get very fine views on arrival I was met by Miss Nivison & shown to my room\n\nI stripped off & had a good wash & then went down stairs for my dinner this is a good place to live nobody seems to be rationed the bread is white butter plentiful also meat, in fact you would never know there was a war on & its the same in the town & she’s crowded to some order visitors being here from all parts some place believe me, the streets which lie at the back of the promenade are funny little winding affairs, but you can get almost anything you want, even here there are 2 Australians beside myself no matter where you go you will find some of our chaps\n","21":" Went for a stroll down the town this morning & picked up with a fine sort of girl who is also visiting here belongs to Manchester made an appointment with her for tomorrow\n\nfor the afternoon I am making one of a party which are going out driving round the Island\n\nI am no less than 9 days behind so I am just going to scribble on from memory & without dates that’s the worst of leave one has never time to keep his diary up for he is going all the time.\n\nwell I suppose I must start where I left off the drive I think it was, we were driven round some of the beauty spots of the Isle & no doubt they were lovely real old country lanes & every thing smothered with flowers, I have never seen such a variety before in my life, we were out 8 hours during which time we visited Castletown an ancient & quaint old place with a very old prison\n\nof course we had to go in & have a look round & if ever any one got tired of climbing endless stone steps well I did & I was jolly glad when we got clear of the joint they have one interesting thing in here & that is an old clock presented by Queen Elizabeth, it works with weights & pulleys & they reckon that even today so accurate is it that the town sets its clocks by it.\n\nIn this town I saw some real Manx cats & they were absolutely tailess such funny looking affairs, they also have a very funny church here the parson preaches from his pulpit in the middle of the room & all the seats are boxed in & padded something after the style of a box at a theatre I could not help thinking what bonza places for \n\nspooning during long sermons, no one could see whats going on for the walls of your seat are so high, no wonder this church is popular.\n\nGreeba Castle, Hall Caines residence is quite close here & a fine old place it is. During the day we had lunch at several flash places, one very much so the Golf Links Hotel.\n\nIt is a little Island that is very hard to describe, it lies in the midst of a shallow sea protected on every side by masses of land, & of fine evenings you can plainly see the mountains of Cumberland & Lancashire she has all the features of Britain there is rock scenery, rugged & rough there are valleys of bewitching loveliness, where streams like crystal flow through beautiful vegetation plenty of mountains, the island\n\nis about 30 miles in length by 8 wide, & has an almost ideal summer climate, the temperature being so even, scarlet fuschias grow everywhere, & the sunshine is plentiful, one night I was down at the Villa Marina a beautiful dance hall when I got into conversation with a Canadian who like myself had just come across, in the end we decided to knock about together which we did he was a very fine chap Davidson by name of the","22":" Canadians his father is an M.P. in Canada, we went for a trip in the electric car from Douglas to Ramsay 14 miles","23":" return fare, it is a lovely ride for the line skirts the coast almost the whole way except when it is not diving into glens or climbing over mountains\n\n& the views are magnificent, we stopped round Ramsay for a few hours, during which time we bought some souvenirs I sent home a pair of serviette rings with the Isle of Man’s coat of arms on, Laxey was another little town we visited it is the prettiest little place that ever I have seen being on 2 sides of a big deep valley & every house is of stone & as white as snow while flowers & trees are everywhere, the wonderful Laxey water wheel is here I took a snap of it, we reached Douglas about 9 oclock that night & went down into the town to get some tea we went to a good restaurant the Cabin Café, here in Douglas you would never know there was a war on there are no food restrictions, you can get meat sugar butter & \n\nbread as white as snow, it seems so funny after England where you must have coupons for everything the shops are all well stocked with good things, after tea we went & met a couple of girls we were friendly with & so spent the rest of the evening on the promenade, the last night we were there I brought Davey home to stop with me for we were both leaving in the morning, the last day we were there a funny little thing happened, we were going along on the tram & I pointed out to Davey where the German Von Bissing was staying & we were laughing at a window next to the Huns place which had a big Union Jack stretched across of course we started to pass all sorts of insulting remarks about him & Germans in particular\n\nsitting in the seat just in front of us was a well dressed man with a short beard but we took no notice of him, though I could see the tram conductor was nearly killing himself with suppressed laughter, we got off at the terminus & as we were walking away the guard said do you know who that was sitting in front of you, of course how should we know, well he said that was Von Bissing, pity we did not know it before for he would have learnt something about himself & country, but he heard quite a lot of truths all the same.\n\nWe left the next morning for Liverpool & had a very enjoyable run across the boats are nicely fitted up, lounges dining & smoke rooms & etc, on the way across we got in with a nurse from Townleys Hos. She was\n\nmaking for Bolton so we took her in hand & took charge of her luggage & run the show we all put up at St.Johns Temperance hotel, ordered dinner for 3, had a good wash & clean up then went to the lounge till dinner was ready, the nurses train was not leaving till 6 oclock so we entertained her till then & very grateful she was, we saw her off & put her luggage on the train.\n\nAs we were coming up the Mersey I saw a fine sight 14 big American transports were coming along fan shaped with destroyers escorting them, they are pouring the men across now sure enough, we stopped that night in Liverpool & had a good look round then we caught the 12.55 train from Lime St, she is one of the fastest\n\ntrains I have ever been on does between 60 & 70 miles an hour most of the way & has only 2 stops, one at Crewe & the other at Willesden Junction just outside London they collect tickets here theres no grass grows under her feet, the distance is about 217 miles.\n\nOn arrival in London we caught the tube & went as far as St James Park we then walked to Peel House to put our baggage money & etc in safe keeping then struck out for the Strand where my mate had to report on arrival in London, this was soon over so we went to Lyons Picadilly restaurant & had a good meal here we fell in with 2 officers a Canadian & an Aussie & we had quite a pleasant dinner, from here we went strolling round London & finally landed ourselves in Morleys Hotel a flash place just off the \n\nSquare, its an expensive place but great to stop at, I always give all these clubs & etc for soldiers a wide berth when on leave, I like something a little more tasty than those, we went & saw \"Going Up\" Fair \"& Warmer\" \"Box o Tricks\" & the Naughty Wife\" while in London this time, I liked the former very much, we had a jolly good time & I was sorry when his time was up & he had to go back to Camp, its rotten knocking about without a mate, one night I saw an awful sight we were having dinner in the Corner House & at the table next to us was a lady entertaining 4 blind soldiers, it seemed awful to me for that is my one fear I know if ever I lose my sight I shall do away with myself for life would be no good to me\n\nAnother day we had a funny collection at our dinner table, a Spaniard in the American Army an Englishman a Canadian, 2 Spanish girls & myself\n\nThe last night I was in London I was on my own so I walked in & sat down at a table I had no sooner sat down than a chap rushed across the room & slapped me on the back. I looked up wondering who on earth it could be & to my surprise it was Freddie Shannon I used to know him well, he took me over to his table & introduced me to the people, he is going back to Australia in a few days, got a stiff leg.\n\nAnother day I got a surprise I was walking up round Charing Cross when I saw a chap come hurrying across the street & he hailed me, I’m hanged if I knew who it was though his face was familiar, it turned \n\nout to be Chum Robertson, he has not changed a great deal.\n\nI am just beginning to know & understand London a lot better now, still one can easily lose himself in her maze of streets & endless traffic.\n\nI got 2 days extension to my leave, I pitched them an awful yarn & they fell for it, bit of a wonder too.\n\nThe day I had to report I felt very rotten its pretty rough coming off leave & with the training & drill in front of one, a fellow now has 1 foot in England on a banana skin & the other in France, not a very cheering prospect a chap does not mind going back to France in the slightest but I strongly object to drill & etc. I positively hate it.\n\nAfter reporting at Horsferry Road the papers & documents were handed\n\n \n\nover to me for I was in charge of the draft, I took them by tube from St James Park to Paddington railway station here we all had something to eat & drink at the Buffet & I interviewed the R.T.O. & got my instructions papers initialled & etc, we had not long to wait & soon much to my sorrow we were steaming out of London bound for the rotten camps we reached Warminster after \nan\n a fairly fast run & then marched in to Camp where we had to go through the usual lot of red tape, at last everything was finished & we were shown to our huts, here I met Lindsay Graham & he gave me all the news of the place, he took me down to the Sgts Mess & we had tea & then struck out for the O.T.B where Len \nwas\n is stationed on arriving there we find\n\naway so we had a chat to McKeown & a few more & then walked home \n","24":" This morning I was up for classification & what a farce it is you all stand in a row & they run you through like a mob of sheep. I don’t know what he marked me nor care much for I have no desire to stop in this Camp long, it rained like hell all the morning but this afternoon things look much brighter, just before dinner Len came over & took me back to dinner with him to his Mess, he is Catering Sgt & has the best Mess on the plains I was told this several times by various chaps & its true alright for it is very nice & the food judging by the dinner plentiful & good & everything is run on a system so there is no hitches\n\nThe country round here is very pretty & the crops look real well, especially the wheat & oats.\n","25":" Have been doing nothing all the day, but this afternoon Graham & I walked down to Warminster, on the way down we met Lieut Brownlee & we had a yarn with him, then went on to the town, she is built in a long rambling old fashioned way full of old houses all stone & ivy covered, I never saw so many \"Jacks\" (M.P.s) before not even in London, this place is full of the wasters, they pulled me up twice once for wearing my hat down & again for having no chin straps needless to say they got very little satisfaction in either cases. I had the luck of the world here actually got 2 films for my Kodak, a thing I could not get for love nor money anywhere else\n\nLindsay bought a pair of light boots cost him £ 2.10 some price for boots isn’t it but things in that line are frightfully dear over here.\n\nI met a lot of chaps round here who know me well though I can’t say as I know them too well but being a Sgt they get to know one very quickly, & they one & all reckon I look very thin & crook on it, I know I am not as strong as I used to be before getting my last crack but I think a rest will fix me up nicely, if they will only give it to me, but the Australians don’t get very much consideration shown them in this respect as soon as you are anywhere near the mark back to France you go but what a name our lads have made, the Americans in their lectures are told they are to follow\n\nthe example of the Australian Army for they are the finest fighters in the world this sounds like skiting but never the less its perfectly true, they are being taught to look up to the \"Aussies\" like we were one time taught to look up to the Imperial Army, thank heaven we hear no more about them now, they are not in it, today the Aussies hold first place as fighters & their fame is spreading throughout the battlefields of France & the British Army every paper you pick up now has some little exploit of the Australians in it & it has been the same for the last 4 months we have got the Canadians skinned\n\nAfter tea this evening Lindsay & I went down to see the pictures they were crowded as usual & as stuffy & hot inside as ever I want to be in theres not half enough ventilation for such a large building & the numbers that go in\n\nafter coming out in the fresh air we went along to a Y. M. C. A. & had some rhubarb & custard, cake & coffee & then we walked slowly home along the pretty little wooded lanes, a slight shower had fallen & things looked beautiful & smelt better\n","26":" Still hot & showery, one minute it is raining like blazes the next the sun comes out blazing hot, I find the heat over here much more trying than the Australian heat, for it is so moist.\n\nWent down to see Len after dinner today but he had gone out on a dray picnic. I met Roy. Cattell one of my old Cpl’s down there so we had a yarn \n\nThe old Froggie’s seem to be giving Fritzie something more than he bargained for in this last offensive of his, what wonderful people these French are, the world can never give them enough credit or\n\n praise for the marvellous fighting they have done.\n\nThis afternoon after tea Lindsay & I went for a walk down to Shearwater a very pretty sheet of water from which the Camps round here drain their water supply it lies in a lovely little valley clothed on both sides by beautiful trees & pretty little cottages are sprinkled all over the place there is a nice little path & road which runs round the lake & is largely patronized by the girls round this quarter, I took my camera with me & got a few snaps on our way back we met Jack Gribble I had not seen him for ages & we had quite a long yarn, he wants Lindsay & I to come round to his diggings tomorrow & meet a few more of his pals, Jack has been in trouble over his Italy stunt\n\nhe has been Conducting Officer for the troops bound for there, Jack has some queer tales to tell about the Italians he don’t like the Southern but he reckons the Alpinis or Northern troops are magnificent. Rome he considers is better than Paris, & much cheaper for a holiday, according to Jack the Italians don’t like the English at all, he reckons it would not take much for them to sling it in Jack’s Court Martial is to be read out tomorrow he is losing 12 months seniority. It has been a glorious evening the rain has gone & there is not a cloud in the sky & the countryside looks glorious.\n","27":" Rained like blazes all the day I never saw such funny weather in my life beats the band, in the afternoon I went over & saw Len & had tea with him we then went down\n\nto Warminster to get a few little things that I wanted. I got a couple more rolls of films & Len got 2, luck if you like, for they are so scarce.\n\nHave been doing a lot of writing this afternoon, getting some of my back correspondence off.\n","28":" Still raining this morning when I woke up & it continued heavily right up till dinner time when it cleared up nice & fine & for the rest of the day it has been lovely.\n\nAll us Sgts have been dodging parades & the officers have been chasing us with the object of getting us on parade, but they have been met with very little success, so this afternoon a note came round from the Adjutant saying that we will have to attend all parades in future or put up with the consequences, so it\n\nlooks as if we have come a gutser After tea Lindsay & I went round to see Jack Gribble as we promised, they were having dinner & were nearly all more or less drunk, all the officers present were under arrest for something or other, Jack was celebrating his getting out of his Court Martial so lightly & he was as happy as could be. Jack persuaded me to have a glass of whisky to drink his health with, so I did it was the first whisky I had ever tasted in my life & it will be the last I hope, we stopped about an hour with them, & then went down for a walk to Green Hills Y M. C. A. which is a very fine one, it was originally a private residence but the Y.M.C.A rent it off them for £9 a week I believe, there is also a fine little gymnasium attached to the place\n\n& the grounds are good.\n\n24th. Have got a job this morning, am on Isolation Guard & a ragtime one it is just killing time, but it will do me instead of parading\n\nHad some more stiff luck this morning some dirty rotten mongrel stole my camera, hanged if I can keep anything in the Army that’s one reason why I so thoroughly detest the cursed thing, but I can blame myself in one way for I left it hanging up on the wall, & I suppose some mongrel has walked in when all was quiet & made off with it, in one way it will be no good to them for they dare not flash it round here, but I expect they will take it away & sell her, I have been making enquiries everywhere this afternoon but met with no success so far. I am going\n\nto put the civvy police on the watch but I don’t suppose they will be able to do any good, they are too slow. I can say goodbye to her I think, & it should be another lesson for me, truly experience is dearly bought.\n\n6 P. M. All my trouble’s over my camera have turned out to be needless it appears that a","29":" Bn. Sgt. Jock Miller, thought it looked too tempting hanging where it was so last night he put it under my mattress & forgot to tell me. I thought there was something wrong during the night for there was a hard bump that I could not shift, & it turned out to be my camera, so I have had to cancell all reports. I have a chap named Barwick on my guard down here he comes from Bendigo in Victoria strange isn’t it, he is the first one I \n\nhave actually come in contact with since being in the Forces.\n\nBought a nice little toilet case this evening for 5\/- I am going to send it down to Littlehampton, it will come in handy afterwards for a fellow wont be soldiering all his life not if I know it at any rate, I am always a buyer for these sort of things Since 4 oclock it has been raining cats & dogs but the sun is shining nicely again now.\n\nAfter tea tonight Lindsay & I went down to the O. T. B. to see Len & found him busily engaged playing bridge so we did not stop long, but went down to Sutton Veney & had our usual snack for a wind up.\n\nI have only been near my guard once during the day so you can see its some job.\n\nGot my snaps & etc from Liverpool this morning, for a wonder the firm sent them along without being paid in advance.\n","30":" Have been doing nothing all day so this afternoon Lindsay & I went over to see Len had a few games of bridge & stopped to tea, then we went to the pictures & came home, \nbfo\n while over there Len & I fixed up a bit of business with the Pay Master.\n\nOn arriving home I find a job waiting for Dental Sgt. & a rotten one too took me 2 solid hours to get the names out \nlas\n & it will keep me going most of the day, still it will give me something to do instead of dodging parades & etc & keep me out of mischief for a while\n\nWhile I was working on my lists last night a runner came along enquiring for Sgt Barwick, I was busily engaged at the time & I blessed him, it appears he came from Lieut Gribble, I wondered what on earth he could be wanting, I soon found out when I looked at the sprawling spidery writing, wanted me to Lend him a few shillings for a few days, he was as drunk as a lord one could easily see that by the writing, booze was what he wanted it for, he got nothing off me, I told him I was broke & that if he called round in a few days time I would see what I could do for him, that’s what drink does for a man, I feel sorry for Jack at one time he was one of the straightest men in the Force, never drank swore or had anything to do with women, now\n\nhe is just the opposite, Jack is a good chap in many ways & a parson’s son & has just got over a Court Martial.\n","31":" Started on my new job this morning & what a time I had of it getting into the run of things, but I shall have the hang of affairs in a day or so all going well, no shortage of arguments either I might tell you.\n\nRaining like blazes again this morning when will it ever stop.\n\nThis evening after our so called tea Lindsay & I paid Len another visit & took our boots down to get repaired, our light ones I mean, Len can get them done more quickly than if I took them in to Warminster, before we left Len took us into the kitchen & we had enough, boiled potatoes cucumber & onions & tomatoes as we could eat & \n\nfinally finished up with a big plate of custard & jam tart, they live like lords down there, handy to have a brother in a job like that. We came home about 8 oclock & then went down to the Orderly Room, but could not find the list so I took the opportunity to write a letter, after an hour or so a chap came in & I asked him what about the Dental list, why they are here he said & fished them out from under a water jug, they had been there all the time, luckily it was only a short one so I was soon finished for the night.\n","32":" Soon finished my job this morning for on Saturdays they don’t have so many men to run through. Looks a little clear this morning but I suppose it will rain again\n\nGot my pass this morning which I applied for to go to Frome with Len to see some people he knew down there so after dinner I went across to the O.T.B so after some delay Len & I got away on bicycle & they were bike’s I can tell you one took his life in his hands riding or rather pushing them for they resembled wheelbarrows in this respect & neither had brakes of any description to steady them, cost us 3\/6 each for them, on our way we had to pass through Warminster so I slipped in & had a look at my negatives which I was having developed. I picked out what I wanted printed & on coming outside I noticed a chap talking to Len. I only glanced casually at him & did not recognise the chap, just then Len said to me do you know\n\nwho this is, I then had another look & recognised him at once Don Nicholls he has changed hardly at all, we had a bit of a yarn & then struck out, the road is a bonza all the way in about 9 miles & I enjoyed the ride in spite of the awful machines we were on, the country is very pretty all round here & the crops along the road are very good. Frome is a fair sized place, but with the funniest poky little streets as ever I have seen you can’t drive a horse & cart down some of them the town is built on 7 hills & is a fairly lively little joint & tons of girls knocking about but they were not of a type that appealed to me, we went to this friend of Lens & there were introductions all round of course & then some tea bread & butter cake & etc\n\n& after this a yarn to the girls & then we went out to have a look round the town & book a room for the night, after this we went & saw the \"Better Ole\" at the only so called theatre here, well it was the most rotten & stale thing that I have ever seen whatever the people could see to laugh & applaud beat me, I was yawning nearly the whole time & I was mighty glad when the show was over. I then went back to these people had supper & 2 other chaps & I rode back on our bikes Len having decided to stop the night, it was a glorious night & I really enjoyed our midnight trip, but half way I got a puncture which we soon fixed up, I eventually arrived home at 1.30 as I was coming across the parade \n\nground I was pulled up by one of our police patrols, they have them out at night time now keeping a sharp look out for strangers, & sandbaggers, last year it was not safe they say to walk from our huts to the mess on your own for these same gentlemen, but they seem to have them well under hand now.\n","33":" Went round to the Orderly Room & fixed my Dental Rolls up for tomorrow. Graham gave me a hand, so we soon finished After tea this evening Lindsay & I went across to see if Len had got back, but so far he has not put in an appearance, must have struck something good at Frome what a job he has got just does what he likes it seems, as soon as we put our foot inside the Mess\n\nthe cooks insist upon us coming into the kitchen & having a feed they treat us to some order, but we only had a cup of tea for we had not long had our tea, it’s a funny Mess this evening they had 2 girls entertaining them in the kitchen, some of the Sgts girls I suppose for every one seems to have a girl round these parts youre out of the fashion if you don’t, so far Lindsay & I are in the cold, & I have an idea we will both remain there unless something a little above the average come’s along. After leaving the Mess we set out for the lake & there we picked up McKeown & Roy Cattell, so the 4 of us set out for \"Heavens Delight, & no doubt the scenery is magnificent, I have seen\n\nnothing in England to compare with it, the wood belongs to the Marquis of Baths estate, it was lovely wandering among the shady old beeches oaks firs, pines & etc. & we eventually arrived home about 10 oclock after calling at the Mess & eating a whole tart between Lindsay & I, some feed I tell you & we were hungry for we had just finished an 8 mile walk, from here we had to call in at another Mess & of course more sandwiches & cake, some day I can tell you.\n","34":" This is what they call \"gutser day here, every one in the Camp is examined & classified & of course a good number are marked for the OTB. & once you get there you get saddled up with rifle packs gas bags & etc. & in 3 weeks time you are in France\n\nhelping to keep the beastly Hun back a position no one envies, I don’t know what they marked me not A.3 I know the Dr just sounded me & said \"right oh\" It has been frightfully hot all day & I have been sweating like a cart horse after tea this evening I went down to Warminster with my tunic I’m having the collar lowered a little at the back & then she will be a beautiful fit. I had to go to 3 different shops before they would take it on, all are full to the eyes with work & tailors they can’t get for love nor money.\n\nI finished my rolls in about an hour this evening I am beginning to understand the runs of things\n","35":" Very very hot today & I am just like a grease pot, there has been great ructions & raids all the day through the Camp, but they\n\ncan’t catch many, I think our hut the Sgts is the worst of the lot, they have been very inquisitive about our Dental Parades too, making things a bit of a welter alright.\n\nThey have got a lot of men picked out from the various Camps round about to go to London for the Guard of honour for the opening of Australia House which takes place on the 3rd of August, they have picked out all the big men for this which is only natural for we want to make the best possible impression, only decorated Sgts are going.\n\nA big batch of men has just marched in from Hurdcott.\n","36":" Went & saw the boxing last night, one or two of the fights were alright but there was nothing hair raising about it.\n\nwhile there I took a couple of snaps with my Kodak.\n\nHave had a very easy time this morning, got hold of my job now.\n","37":" Jack price arrived from France today to go on the permanent Cadre, Jack has great tales to tell of the doings in France & of how they are putting a lot of Australian officers & N.C.Os among the Tommy regiments & they are going to try & teach them what they know about soldiering bit of a change when one comes to think of other days, 1 officer & 1 N.C.O to a platoon is the order, & they have full charge, the worst of it is that they had just come out of the line & had to go back with the Tommies, 2 of our lads have been killed already, according to Jack they think the world of the Aussies.\n\nThis evening Jack, Lindsay & I went down to the O.T.B. & had dinner with Len, there was a great gathering of C. Coys Sgts, out of the 12 1st Battn. Sgts there 8 of them belong to C. Coy. some going isn’t it, I should think so. Got a batch of photos this evening from Warminster & they were very good.\n","38":" Bit of excitement in the Camp today, a certain Sgt. named Willis was put under arrest for supposed stealing a sum of money totalling £16. I was acting Sgt Major at the trial & heard all the evidence, I got my own back on our Sgt Major in a quiet way he was a witness in the case, & the day before I was one also & when he marched me in, he used to do it regimentally, so my chance come this afternoon & I took full advantage of it, when he was wanted\n\nI used to call out his name, call him \"to attention\" \"quick march\" \"left incline\" \"right incline\" halt\" & then tell him to \"salute\" rubbing it in properly I could scarce keep a straight face & the officer also was grinning for he knew what I was doing it for. the case is not finished yet & Willis is getting a D.C.M.\n","39":" Nice morning after the heavy rain of yesterday & things are quite cool. The Guard of honor left here yesterday for the opening of Australia House. After compiling my rolls I went down to the TB. last night & saw quite a number of old hands.\n\nAfter dinner today Lindsay & I went for a walk we struck out in a different direction & came out on a pretty little scattered village, we strolled about for a \n\nwhile, & then feeling hungry & thirsty we asked an old woman who was cleaning the church out if there was any place where we could get a drink, she said if we went across to the big Manor House we could probably get something, so over we went, it was a lovely old place & I rang the old bell hanging outside a lady came to the door & I asked her if she could do anything for us, come into the drawing room she said, we wondered what on earth we had struck as we followed her she led us into a beautiful room full of bonza easy chairs & sofa’s. she asked us if we would like to see the old library which was very ancient we saw it, & then the garden, after this we had our tea & then walked home for tea\n\nthen after tea we went down to the O.T.B. saw some of the lads & then went to the pictures, just as we were coming out I spots Len & his girl coming up the road so we stopped & Len introduced Lindsay to his girl & we all four then walked along the road towards our Camp about half way we parted for it looked like rain, so Lindsay & I pushed on & went into the canteen & had some tea we take turn about in buying this & tonight it was my turn so when I took the spoons back to the girl to get my deposit I handed them to her clean ends first she seemed astonished & she said in a loud voice so everyone in the room could hear Well Sgt you are the first Australian who has ever handed me the\n\nclean ends first, don’t make it too rough I said as I walked off.\n","40":" Anniversary of our declaring war today & still the ends seems very little nearer.\n\nThis morning I went down to where Lens girl is stopping, for the 3 of us were going for a stroll, it was a nice morning & we wandered about till 4 oclock then we went up to the Mess, I had my dinner here & then went on to our Camp, & in the evening Lindsay & I went down to Warminster here we met Starkey & the 3 of us set out for Freshwater, & after a walk round the lake we went home & so ended a big day walking for we must have covered a good 20 miles for the day.\n","41":" Looks very much like more rain today for it is very hot & overcast\n\nGot a few snaps today from Miss Jervis which she took while I was in Birmingham.\n\nPassed the Dr. again this afternoon Lindsay came a gutser, got marked A.3 which means Active Service, but he has got his teeth to be finished yet. Great rumour flying round that the 1914 men are all going home shortly.\n\n6th. Rained like blazes out on parade this morning, consequently no roll was called till we marched our various parties into the Assembly sheds, I had to go through the torture of sitting in the dentists chair & let him bore 4 of them out, no one knows how I dread such a thing as this the dentists say that I will have to have a back tooth pulled & a small plate fitted before I am fixed up something to look for-\n\nward isn’t it?!\n\nMade out an application for leave this afternoon think I will go down into Wales for a change.\n\n7th. Very hot & sultry today looks like more rain brewing, the hot weather over here is much worse to put up with I think than our Australian heat but the reason may be why we feel it so much is on account of the heavy & close clothing we wear, there is practically no air circulate through our clothes I often wonder how on earth we are going to take to work when \nwhen\n this war is over. As you know my hands are as white as snow & as soft as a womans I have done no manual work these last 2 years to speak of for a Sgt lives the life of a gentleman & is generally waited\n\nupon no matter where he is, theres no doubt but it’s a life of ease, with the exception of a few hard times now & again in France.\n\nTook all the names of the 1914 men this morning, looks promising, but no one is pinning any faith to it but all the same I am of the firm opinion that we will be back in Australia some time this coming winter\n\n8th Nothing much doing with the exception of the usual parades & arguments with our 3rd Div. C.O. Just at present cigarettes are very scarce the men have a job to get them anywhere, this is on account of the alteration in the price which is coming, they are being reduced in price so no one will stock them, just as well I don’t smoke or I would be cursing like\n\nthe rest.\n\n9th. Have been doing a good bit of washing this afternoon.\n\nTrouble in the Orderly Room today over a few absentees, but I kept my end up alright, & talked my way clean out of it, am getting a bit of a bush lawyer, but all the same theres trouble brewing\n\n10th. More rows over the Dental people, from what I can gather, our Hqrs at \"Bhurtpore\" are shaking the Depots up about their slackness, & I can tell you our heads have got the wind up properly, so every little chance they get now up go the men before Orderly Room, this is right enough in one way, but it should have been done long ago I never saw such an ill managed Camp before, its chiefly run by 3rd.\n\nDiv. officers & to have these over 1st Div. men breeds a feeling of resentment & rebellion, for one & all down to the latest reinforcement considers himself superior to any 3rd Division therefore we all work against one another as much as possible. I should not be surprised to see a riot here any day for these 3rd Div. people are detested, we are a funny lot us \"Aussies\".\n\nGot a letter from home addressed to Mr Duke yesterday, they come much quicker that way alright than through the military.\n\nThis evening Lindsay & I went down to the pictures at Sutton Veney for the last night of a big 2 week picture was being shown, \"Protea\" was the name & it was very good indeed.\n\nA lot more of our chaps walked in last night from Hurdcott.\n\n11th. Have had a very easy day in the afternoon Lindsay & I went for our usual Sunday walk round the lakes up Freshwater way, it is very cool & pretty up there & everyone for miles around seems to collect there After we came home we had a wash & clean up then over to the canteen for our usual supper, we have this every night, paying turn about, our supper usually consists of pudding & custard & jam tarts washed down with tea, goes pretty well too I can tell you Received a batch of old mail today mostly early May dates, but welcome never the less.\n\n12th. The new order was supposed to come into force this morning, the order\n\nwas that there was to be a roll call & then parade each morning at 6.30 now this is a most unecessary thing for we are supposed to be in a Convalescent Camp, not a drill Barrack’s, however no one turned out for it, so this afternoon all the Sgts including myself were marched into the O.C’s office & he thereupon started to lecture us about one thing & another & he in the end detailed a Sgt to each hut for the purpose of getting the men out of a morning, he detailed me to 17 Hut, & I of course immediately objected for I have quite sufficient to do on my Dental job, after a little argument he struck me off & gave it to Holland the R.S.M. of the 10th Battn. If they are going to persist in this regulation being carried out there is going to be trouble for as I said before\n\nthe Camp is seething with discontent & only wants a little match to start the mob going, they can’t do what they like with the Australians, all the men swear they are not going to go on parade & I only hope they stick to it. Had a very small Dental List last night & I soon finished, then Lindsay & I went for a walk down to Sutton Veney, it is lovely over here of an evening strolling down the leafy & flower strewn roads & lanes. Our usual medical inspection & classification was held today, I went up before old Von Hagen as one of the examing Drs here is commonly called he marked me the same as before B.I.A.2 he gave me a haul over with his instruments I am getting much stronger now & am beginning to feel very fit, only I am very weak & sweat freely.\n\n13th. Well this has been a red letter day without mistake, the trouble all started over this early morning roll call, for none of the huts would get up for it this morning, no not even for the officers & they tried their hardest, the consequence was that 6 chaps out of the Artillery &","42":" Div were shoved in the clink for a crime that every man in the Camp was guilty of, this so enraged the mob that they swore they would not go on parade until they released the men from the clink, & when the bugle sounded the \"fall in\" not a single man budged you should have seen the officers running about trying to get them on parade but no good, the 2nd Div fell in & I just got round to the Coy. parade ground to see a pretty\n\nlittle scene, none of the others were on parade, so when they saw the 2nd Div. \n\nsquibbing it they came down in a body & started shouting all sorts of things, the 2nd Div. could not have properly understood the quarrel but when they saw the rest were not going on, they immediately broke loose with a cheer & joined the rest of the mob, things by this time were getting rather interesting & the mob were in an angry mood, the officers tried to stop them but they were powerless, down they went across the parade ground to where the 4 &","43":" Div were doing physical jerks, they were not long in convincing them to join them for the average Aussie is generally spoiling for a fight, & this kick against authority was right into\n\ntheir mits, things began to look serious I made sure they were going to start & tear the hated L. Horse Majors hut to pieces it would have gone hard with him had the boys caught him, but no they made straight down to the clink several thousand strong & demanded that the men they arrested should be set free at once or they would pull the hut to pieces & they meant it too believe me, for our lads will stick at nothing as the riots at Etaps Rouen Wareham & etc will prove, they look on it the same as a battle, the Colonel was not long in granting this request & a great cheer went up when the lads were let out, but it was not over yet by any means for they streamed up towards the Orderly Rooms & demanded their pay books so that no further action\n\nshould be taken against them, then the amusing sight was to be seen of the boys rolling the empty beer barrels on to the parade ground so as the speakers could mount them & be seen & heard all round, the first man up was a Colonel of the","44":" Division Artillery, he asked them what their grievance was & heard a lot of the complaints some of which he agreed with & some he didn’t, after this had been going on a while the Colonel of the Right Wing turns up & he takes the barrel he tried hard to convince them to go back on parade for the G.O.C. was coming to pay the Camp a visit & you may guess how the heads wanted them to see this sort of display, but it was no good they insisted upon cutting the early morning parade out & also that they should appoint\n\na delegate to see General McKay & lay their complaints before him, at last the old Colonel consented, & the meeting then broke up quietly but they would not go back on parade about 10.30 the General appeared on the scene & everyone was marched down to the parade ground to the conference that was about to take place, a big circle was formed round the General & his officers a table was placed in the centre & some chairs for the delegates, it was the most peculiar sight as ever I have seen in my military career, there was the General seated opposite 2 privates who were the mens spokesmen & spread out all round were the officers & round them again the men numbering probably nearly 4000, the sun\n\nwas shining brilliantly & I suddenly thought of my camera for a snap of a crowd like this would be worth something, I knew what risk I was running when I bolted across the parade ground & up to my hut for the camera, coming down I hid it in my pocket, & once I mingled with the dense & eager crowd round the ring I was fairly safe, the lads let me through eagerly for they knew what risks I was running & they gave me all the assistance they could, at last I got to the inner circle where I could get a fairly good view & after a lot of manouvering I succeeded in getting 3 snaps of the officers & delegates of this peculiar meeting, it reminded me of the Russian Committee of Soldiers just after the Revolution, I must get these developed\n\nas soon as possible, during the day I took 6 snaps of one thing & another. Well to cut a long story short, the General got up after it was all over & made a short speech & told them how wrong & etc it was of them to do this sort of thing & he hoped it would not occur again, he spoke in turn of the grievances placed before him by the delegates, these (the grievances) were a few of them, no motor riding allowed or train journeys on weekends the cutting off for so long during the day of the water supply, Mess Orderlies having to come on parade, Dental Parades on Saturday afternoon & Sundays, the cutting of hair in the \"clink\", excessive punishments for a few hours AW.L. & of course the cause of all the disturbance, the early morning\n\nroll call, in almost every case he decided in favour of the men, & cut the roll call right out, so the troops had a most decided victory, my little prophecy came true after all sooner than I expected, I could see it sticking out a mile, I am beginning to think I can judge people & their emotions, especially the \"Diggers\" it was most amusing to see the Tommies & their expressions when they saw what the \"Aussies\" were doing, they would no more think of such a thing than fly in the air, we have a number of them working round our Camp mostly Labour Battns., doing all the sewerage & drain work. The afternoon parade went off alright & things have assumed their normal course once more, but this has been a lesson for the officers & some\n\none is going to cop out.\n\nI have just finished an extra heavy list tonight of Dental parades.\n","45":" I had an astonishing big parade for Dental this morning this was on account of yesterdays disturbance & there was also a big Orderly Room for one thing & another & I was an unwilling witness on a lot of the cases, though my evidence got a lot dismissed so that was not so bad. This dentist has got the wind up me each time I go down he says after looking at my teeth, \"right oh Sgt. I won’t touch you today, its too big a job just at present,\" so thats sounds promising.\n","46":" Very hot again today, but one can notice that the evenings are getting much more chilly & nippy that’s how I like them\n\nGot my ticket for my weekend this afternoon. I am going down into Wales for a change.\n\nOur hut was in a nice state last night some of the lads had been having a night out, & they kept it up till about 2 in the morning consequently sleep was out of the question especially as buckets brooms & etc were freely flung about, & from what I can see of things she will be the same tonight for I was over at the O.T.B. this evening & some of our push were holding the floor to some order & singing & shouting as if they owned the joint once again I must say in this little book how I detest the very sight of drink, & my experience in this war will always keep me from indulging in the cursed stuff.\n\nI have had for once a very easy day, to fill in the time I have been getting ready for tomorrow.\n","47":" Drew my leave money yesterday & paid my Mess bill which at 6d. a day soon runs into money if let go too long, also paid my money for tickets to Wales.\n\nHanded over my Dental job this morning to Sgt. Bourke he is going to take it on while I am away, I’ll bet he will curse it for a start Left Warminster for Cardiff this afternoon, our train was only an hour late but that seems to be nothing these times, had a fairly slow tiresome trip to Bristol where we had to change, we were delayed here about an hour before we got clear, & arrived in Cardiff at 9 oclock, she appears to be a good sized place & very dirty\n\n& grimy this is of course on account of the tremendous amount of coal that is handled here for all parts of the world. I have put up at the Railway Hotel, 6\/- bed & breakfast seems a nice quiet little place & very clean, it is now 11.30 I have been round the town & have returned & am now sitting in my bedroom scribbling these few lines before retiring\n","48":" Here I am hard at it again buts its only a little after eleven tonight, a West Australian chap & I have been knocking about all day, it was raining a treat about breakfast time this morning but thank heaven she cleared up about 11 oclock, during the morning we knocked about the town & went in & had a look at a Wax Work show, there are some horrible things in there alright, enough to make a man sick\n\n \n\nhad dinner at a flash restaurant & then went out to Barry Island by train to the sea, here we had a good old time in the water it was the first time I had had a dip in the ocean for a long long time & I can tell you it was splendid, after this we had a stroll round the beach & saw so curious sights, such as girls undressing & dressing on the sand no one seems to take any notice so I suppose its a regular custom, from here back to the city & down to the Louis Café one of the leading ones in the city, I had a dinner here last night & I was invited to a picnic the Staff are holding tomorrow so my mate & I are going to see what kind of a show they are pulling off we went to the New Theatre from here & saw \"The Belle of New York,\"\n\nwe had good orchestra stall seats & enjoyed the turnout.\n\nFrom what I can see of Cardiff she is famous for 2 things one is the enomorous amount of coal that is lying about on the wharves trucks & in fact everywhere, & the other is the number of colored people that there are knocking about the Streets just stink of them, the most I have yet seen in any English town.\n\nThis is a bonza hotel we are stopping at they are so obliging & kind, quite unlike any other place I have ever stopped at, when I went to pay my bill this morning they refused to take the money, its alright she said you can pay us when leaving, I should imagine they are taking a bit of a risk for one could easily slip off without paying them, & lots\n\nof chaps wouldn’t think twice about it either, but theres not too many soldiers stop here I can see that with the exception of officers for it is a bit of a swell place, the rooms are beautifully got up especially the drawing & breakfast room’s the latter is done in red & white & is something lovely to rest in & they have all the tables decorated with creamy & golden flowers & it looks tip-top with the snowy white linen & silver cutlery, the drawing room is in green & white & filled with beautiful palms flowers statues pictures & etc & wherever you go there are splendid carpets & every possible convenience\n","49":" Went for a bit of a walk this morning round the residential part of the town there are some very pretty streets & houses & flowers abound the streets are the equal of any city\n\nI have yet seen take them all round that is the footpaths for they are nice & wide thank heaven the sun is trying to shine this morning & I hope it continues to do so for it will make the picnic much more enjoyable.\n\nWell we met the girls this morning at Cardiff railway station we just got there in time & talk about a squeeze we all packed in anywhere I rode in the guards van myself, we went out as far as Barry & then walked to the beach at Barry Island, we had about 20 girls (all business girls) in our crowd & there were some very fine one’s too, I soon singled mine out to my idea she was a beauty & no mistake I never saw a girl with such a mass of beautiful dark brown hair & her complexion teeth & eyes were splendid theres no doubt but she was a lovely girl & I spent one of the most \n\nenjoyable days of my life in her company we all went bathing for a start & had a rattling good time teaching the girls to swim & shoot the breakers which on this beach are pretty good, it was a lovely sunny day so after we came out & got dressed we all laid about in the sand & the girls all let their hair down so as it could dry, this was how I came to notice my girls lovely hair I should certainly have thought it was false otherwise, her name was May Devereaux, after we had our dinner we all went for a stroll & during this I took a few snaps with my camera to help keep alive & fresh a happy & clean day, we strolled about till 9.30 which time found Miss Devereaux & I down on the \"Pebbly Beach\" this is a most remarkable place all the pebbles are sorted out & laid in nice rows\n\neach row being of a different size to the other, the time slipped by like lightning & it was with a shock we realized it was so late so we had to make tracks back to catch our last train, we just caught it in time & by 10.45 we were in Cardiff I then took her home & then walked back to my hotel after spending what was to me the happiest day of my life with a bonza & beautiful girl, they live in a good part of the city \"Riverside\" her father \nis\n was a captain in the Merchant Service but died just when war broke out so the girl has now to work, I will say this much she was one of the most decent & well spoken girls \nI\n as I have come in contact with in this country & the man that gets her should consider himself lucky, I should have a fly myself only I’m afraid these sort of girls will be of such little use in Australia that they would be of little\n\nassistance to me in my future carreer otherwise I should certainly see more of her \"oh these English girls they are heart breaker’s & without a doubt beautiful.\n","50":" Just at present I am sitting in the breakfast room writing this, I have just had my breakfast & am now waiting for my mate to come down & we are then going out somewhere.\n\nThis morning Anderson & I went & had a look at Cardiffs Public buildings, they are very fine & set in pretty grounds, the building where Lord Rhondda of rationing fame kept his promise of giving a lot of works of Art after being rescued from the Lusitania is a very fine one & I don’t think I have seen a better interior anywhere with the exception of perhaps Glasgow all the immense pillars are of fine red Italian marble & they look\n\nsplendid giving the whole place \nof\n a look of statliness & beauty, the statues Lord Rhonnda had erected are very nice there are 12 of them all told & they are not quite finished yet, there are also some good pictures in this Gallery, the \nMuni\n City Council Chambers are in this building & we had a screw at them, we intended going out to Roath Park & Lake from here but the weather looked so threatening that we thought it best to beat it for our hotel & put our cameras away, on arrival I was met by the page boy, & was informed that a young lady & gentleman by the name of Foster had called while I was out but had left a card & said they would call again after lunch, these were my Maesteg friends so I waited till they came back shortly after dinner & then we all went out to Victoria Park, saw the \n\nseals, monkeys birds & etc, then back to town again for dinner at the \"Louis\" & from here we had to go to the Railway station for they were returning that night I saw them off, then I went down to see my friend of yesterday & arranged to take her home after she finished her work this was not until 10.15 so I went to the theatre to kill the time, & as soon as it was out I slipped round & met Miss Devereaux then we walked home I suppose anyone who reads these lines will think me silly when I say that I am almost gone on her, I cannot understand myself of late, I have met now some hundreds of different girls but of them all this one attracts me most she is such a refined & nice spoken girl & as handsome as they make them in fact she has almost turned my head, & its just as well\n\nperhaps for my peace of mind that my leave is just finishing for I am certain the more I see of her the more I should like the girl having to work for her living has improved the girl if that could be possibly done.\n","51":" Rose rather earlier than usual this morning 7.30 & slipped down to breakfast thinking to find the room empty but on the contrary it was full so I gained very little by it after dining my mate & I went down town for a stroll & slipped in to see the girls for a minute after this we went out to Roath Park & Lake they are both very pretty & the flowers are something lovely the finest dahlias I have ever seen are in these gardens, Anderson wanted to catch the 1 oclock train so we hurried back & had dinner at the Louis then round to our hotel & over to the station but arrived there just about 3 minutes too late.\n\nthe next train left about 3.35, so to put the time in I suggested that we should go down to the Corporation Baths & have a Turkish bath so away we went, I had never had one before so the proceedings were interesting, first of all after buying your ticket you go upstairs to a nicely furnished & well fitted up room, here we were met by the attendant who was clad only in a loin cloth, he showed us both into a little curtained box where we undressed & put a soft towel round our waist & then he took us downstairs as soon as you stepped on the stairs you could feel the heat getting stronger, at the bottom of the stairs he opened a door & showed us into a room \"gee whiz\" talk about hot the sweat started to stand out on our bodies immediately there was no steam only a fierce dry \n\nheat there were 3 rooms leading into one another the temperatures ranging from 160 (degrees) to 220 needless to say we did not patronise the latter much it was like a little Hell, we sat down on chairs for a good time & they were red hot, ½ an hour we had to stop here & when we had enough we had to ring the bell for the attendant I can tell you I was mighty glad when the time was up we were covered with sweat dirt & grease & our cloths & chairs were saturated & our heads felt like bursting you could see the dirt on our bodies quite easily, I came out first & we went into a little room & laid down on a marble slab which had been washed down with warm water, on here I got a good spraying with water & then massaged all over with rough gloves & soap then more spraying & rubbing & then into a bonza shower which fairly bit into your body\n\nthis shower cooled me down gradually & then we went out & had a plunge in the cold water bath, by this time we were as white as snow & feeling fit for anything from here we went into the hot room again & had a good rub down with a rough towel & then upstairs & onto a couch & covered up here we had to stop until we regained our normal temperatures, when we got dressed, just before we went into the bath I weighed myself stripped & just tipped the scales at 9 st 10 ¾ lbs after coming out I weighed again & I was exactly 1 ¾ lbs lighter that gives you an idea how it pulls one down, we were an hour & a half going through all these processe’s, & when it was all over I never felt better in my life, we then walked back to our hotel settled our accounts & made over to the station for our train, we had a fine journey back\n\nfor a wonder we did not have to change for we struck a through train which took us right to Warminster.\n","52":" Back again in Camp & am doing a loaf this morning, while I was away old Billy Hughes paid the Camp a visit I should have liked to have been here with my Kodak & got a snap or two.\n\nThere was a bit of fun here this afternoon a lot of the \"diggers\" were playing \"two up\" when a fight started over a bet, & they got to one another like mad, I grabbed my camera & rushed out in time to get a snap at the contestants.\n\nHave been writing practically all the day have penned 9 letters some of them fairly long ones at that.\n","53":" Took over the Dental work again this morning so I will be kept busy once more, I am feeling absolutely grand now & fit for anything\n\nWent over & saw Len last night he tells me he is going to France at the end of the month.\n\nThis morning I got a letter from Horsferry Rd. advising me that they had received my medal & that it would be presented to me at the earliest opportunity at a parade in England, I was beginning to wonder what had become of it, for I had heard nothing more since February when it came out in Battn. Orders & was read out on parade at Meteren.\n\nFrom what I can gather, I believe the 1st. Division has been badly cut up in the last advance round Libons.\n","54":" Very cloudy & it looks a lot like rain this morning quite a change to the hot weather of the last week or two & I am not sorry for the change\n\nLindsay Graham has just turned up from his leave 2 days overdue.\n","55":" Nothing much doing today save that I had an hour of the dentists joyful company I’m afraid to think of the boring hooking, scraping, spitting & etc. that I went through, in the evening Lindsay & I went down to Warminster to do a little business, on the way back we met a couple of our officers & had a yarn.\n","56":" Raining today quite a change to the hot weather we have been having of late, have put most of the afternoon in writing letters. \n\n This evening 2,4th Battn. Sgts O’Grady & Joel & I went over to the big Y. M. C. A. at Green Hills to attend a lecture which we thought was to be given there but instead to our disgust it turned out to be a \n\nreligious meeting, & the best of it was that we had to stick it out, for in our anxiety to get a good seat we went up the stairs & sat on them & in no time the crowd swelled right up to us & there we were penned in like sheep for a couple of hours while a wowser shot all sorts of insults at us, we wont be caught like this a second time Ill wager\n","57":" Nothing much doing today I was supposed to have my teeth attended to but just when my turn came round a lady called to see Scotty\" & I knew that was the end of things so I buzzed off quick & lively live & let live you know!\n\nHave got no Dental rolls to make out tonight for a wonder, the reason of this is that they are paying the whole Coy. in the morning & at the \n\nsame time collecting all our old books previous to issuing an entirely new class of book & while these are held of course we can get no money so they are paying a couple of weeks in advance, a good thing for the \"two up kings,\" they are busy wherever you look some of them will be \"stoney broke before night & spongeing on their mates for cigarettes drinks & etc for a good 2 or 3 weeks, that’s one of the great objections to gambling.\n","58":" Everyone has been paid double so for the time being all are happy, I can see some rough nights in store for there are bound to be plenty of drunks after all this wealth being distributed among the troops, for money burns in the majority of their pockets & to some it is the height of their ambition to roll home drunk.\n\n \n\nThe afternoon has been spent playing larks on one another & we have had a rare bit of fun, I was the first one to be bit, just after dinner a runner came round to our hut & said I was wanted at the Orderleys Room, round I went but they knew nothing about such a thing, when I get back to the Hut I never said anything about my being had, but told OGrady that he was wanted by the Capt at once over a Warminster piquet, this put the wind up him for work in any shape or form is the last thing on earth the average Sgt likes over in this part of the world, truth to tell we will all spend more time & trouble dodging & scheming out of parades than if we were to go on them. Sgts are recognised as\n\nbeing far more trouble than all the men put together, for each one considers it his duty to do as little as he possibly can when going through the various camps in Blighty\" , but I am wandering from O’Grady, down he went prepared to argue the point to the last with the Capt but on getting round there he drew a blank, we all cracked our sides laughing when Jack came rushing in, oh he was wild but he had to laugh in spite of himself, but for the rest of the afternoon as each chap sneaked in off parade he was told to report to the CSM. at once, wanted for some special reason or other & every one fell to it, we nearly died laughing, & then we made a dummy man in Possingham’s bed & at tea time told him that some big drunk had walked in uninvited\n\n& had gone to sleep in his bed, you should have seen the look on Possy’s face when he pulled the blankets off the supposed drunks face, laugh I nearly died!! & in fact we all did. Lindsay & I paid Len a visit over at the OTB. last night, we played \"bridge\" till fairly late then came home in the moonlight. I hear just after we left there was a big row there, & Len threw a couple of them out by the scruff of the neck, he went on his final leave today before going to France.\n\nHave not long finished a big Dental roll for tomorrow, & it is raining drearily though not very heavy. Lindsay & I have just come in from the canteen where we have just had our usual supper\n\n& I am sitting at our little table trying to scribble these few lines in my old diary The other day a chap from our Battalion came up to me & asked me if I knew Bill Barwick, he told me he was in the next bed to Bill in a Surrey Hos. I think he said & Bill told him to tell me that he had got a bullet through his knee & would be going back to Australia when fit to travel, I feel sorry for poor Bill for he was such an athletic chap & this is bound to affect him probably give him a stiff leg for life\n","59":" Have had a pretty quiet day no trouble with the Dental people on this afternoons parade down at the Dental Rooms we bumped all the Australian Press representatives who are over here looking round this country, one could easily see\n\nthat this batch were \"Aussies\", & when some of them leant up against the huts for Support, that gave the show right away, every one over here remarks about that habit of the Australians, oh we look a tired lot, but looks are deceiving, very, & I daresay old Fritz can testify to that same for he knows something about the whirlwind habits of the finest troops in the world?\n\nAfter I finished my Dental Rolls tonight Lindsay & I went down to see Jack Price he is in hospital here got a swelling in the groin, after leaving Jack we went down to the Y M. C A. in Sutton Veney had some thing to eat & then home.\n\nTheres a very peculiar & remarkable thing that I have noticed in our Mess & for that matter wherever our Divisions\n\nare together, & that is the way we all quite unconsciously sort ourselves out, you will rarely see the Divisions all mixed up sitting at the one table, somehow we all seem to drift into our various Divvies & stick together, this is very noticeable in our Mess where Sgts are constantly coming & going, I don’t know why this should be for we are all Australians, but there seems to be a sort of brotherhood among the Divisions & this always attracts, thats the only explanation I can put forward, or perhaps its due to that admirable thing \"esprit de corp\" or pride of regiment, for each Div. always thinks there are none comparable to their own which is quite right, although they will argue & tear one anothers units to pieces let an outsider only hint at some fault of any of our Div-\n\nisions the whole push will turn on him & tear him to pieces, exactly the same as anyone interfering in a family quarrel\n","60":" a bit of washing today I am getting quite particular over here as regards the clothing I wear, compared to what I was a year or so back I am quite a dandy, wonder how long I can keep it up, I have an idea I won’t slip back into the old \"anything will do style\" anymore, England & the girls work wonders with a chap alright, at least I think so but I suppose that will be for other people to judge.\n\nIt has been a glorious day, just hot enough to be pleasant, Autumn is beginning to make its appearance. Lots of the trees show signs of coloring off & the nights are cold & nippy, just the weather for sleeping, especially of a \n\nmorning, do you know we never get up till 7.25 then there is a rush for breakfast & a wash, not bad times are they when one comes to consider things\n","61":" Have had a very light Dental List for today, consequently I have had very little to do & time has hung heavily on my hands.\n\nThis evening I went across to the OTB. thinking to see Len, but on arriving there I find the joint in a perfect uproar everyone was excited & all were talking together by the way they rushed me I wondered what on earth could be wrong, I was soon informed of the trouble it appears that Len should have been back last night, but before leaving he had made it up with the heads that if the draft was not leaving till Sunday or Monday\n\nthey were to wire him a 48 hours extension which they did this morning, now word had just come through to say that the draft would be leaving tomorrow at 3 P.M. & they could not get a wire through in time for him to be down, so they asked me for advice, at last I hit on the way out, my plan was this for Chunder to go to the Orderly Room & get the Sgt to make out a form & then get an officer to sign it & make it an urgent priority telegram On His Majestys Service, that’s the only way we could get a wire through for the offices are all shut to the public after 7 P.M, we got this done & then I took it as quick as I could down to Sutton Veney P. office the officer in charge reckons he won’t get it before 9.30 in\n\nthe morning, it will be alright so long as he can catch the 12.27 from Paddington that will land him at Westbury by 2.30. & its only a little way from there to Warminster, we are going to make arrangements in the morning for Chunder to answer his name at 3 oclock when the draft falls in, if Len is not there, & we can fix it up with the R.T.O. at Warminster, so if Len can reach Warminster by 5 or 6 oclock he will be right, its going to be a tight race I hope he gets here in time otherwise there will be trouble, for as it is Len is AW.L. this sort of thing happens pretty regular for the Sgts work things among themselves for extensions of leave & etc, its pretty easy once you get into the know but this time she will be a close shave\n\nThe camps the last night or two have been chock full of drunks, that’s the result of a double pay I’ll bet in a few more days 90 % of them will be \"Stony\" & \"bumming\" for the next fortnight & whats more all the Sgts Messes are having free nights one Mess at a time so the Sgts have been well looked after but they are a fairly quiet lot, what we call decent drunks, come home & get to bed quietly & keep no one awake bit different to a lot of the Diggers, they argue, row, sing, swear, & fight half the night I can hear them at it now as I scribble these few lines before turning in Looks as if we are going to have a wet day tomorrow for a thin drizzle is falling a little heavier than an ordinary \"Scotch Mist\", stiff luck if we have another wet week end, they are the limit for making things miserable\n\nA big batch of men came in to the O.T.B. from \"Hurdcott\" today.\n","62":" Have got a slight cold in my head the first I have had for ages, they are complaints I seldom suffer from at any time.\n\nWell I went over to the OTB on the off chance of seeing Len this afternoon I thought there might have been the luck for the telegram which I sent last night to get through in time for him to catch the 10.15 from Paddington, he got the wire as a matter of fact the same night at 11.30 & came down to Paddington thinking his train left at 10.35 & so missed it, he then wired on to Chunder & the Adjutant that he would be down by the 12.27 which he caught, I went down to Warminster & we had some tea in a little joint before the train left.\n\nI don’t care now how soon I get back to France now Len has gone, for theres nothing much of interest to me round here now.\n\nOn our way home Lindsay & I picked up Bill Graham & the 3 of us went in to the 1st T.B. looking for Digby who had just returned from his 6 months leave in Australia, we found him & he told us all about his experiences reckons they had a rotten time for the first 6 weeks no one would recognise them, but after they were found out they had a glorious holiday, I am jolly glad I did not get away now for we have our leave in front & things will be in running order when we get to Aussie so there will be no delay it was the same when first I came to England on the Cadre last year\n\nwe were among the first lot & it was the same we were treated rotten but things are different now & its one long holiday on them, old Digger was overjoyed to see us again & we brought him over & made him a Sgt Major & took him down to our Mess & shouted him a few drinks, & after this I took him over to his Camp.\n","63":" It has been a glorious day just warm enough to make the day pleasant, I have done nothing all the morning save sort some of my photos out I have hundreds & they take some looking after I also sell a good few especially groups of the Sgts yesterday I got 48 of a group & next Saturday I am getting 50 of another they are pretty good too. In the evening Lindsay & I went for our usual stroll, its very\n\n \n\nfunny nearly every evening we go out we meet 2 V.A.D’s somewhere on our track, we passed them again tonight & the whole 4 of us could not help but smiling if we run across again I’m hanged if I don’t pull them up, I fancy they are a bit like us a bit particular who they go with for I have never seen no one with them yet no more have they seen us with any girls so we seem to have something in common there, so just for curiosity we will have a yarn next time we meet\n","64":" The Dental Officer had a few men up for Orderly Room this morning but the majority of them were dismissed on my evidence.\n","65":" Another glorious & sunny day the weather of late has been remarkably good in fact one could not wish for better.\n\nHave been suffering from a slight attack of dysentery of late, the whole Camp has been more or less affected by it I fancy the water is at fault.\n\nThe war news in the papers seem’s to get better every day of late all the papers are at one in giving the Australians great praise for their magnificent performances of late, the capture of Mont Saint Quentin just outside Peronne seems to have set the seal on their wonderful records, for this was a most formidable fortress & one which held us up for a long time last year, yet the \"Diggers\" took it & its garrison in a single leap to their everlasting glory, the English papers consider this to be one of the finest single feats of the war, & devote a lot of attention & space in their journals to the far reaching effect this is likely to have \n\n& now this morning the Canadians have broken the formidable \"Hindenberg Line\", what England would do without her incomparable Colonial troops its hard to say for wherever there is any particular hard position to take there you will find the Colonials, in yesterdays \"Times\" there was an article on Australia cut from the Berliner Tagglebatt\" entitled \"Poor Australia, this went on to show how Australian troops were being ruthlessly murdered so that the English could walk over them, & it also pointed out that the Australians were more often mentioned in Army Reports than any other Group in the British Armies a certain amount of this is true but of course the main object of this sort of thing is to cause ill feeling among the Colonies & England, if the old \"Hun\"\n\nthinks this sort of piffle will do any harm he is greatly mistaken\n","66":" Last night our Mess gave a free night & provided a supper, this was done out of Regimental Funds for all the Messe’s have a large surplus on hand & this is one of their fancy ways of reducing such handy things, Lindsay & I looked in about 9 oclock but you could scarce get a foothold the place was simply crowded out & nearly suffocating with smoke & the stink of the spilt beer was sickening there were lots of officers there & as soon as I set foot inside the door Gribble spots me & tries hard to get me to have a drink with him but no good I got out of the situation by having a cigar instead & it was a strong one & nearly made me sick, I cant stand these strong cigars at any price, however\n\nwe got out of the place quick & lively & went over to the billiard room & had a game, Graham who is a pretty good player gave me 50 in a hundred for I am only a novice you know, at any rate I finished up by beating him by 12 points, after this display we went back to see if we could get a bit of supper, there was plenty of it there alright but the whole show was badly managed & the supper room resembled a ticket office in holiday time more than anything else I could compare it too, why there was scarcely standing room & blokes half drunk were running or should I say staggering about with a plate of blanc mange in one hand & a junk of cake in the other & the stuff kept slipping off on to the floor so you may guess what\n\nsort of condition the floor was in, we stopped about 5 minutes & then off to bed & left the drunks in their glory, most of the \"heavyweights\" (drunks as we call them) had to be assisted to the hut & then we had to put them to bed after what they would call a glorious night. The \"Daily Mail\" has been backing old Billy Hughes up properly over here, especially since Mertons took that writ out against him the paper has been full of people wishing to contribute money towards paying his expenses in connection with the Court Case, the majority of the English papers speak well of old Billy theres no doubt he is a good speaker & hits the Germans properly, & he just suits the Daily Mail for this paper is violently Anti-German & is always stirring public opinion against them it’s a jolly good paper in many ways\n\n \n\n& talks very plain & gives the Military Authorities some very nasty knocks, & fights very hard for the \"Tommies.\"\n\nThere have been a number of Lists taken round the Camps collecting money from any one who cares to give towards Hughes defence, one of our chaps collected £20 off the civilians round Warminster & then conveniently got robbed, not a bad stunt?\n\nThe war news still continues splendid & things look very promising, I believe every one in France have got their tails sky high & are as enthusiastic & anxious to get at old Fritzie as if they were going to a picnic, the moral of the British Army was never better & this is what counts, certainly they are fighting now as they have never fought before, & from all appearances nothing seems to check them.\n\nHeard last night that one of my greatest cobbers Jackie Hayes had been wounded & was recommended for the D.C.M. for a fine piece of work he did, captured nearly 80 Germans single handed & quite accidentally for Jackie true to the old days went souveinering in Chipilly the village that held the Tommies up, & stumbled on the bunch, there will be no one more pleased than I if Jack gets this for he is a splendid chap & he has been badly treated by the Military I have written to Horsferry Rd. today to see if they can put me on Jacks track so as I can go & see him I also made enquiries about Bill Barwick.\n\nWas highly complimented today on my work as Dental Sgt, the Capt said that I was the only one who had ever made a success of the job, & since I had taken it over things had\n\ngone splendidly & without a hitch, he said he would be very sorry when I would have to throw it up, that wont be very long now for my teeth are nearly finished & I am then ready for the O.T.B.\n","67":" Been a few thunderstorms today I got a drenching in one of them, but got changed before any harm was done. Had another spin at the dentists & he put the wind up me properly, got poking with the little fine piece of wire down some of my teeth feeling for the nerves he struck one alright & thank heaven he decided to kill it so he put some yellow looking stringy stuff in & said that would do for the day, the dentist reckons I will have to have a plate in so that looks as if I will be here for another fortnight.\n\nSome of the lads have just arrived home very excited with the news\n\n \n\nthat no more drafts are to be sent to France for 3 months, I wonder what this can mean perhaps they are going to shift their front to Mesoptamia there has been some talk of it lately but I suppose its only another rumour\n","68":" A big crowd marched into this Camp from Hurdcott, I expect we will have a few sand baggers among them for Hurdcott had an evil reputation for this sort of thing & murders have been fairly frequent so far they have only succeeded in catching one or two of the ruffians they work in a gang & some are of the opinion that they belong to not AIF. unit but they are simply hooligans dressed in our uniforms & they go from Camp to camp & live in the villages in civvy clothes during the day time, then at night they\n\nsally forth with a girl or two & waylay the lads coming home in the lonely places & knock them on the head, of the few that have been caught there is no trace of in our Force, I don’t know what they are going to do with the mongrels hanging is too good for such wasters.\n\nOne or two of the English papers of late have been making very foolish remarks about Australia, the \"Chronicle\" in particular, it galls them to think that Australia hasn’t got Conscription & they talk about Australia failing to rise to the occasion, I should like to see a comparison list published showing the real war efforts of the Colonies, Canada in particular & England, we have seen a few & we show out extraordinarily well no matter from what point of view\n\nthey are looked at from, & unlike England nearly every man we raise is a fighter, when we say we have raised 300 or 400 thousand as the case may be they are fighting troops & do something towards winning the war, but not so with England’s boasted numbers, why half of her so called soldiers couldn’t open the breech of a rifle let alone shoot, London & for that matter all provincial towns stink of kahki, but no they are not line soldiers but simply work in some office factory or anything to do with Government work & of course England puts a uniform on them & calls them soldiers, then every now & again she will skite as to how many men she has raised, if her troops only fought one half as well & as consistent as our few\n\ndespised \"Aussies\" this war would have been over long ago, its very foolish of English papers talking in the Chronicle strain for it only sows resentment among the Colonies, that little article which appeared in this mornings papers has set the whole Camp talking nasty things, & speaking for myself makes me boil with rage for it is such an untrue & false statement.\n","69":" Very misty & dull this morning but I think it is going to be a fine day after the sun breaks through. Lindsay Graham is going to the O.T.B. today so I will be left on my own for the rest of the Sgts are a pretty lot of heavy drinkers & their society don’t appeal to me in the slightest, I don’t think I will ever get over my hatred of drink\n\n& all the evil consequences that follow in its trail, in one way as I have said before if you don’t booze you are out in the cold to a certain extent, but even so I prefer to remain so rather than follow the drunks, not for me, & I know who is the best off at the end of the week both physically, morally, & financially, the money they spend in drink is astonishing & nothing but continued drafts from Australia can keep them going at the pace they set, I don’t wonder sometimes that the Government stepped in & limited the amount of money they could draw at once, for it is all to their own benefit only they or the majority fail to see it, but wait till the war is over I’ll bet they will then see how foolish they have been in squandering their good cash for practically nothing at all.\n\nHave been doing a fair bit of washing this afternoon getting things cleaned up in the flannel & sock line.\n\nWent down to Warminster this evening to get my prints but they had no glossy paper so did not print them but waited until they saw me, I am now having them done in semi matte. Warminster is a great soldiers town practically nothing else but then there are of course a good number of girls there of a week end they come from Bristol & Bath especially & are out to catch the mugs & their money.\n","70":" Another wet & miserable Sunday one minute its raining like blazes the next the sun is shining, so what is one to do, to kill time I am now down in our billiard room & have been writing all the afternoon still that’s poor sport of a \n\nSunday when one ought to be well out of the Camp.\n\nThese sandbaggers are getting to work round here again, the other night they killed an officer in one of the little quiet roads leading from Warminster to the Camp & there have been several more case’s of cracked heads, I reckon they should make an example of the first one they catch shoot him publicly & before the whole of the Camps make a big event out of it, the rest of them would not be so keen on it then I’ll bet.\n\nGot a parcel yesterday from the Wagga Comfort Fund Miss Duke is responsible for this, shes not a bad sort.\n","71":" Been raining fairly heavy on & off the whole day, I was to have had a nerve out but my dentist \"Charlie Chaplin\" as the boys call him had an abscess in his mouth\n\nso he was not working today.\n\n10th. Still showery with bursts of brilliant sunshine in between Another big mob arrived from Hurdcott this morning\n\nGraham came over this morning from the O.T.B. so we went down to the billiard room & had a game.\n\nPaid up my Mess Accounts this afternoon another","72":" gone bang. This evening after I had finished my work I went down to Sutton Veney to interview an old lady about washing my best tunic, I am taking it down tomorrow night.\n\nThere was a funny little thing happened a few nights back one of the \"diggers\" got hold of a Sgts overcoat & went into the Mess but he was unfortunate enough to get grabbed with the result that he was had\n\nup before the O.C. & he sent him along to the C.O, he refused the C.Os punishment wanted a Court Martial but the whole thing was too ridiculous & the C,O. persuaded him to take his punishment 14 days 2nd Field Punishment. this means that a chap doing F.P. has to sleep in the Guard room from 6 till 6. forfeits his leave & also pay, it is the common form of punishment in the A.I.F, but has its drawback’s, for it more often hits the good line soldier than the rotten waster we often get in our platoons, for instance this often happens, a man who is a real bad egg gets say a couple of years gaol, he does a couple of months & is then let out on 2 months good conduct trial if he keeps out of trouble for that time the rest of his sentence is washed out, now a good line \n\nsoldier will perhaps when he goes on leave to \"Blighty\" stop as is only natural a few days over & is therefore A.W.L, he is unlucky enough to get caught & in 9 cases out of 10 he will get 90 days 2nd FP. equal to the same number of pays, a pretty big slug in a mans book & it gives him very little encouragement to soldier on for until that money is paid up on his book he draws only 5 franc’s a fortnight, & the other joker though he has been convicted of a far more serious crime & is a rotten soldier can draw his full pay, & has more liberty to boot.\n","73":" Been very stormy most of the day it was very funny when we were on Coy. parade this afternoon I had just got my roll called & the men numbered off ready to march\n\non to the Battalion parade when down the rain came in torrents as it happened all our men had their overcoats on but at the rate the rain was falling everyone would have been wet through in 5 minutes & in addition to this hail was tearing down a treat, a lot of the Companies were standing waiting for the rest to move up so I started off with mine but it was too ridiculous so I gave the order for the man to get down to the Dental Rooms as soon as they could you should have seen the scatter, when the other men on parade saw this they off for their lives too & left a few officers standing there, they got the men on parade about an hour after, & nearly every one was wet through by the storm.\n\nI noticed a rather remarkable thing on parade this morning it was in connection with the band, every morning without fail while we are waiting to move off from the parade ground the men are constantly kicking up a row sparring, sitting down, or talking like old women in fact doing everything that they should not do & its impossible to keep them quiet, but this morning whether by accident or design I know not the band stopped quite close to us & played some very nice tunes & all the time the music was on they stood as quiet as the oldest & most disciplined soldiers could have, I could not help remembering that old couplet, \"Music hath charms to soothe the savage beast\" for here was a very good case in point.\n\nThis afternoon all the Sgts & W.O.s\n\nhad their photos taken for official purposes they rigged up a lot of tables & on top of these forms for the men to stand & sit on & just before the group was ready half the top row of forms & tables collapsed much to the enjoyment of all present its a wonder they did not crack their necks for they had a fair way to fall however we got things fixed in the end & the photographer done his job, when they are finished they will be 15 ft long & are going to be sent to Australia for exhibition something after the same style as our Battn. had at Meteren. Took my tunic down to a woman in Sutton Veney for her to wash & clean.\n","74":" Another large number of men marched in tonight from Hurdcott. This Dental job of mine now has reached about the culminating point tonight I had in fewer than 198 men to\n\n \n\nput on my rolls for tomorrow, this means that I had to write out at least 280 names, for a lot of them appear on both parades.\n\nThis evening a runner came round for me with a note to the effect that I had to report at once to Main Hqrs. So over I go & was informed that I was to report to the D.S.M. tomorrow at 10 AM. for the object of getting my Croix de Guerre, I am anxious to have a look at the medal for they say it is rather a nice one.\n","75":" Today is what some people would call an unlucky day seeing as how it is a Friday as well as the 13th. but to me it has been a lucky day for it was a Friday & a 13th when I left Tasmania to go to New South Wales & I consider that to be one of the best things I\n\never done in my life, & I suppose I ought to regard today as another landmark in my life for I was decorated with my \"Croix de Guerre\" this morning, all the Command Depot & a good part of the 1st T B. were there it was a lovely morning & the sun was shining nicely & there were 2 bands going to make things lively, there were 9 of us altogether & as each mans name was read out he stepped up to the General saluted him & stood to attention while the General pinned the medal on & the A.D.C. read out the narrative for which the medal was awarded When this ordeal was over each man saluted & the General shook hands with him & wished him all sorts of luck & etc, & then back to where you came from, which was\n\nin our case in the centre of the square when he had finished we were marched over to the saluting base & there we stood like stuffed monkeys with the medals pinned on while the troops marched past, & from here we went into the office & signed for our medals & so completed the turnout, & I was mighty glad when the whole show was finished.\n","76":" Went down to Warminster after tea this evening to do my usual weekly business, managed to get a film at last for my kodak but only one they only allow you to buy one at a time, on my way back I got a ride in a car as far as the 1st T B. & from there I walked down into Sutton Veney to where I was getting my tunic washed had a yarn with the woman, & then back to the \n\nCamp & then settled down to write letters & I have been hard at it nearly all the evening, it is now nearly 9 oclock & I am going to slip round to the Y.M C A & get a cup of tea before she closes for the night.\n","77":" Had a very quiet Sunday went out for a stroll & on arriving home found a telegram waiting for me but the address & number was a bit out at any rate I decided to open it & have a look I got a bit of a shock for it was from \"Harefield\" to say that Bill Barwick was \"dangerously ill\" & would I come at once, I couldn’t get away that night for all the office’s were shut up so I had to rest content till morning.\n","78":" Paraded to the Adjutant as soon as he set foot on the parade ground this morning, I only showed him\n\nthe wire which was sent by the sister he granted me 48 hours straight off & in a few minutes I had my pass & was off to Warminster where I was just lucky enough to catch a fast train which landed me in London at 1.55. As soon as she pulled in to Paddington I hopped out, slipped round to the cloak room, deposited my coat & bag & then down in to the tubes & in a few minutes I was at Marleybone Station & just had time to rush a hasty dinner & make a dive for the train to Denham so well did I judge it that I had just about 30 secs. to spare before she pulled out, on arrival at Denham I got a ride out to the Hos. in the Red Cross Cars which meet all trains & once there I soon found 29 Ward where Bill was, he was in bed & looked very thin & white on it, his knee\n\nwhich he had smashed at Meteren by a German bullet is just about healed but pleurisy had attacked him in a bad form according to Bill the Drs have been taking a lot of water from his chest I stayed a couple of hours with him & I believe I cheered him up a lot, before leaving the Sister took me into her room & told me the full strength of it all, she said the Drs were of opinion that the whole trouble was the cause of underfunding while Bill was in an English hospital he reckons he was starved to death nearly, & she also said that he stood a jolly good chance of going under for from all accounts he is far worse than he looks or thinks he is but she says he fights well & there is a chance that if they can get him to a warmer climate he will recover, he is booked for Australia on the 28th provided\n\nhe is strong enough to travel. I am going to write & tell his mother for Bill has a job to write at all, after leaving Bill I went back to London & went to the Criterion to see \"You never know you know\" its rather funny & I enjoyed myself.\n","79":" This morning I put in several hours down at Horsferry Rd enquiring about different chaps & etc. I found out about Harry Kelly & was personally speaking to an officer who was a prisoner of war with him, according to reports he is in pretty good health is not likely to leave Holland until after the war is over, they also reckon there that this 1914 stunt is a dead cert so you can guess how delighted I am over the fact, I have been certain these last 5 months as this diary can prove that I \n\nwould be home for Xmas & I am still of the same opinion. \n\n After leaving Horsferry Road I walked down Victoria Street & up Whitehall into Trafalgar Square & into the Corner House where I had my dinner I then decided to run out to see Lens girls people the Winters for they had written & asked me to come & see them at the same time I hated the thought of going there for to me they were perfect strangers & it might seem as if I was imposing on them however I made the decision & hopped on to a 53A bus to Plumstead the trip took me exactly 1 hour & 20 mins fare 5d cheap enough for the distance on arrival at Plumstead I strolled down Griffin Rd. looking for 130 at last after passing it once I spots it a rather nice little villa in a good street, with a certain amount of\n\ntemerity I pressed the bell & waited for developments in a few secs I heard light footsteps & I started to brace myself up & get ready for explanations & etc but to my surprise it was needless for a rather nice looking & well spoken girl opened the door & before I could even speak, recognised me as Len’s brother & asked me in, & shouted for Eva that’s Lens girl at the same time, I walked in to the Hall feeling & looking a bit sheepish & wondering what was going to happen next just then Mrs Winter comes in a nice homely old lady & on top of her Eva appears in a big kimono for she was in bed knocking up a bit of sleep seeing as how she is doing night shift, by this time we were comfortably seated & I was beginning to feel more at my ease after I\n\nfloundered through my explanations I intended to leave early but the hours kept slipping by & soon the time came for the last bus back to the city, they wanted me to stop badly but no I said I would have to get back at any price I did not want to make things too much of a welter naturally & they had treated me splendidly & I rather liked the whole lot of them & another thing it just seemed like home again & Nera thats one of the girls seemed a jolly fine sort of girl however after supper I said good bye & started off accompanied by the 3 girls for escort to the bus but before getting there they persuaded me to alter my mind & stop at the place for the night & catch a train to Charing Cross from the Arsenal Station in the morning so I did & instead of hopping on the bus\n\nthey took me up on top of a hill from where a good view could be had of the surrounding city with its millions of lights & the enomorous Woolwich Arsenal lay right at our feet sparkling with its myriad lights like diamonds it was a lovely moonlight night & that added to the attractions somewhat, the old lady was not so very surprised in one way to see me back, however the boy & I slept in a great bed together & I never woke till late in the morning I can tell you I was very pleased I went out there for they are a nice family & I like the girls I don’t think Len has made any mistake she’s a cut above the ordinary girl & so’s her sisters I am off out there again next chance I get & I hope it wont be so very long\n","80":" Got away at 8 oclock this morning & Eve & Alice came down to the station with me. I arrived at Charing Cross to time & went by tube to Paddington got my parcel out & into the train which was a very fast one the Penzance express a non stop to Westbury 120 minutes run good going, the country looks splendid on the way down, & we also passed hundreds of Tanks at some of the great munition works & as for shells well there were miles of them & aeroplanes racing the train all the way down, caught the Warminster train & soon was there & into a taxi with some officers who were going to the Camp so I just arrived back in time for dinner after a pleasant little 48 hours & here I am now at a little table thinking over my experiences.\n\nAs I was walking down to the \"Mess\" this evening I saw Albert McKenzie he has not changed much.\n\nAfter dinner having nothing to do I went for a stroll down to the OTB. to see some of the boys down there, I was hurrying along the road & I passed a group of officers when I had got a few yards away one of them sang, \"hey hold on Sgt a minute I turned round to see who it was, & to my surprise Major Jacobs came forward & shook hands he belongs to our Battn & is a real nice chap got knocked the night before I did round Straziele I walked a long way down the road with him & we had a good old yarn about things in general & this 1914 Stunt in particular.\n\nOld Brook’s who took my Dental job over has been driven nearly mad according to all accounts & there is \n\nno more pleased man in this Camp tonight than he is now I am back & am taking it over in the morning, it takes him exactly 4 ½ hours to do what I put over in 2 hours but of course I have got the run of the ropes & that’s a big thing in such a complicated job. It is raining heavily tonight I have been expecting this for it has been very close & muggy all day. & rain is quite a common thing in England.\n","81":" Took over the dental work again this morning much to the relief of all concerned.\n\nGot quite a batch of letters today from various correspondents.\n\n20th. Rather funny on parade this morning I had not quite finished calling my roll when an officer came down & started to march the whole show away\n\nI said to him hold on a minute but he did not understand what I meant so I let him go, on arrival on the parade ground the RS.M came round for my numbers of course I couldn’t give him any but referred him to the officer in question so over he went but he knew nothing about & seemed very surprised when I told him that he had no more right to march those men off than a private did & if this sort of thing was going to go on they could get some one else to do the job, I was going to have the parade until they were handed over or not at all, however he backed down & said it was a mistake & it wouldn’t occur again that’s the way to hop on to these jokers they wonder where it comes from at times & it does the world of good\n\nRain seems to have set in this evening & it is blowing & howling outside a treat, but I am quite comfortable sitting in our well appointed billiard room in a nice easy chair beside a good coal fire, I am just counting the days now till we get our trip home to \"Aussie.\" I see the 1st &","82":" Divisions have just put up another splendid stunt & the papers are giving our splendid troops great praise, I wonder how Len is getting on he will be in all this heavy fighting.\n","83":" Nothing much doing today it being Saturday & I have had a very light Dental list\n\nWent for a stroll this evening & for the first time in England had to wear a top coat the evenings are getting very chilly now & the wind \n\nquite cutting, & to kill time I went & had a look in at the picture show in Sutton Veney & then back to camp where I done some writing \n","84":" At last the papers are beginning to publish the true accounts of the fighting during March & April when the Australians so splendidly acquitted themselves & saved Amiens yes & the British Army when things looked their blackest, how proud the people in Australia will be when they read of how their boys stood up to Fritzie & fought him to a stand still when the other troops had chucked it in, it does one’s eyes good to read the accounts so long withheld from the public I don’t know what they must think of the Aussies now after what they have been reading & its only\n\nthe truth for the \"diggers\" rose to the occasion & fought as only Australians can, & the papers agree that the goes to our lads & they point out also what they have done of late so Australia at present is very much in the boom, but no more than she deserves.\n\nHave not been out so far today it has looked so very threatening, but I think I will go for a ramble tonight & chance the weather.\n\nWell I am back from my ramble & it led me into rather a peculiar place for a soldier nothing less than the Sutton Veney Church I don’t know what made me go in but in I went & stayed for the service which happened to be the Harvest Festival they are nothing near as good as our churches get up for such a time \n","85":" Good news from Palestine this morning & once again the \"Aussies\" are in the limelight theres scarcely a day passes without them being mentioned somewhere or other.\n\nGot a letter from Len today saying that he would probably be going home to \"Aussie\" by the end of the month, he’s lucky enough for anything & all I hope is that he gets away, I am making every effort now to get back to the Batt. for I would get mine right off. Went over to the OTB. this \nmorning\n evening & while there a big argument rose as to when certain units were entitled to put their chevrons up it ended in a bet & I am holding the money & also wrote to Horsferry Rd to have it settled.\n","86":" Bright & lovely morning but the afternoon has been a failure\n\nfor it came up dull & cloudy & this evening rain started to fall.\n\nAll the Great Western Railway employees went on strike this morning so theres only an odd train running manned by a few volunteers, theres some rumour about them getting about 40 Australians to man the engines I don’t know how true it is but its quite likely.\n\nLittle Serbia has scored a great victory over the Bulgars, the papers are giving them great praise for their work but they are a very fine race of people & there are a couple of big colonies of their refugees around Oxford & people say they are splendid the way they have organised things & they are out to learn as much as they possibly can especially agriculture, for they are practically\n\na nation of small landholders, rich men are almost unknown there but previous to the war they were all fairly well off & satisfied to send all their pigs corn & wool to Austria, now unfortunately they are an almost ruined\n\nrace but I for one hope they will be amply compensated when Peace is declared for they as a race have suffered far more than the Belgians & none have fought better or more consistently I was sitting down in our billiard room after tea this evening when in walks Horrie Brain its years since I saw him last, & he in my opinion has changed a lot, he is a Sgt in the Artillery.\n\n25th. Went down & saw a match of Australian Rules this evening between the 1st Training Battalion & No 1 Command depot we won\n\nby a swell margin, I have very little time for this game now after learning to play Rugby, the latter in my opinion is a far better game & I have no further interest in my old game after this was finished I hurried back to our billiard room to see the final in the billiard tournament which Ruston won after a pretty close finish from Clancy.\n","87":" Everything seems working against me now I am trying my hardest to get my teeth finished, my dentist has been shifted to another Camp this morning so no treatment for me today, in one way I am pleased for I was dreading this morning on account of having 2 nerves taken out or they were to have been, but its only a couple of days grace I suppose for I shall have to go through the torture\n\nPut in for a pass yesterday, expect I wont get it for I believe all leave is knocked on the head till the 4th of Oct. on account of the railway strike.\n\nCharlie Tonkin one of my old platoon Cpls came across from the OTB. to see me tonight he got hit a few days after me & has just come from Hurdcott. I was pleased to see him for he is a very decent chap, we went for a stroll together & had a yarn over old times. Has been raining on & off the whole afternoon & it looks very showery tonight\n\nThe Railway strike ended today but unfortunately all leave has been cancelled till the 4th to get the lines in running order again, this has been a very unpopular strike among the people for they went out on strike against even their own\n\nleaders advice for some reason or other, the Government were firm for once & so the whole thing collapsed.\n","88":" For tea tonight we had the uncommon sight of big hard biscuits on our tea table needless to say no one pulled them on, for some reason or other there was a shortage of bread\n\nGraham came over this evening for the O.T.B. I was enjoying a book of Adam Lindsay Gordons poems at the time but I put them away & we went for a stroll down through Sutton Veney & then back to our billiard room for a game to finish the night.\n\nThey are trying their hardest to catch the \"diggers\" who are dodging the dental parades, today we had no fewer than 4 roll calls, got a lot of absentees but they all had good excuses, so very little came of it\n\n800 Reinforcements came in tonight for the 1st T.B. all Victorians they were, so they have a tidy bunch to start on, quite a lot of men are coming along now from \"Aussie\", I don’t suppose they will be used till the Spring.\n","89":" It has been a lovely & glorious day with brilliant sunshine from morn till night something uncommon these times & I’ll bet it won’t last very long.\n\nThe papers over here are making a big mouthful out of the hero of Monevres stunt as they call it, where the Cpl & 6 men held on for 2 days though they were surrounded by Germans. I’ll bet they kept as low as rabbits & never showed their heads, anyone who has had anything to do with the old Hun knows how long 6 men would \n\nlive if they knew they were there, & as for them repulsing great German attacks well anyone who read the yarn & saw how they done it with rifle fire knows what the yarn is worth, they had a machine gun but did not need it we know all about that sort of thing, if the old Hun knew they were there he would not waste neither time nor lives trying to get them, one of his \"Minnies\" or a couple of good rifle grenades would do the trick & up would go the lot \"tootsweet\" !, & to make the whole yarn all the more ridiculous they never even had a casualty in the fighting itself, this sort of thing speaks for itself, & among the soldiers over here the whole thing is regarded as a big joke.\n\nCharlie Tonkin & I went down to Warminster this evening, I go \n\ndown every Saturday afternoon to do my shopping, one has to get all manner of things today I had to get toothpowder, soap, pencil, new diary paper & envelopes, films & prints, & my weekly couple of cigars, the town was simply alive with \"Aussies\" the main street is getting a second \"Picaddily\" on Sat evenings, after we had done our shopping Charlie & I went to a show there, one item was exceptionally fine, Vallances conjuroring, he is an \"Aussie\" & is giving exhibitions under the Y.M.C.A Management wherever troops are in training, after coming out of here we went & had a little supper & then walked home along the leafy old road that leads from the town to the various Camps it was an almost perfect night not a cloud in the sky & the air nice & nippy\n\njust the thing for walking, on our way out we passed the 1st T.B.s draft for France going to Warminster headed by a piper.\n","90":" When I woke up this morning hanged if it wasn’t raining steadily never saw such a country in my life you can’t tell 2 hours in advance what the weather is going to be.\n\nThe old war is taking some dramatic turns nowadays nobody can tell what is going to happen from day to day its easily to be seen that a master hand is at work & if ever a man has justified the confidence placed in him well old Foch has, he has pulled this war out of the fire with a vengeance for no doubt when he took things over we were in a very bad state far worse than the general public have any idea of.\n\n30th. It has been a lovely & glorious day nothing but sunshine from morning till night, just the opposite to yesterday.\n\nHeard tonight that the 1st, 5th &","91":" Battn’s had been broken up to reinforce the remainder of the Div. what a shame if it is true for those Battalions have a record that all are proud of why it seems as if one is parting with something that is part of his life, I can hardly realize its true myself they must be wanting men very bad to take such a drastic step as this with the old","92":" Div. & I for one will not like the idea of going back to a strange unit after being so long with the good old black & green.\n\n"}}