{"Document Name":{"0":"Diary_0028","1":"Diary_0028","2":"Diary_0028","3":"Diary_0028","4":"Diary_0028","5":"Diary_0028","6":"Diary_0028","7":"Diary_0028","8":"Diary_0028","9":"Diary_0028","10":"Diary_0028","11":"Diary_0028","12":"Diary_0028","13":"Diary_0028","14":"Diary_0028","15":"Diary_0028","16":"Diary_0028","17":"Diary_0028","18":"Diary_0028","19":"Diary_0028","20":"Diary_0028","21":"Diary_0028","22":"Diary_0028","23":"Diary_0028","24":"Diary_0028","25":"Diary_0028","26":"Diary_0028","27":"Diary_0028","28":"Diary_0028","29":"Diary_0028","30":"Diary_0028","31":"Diary_0028","32":"Diary_0028","33":"Diary_0028","34":"Diary_0028","35":"Diary_0028","36":"Diary_0028","37":"Diary_0028","38":"Diary_0028","39":"Diary_0028","40":"Diary_0028","41":"Diary_0028","42":"Diary_0028","43":"Diary_0028","44":"Diary_0028","45":"Diary_0028","46":"Diary_0028","47":"Diary_0028","48":"Diary_0028","49":"Diary_0028","50":"Diary_0028","51":"Diary_0028","52":"Diary_0028","53":"Diary_0028","54":"Diary_0028","55":"Diary_0028","56":"Diary_0028","57":"Diary_0028","58":"Diary_0028","59":"Diary_0028","60":"Diary_0028","61":"Diary_0028","62":"Diary_0028","63":"Diary_0028","64":"Diary_0028","65":"Diary_0028","66":"Diary_0028","67":"Diary_0028","68":"Diary_0028","69":"Diary_0028","70":"Diary_0028","71":"Diary_0028","72":"Diary_0028","73":"Diary_0028","74":"Diary_0028","75":"Diary_0028"},"Date":{"0":"unknown","1":1767.0,"2":1768.0,"3":1769.0,"4":1770.0,"5":1771.0,"6":1772.0,"7":1773.0,"8":1774.0,"9":1775.0,"10":1776.0,"11":1777.0,"12":1778.0,"13":1779.0,"14":1780.0,"15":1781.0,"16":1782.0,"17":1783.0,"18":1784.0,"19":1785.0,"20":1786.0,"21":1787.0,"22":1788.0,"23":1789.0,"24":1790.0,"25":1791.0,"26":1792.0,"27":1793.0,"28":1794.0,"29":1795.0,"30":1796.0,"31":1797.0,"32":1798.0,"33":1799.0,"34":1800.0,"35":1801.0,"36":1802.0,"37":1803.0,"38":1804.0,"39":1805.0,"40":1806.0,"41":1807.0,"42":1808.0,"43":1809.0,"44":1810.0,"45":1811.0,"46":1812.0,"47":1813.0,"48":1814.0,"49":1815.0,"50":1816.0,"51":1817.0,"52":1818.0,"53":1819.0,"54":1820.0,"55":1821.0,"56":1822.0,"57":1823.0,"58":1824.0,"59":1825.0,"60":1826.0,"61":1827.0,"62":1829.0,"63":1830.0,"64":1831.0,"65":1832.0,"66":1833.0,"67":1834.0,"68":1835.0,"69":1836.0,"70":1837.0,"71":1838.0,"72":1839.0,"73":1840.0,"74":1841.0,"75":1842.0},"Entry":{"0":"\n\n","1":"\n\nThis book opens with a piece of the best news that I have received for many long days namely a letter from Len saying that he was on his way home to \"Aussie\". I am more pleased than if it had been myself that was going, how lucky he has been & all I hope that he is the same through all his life just fancy during these 4 years that he has been in the Army he has never been wounded that’s a bit of a record for a front line soldier I should think, he has got a start on me but I don’t think we will be long before we are pushing off for this afternoon all the 1914 men were fallen in & all particulars taken of them, so there must be something doing & I hope it comes quick so as we can be home for Xmas. Everyone has been very pleased today over the fall of Bulgaria, seems to be a rot setting in at last.\n\nHave been very busy this evening washing my pants & puttees for my leave came through unexpectedly this afternoon.\n\nHad our first frost of the season this morning but it was very light the nights are getting mighty chilly now & one needs a lot of blankets.\n","2":" Have had very large dental parades today but I can manage them quite easily now.\n\nThis evening after tea Charlie Tonkin called round to see me & we went over to the \"pictures\" at the O.T.B. there I heard that Turkey had skied the towel, I daresay its true for she can’t hang out very long on her own, the news seems to get better every day now if that can possibly be, no one seems to know where old Foch is going to hit them next, he is a silent customer if ever there was one & his name is idolized among the soldiers & people over here, heavens\n\nonly knows what the French think of him & I’d like to know old Fritzies honest opinion.\n\nWent down last night to Sutton Veney purposely to see the picture of the Conn & Wilde fight which took place in London a few weeks back, from what I could see of it I should think that the whole thing was a fraud & I don’t believe Conn tried a bit.\n\nNearly all the Sgts. in our hut tonight are complaining of a sore throat I know I have one I wonder what the dickens can be the cause of it, the majority seem to favour the sudden change in the weather, it is much warmer tonight again than last night perhaps that may have something to do with it.\n","3":" A cold wind has been blowing all the day & its cutting right to the bone, winter is coming fast luckily tonight they are issuing an extra blanket per man & very nice they will be, this makes 4 per man.\n\nHave had Grano with me this afternoon putting him wise to the job for he is taking over from me whilst I go on leave.\n\nDrew £8 yesterday that will have to do me for this little stunt, I am going to go easy & save up for my \"Aussie\" holiday which can’t be far off now. A lot of the Sgts. are boozed tonight having just been paid – poor mugs.\n\nLast night Graham & Brainwood came over to see me about 11 oclock, I was in bed consequently got pulled out thats a way we have of greeting one another, pretty rough but very effective I might inform you. I am going over to the O.T.B. tonight to see Graham he is going to France on Saturday night so I shan’t see him perhaps for some time again for I expect the next time we meet I shall be in Australia. Lindsay & I have been good mates & I hope he gets through alright.\n\nAll the Sgts. are up before Orderly Room again in the morning. I’m hanged if they will go on parade, they have all worked their heads pretty successfully of late but I think its coming to an end they are absolute experts in dodging parades & I don’t blame them I should be with them myself only I am lucky & have my little dental job this excuses me from all other duties so I am set, it’s a most peculiar thing how once a Sgt. gets over in these English Camps he will do anything rather than go on parade, yet in his Battalion he does not mind it so much.\n","4":" Had an early tea tonight so as we could catch the 5.15 train to London. 4 of us Clatworthy, Bull, a 7th Battn. Sgt. & I had a car ordered so we left fairly late & just got into Warminster in time to hop on the train, the train was packed with soldiers & we ran into Paddington a few minutes after 8, then there was the devils own rush to get to the tubes & away for the night. I\n\ngot out at Trafalgar Square & put up at Morleys Hotel a flash but good place. After getting fixed up I went for a stroll round the streets & had a look at the Square which they are transforming into ruined villages, trenches, & etc., they have big guns everywhere & when it is opened all War Bonds purchased will be signed inside these guns. England is going to raise another gigantic loan & this is one of the ruses she is trying to get people invest. London never seems to change, her streets are just as crowded & busy as ever & no one appears to worry in the slightest about the war the more one sees of this great city the more I am lost in admiration & wonder at the working of it, truly she is a marvellous old town.\n","5":" Woke up this morning to find it raining slightly & very dull. After breakfast I went for a stroll round the city hunting for films & after trying dozens of places eventually\n\nfinished up with 2 reels so that’s not so bad. I have got 5 on hand now getting ready for my trip home to \"Aussie\" there’s no one has any idea how scarce these things are nowadays nearly the same value as gold. After dinner I went out to Ilford caught the train at Liverpool St. & was soon in Courtland Avenue where Jessie Alderson lived with her people they have a very fine house fitted with all modern conveniences. In the evening I telephoned in to the city for 2 seats at the \"Kingsway\", there is a very fine farce on there \"A Weekend\" is the name of it. We had fine seats 13\/- each pretty expensive but well worth the money I & for that matter both of us thoroughly enjoyed ourselves. I was sitting next to a little Japanese officer, it was very funny & amusing to hear him talking. I could just understand him, he is over here on a mission from Japan & seemed a rather nice little chap.\n\nAfter the performance we went & had a dinner at \"Simpsons\" & then down the Strand to Charing Cross tube station we got a proper shock here for the whole street was simply a mass of surging swaying mass of people all struggling to get down to the trains, this is a very busy little spot at any time but I never saw anything like this before you were fairly carried off your feet it’s a wonder someone was not crushed to death. I’m hanged if I know how girls get on for I nearly had my ribs stove in they used to let so many hundreds in at a time & then close the gates till the platforms & subways were clear, eventually we got carried along with the crush & squeezed in to the Inner Circle tube & soon were in Liverpool St. & out home again.\n","6":" Got up fairly late this morning on account of it being Sunday in the afternoon I ran back to London & went out to Plumstead\n\nto see the Winters. I like them very much, stopped the night there, about 3 oclock in the afternoon Eva, Vera & I went down the town to see Mrs. Oliver but she was busy so we decided to call later on in the meantime they took me out to the Park, they have a lovely rose Garden & a splendid hot house filled with all the delicate flowers ferns & plants imaginable while strolling round Eva lost her new bangle of cameos, a pretty old & valuable trinket & it was the first time she had worn it. Vera \ngga\n gagged her unmercifully but she took it all in good part. On the way back we picked up with Mrs. Oliver. I did not like the idea of meeting her for some unknown & foolish reason she was annoyed with me for not seeing or writing to her before & the best of it was that I had even gone out to Eltham to see her & she was out & I had written her several times, but apparently she had never received them, at any rate I did not care much for it was \n\nonly for Mother’s sake that I saw her. I’d like to break Lens head for it was through him in one way that I got in to hot water he kept on saying oh yes do go & see Mrs. Oliver so I fool like got into touch with her. At any rate the shock of meeting over she came home to the Winters home & there we had tea & a girl or two dropping in we had a musical evening. Theres no one knows only those who have had to spend years in Kahki what a pleasure it is to get in touch with people like this. Why it is a little bit of heaven & it seems just like a dream needless to say I enjoyed myself & after it was all over we had supper & then Eva & I walked down to the train with Mrs. Oliver & saw her off, & on getting back found Vera waiting with the table set for more supper so we 3 set to work & made merry & then after a pleasant evening to bed. I like these girls very much, they are real decent & a pleasure to mix with.\n","7":" This morning I was roused by Alice with a cup of tea, pretty strange for a soldier tea in bed I then got up & dressed & had breakfast & then Eva came down to Plumstead Station with me where I was just in time to catch the London train. I went as far Cannon Park hopped out there & dived into the District Railway & on to Victoria where I deposited a parcel in the office & also drew my shell band out for Charlie Tonkin & I were going to Littlehampton this morning by the 10.10 train. I picked Tonkin up at No. 6 platform & having a few minutes to spare we run round to Peel House & got my camera & back to the Station just in time. \n\nI forgot to mention that yesterday morning I went down & had a look at the famous \"Petticoat Lane\" where all the Jews gather of a Sunday morning to sell their wares the place was simply crowded & the noise terrific with all the salesmen shouting about their wonderful bargains & goods.\n\nThey sell everything down here from stewed eels to blouses, the stalls are lined on both sides of dirty narrow little streets, here you will see a coster selling shrimps & prawns next to him a fruit stall, joining that a ladies underclothing joint & so on all mixed up anyhow & trying to sell their goods by hook or crook the appearance of a Colonial is the signal for redoubled efforts to induce him to buy something that he don’t want but the majority of our lads are pretty shrewd now & they only waste their breath. I bought for 8d. a colored plate of the King & Queen more as a souvenir of my visit there than anything else. You have to watch yourself down here for they are known as the greatest rooks in the world you will buy a certain article & they will wrap it up under your very nose but on opening the parcel at home you will find something entirely different & worthless in it. This often happens to people I have known our blokes to\n\nbe caught like this. So when the old pot wrapped up these photos I undone them just for curiosity’s sake. The old snoozer laughed when he saw me but the photos were there alright. I posted them off in the morning on my way to Plumstead. \n\nNow to get back to Victoria we left to time & had a pretty fast run to Arundel where we had to change. When the Portsmouth train pulled out I suddenly thought of my band, hanged if I hadn’t left it under the seat. I was wild about it after getting the blessed thing nearly there & then losing it on arrival at Littlehampton. I reported it & the authorities are going to see if they \nre\n can recover it for me. \n\nIt was nearly 1 oclock when Charlie & I arrived at \"Banyena\" & only Miss Sparks was home so I telephoned to Mr. Dukes office to let him know I had arrived, so home he comes right away & we had dinner he’s just the same good natured fine old chap. I like him very much. We went for a stroll round the promenade & town in the \n\nafternoon & I had to order the fish for dinner or breakfast tomorrow. I got 4 lb. of plaice I like those fish very much then after this he bought a pint or two of shrimps for tea & at the same time had some to eat while walking down the street he’s a proper character & cares no more for conventions than he does of a snap of the fingers, from here we went round & paid his works a visit & he showed us all his pumps engines & etc. he turns out great quantities of pumps, from the works to the office & here he had to sign a lot of papers & cheques & give some orders & then home to tea, & the rest of the evening we put in lounging in the easy chairs in front of a nice warm fire drinking good wine smoking cigars & eating fruit & yarning till tea time. We had a bonzer bed & both slept till fairly late in the morning.\n","8":" Had no less than 3 helpings of fish for breakfast. They were lovely & I had a bonzer meal. The sun was shining brilliantly so I ordered them\n\nall outside & took a few snaps. I hope they turn out alright.\n\nMr. Duke is going to send some flower seeds home he has some lovely ones & they will be pleased with them.\n\nI gave my things another bit of a overhaul. Mr. Duke is going to hang on to them till I send for them after the war.\n\nCharlie & I left for London by the 10.17 train & picked up the express at Arundel. She was crowded out so we hopped into a 1st Class compartment & stopped there till we reached London. In the same compartment was an elderly gentleman who had spent many years in New South Wales & was a great sportsman. We yarned the whole way up. The old chap still thinks there is no place like \"Aussie\" & he is going back after the war. He has the greatest admiration for the A.I.F. troops & their record.\n\nI left Charlie at London, he went out to Brixton & I to Paddington to put my things in the parcel office till the train left that night, its no use carrying them around with you in London.\n\nFrom Paddington I went by tube to Picadilly & into the Trocadero for lunch, pretty flash you know for this is one of London’s leading restaurants & things are done in style there, you go into a lovely big hall & there little page boys meet you dressed in brown suits & bright shiny buttons all over they take your hat & stick & give you a ticket, then there is a manager or something at the entrance & he takes your name if the restaurant is full & when your turn comes calls out your name & a sort of shop walker guides you to your seat, pulls the chair out & when you stand close to the table pushes it under for you & you sit down, then along comes your waiter dressed immaculately in black & white & puts a menu all French on your table takes your order & away he goes. They wait on you hand & foot here in fact almost feed you, then when you have finished they bring your account along on a silver salver\n\n& you put the money on it & away he goes gets your bill paid & returns the change then he stands just back of your chair & when you rise he pulls it back & takes the tip which you have left on the table. This joint is always crowded with society belles big heads officers & etc. & I was the only soldier under an officers rank in there, nearly everyone is scared of going into these high class places but it has no effect on me. I rather like the experience, & it gives you confidence in yourself.\n\nAfter coming out I strolled down Picadilly & eventually into the Hippodrome to see the revised edition of \"Box o Tricks\" for I had a few hours to spare before my train left. After the performance I walked down to Trafalgar Square to see the finish of their ruined village there were thousands of people coming & going buying War Bonds & etc. you could hardly move in the whole Square, & I soon made\n\noff up the Strand & into Oxford St. & then by tube to Paddington where I was just in nice time to catch my train 2 of us had a compartment to ourselves so we stretched out on the seats & slept till we reached Warminster. I eventually reached the Camp about 11 oclock & turned in dead tired.\n","9":" Our 1914 stunt is getting very close now, they are collecting all of us in No. 10 Cam I expect I will be going there in a day or so all going well a fellow can begin to get a sight of Aussie now. They have taken all our particulars again. I don’t know how many times this makes & I expect there will be a lot more of it yet before we eventually get clear from the red tape sins.\n\nIt is simply an awful day nothing but rain rain when will it ever clear up & give us a little sun to cheer things up.\n\nAs I was standing on the platform at Warminster a tall chap came up & spoke to me he turned out to be Cliff Dickenson. He is in the 12th Battalion. I should never have known him. \n\nAll sorts of rumours have been flying round tonight about Austria having surrendered to the Allies, it is supposed to have come through the Post Office at Warminster but this evening I was down at the Pictures & they threw the latest war news on the screen. \"Nothing official about Austria yet\". \"Germans beaten all along the line\". These announcements were greeted with much handclapping & a running fire of remarks. These are great times one never knows whats going to happen from day to day & no one seems to be able to fathom old Foch’s scheme. \n\nThe boys are having a gay old time in the Mess tonight, a sort of farewell concert to some of the 1914 men who are going into No. 10 Camp tomorrow previous to going on ship.\n","10":" A batch of 60 odd men left No. 10 Camp this morning for Devonport, that’s the first batch from round this part of the world.\n\nWent down to the pictures at Sutton Veney this evening time hangs heavily on our hands here, & a fellow has to do something I reckon this is the sort of place where they should start this educational scheme that the Army has been promised it would be a regular Godsend to a lot of men. \n\nHave had another trip to the dentists this afternoon & I’m hanged if he didn’t pull out the fillings of one of my front teeth. This makes the 3rd time this has been done in this Camp, each dentist that I go to has a cut at it.\n","11":" A few more men were sent from here today on Aussie leave I wish my turn would come quickly.\n\nGot a few letters from home & etc. this afternoon most of them dated August or thereabouts.\n\nHave been feeling very restless & discontented all day long so this evening after tea I collared my stick & set out for a long walk. It was a lovely evening & the air quite sharp & nippy. Everything looked splendid all the foliage of the beech trees has taken on a lovely golden tint & some are quite yellow, soon they will all begin to fall & cover the ground with a golden mantle heralding the approach of winter. The grass is quite green yet & so are the hedges. There are some very pretty walks round here, the one I took tonight is one of my favourites I pass several old fashioned churches nestling among clumps of oaks beeches & pretty flowers, their old towers standing out plainly against the sky while behind them are the chalk hills covered with clumps of scrub & old fashioned thatched farmhouses are here & there with stray stock running round the stables & farmyards waiting for their tucker.\n\nWhenever I get these restless turns I go for long walks they always seem to put me in a far more contented frame of mind I must have covered 8 or 9 miles in my rambles tonight, & I am bound to sleep well when I turn in, which will be in a few minutes.\n\nLast night there was a great commotion in the Camp it appears that by some means or other some of the \"Diggers\" rolled a barrel of beer out of the Sgts. Mess without being noticed. As soon as the Caterer found it was missing he mobilized a lot of Sgts. who were in the lounge & they set out to find it. After a bit of hunting they run it down in No. 7 hut where they had almost emptied it & practically the whole hut was drunk. They are bringing a few of the ring-leaders up but they have very little evidence against them of a convicting character & I expect they will all get off with a lecture or something like that.\n","12":" Another trip to the dentist this morning but happily not for long. He just raked one of my back teeth clean & put some chemical stuff in to kill the nerve. Its just beginning to give me fits now but its much better than having them out straight off the bat. I had enough of that sort of thing in Birmingham.\n","13":" A lucky day for me, this afternoon as I was sitting at my table the Orderly Sgt. rushed in & shouted out my name & sung out that I was to report to No. 10 Camp immediately to go to Australia. I was writing a letter home at the time so you can guess how pleased I was. I packed up my things at once & took them over to the Camp. There I met a few of the lads I had not seen for years including Bob Modrell of the 5th Division.\n\nIn the afternoon Charlie Tonkin came across & we went for a walk it was a glorious afternoon & the countryside looked simply splendid, everything looked so \nclam\n calm & beautiful, & the leaves\n\nwere practically every color imaginable. It was the first Autumn that I had seen in England & I can quite believe now all the lovely tints in the old English pictures. What a day this has been I went over to the D.T.B. to say goodbye to a lot of our lads & then Charlie & I went down to the pictures & there happened the incident that millions of people have been longing & waiting for these 4 long years, a funny picture was being screened when all of a sudden it stopped & the crowd started to go out when an officer jumps on to the stage & sings out wait on boys I have some good news to tell you & he sings out the following, Germany admits defeat, has accepted President Wilson 14 points, & an Armistice starts immediately, well if you could only have heard the shout of joy that went up I shall never never forget it as long as ever I live. Needless to say no one bothered to see the rest of the picture out but out they tumbled cheering &\n\nyelling. I was excited myself & practically ran all the way home to break the news & then a lot of them wouldn’t believe me in fact I could hardly believe it myself but it seems to be true. As I write this the bands are playing \"Apre la guerre fini\", & a lot of old tunes while I believe down in Warminster there were great scenes of excitement, but I suppose one will have to wait in patience till the morning papers come, we will know the full strength of things then & then only.\n","14":" What a sell not a word scarcely in the papers about Peace this morning. I’ll bet I won’t be had so easily the next time such rumours come through I was that sure of it last night that I would have wagered any money that it was true. I’ll be a bit more cautious next time believe me.\n\nRaining again this morning. Storey & I had an early breakfast then went down to No. 7 Camp to report. Here we found them calling the roll before\n\nmoving off, so having a little time to spare I scribbled a few lines in the diary. \n\nBefore leaving the Command we all marched over to our Furlough Office where all rolls were properly checked & pay books collected then we loaded our gear on to a G.S. waggon & set off for Warminster headed by an original 4th Battn. piper with one of the old pipes brought from \"Aussie\". On the way down we passed all the 1st T.B. out for their march & many were the compliments passed as is usual with \"Aussies\". It was a dull heavy morning but nevertheless it was a morning I shall never forget. 4 long years have we been looking forward to this memorable day & now it has come at last, everyone was in the best possible spirits & the march to Warminster was a pleasure. We arrived there in nice time, collected our kits & hopped in the train 3 extra carriages had been provided for us of which there were 150 all told. We had a pretty slow trip to Bristol. The country on the way down looked simply glorious. I never saw so \n\nmany shades before in my life & everything looked so green & peaceful. All the way through Somerset we passed beautiful little villages perched on hills with flowers coloring everything & fine rivers & creeks with swollen waters for there had been a lot of rain of late, in fact the country looked almost perfect. We stopped at Bristol for an hour & a half & there was a general stampede for dinner & then back to the station & into the train & by heavens she was a fast one averaged 60 miles an hour to Newington Stoke where we got on to another line for Devonport. This was the first time I had seen Devonshire & no doubt shes a lovely little country & fairly hilly we passed through Taunton & Exeter on our way down & eventually pulled into Devonport towards evening. We had about a mile to march to our Camp which like all Military turnouts lay fair on top of a hill overlooking the town. We drew our blankets 5 per man & then had some tea or rather an apology for such for it only consisted of tea & bread & butter & a little jam, washed down with\n\nsome sloppy tea. Needless to say this did not appeal to us so after a wash & a clean up we set off down to the town. The first thing was for a shave & brush up, then into a restaurant for something to eat, after this a stroll round the town which from what I can see of things appears to be pretty lively but chock full of sailors of all sizes & sorts this is only natural for it is one of England’s great naval bases. Plymouth & Devonport are almost the same town for only a mile or so separates them & the scenery round about is very beautiful especially coming along the coast the line follows the shore for quite a distance & some very good views are to be had. We strolled round the town till 10 o’clock then back by train to St. Budeaux & so to Camp & sleep.\n","15":" 800 men marched in late last night from France, they are camped just over the road opposite us so I expect there will be quite a number of old faces among them after things are fixed up I am going over to have a look among them.\n\nHad a splendid breakfast fully beef & biscuits a little bread & butter & the usual Army tea, so you can guess I am not feeling too clever just yet with that inside me.\n\nWe have been busy giving all sorts of details about ourselves & our addresses whilst in Australia this morning.\n\nQuite a number of the lads including myself are suffering from colds in the head. I hope we get rid of them before getting home. I have no desire to get that \"Spanish flu\" again after what I suffered with it at \"Harefield\". I see they have it very bad in South Africa & India, should not be surprised to see it spread to \"Aussie\" by the time we get there. It is still raging over here & causing a tremendous number of deaths. The other day there were more deaths in Glasgow than what the authorities could deal with so that’s pretty solid.\n\nSaw a lot of the old hands this morning while they were waiting at Bray old Birdwood came down to see the 1914 men & he got the reception of his life. I believe old Birdie broke down completely & cried with joy, & the \"diggers\" broke\n\nbroke loose & carried him shoulder high all over the place & finally down to his car where they had chalked all over it \"Birdwood the King of the Diggers\", old Birdie reckoned it was the proudest day of his life & he would never forget it nor the Australians either. They formed a ring round his car & sang \"For hes a jolly good fellow\", Auld Lang Syne & etc. before they let him go, so you can see old \"Birdie\" is still very popular with the A.I.F. & needless to say he thinks that our lads are the finest troops in the world. He has said so often, & it nearly broke his heart when he had to leave us to take over what was left of the British 5th Army after the German break through at Cambrai last March. I should like to see him visit Australia after the war, what a reception he would get. He would hardly hit the ground. Its very seldom that you hear of a General getting the affection of men like old \"Birdie\" has of the \"diggers\", for \n\nalthough he is no longer with us the boys think the world of him especially the ones who were on \"Anzac\" with him, they reckon this demonstration in favour of old \"Birdie\" caused quite a flutter in the military circles for it was practically an unheard of thing before for the soldiers to show their appreciation in such a forcible way as the \"Diggers\" did, but that’s just the \"Aussie\" way its got to come out & they wouldn’t care if it was the King. I’ll bet the other Generals are a little envious of Birdie after this outburst & wish they were as popular with their troops. \n\nSent a wire off to Mr. Duke for money this afternoon for at present I am just about penniless, spent my last shilling on the wire. The reason why I am so short of money (a most unusual thing for me) is that they took all our pay-books & sent them to Hqrs. to be audited so while they are away they won’t pay us. They should have paid us by rights before leaving Sutton Veney.\n","16":" Went down round the town last night for a few hours but getting fed up I soon made tracks for home. \n\nThe sun has been shining nicely all day but if you are not moving it is very cold & nippy. After dinner today I went for a stroll out into the country part of here the old fashioned lanes are very beautiful just now with their masses of foliage of all colors. I took my camera with me but got pulled up just as I was going into the town & advised to keep it out of sight so I decided to take no unecessary risks & struck off into the country. While wandering down one of the steep little lanes I came across a big party of orphan girls out for a ramble with their mistress. They looked very pretty in their blue dresses with red edged collars blue hats & hair tied with a red band of ribbon. I took one little partys photos but I think it was too dull to be a success.\n\nToday they got about a dozen blokes who were trying to get back with us & are not entitled to it, gave wrong names & numbers, but Horsferry Rd. soon scotched their little game.\n","17":" Was down in town again last night with Grenfell. We went to the pictures best seats 5d. a bit of a change that. \n\nAm Orderly Sgt. this morning & have been running all over the joint getting these men together who are being returned to their units.\n\nWeather is lovely just now hope it keeps like it till we get away.\n\nMy money from Mr. Duke is in Camp somewhere so I must see about getting it shortly.\n\nTons of girls hanging round the Camp mostly soldiers wives who have married over here & are saying good bye to their husbands before they get on the boats, & I guess in a lot of cases it will be the last they will ever see of them.\n\nThere are quite a lot of \"Jacks\" mixed up among the crowd & the mongrels have taken all their shiny badges & buttons off & are putting up their Battn. colors in the hope of camoflaging themselves but its no use for everyone knows them & they are in for a nice time. They ought to pitch them overboard to the sharks that’s about all they are any good for & the Staff at Horsferry Rd. are very little better. \n\nThe Orderly Officer & I had a few words this morning over the Mess Orderlies parade but nothing came of it.\n\nWent & had a look over one of the old forts that was built many years ago to protect Devonport from an invasion. It’s a long while since I saw such massive stone work & burrowing & tunneling all over the place, the whole show is surrounded by a big moat many feet deep & the entrance has a draw-bridge, the whole thing is of course obselete now & is used for a gas school by the Tommies.\n\nAfter dinner I went down town to do a little business got my watch repaired & some films \ndel\n developed & then went & had a bonzer hot bath which cost me the huge sum of 3d. I then struck out home for tea & to attend to the rest of my duties. It has been another glorious day with the sun shining from sunrise till sunset.\n","18":" 4 years today since leaving \"Aussie\" & to me it seems like 20, but thank goodness we are on our way back.\n\nHas been raining lightly all the day but this has not stopped anyone from going out. I had a run into Plymouth this evening & had a look round the town she is much bigger than Devonport but both towns are practically the same & they are connected by tram & train & ferry as well so the services are pretty good.\n","19":" Got our clothing & pay this morning both articles being very welcome. I’ll bet there will be some fun in the town when the mob get down with their \"Bradburys\".\n\nA bonza day quite a contrast to yesterday. We had a muster parade at 2 p.m. but got no news on it of our movements but I fancy Monday or Tuesday should see something doing, & won’t we be glad for one gets sick of hanging about waiting for our time to come.\n\n20th. Went into Plymouth last night & after a walk round the town went to the Theatre Royal an opera was on & one that I had seen while in Paris \"Rigoletto\" I liked it in English much better than Italian, the 3rd & 4th Acts I think are splendid. I had a bonza seat & I thoroughly enjoyed it. It was 10 oclock when it came out & I missed the last tram & had to walk all the way home.\n","20":" & a most miserable day, a cold wind has been blowing all the time & it looks like rain. I wish to goodness they would get us across & on to our boat, influenza is raging round here & a lot of the boys are down with it one chap\n\nhas just died with it, how stiff is he. They reckon we are likely to stop here for a while until it dies down for they are frightened we might bring it aboard & give it to the rest of the patients, everyone is getting fed up & some are taking their 10 weeks in Blighty through so much messing about.\n\nWe had to find 80 men today for various duties & a nice time we have had getting them off.\n\nAfter tea this evening I went into Town mainly with the idea of having a hot bath but on arrival found that there were no baths open of a Sunday night so I did the next best thing under the circumstances had a good feed then a stroll round the street & home. I much prefer walking than riding these nights it helps to settle ones feelings & makes me more contented which under the present conditions is not up to much. I hate hanging about & there are so many temptations to dodge.\n\nOne thing that struck me forcibly down here is the large number of people you see walking about the streets with a little bag of chipped potatoes & fish, it seems quite the thing down here so the other night I thought I would try a few so I stands in the little queue & waits my turn, for 6d. I got a fair amount & I can tell you that they went down well.\n","21":" Very dull & miserable & the ground is getting quite sloppy. There are no signs of our moving as yet. This morning a Colonel came round & asked all the men if they had been issued with clothing & whether they had been paid or not. Our old Dr. was with him (Thompson now a Colonel). We are going to have our medical inspection any day now. The big Camp had a part of theirs yesterday.\n\nGot an issue of coal today so the hut is quite warm & cheerful.\n","22":" Had our medical inspection this morning. First of all they put us all through a big disinfecting room\n\nwith the idea of killing any stray germs then down to the medical hut. I had charge of our party & had to take the name of every man as he was examined & went out through the door. The men had to strip to the knees & the Dr. gave each man a good examination for all sorts of things they are making sure that we are taking no diseased mess home with us. Among our draft the Dr. got 2 suspects, I don’t know what they intend to do about it.\n\nThey also paid us another £2 a piece this afternoon so the boys are making merry now they are keeping the cash up.\n\nLast night I went to the Theatre Royal & saw \"When Knights were bold\" it was splendid & I thoroughly enjoyed myself its one of the finest things that I have seen for some time.\n","23":" Its glorious outside this morning & the sun is shining nicely.\n\nOver 800 men went aboard this morning, they reckon we won’t go on our ship for 2 days yet.\n\nGot a small batch of Aussie mail this morning which was very welcome.\n\nGot mixed up in a slight accident this morning, a few of us were fooling about with a German flare, we thought we had taken all the explosives out & Munch threw it in the fire around which we were sitting yarning. No one thought any more about it when all of a sudden there was a bang & a flash of blazing colors flying all round. Some of the fragments lobbed on my puttees & before I knew any more had burnt holes through & through, so that means 10\/- for another pair this afternoon.\n","24":" All our Camp went for a short route march this morning. We dodged round a few of the old Devonshire lanes with their high hedges on both sides & blackberries hanging dead ripe everywhere. Went down to Devonport in the evening & had another good bath then went out & met my fair companion. We had a stroll round the town & then\n\nI took her home & finished for the night.\n","25":" Took Miss Nissen to the theatre last night & we both thoroughly enjoyed ourselves.\n\nThe boat that loaded up the other day has gone & we are left on our own & heavens only knows how long they are going to keep us. We were to have gone some days ago but for the outbreak of flu, they then decided to put fewer men on each boat so that’s how we came to be stranded. Everyone is fed right up to the neck, if they would only tell us how long we are here for & let us make our plans accordingly it would not be so bad but as it is now we don’t know what to do, some say we are likely to be here till the 19th of next month, that’s a nice piece of news to be sure.\n\nA few days ago a submarine got a big transport just outside the harbour. A good many lives were lost, but yesterday they got even with them & bagged the submarine. There were only 3 survivors & one of them said that they were 380 feet down when the depth charge got them.\n\nThe Sub. came up end first & the destroyers soon fixed her.\n\nThe weather is holding remarkably fine & it is quite pleasant down here.\n\nAm Orderly Sgt. today, but theres practically nothing to do here, she’s some Camp.\n","26":" Well it seems as if we are not going to leave this Camp for some time. This morning on parade we were told that 20% were to be given 4 days leave so that about settles Aussie by Xmas for us. I put my application in & got my warrant by 12 oclock. I am going to London & intend if I can get money enough to get some new clothes.\n\nThis morning 4 other Sgts. & I went to see Miss Wasterns funeral. She has been a wonderful good worker for the sailors & the Navy were burying her with Naval honors. I thought that this would be worth seeing but it turned out to be a regular fiasco for there was scarcely any ceremonies at all though great crowds of \n\nsailors & naval officers were present. We did not stop to see the finish but left when the Guard of honor did.\n\nI was dead lucky this afternoon, I just had enough money to land me in London & they were paying a lot of new men so a few of us went over & platted our frames in they never even looked at our books to see when we were paid last, had they done so we would have got no money & I should have landed in London penniless. We got a £1 each & this was worth £3 at any other time coming as it did in the nick of time.\n\nI am writing this in the Refreshment room on Plymouth railway station while waiting for my train which does not leave here till 7.30 p.m. & lands me in London at 3.30 a nice time, too dead of night & a Sunday morning but that won’t trouble me much.\n","27":" We arrived in London early this morning. I had 1\/4 & MacDougall 1\/-. With this formidable amount we had to \n\nhang on with till Horsferry Rd. opened which was not until 11 or thereabouts. A bed was out of the question for the funds wouldn’t stand it, so to put the time in till breakfast we had a hot bath & I shaved & cleaned my boots. After these operations we went into the reading room & slept in an easy chair till 8 oclock. We then spent the remainder of our wealth purchasing our breakfast. This left us entirely broke & with not a bean in the world. To kill time until the Pay office opened we went for a stroll up Holborn Way & up there I met Sampson one of our old Coy. officers, we had a good yarn about the Battn. & etc., & then Mac & I struck out for Oxford Street & then down to Victoria & arrived in due course at Horsferry Rd. where we were politely told that we could draw no money. A pretty situation & one we were not going to accept lying down so Mac & I finds an officer & we put our case before\n\n& told him how things stood. He had a look at our Pay books & said \"certainly you can draw money, how much do you want Sgt. Oh a fiver will do me I said, so he entered it in my book & I was paid in a few minutes & so was old Mac. That afternoon I caught the train for Littlehampton. We left London at 12.50 & went round through Brighton, had to change 3 times first at East Croydon then at Brighton & again at Ford. A civilian nurse was travelling in the same carriage as I was & she had a big trunk, so at the various changes I took possession of her things & helped her all I could for nurses are people I have the greatest admiration for & will always do them a good turn if possible. When I arrived at Mr. Dukes place they were just having tea & I blew in on them unexpectedly. They were surprised to see me for they had imagined me far away on the bounding sea but no such luck.\n\nIn a few minutes I was comfortably installed & sitting down to a good tea which I thoroughly enjoyed. We then pulled our seats up to the fire & started yarning about the topics of the day. About 9 oclock while we were having a heated discussion over such silly subjects as war brides & etc., one of Mr. Dukes friends blew in & helped the talk along. About 9.30 Miss Sparks brought some fine pears & nuts & coffee along so you can see spent the evening very pleasantly as I always do down here. We turned in about 11 & I was dead to the world in no time for I had had no sleep for 24 hours or more & my bed was as soft as a feather.\n","28":" Didn’t wake till Mr. Duke poked his head inside & started yelling that breakfast was ready & this was a nice hour for a soldier to be crawling out & etc. This was about 9 oclock so you can see I slept pretty sound. I rubbed \n\nmy eyes & jumped out of bed. The maid brought me in hot water & I had a shave & was dressed in no time & down like a shot to breakfast. After this was over Mr. Duke took me round to one of his friends place Mr. Shelley, the Town Clerk & we had a yarn there for a couple of hours & then we went for a stroll round the promenade & then back to dinner & more arguments. We get on remarkably well the old chap & I, & talk over all sorts of subjects. He is one of the finest men that I could ever wish to meet & before leaving him this afternoon he insisted on me taking £10 to help me on my way & he said I was not to trouble about paying it back any time would do. He offered to lend me any sum but I would not hear of it, its alright having a friend like this over here for you never know when you might be pushed for money. Before leaving I gave Miss Sparks a pair of my field glasses & she was delighted with them. Its not much for all the kindness they have shown me while in England.\n\nI got a fairly fast train from Littlehampton & in about 3 hours was back in London. I walked down to Peel House & put my bags & etc. in the Store Room & then rushed for a train to Victoria & thence by tube to Picadilly where I slipped round to the Pavilion & booked a seat for \"As you were\" a very popular piece at present. This left me with a little over an hour to spare so I went round to the Maison Lyons for dinner. Here I met a couple of good stamps of English officers but they were born & brought up in the Malay Penisular. This is the slowest flaming place I ever put my foot into as regards service, we were exactly an hour getting through 2 courses. This place like the Strand Corner House is just a meeting place for girls & gossip & it generally takes an hour & a half to get a dinner. However we finished at last & then made off for the theatre. I like Dalyisia she is bonza in \"As you were\".\n","29":" Today I went & done some shopping, went up to Gamages & bought some breeches & puttees & a few more things that I wanted. Gamages is one of the big stores of London & its not a patch on Horderns in my opinion. My shopping took most of the morning up, so in the afternoon I went & saw \"The Maid of Mountains\" this is a lovely thing & is drawing great crowds. Dalys is a nice theatre & has none of those aggravating pillars in the Dress Circle that most theatres are cursed with.\n\nWhen this was over I made off for Charing Cross & on my way bought some grapes 5\/- a lb. I paid for them & also a few white roses 6d. each. Things are an awful price over here now. I took these out to Plumstead to the Winters, on arrival there I found Vera in bed with a bad cold. I felt sorry for her for she is a nice girl. I stayed out there till 9.30 then made a dive for London, & after a \n\na lot of changing from bus to train & tube eventually arrived at Paddington at 11.15.\n\nLondon seems to be taking the war news very calmly just an ordinary occurence it now seems to be but underlying all the masked indifference you can see how glad & pleased they are over the prospect of an early & victorious peace. The flu seems to have got them all thinking far more than the war for people are dying like flies & so suddenly too. Rich & poor go the same way, people are inclined to think it is some sort of plague. In lots of towns they are dying far faster than they can be buried, so you can see its pretty serious. A chap gets it this morning & hes dead the following day. According to last nights paper the Government are going to take a hand in the matter, they have already released a lot of Drs. to help fight the disease.\n\nI done a very foolish thing when I walked on the station at Paddington. I saw a bunch of \"Mothers Pets\" (Military Police) pulling the chaps up & then I never tumbled but walked right into them. Of course they wanted to see my pass. I took my pocket book out but could not find it, so he said oh never mind Sgt. your name will do & I fool like gave him my right one. I never jerried till I had done it & then I felt inclined to kick myself for I could easily have given him a crook one. Our time was up at 12 & we should have been back in Camp. The funny part of it was that practically all the lads fell into it the same way as I did, but it don’t worry us in the slightest.\n","30":" Arrived back in Camp at 10 this morning & found quite a few more of the old lads there from different places such as Weymouth Warminster Tidworth & etc. but still no news of our moving. This waiting is getting a bit sickening & I for one am fed right up to the neck & further if possible.\n","31":" Our new Coy. Commander is trying to put his foot down & bring the troops to a bit of order or so he thinks he is by the way he spoke on parade this morning, first of all he towelled all those up who were not wearing their Army overcoats then down on the No chin strap brigade. He reckons he is going to have an alteration within a very short time. I don’t like his chance if he thinks he is going to start red tape methods for everyone is so discontented with hanging about here & they won’t stand any domineering methods.\n\nGot a batch of letters form \"Aussie\" this morning & one of them upset me a little or I should say a fair bit. It was one from Dick Duke in answer to a letter I had written while in Birmingham, I was never so sorry over a thing before & I used to wish that the boat that was carrying that letter would meet with an accident but no such luck she got it alright & as I thought it cut her up considerably\n\n& she like a good girl took the blame on herself & reckoned she was the cause of it. It was all over my Paris experiences. I imagined by some foolish means that she was sarcastic over it & I wrote a pretty sharp letter to her in return. The day after I posted it I was sorry but the deed was done & I could only pray to Heaven that she would never get it, but no good it arrived alright & today I got her letter saying how sorry she was. I’ll bet she was no more miserable over it than I, so I sat down & wrote her a letter telling how sorry I was & that I never ceased regretting such a rotten action & I won’t feel satisfied till a couple of months are up & she will have it.\n\nIt was announced on parade this morning that 2 of our mates have unfortunately died with the \"flu\" in Devonport Hospital & No. 4 Coy. were detailed to attend their funeral. I think this is a very sad thing its hard luck for the chaps but in one way worse for their people.\n","32":" Miserable & raining lightly this morning, took my boots down to get repaired & bought some rubber heels & soles. While down there we went into a fine little cake shop to fill up an empty void. This little shop in question is supposed to have the best pastry outside London. I know I never had anything like these cakes anywhere not even in Paris, & we also had a \"Cornish pastry\". These also are very good.\n\nEveryone is just about stoney broke & they are sweating on pay day. I am lucky for I have plenty at present thanks to Mr. Duke.\n\nIts marvellous the rumours that are flying round here about the Aussies. I heard last night in the strictest confidence that 100 Australians had been posioned on board ship by a German Dr. & nurse that had somehow got aboard, & also that they were dying like flies with the \n\n\"flu\" & again that one of the boats had been torpedoed with great loss of life.\n\nGreat news this morning, both Turkey & Austria seem to be finished for good, theres no doubt the war is nearly over. We are beginning to wonder if they will send us off now or not, or send us back to our units & send the lot home together.\n\nI heard yesterday that Len & all his mob are held up in Cairo. I wonder if its true if so I rather envy him for Cairo is a lovely place to visit.\n\nOne of our lads has got one of the origional pipes of the 4th Battalion & the boys amuse themselves by strutting up & down trying to blow the pipes. You should hear the crazy noises they produce it’s the fun of the world, pipes are all very well when played by an expert at a distance but when a mug gets hold of them at close quarters well the result is better imagined than described, puts me in mind of 20 cats fighting & screaming together with the howls of a dog thrown in for balance.\n","33":" One of our bright birds took a sailor down last night for £60 he got away with it but was caught later on with only £9 in his possession a man like that deserves hanging.\n\nWent to the theatre last night & saw \"Yes Uncle\" it was very good & I thoroughly enjoyed myself. It was very funny, in the seat behind us was a Yankee officer (Naval) with a pretty low sort of tab & she was blowing him up a treat. The Yank looked about as silly as a rabbit & was turning all colors, but the girl kept on talking, oh she was a beauty. The Yanks have got a pretty crook name down here. They are not at all popular.\n\nNo.","34":" They are starting to inoculate all the troops here for \"flu\". They are not going to get me if I can possibly help it. I don’t believe in their experiments & its nothing more nor less than this at the present time. I will take a risk if I can dodge the Drs. besides its about spent its fury\n\n& is dying down according to the papers.\n\nYesterday afternoon I met Miss Nissen & we went for a stroll round the \"Hoe\", this is a most famous spot for it was from here that the Spanish Armada was sighted & the battle started, & here also is the little piece of green where Drake was playing his game of bowls & the old hero’s statue overlooks the Sound, he is gazing out to sea as if watching for the fleet to appear. Just close to him is a big statue of Brittania surrounded at the base with the old cannon of those days & piles of cannon balls, & also the origional Eddystone Lighthouse stands on the promenade where it has been re-built. There is a most splendid view to be had from the promenade which follows the coast round. A great breakwater runs far out to sea you can easily follow it by the white clouds of foam which are continually breaking over it while the great rocky headlands stretch out to the open sea shaping the bay like the letter U & in the sheltered waters scores of camoflaged steamers are sheltering\n\n& warships are everywhere. Around the promenade there are laid out little gardens, there is also an aquarium & a band stand where on summer nights a band plays nightly great crowds usually throng this walk & it is very lively & especially of an evening. From here we went down the town & into \"Colliers\" the best restaurant in Plymouth for tea. As we were going to our seat I heard some one sing out \"Arch, Arch\" & on looking round got the shock of my life to see an old cobber of mine Lieut. Shannon, I thought he was back in Australia long ago. The last time I saw him was in the Corner House in London & he then was going back to Aussie in a few days with a stiff leg. It appears from what he told me that he was getting on board ship & slipped on the gangway & broke his leg & had been in hospital ever since, how stiff was Freddie, he has still got his leg in Plaster of Paris. I am going down to see him first chance I get he is stopping at Durnforde Hotel.\n\nI have dropped in rather lucky here in one respect, for the girl whom I take out occasionally is a real good sort. She speaks French fluently & sings & plays nicely & is in all ways a real refined girl, but she has a rather sad thing in her life her fiancée was killed over 2 years ago but she has never forgotten him, she told me all about it last night & I felt real sorry for her. Thank goodness there are still some girls left who are true to the ones they loved & don’t go gadding about all over the place as if nothing had ever happened, that’s one of the worst parts of this war the thousand s of young people that have been parted for ever & the homes that have been left so empty & sad. Its very bad over here for practically every one has lost some one near & dear to them. I have often thanked my lucky stars that if ever I happened to get knocked out for good no one would ever grieve over me with the exception of perhaps Mother. Sometimes I have often wished that it were otherwise for a chap is very lonely at times & craves for someone to confide in, but I suppose one of these days all will come right as I\n\nhave said before, the reasons I am keeping on the straight track is on account of a girl who lives many miles from this country. \n\nI think I am about the only financial member of our hut the rest are totally broke, but thanks to Mr. Duke I am well cashed up.\n","35":" This morning turned out gloriously but at 12 oclock up came the rain it looked as if it had set in but luckily about 2 oclock it cleared up nicely & I went down to the Tram terminus to meet Miss Nissen who was coming out. We went for a stroll down towards Tamerton Foliote. This is out in the country & it is a very nice little walk. I took my camera out & got a few snaps. We came back to town again about 6 oclock & went into Genoles a high class restaurant for dinner. We had olives, soup, fish, pheasant, tart & custard, cheese bread & butter port wine & coffee, cost was just on £1. I suppose lots of people will say how extravagant\n\nbut they must remember we are not the same chaps who they knew in Australia. I would rather stop away than go into cheap places for food & as for standing in queues & etc. well that’s unthinkable. This is what travelling & knocking round the big cities has done. After dinner we went to the Theatre Royal to the Sunday night concert which is always held weekly, it is a high class turnout, operatic stars & famous musicians do all the turns. We had Orchestra Stall seats, I rather liked it myself but Miss Nissen simply drank the whole show in, she is a first class musician herself & sings well so this sort of thing appeals to her, she could tell me all about the items which made it much more interesting. After this was over I took her home & then back to Camp myself arriving there at 12.30 & was soon in the land of dreams.\n\nThis morning I went down to Plymouth to book my seats for tonight, you have to get in early if you want good seats for there is always a big rush especially on first nights. \"Arlette\" is the play tonight. I got wet to the skin walking down to the tram for it simply poured down in torrents & I was like a drowned rat, however I done my business & on my way back called in for my boots. I got the shock of my life when they asked me 7\/- for half soling & healing, give you an idea of the high prices running in England at the present time.\n","36":" Anniversary of our most disastrous stunt at \"Flers\" 2 years ago when our Company C. & D. were pretty well wiped out & I got a dig in the leg with the bayonet. Theres not many of the lads left now who took part in that mix up I am the only representative from our Coy. who is here.\n\nWent to the Theatre last night to see \"Arlette\" & I was greatly\n\ndisappointed it was a very poor thing & the acting very bad & oh so tame, & heavens how it rained it simply poured, came down in torrents & the streets ran like a river. I never expected Ethel to turn up but she was there at a quarter to 7, she came down in the tram & hopped out at the Post Office where I met \nhere\n her, we then caught the Plymouth tram which took us right to the theatre & even though it rained cats & dogs we never got wet, by the time the performance was over luckily the rain had stopped & the stars were shining so we both got home dry.\n\nAm Orderly Sgt. this morning, very funny when the officer came round this morning he poked his head inside the door & asked for the Orderly Sgt. I thought he was another Sgt. so I sang out \"right here old son will be out in a minute don’t get your hair in a knot\", so I took my time & put my tunic & watch on & then strolled \n\nout. When I got outside I was surprised to see that it was an officer & he said to me, is that how you speak to your officers Sgt. He laughed when he said it for he knew I had mistaken him, things like this often occur in the Army & go to make up the humorous side.\n\nI believe there was a big fight down in one of the dancing halls a couple of nights back, a Yankee insulted a girl & the M.C. went up to him & asked him to apologize, this he refused to do & sang out for his mob to gather round him. This was the signal for the Jack Tars & they on to the Yanks. When the Aussies saw what was happening they joined the Tars & pitched the Yanks out neck & crop. You can guess what kind of a joint it was, rough & ready.\n\nIt is a glorious morning & the sun is trying to make up for his stinginess of the last few days & he is pouring down his rays like a gentleman giving us an opportunity to dry\n\nour overcoats on the wire.\n\nWe were all paid last night consequently the huts were fairly empty last night. You can easily tell when the boys are cashed up for they seldom come home of a night.\n","37":" Have had a rotten day first of all the whole crowd were sorted out in alphabetical order on parade & then an officer went round & checked each mans name on the nominal roll. This took till nearly 12 oclock & then hanged if we did not march down to the Medical hut & went through an inspection for scabies & that other curse, by this time it was nearly 1 oclock & our dinner was at 1.15 & our Coy. had also been detailed to attend the funeral of 2 of our chaps who had just died so straight away after dinner we fell in & marched off as we thought for a mile or two march but Lord bless my soul I never was so sick of anything in my life, we walked mile after mile up hill\n\n& down through narrow winding muddy lanes cow-dung ploughed our way through sluggish creeks & flats in fact had the time of our lives & to crown all we had to climb a 500 ft. hill that took ones breath away to look at it even & it was with a great sigh of relief when at last we reached the top & our destination. We sat down & wiped the sweat off our faces & silently cursed our luck. Just then a Tommy bugler came along & some one asked him where the firing party was, oh he said they’re coming along, \"well go back & tell them to hurry up & not keep us waiting\", that’s alright he said they’re soldiers. This made some of them wild & all sorts of insults were hurled at him, & one fellow as a parting shot sang out \"get out you Woodbine when are you going to get a bar to your Mons Medal. (Woodbine is the name of a cheap cigarette which all Tommies smoke & our lads much to\n\nthe Tommies disgust call them \"Woodbines\" & don’t they bite. Some of the boys call them \"Retreats\" in honor of the much talked of Mons retreat which the Tommies got their medal for at the beginning of the war & our chaps have made the name of \"Retreats\" pretty widely known throughout the Army, so that if anyone asked for a packet of Retreats they would give him \"Woodbines\". Theres no love lost I can tell you between the English & Colonials. The \"Aussies\" especially our chaps will never forget the March & April stunts when so many Tommies got for their lives, & I myself can testify to that for I saw enough to satisfy myself round Hazebrouck when we were rushed back from the Somme, but I am wandering from the funeral. At last the firing party all Tommies came past & they were subjected to a running fire of remarks & advice about the slopes of their rifles & etc. We fell in at the rear of them & done the slow march\n\nas far as the Church where the coffins were picked up & carried on shoulders draped with the Union Jack to the graveside. I could not help thinking when they were laid to rest so far away from dear old Aussie in that quiet little English Churchyard of old \"Salvation Yeo\" of \"Westward Ho\" fame, & Amyas Leigh when the latter said when old Yeo was being buried that nothing would have been more fitting than Yeo could have his face to the West where he had spent most of his adventurous career chasing Spanish ships on the Maine. Funny things happen these days I wonder who would have thought of such a thing as 2 Australian soldiers being laid to rest in this pretty little Churchyard & 200 of his mates there as a guard of honor, a short 5 years ago yet it has happened. The service to us seemed very sad & I was quite glad when the firing party had finished & the bugler had \n\nsounded the \"Last Post\" & the notes died faintly away in the distance & beautiful sunlight, for the day was a perfect one. There were a fair number of civilians present which added to the sadness of the thing & it was with a heavy heart that I turned away when we marched out & left 2 of our mates lying in that lonely little spot. I often think if it should be my fate to die over here without seeing Aussie I should never rest but should wander in my spirit to the sunny south for love of our land is very strong in the \"Aussies\" for to us there is no land comparable that we have seen.\n\nOne of the ships that went out the other day had to return on account of the flu being so bad. An officer told me that 38 of our lads had died on her & not a single invalid had caught the disease. We are losing a lot of men through this cursed thing & until it dies down its a certainty we will be kept in England.\n","38":" Have been busy shaking & belting my blankets this morning & they are now hanging out on the wire with my pyjamas getting a good airing which they so badly need.\n\nAm Orderly Sgt. again this morning, this job will do me for its nice & easy especially when one knows the ropes so well.\n\nThere was a great commotion about the town this afternoon, we were all just sitting down to tea, when there was a most tremendous noise in the harbour all the whistles & horns of the steamers & warships started blowing & every little thing that could raise a scream took it up & there was cock-a-doodle-doing galore, we all guessed at once what it was the armistice signed & the end of the war. All the boys rushed out of the huts & started cheering & shouting & everyone was wildly excited, so much so that none of us could wait for our tea but put our tunics on &\n\nrushed for the town where we found kiddies marching about beating tins carrying flags, singing at the top of their voices. The town was simply crowded & one had his work cut out to work up Fore St., here again great crowds had collected & were singing at the top of their voices \"Keep the home fires burning\", Rule Brittania, Smile, Smile, Smile & etc., flags were very much in evidence every little kid & girl was sporting a Jack or Stars & Stripes & the whole town was in its gayest mood & fit for anything. I went out to Plymouth & the same state of affairs were prevailing there, yet in spite of all this there was no official confirmation that the war was over, all they were going on was that the Navy had received a wireless to the effect that the armistice had been signed that afternoon at 3 oclock, but the whole thing turned out to be groundless, if this is a sample of whats going to happen when the war is over there will be some joy.\n","39":" Miss Nissen & I went to the Hippodrome last night & saw \"Nights of Gladness\", it is a most ridiculous but amusing thing & I laughed fit to burst myself. This is a nice cosy little theatre & it was simply packed.\n\nA big batch of men marched out for their ship today, everyone is getting more fed up than ever if that could be possible hanging about here quite a number are taking their 73 days here in England. I have been trying to get back through America but it will cost me too much so its out of the question.\n\nA bit of fun here in Camp this morning all the Sgts. were put on guard on account of the shortage of men, & until the funeral party came back we had to carry on.\n\nAll the bed boards & trestles were called in this afternoon & stored down in the old fort at Ernesettle this is on account of the large number that we are burning for firewood\n\n& its just as well they are doing this for they would have none left before long.\n\nIt rained like blazes early this morning but when we got up the sun was shining nicely & it has been a beautiful day.\n","40":" Another lovely morning & its quite a treat to be out. There is not a cloud in the sky & things look very beautiful.\n\nWe handed in all our blankets this morning & quite time too for they were absolutely filthy you could go to bed with clean pyjamas on & get up in the morning real \n&\n dirty, I don’t think they could have been changed for ages.\n\nI got another nice batch of letters from Aussie & letter & a Xmas card from Dick Duke & a parcel from New S. Wales, letters totalled 13 without cards.\n\nWell I got inoculated after all this morning I got the good oil from the adjutant & he advised me to be done without delay for he said they would turn me down for a certainty if it was not in my pay book, & he also said that I\n\nwould have a good chance of getting on the next draft for Aussie. I am dying to get home & out of this country. I have an idea that most of my furlough will be spent in New South Wales for apart from home there is nothing whatsoever to keep me in Tasmania. I have very little time for what people I do know there outside my own relations, but I suppose a chap will know whats doing when the time comes.\n\nI chatted our O.C. for a pass this morning. I want to get out early & go to a little village down the line. He is going to fix me up & I am going to take the risk & if I get caught outside the boundary I won’t fool Bristoe our O.C. who is a jolly good chap whom we get on with.\n","41":" Well I had one of the most enjoyable days that I have spent for some considerable time yesterday afternoon. Miss Nissen & I went out to Yelverton 11 miles by rail from Plymouth, here we were met at the station by her\n\nfriends with a dog cart & packed into it & away we went, away out past the Burrabor resorvoir & into the Moors where their farm was. I had never seen moors before but had often read of them & now here I was right among them & very pretty they looked as they stretched away as far as the eye could see in a succession of ridges all purple brown & red from the vegetation slowly fading & dying, every here & there great rocky clumps rose their heads above the ridges & torrents of water rushed down all the little gullies & clouds of mist kept gathering & rising as the sun struggled through. These moors are covered with a low scrub, gorse fern, heather & etc. & to try & describe their beauty is more than I can do for I could not help but drink in their beauty, it seems to be one vast great waste with no fences, ponies, sheep & cattle roam about at their leisure. We arrived at the farm eventually & \nwas\n were made very welcome, we had a cup of coffee, & then Mr. Tredgear intro-\n\nduced the guns & asked me if I would care for a shot, as you may guess this was right into my hands for I am simply dying for a shot. I noticed them smile to another when they handed me my gun a nice Hollis, I suppose they thought now we’ll see a bit of fun, so out we went on to the moors among the bracken & scrub & I simply blinded them. I had 13 shots, got 6 rabbits 2 partridges 2 ducks & 1 wild pigeon. I had to give 1 of the ducks & the pigeon the second barrel but I got everything I shot at. The boss was astonished & he said to me, well Sgt. if you chaps can \nshoot\n fight as well as you can shoot no wonder you Aussies have got a grand name for scrapping, little did he know that I had been used to a gun all my life & I never let on but I fancy the old chap guessed as much. After coming in from the moors we had a fine old tea mutton fried potatoes, pickles apples & custard, good Devonshire butter\n\n& cream & as much cider as I wanted & lots of other little trifles. We then had a musical evening which lasted till 8 oclock then the pony was put in the trap & we were driven back to the Station & so on to Plymouth.\n\nIt is Sunday & very cold, Munch McDougall & I went & had a bath a hot one as we thought we were going to, but unfortunately it turned out to be stony cold & nearly froze us to death.\n","42":" Went to the Concert last night at the Theatre Royal & it was simply splendid it was principally a patriotic one in honor of Raleigh, & the singers especially one soprano was beautiful.\n\nAt last the great day has come & the whole air as I write now is filled with screaming & howling whistles & sirens. The time we first got the news here was 9.20 & it is now 11.45 & the noise is increasing if anything all the Church bells are ringing & clamouring & the little church hard by is floating a big old Union Jack & ringing her bells\n\nmerrily on tins, the greatest day of Englands glory. I wonder if those old sea heroes of ours Grenville Drake Raleigh & Hawkins have any idea of what this day means to us. We have come out on top as England nearly always has done after one of the most frightful wars that we have ever been engaged in & the end has been so dramatic & the win so complete that we can hardly grasp the full meaning of it. \nwlt\n When we got news of this the lads were on parade & the message came up telling of the signing of the armistice & the end of the war, the C.O. read it & proclaimed the day a general holiday amidst an outburst of cheering & the lads promptly scattered & made off for the town. The camp is now practically deserted but I have to stop here till dinner time for I am Depot Orderly Sgt.\n\nSaw Freddie Turner & a lot of the boys this morning they came across with the last draft from France.\n","43":" Went down the town yesterday afternoon & found Plymouth & Devonport in the wildest state of excitement & joy, flags, bunting, rosettes, banners fluttered from every house & building & every one was sporting red white & blue, carrying flags singing songs marching up & down the streets, our flag was well to the fore the \"Diggers\" were carrying it & singing patriotic songs & dittis at the top of their voice & crowds of girls were helping them. I saw one never to be forgotten sight it was in Fore Street, a little party of our lads had 2 fine Australian flags where they got them from goodness only knows, at any rate they started to sing \"Australia will be there\" & the enthusiasm ran very high, & the crowds collected rapidly & the whole street was blocked for hundreds of yards & the people took it up, while it was being sung the lads crossed our two flags, all of a sudden a naval officer forced his way through with a big\n\nold Union Jack & on reaching the \"Aussie\" circle he hopped in & held up his flag between ours & they sang the song over again amidst tremendous enthusiasm & storms of cheering for Australia. They finished up by singing \"Auld Lang Syne\" & in the end half the people were crying, the street by this time was blocked from end to end almost, for Fore Street is quite short & it was with difficulty that we were able to move, it was a great day for everyone. I made out towards Plymouth & Union Street was simply blazing with flags of all the \"Allies\" & people were going silly. The Aussies were jumping on the horses backs in the cars & on anything that came along, the whole place was a mass of excited people waving flags & singing, little bands of kids were parading the streets with tins Kettles old drums & anything they could lay their hands on, in most of these\n\nbands were \"Aussies\", processions kept on coming down girls & boys dressed in any old clothes \nwe\n they could rake up & dressed in all impossible costumes & decorated with green feathers red white & blue ribbon & all colors imaginable, enthusiasm reached its height about 3 o’clock. As I fought my way up Union Street, young girls dancing to the imminent danger of their lives & flags, flags everywhere bound round their heads for caps over their shoulders & round their waists. The very roofs were black with people & young snoozers were burning a yellowish powder that gave off just clouds of smoke & everyone shouting shouting, great lorries taxi cabs ","44":"\n rush past in bewildering succession all crammed to the utmost on footboards roofs & seats with howling flag waving half demented lads & lasse’s singing all sorts of songs. The street is thick with excitement horns blowing bells clanging & ringing the place is gorgeous with flags.\n\nEveryone is kissing in the streets & no one seems ashamed of it, procession after procession goes by singing & beflagged roaring its way towards the Square & the \"Hoe\". A piper comes past followed by dancing crowds of young chaps with their girls, & Boy Scouts are out in their glory the restaurants are packed to the ceiling & hungry crowds wait outside. Aussies climb all over the horses & wave their flags like fury shouting & yelling the while. At last I reach the Hoe & this beautiful & historic place is crammed with people all laughing & shouting. I pass by old Drake looking stolidly out to sea & wondering if his spirit which is in the people of Devon will ever be called upon to rise & inspire old England. There was a great crowd round the old hero’s statue, Drake is just idolized in Devonshire he was born here & just close by our Camp is the Church where he used to worship & was married.\n\nAll the steamers in the harbour were hung with bunting & blowing their whistles. I strolled round the Hoe for a while & then went down town again & made out for Devonport, by this time all cars were stopped from running for it was just about impossible for them to push through the crowds so I had to walk out, here I met Starkey & his Yorkshire girl & shortly after met Miss Nissen & we went out to the Theatre Royal to see \"The Boy\". The place was crowded & just before the curtain rose the orchestra played & all sung the \"Brabaconne\" Marseillaise, & God Save the King amidst an almost indescribable scene of enthusiasm, & when we had finished this a naval officer from one of the boxes got up & said \"Gentlemen the war is won\" & then there was a renewal of cheering & etc. At last the play got going & during the course of it the actors were constantly getting champagne from the occupants of the boxes, & very nearly got drunk\n\nit was a splendid thing & I thoroughly enjoyed it. A funny thing happened this evening Miss Nissen introduced me to some of her friends & one of them was the lady whom I had sat next to the first night I had gone to the theatre a Drs. wife Mrs. Palmer she turned out to be we both laughed heartily over it.\n\nAll the warships have left the harbour for Heliogoland to take over the remainder of the German fleet, & whats more 4 German subs came in flying the white flag & with open hatches, they could not have been lurking too far from Plymouth Sound.\n\nThis morning the Daily Mail printed a lot of the Generals photos who had helped to win the war & they omitted Birdwoods so our hut wired to the Daily Mail wanting to know why this was, we also sent a telegram of congratulations to Birdie. I wonder if he will reply or not.\n\nAnother lovely morning & plenty of sunshine the nights are very cold now but we have had remarkably little rain. Things have quietened down considerably in the Town, the excitement is fast disappearing.\n\nThere has been a lot of joking & larking in our hut this morning they have been pulling Vernon’s leg unmercifully & he has been biting like one thing. First of all they hid his cigarettes, then he had some water heating on the fire & while his back was turned they took it nearly all out, left about a cup-full & finally planted his walking stick. Lord how wild he was but this was just what we wanted & we nearly killed ourselves laughing.\n","45":" Miss Nissen & I went to the little Repertory Theatre last night & very good it was but the smallest I have ever seen we had Stalls cost 3\/- & there were not more than 100 seats available in this part, the people\n\nthat patronize it are of a better class as one could easily see.\n\nWe had a fine lecture this morning in the Y.M.C.A. by Capt. Roberts on the War Aims of Germany he was really most interesting & held the whole mob by his eloquence & delivery, & at the conclusion he was well cheered, at the end of the lecture Colonel Woods told us that we would probably be gone by the end of next week, may it come quickly.\n","46":" Our Coy. has been on duty all day otherwise nothing to report with perhaps the telling off of an H.P.C. Sgt. whom I detailed for Guard Duty & did not turn up to time, how we hate these mongrels & we are now in a position to get some of our own back. We don’t allow them to neither eat nor sleep with us they have separate huts & we never associate with the wasters & all the Diggers have got a terrible down on these snoozers & they are shunned \nall\n by all.\n","47":" There was a bit of fun as Ross Braithwaite & I were going into town by the tram, we had got down as far as the Dockyard Gates & the tram was full, there were a lot of Tars & dock yard workers waiting & a number rushed the tram. The conductor although the tram was full allowed a dock yardie as they are called to get aboard & tried to throw a sailor off, who was carrying a big bag of mails into town. This act enraged the remaining Tars & quite rightly too & one Tar came forward to aid, that no matter what happened they would stick to their mate & see that he never got off while the dock yardie was on. He then started to call the dock yardie all the curs he could think off & how they were hiding behind womens clothes & they were too big a skunks to come fight, but wangled their exemption certificates & got work in the yard & wormed their way into all the good jobs while\n\nchaps had to leave their positions & go & fight for such curs as these & now its all over they don’t care what becomes of the fighting men, while all this was going on the car was of course hung up & a big crowd was collecting. The tar had the sympathy of the whole crowd & all the Aussies were applauding him saying give it to them Jack we’ll stick to you. \"I know you will lads he cried\" for you know what these mongrels are\" & he was quite right for they are a rotten bad looking lot these shirkers & pacificists & have earnt all the big moneys while other lads have been fighting for them & here was a bright specimen who wouldn’t even give his place on the car for a sailor with a big load. At any rate the sailor won & off the chap went with the mails. I wouldn’t have cared to have been in that dockyardies shoes\n\nafter being abused like that & everyone in the car hostile to him, women & all threw angry & disdainful glances at him & passed sarcastic remarks but he must have had a hide like a rhineosceros for he took little notice. \n\nWe were all paid again yesterday for the last time they said previous to going aboard ship.\n\nWas inoculated the second time. I thought it just as well to get done in case a chap got turned back before going on the boat for they are very particular over it & are entering the date & etc. in your pay book. I don’t think its very important for the scare seems to have died down.\n\n17th. Ethel & I went out to Yelverton again yesterday afternoon & went for a stroll down to some pretty little old fashioned villages nestling in the little gullies, by the way the population turned out all curious they have not seen too many Australians\n\nbefore, for I was a regular object of curiosity to them all. We had a look over the old fashioned church where tablets are erected to Drakes descendants & then went on to the old Abbey where all the monks are living & whom John Bull wrote so strongly about some little time back accused them of being spies etc. Old Drake also had a lot to do with the old Abbey, wherever you go in Devon it is full of little stories & remembrances of this great old 16th Century sailor, his very name is worshipped in Devonshire & to those people he is the greatest man that ever lived, in fact he is almost their God, they could certainly have a far worse hero, for even in my opinion he is the greatest & best of all Englands long list of heros.\n\nAfter coming back to Plymouth we went & had dinner at the \"Swiss Café\", & then down to the Hippodrome to see the performance & then\n\nhome. The nights are bitterly cold now though fine & starry but the breezes seem to cut to the very marrow. I shall be glad when we get a move on.\n\nThe Australians held Sports here yesterday afternoon but I never attended them. \n\nAll leave has been cut out, so we must be on the point of going.\n","48":" Took my friend to our usual Sunday evening concert at the Royal, the Royal Marine Band were the principal ones tonight & they were very good, especially their playing of one of my favourites \"Land of hope & glory\".\n","49":" a bit of shopping this evening getting a few things ready for our trip.\n\nAll the men on leave were wired for this morning so that looks promising.\n\nAlready things are beginning to get a little better now the war is over or practically so, food is far more plentiful & cheaper, streets are better lit motor cars & taxis have more petrol & bigger districts, & tradesmen are\n\ngetting a jolly sight more civil to their customers for soon people will be able to go & buy where they want to & not where they have been registered for their rations & etc.\n","50":" There was a rare bit of fun in the Camp this morning, after the Coy. has marched out on to the Battalion parade ground it is the custom for all us Sgts. to buzz off & get into our huts & so dodge the route march. Well we followed this old habit of ours out faithfully & all went well till about 11 oclock when old Woods our Col. took it into his head to have a look round the Camp & see how many men were off parade. Unfortunately we never got wind of this till Saul gives the warning that he was in the hut next to us, you should have seen the scatter then, some out through the doors & others through the windows. Penfold the R.S.M. of the 54th was one of those who chose the window\n\njust as the first Sgt. started to clear the door old Woods steps out & there he stood thunderstruck while we hopped out like rabbits from a warren & away in all directions.\n\nIn the afternoon we were supposed to have a kit inspection so we took all our gear out but it was a blind for all they wanted were the men with military pieces of equipment all we were allowed to keep are the gas masks only everything else has to be handed in. You should have seen the pile of stuff that was collected.\n\nAnother draft for the boat was also called out, they took from K to Z so I missed this lot again. I am just about sick of the whole damn business putting it off from week to week like they have been doing its enough to make anyone sick & I like the rest of the lads am just about fed up with England as it is possible to be. We are all longing to be on our way home & until we get a move on towards that end nothing\n\nwill ever satisfy us, we are getting more & more restless every day, why on earth can’t they get a ship & bundle the whole lot on & off instead of this miserable dribbling policy that they are following out, putting a hundred or so men on a boat & then sitting down like Micawber waiting for the rest to come along. You should see the look of disgust on each mans face as our sailing is put off from week to week. The latest is that we might get away by the end of next week, that means pretty well a fortnight & this will seem a year to be at least. I have pretty well given up hope of ever getting away & feel more restless & discontented than ever I can remember before in my life & as each day goes by it only increases. Once I get aboard I will be satisfied & not till then, now that we have Australia on our mind & the war over & done with nothing seems to please us, & one & all are\n\nlonging for the Sunny South & our own girls.\n\nI have been writing todays doings in the big hall of the Royal Sailors Rest in Devonport, & as I now write a chap is singing \"I’ll sing thee songs of Araby\". This is a fine place for every night they have good music & plenty of it & songs scattered in between. The place is large enough to seat a couple of thousand people & it is always well patronized by sailors & soldiers. Attached to it are restaurants, billiard rooms, reading & writing rooms, plenty of good hot baths, a thousand cubicles for sleeping purposes, hair dressing saloons & goodness only knows what else. It was started by Miss Agnes Weston 60 years ago & she died only a few weeks ago. I went to her funeral. Among the sailors for whom she worked principally she was known as Aggie Weston & she was held in great affection by them, she practically devoted her whole life time to their interests & the work she started so humbly has now grown to an immense undertaking.\n\nThis afternoon we got an answer to the telegram we sent General Birdwood congratulating him on the part he has taken to bring the war to a successful conclusion, the reply ran – Devonport Anzacs Hut 26 Ernsettle Camp, St. Budeaux. Thanks for kind message. Bon voyage. Birdwood A.I.F. 5th Army. This reply was put into Orders & read out on parade. The telegram form was raffled among the members of our hut & McDougall won it he was that pleased with his souvenir that he went about showing it to everyone & then finally sent it off to Scotland to his old people.\n","51":" We have had a re-shuffling of huts, & new rolls have been made out, this afternoon now the draft has gone. While we were all sitting round the fire this afternoon killing our enemy Time, Trefery walks in looking for me, wanted me to go down to his uncles place for dinner with\n\nhim this evening so I having nothing to do gladly accepted so I tidied myself up & off we went, his uncle turned out to be a parson & not a bad sort of chap. I thoroughly enjoyed my evening & we had a jolly fine tea. I had 3 big cutlets of salmon & a piece of sole, 2 rissoles, jam tart, custard & fruit, cakes bread & butter & a few odds & ends, not a bad war time tea for a parson, they have a lovely home & it was quite a pleasure to sit in a big easy chair & yarn after scoffing a good meal like that. We had lots of little arguments & as usual drew all sorts of comparisons between England & Australia, these were the first people I have met in England who prefer old Asquith to Llyod George & we had quite a heated argument over the pair.\n","52":" Another cussed boat roll was read out this morning & I missed again so tonight I am not feeling particularly bright.\n\nI am down again this evening in \"Aggie Westons\" & am going to do a bit of writing to the accompaniment of the orchestra. I noticed as I came past the Evening News office that the Huns were handing over their fleet today, what a triumph for Britain to get rid of that great fleet without having to fire a shot even, I need scarcely say how pleased the people down here are over it for half of Devonshire are in those great ships of ours, they had one experience when the Battle of Jutland was fought half the Country was in mourning then & they have been dreading another such turnout.\n\nI have just seen a very amusing thing a flash looking Tommy was announced with a great flourish to give a display with cards & conjuring, he started off with the usual flashness of these snoozers when someone in the hall started to roar with laughter, so the Tommy stopped & wanted to\n\nknow in an insolent tone what he was laughing at, the chap said I can laugh if I wish to, the Tommy said you had better cut it out or I will have you put out of the building, the chap said no more but let him go, but in a few minutes he burst out again, so the Tommy stopped & invited him up to do the tricks if he was game enough to come forward. At first the chap would not come but the Tommy felt so sure that he had him in a fix that he practically forced him to come forward on to the stage & show the audience what he could do. I thought by the way he stepped on to the platform that he knew something about the game but I was never prepared for the shock I got for what with cards pigeons flags bags soldiers ropes cigarettes & heaven only knows what he absolutely dumbfounded the audience & took the performance over himself, he was easily the finest I have ever seen & oh what a shock it was to Mr. Tommy. Needless to say he vanished.\n","53":" Have been doing a proper loaf the whole day long with the exception of an hour this morning when I was a witness on four A.W.L. cases.\n\nWent down to Devonport again this evening & had another bath, I filled the bath pretty well to the top & soaked myself for nearly ½ an hour & then being suspicious of a few pimples on my arms & legs I rubbed some sulphur ointment well in, in case they happen to be scabies for if you are unlucky enough to have these cursed things in a very mild form even they won’t let you go on the ship.\n","54":" This morning another boat list was read out & mine was on at last nearly all the 1st Battn. chaps are on this draft, our boat number is the D.34, some say it is the old horse boat \"Port Hacking\" & a pretty old thing she is from all accounts but anything will do provided we get away from this hole.\n\nIn the afternoon Blue Dimock & I went down the town & saw a game of Soccer between 2 Navy teams, it was the fun of the world & rough as you could wish for. Blue & I won a cigar each from 2 other Sgts. After the match we went into Plymouth & had dinner at \"Genom’s\" & after this we went to the Repertory & saw \"Monbys Flapper\", it was a regular scream & pretty hot at times, we both thoroughly enjoyed the farce. After the theatre came out we went to Millbay Station & caught the 10.30 tram for St. Budeaux eventually arriving home about 11.20.\n","55":" Nothing much doing today as it is Sunday & raining at that.\n\nIt is rumoured this morning that the D.29 has been cancelled won’t the the boys be roaring if it is true for they were kidding themselves that they were getting away in front of us.\n","56":" Got pooled for a route march this morning the first one I have done for 5 weeks so I can’t complain.\n\nBlue Dimock & I went down town \nthis\n yesterday evening after tea we went for a stroll on the \"Hoe\" for an hour or so then down to the Theatre Royal where we booked seats for the usual Sunday evening concert. Having an hour to spare we went round to \"Goodbodys\" & had a cup of tea & a few cakes & then back to the concert. It was rather longer than usual but there was the singer who stood out on her own Madame Nellie Stephenson, she has a lovely voice (soprano) & I think everyone looks forward to her items, I know I do & judging by the reception she gets the whole audience thinks the same way.\n\nLast night the D.29 was cancelled indefinitely & our sailing has been put off till the 30th so heavens only knows when we will get away.\n\nThe weather which has been quite remarkable the last 5 weeks seems to have broken as far as the sun is concerned, for both yesterday & today have been quite dull but one good thing the temperature has risen & its nothing near as cold as usually.\n","57":" Went down to Plymouth last night & had the usual look round but things were very quiet & uneventful.\n\nHad another rotten route march this morning, they are making things a welter properly now & are trying to be regimental. I can see some fun if they insist on carrying it out, for at this stage of the business no one is inclined for any silly stunts & the whole Camp fed up with the delay of ships for Australia, just think scores of us have been hung up here for 6 weeks & no one seems to know when we are going to get away. I would far rather have been left at Sutton Veney. I am sure I was far more contented there than here, besides the saving of money.\n","58":" I had a rare bit of luck in one way last night I went down to \"Moons\" in Plymouth to book some seats for tomorrow nights Concert which is a grand affair the Orpheus Male Choir & Packmann the famous pianist are giving it in the Guildhall, well I just got there at the critical moment & the Manager was just going to close the door when I put my foot between the door & the wall. The old chap looked at me & said, you are too late Sgt. we close exactly at 6 & you are too late. This ought to have squashed me but no fear, so I said now look here I have been on duty all day long & this is the only opportunity I will have of getting down for you close at 1 tomorrow, (Wednesday) besides I may never have another chance of hearing this musician & I particularly want to see him. He looked at me & saw I was in earnest so he said, well all right Sgt. I’ll stretch a point & let you in but mind I don’t make a practice of these things\n\n& such a thing is most unusual for the firm so in we went & I got 2 of the last 3 seats left, when I went to pay for them I passed a £1 over but I’m hanged if they had any change, so I said as the only way out of the affair, keep the £1 for the present & I’ll call for the change tomorrow night, so that settled the thing.\n\nHad a thundering long route march this morning one of our pet officers took us out (4 eyes they call him on account of wearing spectacles) we got tangled up in the little narrow muddy lanes & got well out of our way. The boys counted him out but he seemed to take no notice. We had the \"pipes\" this morning for the first time & this made the march a little less tiresome than it would otherwise have been.\n\nPaid again this afternoon, nearly all the boys are overdrawn & there \nis\n are always great arguments over their pay but when they got hold of mine the Pay Sgt. said this book is like a drink to a thirsty horse, its such a\n\nrelief to get hold of a book that’s well in credit.\n\nA few of us got a bit of a shock after coming off parade today, just before they dismissed us the Sgt. Major called out a few names to fall out & report to the Orderly Room & among them was mine so up we goes. It turns out to be the report of us catching the wrong train at Paddington 5 weeks ago when the \"Jacks\" took our names. We should have travelled by the 6 p.m. instead of the 12 p.m., however the case was very simple because the authorities down this end failed to warn us so old Woods could do nothing else but dismiss us, but just fancy the mongrels sending that charge in after all that time & on such a paltry charge but what else can one expect of the wasters. These are generally the sort of things the \"Jacks\" go in for, if they caught the real wasters in our Army they would not be too\n\nbad but us they catch the \"Diggers\" for such trifles as these.\n","59":" Never felt so rotten for many a long day as I have done practically all last night, I had a fit of the \"blues\", & nothing could please me. I just felt as if I wanted to be left alone. The lady who I was with tried her hardest to cheer me up. She took me to a dance thinking the music & life would do me good but she could not have picked a worse place for I can’t dance & this only made me feel worse. We did not stop there long so she took me home & there we spent the rest of the evening with the family. I soon came round then & by the time I left I was in the best of spirits. The last time I had a fit of these \"blues\" was nearly a year ago at \"Rossignol Wood\" just close to Ypres. The only thing I can put them down to is restlessness & dissatisfaction with the whole concern & I am sure until I get out of the Military I shall often have them.\n","60":" Went down the city early yesterday evening mainly to collect my change from \"Moons\" before they closed, they recognized me as soon as I set foot inside the door & brought my change right away. After leaving here I went along to \"Genom’s\" for dinner, had my usual 3 courses, a good thick soup, such as oxtail, oyster or, tomato, fish & the usual trimmings, a sweet, bread & butter & coffee. This generally fixes me up & costs between 5 & 6\/- according to the quality of the fish you order. This is of course a flash restaurant & it can be got cheaper at other places, but I would rather pay a little more & have it well cooked & nicely served than go to the cheaper places where it is plentiful & coarse.\n\nAfter having dinner I took the tram to Devonport & there met my friend & back we went to Plymouth for we were going to the big concert at the Guildhall. The place was packed all the heads of the district being there. I never\n\ngot such a suck in in my life the singing of the \"Orpheus Male Choir\" was rotten absolutely. After they had sung 3 songs old Packmann was sighted coming on, his appearance was the signal for a great outburst of handclapping. He came slowly on, an old man of about 60 I should say he was, almost grey & with hair a foot long hanging down his back & curling up at the bottom like the old time pictures only it was not tied with a bow of ribbon, his trousers, the bottom of them dragged the ground & looked quite baggy, & he wore a big old swallow tailed coat altogether a most peculiar rig out. He went to the piano & tried the seat but it did not suit him so he motioned to his attendant & he shifted the seat, old Packmann tried it again but it wouldn’t suit, so the attendant shifted the seats & cushions again, the public by this time were being tickled & they started to snigger & laugh. Old Packmann turned round & with a wave of both hands made a motion for silence, the people stopped but\n\nnot for long for he made a least 6 attempts to get his seat in position & the people including myself could not help but laugh the old man seemed to be getting annoyed but eventually he got suited. Now I thought we will hear something but I never got such a shock for a long time, perhaps I am not sufficiently well educated enough to appreciate good music, but if they called this music well I have no desire to see or hear any more, taking things all round it was a rotten show that is from my stand point, but my friend was absolutely carried away & she seemed spell bound while he was playing, but then she understands such stuff having a couple of diplomas herself. She thought it was splendid. I was glad someone enjoyed the performance for I am sure I did not & I need scarcely say I was not the only one judging by the expressions behind me & all around. At the conclusion old\n\nPackmann graciously condescended to give a couple of extra thumpings, & so ended the show.\n\nIf ever I had anyone on a string I had the Sgts. in our hut this afternoon. It happened this way, every one is of course sick & tired of this place & we are all supposed to be on a boat roll which is the next to leave for Australia. The very fact of this is keeping our spirits up even though our departure had been cancelled, well I came rushing in the hut & started to rave about the authorities & etc. Of course when they heard me going off bang they pricked their ears up & wanted to know the cause of it. I made out I was too wild to even speak about it. This only made them all the more curious & they fearful of some impending evil begged me to tell them, so I out with it, told them that I had just seen the revised D.34 boat roll which had just come down from Horsferry Road & that not a single one of our names were on it, we had all been put off to let a lot of Hqr. people on. Well if you could only have\n\nthe look of consternation, rage, surprise & heaven only knows what else that came over their faces you would have screamed laughing. There was a tense silence for fully 30 seconds then such an outburst of swearing, abuse & condemnation of everything military that would have made a German blush. They swallowed the bait splendidly not a single one questioned or doubted my information & sincerity, they were going to parade in a body & asked to be sent back to France, write to Billy Hughes, tear the whole place down & etc. You never saw such a down-hearted crestfallen disappointed looking lot of men in your life, all their hopes dashed to the ground which we all had been building so much on, life did not seem to be worth living. Oh I had the laugh of them properly this time & by a strong effort of will power I kept a solemn & straight face & looked as down hearted & sick as the rest of \n\nthem. They were all happy & merry as larks till I sprung this thunderbolt on them but for the rest of the afternoon the hut was sad & gloomy till just before tea they started to sneak up to the Orderly Room to see if they could see the list. After about 6 or so had been up the officer thought there was something wrong & smelt a rat so he told one of the boys that the revised roll had not come down from London yet. Oh what a relief it was to them when they heard this, & what a reception I got when I came in. They had arranged a drum head Court Martial for me & I was sentenced to 6 months in a Cook shop with a muzzle on & some other awful punishments, but they reckoned I had carried the thing out so well & taken them in so completely that they would wash all my sentences out on condition that I should never give them such another fright, but I guess they will take some catching next time with a yarn like this, but what a success it was, put the wind up them completely.\n\nSaw in the papers today where the first lot of 1914 men have arrived home & got a splendid reception & here we are stuck in England yet.\n\nThe \"Advance party\" went to London this morning to bring our ship to here she is now at \"Tilbury Docks\".\n\nAm on duty today, Coy. Orderly Sgt. so have to stop in Camp tonight.\n","61":" There was a fine picture this morning in the \"Daily Mail\" of the \"Arc of Triumphe\" in Paris. When I was down there I wondered why on earth they had the great monument chained off & it stood fair across & at the top of the Champs Elysees, it seemed such a silly thing but I never troubled to enquire the reason of such action, but some time ago I found out the cause of it all, it appears that when the Germans beat France in 1870 they insisted much to the mortification of France of marching their Troops through the Arc of Triumphe & at\n\nthe same time French troops unarmed were made to line the roadway & also act as a Guard of honor, but this great insult was not enough Bismarck made the French people make hay along this beautiful boulevard while his men were marching through. This was done with the idea of overawing the population & treading them into the mud as it were, but the French took the insult in the way that perhaps only French people could, as soon as the Germans had finished all the highest ladies of France scrubbed the whole route with soap & water & then disinfected it to cleanse it of any & all filth that the Germans had left when they finished, but what a subtle & deep insult to the Hun this must have been, but that was not all, they built those chains round Napoleons great work & they vowed that no more traffic should pass through till they had had their revenge, & they waited 47 years for this to pass\n\n& now as I see in the paper this morning they are getting ready to open the Avenue with a great Victory procession. No wonder the French nation to a man hate Germany with a deep & undying hatred that I don’t think will ever die. As if it was not bad enough to take Alsace-Lorraine & £200,000,000 from her without adding all these cowardly insults to an honourable people who had fought fair & square, but they have had a bit of their own back & now King George is being welcomed by these same people & tomorrow old Foch & Tiger Clemenceau are coming to London how I should like to be there for if ever men deserved a welcome well these are they. I don’t reckon anything is too good for Foch, this war would still have been raging if he had not taken things over & directed operations, & what a success he made of things, & the English people fully realise this.\n\nWas up very early this morning getting my duties off for I am Orderly Sgt. & don’t finish till 10 oclock this morning.\n","62":" Well if ever I came a thud in my life it was last night & I have not finished laughing about it yet, nor am I likely to forget the incident in a hurry even though it brings discredit on myself in one way of looking at the affair, it happened this way – Last week I was running short of money & I cannot stand the idea of being out with a girl & having nothing in your pocket. I could easily have got some by wiring Mr. Duke but I was not going to do this so I told the Nissens I was going on leave for a few days. At the time I fully intended going but the night my pass came out all leave was unfortunately cancelled & I had to stop in Camp, now I thought I’ll keep away for a week & tell them that I have been on leave & so save a £1 or 2. I went down to town a few nights but I kept my eyes open half fearing to see Ethel, but all went well\n\ntill Sunday6 evening when Dimock & I went to the Sunday concert at the Royal. I felt uneasy the whole time I was in there & I kept continually looking round to see if she was there for I knew she was in the habit of attending these concerts but no she was not there that I could see but all the same something seemed to tell me that Ethel was handy. The next evening (Monday) I met her by arrangements & she asked me how I enjoyed my trip & etc. I told her a yarn about one thing & another & she asked me what train I came down from London in on Sunday night, now I thought here’s a pretty mess for I had neglected to look up the time table & see what time the trains got in. I started to think furiously & the best I could do was to say that I got in somewhere between 11 & 12 & had to walk all the way home from Millbay to St. Budeaux. Luckily she never questioned me any further but I thought at the time \n\nthere was something fishy in these questions. However it ended there for that night, but each night through the week she kept asking me little questions about my trip & Sunday in particular till I began to get a bit tangled & confused in my own mind for I had to remember a mass of lies that had been built one upon the other like a pyramid. I thought to myself what a wonderful knowledge old Shakespeare had of human beings when he said\n\n\"Oh what a tangled web we weave\n\nWhen first we practice to deceive.\n\nThis sort of thing went on till last night when Ethel asked me quite innocently what kind of a time I had at the Royal last Sunday evening. Well I nearly fell off the seat you could have knocked me down with a feather, after me telling all these lies to be bowled out like that, & the worst of it was that I can honestly say that this was the first deliberate lie that I had ever told that I can remember & I suppose she would think now that I was in the habit of doing & saying these things.\n\nAfter I had quite recovered from the shock I asked her how she found out, it appears that she sat up in the Dress Circle right behind me & could tell me everything I had done during the concert, & how all the week she had been killing herself laughing over my clumbsy methods of telling the tale, she reckons she knew right from the start that I had never been away from Plymouth, & of course she wanted to know the reason of my conduct, so I had to tell her the truth & wasn’t she mad. To think that I stopped away because I was getting short of money as if that made any difference to her, she reckoned I put her on a pretty low level to think that I thought she was after me for my money or what she could get out of me. She told me off properly & made me promise never to do such a thing again. I felt very small & vowed to myself that this would be my first & last experience of such things, at any rate we parted \n\nbetter friends than ever & I feel a thundering sight easier in mind today than I did all through the week. I told some of the lads about it this morning & they reckoned it was a splendid joke & one well against myself & they nearly burst their sides laughing.\n","63":" Ethel & I went over to Saltash which is in Cornwall, a big old ferry boat took us across & we passed dozens of destroyers all laying in line just close to Saltash bridge. We went for a stroll round the pretty little lanes & then back by train to Plymouth. We then went to Genom’s for dinner & seated at the same table was a French commercial traveller & he told us that he had been stranded in England for a fortnight & it would be a good 30 days before he could get across so crowded are the Channel boats, he was a bit of a mixture according to what he told us said his mother was Maltese his father Italian, & he had lived in Paris all his life.\n\nAfter dinner we went to the concert at the Royal, the only bright redeeming feature was an Australian Sgt., he was really good & the audience gave him a great reception.\n","64":" The boat roll was called again \ntoday\n yesterday and after it was over we all went through a medical inspection, they cut no less than 70 Sgts. off. Lord you should have heard the cursing & swearing. I have packed up my belongings two evenings & am going down town for the last time to say good bye to my friends & I am not looking forward with any great amount of pleasure to the ordeal.\n\nGot 2 fine big parcels from Miss Duke yesterday the cake was in perfect condition, how good she has been to me these last 4 years something like a friend, & the very thoughts of her has kept me from being tied up over here & I have had some terrific temptations, & now when we are on the verge of going off \n\nI am more than pleased over it, for I have had a big struggle here, but thank heavens I have a fairly strong will & keep a good grip of myself.\n\nSaid goodbye to my friends last night. The girl seemed very much cut up over my going away. I really can’t understand these English girls, now here was a thoroughly well-educated musical refined & well to do young girl regretting my departure for apparently she had grown fond of me during our 7 weeks acquaintance I guessed this, that was why I dreaded the night so much, & I can tell you I was mighty pleased when I got away. There was a great commotion in the house when I produced a bit of cake that Miss Duke had sent me they were excited over it for as they said they had seen nothing like it for 3 years & to me it brought back pre-war days, how they envied the people in Australia being able to get all the fruit currants & sugar they required, they reckoned the cake was\n\nsplendid & so it was.\n\nWe left our Camp this morning after numerous rolls had been called & we had been checked over & over again, right at the last minute they cut a lot of men off including some Sgts. in our hut. All of us had the wind up for we did not know right up to the last minute that we would not have been left behind also, just as we were moving off I got a letter from Dick Duke & I had just posted her one. We all moved off alphabetically & we had a band to play us down.\n\nNow the people rushed out when they heard the drums beating & cheered us & wished us a good voyage & etc. We did not have to march a great distance for we went in by the Naval Barracks gate & what a reception we got from the sailors some of their officers rushed along the roadway & got all the \"Tars\" to line up & they called for 3 cheers for the Australians as we marched through, the whole line broke into\n\na perfect storm of cheers, & we cheered them back, very easy to see the good feeling that exists between the Navy & the \"Aussies\" they gave us a stirring send off which must have made the blood run quicker in the most cold blooded man, theres one thing this war has done & that is drawn the Empire closer together than ever & what a wonderful example the British Empire has set the world, not one of the far flung Dominions pulled out or showed the slightest anxiety to do so, not even when things looked black & hopeless & defeat stared us in the face, sink or swim together they decided to do & they made a pretty good swim of it, but I am wandering again.\n\nWe passed on our way through the great yards & workshops some or I should say enomorous great guns all laying out in the open ready for putting in warships at any time but I don’t think they will ever be wanted for battle purposes for I cant see the British Navy doing any more fighting for some time.\n\nAt last we reached the ship & she turned out to be the old \"Port Hacking\" sure enough as each man went aboard he had to hand a card which he filled in with particulars of himself & etc. & his pay book to an officer who was collecting them. Another old chap then handed each man an envelope containing a message of congratulation from the King & Queen & we filed downstairs to our quarters. The Sgts. are separated from the rest we have a fairly good little joint. We soon got our hammocks & blankets & then had dinner for we got aboard about 10.30. After dinner I went up on deck for Ethel was coming to see me if she could get past the police sure enough she was there but they would not allow me to go off the ship. I could go out along the gangway which I did & we had a good yarn by the time she went she had about 61 letters to post for the chaps kept on bringing them out to her for this was their last chance of posting a letter\n\nin all probability before sailing. She left about 2 oclock & I went down below & started to write up the days doings & by now I am beginning to feel pretty rotten so one can guess what kind of a time I am going to have. I am dreading the first few days for I am no sailor, anyone \nwhe\n can have my rations for the next 3 or 4 days or I will be greatly mistaken. Braithwaite has just given me a dose of Beechams pills & what a job I had to get them down they insisted on sticking in my throat & the coating started to wear off & my mouth began to feel like or taste like a chemist shop so I had to dash downstairs & swallow some water which thank heavens shifted the obstruction.\n","65":" Got very little sleep last night the hammock seemed so strange I had quite a job to keep in mine & I felt rotten & to make matters worse one of my teeth has been nagging for the last couple of days.\n\nThe food on the boat is excellent for breakfast this morning we had\n\nporridge, currie, sausage & bacon good Australian butter & white bread sugar on the table & condiments so if they keep this sort of thing up the troops will feel like tigers by the time we arrive home.\n\nWe pulled out of the harbour exactly 12 oclock & on our way down the Tamar passed lines upon lines of warships of all nationalities just off the Hoe we passed the U126 a German submarine she was being towed into Devonport. She looked as rusty & as dirty as could be as did a couple of squarheads who were standing on her deck she was flying the White Ensign & all eyes were turned upon her & many were the curses chucked at her & her likes. We dropped anchor right close to a Japanese cruiser but did not remain long about 5 oclock a chap who had got on the boat somehow was caught & sent off, he nearly got away. We picked up our anchor at 6.30 & I went on deck to get a last look at good old England for I don’t\n\nsuppose that I shall ever set eyes on her again & I have only happy memories to think of her with & especially Plymouth. We soon cleared the breakwater & light house & by now the old ship is rocking like fun & I am beginning to feel squeamish so I will cut this short & go & put my hammock up & get ready to turn in.\n","66":" Was wofully sick last night I am still so. I am forcing myself to eat but it’s the job of the world & I don’t scarce care a hang what happens but luckily I have some good mates & they are looking after me. We are just about into the Bay of Biscay & there is a terrible heavy swell running & our old tub is dipping & diving & rolling like an old tub, early this morning the great \"Naterland\" passed us on her way to Bordeaux. The weather is very cold & a heavy sea is running I have been wet through several times for I dare not go below for any length of time & there are hundreds more in the same boat.\n\nSome are even worse than I am poor George Horan is nearly dead & has no further interest in life.\n\nWe were issued with shoes trousers & coats today for the trip.\n","67":" Have had a dreadful day splitting headaches & crook all over don’t scarcely care what happens. I lay in the one place for exactly 7 hours today & was incapable of moving even if I wanted to do so, so sick was I, but tonight thank heaven there is a slight improvement, how the old tub is rolling something dreadful bangs the world I don’t know what she wouldn’t do if she struck a real heavy sea.\n\nSaw a couple of whales spouting today we could not see them too plain for they were a fair way off & heavy rollers kept on obscuring them.\n\nOne could notice the difference in the air today compared to yesterday it was quite & the sun shone nearly the whole day.\n\nI am having a great difficulty writing these lines for the ship is nearly turning over every few minutes, we have lost half our crockery already. You should have seen it sliding up & down, & off the table these last couple of days would make the eyes of china manufacturers shine. I can see us having a pretty bill to pay at the end.\n","68":" Have been nearly dead the whole day long nothing but a shipwreck would have any interest for me poor Horan & I laid down on the deck & we stopped there for the day & only were roused by a squall which forced us to go below & it is like a little Hell down there how the place stinks it makes me sick when I even think of the place. This morning I took a dose of salts & they were in warm water ugh. The most horrible stuff I ever tasted but it done me the world of good for it opened my bowels & eased my frightful headache a lot. I only had a piece of dry toast for\n\nthe whole day, it has been very rough & the big long Atlantic rollers have been swelling up with great regularity roughly about 150 yards apart & our old tub has been getting a pretty rough time, & giving it also, you ought to hear the remarks that have been passed about her & old Billy Hughes & etc. We actually passed a ship this morning I did not think that possible the lord only knows what the pace of the other boat must be we all thought we had the slowest boat on the ocean. Theres one thing I’m certain of, & that is that this is my last big ocean trip if I know anything about it I’m pulling out for good, & digging in, in \"Aussie\". No more of this agony for me I’ve never felt so bad in all my life before & I did not care a hang whether we floated or sank. I can eat nothing but my whole system craves for fruit, that & porridge are the only things I care for at present &\n\nfruit we cannot get, how we are all looking forward to getting to Port Said & tearing the big juicy oranges into us & then on to Aussie the land of fruit, practically speaking we have had no fruit since leaving Egypt in 1916 for such luxuries are out of the question in England unless you are a multi millionaire or a munition worker.\n","69":" Thank heaven I feel a lot better this morning my head has almost stopped aching & throbbing & my stomach seems to be getting settled. I had a few hours sleep last night almost the first I have had since leaving Plymouth, most of the nights have been spent rolling about the decks with the motion of the ship & when I looked in the glass this morning I looked a most disreputable person more like a bagman down on his luck than anything else so I promptly set to work to straighten things up a bit & by now 12 o’clock I am feeling very much fitter.\n\nWe have just had a boat alarm & we all had to go to our stations with our\n\nlifebelt on, this is the usual thing, to get the troops used to their stations in \na\n case anything happened, just before the alarm we had a service for it is Sunday morning & a most beautiful one at that. The old parson impressed upon the boys the need to control their language now that they are going home to their people he drove his point well home & quite right he is too, for a lot of the language is very far from choice what you hear flying around & there is need for a bit of control.\n\nA fine big school of porpoises passed under our boat this morning & went flying away on our port side how graceful they looked as they leapt in & out of the water & all together at that.\n\nHave just had dinner & we have had to hold our plates with one hand & eat with the other for the boat is rolling like fun & things are sliding & crashing all over the place. Our first course was soup rabbit stew followed, after that roast beef potatoes peas & gravy & finished\n\nwith plum pudding not so bad you know & tons of it to spare theres no shortage here, & in addition there is always tons of bread & butter jam & cheese if they keep this sort of thing up for the voyage we ought to land in very fair condition.\n","70":" Slept on deck last night for I did not want to miss seeing Gibraltar at any price & I thought I might do so if I stopped down below it was simply a glorious night the stars shone the whole time & when I woke this morning the coast of Africa was quite close & looming far away in the distance was the famous \"Rock\". We were some distance off so I had breakfast & then brought my camera up just before we got into the harbour an enormorous whale passed us blowing like fun on the starboard side & hundreds of porpoises came rolling & diving out to meet us & they played all about the ship till we ran into the harbour.\n\nIt was a glorious morning & the sun was shining brilliantly showing up the white Moorish houses & villages on the African\n\nside & also the Spanish, the houses are all built of white stone & with the sun bathing it they looked almost snow white. The back ground of barren rocky mountain makes them show up all the more, approaching Gib. she gives one the impression of an absolutely impregnable fortress for on one side she is a sheer drop from the top to the bottom something like a thousand feet I should think & the side facing the Atlantic is nearly as bad she has trees growing on this side & all over the rock roads are cut & weak places in the mountain are concreted to some order, round the base a little Town nestles white walls & red roofs the usual Eastern fashion it straggles round the mountain, houses seem perched on top of one another as if struggling for a foothold on the steppes. An odd gun is to be seen but I expect they are dummies for the whole mountain is honeycombed with galleries & the walls are reinforced with steel plates. They say she is provisioned for 7 years\n\nin case anything should ever happen, this rock rises sheer from the ocean on all sides & the top is like a razorback.\n\nShe looks that sharp from a distance that if a man was to sit straddle legs over it he would be cut in half for it has the appearance of a knife edge, the rock is also hollow backed & both ends rise to sharp points, on one of which there is a wireless station, she looks harmless enough from the ocean for nothing military is to be seen except a few barracks but anyone expecting to see rows of gaping cannons would be bitterly disappointed. You can’t even pick up with the aid of glasses where the guns would fire from, everything is so well camoflaged, yet everyone knows that if needed the whole side would be a mass of flaming & roaring guns true enough she is the gateway to the East & if Gibraltar said \"no\" no ship would ever get through its only a matter of 14 miles to the African coast & from the height of the Rock her guns could\n\nsink ships miles away. I can just imagine the task of the French & Spanish fleets when they besieged Gibraltar for 3 years & then failed to take it, its about the most disheartening thing to look at with the idea of capturing that I know of for I’m certain that no man would scale one side even if he tried for a life time for it’s a precipice hes got to climb & in places it actually leans towards the sea, seems to have been made by Providence. No wonder the Spanish hate us with this thorn sticking in their side, as we came to anchor a little boat dashed up flying the white ensign & wanted to know where we were from, Devonport was the answer, \"whats your passengers\" \"troops returning to Australia\", whats your name & speed \"Port Hacking & 11 knots the Chap hesitated when he said 11 knots for he thought one of the boys might have chipped in for we all make a joke of her speed & compare her to the slowest things we know of. Where are you bound for \"Melbourne\" got \n\nany sickness aboard, \"no\" righto he said stand by & wait for instructions, while we were waiting the Y.M.C.A. distributed a lot of cards & we hurriedly scribbled a few lines & sent them off. We did not stop more than an hour we then pulled out & are now getting for our lives down the Mediterrean under her famous blue sky & a glorious sun all are on deck sunning themselves. I took 3 snaps of old Gib. in different positions. I have always wanted to see this world famous fort of ours & now I am satisfied for we could not have had a more perfect day & a more glorious view & I shall never forget how she stands like a sentinel on guard watching the opening to two oceans & also keeping an eye on Africa she is a never to be forgotten sight as you swing out from the harbour & pass her end on, of all the massive bold steep rocks as ever I have seen she is easily first & no wonder she is classed as the most impregnable fortress in the whole world & valued by England as she is.\n\nWell I am satisfied that I have not lost all my nerve yet, after this afternoon, ever since I came on board this boat one of my big back teeth has been aching mad, a perfect brute, & my face had swollen badly, I could get no enjoyment neither could I eat nor sleep, so I decided to see a dentist Sgt. & see if he could do anything for me so after dinner I asks him about it & he took me into the dispensary & had a look at the brute, well he said Sgt. we have not got a syringe on board so I can’t give you any cocaine, but if you are game enough to have it out without anything I’ll do my best for you. This put the wind up me properly for I had never taken such a thing as this into consideration & I am a regular coward even with cocaine. I began to turn things over in my mind, & I came to the conclusion that it had to come out & it would be better to put up with perhaps 3 minutes\n\nintense pain & have done with it than to hang on perhaps for a month or so & suffer the whole time, so I made my decision & said right oh Sgt. have a go at her, once my mind was made up I was right so he sat me down & got his tools ready, he then called 2 more chaps in & one got hold of my head & another steadied my shoulders & I got a good grip of the seat & opened my mouth, in went the forceps & for the next minute I did not know whether I was standing on my head or feet I thought my head was coming off though, at last oh heaven what a relief out she come a beauty & with a nice little abycess hanging on the end no wonder my face ached, but what a relief once it was over I felt like a new man straight away, & I was as pleased as Punch with myself for that tooth had me bluffed in England where I could have got all sorts of attention with it, but no I kept putting the evil day off & at last I had to have it out in about the most unexpected place & circumstances.\n\nThey paid the S. Australians & Tasmanians this morning & they are paying the rest this afternoon, at the present time gambling is in full swing.\n","71":" We are having a bonza time on our old boat nothing to do all day long & practically no duties, even with what little work that has to be done some of the boys are not playing the game though. The Adjutant gave us a little lecture on the subject told them how it was the C.O.s intention to give them as little as was possible to do, but when they were detailed for a duty they should carry it out & not slink away & leave a few to finish the job like some of them have been doing he said if they did not put a stop to this they would have to take steps to \nput\n catch the offenders & punish them & no one wants anything like this to occur for we want to go home without a crime for the trip.\n\nIt has been another lovely day & the old tub is making quite good progress. She is averaging just on 12 Knots an hour which is far better than any of us ever thought she would raise.\n\nSaw some big waterspouts just before dinner today they went away up in to the air & then followed a heavy downpour of rain, there is land in sight tonight on our starboard, fancy it must be the coast of Algiers.\n\nThey are putting a stop as far as they can to all gambling on board & quite right too for wherever you look there are schools of \"two up\" crown & anchor, dice roulette & etc., this sort of thing is all right in a way but there are too many sharks who are living on the game for in our returning 1914 men we have numbers of wasters who have scarce fired a shot in this war & this sort of thing if allowed to flourish is a regular harvest to such as they, so down with them by all means.\n\nHave been reading \"Our Mutual Friend\" nearly all day long it is a very interesting book & one of Dickens best.\n\nIt is now 10.30 & I am just scribbling these few lines before going to bed after a highly successful night of \"bridge\". I play this game practically every evening after tea & am considered a first rate player (sounds like skiting but true nevertheless) well Bob Modral & I hit them up by over 3,000 points, the last 2 rubbers we scored 1,897 while our opponents got 136, some rapid scoring if you like & they fancied themselves when they started I don’t think they will be very keen for revenge.\n\nThe last 2 nights I have slept on deck but the dew is far too heavy to be healthy so I am coming down below for a few more nights, in this part of the world the dews are exceptionally severe they will wet you through during the night.\n","72":" The Major gave the whole boat a short lecture on the gambling evil this morning, says he is quite decided to put it down at all costs & he is right as every right thinking person must admit for a lot of chaps on this boat have not the slightest scruples if they lose their money by gambling, well they can always make it up at someone else’s expense & this is what invariably occurs for they will have money by hook or crook.\n\nThe sea has been like a millpond the last 3 days & the old ship has averaged 274 miles per day.\n\nHad our first concert on board last night but I did not attend was too busy playing \"bridge\".\n\nA tailors & barbers shop has just been opened \"forrard\" these should prove very handy for they are both necessary additions.\n","73":" A heavy gale of wind sprang up last night & this morning the old tub is rocking unmercifully & my poor head is spinning like a top it would not want too much more to send me rushing upstairs & to hang over the rails & let my breakfast go for the benefit of the fishes. I am satisfied that I am no sailor. I nearly got wet through this morning a big wave came rushing up & broke with a crash right over our ship luckily I saw her coming & ducked behind cover just in time to miss the father of a ducking which a few more not so \nunfo\n fortunate as myself received, what ducks they looked when they recovered their breath & beat it for safety & a change.\n","74":" Yesterday was a good illustration of how sky affects the color of the sea, the day was cloudy & little squalls kept on coming\n\nup the whole ocean under these conditions looked almost black & oily. She looked far from being the famous blue Mediterrean that poets sing of. This morning all the clouds being swept away & the sun shining the ocean had quite resumed its well known hue, in fact I never saw it look so pretty & blue before if you were to mix as much Ricketts blue as water will hold it would be no bluer than the sea is today it is \nf\n in fact just lovely.\n\nThere \nwas\n were a couple of fights on board today, one between Wells & a Stoker, our chap won easily & a couple of other flutters.\n\nHave been writing steadily nearly the whole day have rattled off 18 pages of nonsense thank goodness I have nearly finished, only 1 more to write, am going to post them at Port Said.\n\nIt is a glorious night & Bill Egan & I have just finished a good long yarn which we had hanging over the railings of the ship. I am going on top tonight & chance whether it rains or not, do you know I can’t realize that I am actually on my way home yet, it seems to be just like a dream. I often lay awake of a night & pinch myself to find out if I am really alive & not dreaming & yet its true, how do I feel, well so far I can’t explain my feelings I am taking it as a matter of course the same as I have taken everything the last 4 years & yet underlying all there is an emotion of almost complete happiness & the thought that we are going home victorious beyond even our wildest imaginings only heightens that enjoyment for one can now look the whole world in the face satisfied in his own heart that he has done all that was expected of him & perhaps a little more, & he has justified being\n\nbrought into this world somehow I feel that if I was to die tomorrow I have not lived in vain but have done my little bit to clear this world of the greatest monster of all times. I expect we will fully appreciate our position when we begin to get closer to dear old Aussie & our dreams are about to be realized. I am sure that is what has kept most of us alive all through this awful war, the very thought that we would one day return to our native land & get among our own people again. I know it has kept me going many & many a time when life has not seemed worth living & everything hopeless, & yet after all fighting is a most necessary evil in this old world. I reckon nations go backwards without wars look at Spain for instance what a decadent nation she is, she wants a good hard struggle with a nation her own match to develop her manhood &\n\nresources & brains & etc. this war bad though it is has been the salvation of England which was undoubtedly drifting in to a very peaceful condition & were fast losing their warlike spirit but now everything is changed & today we stand at the head of the world stronger than ever for we know our power & so do the rest of the nations, another thing how on earth can anyone love a thing without wishing to fight for it if need be, to me the two go together loving & fighting, but of course they want to be used in moderation, what is worse than Nietzsche when he says that we should go in for fighting instead of loving, & there can be no worse sign than that a man should be found even Tolstoi to tell us that we should go in for loving instead of fighting, the two things go hand in hand for how on earth can we lose a thing without wanting to fight for it, & you cannot fight\n\nwithout having something to love, that at any rate is my own opinion of such things & I for one am strongly against this world wide disarmament that some politicians talk so glibly of, no doubt Germany made a fine nation of her peoples but unfortunately she used it to a bad purpose. I am not one of these canting one-sided bitter predjuiced snoozers who reckon that a German should not be allowed to live after this. I reckon in one way she has done the world taking things all round a jolly good turn, there’s one thing she united the British Empire more closely than ever would have been the case otherwise, & much as I deplore the awful loss of life & suffering, I believe fully that such things have to be & they will come in some shape or form, & there’s no need for all the blame to go on the side like we are trying to put things we were not altogether blameless in this great war.\n","75":" Very dull & cloudy today. Sports are being held on the for’rard deck this afternoon, the skipping competition was the main one they had to skip at the rate of a 100 per minute & were allowed 2 breaks, there was the usual rivalry between Victoria & New South Wales over it, but the former won amidst great applause, a chap named Wells put up 2323 against the next mans 1787 not bad going.\n\nThere is trouble on our ship with the fireman they are demanding better food & until they get it they won’t work hard, consequently for the last 24 hours our ship has been going at a snail’s pace. I don’t know how it is going to end, the men can’t refuse to work but they make it that crook that the boilers have hardly enough steam to push the ship along. I don’t know how far their claim is justified, they reckon their food is not nearly as good\n\nas ours, if that is true, well I reckon they are in the right, its hard luck if these great shipping Companies can’t feed their man properly out of all the huge profits they have been making during this war, & fireman want feeding well for this work is very very hard. I know for I had a go coming across the Red Sea 4 years ago.\n\nA big thunderstorm has been raging nearly all the evening the thunder & lightening has been terrific to look at it from the ship as each storm passed over us & the lightening sprang up in the sky it put me in mind of big shells bursting in the air like they used to in France, & the thunder as it roared crashed & rolled in ominous peals for all the world was like a heavy barrage, luckily most of the storm passed us on the African side thus we had a jolly good view of the scene.\n\n"}}