{"Document Name":{"0":"Diary_0018","1":"Diary_0018","2":"Diary_0018","3":"Diary_0018","4":"Diary_0018","5":"Diary_0018","6":"Diary_0018","7":"Diary_0018","8":"Diary_0018","9":"Diary_0018","10":"Diary_0018","11":"Diary_0018","12":"Diary_0018","13":"Diary_0018","14":"Diary_0018","15":"Diary_0018","16":"Diary_0018","17":"Diary_0018","18":"Diary_0018","19":"Diary_0018","20":"Diary_0018","21":"Diary_0018","22":"Diary_0018","23":"Diary_0018","24":"Diary_0018","25":"Diary_0018","26":"Diary_0018","27":"Diary_0018","28":"Diary_0018"},"Date":{"0":"unknown","1":993.0,"2":994.0,"3":995.0,"4":997.0,"5":998.0,"6":999.0,"7":1000.0,"8":1001.0,"9":1002.0,"10":1003.0,"11":1004.0,"12":1005.0,"13":1006.0,"14":1007.0,"15":1008.0,"16":1009.0,"17":1010.0,"18":1011.0,"19":1012.0,"20":1013.0,"21":1014.0,"22":1015.0,"23":1016.0,"24":1018.0,"25":1019.0,"26":1023.0,"27":1024.0,"28":1025.0},"Entry":{"0":"\n\nmarching through her streets just outside Ypres runs the Yser & the bridge over her for a wonder still stands, we crossed this & made for the firing line, everything about here shows the signs hard usuage & there are great shell holes everywhere in the roads, fields, the railway line torn up & such like gentle reminders that shells hurt. \n\nAs we went along the German flares lit the whole country up & from these strings of flares we could see we were in a huge horseshoe otherwise the \"Ypres Salient\" it was round about the part that the Germans made their first gas attack on the Canadians & French\n\non the ","1":" although it was a great success in one way & killed thousands of men, it really was about the greatest blunder they have made so far in this war for had they realized the effect the stuff would have on the men they would have concentrated a large Army behind them when they let it go instead of the few reserves they really were able to throw against us, the result was that they gained a little ground, where if they had enough men they could have marched on Paris & nothing could have stopped them for the gas practically wiped out all the men in front for at that time we had no\n\nhelmets of any description for gas was never counted on, then Providence seemed to step in & for the next 4 months the wind blew towards them & gave the English & French time to perfect their helmets.\n\nAbout an hours march brought us to the line we were to occupy, & there were great big dugouts ready for us some of them lit with electric light but mostly officers.\n\nRight in front of us there is a fine big lake & she is full of fish but every time you go near her you take your life in your hands for the Germans snipe at you from Hill 60 which is right opposite us & will go up in the air any day for she is undermined \n\nby both sides.\n\nThis morning I had a party at work building a place for our cooks to use they are coming tonight. Bread & treacle is our tucker to day not too flash.\n\nThe Germans are throwing a fair bit of high explosive about on the roads this morning most of it is that yellowish stuff \"wooly bears\" we call them. \n\nHad a good cold bath this afternoon in a little creek that runs quite close to us, I saw some teal there this morning. Am on Brigade Hqr’s guard this evening myself & 6 men its not so bad for it is not ceremonial thats the guard I \n\nhate for you have to have everything so spick & span or else look out for trouble.\n\nThere are some large cemetries around this part & they appear to be well looked after by the Belgian’s or our authorities I don’t know which\n\nAs I write this the Germans are shelling 2 of our aeroplanes for all they are worth but they don’t appear to take much notice of the shells that are bursting like white wooly fleeces all round them.\n\nAll vegetation especially trees & hedges show the effects of the gas upon them, a lot are dead & the majority are very seedy looking on it.\n\n3rd. We had no less than 3 gas alarms last night, you could hear the horns for miles & miles they kick up an awful row, but each one turned out to be a blank.\n\nThere is great aerial activity this morning & our chaps are busy shooting their anti-aircrafts at them & chasing them back over their own lines, & old Fritz is spouting up into the clouds hundreds of shells at our battleplanes Tucker is still pretty crook a slice of bread & jam for breakfast only & no tea so far.\n\nThis morning broke nice & sunny & for a while it was bonzer but it looks very much like rain this afternoon, it is muggy & close.\n\nThis is the place for rats & such wallopers, the place simply swarm’s with them, there was a mixed crowd out last night hunting them, one Staff captain, 1 Medical Officer with a wooden leg the result of Gallopoli & a shell, some N.C.O’s & a swag of privates, they got quite a number dug some out of their holes & got a lot more under old heaps of timber & duckboards, each one was armed with a stick & pity help the rat once discovered.\n\nThey have some \"Ross\" rifles here & they are nice looking, the magazine especially takes my fancy, the Canadians use them.\n\nThey buried the first Australian in their little cemetry to day he was a \n\n2nd Batt. Sergeant Archibald by name & he was also an original \"By Jove\" they are getting scarce now theres very few will go home of the original 1st Div. that is those who have any length of service to their credit.\n","2":" Had charge of a party of 15 men last night, an officer in B. Coy brought 20 men up & took charge of the lot, we went up to the firing line & just as we reached it we had to \"about turn\" & to back about 300 yards & lay down on the side of what had once been a road, now a succession of water holes which was as you may guess\n\nthe result of German bombardments at different times & into these holes we were constantly stepping, & to make matters worse the machine guns were playing all around & over us for the Germans well know that we use the road of a night & so have the guns playing on it, however luckily no one was hit. We laid low for nearly an hour till the officer found his job, at last the Colonel came along as unconcernedly as you please & put us on the right track our job turned out to be deepening an old communication trench\n\nrunning out towards \"No mans land\" it was in a terrible state for it had not been used for some time & was wet & boggy, during the night we dug up a dead man & he gave off a pretty high smell We worked on this job till 3.30 with machine guns playing over us all the time, but they were harmless for they were shooting to high to catch any of us, though some of the trench mortars lobbed fairly close to us, there was fairly heavy fighting with the mortars during most of the night the boys are never satisfied unless they are kicking up \n\na stink, after coming home we slipped into bed & never got up till dinner time for we were all very tired.\n\nTo-day is nasty & wet & we are going out again tonight Len is on Battalion Hqrs tonight he has the guard & a good job it is especially these wet nights.\n\n5th. The whole of C. & B. Coy’s were out last night & didn’t we have a time of it, it rained more or less heavily the whole time, & it was the fun of the world to see us all slipping all over the place into the shell-holes nearly full of water, & sometimes on to the broad of your back in the slippy sloppy clay talk about a time we could not stop ourselves\n\nfrom laughing in spite of the rotten time we were having & to make matters worse the night was pitch dark & the hundreds of flares that were going up only makes matters worse for when they do go out it is almost impossible to see, & the machine guns were playing all over the place, well we reached our job at last, & a nice one it was rebuilding an old trench that the Germans smashed to pieces on the Canadians in June, I took an \"Outpost\" out in \"No mans Land\" a pretty risky job we were there to protect our men from surprise attacks by the Germans, for you know the trenches are not continuous\n\n& both sides have patrols out constantly, already our boys have some scraps with them & rushed them out of some shell holes & craters, it seems impossible to hold Australians back they will have a smack at anything.\n\nAbout 11’ oclock we got a shock for the Germans opened a terrific mortar bombardment on our trenches & they gave us particular Hell you could count as many as 10 in the air at once & you can see them quite plainly for they leave a trail of sparks behind them & when they turn in the air they glow like red hot bulbs, the pace they travel at generates the heat, you can hear them coming\n\ndown quite plainly & if the timing of the fuse is a little slow you can hear them hit the soft ground with a thud & dig right in they are fairly harmless then for you have time to get away from them but I dont like those that burst in the air or percussion, for they are very dangerous, would you believe it these bombs weigh no less than 180 lbs so you can imagine what kind of a row was on especially when you add \"Aerial torpedoes\" (a very dangerous weapon) hand bombs & rifle grenades & on top of this a few howitzer’s, its wonderful how men escape from being exterminated\n\nit seems impossible that human beings can live in it, I’m afraid my nerves are beginning to give a little, but can you wonder for I have been through something that would make 99% of men go under & I can’t complain about them. \n\nThis bombardment continued for an hour & I was very lucky for I had just got an \"order\" to join the Coy & bring my men in when one of these enormous \"oil drum\" bombs landed right where our outpost\" was stationed, Providence again I reckon for had we been there it would have been good bye the lot & we should never have seen Australia again, but there you are luck again\n\nthe trench we were building came in very handy for that practically saved us & I can tell you we hugged it closely. I don’t know what their object could have been for there was no method in their shelling they shot their bombs anywhere & most of them fell, where from our point of view, where they all ought to go, out in an open grass paddock that’s the place for them.\n\nAfter it had all died down we resumed our work & knocked off at 2.30 & reached home thoroughly tired out & wet to the skin & soon all were fast asleep after a most adven-\n\n-turous night.\n\nAs we were going up last night we distinctly felt the concussion of a mine that had been fired somewhere it shook the ground like an earthquake\n\nThere is a rumour going round this morning to the effect that all those who took part in the Landing Lone Pine & Evacuation are to have a distinctive mark on their colors some say the letter A. let into the colours both Len & I would be among the few to be honored.\n\nOur artillery has been going hammer & tongs most of the day tearing it into old Fritz’s trenches & positions\n\nWe have a small Y.M.C.A. canteen in our line of dug-outs but the principal things they seem to have are candles & cigarettes now & again they get a supply in but it does not last long for they are soon sold out\n\nWe laid in bed till just on dinner time for it was raining heavily all the morning & it still continues to pour down a nice time we will have of it to-night what oh\n\n6th. Fell in last night in pouring rain, & just before we moved off we got an order to get in to our dugouts for a while, but about half an hour after we were called out & went up to the work\n\nWe had to carry a lot of duck boards & hurdles up with us for we were going to put down a floor in the portion of trenches we had completed & a nice job it was for there was easily a foot of water & slush in the bottom & the men had to work in this, we finished at 2 oclock & come home then.\n\nThe 2nd Battalion got a nasty dishing up last night had 18 men Killed including 2 Capt. & 4 Lieut’s \"Aerial torpedoes\" got them I believe.\n\nSaw another Taube brought down this morning by one of our planes he come a beautiful buster.\n\nThe following is a parody\" on \"Sing me to Sleep\" & is a great favorite among the boys\n\nSing me to sleep, the bullets fall\n\nLet me forget the war & all\n\nDamp is my dugout cold is my feet\n\nNothing but biscuits & bully to eat\n\nFar far from Pozeries I want to be\n\nWhere German snipers can’t pot at me\n\nThink of me crouching where the worms creep\n\nWaiting for shrapnel to sing me to sleep\n\nRefrain\n\nSing me to sleep where bombs explode\n\nAnd shrapnel shells are à la mode\n\nOr the sand bags \nin front of me\n behind me you’ll find\n\nCorpse’s in front of you corpses behind\n\nRefrain\n\nAprès la guerre n’a pu\n\nAustralian soldat partit\n\nMademoiselle in an awful way\n\nAprès le guerre – \n\nAprès la guerre, (pron) after the war\n\nParlez vous parley voo\n\nPartit. party \n\nN’a pu na poo\"\n\nHere is another one\n\nI want to go home\n\nI want to go home\n\nI don’t want to go to the trenches no more\n\nWhere Fritzie is sending (\"Jack Johnsons galore\")\n\nTake me over the sea\n\nWhere the Allemand can’t snipe at me\n\noh my I don’t want to die\n\nI want to go home\n\nJack Johnsons & whizz bangs\"\n\nAround me they fly \n\nI want a \"Blighty\" I don’t want to die\n\nTake me over the sea\n\nWhere the Allemand can’t get at me\n\noh my I’m too young to die\n\nI want to go home.\n\nThis is a nice one\n\nWhen the military band is playing\n\n\"Rule Britannia\" \"God save the King\" \n\nThere is one thing only \n\nThat is \none thing only\n when you’re sad & lonely\n\nOut in the trenches\n\nYou will think of the wenches\n\nYou left far over the foam\n\nThis evening we moved from our dugouts to let the 2nd Bn in we shifted round towards\n\nour Hqr’s the dugouts here are built under the railway line & are not much good for they are so crowded I had charge of a party of 18 men to night & had to take them to an altogether new position, so the Captain called me in to his dugout & showed me the map of the sector, it was a fair way off & behind \"Zillebeke\" up towards the 2nd Bn. the name of the joint was Rudkin House but save the mark there’s not 2 bricks left standing.\n\nOn the way up I was not quite sure of the way so I called in to the 2nd Bn Hqrs to enquire, I was shown in to where the officers were having their mess, & the Colonel told me I was on the right track\n\nWhen I got to where the directions led me I halted the men & as no one was there I went ahead myself to see if I could find the Engineer who I had to report to, I took a risk for the road I went up was very dangerous for they were firing straight down it with machine guns at last I reached the top & hang me if I did not run into the support trenches which the","3":" Bn. were occupying, I enquired of them were this Rudkin House was but they could not tell me but as luck happened a couple of Brigade officers came along at that moment & I asked them, & they were on their way to the same place so I went down with them, the men were in\n\nthe right place but the Sergeant had not turned up as yet, however he came along a few minutes after\n\nThe work was carrying, sheet iron, timber, & duckboards up to the front line trenches, for they are in a most disgraceful state it was the same at Fromelles (where we first went in when coming to France) & Fleurbaix, but I can assure you they were in a different state when we left, they can say what they like but during my 2 years active service the trenches we occupy are better then any I have seen the British or Canadians with when we finish with them, it was the same on Gallopoli as the British officers themselves admitted\n\nWe finished pretty early on this job.\n","4":" There was another great air raid last night, you could hear the engines whirring for hours as they passed over head, & the Germans were searching the sky with their searchlights but they could not find them, what a time they are having over Germany way they are beaten absolutely now but they won’t admit it as yet & again this morning another fleet of 27 went over, didn’t the Hun’s tear it into them but the planes took absolutely no notice of it no more than if it were a storm of eggshells they were shooting at them they are cool alright are our airmen\n\nWe are getting a lot of pork & beans now the great Yankee dish\n\nthe cooks use it to thicken the stews & it makes a bonzer meal.\n\nWe are going into the trenches tonight \"supports\" I think, Len took 3 men up last night to act as guides There are some water hens on a small lake quite close to us & now & again the boys pot one with the rifle. \n\nLast night they caught a German sniper out between the trenches & a couple of Germans gave themselves up, full to the neck of it.\n\nThe Huns have been searching all day long for one of our batteries which is quite close to us, but they have done no damage.\n\nTo-day has been a bonzer nice & sunny I hope it holds fine for our stay in the trenches\n","5":" Here we are again back in the trenches & among the bombs & bullets As soon as we got settled down & the 3rd Batt. had filed out we started work, first I had a party cleaning out an old dugout for our cooks, for unlike the Tommies or Canadians our chaps are going to cook in the trenches & take their chance so as we can have hot meals, the others have always done without them while in these trenches for they reckon we will get blown to pieces if they catch sight of the smoke\n\nDuring the night I had several other parties at work on various jobs which kept me up all the time\n\nThere are a few Canadians left\n\nhere, they belong to the Mining Batt. & are tunneling under the German lines, they reckon the whole line is mined Ypres to Armienties & is almost ready to blow up, there will be something doing then I’ll bet. \n\nGreat big dugouts are being built along the line they are about 20 feet deep & are big enough some of them to hold a hundred men nicely.\n\nThe trenches here are in a most disgraceful state, the Canadians don’t seem to have made any attempt to keep them up to the scratch, you can wade through mud & slush a foot deep & if you dig down you will come to duckboards & galvanized iron that they have let be swamped & in some places you can dig them\n\nup on top of one another, they never bothered about draining the trenches, so it is falling to our lot to put them in working order this morning I had 20 men from 4.30 till 11.30 taking up these duckboards & cleaning the muck out & then digging a small drain to carry the water underneath the boards, this makes a good job of it\n\nThe trenches are that close together that they sent a man back to the supports because he coughed to much & would give the position away he belongs to the \"Lewis gun.\n\nWe had a few \"Minnewerfers & \"pip-squeaks\" over this afternoon but they done no damage, though last night a pip-squeak wounded\n","6":" of our men they are harmless take them all round & unless they lob right in the trench you are right, but you have got to throw no chances away with the \"Minnewerfers for some of them weigh 240 lbs & are highly dangerous\n\nWhat do you think of this a couple of days ago a Belgian battery sent a big dud over & by some mischance it fell short, & our fellows out of curiosity they dug it up & opened it & to the surprise of all it contained not explosives as you would expect to find, but cleverly sketched plans of the positions of our guns & etc. it was reported at once & after a short examination shot the Major at the gun, lucky wasn’t it\n","7":" Last night we were that short of men that every available man including all N.C.O.’s were down on the \"ration fatigue\" that is as you might guess carrying the Coy’s. food from where the \"limbers\" dump it, & include’s water, & etc. There was also a welcome mail in last night.\n\nHad a few big bombs over last night & at \"stand to\" 5 oclock this morning, 3 of them lobbed quite close to my dugout & I have a pretty severe headache this morning from the concussion of the \"strafers\"\n\nI killed an enormous rat last night with a stone while waiting for the limbers the place fairly swarms with the pest.\n\nLast night we blew a German sap in & the concussion shook the whole joint like an earthquake the Huns evidently thought we were going to attack for they turned their batteries on to the sector where it exploded & started blazing away.\n","8":" On fatigue with a party of men last night from 8:30 till 5 oclock in the morning, we were deepening & sandbagging a trench running round an old mine crater, we were about 12 yards from the German trenches & had to keep fairly quiet or else we would have had a shower of bombs over, we did get pasted once during the night with grenades & pip squeaks but no one\n\nwas hurt, there was a dead man buried in one of these old saps, & I tried to dig him out with my gas helmet on but I could not finish him I did not like the idea of driving the pick through his body you could feel the point striking his bone’s so I chucked the job talk about stink \"Geewhizz\"\n\nDuring the night Capt. Price came round & he reckoned the work I was doing was excellent I ought to know a bit about trench building by this time for I have been long enough at it, & have had a pretty varied experience of the game.\n\nTucker is still pretty crook &\n\njust a bare existence, it takes a lot of hardships to kill a man since we have been in here we have not averaged 2 hours sleep per night & only 2 meals a day, & the men have worked fairly hard\n\nThis afternoon the whole Coy. is on fatigue cleaning out an old communication trench that the Canadians let got to ruin, we are doing it so as we can have a safe passage down to the dumps a 4th Bn. runner was shot dead yesterday & an Engineer wounded through not having this sap. \n\nOur Bombers killed 3 Germans last night they attempted a small raid on one of our Sections & fell in the muck.\n","9":" Went into the firing line last night & relieved D. Coy. things are very, very quiet about here so far, such a difference to the \"Somme\" the only thing we have to contend with seem to be bombs & a few shells & sniper’s.\n\nI have charge of a post named \"Tara’s Hall\" she is a bombing possy & one in the event of an attack I have orders to hold at all cost\n\nThe Germans are about 75 yards away & we can hear them working away of a night, driving stakes mixing mortar, & etc. we are on the defensive here for the present, so as to allow us to get on with our work & get things ship shape for the winter, & the Huns seem quite\n\nsatisfied to let things remain as they are, so it has developed into almost a neutral war; both sides saying the same, \"if you don’t shoot no more will I.\"\n\nOld Fritz has a couple of balloons up this morning if he is not careful he will lose them for our planes are pretty solid on them\n","10":" Yesterday evening old Fritz started to throw his Minnewerfers about looking for trouble he got 10 of our chaps during the day 1 killed & 9 wounded, he did not have long to wait for a reply to his bombs for our artillery which had been fairly quiet for the last 2 or 3 days opened out properly on him & shut him up in no time, they shelled his \n\nfront line in earnest & chopped great gaps in it here & there old Fritzie made a very feeble reply\n\nLast night I could hear the trains whistling quite plain, well into Belgium they would be the German supply trains for this front\n\nA very funny little incident occured last night quite close to my post, one of my sentries saw a man wandering about in \"No mans land\" & he immediately called me I spotted him at once & thought he was a German who had lost his way & in the peculiar light he looked quite close to us; for it had been raining heavily & by this time it had ceased but a low lying thick mist\n\n& clouds of vapour were moving about on the warm & wet soil, it was full moon but very cloudy so the light was very deceiving sometimes he appeared to be inside our barb wire & then outside, I gave the sentries instructions to cover him with their rifles, while I sneaked out with another chap to see if I could trap him, when we got outside we lost sight of him for a time, but we picked him up a few minutes later & I called on him to halt at the same time covering him with my rifle on going up to him I was surprised to find he was one of our Sergt. who had lost his way & was wandering about looking for \n\nour trenches little did he guess how close he was to being potted its a wonder we were not all shot for we were not more than 40 yards off the Germans so they must have been keeping a very poor look out.\n\nLas night was very miserable for it rained off & on most of the night & we had neither cover nor dugouts to take shelter in but had to stand out in the mud & slush all the time\n\nThis morning the 9th Batt. Colonel was found with ours having a look \nof\n over the trenches they are taking over from us\n\nOur artillery aided by some Belgian batteries have\n\nbeen pounding old Fritzie unmercifully nearly all day, there has been an almost constant stream of big shells howling & wailing overhead all bound for the same place, old Fritz’s lines, he made 2 attempts to retaliate but was forced to play second fiddle both times, as I sit here on the damp & muddy firing step I can plainly see one of our planes hanging well to the rear of the German lines observing all that is going on\n","11":" We were relieved last night by the 9th Batt. & moved off from the firing line about 12.30 had a long & tiresome walk of 4 miles or so to the railway we passed through Ypres again\n\n& one could not help noticing the swarms of rats that infest the ruined city, save for the echoing footsteps she is as silent as the grave & reminds one of a city that has been overun by a big fire, nearly all the buildings have the interior burnt completely out & only the walls are left standing & they all show great gaping holes where the shells have ploughed through, there are 4 buildings in there that one must notice, the first is the ruins of the lovely \"Cloth Hall\" the next the Catherdal which has only the front & walls left standing & they have got quite a startling lean on them\n\nthe 3rd is what is left of a beautiful theatre, & the last is the Assylum a little bit \nof\n out of the town this had once been a monster building with corridor’s a couple of hundred feet long, one wonders what became of the inmates when they started to shell the town I expect a few of them regained their sense’s of a sudden\n\nJust opposite this assylum our train was waiting for us & we were about done & our feet were as sore as could be for we had not had them boots off since going into supports & you might know that would not improve one’s feet any & this coupled with the loss of \n\nsleep & insufficent food made us feel anything but gay, however we were not long in reaching our jumping off place, & from here we had to walk another 2 miles to our present billets (\"Devonshire billets\") as soon as we reached them our cooks had a hot meal ready for us, fried bacon & tea, & I can tell you it went down well at 3:30 in the morning, after this we got our packs & blankets & soon were fast asleep we did not rise till 11’ oclock this morning.\n\nThe Coy has gone to Poperinge this afternoon to have a hot bath my feet were too sore to walk on so I stayed behind & here I am writing in the Y.M.C.A. which\n\nis quite close to our camp.\n\nI sent my pay book away this morning to England to have it audited so as I can see how I stand.\n\nI have just been thinking of the last artillery duel I saw & that was the other day, the Germans began it on a lovely morning & lobbed the first shells on to our trenches & did not stop till they had got rid of 4 or 5000, & I don’t suppose 1% of them done any damage to either life or limb, in spite of the skill of the German gunners & the accuracy of their guns, but the guns on both sides put you in mind of a choir, where one sings the other answer’s & away they go for all they are worth.\n\nthe whole force of the choir is used the trench mortars opened & then followed, basse’s, trebles, tenors, concluding with the high contralto note of \"Happy Jane\" the grandmother of the lot with her 15 in. throat t+his amazing concert lasted nearly 6 hours punctuated now and then by the screaming note of the enemies answering shell, they all have a cut mortars, field guns, 60 pounders 6 in 8 in 12 in & 15 inchess. I am not a musical expert but one don’t have to be, to be impressed with the rival singers.\n\nI have watched these duels from behind & close to the guns, the gunners stripped to the waist put me in mind of the old sea dogs\n\nas they swung shells or cleaned the guns, just behind & close to the guns an officer is standing & after every salvo he calls out the range & etc. after a particularly good salvo he sings out \"beautiful\" & we all have a picture of the \"Observation Officer\" up near the Huns trenches rubbing his hands & smiling & so the game proceed’s, old England is doing her bit now alright, we have our own particular way of carrying on & criticising everyone & own methods, & blunders such as we have made from time to time just imagine Germany allowing such a thing as Sir Ian Hamiltons despatch to be published like England did after the Gallopoli\n\nfailure & Evacuation of same. \n","12":" Mighty sharp & chilly this morning but good once you are on the move, we had physical jerks this morning, & after breakfast I had to take 20 men down to the Engineer dump 12 from No 9. Platoon & 8 from A Coy. with the usual military style they directed us wrongly & I had some difficulty in finding the right place however after a lot of enquiries I reached it at last, the yard is a big one & has sawmills & etc. going a lot of Belgians are employed in it, the party was split up into sections for the various jobs they were wanted for such as removing stakes, timber, unloading G.S. waggon\n\n& etc. I saw the officer in charge & he got the cooks to boil us a dixie of tea for dinner.\n","13":" It appears this job we are on lasts while the Brigade is in reserve & we have to sleep & tucker over here, we did not bring our blankets or packs with us so when the work was finished I asked the officer in charge for the loan of one of the motor lorries to run us round to our Camp to get our things so he lent us one & we slipped round had our tea got paid & packed up & back we come it was raining pretty heavily too but we were right for once & under cover, so we will be here for a day or two doing fatigues\n\nIt is good job for me for I do nothing only make arrangements for the mens food & etc. & detail the parties off as wanted.\n\nIt was freezing cold last night but this morning is a beauty nice & sunny.\n\nThrough some mistake of the Q.M. we were not taken on to-days rations strength & so that meant that we had no tucker to go on with but I done a bit of scouting & got bread, tea, sugar, salt, jam & a box of \"pork & beans & the cook bandicooted some potatoes from a neighbouring field so we did very well.\n\nLen came down with a guard this morning, he stops for 24 \n\nhours then another one takes his place. The huts we are sleeping in are all lit by electric light so we are quite toffy.\n\nThere is a rumour flying round tonight that this is the last mail we will be allowed to send away for 6 weeks so if that is true there must be something doing\n\nThere are some rather nice canteens round this part.\n\nYou can notice the effect of the cold winds on the trees quite plainly now, they are beginning to shed their leaves fast, now the cold weather is coming\n\nThere are a lot of new railways built round this part the English built them so as they\n\ncan feed the firing line quickest & rush troops wherever they may be wanted in a hurry\n\nI have seen quite a number of Belgian officers about this part & some of them look very smart in their brown coloured uniforms, the rank & files outfit is not unlike the New Zealander’s for it has red facings\n\nThis time last year we were on Lemnos Island having our spell after our hard times on the Penisular, & if I am not back in Australia by the time September comes round again I will eat my hat\n\nThere are a few aeroplane’s flying around here to day.\n\nThe 1st. Battalion were specially recommended in Army Order’s for the fine engineering work done by us in Ypres, I should think so for we worked day & night & we have some good men that know their work thoroughly\n","14":" Another nice morning & the sun shining brightly but not too much warmth in her, I took the men myself this morning to \"Quintons Siding\" & gave the other Lcpl a spell we have a convoy of 12 motors on this trip & they carry, timber, logs, patent roofings, sleepers, sheet iron, & etc. to the C.R.E. dump, here it is all sawn up into suitable sizes & distrubited amongst the \n\nvarious units, drawing from this depot.\n\nWhile waiting for the second trip I walked into Poperinge to see if I could get a paper, & who do you think I saw as I was coming back, you’ll never guess so I will have to tell you, why Bob Rex of Ticehurst, I would never have known him, he stopped me & asked me if I knew the way to the \"Divisional Baths\" & I told him, he then to my surprise asked me if I was not one of the Barwicks from Campania I was astonished, he then told me who he was, fancy meeting here in one of these little Belgian streets, he is in the Artillery\n\nAfter dinner I borrowed a bike from the Engineer’s & took a run up to the Battalion, for the mail was closing for Australia to day & the boys had a lot of letters to be censored so I collected them all took them up to their Coy.’s & collected what mail there was for them up there to bring back with me, while up there the Sergt Major said that I would be coming back most likely tomorrow to take charge of a Platoon so that would mean another rise for me, I am doing pretty well lately am I not; & Len I believe is getting his 2 stripes today he should have had them long ago by rights,\n\nOn my way back I came through Renmelhurst, this is a great military town for there are several Hqrs in her, including some Belgian\n\nI believe our aeroplane’s are reporting that the Germans are withdrawing all their big guns from the Ypres salient, & the night before last our guns waited on them & rocked it in hot & heavy where they knew they were, I hope they don’t evacuate their position before we get our mines off, when they do go up they will account for thousands of the squarehead’s.\n\nThey have got a very pretty little regulation in force now in the Batt it is this, whenever a man goes sick, & gets marked medicine\n\n& duty, he will have to do 1 hours extra drill per day, the object of it is of course to find the malingers out & give them something to talk about but I’ll bet they won’t go near the Dr. while this little regulation is in \nprogress\n force. I have been terribly lucky so far as regards sickness for I have reported sick twice only since I have been in the army once at Tel-el-Kebir & I was sent to Hospital, & again at \"Serapheum\" when I had those cracked lips & I was marked \"exempt\" that’s not a bad record is it.\n\nTwo Taubeswere bagged round here today, they have only to show their nose & down they come our machines are superior\n\nto theirs by far in every respect\n","15":" This morning a new lot of men were sent down from the Battalion to relieve the men who came down with me but the Engineers refused to let them go, so I took them back with me, for I had to go back to the Battalion & take charge of a Platoon so I am gradually getting on.\n\nThere is a \"General Order\" out this morning calling for applications to join the Flying Corp only N.C.O.s are allowed enter I believe, I don’t think I will apply for entry though nearly all the rest of the boys are doing so.\n\nWe have football & cricket going again, you can’t beat a bit of sport to liven things up a bit\n\nLen & a few more of the boys have gone into Poperinge today\n\nI heard this evening that the 3rd Division had been sighted at last & were about Hazebrouck its time they done something for they have not struck a blow as yet, they have had a good time in England.\n\nLeave for England started again the other day its about time I should think.\n\nReceived a big parcel of sweets from home today they were in splendid condition & had kept well.\n","16":" Last night I was down at the Y.M.C.A. where old Mac was holding a short service & sing song the Hall was crowded what a fine fellow he is, the first time we were in Pozeries they had to send him back several times from the front line he almost insisted on stopping there with the boys, but they persuaded him to remain behind & then he used to run all sorts of risks getting wounded men in, & burying the poor chaps who had been killed, nothing is a trouble to Mac & he will share his last penny with you, one of the finest men in the whole of the Australian Forces\"\n\n& he has a powerful influence over the boys.\n\nStarted to rain last night & this morning it is raining heavily & looks rotten outside.\n\nWe were issued with new box respirators this morning & every one had to go through the gas test again, but there were very few defective helmets among them & now we have to hand all our P.H.G. helmets in\n\n19th. Yesterday evening all the N.C.O’s of the Brigade had to meet over at the 3rd Battalion for a lecture on gas & the new helmets after waiting for nearly an hour in the mud, we had to go home for the lecturer never turned up\n\nThis morning our Coy on parade numbered no less than 3 men & 3 N.C.O’s. Some Coy. wasn’t it the reason of it is that all our men are either doing fatigues or guards.\n\nEntries were sent in today from the different Coy’s for the spats which are coming off shortly. \n\nThere was a bit of a disturbance today in the cookhouse some of the boy’s were \"showing\" & a few blows were struck but no damage was done.\n\nLast night I was down at the Y.M.C.A. at a concert it was the funniest turn out as ever I was at, the singers with one or two exceptions were rotten\n\n& it seemed to me that each performer was trying to make a worse show than the preceding one, at any rate they caused a lot of fun.\n\nWe had a lecture this morning from a gas expert. All the Batt N.C.O’s had to attend with their helmets & had to do all sorts of drill & work in them didn’t it make us swear all in our own time too.\n\nHad a fatigue party this afternoon they were working for the Pioneers \n\nThis evening I went to the \"pictures\" & after that I attended a lecture given by Capt McNicholl on his recollections of the S. African War, it was very good & the Y.M.C.A. was crowded, we have 2 \"picture\" shows each night in the same hut\n\nThe big armoured cars, or tanks as we know them by are all the talk at the present time, I believe they are fearful & wonderful things & are going to play an important part in this present war.\n","17":" Another miserable rainy morning & the ground around is swimming with water & is that slippery that you hardly dare trust yourself on it, you have no idea what it is like.\n\nThis morning 1 N.C.O was detailed from each Coy. to go to the trenches, & have a look round I was sent from our Coy. & a nice job it was for it was raining heavily & the ground was swimming in water we had\n\nto ride bicycles as far as Lille Gate which is at the other end of Ypres right on the edge of the moat, the party all told consisted of 4 bicyclists & 4 horsemen for the officers rode their horse’s it was a very trying ride for the roads were very heavy & in some places muddy, we had to take our dinner with us mine consisted of a piece of dry bread & cheese, the horse’s started off in front of us but we caught them just as we reached the \"Cloth Hall\" in Ypres & both pulled up at \"Lille Gate after putting our horses & bicycles in a safe position for the Germans still shell all round\n\nthe joint, we went over to a little coffe stall which the Australian Comfort Fund has established at Lille Gate\". this is one of the finest pieces of work I know of, & many & many a man has had reason to bless this same little coffee stall for every one who passes through \"Lille Gate can have a drink of hot coffee or cocoa at any time of day or night for it is kept going all the while & I can tell you there are some dead beat men call there at times, on their way to & from the trenches, cold, wet & hungry & hardly able to stand they are so tired, & a cup of hot coffee & a few biscuits\n\nworks wonders in a man as I myself can testify, a Major Dexter started it & kept it going at this own expense till the A.C.F. took it over from him one of the finest pieces of work they have done\n\nJust here on the edge of the moat theres lies an enomorous bell taken by the Belgians from the Catherdal & placed here for some reason or other, the bell is engraved all over & looks fine\n\nAfter a while we left & struck out for Woodcote House here we picked up our guides & they led us to the 6th Batt Hqrs, we had to wade through slush & mud almost to one’s knees & the duckboard’s having no netting\n\non them were as slippery as could be, & it was with difficulty that we kept our feet.\n\nThe Hqrs are in a big tunnel & here we got some \"runners\" & they took us to the respective portions of trenches which each Coy. N.C.O. had to look over & a nice state they are in without a word of a lie you have got to plough through sticky clay a foot deep & in lots of places the duckboards are floating on top & when you tread on them down you go talk about a time, when we finished inspecting, we were wet to the skin & quite satisfied to make back to our bikes &\n\nhorses, & here we had some more coffee & biscuits & after a short spell we set off for Camp which we reached tired out & done about 4 o’clock, as soon as possible I changed into dry clothes, & so would not suffer from the soaking\n\nLen was sent to a Gas School today.\n\n21st. This morning we had a Battalion parade & for the first time in my life had charge of a Platoon on such, after this was over we had the usual drill & a rifle team was picked out for the competition\", they wanted me to take charge of it but I did not want the job so another Corporal took it on\n\nThis afternoon we had an inspection from General Plumer the whole Bde. turned out, & I had charge of the Platoon again\n\nLast night the German’s raided the","18":" Bn. but what a shock they got for never a one of them got back alive, the 20th had an old score to settle with the Hun’s for they made a successful raid on them while they were round Armentieres but this time the tables were turned with a vengeance\n\nThere is to be a big turn out to night for the Serg.’s are going to have a big spread & a drunk I could go if I liked but there will be too much grog there for \n\nmy liking.\n\nThey are now issuing daily rum to the troops & how the boys like it. \n\nI saw to-day in a French paper that when we took Pozeries the French cheered along the whole of their lines from one end to the other thats something for Australia.\n\n22nd. We are holding our Sports this afternoon, & for a wonder the sun is shining brightly & things are drying fast, all those with the exception of the rifle teams marched down with their belts on\n\nI am now penning this laying on the green grass, & at the present time I am watching the rifle squads in the competition drill A. & B. Coy have just gone off\n\n& C. Coy are now on.\n\nD. Coy won the competition & C. was 2nd scores, 89, 87\n\nBottomley won the High jump & Long jump in the latter he cleared 17 ft 4 in. not bad you know considering all things.\n\nThere was a free issue of beer down there today, you should have seen the rush when the beer was ready, some of them must have been nearly killed in the crush.\n\nJack Price & I went to the picture Show, but something went wrong with the engine, so they held an impromptu concert instead that finished up the day & so ended the Battalion Sports.\n\n23rd. A Taube was up bright & early this morning & our gunners were getting good practice at her they are such rarities nowadays that when one is spotted they are an object of interest, I don’t know what became of her.\n\nCapt. McKenzie came back last night & is going to take over C. Coy in the morning I think the boys will be rather pleased at this for Mac. is a sport.\n\nAfter parade this morning they had a couple of ties \"pulled\" in the tug of war C. Coy defeated D. & the Transport & now have to pull A. to win.\n\nHad a roast for dinner today the first one for a long time.\n\nThere is another free issue of beer this afternoon, I don’t know who is shouting for it\n\nWent over with a lot more today to get the idea of sending & taking signals from the aeroplanes, we had smoke bombs to show them our position & flappers, white on one side & dark on the other to signal with in dull weather & a big piece of tin, black on side & shiny on the other for sunny weather, the aeroplane’s picked us up alright, they signal to us with a sort of glorified horn, & when they want to know where we are they drop colored lights, when we see these lights\n\nwe light our bombs or flares & show them our position everything worked easily & smoothly, just lately we have invented & perfected a new style of telephone which is far superior to the German’s all our Sig’s. now carry bombs & revolver’s where they are in the trenches with these new instruments & if they are in any danger of being captured they have orders to destroy them at all costs rather than let the Germans get them, with the old style the Germans used to place enormous & very sensitive horns outside their trenches & these used to catch our messages for they would collect somehow from the ground, that is why \n\nat one time they knew our every movement but we have them now. \n\nThis evening I went over to the picture show & saw the pictures after this followed a concert by the 2nd Battalion, it was a pretty poor affair & just before the \"interval\" they brought a Tommy on & the first song he gave was alright he then followed this with a pretty smutty one, this was alright, but he followed with a dirty rotten thing but he never got far for the boys howled him down & counted him out no one like the idea of treating a Tommy like this but it was absolutely necessary, for a Y.M.C.A. is no place for this class of singing, a pub might be right enough.\n\nthis sort of thing nearly spoiled the concert for the time so they put Charlie \n\nChaplin on the screen to make us laugh & forget it, & after this was over an English officer came forward & volunteered to give an item or two along with a couple of men from the \"Somerset\" regiment, & by Jove they were fine & brought the house down the boys gave them a great reception & they had to give song after song they were really good, & took away the bad impression their countrymen had made that evening I fancy they went on to the stage for that intention & they were out to wash it out. for with all their funny ways & etc, the average Englishman\n\nis a gentleman & we get on well with them, now they are getting more used to the Australians free & easy ways.\n\n24th. Sunday today & we held a Brigade Church parade, we had to march about a mile along a very pretty little road, lined on either side by green hop-fields & young growing crops, we formed up in a square in a nice little grass paddock where we held our sports the other day, the 3rd Bn. band was there & played for the service which was conducted by old Mac, we had quite an important morning, for General Birdwood & Walker were there & also Andy Fisher & someone else in civies\n\nAfter the service was over General Birdwood presented some medals to those who had been fortunate to win them most of them were M.M.’s. After he had finished he as per usual gave us a short talk on the war situation, to-day he told us of a great victory that had just been won by the Roumanians & Russians & he also said that he hoped the next time we went over the parapet we would be accompanied by some of these wonderful \"tanks what a sensation they have caused they must be a marvellous invention\n\nYou should have seen the swag of papers I received today 48 \ndiffere\n papers in all & from such places as Tasmania, Walcha, Armidale\n\nTamworth, & England.\n\nAfter we marched home from the service the great event of the day came off & that was the final of the tug of war between C. & A Coy. great was the excitement as the two teams took the strain the first pull was a fair one & was won by C. Coy amid great cheering they then reversed end’s for the 2nd pull but it was a short one for C. Coy again kept up its reputation & pulled A. head over heels amid a scene of great excitement, all the officers were out as usual barracking for their side, Len was one of our team of 8 the win was worth a hundred franc’s but that is \n\nnothing to win is the main thing for there is great rivalry between the Coy’s.\n\nI sent away & registered today a parcel of curio’s which I collected round \"Pozerie’s\" the time of our terrific charge for it.\n\nSome of our Machine gunner’s are leaving for the trenches tonight\n\nFrom where I am writing this I can see one of our aeroplanes thousands of feet high & now & again she presents a beautiful sight for she strikes the rays of the setting sun & shines & dazzles like a piece of mirror away up in the clouds, & how gracefully she flits about, with a soft droning sound from her throttled\n\ndown engines.\n\nThere was a big issue of clothing this afternoon underpants, shirts, socks & cardigans, all woollen.\n","19":" Last night I was at an \"evening service\" in the Y.M.C.A. it was the farewell of Capt. Donald McNicholl a fine Scotchman in every sense of the word he is leaving for Australia today, (I wish I had his complaint) the Hall as usual was packed & he made a great impression on his audience, we have these little singsongs pretty often & they are always crowded we had a Band present which played for the singing\n\nThere is no one outside the soldier’s who can have the faintest idea of the fine work done by the \n\nY.M.C.A. it is about the only institution that gets right down to those who need it, where are all these Bible punching Societies now, why I have never seen one of them as yet but the Y.M.C.A. is always at hand & it knows no sect or creed for it bars no one & all are welcome so long as you abide by the decent thing I’ll bet it will have a few more \"members\" after the war, for we have all recognized what a splendid thing it is & it will have no firmer supporters than the men whom it is now following & looking after in every way possible I can’t imagine what it would be like without them for they provide canteens where you can buy almost anything within reason & at a \n\nreasonable price, their huts provide us with music, ink, stationery, free library’s & etc. & they are always arranging lectures & amusements. \n\nHad to make out my first \"Parade State\" this morning.\n\nJack Price, Digby & Kendrick left for the trenches at midnight last night. \n\nThis morning we went for a bath it is a fair step to the joint but well worth the walk, they have a pretty good system of dealing with the men, this is how they do it\n\nThe men dirty & verminous from the trenches arriving at the baths take off their tunics & breeches which they turn inside out & tie up with braces & identification discs, they then remove their shirts\n\nsinglets underpants & socks & hand them in at a window with their towels receiving a ticket for each article, at another window these tickets are exchanged for clean things which they place on a form ready, & then have a good hot bath & put on the fresh underclothes, by this time their tunics & breeches which have been dusted with Oxford powder & ironed, a process which the occupants of the seams are said not to appreciate. The soiled underclothes & towels which they have handed in, are soaked for 24 hours in large vats of cresol solution, & then washed & boiled. The socks are darned the singlets & etc. mended & buttons sewn on\n\nthe clothes are then ready to be reissued to the next lot of bathers In this way they put through from 15 to 1700 daily, (this blot has just been caused by the concussion from a Minnewerfer for I am writing this in the trenches & there is Hell to play\").\n\nThey employ a fair number of women in these places they look after the dirty clothes & if any shells fall near the joint the women clear out but that very seldom happens.\n\nArrived back from the baths about 1 oclock & had dinner, after this the Platoon commander’s had to get a hustle on & see that all their men were properly equipped, draw rations, ammunition, clothing & etc. for no matter how often you take shortages\n\nyou will always find some of them at the last moment short of something or other it beats the world:\n\nAt 5 o’clock all the men were \"fallen in\" \"roll called\" & huts all left clean & tidy for the next lot coming in, after the inspection was over, we marched off to Poperinge Siding, where we entrained, the boys were all as merry as could be & the night was nice & fine, just after we reached the Siding\", the","20":" Bn. came along & its band played them to the train After about an hours delay our train an armoured one came in & we got on her, & as we were pulling out the band played \"Auld Lang Syne\" & very nice it sounded in the warm twilight.\n\nIf anyone is looking for an eye opener, they only want to take a trip from Poperinge to Ypres by train, but to civilians this of course is denied, & I’ll warrant they will be astounded at the line of transports going along the road; why there are miles & miles of them they never seem to end, they are conveying all the tucker timber, bags ammunition & etc. needed by the firing line for miles around.\n","21":" After getting off the train at Ypres the different parties were sorted out, & off we went, my party was bound for the firing line, & of all the stiff & trying marches as ever I have taken part in well this was the fiercest we had\n\neverything we possessed including blankets waterproof plenty of clothing, food, & a 100 rounds of extra ammunition, I reckon the weight of everything to be nearly 80 lbs & we had to hump this load over all sorts of roads, bogs, creeks, muck & everything imaginable for about 8 miles & during the march we halted only twice & they were very short, oh we had a fine time & you could have washed yourself in each mans sweat our clothes were absolutely soaked through with our sweat, this made us easily 16 miles for the day so you may guess how we felt I did not care myself if a shell came & knocked me out I was that \n\nnear done & there were scores more the same way, but the worst part was yet to come, & that was when we were going up the \"communication trench\" to the firing line, for the trench was that narrow & at intervals of a yard there were wooden uprights to hold the sides in place & on these uprights our packs used to catch, talk about pull, struggle, & swear well you should have heard us I think this sort of thing is about the most aggravating thing we have to put up with & no one likes the idea of shifting about with packs up in the trenches, well at last we arrived at our posts, & proceeded to take over from the","22":"\n\nwe struck one snappy & knowall Sergt. but I promptly shut him up & in front of his officer too\n\nAs soon as we got our \"posts\" told off the men got their packs off, & what a relief it was for the straps had cut into our shoulders & stopped the circulation of the blood, & they were quite numbed & had no feeling in them however it soon came back, but it left our shoulders very sore, we took 4 posts over of 6 men & an N.C.O. to each.\n\nBright & early this morning our aeroplanes were up & over old Fritz’s lines, you could not see them for quite a long time for it was almost dark so they were losing no time.\n\nThings were fairly quiet till near 2 oclock then old Fritzie took it into his head to send some of his pet bombs over the Minnewerfers & soon got busy but although they have a very bad name I would for rather have them than shells for you can dodge the Minnies you can see them as plain as day for that are just like one of those great big oil drums that you will see anywhere, & you can both hear the report when they are discharged & see them coming over they turn over & over in the air & go up hundreds of feet high & then fall anywhere for happily they can’t range them too accurately, I think they are more for moral effect\n\nthan anything else for they go off with an ear splitting crash which makes the earth tremble for a long way round & will put the fear of God in a nervous man, they are just an iron case & the end which the detonator fits in is made of wood, they are very roughly made but of course, they are good enough for their work. \n\nWhile they pasted us with their \"oil drums our Stokes\" were very busy & shot bombs like lightning into them, they are far smaller than Fritz’s oil drums but far superior, they are about the finest bomb going & when once they get the range are very deadly.\n\nThe","23":" Bde seem to have done a lot of work in these trenches, & they wanted it badly too.\n","24":" Dave Mason took a small patrol out last night but never saw any of the Hun’s.\n\nThis morning I took an inventory of all our Posts & bombs & 303 ammunition. Our mortar battery landed 2 bombs almost in our trench this morning. I reported the matter to the Capt.\n\nFrom where I am writing this I can see \"Messines\" hill quite plain it is a fine position for it overlooks the country for miles around. I think the \"London Scottish\" took it last year, & about 200 yards behind me is the famous International trench so called on account of its being taken & lost so many times by the British\n\n& Germans, each side has taken it 7 times, but we hold it for good now I think, it fairly stinks with dead men you can’t dig any where with out digging them up, & the ground once disturbed stinks like anything for it is rotten, a regular graveyard & you can see feet sticking out almost any where, & of a hot day you have to hurry round the worst parts of it, there are a few thousand buried about here I’ll bet. the ground is like as if some one had dug it up about 6 ft deep & kept it stirred you can’t dig a solid trench in it you have to use sand bags for the lot, & it is nothing but a mass of shell holes & craters but not as bad as the \"Somme\"\n\nAnother heavy mortar duel has just finished I don’t know what the casualities are as yet but I know of a couple we have had killed, we used principally \"plum pudding\" 60 bb. & Stokes 14 lb bombs & for every bomb they put over they got easily 2 in return for it, old Fritz used nearly every kind of bomb he has & I can tell you we have sore necks through watching for them, bombs especially big ones are fairly easy to dodge while our bombs were going over every now & again our artillery would give them a sudden burst of shelling perhaps 100 shells in 2 minutes & though the trenches are only 60 yards apart our \n\nshooting was so accurate that they pounded them nearly the whole time & not a shell struck our’s they seemed that low as they whizzed past that you could put your hand up & catch them, contrary to us Fritz never attempted to shell our front line, it requires expert gunners to do that when the trenches are so close.\n\nI saw another German balloon come down in flames tonight it looked very pretty against the clouds it was it was all burnt up before it hit the ground & nothing but a cloud of smoke remained 3 min’s after it was fired an enemy aeroplane was also brought down at the same time, we have had quite a number of planes up today some very low\n\nI can hear the heavy firing quite distinctly down on the \"Somme\" & the vibration in the air is easily felt everything seems quivering\n\nHave had quite a busy day what with booking & inspecting all the firing bays & arranging for the supply of bombs & etc. getting the fatigue partes together, making a dump for the \"crater snatching\" partys tools & cutting the barb wire into proper lengths for tonights wiring party & over seering a lot of the little jobs & inspecting all gas helmets I have had scarce a minute for myself.\n","25":" D Coy had 1 man killed & 2 wounded last night on their wiring party, Dave Mason & I put ours out, & got in safely.\n\nthese wiring parties look alright on paper but they are in reality dangerous jobs for you are well out in \"No Mans Land\" & the trenches just here are very close where Dave & I were working they are only 25 yards distant, so you have to work silently & quickly, that of course comes natural to a man after he has had a bit of experience at the game but I need scarcely add that you breathe far more easily when you are in again & the work finished Cook came back from England this morning, reckons the Australian & N.Z. are more popular than ever Freddie Turner our C.S.M. got hit yesterday, not very serious I am pleased to say, how we will \n\nmiss him for he was a splendid fellow & talk about popular, well to know Freddie was to like him you couldn’t help it, all I hope is that he soon comes back, he was hit with a piece of the real \"Minnewerfer\" in the backside a rather awkward place to get it\n\nThere was a fair bit of sniping going on all last night from both sides put me in mind of Gallopoli for rifle fire is a rarity here compared to there\n\nThe portion of trench we are holding is mined the Germans have one under her ready to go off they reckon so we have only a few scattered posts along it hope it don’t go up while we are in here, good bye if it does.\n\nThere is a fairly heavy bombardment raging on our left this morning & our aeroplanes are directing the batteries\n\nThis morning Capt. McKenzie called me down to his dugout as he wanted to see me, so down I went, he asked me about my commission, I told him what happened, he said it would be alright, it would come later on he would see to that, & he also said he would do his best for Len what do you think of that he’s some Capt. isn’t he;\n\nJust at present Len & I are in the boom I am in charge of N.C.O.s & men in the front line 37 altogether & Len has the","26":" line\n\nWhile I was down I also had the system of working the men altered\n\nso we will now work systematically & not anyhow like it has been\n\nReceived our first instalment of dry socks this morning from now on while the Batt. is in the firing line every man is to have a clean & dry pair of socks issued to him each day, at the same time 1 pair will be collected from him each morning we are supposed to have 1 dry pair on 1 pair in our pack & another pair getting washed & dryed, this will enable us to always have dry socks, & we also have an issue of whale oil the feet are supposed to be smeared over with this for it prevents frost bite to a large extent & anything that will do that is well worth using.\n\n \n\nAs usual there are plenty of our planes hanging about.\n\nThings have been fast & furious this afternoon talk about mortar bombardments well we have had them this afternoon but for every bomb & shell the Germans shot over they got 6 in return quite easily, we blew their barb-wire to pieces & levelled their parapets in places but the greater part of the bombardment fell on the","27":" and 3rd lines it must have been a perefect Hell there, large pieces of timber & etc were flying back all the while from Fritzs trenches, our bombardment stopped as suddenly as it started & then old Fritz lets fly but every time he shot one of his big Minnewerfers over our boys\n\nwould send him 2 60 pounders & 2 stokes it was funny the instant the report of the big fellow was heard our chaps would let fly & the big bombs would cross in the air & in some cases they burst together however this sort of thing soon quietened him, as for artillery he has not been in the hunt for some time our guns fire in bursts of rapid fire which generally last about 3 minutes but they get rid of some shells in that time & you cannot see anything for smoke & dust, we had a couple of big bombs drop very short today one lot of chaps including Jock Mackie Snowy Hill & Cooke were extraordinary lucky for one of our 60 pounders nearly buried them & never a one of them got \n\nhurt talk about luck.\n\nThe reason for all this activity is pretty plain, there is going to be a raid by the 7th Batt. tomorrow night things are promising for a lively night.\n\nJust at tea time the Captain came rushing in & ordered us all to get out of the line as soon as possible for there was going to be a very heavy bombardment at 5’oclock, so out we all trooped to the 2nd line & waited for it, she came alright & our guns & mortars crashed & roared & raged for full 30 minutes but the enemy contrary to expectations never replied so after the storm was past back we went. \n\nThe weather is holding fine & the days are quite nice, I can hear the guns on the Somme real plain to-day\n\nI have seen one solitary Taube today & he was mighty soon chased back\n\n29th. Nothing much doing last night except now & again our artillery would cut loose & give old Fritz a couple of bad minutes, the shells would come like a thunderclap, one minute everything would be nice & quiet the next nothing but a roaring crashing sound of bursting shells, this sort of thing naturally keeps old Fritz on the jump & gives him what is known among us as nerves for he never knows when it is coming or where it will fall.\n\nJust after \"stand down\" this morning I was on my way down to the International trench on the look out for some dug out’s for my\n\nmen, when I met Len on his way up to see me, Capt McKenzie had just told him that he & I had to report at Batt. Hqrs at 8.30. \n\nSo after breakfast we went down & after a little delay were interviewed by the Colonel there where 2 from A Coy. & 2 from C. it was about the commissions & Capt McKenzie had recommended both of us for one, I previously had been interviewed by the Colonel & besides he knows me fairly well for he generally pulls up & has a bit of a yarn when he runs across me in the trench, so my interview was soon over he asked me practically the same questions as before after we had been interviewed we\n\nwere told to go back to our respective Coy’s on the way back I had to pass the Capt dugout & he called me in & asked me how things were going I told him, & he said he was going down to Bn. Hqrs shortly & he would have a word with the Colonel, what kind of a man do you think he is, & at one time he & Len & I were bitter ememies but what a change, now he is taking a great interest in us. What a fine thing it would be if both of us could get our commission I dont care so much for myself but I know how all at home would like it to come about wouldn’t they feel proud & it would be a very good record\n\nhowever I am not banking on it as yet after my last experience of going away to a School of Instruction\n\nTo-day Len has been gazetted full Corporal & he should have had it long ago but for pure accident\n\nI have withdrawn my Platoon from the firing line & am now in \"supports We are still dropping bombs & shells on old Fritz & rolling his barb wire up lovely, they are making a good job of it.\n\nI done a bit of firing last night with a Lewis gun they are little bonzer’s & very light & deadly.\n\nGot a quantity of stuff up from the Bde canteen this morning for we run one almost in the firing line & it is a great success\n\nAs I sit here writing in my dugout our fellows have started a very heavy bombardment & things are very lively the old dugout is rocking & swaying like a ship in a storm while our shells are sizzling past over my head & pretty low like lightning all our men have been withdrawn from the firing line in case a shell or bomb might drop short for they are cutting things very fine & just skimming our parapets, the Germans are pretty busy with\n\ntheir Minnewerfer’s but the majority of them are going over our heads \"thank Goodness\" they are powerful brutes alright & make enomorous craters & fling earth & timber hundreds of feet high they are also sending a few \"aerial\n\ntorpedoes & dozens of smaller bombs\n\n30th. Had my platoon out digging & repairing trenches which had been damaged by the bombardment of yesterday, we were supposed to work from 8 to 11. but about 10.30 we ran out of sand bags & so had to chuck it so we had a fair nights sleep for once in a while.\n\n5 more details came in last night with Len when he brought his ration fatigue back to the trenches\n\nAfter breakfast this morning I took my men up to the firing line to work on a job of trench building & I’ll bet we done more work in this one morning than has been done on this same job for the last 3 days the Capt reckoned\n\nwe had done splendidly, when we are filling the bags we often get the bones & clothes of men that have been buried about here, & the earth positively stinks.\n\nLast night one of our patrols was out & spotted a German patrol the instant the Fritz’s saw our boys they bolted for their trench & never offered to put up a scrap\n\nLen & I received parcels of socks from home this morning, & strange to say Len’s parcel was wrapped in the same paper that I had sent a parcel from London, home, & the address was still on it, so it has travelled right round the world you might say & finished up in Belguim.\n\nWe have given them 2 more solid hammerings this afternoon & old Fritz hardly replied, the raid is coming off tonight so I expect we will have some fun.\n\n6 of our aeroplanes have just flown as cooly as you like straigh over old Fritzies lines, they are on another bombing expedition I suppose\n","28":" Received another parcel from Mrs Mitchell so now I have plenty of sox & etc.\n\nWell last night the raid came off but an hour or so before they went over, we opened a heavy shell fire on the trenches to our left, it was very pretty to watch the flash of the bursting shells as they landed in \n\nthe enemie’s trenches, some dull red, yellow, dark green & different sorts of colour as they flashed for an instant against the dark sky. there must have been a demonstration for heavy rifle & machine gun fire broke out & continued for best part of an hour & then gradually died down.\n\nAbout half past nine they sent down for me & I had to bring 4 men with me for \"prisoners guard\" so up I went & they gave me some more from D. Coy. the raiding party looked very funny they all had their faces blackened, & no hats on, nearly all wore steel waistcoats strong enough to stop a bayonet & they carried short \"waddies\" to break their heads in with, they are a nasty looking thing, there is a handle \n\nabout 18 in. long & on the end of the \"nulla\" they have a steel head shaped liked a cog-wheel something, one crack from that will settle any man, exactly to the second on 10 oclock our guns opened & the raiders crawled out to the German wire & laid there & waited for the fire to lift, but so anxious were they that they were in the trenches while our guns were pounding them, we all waited anxiously to hear how they were getting on, at last came a wounded man, & shortly after the whole lot came in as cool as you like, they raided the trenches for a distance of a couple of hundred yards long, killed about 20 men, they bayonetted 7 of them, & got one prisoner that was all they wanted\n\nthey were bringing 2 back but one of them was so terrified, that when they got him on the parapet he refused to budge so they shot him for they could not afford to waste time over him They reckoned the German trenches are a mass of craters inside the result of our bonzer 60 lb bombs.\n\nThe raiders had one man killed a piece of our shell hit him & 2 wounded so they got off light enough, there were about 40 all told, the 8th Bn raided another section of trenches a little lower down at the same time they also had a successful night, I have not heard the full strength of it as yet.\n\nThe most remarkable thing about the whole concern was the way\n\nold Fritz took it lying down we all expected to get the tripe knocked out of us but to the surprise of all he only fired a few feeble old whizz bangs over & a dozen or so \"pip squeaks\" its very puzzling to all of us how quiet he is keeping & all sorts of opinions are hazarded regarding him & movements, but my opinion is that he has had such a towelling up lately that he is satisfied to remain quiet rather than run the risk of an artillery duel with us. \n\nThis morning I witnessed a very pretty piece of work by one of our airmen, there were 3 of Fritz’s balloons up & we were commenting on how plucky he was getting when we saw one of our planes\n\nmaking over old Fritzs trenches instantly every one was on the look out & the Germans started to blaze away like made at the charging plane, he was making straight for the balloon & we could see there was trouble ahead for the man in the \"sausage\" with a lovely sweeping dive he planed straight at her & just as we thought he was going to collide with the balloon he dropped his bomb & shot straight upwards like a hawk that has made his dive & missed his prey, in a few sec.s. we saw a thin coloumn of white smoke issuing from the white cover of the balloon & about 5 sec. later she burst into one flaming\n\n \n\nmass & down she come she was burnt to pieces before she hit the ground, what became of the observers I don’t know he may have parachuted down if he was lucky.\n\nNot satisfied with this display he made a bee line for the next one, running the gauntlet of shells & machine gun fire which chattered & barked the whole time at him, the second balloon shared the same fate as the first one, & by this time we were all beginning to get excited, for an air fight or anything like this is a most exciting thing to watch, the plane made straight for the 3rd & last balloon, & old Fritz started to pull it down as fast as ever he could but he was not quick enough for with a magnificent\n\n& thrilling dive during which we all held our breaths with supressed excitement & wondered whether he would be in time, down, down he came like an eagle until he looked to be right on top of the balloon, then he let his bomb go, but he miscalculated his distance & the bomb missed but he was determined not to lose him & with a steeply banked turn he brought his machine round & described the figure of 8, now the excitement grew higher than ever for the balloon was fairly low & both sides had ceased firing & were watching the daring manouveres of the airman, for a second he seemed to poise, like a hawk over his prey then down he shot like a streak\n\nof lightning, we saw the flash of his bomb as it broke into pieces, & we watched him come up under the balloon, but he made no mistake this time for we all saw the tell tale white smoke rising from the gas bags envelope & the next instant she was all aflame & fell in one huge ball of fire leaving only a mass of dark smoke behind her, which remained in the sky for hours after, the gallant airman now his work was done had a perilous passage back for he was in close range of Fritzs antiaircraft & machine guns & they tried their damndest to smash him up battery after battery was turned on him but in spite of it all he managed by skilful manouvering to get away from them\n\n& I’ll bet he was no more pleased than we were, it was just another case of illustrating how secure we hold the mastery of the air.\n\nThis bomb of ours is a beauty, when they drop it, it bursts into 4 pieces & a little lower down these 4 pieces burst into 8 & lower down still they become sixteen & any one of these portions is sufficient to bring any balloon down, they are what they call incendinary bombs & are used sometimes to destroy ripening crops. \n\nToday all our watches & clocks go back an hour & many were the jokes caused by it.\n\nTo-day is Sunday & this morning I heard the church bells ringing away beyond the German lines in some\n\nlittle Belgian town waiting for deliverance from the German yoke\n\n2nd. 8 hour day in Australia & I can picture the crowds going to the races & etc in our \"Sunny land of the South while here we are cooped up in our muddy & cold trenches & rain is falling falling as if it means to flood us out, but never mind its not going to last for ever & theres a \"silver lining to every cloud\"\n\nWe got 32 reinforcements for the Coy. last night, & 3 of them were hit on the way to the trenches, for they were unlucky for a machine gun fight was in progress as they were coming up its a wonder more of them were not killed for they rake the tracks they have to come up\n\npretty dangerously & you are shot at from all sides for we are in a big salient & of a night time flares appear to be going up all around you, & you would think you were surrounded.\n\nI have had a party of men building a big dugout all the morning & we have made a good job of it.\n\n3rd. Big top boots are all the rage to-day for the trenches are swimning in water & there is a foot of sloppy mud everywhere especially in our \"communication trench\" & \"Hedgerow\" it has been drizzling all the morning & things as you may guess are in an awful state, but the big rubber boots which reach to our thighs are waterproof so we can paddle away to our hearts\n\ncontent to tell the truth I rather enjoy wading through the water it puts me in mind of when we were kids & used to splash & play about in the water & thoroughly enjoy ourselves, but it is only Autumn as yet & the weather with the exception of the nights now & again is fairly warm & mild\n\nI have been on the go all day long & tonight I am fairly tired for walking about makes one leg weary, for today I have been doing practically the Sergt Majors work & my own besides & I have not had a minute scarcely to myself except at tea time tonight 16 hours solid going, but tonight I am stopping in.\n\nYou should have seen our tea tonight, there were 4 of us at it. Jack Price (our present Sergt Major) Dave Murray (Company Clerk) & a very nice & decent fellow Len & myself, this is what we had, tinned rabbit, I suppose you will laugh when you read of us eating rabbit but I can tell you it is fine & very popular among the boy’s a large tin costs 2 ½ franc’s, tinned butter, strawberry jam, cheese, tomato sauce, about 4 lb of good cake & as much bread as we needed, this is one of the great differences between here & Gallopoli, for here we can get anything within reason at a reasonable price, at Gallopoli\n\nyou could get scarcely anything & if you were one of the lucky ones to snap anything you had to pay outrageous prices for them.\n\nI forgot to mention we also had canned peaches & as much tea as we liked, so you can see we are not living too bad & we very often have the same amount everyone lives fairly well over here for unlike the poor \"Tommies\" we are paid pretty well & most of the money goes into food.\n\nWe had 2 men killed & 4 wounded last night, 2 of them were wounded by the premature explosion of one of our own \"rifle grenades\" which burst just as it was leaving the riffle\n\nI cut my finger (little one) pretty severely today on a piece of tin & tonight it is very painful & hot hope it dont get bad on me, I also have a heavy cold in the head but Thank Goodness it has not settled on my chest\n\nYou wouldn’t believe what a difficulty we have in keeping any thing here for the rats, the place simply swarms with them, & they are so bold that they will scarcely get out of your way, they tear great holes in your blankets & eat your clothes & equipment, even while you are lying down in them of a night, & when you are sleeping they simply run all over you\n\nThe other night the Capt shot a great big white rat with his squirt, we often kill them with shovels or sticks, we knock a bit of fun out of them sometimes I have found numbers of them after a fairly heavy shelling quite dazed & silly \"shell shock\" I should think, that’s the time we score, & get our own back\n\n6 of my platoon had a pretty narrow shave this morning they were camped in a little trench just behind the firing line (the Bean\") & right close to them on the parapet was a big unexploded bomb so the officers thought they would try if they could explode it with a rifle, the very first\n\nshot struck the detonator & off she went, the concussion from her knocked the 6 men flat on their backs & some of them had their clothing all torn by it, but the funny part of it was to come for our artillery hearing the bomb go off & not knowing the strength of it, thought it was one of Fritzies, so they at once turned their guns loose & gave him a bad 5 minutes & all the while Fritz was innocent & hadn’t even fired a \"pip squeak\".\n\nI fancy the weather will be finer tomorrow for the sun came out just before sunset tonight & I could see the blue sky\n\nThere is also a fair bit of a moon showing tonight, & the night working parties can easily do with it for it is rotten working in the pitch dark.\n\nWell this is the end of another small diary making me 5 in all I must try & get these 3 home safely somehow, for they are much better than letters & are absolutely true in every respect, neither being exaggerated nor understated but plain unvarnished facts of my life & every days doings & what we see going on around us from day to day, & if this book gives anyone as much pleasure reading it as I have had writing it well it will be time well spent on my part.\n\n"}}