{"Document Name":{"0":"Diary_0059","1":"Diary_0059","2":"Diary_0059","3":"Diary_0059","4":"Diary_0059","5":"Diary_0059","6":"Diary_0059","7":"Diary_0059","8":"Diary_0059","9":"Diary_0059","10":"Diary_0059","11":"Diary_0059","12":"Diary_0059","13":"Diary_0059","14":"Diary_0059","15":"Diary_0059","16":"Diary_0059","17":"Diary_0059","18":"Diary_0059","19":"Diary_0059","20":"Diary_0059","21":"Diary_0059","22":"Diary_0059","23":"Diary_0059","24":"Diary_0059","25":"Diary_0059","26":"Diary_0059","27":"Diary_0059","28":"Diary_0059","29":"Diary_0059","30":"Diary_0059","31":"Diary_0059","32":"Diary_0059","33":"Diary_0059","34":"Diary_0059","35":"Diary_0059","36":"Diary_0059","37":"Diary_0059","38":"Diary_0059","39":"Diary_0059","40":"Diary_0059","41":"Diary_0059","42":"Diary_0059","43":"Diary_0059","44":"Diary_0059","45":"Diary_0059","46":"Diary_0059","47":"Diary_0059","48":"Diary_0059","49":"Diary_0059","50":"Diary_0059","51":"Diary_0059","52":"Diary_0059","53":"Diary_0059","54":"Diary_0059","55":"Diary_0059","56":"Diary_0059","57":"Diary_0059","58":"Diary_0059","59":"Diary_0059","60":"Diary_0059","61":"Diary_0059","62":"Diary_0059","63":"Diary_0059","64":"Diary_0059","65":"Diary_0059","66":"Diary_0059","67":"Diary_0059","68":"Diary_0059","69":"Diary_0059","70":"Diary_0059","71":"Diary_0059","72":"Diary_0059","73":"Diary_0059","74":"Diary_0059","75":"Diary_0059","76":"Diary_0059","77":"Diary_0059","78":"Diary_0059","79":"Diary_0059","80":"Diary_0059","81":"Diary_0059","82":"Diary_0059","83":"Diary_0059","84":"Diary_0059","85":"Diary_0059","86":"Diary_0059","87":"Diary_0059","88":"Diary_0059","89":"Diary_0059","90":"Diary_0059","91":"Diary_0059","92":"Diary_0059","93":"Diary_0059","94":"Diary_0059"},"Date":{"0":"unknown","1":1556.0,"2":1557.0,"3":1558.0,"4":1559.0,"5":1560.0,"6":1561.0,"7":1562.0,"8":1563.0,"9":1564.0,"10":1565.0,"11":1566.0,"12":1567.0,"13":1568.0,"14":1569.0,"15":1570.0,"16":1571.0,"17":1581.0,"18":1585.0,"19":1586.0,"20":1587.0,"21":1588.0,"22":1589.0,"23":1590.0,"24":1591.0,"25":1592.0,"26":1594.0,"27":1595.0,"28":1597.0,"29":1598.0,"30":1599.0,"31":1601.0,"32":1602.0,"33":1603.0,"34":1605.0,"35":1606.0,"36":1607.0,"37":1608.0,"38":1615.0,"39":1616.0,"40":1618.0,"41":1620.0,"42":1622.0,"43":1631.0,"44":1632.0,"45":1633.0,"46":1634.0,"47":1635.0,"48":1636.0,"49":1638.0,"50":1639.0,"51":1640.0,"52":1643.0,"53":1648.0,"54":1650.0,"55":1651.0,"56":1652.0,"57":1655.0,"58":1660.0,"59":1661.0,"60":1662.0,"61":1663.0,"62":1664.0,"63":1665.0,"64":1666.0,"65":1667.0,"66":1668.0,"67":1672.0,"68":1673.0,"69":1674.0,"70":1675.0,"71":1678.0,"72":1679.0,"73":1680.0,"74":1681.0,"75":1682.0,"76":1683.0,"77":1684.0,"78":1685.0,"79":1686.0,"80":1689.0,"81":1695.0,"82":1696.0,"83":1697.0,"84":1698.0,"85":1699.0,"86":1700.0,"87":1701.0,"88":1702.0,"89":1703.0,"90":1705.0,"91":1706.0,"92":1707.0,"93":1708.0,"94":1709.0},"Entry":{"0":"\n\nWijtschaete to Paris for 8 days Holiday.\n\nLeft Wijtschaete and went through Kemmell to Bailleul on ","1":" with a friend from the Bn. one Staples to wit. We dined with some friends from the 3rd Squadron Aust. Flying Corps.\n\nArrived at Calais at 7 p.m. and stayed at the Metropolitan Hotel opposite the Principal Station.\n","2":"\n\nWe were aroused from our slumbers at an ungodly hour to catch the 5.20 a.m. train for Paris.\n\nWeather forecast Good.\n\nWe reached the Gare Du Nord at 4.15 p.m. and were immediately assailed by a lanky youth who was very anxious to get a taxi for us. He did not succeed in doing so however so we went to the \nGare\n Underground, I mean, one of them and finished up\n\nat the Hotel Londres. We had a good clean up and took a stroll along the Boulevard de Strasourg after which we dined at the Hotel Brebant. We then went to the Folies Bergere Music Hall and had very enjoyable evening indeed. It was an excellent show.\n\nThe Huns raided the city whilst we were in the Music Hall and dropped a bomb about one block away.\n\nThe girls and women were very frightened and some of the men too \nbut\n and it looked as if they would start a panic but some French\n\nofficers saved the situation by asking the orchestra to continue playing and got everybody to clap their hands and cheer and do anything to keep the minds of the people away from the danger which after all was not very great.\n\nGreat credit is due to these French officers for their timely and excellent advice. Had a panic ensued numbers of people must have been killed in trying to get out. A number of soldiers kept \nthe\n a large section of the crowd busy by dancing and singing. It was\n\nnot long before the All Clear was sounded by the Police going round the city in a car blowing a horn and everybody was soon quite happy and smiling again.\n","3":"\n\nToday we visited the Jardin de Tuileries, Notre Dame Cathedral,\n\nwalked round the Petite Palais and the Louvre. Unfortunately all these places are closed during the war. We then strolled round the Arc De Triomphe and went for taxi ride round the principal parts of the city and got out at the Caserne Pepiniere Barracks.\n\nFrom here I renewed acquaintance with a couple of nice little girls whom I met whilst I was in Paris for the Procession in","4":" and who were very kind to me then. We \ndined\n lunched at the Hotel Brebant again made some new friends, had dinner which was \n\nso long in being served up that we were late for the Alhambra where we enjoyed another good show although most of the items were French.\n\nSun. 10th\n\nA glorious day. We took a car and drove down the Famous Bois De Bologne, round the Longchamp passing \n\ngay crowds of Parisians in their most gorgeous fashions taking advantage of the lovely weather to strut along their Beloved promenade. Dame fashion was abroad in all her glory. Beautiful creatures beautifully dressed, a beautiful day. Voila. We noticed a few \n\nbutterflies enjoying life also during our ride betokening the advent of spring. We took a train from the Gare Des Invalides and went out to Versailles. It was a fast and very comfortable journey through pretty country and we were soon at our destination.\n\nWe were once more violently attacked by an old josser who wished to show us over the Palace occupied by the various Royalties of France. As we had gone hither for that purpose we let him “carry on\". He told us that Louis XIV built the Palais and \n\nthousands of other things which may or may not have been true. Anyway we saw the several beautiful bedrooms, the Chamber of deputies and the carriages used by the Kings and Queens of the nation. We then had a good look round the beautiful grounds. Statuery\n\nwas everywhere to be seen and fountains and small lakes and woods. Altogether it was an interesting day. It must have been a wretched? existence for those royalties to have to live among so much beauty and splendour. We had a look round the\n\ntown and my friend bought a couple of spoons as he makes a hobby of doing this it seems and \ngo\n went back to the city. We found that meals are much cheaper outside Paris than in Paris.\n\nWe had a good dinner again (one of \ntheir\n best anyhow) and\n\nwent to the Casino De Paris and topped off a good day.\n","5":"\n\nWe went by taxi to the Arc De Triomphe thence by train to Malmaison to see the Chateau Malmaison but found it was closed every Monday to enable the keepers to \nkeep\n clean up the\n\nplace, as a fair amount of dust must accumulate during a week after a few hundred or possibly thousand people had passed through to see the place. We returned to Mallot just below the Arc De Triomphe and watched a happy crowd of girls boys and\n\nsoldiers roller skating. There is a great deal of fascination in watching people whizzing about especially if the movements be graceful. We wandered on from here to the city admiring the wares displayed in the shop\n\nwindows. We had an early dinner another stroll and managed to get to the Olympia to time. We know our way round this vast city pretty well now and do not have to ask so many questions of stupid Frenchies and they are stupid when\n\nwhen\n giving anybody any directions. Paris fairly \nbreathes\n vibrates with fun and happiness. It is now not the men who make it so it is the women. They are simply wonderful.\n\nThe Gothas raided again and dropped another big cargo. Many people were \n\nso panic stricken that they rushed into the tube stations and crushed \na\n to such an extent that many were killed. Some were pushed on to the electric line which in places had not the current cut off. As a result many were electrocuted. The\n\nFrench Government has since taken steps to prevent a recurrence of such a fatality.\n","6":"\n\nThis morning we had a look at Napoleons tomb in the Hotel De Invalides. It is covered with sand bags now to protect it from bombs dropped by the Bosche. The whole building\n\nwas built by Napoleon for disabled and old soldiers something like our Chelsea in England but has since been turned into a Museum in which are kept a grand collection of both old and modern war material. In one \nc\n hall are a great number of flags captured by the\n\nFrench during their different battles Statues of all their great men are to be seen in all \ntheir public\n the rooms as they are in all their public places. Another room has a wonder collection of pictures both old and modern. We had another drive down the\n\nBois do Boulogne and then had dinner at the Café De La Paix and had \nsome\n \nlunch\n dinner. We then went to the Eldorado Music Hall and managed to be late again.\n","7":"\n\nWe rose at 11.30 a.m. had a good brush up and tore down to the Café Amerique and had lunch,.\n\nWe took a taxi out to Eiffels Tower and had a good look round both the Tower and the big wheel close by and then walked over the Pont Diena to the Trocadero but found this place closed also. We then got a taxi and drove down the Bois de Bologne to the Lac\n\nwhere we hired a boat and had a row round and enjoyed bumping the boats of the numerous fair ones. We returned to our hotel had a \nwas\n clean up, got into our best and buzzed off to the Café De La Paix where we had a \nbon\n dinner for the last time during this trip.\n\nWe then went to the Casino De Paris again where saw Gaby Deslys the first time but she had gone to England. She left a very clever girl in her place however.\n","8":"\n\nWe left the gay city by the 7.50 a.m. train from St. Lazare Station. Reached Meziden at 12.17 and after a\n\ncouple more changes reached Falaise in Normandy where we were met by the son of our English friend. We raked up a car and went out to Pont D’Ouilly a distance of 14 kilos where we were met by the family and given a hearty reception.\n","9":"\n\nWe decided to have a day over on our leave so today instead of getting back we had a look round the country with our English host. The town of Falaise through which we passed contains the castle built by William the Conqueror. Only such a man would have built such a castle in such a wild place.\n","10":"\n\nWe left our kind friends and reached Rouen here by Serquigny and Oissel about 8 p.m.\n\nWe drove to the Hotel D’Angleterre and were soon comfortable again.\n","11":"\n\nWe went for a drive round the town after lunch in a taxi and through the big pine forest. Thousands of these fine trees are being cut for war purposes.\n\n17th, Sun. \nSt. Patrick\"s Day\n\nGreat crowds of people getting about the town and wearing the green for St. Patrick. We had a great hunt round the different Military Hqrs. here for information concerning our train back to our unit and eventually found out that we could not get a\n\ntrain for the front until tomorrow the","12":" We booked seats at the Tivoli Theatre. It was a very cheap and poor show, and seemed to be very slow after the shows we had seen in Paris.\n\n18th\n\nWe got on board our train about 2 p.m. It was a trooper \nand\n so we looked forward to a rotten journey and so we have not been disappointed.\n","13":"\n\nSpent a rotten night in the train. The weather had been good until we reached Calais when we ran into a heavy mist which eventually turned into heavy rain and put a rather miserable aspect on things in general. Between Etaples and\n\nBologne I put my head outside the window for a few seconds and had my cap blown off for my trouble. \nThe\n I have a clear recollection of it being wrenched from my head as by some angry being and sailing down at an angle of about 30° just\n\nmissing the foot-board and then disappeared after making a suicidal effort to get underneath the train. I began to wonder how I would get on for head cover during 15 or so kilometres back to my unit from Bailleul station till I thought of\n\nnoising my loss about the train at the same time hinting that a “tin hat\" would be very acceptable. A Scotchman came to my rescue after a while by presenting \na","14":" with the above named article. Everybody I spoke to about the matter\n\nseemed rather shy at parting with their beloved \nlids\n and I didn’t blame them. I only cursed them.\n","15":"\n\nThe long looked for Hun offensive has begun. It broke out on the point where the British and French Armies meet like a fearful storm. Masses of huns have been flung into the fray so far they have recaptured a lot of ground in the Somme area.\n","16":"\n\nThe Huns have taken Bapaume and have pushed our line back on a front of about 60 miles to an average depth of about 5 miles.\n","17":"\n\nThe Huns have now reached Albert and have taken Montedidier from the French. This latter is a serious loss.\n\nThe enemy objective is Amiens. He is held fast in front of Arras. He is held all along the front according to latest reports.\n","18":"\n\nWe left Acheux by lorries after a long wait and reached Aubigny about 1 p.m. passing through \nAn\n Amiens.\n","19":"\n\nWe managed to get a sleep in after all last night! I went out to front line Bn. Hqrs. this morning with two of my sigs. and a runner to have a look round. On returning I was informed that we were to move up into supports at once behind right Bn.\n\nas an attack was expected on our Bde. sector. I gulped some food down and galloped off with the Adjutant to have a look at the position to be taken up by our Bn. and pick out the best route to the position from Aubigny. This did not take long \nso\n and it wasn’t long before the Bn. was \nawa\n moving up in artillery formation. As I was going up \nabout with\n with part of Hqrs. an enemy plane dived down at us and opened up machine gun fire. I was prepared for this and immediately gave the order to \nget down\n scatter and get down and open fire on him\n\nwhich they did in good order. A tremendous crowd of our planes were up at this time. I have never seen so many in the air at one time and was not long \nf\n before the bosche plane was discovered and chased to earth. One of our planes came down in flames this afternoon and another one came down under control. About 9 p.m. the enemy opened up a heavy bombardment on the front line outpost positions on the village of Villers Bretonneux. Our guns replied but no attack developed.\n","20":"\n\nIt rained steadily nearly all night.\n\nThe doctor and I managed to keep dry though our feet suffered through being wet overnight. Many others in the Bn. were not so fortunate and had water running into their dug-outs all night.\n\nThere is an art in digging a dug-out. Our planes have been very active again this afternoon. \nbut\n A few hun planes came over but did not stay long.\n\nIt has been fine all day. All the boys have been busy improving their dug-outs with timber and blankets taken from the deserted village of Villers Bretonneux. Our boys have been collecting bicycles left behind by civilians.\n","21":"\n\nOur guns began a concentration shoot early last night and continued practically all night. The enemy retaliated strongly and caused 6 casualties in our Battalion.\n\n2 men were killed at ‘C’ Coy. Hqrs. and Lt. Evans was wounded in the foot. Another man of ‘C’ Coy. received a shell wound in the foot. All the above casualties were caused by one shell. Lt. Green of B Coy. was badly wounded in the head and died at 7 A.M. this morning. He was buried \nthe\n in the village of Aubigny. Lt. Green was an officer in every sense of the word and his death is regretted by all ranks.\n\nIn addition to the shelling\n\nthe men had to suffer a cold wet night as it drizzled all night and best part of today. Fortunately arrangements for feeding the men in the line are very good with the result that they are able to have two hot meals a day. Artillery on both sides has been fairly quiet all day, observation being very bad on account of a heavy ground mist.\n","22":"\n\nThe enemy opened a heavy bombardment early this morning around Bn. Hqrs. One shell hit the dug out in the C.O. (Col. McConaghy) the Adjutant (Capt. Lovatt) and the I. Officer (Lt. Staples) were sleeping. The Adjutant was killed and the C.O.\n\nand the Intelligence Officer were \nsleeping\n wounded very badly. Lt. Ferns of A Coy. was seriously wounded in the head and Lt. Barton was slightly but is carrying on. Several men have been badly wounded and 2 killed.\n\nThe shells which are doing the damage are 77 W.M. 4\".2\"s and 5\".9’s. \nwith\n All have a very sensitive fuze which cause the shell almost instantly it touches the ground to burst. This allows of a much greater spread of the fragments as more force is expended in throwing the fragments about and less force expended in uselessly blowing a hole in the ground.\n\nWe relieved the 53rd Bn. about 9 p.m. this evening.\n","23":"\n\nAll had a fairly good rest after the relief was complete last night.\n\nOur Hqrs. are in a fine old Chateau in the village of Villers Bretonneux. Practically nothing had been taken from the place by the civilians when they left. Food, drink and clothing are everywhere or rather was as the men have been constantly scouting around for what they can find.\n\nUnfortunately the village is being gradually shelled to pieces.\n\nMajor \nAnderson\n Lucas from the 56th Bn. has taken charge of our Bn. Mr. Paliner has been appointed Adjutant. Major Jack of our Bn. has also been killed which brings the total “losses\" in officers up to date to 7.\n\nCol. McConaghy has died from the terrible wounds which he received and was buried this morning in Pusigny. Capt. Lovatt was buried in Aubigny. We are too callous these days to be able to realize the extent of our losses.\n\nCol. McConaghy was an original A.I.F. officer. He saw most of the \ng\n Gallipoli campaign\n\nand some severe fighting \nf\n in France and won the D.S.O. and later on the C.M.G.\n\nCapt. Lovatt was an original A.I.F. man in the Light Horse, saw most of the Gallipoli Campaign had been wounded 3 times and had won the Military Cross and Bar to the Cross.\n\nLieut \nwho\n Staples who was badly wounded came away with the","24":" Bde. and took part in every fight in which the division was engaged in France. He won the Military Medal and later received a commission which he held as only a gentleman knows how to.\n","25":"\n\nI went round with the C.O. to the Right Battalion Hqrs. (12 London Regt.) and had a talk with the old josser of a colonel who didn’t know a damn thing about his outposts, although his officers \nofficers\n and men always salute like machines and nearly faint when he speaks to them. We left him and went for a walk \nd\n round our Coys. All the boys are very happy and anxious for Fritz to come over here. We have had several men wounded from machine gun fire mostly very light wounds. Our men are trying to locate\n\nthese guns as they play havoc with working parties and ration parties. The boys continue to salvage things in the town. The doctor has found a chemist shop and some of the men have found a grocers shop.\n\nNews is to hand that the Germans have made another attack up north and have pushed in to Steenwerk and and Estaires.\n\nThe wily Hun \nh\n is having a good fling on the western front just now. But he must strike a snag soon or we lose faith in old General Foch.\n","26":"\n\nThe Huns are still pushing up North.\n\nWe have not had any official news of events from up there for a couple of days.\n\nWe were relieved from our position \nup\n last night and came back to a reserve. Our Hqrs. now are in a \nhouse\n fine Chateau. We were called out last night and all hands were ready for the Hun to come across.\n\nHe didn’t come over though and we all returned and had a sleep. It has been misty all day driving rain and wind and bitterly cold. Sleep is a grand thing. Pure unadulterated sleep is better than\n\nall the fine dinners in creation.\n","27":"\n\nThe wind about an enemy attack has temporarily subsided.\n","28":"\n\nOur Hqrs. moved out to a quarry to the left rear of the village Villers Bretonneux and all units stood to expecting the enemy to attack. About 4.30 a.m. he opened up a heavy bombardment on all of our positions with large calibre H.E. and gas shells. Gas masks were put on and strict watch ordered for any sign of the enemy. No attack developed however and about 9 a.m. the order was given to “stand down\".\n\nAlthough all ranks had gas masks on during the shelling large numbers of both men and officers of all units in that locality had to be sent away to hospital vomiting and \nall\n many of them totally blind.\n\nNearly all my Signallers were sent away and finally had to go myself. I was carried on a stretcher to the A.D.S. where I was placed in an Amb. car and taken to Aubigny where I had a short spell in a hut or house. From here I was sent on by car to Namp or some such place about 17 miles south west of Amiens. I found that Lt. Staples (our \nl\n former I.O.)\n\nwas still here as his condition is too serious to allow of his being moved farther.\n\nI also found that nearly all the Hqrs. staff of the Bn. were here also, all suffering from gas poisoning.\n\nI must not forget to mention here that four of my boys were complimented by bde. Hqrs. for gallant conduct during the shelling.\n\nWe dragged through the night and early in the morning were placed aboard an Amb. Train.\n","29":"\n\nNurses on the Amb. Train looked after us carefully on the way down to Rouen. I don’t think there is anything\n\nmore beautiful to a wounded or sick man coming in from the battlefield than to \nhear\n have delicate hands tenderly dress the injured part and to hear a sympathetic voice speak to him. A chap feels that he has earned some such treatment, but what if she were not there. So we must be thankful.\n","30":"\n\nReached Rouen and were taken by car to No. 8 General Hospital where I was looked after by an American nurse. As I was quite blind by this time I needed some little attention. The gas in our eyes was just like grit and inflamed them\n\nterribly. During the night my voice also began to go and soon had a fine fruity cough and terribly sore throat.\n","31":"\n\nLeft the hospital at 1 A.M. this morning and came on to Havre by Amb. Train \nto\n where I was carried aboard the hospital ship Granturny Castle.\n","32":"\n\nWe left Havre last night and arrived at Portsmouth this morning about 6 a.m.\n\nSince coming to hospital I have had umpteen tickets attached to and detached from my valuable person and nearly everybody \nconc\n concerned has found a new way to spell my name.\n\nWe were soon transferred to another Amb. train and reached Waterloo Station about 2 p.m. From here we were taken per amb. car to Wandsworth hospital where after shifting about a lot from one ward to another I was allowed to settle down finally in D4 Ward.\n","33":"\n\nI was attended to by an eye specialist and a throat specialist today.\n","34":"\n\nThe Germans attacked Villers Bretonneux at last yesterday and drove our people out.\n","35":"\n\nThe Australians and English troops attacked the town during the night and drove the\n\nhuns out again. They inflicted enormous losses on him and took nearly 1000 prisoners. We also captured two field guns which shows how quickly he pushes forward his light guns in attack.\n","36":"\n\nThe Germans have captured Mount Kemmel the highest point in Belgium. This is a serious loss. It is to be expected that the Allies will endeavour to recapture it.\n\nAbout the","37":" the British Navy made a successful attack on the Mole the seat of the huns submarine trouble. Old ships filled with cement were used for the work and after being steered into position were sunk so as to block the exit\n\nfor hun submarine. It was a very difficult and dangerous undertaking. We lost one destroyer and two motor launches in the attempt.\n","38":"\n\nSince the last entry herein I have had plenty of time for very serious and deep reflection. At times I have reflected very angrily on things which are \nnot\n, and which in my exalted opinion \nshould be\n, in a hospital at least. But the all absorbing item of interest is the war which has been raging during the last month and which has now temporarily subsided slightly. Perhaps we will start the ball rolling next time\n\nMr. Farleigh continues to be bright and cheerful.\n\nMr. Farleigh is in a bed opposite to mine and recently had a relapse which sent him to bed with a temperature. He is very chirpy notwithstanding and talks about the last man and the last shilling and mixes it up with “C\" Companies cookers in his sleep.\n\nOur nurses and sisters are all bright and cheery. I cannot longer delay in mentioning the loss of our night nurse. She failed to turn up on duty about three nights ago and I concluded that it was her night off, but she didn’t\n\nturn up the next night either so I ran up a temperature of 102° and prepared to die. All the other beggars \nwere\n have been watching my chart \nun\n sheet so as to be first in amongst my kit but I have foiled them all as my temp is now only about 100°.\n\nJoe is getting better now and croaks a little louder and oftener than he uster did. Joe by \none\n way of explanation is our Bde. gas officer I mean was, because he got well and truly gassed at dear old Villers.\n","39":"\n\nAnother has told me that Horace who is\n\nbarely 18 years of age has married. He also informs me that he had just completed a novel at time of writing and had dedicated the book to me for which little piece of thoughtfulness I am very pleased indeed and I hope it sells like hot cakes.\n","40":"\n\nOur boys continue to worry the hun in front of Villers. Yesterday they advanced ¼ mile on a front of 1¼ miles and took 300 huns 150 M. Guns and killed a great many. Again today they have advanced another 500 yards on\n\na mile front. The hun was highly delighted with his little reverses in this sector and put down a heavy barrage on them and attacked but got knocked back and our boys are sticking to their newly won positions. They are the goods alright.\n","41":"\n\nThe weather just now is beautiful. I went for a short walk outside the hospital and watched the children on the common playing all the games I used to play myself at one time. I returned to hospital feeling ready for bed, although I had only been out for about an hour.\n\nLloyd George who has been recently unmercifully attacked by numerous enemies, in particular by Gen. Maurice has squashed the whole lot and rides on as triumphantly as ever.\n","42":"\n\nI went into town today and went to Horseferry Road where I got a few requirements afterwards had lunch at Rayner’s. Then went to a variety show at the Palladium where I roared at Harry Weldon a very dry character. After poking about for a couple more hours feeling and looking like a live corpse I returned to hospital here. The Yanks had a big march past the King and Queen today.\n\nThe Vindictive has been sunk in the canal at\n\nZeebrugge as she was knocked about too badly to be of any use otherwise. The Admiralty consider the entrance to the canal has been effectually blocked with this latter piece of work.\n\nThe Doc. has received a letter from Capt. Crombie of our Bn. who says that our Bn. was in the counter attack on Villers Bretonneux and that Cpl. Wheen formerly of my sector \nand that\n had been recommended for the Victoria Cross for gallant work. He is a wonderful chap and already holds the Military Medal and bar to same.\n","43":"\n\nAbout a week ago the Huns raided London. There was a great row of Anti aircraft \ng\n\nand a fine display of searchlights.\n\nThey did a good deal of damage and killed or wounded many people.\n\nAmidst all the trouble in France Gen. French was selected to go across and take up duties of Commander in Chief and he began by gaoling every Sinn Fein leader he could lay his hands on.\n\nWe have had the most wonderful weather up till the","44":" when dark clouds began to gather. On \n23rd\n night of","45":" it rained heavily. The morning of","46":" opened dull but fresh. The air was cleared nicely.\n\nThis morning I decided to go somewhere so got\n\ndressed and went out to West Kensington to see some friends. I went all the way on top of the bus and enjoyed it immensely. Got back last night 35 min. late and had to go on the carpet this morning and was sweetly asked to stay into to tea tonight. I said I would but what are promises these days?\n","47":"\n\nEmpire Day. Two Aust. Ladies in London invited several of us \nout\n to go with them to see the Empire Day celebration in the Albert Hall the largest Hall in London. The King, Queen, Princess Mary Prince Albert Princess Louise and Duke of Connaught were there.\n\nIt was a splendid show. We were in a box from which we could see everything very clearly. I had a good screw at the Royal family. Princess Mary looked very chic. Misses Fairfaix is the name of the ladies who invited us to this treat. They sent the car to the hospital here for us, took us to their rooms for tea after the show and then sent us home in the taxi.\n","48":"\n\nYesterday\n I went today \nto\n with Doc Leedman to see some Aust. Nurses in the Aust. Nurses Convalescent Home in South Kensington. I saw Sister Cann who used to nurse me in W. Maitland Hospital where I was with a broken ankle at 15\n\nyears of age. I had not seen her till today. They made us at home straight away.\n","49":"\n\nWas taken to Horseferry Road this morning per Motor Amb. with a few others and appeared before a board. I was awarded a month’s convalescence. In the afternoon I went to see Lady Harroby and she arranged for me to spend a fortnight in Dorsetshire and a fortnight in Leicestershire. She was very good after which I \nhad\n went to see The Knife at the Queen’s Theatre and saw Kyrle Bellew. I had dinner at the Club and returned to hospital.\n","50":"\n\nWent down to Hqrs. again today and raised hell about my pay book. It was produced after a short argument and I drew my money and left. Had dinner at the Club again and again went to Hqrs. to receive my meat tickets and sugar ticket and God knows what. I believe tea tickets are to be next on issue to the public. Came home by train and walked through Wandsworth Common and watched the kiddies most of them playing cricket and and other games on one side of the path and people looking after little plots of ground where they\n\nare growing all kinds of vegetables on the other side of the path. \nMany\n Much of London’s best park land has been turned over by the spade to grow food.\n","51":"\n\nI said good bye to all the sisters and nurses and friends whom I knew in Wandsworth and proceeded by taxi to Greyhound Road (Hammersmith) to the A.I.F. Kit Store to overhaul my valise. I found everything in good order took what I wanted and went to A.I.F. Hqrs. after which I went to Liverpool St. Station left my luggage and had a good meal in the Great Eastern Hotel. My train left at 3.10 p.m. and after a long and rather tiresome journey \nin\n through very\n\npretty country reach my station Beccles down there in \nDorset\n Suffolkshire. A car was waiting for me and I was driven through the town and along pretty shady lanes to The Red House where I am now \non\n comfortably installed. I soon made the aquaintance of two A.F.C. \nmen\n officers who are also down here to recuperate. The weather is all that could be desired and the whole countryside is ablaze with flowers, trees in full bloom, birds whistling and grass nearly a foot long every where. The air is beautifully fresh and the whole place presents an aspect of real peace and quietness.\n","52":"\n\nOne of the A.F.C. chaps left this morning for London so this\n\nafternoon the other fellow and I rode in on the Ladies cycles to Beccles and hired a boat and had an enjoyable hour or so on the Waveney River which runs along the valley at the bottom here. The fields and along roads are very beautiful just now. Buttercups \nalong\n in the \nroads\n fields and May in its different colours along roads and hedges. Abundance of bird life. Gardens and fields seem to be conscious suddenly of the glory and sweetness of life. Youth and energy are written all over the country surface.\n","53":"\n\nWent boating \ntoday\n on the Waveney River this morning and slept nearly all the afternoon.\n","54":"\n\nWent to Norwich to day and saw the castle and Museum, cathedral and Grammar School. All very wonderful and ancient buildings.\n","55":"\n\nHad tea today with some friends and then had a stroll down to Bungay Station with a Major in R.A.F. who had \np\n been through the whole piece.\n","56":"\n\nLeft Lady Twiggs place this morning and went to Ashby De La Zouch Station via Ditchingham, Norwich, Ely, Peterboro and Leicester. I was met at the Station by Miss Smith in the car and driven on here to Cole Orton Hall where I was soon made\n\nquite at home.\n","57":"\n\nHave been amusing myself reading, writing, eating and taking a few photographs with my V.P.K. Camera and playing a little tennis.\n","58":"\n\nToday a couple of us were driven into \nLeicester\n Nottingham in one of Mrs. Smith’s cars. It is a very rambling old town.\n","59":"\n\nI went with some Canadian Officers to see the German officers who are interned in Dunnington Hall. We were cordially received by the officer in charge and shown over the building and were able to see for ourselves exactly the\n\nway the Hun is treated in our prison camps. They do not have such a pleasant time as we had thought.\n","60":"\n\nSeven of us officers were \ndriven\n went into Derby to see the Rolls Royce works and were shown over the whole plant. It was a very interesting day, also a little bit exciting.\n","61":"\n\nArose a little earlier and went into Coalville with Miss Smith and a Canadian flying corps officer who had crashed his machine whilst on a visit to Cole Orton Hall about 3 weeks ago and narrowly escaped losing his life.\n","62":"\n\nI left my exceedingly kind Hostess\n\nat Cole Orton Hall from Ashby de la Zouch railway Station and reached London about 3.15 p.m. Came on to the Aust. Officers Club where I booked a seat at the Adelphi and saw The Boy which I enjoyed immensely.\n\nBilly Hughes visited the Club while I was there. He is a very much shrivelled worm to look at and should really have been born in a periwinkle’s shell.\n","63":"\n\nWent out to Wandsworth Hospital and renewed old aquaintances, afterwards returned to the city and saw Lady Francis Ryder where I was intro-\n\nduced to a lot of nice girls and very horrible fellows. Lady Francis is some hostess. This evening I went to a show at the Palace theatre given free to the American troops.\n","64":"\n\nWent before my Medical board this morning and was awarded a fortnights holiday and general service thereafter. So I returned to the club packed my bag and caught the 1.15 p.m. train at Euston Station for Glasgow. I changed at Carstairs and reached Edinburgh at 11.15 p.m. and came straight on here to Mrs. Evans place.\n\nThese are my Aust. friends who picked me up out of the gutter when I was on leave for the first time in England and for the first time in the A.I.F. for that matter.\n","65":"\n\nHad a good look round the city today with \nthis\n the ladies. It is a beautifully laid out city. Clean wide streets. The old Cable tram system is still in use. It does not look out of place though. The Castle is a fine looking building. It is perched on a large piece of rock in the centre of the town.\n","66":"\n\nWent to Empire Palace Theatre.\n\nWent out to Turn House this morning to the Aerodrome. Was taken for a \nfl\n ‘flip’ in a DH machine by Capt. Wood I.C.G. one of the best pilots there. We flew \nunder\n the Firth of Forth Bridge and I had a good look round. We then returned to the ‘drome. This afternoon I was taken up again and we flew over Edinburgh. It is a beautiful city seen from the air.\n\nIt has been a very interesting day. We went to the King’s Theatre this evening and saw Seymour Hicks in Cash on Delivery. He was “full on\". \nt\n \n","67":"\n\nI had a look at the pictures in the Royal Scotland Academy Exhibition.\n\nThis evening I went to see the Woman of no Importance one of Oscar Wilde’s plays. It was cleverly played.\n","68":"\n\nWent out to the Castle again today, had tea at Bobbie Bovis Hotel where I saw two of the “third sex\" and had a long ramble along Scott’s glen a beautiful glen too. Reminded me a good deal of my rambles along the Broken Back Range out Rothbury way.\n","69":"\n\nArrived at Waverley Station just in time to see my train wriggle out out and a damn fool of a porter informed me that I was too late. So I caught the 10 A.M. train for London and Leicester. \nam\n I arrived at Leicester about 8.30 p.m. after changing at York, Cormanton and Sheffield and put up for the night at the Wyvern Hotel.\n","70":"\n\nCaught the 9.10 A.M. for Ashby at the Midland Station Leicester. Was met at Ashby by the car from Cole Orton Hall and was later duly received and\n\nwelcomed by Mrs. Tabor, Mrs. Abel Smith’s daughter.\n","71":"\n\nMrs. Smith and a few others and myself went over to Lord \n\nByron’s home, Thrumpton Hall and were welcomed by the old boy. Lord Byron is a jolly \nof\n old sport. Lieut. Woods and myself had a game of tennis with his nephew and a \nf\n very pretty girl a Mrs. Nielson We won both sets.\n","72":"\n\nA beautiful day. I had a wander round this \nbig\n lovely old place with its beautiful rosary and clustering ancient elms and firs. My last day here. It makes one think of odious comparisons\n\nI cannot speak too highly of the kindness which I have received at the hands of Mrs. Abel Smith and her family.\n","73":"\n\nLeft Cole Orton Hall and reached St. Pancras Station about 10.15 p.m. Went to the Club in Piccadilly.\n","74":"\n\nReceived my move order from Hqrs. and went down to Warminster to the officers training Battalion where I am now installed.\n","75":"\n\nProceeded with a draft over France as Conducting Officer.\n","76":"\n\nLeft \nBologne\n Folkestone with the draft and arrived at Bologne about 12 noon after about 2 hours across the Channel. Marched to a rest camp above the town where we stayed\n\nthe night.\n","77":"\n\nLeft Boulogne by train about 9.30 A.M. with the draft.\n","78":"\n\nArrived at Harfleur Camp (just outside Le Havre) about 4 A.M. and marched straight to the camp where I handed the devils over and turned in for a couple of hours rest.\n\nI left Le Havre this evening by \nthe\n a trooper at 8.30 p.m. and after a rough trip across in which I was darned nearly sea sick reach Southampton \non n\n next morning.\n","79":"\n\nBack in camp again.\n\nWe have a large Cinema Hall here a YMCA hut and a Concert Hall,\n\neach capable of seating about 1000 men. The pictures are very good though why we can’t have pictures of Australia instead of this everlasting Yankee stuff beats me. A bit of Aust. on the films now and again would be welcomed by all of us over here.\n\nI listened to a very fine lecture given by an Indian in the Y.M.C.A. a few days ago. It was well delivered and appreciated. The subject being The Attitude of the Indian masses and rulers, towards Great Britain and her enemies. He was heartily cheered by the\n\n‘diggers’ at the end of it so he can consider himself highly honoured as the average Aust. Soldier is a keen critic always ready to show appreciation of anything good but woe to those who try to impose on them from the foot-lights. They would be howled down and be sorry they tried to be funny. Nothing succeeds like success with our boys. We were \na\n given a really first class \ncl\n concert the other night by a troupe of four very clever young ladies and one man. The hall was packed and with our splendid camp in the orchestra pit\n\na very pleasant evening was the result. A concert given a few nights previously received a very cool reception.\n","80":"\n\nGen. Sir William Robertson inspected us today. He is a bluff stout old chap full of energy and with a regular John Bull dial. We all got sopping wet but nobody growled. Oh No!\n","81":"\n\nWent down to Sutton Veney hospital today again to see George Pratt. Made an appointment to be at the Nurses’ Mess there to tea for tomorrow afternoon. Walked back to the old camp serenely in the rain feeling quite at \nthe\n peace\n\nwith the world and found a message waiting for me to the effect that I was to pack and clear out at once. In quarter of an hour I had changed and packed and was seated on a taxi on my way to Bde. Hqrs. I like these short notices. Much better than hanging about. Four of us are going back to France together. Arrived in London about 8.15 and I put up at this little joint here near Victoria Station.\n","82":"\n\nI leave by the 7.35 train for Folkestone. I was rather disappointed yesterday at not being able to attend the Mess at the hospital but\n\nsuch is life these days.\n\n23rd\n\nLeft London with my friend Mr. Pentland of the 4th Pioneer Battalion by the 7.35 train. Reached Folkestone about 11 A.M. Had a good lunch and a game of billiards at the Pavillion Hotel and got aboard the SS Victoria. Reached Boulogne 4.30 p.m. Driven to Ostrohove Rest Camp by a thick headed Tommy where we stayed the night.\n","83":"\n\nLeft by 7.42 train for Longpre where after a long stroll round a good clean up and a feed and after trying to confiscate an R.A.M.C. Sergt’s fishing rod we got aboard another train and prepared for an all night train journey and the subsequent\n\nand inevitable “bottom of a bird cage\" taste in our mouths.\n","84":"\n\nReached Harfleur about 11 A.M. this morning and reported to the Base Hqrs. and settled down.\n","85":"\n\nHad a large night in Le Havre with my friend Pentland this evening.\n","86":"\n\nI’m fed up to the teeth. My pal Pentland left for the front this evening and I have to hang round this blasted place for heaven knows how long. I have to do duty on train piquet at 9 this evening between here and Le Havre as the diggers have been making a name for themselves in these.\n","87":"\n\nLeft the base in charge of a draft of 94 men and \nthe\n 3 officers for our Reinforcement camp.\n","88":"\n\nReached the Rein. Wing here at Pernois about 90.30 A.M. and handed over my draft.\n","89":"\n\nThe weather is very hot and muggy. Went off today to see the","90":" Army School of Cookery. Had a first rate meal and went into Abbeville, had tea at the officers Rest House and returned after a long dusty and hot ride in a motor lorry which has been out since Mons and had seen about 12 years on London Streets before the war. It is wonderful the amount of work which can be got out of these old busses.\n","91":"\n\nLeft Pernois by lorry at 5 p.m. and reached the Bn. at St. Vaast about 6.30 p.m. where I was cordially greeted by old faces. Was posted to A Coy. with 2nd Lieut Dodimead. I found that Arthur Wheen had been promoted from Cpl. to Commissioned rank with a second bar to his Military Medal, and that he had been appointed Signal officer. So that I have a very worthy successor. I am in charge of No. 4 Platoon now.\n","92":"\n\nWe did a little Coy. training this morning. This afternoon all four of us A Coy. officers went into Vignacourt\n\nclose by here. \nThere\n The church in there has a very pretty tower. One of the prettiest and most artistic I have seen.\n","93":"\n\nTwo Companies of our Bn. left St. Vaast this evening and after a very hard and lengthy march reached billets here in Cardonnette in good style. The spirit and staying power of our chaps on the march was never better illustrated. Good news in the France papers. The Allies have driven the huns back between Soissons and Rhiems (about 50 kilos) to an average depth of 10 miles. It is a wonderful victory for our armies.\n","94":"\n\nWe left \nSt Va\n Cardonnette amidst a heavy down pour and after a long march through mud and slush lorries huge Tanks and ammunition waggons etc. we reached a line of dug-outs in a huge bank north of the town of Daours where the men were sardined in for the night.\n\nA very big attack is pending on the Villers Bretonneux front here in which Colonial troops are playing a very large part. Many Tanks of various sizes are to assist. Now we must pass on to the next book.\n\n"}}