{"Document Name":{"0":"Diary_0086","1":"Diary_0086","2":"Diary_0086","3":"Diary_0086","4":"Diary_0086","5":"Diary_0086","6":"Diary_0086","7":"Diary_0086","8":"Diary_0086","9":"Diary_0086","10":"Diary_0086","11":"Diary_0086","12":"Diary_0086","13":"Diary_0086","14":"Diary_0086","15":"Diary_0086","16":"Diary_0086","17":"Diary_0086","18":"Diary_0086","19":"Diary_0086","20":"Diary_0086","21":"Diary_0086","22":"Diary_0086","23":"Diary_0086","24":"Diary_0086","25":"Diary_0086","26":"Diary_0086","27":"Diary_0086","28":"Diary_0086","29":"Diary_0086","30":"Diary_0086","31":"Diary_0086","32":"Diary_0086","33":"Diary_0086","34":"Diary_0086","35":"Diary_0086","36":"Diary_0086","37":"Diary_0086","38":"Diary_0086","39":"Diary_0086","40":"Diary_0086","41":"Diary_0086"},"Date":{"0":"unknown","1":1380.0,"2":1381.0,"3":1382.0,"4":1383.0,"5":1384.0,"6":1385.0,"7":1386.0,"8":1387.0,"9":1388.0,"10":1394.0,"11":1396.0,"12":1397.0,"13":1398.0,"14":1399.0,"15":1400.0,"16":1401.0,"17":1402.0,"18":1405.0,"19":1406.0,"20":1407.0,"21":1408.0,"22":1409.0,"23":1415.0,"24":1416.0,"25":1417.0,"26":1418.0,"27":1419.0,"28":1426.0,"29":1427.0,"30":1430.0,"31":1433.0,"32":1434.0,"33":1436.0,"34":1437.0,"35":1438.0,"36":1440.0,"37":1441.0,"38":1457.0,"39":1459.0,"40":1475.0,"41":1476.0},"Entry":{"0":"\n\nOn arrival at the Soldiers Theatre at 5 Pm we found a large crowd of Boys standing two deep waiting to go in so we formed into line & took our Turn, after waiting for about 15\" \nwe\n Doors were opened & we went in by our Turn, there were 4 Belgian Girls also waiting to go in so \nthey\n we told them to get in front of us which they did & as the 50 Cent Seats were all sold we only could get 30\" which was at the back, anyhow we obtained a good seat behind the Girls & had some fun during the evening, The Girls were dressed very plain & even had their Aprons on I am satisfied our Australian Girls would never go to a show dressed like that, but it seems to be the custom & They don’t mind. The Division put on a first class show & the crowded house gave them a great reception, it was over at 8 Pm starting at 6 Pm & afterwards we made for home & had Supper & went to bed.\n\n","1":"\n\nI was on the Pilot Engine & had to run out to S.P. Siding with Ammunition which is \n\njust beyond the Casualty clearing station, On approaching the clearing station I had to stop as there were a lot of Ambulance Motor Cars with wounded boys in on the Crossing. This station is a very busy place & handles a lot of Cases every day. As soon as each Motor stops at the Main Entrance, Stretcher Bearers come out & carry in all the Wounded, after a little delay we continued on to the Dump were a lot of Black Soldiers were loading Shells from the stacks into The Narrow Gauge 2 ft 6\" Light Railway. These little Trucks are very strong & hold a lot of shells, some of the trucks have a Bogie at each end & the centre of the Truck is lowered down close to the ground, so as they can hold a lot of Shells. After leaving our Trucks then we came back steady. The Motor Cars were still unloading Their injured & we soon arrived back to our Depot. As our Big Offensive started again on Wednesday Morning","2":" at Daylight, in fact all \n\nnight we could hear the Big Guns Booming. The Boys in our Sector went over at Daylight gaining their Objectives & taking Prisoners. During the Day a lot of Troops passed along the Road each Battalion had a Band playing. After Tea more Troops passed along. \n","3":"\n\nI was called for Duty at 5 am as Pilot, just before I was called I \nI heard\n I was awakened by a Band playing at about 4 am, A Troop Train came in & the Drum & Fife Band struck up a lively tune when they marched off. I signed on a few minutes after 5 am when another Troop Train arrived also a Band. They soon were on their way when at 7 am, another train came in, My Eng was taken back at 7 am near the Main Road out of the way & at 7.30 I came over & got my Breakfast & had it in my Hut, at about 8 am I left my Hut & was going over through the bush & all of a Sudden a loud Explosion took place on the Road\n\nahead of me, it was a Fritz High Explosive. The shell struck the Road fair in the Centre & blew up the Cobble stones in the Air, I took cover at once behind a Tree & the stones were falling around me everywhere, nobody got hurt, the Explosion was about 15 ft from a Belgian’s Home & some of the stones broke the slates on the Roof. I went along towards my Eng when another shell exploded at the side of me about 30 yds away & just about 15 ft from our Coal stage between the lines it made a hole about 6 ft deep & about 15 ft across. The dirt shot up in the Air & a number of Chinaman were coaling an Engine & they ran in all directions for cover & the dirt fell all over them, a few minutes another one came over & struck the Bank alongside of the Low Road & blew the dirt all over our Cook House which was about 20 ft away, the Roof was covered with Sand & the Officers Breakfast which was inside was spoilt by the dirt, \n\nOur luck still sticks to us as no one was hurt much, one man got a knock & cut his arm & a Corporal in charge of the Chinaman got a bruised hand, one of my chums near by was knocked over by the concussion, also a Sergeant was knocked over as well. \nHe\n Fritz stopped shelling for a while, the hole near the Cook house was right under the line & in both cases the line was not broken only bent. it caused quite a stir in the Camp, I saw from where I was standing men rushing in all directions. After a spell he started again, further over this time & put 2 shells in a Potato field, sending Potatoes up high in the Air. The 3rd shot hit a heap of Timber in the Royal Engineers Yard, scattering timber every where, the","4":" shell exploded between the C.E. Army Hut & a Estaminet, & made another large hole. he left us alone all day, sending them over in other directions. During the Day 4 of our Chaps went to the Hospital, 2 with injurious & 2 with \n\nshock & were detained there. During the Day more Troops arrived & marched along the Road with their bands playing. At 8 Pm tonight while I was sitting writing, I heard a Band Playing & went out side in the dark, It was wonderful outside, all along the Front line one could see flashes of Gun fire, in another direction you could hear the Rattle of the Motor Transports, & behind the Hut Troops marching in the dark to the tune of their Drum & Fife Band, judging by what has taken place these last few days there is something big on. I heard tonight that these last 2 days we have advanced 4½ miles on a 8 mile front & still going strong, Eypres today being full of Prisoners. It is now nearly ten Pm & I have been writing for 3 hours I will have my usual cup of cocoa & retire & trust that Fritz will not disturb us during the night. \n","5":"\n\nDuring the day 1 Sergeant 1 Corporal & a Sapper went into the Hospital suffering \n\nfrom Injurious & Shock caused through the Shelling we got the day before. I was booked on duty at 5.40 Pm (17.40 French time) for a Trip up to the Canal on the Armoured Engine (3568) Another Engine was put on the lead of my Train which was of stone for Ballast, we left the yard at 6.20 Pm & as there was no water in the Tank for Engine purposes caused through a break in the Pipes I had to go very steady on my ¾ of a Tender about 1500 Gallons, we proceeded along steady & had no delays enroute passing Camps of Soldiers, Ammunition Wagons & no end of Horse Lines, One passes first a large Camp of Tommies, then the Scotch lads & numerous tanks covered over in the bush, Some distance from the canal I could see lines of White Tape secured on the ground & square places of canvas which is the Training Grounds for the lads to rehearse their work in connection with the advance. The White lines indicated the German lines & the canvas squares \n\nwere supposed to be the Blockhouses which our lads had to take when going over the top. In due times we arrived with our Train at the Dump where the ballast had to be unloaded. The leading Eng had been detached at Reigersberg & was returned light. We waited some considerable time for our Gang to come & unload the trucks, in the meantime I had to pull out on to the Old Belgian line to allow of an Ammunition Train to pass for St Jean, & then I had to return by that time the Gang arrived & proceeded to unload the first portion. After placing the rear portion my Water in the Tender was very low only 500 Gal left so after finding out that there now was water in the Tank at the Depot, I came back light & refilled & returned & still had to wait for nearly two hours before I returned likewise the Ammunition Train behind me which also was held up. During the Evening while waiting things were very lively, Our Big Guns fireing all around me also Fritz’s shells\n\n \n\n \n\nwere coming over pretty constant but none exploded near the line. Things quietened down again about Midnight until daybreak when the fireing was renewed until after 6 am, although one of our 12’ Inch Guns (Hell Fire Liz) which was concealed in a Wood near by would Fire now & again all night, making the Engine Tremble every time, Having finished the unloading by 6.30 am I came back in good time booking off at 8 am having been on duty 14 hrs & 20\". A short description of the Armoured would not be out of place. This Eng has a steel caseing ¾\" Thick all around her & has steel doors for us to get in & out also small square spaces to look out, The Steel plating on top of the Cab is extended to over about ½ the Tender making the inside of the Cab shrapnel Proof also the Boiler & Motion parts, only a direct Hit would do any harm. She is 6 wheel coupled & has inside Cylinders & Steam Chest also the Westinghouse Brake & Steam Reversing Apparatus & carries \n\na working pressure of about 190 lbs to the square inch, we have another Similar Eng but is not armoured & about 8 lighter Engines with the Steam Brake. After having Tea","6":" I caught a Motor lorry & got a ride into Poperinghe to go to the Cinema Pictures, after getting out of the lorry I walked along the Rue De Hospital a very narrow street which is always crowded. I heard a Pipers band playing. The traffic on one side was stopped & in a few moments along came the Pipers, I stood to attention & saluted the Officer in the lead & behind him came 12 Pipers, one Drummer who handled two sticks, & my word could’nt he use them, alongside of him was 2 Timpany players & behind were 8 Side Drummers. The Band played beautiful & made one feel proud of being in Kahki, & behind the band marched about 1000 scotch lads with their short frock’s & they just could march. They were a treat to watch. After they had passed Traffic on that side was resumed \n\n& I made my way to the show, having to await my turn & form up in line 2 deep, after a little while the doors were opened & I eventually got a Ticket for 3d and went in & got a seat near one of the Windows, which were of wood & opened & in between each picture I would open the windows for fresh air likewise to watch the endless stream of Traffic, at one interval along came 8 Caterpillar Traction Engines drawing each a big Gun, & they made a terrible noise rolling over the Cobble Stones. After seeing a good show I came out at 8 Pm & made my way home after purchasing a kilo of Sugar for 2 franc 2d. & I lit the fire & had some Supper & turned in. \n","7":"\n\nI was booked on duty at 6 am until 4 Pm on a Emergency job but did not get a run out of the yard. During the Night there was a Collision up the line, the Armoured Eng was taking up an ammunition Train, propelling it when a light Eng coming down crashed into it, telescoping 2 trucks of Ammunition, the latter \n\nfortunately did not explode The force of the impact knocked the Guard over giving him a nast shakeing & \nthe\n Sergeant Major Gallica \nwho was with the Guard\n who was on the light Eng had his wrist broke & badly lacerated & was taken to the Hospital & detained there. The Fireman Corp C Kelly had a narrow escape as the force of the impact caused the Fire Irons to shoot out from the side of the boiler & into the Cab & one hit him on the Head making a big dent in his steel helmet, which saved him from a serious injury. Somebody made the blunder in allowing two Engines in the section at one time, it was very foggy which made it all the harder to see ahead. \n","8":"\n\nI signed on duty at 3 am on the Armoured Engine 3568 on a Emergency Job, I was not required until 7 am to do any work so I had a sleep until 7 am on the Eng, I left with a full load of stone for E.8. Siding where the stone is loaded into Motor Wagons for different works. It was very \n\nfoggy & I had to proceed slowly & sound the Whistle very often, on trying to get over the first bank after leaving the Main line, the load & greasy rail caused my Eng to slip & stop, so I had to come back about ¾ of a Mile & have another try, when I succeeded in getting my train over, & in a few minutes I got to my destination, it was pretty rowdy, Guns booming all around one, in fact from Midnight & heavy Bombardment on a large front ahead was in progress. After placing the trucks I returned light Eng & on my way I had the pleasure of seeing a Tank on the Move, crawling along steady like a Tortoise, they move very steady hardly making any noise, I had to go into Steeuji Mill Siding to clear the Empties & picked up about 20 & arrived back into the yard at 9 am & stood on my train until 12.20 Pm, I was sitting down on the Sand alongside of the Eng at 11.30 when I heard \n\nseveral reports of a Machine Gun fireing overhead, on looking up I saw one Aeroplane coming down & in a moment \nabout\n 8 more following, the one was diving & turning quickly the others following when all of a sudden the one turned upside down & began to fall. a great cheer went up from the Camp as the Machine was slowly coming down & the others following it as it came closer it was wobbling from side to side & parts of it was falling away, down, down it came slowly until it was lost to view amongst the trees, then there set in a scamper of the boys all making for the Scene about 1 mile away. Being on duty I could only go over to the Road where I could see Soldiers running in all directions, it is marvellous where they all came from, One of the Machines in following the disabled one came down to quickly & he lost control & struck the ground, As we all expected it \nturned\n to be a German Machine, we were all correct, it appears that the others where French Machines \n\n& they followed him from Calais & tried to make him descend & surrender & they would not, as there were two Germans in the Machine so the French Men fired on them at close range & shot the pilot through the head & smashed one of the wings. The Observer he jumped out as the Machine was near the tops of the trees, hoping to get caught in the Branches, but did not & he crashed down \n& was killed instantly\n, & he was badly smashed up but was breathing but died a little later. The Machine fell on a square piece of cleared ground alongside of a Dump. Crowds soon gathered around to gather parts for Soveniers. I signed off at 1.45 Pm after another run to Pottenhook siding with Ammunition & then I had a sleep during the Afternoon & after Tea my chum & myself went over to see the place, when we arrived on the spot, the Machine was gone only small pieces of wood were left about the ground & a lot of Petrol was lying in a hole, which \n\ncame out of the Tank. A Guard of the Dump told us the Machine was taken over to the Aerodrome about a mile away, so we made our way there & after a few inquiries we was directed to where the Machine was being loaded onto a lorry to be sent away. It was terribly smashed up & a complete wreck, I saw the Black Cross quite plain on the Side, it had been a fine Machine & was of a light blue colour. We then went around & saw the French Machine which came down also, it appears that the French Pilot who shot the German came down a bit to quick in his excitement & could not recover himself\nves\n in time & crashed into the Trees & the Machine fell down to the ground, the Pilot received a nasty shaking but was not seriously hurt. The Machine was knocked about a little, but the damage will not take long to repair. The French Mechanic’s were taking it away on a lorry, we then went around where our Machines were \n\ncoming home, one after the other after their days work, we had a long chat with a Sergeant who explained that the Pilot’s in the single seated Machines only do \nat\n on an average of about 20 to 30 hours flying & are either killed, wounded or taken prisoner as their Machines travel at a speed of about 130 miles per hour & pilot the bigger ones over the lines & necessarily they have to do a lot of fighting, as it was nearly 7 Pm & the light was drawing in we saw the lights which were shot up from a Gun near by as a Signal to other Machines returning, after seeing all we could see we started on our homeward walk & arrived back \nat\n in Camp at 8 Pm when we boiled the kettle (A Petrol Fire) & had some Toast & Cocoa for Supper & then turned in after a great day of excitement. \n","9":"\n\nI was booked on duty at 4 Pm (16 oclock) on the shunter & after shunting about\n\nuntil 6 Pm I was ordered to get ready to go up to Reigersberg for a Truck of Ammunition to take up to a Big Gun. I left at 6.30 & made a good run to Reigersberg & found out that the truck was in a spur off the old Belgium Line at Reigersberg North, so off we went & soon we were coupled on to the Truck of 12 inch shells which were for \nHell Fire Liz\n Hilda the big Gun which was up past St Jean in a Gun Spur named H3. we picked up a patrol party at the Station for the purpose of making the line good in case Fritz has blown it up. On leaving Reigersberg Nth we took a Right hand for a quarter of a mile when we crossed the Canal, as it was bright moonlight I could see a good way ahead & around me, As I was crossing the bridge over the Canal I could see the large number of Dug Outs in the bank & men moving about, it is a fairly safe place as the bank is high & the Canal is dry, hardly any shell could blow their dug outs in; on going a \n\nlittle further I passed a large number of our Brave Lad’s Graves, you can see the white crosses standing out plain in the Moonlight, After leaving the Cemetery one comes into very open Country, hardly a tree is left standing or a Farm House, everything above ground has been blown to pieces, I passed several lines of our old trenches also Trenches Fritz had occupied prior to \nthe\n","10":" when we first shifted him. The country about is fairly flat. After a few more minutes I steamed through the Yard called St Jean, The village being away in the distance, this place will be I presume another Railway Depot bye & bye. We continued going & all being well ahead for about a mile or so when we came to H3 Gun Spir which run alongside of the Main for about 2 chain, we stopped the truck opposite the big Gun & the Gunners started unloading the shells, As we gradually approached this Siding, things started to liven up very much \n\nOur 12 & 15\" Guns all around were blazing away at Fritz, it \nis\n was like the old saying (Cannons to Right, Cannons to the left in fact Cannons were all around us, & what a terrific noise, you could hear the 15\" when they fired they gave a double bang & the 12\" a single bang. As Fritz was sending heavy stuff over, our Guns were warming up to the engagement, & as the 12\" were fired I could see long tongues of Flame belching forth in their Anger, it was a glorious Sight although terrible, every time a 15\" would fire my Engine would tremble (No 3092). The Patrol party had a job to do as the line behind the Big Gun had been blown up by Fritz at 6 am in the morning, it was a very close call for all hands, the Shell exploding about 20 ft behind & the concussion knocked the gunners over but did not hurt anyone. It took 40\" to unload the truck & as it was getting to hot around about, we were ordered to clear out to Reigersberg \n\nNth & await the patrol party who had to finish repairing the line, we jogged along quietly & arrived at the station, & waited there. I was standing on the ground later on talking to a Tommie when I heard a Fritz Machine overhead somewhere. I took cover behind the Tender & no sooner had I got there when I heard a Whiz Bang & a Bomb exploded about 50 yds away in the bush, I ducked down quick & I heard several pieces strike the Eng & Tender, I then crawled under the Tender likewise my Mate & stopped there until Fritz had cleared out, he only dropped the one, After awaiting about 1 hour the Patrol Party returned & we set sail for home, only having a couple of small delays enroute. On the journey homeward as soon as we passed one lot of search lights looking for Fritz we would come to another. We arrived back at 11 Pm & I stood by my Eng until I was releived at midnight. \n","11":"\n\nHaving broken my bottom plate of False teeth a few days previous I had to attend the Dental parade & go to the Dressing Station at Steeuj Mill to hand it to be repaired. While I & a lot of others were waiting the arrival of the Dentist, several Motor Ambulances came in bringing a large number of wounded Canadians who had been hit by a Bomb at 7 am in their Camp while they were on parade, one slightly wounded man told me that a Bomb dropped by Fritz had fell on a tent belonging to one of our Drivers who were attatched to the 268 Construction Party at Arrival Farm, the Driver was away on his Eng at the time, the Explosion had killed 7 outright & wounded about 40 of the Party, they were lined up for the 7 am roll call when it happened & Fritz after he dropped his bomb, he put his Machine Gun on them, as it was a bit \n\nfoggy he came down pretty low & then cleared out. After handing in my teeth for repairs I then returned to Camp. I had to go on duty at Midnight & had a fairly quite night, although Fritz was putting shells over now & again, I don’t think he did much harm, one blew up a lot of timber in the R. E Yard & one passed over very close to us & exploded in the Wood, it gave the shunters & ourselves a bit of a Start but we soon got over it. After having a sleep all day","12":" I & my chum had Tea early & left for Town at 5 Pm to go to the Variety Show in the Tivoli Theatre, on the way in we passed a very long string of Artillery & their Wagons they were over a Mile long all going up towards our Front. We arrived at the Theatre just in time to get in as it was about full up & we managed to squeeze in & saw a splendid troupe of Artists, in fact the best I have seen in Poperinghe up to date, it is grand for one \n\nto be able to go somewhere for an evening’s enjoyment if only to forget this terrible war. The Show was over at 7.30 & it is now dark at that time. The Town is practically deserted, except in the Estaminet’s. We had a couple rounds of Drinks & then jogged along slowly home, arriving there about 8.30 when I boiled the Kettle & had Toast & Cocoa for Supper & as the Moon is now rising late & the weather cloudy, Fritz did not trouble us with his bombs although during the night I heard several shells coming over & exploding somewhere in the bush. \n","13":"\n\nI was booked on the Shunter at 4 Pm & was kept very busy all the shift & signed off at Midnight & came on again","14":" \nat 3.30 on an Emergency job, we stood by until 6 Pm when we had to take a train load of Ammunition go Light Engine up to B1 Siding on the Old Belgian Line & pick up a Truck of 12\" Shells\n\nI signed on at 3 oclock for an Emergency run & stood by until tea time when I had to take several trucks of Ammunition up to Reigersberg Siding (Gas Shells) after making a good run & placing the trucks in the Siding I received further orders to go further up past the Canal \nfor\n to bring back two trucks of Duck Boards, & off I went & on arrival at Reigersberg Nth there were no pilot there so as it is not permissible for two trains to proceed over the Canal I had to return to Regersberg & then was ordered to go back to Trou Trois Siding & pick up a full load of Empties for Peselhoek. After waiting line clear for some time I was let go & soon arrived at the Siding & we had to pick up a lot of trucks on one road & put them on another when my train was complete, this siding is used to unload the shells from the Broad Gauge into the Light Railways. After several delays I eventually arrived back at 12.40 am \n\n& signed off at 1 am.\n","15":"\n\nI signed on again at 6.30 & had to couple on to ","16":"\n 3 trucks of Ammunition & a large number of trucks of Stone Ballast & had to proceed out to South Loop where an Engine attatched to the 264 Coy was coupled on behind & when line was clear, off we went to St Jean where the Ballast was placed in the Siding & the Coy’s Engine was sent back to Reigersberg for a load of Rails & Sleepers for the head of the line. We then went on to the first Gun Spur H. 1. where we waited until the Gunners of “Hell Fire Liz\" a 12\" Howitzer unloaded 2 Trucks & off again to H3 where ½ the remaining trucks of 12\" Shells were unloaded for “Hilda\" another 12\" & then on further to H4 where the remainder was unloaded for “Gertie\" another 12\" Gun. All the time we were in these Sidings things as far as Fritz was concerned was very quiet, he only put a few over, although our Big Guns around about \n\nwere giving him plenty. We had to wait in H4 until the material Train came along which was not very long, The head of the line was only about ¼ of a Mile further on right on top of what is known as Pilkem Ridge & now they are going to extend the line a further mile, of course Fritz is back over the next Ridge so things are fairly safe except the occasional shells coming over fired at random. We left H4 at 10.30 & on passing H.1 a High Explosive Shell burst about 50 yds off the line & about the same distance from the main Road & the Dirt splashed all around the Eng & Trucks, We came back as far as Reigersberg where we received further orders to proceed into Pottenhook Siding for a number of Empty trucks & put them into L8 Siding between Arrival Farm & Hospital Farm, we picked up a few that were unloaded & put them into L8, they are wanted to entrain the prisoners which are in the Compound \n\nnear by. As there were a fair Moon & partially clear Fritz was out on a Bombing raid, in fact there were several about & we could hear the Bombs dropping in all directions. After leaving L8 we eventually arrived at St Loop we we were held up there for a long time as the Telephone wires had been broken near Peselhoek & we had to wait until Pilot Working was fixed up & several trains had to come from Peselhoek, When our time came to depart off we went & soon saw what caused the damage, Fritz had dropped two Bombs along of the line & made very large holes blowing the Telephone Wires in all directions, he dropped another Bomb in a A.S.C. Camp & killed & wounded 39 horses & killed the Corporal of the Picket who was off duty & laying down in a Shed, the pieces of the Bomb penetrated the Iron & practically riddled the poor chap & wounded one of the picket. Another Aerial Torpedo was dropped along \n\nside of the Main Road near the Stables & although several lads were sleeping in a shed close by none were hit, the dirt was thrown about in all directions for a long way. One of our Fireman attatched to the 264 Coy & hit with a piece of Bomb dropped at their depot at South Loop , & is seriously injured, another R.E. lad close by was hit & had his Arm smashed, after waiting for an hour our releif arrived at 6 am & we signed off & had Breakfast & turned in. \n","17":" 10\/17.\n\nDuring the day 19 \nturns\n lads arrived to work amongst us, some were left behind in England & La Havre through sickness & others were as Reinforcements. The Weather all day was wet & cold & partially cleared up during the Evening. \n","18":"\n\nI signed on for a run to St Jean at 13 oclock with mine earth \n& Ammunition\n & left the Depot at 15.45, my Engine was in the rear & another Eng was in the lead \n\nwe had 40 Trucks on board heavily loaded & after a couple of delays enroute we arrived at St Jean at 17 oclock, We could only get our Train half way in at the Station as every road was nearly full up, This Station is a new place & is Situated about 1 mile past Epres Canal on an incline & has 6 \nroads\n sets of Rails laid down \nto\n at present & they are still adding to the number of Roads, the ground is very soft & takes a lot of Ballast to make a good bed for the Rails. After splitting the Train into 3 sections I eventually got the Train in clear of the main line, There were 3 Labour Company’s waiting on Trucks, one behind the other to get away to their respective Camps, & once the line was clear they were soon on their way. All around the station is Dug Outs & Camps occupied by Troops & things are humming in all directions mingling \n\nwith the noise of the Big Guns all over the place. All the Balloons which were around our Depot & in a circumference of a mile prior to the first push of","19":" last are all now around St Jean Station, the distance I think is about 8 miles from here & as Fritz is about 2000 yds further on, so we have made good progress up to date. The Leading Eng of my Train had to shunt Cracker Doom a big 12 inch howitzer out & go about 150 yds up further & put the Gun into H2 Gun Spur, & I had to come back into Zouave Siding about 100 yds back to pick up a load of Empties, & as soon as this was done I came back after a few delays & reach our Depot at 9 Pm & did no more work signing off at 11 Pm.\n","20":"\n\nI signed on again at 13 oclock on the Armoured Eng 3568 & after preparing my Eng I was attatched to 34 Trucks of Mine Earth & left at 15.15 oclock \n\nin bad weather, it had been raining continuous all day. I was blocked at the first Siding South Loop for about ½ an hour waiting for a labour Company, which eventually arrived, The Officer in charge of the Company came on my Engine & as it was his first trip up the line, he was very anxious, he only joined his Company on Friday from Blighty & it was his first appearance \nf\n on Active Service. On leaving South loop my Westinghouse Brake started to leak & the Brake continually going on, I cut it out altogether & used my Tender Brake, & proceeded along slowly & having no delays I arrived at St Jean at 17 oclock. The line over & near the Canal was in a very bad condition due to the excessive rain all day. I was expecting the Engine to come off several times & I held my breath 2 or 3 times, talk about a Ship in a heavy sea, it was just like that, my Engine would rise & dip & then \n\nsway from one side to the other, if she had come off I would have been there a few days as the Eng would have partially buried herself in the soft ground, I had to go fairly fast over this portion so as I could get up into St Jean without being stuck. Anyhow my luck was in & I arrived safe & sound. Things were as busy as ever & I had to run out about ¼ of a mile ahead to allow of two Coy’s of Workmen to get away home. So my Officer put his men on to unload a train of Mine earth in No 5 Road while I stood away up the line. While I was waiting to come back, the Tommies from the Big Guns, Cracker Doom, Gertie & Hilda also from the Balloons came over with their Sand Bags for Coal & were soon busy at the back filling their bags. I sympathise with them in their work & rough life & I am only to pleased to allow them to fill their bags with Coal as the nights now are fairly \n\ncold. On receiving a Signal to come back I pushed my train in on to the end of \nthe Train in\n No 5 Road clear & ran around & got on to the Empties & waited until they were unloaded. I made an attempt to find the fault with the Brake but as all my experience in Australia was with the Vacumn Brake, the Westing House Brake beat me so I decided to await for the next Eng coming up to assist me home. On making enquiries from the Station Master he told me the Brake Down Train was in Zouave Siding rerailing a derailed Engine, so off I went over & informed our Officer in Charge of the Brake Down Train of my Brake failure & he brought his Eng & Train also the rerailed Eng out & came up & got on the lead of my Eng & as soon as line clear was given 20.15 we all came away together. Things around St Jean were very quiet, no shells coming over, only \n\nan occasional boom of a Gun in the vicinity. My Officer in Charge of the labour Company asked me coming home if it is like that at St Jean all day & night. I told him No, it was only like one or two women beating carpets, but when the neighbourhood starts beating their Carpets, that is what it is like when all the Guns are fireing around, no doubt he was very nervous for the first time but will soon get over it bye & bye. We made a good run as far as South Loop where we were stopped & instructed to shunt all the Empties into the Siding & go into the Depot on our own,\n\n After allowing the working Coy & bidding Good Night to the Officer we shunted the Trucks & on getting line clear we left & in a few minutes we arrived back & I then stabled my Engine & signed off at 11-Pm & I went over to my hut & lit the fire & had some Toast & Coffee when my chum knocked & came in & he had \n\nthe same & we turned in at Midnight, having a nice fire burning nearly all night. \n","21":"\n\nAccording to instructions about my Transfer to the 264 Railway Construction Coy Royal Engineers, As I was told to take up duties at 6 Pm for the Coy I went into Poperinghe to make a few purchases in the morning & after lunch I put my Kit Bag & Rugs on board a Train leaving for St Jean at 13.30 oclock & after a few minutes delay we departed from the Depot, after picking up a few more trucks of Material at South loop for 264 Coy we continued on our journey & after several delays I arrived at Nth Reigesberg near the Yser Canal at 4 Pm & soon had my belongings at my Head Quarters, alongside of Besenji. Railway Line, as I had to releive another Driver, I took up his quarters which were in a covered Truck, as there are only \n","22":" stretchers in the Truck we have plenty of room & I soon made myself comfortable. At 17 oclock I went into the N.C.C’s Mess for \nTea\n Dinner which is built of Wood with Tarpaulins covered all over to keep the light out, on account of Air Raids, I had a position allotted to me at a Table & had a very good \nTea\n Hot Dinner, which I enjoyed, There are two Engines attatched to the Coy & 4 Drivers 4 Fireman & 4 Guards, The two Engines are out all day & the Men are releived at 6 Pm & they continue working all night. I took my Eng \nout\n over at 18 Pm & at 20 oclock the two Engines with an Officer proceeded up to St Jean to start taking up material for the Construction Gangs next day. We had to take up a load of Mine Earth from St Jean into H1 which was until lately a Gun Spur but now it has been extended for about ¾ of a mile. Also a load of stone for Merrytort Siding which branches off \nof\n \n\nthe Main line at Wieltje which is practically on the top of Pilken Ridge, Wiltje has two Sidings, Merrytort & Ruby & the main line continues on for about ½ a Mile, we had to place a train load of Material \nin there\n at the head of the line during the night, after leaving Wiltje the line goes down hill through cuttings & \ntrench\n past the Old German First line Trenches & pill boxes which are built of Concrete & by the Moonlight I could see that they had been knocked about a lot by our Big Guns. Owing to excavations going on at Wiltje Siding there were a horrible smell from the Dead Bodies of German’s which had to be shifted. After compliting our Work we arrived back at Camp at 6 am & I was releived.\n","23":"\n\nI signed on again at 18 oclock & both Engines left at 20 oclock for St Jean but we did not have much to do, in the way of placing Material \n\nbut a lot of Shunting to get the Material together. We had to go out to the head of the line to bring in the Empties first then take out a big load of Material, We had a struggle to get the loading up the bank to Wiltje & after stopping on the bank twice we succeeded in reaching Wiltje & then it was down hill to the end. Fritz was very quiet all the night no shells at all coming over, but when we were placing the Material he must have seen our lights as he started shelling us, the first shell proved to be a “Dud\" when landed alongside of my Engine in the ground, the second went over the train & exploded about 50 yds away sending dirt all over the Engines & Train, the third shell also proved to be a Dud & landed further back, by that time our Guards had uncoupled & we soon cleared out, & got back to Camp safely. ","24":"\n Monday Night my Eng was \n\nnot required so I had a night off, As my Fireman & Guard had been working Night Shift for two weeks, we decided to change over to day shift, \n","25":" 10\/17.\n\nI signed on at 6 am & was kept at the Camp shunting while the other Eng took up the Working parties, at 10 am, I had to go up to H1 Siding for a Truck of Elephant Iron for the Camp & as it was my first trip up to St Jean by Daylight, I was surprised at the number of Camps & Dug Outs all around the place, on the right of St Jean a large number of Men were busy erecting Marquees for a Hospital clearing station also large gangs were busy ballasting the lines & making a Road for the Motor Wagons. What with Big Guns booming all around also Air Craft Guns fireing, & the noise of Motor Transports, things were \n\nhumming & a sight never to be forgotten. After we pulled our truck out we came back to Camp & after having lunch we took up a Gang of Men to unload the Mine Earth in H.1. & then we came back & finished. On Sunday morning at Daylight Fritz came over on a Bombing raid, & as I was coming down from St Jean, he passed over my Eng, he dropped a Bomb but missed me & it did no harm but just before I arrived at the Camp he dropped a Bomb a few feet from the Blacksmith Shop which made a big hole & then he dropped an Aerial Torpedo which wrecked the Blacksmith Shop & as there were 4 Men sleeping in the shop only one was slightly injured but he killed two horses near the shop & blew one right into the hole the Bomb made. The aerial Torpedo made a hole about 15 ft in Diameter & about 7 ft deep & just \n\nmissed our line by about 10 ft.\n","26":"\n\nBoth Engines left at 8am for St Jean with all the Working parties, where the other one continued on to the end of the line while I went into H1 to place the Mine Earth where required, while the Gang unloaded it, this took us until Dinner time, At 13 oclock we were standing up the Main line, awaiting further instructions & as the weather was cloudy in patches over came 8 large German Gotha Machines, & what a commotion there were, Men were running in all directions for cover & Anti Air Craft & Machine Guns were fireing at them from all directions, they soon seperated but they dropped a lot of Bombs, I could see the Explosion in all directions & men running hear & there, only one came close to the Eng although 3 machines were right overhead & I expected to get hit, as soon as our \n\nMachines came after them they cleared out, & all was quiet again, after a little while several stretcher cases came into the hospital also a lot of Walking Wounded cases, mostly head & arms injuries. I must mention the way we take water for the Eng, we have a large hose which we place in a shell hole close to the line & couple it on to a pipe under the Eng & a small hose on to an apparatus on the Eng & a pipe leading into the Tender, & we then turn on a Wheel, & the Steam causes a Vacumn in the large pipe & the water then \nsypho\n is lifted up & forced into the Tender, it takes about, 40\" to fill a Tender of 2000 gallons, it is good water & causes very little priming & is very clear, we have a truck of coal behind the Tender all day & when we want Coal, we get two of the Gang on to the truck & they throw the coal up on to the tender, while we are working. We \n\nnever want for water as the shell holes are everywhere & are all full, some holes are about 30ft across & 8 to 10ft deep, this is an absolute fact. I had the pleasure of seeing the 12 inch Howitzer “Crackerdoom\" fireing & actually seeing the shell travelling up into the air. You have to be behind or alongside of the gun to see the shell, when the gun goes off, you look up ahead & you will see the shell up in the air like a football & then it becomes as small as a Cricket Ball & finally disappears in the clouds, it is a wonderful sight, seeing a shell weighing \n2 cwt or more\n 750lbs travelling in the Air, & what a height it goes up, they tell me it rises to about 1200 ft before it starts to fall. After placing more \nMate\n stone in Merrytort Siding & bringing out Empties from H1 Siding & putting more Mine Earth in & picked up our trucks & Gang & came back at 17 oclock to camp, & then I stabled my \n\nEng & finished my days work, which was one of excitement & experiences. The men camped near H1.2. & 3 Sidings also at Wiltje, have made dugouts & Bomb proof shelters alongside of our old trenches & they look like a lot of Rabbit burrows all over the place, & no matter where we stop the men come over for bit of coal to keep themselves warm of a night & as they all have my sympathy, I give each one a little to go on with. ","27":"\n \n","28":"\n\nI received orders last night to pack my kit & proceed in the morning to St Jean & work under Lieut Leuvason on the Shtr so after Breakfast this morning I put my Kit & Rugs on a Train at 10.30 am & left straight away, on arrival at Reigersberg I was told by the Station Master to put my things out between his Cabin & Reigersberg Nth as owing to the excessive shelling Fritz was giving the Railway Yards \n\nit was decided to take the Railway Living Vans back from St Jean to M13 at Reigersberg Nth & camp there, so I put my kit out also a stretcher I brought with me & went over to the vans with my Mates & soon was fixed up, after notifying the Lieut of my arrival who was at St Jean I was told to await further instructions, there were only 3 stretchers occupied by our men I soon put mine in also my mate. I brought with me rations for 3 days ending Saturday. After I had Tea orders came down that I was to start at 16 oclock on Friday at St Jean on the Shtr. As we are about 1 mile from St Jean we have to walk to & fro unless our Engines are unable to come down for us to change over or a Train is going up or down, anyhow my Mate & myself walked up at 16 oclock & took over at 16.30, there is not much work for two Engines but they must be there under steam for several reasons one \n\nin particular & that is to remove the big guns up at Wieltje in the Gun spurs if was necessary. Things were fairly quiet & not much work to do until about 19 oclock when the two Engines were standing on No. 4 Road when all of a sudden Fritz started putting shells over near the yard, it was pitch dark at the time, several shells proved to be Duds & others exploded. Fritz had two Guns fireing & 2 shells came over every 2 minutes. I sat down on the Engine & took things calm thinking the shelling might cease at any minute, when all of a sudden a Dud landed just alongside the Eng & I said to my mate, we better clear out of this, so he put on his brake & off I went & he followed a few yds behind, when I got alongside of the other Eng I heard a crash behind me & a flash of fire. I looked back & saw my mate running towards me with his light, & I crouched alongside of the Tender & dirt & pieces of shell \n\nstarted falling all around me, my Mate said as he came up, I was nearly blown over by the concussion but was not hit, we both made for the Dug Out at the station quick & lively about 50 yds off & in we went, The Dug Out is built of Elephant Iron with 3 rows of Sand bags on Top & sand bags about 4 ft in thickness around the Sides & an entrance of 2 ft in width it is about 8 ft high in the centre, when we got inside, what a Sight, there were about 12 lads inside, & every one was quiet & very nervous, I can assure you, I was scared although I did my best to be brave, but my nerves were very shaky. I tried to raise a Song but no chance, so I started cracking jokes to cheer things up a bit, but in the meantime the Shells continued coming over, one exploded near the Dug Out & shook it very much, Fritz was shelling for nearly an hour when he stopped & after things quietened down somewhat, all hands came out & started work, & to see if any of the roads had been \n\nblown up, my Mate & myself went down to our Eng & what a shock I got, the Road No. 3 alongside of my Coal truck behind my Tender was blown up & about 4 ft of Rail was blown clean away, The Truck was riddled with Shell Splinters & my Tender & Eng was covered in dirt & pieces of sleepers. The Tarpaulin covering the Cab & part of the Tender was full of Dirt & a hole about 1 inch wide by 2 inches long was made by a piece of shell & the piece was lying in the Cab, We had both left the Eng just in time as I mentioned before about the Shell exploding behind me leaving the Eng that what it was & we had a narrow escape. The S. Master went along the roads to see if any further damage \nto other\n had been done & came back & reported No 2 at the top end had been also blown up. All incoming Trains were cancelled & we did no more work & at Midnight I was releived & was glad to get back to our Camp as my nerves were very bad & \n\nif any unusual sound occurred I would be all of a tremble, I turned in at 1 am although during my absence, 2 trucks with bunks arrived & had been shunted in the Siding & my mates had transhipped all of our Things into one of the trucks & had put the Stretchers on top of the Roof, what with the evening’s experience & finding my things thrown down anywhere, it was the limit & I could have jumped on the people who ordered to change in the dark instead of letting all change the trucks next day. Anyhow I got a bottom bunk & soon was snug & asleep. \n","29":"\n\nI again signed at 16 oclock & during the evening things were very quiet only now & again a shell would go right over towards Epres. After knocking off at midnight I again signed at 8 am Sunday to change over to day shift. & worked until 16 oclock & things were again quiet, I expected some more rations up from \n\nthe Depot but none came so my Mate went in & made a fuss & brought some out with him & the QM promised more \ntoday\n next day. I forgot to mention that at 23 oclock on Saturday Evening a Train hauling trucks of stone was stuck on the bank outside of St Jean Station & on trying to start about 8 trucks broke away & ran back & stopped between the cutting of the \nCanal\n Yser Canal. The guard was on his way up & did not see the rear lot get away, an Eng from the yard came down & coupled on to the Train Eng & on starting about 12 more trucks broke away & off they went & struck the ones at the Canal, & what a Mess, on coming home at Midnight I had to climb up the Canal Bank to cross over as the trucks were piled one on top of another, I counted 12 smashed up & Traffic was stopped. The Big Crane came up from Borre during the Morning & by 15 oclock they had cleared the line & \n\nthe broken trucks & wheels were stacked in a heap clear, to be cleared away later. \n","30":"\n\nI signed on at 8 oclock & was up & down all the morning & after lunch I had to go over into No 10 Road to clear out all empties & pull on a derailed truck, after getting the truck on & several Empties out Fritz started sending over shrapnel at 15 oclock, the shells bursted over a bit from the Station, he sent them over on a Range Finder, I could here the bullets striking the Iron Huts near by. After he had sent over 3 he gave us a Dud close by & then a High Explosive, I heard the Whizz & on looking out of the Cab, I saw the Explosion about 40 yards away & I stood close into the boiler & the dirt came all over the Eng the lads about soon made themselves scarce, my releif arrived at 16.20 & I got a ride home to camp, & found no rations had arrived & two of my chums\n\nhad gone into the Depot to see about the rations & they came back with bad news that the bread rations are Cut down to 8 men to a loaf instead of Six, things look black for us all & the sooner a settlement is arrived at the better for us all as it is bad enough us doing our bit under shell & bomb fire, than to be half starved as well. \n","31":"\n\nAll day long the aerial work of our planes was very exciting, just before lunch a Fritz Machine came over St Jean for Observation purposes, he was sailing around having things all his own way when out from a Cloud came one of ours & made straight for Fritz. as our Machine was up above him. Fritz turned & made for his own lines, away they went together & we could hear the Machines rattling all of a sudden both were lost in the Clouds for a moment & then out of the Cloud we could see Fritz’s Machine turning turtle, down he\n\ncame tumbling over & over again & finally crashed to the earth about a mile away, & our Machine slowly followed him down at a certain distance & the off again he went looking for more, at about 4 Pm a Fritz came over making for one of the balloons, The both observers jumped clear with their parachutes, all the while Fritz was fireing his Machine Gun at the Balloon but could not destroy it, when one of our Machines tackled him & he turned & made off at full speed, it was wonderful the speed he flew at & he was away in the distance in a moment & there were 3 trains full of working parties waiting to go away to their Camps & I expected Fritz to put his Machine Guns on to the boys, if it was not for our Machine who tackled him & made him clear out he would have done a lot of damage to the troops. After a little delay I got my train of troops away to Reigersberg & I signed off at 4.30 Pm. \n","32":"\n\nDuring the night \n\nFritz was very active with his Guns, he was continually putting shells over also it being Moonlight at 2 am over came a Taube & started dropping Bombs all around St Jean Yard. Our Aerial Torpedo was dropped up at the top of the Yard & struck the Rails between No 1 & 7 & 8 Roads making a hole which was measured by an Officer & it was 35 ft in Diameter & 8 ft deep & several of the Rails were broken & twisted into all shapes I had to bring along 6 trucks of Mine Earth to fill in the hole before the lines could be connected up again. It upset all work for the day up that end of the Yard. \n","33":" \n\nAs there were a Naval Gun in a Siding near our trucks which started fireing on Saturday, Fritz started putting over shells searching for it, he landed a shell right under the Main line about 15 ft from Reigersberg Nth Cabin Blowing up the line but did no damage to the Cabin, another shell exploded near some horses, & one horse \n\nbroke away & cleared out but none was hurt. After dinner at about 2 Pm over came a shell & exploded a few feet away from 296 Company R.E.’s Kitchen & blew it over & wounded the only man slightly who was in the Kitchen, it made a mess of the Kitchen which was built of Wood & Iron. I signed on duty at midnight","34":" shunting in St Jean Yard & during the night things generally were very quiet until about 4.30 am when a heavy Bombardment opened & things did hum for an hour. Flashes \nof lights\n from our Fairy lights & from the Guns lighting up the fireing line, at about 5.30 it all died away. I was standing at Reigersberg Cabin waiting to bank up at Train to St Jean while this bombardment was on & after a while along the Train came & soon I was back up at St Jean. I had nothing to do until 6.30 am when I picked up 2 Trucks & was waiting at the Cabin for line clear. It was just light enough to see about & a working party was \n\ncoming up the bank when all of a sudden the Alarm was sounded that a Taube was close I looked out & up & I could just see a Taube up above the Engine, the Working party scattered in all directions seeking what cover was available, some hid behind the banks of Earth near the line, My Mate & myself crouched down in the Cab up against the firebox, in a moment down came the bombs Crash. Crash all around me. I thought my time had come, I looked out & I saw a Teut & Pole in pieces go up in the Air & then several cries of Help .Help from poor unfortunate Men injured. & shouts of Stretcher Bearers wanted here, about 20 Explosions took place in a space of about 2 minutes, Another Taube followed & he dropped his bombs but did no damage, No damage was done to the Eng or Trucks, & when the Taubes cleared out, I got down & saw two holes near the bank about 12 ft away, so it was close enough for me. We could not see Fritz until he \n","35":"\n\nwas very low as it was very foggy, & it was hard to see them, when I got line clear I came away to Reigersberg Nth & put my two trucks into a Siding & picked up my Troop Train & when it was loaded away I went at 7.15am up to St Jean & put some Men out & further along I went & put out some more, when the alarm again was sounded & up in the Air I could see 5 Taubes hovering about. I did not move my train as it is harder to hit a Standing Train, Men were running for shelter & along the main Road a number of Motor Transports halted, I could hear Bombs exploding away in the Fog. The Taubes soon were hunted away by our Machines & I then proceeded up to Wieltje \nSidi\n Station & detrained the balance of the troops & then came back to St Jean Yard & was releived at 8.15 am & walked back to our Vans & had breakfast & turned in, as I was very tired, being up since 7 am the previous day. \n","36":"\n\nSince Monday things on this front were very quiet, the Weather being very bad, Raining & it being very misty which prevented Fritz from coming over for Observations, This Morning the Weather cleared & it was fine all day hardly a cloud could be seen Fritz was over Observing very early & after Dinner Fritz’s big Guns started & he was sending high Explosives over all the Afternoon first one side of St Jean station Yard then the other, hitting several old deserted Dug Outs, one shell landed amongst a lot of Teuts sending them & kits up in the Air, the Men were all away on duty & nobody was hurt, one of his shells landed just in front of 4 9 Point 2. Guns close to Admiral Road about 200 yds from the Yard, the Guns had been fireing for a while & the shell soon stopped them, at 4 Pm. I was attatched to a Train containing a Working party, waiting for line clear when a Dud landed a few yards away, much to our relief also two Officers on board my Engine, the line was soon clear & off we went to Reigersberg\n\n& got a further surprise as Fritz had been shelling all around our Vans all the Afternoon from another direction several burst close to the Vans covering them with Mud, but no damage was done, a I was going to the Cookhouse for my Tea a “Dud\" landed just behind the House which gave us all a shock, as Darkness came on the shelling ceased, much to our releif. from","37":" until the end of the Month things were very quiet, nothing occurred worth noting. As it was our long shift off on","38":" from 4 Pm until Midnight Monday my mate & myself decided to make a flying trip (or Stunt) to Calais, so on Friday Evening I saw our O.C & asked for a Pass & a Movement Order for Saturday, after finishing at 4 Pm. I went to get the Pass & Order but found that the O.C. had forgotten to make them out & as he had gone into Peselhoek I got our Control Officer to wring him up on the Telephone & I spoke to him & the O.C. told me to see his Motor Car Driver & tell him to drive my Mate & myself into Peselhoek. After a little delay we \n\nboth left at 6 Pm & after passing near Eypres & through Vflamintujghe a very much knocked about village containing troops only & no Civilians we eventually arrived at Peselhoek at 7 Pm & after obtaining the Pass & Order we put the Evening in at the Camp until 11 Pm when we started to go into Poperinghe to get the Train, it was a bright Moon light Night but very cold, we had only proceeded a short distance when along came a Motor Transport & into it we climbed & it took us right to the station arriving there about 11-30 Pm, as the Gates were closed & the train did not leave until 1-35 am, a large number of Soldiers, mostly Jocks were lounging about, some talking together in Groups & others laying down sleeping, as the Y.M.C.A. Hut was open we adjourned there for a Cup of Coffee gratis which was very weak & not sugared, one thing in favour of it, & that is it was hot, we got a Dixie full between us & some biscuits & we passed the time away until 1-20 am when the Gates were opened & the boys went through in Single File \n\nproducing their passes & Orders for Inspection. At 1-30 am the train pulled alongside & about 500 Men soon were entrained, some got into covered Vans but we went back further & obtained a Seat in a Coach, it was very cold & \nfrosty\n blowing we were glad to get seated, but found that the Glass window on each side was broken, two oil sheets were obtained from the boys & tacked up t the Window to keep the Wind out, we left to time & after picking up a few more lads, our compartment was full & when the train started I fell off to sleep & did not wake up until we reached Saint Omer at 3-45 am, after a few minutes stop, off we went again & I dosed off again & did not wake up until Les Fontineuts was reached at 5-40 am the train stopping outside & all the troops detrained, & were marched off to the rest Camp, as we were practically on duty, it was not necessary for us to parade, so off we went towards Calais against at strong Cold Wind, After going a little way we took shelter in a Crossing Keeper’s Cabin to warm ourselves by the \n\nstove, & then off we went through new Calai, as it was after Six a large number of People were walking about we kept going until we went over the Canal when I first met a Military Police & asked him to direct us to where we could obtain Breakfast. After showing him our Pass he directed us & soon we were inside a Restaurant, which was nice & warm, & after obtaining a Wash we sat down at a Table & we both had Fried Eggs & Coffee & Rum, which was very acceptable & after paying 4½ Franc’s off we went to have a look around, we walked up to New Calai & back again when we discovered the Church Army Hut & in we went for a rest & a hot drink of Coffee, I was asked by the Officer there to give him a hand to unload some Cases into a storeroom & after assisting him I came back & stopped there until lunch time when we both went up the street looking for a Café, we came across a likely one & soon was seated inside & ordered steak & Onions & Chip Potatoes for 2¼ Francs \nthe\n each. After having a good lunch we both boarded \n\na Tram for a ride, the Car we was in went out as far as the Cemetery & back again, the fares are very reasonable 1½ each way, the Cars are very small & some have one & two dummy Cars attatched behind, they Electric & are driven by French Women & Girls act as conductors. Every Car is well packed & they ride very smooth, they start from Old Calai & run over the Canal through New Calai, which is a very nice City & up to date, the streets are very wide also the Footpaths, & the buildings are beautiful & the shops on each side are well stocked, as it was Sunday business was carried on as usual in a lot of places, in Old Calai the buildings are old fashioned & the streets & foot paths are very narrow, the Tram line runs alongside of the Footpath, as the day wore on the streets were crowded with Civilians, French & Belgian & a fair sprinkle of \nAusie’s\n Tommies & Ausie’s & N. Zealanders, on their way to Blighty. After having a couple of drinks in a Estaminet \n\nwe went into a Picture show, paying 1 Franc 2d each for a Seat, as the writing on the screen was in French we had to follow the Plot as best we could, there were a good program provided & the Hall was crowded, it was very annoying for us as the \nEstaminet\n Side Bar was open to French & Belgian Soldiers only, who could get a drink & we had to go without, that is one way of treating us Colonial & English Troops after coming all the way from Ausie to treat us like that, we could only get a Drink from 12 to 2 & 6 to 8 Pm, after the show was over at 4.30 we went along for Dinner to the Restaurant where we had breakfast, we could only get the same as we had for Breakfast, that was Fried Eggs & Coffee & Rum, & they wanted to charge us 6 Franc 25 cents, I pointed out to the Waiter the difference as I objected to being taken down, & the proprietor came in & told me it was a mistake at Breakfast, I would not beleive it as a Tommy came out just as we were going in for breakfast & he told us he \n\nwas charged 2¼ Franc’s anyhow I gave them a 5 Franc Note & they had to be satisfied, it was only a dodge on their part & it did not succeed as well as they expected, when we got outside it was pitch dark, we could hardly see our hand before us & arm & arm we went along, picking our way through the darkness dodging Soldiers here & there, we tried another picture show but it was crowded so we decided to pay a visit to the Notorious Garden of Eden, we soon found the place & in we went & found the place crowded with Soldiers of all sorts, sitting at small tables laughing & joking with French girls who only had Silk Gowns on, their attitudes soon disgusted me, but as I often thought I would like to visit a Garden of Eden my wish was gratified, we had a few drinks there & left it at 7 Pm, satisfied of what I saw, we went along then to look for quarters to stop for the Night & after again being directed by a M. Police we soon found a Café called the Evening Star No. 26 \n\nin the Rue de Havre, in we went & made inquiries & was offered a Room with a Double Bed in it, the only room left for 5 Franc including Breakfast each which was very reasonable. We both had a couple more drinks each & being very tired we decided to turn in & have a good sleep, so up we went to the Room, & what a lovely bed there was in the Room, it had 3 Mattresses on it, & my Mate reckoned he was going to stop in it all the next day it was so comfortable, we was soon in Bed & fast asleep & neither moved until we were called at 8 am when we had hot water brought up to us to wash & at 8.30 down we went for Breakfast, both feeling A.1. after our good night’s rest, the French Lady had Breakfast set for us in the Kitchen by a big Stove & it was nice & warm, we had Fried Eggs again & a Pot of Tea, which was the best. Tea we had had for many a long day, we both had 3 Cups each, (small ones) & French Bread & Butter, the Bread I enjoyed a.1. \n\ndifferent altogether to what we get in the Military, it was just like home sitting there & the Lady could speak a little English, after thanking her & paying the damage we bade her Good Day & off we went for a stroll & another Tram ride, we went out in another direction for about 3 or 4 mile & back again & then we had to make a few purchases of Cards & other things & after this was done we went in for Lunch & had a good Meal of Chops & Chips & Eggs & a Bottle of Ale for 6½ Franc’s the two, we then made our way to the Church Army Hut for a while until it was time to leave by the Train at 1-20 Pm, I had to produce the Pass & Movement Order in the Railway Transport Office for Inspection & in on the station we went to board the Train awaiting there, Calai station is fairly large & has 6 Platforms & a large entrance on both sides, the Platforms are only about 1 ft high, & you have to step up into the Carriages, there were about 20 \n\nCoaches on the Train & seemed to be fairly well filled with People & Soldiers, we left at 1-20 sharp & made a good run to Saint Omer were we stopped a few minutes & off again arriving at Hazebruick at 3-45 Pm, we we had to change Trains for Poperinghe, we left there at 4-35 Pm arriving at Poperinghe at 5-45 Pm. On making inquiries at the Railway Control Office I found out that there were a Train leaving for Eypres at 7 Pm so we waited & boarded it & leaving it at the Junction of the Boeseiye & Eypres Line we walked back to our Camp arriving there at 8 Pm after a very pleasant trip which we both thoroughly enjoyed. From","39":" to","40":" things at St Jean were very quiet as the Weather was very Misty & at times the Fog’s were very thick, now & again Fritz would do some shelling evidently searching for our big Guns which were scattered all around the district, On","41":" I was on day shift & the Weather was \n\nfairly\n fair & a thick haze hung all around, at 1 Pm. I was informed that I had to pick up two Vans of Ammunition consisting of 12 inch Shells for the 12\"inch Howitzer (Cracker Doom) which had been moved ahead to St Julien, after placing the 2 Vans in front of the Eng a Mine Earth Train came in so I was put on behind it to assist it up to Wieltje, & in a few moments we were off & on arrival at Wieltje, the Mine Earth was placed in Merrythough Siding & off I went ahead to St Julien, On leaving Wieltje Station we enter a Cutting & alongside was one of Fritz’s Pill Boxes which had to be blown up with Dynamite to make clear for the line, these boxes are about 3 ft thick built with Reinforced Concrete with Rails cemented in on the Top, \nthey\n it had been hit several times but very little damage was done to it, along further is another Pill box about 15 ft square & about 12 ft high as we went along down hill I could see Graves here & there all about the place. \n\n"}}