{"Document Name":{"0":"Diary_0066","1":"Diary_0066","2":"Diary_0066","3":"Diary_0066","4":"Diary_0066","5":"Diary_0066","6":"Diary_0066","7":"Diary_0066","8":"Diary_0066","9":"Diary_0066","10":"Diary_0066","11":"Diary_0066","12":"Diary_0066","13":"Diary_0066","14":"Diary_0066","15":"Diary_0066","16":"Diary_0066","17":"Diary_0066","18":"Diary_0066","19":"Diary_0066","20":"Diary_0066","21":"Diary_0066","22":"Diary_0066","23":"Diary_0066","24":"Diary_0066","25":"Diary_0066","26":"Diary_0066","27":"Diary_0066","28":"Diary_0066","29":"Diary_0066","30":"Diary_0066","31":"Diary_0066","32":"Diary_0066","33":"Diary_0066","34":"Diary_0066","35":"Diary_0066","36":"Diary_0066","37":"Diary_0066","38":"Diary_0066","39":"Diary_0066","40":"Diary_0066","41":"Diary_0066","42":"Diary_0066","43":"Diary_0066","44":"Diary_0066","45":"Diary_0066","46":"Diary_0066","47":"Diary_0066","48":"Diary_0066","49":"Diary_0066","50":"Diary_0066","51":"Diary_0066","52":"Diary_0066","53":"Diary_0066","54":"Diary_0066","55":"Diary_0066","56":"Diary_0066","57":"Diary_0066","58":"Diary_0066","59":"Diary_0066","60":"Diary_0066","61":"Diary_0066","62":"Diary_0066","63":"Diary_0066","64":"Diary_0066","65":"Diary_0066","66":"Diary_0066","67":"Diary_0066","68":"Diary_0066","69":"Diary_0066","70":"Diary_0066","71":"Diary_0066","72":"Diary_0066","73":"Diary_0066","74":"Diary_0066","75":"Diary_0066","76":"Diary_0066","77":"Diary_0066","78":"Diary_0066","79":"Diary_0066","80":"Diary_0066","81":"Diary_0066","82":"Diary_0066","83":"Diary_0066","84":"Diary_0066","85":"Diary_0066","86":"Diary_0066","87":"Diary_0066","88":"Diary_0066","89":"Diary_0066","90":"Diary_0066","91":"Diary_0066","92":"Diary_0066","93":"Diary_0066","94":"Diary_0066","95":"Diary_0066","96":"Diary_0066","97":"Diary_0066","98":"Diary_0066","99":"Diary_0066","100":"Diary_0066","101":"Diary_0066","102":"Diary_0066","103":"Diary_0066","104":"Diary_0066","105":"Diary_0066","106":"Diary_0066","107":"Diary_0066","108":"Diary_0066","109":"Diary_0066","110":"Diary_0066","111":"Diary_0066","112":"Diary_0066","113":"Diary_0066","114":"Diary_0066","115":"Diary_0066","116":"Diary_0066","117":"Diary_0066","118":"Diary_0066","119":"Diary_0066","120":"Diary_0066","121":"Diary_0066","122":"Diary_0066","123":"Diary_0066","124":"Diary_0066","125":"Diary_0066","126":"Diary_0066","127":"Diary_0066","128":"Diary_0066","129":"Diary_0066","130":"Diary_0066","131":"Diary_0066","132":"Diary_0066","133":"Diary_0066","134":"Diary_0066","135":"Diary_0066","136":"Diary_0066","137":"Diary_0066","138":"Diary_0066","139":"Diary_0066","140":"Diary_0066","141":"Diary_0066","142":"Diary_0066","143":"Diary_0066","144":"Diary_0066","145":"Diary_0066","146":"Diary_0066","147":"Diary_0066","148":"Diary_0066","149":"Diary_0066","150":"Diary_0066","151":"Diary_0066","152":"Diary_0066","153":"Diary_0066","154":"Diary_0066","155":"Diary_0066","156":"Diary_0066","157":"Diary_0066","158":"Diary_0066","159":"Diary_0066","160":"Diary_0066","161":"Diary_0066","162":"Diary_0066","163":"Diary_0066","164":"Diary_0066","165":"Diary_0066","166":"Diary_0066","167":"Diary_0066","168":"Diary_0066","169":"Diary_0066","170":"Diary_0066","171":"Diary_0066","172":"Diary_0066","173":"Diary_0066","174":"Diary_0066","175":"Diary_0066"},"Date":{"0":"unknown","1":1719.0,"2":1720.0,"3":1723.0,"4":1724.0,"5":1725.0,"6":1726.0,"7":1727.0,"8":1728.0,"9":1729.0,"10":1730.0,"11":1731.0,"12":1732.0,"13":1733.0,"14":1734.0,"15":1735.0,"16":1736.0,"17":1737.0,"18":1738.0,"19":1739.0,"20":1740.0,"21":1741.0,"22":1742.0,"23":1743.0,"24":1744.0,"25":1745.0,"26":1746.0,"27":1747.0,"28":1748.0,"29":1749.0,"30":1750.0,"31":1751.0,"32":1752.0,"33":1753.0,"34":1754.0,"35":1755.0,"36":1756.0,"37":1757.0,"38":1760.0,"39":1761.0,"40":1762.0,"41":1763.0,"42":1764.0,"43":1765.0,"44":1766.0,"45":1767.0,"46":1768.0,"47":1769.0,"48":1770.0,"49":1771.0,"50":1772.0,"51":1773.0,"52":1774.0,"53":1775.0,"54":1776.0,"55":1777.0,"56":1778.0,"57":1779.0,"58":1791.0,"59":1792.0,"60":1793.0,"61":1794.0,"62":1795.0,"63":1796.0,"64":1797.0,"65":1799.0,"66":1800.0,"67":1801.0,"68":1802.0,"69":1803.0,"70":1804.0,"71":1805.0,"72":1806.0,"73":1807.0,"74":1808.0,"75":1809.0,"76":1810.0,"77":1811.0,"78":1812.0,"79":1813.0,"80":1814.0,"81":1815.0,"82":1816.0,"83":1817.0,"84":1818.0,"85":1819.0,"86":1820.0,"87":1821.0,"88":1822.0,"89":1823.0,"90":1824.0,"91":1825.0,"92":1826.0,"93":1827.0,"94":1828.0,"95":1829.0,"96":1830.0,"97":1831.0,"98":1832.0,"99":1833.0,"100":1834.0,"101":1835.0,"102":1836.0,"103":1837.0,"104":1838.0,"105":1839.0,"106":1840.0,"107":1841.0,"108":1842.0,"109":1843.0,"110":1844.0,"111":1845.0,"112":1846.0,"113":1847.0,"114":1848.0,"115":1849.0,"116":1850.0,"117":1851.0,"118":1852.0,"119":1853.0,"120":1854.0,"121":1855.0,"122":1856.0,"123":1857.0,"124":1858.0,"125":1859.0,"126":1860.0,"127":1861.0,"128":1862.0,"129":1863.0,"130":1864.0,"131":1865.0,"132":1866.0,"133":1867.0,"134":1868.0,"135":1869.0,"136":1870.0,"137":1871.0,"138":1872.0,"139":1873.0,"140":1874.0,"141":1875.0,"142":1876.0,"143":1877.0,"144":1878.0,"145":1879.0,"146":1880.0,"147":1881.0,"148":1882.0,"149":1883.0,"150":1884.0,"151":1885.0,"152":1886.0,"153":1887.0,"154":1888.0,"155":1889.0,"156":1890.0,"157":1891.0,"158":1892.0,"159":1893.0,"160":1894.0,"161":1895.0,"162":1896.0,"163":1897.0,"164":1898.0,"165":1899.0,"166":1900.0,"167":1901.0,"168":1902.0,"169":1903.0,"170":1904.0,"171":1905.0,"172":1906.0,"173":1907.0,"174":1908.0,"175":1909.0},"Entry":{"0":"\n\n","1":" \n1918\n\nTHUR\nAt Vaire (Somme). Enemy bombing planes busy through the night. Prisoners now total 40,000 & 900 guns. We are to move up to Sailly-le-Sec, on left bank of the Somme this afternoon. Enemy attacked 17th Eng Div (who relieved us in the line at Jean Wood) with cloud gas. Many casualties. At 4 PM We moved over the river & up to Sailly-le-Sec. Our Bde now in support to Liason Div. This village a complete wreck from shellfire & bombs.\n\nFRID 16th\nEnemy bombing over camps through night. Weather fine. Hun artillery very active\n\nAugust \n1918\n\nSAT 17th\n.\nAt Sailly-le-Sec. 34th Batt in line. Enemy reported to be retiring on part of front north of Albert. Good deal of artillery fire on both sides. Raining.\n\nSUN 18th.\nAt Sailly, our quarters in the cellar of a wrecked house. At 3 PM we received orders to relieve our 13th. Bde (4th Div) in the Chipilly sector, in front of us on left of Somme. At 7 PM we moved up to Chipilly, this was the scene of very heavy fighting on Aug 8th 9th & 10th in which Aust, U.S.A. & Eng troops took part. Town a total wreck, was captured by our men on","2":"\n","3":"\n.\nOur Bde holding the line in the Chipilly sector, between the Somme & Ancre. Weather fine. Enemy shelling us heavily day & night. French & Canadians still advancing between Chaulnes & Roye on our right, where the fighting has been severe. On duty all night.\n\nTUES 29th\n.\nHolding line in Chipilly sector. Enemy guns very active & our guns are retaliating. A mate & I are camped in a German dug-out at rear of the remains of the church. Built a barricade in front as the entrance faces the German lines &\n\nAugust\n\n1918\n","4":"\nA 5.9 may drop onto us. Canadians & French still advancing at Roye.\n","5":"\nMoved up the \"Valley of Death\" (so called from the number of men killed in it) to a post near Mallard Wood. Enemy constantly shelling this valley & wood. Weather fine. Good news from the South where the French have taken 10000 prisoners, & also from the North on the Arras front.\nWe are to attack again tomorrow at daybreak & attack will extend North to Arras. Our Bde forms the pivot on which line will swing\n\nAugust1918\n","6":"\nAt 4.20 AM. the attack opens. Our artillery puts on a very heavy barrage under cover of which our 33rd & 35th Batts attack. All along the front the guns are thundering, the enemy retaliating heavily with his guns. At 6 AM I send a message through from 33rd to Bde that all going OK & good progress being made, up till that time 200 men 13 officers (including a Reg't Commander & staff) taken prisoners.\nEnemy fighting hard in places. At 8 PM 35th Batt report all objectives gained. Our losses fairly heavy. At 6 AM\n\nAugust1918\n\nTHUR 22nd\n11th Bde move up to support our Bde & suffer rather severely from shellfire in doing so. Several enemy I.Bs up on our front & these direct the fire of the German guns. Prisoners (who are Wurtemburgers) say that our barrage was terrific.\nGood deal of fighting in the air. At 8.15 A.M. 20 Hun planes came over flying very low & for half an hour used their M.G.s on our posts, batteries & supports.\nEnglish Div on our left report good progress. Throughout the day the enemy has shelled us\n\nAugust1918\nTHUR 22nd\n\nheavily, concentrating his guns on the roads, woods etc. Prisoners taken by our Bde now total 500 & the enemy has lost very heavily in killed & wounded. At 4 P.M. enemy counterattacked heavily but beaten off with heavy loss.\nEng troops on our left forced to fall back & our flank exposed. Position critical for a time. 35th Batt swing round & form a defensive flank & catch the Huns advancing in close formation on to the Eng troops inflicting very heavy losses & forcing them\n\nAugust1918\n\nTHUR 22nd\n\nto retire. At one period of the fighting our 33rd Batt were surrounded by the enemy, but fought their way out. Situation safe at nightfall.\nOur men had surrounded the town of Bray but had to fall back owing to the failure of the Eng Div on our left. Our old Sig-Officer, Lieut Carson (late 36th) Killed in todays fighting.\n\nFRID 23rd\nHolding the line we advanced to yesterday. At 4 AM our 1st, 4th Div's in conjunction with the Canadians & French on our right attacked on a wide front on the south side of\n\nAugust1918\n\nFRID 23rd\nthe Somme. Up till 9 A.M. our 1st Div has taken 36 officers & 1100 men prisoner. Good news from the North of us in yesterdays attack. All day our guns have pounded the enemy who is reported to be massing troops for an attack on our sector. Our advanced signal station is on a hill beyond Mallard Wood, which reeks with the smell of gas, dead men & mules & horses, & which is under constant & heavy fire from enemy guns. Today I have had four trips through the wood back to\n\nAugust1918\n\nFRID 23rd\n\nour Brigade Hdqrs , for water & rations, with a dispatch from Batt when our lines were cut by shell fire, repairing the line, & to bring up more telephone wire. Two of my mates wounded by shellfire while we were going through the wood & several close calls myself.\nAttack now general from Arras to Soissons & all going well. At 1 PM. prisoners taken by our 1st Div total 47 officers & 1300 men & the guns taken include a 15\" .\nAt night 10th Bde relieve us & we move back to Sailly-le-Sec.\n\nAugust1918\n","7":"\n\nOur Bde in support at Sailly-le-Sec. Bray taken by 10th Bde this morning. Very heavy artillery fire all night & enemy being hammered all along the line.\nHad the first wash for 3 days. Aust Corps prisoners since 8 A.M. yesterday morning total 78 officers 2783 men & many guns. Today 2 French women (former residents of the village) returned in search of a tin of money which they had hidden in their home when fleeing from the approaching Germans in March last. After\n\nAugust1918\n","8":"\nth\na long search in the ruins of their home (the whole village had been destroyed by the German guns & bombs) in which we assisted the money was found intact & two very happpy French women thanked us & made us accept some of the money (refused) before saying good-bye.\n\nSUN 25th\nAt 12.30 AM we moved up to Chipilly in close support of our 10th & 11th Bdes who attack at 2 AM.\nThe signal for our guns to open is given by a battery of our 9.2 howitzers near us,\n\nAugust1918\n","9":"\n\n& the whole of our guns open fire. The attack is a complete success & the enemy pushed back 6 K, many prisoners taken. Bapaume taken by the New Zealanders & Hindenburg Line reached near Bullecourt.\nEnemy reported to be retreating on the whole front. Batches of prisoners coming in all day.\n","10":"\nAt Mallard Wood. Advance continues all along the line North of us. All day long guns, transport etc moving up. Every road packed. Very heavy storm through night. One of our O.Bsbrought down in\n\nAugust1918\n\nMON 26th\n (contd)\nin flames by a Bosch plane.\nPrisoners still coming in. Bailleul recaptured by our troops in the North.\n","11":"\nAt 4-20 a.m. we attacked again in front of Bray & at 9 a.m. all going OK.\nAt 2 P.M. we moved our Sig Station up to a position beyond Bray. Raining, on duty all night. Roye captured by the French.\n\nWED 28th\nAt 4-55 AM. our Bde again attacked under a heavy barrage & gained all objectives after some stiff fighting.\nMany prisoners & M.Gs taken. English troops attacking on our left, held up for some\n","12":"\nth\n \n10th & 11th Bdes continued the attack overour men & enemy pushed further back. Raining & cold. Our Brigade strength tonight 750 bayonets.\n","13":"\n\nAgain this morning our Bde attacked & drove enemy back. Eng troops on our left had some hand fighting, News good from all along the front. Rain cleared off. At 1-30 pm we again move forward. Everybody beginning to feel the strain of the constant fighting.\n\nFRI 30th\nStill pressing the enemy hard, many prisoners & great quantities of stores etc captured. On our right our other Aust Divs\n","14":"\nth\n cont\nmaking good progress & we are now nearing Peronne where we expect the enemy to make a stand. He is fighting more stubbornly now. At 9 A.M. enemy counterattacked with strong forces & beaten off with heavy loss.\nMany prisoners coming in.\nEnemy bombers busy at night.\n","15":"\nMoved forward to Hem a big enemy dump & railway junction of the enemys, captured by our men. 33rd Batt attacked this morning with 183 men, the total strength of the Batt, taking all objectives, 436 prisoners, many M Guns & 1 field gun.\n\nAugust1918\n\nSAT 31st\ncont\nEnemy shelling us heavily. One H.E. shell missed me by a few inches, bursting a few yards in front ofme & exploding a stack of German gas shells.\nWe now have Peronne pretty well surrounded.\n\nSUN SEPT 1st\nStill pushing on, our post now at Curlu, a battered village on the left of the Somme. At 4.20 AM 11th Bde attacked & gained all objectives. Enemy fought hard & lost very heavily. Amongst the prisoners taken today are a number of the Prussian Guard, who say that they volunteered to come up into this part of the line from the Verdun front, to stop\n\nAugust\n ","16":" cont\nAustralians. They are wise men now & I think all the fight knocked out of them from their appearance. We are now nearing the Hindenburg line & on the old battlefields of 1916 whereheavy fighting took place. The country is much cut up by shell fire & is a network of barbed wire and broken trenches.\nOur men have attacked & captured Mt St Quentin overlooking Peronne, & the highest point for many miles around. It was a natural fortress & should have cost us very dearly.\nWe attacked from two\n\nSeptember 1918\n\nsides & in front & though the enemy fought hard in places our success was complete & our losses comparatively light. Prisoners in this operation total 1500 with hundreds of Machine guns. Through the day the enemy has counterattacked heavily several times without success & suffering severely incasualities. Peronne is now ours. Since 8 am wounded & prisoners have been coming in in big batches. Our casualties have been fairly heavy today. At sundown we buried some of our lads who were killed in yesterdays fighting. They were laid to rest alongside\n\nSeptember 1918\n\nSUN 1st contd\nmany French soldiers Killed in the 1916 fighting on these battlefields.\nThe Aust Corps has now been fighting without a break since","17":" & we are looking forward to a spell & badly need reinforcements.\nThe 51st (Highland) Div has relieved the Eng Div on our left & we are pleased to have the Scottish troops fighting with us again.\n\nMON 2nd\nHolding the line on left of Peronne. Weather cold & showery.\nThrough night enemy bombing planes busy over our lines. 51st Div\n\nSeptember1918\n\nMON 2nd\nattacked on our left this morning & all going OK, gained all objectives after stiff fighting. In the North our troops have recaptured Steenwerck, Mt Kemmel & other places. Enemy artillery very active on our front. Received a mail from home.\n\nWED\n","18":"\n.\nOur Bde now in close support to 10th. Artillery fire heavy & continuous on both sides. Everything going well all along front.\n","19":"\nAt Curlu. Enemy planes bombed us heavily through the night. At midnight he sent cloud gas over our lines.\n\nSeptember1918\n\nWED 4th\nAll along the front he is being hard pressed by our troops.\nBritish captures on this front during August. Total:- 57000 prisoners, 650 guns, 5.600 M.Gs, 1100 Trench Mortars, great quantities of munitions, stores etc, many towns & villages & hundreds of square miles of country. A big share of this is due to the Australian Corps.\n\nTHUR 5th\nOur Brigade in support at Curlu. On duty 8 am. to 12,8 pm. to midnight. Message intercepted from enemy today, states that it is their intention to retire on a big part of the front, probably to Hindenburg line\n","20":"\nOur troops are keeping up the attacks all along the line. Enemy burning & destroying all villagesas he retires. At night the sky is lit up in many directions with these fires. Orders issued by Gen Rawlinson (Comm 4th Army) to Aust Corps thanking the troops & congratulating us on our great victory on Aug 8th & following days. Heavy storms in afternoon.\n\nFRI 6th\nOur troops are now 7 miles beyond Peronne & all going well, enemy being forced back all along the line. French pressing on towards St\n","21":"1918\nQuentin. Trains now running up to Bray, though the enemy had blown up the line at short intervals as they were forced back.\n","22":"\nAt Curlu. Enemy now fighting very stubbornly. 11th Bde attacked this morning & gained all objectives. We are now within 3 miles of the Hindenburg Line.\n","23":"\nAt Curlu. Raining. 1st Div to attack over our men today. Attack successful.\n\nMON 9th\nAt Curlu. In support to 1st Div, who have now relieved our Div in line. Advance continues all along line.\n","24":"1918\n","25":" \nBrigade resting at Curlu. Heavy rain fell all through night. Heavy artillery fire from both sides.\n","26":"\nAt Curlu. Bde resting. Raining & cold. Things going OK along front.\nMate & I have built ourselves comfortable little dugout in a bank.\n\nTHUR 12th\nMarched from Curlu at 11 AM to Mt St Quentin. Roads very boggy. This hill commands the country for many miles round.\nPeronne lies in the river valley below. Peronne, once a fine town, now a mass of ruins\n","27":"\nThe French troops are now within 3 K of St. Quentin, which lies on our left front.\n","28":"\nAt Mont St Quentin. Heavy rain day & night. The ruins of the village of same name are on the hill near us. All around are signs of the 1916 fighting, old trenches, broken wire etc, & on top of it all the signs of the recent hard fighting.\nPeronne has been mined by the Huns, who have set all kinds of ingenious traps to catch our men.\nTwo days ago a burial party of our men came across the body of a\n\nSept1918\n\nFRID 13th\nGerman on a stretcher. On picking up the stretcher to bury the Hun, a mine that hadbeen set under it exploded Killing 4 of the men. We are at present in reserve to our 1st Div, who attacked again this morning on the left of St Quentin & drove enemy out of what had beenthe old British front line & are now in touch with the outposts of the Hindenburg Line.\nFrom 10 pm several enemy bombing planes over our lines & camps. Picked up by our searchlights & engaged by AA guns & M.Gs.\n\nSept1918\n\nFRID 13th\nAt 11.30 pm a big Gotha bombing plane picked up by our SLs over our camp & engaged by one of our scouts. All the lads out to watch the fight, both machines could be plainly seen in the searchlights, the big Gotha diving & turning in endeavours to get out of the light. The little scout machine following & using its M.G.. After a few minutes the Gotha burst into flames & dived to earth, its load of bombs exploding when it struck, blowing plane & crew to atoms. For miles round\n\nSept1918\n\nFRID 13th\n& along the line you could hear the Diggers cheering. 20 minutes later another one was brought down near us in the same way. Towards morning rain set in. Rain or clouds means no worry from the bombers so we sleep easy until daylight.\n","29":"\nAt Mont St Quentin today 6 Huns were rooted out of a cellar in Peronne, where they had been hiding since we captured the town. Rain cleared off.\n","30":"\nToday we were inoculated against typhoid (this is done\n\nSept1918\n\nSUN 15th\n (contd)\nabout every 6 months) & will mean a bad arm for a day or two.\n3 of our Observation Baloonsbrought down in flames on our front today by enemy planes. Received welcome pcl, tobacco, cigarettes etc from Comforts Fund. Enemy bombers busythrough the night. One brought down by our planes.\nTrains now running to Doignt beyond Peronne. 800 Anzacs leave today on 6 months furlough to Australia.\n","31":"\n\nAt Mont St Quentin. Showery. Things going well along front. Enemy bombers again busy through night.\n\nTUES 17th\nAt Mont St Quentin, very heavy storm through night took the roof off our hut & we were drenched.\nToday fine & clear. Preparing for our next attack, which will probably be to try & break the Hindenburg Line.\nPrisoners taken by the Yanks & French in the St Mihiel Salient (south) now number 20000, 200 guns & large quantities stores etc.\n\n\n\nSept1918\n\nTUES 17th\nInformation received from prisoners that Mt St Quentin & Peronne are heavily mined. This afternoon we played 24th Batt cricket & won by an innings & 13 runs.\nLess than 3 weeks ago Fritz was holding this place & the match was played on the same ground thatwe fought over on Sunday 1st Sept. We prepared a pitch & filled in the shell holes to level the ground. At mid-off ten yards from the wicket the tail of a Fritz aeroplane bomb\n","32":"\n \nsticks up out of the ground (the body of the bomb, unexploded is buried in the soil) & we give it a wide berth when fielding about that spot.\n\nWED 18th\nRain fell all through the night. Our 1st & 4th Divs to attack this morning & from daybreak our artillery has hammered the German lines. Good news from the south, where French are advancing at many points. One of our OBs brought down in flames in aft by enemy.\nOur men took all\n","33":"\n \nobjectives in this mornings attack & at midday the prisoners totalled 130 officers 2930 men 23 guns & many M guns.\nEnemy fought hard in places & lost very heavily. In the evening I visited our Casualty Clearing Station.\nHundreds of wounded coming in. Australians, Scots, English & German. This attack was on a three army front, the British on our left & French on our right & was everywhere successful.\n\nSept1918\n","34":"\nAt Mont St Quentin. Total prisoners in yesterdays attack now number over 6000 of which our men took over 3000. At 11 PM last night our men again attacked outposts of the Hindenburg Line taking 14 Officers & 350 men prisoner. This afternoon we played 35th Batt at cricket & won by 10 W.\n\nFrid. 20th\n*SAT 21st\nAt Mont St Quentin. Weather fine. Good news from Palestine where our troops have made big advance.\nPlayed 9th T.M. Battery cricket in aft & won by an innings & 30 runs.\nEnglish troops on our\n","35":"\n cont\n*SAT 21st\n\nattacked outposts of Hindenburg Line this morning . Heavy fighting.\n\n*SUN 22nd\nAt Mont St Quentin.\nWeather fine. Further good news from Palestine where Allenbys troops have surrounded Turkish Army.\n\n*FRID 20th\nAt Mont St. Quentin. Weather showery. Things quiet on our front. Prisoners in Wed attack now total 10,000, 60 guns, hundreds of M.Gs & Trench Mortars.\nThis week the Huns have made a separate peace offer to Belgium which was refused.\nReceived a mail from home.\n\nSept 1918\n\nFRID 20th\nEnemy counter-attacked on British on our left & recaptured some posts, but were driven out again later in the day.\n\nMON 23rd\nAt Mt St Quentin.\n4th Div relieved by troops of 5th Army. 12 K march in morning. Rumoured that our Div with 2nd & 5th AustDiv & U.S.A. troops are to attack the Hindenburg Line in a few days.\nPlayed 33rd Batt in aft & won by 30 runs.\n\nSept1918\n\nTUES 24th\nAt Mont St. Q\nAt\nWeather showery.\nOur 1st Div relieved by U.S.A. troops.\nBig attack on Salonika front by British, French & Serbians very successful. Prisoners in Palestine operations now number over 25000 & 150 guns.\nPlayed 9th T.M. Battery in afternoon & won by 30 runs. British on our left attacked this morning & took 300 prs.\n\nWED 25th\nAt Mt. St. Quentin. Raining in morning.\nPlayed 9th F.C. Engineers in aft & won by 2 runs.\n\nSept1918\n\nTHUR 26th\nAt Mont St. Q.\nRoute march in morning. Weather fine & clear.\nPlayed 9th F Ambulance in aft & won by 32 runs. This is our 7th successive win. Yesterday morning British attacked on left of St Quentin & took 1300 prs. Very heavy artillery fire through night.\n","36":"\n\nAt Mont St. Q.\nReceived orders to move up into line at dark. Orders cancelled at 2 pm. We are now on the eve of the biggest attack of the war. French & U.S.A. attacking with 100 Divs between Rheims & Verdun & up till last night\n\nSept1918\n\nFRID 27th\n cont\n10,000 prs, many guns taken & enemy pushed back many Kilometres.\n1st Army attacking in conjunction with the Belgians in the North. 2nd, 3rd &","37":" Aust Divs to attack Hindenburg line on this part of the front in a day or two.\n","38":"\nAt 9 AM we began our march to the front line, 12 miles &form our Bde Hdqrs near Villers Faucon at 1 PM,our attack begins to-morrow morning. We have dumped all gear & equipment not absolutely necessary including greatcoat & blanket &\n","39":"1918\n\nSAT 28th\n \ncarry only a water proof sheet, 24 hrs rations, ammunition etc., as we expect forced marches if attack successful.\nWe are bivouaced close to the front line, at present held by the","40":" & 33rd U.S.A. Divs.\nAt 6 AM tomorrow the American Divs attack, their objectives being about 3000 yds from the line at present held by them. This will bring them close up to the main Hindenburg line. We then attack over them our object being to try & break through this line, which along this sector is supposed\n\nSept1918\n","41":" cont\nto be more strongly fortified & held than on any part of the front. All night long our guns, light, medium & heavy have pounded the Hun lines. U.S.A. & French troops continue attack in the south, advancing their line & taking several thousand prisoners & many guns.\nNews still good from Palestine and Salonica fronts. Yesterday morning U.S.A. troops advanced the line on portion of our front, taking several hundred prisoners & giving us a good line to commence the big attack from tomorrow, We are pleased to have the\n\nSept1918\n\nSAT 28th\n \nYanks in with us in this attack & they too are very pleased to be fighting with the Diggers.\nOn duty all night with a mate on visual signal station. Many enemy planes over our lines bombing through night. The sector we attack on lies north of St Quentin, opposite Le Catelet & includes the famous Hindenburg Tunnel which runs along the main line of German defences for some miles, & which we expect the Hun to fight hard for.\nHowever we feel confident & thats half the battle.\n\nSept1918\n\nSUN 29th\nFrom 4 AM our artillery on the left of us have been pounding Fritz. At 5.50 (Zero) our own artillery opens & attack begins. The morning broke clear, but at 6 AM when our Bdes move up to the line from which the U.S.A. Divs are attacking the air is filled with smoke & dust from the guns. All of our Observation baloonsare up behind us, & a great many of our planes are taking part in the attack.\nEnemy is shelling us heavily & the M.Gs are rattling ahead of us.\nAt 7 AM the Huns sent\n\nSept1918\n\nSUN 29th\n \nover a heavy smoke barrage which has drifted over our lines & caused a lot of trouble. At 8 AM the Yanks had reached their objectives, but owing to the smoke barrage they lost touch with different units, leaving many strong M Gun positions untouched behind them & which the Huns reorganised, inflicting very heavy casualties on the Yanks. These strong points held up our men for a time until reduced. 600 Americans are believed to have been cut off & their fate is at present unknown.\nThe Americans have lost\n","42":"cont\n.\nvery heavily, the 107th Regt (New York) has been practically wiped out & the others have all suffered seriously. Our men have carried on the attack, the fighting is heavy, the Huns fighting with desperation. A great many tanks are taking part in the attack & getting a bad time. Some are knocked out by the enemy's guns & many are blown up by mines set amongst the balls of wire.\nA mate & I work a visual signal station from one of the knocked tanks, keeping communication up between our Batts\n\nSept1918\n\nSUN 29th\n contd\n& Bde Hdqrs.\nEnemy shelling us very heavily & several times we have had to dive beneath the old Tank for cover. Several shells have just missed it & we were much relieved when towards evening his artillery fire eased down.\nRain has been falling since midday. For several hours today the position was critical but after hard fighting our men have got on to the main line of defences & the fighting proceeds.\nEnemy sending a lot of gas shells over all day.\nRoy Murphy (my old pal of 36th) killed by a\n\nSept 1918\n\nSUN29th\n Cont'd\nmachine gun bullet from a German plane that came low over our lines at 10 AM this morning. This plane was brought down by our M.Guns shortly after. Our losses have been severe but the enemy's have been heavier.\nThe village of Bony has fallen to our men & they are now fighting along the Tunnel.\nAll going OK with our 5th Div. who attacked on our right. Our captures of prisoners not yet totalled up but heavy. Good news from other parts of front.\nIn the North Paaschendaal has been retaken by the\n\n\n\nSept1918\n\nSUN 29th contd\n\nFrench & Belgians. Our troops within one mile of Cambrai. Americans & French take a further 12000 pr & 250 guns in the south. 3rd British Army have taken 10000 prs & 260 guns in the attack from Cambrai north.\n\nMON 30th\nOur attack continues. On visual signal stn. From 4 AM all our lines have been dis from enemy shell fire but we keep communication up with batts by Lucas Lamp. The village of Bony has been taken this morning & our boys\n","43":"\nare now over the canal & attacking Le Catelet,enemy fighting stubbornly.\nReceived news of Bulgarians surrender, & good news from other parts of front.\n\nTUESOCT1st\nAttack continues. 2 of our Observation baloons brought down in flames by enemy plane. All hands feeling done up. Have had no sleep nor a wash for 3 days.\nCambrai captured. Our artillery giving the Huns no rest.\nAt 6 PM sent up to 34th Bn (arriving to\n","44":"\n","45":"\ncasualties in their signallers) to work communications with Bde Hdqrs. On duty all night, our stn in a shallow trench on the Hind Line. Enemy long range guns active.\n","46":"\nWith 34th Bn on the Hindenburg Line. Everything going OK on our front. Our own (3rd) & 5th Divs flanked by Corps Comm (Gen Monash) for our work in this attack, which, in an order just issued to the troops, he describes as the greatest feat of arms performed by Australian\n\nOct 1918\n\nWED2nd\n cont'd\non the war. Reported that Metz has fallen to French & U.S.A. troops.\nOur Division relieved byan Eng. Div.at night & we move back 5K to near Epehy. St Quentin captured by the French on our right today. Enjoyed a well earned sleep & a wash.\n\nTHUR 3rd\nAt 11 AM we marched to St Pierre Farm through Liramont . Damascus reported captured by our men. Very heavy artillery fire along front through night. Belgians take Dixmude\n\n\n","47":"\n& 4000 prisoners. Our cavalry through on our front today.\n\nFRID 4th\nAt St Pierre Farm. 7 K north of Peronne. Rumoured that we are to go out for a spell at last & it is badly needed. Enemy being driven back all along the front from the North Sea toMetz. Many thousands of prisoners & hundreds of guns taken.\nOur cavalry now through at Le Catelet & further north.\nArmentieres, Lens & the other towns in the\n\nOct1918\n\nFRID 4th\nNorth now in our hands again.\nReported surrender of Turkey.\n\nSAT 5th\nAt St Pierre Farm. The following are the total prisoners taken by the Allies since July 1st.\nIn France 254.000\nIn Palestine 71,000\nIn Macedonia 22,000.\nHeavy fighting all along line. 2nd Aus Div doing finely, capturing Le Catelet & several other villages on Oct 2nd & 3rd.\nCapt Doig, one of the old 36th officers was killed in the fighting\n","48":"1918\n","49":"\non Sept 30th.At 3 PM we entrained on light railway for Peronne & at 10 PM entrained for Airaines, (25 men to a truck) via Bray, Villers Bret & Amiens arriving at 5 AM on","50":"\n\nSUN 6th\nMarched 12 K to Chateau Yonville. This is our Bde Hdqrs & is about 16 K south of Abbeville. Batts billeted in villages in this area.\n33rd in Citerne\n34th in Frucourt\n35th in Merrelesart \nGermany & Austria ask for an armistice\n\nOct1918\n\nSUN 6th\nto discuss terms of peace. Very fine country in this part, & a treat to see the homes not battered by shell fire. People treat us very kindly.\n","51":"\nAt Chateau Yonville. Weather showery.\nOur troops continue to advance all along front. Everything now seems strangely quiet here, after the noise of the guns etc in the line.\n","52":"\nAt Yonville. Walked to Merrelesart in aft to see pals in the 35th Batt.\n\nOct1918\n","53":"\nAt Yonville.\nRaining. To go on leave within 3 days. Walked to Neuville-au-Bois, a village near us in the evening.\n","54":"\nAt Yonville.\nTo go on leave tomorrow.\n","55":"\nLeft Yonville at 7 AM with \"Bluey\" Gregg, walked to Abbeville 16 K. Caught train at midday, through Etaples to Bolougne arrived 3 PM. Put up in rest hut for night.\n","56":"\nLeft Boulogne 11-40 AM, arrived at Folkstone 1 PM. Caught a train at 3 PM & arrived Victoria St, London 6 PM. Marched to Horseferry Rd, drew pay & clothes & slept at War Chest Club.\n","57":" 13h to","58":"\nIn London.\n","59":"\nReported at Victoria Stn 6 AM. Train 7.30 AM to Dover, arriving 11 AM. On boat 1-30 PM for Boulogne, arrived 5-30 PM. Marched to our Blanket Hill Camp.\n","60":"\nAt Yonvnille\nReveille 4 AM. Marched to train. Left Boulogne at 7 AM. arr Longpry 12-30 PM & walked to Yonville 12K. arrived 5 PM.All going OK on front.\n\nMON","61":"\nAt Chateau Yonville.\n\nTUES","62":" \nAt Chateau Yonville.\n\nWED","63":" \nAt Chateau Yonville.\n\nTHURS 31st \nAt Chateau Yonville.\nTurkeysurrenders. Our quarters here are in the loft of a stable, but we are dry & fairly comfortable.\n\nFRIDNOV1\nAt Chateau Yonville. Good news from our front. Reported that Austrian Army wants\n\nNov1918\n\nFRID 1st\n cont\nPeace, & that a revolution has begun in Austria. Allied fleet sails for Constantinople.\nDuring past 8 days Italians have taken 50,000 prisoners. Total captures by Allies fron July 15th to","64":" on this front\n254,000 prs\n3669 guns\nCaptured by British in Aug & Sept\n123,000 prs\n1,400 guns\nWatched Div boxing tournament in aft Held out in open field.\n\n\n","65":"\nAt Yonville. Great attack on Italian front. Austrians retiring in disorder. Enemy hard pressed all along this front.\n","66":"\nValenciennes captured by our troops. Belgrade taken by the Serbians. Austria asking for an armistice.\nAmerican & French troops clear the Argonne, taking many trousands of prisoners. We have been warned to be in readiness to go into the fighting line again in a few days.This applies to the whole Aust Corps.\n","67":"\n\nMON4th\nAt Chateau Yonville.\nOn Signal work until noon. Football Bde V T.M. in aft.","68":"\nArmistise signed with Austria-Hungary to take effect from 3 PM today. Germany now fighting on her own. Abdication of the Kaiser expected daily.\n\nTUES5th\nAt Yonville. Raining\n\nWED","69":"\nAt Yonville. Still raining. attacks continue all along this front & enemy reported to be retiring on a front of 70M.\n\n\n\n1918\n","70":"\nAt Yonville. Rain falling. Went through gas test at Citerne in morning.\n","71":"\nAt Yonville. German delegates leave German G.H.Q. for our lines to discuss Armistice terms.\nReach Marshal Fochs Hdqrs at 2 AM.\n","72":"\nAt Yonville. German delegates ask for an armistice to discuss peace terms. Foch gives them 72 hrs in which to accept our terms, which are an unconditional surrender. Our troops still pressing enemy hard\n\nNov1918\n\nSAT 9th\n cont\nall along the front. Mutiny reported in German Fleet. We are anxiously awaiting Germany's reply to Foch as on it depends wherther we go into the fighting line again or not.\nThe Bishop of Amiens has stated that it is his intention to have the statue of an Australian soldier placed in the Cathedral to commemorate the saving of the city & cathedral by our men.\n","73":"\nAt Yonville.\nWeather fine & clear. Good news from the\n\nNov1918\n\nSUN 10th\n \nfront, our troops pushing on & taking a great many prisoners.\nThe Kaiser & Crown Prince abdicate & fly to Holland. Revolution in many parts of Germany.\nBavaria proclaims a republic. Socialists forming a government in Prussia under Herr Ebert. Prisoners taken by Italians now over 600000. France now almost clear of enemy.\n","74":"\nAt Yonville.\nReported early today that enemy has accepted our terms & hostilities to cease at 11 AM today. We await further news.\n\nNov1918\n\nMON 11th cont\n\nOur troops have pushed past Mons. Two days ago American troops captured Sedan. Our Bde sports took place this aft in a field neat Citerne. Orders out permitting us to wear our old (36th) Batt colours inside the 33rd colours.\n\nTUES 12th\nAt Yonville. Weather fine & cold. Our terms to the Huns include Evacuation of all territory now held by them. German troops to be withdrawn over the Rhine. Enemy to hand over to the Allies 5000 guns, 2000 airplanes\n","75":"\n cont\n30000 Machine guns, 1,000,000 rifles.\n10 Battleships, 50 Destroyers. 30 Cruisers & the whole of her submarines.\nGiven 30 days in which to comply. Anzacs to garrisons. Bosphorous forts. Armistice signed at --AM on Monday 11th.\n","76":"\nAt Yonville.\nDivisional sports in aft & great success, held near Hallaincourt .\n","77":"\nAt Yonville.\nVery heavy frost. Route march in morning.\n\nNov1918\n","78":"\nAt Yonville.\nVery cold & frosty. Germany begins to carry out the terms of the armistice.\n","79":"\nAt Yonville. Heavy frost again this morning. A march to Oisemont in forenoon. Rumours of a move for our Div very soon.\n","80":"\nAt Yonville.\nAttended Mass in Citerne in morning. 4 of our Divisions to go into Germany as part of the army of occupation.\n\nNOV1918\n","81":"\nAt Yonville.\nWeather freezing & heavy frost. British, French & American armysnow advancing into Germany.\n\nTUES 19th\nAt Yonville.\nA march in morning & football in aft.\nRepresentatives of Hun Navy met Admiral Beatty yesterday to arrange for surrender of the German Fleet.\n\nWED 20th\nAt Yonville.\nMarch in morning & our first debate in aft, subject White Aust Policy.Part of the Hun fleet expected to surrender today.\n","82":"\n","83":"","84":"\nAt Yonville.\nFirst batch of Hun submarines surrendered & taken to Norwich yesterday.\n\nFRID","85":"\nAt Yonville.\nMarch in morning & football in aft.\nFirst portion of Huns fleet surrendered yesterday, comprising Battleships, Cruisers & Destroyers & taken to Scapa Flow (Orkneys).\n\nSAT","86":"\nAt Yonville. March & football filled in the day.\nAllies troops still moving towards the Rhine.\n\nNov1918\n","87":"\n\nAt Yonville\nRaining & cold. A debate in morning. Foortball in aft.\n","88":"\nAt Yonville.\nRaining. Allied armies now about to enter Germany. British to occupy Cologne, Americans Coblenz & French Mainz. General Gourands army enters Strasburg. Alcase Lorraine now clear of enemy. Since the signing of the armistice many thousands of our men who had been prisoners in Germany have reached our lines in a starving state.\n\nNov1918\n\nTUES 26th\nAt Yonville.\nRaining & cold. A Conference of our Brigade & Divisional commanders at Le Cateau to decide our future movements. Influenza very prevalent amongst our troops & many deaths during past month from it.\n\nWED 27th\nAt Yonville.\nCold & showery. A debate in morning,\"City versus Country life\".\nReceived socks, tob, cigarettes from Comforts Fund. We are now running football competitions in the Div.\n","89":"\n","90":"","91":"\nAt Yonville. Still raining.\n\nFRID","92":"\nAt Yonville. A lecture on famous bridges in morning by Lt Lahey, Engrs. Raining.\n\nSAT","93":"\nAt Yonville. A march in morning & football in aft. Bde Hdqrs v 35th Bn. won by Bn.\n","94":"","95":"\nAt Yonville. Attended Mass in the village church Citerne & paid a visit to mates in 35th Batt at Merelessart in aft.\n\nDEC1918\n","96":"\nAt Yonville.\nWeather fine. March in morning & lecture by Capt Patterson on \"Army Supplies\".\n","97":"\nAt Yonville.\nRepatriation scheme outlined to us. Rumoured that we are to move up into Belgium, near Namur, shortly. Our other Divs are up there at present.\n","98":"\nAt Yonville. March & debate on \"Do we indulge in too much sport in Australia\".\n","99":"\n\nTHUR5th\nAt Yonville. Weather wet. A march & football in aft.\n\nFRID","100":"\nAt Yonville. Our Div to move into another area, near Gamaches, in a few days. 11th British Div taking over this area.\n","101":"\nLeft Yonville per motor lorry at 9 AM with billeting party. Capt. Dixon I\/C, to find billets for Div. Travelled through Oisemont (Div. Hdqrs) Fesquierues etc to Maisniereswhich we are to make our Bde Hdqrs, This village 6 K from Gamaches.\n","102":"\n\nSUN8th\nAt Maisnieres, we are now near the coast 15K from Le Triport. Arranged billets for Sig Section & Bde Hdqrs with M. Du Mutiere our interpreter. Batts to billet in villages round us.\n","103":"\nAt Maisnieres. Weather good. Have fixed up for a privatebillet with Madam --one of the villagers, a mate & I pay 8F per week for a room & are very comfortable. Madame gives us Cafe at night & morning, & the change from barns etc very welcome. \n\nDEC1918\n","104":"\nAt Maisnieres Bde arrived from Yonville 2 pm yesterday. Rain throughout night.\n","105":"\nAt Maisnieres. Weather fine.\n","106":"\nAt Maisnieres.\n","107":"\nAt Maisnieres.\n","108":"\nAt Maisnieres.\n\nSUN 15th\nAt Maisnieres. Attended Mass in morning in village church. Have just heard from an old pal (Sig Albert Langham) captured on way to one of our outposts in No Mans Land in\n","109":" Contd.\nHouplines (Armentieres) sector in Dec last. Has now been repatriated to England. Attempted with 6 French soldiers to escape from prison camp in Germany in July last, but recaptured on Dutch frontlilne.\n","110":"\nAt Maisnieres. Cold & wet.\n\nTUES","111":"\nAt Maisnieres. Raining.\n\nWED","112":"\nAt Maisneures. Hail & sleet falling. To move our Bde Hdqrs to Acheux tomorrow.\n\n1918\n","113":"\nMarched from MaisNieres at 10 A to Acheux through Courcelles. 6 K. The Curéof MaisNieres has given me a letter to the Curéof Acheux & he has let my mate & I have a room in his house for 4 fr per week each. Our own Padre is also billeted with us. The people of MaisNieres were sorry to see us leaving & had treated us very kindly. Yesterday our Madame prepared omelletesfor us & gave us wine, & has made us promise to come & see them again.\n","114":"\nAt Acheux. Rain & hail falling. Rec pcl Mrs Martin.\n\nDEC1918\n","115":"\nAt Acheux.\n","116":"\nAt Acheux. Attended Mass in morning & had walk to Chipy in aft.\n","117":"\nAt Acheux. Running telephone lines to 33rd & 35th Bns from 9 AM. to 4 PM.Raining & cold.\n","118":"\nAt Acheux. Making preparations for our Xmas Dinner to take place at 6 pm tomorrow. We have bought poultry, etc. & hired a big room in the village & arranged with a French lady to do the cooking for us (50). Things promise better than they were last Xmas\n\nDEC 1918\\\n\nTUES 24th\nCont\nwhen I was with the Batt in the front line at Houplines (Armentieres) & everything under snow. My pal & I have sent some few little luxuries bought in our canteen, to Madame & Mlle Marceline with whom we were billeted at Maisnieres for their Xmas.\n\nWED 25th","119":"\nAt Acheux. Bright & clear with a little snow in the afternoon. Attended Mass in morning. Xmas Dinner at night a great success, kept going with a concert until 11 pm. 48 of us, Sig Sections &attached men, sat down to dinner.\n","120":"\nAt Acheux. Cold & raining.\n","121":"\nAt Acheux. Cold & still raining.\n","122":"\nth\nAt Acheux. Received a welcome Xmas pcl from our Comforts Fund.\nOfficial figures give French dead in war as 1,600,000 & British as 1,038,000.\n","123":"\nAt Acheux. Raining & very cold.\n","124":"\n\nAt Acheux. Walked to village of Franleu in aft.\n\nTUES 31st\nAt Acheux. Raining. 12 months ago tonight I was on a battle outpost\n","125":"\ncont\nin No Mans Land in Houplines sector in the North. Spent 30 hrs in a shellhole 70 yards from enemy front line trenches with snow & sleet falling continuously.\n","126":"\nAt Acheux, attended Mass in village church at 11 AM. This is the great day of the year with the French people.\n","127":"\nAt Acheux. Weather fine & cold. Long walk in aft.\n","128":"\nAt Acheux. Sun shining, the first time for many days.\n\n\n","129":"\nAt Acheux. More rain.\n","130":"\nAt Acheux. Attended Mass & in aft walked to Fesquieres .\n","131":"\nAt Acheux. Debate at night \"State versus Private Control\" a draw.\n","132":"\nAt Acheux. Cold & wet. Peace Conference to begin work very soon. Civil war in Berlin & other German towns.\n","133":"\nAt Acheux. Many of the boys have applied for jobs in England to fill in time until their turn comes to go home. Walked to Town in aft.\n","134":"\n\nTHUR 9th\nAt Acheux. Weather dull & cold.\n","135":"\nAt Acheux. Fighting continues in German towns.\n","136":"\nAt Acheux. Dull & very cold.\n","137":"\nAt Acheux. Mass at 10.30.\n\nMON","138":"\nAt Acheux. Cold & wet.\n\nTUES","139":"\nAt Acheux.\n\nWED","140":"\nAt Acheux. A Holy Day in France,attended Mass.\n\nTHURS","141":"\nAt Acheux. A long walk in aft with pal through Franleau.\n\nFRID","142":"\nAt Acheux. Raining & cold.\n\n\n","143":"\n\nFRID\n SAT 18th\n\nAt Acheux. Had a very interesting talk with an old lady of this village. She was living in the same house she now occupies, in the war of 1870, & this village was occupied by the prussians for 4 months. Her house was taken possession of by the troops & she had to sleep on the floor while her bed was used by them. Two of my mates now billeted with her & sleep in the same bed that the prussiansoldiers slept in at that time. Madame Delcroix is 85 & quite lively.\n Peace Conference opens Paris.\n","144":"\n\nSUN19th\nAt Acheux. Attended Mass in morning.\n\nMON","145":"\nAt Acheux.Weather frosty & clear.\n\nTUES","146":"\nAt Acheux. Walked to .\n\nWED","147":"\nAt Acheux. Roads now frozen hard.\n\nTHURS","148":"\nAt Acheux. Still freezing.\n","149":"\nAt Acheux. More freeze.\n\nSAT","150":"\nAt Acheux. Two mates, Reardon & Linton leave for England on way home. Walked part of the way to Div Wing to see them off.\n\n\n","151":" \nAt Acheux. Snow fell through night & today everything is covered with it.\n\nMON 27th\n\nAt Acheux. Very cold.\nEmbarkation Roster now out. First draft from Sig Co to leave here on about","152":" Aussies per day go to England. 6 weeks in camp then before embarking 2 weeks leave to be granted.\n","153":"\nAt Acheux. Snow fell again last night. Drafts to leave every10 days from ouRDiv (1000 men) for home.\n\nWED 29th\nAt Acheux.\nMore snow & very cold.\n","154":"","155":"\nAt Acheux. Freeze still on.\n","156":" \nAt Acheux. Still under snow & roads now frozen hard.\n","157":"\nAt Acheux. Our demobolization held up owing to strikes in the shipyards in England.\n","158":"\nAt Acheux. More snow through night.\n","159":"\nAt Acheux. Long walks with pal daily through other villages.\n","160":"\nAt Acheux. A bit of a thaw set in & snow melting.\n\nFEB1919\n\nWED","161":" \n\nAt Acheux. Heavy fall of snow through the day.\n\nTHUR","162":"\n \nAt Acheux. More snow & the coldest weather thus far this winter.\n\nFRID","163":"\n \nAt Acheux. Still freezing.\n\nSAT","164":" \n\nAt Acheux. A long walk daily, when the weather permits, to keep us fit.\n\nSUN","165":"\n \nAt Acheux. Very cold. Everyone waiting for a mail from home. Early to bed in this weather. 24 degrees of frost this morning.\n\nFEB1919\n\nMON","166":"\n\nAt Acheux. Country still under snow & very cold.\n\nTUES","167":"\n \nAt Acheux. With mates paid a visit (per motor lorry) to our Div \"Arts & Crafts\" exhibition, held at Montainville, 12K from here. Some very good work shown in metal, woodwork, sketches etc. Boxing tournament & concert by \"Crows\".\n\nWED","168":"\n \nAt Acheux. Weather now milder & snow melting.\n","169":"","170":"\n \nAt Acheux. Feel off colour. Touch of \"flu\".\n\n\n\n\n","171":"1919\n","172":"","173":" \n\nAt Acheux. Down to it with \"flu\".\n","174":"","175":"\n \nAt Acheux. Saw Dr & got some physic.\n\nSUN16th\n \nAt Acheux. Feel anyhow. Raining & cold.\n\nMON17th\n \nAt Acheux. More rain. Feeling pretty crook.\n\nTUES18th\n \nAt Acheux. Feel no better & right off tucker.\n\nWED19th \n\nAt Acheux. Saw Dr again today. Cold & wet. Raid in aft.\n\n"}}