{"Document Name":{"0":"Diary_0034","1":"Diary_0034","2":"Diary_0034","3":"Diary_0034","4":"Diary_0034","5":"Diary_0034","6":"Diary_0034","7":"Diary_0034","8":"Diary_0034","9":"Diary_0034","10":"Diary_0034","11":"Diary_0034","12":"Diary_0034","13":"Diary_0034","14":"Diary_0034","15":"Diary_0034","16":"Diary_0034","17":"Diary_0034","18":"Diary_0034","19":"Diary_0034","20":"Diary_0034","21":"Diary_0034","22":"Diary_0034","23":"Diary_0034","24":"Diary_0034","25":"Diary_0034","26":"Diary_0034","27":"Diary_0034","28":"Diary_0034","29":"Diary_0034","30":"Diary_0034","31":"Diary_0034","32":"Diary_0034","33":"Diary_0034","34":"Diary_0034","35":"Diary_0034","36":"Diary_0034","37":"Diary_0034","38":"Diary_0034","39":"Diary_0034","40":"Diary_0034","41":"Diary_0034","42":"Diary_0034","43":"Diary_0034","44":"Diary_0034","45":"Diary_0034","46":"Diary_0034","47":"Diary_0034","48":"Diary_0034","49":"Diary_0034","50":"Diary_0034","51":"Diary_0034","52":"Diary_0034","53":"Diary_0034","54":"Diary_0034","55":"Diary_0034","56":"Diary_0034","57":"Diary_0034","58":"Diary_0034","59":"Diary_0034","60":"Diary_0034","61":"Diary_0034","62":"Diary_0034","63":"Diary_0034","64":"Diary_0034","65":"Diary_0034","66":"Diary_0034","67":"Diary_0034","68":"Diary_0034","69":"Diary_0034","70":"Diary_0034","71":"Diary_0034","72":"Diary_0034","73":"Diary_0034","74":"Diary_0034","75":"Diary_0034","76":"Diary_0034","77":"Diary_0034","78":"Diary_0034","79":"Diary_0034","80":"Diary_0034","81":"Diary_0034","82":"Diary_0034","83":"Diary_0034","84":"Diary_0034","85":"Diary_0034","86":"Diary_0034","87":"Diary_0034","88":"Diary_0034","89":"Diary_0034","90":"Diary_0034","91":"Diary_0034","92":"Diary_0034","93":"Diary_0034","94":"Diary_0034","95":"Diary_0034","96":"Diary_0034","97":"Diary_0034","98":"Diary_0034","99":"Diary_0034","100":"Diary_0034","101":"Diary_0034","102":"Diary_0034","103":"Diary_0034","104":"Diary_0034","105":"Diary_0034","106":"Diary_0034","107":"Diary_0034","108":"Diary_0034","109":"Diary_0034","110":"Diary_0034","111":"Diary_0034","112":"Diary_0034","113":"Diary_0034","114":"Diary_0034","115":"Diary_0034","116":"Diary_0034","117":"Diary_0034","118":"Diary_0034","119":"Diary_0034","120":"Diary_0034","121":"Diary_0034","122":"Diary_0034","123":"Diary_0034","124":"Diary_0034","125":"Diary_0034","126":"Diary_0034","127":"Diary_0034","128":"Diary_0034","129":"Diary_0034","130":"Diary_0034","131":"Diary_0034","132":"Diary_0034","133":"Diary_0034","134":"Diary_0034","135":"Diary_0034","136":"Diary_0034","137":"Diary_0034"},"Date":{"0":"unknown","1":511.0,"2":512.0,"3":513.0,"4":514.0,"5":515.0,"6":516.0,"7":517.0,"8":518.0,"9":519.0,"10":520.0,"11":522.0,"12":523.0,"13":524.0,"14":525.0,"15":526.0,"16":527.0,"17":528.0,"18":529.0,"19":530.0,"20":533.0,"21":534.0,"22":535.0,"23":536.0,"24":537.0,"25":542.0,"26":543.0,"27":544.0,"28":545.0,"29":546.0,"30":547.0,"31":548.0,"32":549.0,"33":550.0,"34":551.0,"35":552.0,"36":553.0,"37":554.0,"38":555.0,"39":556.0,"40":557.0,"41":558.0,"42":559.0,"43":560.0,"44":561.0,"45":562.0,"46":563.0,"47":564.0,"48":565.0,"49":566.0,"50":567.0,"51":568.0,"52":569.0,"53":570.0,"54":571.0,"55":572.0,"56":573.0,"57":574.0,"58":575.0,"59":576.0,"60":577.0,"61":578.0,"62":579.0,"63":580.0,"64":581.0,"65":582.0,"66":583.0,"67":584.0,"68":585.0,"69":586.0,"70":587.0,"71":588.0,"72":589.0,"73":590.0,"74":591.0,"75":592.0,"76":593.0,"77":594.0,"78":595.0,"79":596.0,"80":597.0,"81":598.0,"82":599.0,"83":600.0,"84":601.0,"85":602.0,"86":603.0,"87":604.0,"88":605.0,"89":606.0,"90":607.0,"91":608.0,"92":609.0,"93":610.0,"94":611.0,"95":612.0,"96":613.0,"97":614.0,"98":615.0,"99":616.0,"100":617.0,"101":618.0,"102":619.0,"103":620.0,"104":621.0,"105":622.0,"106":623.0,"107":624.0,"108":625.0,"109":626.0,"110":627.0,"111":628.0,"112":629.0,"113":630.0,"114":631.0,"115":632.0,"116":633.0,"117":634.0,"118":635.0,"119":636.0,"120":637.0,"121":638.0,"122":639.0,"123":640.0,"124":641.0,"125":642.0,"126":643.0,"127":644.0,"128":645.0,"129":646.0,"130":647.0,"131":648.0,"132":649.0,"133":651.0,"134":652.0,"135":653.0,"136":654.0,"137":655.0},"Entry":{"0":"\n\nArrived Sy ","1":"\n\nWent Vic Barracks owing rush of recruits had to return on Monday when succeeded in passing. Left for Liverpool Camp on","2":" (Had good time in City between 16th & 18th)\n\nArrived Camp","3":" Joined Signallers – Applied Transfer to infantry & joined 6\/2 on the ","4":"\n Secured all outfit but no uniform – Given rifle on","5":" Struck good tent mates (19 of them) Dry canteen here \"good thing too\" say the majority of the chaps Plenty of canteens. One can buy almost anything \n\nHarry & I are feeling \n","6":"\n\nfit. Reckon if the Platoon Sergt is correct & we make a crack Coy we will make a name for ourselves at the Dardanelles, or in Europe. Very decent chaps here now, a few rotters of course.\n","7":" Ordinary Routine until 9 am Cooks fatigue up to dinner time & then the afternoon off\n","8":" Rise 6 15 Pioneers fatigue for about 2 hours (rest of time off) \n\nChurch at night - Feeling anyhow (ditto my mate Harry) \n","9":" Cold improved but still feeling stiff & tired Empire day, no afternoon parade – Plenty of Visitors –\n\n25.26.27 Usual thing. Was tent \n\norderly","10":" - cleanest tent in lines of (13)\n","11":" Costelloe the 63 year old marvel (permanent instr.) gave us an hour or 2s hurry up\n","12":" Short route march in m’ng extended order drill in afternoon\n","13":" Expect uniforms shortly\n","14":" No uniforms yet. Ordinary routine\n","15":" No pay yet. Rifle instruction. Expect to leave for the front Saty week\n","16":" Rifle instruction all day. Paid at night. Big rush on Canteens –\n","17":" Left for Sydney special leave Saw Mill. Good time Camp night of","18":" Left for home on \n","19":" final leave. Returned to Camp","20":"\n","21":" &","22":" Rifle shooting \n","23":" Issued with Webb Equipment (Blank)\n","24":"\n \n","25":" Left Sydney 3 pm for an unknown destination (per Karoola) 7000 tons fairly calm. Slept deck\n","26":" Big swell sick as blazes (am mess orderly too) No dinner – Sky threatening o’cast. Number gulls & porpoises. (Hugging the shore) 3.30 pm Feeling better sea calmer\n","27":" \n19.20.21\n Land in sight Sea a little rough.\n","28":" Getting rougher Land fading -\n","29":" – 21 No land in sight entered Great Australian Bight. Heavy swells. Little \n\nor no drill. Our parade ground – the boat deck being rather rocky & unprotected Digg La Touche 1st Lieut fined half the Company for being late on early parade (fine","30":" each) He’s great on shaving too & lectures us frequently on Sexual intercourse & the evils attendant \nthereto.\n therewith. Cairo he mentioned as an example of the worst kind –\n","31":" Sighted land on the Starboard side. One high mountain stands out distinctly through the haze. Just washed Towel & Sox. Sore throat & giddiness. Had throat painted & took some medicine (Orient liner Port side) \n\nHeavy swells. Shipping fair amount of water. (Rottenest thing on board is the Canteen – Fancy only 1 Canteen for 1000 men? Takes a chap from 30 to 60 minutes to get anything & mostly standing all the time. Only 1 man is served at a time – through a 3 by 3 opening.\n","32":" Turned out at 6 am Sighted Cape Naturalist on Starboard side at 6.30\n\nIntermittent lighthouse. Land in view all day, passing Rottnest Is’ at 4.30 pm (2 Lighthouses) This island is a concentration camp for Germans – Rather a good one too. Ship has been sailing almost due N. for last 12 hours but is \n\nnow turning East & making for Fremantle Fell marching at parade 2.15 pm. Probably route march tomorrow but am mess orderly, what rotten luck!\n\n5.40 pm passed Cottesloe Beach (Long line of clean white sand) on Port side shining in the moonlight. Fremantle just ahead its lights twinkling a welcome to the boys of NSW –\n\nHere & there an electric glitters along the beach line while the Quay light shines out intermittently like a great lone star\n\n6 pm Entered between 2 breakwaters (Fremantle) & anchored within short distance of shore\n","33":" Our Company is on guard etc today \n\nso cant go ashore. All the other Companies have gone. 2 Colliers \nloading\n coaling us one on either side secured fruit & a paper over the ships side. --\n\nMany drunks returning from stolen leave. Some of them are a disgrace to their Companies. Hope our boys behave better tomorrow. Another troopship \"Wandilla\" just ahead of us.\n","34":" Went ashore at about 10 30. am. had fairly good time returned to wharf at 11.45. Streets rather narrow. Town quiet. Main part of town on slight slope background of small hills in places. Mostly flat sparsely wooded\n\ncountry surrounded the town. Wandilla left at 4.35. Karoola at 4.45. Wharves lined with people. Liners, Coasters, coalers sailing boats tugs launches etc all assisted in giving us a hearty send off.\n\nWireless connected at 4.50 pm. Struck heavy seas, wind blowing half a gale. Caught a few wireless signals.\n","35":" Heavy seas. Shipping good deal water Mess deck swimming in places (with water!) A62 \"Wandilla\" wants to return to Fremantle but our skipper refuses. Been waiting on her since leaving port. Very interesting watching A62 riding the swells. She ships good deal of water. Looks A1, Lighted up. \n","36":"\n\nBeautiful day. Slight swell, doing 9 Knots. Church parade 10.30. Did some washing & button sewing. Wandilla travelling slowly.\n","37":" Beautiful day only slight swell. Doing 12 Knots. (Inoculated). Reading morse light signals from Wandilla\n","38":" Very little water for washing or drinking No drinks (except Sarilla) at Canteen. Full marching order with great coat boots & Mess tins. Weather calm – getting warmer Sighted whale few hundred yards away (on the 28th) \n","39":"\n\nGetting warmer. Glassy sea with strong under current. Think \n\nwireless operator sp’king to Convoy, Msg’s in code. Officers revolver shooting. Dance for Nurses & Officers. Commenced growing moustache","40":"\n","41":" 18.30 am We are now X very close to the spot where the Sydney left the Australian transports & sank the Emden at Cocos Island. Pay day today £1 each. I drew nothing. Dont want any. Rather hot. Fair swell rippled surface\n","42":" Guard 7 am to 9 am","43":" Choppy sea. rather heavy storm driving us forward (our guard is one of the best yet)\n\n3rd Off guard at 9 am. Washing day today. All over the ship one sees a multitude of shirts, underpants, towels, hanks, sox, cardigan jackets etc. – Washed \n\nmine in a small bucket of condensed water with the aid of a cake of toilet soap. Heavy sea running wind still behind us.\n","44":" Fair swell. Church at 10.30 as usual. No apples today. Getting warm. Boxing contest last night. This child was reading, & eating tinned pears. Theyre A 1. Will be pleased when we see land & get the latest war news. The privates get nil here. \n\n Day of American Independence\n","45":" Appears all towels white hats, dungarees pants etc which we miss are stolen by our own mates (that is the crookies) & sold to the crew for cash, food, coffee etc. Pretty rotten when a chaps clobber isn’t safe in his own mess, Some one opened my sea kit bag & nicked \n\nsundry articles. Burial service at 5 pm (a Q’ld light horseman)\n\nBoat hove to for 3 minutes. Imagine the ever moving waters of the Indian ocean (luckily free from Monsoonal weather – so far)\n\nThe sharp rattle of rifle fire as the dead hero’s mates fire a parting volley. The long lines of Khaki clad figures standing firm & erect at the \"present\" arms as the \"last post (our sweetest bugle call) breaks upon the tropical stillness. As if in keeping with such a sad event the sun lies hidden behind the ever thickening cloud veil whilst the remains of our first hero glide swiftly to a watery grave\n","46":" Getting warmer. Crossing the equator tomorrow. Address by OC regarding range finding etc. – This ocean infested with sharks. Some have been noticed following & swimming alongside the ship. Lime juice served out for dinner today. Will be available for a few days during the hot weather in the vicinity of the equator. Prunes for tea tonight. Ye Gods! What a repast for a common private.\n\nWater supply now good although it was pretty rotten during the past couple of weeks\n","47":" Holiday today early m’ing parade only (Crossing the equator) nearly everybody in the ship was dipped. I was \n\ncalmly reading on the upper deck when 2 chaps spotted me. So I went quietly in shirt & trousers only Sat on a board which tipped me into 4 feet of water. Half a dozen chaps then dipped me 3 times. – Later on all officers & NCOs including the Colonel were compelled to kneel to Father Neptune. They were then lathered all over the head & face with a flour & water paste shaved by a barber with a badly dented wooden razor. Then they sat on a collapsable seat which tipped them into the water where they were ducked. Half a dozen nurses acted as Neptunes daughters. Many of the \n\n7th costumes were very funny & some rather ingenius. The Crown Prosecutor read the charges against the prisoners & Father Neptune pronounced sentence\n\nThe Counsel for the defence wasnt in it, all he could say was – \"on behalf of the accused\" – when a wet towel or something equally appropriate would put X an end to his defenceX.\n","48":" Our mess orderly is sick today (inoculation) so I am taking his place\n\nConfoundedly warm on the mess deck & the job isn’t much. However the Colonel complimented my mate & I upon the spick & span condition of our mess so whats the use of growling?\nSlight sea today. \n\nAtmosphere close & muggy sky threatening. X Swimming bath not available on the well deck –\n","49":" Threatening. Sea getting rough. Making for the African Coast at 13½ Knots to avoid an expected hurricane. \n7 pm\n Just finished 1 hours pack drill. La Touche 2nd in charge gave me 3 days pack drill because I hadn’t shaved for 24 hours. Paraded to the OC who reduced sentence to 2 hours & promised to look into the matter. Rotten when a man has to needlessly shave every day.\n\n10th On fatigue duty today but have done nothing except read & wash a few clothes \n","50":"\n\nSighted land at 3.35 a Cape on the North East Coast of Africa. Sea green now instead of deep blue.\n","51":" Beautiful cool night last night with glorious sea breeze yet terminating in a hurricane.\n\n6 am Entered Gulf of Aden. Somaliland (NE Coast of Africa) on our port side This is where a fair amount of fighting occurred during Boer War. All lights out from now on.\n\nTemperature 85 in shade at Sunrise becoming unbearably hot. Perspiration oozes out of one even under cover.\n","52":" Sighted entrance to Aden 5.30 am entered Harbour 6.30. Entrance guarded by 2 rocky headlands sloping from \n\n12th\n\nJust read farewell letters 9 letters recd from Dad & Mum on my enlisting.\n\nAll the country with exception of 2 headlands appears be flat & sandy.\n\nLeft Aden at 5.25 for the Suez. Convoy – (Auxiliary Cruiser) at the lead. \n\n117 in the shade. First aid lecture\n","53":" Oppressively hot Early parade only. Not even a lecture. Everybody spread out on deck under cover. Entered Hells Gates last night Passed island port side about 7 am. Water reeking with lime & almost undrinkable.\n\n12 Noon. Beautiful breeze getting us head on Passed group islands at 2 pm (lighthouse) Sea bright blue few porpoises swimming \n\nin front of us. Passed several steamers, windjammers & small schooners. Good many birds & porpoises about. The latter look strangely weird as they slip through the water in the deepening twilight & one can only liken them to ghost like serpents. The effect is accentuated by the glittering phosphorescence of their foam splashed wake. Passed 2 cruisers & possibly a submarine during the night\n","54":" Hot as usual rather strong undercurrents from 1 pm on. Washed towel etc. Spoke Wandilla last night. Heat abated a little Passed suddenly from disturbed to smooth glass like sea covered with an apparently oily scum. \n","55":"\n\n4 sharks seen this m’ng swimming just ahed of noses. Kit & rifle inspection.\n\nWandilla on Starboard. Shaving daily. Its a fair cow. Good breeze so far since entering Red Sea\n","56":" Full kit inspection today. Expect to land tomorrow. Good deal shipping including our own passed close together Mainland visible on both sides greater part afternoon. Not so hot. Haven’t been able to get a decent sweat up (what?)\n\nRugged but rather Lost barren hills form coastline\n","57":" Arrived Suez early this morning. Rocky on left uninhabited. Town is on right & in front on low lying country \n\nplenty of shipping. several Troop ships in Harbour Natives in sailing boats selling sweets, papers & pcs. A few melons also available. Prices fair. Am on guard today. Just our luck. Fairly warm\n","58":" Entrained at Suez for Cairo at 11.15 am Fairly hot. Few Imperial Officers, Natives & Indian Police to twig us – the former to judge, Ay what? Train travelling fairly fast but rocking - I am perched on back of seat trying to write x (suburban seats) x Canal (lined with banana groves grapes corn etc) on right for first few miles. Mail boat just passed bound for Suez \n\n18th arrived Aerodrome X Camp 7.15 pm.\n","59":" Vally at 5 am, parade 6am bread jam & tea for breakfast\n\n(Last night tea & biscuits for tea. Inspected Bazaar at Cairo paid guide 10 piastres & driver 4 piastres. Little or no news from The Dardanelles. Drill about 5½ hours & one hours lecture.\n","60":" Parade 6 am & 5pm Lecture. Plenty of ices & drinks. Tucker plain but fairly good. Had a look at Heliopolis (or new Cairo) Some splendid buildings but roads & streets as yet only half formed. Walking in the sand makes one tired. No mosquitoes but a few flies. Hav’nt seen \n\nany immorality so far but there is a great deal in Cairo.\n","61":" Vally at 4 am fell in 5am for picket duty at Railway. Good job too. Plenty of grapes & melon – \n\n7 to 9 pm Route march through outskirts of Cairo. Beautiful cool moonlight night. Marched between avenues of trees.\n\nVisited the place where Mary sat under Sycamore Tree (Saw tree, also well from which Mary drank)\n","62":"\n\nUsual parade & lecture. Met an old mate yesterday & had a long chat Pay day today £1 –.\n","63":" Had a mimic attack. Sent home pcs & views (32 piastres) Wrote letters. Visited Wazza at Cairo. Very immoral. \n\n \n","64":" Parade 6 to 7.30. All rest of day off – Went Cairo, Met Ross of Armidale at the Gardens. He was at the front in first landing with ASC Wounded in leg Is returning to Australia - We Returned to camp broke. Gardens are rather nice, shady walks, plenty of green grass & trees etc.\n","65":" Church parade at 7.15 am on the sands of the desert. Visited pyramids (& Sphinx) 3 large 6 small largest 457 ft Cheops (Pyramids, Sphinx & Tombs composed of limestone, Granite & Alabaster. View of Nile Valley from Pyramids beautiful. One carpet of green broken by Palaces native villages etc. with \n\nCairo in distance. \"Absolutely stony\" Sergt paid for our tea \"4 piastres\" – no drinks. obtained water at fountain Never so stiff before. Cut out donkey ride Cannot stand strain. Returned to camp at 10 pm Tramline runs alongside avenue of trees.\n\n26 Slept like a top. 2¾ hours drill today. We expect leave for front this week. If theres anything doing, the 6th of the 2nd is always called on, but we’re always dead last if anything good happens along. Route march tonight 6 pm to 7.45. at 7.15 pm Moon just risen behind clump of gums. Nestling in this clump of our own native trees \n","66":" is a small palace, (showing pure white in the moonlight) & a few humble native residences while the foreground is composed of one beautiful \ngreen\n carpet of green herbage. 20th Batt arrived –\n","67":" Usual parade. Saw Jack Curtis (20th) & he looks A1 Had surprise attack 5 to 7 Showers & then bed\n","68":" Parade as usual. Put in good work Pay day today 200 piastres. Expect leave for front shortly Washed some clothes. Had good shower\n","69":" Parade 6 to 7 then full kit inspection Half holiday. Visited Zoological gardens. Simply beautiful. Well laid out far before Sydney Zoo. Tiled walks\n\nglorious avenues. Good animal collection. Everything clean & well laid out. Admittance ½ piastre (1¼) expect leave for front tomorrow morning. Went Cairo at night. Had good time. Donkey ride, 5 piastres for 1 hour. Very easy to stick on. One donkey tripped & fell & the rider went clean over its head & sprawled ungracefully on the road. Cafes open here until 2 am – \n","70":" Route March 6 to 8.15 felt damed tired. Wrote letters in afternoon \n","71":" No more pay today. Parade 6 to 8 am. Full kit inspection. Half holiday. Cairo in afternoon. Leaving tomorrow \n\n31 All boys dead broke. –\n","72":" Left camp at 7.55 entrained at 8.50 pm. Very warm. About 500 of us. Discipline good Not many water melons en route nearly all boys broke. Country near Alexandria appears to be productive. River Nile beginning to spread over low lying parts. Arrived Alexandria 4.30. Very hot in Carriages (with full packs up)\n\nEmbarked 5.30 on Z32 a horse transport (which also carried some crack British Regiments) Mess in F’castle head. Very warm.\n","73":" Slept fairly well. Breakfast porridge tea, bread, butter & jam. Sea not exactly calm. Fair swell (water dark blue) Beautiful day inclined to be warm. nice cool breeze. The old tub \n\nis rather chatty. In certain places one may see the sportive few playing \"touch wood\" leap frog & having a good time generally. No showers on board except a \"private Showers\", he’s a – poor substitute. Rotten dinner. Greasy soup, rotten spuds & 33rd class meat.\n","74":" Slept boat deck, rather breezy. Have to hang on to blankets. Sighted land 6 am on port side. Appears barren & rocky. Fair dinkum this is a cow of a ship. Chatty all over, rotten accommodation, crook tucker - But then this is a British ship not an Australian Ship. The English Tommies call us Andy Fishers 6 bob a day Tourist Army – Dinner time Tucker rotten. Tied meat \n\nto post with rope then charged with fixed bayonets. Kicked dixie of soup all over mess deck. Waved red flag at one piece of meat & it charged me up the gangway – La Touche orderly Officer was howled down & then hooted – appears as if the 6th of the 2nd has broken out at last (R.I.P.) \n\n\"Harry chucked in his stripe\" – Hoo – blooming Ray.\n","75":" On guard last night on look out for Submarines. 150 ball cartridges issued. Nothing sighted. Entered Lemnos Harbour at 11 am Fleet of battleships on Starboard. Small town, rather deserted Harbour fairly big, military camp & plenty of troopships. Semi-salt water & rice pudding \n\n4 for dinner Tea not too bad. Expect leave for Dardanelles tomorrow. \n","76":" Still here. Dont know when or where we are going. Tea, bread & butter for breakfast. Good Harbour, plenty of shipping – Surrounded by low barren hills. Left Lemnos in Sarnia for the front at 3.45 a fast boat. She’s only small but can do 24 knots an hour – Think going to new landing\n","77":" landed late last night in lighters got lost for a while walked a mile or two. Plenty of rifle & gun fire around us.\n\n6th In depot trenches Some shell fire. Tucker fair. Carried water in cans. Fired on by Turkish snipers – \n\n6th Charged Turks ( was in 4th line) Took 3 lines of trenches. Hellish fire, shell rifle, machine gun Dont know how we got through. Mate & I lying in front parapet for 3 hours under shell & other fire. Got in after flare fire from burning bushes had died down behind us.\n","78":" Big attack by British & French. Hundreds of guns booming Thousands of rifles flashing. Usual fighting all day Bombs are the worst & do deadly work. Getting nervy dodging bombs.\n","79":" Turks nearly cut 6 of us off. Retired few yards. Not in actual front line but getting plenty bombs & shrapnel – Our (Sunday)\n\n \n\n8\n\nbombs are not a patch on the Turks. Take too long to light. - 3.30 pm. Sent back to old firing line for rest. Dead tired\n\n9th 8 am. Instructed get ready to reinforce – Very little rest after 48 hours fighting. Feeling a little better. Stated that Turks are massing for a retreat. Our cavalry waiting to cut them off. On Friday 6th 800 of us went into action 170 returned fit for service on the 8th\n\n9 We went into old trenches at 2 pm but are now going into firing line again at 4pm. War is hell. Absolute unlimited hell. The papers say \"Glorious Victory 2nd Batt captured 3 lines trenches. Losses slight\" The real thing should read – \"We \n","80":" Charged in face of a murderous fire, took 3 lines of trenches. Losses very heavy – \"Still it was a great victory\" - 5 out of 8 of us (mates) left.\n","81":" Had good quiet time on left flank. Digging & building hard.\n\nPicture us digging deeper & deeper into beautifully hard rocky clayey soil. Millions of flies buzzing round – Bullets zip-zipping above shrapnel bursting near our trenches & best of all near the X Turks X Rather warm too. One man on each parapet is watching the enemies trenches for a chance of getting in a shot or noting where our shells fall. No wash yet & no shave. War supposed to be over in week – perhaps!\n\nanyhow we are gradually surrounding them. I hope to get there soon.\n","82":" Firing incessantly with rifle last night expected Turkish bomb attack. – One enemys guns smashed Rather cool during night & feel really hungry – Dug out a new latrine during afternoon of 10th Our Sergt Major shot couple Turk snipers.\n\nFrench aeroplane chased Taube but German too fast – Cleared out. Left at 3 pm for resting base after 48 hours in the trenches .\n","83":" Few shells – went for dip in briny Jolly nice after 6 days trenches & no wash Hospital ships 4 cruisers in distance mules & men busy drawing water etc. \n\n12 Glorious sunset last night. Never to be forgotten Believe my cousin Ron Bendrey has been killed. Rum & lime juice issue. Goes well with water. Few big shells about\n","84":" On H Q reserve last night Called out for observing 9 pm to 5 am Plenty bullets & flares. Had wash this m’ng after another man (water rather soupy but great luxury) First freshwater wash yet. My mates (3) & several others had wash also. \"Hot\" Harry & I applied for positions Telegraphist. Left for firing line again at 2 pm. Had a rough time shell fire etc.\n","85":" Applied vacancy for Telegraphist. Harry got it. Only one position. Better luck tomorrow. \n\nshelled fairly heavily during day. No casualties\n","86":" Gun & rifle fire last night very little damage done, Off again for 48 hours Just discovered cousin R W Bendrey killed by shrapnel fire while carrying stretcher on night of 6th inst – being night on which we attacked the Turks. Written his people –\n","87":" Quiet last night. Had good sleep. Water fatigue this morning – Visited place where Ron buried. Makes one feel sad & home sick Bomb-throwing practice & swim tonight. Fairly quiet all day. Had game with Gordon Mann old school mate – now Reg’tl QMS\n","88":" Not too much sleep last night. Some mug told us to stand by but we were not having any. – \n\n17 Bread issue this morning first since arrival. Feel homesick Dreamed of the home-land last night. Back into firing line 2 men wounded. (Rice)\n","89":" Fairly quiet last night. Harry gone to Hospital Think Taffy gone too. Few shells today very warm plenty flies & chats etc.\n","90":" Another quiet night raining lightly this morning. Looks threatening nearly shot by one our own chaps. 4th time now, close shave – (1) shell grazed me, (2) shrapnel tore coat & knocked me down (3) shell cap hit me in testicles. Left for rest trenches at 11 am 48 hours rest.\n","91":" Had good nights rest Shrapnel plentiful this morning. Piece lobbed \n\n20 in our possy just before we returned to it. Weather cooler, fewer flies. Nearly had head blown off by mates rifle\n","92":" Bad night, feel anyhow this morning. Nearly X missed breakfast X Very quiet. Into firing line at noon fighting on left flank. Naval bombardment. Our guns also busy\n","93":" Dr says we leave in a weeks time. (what?) off duty during day (fairly quiet last night Light rain) Golden Syrup today. My mate has Neuralgia – (Sunday)\n","94":" Mimic bombardment by our right flank last night. Drew Turks fire beautifully. Cramp in stomach off duty all night. Better today. Left trenches at 3 pm for 48 hours\n\n24 Slept well last night water fatigue morning Few shells today. like \n\n24 1st letter date","95":" recd today. Rain. (Later) No rain, fair number shells \n","96":" water fatigue. Into firing line at 12. Think going Embros for spell. Aeroplanes busy. Italy declared war. Heavy naval fire on left.\n","97":" Warm quiet. Paper Langford today. Bonus AMP. Letter from Essie. Sent cable Mum on 25th (week-end).\n","98":" Turks went dilly last night fired thousands shots – Quiet today. Feel crook. Think going Signalling corps. H.Q. – Roper gone. Hospital ship sick - Only Reynolds & self left out of 8 mates (1 Killed 1 missing 3 wounded 1 sick & we two left) Ordered take white patch off back – Dysentery \n","99":" Ordered to 3rd F.A. chill & diarrhoea – feel rotten. Arrived Hospital ship afternoon. Glorious to have good bath & bed & decent food \n","100":"\n\nHad pretty crook night. Making for Lemnos rest camp. Broke – Letter from Millie 27th.\n\nNot too well all day but felt little better towards night (Lying at Lemnos) \n\nService during afternoon\n","101":" Fair night. Medicine dysentery. Think going Alexandria (Left for \"A\" at about 10 am) Milk diet, feeling better.\n","102":" Feeling fair. Dysentery eased but feel weak & giddy after getting up. \"Injection\" – Weather warm (90 here No 3 ward)\n","103":" Good night. Feeling better - milk diet – arrived Alexandria about 4 pm Disembarked. Had lemon drink biscuits etc at Palace Motor to Lunar Park \n","104":" Feeling better – cool – imagine me lying in bed reading now & again using the fly \n\n2 disturber – while an Egyptian pulls the big fans to & fro. Music we have too at times. Plenty of showers & baths.\n","105":" Feeling not so well. Had good night though. Plenty flies. On brandy & water only for 24 hours.\n","106":" Good night, feeling better not hungry either. Chap next me, Englishman, growls too much altho he is fairly crook. Many chaps punch out during night – Getting hungry but its no go. Weak\n","107":" Fast broken after 48 hours, improving. Funny to watch chaps nicking into town some wearing slippers, & others pyjama coats in lieu of missing parts of uniform (2 violins piano & piccolo – some class)\n","108":" A1. Plenty gum trees here Cant change 50. Sat deck chair outside few minutes. Nurse first class. Good Dr.\n\n6 Good tucker & plenty of it.\n\n7 (Herald here dated","109":"\n\nA1. good appetite. Wrote 13 pcs. Paid 50 piastres – Also got 100 on 3rd. No chocolate boy now Rotten luck I reckon.\n","110":" Rather sore throat. Not bad night. Gramophone is counted out to no end. Rotten machine. YMCA few yards away very handy. Concert tonight. Songs, Comic & otherwise, some class too. Obtained chocolate at last \n","111":" Bit off. Stiff neck. Too much chocolate perhaps. No letters yet. Pcs handed round\n","112":" Feeling better. Heard 2 Batt be relieved shortly. Pest in next bed has gone to Palace Hosp \"Poor Palace\". Met Alf Cooper tonight. He’s X wounded in leg X Bungoo Krippner was wounded by bomb. \"What a night !\" A glorious, starlit Eastern night: and here am I sprawling in a deck chair \n\n10 neath one of our own dear gums, while faintly, from the distance, strains of martial music are wafted to my ear by the gentlest of zephyrs. (But im homesick, so homesick) G N.\n","113":" Parade yest’y of men for light duty. Permanent orderlies going to front. Fruit on now; bought pears yest’y. Nurses here are A1. & Dr is OK.\n","114":" Feeling better but ricked ankle. App’t Typist AMC Went Cairo got belt etc. Band in gardens at night\n\nSunday\n","115":" Feeling off. Too much walking yesterday. Start duty today. Took Communion yest’y (Sunday) Minister photographed us afterwards. Off at 6 pm, doing fair but lot to learn. Col’ is fine but don’t like W.O.\n","116":" Cairo last night. Got \"Pittmans Shorthand\". Feeling alright – \"Nervy\"\n\n14 Started on shorthand fair amt of work. Off at 9 pm did fairly well\n","117":" Feeling A1. Batch chaps going Aust’ Tm’w. fairly busy today. Still feeling lonely. Wrote several letters\n","118":" Would like be going with chaps who are getting ready for Australia. Bad dream last night – plenty work today.\n","119":" Still little dysentery. Fairly busy in office Slept well. Not many patients here now. –\n","120":" End of week plenty work on till 8.30 pm. Not too good. Rather \nlike\n bed now.\n","121":" O K. Shave this morning. Must see Dentist. Will try get off for Communion at 9.30 A chap works 7 days a week in Military, but gets paid for it. Would sooner not work, & forfeit the extra pay – Went to Communion (Methodist) also went Sunday \n\n19 Spt 1915\n\ngeneral Service (CE) at 8.30\n","122":" More patients by train last night. Have a nice new bed now – spring- mattress. Toil fairly plentiful. ½ piastre left. How will I invest it?\n","123":" Slept soundly on top of bed. Nurse came & covered me with a blanket I was too tired apparently to get into bed. Many cases rupture here. Our Surgeon Capt Teague is excellent. Has not lost a case yet at this Hospital. Off duty at 2 pm today Having a rest just by way of a change.\n","124":" Bad night. One of patients came in shickered – Went Dr yesty got medicine. Ordered back to bed today. Feeling weak Pay day today. Drew £4-5\/-. Batch of about 90 new patients came in last night.\n","125":" Bad night Dys worse despite medicine. Taken to milk diet again. Dysentery better. Lying down & taking milk stuff makes all the difference.\n","126":" Feeling A1. Met an old mate of Run this m’ng He’s going to Australia.\n\nLeft at 4.30 pm motor for Mrs Mason’s Villa & arrived a few minutes after. Tea & cakes to no end in the garden arbor,\n inside\n which was lit up with lanterns after dark. Reading & writing rooms with abundance of literature & ping pong etc inside the house. Had fairly good time & left again at 8.30 Jolly cool for pyjamas. On nearing Luna Park the famous water schute stood out plainly in the moonlight. Its a great structure & must have afforded much amusement when in full swing. \n\n \n\n25 Spt 1915\n\nAnother cool morning. Large percentage of eggs for breakfast are rotten (Not too good.) Several operations lately. Rupture & appendicitis all patients doing well.\n\n26 New Orderlies on now so tucker slow in coming – Colonel told me have good spell, & take things easy when I return to Office – May not return to Office at all – all depends; – Glorious music this afternoon, piano, 2 Violins & flute - Rec’d letter from Mrs Robson dated","127":" – 1st since l’vg Gallipoli. ","128":"\n","129":" Had good night. Didn’t go Church yest’y – Felt not well enough. \n\nSpending about 1\/6 per day. Must go easier.\n","130":" Nurse wont let me go out for meals, altho’ I feel OK. Getting colder every day. Cool inside \n\n28 \n\nearly in morning. My friend A R Tait still Missing. – All pleased to read of great victory in France.\n","131":" Dull – cool weather. Just like a cloudy winters morning in Australia. Reading Lord Lyttons works & doing a little short-hand. Rumours of fighting Gallipoli\n","132":" Had 5 fillings put in on Tuesday in 45 min’s. Only small holes mostly – Excellent appetite of late. Another recurrence dysentery. D—it. Dont think I will return to Office\n","133":" Shower makes one feel tip top. Must write Eric. Number chaps leaving for Alexandria. Dys gone.\n\n2 Some wounded came in last night. Heard Narrows were rushed.\n","134":" – 15\n\nNothing in papers though Australian papers to no end \nyes\n today but the Bulletin is the only one I got any satisfaction from.\n","135":" Rather heavy mist this morning. Winter’s commenced alright. Didnt go Church. Much too tired. 2 Malingers here from Australia –\n\n \nSunday\n","136":" Another fog. Everything damp. Slept for 11 hours. Not bad going, Dr says I can leave – when i’m strong enough.\n","137":" Big batch patients last night mostly sick men some reckon the betting is 15 to 1 Constant, before 15th inst – others say there’s nothing doing. Concert Y.M.C.A last night. More patients tonight only few wounded.\n\n"}}