{"Document Name":{"0":"Diary_0023","1":"Diary_0023","2":"Diary_0023","3":"Diary_0023","4":"Diary_0023","5":"Diary_0023","6":"Diary_0023","7":"Diary_0023","8":"Diary_0023","9":"Diary_0023","10":"Diary_0023","11":"Diary_0023","12":"Diary_0023","13":"Diary_0023","14":"Diary_0023","15":"Diary_0023","16":"Diary_0023","17":"Diary_0023","18":"Diary_0023","19":"Diary_0023","20":"Diary_0023","21":"Diary_0023","22":"Diary_0023","23":"Diary_0023","24":"Diary_0023","25":"Diary_0023","26":"Diary_0023","27":"Diary_0023","28":"Diary_0023","29":"Diary_0023","30":"Diary_0023","31":"Diary_0023","32":"Diary_0023","33":"Diary_0023","34":"Diary_0023","35":"Diary_0023","36":"Diary_0023","37":"Diary_0023","38":"Diary_0023","39":"Diary_0023","40":"Diary_0023","41":"Diary_0023","42":"Diary_0023","43":"Diary_0023","44":"Diary_0023","45":"Diary_0023","46":"Diary_0023","47":"Diary_0023","48":"Diary_0023","49":"Diary_0023","50":"Diary_0023","51":"Diary_0023","52":"Diary_0023","53":"Diary_0023","54":"Diary_0023","55":"Diary_0023","56":"Diary_0023","57":"Diary_0023","58":"Diary_0023","59":"Diary_0023","60":"Diary_0023","61":"Diary_0023","62":"Diary_0023","63":"Diary_0023","64":"Diary_0023","65":"Diary_0023","66":"Diary_0023","67":"Diary_0023","68":"Diary_0023","69":"Diary_0023","70":"Diary_0023","71":"Diary_0023","72":"Diary_0023","73":"Diary_0023","74":"Diary_0023","75":"Diary_0023","76":"Diary_0023","77":"Diary_0023","78":"Diary_0023","79":"Diary_0023","80":"Diary_0023","81":"Diary_0023","82":"Diary_0023","83":"Diary_0023","84":"Diary_0023","85":"Diary_0023","86":"Diary_0023","87":"Diary_0023","88":"Diary_0023","89":"Diary_0023","90":"Diary_0023","91":"Diary_0023","92":"Diary_0023","93":"Diary_0023","94":"Diary_0023","95":"Diary_0023","96":"Diary_0023","97":"Diary_0023","98":"Diary_0023","99":"Diary_0023","100":"Diary_0023","101":"Diary_0023","102":"Diary_0023","103":"Diary_0023","104":"Diary_0023","105":"Diary_0023","106":"Diary_0023","107":"Diary_0023","108":"Diary_0023","109":"Diary_0023","110":"Diary_0023","111":"Diary_0023","112":"Diary_0023","113":"Diary_0023","114":"Diary_0023","115":"Diary_0023","116":"Diary_0023","117":"Diary_0023","118":"Diary_0023","119":"Diary_0023","120":"Diary_0023","121":"Diary_0023","122":"Diary_0023","123":"Diary_0023","124":"Diary_0023","125":"Diary_0023","126":"Diary_0023","127":"Diary_0023","128":"Diary_0023","129":"Diary_0023","130":"Diary_0023"},"Date":{"0":"unknown","1":1203.0,"2":1204.0,"3":1205.0,"4":1209.0,"5":1210.0,"6":1211.0,"7":1237.0,"8":1238.0,"9":1239.0,"10":1240.0,"11":1241.0,"12":1242.0,"13":1243.0,"14":1244.0,"15":1245.0,"16":1246.0,"17":1257.0,"18":1258.0,"19":1259.0,"20":1260.0,"21":1261.0,"22":1262.0,"23":1263.0,"24":1264.0,"25":1265.0,"26":1266.0,"27":1267.0,"28":1268.0,"29":1269.0,"30":1270.0,"31":1271.0,"32":1272.0,"33":1273.0,"34":1274.0,"35":1275.0,"36":1276.0,"37":1277.0,"38":1278.0,"39":1279.0,"40":1280.0,"41":1281.0,"42":1282.0,"43":1283.0,"44":1284.0,"45":1285.0,"46":1287.0,"47":1288.0,"48":1289.0,"49":1290.0,"50":1291.0,"51":1292.0,"52":1293.0,"53":1294.0,"54":1295.0,"55":1296.0,"56":1297.0,"57":1298.0,"58":1299.0,"59":1300.0,"60":1302.0,"61":1303.0,"62":1304.0,"63":1305.0,"64":1306.0,"65":1307.0,"66":1308.0,"67":1309.0,"68":1310.0,"69":1311.0,"70":1312.0,"71":1313.0,"72":1314.0,"73":1315.0,"74":1316.0,"75":1317.0,"76":1318.0,"77":1319.0,"78":1320.0,"79":1321.0,"80":1322.0,"81":1323.0,"82":1324.0,"83":1325.0,"84":1326.0,"85":1327.0,"86":1328.0,"87":1329.0,"88":1330.0,"89":1331.0,"90":1332.0,"91":1333.0,"92":1334.0,"93":1335.0,"94":1336.0,"95":1337.0,"96":1338.0,"97":1339.0,"98":1340.0,"99":1341.0,"100":1342.0,"101":1344.0,"102":1345.0,"103":1346.0,"104":1347.0,"105":1348.0,"106":1349.0,"107":1350.0,"108":1351.0,"109":1352.0,"110":1353.0,"111":1354.0,"112":1355.0,"113":1356.0,"114":1357.0,"115":1358.0,"116":1359.0,"117":1360.0,"118":1361.0,"119":1362.0,"120":1363.0,"121":1364.0,"122":1365.0,"123":1366.0,"124":1367.0,"125":1368.0,"126":1369.0,"127":1370.0,"128":1371.0,"129":1372.0,"130":1373.0},"Entry":{"0":"\n\n","1":" Most of the Sergts woke this morning with a sore head after last night's revelry, it was very pronounced at the breakfast table for only an odd one or two could eat anything, we had to rise early too & that made it worse orders\" were that the Batt had to move off at 8 o'clock & breakfast was late & everything upside down, but the weather came to our rescue for snow and rain started to fall heavily & the parade was cancelled, but all the N.C.Os had to attend a lecture by the Capt on the new method of attack & after this we discussed various little points brought up by the N.C.O.'s\n\nIn the afternoon we went for a route march & hit the Main road & all along there were gangs of German prisoners working repairing the road & etc, one of the men in my platoon had a couple of ribbons of the Germans, a first class & a second of the Iron Cross & these he showed to Germans here & there, they recognized them at once you would have laughed if you could have seen the grabs they made at them.\n","2":" My luck was out last night just as we were leaving our billets I got grabbed for a picquet, we were all going down to Mericourt to see the fight between Mellish of our Transport & Norton of A. Coy. they were fighting for a fair sum aside & they had a big old building which\n\nhad been fixed up by the Australian Comforts Fund, it would hold a couple of thousand I suppose the fight drew a great crowd for it had created a great interest Mellish was a favourite, but Norton won on points after a good fight. My job was to patrol all the streets & café's of Mericourt & see that all the boozers\" were closed at 8 oclock while I was in one estaminet I saw Capt McKenzie & Major Sass & they called me over, hullo Sergt Barwick, Sass said: don't you remember me, as he shook hands; should think so I said you would be hard to forget. he laughed. Major Sass was one of our old original officers & a great cobber of Capt Jackson's our old Coy. Commander.\n\nThe whole Coy went for a bath this morning & we had the band with us It was a lovely morning as \nwh\n we marched out, reached the baths & had a good wash the second in 3 days not bad going, just as we finished it started to snow lightly, it came up very quickly but did not last long.\n\nThe last couple of days we had a list posted up in our mess room & for every time one of us swears in the mess room it is pencilled up & every swear costs a penny, I have two to my name already, but I am not the only one who is going strong, it is a good idea for it keeps bad language down. \n\nThis afternoon we were out manouvering & attacking certain positions which were in the plan, we walked & ran\n\nanything from 3 to 4 miles frightening the life out of the hares & partridges of which there are any amount round here, while the old French farmers sat on their ploughs & I daresay cursed us as we marched across their young crops & ploughed ground but what cared we & away we went I think it must have been done satisfactorily for I have not heard no complaints or lectures about it as yet Am feeling a trifle homesick tonight how I long for this war to end so as I can get a glimpse of dear old Australia again the finest place in all the world & it only seems to grow dearer to us as our absence from it increases, we have been just on a year in France & it seems a long, long one to me surely if we are spared this will\n\nbe our last in this part of the world. Sometimes I think it is hopeless thinking this war will ever end, then again everything seems rosy & bright, it all depends how one is feeling, but just at present I have a fit of the blue's but it wont last long & tomorrow I shall be as optimistic as ever & laugh & feel sorry for what I have written tonight.\n","3":" Out on parade again, this morning we practised another new style of getting our sections into artillery formations, it was a trifle complicated & rather hard to get the hang of it for a while, but after a couple of attempts we dropped on to it & in the end we had it tagged off nicely, about 10 oclock the Brigadier came round & the Capt had a few words with him about the \n\nmornings work, the Captains telling him the faults of the new drill, & I heard the old Brigadier say, \"I don't care a \nDamn\n how you do it so long as you can get your men out quick & in the right formation, he's a character is Leslie & swears like a trooper. Today is the anniversary of our first year in France & a mighty long one to me.\n\nLen came down this morning from Meaulte & he brought me down a fine souvenir in the shape of a jug made from the shell of an 18 pounder.\n\nThis evening the","4":" Battalion played the Brigade Machine Gunners football & beat them easily 26 to 3 we have a very fine team & they will take some\n\nbeating, after they had finished the Tommie's played a game of soccer.\n\nWhile we were out watching the game up came an invitation from the","5":" Battalion officers for the Sergts of the","6":" Battn to come to their concert which they were giving in the big hall at Mericourt, & that they were saving seats for us, but just as we were leaving our billets, down comes Mr Page & informs us that the platoon Sergts have to collect all their mens ammunition, of course we said nothing for all our men were out, down among the café's, boozers & such like attractive places, so we got the S.M. to go over & see the Capt about it, & by the time he got\n\nback it was getting late, however we set off & went down, it wasn't bad, Mervin Blake was about the best of the bunch\n","7":" Turned out early this morning for the Bde stunt was coming off our dress was belt & bayonet only a pretty sensible idea for we had a long way to march nearly to Albert, reached there & had to stand round for nearly an hour there was a bit of fun while we were waiting a big hare jumped up & no matter which way he went he ran into some of the boys, he was doubling this way & that & the whole crowd was running & pelting for their life but he got away in spite of the crowd, after we had waited in artillery formation for nearly an hour\n\nthey started us playing games & etc, this kept things lively & moving until it started to rain & then we all took cover under an old tarpaulin shed, & in here were a lot of German prisoners taking shelter from the heavy falling rain, while in here we started a singing competition this caused a bit of amusement for there was a prize of 10 francs to the winner & this little bait caught a good few. About 12 oclock as it was still raining they called the stunt off & marched home & just about got wet\n","8":" Had a nice little mornings work \"Outpost Company\" this a quiet & decent little job.\n\nRained heavily last night but it cleared up again by dinner\n\n& we went out on parade again but we struck a snag for it hailed heavily & after that rain came down in torrents & we doubled \"home in this & got wet to the skin.\n","9":" Usual parades & Coy drill weather not too promising\n","10":" is round once more & everyone is trying to catch one another & some are succeeding finely. Sent 2 parcels away today one of them with the jug in it.\n\nHad a Bde Church parade this morning but could not hear much as we were too far in the rear.\n\nIn the afternoon the much talked of & looked forward to match between the 1st &","11":" Battns came off, there was a \n\nfair crowd present & it caused great excitement, the match ended in a draw neither sides scoring.\n\n2nd Last night we (the Sergts) had a great bust up, it came about this way, we had just on 800 francs left over from our funds (Sergts Mess) & as there seemed to be no chance of us ever running one again we decided to have a glorious spree & be finished with it, so we got the loan of a small Hall from the Tommies who are here working in the big workshop & invited all the Sergts who had been promoted since we started the Mess, we also had a fair sprinkling of Sergts from the other Battalions, of course\n\ngrog, speeches, & singing were all the go, some of the latter a bit on the rough side too but take it all round she went off finely though a few of them did get mixed up among the pots & pans & etc & more than one Sergt laid there till morning & came home minus hat & overcoats, we had a fair sprinkling of officers present\n\nThis morning General Walker reviewed the Bde. She was a smart turnout & no time was lost for a wonder, the march past of \"Companies in line\" was a treat & it looked splendid to see the solid lines of men with fixed bayonet's striding along, we had a splendid line our Coy. & General Walker could not\n\nsinging out \"Splendid, very good\" so it was, but more by accident than design for a few paces before we reached the saluting point we had a rotten line, but as if by some instinct they all came up together & made a bonzer line. After this we marched home unfixing bayonets while on the march. Just before dinner today I gave Depina a nasty bang, split his lip badly, it was done accidently while sparring & fooling about with the gloves poor Dip\" had to go down to the field Ambulance & get it stitched up, I was sorry for it must be painful but the occurence was purely an accident. Had an inspection of platoons\n\nin full marching order this afternoon & wasn't it cold the wind cut like a knife, shortly after we came in a heavy snowstorm set in & continued for an hour or so, things just at present are very wintrified indeed, & tonight we have only 1 blanket each the other having gone in to ordance for we are moving tomorrow.\n","12":" Rose at the usual time this morning had breakfast & got our platoon blanket's away & the billets cleaned up ready for inspection.\n\nWhile we were waiting for the rest of the Brigade to clear the town we went in & had a cup of coffee & said goodbye to the old French couple, my word they have been good & kind to us every night they used to make coffee for us, lend us plates &\n\ncrockery & etc, gave us the free run of the house & done everything they could to make us comfortable, we offered her 50 francs as a parting gift, but she would not hear of it, wouldn't take money at any price.\n\nIf there had been any place where we could have bought something for her to remember us by, it would not have been so bad, so we had to come away without giving her any thing, though Jack Hayes our Q.M. gave her some sugar, this pleases them more than anything, for sugar is so scarce in France, they are only allowed 1 lb a month per head, they have sugar tickets the old lady showed me her tickets one day, just as we were going the old lady burst into tears, this made us feel pretty awkward so we\n\nsneaked out quietly, but when we were moving off & marching down the street, the old lady was there to see us off.\n\nOur swearing account was also settled up the lot of us brought in something like 15 francs, the penalty was a 1d a word. We had a long & trying march, went through Brueire, Dernacourt & Meaulte, had dinner just outside Fricourt it was cooked on the march, we pulled up in Adelaide Camp, a pretty good camp.\n\nOn the way up we passed some","13":" Bn. men they were sitting on the side of the road boozing & when the Colonel passed they never even saluted him this narked the Colonel & he told the Adjutant to put the Sergeant who was there under arrest, Depina was told off to bring him along\n\nI reckon it served him right, he ought to have known better, & to make it worse just as the Colonel was passing he \"opened a bottle of champagne & it fizzed & bubbled all over the place, & I suppose the Colonel was thirsty & this narked him.\n\nShortly after we lobbed in Camp old Fritz brought down 2 of our balloons we could see them come down in a big flaming mass miles away.\n\nDead funny today with our blankets, it is a rule in the Battn when we roll our blankets to put 10 in each bundle & no more, but a lot of boy's roll their overcoats sheepskins, sheets & etc with the blankets to save carrying them, but tonight instead of issuing the bundles to the platoons, the Q.M. had them all taken into his tent &\n\n& counted, so as he could re-issue them 1 each (which we were supposed to have) to the platoons there was some long faces pulled when they heard of this, for there was a chance of them never seeing their things again, & if they was an inspection & they were short they would have to pay for them, not a very nice prospect.\n","14":"\n","15":" Got up at 5 o'clock this morning & it started to snow heavily at 6. but it never stopped us from moving off, we threw our waterproofs over our shoulders & started off, snow or no snow but it never ceased the whole time we were on the march, & this was 7 hours just imagine if you can the men toiling along hour after hour sometimes on duckboards & then again on \n\nwet & boggy ground slippery as banana skin & the snow coming down thick as rain, but the men never grumbled but stuck it like Britons, it was very interesting once we reached old Fritz's trench where he started his evacuation from, our guns played havoc with him alright, as the dead horses torn up & battered roads all too plainly showed, once we crossed the Guedecourt line we soon reached Bazancourt once a beautiful little village now only a mass of ruins & dead & battered trees, continuing on we struck a pretty good road & followed this we struck the open & green country what a relief from the torn & battered fields further back possibly the most shattered & shell torn land\n\nland this world has ever seen, it seemed very funny to me getting on the green & open country, after living so long among the mud & slush with never a sign of green, nothing but miles of dreary mud & shell holes disfiguring the land coming to the next village \"Ville de Flosse\" we saw the work of the Hun in its worst form, every house no matter what it was like was absolutely smashed, the church must have been \"mined\" for it could never have been so completely destroyed, a few of the little \"images\" escaped destruction & these the Huns put sticks in their hands & plastered mud all over them to show their dirty spite, one of the worst acts I reckon was the way in which they destroyed all fruit trees\n\n& vines, this I reckon was needless for they are of no military importance it seemed a shame to see the lovely fruit trees laying about all dead just close handy here there had been at one time a great big chateau & before leaving the Germans blew it absolutely to pieces old church & all cut all the fruit trees down, pulled up his rare & lovely vines & creepers I saw this myself & my blood almost boiled at the wanton destruction, I believe the owner got permission from the British as soon as they were driven out to come & have a look at his mansion, I believe he said he did not mind them destroying his house & etc, but when he saw all his vines & flowers destroyed I believe he cried like a child, people in Australia don't know what war\n\nis thank goodness, if they could only see for themselves some of the destruction they would have their eyes opened I'll bet.\n\nTheres one thing old Fritz left enough barb wire about to fence nearly all France, he had row after row of it stretching for miles little he thought he would have to get out of it so quick.\n","16":" Camped last night in some of old Fritz's dugouts & we were quite comfortable, he even tried to destroy these as the blackened & half burnt timber showed, must have sprinkled petrol over it, & then put a match to it. It's a bonzer & sunny morning & everything seems tip top, we are moving on again this afternoon for the firing line.\n\nJack Hayes had a streak of bad luck & this morning he was\n\nsent to hospital.\n\nThe aeroplane that brought our 2 balloons down yesterday is lying close here, our anti air craft brought her & another one down.\n","17":" Having filled the other book I now have to fall back on this one, I left it just before I was wounded & filled a smaller one in between as you will read, so you will have to read the smaller book before coming to this.\n\nIt is Sunday morning & I not knowing the difference got up at 6 oclock as usual instead of laying in bed till 7. I could have kicked myself when I found it out for I lost an hours rest Wilkie is going to Hospital this morning so I expect Mills will continue the C.S.M. In one\n\nway I will be pleased for Wilkie like myself knew nothing being a stranger & Mills knows the ropes from A. to Z. he has been here so long.\n\nThey handed in last night from B.O.R. a \"state\" which was the most complicated affair as ever I had time to look at, & there being no S.M. I had to try & puzzle it out, I got quite a sweat up & then never made head nor tail of it & was in consequence \nwas\n 20 min late with my \"parade state\", I didn't give a hang, but they never said nothing, it was supposed to be in by 9 oclock \nwa\n but it was nearer 10 by the time they got it. All our","18":" Reinforcements were medically examined this morning & 1 chap was absent.\n\nThis afternoon I took a stroll down to Amesbury to get a few little snaps I had 1 film left & I walked into the little church to see if I could do anything inside, finding that it was too dull I came out & who do you think I run into, you will never guess so I will tell you why Bill & Les Clark & a chap named Elliott from the Brown Mountain I think he was, you could have knocked me down with a feather I was that taken back, & so were they, I don't notice any difference in them at all only Les has grown a little bigger moustache, had quite a long yarn with them & with my last film I snapped them I don't know how they will come out for it was very dull & just starting to rain\n\nat the time, I was pleased to see them again.\n\nYesterday & today 2 years ago we were having the time of our lives on Gallipoli for it is the","19":" Anniversary of the great attack on the Australians.\n","20":" Had the same old running about this morning, & even then we could not account for all the men. Just as the Orderly Sergts handed their \npar\n \"Tattoo Reports\" in last night a heavy thunderstorm which had been brewing all day broke & we had to run for our lives even then I got fairly wet by the time I reached my \naub\n cubicle the lightening was very vivid but there seemed to be comparitively little thunder, the rain will do a lot of good for the country\n\nsoon dries over here in summer. Theres one thing which I find very peculiar & that is keeping to the left of the roads, I have been that long now following the right of the road both in Egypt & in France that it seems the correct side to me & I always find myself walking on the wrong side over here.\n\nHave decided to buy a little developing plant for my Kodak as it is much cheaper, & there is a chap in here who is going to teach me all he knows about the game, I think it is much more interesting when you can do your own films besides much cheaper.\n","21":" We were Coy. for duty today & had a rotten time trying to dig up enough men to supply the fatigues & Guards, had to use\n\nevery available man \"but orderlies storemen & etc. & then had to borrow a lot from B. Coy.\n\nI have had quite enough of this job, since coming at it I have had scarce a minute to myself & I am first up & last to bed each day so this morning I asked to be relieved of it, I never come over her to have the life worked out of me, I would far sooner go back to France than carry on \"like this.\n\nGot my first mail today 2 letters from Len, I was pleased to get them.\n","22":" This morning I finished the \"Orderly Sergt\" sort of business & how pleased I am, it 10 times better to go out on parade, though this morning I nearly broke my arm fell off the big wooden frame\n\nwe had to go over while doing physical jerks, I must have fallen nearly 20 ft & lobbed on my arm my foot got caught on the top just as I was going over & down I come, Sergt Brooks also hurt his legs, & strange to say Jock's arm went crook on him & the 2 of us got permission to go off parade & see the Dr. he gave us some liniment to rub on the affected parts There was a terrible row this morning our crawling R.S.M. made a \"policeman\" of himself & went round all the huts to see who he could find off parade \"oh he's a crawling B-\". & is hated like poison, he caught 2 of our N.C.O.s & put them both under \"open arrest\" & Sergt Major Mills also for making a false declaration, Mills said all his N.C.O.s\n\nwere on parade, & the rotten swine would not take his word but went round & counted them all, & found 2 short, I'm hanged if I can see what a man wants to make himself so busy for, for there is no benefit to be derived from it only hatred, for the NC.O's always have plenty to do. Tried my new developing plant last night got a few photos out alright, a chap named Adams is teaching me how to manipulate her.\n","23":" Tried a few gaslight prints last night but the paper was very faulty & they were all failures. Devil of a row kicked up yesterday over the N.C.O.s & last night an order\" came out that all N.C.O's had to report at B.O.R. at 6.30. & then had to break off & go back to their lines & march out with the \n\nrest of the men, did you ever hear of anything so ridiculous they treat their NC.O's rotten I reckon & I should not be surprised to see a mutiny here any day, for old Tubby Pearce & the R.S.M. are simply detested by both officers & men, matters are approaching a climax I should think, & something is bound to happen, for there is such a thing as going to far.\n\nGeneral Sloane was here visiting us this morning accompanied by the usual crowd of hangers on, I wonder if it is necessary when a General comes round to be tailed up by a mob of horsemen carrying banners & officers trying to look wise, too much show & pomp altogether about these visits, the biggest part of them should be over in France\n\n\"doing their bit.\"\n","24":" We were a bit more successful last night with our photography got some new paper & it was good stuff & while we were deeply interested in it, we heard an awful howl & a sudden rush & then a sound of many voices, I slipped outside to see what was going on, & what do you think happened, well it was this, by some means or other, the electricity which lights our Camp, got connected on to the barb wire fence which runs along the huts, & it appears the chaps had been amusing themselves by touching it quickly, they liked the sudden sting & the novelty of it I suppose but one more bolder than the rest, got a grip of it, then there was a stink for try as he would he could not let go & the electricity coursed \n\nthrough his body making him feel very funny, when the boys saw what had happened some of them grabbed him & tried to pull him off, at last they succeeded but the barb wire cut his hands terribly & he nearly collapsed when he was got clear of it, lucky he was not killed for it is crook stuff to meddle with, I can tell you they steered clear of the wire for the rest of the evening the whole Camp was affected more or less by this for the wire carried it all over the joint.\n\nThere was scarcely a man on parade this morning so they found an N.C.O.s class & we had bayonet Instruction all the morning I can tell you my bones & every muscle in my body is aching tonight for we have not been used to such\n\nstrenuous work, but it is doing us the world of good & I am feeling in splendid condition already.\n\nAt dinner time I received a few letters one from Stan, he is wounded & wrote from the Hospital at Rouen, I was very pleased to hear from him as I have been worrying as to how he was getting on, in one way he was lucky to be wounded I never sympathis with a wounded man unless of course he is very badly mauled, but otherwise they are the luckiest men alive & see if Stan don't say so.\n\nWe had our bayonet exercise again this afternoon & pretty solid too, at 4.15 we knocked off, for they were going to read out the result of a Court Martial after this was over they dismissed the N.C.O.s & Jock I went down & had a bonza hot bath.\n\nI see by last nights \"orders\" that they are going to send me to Candahar Barracks to a School my luck must be in surely.\n\nTo-night I am Canteen Sergt. my duty is to preserve order & see that it is closed at the proper time, & then I have to report on the Staff parade. I have a Corporal & 6 men with me, they patrol the joint & report anything wrong to me.\n","25":" We were paid this morning & I wanted it badly too for my expenditure had been pretty heavy since coming here what with my camera, developing plant & etc., but it was money well spent.\n\nThis morning I took the \"parade state\" down for the Orderly Sergt\" & while waiting, along comes 3 of those conscientious objectors (N.C.C.) & they\n\nwalked past the Colonel without saluting then Capt Phipps, & then they bumped old Tubby Pearce & the RS.M. they never took the slightest notice of Pearce & as soon as they had passed, the R.S.M. sang out \"halt,\" to them & made them \"about turn\" & walk down past the Guard again, turn round & walk back to salute the officers, he then dressed them down properly, they looked proper fools, there are quite a number of these gentry employed round here & they are a miserable looking crowd, they hold prayer meetings every night, they get a pretty rough time I can tell you for they have all the rough Sergts they can get hold of, & if they say a word, \"bang they get it fair in the mouth, this sort of treatment evidently acts well\n\nfor in one Coy. no less than 50% have joined fighting units since they were formed.\n\nThis afternoon as soon as I had my dinner 2 other chaps & myself set out for \"Wishford\" a village 6 miles away, we were after some snaps & it was a lovely afternoon fairly hot but with a fair breeze blowing, the first place of interest we struck was the old & mysterious ruins of \"Stonehenge\", the ruins are nothing more nor less than a number of huge granite blocks raised on end & on top of some of these pillars there are enormous stones placed to act as beams, the whole show is reckoned to be some where about the year 1300 B.C. & many strange things used to happen within their walls if you\n\nlisten to the \"legends\" that go with it, I had no time to have a proper look today, will leave that to some other time, I took 2 snaps of it & then we pushed on across the plain, every here & there, you will notice great mounds of earth raised up these are the old burial places of the people who run \"Stonehenge\" & are called \"barrows\", there are also a number of circular holes in the ground about 60 ft in width these also belong to that age, it was lovely walking over this grassy plain, putting a hare or some partridges up every here & there, & when we felt inclined we used to have a blow in the shade of the lovely fir trees, & the odour which filled the air from them was\n\nlike the nectar of Gods I just revelled in it, & you should have seen the small flowers such as buttercups, daisies, cowslips & etc they almost coloured the fields, & the turf we were walking on was as springy as could be. We reached Wishford hot & thirsty & after we had taken a few shots we went into an old hotel & had something to eat, how lovely & cool the room was & as old as the hills all the walls were of oak & panelled & as old fashioned as could be, our hostess put before us a good spread, fruit & cream, chops, eggs, home made cake & butter nice milk, bread & tea, & we thoroughly enjoyed it, after this we went out into the lovely little village\n\nthe streets were just a riot of color, with the \"May\" & lilac\" & the scent was beautiful, she is such an old fashioned place & it would do any one the world of good just to see it, with the splendid elms, firs, beeches, poplars & oaks scattered about every where & the grass up to your knees & so green, the river runs right through it. Altogether it is a beautiful old village & nothing would please me more than to spend a week or two there, during the afternoon I got 12 shots out of the camera the walk home was lovely we just took our time & walked slowly home in the cool of the evening, watching the rabbits & hares gambolling about & the birds singing sweetly, & the\n\nscent which came from the wild flowers & trees was glorious, it made me think of home & Spring time in Australia, & from afar off came the notes of the bugles wafted gently to us by a gentle breeze which our- \nbrows\n cooled our brows & made us feel content, & so we gradually reached the Camp thoroughly tired out but satisfied. After reaching Camp I went down & had a good shower, wrote my diary up & then went to bed.\n","26":" Have been real crook all day long, I don't know what is the cause of it perhaps the exertion of yesterday was too much, & that combined with the thundery weather may have upset me, I felt weak all over had a rotten headache & could not eat a single thing.\n\nluckily it was Sunday & I laid in bed all day & it simply poured outside, about 9 oclock in the evening I was still very bad & Wilkie brought me down a hot drink of whisky, I did not like taking it but could scarcely refuse after him going to the trouble of getting it, at any rate it done me some good for I got a bit of sleep that night. I did not want to go to the Dr. for he might have spoilt my chance of going to this School & I want to go badly.\n","27":" Woke up this morning to find it still raining, & I did not go out on the N.C.Os. parade for I still felt crook, but an improvement on yesterday, I could only eat my porridge & slice of bread & butter for breakfast, but this was the first I had eaten for 36 hours, a lot of \n\nthe boys reckon it is the change of food & etc that was the cause of it for they said they had the same attacks themselves, when first they came over.\n\nPacked up this morning & reported at B.O.R. at 1300 & walked down to the station at Amesbury where we caught the train, the country looks magnificent after yesterday's heavy rainstorms, all the hedges are snowy white & the fields present a great contrast of colour with the daisies & buttercups in full bloom & horses & cattle feeding contentedly.\n\nWe had to change at Salisbury & then again at Andover for they are all branch lines down this part, the weather has cleared & the sun is trying to shine, but somehow or other it has not got that same clear bright \n\nlight that we have in Australia its more yellowish, pale, & moist. Arrived at Tidworth fairly late & got a car to run a few of us up to \"Candahar\" she is a fine big place & has every convenience.\n","28":" From what I can see of it we have been pooled into an Officers Instruction School, at least that is what the Colonel told us this morning, but he said there was no certainty of a commission out it, but said you might be called upon any time after passing out of here, it appears our names had been forwarded from Battn. Hqrs. unknown to us, however if nothing comes of it, it will do us the world of good, we shall have very little time for ourselves I can see & my notes in diary will have to be cut very short.\n","29":" Lectures up till 4 oclock & then we had the day off, which never meant much for it took us a good while to write our lectures up.\n","30":" This morning I am platoon commander for 4 days have to be pretty slick for we do things in style down here.\n\nLectures all day today will take us till late tonight to catch up, we have fine times here treated like gentlemen & have girls to wait at our tables & ‘orderlies\" to make our beds for us we do nothing in that line, officers & men are practically on a level footing & they treat us as such.\n","31":" Lectures & live bombing today each man threw 2 live bombs & fired 1 rifle grenade\n\nwe were to have gone out on a night stunt but it was put off at the last moment.\n","32":" Full marching order parade this morning & I was platoon Commander, but I managed things alright & it went off smoothly the Colonel inspected us & we marched past him afterwards on the Barrack Square.\n","33":" Went to Church this morning a military Church.\n\nIn the afternoon I went for a stroll took my Kodak & got a few snaps round about Has been a rather nice day. I hear that Colonel Abbott. is camped at Wareham, so I am going to look him up shortly.\n\nHave had a very sore mouth for the last week got a cold\n\n& it broke out on my lips, but it is healing fast now.\n\nHave been writing letters nearly all evening.\n","34":" Lovely today & the sun is shining brilliantly.\n\nA number of old chaps from the Volunteer's arrived here today some of them are nearly 60 years of age.\n","35":" Have been working on Trench tactics all day today, our lecturer Lieut. Barnes is a fine fellow & he nearly brought the whole class to tears this morning by the touching way he spoke of the mere boys who have gone out to the front not knowing what they were up against, he told us he had his 2 brothers killed in France, the whole class were spellbound by the way he told us of the tragedy of \n\nit all & he was very much affected himself & he had to leave the classroom hurriedly, while I don't think but there was a man in there who didn't sorry for him from the bottom of his heart, & we all left the room with a funny feeling, this officer is just idolized by the boy's.\n\nThis afternoon we had a little problem in Trench Raids, my paper got 17 out of a possible 20, 2nd best in the class.\n","36":" Had a lecture on Gas this morning & this afternoon we all had to have practice with our helmets 9\/10 ths of the chaps had never had a helmet on before & it was funny watching them, all the old greybeards were there, very interested & keen as mustard\n\n& they watched closely the different points about them, I was on the flank, & when we got the gas alarm I out & had mine on in a few secs, the old officers were astounded at the ease & speed with which I put it on but can you wonder for I have been so long at it & practice makes perfect, the officers in charge said to me \"have you done this before, I laughed & said \"rather\" the way I said it or something made all the old chaps laugh after this we went through tear\" gas, just to give them an idea of what it is like you should have seen crying all over the place & tears running everywhere.\n","37":" Today we had a day out doing tactical work & planning how to attack & defend positions.\n","38":" This morning all lectures & in the afternoon we each fired 12 rounds per man from Lewis guns out on the range.\n\nTonight we are going out on a bombing stunt, which will Keep us out till about 2 oclock. So you see they have a very practical way of teaching.\n","39":" Well I never laughed so much as I did last night for a long long time.\n\nWe moved off from our Barracks about 10 oclock carrying rifles 10 rounds blank, 2 small bombs each, the majority of the men\n\nwere very excited for this was the first time they had ever taken part in such a thing did not have far to go, & soon we were split into parties & the fun began, it started with our party going first crawling down on our stomachs without rifles, then a series of explosions started (guncotton slabs). some of the boys nearly jumped out of their skins, when we got close enough we started to sling one little puff bombs at them & they returned the compliment, some of the bombs actually fell on us I nearly strangled myself trying to choke the laughter down, at the antics of some of the chaps when these harmless little things landed near\n\nnear them, after we had thrown our bombs we sneaked back with the rifles popping at us, we then opened fire on them & rockets were sent up by both sides, then the whole lot of us attacked under cover of a smoke bomb barrage when we got to their wire we heaved our bombs in the trench & at the spectators which consisted mainly of old Volunteer Majors & Colonels, they enjoyed the whole thing immensely, as we were laying in front of the wire a bomb landed fair under my nose, I grabbed it & was going to throw it back it just left my hand & burst, scattering powder & dust all over me, it never hurt my hand in the slightest \n\nthat will show you how harmless they were.\n","40":" today & nothing much doing\n","41":" More lectures & schemes again today.\n","42":" Practical schemes & plans worked out this afternoon weather very hot.\n\nWent for a nice walk tonight\n\nLast night they brought some real \"Stilton\" cheese on the table for dinner, talk about stink & hum everyone nearly killed themselves laughing over it, a lot of them had never seen Stilton before & they kept on shouting to take it away they thought it was rotten I had seen the stuff before but was never game enough to try it, but I plucked up courage this time & gave it a \n\ntrial, but never no more, it tasted like a bag of rust & squashed ants horrible stuff, & it was full of mites, Stilton don't appeal to Australians I can tell you & I don't think it will grace our tables again in a hurry, the English couldn't make out why we detested it they thought it just the thing.\n","43":" Half holiay this afternoon & I went strolling round as usual got a few nice snaps & just scraped out of a row with the \"red caps\" nice amiable chaps these \"red caps\".\n\nSaw Les Clark this afternoon he had been down this way on a funeral by Jove he looks a hard case does old Les.\n\nHad a General round inspecting today so everything has been turned upside down to get it clean\n\nGot a letter from home today dated on Xmas Day, so that has been delayed somewhat. Fairly hot today, the country wants rain badly.\n","44":" Night operation's last night & with packs up officers & all we were the defending force & wore white bands round our caps. They put me in charge of a section & Curran","45":" Battn. the other we had about 20 men apiece & had to use them as if they were a Coy. we marched about 2 miles to the position we had to take up just past the viaduct, on the road leading to \"Perham Downs\" got our men in to position & sent patrols out, about 9.30, the patrols reported the enemy & soon the fight began, they\n\nattacked my right flank in force but never got through our fire was too hot & the men placed as it happened in the right joint before the attack began a whole crowd of people collected round us to see the fun, motor cars & all were there, how some of the women screamed when the blanks began to go off, I don't know what they would do if they heard the real thing.\n\nAfter it was all over we marched back again, & this morning there was a discussion on last nights operation in the Y.M.C.A., after both the defence attacking force had spoken, the verdict was given to the defenders, the Colonel reckoned my force had wiped them out, (a \"feather in my cap\")\n\nThis afternoon we had an open air concert & Y.M.C.A. flag day & as you know this was the first time I had ever had the opportunity of buying a flag, sounds funny after nearly 3 years of war, but as you know I have always been in the thick of it & never even saw such a thing before Lena Ashwells party gave the concert in \"Candahars\" ground & we had a fine band & all there it was a lovely afternoon & I think everyone thoroughly enjoyed themselves, & at 7 oclock tonight the Australian Band is going to give a concert.\n","46":" Walked over to Perham Downs to see Bellchambers for I heard that he had just arrived from Hospital, he was glad\n\nto see me, Bell & I got wounded the same night at Doigues & I never saw him after we reached Rouen, we yarned all the afternoon. I had tea in the Sergts Mess & then we went & had a look at Sergt Howard, it was the first time I had seen Guildford since Pozeries, he got a bad wound there, & in the cool of the evening they walked back to Candahar with me.\n\nFairly hot today & very moist\n","47":" Hell of stink last night over a little incident that happened at our table, some few days ago we were talking among ourselves about buying Annie that is the girl who waits on our table a little present, as she was leaving shortly, & had looked \n\nafter us splendidly & besides she was a very decent girl, well we let it go at that, & last night one of the boys was talking to Annie, & she said \"who have I got to thank for this & she pulled a small brooch out, well the chap did not know what she was driving at so he asked her to explain, she said last night when she was clearing the plates away she found this little brooch with a note under one of the plates, & 2 names on it, things were getting interesting so the chap said who were the names & she told him, it appears they had between them bought her this brooch & never said a word about it to us, you can imagine how we felt, for Annie naturally thought that they were the only 2 who \n\nappreciated her services, & it also seemed that we had no money for we were joking about being broke only a couple of day's ago, however we all told them off, so they know what we think about them now.\n\nA new lot of recruits came in today.\n","48":" Last night we were out steering our way by compass & it was a pretty mix up, we had 4 different \"bearings\" to steer by & all got hopelessly tangled up our little party finished up in a potato field easily 200 yards from where we should have been but we were not the only ones it took a good couple of hours to collect the different parties & it was easily 12 by the time we got back.\n\nThis morning we were all out map reading & sketching & again in the afternoon, this class of work is very interesting. I hear tonight that the Yank's & Australians had a big fight in London, & the girls chucked in their lot with our fellows, from what I can gather the Yanks were chucking off at the English girls, & they appealed to the Australians, who by the way would want very little persuasion from what I have seen of them, I can just imagine our chaps dodging up the street just spoiling for a fight, it would be fair into their hands, as the crews of the \"Tennessee\" at Alexandria remember well, the riot ended up in a victory for our chaps, after a great struggle\n\nin the streets, I'll bet this will be the talk of London for a while, but I can see many more such rows & kick ups, for both the Yanks & Australians are high spirited & will stop at nothing, & when they get to France they will be the best of mates while in the trenches, & knock one anothers heads off out of them.\n","49":" Took a few films down to get them developed as I have no chance of doing them myself, on my way back I went over & had a look at a stack they were building in the paddock, it was loose hay, & they were using an elevator to get it up while there I gave them a hand for a while & done a bit of pitching, the old cocky seemed surprised that a soldier could do this class of work\n\nI think I rather surprised them by my pitching powers, but little did they think, that I had done a fair share of it, long before joining the Forces.\n","50":" Today we have been doing musketry fire orders & etc. practical work done on minature range.\n\nThis afternoon we went out doing revolver shooting & it rained fairly heavily, I scored 21 out of a possible 30 & 12 out of 15 at the running man, second highest score, with a total of 33, then after that we were on the \"range finder\".\n","51":" Out on the revolver range again today, I must be improving for I got 13 out of a possible 15, we had to fire 1 shot at 10 yds then run up to within 5yds & fire the remaining 5 in 7 secs\n\nthe target is a very small one & not so easily hit, as it looks.\n\nNight operations were on last night again & they were the usual farce, they are most amusing to any one who has seen the real thing, some of the new men take it in real earnest, while some get very excited & do all sorts of ridiculous things.\n","52":" Lectures all the morning the officers used to pick out men here & there & ask them to get up & talk to the rest, not a very nice feeling the first time you are called out.\n\nWoodward was very drunk last night, & we had a job to keep him out of trouble while at dinner, he would insist on singing out, but the hum of \n\nof voices drowned it.\n","53":" Very dull & overcast this afternoon Keig & I walked to Ludgershall\" a little village nesting in a clump of trees about 3 miles from here.\n\nThere is a chance of us going on to France when we leave this school, it is the rule they tell me, however it won't trouble me much for in one way I would just as soon be back in France among the boy's.\n\nThe whole of this camp, that is the Barracks have Indian names such as \"Aliwal.\" Mooltan, Assaye\", Kandahar, \"Bhurtpore\" Jelhalabad\" Lucknow, Delhi, & so on, they are all fine buildings & they are supposed to be the finest Barracks in the world.\n","54":" Nice & sunny today a change after yesterday, we are on the last week of our Instruction now time flies alright.\n","55":" Curran came home absolutely helpless last night, he was carried & dragged back by Woodward who was very little better himself, they both had been drinking heavily all day, it's a wonder how they managed to keep out of trouble, Curran is a terrible fool with money, a couple of days ago he drew a good sum, & gave me a fair bit to hold for him so as he would not spend it all at once, I can't imagine anyone like that, not having a will of his own. We have been on Field Engineering all the morning & it is a very interesting subject.\n\nI heard this morning that we are the last Australians who will attend this School, as the Americans are going to be sent here for training.\n","56":" This morning I had to go to the Dr with a bad boil which I have just over my temple, it is very painful & my eye is nearly closed up, the Dr. ran a hot needle through it & squeezed the blood out, but it done no good for it is worse tonight & much bigger, very unpleasant. Done a bit of practical work this morning in the trenches, they have a rather good set of them here. This evening we were on \"night operations\" & it was the usual farce, everyone refusing to be killed, there they were on their knees not more than 10 yards\n\ndistant shooting at one another for all they were worth, tonight it was officers versus N.C.O.s. who won I have no idea, but I suppose there will be the usual confab over it in the morning.\n","57":" Have been waiting all day long in the Hospital today for the surgeon to come along & knife my boil which he did about 6 oclock in the evening she is a very bad boil & has completely closed my left eye & very painful but I hope it will soon be over now, I lost an important days lectures over it, & don't want to lose my 3 days leave, struck a very nice nurse & we had quite a long yarn she was English but knew a good bit of the \n\npart of N.S.W. as I did, she has travelled a good deal.\n","58":" \"Guest night\" & a big dinner with all the pomp & ceremony of military dinners, we all drank the Kings health when the President proposed it, plenty of wine nuts etc. My boil still very sore this morning & I had to go down, the nurses fixed it up by pressing nearly all the black blood out of it, & this afternoon it feels much easier it wants to for I got no sleep last night, it was very painful, I have to go down to the hospital 3 times daily until further notice, the Dr. said it was a very nasty boil & in a bad place, close to the nerves. Rained heavily all night & today it is cold & bleak\n\nwith water laying everywhere. We gave the girl that has waited on our table a little present last night a nice little wristlet watch, & she was overjoyed with it, but she deserved it for she has looked after us splendidly, & tomorrow she is leaving these Barracks, her time having expired, they signed on for these War Services the same as soldiers, only not for duration & 4 months afterwards, they draw the same pay & rations as Tommies, they don't get the same food as we do down here, they have to have their rations most unfair I think, though there are two ways of looking at it.\n","59":" My boil is getting on fine. I was to have it dressed twice daily & it stings a bit then, you have\n\nno idea the size of it nearly as big as a small saucer.\n\nLast of lectures this morning & we also had our revolver shooting finished, I shot pretty well again in spite of being handicapped by the bad face, I am well up towards the top of the list. Saw a good cricket match this afternoon between a crack English team & an Australian eleven our boys won easily, gave them a shock I can tell you.\n\nWe also had a cricket match at Candahar, we (the Cadets) had afternoon tea on the lawn, we are some toffs here alright whenever concerts are on we have seats reserved for us, & etc. All our copy books are to be called in tomorrow, there was some\n\nqueer looks on the boys faces when they read this, half of them have scarcely a line written.\n","60":" & very quiet did not go to church this morning on account of my boil.\n","61":" Examination today & we have been going for our lives, theres not many will get a pass I bet for all the questions have been altered this time, & we have nothing at all to go on, besides Candahar has the name of being the hardest School at present in England, worse even than Oxford.\n\nThe way they did it every man had a seat numbered & sat a yard apart, a certain time was allowed for each subject, & you had \n\nto stop when time was up, anyone caught cribbing or who brought notes into the room would be disqualified no one was allowed to whisper even & a couple of officers marched up & down the room constantly. After each subject the papers were collected, & we all went out of the room for 15 or 20 mins then came back & started again we started at 9 A.M. & finished at 6.30 P.M. so you can see we were kept going, we were all very glad when it was finished & some of the questions were very hard.\n\nHave got another boil fair on my throat, I'm unlucky with these pests, they reckon these 3 day's leave from here\n\ninterfere with our 10 days which we will get shortly, so if they do I'm not having none from here.\n\n2nd. Today the Fragments from France opened the rest of their eyes in the Scouting, we started off 5 in a party at 10 mins interval, & we had to steer our way about by compass & scout signs, it was done something like this, we got to our starting point which was an electric telegraph pole & took our first bearing of 186 degrees this extended for 241 yards then we took another bearing of 75 degrees & stepped out another 140 yards, then if we were right we found our instructions in a concealed place, they were all in a big\n\nenvelope which contained an envelope numbered for each party, from these envelopes we got our instructions & so were able to push on to the next one, there were 10 all told & for the last 2 we had to travel nearly 3 miles partly by compass & partly by scout signs, such as arrows, bits of tied twigs blazed trees & etc. we done the whole trip nearly 5 miles in 2 hours & 7 mins, almost a record time for the School, the only one to beat it was Colonel Begbie & he knew where all the papers were he done it in an hour & ¾, but that was a long time ago, & I'll bet our time will take some lowering.\n\nwe never had a single check but went straight on, hot on the trail as a hound, none of the other parties got near our time what a shock they got.\n\nI have just about decided I will not go on \"leave\" my boils are too crook & I have another beauty fair on the corner of my mouth & it is very painful & keeps me awake of a night.\n","62":" We were all out on a Billeting Scheme today & it rained like blazes, had to go to Shipton Bellinger a quaint little old-fashioned village snuggled away among the hills & trees, we all met in the Soldiers Home when we had completed our plans & the officer discussed the schemes\n\nAfter that we raced home, across \na\n country & done the trip in 20 mins arriving home wet to the skin with rain & sweat, but a good wash altered things & after that dinner, & the rest of the afternoon off. I don't know now whether I will have to go without my leave, for the boil broke this morning & things feel quite easy tonight.\n\nSent a packet of snaps off to Miss Duke this afternoon & 2 of my diaries home.\n","63":" Not much doing today out it is nice & fine.\n","64":" Today we had a defence scheme to work out, this did not take us long.\n\nIn the afternoon 4 of us took our gear over to Larkhill\", save us carrying it about with us\n\nwhile on leave, the run round was beautiful for the country looked fine after the nice rains & it was a lovely evening, & everything so peaceful & quiet you would never think that there was such a thing as a war raging within a few hundred miles.\n\nWe must have been Jonahs for I'm hanged if we did not have 2 blowouts both in the same wheel, just before reaching Larkhill & the other just as we got to Candahar.\n\nSaw old Jock, MacKillop & a few of the boy's.\n\nThis evening while strolling on the verandah hanged if I did not see little Huck a Frenchman, & a fine little\n\nsoldier he is in the 53rd & was badly wounded at Fleurbaix.\n","65":" What a glorious morning we have had, the whole platoon went out to a spot pointed out to us on our maps which we found easily, had to work out a bivouac scheme which did not take us long, & after this we went cycling all over the place visited a lot of little quiet peaceful villages, where we startled the people as we raced through the streets\" hell for leather\" you might guess what it would be like 40 odd young & strong chaps in the pink of condition all racing one another for their lives, it was a beautiful day, & the old English lanes looked almost perfect\n\nwe rode nearly into Marlborough & passed through a lot of villages such as Ludgershall, Collingbourne Ducis, Collingbourne Kingston, Everleig, N. Tidworh Shipton Bellinger, & a few more, I got a lot of snaps, especially at one school there was a rare crowd of kiddies there & they thoroughly enjoyed the joke.\n\nAt 1.30 we all met at Hougoumount Farm, & there the officer discussed the plans.\n\nWe finished up by racing home the 3 miles in 8 mins that's good going & I was among the first home 3 of us finished neck & neck after a desperate race but the roads were lovely & it was a real pleasure riding this was the first time with the \n\n(exception of the time I rode from Poperinghe to Woodcote Farm, just outside Ypres.) that I had been on a bicycle since leaving Tasmania & that's a fair while ago. The examination results came out this afternoon & to my surprise I got 69 just 1 off \"Very good or first class\" there was no one more surprised than I am over it, I never expected it, for this is the first school you might say I have ever been to & besides it is a very hard one to pass, some of the skites & windbags have got a terrible shock I can assure you, I am 33 on the list out of over a hundred men, of which nearly every one of them\n\nhave been to Schools previous to this, you have no idea of the amount of new stuff we had to learn especially in theory for we never had the slightest chance of getting it previous to this.\n\nI have the satisfaction of heading the list for the","66":" B. so I am well satisfied, even if it is only to know that a chap is not quite so stupid as he thought he was.\n\nThis evening before we left \"Candahar\" the Colonel had us all in \nhis\n one of the big dining rooms & gave us a farewell speech & plenty of good sound advice, & when he had finished he shook hands & asked your name & Battalion of every man as he passed out through the door, & outside Major Marians was waiting & he done the same to all\n\nof his old platoon, after this we rushed down to the station & caught the London train, where we arrived that same night at 11.30 had to walk then from \"Waterloo\" to Regent St where we stopped the night at Peel House, next morning we rose fairly early & taxied down to \"Victoria\" to catch the South Coast train, & while we were waiting over came the German aeroplanes, they were in splendid formation something like the head of an arrow, & took not the slightest notice of either the guns or our aeroplanes which were swarming round them on, on they came, & every now & then we could hear a dull heavy boom, these were the\n\nbombs they were dropping, it was the fun of the world to see the people getting for lives, these were the excitable & cold feet lot you could not see their heels for dust as they raced round the corners & made for the safety of the ‘tubes', these must have been crowded, all the traffic was suspended for nearly an hour, they seemed to do as they liked & cruised all over London picking their spots they were giant planes they were using (\"Gothas\") & to try & fight these monsters with the little scouts we were using, well it was ridiculous, there is going to be a big row over this ‘raid' & some of the heads are going to cop it & so they should, England is slowly waking up to the \n\nfact that because a man has a big handle to his name & has bags of money, that he is the one to manage things, & is always put in power, this sort of thing is changing fast & public opinion is rapidly changing & soon all these \"Noodles & incompetents will be scrapped & so they should, theres hardly a thing that they can look back upon with pride that they have done in this war, just for instance look at \"Gallipoli\" Mesopotamia\" these air raids the muddle of the Food Controllers & scores of other things, why its enough to make a man sick when he thinks of them even, there is growing indignation throughout England over these things, &\n\nshould not be surprised to see anything happen.\n","67":" Down at Littlehampton again & having a good time on the beach, nearly got run in through taking snap shots of the beach & harbour, but wriggled out of it neatly, the beach is crowded nearly all people from London, a lot of them have rushed down since the raid, got a bit of a fright I expect\n","68":" Mr Duke & I went to Arundel Castle & Park this evening & strolled all through them the grounds are very beautiful & full of deer.\n\nRan up to London later on & saw some of the havoc caused by the raid, not as much damage done as you would expect to see\n\nwherever these bombs dropped there was a heavy coating of yellowish powder.\n\nMet a lot of the boys \"at Waterloo\" & we returned together reaching Amesbury at 11 oclock that night, & by midnight I was in bed thoroughly tired out.\n","69":" Medical examination this morning after returning from the School, have not been on parade yet am fixing up my cubicle.\n\nYesterday I met quite a number of chaps whom I knew, a couple of them were out of my old platoon one of them had his leg off.\n\nSaw Stewart this morning he went back to Australia just after Lone Pine\" & has come back again he used to be in old H. Coy.\n","70":" There has been great ructious today. I was supposed to take a party of 6 men to join the other Coy's in a route march, I had an early breakfast & as I was coming up past B.O.R. old Frith the RSM. was standing on the road, he stopped me & asked me what \"orders\" I had received, I told him, so he said when you go up tell your S.M. that everyone will be on parade I turned round to him & said in a surprised tone, \"everyone\" he never answered me but walked up the steps, & as I walked away the clock struck 7, & the men were supposed to be ready at, 7.10. so you can see what kind of a chance they had, for they had never\n\nbeen warned about it & had not even had their breakfast, at any rate I told the S.M. he done his best to get them ready but in spite of all they were 20 mins late when I marched them down to draw their rifles, as I was coming back past the Orderly Room I saw old Frith & the Major standing on the road & they stopped me & wanted to know why we were so late, I referred them to the S.M. & I went off up to our Coy. lines with the men, there they were dismissed for the time for \nU\n we were all too late for the route march.\n\nLater on at 9 oclock we \"fill in\" as usual & went on the parade ground, & put the morning \n\n& when we came back \"Mills\" said he was under arrest for not complying with an order. Just after dinner he went before McGregor & both Frith & I gave evidence, & the best part of it, was that the evidence was very conflicting, Frith swore black & blue that he told me a totally different thing, the lying -, at any rate the case was remanded to the C.O. & I was there as witness, but it never came off for Frith withdrew the charge, we were all very sorry he did not go on with it, for I am sure I could have landed him in a very awkward position, & McGregor was itching for it to go further, for there might have been a chance of \n\ngetting rid of the waster. Have been doing musketry all the afternoon all the N.C.O.s. are on it, but it is only a farce for the Fragments will pay no attention whatsoever.\n\nYesterday afternoon we were not on parade (NCOs) for there was not a single private left in the lines they were all at the range.\n","71":" Had a rotten time today we have been doing musketry all the time, & its dead slow\n\nFairly hot & moist but much cooler tonight\n","72":" Had to go through the gas test this morning, it seems the height of nonsense don't it putting the NCOs from overseas through the gas chamber, after us living\n\namong the stuff so long, but there you are red tape again. Saw Don Fraser over there while we were going through was surprised to see Don. After coming back from our gas test we were supposed to wear our gas helmets for an hour, you can bet we done this, just sat on the forms & waited till the hour was up then done a get for the rest of the morning.\n\nWe were not on parade this afternoon, either Capt McGregor told us to get away out of sight we are a regular nuisance to most of the officers over here, they cant bounce us like they do the reinforcements & NCO.s\n\nSpoilt a film this evening trying to develop it, think I will turn the developing up & do my printing only. \n","73":" Had us all out on Batt. drill this morning, I had plenty to do & was well in the limelight first as a Coy. commander, then platoon, & finally guide to the Battalion.\n\nAfter finishing this hanged if we did not have to go & get inoculated with T.A.B. they run the needle well in, & far enough round so that you could not suck it out without a lot of trouble, this is a great game with all of us after inoculation, sucking the injection out of the arm, but the Drs. are beginning to drop to it.\n\nWas out this afternoon experimenting with my camera, it was a fairly hot day, had a good look over the ancient church at Amesbury, she dates back from the 12th Century & the carving is quite solid in her today, but very peculiar the parson took me over it & explained all its history which is very interesting. \n\nAnother batch of N.C.O.s arrived from France tonight they are sending the boys over now alright. A rather strange thing happened me this afternoon, I was trying to get a good snap of the old church at Amesbury & I was stepping back, keeping my eye on the \"finder\", & not noticising where I was going, when all\n\nof a sudden I tripped & fell backwards over an old grave with no headstone, & grass growing all over it, some chaps who were laying under an old \"yew\" tree remarked that it was a sign of good luck, I had never heard of it before, & just for curiositys sake I'll remember that remark to see what comes of it.\n","74":" Laid in bed fairly late this morning, did not get up till Jock came down to see if I was ready to go down to breakfast. Heavy thunderstorms have been raging all the afternoon & water is running everywhere, I should think it would do the late crops the world of good, the old farmers reckon this is the best season round this \n\npart for years & years.\n\nPlayed \"Bridge\" down in the Mess till just on 9 oclock last night Jock & I towelled them up a treat. Tried some new developer for my prints last night & had a big failure.\n","75":" A small draft left here this morning for France. Jock went to Lyndhurst to the Bombing School, this morning raining like the blazes again & hot & sultry, wish we could get some nice sunny days. Very funny this evening, I had just finished my tea, when some one rushed in breathless & asked for Sergt Barwick, hullo I said whats the trouble \"Whats the trouble he said, well theres old Frith (R.SM) with\n\nthe Quarter Guard waiting for inspection on the parade ground & you are not there, \"what are you talking about I said, I have never been warned for it, so they can go to blazes as far as I am concerned, & I will take my own time for coming out, so I stopped a few minutes longer just to be contrary I suppose then went down to the Guard, of course the whole Camp was watching so unusual a spectacle as a Guard without a Sergt. being inspected, when I get up fairly close old Frith tried to jump down my throat, but this did not succeed, I explained to him & the Orderly Officer that I had never been warned & had been on parade all day, this cleared me for \n\nyou should be warned at least 8 hours before mounting Guard, the blame lay with the S.M. & O Sgt. they had forgotten to warn me. however it ended up in me going up & getting cleaned up & taking the Guard over. I had 10 prisoners 1 of them doing a 2 years sentence.\n\n17th. Commandant paid us a visit today very seldom he turns up, rotten job this Guard I hate it. Last night 12.30 one of the 3rd Battn. corporals rushed round for the Sergt of the Guard to come round & arrest a man who was in the D.Ts it appears he had collared a rifle & let fly at something. I heard the 2 shots, but thought it sounded like a service revolver so did not attach any importance to it, they rushed the chap &\n\nnearly broke his nose, at any rate I handed the job over to the Military police & they brought him round, & I put him under lock & key for the night. At 6 oclock we were relieved by the new Guard & we dismounted & so ended my first Guard at Lark Hill & the 2nd one I had ever done.\n","76":" Saw 3 good fights at our Stadium last night, there must have been a good sitting around enjoying the fun & we had a band playing. Last night the Sergt who relieved me lost a prisoner he escaped through the window at rear, when I was on I pointed out to the Orderly Officer how easy it would be for a \n\nman to get away through these windows, & there is no sentry at the back to see him, stiff luck at any rate for the Sergt.\n\nRaining steadily this morning & early morning parades had to be cancelled, \"what luck.\"\n\nHad to make out a fresh \"Guard Report\" there were, a number of mistakes in the one I handed in to B.O.R. last night, they are very complicated & there is quite a lot of writing & figuring in making them out, this was the first one I had ever made out, they are only used on Regimental Guards & such like work, I never saw one while I was in France the Sergt. wants a clerk when he has got these cursed things to make up\n\n19th. Received my \"certificate\" from \"Candahar\" last night. Rained like the blazes yesterday afternoon but luckily the party I had were in a big hut receiving instructions on Gas, after this was finished I marched them into another hut in our Coy lines for musketry, but there were \"no instructors\" to be had they having all gone up to Group Hqrs to see the musketry officer to air their fancied grievances so the S.M. said to me, you can give them anything you like, this will do me I said so I told all the men that if they behaved themselves & kept quiet they could all go to sleep if they liked, for I was not going to trouble them, unless\n\nthey kicked up a row, this suited the lads so the rest of the afternoon was easily put in.\n\nEarly breakfast this morning for the Coy's were all going route marching, fortunately I have missed it.\n\nOh what a \"gutser\" all the poor fragments came this morning, it happened this way, we were all given a squad to drill, & off we started, I was marching mine well away from old \"Tubby Pearce\" the old swine, but Tubby was after my scalp & he followed me up, when I halted the men there he was, standing there waiting for some little thing to turn up so as he could make it the excuse for jumping down my throat, at last he got\n\nan opening, & he says to me, Where did you come from.\" France I said & put a big emphasis on France.\n\nHow long have you been across, \"9 weeks.\"\n\nWhere have you been all the time\".\n\n6 weeks at Candahar.\n\nOh have you, & how did you get on\n\nScraped through alright I said\n\nWell he said let me see you drill those men, alright I said, & off I started, wonderful to say he found no fault the rotten old swine, about ½ an hour afterwards I was talking to Mr Grey a 4th Battalion officer when old Tubby rushes up, & says to me \"is that how you speak to an officer, I wondered what he was driv\n\ning at, so I said yes, oh is it he says & how do you make that out, then it suddenly dawned upon me that I was standing just naturally as anyone would & I was just tapping my leg with the cane. Well I said its this way in France it is customary when you speak to an officer to come to attention & after a few secs relax the muscles & stand easy so I can't see where I am wrong \"Look here in future when you are talking to an officer in this Camp you stand to attention & whats more carry that cane in the proper place & stop slapping your leg with it, & you Mr Grey see that it is carried out,\" when he had\n\ngone Mr Grey said to me \"what do you think of the _ _ _ _ B. I told him what I thought of him & needless to say it was unprintable, he is a rotten stinking old swine & everyone officers & all hate him he is known for a squib in his own Battn","77":" & every NCO. that comes across from France he does all he can to annoy them, this morning he paid all the ‘fragments\" a visit & towelled the lot up, you should have heard the boys after the parade was dismissed such language you never heard before I'll bet. (very picturesque).\n\nHad an easy afternoon the party I took out went trench digging & sandbagging\n\nHad my letter to Harry Kelly returned today too much information of our unit or something like that was the cause of it.\n","78":" Missed early morning parade & chanced it.\n\nHad charge of a big party who were going over to the Gas chamber, made this job do for the mornings work.\n\nThe late rains have done all the Camp vegetables the world of good, especially the potatoes & turnips, wherever you go over here you will run across little plots of land between the huts & such places all growing vegetables & etc, it is a good idea & will save an immense quantity of food, this is the result of the U. boat campaign\n\nThis morning I was watching some German prisoners who were wheeling trucks on a small line, helping make a road, they were taking it very easy, but the thing that struck me most was that on all their trucks they had U45. U9999. & so on, every truck they had got a U chalked up & numbered you can't convince them against the power of their submarines all their tapes, measuring instruments & etc are painted red yellow & black their national colours, this makes some of our fellows wild to see this. This afternoon a big party of us pitched about 50 tents for we are expecting a pretty big draft of reinforcements \n\n& according to regulations they have to live in tents for a week after coming from Australia with the idea of hardening them I suppose, though I fail to see where it will do them much good, old Tubby was there while the tents were going up, he was quite chatty to me, but I kept my eye on him I wouldn't trust him as far as I could sling him at present. Since we have come across from France, the Camp has been split into 2 distinct groups (1) fragments from France, this party comprises all those who have seen a fair amount of service in France & we hold the upper hand now, (No 2) are the \"Larkhill Anzacs\" we\n\nchristened them this & don't they like it, they were originally a powerful combination but lately they have lost considerably in strength & prestige & are a fast declining power, these \"Larkhill Anzacs\" are the men who have been over here since the camp was first formed, & the majority of them had about 1 day on the Penisular, we also include all those who have not seen a shot fired in anger for they all wear gold A's, & etc., but its perfectly wonderful how they dislike taking about the old days, seems to have gone out of favor for some unexplained reason or other (\"you compree\")\n\n& don't they like to be called Larkhill Anzacs hurts I can tell you, & don't the L.H.A like to see the lads coming across from France, each batch means more \"gutsers\" & they are being worked into a great state of nervousness for they never know who will be the next victim \"how sad\" already they are getting quite tame & soon they will feed out of our hands, but there are still 2 adorable heads, one old Frith the RS.M (rank Corporal) he's a proper snag & waster, but Lord he is nothing to old Tubby Pearce the \"Fragments\" friend he is always after our scalp & towelling us up whenever possible, if we could get rid\n\nof these 2 we would have a decent Camp, at any rate we are working hard to get them out of it, but they will both take some shifting.\n","79":" The 1st Battalion reinforcements came in last night about, 150 strong got here a t 11.30. Have had a stiff mornings work. Battalion drill & old Tubby kept us going all the morning, very funny at times to see the mix's up's & hear the arguments, some more \"Fragments\" came across last night, Taplin brought me a batch of letters from Len.\n\nPay day round once, & I needed mine for it was a fair while since I drew my last money.\n\nThis afternoon 2 other Sergts\n\n& I walked to Shrewton a pretty little village about 6 miles from here, it was a long walk but worth the trouble, we had our tea in there & I got quite a lot of snaps, got back towards 9, I had a cup of tea at the canteen, then went & had a bath & I am going to bed in a few minutes after I finish this entry.\n","80":" Have been inoculated again this morning a double dose this time, my arm is stinging already.\n\nBeautiful & sunny today one of the best days for a long while. This afternoon while out amusing myself with the camera I bumped both Bobbie McKenzie & Long Jack Bevan, should not have known Mckenzie, but\n\nMick has not altered a great deal, only a little thinner I think. Am going to bed early tonight I feel very tired & my arm is getting very painful & sore, result of innoculation (a double dose) however it means 48 hours exemption so that's not so bad. This morning all the Battalions were \"fell in\" after church parade & marched away to be addressed by a mob of wowseristic \"Salvationsists\", they tried to get me to go but not one of the Sergts went all mysteriously disappeared when they heard what it was, & scores of the men followed suit when no one was looking, I reckon they have the father of a hide to expect the lads to come\n\nto these sorts of turnouts on a Sunday, the only day they have to themselves during the week & to think that these psalm singers want to spoil it for them, if they want to address the boys so badly why can't they come & do it on a week day, we all would listen more patiently then, the lecture was all about women again & how badly the Australians are disciplined, it would give me great pleasure to break some of these canting \"goody goodies\" heads, & if they are not careful that's what will happen to some of them one of these days this old talk about discipline fairly gets me going, for I think that this is one of the questions\n\nthat I can form a pretty good opinion on, & I much prefer the Australian's discipline take them all round than any of their wonderful Tommy regiments, there's one thing all the officers can leave one of our Battalions for a couple of days if they like & the lads will never take advantage of it, only carry on in the same way but let the officers of an Imperial regiment hide themselves & see what happens, I can quote numerous instances of what has occurred at different places, once you take the eye of authority off the Tommy well hes a goner at any rate this class of wowser gives me the pip, everytime I look at them, I wonder if they are such wonderful good\n\npeople themselves I doubt it, they are killing themselves & their religion as fast as everything can by these methods of preaching at the boy's, it simply wont do with the Australians but they don't seem to realize it, in 9 cases out of 10 kakhi & the firing line is their proper place same with all these saintly parsons, bishops, priests & so on let them look at the record of the French priests & either follow their example or shut up & let people alone.\n\nAt any rate the Australians have no more vice in them than the Home troops, & what they have they show, & don't attempt to hide it in any underhand way such as other troops employ.\n\n23rd. Anniversary of \"Pozeries\" today, seems a long year to me & one full of changes, about 10 days ago there was a great Memorial Service held on the actual battlefield of \"Pozeries\" each unit of the 1st Division sent about 30 men who actually fought there to represent the unit it was a great gathering & very impressive I believe, General Birdwood & his staff were there & a fine service was held.\n\nWhat beats me as how they don't erect some permanent memorial at \"Poseries' for theres no getting away from the fact that the taking & holding of \"Pozeries' was a wonderful feat, especially after the previous unsuccessful attacks by the British troops\n\nhowever I shan't forget \"Pozeries\" for I was one of the very first over the parapet on that fateful morn; & even now I can see the awful flashes of thousands of shells as we swept forward, & our objective seemed to be miles away, but we reached it alright & hung on through the awful bombardment that followed shortly afterwards. I never thought I would come out of that \"Hell\" for it seemed impossible however it was a great victory & one which we can always look back upon with pride, & a certain amount of regret, when one thinks of the many fine mates he lost in that inferno.\n\nBeen a nasty muggy close heat today, I can't say as how I care much for English weather\n\nso far from what I have seen of it.\n","81":" Went to the open air concert last night at Group Headqrs. it was given by a party of civilians who style themselves the Pierriots\", was not bad, but not enough life in it, while we were waiting for the concert to start, an airman gave us a fine exhibition of tumbling, corkscrewing, looping the loop, tail diving & etc. he was really good, & once he went through the whole lot without a stop, started a couple of thousand feet up & looped the loop 5 times in succession, then corkscrewed a fair way, followed that up by tumbling, & then a fine taildive & finished up by flying straight\n\nat us, he looked to be coming fair in among the mob, you would have laughed had you seen them stepping off the forms & chairs in their hurry some of them fell head over heels, they made sure he had lost control of his machine, but the roar of his engines should have told them different, they look a terrible affair flying straight at you puts one in mind of some huge horse or dragon fly, this plane just skimmed our heads, & we all gave him a cheer as he passed over, as he turned his machine he waved his hand to us, & steered the plane with the other its simply marvellous what they can do nowadays with the flying machines\n\nSome more Fragments arrived last night.\n\nSent 2 registered packets home yesterday\n\nOut on an \"emergency\" stunt this afternoon, this means every man a Coy. can rake together the 2nd &","82":" T.B's were there also & old \"Tubby\" gave the whole lot Battalion drill all the afternoon, we done the first hour & a half with packs up, the latter half in \"battle order\" & it was a very hot day, result plenty of swearing & sweating\n\nAnother tournament at our Stadium this evening & the boxing was very good, the principal event of the evening was a match between a Tommy & an Australian, but it was\n\na draw, after a good fight. I hear tonight that the \"Karoola\" has been sunk & a lot of our mail has gone down with her, enough to make a Saint swear after taking the trouble to write letters & then have them sunk on you\n","83":" Had an early breakfast & then a good long route march it was a nice march for we went through several old villages & crossed & recrossed the river several times, & the scenery was very fine, though the morning was very hot & close the","84":" T.B. were also with us & we had both bands so we were well supplied with music, we marched practically all the way at the \"trail\" light infantry \n\nfashion, can't say as I care much for it, makes yours arms very tired & weary.\n\nThere are several things which I have been greatly disappointed in over here in England, potatoes is one of them, after hearing so much about the quality of English potatoes I naturally thought to find them something out of the ordinary, but instead they are not even up to the N.S.W. standard let alone Tasmanian you ought to see the stuff we are being supplied with, & it is the best the caterers can get no matter what he pays for them 1 third of them are uneatable, & the quality of the remainder is poor, the other is fish, now as everyone knows out in Australia all\n\nyou can hear is the poor quality of the Australian fish compared to the English, there never was such rot talked before, you won't hear so much of it after the war either I'll bet, with the exception of 2 or 3 varieties its very little I think of their fish & the rest of the boys are of the same opinion, I expect you have heard of the famous haddock well we have it fairly often, but its scarcely ever eaten, we think so little of it, & their mackerel well its only second class, we have fish of all descriptions fairly often, our Mess don't study the cost of food, only have the best, so I think I am in a position to express an opinion on these two foodstuffs\n\nAll those who were on the route march this morning had lectures all the afternoon, this was very handy & far better than drilling.\n\nThe farmers are all busy spraying their potatoes around here, they are frightened of the Irish blight.\n","85":" No P.T. Instructors available this morning, so the Sergts had to give the physical jerks, old Tubby was buzzing round, but he never had much to say for a wonder\n\nHad a light afternoons work had X & No 1 Coy. wiring & digging trenches.\n","86":" Full muster parade this morning at 9.45 we had our Coy out on the first parade, Lord how old Tubby\n\nroared, he sent for McGregor then the S.M. & finally the Orderly Sergt. & he roared the whole lot of them up, every one could hear what he was saying for he was almost shouting it about.\n\nThe Brigadier was also round having a look.\n\nThe majority of the NCO's were \"told off\" by the Staff Sergt. he is a bit of a bounce through so far I have got on alright with him, but he's far from popular. \n\nThis afternoon we were out doing what they call tactical exercise simply platoon in attack under the new formations, & a fat lot the officers knew about it, had it been the real thing & we had carried on like we did, we should\n\nall have been wiped out for a certainty, however we did not have a bad time, there was a lot of gypsies around selling orange lemonade & etc. & we enjoyed ourselves, though one of the officers got very cranky coming home, made the men march to attention & threatened to put any one who spoke in the clink.\n","87":" Usual early morning parade old Frith tried to catch me this morning, gave me a pretty difficult move to execute with the platoon, but I managed to do it correctly, though really I don't know how I came to do it, must have got an inspiration, I don't think any one was more surprised than I.\n\nAm acting Orderly Sergt for Johnny Nicholson this morning\n\n4 of us went for a good long walk this afternoon as far as Winterbourne Stoke a small little village but very pretty, I love rambling about these old roads & villages, we take our time & spell whenever we feel inclined in the shade of the old trees along the roads or lanes, & the flowers are splendid just now which makes the strolls all the more pleasant. Had our tea in a little cottage before leaving, & we walked quietly back in the cool of the evening, you could see my cubicle now, I have got her fixed up nicely, every day I have fresh flowers on my table for they are very plentiful at present\n\n& I love flowers, they make a room look much nicer, at the present time I have no less than 13 different sorts on my table quite a variety isn't it, & all wild flowers, I have no idea of some of their names.\n","88":" Went to church this morning a Light Horse parson, was preaching & he put up a very fair argument, interesting at any rate.\n\nScotty Carswell Bob Porter & Jock came back from Schools last night.\n\nAnother lot of reinforcements came in last night, & hanged if I did not see Lieut Stien among them, you could have knocked me down with a feather, I thought he was\n\nin Australia, he left us just after \"Lone Pine\", but I suppose he could not keep away from the dust up. I have not had a yarn with him yet, he was one of our original officers.\n\n6 of us went for a long walk after dinner, the afternoon was very dull, & there was just a tiny sprinkle of moisture falling, this made the conditions just right for walking, & we thoroughly enjoyed it, you know after being cooped up in the Camp all the week it is all the nicer to get out of it & have a bit of fresh air, we started off by walking through Durrington, & thence on to Bulford, & round to Fighledean this place boasts of the \n\noriginal blacksmith shop & chestnut tree of \"Longfellows\" famous poem, \"under the spreading chestnut tree & etc\" when we got there, a parson was holding an open air meeting under the old tree, & there was a fair number sitting around on the roadside, while others were knocking leaves off the old tree for souvenirs, totally regardless of the service going on around them, from here we went to the ancient little church just opposite which the blacksmiths & family attended, & in the church yard he lies buried. \n\nFrom Fighledean we went to \nUpo\n Netheravon, but we could get very little to eat here so we turned back to Fighledean\n\n& here we had a good old fashioned spread in a private house, after this we walked back through Durrington again & so home, & soon I will be in bed for I am very tired but quite satisfied.\n\nSaw some of the women farm workers this afternoon, at a distance you have a job to tell them from a soldier, for they are dressed something alike, at any rate they look very smart\n","89":" Very few on parade this morning & all the N.C.O.s had to get rifles & do musketry, this hurts I can tell you for there is nothing we hate worse than this form of drill, it is so uninteresting, so we all think\n\nLooks very much like rain today close & overcast.\n\nRaining lightly this afternoon & we have done scarcely anything\n","90":" There was a fine concert here last night, one of the best I have seen round the Camps so far.\n\nBy tonights paper I see that the long expected smash in Flanders has started, she will be some go I'll bet.\n","91":" Lectures all this morning for it is raining again. We have a new Coy. Commander a 4th Batt. officer, & there promises to be some fun if he carries on like he has started the sooner McGregor comes back the better, he had an accident down Bournemouth way, fell off his motorbike & broke one of his arms or something & now he's in Hospital\n","92":" Heavy rain last night & still very cloudy this morning. Old Tubby was very busy again this morning.\n\nSaw Lindsay Grahams brother tonight, he has just come across from Australia.\n","93":" This afternoon we done a nice little stunt \"tactical schemes,' I had charge of No. 1 Coy. this consisted of 70 N.C.Os & men, had to tell them off & fix up the various sections as are used in an attack, this was just into my hands for I have a good idea of all the new formations, we learnt all that in France, & in actual fighting, shortly after we moved out, we got into artillery formation, & advanced\n\nacross the open until we got the order to deploy, my two lines making the first wave swung out splendidly & everything went off capitally, at the finish of the attack, even old Tubby Pearce had to admit that it was done excellently the best old Tubby reckoned that he had ever seen an attack carried out over here, thus the \"Fragments\" scored another win, a \"feather in my cap\", one of the very few I had though for we are always copping out for something or other, but we all notice that when anything like these schemes are about that they always take some of the Fragments with them & without skiting the lads can\n\nteach them many points. After this attack was over we formed up & had a spell, of course the Gypsies were about with their baskets of chocolates oranges lollies apples & etc. they are a dirty looking crowd & resemble the Gyppos in their habits, to my mind they still show traces of Spanish blood for the girls are very dark, & some of them not bad looking there are quite a number round these parts.\n\nComing home I had to organise my Coy. for an attack on a small wood, had to arrange it so that after extending the whole Coy had to enter the wood together, miss no ground while going through, & come out\n\nat the charge in one line, not so easy as it looks on paper but the lads done it remarkably well & it was a good finish to a successful days work. There was some fine contests at our Stadium tonight & the bouts were very willing.\n\nHad a letter I wrote to the Stan when I first came across from France returned to me, \"Where-abouts uncertain.\"\n","94":" Anniversary of our Declaration of war against Germany & still she drags on.\n\nFun of the world out on this parade ground this morning while we were doing Battalion drill one of the new Capts who came with the last lot of reinforcements provided it \n\nhe knew absolutely nothing about drill must have been on the Staff or Clerical work or something, didn't old Tubby roar him up, just into Tubbys hands a melon like this.\n\nHave been warned for Conducting N.C.O. with our next draft of men, was lucky to get it, but on account of my having worked well, since coming here, they are giving me the job, that's what the Officer says anyhow.\n\nWent over to the \"legshow\" tonight with a few more of the boy's it was not bad. Payday here today & upon my word its disgraceful as soon as the majority of the men get\n\ntheir money, they make straight for the beer, & here they are tonight arguing & sprawling all over the lines, I am either missing a glorious time as they call it or a damn fool, & of the two I am quite satisfied to remain the latter, for the more I see of drink the more I am predjuiced against the cursed stuff, it has ruined many of our lads that I know of to my own knowledge. As I was walking across the parade ground this evening I picked up 7 plugs of gelignite nice stuff to have lying about.\n","95":" Jock & I went to Church this morning by way of a change. Hanged if I can get any mail to speak of since leaving the Battn. I have wrote to Horsferry\n\nRd. about it.\n\nBeen doing a bit of printing this afternoon.\n\n6th. Anniversary of \"Lone Pine\" today.\n\nLeft Durrington last night with the draft had 2 bad characters with me, & they took some looking after, however I have got them to here so far, we entrained at Amesbury at 10 oclock & travelled all night, & reached Folkestone at 4.15. this morning. Conducting NCO.s travelled 1st class, but I could not sleep a wink so most of the time I was looking out of the window & the night was very pretty for a bright moon was shining & all the little gullies were full of mist, & you could have\n\nsworn that the mist was water so much did it resemble lakes & rivers.\n\nAfter getting off the train at Folkestone we were marched round to a big block of fine buildings & here the men were quartered & had their breakfast.\n\nIt is a lovely morning here plenty of sunshine for a wonder.\n\nOn my draft I have no less than 6 of the Lark Hill \"Anzac\" Sgts. They are getting cleared out now with a vengeance, some of these Sgts tried to dodge it by parading to the dentist with their teeth & then refusing treatment, at one time they used to get off the drafts in this way but it wouldn't work this time, they have taken\n\na jerry to some of these gentlemen.\n\nLeft Folkestone this afternoon & marched through the streets to the wharf, the streets were very lively & full of girls & women down for the holidays I expect.\n\nHad to wait on the boat for a couple of hours while the rest of the drafts were embarking, we had quite a small fleet going over with us & a small fleet of destroyers as escort, it was a very fine sight & to make it better a big airship cruised nearly all the way over with us, she used to almost come within touching distance & we could see everything as plain as anything, I wish I had my Kodak what a snap one could have got, an officer who was next to me had his but\n\nhe said he wasn't game.\n\nAfter reaching Boulogne, we sorted the drafts out according to Divisions & there was the usual crowd swarming round while this was going on, women selling fruit, girls with lollies & kiddies wanting to carry everything, they are a regular pest, after a while we got all sorted out & off we started, had a pipe band with us, marched right through Boulogne & up the steep hill which nearly every Australian knows to our Camp on top, here there was a regular mix up, first of all the Dr. had a sort of inspection for scabies & such like, run through the whole 900 in about 20 mins afterwards we were detailed to \ntt\n to the tents, & the then fun\n\nbegan, all the units got hopelessy mixed together so we let them alone drawing the rations was the next trouble & the","96":" Div hopped in & nearly got the lot, & we had to argue till 12 oclock that night before we could get anything for our men to eat, it was a rotten system they worked the indents on that caused it, at any rate we all had short rations that night & went to bed hungry.\n","97":" Short issue of rations again this morning & plenty of grumbling moved out of this camp at 10.15 & marched down to the railway station there was a great crowd of people in the streets to see us march by, entrained in trucks there were a fair number of German prisoners aboard also\n\npassed through some lovely country on the way down typical French country, & very fine crops everywhere, the women & girls are still grafting in the fields carrying on just the same in spite of all their men being away, one can't help admiring the French they never grumble but box on, determined to see it out with Germany we spent that night in the trucks all the afternoon while it was nice & hot hundreds of men rode on top of the trucks, & the whole train was decorated from end to end with green boughs & flowers.\n","98":" Arrived at Le Havre early this morning or rather I should say Harfleur, had only a short distance to walk to the Camp & I can tell you I was glad when \n\nI got rid of my men.\n\nSaw quite a number of chaps whom I knew, including Lieut Champion had a yarn with him this morning, he was my old platoon officer & a good fellow. There are plenty of camps round here, a few Tommies but mostly Australians.\n\nThere was a couple of heavy showers this afternoon but it cleared up towards evening.\n\nAfter dinner went & saw the boxing matches at the Stadium here they have it situated in almost an ideal place, the ring itself is built in a little saucer shaped hollow & the sides of the bank slope gently away & thousands can get a good view of the whole turn out & there was a mighty crowd, must\n\nhave been a good few thousands sitting round about, there was also a fair sprinkling of French officers & plenty of French women & girls. I wonder what they think of the English style of amusement they were very interested & highly delighted judging by their antics. Some of the fights were good, but they were a bit slow in getting the men into the ring.\n","99":" Still hanging round & no orders yet about going back, if we had any definite orders we could get a \"pass\" & go into Le Havre, but as things stand at present, we have to stop in camp. What a difference over here in the bread, the military in France have no such thing as war bread they believe in giving the soldiers\n\nthe best which is only right, the bread over here is white as snow & it seems so funny after what we have been having in England. I was talking to an officer the other day & he was telling me there had been a big stink in one of the Paris hotels between some Australian & American officers, & in consequence all Paris leave was likely to be stopped. \nin consequence\n he reckons the same as most of us, that our fellows won't be friends with them until they try one anothers mettle & break a few heads, & the feeling is the same with the Yanks, we all have great faith in the Yanks & I am certain they will do well when they are set against the Germans. The Germans are using a new gas against us, I saw some\n\nof the victims the other day in the Hospital train at Boulogne, it hasn't killed no one so far, but it raises most awful blisters on all exposed parts of the body & especially parts of the body that are apt to chafe, it eats through the rubber in our helmets in a few minutes & so far we have no protection against it, but they wont be long in discovering some check the men who get gassed, appear to be very bad & they look it, but though it has killed no one so far, we don't know what the after effects are going to be, the old Hun's wont half pay dear for this later on, they are only making a rod for their own backs. I noticed that the majority of the patients were artillery men.\n\nStrikes me how I have got a few \"chats\" on me this morning, the old familiar itch is present again, after a lapse of 3 months, I had almost thought there were no such things as chats, but no such luck, for I can feel one or two cake-walking now, & I shall have to knock off to fix them. Just after lunch we had another heavy shower it fairly poured down.\n\nWhile waiting for our passes, I bumped, who do you think, why Athol Stuart, he has not changed much.\n\nHad a look round Le Havre this afternoon, I do not think much of her as a town not as good as Rouen or Amiens, seems to me a much dirtier place probably on account of the heavy\n\ntraffic in & out of its port. The harbour is full of locks hydraulic bridges & etc. & seems to be very well laid out.\n\nI am writing this on board our ship (Archangel) we well be pulling out shortly, the harbour has been closed the last couple of day's on account of a German submarine which has been hanging round the entrance, but they reckon they got her today, so we are sailing for Southampton tonight, we have a fair crowd aboard, conducting N.C.O.s & others going to Blighty on leave, I don't like my chance going over tonight I feel quite squeamish already I am not much of a sailor, though after the first attack of mal-de-mer as the French say\n\nI am right as rain.\n","100":" Here we are at 3.30. A.M. & lying just outside the boom at Southampton waiting for the port to open so as we can get in, was rather surprised to find that I stood the little trip well, have not felt the slightest bit sick, the ship was crowded & I slept on a sort of counter which had been overlooked in the crush.\n\nLanded at 7. & struck off for the town to get some breakfast, got in to a restaurant, & had the following a minute piece of bread, & still smaller ration of butter, cup of coffee, fillet of plaice, small piece of steak & chips, we got the shock of our lives when they made the bill up, 4\/- each, well you could have knocked me down\n\na feather, not that I won't pay a decent or fancy price for a meal, but this was downright robbery, however we said nothing, paid up & walked out in disgust, feeling that we had been done in.\n\nAfter this another chap & I went down to the Municipal Baths, & had a good clean up & etc, & then a look round Southampton, in my opinion she is the finest laid out town I have seen so far she has bonzer wide streets, plenty of trees, fine big houses which stand well back in nice flower gardens, a good train system, & the cleanest town I have ever seen, such a contrast after Le Havre, Southampton is well worth a visit.\n\nThere area some queer little streets in Southampton, something after the style of Petticoat Lane & they fairly stink of Jews. Bought a watch & a few little things while knocking round. There are still to be seen portions of the ancient walls which circled this port in olden days in one place, it stretches right across the street & the cars & all run through the little narrow arches, it was through this wall in the olden days the French made a breach & stormed the town though their success was short-lived. I left Southampton & travelled up by train to Salisbury, on the way up I saw for the first time an oil-tractor drawing a\n\nEngland is full of it & especially London, & unless you have a strong will, you are a \"goner.\" Received a few letters this morning but judging by the dates of these & the last lot I got, there must have been some sunk.\n\nThis afternoon Sgt. Wilson (Stumpy) & I we always call him, went for a stroll through Durrington & down to Fighledean, Stumpy & I are great pals & we get on well together though our natures are a long way different, especially as regards women, Stumpy loses his heart to every pretty girl he see's, this is generally about 10 times a week, while I am just the opposite, I have seen nothing over here that's startling so I throw cold water on \"Stumpy's\" fascinators, you wouldn't think that two natures like these would agree but we get on capitally, & every spare hours we have we are roaming the country, poking our nose in every little nook & corner\n\n& village for miles & miles around but women are practically the only thing we differ in, he is short, so am I, we both love the quiet old country lanes & villages & both of us understand a fair bit about Nature & bushcraft & we can both walk all day long there's one other thing we differ in, \"Stumpy\" is always joking & singing, & in this respect he makes up for the two of us, however we walked down as far as Fighledean took a few photos, had some tea in a little country house, & then we walked the 3 ¼ miles home in 55 minutes not bad going, we timed ourselves, then after tea we went over & saw the pictures & so ended the day.\n","101":" Have been doing a bit of printing today & have got some very good results.\n\nThere was a great stink kicked up in the Camp last night about 11 oclock, it appears that some women got in somehow, & took up their quarters for the night in \nat\n a big shed at the back of the Guard room, it wasn't long before a crowd collected & the Sergt of the Guard had to go round & bunt the whole crowd, comes to something when they make a brothel of the Camp.\n\nAm Orderly Sergt. for this coming week started today.\n","102":" Things went off nice & smoothly today with the exception of a small row over\n\nthe Canteen picquets, but it was explained to the satisfaction of the Orderly Officers by. A. & D. Coys. just before \"Tatoo\" there was a very heavy shower of rain, what a rotten country this must be to farm in, why you can't get 3 fine days running.\n","103":" Duty Coy. & I have had my work cut out detailing men & N C O.s for the various duties so far things are pretty right, but the days not over yet.\n\nMore boxing last night & some good fights, last nights contests were held in the big mess room on account of the threatening weather they brought the floor of the ring down from the Stadium & fixed her up. Long before the starting time the room was packed every available\n\nbit of room was taken up both inside & out, with the exception of the reserved space for officers & Sergts, the Band played some selections till the first fight was ready, then the MC gets up & announces the names, weights, & numbers of rounds they are going to fight, the seconds toss for position & gloves the referee steps in, says a few words to both fighters, they shake hands & away they go, the first was a bonzer clean, & fast & the best man won, there was great applause at the finish of this fight.\n\nThere was one scrap last bight by \"mutual consent\", that is to say the two had a row & they got permission from the Colonel to have it out in the ring, the\n\nfairest way, one chap punched the other till he could scarcely stand up, then he had to give in knocked himself right out, but he made a fight of it, the other fellow smothered all the time & scarce made a punch, the little chap was by far the cleverest boxer & the crowd gave him a great reception at the finish & they hooted the big chap, although he won, but he never made a fight of it when they started hooting the Colonel jumps up on the stage & tells them to play the game or he will stop the fight, this quietened the mob, there were 2 more fights after this 1 being a knockout, & the other threw the towel in.\n\nHeavy rain fell again yesterday.\n\njust as the Guard was to be inspected a thunderstorm came on so the Guard had to be inspected & changed under the verandah. A big Temperance lecture here this afternoon some Colonel or other gave it.\n","104":" Nice & sunny this morning & the Coy's are all route marching so I have an easy morning Pouring rain again this evening whatever is the country coming too, & the lightning is very bad, nearly all the roads are under water puts me in mind of the monsoonal weather in New South Wales, the farmers have got to keep on spraying their potatoes to keep the blight under\n\nAnother prisoner escaped today got away from Beness, who\n\nchased him a couple of hours & then lost him, this afternoon he was up before the Colonel & he gave him a DC.M, this is what always seems ridiculous to me they will go & punish a good man for the sake of wasters, & in 9 cases out of 10, the good man is spoilt for good, I know if I got in to trouble over a case like this & it wasn't my fault & they punished me, I would never soldier again, & practically all are of the same opinion on this point.\n\nBrought all our reinforcements up tonight & have got them told off in the platoons & huts.\n\nThe days are getting noticeably shorter now, & are drawing in rapidly & I am not sorry for it will give us a chance to sleep\n","105":" All the Orderly Sergts came a terrible ‘gutsers' today through not warning the men for draft in time, but it was all through a misunderstanding didn't old Tubby roar.\n\nThere was a pretty good concert here tonight & I enjoyed it thoroughly.\n","106":" Well what a day it has been, nothing but rows the whole time, & all over insignificant little affairs of course all the poor Orderly Sergts have had a nice doing & I am about full to the neck of the whole affair, this is about the first time I have sat down since morning on the go all the while, had to find so many duties\n\njust to give you an idea here are some of them Quarter Guard 9 men & 1 NCO, Isolation picquet 3 & 1, Cultivation picquet 3 men, Fargo Guard 3 & 1, Grenade Guard 3 & 1 2 M.S. 10 & 1, Hqrs 6 & 1 Coy Fatigue 8. M.O.s 4 & 1 Inlying picquet 38 & 2. Escort to Chelmsford, 1 & 1 Escort to Devizes 1 & 1 & some more, & in addition to all this there is the usual work, which is a lot more in this Coy of 280 men than there is in a Battalion in France such a rotten system it is run on.\n","107":" Woke up this morning to find it raining heavily, & it looked like continuing but at 9 oclock.\n\nit cleared & now it is a splendid morning, & all the Coys. at Lark Hill have gone this morning to practice a review which is to be held shortly, the Duke of Connaught is going to have a look at them. Have had a very busy day for Saturday been going all the afternoon for all I am worth & have just finished clearing all the Canteens 9.15., & quite a number of men are drunk & the majority very noisy, its wonderful the effect drink has on the dispositions of men some are quiet as lambs some are noisy & quarrelsome others want to tell you all their sorrows & secrets, & again some get what they call crying drunk the worst\n\nof all in many ways, it has been pay day & this always means a big batch of drunks.\n","108":" & a nice day though a little cloudy, this morning when I took my church parade state down, old Tubby called me over & said Sergt. haven't you got a better hat than that, I said no, I have spoken to the Q. Master about it several times but he seems to take no notice, well you tell the Q M that he is to get you a new hat at once, I have been waiting for old Tubby to say something about my hat ever since I have been here, for she is pretty old & faded & I was quite determined that whatever else I might buy I would not get a hat, for its up to the military\n\nto supply that.\n\nYesterday afternoon Jock Mackie took up a collection among the Sergts, for our Imperial Instructor Jock Knowles, a jolly fine chap, it appears he has drawn no pay for a couple of months & is still £ 2..10 in debt, this is a fair slap in the British Army, for he only receives 3\/6 a day & he is a C.S.M. old Jock did not like taking it, but he recognised the spirit it was given in & accepted it.., when we get it all in, the total will be about £ 10. Jock Knowles is a bit different to the other Imperial Instructor we have attached to us, for he is hated by officers NCO.s & men & don't think he will last very long here\n\nWent down this afternoon to Bulford & Durrington & got a few snaps that I wanted, there is a very old church at Bulford, dates back to 1130, & she looks it, though the building is as solid as the day it was finished, no jerry building or slumming those days, Bulford is a very pretty little village the Avon runs right through it, & there are several little creeks winding in & out cutting the village up & the houses are all as old fashioned as can be, with plenty of flowers & creepers climbing all over the place, there is a big Camp close here where all the veneral cases are quartered & doctored, you can find any rank you like here from the General down to the \n\nprivate, yes & a few parsons too if you keep your eyes open. All skin diseases are sent to this Camp as well.\n","109":" Early breakfast this morning for the Duke of Connaught was going to review the troops on Salisbury Plain, every possible man was turned out, it was all over by 11.30, & in honor of the occasion the bugles blew \"no parade today\" this made the boys cheer.\n\nHad a big list of offences to be dealt with at the orderly Room this afternoon, & nearly all were these new draft of men, they want a bit of shaking up.\n\nThere was a shocking number of men drunk last night\n\n& they were a bit over the odds the way they played up.\n","110":" The C.O. had a big list of offenders to deal with this afternoon but he soon ran them through.\n\nThere were some good fights at our Stadium tonight especially the one between Cossey & Biden, the first couple of rounds it looked a 100 to 1 on Biden, but in the next round Cossey knocked him, & had him absolutely at his mercy, but he showed a fine spirit & just tapped Biden so he wouldn't hurt him, but Biden was too far gone, & a light punch from Cossey settled him. Many a man when he saw\n\nhis opponent badly rattled would have cut loose & punished him severely, but Cossey chose the more manly action, & at the finish he was loudly cheered by the crowd.\n\nHad a letter from Lindsay Graham today & he tells me that Len has been recommended to come to England on the 6 months stunt, it would be alright if it comes off.\n","111":" Hot & muggy & dust blowing all over the place, have been fairly busy what with the early morning parade & being Duty Company, keeps the Orderly Sgt going.\n","112":" There was a flash concert last night here, the party cost about 30 guineas\n\nbut it was unsuited to the audience, being altogether too high class, some of the members used to sing in the big Opera Companies, & you might guess how this class of thing would appeal to the average soldier, I felt ashamed of myself, when they started catcalling & ironical cheers after one of the high class singers had a turn, the hall was seething with disappointed men & full of sarcastic remarks & interjections some of the officers tried to stop them but it was no good, & by the time the concert was half over, the big room was almost empty save for a few who liked & understood the singing\n\nIt was to have been a great night all the officers had their lady friends out & they must have run close on a hundred or so but it turned out a big failure that is from the average mans point of view, speaking for myself I can't say as how I cared much for the majority of these items, though one girl sang a song in Italian & I thought that the best of the evening, it reminded me of the first time I had ever heard an Italian song, & that was at Alexandria while waiting to get off when we first went to Egypt, & I thought it was splendid.\n\nJust at \"Last Post\" a very heavy thunderstorm broke & it simply\n\nfell down, I got caught in it & was wet to the skin in a few minutes.\n\nThere is some talk of shifting the Camps from Salisbury Plain further south for the winter.\n","113":" Some more rushing about this morning, hunting up the men for the G.S O's inspection, every man who leaves this Camp has to go through his hands, & if they are not fully trained he bungs them out, it is the biggest farce I know of.\n","114":" This morning I crimed some men 5 in all these were the first men I have ever had up since I have been an NCO. & I ran these up gladly, they\n\nmade it too hot, & I warned them repeatedly, these men would never get out of bed in time for the first parade, & in trying to shield them I got into several wordy arguments myself, so I decided to put an end to it, some of them got 7 days C.B.\n","115":" At the last moment, Group Hqrs threw all our draft out, reckoned they had not passed the G.S.O. & they have been through his hands twice to my knowledge make a saint swear, for now we have to prepare a new list & this means a lot of extra work for the Coy. Clerk.\n\nFinished my Orderly Sergt today & I am glad to be rid of it, such a rotten job\n\nWhatever has come over the \n\nweather of late, its raining again today, hanged if I know how the farmers get their crops cut & in Johnnie Nicholson went to London on escort & brought a slippery customer back Mayne's his name, used to be a Sergt in our Battalion, but got reduced in Egypt, since then he has been in every gaol in England I think & has caused a lot of trouble Jock has gone on his 10 days leave, & I am following him in about a fortnights time Judging by our last lot of reinforcements Australia must be full of weeds, our draft are a very poor lot, & the majority are no ways keen on getting to France\n\nmust have been forced out of Australia.\n","116":" Beautiful & sunny this morning but I don't suppose it will last long.\n\nDone some gaslight, or rather electric light printing last night & got some good results. Worked my head this morning & did not go on our early morning parade.\n\nI have just thought of it, have been soldiering now for 3 years & 3 days, what a time it seems, since I first rushed down to Sydney to join up, frightened they would have enough before I got there, & when I passed the Dr. & got into Kakhi, I was one of the proudest chaps in\n\nSydney, but even now in spite of the long time we have been away & the trials & hardships I have had to put up with I'm glad I was one of the first away, & never regret joining up.\n\nWell it has turned out a wretched day it has rained steadily all the afternoon & is still doing so.\n\nThis morning we had Battalion drill I had charge of a platoon & got on alright, in the afternoon we were in a hut the whole time for the men were receiving instruction on the Lewis Gun.\n\nSome rotter broke into my cubicle while I was away & stole some of my clothes several other articles & a \n\ncouple of letters I had written. I don't what his idea could have been with the letters, I should like to have laid hands on him, one or the other would have got a hiding this much I know.\n","117":" Still raining like blazes France is bad enough but England is 10 times worse, seems to rain at least 4 days out of 5.\n\nAll our reinforcements have gone on their 6 days disembarkation leave some of them were lucky to get away, one hut last night had a free fight & an officer put the whole hut under \"\nclose\n arrest\" & said they were not to go on leave but he never left his name, so they did not know who it was, & could not\n\nstop the men from going, they are a bad lot these last lot of ours. Last night a prisoner escaped from the Guard room again more trouble for the Sergt.\n","118":" Yesterday afternoon I had a severe attack of pains in the stomach, had to lay down all the afternoon, they went off during the night.\n\nThis morning although it was drizzling rain we went for a route march about 10 miles, & by the time we finished we were all wet through.\n\nAll No 1 platoon were on the Lewis gun this afternoon till 4.30 after that we all went out on the parade ground & played games of all sorts, these are a part of the training now.\n\nCapt McGregor came back today & we are all pleased to see him in charge again.\n","119":" My leave came through this morning but I think I'll wait till next week before I go Curran & Carswell are back from theirs this morning I notice. About 20 French Mortars marched into our Coy. last night, transferred to the Infantry, nearly all French Mortar, Engineer, Pioneer's etc. & a good few Artillery reinforcements come gutsers when they get over here for they get shot into the Infantry, there are not a great number of casualties outside the infantry & artillery & what men they do want for these units are generally drawn from the Infantry in France\n\nHave been drilling these Mortar chaps of ours all day, among them they have an ex 20th Battn Major, he was cashiered for cowardice last October & sent back to Australia, he then re-enlisted & is here as a private, seems funny don't it & he don't seem a bad sort of fellow, I suppose he is out to wipe that stain off at any cost, for it must be a terrible thing to have hanging over one Ross is his name.\n\nAm Sergt of the Inlying piquet tonight & it is raining as per usual\n\nSome Yanks were round here today with some of our heads the Yanks are taking all these Camps over I believe, & we are (moving\n\nW\n","120":" Weather looks to have taken up, but I suppose it will be raining before the days out. Have been off parade all day the result of what we call \"working our head\" Johnny Nicholson & I work together & we can do it easily we had no men at all on parade, so we could not see the sense of us going out & drilling, & besides Capt. McGregor is a good chap & he knows all the overseas N.C.O.s. & therefore overlooks a lot of things, but we do take some risks, & there are some funny incidents at times.\n\nThe Coy were paid last night & judging from the number of drunks the canteens must have done a good trade.\n","121":" Very windy but\n\nfine today, put the morning in on Battalion drill, am going on Guard tonight.\n\nGot a letter today from Aunt Carrie the first one for a long time.\n\nCarswell & I have put most of the afternoon in printing & we have got some good results from a new mixture we are using.\n","122":" On Guard today but things are very quiet, with the exception of a madman whom I am looking after he is in the clink for his own safety, tomorrow they are sending him to an asylum. I have another peculiar case too an ex Sergt. he is a bad egg but has a good little wife, every day she comes & see's him. & the Sergt of the Guard lets them go into a little room for privacy's sake\n","123":" Battalion drill this morning & for once I enjoyed it.\n\nThis afternoon we had a splendid lecture the whole Battn was marched into a great mess room & some how or other they managed to sit down on the floor, the first speaker was a Dr., & he told us all about veneral disease & how to keep it in check & etc. after him came Archbishop & he quite carried the room by his splendid delivery & argument, he spoke fearlessly about this terrible disease which is so plentiful this side of the world, theres one thing he never went behind our back but hit straight out from the shoulder, I never heard a member of the Church speak so boldly about this subject, of which\n\nthere is so much false modesty & foolishness, but people are gradually beginning to look it fair in the face & the sooner the better for all concerned. There was a big row in one of our huts last night, the chief offender a big strong hulk about 16 stone got a proper hiding by a much smaller man, to the delight of all concerned, & the coward ran over to the officers mess with a tale that they were kicking him to death, over runs a couple of officers hatless & breathless into our Orderly room, & wanted to know what all the row was about. I was there at the time & told them the strength of it, didn't they roar on big Bell, the biggest squib I have yet seen.\n","124":" We have had a most beautiful day for a wonder.\n\nWas down to the dentists for classification this morning, was told\n\nthat I wanted \nto f\n two fillings, some fun in store for me.\n\nSome more \"Fragments\" arrived last night, Len was stiff he would have come but for being sent to Hospital with \"French fever\" a few days before they left the Battn.\n\nHave had my platoon bomb throwing all afternoon.\n\nNight operations last night & the usual farce over again & I believe they are on again tonight\n","125":" Another night stunt last night but I was off it, done some printing instead\n\nIt has been very funny the last couple of days, I have been wearing no stripes & mixing among our newest reinforcements, had to drill some of them, they couldn't make out who or what I was\n\nI like the idea of knocking about without stripes you see & hear some funny things at times, when in France I rarely wore stripes, it was nearly 3 months after I was made a Sergt, that I put them up at all & Major Jacobs told me to put them up then. This morning the whole of the Battn was reorganised, all Coy. Commanders were called out & then all senior NC.O.s Capt Pearce (\"old Tubby\") asked Capt McGregor if he had any capable N.C.O.s & for some unexplained reason he said yes \"& mentioned my name so Capt Pearce sings out at the top of his voice Sergt Barwick, now thought I what the devil is the matter\n\nfor as a rule it bodes no good when Tubby wants a chap, but to my surprise he said, Sergt you are to take No 1 Platoon & you will be responsible for them also you will have no \"duty\" whatever outside your platoon & if they detail you for anything let me know at once, this was a bit of a shock to me, picking me in preference to a lot more to take the leading platoon, hope it lasts at any rate, for if nothing else I will be excused from duties such as Guards picquets & etc, but I wonder how long it will last.\n\nA fair concert was held in the big Mess hut last night.\n","126":" When we formed up this morning 20 NCO's names\n\nwere called out & mine was among them, it appears that the Brigade called for 20 NCOs 5 from each Battn. & my name was among them, they must want their old NCOs back badly, some of the 20 have not been here 2 out of their 6 months yet. I can't growl for I have had just on 4 months could have got out of this if I liked the Dentist marked me unfit, but I absolutely declined treatment, France will do me Jock is parading this afternoon to see if he can't get across with me.\n\nOne of the Sergts who has been here for a long time wanted right or wrong to take my place it was very good of him but I \n\nwouldn't have this sort of thing Stainton is his name.\n\nHave been busy writing all afternoon letting all know of my change of address.\n\nHad a letter from Len this morning he will be out of hospital shortly & then expects to come over here I hear the Battalion has just gone in the line, the first time since I left her in \"Bullecourt.\" So they had a fair spell this time. The Colonel turned old Jock down this afternoon told him it was no use him parading, as he would go back when he was sent & not before, Jock this evening wanted me to let him take my place so as I could have my leave a thoughtful action but one I would not listen\n\nto at any price, but I think from what I have heard tonight that there is going to be an enquiry as to why a few of us are on draft before completing our 6 months I rather hope they will let us go instead of cancelling it.\n\nSome fun at our Mess meeting tonight, after it was over Jack Gannon & I went over to the Palace \"to see the show. No less than 3 of the boys who came across with me are in trouble with girls over here, I have been wise for once & had nothing at all to do with them that is to say so as they could have no claim on me for anything\n","127":" Good fights in the big Mess Hut last night, & a big crowd to see them, Mitchell\n\nwon the big fight of the night. \n","128":" Went for a long march this morning started out at 7.45. & finished 1.15. during this time we had 4 halts only, none being 10 minutes we covered about 16 miles All the hedges round here now are covered with elderberries in places they area just black with the berries.\n","129":" Woke up this morning to find drizzling rain falling, & it is very little better this afternoon & being Sunday makes it seem all the worse.\n","130":" A bit of a stink on the early morning parade, my platoon & one of D. Coy's had been playing football & were putting plenty of ginger in to it, but one of the P.T.\n\nInstructors thought they were not doing enough, so he formed them up & started to double them round, soon they began to fall out \"winded\" then Lieut Ferguson starts on them & the end of it was that he kept them on the ground 15 mins after the rest had gone off, going to give them extra drill, but their tempers were up & they would scarce do a thing for him, he told me to go back to my lines & all the N.C.O.s but I refused for I intended to stop with my men if he kept them there till dinner time, this is the class of officer who absolutely spoil good men, for this is the surest way I know of to spoil Australians try to show your hand, & you are up against it properly especially in a case like the above, for that is where experience & discretion counts & should be exercised.\n\n"}}