{"Document Name":{"0":"Diary_0032","1":"Diary_0032","2":"Diary_0032","3":"Diary_0032","4":"Diary_0032","5":"Diary_0032","6":"Diary_0032","7":"Diary_0032","8":"Diary_0032","9":"Diary_0032","10":"Diary_0032","11":"Diary_0032","12":"Diary_0032","13":"Diary_0032","14":"Diary_0032","15":"Diary_0032","16":"Diary_0032","17":"Diary_0032","18":"Diary_0032","19":"Diary_0032","20":"Diary_0032","21":"Diary_0032","22":"Diary_0032","23":"Diary_0032","24":"Diary_0032","25":"Diary_0032","26":"Diary_0032","27":"Diary_0032","28":"Diary_0032","29":"Diary_0032","30":"Diary_0032","31":"Diary_0032","32":"Diary_0032","33":"Diary_0032","34":"Diary_0032","35":"Diary_0032","36":"Diary_0032","37":"Diary_0032","38":"Diary_0032","39":"Diary_0032","40":"Diary_0032","41":"Diary_0032","42":"Diary_0032","43":"Diary_0032","44":"Diary_0032","45":"Diary_0032","46":"Diary_0032","47":"Diary_0032","48":"Diary_0032","49":"Diary_0032","50":"Diary_0032","51":"Diary_0032","52":"Diary_0032","53":"Diary_0032","54":"Diary_0032","55":"Diary_0032","56":"Diary_0032","57":"Diary_0032","58":"Diary_0032","59":"Diary_0032","60":"Diary_0032","61":"Diary_0032","62":"Diary_0032","63":"Diary_0032","64":"Diary_0032","65":"Diary_0032","66":"Diary_0032","67":"Diary_0032","68":"Diary_0032","69":"Diary_0032","70":"Diary_0032","71":"Diary_0032","72":"Diary_0032","73":"Diary_0032","74":"Diary_0032","75":"Diary_0032","76":"Diary_0032","77":"Diary_0032","78":"Diary_0032","79":"Diary_0032","80":"Diary_0032","81":"Diary_0032","82":"Diary_0032","83":"Diary_0032","84":"Diary_0032","85":"Diary_0032","86":"Diary_0032","87":"Diary_0032","88":"Diary_0032","89":"Diary_0032","90":"Diary_0032","91":"Diary_0032","92":"Diary_0032","93":"Diary_0032","94":"Diary_0032","95":"Diary_0032","96":"Diary_0032","97":"Diary_0032","98":"Diary_0032","99":"Diary_0032","100":"Diary_0032","101":"Diary_0032","102":"Diary_0032","103":"Diary_0032","104":"Diary_0032","105":"Diary_0032","106":"Diary_0032","107":"Diary_0032","108":"Diary_0032","109":"Diary_0032","110":"Diary_0032","111":"Diary_0032","112":"Diary_0032","113":"Diary_0032","114":"Diary_0032","115":"Diary_0032","116":"Diary_0032","117":"Diary_0032","118":"Diary_0032","119":"Diary_0032","120":"Diary_0032","121":"Diary_0032","122":"Diary_0032","123":"Diary_0032","124":"Diary_0032","125":"Diary_0032","126":"Diary_0032","127":"Diary_0032","128":"Diary_0032","129":"Diary_0032","130":"Diary_0032","131":"Diary_0032","132":"Diary_0032","133":"Diary_0032","134":"Diary_0032","135":"Diary_0032","136":"Diary_0032","137":"Diary_0032","138":"Diary_0032","139":"Diary_0032","140":"Diary_0032","141":"Diary_0032","142":"Diary_0032","143":"Diary_0032","144":"Diary_0032","145":"Diary_0032","146":"Diary_0032","147":"Diary_0032","148":"Diary_0032","149":"Diary_0032","150":"Diary_0032","151":"Diary_0032","152":"Diary_0032","153":"Diary_0032","154":"Diary_0032","155":"Diary_0032","156":"Diary_0032","157":"Diary_0032","158":"Diary_0032","159":"Diary_0032","160":"Diary_0032","161":"Diary_0032","162":"Diary_0032","163":"Diary_0032","164":"Diary_0032","165":"Diary_0032","166":"Diary_0032","167":"Diary_0032","168":"Diary_0032","169":"Diary_0032","170":"Diary_0032","171":"Diary_0032","172":"Diary_0032","173":"Diary_0032","174":"Diary_0032","175":"Diary_0032","176":"Diary_0032","177":"Diary_0032","178":"Diary_0032","179":"Diary_0032","180":"Diary_0032","181":"Diary_0032","182":"Diary_0032","183":"Diary_0032","184":"Diary_0032"},"Date":{"0":"unknown","1":723.0,"2":725.0,"3":726.0,"4":728.0,"5":730.0,"6":731.0,"7":733.0,"8":734.0,"9":735.0,"10":736.0,"11":737.0,"12":738.0,"13":739.0,"14":740.0,"15":741.0,"16":742.0,"17":744.0,"18":745.0,"19":746.0,"20":747.0,"21":748.0,"22":749.0,"23":750.0,"24":751.0,"25":754.0,"26":755.0,"27":757.0,"28":758.0,"29":759.0,"30":760.0,"31":762.0,"32":763.0,"33":766.0,"34":767.0,"35":768.0,"36":769.0,"37":770.0,"38":771.0,"39":772.0,"40":773.0,"41":774.0,"42":781.0,"43":782.0,"44":785.0,"45":786.0,"46":787.0,"47":788.0,"48":800.0,"49":801.0,"50":803.0,"51":806.0,"52":808.0,"53":809.0,"54":810.0,"55":811.0,"56":812.0,"57":813.0,"58":816.0,"59":817.0,"60":818.0,"61":819.0,"62":820.0,"63":823.0,"64":824.0,"65":825.0,"66":826.0,"67":827.0,"68":830.0,"69":831.0,"70":832.0,"71":833.0,"72":835.0,"73":838.0,"74":839.0,"75":840.0,"76":841.0,"77":842.0,"78":843.0,"79":844.0,"80":845.0,"81":846.0,"82":847.0,"83":848.0,"84":849.0,"85":850.0,"86":851.0,"87":852.0,"88":853.0,"89":854.0,"90":855.0,"91":856.0,"92":857.0,"93":858.0,"94":859.0,"95":860.0,"96":861.0,"97":862.0,"98":863.0,"99":864.0,"100":865.0,"101":866.0,"102":868.0,"103":869.0,"104":870.0,"105":871.0,"106":872.0,"107":873.0,"108":874.0,"109":875.0,"110":876.0,"111":877.0,"112":878.0,"113":879.0,"114":880.0,"115":881.0,"116":882.0,"117":883.0,"118":884.0,"119":885.0,"120":886.0,"121":887.0,"122":888.0,"123":889.0,"124":890.0,"125":891.0,"126":892.0,"127":893.0,"128":894.0,"129":895.0,"130":896.0,"131":897.0,"132":898.0,"133":899.0,"134":900.0,"135":901.0,"136":902.0,"137":903.0,"138":904.0,"139":905.0,"140":906.0,"141":907.0,"142":908.0,"143":909.0,"144":910.0,"145":911.0,"146":912.0,"147":913.0,"148":914.0,"149":915.0,"150":916.0,"151":917.0,"152":918.0,"153":919.0,"154":920.0,"155":921.0,"156":922.0,"157":923.0,"158":924.0,"159":925.0,"160":926.0,"161":927.0,"162":928.0,"163":930.0,"164":931.0,"165":932.0,"166":933.0,"167":934.0,"168":935.0,"169":936.0,"170":937.0,"171":938.0,"172":939.0,"173":940.0,"174":941.0,"175":942.0,"176":943.0,"177":944.0,"178":945.0,"179":946.0,"180":947.0,"181":948.0,"182":949.0,"183":950.0,"184":951.0},"Entry":{"0":"\n\n","1":"\n\nLeft Liverpool 9.10 train, on to Rhodes, embarked on ferry, down Parramatta to Sydney aboard Mooltan; sailed 1.30; dinner 2 p.m. Retired 8.30, slept on deck, shifted. Issued Hammocks and life-belts.\n","2":"\n\nMelbourne 9 a.m. M.O. Inspections. Leave granted, 10 a.m. to 12 midnight. Look round town; afternoon, car through Doncaster, back to town had tea, marched through St. Kilda to Luna Park, aboard again 11 p.m.\n","3":"\n\nSailed 3 p.m. Port Adelaide.\n","4":"\n\nArrived Port Adelaide 7.30 a.m. Left 6.45 p.m. Lovely trip. Good weather.\n","5":"\n\nHis nib’s birthday. Glorious weather. Jim Bryden and Stan Turner feeding the fishes – very kind of them.\n","6":"\n\nRough seas. Sunday. Captain conducted Service.\n","7":"\n\nArrived Freemantle 2 p.m. Left 9 p.m. No leave granted, but all hands went ashore, look round town, hot day.\n","8":"\n\nPassengers dance on deck.\n","9":"\n\nFuneral, one of the coloured crew. Concert held by boys. Passengers invited. Good time. Canvas bath rigged aft on well-deck, all officers immersed (compulsory) by men including R.C. Priest and two passengers lying at ease on deck. Officer leads men in operations and receives their kind hospitality, myself with my khaki clothes, minus tunic; aftermath – clothes hanging everywhere to dry.\n","10":"\n\nChristmas Eve – quiet day, hot night. Soldiers blacken and Kiwi their mates’ faces while the victims sleep.\n","11":"\n\nChristmas day. Troop deck decorated. Divine service\n\nby Captain. Ladies attend on tables at tea. Dinner – soup, roast beef, turkey, plum pudding, mineral waters, iced cake, fruit, coffee, cigars, cigarettes. Hurrah! (No intoxicants).\n","12":"\n\nService Divine, quiet day.\n","13":"\n\nMonday. Crossed the line. Father Neptune and his attendants. I was immersed again. Officers all tried by jury and sentenced. Lathered with flour water and shaved by wooden razor. Hair cut with large wooden scissors. Made to drink something and then compulsory baptism.\n","14":"\n\nSports aboard ship.\n","15":"\n\nColombo. Ashore. Gardens, Buddhist temple. Beggars in streets – they would aggravate a saint. Bridal couple in carriage.\n","16":"\n\nQuiet day. Sail 5 p.m. Lovely weather.\n","17":"\n\nNew Year’s day.\n","18":"\n\nArrived Bombay 8 a.m. Sail 4 p.m.\n","19":"\n\nQuiet day.\n","20":"\n\nFire alarm practice.\n","21":"\n\nQuiet day.\n","22":"\n\nQuiet day.\n","23":"\n\nArrived Aden 7 a.m. Left 2 p.m.\n","24":"\n\nSports aboard. Concert in evening on Second Saloon deck.\n","25":"\n\nArrived Suez 6 p.m. Disembarked. Left by train from wharf 12.30 p.m. Ride in train, arrive in Camp about midnight. Aerodrome Camp, Heliopolis. Keystone speed and Keystone carriages.\n","26":"\n\nNew quarters – jumble up day.\n","27":"\n","28":" – fine day – quiet.\n","29":"\n","30":" Visit to Heliopolis. Bert Argall shows me round the town. Have tea together. Am stoney broke, so Bert pays the piper. We attend American Soldiers Y.M.C.A. service.\n","31":"\n\nMeet Fizzr Flin and hear about Hay.\n","32":"\n\nFirst Route March with full pack, around Heliopolis. Visit Obelisk (erected three hundred years before birth of Moses). Visit Holy Tree and Mary’s Well. March about seven miles – not yet able to do my fifteen miles.\n","33":"\n\nChurch Parade. Shift camp, from tents into huts.\n","34":"\n\nRoute march, with full pack. Rain in afternoon. Rain at night time came through roof of huts.\n","35":"\n\nRoute march to dry our clothes.\n","36":"\n\nAnniversary Day. Bert Argall and I pay a visit in the\n\nevening to Headquarters, Cairo, to meet Mac. He is looking well. We three went to the Methodist Soldiers Hall and spent an enjoyable evening.\n","37":"\n\nGeneral inspection of troops by General Birdwood.\n","38":"\n\nIssued with our rifles.\n","39":"\n\nQuiet day. Visited Cairo with Bert Argall by night. Listened to Concert at the Y.M.C.A. Splendid items – enjoyable evening.\n","40":"\n\nAlarm raised. Native rising, but soon quelled. Two hundred rounds served to us all and provisioned for twenty-four hours, but not required. Visit Methodist Hall, Cairo, by night, and hear God’s word. Of course Bert was with me and again we met Mac.\n","41":"\n\nRise 6 a.m. Proceed to Kasr-el-Nil at 8 a.m. with full pack (march about nine miles) and then go on picket duty at 6.30 p.m. same night till 1 a.m. next morning. Worst job I ever had, to think that our own lads sink so low. Their best friend is the Picket.\n","42":"\n\nReturned to Heliopolis at 7 p.m. Issued with bread and sardines.\n","43":"\n\nLecture on Visual training.\n","44":"\n\nCommence preliminary musketry.\n","45":"\n\nShoot at Miniature Range.\n","46":"\n\nIssued with Lady McQuarrie Patriotic Society’s shirt and sox.\n","47":"\n\nProceed to Tel-el-Kebir. Rise at 3.30 and march to Helma Station and there entrain in open trucks. Arrive at Tel-el-Kebir about noon, and there join our battalion. Meet Sergeant Butt’worth who belongs to","48":" Battalion. Notable features of Tel-el-Kebir – miles of old trenches left by Arabi Pascha, who built them and used same against the British. The English and Scotch lost three hundred and forty lives. The Scotch smashed the Araboup with a bayonet charge. We drilled and paraded over the ground that was once a battlefield. As usual the Y.M.C.A. are here with a structure for our comfort.\n","49":"\n\nLeave Tel-el-Kebir for the Suez Canal. Arrive there about 3.30 p.m. We are now on the Arabian side of the canal. Plenty of sand. Great shortage of water.\n","50":"\n\nKit inspection. Lighten our kits to enable us to endure a longer march. In afternoon are taken for swimming parade in Suez Canal. Write to Mother and Jack.\n","51":"\n\nA, C and D Companies go on outpost. We left at the base for guards and fatigues.\n","52":"\n\nMount Guard at 1700.\n","53":"\n\nDusty day. We are paid one hundred Disasters. Jim Bryden goes to Hospital with mumps. Dismount guard at 1700. Have a yarn with Chas. Griffiths.\n","54":"\n\nSunday, Church Parade in the morning.\n","55":"\n","56":" morning. Divine Service by Presbyterian Minister. Bathe in Canal (Suez) in afternoon.\n","57":"\n\nHot day. Rifle drill. Bayonet exercises and Company Drill. Afternoon, swimming parade.\n","58":"\n\nTransferred to Pioneers. Worst move I ever made.\n","59":"\n\nWindy day. Receive news from Mother. Nan on her own. Write to Mother and Uncle. Pitching Camp all day. Am reconciled to the change. Charlie Griffiths is also in my Company.\n","60":"\n\nReceive letter from Mother and Uncle that should have reached me earlier. Nan is employed by the Ministry of Munitions. Mother says that her health is improving. We are issued with condensed milk and syrup given by the Queensland Patriotic People. Good luck to them.\n","61":"\n\nInnoculated again. Meet Dr Colvin. Fine clear day.\n","62":"\n\nFine day. Issued with Tobacco and cigarettes and general review of First Brigade by Gen. Chappel who then handed his command over to Brigadier General Walker.\n","63":"\n\nIssued with rifles again.\n","64":"\n","65":" General inspection by the Prince of Wales and General Birdwood. The boys cheer the Prince exultantly.\n","66":"\n\nWe are told that France is in sight for us.\n","67":"\n\nPractice bomb throwing. I make a very poor shape. Swim in Canal. Strenuous day, but I don’t care – always ready next morning for more.\n","68":"\n\nRise 6 a.m. Inspection by Major Nicholson. Full marching order. The Major tells us we are to leave on the morrow, and also expresses his satisfaction with our progress. We go for a short route march. I am feeling fit. Our Parson is introduced to us by the Adjutant. The Reverend gentleman counsels us and in a few straight words tells us to be disciplined in character as in drill, and to control filthy tongues, to leave our evils behind us and make a fresh start in France, with the object of being a credit to our Division. He also tells us that the Battalion will shortly be given a motto, and finally comes to a close by telling us that He will be with us in our fortunes as in our misfortunes, and if\n\nwe come through we must endeavour to be in such a position that we can look back realising that our duty has been faithfully accomplished.\n\nThe Parson’s address completed, we moved back to Camp. After dinner I go for a final dip in the Canal. Issued with our Gas Respirator, also twenty-four hours’ rations of bully and biscuits. Respirator sewn on the inside of our coats. Camp fire Concert at night, presided over by Major Nicholson. Officers and men contribute. The Major wished the men good luck and again counselled us. An enjoyable evening, brought to a close by the boys singing the National Anthem, and then cheers were given for the Officers, and the Officers in a gentlemanly way gave three cheers for the men. So ended our last day in Serapeun, Arabia.\n","69":"\n\nRise 3.30 a.m. Breakfast 4.30. Form up on Battalion Parade Ground 5 a.m. Move off 5.15 a.m. March to station and entrain 6 a.m. Travel in special carriages – I mean \"Cattle Trucks\". Arrived at Alexandria 4.30 p.m. Board ship 5 p.m. Sleep up on Hurricane deck. Name of Ship S.S. \"Ballarat\".\n","70":"\n\nSail from Alexandria 7 a.m. Escorted by a little destroyer. Lovely weather.\n","71":"\n\nFine weather. Submarine Guard – mount at 9 a.m. Pass\n\nland which I believe is Crete, with mountains that appear to be snowcapped.\n","72":"\n\nFine calm day. Call at Malta 12 noon, but sail about 12.30. Machine gunners practise and shot a shark.\n","73":"\n\nArrive in Marseilles about 1.30 in morning. Disembark, 2.30 p.m. Meet Jim Bryden who had been left behind on guard until the First Division goes through. Entrain and leave Marseilles about 4 p.m. by train. French ladies welcome us as we pass through on train. We are issued with tea and rum at about 10.30 p.m. I am on Train Guard, and so ends my first day in France.\n","74":"\n\nDismount guard 9 a.m. Travel all day. Such beautiful scenery. Mourning is very noticeable. The gentle sex are in many cases stricken with grief. The War is now becoming more real to us as we see these people who are fighting and suffering, hoping and praying for the enemies’ speedy defeat. Towns we passed: Avignon, Fleurville, Tyers, St. Germain, Duc Delay, Chalon-sur-Scone, Fontaines, Sennally-le-Grand, Crilly, Bearne, Neut St. Georges, Malain La Roche.\n","75":"\n\nHurrah! Had a wash at E. Pluches, also hot water for tea.\n\nFeel quite refreshed. First wash since I left the boat. Major tells us that he is out to do his best for us if we play the game. Slept on the seat all previous night. Stations to-day: L.I. Ancourt-Rantigly, Clermont, Avrenchy, St. Just, La Faloise. First armoured train I ever saw was here. Longueau, Amiens. We stopped for half hour at Abbe Ville, Rue, Conchil-le-Temple, Saint Gorse, Etaples, Boulougne, Calais, and dis-entrained at Godervuersuelde.\n","76":"\n\nArrive at the above mentioned village at 1 a.m. We march a little way and bivouac in roadway at about 2 a.m. Rise again 5 a.m. Breakfast and march about five miles on to the next village. Arrive there about 11 a.m. and are billeted in a barn. The Major speaks to us and warns us against drunkenness. We go to buy bread. Civilian trys to buy, but shop-keeper refuses sale. Informs us that my joker only buys to sell at an exorbitant profit again to soldier. The old lady sells to the soldiers cheap. Write to Mother and Jack and retire early. Thus ends first day in this portion of the country.\n","77":"\n\nPlay games in the forenoon. On fatigues in the evening. Go to bed at eight o’clock.\n","78":"\n\nFatigues again. Stiffen them. March two miles to load transports at Straselle. Get a nine mile route march in the afternoon. Retire at 8 p.m.\n","79":"\n\nCompany and rifle drill in morning. Route march in evening. Wrote to Mr McCoy and Mrs English. Retire at about 8 p.m.\n","80":"\n\nEarly morning parade, also Church parade. Text – \"Be temperate in all things\", and after service we march to Strazelle and go through test in trenches – one for poison gas and the other for weeping gas. We arrive back to billet (Croix-Rouge) one p.m. for dinner and rest for remainder of day. Receive another letter from Mother dated April 5th, and write to Jack. Retire about 8.15 p.m.\n","81":"\n\nEarly morning parade, also Company Drill and Bayonet exercises. Afternoon, commence to make field desk for O.C. of Company. Paid 8.30 p.m. Retire 9.45 p.m.\n","82":"\n\nWork at desk all day.\n","83":"\n\nWork at desk and finish same. Commence on tool box. Wet\n\nday. the company march twelve miles. Retire about 8 p.m. Some of the men land home again, drunk, and behaving like fools.\n","84":"\n\nBuild tool box. Size 33 x 1\/8 x 8. Lieut. Clayton – good luck to him. I know he is capable. The boys went out to drill for the morning parade. Sports held in the afternoon. Retire about 8 p.m.\n","85":"\n\nWork at tool box and stool and finish them. The boys were out on a fifteen mile route march. Wet day. The boys return to billet. Some of them lame. Retire early.\n\nJokes of the past week: On Bayonet drill, Private asks Sergeant Stevenson, \"How about the butt-attack?\" Reply – \"Yous had ye issue of butter last night.\" By the way, so we did. Sick Parade. Day previous big route march. Result – next morning big parade of men with bad feet. Hill parades with one boot and sock in his hand and the other on the other foot, but on the way to the dispensary he notices that a big number of the men are complaining about their feet, so he does not want to make it too solid, and promptly alters his mind and tells the doctor that he has a sore throat. I wonder if the doctor thought a sore throat had any relation to the boot that the soldier carried in his hand. By the way, the doctor asked him if that was all he was suffering from.\n\nAnother spark of ours after a tiring day, says no parade for him next day. He says that he will rise 4.30 next morning and wash one leg and then parade with rheumatics.\n","86":" and 16th:\n\nMaking Chests etc. for the Company Officer, etc.\n","87":"\n\nFine day. Church Service in morning. Take a walk to Caestre in afternoon. Called out for inlying picket. Hopeless bungle. March to Fletre in evening to round up men. Return about 9.30 and immediately retire.\n","88":"\n\nRise 6 a.m. Work till 2 p.m. at chests etc. Make up pack ready for the morrow, am called for a little job for the Major at 5 p.m. and finish by 5.30. Visit Castre at night and buy little necessaries – mirror, belt. Retire about 9 p.m. The village we are billeted in is called Rouge Croix, close to Caestre and Strazelle and Hazebrouch.\n","89":"\n\nWet windy day, but that’s nothing. Rise 4.30 a.m. Breakfast 4.45 a.m. Commence our march with full packs (minus blankets) at 6 p.m. We pass through Meten, Bailleul, Sternwerck, Au-Croix, Croix, St. Mair. We march about fourteen miles and are given hot tea on the road. Very acceptable. We arrive a bit stale, but in good condition, and are given tents,\n\na section to a tent. We retire about 8 a.m. Our new abode is called Bag-St-Maur.\n","90":"\n\nQuiet day of rest. Some of the 1st Inf. Batt. have been in action here. The rest of them go in to-day. The Officers in Command are promoted. Retire about 8 p.m.\n","91":"\n\nQuiet day, but dry once more. A few shells knocking about. Retire about 8 p.m.\n","92":"\n\nAeroplanes all over us. Shell case lands just near our camp. We go up to the trenches at night, and after getting wet through do no work, but return to Camp (a three mile march) with no change of clothes. We go to bed at 12 p.m. First experience in the trenches.\n","93":"\n\nRise early, proceed to dry all clothes, go out to trenches about 1.30 p.m. and work at parapet building on the communication trench. V.C. Avenue: A few shells lob a couple of hundred yards from us. We return to camp at 8 p.m. The house where we get our picks and shovels is called V.C. House. I arrive back to camp again wet through. It wants ducks for this job. I get tea and retire, thankful for a couple of dry blankets and have a good night’s rest.\n","94":"\n\nRise about 8 p.m. The boys give me my breakfast in bed. Good luck to them! I rise and dry my clothes once again. It is a lovely day and so I dry them on the hedge by the little stream that runs at the foot of our camp. I help to dig trench in afternoon for our own protection and go up to village. Retire about 9 p.m.\n","95":"\n\nRise 6 p.m. Fine. We march out to trenches at 7.30 a.m. We make an attempt to build up the parapet, but the Germans give us a warm time. They shelled us heavily with 77 shells. Our Sergeant Partridge and a Private injured. I write home to Jack. I retire about 8 p.m., thankful to God for His care and guidance.\n","96":" – Anzac Day:\n\nWe march to the trenches, and arrive there. They give us good morning with more shells. We do a little bit in the trenches, and are not shelled again until we are leaving, about 4 p.m.\n\nSergeant Partridge buried to-day. We are informed that we are not to expose ourselves on the parapets in the day-time any more. Retire about 9 p.m.\n","97":"\n\nFine day. Rise about 6 a.m. March to trenches. Good\n\nmorning again more shells. They keep up a fair shell fire round V.C. House, but we are beginning to get used to them. We work in the communication trenches, and go back to our Camp at night after a fairly quiet day. Receive letter from Mother. Retire about 9 p.m.\n","98":"\n\nRise about 6.30 a.m. Fine weather. Very quiet day. No Kaiser’s cough-drops on us to-day. Our aircraft seem to have been very busy. Retire about 9 p.m.\n","99":"\n\nRise early. Disturbance night before. Hauled out of bed from 11 p.m. till 1 a.m. on gas alarm. We go to our work as usual. Quiet day. Captain Champion of 1st Battalion hit. They send some shells over but they are not near us. I pay a visit to the B Company Boys, 1st Batt. Retire about 9 p.m. Lovely day.\n","100":"\n\nRise 6.30 a.m. Same task, lovely weather, quiet day. Receive news from Mother and Nan.\n","101":"\n\nRise 6.30 a.m. Same task. Fine day. Fritz leaves us alone to-day, except a shot or two from Snipers. Receive parcel from Mother containing cheese, salmon, butter, chocolate, Eccles Cakes: retire about 9 p.m. Write home to Mother.\n\nTaube brought down to-day.\n","102":" Mother’s day:\n\nRise 6.30 a.m. March out again to Trenches. We work at filling sandbags. Lovely day. Fritz drops forty shells towards 1st Brigade Headquarters. Result – five men wounded. Ah, well, Fritz, make the most of it. Your reign is nearly expired. A start made with leave for the men. In the morning about 8 a.m. I watch an Anti-aircraft gun in action. My word, he made the German Taube go for his life. Retire about 8 p.m.\n","103":"\n\nFine day. We march out to work as usual. Arrive back to Camp at 1 p.m., owing to receiving order to cease work, because shells were expected. Our aircraft has been very busy to-day. Retire about 9 p.m.\n","104":"\n\nRise 4 a.m. Ride out on waggons to Sailby 5 p.m. Erect dormitories, but in the midst of keystone artists. Return to camp about 5.30 p.m. In charge \"Mary Ann\", the Champion Timber Slicer, but he can’t squeeze a length to make it longer, by my side, Champion skew cutter, must run away on his own instead of to the line. Receive parcel from sister and send her letter. Retire about 8.30.\n","105":"\n\nRise about 4.45 a.m. Ride out on wagon to job. Return to Camp about 5.30. 1st Battalion shelled in their billets to-day – a few casualties. Fine day. Retire about 8.30 p.m.\n","106":"\n\nRise 4.30. Ride out to work. Fine day. Return to Camp about 5 p.m. Gas alarm at night.\n","107":"\n\nRise 5 a.m. Ride to work. Work all day. Return 6.30 p.m.\n","108":"\n\nRise 5.30 a.m. Work all day. Billet in bombing school quarters. Retire about 9 p.m.\n","109":"\n\nRise 6.30. Work all day up till 11 at night. Cold and drizzling rain. Retire about 11.30 p.m.\n","110":"\n\nRise 7 a.m. Work all day till 4 p.m. Rainy day. Retire at 8 p.m.\n","111":"\n\nFine day. Work all day building new huts. Return to camp 4.30 p.m. Retire 8 p.m. Write to Mother.\n","112":"\n","113":" as above. Usual routine. Letter to Jack.\n","114":"\n\nWet day. Rise 5 a.m. Work on huts till 3.30 p.m. Hot bath at Divisional Baths. Retire about 8 p.m. Letter to Mother.\n","115":"\n\nRise 6 a.m. Off to work as usual. Return to Camp 4.30.\n","116":"\n\nRise 5.30. Fine. I ask our Lieutenant to allow me back to trenches as I am not contented at this work. No definite reply to my query. Work all day building huts. Return to Camp 5.30 p.m. Retire 8.30 p.m.\n","117":"\n\nRise 5.30. Work at Huts all day. These huts are really hospital wards for the A.M.C. Back to Camp 5.30 p.m. Retire 9 p.m.\n","118":"\n\nRise 5.30 a.m. Ride out on transports to Bombing School (Sailley) erect hut, return home 5 p.m. Gas alarm at 8 p.m. Retire 9 p.m. Fine day.\n","119":"\n\nRise 5.30 a.m. Work on hut till 11.30 a.m. Dinner till 1.30 p.m. Tear down another hut in Sailley, till 3.30 p.m.,\n\nthen return home and help to erect our billet, and take possession of same. Retire 9 p.m. Receive letter from Nan.\n","120":"\n\nRise 6 a.m. Fine day. I stay home to-day and work on our billet, building bunks and mess table. The boys go out to Fleurbaix and dismantle two huts. Retire 9 p.m.\n","121":"\n\nRise 5 a.m. Ride on waggon to A.S.C. Sailley and erect sleeping hut, size 24 x 16. Ankle a bit weak, but that’s nothing. Fine day. Receive news from Nan. Retire 9 p.m.\n","122":"\n\nA fine day. We are given a welcome spell. Rise about 8 a.m. Granted leave to visit Sailley. Write to Mother, Uncle and Nan. Walk in to Sailley in afternoon. Spend a quiet, enjoyable day. The weather is perfect. Retire about 8 p.m.\n","123":"\n\nRise 5 a.m. Ride out to A.S.C. Sailley at 6 a.m. Work all day and return from work at 5 p.m. First portion of day fine. Showery towards evening. Retire 9 p.m.\n","124":"\n\nRise 5.30 a.m. Ride out on transports to erect old huts near Fleurbaix, and make souvenir in the form of transparent square. The huts have been under fire. Return to Billet at \n\n5 p.m. Fine day. Retire 9 p.m. Write to Mother.\n","125":"\n\nWeather fine during day. Showery towards evening. Rise 5.30. Walk out to work at Army Medical Corps Clearing Station, erecting huts. Retire 9 p.m.\n","126":"\n\nShowery, but decent. Rise 5.30 a.m. Stop home to-day and help cook and do general cleaning up to billet. Write to Jack. Our first reinforcements arrive here about 7 p.m. Retire 8.30 p.m.\n","127":"\n\nRise 5.30 a.m. Fine day. Work all day, Army Medical. Retire 8.30 p.m.\n","128":"\n\nRise 5.30 a.m. Fine. Work out at A.M.C. Clearing Station again to-day. Quiet day. Retire 8.30 p.m.\n","129":"\n\nFine day. Rise 7 a.m. Commence work at A.M.C. and complete at noon. After lunch, we go to work in a shed near the Divisional Baths, flooring. Return home at 4.30 p.m. Commence to draw plan for our Sergeant of our new huts 24 x 16. Retire 9 p.m.\n","130":"\n\nRise 5.30 a.m. Fine day. Work at our own transports\n\nyards, erecting stables, till noon. Afternoon work on erection of billet for No. 1 and 2 Platoon of A company till 4.30 p.m. Write re uniform to London. Retire 9 p.m. General Walker inspected the billets etc. of our Battalion to-day. I complete plan. Sergeant satisfied.\n","131":"\n\nRise 6 a.m. Work at A Company’s billet till 3.30 p.m. Showery day. Retire 9 p.m.\n","132":"\n\nRise 5.30 a.m. Fine day. Ride out on Transport to work building staged 30 x 18, near Estanis. Last night heavy bombardment by the Germans. Big death roll amongst our Infantry, principally 11th Batt. Our trenches shelled with high explosives. Return home 5 p.m. Retire about 9 p.m.\n","133":"\n\nRise 5.30 a.m. Fine. Ride out to job and again work on stages. Return to billet at 5 p.m. I watch one of our observation balloons get shelled and become adrift. I watch her float away out of sight. Another move to Fritz, but by no means a king move. The day over, retire about 9 p.m. Receive news from Uncle George and write to him to-night.\n","134":"\n\nRise 5.30 a.m. Work all day on stages. Return home 5.30. Fine. Retire 9 p.m. Heavy bombarding through the night.\n","135":"\n\nRise 5.30 a.m. Ride out on waggon to work and complete job. Return home about 5 p.m. Retire 9 p.m.\n","136":"\n\nFine. Rise 7 a.m. Kit inspection by Officer in Charge, and then a day’s rest. Go for walk in afternoon, on leave pass. Purchase a little kerchief and cards for Mother. Retire 9 p.m. Heavy bombardment through night. Our boys are giving them a taste.\n","137":"\n\nRise 5.30 a.m. Ride out on waggons to stage job again, it having sunk already. We strengthen it. Work at it all day. Return home 5 p.m. Send Mother two handkerchiefs in green envelope. Retire 9 p.m.\n","138":"\n\nRise 5.30 a.m. Off to work on timbers. Wet day. Complete platforms. Return to billet 5 p.m. Retire 9 p.m.\n","139":"\n\nRise 5.30 a.m. Fine day. Stop home and attend to cleaning of billet. Showery day. Retire 9 p.m.\n","140":"\n\nRise 5.30. Ride out to new job Bag-St-Maur, erection of little huts. Return home 5 p.m. Write to Jack.\n","141":"\n\nFine, with an odd shower. Rise 5.30 a.m. Ride out to Bag-St-Maur on limbers. Work on hut 24 x 16 for French resident, whose home has been burned down by accident. Return to billets 5 p.m. Retire 9 p.m.\n","142":"\n\nUnsettled. Rise 5.30 a.m. Ride out on limbers to job. Return home 5.30 p.m. Receive French Book from sister. Retire 9 p.m.\n","143":"\n\nShowery. Rise 5.30. Work all day and finish job. Return to billet at 6 p.m. Receive letter from Nan and hear that Jack has at last heard from me. Retire 9 p.m. Write to Mother.\n","144":"\n\nShowery. Rise 5.30. Go to Bag-St.-Maur and collect timber from jobs. Spend the rest of the day in loading building material from R.E. Stores. Return to Billet 5 p.m. Retire 9 p.m.\n","145":"\n\nWet day. Rise 5.30. Ride out to Saw Mill Sailley, and there our timber is cut. From there we go on to 1st A.S.C. and commence to construct huts. Return home 5 p.m. Receive news from Uncle. Retire 8.30 p.m.\n","146":"\n\nWet day. Rise 5.30 a.m. Ride out on limbers to job, Sailley. Work all day. Return home 5 p.m. Retire 8.30. French Daylight Savings Bill, 11 p.m. to-night, clock put forward one hour at the above mentioned time.\n","147":"\n\nShowery. Rise 5.30. Ride out to Sailley on limbers. Work all day at above mentioned job. Return 5.30 p.m. Retire 8.30 p.m.\n","148":"\n\nRise 5.30., dull, but dry. Ride out on limbers to job. Work all day. Return to billet 5 p.m. Retire 8.30 p.m. Heavy Bombardment through night, followed by a gas attack. The gas reaches us but is mild. I do a bit of coughing but nothing to speak about. We return to our beds at 3.30 a.m.\n","149":"\n\nFine. Rise 5.30 a.m. Work on officers’ hut at 1st A.S.C. Ride out on limbers, return home 5.30 p.m. Retire 9 p.m.\n","150":"\n\nFine day. Rise 7.30 a.m. We are given a day’s spell. Inspection of rifle and gear at 9.30 a.m. I afterwards walk in to Estaires, and make a few purchases. Return to billet 6.30 p.m. Retire 9 p.m. after a quiet peaceful day.\n","151":"\n\nDull but dry. Rise 6.15 a.m. Walk out to A.S.C., near Estaires. Work there all day on Officers’ Quarters. Return 5 p.m. Receive news from Mother. Write to Mother and Nan. Retire 9 p.m.\n","152":"\n\nDull. Rise 5.45 a.m. Ride out on limbers to job. Work there all day. Return to billet 5 p.m. Post mail to Mother and Nan. Retire 9 p.m.\n","153":"\n\nFine, but cool for the time of the year. Longest day (Nineteen hours daylight). Rise 5.30 a.m. Ride out to job. Walk home to billet 5 p.m. Lance-Corporal Edwards, and Private Ryan of D Company awarded Military Medal for assisting to rescue unconscious men who were overcome with gas fumes. They risked their own lives to save their mates. Sergeant Thomas who belonged to A Company was also awarded some medal for the same work with these men. Splendid sight before going to rest. Ten aeroplanes up. About eight of them over the German lines, amidst a veritable myriad of shells and yet they return to us safe. A sight of a life time.\n","154":"\n\nFine. Rise 5.45 a.m. Ride out on waggon to job. Commence on harness rooms to-day. Return to Billet 5 p.m. Retire about 9 p.m. after a quiet day.\n","155":"\n\nFine morning. Thunderstorm, 5 p.m., with rain. Rise 5.30 a.m. Ride out to A.S.C. on limbers and work all day. Return to billet 5 p.m. Retire 9 p.m. Write to Mother, Jack, and send field card to Mr McCoy.\n","156":"\n\nRise 5.30 a.m. Wet day. Ride out on waggon to work. Return again 5 p.m. Fine again towards latter part of day. Poor old Bill sent back to the Company. Mr. Booze, you do more damage to temperate living than the Germans. Load up waggon with cement and sandbags at 8 p.m. Retire after a busy day at 9 p.m.\n","157":"\n\nFine. Rise 7.30 a.m. Day’s spell, sewing my clothes etc. inspection of rifles and gas helmets at 10 a.m. by our Sergeant. We throw half a franc in to our cook, and are rewarded by a hot dinner of roast beef, cabbage and new potatoes, and one of the boys gives me some stewed peaches. Retire 9 p.m. after a quiet enjoyable day.\n","158":"\n\nFine, with an occasional shower. Rise 5.30 a.m. Ride out on waggon to 1st A.S.C. Work on harness shed. Return home to billet at 5 p.m. Retire 9 p.m.\n","159":"\n\nShowery. Rise 5.30 a.m. Ride out on limbers to Sailley. Work there all day, and walk home to billet at 5.30 p.m. Retire 9 p.m.\n","160":"\n\nShowery. Rise 5.30 a.m. Ride out to job. Work and finish harness room. Return home 5 p.m. Decide to learn French if possible. Retire 9 p.m. and bombardment through night.\n\nThursday, June 19th:\n\nDull, but does not rain. Later in day, fine. Rise 5.30 a.m. Ride out on waggons to","161":" A.S.C. Commence another harness room. Return home to billet 5 p.m. Retire 9 p.m. Heavy bombardment by our artillery.\n","162":"\n\nSlight showers. Rise 5.30 a.m. Ride out on limber to work. Return to billet 5 p.m. Retire 9 p.m.\n","163":"\n\nRise 5.30 a.m. Fine ride out on waggon to work. Return home 5 p.m. Finish another harness shed. Retire 9 p.m.\n","164":"\n\nFine. We expect to move at any time. Rise 6.30 a.m. Rifle inspection and rifle and platoon drill.\n","165":"\n\nFine. Rise 5.30 a.m. Ride out to 1st A.S.C. and commence on new hut. Great sight to-day. Air duel between a German and one of ours. Ours was hit and our fellow volplaned to the ground. Hard luck! He was gaining fast on Fritz when he dropped. Return to billet 5 p.m. Retire 9 p.m. Receive news from dear old Mother. God bless her. I lay listening through the night to our armoured train crawling along and giving Allemond a few shells, always moving from place to place and dropping a shell and then off again. The Tommies began their offensive last Saturday and in conjunction with the French have met with wonderful success.\n","166":"\n\nRise 5.30 a.m. Showery. Ride out on waggon to job. Return to billet 5 p.m.\n","167":"\n\nManages to keep fine. Work on Officers’ quarters at above job. Return home 5 p.m. Coming home with three others riding in the rear limber, when she comes apart from the leader right in a busy spot where there were plenty of on-lookers. Of course it was a great joke. Prepare for another move. Retire 9 p.m. Twelve midnight, gas alarm, but the fumes never reached us.\n","168":"\n\nRise 5 a.m. Fine. Prepare for move. Pull our own billet down and then pull down A Company’s. Load up Motor Transports, and ride out to new area, through Stenwreck, and arrive at \"Aldershot Camp\" about twelve noon. We re-erect structures and finish our day’s work at 8.30 p.m. We then retire after a full day.\n\nAllemand sends some shells over. It seems like a welcome to us, but he does not reach us, although he gets some poor chaps further along the road.\n","169":"\n\nRise 7.30 a.m. Showery. Commence another day’s toil, re-erecting huts, finish 5 p.m. Retire 9 p.m.\n","170":"\n\nRise 5 a.m. Ordered to pack up at once, which we do. Breakfast and then load up waggons and march back to Bag-St-Maur – a nine mile march. We are then ordered to prepare for another departure next morning. Retire 9 p.m.\n\nMarch consisted of full pack without blanket and waterproof.\n","171":"\n\nFine. Rise 2.30 a.m. Breakfast 4 a.m. Move off 5 a.m. Sailley, Dolwen (Church roof blown off here), Merris. Arrive Merris 11 a.m. (Time occupied spelling one hour). The march was well conducted. Full pack and blanket and waterproof. Tea was served when we halted for a spell at 8 a.m. and had\n\nbreakfast. We billeted in the detention camp for the night, march was about ten miles. Write to Mother and field card for Jack. Retire 9 p.m.\n\nAldershot Camp was in the Belgium border.\n","172":"\n\nFine. Rise 5.30 a.m. Physical drill. We leave our billet at Merris 6.30 p.m. Arrive at Godersvelde (distance of march, 6½ miles) 8.45 p.m. Once again we bivouac there for the night. We are granted leave that night till 10 p.m. to visit the village. The march from Merris was not so difficult because we had the cool of the evening (full pack and blanket and waterproof). Retire 10 p.m.\n","173":"\n\nReveille 3.30 a.m. Fine. Pack up and get drink tea, march to station and entrain. While at Merris I visit the local R.C. Church. Part of the ceiling was destroyed by rifle fire of some sort, some of the windows have been smashed. The interior was gracefully designed, with statues of the Virgin Mary and Jesus on the Cross – in fact a fair number of figures were in evidence. A great deal of carving was in evidence. The material was a very good class of oak. I saw the confessional boxes. The lovely pulpit with its winding stairway, the Christening Font, and another article that had some red liquid in it; this receptacle was on a sort of ornamental dish. The woodwork was certainly the work of experts\n\nand had the real good old oak appearance. The roof consisted of a steep main gable with two valleys running into two shorter gables so – and on to these gables the roof then ran to the other end from entrance in the form of a half dome. The wall supporting the dome was filled in with lovely windows finished in the Gothic style, and ornamented with figures of Saints etc. These windows appeared to form the background for a beautiful piece of work in an elegant framework and under this structure was a figure in the lying posture of one of their martyrs. Of course a lovely pipe organ completed the furnishing of this church. The organ was built on a gallery on the entrance end of the Church, but after all I am glad that God listens to us here in any place just the same as in the elegant Church, and sometimes I wonder if God is altogether pleased with all this elegance. It is tip top, but I am afraid that the people’s lives are not altogether in keeping with their lovely Churches. Well, I am travelling in the train now and I do not know where I am bound, but we have just passed through Caestre, Croiches, Tuchel, Doullens. We disentrain at Doullens at 2.30 p.m. We leave 2.45 p.m. and march on through Bagneux at which village we halt for dinner at 4 p.m. We leave Bagneuse about 5.15 p.m., then on to Candas, where we see the Flying Corps men, and arrive at Canaples at about 8.30 p.m. March distance about nine and a half miles. We are billeted for the night. Retire about 10 p.m. and bivouac for the night and have a good night’s rest.\n","174":"\n\nRise 8 a.m. Pack up and move off again at 9.45 a.m. on to Monton Villiers, a distance of eight miles. Arrive there about 1 p.m. We are billeted in one of the sheds standing in the grounds of an old Chateau. I visit the family vault and have a look round. There is also the Chapel R.C., lovely trees – in fact an ideal place to spend a few days. The little Chapel is built right over the vault and inside the Chapel is an altar and candles, and a chair for each one of the bodies in the vault, with their respective names printed on the chair. Retire 10 p.m.\n","175":"\n\nRise 6.30 a.m. We spend the day drilling, and march to and from the parade ground with full pack and blankets. This is by way of a rest for men who have only been a few days out of the trenches. If they are trying to break our hearts, well and good, I will carry on till I drop. I can do no more than that. The day has been unsettled, but only a little rain fell. I receive news from Mother and reply to her. Retire at 10 p.m.\n","176":"\n\nShowery. Rise 6 a.m. Route march in forenoon with full packs, minus blankets because of rain. Afternoon devoted to verbal message and bayonet fighting. The men are in a fatigued condition on account of the ridiculous treatment by their\n\nCommanders. In the evening an open air concert is held and the Officers and men take part. The Chaplain is responsible for the entertainment. Retire 10 p.m.\n","177":"\n\nFine. Rise 6 a.m. Battalion parade and bayonet fighting in forenoon. Evening, one hour to drill and remainder of evening to sports. After tea, concert in which officers and men take part. Retire 10 p.m.\n","178":"\n\nRise 6 a.m. Fine. Full pack again. We are on the move. We were sent to this place to do certain trench work, but the advance has been so successful that they did not require our assistance. Hence we are on the move once more. We leave Monton-Villiers at 9.15 a.m., Fontoncourt, and then on to Harponville, where we reach about 2.30 p.m. We are billeted here in a barn. Retire 9.30 p.m.\n","179":"\n\nShowery. Rise 8 a.m. We go out on route march, pack without blankets, in the forenoon. We walk about seven miles. In afternoon we are on parade again, but only drill order. Retire 10 p.m.\n","180":"\n\nDull and showery. Rise 7 a.m. We have to hold ourselves in readiness for another move. Pick up Sunday’s paper to-day\n\n(16th). List of Australian killed. Bert Argall 2330. Goodbye, Bert. You were one of the real good sort. Your character and moral temperament were an example to us all. Your life was given for a righteous cause. May God comfort your own dear ones in the hour of darkness and distress. May they realise that you died fighting in freedom’s cause. You lived for the right and you died upholding justice and purity, the lovely graces which the Hun would besmirch. I was with you and G. McInnes at the Ezbekiah Gardens and the Methodist Room for soldiers, Egypt. Retire 10 p.m.\n","181":"\n\nRise 6 a.m. We leave Harponville at 3 p.m. and catch motor omnibuses to Albert, then march close to La Bosselle, where we bivouac and then out to trenches at dusk. We get lost and don’t arrive to bivouac quarters till next morning about 5 a.m.\n","182":"\n\nArrive to bivouac as stated above, turn in, try to sleep, but the guns are too constant to allow slumber. We go out again at night and dig trenches in No Man’s Land. We are treated to shells, trench mortars, and have a hot time. You bet we dug in for our lives, but I arrive home safe again, but feeling weary and fatigued. Return home about 4 a.m. on the 21st.\n","183":"\n\nArrive to quarters about 4 a.m. We march to billets at Albert where we rest for the day. Retire 9 p.m.\n","184":"\n\nRise 8 a.m. ….\n\nSniped 9 a.m. Shot in thigh. Taken to Dressing Station, thence to 5th General Hospital, Rouen.\n\n"}}