{"Document Name":{"0":"Diary_0089","1":"Diary_0089","2":"Diary_0089","3":"Diary_0089","4":"Diary_0089","5":"Diary_0089","6":"Diary_0089","7":"Diary_0089","8":"Diary_0089","9":"Diary_0089","10":"Diary_0089","11":"Diary_0089","12":"Diary_0089","13":"Diary_0089","14":"Diary_0089","15":"Diary_0089","16":"Diary_0089","17":"Diary_0089","18":"Diary_0089","19":"Diary_0089","20":"Diary_0089","21":"Diary_0089","22":"Diary_0089","23":"Diary_0089","24":"Diary_0089","25":"Diary_0089","26":"Diary_0089","27":"Diary_0089","28":"Diary_0089","29":"Diary_0089","30":"Diary_0089","31":"Diary_0089","32":"Diary_0089","33":"Diary_0089","34":"Diary_0089","35":"Diary_0089","36":"Diary_0089","37":"Diary_0089","38":"Diary_0089","39":"Diary_0089","40":"Diary_0089","41":"Diary_0089","42":"Diary_0089","43":"Diary_0089","44":"Diary_0089","45":"Diary_0089","46":"Diary_0089","47":"Diary_0089","48":"Diary_0089","49":"Diary_0089","50":"Diary_0089","51":"Diary_0089","52":"Diary_0089","53":"Diary_0089","54":"Diary_0089","55":"Diary_0089","56":"Diary_0089","57":"Diary_0089","58":"Diary_0089","59":"Diary_0089","60":"Diary_0089","61":"Diary_0089","62":"Diary_0089","63":"Diary_0089","64":"Diary_0089","65":"Diary_0089","66":"Diary_0089","67":"Diary_0089","68":"Diary_0089","69":"Diary_0089","70":"Diary_0089","71":"Diary_0089","72":"Diary_0089","73":"Diary_0089","74":"Diary_0089","75":"Diary_0089","76":"Diary_0089","77":"Diary_0089","78":"Diary_0089","79":"Diary_0089","80":"Diary_0089","81":"Diary_0089","82":"Diary_0089","83":"Diary_0089","84":"Diary_0089","85":"Diary_0089","86":"Diary_0089","87":"Diary_0089","88":"Diary_0089"},"Date":{"0":"unknown","1":1785.0,"2":1786.0,"3":1787.0,"4":1788.0,"5":1789.0,"6":1790.0,"7":1791.0,"8":1792.0,"9":1793.0,"10":1795.0,"11":1796.0,"12":1797.0,"13":1798.0,"14":1799.0,"15":1800.0,"16":1801.0,"17":1802.0,"18":1803.0,"19":1804.0,"20":1805.0,"21":1807.0,"22":1808.0,"23":1809.0,"24":1810.0,"25":1811.0,"26":1816.0,"27":1817.0,"28":1818.0,"29":1831.0,"30":1836.0,"31":1838.0,"32":1839.0,"33":1840.0,"34":1841.0,"35":1842.0,"36":1843.0,"37":1844.0,"38":1845.0,"39":1846.0,"40":1847.0,"41":1848.0,"42":1849.0,"43":1850.0,"44":1851.0,"45":1852.0,"46":1853.0,"47":1854.0,"48":1855.0,"49":1856.0,"50":1857.0,"51":1858.0,"52":1859.0,"53":1860.0,"54":1861.0,"55":1862.0,"56":1863.0,"57":1867.0,"58":1868.0,"59":1869.0,"60":1870.0,"61":1873.0,"62":1874.0,"63":1881.0,"64":1882.0,"65":1883.0,"66":1884.0,"67":1885.0,"68":1886.0,"69":1888.0,"70":1889.0,"71":1891.0,"72":1893.0,"73":1894.0,"74":1896.0,"75":1900.0,"76":1901.0,"77":1905.0,"78":1906.0,"79":1907.0,"80":1908.0,"81":1909.0,"82":1911.0,"83":1912.0,"84":1914.0,"85":1915.0,"86":1916.0,"87":1917.0,"88":1918.0},"Entry":{"0":"\n\nHaving been completed, an Australian Sergeant & 8 men left on Sat morning ","1":" to establish a depot there, after leaving Three Kings I returned to Eypres where I had to wait for further instructions so in the mean time, we had breakfast after obtaining a bottle of tea from 6th Aux Sub Depot, the boys in this are camped in wagons in the loco shed which has the roof knocked off & large holes in the walls, & all around like the station yard the lines are broken & twisted in all directions, the engine turn table looks a sorry picture, a shell has exploded under the centre & lifted the table up one end & throwing it on an angle & the rail all around & leading to it are blown up & twisted, in fact one can hardly find a space of level ground, one shell hole leading on to another. \n\nAfter waiting for about 1 hour I was attached to a Canadian engine & a few trucks & away we went back to Poperinghe, stopping at were we shunted into the yard on to an empty troop\n\ntrain & continued on, outside of Poperinghe we were stopped & I was uncoupled & the other engine was sent away through on to Bergues & I was ordered to follow it as far as & pick up an empty stone train St Omer & away I went & while my Pilot shunted the train & took water, I paid our old camp a visit, which is practically as our Company left it, the little huts all about were all intact except the doors & windows which had been removed, my own hut had some of the flooring taken away, the large huts were all in good order. \n\nAfter walking through the camp I continued on & paid some friends a visit. A mother & daughter who used to do a lot of the Coys washing, after a chat about old times & a drink of hot milk, the daughter told me that they never moved away, they cling to their old home taking their chance with Fritz shelling & bombing. \n\nAfter the boys had left, the shells were sent over pretty frequent but this home was never hit, & now Fritz is to far away to shell & there is nothing left about worth bombing, it is all quiet & peaceful.\n\nAfter saying Good bye & thanking them for their kindness I went over & joined my engine & at 11.30 am left for St Omer passing through Poperinghe where I saw a lot of refugees near the Goods shed waiting to go somewhere. From appearances around the station Fritz has done very little damage & the people were beginning to return to their old homes again. \n\nAfter a good non stop run I arrived back at St Omer at 1.30 & signed off at 2.30 pm when I was instructed to report at 8 am on Monday morning with full kit to return to my unit down at Conchil le Tempes between Etaples & Abbeville. Sunday I stayed in camp all day until after tea when I went into St Omer to say good bye to my French friends, on visiting my favorite Estaminet to say good bye, the Madam told me that her & the 3 children were also leaving St Omer on Tuesday to return to Lille where her home was before the War so it was a double parting, her on one direction & myself in another, after leaving the Estaminet I return to Camp & finished\n\npacking my kit, & turned in.\n\nMonday Oct 21st I arose at Reville at 6.30 am & after breakfast 4 of us Australians & myself paraded & left by the Staff Special for St Omer at 8 am & then as the personnal did not leave until 10.35 am we all went up the street for a stroll where I bought several cards to send out to Aussie for Christmas, we returned at 9.45 to the Lord Roberts Church Army Hut for a cup of tea some biscuits, when I left my mates & went along for a cup of coffee at the Estaminet for the last time, as it was before hours I had to keep in the back ground until 10.30 when I left the family & went to the station & waited for the train to arrive, as it was running late due to heavy traffic on the line, it came in at 11.45 am & soon we were aboard & left at 12 noon, after a good run only stopping at Audruincq & arrived at Calais at 1 pm & after a wait of 15 minutes, off again, to Marquise having to climb a long & heavy bank arriving at Marquise at 2.30 & off again after 10\" delay passing through Boulogne to Pont de Brisquet arriving at 3.45 & after detraining\n\n \n\na lot of troops we were off again at 4 pm to Etaples arriving at 5.15 pm where the Railway Transport Officer told the Corporal in charge of the party that as the train did not stop at Conchil le Tempes, we had better detrain & wait for a passenger leaving at 9.30. \n\nAfter a consultation amongst ourselves, I went along & knowing a bit of French I spoke to the French Guard & he agreed with the Driver to stop for us, & we were one more contented for a while at any rate, leaving Etaples at 6.15 pm the Driver forgot to stop for us & we were carried further along to Noyles were the train stopped & we put out our kits & saw the R.T.O. & said we had to wait until 2 am for a return train, that was no good to me, so I spoke to a chef on a train which had just come in & after giving him some cigarettes we put traps in & off we went & had the same experience again, the driver did not stop so we had to go past our camp once again & when the train came to Rang du Fliers, we put our kits out once again & had to wait for\n\nthe passenger train which we ought to have caught at Etaples which arrived at 10 pm & soon we were on & off again eventually arrived at Conchil, we all were just about fed up with travelling & as our camp was nearly 2 miles away we decided to sleep wagon in front of the goods shed & some supper turned in about midnight & had a good sleep until 7 am next morning. \n\nAfter obtaining some tea we had some bullie beef & bread for breakfast & two of us went down to the yard where our boys were in charge & the Sergeant Major sent a light engine down on the Rang du Fliers line for our kits, & we obtained a barrow & loaded our kits on it & pushed it out & down the street to the line about 50 yards away & soon had everything aboard & away to the Camp, passing the gravel pits on the way where two Marion Steam Shovels were digging into the bank for gravel, I was very interested at that work, it is a wonderful affair, the shovel is about 3 ft wide & about 4 ft deep & at the\n\nmouth there are three pieces like teeth sticking out & the shovel swings on a gib like a piece of rubber & into the bank & upwards & back again around over the trucks & the bottom comes away & the gravel drops in, & the bottom closes up & around again & so on, each grab at the bank a ton of gravel is put into a truck & the engine gradually moves the trucks up filling a truck of 6 tons in about 3 or 4 minutes. \n\nAfter continuing on for a few moments we arrived at the camp & once again amongst our old chums, & what a difference only about a quarter of the original Company left all rest away, some back in Ausie, others in Hospital & some waiting in Blighty to leave, all the old men over 50 have left & a lot of reinforcements had come along & now we are close on 300 strong.\n\nThe camp is well in the bush & very scattered, tents in all directions, some along a roadway & others amongst the trees. A number of men are busy building Nessian Huts, for us for the winter, as it will be to cold for tents. After we were allotted our positions\n\nin the tents we were not long in placing our kits in them & then wait around & had a chat with old friends. The O.C. coming down the lines stopped & I had a chat with him, also my old friend Lieut Bolton. I spent all day in camp likewise today, Wednesday. Writing up my diary. Tomorrow I start running the road around about.\n\nThursday, 24\/10\/18. I signed on at 8.30 am for a run along our section as far as Vron, an R.A.F. Siding where an enormous amount of materials for aeroplanes, balloons, etc, is stored. The engine I was learning the road on was a large American of about 120 tons weight, & very powerful, the run from the Depot to Vron is of not much interest, nothing to see only hay stacks here & there, & sugar beet in plots. \n\nVron is only about 4 miles away & we soon arrived there & placed some covered wagons to load prisoners for another part of France, when they were loaded up into 7 wagons we came back a couple of miles & picked\n\nup some more prisoners in wagons, but had to wait a long time for some material & eventually we left for the junction at Conchil where the train was to proceed past Abbeville. After waiting for a French chef, they decided to put a French engine on in place of our R.O.D. engine & sent her back to the depot, & as the guards required to work the chain, I went along with them riding in the leading brake van.\n\nWe left Conchil at 4 pm & after a good run through Rue Noyelles, we arrived at Abbeville at 5.15 pm. I went along & caught it, riding on the engine & at 7.15 arrived back at Conchil & the two guards & myself walked back to the camp, taking ½ an hour to cover the distance of about 2 miles. After a good hot meal & a smoke I turned in for the night.\n\n \n\nFriday 25\/10\/18. After breakfast a list was put in No 1 Hut which was finished, of. Men required to shift in it out of the tents & as my name was on it, I soon packed up & brought my kit down & took up a position near the centre of the hut, each hut is to accomadate 20 men, but there only 16 up to date & I don’t want to see more come in, as with 16 men there is very little room left, we all have to sleep on the floor, no stretchers are allowed.\n\nI did not do anything or go anywhere until Monday 28th when I went along with the Rations Train to Domleger which is about 25 kilos from here, leaving at 9 am & after giving out rations to all the Block Cabins enroute we arrived at Domleger at 12 noon. The station before Domleger is a junction called Conteville where our lines crosses the main line between St Pol & Abbeville. & at Domleger, there is a fair number of our men stationed there who work all through traffic as far as Candas. After having\n\nlunch the return trip was started on at 1 pm & we arrived back at 3 pm.\n\nThe country all along is cultivated & numbers of French people were busy cutting the sugar beat & digging potatoes, & that was all there was to be seen all the way to Domleger & back.\n\nWednesday I worked a shift on the shunter in Conchil yard & yesterday Friday Nov 1st I worked a shift on the Vron shunter signing out at 2.30 pm, leaving the depot at 2.45 pm arriving at Vron at 3.30 where we had to shunt all rounds roads in between the hangers, where a large number of German prisoners were working, some unloading , others loading up trucks, while were wheeling stone & gravel to make roads for the motor wagons to travel on.\n\nThis is a very large place & is very busy. After we had finished a part of our work we stopped for tea & one of the R.F.A. boys came along with the Daily Mail which contained good news & caused quite a stir.\n\nAll hands were anxious to have a glimpse of the head lines & when they were read out, satisfaction was expressed on all sides that the Surrender of Turkey & Austria seeking an Armistice & the Revolution in Vienna and Budapest was a good sign of hostilities very shortly. After that we continued our sidings & left for home at pm taking a number of loaded trucks back to Conchil to go forward over the truck lines to their destinations & then back again to the depot & signed off at 10 pm when I had a hot cup of coffee & toast & turned in & read the paper. \n\nAs the paper is of special interest, I will write some notes from it for future reference. On the front page dated November 1st 1918, large head lines were printed – \n\nTurkey Surrenders, Fleet to Sail to Constantinople \n\nAustrian Army seeks Armistice\n\nRevolution in Vienna and Budapest\n\nGermany fighting alone\n\nIn smaller print –\n\nTurkey has surrendered to the Allies\n\nShe has been granted an Armistice, taking effect from noon yesterday.\n\nThe Dardanelles are open to the Allied Fleet.\n\nThe Austrian Army has asked General Diaz for an Armistice\n\nRevolution has broken out in Vienna & Budapest.\n\nThe Italians have now taken over 50,000 prisoners in the great victory over the Austrians.\n\nA statement was made in the House of Commons on Thursday by the Acting Leader of the House, Sir George Cave, which read & received with cheers that, some days ago General Townshend was liberated in order to inform the British Admiral in Command in the Aegean that the Turkish Government had asked for an Armistice between Turkey & the Allies. It is not possible as yet publish the full terms of the Armistice but they include –\n\nFree passage for the Allied Fleets through the Bosphorus to the Black Sea.\n\nOccupation of the forts on the Dardanelles and the Bosphorus, necessary to secure the\n\nPassage.\n\nImmediate repatriation of all Allied prisoners of war. It is understood that the Dardanelles was to be opened to the British Fleet yesterday.\n\nThe War with Turkey –\n\nTurkey entered the war about three months hostilities had been in progress.\n\n following dates indicate when she took up arms against the Allied Countries and a brief summary of the fighting is given below –\n\n1914 Nov 3rd Russia, Nov 5th Gt Britain and France, Dec 2nd Serbia,","2":" Italy,","3":" 1916, Rumania.\n\nThe attack on the Dardanelles began on","4":" when a fleet of battleships, including the Queen Elizabeth, the Inflexible and the Agamemnon, shelled the forts at the entrance. The bombardment was repeated on February 25th & 26th and on several days during the first half of March. On March 18 an attempt was made to press the attack on the inner forts. The British Battleships Irresistible and \n\nOcean and the French battleship Bouvet were sunk by floating mines with a loss of 2000 lives.\n\nThe attack by land commenced on April 25th under General Sir Ian Hamilton when Australian and New Zealand troops and the British 29th Division landed on the Gallipoli Peninsula, and the French Divisions on the south side of the passage.\n\nFrom the first the Expedition sustained heavy loses, but by diet of super human fighting managed to establish themselves.\n\nThe rocky ridges of the peninsula afforded exceptionally strong defensive positions and throughout June and July heavy fighting place, the Allies making progress slowly. August 6th a new landing was made at Suvla Bay, on the west coast of the peninsula, and a fresh series of attacks was launched against the Turkish positions. At one time great hopes of success was entertained, and after a desperate battle some of our troops reached the highest ridge, and could see the waters of the\n\nDardanelles beyond. But this success could not be followed up.\n\nGeneral Sir Charles Munro who replaced Sir Ian Hamilton, reported in favour of a withdrawal, and after Lord Kitchener, then War Minister, had examined the position, the evacuation of the Peninsula was carried out signal still and with only one man wounded and the loss of seventeen guns.\n\nMesopotamia\n\nOperations against the Turks in Mesopotamia began on","5":" when Basra was occupied by a force under General Sir A.A. Barrett. On September 28th 1915, a force under the command of General Townshend, which had been pushing forward up to the Tigris, defeated the Turks before Kut-el-Amara. Two months later General Townshend won the battle of Ctesiphon, but was compelled to retire.\n\nOn December 3 he regained Kut-el-Amara, where he was besieged. A force under General Aylmer was dispatched to relieve the garrison, but Kut\n\nfell on April 29th.\n\nNine thousand British and Indian troops were captured.\n\nIt was not till February 24th of the following year that Kut was taken by a thoroughly reorganised Army under General Sir Stanley Maude. A rapid pursuit followed and on March 11th Baghdad was taken.\n\nAfter the death of Sir Stanley Maude which took place from illness in Baghdad, General Sir W.R. Marshall took command and this year, in a series of brilliant operations drove back the Turks took Kirkur and cut their communications with Mosul.\n\nEgypt and Palestine\n\nGreat preparations were made by Turkey in 1914 to attack the Suez Canal but they came to nought. For about a year the position was more or less stagnant.\n\nOn August 4, 1916, however, the British took the offensive.\n\nIn November 1917, General Sir Edmund H.H. Allenby, who had taken over command from General Sir Archibald Murray captured Gaza, and followed up his success by driving the Turks before him crowning his triumph with the entry into Jerusalem in December. Jericho was the next city to fall. This year’s success began on September 18th. Breaking through the Turks right wing General Allenby carried out a swift flanking movement which resulted in the annihilation of the three Turkish Armies. Sweeping northwards Damascus was taken on","6":" and Alippo on","7":"\n","8":" The Daily Mail of Sunday’s date brought us more good news, also a list of Allied captures for the month of October, 1918, viz Prisoners 5,472 Officers, 100,871, Men total 108,343, and from","9":" to","10":" 7,990 Officers, 354,365, total 362,355.\n\nArtillery. October only 2064, Guns 13,639 Machine Guns 1,193 Trench Mortars,","11":" to","12":" 6,217 Guns, 38,622 M.Guns, 3,907 Trench Mortars\n\nMonday’s Daily Mail of","13":" contained even better news –\n\nStanding out in large headlines –\n\nAustria out of War\n\nArmistice Signed\n\nNew German front open to the Allies\n\nBerlin within 80 minutes by air.\n\nThe following Official Note was issued in Paris last night –\n\nThe Armistice has been signed with Austria. Hostilities will cease at 3 pm tomorrow","14":" In five weeks all Germany’s Confederates have laid down their arms as the result of disastrous defeats in the field.\n\nThe Order of Surrender has been.\n\nBulgaria. Entered the War","15":" – Armistice took effect on","16":"\n\nTurkey. Entered the War","17":" – Armistice in force October 31st, 1918.\n\nAustria. Began the War July 28, 29, 1914 – Armistice in Force","18":"\n\nRaids by 268 Aeroplanes\n\nGreat French Air Attack\n\nPanic among Germans\n\nSeveral bombing operations were carried out. One hundred and forty eight, bombing planes in successive groups protected by Battle planes numbering 120 in all, took part in there expeditions. Our bombers were thus enabled to drop 39 ½ tons of bombs and use several dozen rounds of machine gun ammunition under the most favourable circumstances, causing panic among the enemy’s troops and dispersing the columns and convoys with heavy loss.\n\nYesterday","19":" I was booked up for duty at 6 am on Eng 1400, Baldwin type 2-8-0, Walsheart Motion Gear, fitted with the improved E.T. Westinghouse Brake Equipment. The tender holding 5,000 gallons of water & carries 8 tons of coal, & is also fitted with rocker bars & dump grate for cleaning the fire and slide doors under the ash pan to drop all ashes out on to the road.\n\nThe engine & tender ready for service weighing 127 tons. My work was away at the ballast pit, with a rake of trucks which had to be loaded up by the Marion Steam Shovel. The train cosisted of 30 open trucks & after they were shunted up along side of the shovel, by a signal the trucks were drawn down as the shovel filled them, every shovel full of ballast weighed 1 ton & a truck was loaded in less than two minutes.\n\nThis Marion Steam Shovel is a wonderful invention, one man controls the movement of the shovel into the ballast & one man swings the apparatus around & unloads the ballast into the trucks & another man attends to the firing & keeping up the supply water in the boiler. The whole lot of trucks were loaded up in less than one hour & then drawn away & taken down into the shunting yard to go away on the Nord line somewhere, then another lot of trucks were taken around & also loaded up & in due course were also dispatched on the Nord line.\n\nBy the time these two trains were loaded up & finished with, it was dinner time & for the afternoon work another rake was loaded up & brought out on to our main line & was emptied out by Portugese assisted by a batch of German prisoners.\n\nIt was close on 4 pm their work was finished, when these knocked off & we took the trucks back & left them in the ballast pit siding & returned to the depot & signed off at 5 pm and that finished another good days work.\n","20":"\n\nThe leading article of this date in the French edition of the Daily Mail is well worth recording in this diary – \n\nIt is headed thus – \n\nStanding Alone,\n\nThe Hun at Bay.\n\nThe rapid advance of the Italians and the collapse of the Austrians has created a new front which the Germans will have to protect. Munich and Berlin will both be exposed to air attack by the \n\nAllies from bases in the Tyrol and Bohemia, and the war will be carried home to the heart of Germany before many weeks have elapsed.\n\nThe Huns now stand absolutely alone, all their allies have been beaten, and driven from the field. The hour is probably at hand when Marshal Foch; with the immense forces at his disposal, will give the signal to end the War by smashing the German Army.\n\nNever in the history of man has there been a period marked by such victories as the Allies have achieved during the past fortnight. The position of Germany has become desperate.\n\nRussia gone, Bulgaria gone, Turkey gone, Austria gone, - Germany standing alone without a friend in the World. Who could have believed in March last, when the Hun was sweeping with apparently irresistible force towards the Channel ports and Paris, that seven\n\nmonths later he would be standing alone, looking for a way to escape from the Hell he had made in the World! And we have to keep a stiff upper lip. We may be prompted to rejoice, to be so glad that the end is now in sight that we are disposed to let things go easy for the Germans.\n\n dictated peace with a Germany beaten and surrendered for judgment and the World made a safe place for free men must still be our aim.\n\nIn the elation of triumph, or of confidently anticipated triumph, the Anglo-Saxon is apt to be serious generous; let it be remembered that we are dealing with an enemy to whom generosity is merely a word signifying a foolish weakness on the part of an adversary and that every effort will be made by the Hun to coax and wheedle out of us concessions that we have no right to make.\n\nGermany has never had for us any\n\nfeelings but those of bitter hatred and savage, nay, inhuman, vindictiveness. We are fighting a foul and worse than bestial thing on which kindness and chivalry are worse than thrown away.\n\nHowever long Germany is able to hold out, we must fight on till she is beaten to her knees. We owe this to ourselves; we owe this to our fighting men, the living and the dead; we owe it to our children and our children’s children. We do not seek to repay foulness by foulness, but Germany shall have justice, and nothing less than justice.\n","21":"\n\nThe Daily Mail of today’s date publishes good news, which means another step towards Peace.\n\nThe Kaiser Abdicates\n\nRevolution reported in Germany\n\nSocialist Appointed Chancellor\n\nRegency to be established.\n\nSwift Allied Advance on whole Front.\n\nThe whole German Empire in the Melting Pot\n\nThe Crown Prince renounces the throne.\n\nHerr Ebert, a Saddler and Socialist leader, will be Imperial Chancellor.\n\nBiggest White Flag.\n\nHow Delegates Arrived\n\nby F. G. Falla.\n\n am now able to give the following fuller details of the arrival and reception of the German delegates, on the authority of an eye-witness.\n\nIt was about noon on Thursday when the first sign of preparations for this great event was observed from the French lines. German bugles blew furiously for half an hour and then the order to cease fire was given by the French Commander.\n\nA small party was seen advancing slowly across the desolation of No Man’s Land bearing perhaps the largest white flag in history. The party consisted of a German Major and two “non coms\" who had come to make arrangements for the reception of the armistice delegation\n\nall of them wore white armlets. After they had been given the necessary instructions the party returned to the German Lines.\n\nAn hour had been fixed for the arrival of Herr Ergberger and the two German generals and a French General and a number of other superior officers were on the spot to meet them. For hours they waited, but there was no sign of the Germans.\n\nBonfires and flares were lit to guide the expected visitors, and eventually their approach was heralded by the appearance if the German road menders sent to fill in the mine & shell holes. Finally, about nine o’clock the headlights of three big open touring cars signalled the approach of the Delegates.\n\nThey alighted from their cars and, in the words of a French Officer, “They were not proud\".\n\nForest Chateau.\n\nAccompanied by French Officers and guides, the Germans were conveyed in French closed cars, with drawn blinds to the Railhead. Here a special train was\n\nwaiting to convey them to the spot near Seulis selected by Marshal Foch for the momentous interview. This was the Château of Francport in Compeigne Forest, belonging to the Marquis de l’Aigle. The night was far advanced when the cars drew up in the courtyard, and the delegates were immediately shown the rooms reserved for them.\n\nAll of them were tired out but military necessity knows no law and early on Friday morning the Germans were awakened and after a hurried meal taken by train and motor to Marshal Foch’s headquarters where without delay the Allied conditions where communicated to them.\n\nWhite Flag Etiquette\n\nby H. W. Wilson.\n\nA parlementaire to arrange a surrender or an armistice has to follow a certain etiquette which is laid down by the rules of War as established at the Hague & by custom\n\nA parlementaire consists of an envoy or envoys from the enemy, properly authorised, carrying the white flag and accompanied by a bugler or trumpeter to call attention. The persons of the parlementaire are inviolable, and provided the commander to whom they are sent is willing to receive them. Those who meet them must take all steps to prevent them from obtaining information, and for that reason it is usual to blindfold them when passing through the lines.\n\nEither the Commander-in-Chief or a prominent general of the defeated army goes in person with the parlementaire. General Gablenz, after the defeat of the Austrians in Sadowa in 1866, proceeded to the Prussian lines under the flag of truce, and was there blindfolded, that he might be conducted to King William. The King seeing the bandage about his eyes, supposed that he was a wounded enemy officer, and spoke some words\n\nof sympathy to him before discovering the mistake.\n\nAt Sedan in 1870, after Captain von Winterfeld and Colonel Brousart von Schellendor had summoned the French Army to surrender, a parlemtaire consisting of General Reille came out under the white flag, and Reille handed Napoleon III’s letter of surrender to the King of Prussia on the Heights above Frenois. That same evening the French commander, General Wimpffew came in person to arrange the surrender. The terms were so severe that he refused at first to accept them, and only after the threat of a bombardment did he give way.\n\nAfter Appomattox, in 1865, General Lee came in person to General Grant, commanding the United States armies. Grant had not expected the surrender that day; he was in a privates uniform with only his shoulder badges to show his rank as the leader of the largest army\n\nwhich up to that date had ever fought in War. He was not only a great soldier, but also a great gentleman, and he has told the world what his feelings were at that tremendous moment. “I felt like anything rather than rejoicing at the downfall of a foe who had fought so long and valiantly and had suffered so much for a cause, though that cause was, I believe, one of the worst for which a people ever fought\".\n\nAnd with a characteristic tenderness for the conquered he engaged in conversation on other topics with Lee.\n\nAt Pardeberg in 1900, General Cronje made his surrender in person to Lord Roberts, after his stubborn and gallant resistance. In honour to the defeated Boer leader, Lord Roberts wore for the first time since he opened his campaign his ceremonial sword, “a heavy sword with a jewelled hilt\" and received his opponent with the words, “I am glad to meet so brave a Man\".\n\nLike Lee, Cronje was in want of food, and the last ham which the British Staff could produce was sacrificed in his honour.\n\nToday","22":" is a day of great expectation, & there is a lot of rumours about, Germany has to give an answer to the Allies. “Yes or No\" which means Surrender, the rumour is at present moment, time 11 am, that Germany has accepted the allies terms & there is great rejoicing in the Camp. The paper will be anxiously waited for further news.\n\nI am off duty for the day but the weather is cold and threatening & I intended going into the township of Rue about 6 miles from here, but I will remain in camp instead.\n\n \n","23":"\n\nThe Daily Mail of today’s date brings the glorious news which the world has been waiting for, Germany gives in, which practically has put an end of all hostilities which has been raging since Aug 14th 1914.\n\nGermany Gives in.\n\nArmistice Signed.\n\nConditions of the Victory.\n\nOccupation of Germany up to the Rhine.\n\nAll Submarines to be surrendered.\n\nGreat Rejoicings in London and Paris.\n\nAdmiralty, per Wireless Press, through the Wireless Stations of the French Government. Marshal Foch to the Commanders-in-Chief :- \n\nHostilities will cease on the whole front as from November 11th at eleven o’clock, French time.\n\nThe Allied troops will not until further orders go beyond the line reached on that date and at that hour.\n\nSigned Marshal Foch.\n\nAt 5 am yesterday morning November 11, the German delegates at Marshal Foch’s Headquarters, in the presence of Marshal Foch and Admiral Sir Rosslyn Weuyss, First Lord of the Admiralty, signed on behalf of the German Government the armistice terms dictated by the Allied Powers. Histilities came to an end at 11 am. This armistice is not peace. In that sense the War is not over, but the Terms of the Armistice are so drastic that Germany is robbed of any power, even if she had the wish, to recommence hostilies.\n\nGerman Plenipotentiaries to the German High command.\n\nTo be communicated to all the Authorities interested.\n\nArmistice was signed at 5 o’clock this morning (French time). It comes into force at 11 o’clock this morning (French time). Delay for evacuation prolonged for 24 hours for the left bank pf the Rhine besides the five days; therefore 31 days in all. \n\nModifications by the text compared that brought by Hilldorf will be transmitted by radio.\n\nSigned Erzberger.\n\nIn the terms of the Armistice Germany must surrender in good condition by the German Armies of the following equipment.\n\n5,000 guns (2500 heavy, 1500 field)\n\n30,000 machine-guns\n\n3,000 minewverfer \n\n2,000 aeroplanes (fighters and bombers), firstly D 7’s and night bombing machines\n\n5,000 locomotives, 150,000 wagons and\n\n5,000 motor lorries.\n\nThe following German Surface Warships, which shall be designated by the Allies and the United States of America, shall forthwith be disarmed and thereafter interned in neutral ports or, failing them, Allied ports to be designated by the Allies and the United States of America and be placed under the surveillance of the\n\nAllies and the United States of America only caretakers being left on board; namely\n\n6 Battle Cruisers\n","24":" Battleships\n","25":" light cruisers, including two mine-layers\n\n50 destroyers of the most modern type.\n\nDuration of Armistice.\n\nThe duration of the Armistice is to be 36 days, with the option to extend. During this period, on the failure of the execution of any of the Clauses, the Armistice may be denounced by one of the contracting parties on 48 hours previous notice.\n\nTime limit for reply.\n","26":" was a great day for the Allies it being the Surrender of Germany’s High Sea Fleet.\n\nThe head lines were very sensational in the Daily Mail of that date.\n\nGerman Armada Ours.\n\nSurrender intact to the Royal Navy.\n\nHistoric Scene in the Forth.\n\nAdmiral Beatty’s Signal\n\n“The German flag will be hauled down at Sunset.\"\n\nThe German High Sea Fleet surrendered yesterday Nov 21st 1918 to the Grand Fleet. Down a long lane formed by the Ships of the Royal Navy, and led by one of ours, 5 Battle Cruisers, 9 Battle Ships, 7 light cruisers, and 49 destroyers passed to internment.\n\nAdmiral Beatty’s historic signal after the German Fleet had been moored was:- \n\n“The German Flag is to be hauled down at 3.57 (Sunset) today, and is not to be hoisted again without permission\".\n\nThe Great Surrender.\n\nCheers for Admiral Beatty.\n\nFrom H. W. Wilson\n\nH.M.S. Royal Sovereign\n\nFirst Battle Squadron, Grand Fleet.\n\nWednesday\n\nThere was no excitement, but only a pleasurable anticipation of memorable\n\nevents when during this afternoon Admiral Beatty’s orders were issued that the immense fleet under his command was to prepare for sea. The ships lay motionless on the grey water in the falling light of the winter afternoon. Searchlights were busy flashing out their mysterious messages over the seas across which the German force to be handed over for internment was already making its way towards us at 10 knots. Wireless instructions were sent to it and the questions asked by the German Commander answered. Many wondered what were the feelings of its officers and men.\n\nAll are agreed that the historic conference at which Admiral Beatty gave his last orders to the Enemy was a painful ordeal.\n\nDetestable as the record of the German Navy has been in this War, and stained for all time with the shame of the Lusitania murders and the thousand crimes of the U-Boats there is something tragic in the \n\ntremendous fall of the Enemy, in the sorrowful bearing of some of the German Officers. Behind them was a Country in revolution. One of them remarked that he supposed he would soon be selling newspapers in the streets. Another discussed the quality of the Hotels de luxe in London as if he contemplated an early visit. Returning to the Königsberg in the British destroyer Oak, they played at Auction Bridge as the best way of passing the minutes of intense constraint. That surely was one of the strangest card parties in history.\n\nCardiff to Lead.\n\nIn the Grand Fleet there was general doubt whether some Officers or some ships might not try a last stroke, and prefer to perish in smoke and fire, rather than to accept this end of ignoble submission. The Cruiser Cardiff was charged with the duty of directing the German Ship’s movements, and was to steam at their head. Before the Germans were met all the crews in all the\n\nShips were to be at action stations ready for battle, and were to remain at these stations till further orders were issued.\n\nOverhead, watching the German’s aeroplane, squadrons from the local stations were directed to fly. This provision was made against surprise and treachery. The whole strength of the Grand Fleet was to be employed, five battle squadrons – but the Fourth, of King Edward type pre-Dreadnoughts, was otherwise employed, and here and there ships were absent from their squadrons docking and refitting. The Sixth battle squadron of five latticed towered American super-Dreadnoughts was there under Rear Admiral Rodman. There were two squadrons of battle cruisers and six of light cruisers, with eight flotillas of destroyers, a gigantic force, overwhelming in its superiority.\n\nThe first vessels of the grand Fleet to put to sea were the destroyer flotillas. They passed out under the Forth Bridge like so many\n\npacks of lean, swift hounds an array of vessels capable of steaming 33 to 35 knots all in battle order. Then in all the ships the tramp of feet and the rattle of winches were heard, as boats were hoisted in and every object that could cause trouble secured. We are to go out with the First Battle Cruiser Squadron in the small hours of tomorrow morning, so there will not be much sleep on this last night of the War. Tonight, as most of the German Submarines are located, and some are already under lock & key in our pens, we shall carry the usual lights.\n\nThursday 21st\n\nSomewhere about 3 am we weighed anchor, and with the battle Squadron leading the line, put to sea. All arrangements were made for the possibility of an attack by submarines or destroyers, but out of the still, black water no enemy showed as the British and American warships steamed at 32 knots to the rendezvous.\n\nThe Germans were late. They had been delayed by trouble in the condensers of one of their ships. About 8 o’clock the German fleet was 40 miles off. The great question still remained to be answered.\n\nWould they fight? At 8.30 we went to action station. All the guns were manned and ready. Overhead passed in quick succession two British airships, one flying low and the other high, followed by aeroplanes to meet the Germans.\n\nAt 9.30 they were in sight. We were flying the white ensign from every possible place in every ship, a precaution taken before going into battle. All classes were turned on the Germans, now very faintly to be seen on the horizon.\n\nIt was peace. Slowly, at a speed of 10 to 11 knots, the Germans came on down the great line of warships led by the British cruiser Cardiff and by one of our airships.\n\nThey looked in admirable order.\n\nThey carried the German flag for the last\n\n \n\ntime. Silently and dejectedly they came, with no salutes and no dipping of their flag. Behind the battle-cruisers were the battle ships, nine great vessels, magnificently built, and keeping perfect station like the battle-cruisers. Friedrich der Grosse carried a rear-admirals flag, hoisted at her topmast. The procession was funereal in its solemnity. That a great fighting force should surrender in this fashion was something which the World had never dreamed of something which four months ago most men would have pronounced impossible. Now came the signal from Admiral Beatty as we neared the anchorage. \n\nThe Grand Fleet met this morning at 9.30 five battle-cruisers nine battleships seven light cruisers, and 49 destroyers of the High Sea Fleet, who surrendered for internment, and are being brought to the Firth of Forth.\n\nAt 11.4 am he signalled.\n\nThe German flag will be hauled down\n\nat Sunset today and will not be hoisted again without permission.\n\nAt 12,30 came what may be said to be the last signal of the Naval war:-\n\n“Negative man action stations\".\n\nThus the German Fleet ended most ingloriously the struggle which Williain II began twenty years ago.\n\nI hear that 50 German destroyers which are on their way over to surrender are one V30 struck a mine and sank. The cruiser Koln was delayed by condenser trouble and towed by one of the German battle cruisers some part of the voyage.\n\nThe return of the Fleet with its prizes to the Firth was one of the most splendid spectacles which man could imagine. For miles the lines of British ships crossed the sea moving with exquisite precision with paint & brass work sparkling in the sun, with the glorious White Ensign flying and signalman busy with their rainbow hoists of signal flags. There was no exultation or desire to trample\n\non a fallen enemy, but a feeling of heartfelt satisfaction that victory has been gained and the War won, though at the price of cruel losses. The German ships are to be taken in the next few days to Scapa Flow, the great harbour in the Orkneys, 200 miles from Rosyth, were they will be interned till the peace.\n\nThe ships of the First Battle Squadron and Royal Sovereign among them, cheered Admiral Beatty as they passed his Flagship, Queen Elizabeth, and he stood there in the evening sun waving his hand in this last ceremony of the Grand Fleet. At sunset the German flag was hauled down and the Admiral made a final signal:-\n\nIt is my intention to hold a service of thanksgiving at 6 pm today for the victory which Almighty God has vouchsafed to His Majesty’s arms, and every ship is recommended to do the same.\n\nI must here make a copy of the King’s speech to the Lords & Commons in the Royal Gallery which is reported in the Daily Mail\n\nof Wednesday November 20th\n\nThe King’s Victory Speech.\n\n“We have to create a better Britain\n\nProblems must be faced,\n\nProvision for those who saved us.\n\nThe King’s Victory Speech to the Lords and Commons in the Royal Gallery of the House of Lords yesterday was an event without precedent in History.\n\nHis Majesty and the Queen were accompanied by the Prince of Wales and Princess Mary, and the presence of the Leading Ministers and Members of both Houses of Parliament , the Lord Chancellor, in State Robe, the Speaker, also in State Robe, with the Archbishops of Canterbury and York, assisted to emphasise the unique character of the occasion. \n\nThe Royal Party was given a great welcome by the cheering crowds which lined the route from Buckingham Palace to Westminster.\n\nThe Speech.\n\nThe King in his address said:-\n\nI thank you for your loyal addresses of congratulation on the Signature of the Armistice and on the prospect of a Victorious Peace, at this moment without parallel in our History and in the History of the World.\n\nI am glad to meet you and the representatives of India and the Dominions beyond the Seas in order that we may render thanks to Almighty God for the promise of a peace now near at hand, and that I may express to you, and through you to the Peoples whom you represent, the thoughts that rise in my mind at a time so solemn.\n\nI do this with a heart full of grateful recognition of the spontaneous and enthusiastic expressions of loyalty and affection which I have been privileged to receive both personally here in the metropolis and by messages from all parts of these islands; as well as from every quarter of the Empire. \n\nDuring the past four years of national\n\nstress and anxiety my support has been my faith in God and confidence in my people. In the days of course, days of uncertainty and trial, strengthened by the same help I shall strive to the utmost of my power to discharge the responsibilities laid upon me to uphold the honour of the Empire and to promote the wellbeing of the peoples over whom I have been called to reighn.\n\nTribute to the Navy.\n\nAfter a struggle longer, and far more terrible than anyone could have foretold the soil of Britain remains inviolate. Our Navy has everywhere held the Seas, and whenever the enemy could be brought to battle it has renewed the glories of Drake and Nelson. The incessant work it has accomplished in overcoming the hidden menace of enemy submarines and guarding the ships that have brought food and munitions to our shores has been less conspicuous but equally essential ti success. Without that work Britain might have starved, and those valiant soldiers of\n\n \n\nAmerica, who have so much contributed to our Victory, could not have found their way hither across the foam of perilous seas. The Fleet has enabled us to win the War.\n\nThat we should have to wage war on land had scarcely entered our thoughts, until the Storm actually broke upon us, but Belgium and France were suddenly invaded and the nation rose to the emergency. Within a year an Army more than ten times the strength of that which was ready for action in August 1914 was raised by voluntary enlistment, largely owing to the organising genius and personal influence of Lord Kitchener. The number of that Army was afterwards far more than doubled. These new soldiers, drawn from the civil population, have displayed a valour equal to that of their ancestors who have carried the Flag of Britain to Victory in so many lands in by gone times. Short as was their training, they have imitated and rivalled the prowess of the small but ever-famous force which in the early weeks of\n\nthe War, from Nous to the Marne, fought it magnificent retreat against vastly superior numbers.\n\nNot less prompt was the response and not less admirable the devotion to the common cause of those splendid troops which eagerly hastened to us from the Dominions overseas, men who showed themselves more than ever to be bone of our bone, inheriting all the courage and tenacity that have made Britain great.\n\nI shall ever remember how the Princes of India rallied to the cause and with what ardour her soldiers sustained in many Theatres of War and under conditions the most diverse and exacting the martial traditions of their race. Neither can I forget how the men from the Crown Colonies and Protectorates of Great Britain, also fighting amid novel and perilous scenes, exhibited a constancy and devotion second to none, To all these and to their Commanders, who, in fields so scattered and against enemies\n\nso different, in Europe, Asia, and Africa, have for four years confronted hazards and overcome perils and finally decided the issues of the War, our gratitude is mostly due. They have combined the highest military skill with unsurpassed resolution and amid the heat of the battlefield have never been deaf to the calls of chivalry and humanity.\n\nIndomitable Leadership.\n\nParticularly would I mention the names of Field Marshal Sir Douglas Haig, whose patient and indomitable leadership, ably seconded by his fellow commanders, has been rewarded by the final rout of the enemy on the field of so much sacrifice and glory of General Sir Edmund Allenby, where a campaign unique in military history has won back for Christendom the spoil for which countries have fought and bled in vain; of General Sir Stanley Maude and his successor who gained in a scene of no less romance the first resounding victory of the War for the Allied cause.\n\n \n\nWhile I mention those who have served their country till the end of the struggle let us not forget the incomparable services of the leaders who, in the early days of the war, before fortune had began to smile upheld the best traditions of British Arms by land and sea; of Field Marshall Lord French of Ypres, whose title recalls the scene of his undying renown; and of Admirals Lord Jellicoe and Sir David Beatty, who have for four years been the spirit and soul as they were the successive commanders of the fighting fleet of the Empire.\n\nHeroes of Air and Sea.\n\nLet us remember, also, those who belong to the most recent military arm, the keen-eyed, swift-winged Knights of the Air who have given to the world a new type of daring and resourceful heroism, so must we further acknowledge the dauntless spirit of the Men of the mercantile marine and the fishermen who have patrolled our coasts, braving all the dangers of mine and torpedo\n\nin the discharge of their duty. There are whole fields of service wherein workers, old and young, have toiled unknown and unrequited, save by the consciousness that they are answering to the call of duty.\n\nLet our thanks also be given to those who have toiled incessantly at home, to the women no less than the men, in producing munitions of War, and to those who have rendered essential war service in many other ways. Unwanted privations have been cheerfully borne and the hearts of those who were facing the stress of battle have been cheered by the steadfast confidence with which those whom they had left at home awaited the issue and assured them of their unflattering devotion to the prosecution of the War.\n\nWhile we find in the things cause for joy and pride, our hearts go out in sorrowful sympathy to the parents, wives and children who have lost those who were the light and stay of their lives.\n\nThey gave freely of what was most precious to them. They have borne their griefs with unrepining fortitude, knowing that the sacrifice was made for our dear Country and for a righteous cause. May they find consolation in the thought that the sacrifice has not been in vain. These brave men died for a right and for humanity. Both have been vindicated. In all these ways and through all these years there has been made manifest the unconquered and unconquerable spirit of our race, nourished on the glorius traditions of many centuries of freedom. This spirit, conscious of its strength, bore the trials and disappointments of these years with a fortitude that was never shaken and a confidence that never failed. It knew its motives to be pure and it held fast to its faith that Divine Providence would not suffer injustice and oppression to prevail.\n\nIn this great struggle which we hope will determine for good the future of the world, it is a matter of ceaseless pride to us that\n\n \n\nwe have been associated with Allies whose spirit has been identified with our own and who amid sufferings that have in so many cases greatly exceeded ours, have devoted their united strength to the vindication of righteousness and freedom.\n\nFrance whose final deliverance, achieved by one of the greatest of commanders Marshall Foch, has been the reward of sacrifice and endurance almost beyond compare.\n\nBelgium, devastated and held in bondage for nigh upon five years but now restored to her liberty and her King.\n\nItaly whose lofty spirit has at length found its national fulfilment, and our remaining allies upon whose horizon till lately so dark, the light of emancipation already dawns.\n\nDuring the last one and a half years we are also proud to have been directly associated with the great sister Commonwealth across the Ocean, the United States of America,\n\n \n\nwhose resources and valour have exercised so powerful an influence in the attainment of those high ideals which were her single aim.\n\nNow that the clouds of war are being swept from the sky new tasks arise before us. We see more clearly some duties that have been neglected, some weaknesses that may retard our onward march. Liberal provision, must be made for those whose exertions by land and sea have saved us.\n\nTo Create a Better Brittain.\n\nWe have to create a better Brittain, to bestow more care on the health and wellbeing of the people, and to ameliorate further the conditions of labour. May not the losses of the War be repaired by the better organisation of industry and by avoiding that waste which industrial disputes involve. Cannot a spirit of reciprocal trust and co-ordination of effort be diffused among all classes! May we not by raising the natural aptitudes of our people open wider the\n\nsources of intellectual enjoyment? We have also, in conjunction with our Allies and other peace-loving States, to devise machinery by which the risk of international strife shall be averted and the crushing burdens of naval and military armaments be reduced. The doctrine that force shall rule the world has been disproved and destroyed. Let us enthrone the rule of justice and international right. In what spirit shall we approach these great problems? How shall we seek to achieve victories of peace? Can we do better than remember lessons which years of war have taught and retain the spirit which they have instilled in these years? Great Britain and her traditions have come to mean more to us than they have ever meant before. It became a privilege to serve her in whatever way we could, and we were all drawn by the sacredness of the cause into a comradeship which fired our zeal and nerved our efforts. This is the spirit\n\nwe must try to preserve.\n\nIt is on a sense of brotherhood and mutual good will, on a common devotion to the common interests of the nation as a whole, that its future properity and strength must be built up. The sacrifices made, the sufferings endured, and the memory of heroes who have died that Britain may live ought surely to ennoble our thoughts and attune our hearts to a higher sense of individual and national duty and to a fuller realisation of what the English speaking race, dwelling upon the shores of all oceans, may yet accomplish for mankind.\n\nFor centuries past Great Britain has led the world along the path of ordered freedom. Leadership may still be hers among the peoples who are seeking to follow that path. God grant to their efforts such stability for the days to come. May good will and concord at home strengthen our influence for concord\n\nabroad. May the morning of peace which is now rising over a war worn World be here and everywhere the herald of a better day, in which the storms of strife shall have died down and the rays of enduring peace be shed upon all nations. \n\nAs I intended to take a Copy of the surrender of the first portion of the German U Boats before I entered up the surrender of the German High Sea Fleet, but having mislaid the paper & eventually I found it, instead of making a copy before the High Sea Fleet, so as the events would be in order, I must content myself in placing it after the Surrender of the High Sea Fleet also the King’s famous speech, so here goes it in detail.\n\nThe Head Lines of the Daily Mail dated November 21st 1918 read thus:-\n\nHun Fleet Surrender Begun.\n\n20 U-Boats brought into Harwich \n\nAllies going yo Wilhelmshaven\n\nThe Allied Commission is proceeding\n\nto Wilhelmshaven; the German Base, to superintend the disarmament of the rest of the Fleet.\n\nNo Demonstration\n\nProcession of Broken German Hopes.\n\nOn Board Curacoa North Sea.\n\nFrom the D.M. Correspondent,","27":"\n\nThe surrender of the first batch of twenty U-Boats was accomplished at seven o’clock this morning some seventy miles out to sea. More than eighty others are to be handed over between now and the end of the week.\n\nOn arrival at Harwich last night I was escorted on board M. L. 13 whose destination was somewhere in the North Sea. Steaming eighteen knots we passed down the River Stour by the Cork Lightship and the wrecked Arethusa, which could plainly be seen in the moonlight.\n\nAfter steaming some 20 miles across the North Sea we sighted the Harwich forces\n\nwhich consist of five light cruisers and 20 destroyers. H.M.S. Centaur was the first ship we came to and having exchanged signals we passed on to H.M.S. Curacoa, which is the Flagship of Admiral Tyrwhitt. A big observation balloon hung high above us keeping watch.\n\nOn reaching the Flagship only The Daily Mail representative, and another had the privilege of coming on board. We were met by The Admiral who shook hands and said “We are on the eve of a very interesting day, on which the German submarines will surrender to the British Navy.\n\nOur only drawback may be a little fog.\"\n\nAwakened by the bugle sounding the reveille, I came on deck as the squadron of light cruisers and a flotilla of destroyers steamed off towards the Dutch coast. The Flagship headed the squadron, followed by Coventry, Dragon, Danae and Centaur, Captain Harry Domville, late of Arethusa, is Captain of the Flagship, while Com-\n\n \n\n-mander Goldsmith of Montrose, is in charge of the flotilla of destroyers, which led the way with the moon still shining. The other ships followed in line with the navigation light showing.\n\nThe picture was a noble one as the great vessels ploughed their way to take part in the surrender of the Hun boats, and soon after they started paravanes were dropped overboard. These devices are shaped like tops and divert any mines which may be encountered, for we were now entering a minefield. Almost everyone on board donned a lifebelt, and just as the red sun appeared above the horizon the first U Boast appeared in sight.\n\nAdmiral Tyrwhitt invited me upon the bridge, and I stood with him and the Flag lieutenant and watched each submarine come into view. Soon after seven o’clock 20 U-Boats were seen in line, accompanied by two German Destroyers Tibania and Sierra Ventana, which will take the\n\nsubmarine crews back to Germany after the transfer.\n\nAll the Submarines were on the surface with the hatches open, and the crews were standing on deck. They were flying no flags whatever, and their guns were trained fore and aft, in accordance with the terms of surrender. A bugle sounded on the Curacoa and all the gun crews took up their stations ready for any possible treachery, for the Navy has little faith in the Hun. And now came the historic moment. The leading destroyer, in response to a signal from the Admiral, turned and led the way towards England. The U-Boats were ordered to follow. They immediately did so. The Surrender had been accomplished and one can imagine the feeling of humiliation of the U-Boat commanders as they followed the British Destroyers.\n\nHere was the last symbol of Germany’s Sea Power, following a British ship as sheep follow a collie. It was a procession of\n\nbroken Hun hopes. In the van a destroyer of the unbeaten navy, behind the cruel pirate craft that was to subjugate the sea.\n\nTowards Harwich.\n\nEach cruiser turned and keeping a careful lookout steamed towards Harwich. It was a perfectly clear morning, and every ship was visible to the naked eye. As we passed one of the largest U-Boats which carried two 5.9 guns I counted 23 officers and men on her deck. The craft was estimated to be nearly 300ft in length. Its number had been painted out.\n\nNear the Shipwash lightship three large British seaplanes followed by R.26 Airship were to be seen. The sight of the Harwich forces, seaplanes and airship was a most impressive one. One of the submarines was seen to send up a couple of carrier pigeons, and at once a signal was flashed from the Admiral that it had no right to do this. When we had got clear from the minefield and entered the War channel the\n\n \n\nparavanes were hauled aboard. The Commander of one of the leading U Boats then sent a message as follows; “Slower, Mr Hinderman cannot keep speed.\n\nOn arriving at a spot some 20 miles off Harwich the ships dropped anchor. Captain Addison came out in H.M.S. Maidstone. Now British crews were put on board the U-Boats to take them into harbour. With the exception of the engine staffs all the German sailors remained on deck. The submarines were taken through the gates of the harbour and the German crews transferred to the transports which are to take them back to the Fatherland.\n\nAs the boats went trough the gates the White Ensign was run up on each of them with the German flag underneath. Each German submarine commander at the transfer was required to sign a declaration to the effect that his submarine was in running order, that its periscope was intact, that its torpedoes were unload-\n\n-ed, that its torpedo heads were safe etc.\n\nBefore I left the flagship The Admiral told me that the surrender, although, in his opinion, it had been somewhat tame, had nevertheless been most effective. He showed me the orders which had been issued to the Harwich forces. One of them said that there should be no demonstration of any sort in the presence of the U-Boats. This order was obeyed to the letter. There was complete silence as the submarines surrender and the crews were transferred. So ended the historic event and the first portion of the Hun Submarine Fleet is in the hands of the British Navy.\n\nFleet of 400 Ships.\n\nHow Beatty will receive the Surrender.\n\nFrom H.W. Wilson.\n\nWith the Grand Fleet\n","28":"\n\nThe Kings inspection of the Fleet today was an imposing ceremony. He reached Port Edgar, where the destroyers are based,\n\na little before 11 o’clock, and inspected the flotillas which has been engaged in convoy patrol work and hunting the U-Boats in this part of the North Sea.\n\nAfterwards the King went on board the Oak, the tender for the flagship, and took up his position on a special bridge built on a slightly raised dais. By him on the bridge, at a lower level, stood Admiral Beatty and the Prince of Wales, who was in khaki. The destroyers which proceeded and escorted the Oak bore the name of Verdun, in homage to our French Allies, and flew her stern Jack, which had not previously been seen in a warship since the war began.\n\nThe Queen after visiting a hospital, left Port Edgar pier in the Admiral’s barge for the Queen Elizabeth, where she lunched with the King.\n\nAs soon as the King had gone ashore the Fleet turned to the preparation for the agreeable task of gathering in the Germans.\n\nThe news had arrived that the High Seas Fleet was on its way (having left at programme time,) with the exception of two ships that Admiral Beatty had allowed to remain in their port for the present. The British arrangements had for days been in the making.\n\nSoon after midnight tonight the Fleet puts to sea. No submarines are included, nor any of the sweeping craft, but the Officers and men of these branches will witness tomorrow’s spectacle. Our Fleet formed up in two long imposing lines, which will stretch from May Island, in the Firth of Forth.\n\nRear Admiral Sinclair, in H.M.S. Cardiff, who conducted the Konisberg into British waters when she brought over the delegates to arrange the surrender, will also lead in the High Seas Fleet, the vessels composing which are to pass between the lines of the\n\nGrand Fleet, which will turn and convoy the Germans into harbour, much in the same fashion that an armed guard marches a sentenced prisoner to the cells.\n\nThe weather prospects for to-morrow are more favourable and upon the weather much depends. If the visibility be good the Grand Fleet and its captains may be expected in harbour in the early afternoon. Should there be much fog the arrival may be delayed for hours. The Germans wished to leave full crews of their own aboard the surrendered ships, but this was refused them. Sir David Beatty, in fact, while being quite civil and polite, kept the German delegates waiting on ice all the time. It is the unanimous hope of the Navy that he will attend the Peace Conference, for his handling of the Fleet surrender negotiations delighted his Officers and men and deepened their trust in him.\n\nLargest Fleet ever Seen.\n\nThe approximate strength of the Allied Fleet that will be present will be close upon 400 ships, of which, including the 14 Germans, 60 are Dreadnoughts or super-dreadnoughts, by far the largest fleet ever seen at sea. The main British contingent is a magnificent force of 30 battleships, and 11 battle-cruisers. The American contingent numbers five dreadnoughts, and is organised as the Sixth Battle Squadron of the Fleet.\n\nWith the battleships are some 50 light cruisers, most of them built since the War began, and about 180 destroyers, many of the largest size and of remarkable speed and gun power. It is a force so strong, so magnificently massed, and so perfectly equipped that the sight of it explains the German seaman; mutiny and their refusal to fight, when the High Sea Fleet was ordered out to battle.\n\nConspicuous in it are Queen Elizabeth with Admiral Beatty’s flag, the brain and nerve\n\ncentre of the whole vast force, and the mysterious “Hush, Hush\" ships, the Renown, Repulse, Courageous, Glorius and Furious. Renown and Repulse are enormous battle-cruisers, thinly armoured, but carrying each six 15in guns and steaming about 30 knots. They are extraordinary vessels and had the Germans held out, their guns would have been heard in the Baltic.\n\nCourageous is fitted as a gigantic minelayer, Furious is a aeroplane ship and aircraft can asend from her vast platforms or land on her.\n\nNoteworthy in the array were three French ships bearing the glorious Tricolour of our allies. They were Amiral Aube, Euseigneroux and Magon. \n\nOne sign of the change which air warfare had brought is the aeroplane carried by each of the British Dreadnoughts for fire control, reconnaissance, and attack on enemy aircraft. These wicked looking “Camel\" machines drove the Zeppelins\n\nfrom the water, where they ventured to show themselves long after it became too perilous for them to fly over British soil. The daring of the “Camel\" Pilots who handle these aeroplanes is legendary. In some ships two aeroplanes are carried, one for fighting purposes and the other for “spotting\" and noting the fall of the giant projectile,\n\nTonight the weather has cleared a little and the vast harbour of Rosyth twinkled with lights all the evening and night signals have been coming in, many of them relating to the German ships. It appears that the Allies have received no news so far of the movements of the considerable number of submarines, and wanted to know where they were. Other signals showed that the Germans were coming with full crews, possibly because food is so short in the German naval bases. The German Dreadnoughts are required to have 1000 tons of coal on board, and provisions for a fortnight.\n\nThis morning news came in that Admiral Beatty had agreed, in view of the earnest representation of Admiral Hipper, the Commander-in-Chief of the High Sea Fleet, that two Dreadnoughts of the first German battle squadron may remain at Wilhelmshaven, pending a visit of the Allied Commission. This is to superintend the German disarmament and meantime these two ships must be disarmed.\n\nIn the same message the Germans were informed that our blockade force will not interfere with German plans to dismobilise provided they use the Kiel Canal routes. There is something strange in such an exchange of signals. The High Sea Fleet had now to take its orders from Admiral Beatty as the German Army has to take its orders from Marshal Foch.\n\nSince the signing of the Armistice & upon receiving orders, the Armies of the British, American, French & Belgian have been\n\nmarching on towards the Rhine covering stages from 20 to 25 miles each day and up to today’s Daily Mail of","29":" they have crossed the Frontier, and are now on German soil. At the present moment the Third United States Army have reached the General line Krewinkel – Metterich – Piterich – Morsecheid – Hirsch-feldenhof, & have now entered Treves. Mr. Maximilian Foster, Official correspondent with the American Army, describing the crossing of the frontier of Luxemburg into Germany at daybreak on Sunday morning, says that when General Pershing’s Army of occupation began its march down the Moselle on Coblenz no special ceremony marked the occasion. In the misty dawn of a cold and wet morning they shouldered their packs at the word of command and trudged forward with rifles, machine-guns, cannon, ammunition, lorries and all the accompaniments of an Army setting forth to battle. A few cheery whistles and some\n\nbadinage as the columns passed the black and white Imperial Eagles on the frontier posts and the invasion began.\n\nThe German Government has decided to forbid the Ex-Kaiser and Kaiserin to set their feet on German soil again.\n\nThe President of the United States Mr Wilson and Mrs Wilson are due to leave New York today","30":" on board the George Washington the only one of the former German Transatlantic liners. The Steamer Orizaba which left New York for Brest is conveying 500 newspaper correspondents, photographers and Kinema operators to cover the Peace Conference at Versailles.\n\nMarshal Foch and M Clemeuceau the Premier of France also Signor Orlando and Baron Sonnino from Italy are at present receiving au enthusiastic reception in London. \n\nAfter our King having received a magni-\n\n-ficent reception during his visit in Paris, is at present visiting the First Army in France.\n","31":"\n\nAfter writing considerably about important events which has happened since the Armistice was signed, I now make a few notes of what concerns me.\n\nOn Saturday afternoon","32":" I received notice to prepare to leave for Vron on","33":" & take up the duties of a Blockman in Vron West Cabin, as it is quite a change or rather a relief off the engine for a while and especially during the winter months. On Monday 25th at 8 am I took my stretcher & kit bag over to the line along with a number of Australian boys who also were going up the line to relieve the Tommies in different Cabins who were going away towards Cambria & at 9 am along came the engine & van & all hands put their kits & stretchers on & in a few moments we were away.\n\nMy Cabin was the first from the Depot at Peude and only 7 kilos away we arrived there in 15 minutes and after putting my lot off also my mate putting his lot off, the train continued on. Both of us brought our kits etc into the Nessian Hut and soon made ourselves comfortable. As the two Tommies had to remain until further orders, we did not take over until Wednesday, and in the meantime amused ourselves about the Camp.\n\nThere are thirteen men stationed here cosisting of three Sergeants, one Corporal as Yardmaster, two shunters, four Blockmen, two for West and two for East Cabins, a cook & an orderly and a numbertaker & we are a happy family. In the Cabins we work 12 hours a shift from 6 am until 6 pm and 6 pm until 6 am and on Sundays the 6 pm Blockman works until midday & he is then off duty\n\nuntil 6 am Monday so as to change over the shifts weekly, we fare very well for rations, the boys receive a lot of vegetables from the farm houses around. The Ration Train from the depot runs through to Douileger, Mondays, Wednesday and Fridays, and supplies all Stations with rations. The work in the Cabin is fairly easy during the day, not many trains about. There is an engine comes up every morning at 7.30 am & shunts the sidings at the aerodrome & petrol dump, where as a rule a lot of material is handled. There are about 1000 German prisoners working in the aerodrome loading & unloading material from the trucks & as a rule they all are kept fairly busy. \n\nLife here is not to bad, as the R.A.F. boys have a picture show on Monday, Wednesday and Friday nights starting at 7.30 & finishes about 9.30 pm. The charge is only 2d for a seat\n\nand there is an orchestra of 5 players & they play fairly well, the place is packed every night. The show is held in a large hanger or canvas shed, up in the forward area these hangers are used for aeroplanes. There are plenty of seating accommodation made of long rows of forms and raised up at the back is seats for officers on one side, and seats for sergeants & warrant officers on the other, there is room for about 2000 men and around the sides are pipes for heating purposes. There is another place being fixed up for dancing purposes and will be opened shortly, a large number of French civilians patronise the pictures & also appear to enjoy themselves. About 2 ½ miles from here is a Q.M.W.A.A.C. Camp were a large number of girls are employed in a beautiful chateau where E.F.C. Officers are\n\nbilleted, a fair number of R.A.F. boys promenade out of this place & meet the girls and go walking with them. Last Sunday a chum & myself went out for the first time and of course we both were soon at home meeting two nice girls & had a long chat, naturally they are like us, anxious now the War is over to return to England. \n\nThe track leading from here passes through a thick wood which is very pretty especially the tracks leading in all directions through the tall trees and a present are covered with leaves, the ground everywhere is covered and look like a huge carpet, no doubt in the summer it is a grand sight when the trees are at their best, after passing through the wood the road winds around like a large snake & the ground on both sides is under cultivation and in places numbers of hay stacks\n\nafter leaving the cultivated ground the road starts to descend passing alongside of several farm houses & in a few minutes one reaches the village & out on to the main road, after getting to the main road we turned to our left & walked on & soon the beautiful château came into view up on the hill, with a winding path leading to it, with thick scrub, the ground is all cleared were a number of boys were playing football and further on a number of W.A.A.C. girls were playing hockey.\n\nTheir camp is alongside enclosed in a wire fence, these girls live in Nessian Huts and I was informed there are 6 girls to a hut and they are provided with stretchers, and blankets and one told us the do miss the sheets, they evidently have to\n\nrough it, but not quite so bad as the boys on the other side of the road. The ground slopes down and a creek runs along at the bottom & then the ground rises gradually again, down in the hollow cattle could be seen grazing. I was quite taken up with this scene, the château etc on one side and the hill on the other and soldier boys and girls promenading along the road and fortunately the weather was clear & the sun was shining, which is considered remarkable for this time of the year. Both of us promenaded with the two girls for over an hour and then said goodbye and started on our homeward walk and in 40 minutes arrived back at Vron for tea after a very pleasant afternoon’s outing.\n\nLast week we said goodbye to three of our Aussie boys who were marked B.1. and have been called to the Base for Aussie, they were quite jubilant at the\n\nthoughts of starting on their journey and today Tuesday three Imperial Boys have just left us for their base, they are all 1914 boys and are well entitled to their transfer, two of them are Fireman from Wales and the other a clerk from the Railways, we wished them all good luck and a quick trip to their homes, and now we only have two Imperial Boys left with us and I expect they will be called away ant time now. Rumors are about that we all will be moving some time next week, but as one hears so much many rumors that it is no good taking any notice, anyhow when the time does come it will be quick and lively, the weather today is bad, one minute it is raining and the next the sun is trying very hard to shine through the clouds. The clouds as a rule come up very thick and black and one expects heavy rain but as a rule it passes\n","34":"\n\nOver with only a light rain, quite different to Australia, where one can nearly always reckon on a downpour, just alongside of my Cabin is a main road where a lot of traffic passes daily. I believe it is the main road from Bolougne to Abbeville and day and night numbers of motor wagons, cars and motor cycles go racing by and makes one almost think the War was still on, only we do not get any night alarms of enemy aircraft and can hear no report of guns. I will now stop writing until later on.\n","35":" Word came through on the telephone before lunch that I was to return to the camp to take up my duties again. Driving on Saturday so after lunch on Saturday I put my belongings on a truck and duly left for the depot at Pende. On arrival I reported to the Orderly Sergeant and was put with No 6 Hut and very soon was fixed up\n\nonce again, for how long it is hard to say, as I have been doing a lot of shifting about from once place to another, that I am just about full up of it all, and will not be sorry when I am done with it all. On inquiry at the Loco Office for instructions I found that I was to take up shed driving at 4 pm on Monday, that meant placing engines for going out on traffic and taking incoming engines down for coal and any other shunting ordered by the Shed Foreman, so having Sunday to myself, I wrote some letters in the morning and after dinner, I went over and witnessed a football match played between our Coy and the guards from a prisoner of war camp. The weather was fair, no rain but some what on the dull side. The Company’s band rendered several selections during the afternoon, a fair number of performers turned out under Sapper\n\nH Cornish, the Bandmaster, and they fairly well together. There were also a fair sprinkle of French Civilians listening to the music. There was very little to chose between the teams up to half time, both sides played well and had scored one goal each, during the interval, the boys were playing with the ball, when a very amusing incident happened, just behind the ground is the Authic River which is about one chain wide, and during the spell one of the boys kicked the ball into the river, then the fun started to try and get it out, they started throwing lumps of mud to knock it over to the opposite side where a Tommie was waiting with a long pole to bring the ball into the bank, after a lot of mud throwing and laughter, the ball was gradually worked into the bank and at last lifted out by the Tommie who then kicked it over to other side, but another chap bungled the ball on\n\n \n\narrival and allowed it to roll in again, and then the fun of knocking it over again started the second time, gradually it was knocked and washed over to the lad and soon was fished out again and this time it landed safely and soon was brought into play. After both sides playing a good game, and each had scored another goal each, the game ended in a draw, being two goals each, and all hands returned to camp for tea.\n\nAs soon Monday as the paper boy arrived I bought a paper, which contained a full account of President Wilson’s Reception in Paris, also the extension of the Armistice. A few notes by F.G. Falla makes very interesting reading and are very well worth recording.\n","36":"\n\nDaily Mail\n\nMr Wilson’s Great Welcome\n\nMemorable Scenes in Paris\n\nFour miles of cheering crowds\n\nUnbounded Enthusiasm.\n\nParis gave President Wilson yesterday a reception such as no other head of a foreign state has ever received in the French Capital. Over four miles of procession route were lined with crowds from 20 to 50 deep, while the great open spaces, such as the Place de l’Etoile, Place de la Concorde, and Place de la Madeleine, were black with cheering humanity.\n\nEven the weather, which for a month, had been of the most dismal description, cleaned for the President’s arrival, and during his triumphal progress through Paris the sun occasionally peered through clouds to get a glimpse of France’s illustrious guest.\n\nThe President and Mrs Wilson were welcomed at the Bois de Boulogne Station by President and Mme Poincare, M. Clemenceau and other representatives of the French Government. The train arrived punctually at ten o’clock. Immediately the guns\n\nof the fortifications thundered a welcome, and the band of the Republican Guard struck up the “Star Spangled Banner\". The President and Mrs Wilson alighted and were warmly greeted by M. Poincare and M. Clemenceau.\n\nMr Wilson, speaking in English, expressed his great happiness in visiting the French capital at this unforgettable moment in the world’s history.\n\nMme Poincare presented the President’s wife with a beautiful nosegay of mauve and yellow orchids, and after the official presentations had taken place President Wilson and Mme Poincare headed the procession towards the station exit, followed by the French President and Mrs Wilson. A guard of honour of the famous Alpine Chasseurs, wearing their Legion of Honour shoulder knots, presented arms, bugles sounded, and to the strains of the French and American National Hymns the Presidents of the two great\n\nRepublics took their places in an open pair-horse landau. At this moment a storm of cheers broke from the assembled crowd.\n\nIn the second carriage were the Presidents’ wives and Miss Wilson, with Mme Jusserand, wife of the French Ambassador to the United States. M. Clemenceau and Mr W.G. Sharp, United States Ambassador to France, occupied the third landau, with Generals Duparge and Mordacq, while Mr Robert Lansing, United States Secretary of State, and Pichon were in the fourth. Republican Guards formed a mounted escort and the procession moved off at a trot down the Avenue du Bois de Boulogne amid a roar of cheering and thunderous cries of “Vive Wilson\".\n\nAt intervals along the packed route French Military bands, mounted and on foot played the American anthem and the “Marseillaise\" while at the Arc de Triomphe a celebrated American band saluted\n\nthe President with a triumphal march.\n\nA British Greeting.\n\nFifty thousand people massed at the entrances to the great avenues leading to the historic arch and acclaimed, President Wilson in one great shout of joy. The scene here and again lower down the Champs-Elysées where the procession turned to cross the splendid Alexander 111 bridge was a never to be forgotten demonstration of warmhearted national exultation. Mr Wilson as he passed the beautifully decorated Foreign Office on the Quai d’Orsay, while the steps of the Chamber of Deputies were a mass of applauding humanity. Here the procession recrossed the Seine by the Pont de la Concorde on the parapet of which hundreds of British soldiers were perilously clustered.\n\nThe procession passed down the Rue Royale, across which a great banner proclaimed “Vive Wilson\" in luminous letters,\n\nand so past the Madeleine up the Boulevard Malsherbes. The narrow Rue de Monceau, where stands the Prince Murat’s mansion which will house the President during his stay in Paris, was lined with the famous","37":" Zouaves, no longer in baggy scarlet trousers but garbed in yellow African khaki and mudhued helmets. But nearly every man wears the croix de guerre.\n\nThe President and Mrs Wilson were introduced to their new house by M. and Mme. Ponicare who with the rest of the official party, then departed, not however before Mr Wilson had expressed his deep appreciation of the welcome Paris had given them.\n\nSoon after noon the presidential couple drove to the Elysée, where an official banquet was offered them by President Poincare on behalf of the Government. The route was still lined with enthusiastic crowds who left no doubt in the President’s mind of the warmth of\n\nFrance’s feeling for him and his country. On Friday the freedom of Paris was conferred on President Wilson by the municipality and yesterday the entire population made holiday in order to seal his election.\n\nArmistice Expended.\n\n New Treaty signed by Marshal Foch.\n\nRight Reserved to Occupy Part of Neutral Zone.\n\nA Treves telegram says that a Treaty was signed this morning prolonging the Armistice by one month to January 17th 1919, which prolongation will, if the Allies Governments approve, be extended until the conclusion of a preliminary peace.\n\nThe treaty which was signed in Marshal Foch’s railway carriage, further stipulates that the carrying out of conditions of agreement of","38":" in so far as the same had not yet been completed, will be continued and brought to a conclusion within the period of the prolongation of the armistice in accordance with the prescriptions fixed by the International Armistice\n\nCommission and the supreme Command of the Allies.\n","39":"\n\nAfter breakfast word was sent around the huts for men off duty to go and see the Officer in reference to the proposed Educating Scheme proposed by the A.I.F. I went over with 8 others to the Officer’s Van and he gave us a brief outline of what the Authorities propose to do while the Troops are waiting their turn to embark for Ausie, from what I can gather, of the Scheme is, that it will take the Australian Government twelve months before all the troops are landed un Ausie, and in the meantime, opportunities will be afforded the boys to take up certain kinds of work which they desire and go through a course of training in different factories and shops in England, and in the case of Apprentices who were not out of their time when they enlisted, an opportunity will be given for them to go into a factory or workshop in England to gain some English\n\nknowledge and ideas, which will do them a lot of good, also for others to take up some kind of work, to keep them interested for a while. I put my name down for a course of Motor Engineering, for the purpose of gaining information in connection with motor cars, so as to be able to take the motor engine to pieces and put it together again, also to be able to drive and generally understand the ins and outs of the cars, so if in future it was necessary I could take on a position motor driving. If this Scheme is carried out successfully, it will be a good thing for the boys, and time well spent.\n\nAnd then again any man with a hobby can take it on in their spare time, my name is down for carpentry as a hobby.\n","40":"\n\nBeing off duty all day my chum and myself decided to go for an outing to Paris Plage, a seaside resort out from Etaples and we both left after dinner to catch a train from Quend Mahon Station leaving there at 2.35 pm.\n\nThe weather was fairly damp, misty rain falling fairly frequently but as we had good warm clothes, we did not mind. One soon is used to damp weather as fine days are very rare for this time of the year. We arrived at the station and the train left on time and after a good run we arrived at Etaples at 3.15 pm, and after a wait of 30 minutes the train arrived, they are of the electric type and small and run three together, two are opened at the sides and one all enclosed, as there were a fair number of passengers waiting as soon as the cars stopped, they were full up again, another three cars came in and they were soon filled and both lots started on the 71 kilos run to the Plage, as there is only a single line, two loops for crossing purposes are provided and after a delay of a few moments at each crossing we soon arrived at our destination. The fares are 3d. each way.\n\nThe weather was still wet and miserable at it was getting dark, so we both went along the Esplanade, which is a splendid Promenade.\n\nThe footpath is built of tiles and about 30 ft in width and a splendid road runs along side which is about 40 ft in width, and right along the esplanade is beautiful residential houses, which no doubt are crowded during the summer season, after a walk for a little way we returned to the town, which is fairly large and there appeared to be plenty of people moving about, after we had some tea, we left again at 5.30 for Etaples and arriving there at 6 pm, we strolled about until 7 & then went into a cinema to see the pictures, and spent a very enjoyable time, the orchestra of 6 members played splendid music and a good class of pictures were shewn. The hall was packed with soldiers, it being Sunday night, on two pictures were shewn and we came out at 8.30 pm, & then went into a Church Army Hut for some supper, we obtained a warm drink of Citronella served by a little dainty W.A.A.C. Girl, who was very nice and polite, in another room I could see several other girls, and the place had a touch\n\nof home, with the little English girls moving about. The more I see of these girls, the more I am impressed of their usefulness. It is indeed a pleasure in this country to meet a female who speaks the English tongue.\n\nWe left the hut and came back to the station and at 9.30 the train arrived from Boulogne and in a few moments we were off again and arrived ay Quend Mahon at 10.10 and after 20 minutes walk we arrived in camp after a pleasant outing. \n","41":" morning I had to go to Rang de Fleurs, about 10 kilos to bring back a small American engine and left at 7 am and arrived back at 10 and signed off. \n","42":" night being Christmas Eve, a special train left here for Vron where a concert party was performing, there were 3 van loads of boys and it left here at 6.45 and arrived there at 7 pm The large hanger was crowded as usual, and the Concert Party of 8 performers put on a splendid show, they were known as the Aircrews, they were all men and on was a female personator, and he had a beautiful voice, and was very graceful, and\n\nand took his part well, each item was very well received, and with an excellent orchestra a very enjoyable evening was spent, and we all returned home at about 10 pm.\n","43":"\n\nGreat preparations were made for a good time in camp, and two large tents were put up together and tables and forms were borrowed and we had a splendid Christmas Dinner at 1 pm. Having had programmes printed of the days fun I am going to write out here a copy of it.\n","44":" Australian B.G. Railway Operating Coy.\n\nCapt. G Morgan\n\nOfficer Commanding.\n\nAustralian Imperial Forces.\n\nOn Active Service.\n\nSomewhere in France.\n\nAnnual Dinner & Sports\n","45":"\n","46":"\n\n(Menu)\n\nDinner.\n\n13.0 hours\n\nSoup\n\nPeselhock Delight\n\nFish\n\nPlaice de L’Authie Riviere\n\nJoints\n\nRoast Paschendale Beef\n\nRoast Ypres Mutton\n\nVegetables\n\nBrieleu Potatoes\n\nPolygon Wood Mashed Turnips\n\nBoiled Hellfire Corner Onions\n\nSweets\n\nSt Jeau Plum Pudding\n\nand Brandy Sauce\n\nTea & Coffee\n\nSt Julieu Tea, Wieltje Coffee\n\nSupper\n\n16.30 hrs\n\nPopernighe Ham & Salads\n\nPilkein Ridge Pies, Gouave Fruit & Regetsberg Custard\n\nShrapnel Cake, Howitzer Biscuits\n\nDugout Cheese.\n\nSt Juliau Tea, Wiellje Coffee\n\nSmoke Social\n\nTo be held in the Railway Institute\n\nCouchil le Temple\n\nAt 17.30\n\nEnglish Ale, Soft Drinks, Cigars\n\nCigarettes, Tobacco, etc.\n\nLight Refreshments.\n\nProgramme\n","47":" – Knight Errant – Band\n\nOverture – Gipsy Maid – Band\n","48":" – Joan of Arc – St W. Foley M.M.\n\nRecitation – Selected – Corp H Jenkins\n","49":" – Selected – Corp T Collings\n\nInstrumental Quartette – Clouds & Sunshine – Saps Myslis, Harvey, McLauchan, Woodward\n","50":" – Old John Bradbury – Corp Lilgrew\n\nStep Dance – – Sap Rees \n\nInstrumental Duet – Selected – Sap Myslis & Gibson\n\nRecitation – His Comrades Grave – Sap B. Springfellow\n\nInstrumental Quartette – Town & Country – L\/Corp Brown, Sap Gibson, Wade & Beggar\n","51":" – Selected – Sap L Thompson\n","52":" – Selected – Corp T Collings\n\nRecitation – Selected – Corp H Jenkin\n\nInstrumental Duet – Saps Woodwrad & Beggar\n","53":" – The Bullfighter – Sgt W Foley M.M.\n","54":" – On the day which peace is declared – Corp Kilgrew\n\nMarch – Selected – Band\n\nGod Save the King\n\nAeroplanes, Motor Cars, Private Carriages, Perambulators & Go Carts 22.30 hours\n\nThe Afternoon’s Entertainment\n\nA Grand Fancy Dress Football Match\n\nWill be played between the Traffic & Loc Depts\n\nVersus, Fitters, Boilermakers & Blacksmiths\n\nOn the local Sports Ground at 15.0 hrs.\n\nPrizes – 1) Best Fancy Dress,\n\n 2) Best Sustained Character\n\nThe Company’s Band\n\nUnder Bandmaster Cornish will play the following selections at Intervals during the match.\n\nMarch – “Capt of the Guard\"\n\nOverture – “Fire Flies Parade\"\n\nValse – “Recollections\"\n\nSelection – “Maritana\"\n\nEuphonium Solo – “Asleep in the Deep\"\n\nMarch – “Iron Duke\"\n\nValse – “Rich & Rare\"\n\nCornet Solo – “A Perfect Day\"\n\nSelection – “Scotia\"\n\nValse – “Twilight\"\n\nMarch – “Rifleman\"\n\nCommittee\n\nOfficers \n\nCapt G Morgan – Lt R Kay\n\nLt R J Johnson – Lt P Maher\n\nMembers \n\nC.S.M. E L Howe – Corp W Turner\n\nR.Q.M.S. L Gray – Corp C Pope\n\nSgt F Bird – Corp W Watts\n\nSgt D Rose – Sap R Sheridan\n\nSgt W Foley M.M. – Sap H Cornish\n\nCorp R Huxley – Sap C Holdsworth\n\nCorp T Collings – Sap E Elliot\n\nHon Secretary\n\nR.S.M. J F Grant\n\nAt 13 hrs the bugle rang out the old familiar call (Come to the Cookhouse Door) and all hands flocked into the two tents and took their seats.\n\nDuring the morning a train came down bringing all that could be spared from outstation and soon there were between two & three hundred men seated in their places, and with a large staff of waiters under the direction of the Company’s chef, Sgt D. Rose, all hands were duly served with a first class Christmas Dinner, which each and every one enjoyed. It was served up hot and plenty for everybody.\n\nAt 2.30 the Band outside the tent played several selections, which were excellently rendered & warmly applauded. Then they marched off to the Sports Ground near by, followed by a large crowd, where the football match took place. The weather kept fine all day although very cold under feet. The teams lined up at 3 pm and gave a good afternoons fun to the boys. There were two drains down the ground & caused\n\na lot of fun, when the players & ball got mixed up in the water, it was taken in good part and when a player was knocked down, it caused a lot of laughter. During the afternoon the Band gave a splendid performance, which reflects great credit on the Bandmaster, H. Cornish, who handled the players splendid. The Loco & Traffic out victorious by several goals, and Corp. J. Fisher gave a good exhibition as a central umpire.\n\nAt 4.30 the match concluded with the usual cheers for both teams, and all hands returned to the Camp and at 5 pm, the bugle again rang out & all adjourned into the Tents for a Tea, where another good time the Boys had.\n\nAt 6 pm the Evening Concert started, and the tents were crowded and each item was cheered, also the Band gave several good selections during the evening. Bread & cheese, cakes, beer & other drinks were served all round.\n\nAfter the Concert, the Captain and all who had assisted to make the Annual Christmas Dinner a success, were called for & cheered and each responded. With this a \n\nmost enjoyable Christmas Day was brought to a close, although several of the rowdy boys kept up the singing until close on midnight when the Camp once again was all quiet.\n\nThursday 26th (Boxing Day)\n\nAs I was off duty all day, I decided to go with a pall for a run down to Boulogne after dinner, and left the Camp at 1.45 and arrived at Quend Mahon at 2.15 pm and the train running to time left at 2.35, as usual it was crowded and after a slow run stopping all stations we arrived at Boulogne at 4.40 pm. The Weather again was splendid, and quite a pleasure to be out. As my pall had never been in Boulogne before, I acted as a Pilot for him. After leaving the train we crossed the bridge & into the town, promenading the principal streets, which were packed with civilians, soldiers etc. After one hours walking we adjourned to the Salvation Army Hostel, where we had a good tea for 2¼ francs each and then walked up to the Esplanade, but it was all in darkness, so we returned and walked about until 7.45 pm when made our way back to the\n\nstation to return by the 8.25 passenger train. \n\nWe made ourselves very comfortable in a 2nd class compartment. Just before we started the Conductor checked tickets and as we had a","55":" class return, he charge us 3½ excess for being in a","56":" anyhow it was worth it. \n\nAt 8.27 pm the train started and after a lot of stops and delays we arrived back at 11 pm, 50 minutes late and soon was back in Camp after a pleasant time. \n\nFrom","57":" to New Years Eve, things in camp was very quiet, nothing worth recording happening, there were the usual blowing of whistles at midnight on New Years Eve from the engines, New Years Day passed off very quiet, nothing doing.\n\nFrom","58":" until the","59":" I would work one day and off two.\n\nOn Saturday the","60":" I was ordered to hold myself ready for a transfer to Calais some time on Monday, with a Fireman and seven other Drivers with their mates. I was again informed on Sunday\n\nevening to sign on at 10.30 am Monday & work an American engine leaving the Depot at 12 noon, so early Monday I was busy getting my kit together and into a Van, there were 4 engines going, two drivers & two firemen to each engine and each set to work a shift of 10 hrs each.\n\nThe four engines were ready with their crews, with the kits in a van behind and we left the Depot at 12 noon arriving at Conchil le Temple at 12.15 were we had to wait until the French Railway officials were ready to let us on the Nord Line.\n\nMy relief driver worked the engine & I rode in the van. For some reason or other we did not leave Conchil until 6 pm and after a lot of delays we arrived in Calais at 8.30 pm were the engines were stabled and all hands made themselves comfortable for the night, half the number on men slept in a hut & the remainder in the van.\n","61":" after breakfast each engine was attached to a van with four\n\n \n\nstretchers and a stove in the centre, the idea is that the van travels with the engine continuous & we live in the van. There are two Guards & two Brakesmen who also live in the van, so when one Driver & mate is on duty, the Guard & Brakesman use the two beds after rest each rolls up his blankets & turns in. After making ourselves right in the truck we received orders to draw 5 days rations & work a train to Montignee in Belgium signing on 3 pm. After drawing our rations & oil, I being first on duty, I oiled up and was all ready at 4 pm. It was close on 5 when were shunted on to our train & left for our destination. I worked the train to St Omer were a Pilot came aboard to Pilot the engine as far as Fives a R.O.D. Depot near Lille. We made a good run through Hazebruick until Merris was reached were we were blocked for a long time. As my time was up at 1 am, I was relieved at this place & after some supper turned in tired.\n\n \n\nI slept very well & the bed was very comfortable. I took over the eng again just after leaving Fives and worked it through to Mons, passing through a lot of country & towns which had been terribly knocked about, all along the line the stations were all smashed. Foundries & houses raised to the ground. Railway lines blown up also bridges & trucks blown up in several places. After travelling over a very humpy road I arrived at Mons & after going into the depot for more coal, & out again on to the train & while I was waiting for line clear my time was up & my relief took over at 9 pm & I turned in again after some supper.\n\nAt 6 am I awoke after a good sleep & found that we were at our destination, Montignies. After the engine was again coaled, & all hands had breakfast at the Depot, I received orders to be prepared to work a train further on so prepared my engine and at 10.45am was brought out and on to a train for Gembloux near Namur on another line. After a Belgian \n\n \n\nPilot came aboard, we left at 11 am and after a pleasant journey in beautiful weather, passing several large mines & large towns we arrived at Ronet for water, away again to Namur running along side & crossing the River Sambre were a large number of barges were moving about, we arrived at Namur, a very large railway centre & which appeared to be very busy.\n\nBetween Montignee & Namur the railway crosses the River Sambre 15 times, it winds about so much. On the journey I noticed a large number of German engines worked by German vrews & each engine had a signboard with writing on it. Not to be detained return to Allemagne, Railway Material. There were German engines, carriages & trucks everywhere, the German engine drivers had a white square sign on their arms. They are being used for bringing the rolling stock from Germany to the Allies which has to be handed over. \n\nI arrived at Namur at 4 pm, this is a fine city & trams\n\nrun everywhere and being nearly dusk the shops opposite the station were lit up & looked very well. I may have a chance later on to have a stroll in this town. With two engines on the other end of the train, we left at 4.30 up a very steep bank & after an hours run arrived at Gembloux at 5.30 pm when I was relieved, being on again at 3 am. I had tea & turned in and was called at 2 am by my relief & found out that he had failed with the engine and had been pulled back through Namur & into the R.O.D. Depot at Ronet, where we are now awaiting repairs, the failure was that the rocker bars in the fire box jainbed & were out of place & the fire had to be drawn. I did not remain on duty long and turned in again until 8 am when all hands had breakfast, during the morning the boilermakers staff adjusted the fire bars and the engine was lit up again. Obtaining permission my relief driver & myself went into the town of Namur for a stroll which is\n\nabout 1½ miles by the line & after a walk of an half an hour arrived at the Station.\n\nNamur is just the same as other towns with its narrow winding streets & cobble stone roads & narrow cement block footpaths, there were a large number of civilians promenading also soldiers from all regiments, the shops were well stocked & food was very dear also clothes and boots, I passed several butchers & beef & mutton was marked 4½ francs","62":" a half a kilo equal to about 1¼ lbs in English weight.\n\nBoots from 100 francs upwards. The ladies of Namur are dressed very stylish & like their French sisters are very pretty, they are admired very much by the boys. After walking about for two hours & buying Books of Views, also several very pretty cards of Belgian Ladies & Gentleman. The ladies costumes were touched up with gold tuit also surroundings & the price was 3½ each which were very cheap, we started for the Depot, intending to catch a tram if possible which by the way are electric on some routes & steam on the others. The Electric Trams\n\nare very small & are driven by Motormen & have girl Conductors, & are look very neat in their blue uniforms. The steam trams have an engine in the lead with 3 to 5 cars behind, & are well patronised. As we had to wait nearly an hour for a train to Ronet we decided to walk, going along the River Sambre for some distance & then up along the line arriving at the Depot for tea, as we could not get anything definite about departure we had to stand by for the evening and at 11 pm was ordered out to the station were we received orders later on to go back to Namur to take a Leave Train for Calais, after a lot of waiting we arrived in Namur at 3.30 am & after taking water we left at 4 am with a large number of German carriages crowded with boys.\n\nThe run to Charleroi was very slow, being delayed at nearly every signal, as the traffic ahead was very busy. Every time we stopped the boys came along for boiling water to make tea & as one injector was blowing back, they were soon supplied with a dixie each.\n\nSeveral brought petrol tins & were filled with hot water & the tins put in on the fire & boiled up in a few minutes. We had to answer all sorts of questions about what time the train will arrive in Calais, & what is delaying us & so on, an answer was given to each. As my time was up at 9 am I was relieved about 3 miles from Charlerio, I turned in to bed at 10 am still outside & had a good sleep. On waking up at 7 pm I found that we were at Mons, we were to pick up another train of Belgian civilians for Arras but being so late, we missed them, we lost the leave train at Charleroi owing to having to go back to Montignai for coal.\n\nAfter leaving Mons very slow progress was made all along & being relieved after being on again all night, I was asleep when passing through Somani & along to Arras, we were delayed some time in Arras, having to wait several passenger trains to pass. \n\nThe town of Arras from the station is very much knocked about & in an awful condition, also the country from Somani to Arras is a wilderness,\n\nno habitation anywhere for miles around only shell holes & broken trees, reminding one of a haunted area. I hope my next trip to have an opportunity of seeing more of these areas.\n\nAfter leaving Arras we made a fair run to Ligny & then on to Tachincourt for more coal, & after a short spell we left for St Pol where a French Pilot came aboard to Pilot the engine to Calais. After leaving St Pol we made a good run & stopped at a signal cabin, when I was relieved again & being 9 pm & after some supper I turned in & had a good sleep.\n\nEstaples & Boulogne were passed during the night and Calais was reached at 8 am Wednesday after 8 days run of a very interesting nature, which I thoroughly enjoyed. I must not forget to mention here that on passing through a place called Luttre, which has a large marshalling yard, in several roads large numbers of trucks were blown & smashed to pieces. Being informed that Fritz had blown them up being full of ammunition, he destroyed them in his retreat, so as they would not fall into\n\nour hands. Trucks twisted here and there, & in all directions, shell holes between the trucks & rails bent and twisted, right along the main line which has been renewed because Fritz had blown up each rail at the joint making them useless & they are lying alongside. Coming into Manage a double line tunnel with a wall separating the two sets of rails, one portion of the tunnel has been blown in making the line useless & in the other portion large holes in the side walls have been blown in, but no damage had been done to the permanent way, & trains are worked on the single line both ways. \n","63":" After putting our engine away all hands were given 24 hrs of duty & while my relief was sleeping, my mate & myself cleared out of the van, after dinner we went for a promenade into the town & after tea which we had in the Salvation Army Home consisting of sausages, two eggs and mashed potatoes which cost only 3 francs each which was very cheap in comparison to the French Cafes, we went along to the cinema show where a series\n\nof French pictures were shewn, the charge was very reasonable being only 6c each & a good seat, needless to say the hall was crowded with soldiers & civilians, the pictures were a first class lot & in intervals French songs were sung by Frenchmen, one gentleman saying in English “Come sing to me\" & having a splendid baritone voice, the boys gave him a splendid reception.\n\nThe programme was finished at 8 pm, taking three hours, we made our way back to our Depot after some supper turned in.\n","64":" We are now standing by & do not know when we will be required again & as the engine had been washed out & lit up again, we may receive a call at any time, so I am spending the day writing letters & the Diary.\n\nAt 4 pm word came along to prepare for duty by drawing our rations & oil stores and sign on at 18.45 for a run to Montignie. As I took the engine out first last trip my relief decided to take her out on this the second trip, the idea was to give each set, a chance to see the part of country what we were passing\n\nthrough when asleep in the van. At 6 pm my relief started to prepare the engine and found out that the repairs, he booked on arrival for the engine were not carried out, and as the fire bars were booked to be straightened & not done, the engine was not fit to do its work, & so the engine was cancelled and another one sent in its place.\n\nThe engine (864) was a Baldwin Superheater, 6 wheel coupled, and commonly called a Spider, with its Torpedo Boiler. At 8 pm after our guard’s arrived, we moved off to Veudroux Marshalling Yards for our train about one mile away. After some delay at Veudroux, we eventually started on our journey. As I was due to take over at 5 am I turned in & had a sleep, at 4 am I was called & had some breakfast & took over at 5 am at a place called Aire, between St Omer and Berguette. Off again we were soon into Berguette where I let my Pilot return as I knew the road to Bethune as a train was ahead all the way, from Berguette to Bethune, there\n\nwere a difference in the country, from the last time I worked over the road in October, 1918, The civilian population had returned in considerable numbers and were busy in the fields, also repairing their homes. At Bethune the French Railway people had taken over the Depot and a large number of engines are again quartered there and everything was in full swing. After obtaining a French Pilot we were off again at 9 am and after a short run began to come into the destroyed areas.\n\nAfter a few minutes delay at the first station, we were off again towards La Basse , passing through Violaines and Don Sauighiu . The country all along here is in an awful state, the station buildings entirely have disappeared, & the railway yards smashed in all directions.\n\nThe line runs alongside of the Canal for a long way, and barges are smashed about and sunk in considerable numbers, for miles around one sees nothing but shell holes, dug outs, stumps of trees and along the railway embankments Fritz has dugouts with steps deep down\n\nrunning in all directions, where portions of houses are left standing the civilians have returned and are busy patching up here and there, on approaching La Basse station, the lock gates of the canal are being cleared away by German prisoners under British officers, and being made ready for repairing. The destruction is awful, on the side of the canal is a large cement wharf with large portions blown about in all directions and barges riddled and lying on the bed of the canal which is empty of water, there are signs of many brave man’s life being given for the cause, but in the distance one can see destroyed aeroplanes, tanks, guns and wagons lying about everywhere.\n\nThe French having taken over the lines are busy in large numbers, relaying the rails and building huts for their temporary homes, also here and there are numbers of destroyed villages with only broken walls and peaks to show a prosperous town once stood there, it is marvellous how these French refugee’s have flocked back into these towns and endeavouring to \n\n(Several German cemetery’s with large white German Crosses were passed enroute)\n\nestablish some sort of a house again. The gas works of have been entirely destroyed.\n\nThe tanks smashed and completely riddled, also here and there French men are busy filling in old trenches and shell holes and preparing the ground for cultivation. As we were approaching Lille, the country improved a lot, passing through Loo’s were a famous battle was fought in the month of October 1915, only a sign board as a mark where the station once stood.\n\nAs the line passed on the right of Lille and not through it, I only could see a small portion of the fine city, passing through Haubourain and where once again the French are busy re-establishing railway yards, etc, as the train passed through slowly the men swarmed on the trucks for a ride to their works, when I arrived at a station just outside Pont de Arras my French Pilot left me, and from there onwards the line is controlled by the R.O.D. and manned by a New Zealand Rly Coy, and an English Driver Pilot came aboard to Pilot as far as Mons.\n\nOn arrival at Orchies at 3 pm, I was relieved \n\nand at the depot opposite, a hot meal is supplied to travelling crews, and as it was bitterly cold it was thoroughly enjoyed by all hands. The engine had to go in for more coal, so a delay took place f an hour, I duly turned in and being tired was soon fast asleep. When I awoke I found that we were in the depot at Mons, as the engine tubes was leaking badly my relief driver could not go any further and had given up his train & brought the engine in for repairs. As the fire was out, I did not get up but slept all night.\n","65":" After breakfast it being a fine day although cold, all hands went into the town of Mons for a walk. This is another very large town and well populated and has its usual quota of soldiers moving about.\n\nThe streets are fairly clean and there are some very fine shops, well stocked but everything is terribly dear. A hot dinner of two courses cost 6½ francs. Pastry is from 3c up to 7c a piece. Chocolate is 1 franc a small bar, eggs are 1 franc each, meat 4½ francs a lb. Fruit is awful, oranges 1½ francs each, & other fruit such as apples\n\nand grapes, about 4 francs a lb. Clothing and boots are very dear also, during my ramble I bought a book of views of Mons, also a Sovenier Brooch of Belgian Couis, and 4 views of the retreat of the Germans from Mons.\n\nOn the front of every building is a sign which reads (Keller for 10 Mew) meaning (Shelter for German Soldiers during an air raid, so many in each building. The Buildings are very high and well built. At different places a statue once stood on a pedestal, the statue had been removed be a smelted in Germany, only the pedestal remaining. \n\nThe tram service is out of order and not working. Only a light steam railway runs from the station to Charleroi and then on to Brussells. There are numerous picture shows in French and English, also variety, like the other Belgium towns the woman folk are neatly dressed and look very smart and handsome. I notice a number of young men up to 21 years walking about wearing caps with long peaks, which I found out to be students from the schools in Mons. After lunch I again took a stroll in another direction\n\nand again after tea, all of us went out together to see the sights of the town of an evening.\n\nWe spent a good hour in a estaminet, where dancing takes place, one goes in first and has to buy a drink and then into the hall, where a number of girls and soldiers were flittering about to the music from a large organ built up on a gallery, which is worked by a handle turned by a Belgian youth. I wemt upstairs & behind the instrument & had a chat & saw a portion of the instrument. I was told that the organ cost 2,000 francs, about £ 15 and is about 8 ft high and about 12 ft across and very nicely painted and finished off.\n\nNeedless to sat the hall was crowded with soldiers and lassies, and the music fairly fast, the pace was fast and furious and all hands seemed to enjoy themselves. After we were tired of watching the dancing we went out and along for a walk and after the boys had bought more cards we all returned home to the depot for supper after a very interesting day of sightseeing and today Saturday we are still waiting\n\nfor our engine, although the repairs are effected she requires lighting up, & we may leave here today.\n","66":" \n\nWe are still here in Mons waiting further orders. After lunch I went out again for a couple of hours stroll through the winding and narrow streets and met a young Belgian man and as he could speak English well, he was very interesting and he informed me, he was a student in a colledge in Mons and his house was at Charleroi, all these students wear a little white cap with a very long peak with a lithe star badge in front. \n\nOn walking to his quarters he showed me the house where the Crown Prince of Germany had his Headquarters when in Mons which is next to the Palace of Justice (Courthouse) and in several places a sign which read “Welcome to our brave British Soldiers\". On reaching the Grand Place, which is the square and seems to be a very busy centre where a large number of civilians gather together and while we were talking our attention was drawn by a crowd looking up in the air, and of course\n\nwe did likewise and saw a strange sight. \n\nAway up high were thousands of starlings flying about in a large group, and a hawk was after them. So as the hawk was after them the group would break up and form into several formations, one instant like a huge snake and then into a ball again and then again into letters of the alphabet, it was a great and interesting sight watching these birds dodging the hawk. After a while the hawk would disappear and these birds would again be at ease flying about.\n\nAs it was close on five pm I said good-bye to my Belgian friend and wended my way back to the Depot and had tea and then all hands went out to the theatre in the Rue de Station to see the Thistletops, a variety show by Jocks. The theatre is not very large but was packed by soldiers down stairs and up in the gallery.\n\nThe show started at 7 pm, and a real treat was in store for us. The Coy were a real first class troup of artists. Three lads made up as ladies and one especially had a beautiful soprano\n\nvoice and natural movements and received a splendid reception for his singing. The other members of the Coy each gave splendid turns and with a splendid orchestra, I must confess that this Coy is the best lot I have seen in France and Belgium.\n\nThe show finished at 9 pm and we all returned to our Van for supper and then turned in.\n","67":"\n\nWhen I awoke at 8 am it had been snowing all night and every thing was covered. This being the first fall of snow for the winter. \n\nIt was now necessary for us to draw fresh rations, so two of us went over to the R.O.D. Control for a docket to be handed in at the Storeroom and soon we were issued rations for a further 24 hours, consisting bread, meat, butter, jam, rice, tea & sugar and bacon, so we were O.K. for the day.\n\nAfter a good dinner of roast beef, potatoes and boiled rice, I went out again for a promenade and if possible book a reserved seat at a picture show. As it had been snowing continuos all morning, it was\n\nlying fairly thick everywhere, being up to one’s ankle in the station yard. Up the streets the cobble stones were very slippery, and with steel plates and nails in my boots, I had to walk very carefully, or over I would go. The children were enjoying themselves snowballing the soldiers and as one of the soldiers I came in for my share and took it in good part \n\nWhere the streets were on a slope, the boys and girls were using the footpaths for tobogganing by using small sledges, and were enjoying themselves.\n\nBeing Sunday afternoon I went into Ste Waudru Church were a service was being held. This is a fine church but not so beautifully decorated as some in France, but still very interesting. There is at one end under the organ a beautiful chariot painted in white enamel and gold with wooden figures of children all around the sides, and on the top in the centre is an ark also in white and gold.\n\nThe organ up above is a beautiful instrument and very massive and has a sweet tone\n\nand a treat to listen to, also the choir which I could not see but they sang very sweet. I spent a pleasant half an hour listening to the service and then I continued on my way.\n\nThe Cinema in the Grand Place was all booked up and I had to go down the Rue de Havre to the Mons Theatre where I managed to book a chair for one in the gallery for 1 franc 60 cent and then I wandered about until 5 pm when I returned back for tea and at 6 pm off again for the evening show to take possession of my reserved chair and put a fairly good evening in, although the pictures were good, I was disgusted with the Belgian Orchestra of seven performers. Their playing was awful to listen to and they were continuously out of tune.\n\nAs usual the theatre was packed more civilians than soldiers, it was a long programme and started at 7 pm and did not finish until close on ten. After coming out, the Belgian boys were walking along in groups singing and blowing whistles, which I presume is the custom with them. On coming along the\n\nstreets, in several large Cafes, music was being played and singing, and as it was after soldiers hours, I did not venture inside any of them.\n\nIt was snowing very heavy and I arrived back well covered over with snow and once more to bed.\n","68":"\n\nAm still waiting for the engine.\n","69":" and Wednesday we were still awaiting the engine and on","70":" we received word to light the engine up and depart for Calais at 6 pm with an empty leave train of German coaches.\n\nAfter several delays at the station we finally got away at 8 pm and as usual the delays enroute took place. After being relieved and taking up duties again we arrived at Somain early Saturday forenoon and after a Pilot was supplied by the R.O.D. we left and I had a good opportunity of viewing the battlefields between Somain and Arras, and there is no mistake the country between these two towns is knocked about shocking. Villages after villages were reduced to ruins, hardly a house fit to live in and practically no civilians about at all, only a French soldier here and there.\n\nThe stations were wiped out and the French Railway officials are quartered in wooden huts. The system of French signalling is all down and the traffic on the double line is worked by telephone, on passing through two villages the tombstones in the Cemetery’s are terribly knocked about and are lying about in all directions and the walls have practically disappeared.\n\nA large number of the steel bridges over the railway line are smashed and twisted in all directions and the railway is now deviated around them. The Germans made no mistake in their destruction, they certainly made a good job of their work, close up to Arras speed has to be reduced to 5 miles per hour and on a single line to cross over a canal, the huge railway bridge over the canal has been blown up in the centre and has fallen into the water. The lock gates close by has also been destroyed and men are now busy clearing away the debris, all the large stations the Belgians are busy repairing the lines, we only had a short delay in Arras and about 5 miles from Ligny, my relief took\n\nover and I turned in for a sleep.\n","71":"\n\nI took over again at 9 am when the engine was in the Tachincourt Depot for coal, having left the train at Ligny. After waiting for a long time for the crane to load the coal on the engine, due to the water supply pipes for the crane boiler being frozen and it was necessary to blow steam down the pipes to melt the ice inside. \n\nAfter we had our supply we came out and by degrees went back to Ligny for our train which in the meantime had left with another engine and we had to wait for the next in and it was just on 3 pm when we left with a long train of empties, and once away and through St Pol good head way was made to Montreiol where I was relieved at 7 pm and turned in after supper and slept until 3 am when we arrived at Calais and was instructed to take the train through Calais to Calais Maritime which is up amongst the docks. After waiting for a Pilot driver\n\nand line clear and it being just on 5 am I took over and after a couple of stops arrived at the Maritime at Cain and left our train and returned back at 7 am at the Depot and stabled the engine.\n\nAfter breakfast and the van cleaned out we collected our mail from the Depot Post Office and the morning passed reading our letters. After dinner I had a sleep and at 4 pm dressed and went out for tea at the Salvation Army Hostel where I met two Australian Railway boys just over from Blighty being from a party of 80 reinforcements, and naturally they were anxious to know the ins and outs of the French Railway systems, so I spent the evening explaining what I could and some of my experiences.\n\nAt 9 pm I said good bye to these chaps and caught a tram back towards the Depot and after a cup of tea & toast I turned in for the night.\n","72":"\n\nAt 12 noon we received a call to prepare the engine and leave for\n\nMons with a supply train and after drawing rations for 5 days and oil and being my first turn on I oiled the engine up and at 4.30 pm left the Depot and at 5 pm with the train 750 tons and 44 in length with my engine No 864, Baldwin type. \n\nI made a good run to St Omer, arriving there at 6.30 pm and after waiting for a Pilot left at 7 pm, on my way passing through a branch line or what is called a voiding line, which is built to releave the heavy traffic through Hazebruick. At Oudinghem there is a large demobilisation camp which is lit up well by electric light and huts in large numbers everywhere. Being probably an off night there were very few boys about, we continued on joining the main line again at Merris, on the way to Armentieres, just after passing Baileau and the junction of the Menin line and main line on the left is a large depot with about 30 coppers boiling, for the purpose of feeding the troops on their\n\nway to the coast to be demobilised. There were no trains in so I do not know how the feeding arrangements are carried, only I surmise that the tea and food is supplied to the troops in the trains, and not in the open.\n\nAs my Pilot did not know the road past Baileau he left me at the station and I continued along steady, picking my way, just before reaching Armentieres I was switched on to a single line and slowed down and slowed down and in a few moments I came to the canal where Fritz had blown up the large railway bridge and embankment making it necessary for the single line deviation, from what I could see in the semi darkness Fritz has made a terrible mess, and like all the other railway bridges, this one is broken and twisted in all directions and will take months of work to repair the damage.\n\nAfter passing the canal I was soon again on the double line and at midnight arrived in Armentieres, where I took water and\n\nas there were two trains ahead I had to wait my turn to get away. When I arrived my time being up, I was relieved and being tired turned in after some supper.\n","73":"\n\nI was up again at 9 am and found the train had arrived at Orchives , where the other driver had gone into the R.O.D. Depot for coal. At 10.30 am we were off again and at a few stations further on relieved my relief at 11 am, and worked the train on into Mons.\n\nEver since leaving St Omer the tubes in the firebox had been leaking and given us trouble, and it was necessary to go easy to keep us the boiler pressure. After several delays we duly arrived in Mons at 3 pm where the train terminated and reported to the R.O.D. Depot that the engine could not return with a load until repairs to the tubes were effected and after waiting some time we were sent into the Depot.\n\nAs our living van was very small and there was a large Fritz brake van on the lead of the train,\n\nsplendidly equipped and just the thing for us to sleep in, and plenty of room, we arranged with the shunters to allow us to take the van into the depot and change over, and in a short while we had made the change and soon made ourselves very comfortable, we soon received word to stand by and when required to take our engine and van back to Somain for repairs, so in the meantime, we fixed up the van. To fix the stovepipe through the roof, we had to unscrew the fittings and soon had the pipe in position and a bon fire going . And later on turned in.\n\nAt 3 am my relief was notified to go out on traffic and be ready for departure, and after taking water we had to wait line clear. As I was on at 7 am, I arose at 6 am & found that we were still in the yard, my relief wanted to leave the old van in the yard, but was refused and ordered to take it back to Calais.\n\nAnyhow at 7 am when I took over I quietly got my guard to place the old van on the\n\nnext road and then whistled for the right away and receiving it, we cleared out quick and lively with our new van. And we are now as comfortable as can be, having plenty of room for all of us to sleep and have our meals. \n\nAfter the usual delays enroute we duly arrived in Somain at 2.30 pm, not at all sorry, as it was very cold & snowing bad all the way from Mons, being the worst day I have experienced since I have been in France, coming along passing through the large towns, the people were out on the ice skating and sledging in large numbers, on arrival at Somain the snow was up over the railway line and still falling.\n\nAfter coming into the depot the engine was coaled and put in a spare road and the fire drawn, and on going around to book the repairs at the Depot I passed the large turntable which Fritz had completely destroyed blowing it to pieces, and making it beyond repairs.\n\nAfter tea we received word that probably\n\nwe will leave in the morning attached to two other engines for Calais, so we proceeded to make ourselves comfortable for the night, and wait events tomorrow.\n","74":"\n\nAfter lunch word came along to prepare the engine and take a train for Calais leaving about 8 pm, so after raising steam, I started to work the pump for the Westinghouse Brake, but found out that the water in the delivery pipe had frozen and steam could not reach the pump, so I had to put some fire in a tin and move it gradually along the pipe to melt the ice. \n\nAfter a while the steam reached the pump and it gave one movement and stopped. On examining the valve, I found that the reversing piston had broken, due to it being frozen and the sudden rush of steam snapped it, so another delay and as the Depot could not replace the piston, and that there were a bad derailment ahead, I was cancelled for the night and having no brake power on the engine we were held back until after dinner on Friday and was attached to another engine\n\nand a train for Tachincourt, were repairs were to be effected, so at 3 pm we were off once more and made a very slow run to Arras being delayed at every signal box, but being daylight the sights passing through this battle worn area was interesting.\n\nThis run I was shown the Hindenburg Line with it smashed pill boxes alongside the line and the deep trenches, in several places German prisoners were busy cleaning up the rubbish.\n\nWe arrived in Arras at dusk and after a short stay, continued on. At 9 pm my time of duty was up, I finished work and after some supper turned in and when I awoke at 6 am, we were in the depot at Tachincourt, receiving coal, and there was told that no repairs could be done, and we were to go to Calais.\n\nAssisted by another engine and at lunch time we left on our journey once again and made a bon run to Hesdin when we were blocked by another engine which was coupled in the lead, and up behind came another engine on its own and was hooked on the rear, making four engines and\n\nfour living vans. The three engines were only going as far as Outreau depot at Boulogne. Off once again we reached Montrecul , were we all were put in the siding for a leave train to pass and there another engine was put in the lead, a French one this time, making now 5, after a delay of 30\" we were off again and soon arrived in Etaples, where one engine was taken off to work a train into Boulogne, and after a while we continued on and made Outreau Depot at 5 pm, where we received orders to stand by until an engine for Calais came along, so we received an order and all hands had a good hot meal.\n\nWhen the engine arrived the crew were not to well, so my relief driver and his mate decided to work the engine to Calais, and I agreed to work on also to Calais, although my time was up, and at 8 pm we went out back to Hesdigneul for the train and had to wait until 11 pm for the French guard and then it was midnight before we received the right away, but being a bright moonlight\n\nnight, but very cold and being my first trip with a train through the two tunnels, I was somewhat interested, we made a good run right through to Calais arriving at 3 am where the sick men took over their engine and my relief relieved my mate and myself and as I was very tired working a shift of 20 hrs I turned in to bed and slept until 11 am.\n\nWe were now in the depot and the engine receiving coal, we were now considered off duty for 24 hrs. \n\nAfter dressing, I had a cup of tea and a piece of toast, and then over for the usual hot bath and a clean change of clothing, and after dinner I went out for a stroll. The weather was still freezing, and I had to wrap myself to keep warm, I went into Calais and on to the French Loco Depot to visit a French engineman, and found he was away in Dunkirk with his engine, so I had to return and came back to the Depot to catch a train for St Omen to visit my French\n\nfriends there, but no train was not due to leave until 6 pm, it was to late for me, so I returned to town by tram and into the Salvation Army Hostel for tea and then on to the Cinema, where a medium set of pictures was shown, and as usual the hall was crowded.\n\nAfter seeing the programme through and having a drink in the Private Bar, I came away at 8 pm and caught a tram and returned to the Depot and found my mates all at home reading and writing. After a cup of tea and toast I turned in and at 8 am next morning","75":" we were awakened by an order to prepare for a run to Montignie, with another engine No 1825, a W. Dept Machine of English make, and good one at that.\n\nAfter breakfast we drew stores and rations for the usual five days run, and at 12 noon we were ready to depart, but had to remain in the depot as there were no French guard available, so we drew our hot dinner and awaited further\n\norders. At 3 pm we were ordered out to proceed to Darras Marshalling Yard three kilos away for the train. After arriving on train which was ready, we received the word to go at 3.40 pm. The engine sp far was steaming and working well, we made St Omen at 4.45 pm were we took water and at 5 pm departed travelling via Oudingham to Merris, I made a non stop run to Oudingham when my relief took over and I turned in for a sleep, being on again at 4 am.\n","76":"\n\nWas called at 3 am and took over at 4 am at La Madeleine, a station in Lille, there being 3 trains in the yard to depart before us, so we made ourselves comfortable until 5.30 & when the Chef de Gare informed me that Fives would not accept us, and if we desired we could go passing through Roubaix, Tourcoing on to Mouscron, travelling on a single line owing to Fritz having blown up all the railway bridges on the way, and put the Belgium signalling gear out of order as all the signal boxes were destroyed and the levers\n\ntwisted in all directions.\n\nEvery bridge I crossed over, workmen were busy preparing the foundations for new ones to be erected.\n\nOn arrival at Mousecron, we had to reverse our living van & put it on the rear and go over the turntable & turn engine to proceed back on another single line to Tournai and in about 30 minutes we had completed our work and took our departure and got as far as Froyennes arriving there at 11 am and was stopped outside. This station is the junction of the line from Lille and Mouscron and it now being 1.15 pm and we still are here.\n\nAway again at 2 pm we soon reached Toutnai, another large town, with a fine station and hardly knocked about, the large stone bridge across the railway has been destroyed.\n\nThe engine here went into the depot for coal and water. I turned in here for a rest and had a faix sleep , until 11 pm and after some supper I took over at midnight and after a good run on the splendid Belgium line arrived at\n\nCharleroi at 5 am, another very large town and a fine station built of steel and glass windows, after a change of Pilots we were off again and in 15\" we were in Montiguie our destination, and after putting our train away, we went into the Depot, to await further orders.\n\nMt relief driver’s mate who had been sick visited the Dr. and was ordered to rest until we returned to Calais, and another fireman was supplied. After being relieved at 10 am I turned in and had a fair sleep, awakening at tea time when we were on our way back with a long train of Australian Artillery Wagons, and an assisted engine.\n\nWhen I took over at 8 pm we were in Mons and from there to Mons Junction we made very slow progress. The coal supplied at Montignie was of a very inferior quality and gave both crews a lot of trouble, the coal being more like coke and would not burn. \n\nAt Mons Junction we were help up for over two hours so my fireman and myself cleaned the fire which was chutered all over the\n\nbars.\n\nWhen we received the signal to proceed the fire was cleaned and all was ready. After stopping for a few minutes at the next cabin, we received the signal and left for the next cabin called Broken Bridge. This place is in a bad position on a curve, and cannot be seen owing to passing between two large buildings.\n\nAs soon as we passed these buildings the driver on the leading whistled for brakes and I shut off steam and looked out ahead and in the moonlight I could see another train without any lights in the section. I reversed my motion and gave the engine steam and the driver on the leading engine applied the brake on both engines, but it was too late and we hit the van of the train. \n\nThe impact caused the heavy wagons behind to come forward and knocked the two living vans off the line, our van canted up on one side, and the boys inside were thrown out of their beds on to the floor, no one was\n\nhurt except my relief who jumped out of bed and out of the van on to the stones and cut his foot. The stove inside was knocked over, and the buffers were smashed. This collision took place at 12.30 am and we had to remain until a French Relief Gang came along to rerail the two living vans at 4 am, at 6.30 our van was rerailed and as my relief was hurt, we were ordered to go to Somain with our van and the other engine had to wait until his van was rerailed.\n\nAs no damage was done to the engines, we left and arrived at Somain at 8 am where an A.M.C. man met and examined the driver and attended to his wound, which was not serious. We went into the depot for rest, where two French Wagon Examiners came and condemned our living van oto go any further, so the Officer in Charge of the Depot gave us another one in its place, but not near as good as our last one.\n\nOur luck was right out, losing the\n\nvan as all hands was so comfortable having plenty of room.\n\nAfter changing our beds and kits and making ourselves comfortable, we all had a good rest, and was not required until 8 am this morning","77":"\n\nOur next destination was Caudas via Arras with a long train loaded with German Gotha Aeroplanes, under an armed guard. We left Somain at 8.30 and arrived at Arras at 11.30 am where we all had dinner in the van, and now at 1 pm we are waiting for our Pilot before we depart. As I take over at 6 pm I intend having a sleep during the afternoon.\n\nAt 1.30 pm we left Arras and made a good run to St Pol and after waiting for a Pilot which was supplied which was supplied at St Pol instead of Arras. We left St Pol at 5.30 and did not stop until Doullens was reached at 6.45 where I took over and after a few minutes run arrived at our destination Caudas where we left the train in the siding and was piloted into the R.O.D. Depot for\n\ncoal and further instructions, which were to the effect that we were to stable our engine for the night and leave in the morning for Achet le Grand to take a Hospital Train to Doullens and perhaps Rouen. So after making the engine good I turned in for the night at 10 pm. \n\nAt 6 am this","78":" we were called and my relief took over and prepared the engine and left at 8.0 am with the living van and went over a R.O.D. line to Achet le Grand passing through no mans land for miles and miles, which was an eyeopener to us all, the country is cruelly knocked about, and not a tree is left standing neither a house of any sort, which proves there has been bitter fighting all over this area. In places hardly a piece of ground measuring 12 square feet is left untouched.\n\nTrenches and old dugouts blown in everywhere and pieces of material of every description laying about. Likewise graves with their white crosses all over the place.\n\nAll along the railway embankment there are deep dugouts lined with timber, several\n\ngraves are marked by a rifle, helmet and equipment, likewise several German graves the same. We passed several German guns disabled and laying alongside the road way. \n\nAfter a couple of hours run we arrived on the French main line and soon was into Aschet-le-Grand, where the engine took water, and another engine came on the rear, and off again and after 45\" run we arrived at our destination. \n\nThe 43rd Casualty Clearing Station, at a place called Beavencourt, practically in no mans land, the Ambulance Train was loaded ready and the assistant engine pulled the train out from the siding and backed it on to our engine and at 11.30 am we started on our journey to Doullens via Ashet-le-Grand, Arras, passing over several steep grades, with practically a non stop run we arrived in Doullens at 3 pm, where the Ambulance Train was due to remain for 3 hours to complete her loading.\n\nThis train belongs to the Great Eastern Railway in England and is beautifully fitted up, some\n\nof the coaches were laying down cases, and others were for sitting cases, it has the electric light throughout, and it has sitting and writing rooms, and is heated by the apparatus from the engine. The length f the train is very long cosisting of 15 coaches and a brake coach, and weighs about 450 tons.\n\nAfter uncoupling our engine and shunting out our living van from the rear, we proceeded away to Caudas for further instructions, arriving there about 5.30. The instructions were for us to work an empty demobilisation train during the evening to Beaurainville on the St Pol – Etaples line.\n\nAfter receiving coal and preparing the engine, we were ordered to stable the engine and leave at 9 am in the morning.\n","79":"\n\nAfter a good nights sleep we left Caudas with our train, consisting of 44 covered trucks, at 9.30, having a Pilot driver as far as St Pol, passing through Doulleus and Frevent. The grades along this line and very steep and the scenery very pretty, not being knocked about at all. The hills partially covered over with snow, and\n\nthe tall pine trees in the valleys, and as the snow in the hollows had melted, the cattle about was grazing in the paddocks, and the weather clear and fine and a bit warm, the journey to St Pol was very interesting and pleasant. My pilot left me at the junction of the St Pol, Etaples line. I proceeded along well until Hisdew was reached where I had my first delay and after a while continued on to Beaurainville where we stowed our train away and left for Calais with only the living van and arrived there at 9 pm and signed off at 10 pm.\n","80":"\n\nBeing off duty all day, after dinner I went by a supply train to St Omer to visit my old friends there and found them all well, and after a good tea with them I spent the evening chatting about old times. As a train for Calais was due to depart at 9.15 pm I said Good bye to my friends and came back with it as it had to do some shunting at Audruicq and Veudroux I did not arrive back at the depot until\n\nafter midnight, at 3 am.\n","81":"\n\nMy relief driver was called to prepare the engine for a run to Huy near Liegge but after a long delay, we did not leave the depot until nearly 12 noon, having to go along to Verval Siding off the Dunkirk line for a Leave Train, arriving there at 12.30 pm.\n\nWe hooked in to the train, but as the troops had not arrived, we had to wait. Our train consisted of 45 covered vans, each one fitted with a stove and seats, and in the rear is a travelling kitchen where tea & food is served out to the troops enroute.\n\nAt 1 pm along came the troops and they were a mixture, from all Regiments, with a good sprinkle of Australian boys, all just over from Brighty from leave.\n\nAt 1.45 the troops were aboard and we left on our journey. At 2 pm I took over the engine at Cologne and having a clear road made St Omer in a little over an hour, where we took water and off again via Houduigham and Merris, where we\n\nwere shunted into the siding for an hour and then again at Bailleau and finally arrived in Armentierres where my time was up, it being midnight.\n\nAfter a good sleep I awoke at 7 am and we were past Fives and had several delays. I took over at 10 am and made terrible slow progress as there was a block on ahead. It took me quite ten hours to make Tournai, as soon as one train moved up another took its place & so on until Tournai was reached at 3.15 pm and after a while into Loco for coal, which took me 3 hours to get and out again on the train.\n\nHad to wait for a Belgie guard who arrived at 8 pm, and we then got line clear and my relief took over & with a Belgic pilot, started away and after I had supper I turned in and awoke several times during the night, & we were still moving and at 6 am arrived at Charleroi. I took over again here, and received instructions\n","82":"\n\nto come the train and run back to the R.O.D. Depot at Monceau for further instructions. After being shunted into a siding, we did not move again until 10.45 am when we left for Monceau 6 kilos away. Arriving in the depot at 11.30am where the engine was coaled by German prisoners and then we were put into a road to await further orders.\n\nAfter drawing a hot dinner for four of us, we spent the afternoon writing. At 4 pm I made inquiries as to what time we would be required as we intended if possible to have a walk & see Charleroi before dusk, but could only have leave until 7 pm which was no use, so we decided to stay in for the night.\n\nAt 10 pm we received a call to go back to Charleroi and after arriving there and on to a train of empty supply trucks, we left at 12.30 am","83":" for Calais. At 2 am I was relieved at a small station and my relief worked into Tournai and left the train in the\n\ngarage and into the Loco for coal, while we were in the depot, word came along that our train was taken on by another engine and as an engine had arrived in the yard with a single crew and had been on duty long hours and required rest we were ordered to prepare and work the train back to Charleroi, which meant that I had to run my engine tender first to Grand le Compte 50 kilos away as the turntable in the yard had be blown up by the Germans, and could not be used.\n\nIt was not to pleasant running this way as it was raining and blowing very hard and cold in the bargain, but it had to be done & that was the end of it. I took over at 10 pm and shortly afterwards left, and as we only had a light train we made good progress arriving at Grand le Compte after midnight and into the depot to turn the engine and soon left again under more pleasant conditions, we made a bon run right into Montiguie, where we left the\n\nthe train and went in for coal, we hoped to get a run further in Belgium, but our luck was out, as being a Calais engine, we were required to work a train from Charleroi, we came back and was put into a dead end and there we were told to await. \n\nI had a bon rest while the engine was waiting and took over at 6 pm and just then received a call to go back into a siding and work a train and away we went and soon was coupled on to a long string of wagons, which contained artillery horses, eight in a wagon attended by two Australian boys.\n\n In a few moments we were away again and into Charleroi to await our Belgie guard, so in the meantime I took a walk along the train to see if any brakes were on the wheels as we had 50 wagons containing 8 horses each and bound to be heavy, I had a good joke at the Australian boys expense while passing several trucks, the boys mistook me for a Belgie having the Belgie engine badge on my cap, and having my torch lamp. The boys spoke to me in French\n\n“Killa Partie Monsieur\" meaning what time will we be leaving, I answered them in English “I don’t know but not until all the brakes are clear\" and looked up at them flashing my light, they recognised me at once with the Australian badge underneath, and one remarked to the other, What a duckboard you have come, and the remark caused a great laugh. \n\nThese remarks happened several times and each time the same laughter, anyhow they were all pleased to have Aussie enginemen on the lead.\n\nAt 8.30 all was ready and we took our departure and only got a short distance when we were blocked and only made station to station and then stop. We soon found the cause, a train between Manage and Mons had run into another at 6 pm and caused a bad derailment injuring several of the train crew, so all traffic had to be diverted via Grand le Compte and Tournai. \n\nWhen we arrived at Grand le Compte there were three trains side tracked for us to pass, and after taking water we\n\nhad the road clear ahead for a long way and did not get a setback by signals until Arth was reached where I was relieved and after breakfast I turned in for the day.\n\nI awoke again when we were at Port de Arras near Bethune, where the troops were supplied with food and after an hours delay, we were off again via Loos and La Basse to Bethune. Before leaving Port de Arras my relief sent word to Bethune for the engine and crew to be able to return to Calais.\n\nWe made another good run through Loos and La Basse, at the latter place, a large number of German prisoners were busy straightening the sides of the canal and other clearing up work also working on the damaged locks, and as far as the canal was velar several barges were lying alongside loaded up with tiles, for the roof of houses which were not knocked about too much.\n\nArriving at Don Sauigham a stop was made for the troops to water their horses and here I took over again after an hours delay, we\n\ncontinued on making Bethune at 4 pm.\n\nAfter we stopped for water I walked back and spoke to the Chef de Gare (Station Master) about relief and it was arranged, and I cut the engine & van off & was moving away, when I was stopped by the shunter & told that I had to take the train on to Cologne 10 kilos away towards St Pol which was away from direction of Calais.\n\nI spoke to him in French that the engine finished here & after an argument with him & the signalman I eventually had my own way and away we went towards Berguette and on to the St Omer line via Aire and Arques arriving at St Omer at 6 pm, where we were told to stand by for a while to work a train to Calais, having plenty of coal etc, I had to wait, so took the opportunity and went over to the café where my French friends were for a dixie of hot coffee for both of us, as my relief crew were asleep I did not wake them for tea. \n\nI found my French friends all well and obtained some excellent coffee and brought it back to the engine and both of us had an\n","84":"\n\nEnjoyable tea, at 7 pm we were put on our train and at about 9 pm our French Chef arrived and we took our departure and made a good run without a stop as far as Darras Siding one kilo from Fontinettes where a portion of the train was taken off and we were ordered to take the balance on to Calais Maratime. Passed Calais Ville the main station, as it was midnight I called my relief and they took over and I being tired and cold and as it had been raining for a long way I was glad to turn in and had a good sleep. \n\nWhen I awoke we were in the depot finished and all was quiet, when one is tired the jolting of the van does not wake one up in fact it lulls one off to sleep. \n\nIt was now","85":" At 10 am we were told that we would be returning to our depot any moment and in the meantime, would be waiting orders, and would not go away on any more trips, which we all were sorry to hear as we have been having a bon time on these runs so interesting and seeing so much, anyhow\n\nit may mean our near return to England and that was one consolation. So we settled down to await their pleasure.\n\nAfter dinner I went for a stroll up the town and bought some cigars for my old French friend at St Omer at came back to the depot and caught a traiun straight away and arrived in St Omer a little before 6 pm, and went along to the café and had a good tea and gave the cigars to the old grand dad who was pleased to receive them.\n\nI spent the evening with the family and said goodbye at 9 pm and perhaps my last farewell and thanked them all for their kindness to me since I had the pleasure of knowing them. I then caught a French goods train right close to the depot and arrived in the wagon again at 11.30 pm.\n","86":" all day was spent lying about and in the evening three of us went into the town to a cinema, a real continental one, where you pay 5c. to go and sit at a table and waiters bring along any drinks you require,\n\nall the while the pictures are being shown which were a good lot. The sides of the large hall has massive looking glasses and the paintings and decorations of the ceiling was beautifully done. The hall was crowded all the evening, people coming and going, it was quite a novelty to us and we all enjoyed ourselves. \n\nFirst an orchestra would play a piece, then a beautiful organ just behind us would play and it had a lovely tone and quite a treat to listen to. It was the best organ I have heard here in France or Belgium. It was over at 8 pm and we all returned to the depot once more.\n","87":" took it easy again and after tea again went to another picture house, but not so good as the other, still we enjoyed ourselves.\n","88":"\n\nWe received a call at 7 am to prepare our machine and return to Conchel le Temple our depot, so after coaling up I received word to go out and at 11 am we took our departure engine and van vis Bologne and Etaples, we made a good run, but not pleasant as\n\n \n\nit was very cold and wet. The rain beating in on my side nearly all the way. I was glad to arrive in the depot at Conchil at 4 pm and finish, as soon as I had stopped a clerk came out to me asking me for my pay book and where did I want my pass for as I was going on leave. \n\nWhat a bombshell. I never dreamt for a moment about going on Blighty leave, it was furthest from my thoughts as I had only been back 8 months and expected two months to go at least, anyhow I was well pleased and could not really realise going on leave, I was told to report at 10 am for examination before the Doctor and would leave on Sunday or perhaps tomorrow Saturday, anyhow I have fixed things up this evening and may get away tomorrow.\n\nMy mates are to remain in the van for a while and may get another run om the Nord Line and I hope to join them again on my return.\n\nI spent this evening writing up this diary and will continue again somewhere in England, I have booked my pass for Inverness\n\nFriday 28\/2\/19\n\nin Scotland, I may go as far as Glasgow I have not quite made up my mind where I will go, as I intend spending a week in London and after that will it is a ? so I will now stop until a few days time.\n\n"}}