{"Document Name":{"0":"Diary_0030","1":"Diary_0030","2":"Diary_0030","3":"Diary_0030","4":"Diary_0030","5":"Diary_0030","6":"Diary_0030","7":"Diary_0030","8":"Diary_0030","9":"Diary_0030","10":"Diary_0030","11":"Diary_0030","12":"Diary_0030","13":"Diary_0030","14":"Diary_0030","15":"Diary_0030","16":"Diary_0030","17":"Diary_0030","18":"Diary_0030","19":"Diary_0030","20":"Diary_0030","21":"Diary_0030","22":"Diary_0030","23":"Diary_0030","24":"Diary_0030","25":"Diary_0030","26":"Diary_0030","27":"Diary_0030","28":"Diary_0030","29":"Diary_0030","30":"Diary_0030","31":"Diary_0030","32":"Diary_0030","33":"Diary_0030","34":"Diary_0030","35":"Diary_0030","36":"Diary_0030","37":"Diary_0030","38":"Diary_0030","39":"Diary_0030","40":"Diary_0030","41":"Diary_0030","42":"Diary_0030","43":"Diary_0030","44":"Diary_0030","45":"Diary_0030","46":"Diary_0030","47":"Diary_0030","48":"Diary_0030","49":"Diary_0030","50":"Diary_0030","51":"Diary_0030","52":"Diary_0030","53":"Diary_0030","54":"Diary_0030","55":"Diary_0030","56":"Diary_0030","57":"Diary_0030","58":"Diary_0030","59":"Diary_0030","60":"Diary_0030","61":"Diary_0030","62":"Diary_0030","63":"Diary_0030","64":"Diary_0030","65":"Diary_0030","66":"Diary_0030","67":"Diary_0030","68":"Diary_0030","69":"Diary_0030","70":"Diary_0030","71":"Diary_0030","72":"Diary_0030","73":"Diary_0030","74":"Diary_0030","75":"Diary_0030","76":"Diary_0030","77":"Diary_0030","78":"Diary_0030","79":"Diary_0030","80":"Diary_0030","81":"Diary_0030","82":"Diary_0030","83":"Diary_0030","84":"Diary_0030","85":"Diary_0030","86":"Diary_0030","87":"Diary_0030","88":"Diary_0030","89":"Diary_0030","90":"Diary_0030"},"Date":{"0":"unknown","1":1219.0,"2":1220.0,"3":1221.0,"4":1222.0,"5":1223.0,"6":1224.0,"7":1225.0,"8":1226.0,"9":1227.0,"10":1228.0,"11":1229.0,"12":1230.0,"13":1231.0,"14":1232.0,"15":1233.0,"16":1234.0,"17":1235.0,"18":1236.0,"19":1237.0,"20":1238.0,"21":1240.0,"22":1251.0,"23":1252.0,"24":1253.0,"25":1264.0,"26":1268.0,"27":1271.0,"28":1272.0,"29":1273.0,"30":1274.0,"31":1275.0,"32":1276.0,"33":1277.0,"34":1281.0,"35":1282.0,"36":1302.0,"37":1303.0,"38":1304.0,"39":1308.0,"40":1312.0,"41":1313.0,"42":1333.0,"43":1360.0,"44":1363.0,"45":1364.0,"46":1366.0,"47":1381.0,"48":1386.0,"49":1390.0,"50":1393.0,"51":1395.0,"52":1396.0,"53":1397.0,"54":1403.0,"55":1404.0,"56":1405.0,"57":1406.0,"58":1426.0,"59":1457.0,"60":1497.0,"61":1498.0,"62":1507.0,"63":1552.0,"64":1555.0,"65":1556.0,"66":1557.0,"67":1558.0,"68":1559.0,"69":1560.0,"70":1563.0,"71":1564.0,"72":1571.0,"73":1573.0,"74":1574.0,"75":1575.0,"76":1576.0,"77":1577.0,"78":1580.0,"79":1581.0,"80":1582.0,"81":1590.0,"82":1595.0,"83":1603.0,"84":1604.0,"85":1605.0,"86":1609.0,"87":1610.0,"88":1612.0,"89":1614.0,"90":1619.0},"Entry":{"0":"\n\n1917 ","1":" Cap’ in Bullecourt stunt - 4th Div Wilks Temby & Kay in hole. 26 hrs in snow. Huns assembled & jeered ludicrously.\n","2":" taken from shell hole to & en-route to – camouflaged Baty’s. . Badges razor boots stolen for .\n","3":" Rly Siding brutality robbed etc.","4":" Entrained hospital. Watch stolen later. Vallenciences. Numerous wounded – crippled prisoners etc. Filthy beards ragged clothing. Weird Hun M.O. No attention . Sauer Kraut. Substitute coffee –","5":" SM. McKenzie & Moore died thro neglect. Deathrate average 4. ","6":" - 2 eggs fried bread. frostbite severe. Leg is black swollen. blankets enclosed in fatty covering dogs butchered & cooked for patients. . Beef & mutton unprocurable. . 3 Huns 2 nurses & 4 Russians, 3 tables operating . Paper bandages & no wool. \n\nPrussian night ward cruelly treated. Ellis","7":" Batt’ & then relief. able to walk retaliated. ","8":" Bread tea excitement caused by Russians. ","9":" taken to Hun lazarett for Xray numerous French girls working in the hospital. French women endeavouring to give me Cigs Huns intercepted with rifles. Women cried. Nearing the hospital several girls came up then kissed","10":" No literature obtainable seldom sleep 3 hrs in 24.","11":" Usual monotony.","12":" Transfer to Hunland of men fairly fit. food breakfast cup of coffee 9.30am 6ozs black bread. noon dinner bowl saur kraut of sweede in hot water.3pm coffee. 6pm Hot Water & 2 spoons barley. Dog or horse flesh is occasionally issued .\n\nOffered 40 Franc bread. Russians steal & jam 6 marks. Soap unprocurable, ½ tabs cost 4 marks. Cigs French 1½ each. Men mostly robbed earlier. ","13":" Hun exchange money 15 ½ marks = 20 Francs = accurate value 22 marks. Russians scrape floor cigarettes. ","14":" Knee improved. Scotch remark. Well lads yell have the usual today, numbering three, bread issue, Doc’s visit, dinner – craving for food. Btsh aeroplane bombed town. returned safe. ","15":" 2nd dressing. xrays exam. Bone is split – Tibial head. Russian operation whilst waiting. 30 fragments bone operation half hour without anaesthetic. Same used only exceptional cases. ","16":" Cards issued. asked Interp – he stated why do you ask if the cards are allowed through. (later discovered these cards are destroyed. All my relations no news. ","17":" Rumours of transfer to Germany. Severe cases exempt. 28th numerous fresh cases from retaliation. 2 Lincolnshire Reg deliberately shot en route to work. broken limbs etc quite common.\n","18":" Sticks rifle butts & bayonet are also common. one of the lads shot in wrist by bullet that pierced heart of another man. received for stepping only 2 feet from the ranks to get cig end, whilst marching to work. March 10-12 kilometres to work. Limbs like broomsticks. under shell fire. French women assist when possible. top hats etc & the ludicrous costumes. many French women shot. Food for 24 hrs. 11 men to one small loaf dinner – nil – tea – bowl of greasy water & 10 pieces mangel wurzel- line raid canteen for food. Eat grass, bones & refuse. Every Sunday parade clothing. no soap or change of clothing intense cold. Wet clothes. this is deliberate cruelty by Commandant at Reprisal Camp. Sick men worked & then clubbed to work until unconscious, then hospital. many deaths thro this practice. Hindenburg line by British. Russians cement & gun emplacements. British & French wires. ","19":" diary for Hun scrutiny. I use tube.\n","20":" small party Hunland. Hun cas’ too numerous. Special trains Arras Sector. decomposed Sweedes. \n","21":" temperature less. Little conversation.. Piece of grissel in my soup which I kept to chew later. Several men wards told me of additional Hun brutality. Many men have had no dressing at least 10 days. latrine buckets, , filthy beds etc. 2-3rd, had 3 dressings since arrive here. 4-11th usual routine. Craving for food. Frenchman returned from Germany told me of parcels in Hunland. No parcels or mail whilst in Retal’ Sector..","22":" local papers smuggled. News brief & distorted. aeroplanes – French people tortured. Hun language. ","23":" Interpreter informed us of valuables & money - again refused by prisoners usual Hun trickery. ","24":" Name appeared for transfer Germany. Much excitement of a transfer. Donnewetter & other expletives. Discovered Wilks when departing. Crippled Huns stretcher bearers. Gifts from Frenchwomen. Hospital train very comfy. nurses , she copied remarks. Then returned hospital, taken to another ward. Desperately hungry.\n\n16-23rd. Inter volunteers information. , glasses, fair hair tipical Hun. also different M.O. very sarcastic & a bully. Wound septic. Fresh dressing since return. persistent requests ignored. 24-31st,","25":" Pulled out of bed rough handling forced to walk. Struggled metre collapsed. ","26":" allowed to remain in bed. Ward similar pigsty. buckets overflowing state repulsive, received small quantity horse flesh. pea soup. a general improvement in food. \n","27":" Ideal climate. Many deaths thro inattention. 4 Australians. Lukis 16th Batt’n leg amputated without anaesthetic died. Muller 14th Batt’n died then – neglect. frostbite both feet off. \n","28":" Exceptional cases. I eff v little bone dog flesh. Occasionally little white bread. 90% deaths Russians. 2nd usual ordeal. ","29":" Hun shortage – orderly ate bread of prisoners. Scotchman interpreting.","30":" Hun Generals inspection, much excitement.","31":" Large party for Hunland usual amongst orderlies. Wilks – demanded to walk & illtreated. Hun attempted to strike girl with bayonet. I with others entrained in evening for Germany. ","32":" travelling in train. food improved. breakfast coffee 2 thin slices smeared with cheese. dinner bowl rice. tea – similar to breakfast. stopped Hanover & Berlin crowds people. crops good all soil under cultivation. crossed River Spree. Hundreds factories near Berlin. 10pm","33":" Arrived Stettin. Much excitement. 1am by tram to hospital. Johannisthal. food riot. At J’s used many civilians injured & killed. much debris in streets. Compelled to walk into hospital ward – 130 various nationalities. Milty monopolize all supplies. Russian 1914. Hun student operating theatre. Ravenously hungry. cards issued. Dobertz lager men returned for one Russian.","34":" Wound still septic. bandages for 6 weeks. ","35":" French Sgt voluntary – particulars for London. 13-20 – I only Englishmen in bed this ward. abominable sanitary – venereal cases. Russian orderlies. Thefts etc. no smokes for 10 days. Men collect leaves & fragments roll in bandage. Last day. before Hun specialist. 21-28th. I was X rayed 2 hrs in theatre. Ill treatment by Hun in X ray room. each morning at 8am in operating room. Hun nurses laughter. Women worse than the men. 29-30th. Transferred No. 7 hut informed of operation. weather glorious. Beer house in time. lack of literature, beer issued on Sunday & men from reprisal in Russia receive empty packets. apparently stolen en route. ","36":" Hair not brushed since capture. 3 stone decrease. ","37":" Received 2 cards from Copenhagen. ","38":" taken bath room. Hun, Russian Frenchman & Englishman. operation. 4-6th. V. ill. 7-10th.","39":" dressed first time since operation. tube thru leg.","40":" two parcels. ","41":" dressed. rough handling. 13-31st. food demolished. Instruments badly sterilized often used 6 cases. Johnson. many self imposed duties & kind acts. \n","42":" Strand Mag 1894. Russians escaped. Crippled posterns. 2nd-28th. Usual Hell. Men arrived in June received parcels.\n","43":" Parcels. 29-30th Aug My first parcel from England. Contents \nmeat\n , jam, dripping, tea, sugar, milk, oxo &etc. Hundreds death thro starvation. White bread coffee again & Berne. Prevalence of consumption. No 9 Barrack numerous deaths. French a little assistance. Russians no assistance. Letters Miss Chomley.\n","44":" My second operation. Piece of Rubber 2 inches long found. \n","45":" Transferred No-4 3–many limbless in next barrack. man in no mans land 6 days operating whilst awaiting my turn. \n\n2nd–9th. Many parcels. Wound dressed. Asked Russian for more frequent dressings. Screams of other nationality. Warm bed to cold hall. Several cases pleurisy. 5 deaths daily. Swedes in abundance. 10th-17th. Wound unfavourable.","46":" operation necessary. possibility of amputation. Tommy amp. Nurses frivolity & heartlessness during his operation. Col Goldenberg & cognac. Companion wounded & new wounded privates. Cripps still living.\n\n18-25th. Received clothing parcel","47":" grocery","48":" Second food since capture. Some have had 10 whilst others have none. bread in Winter biscuits in Summer. stale & often mouldy. biscuits hard. etc. Compatriots assist when necessary. Many parcels recently stolen. no direct evidence. 26th-30th Weather cool & boisterous.","49":" Visited No 3. repulsive odours &etc. Vermin &etc.","50":" Russian informed me of operation on","51":" . \n","52":" Garden with officers. 7 off here receiving surgical treatment small allowance. Lubinsky purchases .","53":" Operation & various unpleasant experiences – received two food parcels. choc & etc. 5pm transfer Hall. \"Brass Buttons\" Hun warden - & his devilry. 3rd-10th Very weak. Much bone removed. Hun surgeon’s cruelty.","54":" informed led to be amputated if no improvement. Parcels placed conspicuously to annoy Huns. Food unprocurable Stettin. Various prices. soap ½ tab 2 marks . ¼ lb tea -5 marks & upw. boots 100 marks 1lb canned meat 8 marks, 1lb jam 5 marks 2lb bread 20 marks. &etc. Cannot sell or give. Maximum Hun punishment for pillage. to Western front.","55":" Wound improves. Several French books. omission","56":" marked Switzerland. Anticipated Spanish representatives. Old Bill ober inspector. cooking. 5pm favourite hour for preparing food. Russians in collision with Bill. His awful wrath & indignation. Rubbish &etc for fire.\n","57":" Photos 4d each by Frenchman & Hun. 12-41st 15\/- monthly from London. Parcels deceased men. Hun women rations similarity. Russian Jews deceitful.","58":" Snow storm- - wound healing. Chimpanzee transferred from ward Swei. 2-9th. Arrival Russian from Riga. Severe fighting treachery intrigue amongst their officers. Some receiving Hun money. Russians amuse me from either side. 10-17th. Much snow about. new orders. food to be taken in bowls. Felfaber livid. Huns around the beds scrutinise. Maudie & his troubles. razor purchased 6 marks. 17-25th mail received by some men 6 weeks from England. £1 from Red Cross. Cigars 4d lemonade 2½ cigarettes 1 mk for 10. these purchasable. Wound improves , bed sores accustomed to vermin. 26-30th. Splint removed wore same for 5 months. Frequent visits from officers & distribution cigarettes purchased own all’ce. Russian murdered , Swei ward amputation nearly succumed. Lubinsky & Goldenberg transferred to Castle. New surgeon Ward Swei. Wound dressed alternate days. Hun student MO interest in complicated cases.","59":" Monotonous life. Old Bill continues to worry all. Horse chestnuts substitute for milk & coffee. odious kitchen. potatoes barley & some meal , substitute for macaroni. I my meat. 2-9th. Health improving. Lung congested this foul air. Hope to leave my bed shortly. Humiliating scenes parcels Russians & Huns pester me. Donation of Rice, Sago &etc. They imagine parcel from America. \n","60":" 9am. Old Bill visits ward. Kicking & hitting exhibition.","61":" Ventured out. collapsed. 12-19th. Managed 50 yds alone. Brass Buttons transferred. Bandage forced down my throat. Old Bill PMG Stettin. 20-24th.","62":" weighed","63":" less. Improvement since receipt parcels. Letter from home the first. Xmas eve. Officers & self organised a concert. Much trouble with O.C. Scotchmen brought me bottle wine Xmas day. Huns supplied Xmas tree, creating much trouble & excitement in consequence thereof. The meal since capture. Main 2 ozs roast pork & boiled potatoes. Desert. Similar to jelly disposed to Russian orderly. bottle of lemonade apiece. I received special parcel from","64":" Batt A.I.F. Many lads Swei ward without food. shared parcels. \n1918 New Years day\n Wound healed almost. one man of","65":" party member besides myself. Spanish Red Cross Representative recently visited us. Supposed to be a Hun . Nerves frightful state.\n\n2nd-9th January. Weekly tour. Specialist & Co. Australian veteran. 18 years in Victoria. On the","66":" marked out. 10-17th. My wound healed. Flying officer & Hun specialist. Uniform. departure. People & peculiarities in Stettin. Women – beer houses. Soldiers – poor people &etc. 3 sentries to guard 5 prisoners. 60% increase Altdamm 12 miles obsolete carriage 6 Russians & Huns. Journey & trails. Arrival camp 1-2-3-4. Camps. Hut & inconveniences. Johnson and Wilks. Lattrines &etc. 18-20th. Palliasse & rough filthy blankets. repulsive soups. M.O inspection marked Switz. thawing. Men 12 mon waiting. 21-31st. 600 arrivals from reprisal awful scenes. man who ate ravenously. towards the end of month additional numbers arrived. General conditions. Camp money. Canteen. rates of pay. Defaulters friends a Commando. Chemical fabrics. Rifle butting. Russians obtaining eggs &etc. Adulterated spirits. Breach of discipline. & concerts. various nationality. Post, Gutteridge & Wilks. Johnson Hancock charge 5d. Musical requirements.\n","67":" Approaching Spring. Bath &etc clothing stolen by Russian. trading clothing. 2-10th. Men returned under escort. 6 weeks bread & water. food smuggled. Sgt Gutteridge unsuccessful attempts to escape. 270 kilos & capture experience. Hun farmhouse recapture &etc. formidable Dutch frontier etc. cooks & exchange of canned food.\n\n11-17th. Literature. Church service & linguists. 18-28th. Bored. Russian . Lack of medicine. Sick men. food struggle &etc. Barracks .Sunday excitement. Vermin. Lunch &etc.","68":" Exchange party departure. Health uniform. concert . 2nd-10th. Anticipating repatriation. Double amputation. Bunter & Clarke. Straffe ordeal 48 hrs. Many large queues assembled in London to receive whatever food they could possibly get. During the struggle many people were injured. Those who managed to secure a bone thrown to them thro the bars of the window considered themselves very fortunate. The food controller in a speech stated that he could prolong the war to March if the strict economy was observed.\n","69":" Bridge. Monotony. Lcpl Hogan.","70":" Batt’n Aus. Russian deaths 35. English 2. Self imposed duties. Sacrifice for others &etc. Grave lack of food & 200 cases in camp. Russian monument. Hun outburst upon visiting Lazarette.","71":" Letter to Berne & London. bread parcels red cross benefit. disfigured photo. letters distorted. Hun censorship & unnecessary restrictions. New prisoners from Cambrai. Stettin Times & Berliner Tageblatt smuggled into camp. Mail destroyed. . Newspapers suppressed. 7.30 orders. Unreasonable orderlies. Sick & others forcibly paraded. 250 men in strafe 4 days bread & water. \n\n16-20th. Parcels ceased. Mark decreases. Parcel contribution at Limburg. Decomposed fish soups. Round the fences on Sundays. 5-7pm in the centre of camp awful spectacles. \"Here lies the body of a good worker\" – grave stone. Russian ordeals. . My wounds inflamed. 21-24. Usual ordeal.","72":" Arrest of interpreter.","73":" High tempt","74":" Sick parade ordered hospital. Schutzen Haus. 10 Russians & 2 English in room. Washed in tub after 5 filthy Russians. Hun rations again.","75":" 10am Hun surgeon’s visit & Russian. M.O.","76":" Operation without anaesthetic. Stretcher. 28-29th. Wound discharging freely. Weather nice, books & garden. No food. factory girls.","77":" Englishman murdered. Lack of nourishment.","78":" Usual ordeal..","79":" Sugar, soap & candles discovered here. Potatoes in cellar. \n","80":" Russian artfulness. Hun wrath. Amusing anecdotes. . Relief fund issue. 6 men to 1 egg. 15 men to 1 pkt chocolate. Ludicrous. 2-15th. Food parcel.","81":" Gardening . Stolen potatoes. Chemical fabrics accident serious cases. fires etc. Mania, starvation, cruelty etc on Commandos. Sunday foot traffic. Military traffic. Confirm iron substitute for rubber. Zeppelins on the","82":" People who converse. Postern. Children home &etc. 16-24 No parcels.","83":" Hun thunderstorm. Retaliation. Leceister Reg’t amputation caused by brutal treatment. 1914 Students. Russian exchanged.","84":" arrival Portugese Cartoon. Hatred booklet.","85":" My exit. Schwisse. 26-28th In readiness for departure.","86":" arrival Altdamm Camp. Johnson & Wilks eligible for exchange.","87":" Parcels arriving. Much Hun excitement. Numerous orders regarding exchange. \n","88":" Departure. Inspections etc. various experiences en route to Aachen. Co’pl at Altdamm Station. Berlin – Essen. Hanover. & - Aachen 2 – travelling.","89":" 8am Aachen. 2-4pm exercise. 5-8th Awaiting exchange. various characters & Posterns etc. departure for Holland on","90":"\n\n"}}