{"Document Name":{"0":"Diary_0003","1":"Diary_0003","2":"Diary_0003","3":"Diary_0003","4":"Diary_0003","5":"Diary_0003","6":"Diary_0003","7":"Diary_0003","8":"Diary_0003","9":"Diary_0003","10":"Diary_0003","11":"Diary_0003","12":"Diary_0003","13":"Diary_0003","14":"Diary_0003","15":"Diary_0003","16":"Diary_0003","17":"Diary_0003"},"Date":{"0":"unknown","1":1345.0,"2":1352.0,"3":1353.0,"4":1354.0,"5":1355.0,"6":1370.0,"7":1371.0,"8":1372.0,"9":1375.0,"10":1376.0,"11":1377.0,"12":1378.0,"13":1380.0,"14":1381.0,"15":1382.0,"16":1383.0,"17":1427.0},"Entry":{"0":"\n\nWeather moderate.\n\nAustraliansSent below deck,had to put on life-belts. Allowed calicoon deck with these. Reached France after dusk had set in. Sent to No 2 Camp for night. Served with breakfast, Jam and tea, issued with 2 blankets.\n\n","1":"\nArose abt 5\/15 instead of 6 AM. Breakfast sausages & tea with bread. Set off at 8 for Railway Station.\n\nAt bus. Caught 9\/46 trn from E Croydon to Victoria Station and after getting my pack fixed got to bed at War Chest. Planes overhead, Whistles blowing, Cries of take Cover, Guns being fired. Woke by Orderly at 5. Had breakfast and then set out for Victoria Stn. Left about ¼ to 8. Arrived at Dover. Shave by girl. Had tea and cakes. Dover a very old town surrounded by cliffs. Boarded boats for France. and left English Shores in mistescorted by destroyer.\n\nleash and had finally to prize Jocks jaws open with a whip before he would let go. Then into a butchers shopand Jock seeing another dog with a bone thought he would have it and went after him. I picked it up and took it back to the Butchers. Mrs Blechfordis to knit a comforter which she will send me over. Mr Philpott put up a nice lunch in case of hunger whilst on the train journey,said goodbye and left Mr & Mrs\n\nwent into front room,we sang hymns with them. Mr C. had been a guard on the Railways for 20 yrs. Got home safely to Croydon that night.\n","2":"\nLast day of leave. Put in most of it writing letters but took Jock for a walk in the lovely morning air. Jock whilst I bought sugar got into holtswith another dog and we had to put one dog outside and shut the door. Even when they met outside they sprang at one another broke\n\n\n\nmonument. Inspected Tower,passing Billingsgate Fish Markets into St Pauls Church.\n\n(30th)\nService held in Cathedralat 4, sawflags of different regiments around the walls. Flocks of pigeons outside the entrance. Pigeons I am told are protected by Act of Parliament. Saw Amen Corner and Paternoster Rowfrom top of bus on which we rodethrough the streets. Headed north and arrived at Hornsey. Met Mrs C,had tea and after went\n\nWe sang many well known hymns. To bed.\n\n29th\nGot up at 9\/30. Had breakfast went for a walk with Jock the dog. Lost him, had dinner . \"Jock\" turns up. Was introduced to Miss Ridge dressmaker. Proofs of photo not up to expectations.\n\n30th\n@ 2\/45 met Mrs Chapman at London & Brighton Rly Stn. In the train met a Mr Fyfe who is willing to accomodate boys on leave. Mrs C & I walked across the London Bridge and past the\n\n\n\nReached Mrs Philpotts place about 10\/30 AM. Went to Church with Mrs Blechyrider- Mother of Mr Ps wife. Congregational Service. After After dinner was introduced to Mr Steed and his wife. Went for walk with Mr P & Mr S,asked concerning the war. Whilst out saw many aeroplanes circling about. Had tea and went to Church at 5\/30. On returning went up to drawing room and Mrs P. after a time played the piano.\n\n1 train to the other.\n\nFred took me to make the acquaintance of Mrs Chapman. Have to meet Mrs Chapman on London Bridge, London Brighton Railway under the clock at 2\/30 on Tuesday Bought sugar & tea in Grocery Storefor Fred Higgins, landlady was introduced to Mrs Chapman & daughter. Sang hymns and parted that night Saturday. I slept with Fred in a \"¾\" Bed, leaving next morning (28th) to return to Croydon\n\nnight I started for South Croydonwhere I was to stay at Mrs Philpotts place.\n\n(25th)\nAm stopping at Mr Philpotts place No place could be better. They have received me as one of themselves. Went to London to get my change of clothes. and souvenirs for Higgins.\n\nre\n hot water bottle in bed\n\nMr Philpott took me to Recreation Club.\n\n(26th)\nWent to Hendonwhere I met Fred Higgins. Great deal of changing from\n\nwith him the following day and caught the 1\/17 train to London,Trainfare costing 24\/- per journey. On arrival went to Aldwych Hut,had tea and also booked bed for night. Also wrote a further letter to Mum telling her of my experiences with Bert.\n\nNext day (23rd) went to visit Mrs Thompson at Wandsworth. Spent a very pleasant day there and promised to call back at some future period. That\n\n2 positions taken. Wrote long letter to Mum from Anzac Buffet,a place run by Australian ladies. Went to Theatre thatevening, the play was called Damaged Goods,not being more that a lecture.At Anzac Buffet we had meals servedfor nothing. Went to Codford to see Bert who is \"H\/O\" in hut at Codford Camp.Slept there that night.Had breakfast and went\n\nsame after waiting.Marched to quarters below deck. Arrived at Folkestone, got train and eventually arrived at London. Met Geo Learyon the Station. He is on the staff at Horseferry Road Headquarters.\n\nReported with other leave men to HQ and talked at the entrance to Harry Gray. Had tea and booked bed at the War Chest Club\n\n(22)\nBoots cleaned,breakfast and shave afterward went and had photograph\n","3":"\nLeavestarted today - Left for Poperinghe Station and caught train for Boulogne at 11\/10. Landed there at about 7\/30. We were provided with tea and bread and butter. The walk up the hill was very tiring - quite 2 miles. Tent was filled with Jock's who proved kind. We were told by authorities in this camp that we were likely to lose our leave if we came away with any souvenirsof an explosive nature. Marched away to boat and boarded\n\nand a bit of stew,nice and warm. Later had a hunt for hessian as the Sergt said we were allowed lights till 9 p.m. if the windows were covered. We found some so all will be OK. Tonight I may write more letters.\n\n(17th)\nWent to Zonnebeke (Fatigues). Heavy Shelling Next day,\n\n(18th)\nOn a\/c of getting dirt in eye was left behind to letA.M.C.\n\n(19)\nHeard word that leave was coming. Went work.\n\n20th","4":" party. Ballast had arrived and we were put to work in unloading\n","5":"\nMore instruction in Lewis Guns. More reinforcements arrive, CSM Coughlam, Giles and other old hands. Night a very cold one,winter is pretty well on us again.\n","6":"\nIn the morning I washed a towel out and it was long before my hands had regained and feeling.\n\n(16th)\nFrost is appearing on the bushes. Early Breakfast at about 0845. Marched out to a place about 2 miles away. Boarded motors and after a round about trip arrived at --. After settling down we started to forage for \"tucker\". I was successful as I securedtea, 4 tins BB \n\na very noticeable thing that the services were always well patronised by Australians but the Scotch would not attend. He was a Scottish Minister himself. Nearby was a Military Cemeteryand Canadian C.S. Many new graves. A noticeable feature was the graves of the airmen who had been Killed in Action. Each of the graves surmounted by a plane propellor with the blades sawn off. Met Frank Gatesagain He is well. We invited him to tea.\n\n15th\nMore instruction\n\nin it. Mud very bad.Troops arrived at 2AM in a very draggled and wet state.Relieved at 9pm.\n\n10th\nSlept until 10 AM. Breakfasted and moved out in Motor Buses to camp outside Poperinghe (10th), Warnedfor Guard.\n\n11th\nMess Orderly and farmhand guard.\n\n12th\nReveille 7. Breakfast 8. Coy Route March at 9. After wrote\"Whizz Bangs\". Foodvery good, also plentiful.\n\n13th\nLewis Gun Section. In the afternoon attended service held at 3 PM. In the afternoon the minister remarked it was\n\n5\/10\/17\nClerical work\n","7":"\nClerical work. \"Hopover\"a great success. Casualties not heavy (7). Left Caestre at 10 o.clock and entrained to --. Marched out to Battn that night. Had a wait of 2 hours in the \ntrain\n rain for train. Met \"Bob\" Solomons. 2nd Battn. just arrived with reinforcements.\n\n8th\nFinished up clerical work. Left H.F. corner for Ottawa Camp with Captain Elliott. Arriving mindedMajor's horse, assisted with valises. Swept outhuts to be occupied by Battn. Rained very heavily at night. Was put on to unloading Packs\n\n29\nRev. 6\/15. M.O. again. Battn \"stunt\"went off with a swing,early finish to parade. Wrote more letters. YMCA - Evening.\n\n30th\n1 of party detailed to stop oneof the line this time.Have been made clerk for the time being. Left for Caestre 9.45 a.m. Hard at work ever since 2\/10\/15. Day fine. Reveille 2 o'clock.\n\n2\/10\/17.\nNot so much to do. In the night rain fell.\n\n3\/10\/17.\ndo. .Day overcast. Clerical work. Getting more in touch with work.\n\n4\/10\/17\nClerical work inCamp.\n\nsome in the parade that followed at 8. I was told off to get my boots repaired. Whilst away word was brought back that I was wanted for departurewhen leave became due. Wrote letters to Mr Grace, Mr Philpott, \"Pup\" & Mum. After dinnertime had a bayonet practice for an hour and dismissed.In the evening attended a","8":" Battn Concert conducted by Major Mackenzie. I sang \"Asleep in the deep\",later went into the YMCA (and joining with others at piano in song for a couple of hour,s Choruses. Perfect night, asleep 9\/15.\n\n\n\nCake in parcel spoiled. Was put on fire picket3 hours & finish at 6 oclock in the morn.\n","9":"\nExchange Tunic. Sewed on colours wrong side up. Weather Beautiful. In the afternoon, after tea, we were ordered to go to Billets get equipment and move to an open paddock. Hot overnight,tarpaulins to go round.We secured a supply of blankets per the O'Cs order and knotted them together swinging the whole lot over the wire. Later on and on the way back secured straw for bed.\n\n(28)\nMorning very cold The 6 womenbring round coffee We all had\n\nhad either been left out, or had arrived back from hospital awaiting us. Went to Steenwerck in afternoon and had haircut & Shave. Man cut hair, his daughter shaved. Washed outside in drain.\n\n(28)\nHad another argument with C.H. Davis,left him and camehome on my own. Bought tomatoes 1 fr. per lb. Whilst in Steenwerck we had Eggs (2) and custard at 1\/9 each.\n\n(26th)\nDrill in morning (smartening up), form for usand saluting \"no bon\". HD got 2 parcels from England\n\nup all old piecesthat some one had left on the ground. Here we are at Ottawa Camp a beautiful day too.Washing on the line. Yesterday the Brigadier met us on the road and greeted us with the words, \"Well boys you will have a long march, 25 miles and more and in the line in 2 days.We marched out of Ottawa Camp and boarded Motor Buses for Billets outside Steenwerck. On arrival found others who\n\n\n\nto relieve us. We got away alright and after a very dark journey reached Halfway House,we got cocoa and biscuits from the YMCA and retired.\n\n(24)\nWe were ordered to leave Halfway house for DickebuschCamp. Put in the day washing clothes and shaving In the evening we had a Service and finished it in the dark.\n\n28th\nLeft DickebuschCamp for Ottawa Camp at 9.Had to put my washing inthe pack. Lost 1 putty and had to pack\n\nWe were ordered to advance in the midst of it and take over the front line trenches. One shell just landed on top of parapet by me. R Baldwin wounded in the leg. After some trouble in findingthe front line we were safely ensconced there on observation duty. It was very quiet whilst there.\n\n(22nd)\nThe day after had 3 hours sleep but was awakened andtold to report to Coy HQ as guide for the\"Tommies\" who were going\n\nin 18th Battn Camp for Arch, was told he went to hospital.Later received a letter. He is suffering from P.U.O.\n\n19.9.17.\nReached trenches, night very dark. We stopped for a short time. Then went forward to other trenches. The weather right on to 21.9.17perfect.Big advance made, our own advance was perfectly successful. We gained all objectives. Very fierce bombardment. \"Fritz\" has made it very willingwith 5.9.In Clapham JunctionTrench we were subjected to a very fierce bombardment.\n\nEquipment &c dropped in CHD, got tin hat our, case of monkey and chestnuts. C.H.D. calls in to stor water up. I do so (mem not to lose temper). Left Meteren for Ottawa Camp @ 1, arrived 6\/30. Stoodl march well.\n\n15\/9\/17\nReveille at 7. Breakfast 7\/30. Recd 4 letters during inspection. Lost CHD - went to another job. Rest of day free.\n\n16\/9\/17.\nRev. 5\/30, Bfast 6. Left Ottawa Camp @ --. Very heavy bombardment proceeding, reached Dickebusch, very easy time. Had a look\n\nto attend service was refused: took it to heart for this time.\n","10":"\nRev. 5, Breakfast 5\/30. Started to march out 7\/30 to Meteren, arrived at 10\/30. March not a hard one. We dismissed and looked round town, shops and church. Then YMCA tea and biscuits. Wrote letters after tea. Went and listened to Band, but later to YM and had sing and service. Bed well to sleep in.\n\nin the evening when rest of Battn was on march we were able to go round YMCA tents and have discussion on the life we lead.\n\n12\/9\/17.\nDrill - Bayonet - fighting and musketry. Beautiful day, swimming. Parade after dinner. Those who did not enter water were formed up and made to come home by the long route.\n\n12\/9\/17\nOrders given \"no man to leave Coy area\". I asked permission of OC\n\nread and spoke on John 11. After we went and practised hymns in the fields. Service in night time in tent, Sgt Dave Scott & T. Retmock with others. Met Billy Ross from Waverley. Have arranged to hold meetings Tuesdays and Fridays in tents.\n\n10\/9\/17.\nCool morning, Hotter later. 'Jims' Birthday, must write. Brigade stuck outside Vieux Berquin. Guard tonight.\n\n11\/9\/17.\n​On Guard 3 prisoners. Talked with Liddell on \n\npray earnestly.\n\n8\/9\/17\nFarming in morning, pulling beans, another good and hearty talk with D. Holiday. Had bath washed towel and shirt.\n\n8\/9\/17.\nAttended YMCA in night. Deg. received permission for use of tent to conduct services in afternoon.\n\n9.9.17.\nService in the open fields. Text Joshua 3.5. Beautiful day. Afternoon attended Y.M.C.A. Held service in afternoon at 3 with Degoland. He\n\nMajor MacKenzie addressed a large number of us whilst seated outside the tent.\n\n6\/9\/17\nFarming - Haymaking. Pulling beans, felt very tired as day was xceptionally hot and muggy one.\n\n7\/9\/17.\nFarming pullings beans. Weather still muggy, plenty coffee. Previous evening went to YM.C.A. and saw Degoland who loaned me book, How to win souls for Christ. Davis and I whilst farming have xchanged some beautiful thoughts and wishes\n\nBatch .\n\nDid not go out, fixed up rifle. Read N.T. Jno. 10-18 Chapters. Arranged to go on Thursday for a service to the Loban Corps (Tommies), Padre in aeroplane, Fritz about. Attendance.\n\n3\/9\/17.\n still cutting branches. Most perfect day so far experienced by me in France as regards weather Wrote letters.\n","11":"\nFarming pulling beans &c. Nice weather.\n","12":"\nFarming. Meeting at night.\n","13":"\nWeeding with hoe. Pay day. Tomatoes Bread Biscuits Butter Toffee. Poor old woman.\n","14":"\nHarvesting.\n\n26\/8\/17.\nChurch parade, swim. Afternoon YMCA. Read and write. Service in tent at night.\n\n27\/8\/17.\nFarming postponed on a\/c of wet weather. Afternoon cleaned equipment for inspection by Gen Plummer tomorrow.\n\n28\/8\/17.\nMarch past, Gen. Plummer, afternoon rest, canteen, Golden Syrup cakes 150\n\n12. YMCA attend service at night. 7 AM Card by Mr Davies. More planes. No bombs thrown, kept from coming too close by aircraft guns.\n\n20\/8\/17.\nRev. 6 AM. Drill at 8 am. Lecture M.G.\n\n21\/8\/17\nMap Reading. A'plane Equipment.Night YMCA. W. Retmock, cricket Ball.\n\n22\/8\/17\nInspection by Genl. Birdwood. Complimented on our marching,½ holiday. Weather bright & hot. Y.M.C.A. Meeting night.\n\n23\/8\/17.\nHarvesting. Beer & Tea. Tea all drink preference to beer.\n\nare just waiting dinner. Re the Crew and self, Best meal in the army. Re Beef Cauliflower Potatoes Apricots and custard. Afterwards a walk to Vieux Berquin. Visited church most beautiful place. Shell had penetrated wall. Built in 1902 -1905. Went to YMCA. Spoke to Mr Richardson. Back in very quick march to Sec Bois, 3 miles. Bombs from plane. YMCA.\n","15":"\nChurch parade. Cas. 70 & no killed, dinner at\n\nstood for about ½ hour watching us, chewed biscuits. Gave him souvenir ½d. - 1st smile.\n\n18\/8\/17.\n3rd Anniversary of formation of 3rd Battn. Reveille 7.A.M. Beautiful day. Marched to 'C' Company parade ground. Padre spoke shortly and fittingly. Sang Hymn & psalm 100, Read Psalm 93, Prayers. Colonel spoke (shortly). Said we should have had beer in addn to food but QM laid all the money out. Good for him.\n\n\n\nMy mate CHD chosen to pluck weeds up, help the families.\n\n16\/8\/17.\nRoute March. Full pack 15 miles in all. Went to Y.M.C.A in night.\n\n17.8.17\n9 to 10 AM. Fixed seams of trousers to kill \"chats\" & eggs. Gas drill. Bomb throwing afterwards. Gas Lecture at C Coys billet. Band in attendance, then dismissed for day. After tea, Roll call 6 p.m. Went to YMCA. Bought cake on way, bread and to have, being short. Hired book for Franc L Beake, author. Little French lad\n","16":"\nBerquin area - Route March. Drill order, Stiff. Was put on guard duty. Visited Hazebrouck: inspected Church. Borre yesterday, attended Catholic Service in church at night. Evening Service in school. Prisoner drinking wine, puts the bottle to his lips to drink when wasp that had found its way in stings him on the lips. \"Theres always a sting in it says I\".\n","17":"\nRoute March, Drill order - For Guard today. Half Holiday (French Holy day).\n\n"}}