{"Document Name":{"0":"Diary_0021","1":"Diary_0021","2":"Diary_0021","3":"Diary_0021","4":"Diary_0021","5":"Diary_0021","6":"Diary_0021","7":"Diary_0021","8":"Diary_0021","9":"Diary_0021","10":"Diary_0021","11":"Diary_0021","12":"Diary_0021","13":"Diary_0021","14":"Diary_0021","15":"Diary_0021","16":"Diary_0021","17":"Diary_0021","18":"Diary_0021","19":"Diary_0021","20":"Diary_0021","21":"Diary_0021","22":"Diary_0021","23":"Diary_0021","24":"Diary_0021","25":"Diary_0021","26":"Diary_0021","27":"Diary_0021","28":"Diary_0021","29":"Diary_0021","30":"Diary_0021","31":"Diary_0021","32":"Diary_0021","33":"Diary_0021","34":"Diary_0021","35":"Diary_0021","36":"Diary_0021","37":"Diary_0021","38":"Diary_0021","39":"Diary_0021","40":"Diary_0021","41":"Diary_0021","42":"Diary_0021","43":"Diary_0021","44":"Diary_0021","45":"Diary_0021","46":"Diary_0021","47":"Diary_0021","48":"Diary_0021","49":"Diary_0021","50":"Diary_0021","51":"Diary_0021","52":"Diary_0021","53":"Diary_0021","54":"Diary_0021","55":"Diary_0021","56":"Diary_0021","57":"Diary_0021","58":"Diary_0021","59":"Diary_0021","60":"Diary_0021","61":"Diary_0021","62":"Diary_0021","63":"Diary_0021","64":"Diary_0021","65":"Diary_0021"},"Date":{"0":"unknown","1":1118.0,"2":1119.0,"3":1120.0,"4":1121.0,"5":1122.0,"6":1123.0,"7":1124.0,"8":1125.0,"9":1126.0,"10":1127.0,"11":1128.0,"12":1129.0,"13":1130.0,"14":1131.0,"15":1132.0,"16":1133.0,"17":1134.0,"18":1135.0,"19":1136.0,"20":1137.0,"21":1138.0,"22":1139.0,"23":1140.0,"24":1141.0,"25":1142.0,"26":1143.0,"27":1144.0,"28":1145.0,"29":1146.0,"30":1147.0,"31":1148.0,"32":1149.0,"33":1150.0,"34":1151.0,"35":1152.0,"36":1153.0,"37":1154.0,"38":1156.0,"39":1157.0,"40":1158.0,"41":1159.0,"42":1160.0,"43":1162.0,"44":1163.0,"45":1164.0,"46":1165.0,"47":1166.0,"48":1167.0,"49":1168.0,"50":1169.0,"51":1170.0,"52":1171.0,"53":1172.0,"54":1173.0,"55":1174.0,"56":1178.0,"57":1179.0,"58":1180.0,"59":1181.0,"60":1182.0,"61":1183.0,"62":1184.0,"63":1185.0,"64":1186.0,"65":1203.0},"Entry":{"0":"\n\n","1":"\n\nLast night we changed over & relieved a portion the 17th Battalion who were on our right this made our frontage a fairly long one but it also gave us a little better trench though in places it was dreadful especially our bombing posts which were out in front of us in an old shell hole over the boys knees in mud & water, it is difficult to imagine more dreadful weather than that in which we have settled down for the winter campaign, often we are knee deep in water with howling winds & gusts of rain, when the wind drops a whitish fog creeps out of the\n\nground forming a horrible coverlet of moisture upon everything, rifles are too clammy to touch, the enemy is invisible as a rule through the clouds of vapour, but he is unlikely to attack while the battlefield is a quagmire, a bayonet charge would be clogged after the first jump to the parapets, it would be almost an impossibility to bring up artillery, so you may guess it will be stick in the mud warfare for some time yet but it is far from restful for shrapnel is mixed plentifully with the raindrops.\n\nWe put in another very cold night in fact we nearly perished for everything we had on was wet through & I can tell you no one was more glad than myself when daylight came & with it some hot tea.\n\nWe have 4 cases of \"trench feet\" this morning in spite of all our precautions they are sending them out straight away to be attended to. I just about missed it myself for my feet are very sore this morning.\n\nOne of A Coy.s Sergeants was killed up here the other day & they buried him, & now they have to take him up again & bury him down by Bde. Hqrs we have a small cemetery there. Shortly after breakfast this morning I took my platoon out of the line for they were about done, we had about the worst time of the lot. I had to bring them back to our old joint \"Pilgrims trench\" & Mr Edgeley gave me a note to give to A Coy. officer asking him to clear a couple of dugouts for the men so as they could have a sleep\n\n& recover their strength, so I fixed them up & they had a good camp for a few hours which done them the world of good, about 2 oclock an order came round from the Adjutant wanting to know how many men there were available for fatigue in 11 & 12 platoons, Len & I sent the number back & had to warn all our men for the job which was coming off. I took the party down to Bde Hqrs 22 in all, we had about a mile & a half to walk & it’s a wonder some of us were not skittled for old Fritz was dosing the track pretty liberally with heavy shrapnel & high explosive & we had to go right through this small barrage. one shell burst directly behind us & shrapnel flew all around us one pellet went through my tunic\n\njust missing my ribs this shell killed 2 men & wounded 3 more a few yards from me but strange to say none of my party were hit, we lost no time in reaching the dump I can tell you for we were pretty safe once there although he continued to sling the shells over, one big shell this afternoon landed fair in a party of 10 & killed 9 outright & badly wounded the other one pretty hot you know, our job was carrying duck boards up to \"Cocoa\" trench & they were fairly heavy, after getting our first load up we had to go back to Flers tramway for another load of rivetting material by this time it was quite dark, & I had to guide our party back. Now this might seem an easy job, but believe me it was just the reverse\n\nfor the country round about here is as level as a billiard table & there is nothing to distinguish your direction by for it is all alike & you can easily be walking in a circle, as other parties have done before today but my bush training stuck to me & I came out as straight as an arrow, by this time the whole party were completely knocked up for it was pretty stiff work & we had just come out of the firing line, & their feet were all swollen & painful, it was a shame to send them out at all, but then you know the old military style. Shortly after this the remainder of the Coy. came in from the firing line & we had tea & went to bed, after oiling & washing our feet in Condy’s. \n\nThere was also a very welcome mail came in tonight.\n","2":" Rained heavily last night & made things rotten again. \n\nHow lucky am I; the post I was occupying the other night got blown in & 1 man was killed & 6 wounded that enfilading gun got them, I knew she was dangerous that portion of the trench & I was glad to get out of it. We have got a character of an officer at present. Page is his name how on earth he came to get a commission is beyond me for he is perfectly useless the other morning just as we were leaving the trenches, his batman wanted to get up & get a pair of dry gum boots, for his own were all wet so not wishing to put his wet ones on to go & get the dry boots he tells this Page about it. Page then sings out to me; Sergeant go & get Hunt (his batman) a\n\ndry pair of boots. Well this fairly staggered me, go & get a batman to me the most hateful of all men in the Army with the exception of the Military police, dry boots, no, not if I was to be clinked for it, so I said to Page, let Hunt get his own boots for I’m certain I’ll not get them. well he said get one of your men to go & get them, this is nearly as bad as myself getting them so I said, none of my men are here, look here Sergt he said it is an order, once he started to come on the bounce I was more determined than ever that neither I nor any of my men would get his boots. Mr Broughton a very fine little officer then chipped in, Hunt he said, go out & get your own boots you ought to be ashamed of yourself, these men have been on duty all night, while\n\nyou have been skulking in the dugout, & you Page hop out you have been in there long enough, come & do your turn in the trench, however the end of it was that Hunt had to get his own boots & they both got kicked out of the dugout\n\nOur Brigade have had their gold A.s. some time, though I have not been issued with mine yet. we are the only troops who have them so far, & this has caused a certain amount of jealousy on the part of some Batts. This afternoon Len had as close a shave as any man wants he & a few more were lying in their dugout with just an old waterproof for cover from rain, shrapnel & etc when a piece of shell crashed right through just grazing his head & shoulders & stuck into the side of his\n\ndugout a few more inches & it would have knocked his head & shoulders right off, the piece of steel would be about 8 in long 4 in. wide & an inch & a half in thickness so you can imagine with what force it would strike. The old hands of the Battalion reckon that Len & I both have charmed lives, & I am beginning to think so myself, its just wonderful the narrow shaves we have had & not been touched so far, but I had better \"touch wood\" for it does not do to skite.\n\nThere is an air raid on tonight I can hear the hum of the planes quite distinctly & the Germans are shooting away at them like mad for it has taken up tonight & the moon is shining brilliantly, & there is\n\nnot a cloud to be seen. \n\nThis evening one of our two fatigue parties brought a dead chap down with them he belongs to our Batt. but no one seems to know who he is, he has no identification disc or pay book or anything they can recognize him by, they found him in a shell hole by the \"Chalk pits\". Got a Sudan stamp this evening from Bellchambers he has a brother at Khartoum in the Camel Corps. \n","3":" Gee whiz but we got some shells last night, they shelled our sunken road all night long, & it is crammed full of shallow dugouts, the fun started about 8 o’clock & from then on till day break he rocked them in a treat, we could get no sleep at all for the noise of the bursting shells was terrific & the concussion kept on knocking the earth down on us, besides you\n\nnever knew which minute would be your last, things got that bad at one stage of the game that Bellchambers & I were preparing to evacuate our sweet little home for old Fritz evidently thought we were persons of note & was paying us particular attention, not that we object to being flattered, oh no, but when it comes from German shells well we simply won’t have it.\n\nBell & I kept on saying; if he lands another one as close as that out we go bang down would come another one, & I would reach for my boots, hold on, Bell would say this might be his last, & we would both lay down again but not forgetting to keep our ears open as if that would save us, in a few sec’s we would hear a far away report or perhaps half a\n\ndozen, then the next thing would be the ominous screeching & wailing of the flying shell. we would hold our breaths, for the next sec. or so is a very critical one for you don’t know where it is going to land, at last a terrific & nerve shattering bang\", or perhaps a succession of them & a blinding flash of bright & fiery red, a hot sulphurous smell & the suspense is over, sometimes you are surprised to find you are still alive, when all the clods, muck & etc have finished falling, Bell & I both sit up, & curse the whole German Army & everything connected with the war & especially the Kaiser & the gunners who are shooting at us, of course every one thinks that he himself is the man all the guns are trained on, when we have used all the words we can\n\nthink of, Bell says to me, \"I’m off this is getting too warm, he will land the next one on us then it is my turn to throw cold water on his proposal, whats the good of us getting out we are just as safe in here, lets wait a while he might ease down I say, right oh Bell says but I don’t like our chance, & so it went on all the night, but we never shifted from our little dugout, which by the by started to leak like \"old Harry\" from the concussion, & every now & again we would be refreshed by a few drops of dirty water falling in your eye or on your face, & then the chats would get going, & we daren’t light a candle & start strafing them for the Huns would see our light & then we would draw the fire properly, oh yes, we had a nice night.\n\nTo make things better about 9 oclock after we had finished all our work the boys were told they were free for the rest of the night, the Sergt Major comes round with an \"order\" from Hqrs to find all the men he can & get them on carrying iron rations (biscuits & bully) to the Chalk pits Now here was a bit of delightful news for the Sergts to take round to their men, & when they were told of their little job, they swore loudly & long & what they wouldn’t do to the man who was responsible for this cursed job, if they could only lay their hands, I dont know Bill & I were both supposed to go with this party, but we detailed Lance Corporals in our places & after the men had moved off, we went back to bed. So much for being a Sergeant, but it was a lucky thing for some of the\n\n \n\nmen that they were away, for 2 of their dugouts were blown in while they were away, & to show how hard to please some men are these men whose dugouts were blown in swore like troopers when they saw their ruined home, never thinking their lives had been saved by them being on fatigues but the dugout Len & a few more were occupying was the lucky one 2 big shells landed within 5 yards of it both went off & tore great holes in the ground, & never hurt none of them, only knocked a sandbag on Lens head, & half dazed the lot of them by the concussion, its a mystery to me how they were not killed by concussion, for it generally settles one when they burst as close as that to you, but there you are luck again out of all the hundreds of shells he \n\nshot at us, they only scored 3 hits & none of them are dangerous.\n\nLast night an \"order\" came through Hqrs for one of our chaps named Ross to pack up & proceed to Australia, it appears that he has had 2 brothers killed in this war & since he has been away his father has died, & now he is the sole support of his mother. Ross himself has been wounded 3 times already so he has done his bit he came away with the original 1st Div, his mother was the means of getting him out of it, when we heard he was going to Australia we all said \"lucky dog\".\n\nToday is fairly fine & cold & old Fritz has a couple of balloons up so we are expecting some shooting & as the trench we are camped in can be easily enfiladed & is very dangerous\n\nwe have \"orders\" to remain in our dugouts as much as possible for the rest of the day, so that accounts for me writing at such length. I have nothing to do & I can’t sleep so I might as well put the time in writing.\n\nLast night 2 German runners lost themselves & walked into B. Coys trench they had been sent round it appears to find out how many men had been recommended for the Iron Cross in their regiment & got lost on their way a very easy thing to do, both these runners wore the Iron Cross.\"\n\nThere is a most tremendous amount of Tasmanian jam being used in France now, where ever you go you will see it & it is of a very fine quality too.\n\nHave almost recovered my voice I haven’t been able to speak above a whisper\n\n \n\nfor some considerable time.\n","4":" Last night we moved from the support trenches at Pilgrim’s way & made for the firing line to do our two days in misery, we were lucky again for we got through the barrage which Fritz puts down the little valley opposite Guedecourt of a night time for he knows that all relieving troops go up this gully, we kept well up towards Guedecourt & so missed nearly all the shelling, there is one very dangerous place the Chalk pits & round here there has been a lot of casualties. the fatigue party following us ran into a big shell or two & got smashed about. Tommy Bradshaw & a few more were killed. However we reached the firing line safely & the first thing that met our eyes were a couple of dead men on\n\nstretchers, & a portion of the trench smashed to pieces. it appears that late in the afternoon one of our Stokes mortars opened on the Huns & the barrel was that dirty that every time she fired a stream of sparks 20 ft long flew out of her & the Germans picked her up at once & dropped some of their \"pineapple\" bombs fair in our trench causing a big mess and a few casualties, as soon as A. Coy. had got out we set to work & repaired the broken trench we worked on it till nearly 1 oclock & the work proved a blessing in disguise for it was a freezing night & snowing lightly so the work kept us fairly warm During the night the men oiled their feet 3 times, they reckon it keeps them warm. Personally I don’t like this whale oil for it makes your\n\nfeet so soft for marching & blocks up the pores preventing the sweat from coming out, though I need scarcely say that we are troubled very little with sweat lately, but I must admit that the whale oil is good.\n\nBy Jove I was glad when morning came I was that cold that I could scarcely talk. everything I had on was sopping wet & my dugout which was occupied by 4 of us was more like a pond than anything else I could compare it too, & my feet were as cold as cold could be. Heavens how we suffer with our feet they are almost dead for half the night & give us About 6.30 our rations & breakfast came up hot stew & tea & best of all a pair of dry socks for each man. We get these every morning & they are a God send\n\nNothing much happened during the day with the exception of the usual shelling & a fair dose of mortars but he done no damage worth mentioning. This afternoon Len went out of the firing line his heel is very bad again & looks like turning septic how lucky is he, missing tonights perish\n","5":" What a night we had one of the most miserable as ever I put in, in my life & I shall never forget it as long as I live, & to make matters worse for me I had to take a patrol out & find out what I could of the Germans movements. I went out at 9 oclock & took 2 of my best men with me, we carried 2 bombs each & nothing else. we sneaked out for nearly 200 yards and threaded our way amongst the German dead of which there were hundreds\n\nAfter getting sufficiently close to the Huns trenches I left the two men in a shell hole with instructions to be ready to assist me in case I was attacked & should have to fall back on them. I then crawled forward on my stomach laying very quiet & low when the flares went up for if I was discovered at this stage it would be all up for the machine guns would riddle one with lead I was crawling forward slowly keeping both ears & eyes well open when suddenly I stops dead for there not more than 40 yards away were 2 German sentries their heads just showing over the edge of a shell hole, but by good luck they did not notice me. I sneaked away to the right & from a nice little point got a fine view of the German lines. There were about 30 of them baling \n\nout one of their trenches, & I lay there for a fair time watching their movements at last I was rewarded for I saw 2 patrols sneak out from their trench & and make over to the 19th Bn. one of these had 5 men & the other 8, & I also located one of their machine guns & on the way back I discovered a new trench which the Germans were digging this was a nice little discovery & I was quite pleased with myself, shortly after this I picked up 2 men & we made our way back old Fritz saw us & turned his machine guns on us. you should have seen the way we threw ourselves down mud or no mud & his bullets whizzed over us harmlessly, when things quietened down a little off we started again but he was waiting for us & down we had to go again, this is no\n\ngood to us I thought, so I said to the chaps we will have to sneak back one at a time & I will start out first, so off I went just before I reached our trench I watched for the others to come up, & just as each man dropped into the trench a sniper had a shot at each of us, you would have laughed if you could have seen the dive that the last man made he fairly flew into the ditch.\n\n\"No mans land\" is covered with German dead they are laying all over the place & I cut a fine pair of wire cutters off one chap & also brought a rifle, bomb and gas helmet for curios. \n\nThe next thing I had to do was to report to Mr Edgeley, & then I had to write a \"report\" out on my night’s work & and it was sent down to Hqrs at once, the Capt reckoned I had done\n\n \n\na good night’s work & told me to turn in for the rest of the night, it was not much use turning in for my dugout was sopping wet & I was even in a worse state for I was covered from head to foot with mud & wet to the skin, but the boys had some nice hot cocoa waiting for me & this helped to thaw me, there is one thing we get now in the trenches & that is the little \"Tommy cookers\", they are made of paffarin & wax & are put up in little tins, they light instantly & produce no smoke, the \"Australian Comforts Funds\" send them to us.\n\nThis morning when I went round for the boys rum I drew a blank for the Q.M. sent a bottle of whale oil instead how they roared when I told them didn’t they perform, reckoned the heads had drunk it & etc\n\nA most peculiar thing happened this afternoon in full view of us all Lieut Rowbottom of D.Coy hopped out of the trench and deliberately walked towards the German trenches & they were only 80 yards apart, when he got half way over he stopped & picked up a German rifle, then the expected happened for a rifle crack rang out but he missed him & Rowbottom signalled a washout, then another crack & Rowbottom spun round like a top & collapsed, by this time nearly every man in the trenches was looking on, & the next thing we saw was 2 of our stretcher bearers hop out with a stretcher & 2 little white flags & go over towards Rowbottom, we all held our breaths for it was a very daring thing to do for you all know what a rotten name the Germans\n\nhave, but they never fired a shot at them, they picked up the body & brought him in, but he died just as they got him to the trench, this was the first time I have seen the white flag used in France but I believe the second time in Pozieres it was used frequently by both sides what on earth could have made him do such a mad act beats me, I think the cold must have affected him, or he done it for mere bravado however it cost him his life.\n","6":" Last night we were relieved by the 45th Bn & just before we filed out I had to take their patrol over to the trench on our left, & a nice job it was for I had no idea where it was & I had to find it as best I could. When I got back the Capt said to me Sergt. You will take charge of these men & take them to Bn. Hqrs & pick up\n\na guide there & you Mr Page will bring up the rear, the Capt said he could not trust Page with the men as he would very likely lose them, so off I started down \"Eve Alley\" & as true as I write this it was over our knees & in places nearly to our thighs with soft muddy slush what a mess we were in when we got to the end, & by the time we reached Bn Hqrs we well pretty well knocked out for everything we had was covered with mud & very heavy. From Bn Hqrs we had one of the most trying marches as I have ever tramped on, it was about 6 miles & if ever men were knocked out by the time we reached Bendigo \"Camp\" well we were, we all got into huts had a bit to eat & simply threw ourselves down & went to sleep tired right out Next morning we rose early & put \n\nour wet & sodden clothes on, had a scramble for breakfast & pushed off again we had not far to walk & we caught the train & got into open trucks which took us and the 12 th Bn. down to Meaulte. By Jove I was crook didn’t give a cuss what happened, we dumped our packs here & marched away to Ribemont & just about crawled into her dead beat, we reached our billets and turned in at once\n","7":" This morning we marched to Heilly & had a beautiful hot bath – what a relief it was to get our chatty clothes off & into new ones we felt like new men once more, the NCOs had a separate place set apart for them here we had our bath in big wooden tubs, & afterwards we all got a complete change of clothes socks underpants & shirts.\n\nAfter coming back we had to set to & clean all the mud off our dirty clothes and equipment & we also got our packs which enabled us to shave & kid \"we did not want it then in the afternoon we had a short parade more for inspection than for anything else.\n\nI am still feeling far from well & passed a most restless night. Brigade has just issued an order that we are to have 2 days rest but I’ll bet we get very little peace what with one thing & another\n\nWhile here we are running a \"Sergts Mess\" so we will fare very well for food & it will be very convenient Heavy bombardment all along the front we can hear quite plain from here the rumble of the \"heavies\"\n\nI wonder what it means\n","8":" Another inspection parade this morning & all overcoats had to be cleaned, it took me would you believe 3 hours to clean mine & even then it was in a dreadful state, but good enough for me yes \"we have some mud alright up here on the Somme.\" In fact I have been practically all day long cleaning up my belongings & even now they look dirty, such is a soldier’s life anyhow.\n\nI laid in bed this morning till just on 8 oclock for I felt far from well, Jack Price brought me up a nice plate of porridge & after eating this I felt much better, I don’t want to go to the Dr. just yet for various reasons, but if things don’t improve with me I shall have to go & pay him a visit. \n\nI am writing tonight in a nice comfortable room belonging to the French people where we are billeted, there is a nice fire going in the room & we have chairs lamps & a table & everything is nice & cosy outside it is cold & the hail is falling thick & heavy, & both combined makes one think of the poor devils in the trenches & also of our \nfair\n far away homes, where at this present time the sun is shining it is now about 8 oclock in the evening here & as there is nearly 10 hours difference in the time I guess the sun is shining alright, thats what we miss I think as much as anything the nice warm sun, we very seldom see it now & when we do it is very pale & sickly looking & not the slightest sign of heat in it \n\nThere is still very heavy artillery firing up the lines, & I hear tonight that our 4 th Div. captured 1100 prisoners the Guards are supporting them.\n\nThey are paying the boys tonight so I expect there will be plenty of drunks knocking about by bed time\n","9":" Early this morning the whole Coy. were called out on fatigue. I had 40 men & 4 NCOs in my party, our work was digging incinerators & building bunks in the billets.\n\nWe are living pretty high in the \"Mess\" roast beef & potatoes green peas & etc followed by a fruit pie or something similar & porridge & steak for breakfast & a good tea at night\n\nWe are losing Freddie Turner today & we are all sorry in one way\n\nfor he is such a good fellow, he is going to be R.Q. M.S. & Bellchambers is going to be the C.S.M.\n\nIt is snowing lightly this afternoon but not enough to make it lay.\n","10":" Was up last night till after 11 playing \"Bridge\" we put most of our spare time in playing this game it is very popular in the Army.\n\nNearly all the Coy. went out this morning to do some shooting on the range they had to take their watersheets with them for it was raining lightly, but they had to turn back before all the shooting was done.\n\nI also had a nice little job 4 Sergeants were sent from each Battalion down to the aerodrome to learn how to signal to aeroplanes when an attack is on, we left \n\n \n\nBde Hqrs in a motor lorry which took us to the sheds, here we hopped out & a Scottish flying officer took charge of us & took us among the planes, here he explained the working & etc of the flares lamps, & black & white boards & also how to send & receive, it was a most interesting lecture, the majority of the planes in this aerodrome are monoplanes of the Morane type & are French built \n\nAfter we had finished most of the boys cleared out & went into La Houssaye, I nearly missed the car myself, just caught it in time, we then went into \"Pont Novelle\" & had some dinner in a little café there, left this place again about 1 oclock & had a fairly fast run home\n\nWe are all troubled very much lately by diarohhea nearly every one in the Battalion is suffering more or less with it, & we are beginning to look crook on it.\n\nThis morning the Capt. Came round with the owner of this billet, & the old swine went crook because the boys pulled some of his hay out to lie on, if the Germans were here what would they do with it. He valued the hay used at 60 francs & it is not worth more than 10 I’ll bet\n\nThe Innskillens & KO.S.B,s marched through here tonight.\n","11":" Have been very bad with this diarohhrea last night & this morning the whole Brigade is suffering severely from it must be the change of food & water after coming out of the trenches, but my opinion the cause\n\nof it all is the cold settling on our stomachs during our last visit to the lines, even our Dr is down with it, you should see the latrines they are crowded night & day some of the men dare not leave them, they are so crook.\n\nWhile I was round there this morning a German Prisoner walks round on his own & waited his turn in the queue at the latrines, some of them can be trusted to go anywhere, they are satisfied with their lot & are pretty well treated, the French make them work much harder than the British.\n\nPacked up & left Ribemont this afternoon we did not have far to go about 4 miles but to the majority of us it was quite far enough.\n\nJust before leaving the Capt came round & inspected billets & men,\n\n& told us that the Town Major had valued the hay destroyed at 40 fr & that he was going to collect ½ a fr from each man, didn’t the boys swear & perform but they paid up the Bombers refused to pay at first but they up afterwards.\n\nA little while before moving I was telling the Captain about feeling crook, & he said he suffered terribly a day or so ago from the same thing, but he said that he got some opium pills from the quack & they fixed him up properly, come along with me the Capt say’s & I’ll get you some, so round we went, & he got the Dr to give me 9 or 10 of them, I tried to swallow 4 for a start but failed miserably & had to spit them out, so round to the cooks I go, & gets one of the\n\ncooks to poor some milk down my throat when I put a pill in, that’s the only way I can get them down & yet I can swallow a big fat cherry as easily as winking, however these pills fixed me up properly & I have had no trouble since taking them.\n\nWe are camped in tents where we are at present & I much prefer them to the billets we just left there is more room in them, we have 10 to a tent though there are only 5 of us in ours the Sergeants tent.\n\nThis evening of all the Sergts in the Batt. was held to discuss the advisability of starting a Sergts Mess we came to the conclusion that it would be a good idea, so the subscription fee was fixed at 30 francs & everything was settled for the Mess to start in a couple of days \n","12":" once more, & we held a church parade in a heavy snowstorm, right alongside there is a small wood all leafless of course & on the trees snow lay thick it looked very pretty with the branches bending over with their white load & the flakes falling fast while in the distance could be heard the rumble of traffic on the roads, & further off still the muffled roar of heavy artillery such was the conditions peculiar for Australians\n\nwhich we held our church parade under, happily the padr’e cut it as short as possible no hymns or nothing so she did not last long.\n\nMy platoon found the \"Guard\" tonight & if ever there was a rag time one well this was it, we are going to have our work cut out here I \n\ncan see most of them are very backward & want tuning up some.\n\nGot a letter from Stan tonight & I was very pleased to hear from him he wants me to claim him. I would like to in one way\n\nbut I think 2 brothers in the one Battalion quite enough, if you are together you are always wondering how they are getting on & if anything happens it is much harder for you than if they were in another Battalion, however I am going to see what Len thinks about it.\n\nJack Price is going on leave tonight I think I will give him one of diaries which I have just finished.\n\nAm taking over Battalion Orderly Sergeant at 6 tonight.\n\nHad to stop in camp all day on account of bad boots. soles are\n\nworn right off & they let the water in. They are issuing passes for Warloy we are quite close to her.\n\nFeel very much better today those pills seem to have done me the world of good.\n\n15th . Pretty busy today for I am Batt. Orderly Sergt, & in a camp there are so many things for one to look after. Had another meeting of the Sergts last night & the Mess is to be opened tonight & a good job too Most of the boys were pretty full last night.\n\nHeavy frost this morning but the sun is struggling to show itself for a while hope he gets out\n\nVery heavy sick parade some of them with nothing at all the matter with them at the present time we have a terrible lot of malingerers\n\neach lot of men they send us seem to be worse than the last so goodness knows what it would be like if Conscription were passed & we had the Conscripts to knock into shape.\n\nWe have the bugles going here & they sound very fine on the cold frosty air\n\n16 th The Mess opened last night & it was not too bad, after tea we played cards till it was time to go & attend a lecture for all NCO’s by Mr Edgeley, it was about the new formations we are shortly going to adopt in the Coy’s. somehow or other we all managed to squeeze into his tent & they smoked nearly all his cigarettes while the yapping was going on, it was dead funny I chatted with the Capt about the shortage of Corporals in my platoon, while No.\n\n11 had 2 full Corporals, let me see he said? Sergt Price is away on leave & Corporal Barwick can’t do much with his bad foot, at this we nearly burst out laughing for it is a standing joke in the Coy. the way Len works his foot, & gets the officers sympathy at the same time \"oh he is an artful dodger is Len, yesterday he was \"Orderly Corporal\" & he got the Capts permission to go to Dernancourt & get some footballs from the Comforts Fund so he gets a bicycle & away he goes, gets as far as Beauveaux & learns there that he can catch a car there in the morning, so he decides to come back & pitch a yarn about the bicycle breaking down & etc & tells Mr Edgeley about the car, so today Mr Edgeley gave him another \"pass\" for Dernancourt & there you are.\n\n \n\nIm hanged if I know how he works it, a mystery to me, he does things & nothing is said about them for which other people would get into an awful row, & Jack Mackie is another one, they are a good pair & mates as well.\n\nHad the platoon this morning on parade, & Heavens was it cold & the ground as hard as bricks with the sharp frost, ice has not melted all day, there is a small breeze blowing & it cuts like a knife. \n\nLindsay Graham came back from leave this afternoon.\n\nThis afternoon it was all football. A team went from our Coy. to to play B., it was a draw neither sides scoring the rest of the Coy. marched up on to a vacant piece of ground & had a rough & tumble about 100 men on the ball at once talk about fun\n\nthey nearly kicked the legs of one another but it kept us warm as toast.\n\nTonight Hqrs asked for a description of Bluey Whittaker he went away on leave at the end of last September & has not turned up so far, but I believe they have tracked him down at Etaples.\n\nI am keeping my eyes open for these Portuguese troops which are in France as I want particularly to have a look at them.\n\n17th.. Heavy fall of snow this morning a good 9 in I should think. owing to my boots being so bad I am not on parade this morning & how glad I am for the rest of them are skirmishing in the snow. By Heavens I’ll bet it is freezing out there & I can see some fun when they come in won’t they swear for it is still snowing, too bad I\n\n \n\nreckon as if they could not give them a day off, they might just as well for the men will learn nothing & it will do them a lot of harm perhaps, just imagine yourself carrying about 30 lbs on your back & careering over the snow, with hands like ice & the snow falling thick, then when they come home, they have only cold & crowded tents to go into, its enough to make a man jump up & never come down again. So much for the military life, no wonder a big % of the men are crook, & then they wonder why the men don’t turn out smartly, to make sure I would not go on parade this morning I fixed my boot up with the aid of a friendly bayonet, for they are quite beyond repair. \n\nI believe we are moving from here \n\nabout Sunday, & thus after promising us 32 days rest out of the line, I reckon they treat us rotten other Div. have 5 & 6 weeks rest but apparently they can’t afford to spell us long, something is loose somewhere or other, & they reckon we are being moved from the 4th.\n\nArmy Corp to the","13":" & and are going to be used for another stunt.\n\nIt is dead funny some of these photos I have seen of the Tanks, especially a Yankee one describing & showing the common old \"Caterpillar tractor\" as a British Tank without its coating of armour, a few of the photos have been somewhere near the mark but the majority only make one laugh for they are as much like the real Tank as a pig compared to a dog\n\nToday I read an account of the glowing way in which the Australians are being treated in their billets, one article describes us as sitting around huge roaring fires of wood with our clothes pegged out on the walls & the men enjoying themselves with jokes cards & etc, shows what he knows about it & the other average billets we camp in, but I suppose that the public fondly believe it, & reckon we are having a fine time in spite of the winter in France.\n\nThis afternoon we all tested our new helmets with real gas, this is how they test them first of all the platoon Sergts inspect all their helmets to see that there are no defects in them & the men understand how to breathe properly in them & also that they fit\n\nthe men correctly, having satisfied himself of this about 8 men at a time are let into an almost air-tight tent with their helmets on & let stop for a few minutes, this tent is filled with gas & if the helmet is defective ; well you jolly soon know it, but if it is good well you can’t smell a trace & you know your helmet is right, some of the men have a difficulty of breathing when in the helmets, for you know all breathing must be done both in & out through the mouth, but practice cures them of that.\n\nAfter the gas testing was over we were all \"fell in\" & just then General Birdwood came along he did not stop long had a few words & off just in time to miss a big snowball which someone\n\nthrew at him, the Capt then marched us over the road & halted, & told us to get as much ammunition as we could lay our hands on (snowballs) & believe me there was no lack of it for we were going to attack B Coy, then the fun started. B Coy. saw what we were up to & got ready to meet us, we attacked in two waves Capt led the first one & I the second, off we went & if ever there was a mix up well it was here the air was simply thick with flying snowballs, & in a few minutes we were all white with it, after they stemmed our rush they tried to capture the Capt & we all rallied round him & belted away as if our life depended on it, Capt Jacobs hit me fair in both eyes\n\nwith a big ball & nearly choked me but I got even with him for I landed him a beauty, officers & all entered into the fun heartily but getting near an officer was like following a Tank, for he drew all the fire, this fight lasted nearly an hour & then the whistle for \"cease fire\" sounded for coming down the road was a big party of A.M.C. & we prepared to meet them, they were only too willing to take up the challenge & we into it, this was a short go but while it lasted the fun was fast & furious at the conclusion our Capt called for 3 cheers for the A.M.C. which were heartily given & they returned the compliment, then A Coy came on the scene & there was\n\nHell to play poor Mervin Blake was nearly suffocated with the storm of snow which was shot at him he could hardly speak didn’t we paste him, & Mr Edgeley got a terrible dishing up & so did I for when we finished I had my nose barked & I was wet altogether I think it was the best bit of fun I have had since coming to France it was bonzer.\n\nAnyone coming along the road got a terrible doing especially anything in the shape of officers showing a bit of red, we made a special mark of them, some of the cars must have been nearly full of snow by the time they got past us I laughed at some Tommies who got a terrible pasting one of these said? These – Australians have \n\nnever seen snow before & don’t know any better\n\nIt is very seldom you see English troops snowballing I suppose they see enough of it, but the Australians are fair terrors for it.\n\nAnother one of the Dukes fine parcels arrived today all eatables & a sway of them too, he’s a proper sort of friend to have.\n","14":" I am off parade again today no boots on hand yet. I am not sorry in one way for it is snowing heavily & they are all out drilling\n\nVery funny in the Mess last night, there was plenty of whisky flying about, & it soon turned some of them up.\n\nJock Mackie & I won 8 games of Bridge in succession last night, some going that.\n\nLen went round to the aeroplane school yesterday all N.C.O.s from Corporals up have to attend now I believe & quite right for it is a fine thing to know about.\n\nYesterday afternoon the result of a Court Martial of one of our Sergts for drunkeness was read out, the way they do these things is like this the whole Battalion are formed up on three sides, then the offender is marched in & his crime, & verdict is read out by the C.O. in this case the Sergt was reduced to a Corporal they do this on the ground, the Drum Major steps forward & with a sharp pair of scissors or knife cuts a stripe off in front of all the men the prisoner is then marched off the ground & the parade dismisses but what a fool a man looks\n\nstanding there between two escorts bareheaded & in front of all his mates while this performance is going on, this is the worst part of it\n\nIt is snowing heavily this afternoon & the boys are playing football I think our officers are playing the","15":" Battalions this afternoon\n\nThe Orderly Room Sergt sent a note round to me this morning wanting to know what date I returned from \"leave\", hope there is something doing.\n","16":" Had a short parade this morning & it was very cold with a wind blowing which cut like a knife, just before dismissing the Coy. was assembled & put through the new formation again, after this a short route march & we were dismissed with orders to fall in again at\n","17":" for in the afternoon were going to have a \"Field day\" the whole Brigade were going to practice a stunt, so accordingly after dinner the bugles sounded the \"fall in\" & away we marched to our Battalion parade ground, here Capt Jacobs took charge & marched us about 2 miles to the joint where the affair was to take place, over towards Contay.\n\nAfter we had got all our men in position & everything ready I’m hanged if we did not have to wait for a good 2 hours shivering in the icy cold winds but this is the real military style\n\nAt last they gave the \"order\" to advance & away we went ,& for a wonder we did not get mixed up but everything went well, & the heads seemed well pleased at the way in which it was carried out\n\nAfter the attack was finished we were all \"fallen in\" & marched back to out tents all thoroughly tired out\n\nHad another Mess \"meeting last night to settle a few questions & to draw up rules for the \"Mess\"\n\nStarkey & Whittaker came back with a draft last night, & Whittaker was shoved into the \"clink\" straight off he has been over 2 months overdue with his \"leave\" so he’s looking for trouble I reckon.\n","18":" Roads are very slippery & hard owing to the severe frost which settled on the land & the whole countryside is covered with a white mantle but the snow is no longer fit for snowballing for it is frozen hard, it looks comical for all over the joint can be seen huge\n\nballs of snow which the boys rolled together & there they still stand & the snowmen are very much in evidence. Some of them are quite a decent size & will take some melting.\n\nJust as the \"Last Post\" was sounding last night & the Orderly Sergts were reporting myself among them a rifle shot rang out but it sounded a trifle muffled like a revolver shot, hullo we said theres some silly devil commited sucide, the shot sounded out in the wood which was very thick & it would be nearly impossible to find him, so we never troubled about him, but went to bed, in the morning it turned out that a batman was fooling with a loaded rifle & the\n\ntale it went off accidently & shot him in the foot, I don’t know how he will get on, a D.C.M. I expect for self inflicted wounding.\n\nHad the same stunt over again this afternoon & General Walker was there for the \"March past\". Last night Fred Shannon came back he was gazetted to this Batt.\n","19":" Church parade this morning but it was very short\n\nThis afternoon our Battalion is playing the 3rd \"Soccer\" & \"Rugby\" This evening the church bells were ringing down at the little church at Beauveaux, & they sounded beautifully so clear & ringing were the tones that came softly over the snow white fields, but I suppose that the rarity of the cold air had a lot to do with the mellow-\n\nness, the sound of church bells always set me thinking of old times. Just as we were having our tea tonight the bugles sounded \"Orderly Sergts\" & out we had to double, \"orders\" were that we had to go round our Coy. lines & warn the men that tonight at 7.30, an S.O.S. signal would go up from the \"Orderly room\", at the time mentioned we had all the men out of their beds & standing out on the cold duckboards, the majority were in their underpants & shirts & you may guess how impatiently they waited with their teeth chattering at last after much shouting & chipping off she went, but she to the amazement of all was a dud & nothing doing, how the boys swore after being dragged out of their beds for nothing\n\nFreddie Turner came back to the Coy. this afternoon old Blunden having returned from England\n","20":" Went for a march this morning & it was a rotten one, they made the pace too hot with the result that the end of the Coy. was strung out like a mob of flukey sheep, & the whole had to be halted every now & again to allow the rear to block up.\n\nAfter coming back we \"fell out\" & put our gear away & \"fell in\" again with our overcoats & rifles & marched away to the baths, while waiting our turn we had to drill our platoons out on the road, this was mainly to keep them warm, but the men could not see this & groused like anything, but it was no good of them growling they had to drill. The water accommodation was\n\nnot the best, but what there was of it was good, nice & warm & best of all we got a bonzer change of clean clothes, & got rid of our chats, \"hurrah\".\n\nThe other night the officers had a great spread, to celebrate Captain Jacobs \"crown\" he is a Major now, his promotion was very popular in the Battalion for he is well liked.\n\nHad to give evidence this evening on the Stokes case at the \"Orderly room\". McKillop went on leave today & I sent one of my completed diaries with him.\n","21":" Our \"Mess\" closed last night & we had a most enjoyable evening Young Hodges’ was there from the 1st Pioneer Batt. he was one of the old original Battalion, & the President made a pretty little speech in which\n\nhe extended a hearty invitation to Hodges to come whenever he pleased this was carried with acclamation by the boy’s, Hodges (who is a S.M) was very affected by the warmth of his welcome when he rose to thank the Sergts for their kindness\n\nCapt Jacobs sent round to the Mess a few bottles of whiskey for the boy’s. This morning we packed up & left the camp at half past 9. the sun was shining brilliantly but the ground was still white with snow & the roads were like glass & just as slippery to walk on. I very nearly came some nice cropper’s\n\nWe had a long & tiring march & on our way we passed an enormorous aerodrome, aeroplanes were there in scores some just leaving the grounds, they reach a pretty\n\nhigh speed before they rise, but once they leave the ground they rise rapidly, there were Belgian, French & British planes all over the place there were some German planes up also for our anti aircraft guns were very active, throwing hundreds of white fleecy balls into the blue sky. We marched through Albert on our way up. She is beginning to look a lot more lively of late, we pulled up at Beecourt thoroughly done up. \n\nThe camp we went into was spotlessly clean a Welsh Regiment was in it & they left it in a bonzer condition. This is about the best fitted camp we have struck, good latrines, washing troughs & huts, we won’t be in here long I’ll bet, its too good for us. The Welsh who were here have not been in the line since November, yet\n\nwho have been out just a little over a fortnight have to go in again. Saw a balloon of ours come a \"gutser\" this afternoon. I think a Taube shot her down for we saw one high above here when she started to fall, out flew 2 parachutes one floated like a huge umbrella over towards us but I could not see no one hanging on to her the other parachute had a man on alright for she descended rapidly a bit too fast I think for the chap on her, the old balloon turned over & over as she neared the ground, & I dare say fell a wreck.\n\nLen was sent ahead as billeting N.C.O. to these huts.\n","22":" Went for a route march this morning & the road was crowded with troops marching both ways it was a bonzer morning clear\n\nsunny & sharp stinging air, the road was in splendid condition for like all the rest of the country it is frozen as hard as steel, frost has settled on the land properly & if this is the sort of winters they have in France, well it will do us, the boys are standing it splendidly even better than a lot of the Tommies I think, why I have felt it far colder many & many a time in Tasmania than I have done over here so far, one naturally expected a frightful time after all the gassing yarns we used to hear about concerning the awful winter in this part of the world, I thought we would have been frizzled up by this time, but in the contrary we all look\n\nin good health with the exception of the majority of the mens feet, they are very soft & sore, through using so much whale oil & doing a lot of marching\n\nHave been acting S.M. today for Freddie Turner has been crook.\n\nA short parade this afternoon & a inspection of gas helmets.\n\nDid not go to bed till 3.30 AM last hight a few of us were playing cards till that time, we had a good fire & tables chairs lights & etc & we had a good supper to finish up on then we turned in\n","23":" Route march again this morning we went nearly into Albert, platoons marched at 100 yds interval & kept a good swinging pace up, the morning was nice & sunny so it was rather good marching\n\nCapt Mckenzie came back from England this morning & we were all very pleased to see him, I hope he takes over the Company, though I can’t complain about Mr Edgely he has treated me alright, but Capt McKenzie is a rare sport & is very popular with the Battalion.\n\nHad a short lecture this afternoon on danger of frost bite for the temperature at present is very low something like 10 ° below zero & if you don’t keep moving something is likely to happen.\n\nTook over Battalion Orderly Sergeant for B. Coy tonight they are short of Sergts.\n\nMade out a complete nominal roll of my platoon today this involves a fair amount of writing\n\nThis is a pretty good definition of an Anzac I copied it out of the \"Rising Sun\" a little paper issued bi-weekly by the A.I.F. in France, it is a bright cheery little journal & has some funny articles in it.\n\n\"What is an Anzac\"\n\nAn Anzac is a resident of England or of a Base Camp. It wears an Australian uniform, but the habitat of the English variety is mostly in London. It invariably insults men on leave from France by asking to which camp they belong; & feels insulted when the \"bloke\" spoken to replies \"The Somme\". It wears Kiwi leggings an officers uniform a wounded soldiers face, about 8 gold stripes & a G.S. wagon load of ostrich plumes in its’ hat. Also generally wears the Batt. colours of some unit \n\n \n\nwhich is doing its bit, but has long since forgotten that he existed. \n\nThe above is pretty true of malingerers in London it is full of them & don’t they swank, you would think they were winning the war to see them strutting about.\n","24":" Kaisers birthday wonder what he will be up to\n\nWas B.o.s again today.\n","25":" Shifted from Camp this morning at 9,the Capt came round at 7.30 & found us all in bed, he roared at us but could do nothing for Reveille had not sounded.\n\nWe are carrying one blanket with us. I think it is a good idea for everything is as hard as a brick the frost has everything in its grip, the roads are like billiard tables & dust is blowing about on the roads, it seems\n\nsuch a contrast with the snow covering the ground.\n\nPlenty of Taubes about this morning they are getting very active of late & are giving us a lot of trouble. We passed scores of guns & crowds of troops this morning & pulled up close to Bazentin le Grand.\n\nThis morning before leaving I in place of the Orderly Officer dismissed the Quarter Guard & handed the prisoners over to the Batt. police\n","26":" Last night after tea I had to do a bit of scouting for picks after a lot of trouble I managed to get 15 & marched off 28 men in all Mr Page reckoned we had about 2 miles to walk I like his idea of distance it was near 5 & on the way up we passed along the edge of \n\n\"High Wood\" now merely a bunch oh ragged & smashed timber with all the ground pockmarked with shell holes it was in the fight for this wood that one of the Gloucester regiments I think was just about wiped out. At the bottom of this wood there is a great wooden cross erected by the officers & men who fell in the fight for it, one can easily understand why the Germans struggled so hard to hold it for stretching a couple of miles behind it is pretty level ground & this afforded the Huns no protection at all although they had deeply dug trenches & masses of barbed wire protecting them but our guns smashed their defences to pieces as you can see as you go over the ground.\n\nJust on the edge of this wood there\n\nstands 2 broken German guns both out in the open they must have been trying to get them away but got caught by our shell fire. There is a duckboard track the whole way up to the firing line but at the present time it is useless for it is an impossibility to walk on them, it absolutely bangs anything as ever I struck, however we reached the firing line with 2 or 3 busters each you have to pass over wholly exposed ground & whenever a flare goes up the Huns can easily see any party who may be coming across but it seems to be a neutral war for there was never a shot fired at us either ways, we relieved a regiment of the 5th Yorks from this sector, & I believe they used to walk about & yarn with\n\none another as if they were the best of friends, one of their Sergts is getting a Court Martial for going over to their lines & coming back drunk. I can easily believe it for it is the German policy to let quiet alone. \n\nOn the way back our guns opened up a terrific bombardment on our right somewhere about \"Grease Trench\" the bursting shells looked very pretty as they flashed purple, gold, & fiery red on the frosty horizon, I think the snow white ground made it show up more distinctly.\n\nDidnt we get a shock coming back going up we kidded ourselves we could walk the frozen ground nicely but I think the dew had settled on the steel like ground which made it absolutely dangerous to walk on. I was getting on nicely \n\n& laughing to myself at the falls the others were getting, when all of a sudden like a flash of lightning up went my heels & down I come a frightful gutser. I fell with my legs both sides of the duckboards & at first I thought I had broken both my legs the pain was so intense I nearly cried with it, all I could do was gasp & roll about a good 5 or 6 mins the sweat came out all over me. I felt my legs & satisfied they were sound not that I cared much if one of them was broken or not then one of my mates helped me up the boards caught me fair on the muscly part of my leg & raised a big black bruise & wasn’t it sore to hop home on After this I could not stand for 2 min at a stretch just one continuous round of croppers I looped the loop\n\na doz times on the way down I don’t think there was a single man who escaped under a dozen falls imagine if you can, (but I know you can’t form any true idea).a long track & all the ground covered with snow to depth of a foot or so, & on both sides of this track the ground had been walked on to such an extent that all the snow had vanished leaving only an uneven glass like surface frozen as hard as steel, you might say to yourself why did we not go further out & walk on the snow, well we dare not for everywhere there are treacherous great shell holes & old battered in trenches hidden by the drifts of snow which had blown into them, for you know the snow overhere is not like we usually see in\n\nAustralia, it is like sand or white powder & the wind blows it about like dust & conceals these holes some of the boys had an experience of walking into these & talk about a buster for down you go until the solid ice pulls you up which might mean anything from 2 to 6 ft. so you can just imagine a man crawling out of this sort of thing \"heavens\" talk about cold & to make it worse an icy wind was blowing. I would not like to write what the boys said about the Hun, France, & things in general \"unprintable\". I know my own language was not of the best, big Bill Buckley who by the way stands 6 ft 7, simply couldn’t stand on his feet & over certain sections he had to crawl on his hands & knees, a pretty state of\n\naffairs, however we reached our camp after 3 hours struggling on the ice, & every man breathed a silent prayer & took various oaths what he wouldn’t do before he would go up that track again, the biggest wonder to me is how someone didnt break some bones for really it was dangerous to walk on.\n","27":" Had no sleep last night for it was too cold, so I got up early & issued the rations which were short To give you an idea how cold it is everything you buy with liquid in it in any shape or form is ice inside & the contents frozen as hard as wood & if you pour water on the ground ice will form under your eyes \"some cold isnt it\".\n\nWe shot down one of Fritz s planes today, one of then got a wing\n\nshot clean off & came a beautiful buster\n\nThe front we are now on is Le Sars so we have had a pretty fair experience of the Somme\".\n","28":" Was roused out late last night after a lot of messing about at 11.30, to go to the firing line & take a working party with me. I was sound asleep at the time the first time since leaving Beaucourt, of course you can bet we said nothing but it was no good of looking savage so we got our men up & ready, talk about a lot of sour faces & swearing men well they were here\n\nThis time I took the precaution to wrap some bags round my feet & it turned out a great success for I had not the slightest trouble in walking the slippery track. Once there we\n\ndrafted the men out in small parties & set them digging dugouts to make room for some extra men.\n\nJock Mackie was Sergt of the watch at the time & as I was curious to have a look at the \"outposts\", Jock took Bill Hunt & I round, well of all the ridiculous things as ever I struck surely these posts of ours are it, they are pushed right up close to the German lines & are placed simply in an old shell hole, the only connection they have with one another is through an old shallow battered in trench, you have to go over the open ground & in full view of the Huns. After returning from the \"outposts\" I went & had a look to see how the men were getting on with their work, they had scarcely made an impression the ground was so hard the pick used\n\nto bounce out of their hands & wasn’t they cursing.\n\nAfter this I went down into the big dugouts where Jock was camped to have a look how the miners were getting along, the dugout is easily 20ft deep & is as warm as toast they hold quite a number of men.\n\nDead funny up here they carry the water for cooking in bags on their backs the boys go out with picks crowbars & shovels & dig it out of the shellholes it is a great thickness over a foot in places & too hard to get it out.\n\nThe other night on our right the Tommies hopped over & took 280 prisoners & 2 machine guns, we put a very heavy barrage over on the German lines\n","29":" Am taking up to the lines tonight 6 tins cigarettes & they will be very welcome to the boys.\n\nLast night coming home from the trenches I took my boots off & walked the boards in my socks.\n\nHad a good long sleep during the day & just at tea time Mr. Page came round with an order that we were to proceed to the firing line at once & had to be at Rexham Rd at 6.15 that left us ½ an hour to have tea, pack, & push off in, after reaching the firing line put my \"reliefs\" on. I then took \"the watch\" till 9. & nothing happened during the night. The majority of the men come off at day-light for they are too exposed.\n\n31st What do you think of this our sentries & the Germans exchange greetings any time of the day, we are both in full view of one another & it seems to be a mutual agreement for neither sides to shoot, we are only 60 or 70 yds away, & you can go out any\n\ntime & give a whistle & a couple of Germans will jump up & wave to you. This morning Jock & I were signalling away to one of them when Jock collars a rifle & holds it up in full view of the Fritz & made a motion of pitching over his shoulder as if he was tired of war. Fritz was watching the performance closely then he collars his rifle & goes through the same movements.\n\nIt seems ridiculous you can watch one another walking about & changing reliefs & etc & when flares go up there is no need to crouch down for no one will interfere with you in fact if you happened to be out among the snow & shellholes you will be looking for one to go up & show the way across & as\n\nfor the Sergt. carrying a rifle well he never thinks of it while he is doing his visiting rounds. Such is the war as carried on at present on the Le Sars front, but the 8th Batt. on our right bog in day & night, but there is one good thing about this quiet state of affairs & that is it enables one to have a good look at the country over which one day he might have to fight. you\n\ncan see Le Bark right in front of us & all the German trenches stretching away to the ridge & every here & there is to be seen great mounds varying in height anyone not knowing the history of these would wonder how on earth they happened to be there when all the surrounding country is so level they have a history & it runs something like this, thousands of years ago German & French used to\n\nfight only under different names for they were almost barbaric races at that time, & among the Gauls it was a custom to bury all their dead in great tombs like the ancient Egyptians, in these great tombs they used to have numerous & well constructed galleries & in these they placed their dead rather a gruesome idea, when the Germans swept through the country they quickly realized the value of these tombs & they turned each into a veritable fortress the deeper galleries they made magazines of & the shallower ones fairly bristle with machine guns such today is the famous \nWarlencourt Abbaye& a few more of the strongholds around this part of the country which have defied all our efforts to take so far Last night I was on duty from\n","30":" till 5 in the morning a pretty long stretch. I was sound asleep when Jock came round & woke me up and told me it was my \"watch\" so up I gets & hops out, it was snowing lightly & very cold, the first thing I do is to pay all the \"posts\" a visit this takes nearly an hour for they are so scattered, after hopping over the parapet I find that the recently fallen snow has covered all our tracks & I can see that I shall have to be careful for I might easily walk into the German trenches. however I find 21 post safely & they report everything correct the next post is easily found but not so 19 but a friendly flare or two came to my aid making the snowy night as bright as day the falling snow looked very pretty\n\nwhen shown up by the bright lights of the flares, anxious questions are asked as regards what time the stew & tea will arrive & etc for this is all that keeps them alive out in the cold frosty nights, but the boys seem to stand it splendidly the Tommies could only do 48 hours up here yet we are doing 4 days, & at Guedecourt they only done 24 hours in the front line, yet we so-called soft Australians done 48 easily. After seeing that all is correct I redouble my steps & make towards the rest of our posts they are more easily found for they are in a trench on my way back I bump Mr Edgeley & he has something he wants me to do, he wants Mr Champion & I he says to get some barb wire & go\n\n& block up an old gap in front of 22 B. so off we go & get the wire rotten stuff to handle too.\n\n It did not take long to fix her up but my wanderings have not finished yet for he wants Mr Broughton the next officer on watch & I to go out & reconnoitre an old German Sap in front of 21, we do this & get within 10 yds of the German front line where we can see the Huns quite plainly after doing our job back we come, & the tea & rations are just beginning to arrive so I have to take charge of these & see that they are issued fairly.\n\n5 oclock at last & still snowing so I call Bellchambers & turn in to snatch a few hours sleep.\n","31":" A lovely morning after the snowstorm & the sun is shining\n\nbrilliantly, & the country looks very nice with its covering of snow \n\nOld Fritz threw a lot of bombs at the 8th Battalion but no result I believe Last night we were relieved by the","32":" Batt. & they made a proper mess of it, sent a big fatigue party up with the relieving men & you could see nothing but men for miles all making for the trenches in one long string nothing but good fortune saved them from being wiped out, & to make matters worse they brought a fair number of half drunken men with them, & one or two of them kicked up a great stink an officer threatened to shoot one of them if he did not hold his tongue but he took no notice of him the officer placed him under arrest a pretty sentence he’ll get for drunkeness in the firing line is a \n\nvery serious offence, for they can so easily give the show away & cause a lot of trouble for noise always attracts fire.\n\nFunny to say the neutrality ceased tonight for they fired at me while going out to our outposts & they also had a pot at the machine gunners going out, so I had to take the 3rd Batt. relief in a rotten old trench, it was pretty late by the time the last of us got away & we had a long weary march in front of us to Bazentin No 5. Camp I was just about knocked out by the time we sighted our camp & I simply threw myself down & went to sleep & did not wake up till 10 next morning.\n\nWe had a good breakfast for there was a lot of parcels waiting for us\n\nDone nothing much today for the boys were very tired & it took most of the day to get cleaned up\n\n2nd The Coy. rose early this morning & went for a bath they had to walk to Fricourt a distance of 4 miles or so. I did not go for I was too crook I am getting much weaker in the chest I think & I know for certain that I am not as strong as I used to be, however this is only to be expected after the exposure I have been through since joining the military I am expecting a breakdown in a couple of months or so it was just as well I did not go to the baths for they could not get a bath on account of the water all being frozen so they got a clean change of clothes & back they came swearing like troopers\n\n3rd. Saw Jack Johnson this morning for the first time since leaving in","33":" he has 2 stars up & is in the heavy mortars. we had quite a long yarn for he is a good fellow\n\nHad to attend Orderly Room to give evidence on Stokes case the C.O. blew Bellchambers & Graham up for nothing at all.\n\nLast night we tried a new preparation for the feet instead of whale oil. they got it from the French who swear by it. First of all they wash their feet in warm water & rub this certain soap on, afterwards well powdering the feet with a whitish looking stuff which is supplied to us\n\nLen took a party of men away today on a Divisional job\n\n \n\n \n\nSome of the officers were round tonight seeing how many volunteers they could get for a raiding party\n\n4th. This morning the Coy. was \"fell in\" & volunteers called for this raiding party they got 28 from the Coy. including my humble self. but they turned nearly everyone down & only took 2 from us they had such a crowd to select from & they generally take those men who have not seen much service.\n\nA furious bombardment broke out early last night & lasted fully a couple of hours I cannot describe the terrific thunderous roar of our terrible artillery the night seemed full of roaring rushing shells as they sped overhead on their destructive career, just close to our huts there is a battery of 9.2 & everytime these\n\nmonsters fired something or other would be knocked off a shelf we had a one end of the hut by concussion\n\nIt is estimated that 500 batteries (2000 guns) were in action last night what it was all over I am not certain of yet for one hears so many yarns. I heard once that the Germans put gas over, (sorry if they did I guess) & there again they attacked our 4th Bde & gave them a rough handling,though they beat them back ,but I suppose we will hear the truth in a few days\n\nShifted tonight up towards the firing line to do \"supports\" we left ½ our Coy. back at High Wood to do fatigues. \n\n As I was coming up tonight hanged if I did not spot Jack Johnson again seems strange after the long time since seeing him that I should\n\nbump him twice in so short a time \n","34":" Funny joint we are in this time we have to lay in our dugout all day and can’t knock about for fear of giving our position away if the Huns knew we were here they would blow us to pieces, so we take it easy, we have good dugouts in our dugout there are three of us Jock Starkey & myself & about all we have to do is lay & sleep & I think we make a pretty good fist of it, last night went to bed at 11 o’clock & did not get up till tea time next day.\n\nTonight at 10 oclock our guns put a heavy barrage over the \"Maze\" & right up to Guedecourt at the latter place our 4th Div were making an attack on a German \"Strongpost\" I was outside at the time waiting to have a look at it, punctually \n\nat 10 the guns flashed out & didn’t they pour it in. I could not see too well from where I was standing so I ran across to the next ridge & a wonderful scene was laid before me, the whole horizon was lit up by bursting shells which gave the night a weird look as the shells flashed fiery red, scarlet, light yellow & sometimes a pretty bluish green would catch your eye, among all this medley & all the confusion of colors the Huns added their flares, plainly showing their fear of being attacked the light from the numerous flares showed to me the great rolling clouds of dust smoke coming from the German lines in ever increasing volumes till at last the bombarded section looked more like a great bush fire, while the\n\nheavy shells which kept on falling into the smoke & fumes resembled big trees falling, raising great clouds of bright red sparks, while above all was the roar of artillery While this was going on the boys attacked & captured the position &130 men & 2 officers with it, our casualties amounted to 140 nearly all light wounds, but to me the funniest part of the whole business is that the Germans allowed us to bring all our wounded in under the white flag, one would have thought that he would shoot at sight now that he has gone the \"bundle\" over his submarines\n\nA message came over the telephone tonight saying that America had declared war on Germany, hope its true for it ought to shorten the war\n\nI was round at the cookhouse this evening having a yarn to Digby & McGrath & while I was there they were cutting up the meat, it was frozen as hard as steel & ice all through not much fear of getting it flyblown or flabby this weather. We are getting \"chestnuts\" issued to us now instead of potatoes. I think they get them principally from Spain she is a great country for nuts of all sorts\n","35":" . Been pretty crook all day & a nasty cold & headaches, it makes one feel so rotten.\n\n7th.. Out on fatigue last night trucking Stokes mortars to the firing line we took over a 1000 up on 6 trucks, just as we got to the end of our journey hanged if our truck didn’t capsize & shot all the boxes of bombs flying I very near got\n\ncaught, just jumped in time to save myself\n\nThe Capt sprung a surprise this morning he sent an order round that all blankets were to be folded neatly & that he would inspect the dugouts at 8.30, well he did so & when he had finished he suddenly thought he would have a look at their rifles Gee whiz what a shock for the majority of them hadn’t touched their rifles since leaving the Huts, & you can bet they were not too clean. it ended up however in 6 of them having their names taken for \"neglect of duty\" & will go up when we get out of the trenches.\n\n8th Took a fatigue party down to Yorks dump but we had a very long walk for nothing, for all the ammunition & water had up long ago\n\nOur raiding party is off the 4 th Batt are going to do it.\n\nThere was a rather pretty sunrise on the frost bitten fields of Picardy this morning.\n\n9th Last night we left our comfortable dugouts & tramped off across the snow covered ground to another lot of trenches which we were going to occupy for our next stage which would be \"close supports\", the Bombers & No. 12 had their dugouts in & along an old sunken road, as soon as we got settled down out they hauled us for \"ration fatigue\" went down to the dump, waited an hour then it struck someone that it would be a good hour before the trucks would be here so off we had to go, how we swore, while waiting down comes the Capt. With\n\none of his brainwaves as we call them, he got me to get all the party to go & pull the sheet- iron off a good dugout so as he could build another one, by the time this was finished the rations arrived & down we sailed after them, & humped the lot up to Coy. Hqrs.. no water was sent along, but as luck happened I noticed a tank down on the tram line nearly full so I got all the dixies I could off Digby & took the party down & got fixed up for the night.\n\nWhile all this was going on our guns put up a terrific fire on Fritz we could scarce hear one another talking.\n\n10th Early this morning I was aroused by Bellchambers\n\nmusical voice calling me had an order for No. 12 to pack up & move at once to York Dump to take over from the party in charge there. So we had to get up & wasn’t it cold \n\nafter warning all the men or rather Starkey did we had a hasty breakfast & pushed off down the tram line, the pace was very slow for everything is slippery & hard & to hurry is to court disaster, the party reached the Dump about 9 oclock. I arrived some time after, when we got there they knew nothing about being relieved so the Sergt I went down to Div Hqrs to see the officer in charge of all the dumps, after a lot of gassing & windbagging & explanations the\n\nother party had to return to their Coy. it took me nearly all the afternoon to take over the Dump & get into the way of working, we fell in the soup properly for there was more ammunitions requisitioned for tonights work than there is in a fortnight of the usual working. I had no less than 32 trucks to fill with various explosives & I was responsible for the whole concern, the gang started about 7.30 & did not finish till 12 oclock & by the time I had finished balancing my books & getting the requisition for tomorrow it was 2 oclock, to give you an idea of the stuff we sent out, 52,000 rounds of S.A.A.\n\n9.000 Stokes bombs, 10,000 MILLS No. 5, 5,000 Rifle Grenades & the same number of cartridges for them 24 boxes of Very lights & flares & numerous other small items, I am responsible for all this so you can imagine it kept me busy as the pushing parties kept on butting in & loading the wrong stuff. I told a few of them off for this, the pushing party was drawn mostly from the 3rd Batt we had somewhere round about 150 of them & a few of the 2nd Bde. also. It kept Starkey & I pretty busy checking & counting truckloads.\n\nSaw a horse killed waggon smashed & the driver wounded this evening. A shell lobbed fair\n\nunder the waggon & nearly turned it inside out\n\nran across Eric Salter this evening accidentally I was enquiring of certain pushing parties & happened to go to the very dugout where he was camped in, so later on I went down & had a yarn with him about old times One of my men was sent from here to Hospital this evening Our Guns have just finished putting up a heavy scrap I think the 4th Battalion raid was on tonight\n\nAnother heavy load of ammunition leaving my Dump tonight 17 trucks. Went to my reserve bottle of ink tonight & hang me \n\nif it wasn’t frozen hard\n\n11th Last night the raids came off & neither of them were successful the","36":" Battalion got held up by the wire which was not sufficiently smashed a few of them got in they brought back 2 prisoners & had 6 casualties, they reckon if Fritzs bombs had been any good he would have wiped them all out for they fell like a hail storm all round them while they were cutting the wire.\n\nThe","37":" Batt. had a most disastrous night 60 out of the 100 killed or wounded, the Huns evidently knew of their raid & were waiting on them they opened up with rifle & machine gun 5 min’s before they went over, however in spite of\n\nall this, they entered his trenches & from all accounts’ they were in a dreadful state full of dead men the opinion seems to be that Fritz put his barrage in mistake over his own trench with disastrous results for themselves. On account of the heavy casualties they had to send a party of the","38":" Batt. to give them a hand.\n\nThe officer in charge of all the dumps’ was up today to see how I was getting on he was well satisfied with the way things were being worked.\n","39":" Outside the snow is falling thick & fast, but at the present time I can laugh at it for I am quartered in a big warm dugout with a coal fire &\n\nplenty of tucker, they feed us well on this job, we draw our rations from Div which is always best for you get far more liberal rations from them\n\nHad a yarn with the O.C. on the telephone this morning over a few matters concerning the distribution of ammunition. One can notice that the sun is getting warmer every time she shines out now, yesterday it was very pronounced, we are all longing for the good old summer days for we love the sunny weather.\n","40":" Nothing of any consequence to report, very light loads of ammunition last night.\n\n13th Got word last night that we were going to be relieved by\n\nthe 11 th Batt. I was expecting this for our battalion are going out of the line for a spell.\n\nAbout 11 oclock Bellchambers blew in, in a terrible state, had been waiting for hours to guide the 11 th Batt. party in & they never turned up, however we set to & cooked him a good meal & persuaded him to stay the night Next thing 3 oclock in the morning the long expected party turns up & wants me to hand over the orders at once. I told him not very politely either Im afraid to go to a very hot place & be damned for my past, so they camped for the night in some old dugouts, we rose about 8 oclock cooked our breakfast which consisted of steak\n\nchips, fried bread, bacon, & etc not bad you know, but the night before the rats pinched our meet & we done a skinner, after breakfast, Starkey handed over his ammunition stores to the incoming Corporal, while I handed over the whole concern to the Sergt. & then set out to find the Battalion. On the way down I had to report to Div Hqrs & the officer in charge of Ammunition said he was very pleased at the way we carried out our duties, & he hoped the next lot would be somewhere the mark.\n\nThere was a false gas alarm just as the Battalions were relieving & I believe it was dead funny the antics some of them were cutting.\n\nAbout 4 oclock this morning there was a great commotion up round the firing line, the strength of it was this, early last night our chaps got word that there would very likely be a raid & so they got ready true enough it came off & it was a dismal failure for the Huns everything was ready for them artillery, machine guns & all & I believe the ground was littered with their bodies this morning, \"revenge is sweet.\"\n\nWhen I lobbed in the Camp this morning, I was surprised at the number of entirely new faces & quite a number of details had arrived, including Depina, Baines & a few more.\n\nCapt Edgely has gone to A. Coy\"\n\n& Capt. Mackenzie is coming to C. so that is a very profitable swap.\n\nThe ground is very wet and sloppy for it is thawing fast.\n\nThey are paying In our hut today & they are making a nice mess of it with the mud they are carrying in on their boots, it will resemble a pigsty \n\nshortly.\n","41":" Went for a short route march this morning as far as \"Peronne Avenue\" & came back & started rifle drill, I never saw the men so dopey before they were more like a lot of old women, & worst of it I could not shake them up for I can hardly speak I’m that hoarse, it makes me mad to look at a lot of men with no life or snap in their work\n\ntheres another thing which I am going to put my foot on if possible & that is men chewing that rotten \"chewing gum\" while on parade its alright for those that like it chewing on the march but when it comes to drill, well its rotten.\n\nAbout 11 oclock they collected all pay books they are having them altered I believe, some reckon for the purpose of collaring our money for the War Loan, be a bit of a stinck Iguess if they do, though they are welcome to mine for that purpose \n\nWell having a fair bit of time on my hands tonight I am going to try & describe an ordinary 24 hours in a garrison trench.\n\nYou can start your day any time you like for there is no beginning or end to any day in the trenches\n\nLet us start say at ½ an hour or so before dawn the hour of Stand To\n\nThis on the whole is the most dangerous of the 24, the enemy may be planning an attack on your defences, if so he will have made use of the hours of darkness to complete his arrangements to push troops across No Mans land ready to dash forward at the break of day, therefore at this hour every available man \"stands to arms\" \n\nWe line the parapet peering out into the darkness, watching the grass in front of us turn from black to grey & from grey to green when it becomes quite light & there is nothing unusual to be seen, we \"stand down\" leaving sentries every here & there along our trench As a rule during Stand to or immediately after one of the most important\n\njobs of the day takes place namely the issue of rum.\n\nSometimes after this we turn in for an hour or so, but generally work starts immediately, one of the first duties is tidying & cleaning up the trench, empty bully tins, biscuits paper & etc form the greater part of the rubbish, then set to & clean our rifles, after this breakfast.\n\nAs a rule each man cooks his own, though in some of the quieter places the cooks do the work.\n\nAfter breakfast comes the pick & shovel work for no trench no matter how good it might be is never finished, there is always the parapet to be strengthened or new communication trenches to be dug or other damage to be repaired\n\nSometimes you can hear old\n\nFritz, hammering sawing & hacking sometimes a shovel swings into view This happens too often sometimes & our guns put a few rapid salvos into him bursting the shells all round the busy part, but again the situation is often reversed & we get them at us, but one thing is absolutely certain which ever side starts it the other is bound to retaliate & we knock off work for an hour or so & let the guns fight it out. I suppose the gunners of both sides reckon they are chastising one another by shelling the trenches of the unfortunate infantry who have no say in the quarrel at all\n\nNext stop dinner, & after this as a rule all hands have a camp for we get very little sleep at night but often our rest is broken for\n\nthis is the time selected by the big guns on both sides for a little target practice, very likely our artillery organizes a combined strafe on some enemy strong point, & they lay about for all they are worth, but whatever success it may have had it has only one end, retaliation on the infantry by the Hun so we squeeze up in the deepest part of our dugout & there try to sleep while Fritz is trying his hand\n\nHowever evening comes at last time to Stand to in the gathering dusk, presently a long thin streak of light makes its appearance, bends high above our heads & bursts into a dazzling flame, it is the first Very light & means that the nights work is upon us, there is great activity\n\nin the trenches now, the parapet is manned & the scientific work of the sniper which has been going on all day gives way to more snap shooting than anything else.\n\nWorking parties get busy this time in places where you can’t get at in day light.\n\nRation parties set off down the communication trenches, wounded are transferred under the friendly cover of darkness to the motor ambulances waiting in the roads at the rear\n\nParties go over the parapet to repair the wire which had been damaged during the afternoon shelling, now comes the exciting part for occasionally a Boche patrol sneaks out & gets busy, there will be no shots, only the cold steel, to fire a rifle in the middle of \"No Mans Land\"\n\nis to court disaster from the machine guns of both sides, this is the machine gunners busy times Very often rifle fire breaks out for no reason at all & is taken up by both sides, machine guns join in, the storm runs right along the line, sometimes for miles everybody blazing madly at nothing, until it reaches a party who are well disciplined & they refuse to fire at nothing, then it dies away as suddenly as it broke out , & the scared patrols crawl out of their shell holes & creep home to full for words.\n\nSo the night wears on, the ration parties return bearing rations & best of all; mails, working parties are called in, the uneasy popping of rifles dies down almost\n\nto nothing, & a fairly uneventful 24 hours draws to a close.\n\nOf course trench life is not always like this, on occasions there are other kinds, for instance your trenches \nmade\n may be made the object of an intensive bombardment, such an experience is more easily imagined than described so there is no need to touch on it.\n\n15th Went away this morning on fatigue had to march to Bazentin & there do road work till 3 oclock I need scarcely say very little work was done, the tucker wont stand it There was a fair bit of shooting at the Taubes & some of the nose caps came down very close to us. One one went right through a hut but luckily no one was hurt\n\nThere was an issue of clean shirts\n\nthis evening & they were badly needed for we are all \"crummy\".\n\n2 of my men have \"buzzed off & have not been sighted for 24 hours\n\nI expect they are drunk in Albert or else in the clink.\n\nBilletting NCO’s are going away from here tonight, so that means a move in the morning.\n\nWhat do you think, our Major refused to let us run our Sergts Mess the other day, rotten I reckon & only for us shifting there would have been a fine row for the Committee were going to go further with it to Bde if necessary for we are entitled to \"Mess\" & unless he has a very fine excuse he will get into hot water & serve him right, he knew nothing whatever about our moving so there is no excuse\n\non that score, I wish to heaven we could only get old Jimmy Hearn back he would straighten things up a bit I guess. I believe he offended the 2nd Bde some time back told them they had never done anything yet, & they should take an example from the","42":" Bde, yes old Hearn worked us & got good results too & we always got a fair deal.\n\nSince he has gone we don’t know where or how we stand.\n\nPlenty of liquor knocking about in the lines tonight, most of whisky too, it bangs the world how they get it\n\nI note they are moving a lot of our heavy guns from this quarter going to Peronne I believe \n","43":" Packed up & left early this morning, while we were in platoons & waiting\n\nto move off I or rather we all saw a most remarkable sight, nothing less than blowing up one of our ammunition dumps quite close to Mametz Wood & less than a mile from us, first thing we noticed was an enormous sheet of flame shoot into the air accompanied by a huge cloud of black smoke which twisted & twirled over & over, the next thing a dull heavy roar & then a succession of short sharp explosions like a packet of crackers going off, these probably were the bombs & shells which had been sent flying by the explosion. I don’t know what was the cause of it but I think it was a plane which dropped the bombs, this was not the only dump which went up this morning for we distinctly heard 2 similar\n\nreports about daybreak, but at the time we put them down to a 15 in or 18 in gun firing\n\nDirectly after the explosion you should have seen the great flocks of birds that flew away from the danger zone they must have had a scare over it, probably felt the concussion for they are bound to be very sensitive\n\nHad a long weary march before we finally pulled up at Bresle we went through Albert each time I see her now she looks much cleaner they are cleaning all the debris from the bombardments. As we were marching through some of the boys chaffed a Tommy who was riding along didn’t he bite, this was just what they wanted & they nearly drove him silly, foollike he wouldn’t go away but kept on\n\ntrying to get in on them but he had as much chance of flying, he kept on saying \"I was out here in 1914 before you come oop\". I nearly split my sides laughing at him. When we reached Bresle there was a great rush for the boozer’s & for a while they did a brisk trade.\n","44":" The Coy. were out drilling this morning & we tried a few likely men for NCO.’s & in the afternoon we went for a route march & they made it a welter coming home.\n\nVery dull overcast today & tonight it is raining steadily.\n\nKicked Beggs out of his job today & put old Blue Whittaker in his place, Beggs has had a good thing on & did not know it, in fact to bring our tucker from the cooker’s was to do us \n\na favour & he used to leave our utensils laying anywhere.\n\nThis morning as I lay in bed the church bells were ringing in the village how pretty they sounded on the sharp morning air.\n","45":" A big thaw has set in & the ground is very sloppy & wet, this is the last of the heavy frost I expect for the mild air of late is very noticeable this morning I noticed a few trees beginning to show signs of budding, how I am looking forward to the spring, for I love to see the flowers & leafy trees all over the country side.\n\nTried something new altogether this morning nothing less than firing from the hip when advancing the very same thing as the papers used to run the Germans down at\n\nthe beginning of the war for I always had an idea that it was not the mugs game they reckoned it was, & after this mornings performance I am sure of it.\n\nThe method we followed was for only the first wave to do the firing & this of course only when the \"barrage\" has failed and the Huns get their heads up, the men move off in \"extended order\" at a couple of paces interval, holding their rifle butt behind & close to the hip, every 10 yards or so they fire at the trench, of course the fire is no ways accurate but I can tell you it will make a man keep his head down for the bullets are buzzing all over the place kicking up the dust & humming ominously with their \n\nwaspish tone. As usual we are following the French who have been using this with their latest mode of attack with great \nfor\n success.\n\nCpl Starkey & I had to go down to Hqrs this afternoon & make a statement as regards Woods case he was accidentally hurt at \"Yorks Dump\" This afternoon Starkey & I scaled parade & to put a bit of our time in we went & gave an old French couple a hand to clean their grain after we had finished we weighed ourselves according to the scales I weigh 11-11 but I am sure I am not that heavy, you would have laughed at the roundabout way I got the weights worked out on, on account of my limited French & the Kilogrames, but it worked out correctly in Starkey’s case\n","46":" Had a bad accident out on parade this morning, every man in the Battalion was supposed to throw a live bomb. C Coy had just finished throwing & D Coy had started everything went well for a while till by some unlucky accident they struck a bomb which was faulty & just as it left the throwers hand it exploded killing three & wounding 11 more some of them seriously, the bombing officer Lieut Dingle is as good as dead & Scales a platoon officer is very badly hit, these \"Mills\" bombs of ours are very small & innocent looking, but they are the deadliest things for their size I know of, this caused a bit of a flutter for a while, & there was a great demand for sticking plaster\n\nbandages, stretchers, & the Dr.\n\nThere is going to be an inquiry over the accident this afternoon & Jock Mackie is going to give evidence.\n\nIn this billet we have a great big open fireplace & it takes our resources to keep it going, yesterday afternoon Jack Price & a few mates chopped a good lump of a green tree down & just as it fell, down rushed a Frenchie in a fit he danced round & round the tree jabbering & chattering & throwing his hands about. Price tried to square him by offering to give him 5 francs but he wanted 30 so that was no good to us, at last after a lot of arguing of which neither sides knew much of what the other was talking about the Frenchie sets off\n\ndown to tell the Mintaire or Town Major, so we decided to do a get for there would only be a stink if we were caught, for timber in this part of the world is valuable & well protected not like in Australia, the boys intend to sneak over & chop it up early this morning, but when they got there there was not a trace of the tree to be seen I don’t know whether the Frenchy got it or some of our chaps\n","47":" The Coy’s blankets were collected this morning & sent away to be fumigated & not before they were needed\n\nOut on parade this morning & it rained the whole time, & most of us got wet through A miserable morning for all concerned. \n\nMr Beckett sent a note down to\n\nthe C.O. asking him to let the men come down to their billets & have lectures by the officers, but No he would not listen to it, sent word down that we would have to stop on parade & carry out the schedule laid down, talk about roar & swear how the boys performed & what nice things they said about him, so accordingly after a lot of messing about we launched an attack in our formations, & after this we marched off home, wet, & sick & tired of everything connected with the military.\n","48":" Out again last night & talk about a heavy fog well she was it. We had a job to find our way to the starting point, we went over the same ground as in the morning\n\nNo 9 & 12 Platoons were in the first line & I had charge of our extreme right, \"the barrage\" was marked by flares carried by men & according to how these flares were moved we had to act \naccording\n when they were held high over their heads, it was meant that the barrage was going forward & when the lights were put down, the barrage had ceased to move forward & we had to halt & get down low, it was interesting to watch the different waves coming forward each maintaining their interval, & the line of flares looked very peculiar in the thick & heavy fog, the attack was very well carried out & the majority of the men & NCOs concerned seemed to under\n\ntheir work alright, it took about an hour to go through, & after this we marched back to billets.\n\nThis morning we had mostly physical jerks & bomb throwing, the air had quite a balmy touch about it & the birds were all singing merrily & everything seemed stirring Had to attend Orderly Room as a witness on Grey & Coan’s case but was not wanted after standing in the mud & slush for an hour & a half This evening the platoon Sergts had to take the names of all their men who reckon they cant walk, you should see the malingerers rush to get their names down, if there is any man I have a set on it is a malingerer & we have quite a number of them at present\n","49":" Last night we had another\n\nnight operation what a mix up it was I think we were about the only platoon in the Coy who found their right objective.\n\nThis morning we moved from Brisle to Gricourt camp & it was a long & wearisome march & the roads were in a very bad state swimming in water in some places\n","50":" Saw Jack Gribble last night he has been in England at a School & got his commission. Early this morning we had to turn out for fatigue & was ½ an hour late over it.\n\nHad to wait up till 2 oclock this morning to get our blankets the transport made a nice mess of it this time, we could not \ngot\n go to bed, so we put our\n\ntime in playing Bridge\"\n\nRations have been very short of late no meat or bacon issue this morning & whats worse still we had biscuits & bully that made the boys cock their ears & yell.\n\nHad a good long walk to our job & here the parties were split up into various parties for the work allotted.\n\nDefing & I went up & had a look at the Tank they had just fetched along, you would be surprised to see where these monsters can go, this one came down a steep slippery hill, crossed a muddy gulley & climbed the opposite side taking all the old trenches & holes in her track, the name of this\n\nTank by a curious co- incidence was \"H.M.L.S Campania\".\n\nWhile looking over her down comes a party of German prisoners 15 in all, & it was the funniest thing you ever saw for the escort were boozed right up to their necks & were rolling all over the place, one of them kept throwing his arms round their necks & saying to the Fritzs\"’ good old Fritz youre not a bad sort of old ---- are you, most of them had no idea what he was saying but they grinned like Cheshire cats, one of them a Sergt Major a mere boy not more than17 I’ll bet could understand English & speak it well, he was wounded in the shoulder but he was\n\nas game as anything, one could not help noticing the haunting look in his eyes I felt quite sorry for him, it was easily seen he was a cut higher than the others some of the boys gave them cigarettes out of their pity, but no matter how we hate our enemy in battle, once he is a prisoner we treat them well, & so it should be. This German said to us that he would never have been captured only for him being wounded & getting stuck in the mud, but he said the Australians are good & clean fighters\". these were a wretched looking lot of prisoners & they were covered with mud they were captured by the 45th Batt who had 2 successful raids on top of one another\n\n& got 50 Germans in both.\n\nTo night we got our new pay books they are a complicated affair.\n\nJock Mackie has been pretty crook since yesterday & tonight he is not much better.\n","51":" Out on the same job again this morning, but they might as well stop home for all the work they do\n\nThis morning Bell & I went away for a little while & when we came back there was nothing but a long row of picks & shovels leaning against the roadside \"what a pretty sight\" I wonder what the officer would have said if he had seen them, it was disgraceful they were all away looking for canteens & etc it would take a good man to find a\n\ncanteen of any good round this part all they seem to have is lobsters & soap & they don’t forget to charge we paid 7 francs for a little tin of biscuits rotten I reckon. however we set out to find them & we dug them up in all manner of places a couple of them I found with their boots & putties off warming their feet by the fire talk about roar I chased them out quick & lively the next thing we struck was an eye opener a chap came to the door of an officers hut & sang out ‘ how would you like a cup of tea’’, at the time I never noticed who it was, of course this was just what we wanted so over we goes wondering who on earth it could have been, when we entered the hut we got a shock for there sitting round the fire drinking tea\n\nwas a dozen or so of our chaps you could have knocked me down with a feather, however we said nothing but sat down & had a good drink, it appears the officers had just left the joint & they hopped in & made the best of it.\n","52":" Up as usual this morning but just as we were about to move off an order\" came around that we were to stand fast for a while it ended up in our not going out at all, only the \"specialists\" went on parade, the reason for all this was that our chaps were advancing rapidly & noone knew what was going to happen, during the day all sorts of wild & fantastic rumours have been flying around & the officers have been drinking one\n\nanothers health & etc. the roads have been very lively with the gun teams galloping about hurrying the guns to the line, & the ammunition wagons clattering up & down the road. Something is happening all right, all the Light Horse on the various jobs they have been on have been recalled & we have sent men to take their places, they reckon they want them for patrols, the Capt came in tonight & said we might have to move any time tonight that’s nice to know?\n\nLen & I received a parcel each from Stan this morning & the contents were very handy\n\nI also sent a parcel away tonight hope it gets through alright for there are a couple of good\n\nbombs in it\n\nDrew my first pay for a year last night, the last time I was paid was Ghizeh in Egypt, so I have had a pretty good run without any dough.\n\nLast night through having too many lights showing the Batt. opposite us had 19 men killed by a raiding aeroplane which came over\n\n26th.Just as we got to bed last night there came a knock at the door & in rushed Capt Mc Kenzie, Mr Beckett Mr Champion & a few more, they were very excited, all things were happening & they had a lot of orders’ Freddie Turner had to get up & go with the transport to Bazentin and draw bomb ammunition sand bags & etc, this made\n\nFreddie swear for he was pretty crook but up he got & want after them, the Capt had a big map of the sector & he showed us where our present front line was as near as they knew, & he said they were not in contact with them yet in places, everyone is very excited over the prospect of \"open order\" work again, it is much more interesting & there is far more scope of using your own head than there is in the ordinary trench warfare.\n\nI can’t understand why the Germans are abandoning their positions after fighting so hard all the summer to hold it, there must be some very good reason for the evacuation, I think our new guns have had a lot to do with it, they are out of the\n\nordinary, we are all itching to get up & see for ourselves what really is happening, for our blood is getting fired up with the tales.\n\nAnother \"order\" was that we were to pack all our \"valises\" at once & be ready to move at a moments notice carrying only our water sheets & overcoats & a liberal supply of \"iron rations\", so round we had to go & warn our platoons, & for a wonder they never squealed.\n\nWent to bed after this & about 2 o’clock we were pulled out again to unload the ammunition timbers which had just got back we pulled the whole Coy. out for this & they turned out fairly willingly considering the late hour, it did not take long &soon we were in\n\nbed again.\n\nWe have not moved yet but we are holding ourselves in readiness\n\nLast night the flash of the guns was very vivid & continuous, they are evidently keeping a good fire on them, prisoners which they are bringing in state that they are retiring for a distance of 25 miles to the rear & over a front of 50 miles this of course needs confirmation Last night our Q.M. had a box on with on with one of my wasters(Grey) Jack got to him & knocked him head over heels & every time he hit the ground Digby would pick him up it must have been funny.\n\nThe whole Coy. were fell in this morning for an inspection of rifles ammunition, gas helmets, steel hats & etc, & we issued to each man 2\n\nbombs, 50 extra rounds S AA. 3 sandbags per man, & iron rations which consist of 1 tin of bully beef a small tin of tea & sugar & biscuits, these are only to be used in cases of emergency, & only on the order of an officer.\n\nEvans & Grey were up again today they have both lost there their steel hats & they made no attempt to replace them Capt Mckenzie gave them a great talking to.\n\nThere is a heavy bombardment going on tonight the guns are raging properly, & flares are going up in all sorts of unexpected places away back in our rear the heliograph is going, so there must be something doing, they must have located the enemy & are pouring the explosive in to him\n\nAll sorts of yarns are coming down some say that the 9th Batt had 150 casualties last night & nearly all abdominal wounds, & they reckon our chaps are pushing on grandly then again we hear tales of the big guns with their muzzles pointing towards the sky so as to get their greatest range, & the field guns are pushed further forward than our firing line used to be, but they could not fire on account of not knowing where the enemy are.\n\nPlenty of drunken men knocking about tonight its disgraceful the easy way in which they seem to get the grog, its time the authorities put their foot down on the canteens selling it to anyone who comes along with a chit signed by an officer, but very few of the\n\nchits are signed they are practically all forged, theres nothing aggravates me more than a drunken man coming home kicking up an infernal row in the huts Sir Douglas Haig was through here today I believe & a lot of French officers, old Fritzs actions have got them all thinking, according to a report received late tonight we are still advancing, but the only opposition met with comes from machine guns & snipers\n\nBellchambers took over the S.M. again today, Turner having gone to the Batt Quarter Masters.\n","53":" Marched out of Fricourt Camp this afternoon with an extra 50 rounds making us 220 in all & 48 hours rations a pretty heavy load I can tell you, & we were heartily pleased\n\n \n\nwhen we shook our packs off just as the twilight was fading As we neared our old firing line we could see the results of our advance for the field guns were pushed up almost to our old line & the dumps had also gone forward, everyone seemed to be in a hurry darting here & there with all sorts of things. We met quite a lot of the 3rd Batt coming out. I noticed one chap with a very fine German pistol Our guides led us into one of the most remarkable places as ever you saw in your life \"Eaucourt Abbaye a place everyone must have heard of she is nothing but a mass of shell holes torn broken & twisted timber & iron, one has to see for himself before he can fully realize the terrific shattering power\n\nof the high explosive, if you could only see how the iron implements such as ploughs, harrows, &, wagons & etc are thrown about for you know the old monks used to do a lot of farming in the old days & the Germans had a light railway running through it now the rails are all torn up & the trucks piled high & smashed to pieces while there is enough timber lying about to supply a fair sized town for a year You would wonder where on earth the guide was leading you for all one can see is a mass of broken bricks & shell holes, but suddenly the leading men disappear & down we go down a long flight of stone stairs which led into a long narrow room one end of which was portioned off into rooms, & the other\n\nled into a long tunnel & here & there branched off little rooms, one of these rooms seem to have been used as a cookhouse since the war started for there is a fine big fire place & a smoke stack leading to the top, there are tunnels in this old joint that they reckon lead to Baupaume, our engineers are working on it now, where we are living is fully 70 ft below surface altogether she is a most mysterious place & the Germans fixed her up quite comfortably. I have been in a few queer old places but this takes the bun, in some of the rooms there are any amount of bunks tables & chairs & one time she was lit by electric light, & she is 3 storeys deep some place alright & there was a terrific fight for it as the number of \n\nof dead lying about go to prove just outside the wood there are 2 Tanks which have been smashed they, by the looks of things had been following a big German trench up for they are both astride it. I’ll bet they done some dirty work before being put out of action, one trench they had crossed was a very powerful one for it was full of big dugouts, & the German dead were lying very thick, in one place 3 of their bombers were lying across one another, with their belts full of bombs, & one in each hand. A machine gun must have spoilt their little game, during our stay here we buried all the dead & put little crosse’s up, Germans included After we had our tea every available man was called out on \n\nfatigue, the work was carrying rations & 500 tins of water to the","54":" Batt Hqrs & a weary trip it was for the ground was wet & sticky & after we left the duckboards we were continually walking round shellholes & dodging the dead who were lying thick in places, its wonderful how soon one gets hardened to the sight, & after a little while he takes no more notice of dead men than he does of a rabbit, its a cruel thing to say but nevertheless its true. I do not mean to say that a man loses all feeling & sympathy, let a man get a bad crack & you will find that the boys handle him as tenderly & as quietly as any man or woman, but once a man is dead all we say is \"poor devil\", & as like or not\n\njust dump him over the parados for the time being, & that’s the end of it.\n","55":" Slept in till 9‘ oclock this morning & then had breakfast. after this Bill Bayne & I went hunting for souvenir’s. I have scoured the country for miles & miles looking for these \"oyster bombs\" which the Germans have, but I have never found one yet, but if perseverance will succeed I’ll have one.\n\nSome of the boys got some good souvenirs off the Germans in the shape of revolvers, watches, rings & etc, but I don’t believe in the way some of them go through the Tommies & our own chaps you can find letters photos & such things all over the battlefield.\n","56":" Fatigues as usual & nothing much doing except dodging stray 5.9s which the Huns keep on throwing over\n","57":" Today I went over & had a look at the \"Warbencourt Butte\" a joint everyone I daresay has heard of. She is nothing more than a great heap of chalk & clay which seems to spring from nowhere for the surrounding country is fairly level, this Butte has been taken & lost about 5 times & all around shows traces of the terrific bombardment which it has been subjected to by both English & \nFrench\n Germans, the dead of both sides lie thick all around the Butte I went up to the top & from here one can get a good view of a lot of the \n\ncountry held by the Germans we could see our shells & shrapnel bursting all along the German line & in the \"Toupart wood\" the timber looks untouched as yet she will be a hard nut to crack I’ll bet.\n","58":" Ive lost my notebook so I will have to write from memory up till the 10th but nothing of any importance has happened except an attack on the 3 rd &","59":" Batts by the Huns, it happened this way, the morning was very thick with mist, so old Fritz thought he would have a go to get Le Barque & Tuilloy Ligny back again so he sent out several strong & numerous parties these by some means or\n\nother managed to get between our \"advanced posts\" & support line, here was a pretty mess for our boys could not fire on them for fear of hitting their own men the Germans broke into the support line & bombed Hqrs dugout killing 1 Officer & wounding several more, they grabbed a few prisoners & started off back again, but a 3rd Batt. officer noticed them coming through the mist & he signalled to our boys who were prisoners to lay down, soon as ever they did, he opened on them with machine guns & cut chunks out of them they accounted for almost the whole & the remnants they took prisoner in this case it was the biter bitten, I believe the officer in\n\ncharge has been recommended for a decoration, there were 3 big parties all told & they were all dished up, a rather fine performance, another fine performance was put up a few nights ago by a","60":" Battn chap it appears that a big German patrol captured him & the officer in charge of them held a pistol to his head & threatened to blow his brains out if he did not lead them to our next post, the chap did as he was told & when they got about 10 yards off the post our sentries halted them and sang out who are you what did the Australian do but throw himself flat on the ground & yelled out Germans\", at this the whole post\n\nlet fly with rifles & machine guns & wiped nearly the whole crowd out they counted over 40 dead left on the ground. I reckon that was a brave deed.\n\nWe never went into the line this time for some reason or other but stopped at Eaucourt Abbaye done fatigues.\n\nThey are piling the guns on to this part of the line properly I know of one little sunken road between a great German dump & the Abbaye where there is a gun for every 10 yards & it must be a good ¼ of a mile in length.\n\nOn the","61":" we had a fairly heavy fall of snow but it did not lay on the ground long, but a cold bitter wind followed for nearly 24 hours after it.\n\nOur Battn came out on the 6th & we finished up in one of the Bazentin Camps after marching a mile or so out of our track.\n\nI carried a great big shell round with me which must have weighed 14 or 15 lbs she was a walloper. \n\nWe left Bazentin early next morning & pulled up at our old Camp at Fricourt, where we are at present.\n","62":" My birthday Spent it in Camp for it was fairly cold & it took us some time to get tidied up again after coming out of the line\n\n8th Parade today & the ground nice & hard for it froze during the night. Got a few more reinforcements today.\n\n9th Went for a bath today & we badly needed it for \n\nwas badly needed\n was the first since Baizeau & our clothes were getting rather soiled as you may guess we got a sort of a change, they were not too clean but they were better than nothing.\n\nWhen we came out of the line we thought we were going North to Armientieres or Belgium, but it appears that the Australians kicked up a row & refused to go for they reckon that now they have stuck the Somme all through winter & done a lot of fighting they reckon now they have started the Germans going they will stop here & take the good with the bad, for it can’t be very much long before Baupaume falls & we want to be in it, & quite right whats the good of going now\n\nfighting our way to within less than 2000 yards, the Canadians were supposed to be relieving us but I believe it is cancelled now I reckon our heads are quite right in the stand they have taken in respect of the move, that is if the rumour is true.\n\n10th Yesterday all the platoons we reorganized again & I think it is a pretty sound principle they are working on.\n\nWe also started our band a drum & fife hope they make a success of it for you cant beat a band\n\nCapt McKenzie called me over today & told me he had put my name in at \"Orderly Room\" for me to be sent away for a month or so at a Base to do some Instructors work for he\n\nsaid he reckoned I had earnt a spell, hope it comes off, it would do me down to the ground.\n\nToday all the bombers were split up & they made a fine row over it All C. Coy bombers were shot in the clink for missing parade, whisky has got a lot to do with this state of affairs, its scandalous the way they are getting the dope, they reckon in Albert its nothing to see 20 men staggering away each with a case of spirit on his back, it would be alright if they would only behave themselves, but no they sing & swear all night you can hear some of them arguing a mile away.\n\n11th We are having a church parade this morning the first for\n\na long time, I dont know where we are going to hold it, She is nice & sunny & the ground is drying fast.\n\nOur rations are a little short lately & the Sergts (all hungry dogs) are generally a day in front of their issue & worst of all we cant buy any bread for love nor money. Yesterday was pay day again \n\nHad old Mac for our parson on this morning’s church parade & he preached quite a good sermon General Walker & Leslie were also there, they were to have made an inspection of our huts but they have not done so as yet.\n\n12th Was busy writing letters last night when someone said there is an officer wants to see you. I looked\n\nup & it was George Vaughan I was glad to see him & I had quite a long yarn with him.\n\nCapt has been shaking the men up properly of late & the Coy wanted it too, the huts are real good now of a morning. Had charge of the platoon this morning for Mr Champion has been away to a Gas School for 3 or 4 day’s\n\nA big Orderly Room on this morning & I had to give evidence on the bomber’s case\n\nMy platoon got a new Lewis gun this morning\n\n13th Bellchambers came home very drunk last night, I think the officers must have poured a lot of whisky down his neck, he is very crook today & has only been up once. I took\n\nhis place & had a cut at S.M. Great excitement last night straightening our platoon rolls up, for from now on, every morning the platoon Sergts have to hand in 2 parade states one to the S.M. & the other to his platoon officer so we have to keep our hands out of our pockets from now on.\n\nThe Dr inspected the Coy today to see if they had any \"Scabies\" I think he got 2 out of my platoon that showed signs of them and had an inspection of iron rations I don’t think they got any at all in our Coy, they got quite a lot in A Coy & they all got 10 days C.B.\n\n14th Marched out on the Bn parade ground this morning\n\nbut we did not stay long for it rained fairly heavy, so we were dismissed & had to carry on with \"machine gun instruction\" in the huts.\n\nThere has been a lot of rivalry lately between A. & C Coy. over their platoon drilling & etc so this morning each platoon selected their 6 best men & they were put in a \"special squad\" & they shaped real well, so there is a promise of a competition coming off.\n\nA few of us went over to the Y.M.C.A. hut tonight to see Charlie Chaplin & a concert which was being run by Old Mac. What a man he is a man can’t give him too much praise absolutely the finest man in the Division\n\nhe is the life & soul of the 1st Brigade, he is known & respected by nearly every man in the A.I.F. Had 3 of my platoon go to hospital this morning.\n\n15th Marched out to a new parade ground this morning & practised our new formation in battle order the platoon shaped very well & are coming on fast.\n\nWhile we were out there a lot of Lancers came cantering across the ridge with their sabres drawn & flashing in the bright sunlight. I think a German must have escaped from the \"cage\" somewhere or other. In the afternoon the whole Coy. marched out & went bomb throwing, one of our new chaps nearly settled Mr Champion & I\n\nhe was evidently frightened of it & instead of letting it go when his hand was highest over his head, he let his hand come to low & it struck the parapet & bounced I thought she was going to roll back into our trench but luckily she stopped on top now we all crouched low down in the little T sap waiting for the explosion & concussion at last off she went & she nearly lifted our heads off, it was a lucky escape, that’s the worst of these new hands they have not have had sufficient training & and are therefore frightened of a live bomb\n\nJock was out instructing the mob how to fire Mills grenades with the aid of a rifle from the shoulder, they are a bonny idea\n\nI tried one myself, they do not kick nothing near as much as one would expect from the look of it We also showed the men the different types of smoke bombs & how to handle them, some of them are very good & produce dense clouds of dark yellow smoke these are used principally to cover an advance, or to throw in enemy dugouts.\n\nTonight I received a cable from home wishing me many happy returns of the 9th , my birthday I was quite surprised pleased to receive it, I answered it straight away\n\nAll last night there was a terrific bombardment & it is still going on tonight, there will be some dirty work up\n\n \n\nthere again shortly I’ll bet.\n\nLast night Hqrs. sent round & wanted to know the number of men in the Coy. who had never been to England. \n\nThis morning No. 12 had the best hut in the line. She looked real nice everything nicely stacked & mess tins bright & shiny, there is great rivalry among the various platoons over this.\n\nThere was a big explosion about a mile from here this evening, our chaps destroying a lot of German ammunition which they had collected.\n\nOur parson has been missing for nearly a week now must have gone on the \"booze\" I think no one seems to know anything about him & I know \n\nhe’s fond of his drop of drink, all the same he is a very fine chap & you could not help liking him\n\n16th Took our football out on parade & we had a bit of fun with it during our \"smoke oh\"\"\n\ntoday General Leslie inspected the \"Battn cookers\" there has been great rivalry between the different Coy’s especially between C & A. the \"cookers\" of all the Coy’s were a credit to them you could shave yourself in the brass work, it was polished that well, however no decision was given for the General reckoned there was nothing between them and you should have seen our \"Quarter Guard\" mount\n\nspecial pains were taken to get them up as well as possible we even had \"irons\" brought over to smooth the hats & tunic collars out, some Guard I can tell you the Adjutant said they were the best Guard that has mounted since coming here, Jock Mackie had charge of them Jock made a bloomer or two where the \"old\" & \"new\" Guard were changing, but it is a ticklish thing taking charge of a Guard, I am not looking forward with any great amount of pleasure to my turn at the job, the whole Battn, you might say looks on & critizes while the Guards are changing.\n\nWent to the pictures tonight, they are quite close, they showed\n\namong others, pictures of Australian scenes & seashores & I can tell you they brought back old memories\n\nOur band was out for the first time tonight they played \"tattoo\" on the Bn parade ground\n\nThis afternoon we had some interesting work, we all fired a number of shots with the Lewis gun, & then practiced with the rifle grenades, its wonderful how such a small charge will send the bomb such a distance\n\n17th St Patricks day round once more & she is a beauty. Am Battn O.S. today but there is very little doing for C & A Coy. are away all today A Coy took their \"cooker\" out with them & made a day of it\n\nHad the best news today that we have had for a long time.\n\nMr Champion hurried round with a map in his hand & showed us where the 5 th Div had advanced during the night & captured Baupaume, Bieuvillers & Le Transloy what a splendid victory for the Australians, as far as we can hear they were driven back twice in front of \"till trench\" but the boys attacked the third time & had a great victory I am very glad that the 5 th Div had the honor of taking Baupaume for they had a severe setback at Fleurbaix last July & besides they are our sister Battn\n\nAll day long streams of cavalry have been pouring through\n\nAlbert on their way to Baupaume & a lot of our Light Horse among them, everyone seems more satisfied now that we have got Baupaume after all the hardships & battling on this Somme we all feel now that our losse’s have not been in vain for was not Baupaume the British objective & it is a great honor for the Australians to be the first to enter her\n\nAll our movements have been cancelled for the present & we may move up North now, we don ‘t mind that so much now that the Australians have got hold of Baupaume\n\nThe Germans had quite a day out I believe they brought 8 of our planes down, one of\n\nfell on our barbed wire entanglements but luckily the airman was not injured, he clambered out & made off for the road & soon a car & some mechanics turned up to put her right\n\nThere was rather a peculiar accident at Longueval; today one of our chaps was blowing rats out with cordite, when he struck an old German mine & up she went, blowing 7 huts to smithereens & killing over 30 a rather unfortunate accident.\n\n18th Yesterday afternoon the 1st Battn played the Trench Mortars football & beat them 3 to nothing Capt McKenzie refeered the game he is a card & would make anyone laugh.\n\nLen was up today & he brought\n\na small match box with him which the German prisoners made at their \"internment Camp\" they are very nice & I am getting a few more of them.\n\nThis evening all C coy Sergts were invited over to the Officers Mess for an evenings fun, so over we went, the evening started off with the usual toasts & then followed \"dinner\" which was very good, after dinner more toasts & so they went round, at first some of them were cunning & only sipped their whisky but soon all was changed & they were tipping it down wholesale I think the Capt set himself out to get the R.S.M. (George Gould) drunk & he succed-\n\ned admirably, for George was speechless about 10.30 & old Bell & Mr aBeckett were keeping him company, they tried to get me to drink the whisky but nothing doing, it would take a good man to make me drink against my will After dinner we had a card party & finished up about 11.45 we all had a most enjoyable evening & had some fun, the Sergts who were present were R.S.M. Gould, R.Q.S.M. Turner, C.Q.M.S. Hayes, C.S.M. Bellchambers & Sergts, Mackie, Price, Graham, Hunt & myself, the officers Capt McKenzie, Lieuts. Page, Champion, Gallagher Davis aBeckett & Webb, theres not many officers would do this but our officers are sports\n\nThis morning the 1st 3rd & 4th Battn’s were on parade together General Birdwood was having a look at us & was going to present the medals to all those who had won them in the Div, the Brigadiers of the 3 Bde’s were present including our old Colonel Hean the man who held Pozeries for the first 2 day’s, he looked well. After the Service General Birdwood gave us a short address & told us about how our 5 th & 2 nd Div took the great one time fortress of Baupaume, he said all the Australian Divs who have been on the Somme can write Baupaume on their colors & he said he guessed there \n\nwere no prouder people today in France than the Australians & as he said justly so, he also said that the Commander in Chief had sent a cable to Australia congratulating Australia on the great victory which had fallen to her troops, it was worth all the hardships & losses to have the honor of taking Baupaume, even though it was not heavily garrisoned, the boys had to fight pretty hard for it, I should like to be in Australia when they get the news I guess they will be pleased, but no more than we are Ill bet.\n\n19th Had a good easy morning practicing the new formations the men shaped well\n\nBut the best fun of all was the football match between the platoons I had a game the first time since leaving Tasmania for you know they play all Rugby in N.S.W & I know nothing about it, but I thought I would have a shot this morning, I was offside nearly the whole time otherwise I held my own with them, she was a rough go, officers & all taking part in it, when she was in full swing the Major came along & when he left the Capt stopped the game, we all wondered why, but it appears that Capt Edgeley complained to the Major that C Coy who were playing football in the drill hours\n\nwere making his men pay no attention to their work. what do you think of that, didnt the boys roar, called him all sorts of pretty names.\n\nOut again in the afternoon but we did not do much, only a short Coy. movement, the Coy. in attack, when we came back we heard the best news that has come our way since the war started, the advance of the French & British on an 82 mile front, that’s the way to stick it into them.\n\nOn parade this morning the Major read an order from the Commander in Chief, complaining about the way we have been saluting, \"not up to the scratch\" but they will have their work cut out I guess\n\nif they are going to try & enforce this saluting on us, this is about the 4.0 th time they have complained about this most important duty, but I don’t see any improvement. Starkey was made a Sergt tonight.\n\nSaw one of our newest aeroplanes this morning. they have 3 wings & can turn almost any how & climb almost straight up in the air.\n\n20th Heavy rain fell last night & a high wind blew the whole time, but this morning it is nice & sunny, it started to snow heavily about 6 but did not last long.\n\nNo parade this morning but we had an inspection of kits\n\nin our huts.\n\nSat up late tonight playing Bridge & after that we made some tea & showed one another tricks & etc with string & so on\n\n21st Jock Mackie went away as billeting N.C.O. this morning.\n\nThe company had a bit of stiff luck again today hanged if No 9 platoon did not have an accident with bombs again one chap had his hand blown off & hit all over, the steel helmets saved the other chaps life for a certainty for the pieces of steel went right through the steel & entered the skull if it had not been for the helmet he would have been killed as dead as a door nail, lucky there were not more casualties \n\nthe concussion from the bomb blew one of the chaps teeth in.\n\n22nd Moved off from our huts this morning, & before we left our parade ground Major Jacobs who had been temporarily in charge of the Bn, said goodbye to us for he is going over to England to join the new Div, they are forming (the 6 th.) one & all of us are sorry he is leaving for he is a jolly good fellow, & since Woodforde has been away we have had a pretty good time.\n\nArrived at Ribemont pretty tired, it was a very slow march just crawled along, went through Albert she is getting quite lively for the civilians are returning fast\n\nshe is now out of the range of all except the very heaviest of German guns, & they very seldom shoot into her, the streets were crowded with lorries & soldiers & the heavy traffic made quite a decent rumble in her narrow cobbled streets, it was snowing heavily as we went through, but no one seemed to take any notice of it for all were busy on some thing or other, just after we got clear of Albert the snow came down in blinding sheets but we never stopped marching though we were as white as a sheet all over but snow is much better than rain for you can knock it off & not get wet.\n\nReached Ribemont about\n\n1 oclock, got our billets & men fixed up, drew our blankets & rations, had a wash & brush up & then Bill Hunt, Price & Bell & I set off down to the big canteen which is at the railway station, it was still snowing heavily but that never stopped us, went down & had some tea & cake & brought some things back with us.\n\n23rd Last night we spent a couple of hours with the French people who own our billets, we (the Sergts) are going to dine in their dining room, that will be alright for us.\n\nLovely & sunny this morning & all traces of the snow has disappeared.\n\nLast time we were here the\n\nold clock in the little church was stopped & had not moved for a long time, but now she is going & keeping good time a German prisoner said he could fix her so they let him have a go at her, he fixed her alright.\n\nOne of our Corporals is in lucks way he is going to England for 6 months instruction\n\n24th This morning I went to an Instruction class on Musketry a Tommy Sergt was was giving it, he was not bad, but one of our Corporals practically blinded him, the Tommy got a shock, Jock Mackie was sent to it first but he had an argument with the instructor &\n\nwent back to the billets, just like Jock, argue with anyone, so this morning I took his place & put the day in at it.\n\nGot our new Colonel today he comes from the 4th Bn. & does not bring too good a name Stacey’s his name, when Major Jacobs went away our band played him out to the tune of Auld Lang Syne. \n\n26th. Last night all the clocks were put on an hour, so we lose an hours sleep by it.\n\nSunday again & we had a Brigade Church Parade, but could not hear a word, where we were, right at the rear of the Battn.\n\nAfter the parade was dismissed there was a football match between 1st & 2 nd Bns\n\nofficers, our officers had bright blue Guernseys & white knickers the 2nd Battn yellow Guernseys with a bright red stripe running from shoulder to shoulder, there was a fair crowd there & Lieut Colonel Mc Kay referred the match they played Union Rules, it was a far more even game than the scores indicate (6 to nil) for the 2nd Battn scored just at the beginning & end of the match, it was a very willing go & caused a lot of excitement In the afternoon the rank & file of the 1st & 2nd Battns had a match but the 2nd are no class for our fellows they romped home scoring 15 to 3, we have a very good team & the other day licked our officers easily. after\n\nthis match, the 3rd Battns & the Brigade Trench Mortars had a game which the 3 d Battn won I was not there to see the game of the day between the","63":" &","64":" Batts, for after dinner the whole Coy with the exception of those who were playing football marched down to Heilly for a bath. & it was well worth the trouble, it was bonzer, we scarcely have wished for a nicer day for the sports than it has been, the sun was shining all day & there is a very decided feeling of Spring in the air, all sorts of birds especially the larks have been singing sweetly all the day & the air seems laden with a subtle kind of sweetness which always heralds the coming of\n\n \n\nSpring, & this combined with the band music made a very enjoyable afternoon.\n\nIn the evening we had a great spread for the Sergts of C Coy entertained the officers & we had a great spread, the French let us have their front room & lent us tables chairs plates glasses & anything that would be of any use to us in that line, we started off at 6.30 & had a good tea after that the grog came on & then the fun commenced, toast after toast went round until some of them did not know whether they were standing on their head or feet. Sergt Starky was the first one to go they made the pace too hot for him, when everything\n\nwas going merrily Mr Page suddenly leaps off his seat & grabs hold of his thigh I thought he must have sat on a pin or something, when the laughing & giggling died down a little he explained that he had the cramps in his leg, more laughing & plenty of offers of assistance to rub him down & etc, but we fixed him up after a while & the game proceeded, then followed some recitations & pretty hot ones too, & afterwards songs & stories, altogether we had a most pleasant evening, & I think it will be remembered by all of us for many & many a day to come of course according to Kings rules & Regulations this sort of thing is altogether wrong\n\nSuch as Sergts entertaining & meeting officers on almost level terms & vice versa & I dare say unheard of in the English Army, but it is a jolly good idea for it brings the officers and N.C.Os together & they understand one another all the more & instead of being bad for discipline I think it is the reverse\n\nRight joining our dining room is Colonel Milligans room of the","65":" Battalion, it’s a wonder that he has not asked us to move for we are pretty noisy at times\n\nThere is some talk of Mr Beckett leaving us tomorrow I hope he doesn’t for he is a very fine officer & admired by all throughout the whole Battalion.\n\n"}}