{"Document Name":{"0":"Diary_0091","1":"Diary_0091","2":"Diary_0091","3":"Diary_0091","4":"Diary_0091","5":"Diary_0091","6":"Diary_0091","7":"Diary_0091","8":"Diary_0091","9":"Diary_0091","10":"Diary_0091","11":"Diary_0091","12":"Diary_0091","13":"Diary_0091","14":"Diary_0091","15":"Diary_0091","16":"Diary_0091","17":"Diary_0091","18":"Diary_0091","19":"Diary_0091","20":"Diary_0091","21":"Diary_0091","22":"Diary_0091","23":"Diary_0091","24":"Diary_0091"},"Date":{"0":"unknown","1":2042.0,"2":2050.0,"3":2051.0,"4":2052.0,"5":2053.0,"6":2054.0,"7":2058.0,"8":2059.0,"9":2060.0,"10":2061.0,"11":2062.0,"12":2074.0,"13":2075.0,"14":2076.0,"15":2077.0,"16":2078.0,"17":2079.0,"18":2080.0,"19":2082.0,"20":2083.0,"21":2084.0,"22":2086.0,"23":2087.0,"24":2088.0},"Entry":{"0":"\n\n","1":"\n\nSince Monday last we have been going along splendid at times with a good breeze behind and a calm Sea then the Wind would change to the Port side, the ship \nwo\n rolled and pitched very little and the Ladies on board soon recovered from their Sea Sickness, and moved about their portion of the Ship (Aft). The Ship’s Guard is supposed to block any soldiers except them with Wives on board from going down Aft, but the rule is generally broken and all and sundry promenade down Aft if inclined, I for one after I finish of an Evening, clean myself and go down for a chat with two married couples, the married Men are allowed to see their Wives from 6 am until 10 Pm when they must come back forward and the Women to go down into their Cabins, but I believe several sleep on Deck as it is too hot and close, in the Cabins and they are somewhat crowded. There is a Piano Aft and they all enjoy themselves playing & singing, and often the Band which play’s very well, gives them a Programme, sometimes in the morning, or the Afternoon, so they all fare very well. We soon lost the English Twilight, only having it one night at Sea & then it soon got dark, about 8 Pm, Our Good Ship is making good headway doing on an average between 320 to 330 miles every 24 hrs. Yesterday morning at 5 am we passed the Canary Islands and this morning the West Coast of Africa came into view and we are approaching the Equator\n\nand it is getting very hot, and several Windsails are down into the Deck’s likewise The Engine Room, we expect to cross the line about Tuesday next and make Durban our first port of Call in about a fortnight from today. The boys who sleep on the deck and not under the Tarpaulin coverings, wake up in the morning to find their blankets quite wet with the heavy \ndue\n dew which falls very thick in these parts, it is a job to walk about after dark as the Lads sleep everywhere, it is very hot and stuffy down in the lower deck’s, my hammock is slung downstairs alongside of the Hatchway and it is fairly cool all night, we have our Portholes open all day but have to watch when the ship rolls, to close them up, on Tuesday last it was a bit rough and several boys were playing Cards at the Mess Tables when without any warning the Ship gave a lurch and the Sea rushed in several portholes and what a ducking several boys got, their Cards were washed away and themselves drenched, and what a cheer and a laugh they got from the others, they had to change their clothes, but took it all in good part, as it is part of the life on a Troop Ship. A Sport’s Commitee has been formed, also a Concert party who are organising Sports of all descriptions and the Concert Party make their first appearance next Tuesday Evening, as \ntheir\n there is a good piano on the Hatch above our Deck and it is played all day and impromptu Concerts given by the Boys which all helps to pass the time away, it is quite a treat now \nhave Evening\n travelling along of a night with lighted Ship\n\nand not a dark one which was necessary during the War, and not in dread of Submarine’s, and there is quite a stir when a Ship passes us, lit up and looks well, up to date we caught and passed two Steamers making for South Africa, last night one passed close to us and Signal’s by light’s were exchanged. If we are fortunate enough to have good weather during the voyage we will arrive in Durban on the","2":" and stay there 48 hours when no doubt the Troops will get leave \nShore\n to go ashore, if the Influenza is all clear on board and in the Town, up to now the Health of the Troops is first class, and then after a ten days run, arrive at Fremantle, that will be July 24th which will mean 32 days from Devonport , the Skipper of the Boat passed the word along for nobody to hang or sit on the Rail’s as he does not intend to stop to pick any body up who falls overboard, as it is his first trip in this Boat to Australia and he desires to make a record run. The food supplied to the Troops is a good quality but the quantity is very light, and complaints are made at every Meal to the Orderly Officer, but with little effect, the cheese and Butter, Jam, Bread, is sufficient and very tasty, but the Dinner and Tea serve is always very light. \n","3":"\n\nSince last Saturday we have been jogging along very well maintaining a speed between 300 to 330 miles every 24 hrs with fine Weather and a steady Sea and all hands being in good health.\n\nAs we approached the line it became hot and sultry making sleeping and having our Meals down below very uncomfortable and at all times, one was glad to get up on deck for a blow. Sunday Afternoon we held our first \"Diggers Court of Injustice\" an idea for the purpose of raising funds for the Sport’s which will be held during the voyage. This Court is a very laughable affair and humorous. The Judge, a very witty Man, who is a Solicitor in civil life, fills the position with great satisfaction to all concerned. The idea is to charge a soldier, \"Officer’s and Private’s\" with an imaginary offence, and inflict a fine from 5\/- up to £1, the Private’s were mostly the boys who run a Gambling School, viz. \"Crown and Anchor\", \"Two Up\" and \"Torpedo\" and being charged with Gambling on board have to pay as a rule","4":" to 10\/-. The Officer’s, were charged with something absurd or what they did not due, for instance \"Lieut Craig who married General Birdwood’s Daughter was charged with \"Larceny\", that he purloined General Birdwood’s Wing and bringing her on board, had to pay £1 for his offence, another Capt was charged with bringing Ginger Mick, meaning his little red headed son and keeping him in a little space railed off on the Promenade Deck which the Diggers Christened \"On our Selection, & who is a great favourite amongst the boys, this Capt had to forfeit £1., another Capt was charged with \"Entering an Alien Country, Scotland, and\n\nmarrying a Scotch Lassie and having her on board and sweetening her with Chocolates\". These charges when read out caused roars of laughter, and of course when the £1 fine was paid caused a cheer and a clapping. Capt McIntosh who was proceeding to New Guinea was captured by the Raider \"Woolf\" and taken to Germany, and he was kept a Prisoner for 15 months, and looks very thin on his improsinment , he was charged with \"Being on the Raider Woolf and stealing a Woolf Skin Coat and squaring the Hun by promising to make all the Mackintosh Toffee they \nindecipherable\n require\", he was fined £1 and his charge caused a hearty laugh and the payment of a fine a cheer, in the two trial’s held just on £20\/-\/- has been collected and a lot more has to stand their trial and pay up at a later date. Last Tuesday Evening the Ship’s Concert party gave their first concert down Aft, but it was a Wet night and a strong wind blowing, it was not a great success. I only remained for a little while, as it was too wet, and came down stairs and played Card’s until Bed time, it was raining on and off all night, and we appeared to be passing through the tail end of a storm, and the boys mostly had to sleep down stair’s, during Yesterday Wednesday \nit\n we crossed the line in fine and cool weather travelling due East with a good view of the Southern Cross low down on our right, from now onwards the Weather will be getting cooler as we approach the Cape and going \n\naway from the Sun. The Comforts in the way of Tinned Fruit and Biscuits also Sox’s issued by the \"Red Cross Comforts Fund\" are now being distributed to all hands on board, and are highly appreciated by the Boys. The Conservation of Fresh Water on board is very strict as the Commander wishes to get through to Durban, and the Water is turned off all day except an hour in the morning, Afternoon, and Evening and I being a Mess Orderly for our Table, I always have a Bucketful on hand to wash after cleaning up. The Drinking Water is on for the same time. Upstairs, Sports are being held but are so crowded and one has to get there early to obtain a view, what with, Sports, Trial’s, and Band Concerts the boys time is passed away very pleasant, and as for me, the time actually fly’s by. After I have finished cleaning up after Breakfast and Inspection time I generally go right forward and watch the Flying Fish going from the bow’s and gliding along the Water, there appears to be plenty about in these parts, during the Afternoon I have a nap for an hour or so, and play Cards and Draughts after Dark until Bed time.","5":"\ny","6":" Since last writing our average in mileage per day has dropped somewhat, partially due to adverse Currents and strong headwinds and for the last 3 days our speed has been under 300 miles per day, on Thursday we passed Ascension Island\n\na long way on our right and yesterday St Helena Island away on our left, and now we are making straight for the Cape of Good Hope hoping to round it this day week. The Weather lately has been cloudy and threatening but the rain has held off, It is cool all day long and more pleasant down below of a night to sleep and towards morning a Blanket is required. \nF\n Yesterday Saturday brought excitement for all on board,. Orders were issued for a Life Belt Parade at 4 Pm, and about that time the Siren blew one blast and all hands proceeded to their allotted posts, I took up my position on the lower Promenade Deck starboard side about 20 minutes later the Siren blew again and we all took it for the Signal that the Parade was dismissed, when all of a sudden the Boat stopped and word quickly went about that a Man was overboard on the Port Side. I hurried through the Saloon Entrance to the other Side and saw the Crew launching a Boat quickly from the Boat Deck, one chap told me that a Man had fallen from the Boat Deck above and a Life Buoy had been thrown to him. Our Ship by this time had formed a circle and making towards the Spot where the Man fell, in the meantime the Life Boat with 6 men were pulling strong against a fair Sea, the Siren blew several blasts evidently directing the Crew, word could be heard from the boys that they could see the Man swimming in the Water, after a lapse of 20 minutes a Digger is supposed to have seen him from up \n\nup forward and gave the alarm to the Officer on the Bridge. I as well as the rest was scanning the Water in the direction were the Boat was rowing, I then was told that the Man was on the Starboard Side and went over there, and saw that another Boat was lowered and going away and then I saw the Man swimming towards it, also two Life Buoy’s floating near him, but he did not trouble to use them, he swam to the Boat and was pulled in when a great cheer went up from aboard, he did not seem to be distressed \nfor\n after being in the Water about 30 minutes, and had got rid of his Boots and Singlet, in a few moments the Boat and all hands were hauled up aboard and a little later the other Boat started to return after a Signal from the Bridge \nand after\n and in 20 minutes was hauled on Board and we again started on our journey after a delay of about 1 hour. The man turned out to be one of the Ship’s Fireman who was taking up his Post \nwhe\n in one of the Boats when the Parade was sounded. As it was Tea time being 5 O clock I went down and drew the Tea for our Mess and afterwards at 7 O clock went down aft where a Dance for the Married Folks was going to take place. The Band on Board played splendid Music for the Dance and kept good time and the Young Couples soon were enjoying themselves, the Man who fell overboard came along and started Dancing and soon was a source of attraction\n\nbeing asked all sorts of questions of his experience in the Water, several of the Women danced with him, after staying there looking on but not dancing as my rope shoes were unsuitable I came back and had some Supper of Cocoa and Bread & cheese, the Cocoa with Milk in tins were given to us from the Australian Comforts Fund and Boiling Water is supplied between 8 and 9 O clock Pm from the Cook’s Galley I turned in at 10 Pm and had a good sleep rising this Morning at 7 am. After Breakfast word went about that the Man who fell overboard had been placed under arrest during the Night and was now in the Cells under armed Guard for threatening to strike the Captain and making an attempt to go overboard again and will be handed over to the Police and charged with some offence when we arrive at Durban. During the Morning Church Service was held on the Forward Deck and a collection taken up for the Mercantile Seamen’s Widow’s and Orphan’s Fund and a fair sum was given by the Boy’s. After Dinner a Cigarette and Tobacco issue was given to the Troops from the Australian Comfort’s Fund which was very acceptable. After Tea a Magic Lantern Picture Service was given down Aft and a good crowd joined in the Singing, and a Song Service Forward was held for the Troops and so passed a pleasant Sunday for all on board in good Weather.\n","7":"\n\nSince last writing we have been jogging along well in good Weather, but a little cold and the troops spent a good portion of their time down below. Friday \nbri\n at 2 Pm brought the Table Mountain’s of Cape Town into view away on the Port Side and caused great excitement on board, at 5 Pm we were opposite the Mountain’s but could not get a good view owing to misty rain, at 6 Pm we passed the Cape of Good Hope and later on we altered our course from South East to North East and all day Saturday the Ship rolled very bad owing to the Heavy swell towards the land which could be seen all day, and our Ship being light loaded, it was wet on and off all day and most of our time was spent down below. A Competition on our deck for the cleanest Mess and Utensils was \nh\n between Devonport and Durban caused some excitement amongst the Mess Orderlies, and my Mate and myself being Mess Orderlies for our Mess we did our utmost to get one of the Prizes, being 3 in all, First £2-10-\/0 Second 1\/10\/- Third 1\/-\/-, every day we polished our Tin Ware and knives Forks & Spoons and displaying them at the end of the Table where the Ship’s and Military Officer’s make the Inspection at 11 am each day. My Mess No 33 and 51 had been running very close in the lead all through, 51 display-\n\ning his Silver, Forks and Knives in the shape of the Rising Sun which always commanded a lot of attention during inspection, and my design was in the Shape of a Fan. The Chief Steward being the Judge, was expected down between Friday and Sunday. In my display lately I had added the small Jam Dish nicely polished which looked well. Yesterday Saturday the Steward came along and started to examine the other side first and finished up at our Table, and as I was the only one displayed the Jam Dish in the Competition, my Table was awarded the First Prize of £2-10-0, 51 Mess was Second and 35 was Third, both of us were congratulated by all the boys and when the Officer’s Inspection arrived also congratulated us on our work, during the Afternoon I received and order on the Canteen for the Amount in Cash, so we will have a good time ashore tomorrow Monday in Durban, as we expect to arrive there at 7 am, making the run from Devonport in a little over 21 days, which \nin\n is not too bad considering that the Ship had been laid up during the War, in a German Port. This is her third Trip to Australia, the first being in 1892 and she was the first large boat to turn in Fremantle Harbour. We cannot get her exact weight, but she is 648 Feet long and 60 feet wide, Twin Screw, and a splendid Sea Boat. The Weather today is very wild, with a good head Wind.\n","8":"\n\nWhen the boys awoke at 6 am, we were still jogging along at 12 Knots an hour with Land in sight and a strong head wind blowing, at 11 am long range of hill’s around Durban came into view and all hands were somewhat excited and large numbers dressed and all polished awaiting to go ashore, at 12 noon we rounded the Point and steamed slowly into Harbour having picked up a Pilot outside, we did not turn in the harbour but came right in and made fast to the Quay at 1 Pm. No Orders were issued about Leave and everybody was on pins & needles, awaiting to go ashore. Our Old friend Miss Campbell met us at the Entrance to the harbour with her Red & Yellow Flags signalling to us, the boys on board gave her a hearty cheer at their pleasure of seeing her once again. At 1-45 Pm the Married Couples began to go ashore down the Gangway Aft and the Diggers started to follow after being told by the Adjutant to fall in on Shore to march up to the Town. Naturally the Boys agreed but did not intend to keep their word, as soon as they stepped Ashore they made for the \"Jimfish\" for a Ride in their Rickshaw’s, while numbers boarded the Tram. Naturally I was amongst the number and managed to get standing Room at the back of a Car, and away we went passing several Boy’s with their Wives in the Rickshaw’s as happy and full of laughter, it being quite a novelty to the Women Folk. We all expected Cold Weather being the Month of July but were surprised to find it quite hot and clear.\n\nOn arrival in the Town a friend and myself made straight for the Municipal Bath’s to have a Hot Bath which we both enjoyed and then into the Post Office to send away two letters to England. Quite to our surprise the Hotel’s were opened to the troop’s, and they were soon busy satisfying the Boys, as it was very hot and Muggey, to my way of thinking it was a great mistake having the Hotel’s opened all day to the Boy’s as they had been unable to obtain any liquor on board and naturally several were soon full and making themselves a nuisance, it would have been better only to have opened the Bar’s from \n2 to 4\n 12 to 2 Pm & 6 to 8 Pm like they are in England. After having a couple of Drinks of Ale which was cool and of splendid quality and quite a treat, I left my friend and caught a Tram to visit the Friends Mr & Mrs F Joule I met on my previous visit. I found they had shifted up Country but happened to be in Town on a Holiday, and were staying in Beach Rd No 46. I returned and met them and had Tea and spent a very enjoyable Evening returning back to the Boat before 11 Pm, and turned in. \n","9":"\n\nLeave was granted all day to the Troop’s and from 6 am onwards they were going ashore, myself going at about 9.30 am, the Niggers were still busy Coaling the Boat and several Hose’s were putting Fresh Water on board and two large Steam Pipes which had been repaired were returned and taken down the Engine Room. At 11 am I again visited my friends and they came along into the Town with me, as I intend buying\n\nseveral Ostrich’s feathers and the Lady picking them out for me \nals\n as I was no judge of Feather’s and I wanted to obtain suitable one’s for my Wife, her Sister and their Mother also a Silver Chain Necklet and Broach for my Daughter, a little later I left my friends and went along to the Waverley Restaurant and had a good Dinner and left my Parcels in their care until returning in the Evening, and then met my chum at 2 Pm at the Post Office, and started out on a ramble, first taking a Tram and going up towards the Zoo and along Musgrave Road, having a beautiful View of the Town below and the harbour also the Racecourse, as the Weather was very clear it was a treat passing through the Residential portions of Durban enroute, on arrival back we went into the Wesley Hall were Ladies served us with Fruit and cakes and sandwiches of Tomatoe’s and Water Cress which I enjoyed very much, the Boys patronised this Hall likewise the West St Hut in large numbers all day, they make the Boys very welcome and see that they want for nothing in the way of Food. After signing the Visitor’s Book in the Hall, we boarded a Tram, & went along to the Beach and promenaded along the Pier which was crowded with Visitor’s from up Country, also numbers were in Surf Bathing. Ladies and Gentlemen, it was very amusing watching the Bather’s in the heavy Breaker’s enjoying themselves, we returned at 6 Pm for Tea and a little later went back to the Beach and spent the Evening strolling about, listening to the Band playing in the \"Rotunda\". We were getting tired of our wanderings and at 9 Pm made for the Boat after a light Supper and turned in.\n","10":"\n\nAs we were Sailing at noon leave was granted or rather the Boys were not stopped going Ashore, and large numbers were out early. After several Boys had got into Trouble through Drinking too much, the Hotels were closed all day Tuesday to everybody, but were opened early this morning, and the Boys were soon having a good time, at 11. am I was laying down as I did not go ashore, the Siren blew a first warning of Departure and the Boys started to return, the Siren blew several times and a Picket or Guard went ashore to round the Strays up. After 12 noon the fun started, Boys coming along tight and singing, as happy as the day is long, the Band on Board started playing, Good-Bye-e-e, and the Boys on Shore were dancing to the Tune. A large number of People came down to see us off including our old Friend Miss Ethel Campbell with her Bags of Oranges and she was throwing them aboard to the Boys, she gave us large numbers also on arrival. At 12-45 Pm the Boys Ashore would not come aboard, so the Gangway was pulled up & lowered several times and finally the Boat left the Wharf and anchored out in the Harbour, and the Boys still ashore came across on the Launch, at 2-15 Pm the last Launch full came out, also a Harbour Officer who sang out, \"There are still about 20 about the Town\". The boys shouted \"put horn’s on their heads and give them a Rickshaw\" the Officer answered \"We will keep them as Specimens\". After Semaphore Signals were exchanged we started on out journey to Australia, the Boys\n\ncheering the People Ashore and they returned it by waving. As we approached the Entrance Miss E Campbell was in her usual spot with her Flags and the Boys cheered & cheered her showing her their appreciation of her kindness. So we said our last Good Bye to Durban after a most pleasant sojourn there and all had a grand time everywhere and well received, I must thank the Municipal Authorities for placing the Trams at the boy’s disposal free of charge everywhere, which we all enjoyed. Time 4.30 Pm, we are now steaming along at 12 knots an hour and the \"Drunks\" are all down and out to it, sound asleep, all the boys in our Mess are on board, but 3 of the next are still ashore. Land is now out of Sight, and the Sea is very smooth and the weather clear and warm. Little did I think when writing about our farewell that it was to be our luck to have to return to Durban again, At 5 Pm word came down below that we had changed our Course from South East to due West and was making back to Durban, the reason was soon Known that one of the Fresh Water Tanks was full of Salt Water, due to the Tank when empty coming into Durban was refilled with Salt for Ballast and had been forgotten to be emptied before refilling with fresh. . At 6 Pm the Adjutant informed us that we would be in alongside again before eight Pm and Leave ashore would be granted until 10 Pm and again in the Morning until 12 noon and then\n\nall Troops were to be on board as we would Sail for certain at 1 Pm, the boys gave him a Cheer and several started to dress again, myself included, \nwe\n after picking up the Pilot outside we came in and at 7 Pm made fast once again to the Wharf. After the Gangway was lowered the Town Picket went ashore followed by the Troops. The Boys caught the Authorities napping as our hotels were opened and soon were filled and very busy. Two of us Myself and chum made for an Hotel and had a cool Glass of Ale and then caught a Tram coming out, as they would be quickly filled at the Terminus, the Tram was almost filled before it reached its destination, and soon started again for Town, the first Car was packed and on arrival the flinfish’s with their Rickshaw’s soon heard that we had returned and started in large numbers to make for the Boat, our Car passed them going full steam for a Fare, they looked a sight with their little lights and ringing their little Bell, we arrived at the Post Office at 8 Pm and caught a Tram for a run along Musgrave & Marriott Roads up along the Hill for a View by Night of Durban. All along Musgrave Road between the two Lines, Artistic Lawn’s with Flower Bed’s are planted making the Wide Road very Picturesque, as we climbed the Hill, the view became very interesting, and when going along the highest point, the Panorama view was glorious, the Lights all down below were very pretty Rows and Rows of arc Lamps could be seen running in \n\nall directions, no doubt it is a glorious sight and one of the many ways of seeing Durban, and should never be missed. in 30 minutes we were back again at our starting point well satisfied with our ride, the Conductor thought we had missed the Boat, and smiled when I said Durban had given us Salt Water to Drink instead of fresh, and had returned to change it. After a nice Supper of tomato Sandwiches, Cakes, Fruit and Tea at the Wesley Hall free of charge, we caught a Tram and went along to the Beach for a stroll for an hour. Large Crowds were still promenading as it was a beautiful Cool Evening and the Town Band playing in the Rotunda. We left the Beach at 10 Pm and walked down and caught a Tram for the Point where our Boat was lying and came aboard and turned in and had a good sleep.\n","11":"\n\nUp again at 7 am and after Breakfast I left the Boat at 8.30 am and by myself caught a Tram into Town and a little later one for the Botanical Gardens, meeting two friends on board, the ride to the garden’s is very pleasant, for a long way after leaving the Town the Tram climbs part of the Hill and travels along the side of the Racecourse, and all along the view of the Town and Harbour is interesting, in 20 minutes we were at the Garden’s and strolled through them and into the Cool Houses, not Hot Houses like \noat\n other Countries, the Palm’s and Fern’s all grow out in the open shaded by the Trees, the Soil is \n\nvery red and very fertile, the Lawn’s were very dry, and could do with some rain, still the Palm’s and Fern’s looked well. Altogether these Gardens are small but very pretty and well worth a visit. We returned to Town at 11 am and went into the West Street Hut for some refreshments and later caught a Tram back to the Point and came on Board. I made sure of a good position to see the Departure, sitting on the Raft’s near the Gangway, by this time the Boys were returning and thank’s to the Hotel’s being closed all came on board sober and in good humor, the usual crowd of nigger’s were soon alongside begging for pennies from the Boys, and caused great fun in their scramble for the Coin’s, between 12.30 and 1 Pm crowd’s of Civilian’s arrived to see us off once again, and our old friend Miss Edith Campbell was there with her bag’s of Oranges throwing them on board, they were nearly all caught, also the other Ladies bought Oranges from the Niggers and likewise threw them to us. Our Band started playing and kept it up until we left. Punctually at 1 Pm the Siren blew and the Gangway was being drawn ashore when along came two Diggers and their French Wives and received some cheering likewise some \nhootting\n hooting, the Gangway was soon out for them and when aboard, we started to pull away and the Cheering started from the Boat and also on the Wharf, where the Band started to play \"Home Sweet Home\" and \"Auld Land Syne\" and once again we\n\nwere off, the Anchor was dropped when in the middle of the Harbour and remained there until after 2 Pm. We all then went down and had Dinner and at 2.20 Pm the Anchor was lifted and we started away on our journey, Miss Campbell was there at the Point waving her Flag’s and also others and we gave them all a parting cheer and soon was out of distance and when the Pilot outside was dropped we started in earnest and the Troop’s settled down, some having a sleep and others reading. The Weather all day was close and Hot but once away from the Mainland a breeze sprang up and a heavy swell, causing the Boat to roll very much, soon upsetting the Boys and Girl’s, after Tea the Wind Changed from South East \nNorth East\n to North \nWest\n East and the spray was very heavy up forward and the Hatchways were covered over with Tarpaulin’s, and all Port Holes closed and screwed down, as we were in for a rough night.\n","12":"\n\nWe have been out 13 days from Durban travelling from 230 up 287 knots every 24 hrs, after we had been out 2 or 3 days two of the boilers in the Engine Room gave the Engineer’s some trouble which brought down the mileage, added to by \na\n heavy winds on the Port and Starboard Side and for over a week the Boat Tossed and pitched likewise rolled very much preventing all Sports and Dances being held on Deck, but still the Concert Party and Band gave several performances\n\nin different parts of the Boat, which helped to pass away a very monotonous time on board. A Diagram of the Course the Boat was taking between Durban and Fremantle was displayed and it gave us all a surprise as we all thought that our course would be straight across the Indian Ocean, instead of which a Course was started East by South East for 10 days which brought us to the South of St Paul Island instead of North, also a line was drawn each day shewing how far we had travelled each 24 hrs and it caused a lot of discussion how far we were and when we would arrive at Fremantle. After we rounded the Island which was last Saturday Morning our Course was altered slightly to East by North East bringing the winds more to our rear and making the Boat more steady and pleasant, \nand\n which gave the Sports Committee a chance to resume the Competitions likewise \na chance\n the Dancing amongst the Married Folk, Wireless Communication from Australia direct, also Durban and several Transport’s en route to \nA\n Australia was established and Messages were received from the Troops at 10d per word and several Messages were sent by the Boy’s to their Relatives and Answers received. My Chum and myself sent one notifying our Wives we would arrive on Sunday Next, this was in case the Authorities did not do so. As we are now only 3 days from Fremantle certain duties have to be performed.\n\nThe first duty or rather a rehearsal, which was a parade for Medical Inspection. All troops and passengers were ordered down below and the Officers were posted to positions all over the Ship, and at a signal all hands had to march upstairs on deck and two Officers counted them as they passed up the Stairs, this will be carried out when the Health Officer’s at Fremantle board the Ship on Arrival. Tomorrow Morning is Hammocks Blankets and Missing Utensil’s Inspection to see if anything is missing from the Troops Deck’s, ","13":" is our Mess Competition","14":" the Competition’s for the Prize’s for the best Mess will be decided on our Deck and this time four Prizes are to be awarded, 1st £2, 2nd £1\/10\/-, 3rd £1, and 10\/- for fourth. I am a competitor again and \nam\n giving the other Messes something to do to beat me this time, as I won the first competition, they are trying to prevent me from taking the 1st prize, and I am keeping them all very busy in polishing and cleaning up. The full particulars of the constitution of the Digger’s Supreme Court was printed as a Souvenir in Durban and sold to the Boy’s at 9d each, which I intend adding to my Diary Shortly as it is worth reading and very interesting. Up to date we have had very little rain but the winds are very cold and Overcoats are required of an Evening up on Deck. The Health of all on board is excellent having no \nseriouss\n serious illness and all are cheerfull.\n\nThe quality and quantity of Food for the Troops is only fair, but a large amount of Comforts from the Australian Red Cross Funds namely, \nF\n Tinned Fruit, Condensed Milk, Cocoa, and Biscuits and Sock’s have been issued and enjoyed by all. The Water arrangements have been bad, Washing Water only on at certain times, and now the Weather is cold, no arrangements have been made for a hot Bath, either of Salt of Fresh Water, there being no plunge Bath’s, and the Wash houses too drafty to bath in, the Troop’s will have to wait until they go ashore, and we all could do with a Bath before Arrival, and arrangements should have been made for these conveniences before we left London, a blunder was made somewhere, to their discredit.\n","15":"\n\nAfter Breakfast I with my mate was kept busy in cleaning and polishing the Cutlery and Dishes as the Chief Steward was coming along at 11 am to decide the Competition, and he duly arrived and after inspection he awarded No 51 Mess the first Prize £2\/-\/- and as he could not \ndecide\n separate the 4 other Tables, mine included, he awarded the 2nd 3rd and fourth prize equally amongst us, amounting to 15\/- each Table. I was pleased 51 Mess was awarded the 1st as they ran second to mine to Durban and fully deserved the 1st as they had kept everything clean all through the Trip, we all received our Prizes after\n\nDinner also all West Australian’s were paid £5 to £10- during the Afternoon. After Tea the Concert Party gave their first Concert down on our Deck, and the Artists were each given a good reception and thanked very much for their services throughout the Voyage. at the same time an Illuminated Address signed by over 1,000 Diggers \nalso by\n and the Married Women which was presented to Major OBrien, the Roman Catholic Padre who was well liked for his good work and attention to all the Boys on board, he \nwas\n spent most of his time amongst them and the Married Folk. In thanking us all for the Address, he made a happy and witty speech, and sang two Songs which we all enjoyed.\n","16":"\n\nAfter Dinner the boy’s were very anxious to see Rottnest Lighthouse, and all the Afternoon number’s were right forward keeping a sharp lookout. After Tea at 5-45 Pm a cheer rang out as someone sighted the Light and the Lookout Man then rang the Bell and we all came up to see the Light once again, we were making straight for the Light when it was sighted, so accurate we were in our bearing’s, at 7.30 Pm we rounded the Light and slowed down, when the Pilot Boat, The Lady Forrest came out to us and instructed the Captain to follow the Boat to an anchorage in Gage Roads which was reach at 8-45 Pm when we anchored for the night. All hands then turned in to sleep\n","17":"\n\nThis was the day we all had been waiting very anxiously for to arrive in Australia once again, and the Boys were up at daylight to see Fremantle, although we could see the lights when we arrived, but it was not like daytime. The Boys discarded their Deck Shoes for their Boots and \nwhe\n made a great clatter up and down the stairs. Breakfast was served at 6, am and Letters & Telegram’s which arrived during the Night was given out. At 7.30 am the Anchor was lifted and we steamed into the Harbour and again Anchored in the stream for Medical Inspection at 8.30 am after cleaning up and handing in all my Mess Utensil’s, I dressed and went up on deck, right aft as the Stern was close to the Wharf, at 9 am Inspection Call was sounded by the Bugler and all hands went down and stood at their Tables, and soon after the Medical Officer came, we had to file past and have our Temperatures taken and again went up on board, by this time a fair number of Fremantle People had arrived and were waving and calling out. At 10.30 all clear was given and the Boat started to come in alongside. I remained up aft and as there were a very large crowd along the Wharf, I could not pick out my Wife and Family, anyhow according to an arrangement I waved a large Red Flag which they all saw and were contented to await until we all came ashore. At 11, am the Troops paraded to the\n\nallotted positions and started to go down the Gangway, the Crowds cheering us as we came ashore, I estimated the number at 10.000 to meet us. Both ends of (E) Shed was kept clear, only the Headquarter’s Band, which played us home was in the enclosure, as we entered the Shed we \nhanded\n shewed our disembarkation Card and after putting down our Kit Bag’s we had to line up for another Medical and Tooth Inspection and gave up our Card and \nof\n signed a paper to pay 3\/- for a Railway and Tramway Ticket during our Military Leave, and passed out for Refreshments which was served by the Welcome Committee, then picking up our Kits, we went out by a Door and through an opening amongst the Crowd. It was a great struggle to get through, and questions were asked from all sides as to when \nand","18":" and so would come out. My Brother-in-law \nwas lucky\n who was watching for me in the Crowd, heard my name sang out and managed to find me, and taking a kit bag piloted me to my Dear Wife and family and \nfriends\n Relatives and it was a grand Meeting once again, my Wife had been very ill, but managed to come down, which cheered her up a lot, and my four Son’s and Daughter, I hardly knew them, they all had grown and all looked well, they were all around me also my Wife’s Mother and Sister’s and Niece’s were down to meet me. We all soon moved off towards the Station, as I had enough of the crowd and excitement. We left our Relatives at the Station and I took my Wife\n\nand children up for some Lunch, and caught the 2 Pm Train right through to Midland Junction to my home arriving there about 4 Pm, tired and after our day’s excitement, my Civic Clothes were all ready for me to wear and I soon discarded my Uniform for them, and was quite glad to be a Civic once again.\n","19":" \n\nI reported to Franci’s Street during the morning and received my Discharge, which was post dated to","20":" 1919, was given a round Badge, with a Crown on top, the Rising Sun and A. I. F. in the Centre with the following words around the Side’s \"Issued by Dept of Defense. Returned from Active Service\". The Badge is of Brass and it is very neat. Away into another Building I was given a Suit of Civic clothes of fairly good material and neatly made.\n","21":" \nI a\n\nI again reported to Headquarter’s and, was given a paper to state that 75% of my Deferred Pay was placed to my credit in the Bank, and the balance would be available when my Paper’s arrived from London.\n","22":" .\n\nI obtained a Paper from the Railway Dept to proceed to Perth and be Medically examined by Dr Blanchard which I did so, and passed as fit to resume my occupation as an Engine Driver in the West Australian Government Railway’s. and was given a paper to hand in to the Office \n","23":"\n\nOn handing in the Paper, I then was given an order for my Railway Holiday Pay, one day for each Month I was on Active Service which amounted to 32 day’s, also my Railway Watch which I handed in when I enlisted, then I proceeded to Perth and received my cheque also a Free Pass for myself, Wife and Family from Aug 12th to September 17th 1919, And made arrangements to resume Duty \nmake\n on Sept 1st instead of","24":"\n\nOn Sept 10th 1919, I cease to be a Soldier of the Australian Imperial Force’s after serving for 2 Year’s and 345 day’s. And I honestly confess it has been the best 2 year’s and 345 days of my Life and I have no regret’s over inlisting, and putting the Bad times against the Good Times, the latter by a long way outweigh’s the former, I honestly Thank God for giving me strength \nto be\n in carrying out my Duties and sparing me to return to my Dear One’s once again, also I have enjoyed the best of health and had a splendid Education and a Grand Trip and a very pleasant one whilst I was a Soldier in the Australian Imperial Force’s\n\nWorking on the Railway’s of France and Belgium as a Locomotive Engine Driver\n\nDoing my Bit for the Cause of Civilisation & Freedom.\n\nSo at last I have finished my Diary of my Life as a Soldier and I trust it will be as great a pleasure to whoever Reads it in the day’s to come, as it has been to me to write it.\n\n"}}