{"Document Name":{"0":"Diary_0007","1":"Diary_0007","2":"Diary_0007","3":"Diary_0007","4":"Diary_0007","5":"Diary_0007","6":"Diary_0007","7":"Diary_0007","8":"Diary_0007","9":"Diary_0007","10":"Diary_0007","11":"Diary_0007","12":"Diary_0007","13":"Diary_0007","14":"Diary_0007","15":"Diary_0007","16":"Diary_0007","17":"Diary_0007","18":"Diary_0007","19":"Diary_0007","20":"Diary_0007","21":"Diary_0007","22":"Diary_0007","23":"Diary_0007","24":"Diary_0007","25":"Diary_0007","26":"Diary_0007","27":"Diary_0007","28":"Diary_0007","29":"Diary_0007","30":"Diary_0007","31":"Diary_0007","32":"Diary_0007","33":"Diary_0007","34":"Diary_0007","35":"Diary_0007","36":"Diary_0007","37":"Diary_0007","38":"Diary_0007","39":"Diary_0007","40":"Diary_0007","41":"Diary_0007","42":"Diary_0007","43":"Diary_0007"},"Date":{"0":"unknown","1":1076.0,"2":1077.0,"3":1078.0,"4":1079.0,"5":1080.0,"6":1081.0,"7":1082.0,"8":1083.0,"9":1085.0,"10":1086.0,"11":1087.0,"12":1088.0,"13":1089.0,"14":1090.0,"15":1091.0,"16":1092.0,"17":1093.0,"18":1094.0,"19":1095.0,"20":1096.0,"21":1097.0,"22":1098.0,"23":1099.0,"24":1100.0,"25":1101.0,"26":1102.0,"27":1103.0,"28":1104.0,"29":1105.0,"30":1106.0,"31":1107.0,"32":1108.0,"33":1109.0,"34":1110.0,"35":1111.0,"36":1112.0,"37":1113.0,"38":1114.0,"39":1115.0,"40":1116.0,"41":1117.0,"42":1118.0,"43":1119.0},"Entry":{"0":"\n\n","1":"\nMaking incinerator at A.D.S. Watching 6\" Naval Guns at work. Another busy day in the air. Fritz ventured a little too far but our anti aircraft guns firing 11 pounder shrapnel soon drove him off.\n24th November (Friday)\nPreparing to move out to the line up to 1 p.m. then we commenced our tramp through mud rain and water. Passed a very striking Indian train of waggons & limbers, so clean looking for the \n\nbad conditions on the Somme. We entered one side of Delville Wood & passed right through it on to the crest of a hill about 1½ miles distant from the wood, with Flers over to our left. There are 4 posts altogether. One at the road behind Delville wood, where horse ambulances are in waiting. From here a duckboard track leads to a post at the other side of the wood. It would be impossible to walk through the wood carrying stretchers but\n\nfor the duckboards, so great is the disturbance of the ground. This wood is indeed a picture. It changed hands 18 times & even now there are limbs lying about everywhere. The track from the 2nd Post to where we are is very rough, the duckboards being very irregular. There is a valley, Death Valley, to cross and in here Fritz throws shells every day and night. This morning one S. Bearer from the 14th F. Amb. was killed near the valley and 2 were\n\nwounded. While we were moving out to relieve the","2":" shells dropped all round us blowing up the duckboards and throwing mud in all directions. Naturally we followed the wise course of steering in a semi-circle off the track. Our post consists of 5 squads of bearers, each squad containing 4 men. Small dugouts supply the necessary cover though not shell proof or even water proof, but we have a fine little fire-\n\nplace in ours and therefore are a bit cheerful. The timber comes from D. Wood.","3":"\nNo sleep last night. We just sat up and gazed at the fire. Carrying at night is something we dread hence not being able to sleep. Misty and light rain all day. One end of our dugout is under water. Fritz sent some more shells handy this afternoon.","4":"\nVery luck indeed during the night in the way of cases\n\nOur squad was not called out. I got about an hour’s sleep and didn’t hear the shell which burst a few yards from our dugout in the night. This morning we were busy carrying, likewise this afternoon. Today has been one of sensations for every hour or so Fritz threw the shells over. One landed 2’6\" behind us, another dropped in the doorway of our dugout while we were away. Gas shells, shrapnel and high explosives rained all\n\nround the crest but not a man was wounded. We were just taking over 2 stretcher cases at the time and didn’t know whether to stand still or move on. However we dived out through the barrage and were indeed lucky to escape with our lives. Stumbling, falling & panting we managed to clear the danger zone. Our relief was expected at the time & we passed them in the valley. Another trip back to our post had to\n\nbe gone through before we finally got out with all our gear. In crossing Delville Wood I met Clive Dunlop who told me that of their gun crew of 10 6 had been killed including Billy Wright. A cup of pea soup at the loading point was very acceptable. Wading along the roads knee deep in muddy water we arrived back at Bernafay Wood absolutely beaten for strength. Put into tent which had been erected on the mud.\n","5":"\nOff duty all day. Dull & misty. Long wading boots issued. Busy time in the air during a clearance in the sky temporarily. One of our planes came down in flames. In the night a number of German shells dropped close to our tent.","6":"\nNothing eventful today except that tractors are drawing all the heavy guns round about here to a position further back. Trench feet patients coming in in large numbers. Over\n\n400 today. Our unit is busy either carrying these men on their backs or taking them to Quarry Dump on the trolly.","7":"\nChopping timber for the A.D.S. fires from Bernafay Wood. The French join the British lines here & we were up alongside their trolly line in the wood.","8":"\nLeft again for duty in the line \nagain\n at 1 p.m. This time we are out at No. 4 post in a sunken road some distance past\n\nFlers, and to the right. On the way out we passed another abandoned Tank to the right of Flers. Met Benson, now a Lieut. in the 56 Batt. As soon as we reached our post business commenced. Three trench feet patients were there to be carried out. They poured in for hours & our 4 squads were carrying all night till we could hardly stand up. Today water will freeze if left in the open for an hour. The fog is also thickening. For days now the weather\n\nhas been bitterly cold and foggy.","9":"\nIn our last carry during the night we were lost for 2 hours. We couldn’t see our way for two yards in front of us. This morning the fog is still fairly thick. We haven’t seen the sun for days. The trench feet complaint is playing up with the Australians, and no wonder when men are standing in water up to their knees for three or four days, especially\n\nwhen the water is frozen day & night. All day the bombardment by our guns has been nerve-racking. Fritz has been dropping big shells all round our track and in places the earth is all churned up in a frightful manner right where we have to cross. Luckily enough our cases came just at the right time so that none of us were touched. This afternoon things got busy again. Fritz caught the 29th Batt.\n\nchanging over and about 30 were wounded (stretcher cases alone). This was the reason for our artillery opening up with intense fury, but after a term of comparative silence off they went again in a fearful din. Well, we were carrying till midnight and felt the strain very badly.","10":"\nThe rush last night lasted till 4 a.m. Twice the message came to our post from No. 3\n\nrequesting that something be done to afford a temporary relief. The bearers were completely knocked up, staggering along with stretcher after stretcher. Never have I seen men more exhausted, since the memorable march in Egypt, as I did last night. We now learn that Fritz attacked, hence the second bombardment and the extra wounded. We simply had to continue but were informed that we \nwould\n shall be relieved\n\nin the\n this morning. (11 a.m.) Relief arrived but they might have \nbe\n waited till the usual time (mid-day) because we are now doing nothing. All the patients have been cleared. The exertion last night temporarily upset me but I am now alright. On our way back to headquarters at Bernafay Wood we were hurried on by a few high explosives which fortunately fell wide. Met Dunlop again. During the\n\ntime we have been out, viz. 48 hours, we have had no sleep. It has be cold indeed. The frost was never off the ground & ice is even now 1\/2\" thick on water. Sheets of ice lie on the ground everywhere. We all felt sorry for the wounded in these cold conditions.","11":"\nOff duty till about 2.30 then given a job of carrying iron from the railway to the A.D.S. for the new huts which\n\nare being erected. Still bitterly cold. Mud is frozen \nthat\n so hard that we can walk across the surface easily.\n4th December (Monday)\nAssisting Engineers in erection of new huts at the A.D.S. and unloading timber from waggons. Big mail arrived including that which we thought to have gone down with the Arabia. Parcel from Scotland. Shells falling pretty heavily\n\non the 4th F. Amb. nearby. The 1st F. Amb. have arrived with the 1st Division to relieve the","12":"","13":"\nThe strength of the 15th F. Amb. is such that our unit had to reinforce them yesterday with 40 men. We likewise will need to be reinforced when our turn comes. Stretcher bearing at A.D.S. carrying patients from Amb. waggons to Dressing Room and returning them to\n\nMotor Ambulances. We were on duty till 8 p.m. Fritz put some heavy shells over near the railway a few hundred yards off and pieces flew over near our tent on the hill.","14":"\nStill bitterly cold. All day carrying duckboards from the railway to A.D.S. Leave roll h as been altered so that the new men who joined us in Egypt will have to go last. This will considerably raise my turn from\n\nNo. 120 as hitherto.","15":"\nCold. All morning preparing for our trip to the line again. New arrangements have been made whereby we do 3 days in and 3 out. Left at 1 p.m. and took over No. 2 post situated in Delville Wood. At the present moment I am sitting in a dugout 8’ x 10’ of 4 bunks, a few pieces of timber & iron overhead – a petrol tin for fireplace, tin of whale oil with piece of\n\nsandbag for wick, bayonet to chop wood. Of course we do our own cooking etc. German dugouts & remains of German equipment surround us in this mangled wood. For the past few days there have only been 6 patients but tonight we started off with the usual push, mostly trench feet.","16":"\nWe were called up a few times during the night. Misty rain this morning & a little\n\nwarmer than usual. Playing cards & writing to pass the time away. Very few patients coming through. Hot drinks at No. 1 post.","17":"\nIn the early hours Fritz shelled the road behind Delville Wood pretty heavily & set fire to an ammunition Dump. The effect looked very fine as the atmosphere was thick with fog. This Dump isn’t very far from No. 1 post (The loading station)., A raid took place during the night\n\nthe idea being to ascertain Fritz’s machine gun emplacements. As usual it was a failure but few casualties resulted. Today misty rain is falling and we have only been called out once. Our eyes are aching with the smoke from the fire. Another case just before midnight.","18":"\nWe were not called up again last night so had a good sleep. The atmosphere cleared a little and heavy shelling took place. Fritz dropped high explosives to\n\nthe right & left of Delville Wood. Our artillery were busy bombarding Bapaume. We were watching our shells bursting over that town. The tower was knocked a few weeks back. Returned to Bernafay Wood by the new duckboard track passing under one side of Trones Wood. Camped in Bell tent. Drizzling rain.","19":"\nNo duty today. Reinforcements arrived for the 14th F. Amb. Raining and cold. Good coke fire going in our tent.\n","20":"\nSnowing when we awoke. It beat into our tent when we opened the flap. Everywhere the surface of the ground is miserable what with the previous mud and water and this morning’s addition. Occasionally the snow would cease and rain take its place, then sleet would assume command. All day these conditions prevailed and a cold wind also. We were out in Bernafay Wood after timber for the\n\nfires at the A.D.S. One of the 14th was wounded in the head and face at the R.A.P. this morning.","21":"\nRaining in morning. Moved out to occupy No. 4 Post at 1 p.m. Major Gen. McKay spoke to us on the way out. We were kept fairly busy till late at night. The tent covering across a sap, which constitutes our shelter, with a few stretchers to lie on, proved a rather unsafe position. Pieces of shell came through and the smell of powder\n\nwas at times almost unbearable.","22":"\nBusy before breakfast and all the morning carrying patients out. Word came per one of our squads to say that wounded were lying in all directions between No. 4 Post and the R.A.P. Needle Trench, so our party, No. 3, set off in the face of Terrific Shell Fire and soon came across a trench where we were sadly needed. In this trench two men\n\nwere blown to pieces and others were wounded. Only one man was there to be carried out so two of us jumped into the trench & got the man out from his difficult position and put him on the stretcher. No sooner was this done than Fritz rained the shells all round us. They hit the sides of the trench and splashed into the muddy ground only a couple of yards off. It was a case of getting this man away and nothing else\n\nso we scrambled out with the stretcher and raced for our lives along the duckboard track. Many a shell came dangerously close – some smashed the duckboards up, but we got away untouched except that our clothes were smothered in mud. The patient had to be carried right in to No. 3 post so we were exhausted by the time we got back. On returning to our Post (No. 4, in the Sunken Road Gun Alley) our squad\n\nwas sent to the R.A.P. Here we got into a dugout with the A.M.C. Details of the 57th Battalion. We were not long idle – the wounded began to come in, commencing with 4 who were hit just near us in the same trench. Up to midnight we travelled backwards & forwards to No. 4 through mud up to our knees.","23":"\nFrom midnight to 5 a.m. we kept going and at one stage we were all exhausted but luckily\n\nthe rush slackened off. Huge shells burst round Needle Trench (our post) all day but nobody was hit notwithstanding that infantry were standing there in large numbers prior to moving forward to the firing line. A “dud\" fell into the trench where men were drying their feet but nobody got hit. The 58th M.O. put us to unnecessary trouble once by sending us in for 2 stretchers and again when he wanted a stretcher case lifted\n\ndown the German Dugout so that he wouldn’t have to get out. No mistake this medical officer had the “wind up\", as the saying goes, but he had little consideration for us. We waited close on an hour with shells falling very close and here was the doctor half way down the dugout, with the stretcher in as far as it would go, ducking every time he heard a shell. We were glad when a lull came and cases ceased to come in because\n\nwe felt run down after carrying continuously for 24 hours through shell fire. Heavy shells landed round us every time we were out. Once the duckboards were blown up in front of us, but many a shell burst in waterholes close by and splashed us from head to foot. From 5 a.m. until relieved at 2 p.m. we hadn’t a carry - Lucky for us, as the shelling was heavy. Returned to No. 4 post, had tea & got into bed.\n","24":"\nWoke up at 8 o’clock, not having been disturbed once. It was a treat to get our wet boots & socks off and have a sleep as we needed one badly. This morning the air is very clear and our Capt. Parkinson is fussy about keeping under cover. German & British planes are busy overhead. Fritz continues his heavy shelling. About midday snow began to fall lightly. Relieved at 3.30 p.m. after doing an extra\n\nhalf hour on the new dug out which is being made at this post.","25":"\nBitterly cold as usual. No time off to clean up. Put on fatigue work at the A.D.S. Xmas cake from home arrived last night.","26":"\nStill cold. Laying duckboards at A.D.S. and chopping out a tree stump. Fritz threw a few more shells near the railway line & also late at night.\n\n19th December (Tuesday)\nFrost & ice thick on the ground at daybreak. Getting wood from Bernafay Wood for the A.D.S. fires. In the afternoon snow fell making a rather pretty sight. Read out in orders this morning that the 8th F. Amb. bearers are to stay here and others at the posts are to be in by 4 p.m. It is our turn to go out to the line today, but apparently we are to leave the Somme Front now for a few weeks. The Division will be \n\nrelieved in a day or two.\n20th December (Wednesday)\nIce 1 inch thick on the water holes and snow lying on the ground otherwise it has been a beautiful day. The sun was out all day for the first time since we came to the Somme. Again collecting wood for the A.D.S. 10th & 21st Batts. of the 2nd Div. arrived. Gen. Birdwood acc. by an Archbishop from West Aust. spoke to us on the road. ","27":" F. Amb. have received their marching out orders. They\n\nleave at 8.30 tomorrow morning. We were informed tonight that we have to go to the line tomorrow & relieve the","28":" This comes as a knock out blow.","29":"\nDrizzling rain all day. The majority of our unit were put on fatigue work for the morning. Some of us, however, managed to dodge off parade. At 1 p.m. moved off to the line with the understanding that we are only going\n\nout for 24 hours. Took over Battery Post No. 3. New Dugouts have been built but the position nevertheless is dangerous because new batteries have been inserted close in front of us and close behind. Playing cards till 10 p.m. and were not called up through the night. \nOut of bed at 10.30","30":"\nOut of bed at 10.30 a.m. after a lively night with “chats\". We were preparing for breakfast\n\nwhen the 5th F. Amb. relief arrived. A patient came through at the same time and our squad had to carry him through. Sad news also came relating how Alick Gedwells and Nugget Bennetts were blown to pieces in Needle Trench. This was the dugout we were occupying on our last trip to the line. Orders read out stating that we move off tomorrow morning.","31":"\nUp at 6 a.m. Rush to have\n\nbreakfast and pack up by 8.15 a.m. Moved off at 8.30 and marched to the Quarry a distance of only half a mile. Here we entrained and left for Meault Siding a couple of hours later. Arrived Meault and got into Motor Busses thence travelled to \nVignacourt\n Olincourt Chateau some 30 miles off. We passed Corbie and Amiens arriving at Vignacourt about 3.30 p.m. after a cold ride in the motors. It was\n\nlike arriving home, to meet the rest of the Amb. again. The Chateau is situated in rather pretty country. We were given a fine welcome and they looked after us very well. Sleeping acc. was there for us and a good tea followed plus a big mail from Aust.","32":"\nA very beautiful day, the best since we came to the Somme. Spent some time cleaning up then went into the village of Vignacourt (3 miles off)\n\nfor a bath but no water was available. The meals today were extremely good. This evening the boys were singing carols and everything points to a Happy Xmas. A dinner has been arranged for tomorrow and we look forward to a good time. Carols and singing till after midnight.","33":"\nNo work today. At midday we attended a fine dinner in a\n\nbig tent which had previously been decorated for the occasion. Patients assisted our Tent Division men. Col. Shepherd is to be commended for having informed these patients that he wouldn’t discharge them till after Xmas Day so that they could attend the dinner. In the evening clouds gathered & rain fell but didn’t spoil the day. For tea the cooks provided another enjoyable meal.","34":"\n\nBoxing Day\nNo work again today. High class and rich meals again were the order of the menu. Strolled to Vignacourt & Flesselles. At 5 p.m., in response to a kind invitation from certain friends in the tent division 3 of us (bearers) were welcomed at a “banquet\" in one of the Chateau rooms. Everything imaginable was there in abundance, a surprisingly good table, and we heartily\n\nenjoyed ourselves, a few speeches and songs concluded the nights merriment.","35":"\nThe most beautiful and perfect day we have had while in France – not a cloud is to be seen anywhere. Put in app. for leave to Amiens. No duties today so we again broke up into parties and went for walks, our destination being Vignacourt again.\n","36":"\nNothing to do. Were to have visited the caves but conveyance not available.","37":"\nFilling water carts from 280 ft. well. 185 turns of the handle to haul up one bucket. French Battleplane landed in fields close by unable to face the gale which sprang up. We had a fine opportunity of viewing the machine.\n","38":"\nInto Vignacourt again for the day. Boxing tournament on tonight in the local hall, the Follies Show having disbanded temporarily. Went inside local Church.","39":"\nWriting all day otherwise things were very quiet. The weather for the past few days has been dull and drizzling rain.","40":"\nNew Years Day. Xmas\n\ncomforts from Aust. Distributed – Parcel for each man from Sydney A.M.C. Comforts, Plum Puddings and good meals. Good & highly amusing concert in the recreation tents tonight. The Colonel was so pleased with the first half of the program that he wishes the artists to give a show to the 5th Division Troops when they come back here.","41":"\nPulling down a hospital\n\ntent in the morning and re-erecting it in another part of the grounds. In the afternoon a party of 10 of us went for a trip to the famous caves near Naours where the refugees used to hide in time of invasion. These caves contain about 300 rooms – one cave being ½ mile long. A whole division of troops with horses, artillery and all transport could be put into these caves. The names of John Norton & Eva Pannett are to be\n\nseen autographed on the stone erected just inside the entrance.","42":"\n\nWent to the dentist in Vignacourt in morning and again in evening to have the temporary filling removed because it was giving trouble. Drizzling rain all day.","43":"\n"}}