{"Document Name":{"0":"Diary_0049","1":"Diary_0049","2":"Diary_0049","3":"Diary_0049","4":"Diary_0049","5":"Diary_0049","6":"Diary_0049","7":"Diary_0049","8":"Diary_0049","9":"Diary_0049","10":"Diary_0049","11":"Diary_0049","12":"Diary_0049","13":"Diary_0049","14":"Diary_0049","15":"Diary_0049","16":"Diary_0049","17":"Diary_0049","18":"Diary_0049","19":"Diary_0049","20":"Diary_0049","21":"Diary_0049","22":"Diary_0049","23":"Diary_0049","24":"Diary_0049","25":"Diary_0049","26":"Diary_0049","27":"Diary_0049","28":"Diary_0049","29":"Diary_0049","30":"Diary_0049","31":"Diary_0049","32":"Diary_0049","33":"Diary_0049","34":"Diary_0049","35":"Diary_0049","36":"Diary_0049","37":"Diary_0049","38":"Diary_0049","39":"Diary_0049","40":"Diary_0049","41":"Diary_0049","42":"Diary_0049","43":"Diary_0049","44":"Diary_0049","45":"Diary_0049","46":"Diary_0049","47":"Diary_0049","48":"Diary_0049","49":"Diary_0049","50":"Diary_0049","51":"Diary_0049","52":"Diary_0049","53":"Diary_0049","54":"Diary_0049","55":"Diary_0049","56":"Diary_0049","57":"Diary_0049","58":"Diary_0049","59":"Diary_0049","60":"Diary_0049","61":"Diary_0049","62":"Diary_0049","63":"Diary_0049","64":"Diary_0049","65":"Diary_0049","66":"Diary_0049","67":"Diary_0049","68":"Diary_0049","69":"Diary_0049","70":"Diary_0049","71":"Diary_0049","72":"Diary_0049","73":"Diary_0049","74":"Diary_0049","75":"Diary_0049","76":"Diary_0049","77":"Diary_0049","78":"Diary_0049","79":"Diary_0049","80":"Diary_0049","81":"Diary_0049","82":"Diary_0049","83":"Diary_0049","84":"Diary_0049","85":"Diary_0049","86":"Diary_0049","87":"Diary_0049","88":"Diary_0049","89":"Diary_0049","90":"Diary_0049","91":"Diary_0049","92":"Diary_0049","93":"Diary_0049","94":"Diary_0049","95":"Diary_0049","96":"Diary_0049","97":"Diary_0049","98":"Diary_0049","99":"Diary_0049","100":"Diary_0049","101":"Diary_0049","102":"Diary_0049","103":"Diary_0049","104":"Diary_0049","105":"Diary_0049","106":"Diary_0049","107":"Diary_0049","108":"Diary_0049","109":"Diary_0049","110":"Diary_0049","111":"Diary_0049","112":"Diary_0049","113":"Diary_0049","114":"Diary_0049","115":"Diary_0049","116":"Diary_0049","117":"Diary_0049","118":"Diary_0049","119":"Diary_0049","120":"Diary_0049","121":"Diary_0049","122":"Diary_0049","123":"Diary_0049","124":"Diary_0049","125":"Diary_0049","126":"Diary_0049","127":"Diary_0049","128":"Diary_0049","129":"Diary_0049","130":"Diary_0049","131":"Diary_0049","132":"Diary_0049","133":"Diary_0049"},"Date":{"0":"unknown","1":1246.0,"2":1247.0,"3":1248.0,"4":1249.0,"5":1250.0,"6":1251.0,"7":1252.0,"8":1253.0,"9":1254.0,"10":1255.0,"11":1256.0,"12":1257.0,"13":1258.0,"14":1259.0,"15":1260.0,"16":1261.0,"17":1262.0,"18":1263.0,"19":1264.0,"20":1265.0,"21":1266.0,"22":1267.0,"23":1268.0,"24":1269.0,"25":1270.0,"26":1271.0,"27":1272.0,"28":1273.0,"29":1274.0,"30":1275.0,"31":1276.0,"32":1277.0,"33":1278.0,"34":1279.0,"35":1280.0,"36":1281.0,"37":1282.0,"38":1283.0,"39":1284.0,"40":1285.0,"41":1286.0,"42":1287.0,"43":1288.0,"44":1289.0,"45":1290.0,"46":1291.0,"47":1292.0,"48":1293.0,"49":1294.0,"50":1295.0,"51":1296.0,"52":1297.0,"53":1298.0,"54":1299.0,"55":1300.0,"56":1301.0,"57":1302.0,"58":1303.0,"59":1304.0,"60":1305.0,"61":1306.0,"62":1307.0,"63":1308.0,"64":1309.0,"65":1310.0,"66":1311.0,"67":1312.0,"68":1313.0,"69":1314.0,"70":1315.0,"71":1316.0,"72":1317.0,"73":1318.0,"74":1319.0,"75":1320.0,"76":1321.0,"77":1322.0,"78":1323.0,"79":1324.0,"80":1325.0,"81":1326.0,"82":1327.0,"83":1328.0,"84":1329.0,"85":1330.0,"86":1331.0,"87":1332.0,"88":1333.0,"89":1334.0,"90":1335.0,"91":1336.0,"92":1337.0,"93":1338.0,"94":1339.0,"95":1340.0,"96":1341.0,"97":1342.0,"98":1343.0,"99":1344.0,"100":1345.0,"101":1346.0,"102":1347.0,"103":1348.0,"104":1349.0,"105":1350.0,"106":1351.0,"107":1352.0,"108":1353.0,"109":1354.0,"110":1355.0,"111":1356.0,"112":1357.0,"113":1358.0,"114":1359.0,"115":1360.0,"116":1361.0,"117":1362.0,"118":1363.0,"119":1364.0,"120":1365.0,"121":1366.0,"122":1367.0,"123":1368.0,"124":1369.0,"125":1370.0,"126":1371.0,"127":1372.0,"128":1373.0,"129":1374.0,"130":1375.0,"131":1376.0,"132":1377.0,"133":1378.0},"Entry":{"0":"\n\nMonday, May ","1":" \n\nstand to 6 A.M. fed up and had breakfast cleared up had shave wash. cleaned rifle for inspection which did not come off. went for two tanks of water. watered camels 11. had dinner 12.30. taube over aircraft firing at him never got him. rested till 4 P.M. fed up 5 and dug a trench to get in if the taube comes over. Put 3 Bales of tibbin on top. had tea 6 P.M. turned in 7 P.M. cool night.\n\nTuesday May","2":" \n\nStand to 5.30 A.M. cool morning fed up had Breakfast. Cleaned up got two camels dressed. taube did not come over had a good nights sleep. got fire wood rested till 12. had dinner rested till 2 P.M. went to Beach for swim very rough see 9 small vessels anchored out returned to Camp fed up had\n\ntea got word the taubes were coming over dug trench deeper filled Bags of soil and made a strong roof on it. on line guard tonight on 2nd Post-9 till 10.30. was woke up 9 P.M. there is a taube over all right dropping Bombs along the Beach nearly all the Chaps have gone to the Beach to sleep. they kept coming over all night had a bad nights sleep.\n\nWednesday May","3":" \n\nstand to 5 A.M. orders to move off. saddled five camels fed them had Breakfast and loaded my own camel moved out from Bir-Bola. 6.30 went out to Narkhuis well five mile where the Company was handed over the camels had dinner there 11.30.\n\nCold as ice & nearly Perished. orders to Be ready to move out 12.30. after a lot of fiddling about we moved away about ¼ to 1. trecked as far a Khan Junus unloaded and trucked camels hard work too. loaded all gear train left 4.30. we are jammed up on top of the gear like sardines not even room to spit over the side cannot get a sleep Blankets in the Bottom of the truck. one camel fell out of truck at El arish. we travelled all night reached a place called Khantara 6.30 Thursday morning.\n\nThursday May","4":"\n\nunloading camels and gear Kantara loaded up camels with our own gear and moved about 200 yards. came back to railway and unloaded a truck of spare gear went Back\n\nto camels Boiled Billy and had Breakfast a treat to get a cup of tea. a very large camp. moved off again 8 A.M. trecked along the Suez Canal for about 6 miles halted a place called Ballah. off saddled fed up. went across the line and had a good swim in the canal very hot day had dinner 12.30 rested till 3 P.M. camels watered. a war ship Passing through canal went over and had a look. Put down line to tie camels on went for another swim the water is Beautiful. another Big Boat is Passing through. there is a few huts here no doubt there has been troops here Before. there is Plenty of sand too. had tea 5 P.M. and turned in cool night.\n\nFriday May 11.5.17. \n\nStand to 4 A.M. fed up had Breakfast. Packed up and moved away from Ballah & trecked along Canal. Passed 5th Battalion I.C.C. travelled till 10 A.M. halted on the outskirts of Ismalia fed up had dinner. Packed up again 2 P.M. and moved off went about two miles. we have reached our Destination ferry Post. this is a rest Camp. we are going to rest here for a while right on the Canal and the Bitter lakes. off saddled Put down Camel line straightened things up and took Personal gear to a hut. it is a treat to see shower Baths again a man is far away from the noise of the firing line here had a good wash and a look around. Plenty of Beer here had a letter from\n\nJosie Maud Win also a S mail had tea on line guard the Boys are very merry too much Beer. we are camped in huts here also two Papers.\n","5":" May","6":" \n\nStand to 6 A.M. fed up went to lakes had a swim water was Beautiful had Breakfast rested till 11.30 had dinner rested till 5 P.M. had tea. went to canteen had a Beer very Bad Beer too. all the Boys are Pretty merry turned in 6.30. wrote to maud win Josie.\n\nSunday May","7":" \n\nStand to 6 A.M. fed up went for a swim had Breakfast rested till 11.30 had dinner rested till 5. had tea having a good rest here just now a man don’t get much sleep Before midnight.\n\nMonday May","8":" \n\nstand to 6 A.M. fed up went for a swim had Breakfast rested till 9.30 went for another swim had dinner 12.30 rested till 2.30 went down to the lakes and had another swim the water is Bosker fed up and had tea turned in 6 P.M. never had much sleep in the early Part of the night every one in this hut is kicking up such a row Toppin and Ritchie especially.\n\nTuesday May","9":"\n\nStand to ¼ to 4 A.M. had a wash and Breakfast and went away on fishing guard 6 A.M. Bosker morning. went in charge of two Boats. gipos in Boats fishing with nets fished till 12.\n\nhad dinner I am just looking on while they catch the fish. it got very windy 2 P.M. we made for camp cannot fish. The water got very rough 3 p.m. I got sopping wet. rifle was floating about in the Boat got nearly back it was that rough they could not row the Boats had to run them ashore and tow them back about a mile. got a good supply of fish for myself caught about 4 dozen. reported Back to camp had a shower and had tea turned in 6.30 P.M. issued with new Boots.\n\nWednesday May 16.5.17\n\nStand to 6 A.M. fed up went for a swim had breakfast nothing much doing here at present resting reading and smoking sleeping\n\n14.12.1918\n\nSOLDIERS’ DIARIES\n\nThe MITCHELL LIBRARY is desirous of Purchasing for the State Archives, ORIGINAL DIARIES of Australian Soldiers taking part in the Great War. Good prices will be paid for good material.\n\nAddress, Mitchell Library, Macquarie-street, Sydney.\n\nFor the Trustees,\n\nW.H. Ifould, \n\nPrincipal Librarian and Secretary\n\nand swimming it is the only way to Pass away the time. wrote some letters and Put them in. some one Picked one letter up Blowing away on the road.\n","10":" May","11":"\n\nStand to 6 A.M. fed up went for a swim had Breakfast cleaned up went to doctor to see about getting my teeth fixed up. rested till 12. had dinner rested till two. done some writing went on ¼ guard 3.30. had tea 5 P.M. turned in 9.30 windy night.\n\nFriday May","12":"\n\nStand to 6.30 A.M. had Breakfast and cleaned up. Still on ¼ guard warm morning am doing some writing to to day warm day had dinner 12. rested all afternoon was relieved from ¼ guard 6 P.M. had tea and turned in 7.30 very windy night. wrote to maud Shorter.\n\nSaturday May","13":"\n\nStand to 5.30. had shower and got Breakfast after a lot of messing about. got a Pass to go to Moascar to see the dentist. left camp 8.15 A.M. got in Punt crossed canal and walked in towards Ismalia. walked a mile got in a garry and drove to Moascar saw dentist could get nothing done told to come back Monday. went to Y.M.C.A. there had a read it was an awful day terrible windy the dust and grit would cut a mans eyes out. the Picture show was Blown down at Moascar while I was there. got a Bottle of Beer and went as far a Bridge got a gary and drove back to Ismalia where I got my dinner had a good feed had hair cut shampoo and a look around.\n\nI have seen this town before got a few P. Cards went to hotel had one Bottle of Beer sit there for ½ an hour went to photographers got some Photos taken had a talk with a french girl said she did not care about the Australian soldiers said they were too fond of Beer got a garry and came back to camp. the wind is awful trees blew down all over the town. got in the horse Punt at canal took nearly an hour to cross it was very rough. the Punt is pulled across by natives very hard work. arrived camp 5.30. was Put on ¼ guard had tea 7 P.M. was on guard till 10.30 turned in it is still Blowing.\n\nSunday May","14":"\n\nStand to 5.30 had a wash got Breakfast cleaned up am still on ¼ guard\n\nhad a look around. the wind Played havoc here all the huts are Blown all shapes some with roofs hanging some lop sided sand all over everything. a Big hospital Boat named Neuralia has just Passed along no doubt she is Bound for Australia. the company are moving out to day for a 2 week stint. I am remaining here till I get my teeth done. a fine hot day. the company has moved out. 12.30 had dinner 1 P.M. still on ¼ guard rested till 4 P.M. had tea turned in 9 P.M. cool night.\n\nMonday May","15":"\n\nStand to 5.30. had shave and shower was relieved from ¼ guard 6.30 had Breakfast. a Big Boat gone along. went to Moascar to the dentist got a ride in in a motor lorry got impression taken went\n\nback to camp through Ismalia a very hot day. had three drinks got a garry and went back to camp which Place I reached 1.30. had shower and had dinner. Pulled down two tents. rolled them up put them in the N.Q.M. store done some washing had a sleep till 5 P.M. had tea washed up. watched searchlight on a Boat in the salt lake. a cargo Boat has passed through turned in 8 P.M.\n\nTuesday May","16":"\n\nStand to 5.30. Put dixie on had wash got Breakfast got ready to go to Moascar to the dentist. there is always a lot of fiddling about to get a Pass. I Put the dental appointment in orderly room 6 A.M. and it is 8 A.M.\n\nnow and no Pass ready yet. They are as slow as snails. got Pass at 8.30. crossed canal walked into Moascar a distance of four miles. Saw dentist came back to Ismalia had two Beers had dinner and walked back to camp which Place I reached 2.30. had a shower and was sent on a Patrol rushing about everywhere looking for a camel and gear. the gear is all over the Place. left 4.30 went up along canal for five miles camped had tea and turned in at dark. very windy was awakened 9 P.M. raining like fun. Pulled Blankets over my head and slept till 4 A.M.\n\nWednesday May","17":"\n\nStand by 4.30 A.M. fed up had Breakfast. Packed up and moved out went two miles. we are looking for three spies that have crossed canal. Nakel is ahead of us we have to follow their tracks we came to the place where Patrol turned we saw three sets of Bare foot marks also a number of camel Pads which we decided \nto\n to follow. we set off due east following the foot marks we went five miles and lost the tracks the wind storm and rain the night Before have obliterated them. we came in tuch with the first Patrol returning they at 11 A.M.\n\nSaw gippo hare. followed the track 15 miles due east and they lost them said they got covered over by sand from the storm we had dinner 11.30 and returned to camp which we reached 3 P.M. unloaded Put camels away had a wash I was dirty too covered in sand. had tea 5 P.M. Biscuits and Jam a man is getting very little rations here. on line guard to night. on 3rd shift 1 till 3.\n\nThursday May","18":"\n\nStand to 5 A.M. rolled up Blankets went up to camp had shave and Bath had Breakfast had fish cleaned up done some washing went on q.m. fatigue got covered with dirt and\n\nand straw returned to camp had shower and got dinner 12. 1.30 went to Moascar to dentist got a ride in as far as Ismalia station had two drinks went on to Moascar saw dentist got my teeth he mended the old Plates returned to camp 5 P.M. had tea washed up and prepared to go on a Patrol got all ready and turned in.\n\nFriday May","19":"\n\nStand to 3 A.M. what a time to turn out saddled up in marching order and left camp 4 A.M. on a Patrol went 4 miles had Break\n\nfast and a hours rest. Proceeded 6 miles further along to canal towards a Place called where we halted and had dinner rested there till 2.30. Packed up and returned to camp which Place we reached 5 P.M. all clear had a letter from maud Jessie aggie Bell. had tea and wrote to Bell Croft turned in 10.30 very windy.\n\nSaturday May","20":"\n\nStand to 5 A.M. had shower cooked Breakfast and eat it. 6.30 saddled up in full marching order and watered camel left camp 7.30 am out looking for foot marks.\n\nThere is supposed to be spies Poking about we went due east till 11.30 and saw nothing had dinner we moved off again 12.30. went 6 miles in a circle could not find any tracks halted 4 P.M. had tea windy unsaddled fed up made bed on the sand am on the watch to night I am on last Post. turned in 6.30 P.M.\n\nSunday May","21":"\n\nStand to 4 A.M. Saw nothing of the supposed spies had Breakfast 5 A.M. Saddled up and moved away along the Barb wire entanglements. Saw a man on the sky line we made towards\n\nhim the going was very heavy when we arrived there it was only a Party of egyptian laborers taking up water pipes. We kept watch for 3 hours saw nothing had a look round there is a number of redouts here But they are all filled in with sand this must have been a very strong position at one time. we set off again went four miles and had dinner very hot day rested till 3 P.M. and returned to camp which Place we reached 5.30 P.M. had shower and got tea had a Paper from Bell Croft also a letter from dorrie Hawkly turned in 7.30 P.M. cold night.\n\nMonday May","22":"\n\nStand to 5 A.M. had Breakfast had shave done some washing wrote to maud Jessie aggie Johnnie tim dick auntie mae had dinner. rested all afternoon very windy had tea 5 p.m. turned in 6.30. went up the canal on outpost on 2 Post 11.30 till 1 A.M.\n\nTuesday May","23":"\n\nStand to 5.30 had shower had Breakfast done some washing rested all day and read Papers things are very quiet.\n\nhad a letter from Josie had S mail from maud & \n\nWednesday May \n29.5.17\n","24":"\n\nturned out 5 A.M. had Breakfast was warned for q.m. fatigue could not get a waggon rested till 10 A.M. was Paid £2. got new Pay Book \nhad dinner\n went to \nThursday May","25":"\n Canteen got some goods had a Beer Bad Beer was warned to be ready to leave camp 2 p.m. had dinner 12. got ready issued with five days ration left ferry Post 3 P.M. went ten miles to a Place called Serapeum which Place we reached 5.30 P.M. unloaded had tea and turned in windy night. wrote to Josie.\n\nThursday May 31.5.17\n\nStand to 5 A.M. am still at Serapeum had Breakfast went down to the canal had a swim the water was Beautiful went back to camp. there has been a large camp here at one time there is a large number of huts and stables here they are all falling down we are here for the Purpose of escorting a convoy out. had dinner, rested till 12.30 went to canteen had 4 Pints of Beer returned to camp went to sleep for an hour woke up and was sick. it must have been the Beer it is only rubbish. I wont drink any more of their draught Beer. I feel very dopy rested till 5 P.M. had tea. Packed up went to dry canteen\n\nand got some goods to take on the track. turned in 7.30 P.M. a Beautiful moon shining.\n","26":" 6.17, Friday\n\nStand to 3 A.M. Saddled up in full marching order reported to the convoy officer. we never had any Breakfast and the convoy is not ready had a lie down. we left Serapeum at 4.30 with a convoy trecked about 12 miles halted unloaded had Breakfast 11 A.M. rested till 2.30 very hot. Saddled up again 3 P.M. moved off 3.30 very heavy travelling went 10 miles and camped 6.30. unloaded fed up and had tea on guard to night on 9th Post 12 till 12.30. nothing doing.\n\nSaturday June","27":"\n\nMy Birthday to day.\n\nStand to 3 A.M. very foggy morning Blankets all wet fed up had cup of tea saddled up and moved off 5 A.M. the fog is very thick it is also cold I had to keep my great coat on trecked over some rough country went about 12 miles halted 11 A.M. unloaded had dinner. it is very hot now. rested till 3 P.M. Packed up again and moved off 3.30 we went over some rough country saw a hare went about 10 mile and \nhalted crosse\n crossed a stoney waddy halted and camped 6.30. saw some Bedouins fed up.\n\nUpacked and had tea 7.30 on guard to night No. 8 Post on 11.30 till 12 it is a rag time guard moonlight night.\n\nSunday \nM\n June","28":"\n\nStand to 3 A.M. fed up had a drink of tea Jam and Biscuits loaded up and moved off 4.30 A.M. trecked about 10 mile reached our destination a Place called gidie.\n\n8.30 A.M. seen convey in and on landing unpacked our own camels and had Breakfast. the country here is very rough all Bare stony hills it is high ground very hot had a wash the first for three days. there is a few tin Pot wells here watered camels rested till 11.30 had dinner 12.30 rested till 2 P.M. Packed up and moved off again 2.30 P.M.\n\nvery hot trecked 14 miles halted 6.30 P.M. unpacked and had tea on guard to night on No. 8 Post. nothing doing turned in again nice moonlight night.\n\nMonday June","29":"\n\nStand to 3 A.M. fed up and had breakfast. Packed up and moved off 4.30 went 12 miles halted 11 A.M. unpacked and had dinner camped under a tree an oak tree there is a few here. rested till 2.30 P.M. Saddled up and moved off 3.30 P.M. went 10 miles trecked till 6.30 and camped unloaded fed up had tea on guard on No. 3 8.30 till 9 nothing doing turned in 9.30 a full moon.\n\nTuesday June","30":"\n\nStand to 3 A.M. fed up had Breakfast there is a very heavy fog it is almost like rain. Saddled up moved off 4.30 A.M. trecked till 9 A.M. halted for ½ an \nd\n hour moved again trecked as far as Serapeum which Place we reached 12 oclock. very hot day unpacked had dinner rested till 2 P.M. went to canal had a swim. I wanted a wash Badly watered our camels had tea 5.30. fed up a nice moon is just rising 6.30 P.M. and I am going to turn in. I feel very tired to night we have traveled 120 miles to here in four days. went to the canteen got some Biscuits turned in 7.30.\n\nWednesday June","31":"\n\nturned out 6.30 A.M. had a good nights rest. had Breakfast fed up went to canal for a swim the water was Beautiful. Packed up and left Serapeum 9 A.M. went 12 miles to our old camp Ferry Post which Place we reached 11.30 A.M. went Past the canteen so I had a Bottle of Beer unpacked and had dinner 12.30. rested till 2 P.M. done some washing had a good shower Bath myself had tea 5 P.M. had a letter from win, maud shorter, also four Papers turned in.\n\nThursday June","32":"\n\nStand to 6 A.M. had a good nights\n\nrest had shower had Breakfast went on q.m. fatigue over to the ordnance got two waggon loads of ordnance finished 11 A.M. went to canteen had a Bottle of Beer a very good Beer to day had dinner 12.30 had a Plum duff. rested till 4 P.M. had tea 5 P.M. wrote to win and maud shorter had a Beer and turned in 8.30 P.M. cool night.\n\nFriday June","33":"\n\nStand to 6 A.M. had Breakfast had shave cleaned up got ready for rifle inspection. no inspection watered camels had dinner 12.15 rested till 4 P.M. went on ¼ guard 5 P.M. had tea 5.30. turned in 10 P.M. all clear.\n\nSaturday June","34":"\n\nturned out 6 A.M. still on guard had shower had Breakfast came back to guard tent read Paper till dinner time had dinner 12.30 returned to guard tent rested till 4.30 was relieved 5 P.M. had tea 5.30. nothing doing had a read till 6.30 and turned in 7 P.M.\n\nSunday June","35":"\n\nturned out 6 A.M. had shower had breakfast cleaned up and fell in for church Parade no church for R.C. rested till 12.30. had dinner. slept all afternoon a Big Boat has Just Passed through it has been a hot day had tea 5 P.P. on line guard to night on 3rd shift 11.30 till 12.30 camels were a Bit troublesome turned in 1 \nP.M.\n A.M.\n\nMonday June","36":"\n\nturned out 5 A.M. fed camels had shower had Breakfast 6.30 cleaned up went on a little fatigue 8 A.M. got a large tarpaulin out of a hut. Put it on a camel and left it at the q.m. store got a drink of Beer watered camels cleaned up the lines went for a swim the water was a little rough went to the canteen had a Pint of Beer had dinner 12.15. rested for a Bit. Sewed on Buttons. mooney has Just arrived from the Boob after 8 days. been a very hot day cool now. had tea 5 P.M. went to canteen had a Beer not much good turned in 7.30 slept well.\n\nTuesday June","37":"\n\nturned out 6.30 had wash had Breakfast cleaned up. fixed up saddle and saddlery for an inspection no inspection went for a swim had a good swim had dinner 12.15 rested till 3 P.M. went for another swim had tea 5.30. it has been a very hot day wrote to Joe Cohalan sent a field card to maud. turned in 7.30.\n\nTuesday June","38":"\n\nturned out 6 A.M. had a wash and Breakfast cleaned up. fell in for inspection 10 A.M. was inspected By Major Buzom fixing and unfixing Baynots also inspected saddles and camels went for a swim\n\nhad dinner 12.30 rested till 3 P.M. went for a swim water was Beautiful had tea 5 P.M. went to Canteen had 2 Beers. on line guard to night 2 shift 9.30 till 11 P.M. \ndo\n nothing doing turned in 11.15 P.M.\n\nWednesday June 13.6.17\n\nturned out 5 A.M. fed all company camels had shower and Breakfast done some washing rested till 11 A.M. went to canteen had three mugs of Beer it was very good to day had dinner 12.30 done some washing watered our camels very hot day rested till 5 P.M. had tea and turned in.\n\nThursday June","39":"\n\nturned out 5.30 A.M.\n\nhad wash and Breakfast cleaned up. they are Putting new roofs on the hut to day very hot rested till 11 A.M. went to canteen the Beer is very Bad to day had one mug had dinner 12.30 rested till 3 P.M. went for a swim had tea 5 P.M. \nd\n nothing doing turned in 7 P.M.\n\nFriday June","40":"\n\nturned out 5.30 had shower had Breakfast cleaned up they are very slow getting the new roofs on rested till 10 A.M. went for a swim. had dinner 12.30. very hot to day rested till 3 P.M. went for a swim had tea 5 P.M. turned in 7 P.M.\n\nSaturday June","41":"\n\nturned out 5.30 had shower had Breakfast cleaned up. they have not got the roof on yet those natives are as slow as snails read till 12.30. had dinner the heat is terrible to day. rested till 3.30 P.M. went for a swim on ¼ guard to night was not warned in time another chap fell in for me had tea got my tea and went on ¼ guard nothing doing turned in 9 P.M.\n\nSunday June","42":"\n\nturned out 5.30 had shower Breakfast. had a shave cleaned up and returned to the guard tent hot morning 8 A.M. rested till 12.30.\n\nhad dinner rested till 4.30 rolled up Blankets was relieved 5 P.M. had tea 5.30. turned in 7 P.M.\n\nMonday June","43":"\n\nTurned out 5.30 had wash had Breakfast 6.30 cleaned up fell in for rifle inspection 8.30 A.M. the roof is finished at last slept till 12.30 had dinner rested till 3.30 went for a swim had tea 5.30 turned in 6.30.\n\nTuesday June","44":"\n\nturned out 5.30. had wash and Breakfast there is a good number of Big Boats Passing up and down the canal lately rested till 12.30 had dinner.\n\nrested till 5 P.M. had tea nothing doing it has been a hot day very cool now. went to canteen had three mugs Beer it is a little Better. turned in 7.30 P.M.\n\nWednesday June","45":"\n\nStand to 5.30 A.M. went down fed camels had wash and Breakfast cleaned up had a read went on q.m. fatigue went to ordnance store across the canal had a wagon with four horses they could not Pull the hat off a mans head got a load returned to camp unloaded had dinner 12.30 rested all afternoon till 5 P.M. had tea went to\n\ncanteen had two drinks not very good Beer turned in 7.30.\n\nWednesday June 20.6.17\n\nturned out 5.30 went to feed camels they were fed had shower had Breakfast cleaned up read till 10.30. watered camels had dinner 12.30 reading all afternoon had tea 5 P.M. a cool day went down to canteen had one mug Beer turned in 7.30. the Boys are Playing cards for matches.\n\nThursday June","46":"\n\nturned out 5.30 fell in with blankets went and saddled up and exercised camels had Breakfast 7.15.\n\nhad wash and clean up fell in 8.30. went to Beach with camels give them a wash in the salt lake had dinner 12.30. rested till 3 P.M. got some Packing ready for my saddle had tea 5 P.M. finished stuffing saddle. turned in 7 P.M.\n\nFriday June","47":"\n\nturned out 5.30. went down and fed camels had shower and had Breakfast. fell in 8.30 for a rifle inspection inspected rested till 12.30 had dinner reading all afternoon very hot had tea 5 P.M. on line guard to night nothing about turned in had a good night sleep.\n\nSaturday July","48":"\n\nturned out 5 A.M. fed all camels had wash and Breakfast fell in 8.30 groomed camels till 10 A.M. then watered them had shower had dinner 12.30 got a Pass and went over to ismalia walked over very hot day had a rest in the gardens for an hour had a good look round had hair cut shampoo. had tea and went to Pictures good Pictures got a hot supper and walked Back to camp got home 10 P.M. turned in 10.30.\n\nSunday June","49":"\n\nturned out 5.30 A.M. had a shower the water is getting scarce they must turn it\n\noff had Breakfast cleaned up got ready for inspection which never come off rested till dinner time 12.30. had dinner rested till 4.30. got ready to go on South Patrol had tea 5.30. Saddled up went on Patrol 7 P.M. went up canal 5 miles met other Patrol camped for the night a cool night. was woke up 10 P.M. a cricket was on my face.\n\nMonday June","50":"\n\nturned out 4.30 A.M. saddled up and returned to camp 6 A.M. fed up and had a wash had Breakfast cleaned up got ready to\n\ngo to Cairo on leave fell in 8.30. got Pass and walked to ismalia could not get a ride it is a long walk 4 mile caught the 10.15 train the heat is enough to Bake a man. arrived in Cairo 1.30. I was mobbed By Boot Blacks and hotel Porter. if I had a stick I think I should have Banged a few of them went to anzac hostel got a Bed rested till 3 P.M. had my dinner and went for a tour around got lost got a garry went for a drive to the station went to the hotel for\n\nan hour had two drinks went Back to the anzac had tea and turned in. it is a hot night. it is a treat to sleep on a Bed again Between nice white sheets. met Sgt. MacKenzie.\n","51":"\n\nturned out 6.30 A.M. had shower and Breakfast went for a long walk with Sgt. Mac. Saw some Beautiful silk and Perfume went to the dentist made arrangements to have my teeth done the military dentists are no good they cant make teeth. had dinner 1 P.M. rested till 3 P.M. went for a walk met J.K. and D.P. went to\n\na Pub had a drink they have good Beer in Cairo all right. went to the dentist and had a try in went Back to anzac had tea turned in 10 P.M. hot night.\n\nWednesday June","52":"\n\nturned out 7.30 A.M. had shower and Breakfast got Boots shined up and went around to the dentist got a try in went to gabriels met J.K. and D.P. Put in an hour there also met Bill A. had tea anzac got in a garry and went for a drive went around to the – had a look round got Back to anzac 11 P.M. had a shower and turned\n\nin hot night.\n\nThursday June","53":"\n\nturned out 8 A.M. had Breakfast went to the dentist got my teeth. this man can make Proper teeth a Perfect fit. met J.K. went to museum this is the finest in the world saw all that was worth seeing. I felt a Bit creepy looking at the mummies saw Pharoah mummy he looked quite funny. returned to anzac had dinner went for a drive again lost J.K. and D.P. returned to anzac 4 P.M. had a good wash and had tea 5 P.M.\n\ngot cleaned up and left anzac 5.30 got a garry and went to Cairo Station. my leave has finished got a ticket caught 6.15 P.M. train. J.K. came on the Platform looking Pretty full arrived ismalia 9.30 got some tea got a car and returned to ferry Post 10.30. turned in feeling very tired.\n\nFriday June","54":"\n\nturned out 5.30 fell in for roll call 6 A.M. went down fed camels had shower and Breakfast fell in again 8.30 for rifle inspection moved camel lines some one Pinched my camel and saddle while I was\n\naway dirty robbers they have left me without a camel or saddle. watered camels 10 A.M. was dismissed. fed camesls 12. had dinner 12.30. rested till 4.30 P.M. had a letter from daisie Bell, Alma, agnes two from maud two from Jose one from Win had tea 5.30 turned in 7 P.M.\n","55":" June","56":"\n\nturned out 5.30 fell in went and fed camels had Breakfast 6.30 fell in again 8.30 to clean saddles. I had no saddle to clean cleaned up some rubbish in a hut where some one had Been having their\n\nmeals they went away and left the Place like a Pig sye cleaned it up and Put it in a Box no one come to help carry it away so I left it there. reported no one come to help carry it had dinner 12.30. rested till 4 P.M. had shave and wash had tea 5 P.M. fell in ¼ to 6 went on standing Patrol went down to canal got in motor Boat went 6 mile up canal got off Boat took up Position near swept road saw the other Patrol on camels. I was on 2nd shift. was woke up 11 P.M. had to report to the other Patrol a mile away set out\n\ncould not find them I think I walked out 5 mile the silly goat in charge camped off the beat on top of a hill where he could not be seen his name was N.M. I Poked about over sand hills and gullies could not find them. I returned to where I started from and woke the next man. I turned in again 2.40 A.M. very tired, it is very thick sand to travel on foot.\n\nSunday July","57":"\n\nturned out 5.30 rolled Blankets went to the canal waited for the motor Boat which turned up 6.30 A.M. returned to ferry Post\n\n7.30 had a wash and got Breakfast fell in 8.30 again cleaned up camel lines. rested till dinner time 12.30. had dinner very hot day. rested all afternoon had tea 5 P.M. turned in 7.30 P.M.\n\nMonday Junly","58":"\n\nturned out 5.30 fed all camels had shower had Breakfast fell in again 8.30 washed camels in the Bitter lakes. washed two and contrary one at that \nhad\n watered camels had dinner 12.30. had a Parcel from home also about 20 Papers. rested till 4.30 P.M. had tea 5.30. wrote to maud, Josie, dorrie aggie Bell alma. went to canteen had a Pint turned in 9 P.M. Saw a sea Plane.\n\nTuesday July","59":"\n\nturned out 5.30 went to camel lines fed up. had shower had Breakfast. fell in 8.30 A.M. camels exceisised. cleaned up lines very hot morning tied camels up again saw a Big Boat going through with a Big hole in her Prow. it looked as if she has been torpedoed. rested till 12.30 had dinner rested till 3.30. went and mange dressed camels. I done a loaf. fed up 5 P.M. had tea 5.30. am on H.Q. line guard to night on No. 8 Post. turned in 8.30 P.M. was woke up 3.30 A.M. had a look around tied up ten camels that was loose rolled up Blankets and went Back to the hut.\n\nWednesday July","60":"\n\nturned out 3.30 A.M. tied up loose camels had a wash and Breakfast fell in 8.30 A.M. Cleaned up lines took camels exercising finished 9.30 A.M. rested till 12.30 had dinner. rested till 3 P.M. Cleaned saddles & got a camel and a saddle to fit him when another chap come and claimed him rotton luck. had tea 5 P.M. stewed rabbitt. turned in 8 P.M. a hospital Boat has gone up.\n\nThursday July","61":"\n\nturned out 5.30. fed camels had breakfast fell in 8.30. Cleaned up lines. rested till 11.15. fed up had dinner 12.30.\n\nDEAD CAMEL\n\nA Manchester captain in Egypt writes:- “there is only one thing more offensive than a live camel, and that is a dead camel. One of ours died yesterday evening, and the camp-followers were instructed to drag it out far into the desert and bury it there. We could hear their shouting as they went away into the desert, and congratulated ourselves that we were fairly rid of the camel. But this morning one of the officers of the Royal Engineers was horribly annoyed to find that a new trench just by the camp was filled up with sand. He was still more annoyed to discover our enemy the camel at the bottom of it. The camp-followers had tilted the camel into the first hole they came to, and had then gone on shouting into the desert, to give a fine impression of their industry.\"\n\nThe small boy had a bad cold, and snuffled abominably, to the great annoyance of the other tram-passengers. Finally, one of them turned fiercely on the offending youngster, and said, “Have you a handkerchief?\"\n\n“Yes, sir\" said the boy, but mother don’t like me lending it to strangers.\"\n\nSuppose you remember this.\n\nrested till 4.30 P.M. had a wash had tea wrote to Stella Bradbury.\n\nFriday July","62":"\n\nturned out 5.30 fed camels had shower had Breakfast. the malwa went along to australia. fell in again 8.30 washed camels had dinner 12.30. rested till 2 P.M. fixed saddle had tea 5 P.M. went on ¼ guard 6.30. nothing doing turned in 9 P.M.\n\nSaturday July","63":"\n\nturned out 5.30 had a shower had Breakfast returned to the guard tent. \nreste\n took H.P. up to orderley room and he lost his head was going to scatter things about Put him\n\nBack in guard tent had dinner 12.30. was relieved from ¼ guard 1 P.M. and was ordered to get ready to move out. got all my gear ready and moved out from ferry Post 3 P.M. went up the canal as far as el-ferdan-lac. Cpl. Spawl got a Bad fall off his camel. it tried to jump a table. camped for the night had tea 6.30 and turned in. I saw my camel and gear here that was taken from fery Post.\n\nSunday July","64":"\n\nturned out 5.30 fed camel. Boiled Billy had breakfast saddled up and moved off 7.30 A.M. went up canal as far as Ballah. Saw D.H. and he sent us further out due west a very hot day.\n\nwe came to the fresh water canal there is a Beautiful lot of trees growing here a kind of oak. we had dinner here and rested till 3 P.M. moved off again went about 5 miles out of our way arrived at our destination unloaded and had tea turned in. the mosquitoes would eat a man.\n\nMonday July","65":"\n\nturned out 5.30 fed up had a sort of a wash water is scarce here had Breakfast. am on guard to day watching the railway line nothing doing had dinner 12.30. very hot day kept a look out till 5 P.M. had tea 5.30 on line guard to night\n\nstarted 10 P.M. talk about mosquitoes they are here in thousands on first shift 10 P.M. till 11.30 turned in. some silly coot is firing their rifle at a dog that is Barking.\n\nTuesday July","66":"\n\nturned out 5.30 A.M. fed up cant get a wash had Breakfast cleaned up all the camp very hot day had dinner 12.30. had four Papers from home had a letter from Josie walter Bell, two from win. had tea 5.30. issued with mosquito nets. on line guard to night on 3 Post 1 till 2.30 done it in Bed. Plenty of mosquitoes.\n\nWednesday July","67":"\n\nturned out 5.30 A.M. fed up cleaned camel lines had Breakfast fell in 8.30 A.M. for inspection rested till 12.30 had dinner rested till 4.30. fed up had tea saddled up went on outpost nothing to catch only mosquitoes. turned in 9 P.M.\n\nThursday July","68":"\n\nturn out 4 A.M. saddled up saw a Bedouin about ½ a mile off going at a good Pace on foot. he crossed the spept road T.W. fired his rifle across him the Bedouin layed down flat on ground A.R. and T.W. went down and Brought\n\nhim up we went Back to camp handed him over. fed up had Breakfast and went over to a swamp 3 mile away dug a drain to water camels the water is rotten it stinks like a Pole cat. returned to camp had dinner 12.30 very hot. rested all the afternoon was Paid went up to the camel hospital with a camel about three miles away. this camp is run by Tommies and is the cleanest camp u have ever seen although it is on the desert. I had a good Bath there fed camel and watered him waited till the wet\n\ncanteen opened had a few Beers and went Back to our own camp unsaddled and turned in 9.30 P.M.\n\nFriday July","69":"\n\nTurned out 5.30 felt very dry had a mug of Beer fed up had Breakfast. got very sick. I heared all over the Place it was the Beer that made me sick. cleaned up the camp rested till 12.30 had dinner feel a little Better rested till 4.30 P.M. fed up had tea saddled camel and went on an out Post 3 mile away nothing doing turned in feel O.K. now.\n\nSaturday July","70":"\n\nTurned out 4.30 A.M. a nice cool morning the sun is just\n\nrising saddled up and went Back to camp fed up had my Breakfast cleaned up the lines and the camp also cleaned out two tents rested till 12.30 had dinner rested till 5 P.M. fed up had tea and read till 10 P.M. turned in a good Breeze Blowing.\n\nSunday July","71":"\n\nturned out 5.30 A.M. fed up had a shave and wash had Breakfast had rabbit they are giving us rabbit now to eat. cleaned up camp and rested till 12.30 had dinner wrote to Bell Josie Win Walter had tea 6 P.M. Saddled up and went on outpost went to Budge on the sweet water canal four mile\n\naway tied camels to tall trees made Bed the mosquitoes here would eat a man. on first Post nothing doing turned in 11 P.M.\n\nMonday July","72":"\n\nturned out 4 A.M. never had very much sleep for the mosquitoes. followed the Spept road Back to camp fed up had Breakfast 6.30 cleaned up camp and rested till 12.30 had dinner. writing all the afternoon saddled up 3.30 P.M. went on Patrol along the suept road for two mile saw nothing returned to camp fed up had tea 6 P.M. Played cards till 8.30 turned in mosquitoes are very Bad.\n\nTuesday July","73":"\n\nturned out 5.30 fed up had wash\n\nhad Breakfast cleaned up the camp reading and writing till 12.30 had dinner very hot day. rested till 5 P.M. fed up had tea went on outpost. nothing doing turned in 9.30 mosquitoes are Bad.\n\nWednesday July","74":"\n\nturned out 4.15 rolled Blankets saddled up and followed the Suept road down to the lake no tracks watered camels. followed track Back as far as railway line fed up had Breakfast cleaned up camp took four camels to water to a swamp four mile away they would not drink. they layed down and rolled in it. returned to Camp had dinner 12.30 very hot day rested till 2 P.M.\n\nwent up to Camel hospital 3 mile away done some washing had a Bath. returning to camp my camel took fright. they were killing camels at the hospital he bolted off full gallop took me all my time to hold him. returned to camp had tea Played cards turned in 9 P.M.\n\nThursday July","75":"\n\nTurned out 5.30 fed up had Breakfast cleaned up camp Played cards had a rest had dinner 12.30 very hot day. rested all afternoon fed up 5.30 had tea saddled up and went to canal on outpost got there 7.30 P.M. mosquitoes very Bad. tied camel to a tree nothing doing turned in 11 p.m.\n\nFriday July","76":"\n\nturned out 4 A.M. rolled Blankets saddled up went to Pull a tick off my camels leg he Jumped on me and knocked me down knocked a good Piece of skin of my face. left outpost and followed Stuept road Back to camp saw a camel could not catch him he galloped away along the line he had a head cloth on. had Breakfast cleaned up camp Put a rooff on mess hut and cook house. wrote to Tim Maud Shorter auntie mae went on Patrol 4 P.M. saw nothing had tea 5 P.M. Played cards turned in 9 P.M.\n\nSaturday July","77":"\n\nturned out 5 A.M. fed up had\n\nBreakfast cleaned up camp helped scrub 2 tables rested till 12.30 had dinner. the heat is frightful rested till 5 P.M. fed up had tea 6 P.M. Saddled up and went on outpost to the canal was woke up 12 midnight two gippos are sweeping the road. turned in again 1 oclock.\n\nSunday July","78":"\n\nturned out 4 A.M. there is a fog thick enough to lose a man. followed Suept road Back to camp had Breakfast 6.30 cleaned up camp rested till 12.30 had dinner. had three letters one from maud Bell and Joe Cohalan very hot day. rested till 5 P.M. fed up had tea 5.30 read till 10 P.M. was\n\ntold off for line Guard. things are messed up anyway here. went on 2 Post 12.30 till ¼ to 3. there is a lot of messing about lately they cannot run this show in my opinion a man has to sit up till 10 P.M. of a night to get a wack to start line guard with.\n\nMonday July","79":"\n\nturned out 5.30 A.M. fed up had Breakfast cleaned up camp fell in 9.30 got a sort of a lecture about Being asleep on our Post. a man is on duty every night for 2 and a ½ hours and they wonder why he cant keep awake. a man was a fool to ever join the army I can see. rested till 12.30 had dinner very hot\n\nrested all afternoon. for a while wrote to maud Bell and Joe C. fed up 5-5.30 had tea 6 P.M. on line guard to night.\n\nTuesday July","80":"\n\nTurned out 5.30 A.M. fed up and had breakfast cleaned up camp rested till 12.30 had dinner very hot day. there was a heavy fog this morning rested till 3.30 P.M. went on Patrol took a camel to water saw a fox had tea 6 P.M. went up to camel hospital no Beer there. Posted letters returned to camp turned in 10 P.M. mosquitoes are bad.\n\nWednesday July","81":"\n\nturned out 5.30 A.M. fed up had Breakfast cleaned up the Camp we have a native here now Played euchre till 12.30.\n\nhad dinner very hot day. rested till 2 P.M. was inspected by the Colonel and Major & Captain Pay some of the men fed up 5 P.M. had tea 5.30 saddled up went on outpost 6.30 went to canal a distance of four mile nothing doing turned in 10 P.M.\n\nThursday July","82":"\n\nStand to 4.30 A.M. saddled up and returned to camp fed up and had Breakfast cleaned up camp am on guard to day caught an e. native and let him go again he is alright. had dinner 12.30 very hot day rested till 5 P.M. fed up and had tea went to canteen had 2 Beers did not like it returned to camp 11.30 P.M. turned in.\n\nFriday July","83":"\n\nturned out 5.30 A.M. fed up had Breakfast cleaned up camel lines and camp rifle inspection 8.15. got 3 days C.B. for not Being in camp by 10.30 it is all rot. had dinner 12.30 rested till 5 P.M. fed up had tea saddled up went on outpost to canal nothing doing turned in 10 P.M.\n\nSaturday July","84":"\n\nturned out 5.30 A.M. fed up had Breakfast cleaned up camp fell in 8.15 for rifle inspection fixing Bayonets rested till 12.30 am mess orderley had dinner very hot day. rested till 2.30 P.M. fell in and got orders to get ready to move to Ballak at 4 P.M. moved out 4 P.M. arrived\n\nBallak 6 P.M. went for a swim in canal fed up had tea got two Beers and turned in. the ground here is very damp.\n\nSunday July","85":"\n\nturned out 6 A.M. fed up went to canal had a swim had Breakfast cleaned up rested till 12.30 had dinner. rested till 5.30 fed up not feeling well could not eat my tea. saddled up went up canal on outpost turned in 11 P.M. nothing doing.\n\nMonday July","86":"\n\nturned out 5.30 saddled up and returned to camp fed up had Breakfast cleaned up camp cleaned rifle had shave watered camels hot day rested till 5 P.M. fed up had tea turned in am not feeling well at all.\n\nTuesday July","87":"\n\nturned out 6 A.M. fed up went for a swim could not eat my Breakfast cleaned up camp rested till 12.30 had dinner very hot rested till 1 P.M. got very sick. I feel as if I am on fire I think I have fever lied down till 4 P.M. got in motor Boat went to ferry Post and saw the doctor. my tempeture was 101.4 said I had a touch of malaria fever gave me a good dose of quinine. I turned in 10 P.M. feel much Better.\n\nWednesday August","88":"\n\nturned out 6 A.M. had a wash went to the doctor got more medicine had Breakfast feeling Better rested all day had tea\n\n5 P.P. turned in 8 P.M.\n\nThursday Aug.","89":"\n\nturned out 6 A.M. am feeling all right had Bath and got Breakfast. rested till 12.30 had dinner rested till 5 P.M. had tea turned in 8 P.M.\n\nFriday Aug.","90":"\n\nturned out 5.30 had a Bath and Breakfast am feeling much Better now. rested all day very hot. there is sports here to day had a look at the swimming and camel racing not much to look at had tea turned in 9 P.M.\n\nSaturday Aug.","91":"\n\nturned out 5.30 had a Bath and had Breakfast rested all day everyone gone to the sports to ismalia very hot day am feeling much\n\nBetter now.\n\nSunday Aug.","92":"\n\nturned out 5.30 had shave and a Bath went and seen doctor told me I could go Back to Ballah. got a Pass rolled my Blankets and had to walk in to ismalia 4 mile to catch a train very hot had my dinner had a look round caught train 2 P.M. arrived at Ballah 4 P.M. had tea and turned in.\n\nMonday Aug.","93":"\n\nturned out 5.30 A.M. had a wash and Breakfast cleaned up. saddled up full marching order left Ballah 7.30 for Jahoul which Place we reached 11 A.M. very hot day. had dinner. rested till 5 P.M. fed up had tea went on\n\noutpost. Wills came along 10 P.M. and roared like a lion men are sent out But they get no instructions. I was on 12.20 till 2.40 nothing about turned in again 3 A.M.\n\nTuesday Aug.","94":"\n\nturned out 4.30 A.M. saddled up and returned to camp fed up had Breakfast cleaned up camp rested till 12.30 had dinner very hot day. rested till 5 P.M. fed up had tea fell in for rifle inspection went up to camel hospital had a Bath done some washing had a Beer am feeling swell again now. returned to camp 10 P.M. can hear Bombs or Big guns firing. turned in.\n\nWednesday Aug.","95":"\n\nturned out 5.30 fed up had wash had Breakfast cleaned up\n\ntent rested till 12.30. had dinner hot day. rested till 5 P.M. fed up and had tea saddled up and went on an outpost on 4 Post 3 A.M. till 5 A.M. nothing doing.\n\nThursday Aug.","96":"\n\nSaddled up and returned to camp fed up had Breakfast led five camels up to hospital to be mange dressed had dinner there very hot day had a good Bath rested till 3.30 P.M. Brought camels Back to camp fed up had tea turned in am well.\n\nFriday Aug.","97":"\n\nturned out 5.30 A.M. fed up had Breakfast had a letter from maud, two from Josie one from mick two from win. rested till 12.30 had dinner a hot day rested till 5 P.M. had tea saddled up\n\nwent on outpost on third Post 1 A.M. till 3 A.M. nothing about I turned in again.\n\nSaturday Aug.","98":"\n\nturned out 5.30. Packed up and returned to camp fed up had Breakfast cleaned up rested till 12.30 had dinner rested till 5.30 P.M. fed up had tea watched the Boys Play cards till 10 P.M. and turned in. I am getting a cold in the head.\n\nSunday Aug.","99":"\n\nturned out 5.30. fed up had Breakfast. Packed up and went over to Ballah arrived there 10 A.M. off saddled and rested till 12.30. had dinner very hot day. rested till 5.30 P.M. had tea fed up saddled up went on outpost\n\nnothing doing turned in 10 P.M.\n\nMonday Aug.","100":"\n\nturned out 5.30 saddled up and returned to camp fed up had Breakfast cleaned up went to the canal fishing. Plenty of fish But they will not Bite never got a nibble even. had dinner 12.30 hot day. rested till 5.30 fed up had tea went fishing again never got a Bite turned in 9 P.M.\n\nTuesday Aug.","101":"\n\nturned out 5.30 fed up had Breakfast cleaned up went to do some washing water turned off went fishing never got a Bite saw hundreds of fish. rested till 12.30 fed up had dinner very hot day. rested till 5.30 P.M. fed up had tea saddled up went on\n\n(wrote to Maud Josie Win Tim Mick.)\n\noutpost nothing doing turned in 9 P.M. Plenty of mosquitoes.\n\nWednesday Aug.","102":"\n\nturned out 5.30 A.M. saddled up returned to camp and fed up. had Breakfast cleaned up and went fishing never got a Bite. \nreste\n Put camel in the cart and carted fodder. had dinner 12.30 very hot day rested till 5.30 P.M. fed up had tea went fishing caught nothing turned in 10 P.M.\n\nThursday Aug.","103":"\n\nThursday Aug.\n turned out 5.30 fed up had Breakfast cleaned up went fishing got 6 Bites lost one hook. cleaned saddle and had dinner 12.30 hot day. rested till 5.30 P.M. fed up had tea. Played cards turned\n\nin 10 P.M.\n\nFriday Aug.","104":"\n\nturned out 5.30 fed up went for a swim had Breakfast cleaned up went fishing no Bites. returned to camp rested till 12.30 had diner rested till 4 P.M. washed camel fed up had tea saddled up went on outpost nothing doing turned in 9.30 P.M.\n\nSaturday Aug.","105":"\n\nturned out 5.30 A.M. fed up and went for a swim and Bath had Breakfast cleaned up. was inspected. went fishing never got a Bite returned to camp 9.30 A.M. rested till 12.30 had dinner rested till 5.30 fed up had tea. went fishing saw plenty never got a Bite. had a letter from Ailie 3 Papers from home. turned in 10 P.M.\n\nSunday Aug.","106":"\n\nturned out 5.30 A.M. fed up and went for a swim and Bath had Breakfast. got two tanks of water. Packed up and left Ballah 8 A.M. went out to Taboue which Place we reached 11 A.M. off saddled fed up had dinner 12.30 very hot day. rested till 5.30 fed up had tea. Saddled up and went to the sweet canal. on outpost nothing doing turned in the mosquitoes would eat a man.\n\nMonday Aug.","107":"\n\nturned out 5 A.M. saddled up and returned to camp fed up had Bfast cleaned up fell in for rifle inspection rested till 12.30 had dinner rested till 3 P.M. took camels to hospital to water returned to\n\ncamp 7.30. had tea turned in 9.30.\n\nTuesday Aug.","108":"\n\nturned out 5.30 A.M. fed up had Bfast cleaned up rested till 12.30 had dinner very hot to day. \nrested\n wrote to Dorrie Alma Eileen fed up 5.30 had tea. saddled up went on outpost nothing doing made a Billy of cocoa and turned in mosquitoes are very Bad.\n\nWednesday Aug.","109":"\n\nturned out 5 A.M. saddled up returned to camp fed up and had Breakfasts. got Pack camel and went for a load of wood it is very scarce to. returned to camp with a crows nest. saw a hare. had dinner 12.30 rested all the afternoon fed up 5.30 had tea turned in 9.30 P.M.\n\nThursday Aug.","110":"\n\nturned out 5.30 A.M. fed up had Breakfast cleaned up camp cleaned rifle for inspection which never came off. let camels loose for grasing. got orders to fetch them in again. cleaned up again to be inspected By the Colonel which he did at 3 P.M. he said we would have to Pay for grooming . I am not going to Pay for any. had tea 6.30 P.M. saddled up and went to the sweet water canal on Patrol and watered camel had a cup of cocoa turned in got very little sleep the skeaters were to Bad.\n\nFriday Aug.","111":"\n\nturned out 5 A.M. saddled up and returned to camp fed up had breakfast cleaned up rested till 12.30 had dinner very hot day.\n\nrested till 5.30 fed up and had tea. watched Boys Play cards turned in 9.30 P.M. cool night.\n\nSaturday Aug.","112":"\n\nturned out 5 A.M. fed up had wash fell in 5.30 was Paid 4 Pound had Breakfast cleaned up camel lines fell in for rifle inspection. rested till 12.30 had dinner very hot rested all afternoon fed up 5.30 had tea. Saddled up went on outpost made Billy of cocoa nothing doing turned in.\n\nSunday Aug.","113":"\n\nturned out 5 A.M. saddled up returned to camp fed up and had Breakfast cleaned up and messed about very hot morning. rested till 12.30 had dinner rested till 5 P.M. fed up had tea.\n\nwatched Boys Play cards turned in 9 P.M. Plenty of mosquitoes.\n\nMonday Aug.","114":"\n\nturned out 5.30 A.M. fed up had wash had breakfast cleaned up the camp. reading and sleeping till 12.30 had dinner hot day alright. fed up 5.30 P.M. went on outpost nothing doing turned in.\n\nTuesday Aug.","115":"\n\nTurned out 5.30 A.M. \nfed up\n saddled up and returned to camp fed up had breakfast and cleaned up. rested till 12.30 had dinner very hot rested till 5.30 fed up had tea turned in.\n\nWednesday Aug.","116":"\n\nturned out 5 A.M. went out field firing fired 10 shots at a bush. some one fired\n\nover the hill. returned to camp fed up had breakfast 7 A.M. cleaned up rested till 12.30 had dinner. saddled up went on outpost 1.30 camped on hill near lake saw nothing was relieved 6 P.M. returned to camp fed up had tea turned in.\n\nThursday Aug.","117":"\n\nturned out 5 A.M. fed up and saddled up went out along the swept road to see no one went in the danger zone as they were field firing again. returned to camp 7 A.M. had breakfast cleaned up rested till 12.30 had dinner rested till 4.30 P.M. fed up had tea. saddled up went on Patrol to fresh water canal nothing\n\n(had a letter from alma Josie maud two from win.)\n\ndoing. saw other Patrol and they gave me a Pack Camel loaded with comforts. turned in the skeaters are Bad.\n\nFriday Aug.","118":"\n\nturned out 5 A.M. saddled up and returned to camp 7 A.M. fed up off saddled had breakfast rested till 12.30 had dinner. very hot day. wrote to alma and win rested till 5 P.M. fed up had tea and turned in. wrote to maud.\n\nSaturday Sept.","119":"\n\nturned out 5 A.M. fed up had Breakfast saddled up and went on outpost at lake. Put up a shade and cooled off. cooked dinner and eat it. it is terrible hot to day. I think a man is only \n\nhere for a Joke. wrote to Josie and Maud Shorter. was relieved 6 P.M. Returned to camp fed up had tea received mail from Josie and Paper from Maud. turned in.\n\nSunday \nAug.\n","120":" Sept.\n\nturned out 5.30 fed up had Breakfast cleaned up camp. saddled up full marching order and went in to Ballah for a change which place we reached 10.30 A.M. it is very hot fed up and had dinner Bread and Jam. there is no sugar. every time we come to this camp they are very short of rations. I don’t know why. rested till 4 P.M. went for a swim fed up had tea \nand\n turned in 8.30 P.M.\n\nMonday \nAug.\n","121":" Sept.\n\nTurned out 5.30 A.M. fed up\n\nJ.S. done a Bit of rapid firing at a tree nearby cut the tree down. You would think it was lighting struck. had breakfast and little at that. cleaned up lines saddled up and went on outpost to sweet water canal. stopped there till 11.30. returned to camp fed up had dinner 12.30 very hot day. rested till 2 P.M. done a Bit of washing fed up 5 P.M. had tea went on outpost again nothing doing turned in.\n\nTuesday \nAug.\n","122":" Sept.\n\nturned out 5 A.M. Saddled up and returned to camp fed up and had breakfast. cleaned up lines. asked for 8 hours leave told I could not get it. other men can get it and they have just come Back from Cairo. washed my camel give him a drink had dinner Bread and marmalade. this is a Starvation Camp\n\n(wrote to tim and maud.)\n\nas far as I can see. rested till 2 P.M. cleaned saddle done some washing had tea 5 P.M. fed up and turned in 8 P.M. was wake up 10.30. some of them have returned from leave. they talked half the night never got much sleep.\n\nWednesday Sept.","123":"\n\nturned out 5.30 fed up had Breakfast cleaned up fixed saddle watered Camels. went for a swim and a good wash. had dinner 12.30 very hot day rested till 4.30 P.M. fed up had a good swim and wash saddled up and went on outpost nothing doing turned in.\n\nThursday Sept.","124":"\n\nturned out 5.30 saddled up and returned to camp fed up went\n\nfor a swim and Bath had Breakfast cleaned up rested till 12 had dinner. Caught 1.5 P.M. train went to ismalia a dirty little town got what I wanted went out to ferry Post got a Pair of Puttees. returned to ismalia went to the hospital saw kentish and haver had tea. Saw Pictures returned to Ballah 10.30 P.M. turned in.\n\nFriday Sept.","125":"\n\nturned out 5.30 A.M. fed up and went for a swim had Breakfast cleaned up. saddled up went on outpost to sweet water Canal. returned to Ballah 12 A.M. fed up had dinner rested all the afternoon fed up 5 P.M. had tea. went on outpost 6.30 P.M. nothing doing turned in.\n\nSaturday Sept.","126":"\n\nturned out 5.30 A.M. returned to camp fed up had breakfast done some writing had to saddle up and go to Taboue which Place we reached 12.30. unpacked \nfed\n had dinner rested all afternoon fed up had tea turned in.\n\nSunday Sept.","127":"\n\nturned out 5.30 fed up had Breakfast cleaned up rested till 12.30 had dinner very hot day. rested all afternoon fed up 5 P.M. had tea. saddled up went on Patrol to sweet water canal. watered camel nothing about turned in.\n\nMonday Sept.","128":"\n\nturned out 5 A.M. saddled up returned to camp fed up and\n\nhad Breakfast went on Patrol to lake. remained there till 11.30 returned to camp had dinner 12.30 rested all afternoon. fed up 5.30 had tea turned in.\n\nTuesday Sept.","129":"\n\nTurned out 5.30 A.M. fed up had breakfast cleaned up camp. fell in for rifle inspection fix and unfix Bayonets. rested till 12.30 had dinner. resting and reading all afternoon fed up 5.30 had tea. saddled up and went on Patrol. minding Bedouins all night never got much sleep with the noise. they made grinding grain and Barking dogs.\n\nWednesday Sept.","130":"\n\nturned out 4 A.M. a relief Party turned up 5 A.M. that should have come 4 A.M. the Bedouins\n\nwere left go 5.30. returned to camp fed up had Breakfast cleaned up. rifle inspection. there has Been a cow shot. we were asked to subscribe ten Piastres each to Pay for it. I am damned if I will give them anything. it has not Been proved who shot the cow or how it was killed. had dinner 12.30. saddled up went on Patrol watered camels rode along lake. I am hanged if I know what we are riding about for. returned to camp 5 P.M. had tea fed up turned in 8 P.M. cool night.\n\nThursday Sept.","131":"\n\nturned out 5.30 fed up had Breakfast cleaned up camp. rested till 12.30 had dinner. rested till 2 P.M. orders to saddle up full marching\n\norder left Taboue 3.45. went as far a Ballah which Place we reached 6 P.M. off saddled Put down a line and watered camels a silly thing to do. had tea turned in.\n\nFriday Sept.","132":"\n\nturned out 4 A.M. had a swim fed up saddled up had Breakfast. left Ballah 5.30 A.M. went to ferry Post which place we reached 10.30 A.M. unpacked fed up had dinner rested till 2 P.M. fell in 2.30. they said something about sports. had a good clean up and done some washing. fed up 5 P.M. had tea and turned in cool night. \n\nSaturday Sept.","133":"\n\nTurned out 6 A.M. fed up had a good Bath got Breakfast and Packed up. left ferry Post 7.30 went to Serapeum which Place\n\nwe reached 11 A.M. Unpacked put down a line fed up had dinner. rested all afternoon fed up 5 P.M. had tea went to canteen had two bottles of beer with J.P. turned in 9 P.M.\n\n"}}