{"Document Name":{"0":"Diary_0004","1":"Diary_0004","2":"Diary_0004","3":"Diary_0004","4":"Diary_0004","5":"Diary_0004","6":"Diary_0004","7":"Diary_0004","8":"Diary_0004","9":"Diary_0004","10":"Diary_0004","11":"Diary_0004","12":"Diary_0004","13":"Diary_0004","14":"Diary_0004","15":"Diary_0004","16":"Diary_0004","17":"Diary_0004","18":"Diary_0004","19":"Diary_0004","20":"Diary_0004","21":"Diary_0004","22":"Diary_0004","23":"Diary_0004","24":"Diary_0004","25":"Diary_0004","26":"Diary_0004","27":"Diary_0004","28":"Diary_0004","29":"Diary_0004","30":"Diary_0004","31":"Diary_0004","32":"Diary_0004","33":"Diary_0004","34":"Diary_0004","35":"Diary_0004","36":"Diary_0004","37":"Diary_0004","38":"Diary_0004","39":"Diary_0004","40":"Diary_0004","41":"Diary_0004","42":"Diary_0004","43":"Diary_0004","44":"Diary_0004","45":"Diary_0004","46":"Diary_0004","47":"Diary_0004","48":"Diary_0004","49":"Diary_0004","50":"Diary_0004","51":"Diary_0004","52":"Diary_0004","53":"Diary_0004","54":"Diary_0004","55":"Diary_0004","56":"Diary_0004","57":"Diary_0004","58":"Diary_0004","59":"Diary_0004","60":"Diary_0004","61":"Diary_0004","62":"Diary_0004","63":"Diary_0004","64":"Diary_0004","65":"Diary_0004","66":"Diary_0004","67":"Diary_0004","68":"Diary_0004","69":"Diary_0004","70":"Diary_0004","71":"Diary_0004","72":"Diary_0004","73":"Diary_0004","74":"Diary_0004","75":"Diary_0004","76":"Diary_0004","77":"Diary_0004","78":"Diary_0004","79":"Diary_0004","80":"Diary_0004","81":"Diary_0004","82":"Diary_0004","83":"Diary_0004","84":"Diary_0004","85":"Diary_0004","86":"Diary_0004","87":"Diary_0004","88":"Diary_0004","89":"Diary_0004","90":"Diary_0004","91":"Diary_0004","92":"Diary_0004","93":"Diary_0004","94":"Diary_0004","95":"Diary_0004","96":"Diary_0004","97":"Diary_0004","98":"Diary_0004","99":"Diary_0004","100":"Diary_0004","101":"Diary_0004","102":"Diary_0004","103":"Diary_0004","104":"Diary_0004","105":"Diary_0004","106":"Diary_0004","107":"Diary_0004","108":"Diary_0004","109":"Diary_0004","110":"Diary_0004","111":"Diary_0004","112":"Diary_0004","113":"Diary_0004","114":"Diary_0004","115":"Diary_0004","116":"Diary_0004","117":"Diary_0004","118":"Diary_0004","119":"Diary_0004","120":"Diary_0004","121":"Diary_0004","122":"Diary_0004","123":"Diary_0004","124":"Diary_0004","125":"Diary_0004","126":"Diary_0004","127":"Diary_0004","128":"Diary_0004","129":"Diary_0004","130":"Diary_0004","131":"Diary_0004","132":"Diary_0004","133":"Diary_0004","134":"Diary_0004","135":"Diary_0004","136":"Diary_0004","137":"Diary_0004","138":"Diary_0004","139":"Diary_0004","140":"Diary_0004","141":"Diary_0004","142":"Diary_0004","143":"Diary_0004","144":"Diary_0004","145":"Diary_0004","146":"Diary_0004","147":"Diary_0004","148":"Diary_0004","149":"Diary_0004","150":"Diary_0004","151":"Diary_0004","152":"Diary_0004","153":"Diary_0004","154":"Diary_0004","155":"Diary_0004","156":"Diary_0004","157":"Diary_0004","158":"Diary_0004","159":"Diary_0004","160":"Diary_0004","161":"Diary_0004","162":"Diary_0004","163":"Diary_0004","164":"Diary_0004","165":"Diary_0004","166":"Diary_0004","167":"Diary_0004","168":"Diary_0004","169":"Diary_0004","170":"Diary_0004","171":"Diary_0004","172":"Diary_0004","173":"Diary_0004","174":"Diary_0004","175":"Diary_0004","176":"Diary_0004","177":"Diary_0004","178":"Diary_0004","179":"Diary_0004","180":"Diary_0004","181":"Diary_0004","182":"Diary_0004","183":"Diary_0004","184":"Diary_0004","185":"Diary_0004","186":"Diary_0004","187":"Diary_0004","188":"Diary_0004","189":"Diary_0004","190":"Diary_0004","191":"Diary_0004","192":"Diary_0004","193":"Diary_0004","194":"Diary_0004","195":"Diary_0004","196":"Diary_0004","197":"Diary_0004","198":"Diary_0004","199":"Diary_0004","200":"Diary_0004","201":"Diary_0004","202":"Diary_0004","203":"Diary_0004","204":"Diary_0004","205":"Diary_0004","206":"Diary_0004","207":"Diary_0004","208":"Diary_0004","209":"Diary_0004","210":"Diary_0004","211":"Diary_0004","212":"Diary_0004","213":"Diary_0004","214":"Diary_0004","215":"Diary_0004","216":"Diary_0004","217":"Diary_0004","218":"Diary_0004","219":"Diary_0004","220":"Diary_0004","221":"Diary_0004","222":"Diary_0004","223":"Diary_0004","224":"Diary_0004","225":"Diary_0004"},"Date":{"0":"unknown","1":580.0,"2":594.0,"3":595.0,"4":658.0,"5":659.0,"6":671.0,"7":672.0,"8":673.0,"9":688.0,"10":690.0,"11":691.0,"12":696.0,"13":702.0,"14":708.0,"15":713.0,"16":714.0,"17":715.0,"18":717.0,"19":718.0,"20":719.0,"21":720.0,"22":721.0,"23":722.0,"24":723.0,"25":724.0,"26":725.0,"27":726.0,"28":727.0,"29":730.0,"30":731.0,"31":732.0,"32":733.0,"33":734.0,"34":735.0,"35":736.0,"36":737.0,"37":738.0,"38":739.0,"39":740.0,"40":741.0,"41":742.0,"42":743.0,"43":744.0,"44":745.0,"45":746.0,"46":747.0,"47":748.0,"48":749.0,"49":750.0,"50":751.0,"51":752.0,"52":753.0,"53":754.0,"54":755.0,"55":756.0,"56":757.0,"57":758.0,"58":759.0,"59":760.0,"60":761.0,"61":762.0,"62":763.0,"63":764.0,"64":765.0,"65":766.0,"66":767.0,"67":768.0,"68":769.0,"69":771.0,"70":772.0,"71":773.0,"72":774.0,"73":775.0,"74":776.0,"75":777.0,"76":778.0,"77":779.0,"78":780.0,"79":781.0,"80":782.0,"81":783.0,"82":784.0,"83":785.0,"84":786.0,"85":787.0,"86":788.0,"87":789.0,"88":790.0,"89":791.0,"90":792.0,"91":793.0,"92":794.0,"93":795.0,"94":796.0,"95":797.0,"96":798.0,"97":799.0,"98":800.0,"99":801.0,"100":802.0,"101":803.0,"102":804.0,"103":806.0,"104":807.0,"105":808.0,"106":809.0,"107":810.0,"108":811.0,"109":812.0,"110":813.0,"111":814.0,"112":815.0,"113":816.0,"114":817.0,"115":818.0,"116":819.0,"117":820.0,"118":821.0,"119":822.0,"120":823.0,"121":824.0,"122":825.0,"123":826.0,"124":827.0,"125":828.0,"126":829.0,"127":830.0,"128":831.0,"129":832.0,"130":833.0,"131":834.0,"132":835.0,"133":836.0,"134":837.0,"135":838.0,"136":839.0,"137":840.0,"138":841.0,"139":842.0,"140":843.0,"141":844.0,"142":845.0,"143":846.0,"144":847.0,"145":848.0,"146":849.0,"147":850.0,"148":851.0,"149":852.0,"150":853.0,"151":854.0,"152":855.0,"153":856.0,"154":857.0,"155":858.0,"156":859.0,"157":860.0,"158":861.0,"159":862.0,"160":863.0,"161":864.0,"162":865.0,"163":866.0,"164":868.0,"165":869.0,"166":870.0,"167":871.0,"168":872.0,"169":873.0,"170":874.0,"171":875.0,"172":876.0,"173":877.0,"174":878.0,"175":879.0,"176":880.0,"177":881.0,"178":882.0,"179":883.0,"180":884.0,"181":885.0,"182":886.0,"183":887.0,"184":888.0,"185":889.0,"186":890.0,"187":891.0,"188":892.0,"189":893.0,"190":894.0,"191":895.0,"192":896.0,"193":897.0,"194":899.0,"195":900.0,"196":901.0,"197":902.0,"198":903.0,"199":904.0,"200":905.0,"201":906.0,"202":907.0,"203":908.0,"204":909.0,"205":910.0,"206":911.0,"207":912.0,"208":913.0,"209":914.0,"210":915.0,"211":916.0,"212":917.0,"213":918.0,"214":919.0,"215":920.0,"216":921.0,"217":922.0,"218":923.0,"219":924.0,"220":925.0,"221":926.0,"222":927.0,"223":928.0,"224":929.0,"225":930.0},"Entry":{"0":"\n\nEnlisted ","1":" at Victoria Barracks Sydney.\n\nReported at Barracks","2":" Aug.15 to be sent into camp. Enrolling officer ordered us off for three weeks or a month until they were in a position to take us.\n\nDemonstrations threatening a march through Sydney streets were quietened by Colonel Wallack arranging to put us in the Show Ground. Quartered in Pigeon Pavilion for 4 days. Then transferred to Warwick Farm Racecourse .\n\nHere for 5 days when the occupants of our tent were moved to the Contact Camp\n\nfor Measles, Liverpool. Confined for 10 days – Quite unnecessary because it transpired that our tentmate didn’t have measles. 5 days leave followed after which I again applied for a transfer to A.M.C. not being satisfied with infantry position of Coy. S.-M. About 3 weeks at Liverpool doing carpentering work at the Field Hospital when, on October","3":" I was chosen in party of 8 reserves to leave immediately for Queen’s Park. Final leave of 5 days was allowed and on","4":" we left Sydney by train for Melbourne with the\n","5":" Field Ambulance. Breakfast had been previously arranged for at Albury and it was ready when we reached this station. The following afternoon, on arrival in Melbourne, we marched to Albert Park and camped in rear of the South Melbourne Football \n\nGround. Leave nearly every night except when concert parties came to oblige us. The people on all sides gave us invitations to dinners, evenings, week end trips to the country etc. In fact they were altogether too kind. On Friday the","6":" we started out on a route\n","7":" Having taken the train to Ringwood 15 miles from Melbourne our course had been mapped out as far as Launching Place, a distance of 40 miles. On the first day (Friday) we covered 13 miles. During the afternoon heavy rain fell and our horses refused to pull their transport waggons up hill through the mud so we were obliged to do the work ourselves. Arrived at Kangaroo Ground that night wet through with perspiration and rain. The townspeople gave us their dancing hall for the night notwithstanding that it\n\nhad been prepared for a dance which was to take place on the following night. It was still raining in the morning when we resumed the march. People waved flags from their houses and one lady gave us a basket of cakes because she heard us singing \"All Soldiers Live on Bread & Jam\". The scenery along the road was beautiful. Shortly after mid-day we arrived at Christmas Hills on the heights above Yarra Glen when a fierce thunderstorm broke out. From this position the surrounding country presents a beautiful scene.\n\nContinuing, we came down the slopes into Yarra Glen. We were in such a miserable state and the roads before us were so bad that Capt Donald told us we could return to Melbourne from Yarra Glen if we wished. A number thought it advisable to do so but the remainder pushed on by a forced march over the last 9 miles, arriving in Healesville singing at 7pm","8":" a total distance of 34 miles. Wet through and with mud caked almost up to our knees the local people gave us the use of the council hall. Here we lit a\n\nfire and dried our clothes. Our officers bought meat pies and cakes for the men. On the following day (Sunday) it was still raining and as the roads to Launching Place were under water it was impossible to resume the march so we decided to return to Melbourne by train that night. During the day in Healesville there was a Church Parade in the morning and in the afternoon parties wandered about the town while I looked up old friends of 8 years back recalling the times when we used to come\n\nhere for holidays. Loaded up with flowers and other souvenirs we returned to camp by train. The Victorian Railway Authorities are held high in our remembrances of the Healesville event because they generously refunded our railway fares.\n\nOn Melbourne Cup Day there were rumours that leave would be granted from mid-day but the boys thought it safer to take the matter into their own hands. At about 8.30am fully 90% walked out of camp, the consequence being that they were fined £2 and given pack drill for a week. I was one\n\n \n\nof the lucky few who were overlooked at the roll call, so escaped.\n","9":" I was taken on the strength of the Ambulance and attached to \"A\" Section Stretcher Bearers – No 6777.\n","10":" We were all busy striking camp and carting the Ambulance material to Port Melbourne Pier preparatory to sailing the next day.\n\nMid-day","11":" marched to the boat singing on the way. Crowds lined the streets. On nearing the Pier, ladies gave us flags, oranges, chocolates, etc. We waited some time on the \n\nPier making preparations for the positions on board then embarked on the \"SS Ascanius\" A11. After a space of half an hour or so the public were allowed on to the Pier. Men swarmed into the life boats and up the rigging. The cheers from the wharf mingled with the singing of \"Brothers in Arms Are We\" and \"Advance Australia Fair\" from the troopship created a deafening noise as we slowly steamed out followed by motor launches & small craft. It was at first thought that we would be anchored in Port Phillip for a few days but we passed\n\nstraight out through the heads. Our quarters on board were situated in \"G\" Deck at the \"after\" end of the ship. It was down on the first floor of a hold where mess table to seat 20 are arranged and numbered, our number being 14. For the first few days, until things were going systematically, the air in our compartment was practically unbearable, considering that there were 287 men provided for. We slept in hammocks swung up over the mess tables at night time so the ventilation would need to\n\nbe well considered. This, however was soon overcome. Up to","12":" the sea was fairly rough but after rounding Cape Lewin fine weather and a smooth sea confronted us. We kept a considerable distance off the usual course probably to avoid being seen. Passed seal and whale to date. Throughout the week nothing of importance happened. It was given out in orders that we were taking a new course because of the presence of a mine-layer which escaped through the Suez Canal. This of course was treated as a\n\njoke by the boys. Met two old Brighton friends on board – Lieut Law & Corp. Lingham.\n","13":" Church Service by Corp (Rev.) Cosier of our unit. His services are always worth attending. An albatross one day flew over the ship and the captain remarked that it was a good omen. On previous trips the \"Ascanius\" had been chased by submarines in the Mediterranean and also by the \"Emden\". \n\nHospital patient\ns\n died of pneumonia and the burial service was a very impressive one. All was silent on board as the body was\n\nbeing lowered from the poop deck, then the buglers blew the \"Last Post\". This man unfortunately left a big family, so the troops on board very generously paid in so much of their allowance and raised a large sum for the widow.\n\nAbout 3pm on","14":" we crossed the Equator, celebrating the occasion by a carnival on board. Numbers, including officers , were thrown into a big canvas bath. The fever spread all over the ship so that everyone they could lay hands on went into the water.\n\nThe weather was extremely warm\n\nthat day. From the Equator on to Cape Guardafui there was nothing to see. We sighted the Cape at 6am on","15":" and a few steamers were also visible on the horizon. This was the first time since leaving Australia that either land or ships came in view. The dim outline of the African coast soon gave way to a very close view revealing rugged and barren cliffs of which Cape Guardafui is by far the most prominent. From the Cape along towards the Gulf of Aden a rugged range of mountains is to be \n\nseen behind the stretches of sandy country, while no sign of vegetation or life of any kind was noticeable. Each day the weather appeared to get hotter. Among other sights about this spot we saw a few whales spouting in the distance and also thousands of queer looking birds. These latter fly in thousands one behind the other so that the line extends out of sight.\n\nWe gradually left the African coast behind, and, on the following morning","16":" the Arabian Coast was sighted very much like the other coast I have just described.\n\nStraight ahead of us one very prominent height, which at first we guessed to be an island, afterwards turned out to be Aden. Just before midday we steamed right up to within a stones throw of this very strange but interesting mountain which rises almost perpendicularly out of the water. Judging by the business like way each steamer approaches Aden and exchanges signals, one can imagine the importance of such a place. Our boys were crowded up in the life boats or anywhere that they could get a good view of what was going on. It seems that we asked\n\nwhether mails could be left there but there was nothing to be gained by doing so.\n\nAden and its surroundings are something like this:- \n\nMount Aden, the point of the headland, is one massive rocky mountain very much like an old volcano judging by the streaks that run down the sides. In fact the other\ne\n mountains which join up in the rear are also nothing but black rock. On Mount Aden itself we could only see the lighthouse and signal station. Round to the right about\n\ntwo miles back are these high poles, visible from a considerable distance out at sea. These are part of the great wireless station. \n\nBehind Mount Aden i.e. on the next peak there is another signal staff, whilst on another peak to the right is a big water tank. Round to the left of the peninsula what interested me a great deal was a batch of new buildings. One seemed to be an enormous place while all round it were numbers of other flat roofed places, all big and newly built. Although it was a beautifully clear day and we were close in to the\n\npoint we didn’t get \na\n a very good opportunity of seeing what was on either the left or right hand side of the point. There is still another wireless station behind the buildings I have referred to and we could see a big French Battleship at anchor. \n\nThe Naval & Coaling stations may be round here somewhere & possibly the buildings are connected with them. The Arabian Coast is very mountainous, otherwise the country is nothing but dry looking sandy desert. Towards 8 p.m. on the same day","17":" we passed through the Straits of Babel-Mandeb\n\nand through Helles Gates. The heat was intense, a continuation of the weather we experienced all the way from the Equator. We were three days on the Red Sea without seeing land on either side – quite a surprise to me as I had no idea this Sea was so big. Each morning numbers of steamers could be seen on the horizon. On","18":" arrangements were being made for disembarkation on the following day. A number of dolphins were jumping out of the water all round the boat and it was amusing to hear the troops yelling and cheering\n\nas though they were watching a hurdle race. A British cruiser passed close by going in our direction. We were all called up to attention and buglers blew the salute, which was returned by the warship. Bands on board struck up national tunes including \"Britannia the Pride of the Ocean\" and \"Australia Will be There\". Great enthusiasm on both ships, the bluejackets waving their caps and cheering until they were out of hearing.\n\nArrived Suez Harbour 3.30 pm","19":" having passed Mount Sinai during\n\nthe day. In the harbour I counted over 30 big steamers mostly British India boats. The French battleship Montcalm with four funnels came in that night. This was the one we saw at Aden. \n\nOur mails were put off soon after arrival and we could see the mail boat leaving later in the evening. Suez, with its square shaped white buildings, looked rather a desolate place. The background, as far as the eye could see was sandy desert. We were on board all day","20":" and didn’t disembark until 4pm.\n","21":" During the greater part of the day we were unloading the ship. Some of us were down in the bottom floor of the holds loading the slings. On leaving the ship we had some experience at loading railway trucks. The natives are better at talking than working. Its very amusing to see the native policeman using his stick freely amongst the arabs. Well, we were soon in rough third class wooden carriages which created a frightful noise when the train was in motion. The railway line runs right to the boat. No\n\nsooner had the train started than arabs hopped in and commenced cleaning boots. They didn’t say a word – just knelt down and got to work. No mistake they are a cunning tribe, but when the time came for paying it was noticed that many Australians had their boots cleaned for nothing. Dirty little urchins jumped on the train at each station with baskets of eggs, chocolates, oranges etc and very often, whether they were taking us down or not, baskets were upset. If a darkie sold tins labelled dates and the contents proved to be \n\nTurkish Delight over went the baskets. Most of the railway stations on the run to Cairo are small, some haven’t any fencing round them while others are enclosed by wire. There are, however, a few very fine stations such as Zag-a-Zig, Tel-el-Kebir & Benha. Cairo station is rather a fine one. There was the greatest excitement on our train throughout the journey – At each platform the Indian troops who were guarding the line were cheered and our men were singing from every carriage \"Advance Australia Fair\", \"Australia will\n\nbe there\" & \"Brothers in Arms are We\". We soon found out that there were some much better classes of carriages to those we occupied. One train in particular passed with dining saloons etc on it, wonderfully fitted out, and a party of our boys were lucky enough to get a roast chicken or turkey handed through the window to them from the other train. Hospital trains, painted white with red crosses on the sides and top, also run on this line. At 1 am on Thurs. the","22":" we disentrained at Zeitoun railway station, quite close to Cairo. It was\n\nbitterly cold at the time. We marched a couple of miles through sand & dust to tents in the big camp at Heliopolis. After a few hours sleep we moved on the same day to another position in this large camping ground where over 100,000 Australians were quartered. On Thursday evening we had leave to Heliopolis with instructions not to go to Cairo. Well, it was likely that we would obey orders after being on the sea so long and we particularly wished to see Cairo, so I think every one of us went into Cairo that night. There is rather a\n\nfine tram service here, the trams being of a pretty design.\n\nThe line to Cairo runs in conjunction with the train service. After leaving Heliopolis the tram runs on to the electric railway. We wandered round the city and were greatly pleased with some of the buildings and streets. In the respectable quarters Cairo is far from disappointing especially when one considers such buildings as Shepheards Hotel, the Savoy Hotel and many others.\n","23":" was spent in drill, and plenty of it. In the evening we had leave to\n\nHeliopolis. This also is a fine city and the streets are well laid out. The buildings, though they may be only plastered up, certainly have a good appearance. The square design and flat roof, so common in this country, might not stand rough weather and much rain, but it has a certain attraction about it. One enormous and beautiful building is the Palace, now used as a General Hospital. It contains 1500 rooms and was built by the King of Belgium. Early on Saturday morning the","24":" two well dressed and well-educated Egyptians who spoke\n\nEnglish well came round to our camp and arranged with our officers that we could go with them (the guides) on a tour round Cairo, the fare being 5 piastres equal to 1\/-. Well about 40 of us took the opportunity so in the afternoon we went by tram to Cairo where a number of carriages were waiting for us. Driving first to the Museum we were shown various sculptural works dating back to 4000 years B.C. in the time of the Great Pharoah Rameses II. With the invariable salutation of \"This way, my doctors, if you please\" we went inside\n\nand everything was explained fully, so much so that it would be impossible to remember the long names. The place is full of old curios and mummies. These latter are bodies that have been embalmed or preserved in pitch or some such substance, in many cases neatly bound with roller bandages (now discoloured).\n\nHowever, the process has proved very successful for the bodies are wonderfully preserved. The only mummy of any interest to me was that of Rameses II. He is the Pharoah (or King) so well known in the time of Moses.\n\nHe had 162 children of which number there were 111 boys.\n\nThe engraved wooden cases in which mummies are kept are known as Mummy Cases. Some are very elaborate indeed. In some instances more than one case has been used – for instance, one of Pharoah’s wives was enclosed in four mummy cases altogether, each one being enclosed in another of larger size. \n\nTrinkets and Jewellery belonging to the wives are on view. Leaving the museum we drove past the Sultan’s Palace, Barracks and University through to Old Cairo. We saw the city of the Dead, a \n\nlarge burial ground. The tombs do not appear to go underground at all. They are just stone casings and may be built on top of one another. This, I understand, applies where families are concerned.\n\nThe Magic Pool, a large pond fenced off like baths and lying in a hollow amongst old excavation works, is a place which Egyptians consider miraculous. In recent years an Englishman took it in hand. Certain substances in the water seem to cure rheumatism.\n\nOn either side of the road, as we continue to the Tombs of the\n\nMamelukes, old windmills built by Napoleon may be seen. At the entrance to the big Mosque or church known as \"The Tombs of the Mamelukes\" natives insist on visitors having canvas slippers fixed over their boots, so it was amusing to us when we had to submit to this old custom. Inside, the ornamentation is simply gorgeous. It is hard to credit such artistic work. The tombs of old Pharoahs, rulers, and great men are wonderful. Gold or silver inscriptions on or around the tombs, the fine tiled floors, coloured windows, domes and beautiful lighting arrangements\n\nare worth seeing. Next we visited the Mosque of Amu, the oldest Mosque in Egypt which is only used once a year (at Christmas time). This is a square structure with no roof on it. The stone columns have been built and rebuilt so often that no two are alike. In the centre of the enclosure stands the stone fountain of Holy Water. I fancy this was the place where the Holy Family stayed on their visit to Egypt. If not it is another Mosque I have forgotten. \n\nOur last point on the tour was the River Nile. We drove through dirty\n\nnative streets down to the water where women were washing clothes and drinking from the same spot. Here we climbed into an old wooden boat and paddled across to the Island of Rodah where Moses was found by Pharoah’s daughter. This Island is of particular use at present because of the water gauge which registers the tide on the Nile. The Nile is the main stay of Egypt and, thanks to England, dams have been built lower down to store the water thereby ensuring that the river will overflow\n\nits banks annually. We drove back to Cairo for tea and had another look round the city. As I have said before some parts of Cairo are respectable, but other parts are filthy beyond imagination\n\nOn","25":" we received mysterious orders and everything was packed up preparatory to moving off in the evening. The usual rumours went round, some predicting Gallipoli, some Salonika, and others The Canal. Personally I guessed The Canal. Well, we marched out of the Heliopolis camp at 9 p.m. \nthat\n Monday night the","26":" amidst the \n\ncheers of troops on the sides of the road. The whole 8th Brigade moved and nobody seemed to know where we were going to.\n\nFrom a station near Zeitoun we entrained and were put off at Einghosien near the Suez Canal at 6 am.Tuesday","27":"\n\nIt was a bitterly cold and foggy morning but later the weather became very warm, Indian Mountain Gun Batteries were here at the time, the guns being carried on mules. Now followed a most miserable march to Serapeum. It was not the distance that told on us but the heat and the soft\n\ndeep sand. Well, on arriving at Serapeum we had to start and make a new camp. The position as we found it was just a dreary spot on the Southern side of the Canal. Trees, four to six rows deep, line this bank to shelter ships from the sandstorms. Behind the trees there is nothing but sand except round the banks of the Sweet Water Canal (A narrow creek in fact). On the other side of the Suez Canal as far as the eye can see there is absolutely nothing but sand. Well, we pitched camp and lived on dry bread cheese & \n\nwater for 2 days\n\nThe above is a rough sketch of the Suez Canal showing the position of Serapeum 8 miles south of\n\nIsmailia. The Canal is 88 miles long and 140 yards wide built by an engineer named Ferdinand De Lesseps (a Frenchman). At Serapeum when we first arrived there the only means of crossing the Canal was by a punt worked on chains. A few hundred yards lower down than where we were there was a large camp of Royal Artillery men with their guns while nearby sections of Indian units – Hyderahbad Lancers and Queens Own Sappers and Miners were quartered. Just before we arrived I believe the Marajah of Mysore & the Marajah of Hyderahbad were at Serapeum.\n\nBetween the","28":" &","29":" the H.M.S. Implacable passed in Suez direction. The boys on the banks of the Canal gave her a great reception. The \"Ceramic\" and \"Wiltshire\" both laden with Australian troops went through towards Port Said. A very fine ship, the \"Royal George\" (Toronto) sailed through to Bombay with some of the Black Watch on board whilst numbers of large transports went in the same direction with Indians on board. They were being transferred from France to the Persian Gulf. The R.M.S. Mongolia came through \n\nwith our first mail followed by the French boat \"Sontay\" with Sydney men bound for Vickers as munition makers. On Sunday the","30":" at 8 am the 31st Battalion with over 70 camels and 12 volunteers from our unit under Capt. North crossed the Canal and marched 8 miles into the desert on the opposite side to occupy a sandy ridge as first line of defence and opposition to the Turks. \n\nOur party consisted of Gillies, Wilson, Aspinall, Nesbit, Sullings, Wall, Calfe, Berry, Herford, Henderson, Watson () and myself. We went through\n\na very trying march and then had to pitch camp \n\n20th Dec. (Monday) Making an underground sandbag dugout. Tomorrow I believe we move further out to occupy a more advanced ridge. The trees lining the Canal are visible in the background but the Bitter Lakes further down may be clearly seen. On our way out we passed camel bones & Turkish graves, indicating the scene of battle in","31":" Thousands of Turks we killed here. They actually crossed the Canal and at the present moment the iron they\n\nused are on view in Ismailia. Hundreds of natives are now busy in running a heavy railway up to the Canal bank at Serapeum. In all probability a bridge of some kind will be thrown across the Canal. A light railway is to be run out into the desert, also a metal road for motor transport which will cost £1 per yard. Aeroplanes fly over this way daily from Ismailia. Heard last night that Kitchener, after visiting the Balkans, took a battleship to Port Said then a hurried trip down the Canal to Suez, calling here and there.\n\nFrom Suez he had a special train to Cairo where he visited the Railway Dept. and gave them about 24 hours in which to commence having certain portions of the railways duplicated. This happened only a few days prior to our arrival in Egypt. The signallers who share our rations say that information has been received per aeroplane stating that the enemy have two duplicated railways and two metal roads. They have three camps, one of 500 tents, a second of 200 tents, and a third of 100 tents. It is believed all this is under the direction \n\nof Von Mackensen. Five British warships are stationed on the Canal chiefly in the Bitter Lakes so they can sweep the deserts for about 10 miles. Conditions here would be so trying and the sand so difficult to cross that the Turks can’t possibly come in great force.\n","32":" today we can hear monitors at firing practise. We have just completed a dug out and trench to be used as dressing station Indian Mountain Battery arrived with 2 guns. 8 more to arrive this week. They are small portable guns carried in parts by mules\n\nand the men are from the Hong-Kong-Singapore Royal Garrison Artillery. The range limit of these guns is 4200 yards. Here we were particularly friendly with an Indian named Yessiah who is a Christian & speaks English beautifully. He was in our tent often and explained amongst other things the various Indian customs and religions. Different sects have their own ideas of hairdress, this being perhaps the best mark of distinction. \n\nSome will throw their meals away if a white man happens to come near them at meal time. Others do likewise\n\nif a man’s shadow crosses them. Pork or beef is meat they will never touch. In most of these peculiarities we were warned before arriving in Egypt. It looks amusing to see Indian units moving about and taking their own mountain sheep or goats with them. This will prove a difficult problem in France. The Indian Corporal speaks in praise of a certain English officer who led the Punjabi Lancers against the Turks in Feb.1914. Notwithstanding that the officer had 8 bullet wounds he \nsuo\n urged the Lancers on and captured 8 guns at the \n\npoint of the lance. The Turks were driven back at a great pace and the Indians captured 350 prisoners. Australians get on well with the Indians but for some unknown reasons English troops are inclined to be disliked.\n","33":"\n\nGeneral Staff arrived this morning to select a more advanced position, the result being that we have to move 2 miles further on tomorrow. The event of the day here is the arrival of the Camel Corps every night with water and supplies. Water is carried in\n\nan oblong shaped tin or iron receptacle called a fantasia. One is attached to each side of the camel.\n\nSketch of present position :-\n\n(Small hand drawn sketch of area)\n\nColonel Grant, an English officer, is in command of all operations between Mediterranean and Suez.\n","34":" (\nFriday\nThursday) Struck camp and marched 2 miles further out. It was a hot day and a fierce sandstorm was blowing\n\nDuring the few hours which elapsed before camp was pitched the only way to get comfort was to lie down in the sand and spread a towel over our faces. Even then we would be nearly buried in sand by the time we got up. At night it was too hot to sleep. Capt. North gave us tomatoes and oranges that he had brought with him\n","35":" Very windy day, a continuation of yesterday’s miseries. We commenced digging a big dug-out in the side of a hill. During the day just a few drops of rain fell. Now it is Christmas Eve and we are wondering how \n\nChristmas Eve appears at home. \n","36":" Christmas Day. A glorious day. Continued with dug-out. Col. Tivey, commanding the 8th Brigade came and announced the evacuation from Gallipoli. Plum Pudding, peaches, salmon, pineapple and cigarettes issued. The pudding tins had small paper slips inside with notes from various subscribers to the West. Aust. Red Cross Society. O.C. of the camp read a cable message from Mrs. Tivey sending Christmas Greetings. Desert Xmas never to be forgotten. Australians now being transported to the Suez Canal Infantry are busy\n\nhere making \"bird cages\" on the heights round the camp. Col. Tivey is a well known Melbourne man and is very popular. His men are known as \"Tivey’s Pets\" or \"Tivey’s Tourists\", our own unit included.\n","37":" More pineapple & salmon issued in addition to the very fine meals. Meningitis has broken out in two cases at Serapeum. Second mail arrived per S.S. Orontes. \n\nIndian Bikaner Camel Corps arrived and our chaps soon got busy on the camels riding them all round the camp. British aeroplane flew over at 9am\n","38":" Today I had the job of sewing bags together for a roof to the dug-out. Judging by the measurements of this dug out it displaces about 60 tons of sand. Had my hair cut right off for the first time. Most of the others had theirs done on the boat. Indian Camel Corps sighted 12 Turkish scouts only three miles out and the information has been sent back to headquarters.\n","39":" Completed dugout and trench leading into it. Indians report having again sighted Turkish outposts. Nothing else of importance today.\n","40":" \n\nMore signs of enemy scouts in the early hours of the morning. Horse marks have been discovered on the sand only half a mile out. Orders stated that in case of alarm tents had to be dropped immediately on hearing a whistle blast and all hands were to man the trenches. Well, for practise, a whistle sounded at 10 am today. Some of our boys thought they would have a joke so they dropped the tent before we had collected our things, the result being that some of us got tangled up and couldn’t\n\nget out. By the time we did find the doorway the alarm was over and Major Hockley the O.C. had congratulated the men on their smart work. The whole camp had been dropped and trenches manned in half a minute. Some new aeroplanes have arrived at Ismailia. In this town there is a hand grenades and bomb factory worked by Indians. Jam tin bombs are made out of ordinary jam tins with a stick of gelignite and from 50 to 150 rough pieces of metal inside. Col. Tivey and Lt. Col. Clarke (English Officer lent to the Brigade as second in command)\n\n \n\narrived on horseback to inspect the position. They first inspected the dugout and late on had their dinner in it. Capt North told us that these officers fully expected to hear that we had been attacked and were a little surprised that no engagement had taken place. \n\nTowards evening important news came to hand. All guards and sentries were doubled and sent out earlier than usual with strict instructions from the Major. Shortly after we Field Ambulance men had gone to bed and the trenches had been manned at spaces\n\nof from 7 to 10 ft apart I heard an order shouted out \"No 3 face outwards and load your rifles\" Later on the challenge \"Halt\" was heard frequently, especially by the Indians. Evidently there was a chance of something doing\n","41":" Dec.1915 (Thursday)\n\nWe heard that further down near Aden there has been a small fight between New Zealanders & Indians and the Enemy. A few casualties resulted. Camel Corps and Mountain Battery returning to Ismailia today. Infantry here are being relieved on Monday but we want to\n\nremain longer. Lice are very bad in the camp but luckily enough none have come to our tent.\n\nPlan of present camp 10 miles from the Canal.\n\n(Hand drawn map covers rest of page.)\n\nBirdcages are circular sandbagged dugouts about 30ft in diameter and may contain 1 officer 4 N.C.O’s and 28 men. Tonight we were listening to the experiences of another Indian friend Tikakhan, whose full name and address is \n\nActing Naick Tikakhan 1390\n\nNo 1 Mountain Battery\n\nH.K, S.B. R.G.A.\n\nIndian Exp Force, Egypt.\n\nHe was in the South African War under Col. Kitson (now in some high command in France) when he (the Indian) was shot through the head. The mark is still there. Today two companies march a few miles further\n\nout to have a look at the country. 9 of our party went with them. The country as far as the eye could see is one vast sandy stretch. From this high sandhill we could see over others not so big and the view before us covered between 30 and 40 miles. Daily an Indian patrol of Lancers numbering 12 leave Serapeum and scout the deserts even further out than where we are.\n","42":"\n\nFirst Aid work and Stretcher Drill. While the Capt. Wasn’t looking they upset the stretcher\n\nwhen I was acting as patient. It was a rather steep incline so I went rolling down the slope. News that we return to Serapeum on Sunday. During the afternoon we were trying experiments with a view to storing water. Tent bags were put into holes under the sand but didn’t prove a success. I can’t understand why they don’t send out a few tanks. This appears to be the only way out of the difficulty.\n","43":"\n\nVisit by Colonels to inspect Camp otherwise things very quiet. We have to return to Base tomorrow.\n","44":" In morning preparing for return to Canal. Left Hockley’s Hollow at 2 pm and the march that followed proved very strenuous. We reached Serapeum at 5pm. The distance of 10 miles seems very mild but considering the nature of the sand the trials are 100% worse than marching on roads. A few were confined to Hospital after it. The metal road and light railway I have already referred to are now in course of construction by thousands of natives.\n","45":" Today I was put on a job in the \n\nQuarter-master’s store painting and stencilling.\n","46":" Though not yet recovered from our last march we were called upon to do another today of approx. 10 miles. We were given the afternoon off to do some washing. Its mighty hard work in cold water. Launch sunk in Canal with ammunition, rifles and kits aboard.\n","47":" Off duty all day with boil or abscess, not sure what it is. Frightful sandstorm blowing. Bitterly cold. Fragments of war news now being posted up for first time\n","48":" Sandstorm still blowing & weather very cold. 7th Engineers arrived. Met numbers of Mosman boys including Bill Bennetts and Jim Kernaghan.\n","49":" Continuing on light duties – Attending telephone, taking messages.\n","50":" Stretcher Drill & First Aid out on the sand hills. H.M.S. \"Glory\" passed going Suez direction. H.M.S. \"Jupiter\" also passed in Port Said direction. This latter boat has apparently been doing good work on the Baltic Sea, according to the \"Sydney Mail\". Football match in afternoon.\n","51":" On guard all day. Big steamer Marwarri sailed down to Suez.\n","52":" Issued with Jack Knives. Otherwise nothing of importance.\n","53":" Digging trenches and dug-out over on the soft sand hills all day\n","54":"\n\nLight Duties again. Preparations are now advancing rapidly on both sides of the Canal. Natives are busy cutting a roadway to the water edge, removing the sand in small baskets. Railway to Serapeum also advancing.\n","55":" On guard all day & reading.\n","56":" Route march along railway line in morning. Short lecture in afternoon. At 7 pm we had to go out in the dark for practise at carrying and finding wounded. Rather a stupid adventure. I helped to carry two 12 stone men over a long distance and was pretty well knocked out after it, so were the others.\n","57":" Beautiful day. Stretcher drill and lecture on Morphia Inoculations. Afternoon off\n","58":" A memorable\n\nChurch Parade in morning. Chaplin Beveridge asked that the men drop all thought of his rank as Captain, because he considers he isn’t entitled to it. Word came to hand that General Wilson would be coming down the Canal in a launch so we were lined up on the bank as he passed. A train was brought down the canal on a barge and placed on to the railway line opposite by means of a huge crane. Some of our men were over the other side today after curios which they took from the Turkish dead bodies, at present protruding\n\nfrom the sand\n","59":" Digging dug-out. Xmas comforts given out – mostly from Mosman people. A raft was overturned on the Canal today and 17 men were thrown into the water. One man was drowned. Another was in our tent tonight and the incident seems to have upset him. I was talking to some Engineers tonight and they were referring to certain \"bonza\" graves over the other side of the canal. One man says he intends taking a shovel over to unearth the German major and get a few curios.\n","60":" Long route march along the fresh water canal from Einghosien to the Bitter Lakes then back along the Canal. First Aid lecture in the afternoon. Engineers are rapidly constructing elaborate trenches on the other side of the Canal.\n\nToday General Godley carried out an inspection of the camp. A monitor passed in Suez direction, also a hospital ship and big P. & O. Indian Liner.\n","61":"\n\nStretcher drill and lecture on application of bandages. \n\n\"Kitchener’s Vultures\", big birds for eating up rubbish, such as\n\nmay be seen at Heliopolis in thousands are hear at Serapeum also. These huge birds, I understand were imported originally \nimported\n by Kitchener.\n","62":"\n\nStretcher carrying over long distances across the sand. Trial trip over the new railway branch line to Serapeum. An engine pushing one carriage. O.C. & others went to Ismailia to select our new camping ground there. 500 camels arrived with Indian transport from Ismailia.\n\n21st Jan (Friday) On guard. Camels crossed Canal.\n\nRumours that 8th Brigade are to be used as reserves in Ismailia whilst all the other troops form the","63":" line extending as far as Serapeum.\n","64":" Colonel Shepherd arrived to take charge of our unit. Stretcher carrying. Very striking scene as the H.M.S. \"Implacable\" came back up the Canal. With bands playing and bluejackets cheering from on board this magnificent ship, and the troops ashore giving deafening cheers, the incident was most impressive.\n","65":" Church Parade. Sergeant from 29th\n\nBattalion was today run over by a train. Both legs were cut off so he soon died. It was a terrible sight.\n","66":" Carrying heavy stretchers all day. Trains arriving throughout the whole day with troops of the 5th, 6th & 7th Battalions from the Dardanelles. All seem to agree that the evacuation of Gallipoli was the only thing possible because neither side could move on account of the numerous machine guns. Beachy Bill the mystery gun appears to have been troublesome.\n","67":" Actually\n\nraining hard last night – an extraordinary thing here. \"Ascanius\" passed in Suez direction. Sheepskin vests issued. They were presented by a person in Australia. Bitterly \nclol\n cold day. Thousands more Australian troops arriving. A pontoon bridge was towed down. This is to be the means of crossing the Canal at Serapeum.\n","68":"\n\nBridge now completed over the Canal and transport going across. Shipping is stopped between certain hours in the daytime. Bitterly cold. Kit inspection.\n\nespecially as our clothes are wet.\n","69":"\n\nStill raining. Wood supply has runout due to poor management. No more warm meals until supply replenished. Troop trains arriving all last night. On the other side of the Canal there is now a huge camp much larger than Liverpool and Serapeum looks quite busy \n","70":"\n\nMore troops arriving last night. It was too cold to sleep. Clearing Hospital arrived today. French mail boat \"Amazone\" passed. More of that strenuous training – carrying \"wounded\" (supposed) over sand.\n","71":"\n\nBeautiful day. Lying on bank of Canal all day reading. New Zealand troops arrived including Artillery. On guard at night.\n","72":" Another lovely cloudless day. On Guard. Artillery and long line of transport waggons crossed over the Canal. Cartloads of timber and limbers loaded with new stretchers & material replacing that which was lost on Gallipoli also went across.\n","73":" Whole unit went out for the day with tents, medical supplies\n\nand stretchers just as though in action. I was on telephone duties again. 4 Battalions of Infantry arrived Serapeum also advance guard of the light horse.\n","74":"\n\nWarship H.M.S. Cornwallis passed in Suez direction. She has some big guns aboard also antiaircraft guns. This was a fine sight especially as it happened to be a beautiful day. Bluejackets cheering & band on board playing \"Tipperary\". Our boys cheered themselves hoarse.\n","75":" Orders to prepare for departure to \n\nTel-el-Kebir, the Ismailia movement having been cancelled. Everything packed up and sent to Railway including our tents. \n\nH.M.S. Jupiter passed bound for Suez – she is a big ship with funnels side by side. The New Zealand Mounted Rifles are transporting our baggage. Assisted in carrying patients across the Canal to the Clearing Hospital. On the other side I was surprised to notice how rapidly preparations have been advancing. Road, heavy & light railways are now well in hand. Saw trench mortars for the first time. 7 Battalions of the \n\nin old buildings last night. More dug-out- digging today. We are now temporarily attached to the","76":" Division (Aust.). For some time there has been some doubt as to where we will eventually go. We have been with the","77":" Indians for a time. Other Australians wanted us as we are yet unattached \ndefinitely\n to any particular division. It is thought that we are to be part of a new division consisting of the","78":" &","79":" Brigades and a new brigade composed of reinforcements from round Cairo. If so we shall most likely be going to France first. Turks\n\nSerapeum from four to five million pounds. Raining tonight \n","80":"\n\nBeautiful Day. Had photo taken near the new filtering works. This is a big bit of engineering carried on by natives under French supervision. It is a scheme of purifying the water from the sweet water canal which at present is forbidden on account of Bil- germs. Today I was carting water on camels. \"Hororata\" (Plymouth) A20 sailed down towards Suez. Carried queer case of paralysis across Canal to Clearing Hosp.\n\nMinelayer H.M.S. Magnolia passed in Suez direction. It was a treat for our eyes to see this ship going at a good speed drop a lifeboat full of bluejackets. Immediately the boat touched water the inmates rowed swiftly to the shore with a rope to secure the warship against the side of the Canal. She was now pulling up to allow a troopship to pass. Mines are dropped over the stern by apparatus supplied for the purpose. The ship resembled a destroyer & 2 guns were visible to us. \"City of Cairo\" and P & O. \"Arabia\"\n\npassed in Port Said direction. Daily a number off native boys come round the camp with tomatoes & oranges etc. for sale while occasionally we get a newspaper \"The Egyptian Mail\".\n","81":"\n\nShowery. Fun with natives collecting rushes down the sweet water canal. After making these Arabs carry the bundles back we got them to show us how mats are made, so we had a good illustration. It was very interesting to note the use made of palm leaves for\n\nbinding and the way the men use their toes for twisting the string made from the palm leaves. A few loaves of bread served as good payment while a cigarette given to one of the natives, containing Cordite, proved amusing. More practise in carrying patients over sand in the afternoon. The railway siding which branches off the main branch line near Serapeum platform and runs to meet the metal road from the cutting through to the pontoon bridge is now complete, and the first train came in today.\n","82":"\n\nBeautiful morning. Long route march to the Bitter Lakes. The scenery just where the Canal runs into the Lake is very pretty. We were in the Lake for a swim but the strange part about it is that the water is only knee deep except where the channel passes through so therefore we could go out close on a mile and not strike deep water. In some places it is impossible to see the other side of the Lake. On the shores for some distance back there is a thickness of salt resembling snow. Lecture on the Geneva\n\nConvention in the afternoon. The Convention, which originated in 1864 and was amended in 1906, was signed first by Great Britain in each case. It was explained to us that Field Ambulances are the most important medical units in warfare. The Germans, beyond doubt, do not recognise the Red Cross, but the Turks are given the highest praise by all. Capt. Wooster referred to certain incidents on Gallipoli when we abused the Red Cross. These incidents are verified from what we hear the troops relating. \"Borda\" passed homewards.\n","83":" Morning signalling. Afternoon Squad Drill. Naval Bridging Train arrived. Timber arriving in trainloads probably for Mess Huts and trenches over the other side of the Canal. Surprise in evening when Bill Lang and Beech from Brighton called on me. Guthrie from B.G.S. in the 18th A.S.C. Sailor Law Lieutenant. Live Stock are now pretty bad in the old buildings. \n\nTonight a raid as made on a gambler den close by and great excitement prevailed.\n","84":"\n\nInstruction in carrying\n\n4th Fld. Art. Supply Column arrived. Mails per \"Arabia\" received.\n","85":"\n\nTwo monitors, the \"Scarab\" and \"Aphis\" passed in Suez direction. \"Kyarra\" & \"Medic\" loaded with troops going Port Said direction. \"Athos\" big Indian P. & O, and \"Osterley\" bound homewards. \n","86":" 1st Field Ambulance arrived\n\nand went across Canal. \"Corsican\", a big steamer passed bound for Persian Gulf with East Lancs aboard. Beautiful day. Lecture on bones by Capt. North. The monitors that passed yesterday were peculiar looking boats. They have two large calibre guns, like 11 inch, one forward and the other aft. Several anti-aircraft guns were visible. These warships are slightly longer than a destroyer – the funnels, bright blue in colour, are set side by side and the stern is very broad with 3 rudders attached.\n","87":" Dull\n\nday and showery. In the morning we had a comical display of incompetency on the part of our officers when they were trying ceremonial movements with us, marching past etc. Signalling and Lecture on breaks and fractures by Capt. Wooster. A.M.C. Comforts distributed. \"Ceramic\" bound for Persian Gulf with 9th Hants aboard – The cheering was intense. Voices from the ship \"Will we win\" \"Yes!\" & \"Are we downhearted\". In the evening a monster P. & O. liner passed homewards. It was a magnificent ship and the lights on board set it off well. The\n\nP. & O. Coy. seems to run a better class of vessel to India than to Australia. This one came from Bombay.\n","88":"\n\nMarch up sweet water canal and back with full equipment on. In afternoon Lecture by Capt. Irvine on Antiseptics and dressing of wounds. Todays orders contain special reference to France, It is now stated that the French people at first didn’t wish to have the Australians in their country so special efforts are being made by our Commanding Officers to enforce discipline. Personally I never expected to go\n\nanywhere else but to France. At present there is a huge camp of N.Z. Mounted Rifles behind us. A long train of 600 camels today passed over the pontoon bridge. Beautiful day.\n","89":"\n\nGlorious morning. The monitors \"Aphis\" & \"Scarab\" returned and this time I had a good look at them. They draw only 4ft of water. The \"Scarab\" is slightly an improvement on the other inasmuch as she has maxim guns. Lecture on First Aid by Capt. Donald. First replies to our letters written on board the \"Ascanius\" received this afternoon.\n","90":"\n\nLovely day. We were out all the morning running over soft sand after \"acting\" patients under supposed heavy fire, practising taking cover. It was most exhausting work. Another swim in the Canal. Boatload of Tommies passed for Bombay. H.M.S. Cornwallis came past in Port Said direction. Today trainloads of huge motor lorries are arriving.\n","91":"\n\nFrightfully windy, sandstorm blowing. In the morning Semaphore signalling and carrying \"supposed\" wounded,\n\ngenerally the heaviest men in the Ambulance. Afternoon off.\n\nThe wind ceased and a beautiful moonlight night followed.\n","92":"\n\nChurch parade, at which Brigadier-General Tivey (recently promoted from rank of Colonel) had is cross batons on. Had my hair cut right off again today. Indian Hospital Ship passed in Suez direction. In the beautiful moonlight night which followed I was noticing the vast difference in the stars as compared with the Southern Hemisphere. Over here we seem\n\nto see millions more than are visible from Australia.\n","93":"\n\nLovely morning. Long route march up Sweet Water Canal in morning. In afternoon lecture of Fractures and Semaphore Signalling. Infantry leaving from the other side of Suez Canal in trainloads, possibly for Tel-el-Kebir. Amongst the dirty arabs who hang round the camp daily there are two nice looking and well mannered little boys who bring us boiled eggs. We give them bread, jam and many a good feed.\n","94":" Bright \n\nday. Swim before breakfast. Combined order drill all morning. \n\nP. & O. Mail steamer \"Kybir\" passed bound for Australia. Ladies on board waving and old gentleman throwing cigarettes and tobacco ashore. There was great excitement on board when one of our men (Richards) jumped in the canal with all his clothes on, hat and wristlet watch, after a tin of cigarettes. Lecture on Commonwealth Military Regulations & Kings’s Regulations by Capt. Donald. Grand sight as huge troopship with Scotch on board passed for the Gulf. The ship was alive with bagpipes.\n","95":"\n\nCompany drill in morning. Lecture on scalds and burns by Capt. North in afternoon. Big steamer \"Northland\" passed homewards (N.Z. Transport). There is great excitement in the Infantry lines tonight in view of their departure tomorrow morning for Tel-el-Kebir. We at last have our orders to move also. For three weeks we have been in suspense and are still living in the old buildings.\n","96":"\n\nAll prepared for moving, presumably for Tel-el-Kebir,\n\nwhen orders came stating that through railway disorder we can’t go till tomorrow. Issued with small ¼lb tins of condensed milk each.\n","97":"\n\nCleared Camp. Heavy day transporting luggage. After marching to Serapeum railway siding platform wet through with perspiration we loaded the train then moved off for Tel-el-Kebir, some in cattle trucks. Arriving at Tel-el-Kebir we had another miserable few hours unloading all our cumbersome luggage. By the time we got settled down in\n\ncamp after pitching the tents it was 11pm. Then to add to our tired feeling I was one of the unlucky ones to be put on piquet all night. \n\nThe present camp site is right on the old famous battlefield of Tel-el-Kebir were Wolseley, Gordon & Kitchener scored the terminating victory over the tribes in 1882. There is a tremendous camp here far ahead of Liverpool in administration. It is well laid out and clean but the evil smell in the atmosphere is a contrast after the pleasant air at the Canal.\n","98":"\n\nSetting out new camp. Visit by Harold Alcock, Hughie Steanes and Reg Cannon. We had our photos taken together. Went for a stroll through the lines in the evening and was surprised to note the gambling that goes on also the numerous cases of drunkenness.\n\nAll the units seem to be undergoing changes with a view to reorganising the Australian Forces. For instance, a Field Ambulance which hitherto consisted of 3 sections A. B. & C. with their respective subdivisions of Stretcher-bearers, tent division & transport all capable of acting independently, is now losing\n\nthe C Section so that other Field Ambulances can be formed from the \"C\" Section of each Ambulance now in existence. It seems that we are going to reduce the strength of Ambulances to 2 sections.\n","99":"\n\nNo work today. Visited friends in the Artillery and stayed there all afternoon. Met Lennie Rial. Quirk from the Ocean Co. called to see me in evening.\n","100":"\n\nBeautiful day. Morning squad drill. Meeting of officers to see what can be\n","101":" to start a sports club. Up till today including all camps since I enlisted we have been doing some physical exercise before breakfast but now this has been cut out. One point, however, doesn’t seem to slacken and that is with regard to dress. Every morning boots have to be clean, face clean shaven. We have to turn out fully dressed with belts on every day, no matter how hot the weather may be.\n","102":"\n\nBeautiful Day. Long Route march across the old battlefield for about 5 or 6 miles. Came\n\nback like drowned rats. The ground here is hard and covered with gravel. The old earthworks of 1882 still stand and bones may be seen sticking out of the ground. Infantry men are busy burying these remains. Afternoon signalling. Concert at Y.M.C.A. in evening. Instructions apply in our unit that nobody is to drink water until it has been boiled because of the likelihood of catching Typhoid Fever so every day we have to fill our water bottles with boiled water. Strange to say, no other unit here does this.\n","103":"\n\nVery warm. Stretcher drill in morning, heavy work that made us too tired to do anything in afternoon. Luckily enough we were not asked to. Today a list of Cairo leave came out but unfortunately I have to wait till near the last. Orders were issued this morning with reference to respecting the graves of fallen men and we were warned not to touch the various burial places. As usual some ruffians are bound to hunt for curios so it has to be stopped in future.\n","104":"\n\nAnother route march round the old earthworks and more signalling. With Lennie Rial & Allan Bruce I witnessed a queer performance in a canteen – A big burly Australian was actually eating crockery. He bit a mouthful out of a saucer, chewed it up, then drank a bottle of sauce after it. This is a positive fact.\n","105":"\n\nFearfully hot day, In fact the hottest since leaving Australia. Stretcher Drill in morning with the usual red-tape of having to turn out with tunics on. 11.30 am to 3 pm off,\n\nthen the \"never to be forgotten\" French lesson which caused a great deal of amusement. These hours viz midday spell, were marked down as future timetable. In the evening a party of us went to the pictures.\n","106":"\n\nStretcher drill .Cricket match in afternoon. Otherwise a quiet day. On guard at night.\n","107":"\n\nOn Guard. Continuation of Cricket Match. 8 Ambulance Waggons and over 60 horses transferred to us from the 4th Light Horse Field Ambulance.\n","108":" Very\n\nwarm day. On Quartermaster’s Fatigue. This gave me an opportunity of having a good look over the Field Bakery where 22,000 loaves a day are turned out. Saw Sherring from Mosman on an Artillery Waggon and Lieut. Sandford from B.G.S. The artillery are preparing to leave Egypt. \n","109":" Hot day. \n\nOn Cooks Fatigue, carrying water all day. Measured for helmets, khaki drill tunics & long trousers. In one respect this was one of our units’ most unfortunate days – We are losing two officers who have\n\nbeen with us from the start and who are well liked by all. Capt Donald is generally looked upon as the father of the Corps. He certainly worked night and day in our interests. As regards Capt. North I never heard him growl once – In fact I really don’t think he could. Well, we lose two thorough gentlemen from a batch of fine officers the likeness of which no other corps can boast. They left this afternoon after shaking hands all round and departed with watery eyes amidst the cheers of true appreciation from the boys.\n\n8th March (Wednesday)\n\nVisited Ismailia to bring back Red Cross cases and also to make enquiries respecting money sent to me from Australia. Moascar Camp, near Ismailia, is even larger than that at Tel-el-Kebir. Seven aeroplanes were up flying over the camp. I passed trainloads of the Royal Horse Artillery en route for France. Our 1st &","110":" Divisions here are preparing for their departure to France. In Ismailia I passed General Birdwoo’s house and, walking past the lake, I saw quite a number of warships including the monitors\n\nthat passed us at Serapeum. A few French warships were also at anchor. Ismailia is indeed a very pretty little French town. On my way back to Tel-el-Kebir the train guard, who speaks English very well, related the full history of the Tel-el-Kebir battle to me.\n","111":"\n\nMaking mud bricks and ovens for the cooks. About 40 new A.M.C. detail men arrived and are being temporarily attached to us.\n","112":" Mail day. On water fatigue for the cook house. Took 4 horses down\n\nfor their daily drink over the other side of the railway.\n\n11th March (Saturday)\n\nOut for field work in morning with waggons. Rain fell heavily about mid-day preventing cricket match with the 8th Engineers. Heard tonight that Wilfred Bailey is with the 6th Field Ambulance","113":" Division at Ismailia and strange to say Capt. North has just been to our camp to ask me if I would go to Ismailia tomorrow for him with papers for Capt. Donald\n","114":" Visited Ismailia and met Bill who was within\ng\n 100 yards of\n\nwhere I had to go. I returned to Tel-el-Kebir that night in company with Baker who lived opposite us in Holt Av. Mosman. He is a Serg. Major in the Camel Corps. I also passed Lenehan from Mosman on the Ismailia station. Aust. leaving for France.\n","115":"\n\nVery warm day. Innoculated this morning with Para-Typhoid cerum, injected as a means of preventing Typhoid Fever. This weakens the system for 48 hours afterwards so all duties are suspended during that time\n","116":" Doing nothing all day on account of \n\nyesterdays injection. Called on Stanton & Wilcox of the 53rd Batt. who were tentmates of mine at Warwick Farm Sydney.\n","117":"\n\nStill warm, Guard from 12 am today till mid-day tomorrow. Norman Lillyman from S.C.E.G.S. came to our camp today to look up friends. He used to be in my class at school. Conversation turned to Sidney Pickles the airman who was at the school when we were there. Today I requested that in accordance with the privileges allowed troops over here an Anzac Book should be posted home direct from the \n\npublishers.\n","118":"\n\nWarm. On Guard in morning. In the evening a party of us went to the pictures. There being only soldiers present interjections from all quarters of the show are numerous and witty. There was a disturbance at the door on leaving when a few of the troops ran off with chairs after upending the nigger who tried to interfere. On the way back to camp we saw the last 8 rounds of a fight Dyer v Neil both Australian boxers.\n","119":"\n\nStretcher work using waggons.\n\nA.M.C. Comforts distributed. Royal Welsh Fusiliers arrived and encamped next to us. They are unfit for further service, having been through many a severe battle. They say that they passed Australian Troops on the way across. These would be our 1st & 2nd Divisions en route for France.\n","120":"\n\nShowery. One of our horses was kicked by another today & had to be shot. Cricket match v N.C.O.’s in afternoon. Some of our boys who were in Cairo today produced silks etc. which they say were the result of a little\n\n\"pinching\" expedition. It seems that they were on a tour round Cairo on donkeys and, like the rest, they don’t trouble to get off the donkey before entering a shop. The whole turnout goes up to the counter heedless of the surprised native.\n","121":" Carrying water again all day for the cookhouse. I was surprised to meet Bert Newman from Mosman who is camped close to us with the Engineers.\n","122":"\n\nInoculated again. Artillery A.S.C. & numbers of other troops leaving Tel-el-Kebir for France.\n\nHuge tents have been created near the railway and in them Military Canteens are opening. Just over on the other side of the railway close to the station there is rather a pretty little cemetery containing the graves of victims of the 1882 battle. The only monument some have are little wooden crosses inscribed with words like these \"Sacred to the Memory of an Unknown British Soldier\".\n","123":"\n\nAll day off due to the second injection yesterday. I saw the Australian Mail going through in four iron-barred vans. Met\n\n \n\nSmith & Cullen, the latter is a son of our Chief Justice. They both live in Mosman and were at school with me. Their Artillery Unit leaves today for France. Issued with helmets, khaki tunics long trousers & puttees today also Plum Puddings.\n","124":"\n\nStill off duty. This was an eventful day inasmuch as the Prince of Wales accompanied by General Irvine, a brother to one of our officers, inspected the camp. An escort of Indian Lancers were in attendance. The whereabouts of the Prince while passing through the various lines could\n\neasily be followed by the intense cheering. Cases of Gas Helmets arrived.\n","125":" My friend Stan Wilson and I were informed late last night that we could have leave to Cairo today so I immediately ran down to the railway station and enquired whether any goods trains would be running this morning. If so we might catch an earlier train than that which leaves at 11a.m. Being informed that a goods train might go through about 6 a.m. we got up early and were not disappointed. However, the amusing part of\n\nthe adventure was that we took exactly 7 hours to do a 2 hours trip so didn’t gain much by dodging the 11 o’clock train. During the stop at Sheblanga station we strolled round the village in company with the engine driver and guard. Judging by the crowd that followed us round one would think that they had never seen Australians before. On arriving in Cairo we made for the Pyramids with a guide. From the tram terminus we rode round the Sphinx & Pyramids on donkeys. We got off the donkeys and, passing through the various\n\nbatches of \"land sharks\", went inside the largest Pyramid. The inside is certainly a wonder, like the whole structure, but I never again wish to go into those narrow and evil smelling passages to see the King’s Chamber & the Queen’s Chamber. An everlasting mystery about this place is – \"How did they get the coffins (or mummy cases as they call them) in and out\"? Another mystery is \"How did I get in and out with boots on\"? because the stones are frightfully slippery. Well, when we came out absolutely wet through with perspiration, we were \n\nmet by hundreds of arabs who all wanted tips for some reason or other. We have been in Egypt long enough to be just a little too old in the head for these \"Gypos\". They therefore soon got the word to \"Imshi\" or clear off. As we expected, the donkeys and the man had gone so we had to walk back. It will be much better if I get an official book giving particulars of the Pyramids etc than to say much here because every Arab has a different tale to tell. At any rate the largest Pyramid (Choeps) is 410 ft high and it took over 30 years to build. We didn’t climb up\n\nthe outside – It was too much like hard work especially as we were so worn out by the heat, and considering that the stone blocks are about 4ft square. We therefore left the climbing for others. After wandering round the city and an exciting ride in a garry or carriage to the Bank in order to be there by 5 o’clock we returned to Tel-el-Kebir. \n\n24th March (Friday)\n\n8th Brigade left Tel-el-Kebir for Ismailia by train. We also have received orders to prepare for moving. It is now definitely known that\n\nwe are attached to the","126":" Australian Division. All our baggage has been packed up and carried to the railway. Hughie Steanes again called on me. In the evening a party of us paid our last visit to the pictures.\n","127":"\n\nOn Cooks Fatigue. We are now preparing to leave on Monday. The distance of about 44 miles has to be marched. It will certainly be an ordeal because such a march has only been undertaken once before in history and then only with the loss of 400 who died on the way.\n\nBrigadier General Tivey has evidently foreseen difficulties seeing that he has taken his men by train. At night we slept in the open under a heavy dew.\n","128":"\n\nMore preparations to move followed by another sleep in the open.\n","129":"\n\nRoused out at 4 a.m. and commenced the journey at 6 a.m. in a heavy fog. The arrangements were that we would halt for a spell of 5 minutes every hour. The country over which we passed today was\n\nheavy going – here and there a patch of soft sand had to be crossed but generally speaking it was all hard gravel ground as far as the eye could see . We halted at Kassassin for dinner consisting of bully beef & biscuits then continued to Mehsamah where we halted for the night. Kassassin is the scene of an old battle in the Soudan Wars. The units engaged in this march are Battallions of the 14th Brigade and about 50% of our unit totalling just over 4000. 15,000 troops will be moving during the week on foot but over a different route. Well, up to\n\ntonight a considerable number dropped out exhausted – In fact the lot of us were very footsore & tired after the day’s 16 mile tramp, with full equipment on of course. \n","130":"\n\nUp at 4 a.m. and resumed the march at 6 am bound for Moascar 22 miles off. Gradually the heat worked up to a fearful temperature and before long we were into soft white sand – From then on the whole journey was nothing but torture. The sand slipped from under us and made conditions almost unbearable,\n\nadded to by the intense heat. When the 5 minutes spell came we preferred to stand up rather than sit down because the heat thrown off from the sand was like a furnace. The infantry dropped like flies – then the order was given to us to spread out and render assistance where possible. The column was no longer marching, but straggling. Hill after hill we passed over and nothing in sight but more sandhills, when suddenly what appeared before us was hard to realize. Yes, it was an oasis, a water hole surrounded\n\nby palm trees in a hollow between two sandhills. Away behind us lay the poor wretches who couldn’t stand the strain. Our waterbottles were burning hot and what little water we had was almost boiling so we were glad when told we could go in for a dip. \n\nThe infantry, who by this time were scaling the next hill, were forbidden at the point of the revolver to go near the water. Now begins the fearful part of it – The sun had by this time increased its heat and down dropped the poor beggars in hundreds –\n\nEvery hill was a painful scene. Naturally what water the men had was soon finished so there they were – begging most painfully for just a mouthful. Our ambulance men were running here & there all over the field but we only had our little drop of water. This however went to only the very serious cases but I’m sorry to say they were too often serious. Men were groaning in agony, some offering all the money they possessed for a mouthful of water while others were almost lifeless on the sand foaming at the mouth. It was a treat to\n\nhear these words from some who were truly bad \"Yes, mate keep it for worse cases than mine – there are plenty of them\". Dodging about amongst the fallen as fast as his horse could carry him was our Major Williams, a Bendigo man, and one whom the infantrymen praise as a \"white man\". He worked beautifully. This officer stands out from all others though they all let their horses to convey somebody in. Well, gradually we plodded on until at last we could see the tops of tents 5 miles off – The last hill had been overcome\n\nbut still the men dropped. All our water had by this time given out so we could only stick rifles in the sand and spread waterproof sheets up to keep the sun off the men as we came to them. With packs and rifles which we were carrying for the infantry though our destination was in sight and our will powers said \"Keep going\" you would never understand how our legs simply refused to move more than about 6 inches at a time. I can well understand the others dropping. There, ahead of us, were the remainder who\n\nwithstood the trial, a mere handful of men looking something 50 in number. At last we got in and dived for water. New Zealanders were by this time coming out with water bottles, whole Battallions of them, and some of our own men too. Long after darkness had set in the N.Z. waggons, some drawn by 12 horses, were bringing in the patients. No men ever did such a good turn as these New Zealanders. They invited everybody they met to go over to their tents for tea and something to eat – then, just\n\nas we were getting into bed (in the open) round they came with 4 dixies of tea for us. The infantry were treated in just the same way. It may be taken for correct that a Major shot himself and some died en route while about 5 died in hospital afterwards. Altogether from 9 to 13 are believed to have died. In 1882 Wolseley marched over precisely the same route only he started at the opposite end to us and at a different time of the year. In addition he had the sand first – yet he lost 400 in deaths alone.\n","131":"\n\nAnother fearfully hot day. Commencing a little later than hitherto we resumed the march which today only consisted of going through Ismailia and across the Canal to Ferry Post Camp. The Prince of Wales was riding round us at Moascar just before we left and the boys gathered round him. He watched us march out. \n\nThe change of surroundings form sand to green trees and a good road made conditions much better today. By the way, this road in Ismailia\n\nwith trees overhanging is something beautiful. We moved over the pontoon bridge, which resembles that at Serapeum, and encamped. Later in the afternoon we came back to the Canal for a swim\n","132":"\n\nFearfully hot. On Cooks fatigue. Hospital tents being erected to receive 156 patients as a result of the march. Gen. Irvine, the man responsible for the march is to be court martialled. We expect to be moving 9 miles further out in a few days time.\n","133":" Fearfully Hot. Digging rubbish pit. Swim in Canal. A rather good road and a light railway known as the Anzac Desert Railway run out some 9 or 10 miles from here to Rail Head. The train engine is run by petrol. The 5th Division is now being concentrated at Ferry Post. Met Day & Sherring from Mosman.\n","134":" Still hot. On Guard. Met Colin Smith an old tennis clubmate who is now a patient in our hospital as a result of the march. Fun at canteen in\n\nthe evening when we walked off with a number of glasses. Concert in our tent at night. A newly formed band is practising all day near us and the noise is something awful.\n","135":" Moved out 9 miles to Rail Head. I went with the advance party in an Ambulance Waggon. The remainder followed on foot a few hours later. Having dumped the baggage, which consisted of about 40 waggon loads, on the sand, we slept in an enclosure formed by boxes to keep the wind off us. It was ridiculous to cart all\n\nthis gear out here. We could well do without most of it. \n","136":"\n\nSorting \"A\" & \"B\" Stores on account of each section going to a different destination further out. The Transport Sections are to remain at Rail Head also Headquarters. At 6 p.m \"A\" Section moved off to Road Head North bound for Duntroon Plateau a distance of 3 miles. The road does not run out all the way – It ends about a mile short of Duntroon Plateau. We didn’t know this till we got there so when it was found that the transport waggons couldn’t cross the sand\n\nwe bivouaced there for the night. For protection from the wind I scooped a hole in the sand and slept in that.\n","137":" I was left behind with a rearguard of 6 men to look after the baggage until a good team of horses arrived to carry the loads on. The remainder of the section moved off early in the morning. We followed in the afternoon and found the others busy pitching camp. The 31st & 32nd Battallions are close by, otherwise there is nothing to be seen but sand and sand hills, all beautifully white.\n\nA number of huge water tanks are erected near the infantry lines, into which water is pumped from Rail Head.\n","138":"\n\nHot Day. I was put on a carpentry job while the others re-arranged the tents to make the camp look more compact. When the infantry arrived here the New Zealanders who handed the camp over gave all the water that was left in the tanks and went without it themselves – Another good turn.\n","139":" Nothing\n\nunusual happening during the day which was pretty warm. In the evening an event of some amusement happened – Bill Burdon from our tent pinched a bike from the Orderly Room after Lights Out and rode in to Ferry Post for provisions. A few of us went to Road Head North to meet him and waited hours. It was after midnight that we met him down the road walking the last couple of miles. He had just been thrown off and broke the lamp. The rest of the bike was in a sad condition. We all got back into bed without being\n\ndiscovered.\n","140":"\n\nStill Hot. Stacking timber for Engineer Carpenters who are here to build a Mess Hut. There was trouble at Headquarters today over \na\n cases of Brandy that were \"pinched\" by Transport men.\n","141":"\n\nVery Hot. Went with party of 10 to Rail Head to sort out what we required from our Universal Kit Bags because there is a chance of our losing them. Having done this we travelled down the Anzac Desert Railway to Ferry Post\n\nfor a swim in the Suez Canal. This railway is a queer but extremely handy arrangement. Though it is only like a toy it is certainly convenient, both for carrying troops and for A.S.C. stores.\n\nWhile at Ferry Post we saw the French Aux. Cruiser Letetia pass.\n","142":" Church parade in the morning. The altar is built of sand bags. Nothing else is worth recording for today because we were just lying down or waiting.\n","143":" Colours issued – Chocolate ?. Building new Cook House. Hot day.\n\nDysentry very bad in camp. Concert in our tent at night.\n","144":"\n\nWarmer still. Carpentering most of the day and carting stones from Road Head North on Camels. This meant a few rides for us. We gave the \"Gypo\" ½ piastre to let us have a gallop, so, using the whip, we got such a rough trip that we don’t look forward to another like it.\n","145":"\n\nVery Hot. This was the day of our memorable Cheese Funeral which caused great amusement to our officers and also the\n\ninfantry close by. This was no sooner over than the Khamsein sprang up. Sand was hurled about in intense fury. This terrific wind storm was such that no human being could bear to face it for long. \n\nWe were hanging on to our ropes inside the tents for hours. Other tents were blown down but had to remain so. The meaning of the word Khamsein is 50, indicating that the wind may last on and off for 50 days. March April and May are the worst months. Egyptians look upon the wind as a healthy sign because it clears\n\nthe air. Generally, the weather following a Khamsein is glorious.\n","146":" Hot to mid-day, then came a renewal of the storm. It was something frightful. This morning we spent hours in digging sand away from round the tents. It had banked up feet high.\n","147":"\n\nAssisting carpenters all day. 60th Batt. Infantry arrived. Towards mid-day a heavy downpour of rain came.\n","148":" A\n\nbeautifully mild day. Engineers not coming today so I have charge of the job. We are now busy at the roof. News was today read out in orders about the engagement some 40 miles from us where the 8th & 9th Light Horse captured 130 Turks and 1 German Officer. \n","149":" Church Parade in morning. This was another bright day. Washing, general cleaning up and writing letters.\n","150":"\n\nBeautiful Day. Swimming Parade to Ferry Post which we made into a trip across \n\nto Ismailia. We rode down to Ferry Post in Ambulance Waggons which were being returned to ordnance. As we stepped off the punt on crossing the Canal we were face to face with the Prince of Wales. He was carrying a Thermos Flask and was accompanied by Gen Murray. We had a good look round Ismailia including the native quarter. Met Hugie Cameron W.O. 5th Div. A.S.C. On returning to Ferry Post we found that the last train had gone. Luckily, however, some of our limbers were down for mail so we\n\nrode back in them, passing the Prince again – this time he was on a camel. From Rail Head my friend and I went the rest of the journey on horses (bareback) after being thrown off twice. These horses belonged to the Light Horse who were engaged in the fight a few days back.\n","151":"\n\nFine day. On water fatigue carrying water from the tanks in the Infantry lines.\n","152":"\n\nLovely Day. Making sand bag pit in morning. Route march in afternoon. Playing draughts\n\nat night. Shortages in equipment are now being made good in view of our prospective early departure for France.\n","153":"\n\nMail Day. Carpentering at Mess Shed. Peaches & cream before going to bed. \n","154":" Glorious day. Parades cancelled except the Church Parade. Reading & writing letters. \n","155":" (Easter Saturday) Warm. On Cooks Fatigue & writing. Route march for the remainder. In evening playing draughts. \n","156":" (Easter Sunday)\n\nFairly hot. No Church Parade Sports meeting held to make arrangements for a good time on Anzac Day.\n","157":" (Easter Monday)\n\nHot. Carpentering and Lecture in morning. Enemy aeroplane flew over the other day dropping a few bombs on Serapeum. It is believed that a few were killed.\n","158":" – Anzac Day)\n\nAfter carrying an appendicitis case to Road Head North where he was met by an Ambulance Waggon, we came back to a fine dinner of Pineapples,\n\nSalmon, biscuits, sauce & lollies plus 2 big parcels I received from home. Most of the other things were out of A.M.C. \"Comforts\".\n\nIn the afternoon we had an enjoyable sports meeting followed by a first class banquet. There was a great deal left over & this was given to hospital patients. The day was a wonderful success.\n","159":" Hottest day since we arrived here. Put door on cookhouse & attended lecture in morning. Too hot to do anything in the afternoon.\n","160":"\n\nVisited Dentist’s at Rail Head and unfortunately broke the filling off as soon I came out. Very warm day. Foot inspection in afternoon then dismissed.\n","161":" Beautiful Weather. On Water Fatigue. Camel ill, so we had to carry the water on stretchers. In the evening we returned a joke on the Q.M. Staff over a fantasia.\n","162":" Hot. Carpentering in morning & Lecture on Billet System of encampment in France by Major Newell. Carpentering in Afternoon.\n","163":"\n\nLovely morning. Church Parade\n","164":"\n\nFine Day. Rail Head on Dental Leave & finishing off the Mess Shed\n","165":" Fine.\n\nOrders read out about Gen. Townshend surrendering with 2900 British & 6000 Indians. Squad & stretcher Drill and practise at carrying patients by the \"Fireman’s Lift\". March over desert for sandbags. Infantry having a bombing attack on trenches close by \n","166":"\n\nFine. On Cooks Fatigue. I was in a party called to a private consultation by Capt. Mollison in his tent, where he informed us that a Turkish Attack is expected in a day or so, most likely at 4 a.m. in the morning. We were told that the information came from the Secret Service Dept. The Turks are reported to be coming on camels and in strong forces. Though the officers seem to be serious about it and medical stores are being rapidly overhauled I personally look upon the whole thing as a joke just for a test.\n\nAnyhow I have been given a medical outfit and have been put in charge of a party.\n","167":" Hot.\n\nIn charge of party to clean the camp up – Then we were all marched out to dig a big sandbag dug-out a couple of miles off to be used as an advanced dressing station. We worked till late at night and were even told that we might have to work all night, but every time a wall was nearly built up the thing would collapse. It was far from completion when we returned to camp. The idea of evacuating wounded has \n\nbeen set as follows \n\n(Small sketch)\n\nWounded are to be carried from the sand hill positions, occupied by infantry, to the dug-out on stretchers. From there they will be taken on camels to our camp and on to the road by sand carts drawn by mules. At the road Ambulance waggons will be waiting. The sand carts have arrived already amidst cheers from the boys.\n","168":" Strange to say, orders for moving came. Tents were struck and everything transported by camels & waggons to Rail Head. I went with the advance party. We all had a hard day’s work and were very sorry indeed to have to leave this \"good home\". It was the best camp we have been in so far. Another camp had to be pitched on arrival at Rail Head. \n","169":" Very hot. Digging deep sand-bag pit from ","170":" a.m.\n till \n9 p.m.\n It fell in numbers of times & finally collapsed altogether so we went to bed after hard\n\nday’s work. Capt. Mollison is anxious to get the job done so that we can get on with the new Mess Shed now partly built by Engineers, hence our reason for working till such a late hour.\n\n7th May (Sunday) Hottest day since we arrived in Egypt. Still on the sandbag pit but didn’t finish it thanks to a few more falls. Medical Board sitting today to decide cases who are to be returned to Aust.\n\nWorking after tea.\n","171":" Hot day. Continued on sand-bagging and finished the job. The present camp\n\nis to be prepared and left standing for the unit who will take it over from us shortly.\n","172":" Hot. Carpentering all day. The Water tanks at Rail head are being covered all over with sandbags for protection against aircraft. Today I was informed that I can go to Cairo on Thursday.\n","173":" Still warm. Continued carpentering. Left for Cairo in party of 5 at 6.45 pm. Went as far as Ferry Post in light service waggon. Forms had been fixed in it for seats but they all broke before we had gone 100 yards. \n\nThe idea of sending us\n\ndown to Ferry Post tonight enables us to catch the 5.45 train tomorrow morning. We hoped to catch the 8 p.m. train tonight by going extra fast in the waggon – Well, we travelled like a fire engine in a very exciting ride, cancelled arrangement for sleeping at the Ferry Post Clearing Hospital and rushed down to the punt only to be kept waiting over an hour for passes. So all chances of reaching Cairo tonight have faded. However, we slept at a handy place for the night, the No 2 Stationary Hospital, which is quite close to the Ismailia Station. Our bed consisted of a stretcher, two\n\nblankets and a pillow in the backyard. Soon after getting into bed a nurse brought us cocoa.\n","174":" Nurse Woke us at 5 am and gave us a good breakfast of Ham & Eggs etc. A Major & Captain were on the Ismailia Station examining passes. It was a beautiful day and we reached Cairo at 9 am. The morning was spent in donkey rides round Cairo after various things for mates in camp. I had dinner at the Anzac Hostel and in the afternoon went to have a look round the Zoo.\n\nSent cable home & rode on a donkey from Shepheards Hotel to the station in time to catch the 7.15 train for Ismailia. From Ismailia to Ferry Post about 100 of us were crammed into a big motor lorry – Some were up on top and many a time we thought there would be an accident with such a load on board. Slept in a Hospital tent at 15th Field Ambulance quarters.\n","175":"\n\nWarm day. Waited till mid-day for Anzac Desert train. On arriving back in camp we learnt that the unit had received orders to move for Ferry Post tomorrow.\n","176":" Extremely hot. Marched from standing camp to standing camp, changing places with the 14th Field Amb. We were like drowned rats when we reached Ferry Post.\n","177":" Still hot. No Church Parade. Building stone incinerator.\n","178":" Putting up flag pole in morning. Fearfully hot. Aeroplane flew over camp. Piquet at night. The hours we are now to have are as follows:- Breakfast 4.30 Parade 5.15 am to 8.45 am – Morning tea 10.30 am. Afternoon tea 3.30 pm\n\nParade 5 pm to 6 pm – Tea 6 pm. This is on account of the Hot weather.\n","179":" This was a scorching hot day, worse than yesterday. In Cairo the temperature is 115º. Here it registers 130º in the shade. I was on piquet and even the blue glasses I have been wearing to counteract the glare, are not sufficient to protect the eyesight. The piquet has been doubled so as to shorten the hours. The push for water at the taps is awful. Inspection of camp by A.D.M.S. & D.D.M.S today and \"A\" section were specially complimented\n\non the way they marched on to the parade ground. New rumours go round every day now as to when we will be leaving for France.\n","180":" Fine Day. Stretcher drill in morning.\n\nCapt. Lind took us to the trenches close by where infantry were bombing and he intended giving us practise at getting men out under fire but the firing was too heavy. However another idea was carried out :- We were told off into squads and a certain officer, Capt. Nance, went up onto a ridge with a number of \"patients\"\n\nwhom he spread out. The stretcher-bearers plans were to approach the ridge by the safest way, taking the best cover, and to clear wounded from the ridge. Capt Nance was situated up on the plateau somewhere in the direction of the \"supposed enemy\" and he was to give a decision afterwards on the work. Well, my squad got the best points. Lecture by Colonel Shepherd on tomorrow’s Divisional manouvres.\n","181":" Divisional Day postponed till Monday. We were to have gone out with the 8th Brigade as advance guard\n\nAnzac Army Corps which is controlled by General Godley.\n","182":" Cool. Brushes issued for cleaning boots, buttons & uniforms. All buttons & boots have to be clean for every parade & the boys don’t like the idea. Lecture in the afternoon by Capt. Nance.\n","183":" Cool. On Cooks Fatigue. The camp was prepared for an inspection by Major General McKay but he didn’t arrive.\n","184":" Church Parade followed by a few trial moves as \n\npractise for\n\nthe inspection. Inspection by Major Gen. McKay in afternoon.\n\nBeing No 3 in the line I was the first one he spoke to. He asked me how long I had been the forces & what regiment I was in before enlisting.\n","185":" Big Divisional Day. Roused out at 2 a.m. and took up a position some miles out with the 8th Brigade who were acting as advance guard in defending the Canal. Of our unit only \"A\" section was engaged. Aeroplanes artillery engineers signallers A.S.C. were all out and the spectacle was indeed a fine\n\none. We didn’t wear any tunics so \"brassards\" (Red Cross badges) were attached to our shirt sleeves. An enemy force consisting chiefly of Light Horse scored the victory. We were badly beaten. \n\nOn returning to camp we were put on pack drill for having been a few minutes late in getting out of bed this morning. As a matter of fact no whistles were blown so the sergeant was at fault.\n\nCapt. Lind who served us this dirty trick will never be forgiven.\n","186":" On Piquet. Infantry packs, and\n\nwebbing equipment issued. All the old kit has been handed in. I was lucky enough to get a new set.\n","187":"\n\nPrinting photos most of the day, otherwise nothing doing. Aeroplanes still moving about all day. These machines are the ones that have been annoying the Turks lately.\n","188":"\n\nExercise in use of Gas helmets. These helmets are just bags made of woollen material soaked in chemicals, with glasses for the eyes and a rubber tube & mouthpiece\n\n \n\nbaggage preparatory to moving in the morning, so we will have to sleep in our overcoats. A general clearing out has been going on during our stay at Ferry Post and the Quartermaster’s baggage has been considerably reduced.\n","189":" Up at 3 a.m. and marched off shortly afterwards for Moascar. This was our first experience at carrying packs so we had a rough time. I, for one, lost many a pound in weight. The Welsh 1st Field Amb. took our place at Ferry Post. We passed a long line of British \n\nartillery on the way to Moascar. George Wooten from Mosman was Capt. in charge of the pontoon bridge as we crossed the Canal. On arriving at Moascar we had to pitch camp.\n","190":"\n\nAnother march with packs up. We expect to be leaving for Alexandria shortly. All cameras have to be sent home – none are permitted in France. New orders have been issued stating that boots have to laced in one particular way.\n","191":"\n\nRead out in orders that the \n\n8th Field Ambulance marched well on the 28th inst. Graves of victims in the \"Great March\" close by.\n","192":"\n\nRoute march through Nefische with packs up followed by tribes of arabs. They speak English fairly well, especially the youngsters. Travellers to Egypt after the war will be shocked at the fluent way these natives speak the \n\"Australian\"\n language. \n\nSwimming Parade in afternoon to the Lake at Ismailia. 15th Brigade came across the Canal to Moascar today. Letter\n\nwriting which was suspended on the","193":" inst. is now temporarily resumed.\n","194":"\n\nRoute march with packs up through Nefische. Kit bags emptied. In the universal bag we are only to carry the Australian cloth uniform. This will be put on in place of the Egyptian uniform just before we reach France. \"Tommies\" who have recently arrived in Egypt paid our tent a visit tonight and we got them 4 bags of socks. They gave us the full strength of the Zep. raids over London. Various\n\ninstructions as to French methods were given to us today in a lecture.\n","195":"\n\nOn Piquet. Hand & foot inspection. Sing-song in our tent tonight. Circulars from Gen Birdwood & Kitchener handed round relative to behaviour in France.\n","196":"\n\nWindy. Squad drill in morning. Tents have been packed up ready for moving on Wednesday. Now sleeping in the Mess Hut. A party of us went to a concert in the Y.M.C.A. pavilion tonight.\n","197":"\n\nDoing nothing all day. Everything is ready to leave on Wednesday. Writing letters.\n","198":" On various fatigue parties all day. Took number of patients across to the \"Tommies\" Stationary Hospital opposite us. Preparing for tomorrow’s inspection by Gen McKay. We were cleaning harness and oiling waggons till late at night.\n","199":" On Cooks fatigue. Inspection by Gen. McKay in morning. He says our turnout was the best\n\nhe has seen in Egypt. Rumours that tomorrow’s move has been postponed because transports aren’t ready and also on account of the presence of submarines in the Mediterranean. Canteen riots tonight. Numbers of places smashed about.\n","200":"\n\nMarch with packs up. Notice given out that mails will be received till further orders. Lecture by Capt. Lind about entraining, disembarking & duties on board ship. He says we will not be going for 7 or 8 days. Gas Helmet practise. Service at Y.M.C.A. \n\nin evening.\n","201":" Making top for drainage pit. Sports meetings coming off on Saturday and Tuesday. We unanimously prefer entering these with the 8th Brigade rather than as combined divisional A.M.C. Read out in orders that if any more canteen riots occur these places will be shut. A shock went through the lines today when news of Lord Kitchener’s death came to hand. \n\nY.M.C.A. at night.\n","202":"\n\nSports meeting held in our unit to pick representatives\n\nfor the Brigade meeting tomorrow. Divisional meeting on Tuesday. They are busy on our \"limber\" and hope to score a success with it. \n\nConcert at Y.M.C.A. in evening.\n","203":"\n\nBrigade Sports. Major Williams won the Field Officers race and we were proud indeed when our limber got the decision. Four bands were in attendance. It was a fine display. Concert at Y.M.C.A. tonight.\n","204":"\n\nChurch parade in morning where touching reference was \n\nmade regarding the death of Lord Kitchener\n","205":" Marched down to Lake at Ismailia and stayed all the morning. Some were in for a swim while we remainder were lying down in the Palm Groves eating water melons. It is a beautiful spot just here. Some of the rough class amongst the Australians were upsetting natives and \"pinching\" their goods. In the afternoon we were packing up & loading waggons.\n","206":"\n\nFatigue work all morning preparatory to going away. At\n\n6 p.m. all troops attended a Memorial Service held in connection with Lord Kitchener’s Death. It was a most impressive scene. At the end of the Service the Dead March was played, followed by the buglers blowing the Last Post.\n","207":" On Piquet but managed to get over to see the Divisional Sports meeting. It was a fine display resulting in our winning the \"Limber\" entry. \n\nMet Hughie Steanes, Cornish & Reg Cannon. H.S. was telling me that at Ferry Post the other day the temperature was 127º in the shade. \"Tommy\" regiments\n\nout at Rail Head are suffering in the heat. Waggon loads of them are being daily brought in to Hospital. Quite a large number of black West Indian troops are camped at Moascar. These come from the West Indies and Islands round that quarter and they speak English very well. They say the heat here is worse than they have ever experienced before chiefly on account of the sand which glares and reflects the heat. In their part of the globe there is plenty of green vegetation to relieve the eyes.\n","208":" Very\n\nhot. All Parades dismissed. Lying down most of the day in the big Hospital tent where we have been sleeping for the past few days.\n\n30 men and our Headquarters leaving tonight for France by the \"Tunician\". We follow them in a couple of days time on the \"Transylvania\". The Divisional Headquarters Staff and 3000 men will be leaving per this boat. Red Cross \"Brassards\" issued tonight and are to be sewn on the left arm sleeve.\n","209":"\n\nVery Hot. 14th Field Ambulance arrived to take the camp over\n\nWe leave tonight. Emergency rations issued – Bully Beef & biscuits for 24 hours. These are not to be touched until we are authorised to do so. Aeroplane dropped a bomb near our Mess Hut, by accident. It was one of our own machines because I saw it land in the camp. Marched down to the railway station at Moascar and boarded open trucks at 9.30 pm. Left for Alexandria at 11.30 pm. It was a very cold and rough ride but I managed to get a little sleep. 41 men per truck meant overcrowding.\n","210":"\n\nArrived Alexandria at about 7 a.m., disentraining at the wharf. Fooling about the wharf till mid-day having the roll called over and over again until long after the infantry had embarked. At midday we boarded the S.S. Transylvania a 16,000 ton boat of 24 knots carrying the 5th Divisional Headquarters including Mjr-Gen McKay. This ship has been three times chased by submarines and she saved the survivors of the Southland when that ship was torpedoed off Gallipoli.\n\nAt present there are a large number of transports here mostly loaded with troops ready to sail. The entrance to the harbour at Alexandria is guarded by submarine nets. Arrangements for our quarters on board ship were even more disgraceful than those at the time of leaving Sydney. We wandered about one after the other all over the ship, carrying all our equip\np\nment and packs, with perspiration running off us, but couldn’t get any satisfaction for some time. Then at last we discovered\n\nthat on account of being too slow the infantry had beaten us for our position. Consequently we were put right down in the very bottom of the ship – Here bunks were arranged one above another in wire cage system so that the only space to move about was between the different sections of bunks. It also would require some climbing to get into bed. However, on account of the bad ventilation and the obscure quarters I quickly decided to sleep on deck. The Transylvania is a beautifully fitted out\n\nship but, as usual, officers had the best space and this was \"out of bounds\" to the men.\n","211":"\n\nSailed at 9.30 a.m. and my hat blew overboard very soon afterwards. Directly we left port the ship was set on a zig-zag course so: (zig-zag sketch). Meals on board very mean – all are complaining about the short rations. Notices such as \"S.S. Starvania\" etc prove that others before us thought likewise. Sleeping on deck again tonight \n","212":" Mess orderly today. Powerful\n\nlittle destroyer has arrived to convoy us and is now bouncing from one side to the other before our bows with waves dashing all over her. Passing to the north of Crete all day not far off the land. The coast looks very weird and barren .Various rocks and islands here and there. We are now travelling what is known as \"B\" route and are in touch with Malta by wireless. Lot of steamers about. Crete still to our left when I fell asleep on deck tonight \n","213":"\n\nDestroyer missing when I awoke. Beautiful morning. It is known that there were at least 2 destroyers round us last night, some say there were four. Absolutely no signs of anxiety on board with regard to submarines. We are ordered to keep our lifebelts with us every minute of the journey. At 10.15 a.m. another destroyer, the 02, came dashing up to us and is still here (2 pm). This destroyer, the \"Acorn\" by name, was with us when we went to bed on deck at night.\n","214":"\n\nInspection by Mjr Gen McKay today. Mild weather still. Destroyer changed places with another of the same class about 6 am (name & number not visible). Large Shire Line Transport with troops on board passed us in Eastern direction. Destroyer 77, same class as ours is convoying them. We passed South of Malta at 6 a.m. and had a fine view of the Island with its magnificent buildings.\n\nNumbers of steamers on all sides. Passed the Island of Pantelaria, between Africa and Sicily. Cape Bon light\n\nfrom the lighthouse is now flashing out. This is on the north coast of Africa. Slept on deck again.\n","215":"\n\nUp at 4 am as usual for decks to be washed. Passed large Hospital Ship. Destroyer still here. Parade for usual morning and afternoon inspection, but this time in the Australian Cloth uniforms.\n\nThe Egyptian Light Khaki uniforms and our kit bag are going back to Egypt tomorrow. A memorable incident occurred today – We sighted a fair sized\n\ntramp steamer coming directly for us from the opposite way, when suddenly the boat was observed to have stopped its engines. The reason was easily understood when our little destroyer immediately dashed off at full speed in the direction of the tramp. Imagine the touch of pride for our Navy when we realised that a small though powerful representative of the fleet is obeyed by a steamer ten times its size and armed with guns. As our destroyer pulled up alongside the other \n\nsteamer they hoisted the French flag but we made an inspection all the same. This happened at the time of the Greek Blockade, hence the precautions. We had a good close view of this episode. Perhaps I ought to mention here that the destroyers we have seen so far on this trip are a new type built since the outbreak of war. They have 4 funnels. We were passing to the left of Corsica at 12.30 pm. today. Our ship is still maintaining the zig-zag course and is accompanied\n\nby the destroyer as we now make our beds on deck.\n\n23rd June (Friday) Prince of Wales’ Birthday.\n\nDestroyer dived away at 6 am. Entered Marseilles Harbour just as the sun was rising (7 am) and mist gradually clearing revealing wonderful rocky heights with numerous lighthouses on important points. The scenery as we drew in closer to the port became most interesting. After winding round a few islands we passed in behind a stone breakwater and slowly steamed up to the\n\nwharf. Here, as on all the wharves, there was evidence of up to date shipping facilities. Two British destroyers close by. Band on board our ship playing international music. Cheering from ship and wharf. On our wharf German Prisoners were busy loading steel rails on trucks, their head gear being large straw hats with red bands round them. French soldiers were guarding these men. Wine being pumped from large barrel trucks into smaller barrels on the wharf. Other troopships in port with Australian troops on board.\n\nAbout mid-day on 23rd June, after throwing our kitbags and Egyptian uniforms down one of the holds, I disembarked in a party of 8 men with our officers baggage and marched up behind the waggon to the railway platform. Waited there till 5.30 pm and entrained with the remainder of our unit into a 3rd Class Carriage. The train had 45 carriages containing in all, about 2000 troops. 1st &","216":" Class carriages were on the train but infantry were more fortunate than us in their accomodation, though we had nothing to complain of. Leaving Marseilles we travelled to the left up the mountain\n\nsides through tunnels (one being exceptionally long) and over picturesque white stone bridges spanning across gorges. Looking down to the left (facing the engine) the country slopes to the sea with gardens, lawns, vinyards and beautiful trees all bright and green. About this spot, i.e. close to Marseilles, the famous tile works are to be seen. On the other side of the Harbour, which is not far across the water, the hills, spotted with large buildings, present a fine sight. The slopes on either side of the line even right to the top of some hills\n\nare terraced with white stone walls and on these terraced positions vinyards are laid out in an admirable manner. Even trees, the oldest to be seen, are planted in fine system. They appear in rows on both sides of roads, all of even distance apart and about the same height. In the open fields of crops and orchards these trees again come under notice. They resemble hedges dividing different properties. Gullies and gorges containing ferns and all the other vegetation previously alluded to are indeed wonderful. Having\n\ngained such a pleasant first impression in the opening few minutes of out train trip we little dreamed of what was yet to come. \n\nContinuing up the famous Rhone Valley though not yet in sight of the river we passed round hills and through more tunnels only to see country even more beautiful if such were possible, at every change of scene. Streams also have their decorations similar to the roads viz, by systematically planted trees, poplars or such-like, often meeting overhead in the form of an arch. The grandure of Southern France\n\nat this time of the year is truly astounding. Though we slept in the train 3 nights the scenery from the window was never tiring, from Marseilles to Steinbecque on the Belgian Frontier. Railway stations are all a credit to the country, even the smallest of them. The condition of the country would almost discredit the fact that the nation is at war, although shortage of ablebodied men is very evident. Women, of course, are doing a great deal of the work. As our long train of khaki entered the different stations or passed batches\n\nof civilians or French soldiers on leave there was a great ovation from end to end of the train. Two Australian flags were hanging from the windows. Cases of ladies in deep mourning here and there brought home to us the sad reality of war. When the train stopped our boys swarmed all over the line in defiance of orders and sometimes caused anxiety to station masters because of passing trains. French and Algerian troops in passing trains were greeted with the usual cheers or\n\n\"Cooee’s\". Bully beef, which was greatly in demand by civilians, was forthcoming so that we really gave away most of our rations. French railways are very fine indeed. Huge engines of all types & sizes, and the numerous big railway yards did not escape our notice. As regards the names of railway stations \"en route\", I am only mentioning the larger ones. Our first meal on the train was at Orange 1.30 am","217":" Hot water had been previously arranged\n\nfor so all we had to do was to supply the tea and sugar. The stop occupied about an hour. Tea was issued on the railway line and we had our \"meal\" in the carriage. Passing Vienne we arrived at Lyons and pulled up just outside the platform, our carriage being right opposite the Post Office, where girls were leaning out of the windows cheering and waving as we sang the Marseillaise and various Australian songs. Lyons is a fine city and the River Rhone with its beautiful bridges and \"pretty\" banks looked a picture, so also did the large buildings.\n\nDijon was the next particularly notable place. Here there are large railway yards and also a fine station – Red Cross ladies were in attendance on the platform with large cans of tea. They visited all the carriages giving tea and little souvenir tin flags to the troops. These ladies were well thanked as the train moved on. Passing the fine station of Chalon we had lunch at Macon, tea at Leslaumes, and slept in the train for the second night. In the morning about 7 o’clock we stopped at Juvisy for breakfast, afterwards branching off on to another line, which meant that\n\nwe were doomed not to pass through Paris. We travelled to the South and West of Paris, through St Cyr and Fourveaux, from which latter town we could see Paris in the distance. The big city of Amiens with its numerous locomotive sheds and railway yards was the next stop of any note. Here the people on the platforms cheered and were cheered frantically – Trainloads of 75’s, damaged aeroplanes, waggons and war material passed to and fro. Then, continuing to Abbeville we saw various large munition\n\nfactories, aerodromes containing war balloons and other dirigibles, whilst aeroplanes were to be seen in flight everywhere. About this part hospital barges are to be seen travelling backwards and forwards conveying wounded from the Clearance Hospitals nearer the front. Russian Cavalry were also to be seen on the roads. We arrived at Boulogne 10.30 pm","218":" where the sea and a few lighthouses on the English Coast were visible from the train window. Late, about midnight, we\n\nreached Calais, at which station I luckily happened to wake up. The platforms are covered by a huge arch characteristic of most important French Stations. Cairo, (Egypt) which doubtless was of French design, is after the same style but of course on a much smaller scale. Today (Sunday) we also passed Etaplse, the Base as it is termed, where two divisions of Australians are encamped. \n\nGraves of victims at the front are here in thousands. A disturbance occurred in Etaplse last night when a \"Tommy\" military\n\npoliceman was \"knocked out\", so the police have been strongly reinforced to prevent further trouble. Soon after 4 am on Monday the","219":" we reached Steinbecqe, our destination by rail and disentrained in a very cold atmosphere. The trip occupied 58 hours, but was never tiresome – In fact we would all do it over again. We marched to a little batch of huts situated on a piece of ground between a farm house and a school, in the village of Morbecque. After resting for the morning we were given leave for a few hours so a party of\n\nus took a walk to Hasebrouck. Being struck by the appearance of the fine church we went inside and were astonished at the grandure of the place. Heavy rain fell at night and while lying in bed we \n heard the guns for the first time.\n","220":"\n\nRaining when we awoke. No parades today. Officers arranging to billet themselves in private houses. Still on bully beef and biscuits.\n","221":"\n\nRoute march in morning carrying packs. Nothing to do in afternoon so we again went\n\nto Hasebrouck. The Germans passed through this town but not Morbecque.\n","222":"\n\nRoute march in morning over muddy roads. In orders this morning reference was made to the breaking of a shop window by members of the","223":" Brigade. A repetition of this offence is threatened with a Court Martial – So we haven’t been long in France before the rough element gets to work. In a cricket match this evening with a New Zealand Field Ambulance we beat them easily. The twilight here lasts till nearly 9 pm. Away in the\n\ndistance, near the front, we could see German shells bursting round British planes.\n","224":"\n\nRaining. Lecture on the gas now being used in warfare, \"Chlorine\", when it was explained to us that our helmets are superior to those used by Fritz. Route march all round the district in afternoon. Towards dusk German Anti-aircraft guns were again busy at our planes. Whilst lying in bed tonight we could hear quite distinctly the awful rumble of guns. It was something terrific and kept us awake – The sound\n\nof heavy rain outside our hut is nothing to that of the guns. Surely something big is afoot, probably the opening of the British Offensive.\n","225":"\n\nHeavy gun firing continued through the night and has been maintained all day. 14 aeroplanes were busy in the air. Today we had a look round the local church – It seems, from what civilians tell us, that the tower of this church was used by us for observation purposes early in the war. Why, then, condemn the Germans for shelling churches.\n\n"}}