{"Document Name":{"0":"Diary_0006","1":"Diary_0006","2":"Diary_0006","3":"Diary_0006","4":"Diary_0006","5":"Diary_0006","6":"Diary_0006","7":"Diary_0006","8":"Diary_0006","9":"Diary_0006","10":"Diary_0006","11":"Diary_0006","12":"Diary_0006","13":"Diary_0006","14":"Diary_0006","15":"Diary_0006","16":"Diary_0006","17":"Diary_0006","18":"Diary_0006","19":"Diary_0006","20":"Diary_0006","21":"Diary_0006","22":"Diary_0006","23":"Diary_0006","24":"Diary_0006","25":"Diary_0006","26":"Diary_0006","27":"Diary_0006","28":"Diary_0006","29":"Diary_0006","30":"Diary_0006","31":"Diary_0006","32":"Diary_0006","33":"Diary_0006","34":"Diary_0006","35":"Diary_0006","36":"Diary_0006","37":"Diary_0006","38":"Diary_0006","39":"Diary_0006","40":"Diary_0006","41":"Diary_0006","42":"Diary_0006","43":"Diary_0006","44":"Diary_0006","45":"Diary_0006","46":"Diary_0006","47":"Diary_0006","48":"Diary_0006","49":"Diary_0006","50":"Diary_0006","51":"Diary_0006","52":"Diary_0006","53":"Diary_0006","54":"Diary_0006","55":"Diary_0006","56":"Diary_0006","57":"Diary_0006","58":"Diary_0006","59":"Diary_0006","60":"Diary_0006","61":"Diary_0006","62":"Diary_0006","63":"Diary_0006","64":"Diary_0006","65":"Diary_0006","66":"Diary_0006","67":"Diary_0006","68":"Diary_0006","69":"Diary_0006","70":"Diary_0006","71":"Diary_0006"},"Date":{"0":"unknown","1":1005.0,"2":1006.0,"3":1007.0,"4":1008.0,"5":1009.0,"6":1010.0,"7":1011.0,"8":1012.0,"9":1013.0,"10":1014.0,"11":1015.0,"12":1016.0,"13":1017.0,"14":1018.0,"15":1019.0,"16":1020.0,"17":1021.0,"18":1022.0,"19":1023.0,"20":1024.0,"21":1025.0,"22":1026.0,"23":1027.0,"24":1028.0,"25":1029.0,"26":1030.0,"27":1031.0,"28":1032.0,"29":1033.0,"30":1034.0,"31":1035.0,"32":1036.0,"33":1037.0,"34":1038.0,"35":1039.0,"36":1040.0,"37":1041.0,"38":1042.0,"39":1043.0,"40":1044.0,"41":1045.0,"42":1046.0,"43":1047.0,"44":1048.0,"45":1049.0,"46":1050.0,"47":1051.0,"48":1052.0,"49":1053.0,"50":1054.0,"51":1055.0,"52":1056.0,"53":1057.0,"54":1058.0,"55":1059.0,"56":1060.0,"57":1061.0,"58":1062.0,"59":1063.0,"60":1064.0,"61":1065.0,"62":1066.0,"63":1067.0,"64":1068.0,"65":1069.0,"66":1070.0,"67":1071.0,"68":1072.0,"69":1073.0,"70":1074.0,"71":1075.0},"Entry":{"0":"\n\n","1":"\n\nOn job. Bitterly cold. Weather dull for observation purposes. 2000 loads of ammunition coming across bridge behind us tonight so probably things will liven up.\n","2":"\n\nBitterly cold last night. Day turned out very clear so aeroplanes made the best of it. 12 of them were visible, all ours. Guns broke out in the evening.\n","3":"\n\nOn job in morning. In afternoon went to Estaires\n\nfor bath. Proclamation comes into force today keeping civilians inside their houses after 8.30 pm. Our “C\" Section came in from Doulieu. Intense bombardment opened out late at night. Guns round us shaking the floor of our tent. 30th Batt. going over tonight in a raid.\n","4":"\n\nBeautiful Day. Writing most of the time. Two huge battleplanes flew over and we got a fine view of them because they weren't far up. Numbers of other planes are up. Two\n\nof Fritz's taubes are up, & British guns are after them. In evening went to Bac St. Maur re cushion. Leave roster now out. I am No. 120 on the list. Intense “Kettle drum\" bombardment in evening.\n","5":"\n\nRaining all day. Plans out for new bathroom which we are to commence after the present job. The 30th Batt. went over last night in raid close by. They brought back a few prisoners & knocked the German trenches about.\n","6":"\n\nRaining all day. The Major again hurried us on with our work because of patients. He is very impatient. The building is now ready all but the windows. These have been made but not yet put together. Aeroplanes busy today. Intense bombardment of Fritz's line, taking advantage of the rain. Dreamt that we would be called in tomorrow.\n","7":"\n\nRaining all day. Order came recalling us. We have\n\nto report back in camp tomorrow morning. The 15th F.A. don't want to let us go as the Engineer says the work will come to a standstill. Went to Fort Rompu in evening & got the cushion.\n","8":"\n\nMarched back to our headquarters at Estaires, our packs being sent in per ambulance motor. Bath as soon as we arrived. Market day in the town. Pictures at La Gorgue in evening. We are to move out\n\nat 6 a.m. tomorrow morning bound for Armentiers to relieve the Scottish.\n","9":"\n\nUp at 4.30 a.m. The unit moved off at 6 a.m. but I was left behind through having to load a waggon. This however proved a good thing because my friend & I put our packs on a motor and rode on the Ambulance Car behind the unit. I met Jack Ellis & young Best on the road. Reached Armentieres early in the morning. It is a fine big town (or city to be more precise).\n\nI doubt whether it would be possible to go all round the place in one day. Tram lines are not used but trams run up with stores at night. We were put into a big Hospital building at present occupied by the Scots whom we are to relieve. This unit is composed of all branches including some from the Black Watch. Wandered round the city at night up to 8 pm. The trenches are very close by & occasionally the Germans throw shells in though our building hasn't been touched.\n\nStreets are desolate in some places & sandbag barricades are put up to protect the cellars under the various buildings. There are some rather fine buildings here. Only the 8th Brigade of our Division are being sent to Armentieres accompanied by our unit. The church has been badly smashed and this is remarkable when one notices that the places around about haven't been touched. Aeroplanes flew over all day & the Germans were firing at them, the shell \n\nnose-caps dropping in the city. At night after our “B\" Section went to the trenches a fierce bombardment opened up and ended abruptly. \nIt\n It seems that “A\" section will be given duties at cleaning up the town etc.\n","10":"\n\nThe bombardment last night was only the Scots spending their surplus shells on Fritz. I was put on the garbage cart sweeping rubbish off the streets. Pictures at night.\n","11":"\n\nScotties leaving Armentiers. A part of 22 of our unit put\n\non the incinerators. The Scotch regiment consisted of Royal Scotch, Gordon H'landers, Seaforth H'landers, Highland Light Infantry, Scottish Rifles or (Cameronians) Black Watch etc. Prisoners working at incinerators clearing the ashes away. Coates Cotton Factory & a Blue Factory on either side of us. Troops have been shot on this spot & I have heard tales of the disgraceful treatment of our prisoners. Belgians hated at this part. Belgium only across the bridge close to us.\n","12":"\n\nOn incinerator. Just after 6 o'clock Fritz gave us the usual welcome he gives all new troops to this town viz. a few shells. Awful crashes and explosions occurred just down the street from us at 11.30 “square\" and shrapnel burst overhead sending the pellets rolling along the footpath. A number of casualties.\n","13":"\n\nIncinerator. No Pictures last night because of shells. Its marvellous how Fritz gets to know about this. Our guns and armoured train gave\n\nFritz a lively time tonight. A few more shells dropped in town principally at 11.30 square & Houplines. Each evening we visit some French friends and sit talking to them till 8.30.\n","14":"\n\nIncinerator. More shells in the evening. Numbers killed & wounded though none are hurt in the trenches. 1000 British drove 40,000 Germans out of Armentiers two years back. Spies are pretty numerous. German balloon broke loose & 5 of our planes\n\nplus anti aircraft guns were at it. They eventually brought it down in flames.\n","15":"\n\nIncinerator. Baths at Nieppe in afternoon. Lucky to have gone there because shells fell on the road we would most likely have returned by. It was a terrible evening. 20 killed & over 40 wounded. Hideous sights were sickening. Woman who was off her head. Crowds watching cars unload. Old man killed aged 72 & windows of every place in the street broken by 6 inch\n\nhigh explosive. Some shells fell close to our billet & killed 8 pioneers wounding others. All this from Fritz was retaliation for our success on the Somme because artillery say every one of our guns here can be hit without the Germans putting one shell near the town. Late in the evening up came the armoured train and all guns gave Fritz a hell of a time.\n","16":"\n\nIncinerator all day. When we returned to billet all\n\nwere ordered off to the cellars in Brewery because our guns intended giving Fritz a heavy bombardment. We were in the cellars over an hour but Fritz didn't send one shell back. Before going to cellars we were all issued with new box gas respirators and were put under tear gas to experiment. No lights allowed at night. Learnt that one of our aeroplanes had ventured low over a village opposite which had hitherto been in our opinion\n\nonly occupied by civilians but the airman discovered the presence of Germans there, so our guns were all going to concentrate on this spot at the same time. Naturally we expected that Fritz would get annoyed hence the precautions in the town. All was peaceful during the night.\n","17":"\n\nOn incinerator for hour or so then a party of us were sent off to Neippe to bury 8 cows killed in Armentiers on","18":" inst.\n\nWe got the hole pretty deep in the hard clay with the assistance of the N.Z. but the cows didn't turn up.\n","19":"\n\nWorking at moving the cows from the shed in rather bad smell. Scottish assisting. It was frightfully bad work. Fritz shelling town again.\n","20":"\n\nMoving cows again. Raining all day. Fritz dropped more shells in scaring the civilians. Usual round of\n\nvisits at night.\n","21":"\n\nOn incinerator. More shells dropped at 3 pm some near our billet. A number of casualties including an old man killed. Our guns retaliated.\n","22":"\n\nOn incinerator. Early in afternoon Fritz started to drop shells all over the town. When we returned to our billet the others were missing, having gone to the brewery cellars. At 9 pm more shells dropped all round us. Three times\n\nto bed and up again as late as 2 am. Our big guns including “Happy Harry\" retaliated in such a way as to shake the buildings.\n","23":"\n\nQuiet this morning. Town badly damaged yesterday. Number of casualties. Civilians leaving Armentiers. Even now the place is nearly deserted. Afternoon off. Today's Daily Mail contains fine article of tribute to Anzac.\n","24":"\n\nBuried a horse at Pont de Neippe in morning. Ten more shells thrown over into the town.\n","25":"\n\nOn incinerator all day. 8th Brigade put gas over but proved disastrous to our own side as also did the raid last night. No more shells today from Fritz.\n","26":"\n\nQuiet day – light rain. No work and peace from Fritz. Estaminets close\n\ntomorrow night in all towns round this quarter due to illness diphtheria having broken out. Rumours say that the Germans are responsible. Civilians have left Armentiers in large numbers during the past week. The bombardment lately was the heaviest since the commencement of the war.\n","27":"\n\nOn incinerator. Weak N.Z. replaced by stronger men. 30th Batt. Stretcher bearers returned to their\n\nunit. Estaminets closed for 3 days.\n","28":"\n\nOn Waggons touring round the streets after rubbish. No more souvenirs from Fritz. Heated arguments against conscription, in our billet till late at night.\n","29":"\n\nOn Waggons again today and visited dentist. Debate on Conscription at Y.M.C.A. 6 pm. Only 5 votes for conscription from the whole audience.\n","30":"\n\nOff duty on dental leave\n\nbut didn't see the dentist. Between 1 & 3 pm artillery finding ranges. About 7 pm a huge 15 inch gun drawn in parts by 7 traction engines passed through towards Erquinghem with only 16 rounds of ammunition 16 tons. The gun itself would weigh about 96 tons. The road space taken up by this gun was about 100 yards long.\n","31":"\n\nNew Zealanders from the Somme returning to take our place in Armentieres. 40 motor lorries arrived this\n\nmorning. I was asked to accompany a sgt. & an officer as billet guide, so, late in the afternoon, after bidding “Au Revoir\" to my many French friends we rode as far as the Y.M.C.A. in a motor Ambulance where we were transferred to the last of 40 lorries conveying the 31st Batt. Up to the time we arrived in France there were over 30,000 of these lorries here but now the country is alive with them. The civilians were sorry to lose the Australians\n\nfrom Armentieres but glad the N.Z's are coming back (those that remain). We travelled out through Pont de Neippe and Bailleul to a place called Strazeele situated 7 kilos from Hazebrouck. It stands on a hill and gives beautiful views in all directions. The Germans were only here for 1 day before being hunted out by the British. We slept in a small building used as a school but as the place was already crowded with infantry we had to be \n\nsatisfied with a draughty position at the top of the stairs.\n","32":"\n\nAfter breakfast of the usual and only type obtainable by way of a feed viz eggs & chips we wandered all round the farmhouses and finally completed billeting arrangements just as the first flight of our unit arrived about 12.30 pm. I then hurriedly secured a position in the best billet which consisted of a room above an Estaminet\n\ncapable of holding 20 men. The remainder of our unit arrived soon after 6.30 pm and I had to direct them to their respective barns. The people in our Estaminet speak surprisingly good English.\n","33":"\n\nGood sleep last night. Route march with packs up in morning. In afternoon list of shortages in equipment taken & leaflets issued from Mr. Hughes re conscription. He advises all of us to vote yes but so far as the majority\n\nof those I know are concerned it will be a solid “NO\". The evening turned out bitterly cold just after we returned from blackberry picking.\n","34":"\n\nReveille at 5.30. Breakfast 6 am. Parade with 1 blanket at 7. These are being sent off with the transport. Party of 12 left at 6.30 for Armentieres to load a few waggons there. At 8.30 we were called to the Orderly Room to vote. Mine was “No Conscription\" without\n\nhesitation. Most of our unit voted likewise. When half way through the voting orders came to stop proceedings but we put all the votes through. The reason for stopping is unknown.\n","35":"\n\nCoffee as usual from the girls as soon as we got out of bed. Infantry are now moving out. Yesterday afternoon we marched to Caestre and Flerte for exercise. About 2 pm started on march to Bailleul\n\nover a distance of 9 miles arriving there in the evening in pouring rain. Entrained in cattle trucks (110 per truck). No sleep all night. Passed Calais & Boulogne and disentrained at Longpre at 8 am.\n","36":"\n\nAbout 10 o'clock marched off in drizzling rain 10 miles to Erguies, a little village out on the hills. The roads are all frightfully muddy. It was a very tiring march especially as we carried all our gear including packs & blanket. Reached Erguies\n\nabout 4 pm. We are the first Australians to visit the village. Scenery all round this Somme country is beautiful. Bitterly cold in bed at night with only the one blanket. We slept on the straw in a barn.\n","37":"\n\nResting all day. Raining & bitterly cold. Pinching apples and walnuts from the orchards. Had to cook our own tea in the evening because the transport left last night for Albert. We follow tomorrow. Farm people here have a fancy for rabbits,\n\nalmost every farm has its cage of rabbits. Whether they are pets or used for eating I don't know.\n","38":"\n\nMoved off at 8 am. and after a stupid round about march by our colonel we arrived at the position on top of a hill a few miles from Erguies where hundreds of Paris motor busses & motor lorries were lined up to take us to Albert. As far as the eye could see over numbers of hills there was this chain of motors. Leaving our position at about 10 am we\n\n(Passed Amiens, through part of it.)\n\npassed in a direction through Flixecourt to Buire arriving here at about 4 pm. As our motor had broken down on the road we arrived late and our Ambulance had moved off. After wandering about 4 miles off the road we finally found the others in Dernancourt close to Albert. Slept on wire beds in a barn. Bitterly Cold.\n","39":"\n\nIt was fearfully cold last night and frosty this morning. Moved off at about 9 am sighting the famous statue of Albert Church in the distance. Transport and\n\nmoving British Troops coming out of action made our progress along the roads very slow. German Prisoners. Every\nthing\n living creature is covered in mud. Guns booming from all directions. We gradually made our way round the hills along these muddy roads, over trenches & shell holes to a spot on the northern side of Mametz woods. Lucky to get in with Tommies and sleep for the night in a floored hut. 18\" gun on the railway line. Numbers of others on different branches of the railway now being pushed forward.\n\n22nd October (Sunday)\n\nUp about 8.30 am after bitterly cold night. Frost is thick on the ground and ice is caked on every waterhole. We moved out to the Advanced Dressing Station. Bearers were then sent across to dugouts at Green Dump, a mile further on to a position about a mile north of Montauban. 9.2\" and 8\" Howitzers not far away crashing out deafening reports. The whole earth is scattered with dugouts and guns. There are guns everywhere and thousands\n\nof shells to each gun. At 4 pm all our bearers were taken out to relieve the Tommy ambulance, our party taking the first post. The distance of 6,000 yards is worked in 7 posts. The noise of our guns as we passed under their muzzles and the fierce flashes which blinded us and left us dazed for some seconds afterwards were terrifying. Six 8\" howitzers close to the sap in which we 12 were stationed made the earth rock. Cotton wool in our ears was the\n\nonly step we could take towards easing the noise for our ear drums. Little grave yards are scattered here and there. From a small and insignificant little army England has one there now, the might of which will never be fully realized by those who have not been through a phase of this World's greatest butchery on the Somme. A few bricks remain of places that were once villages. High Wood and Mametz wood are torn up in a frightful state.\n\nFritz made a fine show of resistance no doubt, but he was absolutely blown out by artillery. Of all the ground visible for miles in every direction, up and down hill. There isn't a patch of sound earth. It resembles the effect of heavy rain on a pool of water. Aeroplanes, too numerous to count were up today and 22 observation balloons, one occupied by W. Beach Thomas the Daily Mail correspondent. Fritz can't get even one balloon up, so effective are our planes.\n\nFour fights in the air took place today. Our antiaircraft guns spoilt one engagement by unavoidably \nbringing one\n forcing our plane to land. It got in the fire zone of the land guns. However we brought down 3 German planes this afternoon. Relieved by the 14th Field Amb. at 12 o'clock midnight. 15th Field Amb. relieve the","40":" at 8 am in the morning.\n","41":"\n\nIt was a heavy task finding our way back to Green Dump. Almost all of us slipped\n\ninto water holes or muddy marshes so that we were clay from the tops of our heads to the big clumps of earth clinging to our boots. 17\" naval gun near green dump. Up to our post again at 4 pm today and enlarged the \ndug-out\n post into a fair sized dug-out. It's awful carrying patients at night, not only for the slippery mud and shell holes but also on account of the dazing and nerve-racking flashes from our own guns.\n\nAnother struggle back to green dump at midnight.\n","42":"\n\nRaining and dull again today. Guns still on their dismal boom, ours giving Fritz fully 20 to 1. Relieved tonight at 11 p.m. after 7 hours work because we have a more strenuous outing tomorrow. Numbers of our men are now cracking up under the strain.\n","43":"\n\nNo breakfast. Called out\n\nat 10.30 a.m. – moved off at 12.30 to take up a new post, this time the R.A.P. at the firing line 4 miles or more out. 26 men went out there. Saps up to our knees in water. Sinking to our knees on roads (or what was left of them). Passing through Flers we duly arrived at the old factory which to outside appearances is nothing but a heap of bricks and broken timber. Underneath, however the German dugout is an\n\nenormous place. Numbers of large rooms and passageways running deep into the earth, with two outlets is the nearest description. Shells have apparently failed to pierce the inmost parts. In here we were crowded out, as the place was full when we arrived. Worked in two shifts of 6 hours off & 6 hours on, 12 men & an N.C.O. per shift. When on duty we waited at the Medical Aid passageway, standing up all the time in this foul-aired compartment.\n\nWhen off duty we retired to a dark and cold draughty passage near the escape door. Here we sat huddled up or stood up for the 6 hours \nwith\n in wet boots & clay covered sand bags bound round our legs, these also soaking wet. During the whole 30 hours under these conditions Fritz shelled all round the place and even hit us at times. It was dangerous to show a head up the opening. Four men were\n\nkilled at the entrance just as we arrived. Imagine therefore the duty of stretcher bearers, for we are now carrying under heavy fire when other men in the dugout cannot venture out. The flare lights at night show us up, hence the liability of being picked out by machine guns. Climbing over trenches and round the shell holes where sometimes the path is only 6 inches wide and slippery the result was simply\n\nawful. Stretcher and bearers fell time after time but still we had to plod on. It's the heaviest and most exhausting duty on the field as even infantry admit. When our attack comes in a day or two I don't know how we are to get on.\n","44":"\n\nHeavily shelled today. The colonel of the 31st asked our artillery to retaliate and they did. Relieved two hours late – 8 pm instead of 6 pm so had to find our way\n\nright back over the 5 or 6 miles distance to Green Dump. This we did in 5 hours, losing our track more than once. I fell into the mud 5 times but all the others were worse off. Absolutely exhausted when we reached A.D.S. where they gave us cocoa. Glad to reach Green Dump at 1 am tonight and get our wet things off, also to get some stew and tea. During the two days we have been out our rations consisted of 2 loaves for 13 men\n\n2 small tins of jam, & 1 tin of butter. 2 tins of Pork & Beans enough only for 4 men for 1 meal, and 1 tin of Army Rations (meat & vegetables cold) sufficing 4 men for 1 meal. Hence there was only really enough for 1 meal all round, therefore, of the 5 meals, we missed four. How ever did we lift a stretcher? We were glad to get a sleep too on arriving at Green Dump because we had none last night.\n\n27th October (Friday)\n\nStayed in bed all the morning. Cold, cloudy & raining outside. At 4 pm we moved off to relieve the 14th F. Amb. at Runner's Post (the second). It was raining heavily at the time and we lost our way. We went miles out of our course through Longueval & Delville Woods. In these places there is good evidence of bitter fighting. Absolutely wet through we duly relieved the 14th and spent a busy evening with patients as a \n\nresult of Fritz's heavy shelling. The sap in some places holds water knee deep and mud the same depth in other places. The number of sick men from our unit is rapidly increasing. There will be more after our present experience. Alick, the cook, put blanket socks on us while our others dried, but even so we were nearly frozen in this draughty spot.\n","45":"\n\nThe attack previously arranged for today has been put off\n\non account of the beastly weather. The mud in places is feet deep. No sleep at all last night. A new invention has been put into operation today in the shape of a sledge which holds one stretcher. This is drawn by a horse and it slides over the mud. It is hoped to use this method more extensively in the future and so save the stretcher-bearers laborious work. Air fight today in which one of our planes came slowly to earth. At 6 pm we moved out to Goose Alley,\n","46":" Fritz plane brought down)\n\nanother R.A.P. about the same distance out as Factory Wall, past Flers. Infantry were changing over at the same time and Fritz was throwing a barrage across. Of the 6 or 7 small houses which constituted Flers before the war there isn't one brick left upon another. One time villages are now only a few bricks. A tank may be seen near Flers and the paths across trenches by these instruments are visible outside our present German dugout. Yes, we\n\nare again in a deep German Dugout close to the firing line. German dead bodies are scattered all over the ground. About a dozen wounded were taken back to Flers tonight.\n","47":"\n\nWoke up this morning after a short sleep, and could hardly speak with the bad cold I developed in the night. One of our patients today had shot himself in the foot. Met Bert Newman. Relieved at 4.30 pm & left for Green Dump hurried along by 3 shrapnel shells from Fritz. Issued with\n\nnew pair of socks and hot tea on arrival at Green Dump. 17\" Naval Gun kept waking us up through the night.\n","48":"\n\nRaining & bitterly cold wind blowing. Attack which had been put off till today has to be postponed still further. First shave for 12 days & first apology for a wash in 10 days. Took up position at Turk Post. The rain was coming in through the stretchers overhead and one portion of the sap collapsed. We were all wet through and our feet were\n\nfrozen. Two of us therefore decided to go down to the A.D.S at Thistle Dump and sit in the cook house, which we did. No sleep all night.\n","49":"\n\nAt mid-day after removing a large number of wounded we were ordered back to A.D.S. as Turk Post would not be used again on account of the sledges. At A.D.S. we had to pull down a large dug out and were then sent out to McCormack's Post to assist in digging new accomodation for a dressing station to be used when the advance comes. On arrival at\n\nMcCormack's (near Flers) we found that a large body of men were already engaged in the work. It looked dangerous considering that the day was so clear and aircraft were busy. As we expected, Fritz immediately commenced to throw shells round us so that we had to clear off back to Green Dump. On the way back we were dodging numbers of shells. Infantry were changing over at the time and some of these were killed or wounded. 5 infantry attached to us as stretcher bearers were killed. Jim Lilly seriously wounded in head. Palmer\n\nblown into the air some 20 ft. At night Fritz threw gas shells over near Green Dump.\n","50":"\n\nReported at Thistle Dump 9.30 am for fatigue or other work and we had to erect tents. The earth is covered with mud feet deep in places and it was raining most of the day. Cold and dull day. 2 German planes brought down. There is excitement in the air almost every day. I counted 30 of our aeroplanes up today and 17 observation balloons. Returned to Green Dump with the remainder from\n\ntheir 48 hours duty, to find that our belongings had been pilfered by the infantry. The usual procedure of putting boots in front of a fire before getting to bed.\n","51":"\n\nRaining, dull, and bitterly cold again. Continuing with the erection of tents until 3.30 pm, then sent out to duty at McCormack's post. 5 bearers from","52":" F. Amb. wounded. The attack which should \nf\n have taken place on 25th ult. and has been postponed so often was to have been attempted \n\nfor certain today but weather conditions are too bad, so the event has been put off indefinitely. 3000 guns were going to throw and lift a barrage at intervals of 4 minutes. Informed that our division will be relieved in couple of days. So it should be. 270 on sick parade from one infantry Battalion yesterday & a large number today. Only 44 from close on 300 of our unit could be mustered for stretcher bearing today. Wounded are coming in in one continuous stream, some dying on the way in and being buried near the A.D.S.\n\nFrom our post tonight we carried about 17 cases in a few hours, distance 1½ miles. We are all exhausted. Infantry with us say it's the hardest work ever they were asked to do. Two of us found cover in a hole with a stretcher across the top for shelter. We sat in here all night without any sleep.\n\n3rd November (Friday)\n\nAt midday moved out to Goose Alley again. Nearly blown up on the way. Shells landed all round us when near Flers. Rush of cases during.\n\nthe night. Still raining & miserable out.\n","53":"\n\nAt 9 am a relief from the 6th F. Amb. 2nd Division arrived and we were quite merry over the thought that we would be leaving the Somme. Our Amb. is now working in the 2nd Division after having done its share with the 5th. Both the other ambulances have left. On arrival at Green Dump orders for leaving at 2 pm were cancelled and sub. by orders to prepare for action again tomorrow if the 5th F. Amb. do not arrive tonight.\n\nWent to bed absolutely worn out.\n","54":"\n\nThe 5th F. Amb. not having arrived yet we were ordered out for duty again. The attack came off this morning so we are right in it now. The country beyond Geudecourt is one mass of exploding shells. All along the line on our left, front & right the shells are falling like hail on Fritz. How any living creature can exist I don't know. (Afternoon) Wounded are coming through in large numbers & we are struggling in\n\nwith them. The 27th & 28th Batt. of the 2nd Div. went over this morning and took the ridge leaving one other before Bapaume. From the chaos of the battlefield rumours say we have been driven back but this can't be verified in such confusion as yet. Late into the night we worked with the wounded slipping and sliding between shell holes. Rain is still falling.\n","55":"\n\nStill busy with the wounded. Gun blown out near our post. The Crest under heavy shell fire making our position\n\ntoo hot. Wounded happened to be coming in in large numbers at the time and we had to carry two to a stretcher. One of our dug outs was blown up. Runners Post evacuated by our unit because the bearers were knocked up so our party worked two posts until the relief came. We have therefore worked 3 days with another division because of the slowness of the 5th Fld. Amb. and the work has been exhausting. Early in afternoon relieved and returned to Green Dump. Rain falling heavily. Our\n\nfeet have been wet during the whole 16 days at the front and now we are once more wet through. Only a drink of tea & biscuits for a meal when we came in.\n","56":"\n\nWe all spent a restless night. Whenever I woke up I could hear the others moaning or talking in their sleep. All are absolutely knocked up though only about 10 in the section have stuck to the work all through without falling out or reporting sick. Drink of tea for breakfast and nothing\n\nelse. Moved off between 8 & 9 am in heavy rain & passed along the railway line back to a position 1½ K from Albert, carrying packs & blankets. Our destination was the Main Dressing Station & we were put into big tents for the night after being given what was available in the way of new socks, food tobacco etc. No news of our \n\nAmbulance.\n","57":"\n\nDoing nothing all day at this place Becordel awaiting orders as to whether we move\n\nor not. Our Headquarters are back near Amiens. Raining all day.\n","58":"\n\nMending roads near the German Prisoners. This is our share of “rest\". It is now definitely known that we are to stay here until required back at the front. Major Williams & Newell have left us as Lt. Cols. to command other units. Our Colonel is on leave, so we have been temp. abandoned. Jumped on motor lorry in afternoon & rode into Albert. There are no more than\n\na dozen civilians in the place. Troops are billetted there in thousands. The Church is well worth viewing and the stature is a wonder. Shells were falling in Albert while we were there.\n","59":"\n\nZep. brought down during the night & it landed on French Amm. dump near us. Getting stones for road mending all day. Visited \nBecourt\n Meaulte in evening. Shells dropped round our camp during the night.\n","60":"\n\nHeard that last night a German Plane swooped down near our quarters and a traffic policeman was shot. More shells dropped round us early in the morning. Making roads all day.\n","61":"\n\nChurch Parade in morning. Moving tents and baggage all afternoon, then ordered out after tea to put tents up. When the “Fall In\" blew it was a sight to see a crowd\n\nof our men running for the road with coats and hats under their arms.\n","62":"\n\nIn morning all A Section went to the baths and in afternoon we were down at the quarry getting stones.\n","63":"\n\nRushed off as attendant on Motor Car to Thistle Dump. 12 went in all. Took 7 hours to get there, such was the bad traffic management. Wounded were being brought in in large numbers and we were taking them off to the railway\n\nwhere they were transferred to cattle or open trucks. Blocked for 7 hours at one spot on the road with our first load. 3 died in our ambulances. Conditions today are a disgrace to civilisation. Worked all day without any rations. Saw tank in motion near Montauban. German plane brought down in flames.\n","64":"\n\nWe were going all night, three of us, the remainder having returned to M.D.S. last night. It was bitterly cold at 5 am so we three decided to clear off seeing that\n\nno wounded were coming through. We made off back to Becordel on foot, leaving the 2nd Div. Amb. to do their own work. We had been going hard, loading & unloading waggons, stretcher bearing etc. and were nearly frozen with the cold. Yesterday a shell landed a few yards from me, and gave a Tommy shell shock. I carried him in. Arrived M.D.S. & refused to do anything all day. Tonight all hands were called out at 8 pm to parade with overcoat &\n\nblanket the rumour being that they were going to do duty on a hospital train. Trains carry wounded from Quarry Dump near Montauban to Becordel & patients are carried up to the Main Dressing Station.\n\n16th November (Thursday)\n\nWe were not required to go out last night and thereby \ngreat\n got off well because the others were sent off some miles to unload timber from trucks. They returned at 3 a.m. highly indignant\n\nat the nature of the \npart we are having\n job they had been on when we are expected to be back at the trenches any day now. A large batch of our unit last night went off to Quarry Dump to assist the 7th F. Amb. loading trains. Its a mystery to me why the","65":" Div. Amb. can't carry on considering the beautiful weather they are having as compared with the 17 days rain and misery we had. This morning the frost was thick on the ground and even mud was frozen. Cleaning the\n\ncamp up all morning. Issued with new clothes where necessary, sheepskin vests, trench gloves and mittens. Cleaning up the camp again in afternoon. Amusing to see two of our chaps jump into a G.S. waggon and clear off. We managed to bolt too and spent the evening in \nBecourt\n Meaulte. Bitterly cold tonight.\n","66":"\n\nFrost thick on the ground. Bitterly cold this morning. On sick parade with bad throat and chest. Poor attempt at medical treatment by one of the many\n\nboy doctors. Put myself on “No Duties\". Remainder loading coal in Albert. 14th F. Amb. arrived to re-enter the line. We also expect to be going in again on Sunday. The other day a German airman flew over the D.R.S. & C.C.S. dropped bombs and inflicted many casualties. The plane was forced to land further up & the men gave themselves up to a few 3 F. Amb. Bearers. If these airmen had landed here they would have been torn limb from limb, so frantically mad are the\n\nAust. troops about this quarter. However, it is understood that both have been shot.\n","67":"\n\nSnow was falling all night and is now thick on the ground. Water everywhere is frozen. Our boys again refused to fall in until they had finished breakfast. Snow ball fight on parade.\n","68":"\n\nRaining all morning. Afternoon clear so two of us went to Heiley on Red Cross Amb.\n\nMotor. This is the Aust. Army Hd. Q. where Gen. Birdwood is situated. The C.C.S.'s also are here. There was little to be seen in this village, lights being extinguished on account of aeroplanes. However we managed to secure a feed & caught a bus back.\n","69":"\n\n14th Fld. Amb. bearers went out to take up the positions behind our division which has relieved the Guards to the right of Flers. Unloading motor ambulances all day and unloading a \n\ntrain of wounded after tea. Orders for marching out tomorrow.\n","70":"\n\nCommenced our journey in motor ambulances but were held up on the road so had to continue on foot, packs being carried on the waggons. Arrived at destination Bernafay Wood and, after erecting tents settled down for the night. The ground is soaking wet, a bad place for tent accommodation. Huge naval guns were firing late into the night and some shells from Fritz landed\n\nnearby.\n\n22nd November (Wednesday)\n\nAll our unit on fatigue work. Fine air sights. 3 planes brought down, two at least being Germans. It was a grand bit of sport. One Plane came down headlong & the other rolling over & over sideways. 15th Fld. Amb. relieved the 14th in the trenches. The","71":" didn't like the idea of carrying Grenadier Guards out as patients because of their great physique. Fierce bombardment and machine gunning till after midnight.\n\n"}}