{"Document Name":{"0":"Diary_0077","1":"Diary_0077","2":"Diary_0077","3":"Diary_0077","4":"Diary_0077","5":"Diary_0077","6":"Diary_0077","7":"Diary_0077","8":"Diary_0077","9":"Diary_0077","10":"Diary_0077","11":"Diary_0077","12":"Diary_0077","13":"Diary_0077","14":"Diary_0077","15":"Diary_0077","16":"Diary_0077","17":"Diary_0077","18":"Diary_0077","19":"Diary_0077","20":"Diary_0077","21":"Diary_0077","22":"Diary_0077","23":"Diary_0077","24":"Diary_0077","25":"Diary_0077","26":"Diary_0077","27":"Diary_0077","28":"Diary_0077","29":"Diary_0077","30":"Diary_0077","31":"Diary_0077","32":"Diary_0077","33":"Diary_0077","34":"Diary_0077","35":"Diary_0077","36":"Diary_0077","37":"Diary_0077","38":"Diary_0077","39":"Diary_0077","40":"Diary_0077","41":"Diary_0077","42":"Diary_0077","43":"Diary_0077","44":"Diary_0077","45":"Diary_0077","46":"Diary_0077","47":"Diary_0077","48":"Diary_0077","49":"Diary_0077","50":"Diary_0077","51":"Diary_0077","52":"Diary_0077","53":"Diary_0077","54":"Diary_0077","55":"Diary_0077","56":"Diary_0077","57":"Diary_0077","58":"Diary_0077","59":"Diary_0077","60":"Diary_0077","61":"Diary_0077","62":"Diary_0077","63":"Diary_0077","64":"Diary_0077","65":"Diary_0077","66":"Diary_0077","67":"Diary_0077","68":"Diary_0077","69":"Diary_0077","70":"Diary_0077","71":"Diary_0077","72":"Diary_0077","73":"Diary_0077","74":"Diary_0077","75":"Diary_0077","76":"Diary_0077","77":"Diary_0077","78":"Diary_0077","79":"Diary_0077","80":"Diary_0077","81":"Diary_0077","82":"Diary_0077","83":"Diary_0077","84":"Diary_0077","85":"Diary_0077","86":"Diary_0077","87":"Diary_0077","88":"Diary_0077","89":"Diary_0077","90":"Diary_0077","91":"Diary_0077","92":"Diary_0077","93":"Diary_0077","94":"Diary_0077","95":"Diary_0077","96":"Diary_0077","97":"Diary_0077","98":"Diary_0077","99":"Diary_0077","100":"Diary_0077","101":"Diary_0077","102":"Diary_0077","103":"Diary_0077","104":"Diary_0077","105":"Diary_0077","106":"Diary_0077","107":"Diary_0077","108":"Diary_0077","109":"Diary_0077","110":"Diary_0077","111":"Diary_0077","112":"Diary_0077","113":"Diary_0077","114":"Diary_0077","115":"Diary_0077","116":"Diary_0077","117":"Diary_0077","118":"Diary_0077","119":"Diary_0077","120":"Diary_0077","121":"Diary_0077","122":"Diary_0077","123":"Diary_0077","124":"Diary_0077","125":"Diary_0077","126":"Diary_0077","127":"Diary_0077","128":"Diary_0077","129":"Diary_0077","130":"Diary_0077","131":"Diary_0077","132":"Diary_0077","133":"Diary_0077","134":"Diary_0077","135":"Diary_0077","136":"Diary_0077","137":"Diary_0077","138":"Diary_0077","139":"Diary_0077","140":"Diary_0077","141":"Diary_0077","142":"Diary_0077","143":"Diary_0077","144":"Diary_0077","145":"Diary_0077","146":"Diary_0077","147":"Diary_0077","148":"Diary_0077","149":"Diary_0077","150":"Diary_0077","151":"Diary_0077","152":"Diary_0077","153":"Diary_0077","154":"Diary_0077","155":"Diary_0077","156":"Diary_0077","157":"Diary_0077","158":"Diary_0077","159":"Diary_0077","160":"Diary_0077","161":"Diary_0077","162":"Diary_0077","163":"Diary_0077","164":"Diary_0077","165":"Diary_0077","166":"Diary_0077","167":"Diary_0077","168":"Diary_0077","169":"Diary_0077","170":"Diary_0077","171":"Diary_0077","172":"Diary_0077","173":"Diary_0077","174":"Diary_0077","175":"Diary_0077","176":"Diary_0077","177":"Diary_0077","178":"Diary_0077","179":"Diary_0077","180":"Diary_0077","181":"Diary_0077"},"Date":{"0":"unknown","1":698.0,"2":699.0,"3":700.0,"4":701.0,"5":702.0,"6":703.0,"7":704.0,"8":705.0,"9":706.0,"10":708.0,"11":709.0,"12":710.0,"13":711.0,"14":713.0,"15":714.0,"16":715.0,"17":716.0,"18":717.0,"19":718.0,"20":719.0,"21":720.0,"22":721.0,"23":722.0,"24":723.0,"25":724.0,"26":725.0,"27":726.0,"28":727.0,"29":728.0,"30":729.0,"31":730.0,"32":731.0,"33":732.0,"34":733.0,"35":734.0,"36":735.0,"37":736.0,"38":737.0,"39":738.0,"40":739.0,"41":740.0,"42":741.0,"43":745.0,"44":746.0,"45":747.0,"46":748.0,"47":749.0,"48":750.0,"49":751.0,"50":752.0,"51":753.0,"52":754.0,"53":755.0,"54":756.0,"55":757.0,"56":758.0,"57":759.0,"58":760.0,"59":761.0,"60":762.0,"61":763.0,"62":764.0,"63":765.0,"64":766.0,"65":767.0,"66":768.0,"67":769.0,"68":770.0,"69":771.0,"70":772.0,"71":773.0,"72":774.0,"73":775.0,"74":776.0,"75":777.0,"76":778.0,"77":779.0,"78":780.0,"79":781.0,"80":782.0,"81":783.0,"82":784.0,"83":785.0,"84":786.0,"85":787.0,"86":788.0,"87":789.0,"88":790.0,"89":791.0,"90":792.0,"91":793.0,"92":794.0,"93":795.0,"94":796.0,"95":797.0,"96":798.0,"97":799.0,"98":800.0,"99":801.0,"100":802.0,"101":803.0,"102":806.0,"103":807.0,"104":808.0,"105":809.0,"106":810.0,"107":811.0,"108":812.0,"109":813.0,"110":814.0,"111":815.0,"112":816.0,"113":817.0,"114":818.0,"115":819.0,"116":820.0,"117":821.0,"118":822.0,"119":823.0,"120":824.0,"121":825.0,"122":826.0,"123":827.0,"124":828.0,"125":829.0,"126":830.0,"127":831.0,"128":832.0,"129":833.0,"130":834.0,"131":835.0,"132":836.0,"133":837.0,"134":838.0,"135":839.0,"136":840.0,"137":841.0,"138":842.0,"139":843.0,"140":844.0,"141":845.0,"142":846.0,"143":847.0,"144":848.0,"145":849.0,"146":850.0,"147":851.0,"148":852.0,"149":853.0,"150":854.0,"151":855.0,"152":856.0,"153":857.0,"154":858.0,"155":859.0,"156":860.0,"157":861.0,"158":862.0,"159":863.0,"160":864.0,"161":865.0,"162":866.0,"163":868.0,"164":869.0,"165":870.0,"166":871.0,"167":872.0,"168":873.0,"169":874.0,"170":875.0,"171":876.0,"172":877.0,"173":878.0,"174":879.0,"175":880.0,"176":881.0,"177":882.0,"178":883.0,"179":884.0,"180":885.0,"181":886.0},"Entry":{"0":"\n\n","1":"\n\nPassed a very wretched day, Caused through the thoughts of losing my Dear Relations & friends.\n\nAfter, a very trying time, in which I had to say good bye to all who are most Dear to me, I ran into trouble at the \"Camp\" where the fellows, most of them intoxicated were fighting among themselves. \n\n However, barring a few sore heads they were none the worse for it.\n\n I have to make this a very Black Day, as I have felt what sorrow is, & I will carry the look of Dear Nina’s face with me all through the War.\n\n3 am. Reveille for the March to the Boat. \"H.M.S Persic\" (A 34)\n\nPoor old Mum bore up well but felt the strain, also Oss , & Edna.\n\nWe are all naturally looking forward to see the ship which is to carry us Away, On! On! to what? Glory or death\n","2":"\n\nWe are now on Board! We left \"The Warren\" at 4.30 pm & to say a further good-bye to Nina I came on a later Train to Seymours Corner, & then got the Military Car to catch up with the Troop Trans. We finally arrived at Woomooloo Wharf. What a Crowd to see us off! fully 5,000, but what a sad sight, nothing but tears.\n\nWifes saying good-bye to Husbands & Sisters to Brothers, & Sweethearts to Sweethearts. Although I only had Father to say good-bye to, my thought were sad, with the recollection of you one & all. There was a touch of splendour to all the sadness, when one glanced along the Boat & saw the thousands of Streamers, which were held by friends on Shore to the Boys on the Boat.\n\nAfter a delay of 1 hour, word was given to \"Cast off\", & then we all realised that we were really leaving Australia.\n\nHeavens! how slow the huge Boat moved out, as if she was mocking the saddened crowd of Relations & friends, frantically waving their farewells, alas in many cases for the last time. We were towed down to Mid-stream where we anchored, to the absolute deafening accompaniment of Whistles & Sirens. Never in the War, has there be such a send off. All day long crowds of friends have been flashing round the Boat in Launches.\n\nPunctually at 3.30 pm the anchor was weighed & the nose turned towards the Heads. of the trip through I cannot say anything, save that one had a choking sensation of lonliness. Onward we steamed till night fell, no sign of Land, & the constant sound of the waves dashing against the sides of the giant ship. \n\nNight, - everything black but we still steam on\n\non towards Melbourne. Speaking of the Boat, Her name is \"The Persic\" (A34) 12,000 Tons, with a Crew of 200 & 1500 Troops aboard, all mounted men. . To explore every part of her would take the best part of a Week. To walk round the Deck takes 30 minutes, so you can judge her dimensions.\n\nThe men sleep in Hammocks, suspended from the ceiling, & I can tell you it is a strange sight to see them all in Bed. I will now finish to-days narrative & turn in, & wonder what the morning will bring forth.\n","3":"\n\nThe Day break was accompanied by a perfect Gale of wind, which lashed the water to a state of fury & consequently tossed our home about.\n\nAll the morning we steamed on without a sight of land, but in the afternoon could faintly discern a high range of Hills in the distance, which on coming closer turned out to be Twofold Bay or (Eden).\n\nThe sights which unfolded themselves to our view whilst within range of the Coast where numerous & pretty. Every now & then a small town could be seen away amidst the Towering Cliffs, which gave them a lonely but beautiful appearance.\n\nWe next passed 90 mile beach\n\nthe name of which implies its nature. It is a long Sandy Beach & runs for 90 miles without a break. The rough weather still continues.\n\nBega, Nelligen & other Coastal Towns were next passed. Nothing of interest was noticed after this until we came to Gabo. This was of special interest to us as it is practically the Boundary between N.S.W. & Vic. & we consequently concluded that we were saying farewell to Sunny NSW We cheered & the band played \"Auld Lang Syne\"\n\nNothing broke the Monotony of \"A life aboard\" then till to-night when we came in sight of Mt Everett from which point, the course deviates & once more we are out of sight of Land but expect on rising in the morning to be in close to the Victorian Coast.\n","4":"\n\nThe Coast line now for a considerable distance was entirely obscured by the Mist, but in places could be seen & was very pretty. After a time we again left the Coast, but picked it up an hour or two later\n\nAt 11.45 we saw Melbourne Heads in the distance, at this time there was a fairly heavy swell, but the day turned out to be excellent. At this juncture we had a fine sight of a Sea Lion, which came up on the Port Side of the Sergeants Deck,\n\nwhich by the way is situated amidships. \n\nOur first sight of Melbourne, which was very indistinct was obtained at 1.30, but it is still 4 hours steam to Port Melbourne.\n\nAt 1.40 pm the Pilot came aboard & then we got a shake up, as we had to go over the Rip, & seeing that we have a mean draught of 23 ft & the depth of water is only 28 ft, you can guess how the sea was running.\n\nWe pulled up in Mid-Stream & eventually started to move in slowly for the wharf (Port Melb) at 6-o’clock, & to give you a description of the Harbour, it took us an hour & half to get into the wharf. We were met by a lot of the Heads & granted Leave for Saturday night & Sunday at ½ past 8.\n\nMy impressions of Melbourne\n\nWe left the Boat at 9 pm & after walking ½ mile, caught a train for Melbourne. after a quarter hours run we arrived at Flinders St Station. As far as streets go they are very nice. Their Cafes are more up to date than Sydney, also Railway Carriages, but comparing it with Sydney, in my opinion it would not stand alongside it.\n\nWe visited Francatelle Cafe, & after a regular Banquet, returned to the Boat by Motor Car at 2 am in the morning.\n","5":"\n\nWas Fairly quiet day as far as Military work was concerned. I made a thorough inspection of Melbourne & Suburbs by Motor Car & found the trip very pleasant. We wound up the evening by visiting Mr Hart, Chief Director of the Griffiths Bros, & finally returned tot the Boat at 11.55 pm.\n\nThe places visited were Melbourne E Melbourne, Port Melbourne, Kew, E Kew, Auburn, Prahan, St Kilda, & others which I do not know.\n","6":"\n\nThe Day broke with a very dirty wind blowing & sleeting rain. At ½ past 9 the 17th Brigade Artillery whom we had called for marched onto the pier, to the accompaniment of Martial airs played by the bands. The people were allowed on the Pier, but there was a very poor showing, the crowd not numbering over 300, & after the send off we had from Sydney, made us think all the worse of Port Melbourne.\n\nAt 12 oclock the anchor was weighed & we headed for the West.\n\nWhat a Sea! Every time the boat came down the Nose would break the sea & send it in showers\n\nall over the Liner.\n\nAt the time of writing it is still running strong, but we hope for calmer weather in the morning\n","7":"\n\nHeavens! What Seas – They kept us awake all night. The Boat would pitch until you thought she could not right herself & then roll back again & all the time your heart would be in your mouth.\n\nAt mid-day they abated somewhat, but with the close of day the storm is increasing in fury.\n\nImagine waves 40 or 50 ft high & you can picture what it is like. They seem to rise & strike the ship, which appeared to roll aside just as they are about to strike. All the Boat is practically sick, with but few exceptions. It is laughable to see the different expressions on the faces. All looking very dejected & miserable.\n","8":" far, apart from feeling a little squarmish, I have kept up to it & am feeling quite proud.\n\nWe struck the S. Australian Coast at 12.45 pm to day, but have left it again, as we understand the Boat is not going to call at Adelaide.\n","9":"\n","10":"\n\nThe morning broke a very ideal day. We first sighted the Albany Coast at 7 am, & we were all pleased that at last we were through the Bight. In all my life I have never seen such delightful scenery which now unfolded itself to our gaze. \n\nMile after mile of Steep Cliffs all grass covered & rising to a height of about 200 ft from the Sea.\n\nWe entered Albany Harbour W\/Australia at 9.30 am. Albany is 14 miles up the Harbour. The whole Course is dotted with small Islands, which gives it a bright appearance. They have very long Piers here which run out 2 or 3 hundred yards into the water. We only stayed long enough to put a few cases of contagious Cases ashore & started off again. \n\nThe scenery all along was very pretty, the whole Coast lines being dotted with Small Islands, which makes navigation very difficult.\n\nWe now reached the \"Leuwin\" where 2 seas meet, & have left the Coast of Australia behind for an indefinite Period. We were all allotted to Ships Lifeboats, Rafts etc to-day, & started \"Fire & Collision\" drill in case of accidents.\n","11":"\n\nWe are now far out at Sea on our long voyage. The weather is very good & the Sea smooth. The \"Ceramic\" caught us up to-day & is now ahead of us, while some more are behind. We got through the \"Leuwin\" well & are looking for a good trip from now on. \n\nChurch Service was held to-day & conducted by the Captain of the Ship. It was very impressive being attended by about 900 men. \n\nThe Band Played Sacred music & we all sang Hymns which were beautiful.\n\nThe weather is getting very hot, & I believe we will be in the Tropics in a few days time, so that coupled with our trip across the Indian Ocean will make us very uncomfortable, but it will be acclimatizing us for what we will get in Egypt.\n","12":"\n\nWe are now 1000 miles in the Indian Ocean, but have still 5000 to go. The weather still continues to get hotter & to this end all Decks are having awnings of Canvas put over them.\n\nLast night the Band was playing & I got very sad & lonely as they played \"Somewhere a voice is Calling\". My mind immediately went back to the loved ones at home. We are fighting the A.S.C Championship off with Gloves (that is the men) & I can tell you there are some willing contests. \n\n I will write the winners name on the Date of the final.\n","13":"\n\nStill out at Sea, nothing of much importance happened\n","14":"\n\nThe first Day of the month of Christmas & we are still punching on towards Egypt. We are now practically through the \"Trade Winds\" which every boat catches to help them on. \n\nAnother couple of Days & we will be in the tropics. \n\nThe Boxing preliminaries came off to-day & the A.S.C. came out with a win for each Representative. The finals are to be fought later on. The food is going from Bad to worse.\n","15":"\n\nIt is the advent of a miserable time. I received another Inoculation & consequently am feeing very sick.\n\nToday we passed within Steaming distance of Cocos Islands but did not see anything. Fairly heavy Seas running.\n","16":"\n\nFairly heavy Seas still running Had a mock \"Fire & Collision\" Alarm to test us & every man was at his post in 10 minutes, Life Belts on & everything complete. \n\n Boats were ready to lower & Rafts ready to throw overboard. \n\nStill very sick from effects of Inoculation & Tropical Heat, which makes one feel very Sick.\n","17":"\n\nWeather very hot. Concert came off last night & proved a great success. Sea very calm, rained very hard this morning, Tropical Showers very frequent in this latitude. One of the peculiarities of this place \"The Tropics\" is the great number of Shooting Stars, each one lighting up the whole sky.\n","18":"\n\nAnother hot & sultry day. Held Church Service on Board, which was appreciated by everyone. Ran into Schools of Flying Fish, one of which flew on Board.\n","19":" 6th.12. 15.\n\nStill hot. Passed \"Line\" 12.30 pm Sighted Ship but too far away to see who she was.\n\nWe are now right in Eastern Waters & consequently our danger of Submarines commences. \n\nName of Ship painted out & also Signs on Port & Starboard sides of Boat Bridge covered over (A34). \n\n Raining hard off & on Tropical Showers. \n","20":" 12. 15\n\nNothing much doing. Weather very hot, & playing up with our fellows. 10 in Hospital with Sunstroke. \n\nSquall rising this afternoon accompanied by terrific rain & wind.\n","21":"\n\nStill very hot. Held Sports & Concert. Two Reps. A.S.C. again successful.\n\nTurner won on knock-out from Woods F.A. Charlsworth won on points from Phillpots B.A.C. \n\nConcert again held in the evening & proved very attractive.\n","22":"\n\nAnother very monotonous\n\nDay with nothing of any importance. Very Hot.\n","23":" &","24":"\n\nStill far out at Sea with no sight of land. Weather very hot. Thunder Storm raging\n","25":"\n\nToday we again held Church Service which was very nice. A very quiet day for me. The Company taking their turn of Duty. To night begins our very dangerous run up the Red Sea. \n\n At 12 midnight we passed the Town of \"Gardafui\" The N.E. point of Africa & situated in \"Somaliland\". Next Tuesday we reach \"Aden\" We also passed The Islands of \"Socotora\". There is a Legend attached to this Island which I will explain - \"In the early days a Spanish Fleet put in to \"Aden\" which is a British Port, & Naval Base. The Commodore of the \"Spanish Fleet\" dined with the British Commodore & during the Course of Conversation, stated that he was going to plant the Spanish Flag on \"Socotora\". A British \"Middy\" hearing this, immediately\n\nmanned a \"Frigate\" & Slipping out of the Harbour, sailed for the Island & planted the British Flag on it. When the Spaniards arrived some time later they found the British Flag there, & it has remained British ever since. This is what they term \"British Piracy\" at Sea. The weather is steadily becoming warmer but it is to be expected as we are in the \"Gulf of Gardafui, which is the approach to The Red Sea.\n","26":" Dec.15\n\nTo-day has been an all important one. We passed the Town of Gardafui at 4.30 pm & shortly afterwards were all roused up as 3 Boats could be seen approaching us at a furious pace. On coming closer they turned out to be 3 British Cruisers, which were to be our Escort.\n\nNow it will show you how important our Boat is when you think that she is taking 2 Brigades of Artillery 600 men & guns, 1 Troop of Light Horse 300, 1 Corps of Signallers, 1 Coy of A.S.C. & several lots of Reinforcements, 300. So she is being guarded, as it takes too long to train F.A. Signallers, LH & ASC to risk them with a torpedo.\n\nWe passed several Troop\n\nShips in this vicinity & are now taking a Westerly Course, in between the Arabian & African Coasts.\n\nIt is a common sight to pass Arab \"Dhows\" they call them as much as 10 miles out at Sea. They are very fierce looking men, but I suppose quite harmless, although I would not trust one of them. They all carry knives in their Belts.\n\nThe African & Arabian Coast Line is nothing to be compared with the Australian. It rises abrupt from the Sea to a height of about 700 feet & is inhabited by Arabs & Blacks respectively. The Water here has a kind of greenish colour, so different to the Pure Blue Colour everywhere in evidence round the S. Australian Coast.\n\nThere are myriads of Flying Fish here ranging in size up to 3 ft long. We can now see about 5 or 6 Transports ahead of us. \n\n In all 56,000 men are leaving Australia, forming the 2nd Division and are strung out between Sydney & here in batches, what a haul for a daring Submarine, but hurrah for British power, the Seas are swept clear of these pests in this vicinity.\n","27":"\n\nWe arrived off \"Aden\" at 10 am this morning but did not put into Port. Three other boats which have accompanied us went in. On examining the Shore with Glasses we could discern a Warship anchored there, also rows of Red Tiled roof houses. It is very mountainous County & extremely hot.\n\nWe have since been running up the Arabian Coast & passed the place where the Mohammedans make their Pilgrimages to \"Mecca\" \"Medina\" & \"Jeddah\" although no one who is not of their faith is allowed to go. unfortunately the Pilgrim Season has just passed so we did not see them, but I understand that some of them come right out from the Shore in their \"Dhows\".\n\nIn describing the Arabian Country & Coast Line, I would like to say that it is a terrible place. The Coast for a long way is dotted with huge mountains of sand which make the eyes very sore to look at it for any time. On proceeding along further it opens out & rolls back into the interior in one vast desert, with nothing but roll & ridge of Sand. Absolutely no veg-\n\n etation at all. After coming from Sunny N.S.W I can honestly say that the Australians as a rule do not know the beauty of their Country. The African Coast on the Port side seems to be very thickly shrubed, but as we are a good way off I cannot say much of it.\n\nThe Captain told us that from \"Guardafui\" right up to Island of Perim, it is inhabited by Natives, etc, who are not pleasantly disposed towards White Men. Another 36 hours run & we will arrive at \"Perim\" the Gibralter of the Red Sea. \n\nWe are now opposite the Islands called \"The Twelve Apostles\", & have passed Mount \"Siniaii where as you know Moses offered up his child\" So you can see we are now in the vicinity of the \"Holy Parts\"\n\nWe just passed a British Auxilliary Cruiser & all had to \"Line Ship\" & stand to attention. I could not find out her name.\n","28":"\n\nI will attempt to describe \"Perim\" as we saw it - It is a solid Island with ridge after ridge of granite rock, it guards\n\nall approaches to the Red Sea & perfectly bristles with Guns. It is approximately 1 mile in length & has a Lighthouse on each end. The centre is also honey-comed with lights. It was here that the \"China\" ran ashore.\n\nIn between Perim & the main-land (Arabia) is what is termed \"Hells Gates\" at the entrance to the Red Sea, & I can tell you it is very appropriately named. The Coast for a long way is studded with abrupt & steep Cliffs, the same absence of vegetation making it look very harsh & forbidding.\n\nWe are now several hundred miles \naway from the Coast &\n along the Red Sea & hope to reach \"Port Suez\" next Saturday night, which we understand is to be our destination.\n\nWe picked up our first bit of War News by wireless to-day, & it did not brighten us up, as it was a slight reverse in the Balkans.\n\nWe have several contagious diseases in the Hospital, & think that we will be quaranetined on arriving at Port Suez.\n\nThere are a lot Boats in rear of us, that picked us up to-day, but so far we cannot make out what\n\nthey are, we presume however, that they are New Zealand Transports.\n\nThe finals of the Boxing Contests came off to-day, & we secured a Victory over the Artillery, with our two men. We expect to soon pass where \"The Lord divided the waters for the Israelites to escape from Phaorah.\n","29":"\n\nNothing of much importance We are well away from Land & proceeding up the Red Sea. It has now developed into a race between us & the N.Z. Transports, as I understand last into Port has to wait a day in the Stream for wharf accommodation.\n\nWe passed a Hospital Ship to-day bound for Australia. The band played Patriotic Airs & we watched silently & wonderingly & also sadly. A few of us no doubt wondered if we were destined to make the trip in that style of boat.\n\nThis afternoon at 5 pm we again came in sight of land which turned out to be the Egyptian Coast & at Sunset looked very weird & beautiful with its high sandy cliffs\n","30":"\n\nWe are again out of sight of land & doing 14 knots per hour. We passed a Light House this morning right in the middle of the Sea, (10.30 am) It must be a very lonely place for the keeper. It was of interest to us as Port Suez is only 320 miles (or 24 hours steam from it\n\nAnother Hospital Ship passed within 300 yards of us & we again \"fell in\" & cheered them as they passed. The New Zealand Transports have caught us up & I am afraid are going to beat us in. We just heard that our boat is to be quarinetined on arrival, so we are very down hearted. We have an epidemic of Mumps on board.\n","31":"\n\nAt 1 am this morning we entered The Gulf of Suez, & never before have I seen anything so pretty. The Water was wonderfully calm & the Hills on either side looked magnificent. It is just the Same Picture that one sees in the Biblical Stories. In the distance you could see the Trains going over the Hills. When we got up the Stream you could see about 40\n\nTransports already there. We dropped anchor in the Stream at 1.30 pm & then began a scene that will always remain impressed on my mind. We anchored alongside 10 other Transports & each one gave us a rousing reception. You could hear the Coo’ees going for fully an hour, & which sounded very strange in an Egyptian Harbour.\n\nThe Canal is about ½ a mile from where we lie & is guarded by a fleet of 6 War Ships & some further up in the wide parts.\n\nThe Egyptian’s are sailing round & round us in their little Sailing boats begging for pennies & bai jove they can cadge. All the fellows are throwing them money to see them dive after them.\n\nFrom where we lay you can see the Town of Suez & it has some wonderful buildings in it of which I will speak later on when I see them closer. \n\nIt is strange to see the boats coming through the Canal. Not being able to see the water you would think that the Boats were sailing through land. We have the Yellow Flag flying (fever) but as yet I don’t know whether we are to be quarinetined. The \"Ceramic\"\n\nhas been in for 4 days & is still unloading. We have just heard that the Turks have reached the \"Persian Gulf\" & that we may be ordered to proceed there. if such is the case we will soon be in the thick of it. As one must remember that it is only 60 miles from the Canal. \n\n The Police are chasing the Natives away from the boat & it is very funny to see. It is a lovely place to see & I hope that I will be able to land & inspect it \n\nJust fancy a non-stop run from Melbourne to Suez. One matter of importance, I forgot to mention & that is I saw a \nGirl\n for the first time for (1 month) \n\nHows that Umpire. \n\n It happened this way. A Boat Load of wounded Soldiers came round us & there were several Nurses aboard. You can bet they got some cheers.\n\nlater\n\nWe are still at anchor & likely to be so for a few days. The Harbour looks beautiful at Night with the different Transports & Warships all lighted up. \n\n On one side is the Town Ship & Piers, Railway etc, The other side is barren with the exception of a few quarries, to which a\n\nsmall Railway runs. We have just heard a startling piece of news, it is that Servia is crushed & that the Turks are advancing on the Canal. \n\nThe Warships have been signalling like fury to one another, so it may mean a move earlier than we expect.\n\nThe main town of \"Suez\" is about 1 & ¾ mile from the Port & which can be reached for the Sum of 1½ d return.\n\nThe following is a diagram of the Harbour & town as far as can be seen through glasses. The Building are very fine, built mostly with Concrete. Some of which are 6 & 7 storeys high.\n\n Canal all entrenched & garrisoned by British & Indian Troops\n\nAny place of interest I will endeavour to sketch. I feel now that we are within the War area.\n","32":"\n\nWe are still at Anchor & likely to be so for a while.\n\nI saw this morning one of the prettiest sunrises I have ever witnessed, it seems to be a regular thing in these parts. \n\nOne of the N.Z. Transports has gone over to the wharf & is unloading Troops & baggage now. \n\nAn Indian Transport came in last night, loaded with Troops, & is at anchor not far from us. There seems to be something \"doing\" up the Canal as 3 Warships went up this morning.\n\nThe \"Natives\" are all round this Boat selling things & it is funny to see our Chaps take them in. They want Sixpence for a Newspaper, but some of the boys give them a Ha’penny, snatch the Paper & run.\n\n We held Church Service on board & it sounded very well on the Harbour. We seem to be the only Boat with a Band on Board. \n\nSome of the Egyptians are the biggest thieves unhung, it is just as well that they wont let them all come on board. \n\nThis afternoon the Boys knocked one of the Egyptians over as he was carrying a bag of oranges on board\n\n& you should have seen the scramble & all the time he was crying. It is remarkable how close their tears are.\n\nThe ships alongside us, which are preparing to go through the Canal, are all getting rigged up with sandbags, so it certainly looks like trouble. \n\n The troops in Cairo & District are holding Sports & to see the various places is just like a \nhugh\n huge holiday crowd. At present there are approximately 280,000 Troops in Camp English & Australians & 100,000 Indian Troops guarding the Canal. \n\nIt is full moon here to-night & looks beautiful. The Sun Sets at 5 pm & does not rise till 6 am. So they are all short days. \n\n I am sorry to say the 1st death of the voyage took place to-day, the body being removed to the Shore. \n\n Lord Kitchener is at present in Cairo & is shaking things up considerably. \n\nTo-night the Indian Transport, which has been laying near us & is crowded with troops, suddenly weighed anchor, turned round & steered back towards the Red Sea. What it means I am unable to say.\n\nThe Transports are continually arriving. There are now 19 in the harbour alongside us & more coming in.\n","33":"\n\nVery busy day & still on board. We disembark to-morrow morning & are getting everything up from the holds in readiness. Purchased a few sets of views of \"Suez\", which I will send on. Expect to be in at Pier at 6.30pm. \n\n Tomorrow, our Campaign Starts.\n","34":"\n\nLeft the boat at 9 am & put my feet on Egyptian Soil for an indefinite period. We had a very busy day & finally got away by 6 pm. We have & loaded train of 20 carriages & are now on our way to Cairo. It is extremely interesting to watch the various views as you go along. All the route is guarded by Indian Troops who cheer like mad. The Carriages are the funniest things in creation.\n\nWe expect to arrive in Cairo at 2.30 am in the morning. You only pass small townships on the way, all the rest is Desert except for the \"oasis’s\" on the way. The Native quarters are absolutely filthy &\n\ncan be smelt a mile off. \n\nThe Indian Soldiers are very popular with our fellows & seem to me to be all gentlemen. Very civil & they all want to shake hands with you. \n\n The Railway Trip is very exciting right throughout the whole journey. As you pull into a Station you are besieged with Arabs selling fruit etc, & all crying for ‘Backsheesh’.\n\nWe arrived at \"Zestoon\" at 2.45 am in the morning & marched out to Heliopolis Camp. There are 500,000 Troops hereabouts. \n\nThe Australian Forces have been withdrawn from Anzac & are now at (Ismalia) 40 miles out. \n\nThey are in contact with the Turks & there area tremendous lot of casualties. \n\nWe camped on the ground for the balance of the morning & then started a hard mornings work.\n","35":"\n\nHad a hard days work in shifting the Companys equipment etc. on very little to eat. Active Service Rations 1 lb Bully Beef & 1 lb Biscuits. \n\nVisited Luna Park Heliopolis, & several other places, all of which were very interesting.\n\nThey are very strange people & one has to be very careful. \n\nThe Buildings, Trains, Trams etc are very nice & I think preferable to Sydney. Visited Cairo & was very impressed with everything I saw. \n\nIt is the filthiest City in Creation. That is the Native Quarters, of course the City itself is just beautiful.\n","36":"\n\nVisited Cairo & Suburbs again & part of the Nile. Called on & had a good time. \n\nTook a Motor Car in the afternoon & did a few hundred miles of country\n","37":"\n\nChristmas Eve\n\nEverything was in an uproar. Fancy 500,000 men all making a noise at the same time. Richard obtained leave & went into Cairo & visited a few more places.\n\nYou never saw the like in your life, of Course every second Soldier was drunk & what with them, & the natives shouting out \nVerie Good Christmas\n \nVerrie nice Christmas\n (of course for a Piastre) it was a sight that one will never forget. \n\nI arrived home at 10 & wondered what you were doing on your side \n","38":"\n\nChristmas Day\n\nI again obtained leave & made another inspection of Cairo, including Zeetoun, Old Cairo, including Heliopolis Wazro & some more the names of which I forget. \n\nThe people were dressed fit to kill & were all driving about in their (Garshee’s) Carriage & pair. All lovely Arab Horses. That is of course the wealthy people. I had dinner at \"Saults\" American Marble Bar & then toured round the Drives & Avenues in a Parshee.\n\nThe fellows are still pouring in from Gallipoli & are making things hot in Cairo. They are camping at the Aerodrome Camp Heliopolis where we are. You should see them, all in rags, with long beards, & practically alive with vermin. \n\nThey are very downhearted about leaving the place & do not want to go to the front again, but of course they will have to. \n\nTo-day we heard a bit of bad news, it was to the effect that one of our Companys were ambushed & annihilated.\n\nWe have got to watch the Natives very closely as some of the Arabs were searched & found to be carrying some ammunition about with them. \n\n The Light Horse were ordered out to quell a rising with the bedouins. \n\nArrived home at 10 pm & went to bed. Have a very bad cold & fancy I am getting influenza. A lot of our fellows very bad. It is caused by the exceptionally cold weather at night. It is much colder than Sydney.\n","39":"\n\nNothing of any note took place. \n\nMonday ","40":"\n\nHad the Day off & spent the most enjoyable time since arriving here. \n\n I & 2 Sgts, whose photos you will have, hired a (Garshee) for the day, & went out to the Pyramids. I have often seen them on cards etc, but I never fully realised what they were like until now. The drive there is most beautiful, through long Avenues with Trees on each side, & strange to say beautifully laid out gardens\n\non either side. but this is where Lord Kitchener organised the Irrigation Scheme. The Drive beggars description. Gorgeous Motor cars & carriages thronged the road, but we passed a good few, as we had a nice pair of Arab horses in. On arrival at Mena House we left the carriage & proceeded on foot to the base of the pyramids. You could not realise what they are to look at. Huge masses of Stone, & the Egyptian Gov. have cut away portions of the edges & you can climb right up to the top, but it takes you a day to do it.\n\ndimensions of Cheops Pyramid which is the largest one \n\nYou can see the quarries in the distance that they dug the Stone from, & it is about 5 miles from where they were built. It is across the Nile & it is marvellous how they got them across, but \"Cheops\" alone took over 100 years to build. You can still see the pits alongside the walls where they mixed the cement. imagine several pits cut out of solid rock, about 150 ft long 50 ft deep & 50 ft wide. So you can bet they used some cement on the job\n\nThere are 9 pyramids in one group & 5 a few miles away. Cheops is the biggest. I went inside & got down to the Kings & Queens Tomb, but it is too eerie & stinks so did not pay too much attention. Before you go in they make you take your boots off as it is supposed to be sacred to them. \n\nWe next visited the Tomb of \"Phaorah\" but the \"Mummies\" have been removed to the Museum, which I will visit later on. \n\n There is about an acre of Tombs here some of which contain Mummies. There is also an ancient Egyptian City close by supposed to be haunted, so they do not live in it.\n\nThe next thing seen is the Pits, where they put the insides of the corpses when they embalmed them. This about 150 ft deep & 20 ft square, cut out of solid rock. We next went to the (Sphinx) which is a wonderful piece of work. It is a solid hill of rock cut away to the Shape of a Mans head on a lions body. This is Sacred to the Arabs who give the following account of it. \n\n\"When this was built\n\nit was with the object of creating a Gift to (Allah). At the time of its completion there was a drought in the land & one day on going down to put the final polish to its head, they found a hole there, & full of water. They maintain that this was put there by the Devil to tempt them & are afraid to go near it. \n\nI saw the hole (it is about 10ft square by 20 ft deep so you can imagine the size of the Sphinx the body is about 200 ft long & 80 ft high. \n\nWe next visited the underground Temple which is a marvellous piece of work, it is built of Solid granite piers. Where they got them goodness only knows.\n\nLooking across the Valley of the Nile you can see the old Egyptian Cemetery & on the Hill the hole where the Lions used to come out of & devour the people.\n\nLots of people went in but we did not go as it was a bit too far. \n\nWe next drove back to the Nile & had a look round there & finally returned to Camp after a very enjoyable time. I might also mention that we had Camel & donkey rides, & had our photos taken\n\nLions Den\n","41":"\n\n(letters) Received my first few letters & I can tell you they were a treat. We moved Camp to-day & consequently have been very busy. Never in my life have I seen such enthusiasm as was displayed by the boys when they got their mail, but some poor beggars never got any.\n","42":" to","43":"\n\nHave been very busy & consequently have not had any time to write anything. Anyway it has been all routine work which would not have interested anyone.\n","44":"\n\nI obtained the Day off & in the morning hired a Gahrie & drove out to the Citadel. I will explain the different Mosques in detail.\n\nThe first one visited is called the Citadel & is built on the side of a huge hill overlooking Old Cairo, or as it was then called by the Mamelukes (Salem). This is the most wonderful building I have ever seen & was built by Saladin who was Sultan at that time. Just before this there was some trouble & the Mamelukes threatened the Sultans life. Hearing\n\nthis he invited all the Mameluke Notables to a feast & poisoned them all. The people were very angry & to appease their anger he built this Mosque out of his own purse. After you come in the gates you pass through the old Citadel & mosque, which Napoleon bombarded & razed to the ground; you come to the big mosque which escaped gun fire. You enter doors about 20 ft square & 6 ft thick built of studded iron & bronze into the courtyard. In the courtyard is a big marble fountain in which all Moslems must wash their hands & face before entering the Mosque. There is a tall spire at the top of which is a clock presented to the Sultan by King Louis of France.\n\n There is also a well 320 ft in depth from which they draw water for the Mosque. There are inscriptions in the wall written by \"Josephs’ Brother. The Courtyard is paved with Solid Slabs of Marble brought down from the Blue Nile 530 miles. On entering the yard the Europeans are forced to put on slippers over their boots, & the natives take theirs off. When you go in the\n\ndoor a view of magnificence presents itself. \n\nThe Minarettes are 420 ft high & a priest climbs up & down every day to call the people to prayer. The Sultans Tomb is in one corner barred off & the cover of the Tomb alone cost £40,000. The height of the various domes are 300ft high & there are balconies running right throughout the whole Ceiling. The Ceiling is lead picked out with Gold paint & it looks glorious. Hanging from the ceiling there are myriads of Chandeliers each one being lighted up \nevery 3\n 3 times a Year.\n\nThe walls are built of solid alabaster & you can see right through them when the sun shines. \n\nThere is a large chandelier in the centre, presented by King Louis of France & weighing 3 tons. All most beautifully cut. \n\nThe floor is covered with lovely carpets, which have been there hundreds of Years & are just as good as new. \n\nAfter this I went into the ruins of the old Mosque which Napoleon despoiled & climbed up to the top of a tower from which one can see the whole of Cairo.\n\nWe then went to the\n\nBlue Mosque & Saw Service being conducted according to the Koran religion. This is noted for its Marvellous Tile-work, the whole interior being lined with tiles which cost fabulous prices & are all a pale blue worked out in various designs. We then visited another Mosque which Napoleon bombarded & saw the wonderful Golden Gates. These gates are about 100 ft high & 40 ft wide & are studded with Gold, Silver & bronze. When Napoleon took the town he had one sent to Paris & it is now in the French Museum. Each gate is worth roughly £400000 & guarded by men & enclosed within Steel Bars. These guard the Sultans tomb.\n\nEvery Mosque in Egypt is built over a Tomb of an ex Sultan. \n\n I then came over to Heliopolis & met Cpl C R Palmer & visited Gezirich Island where the Zoo is situated, had Afternoon Tea & went to Ezbekieh Gardens. We then went to Church in Kasr-el-Nil & finally returned to camp after a heavy but interesting day\n","45":"\n\nA very cold day. It rained hard & the water was like ice. Never went out of camp so nothing of any importance to write about.\n","46":"\n\nHad a busy time all day in Camp & obtained leave to go to Cairo at 4 pm. \n\nWent in by Electric Tram & went to (The Petrograd) for Dinner. \n\nAfter this we endeavoured to obtain Tickets for the \"Kursal’ but it was full up. \n\nWe then hired a carriage (Gahrie) & drove to the Copts Bazaar This is a place similar to the Egyptian Bazaar, but run mainly for the Copt Sect. This is even more crowded than the Egyptian Bazaar & there is only room enough for 1 Carriage in the Streets at a time. \n\nWe purchased an oil Lamp for the Tent & drove back to Heliopolis Tram Terminus & caught a tram back again. \n\nArrived Camp 9 pm & went to Bed. \n\nWeather very cold, in fact it is almost freezing & I think it far worse than any cold ever I have felt elsewhere.\n","47":"\n\nAnother cold day, with a\n\nwind that would cut you in two. Played Cricket & in consequence of same am feeling very stiff. Was disappointed again to-day there being no mail for me. This is the fourth day but hope to get some to-morrow. \n\nTo-day I witnessed a Strange burial system viz – the funeral rites of a Native. \n\n First of all they dig a hole underneath a big Cement tomb. The whole village turn out & march in the front of the Corpse. \n\nThe undertakers then come along carrying the corpse in a kind of box fixed onto 2 long shafts which the Natives carry on their shoulders. The Corpse is wrapped in a kind of Cheese Cloth & then put in the hearse. When they reach the grave side they take the Corpse out, wash the face, close the Cloth Cover up & put it straight into the grave. This is then covered up & the Cortege moves away. There is no religious ceremony of any kind. \n\n Every kind of animal turns out to a funeral, from a Camel, Donkey, etc. to a Mule. Turning in now for a sleep.\n\nReinforce Coy at Matariah \n","48":"\n\nThis has been the most miserable day I have ever felt, there being a cold break wind blowing in from the Sea, which seems to cut one like a knife. \n\n The Fire holes collapsed last night & in consequence of same have had to wait until 10 am for Breakfast. \n\nThe weather is playing up with our men. 19 went to Hospital & 1 was carried away late last night very bad. \n\nNo mail again to-day & am wondering when I am going to get some.\n","49":"\n\nThe famous 17, 18, 19, &","50":" Battalions marched into camp to-day, I believe they are here for a rest. Some of them do not number 20 of their original strength, although of course they have made them up from reinforcements. Aeroplanes have been flying overhead all day, So, I suppose something is doing. \n\nWe played an Infantry Cricket Team this afternoon & won. The Scores were 25th Infantry 11 wickets 75 runs 20th A S Corps 6 wickets 157 runs\n","51":"\n\nI stayed in Camp all day to enable the W.O. to take an all day trip to the Barage. Uncle Charlie came down to my tent to-day & we had a long talk.\n\nTo-day I heard unofficially that we were to train so as to be sent to France, but will find out the truth later on.\n\nThe Turks have been sighted within 12 miles of our advanced posts again to-day but they do not seem anxious to attack. \n\n I will review our position as far as I know it.\n\nWe have been here a fortnight & are not yet recognised as a Unit. I have also heard they are forming a 2nd Australian Division in Egypt for the purpose of sending them to France but I do not quite know the truth yet. We have reverted to our original Corps now viz","52":" as the former 20th have taken up their original Corps the 14th.\n\n10.1.16\n\nTo-day has been an important one as I paid a visit to The Virgin Marys resting place on her flight\n\nto Egypt. I will explain things as they happened. \n\nWe marched out of Camp at 9 am & headed out through Helmieh & Massallia. After marching through Native villages which were very interesting, we approached a beautifully green spot, with all kinds of Trees & schrubs & which looked very unique, situated in the middle of the Desert. We marched in the Gates & after going through groves of Trees gained a thorough sight of the \"Sycamore Fig Tree\" under which The Virgin Mary rested in her flight to Egypt, to escape the massacre decreed by Herod the Great. The Tree in question is over 2000 years old & is still partly green, I obtained a piece of same.\n\nWe next visited The Sacred Well, which is about 100 yards from the Tree. This well is very Deep & is fed from several small springs underneath. This is were the Virgin Mary washed our Lord & as tradition tells, the water which was salt immediately became fresh. \n\n In all there are eleven wells here in this vicinity & this is the only one that is fresh. I had a Cup of the water & it was the most delicious & fragrant water that I have ever\n\ntasted. We next visited the French Catholic Chapel, erected on the top of the Cave where the Sainted party rested & which would take a book to describe.\n\nIt is only a small Chapel but exquisitively built. On the Walls inside are painted the various Scenes, right up from the Massacre of the Children, to the arrival in Egypt\n\nSt Luke 2. Chapter 2. It is most wonderfully painted & quite enthralling to look at. \n\nWe next marched out to the Obelisk which is a Granite Column about 100 ft above & under the ground, & is one solid piece, How they got it there is a perfect marvell to me. one of these obelisks was removed to England & it took several years to move it & had to have a special Boat built to transport it. \n\nThere is only 1 obelisk in all Lower & Middle Egypt, so it is a very old Landmark. It marks the entrance to Old Heliopolis which was once the largest City in the world but is now buried in the Sand brought down by the Nile when in Flood. There is now only a Native mud built native village there.\n\nI have posted you some relics of the different\n\nplaces which you may like to keep.\n\nThings have been quiet this afternoon, but there has been a general murmur right throughout the lines of the situation caused by the large number of Aeroplanes flying in the direction of the Canal. Tomorrow some more Troops march out (2000 NZ) destination unknown.\n\n11.1.16\n\nNothing of any importance never went out. great Aeroplane activity.\n","53":"\n\nSent Parcel of Cushion Covers to you all.\n\nMrs Major Charlton arrived in Heliopolis having come over on the Mooltan.\n\nHeard that there were tons of letters stacked down at Suez & that we will have same in a weeks time.\n\nNo 1 Section played the rest of the Company football this afternoon & ended in a win for the rest by 9 to nil.\n","54":"\n\nA Dull day & Sand storm blowing.\n\nwe played the 7th ASC. Cricket & won by 5 wickets & 20 runs.\n\nStill no mail.\n","55":" & 15th\n\nHave not been out of Camp. Weather very nice.\n\nPlayed the 7th Infantry Battalion Cricket & won easily. \n\nTo-day I had the great pleasure of meeting a few of the old Warren Boys who arrived early this morning having left Sydney on the","56":" They told me a lot of news, also that there had been rioting at The Warren, & several arrests made. I saw Reggie White & had quite a long chat with him. \n\nI also heard that uncalled for\nrumours\n lies had been spread about the City to the effect that The Persic was quarantined with Small Pox etc, & that she had been Sunk.\n\nI received 1 letter to-day, the first for a fortnight & am wondering where the devil all the rest have got to. \n\n I intend visiting an ancient Mameluke City to-morrow & will write an account of same after my visit. Have heard that we will soon be shifted from here\n","57":" 1.16\n\nHad the most interesting & enjoyable day I have had ever since I have been in Egypt.\n\nI got a Motor to Cairo Station from Heliopolis (together with 2 other Sgts) & caught the Sassafra Mail to Bedrasheen. On the way we passed through Embabeh, which is on the Nile & famous for its Battleground where Napoleon met & defeated the Egyptians. The next stop was Boulac- Dacrour, which is the stop for the Avenue or drive to the Pyramids. (Guizeh or Giza) nearest Station to the Giza Group of Pyramids & of which Cheops is the largest in Egypt. Babylon lies on the other side of the River to Giza & is famous for its old Roman Forts.\n\nThe next was Abon-El- Noumros then Tammooh, from which Mahdi can be seen & where the Turkish prisoners are kept then we came to Hawaineia a large Sugar refining district & finally Bedrasheen our destination. We next hired donkeys for the day & started on our ride for the Sakkarah Desert. The first place of interest is the ancient City of Memphis, then comes the Colossal\n\nStatue of Rameses II. You then ride through some irrigated land through the village of Sakkarah & then on to the desert to the Tombs which have been excavated. The Tombs I will not attempt to explain as it would cover too much paper but suffice it to say, that they are most wonderful & I am dumbfounded as to how on earth they were built. \n\nThe Tombs visited were Tomb of Meres, Tomb of Thi, Sakkarah Monastery, Serapeum, Steps Pyramid, Pyramid of Unas, Tomb of Ptah-Hotep, Sphinx of Memphis. All these I have explained to you by letter.\n\nWe finally returned to Cairo by Mail Train, after having spent a very good day. \n\nWe then had dinner at Saults & caught the Electric Train to Heliopolis & turned in very tired.\n\nStill no mail for me.\n","58":"\n\nNot out of Camp. A big mail of Newspapers came in but none for me. \n","59":"\n Saw an Argus sent to DVR A Little, son of\n\nthe Proprietor & saw my Photo in same.\n\nWe also had good cause to complain of a letter put in the Sydney Evening News, referring to the A.S.C. as Alley Slopers Cavalry & that we had not been near the front, & every one here is feeling very indignant that they should print such a fabrication, anyway there is no one here that will buy an Evening News anymore.\n","60":"\n\nNothing of much note. Still no mail & am beginning to give up hope of any. Company have gone out on a big march & consequently have not much to do.\n\nAeroplanes are very active but we can only guess why. Big Battle fought in Mesopotamia ending in a rout of the Turks. War news generally, very good.\n","61":" to","62":"\n\nX Chasing Turks\n\nVery dull days & nothing whatever to write about. \n\n To-day I received a few letters & felt a wee bit disappointed that there were not more.\n\nI got 2 from Bulli 1 frm Father Edna & Mum & also 1 from Nina. Knowing that Nina is what I term a maniac in letter writing I cant quite understand why I do not receive more.\n\nWe played an Infantry Battalion foot-ball to-day & the game ended in a draw neither side scoring. Met Val Heber to-day for a few minutes & he is going to come down later on, R Josephson comes down to my tent regularly every night. I am trying to get him into the Company. \n\n Rather an amusing incident happened to-day. One of our Sgts received a bill from the NSW G Railways for an amount of 5d, same being excess fare. The letter followed him from Tempe to Heliopolis & he ids going to send it over to the Press.\n","63":" &","64":"\n\nHad a visit paid to us of several ASC men who are working down in Tel.El.Kebir.\n\nThe work is hard as there are 126000 troops in this District.\n\nTwo train loads of wounded Australian &\n\nGurkha Troops came in to-day, which means that there must have been a fight down on the Canal. \n\nThere is nothing much of importance to report here, as Heliopolis is very quiet. \n\nTo-night as I sit on my bunk, I think of home & everybody, & wonder when I shall be back again. \n\nThe War does not seem to be near its end, & no one ever thinks of it out here. It is only when one thinks of Everybody they left at home, that you feel lonely & miserable. Such is a Soldiers life.\n","65":"\n\nRained very hard & nearly flooded us all out. A peculiar thing of the storms we get over here, is the rapidity in which they rise & then go away again.\n\nWe purchased a good Piano to-day for the boys (on the hire system) & have placed it in our Mess. They are all over there Singing now & appear as happy as can be. It is a marvel what music can do to brighten up things.\n\nStill not much news of the war. \n\n \n","66":"\n\nToday has been the coldest day I have ever felt. A very keen wind blowing in from the Sea, & rain off & on all day.\n\nWe marched out about 5 miles to Matarieh. Also visited the Aerodrome & saw a few aeroplanes on the ground. \n\nPlayed Cricket & Football in the afternoon to try & get warm, but it was no good. \n\n R Josephson visited me later on in the Evening. \n\n Camel Corps leaving Race-Course Camp for destination unknown.\n","67":"\n\nAnother bleak & cold day but came out sunny in the middle of the Day.\n\nWe marched out to the First observation Post, & saw for the first time, what trench life is like. \n\nImagine acres & acres of Desert all cut up into hundreds of Trenches & all sandbagged in. We went right through the trenches & looked at all the Dug-outs & Bombproof Shelters. \n\nIt is impossible for you to realise how these Trenches are built when you get down in them, it is like a\n\nRabbit Warren. Hundreds of Trenches branching out & running in all directions. After going through the greater part of them & inspecting the Barb wire entanglements, we marched West, across the Desert to the great pumping & Sewerage Station which the British erected, to try & cleanse Cairo, & which needless to say is well guarded.\n\nWe then turned homewards & after a very trying march over the Desert arrived back in Camp very tired. Fancy spending Anniversary Day like this, I wonder how you all spent yours. \n\nThe boys are now making up for it however, by having a Sing Song in the Sergeants Mess. We are also remodelling our Camp which will look very good when finished.\n","68":"\n\nVery cold & raining off & on all day. Strange thing happened to-day. One of our chaps (R Nutt) who was admitted to Hospital Suffering from Concussion of the Brain, & who was Crazy at the time, slipped through the Hospital Guard & returned to Camp.\n\nupon arrival here he did not know any of us & was very bad. We eventually got him back to Hospital where he now is very bad.\n\nHeard pretty definitely that we are to go to France in two months time.\n\nOnly a routine day, never left the lines.\n","69":"\n\nTo-day proved a very good one in the History of our Company. We were reviewed at 2.30 pm by Major General Birdwood. He is indeed a very nice man, & all the troops over here speak very highly of him. He spoke a few words to me & I shall always remember them.\n\nOur fellows received another mail to-day, but as usual none for me. \n\nPlayed Cricket the remainder of the afternoon & this compiled with the fact that we stood at attention for 2 hours, has made me very tired, so intend turning in very early. \n\n I am feeling very rotten on account of not getting any mail, as this is all one has to look forward to over here.\n\n29.1.16\n\nIt has been a fairly warm day & the weather very good.\n\nThe 2nd Light Horse Brigade &","70":" A.S.C. marched out to-day. They are all happy as can be, & glad to be going to something definite, instead of moping about here. Mrs JRC is here to-night & the boys are holding a concert. I am again feeling a little down hearted, as there are no letters for me. \n\nMost of the Sergeants have gone out & I am all alone, so am going to write a few more letters, although I never seem to get an answer.\n","71":"\n\nAttended Church Parade & marched back to Camp. We had only been back (1\/2 hour) when we were ordered to \"Stand by\" fully dressed awaiting orders. This was the order.\n\n\"The G.O.C. advises all Unit Commanders that a big Arabic rising is taking place in Cairo & all ranks to stand to their arms & await orders\"\n\nThey picked a good day for the rising as it is Sunday & therefore there are a lot of men in Cairo unarmed. I do not know as yet how many were killed.\n\nThe Infantry Battalions\n\nare all marching out & are being issued with ammunition as fast as possible.\n\nI never in all my life saw any men so keen for a fight as they are. We don’t know whether it has been quelled yet, but the various units are still marching out. All of them singing & laughing like fury. \n\nIt will be God help the Natives when they reach Cairo. There was a fight outside the Sultans Palace, but we have no further news. Some of our Men & Sergeants are out & I don’t know how they are faring.\n\nOur Postal messenger was chased for a mile, but he got away from them. We have not received any further orders, but our chaps are very keen & want to volunteer to go, but they will not take them yet.\n\nI have been expecting this all along & now that it has come, I am sure if it assumes large proportions our fellows will wipe the Arabic population out of existence. It is very hard to distinguish the Arabs from the poor class of Egyptian, so I suppose they will suffer also, but they are very nearly as bad.\n\nlater\n\nThe riot has ended\n\nthe Arabs being dispersed & hundreds captured by the Native Police who were led by English officers.\n\nOur troops made a demonstration before the people, by marching up & down the Streets with fixed bayonets. There were a few killed but nothing to speak of. After this I can see the natives getting a rough time from our troops, all of whom are bitterly down hearted at not having had the chance of charging them. I am glad however, that they did not, for if they had of I am afraid that Cairo would have run red, so bitter are our troops against this rabble.\n\nlater\n\nAll together there were 80000 troops turned out, so you will judge that had it not been for the promptness with which the Military Authorities judged the moment, it would have led to a fierce battle in Cairo & also throughout Egypt. \n\nThere are 4000 Arab prisoners taken. \n\nThe Light Horse were responsible for checking the rising, as they were on the scene directly it started. \n\nThe first intimation we had of it was as follows – A group of soldiers were walking\n\ndown one of the Streets & they noticed that the Arabs were collecting in Mobs. Some of them then came up to them armed with sticks & stones & called them Australian Bastards. The fight then commenced, but it must be remembered that our soldiers then in Cairo were unarmed (as we do not carry arms when on leave)\n\nI do not know how these fellows got on, but I believe they ran to the Egyptian Barracks & were saved. After this the L.H. appeared on the scene followed by the Infantry.\n","72":"\n\nThe rising is now a thing of the past, but one episode which happened is worth mentioning. \n\n There was a Infantry Picquet of 7 men going down the Kasr El Nil Place at the back of Shepherds, when the Arabs (about 50) made threatening attitudes towards them. The Picquet warned them not to come closer, but they took no heed. The 7 men then put their rifles to their shoulders, pressed the triggers & there were 7 dead Arabs in a second. The rest took fright & ran.\n\nThe 15th ASC embarked for Marsailles to-day, so we are conjecturing when our time will come.\n\nNothing else of any importance transpired so will set to & write some letters\n","73":"\n\nHad a very busy day numbering & fixing harness in order to be ready to meet \nall\n anything that may come along. \n\nOscar Josephson came along to see me to-day & I was very pleased to see him. Rupert Josephsons Regiment moves down to Tel-el-Kebir to-morrow so I will have to say good bye to him which I hate to have to do, as it may prove impossible to get him transferred to this Company.\n\nI am going into Cairo to-morrow night with O.J. & will have a good time as it is the first time I have \nnot\n been in for some time.\n","74":"\n\nWent into Cairo & had a nice evening. Heard that the Persic was rumoured in Sydney to have been sunk. If I do not soon get some Letters I will send another Cable. \n\n I returned to camp with R Josephson & Oscar Josephson at 10 pm & had some trouble with a man on Guard (Allen.) I had to put him in the Motor Car, take him to the Dr in the 5th Training Bat..\n\n& then into Heliopolis A.G.H. Arrived back at 11-30 pm & turned in very tired.\n","75":"\n\nHad rifles issued to the whole Company & have been doing Rifle Drill all day & in consequence of same am feeling far from lively.\n\nStill no mail for me & am getting sick & tired of waiting for some.\n\nFor reference sake I put the following item down.\n\nHad said\n \"Through no fault of mine I was to-day severely admonished in front of several of the rank & file during the episode several obscene words were used which I objected to. I made enquiries \nre being\n seeking redress, & was told that I had a strong case, but probably on account of rank I would be the sufferer. But I was told to keep this matter in memory for any future happenings of the same kind.\n\nWitness SQMS –\n\nAll this happened on the 2\/2\/16\n\nLine blocked from Port Said do not know cause.\n","76":"\n\nAnother hard days Rifle Drill with route march in the afternoon.\n\nNext week we all have to go through a Military Musketry Course, so we are all training hard so as to pass well. \n\nLectured No 3 Section on Care & Cleaning of Arms.\n\nHeard from Capt Saunders D.A.C. that a battle took place yesterday at Ishmalia & that the troops at Tel-el-Kebir are being pushed further down. Do not know exact results as yet. \n\n Large number of troops leaving here for Canal Zone.\n\nThe Piano is now playing Darling I am growing old, Silver threads among the Gold etc. & it makes one think of Home Sweet-Home. \n\n Still no signs of any mail for me.\n","77":"\n\nHeld full marching order inspection & had a march past & were complimented on our fine showing. We heard that General Irvine is going to inspect us next week.\n\nHad Photo taken of the whole Company also separate one of the NCOs’ & officers.\n\nWe played the 20th Battalion Cricket this afternoon & it resulted\n\nin another win for us. Final Scores 20th Batt. 60 all out. 20th A.S.C. 115 all out.\n\nI carried my bat out for 5 runs, but went in 8th place so did not have much of an opportunity. \n\nStill no mail for us but we heard that there are some for us brought over by The Omrah, but we cannot trace them.\n\nI am all alone to-night as they have all gone into Cairo. Raining here & I think it will keep it up all night.\n\nSeveral more Transports have arrived at Suez & the Troops will be sent on here in a day or so.\n","78":"\n\nSunday, usually a day of rest but for us a good hard days work. \n\nPlayed Cricket in the afternoon & am feeling pretty crook. Have a sore throat & Head ache but am taking a stiff dose of Medicine in the morning. \n\nThe 1st Coy A.A.S.C. marched in to-day from Mersa Matrua & is situated alongside us. The 2nd Coy marches in to-morrow. They have had a pretty strenuous time with the Bedouins & have earned a good rest.\n\nToday I heard that promotion was near for me, in as much that I am to be appointed a Warrant Officer in a short time. After this I don’t think I will have to wait long before I gain my Commission. I will Cable when this takes effect. \n\nStill no mail.\n\nI also heard that we are to be The Head Qrts Coy 3rd Div. So I suppose it will alter address considerably. \n\nThere is nothing much doing here to-day, so will wind up.\n","79":"\n\nVery quiet & ordinary day with nothing of any importance happening. W.O. in trouble with Major. But everything eventually patched up. Have felt sick all day but am very much better to-night. Days work consisted of Rifle Drill & route march in the evening. \n\n Held Concert to-night & there were some very good items rendered. \n\n Special lookout being kept for Niggers. Had a few kit bags stolen, so poor beggars have lost all their belongings\n","80":"\n\nHad a very busy day\n\nin writing up the paper strength of Company, preparatory to making them Sections of Duty. \n\n Played Cricket from 4 pm to 5 pm. Nothing of much importance occurring.\n\nStill no mail. This is beginning to be a matter of indifference now. \n\nHave shaken my temporary ill health off & am again feeling as right as rain.\n","81":"\n\nHad another day on Musketry instruction & to-morrow we all go to the Range at Abbassia for a 3 days course.\n\nHave felt decidedly Happy to-night as a mail came in & I benefited to the extent of about 14 letters. I can tell you I read & re-read them all, & am looking forward to the time of answering each individual sentence of them.\n\nAm going to bed early to-night on account of having a tiring day to-morrow.\n","82":"\n\nLeft here at 8 am & had a very exhausting march over the Desert.\n\nThe sun was sweltering hot & the mirage on the Desert was very trying to the eyes. \n\nWe arrived at the Ranges after an hours march & immediately got to business. I scored a fair average, but nothing to speak of. I hope to do better tomorrow as my eye is now in.\n\nIt was very inspiring to hear the thousands of bullets all rattling over the Desert & one naturally wondered how on earth any force of men could possibly charge up in the face of such an awful curtain of bullets. \n\nI am going out again to-morrow, but I feel far from fit as I am very tired.\n","83":" \nThursday\n Friday\n\nAnother hard day at the range & returned very tired. Have just been ordered to go out for another 6 days & am quite faint about it as two days has played the devil with me. I am sure I will be deaf when it is all over.\n\nI have seen in orders that the Osterley has arrived with some Artillery so am wondering whether Jack is among them. Will make enquiries on Sunday.\n","84":" \nFriday\n Saturday\n\nFinished off another day on\n\nthe range & returned to camp fairly knocked out after 3 consecutive days, so intend to rest to-morrow. \n\nOur Side had another Victory to-day in Cricket making our 7th win. We have not yet been beaten so we hold an imperishable record so far.\n","85":"\n\nlater \nx.\n\nI have had a very interesting talk to a Sergeant visitor who has been down on the Suez Canal Defences & I will endeavour to explain same so as to have it by for reference later on. \n\nThe Canal is divided into 3 sections & is defended by 750,000 Troops as follows.\n\nLeft Flank - Port Said to Stn - English Troops\n\nCentre – Australian & N Zealanders\n\nRight Flank – Ishmalia to Suez – Gurkhas & Sikhs\n\nI will now try & record some of the points which I have picked up.\n\nOn the Turkish side of the \n\nCanal & about 6 miles out is a range of Sand Hills which our troops have converted into a veritable maze of Trenches & Big Gun positions. The Guns have a range of from 3 to 12 miles & are so placed that they can sweep the desert at any point. \n\nRunning out from the canal are several light railways used for carrying stores etc out to the Trenches. One of these railways alone has now carried out over 3,000,000 Sand Bags to line the sides of the Trenches. \n\nArranged systematically along the Canal are Barbed wire entanglements & Blockhouses for machine Guns. \n\nThere are also 3 Monitors at the Stations on the Canal mounted with 15 inch Guns. The Ibis, Isis & another whose name I dont know. Independent of this there is also a fleet constantly patrolling up & down the Canal.\n\nThe water is now laid on to a distance of 4 miles on the desert side of Canal, so our troops are sure of a copious water supply. \n\nThey are very strict down there & one cannot venture out of their tent at night without being fired at by Sentries.\n\nThe other day some of our Bedouin Spies reported that there\n\nwere 3 Turkish Spies in our position, so late at night they got about 1000 Camels & tied Baulks of Timber to them & swept the loose sand clear & then waited. Sure enough the morning showed the foot prints of these spies & they were eventually caught.\n\nThe Gurkhas are Constantly going out & bringing in Turkish prisoners. How they manage to catch them is a big mystery to everyone. \n\nOne day a party of 80 Turks suddenly appeared at an undefended portion of the defence works & after having a careful look round returned, unfortunately for them some Gurkhas & Sikhs sighted them And - \nThey did not bring back any prisoners\n\nOn all the trips of these trains you always see a couple of trucks loaded with steel rails out in front of the Engine. This is to deaden the effect of a possible charge of Dynamite being placed there. \n\nSome facts which the Sydney people do not know –\n\nThat the Persic was carrying 5000 Machine Guns & their ammunition when sunk. \n\nThat another Boat sunk was carrying a full cargo of Water pipes for the Canal defences. \n\nThat another Boat was ordered to hand over a certain sum\n\nof money which she was carrying & the enemy named the correct amount.\n\nThat all these Boats which are sunk are all well worth sinking, that is to say they are all carrying Cargos which are well known to the Enemy\n\n13.2.16\n\nAttended Church Parade this morning & have spent the rest of the day having what I call a well earned rest. \n\nUncle Charlie called on me this afternoon & I have promised to visit him at the latter end of the week.\n\nThere is a big movement of troops on. All the 5th Training Battalion are going down to The Persian Gulf. \n\nPersonally I think that the British intend striking at the Turks in this direction, anyway whatever they do, I think the Australians are destined to play a very important part in it. \n\nIn all probability we will be fixed up this week, & then off we go to the front Turkish Hip Hip Hurrah.\n","86":"\n\nSpent another hard day at the range in very windy & trying Weather.\n\nI shaved\n\nmy moustache off & have now got sore lips for my trouble. Such is life.\n\nI saw an Argus to day dated 4\/1\/16 & was very interested in it, as this is the latest dated paper I have seen. \n\nAm feeling pretty tired on it & am turning in very early.\n\nLots of troops going out presumably to the Persian Gulf. I was working in the Butts to-day & the way the Bullets zip through makes one think of what it would be like under actual fire.\n\nI note by the Argus that L Blomfield is sick in Hospital. \n\nVery windy & cold to-night.\n","87":"\n\nHad a very exciting night of it to-night viz – I met the old & original Jack Rolfe. He told me many funny things & is still as talkative as ever. He also has a Moustache & looks for all the world like a Spanish Brigand. \n\nHe told me that all were well when he left home & I am very thankful. We had a great talk of olden times & are going to continue it to-morrow night.\n\nRaining all day & pretty cold.\n","88":"\n\nFinished up at the Range to-day & through a mistake made on the mounds I & all the markers were nearly shot down. The men started volley firing without orders from 500 yards range, before we were ready & we could only sit down & huddle up to the wall of the Trench until we got a spell so as to get our Flag & wave it. \n\nome shots went through the framework & twisted Iron Bolts about, just as if they were paper. I am saving one which was burst away about 1 ft from where I was. However I managed to get the flag up & demanded an explanation which I have since received.\n\nThe old Jack is coming down again to-night & his quaint sayings are quite refreshing to my ears. I am trying to arrange for a day off so as to take him about a little. \n\nWill finish this now so as to write a further paragraph in your letter.\n","89":"\n\nWent out on a route march to-day & enjoyed it after putting in a week\n\non Musketry work. Cold wind blowing to-day.\n\nHave just heard some very bad news to the effect that General Townsends Force in Mesopotamia has had to surrender unconditionally. We heard previously that he was surrounded & his troops starving, but that another army was marching to his assistance, but it evidently did not get there in time. We are awaiting confirmation of this. \n\nFurther large forces are marching in & everything is astir. \n\nTheir is something doing with these forces, but what it is we do not know.\n\nI am expecting Jack any minute now.\n","90":"\n\nSpent the day in drill movements etc & also went over to have a look at a gigantic Camel Corps which is Camped near us. It is a marvellous sight to see about 80,000 Camels in long lines all tended by Arabs & Natives with a sprinkling of white men here & there. \n\nThese Corps are being sent down to Skirmish on the Canal & Western Front. \n\nThere was a very bad\n\naccident occurred near us to-day & it was this. \n\nA party of officers & N.C.O.S were being instructed in Bomb throwing from one of the trenches here. \n\nThe Warrant Officer & SMajor fitted the Bomb to the thrower & were instructing on it, and then went to fire it as a demonstration, when something went wrong & the Bomb exploded. \n\n4 officers were very badly wounded & the W.O. & C.S.M were killed. \n\nThe former had his head almost blown off & the latter was practically disembowelled. \n\nIt cast a gloom over the whole Hospital (No1) when they were brought in.\n\nI was up there visiting Uncle Charlie when they were brought in & he was one of the Drs who attended them.\n\nThere is still some fighting at Matruah & it is gradually assuming larger proportions. \n\n There are many things going on there which the people will never know. \n\nFor instance as our Troops advance into the Senussi Villages the women folk cut their childrens throats & then kill themselves.\n","91":"\n\nFinished drill by 12 & had dinner & then\n\nwent to sleep until 4 pm being awakened by J Rolfe who as usual always puts his nose in & disturbs well earned slumber.\n\nThere is a letter in to-days orders from General Birdwood, asking us to maintain our discipline, which he says is very scarce in the Australian Armies although they are excellent fighters.\n\nI received 3 more letters from Dear old Nina & was very pleased I seem to be getting plenty of letters now.\n","92":" 2.16 Sunday\n\nI had a pretty exciting night of it with very little sleep. It appears that something went wrong with the inner workings of the Company & the O.C. came home in a hell of a rage.\n\nI had to work on a subject which took from 8 pm Saturday night to 2.30 am Sunday morning. During this time we had a rally at 12 midnight & turned the whole Company out in full marching order. \n\n I turned in at 3 am & got up at 6.30 & started on my visit to Sakkarah with Jack & his friends. \n\nTo describe the visit would take too long, but\n\nit was the funniest trip on record.\n\nYou should have seen Jack going for the nick of his life on a Donkey all day. Such expressions as \"If they could only see us at home now\" & many others alluding to Home people were very frequent & tended to make the day enjoyable. \n\nWe caught the 4.30 pm train home, had Tea in Heliopolis & arrived back very tired.\n","93":" &","94":"\n\nTwo days of ordinary routine work. Our O.C. went down to Head Quarters at Ishmalia to see what is to become of our Company & rumour has it that we are to stay in Heliopolis for another 3 months. I would sooner be here, than down there as the whole place is alive with Lice & there is very little water to have a decent wash.\n\nI went into Cairo with Jack & his friends & drove through the various Bazaars. Jack purchased a Fez & of course is mad to wear the thing. I bought a couple of hand bags which I will send to-day.\n","95":" & 24.2.16 Thursday\n\nNothing of much interest in the last few days. I am patiently awaiting orders from HeadQrs as to the re-distribution of the Company. \n\nWhat I have heard up to date is that a certain percentage of the Company is to be sent to Alexandria, the rest remaining here. I have to remain with the rest.\n\nMajor Gen Cox has command of our Division & will prove a good man.\n\nI am very sorry that we have to split our Company as we are all well known to one another.\n\n25.2.16 Friday\n\nThe change in our Company has now been effected & in consequence of same we will now loose half our men.\n\nThis is very sickening for us all, as we have been like brothers right from the jump.\n\nHalf our men go to Alexandria to form part of the 10th A.S.C. Hd Qrs. 5 Div Train, whilst the rest go to Helmieh to form the 14th Hd Qrs Coy, 4th Div Train. I remain with the later & the W.O. goes with the former. It may or may not mean promotion for me.\n\nI stayed up working until ½ past 2 this morning in arranging which men were to go. It was made\n\nknown to the men on this mornings early parade & great was the astonishment when it was given out, as it was the last thing expected & in many cases friends of long standing were parted. I managed to keep Cousins, Hayne & a few more of my own friends.\n\nThe rest of the Company, that is the","96":" have to shift out as soon as the Alexandria crowd leave. This is a further injustice, as we have now got our Camp looking A.1. & I suppose when we arrive at Helmieh we will find it filthy. \n\nI received 2 letters to-day, 1 from Mum & Edna & 1 from Nina, but am afraid that it will be some time before I am able to write.\n","97":"\n\nEverything here is in a bustle preparatory to half our fellows moving out to Alexandria. \n\nWe played the","98":" Coy Cricket & had another win.\n\nAt last my certificate has been sent along to qualify me for a Commission & I am anxiously awaiting further developments.\n\nI anticipate a very pained feeling to-morrow as our Company is to part. Hard luck but duty is duty\n","99":"\n\nAttended Church Parade this morning & am spending the rest of the day lounging about. \n\nThe weather is frightfully hot & seems to strike right through the Tent.\n\nTo-morrow our Fellow Comrades in Arms leave us & to this end we are holding a rather convivial kind of party to-night tendered to the W.O. & 6 Sergeants who are going with the men. I suppose it will last until the early hours of the morning so I am going to have a snooze now.\n\nFierce fighting is proceeding in France. Ammunition Ship blown up in Port-Said.\n","100":"\n\nWe had our beano last night & I have a very sore head to-day through same. They are all departing to-day & are having their last meal in the old camp to-day.\n\nIt is hard to part with them, as I have trained them all to the best of my ability & am proud of them.\n\nLieut Brigden called on me today from Ferry Post on the canal where he is situated. To-day we heard that 13 Transports left Suez bound for the Persian Gulf & all loaded with troops. This means that there will soon be something doing\n\nin Mesopotamia & it is what I have been expecting for a long while.\n\nI was speaking to a Lieut that went through the German East Africa Campaign & he astonished me with some of his stories. \n\nFancy being out in the burning desert, with only a very limited supply of water. He says that the sun is so hot that you cannot drink in the middle of the day, as it makes you sick & the effects kill you. \n\n Men drop by the side of the Road & mutely ask for water from those who have little, but these only look the other way as it means their very life. \n\nHe says that every mans lips swell up to double the size & that they get great blisters on the tongue & roof of the mouth. Your head also seems as if it will burst. Such is the desert life which abounds over here. If we go to Mesopotamia I suppose we can expect the same privations.\n","101":"\n\nThe ½ of our Company has now gone & it caused many a pang to see them march out, for it may be considered that we will probably never \n\nagain as I explained before, the various Divisions will probably be sent to different places.\n\nThere is something very big on as troops have been coming in & going out all day & night. I think that this year will, in all probability see the end of the war, as the Germans & Austrians are now becoming desperate & the Turks are literally speaking on their last legs, & don’t forget, england still has about 1,000,000 fresh troops still concentrated here in Egypt, ready to be sent to any front.\n\nIt is fairly cold here to-day with a bleak wind blowing\n","102":" \n\nTo-day brought news that we have to shift Camp to a place called Luna Park. But I do not think we go until Friday.\n\nJack called & said he thought they were to go to Tel-el-Kebir to-day, but I am awaiting further news from him.\n\nI & a party of 5 Sergeants went into Cairo last night & had a gay time. \n\n I was perched up on the Gahree driving through Cairo, & yelling out Ora-a-laigaley - Sha-me-nack - An-me-nack etc, & ran right into the Majors car, so I suppose I will hear something about it. I drove them into every smelly & dark looking spot\n\nI could find & finally landed them in the Ancient Egyptian Bazaar, which is one of the worst places in Cairo. They all reckoned the S.M. had gone mad. \n\nHowever we got out O.K. & after have some Refreshments at Saults, got a Taxi & drove home, at the rate of close on 80 miles an hour. \n\n I often wondered how we would get on if a wheel came off. \n\nOur 4th Divisional Train is now forming & in a week or so will be complete.\n","103":" 3.16 Thursday\n\nWe were inspected by Major Holdsworth to-day who is the Divisional Train Commander & he told us that we would shortly be on active Service in a strange Country, so he has left us guessing. He expressed himself as being satisfied at our turnout. \n\nMoving to-morrow so am very busy. Expecting draft of 105 men to-night\n","104":"\n\n105 fresh men came in last night & I had a very busy time fixing them up. \n\n We shifted Camp to-day to a place called Luna Park, & after a rather hard day have now settled down again\n\nwe have taken over horses & Waggons & are now going to start Hard work.\n\nHave heard that we move again to France in a fortnights time\n","105":"\n\nHad a hard days work in the Transport line. Sending out Waggons at all manner of times. I have now got a good convoy on an all night trip to Mahdi.\n\nWe are pretty well settled now, but only for a short time. They are trying to equip the Company as fast as possible so as to get it away & I have great hopes of going into France with a Commission which will be OK for me. \n\nWe have a lively lot of Horses, as good as can be had & I hope we take them away with us.\n","106":"\n\nPlenty of work to do. The men who were not on transport went to Church Service, but I was not able to get away. \n\nJack found me \nyeste\n to-day after tramping miles & it was funny to listen to some of his expressions. \n\nI went up the Town with a few of the Sergeants to the Empire Club, which is run\n\nby Australian Lady Volunteers where you can get a cup of Cocoa & Cakes for a few piastres. It is quite nice to hear them speak the good old language as one gets tired of all the jargoes you get here. \n\nIt seems to be certain that we will shift by the 15th of this month, so we are all looking forward to it.\n","107":" ","108":"\n\nTwo days of heavy transport work & very little time to spare. \n\nTo-day we took over 7 more wagons & also 16 Horses & 34 Mules. These Mules would kick the eye out of a needle & they want watching, although they are great workers. They come from Peru & Argentine mainly and are of a very large size.\n\nI think I am doomed as regards my Commission for there has been some more leg pulling & strangers are getting the Commissions. This fact is filling me with discontent & I will be very pleased when I can get into plain clothes & leave the life behind me.\n","109":"\n\nThis is a perfect swelter of a day & makes one wish there was no such place as Egypt.\n\nLate last night J Rolfe called on me to say goodbye as he has to go to Tel-el-Kebir to-day. \n\nWe have also been ordered to hold ourselves in readiness to shift at a days notice, but goodness only knows where to. \n\n I believe they are rushing our complement of men & horses through so as to get us away.\n\nThere is nothing much to report as we are only engaged on ordinary transport duties, which are beginning to become a little irksome. I wish to goodness they would send us to France or some other place. \n\nI tried a new riding Horse last night & nearly cracked my neck in doing so. \n\n Four of us went out on a 7 mile ride & going through Matarieh we opened them up to a gallop. My beggar proved to be both touchy & a stumbler & fell twice but I managed to free myself. He wont do Richard so – Reject. On returning home I had to take poor old Bill Cousins to Hospital.\n","110":"\n\nSpent the bigger part of the day in the Saddle exercising the Horses & out on treck with the wagons.\n\nWent up to the Town in the evening & regaled myself on Port Wine on the Piazza of the Grand Heliopolis Hotel.\n","111":"\n\nTook over a further 49 Wagons Limbers Water Carts etc from the 1st Divisional Train, who have gone to Sed-el-Bisher, where they will camp for 10 days & then embark for France. \n\nWe are the next train to go, so we are looking forward to the voyage, which I believe takes 7 days. \n\nWent out riding last night & met with misfortune. I had a horse which is very hard to mount & as I had to get off for something & he started to play up I was left in a rotten predicament. There I was in the middle of the local Desert & could not get him to stand. However after a half an hours struggle I managed to get on him & started for home.\n\nHave not had any mail for a long while but I am expecting some\n\nshortly. I am unable to write now, so I suppose everybody will be worrying.\n","112":"\n\nHad a very tiring day being in the saddle for the whole of the 24 hours. \n\nThe Convoy was engaged in transporting troops baggage from Helmieh to Zeitoun. Supply Section leaving tomorrow for Ferry Post & Serapeum, & consequently we are again losing some more of our very good Comrades. \n\nOur travelling Kitchen arrived & it is a very good one. It cost £250 but I fancy it is well worth it.\n\nI had much pleasure in receiving a batch of letters yesterday, although there was none from Nina & consequently I felt very downhearted, but better luck next time.\n","113":"\n\nAgain unable to go to Church Parade. I had to take a Convoy through Cairo to-day & experienced a good deal of trouble with my Horse, which shys at Motor & Tram Cars. \n\n It is a nice little hack\n\nthough & I am hopeful of turning it out a first class charger\n\nI am very tired after my long ride & also feeling very dirty, but I do not get time to have a bath. \n\n The boys are not having so good a time now, as they are all up at all times of the night.\n\nThe Strange Crowd we took in are proving themselves to be very troublesome & I intend to start on them properly in the morning. \n\n I have not heard from Jack for a long while, so I presume he is now down at Tel-el-Kebir.\n","114":"\n\nAnother day passed with a good deal of Convoy work over.\n\nI got the surprise of my life to-day caused by a Cable sent by Nina. It was keenly appreciated & I don’t think I ever thought as much of anything as I did of that Scrap of paper with a few words on it.\n\nExpecting another batch of horses from Maadi to-day 90 all told.\n","115":"\n\nI had a long day in exercising the horses & was in the saddle most of the day. Just as I was about to unsaddle the Postman ran up to me & gave me a gloriously long letter from Nina, you can bet I was very pleased with same.\n\nI am teaching my horse to follow me & even now he will walk about all over the place after me. I run away from him & he will come trotting after me.\n\nI rode through Helmieh to-day, where the Howitzer Camel Corps is camped & am gradually getting him used to them. I also went through Zeitoun & Matarieh. Apart from the usual Transport nothing much occurred..\n","116":"\n\nHad a good days work on convoying Fodder to Nebu Pasha Barracks. I also went down to the Irrigation of the Lower Nile & the scenery is very nice. \n\nEquipment for the Train is now pouring in & it looks as though we wont be long before we are fit for the Road.\n\nTroops still continue to pour in from the Colonies & one cannot make the slightest guess as to the number of men now in Egypt.\n\nThe Detention Barracks over here in Cairo & Abbassia are now becoming cram jammed with Venereal Diseased men, I cant for the life of me understand what they are going to do with them in the end.\n\n16.3.16 Thursday\n\nHad a hard days work. Went out riding during the cool of the evening with S Haynes. Old Jack turned up to-day as he had leave from Tel-el-Kebir. They get one day every month to come up to Cairo & purchase different articles. \n\nMy poor old Batman \"Woorack\" was put in the Hospital to-day & consequently I have to do everything myself. I hope he soon comes out as I miss his well meant advice.\n\nJack showed me a letter he received from Nina & he was as pleased as punch. The 1st Australian Division are now on the water for France so I suppose you will all soon hear of it.\n","117":"\n\nIt has been very hot here to-day & also \na\n very windy & unpleasant. Another one of our Officers is leaving us, having been appointed to a position down the Canal, you will know him when I mention that it is Mr Wells.\n\nI have not been out to-day, having had a very busy time on the lines. \n\nWe take in 195 more horses in the morning which I understand will make our full complement. \n\nThe 3rd Divisional Train will soon be here & I understand they are a certain number of \nhorses\n officers short, so my chance may come along after all, as it is it looks pretty dark on it.\n","118":" & 19.3.16 Sunday\n\nIt is still terrible weather & last night it rained very hard. I once heard it said that that it never rained in Egypt, but since I have been here (3 months) there has been a fair average & it would easily compare with Australias Summer rainfall, but of course\n\nwe have been punching through the winter months. \n\nMajor Holdsworth lectured us last night on our duties in the field & by all accounts he expects us to be in France within a few months time. \n\nI went for a long ride this morning & got my column of horses mixed up in a Camel Convoy which was about 5 miles long & consequently was very late getting back.\n\nSomehow or other I have a homesick feeling on me to-night as I sit on my bunk writing this up & at the present time I would give my whole \nworlly\n worldly fortune to be back. I have a fancy that all our mail is being held up whilst the troops are moving. Such being the case I suppose everybody will naturally wonder what has become of us.\n\nThe 1st & 2nd Divisions are now on the water & we will Sail if everything goes O.K. in a months time, & a happy good riddance of Egypt. \n\nJust fancy last Saturday","119":" by date is the 4th month out of N.S.W. I wonder how many more are to pass before my return.\n","120":"\n\nThe weather has now turned out hot again & it tries ones constitution very much riding along over the glaring sands. \n\n I lost one of my best Corporals to-day who has been ordered to Serapeum as a Transport man, & I was very pleased to be able to inform him that he would go away as a Sergeant.\n\nI was out at 8 pm & 2.30 am in the morning conducting a big move of Troops Kits & baggage. \n\nThere will shortly be no Australian Troops left in the Cairo District & I suppose we will be the last to leave it. \n\nThousands of Infantry & L Horse are entraining for Seddel-Bishr where they embark on the Transports for France. I do not know whether you all know of it, but the 1st &","121":" Aust Div’s. are now well on their way to France.\n\nUncle Charlie came round to see me this afternoon for a few minutes.\n","122":"\n\nI went into Cairo this afternoon in Company with 3 Sergeants & paid\n\na visit to a place which was once used as a Slave Market. There is also a place at the end where they used to kill all the Girls who were not pretty & consequently were never bought. \n\nThis place is now turned into a fashionable piazza with a stage erected at one end of it. Its chief purpose is to lure men into it & once in you meet all manner of \nprosti\n the higher class prostitutes, mainly French Italian & Spaniards, who all try to lead you away to their various haunts. It was only to satisfy curiosity that I went in & it goes to prove again what a beast of a place this is. To say that the whole proceedings are disgusting would be to put it mildly & I didn’t stay there many minutes.\n\nI have now thoroughly re-equipped myself in clothing etc. & will throw my previous issue away on leaving here. \n\nOur French Interpreter arrived in Camp to-day.\n","123":"\n\nAnother scorcher of a day & also plenty of hard work on account of the arrival of plenty\n\nmore troops. I fared very well with letters this time having received a considerable batch.\n\nI was amazed to see the extent of the rioting that has occurred in Sydney, especially the battle they seem to have had on Sydney Railway Station. To say that all the decent minded troops are disgusted at their behaviour would be to express it mildly & by rights they ought to pack them all over here instead of discharging them & I’ll guarantee they would get it taken out of them in the Desert. I am afraid it will have a bad effect over some of the men on this side but fortunately the greater number are down the Canal & consequently cannot do much harm. \n\n Of course we have regular riots her, but it is generally against the Arabs, some of whom always get killed.\n\nThousands of troops are embarking for France daily & you will soon see how our Australians can compare with the Germans. I for one have no doubt of the ultimate issue. \n\nEveryone here is talking\n\n \n\nof the Sydney riot & it looks as though there will be trouble in sympathy with them, but they are held well in hand & I don’t think it will assume a serious aspect\n","124":" &","125":"\n\nTwo days of constant & never ending rattle of Wagon Transport. \n\n I had the shock of my life to-day, who do you think walked in to see me. Lieut C H Read, who came over on the Ballarat for the Bridging Train. \n\nHe was full of news & just as witty as ever. It was simply lovely to hear him rattling on again in the same old manner.\n\nWe were Lectured by the C.O. Train on our future duties in France & after it was over I went up to the Palace to see Uncle Charlie. I sat talking to him for 1 hour & then the both of us went over to Heliopolis House & had Coffee on the Piazza. He expects to leave for Marseilles by next Sunday week. We are now very busy in transporting the Hospital contents to the Station.\n","126":"\n\nWent out riding in the evening with McMurtrie & inspected an Egyptian Fire Station. Later on we went to \"The Empire\" & after partaking of a Cup of Cocoa & Cakes we returned home.\n\nLots of our Men & Sergeants have colds & it is believed they are catching them from the Horses who have got pretty bad ones. \n\nWe are being troubled by a Fly called the \"Camel Fly\" & which attacks the Horses & makes them very restless. We have plenty of work to do & are kept fairly busy. I intend going up to see Uncle Charlie to-morrow night as he will be sailing very shortly.\n","127":"\n\nWent out riding & paid a visit to the big Belgian Barons Palace & it is indeed a magnificent Place. \n\nSituated on the top of a hill it looks right out over the Desert. \n\nThis man is a Millionaire Count & is the main man in\n\nthe Heliopolis building Syndicate. Fancy one man owning a City, it sounds like a fairy tale, yet such is true & the magnificence of the buildings would take ones breath away. \n\nI was going to pay a visit Uncle Charlie to-night but feel too tired to do so. \n\nHave heard that 2nd Australian Div has now landed in Syria.\n","128":"\n\nWent over to say good bye to Uncle Charlie. He catches 11 am train to Alexandria & embarks for Marseilles next Sunday. He is naturally overjoyed at leaving here, but he has need to be, as he has now been here 14 months. \n\nOne of the Australian Divisions have now landed in France without mishap.\n\nIt looks as though I am again doomed to disappointment as a W.O. from the Canal has arrived here for our Unit. \n\nMy officers are fighting the case however & I may win in the long run.\n","129":"\n\nThe heat to-day has been terrific & the Flies & perfect\n\npest. I went up to \"The Kursaal\" Music Hall & saw a pretty fair programme through. The French actresses are very pretty & dainty in their actions & and their singing is delightful. One of them would sing just in French & then English. She received a great ovation.\n\nI received the parcel of pipes & tobacco safely & have written by this mail. I have got a pretty bad cold in the throat & it troubles me a good deal during the night.\n","130":"\n\nWeather very hot & health far from good. I think I have got the Influenza.\n\nI went for rather a weird ride last night with a couple of Sergeants. \n\nThe night was black as pitch & our road ran through some thickly timbered ground & squalid Mud built Villages. On one side was a deep gully & the other was bordered by filthy smelling Native Villages - at 8.30 the weather suddenly changed & it blew a hurricane the Horses were very spirited & as we could not see where we were going, it was very exciting. However after an hours battling with the\n\nelements we saw some lights ahead & on reaching them found we were at Pont-de-Koubbeh. We then had to ride about 3 miles out towards the Nile so as to skirt the Camel Encampment & head for Helmieh Siding. On reaching here we dismounted & handed our horses to an Arab to mind & had a Cup of Tea & Cakes. We then struck out through the Desert & after a further hours stumbling ride, reached Camp, very tired & our horses completely blown out.\n","131":"\n\nThis is now our second week on Bully Beef & we are beginning to get a little tired of same. The only Vegetables we can get are Onions & if I am spared to get back again I don’t think I will ever look at them again, I am so tired of them. Some of the men are breaking out in Pimples & Boils, through the constant supply of \"Bully\" so I am going to cut it out for a few days & live on Bread & Golden Syrup, which is a kind of universal food to us. The \"Tea\" which which we all call Soapy water has now come to an end & thank goodness we are getting decent stuff.\n\nThis Tea was taken from a German Prize Ship & was originally intended for the German Soldiers, & I never tasted such rotten tack in my life.\n\nI have just received information that we are to be ready to move at a days notice, so I am going to pay a farewell visit to Cairo to-night.\n\nlater\n\nPaid a visit to Cairo & had a regular good time, although my throat was very sore & I had a cold. I also purchased a light Summer Suit & will obtain same to-day. This has now taken me to the end of my Finances, so I will have to sit back for a while. We ended up having Dinner at \"The Petrograd\" at 10 pm & arrived back in Camp at 11 pm.\n\nMajor Charlton came back from Alexandria, where he has been staying these last few days. The Sun has been frightfully hot to-day & consequently the night is very muggy & unpleasant\n","132":"\n\nTo-day one of the Companies of our train has been\n\nordered to hold themselves readiness to move & we have had to hand them over horses to complete their strength. Needless to say they got the worst on the lines & there was a good deal of merriment over it, as they handed them to us a month ago.\n\nI nearly met with an accident this evening whilst riding to Zeitoun. I was going along quietly when a Motor Despatch rider dashed past & my horse took fright & bolted. Luckily he made for the Desert & I was able to pull him up after a while. This is the second time he has cleared out with me & in future he is going to get a liberal dose of \"Spurs\".\n\nAll the first Year Medical graduates have been offered their discharge & it makes us feel homesick to see them getting ready to sail for Bonny N.S.W. \n\nNow & again we get very homesick & would give a lot to be able to go home. The weather has suddenly cooled off again which means more sickness.\n","133":"\n\nA day of ordinary routine. I received word that there was a registered parcel for me at Zeitoun P.O. So rode over in the afternoon, but was\n\ntoo late as they had closed. I intend going over in the morning for same.\n\nTroops are still moving out & it is anticipated that there will not be any Australians in Egypt after 6 weeks time. \n\nHad a bad night with my cold.\n","134":"\n\nPassed another Bad night coughing most of the time. I rode over to Zeitoun in the morning & procured parcel of Handkerchiefs & Envelopes sent by Mother & which were very acceptable. We had a bit of amusement to-day with our Buck Jumping Horse. A Cpl from the","135":" A.S.C. came down to ride him & after a tough struggle managed him, although he was thrown pretty heavily once.\n\nThere was sensational item of our Division Caused to-day. The Brigade Troops had to march from Tel-el-Kebir to Serapeum, a distance of 39 miles over the Desert. The Sun was frightfully hot when they started, & they lost their track on the Desert. They had all been living (like all of us) on Bully Beef & this makes you very thirsty. The consequence was they ran out of water \n\n& were left on the Hot Desert with parched tongues. \n\n 8 men died of Heat ap’xy & want of water & 80 have been sent to Hospital, some of them mad. \n\nThis is rather a bad start for our Division.\n","136":"\n\nI had a hard days work & am feeling very tired. \n\nThe 5th 7th & 8th Battalions had to be moved to Helmieh & also F.A. & Ambulances. \n\nYou never saw such a scene of chaos in your life as Helmieh was to-day. Imagine an armies Baggage all dumped within a Certain Area with Wagons going this way & that & absolutely choking up all available spaces.\n\nI had about 20 to 30 Wagons on the job & there were also 15 Motor Wagons there. \n\nThe English Motor Transport is going to take over our work & all the Australians have to leave. \n\n30,000 Aust Sail in a fortnights time & English troops are going to Garrison the Country. \n\nThere was an unfortunate accident here to-day in which a N.Z. lost his life. The Horse he was riding bolted & collided with a Cart.\n\nHe was thrown heavily & crushed. One of my Drivers picked him up & put him in a Gharee, but he died before they reached the Hospital. \n\nPassed another wretched night with my cold.\n\n4.4.16 Tuesday\n\nThe day turned out very warm & sultry. Had a fairly busy time with Transport.\n\nI went up to Heliopolis this evening with our Postal Staff Sergt & sat on the Piazza of the Heliopolis House, watching the Pictures & regaling myself in between times. It reminded me very forcibly of the times I used to go down to Fairfield Show for the usual Hang over with you all, only that it is free here, not even the customary 3d piece being charged.\n\nThis place looks deserted now, as all the Australians are down the Canal & in France. \n\nThe English tommies are coming in like flies & the same transports take our boys away. \n\nWe are now the only Australians in this part of Egypt.\n","137":" ","138":"\n\nTwo days of ordinary transport work with nothing of a startling nature to break the monotony. \n\nI paraded to the Doctor to-day as I fancy I have got a touch of the Sun. My Head aches something fearfully. He gave me some medicine & I have to report again.\n\nWe had a riot in Camp last night, caused through a couple of the rough elements getting drunk & causing trouble. Their episode will end in the Orderly Room to-morrow.\n\nI went up Town last night & sat on the Piazza with S Hayne & A Griffiths talking over olden times. \n\nWe are expecting a mail in from Australia to-day & am eagerly looking forward to same. \n\nThe War situation is as good as can be expected. \n\nWe received 50 Bicycles to-day for the despatch riders attached to our Train.\n\nB Cousins came back from Ras. el Tin Hospital yesterday & is as pleased as punch to get back to me again.\n","139":"\n\nI have now been sick for a couple of days &\n\nto-day was feeling very queer & had severe pains in the Head. I also began to get feverish & perspired profusely, so late last night I went to the Hospital & was treated by a friend of Uncle Charlies. He asked me if I had ever had Malaria Fever & said that he thought I had a mild form if it, but that I was to report back again if I felt worse. \n\nHe gave me some Cooling Powders to take during the night & they have done me the world of good. You will no doubt rouse when you hear this as I do not intend to tell you of it, as it would only worry you. \n\nThis morning one of the latest Aeroplanes flew just over the top of our tents & we had a fine view of it. They are a very large type of Machine & also particularly powerful.\n\nI was offered a Warrant Officers job in the Supply at Serapeum to-day & refused it, as I don’t want to go there until I have to, more over it is a clerical job & I would much rather be with the men. In any case I have been promised a Warrant in the Transport in a few weeks time, which will suit my books much better.\n\n8.4.16 Saturday\n\nFeeling much better & have lost the violent Headache & feverishness. I went on Parade this morning & carried out my usual duties. \n\nI have to attend a Court Martial in a day or so as prosecutor & witness on 2 men who rioted in the Camp a day or so past. It is a duty which I do not like but unfortunately I cannot get out of it.\n\nI got a Canvass Sleeping Bag from one of the Drivers to-day & it will be just the thing when we are forced to camp under the wagons.\n\nI got a full report of our Divisions march across the Desert from one of our fellows who has come up from there. \n\nOf the suffering & agony they put up with few can realise it to its full extent. They were marching from S. Tel-el-Kebir to Serapeum a distance of 39 miles & had it mapped out for a 3 days march. 15 miles 1st day, 9 – 2nd & 15 the third. \n\nAt the beginning of the 3rd days march they were Strung out all over the place & nothing could move them from the torpor which they all seemed to be in. Their water had given out the previous night\n\n& they consequently had a days march (15 miles) over a loose Sandy desert, with a burning Sun glaring down on them. \n\n They were carrying their usual pack (80 lbs) Rifle Bayonet etc & 150 pounds of Ammunition. Of (1) Brigade 4000 men only 2000 were able to march in, the rest being Strung out for miles behind, in some case insensible on the Sand & in others unfortunately Death.\n\nThirteen died of thirst & there were hundreds taken to the Hospital. \n\nMany sad cases were witnessed where some of them shot themselves in their agony. One officer unable to stand it shot himself with his revolver. \n\nThe majority of their men through their packs & rifles away so as to enable them to reach Serapeum. \n\nThis cast a gloom over the Division, but the majority of them are now recovered except for a few cases of Sun Stroke, the victims being out of their senses.\n","140":"\n\nA small party of us had a good time last night at \"The Hotel Heliopolis\"\n\nwe sat on the Piazza & saw pictures of the South of France, where we hope to be in a few weeks time & it looks very inviting Our 1st &","141":" Divisions were received there with open arms & flowers were showered on the them. They are now billeted about 8 miles from Marsailles.\n\nI had a large job this morning moving wagons from Zeitoun to our Park which we have taken over They being left behind by the D.A.C.\n\nI unfortunately had a accident with one of my men. He was riding a big Chestnut Mare & was just behind me when a Motor Car came up behind us & caused his horse to Buck. My horse also started but I managed to quieten him, but not so in his case, as he was thrown very heavily & fell on his face. The horse tried to paw him but I drove him off. \n\nHe had all one Side of his face very badly lacerated. I had him placed in a car & sent to Hospital.\n\n The weather is very hot & dangerous there being many \"Sun\" cases. I had a touch of the Sun last week & do not want\n\nanother. If you cut yourself no matter how slightly it will turn to septic poison. One has to be very careful even in shaving. I have seen fellows with their hands & arms bound up just through a pin scratch. \n\nOne thing I would give anything for is a decent cup of water. We cannot get it as it is unobtainable. All the water has a very lime like taste & if you drink much of it, makes you sick. The weather coupled with the usual Bully Beef (salted) make it agonizing. Can you wonder at one wanting to leave this Country.\n\nOur Mails have gone astray so we presume they have gone to France. Such being the case we have not got a dogs chance of getting them.\n","142":"\n\nWe very fortunately got our \"Mail\" to-day & I got 2 from Nina & 1 from The Aunts. I was disappointed that there were none from .\n\nI have been very busy at the Court Martial to-day & accused is remanded so it will all have to be gone through at\n\nat later date. \n\nWe have taken over another 63 wagons & are obtaining a large number of remount horses to-morrow. \n\nThe Train is now nearing completion & it should not be a very long while before we move off.\n\nThere was a fine sight outside our Camp to-day, when about 500 Motor Ambulances pulled up to take a large number of Sick & Wounded men back to Cairo & thence to Suez for the \"Runic\" thence High ho for Sydney. Goodness how we envied them. I do not mean their wounds & sickness but their trip home again. There are 4 or 5 of our fellows going back on her.\n\nI was in Cairo to-night & there are scarcely any Australian Soldiers to be seen, all Pommies. The Egyptians say Business no good Australian he very good fellow, plenty Money English no money, no business.\n","143":"\n\nWe have taken over the Remount Horses & they are a vicious lot. 2 men have been sent to Hospital with\n\nkicks, one of them being very bad as his elbow is badly lacerated.\n\nWe have been given notice that we have to move our Camp back to the Aerodrome on Thursday. This is what breaks our back, as I can assure you that it is no trifling job to move a Unit. Most of the worrying work resting with the C.S.M.\n","144":"\n\nToday we had the beginning of a Sand Storm which I understand last about 3 weeks at this time of the Year. It is the uncomfortable & wretched thing ever one had to put up with. There are times when you cannot see your hand in front of you & everything gets smothered in fine Sand. It gets in your food & everywhere. I am also on a big D.C.M. & things are only middling.\n","145":"\n\nI had a great surprise to-day in receiving a big & long letter from Nina & am answering same to-night. We had a Camseen to-day & it was terrible. This is a violent\n\nsandstorm which last on & off for 40 days. When the Clouds of Sand approach everything goes Black as night. It smothers every thing in fine sand makes things very unpleasant. I hope it drops to-morrow. \n\nI am expecting the riding Horses in to-morrow & am on the look out for one for myself as I can not trust the one I have now at night.\n","146":" ","147":"\n\nNothing of any note occured to break the monotony. We are still at Racecourse & I understand our Colonel is fighting hard to stay here until we have to embark so as to have only one move. \n\nWe all naturally hope he is able to fight them on the subject. \n\nI have a new Horse now but do not like her as much as my former one. \n\n I rode over Pont De Koubbeh last night & it was a perfect moonlight night just as you see in Biblical Scenes.\n","148":"\n\nThis proved to be a very quiet day. There was no Church Service as we are the only Unit in this vicinity & we do not carry a Chaplain on our Strength. \n\n The weather is fearfully hot & we are utterly prostrated in the middle of the day.\n","149":"\n\n2\/3rds of the Company went on a route march over the Desert to-day & as we were not told where we were going we did not take our Water Bottles, consequently we suffered very much from thirst. I was riding in rear of the Column for a while. My mouth was parched & tongue & lips were swollen, it is perfectly marvellous how it affects one. When I did eventually get a drink it made me sick. \n\nThis is the one Curse here – no decent drinking water.\n","150":"\n\nWe had a Review Parade (Mounted) today & were inspected by Colonel Holdsworth, who\n\nexpressed himself as being satisfied with the Turn out. It was a grand sight to see line after line of Wagons & Horses all pulled up on the Desert.\n\nTonight I had a rather exciting ride with the Horse that had been alotted to me. She is a fine big Mare, about 16 hands high & takes some getting into the saddle. However , to night when I got into the saddle she took it into her head to buck & had me all over the place in two . \n\n I managed to stick to her, & galloped up & down the Racecourse a few times which quietened her. After this I rode round through Zeitoun Matarieh & Pont De Koubbeh & am very dissatisfied with her, so I am taking back my old horse to-morrow & will stick to him if possible.\n","151":"\n\nWe held our first dismounted 4th Divisional Train Parade to-day & it was very good to see. We went through a few movements, were inspected & dismissed\n\nby Colonel Holdsworth. We are all hearing startling rumours of our troops fighting in France, to the effect that they have pushed the Germans back. Some English letters received here state that all the English people are speaking of their doings & praising them to the highest. \n\nWe cannot get confirmation of this, as news here is generally a month behind everywhere else.\n\nI went out riding to-night in the Cool of the evening & thoroughly enjoyed myself. \n\n The flies are pesting the lives out of us. It is maddening to have to put up with them. I have heard that there is a Mail Steamer in Suez from Australia, so am expecting letters by about Friday next. \n\nMajor C went to Port Said to-night to see his wife off on her voyage to France. This makes me think that we will soon follow.\n","152":" &","153":"\n\nI have just returned from a 2 days treck under active service conditions & it was very \n\npleasant & exciting. We left here with a convoy 1 mile long for a 40 mile trip across the Desert. On the way the route passed through the 2 dead Cities of Egypt & although I was only able to view same from my horse it was decidedly interesting. \n\nThe Arabs were in their thousands as being good Friday they all go to the Cities to pray for their ancient ancestors. \n\n The track was very narrow in places & needed great care to safeguard the Convoy. \n\nAfter passing the Cities we emerged onto the Desert & then began a weary trip. We had to halt every hour or so to spell the horses & water them. The fine sand was very troublesome as it fills your eyes & nose & nearly suffocates you. My eyes are all blood shot to-day on account of same.\n\nIt was a wonderful sight to see the Convoy stretched out over the sandy ridges just for all the world like a giant snake. \n\nWe passed through Maadi which is where the Turkish Prisoners are camped & proceeded to the outskirts of the town to pick up our loads.\n\nand escorts. \tComing back we took the Nile route which cuts out a lot of the desert & it was very pretty. \n\nThe Road is banked up to a good height with the Nile on the left & a long range of Hills on the right. \n\nAfter we had gone some few miles along the Road an escort of Mounted Gurkhas suddenly appeared & just moved along on the flanks of the Column, leaving us as we reached the outskirts of Kasr el Nil. \n\nWe all reached home safely after 48 hours in the saddle with very little to eat.\n","154":"\n\nThe whole Train is very busy to-day engaged in packing up as we are under orders to move. \n\nOur destination is Polygon near Abbassia. \n\n I believe it is a very nasty place & consequently do not like the idea of going. However, orders are orders & must be obeyed. \n\nWe are striking tents & loading them to-night so as to be off early to-morrow. It will be a Column as we have\n\n100 Wagons for our Company alone not counting what the other 3 Companies have. We took in a further train load of Horses from Alexandria to day which brings our train up to Completion. \nOu\n The next move will probably be France.\n","155":"\n\nMy heavens this is a day that I will remember for ever. We moved the Camp to Polygon Abbassia & it was the biggest job I have ever been on. To add to the misery the Weather was terribly hot & the whole job was badly dis-organised, owing to interferences of plans by officers.\n\nWhen we got to the New Camp site, which lies at the bottom of a range of sand Hills things were utterly dis-organised & I had 24 hours of the hardest work ever I have had in my life, carrying 2 jobs on my shoulders, ie. CSM & W.O.\n","156":"\n\nThings are very much the same, that is plenty of hard work to get the Camp straightened out & I am feeling very tired.\n\nI received 6 letters to day from home all addressed to my new Unit & was exceedingly fortunate as all those who did not Cable their new address did not receive any as their letters have gone to the new 20th which is in France.\n\nThe Weather continues to grow warmer & in the middle of the day it is practically unbearable. \n\nA strange thing is the unquenchable thirst that seizes everyone, & the unfortunate part is that we are not allowed to drink much water on account of disease & practically live on Lemonade & Shandies & very seldom drink plain water. Lots of our chaps are going down to sickness & at the present time there are 30 in Hospital. \n\nTomorrow is a big day in Egypt it being the Anniversary of the Landing.\n","157":" Anzac \nTo\n day\n\nThis was celebrated right throughout the Army & was observed as a Holiday, although our Unit had to work just a hard as ever. \n\n However they gave our Train a Concert & free spread at night & it was enjoyed by the boys. \n\nI was unable to go but heard glowing accounts of it from Cousins. \n\n Loaded plates of dainties very rarely reached the Tables before they were empty.\n\nThere was a little rioting in Cairo where several Native Houses were burnt down. It is a good thing that there were not many of Aust Troops here, otherwise there would have been the devil to pay.\n\nThe Artillery is practicing Shrapnel Firing on a range of Hills at the back of our Camp & it is, at the present time one deafening roar. \n\nWeather still very hot & unbearable in the middle of the day.\n","158":"\n\nThis has turned out to be the hottest day ever it has been my lot to experience. It is impossible to go outside for long & the heat inside\n\nthe tents is almost unbearable. \n\nThere is also a hot wind blowing which seems to burn you. Everything you touch is hot & a pair of boots of mine which happened to be in the sun, curled up & I cannot now wear them.\n\nI received 2 more letters also 2 parcels containing Socks, Comforter, Chewing Gum, Tobacco etc from Mum & Nina. \n\nI went out last night & when returning a heavy mist was falling & I could not find my track across the Desert. However I left it entirely to my Horse & he eventually found our Camp.\n","159":" ","160":"\n\nTwo days of Transport work good & hard.\n\nOn Thursday our Forces at El Kantara about 10 miles on the other side of the Canal were attacked by a large force of Turks & Austro Germans who were able to unfortunately surprise a Couple of Companies of Worcester Yeomanry. The latter suffered pretty heavily on account of their horses being killed by Artillery Fire. However by the close of day some Irish Fusiliers arrived on the scene & charged with fixed bayonets\n\n& ousted the enemy from his position & he retreated towards a Small Village about 5 miles away. At this juncture some Australian Light Horse arrived on the scene & gave pursuit inflicting many Casualties on them. \n\nThe Royal Flying Squadron then took a turn (8 machines participating) & dropped 60 bombs each on his camp which was utterly demolished. \n\n Altogether out of an attacking Force of 2500 the enemy lost 500 killed 80 prisoners & a large amount of Ammunition together with a few Machine Guns. \n\nI do not know the exact Casualties on our side but they were heavy. I am afraid if they keep this going that we will not be allowed to leave here, which is just what the enemy wants.\n","161":"\n\nAnother rather monotonous day in which I never went out of Camp.\n","162":"\n\nThe last day of the Month & a Windy one. Our Company is ordered out on a Mounted Parade for inspection in the morning, & I can assure you it is no joke, as it entails a vast amount of\n\nWork in turning out 240 Horses & Vehicles.\n\nThe Welsh Choir is giving a free entertainment to our Soldiers at the \"Anzac Hostel\" to-night & nearly every man not on duty has gone in. I of course as usual am left in the lines.\n","163":"\n\nHeld a Mounted Inspection & had a lot of work to do in Consequence of Same. Went out riding in the Evening as it was so delightfully Cool.\n\nAn enemy Aeroplane bombed Zag-ga-Zig yesterday which is only 15 miles from here & a couple of minutes flight.\n","164":"\n\nWe have been told that we move for France or England in 14 days time & I hope that it is true, but there have been so many rumours in the past about moving that I am going to wait & see before I accept it as being the Truth.\n\nAm hard at work getting ready for an inspection by a General to-morrow morning, after which we are to have a mounted inspection.\n\nTo-day I read out on\n\nParade a notice to the troops advising them of General Townshends surrender. This did not come as a shock to us as it was expected for some time. It does not depress the troops one whit, only makes them all the more eager to get to the enemy.\n","165":"\n\nWas inspected by General Watson who expressed himself as being satisfied with everything. \n\nAfter this we had a Mounted inspection & it was an excellent turn-out, everything going off without a hitch.\n\nAm hard at work getting the Company properly organised & fit to take the road at a moments notice.\n","166":" ","167":"\n\nI was Inoculated for Para Typhoid on Thursday & have suffered agony with it.\n\nThe weather was very hot & that coupled with the effects of the inoculation made things very agonising.\n\nTo-night (Friday) it has travelled into my breast & I am in great pain\n\nwith that & my head.\n","168":"\n\nI am far better & in fact & very nearly myself again. \n\nToday I received orders to arrange for the moving of the Camp to Serapeum which is on the Arabian Side of the Canal & consequently well within the War Zone. However I am led to believe that we will not be there long before we move to France. I have also been instructed to forward my claim for a Commission so I am feeling very hopeful.\n","169":" ","170":"\n\nWe are still awaiting Train Accommodation to transport us down the Canal. \n\nI was offered a job of CSM on Instructional Staff to teach the men in the Details as they come across, before being drafted into Regiments, but as there was no promotion attached to it I turned it down. Moreover, my papers are in for a Commission & I am expecting to hear something very shortly.\n\nThe Weather still continues to keep hot.\n\nThe war position looks very favourable & everything points to it finishing this year.\n","171":"\n\nWe received orders to-day to entrain at 2.30 for Serapeum & I can tell you we had to work like fury to do same, as we only had a couple of hours notice. \n\nHowever we got the Horses & Wagons down to Abbassia Siding & commenced to load the first train. This left at 4 pm & arrived at 11 pm that night. We got the second Train away at 6 pm & the last on which I travelled at 10.15 pm. \n\nThis was the most wretched journey ever I had, as we had to perch up on the top of the Wagons & the air was very keen.\n\nWe finally arrived at Serapeum at 4 a.m. next morning & then commenced the most Strenuous days work that I have ever experienced\n","172":"\n\n4 a.m. all the Horses & Wagons were mixed indiscriminately together just as they were unloaded off the trains & we had\n\nto commence to sort them out. \n\nThe Wagons sank Axle deep in fine sand which necessitated 8 horses being used in each one, & consequently 8 trips. \n\nWe had to move off for the Sinaii Peninsular Side, & had to cross the Suez Canal Bridge, which is closed for a certain number of hours each day, this made it very hard.\n\nOn arriving at our Camp which is situated in the middle of the Desert we had to unload, erect Tents, & get things in readiness for further work. I will close now & continue tomorrow, as I have been 48 hours up with no sleep & very little food.\n","173":"\n\nDescription of Serapeum\n\nThis place is situated on the Sinaii Peninsular, or one might say Arabia. It is of course very hot, being situated in the Desert, in fact it is almost unbearable. \n\n5 miles from here is the Railhead, & out from that is where our army is entrenched.\n\nVery heavy fogs fall during the early hours of the morning & it causes much anxiety\n\non account of Enemy aeroplanes sneaking up. Sometimes we can hear the engines purring & can not tell whether it is one of ours or an enemy. \n\nRound about you can hear the big Guns firing & the whir of Machine Guns, & when an action is in progress, you can hear it quite distinctly. \n\nOf an evening we go down to the Canal & watch the liners passing through & sometimes fare very well as they throw us all kinds of things, including papers, which there is keen competition for. \n\nIt often causes a sigh to see a Boat going out towards Faraway Australia, but I suppose the lucky ones will have that pleasure later on.\n\nOne thing here which is a terrible annoyance is the flies. You cannot open a tin of Jam, before it is smothered. We have had to return a huge lot of Bully Beef as it was found to contain small barbed hooks, evidently placed there by an enemy firm.\n","174":"\n\nAnother hot day & plenty of flies to annoy. There is an action in progress out on the Trenches & it is just\n\na deafening scream of Big Guns. There are the Artillery Heavy Howitzers, Trench Mortars & a continuous rattle of Machine Guns.\n\nWe are Transporting hard out to Rail Head, from where it is taken on by Camel Trains. We are raking up every kind of tin imaginable to hold water for the Troops.\n\nAm going to ride down to the Canal & have a swim directly & I am looking forward to it.\n","175":"\n\nI had a rough trip last night. I went out with 20 x 4 Horse Teams to move Wagons from Ordnance to Serapeum No 2. The Heat nearly sent us mad but we had to stick it out. I finally finished the job just 3 minutes too late to cross the Bridge, & had to wait an hour & ¾ for a punt to take the Horses across, & then I had to cut the column in 4 to get them across. I arrived back safely had some Tea & went straight to Bed.\n","176":"\n\nToday has been the worst day ever I have experienced. We are having Sand Storms which blow in from the Desert & the heat is absolutely\n\ncruel. The Flies are coming in plagues & it is no use trying to rest with them. They crawl all over you & make life a perfect burden.\n\nThe Ceramic came through the Canal to-day loaded with Troops & it was very funny to see the way our fellows greeted them. Told them that it took them a Hell of a long while to make up their minds.\n\nWhen the Cooees came through one of our fellows asked them who they were & on the reply \"We are the Cooees\" our chaps replied. Well we have been Coo’ing for you for 18 months so now come & do a bit.\n\nWe are under orders to Sail for France & expect to leave here for Alexandria at any time & embark on the 27th of the month. \n\nTo-morrow is my Birthday, the first ever I have spent away from all my People. Plenty of Troop ships are coming through the Canal with troops of the 3rd Division, so I suppose they are going to relieve us.\n","177":"\n\nWhat a Birthday I have had to-day. To begin with the Sun has been that fierce that it has laid\n\na lot of our fellows out & to cap all we have to trek out to Serapeum No2 Railway Siding to draw 100 Wagons & leave our old ones there. This is a fearful job as the wagons have got to be man handled through deep sand & loaded on the Trucks. \n\nThe work all day has been cruel coupled with climatic conditions & the job has to be continued tomorrow \n\nReveille at 3 am to cross the Bridge early. \n\nTo cap all a lot of us have been inoculated again & I am feeling it very much & as tomorrow will be my worst day I am not in a happy frame of mind.\n","178":"\n\nAm feeling as sick as can be & am suffering absolute agony with the Heat, Wind Sand & Inoculation \n\nWe are now getting the Wind Hot & strong which blows in from the Arabian Desert & at times you have to lay face downwards to get free of the flying sand. Every one of us are absolutely full up of this place & we all pray to get out of it. I am afraid that some of the men will go out\n\nof their minds if we are not soon relieved. It is no White Mans Country. \n\nSome of the Infantry men are dying of thirst & heat apoplexy. \n\nThe Wind to-day is cruel, it is just like as if one was standing in the track of a bush fire. We are all having to wear Goggles but the rims & Glasses get red Hot & unbearable & all have to take them off.\n\nAll the time we are working hard & I am afraid that we will be a very sorry Regiment if they dont soon hurry up & get us away. \n\nI would rather be shot than stay here another Month. As long as I live I will never forget my stay here. Sinaii will be written across my Brain for many the long Year to Come\n","179":"\n\nAnother Hot & Windy day which absolutely stifled us.\n","180":"\n\nIt has been a little cooler to-day on account of the wind veering round towards the Meditterranean Side. Life is practically the same\n\nevery day plenty of Transport work to attend to & little time to do it in. \n\nAll Horses have to be tested for Glanders in the next couple of days & as the test kills them within 24 hours if there is anything wrong with them, I am anxiously awaiting the result on my little Pony, whom I have become genuinely attached too. \n\nWe had a change of W O’s today, ours going to the 27th & theirs coming here. \n\nTwo Turkish Spies were captured on the Canal this morning & sent along. They were dressed as Arabs, & were found to have a copy of our Canal Defences on them. It is now 6 months since I left home, but it seems far longer. We are getting no news of the War so I dont know how things are going.\n","181":"\n\nSeveral large Steamers passed through the Canal to-day including the \"Omrah\" & \"Mooltan\". How the people on board cheered our chaps who were bathing along the Canal. Two Monitors have been prowling about all day & last night & it is a marvellous\n\nsight to see them focuss their Searchlights on Steamers at night-times. The Bitter Lakes are only an hours distance from here & it is in their vicinity that the Warboats plant themselves.\n\nThey have been exploding mines again to-day & the roar is deafening. You can a whole hill blown into air at once.\n\nI have come to the end of this book so will have to start another, & in so doing I am wondering how many more day diary I have got to write, before I get home to Dear old Fairfield Town.\n\n"}}