{"Document Name":{"0":"Diary_0075","1":"Diary_0075","2":"Diary_0075","3":"Diary_0075","4":"Diary_0075","5":"Diary_0075","6":"Diary_0075","7":"Diary_0075","8":"Diary_0075","9":"Diary_0075","10":"Diary_0075","11":"Diary_0075","12":"Diary_0075","13":"Diary_0075","14":"Diary_0075","15":"Diary_0075","16":"Diary_0075","17":"Diary_0075","18":"Diary_0075","19":"Diary_0075","20":"Diary_0075","21":"Diary_0075","22":"Diary_0075","23":"Diary_0075","24":"Diary_0075","25":"Diary_0075","26":"Diary_0075","27":"Diary_0075","28":"Diary_0075","29":"Diary_0075","30":"Diary_0075","31":"Diary_0075","32":"Diary_0075","33":"Diary_0075","34":"Diary_0075","35":"Diary_0075","36":"Diary_0075","37":"Diary_0075","38":"Diary_0075"},"Date":{"0":"unknown","1":1637.0,"2":1639.0,"3":1640.0,"4":1641.0,"5":1642.0,"6":1645.0,"7":1646.0,"8":1647.0,"9":1648.0,"10":1649.0,"11":1650.0,"12":1653.0,"13":1654.0,"14":1655.0,"15":1656.0,"16":1660.0,"17":1661.0,"18":1662.0,"19":1668.0,"20":1669.0,"21":1671.0,"22":1672.0,"23":1677.0,"24":1678.0,"25":1679.0,"26":1680.0,"27":1684.0,"28":1685.0,"29":1687.0,"30":1688.0,"31":1689.0,"32":1690.0,"33":1695.0,"34":1696.0,"35":1699.0,"36":1703.0,"37":1705.0,"38":1707.0},"Entry":{"0":"\n\nLeft Fovant Camp on ","1":" for France, left Denton Rly Stn at 9 P.M. arrived Folkestone at 3.30 A.M. and marched straight to billets in what had been before the war, a large apartment Hotel on Marine Parade, & fronting the Sea, these billets, as well as two other large hotels, \nwere\n are surrounded by a high iron fence to keep the troops within bounds, and are only used for troops making a short stay on their way to & from France, The hotels look as though they would have been very nice to stay before the war, at present they are just stripped bare, and are pretty dirty with paper torn off the walls, and writing on walls etc. When we arrived here, we found a lot of New Zealanders & Tommies & Scotties also here, all going Overseas with us today. On the side nearest the sea, we are allowed to go down on to part of the \"beach\" as I suppose it is called here\n\nit has no sand at all, but is all small round waterworn stone, out on the sea, which is between here & France are numbers of vessels of all kinds, patrols, mine sweepers, & war boats, not to mention an observation baloon that is being towed along, by a small steamer, & a couple of sea-planes, all on the lookout for Fritz’s tin fish. It is a beautiful day & I would like to have a walk round the city, as we are not leaving until some time this afternoon & have nothing to do except wait. I had better stop now, or I will have this little book filled in no time. 9 P.M. left Folkestone at 4 P.M. & had a good trip across on a small, fast boat named the \"Victoria\", it was packed with troops of all sorts, and was escorted by three destroyers, and there were patrol boats all the way across. We landed at Boulogne at 6 P.M.\n\nand escorted by a band we marched through Boulogne and up a very step hill, I don’t know the right name of it, but it is famous in the Australian Army as \"Blanket Hill\" becos every draft that comes over, marches up here & draws a blanket, winter or summer, then very often only stops half a night & then moves on. This camp is only a rest camp so troops never stay long. We are only about 40 miles behind the line here, & precautions are taken against air raids, that is sand-bags are built up for shelters, and in the event of a raid we could shelter there, as the tents would not be much protection.","2":" 10 A.M. Am on Picquet at present until 1 o’clock, & am supposed to get leave this afternoon to have a look at Boulogne. At 12.30 last night, Fritz made an air raid over in\n\nthis direction, with some aeroplanes, we all turned out, & could hear the hum of their machines, and the sound of their bombs over a hill from our camp but tho’ the machines flew over our camp nothing happened. There were a lot of great searchlights from the different hills about, like great white ribbons waving to & fro about the sky, and little flashes here and there, just like the flash of an electric torch, and those were shells of ours, bursting around the Fritz aeroplanes. I believe there were five raids here last week, a lot of our fellows went for the shelters but there was such a cold wind blowing that I went back to bed, of course I would have ducked for cover quickly if they had started to bomb. I don’t wonder we are not winning the war, if the mismanagement we have seen so far is continued right through, and from what I hear, it is the same it would make a person cry at times.\n","3":" P.M. Had a couple of hours leave and had a walk through Boulogne. There are parts of the place not too bad, but most of the streets & houses are small & dirty, not a bit like the places I saw in the South of France, and here, the people are not nearly as sociable as the country people, partly I suppose because there are such a lot of soldiers always been here and they have made their usual name for themselves. There are a large number of British Waac’s here, doing all sorts of work for the Army, & women drive most of the Ambulances etc, for the Red Cross. On all the trams there are nothing else but women drivers & conductors and they handle their job well. I don’t know why we are here, we are doing nothing, & handed in\n\nour blankets this morning the first thing. There is talk of a big German attack yesterday which collapsed everywhere, but I don’t know how true it is. In Boulogne all the large & a lot of smaller ones have strips of stuff like cheese cloth, pasted criss cross , could not think at first what it was for, but believe they are more likely to stand the concussion of bombs, as you know the sound of big guns will break windows within a certain distance. There are practically no sanitary arrangements in the town no public lavatories as far as I could see, and the population either wait until they get home, or use some convenient corner in the streets and all household waste & rubbish is just thrown out into the street, & that’s the end of it so far as I could\n\nsee, of course that is in the streets just off the main streets, and I don’t suppose it applys to the richer parts of the town, which I have not seen. We have plenty to eat here, in the way of bully beef, bread, biscuit & cheese & jam, and practically nothing to do, it will be very hard to have to take charge of men again, after the long spell off it. (Before I forget it, the name of this camp is \"Ostrohove\".\n","4":" We left the above camp about 6 P.M. 29\/5\/18, & marched a couple of miles to a station on the further side of Boulogne. On the way we went through what was once an old fortified town, through a great Archway in a wall nearly as wide as our house is long, & with a row of beautiful trees growing on it, the great wooden gates strongly bound with iron are\n\nstill hung there, this wall goes right round the old town & we went through a similar gate on the other side. The old sports who built the wall would have stared if they could have seen the armed Australians marching through their gates. When our train came along, it was an extremely lone one & all (except one carriage for \nOfficers\n) built like our trucks you put your eggs & fowls in, only a bit larger, to carry \"Chevaux 8 et hommes 40\" which means 8 horses or 40 men, on the train were a motley crowd, French, British, American, Canadian & Australian soldiers, and Chinese laborers. In our particular \ncarr\n car we were lucky as we only had about half the number in that we should have had.\n","5":" we had a little sleep, evidently there had been horses in it before us, and it had not been too well cleaned out, but I suppose we will yet be glad of a place as good. About 2 A.M. we were wakened by guns, the train stopped, & we looked out & found Fritz was making a raid on some place just ahead of us, the noise lasted for about an hour, and tho’ it was some distance from us, the train was rattling all the time with the concussion the search lights were going to & fro in the sky, & the guns were firing continuously with now & again the larger reports of one of Fritzs bombs, I\n\nI have not heard what damage was done by either side. We reached \"Harfleur\" at about 8 P.M. taking just about 24 hours, Harfleur is near le Havre, then we marched a little distance to this, the Australian Base Camp, which is very prettily situated in among some beautiful wooded hills. Today we were issued with some more stuff to carry & went through another course of Gas, as Gas is what is causing the most casualties.","6":" We left the Harfleur Camp today about 3 o’clock after spending a couple of very lazy days. perhaps we could have had leave if we had applied for it, but it is real lazy weather, and it seemed to be much\n\nnicer loafing about under the lovely shady trees, than walking along the hot dusty road to Havre, which is a few miles away, and probably not much different from Boulogne. The march in to Havre was not \nadd\n at all nice, we had besides our ordinary pack, which is quite heavy enough, a blanket & 120 rounds of Ammunition and as the day was hot & the road dusty we were quite glad when we arrived.","7":" We did not leave Havre until 9.30P.M. and had a very slow trip, it was interesting enough, but when we are so close to such a thing as this \"Great War\", one is naturally a bit unsettled. Le Havre seems to be much the same as Boulogne to look at what we saw marching into the Station. We saw lots of Americans on our trip, and they are a fine lot of men to look at and if they fight as well as they look there ought to be something doing when they \ndo\n get started.\n","8":" We arrived at the end of this train journey at \"Ternois\" about 20 kilometres from Amiens, at about 7 P.M.","9":" and marched a couple of miles to a Town named \"Berteaucourt\" where we were put in billets. Billets always sounded nice to me and no doubt they are not so bad. The officers of course are in the better houses, the rest are either in \nthe other\n sort of houses, or in barns or sheds. We are fairly lucky about ten Sgts have a \nhalf\n barn half filled with hay, for our billet, it is nice & warm at night, & I had a real good sleep, which was more than I had the night before in the train. The place here is filled with soldiers of all kinds, nearly all billeted and tomorrow we go up to the front line. I am not well impressed with the people so far as I have seen them, of course I suppose it is only the very worst class we come in contact with, but there is no doubt that morally they run the Egyptians very close, that is for badness, also the dirt & filth are practically the same, and it is a great\n\nwonder that there is not more sickness altho’ here, as in Egypt, there is an awful lot of sore eyes, etc. A most pathetic sight is the number of refugees that are still streaming back towards the rear, some families walking & carrying all they possibly can, others more fortunate have a horse & cart, and perhaps a cow or a couple of goats tied on behind, the families of course mostly consist of women & children, all carrying a bundle according to their strength, & some times a real old feeble man or woman, just able to hobble along. The Y.M.C.A. here is funny, it is in a little mud hovel with one door & no windows, & in which one can get a drink of tea and a few biscuits for 3d, of course the main thing sold is tobacco & cigarettes, which I have not started to use yet, tho’ every one has assured me that I will certainly do so before I am in the line very long, well, perhaps so, I won’t mind if there is any satisfaction to be got out of it.\n","10":" We left Berteaucourt this morning about 9 o’clock and marched towards Amiens, don’t know how far we came but it is to a place named Bertangle. I was lucky enough to get kept behind to take a man up as a prisoner, and we got a ride on a motor-lorrie most of the way, and was not sorry, as the roads which are very narrow, has two constant streams of traffic, men, guns, and lorries going up towards the line, & empty lorries & refugees going back & the road is inches deep in a fine white dust, & through all the traffic are motorcycles going both ways, apparently as hard as they can, and when the road runs thro’ a village and mingled in among the other traffic are lots of children & women, & poultry, etc. I don’t know how it is that there are not more accidents, everyone on the road is thickly coated with the white dust. While I am writing this there is a Fritz aeroplane right up over head, thousands of feet, and with the sun shining on him, he looks like a great bird. Guns are booming\n\nfrom the earth, and a long way behind Fritz, are lots of little white puffs of smoke, which are the shells that are being fired at him. I suppose he is only observing, probably looking to see if Sgt Burrowes is in sight yet. I nearly forgot to tell you that the majority of the French girls about here are very pretty, that is all ages up to about twenty, after that they start to go off, perhaps because the poor things have such a hard life. From where I am, I can see scores of them working in the fields, one woman with a little child I went over and had quite a long yarn with, (she knew no English & I knew no French) I was making friends with the little child, and she asked me if I had any, so of course I showed her my little bunch, & she said they were \"bon\", she also said the war was \"non bon\".","11":" Another stage of a few miles & in a fine \nwould\n wood near Allonville, we are now only a few miles from the line & Amiens is behind us.\n\nWe are right in a beautiful green wood, every thing is as much out of sight as possible about here, under trees, etc, so as to be out of sight of Fritz aeroplanes, there has not been an hour today that there has not been one or more overhead, observing I suppose. As we came along today the guns were firing at three Fritzs overhead, and a piece of our own shells fell on one of our men, penetrating & breaking his wrist, & he is now for \"Blighty\" lucky beggar. I have often before told you of how beautiful the fields are with flowers, but the last few days in France has capped the lot. You know those red poppies that I always liked? Well you know how lovely a small patch of them is? They try to imagine acres of them so thick that they hide the green, & that is what I see every day. Also in places, lots of blue corn flowers but the poppies are the most brilliant\n\nat least 18 inches wider. We arrived here at about 1.30 A.M. and I was that tired & footsore I could hardly crawl, ( In fact I have been so on every march I have been on yet, so am thinking of throwing in the stripes & getting a job in the cookhouse or something.) I had a real good sleep & breakfasted in my dugout at 10 A.M. on rations I had carried, while Fritz shelled the ground in front of them, and I had never seen shells burst so close before, but when one burst about 20 yards directly in front of mine I lost interest in them & retired in to the dugout & shut the door. Later. We have been informed of why we are here, & what is going to happen tonight, or what is \nhoped\n \n\nwill happen. While we were all grouped round the O.C. getting the plan of events, Fritz was sending a few shells over, and I kept my eye on the old hands, and made up my mind not to duck my head unless they did, tho’ there was a great temptation to do so when one would whistle overhead, at what seemed a few inches, but was in reality a good few feet, after a while I could hear one coming and reckoned it must have been heading straight for us, everybody ducked, for which I was very glad anyway it passed over & burst about 30 yds away, I was very pleased that I overcame the wish to bolt in to a dugout, cos none of the N.C.O.’s are the least bit friendly\n\n& I can imagine how they would laugh if showed my real feelings you see they all came over here on privates pay, and don’t like the idea of us drawing Sgts pay right from the jump. Well I will tell you about the \"Stunt\" tomorrow.","12":" Now I will tell you about last night. The scheme was, our Batt was only here in case of need. The","13":" Brigade (4 Batts) were to do a \"hop-over\" as they call it here, that is to go over the top & take about a mile of a ridge that Fritz had, so as to make our position better, and we were in reserve in case of something unforseen happening to them. The Brigades on either flank were to raid Fritz on their front just to\n\nattract his attention and the guns on a three mile front were to put over a barrage, starting at 9.45 P.M. All we had to do was to wait ready to move at a moments notice. At the exact time, hundreds of guns opened fire at once, the noise here, & the concussion was beyond me to describe, what it must have been in poor Fritzs lines I can’t imagine until I go through it myself. He had been shelling us a bit up to then, but immediately left us alone, & I suppose, paid all his attention to our poor front line. After an hour of this bombardment a telephone message came through that all the position had been taken with very few casualties & we had taken 140 prisoners.\n\nThe Bombardment kept up about two more hours in case Fritz made a counter attack, but nothing happened, so all our guns stopped, and after a while, Fritz started to pay no a little attention & he pasted our position with shells, big & little, but never did the slightest damage, as we kept close in our little dugouts, so he would have had to lob one right on to a dug-out, which would be very difficult as they are just behind a high bank, but dirt, stones, & bits of shell were rattling down on top of them, & the concussion shook the whole earth, I lit a candle to read, but although closed\n\nin the dugout, the concussion used to put the candle out, While I am writing this, he is still sending over a few.\n","14":" We are now back near Amiens. We left those dugouts where we were in Supports, on the night of the","15":" (up in that area, all work & movements of troops, guns etc, has to be done at night in case Fritz manages to see them) & stayed in Reserves where I first joined the Battalion, until yesterday afternoon, when we marched a few miles, & then marched another couple of miles & here we are on a ridge overlooking Amiens, of which city you have no doubt read quite a lot about during and since the Germans big push about last March. At present I am on Guard over 11 deserters, right on the banks of the Somme River. Amiens is practically a deserted city, just a very few civilians, & French and\n\nAustralian Police, to keep the boys from collecting Souvenirs, (in other words, - looting). We can see the Cathedral from here, & I would very much like to go into the town, but believe it is barred, At intervals during the day and night, Fritz sends over into the city, over our heads, some very big shells, evidently from some big naval gun, they break up a few houses, but that is all it does towards winning the war for them. I hear that the French keep German prisoners in the Cathedral, so it had not been touched lately.\n","16":" We have only been on ordinary Camp routine at this camp. Our camp here is made by digging square holes about two feet deep and large enough to hold\n\nhold five or six men, which is then covered with a water proof sheet, and we crawl in at one corner, an so long as it doesn’t rain, they are all right. The idea of digging them a couple of feet deep is that if a bomb or shell drops in the camp, and men were lying down, they would not be hurt by bits of shell, etc, that is providing of course that it didn’t happen to drop \nright on\n a dug out, in that case of course that would be the end of that particular lot. Today was a hot day with a good few large clouds about, and I saw a good\n\nbit of work by a Fritz Plane. There were (and are everyday) a lot of captive baloons which are used by one or two men for observing, they are attached by a wire rope to a steam windlass, and they go up in the morning to any old height up to perhaps a thousand feet & they stop there until night, when they are wound down again, that is under ordinary circumstances. Today we were on parade and as I said, a beautiful bright day, with some large clouds floating about.\n\nSuddenly we heard \"Pip, Pip, Pip\" of a machine gun up in the sky, we looked up just in time to see a Fritz plane dive out of a cloud, going straight for the baloon, with his machine gun going, the baloon has no means of defence, so the observer just hopped out over the side with his parachute (they always have one in case of accidents) and almost at once the baloon burst into flames, and in about 25 sec’s was no more, the observer drifted slowly down to earth and Fritz dived back into the cloud again, followed by sundry shots from the earth.\n\nWas very glad to get some letters from home today, There are letters arrive here every day, and even in the front line, they come up every night with the rations, so that is very nice.","17":" Today is the third Anniversary of the day the","18":" Battalion left Sydney, and there are still a proportion of the original men left in it. This morning, the Colonel made us an address on what the Bn had done, both in Gallipoli & France, he only mentioned a few instances of things they had done, and there is no doubt it is a fine Battalion. This afternoon we were warned to be ready for the front line at any moment, to take over from another Battalion, the idea of warning every man is, that \nbefore\n a man\n\nis warned, if he goes away he is only absent without leave, if he goes off \nafter\n being warned, it is desertion. Then the whole Bn put in the rest of the afternoon at Sports, having all sorts of Sports for small Cash prizes. During the Sports, one of the captive baloons broke loose from its moorings, and as the wind was in Fritz’s direction, it sailed off in that direction, the observer jumped out & came down safely in his parashute, those fellows must have a nerve to climb out of the basket they are in, and let themselves go, if the parashute failed to open, that would be the end of them. At the end of the Sports they were going to have a race for men over\n\n40 years of age, I entered for it but as there was only 2 others, they cut the race out.\n","19":" This morning the Official Photographer took a group photo of the Officers of the Bn, also one of the N.C.O’s, (of which I was one) to be put on the walls of the War Museum in Sydney, when they have one, Later, some of our Coy, marched to a range to do some rifle practice. It was an interesting march, through the outskirts of Amiens, and saw quite a few houses that had been shelled or bombed, all houses, except those occupied by troops, or an off one by some civilian who was hanging on, were all barred up & locked up to keep out the\n\n\"Souviner Hunters\" and looked most desolate. We went to a range just fixed up temporarily and really in what appeared to be the moat, under the walls of an old fortress, The walls are 60, or 70 ft high, & built of small bricks, about half the size of ours, and large stones on the corners & here & there in the wall, I went through one of the gates, and found it was a small tunnel with a strong door at both ends. The tunnel is the width or thickness of the wall, and I measured that & found it just over 100 feet. On top of the wall were trees, & shrubs, the flowers of one I sent home, also some beautiful roses\n\nEverything as elsewhere in France, \nuncared for\n (or rather the parts evacuated by civilians) uncared for, because here it has to be recognised that there is a war on. not like Australia or even England. inside the walls was almost deserted except for a few French troops, and looked as though it had been used very little for military purposes, I should like to have had time to explore the old walls \nthrough\n thoroughly as there seemed to be lots of tunnels, etc, in them.","20":" Today had a chance to go in to Amiens, went with an escort to get some prisoners, (\nnot\n Germans) and passed quite close to the famous\n\nCathedral, but could not stop long enough to have a good look, the stonework in the building is most wonderful, and of course different to anything I have ever seen. It is hard luck that often I am quite close to famous places, and being on duty can’t get to see them. If I could have trusted my escort I would have left them for a little while, and had a look closer, but if I had left them, they would have got full of \"vin rouge\" or something, and that would have meant trouble for me. Amiens is by far the finest French city I have seen, but very much knocked about, and almost deserted. There are some fine buildings, the once fine Railway Station is ruined, one street is beautifully made, there\n\nbeing five roads, side by side each one being divided by a row of trees, the street must be at least twice as wide as martin place if not more, and runs right thro’ the city and at least one suburb named Rivery. I have just returned from a walk thro’ a village close by, Camon, it has a very old Church and a fine cemetary. I walked thro’ the latter, it has some very fine vaults, and a noticeable thing about the more ordinary peoples graves, was, in lots of cases, the photo of the person, in a weather proof glass case, more especially in the case of little children. I am not quite sure whether I think it is a nice idea or not.\n","21":" We moved forward again yesterday, and are in support trenches about 1000 yards behind the line. We are in twos, in small dugouts in the side of the trench. We left our other camp carrying everything military we possess, which is some outfit. At dinner time we were all sitting down just starting our dinner, when we heard the Lewis guns (like machine guns) going for all they were worth, they were firing at a Fritz plane, that had come down out of the clouds in our rear, and when I saw it, \nit was\n it was not more than a hundred feet above us, and travelling at a great rate, scores of Lewis guns firing at him, he came down about a half mile away, and I heard after, that he had done as quite a few have been doing lately, that is\n\ndeserted, and surrendered to us, it is the closest I have seen one of Fritzs planes, and had a real good view of it. We had to wait until after dark before we could come up here, & then we advanced in small parties, with some distance between, the latter ¼ of a mile or more, we just struck a part of the road where Fritz was putting up an evening \"Strafe\" and I was leading one party, and was not feeling quite as happy as I may have, but neither were the old hands behind me, anyway I just marched along as if I didn’t have \nhave\n cold creeps chasing one another up and down my spine, & Fritzs \"crunchers\" were kicking up an unearthly row all round us, but none fell very close to my party, tho’ one of the chaps who came over with me & \n\nwas in front of me, had his jaw badly shattered, and some where else on the road a shell got some transport killing four of our fellows, two of whom came over with me. We are just on the outskirts of a town (Villers-Bretoneaux) which has been taken & retaken 3 times. It is a big manufacturing place, and I have had a couple of walks thro’ it today, and there is not one house that is not completely wrecked, you have no idea from the photos of wrecked towns, what it really looks like, I was in a couple of woolen & clothing factories, and there are thousands of pounds worth of machinery smashed and the floors are 2 feet deep with wool & wool clothing. In some of the houses there is some lovely\n\nfurniture, nearly every bed is of wood, & much lower than ours, & the mattresses have spiral springs like a sofa, there are still numbers of large mirrors untouched, tho’ the roofs are down and lots of the walls shattered. Fritz still puts shells over in to the town on the off chance of getting some one. One thing I like about the French houses, almost every house has a fine cellar of brick. We don’t have much to do here when things are quiet, some fatigue work, and at present lots of time to sleep, we have our hot meals just the same as when we are miles back, except they have to be carried up from the kitchens which are some distance in rear.\n\nEvery Company has a travelling kitchen, and we usually get at least \ntwo\n one hot meal a day & hot tea three times a day. The travelling kitchens are a great idea. It is splendid the way our aeroplanes fly over Fritzs lines from early morning till late at night, sometimes as many as 40 or so go over in just the sector of front we can see, while so far, I have only seen three of his together, and I believe when there is a stunt on our fellows do splendid work with bombs and machine guns. And our Artillery too, they must send over 10 shells to every on Fritz sends us. Fritz sends over\n\nsudden bursts of shells during the day & night, our fellows do that too, but all day & night there is not five minutes that there is not the whistle of shells over head. Every night when we are shelled, we get gas shells in among the others, which is a great nuisance, as one \nmight\n sleep with just shells but when there is gas, it would be just certain death, and there are always men on guard to wake the others as soon as they smell gas. He always sends a gas over first that starts one sneezing and if one gets a few good\n\nwhiffs, it is almost impossible to keep the mask on then he mixes some poison gas with it, and that is why so many men get gassed, as one can’t wear the mask and sneeze violently at the same time. One good thing I have a pretty good sence of smell, so I get mine on pretty quick.","22":" This is Sunday, but it has only just struck me, as there is no difference in the days here. I went in to the town this afternoon & did a little souviniring on my own. Found some hundreds of new woolen sweaters in one of the clothing factories, so brought one away with me, also some postcards in somebody’s Album. I got a few and will send them home for the kiddies some day.\n","23":" \nLeft\n Since","24":" nothing of interest happened. Fatigues during the night, sleeping & resting during the day. Left the trenches about midnight on the","25":" and came about 5 miles back to a village named \"Glisy\" and occupied dugouts on the outskirts of it, and have done nothing since, but are expecting to go forward again tonight. The was to have been an attack this morning, to celebrate the American Independence Day, by the Aussies in the centre, French on our right & Americans on our left, about 3 o’clock there was\n\na great burst of Artillery fire, but we don’t know yet what has actually happened, tho’ there are some wild rumors about. A number of \"Tanks\" came past here this morning going back, as tho’ they had been in an attack. They are great lumbering things, and at a distance look like some prehistoric monster ambling along. They look as tho’ they would take some knocking out.\n","26":" left our home at Glisy last night at 7.30 P.M. and came right into the front line. I had \nheard\n what it feels like to be a Christmas tree, & now I know. We arrived at BN H.Q. were we where before going to Glisy, about midnight, and loaded up with a lot more dunage, in the way of ammunition, Trench stores, water, etc. We had a nightmare of a march from there right up to the front line, which had been advanced about 1000 yds a couple of days previously by the Brigade we relieved. We moved up along Communication trenches for some distance which were barely wide enough to let our load through, so it was a constant case of \"pulling\" all the time, then along our original front line, which was well supplied with obstacles in the way of loose wire, tins, lumps of earth, etc.\n\nthen into a newer & slightly narrower communication Trench, so it took some getting along, especially as the procession went either at a good fast amble or pulled up with a jerk, also every man must keep the one in front in sight or there was the danger of being lost in the different branch Trenchs then we went along what had been Fritzs original front line, it was slightly wider, but had numerous dug outs starting at the bottom of trench level, and going down I don’t know how deep, so the was always the added chance of falling down there. At last we arrived at our Company H.Q. (H.Q. is Headquarters) and there picked up our guides who were to guide us to our posts, and relieve the men of the other battalion. I remember Bruce Bairns father or someone said all guides were of two kinds, 1. the one who didn’t know where he was going & \nknew\n it, and 2. the one who didn’t know where he was going, & \ndoesn’t\n know it. Well our guide belonged to No. 2 class at first, and then admitted being in No.1.\n\nWe wandered round in No Mans Land, dragging all our stuff with us for I don’t know how long, then arrived back at Coy, H.Q. made another start and got left at a little hole in the ground while he went away to investigate, I waited a while & then went to look for Coy H.Q. to get someone else, & found it about 20 yds away when it should have been 200. Then got someone else who after circling round a bit landed us here, No. 5 Post, B Coy, which was a slit in the ground about 12 ft long & 18 inchs wide & 5 ft deed to hold 8 men, as we had also brought shovels & picks we had to at once start to enlarge. The outgoing Sgt told us Fritz was \"over there somewhere\" but did not know quite, and that we must be careful not to show ourselves during daylight. So in the little bit of remaining darkness we put two men on to keep an eye on Fritz, and the rest started to lengthen the trench so as to hold us all, and\n\nif possible allow of some as lying down in the day as that is the only possible time to sleep here, and as a result all but one who has to be on watch can sleep in a hunched up position, in a trench wide enough to lie on the side, but not on the back, & here we sleep and eat, (or try to) from 4 A.M. to about 10 P.M. when we will set to to improve our position for tomorrow. About 3.3.A.M. the rival artillery exchanged compliments, that is for nearly an hour, Fritz bombarded our Infantry with \"Whiz-bangs\" & \"Coal boxs\" and I suppose our guns did the same to \nhis\n Infantry, fortunately none of his landed too close to us. So now I am in the far famed \"front line\", in front of Villers Bretoneaux, in the distance in rear the ruins of Villers Bretoneaux, in the distance in front the ruins of some big \"Hangars:\" for balloons or aeroplanes which were once British, all I can hear are the constant\n\nwhistle of shells passing both ways overhead, the bullets whispering past, & high up in the sky are the Skylarks singing as happily as tho’ there was no war.\n","27":" Last night we moved back into the old German Trench, another Coy taking over the outpost line, each night we moved forward, and dug in some new Posts more advanced, we have no idea where Fritz’s front line is, but suppose it is a thousand yards back, but he also has posts out in front. He also does not know where we are I suppose. The other Coy has taken over our advanced Posts & now we are to go out at night and connect the Posts with Trenches thus making a new front line. Each night he shells our working party with more or less result, one man of my Platoon was killed on the night of the","28":" On the whole of his line, Fritz keeps up a constant succession of flares, making all No Mans Land brighter than the brightest moonlight night, and\n\nif he sees a working or fatigue party, he immediately shells them, also he has machine guns posted, probably along way back, which at intervals he turns on just on the off chance of getting someone, and they are responsible for more casualties than the shells, as he has them laid so as to sweep say, the parapet of his old trench, or some patch in No Mans Land. Last night an American who just came up to have a look at things, was killed by one. Fritz keeps up a constant succession of Flares, some of which are very beautiful & are different signals that he has. The plain white ones are for light, then he has red, green, and orange, some in singles, some in two & threes, some burst into bunches of separate lights. So far I have not seen a light fired from our lines, there is no need to. In Fritzs trench there \nare\n is naturally, lots of his gear lying about, Rifles Ammunition, Clothing & private stuff. It had all been gone over for Souvenirs by the Aussies\n\nwho took the trench, except that one lucky person in our Coy found an \"Iron Cross\" of Silver & iron, and it would have made a splendid brooch, It is very seldom they are brought into the front line. There were lots of other stuff that would have \nmade\n been very interesting if one could get it home, but there is no chance of carrying it out. On top of the trench there are also some sights that were neither nice nor even interesting, in the way of dead Germans. In the trench were some German graves, of men who had been killed there, it is rather a strange idea of burying them in the trench, and some of them none too deep at that. It was nice for a change for them to have their dugouts to sleep in instead of a little narrow trench, especially as it started drizzling showers of rain and has been ever since.","29":" On the night of the","30":" we moved out a bit further back, neared to Villers Bretoneaux, in the same dugouts as we were a couple of weeks\n\nago. The routine is the same, as usual, we go up Communications trenches to the front line, & dig most of the night to the accompaniment of more or less shells & bullets, and then back to our dugouts for the day. My platoon has had three men wounded by bullets out on the job, & have gone back to Blighty, also some very narrow escapes even back here where we are. While here we can have a little more freedom of movement, also have a wash, etc.","31":" On the night of the","32":" we moved up & took over the front line, it was a most unpleasant march, in fact the men said it was \nworse\n than that. We left about 10 o’clock, & there were about 4000 yds to go via C.T’s (communication trench) there had been a heavy thunderstorm just before, & the whole of the trench was on an average about ankle deep in water, by the time a hundred or so men had filed thro’ them, they were a nice & slippery & muddy condition. It is awfully sticky stuff, the least touch & it sticks fast, as the sides of the trenches were in a good sticky condition\n\nYou may imagine what we looked like when we arrived at our new home, after lurching from side to side. Where the side had slipped in, or a shell had filled the trench, we crawled over the obstruction on our hands & knees as it was far too slippery to walk over. Then when we reached the limit to the C.T. we went over the top, and what a relief it was, as it was not nearly so muddy, the only drawback was that Fritz was particularly energetic with the use of his lights & machine guns, it was not to be wondered at, as an hour or so earlier, one of our battalions had moved up a few hundred yards, and occupied some of his posts. Fritz has no continous trench here abouts, all little posts dotted about, and I don’t know how far away his first trench is. In crossing the open to our posts he kept up almost continous flares and as every time a flare went up, every man stops as if petrified, some just crouching, others on hands & knees, some going flat out. (I wasn’t game to get down too low. I was so tired I was afraid I should not be able to get\n\nup again) you can imagine that it took a long time to go a little distance. I think it is marvelous that we only had one casualty, one poor chap of ours being killed. When at long last we reached the post we were glad to drop into the muddy trench and unload some of our stuff, the outgoing men told us of machine guns & snipers just out in front, and there is no doubt they were busy. Our fellows soon got busy they got an idea by sound where the Fritz machine gun was & every time he rattled a few shots at us they rattled a few at him, and it must have been to some purpose, as he soon shut up, & early next morning some Fritz stretcher bearers came to their post under a white flag, and took away one man on a stretcher, two walked away with them heads bandaged & one with his arm in a sling, since then their gun has been very quiet. Last night \nthey\n our fellows picked on the nearest Fritz flare post, & every time a flare was fired, our fellows rattled half a dozen shots on the direction of the post, so they soon quietened down too.\n\nThe whole of our Platoon was in this position but about midnight last night I had to occupy our present post, which we are holding with 7 men & one gun, and things are very quiet just at present, and our post is just like the one I was in 10 days ago. The one I have just left was a German post, with a good lot of stuff of theirs about, and a couple of dugouts started that were evidently meant to be very deep & big, but they did not have a chance of finishing them.","33":" We were relieved from our posts last night and back moved into the front line. Mr Williams took over the posts occupied by our Platoon. Sgt Galland (who came over with us from Aussie) took over my post. Fritz’s Artillery was very active this morning, and shelled very heavily, especially with Gas, we thought he must have been going to have a \"hop-over\", and were \"standing to\" most of the night expecting him, but nothing happened, he must have thought \nwe\n were going over, and was trying to get in ahead of us.","34":" Last night \n\nMr Williams & three others were wounded on his post, and Sgt Galland & one other on the post I was relieved from. We are going back another stage tonight. I am out in advance taking over our platoons Trench. Things are quiet, except that Fritz has a \"mad minute\" now & again with his guns. We hear good news from different places on the front, and things are looking much brighter (for umpteenth time since the War started)\n","35":" Have had three days quiet here, about 1000 yds behind the line, a few shells now and again, to keep us from feeling lonely. Saw here the narrowest escape I have seen so far, a shell came in at the end of a tiny dugout where a man was sleeping, blew his equipment to small shreds, smashed his rifle, tin hat, & sundries to bits, and all he got out of it was shell shock. \nTonight we are to go up forward again and\n there are rumors & rumors as to what we are going to do. I suppose we will find out in time\n","36":" Two days ago we had a number of Americans attached to us, some to each platoon, for them to get a little experience. They seem a very decent lot, and they and our fellows get along very well together. I think they are only with us for a week or so. It sounds funny to me to here them talk, I have a job to understand some of them, especially the way they pronounce some of the words. There is no doubt there is a mixture of dialects & languages spoken here by all the different nations in arms. Of course as you very likely know, for a long time there have been many thousands of American troops mixed through the French, British and Australian troops, getting a little actual experience before going on their own, and there is no doubt they are very keen. Last night we moved up from our position in the old British front line, and took over advanced posts. I have one with 10 men & one Lewis Gun three of the men are Americans. The post is an old one of Fritz but there is not much of his stuff here, he evidently left it\n\nin his own time instead of being put out, so took most of his stuff away.","37":" We advanced our Post slightly last night to one we have been digging the last two nights. This morning just at dawn, Fritz put over first, a heavy barrage of trench mortars bombs & shells. The first shell lobbed a few yards away from me, none of the others came so near, then came some gas, then a smoke cloud, which was so dense that I could not see five yards. We all thought he must be sure to come over, and I was quite expecting to have my first real fight it was quite exciting, we were all standing there, our heads over the parapet, rifle loaded, bayonet fixed, 100 rounds of ammunition at our right hand, a few bombs with the safety pin loosened, ready, peering out in front, & trying to see a sigh of Fritz before he got too close, and he never came. We must have been an hour waiting there, then the bombardment ceased, the gas drifted away & the sun came up & since then has been a Sabbath calm & one can hardly imagine there is a war on. No one was hurt\n\non my post, but on adjoining posts, one American was wounded and two Americans killed, that is all I have heard of so far.\n","38":" We were relieved last night and came back several miles close to a village.\n\n"}}