{"Document Name":{"0":"Diary_0087","1":"Diary_0087","2":"Diary_0087","3":"Diary_0087","4":"Diary_0087","5":"Diary_0087","6":"Diary_0087","7":"Diary_0087","8":"Diary_0087","9":"Diary_0087","10":"Diary_0087","11":"Diary_0087","12":"Diary_0087","13":"Diary_0087","14":"Diary_0087","15":"Diary_0087","16":"Diary_0087","17":"Diary_0087","18":"Diary_0087","19":"Diary_0087","20":"Diary_0087","21":"Diary_0087","22":"Diary_0087","23":"Diary_0087","24":"Diary_0087","25":"Diary_0087","26":"Diary_0087","27":"Diary_0087","28":"Diary_0087","29":"Diary_0087","30":"Diary_0087","31":"Diary_0087","32":"Diary_0087","33":"Diary_0087","34":"Diary_0087","35":"Diary_0087","36":"Diary_0087","37":"Diary_0087","38":"Diary_0087","39":"Diary_0087","40":"Diary_0087","41":"Diary_0087","42":"Diary_0087","43":"Diary_0087","44":"Diary_0087","45":"Diary_0087","46":"Diary_0087","47":"Diary_0087","48":"Diary_0087","49":"Diary_0087","50":"Diary_0087","51":"Diary_0087","52":"Diary_0087","53":"Diary_0087","54":"Diary_0087","55":"Diary_0087","56":"Diary_0087","57":"Diary_0087"},"Date":{"0":"unknown","1":1476.0,"2":1477.0,"3":1481.0,"4":1483.0,"5":1484.0,"6":1485.0,"7":1488.0,"8":1489.0,"9":1490.0,"10":1494.0,"11":1495.0,"12":1496.0,"13":1497.0,"14":1498.0,"15":1499.0,"16":1500.0,"17":1501.0,"18":1502.0,"19":1503.0,"20":1505.0,"21":1509.0,"22":1510.0,"23":1540.0,"24":1544.0,"25":1545.0,"26":1546.0,"27":1547.0,"28":1548.0,"29":1552.0,"30":1553.0,"31":1554.0,"32":1555.0,"33":1556.0,"34":1557.0,"35":1559.0,"36":1560.0,"37":1561.0,"38":1562.0,"39":1563.0,"40":1564.0,"41":1570.0,"42":1571.0,"43":1572.0,"44":1578.0,"45":1595.0,"46":1596.0,"47":1597.0,"48":1598.0,"49":1604.0,"50":1605.0,"51":1606.0,"52":1610.0,"53":1628.0,"54":1629.0,"55":1633.0,"56":1647.0,"57":1650.0},"Entry":{"0":"\n\nsome had Wooden Crosses others had pieces of Wood, & here & there were the poor fellows Steel Helmet placed \non the\n at the head, one Tomestone was made out of a Rifle, the Muzzle was placed in the ground & a piece of wood put through the opening where the Magazine goes making the Rifle the shape of a Cross. The Ground all about is terribly knocked about, big holes everywhere, & along the Vehicle Road I could see pieces of Transport wagons lying alongside in several places. There are troops camped all about living in Dug Outs covered over with Elephant Iron \nwhit\n Sand Bags. As we proceeded along we crossed the Steinbeck River which is about 8 ft wide which was all frozen up, a little further along we came to the head of the line, where the Gun is placed. We only stopped a few moments & off again, as Fritz shells this place very bad. This gun is placed right behind a Disabled Taub which was stuck in the Mud & had the front portion blown away, This taub makes a splendid protection for the 12 inch Gun, we came back again & at 3 Pm had to return for the Empty Tracks, this time our Officer Commanding our own Detached Corp came up with me for a run, we made a good run there & back & at 4 Pm I was\n\nrelieved. \nAs\n\n","1":" \nwas the day I\n When I was relieved at 4 Pm, & it being my long shift off I decided to take a run over to see my brother at Steinwerck, so after dressing & having my Tea, I tried to get a ride by Train into Peselhoek to the Main Camp but, there were none going down, so after receiving my Pass & Movement Order, I went over to the Crossing alongside of the Reigersberg-Chateau to try & get a lift by Motor Transport, & after waiting a little while along came a Waggon, I asked the Driver where he was going & he said into Poperinghe so he gave me a lift. As the night was very clear, Fritz was over with his Gotha’s bombing all over the place. I could hear the explosions everywhere. On going along the road near Breileu, I could hear Fritz bombing the Camps, the same on going through Flamingtinghe, he also was bombing in the Vicinity. As I had saved my Rum Issue all the week & the night was very cold & frosty, the Driver & myself had two nips along the road, I asked him what part of Poperinghe he was going to & he said up to the R. E Dump at Peselhoek which was just into my hands so I got a ride almost to the Main Depot where I \n\narrived there at 7.30 Pm. I found my two chums at home in my Hut & they had a nice fire going & the hut was very warm. After having a chat for a while, I went into another hut to see another Pall who was bad with Cramps, I made some Coffee & put all the Rum I had left in it & him & I had a nice hot drink. After having a chat with him I went back to my hut, where my two chums were having Supper of Toast & Cocoa, so I joined them & had a drop, one of the chaps was on the Shunter at Midnight so I turned into his bed & had a good sleep. The hut was very warm all night, outside it was freezing. As my Train left Poperinghe at\n\n9.27 am, I got up at 7.30 am & after having breakfast, I left the Camp at 8.15 am & walked into The Town. As it was bitterly cold I put on my Balaclava under my Big Hat, to keep my neck & ears warm, the frost gives my ears what Oh. I arrived in Town at 9. am & went into see my Lady-Friend to have a Cup of Coffee with her. I found her well & had just came home from Church, she wondered what had become of me as I had not seen her for a month. I am stationed to far away to get into town very often. After saying good bye I walked along to the Station where I produced my Movement\n\norder & obtained a fresh one from the Railway Transport Office & soon was aboard the Train. There were only a few lads in the Compartment when we left at 9.27 on Time but when we arrived at Abeele the compartment soon filled up, we made a good run to Hazebruick when I detrained & reported myself to the R.T.O. at 11.am & was told to report at 3.30 Pm as my Train for Steinwerck would leave at 3.55 Pm. I decided to go for a stroll until Dinner Time, I went along to find the place where I had previously a very good dinner. After making inquiries at a house I was directed to No 64 in the Street facing the Railway Line. I had forgotten the number when I was there last, but soon was in the right place, The Lady remembered me & I ordered a hot dinner for 1 Pm & in the meantime I took a stroll through the streets as the Lady told me that they had been bombarded lately. The first shop damage I came across was a Paint & Paper Shop, the Shell came through the Roof & through the top floor & ground floor & exploded in the Cellar blowing the Paint Tins Paper & Furniture all up in the air making an awful mess, everything was mixed up with Timber\n\nFurniture & Brick & Mortor. On my travels I saw a lot of houses blown in, Furniture Beds & Bedding & Timber all mixed together, A Beautiful Church had a narrow escape as a large house about 20 yards away was terribly knocked about. An Estaminet on the Corner of the street had been hit & the shell had exploded upstairs & the fragments of shell had come down in the Saloon & the Cushion Seats \n& Glass\n & Chairs & Tables had been riddled also Wine Bottles on the shelves had been broken & everything had been left & nothing had been removed. I made by way back to the Café for my Dinner & received a splendid Meal for 3 Franc’s, I received Soup Roast Mutton, Potatoes, \nSoup\n Bread & Butter, two Cups of Tea, a Glass of Wine & a large Pear as a desert. I thoroughly enjoyed the dinner. After thanking the Lady or Madame, I went along & was told by a Traffic Man that I could get a Motor Ride to Steinwerck so as it was 2 Pm I decided to go by Motor instead of waiting for the Train, A Motor Lorry came along who was going to Bailleau about 4 kilos from Steinwerck & obtained a seat next to the Driver, As the weather was very cold in fact freezing I buttoned up my Big Coat & made myself comfort\n\nable as possible, I thoroughly enjoyed my ride through several Towns, the first I passed was Borre, then Strazeele, the Bailleau. The Roads are all \ncobbled\n made of Cobble stones & splendid to ride over, I saw French Boys & Girls skating on the Ice in several places, where the water holes were frozen. Borre is only a small village, but Strazeele was a fair size place, & Bailleau was a large \ncity\n Town & is full of Australian Troops. On arrival in the Square I got off the Lorry after thanking the Driver & walked along the Steinwerck Road down hill when along came an Australian Motor Lorry No 3 Division & the Driver gave me a lift right into Steinwerck arriving there at 3-15 Pm. I made straight for the Motor Workshops & found my Brother busy fixing up electric lights on the stage & in the hall of their Recreation Room. He did not expect me although I wrote him a letter 10 days before telling him of my intended visit but he never received it. As he was very busy I sat by the Store until he finished at 5 Pm, when we went over to the Cookhouse for Tea which consisted of Bread & Cheese & Jam & a Pot of Tea. After Tea I went back with him to the Hall as he had to finish the wiring\n\nof the Lights. His company were going to have a grand Christmas Day Dinner at 5 Pm & a concert at Night, he wanted me to remain but I could not as I had to return next day. While he was working on the Stage Lights, his chums had a sing song at the \nPiano\n Organ which one of the boys could play well. I joined in the Singing until 8 Pm when the boys all retired to their billets. I went with my brother & his chums to their Billet, they are both very comfortable. They have a Room on the","2":" Floor & a Double Bed each. After having supper of Bread & Butter & \nChips\n Potato Chips & a Glass of Ale downstairs I turned in. The People of the house are very nice to the boys, they are a married couple with 3 little children, one boy & two girls. The Husband had been discharged from Active Service, he having been wounded in the back. The boys pay 3 ½ Franc’s per week each for the Rooms & supper. I slept with my brother in his Double Bed & it was glorious, & I never woke until 7 am next morning, after a good night’s rest. After Breakfast I went for a stroll to the Station to find out what time the Train left to connect with the 4.36 Pm Hazebruick to Poperinghe. They informed that the only Train\n\nleft at 11-am so I had to return at once & say Good Bye to my brother & his chum. I expected that a Train would leave at about 3 Pm but there were none, so after saying Good Bye I came back to the Station at 10-45 am, for some reason the Train did not start from the Station, but about 50 yards down the Line. I came to the conclusion that the reason was that Fritz knew the range of the station, he could easily shell the Train. The Train was fairly well crowded with Australians who were going on Blighty Leave & it left on Time, & on arrival at Bailleau a lot more Ausies joined it & a good run was made into Hazebruick arriving there at Midday, I went \nback\n along to the Café & waited until dinner was ready at 1 Pm when I had another splendid Dinner for 3 Franc’s. I stayed there until about 2 Pm when I went along to the Y.M.C.A. at the Station to leave my Valice there & then I went for a stroll until 4 Pm. I bought two presents for my Sister & her Daughter in Bognor Sussexx, one was a Pale Blue Silk Scarf & a Silver Brooch with the Epres Coat of Arms on it, also a few pretty Post Cards, & then I joined the Train \n\n& left at 4-36 Pm & after a good run arrived in Poperinghe at 6 Pm. After making inquiries at the Control about a Train to Regersberg, they informed me that none would leave for some time, I decided to walk if I could not get a lift anyhow after going along the road for about a mile along came a Motor Transport & I climbed up behind. The Driver said he was going to Eypres so I was alright for a lift. The distance to Eypres is about 9 miles from Poperinghe, \nwhen\n. The Transport was full of Boys going back to Camp & after a somewhat rough ride I left the Lorry at the Reigersberg Railway Crossing & in a few minutes was back in Camp. I signed on at Midnight & during the Night Snow & sleet began to fall & \nalthough I\n when I was relieved at 8 am everything was covered with snow to about 3” in thickness, to a New chum it looked a beautiful sight all the Tents, Huts & Dug Outs covered over with snow. When the Sun rose it made everything Glitter several of our boys amused themselves with snow balling each other.\n","3":" Dec 25\/1917. I laid down at 10am for a couple of hours rest & was woke up at 12.30 Pm\n\nfor my Christmas Dinner. On going outside of my Hut & it was a glorius sight, it was snowing heavy & I was very interested. Everything was quiet & the Birds were flittering to & fro amongst the bushes, altogether it was a sight, I had often seen on Paintings, but not in reality. I took my Plate & Mess Tin over to the Cookhouse & while we were standing outside awaiting our turn the Snow was falling very thick I had not long to wait when my turn came & I received a nice piece of Roast Pork & Potatoe4s, & Plum Pudding & a Cup of Tea, which I enjoyed. I then laid down again until Tea Time when I had the usual Tea with some Christmas Cake sent to me by my Sister in Blighty. All day long the Guns were almost silent only now & again one would go off, both sides respected the Day. After Midnight things began to liven up a bit, I turned to again at Midnight but slept nearly all night in the Dug Out as there was nothing to do. On Boxing Day things were quiet until after Tea when a Terrific Bombardment took place for about 2 hours. It was an awful noise, both sides were making up for Christmas day, some said that Fritz was trying to take some of \n\nthe Passhandaele Ridge back again, & some say our boys went over the top, which is right up to now I \ndon’t say\n cannot say, anyhow both sides quietened down in the night. \n","4":" at Sunrise. This morning it was a glorius sight, the sun coming up behind the Ruins of Eypres, & it was a Dark Red colour, with a wide red stripe above a blue background & the White Snow on the ground making a most beautiful picture, the Old Cloth Hall of Eypres covered over with snow standing out very prominent in the forgound with it’s broken Walls. I forgot to mention when I signed on at Midnight \nthe Moon was in its\n the Full Moon was up making the place very light & one could see dark moving figures a long was off walking about in the Snow it was another beautiful sight it was almost like day. Night’s like these are glorius to be out in & to an Australian it is something never to be forgotten. ","5":" 27\/1917\n\nFrom ","6":"\n","7":" until New Years Day the weather was very cold & misty which caused things in general to be very quiet. As no Observations Balloons were up all the week very little fireing\n\nwas indulged in, only now & again a Gun would fire or a shell from Fritz would come over. As I worked a shift on Christmas Day I was given New Years day off until next Day at 16 oclock (4 Pm). I obtained a Pass in the morning for Poperinghe & as there were a light Engine going into Peselhoek at 11-20 am I got a lift by it. On arrival at Arrival Farm \n a few mide\n about 1 mile from here, instructions were issued to the Guard on the Engine to Proceed into P.A. Siding a little further down to pick up any empty Trucks. This Siding has a large Ammunition Dump alongside & it receives a large amount of Bombing & Shelling at times, the British West India Boys do all the unloading of shells & they don’t worry the Driver not half for Coal, permission was given to two to fill their Sand bags & soon the Tender was alive with Niggers, the Driver soon had to stop them or they would have seen emptied the Tender. On coming out of the Siding I was shown a Nessian Hut which a Bomb dropped by Fritz the night before had hit the Hut right in the centre & made a complete wreck of the Hut, killing 5 soldiers who were inside at the time. A little further down I saw a Baru which also had been hit the night \n\nbefore & had all the Roof blown in & one side blown out, there were nobody inside at the time. After making a good run I arrived in Peselhoek for Dinner. My luck was in as they were having a splendid Dinner which I soon obtained some. On handing in a plate & mess tin I received some Roast Beef & Potatoes also Plum Pudding & Rum Sauce which was just A.1. I thoroughly enjoyed it & after a little while I made my way into Poperinghe. As there were no Motor Wagons going in I had to walk the 1 ½ miles & arrived there at 8 Pm. I went along to my Belgian Friends to wish them A Happy New Year & found them all well, the Young Lady there made me a splendid Cup of Coffee & I was invited to stop & have Tea with them. After having a chat with the young Lady & her brother Tea was served at 4 Pm, I had some boiled Pork & Bread & Butter & some Belgian Milk Bread which was very nice also instead of Cocoa I had two cups of Chocolate. I take off my hat to the Belgian & French People for their Cooking, the Chocolate was delicious & I thoroughly enjoyed it. My chum came in after me & arrived at the house at 4-30 Pm & he also was invited to Tea which he enjoyed, we both remained\n\nthere until 5-15 Pm when we said Good Bye & both went along to the Tivoli Theatre & had to take our turn outside, forming up two deep on the footpath. At 5-30 Pm the Doors opened & in we went, they charged us 50 cents each (5d) & we both got a good seat in the Gallery. At 6 Pm the Orchestra opened with a March played by a Brass Band of 26 players & it was a great treat to listen to. They received a good cheer after they had finished. By this time the House was packed & a first Class show was put on. There were several good singers & they all received an encore. One turn was a knock out. The Artist was dressed as a clown & he had several Dummy Instruments & made the sound by his mouth, the first was a Banjo Selections & he would play on imaginary strings for a while & then he would scratch his leg, all the time the Banjo would appear to be playing. When the boys found out that he was making the sound by his mouth, it caused a great laughter. The Violin & Whistle, likewise also brought down the house, & the Artist was encored several times. This turn was the best imitation of Musical Instruments I have ever seen. The show did not finish until 8-15 Pm so we could not have our usual glass of ale going home.\n\nAnyhow my Chum availed himself of an Invitation to the B.W.I. Sergeants Mess along the Road home & he & I went inside & found the N.C.O’s having a Sing Song which they soon invited us to join in. There were plenty of Ale & Cigarettes also Bread & Cheese. Went remained there until 10 Pm joining in the Choruses & having several drinks. After thanking them for their kindness we both wished them all, A Happy New Year, we made our way back to Camp & I made myself a Bed on the floor. Our Quarter Master gave me two Rugs to keep myself warm & I laid down alonside of the fire & had a grand sleep.\n","8":" As my return train did not leave Peselhoek until 1-30 Pm. I passed the morning away in chatting here & there with Friends in Camp & at 1-30 Pm I started on my return journey to Regersberg to my Camp arriving there at 2.30 Pm & started work at 4 Pm at St Jeau & had a very quiet shift doing very little.\n","9":" This day was glorius. The Sun shining all day and there were no clouds about & the Air was very clear. Our Observation Balloons were up early & soon the Atmosphere was very Electrical \n\nFritz was putting shrapnel over everywhere trying to hit the balloons. After a Shrapnel shell would burst down would come the Nose Cap with a Whiz & I could hear pieces of shell striking Huts all about. As a balloon was nearly overhead, we received a lively time in Camp. Our luck was in & nobody was hit. After I signed on at 4 Pm & the sun had set, the balloons all came down & things were quiet for a while. At about 5-30 Fritz came over on a Bombing expedition. I was on my Engine up at St Jeau & we all had an anxious time as there were several machines over & bombs were dropping round about, but none came down in the yard. I could hear the Explosions along the Canal & towards Regersberg. Fritz was about for over an hour & then they all cleared out & we had peace for the rest of the shift. When I arrived back to Camp my hut Mates told me that a Bomb exploded close handy & the Mud & pieces of Bomb had struck the hut but did not penetrate, as we have the Huts well sandbagged around the sides up to about 4 ft we are fairly well protected from Bombs & only a direct hit would do us any harm. \n","10":"\n\nThis is my day shift from 8 am until 4 Pm all the week & we are kept fairly busy banking Trains from St Jeau to Wieltje, several Troop Trains are in & out during the day & we have to pilot them to Wieltje. It is surprising the number of troops move backwards & forwards, Battalions relieving one & another.\n","11":" 8\/1\/18, I did about the same work as on Monday & nothing of interest happened, I was notified of finishing duty at 4 Pm (16 oclock) that I would be off duty on Wednesday all day so I decided to take a run into Poperinghe to do some shopping & visit the Tivoli in the evening. So on","12":" I asked the Sergeant Major for a leave Pass. He informed me that owing to the Engine 2764 which I was on the day previous had run short of water in the Evening & had failed & that the Water Pipes in the Overhead Taut had frozen, the Eng had to be stabled in the No 13 Siding at Regersberg. In all probability I would be required by the O.C. in Charge to give an explanation, why I did not fill my Tender before handing Eng over to my relief. I therefore had to remain in camp all day & then I was not required. I had to therefore amuse myself the best way I could \nthere\n. I was laying down on my Stretcher at about 12 noon when I heard a Terrific Explosion which shook the\n\nHut very much. I did not take much notice as I thought that a Big Gun had come up the Line & had fired a shot, which they often do, but when the Engines came down at 4 Pm for relief, one Driver told me that a Terrible Explosion had occurred at the Zouave Salvage Dump & had killed about 50 men & injured about 100 & that they had an exciting experience putting out fires with water from the Tender & prevented any further explosions taking place. There were great excitement in Camp all the Evening discussion the Explosion. \n","13":" 10\/1\/18, I signed on at 8 am & went up to St Jeau Yard & did some work & then I had an oppertunity of going over & viewing the siding where the Explosion occurred, Zouave Siding is about 100 yds from the yard & had first been used as an Ammunition Dump but latterly part of the siding is used as a Royal Engineers Park for storing material & the other part as a Salvage Dump for all kinds of damaged shells & bombs. There are two roads running paralel about 15 yds apart, & between these roads was were the Explosion took place. On approaching the Siding I was horrified to see pieces of flesh & clothing laying about everywhere & lumps of Mud laying about, right between the two sets of Rails. There were two large Craters, one about 30 ft\n\nacross & about 8 ft Deep with pieces of shell cases laying in the bottom, three Trucks of Shells were actually riddled with holes & pieces of Flesh hanging to the wood work, & on the ground near by I saw a large number of bodies of poor fellows rolled up in Blankets & on Stretchers. These poor lads were so much blown about that there were pieces & absolutely unrecognizable. There were shells blown about everywhere & if it was not for the Sand Bag Mounds between stacks of shells the Explosion would have been worse. An Engine of the Light Railways standing a little distance away had the Glass Windows smashed but the crew we unhurt. A large number of men were unloading Mine Earth out of Trucks & several were killed outright by concussion & not a scratch on them & others were injured. The poor lads who were actually unloading the shells out of the Trucks, they were never found as they received the full force of the explosion. This working party had only started there in the morning for the first shift & out of the Coy only about 50 answered the Roll Call in the Evening. There are difference of opinion as to how the explosion occurred, some say that a Fritz Aeroplane was being chased over head by several of our Machines & he had dropped a Bomb & struck the Heap of Shells & others say a Motor Car Wheel had struck a nose\n\ncap of a shell, any how it is hard to say what was the real cause only it was a very regrettable incident & very sad, & I trust that it will not be my lot to witness such a scene. As there were not much to do I finished at 4 Pm. \n","14":" &","15":" was also quiet, with the exception that I was relieved at 2 Pm (14 oclock) at the same time the Paymaster arrived & paid all hands. I walked back to camp & cleaned myself & dressed & had some Tea when another chum & myself caught a Troop Train & went into Poperinghe & later on to St Omer for 2 days leave. As it was my long shift off I intended to have another good time away. On arriving in Town at 5 Pm Saturday we both went along to the Tivoli Theatre & reserved a seat & at 5-30 we both went in & got a comfortable seat & at 6 pm the Variety show started to a packed house. It was a very poor show & badly managed & after a while the boys started to go out. Anyhow as we both had plenty of time we stayed till the finish, the Singing & Acting was very poor & not worth mentioning. It was over at 8 Pm & we just managed to get a drink in an Estaminet nearby & then we both went along to the Y.M.C.A. opposite the station to put in time until the Train left after Midnight\n\nas usual. The building was filled with lads going on leave, they were laying about everywhere, some having Cocoa & Biscuits others amusing themselves at the Piano, which was very much out of repair. I had a Tune myself, but soon stopped as several notes were silent. We both chatted & amused ourselves passing the time away. One New Zealand Boy told me he had been robbed of his Kit which contained some valuable soveniers, it appears he placed his Rifle & Kit outside against a Post while he went inside & had some Cocoa & when he returned the Kit was missing & only the Rifle remained. It took my electric Torch & went with him to have a look around to see if it was taken by mistake but after searching over alongside the Station & in the vicinity we could not locate it. I felt sorry for him but he was very foolish leaving it outside. When the Train arrived after Midnight we both got into a 2nd Class compartment & the Train left to time. I was very tired & it was not very cold I soon fell asleep & awoke up at Borre & as the Train approached St. Omer I again awoke & the train stopped outside of the Station. I waited until it pulled in, but as it was a very long train I was mistaken, & as my Chum was going to Calai I was leaving him here, when\n\nthe Train started through the Station, I knew that I should have got out before so I opened the door before she had much speed up & hopped out, at the same time saying Good bye to my Chum, I made my way into the R.T.O. Office where several boys were resting & as it was 4 am I made myself comfortable & laid down & had a sleep until 7 am when off I went into the Town for Breakfast.\n","16":" I walked along the Main Street, from the Station which is a fine \nStation\n Building & has an imposing appearance & up under the clock is written in large Cement figures (Chemin De For Du Nord) meaning Road of Iron the North & it faces the Canal which has a bridge over it & stream launches on either side. The Church Arm Hut is on your left inside an enclosure which is well patronised, I went along the Main Narrow street for some distance when I saw a large number of German Prisoners coming from their Weekly Bath & they all looked well in the Grey Uniform & were well fed & looked contented. Their N.C.O’s marched in the lead & the Armed guard in front & rear & on both sides. They do not work on Sundays, it is their day to have a bath & Clean up. Their compound, opposite the entrance to the Bath\n\nhouses & over a Canal Bridge I noticed a Restaurant where several lads were having Breakfast so I went inside & had some Fried Eggs & Chip Potatoes & Bread & Butter & a Cup of Coffee which I put some Rum in \n& some Bread & Butter\n to give it some life which I paid 2 francs for which was nicely served & I enjoyed. I then went in next door to a (Couffier) a French Hair Dresser & had a shave & Hair Cut also a good Wash & cleaned me boots & leggings & a brush up which I paid 1 franc for, then I continued on my journey. The centre of the City is on a Hill when you come into a \nsmall square\n wide street where I was directed by a Military Policeman to good quarters for the night. I went in to the Place which was a Café & paid 6 Franc’s for a Bed & Breakfast so I made myself secure for the Night. The Weather was fairly cold & the ground was hard & frosty. As I intended to visit the famous Notre Darme, a Famous Cathedral I went along just before 10 am & met the Verger who showed me the way inside, & I soon had my eyes opened. This Cathedral is a magnificient Building part of it was built so I was informed in the","17":" & 15th Century. The figures & carvings were a work of art inside it is built in the shape of a Cross, in the \n\nCentre is were the Priest says the Prayers & on one side & close to the Wall is a beautiful scene called Christ on Calvry. It is got up well there is a Life Size figure of Christ on the Cross & there are two Female figures one is St Veronica & the other is Mary Magolene like is life size, & pieces of crumpled dark Brown paper to represent the stones. On the opposite side is Christ in the Manger, you see the baby form of the Savour laying in a little case & Mary on one side & the Wise Men of the East all kneeling down all in Miniature Size & a Straw Roof overhead also Crumpled Brown Paper on both sides & in the background the whole lot making a grand scene. The Interior of the Cathedral is beautifully furnished the Chairs & Carpets are well matched. Half way down is the Canopy where the Priest gives his lectures. This is built of wood wonderfully carved & tastefully decorated all if a dark red colour. The Marble pillars supporting the Roof are also works of art. Up at the Top is where the Choir sits with an Organ on the Right & down at the bottom is another very large Organ built on Wooden Tiers beautifully carved as you walk around behind where the choir sits is a large number of small Marble Carvings\n\nenclosed in frames representing the life of Christ from Cradle to the Crucifixion, these are all done splendid. The 10 am service was enjoyable but at 4 Pm when the Organ played & the Choir sang it was a real treat to listen to. After coming out of the Cathedral after an enjoyable time I went along at 5 Pm to see the French Picture Show. As all the back & gallery seats were reserved I had to content myself with a very front seat for 3d, this Cinema is a small place & very stuffy & the Picture screan is to high up to be appreciated. These seats were full of French boys & girls & what a chatter which of course I could not understand. The Pictures up to half time were very good & written in French which I could not \nunderstand\n read but followed the plots fairly well. I came out at half time & as I was very tired I started off to find my Café where I had some Bread & Butter & Coffee & at 9 Pm I went upstairs 3 storey’s high to my room, I turned into a beautiful soft bed & soon was fast a sleep. I awoke at 9 am.\n","18":" After dressing myself my attention was draw to a noise in the street & on looking out of my window I saw a number of boys Snowballing & throwing up Snow Balls at the Telephone Wires were\n\nlong flakes of snow were handing & when a wire was hit down would come the flakes on to the people below which would cause a hearty laugh from the boys. After I had Breakfast of boiled eggs I went out for a stroll, as it had been snowing heavy during the night. The shopkeepers were busy sweeping the snow from the Footpaths into the Gutter. After purchasing a Morning paper I went through a narrow street into the large square were a large number of German Prisoners were sweeping & shovelling the snow into heaps for removal I had a chat with one of the Guards in reference to the hours worked by the Prisoners, they all looked well & appeared to be contended. Their N.C.O.’s superintended the work & the men worked with a will. The Guard told me that they have no trouble with them, they start work at 8 am & have 1 hour for dinner & finish at 5 Pm, keeping the City clean. I then continued on to the E. Force Canteen to buy a few Articles, as one passes from the Square into an open space & on your left is a very nice park & alongside is the Prisoner’s Compound a fairly large place with Sentries walking here & there in the front of the Compound are the Wholesale Department of the Expeditionary Force Canteen & further on is the Retail Canteen a large wooden building which is divided into two Compartments the first is where\n\nyou purchase Tobbacco, Cigarettes Soaps Etc & in the next portion is where you can purchase Cups of Tea for 1 Penny (10 Centimes) a small Roll or Cake for 2d. This place was filled with Tommies with W.A.A.C. Girls here & there sitting at the Tables enjoying their Tea & Biscuits quite independent of the Tommies coming & going. I spent a little time in there watching the different characters of the Tommies, one notices quite plain the young lad with a pleasant smile on his face & then the elderly soldier who had been out in France some considerable time, his face was drawn & his looks were more determined, in these men one can see written across the forehead (Fed up) after enjoying a cup of tea I set off to have a further look around. I wandered about from Street to Street until I found myself approaching an old Church or rather the Old ruins of St Bertin, an Historical old place & very old. I was told that there are sentries posted on top to detect Enemy Air Craft approaching. As it was 12 noon I went in to an Estaminet & had a small bottle of French Stout paying 9d for it. I then continued on towards the Station where I went into a Restaurant for a hot Dinner which consisted of Soup, Potato Pie, Bread & Butter & a Glass of Wine which I was charged 4 franc’s. I then continued on & went into the Railway station & saw\n\nthe leave Train pass through afterwards I went out & into the Church Army Hut in the little enclosure to have a rest until the Train arrived from Calais. As I was sitting inside I heard Tommies laughing & I went out side & saw a number throwing Snowballs at the W.A.A.C. Girls as they passed & when some returned they had some Snowballs ready & they retalaited on the boys, both enjoying the fun, several of the Girls came in side & bought Tea & Biscuits & sat down at the Tables & enjoyed a few minutes rest. At 2.30 Pm I left the Hut & again went into the Station & in a few minutes the Passenger Train arrived & after taking my seat the Train left at 2.50 Pm for Hazebruick arriving there at 3.45 Pm where I had to change into the Poperinghe Train which left at 4.30 Pm & after a good run we arrived in Poperinghe at 5.45 Pm. I then went out & along to my Belgian friends & had a cup of Coffee & some biscuits, as there were a light Engine leaving for Regersberg at 7.30 Pm I said Good bye to my friends & left again for the Station arriving there at 7.20 & found that the Eng had left only a few minutes, so there was nothing left for me but to go along the road in the hope of getting a lift. I only proceeded a short distance when along came a Motor Cyclist with a Carette attached\n\nThe Traffic Officer stopped him & I asked him for a lift which was freely given & into the Car I stepped & off we went, as he was only going as far as the Chateau, I was pleased to get a ride that far, arriving at the Chateau I thanked the Cyclist for the lift & he then directed me to Brieleu about a mile away where I would meet our Line & then along I walked to Regersberg another mile & arrived at Regersberg at about 9 Pm, I then had a short rest & took up duties at Midnight.\n","19":" On finishing at 8 am I saw where one of our Aeroplanes had come to grief in an open piece of ground close to our Camp. From what one of the Guards on duty alongside of the Aeroplane told me, it appears that the afternoon previous, the pilot had stopped his Engine & was volplaning down & when he tried to start his Engine again it failed & with the result that he had to land best he could, his Machine struck the ground fairly hard & the propeller was broken & the nose of the machine went about 2 ft into the soft mud & there it remained with the Tail sticking up in the air. The Pilot was not hurt only receiving a bad shaking. During the day, it was removed to the Aerodrome for repairs.\n\nFrom Tuesday until","20":" things were very quiet, very little fireing going on. We were issued a new Tunic, before lunch & as the sleeves were rather long I took the opperunity being off duty & went into Poperinghe to my friends where the young lady, altered the sleeves & put new \nChevons\n Chevrons (stripes) on my sleeve also made me two new colours & sewed them on. We expect our Riding Breeches & New Hats any time now. After spending the Evening with these people I left by a special troop Train at 10 Pm for Camp.\n","21":" As I was not on duty until 4 Pm I caught a Train at 10 am for Peselhoek to go & have a hot bath & after a good run arrived at Peselhoek at 10.45 am & straight away had by Hot Bath, then I had Dinner & spent a couple of hours with my Pall in his Hut, then I left at 3-15 Pm & arrived in Camp at 4 Pm & straight away signed on & went up to St Jean Yard. Today","22":" turned out to be a fine day & up went our Observation Balloons, which Fritz soon started shelling with Schrapnel also Fritz Machines were continually over for Observations purposes & our Anti Air Craft Guns were kept fairly busy blazing away at them. This was kept up all day until eventide\n","23":" As it is over one month since I made an entry in this diary I now start again. As things on this front are very quiet absolutely nothing doing especially on the Railways although the Light railways have a certain amount of work & we on the Heavy Broad Guage are hardly turning a wheel, almost daily we go from here at Regersberg to St Jean & stand by our Engine for 8 hours, so when my day shift turn comes around I sometimes take a walk around the Camps in the Vicinity to pass the time away. We only have two Engines on Traffic so therefore we are only on duty every other day. A fortnight ago when I was on day shift up at St Jean another Fireman & myself took a stroll over to have a look at the Zuoave Observation post, this post is in the form of a Artificial Tree, it is situated about 20 yds along a narrow road from Admiral Road a main artery to St Julien. On approaching this Tree, one could easy pass it unobserved, as it is so much like an ordinary Tree, it is about 2 ft 6” in diameter & about 8 ft high, it is in line with a lot of other Trees & I was given to understand that the original Tree was removed & the artificial one replaced exacting like it during the night, the outside Trunk is made of Russian\n\nIron with knots of wood placed here & there with twigs sticking out around the top all these knots have holes bored through the centre to see through & on the inside of them is oblong shutters 3” x 4, which slide back & forward. The entrance is at the back facing the Yser Canal, it is only a small opening & where you crawl inside you climb up several steps to the lookouts. The inside is lined with Iron about ½” thick, & in front of these openings or lookouts are several wooden shelves for the Officer to take notes on. The lookouts all face Pilkien Ridge & as I was inside I got a splendid view of the country up to the ridge, I am given to understand this was one of our Artillery Posts used before the Big Push on","24":" there were another post which was used but had be blown up by one of Fritzs shells. One evening last week I was attached to a Troop Train up at Wieltje awaiting the arrival of Troops from the line & we had to wait a couple of hours so I decided to go down the Tunnel, which is on the Canal side of the Ridge, close to Wieltje Cabin, this Tunnel was built & mined by our Tunneling Crop right ahead under Fritzs lines & was to have been blown up if necessary for our Advance but after our Terrific Bombardment\n\non","25":" Fritz retreated & it was not necessary to blow up the Tunnel. To go down the Tunnel you have to walk down two flights of stairs to about 40 ft & then along a few yards when you come to opening which is the Engine Room where the Electric Light is generated. The Engine is work by boys from an Australian Technical corp, who live underground as you walk along you pass recesses which are used for several purposes, one recess is the boys quarters having several bunks built along the sides another is their Cookhouse & so on, further on these recesses are us as AMC Dressing stations & Officers quarters, it is very wet & damp & the water runs along both sides of the floor boards, even where the boys live it is always wet underfoot & they always wear their Gum Boots. I don’t intend going down again as I caught a chill & was laid up for a few days. The Atmosphere is to damp for my liking. I only stayed down there for about an hour then I came up & after a while the Troops arrived & off we went as far as Regersberg when I left the Train & stabled my Engine for the night. One can walk along the Tunnel for about 1 mile ahead & a good distance along branches on each sides.\n","26":"\n\nHere I am back at the Main Depot Peselhoek. I received notice of my Transfer last Tuesday to pack up next morning & leave Regersberg at 10 am for Peselhoek for the purpose of proceeding to Boore a big Railway Operating Depot in France about 1 mile from Hazebruick to learn the Railroad & Signals on the French System, so after breakfast at 8 am I packed up & put my things on a truck alongside of the other Kits there being Five Drivers all told transferred back. We left at 10.30 am all sitting on our kits & made a good run to Peselhoek arriving there at 11- am. After placing my kit etc in my own little hut I reported myself to the Warrant Officer in Charge of the Depot who instructed me to hold myself in readiness to proceed to Boore on Friday. After making myself comfortable in my Hut, I obtained a Pass to proceed to Poperinghe to say Au Revior to my friends there, I left here at 3 Pm (15 oclock) and arrived in Pop at 3.30 Pm. I went around & saw my friends in the Rue De Eypres for a few minutes then I left & made a few purchases in several shops eventually arriving at the Soldiers\n\nInstitute where I bought some Biscuits & Cake & a Cup of Tea for 1 Franc. I sat down to a Table & enjoyed them afterwards it being 5 Pm (17 oclock) I went along to the Pavilion Picture Hall & saw a splendid show which I enjoyed. I remained there until 7 Pm when the show terminated when after having a glass of Stout I went back along to my friends for Supper & a chat. I left there at 9 Pm after a good time & arrived back at Camp at 9-30, as another chum is using my stretcher until I return from Boore I made by bed up on the floor & after chatting with my two chums in the Hut we all turned in about 11 Pm & I had a good sleep. Next day I did a lot of washing & hung them up on a cord above the Fire Pot & by evening time they were nearly all dry. I received word in the afternoon that I would not depart for Boore until Sunday & the other batch of Drivers learning the System there were not ready to return, so I was booked up at 8 am next morning 4 Pm (16 oclock) on the shunter & at that time turned to & had an easy shift of 8 hours finishing at Midnight. Next afternoon Saturday I again obtained a pass for Poperinghe & went in for a walk. I had nothing to buy so\n\nI took a quiet stroll around the outskirts of the Town. I passed the Church which had been hit & badly damaged. I had another look at the inside where everything is still the same as after the Bombardment, I then went down a side street were I came to the Poperinghe Cemetery as the Gates were locked & the Brick Wall broken down alongside I climbed over & went along the Path. I was not long walking along when I soon noticed that the Tomb Stones had also been damaged by bombs & shells. All of a sudden I saw a Tomb smashed in & on looking down inside what a sight there were, it was awful. I could see the Coffins all smashed in, & bodies all enclosed in Zinc Casings squashed up flat, in this tomb there were 12 Coffins laid on two tiers the bottom four were under water through the rain & the top 4 were all smashed about & pieces of wood floating in the water. I turned away in horror to think such a cruel thing could have happened & continued on & came across several more Tombs knocked about the same, likewise several Head stones knocked down & broken in pieces. There is no mistake this Cemetery has had a bad knocking about. I came across a large shell hole amongst a lot of Graves & pieces of wood & Human\n\nBones lying here & there & sticking up out of the ground. I felt so disgusted that I came away & continued on my journey back to the Soldiers Institute opposite the ruined Church & had some biscuits & a cup of tea & set off for the Camp & had my tea, when I entered my Hut I found two letters from my Home in Ausie so I spent the Evening answering them. On January 29th our Officer Commanding called a Parade it being the Anniversary of our Coy on Active Service. The OC congratulated the corp on their good work & good behavour & the number of honors the boys have gained in Belgium. He stated that up to","27":" there had been 1 Bar to a D.C.M. 1 D.C.M, 5 Military Medals and 3 \nMilitary\n Meritorius Medals, won by members of the Coy. Their names were Sergeant Major J Burley who gained the D.C.M. in the Boer War & now had gained a Bar for saving a 12 inch Howitzer Stores & Ammunition from being blown up, Sgt Major W Hackfath D.C.M. foor attending to the wounded whilst under Bomb Fire, St W. Foley, Corp D Sheridan, & \nSap W. Longford\n & T. Gardiner each A.M. Medal for devotion to duty while under Heavy Shell Fire while on their Trains also St Major A Wallis, Sgt “Sid” Spence & Sap P Jackson each a Meritorius Medal for rendering aid at an Explosion of a Dump.\n\nAlso Sgt Major H Hockney & Sap W Longford for extinguishing a fire caused by a Bomb from a Fritz Machine on an Ammunition dump, each receiving a M Medal, also the OC congratulated the Football Team of Soccer Players on their splendid record viz Playing 45 matches & winning 29, Drawn 10 & Lost 6 also the corp Cricket Team who played 12 matches & won 9 & lost 3; which no doubt is a splendid record, & hoped the coming year to do still better, & further stated that a Brass Band would be formed in the near future, which has eventuated & now there are over 20 players who practice every other day & in a month or two will give a good ac of themselves & being a credit to the Corp. my departure from Boore has been further cancelled until tomorrow Tuesday at Midday for certain as the other batch came back this morning. I was booked up again at 8 am on Sunday & had a run to St. Jean with material also taking up 5 of our No 1 Team of Footballers to strengthen No 2 team stationed at Regersberg who had to play a crack team of Artillery men who beat No 2 Team last Monday up there by 2 goals to 1. Our No 2 Team turned the tables on them this time & scored 12 goals to Nil, I did not wait for them on \n\nmy return from St Jean, they coming home after Tea by a special, I duly arrived back at 3 Pm & at 4 Pm was relieved & signed off & spent the Evening in my Hut playing cards & debating on various topics. I would like also to mention that on","28":" a Team of Footballers from the","29":" Battalion A.I.Forces paid the Camp a visit, about 36 players & supporters came over in a Motor Wagon at Dinner Time & afterwards a special Train took all hands about a mile away to a good ground, this was the first time our Team had played the Australian Game & the","30":" Batt. Team were a splendid lot & gave our boys a good game beating them by 9 goals to 6. Several of the boys who came over where of the Original 11th Batt which landed at Gallipoli, I met several of my old friends from my Town in W.A. They all looked well but had altered a lot; our corp gave them a good spread after Tea & they left in the Motor for their Camp at 9 Pm giving us 3 cheers as they left. I left with several of our Regersberg Boys shortly afterwards for our Camp after enjoying a good day. I will close now & will continue my Diary at Boore relating my Experiences on the Main lines from time to time.\n\nAs I was notified to take my Departure for Borre at 1 Pm","31":" Mch. 1918 I spent the morning in my Hut packing up my kit, as I was informed that no stretch \ners are\n & Mattresses were provided I decided to take my Horse hair Mattress in addition to my rugs so I tied a cord around the Mattress also strapped my rugs together & put a small cord tied to each to as I could carry the two bundles over my shoulder & after I had Dinner I carried my Rugs etc likewise my Kit Bag over to a truck attached to an Engine which was to take us into Poperinghe, there were 6 of us going so at 1.5 Pm we started & in 10” we arrived in Poperinghe were we found a Train waiting, it did not take us long to tranship our luggage into a 3rd class compartment & at 1-20 we were off for Borre, as it was a gloruis day it was quite pleant travelling, we made a good run & arrived in Borre at 2.30 Pm. After putting out our luggage the Sergeant in charge of our party went over & reported us our arrival & we were allotted Hut No 25 a few yards away, this Camp is situated alongside of the Railway Line & each Hut accomodates about 60 men & is lit up by Electric Light & has two stores, one at each end, we soon picked out our positions & proceeded to make ourselves at home. I then went & had a look around. These Huts are built in 3 row - each now contains 5 huts & there is \n\na Hut for washing purposes, Hot & Cold water in abundance provided & long boards for the boys to was their clothes on. In between each Hut there are two rows of Sand Bags to protect each Hut from Bomb splinters. There is a splendid Sergeants Mess were all N.C.O’s have their meals, so at 5 Pm the Bugle was sounded & we prepared for our Evening Meal. I must say I was disapointed at the fare provided, each man received 1 slice of Bread & there were a plate of Dripping on each Table, & one cup of tea. I was fairly hungry as soon made short work of my slice. The Dripping was delicious & I enjoyed it, any how I had some biscuits which I brought with me, & I soon satisfied the innerman. Supper is provided at 8 Pm & I received a Sandwich of Bread & cheese & I purchased a Pint of ale & had a good supper then at 9 Pm I made my bunk up on the floor & soon was comfortable for the Night, but I did not sleep to well, as the boys were coming & going all night, also the Call Boy kept coming in and out calling the boys for their respective Trains, one time during the night I was awakened by a conversation, one of the boys stretcher had caught a fire & two lads were carrying it outside to smother the flames. I believe somebody dropped a lighted match on the canvas in passing by accident, the owner\n\nwas away on duty, I soon dosed off again & was awakened at 6.30 by the Bugle sounding the Revielle & at \nsev\n 7 I arose & dressed & rolled up my rugs, & went along & had breakfast in the Mess, I received Egg & Bacon & a cup of tea which I enjoyed. I ordered a lunch & my Hot Dinner to be put by until tea time, & was then notified to go on the Bethune Road for my first lesson & after obtaining a Pass I went along with two other boys on the same work to the Engine Sheds, as there are only room for 2 extra men on an Engine on of us rode in a Carriage, I was one of the lucky ones & I went on the Engine. We left the Depot at 8.50 am for Hazebruick about 1 ¼ away were our train started from, & in a few minutes we made Hazebruick & soon was on our Train & left to time, which was at 9.20 am. The French System of Signalling on a double line is altogether different to the English & Australian, instead of Distant, Home, starting & advanced starting signals, there are Distant, Warning, Stops & Semaphores signals of all colours & shapes, which are very difficult to understand, the line all the way to Bethume is fairly level & well ballasted & the Engines working the Passenger Trains are very large & powerful, they weigh 90 Tons & are 6 wheel coupled, Tank Engines & have 4 small wheels on a Bogey at each end, they are known as the\n\n4.6.4 Tank Passenger Engine. I went down of No 11 & returned on No 9. They are a beautiful eng & carry 150 lbs Pressure of steam to the square inch, & are kept very clean outside & the Cab & Fittings on the footplate & cleaned every day by the Fireman & it is a credit to him, the Iron work likewise the Brass Fittings almost dazzle one’s eyes, after several stops here & there at stations we made Bethune on time, I was very much suprised the way the French Girl Porters handles the Luggage Barrows, they are all young girls & are very smart about their work, they all wear black dresses & no hats, & as the French people are noted for their beautiful hair, I suppose they like to show it off. I have not seen any fair French Women yet they are all dark or between colours, & each girl wears high lace up boots to work in. Each train carries two Guards, one in the leading van & they other in the rear van, the leading guard is known as the Chief Guard & has complete control of the Train, & the Rear Guard & Driver are to obey his instructions. Having two hours to wait for my train to return I went along for a stroll to the Y.M.C.A. Hut for a cup of cocoa & have my lunch of bread & cheese, afterwards I came back to have a look at the Engine Sheds, which are very large & contains a good number of Locomotives of all sizes & descriptions, some were Canadian, English, French & Belgique. A large\n\nnumber of girls are employed cleaning Engines & various other duties about the yard also as Clerks in the Offices. They are totally different to our Australian cleaners, they are so smart & quick in their work & made a good impression. I soon made myself known to the Driver of my return Engine & soon was quite at home. As my knowledge of the Westinghouse Air Brake is very little the Driver explained the various parts to me & I was very much interested in the working of the Brake on the both journeys, we left Bethune on time which was 1.20 Pm & after an interesting run we arrived in Hazebruick also on time. The country all along the line is looking very well & as it was another glorius day, it was a treat to be out in the sunshine, it was a real spring day & the French People all along were busy ploughing & sowing the seed, there is very little land about which is not under cultivation of some sort. The French Peasants are a very industrious class of People & have very little land lying idle. After leaving our train which continues on to Dunkirk we came back to Borre in good time signing off at 3.40 Pm, & receiving instructions to go over the road to Bethune again tomorrow Thursday at the same time. After having an enjoyable tea I spent the evening in the Y.M.C.A. Hut at the rear of the Boys Huts, were a large number congregate for a game of Draughts etc.\n","32":" After a good nights rest I arose after the Revielle at 6.45 & while I was having Breakfast I decided to take a run out to Steenwerck on the Armentiere’s line to try & see my brother before his Division moved back for a rest. As it was a lovely morning I started to walk along the Main Road leaving the Depot at 8.30 am, I intended to get a lift on a Motor Lorry if any came along. I only had a little way to walk before I entered the village of Borre which \nhas\n only has one street to boast of I soon left this place behind & as I was walking along the Road I passed a large convoy of wagons belonged to the 3rd Div of Australians which were moving back for a rest. I was somewhat disappointed as no Motor Wagons had come along so I had to continue on to Strazelle about 3 miles, all the way to this latter place the Convoy was still coming along & on entering the town I passed a large number of Ausie Troops headed by a Brass Band on the march, I decided to make for the Railway Line to get a ride on a Train, & on turning into the Road leading to the Station a Motor Lorry came up behind & the Driver gave a me a lift down to the Station which was about a mile off. I made inquiries about any Trains expected & the British Corporal in charge of\n\nthe Control Office said that a Troop Train was expected at any time, & it may stop. I was only there a few minutes when along it came but did not stop so I had to wait about 1 hour when along came a Goods Train, & I got a lift on the Engine to the next station Baileau about 5 miles arriving there at 11.15 am. I met a Transport Officer who informed me that the","33":" Div Motor Section had moved away from Steinwerck on Tuesday, & as the Goods Train terminated there I decided not to go any further & up the Town I walked. This place is still full of Ausie Soldiers of different Battalions coming & going. As it was then after 12 noon I enquired for a Hut to get a Cup of Tea & was told that the YMCA Hut did not sell any tea until 2 Pm & I could only obtain it at the Army Canteen down a long street. As I continued my walk & eventually got there & bought a cup of cocoa & had my lunch which I brought with me. Afterwards I walked around for about 1 hour chatting with several Ausie’s. Bailleau is a fairly large town & the streets are like other Towns very narrow, but clean & the place is fairly busy, at 2.30 Pm I came back to the station & after waiting a few minutes along came a Troop Train full of Ausies & I got a ride on the Eng into Hazebruick & caught an Eng & arrived at Borre at 4 Pm fairly tired. After a Hot Wash I \n\nI received a splendid Hot Dinner in the Sergeants Mess, I then laid down & read for a while then turned in at 8 Pm & slept like a top all night.\n","34":" I signed on again at 8.30 for another run to Bethune in glorius weather & after an uneventful run arrived there on time at 10.44 am & with two other chums we went for a walk up the Town until Lunch time, passing through one street & another, & eventually arrived back to the Y.M.C.A. Hut for Lunch & after a cup of tea we made for the Station & awaited the departure of the return train. I took up my usual position on the Eng at 1.37 Pm off we went, at nearly every station enroute a large number of Parcels were put in for French Prisoners of War in Germany at some stations there were 2 & 3 Barrowfull’s, at one station Berguette a number of German Prisoners detrained for St Omer, they had entrained at two stations further back. They all looked well & appeared Happy to be out of the struggle, we arrived at Hazebruick a few minutes late & after a while we arrived back at the Depot, & after I had Dinner I played Crib until bed time & then turned in. Saturday’s run was uneventful going & coming with the exception of having to shunt the Passenger \n\nTrain into the yard at Lillers to allow two important Troop Trains to pass. After I had another Hot Dinner I went into the Sergeants Mess at 6.30 where the Depot Concert Party gave us a treat. The place was full of N.C.O.’s & the individual members of the Party gave us several good turns all of which were well appreciated. There were several Professional Artist amongst them, the Concert terminated at 9.30 with 3 cheers for the Party & all hands retired for the night. \n","35":" I had another enjoyable ride on the Eng in lovely weather to Bethune arriving there on time, where I left my chums, as they wished to have a look at the Locomotive sheds & I intended to have a look at the Cemetery past the Canal I made my way up into the Square & inquired the way & soon arrived at the Canal, where several Steam Tugs were lying alongside the Wharf. It is very pretty along this Canal the grass being nice & green on the sloping back in between the Wharfs. Having crossed the Canal, I came to the entrance to the Cemetery which is surrounded by a high brick wall & there are two large Iron Gates which were opened & in I walked along the road. There are Pine Trees on each side growing which add to the beauty & the Marble Tombs, & Head Stones & Glass Houses glittered in the Sun\n\nall helped to make a Beautiful Picture. These small Glass Houses were very nicely laid out inside, they are all on Graves & some have two chairs inside & some beautiful Wreaths of Beads of various colours & designs also several contained the Photo of the Deceased Person buried underneath. I spent an enjoyable hour wandering about, at the top I came across several rows of French & British soldiers Graves who had died in the Hospital in the Town, & the graves are well looked after. I saw two soldiers digging around them & trimming them up. I then went along & came down the other side & eventually came to the entrance & went back over the Canal & up into the Town being well satisfied with my Visit. I was soon directed to the YMCA Hut & there had a cup of cocoa & had my lunch & a rest for ½ an hour & then walked quietly back to the station arriving there at 1.15 Pm & at 1.37 we were off again for Bethune. At each station there were an unusual number of civilians & Soldiers travelling, it being Sunday. Coming down we passed a Semaphore Signal at Danger by an order of the Chief Guard as a Train was in the Section ahead & we had to proceed cautiously to the next Semaphore which also was at danger & on another order we continued on slowly & on taking a curve we could see the Train\n\nahead going slowly having a heavy load on, one of the Signal Men placed 2 detonators on the line as a warning to us, & they exploded when being passed over & we followed & soon arrived at a station, & having to stop there 10 minutes it gave the Goods Train a chance to get clear of us, any how we never saw it again. This way of working trains is necessary so as to not hold up important Trains during busy times. I noticed the benefit of handling a lot of Trains near Hazebruick, as when we left we passed 2 goods Trains waiting to come in, 2 light Engines & 2 more Trains behind them all on the same line & in one Section, all waiting to get into Hazebruick yard. We arrived back on time & soon again was in at the Depot, when I had my dinner & being weary after my walk in Bethune & standing up on the Engine both ways, I laid down & had a short nap awakening up at 6 Pm where I went in again to the Mess & had a cup of tea & a Salmon sanwich, which I enjoyed, & then came back to the Hut & spent the evening writing up this Diary. \n","36":" This day was the last for my run to Bethune so having a good knowledge of the road also my chums so we all rode in a Coach there and back, we arrived there on time & had three of the 60th Coy of Aus Engine Men who are stationed at Bergues near \nCamp\n Dunkirk in our Compartment\n\nthey were learning the road to Amiens via Bethune & St. Pol Pob, they were allowed three days to go there & back. We left them at Bethune & went for another look at the large Loco Depot & had a chat with a French Girl Engine Cleaner who could speak English very well, she told us that they start work at 6.30 am until 12 noon then on again until 6 Pm every day, they wear Indianrubber Boots & overalls & a cap to work in & they look neat & clean when they go home for their lunch, we walked about until 12 noon then went out & along to the YMCA Hut for our lunch & then for a quite stroll until Train time when we got into a carriage & after a good run we arrived back at the Depot, when I found a large number of Ausie Papers so I spent the Evening reading some of them. Tuesday we had a Lecture in a Hut by a R.E. Sergeant Major on French Signals & general working of Trains from 9 am until Lunch time then we spent the Afternoon quietly so I decided to have Tea early at 4 Pm & board the Poperinghe Passenger Train to Abeele about 5 kilo’s from Pop where I went up the town about 15” walk to a Divisional Picture Show which I enjoyed very much, it started at 6 Pm & arriving there at 5.40 Pm I did not have long to wait. The Star Picture was splendid & entitled, Tom Brown’s Schooldays. It was \n\nin 4 Parts & it was well received by a crowded House. A Comic Picture afterwards concluded the show at 7.45 when I made my way back to the station were I caught a good train to Borre arriving there at 9 Pm & after supper of a glass of Ale & a Cheese Sandwich I turned in. \n","37":" We had to rise early to catch a Train leaving here at 7 am for Hazebruick were we were booked to go to Dunkirk, so after Breakfast off we went this time there were 5 of us & we soon made ourselves comfortable in the Dunkirk Train in a 2nd class compartment. It was a very cold morning & misty & we had a job to keep ourselves warm, anyhow the prospects of an enjoyable day we soon forgot the cold & off we went on time 7.51 am. After a few minutes run we arrived at a Station called Cassell which is at the foot of a large hill 1 ½ miles away were the Village is situated, owing to the mist, we could only see it faintly in the distance, a Train runs from the station on the Electric System, we were off again & after a good run arrived at Berges at 9 am & stopped there a few moments & off again passing a large Aerodrome were we could see several machines ready to fly if necessary & in a few minutes we steamed into Dunkirk at 9.15 am, it still was very cold but clear & we started on a stroll up through\n\nthe narrow streets. Dunkirk is a large place, what so far I have seen of it, we kept going, passing here & there houses & shops which had been bombed & hit by shells, we made towards the Docks passing over several swing bridges over Canal’s, we came across the Ausie Supply Depot & met several Ausie A.S.C. boys & after a chat we were all invited to come back at 12 noon & have Dinner with them. We promised them we would return & having about 45” to spare we continued on until we came to another Wharf were we could see a number of Sea Planes on a Wharf. We stayed there watching the Tugs & Steamers passing to & fro sitting on a beam in the Sun which was nice & warm & we enjoyed it. At 11.45 am we started to trace our steps back to the Supply Depot & after a chat we all adjourned in for a splendid dinner. The A.S.C. boys made us very welcome, their quarters are in a Tobbaco Factory which is not used now, on the ground floor were the Mess Tables are is rows of Sand Bags separating one portion from the other for to stop Bomb splinters in case one come through the building, their sleeping quarters are very comfortable & they are all looking well & happy. After staying there for about 1 hour we thanked them for their kindness & left our Heavy Coats there we started on a tour of the Docks & up towards the Pier, \n\non passing some buildings I came across a Private house where a bomb had dropped alongside the front wall. This place was three storey high & the Front Wall from the roof to the ground was blown down & the different floors left standing. The","38":" floor was a Bedroom & there were 3 large beds & a child’s cot & a Wardrobe & was hardly damaged at all, there were several people in this building but were only slightly injured & 3 Tommies standing close by were hit & badly injured, each receiving a Blighty. I continued on until we came to the Wharf were a number of Armed Motor Launches were moored after a few minutes chat with the Jack Tars we kept going & passed \nthrough\n over another Swing Canal Bridge, & on to another Wharf were we saw some Monitors Anchored. They all looked splendid & had some big guns on board & the Jack Tars were all busy working except a few who were lined up two deep ready for their Afternoon’s leave. We had an interesting chat with two of the boys exchanging experiences on the Sea & on land we continued on until we came to the Sand Hills & soon was interested watching a number of Aeroplanes flying about & performing some wonderful feats such as diving, looping the loop, & volplaning down. We walked over to the beach were we saw the Barb Wire entanglements to prevent the Enemy landing, we laid down on the grass chatting to two Wireless Sailor Boys & watching\n\nthe Flying Machines coming & going to the Aerodrome close by until 2 Pm when said Good bye to the Sailor boys & started back to the Station. On approaching the Wharves we saw a number of the Armed Motor Launches proceeding out to Sea, they soon got up speed & seemed to fly through the Water making a big spray in their wake, the Sun was nice & warm & the air fairly clear the Sea Planes soon started on their work, several of them passed us & each contained 3 men & look grand gliding along the water before taking the Air. As we have seen any amount of Aeroplanes in our Travels but no \nAeroplanes\n Seaplanes it was a grand sight to us all & we were greatly interested & watched them rise & disapear out of sight. They soon were mixed with the Aeroplanes flying about, we were told later that the Sea Planes were from America. We continued on our way until we arrived back at the Supply depot were we obtained our big Coats & said Good Bye to our Ausie friends & off we set for the Railway Station arriving there at 3 Pm tired & weary & soon into a Carriage & had a good rest. The Train left at 3.45 Pm & it was fairly crowded & as it was nice & clear we had a good view of the Country enroute. We saw a few of our Ausie Engine men at Bergues & exchanged greetings & off again & after a good run we arrived at Cassell & obtained a splendid view of the Town on the Hill.\n\nThis place is about the prettiest I have seen up to date, it being built on the Top of the Hill & has Farms right up the slope dotted here & there with numbers of Wind Mills so very close together & all revolving. The green pastures with the sun shining on the grass & the Red Tile Roofs of the Houses made a beautiful picture. A large Chateau on one part of the Hill stands out very prominent. This part like all other parts of \nBelguim\n France & Belguim is nearly all under cultivation or preparing, very little unimproved land is to be seen & here & there are the French Men & Women busy ploughing & Seeding. We only stayed at the Station a few minutes & we were off again & arrived in Hazebruick on time & a little later we all arrived back at the Depot all satisfied very much of our interesting day’s outing. When signing off I was instructed with another Driver to report to the Orderly Room at 9m am tomorrow Thursday to proceed back to the Main Camp at Peselhoek, because the Blighty Leave is to start in a few days & we are in the first draw, so my experiences of learning the Roads here & there will have to wait until my return from leave, when I hope to again visit Dunkirk & other places, it came as a suprise to me as I arranged to be over in Blighty during April, so I must somewhat alter my plans now.\n","39":" At 9 am I reported at the Orderly Room & obtained a Pass & went down the Marshalling Yard & caught a Store Train going to Peselhoek which left at 10.30 am & arrived at the Main Camp at 11.30 & reported. I was notified during the afternoon to proceed back to Regersberg next day.\n","40":" I left after dinner & soon was back at Regersberg but was not required for duty until Sunday. From this day until Saturday Mch","41":" things were very quiet as far as Bombarding was concerned. On","42":" an Aeroplane came down close to our Camp through Engine Troubles. I went over to see the Machine which was badly damaged all the Wings were smashed also the Propeller. The Pilot a Canadian was telling an Officer that the Engine gave trouble over Roulers & he kept going as best he could & when he was close to the ground he tried to land on a clear piece of ground striking a number of Telephone Wires to stop the fall somewhat. Eventually the Machine struck the ground just clear of a set of Railway Lines & the Pilot & Machine Gunner only received a slight shaking. I remained there until the Relief gang arrived from their Aerodrome & after a \n\nshort while the Machine & damaged parts were soon on the Trolly & off they went.\n","43":" I received word after Breakfast to pack up & proceed after Lunch to Peselhoek to pass the Doctor & start on my leave. It was a nice clear day & our Observation Baloons were all up & as there were an Easterly Wind blowing the Balloons was floating right over our camp & Fritz started putting Shrapnel over at it. The boys in the Huts in the Camp had been washing out the Floors & all the Bunks & Kits of each hut were outside when a Shrapnel Shell burst right up above. Crash & we all were taken by surprise. I heard the Whiz of a large piece coming down & as I was just inside my hut, I moved up alongside of the Iron which was protected by Sand Bags outside. I heard a crash in the next Hut & a shout & went outside & saw where the base of the Shell had pierced the Roof. Smashing the Door to splinters also floor & buried itself in the ground. It gave all hands a great shock, but no body was hit although it just missed a Tommy by a few feet. All hands were examining the damage when another shell burst over head & the Base went over near the line & the \n\nsplinters from the shell were falling all around the Huts, & our luck was in again & no one was hit. Our OC ordered an Engine to take me & my kit away & I was glad to clear out as it was getting to hot. As I was leaving another shell burst over head & did no further damage although the Camp S.M. & a Sergeant had a narrow escape as 3 pieces of shell struck the ground just by them & 2 pieces came through the Roof of their van were they sleep. After a quick run I soon arrived in Peselhoek, & made myself comfortable in my little Hut. After Tea instructions came through that all Leave was cancelled until further notice, & it was a disapointment to us all, but still as Fritz had started a big Offensive down south it was necessary to have every man at his post, so we all soon was reconciled even the boys were brought back from the Embarking ports, some were even on the Boats, & it was worse for them than us, who had not started. I was ordered back again to Regersberg next day Sunday & on Tuesday a change was made in the Staff there & a number of us were relieved & back I came again. From Tuesday until Friday Fritz had been putting some heavy shells over our\n\nMain Camp, doing no damage to the Huts. On","44":" at about 7 am a shell came over & exploded a few feet off several small Huts & the concussion tossing some of the boys out of their bunks. One Sergeant in particular got a great shock as the shell exploded nearest his Hut, but during the day, he got over it & signed on duty at 4 Pm as Shed Driver, between 6 & 7 oclock this same Sergeant was walking along one of the Lines when a large shell exploded under the Bank & blew backwards & the concussion lifted the Sergeant off his legs & he fell on to the rail & sustained a broken rib & minor injuries to the side of the head, he was soon placed on a stretcher & taken away to the Hospital. Fritz was evidently after this man having had two tries in one day for him. The Base of the Shell flew up & landed just over my hut & buried itself down about 18 inches. My chum next day dug it out & handed it into the Orderly Room to be added to our Coy’s Collection. \n","45":" During the last two weeks things in the Depot were very quiet, practically nothing doing. As we had been expecting a move off at any moment, Rumors were about from day to day & nothing eventuated.\n\nMy Mate & myself played cards in our Hut on","46":" & after having Supper turned in at 10 Pm & were both sound asleep when the Call Boy came in at 12.50 am & called us up & told us to pack our kits as we were off somewhere. We were not long getting dressed & packing up, we soon found the Camp astir, there were 60 all told under Transfer made up of 20 Drivers, 20 Fireman & 20 Guards, we were called on parade & inspected by the O.C. who spoke a few words & then we were ordered to put our kits into two Trucks & went to the Cook house for an early Breakfast & at 8.15 am we started away, we kept going for an ½ hour then arrived in the Mont De Cats Yard, where our engine left us & our two trucks were coupled on to a Train & soon was off again arriving at St Omer after numerous stops. An Imperial Officer met us & wanted the two trucks taken off the Train but was refused, & as we had orders to remain in the Trucks we did not stir. There were two long trains of covered in Vans loaded up with French Refugee’s all clearing out, they all mostly came from Hazebruick. I could not help feeling sorry for the people. The trucks had Furniture packed in each end & one, two & 3 families were in the middle, one couple told me that they had been in the Truck for 24 hours & only travelled 14 miles. We stopped at St Omer for a while & off we went to our disgust, anyhow\n\nwhen we arrived at Watteu a station ahead our Sergeant in Charge of the party reported us to the R.T.O. who ordered us to take our kits out & put them in a Carriage on a Goods Train & after about 30 minutes wait we returned. Strange to say we were stranded at this place last year being over carried from Audurique, when we first arrived in France. After a few minutes run we arrived back at St Omer at 2 Pm & had to carry our kits over to the Loco Sheds & then into the Electric Light Station, were we had to sleep for the first night. My Mate & myself slept in the Boiler shed alongside the Boiler with several others, the remainder slept in the machinery Shed, \nas we were all very tired, we soon turned in early\n although some had to start work straight away. My Mate & myself went for a stroll up the Town as it was his first visit here & my second I piloted him around, took him into the famous Notre Darme, Cathedral, which he enjoyed very much, after wandering around & having a good hot Tea we came back to the Depot & turned in & had a good sleep. We were aroused at 5.30 am & had to sign on at 6 am, & after preparing an engine for work we stood by all the morning until 2 Pm when we were ordered to proceed to a place called Arques on the Bologne Line to back a Train up to Wardreques, although I did not know the road I had to go steady, leaving the Depot at 3 Pm I arrived at Arques in 15 minutes, were a Train\n\nwas waiting, we were coupled on at the rear & off we went for about 4 miles until Wardreques was reached when we uncoupled & came back light engine, in coming through a big cutting between two overhead bridges the bank was hit in two places by Bombs, evidently been trying to blow up the bridges & missed them. The Country on both sides of the line looks beautiful, with several beautiful Chateau’s among the trees. Also passed over a canal which had several locks on one side, with the water pouring over, making minature waterfalls. We both very much admired this scenery. When we arrived back we were relieved at 5 Pm & signed off after doing 11 hours for my first day’s work. During the Day there were several \ntrucks\n vans put in a siding for us & we all had to shift our kits once again, & move into the vans. There are 9 in our van & we are very comfortable, we don’t know how long we will be here as Fritz is attacking very strong close to Hazebruick which is only 14 miles away, we can hear the guns banging away\n\n for all they are worth.\n","47":" I am off duty until required, otherwise waiting orders. I was notified at 4 Pm to sign on at 5 Pm to proceed to Bolougne. Having prepared my engine A Class No 1690 I left the Depot at 6 Pm & ran Light Engine to a Station called Aire on the St Omer Berguette Line, & after making a good run I arrived at Aire at 7 Pm\n\n& had to shunt out my train & also straighten up the yard, having a French Mecanicien as a Pilot & French Shunters I soon understood their Cod of signalling. After a lot of shunting & waiting about my Train was ready at 10.50 Pm. Having very fine French Coal which is not to good my mate who hails from off the South African Railways had to clean the fire & at 11 Pm we started for Bolougne. It was a glorius night & the moon shining bright although a bit cold. After leaving Aire the road through Wardresque if fairly level until approaching the St Omer Bolougne Junction when you take a steep gradient between two hight cuttings passing under two Brick Bridges \nI noticed between these two Bridges\n. Having blown one Whistle I received the Signal by the stop turning round & the Semaphore Signal lowered I continued on taking a big curve still on a falling grade & when the next s stop signal was in sight I whistled for brakes & applied the Eng Brake but could not stop the Train until I had passed the stop at Danger exploding two Detonators which are placed on the rail & go back when the stop is off. My French Pilot got down & explained to the Signal Man it being my first trip & they fixed the matter up satisfactory, & soon we were off again. After a pleasant run for some time in the Moonlight passing several Stations until I arrived at Wizernes were another engine was put on in front of me & another on\n\nbehind, the leading engine was manned by men in the","48":" Coy of Ausie’s who were stationed at Auduricque, from Wizernes the road is very heavy climbing through the Hills on one side of the Line the Hill is very steep & one the other side is a steep gully. The weather now was very cold & snow was falling slightly making a beautiful picture in the moonlight with the Trees & ground covered over with snow. After steaming for some time we arrived at Lumbres where the three engines took water & after a stop there for half an hour we were off again, this was about 2 am & at 5 am we arrived at a Junction where the Leading Engine was uncoupled & went off Light & my tanker returned to Wizernes. After pulling off some trucks & when the line ahead was clear, I continued on & arrived at another Junction named Pont De Bricks, where the line to Abbeville connects & after a few minutes run I arrived in Bolougne Shunting Yard & after being uncoupled I went ahead up to the Station where I was blocked & remained there for over 2 hours, of course being a strang place, I was interested watching different trains going & coming, one came in from Paris & continued on to Calais, the trains run into a Dead End & a fresh engine arrives & takes the train on its Journey. I received the signal to proceed to the Depot after 9 am which was about 2 mile down the line taking a big curve on a bank & crossing over the Main Line on a Overhead\n\nBridge meeting the Main Line again at where you take another curve into the R.O.D. Depot. After my mate cleaned his Fire & took water we signed off at 11 am, & reported ourselves to the Orderly Sergeant where received a Chit for Two Blankets & a Waterproof sheet, my mate likewise also for meals. As this is a new Depot in the formation everything is outside down we were allotted a Tent to sleep in having to lay on the ground it was not to comfortable. A large number of German Prisoners were busy building huts for the engine men so in a few days all hands will be comfortable. At meal times you go into a Large Tent with Table & Forms & an Orderly brings in the food & serves it out. After a good Dinner of Stew Potatoes & Carrots & Rice, we both turned in at 1 Pm & I slept fairly well until 6 Pm, when I arose & went down to the Canal which runs along side of the Camp to have a wash. This Canal will be very handy in the Summer for the boys to swim in. After I had my tea I was notified to sign on at 8.45 Pm, & at that time we reported ourselves & I received a chit for 12 hours rations consisting of ½ loaf of Bread & a Tin of Bully Beef, also a note to proceed to Devies, where that was I did not know. Another Engine was being prepared as a Banker for me & at 10 Pm we both left the Depot & stood out in the shunting yard for over 2 hours at the Train was not ready. My mate & myself sat down & after a while we were both asleep & at Midnight \n\nmy French Pilot arrived & both engines were taken back on to the Train & at 1 am off we went, to Pont De Bric’s where we had to shunt on to a single Line & after a grand run we arrived at Devres at 2.30 am where wee stowed our Train & I told my Pilot as well as I could, Machine Porteer Devres St Omer Toot Sweet, meaning, Engine Depart Devres St Omer at once, & the Pilot spoke to the Station Master & said to me Ahroot after my bank coupled up behind, meaning Right Away, & off we both went & made a good & interesting run down the Hills arriving at St Omer at 6 am & after stabling my engine I booked off at 7 am & had a good sleep & after tea a chum & myself went up the Town to a French Picture Show, although the writing is in French, we could follow the Pictures alright.\n","49":" I was called at 3.30 am to sign on at 4.30 am to prepare an Engine to proceed to work for the 277 Coy, Railway Construction, on the St Omer Berguette Section & at 6 am I left with a Guard, Engine only. I was blocked Arques Stop Signal which is alongside of the Canal where the Locks are for nearly an hour, so my Guard & myself went & had a good look at the Locks also we climbed the Bank & saw the Canal & the Bridge over the Line. As my Guard could speak French fairly good, the Sentry explained the working of the Hydraulic Lift. The bridge over head is in two portions connecting with two movable Basins, when one is up, the other is down\n\nA Barge comes in from the Canal & is put into one Basin & the Doors are shut & up the Basin & Barge goes until it reaches the top where the gates are open & the barge enters one of the Bridge portions & proceeds along a canal passing through a Lock Gate & then continues on, when another Barge arrives it is put into the other basin & up it goes & the first one comes down & so on. These basins are for Large Barges & the Lower Locks are for the small ones which pass under the Railway Line & up against the first lock, when the water then is released by the Gates opening & when the water is level with the canal the Gates behind the Barge is closed & the water coming over the other locks fills up the space & the barge rises to the hight of the next Lock when the Gates are opened & in goes the barge into No 2 Lock. This is done repeatedly until eventually the Barge reaches to the Hight of the Higher Canal & then continues on its journey, passing through about 6 locks. After satisfying our curiousty, & the stop signal was pulled off I went into the station yard at Arques & was kept there until 10.30 am when a French Shunter came on the engine & off we went to Wardresque, returning on the other line to about half way when I was put into the Observation Balloon Repair Siding & there met a R.E. Corporal who took charge of the engine, & after shunting some trucks out, I went along the the 277th Coy who were building a line, with a Track \n\nLaying Machine. Having picked up three trucks of sleepers behind the Engine I was hooked on to three trucks of Rails & the Track Layer & after obtaining a Lunch from the Coy’s Cook House & the gang finished their lunch, work was started. A number of men were on the trucks rolling the rails up to the Layer & another lot were carrying sleepers from the trucks behind & placing them ahead & the Gib of the Layer would pick up a Rail which was rolled alongside from the Rear & place it ahead on the Sleepers, when I would move ahead a few yards until the next rail was placed & so on until all the Sleepers & rails were laid which took us three hours. It was now after 3 Pm & after placing the Layer & Empties where I picked them up, I came back through the Balloon Siding were I had to shunt a load of Material out & make up a Train for Arques. After completing I started & in a few minutes arrived at Arques were I shunted my load into a Siding & came back to St Omer & signed off at 7.30 Pm after a very long day of 15 hours although very interesting & instructive. After a hot tea, & a chat I turned in at 9 Pm & had a grand sleep as I was very tired. \n","50":" After a good night’s rest I arose at 8 am & after Breakfast I went up the town for a stroll until Dinner time & then had another sleep in the afternoon, because I expected to get a call for duty any time after tea. As it happened my mate & myself\n\nwas notified at 5 Pm to come on duty at once for a run to Bolougne & after drawing our tea & 24 hours rations, I stepped on my Engine which was ready for me & at 6 Pm we left the Depot with a French Pilot attached to another Engine for Berguette on the Hazebruick Bethune line to pick up my Train & after a couple of delays we arrived at Berguette at 7.30 Pm. My guard went away for instructions & returned & informed me that my train to Bolougne had Departed & that I was to proceed to with a Train of Light Railway Material which suited us better as we would not be on duty as long as if we went to Bolougne & after taking water I was shunted on to my Train which was 39 in Length & totalled 750 tons. My engine No 1540 was a American Baldwin type with saddle tanks & the Westinghouse Brake, although it was a small type of eng it was very strong with 175 lbs pressure to the square inch. We were kept in the yard for a long time & eventually left at 10.30 Pm & after a hard run as the load was very heavy we arrived at St Omer near midnight, & after taking water we were cancelled for proceeding further & after a few moments altered again, when my mate decided to clean his Fire, as these type of engines have a dump plate for letting the fire through, he dropped the Plate & when he tried to close it again it came uncoupled & as there was no pit handy I decided to go into the Depot & connect the gear up again. The Station Staff decided to put a Calais Engine on the Train & ordered\n","51":" to finish, so I brought the engine in & put her away signing off at 1 am. I was not required for duty again until Saturday at 2.30 Pm when I did a shift on the yard shunter until 10 Pm when I again signed off at 11 Pm & remained off duty until today","52":" when I signed on at 12.30 Pm on a Banking Engine & up to 4 Pm was not required so remained in the siding. After a period of nearly three weeks of quietness, there being nothing of interest to report, as I had been dong Local Banking Work & had a good time, working 8 to 10 hours at a time, I now start to relate an another somewhat startling experience. On","53":" 1918, I was booked on a run to shunt the Balloon Siding near a village called Campain & left the Depot at 1.30 & arrived there at 2.30 Pm & as there were no work to do, we made ourselves comfortable in a shady spot as it was fairly warm. At about 4 Pm we went over to see an Observation Balloon brought out of a Hanger, which is really a very high shed to be tested in the Air. The O.C. went around examining the Balloon & then the boys in charge of the ropes allowed it to rise & the O.C. climbed into the Basket & the Balloon which was also attached to a cable on a Motor Car was let up \nin the\n higher & the O.C. was testing the rope gear, after satisfying himself all was correct the Balloon was returned to the hanger\n\n& the Boys knocked off duty, having obtained a Dixie of tea I had my tea & at 6 Pm went over to the Y.M.C.A. where a free concert was held & was largely attended by R.F.C. boys also a Scotch lot of Laddies & Officers also a large number of Chinese labourers who work at a large Ammunition dump close by, the Concert was very good & finished at 8 Pm, when all returned to their respective Camps. The Chinese evidently had a good time as they gave the Artists a good clapping after every item. I went back to my engine & waited until 9.30 Pm when my relief arrived & we caught a light Engine to St Omer & signed off at 10 Pm.\n","54":" I again signed at 12 noon after going out to the A.V.C. Barracks for a Bon Bath. This trip I had to go to a place called Wizernes about 5 miles from here to assist to load up two trains of Motor Lorries, being part of an Ammunition Column. We left here at 1.30 & after a delay of 30” at Arques arrived at Wizernes at 2.30 & started to place the trucks & continued doing so until dark, we would 4 trucks at a time in line with a Ramp & then the boys would lower the ends of the trucks & place sleepers over the Couplings & the Lorries would come up the ramp & travel over the trucks, when 4 Lorries were on the Trucks & secured I would pull them out & replace 4 more empty trucks & so on until a train was complete. We finished the \n\nfirst Train at about 9.30 Pm when all hands had a spell. At about 10 Pm it was Moonlight & the air was very clear, & as we all expected Jerry over with his Bombing Machines any moment & was not disapointed, as soon the Church Bells started ringing out the warning for everybody to take cover & I could see the Search Lights up in all directions looking for Jerry & shells exploding in the Air. All of a sudden a great explosion took place away about 5 miles which I knew in a moment was the Dump at Campain. It was a great sight & the Fire lit up the sky all around & soon a number of Jerry’s Machines came over & my word they gave the Dump what Oh with their Bombs. I could see several Machines flying about & our Anti Air Craft Guns were banging away at them, when a Machine got away from the Flare & was picked up by the Search Lights, there was in an instant a great Aerial Display, shells exploding all around & lights going up like skyrockets & you could hear the Machine Gun Rat Tat & also the Fire from Jerry who was firing down in return with his Machine Gun. Jerry would be passed on from one Search Light to another, all the time being under a Terrific Fire & you could see & hear the Explosions of the Bombs he was dropping. Where I was on top of a Hill it was like a grand Stand View. This display\n\nwas kept up until nearly 4 am. As my water in my Tank was getting low I tried to get away down to Arques but as all the Station Staff’s between Wizernes & Arques were away under cover I had to remain. The Staff at the station were all in a Culvert under the Line which also was full of Men Women & children. They all stopped there until after 2 am when the Fires from the dump had died out & at 2.30 am I obtained Line clear & started for Arques for water & after obtaining same was sent on further to Ballastare where my relief was waiting on arrival at this place another Engine came in which was from the Siding in Campain & the Driver who was very much upset told me of his experiences. The first Bomb dropped struck a heap of Petrol which made the blaze & gave Fritz a good view of the Dump close by, which he soon hit causing shells to explode & pieces to fly all around. The Eng was hit in several places but the Crew escaped. The Chinaman in their compound scattered in all directions, some took shelter behind an Estaminet & a Bomb Dropped & hit the building killing them all also a lot of Tommies around about were killed & wounded, also Chinaman. The boys next day reported a terrible mess of things. On my arrival at St Omer, things were only middling. The boys at the Depot had a lively experience.\n\nThe Light from the Dump lit up the Town of St Omer & Fritz dropped several bombs about the Town. One Bomb went through the roof of the A.V.C. (Army Veterinary Corps) Barracks making a large hold & killing 7 Tommies & wounding about 20 others, also a Bomb dropped at the entrance to a dug Out which was a hole in the ground under a Big Heap of Firewood, the Dug Out contained 6 Tommies & 4 Canadians 4 of them were close to the entrance & the other 6 inside & the concussion killed the whole lot, the 4 near the entrance were all buried & had to be dug out & the other 6 were all sitting down & were found like that Dead. Unfortunately there was only one opening & the concussion could not get away. There were several Motor Cars standing along the road in front of the Dug Out & several Lads were also hit & killed, one chap was killed & blown right up into a Tree & there he was found hanging, also a horse near by was killed. Another Bomb was dropped right in front of the Station & smashed all the Glass in the windows & Doors also smashed. The face of the Clock, & stopped it at 12 midnight. Lucky no bombs were dropped in the Depot. From Sunday until today Wednesday, Fritz has left us alone, although coming over but dropping\n\nnothing.\n","55":" I paraded yesterday to the Doctor about getting some teeth out & I have to go to No 4 Stationary Hospital at Arques on Friday to have one tooth stopped & two removed & a new bottom place later on, as my top plate was very loose I had placed it in my Handkerchief but when I arrived at the Hospital I could not find my Plate, so I will have a bit of trouble to get a new top plate, anyhow my luck may be in & the plate may be found before Friday. After two weeks spell from Duty, during that period I had to go No 4 Hospital every other day & after a lot of humbugging about I eventually had the Tooth filled & a new top & bottom plates fitted which I am pleased by much with as they are a splendid lot & a good fit. I started work again on local runs on","56":" & on June the","57":" was notified to start on Leave to Blighty next day, which naturally gave me much pleasure, as I had just missed going in March by a few days. I reported \nmyself\n at the Orderly Room & paraded before the Doctor for Medical Examination at 9 am & after satisfying him I was in good health & clean I received my Furlough Papers also 50 Francs to see me over to Blighty & was instructed to proceed by the Leave Train leaving St Omer at 2.30 Pm, so after buying a few Soveniers, up the Town & a good Dinner I took my\n\nKit & proceeded on to the Station with another Pall & at 2.30 the Leave Train arrived, which consisted of a large number of Covered Vans with seats & a stove in the Centre. After walking along the platform for a Van my friend & myself came across some Australian Boys & naturally we joined them. At 2.40 Pm the Train pulled out & proceeded at a slow pace stopping at \nseveral\n two places enroute namely Les Foutinettes & Watteu & eventually arrived at Bologne which was the Port we had to embark from. At 6.45 Pm, after all hands had been lined up outside, & formed into four Deep, we started on our way to the Rest Camp. There was no mistake we all were a mixed lot, Lads from a large number of Regiments & in all sorts of condition some no doubt had just come from the Trenches by the appearance, two lads were wearing their steel Helmets & their clothes were all torn, anyhow they were all in good cheer, so their condition did not worry them in the least. There were about 500 men in our Party & after a steady walk through several winding streets up a steep Hill we arrived at the Rest Camp No 2 at 7.15 Pm, & as we went through the Gates we were handed two tickets each, one was for our Dinner & the other for our Breakfast. We continued on until we arrived between a row of Tents & the N.C.O. in charge allotted eight\n\nmen to a Tent. This Camp is situated right on Top of a Hill & is well laid out. The Tents are all let into the Ground down about 18 inches & the Earth is banked up around the sides & the Tents are raised up & the sides are secured on the Bank by Pegs, so when one is laying on the Boarded Floor there is about 3 ft of earth all around, of course this is done for the purpose of protection from Bomb’s, as only a direct Hit would do any harm to one sleeping inside. There are about 4 rows of these Tents. After placing our Kit in the Tents we all went along to the Dining Room for our Dinner, each man receiving two Plates & a Pannikan, & went inside in single file to a counter & was served with some Roast Beef & Potatoes also Rice & Raisins & some Tea which I enjoyed. I passed the remainder of the Evening strolling around the Camp & in the Canteen. Before turning in all hands received one Blanket, & all hands turned in at 10 Pm. Reveille was sounded at 6 am & after returning our Blanket we had to march again in Single File for Breakfast which consisted of Porridge one slice of Bread & Butter and an Egg, which all hands enjoyed & at 8 am the Boys were paraded & at 8.15 am marched off for the Boat arriving there at 8.45 when we were given two Scones each & then in Single File on to the Boat,\n\n& down below for a Life Belt which we had to put on & keep them there until Folkstone was reached. At 9.30 the Boat which is named Invictor, a Screw Boat of about 1000 Tons & very fast, there were about 1200 Boys on Board including about 20 W.A.A.C Girls. After a smooth Passage although a bit Damp by Rain we pulled alongside of the Pier at 11 am & as we disembarked ashore, all the Australians were called one side, there were only 38 all told & we were marched up along the Platform & waited until the Train came in. At 11.30 am all hands were aboard & off we started for Victoria Station, London & after a good run of two hours arrived in London, detrained & was marched off to The Australian Head quarters in Horseferry Road where we were given all information, change of clothing, a Hot Bath & last but not least a cheque for our Holidays. After I was fixed up I left to catch the Train to Bognor at the Station which left at 4.53 & it was a tedious journey having to change Trains at Sutton, Horsham, Ford & Barnham, I arrived at Bognor at 8 Pm, tired out after my long journey from France. After a nice Supper I had at my Sister’s House, I went along the long Promenade for a stroll until 10 Pm when I returned & had a long chat with my Sister until Midnight.\n\n"}}