{"Document Name":{"0":"Diary_0083","1":"Diary_0083","2":"Diary_0083","3":"Diary_0083","4":"Diary_0083","5":"Diary_0083","6":"Diary_0083","7":"Diary_0083","8":"Diary_0083","9":"Diary_0083","10":"Diary_0083","11":"Diary_0083","12":"Diary_0083","13":"Diary_0083","14":"Diary_0083","15":"Diary_0083","16":"Diary_0083","17":"Diary_0083","18":"Diary_0083","19":"Diary_0083","20":"Diary_0083","21":"Diary_0083","22":"Diary_0083","23":"Diary_0083","24":"Diary_0083","25":"Diary_0083","26":"Diary_0083","27":"Diary_0083","28":"Diary_0083","29":"Diary_0083","30":"Diary_0083","31":"Diary_0083","32":"Diary_0083","33":"Diary_0083","34":"Diary_0083","35":"Diary_0083","36":"Diary_0083","37":"Diary_0083","38":"Diary_0083","39":"Diary_0083","40":"Diary_0083","41":"Diary_0083","42":"Diary_0083","43":"Diary_0083","44":"Diary_0083","45":"Diary_0083","46":"Diary_0083","47":"Diary_0083","48":"Diary_0083","49":"Diary_0083","50":"Diary_0083","51":"Diary_0083","52":"Diary_0083","53":"Diary_0083","54":"Diary_0083","55":"Diary_0083","56":"Diary_0083","57":"Diary_0083","58":"Diary_0083","59":"Diary_0083","60":"Diary_0083","61":"Diary_0083","62":"Diary_0083","63":"Diary_0083","64":"Diary_0083","65":"Diary_0083","66":"Diary_0083","67":"Diary_0083","68":"Diary_0083","69":"Diary_0083","70":"Diary_0083","71":"Diary_0083","72":"Diary_0083","73":"Diary_0083","74":"Diary_0083","75":"Diary_0083","76":"Diary_0083","77":"Diary_0083","78":"Diary_0083","79":"Diary_0083","80":"Diary_0083","81":"Diary_0083","82":"Diary_0083","83":"Diary_0083","84":"Diary_0083","85":"Diary_0083","86":"Diary_0083","87":"Diary_0083","88":"Diary_0083","89":"Diary_0083","90":"Diary_0083","91":"Diary_0083","92":"Diary_0083","93":"Diary_0083","94":"Diary_0083","95":"Diary_0083","96":"Diary_0083","97":"Diary_0083","98":"Diary_0083","99":"Diary_0083","100":"Diary_0083","101":"Diary_0083","102":"Diary_0083","103":"Diary_0083","104":"Diary_0083","105":"Diary_0083","106":"Diary_0083","107":"Diary_0083","108":"Diary_0083","109":"Diary_0083","110":"Diary_0083","111":"Diary_0083","112":"Diary_0083","113":"Diary_0083","114":"Diary_0083","115":"Diary_0083","116":"Diary_0083","117":"Diary_0083","118":"Diary_0083","119":"Diary_0083","120":"Diary_0083","121":"Diary_0083","122":"Diary_0083","123":"Diary_0083","124":"Diary_0083","125":"Diary_0083","126":"Diary_0083","127":"Diary_0083","128":"Diary_0083","129":"Diary_0083","130":"Diary_0083","131":"Diary_0083","132":"Diary_0083","133":"Diary_0083","134":"Diary_0083","135":"Diary_0083","136":"Diary_0083","137":"Diary_0083","138":"Diary_0083","139":"Diary_0083","140":"Diary_0083","141":"Diary_0083","142":"Diary_0083","143":"Diary_0083","144":"Diary_0083","145":"Diary_0083","146":"Diary_0083","147":"Diary_0083","148":"Diary_0083","149":"Diary_0083","150":"Diary_0083","151":"Diary_0083","152":"Diary_0083"},"Date":{"0":"unknown","1":1729.0,"2":1731.0,"3":1733.0,"4":1740.0,"5":1741.0,"6":1742.0,"7":1743.0,"8":1745.0,"9":1746.0,"10":1747.0,"11":1748.0,"12":1751.0,"13":1752.0,"14":1753.0,"15":1754.0,"16":1755.0,"17":1756.0,"18":1760.0,"19":1761.0,"20":1768.0,"21":1769.0,"22":1770.0,"23":1808.0,"24":1809.0,"25":1811.0,"26":1814.0,"27":1815.0,"28":1816.0,"29":1820.0,"30":1822.0,"31":1825.0,"32":1829.0,"33":1830.0,"34":1831.0,"35":1832.0,"36":1833.0,"37":1835.0,"38":1871.0,"39":1872.0,"40":1873.0,"41":1874.0,"42":1877.0,"43":1881.0,"44":1884.0,"45":1885.0,"46":1886.0,"47":1887.0,"48":1889.0,"49":1892.0,"50":1893.0,"51":1899.0,"52":1900.0,"53":1901.0,"54":1903.0,"55":1905.0,"56":1906.0,"57":1907.0,"58":1908.0,"59":1909.0,"60":1911.0,"61":1915.0,"62":1916.0,"63":1917.0,"64":1923.0,"65":1925.0,"66":1928.0,"67":1929.0,"68":1932.0,"69":1933.0,"70":1935.0,"71":1936.0,"72":1937.0,"73":1940.0,"74":1941.0,"75":1946.0,"76":1947.0,"77":1948.0,"78":1949.0,"79":1950.0,"80":1952.0,"81":1953.0,"82":1954.0,"83":1955.0,"84":1956.0,"85":1957.0,"86":1958.0,"87":1959.0,"88":1960.0,"89":1963.0,"90":1964.0,"91":1965.0,"92":1967.0,"93":1968.0,"94":1969.0,"95":1970.0,"96":1971.0,"97":1972.0,"98":1973.0,"99":1974.0,"100":1975.0,"101":1976.0,"102":1977.0,"103":1979.0,"104":1980.0,"105":1981.0,"106":1985.0,"107":1986.0,"108":1987.0,"109":1988.0,"110":1989.0,"111":1993.0,"112":1998.0,"113":1999.0,"114":2000.0,"115":2001.0,"116":2003.0,"117":2004.0,"118":2005.0,"119":2006.0,"120":2007.0,"121":2008.0,"122":2009.0,"123":2010.0,"124":2011.0,"125":2012.0,"126":2013.0,"127":2015.0,"128":2017.0,"129":2018.0,"130":2019.0,"131":2020.0,"132":2021.0,"133":2022.0,"134":2023.0,"135":2024.0,"136":2025.0,"137":2026.0,"138":2028.0,"139":2029.0,"140":2030.0,"141":2033.0,"142":2034.0,"143":2035.0,"144":2036.0,"145":2037.0,"146":2038.0,"147":2039.0,"148":2040.0,"149":2044.0,"150":2047.0,"151":2048.0,"152":2050.0},"Entry":{"0":"\n\n","1":" \n\nFritz bombed the aerodrome last night. It was a lovely display. Enough to put the wind up anybody. The Concert Hangar was nearly full of Soldiers. The second Bomb hit the Hangar second next to the one in which the concert was being held causing some casualties in the crowd. Smedley told me he could see the red hot shrapnel flying through the sides of the shed, this Bomb also destroyed 3 Planes & set fire to the wreckage. The Flames lit up the place brightly enabling the Fitz planes to score some good hits. Smedley dived into an 18\" gutter. While there he noticed another chap being head on to him. Smed tapped him on the head saying are you hurt mate. The other chap answered \"No\" & almost in the same breath gave a screech & putting his hand to his \"rear\" bolted for his life. About 20 Heavy bombs were dropped altogether with the result that the 48th Squad R.A.F. was practically wiped out. This aerodrome is only a Kilo from the Dump. I made quite sure from where I was\n\nthat it was the Dump. It was a magnificent spectacle. 3 Big Bombing planes with an escort of 10 or 11 fighters, our planes were fighting the escorting planes, the Archies were also trying to paste them, while the Hangars were blazing to the skies.\n","2":"\n\nPlenty planes & Bombs again last night.\n","3":"\n\nMoved up to Froissy last night & got a dug out near the Lagoons & Canal. Fritz has left tons of munitions about here. There are also some crashed british planes.\n\n1.9\n\nSeen big Fritz gun over 15\" near Chuignes.\n\n3.9\n\nArrived in Paris from Froissy via Boulogne.\n\n4.9\n\nSeen Keller. Went to Bois de Boulogne & afterwards to Alhambra.\n","4":"\n\nTrip on the Seine to the Marne & through Paris, quiet Evening.\n","5":"\n\nMalmaison, Montmatre, & Sacre Couer Church. Dance at Moderne in the Evening.\n","6":"\n\nNotre Dame de Paris, law Courts, Church of St. Just (Oldest Church in Paris). Handed over diary to Censor.\n\nx\n\n9th.9\n\nHotel D’iena A.M. Dance in the Evening.\n\nx","7":"\n\nQuiet Day. Concert at Moderne in the evening.\n","8":"\n\nAfternoon, Musee Grevin. Evening Dined at Saulnerin Café & went to Folies Bergere. At the Folies the singing is no good the Chorus Girls not up to Australian standard for either looks, Dancing or Singing.\n","9":"\n\nFontainebleu. While on the way there we seen numbers of small French Tanks only about 9’ long. Fontainebleu Palace is lovely but most of the Art Treasures have been removed for safety. The surrounding forest is the largest in France. It contains some fine trees one 1400 years old. In the town there is a Bull (Sculptured) by Rosa Bonheur. The 1920 Boys went on a jag the other night & painted it red.\n","10":"\n\nDined at Hotel Diena & went to see \"Sappho\" at the Opera Comique. \nThis\n By the way these 1920 Boys make themselves very conspicuous with Ribbons & Rosettes and parade the Towns in groups, mucking\n\nup generally. They are allowed to do pretty much as the like for the last fortnight before the join up.\n","11":"\n\nThere are some sailors from the Yarra & the Huon here on leave. These two Boats had a collision in the Adriatic. Two of the Yarra Boys went right up to the line & came back laden with Souvenirs.\n","12":"\n\nTwo air raids last night one at 1.15 and another at 4.25. Messing about generally today. Swimming & Boating in the afternoon (Seine).\n","13":"\n\nRushing about preparing to depart.\n","14":"\n\nLeft Paris at 8.27 a.m., arrived at Peronne 6.0 p.m. Froissy midday","15":"\n\n22nd Sunday 9\/1918\n\nSome Yanks arrived here today. One of their mules kicked a \"Dud\" shell which exploded, killing 4 Yanks & wounding 8 of whom 4 died later, it also killed 5 mules.\n\n25.9.18\n\nStart in old job Elect. again tomorrow. Reg. Niddrie is in No. 39 Hospital I believe. He was in Paris on leave last March. There is a big Batch of 1914 men in Bray en Route to Aussie on leave. The 21st were advised today that they were not going to be broken up. There was much cheering. It was stated that they refused to be Broken up but struck, with the above mentioned result. The 2nd \nBattalion\n Brigade refused to go over a few days back.\n\nFriday, 27.8.18\n\nHelluva walk last night looking for 17th Batt. Didn’t find them. Much dissatisfaction here over the Tucker or rather the lack of Tucker.\n\nSat. 28.8.18\n\nThere is a most circumstantial \"Purfy\" about the 2nd Bde., refusing Duty, their O.C. threatened them heavily & later became a casualty. The Yanks are said to have backed up the Boys & to have acted comme-ca.\n\n30.9\n\nWent to Bernafay Wood Cemetary. Found Bob’s Grave in Good condition. Long walk.\n\n2-10\n\nA Brigade of Yanks, too eagar, as usual & rather slack at mopping up got isolated. The 3rd Div. broke through the cordon & saved them from being annihilated. The Prisoners here look almost starved. (At Messines stunt the 9th Cheshires got a lot of hard work.) .\n\nSunday 6.10\n\nPut the clock back one hour today. Also had a successful triall with the German motor salvaged from the big gun. It is now a Generator.\n\n9.10\n\nA couple of 1914 men en route to Aussie were blown up by a Bomb in Bray yesterday – souveniring. Our Battalion captured a village Mont Brehain the other day, 9.8.18, A Coy. had 42 Casualties, C also suffered Heavily. Both companies lost nearly, & did lose all, all their Officers. The Colonel volunteered for this little Job. Poor young \"Rowdy\" died of wounds.\n\n10.10\n\nWe left Froissy & entrained at Bray en route for Ville le Martelet about 3 Hours journey by motor. We took 3 Days packed like sardines & getting shunted into \nsardines\n sidings everywhere. We stopped some hours at Abbeville which enabled me (unofficially) to have a look around the Town. Fritz bombed here a lot. We also hopped off at Longpre looking for a meal. (Our Q.M. went by motor so we lost touch with him during these 3 days. Tucker was therefore rather scarce.) The Train left without us (4) so we had to walk the rest of the way. \"No Bon\". Nice Chateau at Flixecourt owned by Mr. Saint who apparently owns Flixecourt also. He has a number of Factories in the vicinity & also\n\nin adjacent towns.\n\nTuesday\n\nPerishing for lack of lucre. Visited Flixecourt in the morning.\n","16":"\n\nPutting Elect. Lighting in the Camp through the Week.\n","17":"\n\nEngine Driving last night. Engine room (Lent) infected with Frogs was trying the effects of Electric Shocks on them (the Frogs). They didn’t like it, but it didn’t seem to injure them permanently. The Driving Belt was running just a few inches above the Grass. The Frogs thought it was a plank I think so because they used to Hop on to it, I never noticed the same Frog do it twice. As soon as they struck it they used to fly off, spinning so rapidly that they looked like Green Balls. A couple were foolish enough to hop on to the exhaust pipe of the Petrol Motor. That was the last thing they ever did (it was nearly red hot). Several were blown Kite High by the Blast from the exhaust. I went to Abbeville this morning. Had a lovely Drive on a Lorry, through beautifull country, the morning was misty & fresh. I don’t think I will ever forget the loveliness of the trees with their autumn colouring. Spring merging into Autumn \nthat\n is the prettiest sight I have seen.\n","18":"\n\nThe Boys now have a Pierrot Troupe of their own. No one is likely to mistake them for professionals for a little while anyway.\n","19":"\n\nWe played the","20":" F Coy. A.E. yesterday at Soccer & Aussie Football (& got beaten at both), later we gave them tea & our alleged Pierrots entertained them.\n\nI don’t know how the concert got on because I had to look after the lighting unit. The Engine was \"Tres Malade\" & gave me an anxious time. Ditto every night until the\n\n28.10\n\nHad a look over the Weaving Factory at Flixecourt today. Seen them making carpets of all kinds, some kinds of Braid & Jute, Canvas, Calico etc. (Saint Freres). I had a tooth stopped yesterday after two temporary fillings. The Dentist had about a company waiting for his attentions. He gave me a rather painful Quarter of an hour. I had to use Petrol as an Insecticide lately (not for Chats) it was very effective but unpleasant.\n\n31.10\n\nThe Engine has been getting overhauled and altered ever since I came on it with the result that I have to learn over again the possies for the best mixture, speed control, & Timing. In addition I struck a new trouble last night. The Engine flywheel is 3’3\" in Dia. & the Dynamo Pulley is 7\" in Dia. The distance between pulley centres is 24’. At just the right speed for the Engine the Belt develops a lateral swing & plays hell generally. At any other speed the Engine will stop after about 10 min.\n\n1.11\n\nVisited the Bat. yesterday. Although they have been out for nearly a month & have received a number of Gassed & wounded men back, their Parade state is only 422 now. No. 1 Platoon A Coy. draws rations for 12 men. While at Villers-Brettonaux the full strength of A Coy. on a working Party one night was 14 this number on later nights was gradually increased to 27. They only went out on alternate nights about this time.\n\n2.11\n\nOne can get some surprising results by calling one of the Gordon Highlanders \"The Kaisers Bodygaurd\".\n\nOne\n The","21":" Div. exhibited some German Guns in the Square at Bailleul with a placard stating they were the first Guns captured by Aussies. The A.I.F. captured German Guns at Pozieres 1916 & then the","22":" joined them there about & seen it they nearly went mad. There has been some sand bagging around here lately so there was a big raid this morning & every one outside the limits of his own camp was gathered even if he had a pass. Our Dental Parade came back under escort from Saint-Ouen & the Sgt. Major had to go out at intervals through the day rescuing Blighty leave men & other fellows who had leave passes to Amiens, Picquigny & other towns.\n\nVisited Amiens yesterday. Was surprised at the number of Civilians who have returned there. Business is in full swing although a whole pane of Glass is quite a curiosity. Scarcely any of the Houses have been repaired. I visited the Cathedral, only one shell (a Dud too) landed inside. It came through the Roof & smashed a couple of tiles on the floor, the rest of the damage consisted mostly of Broken Windows. Nearly everything of artistic value has been removed. Here in the public market I seen Horseflesh for sale, it looked alright. It was plainly branded \"Cheval\".\n","23":"\n\nWe had two wins to-day. We won the war & our soccer team beat the","24":" Field Coy. The most marvelous thing I ever seen was the cool way in which our fellows took the fact that the war was ended. There was no excitement at all. Only\n\na bit of a rush to buy Papers. The Frenchies are wild with joy. Flags are being dug out of all sorts of odd corners.\n","25":"\n\nFrost still on all day. Went to a Dance in an Estaminet last night. Met some prisoners & the Sergt. of the Guard drinking in another. Drank quite a lot of Vin Rouge. A lot of our boys have been getting hidings in Flixecourt lately, from Tommies, there is no love lost between them. Our Camp Dogs \"Steve\" & \"Spot\" the former especially have been taking walks with Jim & I in the mornings. Steve’s antics on being shown a Mess Tin by Wallie were very laughable.\n","26":"\n\nMr. Wright notified me that he had despatched my Diary on the","27":" On the evening of the","28":" I was walking into Saint-Ouen when I was run down by a side car. My left ankle sustained a severe wrench. I was brought back to Camp in a motorcar & have been stuck in bed ever since. The A.M.C. man wanted to send me to Hospital but at my request allowed me to stay in camp. He is treating me himself. I think it will be a couple of weeks at least before I will be able to hobble anywhere. Stiff luck to get a knock one week after peace. I would have had a chance for Blighty if it had been war time. Jim Clarke was with me when it happened.\n","29":"\n\nPoor little Steve was shot this\n\nmorning by a French Gamekeeper. As soon as the crews arrived two of our fellows Austin & another, Ridley, went out with Rifles but could not find the Froggy. If they did I firmly believe they woud have shot him dead. Steve has been buried & a Cross is being made for him. I am still roosting in my Bunk. Cannot put my foot to the ground.\n","30":"\n\nMy Foot is still bad, but I can hobble around with a stick. I was called up for orderly room to-day & informed that I would have to go to Hospital as we are going to move in two or three days & I will not be able to march. I said nothing but intend to hang out until I am kicked out.\n","31":"\n\nThere is a \"Purphy\" floating about to the effect that the","32":" &","33":" Divisions are out on strike. The yarn runs that after they arrived about Strasbourg they were put on Salvaging Barbed Wire. They soon got sick of that & knocked off saying they had captured enough prisoners to do all that. For punishment they were sent on a 12 miles route march. After reaching their destination they were ordered to march back but refused: finally motor lorries were sent out to bring them back.\n","34":"\n\nThe ancle is still very weak but I managed to walk half way to St. Ouen yesterday.\n\nWith reference to the above mentioned \"Purfy\" I don’t believe the 1st &","35":" Divs. reached Strasbourg at all.\n\nSome of the 3rd Army have arrived in Flixecourt \nthey\n","36":"\n","37":"\n\nApplied for instruction in fitting & turning under the educational scheme. Very good weather. So far we haven’t seen any snow.\n","38":"\n\nNo snow yet. Plenty Rain. Got a ride on a motor to Flixecourt yesterday. Had a meal of Eggs & Chips while there. While so engaged a women came into the House accompanied by a one-armed Frenchman. She borrowed some crockery, then both of them went out. Madame then explained. \"Monsier he discharged Soldier, wounded at the War, lost his arm. While he was fighting his Mother & two Sisters 16 & 18 years old were killed by a German Bomb\". He was going to marry the young women the next day. I asked about the Crockery. Madame shrugged her shoulders & said, \nshe is a refugee. She has nothing, the Crockery is for the Wedding?\n Her Brother was also wounded, shot in the head. This is simple cold fact and (the pity of it) so common that Madam never thought of mentioning it untill questioned.\n\nA.I.F. Photos\n E.81 Dressing Station, Bern, E.137 138 Del Wood Duck Boards, E.145 & 190 Bernafay Cem. in the Distance, 337, 8, 9 Butte. \n\n7.6, 7.7 Cloth Hall, 1255.6 7.8 Ypres from the Air, 1398 Little Gate, Ypres, 1509 Catacombs.\n\nMonday 16\/12\n\nLeft Flixecourt in the morning and (after a long motor ride) arrived at\n\nCambrai in the Dark. We were billeted in the College, a large Building built around a square. I have been told that there is a regular Catacombs underneath. Just in front of the College there is a nice little park containing a monument in honor of Bleriot. Cambrai is the best laid out Town that I have seen in France except Paris. It has some fine Boulevards & splendid buildings. Our Airmen & also Fritzs smashed the Town up a bit. The square in particular seems to have been burnt out. A lot of the Civvies told us we were the first Australians they had seen. They nearly always take us for Yanks. We left Cambrai at about 10.30 p.m. & had another long ride to Jeumont arriving there late on Tuesday (17.12) night. We passed through Maubeuge (a large town) on the way. It was very interesting passing through Maubeuge. We passed through Gate after Gate. There were Citadelles, Ramparts, moats & all sorts of old fashioned fortifications including some Bridges, which Fritz very thoughtfully destroyed. We must have passed about 100 destroyed Bridges on this trip.\n\n20\/12, Friday\n\nFritz destroyed an enormous amount of material here. At Jeumont Station he packed trains for half a mile 12 & in some case 14 times abreast, these were all filled with munitions, merchandise & all sorts of valuable\n\nGear. It is impossible to give even a remote idea of the value of their contents. After assembling them he burnt the lot. Fancy wagon loads of heavy caliber shell, train loads even, cartridges by the million, explosives of all kinds. All that is left is a mass of twisted Iron. The Rails were broken into short sections. Great holes were torn in the per. way. Engines & trucks were even blown bodily off the rails on to the edge of the fields. The houses adjoining the line were blown down by the Explosions. Even some distance away they were de-roofed. I only seen half a mile of this sort of thing. I couldn’t go farther on account of my ancle but Robbie assured me that the destroyed material (but not to the same extent) extended 4 kilos down the line. I was out with a party today salvaging Electrical Material. Fritz had hundreds of all kinds of \nmaterial\n motors, Dynamos, & Electrical gear of every conceivable kind assembled in a Great Factory. He must have looted it from all over the country. We are taking a lot of it to set up a technical School for the A.I.F. By the way I had a little crane driving stunt. Later on one of the Frenchman (Crane Driver) Elec. short circuited a couple of mains with a shovel & settled the\n\nCrane for today at any rate giving us a lot of unnecessary work & overtime. They have notes here of all values from one Halfpenny upwards. Some are issued by village Syndicates, these latter look like Bus tickets but are about 1½\" x 1\" in size.\n\nSaturday, 21\/12\n\nHad another afternoon as Crane Driver. Our Tucker here is somewhat scanty even now. It seems that Fritz blew up bridges, Railways & Roads to such an extent that it is very difficult to get the food up. The people here on the French side of the Frontier haven’t a darn thing. But if one walks up the street about a K.M. or 2 (on the Belgian side of the Frontier) one finds Estaminets open, Fair Beer at ½ the French price for \nBad\n Beer. Plenty of Lollies, mechanical Pianos & Dancing in the Estaminets (Mdmlles too). The French tell me they can’t get even Bad Beer. A Kgrmme. of coffee costs 38 Francs, no sugar, no anything. But the Belgians seem to have plenty. I’d like to know why I weighed 11 stone today.\n\nMonday, 23\/12\n\nAmong the gear salvaged are a number of small Generators direct connected to what looks like a small mech. motor with an interrupting device in the Generator circuit. I believe these are Dynamos for small wireless sets. They are wound up by a crank & then let go like a clockwork toy. I will probably have more to say about them later on. One fair sized Dynamo here has Graphite Brushes.\n\nMac’s letter.\n\nAs one travels North the Girls seem to get broader & squarer in face & Build.\n\n25\/12, Xmas Day\n\nIt snowed last night for the first time this winter. We received no rations yesterday. I suppose that was part of the Xmas festivities. We have been much worse off for rations since the war has ended. A Tommy R.E. repairing the Bridge here told me that Fritz destroyed 1370 Bridges in his retreat. Some of the 13th Light Horse are Billeted here.\n\n30\/12\n\n500 Hun prisoners came here to work today. Our fellows conducted a very successful dance at the Cinema Hall last night. Any residents who associated with the Huns while they were here were barred. The Rations still continue to be rather elusive. I had a look at a big marble works today.\n\nNew Years Day, 1-1-19\n\nAttended dance at Cinema Hall, the Girls here dance pretty well but very few of them can reverse. There was an awful crowd.\n\nSaturday 4\/1\/19\n\nI visited the Central Station today. It was well worth looking at. It contains two 5000 K.W. Turbo-Generators, Two 3000 K.W. Turbo-Generators, old type and one 2,250 K.W. modern type with Auxiliaries, Switchboards, Bench Boards, etc. It supplies Jeumont, Maubeuge with light & power and parallels with another Station at Valenciennes. The residents gave us a Dance in the Evening. The music\n\nwas, as usual, terribly fast. I learned three new Dances. The French Quadrilles (all Chasseing, Chain & Changing Partners) the \"Pas de Paliniers\", something like La Rinka, 2R. 2L. 4 alternate R & L, ½ Circle + Ditto - & Waltz. The \"Varsovienne or Redowa\" this one is a regular Brute, 3 side steps R, ½ circle, 3 side steps L, & ½ circle again Mazurka Time. This was a rather Select Dance, but all the same the Ladies used to breast the Bar for a Beer when they wanted it & were not above using the same Latrine as the Men. Open Latrines are the order of the Day here. Isolated ones being placed alongside Doors of private Houses. A few of the Ladies were told to retire. We found out later that they had associated with the Germans when the latter held this territory. All people who had any dealings with the Germans are black listed here.\n\nWednesday, 8-1-19\n\nI’m always speaking of the coarseness of the country people in France. Another instance, (a) Drewel a young French was suffering from Syphilis when asked what ailed her her invariable reply was \"Malade of the –\".\n\nA number of 1915 men are leaving here now, nearly all 5th Division.\n","39":"\n\nWent to Belgium today instead of work. While on the way a Tommy Officer asked me if I could do anything for a Belgian who had just been blown up by a \"Dud\". I had a look at him, but it was impossible to do anything. Fragments of shell fully 3 inches\n\nlong had pierced both of his thighs close to the Groin. He had also a number of other ragged holes between the thighs & knees. While I was there a Doctor came up & I left. In spite of his terrible injuries the Belgian was quite conscious. He could not possibly live much longer. His legs seemed to be going quite black. We have had 2 fine days since we have been here, and only one snow fall. I believe it seldom snows here. It is too busy raining I suppose. The Belgian mentioned above died the same night.\n","40":"\n\n38 1915 men left for Aussie this morning. Jim Tait & Bill Rollins Q left from this Billet.\n","41":"\n\nThe winter here is, at present, very mild. We have had very few frosts, one fall of snow, & altogether it has not been as cold as an Australian winter. I have not worn a Cardigan or an Overcoat since I have been here. I went out with Tonkin last night & visited 3 different places, the principal idea being to get accustomed to French conversation. I could never get accustomed to the people I seen last night. They are good natured etc. but as rough as sandpaper. Their French is of a very low order, ungrammatical, & full of argot, worst of all they adopt a kind of pidgin French when speaking to\n\nus, thinking they are making their meaning clearer that way.\n","42":"\n\nI took a walk over to the fort just outside Marpent yesterday. It was rather badly knocked about in 1914. There was nothing striking about it, everything underground of course. Received our Xmas Parcels from the Comforts funds last night. Mine came from Thebarton Infants School, Soustralia (Miss Hamence School mistress) it contained notes from James Colin, 4 Huntriss St., Torrensville, S.A., Billy McAloney, 14 East Street, Torrensville, Eileen Watson, no address. The School is located on the Henley Beach Car line 1½ miles from Adelaide.\n","43":"\n\nG. Hodge brought home one of his gang of Fritzs and installed him here as Batman. He is a rather well educated young fellow and speaks English fairly well. These prisoners don’t get enough to eat, they only get ¼ of a loaf per diem and ½ a Dixie of meat. No midday meal, every 2 or 3 days they get a couple of Biscuits. They eat all sorts of Garbage if they get the chance. I gave this chap a box of soup tablets and a lump of Cheese, he almost slopped over. I went visiting last night to practice French and as usual after a few words, they put the acid on me for Petrol, Jam, & Carbide\n\nbut they had no luck. Madame had been on a smuggling expedition to Belgium that day and brought back about a Bolster full of Tobacco.\n","44":"\n\nSent P.Cs to Dixon & Clare last night. We have had a steady heavy Frost for the last few days. There are still odd casualties caused by \"Duds\" at the Station.\n","45":"\n\nNice heavy fall of snow today. I went out yesterday with a four-wheel drive Lorry & done 3 trips for 64 lamp sockets. I have been out with motors & crews of prisoners getting gear for the last 4 days. In one case I went out with a Brigadier and Colonel to select gear for a picture show.\n","46":"\n\nI met E. Huxley at the dance last night. He is a Sergt. in the","47":" Div. He told me that he had a good spin having been in England at least two years as an Instructor, on further conversation I found out the he was the Electrician \nwho\n for whom the Picture Show outfit was being selected by yesterday. He didn’t like the Unit I selected so I had to take him today to a big Workshops and turn him loose. They produced a couple of machines and were testing them for him when I left him. I had a gang of Huns and an F.W.D. to look after as well so I couldn’t spare much time.\n","48":"\n\nHuxley went away yesterday. I attended the final Dance last night, came away at half time, after a bad time. Lately they have been weeding out at the Dance some of the girls not receiving invitations and in nearly every case the ones who have not been invited were the best Dancers. We have now a lot of nice Girls who dance like cows in a ploughed field. This is the result of having a Secretary (Cycling Sergt.) who knows – all about dancing.\n","49":"\n\nA motor lorry went to Charleroi on Friday morning last so I attached myself thereto and paid an unofficial visit. We had a rough trip going. The Driver (a Tommy) found a new route of his own via Mons which was only about 25 to 20 kilos longer than the ordinary route, this caused some delay and language. Don’t forget that it was snowing and there had been a heavy frost for the last two weeks, still we eventually arrived after 4½ hours bumping. The","50":" Div. were billeted close to or in the Town. We seen quite a lot of mines around the Town and the snow covered Dumps looked like miniature mountains. (There are 32 mines around this Town I believe.) Prices are coming down but there’s still plenty of room for improvement, Eggs 9½d each, oranges 8½ each, Butter 22 Francs per kilo (about 8\/- per lb. The people eagerly buy clothing, food, & Tobacco from the Soldiers. They will give 80 Francs for an overcoat\n","51":" for a shirt & so on. Unscrupulous Soldiers are going well buying things from the Canteen & selling them at a profit. There is a good Y.M.C.A. (A.I.F.). I visited a very high toned Cinema Hall. It was full of long narrow tables, fringed with Chairs. After paying for admission one is expected to sit at the tables & buy Drinks during the performance. The music is very good. Really people go there to sit down or promenade and have a look at each other. The performance is only a secondary item. There were some very smartly dressed women there, quite as smart as Parisiennes. One of the sights of the town (for the A.I.F.) is the Anatomical Museum ( the waxworks), here one can see the interior of the human body and especially the organs of Generation displayed in an extremely candid fashion. Gestation and the effects of venereal disease are very fully exhibited. Some awfull effects of Syphilis are shown by Waxwork Models with explanatory notes attached. Waxwork models of stillborn children showing effects of Hereditary Syphilis are shown. Also models of other poor little unfortunates who were not so lucky as to die before birth. I noticed some very tall steel Towers apparently used for Telephone wires. From these Towers as a centre the wires radiated over some\n\nvery long spans. I came home via Beaumont & had the bad luck to be left behind at the latter place, however I battled around and managed to locate another Lorry & lobbed home all serene. Three other fellows who went with me but stopped at Mons instead of going on to Charleroi had rough luck. They couldn’t get a Lorry back and had to walk nearly all the way (about 23 Kilometres).\n","52":"\n\nDance last night (up to putty). 6 Inches of snow fell through the night. The Orderly Corporal tried to call the roll this morning but was snowballed out of sight. Sent Card to Belinda and notebook to Jack. Sugar costs about ¾ per lb here. Whips of Snowballs about.\n","53":"\n\nStill freezing hard. At the dance last night they sprinkled water on the \nfloor\n cement. It immediately froze and the floor (cement) was fast enough for anyone for the first 6 Dances. Its cold alright the Sambre is frozen along nearly all its length and it has a fairly strong current too. Amused myself today playing Ducks & Drakes on it. I was much surprised at the tinkling sound of the stones as they skidded along the Ice. The snow still lies deep on the ground and is\n\nas hard and dry as sand, it makes a crunching noise like sand too. It is impossible to make snowballs with it.\n","54":"\n\nFor the last few days the Tommies have been using explosives to break up the Ice as it forms near the place where they are building the Bridge. I tried sliding today with very indifferent success, found a few Marble quarries on the other side of the River (St. Anne’s Marble). Seen a number of kids with little sleds \nand\n driving them along with steel spikes one in each hand. They got along at a fair pace. The School is not doing well. We have tons of Dynamos, motors, etc. installed but the only prime movers are a Traction Engine about 30 or 40 H.P. and a portable Engine of about 8 H.P. The severe cold has frozen the water pipes so that most of the time these two Units are out of action, they also break down periodically.\n\nThe chief industry of this part of the country just now is scrounging wood. Every other person one sees is pushing a barrow load of wood. The wrecked houses, Factories & sheds up the River are being taken away\n\npiecemeal by enthusiastic fuel collectors. A number of them use sleds and shift very heavy loads with very little trouble. There seems to be some chance of a thaw now so the sleds will have to be cut out.\n","55":"\n\nI took unofficial leave to Brussells today. After starting out at 7.30 A.M. I travelled via Beaumont & Charleroi arriving at 4.30. I then walked about seeing things also looking for Tucker & lodgings.\n","56":"\n\nThe first thing I noticed was a queue of about 300 waiting for Condensed Milk, this was about 9.00 A.M. as I was starting out on one of the sight seeing Trips. We went to the Botanical Gardens. Like all the Gardens they did not show up well on account of it being mid Winter. They are small & rise in terraces ornamented with Bronze Statuary, the statuary is very fine. The summer houses and winter Garden came next, one of the Glass houses contains a section of a Sequoia Giganticus 1350 years old. Labelled as the oldest tree in the World but I fancy that one of the Oaks in Fontainebleu Forest claims 1400 years and is still living. Eglise St. Marie came next but showed nothing remarkable except a very fine Dome and an old party who walked in front of the man who\n\ncarried the Plate. He was dressed in a medieval Costume and carried a Halberd not unlike a long handled Battleaxe. He also boasted a fine Crimson Sash worn across one shoulder. I don’t know what his job was unless it was to bluff the Congregation into putting money in the plate, if so, he \"came a Gutser\", the collection panning out about 5 Francs. Colonne de Congress, Parc Royal now closed for the Winter. Here the Elm Trees are pruned so that they look like screens. Royal Palace closed to visitors and finished at the Palais de Justice. This is a wonderfull building of tremendous size both inside and out. The most wonderfull thing about it to me was the foundations. It is built on a steep slope and on one side there is a very long Zig Zag approach. In the evening I went to the Palace D’ete, and seen a second rate vaudeville show poorly stage managed. This is a skeleton steel hall of Great Size with an arched roof. I should think it would hold about 10,000 people easily but God help them if it ever catches fire.\n","57":"\n\nPlace des Martyrs, Eglise St. Nicholas, the outside of this Church cannot be seen at all, it looks as it is cased in with Shops. The shops are \n\n(Porte de Halle also but didn’t go inside. This is the last of the old fortifications.)\n\nstuck with their backs right against the Church giving a curious effect difficult to describe. Grande Place containing Hotel de Ville, Maison du Roi and Guild Houses, most of them elaborately Gilded. The Hotel de Ville is a beautiful building with a lovely spire but looks lopsided owing to the spire not being in the middle. The English officers were dancing in the Ballroom of the Hotel-de-Ville when they were summoned to the Battlefield of Waterloo. There is also the marriage room where all marriages have to \nbe\n take place first or the ceremony is not legal. Mannekin Pis came next but I have nothing to say about that little wretch, excepting that he ought to be smacked.\n\nEglise St. Michel et St. Gudure a very very lovely Church from any point of view with a magnificent Pulpit of carved wood (called by the Guide an altar). I liked the inside of this Church better than anything that I seen in Brussells, it is magnificent, one could linger there for weeks, the windows are very lovely. Everything is harmonious even the Cathedral at Amiens never affected me as much as this. Palais de Beaux Arts said to be one of the finest in Europe but unfortunately I haven’t the technical knowledge to criticize this. One of the Pictures is\n\nrather coarse \"The King drinks\" in this a baby is seen trying to emulate the Mannekin.\n","58":"\n\nHad an all day trip to Waterloo about 18 Kilos out. While we were on top of the Pyramid our Canadian Guide caused some amusement by pointing out the place where the 600 charged, the same Guide when showing us the Palais de Justice gave us the history of the Hotel de Ville instead. These Canadian Guides are the biggest Duds I have ever heard or seen. Some Yanks here bought old fashioned triangular Bayonets supposed to have been dug up on the Battlefield.\n\nBrussells is an extremely lively place indeed every night is like a Friday night around the Block. The Cafes are ablaze with light, by the way there must be more and bigger Cafes in Brussells than anywhere else in the World I believe. The Pavements are crowded with Hawkers selling practically everything. On Rainy nights they monopolize all the Shelter and nobody ever interferes with them. Of course some of them are practically begging, selling matches, Chocolates etc. Another game they get up to is going around with accordean or small piano, singing songs and selling copies of the Words. The Tramway system is large and complicated, but\n\nI never seen a signal anywhere and some of the Junctions notably the Bourse and at the Gare du Nord are very busy. The Lord only knows how they avoid accidents, the Fronts of the Cars are provided with a periscope on the right side to enable the Driver to see anyone getting in or out. The System includes both overhead & conduit.\n","59":"\n\nLeft Brussells at 2.00 P.M. Hellova crowd on the Train as there is on every Train now. Part of the way we were running alongside the Canal and I seen one Barge being towed by 2 middle aged women in harness and another being towed by 3 young women, in each case there was a man ? lolling back in the stern of the Barge occasionaly touching the steering oar. A Belgian considers it Infra Dig to work while there is a women about. That long Frost broke while I was away. By the way the Battlefield of Waterloo is quite 3 Kilometres at least from the village of that name. The nearest station to it is Braine-Alleud I believe.\n","60":"\n\nHad a hellova walk today looking for Quatre-Bras, eventually found it.\n","61":"\n\nSome of the Ladies ? came an awfull crash at the Dance last night. All through the series the Dance Sec. has been weeding out what he calls the undesirables. Last night the\n\nweeding out was very drastic and a number of incensed Anzacs are howling for the Sergts. Blood because their Tabbies were knocked back. All the undesirables are on the official list as having had \"Beaucoup\" intercourse with the Germans and the majority have also been in German Military Hospitals with Syphilis or clap. These undesirables include about 20% of the Ladies ? and when one adds to that the number who did likewise but were lucky enough to escape observation one is inclined to think that French Patriotism \nlikened\n is nearly as negligable a quantity as French morality. Let alone looking for it I have had the plain hard question put to me several times in this innocent country Town.\n","62":"\n\nArrived here (Charleroi) yesterday afternoon after getting the sack from the Workshops. We are not doing too bad, being billetted in a big house with some \nFrench\n Belgian Civvies, we have a room on our own, a feather bed, Electric light and very nice people, a particularly nice little girlie about the same age as Ciss.\n","63":"\n\nAn Aussie was shot in Charleroi last night in some brawl. Signed statement that I had no claim to make against A.I.F. for injuries received on active service.\n\nBefore the war a boy had to deposit 100 Francs to join the Boy Scouts in Belgium. After 3 years service this sum was refunded.\n\nLetter to Base P.O. notifying change of address.\n","64":"\n\nThe Clocks were advanced one hour today.\n\nMarcinelle is the name of this suburb. Wrote to the Agent General last night. Terrible \"Purfies\" floating around about sandbaggers etc. Charleroi out of bounds after tonight.\n","65":"\n\nHad another trip to Waterloo yesterday. Travelled by Train from Charleroi to Braine-L’Alleud. We had a very wet trip. The train took 3H.10Min. on the return journey (about 37 K.M.) it was as usual crowded. I sent some Cards to Mum, Ciss & Mollie \nwhile\n from the Waterloo P.O.\n\nOn Monday last there was a demonstration in Charleroi to celebrate the inauguration of the Eight Hour day on the Belgian Railways. Just now the miners are on strike for an Eight hour day also. Formerly the Belgian Railway Employees worked 12 hours per day.\n\nCharleroi was only out of Bounds for 48 Hours, Sunday midnight till midnight on Tuesday. I don’t think they caught many strays.\n","66":"\n\nBattalion Gaurd today.\n","67":"\n\nFinis Gaurd, thank God. The people here obtain water from stand pipes in the street. These stand pipes are operated by a Box Spanner and the water only flows while you hold the spanner. I discovered a lady chess player here, Miss Murray-Prior. She plays well, beat me 2 games \n\nout of 3 on Thursday night. We scored one game each on Wednesday. An eager onlooker who did not hesitate to criticize & incidentally mentioned that he was a Tournament winner had a few games with her on Saturday and registered a \"Gutser\" being licked two games out of three.\n","68":"\n\nThe abovementioned on-looker had another few games with the lady and lost two of them. \nand\n In the one he won she lost a Rook by a palpable oversight and refused to take his queen when he left it up for her. I got my own back off her on Saturday winning the odd game & we got one each last night. I don’t know whether I have mentioned the great \"Combien\" Society here. I will not go into details but simply mention that it is a great industry. The principal market is on the Bank of the Canal in front of the Aust. Corps Camp. There is no sewerage system in this Town at all. People leave \"parcels\" anywhere. In this house the people are finically particular in the house but leave \"parcels\" anywhere in the yard which naturally \"hums\". I went to Jumet (on the main Brussels road) with Monsieur on Sunday last. The Hon. Fritz seems to have knocked this suburb about more than any other part of Charleroi. He compelled the inhabitants to brick up the Doors & windows of the wrecked houses so as to conceal (partly) the damage done. Here I frequently seen a notice \"Begging from foreigners is forbidden\".\n\nThere is very little doubt that the allied Troops are the foreigners mentioned.\n","69":"\n","70":" 1915 men leave our Battalion today for Australia. Bath Parade in the morning, at one of the Mines. The miners on arriving at the mine change their clothes. \nwhich\n They hang the discarded Clothing on Grapnels which are then pulled up to the roof of the Bath House and the end of the pulley chain secured by a Padlock of which the Employe retains the Key. Women and \nchildren\n Boys of less than 16 years work underground. Children under 16 \nonly\n work 9 Hours underground. Over 16 they work 12 above & Below. There were two women working in the lamp room and I seen other women trucking. (I gathered the above information from the Rules pasted outside the mine office.) Right through this country if there are any easy Jobs going the \nmen\n get them. The old man was much surprised when Andy mentioned that we might be sea-sick going home. He seems to have a dim idea that it is possible to reach Aussie overland. He has no idea of how far away it is although I have explained matters to him several times. He knows what I say but cannot realize it. One young chap in a middle class family here (fairly well educated too) though Australia & Egypt were in England. He actually believed that Australia was in London.\n","71":"\n\nGaurd today. The Batt. has been getting very slack lately. On the Gaurd\n\nreceiving the order \"Fix Bayonets\" the R.H. man couldn’t draw his bayonet he had put it in the sheath ‘arse about’ & it got jambed. The inspecting officer nearly had a fit. It was one of the roughest Gaurds I ever had anything to do with. The Orderly Officer gave us a bad time and crimed one of the prisoners too.\n","72":"\n\nThe Battalion Church Parade consisted of 12 men & an Officer. Result a frightful row, the O.C. reckons he’s going to show the Battalion \"What’s what\". I don’t know if I mentioned it before but the Battalion has only Two Companies now (A.D.) Company and (B.C.) Company. The Aust. Corps held a Boxing tournament since we arrived and I had a look at the scrapping, the competitors showed a very sporting spirit, altogether it was a very good \"turnout\". The old man is still a bit uncertain about Australia. He asked me yesterday whether it was as far away as Algeria. I would like to learn French but as I can’t do so without conversing with people who know as much or perhaps less than he does I get too disgusted to try. The Boy (16 years) is learning the first four rules of Algebra. I was looking at his exercise Book last nigh & he started explaining & kindly offered to teach me (the Algebra). The old man sometimes starts telling me things. I understand pretty well all he says but eventually he comes to a couple\n\nof words which I don’t know. I then pull him up and ask him to find the words in the Dictionary for me. I’m damned if he \ncan\n. \nHe\n I understand the sense of what he’s telling me but would like to get those words as I want to study them, but its no good. The old – starts off right from the beginning like a child that has been interrupted in a lesson & sometimes he will do this two or three times. Naturally I am quite fed up and spend a lot of my time dodging him. Its no use telling him that I only want this word or that word, as a matter of fact he can’t read too well. He is always telling me of wonderful things in the paper. I ask him to show me the paper and almost invariably I find that he has misread it. I can’t read French quite as well as he can, but I can go over an item and show him where he has made a mistake. These people are very keen in business or in their particular trade, but as regards the world or big things generally, say Science, politics or anything past the bottom of the street, they know \nabsolutely\n nothing. He asked me to speak Australian to him the other day. He thought Aussies, Canucks and Yanks all spoke different languages.\n","73":"\n\nM. Murray-Prior put me in my place the night before last, beat me twice, this makes four consecutive games I have lost.\n\nAn M.P. who carried his badge in his Breast pocket pulled me up in Charleroi today & asked to have a at my Pay Book. This is the first time I have been stopped by a M.P. without his arm badge on. It is a good idea because previously the Shrewdies could always see an M.P. some distance off & Hop it while the going was good.\n","74":"\n\nWent to the Concordia to see the \"Dinkum & Blue\" Diamonds. Very poor show. While coming home I was passing a Motor Car, a M.P. called on the Driver to stop, he took no notice, the M.P. called once more & then fired two shots from his Revolver, one shot went through the Bonnet and damaged the Engine. This took place in a crowded street. I don’t know whether I have mentioned it before but two Aussie Deserters have been shot in Estaminet brawls since I have been here. Some of our \"strays\" have been \"Holding up\" people & even Estaminets with Revolvers.\n","75":"\n\nBlew out the Murray-Prior combination twice last night but have a strong suspicion that the first game was not genuine. Company had to Parade today owing to the Slack Gaurds they have been putting up lately. We are to parade twice a week untill there is an improvement. This morning’s parade was no joke. It was snowing and the wind was enough to cut a man to pieces.\n","76":"\n\nWas advised today that I was on the next draft for Aussie. Seen the Q.M.\n\n& signed statement that my equipment was all correct (it isn’t). 6 men left A Company today for the Graves Registration work, quite a lot of Aussies are taking on this scheme. Cyril Gray came to the Battalion last night now there is the 4 of us, Anderson, Gray, Hogue, & myself.\n","77":"\n\nHad a Bath at the Charbonnage Marcinelle Nord. While there I copied the shifts as given by the act of 1889 of which a summary was posted at the Office.\n\nDay Shift Underground\n\n(All others work 12 hours per Shift (at least).)\n\nBoys under 16 descend at 7 a.m. or 8.30 a.m.\n\nThey come up at 4 p.m. or 5.30 p.m.\n\nNight Shift Underground\n\nBoys under 16 Descend at 8.00 p.m.\n\nAscend at 5.00 a.m.\n\nAbove ground\n\nBoys under 16 and women over 16 and under 21 start at 7 a.m. and work till 7 p.m., they are to have 1\/8 of this time for rest or meals.\n\nBy another act 1905 it is laid down that no work excepting such as is absolutely essential to prevent damage to the plant shall be performed on Sunday.\n\nWomen work underground & in the lamp room and also do practically all the trucking. It is quite a shock to an Aussie to see them all grimed by the coal dust with great heavy Sabots on their feet and their hair tied up in a filthy rag something like a turban.\n","78":"\n\nChess tournament last night at the Y.M.C.A. I run straight through into the final. The final will be played tonight. Madame used to pay 25 Francs for 1000 kgrms of \nGood\n coal during the war. Now she has to pay 100 Francs per 1000 kgms (a little more than a ton).\n","79":"\n\nWon the Tournament. Miss Prior is now after my scalp, made me promise to play her a couple of Games this Evening. She took a Party of us around the Glass works this morning, it was a very interesting show. A heavy fall of snow early this morning 3 or 4 Inches, everything was terribly sloppy because it started thawing as soon as it fell. Seen the Doctor and got paid 10.30 A.M. The Doctor took no chances with me, gave me a very rough overhaul. One chap (A Coy.) came a \"Gutser\" to his very great surprise. He admitted having slipped but was quite certain that he was O.K. again. Beat M.M.P. (Miss Murray-Prior) at Chess in the evening also two other chaps who seemed to think I \"Fluked\" a win over them in the Tournament. These two fellows were much below M.M.P’s standard.\n","80":"\n\nParaded at B.O.R. at 7.30 A.M. with the Aussie Draft. Some Mademoiselles there were flashing their Hankies every now & then pretending to Cry. At the station I met some of the 10\/17 who are going back with us. As we started to entrain and also later when the train started the French women & kids cried in real earnest especially when the Band played Good-byee because they know this song.\n\nWe each received beaucoup Cigarettes and a parcel from the A.C.F. on the Train, also plenty (3 Issues) of Rum. We left at 10 a.m. & after travelling via Mons, St. Pol, Doullens, Amiens, arrived at 11-00 P.M. on the","81":" & marched to Rouelles Camp on the morning of the","82":" At one stopping place, a Chow came around buying Bully Beef & an officer took his stock & dumped it in the cooks \nhouse\n Truck, the Chow pleaded for it with no result & finally laid himself under the Truck with his neck on the Rail. He was pulled out & remained quiet until the Train started when he again dived right under, this time a Tommy pulled him out. He struggled violently until he was escorted \noff\n out of the Yard by two Tommies. At this camp (Rouelles) I met a Q.M. Sergt. Poole who used to be at Rozelle but resigned before the war. He invited me to Dinner. We handed in all of our equipment & had a C.I. (short arm) Bath, Change & Fumigation all in one act.\n","83":"\n\nI was learning some new dances this morning, out of 5 which they put on while I was there I only knew one (veleta).\n","84":"\n\nReceived an issue of underclothing also overcoat and Hat. In the afternoon we left in motors for Havre, embarked & left the harbour at 5.00 P.M. arrived at Southampton at about midnight and anchored in the stream untill 7.00 A.M.","85":" then steamed into the Harbour. We arrived at Sutton Veney at about 2.00 P.M. I seen Mickey De Luce in the Camp. We put in our Pay Books & had a\n\nmedical inspection for Scabies and other things right in the middle of the Parade Ground, the rawest thing I ever seen. We were afterwards issued with 5 Blankets and shown to our Huts.\n","86":"\n\nParading all the morning for Inoculation (Influenza I believe), leave destination & G.O.C. inspection. They say that first impressions are most reliable, if so the Charleroi girls are miles ahead of the girls around here for smartness, carriage & looks, the only good thing about the women here is their complexions in some cases only & even there the Charleroi girls beat them pointless. The women here seem heavy, stolid, lacking in feminine charm. They \nare\n seem very nice to the Troops but their temperament is very heavy.\n","87":"\n\nVisited Warminster last night. We have been getting very good tucker here, a pudding every day and as much Bread and \nButter\n as we can eat. Again the Bread tastes like cake after the stuff we have been accustomed to get on the other side. We got paid this afternoon.\n","88":"\n\nMet Mickey De Luce this morning, he goes back tomorrow. Paid 8\/- for my ticket to London. We go on 14 Days leave on Friday.\n","89":"\n\nArrived in London at midday. Not being too flush I shall make the War Chest my headquarters. A number of L.H. from Egypt are here on leave (30 Days). They look very picturesque, bronzed, with spanking new Uniforms and Emu plumes in their Hats. Attended\n\nDance at Australia House in the Evening.\n","90":"\n\nBritish Museum in the morning. Picture Show in the afternoon, and Dance at Victoria Hall, Ealing in the night. The Girls at this Dance were dressed very smartly with short frocks and a lot of them smoked between the Dances.\n","91":"\n\nDiscovered that I have a nice new Hat with a Pugaree. I must have taken somebody else’s by mistake but \nhe\n I haven’t the faintest notion of how it happened. Concert at War Chest in the Afternoon N.G. and smoker at Australia House in the Evening.\n","92":"\n\nAll day trip to Windsor Castle and Eton College. Was shown over the Castle and Stables. We were entertained at lunch at the Castle & received souvenir Post Cards from the King & Queen. I liked the Stone Roof of the Chapel and the beautifully Decorated vault best of all. The latter has what the call Marble Etchings which I would have liked to examine closely but admission into this place is forbidden. I was also struck by the small sizes of the suits of Armour in the Armoury. Seen \"The Man from Toronto\" at the \"Duke of York\" Theatre in the Evening. Miss Marie Lohr played the principal part. This Theatre is rather like our \"Crystal Palace\".\n","93":"\n\nMet Tom Prior in the morning, he is working at\n\nthe Records Office. Visited the United Services Exhibition in the afternoon and went to the \"Coliseum\" (Variety) at night. The Coliseum is a beautifull Theatre & splendidly designed. A Lady conducted the Orchestra. The Drop Curtain shows a procession of Artists who have previously appeared at this Theatre crossing a Stage.\n","94":"\n\nQuiet day. Applied at Education Office for Permits to visit Power Stations. Dance at Australia House in the night. Met Paddy Boland there.\n","95":"\n\nSeen Ada Reeve at Anzac Buffet today. She is one of the finest women I have seen and looks better off the stage than she does on. She is quite as nice as she looks, without a bit of swank.\n\nSeen two Convalescents at the War Chest at Dinner. They sat opposite me. They were both unable to hold a Tea Cup without spilling the contents (nerves gone). One was vainly endeavouring to eat, querelously complaining the while that he was as hungry as a hawk. He seemed to have an artificial Jaw. The other was frightfully disfigured. His head was out of shape, one cheek was crushed in, his eyes were out of line, a scar like an axe-cut was in the middle of his Cheek & another encircled one of his Eyes, his nose was a button.\n","96":" (Primrose Day)\n\nWestminster Abbey and the Houses of \nParliament\n Commons and Lords. The Roof of the Abbey, especially Edward VII Chapel, is very lovely better than that of the Chapel at Windsor Castle. We passed the Statue of \nLord Robert\n Disraeli which was decorated with primroses by the Primrose League. I was introduced to \nJohn Burns\n the one time Radical. He lectured to us in the Chapter of the Abbey. After he had warmed up to his subject he spoke like a cockney misplacing his H’s and speaking through his nose. He is very severe on anyone who does not pay attention to what he is saying. By the way, the outstanding feature of the Abbey design is variety. In the afternoon I was watching the people in the back streets dancing to the mechanical Organs, they were mostly full or should I say intoxicated. I put in the rest of the afternoon at Hampstead Heath and after tea took on a Picture Show.\n","97":"\n\nConcert at Royal Albert Hall in the afternoon, Albert & Victoria Memorial & walk through Regents Park. Met Jack McMahon, he is on 27 Quota, looks well. Concert at War Chest in Evening. (Not much good.)\n","98":"\n\nVisited St. Pauls Cathedral in the afternoon taking in the Crypt, Whispering Gallery, and Stone\n\nGallery. In outside appearance it simply cannot compare with the Cathedral at Amiens. The lofty nave and Gorgeous Altar of Amiens Cathedral also appeal to me, but owing to the different styles it is hardly fair to compare the nave and external aspect of the two. The mosiac work in the interior is very beautiful. The Great Altar also give an impression of purity & richness. I think St. Pauls must have been a Catholic Church once.\n\nI had a hurried look through the Natural History Museum at South Kensington afterward. I only went there to see the famous Piltdown Skull. I seen a very ancient one but am not sure that it was the one I was looking for. Attend a Fancy Dress Ball at Battersea Town Hall in the evening & had a good time. It is very funny to see the Londoners piloting their country relations about during the Holidays. There are always a few admiring the Horse Gaurds. Londoners tell one that neither the man or the Horse moves while on Post but that is all Bosh.\n","99":"\n\nThis the first Easter after the War has been blessed with lovely weather. There never were such crowds rushing about seeking for enjoyment after the strain of the war. I went over the Big Power Station of the Underground at Chelsea\n\nthis morning. It is a rather big affair. They have a big Coal Reserve of 15000 Tons kept in a special retainer for emergencies. The plant consists of 7 10000 K.W. Turbo Generators, Parsons & Westinghouse respectively and one 15000 K.W. machine. The Central Station supplies A.C. at 10,500 approx. to R.C. Substations which deliver it at 500 V.D.C. but this 500 is generally exceeded. At midday I took post near the Bank of England to watch the traffic. It is the busiest corner in the World. The traffic is very great but the principal difficulty is the number of streets all converging on that one spot. Before I forget it, the most marvellous thing in London is the London Policemen, courteous, polite & good-natured. I doubt if there is another body of men like them in the World. Pictures this afternoon & Evening.\n","100":"\n\nI went over the Power Station for the Underground at Neasden on the 23rd. It is not as big as the one at Chelsea. At neither Chelsea or Neasden did I see anything new to me in the Electrical line. I have permits to view two of the L.C.C. Stations but I will not use them now. The output of the Neasden plant is (normal) 25000 to 35000 K.W. On the night of the","101":" I went to a Dance at Chiswick Town Hall. Had a\n\ngood time. On the morning of the","102":" (Anzac Day) I witnessed the march of the Aussies from the base of Queen Victoria’s Memorial in front of Buckingham palace. After dinner I took train back to Sutton-Veney Camp.\n","103":"\n\nPerishing cold here. There is nothing to break the wind and it absolutely freezes one’s Blood. 38 Quota came in today.\n","104":"\n\nVery cold. Heavy snowstorm during the night.\n","105":"\n\nIssued with equipment for the march through London on the 3 prox.\n","106":"\n\nOn the","107":" we had a heavy day standing about in Battle Order while Officers gave us contradictory orders. We were ordered to tie our Putties at the Bottom and today we were ordered to tie them at the top. We were walked through all the mud lying about the camps today for absolutely no reason at all & kept standing in the rain also. No wonder it took us so long to starve Fritz. The only way in which we \ncould\n beat him with British Leaders. I speculated in an Onoto Pen today. We had a parade this afternoon which I dodged and on top of that another after tea, which I also dodged. So far there is no information forthcoming about time of departure, leave allowance or time of return. My present ambition is to get out of this Parade toute-de-suite.\n","108":"\n\nDodged the Victory march. I hid my Rifle & equipment and when Reveille 12.30 A.M. sounded, I simply snuggled closer under the Blankets and kept quiet. They went off at about 3-0 or 3.30 without noticing my absence. Had a nice quiet long walk in the country this morning, it was lovely, much better than being messed about in London. Walking about these country lanes would do me for the rest of my life. It is a fact that an English country side has a very \"homey\" look about it. I have seen far prettier scenery in France, but it never suggested home to me. Nor does Australian scenery do so either to the same extent. \nthat\n While taking these quiet walks, I keep running into spooney couples & almost invariably one of them belongs to the A.I.F. The girls here are apparently fond of Aussies and as far as I have seen are pretty good judges, all the Romeos appearing to be decent fellows.\n","109":"\n\nA few of the fellows who took part in the march came home last night late. They seem to have had a rough spin. Here is their Programme for the 5th. Reveille 12.30 A.M., Breakfast 1-30, March to Warminster (3 miles) entrained there about 4.0 A.M. and arrived at Paddington about 7.30, marched to Hyde Park, had a few hours spell & dinner there. After dinner the Canadians moved off leading the march. The Light Horse followed but the 1st Div. refused to\n\nuntill they were promised leave. The officers tried the 2nd Div. with the same result. The Light Horse were then halted. The Canadians went on alone and finished the march alone, the Aussies never seeing them after. After some parlying with the Officers the Infantry took up the march and the rest of the Parade followed. Thus through the mean policy of the A.I.F. authorities the Victory march nearly collapsed. All the men taking part were expected to return to Sutton-Veney the same night, a few did arrive foot sore & weary at 10.50 P.M. making nearly 24 hours continuous Duty. There ought to be an awful row in Aussie when the people hear about this.\n","110":"\n\nWent to Dancing class this morning, all men, very funny in the sets. We have here the very latest Dances. At Havre (Harfleur) they held Classes. I met quite a few good Dancers who had never Danced with a Girl in their lives.\n","111":"\n\nWe had C.I. parade this morning and a Boat roll was made out. I understand that we leave here on the","112":" and embark on the \"Nestor\" the following day. I intend to go to Bath today. There is a party leaving here this afternoon. Fare 10\/-.\n\nI have been told that the W.A.A.C.s have the same medical Parades that we do. At Havre the girls (among themselves) used to call them canoe inspections. The weather is becoming much warmer lately. We had lovely weather for our trip to Bath (20 miles) and\n\nBeautiful scenery all the way, the road running along the edge of the valley of the Avon River. For quite a while after leaving Sutton-Veney we could see the \"White Horse of Westbury\". I would like to know the meaning of that \nmonument\n figure. After our arrival I visited the Roman Bath from which the Town derives its name, went from there through the Victoria Park and the tiny Botanical Gardens. I always thought that Bath Chairs were obsolete but I seen plenty of them plying in the Streets & in the Park. There was a Concert after tea in the Sydney Gardens, an Orchestral Band & some singing. I enjoyed it very much, out in the open air on a lovely Evening, in the Pretty Garden. Much better than being in a stuffy Theatre.\n\nWe left the town about midnight & arrived home after a slow trip at nearly 2 A.M. As usual some of the Troops were full. These reckoned that Bath was a very fast Town indeed. They were emptied out of 5 pubs. As one (13 L.H.) remarked \"We were fired out of the last Pub at 7.55. We went to the Theatre, entred at 8.5 and were thrown out at 8 o’clock (less than no time), at 8.15 we were in Gaol. Yes lads Bath is fast enough for me, and then some.\"\n\n24th May, Wednesday\n\nWent to a Dance at Warminster last night. Terrible floor. Girl issue was very short too, by bustling pretty lively I managed to score all the\n\nDances. A few of the Girls were (although very nicely dressed) \nvery\n real shrewdies in their Dancing style, made me think of Clontarf again.\n","113":"\n\nSend off to 23 quota. Very crowded.\n","114":"\n\nReceived letter from young Billy with views of Sydney.\n\nWhen the","115":" Division went over at Armentieres they were supported on the right by the 61st Div. The 61st had some Warwicks and Scotties attached to them. Some of the Scotties who were captured quarrelled continually with the 61st.\n","116":"\n\nTime 3.00 A.M. We have been up all night singing. In view of the fact that we have handed in our Blankets and were to have our Breakfast at 2.00 A.M. it seemed hardly worth while but it is now 3 o’clock & we have heard \nneither\n no Reveille nor has any Breakfast come to light. Hawker flew across the Atlantic yesterday 20\/21st. (Later reports are to the effect that Hawker fell into the sea near the Irish Coast.) I nearly missed the Boat Roll today. We finally left Warminster Station after a sleepless night at 7.00 A.M. & arrived at Liverpool at 3.30 P.M. We travelled via Bath, Cheltenham, Stratford, Birmingham, Bilston (very rough country here) & Crewe. The Boat \"Nestor\" pulled out into the stream about 7.30 P.M. and left during the night.\n","117":"\n\nLeft\n We passed Anglesey during the day.\n","118":"\n\nRather squalmish yesterday & today but have not missed any meals, by the way the tucker is very fair indeed\n\nwith the exception of the tea & Coffee.\n","119":"\n\nWe have had lovely weather so far. Diggers Dance in the Night.\n","120":"\n\nVery Hot. Empire day Sports, they were a terrible fiasco. There is hardly room to swing a cat at \nour\n end of the Boat. \n\nParticulars of \"Nestor\"\n\nCommander R.D. Owen\n\nGross Tonnage 14,500, H.P. 1200\n\nLength 580’, Breadth 68’\n\nSpeed about 15 Knots\n\nCrew 189\n\nFirst class Passengers 169\n\nSecond class Passengers 136\n\nOther unfortunates 1910\n\n2404\n","121":"\n\nPassed the Canary Islands at 9.45 P.M. We could only see a cluster of gleaming lights, probably Las Palmas.\n","122":"\n\nFirst sighted the Southern Cross.\n","123":"\n\nHot & calm. Plenty flying Fishes and Porpoises about.\n","124":"\n\nSeen a fleet of Portuguese men of war. We were passing through them all Day.\n","125":"\n\nComplete eclipse of Sun today. I could’nt find a bit of smoked Glass anywhere to have a look at it. Owing to the heat most of the Troops have been sleeping on the Decks, myself included. Last night at 12.30 it rained cats & Dogs. There was much bad language and a wild rush for below.\n","126":"\n\nWe got caught\n\nagain by the rain last night. Henceforth I shall sleep below.\n","127":"\n\nStopped for three hours for Engine room repairs today. The crew put in the time trying to catch some very wise sharks. Several times they got one quite out of the water & then missed him. The Troops stormed the Boat Deck this evening.\n","128":"\n\nUnusual sunset today, the sky was completely covered with clouds except in the west where a few rents in the cloud screen let through a group of shafts of light almost vertically downward on to the sea. It was very pretty like a lot of inverted search lights.\n","129":"\n\nHeavy swell. My head aching a treat.\n","130":"\n\nDitto, especially the head.\n","131":"\n\nThat blanky head of mine has been aching more or less since we started. But this heavy swell makes it a lot worse.\n","132":"\n\nHundreds of Albatrosses (Cape Sheep) around the Ship today, also it is very stormy, the ship is behaving splendidly. The Albatrosses above mentioned are sailing around the ship (and she is doing 15 knots) without moving their wings, this in a storm with the wind blowing like blazes.\n\nWe sighted a Lighthouse at 7.45 P.M. and anchored outside Cape Harbour at 10 P.M.\n","133":"\n\nCame into inner Harbour this morning and berthed not far from the \"Yperinga\" with 17 quota on board. The \"Irishmen\" with Soldiers Brides on board was coming out as we came in. We got ashore at 9.30 A.M. Cyril Gray and I had a look over the Town in the Forenoon and sent a few souvenirs, by the way, the native curios are very cheap. In the afternoon we took a motor Ride to Houts Bay via Sea Point, Camps Bay, returning by a different route through Wynberg about 35 miles right around the mountain. The Cape People claim that this is one of the World’s beauty Drives, its lovely certainly but --. It reminded me very much of the South Coast, the vegetation is the same as in Aussie & the People are very like Australians. They treated us very well in every way (V.T.E.C.). The Table Mountain was veiled in mist all day but we got some fine views of the Lions head & the Rump (Signal Station).\n","134":"\n\nAgain the town in the morning, visited the Gardens, Library, & Museum. In the latter I seen some models of Bushwomen, they showed a most abnormal developement of certain parts of their figure especially the older\n\nones, they must be about the ugliest little People in the World. In the afternoon we visited \"Groot Schuur\" (the late Cecil Rhodes Estate) seen his private Zoo and the magnificent Granite memorial erected there to his memory on the slope of Table Mountain, the site commands a fine view of the town and the Cape flats. The Town seems to be squeezed in between the Table Mount and the Lions Rump. \nthe rest of it spreads on to the\n It has rained several times each day, I believe they get lots of Rain here, they say that the mountain intercepts the Clouds as they pass and cause the rain.\n","135":"\n\nThis morning we found the Osterley alongside with about 1000 soldiers Wives & God knows how many kiddies on Board, they are only going to stay for a few hours as she Coals at Durban. The Ladies were allowed ashore for a Promenade & were immediately annexed as they left the ship, by the Anzacs. Cyril & I went to Camps Bay per Tram (a lovely Ride), stayed there for Dinner and returned to Town. We had a look over the Camps Bay Tramway Power Station. It contains 2 D.C. Gen. (Kick Kerr Coy.) 700 AMP, 550 Volts. Today was a lovely Day so the whole issue (The Mountain, the Lion and the 12 Apostles) were on view all the time.\n\nThere is a tremendous amount of Grey Granite around Cape Town. We put in a few hours on the Pier and sea front & went to the Alhambra in the Evening. Seen a Picture \"A Soul for Sale\", one of the toughest things I have seen yet, quite a liberal education in itself for any young girl or Boy, in everything that they shouldn’t know. I weighed 10.5 here.\n\nWhen we got back to our boat we heard that the Osterley left at about 6.30 P.M. to Durban to coal.\n","136":"\n\nWe left at 7.0 A.M., by the way, we had to put the Clock on one hour when we arrived at Cape Town and directly we left we put it back one hour. We ran into some heavy weather as soon as we left.\n","137":"\n\nHeavy sea, our boat being lightly laden rolls more than a little. I live over the propellers & they kick up a devil of a row \nas\n when they run free as she rolls. One big roller came aboard & scattered the psychology class on the Promenade Deck. I have had to give up sleeping on the floor, owing to the rolling, also to make matters worse the Buckets, mugs, knives & forks etc. keep coming adrift & flopping about during the night.\n","138":"\n\nStorm subsiding but seas still very high, rolling tremendously. Our Table & stools carried away & smashed up\n\nwhile we were having tea. I was unlucky being end man on the lower side, the stool broke away & collapsed & I slid down onto a nail with the other 5 on my side on top of me which of course helped to drive the nail in, add to this the Table & its contents, Tea, Sugar, Jam, Butter, & cataracts of table utensils and you may guess how I felt. I visited the Dressing Station right away.\n","139":"\n\nSea very heavy but better than yesterday.\n","140":"\n\nEngine troubles again. Running on one propeller until 3.0 P.M. Sea subsiding. We had a list to port when we left Capetown, now we have a pronounced list to starboard.\n\n17.6, Tuesday\n\nFunny old sea today, big lumps coming from all directions.\n\n18.6, Wednesday\n\nEvening, sea coming up again. \"Dear Bill\".\n","141":"\n\nEngines buggared again. Stopped for 4 hours.\n","142":"\n\nWon Chess Tournament. Received set of Hairbrushes as trophy.\n","143":"\n\nRan into another Storm. Blowing great guns all night and this morning tiny Hailstones blown by the wind cut like Bird shot. Afternoon, Storm easing up. Sea rising. Weather very cold.\n","144":"\n\nStormy & cold.\n","145":"\n\nVery cold, Blowing like hell. Rolling heavily, sea on Beam. We were below Latitude 42 today.\n","146":"\n\nThe Captain received wireless instructions to proceed to Adelaide so we are making north again. Sea smoother. Day drill.\n","147":"\n\nStopped owing to Engine trouble (3 hours). Rolling tremendously in the heavy sea. Blowing like hell. Inoculated against \"Flu\" today. Made the arm feel rather numb & weak.\n","148":"\n\nCapt. Lang gave a Lecture on aeroplanes, incidentally describing his own World’s record flight on a D (or V) H9 fitted with a Napier Lion Engine. This machine could have undoubtedly bombed Berlin. Running well in Handicap Chess Tourney but withdrew.\n\n27.6, Friday\n\nDeclaration & Inspection.\n\n28.6, Sunday\n\nWoke up this morning in sight of land and in smooth water. Crow-eaters greatly excited. Anchored at Port Adelaide 1.20 P.M. waiting for medical inspection. Temperatures taken by Health Officers. Berthed at about 10.30 P.M.\n","149":"\n\nCrow-eaters disembarked before 9.0 A.M., very few people about. One Sammy Lunn or Lum made enough fuss for a few. He is by way of being a Rhymester. There is nothing to sea at Port Adelaide but the Railway Station & a few shops. We left there at 2.0 P.M. Sammy howled out some complimentary remarks through his megaphone \"you Bonzers\", you Beauties, etc.\n","150":"\n\nArrived in Port Philip late last night and are now anchored opposite Queenscliffe awaiting med. Inspection. After taking our Temperatures the Doctor allowed us to proceed. We Berthed at Port Melbourne and were allowed shore leave from 2.00 P.M. till midnight. Melbourne was very busy. I seen 4 street accidents in as many hours. Terrible lot of Drunks among the returned Soldiers, \nplenty\n also nips & Bums. Our mob got awfully Drunk. God alone knows how most of them found the ship again. A few didn’t and were left behind. Among the Boozers the Tunnellers were an easy first. They sat up arguing nearly all night and then got up at Day Break and woke the mob up to apologise to them for the row they had made on the previous night, this later stage was worse than the first. I might mention that the Tunnellers were only billetted with us to take the place of the Vics. who left and as they were not issued with Blankets or Hammocks they calmly annexed ours. As our fellows came in through the night they were howling for the scalps of the thieves. It reminded me of who has.\n","151":"\n\nWe left Melbourne at 7.30, stopped at Quarantine on the way out to have another suck at a thermometer, and arrived outside Sydney Heads some time during Friday night.\n","152":"\n\nAfter standing on and off during Friday night\n\nwe entered the heads at sunrise, the sun showing half his face over the \nsea level\n Horizon just as the North Head blocked him from our view. It was a striking coincidence the Badge of the A.I.F. welcoming us \"in propria personae\".\n\nWe landed about 10 A.M.\n\nFinis.\n\n"}}