{"Document Name":{"0":"Diary_0012","1":"Diary_0012","2":"Diary_0012","3":"Diary_0012","4":"Diary_0012","5":"Diary_0012","6":"Diary_0012","7":"Diary_0012","8":"Diary_0012","9":"Diary_0012","10":"Diary_0012","11":"Diary_0012","12":"Diary_0012","13":"Diary_0012","14":"Diary_0012","15":"Diary_0012","16":"Diary_0012","17":"Diary_0012","18":"Diary_0012","19":"Diary_0012","20":"Diary_0012","21":"Diary_0012","22":"Diary_0012","23":"Diary_0012","24":"Diary_0012","25":"Diary_0012","26":"Diary_0012","27":"Diary_0012","28":"Diary_0012","29":"Diary_0012","30":"Diary_0012","31":"Diary_0012","32":"Diary_0012","33":"Diary_0012","34":"Diary_0012","35":"Diary_0012","36":"Diary_0012","37":"Diary_0012","38":"Diary_0012","39":"Diary_0012","40":"Diary_0012","41":"Diary_0012","42":"Diary_0012","43":"Diary_0012","44":"Diary_0012","45":"Diary_0012","46":"Diary_0012","47":"Diary_0012","48":"Diary_0012","49":"Diary_0012","50":"Diary_0012","51":"Diary_0012","52":"Diary_0012","53":"Diary_0012","54":"Diary_0012","55":"Diary_0012","56":"Diary_0012","57":"Diary_0012","58":"Diary_0012","59":"Diary_0012","60":"Diary_0012","61":"Diary_0012","62":"Diary_0012","63":"Diary_0012","64":"Diary_0012","65":"Diary_0012","66":"Diary_0012","67":"Diary_0012","68":"Diary_0012","69":"Diary_0012","70":"Diary_0012","71":"Diary_0012","72":"Diary_0012","73":"Diary_0012","74":"Diary_0012","75":"Diary_0012","76":"Diary_0012","77":"Diary_0012","78":"Diary_0012","79":"Diary_0012","80":"Diary_0012","81":"Diary_0012","82":"Diary_0012","83":"Diary_0012","84":"Diary_0012","85":"Diary_0012","86":"Diary_0012","87":"Diary_0012","88":"Diary_0012","89":"Diary_0012","90":"Diary_0012","91":"Diary_0012","92":"Diary_0012","93":"Diary_0012","94":"Diary_0012","95":"Diary_0012","96":"Diary_0012","97":"Diary_0012","98":"Diary_0012","99":"Diary_0012","100":"Diary_0012","101":"Diary_0012","102":"Diary_0012","103":"Diary_0012","104":"Diary_0012","105":"Diary_0012","106":"Diary_0012","107":"Diary_0012","108":"Diary_0012","109":"Diary_0012","110":"Diary_0012","111":"Diary_0012","112":"Diary_0012","113":"Diary_0012","114":"Diary_0012","115":"Diary_0012","116":"Diary_0012","117":"Diary_0012","118":"Diary_0012","119":"Diary_0012","120":"Diary_0012","121":"Diary_0012","122":"Diary_0012","123":"Diary_0012","124":"Diary_0012","125":"Diary_0012","126":"Diary_0012","127":"Diary_0012","128":"Diary_0012","129":"Diary_0012","130":"Diary_0012","131":"Diary_0012","132":"Diary_0012","133":"Diary_0012","134":"Diary_0012","135":"Diary_0012","136":"Diary_0012","137":"Diary_0012","138":"Diary_0012","139":"Diary_0012","140":"Diary_0012","141":"Diary_0012","142":"Diary_0012","143":"Diary_0012","144":"Diary_0012","145":"Diary_0012","146":"Diary_0012","147":"Diary_0012","148":"Diary_0012"},"Date":{"0":"unknown","1":1757.0,"2":1758.0,"3":1759.0,"4":1760.0,"5":1761.0,"6":1762.0,"7":1763.0,"8":1764.0,"9":1765.0,"10":1767.0,"11":1768.0,"12":1769.0,"13":1770.0,"14":1771.0,"15":1772.0,"16":1773.0,"17":1774.0,"18":1775.0,"19":1776.0,"20":1777.0,"21":1778.0,"22":1780.0,"23":1781.0,"24":1782.0,"25":1783.0,"26":1784.0,"27":1785.0,"28":1786.0,"29":1787.0,"30":1788.0,"31":1789.0,"32":1790.0,"33":1791.0,"34":1792.0,"35":1793.0,"36":1794.0,"37":1795.0,"38":1796.0,"39":1797.0,"40":1798.0,"41":1799.0,"42":1800.0,"43":1801.0,"44":1802.0,"45":1803.0,"46":1804.0,"47":1805.0,"48":1806.0,"49":1807.0,"50":1808.0,"51":1809.0,"52":1810.0,"53":1811.0,"54":1812.0,"55":1813.0,"56":1814.0,"57":1815.0,"58":1816.0,"59":1817.0,"60":1818.0,"61":1819.0,"62":1820.0,"63":1821.0,"64":1822.0,"65":1823.0,"66":1824.0,"67":1825.0,"68":1826.0,"69":1827.0,"70":1829.0,"71":1830.0,"72":1831.0,"73":1832.0,"74":1833.0,"75":1834.0,"76":1835.0,"77":1836.0,"78":1837.0,"79":1838.0,"80":1839.0,"81":1840.0,"82":1841.0,"83":1842.0,"84":1843.0,"85":1844.0,"86":1845.0,"87":1846.0,"88":1847.0,"89":1848.0,"90":1849.0,"91":1850.0,"92":1851.0,"93":1852.0,"94":1853.0,"95":1854.0,"96":1867.0,"97":1868.0,"98":1869.0,"99":1870.0,"100":1871.0,"101":1872.0,"102":1873.0,"103":1874.0,"104":1875.0,"105":1876.0,"106":1877.0,"107":1878.0,"108":1879.0,"109":1880.0,"110":1881.0,"111":1882.0,"112":1883.0,"113":1884.0,"114":1885.0,"115":1886.0,"116":1887.0,"117":1888.0,"118":1889.0,"119":1890.0,"120":1900.0,"121":1901.0,"122":1904.0,"123":1910.0,"124":1911.0,"125":1914.0,"126":1926.0,"127":1931.0,"128":1934.0,"129":1935.0,"130":1936.0,"131":1941.0,"132":1942.0,"133":1946.0,"134":1948.0,"135":1951.0,"136":1959.0,"137":1962.0,"138":1966.0,"139":1978.0,"140":1982.0,"141":1985.0,"142":1989.0,"143":1995.0,"144":2002.0,"145":2013.0,"146":2018.0,"147":2214.0,"148":2215.0},"Entry":{"0":"\n\n","1":"\n\nMy leg broke out again today but I expect it will be healed up again tomorrow but I will go down in the morning and get a dressing on it. Its been raining every afternoon since I been here but I dont go about much only just a walk around the camp now and againIm taking things dead easy it seems to me I might stay in this place weeks and weeks before geting a board or perhaps I wont get one its hard to say. The weather is begining to get a bit colder now and I think this is a bit of the worst part of England for the cold.The boys walk about two miles to Weymouth which is a big town but its to far for me.\n\n\n","2":"\n\nI said good bye to the crutches this afternoon and it was like parting with two old freinds as I have had them since the 9th July.\n\nI couldn't see my way clear of staying here till next fridayto see the doctor when he came around so I went down to see down to see himhe put me on different treatment and massarge and said it wouldn't hurt me to try and walk with the aid a sticks so I tried in the room and managed all right. I dont like the idea of walking on my leg and puting weight on it myself yet but as he said to do it, there is nothing else for it. I\n\nhanded my crutches into the red cross and go two walking sticks. I carn't get a boot on yet but the man who massarged my foot and leg said I would be able to in a few days.It is mostly through the bone being damaged in my big toe that stops me as it is to painfull yet. \n\nIt was Major Ervine who I saw and he put on my paper that I was to have ointment put on the sinus of my leg to heal it up but the corporal in the dressing hut wouldn't do it and altered it. They are only a lot of messers here all they think about is geting one back to France.\n","3":"\n\nThings are going on much as usual. I get up about seven o clock have beakfast at eight and fall in on a massparade about half past to see if there are any orders for me and then go for a bit of a walk around the camp or read in the YMCA\n\nI go to the massarge hut at two o clock for massarge on my leg and foot I get hand massarge for about a quarter of a hour and then go to the dressing hut to get my wound dressed as there is still a sinus in my leg about two inches deep. My leg and foot aches a lot but I am that used to it now I dont notice it most of the time.\n","4":"\n\nI got into a bit of a row at the massarge hut today as the staff sargent in charge said I ough to have the crutches yet if I carnt walk properly on my leg and keep the weight even on my foot but I carn't put much weight on the ball of my foot through the big toe being sore. He said if I couldn't do better in a day or so I would have to have them.\n","5":"\n\nGeting massarge and dressings just the same and the leg and foot are about the same as when I came here. I wish they would either fix me up or give me a board as Im completely fed up.\n\n\n","6":"\n\nThis as been the first fine day for a long while but although it as been fine it as been very cold and windy.\n\nThere was to have been a concert in the concert hall this evening it was to start at a quarter past seven I went down at six thinking I would be sure to get a good seat but all I could get was a seat on a table at the back as some of the boys had got the chairs about five o clock. At about half past seven a officer got up on the stage and said he had just received a cable saying the concert party were unable to come as the train they were to come by was'nt runing owing to the\ntrain strike\n railway strike.\n","7":"\n\nThe weather as been splindid fine and warm all day.\n\nThere was one of our military ploice killed on the bridge near Weymouth last night and just after dinner today they came around and said the camp was closed and it is only saturdays and sundays that the camp is open at two o clock other days it is at four o clock.\n\nAbout five minutes after we were warned about it it was declared open again. It didn't make any difference to me as I have'nt been away from camp yet.The doctor came around classing us today I am still marked BIB.I had my massarge and dressing done at half-past eleven as there is no massarge saturday afternoons.\n","8":"\n\nIts been raining hard since early morning and it as been somme cold too. Today asquite made up for the good day we had yesterday. I did'nt have to get massarged today as the room does'nt open on Sundays. I got my leg dressed just the same, the sinus in my leg is about the same as ever and still dischargeing The leg and foot aches a lot these wet cold days. I asked the A.M.C. man who was dressing it this morning when he thought it was going to heal up. All the satisfaction I got was that it would be a long time yet. Thats not very good news as I dont think I stand the least chance of a board while it keeps like it is.\n","9":"\n\nA splindid morning but a little wet in the afternoon the time was put back a hour last night and the sun was shineing when we had breakfast at eight o clock. I went to massarge treatment and dressing at two o clock and put the afternoon in reading in the Army and Navy canteen reading room.\n\nThe pictures started here this evening but it was a pretty rough show as one could hardly see the picture for smoke as everyone was smoking and all the windows were closed to make the hall dark.\n\nThere is a great noise in the hut just now as news as come through about Bulgaria surrendering they all seem satisfied that the war will be over in a few months.\n\n\n","10":"\n\nThis month as started good as its been a lovely fine day.\n\nI was going to go to Weymouth this afternoon but it would have knocked my leg about to much. There is'nt the slightest difference in it now than when I first came here and I get massarge and dressings every day.If anything my leg and foot is more swolen up than it as been for some time. It aches a lot at night some nights I dont get hardly any sleep at all. I went down to the pictures again this evening and it was a fairly good show one thing about it it helps to put a long evening in for me as I can niver go to town.The war news as got all the boys excited again this evening.\n\n\n","11":"\n\nIts been another fine day but I have'nt been feeling to good on it as the leg and foot as swollen up and pretty sore.They didn't do much massarge to it this afternoon as it was swollen up to much. They done the dressing as usual and the sinus seems nice and clean but does'nt seem to heal up.\n\nThey have'nt been puting on the dressing the doctor ordered as they have none. The doctor will be around again in a few days. Ill see what he has to say then.I have been down to a concert at the Y.M.C.A. this evening it was fairly good only one had to get a chair and wait two hours before the show started.\n\n\n","12":"\n\nThe leg and foot as been no better today and is all swollen up, the massarge man said it was a bad today as when he first started to massarge it.\n\nAll the heads have been around inspecting today. They get on ones nerves they want the place kept like a palace one old fellow went mad because there was a old burnt out match on the floor and went away saying the place was disgraceful. Poor old fellow.\n\nIve been thinking this evening of this time three years ago that was my last night in Australia. It would do me if this was my last night over here and I was geting a boat for Aussie tomorrow. Ill be able to see how things are going tomorrow as the doctor comes around in the morning.\n\n\n","13":"\n\nMajor Irvine the doctor who comes around every week classifying came around this morning, he marked a good few out. When I went before him he wanted me to walk without a stick and told me to walk across the room without it. Wen I came back he said I had best use the stick and I know I had to as I carnt get about without it. He marked Repeat on my card that is to carry on with the dressings and massarge for another week. This afternoon the senior M.O. came around inspecting us but those with dressings on did'nt have to show their wounds. This Major Irvine is the hardest looking man I ever saw and he as hands like a bullock driver when he get hold of some of them with stiff joints he makes them yell with pain. I heard that one of the troops was going to knock him down the other day.\n\n\n","14":"\n\nI never had any massarge today and I was put on hot fermentations to try and draw the loose dead bits of bone out of the sinus which is still the same. I have to have my dressings done twice a day now and the fermentations are making the leg a bit painfull.\n\nThe weather as been pretty fair just a few showers this evening.\n","15":"\n\nStill on the same dressings and there as been no bits of bone come out so far. There is no doubt the treatment here is rotten they dont look after things enough. All they trouble about is wether the huts are clean, this hut looked well this morning and perfectly clean but the fool of a colonel came\n\nin and found fault with everything and because two kits was'nt faceing the right way he put the two men who owned them under arrest. He found fault with the broom and said the handle wanted scrubbing. There is shelves on the sides of the walls and hooks underneath them but no-one is allowed to put anything on the hooks.\n","16":"\n\nI was put off fermentations this morning and just got the dry dressing and packing. I went and had my leg massarged at two o clock. I was called up by the dentist this morning and had one drilled for filling.\n\n\n","17":"","18":"\n\nAt two o clock when I went to the dressing hut to get a dressing the Major was there he examined my leg and the sinus and probed it and put the probe in about two inches. He told the dresser to carry on with the same dressing and for me to report to the medical hut at a quarter to one tomorrow. The leg is geting worse and worse and tonight it is pretty painfull and swollen up twice its size. I am sure tonight my leg is worse now than it was when I left Eastbourne and if the doctor down there saw it now he would go mad for Im sure the treatment I have had since has been rotten.\n\n\n","19":"\n\nTonight finds me in hospital again at Monte Vidier Camp Weymouth.The first thing I done this morning I went to the dentist and had my tooth filled and after that went to the dressing hut to get the leg dressed.The leg was pretty bad last night and I never slept a hour all night. After they did the dressing they took my medical card and said I was going away to this place and the man who does my dressing said that it was my start to Australia as they wouldnt keep me there long. He wished me the best of luck and said he was sure I would get home on it. It was good news but I have nothing certain to go on yet\n\n\n\nand I am afraid he may be wrong. I came over here in the ambulance and after messing around awhile I went to the Q.M. store and handed in my kit and uniform and dressed up in blues. I was given tea and then brought here to this ward No 35.\n\nThere are Sisters in charge here and this one does'nt seem to bad. She asked me if I wanted a dressing and she dressed the leg up afresh and made it pretty comfortable so I think Ill be able to have a good sleep tonight and it will be on a spring bed with white sheets. Something has seemed to tell me all the time that Ill get a operateion here but I ought to know in the morning\n\nwhen the doctor comes around. I hope he is a bit better than the last lot I have had anything to do with and I dont mind owning up I dont want a operateion and I hope Im not in for any more.\n","20":"\n\nFive days have gone since I have been able to put anything down as the afternoon of the 6th I went to the pack, my leg and foot swelled up like a balloon and before evening I was put to bed with a temperature of 105. On the morning of the","21":" the doctor came around and examined my leg and told me not to walk on it and ordered hot fermentations. I was pretty good up to dinner time and\n\n\n\nthen I started to get bad but hung out till evening thinking things might ease down in a few hours but the sister came and took my temperature and ordered me to bed at once and sent for the doctor that night. I thought it was all up and I was going west. I was watched all night by the sister and orderly. My temperature was taken every hour and my leg kept smothered in fermentations. The next day and night was about the same and I had nothing to eat all I had was brandy and milk.\n\nI wasn't so bad after the second night for my temperature was down to 99 and I eat some eggs and a peice of bread\n\n\n\nfor breakfast and I have been getting better ever since and I am feeling pretty good this evening and my temperature is normal. Last night I had fermentation every three hours and about the same today.This is a splindid hospital to be in and the sisters are very good and kind and if my temperature is down again in the morning I maybe allowed to get up. I dont know what they will do to my leg when I am fit again but the orderly said this morning after the doctor had been around that he thought I would have a operateion. Better that than have any more days and nights like the last five. I want to have a good nights sleep tonight if possible so as I will feel better tomorrow.\n\n\n","22":"\n\nI felt a bit better this morning but can get a lot better yet.The doctor came around about ten o clock and the sister showed him my leg and foot and he said it was improving a lot and told the sister to carry on with the hot fermentations. I have been put on a light diet since being bad and I get eggs fish milk jellies and custards. The sister here is splendid and looks after the boys well. Im not feeling quite as well this evening as I did this morning and my temperature as gone up a little. I am to get hot fermentations every 3 hours through the night.\n","23":"\n\nFeeling much better tonight and I had a good nights sleep last night, to what a nights sleep as been lately. They let me one ferment last night as I was sleeping so good. I am still in bed but I think I will be allowed up tomorrow as my temperature is good and my leg is looking real well but I dont think there is any difference in the wound it is only all the swelling as gone down. I dont do much in the day but lay down quiet and think of my chances of a board and geting home. There are only four of us in this ward of twenty one who have'nt been boarded for Australia and\n\nthis morning the sister took our names to see if she can get us boarded. Im not sure wether she can do it but she can do a lot.\n","24":"\n\nDoing fairly well and never had such a bad night and no hot fermentations.This morning the sister done my dressing and put packing in the sinus and packed it in about a inch.\n\nI thought I had had enough bed this morning and after the ward was cleaned up I got out and got dressed and then asked the Sister if she meant me to get up.She didn't know what to say or do for a minute and then\n\nsaid just like a Aussie to ask if he could get up after he had done it but she was'nt hard on me and said if I would keep my legs up on the bed and not hang them down or walk about I could stay up, but it did'nt last for long for when she dressed the wound she said it looked to bad and said she might get into trouble if the doctor saw me up so I had to get back again. Sister was talking to me this evening and said she wanted to get me a board and get me home to Aussie. She will do it to if its possible.\n\nMy old Pal Sid Hogflesh came in to see me this afternoon he has had his finial board by Colonel Rayan and marked from C.3 to 32.\n\n\n","25":"\n\nThe leg is improveing a lot and I got up out of bed after dinner. The sinus in the leg is still dischargeing and the bone has'nt grown up in the Tibia yet. The foot swelled up a fair bit this evening thorough me being up but its not very sore.\n\nThe weather is splendid here the last few days just a bit cold of a morning and night but nice and warm all day. If I was lucky I would have been for a board tomorrow beforeCol Newmarsh but there is no chance and it will be my luck to meet Rayan when I go up for he his twice as hard to pass as Newmarsh. The Sister know who to put me before and it wont be her fault if I go before Rayan if I do get the board.\n\n\n","26":"\n\nIve been out of bed since nine o clock this morning and the leg as kept pretty good. Im not allowed to walk about much on it but I can walk around the ward now and then with the aid of a stick. The weather as been great all day. Colonel Newmarsh was in the ward here this morning to see one of the men. He holds boards here today but Im not lucky enough to get one\nfo\n so far but perhaps later on.\n","27":"\n\nI can get up after breakfast now and stop up all day. The leg is a bit painfull but not much. I put in the day playing cards and reading. Its five months today since I was wounded and tonight finds me still in hospital.\n\n\n","28":"\n\nThe leg is going on well but I dont do any walking about the camp or hospital yet. I have'nt heard any more about geting a board and I dont want to hear Im up for one this week and Rayan will be on next friday and I want to go up before Newmarsh.\n\nMy old Pal Sid Hogflesh came in to say good bye this evening he is leaving for Australia at three oclock in the morning on ship D28. There are a dozen from this ward on the ship too and a few on D27. With luck I would have been on D28 and there is no doubt my luck is out for I ought to have been boarded months ago. It is just my luck and I carnt help it perhaps it will change later on. I do hope so.\n","29":"\n\nIm back in the old runing again now no better or no worse. Thesinus in my leg is just the same and they can put the probe in through the bone two inches. I get saline dressing and the sinus is packed with gauze.\n\nIts been raining pretty heavy this evening.\n","30":"\n\nTonight finds me in a different ward as we were moved from our old ward as it is to be used for\ninflueza\n influenza ward as it is breaking out here. The sister said it is very dangerous and there has been one death already.Orders came out this morning that all windows and doors were to be left open. I have heard that\n\n\n\nthere are a lot of cases at Dartford and Hurdcott and they are geting the wind up over it. This mornings paper said whole familys are dieing through it.\n\nI had a great surprise this afternoon my old mates from the company Tom Potter and Darky Harden are on leave over here and came down from London to see me. We had about a hour together and then they had to go. They were at Littlemore yesterday trying to find me and they had a lot of trouble to do it and it will cost them two days of there leave now but old mates like Tom would come and see a Pal if it cost him ten days.\n\n\n","31":"\n\nThe leg is a little worse tonight and Im afraid it is'nt geting on to well. The doctor Capt Pittman has only had a look at it once since I came here but he came around this morning and asked me how it was geting on. I told him it was'nt going to good so he said he would have a look at it tomorrow.\n\nIt gets very cold here of a evening now the winter is geting very close.\n","32":"\n\nI thought the doctor was going to have a look at my leg this morning but he never came around It is not quite as good as it has been and at times I seem to think that it will be very bad yet and cause a lot of trouble. I have'nt heard anything yet about being boarded.\n\n\n","33":"\n\nThe doctor had a look at my leg this morning while I was geting it dressed, he had a good go with the probe to see if he could feel any loose bone but said he could'nt.I told him what I knew about there being small crumbs of bone in behind the shin bone which they could'nt get out with the operateions and said yes it would be no good to operate as it would only spread the peices. He shook his head and said it takes a long time for a wound like that to get well. He wrote on my medical papers Condition unchangeable. To have BIP enjections. That is to havebipforced down the sinus to help the bone to grow. The last time I had bip was at Eastbourne.\n","34":"\n\nIve had rather a rotten day the leg as been very painful which has kept me with a bad headache all the time. The sister took my temperature this evening and said I had best stay in bed tomorrow and asked me would I. I said I would if it was bad in the morning. I dont think I will stop in bed but I will rest my leg all day on top of the bed for if I stay in bed tomorrow they may keep me there a week.\n","35":"\n\nThe doctor had another look at my leg this morning and said it looked well and told me to rest it all day. I lay on the bed reading all day but Im fed up with laying about and resting my leg. The weather is keeping pretty good only cold of a evening.\n\n\n","36":"\n\nThe leg did'nt look to well this morning and the discharge from the sinus had come right through the bandage. All around the sinus is geting red and sore. The bip dressing was changed and a hot fermentation put on and they are some hot too. Leg and foot is swollen up more than usual this evening. My days walking altogether is only about a hundred yards so its just the same as if I was in bed.\n","37":"\n\nSister dressed the wound this morning and packed the sinus with saline packing. Later when the doctor came around he said to carry on with the bip and no packing and said the leg looked well but it feels far from it tonight. The sister said this evening that no more troops were to leave here for France.\n\n\n","38":"\n\nI hardly had a hours sleep all night last night the leg was very painful. In the night the sinus had discharged freely and when the bandage came off this morning one could see where the discharge had soaked through the dressing and run down the leg. Leg feels eaisyer tonight. The Sister put our names in to see if she can get us boarded this morning and one of the boys said that only two of the names that went in are to be boarded. I had bip dressing done today.\n","39":"\n\nThe leg a lot worse today and looks it too. All the skin is breaking away around the sinus and discharging freely. Instead of the small sinus now it isabout a inch square. It was to painful to sleep much.\n\n\n","40":"\n\nThe leg is looking worse still today and when the dressing was taken off this morning it was soaked with discharge and the wound had spread to about three inches long andtwo inches wide. While the dressing was off for about five minutes a kind of discharge like water came up in big drops all over the wound where it had spread. It just looked like as if somebody had put big drops of water all over it and as the drops joined together they run down over the leg. The doctor came in while it was like that and examined it well and gave the wound a good probing to see if he could feel anything in it. He asked me a good few questions about\n\n\n\nhow it had been going from time to time and then admitted that it did'nt look to good, he was a long while thinking over things and then said he thought it would mean another operateion and made out papers for me to be X rayed so Im almost certain to get one but I dont expect it will be for a week or so as it takes a long while here to get fixed up for a X ray. My dressing was changed to Lead & Opium dressing owing to the wound spreading but nothing was done to the sinus which goes down through the bone.I asked the doctor to have a look at the big toe which is stiff, he said it wanted electrical treatment.\n\n\n","41":"\n\nThe leg did'nt look so bad this morning and the same kind of dressing was repeated and it was done again at midday and this eveningI had a fairly good night last night and my leg feels fairly easy tonight.\n","42":"\n\nLead and Opium dressing repeated three times again. Leg feeling fairly well and have'nt heard anymore about the X ray. When the Sister that used to be on day duty came in this evening she asked me if I had been boarded yet, when I told he now she said she would see the major about it and shake him up a bit.\n","43":"\n\nMy dressing was changed to hot fermentations this morning and they have been put on twice today. The leg looked to be swollen up extra this morning but the wound has'nt broke out any more so far.I spend all my days in the ward as Im not allowed to walk about, if I do and they see me I will be ordered to bed. Its been a wild wet day and tonight it is wilder still.\n","44":"\n\nStill on hot fermentations and leg keeping about the same. The wound's not dischargeing quite so much if anything. No pain just a slight ache mostly at night.\n","45":"\n\nGot good news today. I have been recomended for a board and this afternoon I went up before a doctor who asked a lot of questions about when and where I received my wounds and if I was in action at the time and after inspecting the leg made out my board papers. He said he did'nt think it was worth while about puting anything down about the wound on the foot as the leg was enough. I am to report to the C.O. at nine in the morning for my temperory board and I expect I will get my finial on friday. That means I am unlucky enough to go before Rayan but Im pleased tonight anyhow.\n\n\n","46":"\n\nThings are going with a rush now for today I had my board before the C.O. and was marked B2B (6 months Aust.) Tomorrow I expect to get my finial board before Col Rayan. It is possible that he will mark me C2 (unfit for further service or perhaps B1A which is six months here in England. I hope my luck lasts out and that I pass my finial board for Aust. Besides being boarded this morning I went to Burdon Hospital on the sea front at Weymouth to be X rayed for a operation. The photo'ed the front and side of my leg. The X ray plate ought to be here in a few days so I will be able to see it. We were taken into Weymouth in a ambulance car which brought us back about a hour after. I wonder tonight if I am going to be lucky enough tomorrow. One thing there is only one man between me and a trip home now last night there was 2.\n\n\n","47":"\n\nHad my finial board today before Col Betts as Col Rayan who should have been on the board today never came.\n\nI went in before him and took my bandage off, he had a look at my leg and foot and asked me if it had ever healed up and I told him it had never properly. He looked at my papers again and said that would do and my board was over.\n\nI have been worried ever since wondering what I have been marked and I dont suppose I will be able to find out if I was lucky enough to pass or not. I hope I am marked Australia class the same as I was on my last board. I dont know how I will be able to wait till tomorrow night to find out.\n\n\n","48":"\n\nI am still undecided as to what class I was marked on my board. I have tried my best to find out this evening but could'nt be told anything. The boys in the ward here say I must have passed the finial board as B2B but it is rather too good to beleive until I see for myself.\n\nMy leg is looking splindid to what it as been lately but is very swollen and sore. I am still on hot fermentations but now the wound is looking so clean and well I expectit will be changed.\n\nI sleep well now of a night once I get to sleep but the ache keeps me awake for a long time some nights.\n\n\n","49":"\n\nI saw my medical card this morning at the C.O. office. I have passed my finial board as B2B. I was pleased when I saw it it seems almost too good to be true to think that there is every chance now that I will be on my way home before Xmas.I am satisfied tonight and now there is no more wondering how I will get on and I will be satisfied now. My leg is feeling well and the dressing was changed back to lead and opium again this morning. The leg and foot is still very swollen but I feel any pain from it tonight. I have heard no more about the operateion. TonightI am pleased.\n\n\n","50":"\n\nThere was a lot of excitement here when orders were read out saying the war was over and there has been big things going on in town. I was thinking of trying to get into town but thought better as my leg is not good enough. Its hard to be in hospital when the war ended but I suppose I ought to\nbe lucky\n think myself lucky. I wonder where Tom is tonight I hope he his well but lately I have seemed to think something as happened to him as I have'nt heard from him for four or five weeks. The doctor spoke to me this morning about the X ray he said he had'ntseen it yet but it ought to be here any day. He has'nt saw the leg for nearly a week.I was pleased last night I am more so tonight.\n\n\n","51":"\nOct.\n Nov.\n\nPeople in Weymouth still rejoiceing over the victory. All day bells have been ringing and at 12 o clock hooters were blowing for ten minutes or more.The boys here in this place takes things pretty quiet it is mostly because they are finished with the war in any case as they are marked for Australia. I had more good news today for I have been warned that I am on a boat roll for ship D29. I wont be able to have any leave here now for if I go I will be struck off the boat roll and I dont want any of that. The sooner the boat goes the better I will like it I dont wantany leave. There is only one thing wrong now. I have'nt heard from Tom for over a months and I have been begining to think.\n\n\n","52":"\n\nMy pay book was taken away today as I will be issued with a pay card now I am Aust, class.My leg and foot seems real good and pretty strong now and I walk about the ward without the stick. The weather is keeping great and everything is A1.\n","53":"\n\nI saw the doctor this morning and had a good talk with him. I asked him if my X ray photo's had arrived and he said it had'nt.He had a good look at my leg and I told him it was feeling great and that I had been put on a boat roll\n\n\n\nfor Aust. and I did'nt want to miss it through a operateion. He said he would'nt keep me off the boat as if a operateion was nesecary it would do just as well in Aust. as here. I asked him about the wound on the big toe as it stops me from wearing a boot at present as there is a bump on the side where the bone is broken or another peice of shell in there. He examined it and said there was something very wrong with it but I could have it fixed up when I got to Aust. I managed to wear my boot for a few minutes this evening as I had got it stretched. I was sent for this afternoon to draw my kit from the Q.M. stores. They say we will leave here about Wednsday.\n\n\n","54":"\n\nThe leg and foot still keeping about the same and Im doing a bit more walking now than I have been but I have'nt been going outside the camp. I try and keep my boot on for a little while now of a day but the pain it causes is a bit to severe after having it on for a little while.\n","55":"\n\nIt was a extra cold day the coldest we have had so far.I hear we are to leave here for the boat in about six days time. I wouldnt care if it was tomorrow so as to be well away before the winter sets in properly.\n","56":"\n\nAnother very cold day I put in nearly all the day sitting at the fire.I got a letter from Tom this afternoon I had'nt heard from him for nearly two months.\n\nThe leg does'nt feel\nquiet\n quite so well these cold days it as a sort of a dull pain but it does'nt trouble me very much.\n","57":"\n\nMy leg was feeling very good this afternoon so I went into Weymouth. I never had much walking to do as I went in and came out in a motor. It was real good to be out walking about the town and it was after nine oclock when I got back.The leg is swollen a bit extra but it feels no worse.\n\n\n","58":"\n\nMy X ray photos came this morning after the doctor had been around. As far as I can see by them the bone looks all right only for a few bumps showing. On the paper which came with the photos it says Sequisition apperently lying in small cants in tibia. The X ray was taken to see if it was that that was the trouble. I dont think there is any other way out of it but another operateion but I dont expect to have it till after I get to Australia but I will know for certain when the doctor comes around in the morning.\n\nMy leg looks well and there is only the small sinus there again now which keeps dischargeing a little. It does'nt seem any the worse for my walking about yesterday.\n\n\n","59":"\n\nMy leg is feeling real good and this afternoon I went for a three mile walk and all I had was one stick to help me a little. I walk along very slow and have to be very careful where I put my foot down as the ankle is very weak. I feel rather tiried now but otherwise A1.\n","60":"\n\nIve been to Weymouth again this afternoon I can get about now quite well and its great to be able to get about in the open again. Soldiers are not allowed into any amusements in the town on account of enfluenza.\n\n\n","61":"\n\nI heard this morning the staff men for ship D29 left here and that we will leave on Sunday. Our pay cards were taken away this afternoon, the way we will be paid before leaving for the ship. So we must be going to leave here soon. I have been for another long walk this evening through the fields and back along the sea front. Although it hurts to wear my boot I have managed to keep it on and I am geting more used to it now. The walking makes the sinus in my leg discharge more but that wont hurt it it will do it more good if anything as the discharge has to come out. All the same the doctor dont quite agree.\n","62":"\n\nIm walking about real good now with the aid of my stick. I can wear my boot with very little trouble and can walk a long way before my leg aches.My ankle seems very weak and I almost go over on it if I step on anything uneven, it aches a lot if I give it the least little twist or jar.The doctor bound a bandage tightly around it this morning and it seems to strengthen it a lot.\n\nIve been to a concert in the Y.M.C.A. hut this evening and it was a awfull show and most of the boys went out before it was over.\n\n\n","63":"\n\nI was notified this afternoon that I was on the finial boat roll for D29 and would be leaving here on the 26th. One is always being notified about something and the boat has been going to sail for the last week.\n\nIt as been a wet miserable day and my leg never seems to be as well on these sort of days but I expect it will be alright when it heals up properly and the bone all grownup again.\n\nI have my leg dressed every morning with a dry gauze dressing sometimes when it is taken off one can see where the sinus has been dischargeing a lot and other mornings hardly any at all.\n\n\n","64":"\n\nWe heard late last night the the staff men who went away from here for boat D29 had came back here and that the boat would'nt sail till later on.Its been a wet miserable day and in the morning and evening it was cold. The winter must be geting close now.\n","65":"\n\nWe were told this morning that D29 had been cancelled for some days. They said they could'nt say how long it would be but it had been sent to Holland to bring to England prisoners of war and it would only\n\n\n\ntake four or five days to do the trip and they thought it would only do one trip.It caused a little disappointment in the camp but the boys did'nt mind so much seeing it was wanted to bring prisoners of war from germany.\n\nWe have a new doctor to this ward now Dr Barton Capt, our old Doc Capt Pittman has gone away. When he saw me this morning he said to the sister? We will have it got ready for a operateion this afternoon. I told him I was on a boat roll and expected to be leaving any day so he never said any more and marked on my papers On a boat roll.\n\n\n\n\n","66":"\n\nI expected to be sent out of hospital to my company this morning seeing I had as good as refused to let this new doctor operate on me and that there is no word of when the boat will sail. My leg is well enough to allow me to leave a hospital ward as I can get dressings done at the dressing hut. I got about a lot now. I went out for a walk this afternoon and this evening I went to a concert in Weymouth. A sargent came around this morning and asked all who were on boat roll D29 if they had drawn all their kit and had finially fixed up everyting with the Q.M.\n\n\n","67":"\n\nHave'nt heard any more about when our boat may leave but I dont think it be for another week now.\n\nI have'nt seen the doctor since the morning he wanted to operate.Now I can get about again and look after myself I would like to leave this hospital ward and go to one of the huts. One is not quite as well off there as here but it would be a change and Im fed up with being in hospital wards.\n\nI will ask to be marked out to the huts in the morning as there was a new case come in this afternoon and he his next to me and he has all sorts of complaints.\n","68":"\n\nI asked the doctor to mark me out to the huts this morning and said I thought I was well enough. He marked me out and said it would be good enough as long as I had my dressing done every day. I would'nt have wanted to leave only for not knowing how long it may be before the boat may leave and the fellow next me kept me awake nearly all night groaning and\ncoffing\n choughing and I dont want to get his complaint.\n\nMy papers went to the C.O. office today and tomorrow I will draw my uniform and go to the hut. Another night to be here with my sick mate.\n\n\n","69":"\n\nI drew my kit this morning and handed in my hospital blues. I am in uniform again now and have been transfered to No 2 Coy Hut 63. It wont be as comfortable here as it was in the hospital ward but it is comfortable enough and we have the same beds.\n\nI would'nt have liked to have stopped in hospital alongside of that new mate I had, for last night was the same as the night before he was choughing and spiting and groaning nearly all the time. I done a lot of walking on my leg today and it feels none the worse off tonight.\n\n\n","70":"\n\nMy name was called out this morning as I was to report to the massarge room to see what treatment I would be put on. I went down but they never had my card so I have to call in the morning and they will get my card in the meantime.\n\nI suppose I will be put on massarge treatment of some sort although by the way I can walk now I dont think I will need much. My ankle is rather weak and when I walk on anything uneven I go over on it very easy.\n\nIts been a real English wet day very light rain and a heavy mist.It's Sunday night and I have been down to a song service in the Y.M.C.A.\n","71":"\n\nI reported again to the massarge room this morning and when the doctor had a look at my leg which is not quite healed yet, he gave me a note to go and see Capt Barton at the dressing hut. I did'nt let him see it and he said if I got a dressing there every day or other day it would do.\n\nThere is nothing certain about when our boat D29 will go but no leave or furlough will be granted so they must expect it to go soon. D35 is expected to go in about three days.Everyone here call D29 the mistry ship and I am begining to think it is one and sorry that I am on it for it is very disappointing now it as been delayed so long.\n\n\n","72":"\n\nIts been a dull misty day and the days seem to take so long to pass when one as nothing at all to do. There is no word about D29 yet but I was told by the sister who used to be in charge of the ward I was in that everyone in the camp will be gone by the 14th of this month.\n\nIve been to a concert in the Y.M.C.A. this evening and it was the best one they have had there. After the concert I went into my old ward to say good bye to some of the old boys in there who are leaving early in the morning for D35. D29 boat roll was out long before D35 and there is no sign of us going yet.\n","73":"\n\nWent on parade at half past eight this morning and we were told to hand in all our pay cards before ten o clock. There was about a dozen names read out for a new boat roll.\n\nRoumer\n Rumer has it here now that D29 as been cancelled again and that those on 29 will go on other boats, but one carn't beleive these rumers as there are three or four different ones out ever day. The boats are to sail by their name now not by numbers. It as been another wet dully misty day.I went to the pictures in the Gym this evening, they broke down about every ten minutes and only showed two pictures.\n\n\n","74":"\n\nWhile on parade this morning we were told that at half past one there would be a parade for a boat roll was out for the Argylshire and that some of the men who were on D29 roll was on it as D29 was'nt going.I heard all the names that were called out but I was'nt on it worst luck. This afternoon I had to get a order signed by the M.O. to say I could wear slacks instead of breeches and leggens and then I was issued with another uniform so now I am complete. I was in Weymouth for a few hours this evening and sat on the seat on the\npromarde\n promenarde. I came back here about seven and went to the pictures at the Gym.\n\n\n","75":" 7th\n\nI got my pay book back today instead of pay card as one does'nt need a pay card when returning to Aust. now.The weather is still unchanged and very miserable.They say a couple of boat rolls are comeing out in a day or so and I\nespect\n expect to be on one as they are sure to be treatment boats.\n","76":"\n\nMy luck changed this morning a boat roll was read out and my name was called out. I went before the doctor to see\nwet\n whether I would be fit to travel in a hammock but I wanted a berth and told him I didnt think I could sleep in a hammock as I had a open wound. So I was lucky enough to get marked for a berth.\n","77":"\n\nSunday morning so no orders were read out.There was a church parade on but I went away to get my leg dressed. The weather brightened up a bit this afternoon so I went into Weymouth, the town is crowded with Americian sailors. I came out early and\na\n went to a song service in the Y.M.C.A.\n","78":"\n\nThings came on with a rush today nothing was said about our boat on parade this morning but about four o clock this afternoon we were called on parade as we were to go before the doctor and be examined and get our boat ticket.At the\n\n\n\nlast minute they found out they had no tickets here and they told us to go back to the huts and stand by.\n\nThen I was moved from No 63 hut to No 1 as\nthe boat\n we were to leave for the boat at four in the morning and all had to be in the one hut so as there would be no trouble to find us in the morning. At seven oclock we were told we need'nt stand bye any longer as we would'nt leave till Wednesday morning (today is Monday). It is common for things like that to happen here.I had my pay book in forpay but they would'nt pay me because of the boat going in the morning.\n\n\n","79":"\n\nPassed the finial enspection by the doctor this afternoon and later on was issued with my boat ticket for a upper berth. We are to leave here in the morning they sayat the office.Its been a miserable wet day and a whole day of messing about for us on the Burma. Things are not quite settled yet tonight it is nearly ten o clock now and we are expecting to get more orders before midnight.I have my both kit bags packed and ready, one is to go down the hold and the other I keep with me. I dont think I will see the one in the hold till I reach Australia.\n\n\n","80":"\n\nStill here at Monte Video the boat was cancelled again late last night and all were very disappointed and wild about it.They took the tickets off us on the morning parade and a lot of the boys who were to leave this morning were put on a 24 hours guard. Everyone kept growling up till four o clock this afternoon when we were told that we would leave in the morning after all as the boat was'nt cancelled for good as they thought at first.\n\nWe are to get out a five and have breakfast and leave about six. Another boat is going as well (the Nestor) they get up at 2 o clock. I wont be certain I am going now till Im about to go. There as been tomany disappointments lately.\n","81":"\n\nPlymouth. Devonport.\n\nEverything as gone real well our boat was'nt cancelled this time and tonight finds me on board the steamship Burma, Glasgow.We left camp this morning at seven in ambulance cars which took us to Weymouth station. Our train left at eight and we reached Taunton about eleven, then caught another train at one oclock and arrived at five.\n\nBefore leaveing camp we were given our dinner in a paper bag then at Exeter we were provided with a cup of tea and a scone roll by the Mayoress of Exeter. Our train pulled in right\n\n\n\nalongside our ship which is not a very big one but any sort will do me as long as it gets me to Aussie.\n\nThere are only about sixty of us medical cases on board the others about a thousand I should think are 1914 & 15 men returning. They have hammocks. We are quartered in the front part of the ship and we have plenty of room and have berths to sleep in.Since comeing on board this evening I have met several boys from my company and others who are returning.\n\nRoum\n Rumor says we leave at six in the morning, it can leave now if it likes. I am feeling A1 for the trip.\n\nS.S. Burma.","82":" At Sea\n\nWe left Port at six this morning it was just about daybreak I was up early and was able to see the sights as the ship went out. No sooner than we lost sight of land did the ship start rolling and pitching and some rolling and pitching at that.This afternoon the water was breaking over the deck and it was impossible to walk about up top without holding on to something.The ships officer said it was on account of the ship having no cargo that made her roll and pitch about so much.I was A1 last night but I dont feel over bright now.\n","83":" At Sea, Bay of Biscay\n\nWe are still having it rough its the roughest I have ever found it at sea. Most of the boys are sick and Im not over well myself although I have'nt been sick so far.\n\nWe passed a destroyer and a cruiser this morning. There as been no land in sight since we left. I went and had my leg dressed at half past ten and I was told every other day will do to have it done. It is feeling fairly well.\n\nPort Said is going to be the first port of call then through the Suez and call at Colombo where we have been told we will be given leave if there is no trouble on board.\n\n\n\nAt Sea,","84":"\n\nWe have passed through the bay now and since morning the sea as been calmer and those that were sick yesterday are well today and everyone came for dinner where only eight out of twenty did yesterday.I am feeling A1 again tonight although I never got sick I did'nt feel over well the last two days.\n\nWe all got a issue of three packets of cigarettes and a kit bag of underclothes from the red cross today. In my back was 2 suits of pyjamas, 2 shirts, a pair of socks and shoes, a white hat, 2 hankicheifs, soap & tooth powder.\n\nThere is a heavy fog tonight. This afternoon two of the sisters who are returning came to see us and how we were geting on.\n\n\n","85":"\n\nWe entered the Straits of Jibralter late this afternoon and passed Jibralter about a hour later. We are going along nice now in calm water and they say we will have it good now till we reach the Indian Ocean.\n\nThe Sisters are doing our dressings now. My leg is a little worse and as been acheing a fair bit since last night.The wind is rather cold up on deck at times and I think it is only that that as made it worse. It is nice and moonlight up on deck tonight and some of the boys are sleeping out.\n\n\n","86":"\n\nSteaming along nice and calm all day and several times through the day we noticed sharks following the boat.\n\nThey have got some of the A1 class soldiers down in the stokehold stokeing and they are geting good speed out of the engines. This is this boats maiden trip to Australia and they want to do it in as quick a time as they can. They are paying the soldiers 8\/- a shift. Our average of speed is a little over 300 miles for 24 hours about 13 knots a hour. The Indian crew could'nt get near that much speed up. There as been a\ntournment\ntournement on of all kinds of games this evening.\n\n\n","87":" 6.7.\n\nWe are well in the Medeterain sea now and it is expected that we will arrive at Port Said on Sunday the 22nd.\n\nWe have been within sight of land since early morning and will pass Malta sometime tomorrow.\n\nThe old boat as been doing a fair amount of rolling and tossing today and it looks as if tomorrow is going to be a wild day. Some of the boys say this boat would roll in dry dock but all the same we are still makeing good speed. We had a concert on board this evening and it was rather good.\n","88":" 3.4\n\nMy leg was easyier last night but I think the wound will spread again in a few days.\n\nLast night I thought it was going to be a wild day but it as been real good. We are somewhere off Malta tonight but to far out at sea to see any lights or anything. We passed close by a big cultivated island at midday and the ship exchanged several flag signals with the signal station on land.There as been a great debate tonight as to whether should Australians marry English girls. It finished up a failure and the boys would'nt give their opinion.\n\n\n","89":"\n\nWe are steaming on grand, for the last 24 hours we travelled 337 miles.\n\nAll day there as been a big sea running but we are going with it which keep the ship fairly steady. We passed several other ships one we were told by the Captain of the ship was a Qboat. Im glad we are not going against the wind for the ships we passed doing so were rolling and pitching and at times the breakers used to run right over the front of the ship.\n\nMy leg is feeling A1 again and looking fair and the discharge as stopped and I hope it for good now.\n\n\n","90":" 9.\n\nA big sea is still running behind us and the ship is doing very good speed. We expect to be at Port Said about midday tomorrow and it is expected we will stay there for the rest of the day.\n\nThe soldiers are still working down in the stokehold and others have started to paint the ship. The ship is all camoflaged now painted all different colours but they are going to paintit all one colour now.\n\nWe had another concert on board this evening and some of the officers and sailors of the ship sang some sea songs. My leg is feeling real well again tonight.\n\n\n","91":"\n\nWe anchored at Port Said this evening at 6 o clock We are close up to land only about a hundred yards from the main street runing along the port. The Smarli whichleft Plymouth on the 11th left here this morning that is the ship we are trying to race to Aussie. It is a nice moonlight night and its great to be in Port where when one looks out he does'nt only see water.A lot of the boys have gone ashore by climbing down the ropes and geting the natives to row them ashore. Nearly all were caught geting back on board.\n\n\n\n\n","92":"\n\nTonight we are travelling through the Suez Canal.\n\nWe left Port Said about seven o clock this evening.There was no leave granted for any of the troops to go ashore today but at different times all the officers went ashore. The troops threw potatoes and other things at one lot of Officers who were going ashore on a small boat. It was'nt so bad on\nshore\n board as dozens of small boats came around selling oranges and other fruit and some were selling silks and souveniers.The Nestor passed us this morning. There are big headlights on the front of the ship to show the way through the canal.\n\n\n","93":"\n\nThis morning when we got up on deck we saw we were anchored in the Bitter lakes. We had travelled all night at a very slow speed about five miles a hour as a big ship is not allowed to pass through the canal at faster speed. We was'nt anchored for long it was only to let two ships pass going in the opposite direction.\n\nIt was a grand morning and about ten\noclok\n o clock we arrived at Port Suez. As we we going through the canal we passed a lot of Light horse and Americian troops. They cheered and told us how lucky they thought we were to be going home. The Smarli and Nestor are anchored close by. Xmas eve all very quiet.\n\n\n","94":"\n\nChristmas Day.\n\nEverything was quiet up till about midnight last night but sometime in the night the troops some of them cut through the bottom hatchway with axes and got at the cargo of whisky. There must have been hundreds mad drunk by daylight and every where there was nothing but fights and arguements. We could hear them up on deck but the seventy of us in this part of the ship being C class and wounded none of the drunks came near us.There was a few rows down here but nothing to what was going on up top.\n\nWhen I went up and had\n\n\n\na look around it looked as if we had been in a naval battle for blood and dead drunk troops we lieing all over the place. The whole of the deck as been simply awfull and one carn't explain it, all I can say is that since very early morning the ship as been at the mercy of drunken half mad soldiers\n\nOne could see who was in charge of things very early when two men who were under hospital treatment were fighting.They would'nt stop the fight themsleves\nbut got a private to\n and when some officers and the doctor came down the mob hooted and said other things which\n\n\n\nshowed them what chance they had of stoping it or if they did what it would mean so they got a private to explain it to the mob. He said as one man whose arm was still in bandages was just geting over a broken arm and the other had a peice of shell in his back near his spine which was very serious the doctor wanted the fight to stop. So the fight stopped.\n\nSince then nobody as interfeared and blood as been runing and fighting going on ever since It as been simply\nbrutely\n brutal I have seen two men lieing on the deck to drunk to stand fighting and kicking one another covered in blood. It would'nt do to\n\n\n\ntry and stop them or say anything for some other drunk would have hit one with the first thing he could get or if one or two could'nt do it they would collect from ten to twentymad drunksand go around the ship looking for one. Several times today I have been on the point of objecting to some of the abuse or interferences I have been subjected to by drunks and other fools who I could have knocked down two at a time as my leg would have stood it but Im glad I did'nt for I can guess what it would mean sooner or later for last night one of the crew was hit on the head with a hammer and another had his elbow split\n\n\n\nopen. They were in their bunks asleep at the time but they had been drinking with the others. They are both in hospital tonight.\n\nI dont know for certain but I was told by the ships steward that there were fourty five gone into hospital so far and that the number of cases of whisky stolen was sixty three. I saw a good few of the troops in hospital this evening most of them were nearly dead through being poisoned by drinking to much. They expect several deaths tonightI heard the doctor say and one of the sailors is all but now. Now things are in such a state theiveing is rageing all over the boat. What I carn't make out is\n\n\n\nwhy the toops have been allowed to carry on like this. I know the C.O. of the boat and the head doctor are away from the ship but another officer is in charge while he his away so they ought to have been able to do something.\n\nSome say they are as drunk as the troops but one doesnt know whats doing on their decks. They must be waiting till the troops get sober and senseable again before they interfere.\n\nI have never seen anything like today in my life before and could never beleive it if I had been told troops could act like this but it is all too true and although I was pleased to know I was returning on this ship Im sorry now and wish I had missed\n\n\n\nit.There is a special guard of corporals guarding the hold of the ship where the whisky is tonight so if the troops have'nt got some hidden away they all ought to be sober in the morning.\n\nIt as been a nice sunny day and we are still anchored in the same place but it is said we are leaving tomorrow. We were given a Xmas box from the red cross this morning and tin fruit for dinner which was much the same as our usual dinner.\n\nThis as been Xmas day well it as been some day and I hope I never see another day like it and although I have wrote a lot down I wont ever forget it this Xmas day in Port Said.\n\n\n","95":"\n\nThings quietened down late last night and have kept good since. Talking to one of the ships men this afternoon he told me that the Captain of the ship went ashore yesterday to try and have the troops taken off as he did'nt think it safe to put to sea. He is tirrible wild about the troops geting at the cargo of whisky and thinks it might happen again and worse than it was this time.Those they thought would die last night are recovering well. \n\nIt is said that there will be no leave given at Colombo over yesterday but I think they will change their mind later on as whichever way they do\n\n\n\ngeting there for I know now that more than one have gone. It will be rotten if some of them bring enfluenza on board for it will mean all of us being quarenteened when we get to Aussie. I would'nt go to any trouble to go ashore because I was ashore here before but some of the boys who have'nt will take stopping.The whisky cargo was broken into again last night but I dont think there was much trouble as they did'nt get as much as thy did before.\n\nI was up walking around the deck just outside today and I had a dry dressing put on instead of fermentations. I may be able to go down on the other deck tomorrow.\n\n\n","96":" Jan., Colombo\n\nNoone was allowed to go on shore but the troops were allowed in smimming and so as to have some kind of sport they lowered a few of the life boats and had a few boat races. They rowed us C class over onto the breakwater so as we could have a bit of a walk. The breakwater is about 20 feet wide and nearly a mile long which we were on and as there is a opening to each end to let the ships inside they was'nt afraid of any of us geting away.I went over and I enjoyed the walk up\n\nand down as my legs were feeling A1.\n\nThe began coaling up the ship very early this morning and they are taking on a lot of fresh water. They say we are not allowed on shore on account of enfluenza but still it does'nt seem to matter about having a couple of hundred blackfellows from the shore runing all over the boat and then a fresh crew came on board as well. A few of the A class troops broke ship and got ashore this morning but not very many. They say if they are caught they will be kept on shore for 3 months.\n\n\n","97":" Jan., Colombo\n\nThey had a few more boat races again today and nearly all the troops were in swimming. I would have liked to have been able to go in myself but I dont think my legs are quite good enough yet for a swim although I am walking about real well and this morning I was on the breakwater again with a pal geting oysters. Some of the Sisters and Officers went ashore about midday and as soon as the troops knew it they got into two of the coal barges and went too, one lot got caught and were brought back. A couple of hundred\n\n\n\nwent ashore last night in the coal barges as they were bringing coal to the ship all night.\n\nTheir was about fifty naval boys came on board today, they are New Zealand boys and are going to Aust. They later on a lot of strays who had missedtheir ship some of them from the Smali which left at midday, others had been on shore for three months. Its been very hot all day and tonight is the\nsma\n same. I am sleeping right up on the top deck tonight in the open. I will be glad when we are moveing again. I beleive we leave early in the morning.\n\n\n","98":"Jan.\n\nAt midday we were fifty miles from Colombo so tonight we are about a 125. We left about eight o clock this morning,we left a few of the troops behind. Soon after we were outside the breakwater some of them were seen rowing over but they were to late, perhaps they will be able to board the Wiltshire which in in port carrying New Zealanders but they have a few hundred Australians with them so they ought to be right.\n\nI have given up sleeping below now, on the top deck will do me as its much cooler and fresher but one as to get up at five when the\n\n\n\nIndian Ocean\n\ncrew begin to scrub the deck but the fresh air is worth it. They say we will be at Fremantle in ten days but as it is 3100 miles away we will have to\navarage\n average over 300 miles a day. One thing we are on our last lap for Aust now.\n\nMy left leg which as been healed up for over a week broke out again today and as it was stinging I took the bandage off and saw the end of a small piece of bone sticking out. I pulled it out myself right away. I am glad that as came out perhaps it is the last and now it will heal up for good. It is feeling great tonight.\n","99":"\n\nWe made very poor progress for the last 24 hours only travelled 250 miles. Very early this morning the Wiltshire which we left in port was just within sight behind us and this evening she passed out of sight ahead of us. It looks as if it will take us twelve days to reach Fremantle instead of ten. Its been a very hot day and I have got rather sunburnt, my right leg is A1 again and the old fractured left one is not doing so bad.\n\nThere was a bit of a concert on tonight on A deck and medals were given out to the winners of the swiming races which we had at Colombo.\n\n\n","100":"\n\nWe have had quite a change today, it as been very cool and raining. A storm broke about 2 o clock this morning and caught us all who were sleeping up on deck lovely before we knew anything we were wet blankets and all. The\nrain\n wind blew the rain under the awnings so there was no shelter till one got down below. There are only a few up on deck tonight as it looks like more rain but I am up here and am going to chance it again for it is rotten down below and I carnt sleep there I would sooner take my chance up here where one does get some fresh air. The last 24 hours we travelled 276 miles. It is quite cool tonight.\n","101":"\n\nIt kept fine last night but it began to rain about eight this morning and continued all day. The rain does'nt make much difference in the day and it keeps things cool. It is much cooler up here on deck tonight and it looks as if it will be fine.\n\nMy leg as been pretty sore but it does'nt make any difference in my walking about although I dont do much as I sit up here reading nearly all the day. I am geting dispirited with the old ship it is not going as fast as it could. The last twenty four hours travel was 273 miles.\n\n\n","102":"\n\nIt kept fine again last night but rained nearly all day. I am having rough luck with my leg again, when I was geting it dressed this morning I could see it was breaking out big again. If my luck does'nt change I can see myself going into the hospital ward. My right leg which made me go in last time is completely A1 and I dont think I will ever have any more trouble with it but as for the old fractured one which has never been right yet well I think tonight it will be no better when I reach Aussie than when I left England. Last 24 hours 288 miles.\n","103":"\n\nThe weather is still keeping nice and cool raining a lot through the day but keeping fine enough of a night to sleep on deck.We had our weekly kit inspection again today to see if we had any bombs or shells in our kit. \n\nEver since the troops broke into the whisky cargo on Xmas eve they have been geting hold of it although they had a guard of corporals over it but they never got hold of very much till last night again. Tonight they have a guard of staff sargents, sargent majors and warrant officers who have to sign a paper every four hours saying the cargo is correct. Travelled 266 miles.\n","104":"\n\nMy leg tonight is about the same as it was three or four nights ago no better no worse.\n\nFresh water is geting scarce or board and we can only have a fresh water wash of a morning now where we usued to have it morning and evening turned on for a hour each time. We can have plenty of salt water showers so its not so bad They have stopped the troops from working in the stokehold owing to them useing to much fresh water to wash.\n\nThe first orders were read out this afternoon about breaking into the whisky. They wasnt anybody who knows anything about it to report it. The last twenty four hours travell was 257 miles.\n\n\n","105":"\n\nThe rain caught us again sleeping up on deck last night and one was rather wet by the time he got down below.My wound has been giving me a bit of trouble these last few days and no wonder for two lovely bits of dead bone were working their way out. They are out now and the leg feels very easy.\n\nThe theives are very buisy again on the ship, they are takeing the kit bags as they are now and it is beleived that after they take the valuable things and souveniers out they throw the rest overboard. Up to tonight eleven kit bags have been reported stolen five of them were taken from the sargents quarters last night. Distance travelled 252 miles.\n\n\n","106":"\n\nIts been fine all day and it was splindid sleeping up on deck last night. There are two cases of enfluenza on board now and there is talk about us being quarenteened when we reach Fremantle. It will be very hard luck for us if we are.\n\nThe old ship is rolling like anything its a wonder it does'nt turn right over for it seems to roll for nothing. The wind is blowing very hard and it is quite\ncoll\n cool this evening and I think I will sleep down below tonight.The old tub as only travelled 253 miles for the last 24 hours.\n\n\n","107":"\n\nMy leg is feeling real well again and everything is going well with me. The only trouble is the old ship is not traveling fast enough. We only travelld 254 miles the last 24 hours. They say we wont be in Fremantle till the morning of the 23rd.\n\nThere as been a big change in the weather it is very windy and rather cold today, the troops are going about with their jackets on now and very few are sleeping on the open decks tonight. I am staying down below again tonight as it was quite cool here last night and there is plenty of fresh air coming down the wind shutes.\n\n\n","108":"\n\nMy wound as healed up splendidly since those last two peices of bone came out. I do beleive it is going to keep healed up now.\n\nThe weather keeps cool with a strong wind blowing and the old ship is rolling like a good un at times the sides almost dip under and one has to be very careful walking about the deck. A few waves have come right over this evening.\n\nTheiving is still going strong and a lot of the troops are carrying their kits about with them now. Its pretty hard when one cannot leave his kit for a few hours. Last 24 hours travel was\n","109":"\nF\n Jan.\n\nWe have had a very rough day, since last night a big sea as been runing and the ship is geting tossed about some. We are geting close to Aussie now we will arrive at Fremantle in the morning. I will be up early to have my first look at old Aussie again and tonight it brings back memories to me of how many times I thought I would never see it again. My leg is behaveing well and I have great hopes this time that it will keep well.On account of the heavy sea against us we only travelled 243 miles the last 24 hours. The last night before seeing old Aussie again.\n\n\n","110":" Jan., Fremantle.\n\nThis as been the most perfect day I have had since leaving for the war. We were in sight of Aussie at day break and by 10 o clock we were anchored just outside the breakwater at Fremantle harbour flying the quarenteen flag, later the doctor from the shore came aboard and passed everything as welland the flag was pulled down. A week back they said we had two cases of enfluenza on board but found out later it was'nt. Just after dinner the anchor was pulled up and we steamed up near the wharf's. Several motor boats came out full of people to welcome us in and when\n\nwe got close enough we could see the crowds of people on the wharf. The ship tied up out from the wharf and as there was about ninety of the troops to leave us here they were taken off in motor boats. We could see them geting a great welcome over on the wharf and there was a lot of cheering going on. Everybody was thinking how hard it was that we could'nt go ashore when orders were sung out that all troops would be allowed to go ashore till six o clock but had to pay sixpence to be taken over to the wharf and back in the motor launches. All of us hospital cases we given a free ticket. We got on shore\n\n\n\nabout 3 o clock and oh what a welcome the people gave us, they took us in to a Y.M.C.A. to give us something to eat and some smokes. I caught my breath when I saw what was on the tables big piles of cakes and jam tarts, sandwiches and all kinds of fruit. It seemed to good to be true that we could eat them and eat as much as we could. I never enjoyed a feed so much in my life and I had three cups of tea and by the time I managed to force myself away from the table I could hardly walk.I walked around the town with a couple of mates\n\n\n\nand felt very happy to think I was in Aussie again.\n\nReturning to the ship about six o clock I went into another welcome home place and began eating and drinking tea again. It was simply great to be able to get such good things to eat especialy after the rough food we get here on the ship. I am feeling very happy tonight now. I am back on the ship and our next port is supposed to be Port Melbourne and we will be there this day week and I think we will go on by train to Sydney from there. We left Port at eight pm and the ship is begining to get a roll on now, I expect we will have it pretty rough\n\n\n\nfrom here to Melbourne. I thought my leg would stand the trip on shore alright but I took a stick and I am glad I did for although I put some weight on it when walking my leg as gone cranky on me and is swollen up rather a lot now and is acheing a fair bit but I dont mind it can ache every night for mine if I can get something to eat every day like today. I dont know how Im going to look at the food on the ship now, I wont be able to touch it for a few days till I get real hungary, oh well only another week more. I will never be able to forget my first visit to Fremantle and the real good food I had here.\n\n\n","111":"\n\nWe were still in sight of some of good old Aussie at dark and we are steaming ahead fairly well at midday. We were miles from Fremantle and all is going well on board only we lost about fifty of our troops while in Port. Five of our deck missed the ship, Aussie must have been to big a temptation to them after they had tasted real food and could'nt think of returning to the ship just then. I know some of them said if they got off they would'nt come back and they kept their word. I will own up I felt like as if the ship\n\n\n\nsailing didnt matter to me as long it was Aussie I was in, but then I was'nt in the right part and Im quite willing to stick for another week to get to Melbourne. Its begining to get rough tonight and I suppose we will be soon in the bight where we will have it with a vengence.\n\nIm sorry to say my leg wound as cut up rough on me again it is breaking out all around where it broke out before. I think the bone must be decaying and there is no hope till after another operation. It is'nt swollen but it is rather stiff and sore. I suppose going on shore yesterday helped it on but if it had been well inside it would'nt have mattered.\n\n\n","112":"\n\nThe leg gave me a very bad night of it last night but this morning the wound looked well and as if had'nt broke out yesterday. I was very lucky it was looking well for this afternoon I was boarded by the doctor to see if I was fit to go on leave or have to go into hospital as soon as I reached Sydney. As it was I managed to get him to recomend me \nfour\n for fourteen day leave before going into hospital.\n\nIt was very cold last night and rather cold today. I car'nt make it out why it is so cool here at this time of the year. One could beleive he was in La France last night.\n\n\n\n\n","113":"\n\nMy leg is not feeling very well at all it gave me another bad night last night and as kept me pretty quiet and still all day. I think it must be through the sudden change in the weather for it was cold again last night and today. We all thought we would have it pretty rough crossing the bight here but we are having it very calm. I have a bad head tonight through having my leg acheing. It feels easier tonight to what it as been the last few days and perhaps tomorrow it will be right again. We are out of sight of Ausie now but late last night we could see bush fires along the coast.\n\n\n","114":"\n\nWe are having it quite calm across the bight and it is surprising to see the difference in the food since we left Fremantle. The is twice as much of it now and three times as good. We were given blue arm bands this morning and had to have them sewn on our\ntunecks\n tunicks and greatcoat by two o clock. My wound is healed up nicely now but the leg aches and pains a little now and again, mostly at night. The weather is still cool and a strong wind blowing. There was a debate on tonight but I never went.\n\n\n","115":"\n\nEverything is going well on board and there is very little chance of us being quarenteened at Melbourne. Noone knows yet for certain how we will travel from Melbourne to Sydney but most of the troops think and hope we will go by train. One thingis certain this ship is not going further than Melbourne but I think it possible we may be put on another ship which is going to Sydney, but everything is uncertain yet.\n\nWe had a big farewell concert tonight and the troops and sailors put up a real good show. Printed programmes were given out.\n\n\n","116":"\n\nOur last whole day on board for we will be at Port Melbourne tomorrow morning, and by the way things went today we must be going ashore early.\n\nThe ships quarter master counted up everything on the deck this morning and this afternoon they took our blankets away but they left us our mattresses to sleep on tonight. That is if there is going to be any sleep, I dont think there will be myself for all the troops are restless and as they only have their hammocks and no blankets they wont try to sleep.\n\nAll on the ship were\n\n\n\npaid10 and there is a lot of gambling going on which they are certain to keep up till morning. I put my black kit in to be fumigated this morning. I wont see it again now till I reach Sydney. I still have my sea kit holding all I want from now on. We have been sailing quite close in to land since early morning and this evening we can see the trees and bush fires along the coast quite plain. It as been a real good trip since we left Fremantle but Im glad its over and I have great hopes that I will be in Sydney inside another 48 hours.\n\n\n\n\n\nMidnight\n\nThe troops are going some now. They have been at the cargo of whisky again and for the lastfew hours there as been some brawls, and down here in the hospital deck as been as bad as anywhere. There as been three and four fights going at once between theberths and tables and some of the boys are cut about some. They will look nice going ashore tomorrow. Six officers came down here to quiten things down and everything is pretty good now. The ships fourth officer has caught two soldiers in the whisky hold, he locked them in as they would'nt come up so they have put a armed guard over them.I'm going to get some sleep now.\n\n\n","117":"\n\nWhen I went up on deck this morning I saw we were anchored just inside the heads between the Nestor and Karoola. We started to steam for the wharf about five minutes after the Karoola leaving the Nestor which was quarentened there. The Somail is quarentened at Albany or Adeliade so we are first here after all. It was about three hours steam from the heads to the wharf and very soon after tying up we were disembarked and on the train for Sydney. All of us hospital class were told to go to the other side of\n\nthe ship as we would all go off together. We waited there for awhile and then got restless and asked one of the officers when the N.S.W. troops were going off. He said all the A class had gone off but he did'nt kow anything about us.\n\nThree of us would'nt wait any longer to find out what they were going to do with us and why we should be kept there, so we made our way off and got on board the train, soon after about a dozen more followed us so about half our number was still on the ship.\n\nwhen our train started. Those who have missed the train will be in a nice mess as this is the only troop train.\n\nWe are nearing Albury now and we will be changing over there. The people have been giving us a great time all along the line and we have done hardly anything else but eat cakes and fruit. We are traveling in first class carriages. It is a treat to be off the ship and going at this pace. The Qlands troops were to be transfered to the Karoola which is supposed to be going straight to Brisbane.\n\n\n\nWe changed over at Albury about midnight and we are traveling in a hospital train with beds in it. I laid down but I could'nt sleep, and this morning the first station we stopped at was Goulbourn. Later we stopped at Moss Vale and was given breakfast.\n\nIt as been a great trip in the train and now in a hour or so we will be in Sydney. One can hardly beleive it now but I guess I will soon know where I am soon after the train pulls in.\n","118":"\n\nHad a great welcome when train arrived in Sydney and was taken to the Anzac Buffet in the Domain. From there I was allowed to go home\nand\n but had to report at Randwick hospital at 9.30 next day to be examined by Doctors to see if I was fit for leave. I passed the doctors and was given leave till the 10th of next month. Then I have to report to the","119":" A.A. Hospital at Gordon Heights, Mosmans for further treatment.\n\nI was ennoculated against enfluenza before leaving Randwick. Issued with tram and train pass.\n","120":"\n\nI have had ten good days leave at home and this morning I reported here at Gordon Heights with my kit. I have'nt seen a doctor here today but I have been put in a big Con. ward and will see him tomorrow morning. This seems a nice place and everything is very clean and the food good.\n","121":"\n\nI saw the doctor this morning, my leg as healed up and it looks fairly well around the wound. He said he did'nt think I wanted any treatment but just to rest it all\n\n\n\nI could and he would see me again in a weeks time but if the wound broke out in between that I was to report to him. He said I would be boarded for my discharge from the A.I.F. in a few days time. If the board did'nt discharge me he told me to put in for 14 days leave and he would give it to me. It seems very easy to get leave here.\n\n\n","122":"\n\nI was boarded today before 2 doctors for my discharge and I was hopeing I would get it but they said I would have to be boarded again in another month for my discharge as I was only just back from overseas. Things are really good here and it is a good home and one gets leave every day from 2 pm till 11 pm and week end leave can be had from 10 am Frid. till 11 pm Mon. I am going to put in for 14 days leave.\n","123":"\n\nI am on leave now at home at Wentworthville, my leave ends on the","124":" of next month.\n\nMy leg is quite healed but the skin is very tender and red. The bone is still very sore at times and the leg is still very far from being strong although since arriving in Aust. I have given up useing the walking stick.\n","125":"\n\nThough I am looking fairly well and going about as if I was well I am very far from it and noone guesses the pain and trouble the leg gives me.\n\n\n","126":"\n\nI reported back here to Hospital this morning. I went up before the doctor and although my leg was'nt looking quite so well he put me on no treatment. I beleive myself by the feel of it and the looks that it is not going to stay healed up like it is and the leg seems weaker than it used to be. I am very anxious for my discharge this month.\n\n\n","127":"\n\nThe leg is not improveing at all I think it looks worse. The doctor saw it again a few days ago and just said carry on. Seeing I have been here so long now and having no treatment I seem certain I will get my discharge on or about the","128":" and the doctor as good as said so too.\n","129":"\n\nI was before the doctor again this morning and what he said as quite puzzled me. He looked up all\n\n\n\nmy medical papers and examined my leg, and said it did'nt look too well and as if it would break out again soon. He said he would like to see it X rayed and he thought I had better have some time in Bed with it.\n\nHe said he would see how I got on at my board as I would be boarded again for my discharge in a day or so. If they dont discharge me and refer me back for further treatment he would send me to Randwick to have my leg X rayed. That means\n\n\n\nthat if my leg shows anything I will have to undergo another operateion.\n\nI am hopeing against hope that I will get my discharge this time but I seem more doubtfull about geting it now after this morning and it seems as if I do get it it wont be long before I will be laid up for further treatment but I dont mind that. All I want is my discharge when I boarded and if there's anything I can do to get it I will do it for I will be very disappointed now after expecting it all along.\n\n\n","130":"\n\nI was boarded at 10 am this morning. There was 2 doctors on the board, the first one looked at my leg and then looked across to the other one and said that things did'nt look too good. He asked me how it felt and a few other questions and then said to the other doctor that he would like to see it X rayed and he said yes that it did'nt look to nice.\n\nI could see by the way they were talking that they did'nt entend to discharge me so I told them the leg had been like that for months\n\nand as I was here for 6 weeks without any treatment I did'nt think any more could be done for me so I did'nt see what good it was to keep me here if the leg was always going to be the same.\n\nThe head doctor then said, you want your discharge and I said yes. He looked across to the other one and they both thought for awhile and then said no I could'nt have it, they could'nt let me go with a leg like that for if they did and I went out and began to work\n\n\n\nit would break out and perhaps get a ulcer there and my leg be very bad for life. I could'nt say anthing then although it was a great disappointment. He said I would be called up again in a month.\n\nI suppose I will see the hospital doctor now in a few more days and he will send me to Randwick for the X ray of the leg. \n\nI'm very disappointed and almost mad over things.I had arranged such a lot of things thinking I was going to get my discharge now everything goes smash.\n\n\n","131":"\n\nWent to the dressing room this morning as the leg had broken out afresh. The Sister got the doctor to see it and he told herto clean it up and get it ready for a operateion which he would do with local anesethicts at 11 o clock.\n\nI had it done and they were able to remove two small peices of dead bone.\n\nThe leg is very painful and weak again now although I can walk about fairly well.\n\n\n","132":"\n\nWhile I was geting my leg dressed this morning the Sister in charge had a search around in the wound with a probe to see if she couldfeel any more loose bone. None was found but she found out that she was able to push the probethrough the hole in the bone. It was a big surprise and disapointment to me for I have thought for months that the bone had grown up and was all solid again. The doctors must have had their doubts about it when they would'nt discharge me although other doctors have often told me the bone was OK but now I know different worst luck.\n\n\n","133":"\n\nThis morning the sister noticed that my leg was trying to beak out right at the top of the old operateion\nmark\n scar which was done at the first operateion. She probed around till she got the probe in through the skin and then down to the bone where she felt a small peice.\n\nShe sent for the doctor who said he would operate on it there like he did the other place before. He cut it open about a inch and down to the bone about two inches higher up than the other cut and got a fair size peice of loose\n\n\n\nbone out. These small local operateions are not very plesant and keeps the leg very sore for a day or so. I have to go there every morning now to have the cuts opened out so as they wont heal.\n","134":"\n\nAnother very small peice of loose bone felt in the wound this morning.\n","135":"\n\nThe leg as healed up well and looking A1. It has healed up with the small peice of bone inside. It may not be big enough to do any damage.\n","136":"\n\nLeg looking very good and feeling strong. All I have been haveing done lately is geting it painted with iodine.\n\n\n","137":"\n\nA small rash as broken out around the wound. Have been put on dressings again.\n","138":"\n\nLeg looking and feeling splendid having no dressings again now.\n","139":"\n\nRash broke out around wound.\n","140":"\n\nRash healed up and leg looking well.\n","141":"\n\nWound broken open afresh and very painful at times, mostly at night. Sleep very little.\n","142":"\n\nLeg very bad and dischargeing freely.\n","143":"\n\nWas examined by the doctor this morning who said I was unfit for my discharge. The wound as healed up and looking well again.\n\n\n\n\n","144":"\n\nJust 12 months since I was wounded. Had a small peice of dead bone taken out of wound this morning. Wound open.\n","145":"\nWound healed and looking well.\n\n\n","146":" months later\n\nThe wound as been breaking out and healing up continualy.\n","147":"\n\nBoarded and discharged from the A.I.F. medicaly unfit with a","148":" pension and my leg is no better now than it was 12 months ago and will begin to discharge in a few days.\n\nMr W. Patchitt\nSouthfields\nSaffroun Rd\nEastbourne.\nEng.\n\n\n\n\n\n\n\n\n\n"}}