{"Document Name":{"0":"Diary_0052","1":"Diary_0052","2":"Diary_0052","3":"Diary_0052","4":"Diary_0052","5":"Diary_0052","6":"Diary_0052","7":"Diary_0052","8":"Diary_0052","9":"Diary_0052","10":"Diary_0052","11":"Diary_0052","12":"Diary_0052","13":"Diary_0052","14":"Diary_0052","15":"Diary_0052","16":"Diary_0052","17":"Diary_0052","18":"Diary_0052","19":"Diary_0052","20":"Diary_0052","21":"Diary_0052","22":"Diary_0052","23":"Diary_0052","24":"Diary_0052","25":"Diary_0052","26":"Diary_0052","27":"Diary_0052","28":"Diary_0052","29":"Diary_0052","30":"Diary_0052","31":"Diary_0052","32":"Diary_0052","33":"Diary_0052","34":"Diary_0052","35":"Diary_0052","36":"Diary_0052","37":"Diary_0052","38":"Diary_0052","39":"Diary_0052","40":"Diary_0052","41":"Diary_0052","42":"Diary_0052","43":"Diary_0052","44":"Diary_0052","45":"Diary_0052","46":"Diary_0052","47":"Diary_0052","48":"Diary_0052","49":"Diary_0052","50":"Diary_0052","51":"Diary_0052","52":"Diary_0052","53":"Diary_0052","54":"Diary_0052","55":"Diary_0052","56":"Diary_0052","57":"Diary_0052","58":"Diary_0052","59":"Diary_0052","60":"Diary_0052","61":"Diary_0052","62":"Diary_0052","63":"Diary_0052","64":"Diary_0052","65":"Diary_0052","66":"Diary_0052","67":"Diary_0052","68":"Diary_0052","69":"Diary_0052","70":"Diary_0052","71":"Diary_0052","72":"Diary_0052","73":"Diary_0052","74":"Diary_0052","75":"Diary_0052","76":"Diary_0052","77":"Diary_0052","78":"Diary_0052","79":"Diary_0052","80":"Diary_0052","81":"Diary_0052","82":"Diary_0052","83":"Diary_0052","84":"Diary_0052","85":"Diary_0052","86":"Diary_0052","87":"Diary_0052","88":"Diary_0052","89":"Diary_0052","90":"Diary_0052","91":"Diary_0052","92":"Diary_0052","93":"Diary_0052","94":"Diary_0052","95":"Diary_0052","96":"Diary_0052","97":"Diary_0052","98":"Diary_0052","99":"Diary_0052","100":"Diary_0052","101":"Diary_0052","102":"Diary_0052","103":"Diary_0052","104":"Diary_0052","105":"Diary_0052","106":"Diary_0052","107":"Diary_0052","108":"Diary_0052","109":"Diary_0052","110":"Diary_0052","111":"Diary_0052","112":"Diary_0052","113":"Diary_0052","114":"Diary_0052","115":"Diary_0052","116":"Diary_0052","117":"Diary_0052","118":"Diary_0052","119":"Diary_0052","120":"Diary_0052"},"Date":{"0":"unknown","1":535.0,"2":536.0,"3":537.0,"4":538.0,"5":539.0,"6":543.0,"7":544.0,"8":551.0,"9":562.0,"10":567.0,"11":568.0,"12":569.0,"13":575.0,"14":576.0,"15":577.0,"16":585.0,"17":588.0,"18":589.0,"19":590.0,"20":599.0,"21":602.0,"22":609.0,"23":610.0,"24":612.0,"25":613.0,"26":616.0,"27":617.0,"28":618.0,"29":619.0,"30":621.0,"31":622.0,"32":623.0,"33":624.0,"34":625.0,"35":629.0,"36":634.0,"37":646.0,"38":647.0,"39":651.0,"40":652.0,"41":653.0,"42":654.0,"43":655.0,"44":657.0,"45":658.0,"46":662.0,"47":663.0,"48":667.0,"49":668.0,"50":676.0,"51":679.0,"52":681.0,"53":685.0,"54":686.0,"55":688.0,"56":699.0,"57":700.0,"58":707.0,"59":708.0,"60":710.0,"61":711.0,"62":716.0,"63":718.0,"64":721.0,"65":722.0,"66":726.0,"67":729.0,"68":730.0,"69":731.0,"70":732.0,"71":733.0,"72":750.0,"73":759.0,"74":937.0,"75":938.0,"76":958.0,"77":962.0,"78":968.0,"79":969.0,"80":987.0,"81":990.0,"82":991.0,"83":992.0,"84":1015.0,"85":1019.0,"86":1023.0,"87":1024.0,"88":1025.0,"89":1027.0,"90":1029.0,"91":1031.0,"92":1033.0,"93":1034.0,"94":1037.0,"95":1038.0,"96":1040.0,"97":1041.0,"98":1042.0,"99":1043.0,"100":1044.0,"101":1046.0,"102":1083.0,"103":1093.0,"104":1094.0,"105":1101.0,"106":1114.0,"107":1127.0,"108":1150.0,"109":1201.0,"110":1212.0,"111":1215.0,"112":1250.0,"113":1252.0,"114":1253.0,"115":1254.0,"116":1271.0,"117":1362.0,"118":1390.0,"119":1392.0,"120":1393.0},"Entry":{"0":"\n\nLeft Holsworthy on ","1":" by motorcar for Sydney at 6 am arrived at Central Railway at 10.30, marched from there to No 2 wharf, Woolloomooloo and went aboard Troop Ship S.S. Suevic at 11.35 same date.\n\nBusy loading stores on","2":"\n","3":" Ditto\n\nRegiment arrives at No 2 Wharf at 10.30,","4":" Run 500 Horses aboard in half hour time. Everything clear and Captain swings his ship out into the stream and anchor by one o’clock. Cheering crowds remain on the wharf with broken ribbons.\n\nTroop ship heads out to sea at 3 pm","5":" June, followed by cheering crowds in small boats. At 6 pm we are pretty well out of Sydney Heads and we see nor hear no more of Sydney people. Sick people everywhere on board now.\n\nWe arrive at Adelaide on","6":" . We run all horses ashore and took them out 18 miles from Adelaide, turned them loose in paddock, then we returned all hands except guards Secured leave and proceeded to Adelaide.\n\nWe set sail from Outer Harbour at 3 am on the","7":" all went well till the","8":" ,\n\nwhen we experienced a very rough night aboard. This was crossing the Australian Bite. One of the ship’s crew poisoned himself and was buried at sea, the only death we had.\n\nOn the","9":" we crossed the Equator, the occasion was cellebrated in good style, everyone was ducked with out respect to persons. Our Commanding Officer received several duckings. A very amusing concert followed that night.\n\nOn the","10":" we sighted land at Aden, great rough dry hills. As we drew closer the worse they\n\nlooked and the climate become more suffucating. Our ship swung into the Harbour and anchored. Niggers soon swarmed around the boat trying to sell their inferior goods, however it was not long till roumers were flying to the effect that we were going to disembark and go into action. It was quite true that the Turks made an attack on Aden a few days previous but failed.\n\nIn the forenoon on the","11":" we received an address from Col Abbot concerning the Turkish position then 9 miles off Aden. A village 15 miles off was raging on fire. A number of Tommy\n\nan Indians were in the Hospital in Aden suffering from sun stroke which they received while going to the assistance of the burning village.\n\nWe did on this day and place receive our first issue of ammunition. We were then prepared for action. Lighters drew up along side our boat and we went ashore. We joined the","12":" Regiment in the village of Aden and both regiments proceeded on a route march. The sun was terrific, we carried towels for spine protection. However we all returned safely on board. The fortification of Aden is splendid.\n\nat 3 am on the","13":" we again set sail and at daylight we were full steam ahead in the Red Sea, the climate was very hot. We passed some very historic islands.\n\nOn the","14":" we pulled into Fort Suez where we hastened ashore. Pulled every thing belong to us off the Troop Ship transferred to a train which was waiting. Everything seemed strange about the train to me. Driver and Guards were black, however it wasent long till they got their train going at full speed. We left the Suevic and that is the last I saw of it.\n\nWe had a good trip to Heliopolis. Plenty of fresh scenery all the way. We arrived in camp at","15":" Oasis at 7.30, there we heard some great tales from the old hands. Egyptian money was then introduced to us.\n\nOn the","16":" our Brigade was inspected by General Maxwell.\n\nOn the","17":" I secured leave and proceeded to Cairo where I witnessed a very severe riot in which the Australians were complicaty it resulted that a fire was set raging in the town.\n\nOn the","18":" Cairo was declared out of bounds for all Australian Troops.\n\nOn the","19":" a riot started in Heliopolis. The result that Heliopolis is also placed out of bounds.\n\nOn the","20":" our Squadron left Oasis to guard Turkish prisoners at Maitta.\n\nOn the","21":" the Arabs completed a long fast and were feasting all day.\n\nOn the","22":" we returned from Mardia to Heliopolis. We had a good\n\ntime guarding the prisoners.\n\nOn the","23":" we commenced to prepare for the front, received Infantary kit on","24":" .\n\nOn the","25":" we left for the Peninsular. We were addressed by our Brigadier, (Col Brown) who declared that the Boys was then broken up and he was sorry to say he would be no longer our Commander.\n\nWe had to march with heavy kits four miles to the railway station, an Infantary Band headed the columns which was very difficult to march to, us being Light Horsemen.\n\nWe boarded the Marquett at Alexandria at 4 pm and set sail at 10 pm and proceeded through the Mediterranean Sea. We were obliged to sleep with life belts owing to German submarines been in the vicinity. (The Marquett was sunk on its following trip.)\n\nOn the","26":" we arrived at Lemnos this was a magnificent harbour, it was swarmed with Gun Boats and Troop Ships and surrounded by Greek Villages.\n\nOn the","27":" we arrived at Anzac. It was only then that I began to realise that I was a soldier.\n\nBullets were droping here and there in the water and shells were screaching over head, big black hills were in front of us and the sound of cracking rifles and bombs and shells bursting came ringing down the valleys. Now and again a rocket would fly up from a ridge and float in the air, followed by an out burst of rifle fire. By 3.40 we were all safely ashore and marched to Rest Gully for a rest.\n\nAt day break a terrific artillery duel commenced between the Turks and a New Zealand battery. The New Zealand battery was situated on Suvla Bay,\n\nabout a half mile on our left, the bombardment continued till 3.30 pm. It is believed that we suffered a trifle the most.\n\nMany curious incidents took place during our stay in Rest Gully. At 9 am a dispatch rider undertook to cross a space of land which was deadly ranged onto by Turkish machine guns. He succeeded in his undertakings, he put up a brave race.\n\nSnipers were also deadly in certain spots. A Turk was shot a few days previous to our arrival in his snipers post. I saw his boddy crouched in a crevice of a very high cliff. He had a number of officers\n\nand men to his credit before he was discovered.\n\nLate in the afternoon we lined up and was addressed by our Commanding Officer who stated that the Rif had to be broken up as well as the Brigade (another bit of bad luck). After his speach each Squadron went in a different direction. B Squadron set out for the 7th L.H. it was a very trying march. We were carrying heavy packs and were exposed to shell fire all the way.\n\nAt sunset we arrived at the","28":" L.H. Headquarters. There we drew the favourite rations bully beef and biscuits. At 9.30 the news came to our trench that our Sqdn\n\nLeader was shot, too true he was. He passed on a stretcher with some more wounded to the Medical Dugout. At 4 am next morning we got orders to stand to arms.\n\nOn the","29":" we relieved a Battalion of Infantry in Lone Pine a position which was captured from the Turks a fortnight previous. A counter attack from the Turks was expected. While passing through a tunnel a Turkish shell lobed on the surface busted the tunnel covering Some of the fellows in the tail end of the Squadron and also killing three other men of another Squadron.\n\nThe trenches were very narrow\n\nand a terrible smell of dead came from them, here and there was warning boards written in big letters \"Silence\", we were then with in a few yards of the Turks and where ever they heard the most talking they would throw the most bombs. \n\nMyself and tent mate was placed on guard in a tunnel which run into a portion of the Turks trench. An hour on guard an four off. About 7 pm the same evening the Turks gave a demonstration. I was in the tunnel when it started, this was my first time under heavy fire. We were well prepared and nothing came of the Demo.\n\nOn the","30":" we were relieved from Lone Pine and returned to","31":" L.H. Headquarters where we rested.\n\nOn the","32":" we went back to Lone Pine this time with not so many men. The flys and other vermin were just as bad. I was placed on duty in No 8 possi and was introduced to a periscope-rifle and an ordinary periscope also. They both were very interesting. I could see how close the Turks were and could fire at them with a certain amount of safety from rifle fire.\n\nThe Turks were keen shots and very often broke our periscopes.\n\nLate in the afternoon I \n\nnoticed a Turkish mule train passing over a hill in the distance, our artillery immediately opened fire on them and inflicted heavy losses on them before they could escape.\n\nOn the","33":" I was warned for fatigue, myself and some other chaps were taken to a trench which was very shallow and told to deepen it. We were cautioned not to talk. I thought it was strange, because if the enemy could hear us digging. I tried to sink the pick with out making a noise, this was\n\nimpossible, so I decided to take pot luck and stick into it. About a foot under the surface was the body of a Turk. While we were trying to root him out a Turkish bomb came tumbling into the trench. A fellow who was standing by with a blanket threw it on the bomb and hollowed out \"Imshi\" , and we did Imshi as quick as possible, an officer told us not to go back to our job.\n\nOn the","34":" we were again relieved and returned to Headquarters for another rest.\n\nOn the","35":" we moved to Hollys\n\nSpur, there we found good trenches and altogether a better position.\n\nOn the","36":" the Turks shelled our position very heavy with very large shells, killing a number of our men.\n\nOn the","37":" the Turks endeavoured to blow up our gap but made a blunder and blew up their own.\n\nOn the","38":" a Turkish aeroplane came flying overhead and started to drop bombs on our position but could not find their mark and lobed them in the sea.\n\nOn","39":" the Turks built\n\na barb wire entanglement 25 yards in front of our trench. It was done by night and they were not seen nor heard by our observers.\n\nOn the","40":" the first lot of reinforcements to the","41":" L.H. arrived.\n\nOn the","42":" gun boats shell Links heavily killing a great many. On the","43":" the Turks shell Poppy valley. 13 of our men were wounded with one schrapnell shell.\n\nOn the","44":" we gave a demonstration the Turks thought we were going to attack, opened up with very heavy fire.\n\nOn the","45":" a Turk gives himself up as a prisoner. He ran from his trench to ours under his comrades fire. He tumbled into our trench, was calling out \"Allah, me finish fight\", he also kissed the officer on duty. \n\nOn the","46":" 12 of our men were wounded by schrapnell.\n\nOn the","47":" our gun boats and artillery shelled Beachy Bill terrificly, after the bombardment ceased Beachy Bill. Fired on the Beach.\n\nAt 4 am on the","48":" we gave\n\na demonstration the Turks sat tight and did not reply. A very heavy shelling from the Turks that afternoon.\n\nOn the","49":" our gun boats bombarded the Narrows heavly.\n\nOn the","50":" gun boats shelled at Turkish battery. The Turks replied bitterly.\n\nOn the","51":" we were relieved by infintary and came out to the Rest Camp (wrongly named).\n\nOn the","52":" we started a new bombing machine going, done good work with it.\n\nOn the","53":" we extended our firing line at Willson’s Lookout : a clever piece of work, and the Turks were completely out pointed. The Turkish bombs were deadly. We lost several men and two officers.\n\nOn the","54":" the Turks shelled our new position at Willson’s Lookout terrificly with 6 inch shells.\n\nOn the","55":" our gun boats shelled a large number of Turkist reinforcements and inflicted very heavy losses upon them.\n\nOn the","56":" an attack was expected at Chathams, therefore more men was called for to hold the position, so our Squadron went to the assistance.\n\nA terrific storm was raging also and continued on the","57":" . Scarcely any supplies were landed owing to rough waters on the beach. Wounded were detained in Field Hospitals also, and a great number of mules and other transports were put out of action as a result of Beachy Bill’s shells, they were romping in all day and night long.\n\nOn the","58":" we received orders not to fire a shot. We were to remain absolutely silent. Our artillery was silenced also, the cold weather at this time was unbearable.\n\nOn the","59":" about 3 am the Turks not understanding the silence on our part, sent out a large patrol to find out what we were doing. They bundled up out of their trench which was about 30 yards from ours.\n\nOur orders were to let as many as possible get up before firing on them, however they found out we\n\nwere still there to their sorrow, some got back to their trenches safe & some got back wounded & some lie their ever more. At daylight it was bitter cold and snowing & the dead boddys in front of our trench were partly covered.\n\nOn the","60":" the doctor wanted to examine the boddy of two Turks which were close to our trench for some reason. We pulled them in by means of grappling irons. After the examination they were buried almost side by side with our fellows.\n\nThey were a pitiful sight.\n\nOn the","61":" the Turks shelled Lone Pine trenches severly both with scrapnell and high explosives.\n\nThere were 190 casualties as a result of the enormous shells, the weather was still cold, the water pipes became frozen, leaving them useless. We had a very severe task carrying water by night about the hills on mules backs and under shell fire as well.\n\nOn the","62":" another great bombardment took place at Cape Ellis.\n\nOn the","63":" Turkish aeroplanes\n\nagain drop bombs but were unsuccessful, also a submarine alarm was given on the harbour.\n\nOn the","64":" the Turkish plane reappeared and this time droped darts.\n\nOn the","65":" our gun boats shelled Ollive Grove tremendously. Put several of the Turks guns out of action. Beachy Bill was also silenced.\n\nOn the","66":" we started to prepare the tracks leading to the beach so there would be no mistakes in the evacuation,\n\nwhite stones were placed as guides. We did not use the good tracks which lead out of our trenches as they were set as traps for the enemy, all the good clear foot pads lead into a tunell which was mined, we also destroyed anything that could not be carried away. We chopped up dozens of pairs of boots, burnt blankets, buried ammunition, blew up guns, destroyed limbers and knocked the bottom out of dozens of rum jars.\n\nOn the","67":" our line was very\n\nweak as far as men were concerned, but we had more machine guns. The Doctor also made a througher examination, any man who was a little weak was sent to the beach. At 9 am we ceased fire and remained silent for a half an hour, but on account of the Turks getting bit before, they thought we were only trying to get them again & did not bother this time about us.\n\nOn the","68":" it was my turn to leave. I was warned at 2 pm to be ready to leave at 6 pm. I was also warmed to have\n\nmy feet wrapped in a piece of blanket and on no account to have tin cans rattling and not to say good by or shake hands with the chaps which were left till last. We were to walk off as if we were going for supplies. The trenches were very narrow, we stood one behind the other with packs up and feet padded, at 10 minutes to 6 pm an officer was in the lead and as we passed out of the communication trench a Major checked each man’s name, No,\n\nwe passed down the gully known as Poppy Valley, a spot which could be observed by the enemy and which they shelled so often, but it was dark when we passed and we could not be seen. We passed through a very narrow tunnel which run out to","69":" L.H. Headquarters where we had to report before leaving for the beach. We got there safely, so far so good, from there we could, although it was dark, see thousands of men in little columns with their packs\n\nup scrambling about the hills making for the beach.\n\nGeneral Ryrie was addressing us when an enormous shell from a Turkish gun boat in the Narrows, came roaring through the air, it landed on the top of a very high hill about a quarter of a mile away, it lifted tons of earth in the air, in about 10 minutes time she sent another one but I could not see where it landed, however after the address we set of for the beach. We joined on to another long string of men which\n\nwas a mile long, we were then at Beachy Bills mercy, but he did not know it. We were walking over ground which were torn up by his shells the day previous.\n\nSentrys were placed every where planted in bushes etc watching carefully for spies. We were afraid of spies signalling to Beachy, if there was any spies they were afraid to work.\n\nI was expecting to hear Beachy every minute. She never spoke till we were about half way when she commenced to fire, but luckily the shells went screeching over \n\nhead to Suvla Bay.\n\nThere was no talking amongst the men every body was silent, an aeroplane came humming over head, at first we thought it was an enemy plane, lucky it was one of our own which was carefully watching the Turks movements behind the hills. She was also directing the fire of our gun boats. \n\nMy pack was very heavy but I managed to plough along with it. There were medical men carrying stretchers so as to do the best they could for the wounded or sick.\n\nI passed lots of chaps who\n\npleaded they were unable to carry their packs. However amidst all this excitement we arrived at Watsons Pier, where we packed into a deep valley and waited our turn to embark. I got aboard safely & spent the happiest night of my life on the boat called the Abbersia. It anchored in the Harbour till 3 pm the following morning, it was the first time for four months that I was allowed to take my boots as no amenities off at that time of night and what was\n\nbetter still I was able to look back onto the shell torn hills and see the flash of the Turks bombs & hear the cracks with safety.\n\nOn the","70":" we landed at Lemnos at 5.30 am, the harbour was a magnificent sight, filled with ships packed with troops, many rumours were flying around as to where we were bound for next. We transferred boat to boat till at last we found ourselves in a beautiful ship, namely the Beltana\n\nThe Beltana was anchored close by another great ship called Megantic. These two ships stood side by side all day, myself and two or three comrades went aboard the Megantic and reviewed the ship in general, by this time we were very hungry and we gave some of the crew a badge off our coat for a bit of bread & butter, one of the crew then showed us the cabin which the murderer, Crippen, had occupied at the time he was captured. \n\nOn the morning of the","71":" we set sail out of the\n\nharbour. We did not know where we were making for till we got clear of the harbour then we knew we were making back to Egypt.\n\nWe received orders to keep our life belts on always and only half of the two thousand were allowed to go down deck to their meals at once. Ship was very much afraid of submarines, therefore she zigzagged the track to Alexandria. We arrived at Alex on Christmas Eve & spent Xmas Day on the harbour. I will not forget the Plum Duff, it was very solid but good.\n\nWe disembarked at 10.30 pm on Christmas Night & jumped a train which conveyed us to Heliopolis where we arrived at 3.30 am Boxing Morning. We had a splendid rest that day & then left for Maadi & were again attached to","72":" L.H. & spent a most enjoyable time during my stay at Maadi.\n\nAfter two months stay at Maadi we again shifted to Heliopolis where the","73":" Regiment was reformed. Later on we drew one hundred horses from the remounts and from then on we\n\nwere continuously training at mounted work until half of our Regiment were ordered to do picquet duty in Cairo I will never forget my experiences on Picquet duty..\n\nWhile we were in Cairo the other half of the Regiment removed to Tel-el-Kebir, later on we were relieved and joined them again at Tel-el-Kebir where we received orders to draw the rest of our horses, a number of us packed our sadles on the train and proceeded to a remount depot at Zagazig.\n\nWe were disappointed to come back without a horse. However on returning to camp we were addressed by the Colonel who told us not to be down hearted that he would try again.\n\nFrom Tel-el-Kebir we removed to Duedar a place which has been attacked by the Turks a few days previous. Later on we were relieved from there and came to Kantara where we received the remainder of our horses, we also lost our C.O. here.\n\nWe left Kantara on the","74":" to occupy a position on the first line of defence, east of Canal\n\n& bivoaced the first night at El-Fefar and 11 am the following morning we relieved the","75":" L.H. at Gabelhebita.\n\nOn the 26 I was sent out on patrol about seven miles and we did not sight the enemy but still we knew for a certainty they were in the vicinity.\n\nOn the","76":" a fishing party returned from a large lake in the desert with half ton of fish. They were cooked and went very well, except one Squadron’s fish which was badly cooked, and was uneatable, a complaint\n\nwas made to the orderly officer about the fish with their scales and heads on. The cook was placed in the Guard Room and afterwards was given 14 days","77":" field punishment for his bad cooking.\n\nOn the","78":" I was again sent on patrol & still sighted no Turks. This time we went further out. I rode up on a very high sand hill, on the top of it I noticed a bottle which was closed at the neck. On picking it up I found a piece of paper in it with the following statement on it\n\nThurlow A.\n\nCrowhurst\n\nGavin\n\nIf found by person or persons, please communicate with","79":" L.H.\n\nI died with thirst\n\nBottle to prove it.\n\nB. Squadron left Gabelhelid on the","80":" and that night Bivoced at Seerifs Post, and the next morning set out in the desert, that we camped at some old wells. We left wells next morning and marched further out in the desert arrived at an oasis\n\nwhich was packed with dates. We camped there till the following day when we again proceeded further in the desert and at 10.30 am arrived at two very ancient wells which had previously been used by the Bedouins.\n\nOn the","81":" we commenced sinking more wells.\n\nOn the","82":" I was sent on camel escort and on the","83":" returned to well diging.\n\nAt 7 pm on the","84":" we were warned to be prepared to move out of camp at 3 am on the following morning to go on search for some Bedouins which was sighted during the day. We returned without the Bedouins.\n\nOn the","85":" General Dallas made an inspection of all the camp on this route.\n\nOn the","86":" I went out on camel escort to one of our positions called Hageber as I returning on the","87":" I came across a man’s skull. There were a few hairs still on it\n\n& it was lying just above the surface, the remainder of the body about a foot below, there were also some Turkish cartridge cases not far from the spot. I am keeping one case as a souvenir. I swung the skull to my saddle & brought it into camp for investigation.\n\nOn the","88":" some splendid news came throw by heliograph from our Headquarters stating that the Turks had been cut off from their main base & was left with out supplys.\n\nOn the","89":" we got a roumour that out Regiment would be reverted to a Camel Regt.\n\nOn the","90":" I was one of the escort of the Supply Camel Train & on our return we brought back 40 captured camels, mostly cows & calves.\n\nOn the","91":" 19 men including myself were warned to be prepared to move out on a stunt at any moment. Turks are in the vicinity & are supposed to be in distress. A number of Light Horse will endeavour to capture them.\n\nOn the","92":" we left Jaffier & arrived at Hageber that night. A great number of mounted troops camped with\n\nus, including English Yeomanry & Camel Corps.\n\n On the","93":" things looked very war like, there were troops everywhere. We left Hageber at 8 am & arrived at another advanced post of our called Bayud at 3.30 pm.\n\nOther troops & Camel Convoys were stringing into this camp all the afternoon & up till 10 oclock that night. In the morning we had a very large camp. This post a few months ago belonged to the Turks, there is a splendid water supply here, some of the wells were sunk by the Turks & some by us. The wells occupy about three\n\nacres of ground & are fenced in with barbed wire.\n\nInside this yard is the busiest spot I ever saw in my life, it is cramed with pumps & men. The men are of many different nationalities & lots of different languages are spoken.\n\nOutside the yard were thousands of phantussips full of water ready for the camel convoys. At Rise Pitt our Regiment moved out of camp. Our Regiment formed up on top of sand ridge & all the other Regiments did the same so that there were a great mass of mounted troops\n\na sight I will never forget. The moon was about to rise when we got the order to move off, we were cautioned to be as silent as possible & not to smoke. We had some very awkward country to cross & the pace was very slow, however about midnight the great long column commenced to mass again. About 2 pm we were ready to feed.\n\nWe saddled up again at 4 oclock. At daylight the camel convoy was still stringing into camp with supplys.\n\nWe rested here all day. Supplys were all very precious, especially water, it was as hard to get an\n\nissue of water that day as it was two years ago to get an issue of a horse in Australia. Our aeroplanes were carefully watching incase of tanks.\n\nAt 4 pm one of our own aeroplanes floated low over head & droped a message saying ‘all clear, enemy unaware, good luck’.\n\nAt 6 pm we received strict orders from our C.O. He told us we were then within 14 miles of the place which we were going to attack & that we would have to advance from there as silent as possible also that if any man was seen smoking he was liable to\n\n \n\npay a penalty of death.\n\nWe were all saddled at dark & ready to advance. My troop Sgt detailed me for bomb throwing. I had to leave my troop & join an English Regt I did nor know much about bomb throwing but I knew it was a risky job. We received a few instructions from an English Officer. At moon rise the great mass of mounted troops began the move out. As we passed the Supply Store & turned the corner, I sighted a lamp shining at the but of a low bushy tree , a little further on stood a Bedouin acting as\n\na guide. About seven miles along there were two Turkish outposts but it was uncertain whether they were occupied by night or not. However the main body was to endeavour to pass between the two unawares to the enemy. This was a difficult job. \n\nWe had to stop mules from braying & several other things which was hard.\n\nHowever the out post did not trouble us, the next thing I thought of was handing over horses to horse holders. Charging up this great rocky hill which I\n\nexpected to sight any minute, I was heavily loaded with ammunition, my rations & some bombs.\n\nI understood that the hill was well fortified & the Turks would probably have artillery. I also thought we were going to make the attack before day break. Therefore every hill I saw I thought was the one we were looking for & I expected a burst of fire from it.\n\nIt can be imagined how we felt when we found ourselves still creeping along a deep valley at\n\nday break & everything still silent.\n\nIt was Sunday morning, the","94":" & a very dence fog hung low. It was hard to see more than 50 yards, the fog certainly was in our favour.\n\nA squadron of Queenslanders hopped up from behind a hill & reported not much doing. We were then at a stand still for some time, I can not say what was going on during that time.\n\nAll of a sudden I heard a pop shot then another one & then a burst of machine gun fire & on she went. An officer came over the hill with Bedouin\n\n \n\nprisoners. Our officer told us bomb throwers that some of our troops were attacking & that we would have to stay in reserve until such time as our attacking party secured a position to cover our advance to close quarters with the Turks where we could make use of our bombs. We wheeled round from where we were & got under cover on the Battle Field. Just then our Regiment came racing across the field under fire. By this time the fog began to lift. I could see the Queenslanders galloping\n\nunderneath the fog in the distance, it looked splendid. \n\nBullets were lobbing everywhere which were coming from the great long rocky ranges in front. On the top of one very high rocky peak was a Turkish redoubt.\n\nRight at the toe of this peak was some very ancient wells, the first water we stuck for 30 miles & right at the back of the big range lyes a very old villages.\n\nHowever in spite of the machine guns which were in the redoubt we all got under cover & poured the lead into the Turkish trenches.\n\ntill at last firing seem to cease on both sides & all was quite for a while. Two of our aeroplanes were floating over head & droping a bomb occasionally and frequently droping messages fro the G.O.C.\n\nAbout 10 oclock an Indian battery mounted on camels came racing in onto the battle field, the smart Indians soon had their two guns set for action. They let the Turks have some terrific schrapnel, also bursted up a part of their trench & Turks were frequent jumping out of the broken trench\n\n& racing for sound ones, they had to run for life because our machine guns were playing on them.\n\nOur Red Cross Plant was lined up out of range but were prepared to come in if needed, the ambulance consisted of a long string of camels, each camel was arranged to carry two wounded men, only three camels were required on the field, they paraded in flying the Red Cross flag & brought out four wounded Turks. Many Turks were killed & they retired from a part of their positions.\n\nAbout 12.30 the news came\n\nround that all our troops were going to retire, it was a surprise to every one. We could have taken the redoubt easily, why we retired I don’t know.\n\nAbout one oclock we had the racing all over again but this time out of action instead of into it.\n\nWe retired back to a spot where the camels convoy droped the tanks of water, which was very badly needed. At 5.30 the horses got their first drink for the day, each horse was only allowed two small buckets. Out posts were placed all round the camp incase\n\nof the enemy attacking the camp.\n\nAt sunrise on the","95":" we moved out of camp & retired back to a place called Pazabass, & again camped for the night. We moved out again in the morning & arrived back to Bayud where we started from. We remained there all day on the","96":" .\n\nWe came to Magebra on the","97":" & left for Bada on the","98":" on our way to Bada a German Taub floated over head but did not interfere. We arrived at Elfedan \n\nfrom Bada on the","99":" and on the","100":" returned to Ferrys Post, where we are today after completing a 90 mile retreat.\n\nOn the","101":" General Sir Archibald Murray inspected the camp.\n\nOn the","102":" I went to Somailiar on leave. I spent a very good day . On returning to the Light Railway Station I was 10 minutes late to catch the train. I had no pass and could not send to my Regiment for a horse, so I put the night in at the station. I got a surprise when there was nothing said when I arrived home.\n\nOn the","103":" I volunteered for the Flying Corps. I packed my kit on a Sunday morning at Railhead Ferrys Post & proceeded to Kantura where we were met at the station with a big motor, on the","104":" we did nothing.\n\nFailed & returned to unit on the","105":" .\n\nSpent Xmas Day at Hagley Park.\n\nMilitary sports commenced at Railhead on Boxing Day. A football competition was completed Xmas week, it was won by B Squadron, the sports ended up on the","106":"\n\nCompetitors came from all Regiments. Horsemen from Australia, England & India. B. Squadron won the Pennant & the C.O. was presented the Champions Flag.\n\nThe boys of the","107":" seen the old year out in good style. On the morning of the New Year all tents were flat on the ground.\n\nThe wind began to blow at 9.30 & we experienced a rough day on New Year’s day. Clouds of sand were rising every where & beating in every hole & corner.\n\nToday is the","108":"\n\nStill at Railhead F. Post, everything been very quite since New Year. We have had many rough and windy days.\n\nAll troops have evacuated the Post except us, we are now the only Regiment at this Post.\n\nYesterday and today some very good news appeared in the Egyptian Mail as regards America and the war.\n\nToday is the","109":"\n\nWe are bivavaced at Romani, the place where a severe battle took place a few weeks ago, after which the Turks were compelled to retreat. Signs of the battle still remain here.\n\nAfter a long spell of doing nothing our Regiment is waking up again and has started on some important work and forms a part of the","110":" Brigade.\n\nSince the Brigade has been formed we have been doing some interesting marching each day\n\ncovering miles of strange desert country.\n\nToday is the","111":" The Brigade is situated at El Arish. We camped amongst fig trees, this morning is a beautiful sun shine morning and the surroundings are rather pleasant. Away in the distance we can hear the rumble of the guns.\n\nYesterday the German aeroplanes bombed our railways at Mayar. They damaged the line slightly also leaving a few casualties in a Tommy Regiment.\n\nThe same two planes payed\n\nEl Arish a visit also but our anti-aircraft guns got on to them immediately and they were compelled to retreat before doing damage.\n\nThe following places have been recently occupied by the Turks. The Brigade has passed each place en route for El Arish.\n\nHill 40\n\nGilbane\n\nPeluieum\n\nRomani\n\nRabah\n\nShirbah\n\nBur El Abu\n\nDalmana\n\nTil ril\n\nMayar\n\nMaadan\n\nBadaivel\n\nEl Arish\n\nA servere battle took place at Romani a few months ago. Many graves are dotted about the battle field.\n\nToday is the","112":"\n\nEl Arish has been passed also Raffa & various other places which the Turks have occupied. Our first week in Palestine was very busy, were preparing for an attack, which took palce on the","113":" On that day I was wounded, I was sent back to Egypt again & was taken in at","114":" A.G.H. where I am still.\n\nI left","115":" A.G.H. on the","116":" I spent a pleasant week at Hospital. On the last week\n\nhad a Red Cross trip to Maadi by boat down the Nile.\n\nDuring my stay in hospital I got news that I was reported killed.\n\nOn returning to my Regiment I was told that I was mentioned in dispatches.\n\nJust where we are situated now is a very dusty place and is visited every day with Taubs. We ofter come in contact with the Turks and we have casualtys occasionally.\n\nIt is a funny experience meeting people who think I am dead and buried.\n","117":"\n\nSince the last writing up of my diary I have had many shifts from one place to another. Our Brigade has had a short spell on the beach of the Mediterranean, during the spell were Brigade sports held.\n\nAt present we are in the Second line and today we took a hill for practice, although we had no one defending the hill the attack was carried out in the same way as a genuine go.\n\nA few days ago we were suddenly called out on a reconnaissance, a job which kept us in constant activity for more than two days.\n\nToday","118":"\n\nWe have been called out on many occasions since the","119":" I am now well acquainted with Waddi Guyyi, last Tuesday we were far out to the right of Ber thsheba. Turks were few and we return without casualtys.\n\nGerman Taubs have been very active the last few days but our anti-aircraft keep them well up and they do little damage. At present there is a Taub above and he is being fired on by four of our guns.\n","120":"\n\nA very dusty day and I am feeling not too well. We were paid this morning, the Pay Office been in Waddi Guyyi.\n\n"}}