{"Document Name":{"0":"Diary_0064","1":"Diary_0064","2":"Diary_0064","3":"Diary_0064","4":"Diary_0064","5":"Diary_0064","6":"Diary_0064","7":"Diary_0064","8":"Diary_0064","9":"Diary_0064","10":"Diary_0064","11":"Diary_0064","12":"Diary_0064","13":"Diary_0064","14":"Diary_0064","15":"Diary_0064","16":"Diary_0064","17":"Diary_0064","18":"Diary_0064","19":"Diary_0064","20":"Diary_0064","21":"Diary_0064","22":"Diary_0064","23":"Diary_0064","24":"Diary_0064","25":"Diary_0064","26":"Diary_0064","27":"Diary_0064","28":"Diary_0064","29":"Diary_0064","30":"Diary_0064","31":"Diary_0064","32":"Diary_0064","33":"Diary_0064","34":"Diary_0064","35":"Diary_0064","36":"Diary_0064","37":"Diary_0064","38":"Diary_0064","39":"Diary_0064","40":"Diary_0064","41":"Diary_0064","42":"Diary_0064","43":"Diary_0064","44":"Diary_0064","45":"Diary_0064","46":"Diary_0064","47":"Diary_0064","48":"Diary_0064","49":"Diary_0064","50":"Diary_0064","51":"Diary_0064","52":"Diary_0064","53":"Diary_0064","54":"Diary_0064","55":"Diary_0064","56":"Diary_0064","57":"Diary_0064","58":"Diary_0064","59":"Diary_0064","60":"Diary_0064","61":"Diary_0064","62":"Diary_0064","63":"Diary_0064","64":"Diary_0064","65":"Diary_0064","66":"Diary_0064","67":"Diary_0064","68":"Diary_0064","69":"Diary_0064","70":"Diary_0064","71":"Diary_0064","72":"Diary_0064","73":"Diary_0064","74":"Diary_0064","75":"Diary_0064","76":"Diary_0064","77":"Diary_0064","78":"Diary_0064","79":"Diary_0064","80":"Diary_0064","81":"Diary_0064","82":"Diary_0064","83":"Diary_0064","84":"Diary_0064","85":"Diary_0064","86":"Diary_0064","87":"Diary_0064","88":"Diary_0064","89":"Diary_0064","90":"Diary_0064","91":"Diary_0064","92":"Diary_0064","93":"Diary_0064","94":"Diary_0064","95":"Diary_0064","96":"Diary_0064","97":"Diary_0064","98":"Diary_0064","99":"Diary_0064","100":"Diary_0064","101":"Diary_0064","102":"Diary_0064","103":"Diary_0064","104":"Diary_0064","105":"Diary_0064","106":"Diary_0064","107":"Diary_0064","108":"Diary_0064","109":"Diary_0064","110":"Diary_0064","111":"Diary_0064","112":"Diary_0064","113":"Diary_0064","114":"Diary_0064","115":"Diary_0064","116":"Diary_0064","117":"Diary_0064","118":"Diary_0064","119":"Diary_0064","120":"Diary_0064","121":"Diary_0064","122":"Diary_0064","123":"Diary_0064","124":"Diary_0064","125":"Diary_0064","126":"Diary_0064","127":"Diary_0064","128":"Diary_0064","129":"Diary_0064","130":"Diary_0064","131":"Diary_0064","132":"Diary_0064","133":"Diary_0064","134":"Diary_0064","135":"Diary_0064","136":"Diary_0064","137":"Diary_0064","138":"Diary_0064","139":"Diary_0064","140":"Diary_0064","141":"Diary_0064","142":"Diary_0064","143":"Diary_0064","144":"Diary_0064","145":"Diary_0064","146":"Diary_0064","147":"Diary_0064","148":"Diary_0064","149":"Diary_0064","150":"Diary_0064","151":"Diary_0064","152":"Diary_0064","153":"Diary_0064","154":"Diary_0064","155":"Diary_0064","156":"Diary_0064","157":"Diary_0064","158":"Diary_0064","159":"Diary_0064","160":"Diary_0064","161":"Diary_0064","162":"Diary_0064","163":"Diary_0064","164":"Diary_0064","165":"Diary_0064","166":"Diary_0064","167":"Diary_0064","168":"Diary_0064","169":"Diary_0064","170":"Diary_0064","171":"Diary_0064","172":"Diary_0064","173":"Diary_0064","174":"Diary_0064","175":"Diary_0064"},"Date":{"0":"unknown","1":1411.0,"2":1412.0,"3":1413.0,"4":1414.0,"5":1415.0,"6":1416.0,"7":1417.0,"8":1418.0,"9":1419.0,"10":1420.0,"11":1421.0,"12":1422.0,"13":1423.0,"14":1424.0,"15":1425.0,"16":1426.0,"17":1427.0,"18":1428.0,"19":1429.0,"20":1430.0,"21":1431.0,"22":1432.0,"23":1433.0,"24":1434.0,"25":1435.0,"26":1436.0,"27":1437.0,"28":1438.0,"29":1439.0,"30":1440.0,"31":1441.0,"32":1442.0,"33":1443.0,"34":1444.0,"35":1445.0,"36":1446.0,"37":1447.0,"38":1448.0,"39":1449.0,"40":1450.0,"41":1451.0,"42":1452.0,"43":1453.0,"44":1454.0,"45":1455.0,"46":1456.0,"47":1457.0,"48":1458.0,"49":1459.0,"50":1460.0,"51":1461.0,"52":1462.0,"53":1463.0,"54":1464.0,"55":1465.0,"56":1466.0,"57":1467.0,"58":1468.0,"59":1469.0,"60":1470.0,"61":1471.0,"62":1472.0,"63":1473.0,"64":1474.0,"65":1475.0,"66":1476.0,"67":1477.0,"68":1478.0,"69":1479.0,"70":1480.0,"71":1481.0,"72":1482.0,"73":1483.0,"74":1484.0,"75":1485.0,"76":1486.0,"77":1487.0,"78":1488.0,"79":1489.0,"80":1490.0,"81":1491.0,"82":1492.0,"83":1493.0,"84":1494.0,"85":1495.0,"86":1496.0,"87":1497.0,"88":1498.0,"89":1499.0,"90":1500.0,"91":1501.0,"92":1502.0,"93":1503.0,"94":1504.0,"95":1505.0,"96":1506.0,"97":1507.0,"98":1508.0,"99":1509.0,"100":1510.0,"101":1511.0,"102":1512.0,"103":1513.0,"104":1514.0,"105":1515.0,"106":1516.0,"107":1517.0,"108":1518.0,"109":1519.0,"110":1520.0,"111":1521.0,"112":1522.0,"113":1523.0,"114":1524.0,"115":1525.0,"116":1526.0,"117":1527.0,"118":1528.0,"119":1529.0,"120":1530.0,"121":1531.0,"122":1532.0,"123":1533.0,"124":1534.0,"125":1535.0,"126":1536.0,"127":1537.0,"128":1538.0,"129":1539.0,"130":1540.0,"131":1541.0,"132":1542.0,"133":1543.0,"134":1544.0,"135":1545.0,"136":1546.0,"137":1550.0,"138":1551.0,"139":1552.0,"140":1553.0,"141":1554.0,"142":1555.0,"143":1556.0,"144":1557.0,"145":1558.0,"146":1559.0,"147":1560.0,"148":1561.0,"149":1562.0,"150":1563.0,"151":1564.0,"152":1565.0,"153":1566.0,"154":1567.0,"155":1568.0,"156":1569.0,"157":1570.0,"158":1571.0,"159":1572.0,"160":1573.0,"161":1574.0,"162":1575.0,"163":1576.0,"164":1577.0,"165":1578.0,"166":1579.0,"167":1580.0,"168":1581.0,"169":1582.0,"170":1583.0,"171":1584.0,"172":1585.0,"173":1586.0,"174":1587.0,"175":1588.0},"Entry":{"0":"\n\n1917\n\n","1":"\nLeft Fovant Camp from Southampton by train at 10 AM arr 12-30 AM. Embarked on Queen Alexander at 4-30 PM. 800 troops on board. Sailed at 6 PM reaching Le Havre at 12-0 AM. Disembarked at 7 AM 18th.\n","2":"\nMarched to Base Depot AIF. Harfleur Camp 7 miles from Le Havre. Medical inspection, & then equipped with rifle, P.H. & box respirator, & steel helmet.\n","3":"\n\nPut through tear gas test, fixing up equipmet etc, issued with 120 rounds s.a. amm. & warned for draft for front leaving tommorrow.\n\n\n\n\n\n\n\n1917 OCT.\n","4":"\nPut through Chlorine gas test at school 2 miles from camp.\n","5":"\nMorning put through shooting test at Mini Range. At 4-30 PM marched from camp with other troops to Le Havre & entrained from front at 9-0 PM in cattle trucks. 36 men in each truck.\n\nMon. Oct. 22nd\nOn our way to the front. Drafts from Cold-Stream guards, artillery & different Batts A.I.F. with us. Arrived at Hazebrouck at 4 PM travelling through St Pol and other towns. Country looks well & very interesting. Women working in the fields everywhere. Saw\n\n\n\n\n\n1917. OCT.\n\nan aerial battle, at distance, between allied & German planes. Marched to Morbecque Reinf. Camp, 3K.\n\nTues. Oct. 23rd\nLeft Camp at 8 AM & entrained at Hazebrouck to join our Batt. at 12-30 PM. At 4-30 arr Nellis Blecquin . Marched to Ledinghem village & attached to our Batt, who are billeted here. Attached to Hdqtrs of our Batt, our quarters are in the loft of a barn. Raining & mud & slush everywhere. Our Batt with the 33rd, 34th, 35th from the 9th Bde of the 3rd Div A.I.F. Bde has just come out of the trenches after very heavy fighting at Paschendale north of Ypres. The weather was very bad & the ground a bog. The 3rd Div attacked Paschendale\n\n1917. OCT.\n","6":" Con'td\nRidge on Friday morning 12th Oct. after other troops had unsuccessfully attacked it a few days before. After making a splendid advance & gaining the ridge, our men had to retire owing to lack of artillery support, (the state of the ground not allowing the guns to be brought up in support) & that the NZ Bde, on the left flank, were hung up owing to bog & wire not being cut, & who lost heavily after fighting raid. Our Batts all lost heavily, the 36th went into action over 600 strong & the casualties were 478 K & W. The Batt can now muster about 170 men. 11 out of 60 signallers came out unwounded. Bde now resting & awaiting reinforcements. All\n\n1917, OCT\n","7":"\nThe men are suffering from the cold & exposure. The Canadians relieved them in the line.\n","8":"\nDoing duty with A Coy as they are short of sigs. Raining. Route march in aft.\n","9":"\nOn duty A Coy. Raining. Mud & slush everywhere. March in aft.\n","10":"\nOn duty A Coy. Raining. Wrote home.\n","11":"\nOn duty A Coy. Weather fine. Medical inspection in afternoon.\n\n1917 OCT\n","12":"\nRaining. Attended mass in village church. Aft on duty A Coy.\n","13":"\nRaining. On duty A Coy. Big attack by Austro-Germans on Italians who are retiring. Enemy claim to have taken 100,000 prisoners & 700 guns. Canadians have captured Paschendale Ridge & are now fighting for the village.\n","14":"\nRaining & cold, on duty A Coy.\n","15":"\nOn duty A Coy in morning. Afternoon out in fields as beaters for the Col.in a bit of partridge shooting.\n\n\n\n\n\n\n\n1917 NOV.\n\nThur. \noct\n","16":"\nRaining & cold. On duty A Coy. Have heard we are to return to trenches in a few days.\n","17":"\nOn duty A Coy. Enemy now claims 180,000 prisoners & 1500 guns in attack on Italians. Gen Allenby has captured Beersheba, Palestine.\n","18":"\nRaining. On duty A Coy.\n","19":"\nAttended Mass in village church. Aft walked to Blequin with mate.\n","20":"\nOn field work with D 4 & Fullerphone. Aft inspection of feet by M.O.\n\n\n\n\n\n1917 NOV.\n","21":"\nRaining heavily. Route march cancelled.\n","22":"\nRaining. On field work.\n","23":"\nPacking up all our signalling equipment. Bde to move out tomorrow on way to trenches. H.A.C. taking over our billets.\n","24":"\nMarched from Ledinghem at 10 AM to where 35th Batt were billeted. Then by motor lorries through Foulkenburg , Harzebrouck & Vieux-Berquin to Neuf-Berquin arriving at 8 PM. Marched to Billets 3K.\n\n1917 NOV.\n","25":"\nBde resting. Raining. Now near front line. Heavy artillery fire day & night.\n","26":"\nResting in billets. Jac Clontan died yesterday. Air raid on Berquin by Gothas at 11 AM. Many bombs dropped. Our A A guns in action.\n","27":"\nBatt marched from Neuf Berquin at 10 AM through Steenwerks to Rossignol Camp, 4 miles from front line, arriving at 6 PM. Artillery fire very heavy up in line.\n\n1917 NOV.\n","28":"\nMarched from Camp at 4 PM for trenches carrying full equipment & blankets. Road very bad, & after leaving road floundered through mud & slush, shell holes etc in the dark for ½ a mile, walked the Communication trench which led to our position in the trenches, reaching them at about 8 PM wet & mud covered & tired. Our signal office is in a small dug-out under the ruins of what was once a convent but is now only a heap of broken bricks from shell fire. On duty 2 AM to 6 AM. We have taken over this sector from a British Div our Batt relieving the West Yorks Regt. We are now in\n\n1917 NOV.\n\nTues. Nov. 13th\nBelgium, having crossed the frontier at Romarin Camp 3M back. This is Deulemont Sector, La Toquet . On the way we passed through Phloeg Steert , a small town now in ruins from shell fire & behind us lays Phloeg Steert Wood, once the hunting ground of the king of the Belgians, & the scene of some of the heaviest fighting in the war. A few miles to the north can be seen Messines Ridge & the ruins of the village a little further north is Ypres, now in our possesion and still further north Paschendale Ridge & village. We are in communication each of our 4 companys, the Batt on our left, Batt on our right, F artillery, & Trench Mortar Battery, & Bde Hdqrs behind\n\n1917 NOV.\n\nTues. Nov. 13th & Wed. 14th\nus, by Telegraph & Telephone. Our Coys report situation on their position of front at intervals day & night. Our 10th Bde is holding line on our left. Lively artillary fire, MG and rifle fire through night. Enemy sending over HE & gas shells. River Lys runs between our trenches & enemys for some distance & prior to our taking over this sector the enemy were using sunken bridges to get on to this side of river with their patrols at night. These bridges were located by our scouts last night. A few nights ago an enemy patrol captured a Sgt Major of the West Yorks as he was\n\n1917 NOV.\n\nTues. Nov. 13th & Wed. 14th\ntaking the rum ration to one of the posts & a nightor two later captured the man bringing the mail to the men. We all now wear the steel helmet at all times & wear the box respirator at the alert position.\n","29":" \nOn duty 2 to 6 AM, 2 to 6 PM. Our guns active day & night. Enemy sending over HE (whizz bangs) & gas shells. Heavy M.G. & rifle fire through night. The trenches we are now holding were formerly the enemys front line & are much knocked about by shell fire.\n\n1917 NOV.\n","30":"\nRaining. On duty 2 to 6 AM & 2 to 6PM. From 2-30 AM to 3-30 AM enemy sending over 5-9 & pineapples. Our 18 pdrs returning the fire. Our patrols in no mans land report all OK at 2-30 AM. Enemy put a shell into 35th Batt cook house yesterday I K, 8 W. Received letter from mother & cards from children. Two HE shells have just landed on our dug-out, scattering the bricks etc. No one hurt. (4.47 AM) Weather dull & trenches very wet. Watched an air fight today until clouds blocked view. Have heard no news from outside since coming into trenches\n\n1917 NOV.\n","31":"\nOn duty 2 to 6 AM. Very heavy artillery fire on our left. Enemy sending over big Minnies at 2-30 AM. At 2-40 AM recieved word from Bde to be on alert against gas attack. Our patrols are out in No Mans Land from 6 PM to 6 AM. The country here is low lying & trenches very wet. As yet we have had no snow. Our Div forms part of the 1st A.N.Z.A.C.\n\nBatt Sig Staff Hdqrs\n\nLt Couson\nSgt Boyd\nCpl Scherf\nCooksley\nAnderson\nRimmis\nMurphy\nBritton\nLitt\nBaxter\nLaverton\nRedfern\nLowe\n(Linesmen)\nBurgess\n\n& Reed\n\nFairly quiet through aft.\n\n\n\n1917 NOV.\n","32":"\nOn duty 2 to 6 AM, artillery fire heavy on our left. Situation & intelligence reports telegraphed to Bde daily at 4 AM. Weather threatening. Companys changed last night B & C relieving A & D in front line. Enemy bombarded our","33":" Bde positions heavily. Our own trenches under heavy fire from 7 to 11-30 PM H.E. & gas shells. 2 of our runners gassed last night.\n","34":"\nOn duty 2 to 6 AM. Quiet except for occasional shelling. Towards morning our guns shelled enemy trenches. Some casualties in H Coy from H.E. shell.\n\n1917 NOV.\n","35":"\nOn duty 2 to 6 AM, 2 to 6 PM. Our guns active & enemy replying. Through night a gas shell landed in the dug-out of the officers of one of our batteries & all the officers were badly gassed. A good deal of M.G. & rifle fire through the day. One of our Coy's report enemy sending over pineapples & gas shells at rate of 20 per min. from 11 to 12-30 PM. Watched one of our planes bomb enemy trenches & then sweep them with M.G. fire this morning.\n","36":"\nOn duty 2 to 6 AM, 2 to 6 PM. Our guns active through night . Enemy shelling off & on & his M.Gs very active.\n\n1917 NOV.\n\nWed. Nov. 21stContd.\nSent through & sig. report at 4 PM. A burial ground for our men lies near the wood behind us & was consecrated by the Bishop of Pretoria. All about here are to be seen graves of our men in 2s 3s or more, who were killed in action in the early days of the war. Today I came across one marked \"Sacred to the memory of 4 unknown British heros, killed in action Nov 1914\". The Canadians are still pushing forward at Paschendale on our left. At 7 PM our Batt were relieved by the 34th & we marched back to Rossignol camp, over the mountain, & about 5 miles from the trenches.\n\n1917 NOV.\n","37":"\nAt Rossignol Camp, a great change from the trenches. A hot bath & clean clothes. Recieved letters from home.\n","38":"\nAt Rossignol on duty 10 to 1 PM. Enemy planes bombed our camp early this morning.Walked to Nieppe with mate in afternoon. Town very much damaged by shell fire & very few civilians left there. Big advance by our troops towards Cambrai, cavalry in action. Now within 2 M of town. Good news from Palestine.\n","39":"\nOn duty 10 PM to 1 AM. Raining & cold. Paid 1 franc for a hot bath at a cottage near camp. Our men still advancing at Cambrai &\n\n\n\n\n\n\n\n1917 NOV.\n\nSat. Nov. 24thContd.\nUp till Thursday 10000 men & many guns had been taken.\n","40":"\nAt Rossignol. Raining & cold. Walked to Pont Nieppe in aft. Town badly damaged by shells. Australian troops are billeted in all the towns in this area.\n","41":"\nAt Rossignol. Raining & cold. Byng'sarmy still advancing at Cambria & the fighting very heavy.\n","42":"\nAt Rossignol. Very heavy artillery fire on our left towards Paschendale through the day & night. Enemy attacked at Warneton between our position & Messines & attack beaten off. On duty each night 10 to 1 AM.\n\n\n\n1917 NOV.\n","43":"\nAt Rossignol. At times through the day enemy planes tried to get over our lines but were beaten off by our A A guns. Our planes very active over enemy lines though under heavy fire. One of our ob. baloons broke loose & drifted over enemy lines under heavy fire. A great many of our baloons up on observation work & a few of the enemys. At 3-30 PM we left camp for the trenches to relieve 34th. Road very bad & trenches very wet. Raining when we reached trenches. Burgess & I on duty from 9 to 12 AM. Enemy fairly quiet. Last night he raided part of our front but was beaten off. Our losses slight 2 K 5 W.\n\n1917\n","44":"\nIn trenches La Toquet section. Very cold & wet. Our guns very active day & night. On duty 2 to 6 AM.\n","45":"\nOn duty 9 to 12 AM. Raining. Enemy shelling our front line and C. Trenches. At 6 PM our guns shelled enemys lines heavily for ½ hr. At 1 AM our guns put a barrage over a section of the enemys front line trenches on our left,our 10th Bde sending out a raiding party in Warneton section. Barrage kept on until 1-50 AM. 2 Enemy planes over our lines this afternoon.\n\nSat. ","46":"\n","47":"\nOn duty 12 to 4 AM. Enemy artillery & M.Gs very active through early hrs of morning. Weather fine. At 6 PM one of our patrols\n\n1917\n\nSat. Dec. 1st Contd.\nencountered an enemy patrol in No Mans Land & fought with grenades & revolvers. Lts Torse & Grimley & 5 of our men wounded. Enemy casualties not known but our men brought in 5 of their rifles and caps. Last night's raid by 10th Bde succesful. Our losses 2 K 9 W.\n","48":"\nOn duty 12 to 4 AM 8 to 12 PM. Very cold & wet. Heavy artillery fire on both sides. Snow fell (the first this winter) through the night. Our patrols had to retire from No Mans Land through the night owing to gas shells sent over by enemy.\n","49":"\nWeather frozen through night. On duty 8 to 12 AM. At midday I had to break the ice on water in a shellhole to get a wash.\n\n1917\n\nMon. Dec. 3rd Contd.\nBetween 2 & 3 PM enemy shelled our trenches very heavily. Some of our lines broken by shell fire. One of our men killed & 5 wounded by a shell at 5.30 PM.\n","50":"\nOn duty 8 to 12 AM. Snow fell again through night. Day fine. Many planes up on both sides. Every day the enemy shells Phloeg Steert wood behind us, searching for our gun positions. Our trenches under heavy fire at night.\n","51":"\nCold very severe. Heavy fire on both sides. On duty 12 to 4 AM & 8 to 12 PM. Enemy sent a baloon over our lines in afternoon, which dropped papers, printed in\n\n\n\n\n\n\n\n1917\n\nWed. Dec. 5th Contd.\nFrench & English, giving account of great victories over allies in other parts & appealing to our troops to stop the war. The paper was named the \"Ardennes Gazette\" & is printed in one of the French towns now in German hands.\n","52":"\nOn duty 12 to 4 AM. Morning quiet. At 3 PM our guns opened & shelled enemy lines heavily. Very heavy frost. 1 K 2 W in A Coy last night. Expect to be relieved in trenches tomorrow.\n","53":"\nHeavy rain through night & trenches now very wet. Our guns active & enemy searching for our batteries with his guns. Many air fights over Armentieres Sector (on our right). British have\n\n\n\n\n\n\n\nFrid. Dec. 7th Cont'd\nto retire a certain distance at Cambrai, where the fighting has been very severe. Air raid on London 2 days ago. Relieved by 34th Batt at night. 2 of our Coys to remain in line as working Coy's. Marched to Rossignol Camp. Road very bad.\n","54":"\nIn huts at Rossignol near Nieppe. Our batt now acting as support to Bde. The Section which our Div (3rd) is now holding is partly in France & partly in Belgium. Many graves of British troops who fell in 1914 in this part of the country, & it was through this country that our first expeditionary forces had some of its hardest fighting.\n\nAft. paid 1 Fr. for a hot bath\n\n\n\nSat. Dec. 8th Cont'd\n& washed clothes. With Murphy walked to Nieppe & paid 3-20 FR for a meal (eggs & chips).\n","55":"\nAt Rossignol. On duty 12 to 3 AM. Raining. Roumania has asked for an armistice. Germans claim another big victory in Italy. Great explosion at Halifax on munitions ship. Church parade in camp.\n","56":"\nAt Rossignol on duty 4 to 6 PM. Camp inspected by Gen Birdwood in morning. In afternoon 7 gothas came over our camp bombing & dropping papers. Our AA guns shelled them heavily & one appeared to be hit, making back to his own lines very slowly. Some of our men K & W.\n\n\n\n\n\n1917\n","57":"\nAt Rossignol. On duty 2 to 6 AM. Very heavy art. fire all night. In yesterdays raid by gothas, several of our 2nd Div men killed & many mules & horses. One of 36th officers wounded. 5 children at a farm near our camp killed. Bde concert in YMCA hut at night.\nJerusalem captured by the British.\n","58":"\nAt Rossignol, weather fine & frosty. At 2 PM 2 gothas came over on bombing raid. Engaged by our AA guns & machines. One Gotha brought down in flames. When about 500 ft from ground & over our lines the machine exploded & we could see two men falling from it. 2 more of\n\n\n\n\n\n1917\n\nWed. Dec. 12th Cont'd\nthe raiders were brought down towards Phloeg Steert Wood. Many bombs were dropped in camps adjoining ours. In one camp a bomb dropped amongst a lot of our men who were watching a football match. A number wounded, 14. The brother of one of our Sigs, an artillery driver, was killed while excercising his horse. Walked to Nieppe in aft. & bought presents forJ. & A. Our Batt met 4th M.G. Coy at rugby. Result 3 pts each. On duty 4 to 6 PM.\n","59":"\nAt Rossignol. Cold & frosty. On duty 4 to 6 AM, 6 to 8 PM.\n\n\n\n\n\n\n\n1917\n","60":"\nBatt marched at 10 AM through Nieppe to Hollebeque camp about 5K. 2nd Div had taken over the La Touquet Sect from us today. Our new camp is 3K from Steinwerks which is a big supply depot for our troops. The camp is very wet & muddy. On duty 4 to 6 PM.\n","61":"\nAt Hollebeque Camp. Weather cold & wet. Aft. walked to Steinwerks, a fair sized town. On duty 6 to 10 PM.\n","62":"\nAt HollebequeCamp. Very cold. Our officers inspecting front line in Armentieres sector, which we are to take over & hold. Snow fell in afternoon.\n\n\n\n\n\n\n\n\n\n1917\n","63":"\nSnow fell all through last night & everything now under a thick coat of it. Very cold on duty 2 to 6 PM.\n","64":"\nAt Hollebeque. Ground & roads now frozen hard. On duty 2 to 5 AM. Aft. watched an air fight over our camp. One of our machines attacked 3 enemy machines & after a ¼ hr fight drove them off. Our Bde to take over Houplines portion of Armentieres sector tomorrow. Advance party left for trenches this afternoon. Portion of our Bde only came out of line in Deulemont sector 3 days ago. This is the most severe weather we have yet had.\n\n\n\n\n\n\n\n1917\n","65":"\nAt Hollebeque. On duty 4 to 8 AM. Our planes could be heard up through the night. At 2-30 PM Batt marched from camp on way to trenches. Crossed River Lys & through Armentieres & Houplines to trenches, arriving at 7 PM. The roads were ice covered & frozen hard and it was very hard to keep on your feet owing to slipping. Armentieres, a fine city, now badly knocked about by shellfire & entirely deserted by the civil population, was in German hands for 8 days. Before entering the town we passed the A.I.F. burial ground, where some hundreds of Australians lie, including an OC of our Batt. Col Simpson, killed in action\n\n1917\n\nWed. Dec. 19th cont'd","66":"\n","67":"\n\nThur. Dec. 20th\nIn trenches. Very heavy frost last night & everything now frozen hard & snowed under. Enemy guns active. One of our Power Buzzer men sniped an outpost in NML last night. On duty 3 to 6 AM, 3 to 6 PM. Two of the enemy in our uniforms captured in Steinwerks yesterday. They had come through to the line where the Portugese are holding it, on our right & were on their way back when captured. Our artillery active in afternoon.\n\nFrid. Dec. 21st\nOn duty 6 to 9 AM. Ground still frozen hard & under snow. Artillery on both sides livened up in afternoon & night, To prevent\n\n\n\n\n\n\n\n\n\n1917\n \n\nFrid. Dec. 21st cont'd\nslipping on the ice covered duck-boards we tie a sand bag over each boot. One of our patrols captured 2 of the enemy in NML last night. They appeared to be lost. Our tel. lines communicating with our artillery have been interfered with several times recently & rendered useless, at the time when artillery help was needed. This points to spys in our lines. On duty 9 to 12 PM. Our dugouts here are built of curvedcorrugated iron with earth & sand bags built over & round them, 3'6\" high by 6' x 6', 3 men in each. We relieved the 17th Royal Welsh Fusiliers in this sector. 12 months\n\n1917\n\nFrid. Dec. 21st \nago our Div were holding this same sector & had some stiff fighting. Armentieres was one of the chief manufacturing towns of France prior to the war. Atour officers dug-out there is an old grey cat on three legs that was there 12 months ago when our men were here.\n","68":"\nWeather clear & very cold. Heavy art. fire from both sides. Many O.B. up. Two old mates of mine (Booth & Langham) sigs in 35th Batt, captured by enemy when on outpost duty in N.M.L. last night . On duty 12 to 3 AM 12 to 3 PM.\n\n\n\n1917\n","69":"\nIn trenches Houplines. On duty 3 to 6 AM, 3 to 6 PM, still freezing. Enemy MGs active day & night. All of our trenches are named after streets etc in English & after towns. Our dug-out is \"Chepstowe House\", Gloucester Avenue. At 2 PM enemy shelled our CT & support trenches heavily. Our guns retaliated. Late in afternoon a big fire could be seen behind the enemy's lines. One of our planes flying very low (150 ft) over enemy trenches fired many rounds from MG at men in the trenches though under heavy MG fire from enemy. Very heavy art. fire on our left (Messines) through the night.\n\n\n\n1917\n\nSun. Dec. 23rd con't\nEnemy raided 35th, on our left at night. Attack beaten off leaving 20 enemy dead. Our losses nil.\n","70":"\nGround still snowed under & frozen. On duty 9 to 12 AM. Enemy fired 200 shells into one street in Armentieres yesterday. Today he is bombarding us heavily at times. M.Gs active through night. From 8 to 10 PM our guns going strong.\n","71":" (Xmas Day)\nMurphy & I on duty 12 to 4 AM. Snow & sleet falling off and on all day. Recieved tin of tobacco & cigarettes from our comforts fund.\nFare for the day:\nBreakfast- bacon, bread & tea\n\n\n\n\n\n\n\n\n\n1917\n\nTues. Dec. 25th Cont'd\nDinner: Boiled rice & raisins\nPlum pudding & tea\nTea: Stew & tea.\n\nNo truce this Xmas.. Along parts of the frontFritz was inclined to fraternize with our men. In front of our Batt he put up a sign over his trench with the words \"Hello Australia\" painted on it. Our lads promptly blew it to pieces with their rifles. Our artillery very active through the day & night. One of our patrols surprised an enemy patrol in No Man's Land last night killing 2 & wounding others. A wounded German N.C.O. brought in, who gave our Intelligence Officer much information re enemy plans, movements, etc., on duty 4 to 8 PM.\n\n\n\n1917\n","72":"\nSnow now very deep & still falling. Gen Birdwood visited our trenches today, stopped at our dug-out to enquire how we were doing etc. 2 of our men killed & several wounded by shell landing in dug-out. We have now established 2 night posts out in N.M.L. 2 Signallers, 2 NCOs & 6 men make up each post. The posts are 400 yds out in front of our trenches & 70 yds from the enemy's. They can only be approached after dark & we do 24 hrs out there.\n\nTUES\n","73":"\nLight snow falling & the cold extreme. Enemy shelling Houplines (behind us). A\n\n\n\n\n\n1917\n\nThur. Dec. 27th Con't\nfew of our planes up through the day, one being under very heavy M.G. fire at 11 AM over enemy lines. One of our men had his arm broken today by one of our own shells (a \"flying pig\" on heavy TM ) that fell short & did not explode. Our guns have been going strong all day.\n","74":"\nWeather still freezing & whole front under snow. Enemy shelling our trenches day & night with HE & shrapnel. Sending big \"Minnies\" over into our front line. At 2 AM our heavy TMs in action, & through day 18 pdrs busy.\n\n\n\n1917\n","75":"\nOn duty 4 to 8 AM. More snow fell through early morning. Heavy MG fire all night. Several enemy planes up early this morning, one of them getting well back over our lines despite heavy fire from our AA guns. Enemy shelling our working parties with shrapnel. On duty 4 to 8 PM.\n","76":"\nOn duty 8 to 12 AM. Weather dull & threatening & very cold. Orders through that we are to be relieved on Jan 1\/2nd by 171st Inf Bde. Enemy shelling our positions from 11 to 12-30 AM. Our 18 pdrs L & H, TMs in action.\n\n\n\n\n\n\n\n1917.\n","77":"\nOn duty 12 to 4 AM. Enemy M.Gs very active. Our 18 Pdrs in action through the day. Weather dull & cold. At 4.30 we left for 24 hrs outpost duty in N.M.L, 2 sigs, 2 N.C.Os & 6 men, reached there at 5-30 PM. Our post is in a big shell hole & can only be reached after dark. It is 400 yds from our own trenches & 70 yrds from the enemys. My work is to keep in tel. communication with our Batt. No shelling, sleet & snow falling all night. Enemy throwing Verey lights all around us, & his M.Gs playing on our position. We can hear the enemy talking & working in his\n\n\n\n1917.\n\nMon. Dec. 31st Cont'd\ntrenches when the guns are quiet for a few minutes. This is No. 6 post, our next, No. 7, is ½ mile away on our right. Orders are to hold post at all costs.This is the coldest weather we have had, & it is impossible to keep warm. From 10 to 12 PM enemy M.Gs all along our front were firing & many verey lights sent up, he also threw many bombs into his own wire, & was evidently under the impression that our men were going to attack.\n\n\n\n1918.\n\nTues.€‹","78":"\nOn No. 6 outpost in N.M.L. This has been the coldest night & day in my experience. At 5.30 AM we took up our position on Day post, an old battered trench 100 yds from enemy lines. No room to move about to warm up. Under heavy fire all day. At 11.30 our tel. line broken by one of enemy shells, \nwhich \nI repaired line after finding break. At 5.30 PM we took up our position in night Post again & at 7 PM we were relieved by men of K.O.L.R. . Left trenches at 8 PM. The Batt left earlier in the night after being relieved by K.O.L.R. We\n\n\n\n1918.\n\nJan.1st Con't'd\nmarched through Armentieres, Pont Nieppe to Nieppe where we camped for night, being knocked up from exposure on out-post & the long march on frozen roads.\n","79":"\nMarched from Nieppe to HollebequeCamp, arr 8 AM. Road very bad owing to ice. At 2 PM Batt left camp by motor buses through Bailleul to Merris where we camped after long hunt in the dark & snow for billets.\n\n\n\n1918\n\nThur.€‹","80":"\nMarched to billets on farms 1K from Merris. Country still under snow & weather very cold. Our quarters are in a barn open on 2 sides.\n","81":"\nIn billets on farms. Had hot baths at Div Baths. Recieved pcl.from girls. An old lady at an adjoining farm to this, related to me how the Germans, when in possession of this part of the country, bayoneted her son in her presence. The Padre of Merris was shot by them.\n\n\n\n\n\n1918\n\nSat. Jan.","82":"\nIn billets near Merris. On duty 9 to 12 AM. Afternoon walked to Merris, where there is a big home for refugees, conducted by nuns.\n","83":"\nChurch parade to Merris. Aft. walked to Neuv Berquin . Many Chinese Coolies (labour Batts) employed on roads etc about this part.\n","84":"\nParade in morning. Aft. walked to Merris, on duty 9 to 12 PM.\n\n\n\n\n\n\n\n\n\n1918\n","85":"\nIn billets near Merris snowing heavily all day. Recieved orders to move to Meteran , 4K from here, tomorrow.\n\nWed. Jan. 9th\nMarched to Meteran at 2 PM. Snow now nearly a foot deep & still falling. Now billeted in attic of a house in the village. Our 4th Div marched through in aft. on their way from Cambrai sector where they have been in reserve, to Armentieres Sector. In","86":" British troops drove the enemy out of this village, after heavy\n\n\n\n\n\n1918\n\nWed. Jan. 9th Contd\nfighting in which our losses were heavy. In the fields all round are to be seen the graves of our men, buried where they fell. The D.L.I. of K.O.R.L Regt evidently lost most men.The enemy had machine guns posted in the tower of the church & some Highlanders attacked this, throwing the guns and gunners through the windows on to the stone below. This place is on the road from Fletre to Bailleul.\n","87":"\nAt Meteran. This is our Bde Hqrs & also Hqrs for 7th A.C. Motor Park. Raining. Snow now melting. On duty 9 to 12 AM.\n\n\n\n\n\n1918\n","88":"\nAt Meteran on duty 8 to 11 AM. Raining.\n","89":"\nOn duty 8 to 11 AM. Aft. walked to Bailleul 3½ K & bought some souvenirs. This town was in enemy hands for a time, & heavy fighting took place round here.\n","90":"\nAt Meteran. Church parade. Attended Mass in village church, a fine building, many of the stained glass windows broken by rifle fire.\n\n\n\n\n\n\n\n1918.\n","91":"\nAt Meteran. Raining.\n","92":"\nAt Meteran. Raining. Route march in aft.\n","93":"\nAt Meteran. Murphy & I on escort to prisoners being tried by C.M. . Very cold & snow falling.\n","94":"\nAt Meteran. Snowing.\n","95":"\nAt Meteran.\n","96":"\nAt Meteran. Route march in aft. through Merris.\n","97":"\nChurch parade. Attended mass in village church.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1918 JAN.\n","98":"\nAt Meteran. Weather milder.\n","99":"\nAt Meteran.\n","100":"\n\nAt Meteran. Our officers played 34th at rugby. Beaten 6 to 5. 12 months ago we sail'd from Sydney.\n","101":"\nAt Meteran. Raining. €‹ \n12 mon\n Bailleul aft.\n","102":"\nAt Meteran.\n","103":"\nAt Meteran. Batt on route march in aft. through Fletre, Strazeele, 10K in full marching order.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1918 JAN.\n","104":"\nAt Meteran. Weather cold & foggy. Church parade.\n","105":"\nAt Meteran. Weather fine & clear. 34th marched to Neuve Eglise.\n","106":"\nAt Meteran. Very heavy frost. This is the best weather we have had for some time. Whole Bde on route march in aft. through Outersteen & Bailleul. 34th Batt. camp at Neuve Eglise bombed by Gothas today, several huts blown to pieces & 28 menK & W.\n","107":"\nAt Meteran. Heavy frost. Tomorrow our Batt marches to Neuve Eglise.\n\n\n\n\n\n\n\n\n\n1918 JAN.\n","108":"\nBatt marched from Meteran at 9 AM through Bailleul to a camp near Neuve Eglise, where we are acting as supporting Bde to 10th & 11th Bde of our Div. At Bailleul we were inspected by Gen Birdwood. The roads were in a very bad state for marching. At 4 PM we reached camp, which is over the Belgian frontier on the road to Messines. Camp is called Canteen Corner. On duty 3 to 6 AM. €‹ \nAll Hd\n\nFrid. J\nan\n","109":"\nCold & wet. Company's on as working parties. All Hdqrs on loading stone on lorries. Adjutant\n\n\n\n1918 FEB.\n\nFrid. 1st Feb.","110":"\nhas issued orders that sigs are not to be put on working parties again. On duty 6 to 9 AM.\n\nSat. Feb. 2nd\nAt Canteen Corner. Weather freezing. Big air raid on Paris.\n","111":"\nOn duty 12 to 3 AM. At 1-30 AM enemy planes came over & bombed our camps. Our A.A. guns opened heavy fire & our planes up after enemy's. At 3-30 AM one enemy plane over our camp under heavy fire. Church Parade 9 AM.\n\n\n\n\n\n\n\n1918 FEB.\n","112":"\nAt Canteen Corner. On duty 3 to 6 PM. Company's on working parties in trenches. A few nights ago 90 of our men gassed in trenches near here. Major Massie & a 34th officer wounded yesterday by shell near our camp.\n","113":"\nHeavy artillery fire on our front through night. On duty 9 to 12 AM. Afternoon with Anderson walked to Neuve Eglise where part of our 1st Div are encamped. On way back watched our A.A. guns in action. Enemy plane high up over our camp, evidently on observation work. Romanian Camp adjoining ours beinging shelled.\n\n\n\n1918 FEB.\n","114":"\nAt Canteen Corner. On duty 12 to 3 AM. Raining & cold. Very heavy artillery fire on our right front. Our 10th Bde carrying out raid tonight. On duty 9 to 12 PM.\n","115":"\nRaining. Companys on working parties in trenches. On duty 3 to 6 PM. One of our observation baloons located at rear of our camp.\n","116":"\nOn duty 9 to 12 AM. At Canteen Corner.\n","117":"\nAt Canteen Corner on duty 12 to 3 AM. Very cold. Received\n\n\n\n\n\n\n\n\n\n1918 FEB.\n\nSat. 9th (Cont)\norders to report to our Brigade HDQRS (with Laive) sig section for duty tomorrow","118":" Two sigs have been selected from each of our 4 Batts for this work. On duty 9 to 12 PM.\n\nSun. 10th\nReported to our Bde Hdqrs 2 PM. & allocated to Sig Section. Cold & very windy. Now in Trois Rois Camp ½ mile from Neuve Eglise.\n\n\n\n\n\n1918 FEB.\n","119":"\nAt Trois Rois. Morning flag, lamp & shutter work. At 10 PM last night a party, 180 officers & men, from 37th & 38th Batt raided enemy trenches on left of La Toquee , near Warneton. A fine barrage put over by 150 of our guns. 37 prisoners 3 MGs &1 TM brought in. Estimated 100 enemy killed. Our men were in enemy second line trench\n\n\n\n1918 FEB.\n\nMon. 11th cont.\nfor 20 minutes. Our casualties 5 K 14 W & M.\n","120":"\nAt Trois Rois. Our \nBatt\n Bde in reserve to the Div & our Batts working parties strengthening our second line of defence. Opinion seems to be that enemy will attack on a big scale on this front with the troops he has brought from the Russian\n\n\n\n\n\n1918 FEB.\n\nTues. 12th cont.\nfront, before the USA troops are in the field in strength. Yesterday we recieved the news of Southern Russia making peace with Germany & Austria. Raining all day & night.\n","121":"\nRaining & cold. Roads now in very bad state. Heavy artillery fire on our front.\n","122":"\nRaining. Our 10th & 11th Bdes are in the trenches between Messines & Armentieres.\n\n\n\n\n\n\n\n1918 FEB.\n","123":"\nAt Trois Rois. Heavy artillery fire through day & night. Weather very foggy.\n\nSat. 16th\nDay fine & clear with heavy frost. Great airiel activity. Several enemy planes over our lines. Driven back by our A.A. guns. One enemy machine brought down near Bailleul, 6K from here. Enemy shelling our camps with 9-2 gun from long\n\n\n\n\n\n1918 FEB.\n","124":" Cont.\nrange, 1 K, 4 W by shell near Canteen Carner. Enemy planes over our camps at night.\n","125":"\nHeavy frost, very heavy artillery fire day & night. Aft. walked to Westhoff Farm Camp, an Australian hospital & rest station, nearby many of our men are buried.\n","126":"\nAt Trois Rois. Cold & frosty. Greatair activity & artillery active on both sides.\n\n1918 FEB.\n","127":"\nOn station work all day. Flag & lamp. Our guns were bombarding enemy lines heavily through early hours of morning. Day clear & fine.\n","128":"\nAt Trois Rois. Day fine & clear. Heavy gun fire on our left front through night. In commun. with Div. & all Batts by Lucas Lamp all day, on duty 10 to 2 p.m. On one day a week now comm. is to be carried on by visual means, both when in trenches & out, as far as possible.\n\n1918 FEB.\n","129":"\nAt Trois Rois. Raining & cold. Preparing to go into into trenches in a couple of days.\n\nFrid. 22nd\nAt Trois Rois. Tomorrow we (9th Bde.) move into the line, relieving 11th Bde. in St. Yves sector. (This is adjoining Le Toquie sector). Yesterday we were detailed to our different duties & posts in the trenches. Enemy shelling one of our O. Baloons over our camp with shrapnel in afternoon. 6 Sigs. to go to Bde. forward Stn., I one of them. Our rear Stn. to be a Romarin.\n\n1918 FEB.\n","130":"\nAdvance Bde. Post (16 of us) operators, linesmen & runners, marched from Trois Rois at 9 a.m. through Romarin, Suicide Corner, Hyde Park Corner to our post (Big Sam), a big dug-out in the corner of Ploeg Steert Wood (built by the Canadians) & near Hill 63. Arrive at 12 p.m. Took over from 10th Bde. sigs. at 1 p.m. Robbie & I on duty 1 to 5 p.m. Hill 63, at our rear, is very strongly fortified, one portion, called the Catacombs, being a\n\n1918 FEB.\n\nseries of galleries & tunnels driven into the Hill, all being connected up, & capable of holding 3 Batts. of our men. All these places are lit by electricity. One of our light railways runs up into this wood & our second line of defence, which runs along our rear, is being strongly organised & built up, by our men. Our 33rd & 34th Batts. take over the trenches from Romanians; 35th & 36th being in support in the Catacombs. Dug-outs very wet & ground a bog. Batterys of our guns on Hill 63 & in the wood, active through night. A big raiding party\n\n1918 FEB.\n","131":"\nfrom our Bde. (70 men & officers from each Batt.) now in camp at Bulford Camp, training for this.\n","132":"\nAt Big Sam. On duty 8 a.m. to 1 p.m. Weather dull & foggy. Round about this part are many burial grounds of our men & in coming through yesterday I noticed many of the graves had been blown up by the enemy shells, crosses broken etc.\n","133":"\nAt Big Sam. On duty 10 p.m. to 8 a.m. 26th. Weather very cold. Our artillery active through\n\n1918 FEB.\n\nMon. 25th Cont.\nnight. Enemy attempted a raid on our left near Menin Road, Ypres. Attack beaten off.\n","134":"\nReceived orders to report to Bde. Hdqrs. Romarin. Enemy shellilng Hyde Park Corner as I came through.\n","135":"\nAt Bde. Hdqrs. Romarin. On duty 1 to 5 p.m. Raining heavy through night.\n","136":"\nAt Romarin. Aft. went into Div. Hdqrs. Ravelsburg to draw some phones etc.\n\n1918 MAR.\n","137":"\nAt Romarin with Bde. Hdqrs. Weather cold. Heavy frost. Very heavy artillery fire through night.\n","138":"\nAt Romarin. Very cold. Enemy attempted a raid on our \n11th Bd.\n 5th Div. near Messines, last night. This accounts for the very heavy fire on our left. Attack failed. Self & 2 others at Bulford Camp getting things ready (telephones, wire, etc.) for the raid. Snow fell through the day, which has been the coldest since early in Jan.\n\n1918 MAR.\n","139":"\nAt Romarin. Very cold & foggy. Our raiders go over tonight.\n","140":"\nAt 20 to 12 last night our guns opened barrage on enemy trenches, which were heavily bombarded for an hour. Under cover of this enemy lines were raided by 300 men of our Bde. Enemy casualties heavy & good number of prisoners taken. Our losses 2 K 10 W. Another raid in same sector to be carried out by our men tonight.\n\n1918 MAR.\n","141":"\nAt Bde. Hdqrs. Romarin. Weather cold & foggy. Last night our second raiding party went over the top & into the enemys trenches at 10-30 p.m. after heavy bombardment by our guns. Stiff fighting & many enemy killed, dug-outs blown up etc. Our losses 6K 24W & a few missing. Our guns very active all day & good deal of air fighting in afternoon.\n\n1918 MAR.\n","142":"\nAt Romarin Bde. Hdqrs. Very heavy artillery fire all night. Our heavy guns (6\" & up) in position round us were in action from 12 to 4 a.m. M.Guns action along the line. A 15\" naval gun brought up for the purpose blew up Warneton Town (a big reinforced concrete observation post in Warneton, a town in the german lines, opp. our sector, St. Yves) which has withstood all attempts, by our guns, to destroy it, up till now. The 4th shot from the big gun done the job.\n\n1918 MAR.\n","143":"\nBde. Hdqrs. moved to Trois Rois. 2nd Div. relieving ours in this sector of front line today. Very heavy bombardment on our right in progress through night. On our own front the guns have been very active, & the aeroplanes have been busy, though few enemy planes have been seen over our lines lately.\n\n1918 MAR.\n","144":"\nMarched to Steenwerk at 9 a.m. in charge of our baggage etc. Bde. moving into a back area today for a rest. Entrained at 1 p.m. Bde. Hqrs., 34th & 36th Batts. & 10th F. Coy Eng. travelled through Hazebrouck, St. Omer to Devres (12K from Boulougne ) then marched to Chateau Alinethun, a fine mansion on a beautiful estate, 7k from Devres owned by Baron Quesnoy, who is serving as a private in the French Army & whose wife (the\n\n1918 MAR.\n\nFrid. 8th Contd.\nBaroness is also on war work. Our Batt. & other units are billeted in villages & on the farms in this area. We are now out of sound of the guns in the line & things seem so very quiet after it. Roumania has now signed peace terms with the enemy.\n","145":"\nAt Chateau Alinethun. Aft. walked to Hennerous a village 2K from here. Weather fine & clear.\n\n1918 MAR.\n","146":"\nAt Chateau. Lovely weather. Medical inspection in aft. Then walked to Alinethun, a village 1K from here. Enemy attacked heavily at Holthuist Forest & beaten back with heavy loss.\n","147":"\nAt Chateau. Morning trying to get in commn. with Div. Hdqrs, by helio, but could not get in touch owing to hills between us. Paid 30F. Weather good.\n\n1918 MAR.\n","148":"\nAt Chateau Alinethun. Helio work & football in morning. Walked to Desvres in aft. 7½K. Enemy attacked again on Saturday at Ypres without success & losses heavy. Big air raid on Paris on Sunday.\n","149":"\nAt Chateau. Morning Helio & football. Aft. walked to Desvres. Weather good. Another raid by 60 machines on Paris, 100 K & many injured.\n","150":"\nCold & raining. Buzzer work in morning.\n\n1918 MAR.\n","151":"\nAt Chateau. Cold & foggy. Morning Helio, aft. had long walk through country.\n","152":"\nAt Chateau. Weather again fine. Our officers entertain nurses from hospital at Boulougne. Bands of 33rd, 34th, 35th & 36th Batts. playing in Chateau grounds. A few days ago 190 men of 9th Batt. gassed in trenches, including O.C., most of them in bad way & not expected to recover.\n\n1918 MAR.\n","153":"\nAt Chateau Alinethun. Weather good. Aft. had long walk on Boulogne Road, with Butler & Reardon.\n","154":"\nAt Chateau. Visual work in morning. Weather good & signs of spring approaching, hedges & trees coming out in bloom. Enemy expected to launch big offensive at any time now. Watched a raider being driven\n\n1918 MAR.\n\nMon. 18th (Cont.)\noff Boulogne by our A.A. guns in aft.\n","155":"\nAt Chateau. Visual work in morning.\n","156":"\nAt Chateau. Weather fine. Lewis gun drill in morning.\n","157":"\nAt Chateau. For past 2days & nights a very heavy bombardment going on to the north. Rumours of enemy attacking on a wide front. Orders out to be ready to move for\n\n1918 MAR.\n\nThur. 21st Contd.\nfront at 1 hrs notice. Enemy threatens to begin great attack on British today.\n","158":"\nWeather very foggy. Division to move for front tonight. Enemy attacking on a 50M front from the Scarpeto the Oise. Very little news through as yet. At 6 p.m. we marched from Chateau to Lassinghem , 12K, arriving at 9 p.m. Entrained at 1-30 a.m. 50 men in each truck & after rough trip reached Abeele in\n\n1918 MAR.\n\nFrid. 22nd\nBelgium at 7 a.m. The whole 9th Bde. on this train.\n","159":"\nMarched from Abeele to Watou, a pretty little Belgian town 6K. Rested through the day. Received orders to move again tomorrow.\n","160":"\nMarched from Watou at 9 a.m.½ way to Abeele, thence by motor lorries through Steenvorde , Hazebrouck to Wallon Capelle & marched to billets 3K on, near Cereques . Very heavy fighting\n\n1918 MAR.\n\nSun. 24th Contd.\n& British forcedto retire. Enemy claims 25000 prisoners, 400 guns - to date.\n","161":"\nNear Wallon Capelle. Ordered to be ready to move at any hour. 600,000 men attacking & our line still falling back. We are likely to be thrown into the line at any time now. At 11.30 p.m. marched to Steenbecque 6K. Raining. Now attached to 3rd Army & on way to centre of battle front.\n\n1918 MAR.\n","162":"\nEntrained at Steenbecque in trucks. Travelled through St. Pol to Doullens arrived at 9 a.m. Town full of troops & transport. Marched 12K to Mondicourt. Roads packed with troops & transport. Many wounded coming in. Old men, women & children carrying all they could in food & clothes fleeing from the towns & villages before the German advance. Enemy reported to have broken through\n\n1918 MAR.\n\nTues. 26th\nnear Arras & his cavalry reported 12K from here. Our Batts take up position on left & right front of village prepared for battle, in open country.\n\nWed. 27th\nAt 3 a.m. recieved orders to move in 1 hr. in motor buses to another part of line further south that is hard pressed. Enemy bombed Doullens last night.\n\n1918 MAR.\n\nWed. 27th Cont.\nAt 4 a.m. left Mondicourt in lorries for Franvillers, arr. 10 a.m. People fleeing from all villages. Marched 2K & encamped in open for night. Batts in position in front of enemy. Ourvisual sig. station in commn. with them until shelling drove us from our poss. Our 10th & 11th Bdes joined us through day, & we have now established a line with the\n\n1918 MAR.\n","163":" Cont.\nthe N.Z. Div. on our left & 4th Aust. Div. on our right. An enemy plane brought down in flames over our lines. Our planes doing grand work. Enemy shelling off & on through night. This aft. a Bosche in one of our planes bombed & used a M.G. on our men in the open from a few hundred feet up.\n\n\n\n1918 MAR.\n","164":"\nAll the Colonial troops are being rushed here on to the Somme & Ancre to try & stop the enemy push, his objective is Amiens & to split the British & French Armies. Weather cold.\n\nThur. 28th\nCold & windy. Marched to Bonnay a village on Ancre where we est. our Bde. Hdqrs. In aft. went out to find a post for a visual station to comm. with our\n\n1918 MAR.\n\nThur. 28th Cont.\n33rd Batt. After a lot of trouble found a site & opened comm. with them per Lucas L. Raining & cold. Enemy shelling Corby a town 2K from us at junctionof Somme & Ancre. Our guns now in pos. & very active. This is the most vital part of our line & is to be held at all costs. People were overjoyed to see\n\n1918 MAR.\n\nThur. 28th Cont.\nour men arrive in the different houses we came through on our way here. Our men are full of confidence & ready for the fray. The British troops have fought well against many times their number in this battle & the cavalry have done great work.\n\nFrid. 29th (Good Friday)\nHolding line at Bonnay. Our 10th Bde. drove enemy back & captured a village this morning. Our losses not heavy. News from\n\n1918 MAR.\n","165":"\nother parts of front better & enemy being held up. Raining & cold. On visual station 5 to 9 a.m., 5 to 9 p.m. At 9 p.m. our Bde.marched from here through Corbie, Cachy, to Gentelles 12K, & taken up pos. between enemy & Amiens where big attack is expected. We are now att. to the 58th Div. Arr. at 2.30 a.m. after a very trying march. Enemy attacking but gaining little ground.\n\n1918 MAR.\n","166":"\nAt Gentelles. Our Bde. holding line near Villers Brettoneaux & preparing to attack. Troops & art. on the move through village day & night. Many of our wounded now coming in. At 3-30 p.m. our 33rd Batt. with 1 Coy of 34th attacked & drove enemy back, \nbut\nafter heavy fighting. Our losses 170 K & W, including Col. Morshead W . Our pos. is about 8M in front of Amiens which enemy is shelling.\n\n\n\n1918 MAR.\n","167":"\nAt Gentelles. On vis. station on roof of a house in comm. with our batts in line. Enemy shelling us through aft., & very heavy art. duel on our right where the French are holding the line. From my post I watched our cavalry attack & clear a ridge on our front, under cover of our guns. All day the guns on both sides have been going hard & the battle continues. \n\n1918 APRIL\n","168":"\nAt Gentelles. Our men now holding the enemy who had advanced 30M in 10 days at this point. Our cavalry to make an advance this morning. Our airmen seem to have all the best of it in the air here & not many enemy machines are seen over our lines. At 7 a.m. 12 enemy planes came over but were driven back by ours. All day he has been shelling us with HE& shrapnel. At 6 p.m. our men downed an enemy plane close to us.\n\n1918 APRIL\n","169":"\nAt Gentelles. Now attached to the 18th (Brit.) Div. Enemy shelling Amiens with long range guns. Most of the people have fled from the city. Weather dull & roads in bad way from rain & heavy traffic. The French on our right have had heavy fighting & have pushed the enemy back in some parts. Our men holding Villers Brettoneaux. Our village under heavy shell fire\n\n1918 APRIL\n\nTues. 2nd Cont.\nall day & many casualties. At 6 a.m. our troops attacked & drove enemy back. Our airmen report thousands of German dead on the front. Very heavy air fighting. Our Bde. & Div. thanked for its fine work here & given credit for saving Amiens. Raining through night. A gas attack was projected for tonight but wind not being in our favour it was cancelled.\n\n1918","170":"\nHolding line Villers Bretoneaux, Cachy front. Enemy shelling Paris for past week with L.R. gun from a distance of 62M. All day the guns have been very active on both sides. The country here is very open & it is a great change from the trenches to fight in the open & suits our men. On our right the French arestill heavily engaged & a little further\n\n1918 APRIL\n\nWed. 3rd\nsouth the enemy have occupied Montdidier a railway junction. Recieved message of thanks from Gen. Birdwood for our work.\n\nThur. 4th\nAt 6 a.m. owing to heavy shell fire we had to take cover in a cellar. The village is being blown to bits. Many casualties in the village. Early this morning the enemy attacked in three waves on front held by our 35th & beaten off with great loss. At 10 a.m. we again attacked, 33rd & 35th & owing to British\n\n1918","171":"\nbeing forced back on our left, our men withdrew their line a short distance. 6 of us sent out to form a relay post between the Batts & our Bde. Hdqrs. At 12-30 we had to move Hdqrs. from Gentelles to Blangy Tronville 3K, on the Somme. A HE shell landed in our billet as we were ready to move. This has been my closest shave thus far. At 6 p.m. our 36th Batt. counter attacked & again at 2 a.m. driving the enemy out of his\n\n1918 APRIL\n\nThur. 4th\nposition & regaining all the ground. Enemy losses very heavy. Our men fought magnificently & our losses rather severe. While enemy was attacking today a german in our uniform (officers jacket etc., & Queens Regt. cap on) & carrying a pack ran along ordering our men to retire. He was stopped & as he could not prove his identity & his pack contained nothing but lace etc., (evidently looted) he was at once shot.\n\n1918 APRIL\n\nFrid. 5th\nAt Blangy Tronville. Raining. Our 2nd Div. arrived from Messines last night. 3rdCav. Bde. working with us here. 6th Dragoon Guards (Inniskillings) form part of this Bde. 17 yrs. ago in S.A. they formed part of our flying column under Brig-Gen. Rimington.\n\nSat. 6th\nWeather clear. Our men relieved in line by 2nd Div. last night & now in close support. Several small lots of prisoners brought in by our men today. These had recently come from the Russian\n\n1918","172":"\nRussian front & had never heard of the Australians. We seem to have the enemy held up here now, & our men saved Amiens. Enemy reported to be massing for fresh attack. Our 5th Div. over from the north last night. This aft. I saw one of our ambulances bringing wounded from the line, blown up by a shell. Our Bde. casualties in the fighting on the 4th & 5th, K & W.\n\n\n\nOff.\n\nMen\n\n33rd\n\n5\n\n200\n\n34th\n\n4\n\n150\n\n35th\n","173":"\n\n250\n\n36th\n\n10\n\n120\n\n9th M.G. Coy\n\n1\n\n15\n\n\n\n1918","174":" Cont.\nSaw an enemy plane brought down at midday. 2 more downed in aft. by ours. Very heavy art. fire & much air fighting which our men have much the best of. On duty 3 a.m. to 9 a.m. Our 2nd Div. to attack at 5 a.m. tomorrow. Raining through night.\n\nSun. 8th\n2nd Div. attacked Bois de Hangard at 5 a.m. & drove enemy out, capturing 3 officers, 37 men. ","175":" Bde. now in close support of 5th Div. Art. fire very heavy. Enemy attack expected at any moment. Raining. Our Batts strength tonight,\n\n33rd - 444 men\n34th - 596 men\n35th - 549 men\n36th - 600 men\n\n"}}