{"Document Name":{"0":"Diary_0097","1":"Diary_0097","2":"Diary_0097","3":"Diary_0097","4":"Diary_0097","5":"Diary_0097","6":"Diary_0097","7":"Diary_0097","8":"Diary_0097","9":"Diary_0097","10":"Diary_0097","11":"Diary_0097","12":"Diary_0097","13":"Diary_0097","14":"Diary_0097","15":"Diary_0097","16":"Diary_0097","17":"Diary_0097","18":"Diary_0097","19":"Diary_0097","20":"Diary_0097","21":"Diary_0097","22":"Diary_0097","23":"Diary_0097","24":"Diary_0097","25":"Diary_0097","26":"Diary_0097","27":"Diary_0097","28":"Diary_0097","29":"Diary_0097","30":"Diary_0097","31":"Diary_0097","32":"Diary_0097","33":"Diary_0097","34":"Diary_0097","35":"Diary_0097","36":"Diary_0097","37":"Diary_0097","38":"Diary_0097","39":"Diary_0097","40":"Diary_0097","41":"Diary_0097","42":"Diary_0097","43":"Diary_0097","44":"Diary_0097","45":"Diary_0097","46":"Diary_0097","47":"Diary_0097","48":"Diary_0097","49":"Diary_0097","50":"Diary_0097","51":"Diary_0097","52":"Diary_0097","53":"Diary_0097","54":"Diary_0097","55":"Diary_0097","56":"Diary_0097","57":"Diary_0097","58":"Diary_0097","59":"Diary_0097","60":"Diary_0097","61":"Diary_0097","62":"Diary_0097","63":"Diary_0097","64":"Diary_0097","65":"Diary_0097","66":"Diary_0097","67":"Diary_0097","68":"Diary_0097","69":"Diary_0097","70":"Diary_0097","71":"Diary_0097","72":"Diary_0097","73":"Diary_0097","74":"Diary_0097","75":"Diary_0097","76":"Diary_0097","77":"Diary_0097","78":"Diary_0097","79":"Diary_0097","80":"Diary_0097","81":"Diary_0097","82":"Diary_0097","83":"Diary_0097","84":"Diary_0097","85":"Diary_0097","86":"Diary_0097","87":"Diary_0097","88":"Diary_0097","89":"Diary_0097","90":"Diary_0097","91":"Diary_0097","92":"Diary_0097","93":"Diary_0097","94":"Diary_0097","95":"Diary_0097","96":"Diary_0097","97":"Diary_0097","98":"Diary_0097","99":"Diary_0097","100":"Diary_0097","101":"Diary_0097","102":"Diary_0097","103":"Diary_0097","104":"Diary_0097","105":"Diary_0097","106":"Diary_0097","107":"Diary_0097","108":"Diary_0097","109":"Diary_0097","110":"Diary_0097","111":"Diary_0097","112":"Diary_0097","113":"Diary_0097","114":"Diary_0097","115":"Diary_0097","116":"Diary_0097","117":"Diary_0097","118":"Diary_0097","119":"Diary_0097","120":"Diary_0097","121":"Diary_0097","122":"Diary_0097","123":"Diary_0097","124":"Diary_0097","125":"Diary_0097","126":"Diary_0097","127":"Diary_0097","128":"Diary_0097","129":"Diary_0097","130":"Diary_0097","131":"Diary_0097","132":"Diary_0097","133":"Diary_0097","134":"Diary_0097","135":"Diary_0097","136":"Diary_0097","137":"Diary_0097","138":"Diary_0097","139":"Diary_0097","140":"Diary_0097","141":"Diary_0097","142":"Diary_0097","143":"Diary_0097","144":"Diary_0097","145":"Diary_0097","146":"Diary_0097","147":"Diary_0097","148":"Diary_0097","149":"Diary_0097","150":"Diary_0097","151":"Diary_0097","152":"Diary_0097","153":"Diary_0097","154":"Diary_0097","155":"Diary_0097","156":"Diary_0097","157":"Diary_0097","158":"Diary_0097","159":"Diary_0097","160":"Diary_0097","161":"Diary_0097","162":"Diary_0097","163":"Diary_0097","164":"Diary_0097","165":"Diary_0097","166":"Diary_0097","167":"Diary_0097","168":"Diary_0097","169":"Diary_0097","170":"Diary_0097","171":"Diary_0097","172":"Diary_0097","173":"Diary_0097","174":"Diary_0097","175":"Diary_0097","176":"Diary_0097","177":"Diary_0097","178":"Diary_0097","179":"Diary_0097","180":"Diary_0097","181":"Diary_0097","182":"Diary_0097","183":"Diary_0097","184":"Diary_0097","185":"Diary_0097","186":"Diary_0097","187":"Diary_0097","188":"Diary_0097","189":"Diary_0097","190":"Diary_0097","191":"Diary_0097","192":"Diary_0097","193":"Diary_0097","194":"Diary_0097","195":"Diary_0097","196":"Diary_0097","197":"Diary_0097","198":"Diary_0097","199":"Diary_0097","200":"Diary_0097","201":"Diary_0097","202":"Diary_0097","203":"Diary_0097","204":"Diary_0097","205":"Diary_0097","206":"Diary_0097","207":"Diary_0097","208":"Diary_0097","209":"Diary_0097","210":"Diary_0097","211":"Diary_0097","212":"Diary_0097","213":"Diary_0097","214":"Diary_0097","215":"Diary_0097","216":"Diary_0097","217":"Diary_0097","218":"Diary_0097","219":"Diary_0097","220":"Diary_0097","221":"Diary_0097","222":"Diary_0097","223":"Diary_0097","224":"Diary_0097","225":"Diary_0097","226":"Diary_0097","227":"Diary_0097","228":"Diary_0097","229":"Diary_0097","230":"Diary_0097","231":"Diary_0097","232":"Diary_0097","233":"Diary_0097","234":"Diary_0097","235":"Diary_0097","236":"Diary_0097","237":"Diary_0097","238":"Diary_0097","239":"Diary_0097","240":"Diary_0097","241":"Diary_0097","242":"Diary_0097"},"Date":{"0":"unknown","1":826.0,"2":827.0,"3":828.0,"4":829.0,"5":830.0,"6":831.0,"7":832.0,"8":833.0,"9":834.0,"10":835.0,"11":836.0,"12":837.0,"13":838.0,"14":839.0,"15":840.0,"16":841.0,"17":842.0,"18":843.0,"19":844.0,"20":845.0,"21":846.0,"22":847.0,"23":848.0,"24":849.0,"25":851.0,"26":852.0,"27":853.0,"28":854.0,"29":855.0,"30":856.0,"31":857.0,"32":858.0,"33":859.0,"34":860.0,"35":861.0,"36":862.0,"37":863.0,"38":864.0,"39":865.0,"40":866.0,"41":868.0,"42":869.0,"43":870.0,"44":871.0,"45":872.0,"46":873.0,"47":874.0,"48":875.0,"49":876.0,"50":877.0,"51":878.0,"52":880.0,"53":881.0,"54":882.0,"55":883.0,"56":884.0,"57":885.0,"58":886.0,"59":887.0,"60":888.0,"61":889.0,"62":890.0,"63":891.0,"64":892.0,"65":893.0,"66":894.0,"67":895.0,"68":896.0,"69":897.0,"70":898.0,"71":899.0,"72":900.0,"73":901.0,"74":902.0,"75":903.0,"76":904.0,"77":905.0,"78":906.0,"79":907.0,"80":908.0,"81":909.0,"82":910.0,"83":911.0,"84":912.0,"85":913.0,"86":914.0,"87":915.0,"88":916.0,"89":917.0,"90":918.0,"91":919.0,"92":920.0,"93":921.0,"94":922.0,"95":923.0,"96":924.0,"97":925.0,"98":926.0,"99":927.0,"100":928.0,"101":930.0,"102":931.0,"103":932.0,"104":933.0,"105":934.0,"106":935.0,"107":936.0,"108":937.0,"109":938.0,"110":939.0,"111":940.0,"112":941.0,"113":942.0,"114":943.0,"115":944.0,"116":945.0,"117":946.0,"118":947.0,"119":948.0,"120":949.0,"121":950.0,"122":951.0,"123":952.0,"124":953.0,"125":954.0,"126":955.0,"127":956.0,"128":957.0,"129":958.0,"130":959.0,"131":960.0,"132":961.0,"133":962.0,"134":963.0,"135":964.0,"136":965.0,"137":966.0,"138":967.0,"139":968.0,"140":969.0,"141":970.0,"142":971.0,"143":972.0,"144":973.0,"145":974.0,"146":975.0,"147":976.0,"148":977.0,"149":978.0,"150":979.0,"151":980.0,"152":981.0,"153":982.0,"154":983.0,"155":984.0,"156":985.0,"157":986.0,"158":987.0,"159":988.0,"160":989.0,"161":990.0,"162":991.0,"163":992.0,"164":993.0,"165":994.0,"166":995.0,"167":996.0,"168":997.0,"169":998.0,"170":999.0,"171":1000.0,"172":1001.0,"173":1016.0,"174":1018.0,"175":1019.0,"176":1030.0,"177":1031.0,"178":1032.0,"179":1033.0,"180":1034.0,"181":1035.0,"182":1036.0,"183":1037.0,"184":1038.0,"185":1039.0,"186":1040.0,"187":1041.0,"188":1042.0,"189":1043.0,"190":1044.0,"191":1045.0,"192":1046.0,"193":1047.0,"194":1048.0,"195":1049.0,"196":1050.0,"197":1051.0,"198":1052.0,"199":1053.0,"200":1054.0,"201":1055.0,"202":1056.0,"203":1057.0,"204":1058.0,"205":1059.0,"206":1060.0,"207":1061.0,"208":1062.0,"209":1063.0,"210":1064.0,"211":1065.0,"212":1066.0,"213":1067.0,"214":1068.0,"215":1069.0,"216":1070.0,"217":1071.0,"218":1072.0,"219":1073.0,"220":1074.0,"221":1075.0,"222":1076.0,"223":1077.0,"224":1078.0,"225":1079.0,"226":1080.0,"227":1081.0,"228":1082.0,"229":1083.0,"230":1085.0,"231":1086.0,"232":1087.0,"233":1088.0,"234":1089.0,"235":1090.0,"236":1091.0,"237":1092.0,"238":1093.0,"239":1094.0,"240":1095.0,"241":1096.0,"242":1097.0},"Entry":{"0":"\n","1":"\n\nReveille awakened us at 3.15 A.M. and after hastily dressing we had hot coffee and stew and jam for breakfast and at 4 A.M. we fell in in a drizzling rain and prepared to start with our kits for Wooloomooloo dock about 2 miles distant from the camp. All the camp turned out as they were needed at the dock to bring the horses into our boat. To the accompaniment of strains from the band we marched towards the dock many friends and relatives who stayed the night in camp marching with us and being joined on the route by others who were waiting for us to come along outside the gates until soon the marching column spread over the whole street instead of being only 4 abreast such was the crowd. Men and women in various stages of dress lined the route having been awakened by the band and many were the cheers and good wishes given for our future while some threw fruit etc from the windows and one good lady loaded with cigarettes passed down the lines and wasn’t satisfied until each man had received a box. The thoughtfulness was much appreciated especially the cheering remarks as there was probably not one man among us who did not feel a little glum at what he was leaving him. The last stage was reached about 400 yds from the wharf where we were halted for a while and beyond which no civilian was allowed to approach. Here the most harrowing scenes took place at the leave takings and I was glad mine had all been done when I was leaving for Sydney and not for the front when things weren’t realised so much then. We were taken on to the wharf and each man checked off and given his embarkation ticket to allow no \nauth\n unauthorised person to go on the boat and after a brief speech by our O.C. Colonel Spain in which he praised us for our good work at the camp and told us the reputation we had to uphold he asked for three cheers for us from the men who weren’t going after which we returned cheers for all our favourite officers and the camp and the Engineering Corps and filed on to the boat while the band played patriotic selections and we were shown our future quarters for the voyage after which we were allowed on the deck and watched the poor horses being led on board for about two hours and about 8 o’clock the last on board and the \nanch\n ropes were quickly cast off simultaneously with the advent of the civilians who were allowed on the wharf just in time to see the boat\n\nsheering off and to hastily throw on board some fruit etc and to catch the \"goodbye\" ribbons which were unfortunately broken all too soon. We were towed slowly out into the harbour followed by numerous motorboats with friends on board where we lay to as is the custom till noon. All this time the motorboats were fussing round and people passing in all manner of eatables and also a little \"drinkables\" to cheer the hearts of those who found a joy therein. We had a second breakfast on board at 9 A.M. which was somewhat scrambled as things were not quite in working order but nevertheless the meals provided are excellent partly owing I believe to the Board of Trade regulations. The mess room where we also have all our meals and wherein we sleep is provided with tables some seating 22 others 16 and are very comfortable and good knives forks plates etc are provided. This meal seemed like dinner to us and when we weighed anchor just after noon it seemed more like about 4 o’clock in the afternoon. We went out with syrens shrieking and getting cheers from each ship we passed and one motorboat speedier and more daring than the rest followed us right outside the heads only giving up when it became too rough to proceed farther. It was a perfect day to set sail but nevertheless when we got outside the heads the boat began pitching rather disconcertingly but we walked about the decks getting our bearings and watching places we knew passing along the South East coast of Sydney. Coogee, Bondi, were picked out & also we could see the White City. The South coast has beautiful beaches nearly all the way along with lighthouses at intervals and in the near distance hills. We passed several boats on the way and my glasses were very useful . Tea at about six and after serving my time as guard over the mess room baggage for the afternoon we were allowed to go to bed. We brought our blankets up on deck as it was a beautiful night and slept well until 6 o’clock the next morning. We have two white blankets each and a hammock which is very comfortable although I prefer to sleep on the deck in the open air if possible at all. A good few of the men were sea sick and couldn’t help smiling although it was heartless and my turn is sure to come when we get into the bight. These are our meals. Coffee & toast in the morning for 3d if desired. 8 o’clock breakfast – Porridge with sugar, stew, bread & butter and cheese and tea with sugar and milk. Dinner a5 12.30 and consists of the following – soup, meat sometimes boiled sometimes roast with potatoes and vegetables today green peas and pudding 3 times a week.\n","2":"\n\nFatigue duties until breakfast which consisted of sitting on ones haunches and debating if there were any possibilities of calling at Melbourne and the rest of our duties for the day were to feed and clean the horses. There are 340 of them I believe and only a limited number of L.H. men and all hands have to take their turn which isn’t very pleasing work down in the ammonia stinking close deck especially to men who aren’t accustomed to them and not knowing how to treat them. However it is all in the game and is got through easier if done cheerfully. Bed at 9 o’clock after feeding the horses and again slept well in the hammocks, which do not swing with the boat.\n","3":"\n\nWoke up at 25 to six by my watch and kept awake until 6 and after expecting every minute to hear the \"Reveille\" but it didn’t go until 6.25. I forgot that time changes every day on board a ship and it is rather awkward as it does not apparently change regularly. We occupied the time before breakfast with Swedish Exercises taught us by a young chap who is an expert and is going with us. I feel stiff at first but they will do any amount of good and prevent us from getting stale on the boat and I shall take every opportunity of joining in. It was our off day yesterday. i.e. We have one day fatigues next day horse duty and next more or less off and we played a good deal of bridge in the morning and after dinner we had a \"washing parade\" and I washed out my towel and underpants the rest of us learning signalling and Knotting and soon after tea I was in the land of dreams awakening however several times. The weather in the morning was perfect. The day fine and only a very gentle swell hardly noticeable on but during the afternoon the wind freshened and it became rather unpleasant and the boat pitched and rolled some. This was probably owing to our nearing the Australian Bight. Luckily I slept in my hammock although a lot slept on deck and were very sore about the hips next morning from rolling about. My first attempt to get into the hammock was disastrous and I unwillingly sidled sideways into a mess where some poor unfortunate had had mal-de-mer and after a wash and readjustment of the hammock I slept well but was awakened several times\n\nby the rattle of the dishes as they slid to the floor and the slap of the heavy waves against the boat and often they rushed right in our portholes and made a mess until someone colder than the rest got up and closed them. It was rocking and pitching hard all night and quite a lot of the men made use of the various receptacles placed about for purposes for which they were not intended. \nFrom\n \n","4":" This morning we were still pitching and rolling pretty badly and have been doing so all day although there has been no wind at all and it is really funny to see the various expressions of pain and don’t care-ness on some of the faces. Last night at tea one chap was looking particularly green and eating feverishly for all he was worth and when we asked if he was alright he replied that he wasn’t too good and immediately rushed to the deck to complete his tea in solitude. I suppose it is very unsympathetic but so far I have not been a bit sick although I am among the few but quite expect to shortly before we leave the Bight especially as this evening I \nwe were\n was again inoculated. We were on horse duties all day to-day and before breakfast we had to sweep out our lines and feed the horses and were late for breakfast much to everyones annoyance and things are very unsatisfactory as Engineers can hardly be expected to take on a Light Horseman’s duties although of course in an emergency we might do it but anyway the D.D. should have foreseen the contingency. After breakfast we were put on to clean out the stalls and a hateful job it proved and two dead horses had to be thrown out. Three more are expected to die to-night and that makes 9 for the 4 days travel. They are jolly well looked after but nevertheless only about 5% are expected to reach Egypt. Shocking isn’t it? IN the afternoon we were supposed to exercise the lot but only about 90 got done owing to the limited space and time and owing to the rotten organisation all over the ship. Hope we get better in Egypt even if it is stricter. It is rather hard trying to write with the boat pitching like she is so I will retire 7.30 and read some \"Sentimental Bloke\".\n\nI have decided to give up smoking for a fortnight and to-day is the first day. It won’t hurt me and will show how much of a habit it has grown on me. The canteen opens at regular hours and nearly all our wants are supplied. Some cheaper but drinks are 4d instead of 3d as in Sydney. Tobacco 4 ozs 1\/- cigarettes 10 for 9d with matches. I had my hair cut to-day after dinner and am now in thorough working order but I took care first of all that we had passed Adelaide although there was practically no chance whatever of calling. We are going right through to Suez that is if nothing happens but there have been so many horses die that we may put in to Fremantle to exercise the horses a bit and if I get an opportunity will deal with letters. Oh, I hope so. The horses are badly cursed here and there is great excitement when another one dies. Some of the men here swear that if they get off at Fremantle they’ll never return to the boat for several reasons that need not be mentioned but things are very unsatisfactory chiefly due I think to the inefficiency of the Officers.\n","5":" I read quite a lot of the dear old \"Sentimental and slept well and although we were pitching a good deal it wasn’t rough. I had to attend the first parade and for the rest of the day I was off duty on account of inoculation and did a little reading in the morning and a big sleep and in the afternoon did ditto and passed the evening with a game of bridge and bed at 10 o’clock. During the afternoon it became misty and cloudy and we could see rough weather was approaching and sure enough we got it last night. It rained hard and the night was very black with the sea breaking all over us and we had to have our hatches battened down but water still came in at a defective port hole and we got it bad I can tell you. All night long we rolled and pitched and it has only been slightly better to-day (Sunday). However, I haven’t been the least bit seasick but to-day had a rotten headache possibly due to the food I have eaten.\n","6":" To-night the sea looks very oily and it is dull and cold and I am quite expecting some more foul weather but we won’t be very much longer in the Bight now and I hope we do call in at Fremantle it will be all I shall think about until we have definitely passed it. It is our day off duty to-day but instead of pleasing ourselves what we do (and especially as it is Sunday) we have had to fool round all the morning on \"knotting and splicing\" and of course did nothing but the idea was to keep us employed and this afternoon we had to sit on the deck and do absolutely nothing but wait for 5 o’clock and naturally we didn’t take kindly to it. If the Officers only used a little bit of tact and brains things would be rather improved but it is wrong for me to talk as I can’t get on well enough in my present position. There is no chaplain or Y.M.C.A. representative on board although we were promised one of each and on Sunday evening a man from the A.M.C. took \nthe\n a service ans as he had experience in \"slum work\" in Sydney about 20 men listened to him in our mess room, the rest including myself laying in our hammocks and passing comments when necessary. Somehow I can’t get on with these sort of services as they seem to have too much fervour and a suspicion of hypocrisy which I abhor. If I worship at all I prefer to do it in my own way and almost invariably alone. The sea has remained about the same in roughness and we were asleep by about 9 o’clock although it is said that some of the men stayed up till 3 in the morning gambling and it was made all the easier as the Engineers forgot to switch off our lights and did the same thing for the next two nights and made it rather difficult to sleep. The latest craze on board is for the men to try and grow hair on their face most of them attempting moustaches for future use but some of the more adventurous ones growing all sorts of shapes from sideboards to Captain Kettles\n","7":" I suppose now we have nearly completed a cycle of a week on board the routine will go on more or less motonously and we may find it hard to write anything fresh. To-day we were again with our beloved horses (I don’t think) and after feeding them and cleaning them out a bit before breakfast we seemed to get on better probably as the organisation has improved a bit. We finished well before our meal hours each time and we were glad to get up on deck although there being a strong wind blowing spray was blowing about all over the decks. The night was very rough and all the movables were slid all over at a rather sickening angle and one of the men who is an old sailor was hastily hopping out of his hammock for a life belt when I woke up but I s’pose we are alright. It continued rough all night and the next morning it was still rough but I think I would prefer this to the torridness of the Indian Ocean to come later.\n","8":" our business to-day is to go orderlies for our messes and all our duties are to bring in the food and clean up afterwards the rest of the time we have to ourselves and I played bridge this morning and entered up a little more of the above. I think it would be a better plan to fix a regular time for writing and think in future I shall do it after tea. The food is still very good although I can’t get on too well with it and am probably a little out of sorts and like something sweet after each meal. By paying for it almost any sort of food can be obtained here and consequently a ‘row’ by the ‘brave Australian youths’ is pending as they argue that the stewards sell al the best of our stuff and leave us the inferior for our rations but after all very little is sold but it is just a little unfair and the crew here are a very mercenary lot. The latest is a big long rigmarole about censoring and if adhered strictly to would mean our just signing and addressing a blank\n\nsheet of notepaper but I am depending on their clemency and if they like they can erase anything that doesn’t please them but it has altered things considerably. As it was so rough last night double horse pickets were put on and I had a relief from 10.30 to 2.30. I didn’t mind it much as I had had plenty of sleep and spent the time reading up our text book and got through a good amount. our duties were to see that the horses weren’t interfered with and to report any sickness but it was only a nominal job and we had nothing to do all night. After my job about 4 in the morning a big steamer passed us so I was told and she was probably a troopship the \"Shropshire\" just leaving the West. I caught a glimpse of her next morning and she appeared very fine & big. She is 14000 tonnes.\n","9":" off duty till 12 this morning and am passing the time by reading up text books and learning Morse signalling and cipher codes which is very interesting. Still very rough and at this mornings parade 4 men were washed into the scuppers and were variously bruised by a bonzer wave. passed Cape Leeuwin this morning I think and saw land for the last time for a good while to come now. Also it was the last of Australia. At lunch time we passed two transports bound for Australia following each other closely. The first the A6 and one of the \"Clan\" line – passed quite close but the other some distance away. The afternoon was spent in moving bags of chaff from one hatch to another and in the evening after a good sea water bath read \"evolution\" in bed until 9 and it was very interesting being more technical than just a general explanation. The canteen steward who I always thought seemed a sleepy looking specimen has just discovered that his stores for the voyage are somehow or other very short and consequently after this week we shall be without nearly all foodstuffs and only a limited quantity of tobacco and other goods. Four of us have joined together and bought 4 tins of preserved fruit each which ought to last us for some time\n\nand is very much appreciated by me anyway and I am sure also the others as the food here needs some sweet to aid digestion. The only thing I appreciate is porridge and plum diff although the rest of the food is really very good. A new departure was inaugurated last night viz, volunteers were called for permanent horse duty and after some hesitation I joined. It is a regular routine job done with as soon as the last feed is given and no other duties at all are given to us and we make our own times of falling in and dismissal. it is also a job which may prove of more value than ordinary fatigues later on and is good experience and there is just a slender chance of us being paid extra for it and the ones who have not volunteered are threatened with moving large amounts of coal in a few days time. However, we can’t get to sleep before 9 P.M.\n","10":" our first day of horse duty and great dissatisfaction and argument of course but I think it’ll work alright when they get going. We have 12 horses apiece and thus 2 less than we had when we were on horse fatigue and the work is the same. Another horse died to-day. Rest of doings uneventful and shall presently retire to read some more evolution or do something until 9 o’clock. I have just been up at the bows for a breath of fresh air and already it is getting warmer. A gentle \nwi\n breeze is coming over the port bow and right ahead amid the thick dark clouds is Venus. The Evening Star, gleaming brilliantly as though an encouraging omen beckoning us on our way as we go ploughing through phosphorescing waves at our cut water. Very pleasant is the evening and I feel I could sit down there with my pipe and dream pleasant dreams but, alas, it is not for me – yet.\n","11":" We got a bad shock last night. It was fairly rough when we were awakened by a great clatter of dishes trampling of horses and general melee. It transpired that the old boat had got on the wrong side of some waves and nearly dipped her funnel beneath them. It was rather alarming and several lifebelts were hauled down but I don’t think the old tub \ncould\n sink and I feel perfectly safe\n\nalthough the old tub is continually rolling in any kind of weather. The weather is getting hotter almost imperceptibly and to-day we had an east wind following us and the awnings are being put up over the decks. \"Horses orderly\" work is getting easier and is being done quicker. The rest of the day uneventful and am retiring early to finish \"Evolution\" \"Natural Selection\" etc.\n","12":" Usual routine to-day. We were told we are 5200 miles from Suez and will take 24 more days approximately but to-day the old ship did 274 with a following wind. We were paid to-day at noon and received 11\/- the first pay of Active Service. One of our men has started writing poetry and his work has been so far on \"The Black Hand\" a company of five of the 15\/3 who buy food etc in a manner contrary to the rules of the ship and consequently are much talked of. His latest edition is a lamentation \nof\n on the wrongs of the 15\/3 who apparently have to perform everyone else’s duty including their own and the \"Ostlers\" come in for passing interest I so far figuring as \"Sister Rudolf\" who follows the vet and ministers to the wants of the afflicted. I have been introduced to the wireless operator and have had a couple of chats and hope for more later.\n","13":" The South East Trade Wind is helping us along and blowing the smoke over our portion of the decks and numerous smuts are continually dropping on us making sleeping upstairs somewhat unpleasant, but nothing else will be possible in 3 or 4 days time. our afternoon duties were cancelled to-day on account of it being Sunday and I spent the time doing my washing which wasn’t successful as it has been dull all day with a slight drizzling rain. Another Church parade was held at 7.15 and the notice to that effect intimated that a service would be held by Private Parsons! Rather funny personage and the usual show of hymns and fervoured prayer took place above at the appointed hours. A chap with a violin played up on the deck afterwards and was jolly good and I thoroughly enjoyed it all. Many went up to sleep on the deck and about 12 there was a bit of a storm and the wind changed right round and it was very rough. The sea flooded the decks several times and all who were up there nearly were drowned and had to come down and sleep here. Borrowing a blanket wherever they could\n","14":" Strong north-east wind blowing to-day but about 10 o’clock it cleared up and the sun shone through beautifully and it was very pleasant to sit in its rays. We managed to get our kit bags to-day and I was able to find some books I wanted and now have plenty and to spare. We were allowed the afternoon off to do our washing but as I had already done mine yesterday I turned out my kit and played bridge until tea-time. It is fairly calm again now and quite pleasant neither too hot not too cold. Another boat drill takes place at 8 o’clock to-night. Only the second we have had so far. The Shropshire which called in at Fremantle has just wirelessed us and we expect her to catch us up to-night. Wonder if we’ll get any news from the outside world we seem quite cut-off and don’t in the least know how this war is progressing.\n","15":" To-day we are supposed to enter the tropical zone, I believe and will be in for 7 days. It was a beautiful day with a pleasant warm breeze and comparatively calm. There was a very fine sunset with heavy dark clouds hanging over the west and fringed with a beautiful golden radiance. Schools of flying fish just before dark were seen flying from our oncoming bows and they fly about up to 75 to 100 yds at a stretch and fairly close to the surface of the water. They are hard to observe as they are so like the colour of the sea, Decided to sleep on deck to-night and after hauling my bunk out early lay on the deck with the cool air blowing and the heavens ablaze with stars. It was a perfect evening. Went to sleep directly feeding was done or rather went to bed. A row started because the lights in our sleeping quarter went out at 9.30 as per regulations which was most unusual and the unlucky corporal was counted out amid all sorts of weird cries alleged to be imitations of a farmyard and not at all bad which continued until 10.30 with musical accompaniment. We had to parade in full uniform at 2 PM yesterday and everyone was jolly glad when it was al over. Reason for parade unknown\n\nI hardly slept all night as I found the boards very hard and the ships movement shifted my aching bones all over the place until at last I was glad morning came at last. \n","16":" We were told we were to be relieved of our stable duties for 3 days but only one day will we now be off. Some of the men had been kicking up a bit of a shindy and for punishment were made work in the stables for 3 days which is considered the hardest on the boat. However, we who were relieved by them were put on lifting heavy hatch covers about which we considered harder than the stables wherefore we promptly paraded before the O.C. and struck. We were promised consideration and did nothing for the rest of the morning and when we fell in this afternoon we were granted the rest of the day off and a promise to be returned to our stables tomorrow morning so I am busy this afternoon reading text books on French & my military book and writing this up. By the way our boat is provided with a guard fore and aft whose duty it is to watch for submarines and he can generally be located under the shade somewhere reading a magazine. One of the boilers had an accident last night and as a consequence our speed is considerably reduced but the boiler will soon be fixed up I think. I resent Latitude 19° 30&min. A boxing affair is on up above and a sort of singsong with the violinist as accompanist but I prefer to stay below and write and read. Went to sleep on deck but slept a good deal better this time only early in the morning a shower of rain drove us inside.\n","17":" Still having a rest from Horse duties and in place fooled round at knottings and \nlearnt\n to form fours etc much to our annoyance but I was able to hop off and do a bit of reading instead. Learnt Auction Bridge to-night and a very interesting game. It is better than ordinary bridge. This morning we found a flying fish in the boat which had evidently in its fright flown in at a low opening & died. It is about 10 inches long with a deep blue back, and square head and has a large pair of fins at the \"arms\" and a smaller pair lower down for flying. The weather has been perfectly calm and our course is considerably west of the ordinary mail boats mainly I think\n\nto get in between the two opposite trade winds where it is comparatively calm and also to delay as long as possible the crossing the line & then to make a sudden dash which will be easier \nthan\n for the horses. Sultry last night.\n","18":" Back to stables to-day and it has been very sultry cleaning things up down there. It is getting very warm and we will cross the equator very shortly I think. As soon as we got off we had to lump chaff from different hatches and then raise some rails. My word it was hot work. Last night we were supposed to have a concert on deck but after tea we found that the piano in the saloon was too big to be got through the doors and we were disappointed. Don’t know how they got it in. Warm, with a following wind last night and sleeping on deck I got covered with coal specs from the funnel and only discovered it when I woke up this morning when a slight shower drove us in. I hate dirt of any kind like that and had to go straight off and get a wash which consists of pouring water from a dish over oneself. After tea we were enjoying the breeze on the deck when we noticed an apparent mist coming towards us which soon appeared to be a shower of rain. It soon overtook us fairly fast quickly and it was peculiar to see drops of water forming on the sea and soon it developed into a regular shower of rain which sopped everything. This is typical of the clime as during the hot weather the evaporation takes place and on the slightest cooling of the atmosphere a precipitation occurs. It was decided last night to hold a concert on deck and the piano \ndid\n come out of the saloon as it was our last opportunity of having one before Suez as in future no lights will be allowed after dark owing to the danger of Arab dhows engaged in gun-running being about but I don’t think there is any \nreal\n danger. Concert was a great success and some fine items were given also some bad ones. A topical skit on the Armadale was well received and \"Because\" by one time Sergeant George went well. The skipper didn’t turn up as he doesn’t appreciate music. It is said that he recently inherited £ 42000 but still persists in following the sea on the old Armadale, but I think it is an exaggeration. Started smoking again but the only available tobacco is awful and I am just getting used to it, (Capstan). over half-way now and I must prepare some letters for the Censor shortly. I wonder if they’ll go alright? They will all be numbered in order.\n","19":" Expect to be on shore for Easter Sunday. Last night it was rather showery but I slung my hammock on deck and the waterproof ground sheet kept me from getting wet but I wasn’t able to sleep much at all probably excited\n","20":" Church Parade this morning at 11.30 A.M. but as we had our horses to do we were excused and I was glad as it saved us changing into our uniforms. We expected to be off for the afternoon but much to our disgust we were ordered to exercise our horses and there were rumours of strikes etc but nothing came of it. I attended my first church service to-night an impromptu affair in which was much hymn singing and then an address. It was rather queer especially when various men were asked to get up and sing as solos popular hymns. In conclusion it was decided to hold a meeting on Tuesday evening to decide whether swearing were necessary and volunteers were asked to speak. I decided to sleep below to-night and it was well I did so although it was very sultry. I slept better than I ever did on deck. It came up squally in the night and nearly everyone had to come down and in addition smoke smuts were plentiful.\n","21":" It is raining pretty heavily and a good warm breeze and good weather for crossing the equator which we do I think about Tuesday or Wednesday. Keith Hodgson a chum of mine and I were signalling in French this morning and one of our three apprentices were watching us and reading every word we sent but afterwards told us that the French Signalling System was the reverse of the English and lent me a book containing the Key. it’s very interesting but I won’t have time to read it all as I have too much on hand at present.\n","22":" After our horses were finished to-day we had a hose rigged up on deck and a lot of chaps took a sea-water bath. Everyone was supposed to have one but the percentage was very small and it seems rather a senseless idea as there is a shower supposed to be always going and all the men can’t be gathered for a bath. One man who was sitting watching the proceedings was asked by a none too popular officer to go in but he refused as he had one bath already that day and when asked again he said he had a cold and later on when he was taken to the doctor his temperature was over 100 however he was arrested and to-day I believe is to be brought before a court martial. last night I had to turn in early with the rain as it was so heavy and got some of my blankets wet and this afternoon we had all our blankets examined and the wet ones put out to dry as there is a decided chance of malaria if one gets a chill owing to the humidity of the air. The anti swearing campaign or rather meeting was held last night and was started by\n\nHodgson who was dragged into it against his will but made a fair effort. It was all a joke but he has been having a bad time lately by everyone. After numerous discussions interjections etc, it was left as an open question and was carried on heatedly down in our mess-room until long after lights out. But personally it won’t affect me in the slightest as I shall swear whenever I feel inclined which however is not very often at all.\n","23":" We are to cross the line to-day at midday and I believe that many instruments of torture have been devised for the benefit of those who haven’t crossed before. It is quite clear and very warm. Later, we don’t cross the line till midday to-morrow. The performance started at 3.30 P.M. and a big canvas tank supported by a wooden structure and a sort of raised dais for the court of King Neptune. The actors came promptly on the scene and the get ups were very creditable considering the limited resourses. Mr & Mrs Neptune and daughter with an accusing clerk and a crowd of policeman. All the officers were accused and after taking a dough pill and a salt-mixture gargle they were seated adjacent to the tub at a suitable height on a easily overturned \nan\n manure basket from the stables and lathered with a white wash brush – the lathers consisting of a mixture of sea water flour and soot. A large board shaped as a razor was then passed over the affected portions and the superfluous lather wiped off on any part of their clothing after which they were \novert\n somersaulted backwards into the tub where they were well ducked. All the officers were treated and took it well and a goodly quantity of the youth around who were more or less well-known but there wasn’t nearly enough time for all. The charges were very good and also the penalties. The fun stopped at tea time (5) and the remainder \nwe\n all tumbled into the bath in such a crowd that the canvas had to be cut to let out the water such was the danger of an accident.\n","24":" It was great on deck last night. I slept under the awnings in my hammock and a bonza breeze was blowing and I slept well. We were all medically examined this afternoon and it is rumoured there is a case of measles on board which may put us into quarantine in many more cases break out.\n\nBit of dissatisfaction caused to-day as after our hard work in the stables they wanted us to go on working at rifle exercises signalling etc. This seemed unfair as when we volunteered for the work we were told we would be free as soon as our work was over and after a good deal of fuss we managed to scrape through without doing any work.\n","25":"\n\nNothing important happened. Rice and prunes for dinner and bonza steaks for breakfast.\n","26":" Washing in the afternoon and when over wrote some more letters. Five done up to date.\n\nSunday Sighted land this morning very blurred but soon developed. Passed \nCape\n Island of Socotra last night and now that is Cape Gardafui. Came directly opposite at about 11 o’clock and was about 10 miles away then but now we are within about two miles of the coast. There are several Arab dhows sailing about and have gone into the land which is apparently absolutely barren and desolate but must have their homes there. Apparently their business is fishing. The sea is quite calm and almost of a dull green. There is a long sandy is spit running out to a point which is very rugged although apparently crumbling and back from this is the Cape rising very ruggedly to a great height and having a sort of cave in the side which some of the men say is inhabited however I can see no sign with the glasses which are very useful and in great demand. It is getting very warm although there is a perfect cool breeze and I have my hammock slung on the best side of the boat to the rafters of the awnings while writing this up and soon I shall write some more letters. We shall soon be in the Gulf of Aden and expect it pretty warm. My get to our destination next Sunday.\n","27":" Saw quite a number of sailing boats about and this evening a steamer coming up astern which we think is the \"Pera\" a faster troopship to ours and which was berthed next to us at Wooloomooloo and left a couple of days later. However up to breakfast time next morning she hadn’t appeared.\n","28":" Woke up just as it was getting light this morning to see on our port side a warship lying alongside an island and then on our starboard side appeared Perim \nor\n in British Somaliland which is a naval station and has a wireless apparatus with about 15 houses. The land was very rugged and grand with little islands and headlands and rises abruptly\n\nThere was another gunboat lying behind a headland and just a little further on what appeared to be a pleasure steam yacht something after the style of pictures of the Royal yacht. We have been steaming full speed for some time now as there is a danger about. There is a Turkish fort somewhere along here which has been smashed up but which might do damage and there always gunboats about here waiting. Perim, Hell’s Gates or Straits of Babelmandeb are British and guard the entrance to the Red Sea and is not very wide. While passing through we passed a Spanish steamer the Regaypi of Barcelona quite close and I could see the name plainly with the glasses & the notice \nof the\n re the propellers. She had broad bands on her distinguishing her as a neutral and later on we passed another apparent tramp with signals flags which I couldn’t read and still further on another painted with bands of red ocher & black. Passed another gunboat this evening but too far away to notice her at all well. About 11 o’clock we started to pass the group of islands starting with Hamesh. They are very fine, uninhabited and are of volcanic origin and although they have \nsome\n verdure they are very barren and rise to a great height. They are on the port side, (Left) and towards the end there is some parts of beaches of sand and a wreck of a fairly large boat is plainly visible.. The stern and the hull are above water and the nose buried pointing out to sea and to the left are two masts sticking out of the water and apparently another wreck. Towards the end of this group \nare\n we pass between the main islands\n\nand on the right two smaller ones rising to a great height and on the tallest a lighthouse erected by the P & O Company as one of their boats once broke her back between the two latter. We could just distinguish a man moving about. To-night after tea we pass on our starboard two more islands near together with another lighthouse on the highest and flashing three times with an interval after the third. This is probably an automatic A.G.A. Light as we saw her light up. These lighthouses are nearly all Turkish. We pass these islands all along until we get to Suez and I only wish I had a good map with me as it is intensely interesting and I should be thoroughly enjoying myself if it were not for what happens at the end of the voyage. A very childish view suppose. We had a full dress parade to-day at 2 o’clock and a kit inspection covering all our goods but was more or less a farce and very uncomfortably hot.\n","29":" Uneventful. out of sight of land all day but in the evening sighted two steamers which however was too dark to see at all. Just after tea a school of 40 or 50 \nindecipherable\n porpoises assembled towards the ship and swam until dark in front of the bows of the ship, gambolling and jumping out of the water as if it were the greatest fun going.\n","30":" Awakened soon after going to bed by a wave spraying over us as the wind had risen so I went below. Turned out a very rough night and a lot got wet.\n\nThis morning the boat was pitching badly with a strong head wind and heavy sea and was quite as rough as in the Bight. Seasickness revived and I didn’t feel sure of myself as I wasn’t feeling too well. Too much supper the previous night I think. No land sighted all day but saw several boats only one of which was near enough to see at all. This was the Donalla. a hospital ship going home and she looked pretty. She is a converted P & O boat. In the evening we were playing bridge down below when somebody came down and told us a ship was passing and sending morse signals. I went up and although I read the message quite easily it was coded and couldn’t be understood. However, I saw our ship sending \"good-night\" and her code numbers. Before going to bed to-night Ludlow \nwho had\n and I had a meal of onions and cheese which he had got from the cooks. I enjoyed it very much but have a nasty taste in my mouth next morning.\n","31":" Still just as rough but I feel quite happy again now although many look the very reverse of it. Easter Friday. – I am off to-day for feeding the horses and hope this after noon to get off exercising them. it is deserved I think. Feeling unaccountably the rightful to-day and think I’ll peruse some French New Testament after breakfast. Rest of day uneventful. Wind lowering and the boat is almost steady now although the wind is still strong. Except to land about 5 on Sunday morning.\n","32":" After dinner to-day we saw land on both sides. On the right the Sinai Peninsula & Palestine and hostile country & on the left Egypt. There was a large island to start with – very high – and crumbly although rugged and with a light house on each end plainly visible.\n\nThere are many lighthouses on the land round here which is plainly visible on each side and intensely interesting with its beautiful colours but no vegetation whatever. There was a wreck plainly visible probably an Arab Dhow sunk by an auxiliary cruiser one of which we saw lying close to the Turkish shore and probably the Ophir. We passed numerous steamers on the way only one of which I could read the name. The Mansourah. these included two transports one crowded with troops and the other also containing troops and also a lot of red cross nurses. These were probably bound for the Persian Gulf & Mesopotamia. Expect to get into Port at about 5 or 6 in the morning but may not go ashore as there may not be a berth for us until Monday morning.\n","33":" Dropped anchor at 5.30. Intensely cold all night but getting warm now 8 A.M. Lot of vessels in port some troopships unloaded and some supply ships and \ntw\n one destroyer another which looks like one also a hospital ship the Nevarra. A supply ship A.57 passed us with sheep on board. Arm of the canal is seen on the right and on the right just at entrance of canal is the berthing accommodation. Straight ahead are two big camps and the town with apparently some fine square buildings and we saw some trains connecting the town with the wharf. On the left are about a dozen of apparently oil tanks. There was an aeroplane making a reconnaissance. She was a Bleriot monoplane by the looks of her. Ready to go ashore as we are all dressed in our uniforms and yet we may have to wait some time. Two launches came alongside. One the native police boat and throwing coins over on to the boat provided an interesting scramble for them. Directly after dinner we had to help in unloading the horses we had charge of and an interesting treat it was. Horses jumping about everywhere especially going down the planks to the shore where we gave them into the hands of natives who entrained them. In the morning two horses got loose and were swimming about in the water about ½ an hour before being captured. There were a mob of about 100 natives who moved the gangways and otherwise did the hard work and it was very funny watching. One man appeared to be leader and when all was ready he would chant an exhortation to the men to work and immediately they would reply with a short answering chant showing the while all the time keeping a perfect babble of noise.\n\nWe have our berth at Port Tewfich about 7 yards from it to prevent the ship hurting the wharf which is quite low and of stone masonry. When an officer wishes to move anywhere adjacent to the railway line two natives take him on a four wheeled light car on the railway. One pushing while the other sits behind and each doing shifts. In this way they go for quite 50 miles at a time running along the rails in rope shoes. Some of the natives were about selling various things such as cigarettes Turkish delight etc. Good cigarettes egyptina 50 for 1\/- but Turkish delight about 2 inches cube 6d was asked for and like an ass I paid. Only about 12 pieces in the box. But this is the only time I’ve been taken down. Everyone makes it his own especial business to rook another and I beat them down every time. Tea at 5 and as we thought we would have left the boat before all our rations had been thrown overboard and we only had bread tea without milk or sugar and a short ration of bread. We held an indignation meeting but after going on deck and having a long argument with the officer we got nothing as we had to fall in almost at once so counted him out instead and went down to the mess room and upset everything. A lot of knives forks etc went with us and some overboard. We had been docked 1\/- each the previous day to pay breakage expenses but I think we got some of our money back although I didn’t partake in any of the foolishness I made a good deal of noise and aimed a lot of bread. Fell in at about six P.M. and after getting all our things in order we went into the train – and such a train. We were crammed into an open coal truck of iron with low sides and only our kits and a few bales of blankets which only took up room – to lie on. However, I enjoyed the first part as I made myself fairly comfortable reclining and watched the scenery. We backed into the main Suez station for water and then set out. There are numerous guard bivouacs all along the line and quite an encampment at Suez oil tanks (Petroleum). the houses are some of them very good of 4 or 5 stories with flat roofs and apparently comfortable. We passed a mosque with a beautiful ornamental minaret and it looked very good for such. The moon was up all the way and it was cool and altogether not unpleasant. We followed the canal nearly all the way to the Mediterranean and stopped at nearly every station to let other trains pass. Stations all seem to consist of a few tents and perhaps a house or two and all seem to be oases with palm trees and water canals the rest being sandy desert all the way and undulating. The line is raised above the surroundings to guard against sand storms burying it and 4’ 8 ½ guage and the trains (passenger) travel very fast – believe doing 87 miles in 2 ½ hours with stations included. The canal was quite close and the fresh water canal fed from the Nile runs along the line all the way. Many searchlights are stationed at the canal and were flashing in every direction and\n\nsearching the desert and also every ship that went through carried one. The only other place of interest which we passed after striking west a little before the end of the camp was Ismalia where a big camp is quartered and is a fair sized town as well and where we can spend our week-end leave. In the evening before leaving Suez a hydroplane (Biplane) flew over the town to reconnoitre. it is 56 miles to Tel-El-Kebir and we were travelling from 7 to 2.30 A.M. 7 ½ hours! it became intensely cold before 12 and blankets were got out but I didn’t get one and to double up and after taking off my boots rest as well as I could. We arrived at 2.30 and after a lot of fuss the rest left at 3.30 and left us to guard the tents and baggage and my feelings can be imagined. The station is fairly bug and although the place appears small (town) there is I think a native town across the canal where there is a pretty green looking irrigation area watered by the Nile canal and with date and oranges. There is a bazaar and interesting things can be bartered for although one must be very careful and we are forbidden to go beyond the railway station on account of the liability to disease but we bought one tin of pineapple which however tasted rotten and cost 3 piastres (P.T) (7 1\/2 ) and is about ½ size our tins.\n","34":" Ten men were left on guard and after gathering the baggage together and having an interesting talk with a native who was well read but hasn’t been beyond Egypt we decided to do ½ an hours watch each & rest the remainder. I went on at 4 and at 4.30 being dead tired and very cold went to sleep until 6. The nights are very cold and the days hot although not unbearably hot yet natives flocked round us and sold oranges and buns but I thought it inadvisable to buy any. Oranges 3 for two piastres (5d) and fairly small but they eventually came down to 3 for 1 or 2 ½d. Paper pages very little news ½ P.T (1 ¼d). The canal is used by the natives for washing themselves in and drinking and for barges although only about 30 feet across for carrying stone timber etc about and are rigged with very long bamboo masts and sails. Donkeys are largely used and the tiny little beggars sometimes carry along two hefty men at a time and always walk. also we saw a few camels used to carry stores etc to the camp. Natives can be hired cheaply to do ones business such as carrying or anything else and can always be found in the camp although they are always passed in after being examined and have a badge. They have taken as a whole a very low and disgusting code of morals and I hate the whole business. We were very tired and felt disgustingly dirty when we woke up in the morning and only at 3 o’clock did some men come down from the camp for the bully beef and biscuits and left us some. It was good corned beef and the biscuits weren’t bad and we have still a stock on hand which I keep for emergency.\n\nThe men had to make 3 trips before finally getting away all the baggage which after dinner and we had another meal of biscuits at the station. When we got down to the camp no officers appeared and after pitching a tent in the hot sun we were told we were to move about ½ a mile away which we did late in the afternoon. This camp contains all sorts of miscellaneous and lost men and I really think very few know of our presence and don’t care until we are drafted into our respective fighting units. The organisation appears to be very rotten and so far we have done absolutely nothing for four days and they say we do no engineering work here but to waste time. We have a bell tent with first of all 2 sergeants and three men and now six men with our own picked comrades so we are alright. The ground is all on the slope but can be made comfortable. The camp is very extensive and runs for miles in every direction and I haven’t got the run of it yet. There are native shops of every kind but are primitive and crude and include Russian and Indian tailors barbers stores and all sorts and Y.M.C.A’s.\n","35":" Reveille at 5 and first parade at 6 and I was orderly for the first half of the day but them permanent orderlies were then appointed, good food so far but not sufficient tea. Water is not advisably to drink the doctors tell us and it is too dear buying soft drinks all day and besides they are not satisfying so a man is in a bad way and has to drink as little as possible. Anzac Day to-day and some good sports were held which however I didn’t go to as I tried unsuccessfully to make up some sleep and we had the day off to see them. There is a picture theatre quite close and is 3 & 5 piastres with good pictures and towards the village is a circus (good) for 1\/- and up on the hill a stadium free & good matches. Got our dinner at a native \"restraim\" and 3 piastres for 3 fried eggs and tomatoes & ½ for cup of coffee.\n\n24.4.16 Morning entertained by a juggler who made some good money out of us but his tricks were very good but nearly all sleight of hand.\n","36":" Detailed for fatigue work in the morning and after breakfast went down to the native bazaar to get a watch of Hodgson’s. There are some beautiful pieces of work of art but these are cheaper in Cairo and I am waiting and will go to see all thoroughly again soon however. Hospital train ran through this evening carrying wounded from near the Canal and there has been some scrapes there lately I believe. Spent the evening in looking for drinks and drank too much and must go easier to-morrow.\n","37":" Woke up with a taste \"like a sewer\" and did nothing but sit about from 6 to 8. Tis breakfast and we don’t parade again till 11. on account of the heat. Parade 11-12 and then again from 2.30 to 5 but I think we have a weekly half holiday to-day Allen & Thomson in charge both from Moore Park. The mess-rooms are of split bamboo which keeps out the sun and are very cool. Have met a university chap and a school chap so far. After dinner I finished reading Methuselah and about 2 we went to look at the village and any other interesting things. A water wheel used to pump water from the branch of the Nile Canal\n\nwas worked by an old cow whose eyes were bandaged and walked around in a circle and when tired was exhorted by a native with a long drawn Ah-h-h The wheel raised water quite 7 feet and was ingenious and well contrived although whether designed by the natives or English is unknown. Barley and all sorts of grass are grown and further back where we are not allowed oranges and other fruit. An Archimedean was also used but this was not on view as it was being used somewhere else. The bazaar had several shops selling lace and silk finery but it was too dear and things are purchased cheaper in Cairo but they were very fascinating all the same and some goods I saw were £ 2.5.0 a shawl. On the way I saw Jack Johnson who gave me some of his experiences on the Miltiades which called in at Colombo, Fremantle and also into the land when an auxiliary cruiser of the enemy was about. They caught a monsoon and it was so bad that the wind tore up some of the deckhouses and some of the poor men were caught and killed by being bashed on things. he said it was ghastly with pieces of flesh lying all about the deck. He hasn’t been in action yet but has been in several camps. We then walked up to the cemeteries one a comparatively small one yet containing the men who have died here and the other with various trees in it with the men who fell at the battle of Tel-El-Kebir, Cassassin, and Ismailia and in which fought Gordon and Wolsely. The water station is just at the left of the station and has 3 Tangye oil engines of almost 15 horse power each for pumping the water from the artesian bores to the camp and for purifying it. We gave in our requisition for our summer clothing to-day which consist of khaki drill slacks and tunic. No letters turned up yet but I know there is one there written before I left from Melv, but I can’t get it although another chap actually saw it there. Going to bed early to-night to make up. prices are very high here and a man has to be continually on the lookout to prevent being rooked. We have a mascot, a donkey bought for 11 ½ pt and black about the size of a medium goat.\n","38":" Fell in at 6 this morning and went for a long march until 8 o’clock round the East end of the camp which produced a good appetite for breakfast. We bought two little cucumbers for ½ a piastre or 1 and they were very sweet. We were told to fall in at 9 but didn’t do so until 10.15 and then\n\ntold to wait round until inspection at 11 directly after which we were dismissed until 2.30 and played bridge until dinner time. In the afternoon parade 12 of us were told off to go on fatigue and we went to a wash-house and sat down until four o’clock when we were dismissed \nuntil\n instead of 5 o’clock. We went to the pictures in the evening but it wasn’t much of a lantern and the pictures were all French by Pathe Freres. but also translated as well as in French. One picture of Charlie Chaplin which I saw at the ‘Pav’ when going to the University. Men for leave were read out to-day and I wasn’t among them. But may go next week. Only 3% are supposed to get off to Cairo each Saturday and 2 on Sunday. No letters appeared yet.. There was a bit of fuss \nyet\n last night and all the native bazaar was burnt out by men who couldn’t get enough liquor. All the silks in the Curiosity Shop went.\n","39":" This morning we went for another march round the West end of the camp and saw the orange gardens. Eggs for breakfast 3 for 1 or 2 1\/2d. Nothing to do till 9.30 parade. When our Sergeant called another man & myself out to parade at the Orderly Tent where we had our names taken for military policemen while we stayed in this camp. Rest of the afternoon we were off. Thought over it during the afternoon and decided to try and dodge it if possible as it is a beastly job and I desire to try for my stripes. Played bridge until 9 o’clock and then talked in bed for an hour with Ludlow who had been to Cairo. Disgusting -.\n","40":" Got up for Church parade at 7 before which I went down to see the sergeant of the Camp Military Police and managed to get off as another chap chum of the person called out with offered to take my place & I was jolly glad. 4 competent surveyors called for to-day and I think I’ll try my luck. Church Service was rather flat but taken by Rev Perry of Norwood Football Club who was in camp at Mitcham when I was there. Fair address and communion after breakfast in Y.M.C.A. which I’m not going to attend – writing and reading instead. Number of our men visiting Tel-El-Kebir battlefield to-day about 5 miles away but I will go later. To be inspected by the staff officers including about 5 generals, and a mob of captains, lieutenants and Indian Officers. Spend the evening reading Tennyson and writing letters. Sent in my application for surveyor but many applied and I hardly like my chance.\n","41":" Ordinary Fatigue work all day shifting bundles of hay and corn. Eileen’s marriage paper from Home Notes in the afternoon came by post. Oh, joy, at tea time 10 letters came for me. I nearly went mad and have fad a headache all the evening from reading them. 4 from Melv, 3 mother 1 Eileen 1 N.A.R Sydney and one from Headquarters.\n","42":" Another short march this morning with a large rest in between under the guidance of our worthy sergeant. No chance for surveying party. One corporal from our crowd gone & 30 others are picked. However I had an interview with Lawrence the lieutenant who promises a chance for stripes if any vacancy occured but I don’t like my chances. I haven’t enough crawl. Inoculated in the afternoon and spent the rest of the day writing letters and didn’t get up till late next morning.\n","43":" Wrote a letter before breakfast (9 to-day) to Melv. inoculation not troubling me much. Bought a book of postcards last night for 6 pt. 1\/3 24 Writing to Fate S.B. off duty all day passed by bridge and reading and letter writing. Feeling pretty crook in the afternoon and a bit feverish in the evening due to inoculation and I think bad water. Arrival of another batch of Engineers by the \nMiltiades\n \"Macharine\" including Harry Tuck looking well but a horrible old gas-bag fowl.\n","44":" No first parade and after breakfast we had a medical examination and afterwards were paid 10\/3 or 50 piastres Usual half holiday in the afternoon but we didn’t recognise the fact and played bridge expecting the whistle to go any time. Played bridge all the evening. Got my boots repaired in the afternoon by the natives in the native bazaar free and it was just as well as they were the only pair and nearly worn out. Dave Griffiths in our tent a bonza chap has to return to the base with trouble with his right lung and may have to return to Australia.\n","45":" Exempt from first parade as we go on guard at 10. new man in our tent. Rather good-looking but appears a really bad egg to me and is suffering from cold feet. Doesn’t appear to be attached to any unit and a new row of tents being set up next ours last night he evidently lost his way and hasn’t appeared yet. Guard alright and I got some good sleep. On guard for first relief but saw the O.C. who told me I had been promoted to Corporal and henceforth I only had to mount a fresh guard every two hours. Some of the men are regular pigs and although got through my job alright there was a terrible growling if one man happened to be on guard 5 minutes over time. However the dissentients were all from another reinforcement.\n","46":" First parade this morning about 70 men were called out of various trades to be in readiness at any moment to depart from here. Destination unknown, probably France or England though and 3 officers with us. I am classed as a miscellaneous man and may lose my stripes but may gain more and I think it was chiefly because I had them that I was chosen. Very warm to-day and we have the afternoon off as our relieving guard was 1 ½ hours late on duty.\n","47":" Church parade this morning at 7.30 A.M. in charge of an Anglican minister but it seemed very flat especially as the crowd was so great that very little could be heard from where we were. A lot of our men have gone off this morning to Cairo as there were no parades without passes but I am writing and reading instead. it is rather dangerous although I wanted to go badly it might jeopardise my stripe if I was caught. later military police all along line, looking out for men breaking leave and I am wondering how they’ll get on. Spent the day writing letters and reading. This evening band played for a while just outside the tent for the benefit of the engineers.\n","48":" First parade this morning the selected men for overseas were checked as several had been dropped. I got the shock of my life when my name was ommitted and that of another Cox put in. In fear and trembling I approached the officer who thank goodness said there had been a mistake and the wrong Cox put in. It was rather rough on him but I was jolly glad. We then had a kit inspection and afterwards moved out camp about 300 yards away before breakfast at 8.30. Fell in at about 9.30 and had our tents reallotted to us and had to shift our belongings again. Then parade over from 10.30 until 2. Fell in at 2 to go over to the doctors to be inoculated for the second time which we did to the A.M.C. about 600 yards away. When we got there we were told the inoculation wouldn’t take place and came back and were dismissed about 3. Since then until now 7 I’ve been writing letters in the Y.M.C.A. Very warm to-day but to-night a strong cool north wind blowing and dust is everywhere.\n","49":" Fell in at 6 and I had a squad of 10 for fatigue cleaning up our lines until 8 o’clock. We were told we wouldn’t fall in again that day and repaired to the YM.C.A. for a game of bridge. However, half-way through we were called up to fall in to be instructed that a parade was to be for 4 for rations another at 5 for kits and fall in for train at 9. Fell in again at about 4.30 got two oatmeal or bran dog-biscuits and a tin of bully beef for 24 hours ration and then put out our bags to be carted away to the station. Tea at the \"Resturan\" and after variously wasting time fell in at about 8.15 and marched off after a brief speech by the O.C. Arrived at the station at 9 and started at 7 minutes to eleven going about 20 yards; however we made a dinkum start ½ hour later. We were again in open trucks but much more crowded this time and I had to sleep upright\n\nwith another chap sitting on my boots. Needless to say I slept little and the coal smuts covered us from foot to head and we saw again nothing of the country. Fairly cold towards morning but the overcoat made everything alright.\n","50":" Woke up at dawn just as we were entering the outskirts of Alexandria which is swampy with shallow lakes whereon fishermen in flat bottomed boats were fishing by the score. The land grew a high sort of reed very like sorghum and Alexandria itself from what we could see of it is a very big place. The train took right to the wharf where our steamer lay and after a short delay we went on board the \"Caledonia\". She is about 12,000 two funnelled fast and a very excellent boat taken all round and has a twelve pounder aft for submarines in the Mediterranean. The second and third saloons are used as troop decks and the officers quarters are really fine. Arrive about 6.30 (120 miles) and we have on board all sorts of troops and things are very crowded in the mess rooms. I was hard at work all the morning organising the messes and everything was in a horrible muddle through the inadvertence of an officer. However things are nearly right now. We left dock at about 4 and are now waiting outside to depart and I am going straight to bed as I am dead tired and have slung my hammock on the next to top covered deck and is very fine position. Our little O.C. (of the infantry) is a very nice little fellow – quiet and tries hard to do all in his power for his men.\n","51":" Stayed out in the stream all day yesterday and left this morning at about 7. Later on we learned there was a \nsubsam\n submarine just outside but we happily missed it. We wear lifebelts continuously except at night when we use them as pillows and all lights and matches struck are strictly forbidden even pipes and cigarettes alight are not allowed after sundown. our course is a zigzag one and we are always changing thus making it difficult to get our position. The boat Caledonia Anchor line about 12000 is a beauty and can rise to 20 knots usual steaming being 16\n\nThe first class accommodation now used by the officers is very fine and some of the troops the artillery use the third class part and have separate cabins. There are a good crowd of New Zealanders on board and they apparently get the best of everything but we aren’t growling. Alexandria is a fine port. A large open one with wharves and the entrance being only about a mile or two miles across and all sorts of shipping are in the harbour. From sailers to the largest Atlantic liners. our convoy consists of 5 boats and an escort of one destroyer which occasionally comes into sight and has a look a look at us but I haven’t seen her lately. Three boats I think were bound for Salonika and she may have gone with them. our sister ship is the Scotian with the other division of our engineers draft. We have seen several destroyers about here and yesterday we got a very nasty feeling. We saw a destroyer coming up towards us and apparently chasing he a weird looking affair with only a small part of conning tower visible. It proved to be a submarine but whether captured or British we couldn’t tell but probably British. She was travelling fairly fast with her escort and giving off a cloud of brown smoke from her petrol engines. We have passed innumerable boats on our way although for a time we were well off the ordinary route and saw little. Yesterday we saw land","52":" on the port (left) in the morning and on the starboard in the afternoon probably Corfu and Crete. Their coast rises very high and snow could plainly be seen on the top. A very fine voyage so far, perfectly calm with a gentle beautiful breeze and sunny although in the morning it has been rather shivering with only one blanket in our hammocks. nearly all of us sleep on the various decks and directly after tea there is a great scramble to secure their respective positions. our meals before to-day have been good but dinner to-day was horrible, and I had to buy some biscuits in the canteen. Reveille at 6.30 breakfast 7 Parade 1 hour 9.30 dinner 12.30 and tea 4.30 completes our day with here and there an extra parade.\n\nOne test alarm was given yesterday after tea and the officers were so disgusted at our slowness that they say the next one will be at 3 in the morning. We have also had one dress parade and to-morrow there is a medical inspection prior to our leaving the boat. There are supposed to be 4 cases of measles on board and we may be quarantined.\n","53":" Supposed to have a church parade this morning at 9. one for Presbyterians one for R.C. and another for Salvation Army. However there wasn’t nearly enough room on the decks for everyone and we arrived late. Passed a small sailing boat this afternoon and we also have on our right what I take to be Sicily as I think we passed Malta last night. Our destination is still unknown but probably Marseilles \nas\n but however some cargo we have on board is consigned for Plymouth and we may go on to England. We have a man on board who was with the Engineers on Gallipoli and I had quite a long yarn with him yesterday afternoon and he seems a bonza chap and was the companion of a V.C. and D.C. man on the Peninsula. The islands we are just passing are Gozen and Malta. First named being a German concentration camp where German prisoners from all over the place come.\n","54":" Nothing unusual except bad food and we are getting used to that now.\n","55":" Fairly rough since yesterday. Only a heavy swell however and not many were sick. Weather is perfect and the boat excellent to sail in. Had to take a fatigue party after breakfast to clean up our deck. The stairways were very slippery and one man spilt the tea coming down and another the porridge and our nailed boots made everyone slide down unless very careful one poor man negotiated 3 steps safely and completed the rest on his back and hands. Had a full dress preparatory parade at two to-day and prepared our dry rations for disembarkation to-morrow although we expected to leave the boat to-night. Our latest idea is that we are going to Shorncliffe in Devon overland to Calais. Our dry rations are bully beef, marmalade, condensed milk and a tin containing squares of oxo or beef extract sufficient\n\nto make about a pint of beef tea and also a mixture of tea and sugar sufficient to make a quart of tea. We sighted the coast of France this afternoon and came into harbour at 4.30 where we are awaiting in mid-channel the medical officer. A Frenchman as pilot and when he was going off I bade him Bon Soir and he returned the compliment very volubly and with much waving of arms. The land is very rugged in approach and a lighthouse on the left guides us in. The cliffs on the right are studded with forts and right in the entrance is an island with some heavy forts. On the port entrance is a submarine base and the whole is a naval base although there were only a couple of small T.B.D’s visible when we anchored. Right on a high hill is a church and a tower caries a gilded figure of Christ and directly below another imposing looking church. The city looks very beautiful with fine buildings and electric cars run all round the place and railways go away from the city over the hills all being cog railways on account of the height of the hills. The shipping on entering is not visible \nbut\n on account of being hidden behind the wharves and is very extensive when you come into view of it. The city is very beautiful on the West side and beautiful green lawns and tree studded \"maisons\" run down to the waters edge. We saw some French ladies to-day. First ladies we have seen for a very long time and the look very chic and pretty. A mail boat passed our anchorage going out and she had on board a very miscellaneous assortment of French people clad in all sorts of various gaudy garbs and cheering us all the way. There is a very fine suspension bridge over a branch of the wharves and other bridges turn on their centres allowing boats to pass on each side. There are two boatloads of troops just near us each waiting to be unloaded I suppose. An Italian transport was torpedoed yesterday in the Adriatic and at first we thought it was our sister ship the \"Scotian\". We shall have an excellent opportunity for viewing the country to-morrow if we travel in the day time but it is a very long journey and hope it won’t be hot.\n","56":" Got a good sleep last night and felt fresh this morning. We were dressed straight away and remained so until we disembarked. Nobody had the slightest idea where we were going and we were waiting on the boat deck about 2 hours before getting off. During this period we carried our kits up and down three times by the \"foresight\" of our brilliant N.C.O’s but at last we took everything with us off the boat and then had our black kits taken on by motor transport. We collected some biscuits and other rations on the boat to last us 24 hours. I was sent out as marker on the wharf for our crowd and after hunting for about 30 mins for my place found it and waited until our crowd came off and were led gaily past me by an embarkation officer and I had to chase them. Waited sitting on our kits for another hour and a half and then all being ready we set out for a march and went for about 3 miles to our camp for the night. The route led mainly along the sea frontage and of course we were objects of curiosity all the way. Going was fairly difficult and led to much uncomfort for the fatter members of our party but on arrival I felt quite fresh and revelled in the site of our camp. Arrived about 4. Camp was in a little dale most beautifully situated among houses having lovely gardens full of trees and shrubs running right down to our boundary and a look out over the forts and submarine base of the harbour. The tents were pitched in long green grass and left an impression of beauty I have \nm\n never seen before. Nearly as soon as we arrived many of the chaps started an immediate search for \"exits\" and a crowd got out – meanwhile I had clambered up a high stone garden wall and started a conversation with 3 other men with 3 French girls \nwit\n in very bad French. However it was interesting until they had to go to tea promising come next day but we had gone by then. We came down and after grabbing some tea heard there was open camp and immediately walked to the front entrance and passed out as there were no sentries. About six of us \nespied\n went together but I soon espied a car and hung on with a mob the rest of my friends being unable to obtain a foothold. Rode right into town and first proceeded to a watchmaker and got my watch fixed and then viewed the city. It was some time before I reached the main street the \"Bourse\" but it was fine. Restaurants and cafes were prominent and further on were the Boulevards with plane trees and shops on each side fine wide streets and the electric cars run either way. At the top is a fine cathedral but name could not be found out. I had travelled a good way and finding that the last car left at 9 asked at a shop for the stopping place and found I was too late. I was waiting outside a restaurant when I saw a chap of our reinforcements and went inside and there met three sergeants and a warrant officer 3 being New Zealanders. We formed up and\n\nwent for a further stroll. First though we tested the French vintage and found it excellent but of course only took a little. Some of our men were making free with the beer and there were several arguments in the streets but we steered clear and met some girls whom we spoke with for about an hour. very decent although they couldn’t speak English & I had to act as interpreter. One was in a sort of Girl Guide uniform and we left them about 11 for home. On the way we met some officers patrols who instructed us to proceed at once to camp but some other men in the ranks came along and we were supposed to escort them home. However, we dodged that and walked home about 4 ½ miles at a good pace knowing we would be \"done\" if we stopped and walked through the gates at a quarter to one. No one apparently being about and went to bed dead tired.\n","57":" Some of the early home men last night got up at 4 when it was light boiled some tea & when we got up we had it and soon after the Reveille went \"at the double\". We were all soon ready. Left all our kits to be carried by the transport & left camp about 8.30 picking up on our way two of our men who had had a night out in town. Boarded the train about 9.15 and in the interval before we started our journey (10.25) I hopped down to the barricade and \npurch\n engaged a small boy to run and get some French vintage for the journey. Got a bottle for about a franc and settled down in our carriage. We were \nten\n 8 in a carriage third class which normally carried 10 so we had plenty of room. There is only one window (on the door) and the seats are cushioned. First class for the officers which appeared only middling carriages upholstered with lace. The expresses have better carriages generally corridored and go at a fine pace right through from Marseilles to Boulogne and Calais. The engines used – a number being Belgian ones are very fine and large a notable and ingenious feature being the valve gear and link motions all controlled and worked off the coupling gear by a contrivance (parallel) securing straight line movement for the valve. We followed the coast for some distance and beautiful views were obtainable of the coast and cliffs and town. We passed through two long tunnels the second being quite the longest I have ever thought of. The country soon became very beautiful and Southern France is at its prime at this time of the year. green everywhere contrasted by flowers of every sort and colour. Trees forming beautiful copses of every kind and undergrowth, making the place heavenly and cool streams running through which would make ideal picnic places and camping grounds where one could loaf all day. Hawthorn was just flowering and beautiful scents were occasionally wafted towards us. Our stops were fairly frequent although not too often and our meals were always taken at a station or siding making it all seem like a picnic. This is being written on the 26th & I can’t remember all the stations we passed. The wine went well and we had plenty to eat purchasing French bread which was very excellent. I was cramped into a corner for the first part of the night but later another chap sat up and I soon took his place and got some sleep. Next morning we were able to get a good wash with cool water\n","58":" Lyons was passed but I didn’t see it and the rest of the day nothing happened that I can remember. We didn’t go to sleep until late to-night as we thought we might be getting off. However, went to sleep at last and passed the outskirts of Paris at about 3.30 in the morning waiting about an hour before we could clear our line. I was asleep however. Country still beautiful and always varying but the south is a long way the best. Some fields have plants thick with crimson flowers, clover yellow and red poppies abound and along the line big white daisies abound.\n","59":" Several alarms about getting to our destination but still going. Passed Sens a big railway centre with every conceivable type of engine. Later on a flying school with various machines. Two in the air this was in the early morning. last big stop was Amiens and the beautiful fairly like cathedral could just be glimpsed as we were passing out. We had breakfast and some cold coffee brought by English nurses and some convent ladies who gave us each a small souvenir. We arrived at our destination Etaples at 4.30 and soon after getting off moved to the camp where we were at once issued with rifles and soon after arriving about 3 miles to our camp from the station we carried our baggage over and got up our tents and went to bed at about 8.30 at dark. Didn’t feel half as fatigued as I expected. Camp is a very large base with about 23,000 men and men go to and from the firing line here to Armentiers about \n40\n 60 miles away. Very handy to Boulogne and Calais and all sorts of troops are here camped close to the railway line with a little stream running through down to the sea and we get all our water from it. Sandhills nearly surround us and we are limited to the confines of our own camp. Drinking water is filtered from the stream and we bathe and wash our things in the other portions. Clothes are washed by French girls who come round and do it very cheaply. The training camp is in the sandhills and men go down for 6 hours training daily from 8 to 2 and 2 to 8. All sorts of training from practical field gunnery to bomb throwing and the place is well set out. The camp is easily the best I have ever been in.\n","60":" Woke at 6 and felt refreshed. Aeroplane passed over and gave us a bit of a scare but it was only a French patrol but about a week ago several bombs were dropped by Zeppelins on their way to England. Parades at 6.30 about 10 minutes to hear orders and then from 9 to 12 and then 2 – 4 except on days when we are in the \"Bull-ring or in other words up in the training camp. There s a good Y.M.C.A. and canteen\n\nwhich supplies goods at (to us) ridiculously low prices. All goods are sold at manufacturers prices as there is no duty and there is every imaginable think going to be purchased.\n","61":" Training in the Bull ring of lectures and bayonet fighting and done by skilled instructors who have been to the front and have been made sergeant instructors. A French patrol airship passed over this morning and she is a regular ship observing for submarines in the channel.\n","62":" Two dress parade inspections and another go in the bull ring\n","63":" This time for the front. Of course, we failed. But the whole exam was in consequence of our N.C.O’s saying we had had 9 months training. We made a mess of the whole show through the N.C.O’s who know very very little of their work at all and are very unpopular.\n","64":" In the evening after our drill we went for a steam bath. It is near the station in the main camp about 3 miles from here and run by the A.M.C. 3 boilers supply steam and after we had handed in our clothes and given a check we went into a room filled with steam and stayed in about 3 or 4 minutes but I stayed in all the time about 12 minutes. It cleaned us well and we passed out had a warm shower and then a cold one and marched home clean. Sunday 22.5.16 Church parade at 9 and conducted by a Scotch man. Very good service.\n","65":" No aeroplanes to-day. Went to the bull-ring to-day at 8 and as soon as we got there the N.C.O’s were called out separately for instruction and first we had the Mills hand grenade No 3 explained and then the Stayer rifle grenade No 5. Had practice in throwing live bombs but not rifle grenades as an accident occurred lately and they are too dangerous. Then machine gun instruction and practice I let off 2 sho9ts each time twice and got 3 bulls and an outer but very few got one shot off. One man as many as 7 before he could stop. Lewis machine gun fires 67 rounds in about 4 ½ seconds. Got back and had dinner and rested until tea at 4.30 feeling pretty tired. No pay since the 29th of April and now I have had to borrow even tobacco. However I got 5 francs which may carry me through. We receive 29f for notes and 27f for gold coin normal peace values being 25f 20c. So we do well changing. Bought tobacco and went early to bed.\n","66":" Took our blankets out on parade this morning and the N.C.O’s came back to gather any loose ones as we only have one blanket each and it is very cold at night but couldn’t get any more. Rest of our mob went down to the shore for rifle exercises while I took out some men for fatigue and finished at about 10 spent rest of morning writing this up in the sun and it is fine out.\n\nTook a fatigue party to clean canteens and saw a French aeroplane making a reconnaissance which passed back over the camp. Rest of the morning we did nothing. In the afternoon we fell in at 3 instead of 2 and carried some boards down to the Q.M.S store for our tents. Changed tents again. The airship passed over this morning but a long way off. This afternoon 4 French biplanes flew about the camp and returned towards the firing line. No pay yet and I havent a cent in the world. 5 francs borrowed from Ludlow have gone but we are to be paid to-morrow for certain – so they say. Bed early feeling fatigued\n\n27.5.16 Bull ring at 8 to 2 and as we heard no bugle some of us had our names taken. Ordinary aeroplane and airship patrol to-day and in addition 5 biplanes were circling near here nearly all the afternoon. Bull ring. 1st Gas helmet lecture and trial. Bad lecturer. Practice made it seem very difficult to wear them but it gets easier they say. Next. Blowed if we weren’t all taken out and given saluting by numbers! Talk about being disgusted. N.C.O’s were supposed to parade for separate instruction but our beasts of N.C.O’s \"forgot\" to call us out & we had to suffer with the rest. Next. Instruction in grenades which we had done twice previously. The bayonet fighting fair. Afternoon attended to some mending and got back my washing very well done for 1f 20c or 2d per piece. Rotten headache in the evening so went early to bed probably due to touch of the sun.\n","67":" First parade this morning N.C.O’s were called out and dismissed and the men asked concerning their opinions of the N.C.O’s. However, only two were spoken of with heat and I wasn’t one of them. Church parade at 9.30 and I had to march the Engineers to the parade ground. Australian parson bit flowery although not bad service. Had to take a guard for quarter-master and after dinner had a bath and cigar. Wrote postcards to catch the mail and finished sewing on buttons. Got two extra blankets and ¼ lb of dates and an issue of tobacco 2 ozs \"Royal Seal\" or 3 ½ boxes of \"Three Witches\". Airship patrol passed quite low over Etaples to-day after dinner.\n","68":" Airship patrol again. An airship passes regularly everyday but of course the airships aren’t the same every day. Won’t mention again unless unusual. French class starts to-morrow evening by a parson who has lived 40 years here. Borrowed a military engineering Pt 3 (bridging) from a chap in our tent. Bull ring at 8. First operation bayonet fighting. Fair. Then company drill by a captain who evidently thought we had never drilled before. Me platoon commander as I couldn’t join N.C.O’s class as there were too many applicants. The rapid loading dummy bullets. 15 to 30 seconds. Then extended order drill. I had a section, dirty work lying on ones stomach every 10 yards for about 100 yds or more. Cleaned rifle this afternoon for 1st time. Troops being rapidly led to firing line trains going up every hour. Very much traffic on this line and about 22000 men in camp here.\n","69":" Bull ring at 8 A.M. We weren’t really wanted but our N.C.O’s made a hash of things as usual. First part of morning route march on main north road towards Neuve Chatelle. It had been raining slightly and made marching pleasant as it was dull. Passed through Camiers and on to La Touquet crossing the railway line where a French reserve man presented arms to us in their peculiar style. Halted at an open space at La Touquet for about 20 minutes and the instructor gave us a lecture on prevailing trench conditions here. All instructor sergeants are returned men who have been right through it and are thoroughly experienced and supposed to be here for a rest. The villages though small are very interesting and old fashioned and Camiers possesses a fine new church with a clock tower. Statues of the Crucifixion were in several places and old church rites seem to be prominent. The road is very pretty going through fine avenues with wooded country on either side and we all enjoyed it. The Engineers led back. I was leading corporal and the instructor complimented us on our return. Next half of morning 11.30 to 1.30 we spent in the trenches which although not extensive \nwas\n gave a very good idea of the real thing. I had charge of a platoon of 40 men and had to take them with a guide from the reserve to the firing bays. While they were waiting I had a good look at all the dugouts etc. After dinner our sergeant came round and wanted me to take out a fatigue party of 10 men for the Q.M.S store. I had the deuce of a job to get them as they had all wandered off after dinner. Took them down and when I got there – found they weren’t wanted. our sergeant – How I cursed. French class in the evening about ½ an hour late. Very good and kept us interested right through although fairly elementary. He gave us a sentence and from this we were to compile others. \nVous voulez\n Ne voulez-vous pas me faire le plaisir de passer le frere de mon ami dans la rue neuve.\n","70":" Bull ring. First skirmishing. The bayonet fighting. The trench inspection in which we worked yesterday. Then another bomb lecture. All pretty feeble. Bath this afternoon and when I came back \nI note\n I had my attention called to a big column of smoke. Later we saw two aeroplanes and as far as I can make out they were enemy machines raiding a little further south of Paris Plage only about 4 miles away. The white cloud must have been shrapnel shells as we saw four burst together and the cloud took a long time to dissipate. Damage unknown yet. Shrapnel probably fired from the defence shore batteries. Going to French class again to night at 7.15. An extension of previous lecture nothing very interesting.\n","71":" Bull ring 8 – 12. First. Barbed wire entanglements. Elementary rifle drill by a pot who mistook us for an awkward squad he had had previously. 3rd Judging distances. 4th elementary bayonet fighting. Had a bath and prepared for leave to visit Etaples. left at 5 and arrived about 5.30. Seems to only consist of one main street and very shoddy at that. However I purchased a torch light and battery. 4.50 & 1.50 and a curiosity and we enjoyed ourselves. Will get a few postcards next time when I have more cash. Now I am quite out. There is a market place and a train connects Etaples railway with Paris Plage. \n\nWe went into a little place for tea and got a big pile of cutlets, chips, and salade with a good wine for 1\/3. Very excellent wine called \"Mulagher\" a sort of port although stronger and sweeter and we brought a bottle home for future use. To finish up we tested the beer – very good and only a penny a glass. Got home at 8.30 and went to bed. Flags were flying as it was Accession day in France. A fine sacred statue is at the entrance to the town.\n","72":" No bull ring to-day so we had a route march to Paris Plage and back about 13 miles. Enjoyed it although felt pretty tired. Crossed the river and followed the train line into town. Fine road with dense woods on each side and near the town is various golf links tennis courts etc. Hard courts which look very fine. Numerous hotels American bars etc just outside the town. Place itself is a very popular pleasure resort and Jack Johnson trained there for his fight with Jeffries. Town is very pretty and large the houses being very pretty and harmonising colours of green white and red. The sea front has an esplanade and bathing is indulged in. We bought some cakes and wine while we were resting on the beach and it went well. Skinned my heel going back and it is pretty sore.\n\n1.6.16 An old fashioned church (Catholic) had evensong as we approached (near the railway line and we inspected it as the chimes were being rung. Holy water and incense everywhere and numberless altars and statues to the saints all with burning candles. it was very picturesque and some soldiers were worshipping there.\n\n2.6.16 Rested the afternoon and went to French in the evening. Only about 10 minutes and 30 minutes later. Very feeble.\n","73":" Rifle practise at the No 2 Bull ring to-day. First 1 shot as sighter and then 4 slow ones after which we inspected the targets. Only 25 \nrounds\n yards right up in the hills behind the main camp. Next 10 shots rapid. I finished first of my 29 men and got all my shots well grouped with a big hole in the middle. Marched back about 6 miles altogether and I could hardly limp along. Getting back about 1 o’clock. Had a bath and put some vaseline and boracic on my blisters which are rather sore. Going to French class now Men who have been here ~ 6 months and live in England are getting 7 days leave. French ordinals and cardinals to 20 with pronunciation which was very useful.\n","74":" Church at 9.30 but I wrote letters and read instead. Only a few went out to parade and men in command were rather annoyed that so few turned up. French class at 3 P.M. when we learnt the various articles of clothing. Padre in a humorous turn of mind. Rest of day uneventful.\n","75":" Went on Sick parade and got my feet bandaged up a treat until I nearly thought I \nwas\n sick. Rain in the morning and our bull ring crowd returned going out again at 2 and returning at 5.30. it was very windy and terribly dusty and they had a half civilised instructor and they weren’t in a good mood when they came back especially as half way through tea we all had to go down for pay.\n\nCan’t get any change here or rather it is very difficult to get. We have an officer in charge of us now a small little fellow called McConnel who when introduced to us next morning said he was surprised at our lack of discipline. Wrote a decent letter to Melva and read up some bridging construction during the day and after waiting about an hour in the evening for the French parson went early to bed.\n","76":" Sick parade again this morning. Still raining and fairly cold and the rest have gone up to the bull ring but I s’pose they’ll come back if it goes on raining. The returned at 2 P.M. in a terrible mess. It had been very windy and they had to do skirmishing in all the wet and their rifles and were very dirty and they were in a bad mood when they saw us reclining at ease in our tent. They were sopping through but it cleared in the afternoon and brought more pleasure. During the day I did some reading and got my things in order.\n","77":" went out to the bull ring with the crowd but my feet were pretty sore. \nFirst\n Directly we came in our names were called out and we had to parade at 2.25 for medical inspection \nonly\n was very superfluous – the doctor (major) putting us through at about 3 a minute. We then had forms filled in of our age, place of birth, occupation, etc and then tea. Orders came round that we were to parade at 6 o’clock for the bull ring so we all fell in. Our little officer McConnel, was in charge of us and things were rather funny a favorite saying being \"come along, come along\". The whole thing was a farce and we only went up to our miniature trenches and relieved \nour\n a company the rest of the time we sat about doing nothing. I was in charge of a bay which contained a section of 8 men. Bull ring bayonet, company drill, lecture on fire control and skirmishing. Very cold out. letter from Auntie Sarah.\n","78":" Reveille late as we were late getting to bed. Bull ring at 8 to 2. Bayonet, gas lecture, saluting, sand-bagging. Afternoon spent in getting my things ready for departure. Evening letter writing. Rotten cold trying to force itself on me.\n","79":" Bull ring in the morning nothing else interesting In the afternoon we all wandered under a corporal into the sandhills and sat down until 3.30 when we were called to come and have a steam bath getting back about 5.30 route much shorter going by the beach and at back of mammoth laundry on road to Etaples. Went early to bed and was reading it being too cold to stay up and at about 10 o’clock the orderly sergeant came round and said that the draft to go away was to fall in immediately at the orderly room. We went down and found we had to leave early in the morning reveille being at 2.30 by which time all our kit had to be packed\n","80":" I went to bed at once and got to sleep soon after as some of the beggars would insist on talking and didn’t wake up till I heard reveille which I took to be the ordinary one at 5.30 but I was soon disillusioned and got straight out of bed not having undressed and got some tea. Nothing seemed to be doing so I put my kit straight and returned my extra mess tin and my spare boots and then wandered round. Suddenly we were told to fall in and somebody discovered we were 15 minutes late and we discovered the quarter master had gas helmets so we all broke off and got some and fell in again. We than marched of carrying all our paraphernalia – two kit bags overcoat and gear about 2 miles to the railway siding and got into covered trucks pretty full nobody to see us off except the sergeant McClean who carried our rations for us. We weren’t the last to arrive although we were late and we moved out at 5.30 accompanied by Auld Lang Syne from the band. The country we passed was hilly although well wooded and grassy and rabbits were plentiful and also wildfowl in a sort of a lake. We passed on the outskirts of Boulogne and saw the open channel. Then on to Calais again passing on the outskirts at the outer station. Two long tunnels were passed through. St Omer is a big town and also Hazebrouck where we were able to get some buns – our first meal for the day. We had plenty of stuff on board but no one worried to give it out until we went up ourselves and got what we wanted. Straight on to Steeneverck where we got out. We could easily hear the guns about 8 miles and some sounded pretty big. We arrived at 10 o’clock and marched off through winding roads towards Sailly where we were billeted for the night. We stopped half-way and could see a captive balloon of ours taking observations not far off. off again and into a paddock where we stayed and grabbed a biscuit or two and relieved our feet and especially my blisters which were rather sore. Then the trouble started. We were called out and gently told we were to be Pioneers! This hurt and we’ve been cursing ever since. It is only a sort of second class engineers and I was unlucky in getting with them while other men \nwho\n about 15 were chosen to go to their company. I’ll do my best to get back though. Our billet was a sort of a brickworks and contains several circular saws traction engines and motors. The house is a fairly dilapidated affair and here the officers were billeted our home being in a sort of stable with a loft and straw to sleep on and we had no blankets. I did a bit of interpreting for the officer re more billets for the men and then boiled our billies and made some tea and had bully, biscuits and cheese. Went to bed and slept well although it was cold and raining a bit and got up at 6.\n","81":" Went straight out and had a gas lecture in a tumble down \npictu\n converted picture theatre and then marched off again to undergo a practical test\n\nThis was in shallow trench and after putting on our helmets we went through. Gas used was chlorine and sulphur dioxide liquefied in steel cylinders. Going through \nwe\n I had some sprayed on my hand but I wasn’t at all affected although it would have killed us if we were exposed. We were inspected by a general then and went home after having a cold bath and exchanging our old clothes for clean ones. very cold but invigorating. Got some tea and plenty of food and waited about until about 4 when the pioneers had to go into camp. We marched about 3 miles with our kits and got a blanket when we got here – plenty of grub fair place to camp. Only 3 miles from the firing line. Sailly was occupied by the germans and the big church is smashed to pieces. Mail leaves to-night.\n\n10.6.16 After tea we went for a walk but couldn’t get into town without a passed so went the other way passing successfully two guards and walked into a little cottage apparently into a front room where the family were having tea. We drew up to the peat fire and got milk coffee and biscuits and had a long chat with the old grand father and mother who had their little grand children there. All taking beer for tea which every house sticks in its cellar and our men drink gallons. The old gentlemen showed us a photo of himself in the French infantry and we paid our two pence and departed having fully enjoyed myself. plenty of aeroplanes and \nyesterday\n we saw our machines being shelled with shrapnel by the germans but our plane got off safely.\n","82":" Slept fairly well although very cold and the guns kept us awake. Didn’t get up till 7 and after breakfast we fell in at 9 and did a bit of rifle drill in the rain. Been raining all day and it is very cold and miserable. Dinner and rest of the day off. I read some French and finished letters in the afternoon. After tea I went up towards town and got some tobacco and matches – rotten stuff - . A girl came along this morning with a sort of horn and woke us up and came right in selling papers while we were lying at ease in bed. This morning an officer came round and got our trades for working later in the workshops. I am a motor mechanic and fitter and turner. Just got notice to be ready for the trenches at 5.30 in the morning to dig a sap out of the front line of trenches getting back at about 3. Rather dangerous I expect. One food ration to be taken and we get our helmets of steel each 6 lbs in the morning before going out.\n","83":" Called out about 10 to 6 this morning and set out about 6.30 for the front line. 20 of us went and marched in single file in parties of six close to the side of the road to minimise the danger of the germans spotting us and using artillery or machine guns. The way is about 6 miles very winding and completely screened by the wayside trees, bushes, and grass and really there is no danger at all or at least not apparent. The communication trench winds about a mile before coming to the front line and all the places we passed through was planted with artillery although we couldn’t see any of it as it was so well screened. The trench is just wide enough for one to walk through and is revetted with stakes and wire netting painted to represent natural colours with painted sandbags on top and several parts of the road are screened until one is right up to it. Bottom of the trench is a duck board with wire netting to get a grip and a sump underneath to catch the water. We went in by way of V.C. corner where O’Leary won his V.C. & thence to the front by Finney Avenue. Shell holes are numerous and quite close to the path and some trees have been smashed. This place was occupied by the Germans at the beginning of the war and trenches, barb-wire entanglements and dug outs are numerous all over the place. When we got up to the front after waiting about half-an-hour we found we weren’t wanted and had to tramp all the way back. A sap is being made preparatory to bringing the trenches closer together being now 400 yards apart and this place is rather a dangerous one as it is in the form of a horse shoe and every place can be enfiladed. The artillery occupies the inner part of the horseshoe and is very cleverly concealed. There is very little doing and one would hardly know one was in the front line only an occasional few shots being exchanged but it is intensely dangerous to leave one’s head exposed over the parapet except for an instant and never twice at the same point. One casualty was being carried out just as we entered being wounded in the shoulder. 10th Battalion hold the line here all from South Australia and I met V. Sobels from Clare an old Saints boy as soon as I got there. We left 3 men to guard the sap and they had a rough time of it. At 1.15 the german artillery opened fire and rained down aerial torpedoes and whizz-bangs one casualty – an officer hit in the abdomen – The rest of our men found their own way back but two chaps and myself came back with a sergeant who lost us and took us miles out of our way towards Fleurbaix. We asked the way of our A.M.C. man who \ntold\n turned out to be Dave Evans a chap I knew at school and his brother is nearby in the artillery. We had some beer on the way and got back at about 1 o’clock very tired\n\nand after grabbing some dinner slept all the afternoon and had to go to out again at 6 o’clock. Wet and raining all the time and this time we were again not wanted in the mud as it was too dangerous working in the sap and we came back at about 9.30 this time without losing ourselves and were very tired. Rumour going about that we were all to return to our own companies. Sleep did not come early as the guns kept us awake for a while. Russians captured 114,700 prisoners and bad Canadian reverse at Ypres.\n","84":" Stayed in bed until 7 and after breakfast were told to fall in at 9.30 to go back to our units. Marched first to Pioneers headquarters and got our papers. Then on through the town to the C.R.E. and gave in my papers and after a while we each went to our units. 8 of us going to the 3rd where we are awaiting orders now as to where we are going and when. Had dinner at a little house consisting of 3 fried eggs butter and bread galore and a cup of coffee for 10d. Did a bit of fatigue in the afternoon and rested the rest. Millions of rats here and they kept us awake scratching but weren’t running round much. All French Houses seem to be built round a central yard with a dump pit in the middle where all rubbish and manure is put and emptied when full probably to be near the house in the cold winter. In this yard is always the pump. This house has two families living here and 4 very pretty and fascinating daughters who think nothing of hard work but always look fresh. There are two middle aged men also who yesterday were gleaning haricot beans in a winnower. The sergeant major and officers are a fine lot and ever courteous and treat us quite as equals. Couldn’t sleep very well probably as I was \"full up\" of sleep and only felt very tired in the legs. Very cold all night with only one blanket.\n\n15.6.16 This morning there was a great argument as to whether we should all get up for 1st parade at 6.30 or stay in bed but eventually decided on the latter and nothing happened. Bully and cheese for breakfast at 6.45 and fell in at 7.45 for about 10 minutes for our duties. We stood by all day until 1 when we were drafted into our sections. I cleaned up my kit this morning and my wife and fixed things up generally. Lunch at 12. No dinner in middle of the day and had tea and bully, falling in at 1 when we were drafted to our sections. I going to No 2 which are up in the firing line at Elbow Farm and we leave to-night on the waggon. After getting fixed with 50 rounds of bullets and a steel helmet – a funny green affair weighing\n","85":" be away for four days or longer and we have our billets there.\n","86":" Arrived last night on the wagons about 9 o’clock and passed the night in a machine gun emplacement in one of our trenches. No set hours here for reveille etc breakfast about 7. Then work from 8 to 12. Then light lunch of cheese & jam and work from \n2\n 1 – 5 rest of time off. We helped in sandbagging the trenches for a while then were put on twisting wires for revetment stays for pickets. Dinner at 5 of roast beef or steak and baked potatoes and vegetables. In the afternoon after dinner the Germans started firing near where we were working. We are working in an old house which about 3 days previously was shelled by the Germans and made some casualties however nothing has happened up to 24.6.16. The gun the Germans were after is a six inch howitzer about 200 yards from us and one heard the shells lazily zoom-zooming just above our heads followed almost immediately by a big bang. However up to 24.6.16 they have failed to get it. That night we were awakened by a gas alarm but fortunately it passed by us and we didn’t require our helmets. All men ordered into trenches while strafe was on.\n","87":" Gas alarm by rattling an empty shell case or beating an iron triangle when news comes from the trenches. Same work and a few more shells round trying to get our guns which are beautifully concealed and this place is alive with every description of them. In the evening we secured some boards and laid a floor to our dugout which is shrapnel proof but not for high explosive shells. Flares at night look very pretty all round us and Fritz has immensely superior light rockets or shells to ours. A raid was made on the german trenches and some flares captured which was just what we wanted & the raiding Anzacs have got short leave to England and £ 40 divided among them (about4)\n","88":" work. Just the same on Sunday as any other day here. paid at 5 o’clock. Tonkin old S.P.S.C. boy clerk for our section. Met him while looking over Islington before the war. Big strafe in afternoon and Fritz set fire to two billets by high explosive & then poured in shrapnel. \n\nOne signaller killed by going back to get some gear. Big strafe by our guns at night.\n","89":" work. Reciprocal artillery duel. Good fight between apparently 3 of our planes & two germans. Couldn’t tell the casualties. Gas alarm at night but again gas passed by us\n","90":" Fairly heavy afternoon and evening strafe. I am getting quite used to it and slept through the night attack. Put on the trenches helping to build revetments.\n\n21.6.16 leave to visit Sailly. Left here at 9 and took a long ride on the bike into Sailly – really lost my way. went to our company’s yards and saw how the rest of the crowd were getting on (Deslands down with slight dysentry). Went round to C.R.E. yards where the 1st company were with Hodgson, Collett & Groves but they have gone to Ypres the 13th taking their place. Adjoining the yards is a factory where sand bags are made the work being done by children \nan\n women and old men all however very smart. very interesting but wasn’t allowed inside. Canal runs at the back of the yards in Bac-St-Maur. Dinner of 3 eggs bread & butter & coffee for9 franc and also got 5 pieces of sweets. Rode the heavy old bike over the cobblestones to Estaires N.W. of Sailly and went over the canal bridge into the fairly large town. Fairly few soldiers & mostly French civilians. On the way back got Melva a bonny silk handkerchief for 5 f & also wanted a fine silk shawl for 18 f but of course couldn’t get it. Really shouldn’t have been allowed in on my duty pass as it should have been signed by the A.R.M. Went for a bonza warm bath when I got back at Sailly in a tub – half a beer barrel. Down to C.R.E. yards to load up at 4.30 which was the worst part of the trip carrying heavy 8 ft logs to the wagons and galvanised iron and other gear. Back to our yards at 6 and Le Lew & I had a bottle of champagne (demi-sec) for 5 f. Lovely stuff and then after strolling down the street we went to the pictures. Small old house badly ventilated smoking forbidden Volunteer pianiste good who played the Rosary first of all patriotic songs on screen in which we all joined. very fine pictures. First a Keystone \n\nFord Sterling & Billie Ritchie & then a very fine tragic drama. Had to leave a bit early to see the wagons safely away & we followed them up on our bikes reloading if anything fell off. part of the load going to Croix Marshal & part here to Elbow Corner. bed about 10 very tired. While I was away a billet was shelled called the Spy House by us on account of the crusty nature of the owners & there was 47 casualties by one shell. Found a german nose cap of a shell marked","91":" they tell me.\n","92":" On the trenches again to-day with a very hard working chap. Very hard work to me shovelling & driving in pickets & blistered my hands and got a bit out of breath. Party of infantry working for us. plenty of tobacco on hand. Gas alarm at night but nothing occurred.\n","93":" Only 7 of us working here to dig & no one in charge so we took things pretty easy in fact loafed. Did a bit of wire netting revetting. German artillery active all the afternoon as it looked like rain and wet ground makes shells do less damage. Just as I was sitting down to tea - Daly had gone to Sailly it started to pour and very soon our dug out was leaking torrents through the joints of the galvanised iron roof and I had to use our dixies to partly protect our beds. Wet bed to lie in that night but they soon dried up again. That evening our artillery tried to revenge but of course the effect wasn’t so great.\n","94":" very very sloppy this morning and we had a party of infantry working for us and the clay stuck to everything. However, we kept going all day. The germans shelled our support and front line trenches and of course we shelled back and considerable damage was done on both sides. Things being pretty war. Bed early and gas attack at night which however didn’t come our way.\n\n25.6.16 Sunday issue of 2 oz tobacco & packet of cigarettes and 2 boxes matches. Party of about 80 infantry of the 2nd battalion who have just come in from 16 days in the trenches. Work from about 8.30 to 12 & 1.30 to 4. Very interesting directing their efforts, and our work is going on well. Part of the line where we are is in the form of a horse shoe a rather dangerous salient as if the germans broke through the neck we would be surrounded. However the place is thickly studded with artillery and our work is to form redoubts of about \nan\n 2 acres in extent in the form of a square protected by barb wire and a fire trench right round and numerous dugouts. ","95":"\n trees right round us and shrubs & we are well concealed at Elbow Farm. On the North corner is the farm which was shelled just before we arrived here. Another redoubt is being made\n\nwest of us at Croix Marshal. Chapel Farm an old church and graveyard with a billet a little way away with a gun and observers post in it was shelled to-day and one shot blew everything in all directions into the air with bricks etc flying about and another shot just grazing the top of the roof. About 20 rounds of howitzer shells were poured in and our fatigue party had their billets quite close to it. About 15 of our planes were in the air together about 4.30 to-day and annoyed Fritz very much by skimming about 1200 yards above his trenches and he wasted a lot of rifle and machine gun fire on them. Very funny watching them shelling our planes with shrapnel. I haven’t seen one hit yet. As soon as things get warm our pilot turns off his course at an angle & of course Fritz’s next shots are a long way out & it is some time before he can find the range again. Shrapnel bursts with a flash & considerable detonation in the air with white smoke remaining stationary in the air for a considerable time and is easily taken for cloud the bullets being impelled on with the original speed of the shell. Sometimes Fritz uses high explosives in the air in the hope that the plane will be upset by the concussion. Immelmann the crack german planist was brought down here last Sunday I saw in the paper and we witnessed the fight 3 of our machines to two of Fritz’s; also the other German was compelled to descend. No German planes seen here for a long time and we seem to be complete masters of the air here. We are springing a big surprise on the Germans shortly in the front trenches by the adoption of a 240 lb trench mortar 4 times the size of the ones now in use which are very much dreaded by the germans. A great advance shortly predicted here and probably along the whole battle front. our artillery opened about 9.30 and kept going till very late. A big gun just at the back of us keeping me awake.\n","96":" Were awakened at about 7.30 but went to sleep again and when we got up to go to \nwork\n get breakfast everybody was at work and breakfast was somewhat scrambled. Same party working for us again to-day and a lazier mob it would be hard to get –most of them lay out on the ground and tried to dodge work. This afternoon Higginbotham shook them up and I had a party of five loafing all the afternoon. Two hot meals to-day and another issue of tobacco. Some artillery this afternoon mainly on the trenches I think and to-night there is supposed to be a bombardment from 9 to 2 in the morning.\n","97":" Bombardment didn’t come off but just before dark one of our aeroplanes destroyed five German observation baloons by dropping phosphorus from a good height which very effectively did the work. They were quickly set alight and descended slowly with a red flare and long spiral of smoke. This phosphorus seems pretty dangerous and is said to cover an acre of ground at a time. our men in the front trenches cheered long & lustily but about\n\nan hour afterwards they got hell. German artillery made a bad mess of their trenches and and the whole line was covered in a pall of smoke. Of course we replied and our damage to them is unknown but many of our men were brought back in stretchers. We had a fatigue party of infantry in the morning but work was very hard on account of the wet and about 11 it began to rain again and we had to knock off work. In the afternoon we were put on different jobs and I was cutting galvanised iron. Result more blisters. A 6 inch naval gun was tried several times in the day preparatory to the big advance. Men having been going up all day to the firing line with stretchers – cylinders of gas and accoutrements. No papers, letters or parcels are allowed either to come in or go out and great things are expected shortly. The bombardment was supposed to be on last night but it was evidently too wet. All the inhabitants of the villages are allowed to go from one town to another only as long as their passes hold out. We had a consignment of comforts yesterday tobacco, cigarettes etc and my issue which was all drawn for was 3 cakes of chocolates a piece of soap and a packet of Capstan cigarettes. I exchanged the soap and cigarettes for chocolates. Daly had to carry material to the trenches last night and got back late. Also an issue of 3 magazines. Went over to Croix Marechal to get tin snips and very interesting redoubt. Graveyard (English) there.\n","98":" Mess orderlies to-day and were up pretty early. No work and we are staying in our dugouts as it is still raining a little and sky very overcast. Rained a bit during the day and we did nothing till about 3.30 when we cracked up some stones to make mortar for a machine gun emplacement. About 2000 gas cylinders are said to have gone up the line and some have been used these last two nights. Bombardment started about 9 and worked round from Armentiers to our guns when most of them started and created a horrible din (about 12). of course Fritz replied and shells were lobbing all round us but I slept through most of it thank goodness. it was mot impressive and doesn’t bear\n\nthinking about. \n","99":" Party of infantry working for us all day and they were a very lazy crowd. Our dugouts are going to be rebuilt soon and we have our eyes on a new one ready floored and very comfortable bar a leaking roof. Got a paper to-day and very good news in it of the Italians and Russians. Germans fired a few shells to-day presumably with the idea of getting the range of some guns that have been giving him trouble. Had a chat with Tonkin our section clerk to-night and he seems to have had numerous parcels. Photos of his sisters – very chingy.\n","100":" Usual routine. Party of infantry working – same crowd. Shifting dirt for the trenches. Our men advanced 350 yards at La Bassee and also at the other end of the bend thus straightening up the horseshoe bend. A big naval gun assisted in the preliminary bombardment for the first time – said to be a 14\" gun. In the evening about 6 the air was full of our planes 18 going off towards Lille probably for a raid of some sort. They got shrapnel pretty hot but I saw no one hit. The planes were supposed to be mainly big new Vickers Battle planes. In the evening till dark I made myself a stretcher of wire netting and hessian and went to bed tired. We are moving our dugout one lower down vacated by Sarre & Linton. It is quite ready but has a leaky and not very thick roof. Didn’t sleep too well.\n","101":" Had to take the side supports off my bed to make it fit the doorway and finished it to-night and it is very comfortable. Worked hard all day shovelling while the infantry of the 2nd Batt loafed. They go into billets at Fleurbaix to-night & Higgy shook them up on their loafing. Paid at 1 o’clock. After tea hustled round and moved my belongings and now everything is spick and span. Another fleet of planes went over about 7 and hovered above the German lines for about 15 minutes 7 went over and all returned they being under shrapnel all the time. A taube which was up was attacked by one of our planes which was unsuccessful in heading Fritz off and he descended safely. Very interesting though short duel. Taubes been active all day over us as it was such a fine day. After shave and a good wash went to bed and read my letters. Got 4. One from Eileen, Kathleen and 2 from mother\n\nSome dated 1st may and some 16. Got letter from mother yesterday dates March 21st. No intermediate ones and none from \nHer\n. Gas alarm sounded – probably we are using it. Very little wind. Another attack apparently at La Bassee. Fritz using a searchlight a little 4 balloons came up again to-day. Writing this while waiting at gas alarm. German observation balloon hurriedly pulled down on the appearance of our aeroplanes. Another gas alarm later on and when we went out to see what was happening a machine gun bullet \"phutted\" about 3 yards from us. We quickly got inside and after waiting about an hour had a snooze till dawn.\n","102":" There was a big bombardment all night and we learnt we had made important advances all along the line. Our artillery did very excellent work and the german trenches 1st 2nd & 3rd were smashed to atoms as well as their barbed wire entanglements. Worked hard all day and we had a new infantry party who worked beautifully for us and thought they were on a picnic instead of fatigue. About 3.30 the leave men turned up with news that we were to return to Sailly in the evening so we at once gathered up our tools and put things straight and cleaned ourselves. Considerable Taube activity to-day over us and after tea we had a Taube right over us and guns firing at it. We heard a whizz and a thud quite close to our dug out and first thought it was an unexploded shell but it was a nose cap from one of our shrapnel shells and gave us a bit of a turn. Started to walk at 10 to 7 (about 5 miles) our bags going on the transport we had several beers on the road and a very hilarious time and I enjoyed it muchly. However took only a very little. Arrived about 10 o’clock and went up to our old billets and laid on the floor till our blankets arrived. Very dusty and several of our boys were very pushed and we made a great row. Things were very amusing. Our blankets arrived but it was 2 in the morning before we could possibly think of sleep and then it was a very troubled one. Got a fine batch of 16 letters and these helped to keep us awake.\n","103":" had to turn out at 6 o’clock and after a scurried breakfast and got our things together and after a bit of a fuss were allowed to put our heavy bags on the wagons. We were uncertain \nwe were uncertain\n whether our section would go or not but now it seems we are to go with the mob for a rest. Opinions differing as to Merris, Strazeel or Steenwerck. We had squad drive from 1 to 2 very amusing and almost a disturbance as several were badly drunk. Supposed to be a check parade at 3 but it didn’t come off and after tea I went to bed early and had a long sleep but I felt crawlers over me several times but no bites\n","104":" Still here and rumours all day as to when we are to go. Now it is supposed to-morrow at 9 o’clock and I have a suspicion it is to Ypres. Things were of course scrambled all day and it also worked up a thunderstorm this afternoon with a little rain. Had an examination of myself today and oh heavens I am covered in lice – in an awful mess. However it is very unpleasant to write and still worse to bear both \nmorall\n mentally and physically & yet everyone seems to have them and I emptied about half a tin of insectibane over myself. News of the advance still continues hopeful but I fear the war will not be ended shortly as such a lot think. Had a hair cut to-day at last. Slept pretty rottenly.\n","105":" Attended first parade at 6 o’clock and found I was on guard and went on at 9 o’clock. Only 12 in the guard and we had a fairly easy time of it. I getting to bed at 1 o’clock and waking about 7. The rats are fearful here too and run all over one even if you aim an object at them they don’t trouble.\n","106":" had the morning off after guard dismounting at 9 and we went down to the baths and I had a thoroughly good wash which may help. At one we went on parade and after a delay we were to do some demolitions but after joining two fuses and lighting them we were dismissed about 3.30 and the officers hurried off to practice driving the tool limbers. Soon afterwards a messenger came up and it now transpires we are to carry on with our ordinary work here to-morrow and are attached temporarily to the \n3rd Brigade\n 4th Division. Still fair news coming through. Two letters to-night one each from Melva and mother. Took a good while to get to sleep as parasites were active and I was tired.\n","107":" Little rifle drill this morning and then some demolition work. We blew up various things and it was good practice. In the afternoon we blew up a fougasse using 5 lbs of Ammonal a small grained grey high explosive and stones which were splinters up. Took our blankets out again to-day but it appears we are booked here for a while now.\n","108":" A bit of square and diagonal lashing & then we went to construct two bays of a trestle pier. Hard work and knocked off for dinner at 10 to 12 and when we went in it was rumoured that we were to leave in half an hours time. However at 1 parade we brought out all our gear and were told to fall in again at 2.30 in marching order ready to move off at 3. We did so and after a bit of fuss we moved off at 3.25 with all our gear including 2 pontoons 5 tool carts and Q.M.S. impediments. We marched until 10 to 7 and them put up for the night at a farm somewhere near Bailleul. Fair billet of straw but I bunked outside under a fowl roost in an old waggon. Things were pretty muddled but we got plenty good tucker in the end and after a wash I turned in and slept well until about 6. A lot were crippled with corns, blisters and sox feet especially Daly who grumbled unceasingly\n","109":" although it didn’t appear a bit like it except for beautiful weather and bells chiming in the distance in the village. Reveille at 7 Breakfast at 7.45 & marching order at 9 when we all took off our packs and had a foot examination. Fortunately I have felt first rate right through. Daly had to go to Hospital with a bunion or something which had to be cut out. Waited about until 12and after a hasty dinner set off again at about 1 o’clock presumably for a long march. Splendid country very much used for hop growing which were on trellises about 30 ft high. Country lanes very pretty. Many aeroplanes about and a monoplane as well as our usual biplanes destination unknown but now I suspect Ypres and rumour has suggested the Somme, England, & Australia as well as Merris & Strazeele for a rest. We took an exceedingly long way round perhaps by order but I suspect that our interpreter & Major Savage lost themselves occasionally. Arrived somewhere about 6.30 and got a good tea as I was hungry and also a bonza beer and milk. more sore feet and several had to ride in the wagons. Very slow on the way as we had to wait for other companies. Higgins seems to have had a quarrel with the others and after having tea with his section afterwards rode off to town. Got a chronicle last night (April 22nd) Hilly country here and just over the ridge are our balloons and apparently the firing lines. Extremely beautiful here if I could only find time to look round. Supposed to be a train journey tomorrow afternoon perhaps to Ypres. Turned in early and had a good sleep\n","110":" Didn’t get up till reveille at 7 and after breakfast at 9 we all fell in and put our kits handy and then were told we were to go for a route march to keep us occupied. We marched to Mont des Chats about 2 miles\n\nand got a fine view of the surrounding country. Ypres being plainly visible by the salient at night time when a bombardment is on. Sailly could also be seen through the glasses. We broke off for half an hour at 10.30 and had a stroll round. Beautiful hop country and big windmills are abundant. Close by is a big monastery now used by the Canadians as a hospital and we saw some of the monks coming in from hay-making. Further on was a little inn right at the top evidently frequented by tourists in the season. Good beer and I purchased some french stamps. We were explained our position at the summit and left at 11.15 and got home at 5 to 12. Fell in again at 2 and I found a stiff neck from somewhere. Given a short lecture on our duties in an advance such as mined road, obstacles, and broken bridge and water supply. Broke off at 3 o’clock and a party of us with an N.C.O. went away for a walk. First we went to Berthen about a mile away, a small town and after having a look round bought some chocolates, biscuits and a looking glass. We all lost one another and I was left with Linton and after waiting a bit we hopped on a passing lorry and wanted to get to Bailleul about 10 miles away. However, the lorry only went as far as Meteren about a mile away from it, but we had a good look round as it was a fairly large town. We went into various shops and I got a soap box of aluminium (the other had been nicked) and a silvered steel mirror. We couldn’t find a lorry on our way home and had to walk but we took a short cut and got home much earlier. A couple of chaps wanted to go into Berthen so I piloted them and got some ink and some English Stout and another look round. Got back about 7. No tea didn’t require any. Sold my other tunic last night to Sergeant Jenneson for 30 francs. My bed taken out to-night the waggon so am sleeping on the flor with some straw. We are to leave to-morrow for the train probably to the Somme at Ooderschoote or something at 12.30. Must write my diary in a note book in future I think as I can’t always cart this with me.\n","111":" Fell in at usual parades this morning and at 9 full marching order as we found we were to leave to catch the train at 2. We waited about and played bridge till 11 o’clock diner when No 3 section and the drivers got under way at 12 o’clock for the train. We started at 2 o’clock and marched by way of Mont des Cats to Godewaersvelde and after waiting about ½ an hour we entrained. meanwhile our properties had been loaded on . Rumour was rife as to whether we were going to Ypres or in the West direction to \"anywhere\". However we moved off to anywhere at 3.45. A guard had been fixed to prevent anyone from leaving the train en route. We were placed in 3rd class carriages 7 to each compt & were fairly comfortable\n\nThe next station to Godewaersvelde east is Poperinghe which is over the border in Belgium. Extremely pretty country passing through and everything very fresh. Our first station was Hazebrouck before mentioned a big city but we were just on the entrance and waited about 15 minutes to be shunted on to the other line. We saw two german prisoners (officers) very typical in a train just opposite us under guard and they were given a 2nd class carriage and a good deal of curiosity. After we moved out we had tea of bread and jam and water and went on to Berguette which is a coal mining district and also further on to \nHiais\n a fair sized town Briar. The next big town was St Pol where we branched off again. We saw some curious looking affairs apparently pyramidal gun emplacements used a good while ago. On to Frevent and then to Doullens where we arrived at 10.30. On the way a funny incident occurred. Two chaps hopped off to a near by Estaminet pursued by the guard and in the meantime the train went off. The guard turned up the next day and the two men the day after and have been under arrest ever since.\n","112":" About half an hour and we set off through a seemingly deserted city with every light out or shaded. out through the town and up a hill about 1 ½ miles while we waited for our transport to overtake us and we welcomed the rest and were very hungry and very little to eat. Then we set out again and marched and marched and marched. A few, - a comparative few got knocked up and had to ride on the wagons. We had a few spells on the road and were very glad of them too. We continuously took the turning to the right and I made sure we were going in a circle but anyway we went miles out of our track. It was daybreak when we got near our destination and it took a good while for us to find our village but we eventually did and camped in an open paddock and had breakfast. This place was Halloy-y-Partois. We arrived at 7.30 and had to move on again at 10.30. In the meantime I had a good wash and washed my feet to ease them and bustled round getting things straight. We marched on again and after taking a roundabout way arrived here at 1 o’clock at Naours and found our billets and after a good meal went straight to bed and slept without tea till next morning and had a good sleep the first for some time.\n","113":" Got a chronicle to-day (May 16). Short parade at 9 o’clock and then went down the village for a look round. Saw a steam portable engine cutting wood logs on a sliding bench and then went to tobacconists and ventilated our French and got the females address. Marie Louise somebody. Went to an Estaminet and were talking of our exploits and got into hot water next day through it. Marie Louise seems a gentle docile creature while the \"barmaid\" is more shrewd. At 10 o’clock we went to see the celebrated caves. ½ franc admission. Really an ancient chalk mine and was used by refugees a long time ago. There are numerous fossils and a chapel right in the middle and provision for horses while one part contained over 400 rooms about 16 x 14 feet. It has several exits and chimneys well concealed and varies to 100 feet under ground. The whole is quarried in the side of\n\na hill and is at a constant temperature of 49 degrees F. parade at 1.30 which lasted about 3 and took the form of a gas helmet inspection and we were each given a new type of respirator with rubber sponges round the eyes. After the parade we went up the hill over the caves through beautiful green shrubbery and when on the top got fine view of the surrounding hills and the spires of the churches. We then came down noticing another entrance to the caves on the way down and saw the rest of the village. It is comparatively small and one can’t buy much. The church was interesting and the graveyard very fine with numerous vaults. I brought away a candle. It has a fine organ in a gallery and a chime. Came back to bed and the rest of the evening was spent in a Philosophical discussion with Tonkin who was formerly at Saints.\n","114":" Rain this morning. Rifle inspection also and then were dismissed. After dinner. Lecture on our future work in advancing in this country and I have since then been writing this up and performing sundry jobs. Letters to-day from Ludlow and Mum. \nParade at 1& we had a lecture on tactics in an advance in\n. We were dismissed and then fell in shortly afterwards for pay and I got 20 francs. The price has gone up to 14\/4 instead of 14\/- probably on account of our advance. A lot of our chaps were very rowdy last night and one chap was particularly bad with \"horrors\". Some of us were lucky enough to go into Amiens about 10 miles away on bikes. Went into town for a while and when I got back wrote part of a letter to Melv. \n","115":" First parade at 6.30 and a number of us were given half an hours saluting drill for not saluting when they received their pay. I didn’t salute but somehow got out of it. met Price W.J. last night and other chaps. At 8 o’clock we went out for a bit of a march and sat on top of a hill returning at 11. Lovely day skylarks etc making things beautiful. Seems to be an aeroplane school close to here and about 30 were up in the air this morning all new type machines. At 1 parade there was a bit of a fuss as a chap had had 4 new razors stolen from him and the arrangement was that if they were not forthcoming at 6 o’clock there would be a kit inspection of the whole company and our leave would be stopped until they were found. However, the chap came round looking at our kits and was propitiated with several spare razors of ours and was fixed up. Finished Melv’s letter and we talked in bed until about 11 but I couldn’t sleep well as lice worried me. We knew we were to leave next day.\n\n15.7.16 Left about 12.30 behind the 10th &","116":" battalions and landed about 4.30 at Rubempre. we had a rotten billet but by making ourselves agreeable with the old lady we got a room in the house proper and we are very comfortable and don’t mind how long we stay here. Only 6 of us in a place formerly occupied by 20 french soldiers. We went for a look round but it is\n\na very tumbledown village and nothing interesting. Also had a look at the church which contains a fine altar with a figure underneath to Joan of Arc. Am polishing my French here well. Got a Chronicle May 20 to-day but no letters. Bottle of wine between 4 of us for tea. Had a good hunt for insects and decreased their number a good bit and slept well though fitfully. Sunday. Issue of tobacco & now have about ½ lb over.\n","117":" Little late for parade this morning. off all the rest as we are on duty pumping water for our horses and it is a very soft job. Been bustling round all the morning keeping things in order and have written this up. Last night we got some coffee in a house and had a good romp with some lads which were very interesting. Rained a bit last night and dull to-day. Could easily hear the guns at Naours. Had all the afternoon fixing things up and slept well that night.\n","118":" Given notice to leave that morning and we set out at 10 and had a stiff march until about 2.30 passing through Varennes and arrived \nabout\n without having any dinner but we got some going about 3.30. Forceville is about 6 miles to the nearest point Thiepval of the firing line and Germans can shell here. Guns are going all the time. We caught an A.S.C. waggon into Acheux about 1 ½ miles away to try and get some fodder at the canteen but it was too crowded so we hurried back per motor wagon. We have rotten billets but got some straw after a hullabaloo with the occupants and are more or less comfortable. Got two letters one from Kath & one from Eileen. It was raining pretty hard all night and just before we left and the road which led up hill and down dale was stiff and we had pretty few rests. Slept well last night although a bit crowded.\n\n19. Check parade at 6.30 and drill order at 8 in which all our stuff was taken note of to be made up and a further intimation of the time we were to have in front of us. Saw the ninth battalion go singing out to the trenches. Spent the day getting mobile and had a good wash. At 4.30 after tea at 4 we were given 20 minutes notice to leave and left at 5 going towards Albert where we arrived at about 7 (about 7 miles). Fair March and on the way we saw some interesting old trenches and dugouts in the hill sides. At Bouzincourt we had to stop for a while for traffic which is very heavy all along the road with all sorts of traffic and one way of conveying troops right up to the firing line is by London motor bus. There are many observation balloons all along the road observing which is hidden on the side of the hill. We saw one balloon being filled with gas from cylinders and it wasn’t really so big as it looked when up. At Forceville we saw a parachute descending. We also saw 75 French shell cases and our own 18 pr and some bigger guns and trench mortars. On arrival we bivouacked in the open paddock as it was too dangerous to go right into deserted Albert which is always being shelled as there are some 12\" guns scattered round about one right in the town. The fine cathedral has its spire smashed and has a golden\n\nfigure of the virgin mary hanging at right angles being knocked thus by a shell. Every thing is deserted and some places badly knocked about. We went for a wash as soon as we got in and it was near a horse trough. Had a fine refreshing wash. The water is brought in pipes from a long way away. Just as we had finished our feet shells began to lob about 400 yds from us so when we were ready we went back and had a view from a vantage point about 500 yds away. However, no damage was done and they couldn’t find the 12\" gun. We went to bed soon after as it was just getting dark and dew was falling heavily so we \"borrowed\" some hay from a stack and put our ground sheets over and slept in our overcoats with blankets over us and our feet in them over the whole of which we pulled on sandbags. I wore my waterproof cap cover against the dew and slept very comfortably and well although when we woke up our blankets were sopping. The river Ancre flows through Albert but is only about 12’ wide although pretty deep.\n\n20.7.16 Thursday. Had a parade at 6.30 for checking and got mobile after breakfast and up to dinner time have been enjoying a sun bath. The 1st Fd Coy is just by us and I saw Hodgson and Gould. Hodgson has had only one letter since he left Egypt but from all accounts the 1st company is much better than the 3rd. Still waiting and don’t know anything of what is going to happen. Just opposite us is our old reserves and the germans were bombarding furiously just over the hill nearly all the morning. On the afternoon we took a stroll towards Albert but didn’t go far in as we might have moved anytime. On our return we volunteered to go to the R.E. yards on a couple of limbers towards the centre of the town for 200 shovels and 100 picks. Tonkin and Pope went with me. The town was almost deserted and only a few soldiers were billeted there and one or two civilians who had the courage to remain and keep a little shop. At first sight from the hill overlooking Albert the town does not appear large but on closer inspection it has or had a beautiful cathedral, at least one large school and the shops quite numerous and fairly fig . It is a railway station although of course no trains ran so far and connects direct with Amiens and a branch line to Peronne. There are numerous fairly fine houses and also engineering shops, flour mills and gas plants. The church Notre Dame de Brebieres is almost a total wreck and I secured some post cards of it later. There is a public square and a statute of war and it is requested not to loiter there as the enemy could at one time anyway see right into the town. We got our load and arrived back about 6.15 not having procured much tea and on our arrival were told at once to get into fighting order and secure all the rations we could and especially see to a full water bottle. Later Higginbottom told us our work would be digging fire steps in the front trench recently captured. During the afternoon wee learnt that Sergeant \nMueller\n Cohen of","119":" section and Corporal Allingham of No 4 had been sniped and both killed while they had gone up to the front to ascertain the lie of the land and our work for that night\n\nThey were both well liked and cast a gloom over us. Later on we found the snipers nest which was an old shell hole out in the open and enfilading our lines. We were soon ready and started on our long march up to the front over hilly ground. Just outside Albert were our old original trenches dug in the chalky limestone and on our way we passed guns, guns, all along most of them firing and all shapes and sizes. A tramway of perhaps 2 feet runs nearly right up and a railway is being laid and a road once only a track is being made with new metal and parts of the way over the old trenches with fascines. We soon came into the war zone and here all was chaos and destruction. We passed through a wood still fairly preserved and I think Mametz and it was all interlaced with trenches and barbed wire entanglements and in it was an old Chateau now used as a dressing station and stop for ambulances. We now came to the first original line where our advance began and here there was terrible confusion with all the wire cut by high explosive shells and the trenches well they were hardly recognisable and shell holes everywhere not more than 3 feet apart and overlapping frequently. Equipment was strewn about although not very much and some of it was german and I saw several abandoned machine gun belts. A hedge behind which was a bank gave us shelter and we stayed a short time. The german bombardment was heavy all this time and at one corner we had to wait as the shells were falling just ahead of us at the corner where was one of our batteries. here we got a pick and shovel each after much confusion as the battery just behind us was being shelled & also tear and gas shells were being used lavishly and Lt Higginbottom was quite evidently ins \"blue funk\". We now proceeded after some more confusion in parties quite in the open although it was dark much to my wonder and after getting lost several times followed Corporal Kernot attended by Tonkin whom I soon lost after several reunions. In the end I lost Kernot before finally getting to work. Bullets seemed to be humming round too frequently to mu liking for the adventure to be safe and flares were up making us quite visible I should think. At the foot of a hill we laid down flat for a while guarding our faces with our shovels as there appeared to be a stunt on. We proceeded still further after sundry times losing each other and in the end hopped down into our trenches and observed where we were. There appeared to be German trenches in front and on our right able to enfilade us and the unknown position of the german front line was about 800 yards in front of us. I worked with Daly as the others seemed lost and Jock McHugh on our left in the same bay and this line was held by the","120":" Battalion with the Scots Black Watch on our right & Tommies on our left. Hard work digging but I felt very fit and got some useful work done although Daly didn’t appear to want to exert himself and complained of his bunioned foot. Our position was just behind a German limber which had been capsized and the three horses killed and just beginning to make their presence noticeable.\n","121":" At 2 A.M. everybody had to stand to with loaded rifle and bayonet fixed as the Germans might attack\n\nby a counterstroke at this hour when vitality is at its lowest. However nothing happened which I thought was what might come to pass as the artillery hadn’t been active enough although shells were dropping continuously although not close to us. We returned soon afterwards to work at about 4 and just before dawn the Germans began bombarding us and we got a hot time especially from the enfilading whizz-bangs which fell all round our parapets. You could hardly hear the gun fire a good way back when there would be a whizz followed immediately by an explosion which are combined to shake our nerves. orders were frequently passed up and down asking for casualties and a few got hit. The shells were exploding every where and just behind our parapet. Tonki8n worked with Dunstan and was assisted by Higginbottom at one time of the night. At 6.15 we were ordered to take up our shovels and file out and of course I thought we were leaving for good and gave an infantryman my water-bottle and afterwards when I was thirsty and asked another one of the same mob for water I was curtly refused. We retired into the support trench only about 20 yards behind and lay down dead tired in the wet trench and got some sleep. A puny German gun was harassing the trench on our left with whizz-bang shrapnel and we could hear them flying over and bursting with a puff and buzz of bullets. Got a fairly disturbed sleep until about 1 when I got up and secured some bully beef and biscuits. Set to work again at 3.30 and were intermittently shelled until 7.45 when we retired to our hedge and got a fairly decent tea and some mail including a Chronicle. The valley behind us was heavily bombarded by big shells as there was a battery there an a machine gun which was harassing the Germans. Later gas and tear shells were used and we were continually waking up to put on our helmets. However, no damage done. \nAt 8.15\n \n","122":" At 8.15 after a meal we all travelled home to Albert outside in our field and had a good breakfast. We travelled over the battlefield and it was all torn and scarred with shells with equipment and rifles lying about and here and there gruesome sights. After breakfast we went down and had a good bath and then a rest vainly hoping we were to have a spell. Dinner about 1 P.M. After another rest in the afternoon we were ordered to go out again at 6 P.M. which we did in our pontoon wagons. This time skirting well round to our left on the way to Gordons Dump through the wood. On the right of he dump is a fairly high plateau and under its bank we took up our positions and made a beginning on our dugout. Soon we got a pick and shovel each and had previously been told in the afternoon that our work was to hop out and dig a communication trench to the German trench the infantry were to take. We marched up to the support trench after a certain amount of confusion and losing ourselves and were there to wait until the infantry had got their advance and then were to do our bit. At about 1 P.M. we started our advance.\n","123":" The german flares were particularly prevalent as if they feared something was going to happen. Long lines of ghostly looking men with fixed bayonets could be seen advancing in the gloom everywhere only to hurriedly lie flat when a star shell lit up the place. Past us they came and over our trench and on as near the german line as they dared and then our artillery commenced the 15 minute bombardment. The hail of shell sent over was terrific and it is said that 800 batteries were concentrated on the front we were to take. of course the shells were directed on the enemy trenches to be taken and they immediately saw an attack was in progress and started bombarding all the ground and trenches where we were likely to be bringing up troops. God it was awful. Myriads of shells fell on our trench in front of the parapet behind on the parados and all round us and we had to just sit still and either wait to be killed or let live according to chance or providence. The bursting of the shells nearly deafened us and the horrible acid smell nauseated us. MacNamara Tonkin and I kept together and we had this treatment sold for over an hour. Just previous to this german machine guns were clack clacking hesitatingly and uncertainly for a while as if they knew something was on foot but couldn’t quite determine our intentions and then they began in earnest without cessation as men made themselves shown more. The bombardment still continued and then began to slacken very gradually and Mr Dowling went out with a white tape to mark the trench we were to make. Soon after this we all crowded to the exit and made off in single file in the direction of our work and soon found a space where Tonkin and I got in and quickly throwing off our equipment began work at once throwing the dirt on our right facing the enemy. Shell was still intense and rifle bullets and machine gun bullets were whistling round us but very few shells. The worst being right on our left about 300 yards away. Worked hard for some time to gain cover for ourselves and it was hard going and soon after we started men from the fighting in the advance began to come back wounded, some crawling, some hardly able to move and others with ghastly faces all imploring us as to how far the communications trench was further on. The German line was in this shape and our communication trench is dotted and our original line shown broken. This only approximate and shows how the german line marked X had to retire or be cut off but it didn’t do this until very late and it was from here that all our casualties were got. The must have moved out into the open and quite close to us and sniped and use M.G. plentifully when their flares disclosed our working party.\n\nI had dug down a fair depth when I felt a bang on the head something like as if a clod of earth had been thrown and at the same time the tin helmet was knocked on to my nose giving it a nasty bump. I was bending at the time and with my back towards the side and on examination found that a bullet had struck my helmet fairly low, gone right through and being deflected upwards by the steel had passed out again at the top making a very jagged rent and without touching my head. It was a very narrow escape and the helmet undoubtedly saved my life so I carefully replaced it after drawing Tonkins attention and thenceforth worked on my knees. At 4 A.M. we all retired to our trench and stood to for an hour just at dawn as a counter attack was likely. However they seemed too demoralised and I was next McKay who noticed my had and I explained and he offered me a cigarette which I gratefully took. Shelling was still going on. Then returned to our work of making the trench level and serviceable and at 10 A.M. were allowed to take half an hour for breakfast. My water bottle was nearly ¼ full and seeing a chap of the 3rd section going to get water \nwe\n he volunteered to take ours and he wasn’t much of a character as he lost himself and incidentally our water bottles and we didn’t see him again till we got to Albert. We stopped about 11.30 and lay down dog tired in a trench and slept till about 3 when we got up and secured some bacon and a small piece of bread for dinner. Shelling of our trench recommenced and lasted about ¾ of an hour and then gradually slackened off and at 4 P.M. we stood to again and after 5 did some more digging. The ground right through had been rather difficult as flint stones proved a nuisance. At 6.15 P.M. we got orders to retire and went to our dump and deposited our tools and marched or rather ambled to the main road where after 5 minutes spell we got on our pontoons which had come up and went home arriving about nine after getting cigarettes and cheerful words on the way. We couldn’t find our billet for sometime but at length got it and getting our blankets and kit bags from about ¼ mile away went to bed late and slept the sleep of the exhausted.\n","124":" Got up late and after fair meal Tonkin and I had a good bath \nour\n next our billet in a bucket of water. our billet fairly comfortable and slept in second story on a floor. While we had our bath the Germans sent over some big shrapnel and high explosive shells landing very close to our billet and continued intermittently. I got a fine parcel from Auntie Sarah. Rested in the afternoon and at 8 P.M. moved out again to our paddock as shelling \nwas\n might have happened that night and our big guns were firing in the village. Retired at 10 P.M. and artillery very active on our front. During whole time weather was very fine and my health excellent. Error:- our operations were not yet carried out at Gordon Dump but in Sausage Valley all the time. \n","125":" Got up late and breakfast at 10 A.M. and cleaned our rifles and selves and got ready for emergencies again. Dinner 12-1 and afternoon spent resting. After tea were ordered to return to line which we did in our pontoon wagons arriving about 10 P.M. at Gordons Dump via Sausage Gully. We recommenced our dugout and got it fairly respectable in an old shell hole and slept for a while during the morning although the battery in the gully made a big din. Part of the company worked that night but we slept.\n","126":" Stood to at 4 A.M. for gas shells. Got our dry rations and McNamara had a look at the old german dugouts after finishing our dugout while I slept as I had awoke early owing to our condition. Had another sleep that morning and forgot about dinner. A premature burst of a shell just after leaving the muzzle caused some casualties among our men and there was a continued stream of our wounded coming in and one chap had a captured german machine gun which upon inspection seemed very excellent. Early tea at 4.30 and secured pick and shovel and 10 sandbags each. Whole company went out at 5.15 and up towards the first line where we waited for orders in a chalk quarry on a gentle slope which I knew wasn’t shrapnel proof and her we got bombarded with gas shells. Whizz bangs, shrapnel and high explosive. Shrapnel bullets and bits of shell whistled quite close to us and things weren’t pleasant as my nerves were giving way a bit but not seriously. our trenches in which we were to work were evidently too heavily shelled for work to be possible. An infantryman was hit in the arm by shrapnel. One of our working party but tool it very gamely and Dave Oliver while trying to get him to the dugout shelter was hit a bullet passing right through his thigh. Soon after we got the order to retire and arrived at our dugout at 2.30 and went straight to bed. We dumped our tools in the gully at the chalk pit and got additional sand bags to keep us warm as I didn’t take a great coat and slept till 4 A.M.\n","127":" We received 3 issues of rum altogether which we greatly appreciated as it tuned our nerves up a lot. Just opposite us were 4 travelling kitchens. We were awakened at 4 A.M. and told to be ready to go on pontoons at once and go home much to our relief and joy and left at 5.30 arriving about 6.30 thoroughly done up. We had a good wash and meal and clean up and after dinner went down to Albert on the bikes and got some chocolate and fruit. Several aeroplane duels and 4 caterpillar tractors hauling emplacements for heavy guns. very interesting. The the first engagement just at the back of us was one of our aeroplanes which had been brought down and there was great activity of our planes all the time and we seemed to have complete control of the air. Had fruit for tea and after getting everything in order went to bed in a shelter of hessian just room enough for us three.\n\n28.7.16 Reveille at 6 A.M. and during the morning our kits were packed and the wagons made ready. I got a web equipment which was not in use as the owner had been wounded and went to the village on our bikes for post cards\n\nand chocolate. 1st Field company had left the previous evening and we left at 3.15 for an unknown destination. During our travels there were many rumours as to where we were going. England being particularly mentioned. However I had a bike on account of bad boots. Next to last night we had been in action, work of relieving 1st Division by second was in progress. Pretty march and once we skirting a wood which was very beautiful and marched on the mountain crests instead of the valleys and got some very pretty views. Passed through Contay and arrived in Harponville at 7.15 P.M. and straight way Tonkin and I inspected the place per bicycle. Very interesting and returned for tea which was well enjoyed. Had a good bath and slept and slept at 10.30 in an out house as the billet looked too much like lice and slept well.\n","128":" The sergeant major awakened us at two in the morning and told us we had 1 ½ hours to move off in so got things ready hurriedly and had a breakfast. Some infantry battalions had been with us of the","129":" Brigade but here they left us and we followed a pioneer battalion. Went down to our parade ground and after waiting about in the cold morning set out at 5 A.M. eventually on our stiff march. Good bit of hilly country and passed through \na\n familiar towns and through Rubempré and on to another village where we rested pretty knocked up. It was very warm and we cyclists had to go on and find the route. Duffy we went on and found the place about ½ mile from Lavicogne and 4 from Beauval and camped in a pretty open paddock. Close by was a house with a well and I had a pretty good bath and then some dinner. We arrived at 12.30 and McNamara wasn’t very well and badly knocked up. After a rest Tonkin, Eades and I went up to look at the aerodrome which supplies planes for reconnaising the Albert front. I was pretty tired but enjoyed it. The men there were very courteous and good and we saw Biplanes of Morane and Monoplane scouts all fitted with the Gnome engine and highly interesting equipment. The control is very simple and efficient later on about 6, 4 monoplanes went up for a two hours relief to our good wishes for a ‘bon voyage’. It is very dangerous work however very interesting to see them rising. We had to hurry back as we night be moving that night. They carry 100 gallons of petrol and 20 to 30 of best castor oil and use 9 to 10 petrol and 2 to 3 gallons of oil an hour. An emergency petrol tank is carried and a Lewis gun with c chargers as well as a revolver and a flare revolver and aeronautical instruments and the pilots always go up thickly and warmly clad. Went straight to bed and saw a plane coming home that astonished us with brilliant Loop the Loop Exhibitions just above us and very low. Very interesting and after tea got some wine in the \nvilla\n house nearby and went to bed.\n","130":" Reveille at 6 breakfast at 7.15 and moved off at 9.15 the pioneers having gone at 2.30. They were badly knocked out as they carried their heavy packs and blankets and ground sheet as well. Arrived at Canaples at 1 P.M. and had a dinner. Just before entering there is as steep slope and we went on ahead to find the way and this is our rest home. it is certainly a beautiful spot and quiet. The village is fairly large and the railway runs through connecting to Albert. Had a refreshing bath in the creek after a shave. Our camp is just outside the village near a fine old Chateau and now used for military headquarters. To enter the little forest glade we cross a swift running beautiful very clear stream and inside is wonderful fresh grass and fine shady trees and on two sides of the square is a stream running and one of which has beautifully very clear drinking water and which we are using higher up for a divisional baths which I helped put up. Along the stream it is covered in by shrubs and creepers and very beautiful and quiet. McNamara and I visited the village in the evening and went to a French wine shop after having a good look round and later met some French brother sappers who gave us a good time and after making purchases of chocolate and fruit we came home. There are a large number of troops here and they are buying beer galore and now the stuff is adulterated with water largely and not very good. There is a vegetable field just next us and onions have been borrowed and we are living very well indeed porridge and bacon for breakfast custard for dinner and fresh meat for tea and in addition we buy fruit (tinned) fish, lettuce, and other tasty dishes. Retired at dark and slept well.\n\nè31.7.16 Reveille at 6 and check parade at 6.30. Fall in again at 9 and told off for any fatigue and the rest of the day is absolutely ours. I have been going very hard all the time fixing up my gear washing and writing letters galore and now write to 24 and get letters from 18 and also been writing up my diary which was left undone since","131":" Got paid at 12 to-day magazines and papers from Auntie Sarah. Bed at night fall.\n","132":" This morning we were reviewed by Major General Walker who congratulated us on the way we had done our work under heavy difficulties and advised us to get all rest possible \nwhen\n and the way we took Pozières although the papers haven’t mentioned Australians at all and give the Tommies credit for it but I think they want to keep our presence secret.\n\nDuring the whole time our complete casualties were 42 including Lt Higginbottom. Shell shock & Williams sniped just over the heart while studying a map with a torch. Higginbottom frankly funked it all but must have been upset by one shell which went pretty close I believe. McNamara & Tonkin went to Vignacourt for supplie4s and had a good time. The Scotch Camerons are billeted there.\n","133":" Nothing important happened and stayed in all day. Still resting.\n","134":" Usual.\n","135":" This morning at 6.30 we were told the following were to be our future parade hours. Reveille 6. Parade physical exercises 6.30 to 7. Breakfast 7 to 8 Parade 8 to 12 generally route march. Parade 2-4 and another 9-10 P.M. pretty stiff although not so bad as we don’t take it seriously. Physical was a farce and consisted of a march up and down for about 19 mins then we were dismissed. However Dowling & McKay took us for a route march 8 to 11.30 to Havernas and a long way round. Very dusty but didn’t hurt us much. 2-4 we tied knots and this evening we didn’t go out till 9.30 when all we did was to layout a tape and stand by it the whole operation lasting about 15 minutes and is supposed to guard against confusion when we dig future communication trenches. We work 2 paces apart if there are sufficient of us. The to bed and a sound sleep feeling pretty tired.\n","136":" Farce of physical exercises and at 8 o’clock I didn’t go out as another route march was on and my boots are nearly done for so I was put on ostensibly cleaning the camp but have done writing this diary up all the time to dinner and am now right up to date in everything. No afternoon parade so as I wasn’t feeling quite up to scratch had a good sleep to tea time and after tea went into town and purchased a new pipe chocolat and soap. No evening parade so got to bed about 9 and rumours of us leaving next day Sunday – Our usual moving day. \n\nOmission – 21.7.16 A funny thing happened in the afternoon. One man of each bay acts as sentry and keeps a look out and to-day as it was rather dangerous looking over the top the sentry used a mirror periscope. All went well for about 10 minutes when the germans evidently discovered the mirror flashing in the sun as they didn’t keep it steady enough. We quickly got about a dozen \nex\n high explosives dropped right where we were and then apparently satisfied they slackened off. No one fortunately was hurt and needless to say that dodge wasn’t tried again.\n","137":" Intensely cold last night and slept fitfully and didn’t wake this morning till MacNamara called me to tell me they were all falling in. Got quite a scare and jumped up, slammed on my boots and hopped out in my overcoat just as I was and luckily wasn’t spotted although it was supposed to be a dress parade. Tonkin was more unfortunate as he was quite undressed and as a punishment he with two others were sent to wash down our carts until breakfast time. First parade as usual. 8 A.M. Fell in and rumoured we were not to move to-day after all. Had an hours drill under the new N.C.O’s and anyone who wanted to try their skill – very feeble indeed. Then dismissed. Heard the church bell ringing so determined to go to church and hurried off arriving at 11.15 but we weren’t the latest as people came in long after us an there weren’t many there. Very unique experience. No music but the priest chanted and was answered by a stentorian voiced bewhiskered gentleman who sat behind. Another extraordinary personage was a gentleman dressed gorgeously in what appeared to be admirals clothes and who with a staff and a sheathed rapier apparently acted as usher and guardian of proceedings. The congregation joined softly sometimes in the chants but usually didn’t seem to worry themselves much about the proceedings an occasional sign of the cross following the example of the priest was all the ceremony used and no incense whatever. Service in french wholly and I could only just pick out an intercession for certain ‘Monsieurs’ and Madams and a reference to the Australians as the talls was far too fast but I heard several Amens at perhaps, predetermined places. An interesting & amusing episode was a sort of clacker used sounding like a rod banged on the floor at which signal the white robed red capped choir boys or attendants would stand up or kneel according to their previous position. Another feature was \nthe\n introduced through a long prayer or exhortation or something when a hand bell was rung violently quite a number of times the prayer proceeding as if nothing unusual were happening. A strange thing now took place and a basket of bread was passed round to everybody pieces about 2\" square being used and children and everybody partaking with evident relish. However, no wine put in an appearance. By this time I felt rather flabbergasted especially as a fair demoiselle attended by the admiral and two choir boys after sundry bows in every direction at the alter approached the congregation with an alms plate. I left all my money home but Tonkin luckily had a ½ franc piece which saved the situation. However, only pennies were offered and not many people gave them. A hymn chant now took place and people began to\n\nfile out and I at last escaped by one door and Tonkin the other who was accosted by an ancient lady and sprinkled with holy water. There were a fair number of French soldiers present apparently home on leave but it struck me that their presence was not noticed as much as I should have thought. On our way back we got some stout which was fair but 3d for a wineglass ful. Went to sleep after dinner until tea time while MacNamara did more penance in washing carts for being late in joining the company on their march yesterday. 10 minute parade at 2 o’clock when we were warned not to leave the grounds till further notice. Passed evening filling this up.\n","138":" Slept well but pretty cold. First parade the rest went for a short march while I stayed in on account of bad boots. 2 o’clock parade we had an hours drill and then dismissed. 2 o’clock men were told for duties and the rest dismissed. Spent leisure in cleaning bike and reading and keeping my things in order. Didn’t move to-day although warned to be ready and not to leave the camp. MacNamara and Tonkin gone into town to get some bread and other edibles. I have decided to abandon my souvenir helmet as it is only an encumberance and it might not be appreciated by either home people or myself when I return. The bullet entered from the bottom being deflected upwards a large amount as it did so and travelled about 2 inches inside and made a big jagged exit 2 inches long by ¾ of an inch widest part and of this form again being deflected. \n","139":" Didn’t attend first parade on account of boots. Spent the morning cleaning my bicycle and in the afternoon had a heated and long argument with Tonkin on various subjects and in the intervals wrote to Melv, and later on in the evening to Mum. No rumour of going out yet at all. Just got into bed when I was told I was in bridge picket for an hour sometime during the night and on drawing for times found I was on from 2-3 in the morning.\n","140":" The hour soon passed and I had a cigarette and a talk with the driver on horse picket. Was exempt from first parade and after Mac brought our breakfast we were told at 8 A.M. parade that dinner would be at 10.30 and move out shortly afterwards. Got all our things together and had a dip in the creek and changed into my new shirt and underpants and after dinner we set out on our march and had our packs carried and I had a bike. Very stiff march up a steep hill with no spell and as it was pretty warm we sweated \"some\". Got to Bonneville at 1.15 where we heard we were going and into No 55 billet which is not too good and I quickly found a place outside\n\nnext the vegetable garden, grassy and comfortable in the open air. The old gentleman of the house here stocks large quantities of liquor and red wine and I had a dixie lid full and later Jock McHugh was evidently intent on a having a blow out and I tried to stop him with MacNamara but it was no use and he got very badly pushed. MacNamara was nearly as bad and I was just feeling unable to see straight. However went for a stroll and was sick on the way and felt quite right soon after. Jock was intensely funny. We evidently moved out of Bonneville to make room for the incoming 2nd Division who had just been relieved at Albert. Bed at 9.30.\n","141":" Reveille at 6 and check parade at 6.30. Wrote two letters home as the rest of the morning we were off. At 2 P.M. we had a helmet and gas inspection and dismissed at 2.45. Aust mail to-night which was late and the last of the mail about 6 letters. In the evening went to the 10th Battalion about ½ a mile away and saw Leaver and all the rest who all came through alright. Got new pair of boots.\n","142":" Nothing of importance happened. Evening received first batches of new mail and I got 2 chronicles and a letter from Auntie Sarah.\n","143":" Pay parade at 8 this morning. Now assets 35 francs and were told to stand by for a route march. However, I chanced a bath which was very enjoyable. Fell in at 2 for a route march which was compulsory brigade orders and our officers decided to go to Candas about 2 ½ miles away where there is a canteen. Warm walking and arrived at 3.10 and were dismissed for ½ an hour to buy supplies. However, there was hardly anything to be got and after some coffee returned. Before we marched out Orders were read one being that we were not to leave our billets probably due to raids carried out by us. Special order was read in which Cpl Allison of the A.A.M.C. was awarded the Military Medal for good work in the last engagement. Played \"66\" with MacNamara all the evening and beat him by 3 games to 1. Slept in the paddock under a spreading apple tree but at 2 in the morning were awakened by rain and had to come into an outhouse that luckily no one had yet found and was very comfortable.\n","144":" ordinary check parade at 6.30. At 9 we fell in in marching order and marched to Beauval the first village on our road about 4 ½ miles away. Pretty big place and purchased some fruit there for future use. Got back at 12.15. Check parade at 2 and went down to Montrelet about 1 ½ miles away on the water cart to get water which brought back to the drivers where I got some more tobacco. I didn’t return this \nthis\n trip as Tonkin and MacNamara and 2 others were enough for the job and I heard there was a big parcel for me. Sure enough Aunties Sarah had sent me one a bit knocked about but bonzer\n\nand I also received 10 letters. it contained a fine shirt a tin of lovely biscuits, shaving and washing soap, chocolate chewing gum foot powder, boric acid, phospherine insect powder, face washer, socks, vaseline. Spent all the afternoon reading letters and opening parcel. After tea had a game with MacNamara and went to bed just before dark in the little outhouse with Tonkin.\n","145":" Woke up in time for first parade and after breakfast wrote this had a shave and generally \"got mobile\". At 915 we took our blankets to the wagons with our pack getting a paper on the way. news of Russian and Italian capture of prisoners. Came back and our new officer who has just received his commission took charge of us. Was a Lance-Corporal in No 1 Company and was promoted for good work in the last \"stunt\". We then fell in for a route march and returned at 11.45 and had dinner and at 2 set off for our next stopping place. At 6.30 had a short spell of ½ an hour for tea in a paddock on the left of the road. We turned to the right after crossing the railway line. McHugh was badly drunk again. On the way it rained a bit but we weren’t very wet. The cyclists were soon after sent ahead to find the billet and we set out in great glee and I was catching up the leaders when my back tyre blew out and I had to walk the rest of the way much to my annoyance. Arrived at Herissart at 9.15 and after obtaining some wood for the cooks spread our gear and laid down waiting for tea. Went to sleep about 10.30\n\n15.8.16 We slept well and after taking our blankets to the limber I repaired the small hole in my tyre. After breakfast got ready and after waiting about until 10 am set out for our next billet and arrived at Vadencourt about 9 kilo from Contay on the left of the road on a high hill from which a fine view was obtainable. Here tents and hessian covered huts had been erected and was labelled 1 Aust Div Rest Camp. Arrived at 12 noon and after an altercation with the colonel of the 11th Batt re our tents at length secured some others where we had plenty of room and Kernot made up the four in \nhour\n ours. We had dinner when it was ready and passed the afternoon playing cards and getting our dilapidated looking dwelling in order. Took a stroll down to the town in the evening but it was an uninteresting place and returned to bed at 10. Inclined to be wet.\n\n16.8.16 All the 3rd Brigade camped in the same place and next morning started moving out about 9 and we left at 10. Very wet and muddy march and our bikes got frequently clogged. Our route was by an \"emergency\" road and thick mud all the way. We arrived in our old paddock at 2 only higher up and further back and we fixed our fires and had dinner at 3. We then set to work and made a\n\nhessian covered shelter as it looked rainy. Coming up to the hill we saw some batteries of 9.2 howitzers called \"Saucy Janes\" and their huge ammunition. After tea had a good wash and went to bed where we had some songs and a long talk. Sure enough it rained and I get a bit wet and was sleeping in a pool of water. Saw Hodges and they moved out to La Boiselle at 5.30 where the 2nd company had previously moved so as to be nearer the scene of operations.\n","146":" Reveille at 6 and drill order at 6.30 when some of No 1 sector went out on some job. Rest of the morning we are awaiting orders to move. The front seems very quiet this time so far except for the howitzers behind us and numerous planes. Also counted 26 balloons of ours up and 6 of Fritzs last night. Cleaned everything up in the morning and were told to be ready to move at 2 o’clock carrying blankets and packs to a spot about a mile out of Albert. The we were told the limbers would carry our blankets for which we were very grateful. We were to take our bikes but when I had everything packed and tested the bike the back tyre subsided suddenly and I had to walk with my pack. Pretty hot work but wasn’t far and arrived about 3.30 just behind the hill before Albert and previously untenable. We got some tea going and had some rations issued \nwhen\n and also got letters from Gene Gray, Norah Rogers, Jack, Kathleen Cowan and just as I had started were told to be in fighting order in 20 minutes and set off about 5 o’clock this time taking the Bapaume road and on the left passing up was La Boiselle and further on Ovillers. La Boiselle in the advance had been blown up by mines and large numbers of Germans killed as there was a trench right through it and only things standing were some old farm implements with a binder. Passed on to Sausage Gully and there at its top were our tools at a dump. It began to rain pretty badly here and we all got more or less wet and in addition Fritz sent over some H-2 shells near us. We then proceeded towards our work over trenches which had been blown in in places and very shallow in others. Got as far as A strong point where we passed some Scots who were very keen and had us halted and inspected before letting us pass. here we were ordered back on account of violent shell fire and because the trenches were to be kept clear for casualties and communications. We retired to the dump and awaited further orders which we received in about ¾ of an hour to carry on with our job. Leaving overcoats and all unnecessary gear behind at the dump we arrived about 9 at A strong point where our work was. On the whole the night was much hotter than the previous one before Pozieres although we were more seasoned. We had 150 infantry with us of the","147":" Batt – to help. previously most of the second Company left us in the lurch when we came back to the dump and also several rotters of our own men and we were rather short handed. The trenches were very narrow and made it hard to keep in touch with each other with such a big party. our trenches were nearly all disconnected and it was our job to make a new fire trench so as to more nearly connect the others.\n\nI was right ahead with Lieutenant Hooper and Bolton our own O.C. as he asked for a sapper to go with him and all the rest were infantry. Hooper led the way and I followed crawling and keeping as close as possible as we were were told it was very unhealthy and it was. At length we came to the end of our position in a shell hole and started working for dear life. The Germans were greatly alarmed when they spotted us as they soon began to get it hot and bombs ad all sorts of shells came over happily most of them falling too long and there was a constant crackle of rifle fire. We were only about 40 yards from their trenches and later on Hooper went back and I was told to keep a keen look out on the left which I did as well as watched the infantry’s work. We had a strong covering party on our front but none on the end of our sap. Worked hard at full pressure until about 4 when I was only too glad to sit in the bottom of he trench and rest. I had got down a good depth and couldn’t see over the top and so had the infantry on both sides but further on the infantry had made very shallow trenches and must have loafed. I was the only sapper with the party and the rest were digging further back.\n","148":" Had a cigarette carefully guarded from Fritz’s watchful eye and enjoyed it immensely. Bombs were rapidly passed up until we had enough and a little further back a machine gun was brought up. It was very misty with low clouds and later on when observers had been posted Fritz came right up to the end of our trench and inspected it covered by the mist so that we couldn’t shoot and we thought an attack very likely. Hooper was killed by a rifle shot and a man near me on the top of the trench gave a queer cry and fell over and died soon after. Another man was badly wounded and no stretcher bearers could be obtained at all. Things quietened a little and I made my way out to join the unit meeting an order to that effect about half way down and later joined MacNamara the rest having gone home. This at about 6.30. We made our way out and got lost in the mad series of tangled trenches and shell holes but at length were told where to go by a machine gun party in reserve. We found a man looking after a wounded companion and waiting in vain for stretchers as the trenches were much too narrow and awful to go through. We got a stretcher and carried him some distance and were very fatigued and then came back homewards to the dump. Luckily we met some of our men who had to return to get their equipment and reminded us. We all walked together and came to the road a little way up which we got some lovely coffee free although it wasn’t much. We then saw a Canadian Engineers wagon and gratefully got up where we were bumped about towards home utterly fagged out.\n\nReached home about 10.30 where we got some tea and bacon and lay down dead tired in a dugout and slept until about 6.30 P.M. when MacNamara thoughtfully brought us tea when I got mine Tonkin sleeping until 7 when he got his. Then we went to bed again and slept till about 7.30 and then had some breakfast.\n\n19.8.16 Got up and still raining slightly and greatly upset by the appearance of my rifle and kit covered in mud and dirt and rust. However, I cleaned things up a bit and this afternoon did a bit of work making a shelter until it rained again. Got an old letter from Melva March 2 and one from N.A.R. and a parcel containing an underpants and plenty of papers from Auntie Sarah. Nobody going out to-night and I am transfering my quarters to MacNamara’s dugout. Heard that Thiepval was captured by the Tommies and also that most of the","149":" Battalion were wiped out in attack told us by H3 sections who were out last night. They had several casualties but we only one who was \"shell shocked\" and rather queer. This afternoon was detailed to a job with 7 others of making a shelter for C.R.E. but we had just started when it rained a little and we had to knock off. Nos 2 and 4 sections were given notice to be ready to leave in half an hour for the front and McNamara who was working with me volunteered although we were exempt on that account and took Lintons place. I felt rather cold footed to stay out for such a little thing but it was \"orders\" and suppose alright. I slept with Linton in his dugout at his own request as he is rather nervous and I think was very glad to be out of it.\n","150":" although it appeared as any other day of the week to me. Slept rather cold and two men came in about 5.30 (who were runners) to our dugout and later about 6.30 the rest came in rather tired but without any casualties as when they got up there they found all their work done and set to improving trenches. I got up about 7 and got breakfast and about 7.30 started work and finished just on 12. Had dinner, only tea, and at 2 0’clock was sent out with 5 others to gather 100 picks and shovels for the evenings work when all the company was to go out. There is I believe to be an advance along 10 miles of front and 21 divisions to be employed. We went up towards La Boiselle and on the way were treated to some \"whizz-bangs\" which by their sudden appearance upset us a bit. proceeded onwards to the chalk pits and at length gathered 88 picks and I and two others went on further behind Pozieres and just behind the firing line sheltered by a high ridge in search of tools but found none. Awful sights about and a horrible stench. men were dead everywhere and half decomposed and surrounded by clouds of flies. Then came back and at length found our quota of tools and returned home getting a cup of tea and a ride arriving about 4.30 just when tea was being got.\n\nThe company had notice to be ready at 5 and this time again on account of our all day work I was not able to go out. I wonder if they think I’m a bit \"nervy\". If so they are mistaken and next time I shall take care to \"do my bit\" with the section. Rumour has it they may be out 9 days. had a good wash and shave in about ¾ of a quart of water and then rested and wrote this up.\n\n21.8.16 They all got back safely and had to dig a communication trench well behind the firing line. I had a good nights sleep and got up when the mob returned at 6.30 and I got breakfast and took things easy on our bunks. it turned out a lovely day a little cold so I got pipe and magazine and sat out on the dugout front an enjoyed it but presently I was somewhat startled and surprised to see Taubes coming over as previously a Taube anywhere was remarkable. About 9 came over and of course our planes were mostly conspicuous by their absence but one engagement took place but was soon given up. Our Archies engaged them but no damage was done. Got Mac dinner and in the afternoon lay down as it was rumoured we were all to go out that night. Dinner was late and soon after we were ordered to get tea at 3.30 and to fall in as soon afterwards as possible. Fell in and marched off at 4.15 and then followed one of the most awful nights I have ever thought of. We entered the communication trench just outside Pozieres where I had gone the afternoon before and we travelled through a very narrow and low trench with wood bars overhead and wires galore to trip over. Previously, we arrived in Sausage Gully just as the guns there were opening up and we had to go round. Just as we got in front of them they opened up and the din was awful. There are about 50 guns there 18 pounders and our ears were tingling until we could hardly hear. They fired for about 10 minutes and then slowed and we went on. Just outside Pozieres we entered the communication trench to the front and all along there was a horrible stench and emaciated forms were seen in places. Then shells began to fall round about and things were getting warm. The trench seemed interminably long and at last we go up to the front trench but not near our work. Some shells were coming over and soon after the bombardment of the trenches to b taken was commenced. The row was hellish and the Germans realising our intentions started to bombard our lines to prevent supports moving up and if possible to prevent our attack. They didn’t appear to have too many guns but what they did have were wonderfully accurate and were distinctly heard sweeping up & down this portion\n\nof trench allotted them for bombardment.. We also sent over many trench mortar bombs and they were plainly visible and set up a queer whistling. The trench we were in was absolutely crammed with men in a very bad move and as soon as the Germans detected any move at all in our trench they bombarded us but I don’t know how they got their observations unless by a Taube which was supposed to be above us. Shells were continually blowing in our trench and we were moving backwards and forwards to get away from the exposed portion being in between two infantry parties both moving oppositely and in the end we were hopelessly jammed. On one cornet 7 shells came over in quick succession and wounded several. orders were passing up and down to move out and much swearing happened when nothing occurred. One shell came over on a crowd of our men and infantry carrying ammunition and 7 were killed outright and 3 badly wounded. Brown had his head blown off. Our men were gradually getting excited and losing control of themselves. A remarkable thing was that as soon as our bombardment started the German infantry opened with rifle and machine gun fire and we were compelled to keep below the parapet both being very unusual but the awful part was to hear the machine guns and then the rifle fire gradually diminishing until none was left. our bombardment ceased and thenceforth our shells passed over in very few numbers indeed. German flares had previously passed right over our \nther\n trench and exposed us when anyone moved which gives us an idea of their proximity. The 10th Batt captured the 1st &","151":" lines without opposition almost but on going beyond to the third which wasn’t necessary they got badly cut up and there were rumours of them being cut off and nearly annihilated. We had been trying hard to get up to our work to dig a communication trench to the 10th’s new line but couldn’t get near at all. We moved \nnear\n to another trench and waited here and soon after got an order to stand to and to pass it along as far as it would go. We waited until 10 minutes and then got the order to retire for which we were very thankful although we wanted to do something \nfor\n having come right out there. During our moving in the trenches we had to walk over dead bodies and later on we were told to avoid the sleeping men but everyone knew they were dead and the stench was awful. Shell shock was prevalent but it was really more \"nerves\". Linton Toogood, Morissey, Pope all broke up completely and in the end we only had about 16 men instead of 60 which probably had something to do with our retirement. We were led out by our messengers Tonkin & Ingram and got out much quicker than we entered although it seemed a terrible long way and we seemed to follow the firing line all the way. We got a much appreciated cup of tea at the Australian Comfort Fund stall just outside the actual danger zone on the Bapaume Road in a hollow and were much cheered. But our troubles weren’t over yet and were dragging along the road when a premature burst of one of the guns occurred and pieces of the shell fell all round us luckily without hitting anyone and a bit further on one from a long range gun occurred and we could hear the shell hurtling over and over through the air. We got home at last and after settling MacNamara’s bed and getting things ready I went straight to sleep.\n","152":" McNamara came in about ½ an hour afterwards as he was detained to carry a stretcher case. Woke about 9 in the morning when Kenny the cook came round to tell us that breakfast had been brought over to the other side of the road. Mac got it and after some fruit we has a cigarette and went straight to sleep again until dinner at about 2.30 and after I had got it I went to sleep again but was awakened by Ferguson to tell us to get everything packed ready to move back. This happened about 3.45 and \nbreakfast\n was at 4 and putting all our gear on the wagons we moved off at 5. Several German planes had manoeuvred over the firing line but didn’t come further and were fired at by our archies. Got a parcel from Auntie Sarah containing books, an underpants and lollies. We marched up through Albert to our old camping ground after getting some firewood for the cooks we went to bed very tired.\n","153":" Rumours has again been active and now we are going to entrain direct to Armentiers. We got up at 6 and after breakfast ","154":"\n got ready for marching and set out at 9 not carrying our packs. We travelled through Vadencourt and Contay where we were previously billeted on a hill and thence on to Warloy where we camped in a very dirty open paddock fairly close to the church arriving about 12.30. Mac and I proceeded up the town and bought a bottle of champagne to celebrate our escapes for 5 francs and on returning dinner was ready. We were told we would be staying the night as we had two days in which to reach Doullens. Soon after all the cyclists me included were marshalled to go to Contay to load our pontoons which had been dumped at R.E. yard previously. We set out (about 32 of us) in great style me with a fear of a blowout with two big holes in my tyre. However, all went well an I had a great spin and came in a good second. We got our wagons loaded and after a wash in a fine stream very like the one in Canaples we went up the town and purchased some fruit and chocolates and then returned home about 5.30. After tea as it was threatening rain looked round for a more suitable place to bunk in and at last got a suitable under the verandah of a house where ploughs etc were stored. It did rain a bit but we didn’t get wet although we didn’t sleep too well. Woke early but feet too tired to rise and waited until we heard someone say we were to leave at 8.10 when after a hurried dressing we got breakfast and got under way carrying our packs at 8.30. Felt wretchedly dirty and couldn’t get a wash at all. Blood all over my clothes and mud and dust permeating everything.\n","155":" passed through Contay, Herissart, and on to Val De Maison where at 12 o’clock we stopped for 1 ½ hours to get dinner and here we put our packs on the wagons and all the men who had sore feet or were at all tired rode the transport horses while the drivers had a spell at walking. It was only 5 miles to Beauval and we arrived at our billet about 4 P.M. right in the centre of town and near the church. We had previously done a route march just to the outskirts to the canteen and had no idea how large and fine the town was.\n\nWent to our wagons before tea and got my pack and had a brief look round before tea. After tea went for a \"promenade\" our chief object being to get a bath. The town is quite big and has some fine dwelling houses – the chief item of interest being the church which is almost a cathedral. Built in 1888 it looks very fine and modern with a wide flight of stairs up to the 2 entrances and also has a clock tower. Inside there are three altars all very beautiful and candles of electric light. The whole town being supplied with electric light. A beautiful pipe organ is in a gallery in the rear and the whole is very fine. The main street contains numerous goods shops but I was unable to buy a torch which I wanted mostly. We heard we could get a warm bath at the hospital so after coming back and getting our bikes we took our underclothing down. The hospital (privates) is on the outskirts on the main road and is run by R.A.M.C. men and kept very clean and pretty. Clearing hospital and all sorts are there. After a bit of a blarney we got a warm bath and felt very fine afterwards making a great improvement. It was after nine when we got back and getting our blankets \"dossed\" in the yard in the open air in preference to inside in the dirty bunks. Didn’t sleep too well as we were doubtless overtired. Got some bonny cider before tea last night 7 ½ d a bottle.\n","156":" Reveille at 6.30 and roll-call at 7. Wrote some of this after breakfast and at 9 fell in in marching order and went out towards our carts where we mobilised in a paddock and had orders read to us in which Major J. Savage \nD.S.O\n gave orders for our benefit – or otherwise – The .S.O. was given for the work \nwe\n carried out at Pozieres. We then marched on to a little track along which blackberries grew past a pumping station to a very beautiful wood its only fault being that the undergrowth was a bit damp. Returned to our billets at 11.10 and our orders were that no one was to leave his billets without a pass. We have 10 to 1 to-morrow in which to entrain and have got to leave fairly early I s’pose to get to Doullens in time. Spent the time before dinner completing this record. Fell in again at 2 o’clock with our respirators and had them \"inspected\". MacNamara being gas expert. This was out of the town near the pumping tanks. Got back about 3.30 and the rest of the afternoon was spent in getting ready and other details. I went early to bed after tea and although I couldn’t sleep until late had a good rest.\n","157":" In the morning preparations for departure did not seem very much troubled about which rather surprised us, considering our march and early departure. However, we cleaned up our billets and after getting everything ready were told we would move out at 9. I carried some gear down to our carts about a mile away and on returning we had some cider supplied by Kernot to all the section in honour of his recent appointment to sergeant. Fell in and marched towards Doullens at 9.15. it was only about 7 kilometres there up and down hill all the way and we struck a bit of a shower of rain. Doullens is low down in a valley and we halted for a while and our transport went on. Arrived about 11 and quickly go the train loaded and found our seats another heavy shower disturbing us. At 11.30 we were dismissed and told we could have an hour in the town as the train didn’t start till 1.30. So Tonkin and I set off in great spirits towards the main\n\nstreet. We hurried at first, but later on settled down to a slower pace as we had plenty of time. The shops were quite large and there was a sports depot and shops selling all commercial gear. McNamara and Phillips went out on their own and we presently met him with 3 big rounds of bread, a piece of celery a sweet melon and all sorts of miscellaneous gear under his arms. I purchased a bonny and useful torch for 7 ½ francs, cigars, chocolate, matches, and little details and wended my way homewards with 5 francs left. We had a glass of fine beer near the railway station and then got on board ready for moving off. There were four 3rd class carriages 6 in a compartment holding eight and were very comfortable considering and each carriage contained a lavatory. Unfortunately I was caught for train guard and was one of 12 of our section but the duties weren’t arduous. The first stop I went into the guards van and there saw the train orders. We were to leave at 1.20 arriving at Hazebrouck at 5.30 but the train wasn’t ordered to proceed any further and we thought we were to get out there and march to Armentiers. but when we arrived we shunted back again and resumed our old way towards Godenwaersvelde where we thought we might go back to Sailly again but went straight on and we knew we were going to the Ypres salient. We passed Poperinghe over the border and on to Proven where we arrived at 9 P.M. our destination. We soon got unloaded and we heard we had a 4 mile march although we heard it was 14. However, we set off and marched on and on through Poperinghe until we felt very tired. At length is appeared we had lost our way so we halted while our gallant major reconnoitred both ways up the road. An reconnoitring party consisting of Dowling and Corp Williams had gone on the day before to get our billets but they lost the way also. We sat down in the cold and waited for about an hour until the major came back unsuccessful and ordered us to bivouac for the night. I got in the lee of a stock of hay and turned in at 2 in the morning. It rained just before daylight and our blankets got wet.\n","158":" Reveille at 6.30 and breakfast and afterwards got everything ready and marched off at 9 finding our billets were only 1 ½ miles away and we had taken the wrong turning. Soon arrived in a tent enclosure surrounded by trees about 8 miles from the firing line and we could see the flares going up but everything was very quiet on this front except for occasional mining. Shells come right over here occasionally and aeroplane bombs fall sometimes. After dinner rested a while and at 4 o’clock took leave to Poperinghe intending if possible to go to the big church or cathedral but when we got there there was no service. The town is very big and there are numerous shops where one can get anything wanted. There are also two fine soldiers homes one a military and another Talbot House a private with washing accommodation and a lovely garden at the rear. Church of England service at 6.30 and quite 50 in the pretty little chapel above with an organ but the service was uninspiring. There is also a cinema and pianos. Shrapnel is visible on\n\nboth sides of the main street and in parts a shell hole occurs but generally speaking the town is hardly touched. What struck me most was perhaps the people themselves. There appeared to be an inordinate number of men of military age about. most people could talk quite good English and a good few french but their own language is too like german and I can’t get on with them at all. The girls and women are not nearly so nice as the French and one fat old dame on being asked a question assented volubly with Yah Yah. We heard numerous stories of spies and some civilians have been shot for giving information and now even a lot of spying goes on although the authorities are pretty strict. It is said that when first the soldiers came here they were quite openly laughed at and ridiculed. It appears we are to relieve the Canadians from this front and may be here for some time. We got home just before dark taking a short cut through the fields and about 1 mile from Poperinghe and went to bed early.\n","159":" Reveille at 6.30 and folded our blankets half expecting to move out but didn’t. Drill order at 9 o’clock and went for a short march arriving home at 11 and after dinner had a short hand of bridge. 2 0’clock marching order inspection of requisition lists and dismissed at 3. Mail in letter from Jack and parcel from Auntie Sarah. Yesterday sent Melva 2 scent bottles and rosary. We had just started a game of bridge when the order to move at 6 o’clock came but we had plenty of time and soon had things ready and started after tea marching towards the firing line and stopping about a mile behind the firing line observation balloons. Whispers were abroad that we were to take over a yard belonging to the Canadians and such proved to be the case although at first we thought we might have to move to a dump further up but now we seem to be well established. The yard is a beauty and contains 2 motors, a steam engine, baths and bonny little huts and I was lucky in obtaining a fine bed. Electric lights are in the huts and heaters and we feel very happy. Turned in after dark and had a very comfortable sleep.\n","160":" Reveille at 6.30 check parade at 7. Fell in again at 9 and we were detailed to our various jobs in the yard. I was called out as engineer but for some reason I was after sent back and after unloading our pontoons we put up an incinerator. It appears we are firmly established and whisper has it we are here for the winter. A consignment of comforts came to us to-day from Tasmania including tobacco, cake, milk, books, and various other things. Got a letter from Burdett. We have a fine mess room and expect to be in occupation to-morrow. It rained occasionally during the afternoon and prevented us from finishing our incinerator. played bridge all the evening until 8 and had a couple of beers before bed. Couldn’t sleep until about 11 when a gas alarm occurred. We kept awake and had a confirmation order in ½ an hour. However, none came over and it seemed to windy and raining. it rained all night.\n","161":" Still raining this morning and no parades in the morning although we are supposed to be\n\ncarrying on our work. At 10 o’clock I was put on a job to make a set of pigeon holes for C.R.E. which took me until knock off time at 4 o’clock. Nasty working as the rain beat in all the time on our workshop and very gusty. Soon after tea I turned in and we got our stove going and it warmed the hut up beautifully. I had a rotten headache and a bit of a toothache and didn’t feel at all well. pat to-day and also got a letter from Melv and 2 chronicles. Of course, several came home merry.\n","162":" felt a good bit better to-day and it is quite sunny and beautiful out although a bit wet yet. We were carting fascines of logs all the morning in the slush about 6\" deep and it wasn’t pleasant. Our section clerk to-day went into the canteen and purchased articles for the cook each putting in two francs. I also bought some envelopes. In the afternoon we loaded a waggon with roofing for headquarters and took some wood over to be sawn up. Knocked off at 4 and wrote some letters to Melv, Mother & Auntie Sarah. After tea I had a bonza steam bath and afterwards put my coat on and wrote long letter to Melv outside. Went to bed but couldn’t sleep until about 11 as poker was in progress and Day came home dead drunk and had to be carried in. Slept well.\n","163":" First parade at 6.30 this morning Reveille being at 6. The sergeant major was up the pole and ordered in future that everybody was to be up at reveille and clean billets and parade in full drill order. First parade at 8. No time for anything. We have to supply 1000 duckboards a day from this yard and I suppose this explains the earlier hours. I was lumping wood all day in working h hours which were from 8 to 12.10 and 12.55 to 5. Wrote to Mother, Sarah, & Winzor in the electric light and turned in and had a fine sleep.\n","164":" \nMarchin\n Drill order at 6.25 but didn’t clean our hut till after breakfast. Only got 250 duckboards done yesterday. At 8 o’clock I was selected to fix new blinds at Divisional Headquarters and after getting material rode over on the bikes about 3 miles away and got to work. Capt Dean came in from the trenches and we spoke for a while. The work was done in the offices first and in the typewriting room the casualty list was being made out. IN another hut was the plans and men were coping from them. Some were marked ‘secret’ displayed so that everyone who came in could get a good look at them. Knocked off at 11.25 and came home to dinner. Carried on in the afternoon and knocked off at 4.30. Pudding for tea. New crowd of reinforcements and about 12 for this company including Ludlow and Watson. Wrote letters until 10.30 and was just sleeping well when a gas alarm went. The siren whistled continuously and someone was banging our shell case and all the church bells were ringing violently. Luckily no gas came over our way. Slept very well afterwards.\n","165":" Picked for guard this morning and didn’t go on second parade and hope to get some letters written but was only able to write one letter. Usual guard duties 3rd relief and plenty of officers to salute.\n\nOnly got one letter to C.M.B. written. Went on from 7 – 9 and after making some of the cocoa sent me we decided to have 4 hour shifts which meant I could have a good nights rest until 5 in the morning.\n","166":" had to call the cooks at 5.30 and the sergeant major and at 7.30 was relieved for half an hour to get breakfast and went off guard at 9.15 and was off the rest of the morning which I filled in by getting things straight. Got a parcel of cake and fruit and chocolates from Auntie Sarah. Poperinghe was shelled yesterday causing several casualties. Hook and Watson came to reinforce our section with Anderson. In the afternoon we again carried on with the blinds and got a few more done. The evening wrote some more letters and had a good sleep. Still cloudy and raining.\n","167":" This morning put on as assistant sawyer and at 9 couldn’t get anyone to do the job did it myself and cut up timber to size Ludlow acting as assistant. One saw got put out of action through a screw coming loose and the teeth grating on the framework but I soon got going well. In the afternoon I was tightening up a nut when the spanner slipped and my hand fell on the saw luckily not rotating. It cut a deep piece of skin out and it bled profusely but didn’t hurt in the least and I got Allison to dress it for me with iodine and again later after I had had a wash. Couldn’t write comfortably so went to bed early and slept beautifully. Nos 1 & 4 sections went out to Ypres to make winter dugouts living in cellars in Ypres and maybe out 2 months. They took their packs and went out at 8 o’clock in motor omnibuses. Gillett & MacNamara went as surveyors. Still raining pretty hard and they must have had a bad trip. The cyclists with the provisions had gone out the previous night.\n","168":" No first parade as it was very foggy and inclined to be wet so stayed in bed until breakfast. Hand a bit aching but not so much as it might. Went on sawing but not very much to do this morning and I am trying to write letters in the intervals.\n","169":" &","170":" Usual sawing. Working hard all day to-day and put through 2000 ft of uncut timber. Saw working better. Some infantry about 5 turned up as rough carpenters this afternoon and carried logs for us. From","171":" Batt. Had a hot bath and finished letter to father. Plenty of work and very little time for own pursuits. Paid this evening\n","172":" Half hearted gas alarm last night but nothing occurred. Usual routine to-day on the saw and we worked hard all day. Letters from Glad, Bill & 3 from Melv. Since writing last nothing of importance has occurred. Usual routine on the saw and in the few spare moments I have enjoyed I have brought my correspondence up to date. 8 hours a day every day of the week soon tell and I have been pretty tired. The only spell was one of about 1 ½ hours when the other engine broke down and the other sawyers gave us a spell.\n","173":" This evening a battle plane had to descend quite close to our yard here with her propeller smashed a bit probably by shrapnel and she flew off next day at 12. Heard of Blackburn’s V.C. To-day","174":" a Taube flew right over us with shrapnel all around and patrolled inland for quite an hour and a half. On her return she was pursued by 12 of our planes but easily got away right home. To-night I got a bike and rode to Poperinghe and had quite an enjoyable evening. Bought toothpaste, a watch for 25f and some A.T.Q. Lost my way for a while coming home but then was directed and had some beef tea with my cooker from Sarah and read the Royal with a pipe before retiring.\n","175":" Usual routine. Last night one saw was working from 6 to 19 and to-night both are going and it is now 10.45. Parcel from Auntie Sarah containing biscuits chocolates and fruit & papers and mouldy apples. One from home, pillow, socks, shirt, chocolates nuts . Feel very tired.\n","176":" Rumours to-day of going back to the Somme. Pretty correct all leave cancelled to England.\n","177":" Nothing unusual happened except definite news to move for the third brigade.\n","178":" Expected to move to-day but went on as usual with our work and the same on the 11th.\n","179":" Did very little work and I ran up on the bike and got my big bundle of washing. The rest of the section came in from the front at about 12 last night and we have orders to leave on the 12th at 9.30.\n","180":" We were quickly mobile and I got my bike which Boulton had been using and some chocolate for use on the way and left at 10 o’clock our packs being carried in a motor lorry. We hadn’t got far on the road to Steenvoorde when my back tyre blew out so Linton and I stopped to fix it up and then going on we lost sight of the transport but picked up the rest of the 3rd brigade and after getting ahead of them soon found our way into Steenvoorde arriving about 12 o’clock. Very stiff and dry wind all the way and the dust didn’t make things pleasant. We passed through Abeele before reaching Steenvoorde and decided to have some dinner on arriving after a glass of beer. Had chips and eggs and coffee for dinner. In the restaurant we saw the motor drivers of our transport who told us approximately where our billets were. So we set out for them and on the way met Bolton who asked us if we were going into Hazebrouck. He directed us as he was billeting officer so we rode in and found the place – an old farm. We fixed up our bed in a hay loft and spent the night in the hay and were so comfortable although ricketty.\n","181":" Had orders to move at 9.30 next morning and Bolton was to leave for England but at 7 o’clock he got Linton and I to accompany him on bikes to next billeting place and things were rather hurried. We had a very hard ride with our loaded bikes while Bolton had a free bike and we got bogged in a back lane and had to go across country over ploughed fields and over a valley with a big ditch at the bottom and we were nearly knocked up. It was a lot of up hill work and we only had a couple of drinks on the way at Boltons expense and felt better. However, we arrived a Noordpeene at 10 to 9 instead of 8 o’clock but in time to fix up about the billets and the officers had a beautiful to live in for the night and the men the usual. We had a good look round the small but historic village (dates from 1509) and then had dinner at the chateau where we had been invited by the people to sleep in the farm itself attached. Dinner was of soup eggs & bacon & chips and fruit with a bottle of red wine. After we rode down to the next village where we expected our men to pass through and where was the second army signalling corps. However, we waited for a good while in vain and then returned and met them coming from a different direction and they had gone a long way round. Arrived about 2. Major upset all the billet plans and we had to cart all our things to the back of the church\n\nin the town hall which had a fine floor where we slept comfortably\n","182":" Next morning after some preliminary wandering about started on the way through Abneke and with a strong wind we finally started at about 11 o’clock and arrived at about 3.30 at Watten just through the town and are camped in a farm where there are 8 Belgian refugees. Before entering the town we climbed a high hill from which we obtained a fine view of the surrounding town and on the top was an old chateau guarded by two forts with sentries over them. The town also has a trench system protecting it. The view was very beautiful with winding canals, railways, houses and farms. in the evening after obtaining a leave pass we went into Watten although supposed to be out of bounds and had a good look round at the fair sized town. We struck a brewery and had on inspection and were offered a drink of gin, rum, whiskey, brandy, \nrum\n or wine and had a brandy which was very good and on the way home some beer and \"malagher\". This seems to be our permanent training place.\n\n15.10 16 Parade at 9.30 to 11.30 for rifle inspection and drill and also at 2 to – 4 and in the evening I went early to bed. it was very cold and looked frosty.\n","183":" Very cold last night and it rained a bit Dare & Kernot came in very \"boozed\". First parade at 6.30 and went for a march for a while and were told I was on guard at 9 A.M. Got letters addressed to Pioneers Battalion and a parcel from Auntie Sarah. Spent the off hours in writing this up.\n","184":" peter Kemp turned up in the afternoon yesterday so we put him in the guard room to await court martial. Searchlight active all round us during the night presumably looking for aeroplanes. Rained during my 1 – 3 guard at 1.45 so I laid down inside. Fairly cold. Dismissed this morning at 9 and am putting in the off time until 2 o’clock in getting clean and writing letters. Eileens photo to-day. 1st &","185":" Brigades went through yesterday and are camped considerably further on than we are. First Field Company camped adjacent to us.\n\nIn the afternoon we went for a good route march west of our billets to the wooded ridge and round back home by the main road. It started to rain a bit but we didn’t get very wet. Wrote 5 letters in the evening and went to bed, early.\n","186":" Physical drill this morning at 6.30 and at 8.30 ordinary drill exercises until 10.30 when we were dismissed so that a team could be picked for the Drivers & Headquarters versus Sappers football match. Football started at 1 and resulted after a fair game in a win for the drivers by three points. Wrote to Melv and we were paid at 5 o’clock after tea. inclined to be raining to-night. MacKay went to-day to near St Omer to look for new billets where we are supposed by rumour to train before going to the Somme and I fancy we are waiting until our line is pushed near enough Bapaume to capture it and the Australians will be part of the attacking forces. Rough last night in all the sections I believe most were drunk. Nearly a fight here in the other sections and down the road two were knocked out. After tea it was raining but lightly and I walked to the village up the main road and after a wine or two came home & met Yank and we repaired to an estaminet and consumed numerous drinks of all descriptions. However, I pulled out before it came too warm and came home & Yank followed soon after. Awakened in the middle of the night by a fierce argument but no more came of it.\n","187":" Woke up feeling rather heavy and went to physical drill at 6.30 and did a route march and double. Fell in again at 8.30 and after doing a bit of rifle exercises it started to rain so we took shelter and spent the morning fixing up the voting for the referendum. Supposed to be a football match in the afternoon against the second company but it was too wet and was raining all the morning with a strong wind. Fell in again at 2 but were dismissed at once as the ground was so bad so got to work & shaved and changed into clean clothes and read a bit of surveying. Irvine & Linton were pretty drunk and Irvine was sick over his bed.\n","188":" Very cold this morning with a hard biting frost and wind. We went for a sharp double to the railway line and marched back. Fell in after breakfast at 8.30 and after a bit of drill we had some games jumping etc until 11.45 and then were dismissed\n\nand told there would be a football match at 2 with the second company. Watched the match which they won by about 7 to 1 goals. After tea went with Ludlow into Watten and walked round until 8 and home at 8.15. Very cold and frosty again and we are to move to-morrow. Reveille at 5.45 and transport leaves at 7.30 and we later to board a train. Don’t know destination. Irvine & Linton at St Omer again to-night. Got orders to-night to move at 9.30 and the transport at 7.\n","189":" Reveille at 5.45 so we got up in the cold and after stacking blankets had breakfast. Another biting frost. Waited about until 10 and had some hot coffee and started at 10 up through the wood & right through to Polincove where we stopped for dinner and a drink at 12.20. \nThis place\n On to Audruick which looks as if it had been bombarded at sometime and is a big ammunition depot. We boarded the train on which part of our transport had been loaded by 3 & 4 and set off immediately passing round to Calais at 2. Saw the channel and the town. On to Boulogne where we saw some Australian nurses who displayed the flag to us as we cheered. it looked as if we were to go to Blighty but we were disappointed and after seeing the Harbour we went on through Etaples and on to Abbeville and then to Pont-Remy where we disentrained. Fairly comfortable journey in 3rd carriages. Arrived at 9.30 and had to wait about in the cold until 10.30 for our transport to be unloaded and then came on without it to Francieres about 5 miles out. We waited about in the cold for 45 minutes while the Major hunted for billets and then went in and had to wait for our waggons. 1.30. It was bitterly cold and we couldn’t sleep and the transport got lost \nso\n and only arrived at 2.45 so we got comfortable and slept dead tired.\n","190":" Awakened at 6 and had to go down and try out No 1 pontoon in the frosty cold and had breakfast a8. Got some apples and drinks and got things shipshape and then wrote this up and rested until dinner. This place is called Francieres. In the afternoon I intended to go on the bike with Irvine to Pont-Remy but he & Linton and some others collared the bike before dinner and cleared out & went to Ailly & Abbeville so in the cold I played football\n\na bit and then went for a walk up on to the hill and through a wood where I had some difficulty in getting through. Had tea and then wandered down the village and coming back went to church. The priest played the organ but there were nearly all children there and not much of a service. Went for a short walk with Ludlow and then turned in sleeping below the winnower.\n","191":" next morning we were told we were to carry our blankets and everything including the cooks gear as we wouldn’t have our transport which had left yesterday on a two days trip. our march was supposed to be 7 miles. We set out at 10 and marched on the main road to Amiens. Very foggy and a bit cool and very stiff work. However we only had to go about 5 miles and stopped there. The 3rd Brigade was on the move and all had to be conveyed in motor buses. Mostly french buses and they all went well and we had a small bus in which 17 of us squeezed in with out gear and a bike. The pace was fine and we went up some stiff hills and through the outskirts of the town of Amiens. It was a very cramped ride and I was glad to get out and stretch myself. We arrived at 6.30 at Buire-sur-Corbie and I was left with two others in charge of the bikes and gear white the rest went to find the billets. This place is considerably behind the line. Our billet was a rotten cramped hole and I was very hungry so I bought some buns and had a good meal and as we were having it the old lady who are very kind people asked us inside and we met an English R.A.M.C man & chatted awhile. We got the old lady to let us sleep on the floor of the kitchen and after a hot wine went to bed at 9 and slept very comfortably.\n","192":" Up at 6 and were to move at 8 & had some hot coffee and then a wash and breakfast. It rained at night and everything was very sloppy. We waited about until 10 and then set out with packs the transport carrying our blankets. Rained all the way but not very heavy and marched on to Belancourt and through Meaulte and on to near Fricourt. Slush all the way and very heavy where we are camped. Arrived about 2 and had some tea and afterwards some stew. Our place is a canvas covered humpy pretty cramped and cold. However, we covered the ground with our ground sheets and slept at 7 until next morning at six. The S.M. called and said we might have to move after midnight but luckily we didn’t. The ground all round the hills here are covered with men and I think Bapaume is our objective. Woke at 6 and this morning was fairly fine and dozens of plans were early up.\n","193":" Breakfast at 7 with porridge and bacon and then\n\ngot ready but were told we couldn’t move until to-morrow or perhaps late in the afternoon or at night as the road had been blocked for some reason or other. Spent the morning writing this up and shivering. Very cold wind but many planes up and a heavy bombardment on. In the afternoon Nos 1 & 2 sections got picks & shovels and marched out in the rain to fill in trenches and unload wagons. We set out at 1 and got back at 4. And after tea we soon got to bed at 6.30 and slept well all night.\n","194":" Very heavy \nby\n bombardment by our artillery on the left by the heavy guns. Got up about 7 and after breakfast waited about as there appears to be some work to do this morning on roads. However, \nat two\n we didn’t work to-day so had a shave read some french and passed the rest of the day watching the big mail being sorted. I got a parcel from S.D. and a few letters. Early to bed and slept well.\n","195":" Up at 7 and after breakfast cleaned up a bit and at 8.30 went out with picks and shovels and dug drains round the huts the R.E.s are making. returned at 12 and after dinner went out again at 2 and got back about 4.30. Nos 3 & 4 also went out. 7 letters waiting at dinner time. (Sep 5th). After tea went to bed and read french and the express and got to bed and slept warm although a bit intermittently. Must have had too much sleep lately.\n","196":" Up at 7 and wrote up diary and read letters before breakfast and off to work again at 8.30. No rain last night but a strong dry south wind. Worked on the drainings round the 69th R.E. huts and at 11.30 went down to Meaulte on a wagon and got some candles & chocolates. In the afternoon did nothing but watch aeroplanes and in the evening went early to bed and read french and letters until 9.30.\n","197":" Slept cold. Raining again this morning and at 9 we went down to Meaulte on the pontoon wagon for a load of timber for our huts. Walked back having some coffee on the way and arrived at 1.30. Trying to work the afternoon off. No work all the afternoon. After tea got early to bed and read some more French to the usual accompaniment of row and song. Bed at 8. orders to move to-morrow at 8 o’clock. Some of the men seem rather unnerved and I’m wondering how they’ll stand it.\n","198":" The S.M. came round at 6.15 and told us we were to move at 7.30 which gave us little time to have breakfast and get things mobile. However, I was soon ready and after breakfast helped to get the wagons loaded which was a long proceeding. We moved off about 8.15 after much rush the transport coming on later.\n\nThe bikes got into trouble straight away and were bogged and left behind and we came on through Mametz wood and village all smashed up and eventually to Montauban where we are camped about a mile opposite the wood. The roads were awful and mud ankle deep in spite of working parties all along the road and we were held up all the way by transport of all kinds which had great difficulty in getting through. We only came about 5 miles but didn’t arrive until about 1 P.M. This place was used by other men and there are remains of a camp about. I reconnoitred and found two places choosing the second which is a sand bag dug out and made it a bit higher and covered in the roof with Malthoid and are now fairly comfortable. I had intended asking Irvine to share it but he was in with our A.M.C. man so I asked Ingram at last as he couldn’t find a place. The bikes began to turn up covered in mud and utterly unpushable. The transport also arrived so I helped unload and then retired to our dugout and had some biscuits and cheese. It began to rain then fairly heavily and we discovered some leaks which had to be stopped temporarily. A lot of the others got flooded out and wandered about seeking fresh places unsuccessfully. The got very wet and miserable but at last found shakedown for the night. Stew for tea at 4 o’clock and soon after went to bed and were fairly comfortable although we had to get up once to stop a leak. Had to do an hours guard from 12 to 1 to keep guard for gas and despatch riders.\n","199":" Woke about 6.30 but had breakfast in bed and arose about 8 o’clock and got things mobile. Then waited happenings. Second division also came up last night and to-day the sun is shining and looks clear. We are camped just below the big guns 6\" and now here near the 3\" yet. About 8.30 went up the road beside two 6\" guns and dug some drains for the road. Carried on at two o’clock and got home about 4.30 to tea. Quite a fine day and numerous aeroplanes up and balloons. Some German prisoners looking very dejected came along in the afternoon. (About 20) Early to bed and noticed some fine searchlights playing presumably on the look out for enemy planes.\n","200":" Up at 7 and off to the same work. In the afternoon found a letter from Bill and 9 letters in a redirected packet addressed to the Pioneers. Carried on in the afternoon and it drizzled a good deal. Some Taubes came over and apparently got back safely. One 6\" gun in action quite close to us during the later afternoon and Division took their guns up and left them in position. Early to bed and wrote this up and finished reading the letters. Think there is an attack on to-night as a short sharp bombardment is just over towards Bapaume.\n","201":" Had breakfast in bed and off to the job at 7.45 taking a scoop and broom as well as the shovel. A good long walk and came to the road just above Delville Wood which is absolutely pitted with shell holes and all the trees have shrapnel sticking in them. Soon got to the desolate region and here everything was dead & only a few big howitzers about. Pretty close to the line here. We set to work scooping\n\nup the mud and generally improving the roads amid a constant drizzle of rain and got very wet mud up to the boot tops. Seemed an endless job and as fast as we scooped fresh mud came in. Two whizz bangs came over the first landing about 50 yds from the road where we were working and sending up a big volume of mud and dirt which fell heavily on us. The next one fell just in front of one of the big howitzers without doing any damage. We had some bread and cheese which we had brought with us at 12 and got to work again. It came out quite fine and numerous planes were up and a few of Fritz’s and some fights took place. artillery pretty active and it is wonderful the number of big howitzers there are quite close to the line. Some of them 9.2 alongside the little 4.5. left off at 2 and got home about 3 and had a good brush up and wash before tea. Our work was on the road at Delville Wood above Longueval and only about 1 ½ miles from the line. Nevertheless motor lorries come right up when the roads are passable. After tea there was a rum issue after which I went to bed and had just got settled when the S.M. came round to Kemp telling him it was our turn to take a note to B.H.Q. I had to get out probably because I was living next door and stumble through all the slush and went a little beyond out of my way but soon came back and found it and got home after an hour and went straight to sleep.\n","202":" breakfast in bed and out to the same job again at 7.45. Went to the R.F. dump for an axe and then cut some timber for logging the road. Morning passed slowly with numerous shells flying about from Fritz and great artillery activity. It was fairly fine all day and plenty of aerial activity on both sides. Got a parcel of 1 pr socks and some toffee from N.A.R. last night. Saw the part of a tanks interior containing the engine 6 cylinder about 105 H.P. and saw the Hotchkiss 6 P.R. gun. In the dinner hour I went through Delville Wood in which were numerous dead bodies even yet and numberless chaotic shell holes. One part us pretty high and overlooks through a valley the lines apparently quite close about 1 ½ miles and beyond about 4 miles could be plainly seen the factory chimneys and tower of Bapaume and on the left the houses on the slope. Shells could be plainly seen bursting in the lines. Carried on in the afternoon and \nsaw\n finished the corduroying job and came home at 3.30 leaving the borrowed axe on the way. had tea and got clean and came early to bed and wrote this up. Feet pretty sore and boots giving way and will be mighty glad when we get out of here. Bed at 8.30\n","203":" work again to-day & I did logging on the road. 3 axes from R.E. Dump. Home at 2.30 and had a clean up before tea. Paid to-night. Section Clerk went in to canteen this morning. A large party of Pioneers etc working on tramway in Delville Wood which gives a clear view to Bapaume. Sure enough it was shelled this morning by 2 guns sending over about 10 H.E. shells. No casualties. Another little argument with Dare. Captured ridge this morning and 21st going over to-morrow. Rumour of fall of Peronne & Lemburg & naval Battle.\n","204":" Usual work. Sharp bombardment this morning just after we got out and probably an attack by us. Guns all round us. Later another one on our right and both very severe. I saw a part of it through glasses. Fritz artillery very active all day and shells falling all round us. I saw one casualty but mostly he was feeling for the guns all round. Knocked off at 2.30 and on the way home watched an 8\" howitzer firing. Intensely interesting and one could watch the shell away into the distance rapidly getting smaller and smaller till it vanished into the clouds or grew too small. Jumped in an ammunition wagon coming home and got well shaken up. A big shell had come over and on the road near B.H.Q. and got a motor lorry and killed about 20 men. Awful mess. Got my kit bag and got all the articles I wanted and will dump the rest. Rum issue to-night and I had a drop too much. However, went to bed and slept it off.\n","205":" Staying home to-day to get my boots mended and am cleaning up our dugout and clothes. Cleaned everything except my overcoat which is too bad to tackle and didn’t finish until 2 or 3 and then some of my clothes were wet which I put on. Rather silly thing to do. In the evening I felt pretty unwell as if a bad cold were coming but nothing happened. Numerous machine guns going quite close in the night and also searchlights and I believe a Taube was over. Very strong S.W. wind all day and fairly cold.\n","206":" Boots still unmended so stayed home again and started raining and rained all day. I dried my boots by Ludlow’s fire and they are repaired by now. Sappers returned at 11 and we all were miserable all day. A bit alarmed and thought it might be our turn for the trenches as the 3rd Brigade is in I believe but nothing has happened yet. 5.15. Bombardment going on up the front and it must be awful there. Feel happier now our roof is partially mended but everything is dismal and muddy. Spent the evening reading french and talking with Bill Ingram as we had a new supply of candles in 9.30. Gas guard 11-12.\n","207":" Usual routine on the hopeless roads. Hun artillery increasingly active and he has better ideas of our positions of guns. Saw Jenkins just going in. On the way home dallied watching the big howitzers and then caught a motor lorry and were very interested in the A.A. guns firing. Then walked the rest of the way and inspected a caterpillar tractor. Got to bed early as usual and was reading french when a Taube came over flying quite low at 8.15. Using his machine gun and dropping bombs. Passed just over the back of us dropping a bomb which injured some horses and flew off over the South side of the salient having come from the north and greeted by a volley of rifle & machine gun bullets passing the line. He was the followed by a searchlight and two stray shrapnel but was quickly lost. Fine day and sun came out in the afternoon.\n","208":" Perfect sunny day and lovely full moon to-night. Numerous air combats but we didn’t show to\n\nadvantage. Numerous enemy balloons up and artillery fairly searching. Quiet night. Usual routine of corduroying. Got two lovely parcels and a big mail in to-day and spent the evening reading it.\n","209":" Usual routine. Another perfect day and artillery only moderately active. Aeroplanes very active all day constantly and I saw one beauty brought down all in flames. Fritz came over again last night but was very modest. Spent the evening reading papers & eating chocolate.\n","210":" Usual routine. Only about 9 sappers on the job as the carpenters were called out to put up huts. However, we had a working party. Dull day – no rain. Letters from B.J & N.A.R Crack guard regiments came up yesterday. Spent the evening reading a bit but went to sleep early at 7. Artillery very quiet until 12 when a bombardment started. A few shells came over feeling for the road during the night and a couple pretty close to our camp.\n","211":" Usual routine without a working party and very slow work. Knocked off at 2 and rode part of the way home on the pontoons. The division is moving out to-day but we are staying here and are to go on railway work I believe. Fritz’s artillery pretty active to-day and he shelled the road fairly constantly. After tea very heavy bombardment towards Bapaume but it is easing now. 8.30 issue of sheepskin jackets to-night.\n","212":" usual routine this morning until 11.30 when we knocked off and came home. The tanks were just moving and we watched them interestedly. They are going back to R.E. yard as they are of no more use at present in the mud. Young 2nd lieutenant with M.C. in charge. Got home and after a clean up wrote letters of which there are 20 to do. On the way home saw martin Freitsch and spoke with one of the Cokers. Very heavy bombardment last \nat\n night at 12 and continued until about 6 this morning when it eased and it was calm all day. Fritz shells our environs pretty regularly but doesn’t do a great amount of damage. our new job is railway construction just down in the hollow from where we are. \nIn the afternoon\n \n","213":" No work to-day so it was decreed a washing day and I cleaned my clothes and wrote letters all the morning. In the afternoon we decided to improve our dugout so started work making it wider and longer. Worked hard till tea time with the aid of MacKenzie and Linton and then had to give up. Still the roof to put on and a few more sandbags to be laid so we made it a shelter for the night partly open. Very cold east wind blowing and we couldn’t sleep too well and piquet from 12 – 1 . Intense bombardment all round all night. Dull all day but no rain.\n","214":" heard to-day 2000 & 4000 prisoners had been taken and numerous other rumours. They started work to-day but we stayed home during the morning and finished our dugout before dinner all except straightening the interior. Went to work after dinner and are on a tramway track alongside a railway line. Worked at packing the sleepers. Knocked off at 3.30. Intensely cold east wind all day and at stages could hardly hold our tools. Bombardment fairly cool but increased again at night. After tea finished our dugout and now we only want a fire. Plenty of room and fairly warm and comfortable. bed early and feet very cold. However put on two pair of socks and conditions improved and slept pretty well after.\n","215":" For some unaccountable reason breakfast at about 6.30 and set out to usual routine at which I laboriously did many jobs\n\nFritz was particularly active in the air and 4 planes flying pretty low came over and dropped bombs doing some damage. Active all the morning. Very cold all day especially feet and ice was thick on all the water and the ground was hard with frost. after tea went looking for a \nhut\n fire for our hut and hope to get it done to-morrow. Got a good lot of candles and hope to write some letters now.\n","216":" Usual routine and slept pretty cold last night. Intense cold this morning. ice about ¾ \" thick and our water bottles and water cart frozen up. Couldn’t hold a tool to work and did nothing till eleven. Sunny all day however, Boiled some tea for dinner and knocked off at 3.30 fairly quiet all round with a bit of a strafe on the French side to-night. Not much aerial activity although Fritz was alert. probably too cold. Received letters from N.A.R., Eileen, mother & papers from Alex & mother. Also another parcel from Sarah. After tea very humorous episode. We organised chimney for our fire and the others (3) came home laden after dark with three huge stoves borrowed from a dump and installed amid much laughter and cheering. Don’t know what the result will be. Read till about 10 o’clock.\n","217":" Usual routine all day. Got up early and found snow everywhere pretty thick. However it wasn’t very cold for a start although a spell had to be taken every now and then to get the fingers warm. Everything was covered in snow and ice was fairly thick (about 1\"). Shortly after tea we started it commenced to rain and drizzled all day. Very miserable working and sergeant seemed to consider me a special subject for fatigues. We knocked off at about 2.30 and I came home tired, wet, and out of sorts and cursed Ingram because he had not got our fire. However, we went down to the road and ourselves borrowed a stove and installed it and now she is going beautifully if no one interferes. Feel quite happy now and will be happier still when things are sorted out and cleared properly. Read and wrote letters until 9 P.M. and went to bed warm and happy. The infantry working with us to-day seemed a very unhappy lot and to have lost most of their spit. At dinner time General Birdwood came round and enquired after our well being and rations etc. He takes a keen interest in his men. Had cocoa for supper.\n","218":" usual routine of slinging mud and stone about. Letters from G.G. W.J.C. C.M.B. Rained a good deal last night and some came in on our floor. Chopped wood when I got back and then tried our stove which didn’t light up until about 6.30 but now going well. Feel very dirty and the hut is in a bad mess. Cloudy all day.\n","219":" Usual routine, Canteen materials of candles and chocolate turned up in plenty. Stove going well and had a shave with hot water but haven’t cleaned up very much yet. Bed at 9. Cloudy in the morning and fairly sunny in the afternoon and not too cold all day. Wrote some more letters to-night.\n","220":" Very foggy all day. Usual routine. Artillery minor strafes. Felt rather unwell to-night.\n","221":" Usual. Foggy all the morning and fairly sunny in the afternoon. Mackenzie left for Blighty this morning and half the section had a rest to-day. leave now 1 every 4 days. Saw one enemy plane brought down wobbling and fluttering all over the place. Pilot knocked out by our planes M.G. fire. Another made a headlong dive engine still going. Afterwards heard two more one of ours & one enemy came down. Got some wood for our fire and cleaned everything up. Hope to see Jack to-morrow.\n","222":" Usual routine. Artillery quiet except for a small bombardment on our left at sundown. Planes active. Felt very tired all day and a bit unwell.\n","223":" our holiday to-day. Slept all the morning except to\n\nchop a little wood and clean up. Rested in the afternoon but wrote a few letters and spent the evening quietly. Kernot our sergeant was brought home carried dead drunk & had had a whiskey night with the S.M. & Q.M.S. and several privileged N.C.O’s. \n","224":" Rained continuously all day and our work made things very miserable. First our brilliant corporal mistook the quarter for the 5 and when I told him it was the quarter replied \"Never mid, you fall in and do as you’re told. An argument with Tonkin ensued and things looked lively. However, fell in again at the proper time and no roll was called. proceeded to work. Laid about a ½ mile of track pulled it up and put down heavier stuff and to finish off transplanted a set of points found it wouldn’t fit where we wanted it and then our major found a new place altogether. Came home wet through at 3.45 and went to the wood to get some firewood which I chopped and then had tea. Got to bed and hung my things to dry and had cocoa for supper and finished more letters.\n","225":" Raining heavily this morning and awful weather but nevertheless we set out a bit late for our work and got wet through in no time. Working now just below Trones Wood putting down more rail. Knocked off at 3.25 and took a short cut home along the railway line alongside which is being made a strong wide corduroy road. By the side we struck a collection of about 40 or 50 15\" shells evidently used by the armoured train. Wonderful big things they are. The track is evidently the location of the old German Railway. Further on we came to the sausage balloon which had been up for a trial and which came down for the observers. The observer was an officer – a very keen and fine looking fellow accompanied by a corporal. Both were strapped into an equipment attached to two parachutes hanging on the side. Everything looked very clean and I noticed a ventometer on the car and the balloon was worked by a lovely motor on a motor wagon attached to a thin steel rope of about ½ \". Carried home some wood on the way and chopped it before tea. Got a parcel of cake & a letter from Mother and Bill. Ingram got a fine parcel also. On guard to-night from 8 – 11 and will write letters. Ingram goes on 11 – 2 and I have the morning off and have to carry the tea to the workers. Cleared up in the afternoon. Artillery quiet but Fritz threw a lot of shells on the billets round here last night.\n","226":" Didn’t get up until about 10 and then cleaned things up a bit and at 11.30 set out with the tea with Bill Ingram. After dinner saw one of our planes descend near Delville Wood on fire. The pilot played fine and manoeuvred coming down to keep the flames blowing behind him. Got some more wood from Bernafay and chopped all the afternoon which was clear and many Boches came over dodging in the clouds. However, our Archies kept peppering although shooting was difficult. Spent the evening reading and wrote up completely my letters. Artillery especially heavy guns active on both sides from 4 to 9 P.M. Frost this morning and foggy. Clear afternoon.\n","227":" Very foggy all day and only 5 of the section were working as it was the others day off. nearly worked round the curve now. 7 letters Oct 16 mail to-day. Read all the evening and performed some toilet operations. Bed at 9 P.M. Artillery quiet.\n","228":" usual routine and pushed trucks of rails all day. Carried home a duckboard each to add to the beauty of the home. Chopped wood until dark and after tea had a shave and carried out some repairs to the undergarments. Foggy all day and very cold in the afternoon. Artillery active in places.\n","229":" Dull and cloudy all day. Usual routine. Cocoa for supper.\n","230":" Did little in the morning and only loaded two rail trucks\n\nin he afternoon. Very foggy and cold ice formed on the branches. Saw Birdwood who had a good chat with me. Came home early and chopped wood for the evening. Big bombardment going on a little to our left.\n","231":" To-day was to have been our day off but we were about 3 minutes late on parade and had to go to work. Very foggy and frosty all day. After dinner our job was pushed – we had done little in the morning as no rail came up and had to work on in the dark until 5.15. Went to bed with a fire for about 2 hours. 4 parcels came for me one containing the clothing. Yesterday saw an 8\" howitzer Fritz left behind.\n","232":" had to work for the cooks this morning and carried heavy logs across here and strained my back a bit. Cleaned the dugout in the afternoon and chopped wood as well as I was able. Fire refuses to burn well to-night. Day foggy and cold.\n","233":" Usual routine now working on the edge of Delville Wood. Fine clear sharp day and aeroplanes active. Artillery active to-night. Some fell near us this afternoon. interesting mail in to-night. 3rd Brigade returned to-day.\n","234":" usual routine and joined up to-day.\n","235":" our day off to-day. Didn’t hurry at all and cleaned our dugout and carried over some wood and some more in the afternoon and finished with a shave and wash. Our job to-morrow is to assist in surveying the line we have put down. Weather cloudy and gloomy with a strong \nwest\n cold east wind which has been going since yesterday afternoon.\n","236":" Dull and foggy at times. Did nothing in the morning and in the afternoon made some tally rods and carried home more wood. breakfast at 6 to-morrow probably because some sections can’t get a parade in time owing to late calling of cooks by the picquet.\n","237":" Mild but drizzling rain all day. breakfast at 6 and the section went out at 7 to put in a crossing. Quite dark then so we waited comfortably in our dugout until 8 when it grew light and after making our chain set out. (of telephone wire) Worked under difficulties all day as sights were difficult to make and it was very muddy. After dinner chained on to 3000 feet and came home at about 2.30. Issue of boots and a jack knife. Almost incredible news of capture of Bucharest, Ploesti. Vague reports of the Greece crisis and the formation of new English Cabinet. My front tooth came adrift this evening and I wish I could secure good attention.\n","238":" Miserably raining all day and has set in heavier to-night. Carried on with the surveying until dinner time when it became too wet and our prism in the compass became clouded with moisture. Sat in the dugout for the remainder of the day. Reinforcements including Sergeant Jennison. Mail. Diary Aunt Sarah, socks, Clarice, fine assorted parcel Alex Letters CMB & . Artillery quite active on left front to-night.\n","239":" Threatening rain all day. planes up (2) in afternoon first for some time. Both artilleries active in afternoon. Bill Ingram to report for Loco driving 6 to-morrow. Usual routine at surveying advanced to 8600 ft near Water Cot Farm. Parcels from Home & Sarah. Wrote letters & read in every. Canteen to be erected here & started to-day.\n","240":" Worked up to 12000 ft. Past Longueval back to road. Fairly fine in morning and fair aerial activity. Artillery very active and Fritz used his armoured train again. Air tactics to take greater risks. Afternoon cloudy and gloomy and started to drizzle again. last night there was some very active bombing by Fritz’s planes but I heard nothing.\n","241":" Very remarkable experience. Rotten day. Snowed in the morning and intermittently all day and was windy making it fairly cold. I decided to go on Sick parade with my teeth and went down with Rice’s Sick parade at 9 to 3rd Field Ambulance. Found there was no dentist there so they sent me on to the 14th Field nearer us. Rice went home so I followed but found I should have waited and got an order at the 3rd so I returned and then on to the 14th where I saw a sergeant dentist.\n\nAfter an interminable wait during which I met F.B. Jose. The dentist seemed very sorry and told me all the gear was at Becordel and told me to return and get a recommendation from the doctor of the 3rd Fd Amb. When I got back it was after 12 and the doctors were away so I came back through all the mud to dinner at about 1 P.M. rested and returned at 2.20 and got my recommendation after sarcastic remarks by the doctor on the red tape. Returned to 14th and after about 3 seconds parley had a wounded docket made out and was told to move all my gear in No 3 hut and wait! Of course I had none so hurried back and rolled my blankets and filled my haversack with some food, tooth brush, and towel, hoping I wouldn’t be away long which I surmised on the conversation with the sergeant. Arrived about 4 and was told to sit down and wait for a wagon. Meanwhile much to my astonishment being treated to lovely hot cocoa and sandwiches of bully and cigarettes. All sorts of cases some pretty bad with pneumonia, Bronchitis etc. Waited on until about 8.30 and then the whole party about 15 set off with a hurricane lamp to the railhead. Ushered into a hut labelled walking cases and there treated to more coffee with sandwiches of sardines, rabbit and jam being told we would probably catch a train in an hour’s time. Cigarettes were again abundant. Told we would be late getting away so got two blankets of which there appeared to be an abundant supply and made myself as comfortable as possible. We were in a round hut supplied with a stove & also a brazier but I was very uncomfortable as my feet were wet an I could feel the mud squelching. Some more cases came in and were treated to hot rum and coffee and more eatables. Destination was discussed Amiens and Etaples being probables. Previously when I came home for my gear I consulted the S.M. & Bolton as to whether I should go as we are to go into the trenches almost immediately & I decided when I heard the rumoured far off destinations to hop off secretly if we passed Albert. However about 12 a train came in and we boarded her. Two carriages or guards vans and we sat as well as we could & had plenty of blankets. Not very cold. Train slowly travelled to Becordel about 6 miles where we got out and walked a short distance to a casualty receiving station.\n","242":" 5th & 15th Fd Ambulance there and heard they had bombs dropped on them a couple of nights previously. Entered a well lit spacious tent with cheerful looking braziers and seats where we rested and received more cocoa & sandwiches and cigarettes. Then we had our tickets examined and ours were marked M.O.S. so we retired with our gear to an outside waiting tent receiving a good pair of dry sox previously. Here we waited about ½ an hour and then came back and were told to make ourselves as comfortable as possible for some time. No blankets and some distance from the fire. I tried to sleep but only partially succeeded as it was cold and about 4 A.M. About 7.30 not coffee, bread, jam and butter were brought in of which I only got some dry bread so I made some toast. later got some cocoa and nice biscuits. Looked a promising day and all the rest barring us were sent out to C.C.S & C.R.S. about 9 o’clock. Then we were shown where to go up on the hill about 400 yards away. Arrived and more by good luck than otherwise went straight to the dentist where he cemented my tooth very roughly & then told me to evacuate which I did being shown the proper road. However, I decided on a holiday so followed the line to Meaulte leaving my baggage at a crossing on the way. Big additions everywhere and a big sawmill where German prisoners were mostly working very happily. Went down the main street and purchased a paper, battery & globe, chocolate, candles and on my way back coffee & 2 buns. 1 o’clock so started to walk back only getting a short ride to Mametz. On to Montauban feet feeling very tired where I took the wrong turning arriving at cross roads near light railway in gully & thence home. Section not gone out yet and didn’t work to-day. Felt very fatigued & after tea had a good wash in dugout & bathed feet afterwards oiling them. Then read papers & wrote this before bed.\n\n \n\n"}}