{"Document Name":{"0":"Diary_0127","1":"Diary_0127","2":"Diary_0127","3":"Diary_0127","4":"Diary_0127","5":"Diary_0127","6":"Diary_0127","7":"Diary_0127","8":"Diary_0127","9":"Diary_0127","10":"Diary_0127","11":"Diary_0127","12":"Diary_0127","13":"Diary_0127","14":"Diary_0127","15":"Diary_0127","16":"Diary_0127","17":"Diary_0127","18":"Diary_0127","19":"Diary_0127","20":"Diary_0127","21":"Diary_0127","22":"Diary_0127","23":"Diary_0127","24":"Diary_0127","25":"Diary_0127","26":"Diary_0127","27":"Diary_0127","28":"Diary_0127","29":"Diary_0127","30":"Diary_0127","31":"Diary_0127","32":"Diary_0127","33":"Diary_0127","34":"Diary_0127","35":"Diary_0127","36":"Diary_0127","37":"Diary_0127","38":"Diary_0127","39":"Diary_0127","40":"Diary_0127","41":"Diary_0127","42":"Diary_0127","43":"Diary_0127","44":"Diary_0127","45":"Diary_0127","46":"Diary_0127","47":"Diary_0127","48":"Diary_0127","49":"Diary_0127","50":"Diary_0127","51":"Diary_0127","52":"Diary_0127","53":"Diary_0127","54":"Diary_0127","55":"Diary_0127","56":"Diary_0127","57":"Diary_0127","58":"Diary_0127","59":"Diary_0127","60":"Diary_0127","61":"Diary_0127","62":"Diary_0127","63":"Diary_0127","64":"Diary_0127","65":"Diary_0127","66":"Diary_0127","67":"Diary_0127","68":"Diary_0127","69":"Diary_0127","70":"Diary_0127","71":"Diary_0127","72":"Diary_0127","73":"Diary_0127","74":"Diary_0127","75":"Diary_0127","76":"Diary_0127","77":"Diary_0127","78":"Diary_0127","79":"Diary_0127","80":"Diary_0127","81":"Diary_0127","82":"Diary_0127","83":"Diary_0127","84":"Diary_0127","85":"Diary_0127","86":"Diary_0127","87":"Diary_0127","88":"Diary_0127","89":"Diary_0127","90":"Diary_0127","91":"Diary_0127","92":"Diary_0127","93":"Diary_0127","94":"Diary_0127","95":"Diary_0127","96":"Diary_0127","97":"Diary_0127","98":"Diary_0127","99":"Diary_0127","100":"Diary_0127"},"Date":{"0":"unknown","1":1057.0,"2":1058.0,"3":1059.0,"4":1060.0,"5":1061.0,"6":1062.0,"7":1063.0,"8":1064.0,"9":1065.0,"10":1066.0,"11":1072.0,"12":1075.0,"13":1078.0,"14":1081.0,"15":1085.0,"16":1087.0,"17":1091.0,"18":1095.0,"19":1096.0,"20":1097.0,"21":1098.0,"22":1099.0,"23":1100.0,"24":1101.0,"25":1106.0,"26":1107.0,"27":1108.0,"28":1109.0,"29":1110.0,"30":1114.0,"31":1116.0,"32":1117.0,"33":1118.0,"34":1119.0,"35":1120.0,"36":1121.0,"37":1122.0,"38":1123.0,"39":1124.0,"40":1125.0,"41":1126.0,"42":1127.0,"43":1128.0,"44":1129.0,"45":1130.0,"46":1131.0,"47":1148.0,"48":1149.0,"49":1154.0,"50":1155.0,"51":1156.0,"52":1157.0,"53":1158.0,"54":1159.0,"55":1160.0,"56":1168.0,"57":1172.0,"58":1185.0,"59":1190.0,"60":1192.0,"61":1195.0,"62":1196.0,"63":1197.0,"64":1203.0,"65":1205.0,"66":1209.0,"67":1210.0,"68":1211.0,"69":1212.0,"70":1214.0,"71":1215.0,"72":1216.0,"73":1217.0,"74":1218.0,"75":1219.0,"76":1220.0,"77":1228.0,"78":1234.0,"79":1236.0,"80":1237.0,"81":1241.0,"82":1242.0,"83":1243.0,"84":1244.0,"85":1245.0,"86":1246.0,"87":1247.0,"88":1248.0,"89":1254.0,"90":1259.0,"91":1267.0,"92":1268.0,"93":1273.0,"94":1274.0,"95":1275.0,"96":1276.0,"97":1280.0,"98":1281.0,"99":1282.0,"100":1286.0},"Entry":{"0":"\n\n","1":" p.m. – Neguilliet – November\n\nThis place tonight, after a very leisurely & quite pleasant trek leaving Romani at 11 a.m.\n\nNo signs of Taubes & their attendant bombs as yet though tomorrow – being","2":" – they ought to treat us to a pyrotechnic display. Though on the whole I don’t mind foregoing my fireworks this year! Tomorrow we reach our destination & - pronounced Gillar.\n","3":" – Hod el Sawart\n\nThis is our destination. I don’t know how to pronounce it – for the time being at any rate.\n\nLast night we had a heavy shower about 2 a.m. There was dead silence everywhere until it stopped & then a perfect volley of facetious remarks were let off. We had to do rather a hurried get-away this morning – having 15 miles to do & thus had no chance of drying our gear.\n\nI did not get wet last night but I have a very damp bed this evening I am afraid.\n\nThis is quite a good place, it has been occupied before & the occupants have left a lot of their improvements here so we ought to be fairly comfortable as things go if we don’t get too much wet weather.\n\nBut nowadays the sky is very English & uncertain.\n","4":"\n\nYesterday the Taube came over & dropped 5 bombs \n\non Bir el Abd – about 2½ miles off killing","5":" Nothing doing today. I have built me an house of palm sticks & sand bags & am now very comfortable, have a fire outside the door every night and a beautiful washing basin hollowed out of solid Limestone – as much as I can lift and Lord knows how old – I picked it up close here – one finds all sorts of queer remnants of pottery & such like on the desert.\n","6":"\n\nAt present I am trying to solve a great problem namely, how to beg, borrow or steal if need be a potatoe to go with some bacon which I am cooking for tea tonight.\n\nOur rations have been cut down now and are supposed to be supplemented by cheese – which of course has not yet arrived – thus I find it necessary to scavenge a bit to produce the evening\n\nmeal which I always cook for myself having plenty of time.\n\nI shall have to get the cook by himself quietly & put it to him with specious promises I think. Another great difficulty here is sugar – it cannot be obtained at any of the canteens at Bir el Abd.\n\nHowever on the whole I don’t do too badly.\n","7":"\n\nMy mind is fast giving way I am afraid, for now I am quite content to lie flat on my back & do nothing, idly speculating & indulging in wholly fantastic suppositions, for hours at a time.\n\nAnd this was a thing I was physically incapable of a year ago, then I was acutely discontent when I was occupied with a book or something. Why is it? It must be lack of exercise for the mind I suppose. Next time I am in Cairo or some civilized place I\n\nwill buy Carlyle or a greek testament or something to make me think to some purpose.\n\nAs it is I am becoming a complete lotus eater or at any rate am reaching that state of mind which the lotus eaters are commonly credited with.\n\nWhen I was at Kantara last I went through Yeat’s kit bag & sent him all his personal effects, amongst which I found a lock of the fair Gaby’s hair which I sent to him with suitable messages. I am interested to see what his answer will be! It has not arrived yet.\n","8":"\n\nVery worried tonight. A colony of enormous black ants, very pugnacious & fully ½ inch long have sudden taken up a residence not three feet away from my head. If I don’t oust them they will\n\ncertainly oust me and I am afraid the odds are in their favour and it will be an awful business shifting my house now.\n\nBut one or the other will have to go.\n\nAbout","9":"\n\nI have spent all this evening sitting on the doorstep (for it has a doorstep) of my shanty with my pipe in front of the fire. A gramophone has been playing about 60 yds. off; the tunes of which transported me from place to place with bewildering rapidity. They played \"Hitchycoo\" and I was in the auditorium of the London Hippodrome with Artie on one side & Jub on the other listening to the beautiful Bonita & her absurd little husband singing. That was","10":" Then amongst others\n\ncame the “National Emblem\" march and I was marching – still a chocolate soldier – down through Ma’adi after church parade one Sunday in Dec. ’14.\n\nThen the Barcarolle and I was sitting in the stalls of His Majesty’s theatre, Sydney with Wills, watching Adeline Genee dancing like a leaf blown in the wind only to wake up & find myself miles out in the desert sitting with a cold pipe before a dying fire & a very uncertain chance of ever seeing such pleasant days again.\n\nMusic of any kind has always the effect on me of producing retrospectives usually to the detriment of the present.\n\nBut let us return even to the relatively\n\nmiserable present for, after all, that is the state with which a “diary\" is concerned if one may dignify this scrawl by the name of diary.\n\nThe black ants proved themselves white elephants in a way – I mean I need never have worried about them at all. I think the rat, in whose hole they established themselves put in the bailifs, anyway they seem to have done a moonlight flit.\n\nMy second package arrived from Khalil Gbrahim Saffi to my great joy the other day; & I forthwith despatched a fifty note with a long letter of counsel & guidance – in French of course – which will probably make him chuckle.\n\nThey dropped four\n\nbombs on Cairo the other day, but we have had absolute peace since the day after our arrival. A hostile plane appeared the other day but was winged by our A.A. guns & forced to unload his bombs on nothing & fly ignominiously, which was exceeding good to see.\n\nI find the pleasure of solitude – my house contains me & me only – very pleasant. I have no intimate companion now, they are all gone – Threlfall killed on the Peninsula, Yeats gone to England, Tommy Rutherford, England, etc. etc., and I find that it is better to be in a position to please yourself than have to consult one whose wishes do not always run with yours.\n","11":"\n\nTonight I am seated on my doorstep – like old Kaspar – but with pyjamas on under my coat, warming my feet at a good fire. I have a cup of hot cocoa inside me and am very comfortable, the only cloud on the horizon being the fact that in half an hour or so I have to go on picket until 12-30, in view of which my socks are now hung up in front of the aforesaid fire.\n\nWhat “the ‘eads\" would say if they knew that I did picket in payjamas on active service! There would be the Orderly Room & notices etc. etc. “For that, while on Active Service No. 37 Spr. M.C. Evans did wilfully & maliciously garb himself while on duty as picket, etc. etc.\" It is an awful thought mais que voulez vous?\n\nI made very excellent meals the last two evenings cooked by myself. Yesterday’s dinner menu was\n\nFried bacon & Fried bread\n\nToast\n\nMarmalade & Swiss milk\n\nTea – Egyptian Cigarette\n\nToday’s ran as follows\n\nFried Bacon\n\nFried Bread\n\nCorned Beef Fried in Bacon fat\n\nCabbages (machon ochies)\n\nToast\n\nSwiss milk\n\nTea - Egyptian Cigarette\n\nNot so bad in fact. I enjoy cooking & eating these meals more than any others. One has to live absolutely for the moment here or else one would die of melancholia.\n","12":"\n\nWe leave this pleasant little camp on Friday morning I believe. I, for one, am very sorry: really it has been an ideal little place as things go out here. However – we are going about 20-25 miles further out to Bir el Mazar a place about 20 miles from El Arish, where I suppose we shall have to “stand to\" in the grey light of early dawn every day – a miserable proceeding. There is no humour in turning out at that hour. Also we shall have perpetual lights out & other unpleasant messes.\n\nI wonder if Marcus Aurelius ever had to do this sort of thing?\n","13":" night\n\nWe are now en route & have halted in a deep valley in amongst the\n\nsandhills. There is very little water here, & though we arrived about 3 p.m. we had not watered until after dark.\n\nThis damned low ground is beastly cold: I am in bed now with my saddle at my head & as cold as a frog. We reach our destination tomorrow.\n","14":"\n\nWe reached this place “Bir Arnusi\" at about 7 p.m. Saturday night after a very boring day. We stopped at some wells about 5 miles from here at 11.30 a.m. to water our horses & we did not get to the troughs until after 4 p.m. Five mortal hours to water a brigade!!\n\nNow we are within about 11 miles of El Arish. We form the right flank of a line of outposts composed of brigades: In fact the entire division is taken up in outpost work, which gives some idea of the\n\nlength of front we have to hold.\n\nThe complete absence of enemy aircraft has got everyone wondering. We have not seen a Turkish plane for nearly three weeks now.\n\nHeavy explosions were heard not long ago & it is conjectured that the Turks are blowing up their ammunition dumps. I doubt it though. I think Johnny has something up his damned sleeve.\n\nIt is rather miserable here now. Lights out at 5.30 etc.\n\nBir Arnusi\n","15":"\n\nWe have not gone yet, having been delayed, for some reason or other. This house I have built me here is a very temporary affair & in fact so much so that it descended in ruins on my unworthy head the other morning!\n\nFor the first time for now three weeks, - Thank\n\nGod – we saw an enemy ‘plane yesterday, it came over from the west hotly pursued by three of our ‘planes and beyond that nothing doing.\n\nAfter the next move – reported only 5 miles ahead – we should be right in the line ‘o stoush; even here they are constantly sighting Turkish Patrols. I believe.\n\nBir Arnusi\n","16":"\n\nMove on tomorrow some 5 or 6 miles to a new camp. Enemy ‘plane over Mazar this afternoon dropped two bombs wounding 8 men. Two of which are not expected to live.\n","17":"\n\nBir el Gererat\n\nThis reminds one of Ararat doesn’t it? but I am afraid our ark will not be here long to rest. Day before yesterday an enemy plane came over & dropped three bombs\n\non the camp without doing any damage. They were very small & made just like an ordinary billy can out of juice with the inside filled with explosives. Probably dropped more with a view to creating a stampede than doing much bodily harm. I have already written a letter tonight & virtue has gone out of me – so – mafesh \n","18":"\n\nGererat\n\nThe noxious ‘plane with the black crosses comes over every day now as a rule. Today it came over & dropped three bombs once again, but fortunately overshot the mark & did no damage.\n\nThe railway has now reached Kilo 129 & is beyond us a trifle but we are well out on the right flank, and are expecting an\n\nattack – any time now. The way the plane comes over daily certainly looks as if something was doing somewhere now soon.\n\nIt is a very miserable existence now for one cannot light a fire after dark & it gets very chilly in the morning & evening.\n\nThank the Lord there is a full moon.\n\nToday is the second anniversary of our arrival into the land of bondage.\n","19":"\n\nTwo ‘planes over today but no bombs on us. I wish I had Vergils VIth Book here now, I am just in the mood to read about pater Aeneas’ traversing the ‘tenebras’ Umbras of Hell. I could really appreciate it.\n\nFor I am lying swathed in my great coat (like Sir John Moore) in my shanty. A candle\n\nis also abnormally swathed in an old canvas feedbag so that all is dark save for an anaemic beam which plays on these pages: while the heat the candle generates inside the nosebag threatens to defeat its own object & dissolve the candle utterly.\n\nI have just dined inadequately & without enthusiasm on dry bread with a modicum of sand for spicing & a cup of alleged tea, which, were it not for the irrefutable evidence of tea leaves ‘Thick as autumnal leaves that strew the Brooks in Vallombrosa’ in the bottom of the cup, I should be inclined to say was concocted by boiling down greasy tins & adding a generous handful of chloride of Lime.\n\nI have nothing to read despite the fact that I have done a house to house canvas for books. Hence my soul yearns hungrily for pithy descriptions of Hell, its inmates & its tortures such as are ably described in The Aeneid Book VI. I am even deined that dog-in-the-manger consolation of going to bed for Bernard has to be fed again at 8 oclock – I am always feeding that beast, it is nothing less than adding insult to injury after such a meal as I have had.\n\nThere is not a soul here that I care much to converse with, that is, with common interests; anyway I am too lazy to hunt him up.\n\nIn fact I have descended to a mental and physical apathy from which I have only strength to rail feebly at fate. I hope &\n\ntrust that it is largely the effect of a cold which I have suffered from the last few days & also the aftermath of Picket last night.\n\nI am going out now to watch the moon rise. It is a wonderful sight some times on the desert.\n\nWhen it rises & shines coldly down on this apparently dead world of giant sandhills & gullies of fantastic shapes one thinks in terms of H.G. Wells.\n","20":"\n\nHostile ‘planes over every day except the","21":" when they took a day off.\n\nAll three regiments have been treated to a salvo of three bombs each so far; but, as yet, thank goodness, none have come near enough to us to justify our doing the ostrich act. Today about 2 p.m. he bombed\n\nMazar & then came over us and dropped four well out of the way about a mile off & then went home. He generally comes over about lunch time, but the other morning he nearly caught us by coming over before breakfast, being almost overhead before we spotted him, however he must have had bigger game in his mind for he dropped no luggage on us.\n\nThere seem to be an enormous number of Scorpions & centipedes around here, which make very unpleasant bedfellows. Saw one centipede among the rations at Railhead (129K.) fully 6\" long, a beauty – R.I.P.\n\nTwo prisoners have come in one yesterday & one the day before; both declare that there are only four regiments at El Arish. But it is\n\nis quite possible that they are \nspeaking\n acting under orders. So the information must be taken ‘cam grano salis’. They also say that there are six ‘planes at an aerodrome at Bir Saba (old Beersheeba).\n","22":"\n\nAnother move now & we are gathering in or trying to gather in a Turkish Outpost on the way. It was to have been tomorrow night but they have suddenly changed it in the last half hour to today so I must stop and pack up immediately. More anon.\n\nEl Arish,","23":" – 7 a.m.\n\nJust arrived after 14 hours in the saddle in El Arish or rather on the farther side of it. We went a very circuitous route going due east from Gererat until we struck the wadi & then down the farther side of it. Not a sign of a Turk. This was the reason why we went a day before\n\nthat arranged as apparently they got wind of the fact that the Turks were leaving & wanted to catch them but were too late.\n\nAt any rate we have the distinction of being the first troops to enter El Arish.\n\nSame Day 7 p.m.\n\nEl Arish is a mere village that is to say a fairly considerable cluster of mud huts with a large graveyard decorated after the native style with rags, bones, etc.; and also a very respectable mosque with as good a minaret as is to be seen in many a larger town in Upper Egypt.\n\nThe existence of El Arish is justified by the fact that it is the seaport for all the dates, melons, etc. produced in the upper half of the Sinai Peninsular: no small item either.\n\nIt was believed that the Turks were holding the place & intended at any rate to make a show of\n\ndefence & thus an elaborate plan of attack was arranged by the big bean knobs. However when news came to them that the Turks had gone they immediately rushed all mounted troops at their command to follow up & give chase. But apparently we arrived too late. We did not expect a particularly strong defence but we did expect an elaborate & strong counter attack. It remains to be proved whether our expectations are to be realized. I hope not.\n\nThey will probably rush Infantry & guns out here, probably a division of the former will arrive tomorrow sometime. We are camped on the further side of El Arish about two miles on close to a grove of palms & the sea.\n\nIt is clear that at one time the Turks expected us to land a force here from the sea, as they have\n\nTrenches & elaborate M.G. emplacements all facing the sea.\n\nThe railway the Turks built out from Jaffa ends about 4 miles to our front. Thus by laying about 15 miles more (our line is about 10 miles from El Arish) the Egypt to Palestine railway will be complete.\n\nIt is extraordinary when one thinks of the vagaries of fortune. Today two men from the 1st Reg. after we had entered the place & everything was quite safe, went bathing & somehow managed to fall foul of a floating mine which had been driven ashore, & were blown to atoms literally. They were both","24":" Conting. men.\n\nI believe outside the sea is sown with mines to keep off the monitors who used to come along occasionally & blow hell out of the place.\n\nEl Arish,","25":"\n\nThis camp is too good to last as usual. There is a move or a stunt or something tonight.\n\nIt is a weary world.\n\n“Mag Dabeh\",","26":"\n\nWe left camp at six p.m. last night for a stunt to beyond Magdaba straight down the Wadi El Arish.\n\nWe arrived there at daybreak having travelled all night as usual & found the turks a few miles further on.\n\nEngaged them & the left flank gave away at once & we have chased them away out of sight. But on the right flank they are still holding us. It is now 1 p.m. & so we have not much time before we shall have to go. The whole division is out & a battery 18 pdr. & the C. Corps & a mountain battery. The horses have had no water since we started.\n\nEl Arish,","27":"\n\nAt 4.30 yesterday the Turks suddenly caved in & all was over. However a fair number managed to get away and also to take their mountain guns with them. Wrong, we got the guns. In all the Division captured 1250 Turks out of a supposed 2000 which was not bad. We stayed out picking up the men until about midnight & then came back here reaching here about 7.30 a.m. The desert was a picturesque sight last night as each wounded man or group had lit a fire to guide us. ‘Magdabeh’ – the name of the place – has three very good stone buildings like schoolrooms – the Turkish Hospital - also a big reservoir with stone troughs. Altogether rather an imposing place for the desert.\n\nThe Anzac Division came off very cheaply about 65 casualties I believe\n\nand one Brigade was almost miraculously lucky in the beginning. It was this way – underestimating the turks capacity for defence or strength, the brigade advanced in close order mounted, to try & rush the position. The turks never fired at the screen – who by the way advanced nearly on top of the Turkish trenches – but waited until the whole brigade, mounted & in close order, mark you, advanced to within 300 yds. of them, & then let go with three or four machine guns & some hundreds of rifles. The brigade of course broke & scattered back to cover & reached it without one single man or horse being hit!!\n","28":" tomorrow on bully beef!\n\nTwo ‘planes over this morning, dropped several bombs but did no damage. They have built a pier\n\nhere & are taking away the wounded in a Hospital ship. A cruiser is anchored in the bay & six mine sweepers are continually at work going up & down like a six furrow plough for mines.\n\nBy the way according to a contemporary of mine there was nothing left of those chaps blown up the other day but “’Arf a bloody ‘ead & a ‘andful o’ guts\".\n\nThe last two nights have been spent entirely in the saddle so I shall sleep very well tonight.\n","29":" night\n\nYe gods what a Xmas! Last year this time I was dancing at Shepheards. This year I am at El Arish of all god-forgotten places!!\n\nWent along & saw Naylor at 52nd Div. H.Q. & he filled me with whiskey so the day has not been quite wasted after all.\n\nBoxing Night\n\nI have to amend my remarks about the last stunt. \nWe attacked & took, not Magdabeh but a place five miles further on by name Bir Ouled Aly, we also captured three\n guns consisting of a battery of mountain guns & several limber loads of rifles, stores, etc.\n\nIt is said that Rafa is also evacuated by the turks.\n\nAm on Picket tonight. My overcoat is already wet through as it has rained before during stables, it is raining now & I will bet ten to 1 that it will be raining when I go on picket again. Curse the war.\n\nThey are landing stores on the shore now from a supply ship. The place will soon be like Anzac. The railway is expected to reach here about the first\n\nweek in January.\n\nIt is rumoured that we are going to do a stunt shortly to Rafa, which, by the way, marks the frontier of Egypt. It is also rumoured that one of our Bedouin agents reports there is nothing to stop us seriously between here & Jerusalem!\n\nIf that is so, the rumour that Kut & Baghdad have fallen is probably true & the turks have transfered their forces thither. Let us hope so anyway.\n\nSheik Zowaiid\n","30":"\n\nOut on a stunt again to Sheik Zowaiid about 12-18 miles beyond El Arish along the coast.\n\nThis is fairly good country out here, there must be well over 1000 acres under crops of corn & several rough sort of orchards of fig trees. We have come out here on a reconnaissance to see if the road is fit for\n\nmotor & heavy traffic & also if the general ground will suit infantry.\n\nFrom my personal observation I should say that the report will be a favourable one. It has rained off & on every day & night during the past week & as we are spending the night out here in the open with no bivouac, I shall certainly be very cold & probably wet through. This place is a big palm grove rather scattered with a mud village in the middle & a big sized swamp – now a lake – alongside.\n\nEl Arish\n","31":"\n\nArrived back from the stunt yesterday without mishap.\n\nWe have had a very promising New Years day, a tremendous sandstorm raging all day and even now (8 p.m.) the wind, though abated, is still violent. This morning three enemy ‘planes over – for the first time for a week – dropped about 12 bombs on the pier here & railhead at Kilo 139.\n","32":" far as I can find out the only damage done was four horses killed & five or six men wounded.\n","33":"\n\nThe weather nowadays can be only described as positively fiendish. Last night I was on picket; from 10 to midnight – my first shift the moon was shining amidst light feathery clouds looking most hopeful. At 4.30 a.m., when I next resumed it was pitch black & raining in a steady downpour. Most depressing.\n\nThe wadi is now running pretty freely between us & El Arish. Another stunt is hatching – originally for tomorrow – but I believe there has been a train accident & our rations & fodder have I believe come to grief owing to the railway bank having slipped somewhere so I don’t think we shall go out tomorrow.\n\nThere is no doubt that the biggest problem in this desert warfare is that of supply transport. Sir Chetwynde the C. in C. of the Desert Column came out the other day & buttered us about the Magdaba affair. It appears it is the first time Cavalry have taken trenches. He also kept us waiting two hours before he showed up, whereat Charlie was very wrath. Do him good.\n\nI wasn’t there myself. \n\nThis next stunt will probably be an attempt to take Rafa, which, if managed properly should succeed.\n\nAccording to Hudson","34":" Bgde. Staff Capt.), there are 4 battalions of turks with a battery of guns. We shall probably have a cruiser – Rafa is on the coast – a couple or so of batteries & several battalions of Infantry who will make the frontal attack\n\nwhile the Anzac Division probably plus C Corps will attack a flank. Sure to be plenty of stoush anyway.\n\nThe railway embankment has now reached El Arish, where it will probably stop until they bridge the wadi.\n\nA trawler ran ashore the other night & is now lying on her side in a big surf. Would make an excellent photo if the sun would come out. The wind has been cold as charity lately & I am seriously considering the advisability of two shirts.\n","35":" p.m.,","36":"\n\nThank goodness, the weather has broken & now we have had two perfect days with sunshine – and Taubes. They only bombed today though, two came over about 11.30 & dropped several big bombs killing 28 & wounding 14 natives with one bomb! Dropped three bombs amongst\n\nthe 2nd Regiment killing two horses & wounding one man slightly – so that he can still walk but not sit down. Our A.A. guns had arrived from the Train just in time to greet them & by bad luck the shell cases fell all around us & some of us had narrow squeaks from being hit by our own empty shell cases.\n\nIt was a replica of the throwbacks of the bombs we used to get every evening at Quinns Post so was more used to it than most, though it was very unpleasant. The stunt to Rafa is at last realty coming off tomorrow evening I think. As far as I can gather it is two days, Anzac Mt. Div. on one flank, 5th Mt. Yeomanry Div. on another flank & Infantry frontal attack plus five batteries of artillery. There will be something doing all right.\n","37":" night 9.45 p.m.\n\nThree taubes have just been over & dropped about 15 bombs. The first night raid we have yet had & I devoutly hope that it may be the last. I had to turn out in pyjamas & stand out with Bernard in the bitter cold for about half an hour. There is a full moon so while we could not see him he could probably see us against the white sand. It was miserable.\n","38":" a.m.,","39":"\n\nOutside Rafa\n\nI was wrong; there are no infantry here, only five brigades of Cavalry & two batteries of guns, which guns have just started in.\n\nThis is to be a raid, even if we take the place we shall not hold it, but return on the 10th.\n\nTwo prisoners already captured declare that the numbers are 2000 turks, 40 germans & M.Gs.\n\nThe Rafa Raid\n\nEl Arish\n\nMidnight,","40":"\n\nWe have just returned to camp. A most curious affair from our point of view. But I am too tired to write tonight, & sleep too precious so I will report it in the morning.\n\nJan. 12th\n\nSoon after the guns started to fire, we found that the turks’ artillery consisted in a battery of mountain guns with which they did very little & pretty bad shooting. The Turks were esconsed in trenches & redoubts along a fairly high ridge. A very strong position as the ground sloped gently for about two miles in front of the ridge containing not a single inch of cover. At about 10 a.m. the whole brigade opened out & advanced at the trot extended along this open ground; reached to within about a mile of the redoubts & then dismounted & the horses were taken well back.\n\nWe got into a little dip in the ground next Bgde. H.Qs. & remained there all the morning.\n\nThe attack proceeded & at about 2 p.m. our fellows got into the turks first trenches & - horrible dictn.! – were shelled out by our own artillery who were going hammer & tongs all the while.\n\nAt about 4 p.m. things got very willing & we were having a lot of casualties. I went out with another, Robertson – not the same as at Romani – to go up to the support trench. We had not gone half a mile across the flat when Robertson stopped one in the groin & fell off his horse. We bundled him into the sand cart, it being too exposed there to dress him & went on.\n\nI was riding the other side of him thus making the second time that a Robertson has stopped a bullet that would otherwise have stopped in me.\n\nWe reached the support trench which was a slightly sunken track – we had no trenches or tools - & picked up all we could & back again. As we left this road, our fellows began to turn it up & retire. I heard the 1st Reg. Colonel telephoning to Bgde. H.Q. that if necessary he could hold on but could do no more.\n\nThen when we came back from the road our fellows were retiring pretty fast & finally when we reached our place back next Bgde. H.Qs. we were informed that the Turks had surrendered! Of course what really happened was that the Yeomanry were pressing on the other side.\n\nIt was now nearly dark & still a lot of wounded to get in, we got them altogether & then followed a weary wait for sand carts to arrive: these not being nearly sufficient transport. Added to which 2000 turks were coming to reinforce the now surrendered\n\ngarrison of Rafa & we had to clear out before they arrived. And it is very unpleasant when you can do nothing but wait while any minute some turks may turn up. However by packing 4 & 6 into one cart we finally cleared up & reached Sheik Zowaiid at about 6 a.m. on the morning of the 10th. Here we found about 300 wounded lying in our tents – for our Hospital staff was acting as clearing station. They had not expected anything like so many casualties & thus had run out of stores & food & bandages.\n\nHowever during the morning some stores came by aeroplane & some more by four armoured cars. We sent away about 200 wounded during the 10th & were left at night with about 40 of our men & about 80 turks & 5 German officers. One of the Turkish officers could speak French so I doled out the rations for the wounded prisoners explaining to him\n\nin French & he interpreting to them. The wretched turks were crowded 40 in a big marquee & the scent of suffering humanity was awful inside.\n\nFinally at midday on the 11th we started to El Arish with this remaining 140 on board & finally got rid of them to the clearing station & reached camp here at about 11 p.m. fairly done up having had about 7 hours real sleep since the morning of the 8th. It was a great success as a whole though we paid a large price.\n\nI believe the casualties for the whole of our force are about 600. This unit lost two men, one shot through the chest & the other Robertson who, poor chap, died late the same night & was buried out there.\n\nThe Anzac Division got a great reception on its return here. The pipers of the whole 52nd Division turned out & played them into & across the wadi. A very nice compliment.\n\nOf prisoners we took 1436 & it is estimated that there were between two & three hundred left dead upon the field & well over 100 wounded. In fact we accounted for about 2000.\n\nAlso we got a battery of mountain guns – 10 pdrs. & several Emma gees. It transpires that the force of turks reinforcing though only three miles off at 4 p.m. never came much nearer & a squadron of the 8th Reg. patrolling on the","41":" met some Turkish Cavalry & Camelry & scrapped & took 14 prisoners with no casualties.\n","42":"\n\nI heard a rumour today – whispered at Bgde. H.Qs. & unwillingly admitted when pressed at Div. H.Qs. that later on we are going to Moascar (near Ismailia) to reorganise & then proceeding to Port Suez as there are said to be turks advancing that way. It may be\n\nright, indeed, from what I know it seems to be right.\n\nAbout","43":"\n\nTwo ‘plane raids since I last wrote, but both very feeble affairs consisting of only three bombs each. We have more A.A. guns out here now & they have got them thinking all right, so now we seem to be fairly secure from them. Just finished my bi-weekly drink – they give us rum twice a week now. I am getting to like it though the only way is to take it neat as it is poisonous stuff when diluted, tasting so terribly crude as compared with whiskey.\n\nNo whisper of another stunt yet, though I expect there will be one soon. They are making this place a second Romani with barbed wire redoubts, etc. etc.\n\nI hope to goodness that this Moascar rumour turns out correct, for then I may be able to get up to Cairo & get my teeth fixed, they want it badly again. I also want to see Curtis again & ask him about the Agricultural opportunities of this country. I should very much like to get a job here when the war is over. I consider that it would be an ideal country to live in, as I don’t think that I could live in England after the way in which I have stewed here. I am now trying to get into the Camel transport of this unit, with a view to learning a bit of Arabic, but I don’t know whether it will come off or not. It is really disgraceful to have been nearly three years in this country & not be able to speak Arabic.\n\nJan. 21st\n\nAs you were!\n\nJan. 24th\n\nThey seem to be cheery crowd of blackguards down at the details at Moascar. From the tales I have heard several fellows have been “stoushed\" & their money taken off them. Amongst other tales, one fellow tells of how a certain crowd when on guard were not allowed to leave the guard tent when off duty, so they each take hold of a part of the tent & the tent marches up to the canteen, the inmates have a drink & back it comes again!\n\nAs usual I clean forgot my birthday again this year, even though it marked the transition of a legal infant into a legal man. Last year it occurred when we were trekking out to El Ga’ai. \n\nThere is a move on about which two reports are current: one saying that it is a move forward\n\neight miles – which I am afraid is correct – the other that it is back to Kilo 139 & from thence leave to Cairo with the second Bgde. taking our place in the front line.\n\nCertainly our two months is almost up & we should be relieved soon, while the second bgde. is as a Light Horse man said “a – gentleman turnout\" for they have done no scrapping since Romani.\n","44":" p.m.\n\nWe have been lucky, about half an hour ago the outpost reported a ‘plane approaching the camp & then a few minutes afterwards reported it going back again.\n\nEvidently it was forced back by a sudden squall of wind & rain which has been raging since about 8.30 p.m. \n\nTales have reached us today of a general ‘stoush-up’ in Cairo, the N.Zs. versus the\n\nAnzac Police Corps, the latter coming off second best, the alleged reason being that some of the police reported two sisters – from","45":" General for overstaying leave. They are a low crowd any way – the Police I mean, most of them can be squared, & a lot of them are the worst cold footed scum of Australia. I am glad they got it in the neck. But I believe it means the end of Leave.\n\nHeard a faint rumour today of our next move. Apparently three places to be attacked simultaneously, Infantry to attack Bir Saba & also Gaza & mounted troops to attack some place further south. The","46":" Reg. came in here yesterday, the Yeomanry taking over their camp.\n\nWe did not go out there after all.\n","47":"\n\nEl Arish\n\nThe Turkish ‘planes came over the other morning when it was very misty & dropped about 10 bombs – two in the sea.\n\nOn clear days they usually come over but are kept at a distance by our A.A. guns. I got a fright last night, I had just blown out the light & turned over when I thought I heard a ‘plane coming. I heard it for about 5 mins. but did not like to say anything for fear that I had what is known here as taubitis.\n\nFinally it became unmistakeable & turned out to be one of ours. Tonight I have got nerves badly as it is a brilliant moonlight night, the moon is practically overhead & altogether an ideal night for them & we were over there last\n\nnight – so I am continually imaging I can hear a ‘plane. I long for the time when I shall be no longer always subconsciously on the alert for unaccustomed sounds. Immediately after the next pay I am going to importune the Colonel for leave to Cairo to get my teeth fixed up, they want it badly.\n\nThere seems to be no chance of general leave for this bgde. though the","48":" are getting it.\n\nThey have two wire roads down here now one on the beach & the other on the south side of our Camp.\n\nThey have this road – composed of four widths of wire netting – right from Bir el Abd & I believe even further. It makes the sand practicable for Infantry to march on & the estimated cost of it is £250,000!!\n\nI had that from Naylor ex pupil of Aldenham now A.D.C. to the General comding. 52nd Division of Infantry so it should be right.\n\nThere are strong rumours & apparently they are correct too of eight tanks now at Romani. Indeed two of our chaps declare they saw them on the train covered of course with tarpaulins. If so these should be of value if we can get near enough to the turks to use them.\n","49":"\n\nEl Arish\n\nPity the poor soldier on the eve of a trek! So many valued possessions have to be jettisoned. We are moving back 60 miles on Saturday, the truth to go on lines of communication. It is somewhere near Romani & horribile diction, some seven miles from the railway.\n\nHowever it will be fairly peaceful there I expect\n\n& when we get settled I will put in the petition to the Colonel that I have written, a tale about a yard long showing why it is absolutely necessary to go to Cairo to have my teeth done.\n\nThe 53rd Inf. Div. moved out to Sheikh Zowaiid today. It looks very much as if the Inf. are going to take over this front now & it is quite possible this move of ours may be the first step to Salonika or Messypot .\n","50":"\n\nOff tomorrow morning. I suppose on our last night here we shall be bombed – I would not be surprised.\n","51":"\n\nKilo 139\n\nHere I am again under the open sky, with my saddle at my head & the fear of rain growing at my heart – to say nothing of probable ticks.\n\nIn truth it looks very like rain tonight – we had one shower this morning.\n\nThey are talking now of this\n\ncorps & one bright specimen reckons that the only thing that is wrong with it is that “there are too many bosses, this outfit is worse than the Yanco Irrigation Scheme\". The same man – who is rather renowned for his original, if sometimes very vulgar bons mots - was also rather amusing at the expense of one very long thin individual who we have. Nothing if not original what?\n\nRumours of a stunt 15 miles beyond Rafa if so, we of course shall be out of it. Not sorry on the whole. Engineers declare that they will have the railway out at Rafa by the 28th inst. Next stop Mazar.\n","52":"\n\nMazar\n\nIt did rain last night but fortunately I managed \n\nto keep the wet out with complete success.\n\nComing into this place we had to go down a steep bank & over the railway, & the bgde. going in column of route over this managed to pile about a foot of sand over one of the rails & thus derailed several trucks of the next train that came over.\n\nTonight there is brilliant lightning going & thunder in a semicircle all around us but it has not rained yet but it is almost a certainty that it will. So far as I can gather we get to our destination tomorrow – Bir el Abd – a distance of 23 miles, a long trek in this country, but we may make two days of it.\n","53":"\n\nTillul\n\nWe are making two days of it after all.\n\nSleeping tonight under a sand cart & my stock of expletives is entirely exhausted on account of my frequent fracas with\n\nthe axle. Rained very much last night together with a rushing mighty wind but kept dry myself fortunately. Bir el Abd tomorrow.\n","54":"\n\nBir el Abd\n\nReached our destination at last. Am on picket tonight & have been very fortunate as the drivers are having a birthday to celebrate the proximity of the Cantecus & thus I have had about a cup full of neat whiskey forced down my neck also much cake, they being in the state in which they would give away there last shirt if anyone hinted that it was needed. At present they are arguing in strident tones on the old theme – the respective writs of their teams – and are being very funny about it too. It seems we shall be here for a couple of months at least.\n","55":"\n\nHave not written up this weighty tome for a long time, mainly because there has been nothing to say.\n\nWe have enjoyed a blessed immunity from enemy ‘planes & life has pursued a very even tenor.\n\nFrom the","56":" to the","57":" I spent in Cairo at the National Hotel – quite a good place. Had a very quiet time mainly visiting friends amongst whom I find that the Curtises – who gave me a great evening at Shepheards last year – have come into a baronetcy! Also I was nearly run over by the Sultan in a huge red car so I moved in very exalted circles. I brought back a good Arabic grammar & have started to study it. I hope to join the Camel transport soon so that I hope to be able to get a fair amount of practice & should be able to pick up a fair idea of it.\n\nHere we are camped beside the railway & can hear the trains shunting at night – which is delightful after the eternal silence of the desert. I enjoyed the days in Cairo chiefly for the baths & cleanliness, in fact I garbed myself in clean silk under things. Vanitas vanitatum: omnia vanitas! But it was very pleasant all the same. It seems that we move out east again in about three weeks for a concerted attack upon Challal where the turks are said to be dug in 15000 strong. We have any number of guns, six or eight “tanks\" & plenty of infantry so it should be a success.\n\nAbout","58":"\n\nLo & Behold it appears that immediately after Kut fell, the Turks evacuated Challal & Bir Saba!\n\nI believe that it was touch & go whether we were to be moved out there at an hour’s notice a couple of\n\nevenings ago but apparently word came through just in time that the N.Zs. had taken possession without firing a shot.\n\nThey must, I think, have gone to reinforce their friends in Messypot, which is very excellent for they had strong positions which would have probably cost much blood & money to take.\n\nAlso, this evening I am told that they have evacuated Gaza & that our ‘planes spotted them on the march & dropped 1½ tons of bombs on the poor devils.\n","59":"\n\nFor the last three days we have heard nothing but the continual rustle of sand blown against the tent by the (Khamseen).\n\nToday thank goodness it has stopped.\n\nAnother move in the air. To come off in a few days to El Arish.\n\nBir El Abd,","60":"\n\nTomorrow we start out to trek to El Arish by easy stages, taking, I believe 4 days in which to cover the distance. As usual yesterday was a regular Saturnalia – drunks all over the place. Even today whiskey has been the chief article of diet. Staff Serg. Earle filled me with whiskey almost by force during evening stables & then commiserated with me on still being a Tpr. \n\nBernard is very poor indeed just now, has, in fact been ailing for about 10 days & is now as poor as a rat; & will not, I am afraid, carry me to El Arish.\n\nThe trains have been very irregular lately owing to sand being blown over the line by these pestiferous winds lately. Tomorrow, I hear, they are holding a big race meeting at Raffa, open to all the desert column, so\n\nthere cannot be much doing out there, even though it is in the front line. Read a delightful book the other day of Ireland & hunting by Dorothy Congers called “The Arrival of Antony\", made me quite homesick for the East Devon & Woodbury Castle. Sed vanitas vanitatum; omnia vanitas.\n\nKilo 139,","61":"\n\nHad three very good days for the journey & arrive at El Arish tomorrow. Bernard has improved wonderfully in fact it must have been exercise he lacked.\n\nYesterday a Taube went over us & we knew nothing about it until we reached here today (fortunately or I should have had the palps).\n\nThe desert is very pretty now in one or two little odd corners, as all the sheltered slopes are a mass of dandelions white & yellow daisies & stunted poppies making a very pretty scene.\n","62":"\n\nOn our arrival here – Kilo 152 where the","63":" Bgde. were camped – we were met by two hostile planes which were fortunately beaten off by our guns before they could do any damage. I believe that yesterday our troops went out to Gaza from Rafa – which is now the front line – but I don’t know if it is true or not.\n\nWe have heard the A.A. guns shooting at hostile planes nearly every morning but they have been a long way off.\n","64":"\n\nGreat guns booming all day today – the real attack on Gaza is in progress.\n\nAccording to what I can hear there are 15000 turks there & we have either two or three Infantry divisions attacking. The guns we have heard all day today must be the monitors as it is 50 miles away & otherwise we could not hear them.\n\nAll the evening the ‘birds’ have been returning home to roost – the aerodrome is about 7 miles behind us.\n\nB H.Q. have received orders to hold every available officer & man ready to escort prisoners of which there are reported to be already 4000 which, if true, is excellent. I am on picket tonight from 2.30-4.30 a.m. so shall be able to hear if the guns start again – they knocked off at about 7 p.m. this evening – which possibly means that the place is taken but I doubt it. It will probably be an affair of a few days. Though I should probably be very scared, I am sorry to miss seeing it for it seems to be the biggest thing that has yet happened out here & the tanks would be worth seeing.\n","65":"\n\nReticence seems to prevail concerning the happenings at Gaza.\n\nWe have not heard any more of the big guns. There are two main rumours about it out – that we took Gaza & 500 prisoners but the arrival of a three mile long column of Turkish reinforcements made us retire onto a previously prepared position, where we are waiting for the Turks to bring all their available reinforcements & then we are going to attack in force & smash the lot up thus making a decisive affair of it. Also they say that the turks have 9\" guns & that our artillery is absolutely out ranged.\n\nThere are three facts which I have seen with my own eyes. 1. A one gun monitor went up past El Arish this morning. \n","66":" Two hospital trains have come back so far. \n\n3. Eight “Tanks\" went up on the train this morning.\n\nThe latest rumour is that – this comes first hand from the Sigs. Troop from a man who saw the telegram – we have captured 800 turks, 45 Austrians & 5 germans & two 4.5\" guns & that street fighting is in progress in Gaza at the present time.\n\nSo what is a man to believe?\n","67":"\n\nI have refrained from writing anything about Gaza for the excellent reason that I know nothing beyond vain imaginings. The newspaper report says 900 prisoners, H.Q. staff of Gaza & 2 4.7 guns so the facts must be true. Of course the paper gives one the impression that it was a brilliant victory but … I dunno.\n\nFor all we hear here only fifty miles behind we might as well be in London – I wish we were. Either next Friday or Sunday we go up to Rafa & shall\n\nprobably take a hand in the scrap if it is not already finished. In fact bathing is a peaceful life.\n\nHowever “let not the future perturb you for you will meet it if so be, with the same reason which is yours to meet the present\".\n\nApril 5th\n\nSheikh Zowaiid, Good Friday.\n\nTonight we are at this place on our way to Khan Yunis a spot about 6 miles N.E. of Rafa. Here we shall be in the front line with all its attendant discomforts & a certainty of taking a turn in the scrap at Gaza before long.\n\nNews tonight came that a Taube bombed Romani the other day, our informant telling us that he came so low that “you could ‘it ‘im with a stick\".\n\nGood Saturday\n\nKhan Yunis\n\nWe entered Palestine at about 1.35 p.m. today, passing the former scene of one scrap at Rafa.\n\nThis is a delightful spot\n\n- at any rate to our sand glazed eyes – consisting of a long valley about 5 miles long by 2-3 wide all under fairly intense cultivation with prickly pear boundaries marking off the fields & very heavily wooded with orchard trees. The town or village of Khan Yunis is the usual rabbit warren of mud houses – through which we passed.\n\nIt has in the centre an old mosque or fort whose architecture appears to me – not that I know much – more gothic than the usual style of Arabic buildings, it is built of stone & has a fine central arch which is certainly gothic in style. Possibly the Crusaders had a hand in it as they were in these parts, & buildings last a long time in this climate.\n\nOne of our planes has just gone over – it is full moon tonight. I am writing by its light. More anon.\n\nEaster Sunday\n\nKhan Yunis\n\nThe enemy ‘planes are very active now, one came & saw us off when we left Sheikh Zowaiid & again saw us into camp here, so they know all about us.\n\nThe railway goes on from here – I understand for about 5-6 miles & ends about 400 yds. from our first line trenches! The turks are a few miles further on from there.\n\nAs far as I can make out, we seem to be up against the stone wall of the enemy by guns which – they say – outrange anything we have produced up to now. However I believe we attack again on Tuesday. There is a rumour current just now that we & the 4th Bgde. are going to Shellal which the turks have reoccupied, to hold them from attacking our flank or communications. However time will show. I think we are in for a damned hot time wherever we go, so qu’importe?\n\nDeir el Bellah \n\n13th April, Thursday\n\nI thought I was right about the old building at Khan Yunis – it was built about 1172 by Richard Coeur de Lion on his crusade. I & another fellow are now out on our own at Dei el Bela which is about 8 miles from Gaza in which 30000 turks are now reported. We are going to attack it shortly with 3 divisions of infantry & one in reserve, 2 divisions of cavalry, 8 monitors from the sea, much fairly heavy artillery – which are rationed for each gun continuous firing for 48 hours & 8 tanks so if it is not muddled up we ought to take the place.\n\nOn Tuesday Riches & I set out from Khan Yunis to get camels in response to one of their brilliantly lucid telegrams saying “send two men to 2nd Immobile Sect. at Railhead to escort camels\".\n\nWe thought we should be back the same day. We did not know what the Immobile Sect. was or where it was\n\nor how many camels to get so we thought we would go to D.H.Q. & find out. So we first landed after much questioning at Desert Column H.Q. That was no good. Hence more questions, the upshot of which being we reached Imperial Division H.Q. There, being desperate, I bearded a Colonel & he led us to Anzac D.H.Q.: the haven where we would be. There we found George Whiteford who told us that the 2nd Immobile meant the 2nd L.H.F.A. which we found at his direction. Here we were told to wait, which we did, cadging food & blankets until next morning (Wednesday).\n\nThen came another delightful order – “3 Camels may be drawn from C.T.C. & when loaded returned to C.T.C. in charge of 2 men from","68":" L.H.F.A. with 24 hrs. rations.\" We trotted up to the C.T.C. with this & were regarded as a little mad by the O.C. of them who gave us a note to D.H.Q. again.\n\nAsking for an explanation, here we found that we should have gone to the Anzac Water Convoy Camels not the C.T.C. (as it expressly directed). Thither we repaired & got our three camels & took them to the","69":" L.H.F.A. & I loaded them up, while Riches went back to Khan Yunis to get our blankets etc. Then I brought them back here (the Anzac W.C.C.) & here we are living having made a house out of the load of stuff. What we are going to do next Lord knows, however we are very comfortable here with natives looking after our horses & nothing to do.\n\nOur front line trenches are about 3 miles ahead & occasionally there are outpost scraps & artillery duets but otherwise things are very quiet. Curiously enough, though they have a splendid target so far the taubes have not bombed us & I am told they have not done so for weeks! Why I don’t know.\n","70":"\n\nWe are within range of the Turks by guns after all. This morning they slung about 30 big H.Es. onto our big A.S.C. dump at Railhead. Gives one a cold sweat to hear them burst especially when one is within range too. They make a wicked noise.\n\nLater, 7 p.m.\n\nHave just been watching the tanks, they started off for the front line to night taking hedges, ditches & even a railway line in their stride. All had names, H.M.L.S. Tiger – Kia-ora – Ostagel – Ole Lukie – Archibald, etc. etc. Eight in all. Armed with 2 six pounders or else 2 machine guns each side. Inside rather like the cab of an engine at the end-gauges, etc. Mechanism of the motor tractors runs down the centre while the M.Gs. or 6 pdr. guns are mounted in barbettes sticking out each sides. One of the crew told me that the temp. inside even in England reached 115°! Bernard amazed absolutely & very uneasy.\n\nTaking 18 empty Camels down to Khan Yunis tomorrow morning at 7 a.m. Tanks crew reckon that we attack tomorrow morning mais juoi je ne pense pas.\n\n16th April\n\nDeir el Belah\n\nI think we attack tomorrow morning. St. L & I have a job of taking out a convoy of 80 camels in case of emergency to anywhere that they may be required & as the officer in charge is Irish & town-bred & from all accounts is a bit of an idiot St. L. & I have been studying maps & compasses all the morning with a view of nursing him. It is now dark & we have had no orders yet; I hope we shall spend a peaceful night. It wouldn’t be much good us starting in the dark for none of us could find our way. I suppose tomorrow morning they will lift the lid off hell.\n\nToday we put several H.Es. into Gaza. Must have been an 8 or 9\" gun I should think.\n\nIf no orders come for us\n\ntomorrow we shall be practically freelances & can go out anywhere we like.\n","71":" a.m.,","72":"\n","73":" monitors off the coast here creating hell started at about 5.45.\n\n8.30 p.m.\n\nAs yet no call on us. Rumour current that the Infantry have taken by 7 a.m. this morning all positions which they reckoned upon taking the day to occupy. \n\nSaw Capt. Macarthy & first impressions certainly confirm the idea that his is a blithering idiot.\n\nOn the face of it everything seems to have gone very smoothly, no-one has been galoping up to demand reserves of this & that in a frenzied manner as is too often the case, but of course we don’t see much.\n","74":"\n\nStill here, though we are told that there are great possibilities of us moving\n\nout today sometime. Yesterday was fairly quiet but this morning ever since daylight there has been a particularly intense bombardment which is still going – it is now about 9.30 a.m. It is in fact so fierce that it sounds more like rifle fire on an enormous scale than artillery.\n","75":" p.m.\n\nNews (authentic ?) has just come that the Turks are evacuating along the road to Jaffa. The guns certainly sound a good deal farther off. And the monitors have gone up the coast.\n\nWe shall probably be moving up tonight.\n","76":" p.m.,","77":"\n\nWe were called out last evening about 5 p.m. and it was a chapter of petty but annoying accidents. S.L. was sent away on an errand just as we started & I waited for him, thus we did not start after the camels until after dark & finally missed them altogether & were left to find our way to Tel el Jemmi (whither neither\n\nof us had been hitherto) in the dark. However going across country by the stars we got about half way when by great luck we fell in with a few Yeomanry going there & went with them.\n\nArrived there about 8 p.m., we waited until 1 a.m. for the camels who had missed the way, got them loaded & started back by the motor load at 2.30 arriving at railhead shortly after dawn, a tiring & annoying trip. Today was profitably put in sleeping.\n\nI hear that the infantry have done all right, but the mounted troops have got cut up a bit & the position at Tel el Jemmi seems to be stalemate.\n\nGoing out to Tel el Jemmi I saw some fireflies for the first time in my life, very curious that they should be here as it is not really in the tropics. There was only an occasional one or two but enough to show\n\nthat their effect would be extraordinarily pretty when flying about in large numbers.\n","78":"\n\nOur attack has blown out. Our people seem to have a habit of putting two & two together expecting to make five & then find out that they only achieve three. In short they under estimate. The right flank which was considered the soft job & was delegated to the mounted troops was unforceable & thus our left could not advance for fear of being outflanked.\n\nAnyway we are stuck up here – as far as I can see – indefinitely. Meanwhile we, H.S.L. & I, have been leading a blameless peaceful (busy ?) life at the C.T.C.\n\nCost me 10\/- to get Bernard shod today. Curses on the heads of our lazy farriers. \n\nHad a miserable heat wave the last three days, the Temp. being anything up to 120°.\n","79":"\n\nToday we shifted our Caravan to another section of L Comp. C.T.C., about 200 yds.\n\nThis is a very good job, we have now got a dugout which is positively palatial. It is below the ground & entrance is made by descending three steps, there are raised beds (of soil on either side & a passage down the middle terminating at a table at the head of the beds. We cook our own food, have a boy to wash up. No pickets to do or other duties beyond feed & watering our horses. The only fly in the cup of my contentment is that I found a louse in my shirt this evening. The first since","80":" However one is bound to pick up occasional strays amongst all these natives.\n\nRumour of another attack\n\non Monday, but whether local or general I don’t know.\n\nI could do with this job until the end of the war, but I expect it will end only too soon.\n","81":"\n\nYesterday we heard that the Turks were expected to attack at 8 a.m. in the neighbourhood of Shellal but I don’t think anything came of it.\n\nOur quarters here continue to be improved. Yesterday I put in a kitchen range with oven etc. complete, which works very well.\n\nThis morning I banked up the edge of my bed with sand bags, a great improvement.\n\nHave not caught any more lice on me yet, so I hope that one was a mere stray.\n","82":" p.m.,","83":"\n\nJust had another ‘mauvais quart d’heure’. Those damned ‘planes have been over again – it is almost full moon & have dropped about 20-30 bombs. Thank goodness that\n\nI could stay quiet & comfortable in our dugout & felt more or less safe but still they were very unpleasant. None dropped very close to us, though I was surprised that they didn’t have a go at the camels.\n\n10 p.m.,","84":"\n\nTonight of course our ‘planes have been on the rampage. We suspected that they were our ‘planes but still we felt impelled to blow the light out & give little apprehensive shivers as they droned their way overhead. Queer how nervous this sort of thing makes one.\n\n10 p.m.,","85":"\n\nFor the second time in three days our nightly game of crib has been interrupted.\n\nThose Taubes have been at it again!\n\nDropped about 20 bombs & set fire to our supply dump at railhead but fortunately none came near us. Our A.A. guns replied\n\nbut very wildly. It is full moon tonight so I hope they won’t come over again during the night.\n\n10 p.m.,","86":"\n\nWe have had our game of cribbage undisturbed tonight, but very likely they will come over later on. After they had gone last night, our ‘planes were buzzing about all night, so we must have strafed them considerably. The Blaze they started last night was the dispensary marquee in the 53rd C.C. Hospital. I went down there this afternoon & everyone is dug in.\n\nThe canteens have all been sent back to Rafa with the exception of two who are not allowed to have more than 3 days stock. It looks rather as if they meditate clearing out if the Turks attack. If it is true what the E Mail says that the Turks have 5 In. divs. & Cavalry, it is quite possible.\n","87":"\n\nThey did bomb us last night & made a very protracted affair of it too, dividing their attention between us & Khan Yunis & coming over first at about 9 p.m. & then about 2 or 3 a.m. Now we lie in bed in the spirit of Kismet & hope that they won’t lob one too near.\n","88":"\n\nMist last night & the taubes did the same. Oooooh.\n\nDeir el Bellah\n","89":"\n\nNothing at all has been doing of late. Guns are heard of course at all hours of the day & night but lately they have slackened off a great deal.\n\nThe Taubes have not been over again.\n\nWe call our home here “Avilion\". Certainly it lacks the three Queens with crowns of gold & also fortunately we are not here for the specific purpose of healing a grievous wound. The “Bowery hollows crowned with summer sea\" \n\nare here as we are next door to an orchard of almonds & pomegrateates. Anyhow I suspect the whole idea of Avilion was a rest cure & we are certainly getting that one, days pass in a regime something like this.\n\nOne only gets up, feeds the horses & gets breakfast. 9.30 a.m. we usually proceed by slow stages to the beach where we water the horses and bathe until lunchtime. After Lunch, literature or cribbage. 4 p.m. one waters & feeds the horses while the other cooks dinner (grilled steak, mashed vegetables, tea, toast & jam & cheese). After dinner more literature or cribbage & after a cup of tea at about 9 p.m. we usually seek our beds. What more could a man want on active service, almost in face of the enemy? However I am afraid it will blow up with a loud report soon.\n","90":"\n\nLast night was, I consider the worst I have spent during the nearly three years of haphazard living which I have endured. A Khamsene was \n\nblowing from the south all day & the temp. was about 100-105°. The wind instead of dying down – as is usual – upon the approval of night, increased in violence until a gale was blowing which continued all night.\n\nPicture us – if you can- in a six x six dugout 2 feet down protected all around & on top by sacking only. The candle guttered & wilted from the heat (we used three in as many hours). The dust would blow in through the sacking like slow puffs of smoke and settle on everything.\n\nFinally you had to lie with the lightest clothes on & get covered with dust or else get under a blanket & sweat.\n\nIt was so hot & stuffy & dark that it was impossible to tell without feeling whether one had a blanket over one’s head or not. I got about 3 hours doze & then woke & got up about 5 a.m. with eyes, ears & nose full of dust & found a layer an inch thick over everything. We moved about 400 yds. today to a new camp on sand & mercifully the wind & heat have ceased.\n","91":"\n\nI think I shall have to put down “situation unchanged\" as in the official reports as nothing seems to happen much, we live in a world of trivialities.\n\nOur positions have chrystalised into my friend being stable boy & myself cook at which I am beginning to fancy myself not a little. I must spend quite 10 minutes of or more every day working out the menu for the day as it is quite a business to devise different dishes from much the same materials. Also we are somewhat lacking in the matter of cooking utensils as they consist of one mess tin & 4 billies (ex fruit tins).\n\nI went so far as to try my hand at pastry the other day (I have rigged up an indifferent oven from a big biscuit tin.\n\nI decided to make a jam tart. I mixed flour & water & used the handle of a mallet for a rolling pin & it looked fine. But the flour\n\nmust have been whole meal or something for it went as hard as bricks & tasted like a biscuit, however we voted it a good change. After eating it I felt horribly sick but the other chap seemed all right so of course I didn’t say anything. It may not have been the pastry anyway.\n\nYesterday we had a great meal. a tiny round of roast beef with roast potatoes & boiled cabbage, a rice pudding as a sweet & then a dessert of two apricots I had bought that afternoon off a little village kid for a pinch of tobacco. Breakfast is a good meal too. Usually porridge, bacon, fried bread & chips. Lunch is usually of the cold variety bread & jam etc. We get one of the to get us tea.\n\nI tell you Avilion is not a bad home.\n\nThe other night I woke up to find the candle alight & my co mate & brother in exile doing fearful execution with the cribbage board. He told me next\n\nthat he got a mixed bag, three frogs & two black crickets.\n\nThere was an air fight today but too far to see much, the taube got away easyly.\n","92":"\n\nIt seems that our caravan has rested here long enough so have to move to Khan Yunis tomorrow morning at 7 a.m.\n\nI shall be very sorry to leave this little spot as it is in some ways ideal. We have a good home with fig trees all around & clean sand under foot so we get no dust. The next place is sure to be dusty.\n","93":"\n\nWe had no sooner reached the new camp than two fellows came to take us back to our units as the Division is now resting & hence there is no use for the convoy.\n\nI have decided to try for a transfer to the C.T.C., it is the best job I have met with yet. I don’t\n\nthink, candidly speaking, that I have a ghost of a chance but it is too good a job not to try for it.\n\nThis afternoon we are going over to be gassed. If it is the real stuff I shall probably die a horrible death as my mask has been kicking about for a long time & is probably useless now.\n","94":"\n\nThis morning about an hour ago, the black tailed taube came over & dropped 4 bombs two of which fell about 100 yds. from us.\n\nThey were only billycan bombs but still quite unpleasant enough.\n","95":"\n\nMy application for a transfer to the C.T.C. has been turned down as I expected.\n\nTwo little notes were attached to mine one –\n\nWill you approve this transfer\n\nO.C.","96":" L.H.F.A.\n\nand another\n\nNo transfer with British units are permitted\n\nG.P. Dixon\n\nFor A.D.M.S.\n\nDesert Column.\n\nI then respectfully begged to point out that many Australians were in it, numbered it 4 & \n\nsent it back again to desert Column, but apparently they are withdrawing all of them to form another L.H. Bgde. So that’s that.\n\nThere is talk now of seven days leave to Cairo, indeed some have already gone. I shall probably put in for it too but now that they have taken away all our clothes from our kitbags at Ghezirah, I have only what I stand up in & for me the chiefest pleasure of leave is clean clothes & no helmets.\n\nThis promises to be an interminably dull job, Front line reserve, front line reserve in spells of two months each.\n\nI was talking to some Frenchmen the other day – there are a brigade of them up here – and they tell us that there are 500 Italians at Port Said so this is going to be a very mixed grill here indeed.\n","97":"\n\nThere is no doubt that this is wonderful weather that we are having for the time of year.\n\nTonight , in fact with every night is wonderful. The sun has just set in its usual unappreciated splendour. First a riot of flaming gold which softly sinks into pale pink then slower & slower the pink changes to a faint & delicate green as only the after glow is left.\n\nThis faint green fades again into opal & peach colour while above shine myriad upon myriad of stars, for there is seldom a cloud in the sky when the sun goes down. The keynote of the whole is stillness, silence, immobility, not a breath of wind, not a leaf stirs, nothing is heard but the constant sibilant note of the cricket always the same, never varying, far & near, loud & soft forming a palpable background of sound to the breathless silence of the atmosphere & the eternal\n\nsameness of the stars. Even the unvarying monotony of the sound is such to fill the ears with a sense of effortless immobility.\n\nOnly man sounds the discord. He like Galleo cares for none of these things & thus continues to make his pitiful little clamour & cannot realise how diminutive & of little account he appears.\n\nI have just caught a flea which has mercifully stopped me wasting valuable paper on subjects which a common trooper is not supposed to realise much less to appreciate. His place is with the fleas in the dust and – under the dust.\n","98":"\n","99":" p.m.\n\nA tremendous bombardment & fusillade of rifle fire has just broken out. It sounds as if we or the Turks have attacked or raided or something. I suppose we shall hear what it was about tomorrow.\n","100":"\n\nThe bombardment & general upheaval which I mentioned was the outward & obvious noise of our infantry making a local attack. Rumour has it that they gained their objective.\n\nCertainly they have advanced for, formerly even from here (Abasan el Kebir) we could hear the rifle fire at night but now we cannot, or at any rate I have not noticed it.\n\nAbsolutely nothing has happened lately, one would think that being at war there would be always something happening which would be noteworthy but it is not so.\n\nI saw the doctor about my back a few days ago. It has been troubling me for the last six weeks just like a hunting back but a little lower down. He says it is lumbago and I have to get it rubbed every day but it doesn’t seem to be improving at all.\n\n the consumption of which occupying until the fall in for morning parade in which all paraded, only the last picket who waited round the horse lines with manouevres defective. Clothing in laced boots and in palled in the morning light.\n\n"}}