{"Document Name":{"0":"Diary_0025","1":"Diary_0025","2":"Diary_0025","3":"Diary_0025","4":"Diary_0025","5":"Diary_0025","6":"Diary_0025","7":"Diary_0025","8":"Diary_0025","9":"Diary_0025","10":"Diary_0025","11":"Diary_0025","12":"Diary_0025","13":"Diary_0025","14":"Diary_0025","15":"Diary_0025","16":"Diary_0025","17":"Diary_0025","18":"Diary_0025","19":"Diary_0025","20":"Diary_0025","21":"Diary_0025","22":"Diary_0025","23":"Diary_0025","24":"Diary_0025","25":"Diary_0025","26":"Diary_0025","27":"Diary_0025","28":"Diary_0025","29":"Diary_0025","30":"Diary_0025","31":"Diary_0025","32":"Diary_0025","33":"Diary_0025","34":"Diary_0025"},"Date":{"0":"unknown","1":1554.0,"2":1555.0,"3":1556.0,"4":1557.0,"5":1558.0,"6":1559.0,"7":1560.0,"8":1561.0,"9":1562.0,"10":1563.0,"11":1564.0,"12":1565.0,"13":1566.0,"14":1567.0,"15":1568.0,"16":1569.0,"17":1570.0,"18":1571.0,"19":1572.0,"20":1573.0,"21":1574.0,"22":1575.0,"23":1581.0,"24":1582.0,"25":1583.0,"26":1584.0,"27":1585.0,"28":1586.0,"29":1587.0,"30":1588.0,"31":1589.0,"32":1590.0,"33":1591.0,"34":1592.0},"Entry":{"0":"\n\n","1":"\n\nYesterday a 6 inch gun and its carriage capsized into a big drain running alongside the road, she looked a hopeless case but last night a traction engine appeared on the scene & hauled her out.\n\nGill & I went & heard the \"Boomerangs\" last night in a Y.M.C.A. a few hundred yards from our Camp, they were very good indeed.\n\nI was to have gone into Bailleul this morning & bring another prisoner out, but Golder wanted to go into the town so I handed the job \n\nover to him, & mighty glad I was to get rid of it. \n\nEarly this morning there was an outbreak of very heavy gunfire on our sector, must have been the 2nd Battalion's raiding party, they were to have gone across last night but we have had no news so far. Shows signs of clearing up this morning though the wind is blowing fairly hard & very cold. This ribbon of mine seems to arouse a good deal of curiosity, I am being constantly asked what it is , this is on account of being so very few about, for it is a very uncommon one, & rather pretty. This afternoon I took a stroll up as far as Elzendale Camp where I heard the 2nd Battery were I was after Layton, he was a \n\nMate of Fred Duke's, who was killed on his way over, my luck was out for they had only moved the previous day the 4th Div. having relieved them, however I know where they have shifted to, & to-morrow I will dig him up \n","2":" up pretty late last night yarning with Freddy Turner & a few A..C. chaps, the one great topic among us all old hands is this Australia leave & when we will get it , & who is entitled to it & etc, old Drummie Downes & Hellier are going tomorrow they say, so if they are going to maintain this rate which is 5 per month my turn will very soon be round about the end of April or beginning of May all going well.\n\n Things have cleared up & it is a glorious & sunny morning like a Spring morning in Tasmania not a cloud in the sky & birds singing everywhere, you would scarce know that a war was on save for the incessant & never ending growl & rumble of the guns in the distance, & the stream of traffic on the roads & the steady hum of the planes overhead, everything else seems so peaceful calm & quiet. \n\nI got the full strength of the raid the Germans made on the 10th Battn. a few nights back, it appears that the 13th Battn. knew it was coming off but they did not know when, & they had just been relieved when over Fritz came, 9 officers & 200 strong\n\nhe broke into the \"outposts\" & hand to hand fighting took place, before they threw him out they had 27 casualties including a Major who was killed, & 5 men missing, & they took 7 Germans prisoners, killed 30 more in and around the \"outposts\" & they reckoned a good few more got wiped out by our fire crossing \"No Mans Land\", so they paid very dearly for this turn out. A very daring & bold Fritz came to grief today, he had been in the habit of flying low round our trenches, & they had not been able to stop him, but this time the machine guns & rifles got his range & down he come, well inside our lines, there is no doubt about it we hold the\n\n supremacy of the air quite easily & he is a lucky Fritz indeed who can stay over our lines long, as a rule when you do see them up, they are almost out of sight, just a little speck in the sky.\n\nWent looking for Layton again this afternoon but met with no success. I fancy he must be in England yet.\n","3":" My birthday once again & the 4th in the Army 2 in Egypt & 2 in France, surely this will be my last in the Military, at any rate I am hoping so.\n\nWent down to the A.S.C. last night to spend the evening, played \"crib\" till about 11 with varying success we then had some supper, & finished up yarning at 1.30.A.M. its wonderful how the time flies when you start talking about old \n\ntimes & etc especially those connected with the war & Gallopoli.\n\nShe is a nice day again & very mild & sunny\n\nFatty Gill & I went to a concert given by the 3rd Bde, it was not so bad , while the performance was on an officer came on the stage and said, that all those men who had not got respirators had better duck away and get them quick lively, for the Germans had started sending cloud gas over on our right some where round Zonnebeke, you would have laughed if you could only have seen the mob that made for the door put the wind up a few , but the concert continued the attack must have been a \n\nfailure for the wind which at that time was very favourable for gas suddenly rose to about 20 miles per hour, so that would about settle any gas attack, for gas is useless with wind at that speed. there must have been something doing for our heavy guns were firing steadily all along our front probably searching for enemy concentrations or playing on lines of communications, in fact giving old Fritz a Hell of a time, this continued the whole night through.\n","4":" Another lovely sunny morning & there is a great activity among the planes & artillery the latter seem to be carrying on duels for the firing is so steady & regular\n\nThis morning Burling Pickering & McManus turned their \"Blighty\" leave down, they are expecting to get their Australia trip very shortly so they are saving up for that & I don't blame them, I would do the same thing myself.\n\nThis afternoon Mr. Sampson took all the School mob down to Div. to draw their pay, & from here I had to go on to Bailleul to get 3 prisoners who had finished their time in the clink, but only 1 of them was ready the other 2 being up round Ploegstreet Farm & would not be back till late, so I fetched 1 only back we were lucky for we got a ride in a car right up to our Camp\n\nWhen we were going in I saw one of the prettiest collisions as you\n\ncould wish to see, I was riding in front with the driver & we were going down a hill, I noticed a chap carrying a load just in front of us & he looked round when he did I beckoned him to rush the car & I would give him a hand on, just before we got opposite he makes a dash across the road but never noticed a motor byke that was tearing up the hill, he stepped fair into the bike, & there was a loud crash & both sides were sent spinning to the road & the mans rifle clattered like tin on the stones, it happened right under my eyes & I made sure the man was killed, I jumped out quick & lively & run over & picked him up he was dazed & weak but wonderful to say\n\nunhurt, his pack & equipment saved his life I think for he got a terrible fall, when he recovered we got him into the waggon & took him on to Bailleul he was going on leave to Blighty\n\nAll the rest of the mob have gone off to School tonight & I am on my own, mine does not start till the 14th or thereabouts\n","5":" Another beautiful & glorious morning, the sun is quite hot & everything looks beautiful, puts me in mind of Spring time in Australia, but the gun fire spoils the picture, for it is very heavy this morning our big guns are all in action & the air is all a quiver & everything shaking like a leaf from the concussion & we are easily 7 or 8 miles from the\n\n firing line, things can't go on much longer as they are, one side or the other will have to plunge, the sector the Australians are holding at present is a most important part of the Western front, & we are holding it strongly a Brigade on a 2 Coy. front, so you can see theres some men behind the firing line if ever Fritz wants to try his luck & his Prussians, the shell holes & craters stink of machine guns & we have field guns covering all our heavies it would be a perfect massacre if ever he were to attack. unlike last year we have all our ammunition dumps buried, so theres little chance of blowing them up. \n\nAs I was going along the road\n\n this morning who should I meet but Bill Graham of the Pioneers, Bill belongs to old H.Coy. & is a Staff Sgt in the Pioneers. Old Bill was smiling all over his face when he shook hands & slapped his hand across my ribbon, & said \" that's the stuff to give 'em \"Snow\" he always calls me by that name does Bill, had a bit of a yarn & then we both went about our business, Bill to the A.S.C.to see about rations, & I to the 3rd Battn. to see about a prisoner of ours whom we were holding & in the afternoon I took him down to the clink at Bailleul & brought another chap back . \n\nWhile Freddie Turner & a few of us were spinning yarns last night in Freds den Mr\n\n Forrest came in with the news that the clocks were all going on an hour at 11 oclock tonight they are bringing the daylight saving in early this year alright \n","6":" Had another trip to Bailleul this afternoon for McCarthy, & had to wait till 5 oclock before he was back from the\" Farm\", so to put the time in I went into the town & in the square close to the church the 47th Battn. band were playing, they are some class too & well worth listening to, quite a crowd had collected after this I went down to the Y.M.C.A.to get a cup of tea, & then back to the Compound for McCarthy on arriving home I had a few letters waiting, one from a young lady in Wagga whom I\n\nshall have to choke off she is getting too strong for my liking is this Marie Armstrong\n\nA Coy. had nearly 30 men gassed last night, some one is to blame for this, such a thing as the above should not happen with shell gas, & I expect Graham will have something to explain, for he will be up against it. \n","7":" Another glorious morning & sunny as can be.\n\nHeavy shelling broke out at about \"stand to\" this morning all along the line, & I have an idea it was us who were forcing the pace.\n","8":" Left early this morning with three good men to act as escorts, to go and get the notorious criminal Manning, he is in the Field Punishment Compound for safe\n\n custody, for he has broken out of practically every clink he has been in & got lots of good men into trouble so they put him in here, & in irons to make sure of him, it was a lovely morning when we set out & we walked as far as La Clytte where after some little time waiting we picked up the old \"bus service\" which took us as far as \"Canada Corner\" here we hopped off for the bus was going to Westoutre & we had to go through Locre to hit Bailleul, we were stiff for never a car passed our way for some time & we were getting tired & the sun very warm, just as we were beginning to curse our luck I spots an empty car racing down the hill & as he passed us I sang out\n\nhow about a ride \"Tommy\" & he pulled up so in we hopped & had a bonza ride to Bailleul on arrival we were stiff again for we found the Compound empty the whole bunch had shifted out to Ploegstreed Farm near Neuwe Eglise, I had an idea they were out here, & before I left this morning I rang up Division & asked them if they were still there, they said yes so I thought that good enough but it seems they don't know much in that joint, when we heard this bit of cheerful news we breathed a few silent prayers & set off for the joint, had to go through Bailleul & just as we got in there over came a big shell & landed in the\n\n square, he put 5 over altogether & blew a chemists shop out of a chaps hand leaving him with the knob in his hand, \"close shave\" these shells broke plenty of windows & a house or two put the wind up us & we beat it, caught a flying corp car which was going out to Neuwe Eglise so we were a little lucky just here, reaching the village we tried to find a café for we were hungry but our search was in vain, so we had to be content with a glass of cocoa & a few old apples at last we found the Compound & I butts my frame in & presents my order for our ruffian, but to my surprise they refused to hand him over for they said I did not have the right form\n\nthis was the Adjutants fault at any rate I was not sorry for had he tried to get away we would have been too tired to offer much resistance, but we would have filled his hide with lead for I had special instructions to shoot him if he attempted to escape & he would have got it too for we were all well armed 3 men with rifles & I had a nice little squirt, loaded & ready but happily there was no need for this , so we jumped a car which took us nearly home & right glad we were for tea was ready & we had our whack. This evening a batch of details arrived from the Base some of them have been away for 2 years & more.\n\nAm writing this tonight in the Y.M.C.A. & a concert is in progress so I am having a little difficulty in keeping things in my mind. 5 of our Coy. went on leave tonight they have just come out of the line.\n","9":" Got my marching orders for School this morning, so this afternoon I set off for Bailleul where I had to report on the morning of the","10":" at 6.30 AM to Lieut Hawkins I was supposed to stop at the Rest station tonight but I couldn't see my way clear to do a perish down there while I could get tons of blankets at our Battalion store, so that's where I pulled up, during the afternoon I went and saw the cinema show to put a little of my spare time in, old Fritz\n\ndropped a shell almost on the hall a few days ago, one of these went right through a house & smashed it to pieces, the glass in all the windows for a long way round was shaken out of the windows by the concussion, put the wind up the people properly I believe\n\n14th. Reported at 7 A.M. this morning & it was raining steadily it having set in during the night after a lot of messing about we got away at last, & after a tiresome & dreary voyage (for these military trains are absolute killers the way they eat the miles up is surprising I don't think) we reached Hazebrouck here an argument started for no one knew\n\nwhether we had to stop in the train or change, at last they found out & we changed & 4 other chaps & I were a little lucky hopped in a 1st Class carriage & got a ride to Arnecre where we got off. the rest rode in trucks our luck still stuck to us for after having a bit to eat we got our packs on & made off up the road, the rest of them stopped & waited for the officer to turn up but hang that game he was too late as it was so off we set we had not gone more than a couple of hundred yards when we struck a lorry & we got a lift for just on 9 kilos saved our life for we should never have been able to walk that far with our packs up \n\nWe were in our billets & cleaned up for hours before the remainder straggled home too tired for words for tea we had big hard biscuits & tea, you can guess how appetising that was, & I doubt if we get any bread tomorrow for they say there won't be any drawn till tomorrow night. After this splendid meal we all took a stroll and went looking for an eat up joint, to carry us on till morning at the top of the village we struck a snug little café & we tore the eggs & bread & butter into us properly some of the lads ate as many as 10 each nearly bought them out of eggs, the old lady could not make them out, must have thought they were pink\n\neggs for a wager so rapidly did they disappear.\n\nThere are about 80 of us at this School 1 from each Battn, & the rest form Trench Mortar Bdes & etc. we are living in Nissen huts which are lit by electricity, & the Camp seems fairly comfortable, though I'm afraid we are going to do a perisher with only 2 blankets, for the nights are very cold & long. \n","11":" Nearly froze to death last night I can see it's a case of turning in full marching order unless the nights get a little warmer.\n\nStarted on our course this morning the Commandant first of all gave us an opening lecture & told us what we were here for & what he wanted us to do & etc, after this we had a lecture all the morning on explos \n\nives, fuses detonators & etc, & after dinner the same officer took us on bombs till 3.30, then our Instructor had us for the rest of the afternoon.\n\nThey have a pretty rough way of dishing out the tucker here, those who are first in fare the best for they have seats\n","12":" Lectures again this morning up till 11 oclock then we had physical jerks till 12.\n\nMost of the afternoon was taken up in writing up our lectures, its astonishing the amount of writing one has to do at these schools, after tea I had a walk down to Merckenghem to see the watchmaker, it was a lovely evening nice & sunny & all the country looked nice & green, young crops coming on all\n\nover the place, & the old French cockies were busily working in the fields preparing for their late sowing, old men & women young boys & girls all work here, & nothing in the shape of land is wasted, its wonderful the way these French peasantry are carrying on, & you never hear them complaining.\n","13":" Church parade this morning it was held in our lecture room After dinner two other chaps & I went for a stroll it was a lovely afternoon & a treat to be out in it. we went as far as Millam 6 kilos away here we saw a Rugby football match between Tommies, it was a fairly good game, I don't think there had been too many Australians in this out of the way little village before, judging by the way the French people screwed us off \n\nthis was the cleanest little village that I have seen in France you could almost eat your meals off the streets, on our way back we called in at a little estaminet & had something to eat, I notice over here now, they are using grenadine as a substitute for sugar & very good it is .\n\nI see by the “notice board” that I am Orderly Sgt for tomorrow.\n","14":" Nice & hot this afternoon you can begin to feel the heat of the sun now & how nice it is. \n\nThis morning we put in throwing bombs & firing rifle grenades & I found it most interesting for I have such a lot to learn in this class of work, I am beginning to get hold of things now, for I am adding daily to my limited\n\nstock of knowledge concerning bombs & explosives & etc. \n\nIn the afternoon all the bombers & Trench Mortar people had an hours ceremonial drill, at this school officers and all have to carry rifles & it was dead funny to watch the antics of some of them, after this a march home & a lecture on German bombs to finish the days work \n\nThey have a number of German prisoners working on and around this school & they will eat anything the poor devils can't be too well fed judging by their wan looks & what they eat, I have seen them picking the scraps out of the slop tubs & eating them greedily, our chaps always give them what is left off the tables & you should see them dwelling on this.\n\n Tonight our Instructor gave us all some of the latest books on bombing I don't like his chance of getting them back again they are too valuable, & crammed full of information. \n\n19th Started to rain this morning just as we finished our live bomb throwing, the whole School has been throwing today, each man threw 5 bombs at targets you could not see, but you were told what distance they were away & what angle they laid from you, it was a fairly hard test & I done much better than I expected to, got 2 direct hits & 1 fair with my first test & in the second one which was from the lying position I got 1 bull & 1 fair, there were\n\nvery few who done better, the French Mortars were also firing so between the two of us we made a fair row. \n\nJust as we were falling in this morning down dashes the Orderly Sgt; & wants to know where I am he had an urgent message in his hand & I wondered what was up now, it turned out to be from the Battalion wanting to know if I had warned McCarthy the day when I got him from Bailleul Compound, that he was going to the line the following morning, they wanted an answer at once so I had to make a statement & get it signed by an officer looks as if he has done a bunk again this will be the 3rd time.\n\nHad lectures on German bombs all the afternoon in our huts & after tea there was a lecture\n\nin the big Hall on Map reading, & Prismatic Compass.\n\n20th. Paraded with our overcoats on this morning for it was raining lightly & everything very sloppy & wet. We went out to the live practicing ground & the officer in charge gave a demonstration of the various flares rockets signals & smoke bombs etc, it was most interesting though the smoke & fumes were almost choking at times.\n\nAfter this was finished we fired bombs till 12 oclock & then home for dinner, the next item on the programme was one of the funniest things you ever saw, the whole school had to take part in a 4 mile cross-country race, a lot of the chaps took their tunics putties & some took their shirts off \n\nnone of us stripped in the 1st Div. we all took it as a great joke, everyone officers included had to take their hats off some of them did not like this for they knew without their hats they could not fall out and go away to some little estaminet or village, the whole crowd started off together & soon they were strung out for miles, I had no idea that I would run any where near so I did not even take the trouble to take my coat nor putties off either, but at the end of 2 miles I found myself in the first dozen & going well, but my putties were giving me fits so I was forced to pull up & take them off I lost a good 300 yards by this but I set off & caught some of them by degrees it was a great race home & I finished up by running in 6th & first home for the 1st Div. there were over 120 starters all told\n","15":" I reckoned I did not do too bad\n\nThe French people must have thought us bad, they were all out to see us pass through the villages, it was funny to see the mob rolling home dead beat & done to the world & we were all in the same boat, after I cooled down I went and had a cold bath, & then after tea there was a lecture on aerial photography, after this was over I walked down to Merckenghem to see about my watches if they were done or not, here I struck Fatty Gill & had a bit of a yarn with him, then I walked home in the moonlight.\n","16":" Lovely weather again & thing are looking beautiful. Last night old Fritzs planes were over bombing & all our lights were put out\n\nwe could hear the bombs dropping quite distinctly, must have been over St Omer \n\nAm very stiff & sore this morning after the run of yesterday, I can hardly walk & the majority of the men are the same you should see them limping about.\n\nHad a lecture on French bombs this morning & after this firing rifle grenades with our gas helmets on \n","17":" Another grand & sunny day & we have been out on the range all day throwing and firing live grenades \n\nThere was a bit of amusement caused while the throwing was going on some of the chaps who were waiting their turn started to throw clods of dirt at one another & some one for a lark hit the officer in charge this narked him very much so he ordered the 3rd 4th &","18":" Div to fall in, we all thought lucky\n\ndogs they are going home so they thought too, but they were sadly mistaken for he told their Instructors to march them away & give them some physical jerks, so they took them away & started the mob racing one against the other, of course they were enthusiastic you could see that from the way they were carrying on, after a while the officer gets sick of watching them & he takes a walk, down to try and liven them up but he got very poor results, we were all expecting to see him counted out & it's a wonder he was not, for the lads naturally were in a very bad humour, & I don't blame them it's a poor policy punishing the mob for the sake of one or two, if ever an officer was called pretty names well this chap was.\n\nThis evening there was a voluntary parade for a lecture on the Prismatic Compass I was there for there was one or two points that I wanted to clear up & I got the information this evening it is a most interesting subject & at the same time most useful, I intend to master it thoroughly before I return\n\nThere are quite a number of nightingales round here & you can here them singing of an evening after the sun has gone down, no doubt they have a sweet voice & plenty of notes but they are not what they are cracked up to be there are plenty of Australian birds that I prefer, they talk or used to about the sweet singing of the birds in this part of the world, why I have scarce heard any, save the lark & an odd bullfinch, blackbird, & an odd nightingale or two, where you\n\nhear one bird singing over here you can hear a dozen in Australia\n\nEver since we have been here the church bells have been ringing, there seems to be an interval of an hour or so every now and then, some say one of the heads of the village has just died & they are ringing them for a certain time according to the money he left for this purpose, seems a funny idea.\n","19":" Calfs of my legs still sore from the run a few days ago, no more for me unless I have a bit of training for it & I am not the only one by a long chalk. \n\nThis morning each man had to get up and detail & explain any bomb that was handed to him, it fell to my lot to run through the 24. Mark I, & I surprised myself, I can see I am not the worst by any means in our bunch, though I am the\n\nonly one who is not a regular bombing Sgt. In their Battalion, after this was over the whole lot of us were marched down to our parade ground & we done an hours physical training but it was nearly all games & we had a rare bit of amusement.\n\nThe afternoon being a half holiday 3 others & I took the opportunity to slip up to the baths at the Infantry School to see if we could get a wash, but our luck was out for the baths had stopped for an hour or two, so we spun the bloke in charge a yarn, & he gave us each a clean change of new clothes this done us down to the ground so we came back stripped off & had a cold water bath took our breaths away for a start but it was bonza after the first shock of electricity was over.\n\nIt has been a lovely & glorious day & everything is growing rapidly under the fast increasing heat. Why its that hot now that you sweat while walking about in the middle of the day, but the nights are still very cold & crisp. \n\nBought a bottle of Eno's Fruit Salts this afternoon, my blood is beginning to get out of order so I am going to make an attempt to clean my system before I go back to Australia which I hope & trust wont be so very long now, for I want to land home in the pink of condition so as I can enjoy myself for I am bound to have plenty of running about, though no more than I can possibly help this looks as if I am making cock sure of getting away, they say it is not a good plan to count your\n\nchickens before they are hatched but somehow I feel confident it will come off.\n\nThis afternoon the German prisoners made us a lot of bunks & brought them in, I'm not in love with them myself, you want so much bedding with them & this we have not got, only 2 blankets per man\n\nThe Tommies who are at this School learning the Lewis Gun got a bit of a shock this afternoon, they have been very keen & have been wanting to play a match with our chaps (Soccer) they had some good players & they thought they could take the “Aussies” down but they came a terrible crash for they were beaten 3 to 1, what a \"zonk\" for them & at their own game too.\n","20":" the Great Hun offensive has been launched at last, they surprised me I honestly thought they had better sense than come at that game, for come what may they have\n\nnot the slightest chance of winning . I'll bet they will get cut to pieces. The first news came through yesterday & from that it appears they had broken through at Bullecourt & Lagnicourt & 1 or 2 more places but that signifies nothing for there is never any trouble for either side to make the first advance for they have all their guns registered on the trenches & the front line is always lightly held, wait till they get up against the line of resistance & have to haul their guns over shell torn ground & get them into position for the next push then the fun starts, we know all about that from personal experience & as for man to man goes every Australian knows who is the superior fighter, that has been tested too often & the Fritzies know it in their own hearts too well \n\nthings must be very bad in Germany for them to attempt this mad act. I expect they are driven to it & have staked all they have got on this final plunge, no doubt they will make things hum & be very nasty for a while but the issue should never be in doubt, everyone over here have the greatest confidence as to the eventual result of the offensive & its just the very thing that we have been wanting him to do, let him do the bag hopping by all means & when he is sick of it we will take a hand in the fun, he is now having a taste of what we had to put up with all last summer & good luck to him & his storm troops this should be the beginning of the end & France will be a good place to be out of during the next 6 or 8 months for there will be plenty of stouch & etc. \n\nIt is Sunday today & one of the loveliest days imaginable, not a cloud in the sky & a brilliant sun..\n\nTook a stroll down to the Infantry Wing at Merckenghem this evening after tea to get my watch but he never had it done, for all the P.B. men have been ordered back to the Base at once & he being one of these fortunates packed up and was gone so I have the watch still on my hands, but I never had the walk for nothing for while there I borrowed George Golders towel & had a good hot bath & it was bonza, took some of the camouflage off me properly & I feel about 10 lbs lighter tonight after I had my bath \n\n3 of the chaps came for a stroll with me as far as our training ground & it was lovely walking along the hedges\n\nafter the heat of the day, the perfume from the budding flowers & leaves was beautiful, & we quite enjoyed it. A few more hot days & you wont know the country so fast is everything coming along, you can fairly see the wheat & oats growing.\n\nNothing but rumours & latrines flying around they have got hold of all sorts of yarns, I heard someone saying that Fritz had got far as Baupaume & had asked for an armistice, another one, that he has been knocked back pas Lagnicourt & his old line, & it was still going home, its funny but you always hear these sort of yarns whenever anything special is doing & I have got that word to them that I take absolutely no notice of what I hear, & not too much of what I see.\n\nOld Fritzie was over bombing again last night. He seems to come across this part of the country each night on his way to St Ormer & the sky was alive with the signals, rockets ,shells & etc they fell the one who came over last night he was brought down in flames not so very far from here.\n","21":" Well this morning we had the new at work, dummy firing for a start then in the afternoon we fired them alive, & they turned out fairly well they had a fine range 240 yards with a 7sec's fuze, you have to watch yourself for the shock of discharge is considerable & they kick some dig & a fair hole in the ground, & they burst fairly well, after this we all threw of the new type of Egg bomb, these have a percussion lighter & you have to knock them\n\nsharply on some hard object to pierce the percussion cap, the first one I threw I had to bang it 3 times before she started to fizz once she starts to smoke you have to throw it at once or it will burst in your hand, these are also a new bomb out & I took the opportunity to pinch one for my collection \n\nOur examination was held in the lecture Hall after tea this evening we had a number of questions to answer on paper about various things, they also took our books to have a look at. \n\nIt has been fine but fairly cold today & tonight slight showers of rain are falling.\n\nOur School finished abruptly today the Course has been cut short on account of the bad news still coming through the old Hun seems to have made a clean break & he is going to \n\ntake some stopping.\n","22":" Fell in as usual this morning & we had to march out to the range & collect all the empty cartridges & etc which were left from yesterday\n\nAfter this was finished they held a competition for the longest bomb thrower a little officer out of the 54th won it, distance 48 yards. From here we marched over to the ground where the Infantry Wing were holding their Sports, it was mostly drill & to tell the truth I thought very little of it, I have seen better in the platoons after they have been out of the line for a while, the bayonet fighting was very poor & the\" sentry go\" drill very little better with the exception of the","23":" &","24":" Div. these were very good & the decision was given to the \n\n3rd & caused a lot of dissatisfaction & argument, after dinner they were concluded the 3rd Div. won the tug - of war & gas helmet drill, the 2nd Div. the 75 yds race, 5th the 440 yds. & the 1st the relay race & 100 yds Championship, I think the 3rd Div won the Cup with the 1st a very close runner up, there is the utmost keenness & rivalry between all the Div. but none of the other Div have any time for the 3rd, they would sooner any Div win it than them, it was a most lovely afternoon & plenty of sun\n\nBad news still continues to trickle through the latest is that the Germans are within 2 miles of Albert, just think of that after all the blood & agony spent in winning that hellish piece of country & now it has all gone for nothing & the Hun is \n\nstill going strong, the 3rd 4th &5th Div have all gone down there & the 2nd is following, so far we are in the line & they say we are stopping there for a time, I would much rather go down there & sink or swim with the rest of our lads, I'm certain that once the old Colonials get into the line again they will check his run, at any rate he will know he has been fighting by the time he finishes with them \n\neverything down here is in the melting pot practically all the Instructors have been recalled this means that the Schools are broken up, they are raking all the men they can possibly get together, she is some fight all right & the Germans are trying to make a finish of it for once & for all, there's one \n\nthing I am very pleased to see & that is in a terrible crisis like this everyone is still confident of the final issue & things are going on in the same old way nobody looks downcast or gloomy but all have a smile on their face as if it was a mere nothing, & the thing most discussed is the long range gun of the Germans & sports, the French people think we are very funny, I was talking to a lady this afternoon & one of the things she said she was most struck with in the Australians was their utter disregard of the war or the terrible disasters that had overtaken the British Armies, she said she thought such a thing would have a depressing effect on us for we have to go back to the trenches & we never knew when our turn would\n\ncome & we may have to go through the same ordeal as what the troops on the Somme are, I told her the devil may care air was natural to the Australians & nothing ever damped their spirits, nor they never met trouble half way, we are interesting to the French people round here for we are the first Australians that they have ever seen, & if I may be pardoned for saying it , but they are very popular with them they like our free & easy ways.\n\nThe result of our examination came out this evening, I got a proper shock for I was right up among the first flight, came out with a % of 88 & this was my first Bombing School that I had ever attended, but I done a\n\nlot of fagging, spent nearly all my spare time in studying & it was worth while apparently, I never expected in my wildest moments to get anywhere near this total, I reckoned if I got anywhere between 60 & 70 I would be doing grand, \n\nWhat a shock some of the know alls got, opened their eyes properly.\n\nThe 3 & 4th Div student have just received orders to move at 4 oclock in the morning, a nice time isn't it. we have received no definite orders so far but are awaiting them. \n\n27th. Just before we went to bed last night there was a bit of excitement, some of us were standing outside our hut looking for the \"Gotha's\" which were humming overhead for they were very low, all of a sudden there was a whirring \n\n& humming noise, a dull thud, silence for a second or two, then a tremendous roar which made the earth beneath our feet fairly tremble, the old Hun had let one of his big bombs go, what he aimed at goodness only knows unless he was after the School & our scalps, before the sound had died away we were off for our lives to see where he had lobbed it & what damage he had done, we soon found the crater for it was no trouble you could track it by the great clods of earth thrown about & the broken windows for nearly every window in the quiet little village was broken, glass was laying everywhere, & the French people were all outside & very excited for this was the first bomb ever dropped round their village\n\nI pitied the poor little kids & the girls & women, the mothers had them all outside for safety sake, one can't but help admire these brave French women for they are splendid, if ever a nation pulled together & uncomplainingly bore the greatest troubles dangers & hardships, well these \"Froggies\" as we call them do, if ever the lads opinions have changed, it has done so with a vengeance in regard to the French, for a long time while there was certain amount of chaps in our Army who were always & running the French down, for the simple reason they had not the brains to understand them, but it is all changed now, for its little else you hear but praise for this magnificent race, I know personally the more I see of them the more I \n\nmarvel at their sticking powers she's the best Ally Britain ever had or I think ever will, France is true as gold & will fight no matter what happens to the very last, but I am wandering, we found the crater a bonza all out 20ft deep & easily 30 ft across, just imagine if you can what this is like, takes some doing I know without actually seeing such frightful holes with lumps of dirt laying round its ragged & yawning mouth hundreds of pounds in weight, luckily she fell in an open paddock & done no other damage than break lots of windows crockery & etc, by the time we got there, troops were coming from all over the joint some in pyjamas, others with overcoats & in fact in all\n\nsorts of costumes & rigouts, you can't beat the Aussies for curiosity 2 dogs can't fight you know without an Australian being there that's what the Tommies say at any rate.\n\nAfter satisfying ourselves that no one wanted pulling out of ruined houses we went off home to bed. Got our marching orders this morning the 1st 2nd & 5th Div. moved out from the School just before dinner taking the Staff & all with them, we marched as far as Boolezeel & my ankles & shins gave me fits, but I stuck it out, here we joined up with the other Schools & entrained on the narrow gauge railway this took us as far as Polde-Cappell here we got out & marched as far as the reinforcement Camp at Caestrae & we are stopping here \n\nfor the night they won't let us rejoin our units straight away wish they would.\n\nGreat rumours are still flying round about the great battle down South. I was talking to a motor driver who has been running troops for all he was worth between here & Arras, he was telling me that in some sectors during the great fight they had to relieve the machine gunners every 1\/2 hour owing to the frightful slaughter they were doing in the enemy's ranks the strain of killing men was so great on their nerves\n\n28th. Moved out from the Camp this morning, & I must say they treated us fairly well here, for a wonder they showed us plenty of consideration & fed us well, they sent us off in motors & these took us\n\nright to our door, we only had to walk a few yards & we were in our huts, it was a bonza lift, we passed through Bailleul she is a deserted town now, all the one time life & bustle of her lively little streets having disappeared, this was on account of the Germans bombarding it so heavily, all the civilians were ordered to move out at once, & just as well they did for old Fritz appears to have knocked a good few houses, shops, & churches \n\nrotten, he dropped some big shells in the square & as we passed through they were busy filling them in, old Fritz has got a lot to answer for one of these fine days.\n\nThings seem to be in a very tangled state round this part of the front they have got some of our Light Horse &\n\nNew Zealand mounted men holding portions of it, & men are being raked up from practically everywhere, they had a lot of gas this time in the line & nearly all the lads are talking a little hoarse & husky & quite a number have been gassed & are now safely in Blighty\n\nOn arriving back this afternoon I found quite a pile of letters waiting for me\n\nMcManus went to Australia today how lucky is he,\n\nIt has been very cold all day tonight light rain has set in \n\nMajor Jacobs came back from England with our draft today he has been away a long time now but he is a good fellow for all that & very popular with the boys & all the Battalion \n\n29th. Out on fatigue this morning went away early for we had a long way to go, though we got a ride up in trucks on one of the Light railways, they are very handy these little lines, & have done invaluable work, we got out at \"Spoil Bank\" & I brought a party down to Ellzenwalle Dump to fill bags with sand & gravel, they set the lads a task which is the best way to manage man, they set to & filled the lot 800 in all by 10.30 & we were home in no time, the rest of the party did not get home till well in the afternoon.\n\nAccording to the news that is coming through our Australian Divisions got a wonderful reception when the hit the Somme the whole countryside cheered \n\nthem wherever they went & the Tommies lined the roads and villages & cheered our chaps to the echo gives one an idea if what a reputation our lads have got something to be proud of. I'll bet the very appearance of them gave the Tommies fresh heart, the 4th Div got in for their cut straight away & drove the Germans out of Dernacourt & captured a 100 or so prisoners, here's no doubt the Aussies are some scrappers.\n\nFrom tonight (we are that is the 1st Bde.) Army Corp reserve & do no more fatigues except by Army Orders, they must think a good deal of our Brigade\n\n30th. The Coy was out on parade this morning, & I nearly got in to a row through trying to shield one\n\n one of my Corporals, I reported him as on parade & he wasn't, & the best of the fun was that the Captain went round the huts & hanged if he did not catch Lynch inside, of course he wanted to know what he was doing there for he was on no duty, what a gutser, but I got out of it easy enough for I had just taken the platoon over & my roll was not complete.\n\nIt has been very cloudy & drizzling rain this afternoon but we had the afternoon off & played bridge nearly all the time, it is a great game amongst us Sgts.\n\n31st. Sunday & nothing much doing except that the Colonel sent down for me wanted to know something about the discharge cups & new bomb which had been taught us\n\ndown at the School, he seems very keen on them, & he wanted me to go over to the 3rd Battn & attend a demonstration that they were having preparatory to putting in a report about them, so I went across & after they were finished I borrowed one of the “cups” for our officers wanted to have the working of them explained, so I have had a very busy morning.\n\nNice & mild today & quite warm though it is still cloudy & threatening\n","25":" Just before we went to bed last night down came the Captain with the news that we would be moving at 10 oclock in the morning, what a rush set in then trying to get as much straightened up over night as possible, my platoon through no fault of their own were short of 5 equipments\n\n& rifles, so Jack Hayes & I took a run up to the 3rd Battn to see if they had any spare ones but no luck, we never got one so we had to make them up from the Cooks & etc, & when we moved off we were correct, I marched out 36 strong in my platoon wonder how many I will bring out, for it's a moral we are going to the Somme\n\nThey studied our comfort again for we were taken as far as Renilhurst in the Light railway trains passing through Dickebusch, Ouderdom & another little village, I was very surprised to notice how close to the fighting area the Belgian farmers have come, they have crops growing & looking real well almost into Dickebusch itself, taking a line from what happened down south they are taking a risk of losing all\n\nOn arriving at our destination we marched about a mile & pulled up in a rough little Camp, there was a bit of excitement while we were getting the men in to their quarters 3 of Fritzs planes came over quite low I made sure they would empty a belt or two into us for we must have been a tempting target, however machine gun fire drove him off, then all of a sudden there was a stir in the heavens & three of our planes came tearing up & by a pretty piece of manouvering they cut one of them off & drove him down almost over our heads, there was great excitement as we watched our planes driving him down, once he looked as if he was going to get away, but one of our small fighting machines got into position above the Fritz\t\n\n& jockied him down to the ground where we saw him fall among a belt of trees to the right of our Camp.\n\nDinner was served after a brisk game of football during which I come a “gutser” in other words got slung in the mud, & now this finds me sitting on my old pack & feeling much more satisfied with things in general, but I can see this state of affairs cannot last much longer for the Coy. Staff, are creating a disturbance with strands of cordite & the redoubtable Starkey is making a B. nuisance of himself with a piece of stinging nettle, so things promise to be lively.\n\n2nd last night we had the fun of our lives, all the Staff of our Coy. Numbering no less than 13 with the cooks included, took a stroll down to a \n\nlittle boozer, with the intention of having a bit of fun, we all sat around a big table & the mob of us threw in as many francs as would do us for the night, the pile amounted to a bit over 100 francs, the drinks began to circulate freely & the call for Madame was very insistent, kept her going filling the glasses, after a while the lads began to mix their drinks, champagne was called for to give the beer & stout an extra bight & snap this soon settled Pricey for his head began to droop & he got sleepy but the majority of the lads stuck it out, I never laughed so much for a long time for I was as sober as could be had only 1 glass of light wine & a dash of champagne\n\nbeer or spirits I never touch nor never will, after we had finished all \nabou\n but 20 or 30 francs we decided to go down to a little shop & do the rest in eggs bread & butter & etc, but the funniest part of all was to come for when we had come back as far as the corner of the estaminet they all stopped for coming up the road was a couple of Aussies & a Jock & the latter was playing an accordion for all he was worth, when our crowd heard the music they all started dancing round about to the Scotties music of course they pulled the Jock up & then they started the Jock playing the tunes & our issue dancing the Highland fling, jigs & etc. laugh I nearly died for the whole crowd were stung & so just in the mood\n\nfor anything of this nature, all of this of course took place in the middle pf the old cobbled road & soon quite a crowd had collected for the music will always attract this went on for nearly an hour & then Starkey fell the crowd in & with the Scottie at our head marched us down the road, past Bde. Hqrs. & the Y.M.C.A. playing all the time & so round to our billets once inside they started again & the dancing was kept going to a late hour, old Jock & McPherson were in their element for they are both born Scotchmen & dancers of these Scotch hops & jigs,, the Jock belonged to Argyll & Sutherland Highlanders & was in his kilts, & that night he slept with his declaring that he was not going back \n\njob, but was coming down to the Somme with us, & so ended a most enjoyable evening, the Jock was a brother in law of Laidlaw the VC, who played the bag pipes along the parapet during a charge at the battle of Loos in 1916. & Jock played us the same tune “Flora McDonalds lament.”\n\nIt has been a lovely day & we have been doing a little drill, & in the morning a short march with full packs up\n\nOut of the 5 German planes that came over yesterday our chaps got no fewer than 3 altogether\n\nThere was a bit of fun also down at Reninhelst last night with our chaps & the Chows. It appears that Montieth was talking to one of them when the Chow must have\n\nhave thought Monty was going to job him, so the Chow got in first with a big stick hit Monty on the head with it, that was enough in a flash the whole street was in an uproar & the Chows called loudly to a mob an English officer was marching along the road, they broke off at once & went to the assistance of their countrymen who were having a bad time of it some of our chaps saw what was happening & of course they took a hand things were getting very willing for both sides were getting reinforced & it threatened to be a big thing but our boys belted the Chows to a standstill & the Tommy officer then implored them to stop & he\n\nappealed to their common sense & asked them to go away and let him collect the “chinks”, so the lads did so, I wonder what the Tommy thought of the mad Australians, there was a few black eyes among our troops next morning.\n\n3rd. Another wild night was spent in the boozer last night, the Jock stopped with us all day & the whole bunch went out again. Price & I went up & saw the fun later on, on our arrival the room had been cleared & dancing was in full swing, even the Madame was dancing & stepping like a two year old oh she was some night & it finished up by the crowd singing & dancing on the corner by the Y.M.C.A. here a great crowd collected & there was some more \n\nstepping & music, after this the whole crowd dispersed & went to bed thoroughly tired out.\n\nPut the morning in drilling & etc & in the afternoon the Coy. were marched down to Hopoutre to get a bath but only cold water was on so very few had a wash, as soon as the men were out we collected them & marched them home without our officers we knew this would not go unnoticed & so it proved for this evening the Capt came round & wanted to know why we did it & etc, we told him because we thought it was the best thing to do rather than let the men stand about in the rain & we had a good 5 miles to walk\n","26":" Very dull & heavy again this morning but no rain is\n\nfalling but things are very muddy but this did not stop us from going on the usual route march, & for a change we had the band with us they marched us for a good hour then about turned & back to Camp without a spell, pretty rotten I reckon, but they have treated us very shabbily here, & Capt Somerset is the cause of it all, he is too regimental for us, & is thoroughly disliked by the Coy, I wish we could get rid of him, for he is making things very unpleasant for the lads & I might say for all of us\n\nToday we got orders that we were moving tomorrow for the Somme & that we were hopping in for our cut at the earliest opportunity& so there will be a few of the lads missing in a week or so worse luck\n\nGot 2 more officers tonight we have no less than 10 now & they are a bright crowd believe me, my officer & Mr Beckett are the pick of the bunch\n\nHave been playing marbles nearly all the evening, a couple more months & we shall all be fit inmates for the rat house\n\nWhat a gutser Gough of the","27":" Army has come, he made a pretty mess of things compared to Byng of the 3rd Army, both knew that the stunt was coming off & they adopted different methods of meeting it. Gough crowded all his men into the front line & when the blow fell he got them nearly all wiped out & had no reserves to carry on, consequently his Army suffered heavily & lost practically all their\n\nartillery, & in general made a pretty mess of things, Byng on the other hand withdrew almost all his men & his Army made a wonderful fight & lost very light & never lost a gun the whole time, Gough has been relieved of his command & I'm not sorry to hear of it, he was the general who refused to have the Australians at one time & now all the Army Commanders almost rush them if they think they have a chance of getting us.\n\n5th.Rained fairly heavy again last night & when we moved off this afternoon it was very wet & sloppy, one of my birds done a get, he was missing when I called my roll previous to moving off, so I went & had a look in his hut but the bird had flown sure enough\n\nhis gear was scattered all over the place, I had a look in his pack & found that he had taken his towel shaving gear & also his respirator so his absence was planned, this jokers name was Adams, a one time Sgt but he got in to trouble over desertion last October.\n\nWe had a very solid & trying","28":" or 10 miles before we pulled in at some out of the way French farmhouse for the night, our rations were very scanty & we were hungry so Price, McCowan, Mackie, Forder & I went out scouting to see if we could find anything, no luck for some time but we spots a big Farm house that we had been billeted in once before a year or so ago, so we bowls straight up & made ourselves known & they remembered us, so we\n\nwere set & they soon had a great plate of eggs & bread & butter in front of us also plenty of beer & etc, they could speak very good English & we could easily see that these people were a far better class than we usually come in contact with, I quite enjoyed being amongst them & when we left we came away with a big loaf of bread for use later on, but we wanted some more so we walked down to an estaminet & induced the girl there to sell us a loaf of bread, we pitched her a pitiful tale & it succedded admirably, you wouldn't believe what a job it is to get bread now for all the people are on rations & though they get plenty for themselves they are not supposed to sell it bread is always our chief trouble for we get plenty of other tucker \n\n6th. Reveille at 2. AM. this morning, so you can see we have had a lot of sleep, we moved off at 3 to catch the train at Goddersville arriving there at 6. here we had breakfast, & then entrained in horse trucks &amp. they were in a most abominable state not being cleaned out for some time how the troops roared when they had to set to work shovel the mess out, the train pulled out about 7 & we had a very cold ride for the next 10 hours when we arrived at the storm centre Amiens, all along the line from Ailly sur Somme to Amiens the people are packed up & prepared to move at a minutes notice while the road from Amiens is crowded with refugees of all sorts carrying or pushing their few belongings all hastening to get out of \n\nreach of old Fritz should he ever come any further. The station at Amiens is simply crowded with traffic, troops munitions, guns, stores, horses & etc coming in & being unloaded as fast as possible, while the outgoing trains are carrying everything of any value out of the city, & they are very wise in this respect nothing like being on the safe side, when we got off the train we marched down to a little park & here all hands had a cup of cocoa previous to moving off to our billet, we then saddled up & set off off \n\nour way from St Roch led through the centre of the city itself, & the one time busy town was as quiet as could be only a handful of people remaining but what were left showed their appreciation of the Aussies in no unmistakable form, I only saw \n\nhouse that had been damaged & that appeared to have been a bomb\n\nAmiens is a big place to give you an idea of the size we marched for a little over an hour before we cleared the town itself, her streets are full of soldiers both French & British with a sprinkling of Australian here & there. our way led quite close to the beautiful cathedral what a shame it will be if ever this lovely old pile is smashed, for she is one of the finest Churches in France, by the time we got fairly on our way it was dusk & we could easily see the flashes of our guns away in the distance, there is a big ridge which runs right round Amiens & it is quite evident who ever holds this has the whole of Amiens & the great basin which spreads for miles in\n\ntheir hands for it is such a dominating position, & this is what Fritz is fighting so hard to get, I don't fancy his chance of ever getting it now the element of surprise has gone & his forces have lost their momentum, it was a terribly solid march for the men to Allonville & they dropped out pretty fast as we approached her for they were done to the world having had no sleep & very little tucker for the last 36 hours, & no one was more pleased than myself when we threw our packs off in a great loft which held nearly the whole Battn. just as we got in down the rain came in torrents & we thanked our lucky stars with our remaining breath that we were not out in such a storm, tea was on as soon as they were ready after this we made our beds & turned in for the night done to the world. \n","29":" The morning broke nice & sunny & the weather shows signs of clearing up, I am writing this sitting under one of the great sheds & the sun is pouring down, in the distance Amiens lies a great white patch in a sea of green & she looks very pretty with the \nshe","30":" glistening on the roofs & spires of the buildings while overhead the drone of our planes almost lulls one to sleep so continuous is it, they are there in hundreds coming & going to the line in regular flocks, one Fritz was foolish enough to get a peep at what was going on over our way but he was simply eaten up being rushed at from all directions \n\nThings are very busy round our billet getting ready for the line, there are officers & men about here from all\n\nthe Australian Divisions but everything appears to be running smoothly from all account our lads are keeping their splendid reputation up & at the same time piling the Germans in rows in a frightful manner, but one keeps on constantly hearing of the crook behaviour of a lot of the English regiments there must be something in it for the rumours come from the Jocks as well as from the Colonials, at the present moment as I write this there is a great rattle of artillery, the old Hun must be attacking again, & I must leave off for it has just gone dinner\n\nThis afternoon Mackie, Price, Dimock & I went for a stroll in a pretty little wood, which is quite close to us & how nice & pretty everything looked for the sun was shining brilliantly\n\n& great white clouds were drifting across the sky throwing fleeting shadows across the old beech trees, which are just beginning to get faintly stained with a green tinge which heralds the approaching Spring, but the most beautiful part of it all was the lovely carpet of early wild flowers for they were there in abundance & in all colours violets anaemones, crocuses, daisies cowslips, primroses, buttercups & lots of other pretty little flowers that I don't know the name of, the whole land was just a mass of color, & it was delightful walking in such a bonza place, I picked up a number of flowers & am going to try & press them\n\nWe have had music nearly all the day for the bands of the 27th 25th & our Battalion have been giving selections \n\nWhere we are now billeted is the biggest & most up to date farm that I have seen since leaving Australia things are done on a large scale & there is every possible convenience, they say the place belongs to Hennessy of 3 star brandy fame\n\n8th. The Coy were out on a march this morning & just before we fell in it started to rain, so I shouted out to Capt Somerset & asked him whether the men were going to wear their water sheets or not, he said yes, so I got my men out with them, & in bandolier fashion, that is round or should I say over their shoulder, when Parkinson came out he reckoned they should have had them in their haversacks, this narked me so I said pretty heatedly well ever since I have been in this Battn. we have carried our sheets bandolier fashion & damned if I was going to give an\n\norder for them to be carries otherwise a few more sharp words followed between us & while we were busy arguing the point Capt Withy came along & he settled the argument in my favour, this is the first time Parky & I have had an argument for we hit it well together but I fancy we were both a little out of sorts & in a reckless mood, at any rate 9 & 10 Platoons were the only ones who had their sheets & when it came on to rain, the Coy were ordered to put their sheets on, 11 & 12 had none with them & the Capt went crook on them a treat wouldn't let their officers wear their coats, so they had to carry them all the while it rained & what fools they looked, all the same we have a rotten lot of officers in my opinion at the present time, & they are here under false pretences drawing the\n\ncountrys good money, no wonder this war is costing so much when we carry so many drones on our backs they are a lovely crowd.\n\nThe Coy were paid tonight & wherever you look gambling is going on. Saw some Tanks going across country this evening making their way to the firing line.\n","31":" Got our orders to move early this morning so we have been very busy packing up & getting our platoons ready, & billets cleaned out.\n\nThere has been very heavy gunfire all last night & it is still going strong Jock has just had a streak of luck at \"two up\" a fair little pile\n\nQuite a number of the Coy. were absent last night from the Tattoo Call especially No 9. so things have been very busy in the Orderly Room. \n\nAmiens was the attraction, for there is quite a lot of fun to be had in this old city yet. the other day an order came round warning all the troops to be careful of the women round here, for when the Germans broke through they let a 150 diseased women out of the hospital there, & they are still at large.\n","32":" Had quite a short march yesterday afternoon about 5 miles brought us to our new home a poor little village called Moulliens au Bois & she is chock full of refugees. from the villages round Albert & Ribemont, they look poor miserable people too & I suppose for the time being they have lost practically everything they possess, the majority seem to have managed to bring most of their live\n\nstock & household goods with them & wherever you look you can see drays & wagons standing about in the yards full of clothing cooking utensils, furniture & etc, & the streets are full of old men women & kids, & this morning I laughed to see the crowd collect while an old man read the latest news to them, you should have seen the expressions on their faces as they heard the different news, some good some bad, & things have been very lively & willing this evening round the little estaminets for money is plentiful & the boys are very thirsty in fact they must be choking judging by the crowds that are thronging round the boozers,, all arguing & shouting & wanting to fight all & sundry you should see them Australians Tommies amp; Jocks all fairly\n\nwell sprung & up to any devilment All the estaminet closed early reckoned they ran out of drink, but I think the boys put the wind up them but the funniest part of all took place later on in the evening, we were having a quiet game of cards when Aitchson a batman came amp; started a row he can fight a bit & he started on some of the quieter chaps & wouldn't stop, things were getting very willing when up jumped Lindsay Graham our Sgt. Major & ordered him to clear out, but this made him worse & he wanted to get into him, so without any more ado Lindsay knocked him rotten & he fell on across Prices blanket which we were playing on & the blood started to run over it, Price\n\nmade a grab at him & sang out \"boot him off\" but on second thoughts he dragged him off himself & wanted to referee the fight to get some of his own back, but as there were no lack of referees, he had to be content with holding a candle & when the excitement was at its highest & blows were being freely exchanged Jack could be seen waving his arms like a madman & holding the candle in his mouth, in fact he nearly stopped a few \"woodeners\" himself in his eagerness to see the mighty conflict, however it ended up by Graham scoring a popular win & restoring peace & quietness to a rowdy howling crowd all fired with vin blanc, of course don't for a minute run away with the idea that this indictment refers to Graham Price & Coy.\n\n \n\nfor we were far too interested in our own quiet little game of Pontoon to have ant inclination for the rotten wine, & in the end the troops shook hands & returned to their several quarters & enjoyed a good nights repose, after such a strenuous & trying evening.\n\nDuring the afternoon I had a fly at the \"two up\" School & eventually pulled out winning 250 francs which I lost the same night at \"pontoon\", so much for gambling, but we don't get much money & we do see some life, what;\n\n11th. Slept in till 8.30 for during the night we had been warned that we would be moving off today & nearly certain for the North again for rumour hath it that the \"Pork & beans\" had put up a most gallant & heroic retreat, & were\n\n \n\nnow going for their lives \"somewhere in France\", with Fritzis on their heels some soldiers believe me, Oh she's a lovely war, & what a time we're having we have just dumped our packs, in preparation for a forced march, where to I don't know, nor care much either, for its all the same to us no matter where we go, we will eventually be shot into the thick of it.\n\nA few of our financial members of the Staff, being seized with a fit of generosity rushed down to the boozer & secured a few bottles of champagne to help drown their sorrows & give them courage for the promenade.\n\nPrice & a few more of this issue are now sitting in the sun feeling very contented with the present state of affairs & scraping the mud off their boots. \n\n \n\nWhile we were out drilling \nthis\n yesterday afternoon a message came up saying that I had to report to the Adjutant at once so down I goes wondering whats the matter now, on arrival I was shown into his room, & he told me I had been nominated for the position of Bombing Instructor at the Divisional Reinforcement Camp, & also that I had qualified for this from the School at Volkeringhove very nice news if it comes off, but the Adj. said there was no certainty of it for every thing was in such an unsettled state.\n\nLast night one of the lads told me that there was a little box with wedding cake in it down at the QM,s for me all of a sudden my curiosity was aroused for I wondered who on earth it could be from, & I must\n\n \n\nconfess I was not a little anxious & surmised all sorts of things, & I might say my thoughts were connected \nby\n to a certain young lady acquaintance of mine, so I was very keen on getting hold of it, however my fears were groundless for it turned out to be from an old mate of mine in New England, in addition to this I also received a good parcel from home & one from Maude Reid, & both were very welcome.\n\n12th. Marched out from Moulliens au bois at 2.30 yesterday afternoon, & after a good march of about 14 Kilos, we pulled up in Amiens & camped for the night in a great big hospital (Victoria Hospice) just on the fringe of the city she is a beautiful place with fine spacious grounds & gardens & all sorts of conveniences, the 1st & 3rd Battns are both billeted in their big empty\n\n \n\nrooms, when we had got settled down we were told we could go into Amiens till 8 oclock so our little push got out quick & lively & raced into the town & the boozer, for all were very thirsty & dry after our march, after quenching the thirst we started to look for something to eat, & for a long time had no success, till at last we sighted a big hotel which appeared to be still carrying on with their business, so Jock & I dives in to see what was doing, & things being favourable we called the rest of the crowd along 7 all told, & in we bowl as large as life, we were shown into a big & beautiful dining hall all nicely set with linen silver & etc in one way we seemed out of place for we were all dusty & dirty from the march, but this did not \n\n \n\nworry us in the slightest for a soldier learns quickly how to adapt himself to all situations no matter how or where he might find himself, so we sat down & tried to look intelligent while waiting to be served, officers & all were in this joint & a sprinkling of \"civvies\" &amp. An odd girl or two of questionable character, old Jock was narked because they had no beer for dinner only wine, the service was very slow & it took us about 3\/4 of an hour to get through 3 courses, we left then for it was getting late, & we had to get back to call our rolls, 5 francs each was the damage & Graham stood the lot, the streets were full of drunks & we meet the noble Joe Brisset being dragged along as drunk as a lord, quite a number of houses are smashed in the city, \n\n \n\n& she is practically deserted, it seems so funny in a great town whose streets only a little while back were thronged with busy people now everything is quiet, the silence broken only by the regular screech & roar of a shell as it crashes its way into some house or other scattering the woodwork & bricks broadcast, but wonderful to say there are not a great many houses or buildings smashed, but the glass has suffered heavily & the streets are covered with a fine powder from it practically everything of any value has been sent away, & what few inhabitants that are left consist principally of old men & women & crowds of prostitutes, everyone has been ordered to leave but some still refuse to go.\n\n \n\nJust as we reached our billets a rattle of artillery brake out & on looking up in the air we spotted a Gotha almost over our heads & very low. \n\nshells were bursting all round him & machine guns were firing from all directions but he seemed to bear a charmed life, the \"tracer bullets\" seem to be going right into him & I was expecting to see him come a gutser any minute but no such luck, for he wheeled round & came up the street towards the billets when he thought he was over them he tips his load of bombs out, & the next few seconds were full of excitement I ducked behind a tree quick & lively & bits of stuff flew all around & the report was terrific seemed to shake the universe, luckily his aim was bad & the bombs fell wide of the mark but even so a dozen or\n\n \n\nwere killed & wounded, I can quite understand how terrified the civilian populations must be when air raids are on for it is an awful feeling & you are so helpless compared to shells, about an hour after 3 of them got through & repeated the dose but I don't think they done much harm, only raised a good deal of \"wind\", & again early this morning they were across you could have almost knocked them down with a stick but I'm hanged if they got any of them, the shooting of our \"Archies\" was rotten, something after the style of the","33":" Army.\n\nIt is a glorious morning & we are all resting in a big boulevard having just moved out of our billets ≈ had breakfast; we are entraining any time now for\n\n \n\nthe North again, having had a little trip to the Somme & never fired a shot some stunt this mobile Army, & at present we are the Army Corp reserve but I expect we will be up to our neck in a couple of days. the old Portuguese have given us all a bit of a shock the way they fought the fearful Hun the last few days, alters our opinions entirely of them, they seem to be made of very good stuff, old Fritz is flat out to it now right on his \"gut\" & now is the time to tune him up, hold him a little while longer & he is ours\n\nOur train is 3½ hours late for some reason or other so we moved down into the lovely “Alsace Lorraine” boulevard & laid down on our packs, I was just on asleep for the sun was nice & warm when I was startled out of my slumber by the cry of, here he comes\". what a \n\n \n\ngutser I jumped up thinking the Huns were on us, but it only turned out to be another aeroplane victory, a Fritz plane was coming down head over heels from a terrific height closely followed by one of ours these sort of things are getting a bit monotonous of late, our airman & planes no doubt are bonza's, I think he must have been over observing for the guns which were shelling the city & railway station, they knocked about 40 down there last night nearly all","34":" Bde.\n\nEntrained about 2 o'clock & just as the train was moving off we got our tea dished up & very welcome it was for we were very thirsty. it was lovely & sunny so McCowan Price & I got a box seat & sat on top of the trunks & on the way down I took the \n\n \n\nopportunity to do a little chat catching & I am sorry to say I was very successful, my labour being rewarded with a fine catch, I have been free of these pests for a long while but I am up against them now\n\nOur chaps are taking good care that if ever old Fritz does get into Amiens he will not have too rosy a time for they are busy mining all the bridges\n\nOn our way round we had a rather thrilling & exciting experience it happened at St Pol, for some reason or other we were held up here about dusk, & all the mob were laying about in the trucks when we all heard the ominous & all too familiar drone of the Gotha, next the searchlights flashed into the heavens & the Archies & machine guns opened fire, we could all see him\n\n \n\nquite plainly for he came down quite low, all of a sudden there was a series of heavy explosions almost on top of us, & there was a shower of flying metal stones dust & etc. I thought he must have caught a truck or two of our chaps for the bomb fell right across the station, I jumped out of the truck & run along the line but luckily he missed the train though the bombs fell on both sides of the line we were on, there was 4 or 5 casualties, & the engine was holed all over & the water was spouting from her boiler like a fountain. \n\n \n"}}