{"Document Name":{"0":"Diary_0201","1":"Diary_0201","2":"Diary_0201","3":"Diary_0201","4":"Diary_0201","5":"Diary_0201","6":"Diary_0201","7":"Diary_0201","8":"Diary_0201","9":"Diary_0201","10":"Diary_0201","11":"Diary_0201","12":"Diary_0201","13":"Diary_0201","14":"Diary_0201","15":"Diary_0201","16":"Diary_0201","17":"Diary_0201","18":"Diary_0201","19":"Diary_0201","20":"Diary_0201","21":"Diary_0201","22":"Diary_0201","23":"Diary_0201","24":"Diary_0201","25":"Diary_0201","26":"Diary_0201","27":"Diary_0201","28":"Diary_0201","29":"Diary_0201","30":"Diary_0201","31":"Diary_0201","32":"Diary_0201","33":"Diary_0201","34":"Diary_0201","35":"Diary_0201","36":"Diary_0201","37":"Diary_0201","38":"Diary_0201","39":"Diary_0201","40":"Diary_0201","41":"Diary_0201","42":"Diary_0201","43":"Diary_0201","44":"Diary_0201","45":"Diary_0201","46":"Diary_0201","47":"Diary_0201","48":"Diary_0201","49":"Diary_0201","50":"Diary_0201","51":"Diary_0201","52":"Diary_0201","53":"Diary_0201","54":"Diary_0201","55":"Diary_0201","56":"Diary_0201","57":"Diary_0201","58":"Diary_0201","59":"Diary_0201","60":"Diary_0201","61":"Diary_0201","62":"Diary_0201","63":"Diary_0201","64":"Diary_0201","65":"Diary_0201","66":"Diary_0201","67":"Diary_0201","68":"Diary_0201","69":"Diary_0201","70":"Diary_0201","71":"Diary_0201","72":"Diary_0201","73":"Diary_0201","74":"Diary_0201","75":"Diary_0201","76":"Diary_0201","77":"Diary_0201","78":"Diary_0201","79":"Diary_0201","80":"Diary_0201","81":"Diary_0201","82":"Diary_0201","83":"Diary_0201","84":"Diary_0201","85":"Diary_0201","86":"Diary_0201","87":"Diary_0201","88":"Diary_0201","89":"Diary_0201","90":"Diary_0201","91":"Diary_0201","92":"Diary_0201","93":"Diary_0201","94":"Diary_0201","95":"Diary_0201","96":"Diary_0201","97":"Diary_0201","98":"Diary_0201","99":"Diary_0201","100":"Diary_0201","101":"Diary_0201","102":"Diary_0201","103":"Diary_0201","104":"Diary_0201","105":"Diary_0201","106":"Diary_0201","107":"Diary_0201","108":"Diary_0201","109":"Diary_0201","110":"Diary_0201","111":"Diary_0201","112":"Diary_0201","113":"Diary_0201","114":"Diary_0201","115":"Diary_0201","116":"Diary_0201","117":"Diary_0201","118":"Diary_0201","119":"Diary_0201","120":"Diary_0201","121":"Diary_0201","122":"Diary_0201","123":"Diary_0201","124":"Diary_0201","125":"Diary_0201","126":"Diary_0201","127":"Diary_0201","128":"Diary_0201"},"Date":{"0":"unknown","1":1197.0,"2":1198.0,"3":1199.0,"4":1200.0,"5":1201.0,"6":1202.0,"7":1203.0,"8":1204.0,"9":1208.0,"10":1212.0,"11":1213.0,"12":1214.0,"13":1215.0,"14":1216.0,"15":1217.0,"16":1218.0,"17":1219.0,"18":1220.0,"19":1221.0,"20":1222.0,"21":1223.0,"22":1224.0,"23":1225.0,"24":1226.0,"25":1227.0,"26":1228.0,"27":1229.0,"28":1230.0,"29":1231.0,"30":1232.0,"31":1235.0,"32":1236.0,"33":1237.0,"34":1238.0,"35":1239.0,"36":1240.0,"37":1241.0,"38":1242.0,"39":1243.0,"40":1244.0,"41":1245.0,"42":1246.0,"43":1247.0,"44":1248.0,"45":1249.0,"46":1250.0,"47":1251.0,"48":1252.0,"49":1253.0,"50":1254.0,"51":1255.0,"52":1256.0,"53":1257.0,"54":1258.0,"55":1259.0,"56":1260.0,"57":1261.0,"58":1262.0,"59":1263.0,"60":1264.0,"61":1265.0,"62":1266.0,"63":1267.0,"64":1268.0,"65":1269.0,"66":1270.0,"67":1271.0,"68":1272.0,"69":1273.0,"70":1274.0,"71":1275.0,"72":1276.0,"73":1277.0,"74":1278.0,"75":1279.0,"76":1280.0,"77":1281.0,"78":1282.0,"79":1283.0,"80":1284.0,"81":1285.0,"82":1286.0,"83":1287.0,"84":1288.0,"85":1289.0,"86":1290.0,"87":1291.0,"88":1292.0,"89":1293.0,"90":1294.0,"91":1295.0,"92":1296.0,"93":1297.0,"94":1298.0,"95":1299.0,"96":1300.0,"97":1301.0,"98":1303.0,"99":1304.0,"100":1305.0,"101":1306.0,"102":1307.0,"103":1308.0,"104":1309.0,"105":1310.0,"106":1311.0,"107":1312.0,"108":1313.0,"109":1314.0,"110":1315.0,"111":1316.0,"112":1317.0,"113":1318.0,"114":1319.0,"115":1320.0,"116":1321.0,"117":1322.0,"118":1323.0,"119":1324.0,"120":1325.0,"121":1326.0,"122":1327.0,"123":1328.0,"124":1329.0,"125":1330.0,"126":1331.0,"127":1332.0,"128":1333.0},"Entry":{"0":"\n\n","1":"\n\nvery cold night last night wind blowing a gale \n\nRain & snow all day, guns booming in the distance \n\ncaught up with the hun at last. Had a notice up \"it’s a long way to Tiperary but dam sight longer to Berlin, Come on you Conquering Heroes . \n\nExpect to shift out of this Tomorrow \n\nowe 7d deferred Pay £22.12.0 .\n\nWednesday 21\/3\/17\n\nBy the date you would think Spring was near by the weather you’d think winter just starting. Very cold last night & again today, wind shifted a bit so it might take up. been snowing again, guns going it like mad in the right. Got Fritz again dont think he will want much more of it. \n\nHun graves in Bapaume 7 & more in each, must have got hell from our Artillery. \n\nPay 5d £22.13.0\n\nletter from Viv & parcel from Maude wrote to Both. Back to Bat. Tomorrow \n\nMonday 19\/3\/17.\n\nCant catch up to the Huns yet all hands moving up, everyone cheerful, The Boys in front are souvenir hunting & getting them galore. One got a Bullet through the lobe of his ear, not the sort he was after, Caught seven Hun snipers , they will not snipe anymore. \n\nOur Light Horse & Cavalry are trying to get into touch with the enemy \n\nHeavy gun fire all the morning in the distance. No orders about moveing yet.\n\nVery cold wind from the south more snow. \n\nI owe 1\/7. defer. £22.11.0 \n\nBritish 6 miles the other side of Le Transloy. Raining\n\n20 &","2":" of \/3\/17 over this page. \n","3":"\n\nSnow inches deep, but not so cold, going back to Bernafay this afternoon. \n\nReported that Lille has fallen. The Hun is evidently shortening his line, Said that the Turks are suing for Peace.\n\n Posting letters to Viv & Maude \n\nPay 1\/5 def £22.14.0. \n\nBack again to Bernafay 2.30 P.M. snowed all day, another man in my place. dug-out to myself. \n","4":"\n\nSun shining, cold wind blowing, up at 7. \n\nPay 2\/5 £22.15.0.\n\nmust get bath today. \n\nTurned out bitterly cold after all stayed our fire all day, Called out at 6 pm to arrest Prisoner from Transport lines, drunk, snow or frost tonight\n","5":"\n\nBosker frost, gale blowing freezing hands & ears \n\nBrigade not coming out as expected so it means another Tramp of 10 or 12 miles up to the front. \n\nPay 3\/5 £22-16-0\n\nOut for 3½ hours looking for another Prisoner; couldn't find him.\n","6":"\n\ndaylight saving in force to day, cold but little frost wind getting up as usual, feet very tired from that long walk yesterday. \n\nPay 4\/5 £22-17-0. \n\nHad hot bath first for 2 months. \n\nGot Prisoner to day. \n\noff to the front tomorrow. No leave yet. & not likely to be \n","7":" of our planes & 2 fritz’s . \n\nCaptured Hun’s Armoured Train.\n","8":"\n\nRaining like hell, everything on the move expect we go this afternoon, Place Beaulancourt about 7 or 8 miles from here, no more time for writing, \n\nPacked up ready to start. just heard we don't go till tomorrow \n\nleave starts on the","9":" latest. \n\nPay","10":" £22-18.0. \n\nWe are going to Villers au Flos about 10 miles away.\n","11":" 3 17\n\nUp at 7. BK 7.30 off at 10. all details go with us first Delville Wood then Needle Trench, Rise Trench, Millers Son, Millers Daughter. Then Le Transloy & near here Villers au Flos. \n\nTalk about a walk. it was a beaut. 5 or 6 miles on duck-Boards then through mud for another 4 miles, feet & shoulders nearly made me give in. \n\nSaw 3 dead Germans alongside the track also some skulls. But shell holes, I’ve seen some before but never anything like this, not a yard between them. Huns must have got hell here in these Trenches. Le Transloy & this place burnt or smashed to Pieces. No civilians, nothing but desolation. \n\nSnowed nearly all the way here & cold wind blowing, am camped by myself in Ruined house Just a bit of roof left all else open so will be cold tonight. \n\nAt 6 P.M. it is snowing thick & fast My feet acheing terribly don't know how I'll stand another march tomorrow.\n\nGot a good fire going am sleeping under a Partly fallen wall. hope it does not fall in on me, won't matter much if it does, pretty full up of it.\n\nHouses have all been blown down & even fruit Trees cut down \n\nPay","12":" def £22-19-0\n","13":"\n\n12 months ago today march from Tel-de-Kebir to Moaska, lot died from thirst through getting lost thanks to Genrl. Irving\n\nMy left foot gave me fits last night & is not much better this morning, no sleep don't know how I will do this march, \n\nGuns Banging away quite near us.\n\nTin sardines and Biscuit for BKs same for Tea last night. No dinner yesterday yet I carried 2 Blankets in my Pack, overcoat and Cape, Bag with rations Rifle & Equipment.\n\nRelieve the 15th Brigade to day\n\nnot going today after all thank goodness give my feet a chance. \n\nNo chance of leave now. \n\nHeavy frost last night. Wind died down at last hope it’s the last of the gales. \n\nPay 7\/7 £23-0.0.\n","14":"\n\nOff to Bancourt today about 3 miles, looks like rain. \n\nPay 5\/7 £23.1-0\n\n3. PM. Got to Bancourt soaked, rained like hell all the way. This place same as others all Houses blown up even the WCs & the Roads blown up & the wells filled in & their own dug-outs either burnt or Blown up. Trees felled across the Roads but most of them fell the other way. Not much good with the axe these Boshes, \n\nRun up against fresh horror a well that was not filled in & where we got water for tea & drinking was found to have a dead man in it Part of the body was drawn up in bucket lot of chaps taken ill over it, fortunately we boiled ours. You'd think the Dr would see to these things. \n\nRaining like blazes & the water dripping in to our crib nice night in front of \n\nFriday 30\/3\/17\n\nSun shining with a shower now & then getting warmer \n\nPay 9\/7 £23-2-0 \n\nMen started to fill up crater in the Road. \n\nOur Boys going up to the line about 3 or 4 miles away. Think we stay with B.O.R. \n\nshowers all day. fine night.\n\nGuns going it. fritz retired another 5 miles heard that the French had cut off 45.000 Huns at Alsace-Lorraine front. Rats\n\nSaturday, 31 3 17\n\nCold wind blowing & cloudy. \n\nGuns at it all night last night.\n\nPay 10\/7. £23-3-0. \n\nJust been round what is left of the Village (Bancourt) deep dug-outs everywhere some not finished womens clothes & hats everywhere a Pram is on one of the chimneys; blown up there I suppose & Bottles thousands of them, empty of course. \n\nOur Pet of Sergnt sits on his hams all day in the canteen what a waster the man is & gets 10\/6 a day for it about time he found out theres a war on\n\nSunday. 1\/4\/17\n\nOff this morning to Velue. about 7 or 8 miles away. Going to take Village from there tonight good luck to them. the 8th Brigade have taken 2. \n\nPay11\/7 £23.4.0.\n\nArrived at Velue about 2 P.M. been pretty Village all amongst Trees but now smashed to Pieces. & A beautiful Chateau the same must have cost anything up to 50,000 The ruins are still smouldering got a Piece of glass from window of church. \n\nWe guard the Ammunitions. \n\nMonday. 2\/4\/17\n\nOur Boys took their Village (Doignes) in the early hours this morning but what a mess up it all was. Found that Fritz had wired himself in so had to march another 5 miles & attack through another Village that the 56th were to take this we helped them do; then got to our own on the flank & took it loosing 208 30 Killed the huns ran squeeling like Pigs.\n\nI had to go with Sergt taking Prisoner with us & my shoulders nearly snapped got to head qrts late at night & I had to take Prisoner further on myself just got back & into dug-out when the snipers & the shells started coming over\n\nit simply rained shells all night & one exploded on top of our dug-out, hot, no I was shivering with the cold & fatigue had nothing to eat all day & marched about 15 miles did not sleep a wink & had to lie down with all Equipment on & Boots. Had to take Hun Prisoner our Boys brought in to Buisne about 5 miles away to the MPs no BKs was about done up coming back & only for a Capt of Artillery giving me a nip of whiskey would have laid down to it. \n\nLieut Wesly mortally wounded Capt Wilson leg Broken Capt Goldstein wounded twice Lt King wnd & Lt. Horne A lot of our Boys wounded in the elbow. 4 men wounded just opposite me in the Afternoon.\n\nBitterly cold. Pay 12\/7. £23.5.0 \n\nCounter attack tonight,\n\nTuesday. 3\/4\/17\n\nThe Boys held the Village alright & the worst part of all begins viz collecting the dead. \n\nThe snipers are still busy & have got some of our chaps already \n\nPassed 5 dead huns on the road we don’t give them time enough to bury them. \n\nNo chance to write letters or get any. \n\nPay 13\/7. £23.6.0 \n\nup to present have had 1 Piece of Toast. 1 Piece of damper & 2 Pieces of Bread & margarine in 3 days & 1 drink of Tea. \n\n4. P.M. Just got word that we go out 53rd relieving us go to Velue again. \n\nMet young Stagg of Tamworth. Knew Mother & Loo. Dvr in 12th field Ambulance. \n\nC. Sect. off through Bemetz at 8 PM. got to Velue about 10.30. Bread & milk A Tommy gave us Tea on the road here. Rained all the way back.\n\nWednesday. 4\/4\/17\n\nbeen snowing for hours. about 6 or 7 inches deep. & this is spring Anyway the starlings & sparrows are nesting. \n\nIt was a beautiful walk last night our sweet Sgt. half drunk & quarrelsome all the way. He took 3 Pulls at Mr Gardeners Bott without leave, hide enough for anything \n\nlost 7 officers in the stunt B. Coy took in 160 men came out with 72. \n\nrain & snow all day. \n\nPay. 14\/7. £23.7.0.\n\nThursday. 5\/ 4\/17 \n\noff to Le Barque up at 7. dread the walk. 11 miles or more. \n\nfritz slinging shells over us early this morning woke me up. \n\nPay 15\/7. £23.8.0.\n\nGot here about 4. done up as usual wont be able to stand much more of it. \n\nFriday. 6\/4\/17\n\ncloudy & Raining slightly. Plenty of Planes about. also some of fritzs. \n\nwas told we were here for a month & that leave would start\n\nPay 16\/7 £23.9.0 \n\nBought some Butter F.4. 30 s. cigs. 1.30 Biscuits 3. frs. milk 1.20 Syrup. 2. frs. spend all your money in eatables. \n\nour ceiling leaking, no roof, all gone\n\nSaturday 7\/4\/17.\n\nRained all last night & the water dripped on us no way of stopping it. so put Blanket over head & snore & bore it. \n\nSnowing this morning a glorious climate no wonder we are cheerful. 2 days ago hot enough for summer now winter again. \n\nNot feeling too well today \n\nPay. 17\/7. £23.10.0. \n\nclear again this Afternoon. \n\nSunday. 8\/4\/17\n\nA Beautiful night last night, full moon. Cloudy this morning but fine & mild, not feeling well yet. \n\nPay. 18\/7. £23.11.0\n\nmail in got letter from Trustee Coy. telling me of £450 left me. £200 now & £250 when Uncle Jack & Miss Wyndham dies answered it \n\nletter from Viv also still in Hospital. \n\nNewton a Major Genr now\n\nThank goodness theres something waiting for me if I get home\n\nPaid 14\/4 Bal owing to me 4\/3\n","15":"\n\nRain, sleet & snow this morning no two days fine can bet on it\n\nPay 5\/3 £ 23.12-0 \n\nWrote to Syd & Viv will have to wait till I hear from Nell. \n\nTerrific Bombardment left of Bapaume this morning 3rd Army going them hell taking Prisoners by the thousands \n\nLivingston the waster gone to B. Coy as Platoon Sergeant\n\nTuesday. 10\/4\/17.\n\nSnowing like blazes inches deep, muster Parade on, out getting the men to it. \n\nPay. 6\/3. £23.13.0 \n\n3rd army took10.000 Prisoners 100 guns. \n\nLivingston not gone yet goes tomorrow hurrah rid of the blighter at last.\n\nbitterly cold all day. \n\nJust had two small Botts stout necta eh what. first for months, haven’t seen a woman or child for 3 months \n\nletters from Viv. Maude, Nell Jack & Carol \n\nburnt a bit of my diary though trying to save my grass bed. dam it.\n\nWednesday. 11\/4\/17\n\nfrost last night snow frozen this morning looks like some more today. \n\nmust write to Maude & Nell today.\n\nPay 7\/3. £23.14.0. \n\nOff again to the Lord knows where, seems as if leave is cut altogether.\n\n3.30 PM After getting ready & all Packed up sent back to billets \n\nall sorts of rumours going round about 1st Div being cut off by Huns etc. 5.30 pm snowing hard might move off yet \n\nThursday. 12\/4\/17\n\nThank Heaven we hadn’t to move last night 6 inches of snow & a strong wind blowing would have been awful. Now waiting for further orders. Sun shining& the snow looks very pretty.\n\nPay 8\/3 £23.15.0 \n\n6.30 P.M. not going up now thank the stars. \n\nJust heard that Livingston has been telling a lot of lies about me shall have to ring his ugly nose for him.\n\nFriday 13\/4\/17\n\nBeautiful morning. Sun, nice Breeze Blowing but how long. Band Playing \n\nEggs & Bacon Toast & Butter. Eggs 4.20 a dz. Butter 4.30 a tin. \n\nPay 9\/3. £23.16.0\n\n1. P.M. Heavy clouds & cold wind.\n","16":"\n\na nice morning again. one of our lizzies 15\" guns on the Railway giving Fritz some hurry up fritz replying with his high Velocity gun \n\nPay 10\/3. £23.17.0\n\nWrote to Nell & Viv & posted them \n\ngot clean singlet today wonder they could spare it.\n\nSunday 15\/4\/17 \n\nYanked out at 6. a.m. get ready to move at once fritz attacking 1st Division taken their Village. \n\nAll standing to 8. a.m. expected our spell would be something like this, wonder if there are any other soldiers besides Colonials over here \n\nPay","17":" £23.18 0. \n\nmarched off in the Rain at 9. a.m. got about a mile away when we were ordered to return, went back quicker than we came out. \n\n6 P.M. fall in full marching order again & off this time no mistake off to Bapaume as reserves. Arrived Bapaume 9. P.M. wet in cellar under ruins. expect to go on guard.\n","18":" \n\nhad a good nights rest after all, no guard work. \n\nOn duty all day Keeping men to their Billets. \n\nFritz has taken all the Statues to melt down I suppose, \n\nfine day but nippy \n\nmore prisoners keep coming in must be nearly 20,000 now lot of them boys 16 & 17. \n\nPay","19":" £23.19.0. \n\nfritz sends his high Velocity shells over here regularly trying to smash up Railway & Roads. \n\nWent through the remains of the fine church here nothing left standing, in the Crypt are hundreds of skulls. Got a couple of Pieces of stained glass from window, have Plate from Le Barque & glass from church at Velue.\n","20":"\n\nPay","21":" £24.0.0 \n\ncold wet & now & then snow. \n\nCanteen arrived this morning on duty there, all the morning. \n\nPike half screwed. 5. P.M. \n\nsuppose we move again tomorrow . Two days in\n\nShell smashed Bapaume. Where the Town Hall was is a huge mound of Brick & Mortar There were some very large & fine buildings here but not one has escaped should judge it to be a town of anything up to 25,000 People now theres not one to be seen all soldiers. Tommies & Ausis\n","22":"\n\nVery cold again Rain & Snow, slush & mud \n\nGuns very busy last night, all quiet now.\n\nshould be going back again today \n\nPay.","23":" £24.1.0.\n\nleaving here on the","24":" long journey perhaps Armentaires. hope so. \n\nletters this afternoon should get some.\n\nhaving good spell here & plenty to eat but it is not always so. More prisoners this morning.\n\nhave been to Picture show just fancy a show here in Bapaume a few weeks ago & even now shells were flopping in to it, such is life, Matty Walker took me.\n\nNearly Blind with smoke from fire eyes running water & Blood shot, very painful \n\nto be bed at 9.30.\n","25":"\n\nat last letters 2 from Nell, 2 cards from Carol letters from Jack & Tony one from Loo & Viv ea. Quite a budget, must answer them to day. \n\nFrench & Russians doing well we hear Our guns never cease. \n\nLeaving here tomorrow for the North some say Belgium. feeding us well so I suppose its Per Boot as usual. \n\nCarol's Cards caused many a laugh. \n\nRumour says we are to be bombarded here tonight, hope not as we leave tomorrow. \n\nGas alarm on. \n\nLetter also from Syd. \n\nPay 15\/3 £24.2.0\n","26":"\n\nWrote to Nell, Maude, Loo, & Viv not posted yet. \n\noff this morning to Albert, going long journey, not carrying Blankets this time but as we only go about 6 miles today will be cold tonight that however is better than having your shoulders Broken. \n\nPay 16\/3. £24.3.0 \n\nleft Bapaume at 12.30 got here Hot Cross Camp. about 5.30 distance about 11 miles feeling better than on other marches \n\nbut that was because I had no Blankets to carry. Just Bathed my feet in shell hole water & it was some cold feel all the better for it tho. Fellows all in high spirits even after that march they are trying ti kick the inside out of a football 6.30.PM. did not call at Albert so shall not see that historic Town. \n\nOff again Tomorrow for another 10 or 12 miles then next day through Amiens & 6 Kilos further where we stop. Altogether about 40 miles. It has been a lovely day fortunately for us or the march had it been wet would have been awful as we came across Country part of the way round shell Holes etc.\n\nSaturday. 21\/4\/17\n\noff again at 10.30 about 14 miles today to Corbie so they say \n\nA terrific Bombardment was going on North all night & is still going on. Ah fritz retribution is fast upon you.\n\nCloudy & looks & feels like rain. Arrived here Beurcourt at 2 P.M. about 8 miles & my feet were just giving out also shoulders & I was not the only one. \n\nRained slightly & turned very cold has every appearance of snow again \n\nwe are on the Somme again but move \nup\n on again in two days. \n\nGet a long felt want tomorrow A Bath & clean linnen vz underwear. \n\nThe French & British have given fritz hell this week & no error anxiously waiting to hear about last night & this morning. heard that 20 divisions were going over.\n\nSunday 22\/4\/17\n\nfreezingly cold wind blowing big church Parade a Brigade affair. \n\nBath today I hope. \n\nPay 15\/3. £24.5.0.\n\nCold water shave & wash, cold gee whiz. \n\nHere for a week rumours that we go to Salonika. \n\nFunny life this the other day dodging shells now playing football & cricket as if there was not such a thing as war. \n\nGot hair cut. \n\nMonday 23\/4\/17.\n\nfreezing wind again but fine, guns going it all night & at it yet. \n\nPay 19\/3 £24.6.0\n\nwent to see the charred Cross. This is a huge cross with I.R.N.I. in letters on the top of it as representing our Saviour. On this cross a sutty was nailed & burnt so they tell me here The cross & near by trees are certainly charred & burnt. I would not put it past the devils. \n\nA Taube dropped some bombs not far from us this morning. \n\nWrote & Posted letters to Maude, Loo Syd & Viv. & Nell.\n\nTuesday 24\/4\/17\n\nFine & a little warmer getting pleasant now & just about time. \n\nAnxac Day tomorrow. All kinds of sports & competitions.\n\nPay 20\/3 £24.7.0.\n\nGetting plenty to eat & a liberal dose of rum at night. Am feeling well again & a few weeks of this will make a new man of me.\n\nhave saved 100 francs & get paid again today. \n\nNo word of leave. Yes 2 gone on leave this morning ought to get mine soon now. \n\nPaid 20 Frs. 14\/4 Bal. 5\/11.\n\nevery one polishing up & getting ready for tomorrow. Just got a new Pr of Pants first since Sept 7\/15 what with Boots Polished clean clothes Hat (felt) stiffened up (with water) & cleaned & fastened up at the side, we don’t know ourselves.\n\nAlso Bands playing you'd think there was no war on. \n\n3rd Army Pushed the huns up north where we were so long advanced 1500 yds on 20 mile front & took 2000 Prisoners. Huns on this front done another bunk. retired.\n","27":"\n\nAnxac Day all is bustle & cleaning up shaving, cleaning Boots, Brass, Harness limbers & Cookers for the sports & competitions. \n\nCloudy but fine so far cool wind blowing. \n\nVery heavy gun fire early this morning away to the right think the French must have gone over. \n\nPay 5\/11. deferred £24.8.0\n\nHave made error in pay the above is correct mistake again. \n\nC Coy won the contest for best squad A Coy","28":" D. & B also ran. \n\nLatest is that we are off to Salonica or Egypt.\n\nTurned bitterley cold this afternoon \n\nC. Coy won 9 events out of 15. \n\nglad to get to bed to get warm, no fire. \n","29":"\n\nStill Cold & cloudy. \n\nCame a cropper this morning, ordered out to drill with the Band for about 2 hours. \n\ngetting a bit hot, on duty all day, now drill also think Ill go back to the Coy.\n\nPay","30":" def. £24.9.0. \n\nno word of leave yet\n\nbelieve we are off to Egypt soon. \n\nTurned out warmer the wind having dropped a bit & the sun got a chance. \n\nletter from Viv. Wrote to Mr Parsons not posted yet.\n","31":" \n\nCloudy & like rain & warmer .\n\nTerrific Bombardt all night on left of Bapaume. Germans getting hell. \n\ndrill again this morning. \n\nGoing into Albert this afternoon at 3. \n\nBombardment still going on. \n\nWent to Albert at 3.30. fine Town & not so smashed up as say Bapaume the fine Cathedral as usual being the most knocked about. This was a beautiful \n\nbuilding with a Bell Tower & on top a statue of the Virgin & child weighing 6 tons this was hit at the base & fell overhanging the street an awesome sight to walk under, its about 300 feet from the ground. It was secured in its Present Position by Aux Engineers. but in my opinion will come down one of these days the strain on the Brick work being awful . \n\nSaw some women & children first for about 3½ months also shops etc, some of the people have chanced it & come back again but they have a look about them that is not pleasant & no wonder. \n\nGot home again about 8.15. Bombardment still going on.\n","32":"\n\nfine & getting warmer, quite close last night \n\nBombardment still going on heavily.\n\ngetting inoculated again today. What for no one knows.\n\nGiving in sheep-skin vests & spare blanket. \n\nPay 8\/11. £24.11.0. \n\nWish I had got some souvenirs from Albert but too expensive.\n","33":"\n\nA Beautiful morning sun hot quite like Ausi again. \n\nGoing to Dr about my Kidneys had no sleep for 4 nights\n\nInoculated yesterday arm very Painful all day & night a bit better this morning. Dr giving me linament to rub into back may as well give me pepermint lollies.\n\nPosted letter to Viv & Mr Parsons two papers came from Mr Parsons yesterday. \n\nPay 9\/11 £24.12.0 \n\nBeen very hot all day just like Sydney Butter & tinned cheese melted, \n\nno sounds of guns must have advanced a lot. \n\nFeeling very crook from inoculation all the Boys the same.\n","34":"\n\nbeautiful morning not as hot as yesterday nice breeze blowing, drill but we are out of it now that the Band is disbanded. \n\nUp on the Road about ¾ of a mile away is the biggest crater in france about 80 ft deep & 300 ft in circumference must have been a mine but whether one of ours or fritzs don’t know. \n\nThe last place we stopped at got the first sight of a Tank & Trailer no wonder fritz got frightened. \n\nletter from Jack & Carol yesterday. \n\nPay","35":" £24.13.0.\n\nTerrific Battle going on may decide things the huns sacrificing their best Troops trying to stop us.\n\nJust voted for the ministerialists hope they get in. (have gon got chits no scabies) \n\nFootball matches. Brigade Band playing Divisl sports start almost at once.\n\nAfter that off to Ypres or Armentires. \n\nGot Pr of Sox from Nell \n\nno letters. \n\nReinforcements came to day should not wonder if we moved off Tomorrow.\n","36":"\n\n A nice fine day, a bit cold, strong wind blowing from the north, can hear the guns going it, that is the heavies. \n\nDivisional inspection & sports tomorrow great activity cleaning up limbers, cookers, etc.\n\nPay 11\/11. £24.14.0 \n\nSome going on leave today lucky devils I may get away before Xmas. \n\nletter from Nell about the best I have received, a bit more feeling in it I am glad to say. \n\nInspection by the General Tomorrow. All men except 4 in the Batallion 150 Rounds of ammunition to carry as well as full Pack. \n","37":"\n\nFine day, cool wind blowing up at 5 shave etc find the review is put off. \n\nPay 12\/11 £24.15.0 \n\nGlad to get under cover sun very Hot Queer weather this wrote to Nell. \n\nGot a new Boss Ta Ta Livingstone.\n\nPaid 20 francs 14\/8\n\nFrench money has gone up. Stand now deferred Pay £24.17.0 owes me 3\/1 this is correct & in hand 104 francs & a half £3.14.10 2\/5\n","38":"\n\nforgot pm yesterday am writing this on Friday.\n\nGreat scare, got orders to stand by to go to the front again, at 4 P.M. but it was a false alarm the 2nd div. held what they had taken so we wern’t wanted\n\nWeather keeps fine & if the wind dyed down would be hot.\n\nPay 4\/1 def £24.18.0\n\nGee whiz food does run away with your money.\n","39":"\n\nA lovely morning same old wind with us yet.\n\nBoys very lively owing to not having to go in again div sports tomorrow\n\nPay 5\/11 £24.19.0.\n\nletter from Viv. wrote Jack Carol Tony & Nell.\n","40":"\n\ncloudy but fine hot night but cool in the early morning took off underpants.\n\nwrote Viv.\n\nPay 6\/1 £25.0.0\n\n5. P.M. been very hot like summer in Sydney these last 2 days & only about 10 days ago were shivering round fires. Truly a remarkable climate.\n\nWe had 2 firsts & 1 second at the sports. not so bad when considered that competitions were open to 4th & 5th Army.\n\nAm living very high 1 tin of Salmon 1½ francs 1 tin of Peaches 1½ francs for Tea tonight wont have much left for Blighty at this rate.\n\nSeems funny our having sports & a few miles away others are being blown to atoms \n\nin hand 91 francs about £3.6.9.\n\nlooks like storm wind getting up & turning cold.\n","41":"\n\nA bitterly cold night & again this morning. Yesterday men getting about with only Pair of shorts on, to day – overcoats.\n\nPay 7\/1 £25.1.0. \n\nbeen very cold all day & the sun shining. \n\nInspection by Genrl. tomorrow.\n","42":"\n\nAnother surprise off to Bapaume again by Train then Per Boot to God knows where \n\na hell of a Battle going on guns going for all they are worth we are into it this time with a Vengeance I wonder if this is to be the end. \n\nPay 8\/1. deferred £25.2.0. \n\n53 & 56th have gone we expect to leave at 9. \n\nwas up at 4.30 a.m. On board train 11.30 a.m. left 12.15 through Miroumont. desolation & Tommies Arrived about 4 PM tired & dusty, came through Bapaume & other Villages & Towns but did not get their names. Plenty of them about here & they don't appear in the distance to be smashed but suppose they are. \n\nif the huns make a big counter attack tonight into it we go & as the fighting is awful God knows if you will come out of it alive. The Big guns about 400 yds away are kicking up blazes & the others are like machine guns.\n","43":"\n\nRained all night, slept in tents, woke up this morning swimming for dear life inside as wet as outside So got up & did what we should have done yesterday, dug a trench (fastening the stable door after the horse got out). Owing to the rain there wasn’t much doing but the guns are still banging away.\n\nPay. 9\/1. £25.3.0.\n\nRained all the morning & of course nothing but mud again. Hot as blazes yesterday, cold to day. \n\noff to the line this evening, guns going it\n\nlef at 8:15 arrived 2 a.m. nearly a gonner twice once coming through Boulingcourt a shell burst in a ruined house alongside the Road & a Piece of brick came down on my helmet. good old tin hat, the other was here, men just going to get into dug-out when shell landed 3 yds away on the other side of the sunken lane thought we were all gone but I only got small splinter in the side of the knee & my face covered with phosforus, \n\nOne man wounded & my mate got a hit in the neck & face a very close shave & am looking at the shell hole while I write this & wondering how we escaped, had a hot time all the way in & the noise was fearful, hundreds of guns firing from our side also fritzs. \n\nMarched almost 8 or 10 miles but in Battle order no Packs. Had to sit up all night no room to lie down three of us in dug-out. shells still passing over us. \n\nOwing to the rain the Roads are awful & the mud like glue. hope we get out alright.\n\nJust before getting here fell down a 15 ft. trench & the old tin hat saved me from smashing my head, \"Oh it was a bosker night. \n","44":"\n\nStand to at 4 a.m. till 5 but nothing doing our fellows went right into front line & we are here for 48 hours. \n\nA beautiful day; sun shining again \n\nnot too safe outside the dug-out. Any way we are in the Hindeberg line & the trench I fell down was his front line. \n\nPay 10\/1 pounds 25.4.0. \n\nNearly had the use for Pay Books finished last night it was a hell of a time & no error.\n\nIt was Pike Peterson who was wounded last \n\nnight got it in the arm also three others one of the A.M.C fellows was one of them. \n\nfairly quiet today only artillery fire. Tonight will be the usual thing I suppose though they say fritz is blowing up the Village he is in & is on the retire again. \n\n9. P.M. the guns have started their infernal din again just getting dark.\n","45":"\n\nhad an awful night & a wonderful escape A shell burst in exactly the same place as the night before & a piece of it set a bag of bombs off that were on top of our little dug-out the din was fearful & the smoke also thought it was all up this time & expected the D-O. to fall in. However nothing happened but I don’t want any more as close as that. \n\nLtn Gardiner & 3 men were killed in a dug-out in the same way so we must consider ourselves fortunate. The two shells have made a nice hole opposite so if another comes tonight it will go a bit farther in. \n\nA beautiful morning again & not a gun on either side firing, quite a relief, but not for long I think as a lot of our Planes are up over us. \n\nGot no sleep of course had 3 gas alarms. \n\njust had a look where bombs went off Rifles are smashed Bayonettes are Broken & all along the side of the road, is eaten with holes surely a special providence is looking after us to escape being hit last night & they tell me its far worse down the front line, this is supports. \n\nHave to go for Rations 9.30. back to Village of Vaux. \n\nPay 11\/1 £25.5.0 \n","46":" \n\nWell last night was the limit, started off at 10 in the dark, fellows like stuck rabbits thought they hadn’t a minute to live so got over the ground for all they were worth, being all young men, soon left me behind. Shells were bursting on our left all the way. Got to my old stumbling block the Trench which I fell into & safely got over this time but on the other side not a soul was to be seen, so I had to plug along on my own & didn’t for the life of me know where I was going or when I would fall into a shell crater, however after much cursing, sweating & yelling to the others I got there at last. I called them all the scared ninnies I could think of \n\nGot our Bags of Rations & a tin of water & off again hadn’t gone hundred yards when head over heels I went water one way & Rations another Rifle another & helmet the same. I didn't say anything \"Oh no\" smiled ever so sweetly & said dear me \"I don’t think\". up again & through the shell zone again arriving safely, Just prior to this 6 of the 53rd were knocked out at the well one killed. \n\ndelivered the goods & turned in 12.30 just getting a snooze up when we were called out again to take Rations up to head Quarters six yds up. did so after some more \"dear me’s\" & then turned in at 2.30. We went over land & not through the Trenches & it was a wonder we were not spotted & shelled. Hadn't been in more than half an hour when Fritz started & didn't he pump shells into this Place, wonderful how any one lives through it \n\nToday fine & hot Planes over us & the air craft guns are going strong. Forgot to \n\nmention that when we got back from getting Rations, were called out to bring Ltn Gardiner in he had his head blown off so when we found that he was being brought in were not sorry. \n\nSome chaps wounded just same near us, a shell exploded just near the top of our dug-out. \n\nBeen very hot today quite Ausi weather & this evening is lovely, not many guns, seems quite Peaceful. \n\nMajor Cain got one through the foot, out of action. Jess Smith his Batman (now a corporal) has gone with him. \n\noff for Rations again tonight. \n\nPay 12\/1 25\/6\/-\n","47":"\n\nTerrific Bombardment started about 9.p.m. Scotties & the 57th ours went over & took a position & in the middle of it all we set out for the Rations & it was hell, you couldn’t hear the shells coming for the awful din so when we got to the next Trench we stayed there until it lulled a bit then on & got lost in the Village for 3\/4 of hour too dark to get your bearings, got them at last, loaded up double load this time & started off, was just turning into a Ruined building when 4 fritz's shells came in one after the other 20 seconds later or sooner & the lot of us would have gone up, Truly I am having some narrow escapes this time & hope with all my heart that my good fortune continues.\n\nAfter this got home alright with the sweat pouring out of us. \nwoke\n 12.30. woke up to an even worse Bombardment Fritz counter attacked & kept it up for 3 hours but no go we are still in Possession & got 157 Prisoners We had a lot of casualities also but fritz must have got hell. They are bringing out the wounded now & our Planes are very busy. so are the chats. \n\nthe Village taken last night was Builingcourt. Very Hot again & plenty of artillery fighting. off for more Rations,. \n\nPay 13\/1 £25.7.0 \n","48":"\n\nAnother exciting night again but not so full of danger as privously, got over for the Rations earlier so could see where we were going & it’s the better Plan. Had to take some up to Head Quarters later on in the dark how I hate the dark my eyes are not as good as they were & am always in a funk that I shall fall down some deep shell hole & get hurt one doesn’t want that sort of hurt over here. Got back safely soaked through with sweat, very sultry weather. \n\nGo out to the supports tonight. Fritz counter attacked again this morning about 3 don’t know how he got on this time. The Scotties took 400 Prisoners yesterday & the 15th Brigade 157. \n\nThe Bombardment was terrific while it lasted but everything is quietened down a bit now, always does when our Planes get up there are about 30 up now & they have the hun bluffed, scarcely ever see any of his. Some rumours that fritz is evacuating in front of us. \n\nPay14\/1 £25.8.0\n","49":"\n\ncame out last night & not likely to forget it. Huns must have got wind of it & an infernal Bombardment started which beat anything yet & that’s saying something, our Posi was shelled for 2 or 3 hours & it was quite dark & Raining when we got away, with that creepy feeling you get when the shells come behind you. Got here Norreil at about 11.30. & the shells were bursting all round this place owing to Batteries being near. What a night it was I have had my fill & wish I was out of it, have had 6 days & nights \n\ncontinuous shelling & carrying Rations 3\/4 of a mile through it in the dark to make the noise more appaling a terrific thunderstorm came on about 1 oclock this with the guns made it seem like hell let loose. Thank God we are alive this morning & may go back another 2 miles today, though doubtful as the Brigade is in till Wednesday. \n\nThis morning is fine but thunder is about & looks like another storm. \n\nPay 15\/1 £25.9.0 \n\nThis Village like all others is a mass of ruins. Laid on the floor in the dust of a ruined house right under shell fire but did not get any sleep. Our Canteen is here so got some cake 2 francs Biscuits 1 F. cigs 6d leaves me 76 francs. £2.15.8.\n\nRained on & off to day & this afternoon had some shells very close to us, never seems safe even when out of Trenches. \n\nMuch cooler to-night. \n","50":"\n\nI can hardly believe I am alive this morning after the awful time last night commencing at 9 P.M & finishing about 6 a.m today. All ideas of Fritz being short of amunition was rudely dispelled for the Rain & hail of shells during that time beggars description & of course they took their Toll. Among the first being our corporal (Birch of Goulbourne) & Percy Peacie my mate Birch killed outright & Peacie badly wounded a third of the shells were gas shells & I had my Helmet on & off hundreds of times. It out did Fromelles & thats all there is to say about it except the marvellous good fortune that is mine. The night before I was in the same place with those two but owing to rain shifted to\n\nanother posi \/ otherwise – had to leave this owing to the constant warning of gas & not daring to go to sleep so joined some other fellows in another part of the ruined house & there I sat on the floor all night expecting every second to be blown to atoms but altho they came alongside of us, at us & round us none hit us after the one that got my two chums till daylight when feeling cramped I got up & walked into the next room \n\nhad just got into it when a shell came into the room where I had been, walked out of this room & the same thing happened a shell came into the room I had just left amongst a lot of men wounding some I then went out to the place when I had taken my things to to see if it had been blown down & no sooner got there when another shell came through at the corner, that was enough \n\nI went for an early morning stroll up the road away from the shells & after getting my nerves a bit steady made to come back when crossing what was once a railway line a whiz Bang just missed my head by ducking & landed about 10 yards away. Some of the boys say I am not born to be killed by shells & there is no get away from it, I am lucky, & never thanked God for life so fervently. There seems some guiding force behind me when danger is near at all events so it seems to me. \n\nAm now in charge of the Police & have just had a sweet job looking for some men. saw several wounded whilst doing it \n\nwhat to night will bring forth, one can only surmise by the quietness of to day like yesterday that we are in for a repetition of last nights business I sincerely hope not as my nerves are getting jumpy under this terrible shell fire. This morning I was thoroughly unnerved & fit for nothing as were all of us. Am the only one in the Police left now two new men to report today \n\nPay 15\/1 £25.10.0. \n\nWe lost a lot of men last night & so did Fritz when he tried to come over in massed formn. our Artillery was waiting for him so you can guess the rest. The German dead are heaped up in front of our lines \n\ncame over in waves.\n","51":"\n\nThe huns have run or evacuated or retired one of these & the result a good nights rest free from horror & no one wanted it more than I did hardly closed my eyes for, (at night time) a week. A few shells came over last night & smashed up some more of the smashed village & now he is gone back to another strong ridge at Cambrai five miles, but we’ll hunt him out of that also. \n\nPay 16\/1 £25.11.0. \n\nThe Posi I was going to sleep in last night, but changed my mind about 6 PM, had a huge wall blown down during the evening. Reported since that fritz has not gone back so far, if at all still the Tommies went over this morning & found he had left their sector. Pretty quiet again today Percy Peacie had about 20 wounds small ones & the Corporal Birch had his throat\n\ncut by a piece of shell. Poor chap last I saw of him he was watching the Signallers playing cards now he is buried.\n","52":"\n\nBeen much quieter altho a good few shells came over yesterday afternoon & last night some of them gas. Take it all round there was not anything out of the ordinary except that they came from one quarter only viz on the left. so that it is probable that he is retiring one sector at a time. There are expectations that we are to be relieved tonight but nothing definite, the sooner the better. \n\nPay 17\/1 £25.12.0\n\nOur chaps were out souvenir Hunting yesterday getting watches rings etc. \n\nhave written Viv & Maude have to Post them also one for Nell, Jack, Carol Tony & Will Stewart & Syd \n\nWet & Cold these last two days.\n","53":"\n\nFritz got pleasant again last night & treated us to gas again but we are up to all those silly dodges now & it cuts no ice didn't last long so had a good nights rest. \n\nfine this morning tho cloudy & warmer. \n\nPay. 18\/1. £25,13.0. \n\nOur planes were out early this morning so we might learn where he is not been able to go up for 2 days. Our boys going in again to night seems as if we will never get out of this hell of a Place the fiercest fighting of the war is going on here at Bullencourt, \nThis\n village is called Noreuil & to our Right is Langnicourt. \n\nFritz shelling us again big stuff 8 in \n\nJack Nelson wounded just now about 25 yards away. Promises to be a lively night. \n","54":"\n\nmy prediction was correct it was a lively night shelled us with heavies for 5 hours & came mighty close to my Posi. Lt. Jimmie Kerr was killed Sergt Jack Nelson wounded & many others its time they came to their senses & moved us out of this death trap.\n\nThe Boys took 3 days Rations so as not to have to come out for them every night. \n\nfine but cloudy & chilly, during all the 5 hrs Bombt. last night our guns never replied with a shot. ‘Why’ I wonder. \n\nPlanes very busy this morning, can’t find Fritzs big guns tho. here for another 7. days yet, we \nmust\n be the only army in France, every road you go & every track is marked with Blood, smashed helmets & Rifles & equipment if Fritz is getting it as the Papers say he is, what must it look like on his side. I shall be more than thankful when we get out of this & still more so \nwhen\n I get my leave \n\nJust watching some of our Planes when first one & then another began to fall turning over & over from Tail & head then over sideways. thought they were gonners but bless you they were giving us an exhibition & for cool front they were the limit, almost over Fritzs lines too it’s bucked us up wonderfully for if thats their opinion of Fritz & they can see him, enough said. \n\nPay 19\/1 £25.14 0\n","55":"\n\nanother quiet night thank goodness \n\nslight Rain & mist also this morning hot & fine \n\nsaw great Plane fight just now as far as I could see none came down but it was a great sight & just over head they looked just like giant birds wheeling & diving, flying sideways & \n\nswooping up again firing all the time there must have been about 10 or 12 of them but how many of each could not tell, it was too quick & exciting, There seems little danger of these new monsters falling they fly anyhow & at any angle. come to think of it, its a wonder the two of us weren’t hit as we were just under them, but you don’t think of these things till after. \n\nAm hoping to be named to go to blighty today some went last Sunday \n\nsuppose tonight will be a repetition of last sundays straffing. Must have been a hop over on our left last night a barrage was put up about 8 P.M. \n\nPay. 20\/1 £25.15.0\n","56":"\n\ndull & like rain \n\nfairly quiet last night, can't make it out something is in the wind, must be a big attack our Planes very busy. \n\nSome of our chaps coming out tonight. \n\nPay. 21\/1 £25.16.0. \n\nBeen quiet all day except for some Artillery exchanges now 6.30 pm. \n\nBrigade goes out tomorrow, thank heavens. \n\nBeen playing Patience these last two days nothing to do & all day to do it in bit different last week. Expect we have a nice old tramp in front of us.\n","57":"\n\nRained all night, heavy firing on Both sides think it another hop over. Go out to night. \n\nPay. 22\/1. £25.17.0. \n\nonly a rumour about going out, coming out of Trenches but only into reserves, more rain coming ,dull.\n","58":"\n\nfine & warm but cloudy fairly quiet a bit of a Barrage put up last night about 9. but what for don't know. \n\nJack Nelson died yesterday also Kanan, must write about Jack. \n\nmy leave is nearly due now owing to all the rest having had theirs. \n\nPay. 23\/1\/ £25.18.0. \n\nGoing out in two days time to Beaulincourt. \n\nKeeping fine & sun hot 5 p.m. Been fairly quiet all day \n\nWrote too soon about it being quiet had to go for our lives twice put 8 inch shells all round our dug-out in fact all over the place & what a crash they do make came back after 2 hrs expecting to see our place buried, but altho covered with dirt & bricks no harm done hope he does not start again to night. 2 or 3 hours of that lasts a long time.\n","59":"\n\nNight passed off quietly except for artillery exchanges. \n\nA Beautiful morning clear sky with a few clouds floating over, guns banging away in spasms nothing defenite. \n\nJust washed my feet had shave, cleaned Boots Ye Gods fancy cleaning your Boots in a place like this, but hate to be dirty. \n\nExpect the Boys will chiak me over it. \n\nPay. 24\/1. £25.19.0 \n\nwish that leave would hurry up. \n\nSent the gas over in cylinders to Fritz about 2 a,m & sent in the heavy stuff must have given him a shaking up. \n\nhad to leave our dug-out, put a gun about 6yds away from us & near the entrance; first shot thought my head was gone, but it wasn't long before I left to them entirely, am in one I found this afternoon, not bad.\n","60":" \n\nA Beautiful morning clear & fine sun hot. \n\nPut over gas again last night & Frit’z horns were going some have not heard of results from the two nights gas Pay him back for that gas shell Bombardment he gave us from 9 PM. to 5 a.m. \n\nArtillery very busy to day, expect to go out some time tonight off to Baileu so I am told. should get my leave from there. \n\nPay 25\/1\/ deferred £26.0-0. in hand 71 francs £2.11.1. \n\nPacked up & waiting to move 8 P.M. sun just going down \n\ngoing to Feveul the Place we left to come here, all tents there. About 8 to 10 miles with full Pack up. \n\nShells 8\" coming over very close. \n","61":"\n\nThank God we are out of that horror of a death trap at last left about 10.30 last night 2 of us & headed straight up death Valley with full Pack up & a hot night to cheer us on with sweat pouring out of us. \n\nGot clear away to Vaux with out getting shelled had Tea & a cake at the Y.M.C.A. then on again .Got about a mile when a limber caught us up & we got a ride to here & we got a ride to here Feveuil arriving at about 1. a.m, full of thankfulness for our escape, some of the Boys were hit & some killed coming out they nearly all got here about 2.30. so no sleep all night. \n\nA Taube came over to Bomb us at day break but the anti guns drove him off \n\nhe got 12 the other morning 3 killed. \n\nGoing to Boulingourt about 5 Kilos away at 2. P.M. After which don’t know, this\n\nPlace full of Tommies & Ausy’s. There is a wood just near us & it looks lovely every shade of green in it & one of Fritz's Grave Yards there also. \n\nAm told we are giving the huns a bad time & if its any worse than I have been through they are welcome to it. \n\nPay. 26\/1 £26.1.0.\n\nSunday 27\/5\/17. \n\nA Beautiful morning nice Breeze blowing chilly during the night. \n\nGot here at 7. P.M (Beaulingcourt) last night. Big camp Just outside Baupaume . \n\nEven here fritz has a gun shelling the Road from 18 miles Back.\n\nGetting Paid today Pay 27\/1 £26.2.0.\n\nfeel much better for the night’s rest \n\nletter from Viv last night sent Parcel to him. Letter from Nell & Jack Posted letters to Jack, Tony, Carol, Nell, Syd, Viv, Maude & Will Stewart\n\nMonday. 28\/5\/17\n\nA lovely morning, very little gun fire going on or they are too far away to hear them \n\n8th Brig. 30th Batt lost 11 men killed in Bapaume yesterday Fritz shelling from 18 miles away. \n\nforgot to mention that I am in charge of Police again from 16\/5\/17. C.O's orders this morning Got 3 men under me now. \n\nPaid 20 francs yesterday. Pay now owing to me is 13\/5 defd. 26.3.0.\n\nTuesday 29\/5\/17\/\n\nThunder storm last night cool & cloudy to day heavy gun fire all night. \n\nGoing out farther back in two days. Came out on orders last night \n\nam a Lance Corporal at last. Got the stripe up \n\nR.SM gone on Leave to Blighty.\n\nMust write Viv. \n\nPay 14\/5. def. 26.4.0.\n\ngot my other 2 men to day am now set, Livingstone in Blighty \n","62":" gone on leave to day. \n\nJust got new Tunic & colours also stripe. \"eh what.\"\n","63":" \n\nCool & cloudy but fine, \n\nJust heard that Viv has been boarded by the Drs & sent home to Ausy. hope its true & good luck to him. \n\nHear that Austria is seeking a separate Peace, hope so. \n\nFenton & Hankinson the new men began yesterday on duty.\n\nPay.","64":" £26.5.0. \n\nhad a bath & clean change yesterday & what a treat after the vermin & sweat covered shirts & how they did Pong. its a great life. \n\nA little rain this afternoon thundery weather. \n\nCant get a late Paper so don’t know how the war is going. \n\nGoing on a 90 mile march in a day or so to Alberville can see a lot not finishing.\n","65":"\n\nlovely morning cool & nice Breeze. \n\nA terrific Barrage put up last night all along the line & another this morning early must have been attack & counter. \n\nlots of Parties going away to school \n\nPay.","66":" def. £26.6.0.\n\nBeen a lovely day, no letters.\n","67":"\n\nA glorious morning, France at her best marred by the Presence of two Taubes cruising overhead. \n\nBoys just gone but some on fatigue & some to drill leaving here either tomorrow or Sunday. \n\nPay 17\/5 £26.7.0 \n","68":" \n\nanother fine morning warm means Hot day \n\nheavy gun fire on our left \n\nPay 18\/5. £26.8.0. \n\nBeen Raining this afternoon now cold enough for a fire \n\nBoxing on at 54th lines \n\ncricket & football here.\n","69":" \n\nA very cold night but a beautiful morning, church Parade, \n\nHeavy fighting all night \n\nrumours that Tommie’s took Quent. \n\nFritzs planes over head this morning. Shelling Bapaume \n\nPay 19\/5 £26.9.0. \n\nno word of leave yet & no letters. \n\nSeems rummy to be called Corp now. \n\nHad an exciting time exactly at ¼ to 10 PM.\n\nBugles sounded lights out when there was a rush in the air & Bang about 20 yds behind my Tent. One of fritzs Bombs from a Taube. Got 5 wounded one of them being one of my mates a Bugler there were 3 of us in the Tent at the time & what a scatter it was laughable to see them going for their lives away from the Tents however he only dropped one more & that about 400 yds away.\n\nHad it landed amongst the Tents a lot would have gone out as the charge seemed to open out on the ground like a fan & would have caught you even if you were lying down. \n\nThe Sergeants had a narrow escape 10 of them were standing up in their mess & the Tarpauline was riddled. A lot of Taubes were up & the guns were blazing at them. I hear they got one at Bapaume. \n","70":"\n\nThe night passed off quietly our Planes were up all night so fritz kept away expect he will visit us again to night. \n\nThis morning same as yesterday, lovely is no name for it, life is worth living in this weather. \n\nSent letter to Nell yesterday addressed it G.P.B. Sydney. \n\nPay 20\/5 £26.10.0 \n\nBeen very hot today 8. P.M. expect fritz will be over again tonight. \n\nBig route March tomorrow about 10 miles.\n","71":"\n\nKept very sultry till about 12 last night then got cool, glorious full moon, beautiful morning & going to be hot again\n\nRoute march at 9. till 1. \n\nFritz did not come over last night our Planes were waiting for him. \n\nMarched about 7 miles & as hot as Sydney in summer but it did us good \n\nThe Taubes were up again tonight but did not get this far. \n\nPay 21\/5 £26.11.0 \n","72":"\n\nfelt a bit stiff this morning, same kind of weather as yesterday, tried to rain early but cleared off. \n\nTerrific Bombardment going on last night & still going on; its on all along the line from Cambrai to Ypres. \n\nSaw that Brazil is now in it surely it can’t last much longer.\n\nWrote to Jack Tony & Carol this morning. \n\nGot new Pants & Boots half soled so am looking decent again.\n\nPay 22\/5 £26.12.0.\n\nThunderstorm to night so no Taubes.\n","73":"\n\nlovely Morning, did not rain much but cooled the air, going to be hot today.\n\n7 of our Blighters to be Court Martialed today, means 3 & 5 years for some of them The cat wouldn’t do two of them any harm, foul mouthed brutes. \n\nAm going to play cricket this afternoon will suffer for it tomorrow. \n\nPay. 23\/5 £26.13.0 \n\nsent letters to Mrs Parsons & Jack Tony & Carol. \n\nhave had one letter since coming out, that is one other letter – from Nell since May 1st. the last May 27th & yet they tell me they write once a week. \n\nHad a game of cricket this Afternoon 2nd for 15 yrs made Top score & got 5 wickets the old un isn’t a back no. yet\n\nNice & cool this evening. \n\nDiv. Concert on to night.\n","74":"\n\nRoute March again today 10 miles full Pack up, that’s it, come out for spell & get your inside walked off, ass is no name for it, \n\ngreat fighting going on big Push at Ypres. \n\nBeautiful morning got back about 12.15 started 8.15. done up. Heat awful also dust, nearly fell out. \n\nBeer in to day, some of the boys will be tight tonight. \n\nGot fearfully stiff must have been the cricket the day before. \n\nlooks like heavy rain, & the guns going it, big barrage about 5 P.M. \n\nNo word of leave yet. \n\nPay 24\/5 £26.14.0 \n","75":"\n\nThunderstorm last night & heavy rain for a while, but fine this morning & cooler though cloudy,\n\nGuns still flopping them in, Fritz must be enjoying himself. I don’t think. \n\nGreat victory up a Ypres12.000 Prisoners up to last night. expect of hear of something like that down here in todays Paper. \n\nGetting paid today. £26.15.0. 25\/5.\n\nNo leave for A Coy on Tuesday so am out of it again am afraid I shall never get to Blighty. \n\nfeel very stiff this morning but not so bad as last night. \n\nLetter from Maude also Paper yesterday wants loan of £10.0.0. \n\nConcert tonight.\n","76":"\n\nBig change fog, cold & like rain, got letter from Viv last night. \n\ngot new Hat & Boots set now.\n\nPay to day Pay. 26\/5 £26-16.0.\n\nleaving Tomorrow am told suppose its Ypres or thereabouts. \n\nPosted letters to Nell, Maude, Loo & Viv. \n\nPaid 14\/8 Bal. 11\/9 \n\ngot very Hot again, means more rain.\n","77":" \n\nHave seen some thunderstorms but last nights was the limit it was terrific started about 3 a.m. & is still going 8 a.m. the lightening was the worst I have seen & the thunder like a million batteries of 12\" going off at once seemed as if two storms had met as it came from 2 seporate directions. The dust of yesterday is somme mud again. \n\nNot leaving to day but Wednesday. \n\nPay. 12\/9. £26.17.0.\n","78":" 17\n\nA lovely morning, going to be hot, Cold night last night. Should have been on my leave to day. \n\nground dried up again Plenty of gun fire all day yesterday. Expect to go tomorrow\n\nPay 13\/9. £26.15.0. Wrote to Syd.\n","79":"\n\nRoute March, up at ¼ to 5 shave, BK, & off at 7.30. 10 miles, New Boots, home again at 11 blistered heels & half crippled. curse these Route marches. \n\nRumour that Ausy’s don’t go into Trenches any more & that Peace is very near. Next. \n\nPay. 14\/9. £26.19.0. \n\nBeen a lovely day not as hot as the other march, Cool tonight.\n","80":"\n\nCool morning but getting warm, off Tomorrow by Train, heel not so painful, & not stiff this time. \n\nPay. 15\/9. £27.0.0.\n\ngoing to Millincourt 9. a.m. Friday. \n\nBig battle last night heavy firing all along line from Arras to Peronne.\n","81":"\n\nGas alarm at 1 a.m. up at 5 off to Millincourt go to Bapaume then Train. about 20 miles then march about 6 miles back to billets again. \n\nHot this morning. \n\nPay 16\/9 £27.1.0. \n\nMarched through smashed up Bapaume. After being messed about for 1\/2 hour got into train & am still on it not moved off yet about 2 hours. \n\nTaube Bombed the line half an hour before we embarked still here 2.30 P.M. since 11 am off at last 5.30. 7 Bombs were dropped on line. \n\nout of train 6.15. marched 7 miles, feet blistered, Toes & heels skinned curse the marches. \n\nGot here Millincourt 9 P.M. done up.\n","82":"\n\nOn duty early, got another man 5 of us now so ought to be able to manage. \n\nPlenty of beer & wine here & drunks \n\nsaw the first women & kids yesterday for 6 months.\n\nThis village hardly knocked about at all though there are trenches all round it.\n\nGot the boys to bed all right not much trouble. \n\nPay","83":" £27.2.0. \n","84":"\n\nvery hot just like Sydney in Jany. Got the two extremes here. \n\nGot letter from Syd & Trustee Coy. also Parcel from Nell. Tasmania. \n","85":" Tuesday Wednesday. ","86":"\n\nNil\n","87":"\n\ncannot get leave yet so (umpty.)\n\nletter from Viv, Broke, so am I, can sympathise with him.\n\nPay 22\/9 £27.7.0.\n\nsweet place this no Money & no Pay for 9 days may as well have kept us in the line.\n","88":"\n\nNothing much doing Boys in C Coy going out to day for stunt, taking Village, Pictures I expect. \n\nPay 23\/9 £27.8.0\n","89":"\n\nsame every day. all chaps Broke, no money, no Booze, good behaviour.\n\nBat. gone out on stunt this morning \n\nmust write to Viv to day, also Nell & Boys.\n\nPay 24\/9 £27.9.0. \n\nBully Beef stew every day, can’t come at it at all.\n","90":"\n\nGlorious morning\n\n3rd Brigade went through on their way to the front again expect we go soon. \n\nnothing important, sent letters to Viv & Nell. \n\nPay 25\/9 £27.10.0.\n\nPost Cards to Jack Carol, Tony Nell. letter to Trustee Coy for £10-0-0 ought to get it end of August. \n\nbeen lovely day getting warm again. \n\nPay Tomorrow.\n","91":" \n\nWarm cloudy morning nice Breeze. My friend Murray the Pug has returned. \n\nWe are about 2 miles from Albert here & can see the Cathedral & hanging, statue quite plain. Also Posierers where the Ausys mad a name for themselves Met some of them yesterday & they told me all about it. \n\nPlenty of Villages all round here & untouched. The only shell that came into this one hit the house where our officers mess is. \n\nPay 26\/9 £27.11.0. \n\ngetting deadly monotonous, no money, can't but anything spent 70 francs on food since coming out & were wining.\n","92":"\n\nPay. 27\/9 £27.12.0.\n\nnothing else except a Robbery at a Pub\n","93":" \n\nPay. 28\/9. £27.13-0\n\non duty.last night till nearly 1. got to get the lights out did not get out this morning till 11. \n\nNothing doing can’t go into Amiens no money could have gone 2 or 3 times but –\n","94":"\n\nWrote to Mrs Parsons, Maude & Syd \n\nfine but stormy \n\ngot 4 new men on Police.\n\nPay 29\/9 £27.14.0.\n\nonly two men to go before me to blighty. \n\nheavy storm, lightening very vivid & close & very heavy rain \n\nPay Books collected Pay on Saturday.\n","95":"\n\nW. Holman due to day to review us \n\nbeautiful morning, fresh but cloudy \n\nPay.","96":" £27.15.0.\n\nJones went on leave yesterday. \n\nthis day 12 months arrived in France have seen some things since then.\n\nParty of Hun Prisoners just gone Past big men all of them but what dials they have hog all over it. road mending is their Job.\n","97":"\n\nThis day last year was in Railway carriage on our way up from Marsailles \n\nCold & miserable, scotch mist & windy \n\nPremier Holman reviewed Boys yesterday. Told them they would have to do Plenty of fighting yet. \n\nPay.","98":" £27.16.0\n\nPaid 22\/- 30 francs Bal 9\/9.\n\nSunday1\/7\/17\n\nStill cold & rain about. Rained hard yesterday & last night \n\nBoys off to Amiens on leave not taking any myself saving for Blighty. \n\nMore Petty theifts last night. A Coy lost 70 francs. \n\nPay. 10.9 £27.17.0.\n\nletter from Maude & Percy Peacy. \n","99":"\n\ngetting warm again, had to send 3 men back to Coys drunk. \n\nbig Battle at Leus, Can hear guns here 25 miles away\n\nexpect my leave next week. \nPerhaps\n\nPay. 11\/9 £27.18.0.\n","100":"\n\nHot & sultry more rain about, Boys Broke pretty quiet at night now. \n\nC. Coy lost competition, D Coy’s stunt Tomorrow \n\ngoing into line on Saturday might have known it as its my leave next week. \n\nPay. 12\/9. £27.19.0\n\nWednesday 4\/7\/17\/\n\nThunderstorm about 3 this morning Cool & like more rain. \n\nD. Coy 's stunt this Afternoon hope they win. \n\nPay. 13\/9. £28-0-0 \n\nwrote to Viv, Maude, & Nell Monday. \n\nD.Coy. won competition great excitement C. Coy 2nd. \n\nrain to night\n","101":"\n\nCool & fine & cloudy. \n\nMajor Woods went to Blighty last night. \n\nPay 14\/9. £28.1.0 \n","102":"\n\nlovely morning, nippy almost a frost last night.\n\noff this morning 7 miles to Mailley Maillet. Hut camp good bye estaminets.\n\nPay 15\/9 £28.2.0.\n\nleft Mellingcourt 10 to 11 stopped at Senlis 12 for cocoa & Biscuits hot marching but not too bad, Pack dam heavy. \n\nThrough Hedoncourt then on to Mailly Millet got here Mailly 1.30 P.M. \n\nBeautiful camp among the Trees & shrubs \n\nwent into the Town about 1 mile away, been a fine place but the huns as usual have knocked it about, but not as bad as some, \n\nThe Town Hall is intact, also church.\n","103":"\n\nBeautiful morning but cold last night \n\ncan hear the guns here, going night & day 20 miles from Arras. \n\nPay. 16\/9 £28.3.0 \n\nStrong wind blowing & getting cloudy expect it means rain \n\nleave here in a few days & off to 10 Kilos from Amiens.\n\nwish they would hurry that other stripe of mine along \n\nAmiens no good without money & mine all gone buying food, cigs, Battery etc \n\nPosted Post Cards to Nell, Tony, Jack & Carol.\n","104":"\n\nTerrible storm last night thunder & lightening awful never saw anything worse in Ausy. started 2. a.m. & to day another came on been so bad that for the","105":" time since I joined the army no Parade was blown \n\nwe are camped in a wood on a rise & the huts down the slope were swamped fortunately we are under a Tarpauline on the Hill & even so got wet through \n\nPay. 17\/9. £28.4.0. \n\nslept all the morning & nothing much else to do this Afternoon turned out fine about 4 PM. cool wind blowing \n\nD. Coy. going guard of Honour to the King.\n","106":"\n\nCold, windy & cloudy, like rain \n\nhaving great spell here \"Mailly Mailet\" nothing to do all day. \n\nWrote to Mrs Parsons, Loo, & Nell got letter from Viv. \n\nD. Coy. goes Tomorrow on Guard of Honour to the King. \n\nPay 18\/9 £28.5.0\n","107":"\n\nstill cold & windy, scotch mist last night \n\nBig guns booming all along the line must be big battle going on.\n\nPay","108":" £28.6.0.\n\nwrote to Percy Peacy. \n\nKing going to interview us shortly. Hoorah do do ditto \n\ncalled to orderly room about my leave expect to go next week.\n","109":"\n\nD,Coy gone as Body guard to King Brigade Band with them. \n\nLovely morning, fine & clear been very cold these last 3 days getting like winter again, \n\nTerrible air Raid on London on Saturday & Premier Holman nearly blown out the other day Major Gen Holmes who was with him killed \n","110":" go to Blighty Tomorrow \n\nPay.","111":" £28.7.0.\n\nBrigade out on stunt to day \n\nGot new shirt & chat shirt to day first for about 2 months. also Pr Braces first since leaving Ausy.\n","112":" 12\/7\/17\/\n\nAll the Boys gone to see the King the whole Division & others besides to be there I & Pat Shelly left behind on guard\n\nPay. 21\/9. £28.8.0.\n\nA Beautiful day Hot & sunny \n\nExpect to go to Blighty Tomorrow.\n","113":"\n\nBoys disgusted with long march to see the King so were not in too \ngood\n a humour when he arrived & the cheers \nnot\n what one would read in the Papers they were.\n\nAnother lovely day but it’s getting colder of a night & one Blanket is not enough.\n\nPay 22\/9. £28.9.0\n\nBrigade stunt tonight taking Beamont Hamel. \n\nall leave stopped till the 19th could have bet on it.\n\nSaturday 14\/7\/17\n\nBoys all home again at 9. a.m. BKs & hang-me if they are not out playing cricket now 10. a.m. been at it all night too, are there any other troops in the world like these lunatics. they live every minute of their time alright. All day yesterday it was cricket & cheeries, Rhaspberries, & Strawberries. \n\nBit of a thunder storm this morning early & like rain now. \n\nAccording to the Papers things are very umpty-do in Germany.\n\nPay 23\/9. £28.10.0.\n\nExpect to get leave \nnow\n on the 19th didn’t say a word yesterday when I heard leave was cut out, not \/arf.\n\nViv has not turned up yet, a lot of fellows came back from Blighty yesterday. \n\noff on Monday for Le Bomphrey 10 miles away then North I think & into it again\n\nRIP 3107 SGT J M Nelson 55th BT AIF died of wounds 20\/5.17\n\nSunday 15\/7\/17\n\nRained nearly all night fine now hot cloudy, \n\nPlayed in Cricket Match yesterday finish it today made 2. hit G.W.\n\nPay. 24\/7. £28.10. \n\nBCoy won Cricket Compt\n\noff to morrow\n\nMonday 16\/7\/17\n\nLovely morning up at 4.45 BKs. 5 moving off to Le Bompree at 7. 12 mile march have bound up my heels. \n\ngoing to be damned hot \n\ngot there about 12. \n\nPay 25\/7 £28.11.0. \n\nStopped for dinner 11.15. 6 Kilos from destination feet very tired, otherwisw fine, looks like rain. We will miss the cherries, Rhasberrys & Strawberries now\n\nTuesday 17\/7\/17\n\nRained last night, got Posy with Buglers noisy swines, feel nearly alright again feet got tired. \n\nPaid 20 francs 14\/8 last night Pay to date 26\/7. Bal. 11\/11 £28.12.0.\n\nmuch up with Anxac Police last night\n\nTuesday continued\n\ngot here yesterday Dubumpre at about 1.30 P.m. very tired & foot sore hard metal road all the way. \n\nWe are about 12 Kilos from Amiens & 6 from Corbie about 5 from Rainneville. Be here for about 7 days then North I think. \n\nOn duty all day till 11 P.M.\n","114":"\n\nUp at 1\/4 to 5 BKs 5.30. Boys off to Corbie Pontoon Bridge Building raining hard thank heaven am left at home, they will be back Friday. \n\nPlenty of drunks last night \n\nPay. 12\/11 £28.13.0. \n\nJack Thompson gone to Blighty I go next Batch. about Friday \n\nbeen raining & Scotch Mist all day very warm & muggy. \n\nTrying to clear up 9 P.M. \n","115":"\n\nAnniversary of Fromelles shall I ever forget it, I think not, & now we shall soon be off that way again \n\nThe Boys come home again to day. \n\nRained very heavy last night & men hanging around today. \n\nPay. 13\/11 £28.14.0. \n\ncan hear the guns in the distance. \n\nMight go to Blighty tomorrow. \n","116":"\n\nNothing much doing wrote to Viv & was sending Parcel but they wanted 1\/6 so no good Broke. \n\nHad to arrest 7 men last night got them all quiet except one. \n\nConcert to night.\n","117":"\n\nCool but fine, nights getting longer now & quite cool Blanket & Coat do not keep one warm dread this coming winter. Promises to be worse than last. \n\nBig Bombardment last night, Kit inspection yesterday. \n\noff soon now. \n\nMorgan struck an officer last of him for some time. Rip Rip \n\nSunday 22\/7\/17\n\nA most beautiful morning like our spring lovely & cool inside but the sun hot one of the best days I have seen in france. \n\nSpoke to Capt. Cotteril about my leave yesterday says I'll get it soon now. \n\nletter from Viv & Maude. Wrote Viv yesterday \n\nPay 16\/11 £28.17.0.\n\nevery thing quiet all the money gone. our crowd should be Paid 5 francs at a time.\n\nMonday 23\/7\/17\/\n\nAnother lovely morning like yesterday. \n\nThe guns are booming away must be a big engagement going on near Bullicourt. \n\nPay.","118":" £28.18.0.\n\nCoy drill to day. \n\nGeneral Birdwood gave out the Medals to our chaps yesterday. did not go to see it \n\nHad my paper fixed up for Blighty to day going on the 25th or 26th \n\nwrote to Viv & Maude. \n\nBig dinner on with Officers to night Brigadier & Staff Present. Unfurling the flag Fromelles & Doignes on it soon be another name to add to it. Thank heaven I am getting out of that 10 day’s march couldn’t have done it. \n\nWe have Cinema shows & the Brigade Band also concerts but we see little of it all. always on duty.\n\nTuesday 24\/7\/17\/\n\nAnother Officers dinner & Band tonight with Pictures after \n\nGot my Papers for Blighty today also new first since I left Ausy. \n\nPay 15\/1 £28-19-0.\n\ngoing tomorrow afternoon \n\nwrote to Nell Jack Tony & Carol. \n\nGot to collect £3 for one of our Boys from the Comw Bank in London. \n","119":"\n\noff to day to Blighty going for Bath & clean clothes at 9. fall in at 3.30.full marching \n\norders for a little walk of two or 3 miles to the Railway then only carry it from Train to Boat & Boat to Train. Warm & cloudy like rain am not excited about it. \n\nPay 19\/1. £29.0.0 \n\ngot to Puchevillers at 5.15 Train at off to Boulogne. Rosille, Doulens large Train going half round france to get to Boulogne . \n\nFlesdin H.Q, Gen.Haigh \n\nEtaples, Camiers, Boulogne. \n\nat 7 a.m. herded like Poultry in a big shed have to wait till Mid-day, Big fog. \n\nThursday26\/7\/17 \n\nPay","120":" £29.1.0.\n\narrived London about 7. PM. after one of the worst of spells at Boulogne shut up a 1000 of us like criminals. \n\nEngland is not to be compared with France its France only cleaner & more beautiful & buildings not mud huts enjoyed the trip up splendid but very sleepy messed about at Horseferry Rd for hours then did not get my Pay get it tomorrow.\n","121":"\n\nUp to my eyes in seeing London & carrying out requests of friends no more requests thank you \n","122":" not know whether to go to Scotland or not \n\ngoing to see Viv tomorrow at Perham Downs. Am staying at War Chest Buildings but shifting tonight to 91 Belgrave St \"Tony eh!\"","123":" per week Bed. \n\nGoing Picture Show tonight & out Boating Tomorrow night.\n","124":"\n\nUp at 7. BK at ¼ to 8 off to Waterloo Station to catch 8.50 Train to Ludgershall Salisbury. \n\nFound Viv after a lot of trouble & had good old chin wag for 4 hours. had dinner with him \n\nBack to London 4.17 train then Theatre Lyceum \"7 Days Leave\" good Play cost me just 3\/- not bad considering, in one Tube & out & into another revolving staircases talk about excitement this old London will do me \n\nThey are all Girls here even the grey haired women wear short skirts & top Boots & the flapper, oh, well enough said. Wouldnt have missed this Place for anything\n","125":"\n\nPut in a quiet day did not get up till about 10. went to Hyde Park in the Afternoon but did not stay long, rained about 6 PM & continued all night so did not go anywhere went to Bed about 9.30 tired out. \n\nWrote to Newton.\n","126":"\n\nnothing doing expect a reply from Newton making appointment \n\nPubs open at 12 close at 2.30 open again at 6 & close at 9 PM Sundays 1. to 3. & 6 to 9. \n\nAm putting some guinesses stout under my waistcoat as everyone tells me I am Horrably thin. Am feeling well though. \n\nSent post cards \n\nto Nell, Jack, Carol, Tony, Syd. Arthur, Jean. \n\nRaining again makes it miserable went this afternoon 3\/- Trip on drag Westminister Abbey a Marvellous Place. Buckingham Palace mostly seeing Horses stables & the state coach weighs 4 ½ tons & a marvellous carriage, each horses harness costs anything between 100 & £200. No wonder there's taxes etc. \n\nThe Kings state carriage is simply all gilt & is magnifiacent & his Horses are just \nit\n. \n\nGoing to Theatre tonight \n\nrang up Newton go to see him tomorrow at 11 am 60 Belsize Park. (Bus 24.)\n","127":" \n\nwent out to see Newton at Belsize Park he was not there saw Mrs Moore had a chat & came into the strand & made appointment for 3 P.M. Am now here Just saw him & he recognised me straight away. \n\nRaining like hell Glorious country this Oh that I was back in Sydney \n\nwent out by Taxi cost me 4\/6 same back by bus 3d The curse of it all is you don’t know what bus to take & where it is going to when you do take it. \n\nSaw Newton he called for me for £10. ought to be here in a day or so wrote to Maude & Viv. \n\nRumest thing I have struck is the women drinking in the Pubs there are more women than men at it & its quite the custom no one minds it. \n\nbut to us its dam funny \n\ndon’t know what to do tonight raining & miserable will go to bed I think.\n\n7 P.M. Great battle going on glad I am out of it so far.\n","128":" \n\nStill raining curse it nice holiday got no coat so get wet every day. & have bonzer cold. \n\nTake good care of these Books for me & I hope they will give you some sort of entertainment. I generally put down in it what is happening & how it strikes me. Bert \n\nLove to all.\n\n"}}