{"Document Name":{"0":"Diary_0294","1":"Diary_0294","2":"Diary_0294","3":"Diary_0294","4":"Diary_0294","5":"Diary_0294","6":"Diary_0294","7":"Diary_0294","8":"Diary_0294","9":"Diary_0294","10":"Diary_0294","11":"Diary_0294","12":"Diary_0294","13":"Diary_0294","14":"Diary_0294","15":"Diary_0294","16":"Diary_0294","17":"Diary_0294","18":"Diary_0294","19":"Diary_0294","20":"Diary_0294","21":"Diary_0294","22":"Diary_0294","23":"Diary_0294","24":"Diary_0294","25":"Diary_0294","26":"Diary_0294","27":"Diary_0294","28":"Diary_0294","29":"Diary_0294","30":"Diary_0294","31":"Diary_0294","32":"Diary_0294","33":"Diary_0294","34":"Diary_0294","35":"Diary_0294","36":"Diary_0294","37":"Diary_0294","38":"Diary_0294","39":"Diary_0294","40":"Diary_0294","41":"Diary_0294","42":"Diary_0294","43":"Diary_0294","44":"Diary_0294","45":"Diary_0294","46":"Diary_0294","47":"Diary_0294","48":"Diary_0294","49":"Diary_0294","50":"Diary_0294","51":"Diary_0294","52":"Diary_0294","53":"Diary_0294","54":"Diary_0294","55":"Diary_0294","56":"Diary_0294","57":"Diary_0294","58":"Diary_0294","59":"Diary_0294","60":"Diary_0294"},"Date":{"0":"unknown","1":1095.0,"2":1096.0,"3":1097.0,"4":1098.0,"5":1099.0,"6":1100.0,"7":1101.0,"8":1102.0,"9":1103.0,"10":1104.0,"11":1105.0,"12":1106.0,"13":1107.0,"14":1108.0,"15":1109.0,"16":1110.0,"17":1111.0,"18":1112.0,"19":1113.0,"20":1114.0,"21":1115.0,"22":1116.0,"23":1117.0,"24":1118.0,"25":1119.0,"26":1120.0,"27":1121.0,"28":1122.0,"29":1123.0,"30":1124.0,"31":1125.0,"32":1126.0,"33":1127.0,"34":1128.0,"35":1129.0,"36":1130.0,"37":1131.0,"38":1132.0,"39":1133.0,"40":1134.0,"41":1136.0,"42":1137.0,"43":1138.0,"44":1139.0,"45":1140.0,"46":1141.0,"47":1142.0,"48":1143.0,"49":1144.0,"50":1145.0,"51":1146.0,"52":1147.0,"53":1148.0,"54":1149.0,"55":1150.0,"56":1151.0,"57":1152.0,"58":1153.0,"59":1154.0,"60":1155.0},"Entry":{"0":"\n\nAmid new surroundings it is ever pleasing to feel that we take with us to all places much that is not altered by environment; the wind itself with all its memories, and - as we suggested the other day in a Café, - the stomach with its likes & dislikes, are in Africa just what they were in Australia. And this morning brings with it that same feeling of sacredness, of quietness of soul, and of confident peace \nth\n as have been enjoyed in times past. It is Sunday, and the occasional intimation from shore of the bells ringing is quite sufficient to recall a whole mass of recollections. As we wait on deck for what the day will bring forth, our thoughts grow calm & reflective, and we feel happy, intensely to think of the heritage that is \nhours\n ours.\n\nWe are fair dinkum soldiers now, strong and bright & full of hope and eager for service and so whatever the Vol I may be, this Vol II is the diary of real soldier’s life; a life set on one purpose, and that to resist the king’s enemies at all cost. May it be used to good purpose.\n\n","1":" (contd.)\n\nAfter Arriving at Cape Town, we stayed on board for a few hours, and were then granted leave from 2 – 11 and had a fine time ashore. Alan & I went for a long walk right through the city and beyond it into the oak groves beyond the houses and well up to the foot of Table Mountain. We then returned through the lower quarters of the city and there we walked through the middle of the dirty narrow streets and all the blacks, half-castes etc. sang out to us, and the little piccaninnies flocked round for our smiles & pennies and screeched out ‘Australia’ etc. etc. all of which gave us great enjoyment.\n\nAfter a snack for tea we took a 6d. tram & went about ¾ hours’ ride round the suburban quarters. On the tram an elderly lady presented us with a newspaper & a bag of biscuits; we ate the latter almost before we got back to the ship. The people are very kind here as elsewhere, and the silver-leaves which I sent home were given me by a little English boy who stood down at the P.O. for that specific purpose. Cape Town is noted for this kind of leaf.\n\nOn the return trip by tram Alan & I had a pineapple each, which we cut in slices & peeled & \nthrough\n devoured with much gusto. Such behaviour would no doubt be considered a breach of etiquette but we enjoyed ourselves, or rather the pineapples, and that was all we cared about at the time. We arrived back in Town at 10.15 and then marched back about 1 ½ miles to our ship. These marches are grand. We sing & whistle till our throats are dry & hoarse and as a rule get back in a perfect bath of perspiration but as lively as crickets. After a show & a yarn we turned in at about 12.30.\n","2":" It was my turn to do guard duty to-day. This job commences at 9 AM and lasts for 24 hours, during which time we are on post for 2 hours & off for 4 hours but must not take off clothes or equipment nor leave our section of the ship; such at least is required by regulation. However, by various means unnecessary to detail I spent most of my time far from my post. Five of us, including Barry went out together to Camp’s Bay, about 5 miles out & had a fine swim in the free warm bathes, and then\n\nresorted to a rustic padoga where we were served \ngratis\n with tea and cake. (I had 4 cups of tea). Billiards for 2 hours followed & then at 8 we returned to town for tea & finished the day in the city. (Tea consisted of coffee, soup & steak & kidney pie!)\n","3":" A ship load of ‘returned’ African soldiers came to Cape Town this morning. They came from German East Africa were they have succeeded in driving back the enemy but at a great cost, for something like 90% of them have contracted the Malaria Fever, and the poor lads may be seen by thousands both in Durban & in Cape Town. Our men formed a guard of honour for these men as they again set foot on their ‘patria’, but I missed this as I was on duty on board. My duty was ‘deck-guard’. This is also for 24 hours in shifts and is an important duty & must be carried out to the letter. I enjoyed it very much, especially on the 5-7 AM shift. The night had been glorious but pitch-dark, and the mountain stood out in its super blackness against the cloudy sky, and its majesty thrilled me through & through. The silence of the city\n\nDr. McClure, Upper Orange St Cape Town.\n\nbeneath its sheltering height also appealed to \nones\n one who \nhe\n remembered Wordsworth’s poem on ‘Westminster Bridge’. However, despite all the restrictions, we got ashore for a couple of hours and had some eggs & bacon and returned at 11 P.M. just in time to go on duty again.\n","4":" After our Guard-day we were given extra leave which lasted from 10 A.M. to 11 P.M. and during this time we visited the city Corporation baths, which are right near the centre of the City and are supplied with good fresh water. They are open to Soldiers, gratis. During the remaining hours I must have walked many miles, through the gardens etc. etc. As Alan was on the Town Picquet I had to go about alone & so took the opportunity of visiting the local Presbyterian Parson, whose address I obtained from the Y.M.C.A. Dr McClure is a grand old man with three sons in France. I had had my lunch but he invited me to have some more, which I did, and after that we had a yarn till about 3 o’clock. According to previous arrangement,\n","5":" Wet in morng can’t go ashore for drill\n\nShort march for 2 hours in afternoon\n\nVisit Mrs. Ross’s place in or \n\n19 Tues. drill in morg 1 ½ h\n\nSeapoint bath in after 3 m\n\nPier & girls in Ev \n\n home)\n\n20 Wed. Picquet No 6 Dist.\n\nPeople getting - more enthused\n\nNo money & no pay, but \n\nRag-time Picq G.B.\n\nI then proceeded to Camp’s Bay & had a free tea with Barney & returned to town in the evening and after wandering around for a little while returned to the ship & turned in at 1 o’clock. After these long days in the hot sun we feel so fit that we sit up in our ‘posie’ for hours yarning; hence the late hours!\n\nDec. 15. Up at 6 A.M. Medical Parade for measles was at 6.15, per usual. We again paraded at 8 in dungarees for a route march. We had been supplied with cheese & bread, early in the morning & made sandwiches for our lunch. You should have seen the sandwiches!! most of them consisted of a loaf split down the middle & stuffed with butter & cheese. With this in our havasack & water in our bottles we set out. They day was extremely clear, but terribly hot & although we did not go far for a start the sweat poured out of us. It was dripping off the peak of my hat like a young tap. We lunched on a vacant paddock & had fine fun altogether. The people all along the \n\nway came out to cheer us & we sang back at them. We also amused ourselves on the march by whistling & singing and making every conceivable kind of noise. Return by 4.30. We then had a shower, & tea and went on leave at 6.\n\nAlan & I visited the electrical power-house & got the foreman to show us all around the plant, which was in many ways very up-to-date. Among others, there was a turbine power plant which generated an enormous quantity of current for its size & registered 3000 revolutions per minute.\n","6":" To-day is a very important public festival & holiday here. We had a ‘picnic’ to Camp’s Bay. We got our lunch ready from bread cheese & biscuits & marched out to the place in about 2 ½ hours. The day was very hot, in fact a gentleman was telling me in town that it was the hottest day they have had here for 3 years, & Cape Town is by no means a cool place at ordinary times. In a perfect bath of sweat we got there by\n\nmid-day. Although the boys were tired & seemed ‘dead-beat’ their spirit showed itself when the local band struck up. They were immediately on their feet trying the goose-step etc. & we were quite normal again after dinner. The Y.M. ladies supplied us with a cup of tea & cake, which were very acceptable additions to our own lunches.\n\nAs Alan & I wanted to go out in the afternoon we ‘scaled’ back by tram immediately after lunch. We then had a fine swim in the fresh water bathes and later visited the gardens. Two nurses \nbec\n whom we saw there beckoned to us and gave us some tea from a thermos flask and some cake, sandwiches & fruit. We went down the pier in the evening. This pier is an enormous one several hundreds of yards long and at the outward end it has a large, two-storey, open-air concert hall & refreshment room and all the K’nuts congregate here.\n\nDec. 17. Sunday. We remained on board in the morning and went on Town Picquet from 1-7 in the afternoon. I was stationed on a cross street which\n\nleads into one of the forbidden areas & had to stop all soldiers who attempted to pass. We had an easy and pleasant time, especially with the little dark children who came round to talk to us, I had three of them with me all the time and they proved themselves real little \"birds\". The eldest was 13 and his signature is on the next page. He works in a wine factory & goes to night school and is remarkably smart & cute. Like lots of others he speaks English & Dutch well & has a fair idea of the Kaffir tongue. In fact he started teaching me the Dutch. During the afternoon I had a couple of dozen cheap fruit & some toffee & we four sat along the footpath & had a fine little party all to ourselves, much to the amusement of passers-by & much to the gratification of the natives. While there I also saw great numbers of Malays; the Malay ladies wear coverings over all the face except the eyes but are pretty and also dress beautifully & seem quite superior to the native blacks.\n\nPicquet was over & I got to Pres. Church\n\nNanie Palmer (Cape Town).\n\nMrs. Ross. & Fam.\n\nMiss Bailey (Gladys).\n","7":" Jagersfontein Avenue\n\nGardens\n\nCape Town S.A.\n\nby 7.30 after a solid miles’ walk uphill. It would be impossible to describe one’s feelings as the grand organ led us in the hymns etc. etc. etc. and especially when the Minister passed a fine eulogy on the work of the Australian & N.Z. forces did one feel that life had \ntoo many\n good things for us.\n\nAfter church I went home with some very nice, middle class people who gave me a nice supper & invited ‘self & friend’ for Xmas dinner if we could get off. Of course this was not refused. Since then we have received another invitation to a place for Xmas day and also to Musenburg, the \"Manly\" of S.A. for all day Boxing Day. So far so good; it still remains to be seen how much leave we can get, or take.\n","8":" Wet this morning and so we can’t go ashore & have just to waste the time on deck as best we can. However, the weather was better after dinner & we went for a short route march for a couple of hours round the city. In the evening we visited Mrs. Ross, whose daughter has invited us\n","9":"\n\nDrill at Green Point morn & afternoon.\n\n evening\n\n22 Fri Pay of 10\/-\n\non board all day \n\nEv walk with Gladys egg cracked\n\n23 Sat. gun deck guard\n\nPrisoner etc.\n\nPolice & fallout, guard,\n\nBalmoral Castle\n\nOfficers Songs etc.\n\nSupper!!\n\n24 Sun Gladys & 2-6\n\nPicquet 7-10\n\n25 Mon. Xmas day\n\n3 eggs & bacon\n\n50 cigarettes\n\n Dec 22\n\n 10.30\n\n \n\ndep 11\n\nBattle 11.30-1\n\n \n\nfor Xmas. We had a bright time; how could we do otherwise when there were 4 fine girls and only Alan & I there. Alan & one of the girls played the piano, & they sang till we were sick of it; and then \nsupper\n, which went down well. We were going to kiss the girls good-bye but mother came in just too soon & the fun had to be postponed. During the evening the daughter was showing us two little ebony elephants & I put one in my pocket & as she did not seem to object much, I kept it as a souvenir. Alan also got one.\n\nDec 19. Usual drill ashore in morning. In afternoon we marched 3 miles to Sea Point Bath and all had a swim & returned by 6 P.M. In evening we took our friends to the entertainment on the Pier, which was necessarily very enjoyable. We then took them home & had a 3 miles walk back to the ship again, which we reached at 11.30, half an hour over-time, but the guard let us past alright.\n","10":" From 9-1 we were on Town Picquet again & had the time of our lives. As the main troops were not ashore the hotels were all open & the picquet\n\nspent most of their time in the ‘Pubs’ and when the officer came to look for his men to return to the boat he couldn’t find half of them. About three were quite drunk & couldn’t walk straight & many of them were fairly full. Alan & I also enjoyed ourselves. There was a church just near our post & we asked the caretaker for permission to play the organ, & he let us in and we had a great old play. Just before leaving a nice girl from a house just opposite our post, to whom we had been smiling, asked us if we would have a cup of tea; & we \ndidn’t\n say no! She brought two chairs out on the verandah, but just before she could get the tea ready the officer came round & we had to get back home without it. Just our luck again!\n\nThe picquet was reported for its drunkenness & was punished by being stopped from leave that evening. Of course the innocent suffered with the guilty but the punishment was so slight that we didn’t mind, although some of the boys squeaked some. A number of them went ashore despite the detention\n\nand had the luck to be caught & 12 of them have been stopped from all leave for 14 days and during that time will be allotted extra duties such as scrubbing decks etc. So their little bit of fun cost them rather dear.\n\nWe are very short of cash, as we have not been paid for quite a while & even then only at the rate of 1\/- per diem but by living economically & getting as many free teas & suppers as possible we manage well enough. The night we went to the pier it cost 3d for my friend & I got in free but only had 2d left so she had to pay for herself but she did not seem to mind & I was satisfied at having saved so much (I don’t think).\n","11":" Drill at Green Point both morning & afternoon and a visit to our friends in the evening.\n","12":" A Pay of 10\/- this morning was very acceptible, for we were literally on our last shilling. Washing-day was in the afternoon & we went ashore in the evening and as we heard that the boat was to leave on Sunday that we would not get any more leave I went to say \n\ngood-bye to Miss Bailey, & a very pathetic one it was (!!) The report turned out to be untrue and we did not sail as expected.\n\nSome to the boys abroad are used to foul-house talk & a \nfavourite expres\n favourite expression of theirs when they hear any unexpected burst of noise is \"another egg cracked\".\n","13":" Our Battn. had its turn as ship-guard to-day, and so Alan & I were on duty for 24 hours & could not leave the ship during that time. Alan was guard on the guard-room & cells. We had 9 prisoners but they were behaving fairly well & were given a fair amount of freedom. Battle, above-mentioned, was in the guard room & organised a ‘band’ among the prisoners much to the amusement of all. My post was at the officer’s mess & was very quiet especially during the night shifts. However I had one change to the monotony, for at about 4 o’clock in the afternoon the ‘Fall out, guard’ was passed along & I just arrived at the scene of action in time to see one of our men, half-drunk, fighting with a Cape Policeman & another chap & I had to get this chap to the cells, and he didn’t want to \n\ncome. For a few minutes we had rather an excited time but succeeded in doing our job.\n\nA fine English ‘Castle’ liner was tied to the opposite side of our wharf to-day & Alan & I scaled off for an hour to have a look over her. We went right through her from stem to stern, & poked our heads through every door & window we saw and came off perfectly amazed at the grandeur of her fittings. She was a little larger than the P. & O. boats & seemed more like a huge city hotel than a floating piece of steel.\n\nDuring my 9-11 shift on guard the officers had a little sing-song among themselves. One of them can play beautifully and others can sing and for the two hours I simply revelled in the music, which was high-class & good. The officer’s steward got me a nice supper for 1\/- at 10.30, and, needless to say, it went down without touching the sides.\n","14":" \nXmas eve.\n Leave from 2-6 and Picquet in Town from 7-11; so, since Ship-guard lasted till 10 o’clock we found it hard to imagine that Xmas was no near. I didn’t hang up my stocking this time\n\nin case somebody might steal it, but daddy Christmas was kind all the same.\n","15":"\n Of all the Christmas days I have yet spent this has been the most novel, the most full of deep experience, and by no means the least happy. It lasted for about 19 ½ hours, during which time not a moment was wasted. Far from home & love ones we found much to make up for our loss, although many of the real, true characteristics of this Season were necessarily lacking. However the day was so full of action & feeling that we forget what we were losing by being absent from our home-circle for Xmas for the first time.\n\nEven the military authorities, with their unfeeling discipline, paid heed to the nature of the Season and gave us for breakfast 2 boiled eggs & a slice of bacon each. Some of the boys were away so I had 3 eggs, and very nice too!!! Then we paraded in single file & had a tin of 50 cigarettes given to each of us, at the expense of our Comforts Fund. As I have given up the smoking, Alan\n\ngot 100 cigarettes and so he ought to be satisfied for some time to come. Alan & I being orderlies this week, we had to wash up etc. & we then got ashore, all spick & span and proceeded to see our Cape Town friends. They did not seem to have expected us for dinner so we sloped off at 1 o’clock & went to look for one. As we had not been to see the young ladies who had previously invited us for Xmas dinner, for a week, we didn’t have the hide to turn up. Fancy looking for a Xmas dinner!! But, never mind, we \nfound\n one, and a jolly good one too! As funds were rather low, we did not go down the main street looking for flash cafes, but tried some of the quieter side-streets and after a fair walk came upon a small tea-room which seemed nice & quiet & looked as though it would be cheap. However, still being dubious, we tossed up as to whether we should go in or not, and the toss decided in the affirmative, so in we went. There were several soldiers & a few married women in there sitting round a table & we cooly took off our hats & hung them & our walking-sticks up & after a little whispering etc. were shown to a seat. It was only\n\nPlayfulness of \n\nBarney’s smile\n","16":"\n\nInto bay at 6 A.M. \n\nOther Austn boats come defaulters etc Our mess, boats etc.\n","17":" other boats into bay \n\nsail 4.30 P.M. \n\n\"Glasgow\" ship etc.\n\nThurs 28 vessel passed \n\nmove at home\n\nEnglish & eh!\n\n29 Fri feeling xtra well and vigorous \n\n housewife \n\n‘Possums’\n\nsome time later that we tumbled to the fact that we were not in a Café at all, but were in a private Xmas gathering. This did not lessen our enjoyment of the meal in the slightest; indeed the quaintness of the situation rather heightened the pleasure. First we had a big plate of roast-turkey & about 4 kinds of vegetables & seasoning etc, some excellent plum pudding followed, and then a desert plate full of fruit salad!! & lemonade etc. to taste. After a little talk for the sake of etiquette we said good-bye & returned to the place whence we came and had tea there & spent the evening in the seventh heaven. I left Alan there & took my friend home, leaving her at 11 P.M. and promising to return for tea next evening. Alas! \"next evening\" never came. I had about 3 miles to go for the ship & so took a tram part of the way. While strolling along the docks a whistle was sounded & I was beckoned over by one of our sergeants. He had ‘spotted’ our friend ‘Battle’ ashore and drunk and was forming a little impromptu picquet to bring the man back to his Battalion. About eight of\n\nus set out but Battle was not to be caught & had 4 lemonade bottles with him & threatened to use these if anyone came near him. There followed 1 ½ hours of chasing & throwing stones battles etc. along the dark alleys of Cape Town and it was only after three of the men had been hurt, and Battle’s arm was tied behind his back, that we were able to lead him back. Of all the brutes I have ever seen or heard of, he was the worst. He took every mean advantage he could to get a kick at one of the escort & in the end the boys were so disgusted that for two straws they would have flung him into the docks. They tied his legs together to carry him aboard & it was 1 oclock when I turned in, utterly astounded by the demonstration which had taken place. Alan was sound asleep in his hammock \nand\n when I went downstairs, and said something in his sleep when I bumped past him, and so with mixed feelings of joy & sorrow I closed my Christmas day by drinking deep of that sweet sleep, which He giveth to His beloved.\n\nDec. 26 Boxing Day.\n. Despite all our arrangements for spending this day ashore we were awakened at 6 A.M. by the harsh sound of \nworkin\n winches at work & in half an hour’s time we were anchored out in the bay, half a mile from shore. The two N.Z. troopships followed us into the bay and later four Australian ones came round from Durban. All day we lay there, and the boys had to enjoy themselves as best they could, watching the stragglers being brought aboard by the picquet and shouting to the people who flocked round in row-boats & launches. One of the men from our mess table will be left in the Cape Town hospital together with about 15 others from our Battn.; so already our numbers are being thinned. Pte. Cryer (from across our back lane) has now been transferred to our mess in place of the one ashore.\n\nDec. 27 The remaining Australian & N.Z. transports put out into the bay to-day, and at 4.30 P.M. we all weighed anchor and accompanied by the \n\ncruiser \"Glasgow\" set out to sea in face of a terrific head-wind. There are eight of us altogether, including the \"Glasgow and so we are very much more at home now than before. The \"Suevic\" is flagship & steams at the head of the little fleet as proud as can be. The boys say that she is put in front because she is so slow & the other boats are frightened of losing her if she took her place behind.\n","18":" This afternoon a small cargo boat passed us and a little excitement was evidenced among the boys when our escort steamed ahead & crossed in front of us and followed the stranger \nfor a\n until she was past our line. The cruiser passed quite close to our bows & we could see the sailors aboard her as well as her shining guns & equipment & felt a slight feeling of awe, and proud admiration at this small atom out of England’s mighty fleet.\n","19":" Feeling extra well and vigorous today.\n\nSince Alan & I spend so much time on the ceiling the boys have taken to calling us the \"possums\". But this is a detail compared with the fact that some of my friends here have learned from Barney to call me \"jock\" and this little familiarity helps much to make one feel at home. Little things count most at all times.\n\nThe latest commandment we have here is \"Thou shalt not covet thy neighbours’ ‘housewife!\". \n","20":" One of the N.Z. boats gained some distance on us this afternoon and came alongside and for quite a time the boys tried to roar their throats hoarse cheering to the N.Z. boys. In the afternoon we had a bath parade and amused ourselves a little by dragging to the water one of the lads who didn’t want to go. The boys picked him up bodily & carried him up the two flights of steps. Eventually he went in ‘voluntarily’ and carried out his ablutions. A few such dirty chaps would keep a whole Battalion filthy but the boys are \n\n.\n\nSat 30 \n\nN.Z. Boat alongside\n\nBath Parade, Gooker & White\n\nSun 31\n\nBurial of savages.\n\nLifebelt in stokehold\n\ndetermined not to permit them to ‘scale’ bath parades at least.\n","21":" Sunday, last day in Old Year.\n.\n\nThe sausages for breakfast were undercooked this morning, so, after making a great fuss about it the boys had a burial service & consigned the remains of the sausages to the waves. After forming a procession, which marched to the droll of the ‘Dead March in Saul’ the ceremony was read by L. de Winter-Jones before-mentioned (Vol. I).\n\n\"Ashes to ashes,\n\nDust to dust,\n\nSince the \nboys\n won’t eat you\n\nThe \nfishes\n must.\" And no doubt the sharks did feast on what we refused.\n\nOne of the boys who offered to help in the stokehold was persuaded to wear a life-belt down there. I believe he was seen shovelling vigorously all the shift with nothing but this old heavy life-belt tied around under his arms, much to the\n\n \n\nJones \n\nAnchor\n\namusement of the crew.\n\nThe \"lights out\" bugle call tonight was the signal for a series of bombardments of hammocks and sleeping soldiers. Of course it is very easy to tumble out of a hammock, especially when you are assisted by a \ngentle\n push from below, and many of the boys had prepared for such emergencies by supplying themselves with batons and perhaps for this reason other means of amusement were soon sought. A great number of men now sleep on the troop-deck & upper deck floors in preference to swinging in a hammock and these next attracted attention. De-Winton-Jones is always looked upon as a good hit for any joke, being regarded as somewhat simple in some ways. He spreads his hammock on the floor & sleeps in it there. So, when he seemed quiet, a chap crept up to his feet & tied a rope about 16 feet long onto the corner of his hammock & three of them took the rope & began to clear across deck with it.\n\nTo their dismay De-Winter sat up quite unpurturbed; he knew more than they & had tied the other end of his hammock to the leg of the deck table & of course the boys couldn’t shift him, no matter how much they pulled.\n\nA little more daring experiment was tried on a chap who was swinging from the ceiling. A rope was tied to a corner of the blanket with he had under him. The rope was a long one & stretched down under a couple of mess tables, \nand\n so the fellows could start pulling at it without being seen. Luckily for the sleeper the rope slipped off before much of the blanket had come out. Needless to say, these onslaughts always call forth a stream of flowery language calculated to terrify all comers, but, somehow no-one seems to take any notice of it.\n\nAnother attack of a similar kind was cleverly frustrated by a cute joker. A number of boys took a rope up on the forecastle and detailed one \n\nof their number to go forward & fix it onto a hammock. However, instead of tying it to the hammock the fellow slyly hooked it onto a corner of the spare anchor; and the boys wondered why they couldn’t pull the sleeper out!!! ha! ha! ha! buzze –z-z-z-z-z-z……………\n\nThe next item to the program was a bombardment of our quarters from above. Dixies were hurled down the stairs one at a time to begin with; then whole bundles of them were tossed down. Those that were left were tied together in a big bundle & slung up to a spar on deck. A little later the various articles of the cooks’ equipment, such as casks, potato cases, coffee boilers as big as wash-tubs, etc. etc. were hurled down the stairs, and of course they didn’t make any noise at all!! – I don’t think.- During this time we were in almost total darkness, \nand the\n black as Egypt’s night and this added to the chaos which held sway in the nether regions of our hold. \n\nBy 11.30 we were all quite tired out and ventured to turn into our hammocks and were sound asleep before midnight.\n\nNeedless to say, the noise and bustle did not appeal to Alan and me as at all appropriate to the occasion. \nThe seeing of the Old Year out\n Saying \"good bye, for ever\", to the Old Year was to me a pathetic matter. Each year in my life has been more precious than the preceding one and 1916 had brought with it some of the sweetest, many of the grandest experiences of my life. In looking back over the days & weeks & months, it is indeed very difficult to point to any particular events which might be classed as characteristic of what I mean. In a general, inarticulate way, the world & all that surrounds it have been growing dearer to my inward being. Friendships above all else have made life one continuous series of happy experiences. It were impossible, by the very circumstances of the case, to enter into details here, for the most sacred of ones memories & thoughts must remain forever unspoken; they \n\nUni \n\nFell shp\n\nbecome tarnished upon outside contact. But, in a general way this passing year has brought me into contact with so many grand people, that, as a direct consequence a new untold wealth of pleasure has been added to my lot. For some reason or other I feel that I have \nunderstood\n, in a small way at least, something of their thoughts, aspirations etc. etc. and such an understanding is tinged with intense gratification & satisfaction. In business life, my fellow-officers were & still are more than mere business associates; they are true, helping friends & I cannot look back at my days in the Office without \na lov\n feeling a tingle of bitterness & regret at having to separate myself for so long from those there. Likewise with University and Fellowship & Lay Preaching associations, and with those whom I have met in a general way during 1916. Is it any wonder I cannot let the year slip back into nothingness without a farewell word!\n\nAnd so I left the troop-deck for a few minutes\n","22":"\n\nNo drill\n\nboxing\n\nplum pudding\n\nreading\n\nwriting\n\n500\n\nTues. Jan 2 \n\nSlept on forc with Liverpool\n\nand sought the coolness of the forecastle head. \nand\n There the stars looked down and understood my feelings, the kindly moon with her diffused, sympathetic beams, knew how seasons come & go, and she could understand me; the cool breeze flowing from the peaceful ocean knew my thoughts & understood, and to these & to the ruler of the stars & the winds I could command all things, & to Him I can look for guidance in the Year which commences tomorrow.\n\n\"Ring out the old, Ring in the New\"\n\n1917\n\nJan. 1. New Year’s Day\n. About 110 miles from Cape Town, on the Atlantic Ocean;.\n\nThe beginning of the day seemed so ordinary that it was very hard to realise that the day was a momentous one. However we were given a holiday from drill and in the morning witnessed some good boxing contests &\n\nWed. St. Hel 5.30\n\nRocky deep frontage\n\nTownship, water (fresh)\n\n, green trees\n\nships there only 1st officer before\n\n men, etc\n\nstrenuous exercise & shower.\n\nI believe a concert was held in the afternoon. In the evening the boys were given permission to use the piano & have a sing-song \non th\n by themselves. I took the opportunity of having a good read & sleep and of writing a few cards up in \"our room\". In the evening we played five-hundred till ‘lights-out’.\n\nWere we sorry at not being at home & celebrating New Year’s Day in the usual style? No! Are we downhearted? No!!! The only trouble with us was that the plum pudding which we usually get on Sunday was Kept till Monday, 1st Jan, and as a result, it sat on our chests that day instead of the \npreceed\n preceding one.\n\nThus have we commenced the New Year \"On Active Service\". It is a year of soldiering for us, what its pages will disclose cannot event be imagined; it is only to be hoped that the bright news from the Front continue in the days to come as during the last week or so.\n\nSurely victory must be ours soon!\n","23":" Slept on forecastle last night with Pte. MacCann, nicknamed \"Liverpool\" as he is a pommie, born in Liverpool England. He is only about 17 years of age and for the last three years has been at sea, so you may guess that he is something of a \"bird\". For an hour or so he told me about his experiences and then we both fell asleep. This is not the first time that he has been my sleeping mate and this is one of the ways in which we get to know a little about one another & to understand one another. For some time after coming aboard I was repulsed by this chaps language etc. but now I would be the last to criticise him. He is full of life and energy, always smiling, always out for fun, never loses his temper, ever ready to tip \nyou or\n one out of his hammock one minute, & take one’s part the next minute. And so with dozens, yea, hundreds of cases, but it would take volumes\n\nto record all the pleasures of the brotherhood that we enjoy daily.\n\nThis afternoon at 3 we lowered speed to about 4 knots in order to arrive at St. Helena early next morning.\n","24":" St. Helena sighted at about 5.30 this morning but the outline was partly obscured by the heavy mists which hung like draperies of teased Kapok over her rugged peaks.\n\nSome say that the island is the last port of a lost continent; others say that it was hurled up out of the sea by volcanic action. The latter interpretation seems the more plausible, especially on account of the fact that the water right up to the shore is almost unfathomable: at about 400 yards from shore the depth was 30 fathoms and where we lay 90 fathoms of anchor line had to be let down. Of course the place is not large enough to possess wharf accommodation & it must have been a grand sight for the people to see our seven troopships and escort, together with an English troopship and \n\nDisposition of our fleet.\n\n\"Pt. Napier\" – \"Briton\" S. Africa\n\n\"Horiata\" Aus. – \"Maunganui\" N.Z.\n\n\"Beltana\" Aus – \"Tahiti\" N.Z.\n\n\"Kyarra\" Aus. – \"Suevic\" Aus.\n\n\"Almanzora\" Auxiliary Cruiser.\n\na cargo vessel all anchored just off from the township.\n\nIt is wonderful what feelings of awe stir within one’s breast in contemplation of places associated with the memory of a great man. The very stones & hills of St. Helena seemed to suggest sublimity. Up on the top of one of the steep hills & surrounded by dark green trees lay the house in which Napoleon spent his last days and a a craggy promontory, outlooking the sea in the direction of France, we saw the place wither he resorted daily to turn his eyes & thoughts towards the land which had adopted him. As the place is only 12 miles long by 6 wide, his spirit found rather narrow bounds and most often have craven to get away from its desolation back to this home of fame & glory.\n\nEven at the present time the island is little visited, only 2 ships per year calling there. It is merely used as a naval station and as a depot for naval v.d.’s and political prisoners from South Africa etc. The population seemed to be accepted at 3,000, including\n\nthe garrison posted there.\n\nIt may be considered by us as quite a privilege to have seen this place. Of all the members of our crew, including the skipper, who is an R.N. man, the First Officer is the only one who has ever seen it before. Some tourists!!!\n\nAlthough the island is rocky & barren, there are green patches here & there, & the valley in which the township is chief situate, presents a perfect little picture of fertility & neatness. The end of the valley is closed up by a stone wall which keeps the sea back from its lowest levels, & then as far as we could see, the buildings filled up the valley course. The town altogether was quite a miniature affair however with a church tower in the foreground & a few buildings, which looked like barracks, standing out in the background. Fine green trees of various shades were intermingled with the buildings & the whole presented the picture of an old-fashioned English villa, - if I may compare it with something which I have never seen. On the top of the \nabove\n about 1,500 feet\n\nThur. 4\n\nLeave St.\n\nSleep on deck in sight of St. Helena \n\nnext a quarryman\n\nsail at 11 U Castle Liner\n\nTorpedo precautions\n\n appetite boats, belts\n\nabove the town was, another settlement consisting of a barracks & a number of small white houses extending right up the slope to the highest point.\n\nNot being at a wharf we couldn’t land & so spent the day in the usual manner but the exercises were so strenuous that I am sore all over, in the arms, round the ribs and across the stomach. This is partly due to the skipping. I skipped up to 126 and then did a ‘pepper’ of 100 in 45 seconds, & this is hard work for a beginner. The exercise is doing us much good & besides feeling as fit as a fiddle & enjoying life immensely, my appetite is becoming tremendous.\n","25":" Slept on deck last night and from my ‘posie’ I could plainly see the dark outline of St. Helena. At 11 A.M. we again set out to sea, with the addition to our fleet of the Union Castle Liner \"Briton\" a fine 22 Knot English mail boat. She is carrying returned English troops back to their home. The danger from torpedos is daily increasing and every precaution is being taken.\n\nTo the Ocean.\n\nRoll on, thou deep & dark blue Ocean – roll.\n\n…………\n\nThou glorious mirror where the Almighty’s form\n\nGlasses itself in tempests; in all time, -\n\nCalm or convulsed, in breeze or gale or storm,\n\nIcing the pole, or in the torrid clime\n\nDark heaving – boundless, endless & sublime.\n\nThe image of Eternity; the throne\n\nOf the Invisible……….\n\nThou goest forth, dread, fathomless alone.\n\nLord Byron.\n\nNot a light is allowed to be shown after dark, and even smoking the the open is prohibited. One of our men was fined 5\/- for walking onto the deck with his pipe lighted. Further, there are torpedo picquets stationed all over the boat day & night and our gun is in full readiness for use in case of surprise. All men on duty have to wear their lifebelts and every man on the ship has a lifebelt ready for use if need be. All our lifeboats have now been suspended over the water and \nare\n could be lowered at a moments’ notice. Despite all these preparations nobody seems to care whether torpedoes come or not. In fact, most of the boys would like to see the ship struck, just for the fun of having a splash in the water. My only fear in such an emergency would be lest I should lose my two little model elephants. One of these came from Australia & is suspended round my neck; the other came from S. Africa & is made of ebony with ivory tusks & \n\nwould suffer frightfully in the event of fire or torpedo surprise.\n","26":" On guard in a life-belt today. The sea is very calm; more calm indeed than Sydney Harbour generally is and the boat is consequently making good progress. The sunset was glorious tonight and the bright clouds looked like molten gold mixed with burnished copper. The moon rose early and on my 1-3 night shift it shed a great stream of silver across the silent ocean, a stream which made the dead earth seem to live & which forbade me to feel tired or lonely, & robbed sleep of its prey.\n\nOur officer’s name is Breckenridge, & he is a son of the timber merchant of the same name & most likely father has heard of him in business before.\n","27":" We had a rest this morning after our night’s guard – and as there was only a tug-of-war contest in the afternoon we read & played five-hundred\n","28":" 5.30 & \n\nOur garb (Equator &)\n\nCh. parade dress\n\ntill bed-time.\n\nDec. 7. Slept on the fore-hatch last night. When I went up on deck with my hammock etc. at 9 P.M. there was not an available spot on which to lie. Every corner contained a sleeper & every flat part of the deck was covered \nlike blacks\n with bunks like a floor with tiles. After wandering about in the moonlight for a while I found one small space and by pushing one chap’s pillow up a little & another’s blanket over, I made room for myself. When lying down my head was within 3 inches of another’s feet; and in front of me were three heads, one opposite my neck another opposite my waist & a third against my feet while yet another fellow was lying at my back parallel to myself. Despite the fact that I woke up with my feet on one man’s pillow, we all slept soundly & well & at any rate did not feel at all lonely.\n\nAt 5.30 A.M. the sky promised a grand sunrise so I got up, rolled & packed my bed & had a fine\n\nsalt-water shower & by 6 had my book upon the forecastle & there enjoyed a nice quiet hour before breakfast.\n\nAlthough we have never been guilty of wearing much clothing of late, we are daily becoming more like Mr. Chidley. For the last two days I have worn nothing but those silk trousers which you made me. We are just at the Equator, except for a few hour’s, or day’s, sailing, & the sun is warm, but the weather is so perfect that we don’t mind the heat at all & enjoy getting sunburnt. As we had to be dressed in dungaree clothes for Church Parade this morning I only wore shoes & \nsocks\n sox, short dungaree trousers & dungaree coat, buttoned up to the neck so that the officer wouldn’t notice that I had no shirt on. So far so good: but Church Parade got warm & as Alan & I were not in front we soon had our coats off \n& but fo\n & then felt quite all right. At breakfast this morning four at our table came dressed in shorts only.\n","29":" swim & sun-bake 500\n\nTues. 9 Fell from Hammock\n\n2nd Steward’s fatigue\n\n‘good Friday’\n\n‘bashful’\n\nhard boiled egg & egoist \n\n appropriate with a man\n\npresbyterian (sweat)\n\n‘Ease before elegance’, par excellence. \nBut\n, the day gets hotter still & so just now my only articles of clothing are identification disc & wristlet watch. And still it gets hotter!! I suppose the disc & watch will have to come off next. If the worst comes to the worst I may even have to part with my ‘moustache’. \n\nDec. 8. Too hot for drill so we had a salt-water shower and a sun bake & played five hundred.\n\nDec. 9. Last night I was let down from my hammock by some night-owl, who untied my rope. At 6 A.M. I had to assist the","30":" Steward and before breakfast dragged coal to the cookhouses & carried frozen meat to the butcher. After breakfast we carried potatoes etc. & prepared same for the cook. By ten o’clock my job was finished so I had the rest of the day to myself.\n\nWe have in our company a very tall, thin Corporal known formerly as the ‘human gaspipe’ but of late he has been called ‘Good Friday’, because there is no meat on him.\n\nThe Sea:-\n\nThe Sea! the Sea! tho open sea!\n\nThe blue, the Flesh, the ever free!\n\nWithout a mark, without a bound,\n\nIt runneth the earth’s wide regions round.\n\nIt plays with the clouds; it mocks the skies;\n\nOr like a cradled creature lies. B Proctor.\n\nOne of the songs which is for ever being sung on board ends each verse with the line, \"I’d sooner have a hard boiled egg\" and it has been suggested that one who is continually making his wants known in this way must be something of an \neg\noist.\n\nBecause one chap hurt another one’s feeling the latter declared that he would not \"appropriate\" with him any more.\n\nOn a very, very hot day one joker said that his shirt had become quite soaked with \"Presbyterian\". (perspiration).\n","31":" We again sighted land at about 11.30 this morning. The long white beaches which soon came into view reminded us very much of our own South Coast. Upon approaching nearer to land we were struck by the distinctive tropical aspect of the vegetation. The trees were similar to some of those peculiar tropical plants which may be seen in Sydney Botanical Gardens. Palm trees were also there in abundance. The vegetation was extremely thick and extended right from the \n","32":" Approach & \n\nSierra Leone at noon.\n\nTropical aspect.\n\ntrees etc. (as in Syd. Gardens)\n\nAnchorage to \n\nHouses & buildings & Pop’n\n\nCanoes & blacks & fruit\n\n(skilful use of canoe. 18 their coordination.). \n","33":" Boats. \"Swiftsure\"\n\nsailing smock & coloured dress\n\nBoats in distance like butterflies\n\nBlood red sun at sunset\n\nHot days cool evenings.\n\nCanoes & sailing boats long way out \n\nPicturesque city. 600 yds away from boat \n\nSkirts coast. protected by island\n\nbacked by smooth green round hills, backed by mountainous ridge (trees etc.)\n\n in distance – here & there seen \n\nrich tropical growth gives tone\n\n& buildings in contrast \n\nfine square buildings in sufficient number to impress selves in landscape.\n\nHaze effects remarkable & characteristic of the tropics.\n\nDark bluey-grey-green over town varing in density with time of day.\n\nblue here on sea, grey, grey red, to red on West after sunset \n\nblue \n\nhill-tops to the water’s edge. The anchorage at Sierra Leone consists of a wide bay, protected on one side by a long projecting Cape and on the other by a low-lying island, while reefs protect the place from the direct fury of the ocean. However, the seas around this part of the world seemed so calm that we \nharbour was needed at all.\n could have dispensed with harbours altogether, as indeed we had done at St. Helena. We were about 800 yards from the main township and from that distance Freetown presented quite a picturesque aspect. The buildings all appeared new and modern, and being mostly white or light-coloured, contrasted well against the dark green of the background. The whole seemed neat & tidy, but is was said that in reality the place was none too clean. However we could only see its good points and from our vantage point failed to discern anything that could detract from its beauty. The population is almost entirely black, the natives being of the same race as the American Slaves. \nI believe\n I heard that \n\n(rowers & pinchers off) officers ashore\n\nalso few boys\n\nTown not much for us\n\nblacks with sticks\n\nNo papers here\n\n‘Bashful’\n","34":" guard mumps etc.\n","35":" Leave Sierra Leone at 7.30 after 4 days stay\n","36":" \n\nSignalling instructor \n\nsending ship’s signals \n\nlecture re Suez etc.\n","37":"\n\nLecture\n\nfleet manoeuvres \n\ngun practice\n\nbath parade & ducking\n\nof a total population of 76,000, only 500 are white. The natives grow such things as rice, fruit and cocoanuts, for export as well as for local use.\n\nThe only natives we saw were those who came out into the bay in boats or canoes and in these they brought their wares to the ship’s side. They did a great trade in oranges and bananas and the boys had plenty of fun with them.\n\nThere were 26 large ocean steamers riding in the bay \nwhen we\n while we were there. Of these, one, the \"Swiftsure\" a cruiser, had taken active part in the defense of the Suez Canal. She is a sister ship to the \"Triumph\" which also took part in the defensive against the Turks. \n\nThe harbour presented an imposing Spectacle when the sun began to set in the evening. The great silent, still boats rode peacefully at their anchorages while from the seaward side the tiny canoes & butterfly-like sailing boats returned home. The mountains were dark & grand, and the sun blood-red and sent his last piercing rays across our forecastle and in a few minutes\n\nleft the world & us in darkness and soon the chilly dew began to settle down on deck & with a shudder we were glad to go down to the warmth below. The days here are scorching, so much so indeed that we are not expected to do more than half-an-hour’s exercise or so, each day but the evenings are beautifully cool and it is well worth going through the heat to be able to enjoy the pleasant contrast. Without contrast, indeed, we can enjoy nothing in this world!\n\nFreetown skirts the coast for a mile or so, thinning off at the sides & rear. It is immediately backed by smooth green hills, on which a few scattered buildings stand out in relief; these hills are in their turn backed by a rough mountainous ridge, covered fairly thickly with trees; in the distance and behind these mountains again may be seen the rugged rocky peaks of the real coastal ranges.\n\nOne is particularly struck by the peculiar haze effects, peculiar to tropical climates, & well exampled here. This haze rests on the sea as well\n\nWed 17\n\noff duty till night\n\nread Mazzini’s \"On Caesarism\" etc .auxiliary Cruisers gun-fire \n\nLecture in dark on the Anzac landing\n\nlight guard 10.30 – 2.30\n\nPhosphorecence\n\nThur 18\n\nrough again\n\nbump wooden mile-stones\n\nCaptain cant drive.\n\ndown-hill now\n\nwind blows sea back to Africa\n\nFri 19\n\nStill a heavy roll\n\ngetting cold now\n\npassing ships 2\n\nSat 20\n\nSun. 21.\n\nOn Parade in lifebelts\n\nService & hymns in Eng.\n\nas on the land and its appearance varies according to the background. Over the town itself it assumes a dark-bluey-grey-green shade and is dark or light according to the time of day, so that at day-break one cannot discern even the outlines of the buildings & by mid-day the faintest detail can be clearly discerned. On the sea horizon the haze is distinctly blue and obscures the \ndine\n line of demarcation throughout the whole of the day. It is at Sunset, however, that the most glorious effects are to be seen. The sun is then a rich blood-red colour and adds a grand lustre to the whole scene. The haze in the west is at this time full of alternating colours; from a heavy grey tint on the hills it grows redder \nas\n upwards, and again fades off into a pure blue directly overhead.\n\nThe officers were granted leave here and besides these a few of the lads managed to get ashore. Some rowed the officers over, and others let themselves down the ship’s side by ropes at night & were taken across by the blacks. From \n\nthese we learnt that there was very little ashore worth seeing. Hardly a white person was seen & the blacks were very suspicious of the soldiers & armed themselves with sticks in case of need & one of the lads returned with a scar on his nose which an aggravated native had given him.\n\nI believe there are no papers here; in fact one \"pommie\" officer who came aboard told us he had not seen a paper for 10 months. No wonder we were glad to leave the place!\n\nJan 13. On guard today. My duty was to guard the mumps, quarters on the ship. We have about 120 cases of mumps in quarantine at present.\n\nJan 14. We left Sierra Leone at 7.30 this morning after a four days’ stay. We are now under escort of an auxiliary cruiser, which, in peace time, is a fine large South American Mail boat. It has been fitted with several guns & having a speed of 22 Knots is well able to protect us.\n\nJan 15. Usual routine again. To vary work we\n\ndid a little signaling and as I knew the work I had the job of instructing the section.\n\nAs we cannot have any lights aboard after dark, concerts are out of the question now so tonight we were given a lecture by an officer, who has been in the campaign from the beginning, on the Suez Canal defense.\n\nJan. 16. Our fleet went through a number of manoeuvres this morning in order to be ready for torpedo attacks. We also had a little gun practice. A target was dropped into the water & our gun & the gun on one of the N.Z. boats had a few shots at it. Pity help torpedo boats if they come near!!!!! Bath parade in afternoon. The Non-Com’s did not have a shower so the lads caught them one by one & ducked them. One Corporal was put under the shower with all his clothes on and came out like a wet rag.\n","38":" Off duty till dark this evening. Had a good morning’s read from a volume of Macmillan’s Magazine for the year 1865. An Article by Mr. Mazzini the great, grand\n\nItalian patriot nationalist \"On Caesarism\" was rather good, as indeed is everything which I have ever read from Mazzini’s works. An article on \"Salmon\" was also very interesting.\n\nThis morning our auxiliary cruiser had a little firing exercise & in the language of smoke & fire ‘spoke’ scornful words to all who might approach. On her second broadside she shattered to splinters the small target which she used.\n\nAt 7 in the evening a number of us assembled on the third hatchway & in the utter darkness sat & listened to a stirring lecture on the Anzac landing by one who was there. The sentiments with which we turned into our bunks were awesome & sublime; more need not be said.\n\nAt 10.30 tonight I was posted as ‘light picquet’ amidships and remained on duty till 2.30 next morning, my duty being to see that no lights were shown on deck during that time. The night was cool & dark & the job not altogether uninteresting. The phosphorescence in the water was rather startling. The first time I looked over the ship’s side I was surprised by what appeared\n\nthe reflection of a lighted port hole, but this turned out to be result of the phosphorus in the water. The foaming water behind the propellers shone like great submerged glow-lamps.\n","39":" The sea becoming rough again, new fun presented itself to the boys. Every time a wave bumps against the prow & shakes the old ship they imagine that we are bumping into the \"wooden milestones\" and curse the captain for being such a bad driver, running into stumps & ruts, as he persists to do.\n\nOne fellow really believes that now that we have passed the Equator, we are going down-hill & will continue so to do until reaching England. Another chap thinks that if the wind continues to blow as it is blowing at present \nthere will\n all the water will be blown back to Africa & we will be left high & dry. (!!) \n","40":" The sea is still running high and the weather is quickly growing cooler and the nights are quite cold. In fact after Sunday noone will be allowed to sleep up on deck.\n","41":" Guard. cool \n\nTues 23 rough and cold.\n\nboys happy & noisy\n\nrest all day.\n\nshower read etc. in evening.\n\nWed 24\n\nequipment competition \n\nSailing boat seen.\n\n Wood & MacKinnon\n\nWe passed two ships today one of which was challenged by our cruiser, but allowed to go on its way; the other was a well-known American packet boat.\n\nJan. 21. We all attended Church Parade this morning and by way of novelty wore our life-belts there. In the evening we had a sing-song from Alexander’s hymn-book until it was too dark to see and then of course the cold drive us down stairs until next morning. We do enjoy singing the old, well-known hymns and sending up our petitions to the throne of grace on behalf of those whom we have left behind in Australia.\n","42":" On guard again. Alan & I had posts next to one another and so did not mind the job in the slightest, although the night shifts were very cool.\n","43":" Rough and cold and windy to-day. Boys seem extra noisy & happy. We slept all day, had a cold shower before tea & read etc. in evening.\n","44":" We had to dress up in our full equipment this morning in order to see how well dressed we could be for going ashore in England. The best-dressed man received £1 prize. Sailing boat with three masts sailed fairly close to us to-day.\n","45":" Heavy roll & cold wind. It Being too rough to drill we were given a lecture on trench warfare by our Officer. We all wished we were right there to have a hand in the game.\n","46":" On guard again. Very cold, especially on night shifts. Alan & I & another lad found a warm steam-pipe in a corner of the deck & there we spent the late hours of the night & the early hours of next morning.\n\nJan. 27. We had a thorough clean-up today, and packed away all our belongings preparatory to disembarkation.\n\nIn the afternoon we spied a few specks on the horizon and in half an hour or so five torpedo-boat-destroyers joined our fleet. They are so tiny that we call them\n\nThur. 25.\n\nHeavy roll, cold wind\n\nLecture contd on deck\n\nFri 26\n\non guard\n\ncold & we three\n","47":"\n\nmorn sleep\n\nclean up deck\n\n5 destroyers\n\nSun 28\n\nClean up Kits \n\nCh Parade\n\nSail boats seen\n\ncool, heavy swell\n\nCorp. Pat new names\n\npull through (too thin)\n\nmatch, wood scraped off.\n\ngalloping hat pin.\n\nmosquitoes. They toss about in the rough sea like corks and at times ten or so feet of their prow comes out of the water. They are beautifully equipped with wireless, search lights, guns etc, and, I believe, have a speed of 40 Knots. \nThey\n Although we are going ahead at full speed, they can run all round us, zig zagging here & there & everywhere & we enjoy watching their manoeuvres. This mosquito fleet consists of 05 \"Gadfley\", 58 \"Lizzard\", 65 \"Laurel\", 37 \"Luisfal\", 48 \"Lenox\".\n\nThe above-mentioned thin Corporal has acquired several new names of late. Some call him \"Wombo\" on account of his likeness to a Wombat; Others call him \"pull-through\" but others again assert that he was a failure as such because he went through the barrel of a rifle without touching the sides. Some say that he is as thin as a match with the wood scraped off. I have also heard him referred to as a galloping hat-pin.\n","48":" General clean up & pack-up preparatory\n","49":"\n\ncold night\n\nEarly sight L.H. & England.\n\n(Brown’s death). dozens of boats\n\nEddystone.\n\nD’mth & Plymouth.\n\nCold & windy\n\n36°\n\nno biscuit tea\n\ncold deck guard.\n\nAnticipation.\n\nBlanket raid\n\nnight time \n\nunder table\n\nJan 30 Tues\n\nUp at 6. Snow (?)\n\ndry issue\n\non \"Sir W. Raleigh\" at 10\n\nTrain by 11 Ice etc.\n\n at 3 tea & bis\n\n(8 of us etc.)\n\nAmesbury at 8 \n\nmarch 6 m\n\nhot supper\n\nHuts & bed\n\nto disembarking. Final Church Parade this morning. Sailing boat in full canvas seen quite close to our ship. The air very cool & a very heavy swell on.\n","50":" After a dark, tempestuous wintry night, the early light of dawn revealed several light-houses which, we were told, protected England’s coast. This was the first indication of our proximity to Britains sacred soil. Very soon the great number of boats of all sizes which we passed pointed to the fact of England’s great commercial activity. Later we passed within several hundred yards of the famous Eddystone, which lies out of sight of land and warns ships of a submerged rocky reef. The base of a former L.H. still stands alongside the present structure. Shortly after dinner we came quite close to land and soon turned into the approach to Dartmouth harbour. The English soil appears to be extremely fertile and every inch of it is well cultivated. The fields were mostly ploughed & separated by hedges & stone-walls. Although there were no leaves on\n","51":"\n\nUp at 6.30 7\n\nbread breakfast\n\nmet Les Dimond\n\nInspection Parade\n\nnew equipment\n\nmeals etc.\n\ncold water etc.\n\n(Ice & snow) \n\nTea (poste etc) good\n\nHappy home\n\nY.M.C.A. Concert etc.\n\nwelcome letters (19)\n","52":"\n\nSnow falling on parade\n\nmarch for hour\n\nbeds issued\n\nMed. Inspection\n\nC. of E. Room with Alan’s friend\n\nmet A. Whitelaw\n\nmany of them the trees also looked very nice and promised to present a picturesque scene in springtime. Everything looked extremely homely & inviting. The old-time houses, the occasional ruin, the unpretentious structures of every kind all seemed quite familiar to us although we had never seen them before. The whole place seemed very quiet. Very few people were seen at all, beyond the officials etc who came aboard. After staying in the outer approach to Dartmouth harbour for a few hours we steamed into the inner harbour & there tied up to a buoy. This harbour is most commodious & the entrance is long, narrow & circuitous & in fact the general shape is not unlike that of Port Jackson although it is not so big. There were many ships of all classes to be seen. We passed small torpedo boats, destroyers etc, and later, a number of old-timers one of which, the \"Impregnable\" was very much after the style of Nelson’s \"Victory\" which is at Portsmouth. We did not see enough of the city to say anything about it.\n","53":"\n\nFirst day of full routine\n\nReveille at 6 \n\nBreakfast at 6.45\n\nParade at 7.40- 12.15\n","54":" m. Ceremonial \n\nTurnings & saluting\n\nParade Dinner 12.30 \n\nHerring (cold) 1 potato (peel) 1 slice bread, tea\n\nHot fish (cod?) potato turnips (swede) slice bread\n\nParade 1.40 – 4.30\n\nTurnings some morning\n\nMarching in line etc.\n\n5 on 2 off Smoko etc.\n\nTea 5.30\n\n¼ loaf.\n\nMargarine & paste\n\nTea.\n\nEv. in C. of E. writing\n\nwarm in front of fire\n\nfew dates.\n\n bed Last Post 10\n\nWe expected to go ashore to-day & were already at 4 P.M. for disembarkation but for some reason could not get off. Till 9 or 10 o’clock we waited anxiously for orders. For 2 hours after tea I was on deck guarding our luggage etc. but all to no avail & at about 9.30 we went to the Colonel & asked for blankets, & got them. Till then we had been all ready for departure. 36(degrees) was shown on the Thermometer, so you may guess we were quite frozen by evening time. Of course no tea was ready for us & so we were only issued with ship’s biscuits & a mug of tea & this did not go far towards satisfying our winter appetites. Alan & I got 4 blankets between us & slept in our clothes together under one of our mess tables. \nSome\n of the boys complained of the cold beds!!! Indeed the sleep was a disappointed & disappointing one. We had built up our hopes & they had not materialised. However the next morn brought new hope & new appetite.\n\nBy the way we are flying our Union Jack\n\nhalf-mast \non account in\n because young Brown’s body has lost its soul. This was one of our guests at Liverpool & was that small, young chap with pink, rosy cheeks & is the one, I think, to whom father referred in one of his letters. He was a nice quiet chap & a couple of nights before had been taken from our quarters suffering from appendicitis. And his short day’s work is done.\n\nJan 30. Up early this morning more full of anticipation than heretofore. We were all up early to see what was going to happen. For the first time in my life I saw snow, but it was only very light & in all no more than three tiny flakes came my way. After breakfast we were issued with a few ship’s biscuits & a tin of ‘bully-beef’ each & this had to do us for the next 24 hours although ere that time had elapsed we scored in the way of food, elsewhere. At 11 we boarded the tender \"Sir Walter Raleigh\" & were taken ashore and an hour later were all safely packed in a long train steaming across\n\nhills & dales, past country farms & homesteads towards Salisbury Plains. There we remained till 8 in the evening. Although the air was bitingly cold, & ice \nlay\n snow lay on every land we were a happy little party. Eight of us were in our box carriage & the fact that we were all strangers in a strange land united us all & as the hours wore on, and we shared our bully-beef & biscuits, we grew more & more contented with our lot & entered deeper & deeper into one another’s confidence.\n\nAt three in the afternoon we were warmed up through the thoughtfulness of some kind people. We all got out of the train at Exeter & had our water-bottles filled for us with hot tea & each soldier received a bag in which was a fine currant bun & a note; one of which is enclosed.\n\nAt 8 o’clock we left our train at Amesbury & then marched six miles to the A.I.F. Training Camp which is situated at \"Rollestone\", a part of the celebrated Salisbury Plains, about 15 miles from the city of Salisbury itself. We arrived there at about 10.30\n\ntired, cold etc & were marched straight to the dining-hall (of which more later) & there received a drink of coffee, some soup & bread & by 11.45 we were rolling ourselves in our 4 blankets, waiting patiently for the kindly hand of sleep to touch our wearied spirits.\n\nJan. 31. We did not get up at Reveille this morning but stayed in bed till 7 o’clock and at 7.15 went for our breakfast. Unlike Liverpool, we have our meals here in a \"dining-hall\" which is a large room with tables & forms to accommodate about 250 men. In the centre is a large warming stove to help make the place habitable in winter. We do not have to serve as orderlies but simply sit down 16 at a table & the cooks assistants place the dixies of food at the end of the table & the end men deal it out. When we have finished we leave the place as we found it & wash our own dishes in tubs of warm water supplied for the purpose outside. No eating is allowed in our living huts.\n\nFeb 3. Sat\n\nUp at 7 not 6.\n\nRoute march 6 m. with full Kit in morning.\n\nAfternoon off.\n\nDescn. of Camp (Rollestone)\n\nHuts, balloons, planes. dining halls\n\nY.M.C.A. CP etc.\n\nwriting rooms.\n\nShrewton.\n\nPh Ch of St Mary\n\n(seek dial)\n\n\"Life is but a walking Shadow\"\n\nAfter breakfast I met Les Dimond & had a short chat with him. Later in the morning all the new-comers had an inspection parade & after that we were given a new web-equipment in place of the one which we had brought from Australia.\n\nThe weather is rather cold just now. Ice & snow abound everywhere. The taps a frozen up & in order to wash we have to get some ice out of the water-troughs & melt it on our hut stove. However everything seems to indicate that we will have a very happy time here.\n\nAfter tea Alan & I visited the Y.M.C.A. Camp Hall and spent an enjoyable evening there. It contains a canteen, writing tables, billiards & concert hall etc. etc. & is nice & warm & cosy, having a fine large stove in the centre. We were just in time to hear a very good concert there.\n\nI was almost forgetting to note that we received our first mail today at dinner-time.\n","55":"\n\nFrost & cold.\n\nCh. Pde in Y.M.C.A.\n\n\"Fight good fight\" etc.\n\nMessage from Paul\n\nQuit ye like men be strong.\n\nSnow-fall.\n\nwriting Room\n\nEv. Anglican Ch in Shrewton.\n\nAndante in G on pipe organ.\n\nAnglican service\n\nwalk home through full moon on snow.\n\nWarm feet & turn in.\n\nI received 19 letters in all & also a large parcel of sweets etc from Aunts Jessie & Agnes. Their letters were very welcome especially as we had not heard of home for over eleven weeks. The sweets were also very acceptable because Alan & I had only two half-pennies between us & pay did not seem to be forthcoming. We had not been paid since leaving Cape Town. Our funds were increased to 4d by the addition of 3d which I found on the Y.M.C.A. floor. This sum of money we guard jealously until our stores run out.\n\nFeb. 1. Snow was falling lightly during the parade this morning. We were issued with straw beds & also boards & small stools on which to sleep. Alan & I have an ingenious way of making our beds, by which we sleep in a kind of Shallow box like a ship’s bunk & in this way keep much warmer than we would otherwise be. We were medically inspected in the afternoon. Our teeth were also inspected by \n","56":"\n\nSnow still on gnd\n\nblockade & attack\n\nAftn march & lecture by doc\n\nSalvn army warm,\n\nwrite & tea (4d).\n\nFeb. 6., Tues\n\nNew parade hours etc.\n\n8.40-12.15 1.40-5.0\n\nSolid work on snow \n\nmarching, turnings forming 4’s etc.\n\nhours physical cult\n\nall worked to a standstill\n\nY.M.C.A. warm & write\n\nthe Surgeon Dentist. My teeth were classified as A.1.(!)\n\nAfter tea Alan & I & a friend of Alan’s from Paling’s went together to the Church of England hall & we were \"shouted\" to a cup of coffee & a couple of cakes!! & this put us in a happy mood. A few minutes later who should speak to me but Arthur Whitelaw. He stayed with us for the rest of the evening & we had a very happy time together.\n\nFeb.2. This being our first day of full routine I will give details of what happened, this being the general daily work here.\n\nReveille at 6.\n\nBreakfast at 6.45 consisting of 1 herring (cold) 1 potato in its jacket (hot), 1 slice of bread & about 2 pints of hot tea.\n\nParade 7.40 – 12.15 consisting of route march for 2 miles to warm us up, then a ceremonial assembly of the Brigade then practice in turnings & saluting.\n\nDinner 12.30, consisting of hot fish & sauce, potatoes, Swede turnips & 1 slice of bread. \n\nParade 1.40-4.30 similar to morning.\n\nTea 5.30 consisting of ¼ loaf of bread, margarine & a little bloater paste & plenty of hot tea.\n\nThe evening we spent in C. of E. writing hut, and returned to our own hut at 9, had a warm in front of our own hut-fire, had a few dates from Aunty’s parcel. Last Post at 10, & lights out a few minutes later.\n\nFeb. 3. Up at 7 instead of 6 from now on owing to the severe cold. According to custom on Saturdays we went for a 6 miles route march with two bands, one of which was a Piper’s band. These always accompany us on marches & to & from parade. We wore our full kit. The afternoon we had off, there never being any parades from 12 on Saturday until Monday morning excepting Church Parade.\n\nHaving now been at \"Rollestone\" for a few days I have had time to see what it is like. It contains about 250 or more living-huts, together with \"dining-halls\" writing huts etc. and is situated on fine undulating country with acres of good open fields on every hand on which we have ample room for parades. On the East there are 4 (or 5) rifle ranges & an Artillery range; as well as a number of trenches for use in training recruits. The huts are set out in rows of ten. They are somewhat smaller than the Liverpool huts & accommodate 30 men each; every man being allowed about 3’ 6\" lateral space. In the centre is a stove which is kept alight all day & all night if at all possible and this is used to keep the hut warm & comfortable. On the north of the camp is a balloon depot & observation balloons ascend over the camp every day. Aeroplanes also daily traverse the camp. We are some 6 miles\n\nfrom the nearest railway station, viz Amesbury, and about 2 miles from Shrewton, the nearest village. Stonehenge is about 4 miles away & there are two or three other villages a few miles away. Such is a brief outline of our new home.\n\nTo return to the days doings; Alan & I went to Shrewton this afternoon. It is a real old-fashioned township about half-a-mile in length & lies along a beautiful little running stream. It has no design, & its streets wander wither they wish, here there & everywhere. It has nothing modern in it but still possesses the old English style of small houses & cottages many of them with mud walls and all of them with tiny casement-like windows, some of which look quite romantic. In fact, as we were passing one house, I mentioned this to Alan & suggested that one of the windows in it made me think of the days when sweet maidens smiled down upon warriors brave, & strange to say, no sooner had we gone\n\nthree paces further on than a beautiful pink-cheeked young lady drew aside the curtain & cast her dimpled smiles upon the passers-by.\n\nAt the village itself the characteristic church spires attracted us & we visited the two local Anglican Churches & had a good look, inside & outside of both of them & were much struck by their age & by the many fond associations which they brought into our minds.\n\nAltogether, we spent quite an enjoyable afternoon at Shrewton, wandering through its chief streets & peering at anything & everything that attracted our curiosity. We winked at the children we saw, & they thought this great fun; we tried sliding along a frozen ditch on our hard boots & when Alan sat down on the ice, the girls who were near laughed; but having no money & being hungry on account of the cold we had to return early for tea & so did not see\n","57":"\n\nPorridge\n\nFull days drill\n\nSame work as yesterday & slow marching, like Ger goose steps.\n\nWorked to a standstill\n\nC.E. hut in Ev.\n\nHot shower & bed.\n\nFeb. 8 Thur.\n\nFull day’s drill xcept l hour off for pay\n\nPay of £4 less 11\/1 fare 10\/- extra\n\nSnow dry & thawing in places\n\nLecture in Ev at Y.M.C.A.\n\nFeb. 9 Fri.\n\nLeave.\n\nUp etc. & Amesbury\n\n9.30.\n\nLondon \n\nHorsefery Rd.\n\nLunch\n\nHighgate\n\nEuston tea.\n\nall that we would have liked to.\n\nWe were much struck at the sight of an old sun-dial on a house-wall facing the main street on which were engraved these words from Shakespeare \"Life is but a walking Shadow\". How appropriate & how true!\n\nHowever it would take volumes to tell all we saw at Shrewton, but when we get our pay I will buy as many views of the place as I can obtain & these will give you a better idea of the place than all my words could.\n\nFeb. 4. Sunday\n. Cold & frosty this morning. Church Parade in Y.M.C.A. hut in forenoon & we sung the old hymns \n& listened to a strong address on\n \"Fight the good fight\" etc and listed to a strong address on Paul’s exhortation \"Quit ye like men, be strong\".\n\nOn our return from this parade we went through a snow-fall & got back to our huts with about 1\/8\" of Snow\n\non our hats. The snow continued to fall for about 8 hours & by then about three or four inches of the beautiful white fluff covered everything. We spent the afternoon in the writing-room near a grand warm stove.\n\nIn the evening we set out through the snow to St. Mary’s Anglican Church, at Shrewton & after a smart half-hours walk arrived there warm & happy & feeling extra well. Our heart melted within us when the pipe organ commenced on the celebrated ‘Andante in G’ by Batiste & at once we were quite at home. After Service we had a fine walk home across the moonlit snow, the moon being well-nigh full, and with feet as warm as toast we tucked ourselves between the blankets as cosy as well could be.\n\nFeb.5 The snow being still on the ground this morning we had a sham-fight with it instead of the usual drill. Our company\n\nbuilt a blockade about 100 yards in length with the snow & also got ready piles of ammunition, in the way of snow-balls, squeezed as hard as possible. We then lay down behind the parapet & waited the attack & when the enemy came near we let fly & for a few minutes there was something doing. Almost everyone of us, officers included, were soaked through with thawed snow & it was a cold-footed column that wended its way back to camp.\n\nNeedless to say the boys got plenty of amusement out of the snow. They had snow-fights among themselves & at times it was not safe to put one’s head outside the hut door for fear of \"stopping one\". They also made huge snowballs. One of these they rolled down to a lady’s door at Shrewton & when she came in to answer to their knocking they told her that there was 4d to pay on it. They \n\nrolled on ball about 5 feet in diameter against the dining-hall door at Camp & when the orderlies opened the door at lunch time this thing confronted them & it took quite a while to get it shifted. This ball lasted for over a week & is still there though somewhat diminished in size. In the afternoon we had a short march to warm us up & were then lectured by the Medical Officer.\n\nIn the Evening we had a seat near the Salvation Army fire, did a bit of writing & with our last coppers had some supper. Alan & I had 1\/2d each when we landed in England and I picked up 3d in one of the huts here, so we just had enough to buy a nice cup of tea & a cake each. But pay day won’t be long in coming now.\n\nFeb. 6. New parade hours commenced today, viz. 8.40 – 12.15 & 1.40 – 5.0. Drilling on\n\nthe snow was very hard work & included marching in line, turnings, forming fours etc. Our day’s work also includes one hour’s solid physical training which proves very solid, but nevertheless must be very good for us. We were quite worked to a standstill & were glad when tea-time came. Y.M.C.A. hut in Evening gave us warmth & comfort.\n","58":" Porridge for breakfast quite reminded one of olden times. Same drill as yesterday but including slow-marching which is something after the style of the German goose-step. We were ‘dead-beat’ by end of day but spent a nice evening in the C.E. hut & ended up with a hot-shower & an early bed.\n","59":" Full day’s drill except 1 hour off for pay. We received £4 only & out of this was deducted 11\/1 for fare to Birmingham at reduced rates. An old debt of 10\/- raised my funds by half that amount, the other 5\/- going to Alan.\n\nThe Snow is very dry now & is just beginning to thaw & it is hard to walk on it especially on the roads which are very slippery.\n\nIn evening we heard a lecture by an Indian on the Wonder & Mystery of India. He was very well educated & spoke most eloquently & most passionately & closed his address with an expression of the hope that the Greater British Empire might be united \nwith\n in a firm brotherhood. He closed the meeting with a passionate prayer to God to deliver us from the darkness of our present struggle. The impression he created on me was rather sublime than otherwise.\n","60":" Our leave of four days commenced to-day. We arose early & had dressed, breakfasted & marched to Amesbury Station (6 miles) by 9.30 A.M. Our train left at 10 & we detrained at Waterloo Station, London at 2 P.M.\n\nWe were then marched about 1 ½ miles to the A.I.F. headquarters at Horseferry Road and after receiving our full instructions were dismissed. We then had \nsome\n lunch and proceeded by Motor Bus to Trafalgar Square & thence by Tube to Highgate in search of a piano factory about which Alan had heard. We found the place but it was being used for munition work & so we had to retrace our steps. We took the electric car to Euston & there had tea & amused the waitress for a while. We then had to fill in a few hours before getting our train to Birmingham & so resolved to go to one of the picture shows & of course could not go alone. An Australian in England gets the ‘glad-eye’ from every girl he passes & so we simply walked out of the restaurant & in a few minutes found ourselves is a nice picture palace with two of the prettiest little pink-cheeked girls you ever saw. (Continued in our next)\n\n"}}