{"Document Name":{"0":"Diary_0212","1":"Diary_0212","2":"Diary_0212","3":"Diary_0212","4":"Diary_0212","5":"Diary_0212","6":"Diary_0212","7":"Diary_0212","8":"Diary_0212","9":"Diary_0212","10":"Diary_0212","11":"Diary_0212","12":"Diary_0212","13":"Diary_0212","14":"Diary_0212","15":"Diary_0212","16":"Diary_0212","17":"Diary_0212","18":"Diary_0212","19":"Diary_0212","20":"Diary_0212","21":"Diary_0212","22":"Diary_0212","23":"Diary_0212","24":"Diary_0212","25":"Diary_0212","26":"Diary_0212","27":"Diary_0212","28":"Diary_0212","29":"Diary_0212"},"Date":{"0":"unknown","1":1482.0,"2":1488.0,"3":1489.0,"4":1500.0,"5":1517.0,"6":1521.0,"7":1532.0,"8":1533.0,"9":1570.0,"10":1572.0,"11":1573.0,"12":1574.0,"13":1575.0,"14":1576.0,"15":1577.0,"16":1578.0,"17":1579.0,"18":1580.0,"19":1581.0,"20":1583.0,"21":1592.0,"22":1614.0,"23":1619.0,"24":1621.0,"25":1627.0,"26":1786.0,"27":2082.0,"28":2083.0,"29":2096.0},"Entry":{"0":"\n\n121\n","1":" Arrived home safely last night after a most enjoyable day everywhere was covered in snow a typical Xmas.\n","2":" Rather a quiet day still situated near Peronne.\n","3":" Leave to-day with Horace, Charlie Ferguson Cridland for 8 days leave to Paris so great is the joy.\n","4":" Arrived back to find the Div. near Reninghelst in huts & by jove its cold snow everywhere. Had a wonderful time in Paris stayed at the Hotel MONTANA Avenue de L’Opera near Place de L’Opera a lovely place. Saw Hamlet as a grand opera it was great the building is gorgeous. No time to detail my trip don’t think I shall ever forget the beautiful City, the \nCity of my dreams\n.\n","5":" Spent the day in handing over my duties at T.H.Q. to .\n\n122","6":" Reported to","7":" Coy. Supply Section for duty; they are a fine lot of chaps & everything is jake.\n","8":" Went to Railhead this morning & was initiated into the whys & wherefores. Issued this afternoon & in the middle of it received 3 letters from Aussie. 1 from Mav & Ruth.. 1 Eric Clarke & 1 from Ivy Janson.\n\n7-3-18- 26 to-day third birthday away. Am still with the Section & am comfortably billeted in “Belgian Farm\" La Clytte where the folk are most kind. Ma is tending a boil on my neck & is very gentle. The girls, Rachael & Honorine treat me like a brother & I have full run of the house help myself to hot milk or coffee whenever I fancy it. The weather is beautiful its good to be alive.\n","9":" Fritz is shelling the\n\n123\nvicinity very heavily. The weather on the whole lately has been glorious the trees have all commenced to bud & the birds are making their way back from the South- Spring is here.\n","10":" Word came through at issue time this afternoon to move to-morrow it will hurt leaving this good billet I have had a splendid time here.\n","11":" Moved to Haverskerque & billeted with Blue Carter in a lovely room it was goodo. Fell in love with one \nthe\n daughter Marie Rose & Blue fell in love with the other. Milk was on tap & we made a few pints look silly. They were sorry to lose us.\n","12":" Moved to Houdain a fairly large town & fell in with nice people for the night\n","13":" Moved from Houdain &\n\n124\npicked up rations at Tinques, from there we made Bavencourt & ordered to stand by amp; await orders. Fritz supposed to have broken through with Armoured Cars. Civilians ordered to leave. Witnessed some pitiful sights. Ordered to Saulty where we issued.\n","14":" Left early via Doullens & drew rations at Warlencourt les Pas then through Aschieux arrived at Warloy. Fritz too close for lorries so were ordered to Esbart via Contay where we dumped in the courtyard of the stables of the Chateau.\n","15":" Remained at Esbart Fritz shelling very heavily.\n","16":" Left for Moulens au Bois where we stayed the night. Gave some starving refugees some of our rations poor beggars.\n","17":" Moved to St Gratien & rained\n\n125\nvery heavily. Camped in a barn & had a lively night X.\n","18":" Still at St Gratien spent a pleasant evening with some civilians who thought the Aussies were \nsome\n soldiers. I recited “How the Chestnut Horse came home\" had some great fun.\n","19":" Left for Esbart again & issued in the Chateau grounds. Found a better billet this time had a house to ourselves.\n","20":" Left Esbart for Behencourt where we stayed for a few weeks enjoying ourselves. Fritz made it willing now & again two Tommies were wounded opposite our front door.\n\nPlayed the 34th Battery (Tommies) football & beat them twice. Played wing ¾ & in the second match I scored a nasty knee but thanks to the","21":" Fld Ambulance it was soon mended.\n\n126\nWe dug in well at one place Marie & Marguerite & spent many a pleasant evening there as well as at our own shack round the fire. Spent a lively Anzac night after a splendid meal.\n\nPlayed the Coy. football neither side gaining a victory- nil all. It was a furious game but my crook knee forbade me playing worse luck & I barracked.\n\nOn the whole we spent a pleasant time at Behencourt & were sorry to leave.\n","22":" Moved to the Cross Rds between Camon & & are camped in a wheat field under a rough tarpaulin shack. Its very comfy though & the open air will do us good.\n","23":" Last night I took up to our Batteries & Machine Gunners & experienced an exciting time.\n\n127\nBlue Carter & I went for a stroll down to the Somme River the other night it was great.\n","24":" Went punting on the River Somme it was glorious. Blue Carter Bill Newton & a lad named Middleton were with me. The picturesque scenery is indescribable & we saw it at it’s best. It was a glorious afternoon just like our weather at home.\n","25":" Train sports were held to-day- a brilliant success- plenty of fancy dress the clothes were obtained from the empty houses in the village. It was an excellent turn out.\n\nBreak\n\nLeft for England","26":" for 6 months tour of duty but luckily Armistice was signed","27":" I never returned to France.\n\n128.\nIt was at BOHAIN I left the Unit after a very trying time including the taking of the Hindenburg Line. Our Artillery were covering 2 Divisions of Yanks the Infantry were back resting after the \nseverest\n capture of the LINE.\n\nThe change to England was very welcome although it hurt a little leaving all my pals.\n\nOn arrival in England (Parkhouse Camp) I met Capt Glasgow who was Adjt & he detailed me for duty at Weymouth for which I will be forever grateful. It proved an excellent place- a pleasure resort on the coast & known as the Naples of England. I spent many\n\n129\nhappy months there & made numerous friends. The principal pastimes were Tennis Swimming boating & rambling, \nover\n the beautiful Dorset Cliffs & garden like country made the latter the most enjoyable.\n\nHad a whole day motor picnic to Bridport- beautiful. managed to get a months leave altogether & was called to Parkhouse in June for demobilisation. Had a few more days leave spent them with friends at Southend on Sea. Sailed in the “Port Melbourne\" from Devonport on","28":" about 1300 on board. An old pal Glenn was on board so things went merrily.\n\nHad a very good trip until after passing Cape Town when the skipper took us into the\n\n130\n\"roaring forties\" & we struck boisterous weather for a week including a Snow Storm. Had to be screwed down so things weren’t too comfortable.\n\nPlenty of entertainment on board orchestra & local concert talent also a miniature Picture Show which drew large “houses\" & the remarks from the Diggers was always the Star turn.\n\nSpent 2 ½ days in Cape Town & saw the place- very nice too. Secured a car one day & drove round Table Mountain a gorgeous trip. Plenty of Fruit\n\nTouched Albany- more fruit. Touched Adelaide- more fruit & said goodbye to our S.A. pals. Great excitement on the Wharf.\n\nArrived Melbourne","29":"\n\n131\nVery quiet reception at the New Pier. Had lunch on board then went ashore with full kits. Had a few hours to wait for the train which left about 4 p.m. Good trip overland arriving in Sydney next day a while after 4 p.m.\n\nGreat crowd at the Anzac Buffet & one cannot explain the feeling to be “SAFE BACK HOME.\"\n\nGot my discharge very quickly Edmund put me through & I was soon whizzing by car HOMEWARDS with my Home Folk\n\n \n\n"}}