{"Document Name":{"0":"Diary_0192","1":"Diary_0192","2":"Diary_0192","3":"Diary_0192","4":"Diary_0192","5":"Diary_0192","6":"Diary_0192","7":"Diary_0192","8":"Diary_0192","9":"Diary_0192","10":"Diary_0192","11":"Diary_0192","12":"Diary_0192","13":"Diary_0192","14":"Diary_0192","15":"Diary_0192","16":"Diary_0192","17":"Diary_0192","18":"Diary_0192","19":"Diary_0192","20":"Diary_0192","21":"Diary_0192","22":"Diary_0192","23":"Diary_0192","24":"Diary_0192","25":"Diary_0192","26":"Diary_0192","27":"Diary_0192","28":"Diary_0192","29":"Diary_0192","30":"Diary_0192","31":"Diary_0192","32":"Diary_0192","33":"Diary_0192","34":"Diary_0192","35":"Diary_0192","36":"Diary_0192","37":"Diary_0192","38":"Diary_0192","39":"Diary_0192","40":"Diary_0192","41":"Diary_0192","42":"Diary_0192","43":"Diary_0192","44":"Diary_0192","45":"Diary_0192","46":"Diary_0192","47":"Diary_0192","48":"Diary_0192","49":"Diary_0192","50":"Diary_0192","51":"Diary_0192","52":"Diary_0192","53":"Diary_0192","54":"Diary_0192","55":"Diary_0192","56":"Diary_0192","57":"Diary_0192","58":"Diary_0192","59":"Diary_0192","60":"Diary_0192","61":"Diary_0192","62":"Diary_0192","63":"Diary_0192","64":"Diary_0192","65":"Diary_0192","66":"Diary_0192","67":"Diary_0192","68":"Diary_0192","69":"Diary_0192","70":"Diary_0192","71":"Diary_0192","72":"Diary_0192","73":"Diary_0192","74":"Diary_0192","75":"Diary_0192","76":"Diary_0192","77":"Diary_0192","78":"Diary_0192","79":"Diary_0192","80":"Diary_0192","81":"Diary_0192","82":"Diary_0192","83":"Diary_0192","84":"Diary_0192","85":"Diary_0192","86":"Diary_0192","87":"Diary_0192","88":"Diary_0192","89":"Diary_0192","90":"Diary_0192","91":"Diary_0192","92":"Diary_0192","93":"Diary_0192","94":"Diary_0192","95":"Diary_0192","96":"Diary_0192","97":"Diary_0192","98":"Diary_0192","99":"Diary_0192","100":"Diary_0192","101":"Diary_0192","102":"Diary_0192","103":"Diary_0192","104":"Diary_0192","105":"Diary_0192","106":"Diary_0192","107":"Diary_0192","108":"Diary_0192"},"Date":{"0":"unknown","1":1901.0,"2":1902.0,"3":1903.0,"4":1904.0,"5":1905.0,"6":1906.0,"7":1907.0,"8":1908.0,"9":1909.0,"10":1910.0,"11":1912.0,"12":1913.0,"13":1914.0,"14":1915.0,"15":1916.0,"16":1917.0,"17":1918.0,"18":1922.0,"19":1923.0,"20":1924.0,"21":1925.0,"22":1926.0,"23":1927.0,"24":1928.0,"25":1929.0,"26":1930.0,"27":1931.0,"28":1932.0,"29":1933.0,"30":1934.0,"31":1935.0,"32":1936.0,"33":1937.0,"34":1938.0,"35":1939.0,"36":1940.0,"37":1941.0,"38":1942.0,"39":1943.0,"40":1944.0,"41":1945.0,"42":1946.0,"43":1947.0,"44":1948.0,"45":1949.0,"46":1950.0,"47":1951.0,"48":1952.0,"49":1953.0,"50":1954.0,"51":1955.0,"52":1957.0,"53":1958.0,"54":1959.0,"55":1960.0,"56":1961.0,"57":1962.0,"58":1963.0,"59":1964.0,"60":1965.0,"61":1966.0,"62":1967.0,"63":1968.0,"64":1969.0,"65":1970.0,"66":1971.0,"67":1972.0,"68":1973.0,"69":1974.0,"70":1975.0,"71":1976.0,"72":1977.0,"73":1993.0,"74":1994.0,"75":1995.0,"76":1996.0,"77":1997.0,"78":1998.0,"79":1999.0,"80":2000.0,"81":2001.0,"82":2002.0,"83":2003.0,"84":2004.0,"85":2005.0,"86":2006.0,"87":2007.0,"88":2008.0,"89":2009.0,"90":2010.0,"91":2011.0,"92":2012.0,"93":2015.0,"94":2016.0,"95":2017.0,"96":2018.0,"97":2019.0,"98":2026.0,"99":2027.0,"100":2028.0,"101":2029.0,"102":2031.0,"103":2036.0,"104":2037.0,"105":2038.0,"106":2043.0,"107":2044.0,"108":2046.0},"Entry":{"0":"\n\n","1":" (continued)\nLeaving Montmartre we came to Napoleon's Tomb in the Church of the Invalides, which was constructed by Visconti immediately under the cupola. It is an open circular crypt, 36 feet in diameter and 20 feet deep, with a granite sarcophagus hewn out of a single block, weighing 70 tons, brought from Finland for the purpose. In the Tomb the lighting effect is marvellous, as Blue stained windows around the tomb cast a dull dead light on the sarcophagus, whereas the yellow stained glasses near the Altar, throw\n\na golden light on the Altar. The contrast is marvellous & wonderful. The remains are lower than the floor anidea to make the \"Proud English People bow their Heads to Napoleon\".\n\nIn this building are the flags that France had captured from different nations at different times. All but one of Britian's flags were returned in 1914.\n\nNext place to visit was the Big Wheel one of the amusements of Paris; it is 300 feet High from the top of which can be had a Panoramic view of Paris, the day was mistywhen we went up, so could not see too far.\n\nWe next visited Eiffel Tower near by which was built for the Exhibition of 1889 by M. Gustave Eiffel. It is 980 feet high and is constructed of iron. On thefirst landing was a theatre etc & on others different shows. It is closed now being used for a wireless station. Theatre at night.\n","2":"\nHad a good look at Madeleine Church, imposing outside with its columns but gloomy within, the most fasionable of Paris churches, where society weddings take place. In 1806 Napoleon decreed that the church should become a Temple of Glory to commemorate the deeds of the Grand Army. After 1815 it reverted to church\n\nagain. The Bronze doors are fine, representing the Last Judgment. Leaving here went down the Rue Royale, one of the fashionable streets of Paris. It leads into the Place de la Concorde which appears to be more wonderful the more one sees of it. From it leads off the Most Wonderful and beautiful of any streets that I have ever seen. It is the best in the world. By name Champs Elysées (Elysian Fields). The avenue is 1 1\/3 miles in length at the top of which is the Arc de Triomphe, a fine Arch indeed, to commemorate France's Victories. The Place de l'\n\nEtoile is also grand. The avenue was given its name in the 17th century and has ever since been the favourite promenade of Parisians. We next visited the two art Palaces the Petit & Grand Palais. These are both fine buildings with beautiful surroundings. The Arc of Triomphe was designed in 1806 for Napoleon Iand completed in 1838. The cost was over 10,000,000 francs. The fine sculpture and inscriptions record the triumphs of Napoleon. The Place de l'Etoile named because it is a centre of a star of avenues radiating to various parts. From here we went to\n\nthe great war painting by two eminent artists Pierre Carrier-Belleuse and Auguste-Francois Gorguet, with twenty assistants. It took four years to complete starting soon after the outbreak of war in 1914. It is a marvellous realistic painting of the past of all the Allies who did work in the war with their most eminent people in the foreground. The landscape shows the principal battle fields of the war. The main portion shows France's Victorious Army marching to this gathering place a huge building with a statue of Victory in the centre around which are the Generals of France & her statesmen.\n\nIt is a marvellous work indeed, & the more you look at it the more real it appears. From here we walked down to Opera the finest building in Paris costing 37 million francs to build. Begun in 1861 it was finished in 1874 from the designs of Charles Garnier. The outside is superb, but the interior is far better. The grand staircase is luxurious having white marble steps. Near the Opera is one of the most fashionable café in Paris, \"Café de la Paix\". The Avenue de l'Opera is a very fine street, built for the exhibition of 1878. We made our way down to the Republique\n\nalong the main Boulevardes crowded with people. In the streets are the main theatres or Cafés & offices too numerous to remember, but all help to make gay Paris. The Parisians worrying nothing about the outside world in Peace, they live in their own place & that is all that matters.\n\nAt night went to a theatre, partly English & French, but a good show.\n\nHave obtained good photos of some of the places.\n","3":"\nWhilst having breakfast a M Burnaud, a French-Swiss Artist\n\nof some little fame asked me through the YMCA to pose for him, he being desirous of taking an Australian Soldier, as he was making a collection up of all the different nations fighting in the war. Thought I was a typical Aussie, so more out of curiosity and to break the monotony of sight seeing I went. He treated me well, & for two days I was well dug in at his Home. He has a nice family all speaking English fairly well.\n\nThe work was good & he is sending me a repoduction of it to Australia. I took a photo of it. It gave me an insight into a French Home, for as you know, one may be a great friend ofaFrenchman\n\nbut you will never gain access to his Home too easily. In the afternoon my mate & self had a look at the Place and Column de Vendome. The column was erected by Napoleon to commemorate his victories in 1805; it is an imitation of Trajan's column in Rome (142 feet high). Going on through Rue de la Paix the street of dressmakers & fashionable jewellers, we came to the Louvre, the noblest monument of French Renaissance, & the most beautiful museum in Europe, containing an unrivalled collection of paintings & scultpures.\n\nThe Garden of the Tuileries are very nice around which is the Palace. The best\n\nstatue is of Gambetta, organiser of the National Defence in 1871, and the figure of the Alsatian woman seizing the rifle of a dying soldier; typical of the Franco-Prussian war.\n\nAt night we went to a Pathe Picture Palace for a change.\n","4":"\nWent out to the Artists in the morning who made rapid studies with the work. His daughters sang beautifully. In the afternoon I met my mate and we had a strollabout the centre of the city via the main Boulevardes, looking at different shops and people. It is most interesting to sit outside a café and watch the\n\nnumber of people go by. One often sees funny incidents. The weather is ideal, nice sunny warm days. Went to Kodaks for my films which came out excellently. The tubes of Paris are easy to fine one's way about as they have the direction (the terminus) up clearly and there is only one paying 1½d. and you can keep on riding in any tube provided you do not come up on to the streets. They have very little seating accommodation, all people stand & by this way more can get on the trains.\n\nThey the people amused me often by the way they shove, & push to get on first. One would think it was the last train\n\nto run the way they hustle. I took a tumble after a few days & pushed etc also.\n\nIt is a much better tube service thanthat of London. The train service to various places is also good. A few buses run to a couple of districts. The taxi cab is dead funny. Has one small engine & invariably a big chauffeur, who when going up hill leans forward to help it on its way. However they are very serviceable cars for Paris, getting in and out of trafficwonderfully well. In Paris the traffic is uncontrolled, & things carry on very good. The Pedestrians have to keep a sharp look out\n\ncrossing Rues or Boulevardes. If a car knocks you down, you pay the damage to car, not the driver of vehicle. Quite the opposite to England & Australia. There are thousands of Americans in Paris the fellows who won the war? So they say÷\n\nAll the avenues have fine trees down either side, and it would make the streets look beautiful in the Summer time. At night we went to the Gaumande Picture Palace, largest in the world. It is no Architectural beauty, but is of an enormous size, with fine paintings on ceiling\n\nand well fitted out. It is a Vaudeville & Picture Show. It started raining tonight.\n","5":"\nIn the morning I went out to the \"Great War painting\", the chap I am with also came out to have a look at it. Had dinner there, then strolled around till 5 pm, preparing to go to Opera at 6 pm. Had a very good dinner at an up-to-date café then went to see the Opera which started at 7.30 pm. In the interior there are all boxes, except of course the main Hall. It is beautifully furnished, every comfort one could wish for. We had a Box in the centre on the second stage\n\nhaving a perfect view & could hear well.\n\nAlthough the piece \"Faust\" was in French we enjoyed it, and I was carried away with the beautiful music & singing. The staging etc was excellent. At interval there is a Promenade where all people walk around to show their beautiful dresses off. We fell in with the throng & enjoyed looking at the dresses etc.\n\nIt is a marvellous theatre & one could easily go twice a week to see it.\n\nIt is still raining lightly.\n","6":"\nIntended going to Church but got up too late so wrote my Diary up a little instead. Had dinner then\n\nin the afternoon had a walk up to the Garede Nord, then back to the Place de la Concorde and along the Champs Elyaees. From the former all along the latter to the Arc de la Triomphe are German guns of all calibre captured by the French during the present war. They must run into thousands. Have the Breech Blocks out of them. They form a good chain to such a great avenue, although they disturb the peaceful picturesque surroundings of the locality. Thousands of people promenade this place in the Sunday. Everyone in Paris & one would\n\nnot be far out. The latest dresses & styles can be seen. It is an enjoyable walk &one does not notice the time going.\n\nAt night we went to a Cinema Show & enjoyed it. Slept well at night being tired through walking so much. However one can enjoy walking, knowing Hot baths await you & good tucker. The French do know how to cook dainties, & dishes tasty to the mouth.\n","7":"\nHad to get up at 6 am as we had to go to Place de la Concorde at 7 am to go to Fontainebleau some distance out of Paris. Caught a train which took us there in\n\nless than two hours. This place was the Home or rather Palace of many Kings and finally of Napoleon.\n\nEach have made additions in their time or have damaged it in one way or other, thus it is very interesting to one interested in such.\n\nHad dinner first in a good Hotel, after which we had a look at the Markets of Fontainebleau. It was interesting. They carry on in the same way as we do in Australia.\n\nObtained fine views of the entrance into the Palace. It is one of the most beautiful old castles in France,\n\nan ancient residence of Kings of France from Francis I to Napoleon I. The Historical incidents connected with it; such as the captivity of Pious VIIthand the abdication of Napoleon I, are innumerable. We received a lecture from the guide before entering but it is too much to rewrite that is if I could remember it all. The court yard is spacious and Historical. The Entrance of the Palace has a Horse Shoe steps and an Equestrian statue once stood in the Court Yard. It was\n\ndestroyed,& a plate now marks its site. As the Palace \ndoes\n did not open till 11amwe went round to the Huge Pond (L' Etang des Carpes) where millions of carp abound having been there for years, being of course protected. They come up to the top in swarms when bread is thrown in. They are a fine size. Leaving the carp we had our photos taken then walked down the magnificent gardens which at present are not at there best being winter. They are well planned out, but of course not on such a grand scale as Versailles.\n\nEntering the building we came to the Rooms of Napoleon. They are fitted out well but not on the grand scale as Versailles. All through the Buildings this isthe same. Each room has its owners own style and period of Architecture& furniture and it is interesting seeing the diferent stages. A lot of photos have been removed owing to the war, but are to be returned soon. The room where Napoleon signed his own Abdication is a fine room, after his signing it he went out into the Court Yard& said goodbye to his\n\nGenerals. The most magnificent& beautiful Chandeliers are the interest of his Rooms. His bedroom is magnificent. The chambers of Marie Antoinette are also very attractive and neat. The tapestry is magnificent, also the Library which has thousands of volumes of all languages in it. The Rooms of Francis I are beautiful details of which would be too numerous to write. The oval court is a feature of the Buildings, and represents the old Court Yard of thousands of years back. This portion is the oldest portion of the Palace. There are two fine\n\ndancing Halls, the floors of which are constructed of nine different woods. It is unique. The Art Galleries are by the Best Italian\ns\nArtists of that period who were given permission to renovate the Castle as they liked. The Gallery of Francis I is ideal. The rooms of Ann of Austria are magnificent. In the afternoon we caught a CharaBang to the forests of Fontainebleauwhich are the most picturesque in France. There are many charming drives through, along the Roads through the 43000 acres of Scenery. It possesses\n\na Race Course. (Meeting held once a year) also a Golf ground. The Kings etc at the castle, held many sports here, also plenty of game shooting. There are a few trees over thousand years old. (Oak, and at present near to dead). Returned to the city and had a clean up. Was just going out when I bumped three 39thBattery chaps down for fourteen days leave. I was delighted as my other impromptu mate of second div was leaving for his unit that night. Showed them a place where to get a meal, and then took them down\n\nthe main Boulevardes. Just to get acquainted with the city.\n","8":"","9":" \nUp at the usual hour of ten and had breakfast. Waited for the 39thBty mates \"Bingha\" Shaw, \"Sister\" Eales\n&\n \"Tiny\" Corbett& Roy Ashburn who had slept elsewhere for the night. Arranged to sleep at same Hotel, where I was staying, it being the most central, being near the Madeleine. Went to Pay Office (the best building in Paris) then had a strollround the Boulevardes. I acted as guide to the Party, & so led the way down the tubes& Rues. Showed them the Madeleine\n\nchurch, Place de la Concorde and the Louvre, \nand\nalso the main thoroughfares. At night we went to the Folies Bergeres. I had seen it. But one can see these over again. Had supper then turned into bed dead tired. The weather is dull& yet it is warm.\n\nWednesday 19thFebruary 1919. \nDid not leave the Hotel till 12 noon strolled down the main Boulevarde looking at the shops and people. Went to a French cafe for lunch in Montmartre. The meal was very good and two hours had elapsed. The French believe in giving you ample time between each course.\n\nThe Bill came to twelve Francs each which one thinks little of, for we do not value a Franc, yet if we had tp pay 9\/6 in Australia for a decent meal we would soon go easy. Our average meal cost 8\/- thereabouts, so living in Paris is not the cheapest at the present time. I must say that the French cook some dainty dishes. Everyone seems Happy in Paris they little worry of tomorrow from what I observe, everyone is free and easy and all look on Bright side of life. A good scheme for all the world to try. The more one sees\n\nof Paris the more he likes it. It is fascinating. Went to the Casino of Paris at night, a very good show (all French) and we enjoyed it, regardless of the fact that we could not understand all of it. The singing staging and music was all that could be desired. The Jazz Band at Interval makes everyone Happy, the way it sends out the Happy music. How could one but enjoy it. Gay Paris it is indeed.\n\nThursday 20thFebruary 1919\nUp in time to just get Breakfast, after which we went round to the Pay Office, then to Cox'sBank at opera\n\nfrom here we went to Kodaks to get my films andenlargements which turned out very good indeed.As the others had not seen the Pantheon de la Guerre, I took them across to see it. One could go to see this Painting time after time& the more realistic itwould appear. From this place we made tracks to the Invalides, Napoleon's Tomb going inside. This place is visited by the French in large numbers not to say of thousands of khaki that enter the doors daily. Passing through this Building we come into the French war museum\n\nHere one can see relics of the wars and of the present one. Fritz's guns& 'planes are in the square. Had dinner which is the feature of the day, for it is interesting to see into the Parisian's life. His customers, manners etc are alike interesting to a foreigner. Thus between courses one has ample time to look about him. They do not go in for music in the cafes. This to me seems a missing link, to finish off the Happy throng. At night went to a Theatre. The theatres are very modern in style etc, and no doubt lead the way in Europe.\n\nFriday 21stFebruary 1919. \nLeaving the Hotelabout 11AM we started out to do some shopping. Bought a few souvenirs in Rue Royale but you have to pay for the street so walked to the Arc de Triomphe from Place de la Concorde a distance of 11\/2 kilos along the most magnificent street in the world (Champs Elysees) which I have already explained. One sees things that he missed before, and no doubt fresh places of interest could be seen if you walked it daily for some period. Went into a large souvenir shop\n\nSouvenirs having been made by wounded French soldiers. There is much to make a choice from. Leaving here we made our way per tube to the Gare de Nord to arrange about a ticket for Sunday night or rather early Monday morning on the Brussels express. Went to Miss Rout the NZ nurse who looks after the Anzacs in Paris. She does great work and if it was not for her, we would have great difficulty and inconveniences coming up the line. She reserves","10":"class compartments for us, although we are forbidden\n\nto travel on the Express.(\"Officers Only\" the old old ouf ). She oils the palm of Railway Collectors & porters. One chap got over£1 per day, so that is how the trick is done. Came back to Montmartre for lunch having reserved a table. This item took over two hours. One enjoys a meal in Paris. Went to a Cinema in the afternoon to have a rest having walked a good distance in the morning. Went to a theatre at night enjoying it some. Always finish up with a good supper thus enjoying a good sleep.\n","11":"\nWent to Kodaks to get a couple of films left there at the beginning of the week. They turned out tip-top. Had a walk around the Tuileries, Rue de la Parc, Louvre and Notre-Dame. This portion of Paris is very picturesque indeed and has most of the National buildings in the area. The Seine River which flows through the city is fairly High at present, numerous barges ply up and down the stream. The number of Bridges that cross the Seine around Paris is about twenty,\n\nthey have some fine statues on them too, most of the bridges having been built by some Ruler of France. At night we had dinner at a café in Rue Pyramids. It was a good place and we enjoyed the meal. We tried to book for Opera but it was full up so went to Edward VIITheatre (French play named \"Phi-Phi\"). It is a small theatre in comparison to the others in Paris, but the furniture is the best we have seen in a play House. Everything seemed refined, even the staging was excellent. The people who attended were of a refined class; one\n\ncould not help noticing this after being at the others (excluding opera). Although we could not understand the lingo we could compree the gist of the play. All enjoyed it very much.\n","12":"\nHad a sleep in till fairly late, then went round to a place where we had booked up Horses to go for a ride on the Bois de Boulogne the Parisian's great pleasure park (or the Rotten Row of Paris). We skipped however for horses so went out per tube and foot. Walking from the Arc de Triomphe there were thousands of Parisians\n\n\n\nall in their best. It was a great sight. On the right is a track for the horses and we could see a number of poor riders although some were excellent horsemen. Had our photo taken in the Bois, some on horses the others standing at the horses head. The leisured classes generally came in the mornings, & it has become fashionable to strollin the avenue after dinner. It has an extensive forest which is under the control of the Municipality. The forest was a favourite pozy for a duel. The main avenue is Avenue des Acacias\n\nbeing 1½ miles long. Flower battles have taken place here in recent years on special occasions. At the end of this avenue is the waterfall known as La Cascade, and a fine panoramic view of the country round the Seine can be had from this position. We did not go out to the Zoological Garden which I believeis fine. The Bois de Boulogne is the pleasure resort of the Parisians in the summer time. Returned to dinner then went to a French Home for Afternoon tea through the Y.M.C.A. The people were\n\nvery nice and we had an enjoyable time. Went to see the Trocadero, which is a fine building built for the 1878 Exhibition. It is now a museum of Ethnography, and has a fine Concert Hall capable of holding 6000 people. From the terrace one has an excellent view of the Seine and gardens surrounding the Palace. Everything is so well planned out. I obtained good Photos of the place & gardens. Walked to the Big Wheel passing Eiffel Tower. The crowd at the wheel was enormous, & we had ten minutes fun pushing in the crowd.\n\nOne obtains a fine view of Paris from the wheel. It was again a little misty so could not see too good. Leaving here we went Home to the peoples place for tea. They have a light meal, so we had some at the Café after we left. This brought the time to ten and the hour that saw me saying Good bye to Paris. Slept at a Hotel near the station.\n","13":"\nUp at 6 am and it was hard to get out so early after having such an easy time. Had the French Breakfast, cocoa & roll then went over to the train getting on seats in\n\na first class carriage. The train left at 7.30 am and so Gay & beautiful Paris was left in the distance. We had a fairly good run up to the war zone, then of course travelling was slow owing to the bad state of the Railway lines. It was interesting to see the territory of the war zone in such ease as a passenger train. On coming to the Border, the customs officer came on board and examined the baggage of passengers. We camouflaged boots & material for the people in our compartment. They had enough stuff too. Paris is much cheaper\n\nthan Brussels. Arrived at the latter place about 7 pm, found a decent Hotel, then found a good cafe. Had a strole down the main Boulevards. It is fairly dull after Paris, although far better than Flavion.The streets are wide, & fine buildings are to be seen. The chief mode of travelling is tram. There are no tubes in this city. The Prices of goods are exceedingly dear. Turned in early.\n","14":"\nIntended going out to see the Field of Waterloo, but missed the early tram so had to abandon the idea. Strolled about, doing a little shopping that I had forgot in Paris.\n\nFour us went together, that had mated up during the trip. Had lunch then \"scrambled\" for a seat or rather position on the train. Eventually succeeded in getting a foothold on the balcony near the corridor. Eventually arrived at Charleroy having tea. Brussels is a fine little place, but I was not impressed much, as to it being as some chaps painted it. A glorious place. Arrived at Florennes at 8 pm and transfer Home to Flavian a distance of seven kilometres in the pitch dark through open fields, walking most of the way ankle deep in slush.\n\nOh, how I enjoyed that tramp. I dont think. Slept at the QM Store the night, not wanting to disturb the people at the place that I stay.\n","15":"\nCarried on with usual duty today. Most of the Horses have gone and all the guns & waggons. It is a strange Battery now. A large draft are going any day now. It will be slow when they do go. Not that it isn't now. Wrote up my diary and read the letters from Aussie. Was sorry to hear of Hector Hick's death. It is very cold at Flavion in comparison to down at Paris.\n","16":"\nWent into Dinant to the Paymaster on Business. Did a little shopping for a couple of chaps returning immediately. It was raining all the way in, so I was fairly wet. Obvious - I suppose you will say. Wrote letters at night turning in about 11 pm. It is wretched weather, snow sleet and rain.\n\nDeaths are fashion over in Flavion four dead in three days. One chap was murdered on the outskirts of Village for his money by some civilians. The Boys held a dance in the school at night.\n","17":"\nDid little today. Am busy getting my correspondence up to date. It will take some doing too. Still raining and dismal.\n","18":"\nAnother month started and still we are in Flavion. It makes you ask when will I get away. However this big draft goes on the fourth, and as I am first waiting man to the Battery should go very shortly. It is very cold.\n","19":"\nDid little today, but write letters and am sick of writing so much of the same thing over again.\n\nThe people were out in their best as usual, the day being Sunday and their day out. Have just been having a talk? to the people with whom I stay. They are very decent to me and are very nice people, very reserved. They did my washing specially, as I may go with this draft proceeding on the fourth; and also are making a cake for me to take on train. The one they gave me to take on train to Paris proved very useful. There is a dance on tonight but I am not going to it. Am not keen on the dances of this village.\n","20":"\nAnother Birthday spent away from Home, being the third now. Am beginning to feel quite old. However I hope to spend the next in sunny Australia & not in the land of rain wind and snow. The day passed off quietly, there is very little to do, and the village is dead. The 13th Draft men are excited, as they leave in the morning, I am first waiting man so have to pack up also; not that I have a chance of going for none will miss a chance of going home. A little different to going away.\n","21":"\nIt is a dull day. The handshakes are numerous this morning. About sixty leave this Battery, all the '15 men and a few early '16. Gave the Major three cheers as he went. He gave the men a good spin & was a sport. The one pip artist who left also, was treated with silent contempt. He was quite the opposite to the major. Just feeling his legs. The Battery is very small now about sixty remaining here. The civilians are greatly broken up at the men going, also many mademoiselles, who gave up their\n\nprevious civilian friends for the soldats, who of course played the part which suited them the best. A few marriages may have taken place had they remained longer. No less than ten letters have been sent to different chaps. One girl even followed her \"beloved\" into Charleroy . In this country if you speak to a girl a few times, she thinks you are going to marry her. There is no custom here as in Australia where a chap can have numerous girl friends, and being just friends. The Morals of most the people here from\n\nyouth to age is putrid and low. It opened my eyes & many others - We have seen a little of the world.\n\nGossiping is the chief industry in this District & throughout most of the villages in France & Belgium. One could count the square people of Flavion on your two hands. I was lucky in getting a decent Home. The Post Office people, very conservative & reserved. They never worry you with coffee all hours of the day etc, yet are always there when needed.\n\nLeaving for Paris - there was a cake for me to take - Leaving for Australia another one.\n","22":"\nIt is very dull without all the boys here. One can only read & write, and both these things become very monotonous, that invariably you will find me talking over a nice warm fire in the QM Store and thus the days go by. The weather is still wet, and no mail in.\n","23":"\nThe three lads that I was with in Paris came back today, after finishing their leave in tip top style. They like myself cannot speak too Highly of the beautiful place of Paris. A cinema is showing at\n\nnights in one of the schools, arranged by the Y.M.C.A. The films are good, breaking the monotony, but the actions of these civs, well I'm sure you would give half the fortune that you haven't got to see them. The elderly people are as bad as the kids, and it is quite obvious that none have seen a Cinema before. One picture an Australian Gazette showed sports on Mt Kosciusko, & all the diggers had told the people that there was no snow in Australia. This caused an explanation to be given.\n","24":"\nLittle happened today; every day spent here finds one getting more disgusted with the population of Favion.\n","25":"\nAt night with \"Binga\" Shaw I printed some snaps and then developed a film of Paris. The six snaps turned out excellently. I have some fine snaps of Paris.\n","26":"\nAs usual Flavion was dressed up. The day for a wonder introduced the sun for a few hours, & it was appreciated by all. Definite word came through that we move\n\ntomorrow to Falaen seven kilometres on to join the 110th How Battery.\n\nThe move will be a change, although many inconveniences will have to be put up with. One is use to such happenings now-a-days. The Civs do not like it, but they will have to do the other thing. A dance was held at night. Packed my gear up, preparatory to moving off tomorrow.\n","27":"\nI came ahead with Pink to find a decent billet for the QM Store and Orderly Room. Had great difficulty in obtaining these, as the civilians were determined\n\nnot to have any more soldiers in their homes as the parting was too great when soldiers left. At Flavion the same thing occured, none of the 11th Bde getting beds for sometime, finally they all found beds. We also dug in after much travelling in a good place on the edge of the village, Falaën by name and 7 kilometres from Flavion. Played Bridge at night till ten. Had a good supper of chips etc & then went home.\n","28":"\nDid little today, played cards most of the day. At dusk we went for a walk along the road for some distance, to see the monastry, a\n\nsight of this district. It proved too far so we are going on Sunday with the chap of the House, where we dine. Both he & his wife, & children are very nice, making us at home. They gave us good suppers, we do not like having it, feeling to much of a \"Bot\" on them of course they make us have it, so we carry on.\n","29":"1919\nIt is a lovely day, one appreciates the warmth of the sun. The next draft list came out today,I am on it. We will be going after the 17th of this month. One will not mind leaving dreary Belgium after such a long stay\n\nin the one place. Australia also looms up in the near distance now provided the strikes keep off until we embark.\n","30":"1919\nOne goes through the same routine each day. There is so little to do now that the days are long. At night we play cards for a couple of hours. Very little Australian mail is in at present. I have received only two letters of January so far. Evidently they are keeping it back for some reason or other. The days are very fine now, the sun coming out much more than usual.\n","31":"\nWrote a few letters today. Have received very few. A lot of the chaps walk into Flavion each night to see their friends. It is causing much comment amongst the Civilians here, who are great gossipers in that direction. The majority of the people in this country are very inquisitive concerning other peoples affairs.\n","32":"\nHad a game of cricket in the afternoon went for a walk about 5 pm with Pink, Charlie King & \"Butt\" to the ruins of a grand chateau which existed in the early days of the country. It has been\n\na strongly fortified place, built on a predominating position & would be impregnable in those times, the rocky hill being so precipitous. A good deal of the main walls still remains also some of the rooms in the ground, one obtains a fineview from the top, of the surrounding country. Finished up the day with cards. Bridge is a good game. One enjoys a good walk in this weather. The roads are so good.\n","33":"\nI had a cooking job this morning for the mess, for I made a date pudding, which could have turned out much more successful\n\nthan it did. However we enjoyed it, so did the people we eat with. It was a little too heavy. This fact did not prevent us from visiting a noted monastry of Belgium by name Maretsons . It is situated on a hill in the \"country\" about three kilometres from Falaen. This particular part of the country is vey undulating, so our walk at times proved to be hard walking. Sid Tunks, Charlie King, Monsieur, Madam, two youngsters and myself formed the party. The building is very fine from outside, entering into the church\n\nwhich is highly painted, yet not too much, a service for the monks was on. I don't know how men could adapt themselves to such a life as this. After much bowing etc we walked around the interior. Adjacent to the church is a school for boys of High social standing, who may follow this profession. Walked home along the Railway track, the lines having been removed by the Boche in the early days of the war. Unfortunately the sun had a day at home so I could not get a snap. Will go out there again. Played cards at night, also received a good Aust Mail.\n","34":"\nDid the usual loaf today, wrote a few letters, and played cards at night. Snowed heavily today.\n","35":"\nNothing importatnt happened today, it is a fine day plenty of sun and warmth. One gets the extremes of weather here at present. The draft will be leaving in two day or three.\n","36":"\nTo day is beautiful, plenty of sun so Pink & I went for a walk to the\n\nRuins of Chateau to take some snaps. Took six of it and some scenes near by; also took a family group of the people where we stay. There were great preparations for the event.\n","37":"\nSnowing heavily today. The day is most unpleasant. Has snowed heavily all day. Indoors is great favourite today. The draft goes tomorrow, the Brigades are moving to Mettet on Sunday, concentrating & Amalgamating into one Brigade, so finishes the Artillery units.\n","38":"\nLeft the Battery at 9 am after saying goodbye to all friends. The people where I stayed broke up, they were very nice giving us a good time. Luckily we had motor lorries to Florennes a distance of fifteen kilometres. Arriving there at 1 pm we immediately entrained for Charleroi getting there at 5 pm after a slow journey. Left out kit etc in the Huts allotted, then went out for tea in the town. Went to a Cinema-Vaudeville show at night. Slept cold and found the bed very hard too.\n","39":"\nWe did not get up till late, went out for dinner, taking our time over it for there is little to see or do in this place. Walked around the town then went to the Pictures after tea. It is very cold weather at present, snow falling most of the day.\n","40":"\nIn the morning we were inspected by General McFlagan commanding officer of the 4th Division. Was Paid then we played Billiards till tea going to another Cinema at night. We leave tomorrow for Le Havre.\n","41":"\nEntrained at 11 am leaving at 1 pm. It is very cold wet weather. Played cards or read to pass the time away. Passed through Mons during the night. Slept well, having straw a full length to strength out in.\n","42":"\nSeveral changes of guards came on the train, each one getting annoyed when he saw us in his compartment. They all got over it. Thats all they could do. During the day we came through Amiens and other smaller places. Had good\n\nfood and plenty on the way down.\n","43":"\nArrived at Le Havre2 am but did not get off till daybreak, proceeding to the base camp. Received new clothes and greatly appreciated hot shower, handed in our equipment with great pleasure. Hard to imagine that, that has actually gone. At night we went to the Y.M.C.A. Concert. This Camp has improved muchly since I was down here last time a year ago. Huts are a great asset in this wet weather, although we slept in the tents for one night.\n\nThey have Fritz's doing the work so one has an easy time altogether.\n","44":"\nMoved over to Huts today. It is very cold and has been raining heavily all the morning. Wrote a few letters and played cards for a while. At night went to a concert. We expect to move off to England anytime.\n","45":"\nIssued with new clothing in morning. Met \"Chips\" Woods a mate of mine on board Port Sydney & in Heytesbury Camp. Went to the Cinema and band concert at night. Another draft came in today.\n","46":"\nIn the afternoon with \"Chips\" Wood. I went to the residential portion of Le Havreby name Saint Addresse. It is the sea side Resort of the port, has a fine promenade, nice villa's & Hotels. A fine panoramic view of Le Havrecan be obtained from these heights. I took a few photos. Met Bob Mitchell in same camp as I am in, he is on draft 21. Had a yarn to him. He looks much the same, having altered very little since when I last saw him. Also met Cecil Lee who is on same\n\ndraft as I am. He is in the Engineers.\n","47":"\nWent to a football match with Bob Mitchell. Saw Bob Forsyth also out there, he is on draft 21 the same as Bob Mitchell. We saw the match then strolled around having a fine old talk. Played a game of Billiards with \"Chips\" having tea then finished the night reading.\n","48":"\nReceived new clothing for old today. Met Tom Nelson having a long talk to him. Also had a yarn to Bob Forsyth, thus the morning went quickly. Had an early tea leaving\n\nat 3.30 pm per motor lorry for the ship. Much better than walking as we just had to step off the lorry onto the channel boat \"St David\" by name. Slept on the top deck; being crowded we slept fairly\n","49":"\nwarm, arrived at Southampton about 1 am having a smooth voyage, no one being sick. Disembarked at 8 am, having a breakfast. Entrained and came onto Fovant going to Noir Camp. The previous draft men are just coming back from leave after having a good time. Put into huts rather spacious but warm. Went to a Concert at night. It is rather cold today snowing a little.\n","50":"1919\nReceived a new issue of clothes prior to going on leave. Look somewhat decent now. Had a walk in afternoon down to the village.\n","51":"\nInoculated again against Para-Typhoid had a talk with some of the Battery chaps who left before our draft. They are just back from leave. On Friday we were issued with more clothing. Have now more than we ever had. Prepared to go on leave in the morning. So turned in early. Am going to Ireland for my leave.\n","52":"\n\"Reveille\" went at 3.30 am, having breakfast and the usual military mess up before we finally left Fovant at 8.30 am for London which place we arrived at after noon. With Tom McCourt & his cousin we went to Headquarters, had a few colours sewn on by the \"elite\" of Horseferry Road; otherwise known as Jews. Strolled around in the afternoon doing a little shopping. Obtained a room at some private residence known by Tom & we were well dugin during\n\nour stay in London. Did a good dinner at night, then had a walk home via Piccadilly, Trafalgar Square & Charing Cross.\n","53":"\nHad a good rest in bed, then got up for lunch. Had a walk around most of the streets in LondonI think, for I was tired before the afternoon was over. Met J Humberta who use to be on the Karoola. He had a leg off, & is proceeding back to Australia in a few days. Met several other chaps I know & so the afternoon was spent. Had a run out to Hampstead Heath in a bus\n\nbefore dinner. London seems very dead and unattractive now. Everyone seems to be getting about as if they had no fixed destination & had the expression of being fed up completely.\n","54":"\nMonday, up and did the shopping that kept me over the weekend in London, namely to go to Kodaks. Left by the 8.20 for Dublin. Arrived at Holyhead at 2 am, the boat as usual was crowded. The sea however was calm so we arrived in Dublin at 7 am on\n\nTuesday morning","55":"\nMet a couple of chaps from the same hut so we went around together. We walked around the town, doing a little buying. I sent home a couple of Blackthorn walking sticks. In the afternoon I went out to see Uncle Johnny but he had left the address, so I had to return, went to the station to get the 3 pm train up North but missed it by two minutes. Got a bed at same Hotel as the others. Met Charlie King who had been down at Killarney Lakes. Had lunch with him. He thinks the\n\nlakes are fine. Took a few snaps of some of the town, then we went to a theatre which was not too bad. Had quite an enjoyable day, Dublin seems to be much better than London to me.\n","56":"\nLeft by the 9 am train for Dromore. Had a good run up arriving at Dromore at 1 pm. Aunt Alice & Colie were there to meet me with the car. They are looking very well. Uncle is fishing at Lake Melvin having caught two salmon. It is a good eating fish when fresh\n\na much paler colour than when in tins. The weight of it was 8¼ lbs. After lunch we motored down to the village, seeing Uncle Jim & the Marshall brothers. The village is just the same. Uncle Jim is looking very thin, he is overworked, & does about thirty miles on a push bicycle each day. He sold his car & will not get another one. Lakemount is looking much greener than when I last saw it, otherwise it has not altered. Uncle will be home in a day or two.\n","57":"\nDid a little weeding in the garden in the morning. It is a nice day. Uncle came home by the midday train. After lunch we motored into the country some thirty miles having tea on the track which I enjoyed muchly. The scenery is very picturesque around these mountains. I took the stearing wheel coming home, Colie teaching me how to drive. The roads are very narrow and have numerous sharp turns in them. Played 500 at night. They are eager to learn how to play it.\n","58":"\nPrimroses are out along the Hedges in large numbers, they are very pretty; with the Hedge just coming out in bud & some in Blossom. Uncle, Colie & self walked into Dromore. It was a dull day, rain being about. Saw Uncle Jim & did the shopping. It is a three mile walk into the village from \"Lakemount\". Saw the famous pump that my father did when he was here. It would be some distance across the pond. Went out shooting rabbits at night or rather at dusk. Played cards at night.It is Raining again.\n","59":"\nIt is a sunny day so I took some photos in the morning about the House and plantation. We left about noon for Omagh to do all the week's shopping, but half way to Furton Junction the car refused to go over the hills so we had to pull up. Colie & I tried to pursuade it to go, but with out success. I obtained a bicycle and went into the town three miles away to get some new plugs and a few other things. Rain came on & the wind scarcely let me push\n\nthe bicycle down Hills. It was some ride against such weather. I was about finished by the time I arrived back. The car refused to go satisfactorly even now, so Uncle & I walked back to Lakemount to get Sam to take a horse back. They arrived home about two hours later, fed up with car & all. Played cards at night.\n","60":"\nNone felt like going to church & I did not pursuade them at all, so Aunt, Colie & self went out for a walk gathering Primroses along the Hedges. The country is looking\n\nlovely at present, it is much better than when I saw it before. Summer time here would be most enjoyable. Uncle & self went out shooting Rabbits at dusk. Did not get any. They are not so plentiful.\n","61":"\nIn the morning did a little gardening to pass the time away. Uncle & I went to Omagh by train at 1 pm. Aunt & Colie came down for a walk. Omagh is the county town of Tyrone and has a population of about 4000. It has a few large streets. All the people come here to do their shopping. Had\n\nlunch at Uncle's club then did the business. Came home by the 6 pm train. At night we played cards, which passes the time away very quickly. Uncle does not like getting beat.\n","62":"\nIt is a very windy wet day. Cleared up a little so we walked into Dromore to see Uncle Jim. In the afternoon we did gardening. The motor left for garage today & will be back tomorrow as we are going out on an all day trip on Thursday. Played cards at night. One appreciates a little home life after all the time\n\naway from such.\n","63":"\nSam took a Hay stack down this morning so the dogs had a great feed of mice & play. Played a game of quoits. Car came back so we took it out for a spin. I am some driver now, Colie just has to sit back. I dont think she minds. Aunt was afraid of my driving for a while.\n","64":"\nWe all got up early this morning having an early breakfast & leaving for Bundoran at 10 am, the weather\n\nwas dull but showed signs of clearing up. Consulted Uncle Jim & he said it would clear up by noon, so we went on. We passed through some beautiful country, went alongside the banks of Lake Erne which is a large lake, studded with little picturesque islands. Motor trips are run in the summer along the lakes. Came into Belleck where a cattle fair was in progress. The main street was crowded with cattle & their owners & prospective buyers. A Sinn Fein crowd to a man. They almost refused to get out of the road or to\n\nlet the car pass. Many scowls were given us, but as long as we got through was the main thing. Arrived at 1 pm, having dinner. Had a talk with an old friend of Uncle's who use to drive him to the lakes years ago. He was gifted with a fluent tongue. Walked around the cliffs & shores to Ballyshannon about six miles. Took a few snaps. Came back home via Lake Melvin & Lakes Macnean, having tea at the former place. I drove most of the way home arriving with just sufficient petrol at 9 pm after having\n\na most enjoyable day. The weather had cleared up as predicted.\n","65":"\nThe car being dirty Colie & I washed it, so as we would have a decent car to go out in. The boy cleaned it before & wet the engine. Went to Mount Grenan in afternoon, calling for Uncle Jim whowith Uncle Charlie took their fishing Rodsto fish in a stream close by. They caught one small trout between them. Had a puncture, so the mechanic fixed it up \"toot sweet\". Had a real enjoyable day.\n","66":"\nMy leave is up today but I am having a few days over, having such a good time. We went to Omagh at 10 am via Dromore this time as we still have recollections of the Finton Junction breakdown. Omagh was very busy as Saturday is market day. Had some films developed there with a bad result. He spoilt a film. Returned home at 2 pm just as the rain commenced. Did a little shooting in evening. Played Cards till late. Uncle is having luck now so is contented.\n","67":"\nIt is an excellent day, so we went to church, then down to see Uncle Jim. The Sinn Feiners were out in large numbers, and marched through the town with a band & numbers of flags flying. Green, white & yellow. . Played in front of Presbyterian & C of E Churches. It was great music indeed. Uncle Jim came home with us to Dinner. In afternoon we played Quoits on the lawn and at dusk, went out shooting. I got two rabbits of fair size. Had a walk around the land, & all\n\nweighed. Colie & Uncle Charlie had a bet that, Colie was heavy as he. He lost by being the heavier by eight pounds. I was the heaviest in the crowd. Put in a pleasant evening with music and having a great argument on Ireland verus Australia. The odds were too great so I gave in.\n","68":"\nIt was a beautiful day, so dug in the garden for a while, even Uncle did a little. Printed some photos, and at 2 pm went for a motor drive into the country. Harry Marshall came with us as Uncles' had to go to\n\n\n\nthe vestry. It was lovely driving in such beautiful weather, with country looking so fresh. Had tea on the roadside, coming back about 7 pm. Uncle Jim came back also, & he took a hand at cards having all the luck. Said goodbye to him as I leave in morning. I like him very much.\n","69":"\nTook a few snaps, & said Goodbye to Lakemount, we left for the 1 pm. Uncle coming as far as Bundoran Junction as he is going down to Melvin to get some more salmon, if he can,\n\nhe is a great fisherman & game shooter. The train was crowded. I did not like leaving Lakemount somehow, after having such a good time. However all good things come to an end so by 5 pm I was talking to Uncle Johnny on the Dublin platform. He is looking very well & is a hard case. Had two hours talk to him before the train left. Would have liked to stay longer, but thought I had had a fair leave, being four days over. The boat was crowded at Kingston many hundreds being turned away\n\nI was fortunate.\n","70":"\nArrived at Euston 7am very tired indeed, the train was crowded the whole distance. Had a clean up & then went to Kodaks' to do some business. Walked around the streets for awhile but did not see anyone that I knew. Went out to Maiden Hill to get my Kit. Had dinner catching the train to Hardcott, & arriving at camp about 11pm. It is some walk from the station to the camp over four miles. So I slept well despite the hard floor & rough blankets.\n","71":"\nHanded my pass in and I do not think that they know I was absent. Have a Medical Certificate if there is any questions. Am on Guard tonight, they do not give one much time to think of it. Received many letters from Australia.\n","72":" to","73":" '19\nDuring this period of time in camp time has passed slowly but quickly, for as you look ahead time seems to go slow, yet on looking back on the few weeks that have just passed time has gone quickly, perhaps the leave made agood break.\n\nHaving had very little to do, in fact nothing, reading became a prominent pass time or kill-time. As one could not read all the time, cards became favourite, especially at night when the light is too dim to read by. From 4pm till 8pm we generally use to strole along the country roads, and enjoy the freshness of the foliage, which one thinks he sees growing every day. Spring is very late this year. Had a heavy snow storm about the end of April. Rather unusual for that time of the year.\n\nThe English Lanes hedges etc are not what the writers of books imagine them. I have never seen ditches that play such a prominent part in many good books, & summing the whole outfit up, the country roads etc are nothing out of the ordinary. The old thatched roofs are quaint. Went to a few concerts in camps, visited Salisbury the other day. It is a large place in fact a city. The noted building is the fine cathedral which is hundreds of years old of Gothic Architecture. Did shopping necessary for the trip\n\nwent to a play \"Man who stayed at Home\", it was rather good for Salisbury. We are busy packing up today the","74":"May as we leave tonight for the ship. Did not leave tonight. Leaving early in the morning.\n\nMonady","75":"\nLeaving at 8am we moved off to Fovanta distance of a few miles. The Quota's Band made the march much easier. Train left at 9am and we arrived at Exeter at 1pm having light refreshments, which were very acceptable. Arrived at Devonport about 3pm after an\n\nenjoyable trip through the beautiful County of Devon. It is certainly the best country that I have seen in England or Ireland. Train pulled down to boat \"Port Napier\" which is a cargo boat of about 10,000 tons. Has very little cargo on board so is High out of water. The Battle ships Resolution & Revenge are alongside us. They are the largest battleships in the Navy and latest off the stocks. They are huge powerful ships, having eight fifteen inch guns on board and about sixteen six inch guns. One could look at them all day &\n\nstill find something new or interesting to see. There were many of this type in the Harbour, also many smaller craft. One realizes a little how immense the British Navy really is. Issued with Hammocks & turned in. It was certainly a tight squeeze. Have one troop deck and about 1400 in it.\n","76":"\nThey have split us into states, so have been separated from many mates - However there are a few of us still together. Took a few snaps of the warships. Pulled out at noon into stream the Blue Jackets giving us a Royal\n\nsend off, as we passed each ship. A very fine spectacle indeed. We of course returned the salute. Devonport is a fine city and has a nice harbour. Pulled out to sea at 3.30pm. It is a little windy, although the sun is up and it is a beautiful day so one leaves England with a good impression of the country's weather, also one sees the last of the \"Old Country\" for some time at least. None seem to be sorry nor glad. At sea it is calm with a strong head wind. Very few are sick. The band played a few selections in the evening.\n","77":"\nWe lead a very lazy life on board having nothing to do in the way of fatigues or drill; so one just reads all day. I printed a few snaps during the morning. It is great sitting in the sun; all over the deck you see nothing but chaps sun bathing. The ship has little deck space being a cargo boat, so we are crowded. The troop deck is very large. To hear the noise of the various gamblers at their games you would think about 10,000 people were on board.\n","78":"\nIt is cloudy today, the vessel is doing about 300 miles per day, which is good for a troopship. The food on board is very good and there is little to growl about, a rather unique kind of affairs for troops. Officers have altered lately for the better, of course some were always good, particularly Infantry officers. Passed land today, coast of Portugal. The weather is tip top today, one enjoys the evenings cool and refreshing, and all is so peaceful; the ship gliding through the water\n\nso noiselessly & stately, & the band giving a few favourite tunes.\n","79":"\nIt is much hotter today and very calm. Did some more printing and the rest of the day was sun bathing on the deck. There are six of the 39th Battery on board; and that is about all I know; except a few Mascot chaps. Things are very monotonous on board. The YMCA have a library on board but the books are not much good.\n","80":"\nHada boat alarm today, but not too many went up on it, much to the\n\ndisgust of the officers. Read most of day and fixed the prints. The band gave a few selections. At night we all four of us had a yarn, chiefly of Paris and the other places. Slept up on deck as it is getting hot between decks. Passed a French ship at dusk (Rather a strange thing you say but nevertheless it shows how dearth is the news).\n","81":"\nHave a following wind which adds to the speed of the ship. Came insight of land about 8am and seem to be making for it - Arrived at the Canary Islands about 11am coming\n\nup close to Teneriffe but not stopping. The ship steamed slowly along the town and port which runs along the coast for some distance. The port is some few miles from the town and had a good deal of shipping in it. The town is large and similar to other places in these regions. Has some fine buildings indeed, various colours make the town look quite different to what it is.\n\nMountains leapt up immediately behind the town and appears to be a barren waste. A few orders were signalled then we proceeded on with our voyage leaving land on the horizon\n\na couple of hours later. It was a beautiful day indeed, with the blue sky, cool breeze and hot sun. Had a following wind. The ship is averaging about 300 miles per day about 12½ to 13 knots per Hour. Had a good read and a sun bath from which I am now suffering some.\n\nHad a church service at 10.30am and a sing song in the evening. Slept up on deck again.\n","82":"\nAnother fineday indeed. Little happened today. Reading is the pasttime, lying in the shade\n\nwith a cooing breeze blowing on one. The sun is direct over head today. We passed the Tropic of Cancer sometime today. The band gave a few selections at night.\n","83":"\nVery little happened today. Was inoculated for the 599th time today. I believe it is for the 'flu. One is getting accustomed to the proding of needle in the arm that you take it as a matter of course. Had a game of cards at night till 10pm when we turned in. The sea is very calm indeed.\n","84":"\nHad a blanket & Hammock inspection as they are a few hundred blankets short. They got a good few. Fixed a few prints in the afternoon, but the water was too warm so they took a long time to dry & are very soft indeed. One kind of paper is very poor. Had a few tug-o-war contests between each Company.\n","85":"\nIt is very hot indeed and rather too warm to sun bath in. We are doing about 298 miles\n\nper day having had favourable weather. Had sparring bouts in the evening followed by a Band Recital. Came on heavy showers during night.\n","86":"\nLittle happened today, still lovely warm weather. Had a concert at night which was held on the forward deck near the Bridge, the night being windy little could be heard. The staging was all that could be desired in fact J C Williamson Ltd staging managers would have envied the effect.\n","87":"\nWashed the deck down with others of our table. We all enjoyed it, as it broke the monotony somewhat. At night the Boxing Tournament was held when several interesting bouts took place. A full House was recorded even some enthusiasts climbed the mast, others, hung on outside the ships rails.The band gave a few items. Passed over the line at 11.30am. No bump was reported so all the risks are now over. It is a lovely day. Passed a fair size ship.\n","88":"\nIt is a lovely fresh morning, that makes one think that he is at sea? However the sun came up with all its fierceness & the shelter of boats etc were rushed. Had fire alarm rather an old game now. Went to church at 10.30am he is not a bad Padre. Took a few snaps on deck. Have run into a head sea & wind so thus the terrific rate of the ship will be somewhat hindered.\n","89":"\nRead most of the day; at night the Boxing Tournament was concluded.\n\nShip did 272 miles rather slow for sure. We are having good weather up to date.\n","90":"\nA Quoits tournament took place today. It is still fine weather and much cooler especially at nights. The band gave a few selections. Played cards at night.\n","91":"\nStill have good weather. Was Payed today. The ship is doing about 287 miles each day. We expect to get in about Monday.\n","92":" to","93":"\nThese days passed slowly, &\n\nuneventful. Ran into calm weather on Sunday. The weather is much colder now.\n","94":"\nCame insight of land early in the morning and neared Cape Town about 10am. The day was fine so we had an excellent view of Table Mountain and Lion's Head which rise immediately behind the town forming a back ground of much grandeur and magnificence. The height of the former is about 3850 feet & that of the latter 2180 ft. Pulled into the wharf alongside the S.S. \"Borda\" another troopship. In all there are four troopships in the harbour which is rather small for the size of\n\nthe town. The population is about 92,000 white & 94,000 coloured persons. Once alongside the wharf coaling operations commenced immediately. We were given leave from 3pm till midnight. Went off with Tom McCourt & \"Mac\", walking into the town a distance of about one mile. The town has some fine streets and buildings. The Pier is a fine piece of work and has a fine promenade with an amusement Hall at the end of it. We took a tramway trip to Camps Bay which takes one around through the residential portion of this town & a good distance up the mountain from\n\nwhere you could obtain an excellent view of the town below. Camps Bay is a seaside resort, having a promenade and baths. At Sea Point there is a fairly large suburb. One enjoyed a good meal after the monotonous food on board. Had a strole along the main street & onto the Pier where a Carnival Ball was in progress. There was a preponderance of Khaki in attendance. After several walks up and down the town we came home. Bob Forsyth came on board to see me he is on the \"Borda\" which is alongside. The people are given the chaps a fair spin. There are about 5000 troops on leave at present.\n","95":"\nCommenced leave at 10am. Bob Forsyth coming with us. The troops from the SS Borda had a march through the town in the morning. We went out to Cecil Rhode's Home in the morning, which is about an hours run from the town. It is a fine Home and has fine gardens and grounds around it, also a zoological garden. He left the Home to the Country, & the Premier lives there when in town. Looked around the town the rest of the day taking some snaps while the sun was out. The weather is rather cloudy today. The coloured people are\n\nnumerous and seem to have the same privileges as the white race. At night we went to the pictures. The city was in darkness for awhile owing to the power House failing. Came home very tired.\n","96":"\nThe family boat left at 8am the \"Borda\" following an hour later. It is raining fairly heavy today & windy so they will strike a rough sea in all probability. Owing to the rain we did not go off the boat till about noon. Walked slowly up to the town having no fixed destination ahead. After lunch we visited the Botanical Gardens and a few public buildings. The gardens\n\nare small also the Art Gallery and Museum, Parliament House is a fair sized place. Walked down Adderley Street to the pier. After tea we had a look at a Cinema Show. Most of the troops have seen enough of this town, it being a very small place, to the number of troops in it at this time.\n","97":" to","98":"","99":" morning found us leaving with the next port of call Australia. How hard to realize. However we will soon fully take a tumble that we are actually in it. Had a\n\nstrong following sea immediately we left port which made the old tub roll at a rather noticeable angle, and at the same time causing the mess orderlies much anxiety. Ran into a strong head wind when a day out which made a difference in the speed of the ship. We have been doing about 11 knots per hour, so should eventually reach Australia within a month or two. The boat is as nearly as slow as the concert party who have only given one concert (officers) since leaving Devonport. Sunday Services were held as usual. To pass the\n\ntime we read or play cards, even this becomes monotonous too. We had a little wet weather for a day or two. The days pass very slowly and the weather more miserable; rain & strong winds make troop life very dull, as one is forced to stay down on the troop deck, the decks being too wet. Thus reading and playing cards is carried on with more enthusiasum. A concert was held, which turned out much better than the former. The Band gives some excellent entertainments which are muchly appreciated by the \"Napierianites\".\n\nThe weather despite the wind is warm for thispart of the globe and season. The ship is doing about 280 miles per day so we should be in Aussie soon. The General Strike came as a great surprise to all on board & we hope that ere we arrive in port it will have been settled satisfactorily. Have had a few sing songs, and have developed a few more films all turning out good. The Albatrosses follow us each day with gracefulness of wing, that they alone seem only capable of attaining. Saturday night the","100":" we had a Bag Pipe Concert which was very good.\n","101":" we had the usual services. The Padre is a very slow fellow, thus the life on board is slow, as it generally rests with the Padre to organise sports & amusements. The chaps delight to tease him for he \"bites\". The same applies to the Adjutant, who receives, much humour from the Diggers at his own expense. Have a good following sea which helps the ship on. Received issue of Red Cross stuff. The Australian Comforts Fund has a great name with the Diggers. Y.M.C.A. the contrary. It is bitterly cold& windy. Had a sunny\n\nday on the","102":" Kit Bags were up again. Did some printing, but it is slow work. Have numerous walks to keep one fit. Nothing eventful has happened to relate. The ship is going very slowly about 270 per day.\n\nOn","103":" we arrived at Fremantle early in the morning, and went through the usual medical formalities; being a \"clean ship\" we were given leave. Many people were down to see friendson board. With a couple of chaps we went up to Perth. Had a ride out to Victoria Park which is not very exciting. Had tea then\n\ncame back to Fremantle having a look round that town. Both are small. Perth is very pretty, and is about the size of Orange.\n","104":"\nHad leave again today. Most of the troops went to Perth. The Hotels were opened for a trial today, the usual custom being to close them when troopships are in. I do not think that the trial was very successful. Wet weather did not improve the leave. Put the day in at Cinema Shows & having decent food. Little sleep was to be had at night, for between drunks & the winch, the noise was\n\nlike a barrage falling.\n","105":"\nUnloading was finished at noon, when we pulled out in calm weather but wet making for Adelaide. There are many sorrow for themselves this morning. Received a couple of letters from Sydney. The ship is well out of the water, so should be able to do more than the usual twelve knots. Nothing eventful happened during the few days to Adelaide.\n\nArrived at that place on Sunday","106":" instant) morning and after the medical inspection the ship pulled into the outer harbour. Here many peopleawaited thedis-\n\nembarkation of the South Australians numbering in all about 250. It was interesting watching the excited people and the way they welcomed the chaps home. Many laughable incidents were witnessed from the boat. As soon as the South Australians were off, we were given leave until midnight the boat leaving at that time. With two mates we walked to Port Adelaide about eight miles. It was a fine day so we did not notice the distance so much. The reason for the walking was that owing to the strike, & shortage of coal, trains & trams are stopped on Sundays.\n\nOn arriving in Port Adelaide, we looked for a café but had no luck, so intended returning to the ship, but we luckily came upon a notice that a \"Charabang\" would be running to Adelaide. Taking this car we went to town, a distance of six miles along a very straight road. The gum trees have been used as an avenue along this road, & beautifies the street. It is the first avenue I have seen in Australia made by the gum. Arrived at Adelaide and walked around the main streets which are very wide. Took a few snaps between the showers. It is a very\n\npretty place, and in time will be a large beautiful city. Being Sunday the place was very quiet although many people were about. Had a good meal which was a welcome break from the ship food. Not many of the \"Port Napier\" came up, as the walk was rather a long one. However I am glad I have seen this capital. North Adelaide is the residential quarter, but we did not go up that way, having little time. Returned to Port Adelaide about 9pm and luckily made up with the crew of the tug to take us back to the ship as they had to\n\ngo up to pull us out. It was a very acceptable offer as no one wished to walk the eight miles in slush & uncertain of the track home. It took about an hour to get to the old tub. In all we had an enjoyable day, and satisfied at being able to see the capital despite the shortage of coal. The Captain refused to go out at midnight owing to the bay being shallow. We left on","107":" keeping insight of land for sometime. Spencer's Gulf is about eighty miles in length. It is very cold on deck. The coast around the Port is very low lying although the capital\n\nis in the hills which are immediately in the background.\n","108":"\nHad a race with the SS \"Nestor\" to the Heads at Port Philip and the finish was rather exciting we winning by about one mile. We had a few hours start from Adelaide the \"Port Napier\" did about 14½ Knots per hour rather a record for the trip. All the engineers were down in the stoke hold. Stayed at the Quarantine Station till noon on the 2ndwhen after all the medical inspections we moved up to the New Wharf. Victorians and Tasmanians disembarked. The\n\nremainder on board, transhipped to the \"Nestor\" alongside. This is a large ship 14500 tons & rather fast. We were allotted to the end the ship is rather dirty. Had leave till midnight. Went into town & after Dinner strolled around until we were tired then returned to the boat, which left at 5am on the 3rd.Went through another medical inspection, a matter of having your temperature taken. It is a fine ship & has numerous decks. The saloon is rather luxuriously fitted up. They had a dance at\n\nnight. The weather is very cold & windy. Came insight of Macquarie Light about 4am. On board everything was in a hustle, each doing his little to be ready to disembark. It was a great feeling to know that we had entered \nthe\n port of the world (to us at anyrate) and would soon be with those who are near & dear to us. Pulled into Woolloomooloo Bay & proceeded from the ship to Anzac Buffet by car, where we were again united to our relatives from whom we had been separated so long. With the excitement of \"Welcome Home\" over, we turn our thoughts from Khaki to that of our former life, determined\n\nto make up the lost years of our Commercial career, by putting our shoulder to the wheel of time, letting no time slip by with nothing done. With this resolution in view we don our civilian clothes and thus cease to be a soldier, being again free to think & do as you like, without the dominating hand of militarismbeing able to interfere with you. And so end my Diary.\n\n"}}