{"Document Name":{"0":"Diary_0158","1":"Diary_0158","2":"Diary_0158","3":"Diary_0158","4":"Diary_0158","5":"Diary_0158","6":"Diary_0158","7":"Diary_0158","8":"Diary_0158","9":"Diary_0158","10":"Diary_0158","11":"Diary_0158","12":"Diary_0158","13":"Diary_0158","14":"Diary_0158","15":"Diary_0158","16":"Diary_0158","17":"Diary_0158","18":"Diary_0158","19":"Diary_0158","20":"Diary_0158","21":"Diary_0158","22":"Diary_0158","23":"Diary_0158","24":"Diary_0158","25":"Diary_0158","26":"Diary_0158","27":"Diary_0158","28":"Diary_0158","29":"Diary_0158","30":"Diary_0158","31":"Diary_0158","32":"Diary_0158","33":"Diary_0158","34":"Diary_0158","35":"Diary_0158","36":"Diary_0158","37":"Diary_0158","38":"Diary_0158","39":"Diary_0158","40":"Diary_0158","41":"Diary_0158","42":"Diary_0158","43":"Diary_0158","44":"Diary_0158","45":"Diary_0158","46":"Diary_0158","47":"Diary_0158","48":"Diary_0158","49":"Diary_0158","50":"Diary_0158","51":"Diary_0158","52":"Diary_0158","53":"Diary_0158","54":"Diary_0158","55":"Diary_0158","56":"Diary_0158","57":"Diary_0158","58":"Diary_0158","59":"Diary_0158","60":"Diary_0158","61":"Diary_0158","62":"Diary_0158","63":"Diary_0158","64":"Diary_0158","65":"Diary_0158","66":"Diary_0158","67":"Diary_0158","68":"Diary_0158","69":"Diary_0158","70":"Diary_0158","71":"Diary_0158","72":"Diary_0158","73":"Diary_0158","74":"Diary_0158","75":"Diary_0158","76":"Diary_0158","77":"Diary_0158","78":"Diary_0158","79":"Diary_0158","80":"Diary_0158","81":"Diary_0158","82":"Diary_0158","83":"Diary_0158","84":"Diary_0158","85":"Diary_0158","86":"Diary_0158","87":"Diary_0158","88":"Diary_0158","89":"Diary_0158","90":"Diary_0158","91":"Diary_0158","92":"Diary_0158","93":"Diary_0158","94":"Diary_0158","95":"Diary_0158","96":"Diary_0158","97":"Diary_0158","98":"Diary_0158","99":"Diary_0158","100":"Diary_0158","101":"Diary_0158","102":"Diary_0158","103":"Diary_0158","104":"Diary_0158","105":"Diary_0158","106":"Diary_0158","107":"Diary_0158","108":"Diary_0158","109":"Diary_0158","110":"Diary_0158","111":"Diary_0158","112":"Diary_0158","113":"Diary_0158","114":"Diary_0158","115":"Diary_0158","116":"Diary_0158","117":"Diary_0158","118":"Diary_0158","119":"Diary_0158","120":"Diary_0158","121":"Diary_0158","122":"Diary_0158","123":"Diary_0158","124":"Diary_0158","125":"Diary_0158","126":"Diary_0158","127":"Diary_0158","128":"Diary_0158","129":"Diary_0158","130":"Diary_0158","131":"Diary_0158","132":"Diary_0158","133":"Diary_0158","134":"Diary_0158","135":"Diary_0158","136":"Diary_0158","137":"Diary_0158","138":"Diary_0158","139":"Diary_0158","140":"Diary_0158","141":"Diary_0158","142":"Diary_0158","143":"Diary_0158","144":"Diary_0158","145":"Diary_0158","146":"Diary_0158","147":"Diary_0158","148":"Diary_0158","149":"Diary_0158","150":"Diary_0158","151":"Diary_0158","152":"Diary_0158","153":"Diary_0158","154":"Diary_0158","155":"Diary_0158","156":"Diary_0158","157":"Diary_0158","158":"Diary_0158","159":"Diary_0158","160":"Diary_0158","161":"Diary_0158","162":"Diary_0158","163":"Diary_0158","164":"Diary_0158","165":"Diary_0158","166":"Diary_0158","167":"Diary_0158","168":"Diary_0158"},"Date":{"0":"unknown","1":1488.0,"2":1489.0,"3":1491.0,"4":1495.0,"5":1502.0,"6":1503.0,"7":1504.0,"8":1505.0,"9":1506.0,"10":1507.0,"11":1508.0,"12":1509.0,"13":1510.0,"14":1511.0,"15":1512.0,"16":1513.0,"17":1514.0,"18":1515.0,"19":1518.0,"20":1519.0,"21":1520.0,"22":1521.0,"23":1522.0,"24":1523.0,"25":1525.0,"26":1526.0,"27":1527.0,"28":1528.0,"29":1529.0,"30":1530.0,"31":1531.0,"32":1532.0,"33":1533.0,"34":1534.0,"35":1535.0,"36":1536.0,"37":1537.0,"38":1539.0,"39":1540.0,"40":1541.0,"41":1542.0,"42":1543.0,"43":1546.0,"44":1550.0,"45":1551.0,"46":1552.0,"47":1553.0,"48":1554.0,"49":1557.0,"50":1559.0,"51":1560.0,"52":1561.0,"53":1572.0,"54":1573.0,"55":1575.0,"56":1576.0,"57":1577.0,"58":1581.0,"59":1582.0,"60":1583.0,"61":1584.0,"62":1585.0,"63":1586.0,"64":1587.0,"65":1588.0,"66":1589.0,"67":1590.0,"68":1591.0,"69":1592.0,"70":1593.0,"71":1594.0,"72":1595.0,"73":1596.0,"74":1597.0,"75":1598.0,"76":1599.0,"77":1600.0,"78":1601.0,"79":1602.0,"80":1603.0,"81":1604.0,"82":1605.0,"83":1606.0,"84":1607.0,"85":1608.0,"86":1609.0,"87":1610.0,"88":1612.0,"89":1613.0,"90":1614.0,"91":1615.0,"92":1616.0,"93":1617.0,"94":1618.0,"95":1619.0,"96":1620.0,"97":1621.0,"98":1622.0,"99":1623.0,"100":1624.0,"101":1625.0,"102":1626.0,"103":1627.0,"104":1628.0,"105":1629.0,"106":1630.0,"107":1631.0,"108":1632.0,"109":1633.0,"110":1634.0,"111":1635.0,"112":1636.0,"113":1637.0,"114":1638.0,"115":1639.0,"116":1640.0,"117":1641.0,"118":1642.0,"119":1643.0,"120":1644.0,"121":1645.0,"122":1646.0,"123":1647.0,"124":1648.0,"125":1649.0,"126":1650.0,"127":1651.0,"128":1653.0,"129":1654.0,"130":1655.0,"131":1656.0,"132":1657.0,"133":1658.0,"134":1659.0,"135":1660.0,"136":1661.0,"137":1662.0,"138":1663.0,"139":1664.0,"140":1665.0,"141":1666.0,"142":1667.0,"143":1668.0,"144":1669.0,"145":1670.0,"146":1671.0,"147":1672.0,"148":1674.0,"149":1675.0,"150":1676.0,"151":1677.0,"152":1678.0,"153":1679.0,"154":1680.0,"155":1681.0,"156":1682.0,"157":1683.0,"158":1684.0,"159":1685.0,"160":1686.0,"161":1687.0,"162":1688.0,"163":1689.0,"164":1690.0,"165":1691.0,"166":1692.0,"167":1693.0,"168":1694.0},"Entry":{"0":"\n\n","1":" New Year’s Day –\n\nA Happy, Bright & Peaceful New Year to friends & enemies – Our Hall graced by the Gen. Sir Wm Birdwood who shakes with one & all after the show and is mighty pleased with his Concert Party – General Coxon also present.\n","2":"\n\nTwo Australian Letters received. A strange coincidence concerning one – Our Panto has a most disastrous ending this evening – A fire takes place in the engine room & two engineers are badly burned\n\n \n\nJan.3rd (14)\n\nNews of Herb Marl Hammy & Fred being in England – Engine again fails during the Panto. – Letter No.14 written – \"A pin that was missing during a juggling act.\"\n","3":"\n\nLetters to Home & Scotland.\n\nJan.5th\n\nLast show in Sheenwerck -. Most successful night of Panto – English troops now in Sheenwerck –Anzacs depart. Again meet Mr. Hewett.\n\nJan.6th\n\nFatigue duties at Theatre – Preparing for departure from Sheenwerck – Cyril & self have most enjoyable stroll to Bac.St & are entertained by friends made early in \"1916\" – Stopped \"en route\" by a guard, & we overcame the difficulty.\n\nJan.7th\n\nOur advance party leaves for Bailleul with Panto. Props & scenery.- \n\nGermans Peace conference unsuccessful owing to non-appearance of Russian Delegates. \n","4":"\n\nEarly rise – Pack up & Load Lorries – leave Sheenwerck, which proved to be safest town in which we have had the pleasure of showing – Arrive at Bailleul 11 a.m. (last in this town in","5":" Afternoon spent in preparing Hall & Stage for Panto. – For first time in France I become the proud possessor of a Private Billet.\n\nJan.9th\n\nTwo Heavy snowfalls – Day duties in the Hall – At night we again produce\n\nPanto with great success – Major Churchill congratulates \"Coves,\" and speaks of a tour which is being arranged by General Birdwood.-\n\nJan.10th\n\nMemories of Bailleul","6":" Skittle alley – Visit to Y.M.C.A. Book from Library – Afternoon spent sewing & writing Large mail from Australia.\n\nJan.11th\n\nMess Purchases – rehearsal – \"Tales of Mystery & Imagination\". Earl of Cassiles (Town Major –) Mild weather. Panto still booming.\n\nJan.12th\n\nReceive Birthday Parcel from Home – \"Mystery & Imagination\" – Again meet Mr. Jack Kirby – Votes granted to the Women of England.\n\nJan.13th\n\nMy 21st Birthday – Genuine congratulations & Good wishes from my Pals – A special Dinner for the occasion (Soup, chicken, ham, vegetables, fruit salad, ginger etc.) –\n\nLetters containing Birthday greetings from Australia arrive right on time – A glorious day –\n\nCorrespondence \n\n \n\nJan.14th\n\nRehearsal & Show – Fall of snow.\n\nJan.15th \n\nSecond anniversary of departure from Sydney – Receive cable from Home containing Birthday Wishes – I meet Charlie Heydon – News of George Martin – \"Mauvaes Temp.—\n","7":"\n\nChange of Programme – Welcome return to – \"Sphinx & Woman\" – British air reprisals – Russia still undecided – Beau coup correspondence – Comfort increases in our Billet \n\nJan.17th\n\nRehearsal & show – \"Tennyson’s Suppressed Poems\" – after two years I again have great pleasure in meeting George Martin – Mess Purchases –\n","8":"\n\nTrouble in the Camp (H.Q.) – Completion of Elocution Notes – A.F.C. & their splendid work. – Show minus two numbers \"East Lynne\"\n","9":"\n\nMadame’s kindness – Mail from Australia (Mother’s \"51\") Letters also from M.B. S.C. – E.B – C.C. \n\nAfternoon spent with George Martin and evening (including supper) with Harry – I write a sketch (or is it an apology) entitled \"Failed to Start\"\n","10":"\n\nSabbath – Pay day – Reading & Writing – We journey in the evening to Steenge (?) where we give a show to","11":" Batt. (3rd Div. Artillery) arriving back at Ballieul late in the night.\n\nJan.21st.\n\nLloyd George says \"Fight On! – Change of Programme – Letter to M.B. \"Les Miserables\"- Fred Reade in Paris.\n","12":"\n\nGoeben & Breslau smashed by British – Probable effect on Turkey – Mess Purchases – New numbers & sketches rehearsed.\n\nLetter \"No 17\" to Mother.\n","13":"\n\n\"Les Miserables – Correspondence – Algie returns from Hospital – 16th Battalion Band is attached to our party, & provide good music. \n","14":"\n\nChange of Programme. – General Brand once more\n\na patron – Tribute paid to the \"Coves\" by Officers & Men of R.F.C.\n\nMild weather – Packed Houses continue.\n\nJan.25th\n\nEnquiry in London regarding the Cambrae Offensive – \"Les Miserables\" continues to instruct & interest me. Study of Othello’s speech on the \"Wooing of Desdemona\".\n","15":"\n\nAustralian Anniversary Day – I meet, converse with, and am conferred a favour by Capt. Austin (10th Aust. F.Amb.) – \"Les Miserables\" & \"Othello\"\n\nCont:\n\nMeasurements for new costumes – Ordering of new Sketches – Afternoon & Evening spent with George Martin – Pleasant memories &’ delightful reminiscences.\n","16":" (No.18)\n\nSabbath.\n\nLetter writing & Reading – Afternoon & Evening spent at","17":" F.Amb where we give a \"complimentary show to the Boys\" – Return to Bailleul.\n\nJan.28th.\n\nChange of Program – Fred Reade & self \"go big\" with \"Burglar & the Girl\"\n\nAfter the show – A few of us spend the Evening with Officers & Boys of","18":" A.S.C. (H.Q.) A very merry & happy night – Majors dancing with Privates etc. I meet, and gain the true news of the Cambrai reverse from Capt. Manchester – \n\nJan.29th (No.52)\n\nDuring the day I meet Alex Saxton & Sid Brown – Nov.25th Letters from Home (Receipt of my own letters 1.2.3.4.& 5). Another letter from Herb – \"Les Miserables\" Cpl. Bower returns from London Harry leaves for Paris. \n\nJan.30th.\n\nBritish Air Raids on German Towns – During the day I meet Madame’s daughter (age, about 45) and other of Madame’s friends – Political Unrest in Germany & Austria.\n","19":"\n\nChange of Programme – \"Fuzzy Wuzzy\" – strikes in Germany- War rationing in England – In a leisure half hour I run across a gold mine in the shape of a shop containing Shakespeare – Homer. Dickens – Tennyson & Kipling etc –\n\nWeather colder.\n","20":" – 1918\n\nFeb.1st\n\nA day of days – Major Churchill returns from London with the news that on \n\nFeb.11th we are to open at the Court Theatre\" London. – Letter despatched to Mr. Fitz. \"re cable to Dad – German Air raid on Paris – Martial Law in Germany with regard to strikers –\n\nTennysons Poems.\n","21":"\n\nRehearsal & show (as usual) – German agitators arrested – Another of \n\nMadame’s sons returns to Bailleul on Furlough (10 days every 4 months) – Letter written to the Boys.\n","22":"\n\nSabbath – Letter writing – Pay day – In the Afternoon I meet Billy Stewart – At night we journey \"per\" motor lorry to St. Jans Coppell where we entertain the 9th Corp School of Tommies – Great appreciation of our efforts.\n\nFeb.4th \n\nChange of Programme – Meet Bobby Davis (from Baths at Balmain – After evening \n\nPerformance (in which I do well with \"Sari Bair\") we are tendered a farewell Evening by Officers & Men of","23":" A.S.C. - Nero once again has a downfall – likewise a fall down – Bed at 2 a.m.","24":" Major McKenzie, Lt. Rowe,. Major Parmer. Capt Ramsay A.P.M. etc.\n\nFeb.5th\n\nPacking up for London – Last night of the \"Anzac Coves\" in Bailleul – A fitting conclusion to a most successful run – Meet Jack Neal. With George Martin once again.\n\nFeb.6th\n\nMore packing, & loading of Lorry – Storage of properties etc. – First detachment of the Coves (6 in number) leave for London – Cinema only at Theatre – A pleasant evening (first time off duty for months) during which we converse with & are given supper by Madame.\n","25":" &","26":"\n\n\"The Sentimental Blokes\" – G.A.M –\n","27":"\n\nFinal preparations – Bid Madame adieu, and in company with Jack Shaw, I entrain at Bailleul Station, loaded with personal & theatrical goods – arrive Calais 2.30 p.m. but \nfail\n to board \"packet\" at 5.15 p.m. for Dover. Pass night in Calais.\n","28":" Feb.10th.\n\nEmbark at 8.30 a.m. – a rough trip across the Channel. Arrive at Dover & entrain for London – Arrive Victoria & taxi to War Chest – thence to Court Theatre & then back to War Chest – At night. \n\nI see Gladys Cooper in the \"Yellow Ticket\" - Return to & sleep at War Chest.\n","29":"\n\nSabbath spent in long & efficient rehearsal – I procure a private billet. Bus & taxi drives.\n\nMonday. Feb.12th.\n\nAmid great anxiety but \"undaunted courage\" the Anzac Coves appear for first time in London. – a small house does not promise much success but we do exceptionally well – \"Sari Bair\" brings only encore – Broken Bottles (?) The evening \n\n \n\nperformance carries audience by storm. Despite our custom of never taking encores two or three of us are compelled to do so. – Supper at Trocadero – Congratulations from Sir Ian Hamilton & Lady Birdwood.\n","30":" Feb.12th\n\nVisit A.C.F. & see Mr Henley – Correspondence & diary at War Chest – Meet Jack Dunn at Matinee, after which Jack so kindly takes me to the residence of Mr. & Mrs. Scales at Hornsey Lane, Highgate Hill. – A beau\n\ntiful Home which is only excelled by the Kindness & hospitality of Host & Hostess – Farewell to Jack who leaves for Australia in the morning. Evening show a huge success (After this entertainment I meet & converse with Mr & Mrs. Chilton & invited to their Home.\n","31":"\n\nVisit War Chest – Letters. Meet Sid Laird – Lunch. Return to Court Theatre – Matinee, after which I meet Fred Shutchbury & receive great news from Herb.\n\nEvening entertainment under the patronage of Princess Alice. General Cockson etc – More congratulations & bouquets. A request from General & Lady Hamilton – Prospects of touring Scotland.\n","32":"\n\nLondon’s System of Tubes – Partial change makes programme stronger – Heavy work for self – Houses bigger & more enthusiastic – More paper notices – Fred & I score well with \"Burglar Sketch\" – \"Singing Soldiers\" Eddie Cornish present at night show.\n\nMeet Mr. Ayres – Dinner with Miss Chilton – meet Mr. & Mrs. Copper. \n","33":" Feb.15th\n\nLetters to Mother & C.H. – Another request for Sari Bair – A successful matinee at which Herb & Marl are present – Later we join Hammy, and the quartette have a great Dinner, a great Talk & many laughs at the Shaftesbury Hotel – The Boys are all Fit & Happy – Herb more funny than ever – Night show proves\n\nmost successful – Hammy misses \"first Stage\" to Dublin – \"Sari Bair\" & \"The Tent.\n","34":"\n\nWire to Edinburgh. Phone Mr Fitz – Correspondence – Miss Fitz & Miss Chilton both at Matinee & Evening shows – Dinner at Pelloni’s\n\nLeicester Sg.) – German Air Raid interrupts latter part of show – Pack up for Weymouth.\n","35":"\n\nLeave boarding house at Sloane Sq.\n\nVisit War Chest then on to Highgate Hill (Mr. & Mrs Scales) a charming, sincere & kind hearted Lady. Mr. Scales a benevolent, pious & sterling Gentleman – \"Home Sweet Home\" – Meet Arthur Brooker (48th Batt. A.I.F.) who also is a guest of Mrs. Scales. An Interesting afternoon walk over Highgate Hill etc During which we enter House of Nell Gwynne – I see the Home of Richard Cromwell and the House in which Bacon died after performing experiment with the \"snow\" etc.\n\n(Home of Grand Duke Michael of Russia)\n\nVisit \"Wood Green\" & Miss Chilton & Her People – Another \"air raid’ & a late return to Highgate. Mrs. Scales repeated kindnesses.\n","36":" Feb. 18h\n\nA morning visit to Buckingham Palace to make preparations for afternoon – At 5 p.m. the \"Anzac Coves\" have the supreme theatrical honour of Entertaining by Royal Command the King Queen, Prince of Wales & Princess Mary – together with many more\n\nof the English Nobility – The King congratulates the Boys & makes most complimentary remarks –\n\nThe Throne Room\n\nCourt Ball Room\n\nReception Room etc. all come under our surveyance – Souvenir autographed photos given to us by King & Queen – Evening news reporter – and how he gained admittance very successful with \"Sari Bair\" – Returns to Highgate – \n\nDiary & Correspondence – \n\nMrs. Samuels – \n","37":"\n\nRise 10.30 – Bath & and Breakfast. Report to Horseferry Road – Met Jack Carey, who is minus a leg – Taxi to Waterloo – take 2 p.m. train to Weymouth. Pass through Guildford – Southampton. Bournemouth etc Destination 6.30 p.m. We are taken to Weymouth (A.I.F. Convalescent Camp) – \"Back to the Army Again – (?) – Visit Jubilee Theatre and witness a very poor local show Return to Camp.\n\nFeb.20th\n\nBreakfast – Walk into Weymouth – Lunch in town \n\nat 2.30 p.m. we show to 1,800 people (Civilians & soldiers). The most enthusiastic show since coming to England. – Y.M.C.A. Letter writing.\n","38":" \n\nMorning trip \"per\" train to Island of Portland – We are shown the interior of Portland Gaol, which is garrisoned by Australian – Glorious Panoramas – Exhilarating atmosphere – Directly below the lofty emience of the prison ground lies the ocean, on whose waters are numerous sea planes & submarines – while \n\n(Colonels Wife)\n\nThe shore is bristling with guns – Return to Weymouth by Car. Afternoon show eclipses yesterday’s performance – Congratulations & tears by Ethel Warwick – Meet Edmund Sherras & Sgt. McBean – both bound for Australia – Return by Rail to London – Arrive Waterloo after midnight – Sleep at Peel House.\n","39":"\n\nA search for Herb & Mare proves unsuccessful – Mr. Henley – Renewal of leave Warrant – Return to Elm Bank – Like \"Tipper\n\nary\" my Heart’s right there\", while in England. Mail from Home – Evening show at Southall Hospital – Meet Morrie – Return to Highgate.\n","40":"\n\nRise late in the morning – Night show at Harefield declared off – Go to \"Duke of Yorks\" & see the famous Mrs Patrick Campbell in the \"13th Chair. A play of Tragedy & Mystery wonderfully produced. Purchased books Army & Navy Stores – Back to the best spot in London – Evening \n\nspent most enjoyably with Mr & Mrs Scales amp; friends. Miss Marjorie Bedells.\n","41":"\n\nRise early. Go to Sloane Square to collect laundry etc – Luncheon at Elm Bank – Travel to Finchley Road to see Mr & Miss Fitzsimons – Return to War Chest Club & give entertainment during which we experience our fourth London Air Raid.\n","42":"\n\nBook seats for Theatre. Visits to War Chest Club – Aust. Comforts Club to Saony Studios (New Bond St.)– Taxi\n\nto Sarony Studios (New Bond St) Anzac Coves Photographed – Waymouth Papers. Mrs Scales, Arthur & Myself see Charles Hawtrey in \"The Saving Grace\" (Haddon Chamberts. Very good – Distinctive & Natural Acting – Return to Elm Bank – \"The Beauty & Charm of English Girls – The huge majority are attractive & captivating but – (here I pause & think of one sweet face in Australia) –\n\nWire to Edinburgh – Another musical evening. Leave Elm Bank & journey to King’s Cross where I\n\nleave for Edinburgh by 10.30 p.m. train – A dreary night.\n\nFeb.26th \n\nArrive Waverley Station Edinburgh – Old & familiar scenes. Put up at Old Waverley Hotel. – At mid-day I meet my dear little Scotch friend – Afternoon spent in writing – shopping etc – Movies at night (Mary Pickford)\n\nFeb.27th \n\nDiary & letters – again meet Jack Carey. – A quiet but enjoyable evening spent at 59 Brunswick St – Home of my friend. \n","43":" \n\nStill enjoying Peace & Quietness – Purchases of many Books for my next soujourn in France – Being pressed into a game of snooker by an Edinburgh gentleman in our Hotel – a New Zealand Corporal & myself have two easy victories - I surprise myself by doing all the scoring – Entertained by Miss Hater. – At night I witness my first Opera, which is \"Tales of Hoffmann\" by Carl Rosa Grand Opera Company.\n\nMarch – 1918\n","44":" \n\nLetters – Book Purchases. Edinburgh Hill – Movies – Another happy evening at the Home of my \"friend\" – Scotch Hospitality – The short stories of O’Henry and their possibilities as regards \"dramatisation\".\n","45":" \n\nLate breakfast – Letters written & received – Afternoon – Evening spent in a quiet, but most enjoyable manner, in an easy chair before a Scotch fire place \n","46":" \n\nHarry Elliot & self have a pleasant morning walk down & under the Dean Bridge & Gardens – In the afternoon an Australian (in company with a Lassie) set out for Crammond – a grand walk in which much picturesque scenery is encountered – The & the Ocean.\n\nReturned Edinburgh.\n","47":" \n\nLetters written & received – \"Poems of Sentiment\" (Wilcox) – O. Henry’s – Last day in Edinburgh – Evening spent at \"59\".\n\nBrunswick St. – Sad partings – a weary train journey to London. \n","48":" \n\nArrive \"Kings’ Cross\" 7.30 a.m. Train to Crouch End – Return to \"Elm Bank\" –Home Again. Meet Mr. & Mrs Matthews – Afternoon trip to London on business – a heart to heart talk with Mrs Scales – Correspondence.\n\nMar.6th \n\nFeeling ill – Breakfast 11 a.m. – A run into Town – Spend afternoon at Coliseum.\n\nSeeing amongst others Ellen Terry – Bransby Williams – Florence Smithson- Return to Highgate – Meet Mrs Wm. Scales – Pay a call to Dr. Bousefield – with a sore throat. Correspondence – The night on which –\n\nMar.7th \n\nMeet Fred Reade in Town – Together we go to Daly’s Theatre & meet Mr. Todd (Actor & Manager) then on to Samuel French’s where we select Plays & Sketches – Return to Highgate. In the evening \n\nI take Mrs. Scales to Drury Lane where we witness & hear \"Cavalleria & Pagliacci (Beecham Grand Opera Company) – Rosena Buckman, Robert Parker, Frank Mullings, Jeanne Brola the most important of a \"great cast\" – glorious singing – splendid acting – the Old & Historical Drury Lane Theatre – On our return journey to Elm Bank we are held up in the Tube for 3 hours owing to German Air Raid.\n","49":" \n\nGo to Town with Mrs.\n\nScales- Call on Mr. Scales at his Office – Then we view St. Giles Church \n\n(Cripplegate) which is burial place of Milton etc.etc. – Also played prominent part in Great Plague & Fire of London – Luncheon – Take train at Cannon St for Blackheath and go to the Home of Mrs.Thomas (Mrs.Scales’ Mother) – Pass most enjoyable evening with Mrs. Thomas – Mr. & Mrs Thomas (Jun) Miss Matthews, Mrs. Scales, Miss – Stay at Blackheath for the night.\n\nMar.9th\n\nReturn from Blackheath to Town – I view the interior & exterior of Houses of Parliament. Most interesting (see \"Guide\") – Luncheon – In the afternoon Mrs. Scales & myself witness the finest show I have yet been fortunate enough to see in my life – It is \"Dear Brutus\" – written by J.M. Barrie & played by Gerald du Maurier & Co.- Mr. du Maurier becomes (in one play) my favourite Actor – God Bless Him! – Still stage struck – Evening spent Mr & Mrs Wm Scales \n\n-Night Also.\n","50":"\n\nOn Sunday morning Mr Wm Scales & self go strolling – \"Parliament Hill – Hampstead Heath etc. – The strange but common sight of \"Garden Plots\" amp; \"their workers\".\n\nReturn to my home at \"Elm Bank – Murray Sinclair visits us in afternoon – Evening spent with Mr. & Mrs. Harold Scales – Their two \"sweet & pretty children\". Return Elm Bank 11 p.m.\n\nMar.11th\n\nOur stay in England extended at least a month – Needless to say we are all very sorry to hear the news. Read \"From School to Stage\" (by Phyllis Dare) – and \"Selected Prose\" (by Oscar Wilde – Letter writing – Meet Miss & Mr. Bowen at Elm Bank – Revival of \"Lasca\" etc.\n\nMar.26th *\n\nMar.12th \n\nWar Chest Club & Australian Comforts Friends – Farewell \"talk & shake\" with Joe Elliot – Once again we face the powder,\n\nor I should say, powder the face – Show at Princes Hospital which in pre-war days is the Grand Central Hotel – Debut with the Prayer \n\nMar.13th\n\nA day occupied in writing and an evening spent at Mrs Moncrief’s (Sister to Lady Hamilton) where we entertain select party of Ladies & Gents – Magnificent residence – Congratulations for \"The Player\" – Regents Park –\n","51":" \n\nMorning spent at\n\nSamuel French Ltd Cable arrives from Australia – Once again financial – Afternoon at Criterion Theatre where I witness \"A Little Bit of Fluff\" (now in its ","52":" year – At night we give an entertainment at the War Chest Club –\n\nMar.15th \n\nVisit A.I.F. Head Quarters & Sarony Studios – Afternoon Performance in Y.M.C.A at Camberwell Green – Shopping – Still finding new shops in mighty London – Letter writing & reading in the Evening. \n\nMar.16th\n\nBreakfast 11.30 a.m. – In the afternoon Mrs Scales & myself witness the very popular play \"General Post\" (Lillian Braithwaite Norman Mc.Kinnell, Geo Tully, Gertrude Lang) at Theatre Royal, Haymarket – Evening spent at Elm - Doctor & Mrs. Massey (Belgian Refugees) – Songs Music & Recitations.\n\nMar.17th\n\nPreparations for Birmingham – Letter writing, reading & diary\n\nLeave \"Elm Bank\" (most reluctantly) and take 4 p.m. train from Euston. Slow journey through fine country – Arrive Birmingham 8.15 p.m. – Quartered at Y.M.C.A. – Early to bed, early to rise (?)\n\nMar.18th\n\nRehearsal with Orchestra Preparations for Evening – to a house of 2.000 we open with great success – Topping the Bill – Others on programme include Broughton & Daisy Taylor, Empire Opera Singers – Shaw Daunton Cyclists – Second House (Two shows) a night\n\nproves more \"enthusiastic & vociferous\" than the first – Bed after midnight.\n\nMar.19th \n\nSecond anniversary of arrival in France from Egypt – Daily papers give the \"Coves\" fine notices – W.A.A.C. – Our popularity at the Empire increases – Letters written & received. Birmingham: Great manufacturing & business centre – The Town \nnot\n beautiful, but surrounding districts very fine indeed.\n\nMar.20th\n\nAnother anniversary – This time a \n\nbirthday – more correspondence – A run out to Saltley – WA.A.C. College – Continued success at the Empire.\n\nMar.21st \n\nCorrespondence – Plot & plan of new sketch written (\"The Tartar\") In the afternoon, accompanied by artists from the Grand, Hippodrome & Empire we travel by cars to Birmingham University (now a Hospital) and entertain wounded Pommies – Mr. & Mrs. . Return to Empire & give night shows. \n\nMar.22nd\n\nDuring the day I visit, & enjoy the kindness & hospitality of (1) Miss Green (2) Dr. & Mrs. Bunting – (3) Dr & Mrs Bunting – (3) Dr. & Mrs. Holdsworth & (4) Mr. & Miss Barnsley – All are friends of Mrs. Scales – hence my good fortune in meeting them – Cordial invitation for future holidays from Mr.Bunting (Guy. John Elizabeth & Moseley) - Dr. & Mrs Holdsworth take me for a great run in their motor-car - Tomb & statue of James Watt & Matthew Boulston – (Miss Margaret) Birmingham becomes much dearer. \n","53":" \n\nA dancing lesson from Fred Reade – German offensive starts with much success. Our last two shows prove the most successful of our Birmingham season – \"The Prayer\" – Congratulations from Manager (Mr.Raymond).\n\nMar.24th\n\nLeave Birmingham 8.30 a.m. train – A pleasant trip – A glorious day – Arrive London noon – Once more with Mr. & Mrs. Scales – Meet Mr. & Mrs. James (Local clergyman)\n\nThe Study & Library of Mr Scales.\n\nMar.20th\n\nCommencement of an important week – At 2.30 p.m. we open at the \"Ambassadors\" (London) – Again in the Evening at 8.15 p.m. – Both shows attended by small, but appreciative audience - better things expected in days to follow –\n","54":" Week the most unsatisfactory time of the year for Theatres in London Large mail (17) from Australia.\n","55":"\n\nFurther important successes by Germans – Bapaume. Noyan etc. captured – A Gloom over London – All theatres including our own do poor business – Copy of \"Diary while in England\" sent Home – Also Photos. Progammes etc.\n\nMr. Burchell\n","56":"\n\nLetters of appreciation from Miss Harland & Mrs. Wheeley – Seven more Australian Letters come to hand – Houses increasing in size – Seymour Hicks \n\nshowing next door in St. Martins Theatre – Busy days these, and yet nothing much to put in the Diary. The loss of Albert, Pozieres etc.\n","57":"\n\nThe Great War Crisis – British Retreat. German brains versus British & French courage & fortitude – The Soul must predominate – Amiens in danger – Where are the troops of U.S.A. ? – German long range gun shells Paris again – Anxious moments in London.\n\nMar.29th (Good Friday). \n\nA day off from duty -. The solemnity of London – A day of serious devotion & sincere worship – Denomination quite rightly thrown to the winds – Visit friends at Wood Green – Return \"Elm Bank\" 8 p.m. and meet & enjoy company of Mr. & Mrs and Misses Sargent – English beauty & refinement.\n\nMar.30th (Easter Saturday) Renewal at Ambassadors – Most successful shows of the week – Many friends present at matinee – Meet & have dinner in town\n\nwith Mrs Wheeley – Preparations for departure from London – Battle still in German favour.\n\nMar.31st\n\nLeave Elm Bank 8 a.m. Take train from Euston to Liverpool – Interesting journey through Clapham, Northampton, Rugby Crewe etc – Arrive Liverpool 5 p.m – Lodgings at 39 Seymour St. An evening trip by Ferry to New Brighton.\n","58":"\n\nApril 1st\n\nRehearsal at the Olympia Theatre, where we are to show for a week – We are wonderfully well advertised – (The long poster) – American Y.M.C.A. and its system – Both houses receive the Anzac Coves with the utmost enthusiasm & appreciation – During the evening we play (2 shows) to 9.000 people\n","59":"\n\nReading – Writing and a walk around town – Two shows.\n","60":"\n\nA trip out to Fred’s lodging – A rehearsal of a \"Breezy Morning – A new acquaintance – two shows – Bed after midnight – Previous to retiring we meet & converse with American sailors off the Leviathan (65.000 strong).\n","61":"\n\nM.M. – Voluntary entertaining to Wounded Pommies at a Liverpool Hospital – On our Bill at the Olympia are King & Benson, Elliot Savonas, Tom Clare etc. \n","62":"\n\nMeet Mr Davison friend of Mr & Mrs Scales with whom I converse, have luncheon & proceed to his Home at Oxton (across the River) – The Suburbs of Birkenhead & Port Sunlight – Liverpool fine buildings – Exterior & interiors of St Georges Hall Walker Art Gallery. Liner Building – Cunard Liner Offices.\n","63":"\n\nWriter new Original Monologue \"The Opium Den\" – See & hear \"Madame Butterfly\" at the Shakespeare Theatre – Meet Beatrice Waycott (member of Opera Co).\n\nLast two shows at the Olympia – Second House proves most enthusiastic of the week.\n","64":"\n\nTake 10.30 a.m. train for Manchester – Arrive there at noon – After two or three hours tramping in the rain (which is not devoid of humour) we at last find lodgings – Very comfortable we hope to be in this new place – A trip out towards Cheadle – Early to bed.\n","65":"\n\nReport at Theatre Royal 9 a.m. – Rehearsal & Preparations for Evening – Meet new friends.\n\nMrs Rice (with whom we are lodging) certainly knows the Art of Cooking – At 7 p.m. the curtain rises & the Anzac Coves are tendered a wonderful reception by the Manchester people – Very difficult programme for few of us – Enthusiasm & Appreciation of Audience.\n","66":"\n\nMail from London – Read O.Henry – Visit to Food Controllers Office for purpose of procuring Pickels for meat, butter, & sugar and tea etc. – See the matinee at Hippodrome – on the Bill are:– Ruth Vincent. Lupino Lane. Herbert Waring etc. \n\nour own show at night goes with a great swing – fine notices in Manchester Papers – Mrs. Rice.\n","67":"\n\nMatinee & Night Shows – Manchester Public & Municipal Buildings – Picadilly Albert Square – Manchester Park –\n\nGermans meet with success in new offensive – Fighting around old & familiar spots – Armentieres Bac. St. Maur etc.\n","68":" \n\nTwo Manchester Warehouses Tootal Broadhurst & Co. – J.N. Philips & Co.- Correspondence\n\nshopping – Meat. butter. bacon sugar.etc. Houses growing larger & more appreciative\n","69":"\n\nRenewal of Military Passes – Ghost Walks – Nasty Weather – Manchester growing very popular with our Boys – Last two shows at Manchester – Great Enthusiasm – Five Curtains & many Coo-ees at end of show – Pack up & leave for Glasgow at midnight –\n","70":"\n\nArrive Glasgow 9 a.m. Sunday – Go to \"Overseas Club in Buchanan St. \n\nThen to Theatre - & afterwards seek \"digs\" quite unsuccessfully – Return to Club & decide to spend week there – Having a free afternoon I accompany Les Williams to 9th Park Rd where he calls on some \"old friends\" – These friends are then kind enough to take us to Paisley where we are entertained by Mr.& Mrs Wood – Return to Club.\n","71":" \n\nRehearsal with Orchestra at \"Coliseum\" – and preparations for evening - \n\nOpen to poor houses – Are we getting a fair deal from the management under which we are working – Remainder of this Music Hall Bill is very weak indeed - It comprises Jack Lane, Barts Trio, Madame Doris etc.\n","72":"\n\nA Billiard Table in the Club provides excellent recreation during a wet day – Correspondence – In the afternoon the Anzac Coves journey to the \"Alhantbra\" in taxis to take part in Charity Mat\n\n \n\ninee – Programme very good – Two shows at night.\n","73":"\n\n\"What a wealth there is in friendship!\" – The Anzac Coves are surely millionaires in possessing such friends as – Mr. & Mrs. Robinson, Mr.& Mrs Cargell, Mrs. Moon. Mrs. Fullerton, Miss McIntosh etc. These people in whom are embodied the warm heartedness & kind nature of the Scotch prove through out the week what only Mothers & Sisters could prove to be – Shows & \n\nsuppers nightly.\n","74":"\n\nCard & Photos, in Scotch & otherwise sent to Home & Friends – Wintry weather – Paisley & Kilmarnock and the memories they recall, as regards Australia – Many letters written – Parts of Glasgow as busy as London – The Clyde\n","75":"\n\nAn afternoon trip to \"Rouken Glen\" a beauty spot partly natural & partly artificial - Very \n\nnice, but dwarfed by many spots in Sunny N.S.W. Waterfalls, ferns etc. Supper at the Home of Miss McIntosh – A never-to-be-forgotten night.\n","76":"\n\nStill enjoying hospitality of \"Overseas Club\" Reading & Writing – Visit to Art Gallery & Museum – Fine Buildings – Grand Statuary & Colours – \n\nWe give an afternoon entertainment at the Club, with wonderful success - Miss\n\nRedford (prominent & popular Music Hall Artist sheds tears on hearing \"Sari Bair\" - Later in the afternoon have the honour of presenting Miss Redford with a large bunch of flowers & a gold \"rising sun brooch – New Acquaintances –\n","77":"\n\nAccompanied by Harry Ross make my third visit to Edinburgh. This time for half-a-day – Although quite fine in Glasgow it is snowing in this other City – I call at Brunswick St & meet \"old friends\" with \n\nwhom I lunch & am entertained – also \"snapshotted\" (with apologies for grammar) - Meet David Harkess who lost an arm last year in France – After spending quiet, peaceful time I return with Harry to Glasgow – \"An angry porter\" and a little repartee – Last two shows (Houses total on last day 300 pounds – a grand supper & morning (not evening) at Mr. Robinsons – Mrs. Robinson is a brick.\n","78":"\n\nSabbath:- Reading Corres\n\npondence – Billiards – Mrs. Moon & Miss M. Intosh – Last day in Glesca’ – The ladies come to station to bid us farewell - & as train draws out three give way to tears. The Boys are heartily sorry to leave. – The end of a perfect week – Made so, by friends whom God has surely placed on this Earth to lighten the cares of others, & make them happy.\n","79":"\n\nArrive Euston 7.30 a.m. & immediately make for Elm Bank \n\nA bath followed by a sleep, sets me right again – Report to Theatre at Wimbledon 5 p.m. Rehearsal & Preparations for night – Quality, if not quantity characterises our first Wimbledon audience. \n","80":"\n\nOur Theatre a very fine building with great conveniences & appointments – Most prominent place in Wimbledon – Conductor of the Orchestra – The Wimbledon \n\n \n\nTennis Courts & their importance.\n","81":"\n\nGermans still meet with small successes in France – I meet Capt. Jennings – one time \"Worlds Champion Swordsman\" – once resided Double Bay & great frequenter of Larry Foleys Club. – Correspondence – Show as usual.\n","82":"\n\n\"Anzac Day\" – \"Sari Bair\" \n\n\"Heroes of the Dardanelles\" both go exceptionally well – Matinee in addition – More congratulatory messages. \n","83":"\n\nThe River Thames is crossed twice daily going to & from Wimbledon – Putney Bridge & Hammersmith Bridge – Two names to couple with Arnst Barry Paddon the Australian Crew that won the Henley Cup etc. – \n\nCorrespondence –\n","84":" \n\nA free afternoon spent at the Garrick Theatre where Madge Pitheradge, Arthur Wontner & Hugh Buckler are playing in \"Pigeon Post\" (a War Drama) \"Good acting in an ordinary play – We are getting great Houses at Wimbledon – very busy these days – Large Australian Mail (including 20 letters & two parcels) comes to hand.\n","85":"\n\nMr. Wilfred Inman – Local Paper gives the \"Coves\" a great notice.\n\nSabbath – A walk over the Common at Wimbledon – Pleasant afternoon & evening.\n","86":"\n\nReport at Kings Theatre, Hammersmith for usual Monday rehearsal & preparations – Receive a large Australian Mail (Parcels) Letters. Successful opening show.\n","87":"\n\nStill enjoying the great hospitality & kindness of Mr. & Mrs. Scales – Elm Bank is growing very\n\ndear to me – Having free afternon I go to Globe Theatre & see Marie Lohr in \"Love in a Cottage – A very beautiful comedy drama by Somerset Maugham – Solid acting of Sydney Valentine – Show at Hammersmith – Late nights (also late mornings)\n\n Copied on","88":" with exception of Globe Theatre etc.\n","89":"\n\nMay 1st \n\nMatinee & Night show – Heavy work – Bouquets, or as one might better say congratulations from the Conductor of Orchestra – Comparison of \"Coves\" with Pellisiers \"famous\" Follies – letters received & post – \n\nHammersmith Bridge.\n\nMay 2nd\n\nTwo shows again today – I read \"Ghosts\" (a much discussed play by Ibsen) – Also selections from Byron – Much time spent in travelling from Highgate to Hammersmith.\n","90":" \n\nHughie Gannon, Ill – A criticism & kind words from Mr. Hennessy are much appreciated by myself. Two shows.\n","91":"\n\nLast day at Hammersmith – Most successful matinee – And a wonderfully enthusiastic night show – Great financial success – a heavy but a happy night.\n","92":"\n\nSabbath – Breakfast 11 a.m. Reading.\n\nwriting & diary – Luncheon – Meet Mr Treadgold (Clergyman) – The very sweet nature of my charming hostess. A run out to Wimbledon where I again meet Mrs. Cosby, Ada & Anita – (A very pleasant evening after which I return to Highgate.\n","93":"\n\nLeave Waterloo St. at 9..35 a.m. for Bournemouth – a very acceptable journey – Glorious country of the South – Pass through Southampton – Winchester etc. – the baggage & person\n\nal props to Winter Garden where we are to give five shows in the next three days – In this Winter Garden such artists as Melba, Clara Butt etc have shown – First show a great success.\n","94":"\n\nMail from London – Staying at Y.M.C.A. – Bournemouth the most delightful place imaginable - Ideal town for tourists or Invalids – A wonderful sea front & beach – \"The Coves\" enjoy a great stroll along the Promenade and \"The Pier\" – Leading\n\nfrom heart of the town to the Pier are the Town Gardens which are a well regulated group of gay & variegated flower beds & lawns – Wonderful colour effects – The Invalids walk – Matinee & night show. A very classy audience greatly appreciate our efforts. \n\n Copied June 2nd\n","95":"\n\nI meet Eric Gordon who is at present awaiting his commission – and we have a pleasant morning walk along the beach, followed by some rowing around & about the Pier. Also a stroll along\n\nWest Cliff, not forgetting a lift –ride up the side of the Cliff – Eric & I discuss Old Days & Predict future events. A word must be said about the Municipal Orchestra at the Winter Garden – Under Mr. Dave Godfrey they are responsible for fine musical treats – The \"Coves\" (between shows) are entertained by \"Miss Mac & Mrs Fullarton (our friends from \"Overseas Club, Glasgow) – In five shows I recite \"Sari Bair\", \"Singing Soldiers\", \"Prayer\" & \"The Tent – The Original Wests Picture House is to be found in Bournemouth \n","96":"\n\nLeave Bournemouth most reluctantly for Portsmouth – Give a matinee at Theatre Royal – Large audience, much appreciation – Manager, Mr. P. Davey – This Theatre (one of the most important outside of London contains a great deal of fine new scenery all of which is being prepared for Drury Lane etc) The \"Green Room\" contains a fine large portrayal of late Sir Henry Irving. \n\nLeave for London. \n\nBack Home \n","97":"\n\nCroydon – A matinee & night show – Marl present at latter performance; We both return to Elm Bank – and late supper together – Later after a long talk we retire for the night after disposing of many of the recently arrived \"box of chocolates (from Home).\n","98":"\n\nMeet Mr. Mrs. & Miss Chambers (Friends of Frank Crossleys & dine with them after matinee – Our last \n\nshow at Croydon proves to be the last of our \"never-to-be-forgotten tour\", the last of the 120 shows – Greater enthusiasm & laughter prevails – \"The Coves\" go their best before leaving dear Old Blighty – Late return to Elm Bank – During the day Marl leaves for Manchester.\n","99":"\n\nSabbath – Reading & Writing – A Heart to Heart talk with my \"dear friend\" Mrs. Scales, who has become my \"English Mother\" June 16th \n\nAnother trip to Wimbledon.\n\nOne of the most enjoyable Sunday Evenings I have ever spent & why – Wimbledon Common – Return \"Elm Bank\" Supper (as usual) and bed\n","100":"\n\nShopping on Crouch End & city – purchase of monologues and sketches from Reynolds & Frenches from Reynolds & French’s – Trip to Richmond (on the Thames) - A very fashionable & historic spot – Richmond Park & Gardens – \"The Star & Garden\" – Photos & P.C.’s sent Home – A quiet evening spent with Mr & Mrs. Scales\n","101":"\n\nNow that time is drawing near for return to France I am feeling very loathe to depart from all that is so dear to me in England. Marl returns from Manchester & makes the acquaintance of Mrs.Scales. Marl & I enjoy a sumptuous lunch & then journey to Town where we spend afternoon at the \"Palladium\" which has on its Bill Harry Weldon. J.N. Rickaby. Ruth Vincent. Chas Austin etc.- Marl reluctantly returns to Wiltshire and I return to Elm Bank accompanied by Anita - Marland by the way is both\n\nlooking & feeling excellent – It is just like good old times together.\n\nThe evening spent most pleasantly with Mr. & Mrs Scales & Anita – A hard parting from my \"little friend\".\n","102":" \n\nWith rather a heavy heart I take my farewell from Mr. & Mrs Scales \"Elm Bank\" – One day perhaps I may be able to express the deep gratitude & sacred affection due to my dear \"English Mother\" for her kindness & maternal interest in my humble self – \n\nLeave Victoria Stn by train for Folkestone – the \"Anzac Coves\" realising what a good time they have had do not grumble. Arrive Folkestone & board vessel for France – A pleasant trip across – Arrive Boulogne midday – Report Military Camp Back again to the drudgery of Mechanical Army Life\n","103":" \n\nIt would be false to say I am anything else but miserable – However I am not grumbling or \n\nmaking others miserable – Reading & Letter writing Leave Boulogne at 6 p.m. for Etaples. Arrive there 9 p.m. Camp Etaples for night.\n","104":"\n\nLeave Etaples 9 a.m. & travel in cattle trucks through decent country till 8 p.m. when we leave train at Canaples & walk to Vignacourt – Considerably bucked up by hospitality of Australian A.P.C. Boys who though strangers to us all provide beds & meals.\n","105":" Leave Vignacourt\n\n10 a.m. passing through Villiers arriving at \"H.Q’s\" – Bertangles at midday. The glorious weather the only saving quality – After dinner we erect bell tents and once again dwell under canvas.\n","106":"\n\nSabbath – Letters to Home. \"Elm Bank\" & Wimbledon – Again meet Bill Smith – Jack Shaw & Algie Cooper – Original Poems – Clean & Pack costumes etc – Our new camp is in an ideal spot.\n","107":" \n\nPreparing new numbers & rehearsing sketches – Re-writing of diary – Contentment is returning – \"How to dine with everything, excepting plate, knife. fork & spoon.\"\n","108":"\n\nDaily reading of \"New Testament\" given me by my \"English Mother\". A long run of excellent weather continues – So does the brilliant work of the \"Australian Infantry\" some hard study – The growing superiority of our Air Service over that of the enemy.\n","109":"\n\nThe \"Anzac Coves\" journey to \"48 Squadron\" R.F.C. and prepare hall & stage for the night – Oh what a change from London – A very old \"unshapely shed is our new theatre. At 8.30 p.m. with our \"English Programme\", we open to a large audience of Australians. Pommies. Canadians & Americans. The show theatrically speaking is an absolute \"riot\". For first time I recite, \"If\" (by Kipling. After the show we are most kindly spoken to, by our Organiser & Officer, Major Churchill, who is leaving us in a couple of days. \n","110":" \n\nA week yesterday since leaving Blighty – Memories of that day – First Mail from London – Mr. & Mrs. Scales at Essex – Command performance to General Birwood and staff – The General is most congratulatory & very pleased with his \"Coves\" & signifies his appreciation by hearty handshakes with all the boys – Back to camp & bed.\n","111":"\n\nRehearsal –\n\nThe warm & perhaps oppressive weather gives place to a cold change.\n\nPreparation of \"Whitest Man I Know\" – and reading of Jerome’s \"Three Men in a Boat\" – decidedly humorous. Letters to L. Campbell. H. Williams etc – Rumour of Hindenburg being dead. \n\nShowing under nasty conditions. \n","112":"\n\nAnother Red letter day & one that will be long remembered – For the first time I take a trip in an aeroplane (No.11 Bristol) and enjoy it immensely – A wonderful & most pleasing sensation – Our plane passing over Amiens which appears\n\nlike a large-sized vegetable garden\" – the cathedral seems decidedly small from an altitude of 5.000 feet. \"Under the clouds, over the clouds, & through the clouds, clad like Sir Ernest Shackelton\". Nose dives, curves, swoops, ascents, descents & all kinds of scents!\n\nLetter writing & shows\n","113":" \n\nSabbath Copying Diary written while in England – a great deal of letter writing – A summer prepared & disposed of in our Home in the woods.\n","114":" \n\nEarly rise – As in the old days we pack up our goods – and after being issued with new gas masks we set out from Bertangles for Flixecourt – passing through an old residential town of ours – to wit: \"La Chaussee. – Pirancourt – Arriving at our destination, we encamp in Huts – and at 6 p.m. give our \"first show\" to Officers amp; Men of Fourth Army H.Q’s.\n","115":" 28th:- The \"Coves\" are being very decently treated but do not altogether care for increased army discipline.\n\nSecond Show – Complete my reading of \"Three Men in a Boat\" and then find much pleasure (in a spare half hour) in reading Longfellow – While writing this diary, numerous German planes are passing overhead with their weird droning sound evidently bound for a Bombing raid on Abbeville.\n","116":" \n\nChange of Programme Q.M. General of \"4th Army present – \"The Coves\" come in for much praise – Glorious weather – Rehearsal of new sketches etc. Longfellows Poems -\n","117":"\n\nStill at Flixecourt – bad news from French & British Fronts – Fall of Soissons – Australians upholding their great rep., Show as usual to a packed house. \n","118":" \n\nContinuation of fine \"Home\" weather - Write poem \"The Woodland\" Long Rehearsal – Bob Bower takes a run to Amiens & returns with some necessaries – I make debut with my own monologue, entitled \"The Opium Den\" – Most Successful.\n","119":"\n\nJune 1st. \n\nOur last show at 4th Army H.Q’s (Flexicourt) – Oppressive weather – Completion of new & original recitation – So far un-named. The boys having a spare morning, go bathing – but feeling rather studious, I do a little reading & writing\n","120":"\n\nSabbath – Pack up & leave for our camp at Bertangles – Germans still slowly advancing – A pleasant surprise, in the form of \"18\" letters – twelve from Home & Friends in Australia – others from Mrs. Scales & English Friends – Very Happy!!!\n","121":" \n\nMajor portion of day spent in pick & shovel work – To comply with Army Orders we excavate interior of bell tents to escape probable destruction from enemy bombs – News of Harold Williams – \"The Pemberton Billing\" case causes much controversy amongst the troopers who are interested.\n","122":"\n\nFeeling rather seedy – Rehearsal – Having obtained a new Cook we again commence our Mess\n\nFred Reade, caterer – self secty & treasurer – \"Longfellows Poems.\" We again open at the Aerodrome (Bertangles) to nearly 700 Australians – about the same number is unfortunately turned away through want of room – Harold present at show – Having grown worse during the day it proves a hard task to get through at night – 101.5. \n","123":"\n\nA miserable day spent with one blanket separating myself from the ground – Are we downhearted? No!!\n","124":"\n\nA little better – My complaint is a most common one just at present – It very closely resembles \"influenza\", and is possessed by a great number of the troops in France - \"The Spanish Student\"\n","125":"\n\nSome marvellous stunting of Bristol Planes up in the Aerodrome – Also some accidents – After a spell of two days I again return to the boards, but fail both to raise a voice & also a smile – \n\nStill ill – but undaunted \n\nJan.8th\n\nA very welcome visit by Harold Williams – Stories told of Australians in the Line – \"The Piano\" & the \"Fancy Costumes\" – Mr. Burrows of \"C\" Flight a great friend & advocate for the \"Anzac Coves\" – Prospects of another flight Parcel arrives from Home\n\nJan.9th \n\nSabbath – My weekly letters bring me much pleasure – I also receive a few. \"The New Testament\" and its great spiritual comfort & Help\" – Fritz drops a few shells quite near enough to our village\n\nIn the evening the","126":" Brigade Band under Mr. Wellings (late of Manly) proved very fine music which is much appreciated by the Boys assembled in its vicinity.\n\nJan.10th\n\nStill at Bertangles – Rehearsal – Fatigue Duties & Usual Daily Routine – An hour spent with \"Con Clarke\" – I am still rather depressed in mind but again well in body – Dave West & Charlie Schwab (D.C.U. & M.M.) both from","127":" Fld Amb visit our Camp & bring news of the \"7th\" Boys.\n","128":" \n\nEarly Rise – Rehearsal – An afternoon walk to Flesselles where I pay a call on Harold Williams and spend a very pleasant time conversing about the English Tour & \"Little\" personal items – Have tea with my \"Brother Wag\" & return to the Aerodrome for the Show – We are patronised by Gen. Monash – Gen. Featherston – Surgeon Gen Howse – Major Berry – After the show I again meet Harold Love who is returning from the Base to his Unit. \n","129":" \n\nHaving a free day S. M. Carlisle, Jack Davey & myself take a run out to the 7th F.Amb. where I meet most of my \"Qld Pals\", all of whom are very well – Harry at present in England – Interesting conversations – pleasing \"reminiscences & anecdotes\" – A long talk with Reg Dunn about dear old \"Elm Bank\" – Entertained in Sergeants Mess – Proud possessor of many snap shots – Return to Bertangles in Motor Ambulance 11 p.m. – Leslie Hanson\n","130":"\n\nDaily Routine – Letters from Hornsey & Wim-don. A praiseworth feat by American Pilot who on losing propeller travels 9 miles over enemy country into our own line & makes safe landing – Show as usual – Debut with \"The Whitest Man I Know\" – \nMy\n Testament.\n","131":"\n\nA morning spent in rehearsing – an afternoon spent autographing \"cards books etc. – and studying new sketches & numbers – Signatures of Gen Birdwood Andrew Fisher atc atc side by side with those of the \"Coves\"\" \n","132":"\n\nLetters written to London – English Diary completed – study – Autographing Photos – Last day & last show at Bertangles – Commence reading \"Evangeline\" –\n","133":"\n\nSabbath – Complete \"Evangeline\" – \"The Day of a presentiment which does not take place\" – Preparation for departure – Gothas pass perilously close to our camp but are beaten off by our aircraft. \n","134":" \n\nReveille 6 a.m. – Pack up & leave for Montreuil (G.H.Q’s) – An omnibus ride of 65 kilos – We pass through some very fine country & some equally wretched villages – A spell at Abbeville – Arrive Montreuil 1 p.m. General Haig’s H.Q’s – This small town was originally fortified by Romans & for hundreds of years has been a garrisoned town – It stands on a great hill from which surrounding villages & landscapes may be well observed. \n","135":"\n\nOur Camp & its absurdities – Preparations in new hall – Prologue Opening show – Audience consists of Tommies – great success – Back to camp\n","136":"\n\nEarly reveille – Preparation of new monologue also sketch with Frank Crossley & Fred Reade, entitled \"Tabloids\" –\n\nA fine panoramic view of surrounding country, seen from Ramparts Show\n","137":"\n\nLetters written to\n\nMrs Moon – Marl – Mrs W. Wheeley - & Miss C. H. (Edinburgh) – \"Red Tape & More Red Tape\" – I revive \"spotty\".\n","138":" \n\nLoad up & leave Montreuil – After a long & rather interesting journey the \"Anzac Coves\" arrive in Vignacourt – and take over a small Hall – Two Divisions of Americans pass through this village – Exceptionally fine troops – Faces of strength & intelligence\n\nAustralian & English Mail brings much cheer to the Boys – Another sweet letter from \"Elm Bank\" – Good news from Home – Receipt of Programmes etc. in regard to London Season. – Correspondence.\n","139":" \n\nMidsummer’s Day, - marked by cold weather – Preparations of Hall & Dressing Rooms for the Evening – Show attended by many Australians, Pommies & Nurses.\n\nComplete Gospel of St Mark\n","140":"\n\nSabbath – Additional Australian & English letters – Correspondence – We give first Sunday Performance for some time. Meet Charlie Stone of \"Come Over Here\" fame. \n","141":"\n\nCommence writing an \"Eastern Burlesque – Read Part of Thackeray’s \"Roundabout Papers\" – - Change of Programme – Crowded house – many unfortunately turned away – Lindsay Kemble of the \"Sentimental Blokes\" (1st Div. Show) is now no more! \n","142":" \n\nNews of Jack Fexton’s Death – a supporter & friend of the \"Coves\" – Early morning walks Continuation of \"Eastern Scene\"\n\nGreat news from Italian Front – Austrians rapidly retreating – Almost a million American Troops now in France","143":" \n\nGood news from Italian Front Continues – Austrians driven back over the – Major Berry (our new Commandant) has occasion to speak to the Boys.\n\nChange of Programme – First Original Sketch (written by self) and acted by Fred Reade & I, goes most successfully – Feeling rather pleased with nights performance.\n","144":" \n\nItalians still keeping the enemy moving – Trouble in the German Reichstag – Peace Talk – Commence reading \"Hiawatha\" – Although a fair way from the Line, we are not quite free from the Bombs of the Gotha – \n\nIt is a nuisance being kept awake so late at night.- What!\n","145":" \n\nRehearsal – Complete reading of Hiawatha – Afternoon show at 61st Casualty Clearing Station – a good part of audience consists of men on stretcher & in beds – also Nurses – Return to Vignacourt & give night show. – Four of the Coves (including self) make debut with a new concerted number of my own, which goes \"big. Parcel from Mrs Scales Cake – chocolates & book.\n","146":"\n\nRehearsal – A letter & snapshots arrive from \n\nEdinburgh – Preparation of \"The Grafters\" – Many American Troops in our Village – More Italian successes – Last show at Vignacourt.\n","147":"\n\nSabbath – Letter writing – Leave at 11 a.m. in Lorry for Pernoir -- Arrive, after a short journey at N.O.W. Casualty Clearing Station where we give afternoon entertainment to Sick, Wounded & Nurses – Return Vignecourt - Many German ‘planes essay to attack our own & other surrounding\n\nvillages but are beaten off by anti-aircraft gunfire.- The spectacle of an aeroplane caught by searchlight.\n","148":"\n\nJuly 1st\n\nPack up costumes, properties etc. & leave for Bertangles – We have had a very decent week at Vignacourt – Back to the bell tents in the woods – Bed made under the trees –\n","149":"\n\nRehearsal & re-opening show in the \"hangar\" of 48th Squadron R.F.C. – At present very busy on long, new sketch – Heavy bombardments along the Front. \n\n \n","150":"\n\nAgain hard at work on the sketch – One day, perhaps, I may be a playwright – and then our very worthy \"J.M. Barrie\" will have to look to his laurels (?) – Rehearsal & an incident concerning the \"Grafters\" Show – New pianist, Billy Deck, from Balmain, is now with the \"Coves\" –\n","151":"\n\nAnniversary of American Independence – also an anniversary concerning Mother & Father \n\nSuccessful attack by Australian Fourth Division. A good substantial advance & many prisoners (2.200) – a Good many of these (900) we pass on the way to the show – Very sad news from Mrs Scales – her Dear Mother, Mrs. Thomas, has departed from this Life. \"Requescat in Pace!\" \n","152":"\n\nA happy dream in the early morning, of one who is far away – Rehearsal – Continuation of \"Eastern Sketch\" – Correspondence – \n","153":"\n\nEva’s nineteenth birthday – Best wishes – Lt. Ford R.F.C. side slips 2000 ft and is successful in extinguishing his burning machine but unsuccessful in saving his own life – The pilot who coolly fired a white flare while dashing down to destruction – Last show at Bertangles Very enthusiastic audience.\n","154":" \n\nSabbath – Letter writing - Australian Mail arrives – Letters up to May 12th. A long awaited reply arrives – \"Every cloud has a silver lining\"- \n","155":"\n\nRehearsal of \"The Grafters\" – \"Tabloids\"& Ian McGrew - Lena Ashwells dramatic Coy gives a \"one\" night show in the Aerodrome \"Hangar\" which we have vacated – Two sketches comprise the programme – The latter one a new two-act comedy drama entitled the \"The Old Lady Shows Her Medals\" (J.M. Barrie) is particularly fine (\"professional players)\". \n","156":"\n\nLeave Bertangles (pronounced Ber-tong-l) at 12.30 for Vignacourt – Matinee given to wounded, sick & \n\n& Nurses at 61st C.C.S – return to Bertangles & have privilege & pleasure of seeing the \"Kookaburras\" – Cyril & James, George Jennings & Blaine – A disturbance. \n","157":"\n\nBen Davies leaves the \"Anzac Coves\" – Write new poem \"The Mountain Stream\" – Rehearsal – An injustice concerning \"H.S.\" – New Easter Offensive – Risking the elements (sleeping out).\n","158":"\n\nLetter from \"Elm Bank\" – Rehearsal – Awaiting orders in regard to future movements – Heavy rain during an outdoor meal\n\nprovide some sport as well as discomfort – James makes a \"fur cap\" out of rabbit skins.\n","159":"\n\nA very wet day – Read the \"Golden Legend\" ( Longfellow) – Another visit to the \"Kookaburras\".\n\nRehearsals – Strange, loud reports – Guns firing or shells bursting (?)\n","160":"\n\nThis day, three years ago, I strolled into Victoria Barracks & enlisted. What will the next three years bring forth(?) Letter written to Herb in regard to probability of his\n\njoining the \"Coves\" – After a long walk to see Harold Williams, it is necessary to return disappointed for Harold had left the Camp on the previous day – Diary Rehearsal.\n\nFrank Donovan (pianist) leaves for Artillery Battery -\n","161":"\n\nSabbath – National Day of France – Church Service Celebration – Anniversary of \"Fall of Bastille\" – 1789. My weekly letters written – Also an important one to Herb.-\n","162":"\n\nNew German Offensive commences – No success as yet.\n\nRehearsal – Heavy rain & thunderstorms – Again meet Mr Gallagher – Letters from Wimbledon.\n","163":"\n\n\"The Egoist\" (Meredith) provides good reading & thought – A rude early morning awakening – while sleeping under the trees – A rush to \"canvas\" to avoid rain – Weather clears. A bright clear twilight prove most enhancing during a long & pleasant walk among \"Nature & its adornments\" – \n","164":"\n\nParade & Rehearsal – as usual – Leave Bertangles\n\nat noon for 61st E.C.S (Vignacourt) where we entertain field hospital troops and are afterward entertained by Capt. Bindley- an admirer of Anzacs, both as fighters & entertainers.\n","165":"\n\nThe enemy commences his new Great Offensive & after a partial success is driven back with great loss – Casualties estimated at 90.000 Thunder storms continue – \"The Egoist\". –\n","166":"\n\nThe fraternity now existing between Americans & Australians is very marked indeed – Further German rever-\n\nses & French Victories\n","167":"\n\nA long & sweet letter from \"Elm Bank\" – Rehearsal Journey to Perois (Pern-war) where we entertain sick, wounded, and Nurses at 41st C.C.S.- An opportunity being afforded, we visit an Aerodrome & see an English Concert Party – \"The Goods\" – who are to my mind as well as others the finest \"party\" in France – \"The Egoist\" – Parcel of Literature – Continuation of \"Eastern Comedy\"\n","168":"\n\nSabbath – Weekly letters – Major Portion of \n\nday spent in making preparations for short tour which is to commence on the morrow – \n\nContinuation of the \"Egoist\"\n\n"}}