{"Document Name":{"0":"Diary_0154","1":"Diary_0154","2":"Diary_0154","3":"Diary_0154","4":"Diary_0154","5":"Diary_0154","6":"Diary_0154","7":"Diary_0154","8":"Diary_0154","9":"Diary_0154","10":"Diary_0154","11":"Diary_0154","12":"Diary_0154","13":"Diary_0154","14":"Diary_0154","15":"Diary_0154","16":"Diary_0154","17":"Diary_0154","18":"Diary_0154","19":"Diary_0154","20":"Diary_0154","21":"Diary_0154","22":"Diary_0154","23":"Diary_0154","24":"Diary_0154","25":"Diary_0154","26":"Diary_0154","27":"Diary_0154","28":"Diary_0154","29":"Diary_0154","30":"Diary_0154","31":"Diary_0154","32":"Diary_0154","33":"Diary_0154","34":"Diary_0154","35":"Diary_0154","36":"Diary_0154","37":"Diary_0154","38":"Diary_0154","39":"Diary_0154","40":"Diary_0154","41":"Diary_0154","42":"Diary_0154","43":"Diary_0154","44":"Diary_0154","45":"Diary_0154","46":"Diary_0154","47":"Diary_0154","48":"Diary_0154","49":"Diary_0154","50":"Diary_0154","51":"Diary_0154","52":"Diary_0154","53":"Diary_0154","54":"Diary_0154","55":"Diary_0154","56":"Diary_0154","57":"Diary_0154","58":"Diary_0154","59":"Diary_0154","60":"Diary_0154","61":"Diary_0154","62":"Diary_0154","63":"Diary_0154","64":"Diary_0154","65":"Diary_0154","66":"Diary_0154","67":"Diary_0154","68":"Diary_0154","69":"Diary_0154","70":"Diary_0154","71":"Diary_0154","72":"Diary_0154","73":"Diary_0154","74":"Diary_0154","75":"Diary_0154","76":"Diary_0154","77":"Diary_0154","78":"Diary_0154","79":"Diary_0154","80":"Diary_0154","81":"Diary_0154","82":"Diary_0154","83":"Diary_0154","84":"Diary_0154","85":"Diary_0154","86":"Diary_0154","87":"Diary_0154","88":"Diary_0154","89":"Diary_0154","90":"Diary_0154","91":"Diary_0154","92":"Diary_0154","93":"Diary_0154","94":"Diary_0154","95":"Diary_0154","96":"Diary_0154","97":"Diary_0154","98":"Diary_0154","99":"Diary_0154","100":"Diary_0154","101":"Diary_0154","102":"Diary_0154","103":"Diary_0154","104":"Diary_0154","105":"Diary_0154","106":"Diary_0154","107":"Diary_0154","108":"Diary_0154","109":"Diary_0154","110":"Diary_0154","111":"Diary_0154","112":"Diary_0154","113":"Diary_0154","114":"Diary_0154","115":"Diary_0154","116":"Diary_0154","117":"Diary_0154","118":"Diary_0154","119":"Diary_0154","120":"Diary_0154","121":"Diary_0154","122":"Diary_0154","123":"Diary_0154","124":"Diary_0154","125":"Diary_0154","126":"Diary_0154","127":"Diary_0154","128":"Diary_0154","129":"Diary_0154","130":"Diary_0154","131":"Diary_0154","132":"Diary_0154","133":"Diary_0154","134":"Diary_0154","135":"Diary_0154","136":"Diary_0154","137":"Diary_0154","138":"Diary_0154","139":"Diary_0154","140":"Diary_0154","141":"Diary_0154","142":"Diary_0154","143":"Diary_0154","144":"Diary_0154","145":"Diary_0154","146":"Diary_0154"},"Date":{"0":"unknown","1":757.0,"2":760.0,"3":761.0,"4":762.0,"5":764.0,"6":765.0,"7":768.0,"8":769.0,"9":774.0,"10":775.0,"11":777.0,"12":778.0,"13":786.0,"14":787.0,"15":789.0,"16":806.0,"17":807.0,"18":808.0,"19":809.0,"20":810.0,"21":811.0,"22":812.0,"23":813.0,"24":814.0,"25":815.0,"26":817.0,"27":818.0,"28":819.0,"29":820.0,"30":821.0,"31":822.0,"32":823.0,"33":824.0,"34":825.0,"35":826.0,"36":828.0,"37":829.0,"38":830.0,"39":831.0,"40":832.0,"41":833.0,"42":834.0,"43":835.0,"44":836.0,"45":837.0,"46":838.0,"47":839.0,"48":840.0,"49":841.0,"50":842.0,"51":843.0,"52":844.0,"53":845.0,"54":846.0,"55":847.0,"56":848.0,"57":849.0,"58":850.0,"59":851.0,"60":857.0,"61":858.0,"62":859.0,"63":860.0,"64":861.0,"65":862.0,"66":863.0,"67":864.0,"68":865.0,"69":866.0,"70":868.0,"71":869.0,"72":872.0,"73":873.0,"74":874.0,"75":875.0,"76":876.0,"77":877.0,"78":878.0,"79":879.0,"80":880.0,"81":881.0,"82":882.0,"83":883.0,"84":884.0,"85":885.0,"86":886.0,"87":887.0,"88":888.0,"89":889.0,"90":890.0,"91":891.0,"92":892.0,"93":893.0,"94":895.0,"95":896.0,"96":897.0,"97":898.0,"98":899.0,"99":900.0,"100":901.0,"101":902.0,"102":903.0,"103":904.0,"104":905.0,"105":906.0,"106":907.0,"107":908.0,"108":909.0,"109":910.0,"110":911.0,"111":912.0,"112":913.0,"113":914.0,"114":915.0,"115":916.0,"116":917.0,"117":918.0,"118":919.0,"119":920.0,"120":921.0,"121":922.0,"122":923.0,"123":924.0,"124":925.0,"125":926.0,"126":927.0,"127":928.0,"128":930.0,"129":931.0,"130":932.0,"131":933.0,"132":934.0,"133":935.0,"134":936.0,"135":937.0,"136":938.0,"137":939.0,"138":940.0,"139":941.0,"140":942.0,"141":943.0,"142":944.0,"143":945.0,"144":946.0,"145":947.0,"146":948.0},"Entry":{"0":"\n\n","1":"\n\nFinal Inspection by our O.C. (Capt. Donovan. Left Liverpool 2 p. m- Parade through Sydney and Reviewed at Domain by Col. Ramaciotti- Spend night at Show Ground.\n\nJan.15th.\n","2":" to Orient Wh’f. Grand farewell- fine spectacle- left Harbour at 1.30 p. \n\nm- spent good afternoon- slightly ill at night- slept in hammock.\n\nJan.16th.\n\nSabbath- pleasant trip- Boxing on board. Victoria sighted at 6 p.m. \n\nJan.17th.\n\nArrived Port Melbourne- correspondence- leave to City of Melbourne- Our impressions- Sargents trip to St. Kilda- Billiards- Pantomime (Mother Goose) Very good- Riot- Return to Osterley.\n","3":"\n\nBad news- No Leave- Exceptionally enthusiastic send off by Melbourne people- something\n\nto be grateful for.\n","4":"\n\nDeparture from Port Melbourne- We take up A.M.C duties- self in charge of ward- Canteen and its Irregularities\n\nJan.20th.\n\nContinuous good weather- Instructions by Capt. Smith Osier- fractures & bandages. Correspondence.\n","5":"\n\nArrived Outer Harbour (Adelaide) - fine jetty (?) Leave of 3 hours- Miss Mc. Donald & Miss Bray, Left for Fremantle 6 p.m.\n","6":"\n\nOne week on water- Life-belt parade- Instruction- Sydney High Boys- wash clothes.\n\nJan.23rd.\n\nSabbath- church parade good weather- spar with Tommy Watson. Letters.\n\nJan.24th.\n\nA rough day on the ocean- Albany & the Leeuwin- Instruction \ng\n in Hemorrhage.\n","7":"\n\nArrived at Fremantle- General Leave to Perth- Impression of the City \n\nMotor trip through Kings Park- fine sights of River Swan- Australia’s largest Baths- return to Fremantle & \"Osterley\"- Hearty farewell. \"Last man on board & How he got there\"- A last, long glimpse of Dear, Old Australia.\n","8":"\n\nAnniversary Day- The Ghost Walks- Capt. Atkins- Medical Instruction.\n\nJan.27th.\n\nSecond Lecture on Hemorrhage- Prominence of strange fish- Presence of many sharks- Boxing bouts.\n\nJan.28th.\n\nHeat of tropics- Lecture by Capt. Jenks (R.M.S. Osterley) \"Discipline & Morality\"- First heats of Boxing Tourneys- F. Beaurepaire, Promoter.\n\nJan.29th. \n\nLifebelt drill- weather much hotter- Ship Inspection by Col. Holland. O.C. of troops- More good boxing- Lecture on Fractures.\n\nJan.30th.\n\nSabbath- Rain- Peculiar Tropical weather- Church Parade & Correspondence.\n","9":"\n\nRough weather & rain- 2,200 miles from Home.\n\nFebruary- 1916\n","10":"\n\nConcert by Passengers- a la Tivoli Follies- very popular Entertainment- Speech by Col. Holland. Rough weather.\n\nFeb.2nd. Bad cold- Usual Ward Duties- Weather hot & sultry- Glorious Eastern sun-set – Boxing.\n","11":"\n\nFine day- arrival in Harbour of Colombo at 7 a. m- Boat besieged by Natives- Peculiar boats & method of propulsion- Many large boats in Harbour including\n\nHospital ship- \"Karoola\" on way to Sydney- Route march through Colombo- Native Barracks- We are greatly pestered by natives- Two Rickshaw rides- Peculiarities of Buildings, People & their Customs- Cheap fruit & drink (Yes! Cheap & nasty!)- Canteen at Barracks. Lemonade. Biscuits. Fruit etc. - Return to Harbour & troopship- Headaches prominent- Impressions of Colombo- fair Boat leaves at 10 p.m. for last stage of voyage.\n","12":"\n\nThe \"Briny\" once again- The \"Tangled Skein\" (Orczy.)\n\nLecture by Returned Nurses on Hospital Duties in Egypt- Semi-finals of Boxing.\n\nFeb.5th.\n\nIssue of \"Osterley Keystone\" Washing day- Second class Cabins (?) Good weather.\n\nFeb.6th.\n\nThird week of Voyage- Church Parade- Weather rougher- Many sick- Self an abstainer\n\nFeb.7th. \n\nFirst land sighted since Colombo- Islands of Socotra & the \"Brothers\"- Also Cape Guardafui in the Evening- Finals of Boxing.\n\nFeb.8th.\n\n\"One Day\" (Glyn) - good but hot weather- Rifle & Physical Drill competitions among Infantry- Tug-o’-War won by Artillery- Correspondence\n\nFeb.9th.\n\nGulf of Aden- Arabian Coast & Islands- Lantern lecture by Capt Jenks – Practice with ships gun- Belt Parade.\n\nFeb.10th.\n\nPass \"Twelve Apostles\" Islands Also many vessels. The Red Sea- First & only death on Board- L. H’man- Burial at sea- impressive ceremony.\n\nFeb.11th.\n\nRed Sea coolest part of our Voyage- Preparations- Stewards Concert to troops. Farewell speech by skipper.\n\nFeb.12th.\n\nGulf of Suez- \"Boys pleased at end of Voyage- Hammocks & Blankets handed in\n\nFeb.13th.\n\nArrived Suez 6 a. m - Impressions of Port & Town- final preparations & disembarkment- Strength of Natives.\n\nEgypt. 1916\n\nFeb.13th.\n\nLast sight of good old Osterley Dry rations- Poor train service from Suez- Pestering by natives begins- Indian sikh who admired Anzacs- Loss of cap. Arrive Zeitoun 1 a.m. Transport of kit to camp Blanket issue- Bed. 2.30 am.\n\nFeb.14th. \n\nParade 9 a. m - Address by O.C Again meet Sgt Roberts & other Liverpool friends- Survey of camp- Easy day- First trip to Heliopolis & Cairo- Impression both good & bad- Slums- Natives- Y.M.C.A. \n\ncoinage troubles.\n","13":"\n\nParade 6.30 a.m. Abundance of Tomatoes & dough nuts. Raining all day- Cairo. I meet Quinert, Barnes & Smith- Esbekieh Gardens-The Bazaar- Dispatch of Parcels & Cards.\n\nX End of Egyptian Diary.\n\nDiary resumed on","14":" Movements etc between","15":" & March 13th Continued in note form.\n\nVirgins Tree\n (continued):-\n\nTree 2000 years old- Visitors Books, Drank water from well.\n\nChurch\n\nSanctae Familiae- Fine altar- Valuable ornaments & statues- Magnificant wall paintings.\n","16":" Massacre des Innocents.\n","17":" Ordre du Depart.\n","18":" Fuite vers L’Egypt.\n\n4. Halteaux Bords du Nil.\n\n5. L’Abre de la Vierge\n\n6. Entrée A Heliopolis\n\nStatues of St Stanislaus, St Antonius & Holy Family. - Belgian Horticulture.\n\n1. \n Virgins Tree & Marys Well.\n\nSituated two miles from Zeitoun Camp- Remains of Original tree used by Holy Family for shelter- Also well from which Holy Family drew their water. At present worked by Oxen- Photographed against Tree- Souvenirs & Cards\n\n2. \n The Obelisk\n:- \n\nTwo miles from camp- near Matarieh- Composed of one piece solid granite- 60 feet high- covered with hieroglyphics\n\n3. \nCemetery.\n\nOne mile from Zeitoun- Graves hundreds & also thousands of years old- Some graves very shallow with earth & stones covering body- Family tombs- Valuables buried with bodies has lead to destruction and unearthing of graves-\n","19":" \n Egyptians Bazaar.\n\nDescription- Articles- Cosmopolitan- Dealings. \n","20":" Garry Drive. (Fred & self)\n\nOne hour- 10 piastres- Sultan’s Palace- Slums- The Nile- Episode of falling horses- & demand for more money by Arab driver- The Consequence.\n","21":" Kursaal.\n\nRevue: \"Smile Up- Theatre- \"Good\"- Not so the Show- Production & setting very faulty- Poor acting & dressing- Songs & dialogue in English & French.\n\n7. Ostrich Farm.\n\nA mile & a half from Camp- built on similar line to native villages- Site of ancient farm- Young & old birds & eggs- Male birds all black- The Lookout- Used by our Signallers- Fine pigeon collection- Egyptian conjuring boy.\n\nThe Zoo. The Nile. The Palace. The Citadel- The Pyramids & Sphinx- The Arab Quarters.\n\n8. \nChange of Camp.\n\nZeitoun to Ferry’s Post:- Left Zeitoun March 5th 1916- Took train to Cairo & thence to Ismailia which is 100 miles from the Capital town- Good train journey- cultivated country- Nile Irrigation scheme- Ismaila a large village- A march of 5 miles chiefl’y on sand & in which we cross Suez Canal brings us to 7th Aust. Fld. Ambulance- Sleep on desert sands under wagon. Very cold- \"Ferry Post Camp.\n\n9. \n Further Change of Camp.\n ","22":"\n\nFerry Post to Moascar:-\n\nA strenuous march owing to hot weather & amount of luggage- Camp near Railway Line- All hope of joining 1st. Fld. Amb has vanished-\n\nWe become attached to","23":" F. A. – Queenslanders & S. Australians- Good food- O.C. Fair- Plenty of toil- Boys downhearted- Big movement apparent, judging by number of troops in the vicinity of Moascar-\n\nRumours of going to France- Active Service in reality- Inconvenience of washing etc- Sleeping out- Wet blankets\n","24":" \nSeventh Field Ambulance\n\nOfficially attached to Unit- our \"14th. of","25":" boys\" in \"B\" Section under Major Brennan M.C- Impressions of Officers- Strict letter censoring- Announcement of Australians going to France- Issue of Respirators.\n\nContinuation of Diary.\n\nThe voyage from Egypt to France.\n","26":"\n\nInspection by O.C- Break Camp at Moascar- March with full kit to station. Entrain & leave Moascar.\n","27":" \n\nMonotonous train journey to Alexandria- Arrive at Port at 7 am. Embark on A. 41- S.S. Minneapolis- Destination unknown- ship packed with men & horses- Food poor- hammock issued.\n","28":" ","29":"\n 14th\n\nVessel leaves at 6.30 a. m The Mediterranean- Constant wearing of life-belts because of submarine menace- \"Band selections by 25th Batt- Ship’s canteen gives first fair deal for many weeks- Picket duties on horse-decks- Lights out 5.30 p.m.\n","30":" \n\nSea much rougher- Consistent rains- Picket duties Minneapolis fitted with two guns- also two Lewis machine guns- \"Our troopship the first to leave Egypt for France.\n\nMar.16th.\n\nPicket duties- Ship Inspection- Band- Letters. Rough & cold weather-\n","31":"\n\nPass Malta- Hair-cut by Barber who visited our shop in Balmain- Physical drill & Inspection. Calmer.\n","32":"\n\nPass C. Bon (Algeria) - Also Sth. Coast of Sardinia- Inoculation- arm very bad- Food much worse.\n","33":"\n\nPass Island of Corsica\n\nBirthplace of Napoleon- arrive at Marseilles 2.30 pm. Naturally fortified port. Shipping centre of importance- Night spent on board- Sleep on seat 9\" wide.\n","34":"\n\nUnloading of Vessel- deprivation of Camera- arm much better- We are all anxious to get away from vessel.\n\nEgyptian Figures 1 to 10.\n\nDiary while in France.\n\nMar. 20th.\n\nLeft vessel & marched to our encampment- Site of Indian G.H- originally a German residence- fine grounds with abundance of fruit trees & luxuriant vegetation- great contrast with Egypt.\n\nMar.21st.\n\nBully-beef & biscuits- Inspection by a French General- Break camp at Marseilles- Baggage guard. Leave by train for unknown destination. Sleep. (or at least try to sleep) on train.\n\nMar.22nd.\n\nNo reveille necessary. Spend all day in train","35":" mile long) – Pass through Lyons. Dijon. Avignon, and other large towns- fine pastures- villages- orchards. farms. vineyards Regularity & beauty of trees & hedges- Apparent absence of all menfolk. Women & girls on farms & in offices- Enthusiastic welcomes by French.\n","36":"\n\nB & B- Very cold- no sleep- Now in Nth. of France- agricultural country- Souvenirs requested by French-\n\nMonotony broken by beautiful landscapes- Journey completed (58 hours) at 10 p. m- Rejoin baggage guard- Night spent in snow- 6\" fall. Village of Thiennes.\n\nMar.24th.\n\nGuard baggage till noon- A good meal, and How I came by it. - Hospitality- Rejoin Unit in afternoon Australians encamped in or near Morbecque-","37":" F. A in old school.\n","38":"\n\nFatigue duties- route march to Hazerbrouch’e- large village. \"Café au lait.\"\n","39":"\n\nSabbath- Mass in village church- service in French- underclothing & blanket issue (most acceptable) - rain- \"café\" again.\n\nMar. 27th.\n\nInspection of our 7th. Brigade by General Sir Douglas Haig. C.I.C- village street- Sir Douglas said: - I am very pleased with","40":" Bde and I am sure they will acquit themselves excellently. We move from school to Chateau.\n","41":"\n\nBilleted in barn over stable\n\nRoute march- sick parade- Constant firing of British Artillery plainly heard.\n","42":"\n\nFatigue- Practical experience in combating gas by means of helmet- Weeping-gas- Col. Dolman’s accident- Mess orderly duties.\n","43":"\n\nPay-day (45 frs) – busy Estaminets & canteen- Battle evident judging by noise of Artillery.\n","44":"\n\nEarly morning march- game of Football- stretcher drill- presence of aircraft.\n","45":"\n\nApr.1st.\n\n\"Fools day\"- no jokes or false alarms- Football & Boxing under Capt. Brownell- lecture by Capt. Hamilton- \"Veneral Diseases\"- Continued bombardment on British front- Half- holiday (?).\n","46":" \n\nSabbath- Mass 9 a. m. - Pleasure walk- Issue of two gas respirators- Salmons. Sauce. Pears & Lime juice. No! not issued- Letter-writing- \"R.C faith in France.\"\n","47":"\n\nSick-parade- Marching Orders- Preparation & Inspection of Kit.\n","48":"\n\nLeave Chateau & join with 7th. Bde- Departure from Morbecque 10.30 am- We pass through Hazerbroucke & other villages- Lunch on the road- March proving strenuous to many. Billeted at 3 p. m in barn at village of Outtersteene (11 m)\n","49":"\n","50":" resumed at 10.30 a.m. good weather- bad roads. Oh’, those cobbles! Pass\n\nThrough Strazeele. Steenwercke many aeroplanes. First signs of German destruction- Destination reached after travelling 9 miles- Quartered in Hospital or D.S. Formerly a brewery. Occupied for a day & a night by Crown Prince – Fort Rompu.\n\nApr.6th.\n\nWaggon. Guard 3 am to 6 am- myself in party of 36 bearers- kit, blankets etc.- Observation balloons- Lost!- Found! Arrival at Le Estrade-\n\nBilleted in barn- Improvised sleeping- Leave to Steenwercke in evening.\n","51":"\n\nCapt. Strachan O.C. of new camp- squad drill & letters Sudden departure in afternoon. Strange to say we ride in cars instead of footing it. \"Are we off to the trenches?\" (Later) \"No!\"\n\nApr.8th.\n\nOur party take up duties in","52":" Divisional Baths at Erquinghem- Work in drying room- very trying & oppressive- \"French friends.\"\n\nBaths ½ mile from Armentieres- Shelling around our abode.\n","53":"\n\nSabbath- Work as usual- First glimpse of \"Mad Major- hundreds of shells wasted on him by Fritz- Leave to Armentiers in afternoon\n\nImpressions\n","54":"\n\nOur party leaves baths at noon- arrival at","55":" F.A base- Dinner \"en route. Departure from Base to Le Estrade- Heavy bombardment during night.\n\nApr.11th.\n\nReport \"re\" presence of Ger-\n\nman spies- Correspondence- Evening spent in French farm- Eggs. Coffee. Toast. Guard duties against German gas. 9 mths since enlistment.\n","56":"\n\nEggs & bacon for breakfast (?) Route march with O.C. Lecture on Hemorrhage. First mail received (bon!)\n","57":"\n\nLetters home- Route march & Lecture- Eggs regularly.\n","58":"\n\nEvacuation of Rest Camp- Long & weary march through mud & rain. Arrival at Base.\n\nApr.15th.\n","59":" mths since departure from Sydney- Route march- Erquinghem\n\nApr.16th.\n\nSabbath- Mass at \"Bac-St-Maur\"- Letters- Y.M.C.A- Gas picket.\n\nApr.17th.\n\nHappy day- Mail from Home- Gas Picket at night.\n\nApr.18th.\n\nGas Picket duties.\n\nApr.19th.\n\nSelf in party of bearers for Bois-Grenier (A D.S) Leave for destination 8 p.m.\n\nApr.20th.\n\nOur A.D.S. a couple of hundred yards behind reserve trenches. \"FIRST DAY\" in action- Stretcher bearing in support trenches. Our dug-out comfortable- Part of Line called Shaftesbury Avenue- \"Jenolan Caves\"- Danger of shells \"M’s S\"- Action of British Guns. Leave trench at 6 p. m for A.D.S. Great Destruction of village. - no inhabitants- No Red Cross or Brassards. Batteries around our Stations encourages shelling from Fritz.\n","60":"\n\n\"Good Friday\"- No buns. Plenty of rain- Night duty in trench- 5 p. m- 9 a. m sleep in dug out.\n","61":"\n\nEaster Saturday- quiet day- letters- Night duty at \"College Green.\"\n","62":"\n\nEaster Sunday proves a bad day for our boys- 250 shells from Fritz in 40 minutes*- Four killed & many wound pass through us- Indescribable wounds- Fortitude of our Boys- Aircraft\n\n*Pozieres comparison.\n\ntake advantage of fine weather. Mad Major’s example to his opponents- British pluck & daring in the air.\n","63":"\n\nEaster Monday- German shelling continues- No. 1 squad duties- Wounded Anzacs.\n\nA Day I shall never forget, also a motor-car run which shall dwell in my memory. Busy night.\n","64":"\n\nAnzac day- Best wishes to our Brothers- in- Arms – Typical Australian’ as regards weather- Stretcher bearing at College Green.\n\nReturn from A.D.S. to Ft. Rompu\n","65":"\n\nDetailed for Hospital Work. I take up my duties-\n","66":" 27th}\n","67":" 28th} Hospital Duties daily from 7 a. m till 7 p. m Sinn Feiners in Dublin. \n","68":" 29th} \n","69":" \n\nPlenty of time for correspondence- Aircraft busy- Weather perfect.\n","70":"\n","71":" to","72":"\n\nNothing of importance occurred- Great Weather- Artillery active at Ypres.\n","73":"\n\nGerman trench raid is a success at the expense of our 20th Batt. (\"B\" Company) Good work- by bearers- We have a very busy night. First hand accounts of courage, humour & fortitude in & after the raid- Casualties number 80 (k & w)\n","74":" \n\nRelieved in Hospital by \"A\" section- Mass at \n\nBac. St. Maur- French service- Silence of Artillery.\n","75":"\n\nCapt Strachan- \"Barbe of Grand Bayou\"- A visit to Y.M.C.A- \"Lena Ashwell’s No. 2. Firing Line Party\" Fine Concert.\n","76":"\n\nInspection of our quarters by General Birdwood- Impression: - \"Perfect\"- Wet weather.\n","77":"\n\nPublication of \"Australians arrival\" in France- Quiet day. Duties as usual.\n","78":"\n\nY.M.C.A & Duties.\n","79":"\n\nI witness my first Post Mortem Examination- Capt Culpin performs same. Most interesting operation. Y.M.C.A in Evening\n","80":"\n\nWeather wet & miserable- Artillery silent- Return of some of our \"boys\" from Bois-Grenier.\n","81":"\n\nSabbath- Also \"Mother’s Day\"- Attend Mass- Night duties. Mail- Walk to Croix-du-Bac. Quiet day.\n","82":"\n\nCool wet weather- A long & needy rest (14 hours sleep) Usual Routine.\n","83":" &","84":"\n\nA \"B\" Section Party leaves for Erquinghem- on Engineers Fatigue Duties- Y.M.C.A & Correspondence\n","85":"\n\n\"Red Letter Day\"- (1) Large mail from Home & friends. (2) I take part in first concert since leaving Sydney- Yours Sincerely \"scores well\"- Successful show- Incident with our W.O. (L.C)\n","86":"\n\nSelf in Party to Bois Grenier. Four miles from Ft. Rompu- British Guns very active near latter part of our march- \"Oh! that screeching!\"\n","87":"\n\nChange of duties from S.B to Dressing Room- New Friends- \"R.B.\"\n","88":" \n\nSabbath- Roy develops & prints photo of self at Virgins Tree- \"The Village of Bois Grenier\"- Activity of Aircraft & Artillery- German bombardment as usual on Sunday.\n","89":"\n\nHaving the chance to do our own cooking we live well at Bois-Grenier- I assist with a few wounded cases during the day.\n","90":"\n\nBusier day- Interesting if at times gory work- \"Whist.\" Lt. Porteus’ Death.\n","91":"\n\n\"Cribbage\"- Few wounded cases- Pathetic incident of Two Brothers (2nd instance)\n","92":"\n\nMore cribbage- Many letters- Good news from Home- Still going strong- Plenty of shells from Fritz.\n","93":"\n\nBusier than usual- \"A Gooseberry Picking Expedition\" cut short by shell landing 15 to 20 yards from \"berry-bush- Luckily a wall between shell & us-\n\nReturn to our base at Ft. Rompu.\n\nMay.27th \n\nDuties in dressing room- much more interesting than fatigues. Decline in quality of meals- very busy day- \"Uriah Heep\"\n","94":"\n\nInspection by Generals Porter & Howse & also A.D.M.S- \"All well pleased\n\nwith state of our \"quarters\" & dressing-room- Sabbath Church-\n","95":"\n\nBusy-day- Large Mail- Assist in operation by our Colonel & also Capt. Culpin (Brachial artery & two veins severed) - I am admitted to hospital 9 p. m suffering from Influenza.\n","96":"\n\nAmbulance celebrates first Anniversary of leaving S.A. - Patient in Hospital.\n","97":"\n\nSecond day in Hospital Much better.\n","98":"\n\nJune 1st.\n\nDischarged from Hospital- Australians inspected at Croix-du-Bac by Messrs. A. Fisher & Wm. Hughes.\n","99":"\n\nTrench & dug-out digging in our paddock- safeguard against German shelling. Parcel despatched to Home. Our friends in P.C. shop – Correspondence. Artillery active.\n","100":"\n\nTrench digging- detailed to bring stretcher case from Erquinghem. Wet w., \n","101":"\n\nSabbath- Mass 7.30 am- news of naval engagement- Reported German Victory Easy day.\n","102":"\n\nBritish Victory off Jutland- Wet & miserable weather- I take part in concert at Y.M.C.A. \"Australian Corroboree\"-\n","103":"\n\nPay-day- Another journey to Bois-Grenier for a week- D.R. duties- Fierce & prolonged British bombardment- Aerial activity.\n","104":"\n\nLetters to Australia- Visit to surrounding ruins & gardens- \"The Church\"- \"Suicide Corner\"- Fruit & flowers most plentiful- Gooseberries once again. Night duty.\n","105":"\n\nTragic news of Lord Kitcheners Death- Drowned whilst proceeding to Russia on H.M.S. Hampshire Britains loss- \"K of K\"- Shrapnel from Fritz.\n","106":"\n\nQuiet day. Cribbage.\n","107":"\n\nGerman guns silent- Truth of Naval Engagement- Air fights & pursuits.\n","108":" \n\nVerdun- Burial of lad from 20th Batt. Routine as usual.\n","109":"\n\nEnemy guns silent- Ypres fighting severe- Artillery- Return to Ft. Rompu- A hasty march under wretched conditions\n","110":"\n\nHospital duties- Mail- Quiet day.\n","111":"\n\nRussian Success. Issue of Steel Helmets (?) Daylight saving scheme introduced into France.\n","112":"\n\nHas an offensive begun? Fierce Artillery bombardment at Ypres.\n","113":"\n\nFurther Russian Success- Fokkers & Taubes- First experience of German Gas\"- helmets worn for 25 minutes- \"Gas from Ypres.\n","114":"\n\nNothing unusual occurred\n","115":"\n\nTrinity- Sunday- Mass 5.30 a.m. (6.30 a.m. by watch) Artillery silent at Ypres- 2 Taubes brought down at \nYpres\n Armentieres Departure for A.D.S.\n","116":"\n\nDay. Duty in D.R.\n","117":"\n\nHuns shell Armentieres- Destruction of Church & dwellings- Death of Von Molthe- Few Cases.\n","118":"\n\nLongest day- (daylight 10 p. m & 2.30 a. m) - I meet a couple of the H. H. Boys.\n\nGas helmet inspection & drill A lively night- Shells land all round our building but fail to hit it- However the Observation Post next door is wrecked- All but a few of us don steel helmets & leave building for trenches.\n","119":" \n\nNight duty. Gas alert on- We are warned of gas, just as the alarms ring out from trenches- False alarm!\n","120":"\n\nFritz quieter. Anzacs from Balmain- Food \"tres bon\n","121":"\n\n\"Cribbage\"- Return from Bois-Grenier- \"Who said Soccer\"?\n","122":"\n\nSabbath- Mass 7.30 a.m.\n","123":"\n\nWounded German prisoners pass through our Base Anzacs trench raid meets with great success.\n","124":"\n\nLetters to E.C. - Duties.\n","125":"\n\n\"The White Company.\"\n","126":"\n\nCapt. Strachan annoyed. - Roger Morgan.\n","127":"\n\nPreparations for evacuation of Ft. Rompu.\n","128":"\n\nJuly 1st.\n\nDeparture from \"good old Home\" 10.30 a. m. Destination, Bailleul- Strenuous March owing to rapid pace & heat of day. Arrive at new quarters- V. tired\n","129":"\n\nBeautiful surroundings- Aircraft in evidence- Filthy state of Hospital etc- News of Big British offensive on Somme- Great Success. Visit to Eddie Cornish- disappointment. Air duel.\n","130":"\n\nBailleul important military Base. Impressions of Town.\n","131":"\n\nReceipt of large mail- \"Silver Wedding\"- U.S.A (In. Day) Offensive continues.\n","132":"\n\n\"Hyde Park\"- \"Romeron\". Visit Y.M.C.A. also R C. Cathedral. Work as usual.\n","133":"\n\n\"Soccer\" again. Y.M. & Canteen. Great British successes.\n","134":"\n\nLast day at Bailleul. Preparations for departure.\n","135":"\n\nLeave for Unknown destination. After 7 kilos we pass through \n\nStrazeele & then on to Boire, where we spend night in Barn. Fine country (hops, wheat & vineyards)- Church (1626)- Our billet originally in hands of British in a skirmish with Germans who occupied a farm house 700 yards away- Germans driven out- Farmhouse shows signs of the frogs.\n","136":"\n\nGlorious day for second stage of march. Leave Borreal midday- After march of 10 miles, arrive at Ebblinghem. Pass the night in huge paddock.\n","137":"\n\nBillet very good- During day\n\nA & B sections play football- both codes- A section successful- Soccer 3-2, Rugby 9-6 Great day- good sport- Fresh milk- fresh air fresh everything.\n","138":" \n\nReveille 4 a. m. Ambulance moves off at 6 a. m. for Wizernes (8 m) & then we entrain. We pass through Calais & Boulogne. Cattle-truck- High expectations in passing through B’ne. Journey ends at 9.p.m. at Saleux Night march which proves to be most strenuous experienced to date. We lose our bearings- Many exhausted. Sleep on road. \n","139":"\n\nAnother march (4 miles) - Billeted at Breilly till 5 p. m. - Deoart for Vaux (5 miles) - march of 50 to 60 miles since leaving Ft. Rompu- Billet very poor- Village worse- Four of us spend night on cart.\n","140":"\n\nAnniversary of Enlistment- Good weather.\n","141":"\n\nLarge mail from Home. Route march (6 miles) During march we encounter cavalry & M.M. Gun Corps going through training.\n","142":"\n\nSix months since sailing from Sydney. Mail. Easy day.\n","143":"\n\nSabbath. Lecture on Gas by Major Anderson. Mid-night trip to Amiens (N.Z. Hospital)\n","144":"\n\nNothing unusual.\n","145":"\n\nFeet & boot inspection- \"The Ghost Walks.\"\n","146":"\n\n"}}