{"Document Name":{"0":"Diary_0442","1":"Diary_0442","2":"Diary_0442","3":"Diary_0442","4":"Diary_0442","5":"Diary_0442","6":"Diary_0442","7":"Diary_0442","8":"Diary_0442","9":"Diary_0442","10":"Diary_0442","11":"Diary_0442","12":"Diary_0442","13":"Diary_0442","14":"Diary_0442","15":"Diary_0442","16":"Diary_0442","17":"Diary_0442","18":"Diary_0442","19":"Diary_0442","20":"Diary_0442","21":"Diary_0442","22":"Diary_0442","23":"Diary_0442","24":"Diary_0442","25":"Diary_0442","26":"Diary_0442","27":"Diary_0442","28":"Diary_0442","29":"Diary_0442","30":"Diary_0442","31":"Diary_0442","32":"Diary_0442","33":"Diary_0442","34":"Diary_0442","35":"Diary_0442","36":"Diary_0442","37":"Diary_0442","38":"Diary_0442","39":"Diary_0442","40":"Diary_0442","41":"Diary_0442","42":"Diary_0442","43":"Diary_0442","44":"Diary_0442","45":"Diary_0442","46":"Diary_0442","47":"Diary_0442","48":"Diary_0442","49":"Diary_0442","50":"Diary_0442","51":"Diary_0442","52":"Diary_0442","53":"Diary_0442","54":"Diary_0442","55":"Diary_0442","56":"Diary_0442","57":"Diary_0442","58":"Diary_0442","59":"Diary_0442","60":"Diary_0442","61":"Diary_0442","62":"Diary_0442","63":"Diary_0442","64":"Diary_0442","65":"Diary_0442","66":"Diary_0442","67":"Diary_0442","68":"Diary_0442","69":"Diary_0442","70":"Diary_0442","71":"Diary_0442","72":"Diary_0442","73":"Diary_0442","74":"Diary_0442","75":"Diary_0442","76":"Diary_0442","77":"Diary_0442","78":"Diary_0442","79":"Diary_0442","80":"Diary_0442","81":"Diary_0442","82":"Diary_0442","83":"Diary_0442","84":"Diary_0442","85":"Diary_0442","86":"Diary_0442","87":"Diary_0442","88":"Diary_0442","89":"Diary_0442","90":"Diary_0442","91":"Diary_0442","92":"Diary_0442","93":"Diary_0442","94":"Diary_0442","95":"Diary_0442","96":"Diary_0442","97":"Diary_0442","98":"Diary_0442","99":"Diary_0442","100":"Diary_0442","101":"Diary_0442","102":"Diary_0442","103":"Diary_0442","104":"Diary_0442","105":"Diary_0442","106":"Diary_0442","107":"Diary_0442","108":"Diary_0442","109":"Diary_0442","110":"Diary_0442","111":"Diary_0442","112":"Diary_0442","113":"Diary_0442","114":"Diary_0442","115":"Diary_0442","116":"Diary_0442","117":"Diary_0442","118":"Diary_0442","119":"Diary_0442","120":"Diary_0442","121":"Diary_0442","122":"Diary_0442","123":"Diary_0442","124":"Diary_0442","125":"Diary_0442","126":"Diary_0442","127":"Diary_0442","128":"Diary_0442","129":"Diary_0442","130":"Diary_0442","131":"Diary_0442","132":"Diary_0442","133":"Diary_0442","134":"Diary_0442","135":"Diary_0442","136":"Diary_0442","137":"Diary_0442","138":"Diary_0442","139":"Diary_0442","140":"Diary_0442","141":"Diary_0442","142":"Diary_0442","143":"Diary_0442","144":"Diary_0442","145":"Diary_0442","146":"Diary_0442","147":"Diary_0442","148":"Diary_0442","149":"Diary_0442","150":"Diary_0442","151":"Diary_0442","152":"Diary_0442","153":"Diary_0442","154":"Diary_0442","155":"Diary_0442","156":"Diary_0442","157":"Diary_0442","158":"Diary_0442","159":"Diary_0442","160":"Diary_0442","161":"Diary_0442","162":"Diary_0442","163":"Diary_0442","164":"Diary_0442","165":"Diary_0442","166":"Diary_0442","167":"Diary_0442","168":"Diary_0442","169":"Diary_0442","170":"Diary_0442","171":"Diary_0442"},"Date":{"0":"unknown","1":797.0,"2":798.0,"3":799.0,"4":800.0,"5":801.0,"6":802.0,"7":803.0,"8":804.0,"9":806.0,"10":807.0,"11":808.0,"12":809.0,"13":810.0,"14":811.0,"15":812.0,"16":814.0,"17":815.0,"18":816.0,"19":817.0,"20":818.0,"21":819.0,"22":820.0,"23":821.0,"24":822.0,"25":823.0,"26":824.0,"27":825.0,"28":826.0,"29":827.0,"30":828.0,"31":829.0,"32":830.0,"33":831.0,"34":832.0,"35":833.0,"36":834.0,"37":835.0,"38":836.0,"39":837.0,"40":838.0,"41":839.0,"42":840.0,"43":841.0,"44":842.0,"45":843.0,"46":844.0,"47":845.0,"48":846.0,"49":847.0,"50":848.0,"51":849.0,"52":851.0,"53":852.0,"54":853.0,"55":854.0,"56":855.0,"57":856.0,"58":857.0,"59":858.0,"60":859.0,"61":860.0,"62":861.0,"63":862.0,"64":863.0,"65":864.0,"66":865.0,"67":866.0,"68":868.0,"69":869.0,"70":870.0,"71":871.0,"72":872.0,"73":873.0,"74":874.0,"75":875.0,"76":876.0,"77":877.0,"78":878.0,"79":879.0,"80":880.0,"81":881.0,"82":882.0,"83":883.0,"84":884.0,"85":885.0,"86":886.0,"87":887.0,"88":888.0,"89":889.0,"90":890.0,"91":891.0,"92":892.0,"93":893.0,"94":894.0,"95":895.0,"96":896.0,"97":897.0,"98":898.0,"99":899.0,"100":900.0,"101":901.0,"102":902.0,"103":903.0,"104":904.0,"105":905.0,"106":906.0,"107":907.0,"108":908.0,"109":909.0,"110":910.0,"111":911.0,"112":912.0,"113":913.0,"114":914.0,"115":915.0,"116":916.0,"117":917.0,"118":918.0,"119":919.0,"120":922.0,"121":923.0,"122":924.0,"123":925.0,"124":926.0,"125":927.0,"126":928.0,"127":930.0,"128":931.0,"129":932.0,"130":933.0,"131":934.0,"132":935.0,"133":936.0,"134":937.0,"135":938.0,"136":939.0,"137":940.0,"138":941.0,"139":942.0,"140":943.0,"141":944.0,"142":945.0,"143":946.0,"144":947.0,"145":948.0,"146":950.0,"147":951.0,"148":952.0,"149":953.0,"150":954.0,"151":955.0,"152":956.0,"153":957.0,"154":958.0,"155":959.0,"156":960.0,"157":961.0,"158":962.0,"159":963.0,"160":964.0,"161":965.0,"162":966.0,"163":968.0,"164":969.0,"165":970.0,"166":971.0,"167":972.0,"168":973.0,"169":975.0,"170":978.0,"171":979.0},"Entry":{"0":"\n\nthrough the Dardanelles fighting. Every comfort provided by the three sisters, Morten Skinner, & Whiteman. Every few hours they go into each ward & enquire as to our needs. The AMC men on duty as orderlies are the limit. They have a habit of forgetting & get tuned up by the sisters. One would forget to give Mac a spoon or else give him milk in his tea, or butter on his bread – two things he abhorred. Another orderly rushed in with a box of pills & gave them round indiscriminately, saying Here`s a pill, I don’t know if its yours or not, but for Heaven’s sake eat it.\" Ron Gow visits me every day.\n\n ","1":" Feel considerably better but cannot get up, as temperature is still up a little.\n","2":"\n\nGet up at last, although no permission is given, & sit outside all day in the sun. A Sudanese dancer amuses us for half an hour by\n\ndancing a jig. He wears a belt thickly populated with mussel shells that jingle as he dances. He also wore a hat affair with small mirrors & shells round it.\n\nAfter dear Sister Morten sat at the piano & gave us some music. The work of these girls must be very tiresome, yet they never complain, & work from daylight till 9pm. Nothing is too much trouble, & they do not \nforget\n. In fact they have a nasty habit of remembering when the next dose of medicine is due, & they see that it goes down. They are as strong as young horses too, so Mac found out. He argued the point one morning over going to bed when sister Whiteman simply carried him there & dumped him in. Mac must have been over 45 years & from what we could gather, he will be \n\nreturned to Australia.\n\n To show the great care exercised by the AMC listen to this. Mac was in a tent when the cricket ball hit him & floored him for ten days. He was taken to the Bungalow where slight cases only are taken. (Operations cannot be performed in Egypt owing to septic poisoning generally appearing later). Mac was then transferred to Ghezireh where difficult & lengthy sickness is attended to. After ten day unconsciousness Mac got up unawares & began to tramp it back to Maadi – a considerable distance – but he was found by some soldiers, with one leggin & a pair of trousers on. The military doctor had him arrested for the DTs (he had been treated with strychnine & was very jumpy.) He then was sent to Ma’adi where he now\n\nlies.\n\nAnyhow, to return, the sisters have the patience of Job himself with the patients. In return they are treated with every respect as they should be & the men are very grateful to them. Tonight, the troop left with all gear etc & took Hoppy with them. \n\n(26\/2\/16) \n\n Get out & return to camp. Although feel very seedy still. Anything rather than lying in bed however. Find one tent only left for us all & most of my equipment also missing. So I am in the Details too. \n\nFirst thing to do is to pinch into Cairo with Hosker & go to the Pyramids. The journey is very long & takes an hour to Gizeh. The tram sets one down at the base of Cheops – the largest of the three Pyramids. About five minutes walk brings one to the base of Cheops. They are of \n\ngreat size & Cheops covers about 10 acres of ground & is over 400 feet high & over 3000 years old. The next striking sight to their siz is the weather beaten state they are in. In places the rocks (2½` square blocks approx.) are loose & have been misplaced. \n\nThe entrance to Cheops is in the centre of the nearest face to the tram. We did not go inside so cannot mention that yet. Many soldiers had climbed & were climbing to the summit but, I did not feel quite strong enough. Camels & donkeys & Egyptians abound here, The latter pester one to death to come inside for \"5 disasters\". One can go inside for nix, & instead of paying a guide, just hang on to the ones who do pay, it is just as good. \n\nAbout a quarter of a mile farther on\n\nlies the Sphinx. I was very disappointed in this, It is only about 40 feet high & is nothing at all to look at. No doubt time & weather have left their marks on it, for it is very rough indeed. It lies in a big hollow & faces towards Cairo. In front & a little to one side, are the Temple & Tombs of the Sphinx. There is very little to see here too, as it is in ruins, The photo will explain far more than I can here. The Columns are of granite & look very nice & the floor is of pure alabaster. The tombs\n \"Hum\"\n of dampness. Here the coffins used to be placed.\n\nWe took a few photos & then left. Camera fiends are round the Pyramids & the Sphinx in scores. Cheops is the only\n\nPyramid that is ever inspected. The others are never heeded. We went back to Cairo & met Freddy Houston & had tea & then went shopping.\n\nCairo\n\nCairo is a very large city & the first thing noticed is the traffic, To explain this concisely, one needs an eye in each elbow & one at the back of the head to dodge the garries & trams. The trams are electric & of French design & make. They are painfully slow however. The tram conductor blows a small brass trumpet instead of a whistle. The stops are very few indeed & very far between. Air brakes are not used. \n\nThe other means of conveyance are garries or cabs\n\n& donkeys. Camels are not seen here.\n\nThe streets are, generally speaking, narrow. The buildings are generally small & dirty. Opera square is the main part of Cairo & here are Ezbekia Gardens, a small park, with a bandstand & restaurant. The YMCA are here too & have a skating rink amongst their amusements. This place is always full of soldiers. A light meal can here be obtained for a few disasters. In Cairo however restaurants are few & far between & the food obtained there is questionable. The price of food anyhow is very high. Anything made with flour is very dear, & a few cakes soon eat up the \"disasters\", trains are very few & far between & travel well up to time & are fast.\n\nThey are lighted with small 16cp electric lights & the accommodation is fair. There are three classes, & soldiers can buy 2nd class tickets & travel","3":" ","4":" class is for natives. The railway stations however are very dirty & dilapidated. Bab –el –Louk Railway station is situated some distance from Cairo Railway station & is the terminal of the Bab- el- Louk, Ma`adi. Heluan line.\n\n Natives are employed everywhere on the railways & tramways. One great trick of these officials however is to keep the change unless you insist upon its refund. They never ask for it, but take it for granted that you do not require it. They also give the soldiers rides up to small distances for \"backsheesh\" or nix\n\nFares are very cheap indeed & in some cases run into a few millemes only. Cairo Railway station is very large considering the traffic\n","5":" Take another trip, to the Zoo this time. The Zoo is on the other side of the Nile & is not very much to see. There are not the same amount; nor variation of animals as in Sydney, but in some respects, the outlay is superior. Soldiers get admission for one disaster but the public must pay 5 \"disasters\". An amusing sight there however is an Egyptian boys band of bagpipes, big drum & kettle drum. The music is passable for bagpipes.\n","6":" Our quarters are now moved to the","7":" L.Horse. This Regiment is called the Fighting sixth after the \n\nCommander Colonel Cox or \"Fighting Charlie\" as he is known sometimes.\n\nTheir motto is \"Fight on Fight ever\" & their emblem & badge is a Fighting Cock. Go to the pictures after tea with Hosker. It is a very poor show of four pictures for two \"disasters.\"\n","8":" Last day of February at hand. Wake at 4 am sick & feeling very crook, so stay in the tent all day being alternately sick & then sleeping. \n","9":" Feel better & start work again. Submarine warfare, or rather slaughter begins again.\n","10":" Getting hot again. Spend most of the day out on the desert with buzzer. Do a test of 36.4 was a min transmitting.\n","11":" Out on the desert again. Put on fatigues again, so we complain, &\n\nthe O.C. orders that we need not do so. (Army orders distinctly state that technical units do no fatigues nor guard work) The sergt major – spites us by giving us a march in the heat. We go down to a cool grove near the Nile & go to sleep.\n","12":" Take up a pass & go to Cairo with Bon Gow & to the Citadel.\n\nThe Citadel\n\nThe Citadel, an old fort & place of worship stands on a hill that overlooks Cairo & the Tombs of the Mamelukes. It is reached by a short tram ride from Cairo. A short walk brings one to the Citadel which is garrisoned by English Tommies. One has to enter by a side entrance that leads up a pathway to the courtyard. At the entrance here one has to pay 1 piastre (in future called\n\ndisaster & which is worth 2½) to have a pair of soft shoes put over one`s boots. This is their custom & is evidently to protect the floor & to lessen the sound. In the courtyard of the citadel is a kind of fountain much the worse for wear & weather beaten, but still shows the beautiful work. All the floor is of alabaster as also are the walls & columns. The Mosque opens off one side & is a huge building, of about 150 feet x 150 feet. roughly thus \n\nThe floor is covered with a rich carpet 25 years old & the walls are of beautiful semi-transparent alabaster taken from the river Nile. There are 5 chandaliers of huge size & beautiful appearance. The roof consists of several domes. Magnificently worked & from these domes hang the chandeliers & huge rings of lights. In all there are 2500 lights. The domes also have numerous small stained glass windows that make its appearance much prettier. \n\nMahomet Ali lies in his tomb just inside the door & to the right. As this tomb is in a kind of birdcage, one cannot see much. Words spoken here are echoed wonderfully. Natives enter here, & remove their shoes & pray. At the far end are two small alabaster columns in the wall that all the blind come to & pray. The mosque is a most beautiful place & would be very difficult to describe, with any degree\n\nof expression. \n\nWe then went out again & round the back to Joseph`s Well. This well is where Joseph stored water during a famine in Cairo years ago, also where corn was stored. We entered a kind of cow shed & dropped through a hole in the floor. A native followed us, demanding ½ a disaster to go down. He had but little success however & we groped our way down a dark & very slippery, steep incline. It was pitch dark & deathly quiet. At last we came to a small window that opened into the well. This well is 15 feet square & drops sheer for 350 feet to the water. Bats abound here, & there is an uncanny appearance about the place. The well is cut out of the solid rock all the way & is a marvellous piece of work. On coming up again, we had to crawl out of a small hole in the wall, & this landed us out in the\n\n \n\nback ruins. From here we could see the tombs of the Mamelukes away back on the edge of the desert & at the foot of the hills. We then went out & round to the front of the Citadel which faces the Mosque of Sultan Hassan.\n\n Sultan Hassan`s Mosque was built of stones stolen from the Pyramids & of is no mean size. The Citadel was once a fort & during the battle of the Pyramids by Napoleon, shots fired from the Citadel landed in the walls of Sultan Hassan`s Mosque. The holes & the cannon balls may still be seen embedded in the walls of the Mosque. We intended to go through this Mosque but our financial position would not stand it.\n\nAt the foot of the steps\n\nleading to this Mosque are some painful sights of maimed, blind & poor begging for alms. Cairo is a terrible place for these sights. It is stated that many children have purposely been maimed so that they must beg for alms. In the streets on the way back to Cairo, to which place we were obliged to walk, on account of our financial position we saw several pitiful sights. One of these was a blind man turning a big coffee grinding machine, throwing himself round with the handle. Many also are stricken so that they simply sit down & sway their heads from side to side all day & night. Such sights are very common & are too pitiful to describe. There is no excuse for the filthy condition in which the natives\n\nlive however. Cairo has no drainage system at all, neither have the other suburbs. The sanitary condition is also disgraceful. The native bazaars are places of indescribably dirty little shops where scores of natives may be seen lying in any place.\n\nThere are but few places where one can get a good meal, at a reasonable price. In the hell-holes of Cairo, that are seldom referred to, the conditions are beyond description entirely & I will not try to describe them, beyond saying that they are simply ant-heaps of crime & anyone frequenting these places runs big risks. In some of the \"cafes\", brawls & fights are quite common & one place called the Eldorado is a perfect inferno of screaming, drunken, men who throw bottles &\n\nact like maniacs.\n\n While on the subject of drink, I may say that those who indulge in the whisky end up in a pitiable state. The quality is such that it turns one into a raving lunatic for the time & I have seen men in the camp \"boob\" under the influence of it, that are enough to cause any sane person to swear off it. The soldiers have been warned times without number about this, but they still persist.\n\nThe native quarters have a fascination owing to their eastern custom & also because there are no other places to go to. The town is usually crowded at night time & everyone goes to Cairo to have a look around. Excitement is always high & shops are open every day & night without regard to what day. Natives make a roaring profit out of their\n\ncuriso, which are usually beads, shawls & such like articles, of very poor quality & high prices.\n\n After our little jaunt round the citadel we went to the Gizeh Gardens over the other side of the Nile, & from there we went to the Y.M.C.A. for tea. \n\nAfter tea we strolled around Cairo as usual until time to go back to Ma’adi, \n","13":" Spent in glorious loafing in & around the tent.\n","14":" &","15":" Signalling all day with lamp practice at night.\n","16":" Go for a walk with Eric through native villages to avoid Fat Wild whom Eric owes some dough. \n","17":" Fat Wild turns up but gets no money\n\n8\/3\/16 Pay day – silver runs short first & then it takes 2 days to pay a few hundred men. Glorious disorder & confusion\n","18":" Go to the Citadel with Eric & Freddy. Eric won`t come down Joseph`s Well. Go to Ezbekia Gardens for tea & then to \"The Kursaal\" – vaudeville show. Eric shows his appreciation of the singing by comparing the singer with a man sharpening a saw. A dag of a show.\n\n On the way back we went to Ezbekia again for supper, & whilst waiting for a tram at Ataba-el-Khardi we saw a native marriage. The procession is headed by a score or two of youngsters then a torchbearer with a cage full of flaming material, then more natives & then more torches & last but by no means least a bagpipe band, two drums, & bassoon & about a dozen youngsters with candles in glass globes surrounding the bridegroom\n\nThe music was beautiful – I don’t think.\n\n During the afternoon we saw a native funeral. This is rather comical to watch. First of all go the man`s property – generally a few donkeys, then natives singing or rather howling, to keep the spirits away. Next comes the coffin – a kind of a box with the corpse in it, borne on the shoulders of a dozen men. The coffin is open - & covered with a cloth & a piece of wood projects upwards from the head. On this piece of wood is the deceased man’s Taboosh (red fez cap) – Eric says he could not go to Peter without a \" tile \" on.\n","19":"\n\nHave a glorious loaf all day. Ryan goes crook on me for pinching out of Church Parade\n\n& threatens to report me, Go for a walk to the native village & during the afternoon go towards old Cairo for a few miles walk. \n","20":" nil all day. Put in for a transfer to transport. Concert at night, Eric & I write letters instead in the tent.\n","21":" Ryan oversleeps himself & nobody takes it on themselves to awaken him so that we get out of early morning parade. Dense fog comes down during early morning making it hard to see beyond the next tent.\n","22":" Buzzer in the Recreation Tent;- Bon & I dance while Frank plays the Goanna. Ear biting takes the fancy of the inmates of our tent consequently the air is continually being rent with shrieks of agony as one fastens his teeth into another`s listener.\n","23":" At breakfast some soldier evidently tired of life in the 6th Regt blows his head off with\n\na service rifle, making a dreadful mess in doing so. A poor way to get back to Australia. \n\nOur letter`s recently have been delayed somewhere or other – only natural considering the fact that some have gone to Seraphim; It is too big a task for the officials to cope with, when anything out of the ordinary occurs.\n\n The organisation of this army is something marvellous, I don’t think. For a week now, the men who volunteered for the artillery have been fooled time & time again. Yes you are accepted in the morning & no you are not, at night. It is positively disgusting to see the awful disorder that reigns. It is enough to dishearten anyone. One tries to do their best, & in return they are humbugged all the time. A definite answer can never be obtained, or if one is given, one can rely upon it being cancelled. Petty, paltry orders & restrictions tying the men\n\ndown to no purpose whatever have made Major Righetti to be very much disliked, (Called the stakety oysters sphagetti)\n\nThe men are remarkably well behaved & yet this Kultur is enforced, just for the sake of something to do. There are too many officers that are absolutely incompetent. Rifles are issued & then retaken. Spurs to be worn and such & such a parade – dismounted parade too, that shows the absurdity.\n\nSo on goes the marvellous military machine, that is skited about by all the Australia ministers, poets, cricketers, MPS & so on. Each one gives his opinion & it is published in the press, as if they knew anything about it, I guarantee that if they enlisted for a while, their opinions would alter. Picking up an Australian paper we see a big photo of 4 tennis players in cream suits, underneath are the words \" Men who have given\n\nup the racket for the rifle.\" How very pathetic & of course it deserves to be advertised. It was a noble sacrifice no doubt, but, judging by the snorts of contempt I doubt whether our fellows look at it in this light. Then there is the direct insult to all when a German called Kayser is put as head of the passport Branch in Melbourne. Is it not disgusting. It still goes on too. And people wonder why we are disgusted. As if there is not enough inconvenience here up with, if one does the slightest wrong we are crimes for instance two men were cantering (& \nonly cantering)\n along the road when an officer hauled them up & they were given 21 days in Abbasia for ill treating dumb animals. That proves the kind of officers there are. Some officers are very good. Others are – well they are not worth\n\ntalking about. \n\nAnother thing that is a disgrace. Where are all the articles that are sent to our troop for instance. Nothing yet to hand. What about this :- £25 & some canteen money were received (the former from a lady in Melbourne) in Melbourne for the comfort of the troop. Not a penny has yet been seen. The canteen profits here are split up amongst the troops. Not a penny yet to hand. On the boat coming from Gallipoli Sergt \n\n framed this idea. If any clothes were left lying about, he would collar them & it cost 6 to get it back. Where the money went to no one would care to say. The same goes on everywhere & one gets disgusted with the whole show. Is there any wonder that the troops play up at times & \"work their heads\" to get back to Australia? Nobody knows where the \n\nmoney goes to – oh! no! only very shrewd guesses & slight hints\"annoy\" those who are in charge of them. We are not quite such a lot of mugs as the people think us to be. No satisfaction can be given if enquiries are instituted. Our troop funds should now total about £150, but it too either disappeared or else it \nmay\n be lying some where. It \nshould\n be spent in the troop.\n","24":"\n\nDust storm & heat, followed by heavy rain that soaks through the tent. At midnight have such a happy family in the tent that I cannot move.\n","25":"\n\nSaturday. Have a glorious sleep all the afternoon & night.\n","26":"\n\nSunday. Another loaf all day & sleep. Write few letters & take few snaps. \n","27":"\n\nCold night that makes us shiver all night, followed by beautiful morning. Early morning (2\/30 am) moon shining\n\nbrilliantly – much snoring in our tent. Laughry leaves for the infantry at Tel-el-Kebir\n","28":"\n\nDream am alive with Chats & awake to find that two drunken sergts are crawling around outside looking for diamonds with matches. Hell of a day \n","29":"\n\nPayday – as usual with a great deal of messing about. Try to write letters at night but Bon Gow`s voice too continuous. \n","30":"\n\nPay at last Have a bit of a splash in Cairo after tea using blue band of signal service as a pass. Pay a visit to the Y.M.C.A. & have a good feed.\n","31":"\n\nHot as Hell & flies very bad\n","32":"\n\nPay a visit to Heliopolis with Hudson & take a few photos. Then go to Museum\n\nMuseum\n\nThe Museum is a big building near the Kasrenie Barracks. In front are numbers of statues & carvings in blocks of stone gathered from ruins in Egypt. On entering one has to pay a piastre to get inside. The inside is of beautiful stone & marble flooring with numerous galleries & columns each branch of the museum is in a separate room & each article is numbered so that one may obtain a description of it by buying a catalogue at the entrance. \n\nOfficials walk about & keep a sharp eye on the visitors & always examine the cases after one has inspected them. Some cases have priceless treasures in them. Every Friday afternoon an American takes soldiers through a part & explains the origin & history of articles in detail, Which makes it very interesting. Ramesis lies in a coffin in a glass case & is watched by an official very carefully. The museum is by far too great to see in one day, as it abounds in marvellous works of art &ancient relics.\n\n& afterwards to Y.M.C.A. Leave the others at the Kursaal & go home\n","33":"\n\nGo to the Pyramids & climb up Cheops with Gow The view from here is fine & extends all over Mena, Memphis & Cairo. \n\nAway down below may be seen the Sphinx & the tombs that are being opened by an American syndicate. Thousands of names are cut in the top rocks & mine was carved on the pole there.Two little nigger boys told our fortunes – the same old tale to every body about two girls in love with us & that we would go to the war – obvious. It took 25 minutes to climb up, & 15 to come down which is worse than going up. I went along to the entrance of Cheops with the\n\nintention of going inside but fell down the slippery slope. One has to take off their boots to go inside owing to the steep grade & the slippery stones. Return to Cairo using the SigService arm bands to ride free on the trams, & come home.\n","34":"\n\nPut on fatigues & have a rotten time working hard. Getting too hot to work during the day now.\n\nGo out to the range & fire 5 rounds each. Lay bets with F Gow & Eric as to best scores. Loser to shout drinks. Eric wash out – Myself ditto. F Gow misses target altogether - so he shouts\n","35":"\n\nNew orders now in force. Reveille 4.30 am. Parade to 6.30 am. Breakfast. Parade to 10.30 am.Cease work till 3.30pm to 5pm.\n\nHot as hell & flies thick as treacle. Sigs put on guard. I get out of it by means of head work.\n","36":"\n\nYoung Gow lays bet of 10 disasters with Eric, Fred & I that the Australians will not be in Egypt in 4 days. Take him on. Freddy`s transfer to Postal Corps turned down & he ramps & raves like a lion over it.\n","37":"\n\nHot as hades all day. \n","38":"\n\nClose of another month. Put in private letter to Naval Commander of Transports Alexandria for transfer.\n","39":"\n\nApril Fool`s day. Freddy falls headlong into a trap & goes to see about his transfer but only gets laughed at.At night he give us his opinion\n\nof Reincarnation & his belief in Theosophy as a religion. He certainly explain the religion according to well know scientific facts but the foundation to our mind is only an assumption. \n\nGo to see Ma’adi Power Station & are shown over it by 2nd engineer \n","40":"\n\nGo to church & on return receive orders to pack up ready for moving in morning 2nd L H Bde details will move off at 9am. Eric feeling unwell.\n","41":"\n\n2 am Reveille blows & all are called out to break camp. Fires are lit and all rubbish burnt. By the light of these fires tents are struck & everything packed up. At 8 am rations are served out & 12 motor transports arrive to transport the camp. All the sigs hang about under our gallant Serg Ryan who is neither use nor ornament as he bums round until we get fatigues Craige & I therefore go down & help load a lorry with kitchenware & as the last few articles go in we crawl forward & take up our position where the \n\nremainder of the goods will hide us. Eventually we are covered with tents & move off, only to wait at the main gates of the camp until the 12 lorries are all loaded, as these transport must all go together. \n\nAfter a while we get half suffocated but the chaffeur, assures us that we are out of sight. At last we moved out & we crawled out on top. Away we tore down the main street to the Nile along which there is a fine asphalt road. The leading transport has an Australian flag flying from a pole & the sight is great. As we get on the road speed increased & the dust began to fly in clouds. Through the streets of Old Cairo we tore scattering animals & human beings all ways. There is no stopping.Time, Tide & Transports wait for no man, and so it was because all traffic has to make way for us.\n\n As we entered Cairo, proper people tore out to see what the excitement was. Trams stopped & all traffic & pedestrians seemed to fade away for us. Again the street widened out into asphalt wide streets & as we tore up here numbers of motor cars passed us carrying officers & red cross cars tore past at great speed. Despatch riders on motor cycles at a greater speed still. These last mentioned have practically control of roads They have the privilege of using the centre of the road & can travel at any speed The dull heavy throbbing of the transports & the patter pitter patter of the lighter cars form a great contrast.\n\nOn arrival at Zeitoun we emptied the lorry &again left for Ma’adi for another load. Ma`adi was practically empty but another load was gathered & we left Ma’adi LH Camp bare & empty. Not a tent stood where scores had been.Only the white outlines of stones showed where our camp had been once. This second trip was a repetition of the first, & the dust cut our eyes & nearly choked us, but we arrived at\n\nZeitoun at last, filthy dirty & tired. Ate tin of officer`s biscuits oranges & apples & even cucumbers. Down to the railway we tore & emptied the lorry & then I struck guard. Craige was left at the camp. I was feeling hungry too, but could not get relieved, so I got on another transport & went back to camp, to find everything in chaos. Men were everywhere, & nothing could be found. I had lost my gear and could not find anybody Well, in a case like this, there is but one thing to do & that is to look to one`s self & hang the gear. I got two biscuits & a cup of tea after a lot of begging & then turned into bed before more trouble came. My eyes were bloodshot & so sore that I could not close them, & my hands were cut about a lot. Our beds were thrown out any where at all. Mine in the stables. I slept more soundly than I ever did before & awoke at 5 am’\n","42":"\n\nTo start work again. after breakfast of the eternal bully beef & biscuits we marched down to Zeitoun siding & began loading trucks. The amount of gear was enormous & filled two train loads whilst we were there. Naturally the officers must have their pot palms & lounges & these made a big heap. We had to burn our gear that was not absolutely necessary. 5 inch howitzers & field ambulances wagons galore.\n\nAt 11.30 we tore out of Zeitoun bound for Tel - el- Kebir. There was no stop all the way except at Zag-a-Zig for water. Cattle trucks were our apartments & were fairly rough too but one does not object to these things when there is some object in doing so. At 2pm arrive at Tel-el-Kebir & begin to unload. Have a row with Ryan over guard, Take guard from 8pm to 10pm. Clouds of dust flying about, no bread no tea, in fact, nothing to eat & not even a drop of water. Feel dirty & hungry. After 10pm I crawl under some old tents & boxes & go to sleep, as I find late on a stack of picks & shovels. \n","43":"\n\nAwake 6am & find nothing to eat again. Flies crawl over us in thousands & torment us\n\nNo wood to light a fire oven. Go through the heat of the day in agony with flies that are something awful. One cannot eat anything, without flies going in with the food. 3pm arrange for relief. 8.30 pm relief of guard turns up & we tramp a mile to camp & arrive to find no food nor tea & only two blankets. Turn in & sleep well.\n","44":" (month obviously a mistake)\n\nturn out for fatigues s& get it solid, scant food & plenty of work. Flies damnable. Take tents from one place to another. Move camp into all positions & thanks to our officers who cannot do anything without a mess, we get fatigues all day.\n","45":"\n\nMore fatigues & guard. Fenton threatens to throw in his stripes. Get paid & go down the town & buy a few odds & ends. Return & go to bed.\n","46":"\n\nFlies again cause us no end of torment.Given signalling on the desert. Heat fierce & mirages all round the Horizon. Rifle inspection in afternoon & more messing.about. Feel sick after tea but turn in & sleep well.\n","47":"\n\nOut for troop drill early morning & then signalling & Eric & I get nabbed for being in our tent instead of on parade. Being Sat afternoon & the only day possible to get a bath it is only natural to expect that the water would be turned off - & it was.. Hot as hell & flies in countless thousands. Issue of tobacco the first -each man getting 1 packet cigts & some shag between the tent\n","48":"\n\nSunday. go to church parade & hear a parson prattle patriotic piffle. Eric snorts about England being the light of the world. Write to Mc Call for transfer recommending Eric as an old school mate. Sink in the kid –stakes in a private letter. Go to YMCA & write letters having about 1 ½ miles to walk feeling very crook, as one usually gets the reputation\n\nof a malingerer for going on sick parades.\n","49":"\n\nGo out on early morning parade & have to fall out twice on account of both legs which seem to get cramps. Tell Ryan to go to – as I am not going out on his bluff. Lie in tent all day & cannot see the doctor during the afternoon, consequently I have to wait till tomorrow. Feel very bad too. Apparently the doctor has a sleep during the afternoon. Go to the pictures with Freddy & Bon but leave after the second picture because of the sickly love making fool so things shown, Bon & Fred stay & see them out.\n","50":"\n\nGo on sick parade with rheumatism in arm & legs & get 6 pills to take. Craigie reported ill & doctor has to attend him. Put on the glorious fatigues carrying forms 2 miles. Nigger does mine for a disaster. Thanks to Ryan bumming around we get fatigues frequently. Stiff wind blowing & raising the dirt. Midnight have to get out & lighten up guys of tent on account of wind. Clouds of dust flying so have to lace up tent.\n","51":"\n\n 3.10 am heavy gale blowing & raining. Freddy & Bon & Frank awake, Freddy gasping for air. Gravel & sand beating in tent & making a choking atmosphere. Outside tents are torn to shreds & blow down. Every few minutes comes a long zip-p-p as a tent tears up. Everyone choking. Loud & prolonged swearing – throughout the camp. All day wind blows gravel & sand in tent. All parades off. Sun hidden & dark all day. Light outside a brilliant orange colour that look very queer. Sand 12 inches high around our tent, & two inches thick inside. Impossible to go outside without getting half suffocated. Inside the tent one can only lie down & put up with it. Food full of dirt & awful. Frank`s eyes badly cut with sand. He looks so funny - just as if somebody had sifted a barrow – load of fine dust over him. \n\nTea time everybody nearly\n\nsuffocated & wind still blowing. Beds full of straw & stones. Cannot wash, so go to bed dirty. Tents rocking & threatening to go any minute. Thank goodness the flies are nearly all killed. The fine dust seems to suffocate them. \n\n14\/416\n\nFew letters turn up amongst them the answer to Colombo letters. Big whirligig (whirlwind) is heard approaching & every body begins to yell out \"look out.\" As it swept along it knocked over the cooks joint & cleaned up as it blew through the camp. It missed our tent by a few feet or we should have been homeless. Makes a fine noise when on the move. Cold winter wind blowing all day. \n\nNew reinforcements arrive & begin to lay down the law. We won`t stay here they said \"We are leaving for the artillery & they began to get the names of those who \" were going to transfer.\" Very nice to hear them say so. At the railway station after tea some fun took place. We are the fellows that shook things up in the riot said one fellow\". I`ll bet he wished he had shut up. His awakening will probably take place tomorrow some time. These men are the ones looked for & they will get snouted. This fellow did get slathered up. His face was a perfect picture & it only took one hit to paint it. You see they are far from home & sympathy here & riots are not fashionable. Fights are easily bought. More fun promising.\n","52":"\n\nReinforcements still arrive. Fights easily bought still.Freddy goes to Cairo\n","53":"\n\nHot as hell. Wash clothes.\n","54":"\n\nRyan goes & reports Bon & I off parade & Bon gets towelled up by Serg Toby. I get pick & shovel work digging a trench but get out of it by working my head. After breakfast go out with buzzer & get called back with orders to go to the Sig Coy at the bottom of camp near Tel-el Kebir & railway station\n\nReport there move baggage & gear. Get asked what we are doing with bayonets by Lieut Hamilton (Military Cross) but Ryan excuses very nicely instead of getting our argument home. He did go crook because we had bayonets & said we had no right to have them nor to do guard & fatigues & promises us a better time. This camp is the depot of Engineer Sigs so we can rely at least on getting a fair deal. Have our personal history & abilities taken. One thing that is absurd is the fact that our letters must be read by NCO`s & then passed to the O.C. Mine will have to go another way.\n","55":"\n\nArise at 5.45am. Freddy getting me coffee & biscuits. Turn out for Physical jerks, flag drill & then a lecture by Major Rossiter O.C. Of all the wower-istic calathumpian bangers he tops the lot. A real old woman but his redeeming feature is the fact that he has the mens’ comfort & interests at heart&he does all he can to make things comfortable. Ryan of course keeps well away from us whilst flag wagging since he is out of all signalling. For swearing we are threatened with various periods of pack drill as punishments according to the strength of the language. Damn for instance brings two hours & the punishment rises in successive steps with the offence. I can see plenty of pack drill amongst us if he hears the conversation.\n","56":"\n\nMore cricket & sports during the morning & all day. Food pretty good only bread scarcer, one loaf to three men for 24 hours – hardly enough considering the little else we get. \n","57":"\n\nGo to 6th L.H. for pay. Lecture continued – a lot of talk about nothing & full of funny (?) stories. Major Rossiter appears to be one who would gloat over one if he punished him. His one aim seems to be to strike terror into our hearts by threats of punishment, gloating, with his beady eyes like an elephant But he does not frighten us at all\n\n20\/4\/16\n\nSleep in till 8am – glorious- & put on fatigues getting QM`s stores. Go to battlefield of Tel-el-Kebir it being a 15 miles walk.\n","58":"\n\nGo to lecture on battle of Tel-el-Kebir\n\nLecture by Capt. Rollands\n\nBattlefield of Tel-el-Kebir 1882\n\nMain trenches\n\nA. Gun placings & dam across canal. B 4 guns\n\nB. 5 guns D E & F Nil\n\nThe English attacked in 4 divisions Araby Pacha’s outposts very bad. One of Arabi`s outposts 150 sees the 2nd division advancing. Araby &2nd in command skin out to Cairo. 400 British casualties & \n2000 Egyptians killed\n\nMahomet Ali mosque built about 1804.\n\nTree\n\nMahomet Ali - son- Ibrahim – son— Ismail\n\nThe Egyptian National debt was 9 million £ when Ismail came to throne. Rose to £93 million in 1898. In 3 days he built the Giseh riad to the Pyramids by forced labour because friend Princess Eugene wanted to go to the Pyramids. He also built No.2 General Hospital to house her. Ismail loved to spend money and kept no a\/c between his own and state money. The people were taxed 6years ahead. He loved to borrow. Neuva Pacha appointed Prime Minister by the Powers (Eng & France) \n\nTel –el-Kebir started by a mutiny among officers who had not been paid for 6 years. 2500 officer & 2600 troops. Minister offers to pay them half. Ismail compels Eng & French to dismiss Neuva Pacha & has a parliament of his own. Eng & French Ismail who gets away with much money & 300 wives.\n\n1879 Tewfik came to throne.1881. First Arabic rebellion of Araby Pacha who was son of a farmer. Araby Pacha & Colonel arrested but released. Ruler of Egypt at this time was the ruler of the armies. Mutinies frequent so the Powers intervene, Bombardment of Alexandria begins. Araby declares war with Eng. (Wolsely leaves in charge of English ) England takes canal, Arabys plan bad. 2 battles at Kassasin.\n","59":"\n\nSaturday night 11pm instead of having lights out &asleep the boys were playing cards. The major happened to come around & caught the tent behind ours. Our light went out before he saw it but B in the tent next to ours let out a few choice words. The major immediately called out – fall out the man that used that word -. Nobody moved in our tent so he came & made us all get dressed & fall out. We were absolutely innocent & B – had not the pluck to own up so we got pack drill & were called liars fools & pigs by the major. Frank Gow answered him back & he roared at him & sent us back. In the end we beat him & next morning ","60":" we had to sign papers give evidence etc etc just because he major heard our tent use the language. Spent the day writing letter.\n","61":"\n\nMore trouble with major. This time Dwyer who was drunk & told the major off in a true Aust style. \n","62":"\n\nGo through medical exam & are ordered to leave. Catch 3pm train to Zagazig.Leave Zagazig 5pm & arrive Salhiah 7pm. Turn in to sleep under some date palms in the Police Yard.\n","63":"\n\n8.30am send kits back to Cairo & leave for El Kantara on the canal.\n\nArrive here & have to walk 4½ miles to Hill 40. I get on a wagon. Put on HQ Signal Office from 8pm to 12 midnight.In a dugout by candle light hear all the news of the battle 18 miles away.\n","64":"\n\nAeroplanes, Anti aircraft guns, machine guns etc galore. Huge Camp.Put up wireless station & plenty of hard work. Meet Hop & Pierce & others. Hear guns firing all day & see aeroplanes & see returning ambulances with sick & wounded, Marvellous camel trains, Two railways out to Rail head & to Hill 70.Water scarce & have to be carted.Turks capture yeomanry & cut up men with machine guns & then try \n\n& get\n\ntheir boots.Turks very short of footwear. \n\n","65":" \t\t\t\t\t\t\t\t\t\t\t\t \n\nBritish Aeroplane hovers above our camp & gradually volplanes until with a rush it swept over about 100 ft up at the same dropping a despatch tied to a white &blue streamer on to the signal office. Naval guns on canal can be heard firing all day.Listen in on wireless set &made No 1of No 5 wireless station.\n","66":"\n\nSerg Bostock leaves for Duada with wireless set. Hard work all day & no breakfast - no dinner & feeling very empty. Short rations from yesterday making it worse. Chase the train for a crust of bread but have no luck. Makes me think of all the puddings I have turned down at home because it was burnt.Wish it was here now. Tempted to eat a bit of candle. Horses also short of food. Such a godforsaken hole as this is the beginning of active service conditions. In the end we are forced to swap a hat for half a loaf of bread from Tommies.\n","67":"\n\nFood at last. Bully beef for breakfast.(from Tommies) Bread & jam for dinner &rice. & raisins for tea. To satisfy our feelings we back four times .Each one in turn takes the lid of the dixie back for a little more & each time we get the lid filled. Glorious feed\n","68":"\n\nPicquet from 2am to 6.30 am word received that General Townsend has surrendered to the Turks.\n\nCook`s fatigues for the day, chopping wood & spud barbering. Gows put on cable waggons. Trickett – a lad just arrived & an amateur fiend drives us all mad by yapping all night & day about wireless & declaring that the engine in the pack set shook the ground & the dynamo went.\n\n – flinging his arms about. At last we persuade him to sleep by the instruments & & he did so to our complete delight.\n","69":"\n\nAeroplanes again hover over camp & volplane down beautifully. They usually approach high up & when almost overhead, they warp one wing which tilts the plane & she swings round & dives with just a\n\nslight swinging from side to side. The engine exhaust is held open so that the engine stops. When down low the wings are straightened & the plane takes up the horizontal position at the same time the exhaust is closed & with a spurt of smoke the engine starts.\n\nAt the same time a red yellow & black ribbon floats down with a despatch. Should nobody pick it up, the plane soars round & round until attention is drawn to it.\n","70":"\n\n4.30 am aeroplane passes low down over camp making noise like huge traction engine. \n\nGerman wireless stations over the wireless. Put on quartermasters fatigue & general work. Have a ride to Kantara in limber waggon\n","71":"\n\nGo to sleep & get out of parade. Picquet again 10.30 to 2.30am\n","72":"\n\nQ.M’s fatigue again plenty of work. Oversleep parade again. Getting touched up with sun\n","73":"\n\nTroop leaves for 3 days work out front. Take horses to lake on way to Kantara for a swim. Deadly salty water & muddy bottom. Heavy gunfire from NE coming in splitting crashes. Aeroplanes fly around all day. \n","74":"\n\nSunday. Terribly hot day like hell with the lid off. Lie down & sleep all day. Aeroplanes flying about some very low dropping despatches. Motor train appears on the line which looks very queer, travelling about 45 miles per hour.\n","75":"\n\nCooks fatigue again & have to work like son of a gun. Rations again short 3 cups of sugar for 150 men in the lid & two tins con-milk which makes a rotten drink. Lime juice off. Stew full of flies. Develop photos.\n","76":"\n\nTake watch on wireless instruments 8am 12noon.Hot as hell. Water horses our own way & take 8 minutes to go 200 yds & water them, whereas by military ways it takes 45 min forming fours & advancing in column of lump.Take relief at dinner &get the signal hostile aeroplane up which is later on cancelled. Take watch from 12mn to 4am.\n","77":"\n\nHeavy gun firing at 6am from warships. Shift from 4pm to 8pm. Very poor days rations. Breakfast piece bacon weighing ½oz & cup tea. Dinner nil & slice bread & jam. Tea bit of stew. Most remarkable fact that no orderly officer appears for complaints when there is a cause for them. If the food is there it is one continual\n\nKantara – Rail Head 20 miles\n\nRomani 25 miles\n\nquestion. \"Any complaints.\" When short there is no sight of them & if we do complain there is absolutely no redress. Fancy being able to eat a meal in two mouthfuls.\n","78":"\n\n22nd birthday. Shift 8am to noon. Hoppy concludes the day by throwing me off my feet when unaware causing me to fall head first on tent peg. Plum duff for tea, everybody goes mad with delight. Suffer afterwards\n","79":"\n\nBreakfast NIL. Dinner NIL. Tea stew & bread & jam. Develop photos. Shift 12mn 4am & 4pm 8pm \n","80":"\n\nHuge camel trains pass camp some miles long. Take an hour to pass in single file. Shift 8am – noon.\n","81":"\n\nSunday.110º in shade & wind like furnace\n","82":"\n\nHotter still 115º in shade.Take Girlie for swim in Suez Canal at Kantara.\n","83":"\n\nVery hot day 120 in shade. Drink gallons of water. Food not issued again. Some fellow taken away. Sunstrock\n","84":"\n\n125º in shade. Like hell. Sand burns ones eyes nearly out. Flies too stupid to crawl about. Food again bad only get piece size of walnut & slice bread & jam & cup of tea with no sugar. Complain to orderly officer & have name taken - finish. \n\nHear strange wireless station with telefunken note squealing away continuously, dinner nil – tea nil.Starvation all right.\n","85":"\n\nNo breakfast & no dinner & no redress – makes one feel very down.\n","86":"\n\nNil for breakfast. Burnt rice & raisins for dinner. Stew for tea. Take Girlie for swim in Lake\n","87":"\n\nFeeling bad – want something to eat. Missen goes out to it & collapses owing to being forced to cook in the open. Food again short & very poor.\n","88":"\n\nTest out wireless stn W3. Very bad one indeed. 5 enemy aeroplanes up\n","89":"\n\nUp all night on watch & all day on fatigues. Capt Johnson & squadron have a row over fatigues. Pay at last & get £3\n","90":"\n\nFatigues early parade. Go to Kantara for the sole purpose of buying eatables. Buy fruit, milk, coffee, cocoa, soap, sugar, biscuits, sweets, etc up to 14\/- worth, & have a great blow out\n","91":"\n\nGeneral Chevalle inspects the camp. Complaints in reference to food\n\nare many & strong. He says he will look it up – Saiseda Wireless station WA2; leaves for Dueida\n","92":"\n\nfitting itself up at the expense of WA3 on which station I am left. Take over WA3 & set about knocking it into shape, taking up 8 to 12am & pm\n","93":" \n\nTune up WA3 & get good results. Make the place like home & make sandbag couch. Have a glorious feed with Chatty. Blanc-mange smoked - & a la cocoa flavouring with rice & raisins & marmalade jam & peaches which makes a good salad when liberally covered with condensed milk. Hourly calls with WA1 & WA2 cease.\n","94":"\n\nTold that we are to be put off WA3 station & let other operators take place. No supper owing to the tanks being dry & no water on Hill 40. Issued with tinted glasses\n","95":"\n\nHot as hell again. Troops leave for the front – aeroplane hovers over Kantara for two hours dropping smoke bombs as targets for warships at practice. Continual rumble of guns. Attack being prepared for tomorrow\n","96":"\n\nAeroplane again about hanging very low.\n","97":"\n\nAll quiet ready for the attack. Night time code messages come through referring to the time of attack. \n","98":"\n\nResult of attack is 15 dead Turks, 7 capture & 2 of our men wounded. The main body of Turks got away.\n","99":"\n\nTurks get back one by dropping a bomb on Romani near the sig office killing Lieut Kerr & wounding Lieuts Braithwate &Smith all of the Signal Squadron. Causes some excitement. 6.30 am enemy aeroplane signal sent out from WA1 reporting plane going west.\n","100":"\n\nGirlie returned to camp wounded inside by piece of bomb. Looks rather sick. WA2 dismantles & moves.\n\nA3\/6\/16\n\nAnother stunt being prepared & insistent rumors of France.\n","101":"\n\nDust storm that nearly chokes us. Feeling very crook – overeating I think as Chatty & I have had four eggs each each meal, besides the usual fruit & custard.\n","102":"\n","103":"\n\nPinched into canal for swim. Had a glorious time.\n","104":"\n\nHot as hades. Another stunt on.\n","105":"\n\nAll taken off WA3 except self. The fiend moans as if he were to be shot.\n","106":"\n\nNew men take over set. Pinch into canal for swim again. Glorious time Trickett & Bunker leave for Romani. Try to send message to Dueda by radio, but cannot raise them. \n\nCall for ¾ hour & get no answer. Receive word over telegraph later to effect that message had been received ok from that sent to Romani. Of course we had not been told that their set was not to work. Like everything else – all mess & muddle. They had received instructions that their transmitting gear was by no means to be used, but we were not advised of that fact. Thick blanket of fog comes down.\n","107":"\n\nChatty leaves for Dueida. Stunt on again. Hop & I pinch into canal for swim. \n","108":" \n\nDown the canal again for a swim. Stunt started & wireless stations open up opened up for work. Chatty goes despatch riding. \n","109":"\n\nAm asleep at 3am outside wireless tent & am called out to see enemy –plane hovering above. It was a Taube 6000 feet up & like a small white enamel butterfly moving rapidly away towards El Arish. He had been to Kantara & dropped 6 bombs killing 15 mules & wounding 2 men. Had got back so far without a shot being fired. Machine guns opened with a TAT.TAT.TAT.TAT.TAT but nobody had a chance. One of our big Bristol planes gave chase but had no chance. It looked like a big dragon fly. About an hour later a big white plane is seen away above going towards Kantara. TAT.TAT.TAT.TAT. go the machine guns & up goes the plane higher. The plane goes towards Kantara & comes down lower & lower like a corkscrew. Machine guns keep up until it is seen to be our own plane returned. Not hit luckily. Had been reported by wireless that enemy plane was above from Romani before he got here & it was\n\n(See page 151)\n\nThis follows after P151 \n\nCanal. Hire boat & go for a row about. Pass K1 aerodrome. Mahino hospital ship. Ben Machree HMS Jupier & HMS Fox, HMS Aphis (Monitor) Several French warships also. Take a garry & go for a drive around the town & see the main sights.\n\nPt Said\n\nPort Said is a small place considering the amount of traffic by sea & the position & as is usual, is a native town. It has a very pretty beach which however is dirty & is dotted with a number of dirty bathing houses. The streets are good in parts, whilst others resemble Cairo. The harbour is not very big, but is very thick with traffic & the shipping here is enormous. French warships guard the entrance to the canal whilst a few British warships, monitors & others are permanently stationed.\n\nThere is an aerodrome on the far side of the harbour & in this place are some big seaplanes. One flew out whilst there & made a great noise, & was well worth seeing. The accommodation of the hotels is good but expensive in the better places. The Casino on the beach is only open to officers & of course is very elaborate. A typical sight in this town is the money changer who sits on the corner & changed ones money. \n\nAs in Cairo one can obtain light refreshments at reasonably cost which are served on tables on the footpath. The heat here however is intense & is that moist heat. The canal buildings are on the harbour & are beautiful. Native police patrol the streets & keep the niggers quiet. Native town is out of bounds & is apart from the main town. The town is not very busy & the main streets are planted with trees on either side that give some shade. An old donkey train is the only means of conveyance beyond the familiar garries. \n\n \n\nThis follows 149 \n\nTurn into bed at 11pm after going to a terrible picture show. What a glorious feeling. One has a cold shower & then into a good, bed electric light & every comfort. Awake 7am\n","110":"\n\n& Gippy brings tea & biscuits. Boot black cleans leggings & boots & actually wants to backsheesh but gets nix. Gippy reminds us that it is 7.30 tell him to get out. 8.00 he returns & again we refuse to take any notice 900 returns & still we stay in bed. 9.30 we get out & go to breakfast. \n\nGo for row to the French cruiser JAURIEGUIBERRY. A sailor show us all over & explains in French of course. I am able to understand some of it so three other soldiers accompany us so as to make out what was what. Little they knew that what I did not understand, I put my own construction to & they thought me a good French scholar. Luckily I had no need to speak in French. This cruiser is bristling with guns & like all this nation’s boats is high up & very powerfully built. Guns are beautifully balanced & are easily moved by turning a small wheel. See the wireless room down below, also the torpedoes lying on the floor like polished porpoises. Awful clammy heat.\n\nCatch the 6.30 back to Kantara & misery. Arrive there 7 pm so have to wait four hours for the puffing billy to leave\n","111":"\n\nLeave Hill40 for El Fedant which is said to be a good place. Have to camp outside Kantara for the night, so go for swim in the canal & then to sleep.\n\n24\/6\/16\n\nUp 4am & breakfast & leave at 5am. Arrive at El Fedan 5pm & camp. This place (Rail head) is six miles out & is a dismal place.\n\nSee page 152\n\nThis is continued from P148 \n\nNot reported from here so that nobody knew of its presence. When our own plane was above us on its return we thought it was a Taube so horses were cut loose & men ran all ways.A great mess up\n\n12\/6\/46\n\nExpected to see Taube return as there were only machine guns (Lewis) here, but no sign of him. Go to canal for swim\n","112":"\n\nGo for swim again. Enemy plane reported up 7.20am going west. Horses cut off lines & generally confusion everywhere. Great fun to see the kerosene tin get banged about to give warning. \n","113":"\n\nPayday. Taken off wireless, & put on picquet. Have been crook for some day so go to sleep & wake at 4am instead of 2.30.\n","114":" \n\nHot as hell. No mail for 3 weeks\n","115":"\n\n;Hotter than hell. Flies damnable. More work - reveille 4.30am\n","116":"\n\nNo mail again. Cooks fatigue. Ten planes fly over 6.30am & return 10am after raid on El Arish. \n\nA great sight. Sherman & horses arrive – more work 10am planes return minus 1 observer & 3 planes. One plane drops into sea & is rescued. Two others brought down. Enemy aerodrome blown to blazes.\n","117":"\n\nPlane goes over &shows signs of their scars from yesterday. One has big patch on one wing. Cooking all day in heat of the day \n","118":"\n\nCooking. Artillery practice near camp.\n","119":"\n\nGet leave to go to Pt Said. Pass issued later naturally & too mean to allow us to ride a horse into Kantara to catch the train. A case of having to walk five miles which puts one into a bad mood for a start as it is awfully hot. Catch the train by a bare few moments & arrive Pt Said 12.30\n\n& make for the Continental Hotel with Westwood. Arrange for a room & accommodation & sit down to a good meal with clean table cloth & glasses etc & Gippy French waiters to attend one. Feel quite happy. Terrible heat, the perspiration soaking through one`s tunic. Go for walk out on the breakwater & take a few photos. Huge british sea plane flys around the breakwater & lots in the \n\nContinued on P149 \n\nThis follows P 150 \n\nwith nothing to see but sand for miles.\n","120":" \n","121":" Up 4am. Breakfast & off again to Abu-el-uruk to be attached to 1\/9th of 126th brigade of Manchester Tommies. What a great place. Sand & sand hills as far as the eye can see. Erect station & have phone put on with HQ. Aeroplane observation post way up on the hill. Station comprises Feeney, Tricket, Brett, Self. Hamilton`s 1 & 2. Get all we want & have a good time although so far away from every one. Take watch from 7 till 11pm. As usual, when we get message from Ismalia – no code works – so more trouble\n","122":"\n\nWatch from 7am to 11am. The fiend burns a hole in the instruments also the ration book evidently through falling asleep. It is not a nice job keeping awake all night.\n","123":"\n\nFeeney glowrs at the fiend because he knows too much & yet so little. The fiend is offended for a while. We follow up & do him another.\n\nMissen arrives. Aeroplane warning\n","124":"\n\nAeroplane warning\n","125":"\n\nVisit the little church with its tower & clock that always shows quarter to eleven. Have sports of our own in the sand. Report of capture of Von Hindenburg & 42 thousand men hailed with delight. Food very bum, Tea & tea again. Go digging for rats on the desert but have poor success.\n","126":"\n\nFood again very bum, tea & tea once again\n","127":"\n\nFeeling hungry again as there is only tea stew for tea \n","128":"\n\nColonel`s birthday. In honour of which we are given rice for dinner. Tasteless stuff without milk or sugar. Stew just an oily mass of fat. Tea thin as 3d & vile. Take down the set to repair detectors. Only tools available are penknife & screw driver\n","129":"\n\nPoor food -tea & tea. Try to align key contacts & break same. \n","130":"\n\nSame old food. Buy salmon – bad. Heated argument over Melb & Sydney \n","131":"\n\nTerrible stew that makes us crook. Tea that is vile. Practice with calico aeroplanes ships. George Hamilton gets a cake from Australia.\n","132":"\n\nMore bad food. Aeroplane warning from Romani\n","133":"\n\nOfficer tearing about on horse 2am looking for patrol.\n","134":"\n\nArtillery and machine gun guns etc out on an imagined attack firing live, shell overhead. Stoke guns also making big noise. TAT TAT TAT TAT All over the place. \n","135":"\n\nRice for tea hailed with expectation – uneatable – bitter & mushy & as usual no milk or sugar. Catch a young snake. \n","136":"\n\nGeorge finds a chameleon that causes great amusement. No letters again. Plum duff for tea that is as heavy as lead. \n","137":"\n\nAeroplane message from Romani. Catch another chameleon. No letters again, terrible food.\n","138":"\n\nCatch another chameleon which is called Hector. Cuthbert is others`s name.\n\n(note. No","139":"\n","140":"\n\nStill bad food. Arthur’s birthday.\n","141":"\n\nPayday. Come to rescue of the fiend who missed a message from Ismailia & generally does his block\n","142":"\n\nhave a great blow out & get sick through eating. have some of Davies` bully beef with \"hooks\" in it or rather suspected of having such. \n","143":"\n\nBunny Brett leaves for Pt Said prepared for a big parcel of goods\n","144":"\n\nWar news begins from Ismailia. Message missed owing to jamming & is not received till 9am\n","145":"\n\nBunny returns from Pt Said with photos goods etc. Receive three letters at last.\n","146":"\n\nTaube up again flying over Kantara. Overhaul generator to get 16 strength from Ismailia. \n","147":"\n\nTaube up over Kantara.\n","148":"\n\nAeroplanes up over Tantara \n","149":"\n\nRig up buzzer for the fiend & send him war news. Have to get others\n\nto massage hand owing to cramps. Send Ismailia message reporting aeroplane down at Bridgehead El Ferdan Quick work. Coded sent & acknowledged in six minutes.\n","150":"\n\nManchesters leave for El Ferdan. Relieved by Australians. Go down & gather any goods worth taking. Get a cupboard, buckets, table, chairs etc & make a great home. Also get six tins of asparagus from QM. Great betting on our having to move soon because we are too comfortable. Australians go to the trenches singing. How dry we are.\n","151":"\n\n10 past twelve am message received from HQ to be ready to move off – just the way. As soon as we get comfortably – off, we go. Aeroplanes reported ten times.\n","152":"\n\nMore aeroplanes up. Still waiting. Receive orders to pack up & leave for Bally Bunion. Nobody knows where the place is & we cannot find out. Transport fails to turn up so we turn in.\n","153":"\n\n4 am up & leave at 6.am for Rail Head. Tranship stuff to train & go to El Ferdan. Have to walk 6 miles to Ballah behind the limber because office forbid riding. Half way meet Australian limber & ride to Ballah & have swim in canal. Have to wait for train out at 3pm. Arrive Bally Bunion 4 pm & camp anywhere. Buy watermelon & tinned salmon for eat up. Doss in timber stack for night. Feen gets blithered on \"3 gees\"\n","154":"\n\nFeen causes trouble. Been nipping early morning. Harts flashing authority about & making nuisance of himself. On erecting station he gives wrong direction. 3 times so refuse to erect. Rushed at me going to have a piece of me. Have a piece of him instead. Get properly mixed. George Hamilton saves situation & take over erective of station\n\nFeen drinks himself sober, loafs. 9pm all square & ready for work. Traffic at 7pm & of course Trickett gets excited & mucks up message. Working with Kantara Light Horse arrive & leave by score.\n","155":"\n\n3rd LH Bde. Arrive under Brig Gen Anthill or as he is generally know as Gen Bull Ant. Do some cooking & make awful failures in way of pancakes & scones. \n","156":"\n\nTaubes up again Kill 2 men at Kantara. Band music at night. Order sent for the wireless station supplies.\n","157":"\n\nTaubes over Kantara\n","158":"\n\nMore aeroplanes up doing damage\n","159":"\n\nPay day draw £2.Scorer & Jeffreis arrive from the squadron \n","160":"\n\nLeave Bally Bunion after LH regts On camels & wireless gear. Arrive Hill 70 at 1am\n","161":"\n\nsleep in YMCA. On again to Duieda where we spend dinner with WA2 wireless staff. Proceed & arrive Bir-el-nuss at 3pm. Leave with instructions to meet orderly on telephone who would direct us further. Go on, followed by AMC waggons & camel back stretchers. Meet 3LH men & no orderly who had misheard. \n\nBattle going on at Katia See shells bursting & anti-aircraft guns firing at Se Bristol plane. Decide to chance sleep in oasis of Bir-abu-rame. Receive word that Turks are advancing and we must retreat. Bir –abu-rame had only been vacated the previous night when AMD had chased them., & the Turks\n\nhad left most of their gear. Pack up & inshi. Horses nearly done & camels very slow. Indians cause delay by arguments. Arrive Bir-el-nuss again & hear that troops are mixed & spread over the country. Men return during the night. \n","162":"\n\nMen bring in 500 prisoners & two German officers. Are off station for few hours. Water very brackish & practically undrinkable. Leave & arrive at Bir Nagid & get fresh water. Leave with engineers & arrive at Hod-Abu Farein. When between this place & Hamiseh a Taube evidently gave the position of one camel transport & one of the Turk`s howitzas opened fire and sent three towards us which luckily fell short but frightened us a lot.\n\n Pass many old Turkish camps, dead horses & camels & some shell holes in the ground. Arrive Hod Abu Darem 10 part pitch set. Firing going on all night Camels get away with haversack goods. Firing by artillery during morning. Shrapnel & high explosives. Taube visits us. Get Koran from Turkish leavings in camp. Ammunition found every where underground. Feel a bit shaky on a big gun the Turks have which lobs a few shells about. Water short. Feel very dry\n","163":"\n\nLeave 8am for Abu dhahab oasis water still short & dying for a drink. Arrive 2pm & erect station & do some messages indeed. All night up on cipher. Leave again\n","164":"\n\nfor Hasanein where we are blocked owing to Turks being strongly reinforced. Artillery open up with high explosives. 3 batteries of ours sweep the ridge behind which the Turks are, with shrapnel & the other batteries pour shrapnel over the far ridge. Turks leave in hurry. Monitors fire round after round into them.. Some splendid shooting. Go down to the oasis for a spell. Terrible water, vile taste of gunpowder. Doctor orders no drinking it. We do as we are parched. Turks fire shrapnel over to us with an occasional high explosive. Wounded brought in. Continual rumble of guns like huge iron tank being rolled about. Shrapnel bursting everywhere Aeroplane (Bristol) gets warm reception by shrapnel & lyddite but escapes after running big risks. Have to leave owing to no water. Arrive Abu Dhahab 10am & have to erect & up all night. No candles so have to keep fire up. Very bum. Terribly thirsty & hungry too.\n","165":"\n\n3 am turn in to be awakened 5am so decipher msg. Messages going all day. Have a glorious sleep for 3 hrs which was badly needed\n","166":"\n\nUp 2am & off for Hasanein. .Arrive at 6am & erect. While erecting the station a Taube & a Bristol have a fight which resulted in both pilot & observer of the \n\nBristol being seriously wounded by machine gun on Taube. Bristol has to descend. Fighting right overhead. Taube drops two bombs rather close to be pleasant. Shrapnel pellets falling from Turks shells fired at the Bristol. The heads decide not to attack today owing to the Turks being too strong. Await developments. Pack up & return to Dhahab for night. Absolutely done up so get the night off for a spell.\n\n12\/8\/16\n\n4am off again to Hasanein & erect station. German Telefunken station causes trouble by going on high power & sending niecht huber, etc etc. Messages overtake us & we have trouble in deciphering them. Proceed to Hasanein at 6pm where HQ are now to be. Turn in 9pm & have a great sleep which is badly needed.\n\n13\/8\/16\n\nSunday Taube visits us & drops two bombs which are badly dropped & land a long way off the hod which is full of horses etc. Visit the hole where they fell. One hit the bank of a sand dune & had torn a big hole there & for 50 yds out from the bank is a big black splash where the powder had charred the sand, .. Find lots of fragments of the bomb. Erect station again. 9 machine guns erected.\n\n14\/8\/16\n\nTaube visits us but leaves before coming into range. Water condemned owing to cholera germs being found in it. Two cases cholera. Frank Gow pays us a visit. Sorry to say that someone cannot be trusted as this diary has been made public by one known.\n\n15\/8\/16\n\nFeen sent to hospital through being burnt by exploding of Primus. Cpl Brown to be sent out. Trickett again gives trouble. guessing messages. \n\nLetters but none from home yet (June 4th last) Brett arrives on scene on trotting camel & gets all the \n\nnews from Trickett who cannot keep his face closed.\n\n16\/8\/16\n\nBrown arrives 4pm terribly hot day & many flies.\n\n17\/8\/16\n\nHeat like a furnace. Taube visits us & hovers to see how many men will leave the Hod in a hurry but is dissappointed with the result.\n\n18\/8\/16\n\nInoculated against cholera which has caught a bit of a hold on the troops here. Water condemned for drinking purposes. Build a neat little dugout to sleep in.\n\n19\/8\/16\n\nCapt. Downing arrives with Brown`s station who relieve us. 9am leave for Romani Travel all night to Bir Negligeb where we rest for 1 hour & meet WA5 station. 3am both leave again & arrive at Romani\n\n20\/8\/16\n\n8am.Pass half buried Turks & great craters & junks of shells two inches thick. Have a great sleep\n\n21\/8\/16\n\nLie about all day doing nothing\n\n22\/8\/16\n\ndo ditto today. Receive mail from home. Celebrate the anniversary of my enlistment.\n\n23\/8\/16\n\nGlorious loafing & great food. Inoculated again against cholera. From our position which is high up we can just see the ocean & all over Romani. Having great time so far but seems too good to last.\n\n24\/8\/16\n\nNothing but sleep all day.\n\n26\/8\/16\n\nGo to Mohammidiya for swim & have to walk home owing to trucks off the railway. Get some what sunburnt. Big mail does not turn up as expected, NSW portion gone on to Endamid\n\n27\/8\/16\n\nNothing doing at all-\n\n28\/8\/16\n\nNil\n\n29\/8\/16\n\nTwo aeroplanes visit us & drop 100lb bombs that are snifters. Fired at by anti-aircraft guns. Wind of this had been received by our spies & we were ready for the attack although we expected a bigger one. Taube gets away as usual \n\n29\/8\/16 (Note duplication)\n\nAll quiet again\n\n30\/8\/16\n\nGo to Kantara to get kits at NZ Transport Park Sturman tears my head off for going above his head. Getting few letters now. Have to sleep Kantara Rwy station over night\n\n31\/8\/16\n\nArrive Romani 8am with gear\n\nReceive parcels from home with photo goods.\n\n1\/9\/16\n\nCloudy morning – on watch WA5. Taubes bomb Pt Said – hear guns. \n\nTaubes fly over here. Try to warn howitzer battery no good.\n\n2\/9\/16\n\nLeave Romani 7am for Hod Amara. Pass through Katia & arrive Amara 3pm & relieve WA2. Do 6 to 8 pm shift.\n\n3\/9\/16\n\nWA2 leave here 7am for Romani for a spell. Taube visits us & passes to Romani. Guns heard evidently firing at the plane which returns and flies around us before leaving. \n\n4\/9\/16\n\nGo out for watermelon & dates.Lovely cool day\n\n5\/9\/16\n\nTaube over again gets rather furious machine gun fire. Go to \n\nDeBabbio & Freuva with Missen for curios & photos. Many dead horses at Debabbio. Air raid on El Arish to take place tomorrow morning. Develop photos after tea.\n\n6\/9\/16\n\nEl Maza – between Salmara & El Arish bombed as a reprisal for bombing Port Said\n\n7\/9\/16\n\nGo out for water melons. Monitors lob a few shells on El Maza.\n\n8\/9\/16\n\nVisit Bir el Abd battlefield & find scores of dead Turks & many NZ`s graves. The NZ`s graves have a cross above each one & the soldiers hat, rifle & gear (what is left of it) is placed on top. A dreary resting place. Find a Turkish belt buckle. Have a tough go with my camel who clears out & leaves me, after rolling me off.\n\n9\/9\/16\n\nGo Hassaniya on to get mail & have to belt him home.\n\n10\/9\/16\n\nTaube over during afternoon. NZ`s say good bye.\n\n11\/9\/16\n\n3rd LH take place of N.Z.`rumours of an attack to be made on \" Mazaro’ at week end.\n\n12\/9\/16\n\nTurks reported out of Mazar so stunt will probably be postponed. Taube pays a visit as usual & machine guns refuse to act as usual.11pm three brigades 1-2 & 3 leave Amara with 6 batteries & 1000 mounted Tommy Camelry. Telegraph\n\nlines fail.\n\n16\/9\/16 (Note, No dates for 13 to 15\/9\/16)\n\nTaube visits us & knocks out a small plane which comes down very sick. Taube visits Romani, Hassaniya & then returns. Machine guns stick as usual as we blaze at him with rifle fire. Another plane drops along the coast after dropping a smoke bomb that loosens a lot of long thin white streamers. WA2 arrive & relieve us. \n\nGet out for Romani. 7pm Halt at Negliget for tea which we have in the dark. Play cards by candle light till moon rises at 9pm. Arthur gets bitten by centipede. Arrive Romani 2am \n\n17\/9\/16\n\n& turn in.loaf about all day\n\n18\/9\/16\n\nLeave Romani for Mohammidiya aerodrome. Hours of working 4am 8am & 4pm 7pm. Plenty of planes & hangars & interesting sights.\n\n19\/9\/16\n\nLeave 8am for Pt Said. Train delayed till 11am. Arrive 2pm & go to the Hotel de la Poste with Cpl Brown. Go round the town & buy presents etc.\n\n20\/9\/16\n\nPort Said\n\n21\/9\/16\n\nLeave for Mahammidiya 7am arriving 11am\n\n22\/9\/16\n\nIn surf early morning. Surfing all day. Have bit of row with Serg Major \n\n23\/9\/16\n\nSurf early morning. Watch plane come down with fancy spiral turns, banking on one side etc. Try small wireless set belonging to aeroplane & find it much more sensitive than our own set.\n\n24\/9\/16\n\nPack up & return to Romani where we take over the running of that station.\n\n25\/9\/16\n\nOn watch from 12 midnight to 4 am no candles no light of any sort so go to sleep.\n\n26\/7\/16\n\nProwl about all day & do practically nothing but sleep, visit Eric after tea and annoy him to pass the time away.\n\n27\/9\/16\n\nSpend the day on my bed.\n\n28\/9\/16\n\nCapt Downing adjusts set. Have a talk to him and put in for a transfer to transports. Visit Eric after tea & start ear biting with young Gow & Hoppy.\n\n29\/9\/16\n\nLeave Romani at 7am for Amara. Have dreary trip out & arrive at 2pm\n\n30\/9\/16\n\nWA2 leave 6 am for Romani. Find camp in filthy state so have to clean up.\n\n2\/10\/16\n\nGo out to Bir el Abd to try & bum some coal from the engine driver of the railway train but has now reached Bir-el-Abd. Have poor success owing to just arriving too late. 3rd Brigade quarantined for cholera which has shown itself again.\n\n4\/10\/16\n\nFind lovely green centipede in my bed on turning in Stunt leaves for Mazar.\n\n5\/10\/16\n\nAeroplane on the way out to Mazar. \n\n7\/10\/16\n\nHave some fun trying to get war news from the Tommies on the buzzer.\n\nFor Continuation See No. 3\n\nDiary.\n\nOver\n\nDetailed account of the \nBattle of Romani\n\nThe aeroplane reconnaisaisance (Turkish) had reported that Romani was only occupied by a few troops and that the hundreds of tents were only dummies. This appeared so to the Aeroplane observers because all troops were ordered into tents as soon as a hostile plane appeared. Thus the Turks set out to take Romani, and which they stated in orders captured by us would fall in four hours. It was a disastrous mistake on their part. \n\nThe main railway to Romani took out troops and our planes kept a good watch on the Turkish movements. They (Turks) then set out from El Arish\n\nadvancing very slowly and cautiously, building roads along the Old Caravan Route to Syria where necessary. Gradually they approached Romani and at 2am on Aug 4th they attacked Romani. We were expecting the attack, altho’ not quite then. Hostile planes (five) hovered over Romani & directed the fire from the guns, also dropping bombs & doing no damage this way.\n\nWA4 was at Bally Bunion but the boom of their guns could be heard quite plainly. The main fire of the Turks was at the redoubts, the range of which they had to a yard and were pouring shells in. At daybreak\n\nthe guns opened on Kateb Gannit – a big sand hill, which was an artillery observation post. ------\n\n4th Aug 1916:-\n\nAt 10am or thereabouts, the 3rd L H Brigade to which WA4 was attached got an hour`s notice to move out. For an hour Bally Bunion ws empty. Tents were left standing – everything stood as it was. The 3rd LH were to flank the enemy, who was retiring before the troops he didn`t expect. At 4pm the expected message was received – WA4 to move off on camels – to Hill 70 & join 3rd L.H. Twelve camels & 4 Indians – (Saydoo, Nundoo, Periboo, and Nunda) were hastily requisitioned. 24 hours rations received and at 5pm away we started, for the first ride on camels. There were no saddles such as are supplied now. We had to ride the ordinary transport saddles\n\nwhich were very wide and very uncomfortable – but we were \"off to the war\" at last There was Corporal Feeney in charge. Missen 1st Operator, Arthur Hamilton 1st Mechanic. Trickett 2nd operator., Brett 3rd operator George Hamilton 2nd Mechanic and myself second to Feeney. We struck out towards Hill 70 and after a while trouble began. It was just dusk and we were slowly walking, as camels do travel, when Feeney`s camel which was leading, got caught in some trip-wires, which Tommy troops generally have spread all over the country {Let it here be said that wherever one finds wire netting, barbed wire entanglements trip wires & such, one can depend on Tommies being about \n\nAs our Colonel says – \"they live in damned fowl houses\" However the camels became excited and got mixed up a bit, and Bunny Brett fell off. The camels bucked about a bit and we only lost one – the one with rations – v.e. rations\n\n(V.E. is pronounced VICK –E and in sig`s language means \"The end\") Bunny lay on the ground quite hysterical laughing & crying alternately so we got him back after a lot of persuasion & set off again. At about 8pm we reached Hill 40 and found the Sig Squadron left as it stood. We then set off along the main road to Hill 70 some miles farther on. Bunny suddenly became too sick when half way. so George had to half carry him back to Hill 40 where he was dumped in a shed and left –\n\nV.E. Bunny for the time. At one am 5\/Aug we arrived at Hill 70 and found that the 3rd LH had left. All the tents here were empty and everything was quiet & desolate. We were all tired and a bit sore after the saddles so turned in in a YMCA tent. The YMCA man doing all he could for us.\n\nAt 5am we packed up again and left for Dueida - the next place the 3rd were to make for. As we plodded along at the usual camel`s pace – 2 ½ miles per hour (perhaps) we could hear the distant rumble of guns –\"at the war at last\" we thought. At midday we reached Dueida and found all bustle & rush there the 3rd having left there also. Taubes & our planes were very busy on reconnaissance work and were above all day. Bombing was off for the time, each side being too anxious\n\nto watch the other. We had a good dinner at WA2 wireless station – the last for some time – and set off for Bir el Nuss – the next place the 3rd made for. On the way out here the guns became more distinct and at last we could see, away ahead the bursts of anti aircraft shells being fired at our planes. Taubes as usual hung about, only twice as high as our planes. It was very interesting to watch.\n\nAt last we reached Bir el Nuss & found the 3rd had left here too & gone to Hamisah. We were rather stiff & sore from riding. These saddles but had to push on. We had nothing to eat and our bottles were empty so we had to drink hod water which at Nuss was vile. The cable lines back to Dueida had been cut by spies (later on captured and shot) and communi-\n\nation was prevented. \n\nArrangements were made so that an orderly could direct us from a certain place along the old Constantinople Telegraph line (Cairo to Constantinople) which we had to follow. We therefore set out along this line and at dark found ourselves getting very near the enemy guns. No orderly could be seen so we kept on and at last thought we had better stop so we turned into a hod nearby, intending to risk sleeping the night. A few odd troopers came in and we were arranging to keep a watch amongst us in case of surprise. It was a nasty position, so we loaded our rifles and; prepared to face it\n\n We had only just unloaded the camels and had been looking amongst a lot of enemy gear that had been left when they evacuated this hod (Bir Roaml) I could smell cheese and was hunting everywhere for it, when a NZ trooper dashed in on his horse. We advanced to meet him – rifles ready in case of it being the enemy. Our rifles never left our hands here, not for an instant. He was a mass of blood and one arm hung at his side helpless. For God`s sake get out he said – the LH have been forced to evacuate owing to no water and the Turks are only half an hour`s ride away. That was enough. Tired as we were, we packed those camels and began the retreat. The Indians were done up too, but they had to move too. Our rifles were primed with 11 rounds ready for any emergency\n\nIt was necessary to kick the camels at every step as they were knocked up after the long day`s march with their loads. At such a time as this, animal flesh is not spared. As we wended our way back in the dark, very slowly, we were joined up by stragglers on worn out horses, who formed a rearguard for us, Tired artillery horses panted past us being thrashed up, with heavy whips. \n\nEverything was as quiet as a grave and the moon began to shed a faint light all over the country. We had to keep well off the skyline and all cigarettes had to be put out. An ambulance column joined us, but later on got temporarily lost causing some anxiety. Some officer assumed command and very slowly we dragged back to safety. Everywhere was the cry for water Horses had to be brutally treated to keep them up whilst the poor animals shook with fatigue. Got a drop of water mate they would cry. One could not refuse them so I did the good samaritan act and gave mine away – I suffered after. \n\nThe heat of the day has parched us up and we were very hungry. \n\nAt last we reached Nuss after what seemed ages and just tumbled off the camels. Communication was still cut off and things seemed very bad. We tried to snatch a sleep but it was almost impossible. All night long the men returned in dribs and drabs and were trying to freshen their horses by massaging their tired bodies. You never saw such a peculiar looking lot of troops. Their scant clothing was in shreds and they were very grimy, but quite happy. \n\n6\/Aug\n\nAt dawn the troops were off again and we erected\n\nthe station to carry off some of the urgent traffic while the line was being mended. There was nothing to eat and only salt water to drink so Feen did the worst thing, he or anyone could have done. On his own account he sent a message to Romani \"No rations !- shall we return to Romani\". We were disgusted.\n\nA big batch of Turkish prisoners was brought in a little later and a guard had to be placed over them with fixed bayonets to keep them away from the water. They were dying for a drink and it was pitiable to see them begging for \"MOIR\" (water).They were given water in turn and bully beef and all their troubles were soothed. We \nhad\n to drink this salt water at last, and you can guess that our thirst was only increased. However we had to fill our bottles and set off for Bir Nagid.\n\nThrough the blazing hear we plodded along, our tongues like fly papers. It is a terrible feeling to be really thirsty. We ate some green dates and these only made our mouths worse. At last we reached Nagid at about midday and found that a huge camel train had arrived with water. Capt Hughes met us and told us to go and get what water we wanted & to fill our bottles. We needed no second word and for myself I drank water till \"my back teeth were awash\". At 3pm we left Nagid with the engineers for Hazabir Darem. As we passed at the back of Katia we could see the bursts of shrapnel very close indeed\n\nMany old Bedouin camps were passed and many big shell holes marked the spot where Turks had been recently. As usual a Taube was hovering above, if not directly above, always within sight.\n\nIt was rather a large camel convoy in which we were moving and this must have been noticed by him. Had we been stationary he would probably have missed us, but he left and we took no notice till we heard the consumptive cough - K –R –U - P–P of the enemys’ howitzer and the shriek as a shell flew over, burying itself in the sand and exploding violently about 300 yards away. The convoy moved away to the right, but alas, my camel saddle must collapse and throw me. Krupp – goes the gun again telling us its make, another shell lobbing about the same spot. I was left alone with a bag of split peas pouring out of a bag I was perched on and then the saddle gracefully swung round and hung from its neck. I swore violently I know, and just as violently tore at the nose rope to drag the camel to its knees so that I could get on somehow. The convoy was out of sight and all my camel would do was bellow. K - R–U –P –P she goes again, and my heart sank this time. The shell shrieked over and \n\nfell a bit short again, making an awful noise & sending lumps of iron whizzing overhead like fury. I got on the camel somehow or other how I don`t remember but I got out of the way, hanging on to its hump with one hand, my rifle in the other and generally getting a rough passage. When I caught up with the convoy, we were all mixed up and I swore again. We learned afterwards that we were only just out of range. Our plane then flew over towards the spot that this howitzer was supposed concealed, as we were trying very hard to find it. After a few moments there was the familiar wuff – of a bomb as our plane had a hit at it. (Bombs by the way make a horrible noise & tear up the sand for yards round about, but seldom score a hit, but when they do they make a mess of things).\n\nWe passed many dead horses and camels & in places the sand was thick with shrapnel. At 10pm we arrived at Hod Abu Darem and erected the station. All night we were up all of us, doing traffic and getting the next days operation orders from the General at HQ. It was a very busy night and we were very tired, but one feels very little in times like this. \n\n7\/Aug\n\nFor breakfast we managed to get a tin of bully beef & a few weevily biscuits and made some tea out of some salt water. It was hardly palatable, but it tasted lovely. All the morning our artillery blazed away at the enemy. There was no fresh water here and the sun beat down unmercifully, as we packed up and set out for Hod Dhabat\n\nGlossary names \n\nTurkish for reading maps.\n\nThen follows half a page of a crossed out list of Turkish names and English translation.\n\nThe bully beef for breakfast made us very thirsty – but we had to go without again. The sand seemed red hot and we came to some very rough country where even horses could not go through owing to the great dips. Rifle fire was going on all day and the incessant Tat-tat-tat-tat of the machine guns gave a realistic touch. Planes as usual hovered above all day. A\n\nAt 2pm we arrived at Dhahab & to our dismay found that the pumps and wells were almost dry. The water we got was nearly all mud and was very crook. We tried to make tea – no good. It had to go down raw. Rations had not arrived and we were as empty as drums. Those who smoked had no \"fags\" so had to smoke tea leaves. Our dinner was hod water a la pea soup and green dates a la cascara. That night we had no light at all. Of course fires were not permitted after sunset. It is awkward too in the dark. We had to light a fire to write messages by. As soon as we \n\nopened the station of course there was a terrible rush of traffic which had been accumulating whilst we were travelling. We had tea in the dark and lit a fire. Message after message came through and we could not decipher them. It appears that the code word had been altered and we had not been advised. For seven hours we wrestled in vain hope. \n\nFeen got disgusted & went to sleep leaving me in charge. Very kind of him indeed. The Brigade Major came up and was very much annoyed & Feen had to get out. I then tried to get an hours sleep - no good. I had to get out. Orders were delayed and we could not deal with the traffic. Arthur went down to the OC to get someone to help us – No! he roared, so we had to struggle on. I think we swore all night. Each time a message came through, someone would have to hold a burning palm over the operator`s head so that he could see to write. It usually went out in the middle of the message. I could have cried.\n\n9\/Aug\n\nAt 4am we got orders to pack up and leave. It was bitterly cold & we had only our singlets & trousers practically, but we got on the camels & plodded along to Hassanein, eating our breakfast of a tin of bully and two biscuits on the camels back. Guns came out with us and a big ammunition column followed and amongst the train were some hawkeyed Turkish prisoners. \n\nWe arrived at Hasanein at 9am & found the Turks too strong to force back. The battery opened fire on them & it was wholesale murder. I had no feelings for them. The more they\n\nkilled the more I liked it. Shells roared over with fiendish shrieks and monitores sent great splashes of iron foundries in from the sea.\n\nThe sun was red hot and I tired to pinch some water from an officer`s fantasy of water but it would not open. We made for the hod & found water condemned owing to cholera. Cholera or no cholera we got some & drank it. It was terrible & tasted of gunpowder & dead Turks. It was wet though. \n\nThe hod was made a hospital and the wounded were treated there. One fellow walked in having been shot through the throat. I saw more blood here than I ever saw in my life. It was horrible. Men worked like devils. \n\nThe gunners delighted in every shot. The air was buzzing with planes and the rifle fire & machine guns made it quite lively. The sky was peppered with puffs of shrapnel shells. It was like a number of big iron tanks being rolled about. We could not push the Turks back & lack of water made us retreat to Dhahab again. We arrived at 10pm done up – but still had to go all night again. We thought our insides had shrivelled up we were so hungry. At 3am \n\n10\/Aug\n\nI fell asleep and was wakened at 5am to decipher a message. We stayed all day here and I got in 3 hours sleep. Tons of Bully arrived with water and we had the best meal of our lives. Much traffic was handled and Brig Antill complimented us on our work. At 2am \n\n11\/Aug\n\nWe got orders to pack again for Hasanein arriving there at 6am & erecting. The Major sat on a little hillock whilst we erected\n\nDiary Continues\n\nwriting out messages. A Taube was above us as usual and had just dropped two bombs at the guns but missed. He made straight for us and our cake was dough, when our plane came after him and took his attention away. A fight was the result which lasted about 1 ½ seconds and our plane was forced to descend, both pilot & observer being riddled by machine gun bullets from the Taube. The observer Brown had just time to write out his report before he died, and his remains are now buried at Dababbis. We owe him more than our thanks. The pilot I believe survived.\n\n We were not strong enough to attack today –all along we were outnumbered but had the pluck to push so we stood by and got a few lumps of shell cases & a few shrapnel pellets backsheesh. At dusk the weary WA4 packed up & returned to Dhahab again and at last someone remembered that we were attached to them & had not had five minutes off so we were given the whole night off. You never saw such a weary lot get into bed. We only had a blanket each but we had snared Turkish tents etc and used these as quilts. In less time that it takes to write, WA4 were asleep. At 4am \n","167":"\n\nwe packed for Hassanein again. A Hun wireless station caused us such trouble that we could not deal with the traffic and other bungling appeared in the messages. Feen said he didn’t care neither did anyone evidently.We had to retire to Hasaniya where HQ were stationed and have another nights sleep. \n","168":"\n\nWe woke to the hum of a Gnome engine – Taube. Shrieking on its way down came a bomb followed by\n\na mate, both terrifying the natives but falling very wide. Water here also condemned owing to cholera again being found. Cholera in an army I may say is the worst & most awful enemy to handle, and an outbreak even such as this was sufficient to cause Egypt on this side of the canal to be closed to all on the other side and vice versa. On the","169":" Feen met with an accident by the primus stove bursting over him. Being burnt severely, he was sent to hospital and temporarily I was the O\/C of W4. An hour later Dopey Brett arrives. \n","170":"\n\nbefore leaving we are inoculated against cholera\n","171":"\n\nCapt Downing arrives with WA3 and relieve us. All night we travelled till we reached Negiliet where we rested for an hour. It was a tired and ragged lot that entered Romani next morning. Our clothes were in rags and we were anything but clean to look at. However that ended the whole affair – our first battle\n\n"}}