{"Document Name":{"0":"Diary_0038","1":"Diary_0038","2":"Diary_0038","3":"Diary_0038","4":"Diary_0038","5":"Diary_0038","6":"Diary_0038","7":"Diary_0038","8":"Diary_0038","9":"Diary_0038","10":"Diary_0038","11":"Diary_0038","12":"Diary_0038","13":"Diary_0038","14":"Diary_0038","15":"Diary_0038","16":"Diary_0038","17":"Diary_0038","18":"Diary_0038","19":"Diary_0038","20":"Diary_0038","21":"Diary_0038","22":"Diary_0038","23":"Diary_0038","24":"Diary_0038","25":"Diary_0038","26":"Diary_0038","27":"Diary_0038","28":"Diary_0038","29":"Diary_0038","30":"Diary_0038","31":"Diary_0038","32":"Diary_0038","33":"Diary_0038","34":"Diary_0038","35":"Diary_0038","36":"Diary_0038","37":"Diary_0038","38":"Diary_0038","39":"Diary_0038","40":"Diary_0038","41":"Diary_0038","42":"Diary_0038","43":"Diary_0038","44":"Diary_0038","45":"Diary_0038","46":"Diary_0038","47":"Diary_0038","48":"Diary_0038","49":"Diary_0038","50":"Diary_0038","51":"Diary_0038","52":"Diary_0038","53":"Diary_0038","54":"Diary_0038","55":"Diary_0038","56":"Diary_0038","57":"Diary_0038","58":"Diary_0038","59":"Diary_0038","60":"Diary_0038","61":"Diary_0038","62":"Diary_0038","63":"Diary_0038","64":"Diary_0038","65":"Diary_0038","66":"Diary_0038","67":"Diary_0038","68":"Diary_0038","69":"Diary_0038","70":"Diary_0038","71":"Diary_0038","72":"Diary_0038","73":"Diary_0038","74":"Diary_0038","75":"Diary_0038","76":"Diary_0038","77":"Diary_0038","78":"Diary_0038","79":"Diary_0038","80":"Diary_0038","81":"Diary_0038","82":"Diary_0038","83":"Diary_0038","84":"Diary_0038","85":"Diary_0038","86":"Diary_0038","87":"Diary_0038","88":"Diary_0038","89":"Diary_0038","90":"Diary_0038","91":"Diary_0038","92":"Diary_0038","93":"Diary_0038","94":"Diary_0038","95":"Diary_0038","96":"Diary_0038","97":"Diary_0038","98":"Diary_0038","99":"Diary_0038","100":"Diary_0038","101":"Diary_0038","102":"Diary_0038","103":"Diary_0038","104":"Diary_0038","105":"Diary_0038","106":"Diary_0038","107":"Diary_0038","108":"Diary_0038","109":"Diary_0038","110":"Diary_0038","111":"Diary_0038","112":"Diary_0038","113":"Diary_0038","114":"Diary_0038","115":"Diary_0038","116":"Diary_0038","117":"Diary_0038","118":"Diary_0038","119":"Diary_0038","120":"Diary_0038","121":"Diary_0038","122":"Diary_0038","123":"Diary_0038","124":"Diary_0038","125":"Diary_0038","126":"Diary_0038","127":"Diary_0038","128":"Diary_0038","129":"Diary_0038","130":"Diary_0038","131":"Diary_0038","132":"Diary_0038","133":"Diary_0038","134":"Diary_0038","135":"Diary_0038","136":"Diary_0038","137":"Diary_0038","138":"Diary_0038","139":"Diary_0038","140":"Diary_0038","141":"Diary_0038","142":"Diary_0038","143":"Diary_0038","144":"Diary_0038","145":"Diary_0038","146":"Diary_0038","147":"Diary_0038","148":"Diary_0038","149":"Diary_0038","150":"Diary_0038","151":"Diary_0038","152":"Diary_0038","153":"Diary_0038","154":"Diary_0038","155":"Diary_0038","156":"Diary_0038","157":"Diary_0038","158":"Diary_0038","159":"Diary_0038","160":"Diary_0038","161":"Diary_0038","162":"Diary_0038","163":"Diary_0038","164":"Diary_0038","165":"Diary_0038","166":"Diary_0038","167":"Diary_0038","168":"Diary_0038","169":"Diary_0038","170":"Diary_0038","171":"Diary_0038","172":"Diary_0038","173":"Diary_0038","174":"Diary_0038","175":"Diary_0038","176":"Diary_0038","177":"Diary_0038","178":"Diary_0038","179":"Diary_0038","180":"Diary_0038","181":"Diary_0038","182":"Diary_0038","183":"Diary_0038","184":"Diary_0038","185":"Diary_0038","186":"Diary_0038","187":"Diary_0038","188":"Diary_0038","189":"Diary_0038","190":"Diary_0038","191":"Diary_0038","192":"Diary_0038","193":"Diary_0038","194":"Diary_0038","195":"Diary_0038","196":"Diary_0038","197":"Diary_0038","198":"Diary_0038","199":"Diary_0038","200":"Diary_0038","201":"Diary_0038","202":"Diary_0038","203":"Diary_0038","204":"Diary_0038","205":"Diary_0038","206":"Diary_0038","207":"Diary_0038","208":"Diary_0038","209":"Diary_0038","210":"Diary_0038","211":"Diary_0038","212":"Diary_0038","213":"Diary_0038","214":"Diary_0038","215":"Diary_0038","216":"Diary_0038","217":"Diary_0038","218":"Diary_0038","219":"Diary_0038","220":"Diary_0038","221":"Diary_0038","222":"Diary_0038","223":"Diary_0038","224":"Diary_0038","225":"Diary_0038","226":"Diary_0038","227":"Diary_0038","228":"Diary_0038","229":"Diary_0038","230":"Diary_0038","231":"Diary_0038","232":"Diary_0038","233":"Diary_0038","234":"Diary_0038","235":"Diary_0038","236":"Diary_0038","237":"Diary_0038","238":"Diary_0038","239":"Diary_0038","240":"Diary_0038","241":"Diary_0038","242":"Diary_0038","243":"Diary_0038"},"Date":{"0":"unknown","1":540.0,"2":552.0,"3":560.0,"4":564.0,"5":565.0,"6":619.0,"7":643.0,"8":646.0,"9":647.0,"10":658.0,"11":659.0,"12":660.0,"13":661.0,"14":662.0,"15":663.0,"16":664.0,"17":665.0,"18":666.0,"19":667.0,"20":668.0,"21":669.0,"22":670.0,"23":671.0,"24":672.0,"25":673.0,"26":674.0,"27":675.0,"28":676.0,"29":677.0,"30":678.0,"31":679.0,"32":680.0,"33":681.0,"34":682.0,"35":683.0,"36":684.0,"37":685.0,"38":686.0,"39":687.0,"40":688.0,"41":689.0,"42":690.0,"43":691.0,"44":692.0,"45":693.0,"46":694.0,"47":695.0,"48":696.0,"49":697.0,"50":698.0,"51":699.0,"52":700.0,"53":701.0,"54":702.0,"55":703.0,"56":704.0,"57":705.0,"58":706.0,"59":707.0,"60":708.0,"61":709.0,"62":710.0,"63":711.0,"64":713.0,"65":714.0,"66":715.0,"67":716.0,"68":717.0,"69":718.0,"70":719.0,"71":720.0,"72":721.0,"73":722.0,"74":723.0,"75":724.0,"76":725.0,"77":726.0,"78":727.0,"79":728.0,"80":729.0,"81":730.0,"82":731.0,"83":732.0,"84":733.0,"85":734.0,"86":735.0,"87":736.0,"88":737.0,"89":738.0,"90":739.0,"91":740.0,"92":741.0,"93":742.0,"94":743.0,"95":744.0,"96":745.0,"97":746.0,"98":747.0,"99":748.0,"100":749.0,"101":750.0,"102":751.0,"103":752.0,"104":753.0,"105":754.0,"106":755.0,"107":756.0,"108":757.0,"109":758.0,"110":759.0,"111":760.0,"112":761.0,"113":762.0,"114":763.0,"115":764.0,"116":765.0,"117":766.0,"118":767.0,"119":768.0,"120":769.0,"121":770.0,"122":771.0,"123":772.0,"124":773.0,"125":774.0,"126":775.0,"127":776.0,"128":777.0,"129":778.0,"130":779.0,"131":780.0,"132":781.0,"133":782.0,"134":783.0,"135":784.0,"136":785.0,"137":786.0,"138":787.0,"139":788.0,"140":789.0,"141":790.0,"142":791.0,"143":792.0,"144":793.0,"145":794.0,"146":795.0,"147":796.0,"148":797.0,"149":798.0,"150":799.0,"151":800.0,"152":801.0,"153":802.0,"154":803.0,"155":804.0,"156":806.0,"157":807.0,"158":808.0,"159":809.0,"160":810.0,"161":811.0,"162":812.0,"163":813.0,"164":814.0,"165":815.0,"166":816.0,"167":817.0,"168":818.0,"169":819.0,"170":820.0,"171":821.0,"172":822.0,"173":823.0,"174":824.0,"175":825.0,"176":826.0,"177":827.0,"178":828.0,"179":829.0,"180":830.0,"181":831.0,"182":832.0,"183":833.0,"184":834.0,"185":835.0,"186":836.0,"187":837.0,"188":838.0,"189":839.0,"190":840.0,"191":841.0,"192":842.0,"193":843.0,"194":844.0,"195":845.0,"196":846.0,"197":847.0,"198":848.0,"199":849.0,"200":850.0,"201":851.0,"202":852.0,"203":853.0,"204":854.0,"205":855.0,"206":856.0,"207":857.0,"208":858.0,"209":859.0,"210":860.0,"211":861.0,"212":862.0,"213":863.0,"214":864.0,"215":865.0,"216":866.0,"217":868.0,"218":869.0,"219":870.0,"220":871.0,"221":872.0,"222":873.0,"223":874.0,"224":875.0,"225":876.0,"226":877.0,"227":878.0,"228":879.0,"229":880.0,"230":881.0,"231":882.0,"232":883.0,"233":884.0,"234":885.0,"235":886.0,"236":887.0,"237":888.0,"238":889.0,"239":890.0,"240":891.0,"241":892.0,"242":893.0,"243":894.0},"Entry":{"0":"\n\nEnlisted ","1":"\n\nWent to Liverpool Camp ","2":"\n\nAttached to","3":" Reinforcement of 19 Bt. till","4":"\n\nTransferred to","5":" Field Ambulance\n\nQueens Park, Waverly","6":"\n\nRoute March from Moss Vale to Parra ","7":" - ","8":"\n\nPresentation of Wristlet watch from residents of Gladesville,","9":"\n\nLeft Queens Park for Melbourne 8.5 pm\n\nTrain","10":" very large crowd on station to see train off.\n\nArrived at Melbourne (Spencer St) 3.30 pm","11":" \n\nMarched to Albert Park & camped near S. Melbourne Cricket Ground.\n\nGeneral leave granted at night. Visited city. Returned to camp 10.15 pm.\n","12":"\n\nReveille 6 am No early morning parade; church parade 10.30. went St Silas Church, Albert Park. General leave granted in afternoon, visited Domain & Gardens, very enjoyable afternoon, gardens very nice.\n","13":"\n\nParades, 6.30 am. 9.30 AM ∧: 2 pm. Remained in Camp at night.\n","14":"\n\nOrdinary Parades 6.30 – 7.30 AM, 9.30 am – 12.30 pm 2 pm – 5 pm\n\nLate leave granted, went \"Paul Jones” Her Majesty’s Theatre, Supper at \"Blue Bird” Collins St; caught 12.10 AM train from Flinders St to Albert Park.\n\nEnjoyed play, but had to leave early through indulging too heavily in ice cream blocks. (no more).\n\nHad to wait for other boys at side entrance, in Little Collins St, an awful street, almost all Chinamen.\n","15":"\n\nOrdinary parades, Visited city At night; ordinary leave granted. Returned 10.15 pm.\n","16":"\n\nOrdinary Parades, Went to Concert ∧: Party arranged by Methodist Church, Albert Park. Had very enjoyable time. About 150 marched in a body to the Church hall, returned about. 10.45 pm.\n","17":"\n\nLate leave granted at night, went to \"Nobody’s Widow” Theatre Royal.\n","18":"\n\nWeekend leave granted, went to Caulfield Cup, returned to City, had tea at Blue Bird, went St Kilda at night by Motor Bus, returned by tram. St Kilda pier fine though, rather cold at night. Slept in Camp.\n","19":"\n\nRemained in bed till 8.30 AM\n\nLeft Camp about 12 am & had dinner at Blue Bird, caught train in afternoon for Kew, visited cemetery, returned by tram & went to Domain. Had tea in town, Reg returned to camp ill. While on leave Mr Sutton called.\n","20":"\n\nOrdinary Parades At night visited Kew to see Mr Sutton. Met Mr & Mrs Reid, arrived back at camp 9.30 pm\n","21":"\n\nParades as usual. Remained in Camp at night\n","22":"\n\nUsual parades, went in to City at night\n","23":"\n\nGeneral inspection by Col Tibbey. Late leave at night, went to \"The Dancing Mistress”, Her Majesty’s Theatre. Had tea & Supper at Boulevard Café. Bob sang during tea.\n","24":"\n\nLeft camp, 8 am, on Route March. Marched to Flinders St, Caught train to Ringwood. Arrived Warrandyte 8 miles for dinner, Dined with Bob Roberts at Hotel. Left Warrandyte about 2 pm in rain, arrived Kangaroo Gd about 3 miles further on & Camped in hall for night. Had a pleasant night in hall singing & dancing, turned in about 10 pm\n","25":"\n\nReveille 6 am Still raining hard. Had breakfast & cleaned hall. Left Kangaroo Ground 10 am. Marched on in heavy rain, had dinner 11 miles out at 1.30 pm, left again at 3.15 for Yarra Glen 3 miles on, arrived a little after 4 pm. About 25 men unable to finish march caught train back. Remainder went on & arrived at Healsville 7 pm. Had shower & tea & camped in Hall opposite Presbyterian Church. Bed 10 pm.\n","26":"\n\nReveille 7.30 am Still raining hard. Breakfast 9 am. Church parade, Pres Church 10.30 am – 12 am. Dinner at hotel 1 pm. Went Myers falls afternoon\n\nat 2 pm back 4.30 pm, (very poor) Had tea in refreshment shop next door to hall. Left Healsville 7 pm arrived camp 10 pm.\n","27":"\n\nUsual parades Selected by Captain North to go to Sydney with 17 others to Embark by Beltana on 9\/11\/15.\n\nVisited friends place Albert Park, played billiards & ping pong, returned to camp 10 pm.\n","28":"\n\nUsual parades, Reg returned from Ascot isolation hospital. Went Concert given by St Lukes Church, Albert Park. Left Concert & went to tea at Café Francatelli\n\nreturned to Concert & arrived back at camp 11 pm.\n","29":"\n\nUsual parades\n\nPicket duty 6 pm till 10 pm\n\nVaccinated\n","30":"\n\nPicket 6am – 10 am.\n\nDinner at Chalet given by Mrs Salvary to 6 of us returning to Sydney. After tea went to Concert in Gymnasium hall given by Middle Park Choir & returned to Chalet for Supper.\n","31":" 15\n\nUsual parades\n\nWent to City at night. Raining hard.\n","32":"\n\nSignalling Competition during morning, did fairly well.\n\nWent to Flemington in afternoon to see Derby run, had a very pleasant afternoon. Flemington course very fine, railway accommodation very poor. Returned to city for tea at Boulevard Café.\n\nWent to Tivoli fairly good programme. Had supper at Boulevard Café returned to camp 12 pm.\n","33":"\n\nChurch parade, St Lukes C of E Albert Park. Visited Zoological gardens during afternoon, grounds very fine. Horse tram from Royal Park to Zoo. Had tea at\n\nContinental café, Swanson St, caught 6.10 PM train to Kew, found all out. Returned to camp by 8.30 pm.\n","34":"\n\nRaining hard. Early morning march to Port Melbourne.\n\nPay parade 2 pm. Late leave at night. Tea at Francatelli Café. Went Her Majesty’s theatre to \"The Old guard”. Supper at Boulevard.\n","35":"\n\nCup Day\n\nMade preparations during morning for trip to Sydney. Left Melbourne (Spencer St) 4 pm train, arrived Albury 10.10 pm, left 11.5 pm\n","36":"\n\nArrived Moss Vale about 9 am for breakfast. Arrived Sydney 11.30 AM. \n\nGood number of friends on Station to see train in. After a short delay we dismissed and went to our homes. Met Bob Park & went Pictures at night.\n","37":"\n\nWent to Sydney in morning returned about 4 pm. Caught 5 pm tram met other boys & went to dinner in Sargeants, given to Captain North. After dinner went with theatre party to Tivoli. Returned home 12 pm.\n","38":"\n\nCaught 8 am tram & met other boys at railway. Caught 9.30 am train for Como. Hired boats & rowed up river about 5 miles, returned to Como in time to catch 5 pm train. At night went Bondi Junction\n","39":"\n\nRemained home during morning. During afternoon played tennis, rather out of practice, but games very enjoyable. At night went to farewell party given to J Martin by his parents.\n","40":"\n\nRemained home during morning. Met friend 2.40 pm. Caught Lane\n\nCove boat for Fig Tree. Walked from Fig Tree to Alexandra St & Caught boat back to town. Had tea Sargeants in Market St; Went Bondi at night. Arrived home 11 pm.\n","41":"\n\nWent to town in morning to buy some articles necessary for trip. Returned to Balmain visited Mort St met Mother corner of Darling St & Weston Rd. 3.20 pm visited Mrs Hancock. Home 5.20 pm. At night paid a few farewell visits.\n","42":"\n\nAs it was necessary to fall in at St Mary Cathedral at 6.45 am & we had some luggage to carry, Fred brought Pacific Coy lorry home & drove in with the \n\nintention of picking up all the luggage of the other boys & taking it to wharf. It was appreciated by the boys as it is a fair walk to No 1 wharf Woolloomooloo. By 7 AM we had embarked, but it was some considerable time before the people were allowed on wharf. Had to wait for L Horse Reinforcements. \n\nWe moved out into the stream at about 9.30. thousands of coloured streamers from boat to wharf formed a very grand & impressive spectacle. Anchored near Clark Island. While in stream we were honoured by a visit from Gov General who bade us good bye & safe return in a short but very nice little speech. Moved off at 3 pm. Cleared heads about 3.30 pm. Sea calm, felt fairly well. Bed 8.30 pm. Appointed\n\nmess orderly first day.\n","43":"\n\nReveille 6 am. Sea choppy but wind dropped later in day & sea became very smooth. Rained late in day. Still fairly well. Commenced ward duty 10 pm till 6 AM following morning. Whales noticed spouting in close proximity to the ship, caused great excitement.\n","44":"\n\nDuring early morning sea became very rough, bottles & crockery began falling about causing rather an unusual disturbance. Relieved from duty 6 am feeling queer from effects of rough weather. Missed meals during day. Passed Cape Otway about 5 pm\n\novercome by seasickness at night about 6.30 pm Turned in 8 pm.\n","45":"\n\nReveille 6 am. Sea still fairly rough; many ill: More admissions to hospital with mumps. More whales noticed close in during morning. No sight of land whatever during day, but passed two large steamers during day, one coming from & one going in direction of Sydney. Ward duty from 2 pm till 10 pm. Arranged to draw meals from Officers cook house, great improvement\n","46":"\n\nReveille 6 am. in Aust Bight; sea very rough, very rough night, feeling well, attending every meal.\n\nhospital crowded, necessary to sleep outside. Very windy at night. During day allotted to our respective boats in case of emergency. Our boat No 8 on port side.\n","47":"\n\nReveille 6 am. sea exceptionally rough. Prevailing head winds. Orderly to sick parade for week. Full dress parade in morning, Church parade in afternoon very impressive. Heavy sick parade, hospitals almost full. Wind became very strong in later part of day & sea very rough, reduced speed to about 5 knots.\n","48":"\n\nWind dropped, sea much calmer\n\nbeautiful morning. Large number of Albatros following the ship, very peculiar bird, never leave only when approaching land. Visited engine room, machinery very fine, though temperature below very warm. Physical drill for morning parade.\n","49":"\n\nVery calm. Mess orderly as well as Orderly sick parade. Had a little practice in dispensary, very interesting. Passed five islands off West Australian coast about midday. Rained heavily during afternoon. Passed Hospital Ship. Kyarra about 4.30 in afternoon. Very bad head, went bed early.\n","50":"\n\nSea calm, beautiful morning. Fairly small sick parade. Lecture on first aid during afternoon. Last sight of Australian shores, changed direction, boat began to roll heavily owing to sea catching boat from different direction.\n","51":"\n\nVery heavy roll, hard to keep feet. Passed large tramp steamer about 5 pm on port side bound for Sydney. Boat rolled very heavily during night, hard to sleep on deck\n","52":"\n\nVery heavy roll. Morning fine very little wind. Large sick\n\nparade. Big fall in crockery during night owing to heavy rolling of ship. Ran sweep during day on mileage of boat for 24 hrs ending noon 20th. Introduced to Tas Vale of Balmain, who is in hospital suffering from effects of seasickness.\n","53":"\n\nVery calm. Spent morning in dispensary. Carried piano during day from saloon to hospital deck, brightened matters considerably, music all afternoon. Concert held at night, very enjoyable, beautiful moonlight night. Band played on hospital deck. Bed 10 pm\n","54":"\n\nOrderly to sick parade as usual. On early morning parade, Fire alarm\n\n& boat drill 9.30 am. All fell in with life belts on boats allotted. Church parade 10.30 am, also service in hospital at 7 pm attended both. Colly won sweep 308 miles Herford won previous day 308 also Colly second prize for previous day. Had hair clipped short again in afternoon.\n","55":"\n\nGetting very warm, nearing line, All awnings put up over exposed parts of boat. Swimming bath also erected (canvas) on deck, aft, many minor accidents owing to men being thrown in carelessly, clothes & all. Assistant to Capt North in 2 small operations during morning, felt rather\n\nqueer at beginning, but came round after & took no notice. Did my first batch of washing made rather a good job of it under the circumstances, for it is a hard job to get fresh water for washing clothes, as supply is getting very low owing to men exceeding their allowance. (allowance 6 gallons supposed to be using 10). Pleasant little sing song on our own deck at night.\n","56":"\n\nVery warm. Mess orderly, orderly sick parade as well. Serious accident, man fell down hatch aft, very bad fall, poor fellow in terrible agony. Quite upset the usual quiet conditions in the hospital. Machine gun practice from\n\nstern of ship, casks were thrown over for targets & under the circumstances the shooting was fairly accurate. Band played for Officers mess at night. Music greatly appreciated by men & crew of ship.\n","57":"\n\nVery warm. Large sick parade, very late breakfast. Chloroform administered to lad who fell down hatchway to ascertain nature of injuries, fortunately no bones broken, although apparent internal injuries.\n\nInnoculation during afternoon for our own boys, some felt effects badly. Chaplain\n\n(C of E) held choir practice on our deck at night. Some of the boys indulged in throwing wet wadding at Sgt Matheson through\n\nthe port holes, gave him rather a rough handling. 5 of us commenced a small mess of our own to enable us to have supper before retiring at night. A great improvement.\n","58":"\n\nVery warm, nearing the line must expect hot weather. Very large sick parade. Getting a nuisance coming after sick parade hours, practically attending to someone all day. Started to treat some of their corns, had a crowd around before I knew where I was, soon cut it out. During the night one side of Sgt Matheson’s moustache was clipped off & his hair cut at the back. Caused great stir, extra duties were allotted to us all. Very poor dinner owing to the \n\ncooks having to cook with condensed water, gives food a very unpleasant taste. Great numbers of flying fish to be seen around the boat. Inquiry held in connection with accident on Tuesday\n","59":"\n\nRained fairly heavily during latter part of last night & early this morning. Rather busy morning, good number of lads suffering from sprains, & cuts caused through bottles bursting in their hands. Large number of bottles containing soft drinks burst while being opened.\n\nRumour spread that we would cross the line at 3.45 pm. As per usual it was decided to celebrate the occasion in the usual manner. A secret meeting was held between a few of us & we decided that\n\nReg should be the chosen one. He was playing cards & quite unconscious of the proceedings, as we filed out fully armed for the occasion A Judge (W. Burdon) & Jury of 4 were appointed to try the chosen one, Reginald Hancock who was accused of never having previously crossed the line. Two further charges were brought in against him, one of having been found trespassing in another bed, & also of assaulting the Matron of the ship, Matron Colly Priest; with intent to do grievous bodily harm. He was found guilty of each charge & the decision of the Jury was, that he should be stripped, lathered with flour & water & shaved with a razor of very large dimensions, smeared with butter, given a pill specially prepared & a cup of salt water to aid the digestion\n\nof the pill. Then doused with water & smeared with condy’s crystals. Poor Reg had rather a rough passage. He at first strongly objected to the treatment; but found that useless & had to give in. He was tied to a post on deck & dealt with as prescribed. The little episode created quiet a great deal of excitement among the crowd on the deck below.\n\nLater in the day a very heavy rainstorm passed over. It was of very short duration but heavy while it did last. This storm was indicated by small birds called storm petrels hovering around. Their presence is a sure indication of a storm approaching. They are very tame. A few of us were lying on a \n\nquiet part of the boat ; aft & they came and fed from within a yard of where we were. They are something after the style of a quail in appearance. Rather late to bed owing to some of the boys skylarking.\n","60":"\n\nLate up, had to rush to be in time for sick parade. Much cooler after yesterdays storm. Heaviest sick parade to date, mainly owing to heat of last few days. Reg quite recovered after his unique experience of yesterday. Prize fight between QMS Menzies & Pte J. Williams A.M.C. Menzies threw his towel in after 3 rounds. \n\nThousands of flying fish still seen around boat; they rise from the water in shoals & drop back in again after flying about 10 yds. Thirty two cases to date in isolation\n\nPay day to-morrow; men in isolation receive no pay. Concert held at night from the promenade deck, very nice too, quite enjoyed it.\n\nAt noon we had travelled 5014 miles leaving 3192 to go.\n","61":"\n\nBeautiful morning. Still very heavy sick parade going from 6.30 AM till 10 AM with only ¼ hour for breakfast. Church service at 10.30 AM. Sermon very interesting, dealt with precautions one should take while in Egypt. Struck me as being very necessary, as many are ignorant & fail to realise where they are going. Pay after church parade, every man was paid £ 1.0.0 from what he is entitled to. Paid weekly payment of 2\/6 (collected from each of the 17 boys) to the \n\ncook (£ 2.2.6) for food drawn from officers cook house instead of drawing from troops galley, which we are supposed to draw from. Stewed rabbit for dinner & I had the luck to get a tomato from the cook, very nice. Service in hospital at night. Crossed line at 8.30 pm to night. The event of Father Neptune coming on board at that hour caused a great deal of excitement on board. A procession, consisting of a band composed of all kinds of instruments available, followed by Father Neptune & his assistants in some very peculiar costumes, in some cases, hardly any costume at all, marched all through the ship. Properly organised sports arranged for tomorrow, to celebrate crossing of line.\n","62":"\n\nCalm morning. Nix Coxon & I were warned for refusing to obey an order from an N.C.O. Refused to go the bed when ordered to do so by Sgt Matheson. Brought up before Capt North this morning & let off with a caution, on account of good work I have been doing since coming on board ship. (Quite a compliment)\n\nI consider I was in the right as night was very hot & I had no desire to go to bed. Great afternoons sport to celebrate crossing of line. Officers & men alike, who were unfortunate enough to be selected were roughly handled & ducked in a properly organised manner. A few\n\nof us arranged for Sgt Matheson to receive a good ducking in compensation for treatment received during morning. It was carried out in a very satisfactory manner.\n\nWe again celebrated the occasion in our quarters, but the chosen ones, 3 in number escaped & got the best of the deal in the end. On the whole a very pleasant days sport.\n","63":"\n\nExceedingly hot & Sultry. All men paraded in full marching order. Too busy to dress for parade. Very quiet day otherwise. At noon travelled 5939, leaving 2357 to go.\n","64":"\n\nMess orderly for the day. Discovered lock & handle of my white kit bag had been stolen & contents scattered\n\nabout. Apparently someone has been fortunate enough to find a key to fit my bag.\n\nAbout 100 men slightly poisoned through eating cooked apple drawn for dinner from troops galley. All received medical attention during afternoon. Getting fairly well known on board through being continually on duty at the dispensary. Very heavy wind & rain storm at night.\n","65":"\n\nFairly strong wind blowing though sea fairly calm. Getting very tired of ship’s food, cannot enjoy meals at all lately, will be glad to get on shore to have a good meal. Canteen stores getting very low, unable to buy any tinned fruits or biscuits at all.\n\nSighted Arab dhow (small sailing ship) in distance on Starboard bow at 2.15 pm. Had pleasure of seeing it through telescope; quite a treat for we have not seen either land or a boat since leaving Australian shores. Passed Cape Guardifui 5.15 pm just visible on port bow; very hazy. Weather getting cooler & days shorter. Very bad head-ache today. At noon we had travelled 6550 leaving 1746 to go.\n","66":"\n\nBeautiful day sea calm; nearing journey’s end. At noon had travelled 6856 miles leaving 1440 to go. At present in Gulf of Aden. Sighted Aden lighthouse 10 pm also what appeared to be fairly large\n\nsteamer on starboard bow. Caused a great deal of excitement; first sight of anything of interest since leaving Aust shores.\n","67":"\n\nMost interesting day to date. Sighted Island of Perim & Arabian mainland early this morning on the Starboard side also a number of small barren islands on Port side. They form entrance to Red Sea into which we passed about 7.30 A.M. Perim Is a fairly large barren Island, with a fine lighthouse situated on either end & is to a certain extent populated. Passed in close proximity to a good number of steamers passing to & fro during day. One a Dutch steamer, displayed\n\nits naturally very prominently National colors lined very conspicuously from end to end of hull, with name – BENGALEN, ROTTERDAM – in large block letters in centre. Also passed New Zealand transport 52, returning. Fairly large city situated on Arabian coast on Starboard side; probably Mocha, unable to say for certain. Saw large shoal of Dolphin from bow of boat, very much like porpoises only much faster in their movements. Have passed a great number of small Islands since entering Red Sea. All barren, not a blade of grass to be seen on any of them. Concert at night, both Bob Roberts & Eric Herford contributed to programme. End of a very interesting day. As from today\n\n7177 miles, 1119 to go.\n","68":"\n\nVery warm. Overtook &: passed in very close proximity to large steamer (name unknown), when abreast signalled wished us good luck. One of our boys signalled back & thanked them for their good wishes. Our band played a few selections while abreast, Actually saw a lady on board, first of fair sex seen for a month. \n\nMail closes in orderly room 9 pm tonight, all very busy writing letters, as it will be last opportunity for writing on board. Very heavy wind & rain storm during afternoon. Thunder exceptionally heavy. Church Parade\n\n7.45 pm, last service on board, very fine.\n","69":"\n\nMuch cooler today. Passed large Orient Steamer on Port bow about 8.15 AM, bound probably for Sydney. From bow saw large shoal of Dolphins. Fine to see them playing about practically against the nose of the boat; gradually they drop away one or two at a time until they have all gone. Held fine concert at night, each of the 18 of us had to contribute to the programme. My item, \"Always take a girl named Daisy” went very large,” I don’t think”. As each item was announced a few lines were read out about each \n\nartist. I know when they announced my item, they said something about \"the man with the Society ripple” I don’t remember it all, but it was very funny. At conclusion of concert Sgt Matheson was presented with a large bottle labelled poison for having rendered the best item. At noon we had travelled 7798 leaving 498 to go.\n","70":"\n\nAll very busy making preparations to disembark to-morrow; will not be sorry either although I have been fairly fortunate during voyage. Both kits packed in readiness for to-morrow\n","71":"\n\nArose very early, all excitement on board. Soon got through early morning sick parade. Dropped anchor some distance out from Suez, reason unknown; while here Orsova, which left with troops a day later than we did, passed us bound for Suez. We proceeded on our journey shortly after & anchored alongside the Orsova at 10 AM. Very fine sight; a great number of troopships & other vessels at anchor in harbour, also a few cruisers Mainland very peculiar in appearance &: all brown sandstone, no vegetation whatever, everything you look at on the shore where it is at all \n\nrocky, seems to attain a pyramided form. Medical officer came on board 10.30 AM crew of launch Arabians. While they were waiting, the boys began to throw down pennies & as they would bend to pick each one up, one of our chaps would throw a potato at them. All disappointed at not disembarking to day; do not expect to do so till Friday now. Thousands of gulls about ship. Bought, P. Card views of Suez & Port Said, on board. Ronald Styles & J Martin on Orsova.\n","72":"\n\nStill in harbour, very busy packing away all drugs Troops on Orsova disembarked\n\ntoday. Arabs very busy selling to boys on board, when able to dodge police patrol. Patients from isolation taken ashore today to Suez hospital.\n","73":"\n\nAll discontented, fully expected to disembark to day, but failed to do so. Shortage of food, cooks received instructions only to prepare breakfast as we fully expected to entrain during morning. Very heavy boat traffic in Harbour, undoubtedly a busy port.\n\nSaturday 11\/12\/15\n\nHeaved anchor & moored Port Tewfik, Suez at 9.45 AM. Darkies working on shore are a\n\nvery dirty mixed race, you never see two dressed alike they wear anything. The chap in charge carries a stick & whacks any of them that try to loaf.\n\nEgyptian police, fine men, carry a long cane & whack any of the men who they have occasion to speak to, strange to see them trying to duck away from the stick like a schoolboy. Interesting to watch them diving for money; hold what they get in their mouth till it is full then fill their hands. A couple of Indian Stretcher bearers came on board & took off men for hospital. Train load of Indian troops, who have been in action\n\nin France for 12 months, came on to our pier to embark for Persian Gulf for a spell. A & B Coy 30 \"B” entrained & moved off for camp at 5 pm, Engineers, Signallers & L. Horse & ourselves entrained & left at 4.30 in 3rd class carriages, very crude. First view of Suez very striking place dirty & attire of people, chiefly women, most peculiar. At Shallufa,","74":" station out from Suez, we were informed that it was about here that the attack on the canal took place. Stopped at Station at about 7.45 pm, hundreds of Egyptians swarmed around trying to sell us oranges, cigarettes, dates tomatoes & dozens of other articles. Still travelling \n\nat midnight.\n","75":"\n\nReached our destination 2.45.AM. after being issued with blankets, turned in about 3.30 AM. very tired. Slept in till 8 AM.\n\nEgyptian labourers work 11 hours per day & only receive 2 piastres (5d) per day, Sunday & all.\n\nConvenience for mess very good, a large number of sheds erected with large tables & seats. Allotted to our tents, 12 in our tent, rather crowded. Received instructions to be prepared to move off to- morrow. Supposed trouble arising on canal. Working till 10 pm. Kit inspection during afternoon.\n","76":"\n\nVery cold & foggy, busy all morning preparing to move off to-night\n\nHad dinner at Y.M.C.A\n\nFirst mail arrived, no luck Great movement on foot, thousands of troops moved from camps around Heliopolis during day & night. We left camp Heliopolis 8.30 pm;& entrained at Zeitaun Stn 10.30pm ; moved off 11.15 pm still travelling at midnight.\n","77":"\n\nArrived at Ein Ghosein, 5.45 AM., Very foggy. Had breakfast, moved off from Station at 8 AM, arrived at camp, Serapium, 9 AM. after marching across the desert\n\nfor an hour on the edge of the Suez Canal. This side of canal lined with trees for a depth of about 20 yds; very fortunate to have shelter as sun is very strong during day Large Cruiser passed down Canal during morning, as well as a number of other large boats. Working all day unloading goods from boats. Very short of rations, all we had for today was 6 biscuits & bully beef; quite satisfied, cannot expect much more on active service. Allotted to tents at night; very glad to turn in. \n","78":"\n\nVery heavy fogs & dews here\n\neach morning, unknown to rain to any extent for 5 years; depend on heavy dews for irrigation purposes. Went artillery camp canteen further down canal about ½ mile away to purchase something for breakfast. Tomatoes & oranges fairly cheap & good. More goods to unload from boats; hand carry of about 50 yds over sand. Made acquaintance of some of boys in Artillery camp, all Englishmen, so glad to have us here, as previously all Indian troops have been camped in vicinity.\n","79":"\n\nReveille 7 A.M. Parade 9.30 A.M. 6 mile march through desert, very\n\nheavy marching. Complaints from some of men, regarding insufficient food. Making railway from main line to canal, where it will connect with metal road on opposite side prepared for motor traffic. Few skirmishes reported between Turkish outpost & ours, a few miles inland on opposite side of Canal.\n\nPiquet from 4.30 pm till 9 pm. S.S. Ceramic passed through from Australia with very large number of troops on board.\n","80":"\n\nReveille 6 A.M. No duty owing to being on piquet last night.\n\nSpent majority of day letter writing.\n","81":"\n\nStretcher drill during morning, very hard over sandy country. Afternoon, half holiday, thought it good opportunity to do my washing, had difficulty to obtain water. Selected among 12 A.M.C bearers to go with A Coy 31st Btn into desert to form outpost; Very busy making preparations to leave early to- morrow morning.\n","82":"\n\nArose early & made all preparations & moved off from opposite side of canal, about 10.15 AM. Crossed canal by pontoon, 10 AM. Marched about 8 miles out into Arabian desert & pitched camp at 4 pm.\n\nVery dreary marching across sand. Accompanied by camel train of 70 camels with provisions. Had tea 5 pm, bully beef & biscuits.\n","83":"\n\nIn the desert, not a tree or growth of any description to be seen. Infantry trench digging & constructing wire entanglements. Meals still of bully beef & biscuits. Easy day, lying about the most of the day. Few dressings to do. caused while opening tins of bully beef. \n","84":"\n\nArose 6.30 A.M. breakfast 8.30 AM. Very busy day, making dug out & communication\n\ntrench; hardest days work since enlisting. Expect to be moving further out in the course of a day or so. Very monotonous here & food poor.\n","85":"\n\nIndian Mountain Battery arrived late last evening, had a chat with the Indians this morning who explained the working of the guns to a few of us; some of them speak very good English. Filled in dug out late in evening, preparing to move to- morrow.\n","86":"\n\nMoved off 10 AM. to take up a position 3 miles further into the desert, sandstorm raging; most trying had to cover\n\nour faces with handkerchiefs as we were unable to stand sand beating against us. Wind dropped late in the day. Very glad to get our tent pitched & a biscuit to eat at 4.30 pm. Turned in about 9 pm.\n","87":"\n\nArose 7 AM. Camp now 11 miles from canal, situated between Bitter Lakes & TIMSAH Lake. One loaf between 12 of us for dinner, rather short rations. Commenced another dugout during afternoon, to act as a dressing station. Shower of rain at night, rather unusual\n\noccurence here. Nights seem very long; dark at 5.30 pm & no light whatever allowed.\n","88":"\n\nWhat a contrast to previous years; never expected to spend Xmas in the desert. Beautiful morning after shower last night, although rather cold early. Surprise for dinner; Christmas pudding & preserved fruits, very acceptable after food we have been receiving lately. Received bad news during day, re Allies evacuating Dardanelles. Worked most of the day making dug out, to act as dressing station in preparation for an attack. Turned in 10.30 pm feeling very tired.\n","89":"\n\nBritish aeroplane passed overhead at 8.30 AM probably on patrol duty. Most of day working on dug out. Received mail during afternoon; second since arriving in Egypt. \n\nSection of Bikaner Camel Corps arrived here this afternoon. Apparently many types of Indian troops in vicinity of canal. All troops withdrawn from Gallipoli, supposed to be on banks of Canal.\n","90":"\n\nVery cold early. Again worked to finish dug out; quite an elaborate one. Shifted our tents over near dug out. Very warm during\n\nday. Camel Corps sighted Turkish scouts 3 miles out from here.\n","91":"\n\nAll morning trench digging; afternoon half holiday. First aid Lecture at night by Capt North, subject – Arresting Hemorrhage – Exceptionally cold night.\n","92":"\n\nFalse alarm at 10 AM; quite a stir in camp; all tents dropped & men rushed to their respective trenches. Col Tibbey visited camp 12 noon. Enemy scouts again seen in close proximity to camp.\n","93":"\n\nRoute march during morning, otherwise\n\nnothing of interest happened during day\n","94":"\n\nSection of Indian Mountain Battery relieved to-day; given pencil by one of them presented to him by Princess Mary. Stretcher drill greater part of afternoon; very hard & tiresome drilling in sand.\n","95":"\n\nSignalling the greater part of the day. Expect to be relieved to-morrow.\n","96":" 2\/1\/16\n\nArose not feeling too well. Relieved & left \nQ.B.N.\n Habuja camp 2 pm & after a very hard & fast march arrived back at Serapeum 5 pm, feeling very sore & tired. Turned in about 9.30 pm in tent with 14 others; quite a crush.\n","97":"\n\nVery cold & windy. Not feeling well enough to go on parade. Ordered to hospital No 2 ward. Small steamer with a number of C. Coy 29th Btn on board, sank in canal; equipment & all lost, beside machine guns. Skirmish at outpost a few hours after we were relieved\n","98":"\n\nVery windy & cold. Great amount of work being carried out on all parts of canal. Boat which sank yesterday, raised & taken away to-day\n","99":"\n\nVery wild & cold day. Rained again\n\nduring afternoon.\n","100":"\n\nVery monotonous in hospital. Very windy & cold again. English artillery moved camp.\n","101":"\n\nDull & cold morning, windy during afternoon. Great rush of mumps patients into hospital. Seventh Australian Engineers arrived here & pitched camp. All Australian troops being brought on to canal.\n","102":"\n\nRained heavily during early morning. Stretcher squads rearranged; appointed No 4 in charge of squad. A few large cruisers passed along canal.\n\nA & B Section engaged in a friendly football match during afternoon. A Sec won 10 points to 5.\n","103":"\n\nCold morning; still in hospital. Church parade held, but unable to go owing to being in hospital. Col Tivey inspected camp.\n","104":"\n\nOut of bed first time for a week. Went for a stroll along the canal, great activity on both banks. Received pay.\n","105":"\n\nGrand morning. Arab died in hospital Met Cpl Brabner of 7th Aust Field Engineers.\n\nPts Fisher & Priest reported missing from previous day; search party organised & found them 10.30 AM.\n\nSmall Christmas gifts from Australia given out during afternoon.\n","106":"\n\nReceived further news re evacuation of Dardanelles; very successfully carried out with only slight losses. Practically all Australian troops withdrawn from Gallipoli camping in vicinity of Tel-el-Kabir; all looking much the worse for wear.\n","107":"\n\nRained slightly early morning. Very quiet day.\n","108":"\n\nCold morning. Received mail from home; first for nearly 3 weeks\n\nMore admissions to hospital. Outpost to be again relieved to-morrow by 17 Sec\n","109":"\n\nBeautiful morning. Very little traffic on Canal during past week. Dental work commenced by Lieu Riley in connection with 8th Field Amb. Wild rumors in circulation as to where we are likely to be moving to. Betting stands at - 6 to 4 on, the other side of canal, 6 to 1 agst further down canal, 30 to 1 Tel-el-Kabir, 50 to 1 Persian Gulf, 100 to 1 France; very amusing to hear all discussions as to where we are likely to go.\n","110":"\n\nExceptionally cold morning. AMC. Supplied fishing piquet\n\nto Bitter Lakes. Lieu General Sir A Murray of the Imperial forces passed down the canal on a fine launch about 4 pm. All troops lined banks & stood to attention\n","111":"\n\nRailway progressing very rapidly on the opposite bank; trucks already placed online in readiness for immediate use. Sandy blight very common among our men. One of A Coy, 31st Btn admitted into hospital having shot himself through foot while on outpost duty; everything points to the wound being intentionally inflicted. Dozens of\n\nDhows on canal carrying metal for railway & road. A raft constructed by 7th Aust Engineers camping here, sank while being given a trial by 16 men; one was drowned & several others much the worse for their experience. More A.M.C comforts distributed.\n","112":"\n\nGeneral Godley & Staff of Imperial forces inspected all troops in vicinity this morning. Victim of drowning fatality buried at Ismailia this morning. Somewhere approaching 2,000,000 sand bags landed on canal bank, directly opposite where we are camping. Large filters being erected here in\n\nconnection with water supply in preparation for attack on Canal. Camping directly opposite where Turkish forces attacked this time last year. Met Harry Neal of 7th Aust Engineers camping here. Hospital Ship Marama, probably returning from New Zealand, passed up canal about 6 pm. Looked very fine steaming slowly with full lights.\n","113":"\n\nSS Imrah from Australia passed by at about 2.30 pm. Andy Fisher from bridge deck wished us all good luck. Visited graves on opposite side of canal where Turks were buried on occasion of first \n\nattack, 12 months ago. Weird & gruesome sight, dozens on surface of ground, legs & arms protruding in many other cases. Pushing full gauge railway on very rapidly on this side of canal; platform & shed erected just north of our camp.\n","114":"\n\nRailway on opposite bank commenced running to-day.\n\nMajor Newell & Capt Wooster accompanied Brigade Headquarter’s Staff to Ismailia to inspect sight where we are about to move.\n","115":"\n\nCamel Corps, with 500 Camels arrived here last night. First train ran on heavy gauge \n\nline, from main Suez-Cairo line to Canal.\n","116":"\n\nMail from home. Col Shepherd arrived to take command of 8th Field Ambulance.\n\nExcitement at night when HMS Implacable passed up canal. Looked fine throwing her searchlights.\n","117":"\n\nSargeant of 29 Btn Camping here, killed by train at Serapeum Station.\n","118":"\n\nExceptionally cold morning. Discharged from hospital, after 3 weeks detention with mumps.\n","119":"\n\nColdest morning to date, rained heavily\n\nduring night. Fifth & Sixth Btn & part of 1st Btn arrived here yesterday; have just returned from Gallipoli, & some tell very interesting stories of their experiences.\n","120":"\n\nStill very cold. Issued with sheep skin vests last night. Large number of Australian troops still arriving here from Gallipoli. Pontoon bridge placed across canal directly opposite our camp. Kit Inspection & pay during morning, stretcher drill, afternoon.\n","121":"\n\nAnother very cold & rainy day. Fatigue work practically all day. Rumors re moving seem to have dropped. Outpost relieved by returned\n\ntroops. Canteen closed down owing to being raided by men.\n","122":"\n\nRainy & cold weather still continues. Piquet duty; first for some considerable time; drew 12-30 AM – 4-30 AM shift.\n","123":"\n\nReceived letters & cards from home Celebrated the anniversary of my birthday on piquet duty.\n\nRelieved from piquet 4.30 pm; Walked to Serapeum Station about 1½ miles across desert & caught 7.30 pm train for Ismailia, arrived back in camp 12.30 AM. About 70 Officers & men of No 2 Casualty Clearing Hospital\n\narrived here 4.15.AM this morning.\n","124":"\n\nChurch parade conducted by Capt Cranston, (Chaplin 29th Btn)\n\nCaught ration boat & again went to Ismailia, about 11 miles distance up Canal. Very pleasant trip; Ismailia a very pretty place. Caught train leaving Ismailia about 10 pm, arrived back in camp 12 pm.\n","125":"\n\nWater fatigue. Interesting lecture by Capt Donald on cause & prevention of diseases prevalent in tropical countries.\n","126":"\n\nFull day field training. The\n","127":" & 8th Battalions arrived here & camped on opposite bank of canal. At night went to camp of 7th Aust Engineers; met the Neal brothers also Oscar Clarke.\n\nWednesday 2\/2\/16\n\nMorning route march to Signal Station Tussoux Second Field Ambulance arrived early this morning.\n","128":"\n\nAll preparations being made to move off at very short notice. Piquet duty 8.30 pm till 12.30 am.\n","129":"\n\nRelieved from piquet 4.30 pm All tents struck & now camping\n\nin an old building, waiting instructions to move. Large transport passed along canal, with English troops, bound for Persian Gulf.\n","130":"\n\nAll bugle calls resumed, as under ordinary circumstances. Commenced constructing a dug out about ½ mile to rear of camp.\n","131":"\n\nReveille 6 AM instead of 6.30 AM. Church parade 9 AM. Mr Cranston, Chaplain of 29 Inf Btn again took service. P & O Steamer Malwa passed down canal about 5 pm\n","132":"\n\nWeather becoming very warm\n\nAfternoon parade, Lecture by Capt North, on Sanitation\n","133":"\n\nMorning, Route March towards Bitter Lakes. Afternoon, In charge of stretcher squad carrying patients to No 1 Casualty Clearing Hospital, on opposite side of Canal.\n\nP & O Steamer Arabia passed up canal en route from Sydney to London about 10 pm. Traffic rates for Canal –\n\nCargo Steamers 5\/3 per ton\n\nPassenger \" 6\/- per ton & 8\/4 every passenger carried.\n","134":"\n\nVery windy & rather cold.\n\nMorning, Instruction in mat\n\nmaking, out of reeds, by the Arabs; very interesting.\n\nFew very sharp showers during day. Still camping in old building; no further news re moving. New Canteen opened for the use of the 1st Division.\n","135":"\n\nRoute march to Bitter Lakes, about 4 miles & swim. Lakes very shallow in parts; can wade out for fully a mile. Returned to camp for lunch about 1.30 pm. Interesting lecture during afternoon by Capt Wooster, dealing with particulars of Geneva Convention\n","136":"\n\nMorning, signalling. Afternoon\n\nStretcher drill. All No 4s of squad brought out in turn to drill the section, my first opportunity of drilling the section.\n\nExcitement at night; gambling school composed of men from the Infantry raided within our lines. Some of the men arrested.\n","137":"\n\nWent on dental parade & had tooth refilled. Large mail from home after a fortnights interval.\n","138":"\n\nChurch parade 9 AM. Two British Monitors, carrying 2 large guns, one fore & one aft & two ante aircraft guns passed\n\ndown towards Bitter Lakes. Troopships Kyarra, A55 & A7 went along about 3 pm towards Port Said, with troops from Australia. Mail Steamer Osterley which left Sydney Jan 15. passed here 10.30 pm. Heavy traffic on canal during past week. Posted home a number of small photos.\n","139":"\n\n1st Field Ambulance arrived here to-day with full equipment & waggons & proceeded across the canal about dusk. Engaged in conversation with some of the boys who had been through the Gallipoli Campaign & found them very\n\ninteresting; also met Ron Styles who has been attached to the 1st recently, since returning from Peninsular.\n","140":"\n\nCeremonial drill under supervision of Col Shepherd Large number of British troops have passed down canal during the past few days, bound for India they say.\n","141":"\n\nSecond instalment of A.M.C. comforts distributed last night; Soap, tooth paste & brushes, writing paper, & envelopes, chocolate & cake were mainly the articles distributed, only small but very\n\nacceptable. Morning, Route march to Ein Goshein station. Think nothing of the distance now, but when we first arrived at Ein Goshein & had to march to the present camp it seemed an awful march.\n\nAfternoon. Lecture on Wounds & treatment of such by Capt Irving. Camel train of about 400 camels crossed over canal this afternoon. Copy of letter written by General Birdwood to General Godley, regarding disapline , read out & spoken of on morning parade.\n","142":"\n\nPractice in advancing in stretcher squads under supposed fire,\n\nto collect wounded; also commenced another dug out about a mile to the rear of camp. Mail by Osterley arrived to day, welcome news to know first letters had been received at home & elsewhere. Afternoon, Lecture by Capt Donald, on Arterial System & arresting of Hemorrhage.\n\nFriday 18\/2\/16\n\nEarly morning parade, detailed for water fatigue; which necessitates filling all fantasies necessary for supplying camp with water for the day; finished very late through\n\nhaving to wait for the water launch to arrive.\n\nWeighed during day at A.S.C. & turned the scales at 12st 4lbs an increase of \n","143":" stone 1 lb since leaving Sydney.\n\nApparently a very bitter feeling exists between our boys & the English troops owing to several incidents which occurred on the peninsular.\n","144":"\n\nWindy & most disagreeable day. Delighted to receive first parcel from home, the contents of which was very very acceptable. 29th Btn band played here during the\n\nafternoon & music was appreciated by the boys; it is not very often we are honored in such a way\n","145":"\n\nChurch parade 9 AM. Service conducted on 31st Btn parade ground by Capt Chaplain Cranston. Had pleasant game of tennis with a few of the members of the 20th A.S.C. who have rackets; the court adjoins our camp & although in fairly good condition, must have been laid some years back. Severe wind & dust\n\nstorm arose about 3.15 pm. & spoilt remainder of the afternoon.\n\nResult of tennis – Large blisters on soles of feet, through having to play in socks; ruined pair of socks & lost 5 piastre on game; nevertheless very enjoyable.\n\nHeavy rainstorm about 5 pm. Pay Day; Paid £ 1-10-9 - 150 piastre\n\nThird issue of tobacco from military authorities which I found very little difficulty to dispose of.\n","146":"\n\nMorning water march. Afternoon Lecture by Capt Wooster dealing\n\nwith treatment of fractures Pte Phil Stone, B Sec, transferred from 8th Field Amb. to No 1 Casualty Clearing Hospital, on account of being medically unfit for field duties.\n\nPiquet duty from 6.30 to 10.30. piquet mounted to prevent gambling parties from assembling in old building within camp bounds.\n\nCensorship rules, revised, & now much more strict than they previously were.\n","147":"\n\nMore trouble regarding drawing of water; fantasies had to be carried on stretchers from opposite side\n\nof canal. P & O, Australian mail boat Khiva passed down canal bound for home, fine crowd on board. Lecture by Capt Donald, dealing with correct methods of writing a military letter & other points dealing with military discipline.\n","148":"\n\nAl patients removed to No 1 Casualty Clearing Hospital, in readiness for moving off. \n\nReg granted leave to go to Ismailia to collect money which he cabled home for before leaving the boat. Sgt Matheson & Pte Wickers transferred to No 1 Casualty Clearing Hospital, ill.\n","149":"\n\nIssued with tin of tobacco, gift from Victorian Racing club. Fatigue work practically all day. Scratch concert arranged, \nat night\n which passed a very pleasant evening.\n","150":"\n\nFell in on parade at 10 AM. in full marching order with blankets rolled & kit bags. Parade dismissed & camp thoroughly cleaned up.\n\nAll goods & equipment loaded on to 20th A.S.C. waggons & transported to railhead Serapeum West. Issued with 24 hrs rations (1 tin\n\nbully beef & 6 biscuits) & marched out of camp at 1 pm to railhead to entrain. Train arrived at platform a little after 2 pm & after loading all goods moved off at 4.15 pm arriving at Tel-el-Kebir at 7 pm. After loading all goods for transport to camp site, arrived at our temporary camp & settled down for the night about 11.15 pm feeling very tired.\n\nSaturday 26\/2\/16\n\nArose about 7.45 AM & soon found my way to a canteen & had breakfast.\n\nMoved tents about 50 yds from where they were pitched last night; expect to be\n\nmoving further in a few days. All Battalions reorganised & with reinforcements which have been in Egypt for some time, Battalions up to 60th Btn formed. C section of 8th Field Amb with C section of 5th Field Amb now form the","151":" F. Amb.\n\nBig mail arrived & we were also issued with tobacco.\n","152":"\n\nWindy & dusty. No reveille; very late breakfast. Tom Martin came to camp, had a long yarn with him. During the day also met E. Hawkless, G. Earl, V Solomon, S. Hawkless of B Coy 56 Btn & H O’Donnell\n\nWalked out about 1½ miles to old field of Tel-el-Kebir; country very flat for miles.\n","153":"\n\nMorning Squad drill, Afternoon Stretcher drill. Sgt Ruming transferred to Casualty Clearing Hospital, ill. Went to","154":" Btn lines at night & met a number of the Balmain boys. Meeting of Officers & N.C.O.s in view of organising sports in connection with 8th F Amb.\n","155":"\n\nTea served out before early morning parade. Forbidden to drink camp water, owing to outbreak of Enteric.\n\nOne pint of boiled water per day served out to all ranks. Morning route march about 5 miles over the desert to an oasis, arrived back in camp about 1 pm. General meeting after afternoon parade to elect committee re sports\n","156":"\n\nA few of the sports committee sent to Cairo to procure sporting material. Leave granted to 2 men from each section, to go to Cairo, from to day.\n\nPaid 150 piastres £ 1-10-9 \n\nRe allotted to tents, only 10 men allowed to a tent. A number of men under the influence of drink, owing\n\nthe event of pay day.\n\nMarch","157":"\n\nBacon for breakfast, sure indication of route march. Morning. Route march across the old field, about 3 miles, to the old trenches used in 1882. Human remains lying about on the ground in proximity to the trenches. Pte A. Fernandez, Batman, being medically unfit, left camp to return to Australia.\n","158":"\n\nHot & most oppressive day. Very trying during the morning while engaged in field work. Lecture in the afternoon by\n\nLieu Robinson on French; first of a series of lessons for those who are desirous of taking up the subject. Leave altered to 4 from each section per day, which brings my leave closer.\n","159":"\n\nWeather very changeable, quite a contrast to yesterday; windy & cold today. Spent morning signalling. Two day cricket match arranged between A & B Sections, commenced this afternoon.\n","160":"\n\nChurch parade 9.30 AM on 30th Btn parade ground. Cricket match continued from\n\nyesterday. B section won by 28 runs; took 4 wickets for 8, given out L.B.W. for 1. Transport waggons arrived here this evening; transferred over from 4th L. H. Field Ambulance\n","161":"\n\nRelieved from piquet & appointed acting L. Cpl in charge of piquet.\n\nPromotions\n\nCpl Waggon Orderly Roberts to be Acting Sgt General Duties.\n\nL\/Cpl Watson to be acting Cpl Waggon Orderly. Pte Grover to be acting L\/Cpl from date.\n","162":" X\n\nVery foggy morning. Acting orderly corporal for the day.\n\nSizes & measurements taken for helmets & light clothing.\n\nWednesday 8\/3\/16\n\nCaught 7.15.AM train from Tel-el-Kebir, on leave to Cairo. Very pleasant trip through; arrived Cairo 9.30 AM. Reg & I bought a camera each & then went direct to Roberts & Hughes to see Mr Roberts, who unfortunately is at present in England.\n\nLeft for Pyramids 10.30 AM with guide & after spending a very interesting few hours arrived back to the city at 2 pm for dinner. After dinner visited Bazaar, then returned to\n\nthe city to purchase few articles required. Had tea at Y.M.C.A. in Esbekiah Gardens, then wound our way to station to catch train leaving at 7.15 pm.\n\nFirst news I received on returning, was to the effect that Captains North & Donald had been transferred to the 7th Field Ambulance. Their departure from the 8th Field Ambulance was keenly felt by all concerned.\n\nThursday 9\/3\/6\n\nFatigue work during morning. Acting Piquet Corporal to-night. About 35 men, details from various Battalions temporarily attached to the 8th Field Amb.\n","163":"\n\nActing Piquet Corporal for the day. Mail arrived after a fortnight’s interval. Capt North endeavouring to be transferred back to the 8th F. Amb. Spent a few hours here to-day; already transferred from","164":" to","165":" Fd.\n","166":"\n\nField work with wagons during morning. Afternoon half holiday; Selected to play cricket with first eleven against team of Field Engineers.\n\nEngineers won toss & batted first, scoring 35. We compiled 105 of which I made 17, this concluded the days play. Another issue of\n\ntobacco.\n","167":"\n\nChurch parade 9.30 AM. conducted by Capt Chaplain of the 30th Btn. Cricket match continued from yesterday. Engineers compiled 59 in their second innings leaving us winners by an innings & 11 runs. I took 2 wickets for 6.\n","168":"\n\nInnoculated again for Enteric. No 4s of each squad given medical haversack to go through & see contents were all correct.\n\nAfternoon off in consequence\n\nof inoculation, all feeling the effects.\n","169":"\n\nFree from all duties on account of yesterday’s innoculation. Received parcel from home. Developed first film of photos, which turned out fairly successful. Managed to get past guard at railway crossing & into the village of Tel-el-Kebir. Fair amount of traffic in form of dhows, on Sweet Water canal, which runs within 20 yds of railway Station. Village very dirty & what building there are, are in a dilapidated state. Still consistent rumors as regards\n\nwhen we are to move & where we are likely to be going. Everyone seems to be getting more & more discontented each day.\n","170":"\n\nResumed duties after 48 hours off duty, through inoculation. Field work carried out during the morning with waggons. Sgts Fry & Kidson from 15th Field Ambulance, transferred to our unit from 14\/3\/16. Number of the boys practicing for Quoits tournament, which is to be commenced on Friday next.\n","171":"\n\nExempted from morning parade in consequence of piquet\n\nduty. Acting piquet Corporal from 12 noon till 12 noon to morrow. During morning crossed railway line & had a look through the cemetery where the victims of Tel-el-Kebir were buried. Battle of Tel-el-Kebir fought 13th Sep 1882. Sent parcel home containing Silks & Watch. More A.M.C. comforts distributed.\n\nPaid £ 1-10-9 = 150 piastres\n","172":"\n\nPiquet duty till 12 noon.\n\nLeave reduced to 1 % during week, 2 % week ends, owing to misconduct on part of some of the men on leave in Cairo\n\nOnly men of good character granted leave (2000). A number of Royal Welsh Fusiliers, of the B class, who are either too old, or else have been rendered unfit for further service in France, arrived here to do garrison work.\n","173":"\n\nWindy & very dusty.\n\nStretcher drill morning parade. Match (cricket) arranged between N.C.O.s & men of corps. 1st in. Scores N.C.O.s 62 Men 72; played with men, scored 20 & took 2 wickets for 5 – end of days play; played through a heavy wind & rain storm. Went to 30th Btn lines at night to see some\n\nof the Balmain boys. Supper Y.M.C.A.\n","174":"\n\nRained heavily during night; five of the tents swamped out; quite an unusual occurence in this part. Church parade 9.30 AM 8th Brigade parade ground; service conducted by Capt Chaplain Beverage.\n\nPlayed team from","175":" Btn & won by six wickets & 6 runs – Scores 30th Btn, 52 & 67. We scored 66 & 4 for 59. Scored 14 first innings 32 not out second innings & took 3 for 9. Went on piquet duty as acting piquet corporal at 6 pm.\n\nMonday 20\/3\/16\n\nAgain inoculated & relieved from piquet 12 noon. Walked out about 1 mile during dinner time & spent a very interesting half hour watching the Artillery in action. First experience of artillery fire; firing live shells; their shooting appeared to be very accurate. Off duty during afternoon.\n","176":"\n\nHad an unexpected visit from Allan Rowling during dinner hour. Very pleased to see him & had quite a pleasant yarn with him.\n\nIssued with helmets at afternoon parade; spent remainder of afternoon\n\nendeavouring to fix pugaree.\n\nWednesday 2\/3\/16 X\n\nPiquet Corporal from 12 noon till 6 pm. Prince of Wales, now stationed at Ismailia, visited camp here to-day & inspected a large number of the troops. Large mail arrived from home, received 16 letters. Went to Camp picture show at night; some very strange remarks passed among the boys.\n","177":"\n\nActing orderly corporal of the day. Orders received that helmets are to be worn from date & all hats handed into quarter store. ","178":" Brigade\n\nmoved from here to day, probably back to canal. Afternoon recognised as camp half holiday instead of usual Saturday afternoon half holiday.\n","179":"\n\nRoll call at 7 AM on account men failing to fall in on breakfast parade. Issued with summer clothing; very amusing to see some of the fits; had to turn up about 5 inches of my trousers. Preparing for another move; 12 of the tents struck; men had to sleep in the open. B Section tent division left at night as advance guard. Acting piquet corporal from 6 pm. Issue of tobacco & cigarettes.\n","180":"\n\nPiquet Corporal for the day. All stores & equipment being packed ready for removal. Majority of tents struck & removed to railway siding; had to sleep in the open.\n","181":"\n\nAll busy making final preparations to move off early to-morrow, rumoured we are to march to Ferry Post, 6 miles further on than Ismailia. Issued with puttees & lanyard. No church parade owing to 8th Brigade having moved off a few day previous. Fatigues till late at night.\n","182":"\n\nReveille 4.15 AM. Breakfast 5.30 AM. After loading transport waggon & 12 camels, which carried blankets & provisions, we fell in at 6.15 and moved off at about 6.40 AM. Morning very foggy, but cleared about 9 AM, & sun shone out very strongly & remainder of the day was very warm. Dozens of infantrymen began to drop out in the very early stages of the march. Halted for lunch at 11.40 AM, opposite village of Kassissin. Iron rations (bully beef & hard biscuits) served out. Moved off again after lunch at 1.45 & continued marching till 3.30 pm\n\nwhen we halted at Mehsamah & bivouacked for the night. During the day hundreds of men dropped out of the march. Felt rather tired myself & was not sorry to turn in at night.\n","183":"\n\nReveille 4.30 AM. Breakfast 5.30 AM. Fell in to continue march at 6.30 AM. Morning broke very warm. Feeling rather stiff from yesterdays march. All went well till lunch time when we made a halt from 11.30 till 12.30. Shortly after lunch trouble began when we encountered, hilly sandy country, hundreds began to drop out every few\n\nminutes owing to sheer exhaustion. It was an awful sight. Rifles, packs, equipment of every description strewn all over the desert where the men had marched. Many men became delirious & we had our work cut out, trying to render what assistance we could; the one cry was for water; hundreds could not speak for the want of water. Out of the whole of the 14 Brigade including 53, 54, 55, & 56 Btns who we were marching with, only about 400 finished the march; up till a late hour\n\nat night stragglers kept coming in. Some of the transport wagons arrived late at night; the remainder had to be brought in next day. Bivouaced at Moascoar for the night. Finished marching feeling as fit as the majority, still I must admit it was the hardest & most trying day of my career.\n\nNew Zealanders who are camping at Moascoar, came to the assistance with their wagons & brought in many of the men who were unable to walk; they were very kind to us in every way & their kindness on this\n\noccasion will never be forgotten by those who took part in the march. According to reports a number of the men died from the effects of the march.\n","184":"\n\nArose about 5.30 AM & made steady preparations to finish the march. Morning again very warm. Moved off from Moascoar about 9.30 AM & marched through Ismailia to Ferry post, where we arrived at 11.30 & soon took shelter in the tents which our advance guard had pitched. End of a very trying march of 40 odd miles. Rested till 3 pm, when we marched\n\nabout ½ mile to canal & had a very pleasant swim. Turned in about 7.30 pm.\n","185":"\n\nFatigue works during day. Severe wind & dust storm passed over about 11 AM & blew down the majority of our tents. A number of men are suppose to have died on the march.\n","186":"\n\nMore fatigue work. Afternoon off on account of having to go on piquet at 6 pm as acting piquet corporal. Went for a swim in canal while of duty. 150 men\n\nadmitted into hospital here suffering from the effects of the march. Paid 150 piastres (£ 1-10-9). Turkish spy caught out a few miles past railhead, & brought in here blindfolded.\n","187":"\n\nPiquet Corporal for the day, returned at 6 pm. Very nearly in trouble for leaving camp while on duty. Received parcel from Mrs Robison. Sing song in tent at night, had rather an enjoyable few hours.\n","188":"\n\nOn the move again, being in this camp only 4 days. Struck all tents & packed & loaded all material\n\nMoved out of camp 3.40 pm, arrived at railhead, about 5½ miles, at 5.30pm.\n\nBivouaced here for night. Hard road most of way out; marching not too bad. Two new officers attached to corps in place of Captains North & Donald.\n","189":"\n\nHeavy dew during night which made sleeping out not too pleasant. As A & B sections are to take up different positions further out into the desert, the day was taken up sorting material & equipment according to sections. Again fell in & moved of at 5.30 pm to take up a position\n\nabout 3½ miles further out with the 31st & 32 Btns. After going about 2½ miles, transport was unable to go any further owing to nature of road. Bivouaced here for the night. Scratched a hole in sand & soon made myself comfortable. Becoming experts at moving about. Preparations made for supply in the line of railway & road very fine.\n","190":"\n\nReached our destination this morning at 11 AM, after marching 1½ miles over sand, after termination of road, carrying our blankets & other equipment.\n\nPitched a few tents, then rested the remainder of the day. Turned very cool towards evening.\n","191":"\n\nCooks fatigue for the day. Much cooler than usual. Hospital tents pitched & commenced to take in Brigade sick. Dysentery rather prevalent among the troops camping here; water apparently the cause.\n","192":"\n\nRather warm again. Very little work carried out here during the middle of the day owing to the heat. Flies very troublesome. Walked across to roadhead about 1½ miles\n\na 8 pm, to meet one of the boys who had gone in to the Ferry Post for some provisions. Very late returning; 11.15 pm before we returned to camp. Lucky not to have been missed as we were away without leave.\n","193":"\n\nMail arrived today after waiting patiently for 17 days. Engineers commenced to erect a mess hut & cook house for our corps. Parade hours altered owing to hot weather. Reveille 5.30 AM Breakfast 6.30 AM, Parade 7 AM to 11 AM Parade again 3 pm to 4.30 pm.\n","194":"\n\nWent with a number of others to railhead to finally pack our universal kits, as they are to be taken away from us. Packed necessary articles in white kit & sent out to camp, at road head north, by ration limber. Were then allowed to proceed by desert train to Ferry Post, for a swim in the canal, which was very acceptable; also indulged very freely at the canteens. Returned to railhead at 5.45pm; arrive back at camp at 6.20 pm.\n","195":"\n\nGeneral parade 7 AM, Church\n\nparade 8.45 Am, conducted by Captain Chaplain Cranston. Played in a scratch football match during the afternoon; rather heavy playing in sand.\n","196":"\n\nWater fatigue for the day. Lucky enough to get sufficient water to do my washing. Issued with our colours. Developed a few films at night, which turned out fairly successfully.\n","197":"\n\nWent in to railhead again & caught desert train to Ferry Post; crossed canal without pass to Ismailia; had dinner at Hotel – de – Voyagers. Caught\n\nin heavy rainstorm while returning to Ferry Post to catch train. Arrived back in camp 4.30 pm. While in Ismailia posted some views of the town home.\n","198":"\n\nMuch cooled that usual. Had some fine sort on a camel during parade hours. Very peculiar but sad incident; occurred here to-night; When the cheese was issued, \n to night\n, owing to its condition, it was considered necessary to perform a burial service immediately. Private Poulton, robed in a tent fly, headed the procession & performed the ceremony in a very creditable\n\nmanner. It caused great amusement among our officers & the infantry who are camping close by. Posted small parcel home. Very severe sandstorm unexpectedly arose about 8 pm & lasted for a couple of hours; during the night it came on again & we had a fine job hanging on to the tent from the inside, trying to prevent it from blowing down.\n","199":"\n\nA fearful day. Unable to leave tent without covering your face. Cooks unable to carry out their work. During the day a number of the tents were blown down\n","200":"\n\nWindstorm subsided this morning but was followed by very heavy rainstorm. \n\nDid very little duty today.\n","201":"\n\nFeet inspection at the early morning parade. 31st & 32nd Battalions moved from here this morning. Caught sand adder, while pitching a tent; although small, they are considered very dangerous. \n","202":"\n\nSandstorm which prevailed here a few day back; known by the Egyptians a \"Khamseen”, which means 50, as it has been known\n\nto last for 50 days with perhaps a break of a few days during the period. \n\nCooks fatigue for the day. Engagement reported between Turks & Squadron of 9th Aust Light Horse a few miles out from outpost at ‘Habuta’, where I was camping at Christmas. Ten Turkish casualties & 30 prisoners taken, our casualties very slight.\n","203":"\n\nCaught train to Ferry post where I spent most of the morning in the Canal; although very warm, had rather a good day. Five of the eight ambulance waggons returned to Ordnance this morning. Expect to be equipped\n\nwith Motor Ambulance waggons very shortly. Thirty six horses also returned.\n","204":"\n\nAttached to Fifth Division which consists of 8th, 14 & 15 Brigades & is one of the two Divisions which form the 2nd A & NZ, Army Corps. The Artillery attached is equipped with 60 guns, 48 of which are 18 pounders & 12 are 4.2 Howitzers. Struck tents for the purpose of airing the ground on which they are pitched. Received parcel from home containing Diary & Ink Pellets.\n","205":"\n\nRoute march morning & afternoon. Rather a very quiet & uneventful day.\n","206":"\n\nFatigue work practically all day. All camps about the desert given Australian names such as Duntroon, Narrabri, Brighton Beach.\n","207":"\n\nGood Friday; water fatigue. Blankets fumigated by a sanitary squad, who travel from camp to camp for such duty. Church parades during day, but was unable to attend owing to fatigue duty. Paid 150 piastres = £ 1-10-9\n","208":"\n\nMail day. Route march afternoon. Scratch football match at night.\n","209":"\n\nVery warm. No duty to day Meeting at night of Officers & men\n\nto elect committee & arrange programme of sports, in connection with Anzac day celebrations on Tuesday next. Major Newell donated a prize of £ 1 for tug-of-war, which is to be between A sec Bearers & A sec Tent Division.\n","210":"\n\nKeen interest being taken by all in sports which are to take place to morrow. Interesting lecture by Major Newell on method of evacuating wounded from firing line. He also spoke of the new establishment of a F. Amb.\n\nRoute march afternoon. Scratch\n\nfootball match after tea which ended in a very unpleasant manner, Nick Coxin having the bad luck to fracture his Patella & was carried off field into hospital. \n","211":"\n\nAnniversary of landing at Anzac; recognised as a holiday by all Australian troops in Egypt. Most enjoyable day. Sports arranged for the afternoon & with the assistance of the Officers, were carried out without a hitch, every item being keenly contested. A few of the boys worked very hard & with provisions brought out from \n\nA.I.F. canteen at Ferry Post prepared a most elaborate tea. Concert at night was a huge success, some of the items, though not of a very high standard were most amusing. Issue of Red Cross Comforts.\n","212":"\n\nBy far the hottest day we have experienced here; flies very troublesome. Nick Coxin taken to No 2 Casualty Clearing hospital at Ferry Post. First Aid Lecture by Capt Mollison. \n","213":"\n\nMuch cooler. Lecture by Major Newell on treatment on cases of gas\n\npoisoning or Frost bite. Feet inspection afternoon parade.\n","214":"\n\nWent to railhead on dental parade to have tooth attended to; returned to camp 3 pm. Sent to roadhead with stretcher party late in the evening; arrived back in camp 8.30 pm. Mail day.\n","215":"\n\nMost of the day spent covering in the mess shed, which was erected by the Engineers\n","216":"\n\nChurch Service at 59 Battalion. Capt. Deck attached to A Section from date. Rumors of forming a C. Sec to be again attached.\n","217":"\n\nWater fatigue. General Godley & staff visited here this morning to inspect 59th & 60th Btns.\n\nGrenadiers of Infantry Btns spent some time in bomb throwing practice, to the rear of our lines this morning; caused quite a sensation. Officially reported that General Townsend, with 2900 British Troops & 6000 Indians has surrendered after holding out for over four months. Caused quite a depressed feeling among the boys here \n","218":"\n\nSquad & stretched drill during morning, also instruction in first\n\naid. Marched \nout\n to an old camp about two miles out, for the purpose of bringing in some sandbags to build a dug out.\n","219":"\n\nPractically the whole of the day building a dug out, - hard graft. Official word received through Intelligence Department stating that a large body of Turks, chiefly Camel Corps, are now about 40 miles to the East & advancing toward where we are camping. Stretcher squads formed & instructed to be prepared for duty at any time. Appointed No 4 in charge of a squad.\n\nNo 4s medical panniers, chequed & handed out in readiness for immediate use. Infantry camping near by, all out in the trenches ready for an attack. \n\nReceived parcel from home.\n","220":"\n\nAll rush & bustle. Bearers rushed out towards the trenches, about 1½ miles out from here, to construct a dug-out, to act as a dressing station, if the expected attack eventuates. Field Medicine, & Surgical panniers also two Sand Ambulance Carts, hurried out here by a number of the transport men who are to remain\n\nhere, in case they are required for duty. Ordered to sleep fully dressed.\n","221":"\n\nReceived word about 10 AM to strike camp & move to railhead immediately. After assisting to strike the camp, left with the advance guard shortly after lunch; march very unpleasant owing to the heat of the day. Arrived at the site of our new camp about 2.45 pm. We immediately set to & were kept going till late at night, pitching tents & unloading waggons. Piquet again placed over the camp, after being free from \n\nfor the past month, but was fortunate enough to miss it. Not sorry to turn in when all work was completed for the night.\n","222":"\n\nHeavy day. Fatigues the whole of the day & till rather late in the evening. Col Shepherd very strict regarding discipline & dress. Will not allow shorts to be worn, much against the wish of the boys, for the weather is now so warm.\n","223":"\n\nParade hours again altered to suit the weather conditions, each\n\nday appears to be getting hotter. Reveille 5 AM, breakfast 5.45 AM, parade 6.45 AM to 10.15 AM Lunch 12 noon Parade 4 pm to 5.30 pm, tea 5.30 pm.\n\nBranch of Y.M.C.A. established here; large number of N.Z. Light Horse camping here; it is the head of the railway by which all provisions are brought for the various outposts & troops camping in the vicinity; metal road continues for another 3 miles further out, where our B. Section is camping. ","224":" A.S.C. also here at railhead. Assistant Director of Medical Services visited our camp to day.\n\nMail arrived & I again got my share of letters\n\n& papers\n","225":"\n\nContinued fatigues which are anything but pleasant in the heat of the day. Engineers commenced to build another mess shed in connection with this camp.\n\nNew officer not very popular among the boys. Paid 150 piastres £ 1-10-9; do not expect many more pays in Egyptian money.\n\nSix months to-day since we left home. Piquet to night to celebrate the occasion. Leave for Cairo starts again to morrow\n","226":"\n\nRelieved from Piquet duty at 6 pm,\n\nnot sorry either, none to pleasant trudging along the sandy beats during the heat of the day.\n\nEach day becoming more & more monotonous, even the officers very discontented & anxious to leave this country.\n","227":"\n\nWorking on mess shed which is being constructed for the use of our unit. Afternoon half holiday. First time on sick parade since joining the 8th F. Amb; received a bump during the obstacle race on Anzac day & as in dozens of other cases here will not heal & has become septic.\n","228":"\n\nWent to the ordnance stores, across the canal from Ferry Post, on a waggon, while there received news to the effect that we are to be relieved by the 14th F. Amb to-morrow. On my return to camp found all busy packing all equipment & generally preparing to move.\n","229":"\n\nTurned out at 4 AM to prepare to move off. Breakfast 4.30 AM. Lucky enough to be detailed for baggage guard, which enabled me to travel \n\nthe distance to the Ferry Post by train, quite a throw in, for the day was exceptionally hot. On my arrival in camp, had the onerous duties of cooks fatigue bestowed upon me, which made the day a rather long one by the time I had finished my duties. Sixty-two men, who only arrived here from Australia on Sunday last; taken on strength & formed into C. Sec. of our unit. Tattoo parade at night ; which did not altogether meet with the approval of the boys & some \n\nof them very soon gave vent to their feelings.\n","230":"\n\nAgain unable to attend church parade, most of the day occupied by fatigue work. \n\nB section marched in about 4 AM; all together again \nfor\n after being apart for about six weeks.\n","231":"\n\nRe-allotment of officers. General inspection on early morning parade by Colonel Shepherd. In charge of a party of Arabs, to carry out some fatigue work; quite an expert at nigger driving. No afternoon parade owing to\n\nthe heat.\n","232":"\n\nDetailed for Quartermaster’s fatigue. Paid 150 piastres £ 1-10-9. \n","233":"\n\nParade hours again altered; hardly worthwhile going to bed at all. Reveille 4 AM, breakfast 4.30 AM, Parade 5.15 AM to 8.45; at leisure till 5 pm when we parade till 6 pm. Inspection by A.D.M.S. & D.D.M.S. whose report was very satisfactory.\n\nAfter parade went to canal swimming. The weather for the past week has been unbearable \n\nexceptionally hot winds prevailing. Divisional training arranged for \nfor\n to-morrow, but was cancelled late in the evening as the weather is considered too severe to carry out such work. Capt Lind, the new Adjutant, also attached to A sec bearers, a great acquisition to the Corps.\n","234":"\n\nTo-day, much cooler. Divisional holiday granted to 5th Division. Very acceptable after the hot days we have experienced for the past week.\n","235":"\n\nStretcher drill under the instruction\n\nof Capt Lind; marched us to trenches about ¾ mile out where grenadiers were practicing throwing hand grenades. Rather an interesting experience with these deadly missiles bursting only a short distance away; getting quite used to the whiz of the bullets. Circumstances will be different no doubt, when we are aware of the fact that they are being directed at us, instead of in the opposite direction. Piquet duty from 6 pm; not so bad now, for the piquet has been doubled owing to the hot weather & now we only\n\ndo half the time on our beat to what we did previously.\n","236":"\n\nWarships lying in lake near by engaged in target practice, caused quite a disturbance. Mail arrived.\n","237":"\n\nChurch parade. All preparations being made for the inspection by Lieu General McKay, G.O.C. of 5th Division this afternoon. Full dress rehersal after church parade, inspection took place at 5 pm. The G.O.C. does not appear to be very popular among the men, owing to the fact that he was responsible\n\nfor the route march from Tel-el-Kebir to here, also for trouble in connection with the Liverpool Camp.\n","238":"\n\nTurned out at 2.15 AM to take our part in Divisional manouvers in the form of a sham fight; had breakfast 2.30 AM moved away from here to join advance guard at 3 AM. Marched out about 3 miles, & as soon as we appeared on the scene of action; we were supposed to have been wiped out; \nso\n that ended our days work; the umpires classed us as\n\nout of action; made rather an easy day of it for us all. On our return we were all notified that we were to be given pack drill at 5 pm, for an hour, for failing to fall in smartly at 2.45 AM, when preparing to leave camp; rather stiff at that time of the morning. As usual we made light of it, & the humorous side of it overshadowed the rest; Very fine report from the G.O.C. who inspected us yesterday\n","239":"\n\nOld equipment & leggings called in. Issued with web equipment\n\n& packed; al busy putting necessary articles in packs ready for kit inspection to-morrow. Articles we have to carry in our packs. –\n\nGreat Coat. 1\n\nFlannel shirts. 1 & 1 on\n\nSinglets. 1 \" \" \"\n\nUnder pants. 1 \" \" \"\n\nCardigan Jacket. 1\n\nTowel. 1\n\nSoap & Shaving material\n\nAbdominal belts. 1 & 1 on\n\nCap Comforter.\n\nHousewife & Holdall.\n\nMess Tin & Cover.\n\nWaterproof sheet.\n\nDubbin.\n\nneedless to say we will endeavour to carry as much as we are able, after inspection.\n","240":"\n\nDrill with gas helmets; it is necessary to have a good deal of practice with the helmet so when the occasion arises we will be able to adjust them smartly; they are weird looking affairs & certainly take some getting used to.\n","241":"\n\nGeneral review of 5th Division by General Godley, Officer Commanding Canal defence forces; very fine spectacle. Camera fiends today got a severe\n\nknock when it was read in orders that cameras were prohibited in France & that we were either to send our cameras home or hand them in. Resorted to the wisest plan & sent mine home but with much regret.\n","242":"\n\nParade to see that all men were in possession of their Identification disc, pay book, field dressing pouch & field dressing, also inspection of packs. \n\nAlloted permanently to our respective sections.\n","243":"\n\nInspection of black kits; all unnecessary material & personal\n\nproperty scooped into a bag & thrown on the incinerator. Blankets rolled into bundles ready for transport tomorrow morning early.\n\nPassed a very cold night through having to sleep without blankets; which was quite unnecessary as the other sections had the use of theirs. \n\nTurned out at 3.45 AM & moved off at 4.45 AM with our packs up for the first time & after a fairly sharp march of about 4 ½ miles arrived at Moascoar at 6.40 AM. At once set to to pitch camp which took up the greater part of the day. Eventually we were allotted to our respective tents & again settled down to await our departure from this country.\n\n \n\n"}}