{"Document Name":{"0":"Diary_0367","1":"Diary_0367","2":"Diary_0367","3":"Diary_0367","4":"Diary_0367","5":"Diary_0367","6":"Diary_0367","7":"Diary_0367","8":"Diary_0367","9":"Diary_0367","10":"Diary_0367","11":"Diary_0367","12":"Diary_0367","13":"Diary_0367","14":"Diary_0367","15":"Diary_0367","16":"Diary_0367","17":"Diary_0367","18":"Diary_0367","19":"Diary_0367","20":"Diary_0367","21":"Diary_0367","22":"Diary_0367","23":"Diary_0367","24":"Diary_0367","25":"Diary_0367","26":"Diary_0367","27":"Diary_0367","28":"Diary_0367","29":"Diary_0367","30":"Diary_0367","31":"Diary_0367","32":"Diary_0367","33":"Diary_0367","34":"Diary_0367","35":"Diary_0367","36":"Diary_0367","37":"Diary_0367","38":"Diary_0367","39":"Diary_0367","40":"Diary_0367","41":"Diary_0367","42":"Diary_0367","43":"Diary_0367","44":"Diary_0367","45":"Diary_0367","46":"Diary_0367","47":"Diary_0367","48":"Diary_0367","49":"Diary_0367","50":"Diary_0367","51":"Diary_0367","52":"Diary_0367","53":"Diary_0367","54":"Diary_0367","55":"Diary_0367","56":"Diary_0367","57":"Diary_0367","58":"Diary_0367","59":"Diary_0367","60":"Diary_0367","61":"Diary_0367","62":"Diary_0367","63":"Diary_0367","64":"Diary_0367","65":"Diary_0367","66":"Diary_0367","67":"Diary_0367","68":"Diary_0367","69":"Diary_0367","70":"Diary_0367","71":"Diary_0367","72":"Diary_0367","73":"Diary_0367","74":"Diary_0367","75":"Diary_0367","76":"Diary_0367","77":"Diary_0367","78":"Diary_0367","79":"Diary_0367","80":"Diary_0367","81":"Diary_0367","82":"Diary_0367","83":"Diary_0367","84":"Diary_0367","85":"Diary_0367","86":"Diary_0367","87":"Diary_0367","88":"Diary_0367","89":"Diary_0367","90":"Diary_0367","91":"Diary_0367","92":"Diary_0367","93":"Diary_0367","94":"Diary_0367","95":"Diary_0367","96":"Diary_0367","97":"Diary_0367","98":"Diary_0367","99":"Diary_0367","100":"Diary_0367","101":"Diary_0367","102":"Diary_0367","103":"Diary_0367","104":"Diary_0367","105":"Diary_0367","106":"Diary_0367","107":"Diary_0367","108":"Diary_0367","109":"Diary_0367","110":"Diary_0367","111":"Diary_0367","112":"Diary_0367","113":"Diary_0367","114":"Diary_0367","115":"Diary_0367","116":"Diary_0367","117":"Diary_0367","118":"Diary_0367","119":"Diary_0367","120":"Diary_0367","121":"Diary_0367","122":"Diary_0367","123":"Diary_0367","124":"Diary_0367","125":"Diary_0367","126":"Diary_0367","127":"Diary_0367","128":"Diary_0367","129":"Diary_0367","130":"Diary_0367","131":"Diary_0367","132":"Diary_0367","133":"Diary_0367","134":"Diary_0367","135":"Diary_0367","136":"Diary_0367","137":"Diary_0367","138":"Diary_0367","139":"Diary_0367","140":"Diary_0367","141":"Diary_0367","142":"Diary_0367","143":"Diary_0367","144":"Diary_0367","145":"Diary_0367","146":"Diary_0367","147":"Diary_0367","148":"Diary_0367","149":"Diary_0367","150":"Diary_0367","151":"Diary_0367","152":"Diary_0367","153":"Diary_0367","154":"Diary_0367","155":"Diary_0367","156":"Diary_0367","157":"Diary_0367","158":"Diary_0367","159":"Diary_0367","160":"Diary_0367","161":"Diary_0367","162":"Diary_0367","163":"Diary_0367","164":"Diary_0367","165":"Diary_0367","166":"Diary_0367","167":"Diary_0367","168":"Diary_0367","169":"Diary_0367","170":"Diary_0367","171":"Diary_0367","172":"Diary_0367","173":"Diary_0367","174":"Diary_0367","175":"Diary_0367","176":"Diary_0367","177":"Diary_0367","178":"Diary_0367","179":"Diary_0367","180":"Diary_0367","181":"Diary_0367","182":"Diary_0367","183":"Diary_0367","184":"Diary_0367","185":"Diary_0367","186":"Diary_0367","187":"Diary_0367","188":"Diary_0367","189":"Diary_0367","190":"Diary_0367","191":"Diary_0367","192":"Diary_0367","193":"Diary_0367","194":"Diary_0367","195":"Diary_0367","196":"Diary_0367","197":"Diary_0367","198":"Diary_0367","199":"Diary_0367","200":"Diary_0367","201":"Diary_0367","202":"Diary_0367"},"Date":{"0":"unknown","1":744.0,"2":756.0,"3":757.0,"4":758.0,"5":759.0,"6":760.0,"7":761.0,"8":763.0,"9":764.0,"10":765.0,"11":766.0,"12":767.0,"13":768.0,"14":769.0,"15":770.0,"16":771.0,"17":772.0,"18":773.0,"19":775.0,"20":776.0,"21":777.0,"22":778.0,"23":782.0,"24":783.0,"25":784.0,"26":785.0,"27":786.0,"28":787.0,"29":788.0,"30":789.0,"31":790.0,"32":791.0,"33":792.0,"34":793.0,"35":794.0,"36":795.0,"37":796.0,"38":797.0,"39":798.0,"40":799.0,"41":800.0,"42":801.0,"43":802.0,"44":803.0,"45":806.0,"46":807.0,"47":808.0,"48":809.0,"49":810.0,"50":811.0,"51":812.0,"52":813.0,"53":814.0,"54":815.0,"55":816.0,"56":817.0,"57":818.0,"58":819.0,"59":820.0,"60":821.0,"61":822.0,"62":823.0,"63":824.0,"64":825.0,"65":826.0,"66":827.0,"67":828.0,"68":829.0,"69":830.0,"70":831.0,"71":832.0,"72":833.0,"73":834.0,"74":835.0,"75":836.0,"76":837.0,"77":838.0,"78":839.0,"79":840.0,"80":841.0,"81":842.0,"82":843.0,"83":844.0,"84":845.0,"85":846.0,"86":847.0,"87":848.0,"88":850.0,"89":851.0,"90":852.0,"91":853.0,"92":854.0,"93":855.0,"94":856.0,"95":857.0,"96":858.0,"97":859.0,"98":860.0,"99":861.0,"100":862.0,"101":863.0,"102":864.0,"103":865.0,"104":866.0,"105":867.0,"106":868.0,"107":869.0,"108":870.0,"109":871.0,"110":872.0,"111":873.0,"112":874.0,"113":875.0,"114":876.0,"115":877.0,"116":878.0,"117":879.0,"118":880.0,"119":881.0,"120":882.0,"121":883.0,"122":884.0,"123":889.0,"124":890.0,"125":891.0,"126":892.0,"127":893.0,"128":894.0,"129":895.0,"130":896.0,"131":897.0,"132":898.0,"133":899.0,"134":900.0,"135":901.0,"136":902.0,"137":903.0,"138":904.0,"139":905.0,"140":906.0,"141":910.0,"142":911.0,"143":912.0,"144":913.0,"145":914.0,"146":915.0,"147":916.0,"148":917.0,"149":918.0,"150":919.0,"151":920.0,"152":921.0,"153":922.0,"154":923.0,"155":924.0,"156":925.0,"157":926.0,"158":927.0,"159":928.0,"160":930.0,"161":931.0,"162":932.0,"163":933.0,"164":934.0,"165":935.0,"166":936.0,"167":937.0,"168":938.0,"169":939.0,"170":940.0,"171":941.0,"172":942.0,"173":943.0,"174":944.0,"175":945.0,"176":946.0,"177":947.0,"178":948.0,"179":949.0,"180":951.0,"181":952.0,"182":953.0,"183":954.0,"184":955.0,"185":956.0,"186":957.0,"187":958.0,"188":959.0,"189":960.0,"190":961.0,"191":962.0,"192":963.0,"193":964.0,"194":965.0,"195":966.0,"196":967.0,"197":968.0,"198":969.0,"199":970.0,"200":971.0,"201":972.0,"202":973.0},"Entry":{"0":" \n\nFrom ","1":" to","2":"\n\nDuring this period we were all bustle and excitement with fitting ourselves out with clothing and equipment which took some time plenty of articles not being in stock. Saddles had to be refitted. I had fondly imagined that we were in for a spell after being over on the Peninsular for over 7 months but that thought was soon dispelled however its war now the spell will come later I hope when the Big job is finished. On the morning of the 14th we packed up in full marching order and proceeded by road about 18 miles to the Barrage enroute for our new Camp. Arrived at Barrage about 5 pm. and Camped for the night \n\nThe Barrage is one of the places on the Nile where the water is damed up and made to flow through Great irrigation canals to various parts of the Delta. Each of these great Barrages has 61 lock gates with road way over the top very solidly built\n\nwith drawbridges and towers at each end something after the style of the castles and drawbridges which were famous during the middle ages. The whole of the great Nile here is divided into two portions and barred at each place There are I believe 5 of these great Barrages altogether This one was built by the great Cataract Engineer Sir Malcolm-Scott-Montcrieff at a cost of £460.000. he took in hand after the Egyptian Government had failed to build it.(See Sketch). Beautifully laid out gardens and ornamental trees abound. In the centre is a museum showing in working models the whole of the Irrigation Systems \n","3":"\n\nLeft Barrage at 9.A.M. feeling very much sore after our long and unaccustomed ride yesterday. Very sore indeed. The March was principally along canal banks a very long column the 2nd Regiment leading\n\nWe took to the desert later and a dreary aspect it presented a few low stony ridges with only a few bunches of dried grass here and there \nand what\n 3 or 4 equally dreary and forlorn looking camels grazing about. \n\nSketch of. – \n\n- Barrage - \n \n\nAbout 18 miles from\n\nCAIRO 17.1.1916 \n\n \nW.P.\n)\n\nWe came into this Camp a typical example of an Egyptian desert Camping ground. BENI SALAAM it is called not even marked on the map the nearest place on the line which runs close by is WADAN. We came into Camp about an hour before sundown but as is generally the case where some people don’t know their work, the Camp was not measured out. That had to be done first before we could get into the lines. we were glad to get in and get unburdened. one generally is when one is burdened with the following impedimenta. Bandolier containing 90 rounds of ball ammunition one waist belt with 4 pouches which contain 45 rounds of ball and a bayonet attached one pair of field glasses one prismatic Compass one water bottle (full) one haversack containing a days rations. add to that the contents of pockets and clothing, and a fair idea is given as to the weight and awkwardness of such a load.\n\nThe wind was blowing cold across the LIBYAN DESERT Very cold the first night and I rigged up a sort of breakwind for protection but during the night I had to dismantle the. blanket and put it over me I was fearfully cold I was glad when morning came and with it the warm rays of the sun. So much for the first night in the desert. \n\nJanuary 17th 1916-.\n\nBeen very busy in the horse lines in proper positions and generally running about. The sand here is beautiful and clean and also beautiful and deep, ankle deep in fact and extremely hard to get along in a great strain \nof\n on the leg muscles walking about in it all day and for my part I do no more walking about than is strictly necessary. Everything is covered with sand, it gets into the food which is very annoying and very disagreeable and also injurious. It has its compensations though and its only redeeming feature lies in the fact that it is soft to lie on if that can be called a redeeming feature \n\nJANUARY 18th 1916.\n\nRecommenced signalling practise this morning Nearly all new men and some of them are rather backward at present for lack of proper training and there is also a lack of cohesion They are all in strange surroundings they dont our methods of work and they dont know my methods of training which I might say are severe but after a time I shall have them in good going order I hope and then I shall have no cause for complaint\n\nfor lack of cohesion. They had flag practice before dinner and after wards they had their first experience in telephone work. I had great struggles with them for a start but cannot expect too much as yet. Those men who came back from the Peninsular with me are expert enough Stringer Smith Butler. Inskipp Howard & Balderson. Wilson; Cameron. \n\nMcAllister got killed Lush killed, Jenkinson went away sick Abercrombie got wounded Benton went away sick Wright the same Hanson went to the 15th Batallion Spry got blown to pieces, with an 8'' shell Sinclair dangerously wounded at the same time and place (16 Nov.15) Moss discharged as unfit for further active service through having his foot injured when his horse fell on him at MAADI Camp. about Dec 14th 1914. Nearly all my supernumeries went as well such as Sergeant Curtis wounded. Pte Delpratt wounded. Corpl Frankfort wounded. The names now read Corpl Wilson Corpl Cameron Corpl McDougall Pte Stringer Smith Howard Butler Balderson O’Halloran Inskipp Jones Parrish Appleton. Hogarth; Dorricot Campbell Mather. Clarke Leach Barry.\n\nHave had several showers of rain today not much and I dont think they will do much harm. From the general appearance of the country one would imagine that \n\nsuch a thing as rain would be impossible On the western side of our Camp is a long stretch of low stony hills barely rising 100 feet with a very few patches of dried grass and soft soft sand On the Eastern boundary we have the railway line with about 2 trains per day. and a muddy canal and further over is the River Nile where native boats (felucca) may be seen going up & down these are easily recognisable by their peculiar shaped masts. A great wide belt of land lies parallel with the Canal and the low stony ridge. Altogether one of the most undesirable spots one could imagine white troops to be Camped on. And if it was not for the fact that we are busy with our own individual work. I don’t know how soon we would get Melancholy we have a telephone now installed in the orderly room a totally useless affair because the Brigade office is only about 100 yards away and there is an orderly employed. The telephone has been in position two days and 3 messages have come through so far. Since we came back from the Peninsular the Brigade staff \n\n \n\nhave had \"telephonitis\" terribly bad One time they would not look at a telephone thinking it useless but now it is the very opposite they make too much use of it Not so much on the telephone but it requires a signaller on duty and he is required for other duties.\n\n19th January. 1916.\n\nThe weather for the past few days has been somewhat cold & windy but today Old Sol held sway again and it was a pleasant change. I am sleeping in a tent close to the Regimental Office and besides myself it includes Sergeant Saddler Jim Rafter Trumpeter Sergeant Ferguson Sergeant Nicholson Orderly Room Sergeant and Armourer Sergeant Shand. Poor old Shand we pull his leg shamefully. his number is 1172, a very recent arrival and we say to him that his number has not got dry yet compared to Rafter’s No 6 & my No7 & so on. He does not like it although he takes it in good part. Mail came in to night – 6 bags. I got one from Armourer Sergeant George Drewitt who is very bad with dysentery at St Andrews Hospital Malta. Hope he soon gets well he was always a good sport. I have been having the \n\n \n\nTelephone operator on copying out all the messages in a book from the signal register which has recorded all the messages sent and received during the time we were on the Gallipoli Peninsular He has now been working all-day and he complains about writer’s cramp and he has only got a quarter of the way through as yet. The next one on duty tomorrow will Carry on and complete the job. Reading groups commenced this morning with the new signalling class some of them are real smart shall soon have them in working order I hope. According to todays orders the C.O. complains about the general slackness of all ranks particularly lays stress on the fact that the men do not salute their officers enough poor fellows! We shall never be able to fight in the field if we don’t know how to salute smart enough I am not going out of my way to salute them let \"Mahomet come to the mountain\". The moon is at her fullest to night which reminds me of a verse from Omar Khyyam\n\n\"Ah, moon of my delight who knowst no wane\n\n\"The moon of heaven is shining once again\n\nHow oft hereafter rising shall she look through\n\n\"this same garden after me – in vain!\" \n\nI might\n \n\nI might easily substitute the word\n\n \n\n\"desert\" for the word \"garden\" and I hope that she will \"oft hereafter\" look for me in vain. I am putting on record all the rumours we hear in the course of the day\n\n(1) There are 250.000 Germans & Turks coming across Western Egypt to attack us.\n\n(2) There are 200.000 fresh troops coming to this Camp.\n\n(3) We leave in 3 weeks time for battle in Western Egypt.\n\n(4) The 3rd Light Horse have been in action and have 1 killed & 3 wounded\n\nI have instructions to lay out a course of training for 6 weeks. Lent one Heliograph and Stand to","4":" Regiment who sent out a troop this morning to guard water supplies somewhere further up the Nile and also \nlet\n lent one Heliograph and stand to the Signal troop Have been nearly all afternoon teaching the class field telephone work. Text book like physic I throw to the dogs. Practical experience is what counts and \"grit\" to carry it through The people who wrote the text books never had 7 months of Gallipoli as a guide. If they had; their text books would be worth reading. Bought some mats for the tent to keep us off the sand; cost 18 piastres \n\n \n","5":"\n\nFirst rumour today. They are expecting us back in Australia in the First week in February! Have had to take charge of the mail again I thought I had \"got shut\" of the job. I had the responsibility of looking after the Regiments correspondence for 7 months on the Peninsular and hard work it was too. I had to distribute 5 bags of parcels & papers. Practicing telephone work and Compass work & message sending this afternoon \n\nExtract from Regimental Orders \n\n\"The Army Corps Commander desires \nthat\nthat during the period available to the Corps for recuperating, every effort be made to complete the establishment in both personel and equipment. It is essential that the Corps move off as soon as possible \n\n(Interrupted here the orderly came for the orders and I never got them back)\n\nOrders returned balance follows from the word \"possible\" \n\n\"While orginazation is in progress no effort will be spared to improve training and discipline and to maintain the men in that physical vigour that is essential for the successful conduct of the Campaign \n\n \n\nSir Alexander Godley wishes all Commanding Officers to explain personally to the men that those who become physically unfit by reason of certain diseases will inevitably returned to their Dominion his services thus become lost to the Empire and unnecessary suffering is caused to our people at home who are so heroically supporting our efforts. The Australian and New Zealand Army Corps has attained a reputation in the field of which they may be justly proud and it is hoped that the conduct and bearing of the troops in Camp and City will enhance and not diminish that reputation It is therefore Very necessary to impress upon the men how essential it is that their bearing should be soldier-like and manly in all their dealings. They should observe that rectitude and integrity which is their National pride. From his personal observation during the whole period of our occupation of ANZAC Sir ALEXANDER GODLEY is sure that all officers that served there have observed more than ever the necessity for the maintainance of a very high standard of example and leadership. It was very noticeable\n\n \n\nthat, in units where Officers were most conscious of their responsibilities most scrupulous in the performance of their duties and most assiduous in the care of their men the fighting qualities of the men were most conspicuous and their sick rate the lowest. \n\nIn those units where the officers exert their influence in creating Esprit de.Corps. where the welfare of the men is the officers first consideration and officers pride themselves upon the performance of their duties with punctuality and diligence there is there the greatest efficiency\" \n\n-Special order of the day- \n\nGeneral Headquarters\n\nDated. Dec 28th 15\n\nThe following Most gracious message from His Majesty The King has been received by the Commander-in-Chief Mediterranean Expeditionary Force. \n\n \"Another Christmas finds all the resources of the Empire still engaged in war and I desire to convey on my own behalf and on behalf of the Queen a heart felt Christmas greeting and our Good wishes for the New Year to all who on sea and land are upholding \n\n \n\nthe honour of the British Name. \n\nOfficers and men of the Navy and of the Army, another year is drawing to a close as it began in toil bloodshed, and suffering, and I rejoice to know the goal to which you are striving draws nearer in sight \n\nAnd may God bless you and all Your undertakings\" \n\nStep pyramid at Sakkara the tomb Of King Zoser (third dynasty about 2950bc and one of the oldest monuments in Egypt\n\n- 21st January 1916. -\n\nThings much the same today 10 bags of mail for the regiment we have to put a sentry on the door when the mail is being sorted to keep unauthorised persons out. They don’t seem to realize that \"Everything comes to him who waits\" Everyone get his correspondence in the natural course of events but in cases like\n\n \n\nthis one cant be hard on the poor lads I suppose we are all more or less eager to get some letter etc from those near & dear. The mail never waits to be distributed nothing holds that back. and it is a great nuisance if it happens to come along at night over in the Peninsular I had to distribute it in an open space in the centre of the Camp and it was dangerous work sometimes we were quite exposed to Turkish Shells. I have often had them burst overhead right in the middle of sorting which was rather awkward. The trouble generally was that all hands would be talking at once and calling names and one could never hear the shells coming and consequently one never had any warning before they burst. The shells never seemed to bother the lads so long as they got their letters. Setting up Heliographs today for the first time a lot of the spare mirrors missing which happened when the panniers were conveyed across the water from ANZAC. the boys got among the Heliographs and practically denuded the instruments of mirrors they make beautiful mirrors being of the finest quality glass and very expensive.\n\n \n\nRough Sketch of SUVLA BAY DURING OCCUPATION Redrawn From MEMORY 20\/1\/16\n\n \n\nI take all the Signallers out for a ride before breakfast 23 of us all told. then we practice signalling for the rest of the day. Tomorrow night they are to start lamp practice they wont particularly relish stopping out from 6 to 9p.m. but there is only one word to be thought of now – \n\"Efficiency\"\n\n22.nd","6":"\n\n13 years ago to my regiment the 4th Royal Irish Dragoon Guards marched into our new barracks in Muttra in the Central Provinces – India. Those are far off days. We had just come down from Delhi after being on the Great Delhi Durbar one of the finest spectacular sights ever seen in the worlds history It was the occasion when the Late King Edward Vll was proclaimed Emperor of India. We were on that historic occasion the escort to the Viceroy of India Lord Curzon of Kedleston, Lord Kitchener being the Commander In Chief Yes 13 years ago today!\n\nAh fill the cup what boots it to repeat\n\nHow time is slipping underneath our feet\n\nUnborn tomorrow and dead yesterday\n\n \n\nWhy fret about them if today be sweet. \n\nOmar KHYYÂM. \n\nThe Names of my Signallers are Corporal \n\nWilson \n\nCorpl Cameron \n\nCorpl McDougall \n\nPte Allan \n\nPte Appleton \n\nPte Dorricot \n\nPte Howard \n\nPte Mather \n\nPte Parrish \n\nPte Balderson \n\nPte Butler\n\nPte Barry\n\nPte Campbell\n\nPte Clark\n\nPte Hogarth\n\nPte Inskipp\n\nPte O’Halloran \n\nPte Smith\n\nPte Stringer\n\nThe last named being the only original signaller who started signalling with me in Ennongera Camp at the end of","7":" and has gone through the whole lot with the exception of a short spell due to sickness.\n\nInspection of lines today the Commanding Officer Lt. Colonel T.W. Glasgow. Signalling parade and in fact all parades dismissed \n\nA wet (Liquor) canteen installed in the Sergeants mess today also we dine now at 6pm instead of 5 p.m. The reason being that the various orderly Sergeants never had time to parade their pickets or else they had to bolt the meal which is not conducive to good health at any time and more especially these times when every man must (or should) take a pride in his\n\nphysical efficiency. So these little things always count they are so to speak a means to an end. The sun has been hot today and the sides of the tent are always rolled up to allow fresh air to circulate freely through – another important item. 3 more bags of mail today that is about 14 in about 2 days If that goes on I shall have to open a branch post office of my own and install a staff to cope with the ever increasing Correspondence – And the Colonel told me when I took it over there would only be a mail about once a fortnight but I \"ha ma doots\"\n\nThe other sergeants in this tent are Saddler Sergeant Rafter, Armourer Sergeant Shand Trumpeter Sergeant Ferguson Orderly Room Sergeant Nicholson quite a happy little family. This morning was very cold especially riding out across the desert for exercise. I had on my new Wallaby Skin Waist Coat which is a safe investment and a sure cure against getting cold. I often wish I had it when we had some dreadfully snowy weather on the Peninsular. Thousands of men on that occasion got frost-bitten and I thought – for a couple of day that I was similarly effected but I was lucky. although my feet suffered dreadfully and I had on two pairs of thick socks. \n\nI have been making a few sketches in my sketch book which may come in handy to look at sometime or other if I am lucky enough to get through. \n","8":"\n\nDon’t lose sight of the fact that the Sand (soft sand) is still ankle deep and the calves of my legs are aching from having to wade through it all day \n\nChurch parade today I did not go I had several bags of mail to distribute also registered articles. tried to play football but the sand was too heavy. A very amusing incident happened to night. The armourer Sergt was blowing the bugle and the Trumpeter Sergeant told him it was contrary to regulations However the Armourer kept on with the result the Trumpeter jumped up and \"went for that heathen Chinese\". They clinched and fell on the ground and were locked in each others arms for the space of several seconds which strongly reminded me of two beasts locked in deadly embrace not forgetting - as is usual in such cases to upset everything in the tent I just saved the lamp in the Nick of time or that would have been mixed up in the melee. However they are going to fight it out in the morning (so they say) and I’m to referee. \n\nIt is raining outside and the tent has got quite a good strain on the ropes. Hope they don’t pull out or the pole go through the roof which sometimes happens. Butler went to Hospl yesterday suffering from mumps a most unusual complaint for a soldier to have and I might even say an undignified one. The wind in this place is cold and we are feeling the winter more this year than last year The open desert accounts for it. Last winter we were Camped at Maadi and we were protected to a great extent by the surrounding hills I am writing, lying on my back in bed so this somewhat of a scrawl cant help it – no convenience\n","9":"\n\nI forgot to mention the particulars of the two combatants who are going to \"See it out\" in the morning I shall put them side by side to see the difference\n\nTrumpeter Sergt. \n\nAge (not important) \n\nWeight ","10":" 4. \n\nHeight 5.7","11":" \n\nLength of Reach. 45’’ \n\nArmourer Sergeant\n\nAge (not important)\n\nWeight 13.10\n\nHeight 6.41\/2\n\nLength of Reach 75\"\n\nI don’t know the fistic capabilities of either man but I am rather inclined No! – I must not do that I am the Referee in this case and not a punter & so I have no voice Shall record the result tomorrow. & I only hope it will be worth recording – for the sake of posterity. It will be a great disappointment if it \"fizzles out\" as these I’ll-see-you-in-the-morning-cases generally do. However more anon.\n\nGood Night\n","12":"\n\nAs was naturally to be expected the proposed fight \ndid\n\"fizzle out\" as I had rather expected although the belligerents were in deadly ernest last night. I proposed at Reveillê this morning to saddle two spare horses \nand\n for them to come out with me on exercise All my lads were good sports and they would have thoroughly enjoyed the fun. They both promised to come out and after waiting for about 10 minutes and keeping the horses standing in the cold I had to go out on exercise without them \n\nWhen I got back I had to talk seriously to both of them for making a fool of me. However they didn’t fight\n\nInternal piles have been causing me great trouble lately and I am going to report sick in the morning \n\nIts a hospital job Im afraid I don’t relish the idea at all but better that than continue to suffer which I have done especially during the latter part of my stay on Gallipoli. If we go out on trek and get the usual hard rations the old complaint will assert itself again. Better get the job over & done with. \n\nSignalling all day and sorting mail also mekometer instructions (range finding)\n","13":" 1916.Tuesday.\n\nTerrific sandstorm something awful. No parade today on account of the fearful dust storm. I am fortunate as I possess a pair of motor goggles they are being admired by all ranks \n\nPropose going to town tomorrow and I have the money for 3 pair \"like yours’ \n\nHave been busy today with a great stack of parcels for the regiment and have had to address a full hundred of them back to \"Heliopolis\" Now that word \"Heliopolis\" take scratching several hundred times. The Biblical name for Heliopolis was \"ON\" I would like to know who the joker was responsible for the change of \n\nnomenclature. The old name would have been handy for writing on returned mail. The wind has been blowing very cold all day and now to-night it has become much colder. Heaps of drift sand are banked up against the tents & huts. No wonder cities were buried in this old country. I should imagine that it would not take many centuries to completely bury a city with these sand storms. A memo from Regimental office last night wanted to know how many of the original regiment were left a complete list had to be forwarded by 8.AM.this morning. This has given rise to some extraordinary rumours. Plenty firmly believe we are going back to Australia for a spell Personally I don’t care which way it goes \n\nRumour No1 today a good on I thought.\n\nNo decoration for Gallipoli!\n\nWhat price a row in Australia if one were not given?\n\nRumour No2. Also as good as the last one.\n\nThey are taking the names of all the old hands to arm us with swords!\n\nWhat price some of the poor horse’s ears?\n\nA game \nwas\n of football was played today but the going was extremely heavy in the soft. sand.\n","14":"\n\nWent into town on a dental appointment: The last train leaves Cairo station at 5pm. and I missed it through my watch stopping during the afternoon. I was greatly disappointed. The Booking clerk informed me in true Oriental fashion \"Finish\" Wardan 6 oclock tomorrow morning\"! Here was indeed a contretemps! How to get back? I knew that there was a good road to the Barrage 18 miles but I was not sure about the road from there to Wadan. However I engaged a motorcar from Cairo. We haggled over the price for sometime and eventually I got him to drive me to Wardan about 36 miles for 200 piastres A most exorbitant price it must be admitted but I was anxious not to overstay my leave and not to spoil myself for another time. Away we went to Barrage at a good pace. We got to Barrage safely enough but the (Arbaggie) cabman got the pleasant intelligence from the local police and inhabitants that it would be utterly impossible to do the other 28 kilometers across the soft sand and along the narrow \n\ncanal banks. So after talking it over I had to get back into the car and let him drive me back to Cairo again\n\nI had no particular desire to tramp 28 kilometers to Wadan in the dark. with no revolver in my pocket. I had an automatic revolver but it was in my kit bag in the Camp. So I got back to Cairo about 8.30 pm. and had perforce to engage a room at a hotel which cost me another 25 piastres and another 8 piastres for a \"Chota hazri’ (light breakfast) at 5 AM. I made no mistake about the 6 oclock train. when got back to Camp I handed in the pass and after explaining matters I was let off. but I was sorry that \nI\n should be the first one to miss that fatal 5 oclock train although last night several men missed it and there will be a good many more yet. There is no other way of getting to Wadan if one misses that 5 pm train \n and from\n which I found out at a cost of 228 piastres \n\n27. rd January. 1916.\n","15":" \n\nTraining as usual\n","16":"\n","17":" \n\nSignalling all day and distributed 5 bags of mail. Lamp practice at 6 p.m. for all signallers. Signallers struck of all picquets from today. formed up in front of Regimental office this afternoon and were questioned about a belt which had been lost containing 800 piastres (£8) and some precious stones but as far as I can see no one seems to have come forward with it as yet probably a native picked it up. \"Safe bind safe find\"! \n\nI have just signed a memo from the office which distinctly lays down that on and after the","18":" all shortages of kit and necessaries will be paid for by the soldier who loses or destroys them.\n\nThe articles and prices are as follows÷\n\nBadges (hat) - 6d\n\n\" Collar & - Cap 3d\n\n\" Corps letters - 3d\n\n\" \"AUSTRALIA\" - 3d\n\nBoots pr pair - 12\/- \n\nBreeches M.S. pairs - 15\/-\n\nCap Service dress - 4\/3d\n\nGreatcoat M.S - £1.14.2\n\nHat felt G.P. - 6\/3d\n\nJacket Cardigan - 7\/2d \n\nJacket Service dress - £1-5.0\n\nLaces spare for boots - 8d\n\nLeggings - 10\/-\n\nSpurs - 3\/3d\n\nStraps chin - 8d\n\nKIT NECESSARIES.\n\nBag Kit Universal - 3\/6d\n\nBelts abdominal -","19":" (\"Cholera belts\")\n\nBrush hair - 2.3d\n\n \" Shaving - 5d\n\n \" Tooth - 5d \n\nCap Comforter - 1\/3d\n\nComb - 4d\n\nDisc identity with cord - 1d\n\nDrawers\nper\n pair(2) - 3\/- \n\nDressings Field - 7d\n\nFork. Dinner - 9d (8d?)\n\nHoldall - 8d \n\nHousewife - 1\/-\n\nKnife: Dinner - 9d\n\nKnife. Clasp\n\nwith marlin spike - 2\/0d.\n\nRazor -","20":"\n\nShirts Flannel. (2) - 4\/3d.\n\nSinglets (2) - 4\/1d\n\nSoap (1) - (?)\n\nSock. (3) - 1\/6d\n\nSpoon. (1) - 6d\n\nTowels. (2) - 1\/-.\n\n-EQUIPMENT-\n\nBottles water - 3\/3d\n\nCarriers water bottle - 2\/3d\n\nHaversack - 1\/3d.\n\nSaddlery Universal Sets - £7.10.0!\n\nTins Mess M.S. 1\/9. PTO\n\nStraps Mess tin M.S. - 9d\n\nRugs Horse - 12.6d.\n\nBags. Nose - 3.6.\n\nMuzzles. Sand - 3.3d \n\nSheets ground - 6.9 (?)\n\nBlankets GS. (2) - 4.9d.\n\nBandoliers (50Yds) - 4.9d\n\nBandoliers. (90Yds)\n6\n - 10.9\n\nBelts (waist) - 1.3\n\nPockets Cartridge 15 Yds. (2) - 8 ½\n\nPockets Cartridge 10 Yds (2) - 7d\n\nStraps Greatcoat - 5¼\n\nSigned Alan B. Steele\n\nCaptain & Adjutant \n\n2nd LHR.\n\nSo! That’s good I have have wondering for the last 16 months when this order was coming into vogue. It’s the best thing that possibly could happen. These lads simply waste good material and if they haven’t got anything to go on parade with they simply walk on parade without it and if anything new is given them they simply don’t look after it believing as they do that if an article is not satisfactory they have simply to ask for another By being made to pay for all shortages it will teach them 2 important things one is to take care of their Kit \n\nand the other reason is it will be a saving of public money. They don’t realize one moment that this wonderful nation of ours is pouring out gold like water to the tune of millions \nper day\n\n- 29th Jan Saturday 1916. -\n\nAll parades cancelled to day on account of the Kit inspection I inspected the Signallers belongings and reported their shortages They will be finally fitted out this time for nix but after this they must pay for anything they lose or damage. The 2nd Regt played the first Regiment a game football today and got ignominiously \"whacked\" 11 to NIL. were the scores when the game finished. It didn’t matter much its all a bit of fun & it helps to pass away the spare time and is also beneficial. \n\nMess meeting last night.2 bags of mail today\n\n30th Jan\n\n29th.Jan. Sunday ‘16\n\nSunday all day. Church parade didn’t attend had mail to distribute and all the return mail to mark. and take back. fortunately the post office is quite handy or else I don’t know how I would go on if I had a long tramp through this blessed sand.\n\nAbout..30 boxes of gifts came for the troops today from the Citizens War Chest Fund in Sydney. I got a small parcel containing some useful articles I wish they had enclosed an address in the parcel so that I could write and thank them for their kindness in sending those gifts to us. Brigade orders republished for information which stated that a Sergeant of the Wiltshire regiment was court-martialled \nduring\n the latter period of our stay in Gallipoli for disobeying a direct order given by his superior officer and found guilty and he was shot for the offence on January the 2nd. Rather rotten one must admit but discipline must be maintained at all costs. Far better to have gone on with the order when it was given and got shot by the enemy. Which brings to my mind the old Zulu war Cry.\n\n\"If we go forward we die\n\nIf we go backward we die\n\nBetter go forward and die.\" \n\nWe are having a real paved road made to the Camp from the Railway station at Wadan (about 10 minutes walk) The natives are putting down the stones in the sand and a large\n\nsteam roller is coming along behind and making it level. It will be a great boon\n\nThe latest Rumour! ‘The Sultan’s body guard has (as the soldier expressed it \"reared up\") and the Reserves have refused to come out (Egyptian Reserve) and there is Regiment after regiment in town standing to arms!\n\nNot one of the rumours so far have Materialized. Oh! Rumour thou wert ever a lying jade!! I just put these down to just give some idea of how these rumours do get afloat sometimes and they are believed implicitly by some. And they may prove interesting later. All Kit checked very few shortages and they have all been warned that any further shortages are to be paid for..\n\n-30th January Monday. \n\nDon’t forget the everlasting soft sand. I wish I could say something in praise of it or I wish I could make some use of it. But alas! I’m afraid I cant\n\nThe latest rumour.\nWe are going\n to France in March!\n\nI don’t know about the going to France (this is written later) but the rumour about the Sultan’s bodyguard did (as\n\nthe fellow expressed it \"rear up\". and also some of the Egyptian Reserves which have been called up lately The famous 3rd Brigade (who landed first at Anzac) came on the scene and – well nuf sed! They fired over the heads of the crowd first and when that took no effect they put a few well-directed shots a bit lower and that did the trick a few casualties not many. – was the result.\n\nA Fresh timetable just come by the orderly signaller.\n\nParade 0930\n\nWater and feed on return to Camp.\n\nDinner 1400. (2 oclock)\n\nGroom 1445 (2.45 pm)\n\nStables 1700 (5 pm)\n\nTea 1730. (5.30 pm)\n\nPicquet 1800. (6.pm)\n\nThe Regiment has suddenly gone football mad hence the alteration of times to suit the convenience of football Its no joke playing in soft sand up to the ankles. I had an accident tonight I was going out to see the signallers who have gone out on lamp practice and I fell over a heap of stones which are being put down for a road at the back of the Camp. The light of the Signalling lamp was full on me and \n\nI fell headlong on the sharp stone severely cutting my shin & knee. likewise cutting a hole in my pants. So I came back to the tent. Never mind – worse things happened have happened in Gallipoli any day. Have completed re-writing the records of all messages received and sent on the Peninsular. and they make interesting reading apart from their military worth. The weather was very foggy this morning \nthis morning\n and it was impossible to see more than 100 yards \non\n in any direction. Sent out a signals station (Heliograph) about 4 miles out. The men are improving and soon they will be first class. Phillips of \"C\" Squadron comes on my staff tonight in place of Butler who has gone to hospital- must keep the number up at all costs. I had a long ride this morning across the desert but O! what scenery! Arid barran waste nothing to relieve the monotony. Undulating pebbly, sand hills for countless miles to the West not a bush can grow in such barren waste. About 15 miles to the West is a low range of hills which seem about 30 feet or perhaps a little more high we cannot go too far in that direction on account of roving bands of Bedouin Arabs. and Senussi Arabs who make long treks out from the various oasis to engage our people in battle. We shall go in that\n\ndirection when the proper time comes. We don’t want to \nlook\n.for trouble. \n\nThese Senussi which are pleased to have a war with us at present are a fanatical, religious sect who originated somewhere about the latter half of the 17th Century and have gradually spread throughout Northern Africa and they are now a menace to peaceful people. Anyway let em all come the more Senussi or Bedouin the more sport. I am longing to have a \"go\" just to see how we can fight as a mounted unit, we have proved ourselves beyond doubt on foot and in trench warfare Now let us see how we shall go out in the saddle. I \ndo\nknow one thing and that is: these horses will never stand any firing they are not trained to that\n\n1st February. \nM\nTuesday 1916\n\nBeen in town all day and paid another visit to the dentist may have 3 more visits before the job is completed. It is rather a big job & is costing the small amount of £10. The usual sights & sounds of Cairo – and smells. and so nothing fresh in that direction. The train leaves at 8.25 A.M. & gets to Cairo at about 10 30 AM. and the last train out is 5 p.m. very awkward time. I did \nnot\n\nmiss the train this time. I have \nhad\nthat experience. Nothing like paying for experience and paying dearly. \n\n\"It is only through woe, we are taught\n\nto reflect. And we gather the\n\nhoney of wisdom – Not from flowers\n\n- but thorns!\" Lord Lytton -\n\n2nd Feb. Wed. 1916.\n\nI sent the signallers out this morning on some long distance work. The furthest station went out about 8 miles There was three Helio stations out forming one large triangle about 8 miles apart. This is best because the light from a 5 inch Heliograph is too severe at shorter range. I went out on a long ride myself inspecting the various points. The sentries on the Staff lines last night \"pinched\" 6 out of our 10 nosebags which is too bad I recovered 4 of them this morning in A Squadron lines after much argument. However they are well branded and today Parrish has been employed in putting a wide green band with paint around each nose bags as a sure mark of identification \n\nIf they \"pinch\" them to morrow morning there will be \"something doing\" The regiment goes out every day at 9 30 AM and returns to Camp at about 1.30pm. but to day there was a contretemps the horses of two squadrons stampeded and galloped about 5 miles through soft sand for Camp most of them had their nosebags still on and through galloping and breathing the fine chaff out of the nosebag into their lungs some of them are in a bad way tonight they are bleeding freely through the nose. poor devils. Tonight is very cold there is a gentle Zephyr blowing across the LIBYAN. DESERT.\n","21":"\n\nSent out long distance Signal stations this morning on a large triangle about 20 miles around and later I personally inspected them. A good deal of practical work is still necessary yet before they can be considered fit. They must have some more short distance work yet. The weather this evening is cold with a very cold wind and one must wrap up.\n\nLamp practice tonight from 6.30 to 8.pm.Plenty of practice is required yet. although the majority of messages went through rapidly and accurately. I go to town tomorrow to pay another visit to the dentist. I shall be glad in a\/way when the job is finished although as things are it furnishes me with an excellent excuse. \"Pharoah\" my horse was very lively and headstrong this morning although I took him for a long ride and I also went on a much longer ride yesterday. He improves with hard work I think. Much better to have a horse with some life in him than to be mounted on some wooden horse where one is continually \"legging\" them up. So \"Pharaoh\" and I get on remarkably well in that respect. Wilson had him for months before I got him but he was always bolting with him and he never seemed to be capable of holding him. I have no trouble We now have our \nown \ncanteen which is opened in our own Camp the nearest one before was at Wardan Station, and quite 10 minutes walk through the soft sand. Sgt Bruce paid us a visit from Heliopolis he went back this morning also Sgt McLennon from Alexandria he also went back. \n\n4th February Friday 1916.\n\nAnother long & tedious journey by train to Cairo on the dental job. He put the bridge into position and partly finished the job. I am to go on Wednesday. Town very quiet only the usual sights & sounds! - and smells! Caught a slight chill coming out in the train but not serious\n\n5th Feb. Saturday 1916.\n\nI have just finished reading a very interesting book. called the \"Kangaroo Marines\" by an Army Captain which gives a good idea of how things have been going with us from the time we joined in Australia until we were all finally established in the trenches on Gallipoli (something wrong with this rotten pen I think) \n\nSports today and it is raining too quite an unusual occurrance for this benighted hole.\n\n6th February Sunday 1916\n\nChurch parade this morning weather good today. Big program of sports were gone through yesterday \n\nNothing to Report. \n\n7th February Monday 1916.\n\nThings the same each day I am going to have hard work to make this dairy interesting for the next 6 weeks at least.\n\nCorpl Cameron\t\t\n\nPte Hogarth\n\n \" Allan\n\n \" Appleton\n\n \" Howard\n\n \" Inskipp\n\n \" Phillips\n\nhave gone away to Tireah this morning to relieve Corpl Trail of the 1st Light Horse Signallers. who \nare\nhave been forming a Signal Station from the 3rd Light Horse Regiment at BIR HOOKAH in Western Egypt. I have had to hand nearly all my signalling equipment to Sergeant W Nelson the Signalling Sergeant of the 1st Light Horse to complete them. This was the cause of it. The 3rd Light Regiment Had their signal gear blown to pieces by one of the Goeben’s shells (pity the lot didn’t share a similar fate!) Then; months after when we evacuated the Peninsular the 3rd L H Regt came back to Egypt and prepared straightaway to go out again to Western Egypt. In doing so they commandeered the whole of the 4th Light Horse Signal Equipment.\n\n ‘Just finished reading \" The Big Bow Mystery\" by Israel Langwill. very interesting’\n\nNow the 1st regiment takes all my gear as they leave soon for an unknown destination. Went for a ride this morning: \"Pharoah\" was in a very bad humour I could scarcely manage him he tried all sorts of tricks to dislodge me and several times almost succeeded I took him for a long gallop out in the desert but it didn’t seem to quieten him He is not getting enough exercise and too much feed. He is generally so good as a rule. Must have contracted bad habits somewhere. More work. \"Pharoah\"! Lamp practice tonight we only had two lamps to do it on. Have requisitioned to night for a complete outfit. Might be weeks before we get it. All sorts of things happen these times Requisition after requisition goes in for stores Etc but nothing ever comes of it. The reason being that, at the present time there is such a power of troops in Egypt and they all want to be supplied. So our regiment is a very small item indeed.\n\nOne signaller only now is required at the telephone The Squadrons are to supply two men to do the messenger work. That releases two signallers for training. I am also to have one man from each Squadron to be trained as supernumeries. They will be \n\nfound invaluable which I have proved by past experience. I started for the Peninsular last May with a full Complement of Signallers and besides that I had 14 Supernumeries I used nearly all my own men and nearly the whole of the 14 men were requisitioned. When I got back to Egypt I only had Wilson Stringer and Inskipp of the original men who went with me to Gallipoli. All the others were either killed, wounded, or sick – all casualties- Such is war. One xtra man from each Squadron is not much of course but I cannot have more on account of extra duties which will be imposed upon the 2nd Regt as soon as the","22":" Regt goes. \n","23":"\n\nThe trumpeters who live close to us made hell’s own row last night long past \" lights out\" The must \"Cut that out\" as soon as they like.. Later: The trumpeters have \"cut it out\" So to speak. Butler returned from Hospl today and by a strange co-incidence Parrish went into hospital with the same complaint as Butler – mumps! \n","24":"\n\nI went to town this morning on another dental appointment very near the finish of it now. only (Man proposes Etc!","25":" \n","26":"\n\nMinia Camp.\n\nOver 100 miles up the Nile from Cairo\n\nThe old adage \"Here today and gone tomorrow\" is very true and verily with us lately it has been well proved.\n\nWe had made a very nice comfortable Camp for ourselves at Beni Salaam and with the exception of the soft sand we were very well off & did not feel inclined to shift in a hurry. But \" the best laid plans of mice & men\" Etc as Burns says is also true for lo & behold on Sunday morning I was awakened before Reveille and told to put a messenger and one signaller for telephone duty\n","27":"\n\nReceived from Sig Sergt \n\n2nd. L.H.R. \n\nOne Heliograph &Stand \n\nComplete. 1657.\n\nStand No. 2165.\n\n W Peterson.\n","28":"\n\n Received from Sig Sergt one Heliograph & Stand Complete. No.1640 & 116.3. \n\n R S. Farmer \n\n Sgt Maj\n\n 1st Sig Troop\n\n","29":"\n\nAt the Regimental office. I was surprised at this because in the ordinary course of events these men do not go duty for a good while after Reveillê. The Orderly Room was buzzing so to speak with excitement \"We were going away\" We were going into action\"! We were going up the Nile\" We were going down the Nile\" Etc. Etc. The usual wild rumours. However at about 9 am. the 1st Light Horse Regiment mounted in full marching order and went to the Railway station, entrained and were sent off to an unknown destination We packed up however & struck all tents Oh what a fly around! We never expected to leave for at least 6 weeks. The transport was going all day carting all our gear to the station and part of the night. At about 10 pm at night the staff saddled up and prepared to move off to the station \n\nSome of the squadron had gone to the station and some were still to go. However we got to Wardan Station only about 10 minutes ride and sat on the side of the road. Three men of mine had been previously told off as baggage guard which left 3 & myself with 7 horses. When we got to the station 2 more were told to go & guard some stores leaving one now & I to hold the horses I have, in the course of some of my career experienced some rough nights & some particularly cold one but I have not put in such a night as I did then, for years.\n\nWe were just on the edge of the Libyan Desert and the wind during the night was very cold and I remember I had 3 horses to hold and the poor beasts got restless with the cold and we just laid down by the side of the road. Sleep was almost impossible\n\nThe noise of men loading horses & stores and wagons rumbling along the hard road and the horses being restless and the cold wind blowing. It was a night to be remembered. However the longest night must have a dawning & so with this one. Daylight came at last and soon after an empty train came in from Cairo and then for the space of about one solid hour All hands set to work and loaded all the horses and got our stores on board. I was glad to get into a carriage where I could take of some of the equipment which is always a great weight and terribly inconvenient at all times. Imagine a bandolier of 90 rounds of ball ammunition which in itself weighs about 20lbs. A water bottle full of water, a waist belt with bayonet and 4 pouches containing 60 rounds, a pair of field glasses and a prismatic Compass. All these things fit tight and it is a relief to get them off I always get pains in the Shoulders through having my equipment on too long. However we got into a carriage at last and about 7.30 AM. we moved off and for several hours there was a complete blank in my existance\n\nI woke up and found we were still going along the rails and promptly went to sleep again. We got into Minia a good sized town a long way down the Nile. at 4 p.m where we all got out. When we were getting the horses out poor old \"Pharoah\" my good old horse had allowed the saddle to come round underneath the buckle of the surcingle and girth were right on the poor old boys back but he never moved he stood it all and he had been getting an awful time with the horse on either side pushing and shoving him about in the crowded horse box. I felt sorry for him but I soon rectified matters when I got him out. Another horse would have kicked the saddle and all the gear to pieces. But old \"Pharoah\" is one of the best. he can always be depended upon at all times. I think thats a good testimonial for him. We got into Camp and made fast for the night. Things rough and ready for the first night as is always the case. Slept alongside the saddle last night but I had my blankets and waterproof sheet so I did not do too bad. \n\nThis morning and during the day we have been pitching tents\n\nand putting the finishing touches to the Camp and getting our belongings collected. Some have lost saddles some have lost blankets Etc Some again have made up a few deficiencies which is always the case and so the merry old world still wags on! \n\nTwo troops and our Machine Gun section went out this afternoon on patrol duty to two villages about 10 miles away They are out for an indifinate period. we have got the Royal Flying Corps attached to us. And to day about 2pm two of their great aeroplanes came down from Cairo and volplaned and settled just close to the horse lines we had to Stand to our horses when they came down. They scared the life out of the horses when they swooped down just over their heads scarcely 50 feet up in the air. A magnificent sight to see them landing\n\nHave been in communication with Captain Downing this afternoon with reference to establishing communications between our two outposts and the main Camp here. Both by telephone and by Heliograph & Lamp. There will be no chance now for more training All training I think must cease and the actual active service work commence.\n\nThe latest rumour is that there is every possibility of having a \"go\" at these Senussi or Bedouin Arabs or who’ever they are. I hope it is soon its all good experience. We are well versed in modern trench warfare. Now let us have a go at the mounted work. \"Ready aye Ready\" is our watchword. I am having the tent to myself tonight the saddler Sergeant and the Trumpeter sergt and the Armourer sergt have gone out into town. By the way the Trumpeter sergeant has not left any of the trumpeters in Camp to sound the Calls and the powers that be are making diligent enquiries \"Why\"? The sergeant Trumpeter will have to answer to these things tomorrow. \"Duty first\"!\n","30":" Wed.1916. Minia -\n\n\"Awake! for morning in the bowl of night, has cast the stone which put the stars to flight\"!\n\nAwake at 6 A.M. nearly dark & somewhat cold. I have no particular desire to leave the warm blankets but simply must. I am always the first one to wake.. And each morning\n\nthe same thing happens. I am the first out of the tent. The Saddler Sergeant follows then the trumpeter Sergeant and last comes the Armourer Sergeant Nicholson the Orderly Room Sergeant does not get out until about 7.A.M. \n\nHave been delayed for a long while to night before writing in the diary have been having a long discussion about Certain incidents of trench warfare over in Gallipoli. passed quite an interesting time. Sorted thousands of letters today the biggest lot of letters I have had to distribute for months. It took about 3 hours to go through. My work comes in readdressing it all when it comes back again from the Squadrons which is a hard and tedious business. I am supposed to know where each man has gone to. The total amount of men of the Regiment who have mail sent to them must be about 1,500 and the total strength of the Regiment is about 500 the remainder are killed wounded sick away on different duties Etc Etc. Some of them I have not seen nor have they been near the Regiment for many months bur their correspondence comes through just the same. I have tried hard to get rid of the job but its \"no go\". On account of being so far from Cairo I have not been able to get near to the Dentist who has half \n\nfinished my teeth. That’s distinctly awkward because I have paid £10 to get the job done and as things stand at present the main job is not finished yet. However I have heard today that there is a good dentist in Minia who is good at his work and I have made out a pass to go into town tomorrow and see what he is like. I hope he can do the job for me. If not I am in an awkward fix indeed the hole in my tooth gets bigger and nearer the gums and it has just taken a fit to ache occasionally & thats no good on active service.\n\nThe trumpeter sergeant has just gone out to blow \"Last Post\" 9.30pm and I thank that will do for tonight\n","31":" 17th Minia.\n\nTwo troops and the Machine Gun Sections have gone out on outpost duty to a couple of the surrounding villages and we are to be connected by telephone and heliograph. Later – News of a rather startling nature has just come to hand – We shift tomorrow! Where? Why? Who? Those are the questions uppermost in all minds and the everlasting answer is \"Don’t know\"! ‘Wait & see’ so to speak.\n\nAlways the way and always will be the way. As soon as we get nicely fixed up in a Camp we suddenly get a sudden move, we must be prepared for such things. I had gone to town and fortunately found a good dentist – a rare thing in such a purely Oriental town and paid him 100 piastres deposit to get on with that tooth of mine. (I have already paid £10.5.2.) (10 Egyptian pounds).The dentist cleaned it out and I was to go to him tomorrow and after a couple of days the job would be completed and my happiness complete. But \nnow\n!\n\n10.pm. The troop and 7 of my signallers who were away in western Egypt came back I am very glad of that because they will be all together.\n","32":" 1916.. El Minia\n\n \"No more Sergeants Mess. Back to the old Peninsular Routine!\"\n\nGreat preparations for a hurried departure Baggage being loaded by the ton Some of the men are to stay & guard the Standing Camp while the regiment goes out. A Squadron goes North B Squadron goes South and the remainder goes East. Aeroplanes making daily air reconnaissances dont know what reports they are bringing in but we are moving, probably, in consequence of some information they have obtained. Head Quarters leave EL Minia at about 12 noon. \n\nOur Peninsula Experience will stand us in good stead from now on. No Officers Mess and no Sergeants. Well we can’t complain we had comfort as long as it was possible & the Officers the same Now when the stern necessity faces us we are all quite willing to forego any comforts and \"pig it\" along with the men. And we shall be no worse for it. I have just been ladling out instructions by the yard to the Signalling Corporals of each Squadron about what to do when \nwe\n they get into their various Camps. Brigade Head Quarters and the Signal Troop do not move from EL Minia \n\n9 oclock Same night \n\nI am writing this by the light of the full moon the writing is not as small nor as neat as that written during the day but I believe quite understood nevertheless We arrived here near a small Arab village close to one of the big irrigation canals which run \"every which way\" as Mark Twain\n\nsays. Quite a good supply of fresh water but this, as well as any Nile water is totally unfit for a white man to drink and bathing in the water is strictly forbidden on account of some disease which it contains known locally as BILHASIA. The effect of this disease is much dreaded although the Arabs drink nothing else and bathe in it ad lib.\n\nWe have a Signal station on the banks of the Canal close to the Camp and we have been in touch with head Quarters back at the Town of EL Minia. The name of this village is Tukh-El-Kheil! and, as they generally are typically Arab.\n\nThe Brigade Head Qrtrs signal station is located on top of one of the flat topped buildings in the Town about 8 miles away from where we are One Squadron has gone about 10 miles up the Canal and the other one has gone a corresponding distance down stream. Up to now we are the only ones in communication. I have to go out on a long ride tomorrow to see how things are going with the other two posts.\n\nThe barking of the native’s dogs and the Arab yelling & shouting can be heard for miles around. \n\nThey are a noisy & dirty lot although very industrious They go to work very early in the mornings and return always after sundown.\n","33":"\n\nCamp. Tukh-El-Kheil.\n\nWent out to A Squadron at BENI.SAMRAG.about 8 miles up the canal rather an awkward place to find. \n\nThey have an ideal Camp there right in the centre of a clump of date-palm trees The whole Squadron are completely undercover impossible for an aeroplane to locate. Not much chance of that but one never knows what is going to happen in modern warfare \"Pharoah\" as usual became awkward and when I led him up to the top of a rather steep place he started screwing around with the result that he dropped both hind legs over the edge of a steep bank. and hung there looking ridiculous he could not get up again & so the only thing to do was let his head go and let him fall which I did poor old fellow he went over with a great splash in the\n\nmud and water. When he got up on his legs again he was in a fine state of mud – slimy Nile mud!\n\nI had to set to work and wash him down before I could into the saddle and when I got back to Camp I had to put in about half an hours work and scrub the mud off him. Long distance for lamp reading they (the Signal Troop signallers) are a poor lot of readers and we have great difficulty in getting a message through by lamp although we do not have much trouble by day with the Heliograph.\n\n20\n","34":"\n\nSent two men to Beni Samrag with a telephone and two reels of wire for \"A\" Squadron and I went to Nazlet-El-Abid myself with a telephone & wire I had great work getting one of the coils along - it fell off about 6 times. once into the Canal and I had to give an Arab a piastre to fish it out again. \n\nLater. We now have a telephone in the Camp and consequently visual signalling will be a secondary consideration It is an Ericcson Long distance\n\nmicrophone - a proper Voice phone. And a good one too. \n\nPatrols go out all day and night on the edge of the desert also the Aeroplane goes west daily but as far as the patrols are concerned there is nothing to report.\n\nI slept on top of the Signalling panniers last night and I woke at 5 with a chronic pain in my hip so much so that I could not go to sleep again. I had a long ride today but \"Pharoah\" did not fall into the water. In this place the Arab children come to the side of the road and follow one for miles with an armful of \"burseen\" (green Lucerne) for the horse. And, having given the horse some, they clamour for the everlasting \"Backsheesh\" That word has a magical effect. They expect \"Backsheesh\" for every thing they do. If they only hold your horse for one minute or if they dip a bucket of water or pick up anything in the road, they invariably ask for \"Backsheesh\" They are a regular pest. And to make matters worse they are never satisfied\n\n20th Feb 1916\n\nSunday all day. Cloudy and rather inclined to rain especially tonight I went into EL Minia this morning in the Regimental motor Car which has come down from Cairo the other day. Went to the dentist he took an impression of my mouth. Tomorrow I am going to town again and that will be the last visit. Thank goodness The job has cost a good deal of time and money when the job is finished it will have cost 12 pounds and those are Egyptian pounds Not English ones. I have been taking down some Arab phrases which will prove invaluable out here on the fringe of the desert because these Arabs don’t understand one word of English. I got these phrases from a Russian boy who is a clerk at a spinning mill & who can speak Six languages. All the Europeans in this country must be\n\nable to speak about 4 languages fluently otherwise they will never get a chance of employment. They must be capable of speaking English French Greek and Arabic and some are able to speak Russian Italian & Turkish. This country is the most cosmopolitan country in the whole world. The French and Arabic languages predominate.\n\nThe telephone we have here is connected directly with the main telephone exchange in the town and they switch us off to where we want to speak. but Great Scott! talk about a Babel of voices! About seven languages at the same time coming through and we have to pick the English out of that. Those arabs speak at a fearful rate. I would defy any short hand writer to follow them no matter how experienced especially when they are having a heated discussion or a row. The flow of language on such occasions is simply astonishing. Greek is to my ears a most frightfully discordant language and fearfully fast. English is the slowest of the lot very slow in comparison with the others. German which is also spoken and understood here is slow as is also Russian. The fastest & most voluable languages are 1st Arabic. 2nd Turkish 3rd Greek. \n\nSome sweeping changes are taking place in the Regiment. Colonel Glasgow the Commanding Officer is going away to a higher command he certainly has proved his worth on the Peninsular as a good soldier and a born leader of men. We are all glad in a way to see him go up the ladder of fame but very sorry to think he is going away from the Regiment. From now on it will be a totally different 2nd Light Horse Regiment from the old original one. Our Regimental Sergeant Major MY Wasson. a magnificent type of soldier and a most highly principled man has now got the Star and he becomes a second Lieutenant we have no one in the Regiment to fill his place no one fit to take the position and in him going away we have sustained a serious loss\n\n-","35":" –\n\nI went into town this morning on my final visit to the dentist Thank goodness! That’s finished after messing about for weeks and at a cost of nearly 2000 piastres The dental job in itself cost 10.5.2 (£10 Egyptian pounds) in Cairo Then I went to Minia and Train fares from Wardan to Cairo. & cabfares\n\nfrom station to dentist & Lunches & cab fares back to Station again and then Railway journey 14 piastres each way. The Egyptian Government are out like the rest of the country to make money out of the \"Rich Australian Soldiers\" and they do not issue return tickets and the last visit here to the dentist it cost 40 piastres for a Cab back to the village where we are Camped. Yes I can truthfully say that that dental expedition put me very near 2000 piastres out of pocket. Never mind the job is finished now and when I come to weigh things up I am rather pleased to think that I have now got sound teeth to masticate food with – such an important item to a soldier on active service and I do not regret having spent such a large amount of money. \n\nIt was market day to day and thousands of natives thronged the road leading to town and a large yard which is the Market Square on the outskirts of the village was packed. All sorts of things were there for barter fowls geese Turkeys Cattle sugar cane Etc Etc. and such a merry crowd of happy go lucky natives in all sorts of costumes made a picture never seen nor conceived in the Occidental world. \n\nI speculated 30 piastres today on purchasing \nan\n a quilt made of pure wool quite a comfortable affair Am giving it a trial tonight for the first time. We are now connected up with all our outposts by telephone they save a good deal of trouble. I have been neglecting to write to anyone lately the principal reason being that I am far too busy with my work. and another reason is that I am putting in a good deal of spare time writing up this diary and making it as interesting as I possibly can which is very hard work. and I am not gifted in that art. During some of my travels on Foreign Service either in India or South Africa I have kept a diary and I always found it hard work to keep it up day by day especially when we were kept busy as generally happens when a Cavalry Regiment get out on Camp or Manoeuvres.\n\nBalderson returned from Nazlet-El-Abid where he has been in charge of \"B\" Squadron Signallers during the temporary absence of Corporal McDougall.\n\n- 22nd Feb. - Tuesday 1916 -\n\nLovely Sunshiny day. did nothing all day particular. Wrote some letters Nearly time too by the way \n\n \n\nI have received them weeks ago and only thought of answering now Anyhow I don’t get them myself too regularly so the people at the other end must not Complain too much Have been reading \"The \nMale\n Imperial Malefactor\" quite good reading its mostly about that wicked Kaiser Bill of Berlin quite a good deal has been written about him during the last 18 months\n\nNothing to report. The whole front is safe and quiet so far\n\nThe Regiment is split up in pieces A Squadron is at HASSAN PASHA about 10 miles up the line B Squadron is at Naslet-El-Abid C Squadron and Regimental Head Quarters are at Tukh-El-Kheil one troop of C Squadron is back at EL-Minia. We are of course in constant touch by Heliograph Lamp and telephone. The mail for the regiment has a good journey. It comes to me at Head Quarters first I take out all mail for us and send it back to town to be sent out to A Squadron then it comes back to EL Minia And sent out to B Squadron then back to EL-Minia Then the various details in there take what belongs to them and then it goes back to the Brigade PO. and from there to Cairo for other details. \n \n\n9 pm tonight\n\nLamp message just come in from Right flank States that Camel patrol is two hours overdue. What does it portend?\n","36":"\n\nWent with some of my Signallers on a visit to B Squadron at Naslet-El-Abid took some letters over also a prismatic Compass for Captain Shanahan.\n\nSergeant Shand the Armourer Sergeant got reduced to the ranks this morning for not complying with an order given by a superior officer. Lieut Colonel T.W. Glasgow D.S.O. our late Commanding Officer left us today take over his new command He gets made a full Colonel with the Brevet Rank of Brigadier General Good luck to him We all wish him luck And our new Commanding Officer Major Barlow takes over the Regiment Let us hope he \n\nwill prove himself as Colonel Glasgow has done. Personally I have every confidence in him, he comes here with a good record. We have got an interpreter with us and he is rather a valuable person. I have been learning Arabic from him & I hope to soon make good progress. The language question is a great stumbling block here and one is completely lost without a knowledge of a few phrases. \n\nAll the Officers and men of the 11th Light Horse Regiment have orders to night to go back to Cairo tomorrow to rejoin and reform the","37":" Regiment No more has been heard of the patrol which was reported overdue last night\n\nTwo of Lord Lovat’s scouts are attached to Head Quarters here for scouting work And they ride the Signallers horses. One of them was leading his horse over the canal bridge (a very narrow one) when the horse overbalanced and fell into the deep canal with the result that he had to come back and change his saddle. Great sport watching the natives driving their cattle over this narrow bridge at night Some of \n\nthem generally manage to fall in I saw a great unwieldy water buffalo fall in the deep part to night with a great splash. But he; being a water buffalo, he didnt mind the ducking being quite at home in the water. \n\nVarious patrols report all clear.\n","38":" ‘16\n\nLost my fountain pen somewhere must have dropped it in the grass somewhere around where I sleep A.A.A. I never left Camp today took a day off as it were. I am generally kept busy with long rides from Headquarters to either of the Squadrons Tomorrow I go to EL Minia to see if I can find that telephone of ours which was lost in transit between Wardan and El Minia. Am starting to read a very old book called Valentine VOX I read it many years ago but have almost forgotten about it. I am getting along with my Arabic famously with the help of the interpreter. Some horse bit \"Pharoah\" on the back last night not serious though I hope he had his own back – he generally does have his own\n\nback. He doesn’t allow these indignities to go unpunished although he is a most docile and loveable creature. I am very fond of him. He is a very good horse in every way. Many a time when I was on Gallipoli and \"humping\" my pack from place to place , climbing steep hills and heavily burdened and pestered with heat and flies – my thoughts would go back to Heliopolis and I would wonder where my old \"Pharoah\" was and how he was getting along. and wishing he were with me to carry my pack for me. I always liked him before I went to the front but since we came back I have had the greatest respect for him. I never make him carry too much I know what it is myself – It is only 7 oclock pm but I am wrapped up in my blankets on the ground writing this. The telephone is only about 2 yards away and occasionally the bell rings and the signaller takes a message or probably sends one to various destinations. This is what I hear during the night Hello \"Is that the exchange? It Is? Well put me on to Hassan Pasha please\" Whats that? – Yes – Hassan Pasha! – NO Hassan Pasha \n\n\"Dam those\" \"niggers\" Hassan Basha!! \"- whats that? Hassan Pasha Engaged? Righto! Give us a ring when they are disengaged\" \n\nHello Exchange! Is that Exchange Oh \"Imshee\" off the – line you (This to some inquisitive native) Hello Exchange! Put me on to Naslet-El-Abid please! (pause) Hello is that Naslet-El-Abid? Good! take this message will you please? Message proceeds I get used to it and never notice the noise \n\nIt goes on all night and day\n\nThere is also a signal station in the Canal bank about 4 yards away where we have a Heliograph working. during the day and a Signalling lamp for night work The key on the lamp makes a great rattle but it does not disturb me in the least. The only time I get disturbed is when – during the night -the Signaller on duty wakes me up because something has gone wrong with the communications\n","39":"\n\nTURKH EL KHEIL.\n\nCold wind blowing all day and \n\nI went with some of my men for a ride out to one of the outlying stations about 8 miles. Hogarth of the 11th Light Horse has gone back to rejoin his regiment which is reforming at Heliopolis. He was sorry to leave us but it was General Birdwood’s order, or rather promise to the Regiment that if they were ever reformed again they would get all their men back again. Some of them had made themselves here at home here with us and were genuinely sorry to have to go back to an unsettled state which certainly will exist for quite a long while until the regiment gets properly settled down. Hogarth was one of my smartest men and I am sorry to lose him. I shall have to replace him.\n\nThe two signallers who are on duty on the phone are sitting in the dark just close to me waiting for a call one is munching chocolate and the other is sitting \"mum\" I wonder where their thoughts are now! Three men who took signal officers of the","40":" Regt into town apparently got \"full\" they should have returned early today but failed to do so. It is now 9 30 pm and the sergeant of the picquet\n\njust informed me that one of the horses has just come home of his own accord with the saddle and bridle on. One could afford to laugh at such occurrences in civil life but here it is a serious matter. When these gentlemen are eventually rounded up it will spell trouble in capitals for them. Well – as you sow so you reap\" – the saying goes. The air is very cold tonight and all blankets are necessary. The telephone pole near me is humming away in good style and the dogs in the neighbouring villages are making a great noise \n\nThe Signallers are just calling up El Minia on the lamp to inform them that all is OK here which they do each hour\n\nBon Jour!\n","41":"\n\nDid not go out today. Some new clothes arrived today from the Base Riding britches & boots. The men have been walking about for months \nago\n practically in rags we have had no riding breeches since\n\ncoming off the Peninsular last December. Boots have been rather well worn too. Butler is temporarily transferred to A Squadron for Signalling duty Vic Hogarth returned to his original Regiment at Cairo.\n\nSergeant Nicholson has gone too he went to El Minia to day he is going to TEL-EL-KABIR. to become an officer with the 13th Infantry Brigade where Colonel Glasgow has gone Our Quarter Master Lieut Hockey went to town (El Minia) this morning per motor ambulance to hospital. O’Halloran one of my Signallers will go tomorrow. Found my fountain pen again. \"That which was lost - is found!\" \n","42":"\n\nHave had a rather peaceful day today. Been reading \"The Missing Welora\" by Philips Oppenheim. This military life makes us great readers. Since I came here in this army I have read hundreds of pounds worth of books and papers but generally get the best of them goodness alone knows where they come from but we get them. On an average get through at least 2 books per week. We (The sergeants) are living better here out in the desert than we ever did at Cairo where we were close to all the big shops. The reason \n\nbeing that when the whole of the Sergeants are together (42) they leave all the catering arrangements in the hands of one man. and no one else had a voice in suggesting things at least that is the understood arrangement. Here, there is only 18 of us and we all more or less put a word in and we change the caterer each week We have been having turkeys \nnearly\nevery day and eggs galore and various other items which help to make us happy. We spend a deal of money in doing so but we have nothing else to spend it on so we do the next best thing and get something good to eat. \"If not; why not?\" O'Halloran went to Hospital today and King and Hewitt have been telegraphed for to rejoin from Heliopolis They will not relish being taken away from a nice Camp like Heliopolis and pleasant surroundings and come up the Nile into this God forsaken place but such is the order. A Squadron at Hassan Pasha have now got the telephone installed in the Camp. Before; they had the use of the OMDAH’s (Mayors) telephone in the centre of a village about ¾ of a mile away and the result can well be imagined when anyone was required on the telephone. The weather is very cloudy to night and a strong \n\nwind is blowing The lamp has gone out about 3 times already. I have been amusing myself today in sketching some of the places at Anzac which I can easily draw from Memory. \n","43":"\n\nCamp TUKH –EL KHEIL.\n\nNothing exciting to report.\n","44":"\n\nThe 575th day of the War! How tempus does fugit to be sure! I have a vague presentiment that it is the beginning of the end now Some more frightful slaughter I suppose. yet. - Round the cookhouse reminds one of a poultry farm. I saw 4 geese and several Turkeys tethered by the leg with a piece of string to the wheel of the water cart. The sergeants are having two to morrow so that is something to look forward to. These Arabs which infect this place are a regular pest they are always clamouring for the everlasting \"backsheesh\" They demand it on the slightest pretext They get all along the Canal bank and jabber like a pack of monkeys Impossible to sleep nor read or even\n\nhear a word spoken on the telephone. In vain clods of hard mud are pelted after them In vain. I say \"Rukh men henna!\" (Clear out!) I hit upon a good adage this after noon I told several of them. (my men) to catch one of the dirty little arabs and throw him into the Canal which they did The other \"Nigs\" standing around created a great outcry but when the Arab had come out of the water he went for dear life and the others with him. It has had a salutary effect. We tried to catch more of them but nothing short of a horse could catch them. \n\nDistributed 10 bags of mail today Mail day here is more important than pay-day much more important\n","45":"\n\nThe only item of much consequence to day was that there has been some heavy fighting in Western Egypt Some heavy casualties were sustained on either side I dont know more details The troops in at El Minia are standing to arms there that is only 8 miles and what strikes me as serious is the fact the we are not standing to arms \n\nAnd we are 8 miles \nIN FRONT\n of the troops at Minnia. If anything happens \nwe\n are the very first troops to be engaged I rather fancy it is what the Colonial calls a \"Mulga\". They are making up a lot of new batallions and they are asking for experienced Signallers to apply for Commissions I have made an application for one but with what success I cannot at present say I go to town tomorrow and interview Captain Downing the Brigade Signalling Officer. \n\nI think I am the only one from the Regiment. I don’t place too much faith in it for one reason is that I have been with this regiment since it was formed in","46":" and I have gone through 7 months and 7 days of Gallipoli with it. But if there will not be too much bother about and there is a chance of getting a step higher – well I’ll take it. I don’t want it because I want to get out of the regiment I belong to a Regiment which has distinguished itself & I may go to a Regiment which has (up to now) done nothing and I don’t particularly relish the idea Still wait & see!\n\n10.30 pm Telephone bell rang violently adjutant sent for – out of bed – wanted\n\n \n\nBrigade Major back at El Minia & he is solemn conclave. All I can hear is Yes Sir! Yes Sir! No Sir! No Sir! Yes Sir! Something doing!\n\n11pm. Motor Cyclist just dashed up from Head Quarters with important dispatch He gave me the word in passing \"Moving tomorrow\"! That’s all – he’s gone! Been expecting it for some time. I thought we had been too long in one place However it wont disturb my sleep.– here goes –\n\n2nd March\n\nAwake at 5.30 AM. Find on enquiring that C Squadron Only is going out at 10 A.M in full marching order bound for an unknown destination! Oh! that unknown destination! Head Quarters remain here for the present any way.\n\n4pm. Just returned from Town and still find ‘C’ Squadron Standing to arms – saddled up and ready to move out The order has been temporarily countermanded don’t know why They are standing to arms to night and prepared to move at short notice. Saw Captain Downeying today but he can give no information about Commissions as he has not been officially informed about them himself. Two from this regiment have been approved I have heard indirectly\n\nMade arrangements for having an \"Egyptian Mail\" sent out daily from Minia. We never get any news here at all about things which happen in Egypt. The weather has been very hot today and it was warm work riding to town\n\nThe Corporal in charge of the 9 oclock \"feed up’ party has just come along with the pleasant intelligence that 5 of my horses are without nosebags! Very nice! \"C\" Squadron have packed up their gear and most of them have their nosebags strapped to their saddles in anticipation of a hurried turnout tonight and they have (under cover of darkness) taken 5 of my nosebags and the worse crime is they have taken them off the horses when feeding. The most contemptable action that can well be imagined. Some men are absolutely soulless, and callous to a degree. I would much rather forego my dinner any time than take the nosebag off a feeding horse. Such conduct is reprehensible but what remedy in the dark? I have got a broad green strike painted around the middle of all my bags but how am I to identify that green stripe in the dark? Words fail me I cannot even swear. However I have sent a couple of lads to make \n\nimprovised nosebags out of chaff bags and so peace reigns once more. But when morning comes I shall waylay them when they come to the feed stack Then I will have revenge I know they will only \"pinch\" them again at the first opportunity but such is the way things go here it all helps to make the spice of life.\n","47":"\n\nWent for a ride to Nazlet-El-Abid this morning took some message forms to the Signallers. I have filled in the forms for that Commission this morning and they have been handed in must await results now. I am not particularly anxious If I do get it it will mean cutting away from old associates and going amongst strangers. When the early morning patrol was going out about 5 AM this morning one of the men Pte Leatch had the misfortune to fall over the bridge which spans the canal close to Camp and was drowned. Up to a late hour tonight no trace of him has been found. although \n\nsomeone dived and brought his rifle to the surface. There is a very strong current at this place and it is surmised that his body has by this time gone some considerable distance down stream\n\n\"C\" Squadron are still awaiting orders. \n\n15 bags of mail came out today from the Post office at EL Minia. It is all sorted by now. Been very hot today and it reminded me of the summer of last year. We are all very much tanned from exposure to the sun both here and through our Gallipoli experience I suppose will be more tanned by the time we have finished with Egypt Because from what I can see of it it seems more than likely that we are destined for duty in the Land of the \"Pharoahs\" for some time yet. One never knows though – these are uncertain times. Anything happens nowadays.\n","48":" ","49":"\n","50":"\n\n- Tukh-El-Kheil -\n\nHave been busy all day resorting mail All day rather tedious work. I was half finished when I suddenly had another 8 bags dumped on top of me! But I got through it all by this evening The weather has been cloudy thereby taking off a great deal off the heat The nights now are just nice & cool and not hot. but I am dreading the coming summer. Up to now there is no trace of the unfortunate Leatch who fell into the canal yesterday morning Goodness only knows where he has got to with such a strong current flowing Sgt Willenbock. Cory. Delpratt Sword, Grove\n\nand Arnold. have gone away tonight. They are going to the 13th Infantry Brigade along with Colonel Glasgow where they are all getting Commissions. Oh! the luck of some men! Some of them I would not have on my mind – knowing them thoroughly as I do. But thats always the way in this army. A genuine conciencious soldier would not get such a chance unless by a special dispensation of Providence. So the world wags! \n\nGood old Willenbock! he was a thorough gentleman I wish him every sort of luck in his new enterprise. Hope to meet him again \n\nI write in this diary just what happens and just what I think as Shakespeare says \"Give me leave to speak my mind\" –\n\n5th \n Feb\n March Sunday\n\nSunday – Nothing doing much beyond the usual church parade in the morning. News was received today from the Egyptian Police that the body of the late Private Leatch was discovered floating on the surface of the water about 3 miles down the canal. The wagon was sent out with an escort to fetch the body in and all preparations were made for burial. When the escort came back they reported that it was not the body of a soldier who was found but that of a native\n\nwho had his skull fractured. his hands tied together and a large stone in the seat of his pants! Murder pure & simple. Someone has been having revenge I suppose \n\nSo our unfortunate man has not been found yet. \n\n6th ","51":"\n","52":"\n\n\"Nothing to Report Same routine.\n\n 7th \nFeb\n","53":"\n\nMajor Bourne coming back! Something doing now Ill bet. Been out on a long ride this morning The weather has been stinking hot all day and if it gets much worse I don’t know how we poor devils are going along and especially our poor horses. The heat will – I am afraid play havoc with them. More stringent orders about bathing in the Canals All this water comes directly from the Nile and they are afraid of the men that dread disease Bilhazia Anatobia. Although the natives swim in it with impunity and they also drink the water without \n\nfiltration. Dead dogs, dead men, and dead cattle float gaily (and daily) past us but the Natives simply go on drinking the water and swimming in it The must have constitutions like wire fences. and no taste. If we were to drink the water we would soon get typhoid or Enteric fever. \n\nThese Arabs are the lowest Scum on the face of God’s good earth in the shape of human beings. They are syphillatic to a great extant Some of the fellows go in swimming their horses but I have never been able to see my way clear to do that yet. \n\nThey are almost totally ignorant of the current coinage and they scarcely calculate beyond a couple of piastres Great is their astonishment when we produce a 10 piastre piece when we purchase any thing from them such as fowls or geese eggs. Etc. They always reckon in their own stupid ignorant fashion that the coin has no value and they certainly never have any change for so large a coin. They principally deal in millemes which are too small a coin in value for us. They come past the Camp each morning on their\n\nway to work or to graze their cattle There are a great number of the latter at this village. water-buffalo. sheep goats donkeys. cows. Etc. They tether the animals by the legs and cut \"Burseen\" (Lucerne) and feed them all day and take them home at night. The Canal is very deep and wide near TUKH- EL-KHEIL here. and there is only a rickety old plank bridge to cross on and in one place there only remains one plank the other two have carried away. So when the cattle come home at night. The bridge carrying capacity is limited Consequently the water-buffalo (\"Gamoose\") as the Arabs call them have to take the water and swim to the other side which is not much trouble to them. Then the cows and calves \ngo\n have to swim Sheep & goats and donkeys go per bridge until they come to the place where only one plank exists. Then the fun starts. Sheep & goats hustle each other for a foothold with the result that numbers of them always the weaker vessels so to speak get unceremoniously tipped into the swift flowing current. They are of course good swimmers as it happen but the experience is anything but pleasant because the poor devils will have to go to \n\ntheir home and put in the rest of the night with a wet skin. The donkeys go alright until they come to that one plank and generally end up by being being rudely pushed ad lib into the water to get out or get under as it were Some of them safely negotiate that one plank but the percentage of dry skins at the opposite bank is about one in ten. No effort is ever made to remedy this defect and hell only knows how long the other two planks have been missing \n\nWe are moving our Camp away from here very soon now and I believe we are going further up the Nile somewhere about 4 days march. Message about transport are very frequent about it all day to day we will be relieved by other units. \n\nThe nights are lovely and cool and in striking contrast to the heat of the day\n\n8th \nFeb\n. March Wednesday 1916\n\nThe weather has been windy today and so it has not been too hot. Both telephones going hard at it all day principally with reference to transport previous to our departure for ASSUIT somewhere further. up \n\nthe Nile. I think it is something like 4 days march and from what I can hear they will be long marches. If we have days like to day it will be a pleasure. Nothing of importance has happened to day. Roast Turkey today Goose yesterday – quite a usual feast with us these times. I should not care to go back on Peninsular Rations now - Bully beef. hard biscuits cheese & Jam (watery) \n\nThis desert life is mind starving work there is no amusement \nof\n at any time The ordinary little incidents which happen during the day are the only diversion. The evenings hang somewhat heavily. The telephone is my principal diversion the different ones coming on duty and the taking messages helps to break the monotony a little. It isn’t exactly the telephone but the expression of the signaller when he cannot get through properly that is amusing sometimes\n\nThey are forming a New Cavalry Division and applications have just been sent to the Brigade Office for vacancies on the staff. I have just registered 2 long messages with reference to same – Men applying for soft billets on the Divisional Head Quarters staff \n\n9th ","54":"\n","55":"\n\nWe have been busy all day sending our heavy baggage into EL Minia to be entrained for our new Camping place somewhere up the Nile. All tents are struck and once again we are out under the blue canopy of heaven. We start tomorrow sometime and the first Camping place is Nazlet-El-Abid where our ‘B’ Sqd has been Camped since we came down these parts. There is a cold wind blowing tonight but I shall not take much notice of it, as I Camp out in the open each night close to the \ntelephone\n box. I say \"box\" advisedly The said \"box\" is simply a post with one telephone on each side and a blanket spread over the top on four flag poles to keep the heat and dew off the instruments. Only one man is on duty at a time and when the bell rings the question arises Which bell? He has to try first one and then the other till he finds out which one \ndid\n ring. The fun commences when \nboth\n bells ring simultaneously. or in the middle of a message when the other bell rings which does not too often happen. Shall be sorry to lose my \n\nArab-made stretcher made of palm leaves and cost 15 piastres. By the way we were paid today and with our pay we were issued with Indian rupees.\n\n8.30 pm. Just been haul’d out – 4 nosebags missing out of the eight which were put behind the horses this evening. Had a \"wordy\" 5 minutes with the Sergeant of the \nPick\n picquet. No wonder all my horses were not fed up at 8 oclock when some of the bags were \"pinched\" Going away on trek tomorrow some of them are short on nosebags. Very obvious!\n\nNow for bed.\n\n- 10th \nFeb\n March Friday 1916. –\n\nOur resting place for tonight is NAZLET EL ABID where our B Squadron has been all the time. Started off from TUKH EL KHEIL at 1.45 pm. and reached here about 3 pm. Nothing \n of\nworth recording on the way. only that I was hell fire hungry and after having the best part of 2 dozen eggs I feel better! Met A Squadron for the first time for weeks and sorted out a lot of mail for them.8.p.m. B Squadron of the 1st Light horse has just come across the bridge with a rattle and they are making themselves at home here Vice our B Squadron. Long march tomorrow. Sleep wanted Goodnight! \n\n11th \nFeb.\n","56":"\n\nWell now we start to chronicle another days proceedings which is rather awkward I am lying in bed on the hard ground with my head against the wall of a big cotton mill in a big Arab village on the banks of the Nile called RODA or RHODA. I don’t know if it is spelt correctly but that’s how its pronounced. Had a long march today – over 25 miles the transport horses were a bit done up hauling their heavy loads. The road was fairly good The OMDAH of the village where we Camped last night came along the road with us he led the way (Omdah means mayor) he was riding a thoroughbred Arab Stallion and one of the Egyptian police officers who acted as guide and interpreter rode a thoroughbred brown Arab Stallion, and thereby hangs a tale. At a halt for water along the road this morning these two by some mischance got close together both had the bits out of their mouths \nfor\n to give them a better drink – Suddenly and without warning the brown stallion savagely attacked the black stallion and a free fight ensued Such a mix up of heels and flying mud would be hard to describe \n\n They bit & kicked each other most \nun\n unmercifully one even got the other one down but he was soon up The natives were powerless in such an emergency and made no attempt to catch either and when one comes to think of it it would require a man of great presence of mind to separate two such desperate fighters.\n\nAfter a few minutes they got in amongst our horses and men who were at that time watering and it was the greatest miracle in the world that some one – either horse or man – did not get their heads kicked off for such a beautiful display of swift flying heels and gnashing teeth it would be difficult to imagine. \n\nThe black stallion eventually got the worst of the deal because he bolted away through our horses & men at a rate which only an Arab thoroughbred horse can go with the brown fellow close at his heels. Every time the brown stallion bit the other one he got measure for measure both heels invariably took effect but they raced on right through Head Quarters and then through A B & C Squadron and away to the rear of the Regiment past all the transport as the Australian says \" Going for the lick of their life\" \n\nThey were still biting & kicking and going at top speed as far \n\nas the eye could reach away along the road behind us. Later on \n\nthey were both caught and bought back to the head of the Column \n\nat a gallop We had by that time gone perhaps another 5 miles along that meant at least a good stretch gallop of 10 miles. They were just as lively as ever when they were brought back and remounted by their original riders. They got close together once again during the afternoon both with riders up but they were hastily separated. I have seen all sorts of fights in my time but they pale into insignificance when compared with this battle Royal. Later on at lunch time the Officers gave the Omdah several stiff nips of whisky, which had the effect of making him talk wildly and act foolishly thereby losing much of his dignity which these natives in such positions love to preserve. He was galloping along the road and cutting all sorts capers on his Arab stallion all along the road I was momentarily expecting him to be pitched off but he evidently knew how to sit tight. He will feel sick sore and sorry tomorrow morning Ill wager. \n\nWe got to Camp about 5pm. Rather large village this, but all the shops \n\nwere closed so nothing can be purchased rather annoying as we for the most part only want something in the eating line \n\nThe cooks being late in coming in and getting things ready makes it rather a long fast and if we could purchase something to eat from the shops, things would be better.. \"Pharoah\" got loose last night he broke his head collar and got away he was in a patch of green stuff all night When I put the nose bag on him this morning he refused to eat. The farrier Sergeant said that he was sick because he refused his feed but I knew what was wrong with him, he was suffering from a full stomach and that has never harmed him yet. him especially. \"Pharoah\" has one thought in life \"plenty of feed and then after that more feed! He believes in his way that he must eat while he can because he is going to be dead a long time! \n\nHere goes for bed.\n\n12th\nFeb.\n March Sunday. 1916\n\nCamp Deyrout. \n\nFrom Rhoda to here is about 25 miles Canals all along and intense cultivation These people cultivate every available foot of Space Barley and Sugar Cane are the principal things grown here. a good deal of \"Burseen\" (Lucerne) At this Camp there \n\nis a Barrage the water goes off at various angles in huge canals to water (irrigate) large tracts of country\n\nSketch, giving rough idea of these Barrages \n\nCame into this Camp rather late baggage came in about 8.30 p.m.\n","57":" \nFeb\n.March MONDAY 1916.\n\nCamp MAM FALUTE\n\nFelt very sick all day had to ride in the ambulance waggon Long march 21 miles Long hot and dusty. Good Camping ground.\n","58":" ","59":"\n","60":"\n\nLeft Mamfalute about 8 AM for ASSYOUT\n\n \n\nabout 15 miles The country hereabouts differs from that of Lower Egypt. Hardly any sugar cane growing, but great quantities of poppies which are cultivated for medicinal purposes and probably for a little illicit opium trading Mile after mile of these beautiful flowers which is very pleasing to the eye and they afford such a welcome change passed a Squadron of Egyptian Cavalry on the road. Rested under some fine shade trees at lunch time for about 2 hours. The sun now is getting very hot in the middle of the day. \n\nArrived at Asyut or Assuit at about 4.30 p.m. Camp near the city and alongside the great Assuit Barrage This is a magnificent piece of engineering. The main Barrage which spans the Nile here is 818 yards across with 61 Locks Millions of gallons of water per minute pass through these gates and when the locks are closed which is done by a huge mechanical device the whole volume of water is made to rise on one side and flow into these distributary Canals which irrigate the country for many miles and supplies thousands of acres with water \n\nThe Egyptian portion of Assuit is very pretty, some splendid buildings chiefly the residences of the well-to-do class. Some are most magnificent residences private cars, Electrical light and heaps of servants. The place is essentially French although English is freely spoken by nearly all classes. even among the lower class natives There is a large American College here for the training of well-to-do Egyptians preparatory to their taking higher degrees in England & America We have been allowed unlimited leave here and so we see a good deal of the place.\n\n20 bags of mail to distribute today. This mail is getting a great nuisance Shall be heartily glad when I can hand the job over for someone else to have a go at. I went over to the Brigade Office this morning and had a personal interview with Brigadier General Cox about the Commission I have applied for as signalling Officer. But he only just asked a few questions re qualifications where I had been Etc. Don’t know how matters stand yet. I am not too keen on it and should be \n\nrather sorry to leave the regiment where I have been since August 26th 1914.\n\n15th\nFeb.\n March Wed. 1916\n\nCamp ASSUIT or ASSYUT. \n\nASYUT. ASSOUIT.\n\nFour different ways of spelling the name of this place. The horses are having a much needed rest today they have been going rather hard for the past week.\n\n16th March. Thursday 1916\n\n We had fondly imagined that this was to be our permanent Camp for sometime to come but just as we entered it we got the surprising news that we were ordered away up the Nile to another of those \"unknown destinations!\" Rotten luck we do get and no mistake This is a beautiful place. Nice gardens beautiful shade trees water in abundance near a lovely big City, with plenty of \"Donks\" to ride on which is great sport and a favourite one of the soldiers You hire a \"Donk\" and jump on they don’t want much jumping as some of them are only about 3 feet off the ground. and away you go at either a fast amble or a gallop generally the latter with the donkey boy in \n\nin full cry. These donkey boys must have great stamina because they will run alongside the \"donks\" for long distances often at a very fast run \nbackward\n to and fro all day I know, the one I had last night his name was \"Telephone\" by the way (The \"donk\" I mean) was covered with perspiration and the boy likewise The \"boy\" by the way was an old man but they are generally called \"boys\" Age being no object. He asked 10 piastres and for once I had not the heart to beat him down I concluded that he had justly earned that amount. The usual course of procedure is to offer about one half \nless\n than they demand. \n\nWe left C Squadron behind at Asyut and travelled on south this morning We have the Brigadier and his Staff in front. Since we left Tukh-El-Kheil we have been going at a good pace along the roads but since the Brigadier came in front the pace has been chronic – too slow. And to my mind knocks men & horses up so much as dead slow travelling We are now (12oclock) off saddled under a clump of beautiful green shady trees quite close to the great Nile River\n\nwe generally off saddle for a couple of hours for lunch and to escape the worst heat of the day. I am lying down under a lovely green shady tree on a natural carpet of grass. And I don’t think I could find a more ideal spot if I tried. This is a glorious life. Up at 5.30 AM each morning breakfast and saddle up and move along the road in the lovely morning air. Then at midday halt under some inviting clump of trees later on march again & reach Camp at about 5 p.m. tie up our horses anywhere handy. No particular place give them a groom and feed them then we have our own meal wait for the transport wagons for our blankets – find a comfortable spot and prepare for another nights repose and so it goes on. What could be better or more natural? \n\nWe don’t have any ailments It’s a sure panacea for all ills to which the flesh is heir to. The only time when the boys don’t feel good for the march is when they have returned from some neighbouring hotel the previous evening with – what Blatchford describes as \"Vine leaves in their hair!\" The after effects are of course felt next morning But as they say in Arabic \"Malish\" (Never mind) The boys say they will be a long time dead why worry over trifles like that? \n\nSmith, Parrish and Howard have returned from Hospital at Wardan and they are on the road this morning \n\nButler has returned from A Squadron so once again I have got all my original men.\n","61":"\n\nSt Patricks Day. ABU-TIG.\n\nCamped last night in a large enclosure probably the local market place. The villagers had never seen soldiers before & and their wonder was great Crowds of them hang around and are quickly dispersed by the Egyptian Police but they are like cattle the come back for another look at these strange \"Askari\" (Soldiers) The are very much interested in all our doings they watch all our movements like so many hawks. although they are very peaceful and harmless but nevertheless they are embarrassing You tell them \"Imshee\" (Clear Out) They go away for a few yards and then when more newcomers arrive on the scene they push forward again. These Native police have a very effective way of dealing with them. They simply slog into them – Age or sex no bar – with a green hide riding whip They fly in all directions And the loud rustle of those skirts which they all wear make a noise like a flock of birds suddenly flying up \n\nBut its no use 5 minutes they crowd around again So the whip goes into them again. Truly a policeman’s life (here) is not a happy lot. They may have an easy time ordinarily but when troops pass through it is different. \n\nMal Gee suspended last night for being drunk & not doing his work. Major Bourne back to duty today. I slept near the gate last night but never again. The men were coming back from the village close at hand per donkey up till a late hour and the infernal row that was going on it was impossible to sleep. The donkey boys and our men wrangling over how much money was due for fares. When the picquet had cleared the village of all troops there was a small crowd of natives with a Corporal policeman at the gate. The natives were presumably something to do with the management of the market ground. However they kept up a running fire of conversation\n\n\"Jargon\" was a better way of expressing it for hours after. I told the policeman several times to keep the crowd quiet & and he promised to do so but as soon as my back was turned the would recommence About 10 oclock I got up for the last time and came over to where the \"Shawish\" (policeman) was sitting and took his number and put it down 5296 it was I entered it in the \n\nnote book with a great show of authority and made him understand that I had already warned him several times about the noise and that he would have to answer for it before the \"Coracol\" (Magistrate) in the morning. Well the unfortunate \"Shawish\" although he was a gigantic Sudanese and as black as a coal seemed to shrink and turn pale at the threat. He promised, by the Prophets beard that he would maim injure or destroy any godforsaken son of a dog of an Arab who dared open his mouth again And the promise was kept for I had no further trouble with them and went to sleep in peace I quite pardoned him in the morning and he was grateful. Had the report gone through the poor devil would have lost his job and got himself into an awful fix. However verb Sap.\n","62":"\n\nLast night we Camped at \nat\n a native Village called TIMA The march to there was about 18 miles. No noisy natives to disturb our rest I carefully refrained from sleeping too near the main entrance to the market place where the various merchants sell their wares. Tomatoes, Lemonade (Rubbish) Eggs Etc \n\nStarted this morning at 8 am. for TAHTA. The road really is 23 miles but a shortcut \n\nwas taken making it about 13 miles. The travelling today was good. There was a fine cool breeze blowing we did the journey right out without the usual break at midday. and got here at 12.30\n","63":"\n\nArrived at TAHTA at about 1pm Short March Sun very hot and no shade trees in the Camping ground. Went for a walk in the Native City. It consists of mostly mud brick houses and there is a perfect labyrinth of streets running – as Mark Twain Says. \"Every which way\" a regular human warren The usual native stuff for sale Very smelly for the \nmost\n greater part. If you want to buy any article from a shop a crowd collect immediately and they \n\nare all offering advice. & all helping one to make the purchase For instance I wanted to buy a pint pot to drink out of. And as soon as I pulled up at the shop I pointed to a string of them hanging from the ceiling. Immediately the usual crowd collected and were all telling the shopman that I wanted one of those pint pots. The shopman took one from the string and at least half a dozen grabbed it & passed it from one to the other admiring it and all with the same breath told me it would cost 2 piastres They totally ignored the shopman as though \n\nThey themselves were doing the deal. I gave the shopman the two piastres and all eyes were on the coins to see that he got the correct amount. Exactly what would happen If I had not given the correct amount I would not like to say. \n\nVery probably I would have had half the population of the town yelling at my heels and no amount of persuasion or threat would drive them off. We Camped again last night in the market place which is enclosed by high iron railings very close together. The whole population came crowding around these rails asking for the inevitable \"Backsheesh\" \"Clamouring\" would be a better word They some had eggs to sell or oranges or lemonade. But the whole population had one thought in the minds – What can I Steal?\" Little bits of nippers reminding one of half civilized dingoes would ferret out something saleable and handy to the railings where we had placed our saddles and watch for an opportunity to grab it & run The Native police were flogging they away with their whips but these people are so near to animal in their nature that while the \"Shawish\" flogs them away from the railings they re-form at his back. Nothing short of a bullet will stop them We must save those we may have better use for them yet.\n\nThese Natives around these parts of the Upper Nile are very grateful to us for the protection we offer. And the English speaking ones tell us so because they know what damage the roving bands of Bedouin Arabs are capable of. We have just read where these Senussi away up on the coast have been routed by our troops which has had a very demoralizing effect on them generally and it may have the effect of teaching them that to live a peaceful life will be more profitable\n\n- 20th March Monday 1916 –\n\nWe have reached a standing Camp called Sogar’ 330 miles up the Nile from Cairo. Nile river runs close handy. plenty of water. plenty of dust too. We came into Camp about 5pm. last night. Sorted 5 bags of mail this morning great amount of letters none for myself as usual. Finlayson one of my signallers has just returned from England. He left us at Anzac with Enteric fever. somewhere about last September He says he has had the time of his life.\n\nSergeant Bruce returned from Heliopolis this morning he bought back a book he found alongside the body of a bayonetted Turkish Officer in Gallipoli He took it away to get it translated from Turkish into English also several letters The book was the Company roll book of a \n\n1st Lieutenant in the","64":" Turkish Infantry Mens names & numbers and particulars of attestation were in the book. and all those of his company who had been killed in action. There was also 3 letters two from his people in Constantinople praying for his safe return wishing him all sorts of luck and hoping he at least will return safely to them. The third letter was one he had written in reply to the other two. He stated that he hoped all were well at home and was praying Allah to grant him the great joy of seeing them again. He explained that the war was terrible blood everywhere it was horrible and he would be glad when it was all over.\n\n------- He was \nlying\n in his dugout. in a half sitting half lying position with his blanket wrapped around him just where the lads had suddenly pounced upon him and the bayonet had done the rest.\nThis\n The Book and letters were lying close to him. The poor devil had written the letter and never had the opportunity of posting it. \nLov\n\nLovats Scouts are Camped here near us. They have the bagpipes going regularly just to make things lively.\n","65":" \n\nThis is our Concentration Camp it is a large Native city called SOHAG. 330 miles up the \n\nNile from CAIRO and about 420 miles from Alexandria Very long way to go to water It takes about an hour to go there and return. We are now on the usual Camp routine and I don’t mind saying that it does not meet \nwhere\n with the approval of the men. They like to be up and doing Cant beat trekking its good fun and good for the horses too. We are contemplating the reforming a Sergeants Mess but from what I can see of it there seemed to be a \nmess\n right enough. previous accounts have not been squared up and generally speaking things are not looking healthy on the face of things Probably have a meeting tonight and go into matters. Bobby Farnes of the Signal Troop goes away today as a first Lieutenant in charge of the 2nd Signal Troop. I have watched his progress from the rank of private through every grade up to that of officer.\n","66":" 1916\n\n- SOHAG – Sohag\n\nVery hot today. Full marching order inspection all day. Great dissatisfaction here. The Trumpeter Sergt and the Saddler Sgt. & the Armourer Sgt warned for picquet. \n","67":"\n\nThe whole Regiment went out today and bivouacked under the shade of clumps of palm-trees. The idea was to get the horses away to shelter to during the worst heat of the day. The returned to Camp at 4 p.m. The sun has been very hot and the flies are now getting troublesome. But when the sun goes down life is worth living the nights are cool. Reveille now is 5.15 \nThats\n That stings! don’t like the idea of \"showing a leg\" so early. but here we must do as we are told worse luck.\n\n---","68":" ---\n\nThis is the limit for a \ndus\ndusty Camp. When the horses go to water each time they raise great columns of thick soft dust which is very uncomfortable we are all sincerely hoping for an early move \n\nAfter being on trek we have no inclinations to remain in one place too long and especially in such a dusty place as this with about a mile to water. The horse go out under the shade of the palm trees each day from 9.45 to 4 p.m. Seven bags of mail came in today and that took\n\nall morning to sort and distribute \"Any letters for me?\" \"Is there a mail in?\" That’s the universal cry. They see me humping a bag of mail as big as myself. and stupidly ask \"Is that mail Sergeant?\" I generally say \"No! you fool! its bread!\" Cant you see? Did you ever see mail come in a bag with three red stripes with G.P.O. on it?\" As the Colonial would express it, \"They get on my nerves, dinkum they do\" \n\nButler’s horse got frightened this morning at the sight of a camel (so he says) and bolted. He was leading \"Pharoah\" the time. \"Pharaoh\" bolted for his life and was found later on wandering about the Camp of Lovats Scouts and bought home He had broken on of his reins \n\nMajor Goucher arrived last night and Lieut Potts but they were sent back Heliopolis again this morning No room for them here.\n\n ---","69":" 1916.\n\n5 bags of mail today. Horses gone out under the palm trees. Very hot and dusty. \"Pharoah\" new Shoes!\n","70":"\n\n\"Pharoah\" the beast managed to break hid head stall during the night probably had trouble with some of his neighbours. Yesterday he got away and was bought back from another Camp Tomorrow -? Things are looking serious with him. I went out this morning to the shade of the palms but did not stay long something happened to the line of communications which necessitated me being in several places at once which often happens on my job. Its surprizing how things \ndo\n get smoothed out of the tangle.\n\nWe have now – after 19 months of soldiering and hard work – got \nan\na Signalling Officer! Yes 19 months and over 7 months of active service out of that I have done the whole thing organizing and reorganizing training and more training being responsible for the efficiency of the Signalling of the Regiment. Now after all this time I get a Signal Officer to take the responsibility and tho the said Officer with all due respects to him does not know anything at all about the Art of Signalling He says he is going to start and learn now! Nuf sed!! \n\n \n\nTwo of my Signallers have been brought to prominence by having a fight this morning. A real \"go\" They had an argument in the tent So the report goes. And got into \"belts\" Not being much damaged so far They retired to a deep dry canal in the near vicinity and had the second issue there which was decided after a few minutes battle. One of the contestants came back, rather badly knocked about.\n\nMonday 27th March 1916\n\nSOHAG UPPER EGYPT\n\nThe heat was awful today. I have been instructing the new \"Signalling\" officer today in the mysteries of A.B.C.! He is an apt pupil, a good learner\n\nStringer reverts to the permanent grade today at his own request and C.H. Smith becomes Lance Corporal in his stead He goes to Zeitoun on April 1st for a months instruction in a refresher course of signalling He has the offer of my job when I go away. or if I go away. \n\n\"B\" Squadron under the Command of Captain Shanahan goes about 10 miles further north to morrow morning Have just fitted out McDougall with fresh Signalling gear for keeping \n\nup communications with us at head Quarters\n\nASSWAN The great Barrage on the Nile. One of the finest feats of Engineering ever accomplished by the hands of man It is called The","71":" wonder of the World Built by Sir Benjamin Baker the great Scotch Engineer who also built the FORTH BRIDGE in Scotland. \n","72":"\n\nVery hot again today. Been instructing The Officer in Heliograph work. \n\nThe Signalling Establishment is being considerably reduced The boys who go the Squadrons will certainly not relish the new order of things They have been having a good time when they were with me. no guards, no picquets. no fatigues to do, in fact nothing but signalling to do and not too much of that. Balderson Howard Finlayson and Inskipp are the ones to go. –\n","73":"\n\nB Squadron left yesterday for a different Camp about 12 miles further up the Nile.\n\nThe Camp here is being re-arranged since B Squadron has gone away. Another stifling day and we are all of us tanned very much. The nights are a real pleasure And as the Irishman says \"The night is the only part of the day worth living for.\" \n","74":" SOHAG.\n\nHot & dusty. Some dissatisfaction about the messing arrangements for the Staff Sergeants have had a meeting to night and arranged\n\nthat we amalgamate and peace reigns again. Four of the Signallers went to \"A\" Squadron tonight. They pulled long faces but had to go. 14 bags of mail came in tonight Work to morrow.\n","75":"\n\nWaded through 14 bags of mail this morning It takes about 3 hours to do it. Got a parcel myself. Very windy to day and this Camp is cursed with fine clinging dust when does not improve matters when it blows.\n\nSmith and Allen of .A. Squadron went to Zeitoun to the school of Signalling They will remain there working very hard until the end of the month then they will return with their Certificates of Efficiency. The other signallers are suffering from a bad attack of ‘professional jealousy which is usual in such cases. They all contend that they could give Smith points in Signalling and leave him hopelessly behind But I have my own idea about such matters and my ruling stands good. Smith goes: the others don’t Nuf Sed! \n\nGot new nose bags now. Nearly time we had them for the last \n\nmonth we have been using any kind of bags for the purpose and there has not been 20 decent nosebags in the regiment. I went into Sohag to night and bought a large tin of green paint and a brush and we are going to paint a wide green band round the bags to prevent them getting \"pinched\"\n\n4.6.16. PS They pinch green band and all. \n\n.S.O.H.A.G.","76":"\n\nThe weather has been somewhat cooler today for a change. I don’t know how I am going to manage with my Signalling establishment cut down as it is they are expected to do the same amount of work as formerly. Wrote several letters to night the first for a long time. I never as a rule get any myself. \"Dust unto dust and under dust to lie\" Hell! its all dust here but the trouble here is that we cant lie \nunder\n the dust but \nover\n it at least so far. We’ll lie down under the damn stuff soon enough. At present we are swallowing the stuff as fast as we conveniently can. 2 more bags of parcels tonight and 2 this morning. Sent B Squadron mail away this morning. \n","77":"\n\nSergeant Major Farnes of the Signal Troop went away yesterday to take over the 2nd Signal Troop belonging to the 2nd Brigade He had the star on his shoulder. Hot again today and the flies troublesome. Most of us carry fly whisks to keep the little pests off I have ordered a yard of mosquito netting because it is almost impossible to lay and doze during the day for the flies. \n","78":"\n\nCloudy: Sent a parcel to I.J. today Must make a note of that in case it goes astray may come in useful. All troops were served out with the \"Kitchener\" Helmets, they will be an improvement on the slouch hat because the weather now is getting severe and heads must be protected.\n\nPoor old Sergeant Wear the Brigade Police Sergeant died last night from double pneumonia and primarily Alcoholic poisoning he drank something awful. Poor old \"Nap\" \"De mortus nil nisi bonum\" We \"planted\" him this afternoon in a lovely spot near some hills at the back of the city. A cross will be erected to his memory. It seems hard to go \n\nthrough that Gallipoli hell of many months without a scratch and then to die in comparative safety. here in Egypt and about 400 miles up the Nile in some lonely spot like this.\n\n\"Ah fill the cup\n\nWhat boots it to repeat\n\nHow time is slipping underneath\n\nour feet.\n\nUnborn tomorrow and dead \n\nYesterday\n\nWhy fret about them if today be sweet.\"\n","79":"\n\nSame Routine. \n\nSohag ","80":"\n\nNothing to Report. \n","81":"\n\nThe only item of interest to record today is that the Signal Troop have now got a new officer Captain Downing is going away.\n","82":"\n\nThe heat was something frightful this afternoon between 2 & 4 pm. The tent was simply unbearable the clothes seemed to burn one\n\nWe are tanned now nearly beyond recognition. Quite hard for our complexion. These helmets are a great innovation affording as they do great protection for the head. Been teaching the Alphabet to the Officer all morning. he is a good pupil. But he is annoyed with himself for not getting along faster \n\nWe have settled down into the regular routine of Camp life and it is hard work making sufficient notes in the diary. Keeping a diary at any time is hard work. & few people can successfully keep one. If there is nothing doing there is a scarcity of news to record and if there is plenty of work or adventure on hand the chances are that one has not the time to record any notes.\n","83":" Sohag.\n\nHeat most intense today. \n\nThis heat will kill some of the men yet Im sure. Inside the tent its like a bake-oven well over 100° now. \n\nSports today. betwn us and Lovat’s Scouts & Fife and \nForfarf\n Forfarshire Yeomanry.\n\nA terrific dust storm raged for a couple of hours this afternoon the whole country around \n\nwas simply a mass of thick dust with a strong wind. The Sergeants Mess tent blew down the ridge broke had great work fixing it up again. 9 bags of mail arrived tonight. The old Cry comes around\n\n \" any mail Sergeant\"!\n\n-- ","84":" --\n\nHeat very bad. Church this morning didn’t go. Got into a row for staying away and not sending the signallers on with the Machine Gun Section \n\ndistributed 9 bags of mail. More loose dust blowing about. Its pleasant to contemplate. The interpreter informed me to day that July and August are the hottest months here Hell! pleasant! We are also in for those \"Khamseen\" powerful sand and dust storms which are to last for 50 days! \"Khamseen\" in Arabic means 50.\n\nSohag.","85":"\n\nThere has been a cool wind blowing all day and for once life has been worth living \n","86":"\n\nTroops out all day under the shade of the palm trees as usual They return about 4 pm each evening during their stay they have rifle drill or some other evolution just for practise.\n\nHave been in communication all day with a distant outpost on the hills behind Sohag by heliograph very dusty place. this Camp.\n\nSergeant Rafter went to Hospital he goes to Cairo Sick dont know what is the trouble.\n\n12th April Wed. 1916.\n\nCloudy most of the day. but about 5.30pm one of the most damnable dust storms we have ever experienced paid us a visit. It blew scarcely without intermission throughout the whole line long night. These dust storms are a caution Everything gets covered with fine black dust which for the most part comes from the banks of the Canals oh hell what a night! I only had about 2 hours sleep altogether The atmosphere too was hot. and most unpleasant \n\n13th April. Thurs 1916.\n\nRumours are afloat (like the dust) that we are soon going from here. if that’s the case I shall make one who will call upon the Lord and rejoice exceedingly. \n\nDust blowing about all day no good having a wash. Now is the time when a man is put to the supreme test as to whether he is an optimist or a pessimist. Personally I am an incorrigible optimist. And always have been. The morning the mens faces looked as though they had made the acquaintance of soap and water for a month\n\nThe Sergeants mess tent blew down the pole going through the roof I woke at about 2 30 this morning and heard the mess tent tearing with each fresh gust of wind A few spots of rain fell during the night but not enough to make the slightest difference However tonight the Sky is cloudy and the dust is taking turns in blowing from one direction to another. These are trials indeed on ones temper & patience but I am thankful that I have both\n\n14th April 1916. Friday\n\nThere has been periodical dust storms all day although the weather has cooled somewhat. \n\nPay day.\n\nI have just been having a \nread on\n \"reckon up\" of the pay book. the first one since I joined I have only been allowed to draw 3\/5 per diem whilst out of Australia So I have been getting 3\/5 per day from the 6th Dec 1914. I now make the startling discovery that I have overdrawn my account to the extent of £9.7.3! Of course there is still 5\/1d per diem to my credit all that time The Government up to the 1st April owes me £114-12-6 and I have drawn £122.8.1. My deferred pay 2\/- per diem from the","87":" 1914; (The date I was promoted Sergeant) comes to 57.1.0.6 pay day today\n","88":" ","89":"\n Sat 1916\n\nThe usual routine all day \n\nThe weather sublime. No dust \n\nI tasted Native made coffee tonight for the first time as I very rarely drink coffee but it was beautiful. It appears to me to have a different flavour to any I have ever tasted before. The Orient is as we all know, the place where the National drink is Coffee\n\nand if that’s a sample of what the drink Can be I shall in future during my sojourn in Egypt drink nothing else. Sergeants Mess Meeting tonight. 69 piastres out of pocket not too bad and might certainly have been more.\n\nThis morning it was cold quite unusual for these latitudes and for this time of year I hope it continues but I don’t think we will have such luck. Shall soon be complaining about the \"blanky heat\"!\n\n-","90":" -\n\nNo sandstorms today. and the same routine Very hot. E.T. Jones one of my signallers has received notice to proceed to Tel El Kebir with Colonel Glasgow’s Brigade (13th Infantry) \n\nSergt Liston goes to Cairo tonight to see his father who goes back to Australia He has been employed in the remount depot in Maadi. Lucky man!\n\nHave been reading \"Free Opinions\" by Marie Corelli and \"Hypathia\" by Charles Kingsley. \n","91":"\n\nBeen inoculated today against para. typhoid I don’t know much about para typhoid\n\nbut if its anything like the preventative I don’t go much on it.\n","92":" Tuesday.\n\nLast night I had a rather high temperature well over 100° and got to bed early. This morning I felt somewhat seedy. but during the day I have recovered although my left arm is very sore. We are having to night one of the finest sand storms which we have ever had the misfortune to encounter It has been blowing all day and the dust is something appalling This is enough to make one go \"dilly!\" And to make matters worse there is no diversion, no amusement no change and no escape! Something maddening! \n\nWe have got a telephone installed in the Orderly Office now which must be worked all day and night and I have only about 4 men to do it on. Stringer has gone to Hospital he got a kick on the leg. Smith is at Zeitoun undergoing a course of signalling and Jones is going to the 13th Infantry Brigade so the only 2\n\nleft are Parrish and Phillips B. Squadron is about 12 miles away and C Squadron is up at Assuit so I only have 2 men belonging to A Squadron to give a hand But there is still the same amount of horses to look after. And then on top is this frightful dust which absolutely gets on one’s nerves. \n\nMy arm is still very sore tonight. \n\nLieut Pledger has gone to \nLax\n LUXOR for several days to view the sights of the ancient City. \n\nSohag. 19th April Wednesday 1916\n\n7 bags of mail This morning to distribute and another two this evening And now they’re not satisfied! \"Any mail\"? The phrase becomes popular now. And everlasting the officers are as bad as the men in fact some of them are regular nuisances. And when I am not in a good humour especially during a particularly bad dust storm I cant tell them as I Can the men my private opinion about the mail in general and their letters in particular I generally notice that the men who got most letters are the loudest voiced\n\nThere has been a good deal of dust blowing around to day. \n\nI have a longer journey to the Post Office now as it has shifted into the town along with Brigade Staff they are living in a beautiful summer residence probably subsidised by the Government for the use of the Brigadier and his staff. \n\nMy arm is quite well again I hope they don’t want me for any more of their inoculations for a long time \n\nFarquharson, a spare man I have on my lines goes to Hospital tonight to undergo an operation he cut one of the tendons of his finger and it is now useless. Another man less but I still have the same amount of horses to look after. I am now in charge of the whole of the Regimental staff and have got a queer handful with that lot. They take some handling In addition to that I am i\/c of all Correspondence to & from the Regiment registered articles and parcels Etc and also I am the Signalling Sergeant I am now & have been for some time the senior Signalling sergeant of the","93":" Light Horse Brigade\n","94":"\n\nThe weather has been tolerable today\n\nNot too much dust and fairly cool. I have been in the Regimental office the whole day copying out a list of casualties which have occurred since the 12th May 1915. I filled 10 pages of foolscap written closely on both sides of the paper. The Base Post Office wanted it for some insane reason. The idea I think was for the redirection of correspondence to men who are absent from the regiment, and who have been absent from the regiment now for about 11 months – wounded, sick, and malingering. Hundreds have gone to England and Australia hundreds are floating around in all odd corners of the globe anywhere & everywhere a good percentage genuinely wounded and crippled a good percentage genuinely sick, and a fair proportion neither but are well known to be downwrought loafers. and I could with about an hours work with the pen enumerate them I may perhaps have the luck some day to be behind them when they are in the midst of some stirring narrative \nas\n about when they got \"wounded\" on Gallipoli (no one will admit that he was sick). However let them go for now.\n\nVolunteers were called today for men who are tradesmen to form an Engineer Company to be attached to our Brigade about 25 men were selected \n","95":" Sohag.\n\nI got a supply of red Ink today couldn’t get black at least not of good quality So red is the colour now for some time to come. Ideal day to day.6 bags of mail to day and another 5 bags of parcels again tonight. If I go through this book I am afraid I should have a good total of bags to record and when Colonel Glasgow told me to take the post job on again when we came back from the peninsular he said that there would only be a few bags to deal with and then only once per fortnight. So much for the veracity of CO’s. Smith our cook has gone to Cairo to undergo an operation to his leg, we shall miss him very much \n","96":" Sohag. \n\nThe weather was good again today. We now have one troop of B Squadron here to duty duty with 40 extra horses which we have taken over from the 1st Signal Troop Their wireless section being disbanded and absorbed into the Divisional Signal Company. The name of the place where B Squadron is is. Nagt El Sheikh Allam it’s a small Arab village about 14 \n\nmiles out from Sohag.\n\nThis diary keeping is hard work I look at the top of the tent for inspiration but nothing comes of it. 6 bags of parcels today\n","97":" Sunday(Easter)\n\nWe are breaking all records as regards mail – another 8 bags tonight Thousands of letters. I have to distribute them all No one has the handling of a single letter apart from myself we did that one time on the Peninsular which led to utter confusion So they all sit round meek & mild and if the boys start an argument during the time I am calling out the names God help them! I have all spare letters to readdress when all the sorting is over and that takes some time, some rapid writing and some thinking out. But there is no hesitation I must go right on otherwise I would be here all night. The weather was frightfully hot today. And at times scarcely a breath of wind The very clothes seemed literally to burn one’s skin – A Battery of Royal Horse Artillery arrived today and are Camped close to us here.\n\n24th April Monday (Easter Monday)\n\nVery hot! Most of the horses have been innoculated for the second \n\ntime My turn tomorrow More pain and inconvenience I suppose. Pharoah has had the misfortune to get rather badly kicked somewhere to day. He is kicked on the inside of the leg. The poor boy has to attend hospital for sometime to come. Smith came back from Zeitoun yesterday. He obtained a 1st class Certificate for Signalling He passed very creditably He got 100 for Heliograph 100% for Morse 99 1\/2% for lamp 98 1\/2% for telephone work. He worked hard to pass his examination Allan of A Squadron also passed creditably almost as good as Smith.\n","98":"\n\nStifling stinking hot! Hell! hot not arf! I laid down under the palm trees but not a breath of air Flies troublesome. If I put the mosquito net over me to keep the flies off it stopped the small amount of air and if I took the net off the flies got to me. So what is a man to do? I got inoculated today for the second occasion and the last Thank goodness My arm is sore but I am not so sore as on the last occasion. \"Pharoah\"s leg much swelled today He is attending hospital each day. Its a good \n\njob I am not doing much riding these times In fact I have only had two rides since I came to this place over 5 weeks now. I am trying to get to Zeitoun for the next course of telephone work. (advanced).\n\nThis day last year was the day on which the famous 3rd Brigade made their name at Anzac. I have been thinking of it all day. One can only imagine the slaughter there must have been on this their first day I have spoken to plenty of them who were first ashore but I could never get a thorough straightforward account from the actual men just exactly how or what they did on that memorable first day. A little later on I shall try and give my own feelings and thoughts & experiences when I landed. which was 16 days hence. \n","99":"\n\nAgain sweltering hot and no breeze. Ordinary routine of Camp life The troops went out to the palm grove for the sake of shelter I am reading \"Pendennis\" by Thackeray very interesting the last one of his I read \n\nwas \"Vanity Fair\" I read that during one of the periods when we were holding the Pope’s Hill Trenches amidst the heat and flies & disease When I was doing my turn with the other signallers on the telephone 2 hours on and 6 hours off when at least 3 of those precious hours would be taken up with struggling for a drop of water or chancing life & limb in trying to get a little wood for the fire to do a little cooking with.\n\nThe latest joke is that our B Squadron who are about 14 miles out suddenly went on strike about their rations of cheese Whether it was the affluvia or not I cannot say but the upshot of the thing was that that cheese was decently & honourably buried with full military honours The \"last post\" sounded over the \n earthly remain of the said cheese! This naturally got to the ears of the powers that be with the result that in todays orders appears the following\n\n\"A board will assemble at a place and time to be notified by the President to take evidence, investigate and report on the condition, deterioration, expenditure, substitution or replacing of the cheese. Portion of reserve ration on issue to \"B\" Squadron 2nd Light \n\nHorse Regiment\n\n(Here follows the president and members of the said board.\n\nThe above effusion is one of the finest examples of red tape and officialdom I have come across for some time and quite worthy of a place here. Such good English and good ink and space to be wasted on the offending cheese! Why not go on the old adage \"Let sleeping dogs lie\"? \n\n ","100":" Sohag. ‘16\n\nStringer has come back from Hospital but he is quite unfit for duty for at least another fortnight he still has a great open wound in his leg where the horse kicked him. Phillips has put in a transfer to the Artillery and he may go at any time now. I take \"Pharaoh\" down each morning myself to the Farrier Quarter Master Sergeant to get his leg dressed It has much improved lately. I intend taking him out for a swim in the Nile when he gets better. From frequent references to my horse it may be inferred that I am rather foolish in referring to him as often as I do and perhaps using words of endearment & so on but what Cavalryman worthy of the name does not love his horse? I certainly do \n\n \n\nAnd I have always done so. No matter what horse I have had He is my very good friend\n\nSecond Lieutenant J. Wasson our Regimental Sergeant Major of other days is going to be our new Adjutant Lieutenant Norris I hear is going away soon. My old friend Billy Nelson the Signalling Sergeant of the 1st LH Regiment has obtained a commission in his regiment. Good luck to him! They have all climbed the ladder of fame and left me hopelessly behind in this mad rush for promotion. I have been a Sergeant since September the","101":" 1914. and I am still the Sig Sergeant They have all caught up to me and passed me. But I am not complaining I am just as happy. If I were an officer I should have to mind my P’s and Q’s too much. As things are I can go along unnoticed \n\n-","102":" Sohag. 1916 -\n\nThis afternoon about 3pm we \nhad\n experienced one of the greatest dust storms that has ever overtaken us in this benighted land so far at any rate. I have experienced dust storms in India and in South Africa. In the \n\nlatter place I have known the wind to blow at an average velocity of 80 miles an hour for as long as 3 days and nights without cessation. But for a real \"smotherer\" commend me to this one today. It was only a short one but I have never experienced its equal. For fully 20 minutes there was one continuous mad swirl of dust and a ‘hurricane. The Thermometer in the tent went from 112° to 70°. The Sergeants Mess tent for the third time in this Camp blew down. The wind has dropped now. (8pm) and the atmosphere is much cooler. 2 bags of parcels tonight. Appleton of \"A\" Squadron goes to the forthcoming school of instruction for Signalling at Zeitoun at the end of the month Also Campbell of \"B\" Squadron. I don’t give much for Appleton’s chance of passing creditably but I have every faith in Campbell. Tried to go myself but the powers that be would not hear of it.\n\nSohag.","103":"\n\n9 bags mail. tonight I was on leave just as they came in. Everyone was after me for mail and I had gone out but I heard all about when I got back some of them were nearly hysterical over \n\nnot seeing me for their mail . I always notice that those who wail the loudest invarably get no letters. They squeal like little stuck pigs when they cant get access to those bags. Oh! that infernal mail! I wish it in Hell – but I cannot get rid of the job at no cost I cant give it away.\n\nThe Armourer Sergeant gets worried out of his life about that mail He generally stops in the tent repairing rifles most times and whereas I am generally out They come to the door of the tent all during the heat of the afternoon when I am generally lying under the palms having a read or a sleep. If he happens to be lying down in the tent having a read or even sleeping they generally continue to wake him up and say \"Is the Signalling Sergeant In?\" No! says Kirk \"Is there any mail in? \"Don’t know\" again says Kirk. The dialogue generally ends by Kirk telling them to go - somewhere That’s why I get away from the tent as often as I get the chance. Hence Kirk’s annoyance. If they don’t want me they generally want Ferguson the Trumpeter Sergeant.\n","104":"\n\nThe weather has been nice & \n\ncool today. I suppose the clerk of the weather must have taken pity on for once. The trumpeter put his fountain pen down this evening and could not find it again he had intended writing a letter He said that he was in a good humour The end of the incident was he banged the writing pad down in disgust and walked out blaming us two for hiding it on him which of course is wrong. He has just come in still in a bad humour and the pen not found yet. \n\nSignaller Jones went to","105":" Inf Bde. Tel El Kabir tonight.\n","106":" Sohag.\n\nA new month and a new week. and off we go again. Nothing of unusual interest to record. Ferguson by the way found his fountain pen it was lying under the bed. \n","107":" Sohag.\n\nThe usual heat today about 100°. Took the horse out for a ride and gave him a swim in the Nile which was much appreciated by both of us. First time I have been in the saddle for over 5 weeks. Full marching parade tomorrow at 3.pm. everything \n\non. Rumour says that we are bound for the Canal Zone in a day or two perhaps less. Things happen with much suddenness these times \n\nI have given my saddle a much needed clean and made it in good condition for a possible move. I don’t think the next Camp can be much worse than this one At least I hope not. O’Halloran one of my Signallers came back with the last batch of reinforcements and he takes Jones’s place, who by the, has been granted a transfer to Colonel Glasgow’s Brigade at Tel.El.Kebir. as a Signaller\n\n7 bags of parcels last night to distribute and 2 more bags of mail tonight\n\n-","108":" \nTuesday\nWednesday 1916.Sohag. \n\nTurned out for an inspection this afternoon in full marching order preparatory to leaving the Camp Heavy dust storm this evening. but rather cool.\n","109":"\nWednesday\n Thursday. 1916.\n\nSame routine as usual. everything points towards a departure from this dust hole and the sooner the better. Although it will be \n\ntremendously hot with full kit up travelling in this hot weather May have to put up with worse yet down in that Canal Area What is in store for us?\n","110":" \nThursday\n.Friday.1916 Sohag.\n\nAbout 21 men went away today to the Artillery somewhere in the Canal Zone. They have left the Regt for good. They are the best we have got. Sergeants Locke, Galloway Uhlmann, Ferris-Scott. And some from C Squadron at Assuit Corpl McDougall my signalling Corporal of B Squadron has also gone. Balderson and Phillips two more signallers went as well. We are now \nIs \n I should imagine a supply regiment to make up deficiencies of other units. Those of us who are imbued with a feeling of \"pride of regiment\" very much regret all this. One does not care how soon ones own turn comes but were for many months a splendid regiment and we have done good service as such but now! Nuf sed!\n","111":"\nFriday\n Saturday 1916. Sohag.\n\nTwelve months ago today we had been paid The last issue of pay \n\nprevious to our departure for the dardenelles and the last pay day for a lot of the poor fellows. Rumours were thick in the air but we were not sure\n\nHowever today we had a big programme of sports and had it not been for the inevitable dust storm would have been a great treat instead of that there were blinding clouds of dust and ones eyes suffered very much.\n","112":" \nApril\n","113":"\n\nThe usual routine, with the exception that we had church parade at 6.30 pm. rather an unusual time it was quite dark when the service was finished I paid 20 piastres the other day to get my watch fixed up and it would not go for 5 minutes without stopping So I went into town tonight and interviewed that \"Ibne Kelp\" of a Jeweller and I told him in about 5 \nper\n minutes what I thought of him. He did not understand one word of English and my Arabic was limited however I conveyed to him my feelings. He set to work and fixed it up right away And after calling him a few \n\nchoice names (which I have acquired) in Arabic I departed\n\n3 bags of mail. \n\n8th \nApril \nMay Monday. 1916. Sohag.\n\nWeather very hot today the thermometer in the tent registered 110°. Not bad for the shade. My horse fitted with new shoes and he also had a good swim in the Nile. I had one also and chanced the disease known as BILHAZIA ANATOBIA I simply couldn’t resist having a splash.\n\n8th \n April\nMay. 1915. Heliopolis\n\ntonight at about this time 8pm we all had our packs on our backs and were just going down to PONT DE KHOUBBA Railway Station for Alexandria en route for Gallipoli little did we know what was in front of us that night we marched out of Heliopolis full of life and with a light heart (and a heavy pack) Most of the lads pretty full and merry. We had volunteered to a man to leave our horses behind and go across to Gallipoli to help our comrades of the Infantry who had suffered so cruelly at the \n\nhands of the enemy during the early stages of the Campaign Their wounded were coming back in train loads and that gave us greater determination to go forward. Let us get across to Gallipoli and take the pressure off them was the thoughts of us all. Appended is a list of the Signallers who left with me that night and what happened to them all in the twelve months that have elapsed. for my own part I have gone through the whole Campaign and am still going strong. \n\nSTRINGER\nwent through as well although he went off the peninsular for a while with dysentery. \nABERCROMBIE\n got shot through the jaw and returned to Australia \nFINLAYSON\n contracted dysentery and was in England for 7 months He has only just returned. \nBORTON\n dysantry went to England and now is a commissioned officer \nWRIGHT\n went to England with dysentry and he too has a Commission. \nJENKINSON\n the same as the other two Commission as well. \nWILSON\n went through safely and is now Signalling Corporal of C Squadron. \nMOURITZ\n went into C Squadron a few days before going to the front and got killed in a bayonet charge.\n\n \nINSKIPP\n went through safely and was sent to \"A\" Squadron lately on account of reduction of Signalling Staff \nHOWARD\n went through safely and he \nhas\n was returned lately to \"A\" Squadron for the same reason but yesterday he came back to the staff to fill a vacancy. \nCORPORAL SMITH\n got wounded at Quinns post on 7th August during a charge and went on detached duties at Cairo. \nO’SHEA\n shock to system same date gone to England since August. \nHANSON\n transferred to 15th Batallion with Lieutenant(now Captain) McStarry. McAllister Killed in Action. \nCorporal ARMSTRONG\n was away sick for a good while and is now Sergeant Major in the Camel Transport Corps at Ismalia. \nBADDON\n went to England sick and has now got a commission. \nGROVE\n went through safely. And is now a Commissioned Officer in the 13th Infantry Brigade \nMc DOUGALL\n went through safely although he was wounded twice and has now transferred to 4th Artillery Division at Tel El Kebir. \nCorporal CROWE\nwounded (severely) the second night we were on the peninsular he has returned to Australia \nHEATHCOCK\n went to England sick has not been seen since. \nDINGWALL\n went through safely and transferred to 1st Signal Troop now in hospital with rheumatism \n\nBALDERSON\n got wounded by shrapnel in the back on the 7th August came back after and has now transferred to 4th Artillery Division at Tel El Kebir.\n\nMOSS\n had the most interesting career of the lot. To start with he joined the Engineers at Enoggera as a signaller and was sent to Melbourne for a course of signalling at Broadmeadows Camp. He with some others got drunk one night and the next morning Major Mackworth the Director of Army Signals passed them all out. Moss came back to Brisbane just in time to stowaway on board the \"Star of England\" along with the regiment. I saved him at Melbourne and got him into the regiment as a signaller. We came to Egypt and one day when we were doing some mounted drill his horse bolted. In the course of a mad gallop he hit his hoof against a stone and broke his leg below the knee throwing Moss and falling on him. Moss’s foot was hurt but no one suspected it was broken which was unfortunately true he always had a very bad limp when. We left for Gallipoli he was left behind \nbut \n and had passed a medical board and \n\nwas being sent to Australia for discharge He eluded them somehow and months afterwards he turned up again on the peninsular. When half the regiment went away to Lemnos Island for a spell on the 12th November 5 weeks before the final evacuation he went and reported sick and again passed a medical board for Australia. The next news of him was that he was employed as a chief fumigator in one of the big hospitals on Lemnos Island. The next chapter is where he turns up unexpectedly at Heliopolis Camp after we had gone way. The next chapter sees him transferred to the Artillery and after that he gets sent to France and the last chapter up to date is that he has been in action in France and has been wounded.\n\n9th \nAPRIL.\n May TUESDA.Y 1916. Sohag\n\nWind and dust and heat as usual all day. Rumour says that we leave this benighted Camp on Friday. perhaps we may go to a worse well I am doubtful if anything \ncould\n be worse. It certainly cannot be hotter as I don’t think we are going in the direction of Khartoum but rather the other way.\n","114":" \n\nCame down from Cairo this morning. we entrained at Pont de Khouhba Railway Station some distance out from Cairo. Travelling in the train was a squeeze I well remember. I took off my heavy pack and accoutrements and got down under the seats how I got in I cant now imagine but I squeezed in there somehow and had a fairly good sleep. Arrived at Alexandria at about 7. A.M. got out of the train and had a long wait during which time I went in search of something to eat. which I found at a coffee stall along the dock it was managed by some English ladies belonging to the Y.W.C.A. They did us very well everything good and cheap. About 9.30 AM. stacked our leggings in a heap on the wharf and got issued with a pair of Infantry pants and putties. I had just got my gold wrist watch repaired a day or so before leaving Cairo. I went in swimming in the sea had a good time, came out and stood on my clothes to keep my feet out of the sand and naturally stood, full weight on my precious watch with the result that I smashed the glass and hey presto finish watch! I brought back that watch to Cairo \n\nnearly 8 months after but the works had got corroded through jumping into the sea at Anzac Cove. However the Ship was soon packed up It was the P&O liner DEVANHA She certainly was not a credit to the crack P&O line. She was the dirtiest of old hellpacket outside or in that I ever saw. That did not matter I suppose. she had been used probably since the beginning of the war transporting troops wounded Etc. and she was in a most filthy condition But we were soldiers going straight into the firing Line right into death and disaster and so the dirtiness of the old DEVANHA did not trouble us much what troubled me was that after having a good time for 5 months in Egypt on good food. I was suddenly recalled to a sense of my surroundings by being suddenly put on bully beef and biscuits – ugh! Couldn’t get a drink of tea that was the worst punishment. We just had to \"pig it\" anywhere on deck and do the best we could. Later on in the evening we steamed out of harbour and headed for Gallipoli. \n","115":" \nApril.\n","116":" Sohag.\n\nSame routine\n\nMaking preparations for departure \n\n10th \nApril\n1915. May \n\nOur first night on the SS Devanha and outward bound for Gallipoli We had very little news as to the true state of affairs then existing.\n\n11th \nApril\nMay. 1916. Thursday. Sohag.\n\nThe weather has been somewhat lenient today no dust blowing about and the temperature only 106° in the tent so we are let off lucky. We leave for KANTARA in the Canal Zone on Tuesday 14th getting there next day. So the orders say.\n\n11th \nApril\n May 191 1915.\n\nAll day sailing through groups of Islands in the Aegean Sea which lie off Gallipoli. About 2pm the Dardenelles in Sight faintly discernable in the distance and as we draw closer small black dots can be seen which are the warships of the Allied Fleet. Coming closer again one can faintly hear the larger guns exploding and faintly see the shells bursting on land. After about an hours steam we drop anchor close to a couple of formidable looking battleships which are pouring in broadsides into the \n\nland forts. Great columns of smoke. And dust and debris go skywards as each shell explodes with seemingly deadly accuracy Several of the latest type of British Super dreadnaughts can be seen in Action, among them being the \"Lord Nelson\" and \"AGMEMNON\"\n\nTorpedo boats and torpedo boat destroyers fly hither and thither like water bugs. They circle round the Dreadnaughts keeping a sharp watch for submarines And Despatch carrying from the Commander In chief to the outlying ships \n\nThe land batteries of the Turks from the Asiatic side of the Dardenelles have opened fire! Shell after shell come through the air with a loud long wail and plonk! into the sea Great columns of water go skywards for hundreds of feet Some of them fall perilously near the decks of the attacking fleet. But so far as I can see none are struck. Two Allied Aeroplanes are soaring over head like giant eagles watching the result of the bombardment and signalling the results by means of smoke bombs dropped from the aeroplanes. All is now excitement aboard. we are All longing to get ashore to do our little bit however much it may be. We can plainly see the troops on shore who have bivouacked\n\nNear the point (Cape Helles.)\n\nGreat piles of boxes (Bully and Biscuits) are very noticeable also lines of horses and mules. The Land batteries are hammering away for all they are worth\n\nWounded now coming off and fresh troops going ashore. Here is life indeed! This is what we came here for! Yes we all; I am sure realize that now is the time when we face the stern realities of life and that we are up against it. We have waited the best part of an hour for orders and they come at last. Up anchor! go further up the coast. Then we know that we are to go ashore at the celebrated Anzac Cove immortalized by our gallant comrades of the Infantry 14 days before. Night comes on and everywhere can be seen the Electric Signalling Lamps of the warships as they signal various instructions to each other probably about ranges and location of shots and fresh places to fire at & so on. Nearly all in code. I tried to decipher it but no\n\nchance the Navy know their work too well for that.\n\nAbout 9 oclock we dropped anchor and remained for the night One more night of safety!\n\n\"Prepare to leave the ship at 7 AM\"! Comes the order \"Have all your packs ready to slip on and don’t waste any time\" We unroll our blankets and (well I wonder do we \nall\n sleep that night?) I wonder! \n\nI sat on my blankets and looked over the rail of the troopship towards the rough outline of hills in the distance faintly silouhetted against the skyline and the rattle of machine guns on both sides and the continual cracking of the rifles was about the only sound that could be heard. Occasionally a gun would go off and perhaps followed by another. The sound would echo and re echo through the hills That was the music that lulled me to sleep.\n\nHold on you brave lads who have fought so gallantly and suffered such heavy (nay frightful) losses since the dawn of that 25th April we are coming to your assistance Hold them back. We know that every hour you are getting weaker but hold on lads until \"tomorrow morning\". There\n\nis only one Brigade of us but we can be depended upon to do \nour\n little bit and to relieve the great pressure and give some of you at least a much needed rest.\n\n12th\nApril.","117":" Sohag \n\nC Squadron left Assuit and are now somewhere in the vicinity of Kantara Stifling hot. The temperature 106° Not a breath of air! Oh! let it be soon!\n\n12th\nApril\n MAY 1915 Gallipoli Peninsular\n\nAwake! For morning in the bowl of night, has cast the stone which\n\nPut the stars to flight\n\nAnd lo! The hunter in the East\n\nHas caught the Sultan’s turret in a \n\nnoose of light\"\n\nI don’t know about the \"noose of light\" I do know that it was pouring rain and most of the men had a good start by getting their blankets wet. I awoke with a start to hear the order \"now don’t be too long get your packs on and get ready to go ashore\". The torpedo Boat destroyer was just coming alongside and making fast \n\namid the downpour of rain \n\nEveryone was up and doing and all prepared to leave the troopship. The deafening cracking of machine guns and rifles and the duller sounds of hand grenades and artillery fire were as heavy as the night before. The landing place looked most formidable and I should have thought it impossible to effect a landing in such a rough spot. To the right of Anzac lay the low lying beach of Gaba Tepe but we found out that that particular inviting looking place was one mass of wire entanglements even for many yards out in the water. And to the left again stretching towards Suvla Bay was level ground. And it has since struck me as remarkable that they did not land there. However no time for moralizing \"First Light Horse get down the gangway on to the torpedo Boat destroyer\" was the order. 1st Light Horse to go first. That was good news as for my part I had no particular desire to go ashore so early and in the rain Besides I wanted to get some breakfast before going that is Bully Beef \n\nhard biscuits and water can be called breakfast. In a few minutes the 1st Light Horse Regiment were on the boat and away they went. We stood against the rail and as thought we were never to see them again we said \"goodbye boys Good luck!\" not seeming to realize that as soon as they were emptied out and the boat returned our turn would come. We stood fascinated watching the shells of all calibres plonk into the water having overshot their mark or were aiming at the boats which were bringing reinforcements. We also watched with much interest a field gun planting shells all along the place known as Anzac Beach. It was our old friend Beachy Bill who now has a world wide reputation. His place of abode was Gaba Tepe or somewhere in the neighbourhood Anyway wherever he resided all the Ships of the King’s Navee and all our shore batteries and our aeroplanes and in fact every device known to us could not shift nor knock out Beachy Bill.\n\nHe was there when the troops first landed on the 25th April and the night I evacuated the peninsular the 18th December one of his shells as a parting salute hit the lighter which took about 400 of us off. So as I say we watched Beachy Bill at work.\n\nLater on at about 9 oclock the rain had ceased and the torpedo Boat destroyer came back for the last of us, we descended the gangway and packed on board the little vessel. and soon \nfounding\n found ourselves gliding towards the shore.\n\nLanded safely. And luckily for us Beachy Bill did not interfere with us We got under cover and were there for a couple of hours. After that we packed up and took the track up among the hills and eventually reached the dreaded Monash Gully. We had to go in single file and run from side to side of the road, there being at that time no sand bag barricades. We then took a turn to the left and got into a small gully somewhat protected from snipers fire although it was \n\nhighly dangerous to poke one’s head over the top of the bank. But I am anticipating\n\nOn our way up the gully we halted just at a point where Monash Gully led straight towards the Turkish snipers and we halted while the Colonel went forward for orders which lasted some time. During this spell which was much needed owing to our much too heavy packs we took cover on the side of the road. And took stock of our surroundings. Stretchers were coming along constantly with wounded men. Some of them were able to walk thereby saving much work. One young fellow I was much interested in He had been shot in the face The bullet had penetrated the right nostril and had cut a passage along the left side of his face coming out at the cheekbone. He was contentedly strolling along smoking a cigarette and seemed in no particular\n\nhurry to get down to the beach. Doubtless realizing that it would be sometime before he came back again and was taking his time. He was a cheerful sort of man. Some of them were not too cheerful. Poor devils their wounds were too serious for joking although if possible they always had something to say or were nearly always enjoying the inevitable cigarette.\n\nThe first Light Horse Regiment went straight on to Pope’s Post and relieved the Naval Division who came down the valley and passed us. The poor devils were covered with wet clay and bearded and their clothes were torn to rags through charging through the thorny bushes. They had come to the aid of the hard pressed Australians and now we came to relieve them. They went on down the coast and were soon in action at Cape Helles. So for the first night the 1st one out of 221 for me we laid us down to sleep amid the music of shells bullets and the rattle\n\nmachine guns and hand grenades.\n\n 13th \nApril.\n","118":" Sohag\n\nB Squadron left today by train for our new Camp on the Suez Canal to night we have packed most of our gear and are sleeping in the open and we leave tomorrow The weather has been very hot today the thermometer has been as high as 115° in the tent.\n\n13th\nApril\n","119":" Gallipoli Peninsular.\n\nUp and doing! About 9.30 after we had breakfasted on bully beef and biscuits By the way that meal was the cause of the filling coming out of a particularly bad tooth and so there was an open place there for nearly 8 months after However we packed up again and made our way up the dreaded Monash Gully. And turned up the steep side of the hill to the right which led to Quinn’s Post absolutely the worst post on the whole peninsular. It was held by the 15th Batallion who were war worn and wanted badly \n\nto get a rest and were only too glad to hand the post over to us. I had to take over the telephone and I had the responsibility of all communications suddenly thrust upon me. During our previous training in Egypt we had never been instructed in the use of the telephone and it came rather as a shock to be suddenly told that I had to take it over. I went into the telephone dug out myself and decided to take the first watch I did not know how nor where the lines ran nor what the calls of the neighbouring posts were and while I was finding these things out. Brigade office calls up and says \"Message for you!\" Righto says I. The message taken down and a message to go back and another one from Brigade and so on. It took hours to get things straightened out . Everything strange and novel and the rattle of guns and bombs and bursting shells it was almost an impossibility to hear what was being said on the phone. The interpreter who came with us from Alexandria suddenly received a message from Brigade Office recalling him. And the next thing was that \n\nsomeone saw him being marched down the beach between fixed bayonets. A spy!\n\nThings were distinctly lively that morning and after about half an hour in the trench they started coming out some able to walk some not. Then it was hell’s own work getting the poor fellows out The trenches were so narrow and the parapet so low they were carried out on blankets. or oil sheets\n\nAbout 2 pm General’s Birdwood and Godley paid the trench a visit and General Birdwood whilst looking through a periscope had a Turkish bullet through it splintering the glass and he had to have his head dressed \n\nI don’t know whether it was revenge or not but he touched the bayonet of one of the men of C Squadron and said We’ll give them a bit of this tonight lads\".\n\nThe Turkish 75’s\" were bursting on our post with deadly accuracy the whole time and it was \nsimply\n astonishing\n\nthat we were not knocked out altogether. I have never experienced such accurate shooting. These 75s\" commonplace were not to use a common phase bursting \naround\n us they were bursting \non\n us! Shell after shell would burst right on top of us but strange to say there were few casualties. Up to this time we had sustained something like 50 casualties so the Brigadier decided to send for several companies of the 15 Battallon to come back again and reinforce us. We left our C Squadron behind for duty there.\n\n 14 \nApril\n May. SUN.In the train between Assuit and Cairo.\n\n8.p.m Train (shaking very much) We packed up and got away from Sohag this morning. Leaving the Station \n\nat 2 p.m. The last party (A Squadron) is following behind about 4 hours. Full marching order strapped and weighted oh! the heat \n\nIt was a happy time Just glad to get the things off. Oh! this shaking of the train!\n\n14th \nApril\n May. Gallipoli 1915.\n\nWith the exception of C Sqdn who were left on Quinn’s Post we all withdrew from the post and were sent down Monash gully and up one of those water sheds which the peninsular is so famous for. I found a dug out and after I had made some tea I turned in for the night. Orders were issued to the effect that nothing was to be taken off in case of a sudden stand to. However I went to sleep and I was awakened about 2.30.AM The time C Squadron was going over the parapet \n\nand scattering the Turks with the bayonet. I have never heard the like of it for noise. It was something fearful.\n\nAt about that time they started shelling our little retreat and what awoke me was those 75 Shells bursting among us and I believe there was larger shells among them. They burst with a reverberating crash which was nothing more or less than terrifying. I honestly admit that on that night I got my one and only real fright on the peninsular. It seemed so uncanny. There was I lying in a dug out all by myself and perhaps 10 yards or so away from the next man I felt as though I was the only solitary man left upon this universe. The last man and here they were trying to get me with their shells. The turks must have had information that night about our bivouac because that particular spot \n\nwas never shelled. C Squadron came back from Quinn’s Post just after 6.a.m. and a sad spectacle they presented too. About 27 men were lying in front of the trench dead and are still there and very large part of the \nreman \n remainder were wounded and were being carried down to the beach. Those men of C Squadron had had no sleep the previous night and then at 2.pm or thereabouts they were ordered to get out over the parapet of the trench and they were out there in front for over two hours and just at daylight the lucky ones got back. \n\nYes. I think the 2nd Light Horse Regiment have done their little \nbit. And have justified their existance \n\nThat’s what happened 12 months to night and to night 12 months after I am riding in the train from Upper to Lower Egypt the war still on and we are going to a fresh Camp nearer the Suez Canal.\n\nNext Twelve month?\n\n15th \nApril\nMAY. 5 days after discharge! MONDAY. KANTARA.\n\nIt is now 0640 and a lovely cool breeze blowing and we are just settled down for our first night bivouac at Kantara in the Canal Zone. Well I dont know what to think so far it’s a long way to go for water and the sand is soft. The night breezes are a treat here although it is hot during the daytime. We are informed that we must be prepared soon to move out into the desert\n\nperhaps tomorrow at latest Then it means heat, Soft sand, Bully beef, Biscuits. one water bottle of water per diem flies. perhaps bullets or shells and inconvenience The Turks having been making things rather lively lately on account of the Russians coming down from Asia Minor and advancing on Bagdad.\n\n15th MAY 1915 Gallipoli Peninsular\n\nEveryone had a rest today C Squadron especially 3 days on Gallipoli and already had 30 men killed and more than that wounded From now onwards for about 17 weeks we took turn about in the Pope’s Post trenches opposite Quinn’s Post The 1st 2nd and 3rd Light Horse Regt held Pope’s Post up till the beginning of August then we went into Quinn’s post again and got cut up the second time.\n\n","120":" KANTARA.\n\nWent out of Camp at about 8 AM. And went over near a fresh water Canal where a great many trees are growing making good shelter places for the horses Have been having \n\na good swim in the Canal and about 30 of us got our names taken for bathing oh what a shame! We are to be punished for trying to keep ourselves clean when we have got the chance we may not have a chance in a couple of days. The natives are disporting themselves in the water and its quite clean but Someone says we mus’nt & so we must’nt but we will nevertheless The major who caught all us criminals reminded me of some prim and particular old school marm who has suddenly discovered all her class of young ladies openly swimming!\n","121":"\n\nHot winds blowing off the desert. Went out from Camp and took shelter under the green trees on Canal bank.\n\nDidn’t go swimming in the prohibited water today! But had a good swim in the Suez Canal instead. Quite legal! Large P&O Liner came past when we were in the water. loaded with Japanese troops and some English nurses bound for that unknown destination – Somewhere!\n\n18th MAY 1916. Thursday\n\nI am writing this on the banks of the Suez Canal at about 4.30 A.M. We were turned out of bed this morning at 1 A.M. had an early breakfast and saddled up we came from the Camp back to Kantara about 2 miles and were supposed to cross the canal by the pontoon bridge which is swung over for that purpose. The actual wording of the Regimental order was.\" The column to be across the Canal by 3 30 AM. it is now about 5 A.M. and we are sitting patiently on the bank waiting for that bridge to be swung across. Oh the woodenheadedness and cussedness of officialdom. Someone has apparently blundered over that bridge \nIn\n It means that we have 7 miles to trek and the longer we wait here the \nlonger\n hotter it will be when we have completed that aforesaid 7 miles.\n\nHooray! The bridge opened at last! Since one oclock we have been waiting 6 oclock exactly when the pontoon swung across We crossed and went out of Egyptian territory into Asia So now its going to be \"Somewhere in Asia\" instead of \"Somewhere in Egypt\" The Censor ought not to complain about that \n\nWe went about 7 miles out good hard road with plenty of traffic (All Military) A line has been pushed out about 30 miles and they are thereby enabled to get supplies Etc to the firing line Pitched Camp on a place known as \"Hill 70\" just a mere sand dune We are here for an indefinate period. No sooner had the Camp pitched than Brigade lays a line and installs a Telephone which must be worked continuously the whole of the 24 hours. Stringer through having a bad leg has remained at Kantara to look after sick horses Felt very tired and sleepy and was glad to get to sleep.\n\nHad to detail 4 Signallers for patrol duty at 5 oclock in the morning.\n\n19th May Friday Camp Hill 70\"\n\nReveille at 4.45 A.M. The place is not too hot there being a constant Sea breeze coming off the Mediterranean they are quite a treat. .. 8 bags of mail came today \"A large & fashionable crowd assembled\" as the papers say No letters for self as usual. The\n\nonly letters I get generally are such as \"Dear Sergeant if you have any letters Etc for me please send them on to so & so Etc.\" or else a complaint about the loss of someone’s parcel sometime back in Gallipoli which are quite impossible to trace. A good deal of correspondence must be waded through on such occasions. when everyone was comfortably in bed last night a sudden order was launched forward \"Fill all nose bags in case of a sudden bolt off in the night and all water bottles to be filled\" A prisoner was bought in by the 5th Light Horse that accounted for the scare. If we \ndo\n make a sudden bolt some of these nights the amount of gear left on Anzac Beach during the evacuation will be nothing to what we will leave behind. Received from 1st Signal Troop to day 5 new telescopes 10 flag poles 1 lamp Complete. Heliographs are now what we are in need of. The temperature for the past few days has hardly exceeded 86° where as at Sohag it frequently reach 116°. \n\n20th MAY Sat. CANAL ZONE.\n\nSame routine nothing to report. \n\n21st May Sun Hill 70.\n\nPatrols from this regiment go out \neach\n every second day and there is also a party of signallers go out they get into communication with the troops who are on out post on either flank. The sand there is deep and soft making walking very difficult it is the same as Wardan. There is no dust and we get some fine sea breezes off the Mediterranean which blow during the hottest part of the day making life in this benighted spot bearable. There is no amusements of any Kind. But we are always very much occupied with our work and therefore time does not hang heavily on our hands There is a persistent rumour that we are to go forward and relieve the 2nd Brigade. I don’t know how much truth there is in it. From a Signalling point of view we are in a bad state of unpreparedness \nespecially\n compared to the 3rd Light Horse The reasons being (1) We have no Signalling Officer (The 3rd LH have one). \n\n(2) Not being able to train to train extra men Through excessive heat in Upper Egypt (3) Signallers being allowed to transfer to other units leaving their places blank to be filled with men of no experience \n\nThe only remedy now I consider is \n","122":" A Signalling Officer to take complete control (2) The whole of the Signallers to be on one line together and not as is at present the case.\n","123":" Hill 70.\n","124":"\n\nBrigade Signaller Officer came over today and had an interview. The result is that all Signallers are to go on one line under my charge. At last! after over 18 months agitation I have at last got what \nwhat\n was necessary.\n\n24th May. Wednesday Hill 70. 1916\n\nBeen busy all morning in Collecting the various Signallers of the different\n\nSquadrons and those of Head Quarters making a new line for the horses \n\nAt 9.30 all of them were on practice I also had 6 extra men who are just learning the gentle art of Signalling I have solemnly warned them that it is not a bed of roses as they will find out before I am done with them They are very apt pupils so far.\n\nAppleton came back from the School of Signalling at Zeitoun. He failed ignominiously as I knew he would before he went. \n\n24th May \n1916\n 1915. Gallipoli\n\n\"Armistice this day when thousands of men on both sides were buried 3000. \n","125":" Hill 70. \n\nThousands of letters came in last night It took hours to distribute consequently I was extremely busy redirecting the sick and detached mens letters this morning. We are moving off from here soon. The 3rd Light Horse Regiment goes \n\nfirst. We are very short of men in the 2nd. And I think thats the reason we are staying behind for a while it may only be days Full marching order parade this after noon to see if we all have our complete equipment No signalling in consequence of the projected departure.\n\nRafter returned from Cairo\n","126":" bags of mail Everyone happy bar me! \n","127":" Hill 70.\n\nWe greased all straps and leather today. Four Complete Signal Stations told off so as to travel ready for work Must take no chances now we are soon to be up against it and some of these raw lads will be put to the test. I have had my test – and passed!. Reveille sounds at 1 oclock in the morning it does not of course Sound because no bugles are Sounded but that is the time when we must \"rouse out\" 140 rounds per man to be carried. I have \"snared\" an extra water bottle which will come in handy.\n\n27.th","128":" Romani\n\nWe turned out of our blankets at 1.AM. this morning and got packed up and at about 3AM we \n\nstarted on the trek for our new Camp known as Romani (pronounced Ro-marney) This spot is on the advanced front and the Turks only are in front of us but a good way off probably 20 miles at least The place is particularly well guarded and strongly patrolled for miles around a perfect screen is thrown out we are taking no chances in fact we never do; we know the Turk by reputation having met him before. The unfortunate Gloucester Imperial Yeomanry were badly cut up just about here through taking the Turk too cheap. From Hill 70 to here is about 15 miles but what with the twisting and turning going across the sandy desert we probably went 20 miles. Everyone experienced great difficulty in keeping awake during the long and tedious and hot march Great sand dunes are on all sides of the Camp and we are Camped down on a hollow close to a clump of palm trees. The sea breezes here are the same as Hill 70 and they are just lovely they make life worth living. Had about 3 hours sleep to day after the horses were finished with \n","129":" Romani.\n\nAwakened this morning at 3.30 AM. All hands \"Stand to Arms\" That joke was not so bad on the peninsular because after the dismiss we could all go back to our dug outs and have another sleep But here we have to \"Stand to\" from 3.30 A.M. and then when dismiss sounds go out to water and carry on with stables no going back to bed any more. Everyone took some shifting this morning. Its always the same on the first occasion \n\nTomorrow they will be getting used to it more. I have got 6 supernumeries in training The sun is hot here but there are constant sea breezes especially in the afternoon. Three patrols went out at daylight this morning Finlayson Dorricott Smith and O’Halloran went with them. We are issued one gallon of water per diem here as it has to come from the railhead three quarters of a mile away on Camel back through heavy sand \n\nThere is just enough water for our Consumption but none to spare The horses get water out of the wells and the water is brackish and unfit for Human Consumption being \n\nimpregnated with alkali. They have taken Parrish away from me to go into the orderly Office but I have got Butler back in his place \n\nReading The Governors by Phillips Oppenheim\n","130":" Romani.\n\nHave been busy all day with these supernumaries. And tonight 6 men went out with night outposts They remain on duty until 5 30 tomorrow and as soon as they come in two are to go out immediately with a photographer: Modern warfare indeed. The remainder are to get out of bed at 3 AM. And feed their horses and have a drink of tea which will be prepared and at 4 A.M they go out with a Squadron on day patrol At present I cannot see how on earth we are to go on like this we are down to the last signaller and we have none to call upon, we are hoping for reinforcement signallers to come from our base details at Tel El Kebir. If about 2 or 3 of them go to hospital then we are in \"some\" fix. I suppose the only thing to do under the Circumstances is to muddle through somehow we have been in tighter places before. \n","131":" Romani.\n\nAwake at 2.30. this morning got saddled up. 6 signallers already on patrol (night patrol and 4 others to go at 4am. and the remaining 2 at 6 AM. The party of Signallers to go at 4 oclock were late and nearly missed the patrol. Great rushing around for 5 minutes. I was all on my own all day and I took advantage of that by having as much sleep as possible. Flying Machine came. close overhead and dropped a message and sailed away again\n","132":"\n\nThe whole Brigade turned out at 10 oclock last night and we took part in one of the longest and most tedious night marches I have ever participated in \n\nWe moved out in column of route in an easterly direction. The night was dark and we only had the stars to guide us. \"Stop Talking\" and \"stop Smoking\" was the order we marched across the desert, the soft sand over the horses’ fetlocks all the while. The country\n\nhereabouts consists of sand with occasional bushes scattered about There are small ridges and sand dunes A halt was made for 10 minutes each hour which is the usual practice. Our intention was to surprise the Turkish Outposts and Kill as many as possible destroy all stores and make as many captures as possible We had to go on a strong reconnaissance to a place called BIR. SALMANA and HOD SALMANA about 25 miles East of Romani According to Operation Order 402 it states \" Any serious engagement with the enemy Must be avoided \n\nTROOPS\n N Z M R. Brigade and one gun AYRSHIRE R.H.A.\n\nCovering Troops\n.1st Light Horse Regiment","133":" 3rd and 5th A.L.H.R.\n\n140 rounds of ammunition per man to be carried water bottles full and a days rations.\n\nWe being the main body travelled all night from 10pm. to 5.15 this morning when we \n reached a place called OGRATINA. We off saddaled and had a feed and a rest for two hours We saddled up and set out for our Camp at Romani we had apparently accomplished nothing and as far as the main body was concerned that was true. We were in support \n\nof the New Zealand Brigade who however sprang upon \"Jacko\" at dawn and killed about 20 of him and wounded some others. They did not follow up they were ordered not to do so. It might seem ridiculous to send out about 5000 men with dozens of machine guns and a flock of aeroplanes just to kill about 20 men but had only one brigade gone out the probability is that they enemy might have given much trouble and this old caper of sending a boy on a mans errand has had its day especially with Australians We have been caught before.\n\nA lot of the men were terribly sleepy on the return journey. The sun was hot and we were heavily weighted with our marching order. For my part I know I had my water bottle (full) Haversack with rations in it. Bandolier with 90 rounds of ammunition waist belt with bayonet and four pouches with 50 rounds in them making 140 rounds all told. a pair of field glasses a Telescope and a prismatic Compass. We reached Camp about 3.30 p.m. Thoroughly tired out. But it was an experience \n\nThe pack horse carrying the canvas horse trough got \"bushed\" and wandered over the face of the desert joining up after the sun got up. \n\nWe all thought they would be on their way to Jerusalem as prisoners of war 5 bags of mail to night. After a strenuous time of over 12 months with and after various vissititudes I have at length managed to hand it over so now the lads can pester Sergeant Rafter the saddler Sergeant. To bed early to night.\n","134":" Romani.\n\n3 oclock out of the blankets and Stand to arms Cameron & Butler gone out with a patrol which has gone to Quatia. \n\nAt 6.30 AM. A Taube came over, great bustle. and confusion for a while The first bomb which came down wrecked the wireless Station I was leading my horse away and just as I was passing the anti-aircraft Gun it commenced to fire away went ‘Pharoah’ went for his life I let him go and went at my best pace out of the Camp but progress was slow with soft sand over the ankles \n\nThe second bomb struck in the Centre of the Camp killing 5 men including 2 Officers and seriously wounded about 10 others and 27 horses and a camel I was going away from the Camp and one bomb hit just in front of me they make a frightful whistling sound \n\nwhen they come down from thousands of feet. The Brigade Signalling Officer is wounded. The horses which were killed were very badly chopped about. Barry one of my Signallers was leading out horses and when the first bomb went off his horses went off too and in the scramble he got kicked in the head had to bandage him up \"Pharoah\" is still missing he is the only uncaptured horse up to now. I went out looking for spare horses and came across several saddles. Kicked to pieces. Hundreds of horses stampeded and went careering across the desert.\n\n 8.30 pm. Stringer has just come in from outpost and reports that the telephone has refused duty and he has to change it. They are a rotten class of phone (Stephens) No chance of getting any other \"Pharoah\" is still missing up to now and I fear may have galloped himself to death as he is very fond of a gallop. Hope to recover him tomorrow. Eight men up to now are dead as a result of the bomb dropping this morning also 27 horses we have heard that the 5th L H Regt and the NZMR suffered a \n\nSimilar fate to day. The Brigade Signalling Officer Lieut Smith was not killed after all but wounded. The other officer in the tent was killed and a third was wounded. The safest plan on such occasions is to drop flat on the ground thus minimizing the chance of being struck by flying fragments.\n\n2nd June Friday Romani.\n\nWe buried 9 men including \ntwo\n one officers yesterday evening and the Camels were yoked to all the dead horses(27 in all) and taken away and buried So the man bird succeeded in getting 9 men killed and about 5 men wounded 27 horses killed and 10 horses wounded with one out of the 8 bombs he aimed at us. No details as to how other units suffered \"Pharoah\" came home this morning looking quite well and in good Condition after his mad escapade I was quite pleased to see him back again Signaller Boyer transferred from the 3rd Light horse to us today That makes one over strength but it does not matter we shall require them all. About 1 oclock today we had a bad attack of the ‘Jim Jams’ The Squadron Sergeant Major of B Squadron \n\nshouted to the men of his Squadron to Stand to their horses as they were moving their line. The remainder of the troops hearing the order \"Stand to your horses\" naturally concluded and concluded very quickly too that that a hostile aeroplane was descending on the Camp Instantly the Camp was a mass of men bolting for the horse lines to get clear of the threatened danger. Of course the situation was soon explained and it was considered a good joke\n\nAbout 10 oclock last night the Sudden order came \"Stand to your horses! \"Saddle up\"! Everybody flew every which way as Mark Twain says and amidst the bustle and confusion of Saddling and standing to arms in the dark the equally sudden order came \"dismiss!\" \n\nSomeone, we don’t know who yet suddenly gave the order to stand to arms without cause and without authority. Later – The man who played a serious practical Joke is now under close arrest pending investigation. Got paid today 300 piastres The YMCA have a large marquee tent and they have been doing a roaring trade I should imagine as fast as the pack camels can bring goods up they will be sold. The railhead is about ¾ of a mile away and all stores are carried to our Camp from there by camels. \n\nThe Regiment was late standing to Arms this morning at the usual time 3.45 so now we must we must be out on the parade ground \nat\n 3.45 and not start saddling up at that hour. \nHell\n! That means I must get up at 3.AM. to wake those men of mine some of them are \"pearls beyond price\" at the gentle art of getting up. at no matter what time one cant find his Socks another has mislaid his boots another his pants & so ad infinitum. They will persist in tiddly- winking with bootlaces and tucking in the ends of straps and messing about generally with such finicky things instead of \"a-woppin of em on lively\" and getting out. Never mind they’ll learn I tell them, that the Turks will bayonet them in their pyjamas and night-caps some of those nights if they don’t get a \"wriggle on\"\n","135":" Romani\n\nAwake at 2.45 this morning I made sure of getting the lads out bright and early 6 Signallers gone out on patrol one lot going to Hill 110 and the other to No 2 post. No aeroplane scares today. although a rumour got afloat during the afternoon but nothing doing Started again with those 6 supernumery\n\nSignallers. Have had them on the mysteries of the heliograph very intricate work. There is still about half a dozen of our horses still out yet including the two which belong to the Adjutant (Lieut Wasson) \"Pharoah\" is none the worse for his escapade I think he made for the nearest feed-stack and stopped there He has only one ambition in life and that is a full nose bag.\n\nThere is now a telephone installed in our regimental office connected with Brigade Head Quarters I don’t know how we are going to manage with the amount of men at my disposal \n","136":" bags of mail came tonight It seemed quite strange not having to sort it out. Sergeant Rafter now struggles with the mail I give him every assistance \n\nThe patrol which went out this morning to Hill 110 got a severe attack of the \"Jim Jams\" They saw in front of them a group of men and mistook them for Turks So after a hasty consultation and spreading out an generally getting into a state of preparedness they advanced boldly to the attack when they got close they discovered that the body of men were \n\nonly the Survey party! So they heaved a deep sigh and resumed their march.\n\n4.th","137":" Romani\n\nSomeone says \"The best laid plans of mice & men Etc\" I had planned a lovely undisturbed and tranquil sleep and I had gone quite a good way on my long journey in Dreamland when my slumbers and pleasant dreams were suddenly shattered by the voice of the Signalling Officer asking if I was awake Yes I was awake! What was the trouble? B Squadron is going out at 2.45 AM. Send 3 Signallers with them They are to take with them the unexpended portion of their days rations and carry with them 3 feeds for their horses have their water bottles full and carry a complete Visual Signalling station with them and their full marching order They are to go with B Squadron about 12 or 14 miles out and visual communication is to be established from them to KABIB GANNET Um Yes! That was 11.45. and by the time I had grasped all the details connected and noted Same I laid down again but I did not go to sleep fearing to lapse into dreamland again So I lit the lamp and read .\"Pendennis\" I read several chapters \n\nAt about 1.45 AM. I awoke the three of them very much to their surprise They got away in good time and as a compensation I did not turn out at \"Stand to Arms\"(3.45.) and so made up for lost time and slept on until breakfast time about 8 oclock So after all this life has its compensations\n\nThe wind has been (and still is) blowing very hard and the loose sand is blowing about in a most annoying fashion. Everyone and everything absolutely covered with sand particularly the food which is the cause of much sickness particularly dysentry. The only way we can avoid the sand is by not letting the teeth meet together when chewing and that is also unsafe from a health point of view. I don’t let my teeth meet when chewing and I imagine to myself that there is no sand in the food that I find is the easiest way of dealing with such a difficulty The flies are a great nuisance they always are trying to learn swimming in one’s tea we fish them out in dozens we would have to be fitted with a dozen pairs of hand to keep the little pests away especially where the jam tin is concerned. The glare of the sand is injurious to ones eyes. \n\n \n\nThe Sun is scorching us beyond recognition and we are having long periods of broken sleep The Turks may attack at any time. The Enemy drop high explosive bombs on our luckless heads from above and so it goes. Oh! what a glorious life. Are we down hearted? Never a bit! We are here on the Great adventure and we are simply taking the fat with the lean and we are doing our duty unflinchingly & cheerfully for our King and Country.\n\n5th June MON. Romani. …\n\nStand to arms as usual at 3.45 AM This will go \none\n on as long as we are here on this advanced position. AAA. As I am writing there is an endless stream of camels coming over the sand dunes approaching the Camp all laden with tents and poles. There must be a great amount of troops coming here. We have had a great scare to day. I was sitting in the Officers mess tent this morning giving evidence on some of our Signalling Equipment which has been lost and right in the middle of the discussion we heard the order \"Stand to your horses!\" Excitement was intense everyone scrambled for \n\nhis horse and bolted for dear life away from the Camp Some had no boots on some again had no helmets some had saddles and some again were bareback. I can describe it as nothing but a mad helter skelter. No one had rifle nor a round of ammunition; we would have been in a sorry plight if \"Jacko\" had orginized a combined attack on us by air and land. We were formed up afterwards and addressed by the Brigadier Colonel Meredith and he condemned us absolutely for galloping off in such indecent haste. It was only a ruse as it happened but who was to know that? We shall probably have some more of theses ruses so that if a hostile ‘plane \ndoes\n come over we will turn out decently and take all our horses with us and we shall not forget our rifles & ammunition. The wind has been blowing off the desert today and it was stifling hot although towards evening we got the usual sea breezes which are so welcome. These signallers are very hard worked just now and I have warned them to \"Nurse\" their horses as much as they can because we are not getting any more horses. What \n\ndoes that portend?\n\n","138":" Romani. \n\nMuch the Same routine as Yesterday Lent to 1st Signal Troop one Heliograph and stand. 5 new Heliographs and 5 stands came to day.\n\n-","139":" Romani –\n\nNothing exciting happened today Returned two telephones and all spare wire to Brigade Signal Troop Only kept two phones in hand for night patrol work.\n\n8th June Thurs. 1916 Romani\n\nRather hot today though Sea breezes very acceptable. Training Supernumeries. Return of men who have been inoculated against para typhoid. Signallers for Night outpost 2 Extra horses came from C Squadron to complete my establishment. Telegram received this morning States \"Lord Kitchener and all his staff went down off the Orkney Island on board the Cruiser \"Hampshire\" None were saved\". Latest rumour. The Germans have succeeded in taking Verdun and also that the German High Seas Fleet heavily reinforced by Zeppelins came out again and to use a Colonializm \"Towelled the British fleet up\"! Another rumour we heard was that the Turks are making. \n\npreparations with feverish haste out in front of us and that we can expect attack soon. Let em all come – the sooner the better and I sincerely hope they have a fine day for it.\n\n9th June Fri 1916 Romani.\n\nSignalling today these recruits of mine are capable of doing station work which is wonderful progress. Took some compass bearings of different points and also some panoramic Sketches \n\nThe latest - The whole division moves out at 4 oclock tomorrow morning to go out ahead we may be away several days We are going to harass the enemy again. But the Australians are in front this time instead of the New Zealanders who were out in front last time and did the killing. Reveille at 2 oclock. Breakfast at 3 oclock and everyone to be clear of the Camp by 4 oclock \nWe\n carry 4 complete visual signal Stations also one telephone and 2 reels of cable We are out every morning at 3 but tomorrow it will be 2 for a change. The 2nd Brigade back 15 miles at Hill 70 move up in support of us. NO signs of \"Jacko’s\" man-bird lately but we can fully expect him after this \"Stunt\" again. Experts \n\nreconed that the flying man who threw those last bombs with such deadly accuracy was only a \"fluke\" But fluke or no fluke they quite satisfied me accurate or inaccurate.\n\n10th June Sat 1916. \nRomani\n\n11.30 AM. I am sitting under the Shade of a palm tree which by the way is covered with great bunches of dates but they are far from ripe. We were roused out of bed at 2oclock this morning and at \nat\n 3.45. we departed from Romani on a reconnaissance we are halted in a grove of palm trees away out on the desert \" far from the madding crowd\" (If we could only see a crowd now!) we arrived here about 10 oclock and the latest order is that we move out of here at 9 pm tonight on one of these \"unknown destinations\" As far as I can guess or gather we keep moving until 4 oclock in the morning till we reach our place of attack but no further particulars are available. We crossed the spot this morning where the Gloucestershire Worcestershire and Warwickshire Yeomanry were frightfully mowed down by the Turks on the 25th April. dead horses and camels and men are everywhere. It was fearful slaughter but the Turks paid dearly for it which is amply proved by the heaps of empty cartridges which are about \n\nThese regiments were surprised in the early morning and the Turks shot all their horses which stood in the lines thereby \nrendering\n cutting the Yeomanry off from the outside world – and immediate help. One regiment and a half were wiped out completely out of the three regiments engaged. and one complete Squadron at OGRATINA a few miles further out ceased to exist being shot down to the last man.\n\nAfter order by Lt Colonel Sydney W Barlow. Commanding 2nd Regiment The 1st LH Brigade less 1 regiment will move from HOD. EL. SAGIA. at 2100.on June 10th and march on a bearing of 97° in the direction of HOD.EL.BAYUD. arriving at a point immediately south of HOD.EL.BAYUD. At 0200 on June 11th.The 10th L H Regiment will then carry out the reconnaissance of BIR BAYUD\" We are told to get as much sleep in the afternoon as we would be in the saddle all night. I laid down but I could not sleep no matter how hard I tried At 6.30 we fed the horses and at 7. we filed out of the palm grove and after some little delay struck out across the desert the whole column It was a beautiful moonlight night and the long \nclam\n column stretched far out along the desert like some gigantic \n\ncreeping thing We wound in and out among the sand dunes mile after mile on a bearing of 97° No talking nor smoking And no matches to Struck – everything silent and grim. There were over 1200 rifles which would render a good account of themselves if called upon to do so.\n\nEvery hour a halt was made for 10 minutes During these halts men would sit or lie on the sand and go to sleep only to get a shock when the order to mount came. Sometime during the night we walked our horses for about a mile over some very steep sand dunes winding in & out and up & down like some huge black snake. The Sand was very soft and yielding and well over the tops of ones boots. And over the horses hoofs \n\nAt the appointed time 0200(2.AM) we halted in among some treacherous sand dunes an ideal spot to ambush troops\n\n11th June SUN. 1916.\n\nHuge sand dunes tower above us some of them hundreds of feet high and of peculiar formation owing to the action of the wind. A thick fog prevails blocking out the surrounding landscape One cannot see further than 50 yards in any direction \n\nPatrols and Sentries and Signal Stations are carefully posted The 1st Light Horse Regiment has gone on some secret mission and will be joined later on by us. I lay down on the sand which is wet with dew and the atmosphere is somewhat cold but I manage to get some sort of a sleep. The horse keeps on moving about and disturbing me by pulling at the reins\n\nLater the fog clears and we get a good view of our surroundings which are interesting hills and valleys of the purest sand are everywhere with various species of vegitation growing little tufts of grass bushes Etc here & there which may easily be mistaken for troops at a distance. We march in an easterly direction about the time the sun gets up. And later on we come upon the sounds of rifle fire. The 1st & 3rd Regt have engaged enemy Patrols and are being fired on by snipers who are hidden among the bushes on the far hillside. We remain there about 2000 yards on a range of hills overlooking the Turkish position About 20 Turks can be seen running away over the hills yonder with bullets flying after them. I was ordered to set up a \n\nHeliograph Station and communicate with the troops out in front. The Turks can see the flash of the instrument and during the time we are signalling bullets kick the sand up all around us but the shooting is erratic and so no danger is anticipated by the time the bullets get to us they are pretty well spent. but they would give one a nasty Knock just the same They have some modern Mauser rifles which can be distinguished by the sound and also by the noise of the bullet as it whistles overhead and they also use old fashioned Martini-Henry rifles with heavy leaden bullets \n\nA few minor casualties are sustained and we capture a couple of Turks & camels. But the regiment which had to carry out the reconnaissance could not get their bearings in the thick fog and so much good work could not be done. \n\nwe watered all our horses and filled the wells up so Jacko will have to clean them out when he wants water. At 12.30 we set off for OGRATINA about 13 miles across the desert. A long dreary and hot march. Most of the men having drunk their supply \n\nof water and were experiencing some hardship on account of thirst. These water bottles do not hold enough water (1quart) especially in these sub-tropical regions And the water gets hot and is therefore not pleasant. We halted 10 minutes each hour and it was a great effort to keep awake. I frequently dozed and the horse would increase his pace and I would wake up and find I had overshot \nthe\n my proper place sometimes as much as 20 yards. to the great amusement of the others who were looking on. \n\nThis generally happens. about 5.30 pm we all arrived at an oasis in the desert surrounded by the inevitable palm trees this was OGRATINA. We bailed water for horses that were absolutely famished for a drink not having had one since 1 oclock on the previous day. I greatly pitied the poor horses. They had been saddled up with full marching order \na\n since about 7 oclock last night and marching through soft sand the whole way. They were so eager for water that they plunged their muzzles into the canvas bucket upsetting most of the contents \n\nin their eagerness. My fellow drank 6 buckets before he cried enough and some were thirstier than that. We drew Rations Bully Beef Biscuits and Jam. And forage for our horses we gave them a feed and were having something ourselves when the sudden order came (And orders generally \ndo\n come sudden here.) that we were to pack up and leave the Camp at 7.15. and it was just 6. minutes to 7 oclock then. Moved out of Camp at 7.15 \n in the moonlight and proceeded about 12 miles back to our Standing Camp Romani. It was very pleasant and cool riding along in the cool night air. and a brilliant moon shining. \n\nI had great difficulty during the latter part of the ride to keep awake and I rode quite long distances sound asleep in the saddle. There were plenty of such cases. As we would be going along someone would ride past sitting bolt upright and sound asleep. It causes great fun especially when the other fellow goes to sleep and loses his place in the ranks\n\nWhen we got into Camp my horse drank another 6 buckets of water \n\nwe got back to the lines and dismissed at 12 midnight horses and men thoroughly tired out. and we were all glad to get to bed.\n\n12th June MON 1916. Romani.\n\nPlenty of things happened during our absence. 60 reinforcements arrived from our base details at Tel El Kabir. and about 150 horses Also a German Taube paid the Camp a visit but he did not drop any bombs he had expended all his supply on Kantara I don’t know what damaged he caused. He turned his machine gun on our Camp but did no damage. He also visited the NZ. Camp causing some damage Killing one officer and wounding several others I only hope our own air-men play hell with those people.\n\n\"Stand to Arms\" At the usual hour I for one had only had about 3 hours sleep since the night of the 9th June. \n\nWe Came into Camp at midnight dead dog tired and \nI\n had to saddle up and stand to arms at 3.45. The Signaller affirms that he woke me but I have no recollection of it when I did awake it was beautifully light and I had overslept about one hour but then everyone else did \n\nlikewise and so in the rush of getting out we were never noticed\n\nI let the Supernumery Signallers off today because they as well as all of us wanted some sleep. Sergeant Major Letch of the 1st Signal Troop has obtained a commission as Signal Officer and is now the Signal officer of the 2nd L H Regt. Sergeant Nelson of the 1st L. H Regt. has also been granted a commission and he is Signal Officer of the \n2nd\n","140":" Regt. Lieut Pledger has been transferred from us to A. Squadron.\n","141":" Romani.\n\nA large new type of Aeroplane came over the Camp early this morning flying very high almost too high to distinguish whether she had the round red circle \nof\n or the Iron Cross on her wings. Someone yelled \"Stand to your horses! and a wild stampede was made for the lines but before we got saddled up Someone else yelled \"False alarm!\" These infernal machines are bad for the nerves. and I don’t know what would happen if a Taube came over every day. All our aeroplanes went across to the Turkish lines to bomb them out. Two of them flew over us just after daylight flying very high. The large ‘plane referred to came around \nafter\n about 8. oclock when the others had gone which accounted for the scare. I have warned those men \n\nof mine where to collect again after getting clear of the lines\n","142":" Romani.\n\nNothing unusual to Report during the day Night patrols told off and everything prepared to go out when - like a bolt from the blue came the sudden order (and this is a time for sudden orders) we go out into the desert on a reconnaissance and we leave at midnight\n","143":" OGRATINA.\n\n(An Oasis in the desert)\"Somewhere in the Sinai Peninsular\" \n\nWe arrived here at 5 oclock this morning from Romani after a long and tedious night march The trouble about these marches in the night there is no talking and no smoking which \nare\n is very trying One simply cannot help going to sleep in the saddle for long periods sometimes during the 10 minutes halt each hour one invariably goes to sleep\n\n\"We don’t know where were going to but when we get there we’ll be glad\" On this particular \"Stunt\" as we call them there are no printed instructions which is always the case hitherto and we may be in for a lot or a little who knows? \n\nAbout 20 yards away from the clump of palm trees is the deserted \n\nCamp of the ill fated \"A\" Squadron of the Worcester Yeomanry and the 2\/2 Company of the 52nd Lowland DIVISION Royal Engineers who were caught napping by the Turks on either the 23rd or 25th of April last. Not one single man has yet returned to tell how it all happened. But it is very plainly evident to us who have seen the place what \nhas\n happened. And that is that the Turks surprised those two units in the early morning of either of the above mentioned dates and rushed the Camp Hand to hand fighting of a desperate character must have ensued which is proved by the fact that many skulls are fractured dozens of helmets lay about and there is scarcely one that has not been either penetrated by a bullet or has been stove in probably by the butt end of a rifle. The dead are only just covered over with loose sand and the uniforms can be distinguished Some of them almost exposed on the surface. Documents of every conceivable description also books of referance and records are strewn about in great confusion The valuable articles have of course \nnot\n been taken away by the Turks or have been looted by roving bands of Bedouin Arabs. \n\nTruly our soldiers know how to die game whatever else may be said about them. \n\nIt is very hot during the morning hours in these latitudes scarcely a breath of air. But later on sea breezes spring up from the coast about 5 miles away and they make ones existence much more bearable \n(June 15 1815)\n A party with shovels and the chaplain gave those men who were killed – a decent burial \n","144":" \n\nOrders came late in the afternoon to saddle up and move at 11.30 at night and our march was one of only about 7 miles to one of these Oases in the desert called HOD-ED-DEBASIS Another one of these soul racking night marches no talking and no lights. Went to sleep about 20 times If we could only carry on a conversation things would be much pleasanter\n\nWe arrived at this place at about 2.30 AM. and laid down to sleep on the wet sand We were ordered not to take our saddles off as we were in reserve to the 1st regiment who The 1st & 3rd Regiments went forward on a reconnaissance in force to some of the outlying places They returned later with no success The same as last time \"nothing doing\" \n\nThe only time that anything was done was the first time we went out when the New Zealanders were in front and they managed to kill about 20 Turks Since that \"Jacko\" has not been able to be caught with chaff. But I am thinking one of these days \"Jacko\" will give us a receipt for this. We returned later in the morning to OGRATINA and after having off saddled and fed we proceeded across the wilderness to QUATIA where we watered with some of the best water procure-able in this benighted and Sand cursed region and about 5.30 pm we made tracks for Romani reaching Camp about 9.30 pm. During this recent \"Stunt\" I have had about 20 little sleeps some as long as 3 hours and the shortest one being 3 minutes! We covered about 20 miles all through the blazing heat and soft sand reaching well over the horses fetlocks at each step. These expeditions are killing for the poor horses who have to go long periods without water and when they ","145":"\n get it it is generally of an inferior quality some of these horses have not drunk one bucketful of water during the last fortnight and how \n\nthey are able to stand against the arduous work imposed upon them is beyond my comprehension altogether - we must take into consideration that \neach step\n the horse takes, if its only walking about the Camp they sink to the fetlocks Then imagine a long night march lasting through the night one a long one through the day in the heat and glare and unsuitable and scarce water and carrying heavy marching order and heavy men my weight without pack is over 12 stone. poor \"pharaoh\" although he is in good condition & because he drinks any water not being particular.\n","146":" Romani.\n\nHad a quiet day in Camp and had a well earned rest. I put in most of the day having as much sleep as possible. 60 reinforcements arrived from our Base at Tel El Kabir and 60 the other day and the regiment is not full strength yet.\n","147":" Romani.\n\nChurch parade. at 7.30 A M. Captain H.K. Gordon our Chaplain with Lieut Hockey the Quartermaster \n\nleft here for Cairo for a few day to farewell Captain Geo Green our late Chaplain who left us in Gallipoli sick and has just returned from Australia He is going on to France to do duty with some of the Australian Regiments there. Lieut Colonel S.W. Barlow our C\/O has gone away sick. Major W E Markwell is acting in his Stead Lieut Letch our Signalling officer takes charge of the Brigade Signalling Office pro tem. So I am left on my own again. About 7 this morning about 13 of our Aeroplanes came over flying very high and making for the Turkish Base EL-ARISH They presented a splendid sight. Later on we got their message which read. \"13 Aeroplanes flew to EL ARISH And dropped 88 bombs destroying 2 of the enemys Aeroplanes \nand\n besides causing great damage to material\" – A new type of aeroplane of ours comes over here frequently of very large size She carries a 3 pounder gun Also several Machine guns. Her somewhat different shape caused some fools of New Zealanders to open out with a machine gun on her a few mornings ago hitting the ‘plane several times Cannot understand some people being so foolish as to do such a thing as the. The red circle \n\nunder the wings can be seen plainly for thousands of yards, but I suppose they as usual had a bad attack of \nthe\n aeroplanitis\n\nThis is how they appear from Mother Earth\n\nOur ‘plane with red ring, white ring and blue spot\n\nThe other fellow – BLACK MALTESE CROSS. And wings of totally different shape.\n","148":" Romani 1916.\n\nThe weather here is very hot and the hot sand is injurious to ones eyes. \n\n3 Reinforcement Signallers McGuire Birch and Keenan were put through a test this morning Keenan passed the others must have more instruction \n\nOne of our Aeroplane. Came over today and hovered around for a long time. The result of the air Raid was that 20 of the enemys planes were destroyed and we lost 2 machines but the pilots are safe. Persistant rumour about going to France Heard it again to day\n\nCorpl Finlayson to Hospl appendicitis\n","149":" Romani 1916.\n\nHave missed several days but nothing doing much today\n","150":" 1916.\n\nLeft Romani at 11.55 last night for OGRATINA away out in the desert on another one of their beautiful \"Stunts\" and another long silent and soul racking night march no talking and no smoking. Daylight was very welcome when the Commander \n\nAnnounces \"Men may Smoke!\" We arrived at Ogratina early in the morning.\n\nPaid another visit to the place where the Yeomanry were cut up. brought back some records of the unfortunate men who \nwere\n met with dister\n","151":" Bir-El-Abd.\n\nTurned out from Ogratina at 9pm and another long and tedious night march Arrived at Bir-El-Abd (a mere clump of palms and a good well and took up a position Outposts were sent out to various points and for several hours we had a difficult time in sending and receiving messages 7 Heliographs were going at once. We came back to a Camp called HOD-EL-DEBARIS about 6 miles My horse up to now this morning has sunk 12 buckets of water poor old fellow was thirsty. We got back to this place and after staying in the shade of the palms for about an hour were ordered out again and had to retrace our tracks back to BIR EL ABD \n\nOne of our Aeroplanes through some accident had to come down in the desert and only about 5 miles in front of the Turkish position The whole column had to go out past Bir el abd. several miles Came in contact with strong Turkish patrol who however \"imsheed\" at our approach. The machine could not be located on account of taking the wrong direction and we returned to HOD EL DEBASIS at half past three in the morning. No feed for the horses dead dog tired and then we had to tramp through the soft sand looking for horse feed I pinched a bag of grain from the Signal Troop as otherwise we would have had no feed for our unfortunate horses who by this time were showing signs of great distress. The men simply lay down just alongside of the saddles in the wet sand That was at 3.30 and at 5 30 we were awakened again and \"fed up\" again. We were all this time on less than a bottle of water per man We \n\nwere drinking brackish water found by digging pot holes in the sand Strictly against regulations but how can a man survive thirst in this awful desert. That is what kills the men and horses Our water supply was back about 10 miles at OGRATINA. And we had to go back to look for that Aeroplane quite unexpectedly. That was the reason However some of the Brigade went back and dismantled the aeroplane and packed it on camels and brought it back to Railhead. The pilot and the observer had to go back to Camp per boot something like 20 miles through soft sand.\n","152":" Friday..\n\nCame back to OGRATINA and Oh Heavens be praised for some good water we drank and drank and never seemed to be satisfied although the water was hot. Just before Sundown we set off back and after a long and tedious night march again we eventually arrived safely \n\nat Romani Thankful indeed to get back again we have had a hard time on this last trek and I have lost a good deal in weight in consequence My horse thinks that’s a good job and he sincerely hopes that I continue to lose weight. He carried me through splendidly he is a hero\n","153":" Romani. 1916\n\nThirty four years of age today was on Pope’s Hill trenches this time last year and the year before \nHeliopolis\n Australia. Had to stand to arms as usual at 3.35 this morning we still have that to contend with as long as we hold this advanced position. Dont know when we are going back to Hill 70 for a spell The horses are looking rather bad on it and if we have any more of these fancy \"Stunts\" the horses will not last long. My fellow’s ribs are capable of being of being Counted Been resting as much as possible all day.\n","154":" Romani. 1916.\n\nBeing Sunday I did not do any work. \n","155":" Romani.\n\nBeen out with the class signalling all day. The weather was very hot & sultry in the morning and up till about mid-day but after that there is always a steady sea breeze sets in and these breezes are lovely & cool Had to make sketches of the different positions we occupied during the recent reconnaissance Compass bearings from one point to another where signalling communications could be established. One of my horses has been sent away sick and another two are being shown to the Brigade Veterinary officer to day at 3.30 p.m. These long treks over loose sand has been the cause of them and hundreds of others breaking down. The 2nd L H Brigade have returned from Hill 70 and they are now taking their Share of some of the patrolling which is very satisfactory as it takes a great deal of weight off us. Leach has gone to the Zaitoun Signalling school at Cairo for a 6 weeks course in advanced Signalling and Butler has also gone on a 3 weeks course of Machine Gun Work. Hope they make a name for themselves. Campbell and Allan & Smith came back with Credit. Brigade Head Quarters which has been situated in a clump of palms close by \n\nhere have gone to a spot about half a mile North of the Camp on a sand dune The palm trees have been condemned as unsanitary During the recent reconnaissance the Saddler Sergeant…….. Mercer and Keenan two Supernumeries are absorbed into the Regimental Signallers for duty Vice Butler & Leach at the School of Instruction. \"Jacky\" Ferguson made a patent to keep the bread cool. He sunk a biscuit tin into the ground and covered it over with a towel but when we lifted the lid off a shower of sand got down into the bread so we have unanimously condemned his patent. He must think something better out.\n","156":" Romani\n\n Training all day. very Hot.\n\nA German Taube came over us this morning making towards the Suez Canal but our new large battle plane got after him and chased him for about 50 miles They both went at express speed across our Camp Things were in Sixes and Sevens for about half an hour our plane hovering over the Camp after he had chased the Taube Was flying too high to distinguish whether he had the red ring or the Maltese X \n\nSeveral of our machine guns opened fire on him although they should have known better because they are provided with strong telescopes But I suppose they got the \"Jim Jams\"\n","157":" 1916. Romani.\n\nWe witnessed this morning one of the Sights of a lifetime – an Aeroplane duel -. A German Taube had been reported going in the direction of Kantara immediately all wires and telephones and wireless buzzed. Everyone was on the alert. The Brigadier caused the aeroplane alarm to be sounded – a succession of long blasts on a whistle Everyone sprang out and got the horses clear of the lines and away from the Camp. All my horses (18) \nwere\n had gone to the Shade of the palms previously so I had not much to worry about. \n\nQuarter of an hour, half an hour - No sign of any hostile aerocraft, when suddenly the shout \"here she comes\"! was heard on all sides Telescopes and field glasses were soon focussed on the approaching aeroplane which was making for our Camp at great speed. \"Look out she’s a Taube\"! Everyone opened out in case she dropped bombs. Sure enough she had the dreaded Maltese Cross\n\npainted on her wings and body. Almost immediately after her could be seen another ‘plane approaching at express speed This plane had the familiar round red Ring on her. \n\nThe Taube twisted and dived and ducked but the pursuer was perceptibly gaining when they got nearly over head Our ‘plane opened fire with a machine gun. At the first volley the Taube was seen to drop lower and swerve at a dangerous angle very probably the pilot was hit but she righted herself again and with wonderful agility steered clear And then took an upward turn It was magnificent to watch these two engines of destruction keenly bent of destroying each other.\n\nThen a most unfortunate Contretemps happened. All our machine guns on the ground opened fire on the Taube with the result that our air-man fearing a bullet intended for the other fellow – held back. Consequently losing ground thereby letting the Taube slip through his fingers so to speak The machine guns were instantly silenced but unfortunately the Taube had by this time gone a good distance ahead. \n\nhowever our man recommenced the flight after our guns had ceased firing and took after the Taube again at flying speed The sound of their machine guns could be heard for many miles through the air. I was watching through a powerful telescope and the two of them went away towards the enemys lines until they completely disappeared.\n\nLater. Have just heard that the Taube was eventually brought down and our plane had a bullet through the petrol tank caused by our own impetuous machine guns which one could naturally expect – incompetence!\n","158":" Romani. \n\nNo Aero Scares today been training Signallers. Nothing to Report.\n","159":" Romani\n\nBeen getting ready today for one of these forthcoming \"Stunts\"(reconnaissances) out in yon desert.\n\nTurned out on parade at 1 oclock and after watering the horses we forwarded on a long and weary night march \n\nto a place called Hod Es Sagia \"Somewhere in the desert\". All during the early morning a very thick white fog enveloped everything making it impossible to see further ahead than about 100 yards. Reached our bivouac about 7 AM. We are surprizing the enemy at dawn at a place called Bir El Magreiba about 7 miles away. We are working in conjunction with the 2nd A.LH Brigade who are going out on a reconnaissance in the Ogratina and Bir el Abd districts\n\nAnniversary of attack on Quinns post \n","160":" Hod-Es Sagia.\n\nWe mounted and moved out at 2 AM. The usual silent night march and just at dawn we came upon the place but nothing doing their spy system is too perfect although there were plenty of footprints recently made - in the sand. Did a lot of Heliograph work at long distance, good practice \n\nAlso made sketches which have to be handed into Brigade office Came back to Hod Es Sagia about 11 oclock AM.\n\nBurned several native villages causing great smoke & blaze. \n","161":" Romani\n\nCame home here about 9 pm last night glad to get to sleep and nearly overslept myself. Had of course to \"Stand to Arms\" at 3.45 That means getting up at about 3 AM 18 sleepy signallers take some shaking up and getting on parade in full fighting order in ¾ of an hour Sgt Rafter went to Hospital today Allan’s horse gone too. Church. \n\nApplied for leave to Port Said\n\n","162":" Romani \n\n Nothing to Report.\n","163":" Romani. 1916\n\nBeen making reconnaissance sketches all day for the Brigadier difficult work. Drifting sand very bad & sun hot Lieut Smith the Brigade Signal officer has returned to duty, He has been to hospital having his hand attended to which was cut open by one of those aeroplane bombs which were dropped on the Camp on the 1st June. \n","164":" Romani 1916..\n\nTrumpeter Sergeant Ferguson takes charge of all the mail now. Been sketching to day same place. Visit by General Sir Archibald Murray the C in C. of Egypt\n","165":" Romani 1916 \n","166":" \nRom\n Port Said 1916\n","167":"\n\nReturned from Port Said on 48 hours leave had a good time A change is as good as a rest.\n","168":" Oghratina\n\nA long and silent night-march again last night we arrived here just before daylight and off saddled and a few hours sleep and at 10 A.M. we saddled up and went back to Romani again reaching Camp at 4 pm. We were only in reserve on this occasion. I had the misfortune to run a thorn into my finger and the Doctor cannot get it out.\n","169":" Romani\n","170":" Romani\n\nAeroplane (Hun) came over this morning but he was afraid to come too near the mountain gun nearly got him and our large battle plane was soon on the scene We have got him \"bluffed\" by now. I think. \n","171":" Romani.\n\nAnother \"stunt\" the troops are going out at 3.30 pm and for once I am not going. My finger is in bandages and up to now the thorn has not been removed perhaps it means an operation If thats so I shall also undergo an operation for piles at the same time Very hot during the early morning but later the sea breezes come along Our horses are getting dog poor now and Bones are sticking out everywhere. The men are worked off their feet and are suffering principally from loss of sleep. We are going from daylight (before daylight in fact.) because our day starts at 3.AM. when we stand to arms and until 8 oclock at night and then about 200 men are\nthen\n for outpost duty and about 20 of them for stable picket. Too solid altogether. The writing is bad but my finger is sore and I cannot hold the pen properly.\n","172":" Romani.\n\nLater. Same day. \n\n8.45 pm. I am all alone tonight. All the troops with the exception of a very few have gone out on a reconnaissance and I have just signed a memo from the Regimental Officer Stating that the few Stragglers who are left in Camp must Stand to arms at the usual time absolutely ridiculous and absurd. As \n thought\n though it is necessary to stand to arms here when the whole brigade has gone out in front of us. Of course the whole thing is another example of \"red tape\" which does so much to destroy men’s souls in the Army. \n\nA few stragglers most of them attending the doctor (myself included) for various ailments and a few men who are grooms and servants, and a few who are on duty here. Oh! No don’t let them get at least \none\n good nights sleep out of 7 weeks. haul them out at 3.45 in the morning too much sleep we know is injurious! \n\n13th July. Thursday Romani 1916.\n\nLaid down & read. The Woman in .white (Wilkie Collins) had a spell\n\nP.S Didn’t Stand to arms. Never woke till 5oclock. nothing said. \n\nTroops are coming in at 7 pm.\n","173":" 1916.Romani Camp.\n\nNothing to Report. \n\nTroops came in at 7 pm. had a very trying time so they reported – worse than usual.\n","174":"\n\nDetained in the First LH \nRegt\n Brigade Field Ambulance \n\nThis finger of mine has been causing some trouble have had 2 operations performed but up to now they cant get the thorn out.\n","175":" Romani\n\nStill in the Field Hospital the thorn in my finger still holds on and no signs of him yet.\n","176":" Romani.\n\nDischarged from the Field Ambulance today and the thorn still remains in my finger Great Scare this morning a German Taube came over and hovered overhead but no bombs were dropped he had plenty of time and opportunity to drop plenty of bombs. Just as he sailed away our DE HAVILAND (large Battle ‘plane) came across from Kantara at full speed but the other fellow \"hopped it\".\n","177":" Romani.\n\nStand to arms again at the usual time 3.45 A.M. Thank heaven we have glorious weather for standing to arms at such unearthly hours. I tremble to think how this performance would go if we were in the midst of a European winter. Another aeroplane scare this morning about 9.30. did not see any signs of a hostile aeroplane but one \nwas\n sighted somewhere in less than 15 minutes one of our fastest ‘planes came on the scene from Kantara but although he circled and hovered around for hours. \n\nno trace of the other joker could be seen. Mail day received about half a dozen letters all records broken. Mather has gone to the Signal Troop he is temporarily attached for Signalling duties. Findlay of \"B\" Squadron comes over in his place. The glare of the sand in this place is playing havoc with my eyes. I find it necessary to wear smoked glasses during the daytime or strong artificial light. When we get to fresh fields and pastures new (hen!) then I hope my eyes get back to their normal strength.\n\n10.th July. Wednes 1916. Romani.\n\n-52nd day in this Camp. – \n\nAeroplane came over this evening about 5.30 reports that about 8000 Turks. are in position less than 15 miles out at HOD-ED. DEBABIS, BIR-BAYUD. And Bir-El-Abd. All favourite places of ours when we go out on these reconnaissances. They have made some very long journeys during the night. And in one single night they have established good strong positions \n\nbefore long we may all be in the thick of things. The Second Brigade are already out and from the latest information gathered on the telephone the N. Zealanders are now on their way up from Hill 70. They have been having a rest. down there. (Hill 70 is about 15 miles back from here towards Kantara. We may yet have to bolt off in the night for all we know. Everything and Everyone is in readiness in case of emergency. All outposts are doubled tonight on Katib Gannet and other positions on our 100 mile front. Must close now and make a few final preparations Must leave nothing to chance \"Jacko\" is a wily customer to deal with and with him we take no chances. We have met him before.\n\n20th July. Thursday 1916 Romani\n\n53rd day in this Camp\n\nStood to arms at 0300 this morning instead of the usual hour. Aeroplane reports this morning that The Enemy have now occupied Oghratina. (5 miles closer than last night) and are \"digging in\" for all they are worth They are \n\ndig\n in great force and Shots have been exchanged between their patrols and the patrols of our Second Brigade Our aeroplanes were hovering around at daylight . I am waiting patiently for a flock of them to go across and drop a hundred or so bombs on their heads. Perhaps we are JUST \"nibbling\" at them. It’s absolutely certain that they will not be allowed to come much closer. It is now 9 oclock A.M.\n\n7PM. Same day.\n\nTwo Turkish prisoners of war have just been bought into Camp from the desert. and two more decrepit & miserable looking wretches it would be difficult to find. Very much attenuated and poorly clad. Rags. In fact. They were seated one on each side of a camel on those chains which are used for carrying wounded men on. They have just been taken to the Brigadier for Examination\n\nSergeant Ferguson has gone \n\nto Hospital with a Septic Arm. Corporal Challinor of \"C\" Squadron take temporary command of the Staff Lines. Aeroplanes have just returned from their reconnaissance. Must try and fathom some news.\n\nLater 9pm.\n\nDon’t like the look of things in General. looks as though we shall have to go out during the night. The two prisoners brought in reported that a strong force was going to attack Romani from the south while a flanking movement was executed on the E & N of our Camp. They report also 9000 men at Oghratina well dug in 7 or 8 guns about 40 machine guns and officered by 60 or 70 Germans. I am sleeping close to the telephone tent so as I can be soon found if anything is \"doing\". \n\n12 midnight\n\nSlept from about10 oclock with occasional interruptions by the operator on the phone inside speaking to Headquarters. And I certainly awoke each time the Adjutant wanted to speak to the Staff Captain or the Brigade Major. The \"Old Man\" \n\nhas got \"leather lungs\" - well tested. Every time he spoke he sent a tremor through me.\n\nLater 1.15. 21.7.16\n\nGet up! Saddle up!! Shake it up!!! No rest for the wicked on this earth. I can see that. \"Saddle up everywhere! is the order \" Be ready to move at 2.\" Everyone had previously been warned to sleep with their clothes on and everything handy to put straight on. Some of the lads reconed it would be a good idea to requisition for some moth balls and decently and reverently hand all sleeping material over to the Quartermaster The whole Brigade move across the plain to QATIA (5miles).\n\n6. AM. 21.7.16. QATIA.\n\nArrived safely here. Heavy machine gun firing on our left don’t know details yet. Patrols have (and are) scouring surrounding sand dunes (treacherous places) for signs of the enemy. Captured one prisoner already. he has been sent into Romani under escort. after unburdening himself of the usual lies which prisoners of war are fain to utter – Those two devils last night were born liars I’m sure of that.\n\n9 A.M. Strong patrols have gone out towards Oghratina and Hod-Es Sagia about an hour ago.\n\nLater Bulletin 2.30 pm. Same date\n\n\"B\" Squadron and Head Quarters are under the shade of the sheltering palms at QUATIA Since this morning the Turks have been driven back from their small outposts within several miles East of this position shots have been exchanged between the different patrols on either side one of our Squadrons has gone to Oghratina but have run into a \"hornets nest\" there and have received a temporary check in that direction. We may have to go out in much stronger force and dislodge \"Jacko\"\n\n2.45 PM \"Jacko\" digging in at Oghratina for dear life\n\nLater Intelligence 6pm\n\nA and C Squadron have been having rather a warm time of it. They have not been able to water any of their horses all day all the oasis where the wells are, are in possession of the enemy. Most of the lads must be dreadfully thirsty by now they only had one bottle of water since last night and the heat \n\nhas been very high. today. Gibbs of A Squadron seriously wounded up to now. The artillery (RHA) have just gone out with four guns to pound \"Jacko\"\n\n6.45 pm. Our Guns opened fire on Oghratina & cannot see with what effect. They sound very familiar. The latest order is that the Brigade moves at dusk and its nearly that now. Enemy’s Taube came over.\n\n12 midnight. Same date.\n\nHome again! 9 oclock before we started from QATIA. So ends one of the longest days we have had.12 midnight when we got home.\n","178":" Romani \n\nOut of the blankets at 2.30 A.M. and Stood to arms until 5. Men & horses dead tired Enemy’s Taube came over about 7.30 we turned out and scattered as usual. Our Bristol Bi plane which now has a landing near here came out and gave chase by the other fellow flew away as fast as he could for home. The anti-air-craft gun fired several shots after him to help him on his way.\n\n9 A.M. Just received the very pleasing intelligence that we are going out again to night! Oh Hell!!\n\nThis sort of thing cannot go on\n\nsurely the men (some of them) have had no rest for days Just signed a memo from Head Quarters stating \"As the regiment will probably be moving out again this evening all men must take as much rest as possible!\": UM. Yes.\n\n6.pm. same date.\n \n\nThe latest is that we sail away at 11pm. full marching order. \"Destination Unknown\"! A lot of the horses have got sore backs and girth-galls through excessive riding and also caused by careless saddling. Five Turkish prisoners captured this morning. That’s five less to fight against. 35 captured by the Infantry this morning at Railhead. (","179":" mile north of Romani.\n\nRough Sketch showing position held by various units in this locality.\n\nMidnight","180":"\n\nPacking up ready to leave at 1 A.M. hell but I’m sleepy\n\n1AM.","181":" Moved out of Camp and marched away out into the vasty desert Daylight comes at last. and the order \"Men may smoke!\" is much appreciated it is the signal for the unloosing of tongues which have been tied up for so many hours If we could only be allowed to have a chat going along it would help to pass an otherwise dreary night and the men would not become so sleepy riding along. We are on this occasion the rear guard someone else is in front\n\n6.30AM. Just watering our horses at the well at Qatia and had to \"Scatter\" – Enemy ‘plane came over a few minutes afterwards our large Battle ‘plane (the De Haviland) hove in sight sending his GNOME Engine at it’s top speed (95 miles per hour.) after the TAUBE. The TAUBE by the way is a much prettier machine to look at. She resembles a huge, white, transparent, butterfly The TAUBE made off at \nher\n top speed, (estimated at 115 miles per hour) shots were exchanged at long range \n\nThe Taube disappeared in the distant \n\nblue but soon came back volplaning at an angle and at great speed. Our machine immediately wheeled and some very pretty manoeuvring was witnessed. shots being exchanged on either side. The combatants appeared to out manoeuvre each other and to get their own machine directly in the path of the Sun so as to make it more difficult for the other man to shoot. Our De Haviland was armed with the latest patern Lewis Machine Gun. And the Taube had the Maxim Gun. both capable of great execution. They eventually parted and each went back to his own base. probably damaged. \n\n1.30 pm.\n\nLatest news to hand states on reliable authority that our observer received a bullet in the thigh and the pilot a bullet in the wrist so they both got a souvenir to mark the occasion. Don’t know how the other fellow got on. I sincerely hope they gave him a stamped receipt. \n\nI have to register all these messages as they come in from the outlying signal stations and I have not been able to get a wink of sleep and only about one hours sleep last night & 2 hours sleep the night before. Am I downhearted.? \"Never on Your life\" as the colonial says. \n\nDATE PALMS SINAI PENINSULAR 23.7.1916 WP16\n\n5pm. Same date.\n\nSome of the 1st LH Regiment who are out in advance have had their horses shot and have been obliged to walk back to QATIA\n\nGibbs of A squadron, the man \nof\n who was seriously injured \nlast n\nyesterday died of his wounds last night\n\nLeft\n 9.pm. Same date. \n\nStarted back from QATIA. and marched across the 6 miles of desert and reached Romani at 11.p.m. And as soon as the horses were fed and we had a drink of tea I promptly went to sleep. \n","182":"\n\nWe did not stand to arms at the usual time. Had to send 2 lots of signallers. out one to HILL 110 at 0400 and the other to BIR-EL-RABA. Had a good sleep and never woke until 6 oclock. The first decent sleep I have had for a long time.\n\nSergeant Rafter and 3s Reinforcements arrived last night. May have to go out again tonight. More than likely. Lieut Ogilvie came back last night the first time I have seen him Since the night C Squadron had a bayonet charge at Quinn’s Post. 15 may \n1916\n 1915 \n","183":"\n\nOut again at one oclock this morning and marched through the silent hours of \n\nthe night to Katia (or QATIA.) \n\nArriving there about 5.AM. we have been in support of the other two regiments and have remained saddled up and ready to reinforce them at a moments notice. \n\nHad a good and well earned rest under the \"Shade of the sheltering palms\". Five times we were prepared to bolt out and scatter on account of Enemy aeroplanes Three of them kept hovering about from one point to another. One hears the order\" Hostile Aircraft, stand to your horses\"! Nuf sed! you stand to your horses fully armed and prepare to scatter so as to lessen the possibility of injuries in case the plane does drop bombs. And let me state they are \"some\" bombs the noise of them coming down through space has a terrible moral effect The actual explosion and scattering of fragments is nothing compared to that terrific & terrifying roar through the air which the bomb makes in its descent. One of the planes dropped a message at Romani warning us (in French) to plainly mark our hospitals more plainly and have them distinct from the rest of the Camp. Are they contemplating another bomb dropping expedition? \n\nFormed the rear guard on the wayback. and got back to Romani at 11.30 pm. And oh joy no stand to arms.\n","184":" Romani.\n\nBeen resting all day. and preparing to go out again tonight But before going out we had a bad scare. About 6.oclock. just as we were preparing for the usual \"Stunt\" a sudden order came Stand to your Arms! Saddle up! Oh! what a rush for saddles, In about 8 minutes we were on parade and the whole Brigade galloped out of Camp – in the soft sand too which taxed the horses very much too much in fact. We took up a position on outpost and patrols were sent in all directions scouring the desert. The report in the first place came over the wire \"1000 Turks advancing on Romani\" Hence the rush out. It turned out eventually that someone was suffering as usual from an attack of \"Jim Jams\" and had probably mistaken 1000 bushes on the desert for 1000 Turks. We got back to the lines and off saddled at about 10.30 pm. went to bed and was roused out again at 12.30. I was disturbed about 11.30 pm. to make arrangements for signallers going out on special patrols about 2 AM. I only had about half an hours sleep. too bad. \n\nTurned out at 12.30 and saddled up and marched to QATIA. 6 miles reaching there at daylight and took a position about 2 miles East as we were out in advance this time. A Turkish patrol was sighted at daylight but it was chased back. Some firing was going on all day with us and the Turkish outposts. Had a strenuous day sending and receiving messages. one has to be very particular about these as so much depends on them. \n\nGot back to QATIA at dusk and fed and watered the horses. At 8 30 pm made for home. Thus ended the \n\n27th July 1916. Thursday QATIA. \n\nOn a corresponding date in 1900 I walked into a recruiting office in Liverpool and enlisted in the 2nd Dragoon Guards. And on a corresponding date in 1908 I was discharged from the 4th Dragoon Guards but temporarily attached to the 7th Dragoon Guards. at Canterbury Kent. after completing 8 years with the colors’ \n","185":" Romani \n\nResting today until (I suppose) 12. midnight \n\nNews has just been issued from Brigade Head Quarters that the Turks are advancing towards Qatia and digging in for all they are worth. The 2nd Brigade have had one man killed and 2 wounded and the \"Show\" is now commencing Soon we \n\nshall be (probably) right in the heart of things. \"Come on Jacko we are waiting.\" \n\nOut again at 12.30 AM. breakfast 12.45 turn out at 2.A.M. marched to Qatia We expected to meet with opposition at Qatia on account of the enemy having been observed advancing and digging in. We hunted a lot of them out of neighbouring clumps of palms. The Screen advanced about 3 miles beyond Qatia and were met by a Turkish outpost. Some of them did the TOD Sloan and got away safely. which reminds me of Kipling\"s lines \"Laying along my horses neck to let the shots go by.\" We all had narrow escapes these particulars Turks are notoriously rotten shots. If they were not so bad we should have had quite a lot of casualties As it was we only sustained one Sergeant Bolton Captain Stodart and Sergeant Kirkbride went out under a heavy fire and brought him in. 15 horses got away from a patrol of B Squadron and galloped off for home. I set off after them and I had a gallop of over 5 miles right back beyond Katia before I headed them off I brought back 5 out of the lot. Later on in the day the artillery opened fire with both\n\ntheir 18 pounders. and for the space of about an hour \"Jacko\" must have had rather a rough time. The shells were beautifully timed and accurately placed. The","186":" Regt were in reserve and the first night had several casualties including one man missing But we are only \"nibbling\" at them yet This is mere farce comared to what is going to happen.\n\nSignalling on this as on other occasions was satisfactory and very busy. It’s a big responsibility I cannot underconstumble why they don’t send some more mounted troops to our assistance. We are out every Second day It means about 24 hours without a sleep It is a big Strain fortunately we have Splendid weather \n\nThe above happened on the 29.July SAT QATIA - Neighbourhood\n","187":" Romani\n\nRest day until 12.30 AM. \n","188":" Qatia \n\nFound ourselves again at daylight on the desert towards Qatia having been on the march since 2 AM and awake at 12.30. About 7 30 AM while we were getting information \n\nfrom outposts and advance troops several Taubes came close over head They did not observe us probably because we kept still, and they flew over Romani Camp About 10 minutes after we heard the first bomb drop in Romani. Bomb after bomb dropped with a reverberating & rending crash. We counted 16 altogether No sign (as usual) of our much vaunted planes They never by any chance seem to appear until the damage is done somehow. However after the Taube had let go 16 bombs he casually flew off to his own haunts and is probably now sitting down comfortably to a good breakfast. As I said after he had gone away another one came (fully 10 minutes later) and he likewise dropped 11 bombs. (Some argued 12 but I counted 11. no matter now) and he casually flew away unmolested During this time and since, there has been no sign of our men-birds Tomorrow, & for a week now at early morning they will be like a swarm of angry hornets floating about as much as to say \"Let any Taube come now\"! I must remark that when our flying men \ndo\n happen to be around they never hesitate to go for the other fellow But thats only when they ","189":"\n happen\n\nto be about. There is no denying the absolute fact that the Taube is a far superior machine to any that we possess both in speed and dexterity. They also equal if not excel our men in manoeuvring in the air and being able to handle their machines cleverer. But when it comes to gameness our men lead they are afraid of nought The questions that the man on the ground now asks are \"where are our machines? \"Why weren’t they out\"? – Why didn’t they get busy before the second raid took place? What has happened to our intelligence Department not to notify us about the air raid? We- on the ground have got to sit meekly by and be slaughtered like sheep we have no chance of retaliation. Let them come down on the ground or any fighting on Mother Earth we will meet them on equal terms. We are utterly helpless where aeroplanes are concerned\n\nOur A Squadron has been having a sharp engagement this morning but as far as can be ascertained only one horse has been wounded we have in Major Markwell a good officer and a man who knows his business\n\nMajor Chambers C squadron has been packed off to the Details Camp this morning also Lieutenant Booth In the case of Chambers it was a case lack of dash\n\nand initiative, incompetent leadership and to use a common soldier’s phrase (very apt) cold feet. He had the trouble during our stay on Gallipoli. The other fellow Booth who came with the 16th reinforcements came to us with a meteoric rush full of brimstone, fire, and bursting with the exuberance of his own verbosity And in his own little estimation was going to run the whole show (an entirely erroneous idea by the way) he, suffered from general incompetence and total lack of dash and leadership he likewise makes his bow and retires gracefully and takes a back seat.\n\nLater: Lt Booth has gone to the Royal Flying Corps the reasons are the same, for going. Packed up and went back to Camp did not start to move until 8.30 pm. Had to wait for the 1st regiment to come back out of the firing line. Started for Romani and had only about 6 miles to go and it took us from 8.30 until 12.30.AM Good Heavens was anything more annoying? Miles and miles out of our way across the trackless desert men and horses dead tired and wandering around aimlessly. Someone at the head of the Column got bushed as per usual. The men have their \n\nown opinion about the incompetence of such individuals Fortunately we do not stand to arms These times or the men would get about 2 hours sleep in the 24. We don’t get too much rest as things are now – and one can imagine how the men feel when they are dragged around the desert uselessly.\n","190":" Romani Tues. \n\nHad a good rest today ready for tonights operations. Three times today we had to turn out of Camp horses & all. A German Taube came right over us but did not drop bombs Our machines were out today. They hovered over the Turkish positions and were heavily shelled but none were brought down. \"Pharoah\" is going to have a couple of days rest he deserves it very much he has a sore back through excessive riding and he is reduced to skin & bone. There are plenty of sore backs in the regiment now. The desert is too rough on them.\n\nOne barrel of beer on issue for the men today 2 pints each very much appreciated and another one tomorrow so I’m told.\n\nReceived from the Signal Troop today 8 Electric Signalling Lamp which are about 100% better both as regards light and portability Have handed the other pattern back. They were cumbersome and noisy and were far from efficient. Received letters today from C.J. P.R. H.L. A.P. E.J. Y.R. and E.B.\n","191":" QATIA\n\nAt daylight we found ourselves close to Qatia where we anchored and have been there ever since not daring to go into the palm grove for shelter on account of Turkish shells which we have a suspicion are not far off. About 9 AM the monitors way out at sea started putting in some of their half low shells into Enemy positions at BIR EL-ABD and Oghratina Great columns of smoke and dust went skywards don’t know what damage. 12 oclock 3 18 pounder guns came out from Romani Sweltering hot out in the sun rigged up some sort of shelters with bits of sticks and bushes. Artillery opened fire with deadly accuracy on various positions including several redoubts of recent construction. The enemy appears \n\nto have put a considerable amount of labour into these places. I have taken some careful compass bearings and made several important sketches of these positions. The artillery are now shelling these. Aeroplanes are hovering overhead \"Spotting\" for the guns dozens of Turkish shells have been aimed at them. some perilously close – but the planes still continue hovering over the enemy’s positions\n\n4.30 pm. Helio message just received from Cameron says \"Fight between our De Haviland and a Taube high in the air. The Taube seen to fall into the enemy lines\". Good, that’s another scalp for our airmen – and only yesterday I was condemning them as being asleep!\n\nIt has been a severe trial on our poor horses today they have been saddled ever since 1 oclock this morning and standing out in the hot sun with saddles on all standing to No wonder they are suffering from sore backs! Turks very active all day moving about from one place to another - probably getting shelled out of their former positions. Several ambulance wagons have gone into Camp with wounded men. The 3rd Regiment has sustained some Casualties at Hill 110. Later- four Signallers are going home now to Camp with the AYRSHIRE Battery R.H.A. they are \n\ngoing back early so as to get as much rest as possible as they will be required for patrol duty very early tomorrow. We are duty regiment tomorrow. The remainder of the Brigade will start at 7 30 Hope we don’t go wandering around in the wilderness as happened on the last two occasions.\n\n3rd August Thursday Romani\n\nAs it happened last night someone at the head of the column took us direct home without a hitch when we got back. This morning two German Taube’s came over and attacked one of our small Bristol Scout Aeroplanes This machine is exceptionally swift being capable of doing 120 miles per hour the same pace as a Taube They got into holds but the Engine of the Bristol Scout suddenly Stopped And he volplaned down gracefully to earth. The engine probably was hit however the Taube’s made off. Later on some of our machines bombed Qatia which has been occupied by the Turks since last night (The bombard was terrific 6 & 7 at a time were the order and the bombing was kept up for about \n\n15 minutes. \"Jacko\" is having the time of his life since occupying Qatia He wont have a leg to stand on soon. Those Turks must be in a fearful mental state by now.\n\nLater 11 AM. Another of our planes just sailed over at great hegth and has been dropping about 10 more bombs on \"Jacko’s\" luckless head. One of our escorts going to Hill 110 last night with water for a patrol there got ambushed and about 4 of them are still missing The remainder got back by the skin of their teeth (as I write this the noise and crash of those frightful aerial bombs can plainly be heard although Qatia is at least 6 miles away) There must be something like 120 bombs dropped this morning already. The damage must be frightful but the moral effect is infinately worse. I think Qatia will be quite safe for us tomorrow morning I hope. so because its no joke standing out in the sun all day with no shelter for man nor horse as we were yesterday\n","192":" Romani \n\n \n\nQuite a lot to write in this entry so I had better give it in spasms.\n\n\t\n\n4.30 pm. Ordered by the C.O. to go out several miles beyond Kateb Gannet to a newly named Hill – MERIDITH HILL to make a Sketch of the country where the outpost line would be stationed for the night (The regiment by the way was ordered out for outpost at 5.30 pm.)I went on ahead and reached MERIDITH HILL and made several sketches before the sun went down Then I gave assistance in laying telephone lines to a spot where the regimental Head Quarters were to be for the night\n\n7.pm.\n\nAll the Squadrons on outpost duty and the signallers on duty at the telephone we held a line between MEREDITH HILL and a clump of palms called HOD. EL-ENNA 2 miles at least. Everything peaceful and quiet. Reports \"all clear\" going through each hour to Brigade Head Quarters.\n\n10pm.\n\nTried to have a sleep but was frequently interrupted by horsemen riding over our telephone wire and breaking it.\n\nReport came in from the outpost line \"Some firing going on immediately in front of our outposts possibly an enemys patrol feeling for weak places.\" \n\n11pm. Intermittant firing going on nothing too serious. Good deal of shifting troop about placing them to\n\nbetter advantage.\n\n2. AM. Part of the Outpost line bent back heavy firing going on several casualties. Lieutenant Rhighetti Killed! Reinforcements urgently required nothing short of a whole regiment would suffice Cannot get them but can get one Squadron of the 1st Light Horse. only every little helps. 3rd Light Horse on MERIDITH HILL hard pressed urgently require reinforcements – can only get about one Squadron. Sleep out of the question now Every available man up in the firing line Most of my signallers are there.\n\n4.15 AM. (Just before daylight)\n\nTurks have charged with the bayonet and have taken Meredith Hill which makes our position untenable. now no more reinforcements can be hoped for the only thing to do is to withdraw to safer ground. I reported to the C.O. that horsemen were heard galloping away from Meredith Hill. He gets on his horse to investigate He has no sooner gone than I hear the Turks yelling cursing and shouting and before we realize what has happened they pour over the ridge about 50 yards from us firing for all they are worth point blank. \t\n\nParrish is lying down at the telephone and he remarks \"This is no good to me Im off!\" I followed suit. Tried to\n\nrescue the instrument (a particularly good one) but it was impossible the Turks were right on us. Then a mad scramble for our horses. I could not get on for several minutes on account of the excitability of my horse and the others bumping in to me knocking me over several Times. However I eventually got into the saddle and bolted with the mob. The bullets were like hailstones something terrific. Saddles were emptied and horses going down One never knew when ones own turn would come I never lost my head I was too much occupied in trying to keep my horse on his feet. After a mad gallop of about half a mile we swung around to the right behind another hill where some of the 3rd regiment were The firing line was reinforced again but no use they simply swarmed over the ground we had no reinforcements, no artillery and our aeroplanes were conspicuous by their absence. German Taubes were flying over the Camp at Romani and Rail-head dropping bombs wholesale\n\nHundreds of them were dropped all around The Turks had brought guns with them and we were getting pelted with Shrapnel it was a lively time altogether. Driven from ridge to ridge, fighting a heavy rear guard action bombs dropping in and shells bursting and bullets \n\nwhistling past and cutting the ground up all round. it was an experience The regiment is badly cut to pieces but we have the satisfaction of knowing that we did all we were asked to do. Numbers of the outposts were simply overwhelmed. Our Machine Gun Section up to the present has not reported. It will take days before we know how we stand. Dead men Dead horses Saddles lay strewn in our path We managed to get most of the wounded away Major Shannahan of B Squadron is badly wounded in the leg Lieut Woodyatt killed outright Major Markwell slightly wounded, Sergeant Rafter missing (so far) McAuley one of my men missing (so far) The remainder of them are safe with the exception of Duffy who is wounded.\n\n5.p.m.\n\nCollected most of the regiment and we are at present taking cover in a palm grove lined a long a ridge. We have had a hard struggle all day to turn the tide of the battle but by now we have the situation well in hand. The Turks tried their hardest to get in around the back of us.\n\n6pm.\n\nThe situation now is that the Turks around our flank have \"imsheed\" and are apparantly in retreat. \n\nFrom 6 pm till 4.30 AM.","193":" \n\n some big guns have been shelling \ninto\n the Camp with high Explosive The crash of these shells is terrific This has gone on intermittently during the night \n\n4.15 AM.\n\nThe whole line advanced dismounted the led horses being brought along behind taking cover as often as opportunity occurred \n\nAt about 5 oclock a bayonet charge livened things up considerably and many prisoners were captured. We captured about 800 prisoners, one whole battalion giving in. hundreds of prisoners were captured by other units. The 2nd LH Regt captured about 8 oclock the whole army medical outfit dozens of camels thousands of rifles and much equipment and ammunition dozens of wounded Turks were collected There are also scores of dead. Lieut Righetti and Sergeant Jepson are lying close together both shot through the head and both stripped for their superior clothing and boots which are of course better material than the Turks. All our dead are stripped like that.\n\n5.30pm\n\n4 mounted Brigades are endeavouring to take Qatia they have been at it hard since 2 oclock line after line has gone into the palm and up to the present the fighting is terrific Machine guns by the dozen are going as fast as they can feed them \n\nwith belts of ammunition. Thousands of rifles also. Shells for all calibres are bursting around Even shells from the monitors away out in the Mediterranean are heaving them in. The palm grove is suffering & so are the Turks but they are splendidly led there is no doubt Almost every available man is in the firing line and the latest information to hand is that the New Zealanders on the right are getting heavily pressed and are asking for reinforcements but what I can see of it there are no reinforcements to be sent to them\n\n6.30. The sun is just disappearing over the horizon as if ashamed to shed this glorious light on such a ghastly scene as this. And the fighting is still very intense both sides hanging on for dear life. \n\nMy saddle has been on my horse for over two days now and has not been removed for as many minutes The men have had nothing to eat for the same period. But some has appeared is the latest news the horses have had no feed all day today and precious little yesterday. Cant last much longer without feed & water The heat has been awful the last few days and the glare of the desert sand has been most trying to the eyes. One would wonder how I managed to write this in the midst of all this rattle of maxims and bursting shrapnel but anyone who understands modern war will understand how this can be done. There are certain\n\nperiods when we rest or are waiting to go into the firing line when – instead of having a sleep I can devote some little time to writing. It’s a struggle I know but I am doing it. Great doings in the air German Taubes dropping bombs on our men Our Aeroplanes dropping bombs on their men Our machines chasing and if possible bringing theirs to earth & vice versa\n\n7.pm..","194":"\n\nThe Turks \nare\n have been pushed right through QATIA. The New Zealanders went right the palm grove at a gallop. They must have been punished dreadfully.\n\nI artillery support I aeroplane \nsupport.\n\nWhy? \nWhy? Why?\n\n6th AUGUST. 1916 SUN. Romani.\n\nLater information – Turks pushed out of Qatia and to the hills beyond. \n\n2nd regiment (only about 135 men) left for Romani Camp at 8.30 pm. reaching here about 11.30. dead dog tired hungry and weary after being in the saddle for nearly two days and nights. when I took the saddle off my horse last night it was the first time in just on 60 hours! during that period the saddle had not been removed for one minute and he only had 3 feeds I\n\nIt would only have been 2 only when we captured a camel convoy of the \n\nTurks I got a bag of oats and so got him a good feed otherwise the poor devil would only have had 2 small feeds. The men have had practically nothing to eat for two days. Stringer Leach and OHalloran are Still missing but I hear from an unofficial source that OHalloran has gone to hospital suffering from shock to the system consequent on the bomb dropping or as the boys humoursly term it \"Aeroplanitis\" Not a bad name either.\n\nSo we are back again in Romani Camp and yesterday morning I would not have given twopence for the whole Camp as it stood nor for its chance of remaining in our hands. Our Commanding Officer has proved himself a good leader and we should all be proud of him he went about among the men fearlessly, never for a moment losing confidence I have been constantly by him and am therefore in a position to judge The remainder of the Officers NCO’s and men acquitted themselves creditably and again proved themselves worthy sons of a noble race. That word \"AUSTRALIA\" is ever before us and it is for her that we go cheerfully forward.\n\nThe latest reliable information to hand is that \"Jacko\" has lost in prisoners alone 4000 There are hundreds of killed and wounded Poor old \"Jacko\" has really \n\nhad a great set back and a good lesson moral and otherwise and I hope he has learned his lesson and that in future he will realize that although there are only a few thousand Australians at Romani Camp They are ready and willing to meet him at his own game. Although in the early stages \"Jacko\" had us going our hardest in fact he scored a win but it was only momentary we were seriously handicapped through lack of reinforcements. lack of Aeroplane and artillery support but we rallied wonderfully and it was only through such splendid officer as our own C.O. that the tide of battle was turned in our favour. I feel very strongly about those of our gallant officers and men who so nobly laid down their lives and died on the field of honour Between 4 & 7 oclock yesterday evening when I was writing in this diary I never knew when the next shell would get me and send me down the vale but I never lost confidence I simply looked upon the situation thus – \"Millions of far better men than me have gone to their fathers who am I – a miserable cringing wretch – that \nI\n should flinch?. NO! My maker has His own appointed time for these things And when HE calls me I am ready which reminds me of those stirring lines of OMAR KHYYAM \n\n\"Ah! Fill the cup, what boots it to repeat;\n\nHow time is slipping underneath our feet\n\nUnborn to morrow and dead yesterday \n\nWhy fret about them if today be sweet.\"\n\n5pm Same date\n\nThe Infantry have been doing the work since we returned last night and they have driven the Turks back to Bir-El-Abd. right through Oghratina. They are assisted (our troops) by the monitors and cruisers out in the water. \n\nLater information states that although we were partly demoralized for a short space of time the other morning we quickly rallied and fought a very stubborn rearguard action considerably saving the Situation. Also our casualties are not so bad as at first anticipated we have lost 9 killed 30 wounded and 10 missing and as nearly as can be ascertained over 100 horses. The horses are a serious loss. it means that the men must go on riding those who are suffering from sore back and no chance of a spell. We are standing by now in case we march out again to night we are not sure on that point but we are prepared nevertheless. The horses and men are weary and very sore after their recent experience but if we are ordered out again we must go.\n\nHave just had a parade before the Brigadier in command of the Brigade and he conveys a message from the General Officer Commanding the Division Major General Chauval and also the G.O.C. Army Corps General Lawrance thanking us for the splendid work done by the 2nd regiment during the critical period. So that’s good news!\n\nIt was noticed that each prisoner captured and in fact all Turks that they carried a Calico bag something after the fashion of an 80lb sugar bag. On enquiry we found that those were the bags for carrying the promised loot away They evidently intended having a good share! poor deluded wretches! So much for German promises. Those who have finally got back to their own lines again have gone away Sadder and I hope much wiser men. \n\nLoot indeed! Where? \n\nI had great difficulty in keeping those Signallers of mine out of the firing line they would persist in clearing out with their rifles and going away to have a shot no doubt the sporting instinct was strong within them as in all of us but they must realize that when a firing line exists they have far more important duties to attend to. Some of them (Dorricott Boyer Smith Findlay particularly I had great trouble with and I had to severely\n\nreprimand them\n","195":" Romani.\n\nWe have been having a good spell last night and all day today. We have been generally squaring up things and taking stock Duffy wounded OHalloran missing one horse shot one missing also 5 saddles one Heliograph missing and one telescope smashed Not bad considering what we were up against – also one telephone and one Electric Signalling lamp. \n\nHowever we got that back with interest. Among the medical comforts captured were rolls of iodoform gauze some of the packages were found to be abnormally heavy and on examination were found to be packed with revolver ammunition Oh! what a clever fellow the German is!\n\nThe regiment is going out on a strong reconnaissance at 7 pm to night we expect to be away for 3 days. but I hope under better conditions than last time. Our chaplain Captain Gordon has had a busy time the last couple of days in performing the last sad rites on our unfortunate and gallant comrades.\n\nThe entries in this diary for the last couple of days has been somewhat spasmodic and erratic but the main facts are here and at some \n\nlater period may be smoothed out and made in very decent readable matter. I think I am about the only man who wrote at such length during the heavy fighting\n\nGerman officer found dead outside Qatia with a \nTURKISH\n bayonet right through him. It would be a happy day when plenty more Turkish bayonets could do similar good work. \n","196":" QUINN’S POST.\n\nGALLIPOLI PENINSULAR\n\nIntense fighting in front of our post at 4.30 AM. As also along the line of trenches at Courtney’s Steel’s Pope’s & Walker’s Lone Pine trenches had been captured after dreadful losses. Hundreds of Kitchener’s Army (Infantry) Connaught Rangers Royal Irish rifles, Munster Fusiliers Etc had endeavoured to take a Turkish position between Popes Hill and Walker’s Ridge trenches – not one man reached the parapet They were literally heaped up. \n\nThe 1st Light Horse Regiment under the Command of our Major Glasgow D.S.O.(Now Brigadier General \n\nGlasgow DS.O. Commanding the 13th Infantry Brigade) charged the Turkish position in front of Pope’s Post trenches leaving in Killed about 180 men and about 200 wounded. Our regiment charged in front of Quinn’s Post trenches and the hail of lead was beyond description. Not too many men went over the parapet because the order came just in time to our post we left about 20 men out in front and they are still there. Among them was Major Logan Lieut Burge Lieut Hinton Sergeant Barry and a lot more. And a great many wounded we had only been in Quinns post trenches on this occasion for 24 hours and we had I think 55 casualties during that period the previous occasion when we were in Quinns post trenches on the 13th May.(24 hours again) we had over 30 killed and about 100 wounded.\n","197":" Romani\n\nCanal Zone Sinai Peninsular\n\nDid not go out last night as ordered – the move was cancelled. – postponed for 24 hours. \n\nCorporal Cameron is to be tried by Field General Court Martial for \n\n\"Refusing to Comply\n\nwith an order whilst on Active Service\" This is the wrong place to refuse to obey orders & we are up against the stern realities of war and we have no time for such people no matter what rank.\n\nThe latest information is that we go out on Reconnaissance at 1500 today. \n\n7.pm. 8.8.16. Reached Qatia safely found it occupied by the Manchester Regiment. had rest for a couple of hours watered and fed the horses and had a feed ourselves. About 10.30 we started out for Oghratina and went straight on reaching a spot about 5 miles NE of HOD ED.DEBABIS quite close to the sea and among a tangled knot of undulating sand dunes.\n\nWe reached these sand dunes just after daylight and had no sooner laid down in the sand awaiting eventualities when a large shell probably a 6inch gun high explosive flew over our heads and exploded among the sand dunes about 300 yards beyond our position \n\nIf we had anticipated a quiet day the idea was quickly dispelled. Because shortly after the Turks shortened their range and the second shell burst close to some \none\n of the troops who were making for \n\ncover doing no damage. The Ayrshire Battery R.H.A. got into action with four guns and (as usual) took up their position directly in line with us which meant that every shell which fell short we would get its contents. The Turks searched every available spot with that high Explosive shell. it was interesting. The gunner searched from right to left and back again then high and then low but the 4 guns of the RHA. kept on barking sometimes one shell sometimes the whole four the guns firing as they did right over our heads the noise was earsplitting and my head ached for the rest of the day. All our horses were safe (more or less) under the lee of a long sand dune and while we remained there things were not too bad. \n\n9th Aug. Wed 1916\n\n2.15 pm. \"Bit up Everywhere! 2nd Regiment Mount\"! (Now for it!) We left the shelter of our friendly sand dune and came out into the open The high Xplosive in the meantime had been playing hell with our firing line, led horses Etc. The bullets had up to now not done much and in the face of those murderous guns they were ignored \n\nThe 2nd Regiment was ordered out on the left flank to an advanced position under the slight shelter of a low sand dune the hill (so called) was only about a dozen feet high No sooner had the regiment taken up its position there \nthan\n and \n\nhad its firing line out than \"Jacko\" opened out with everything \nhe could\n that could throw a projectile from bullets to 6’’ high xplosive shells. Shell after shell sometime two and 3 at a time burst close. horses going down like nine pins Absolutely the most cruel scene one could witness; the poor unfortunate beasts it was pitiful to see them some of them Came back to where the remainder of the Brigade had their led horses, bleeding & limping some \nwher\n were lying and struggling where they were struck down Numbers of them killed & some literally blown to pieces A dangerous job carrying despatches under such fire but those men of mine never flinched, never hesitated. Then the bullets came and they were like angry bees buzzing around one’s ears \"Pharoah\" my horse got hit in the rump with one Dorricott’s horse also hit & Corpl Cameron’s. Mercer’s horse got blown to pieces thereby saving the life of Mercer and Howard who were standing on the off side. Whole Batallions of Turkish Infantry were advancing under cover of the guns what was the ordinary rifle compared to that? The Battery Commander was ordered to open rapid fire with his Battery and (oh! the irony of it all!) he said \n\"I have only 20 rounds left and I am ordered to hold on to them!\"\n Good God! was there ever a more disgraceful situation in \n\nmodern warfare shell after shell was bursting among us killing horses and wounding men Batallions of Enemy infantry were advancing across the open country (a splendid target for artillery) the Guns had been firing all day as fast as the men could feed the Guns and now at a most critical moment, when we wanted the pressure relieved on our left flank and a few well directed shells would have done the trick we are informed that \"I have only 20 rounds left!\" \n\n3.45 pm.","198":"\n\n\"Retire in sections!\" Small parties come back right through a tornado of shells and bullets over that fire swept Zone & strange to say seldom getting hit at least not dropped, which is fortunate plenty of men & horses are hit but not seriously. wounded are brought back to comparative safety (I use the word \"comparative\" here its very fitting) because there was no actual safety. We moved back over the open ground amidst a chorus of bursting and shrieking high Xplosive shells, shrapnel and bullets and after being somewhat reorganized moved to a fresh position to cover the retirement of the remainder of the troops who were coming out of other parts of the firing line.\n\n4.30.pm.\n\nMoved out of that position and took up another one further back with a good commanding view just as the high xplosive shells\n\nstarted to rain down on our previous position. Those high xplosives are hell with the lid off. Something terrific & demoralising huge columns of smoke clouds of dust and sand & debris go sky high and the shock even hundred of yards away is terrible.\n\n5.pm.\n\nLeft our last position and the whole column marched across the hills\n\nto a palm grove near HOD-EL-DEBABIS where we gave the horses a drink the poor beasts were perishing and the water here was particularly vile There was fortunately plenty of spare horse feed so the horses had a good feed at \"Jacko’s\" expense there were about 1000 bags of grain which Jacko has left behind in his retreat.\n\n8.30 pm 9.8.16\n\nMoved out and made for Oghratina reaching here at 11 pm. Fed & watered and had a glorious sleep of 5 hours after one of the most eventual and red letter days of our life. \n\nI served 7 months and 10 days on Gallipoli and I saw and experienced that place during its most critical period but this affair to day – well Gallipoli pales into insignificance. The horses were our principal concern. We had to remain so much more in the open and were so exposed and Jacko made the pace exceptionally hot to make up for his crushing defeat at Romani \n\nNotes on the day. 9.8.16\n\nSeveral High Explosive shells landed very close to the Battery one landing so close that it overturned the limber. One shell landed right among the led horses of the Artillery killing about 20 horses and about 6 men I came past there shortly afterwards and they were busy with shovels burying the dead so that the Turks should not have the chance of stripping them. It seemed dreadful to think that those poor lads so full of life an hour before were now being buried under the sand and covered over and the sand scattered around \n\nBut this is war.\n\nOur Farrier Quarter Master Sergeant went about the scene of action fearlessly shooting the poor horses who were crippled and unfit for further service. A bullet just whizzed past my ear and buried itself in the Doctor’s horse and he had to be destroyed\n\nOur Commanding Officer Major Bourne has again proved that he is a capable leader; cool and resourceful under fire\n\nThe other officers and NCO’s & men were Splendid No shuffling behind led horses no scheming away on the lightest pretexts everyone willing to do his share in the great burden although facing fearful odds. The odds by the way were 10 to 1 against us. Shell after shell would burst amongst men and horses but never a budge \n\nThose Signallers of mine were Splendid They often had despatches to carry across fire swept zones but they did their work heroically and fearlessly. It is a pleasure to have such men under my command\n","199":" Oghratina.\n\nAwoke at 5 AM. we had our horses linked together for the night\n\njust outside the palms 2 brigades of us felt better after an uninterrupted sleep of 5 hours and after our exertions of yesterday. The horses are in rather a bad state badly tucked up for want of good water Many of them are broken up. \nAn\n A Taube came over this morning and we filed out and scattered and for the first time since I first heard a gun in this war (and I have heard a few) I felt rather nervous. I regret to record the fact that I who has never known what nervousness is, to feel all of a tremble when a Taube came over I have seen hundreds of them and have experienced the sensation of bombs when they are dropped from the skies but the fact remains I felt nervous.\n\nCorpl McDonald D.C.M. a man who has gone through the whole Campaign winning the Distinguished Conduct Medal on Gallipoli went away yesterday broken up completely We are bivouacking in some palm trees close to Oghratina and we have sent all sick and wounded horses in to Romani Camp and we are getting \n\nout every available able bodied man and every sound horse to come out here (about 12miles) so we may have some more \"go\" at \"Jacko\" yet.\n\n11th August Friday 1916 1 mile North\n\nof Oghratina\n\nWe are Camped about 1 mile north of Oghratina in a very nice shady palm grove. having a good rest. we came here yesterday afternoon and made Camp. I went to sleep at 9 last night and did not wake until 6 this morning. That is the first full nights uninterrupted sleep I have had for months. Felt absolutely good after such a good refreshing sleep. That is what kills most of our men. I say kill in a literal sense only loss of sleep never actually \nkills\n men but it is the cause of much physical & mental jag which probably developes into something else. If a soldier is suffering from any complaint; loss of sleep will certainly not better his condition \n\nI don’t know when we move from here probably tonight or tomorrow sometime (some unearthly hour I suppose as usual.) \"Pharoah\" is not suffering much from the effect of the bullet which he received the other day nor are three others who were hit. they were only flesh wounds (slight).\n\nWe are down on the old familiar Bully and Biscuits again. We have come across plenty of Turkish soldiers Rations which \n\nis like rolls of thin brown card board and very good to eat. It did not take us too long to find that out. It is composed of dried apricots and dates reduced to a pulp and rolled into thin sheets I have often seen Turkish prisoners eating this stuff but until the other day I never tasted it. Now I am looking for more. It is far in advance of our own Iron Rations Everyone in fact is far ahead of our people when it comes to feeding troops. Bully beef and hard Biscuits (neither containing much nutriment will soon wear the strongest constitution down. For my own part I know that my stomach positively rebels against that beastly unpalatable Bully. what can be better than eating dried fruit. It is nutritious, good for digestive organs good for the blood, and thirst quenching\n\n12th Augst Saturday 1916 Near Oghratina\n\nLooked forward to having a good spell today but was informed about 9 oclock that I had to accompany the Chaplain (Captain Gordon) with a burial party to go back to the scene of operations I had to go with the party to make sketches showing the correct positions of the places where the men of the 1st Brigade fell in Action on the 9th inst. It was a very long and hot ride out to the \n\n \n\nplace We reached there about 1.30 The place for several square miles is littered with dead horses and broken equipment. \"Jacko\" had stripped all the leather off the saddles And had taken anything which may prove serviceable to him also all dead as usual were stripped particularly boots they are always taken whether the clothing is or not. The ground was pitted for miles around where the high explosive shells exploded. These frightful shells killed everything for many yards around. The corpses were in a horrible condition being partly decomposed and I do not want that job again in a hurry. The sun had gone down when the last poor unfortunate was buried The chaplain read the burial service over each one separately we, all standing to attention around the grave at the conclusion we all saluted the brave dead and proceeded with the next & so on. We had a long and hard ride over the desert across the trackless undulating sand dunes marching purely by compass bearing and we got back to the palm grove near Oghratina about \n\n10.30 pm thoroughly tired out. The horse was also thoroughly tired out and could not eat his feed\n\n 13th Augst Sunday 1916 Romani.\n\nRomani once again! One is almost tempted to say -\"home\". It is of course our only home while we are here chasing Jacko about this benighted desert. Our friend \"Jacko\" by the way has departed from BIR-EL- ABD his last or nearly last depot before crossing a long waterless tract across the desert to his far away Base at EL ARISH. We have it on the evidence of prisoners captured that we have captured 4000 of him during the Romani Battle and our action the other day. He also states that in the Bir-El-Abd district alone he has buried 500 men. besides all those killed at Romani and Qatia and various incidentals. We have also captured strings of camels and thousands of pounds worth of war material \n\nSo the next time Jacko comes over our way with his loot bag under his arm he had better adopt some other tactics. Probably he \n\nwill think better of it. He’s not a bad sort of a cove the only thing we have got against him is that he robs & strips our dead Of course he goes for the superior clothing and particularly the boots worn by our men. He seldom has a pair of boots if he has, they are generally of a very inferior kind \n\n\"Jacko\" \nnever\n\n1. Poisons the water. He is a religious man and holds water sacred \n\n2. He never mutilates our dead, he strips them of their good clothing & boots Ghourlish to our Occidental minds but right enough in his\n","200":" He never uses and never has used – gas.\n","201":" He looks after our prisoners well – this is proved by the accounts of men who have had the misfortunes to be captured\n","202":" now my old fat friend you are getting nearly full with all this scribbling; I have been writing in you now for 8 months and I have not been sparing either I must now start another book and put you away and I hope that I may at some future \ndate\n day pass a dull hour in perusing your closely written pages. You will recall many a forgotten little incident or settle many an argument one thing I do pride myself on is that you are as correct as I can possibly make you. \n\n"}}