{"Document Name":{"0":"Diary_0447","1":"Diary_0447","2":"Diary_0447","3":"Diary_0447","4":"Diary_0447","5":"Diary_0447","6":"Diary_0447","7":"Diary_0447","8":"Diary_0447","9":"Diary_0447","10":"Diary_0447","11":"Diary_0447","12":"Diary_0447","13":"Diary_0447","14":"Diary_0447","15":"Diary_0447","16":"Diary_0447","17":"Diary_0447","18":"Diary_0447","19":"Diary_0447","20":"Diary_0447","21":"Diary_0447","22":"Diary_0447","23":"Diary_0447","24":"Diary_0447","25":"Diary_0447","26":"Diary_0447","27":"Diary_0447","28":"Diary_0447","29":"Diary_0447","30":"Diary_0447","31":"Diary_0447","32":"Diary_0447","33":"Diary_0447","34":"Diary_0447","35":"Diary_0447","36":"Diary_0447","37":"Diary_0447","38":"Diary_0447","39":"Diary_0447","40":"Diary_0447","41":"Diary_0447","42":"Diary_0447","43":"Diary_0447","44":"Diary_0447","45":"Diary_0447","46":"Diary_0447","47":"Diary_0447","48":"Diary_0447","49":"Diary_0447","50":"Diary_0447","51":"Diary_0447","52":"Diary_0447","53":"Diary_0447","54":"Diary_0447","55":"Diary_0447","56":"Diary_0447","57":"Diary_0447","58":"Diary_0447","59":"Diary_0447","60":"Diary_0447","61":"Diary_0447","62":"Diary_0447","63":"Diary_0447","64":"Diary_0447","65":"Diary_0447","66":"Diary_0447","67":"Diary_0447","68":"Diary_0447","69":"Diary_0447","70":"Diary_0447","71":"Diary_0447","72":"Diary_0447","73":"Diary_0447","74":"Diary_0447","75":"Diary_0447","76":"Diary_0447","77":"Diary_0447","78":"Diary_0447","79":"Diary_0447","80":"Diary_0447","81":"Diary_0447","82":"Diary_0447","83":"Diary_0447","84":"Diary_0447","85":"Diary_0447","86":"Diary_0447","87":"Diary_0447","88":"Diary_0447","89":"Diary_0447","90":"Diary_0447","91":"Diary_0447","92":"Diary_0447","93":"Diary_0447","94":"Diary_0447","95":"Diary_0447","96":"Diary_0447","97":"Diary_0447","98":"Diary_0447","99":"Diary_0447","100":"Diary_0447","101":"Diary_0447","102":"Diary_0447","103":"Diary_0447","104":"Diary_0447","105":"Diary_0447","106":"Diary_0447","107":"Diary_0447","108":"Diary_0447","109":"Diary_0447","110":"Diary_0447","111":"Diary_0447","112":"Diary_0447","113":"Diary_0447","114":"Diary_0447","115":"Diary_0447","116":"Diary_0447","117":"Diary_0447","118":"Diary_0447","119":"Diary_0447","120":"Diary_0447","121":"Diary_0447","122":"Diary_0447","123":"Diary_0447","124":"Diary_0447","125":"Diary_0447","126":"Diary_0447","127":"Diary_0447","128":"Diary_0447","129":"Diary_0447","130":"Diary_0447","131":"Diary_0447","132":"Diary_0447","133":"Diary_0447","134":"Diary_0447","135":"Diary_0447","136":"Diary_0447","137":"Diary_0447","138":"Diary_0447","139":"Diary_0447","140":"Diary_0447","141":"Diary_0447","142":"Diary_0447","143":"Diary_0447","144":"Diary_0447","145":"Diary_0447","146":"Diary_0447","147":"Diary_0447","148":"Diary_0447","149":"Diary_0447","150":"Diary_0447"},"Date":{"0":"unknown","1":284.0,"2":285.0,"3":286.0,"4":295.0,"5":296.0,"6":303.0,"7":308.0,"8":309.0,"9":310.0,"10":317.0,"11":318.0,"12":322.0,"13":324.0,"14":326.0,"15":334.0,"16":335.0,"17":338.0,"18":339.0,"19":341.0,"20":342.0,"21":343.0,"22":344.0,"23":345.0,"24":348.0,"25":349.0,"26":353.0,"27":358.0,"28":396.0,"29":397.0,"30":401.0,"31":402.0,"32":462.0,"33":466.0,"34":467.0,"35":468.0,"36":469.0,"37":470.0,"38":471.0,"39":472.0,"40":473.0,"41":474.0,"42":475.0,"43":476.0,"44":477.0,"45":478.0,"46":479.0,"47":480.0,"48":481.0,"49":482.0,"50":483.0,"51":484.0,"52":485.0,"53":486.0,"54":487.0,"55":488.0,"56":489.0,"57":490.0,"58":491.0,"59":492.0,"60":493.0,"61":494.0,"62":496.0,"63":497.0,"64":498.0,"65":499.0,"66":500.0,"67":501.0,"68":502.0,"69":503.0,"70":504.0,"71":505.0,"72":506.0,"73":507.0,"74":508.0,"75":509.0,"76":510.0,"77":511.0,"78":512.0,"79":513.0,"80":514.0,"81":515.0,"82":516.0,"83":517.0,"84":518.0,"85":519.0,"86":520.0,"87":521.0,"88":522.0,"89":523.0,"90":524.0,"91":525.0,"92":526.0,"93":527.0,"94":528.0,"95":529.0,"96":530.0,"97":531.0,"98":532.0,"99":533.0,"100":534.0,"101":535.0,"102":536.0,"103":537.0,"104":538.0,"105":539.0,"106":540.0,"107":541.0,"108":542.0,"109":543.0,"110":544.0,"111":545.0,"112":546.0,"113":547.0,"114":548.0,"115":549.0,"116":550.0,"117":551.0,"118":552.0,"119":553.0,"120":554.0,"121":555.0,"122":556.0,"123":558.0,"124":559.0,"125":560.0,"126":561.0,"127":562.0,"128":563.0,"129":564.0,"130":565.0,"131":566.0,"132":567.0,"133":568.0,"134":569.0,"135":570.0,"136":571.0,"137":572.0,"138":573.0,"139":574.0,"140":575.0,"141":576.0,"142":577.0,"143":578.0,"144":579.0,"145":580.0,"146":581.0,"147":582.0,"148":583.0,"149":584.0,"150":585.0},"Entry":{"0":"\n\n1914\n\n","1":" – Volunteered for Active Service – Sent to Rosehill Camp\n","2":" – Trans. Rosehill to Kensington –","3":" Batt. G Coy (1104)\n","4":" – Embarked Troopship A19 (Afric) in rain\n","5":" – Sailed from Sydney 5.30 p.m.\n","6":" – Arr. Albany\n","7":" – Route march through Albany\n","8":" – Fire No. 6 Hold\n","9":" – Dep. Albany 8 a.m., 38 Transports & escort\n","10":" – Off Cocos Is.\n","11":" – H.M.A. Sydney Captured German Cruiser Emden\n","12":" – Crossed the \"line\"\n","13":" – Arr. Colombo 1.30 p.m.\n","14":" – Dep. Colombo 7 p.m.\n","15":" – Arr. Aden 4 p.m.\n","16":" – Dep. Aden 6.30 p.m.\n\nPur. Soldiers Diaries Collection","17":"\n\n1914\n","18":" – First news of going to Egypt (Cairo)\n","19":" – Arr. Suez\n","20":" – Dep. Suez Indians all along Canal\n","21":" – Arr. Port Said 6 a.m.\n","22":" – Dep. Port Said 6 p.m.\n","23":" – Arr. Alexandria 8 a.m.\n","24":" – Berthed & commenced disembarkation\n","25":" – Left A19 entrained to Cairo 8 a.m. thence tram Mena\n","26":" – First leave Cairo\n","27":" – Proclamation read & British flag hoisted\n","28":" – Xmas Day on Guard No Xmas Dinner\n","29":" – Sphinx to have photo of \"G\": Coy taken\n","30":" – Sir Geo Reid’s visit\n\n1915\n","31":" – Platoon Organization commenced.\n","32":" – Sir Ian Hamilton\n","33":" – Riot in Wasser – Fire. Good Friday, Battle of the Wasser\n","34":" – Struck camp. Dep. Mena 11.30 p.m. route","35":" – Arr. Cairo Rly. Stn. 3.37 a.m. Dep. Cairo 5.30 a.m.\n\nArr. Alexandria 12.30 p.m. Embarked on Troopship A11 (Minnewaska)\n\nTea 1 loaf bread for 14 men only ration\n","36":" – Breakfast Bread & butter & Coffee. Dinner Beef & potatoes. Tea Dry bread & Tea.\n\n6\n Slept on deck in rain. Paraded on wharf & given new sleeping places. Ours worse than before, now on stone floor under stairway where horse dung drops on us. A real troopship this time – rotten – 500 horses – 1700 men\n\n1915\n","37":" – (Contd.) & Hd. Qrtrs. Staff – 2 blankets & W.P., no hammocks, no mess tables. Old \"Afric\" a paradise – Horses above us - moved out into stream – tied up with \"Armadale\" A26.\n\n6 – Breakfast. Bread & Butter Coffee. Settling down now \"D\" Coy. for duty, escaped guard.\n","38":" – Still in stream. Muster parade full marching order each day. Mail in.\n\n8 – Still loading. Met Corrigan. Wireless on our boat. Rcd. 1 letter from Mother & Keith, 2 from Ruby Barrett, 1 from Aunt Jess. Stew & duff for dinner best so far. Armadale left us. A very noticeable feature of the Aus. Troops is that they are all clean shaven. \"Egyptian Mail\". Still sleeping on deck.\n\n1915\n\n\"Egyptian Gazette\"\n","39":" – 1894 Commandant Deport was completing his famous \"75\" at Puteaux – Germans got wind. General Deloye took it in hand. A foreman at Puteaux bribed & handed over to emissaries of Col. Von Schwartzkoppen plans of new gun. They were plans of the Ducros gun. France bluffed Germany, kidded them this was their new gun. One Ducros was purposely mislaid with a caisson of shells & soon found its way across the frontier. In 1896 German had evolved its 77 gun same type as the Ducros with faster fire. Same year the Deport gun was perfected & became the standard weapon of the French Army. The secret was well kept.\n\n1915\n\nApr. 8 – It is necessary that all correspondence be censored & it is therefore liable to serious delay. It is preferable to carry on corr. by means of printed P.C;s (Service Cards). Letters censored by O.C. Coy. who will frank each by writing his name on text. The name of place or unit not to be written at head of letter.\n\nWarned for town picquet but cancelled.\n\nAttempted assassination of Sultan of Egypt.\n\nApril 24 – Address in future – L\/Cpl. E.H. Ward (1104) \"D\" Coy, 1st Batt. Mediterranean Expeditionary Forces.\n\nApril 2\/15\n\nGood Friday\n\nThe Battle of the Wasser\n\nOn April 2nd the day before leaving Mena I went to Cairo on leave. The greatest bit of fun since we have been in Egypt took place in the notorious Wasser.\n\nAbout 5 o’clock \nthe\n a disturbance started through a native & a soldier & developed into\n\na riot by night. The house in which it started was stripped of all its furniture & a bonfire was started in the middle of the street which was kept going up to 9 p.m. Beds, chairs, shutters &c. were piled on the fire. The trouble started through the Red Caps firing on the crowd. They then became furious & wrecked every shop & house\n\nin the vicinity & carried off tobacco, cigarettes & drink in galore. One woman’s house was set on fire. A Company of the Lancashire Territorials were called out but were powerless with fixed bayonets, more arrived then a whole battalion of Infantry marched through the streets & drove the surging masses back. The Fire Brigade arrived but the rioters pinched the hoses & cut them into small pieces & used the nozzles as \na\n battering rams to smash down the doors & shutters. Not a pane of glass remained in tact. The Fire Brigade & Tommies retreated under a hail of beer bottles & in a foot of water. Later the motor fire engines\n\nreturned with a body guard of 50 light horsemen & after much effort succeeded in putting out the huge bonfire. But for the glare of the bonfire the street was in darkness every business place being closed. The excitement lasted till midnight fresh re-inforcements were sent from Mena Camp to patrol the streets. 5 were wounded by revolver shots & one is supposed to have succumbed.\n\nAs per letter dated March 28th. As per letter.\n\n1915\n\nApr. 9 – Wrote short censored notes to Mother, Aunt Jess, Amy Mitchell & Ruby Barrett. Still in harbour Alexandria. Wild Woodbine Cigarettes on sale on board 1d. Pkt. General Birdwood’s stuff come aboard. Generals & Staff came aboard 4 p.m.\n\nApr. 7 – Oh, Ha! Appointed L\/Corporal to date from","40":"\n","41":" – Left Alexandria 8 a.m. Smooth sea. Orderly Cpl. Pay Day Rcd. £1.\n\n11 (Sunday) – Island of Crete on Starboard side 8 a.m. Passed troopship with pontoon in tow. Land all day. Lecture by General Birdwood to Officers & N.C.O’s. I went. General Bridges & Staff present. Special\n\n1915\n","42":" – parade to read orders for disembarkation. 3 days Rations – 200 Rounds Ammunition. Try Pontoon – holds 101 men 2 officers. Land on starboard all day. Dearth of silver on board, can’t change £1. Dearth of matches.\n","43":" – We have rifle inspection each morning & play 500 & sleep remainder of day. Arrived Lemnos day break, lying in bay all day. Changed £1. Wrote short censored notes Mother, Ruby B. & Aunt Jennie (promotion). Went for row in ship’s boats all round bay & amongst Fleet. Saw 3 submarines. Landed at small village.\n","44":" – More boat drill & rowing – me one of crew again – went ashore again – had a good plate of rice cooked in Greek style\n\n1915\n\n(Contd.) cream cheese – wine - crystallized pears & plums, chocolate &c. couldn’t eat any ship’s tea – quaint little Greek village – Field Hospital – 3rd Brigade ashore. Generals leave to make reconnaissance on Dardanelles.\n","45":" – Whole Battalion go ashore in boats, me one of crew rowing all morning. Went to H.M.S. Hussar with mail & A.O. With 6 sick relieved at 2 p.m. had snack & rested. Becoming expert oarsman.\n\n15 – Went ashore & had a swim. Rowed over to see the Dreadnought – H.M.S. Queen Elizabeth. She has 8 15\" guns & 12 small guns. Also saw H.M.S. London.\n\n1915\n","46":" – 3 yrs. to-day the loss of the Titanic. First issue of Bully Beef & whole meal biscuits. 1 1\/3 tin Bully & 7 Biscuits per man 24 hrs. Tea twice a day. Still lying in Bay. Figs (dried on strings) & Turkish Delight main delicacies. Dearth of oranges – buying lemons to eat now.\n\n16 – Whole Brigade went ashore in boats towed by naval tugs, 5 & 6 boat loads to a tug 230 men. Attack & Defence – counted 81 transports in harbor. Bully Beef – biscuits – cheese & 3 lbs Jam per section issued. Bathing parade – some got sea-eggs in their feet. Sleeping below since some brute trod on my nose. No brandy & Champagne (fizz) in sight but one chap went out to\n\n1915\n","47":" – it through tasting some Greek Whisky.\n","48":" – Stayed aboard all day \"C\" went ashore. Ration of bacon in addition to other rations. Best feeding since on boat.\n","49":" – Church parade. Col. Green Chaplain – General Birdwood addressed us – Sick Parade. Corporal – Route march on Lemnos Island. 106 boats in harbor. Hydroplane over harbor.\n","50":" – Rifle Inspection only easy day – Bathing parade. Another pay coming. No razors to be carried on trek – Bread ration twice to-day, bacon breakfast – Tea, cheese & Jam. Australian mail delivered. (A letter from Lousy Lil boys). Rcd. 2, one from Reg & one from Mrs. C. Strange, C\/o Mrs. Murray – Myre House, Murray Avenue, Sandhills, Newcastle.\n\n1915\n\nPay Due\n","51":" – Short censored notes to Mother & Miss Allen – Amy Mitchell, Aunt Jess without envelopes. Pay Day. Too late to get letters in. Reading \"Mid the thick arrows\" by Max Pemberton – Paid £1 to-day. Last pay before disembarking. \n\nPay\n\nTotal due to date @ 5\/- day - £46\n\nLess Amt. Rcd to date - 16.12.3\n\n£29.7.9\n\n+ 184 days deferred @ 1\/- day – 9.4.0\n\n£38.11.9\n","52":" – Wet day \"No parade to-day\". Never trust a woman who closes her eyes when she speaks to you – its infallible. Blew a gale all day, one big boat & several small blown ashore.\n\n1915\n","53":" – We still receive the unadorned dry biscuit – the same way of eating them – eat the corners off first & then eat them square again – this continues till the biscuit is no more – some are very good, they are wholemeal – Expect to move tomorrow night. Dearth of bread on board – one boat from Lemnos came alongside loaded with bread & sold out in an hour at 6d. per small loaf – \"D\" Coy on guard – me being Sick Parade Corporal. I escaped. Our \"pugs\" are now selecting meal times as best time to settle arguments with bare fists. Bully Beef & bacon now the favorite dish.\n\n1915\n","54":" – Reading \"A Scrap of paper\" by Dr. E.J. Dillon.\n\nApr. 25 – 1000 donkeys landed with dummy baggage & guns, covered by heavy fire of battleships. The real landing was effected some distance up the coast. The donkeys were bought for a mere song & annihilated. 670 prisoners were taken.\n","55":" – Left Harbour at daybreak. Special parade 10 a.m. to issue 200 Rds. Amm. & rations. All naval men on land will be in Khaki. German aeroplanes have a black cross, make for a tree, house or broken ground. Major Swannell read King’s message. 3 days rations, full waterbottles & one canvas bag of water for every 15 men.\n\nGallipoli Peninsula (Sari Bair) Dardanelles\n\n1st 4 days perfect Hell on earth, no chance of keeping a diary, see later writings.\n\nApr. 25 – Landed at 8 a.m. Sunday. Went straight into firing line, advanced under heavy shrapnel & Rifle fire – 1st bayonet charge reinforced left & got cut off – at night held left flank till 16th arrived – turks came right up – Major Swannell killed, Capt. Jacobs new O.C., big casualty in","56":" A terrible day. Heavy Casualties. \n","57":" - Held ridges under heavy fire all day.\n","58":" – Awful artillery duels. Heavy firing everywhere. Turks sound our charge, reinforcements arrive.\n","59":" – Holding ridges. Turks shelled position at night.\n","60":" – Rtd. to beach to dig in. Clean up, Rest, swim & Roll Call. 21 men, 12 officers\n","61":" – At Beach all day. Saw barb entanglements,\n","62":" – At Beach all day. \"Shrap.\" as usual – moving 6 p.m. to go into trenches on ridge, going in trenches all night.\n","63":" – One week to-day since landing. Fighting in trenches all day on ridge. Firing all night.\n\n1915\n","64":" – Still in R trench, bombarded by Howitzer twice during day, also enemy’s machine gun. Allen wounded. Shells landing in trenches. Can’t re-dig trench on a\/c Turks gunfire. Relieved at 5 p.m.\n","65":" – Trenches all day. Visit by Generals Walker & Bridges. Turks entrenching in front. Getting Machonochie Ration of meat & potatoes – plenty to eat in trenches. To-day we got 1 Mac to 4 men, biscuits, cheese & jam, tea & sugar if wanted. Water is harder to get having to carry it up steep ridges in kerosene tins – Went into fire trench 5 p.m. me & Hood N.C.O’s. Some Turks came up to trenches & put down arms. Mail at Base. Jim Row still my mate. Cold nights, hot in day – Cold – Touch of Heartburn.\n\n1915\n","66":" – Usual breakfast greeting of shrapnel. Turks played hell with our trench 2 days ago – made 2 attempts to rebuild in daylight & each time Turks turned their guns on us. I don’t like their explosive bullets – we don’t seem to know where they fire from, they may have them silenced – snipers give us a lot of trouble at night, they use a decoy. When we fire they watch the flash & both fire – we have good shrapnel cover now & better trenches more of them – Shelled our trench again at 10.30 putting in about 80 shells & again later filling it with clods, bullets & smoke several times. Rcd. 1st letters in trenches, 1 each Mother, Amy Mitchell, Lettie Wass & Lil Steer.\n\n1915\n","67":" – Stopping here till Sunday until communication trenches are complete – Usual shrapnel duels but quiet to-day – Health good – Cold nearly gone. Casualty list diminishing – Jack Bruce’s sapping operations seem to be a failure – The bullets of 2 Turkish machine guns still dance along the top of our trench – we can see Turks digging below in the Valley all day – relieved last night & had a good rest up – on again tonight. Have a fine dug-out now – shrapnel proof. In Fire trench again tonight, me & Booth Corporals – quiet night – Rum Ration & very nice we found it – coldest night yet - \nNo blankets yet\n. 11th Day.\n\nFrid. 7th – Made stew of Maconochie Ration & Bully. Enemy’s big gun played havoc on beach yesterday killing several donkeys & 30 men.\n\n1915\n","68":" – Turkish Officer rode in with White Flag & gave himself up (6-5-15). Usual Artillery duels. Turks shelled our trench in afternoon. Fort Guns again troublesome. Much Artillery firing, expected night attack, but did not come off. Cold night.\n","69":" – Service P.C’s issued, sent 1 to Mother & 1 Aunt \nJess\n Carrie N.Y. According to the Turkish Officer who gave himself up Thurs., the Turks call us cannibals & think it better to be shot than be eaten alive. The Tommies say we Australians are mad, they have christened us \"The White Ghurkas\". Rcd. aluminium Jar of Tobacco from Arthur W. Pashley, 629 McDonough St., Brooklyn, N.Y. Bless his heart. Hood & I Corporals in trench tonight, fairly quiet. Turks sapping on our R & L front. \nto\n We made new traverses & did some sapping to prevent enfilade fire. Rum slightly improved.\n","70":" – Landed 2 wks. to-day, reinforcements continue to arrive. Turks must be observing our Sunday as things are so quiet, deepened trenches 6\" to 20\" & engineers put in traverses, two cooks appointed to cook for 47 of us. Played six games of 500, me & Jim, Dave Russell & MacIntyre, we won 4-6 played for 3 matches a game. Jack Bruce strikes daylight 30 odd feet out. Jack is our anarchist, he throws the hand grenades with deadly accuracy. Sgt. Patterson Q.M.S.\n","71":" – Fairly quiet – getting our 9.2 in position – Col. Dobbin visits us. Lusitania rep. sunk 2000 lost. Snipers still give a lot of trouble with their automatic pistol & tripod well concealed. Not getting so much rations as at first. Q.M.S. Blunden told me I have been recd. for promotion. Fire trench tonight, nothing exciting usual firing all night. Much artillery on right flank – Turks guns still sweep beach. We have a canary which hops along the top of our trench every morning. I think he has a nest above me as the sand-bags are full of bullets.\n\n1815\n","72":" – Dearth of matches, 8 & 10 cigarettes lit from one match. About a week ago our little trench received its most severe bombardment. The Turks turned their howitzers on us & plonked eighty odd shells in & around us, 37 ploughed up the earth in front of trench, knock down sand bags, half filled the trench with sandbags & earth & almost suffocated us with vile smoke. We also gathered up some pounds of shrapnel balls. I stuck it until a sandbag lobbed at my feet with a shell through the middle & still smoking – I moved ten yds. – a couple more shells arrived & they ceased. This little stunt lasted one hour & we literally \"smelt hell\". No one was hit, although some of my men were half buried in dirt. The trench was \nhalf\n full of smoke ½ the time in which we choked & spluttered & cursed. \nalthough\n I attribute this to the cure of my cold. The shells have a horrible sound exactly like the rip of tearing a starched collar & the whistle of a railway engine mixed. You hear them coming – you bob down - & wonder with every muscle tight & lips closed, will it land on our bit of trench this time or not – Then the whistle goes over or finishes in front with a hellish crash & much flying dirt & stones & you are a little safer for another minute or so. Our first day was like hell itself – we had to advance through low scrub exposed to heavy shrapnel & rifle fire – we don’t want it again. At the end of those 4 terrible days (April 25-6-7-8) we totalled only 421 out of 1100 odd – gradually we have entrenched & we now have very fair cover. We have been in this trench since night of May 1st. The last 10 days work has been in the trenches – it is rather nerve-racking especially at night when a bold Turk creeps up with an armful of grenades to heave at us. The Turks are digging in on both our flanks – we watch them all day & do much potting. They often wave us a \"wash out\" (miss) with their spades. They delight in pinging at our Hypo-scopes which have been more or less improvised – to-day we received an issue of real ones. People who work in the gardens all day Sunday have no idea what War is like – its horrible – the awful sights of dead & wounded become every minute occurrences. The first minute after leaving our transport was sufficient to harden me for what was ahead – we stepped into the small boat to be towed ashore & my seat was near a great pool of blood in the bottom of the boat & much blood stained equipment lying about this combined with a few breezy remarks concerning the dead & wounded lying about the shore had the peculiar affect of keeping my spirits up. Still war has its comic sides & we laugh to split our sides at the many close shaves in a bombardment such as above. Most of the old South African men say we saw more fighting our first 4 days than lots of them saw all through the Boer War. Our casualties totalled 4000.\n\n1915\n\nMay 11 – Issue of 24 cigarettes (Hills Campaigner) & 1 oz. of Capstan per man, also 1 box matches per man. The solacing & inspiring qualities of the above all help us to win our battles, they have a species of intoxication occasioned by their fumes which seem to alleviate our discomforts. I gave my share of Capstan away but am hanging on to that valuable lot rcd. from Arthur Pashley a day or so ago. It is said the French failed in the Franco-Prussian War on a\/c failure of their Commisariat Tobacco being a very big item – French had none & the Germans had a good supply. Dull day – started rain 12 o’clock. Bombardment on R flank all morning. Put in new loop-holes. One blanket per man issued tonight – Relieved at 5 p.m. – Alan Lakeman & McArthur over. Started to rain. Another blanket issued.\n","73":" - \nRaining\n - terrible sticky mud – Jim & I played Whist – plenty of rations to-day, Cheese biscuits & Marmalade – stew – Maconochie (1 to 2 men) Rum – Tea twice – 2 Bot. Limejuice 48 men. Great artillery rumbling on R most of day & increased from 5 p.m. to dark – Light Horse arrive & go into trenches – Turks gave us an overdose of shrapnel at 6.30 p.m. perhaps we were finding too many of their loopholes. \n17th Day in Firing Line\n. Trench (fire) tonight. \n","74":" – Shrapnel breakfast – killed a snake 3 feet long in Communication Trench – Warm bright day – Sent 2 Service P.C’s one Mother one to Arthur Pashley. More mail none for me. Lieut. Thompson tells us yarns of India.\n","75":" – Moving to left of trenches. Changed with 4th Batt. Rotten place exposed to shrapnel & rifle fire in rear & often get enfiladed, several wounded to-day. Plenty of fatigues, trenches in rotten state at parts badly need deepening.\n","76":" – Put in charge of No. 7 Sect. 14th – Jack Turner – Platoon Sgt., Lieut. McIntyre in charge. Fairly quiet in daytime along our front except Shrapnel. Went into firing line 9 a.m. 24 hrs. The Navy say we are the finest fighting troops in the world – some of the Tars put Australian uniforms on. Italy declares war. Turks attack at 2 points of our line.\n\n1915\n\n& went into trenches to fight & were arrested & taken to boat.\n","77":" – Not so quiet as last Sun. – plenty of shrapnel in morning. Wrote Service P.C. (19) Mother & Ruby. Dug cooks kitchen at night.\n","78":" – Trenches – we do 24 hrs. in & 24 hrs. out now – things much improved – Have not had a wash since May 1st with exception of hand wash (2) & shave with water-bottle. Still improving trenches. Turks firing an 8\" gun now. Capt. Hill wounded. Our Waterplane flew over the Turkish trenches at 6 p.m, they fired several shells at it forming a true Southern Cross with 6 shrapnel shells, however they failed to get anywhere near it. More troops landing. Cleaned my teeth with brush & paste I found, first clean since landing. Q.M. Sgt. \"C\" killed (Sgt. Horne) by shrapnel – Turks poured shrapnel into us at dusk followed by 8\" gun.\n","79":" – No sooner daylight than we got a good dose of shrapnel combined with their eight inch gun which enfiladed us. During the day they gave us 3 doses of shrapnel & 8 inch firing 54 - 8 inch shells. The worst lot yet. Expecting night attack tonight – later – night attack as expected every man \"standing too\" all night.\n\nWed. 19 - Went into trenches at 3 a.m. trench outside full of Turks – awful night – full force of attack at daybreak – We got beans from their shrapnel, lost \nseveral\n 28 men killed & wounded in D Coy. Turks retired to their trenches under heavy fire at 6.30 a.m. Rcd. letter dated","80":" from Aunt Jess yesterday. Took 14 prisoners in our section. Rcd. letters from Ruby, Aunt Carrie & Jennie.\n\n20 – Still in fire trench, awful day yesterday. Out today 1 p.m. in again at 7 p.m. expecting another night attack from Turks. General Walker & Turkish General confer – we raised Geneva Red Cross to communicate with Turkish Crescent & allow Turks to bury their dead on condition we take their wounded as prisoners. Turks raised Crescent & came out but would not agree to wounded being made prisoners – Armistice\n","81":" – (Contd.) postponed till 8 p.m. Turks to fire first shot. Through misunderstanding an out-burst of fire started about 7 – every man \"stood too\". Artillery duel roared late into the darkness – mostly our guns firing – Turks guns fairly quiet to-day – must be moving. We used trench mortars for 1st time, rotten night, but did not fire as much as last night – Turks kept up heavy fire all night evidently thought we were attacking – \"Mother Kirby\" only fired 2 shots – reported 2 days ago she was blown up from its position in front of a Hospital. There are 2 eight inches – Turks still sapping towards us. Losses of Turks estimated at 2000 killed & 5000 wounded Wed. morn.\n","82":" – Being relieved at 1 p.m. for 6 hrs. Snipers still at work in gully, caught Taffy James in leg to-day, quiet day fair night all \"standing by\". Mrs. Kirby put a few shots in to us at sundown.\n","83":" – Still in trenches – fairly quiet – new clothing issued to some a day or so ago, some wear their breeches inside out on a\/c of lice, fairly quiet night – our trench mortars do good work.\n","84":" – Relieved by Light Horse at 8 a.m. dug in on side of hill near beach, quiet day & night little firing. Mail in.\n","85":" – Armistice commenced at 7 a.m., finish 4 p.m. burying dead & collecting rifles &c half each side. Had a swim first good wash since May 1st. German aeroplane flew over & dropped a bomb near our position, rained.\n","86":" – Rain. Fairly quiet – Scrubbing – Fresh steak & bacon for dinner. Queensland Light Horse on other side of gully from us – Reg Donkin with Jim Row & I – witnessed the sinking of H.M.S. Triumph (Battle Cruiser) to-day only a few hundred yards away – sunk by submarine.\n","87":" – Fatigue – carrying barb wire up to Brigade Hd. Qtrs. 2500 re-inforcements arrive & details. The \"Triump\" 17 times in action, fired 2000 rds. & was hit 14 times. Funnell riddled with shell, one which penetrated the turret where there were 15 men, only one was killed. Another entered the commanders cabin. Our aeroplane flew over & dropped 2 bombs on Turkish trenches. Improved our dug-out.\n\n1915\n","88":" – Dull day – Shrapnel started at 5 a.m. Our airman dropped more bombs on Turks. No fatigues to-day. Majestic was sunk a day or two ago. 3 new men added to my section, now have 10. The country looks lovely. Dead Turks rot amongst the lovely red poppies.\n\nFrid. 28 – Turks give us gip with their guns, a six inch shell lobbed a few feet from our dug out & carved a piece off side of gully doing no damage. Our 6\" got this gun later. Still spelling. Corporal of picket tonight.\n\n29 – Heavy firing both sides started at 4 a.m., artillery duels lasted till 8.30 a.m. tons of shrapnel – we lost about 5 wounded – Turks attacked our trenches last night – Sapped in got part of our trench but we recovered it soon after. Big attack expected tonight. Going into trenches this afternoon. Enjoyed spell of 7 days but for many doses of shrapnel. Big mail in, Rcd. 6 letters. Relieved \"C\" Coy 6 p.m. told off with 27 Sappers as Cpl. Capt. Sasse our O.C. now. Lieut. Shout back with us – Rumoured British have captured Achi Baba Hill which commands position. \"Triumph\" (11985 tons) had 4 10\" guns & 14 7.5 guns. No more rum all in sea.\n\nSunday, 30 – Our trench snipers now have perescopes fixed on rifles. To-day 5 wks. ago our disembarkation begun before sunrise. The Aus. & N.Z’s landing at Sari Bair to the north of Gaba Tepe in open boat towed by steam tugs & destroyers. We landed in an open boat some yards from shore in the midst of heavy shrapnel fire, most of us were drenched to above the waist in wadeing ashore there being no time to throw out a gang plank, it was a case of make for the nearest cover. Our landing was well supported by the Fleet & landings were carried out on six beaches – 5 being very successful. On the 6th beach Sedie Bahr the troops could not advance until evening. The result of the day’s operations was the\n\n1015\n\nMay 30 – establishment of strong positions by us here (Sari Bair). British at Capes Tekeh & Helles & near Morto Bay, French at Kum Kale. During the afternoon of the 25th strong counter attacks by the enemy began & hard fighting took place. At the end of a terrible day I found myself on the extreme left of our line with about 50 others drawn from various units, we held the ridge called Quinn’s Post ? until the 16th Battalion came up to reinforce us at 10 p.m. Here the Turks came right up to us & were mistaken for Indians, needless to day, we soon poured it in to them when we discovered our mistake. On the 26, 27 & 28th were engaged constantly with the enemy who made strong & repeated counter attacks which were invariably repulsed. Early on the morning of the 27th a fresh Turkish Division was launched against us, preceded by heavy artillery fire. The enemy came on boldly but we defeated every attempt & by 3 p.m. had resumed the offensive. The operation of landing the army in the face of modern weapons, in spite of wire entanglements, in parts 50 yds. wide & under the sea as well as on land, land mines, & deep pits with spikes at the bottom has thus been accomplished. On the 29th after four days hard fighting we were relieved to go to the beach & have a Battalion muster & general clean up & rest for 48 hrs. Here we totalled 421 men & 12 Officers out of 1100. The hills overlooking the beach being honeycombed with \"dug-outs\" to protect the men from shrapnel while resting. A refreshing dip in the briny & a good feed turned us into new men. On May 1st we proceeding to the fire trenches on the right (Now Brigade Hd. Qrtrs.) 48 of us & on May 14 we changed with the 4th Batt. on our left in order to get all the 1st Batt. together. On","89":" we were relieved by Light Horse for a weeks rest & light fatigue. \n","90":" – Our artillery storm Turks trenches on left flanks & light horse make a charge & captured a Turkish Trench. Met Arthur Meade in trenches B Coy","91":"\n\n1915\n","92":" – Fire trench all day. Turks have a gun trained right on to our trench at close range, wounded 2 men – fairly quiet off at 5 p.m., rcd. shirt issue. More of the old Coy. return from hospital. \n\n(XX duty)\n","93":" - Communication trench duty. N.C.O’s now supporting authority in accordance with their duty. N.C.O’s to see that all orders are complied with to fullest extent according to the letter & spirit. Any failure to be severely dealt with. All ranks must remember that in war it is the last ounce that tells & to allow any slackness is to invite disaster – Extract 15 B.O. No. 9. Changed system of reliefs to-day. Tobacco issue & 1 Box matches & 1 pkt. Honeydew Cigarettes. Had charge of fatigue party to bury 3 mortified corpses – awful job, only buried one – used respirators, drank neat rum & smoked cigarettes. Corpses over a month old. Hope I never have such a job again.\n","94":" – Tom Barnby & Sig. Macdonald returned from hospital. I am Orderly Corporal this week. Buried other 2 corpses.\n","95":" - \nKing’s Birthday\n 39 days in firing line. \nPrince of Wales\n King’s Birthday. Go into firing line. Meade went to doctor with \"steel on liver\" & he hunted him.\n","96":" – Heavy bombardment on right flank, commencing 10 o’clock. Attack on Achi Baba. Paraded sick, Meade present. I was told he is up for Court Martial. 8 of our men went out to capture a machine gun tonight but had to return on a\/c of an old trench in front being packed with Turks. A & B Coy’s make a charge, rough night. Artillery duel before daybreak.\n","97":" – Turkish losses at Quinn’s Post affair more than first expected between 1500 & 2000. Issue of rum last night to drink King George’s health. Dunno why the Kaiser spells culture with a K unless it is that Britain has command of all the C’s. L\/Cpl. McIntosh, Dentist, pulled a tooth for me today. One division of Turks met another & mistook \nthem\n one another for the enemy.\n\n1915\n\nSat. 5 – A lively engagement lasted 4 hrs. about 800 were killed & 1500 wounded.\n","98":" – Sunday. A & B Coy’s charged German Officers trench at about 2 o’clock Sat. morn., lost 4 killed & about 25 wounded. Arthur Meade reported missing. To-day (Sunday) usual artillery duels otherwise fairly quiet. Our party attempt machine gun in German trench second time & Elart & Morris shot by one of our own men returning. \"B\" go to spell \"C\" return.\n","99":" – Turks poured shrapnel into us at 11 a.m. enfilading our trenches at Nos. 7 & 8 Observation Posts. Poor Harry Jones, McDermott & Dillon killed & 6 wounded – Forming new machine Gun Sections calling for volunteers – Ship’s Canteen orders taken, relieved Bill King before dinner. In firing line.\n","100":" – Went into new firing line last night for 1st time in charge of 14 Platoon. Issue of 4 pkts. Wild Woodbine Cigarettes per man. We attacked on left flank early this morning.\n","101":" – 45th day in Firing Line. \"Sandy\" emptied the trench can of urine & cut up the cheese soon after – water cannot be wasted on ones hands. We all ate the cheese & raised no objections. I made some \"Burgoo\" out of 4½ wholemeal biscuits well pounded up & boiled with sugar – jolly fine. The last reinforcement to join my section has a pronounced habit of fingering his nasal organ & chewing the ends of his fingers. I think it must be either German \"kultur\" or incipient insanity. He also handles the cheese but nobody objects. Plenty of \"Shrap\". Reminds me of a steam laundry not far from my old diggings in London, when they used to throw the tin baths about – no plurry good.\n\nThurs. 10 – Rumoured that 2nd Brig. relieve us tomorrow. Made porridge out of wholemeal biscuits ground to flour in a bag – ate cold with apricot jam & fresh meat stew. Went into firing line tonight.\n\nFrid. 11 – Moved out at 3 p.m. 8th Batt. relieved us. Camp near Shrapnel Valley. Went up under Shrap. to support 2nd Batt. on R flank, quiet night.\n\nI was paid in full to date of embarkation at Sydney Oct. 18th 1914. Amount due to me up to","102":" (to-day) is as follows.\n\nDays\n\nOct – 13\n\nNov. – 30\n\nDec. – 31\n\nJan. – 31\n\nFeb. – 28\n\nMar. – 31\n\nApr. – 30\n\nMay – 31\n\nJune – 10\n\n235 days\n\n235 days @ 5\/- day - £ 58-15-0\n\n235 days deferred @ 1\/- - 11-15-0\n\n£ 70-10-0\n\nLess total amount received to date (10\/6\/15) last pay being","103":"\n\n£ 70-10-0\n\n16-12-3\n\n£ 53-17-9\n Amt. due to me on Thurs. June 10\/1915\n","104":" – Returned from R flank to dugouts at 6.30 a.m. Rested all day. Went down to beach for swim. A & B Coy’s supports to 2nd. Mail in Rcd. 4 letters. Major Kindon now C.O. Batt. & Davidson Major.\n","105":" – Went Church parade & swim after. Torpedoe boats open heavy fire on Turks Battery coming up to reinforce. Our aeroplane flew over & dropped 2 bombs on Turks trenches at Quinns Post. Getting very hot, flies bad. First issue of fresh bread to-day, 1 loaf between 2 men. C & D Supports tonight. Went up to Brigade Hd. Qrtrs. to draw 6 bags mail. Just got out of sea in time this morning when Turks started shelling beach. Had to run gauntlet on way round to support 2nd Batt. Turks poured shrapnel into us from along beach.\n","106":" – Returned to camp, run gauntlet again. I carved out 150 yds. in about 15 sec. Rested all day. Heavy bombardment on R flank.\n\n1915\n\nTues. 15 – Learnt Bridge 1st time. 5½ packets (55) Woodbines per man. Bought tin condensed milk","107":" & made wholemeal porridge.\n","108":" – Turks gave us more shrapnel than usual, killed more than usual on beach. Eggs selling at 4d. each.\n","109":" - Went for swim. D coy on Div. Fatigue. \"Canopus\" sunk. C & D Supports, more old \"D\" return. Just got out & dressed to-day & a shell burst near us.\n","110":" – Turks fire shrapnel at 10 o’clock at night first time night fire since 3rd day after landing.\n","111":" – Cooks get crabby & won’t cook. We cook our own tucker, made Bully Beef rissoles with Bully Beef onions & dessicated vegatables. Our airman dropped 2 bombs on Turks.\n","112":" – Came out of trenches at 5 a.m. We supplied 175 men for Divisional Fatigues to-day. Went to Divine Service, Colonel Green preached. 56th day in firing line.\n","113":" – Sent 1st letter home. Mail in. New appointments among N.C.O’s. Turks have bomb proof cover & yet they throw bombs when we attack. We found out they throw the bombs from behind the parapet.\n","114":" – 25 men per platoon go up to 2nd Batt. Went swim. \"What time I am afraid I will trust in thee\", Psalm 56.3. Above men wanted as sappers.\n","115":" – First F.S. P.C’s since 31\/5. Went swim. Saw one poor fellow get his arm blown off in water, he walked out holding it in his other hand & then collapsed. Amputated soon after.\n","116":" – Shrapnel played havoc on beach to-day, killed 5 & wounding 14. Glasgow Artillery arrive. Took mail down to beach from Hd. Qrtrs. had swim. Getting very hot. Came back from trenches a new & shorter way.\n\n1915\n","117":" – Up in trenches tonight, plenty of bombs. Did not go for swim too risky.\n","118":" – Sir Ian Hamilton & General Birdwood passed through lines. The Turks must know as they put some shrapnel over.\n","119":" – Supports 2nd Btn., many bombs flying. Church parade. Col. Green farewell sermon. General Birdwood address us & promised us spell over at Imbros Is. Bombardment early to-day. \n63rd day\n in firing line.\n\nMon. 28 – Forts on Gaba Tepe firing at our guns, put two six inch shells into our camp, one struck 5 feet in rear of my dug out. I got buried up to the neck, three pieces of earth being 2 feet long & 1½ ft. thick. Two pieces of the shell lobbed in the dugout. I choked spluttered & yelled. All my cobbers thought I was dead. When the cloud of dust & vile fumes passed over I tried to wriggle out but hopeless. A shovel & entrenching tool was requisitioned & I was dug out. Thank God all I had was a bruise on left knee, left elbow skinned & wrenched my left knee. I suffered a good deal from shock. Dr. Thompson & S.B.’s carried me down & bandaged my knee up. Having been fixed up I was carried under cover of the hill & no sooner had I moved than another great black monster burst 2 yds. from the spot I had just left, this one landed at the back of the Sgt.-Mjrs. dugout knocking him out temporarily. There were several of us about at the time but nobody got hurt.\n\n1915\n","120":" (Contd.) – I put in a very restless night, knee aching a good deal. Next morning our Doctor sent me to hospital boat (Sicilia) with Synovitis of R knee. 9th & 11th Btns. make a charge on R Flank. New landing.\n","121":" – Sent to Casualty Station on beach to wait for fleet steamer – taken on board Hospital Ship \"Sicilia\". Cooks presented me with axehandle before leaving. While waiting for steamer General Birdwood asked me what had happened, he also asked two others. Fine fellow.\n","122":" – On S.S. \"Sicilia\" waiting for fleet sweeper. Sailing postponed. Slept on deck, rained torrents. Heavy firing on ridges. Turks blew up our sap, killed one & asphyxiated one of our men. Rumoured that we may break through saps & make new firing line.\n","123":" – Trans-shipped to small boat, went out into streamed & again transferred to \"Prince Abbas\". Sailed 3 p.m. for Lemnos 4 hrs. run. Taken to 1st Field Hospital Mudros. 4th Brigade here spelling.\n","124":" – Quiet day – went into town of Mudros to buy chocolate &c. Wandered round all day. Watched Greek women at work in the fields thrashing wheat. Had a chat to Chaplain Capt. McKenzie. Hills round Lemnos Bay one mass of canvas villages. Big alterations & improvements. Vic. Perkins arrived with Influenza.\n","125":" – Went to Doctor who ordered me to Base Hospital, Alexandria. Turkish prisoners working on island. Dr. Vurko my doctor. Issue of 4 pkts. Brittanias.\n","126":" – Left 1st Aus. Hospital 1 o’clock, lying in lighter 3 hrs. before going out in stream to Alwyn Castle Hospital ship. Ticks to sleep on. Sailed at 6 o’clock.\n","127":" – Tucker fair, Dave Mackay my mate. Lovely weather. Land in sight all the time. Dry bread & tea for tea. Slept most of day.\n\n1915\n","128":" - \n260\n Days since leaving Sydney. Slight swell rolling a little. Concert on board.\n","129":" – Arr. Alexandria 6 a.m. Taken on board Hospital Train. Ladies provided cool drinks, cigarettes & walking sticks. Left Alex. 12 o’clock. English Sisters & Indian Orderlies on train. Very comfortable berths – fast train – menu included chocolate, biscuits & limejuice – Lovely run – natives harvesting similar to the Greeks – Went to Heliopolis main hospital from station by Motor Ambulance, then on to No. 2 Auxillary Hospital near Luna Park – about 400 here. One big Ward brick & steel construction. Beds of cane made by natives.\n","130":" – Generals Maxwell & Spence visited us, also Lady Maxwell who gave us cigarettes. General Spence’s wife & 2 daughters do voluntary massageing daily, plenty of visitors.\n","131":" – Wrote O.C. \"D\" & Jim Row re my mail, also No. 1 Ruby B., gave lady visitor to post. The Battle-ship \"Triumph\" which I witnessed sinking sunk off Ari Burnu, in the Gulf of Saros. A submarine got her amidships – She listed until the upper deck touched the water & capsized 9 minutes later. She floated keel upwards 20 min. Her gunners fired to the last.\n\n1915\n","132":" – Sent Cable – Mrs. Ward – 313 George Street, Bathurst, N.S.W., \"Returned Cairo injured knee, well. Love.\n","133":" – Church service, rotten head all day.\n","134":" – Band played night. Head still bad 4th day. New dressing on knee.\n","135":" – Feeling better today, head better. Clem Sharpe came in – going England. Canteen Day allowed 2\/1.\n","136":" – Picked out for Alex.\n","137":" – Went to Detail Camp \nHelouan\n Zeitoun instead of Alex., living in Mess Huts.\n\nFrid. 16 – Moved over to Tents, A Details. Put in for pay. 270th day from Sydney. £10.15.8 due to me out of my allowance of 2\/- day. Rcd. 10\/3 pay. Rcd. £2 on 21st. Now £8\/15\/8 due out of 2\/- day to date.\n","138":" – Card Trick – pick up face downwards 5, 9, 10, J Q, 2, 4, 6, K Ace, 2, 7, 8, 3 & spell numbers. Posted No. 3 letter to Mother & P.C’s to Mrs. Steer – Spinning, Strange – Misses Wass, Mitchell – McLean, Allen & Arthur Pashley (8). Went to Cairo, met Ted Maver, Waller, Dentist. Went to French House stayed till 1 a.m. Train 1.30, got out wrong station & walked along line getting into camp 2.30 a.m.\n","139":" – Lying down all day.\n","140":" – Went to Cairo. Met Sgt. Mitchell, Taff James, Yates, Cpl. Phillips, Bailey.\n","141":" – Usual lying about.\n","142":"\n","143":" – Paid £2.\n\nThurs. 22 – Went Cairo.\n","144":" (date of sailing) to present date","145":"\n\n282 days @ 3\/- - £42-6-0\n\n282 days @ 2\/- - £28-4-0\n\nLess Amt. Rcd. - £19-5-8 - £8-18-4\n\n+ 282 days deferred - £51-4-4\n\npay at 1\/- day - £14-2-0\n\nTotal due to me to date - £65-6-4.\n\nLess what you have received.\n\n1915\n\nJuly\n\nFrid. 23 – 277 days from Sydney. Went to Cairo Cpl. Bullock.\n","146":"\n","147":" – Wrote No. 4 Mother short letter gave address \"A\" Details, Zeitoun.\n","148":" – Doctor’s Inspection weeding out. I am for Helouan Convalescent Hospital 20 m. from Cairo.\n","149":" – Left Zeitoun 8.30 Motor Car to Bab-el-Louk Station, Train 10.15 to Helouan a beautiful model suburb. Sent note by Boxsell to Aunt Jess & cards to Doug & Stan.\n","150":" – (282 days since leaving Sydney)\n\nMy Dear Mother\n\nKnowing you would like to have this diary written by me at the front I am sending it\n\nby a wounded cobber who is returning home to-day (Private E. Boxsell). He takes a letter to Aunt Jess for me & also the diary which I would like her to read & then send on to you. It is a poor diary, neglected, it was not possible to write everything that took place the first few days as we were under continuous fire all the time. It is impossible to put into this book all my experiences so I am keeping them till we meet again. The most important parts are marked by arrows &c. At time of sending you this book I am in best of health & enjoying life which seems sweeter than ever. I am very happy to think I have come through such an ordeal safely. With fondest Love to you & all at home. Your Loving Son, Eric.\n\n"}}