{"Document Name":{"0":"Diary_0230","1":"Diary_0230","2":"Diary_0230","3":"Diary_0230","4":"Diary_0230","5":"Diary_0230","6":"Diary_0230","7":"Diary_0230","8":"Diary_0230","9":"Diary_0230","10":"Diary_0230","11":"Diary_0230","12":"Diary_0230","13":"Diary_0230","14":"Diary_0230","15":"Diary_0230"},"Date":{"0":"unknown","1":1637.0,"2":1638.0,"3":1639.0,"4":1640.0,"5":1641.0,"6":1642.0,"7":1645.0,"8":1646.0,"9":1649.0,"10":1650.0,"11":1657.0,"12":1658.0,"13":1659.0,"14":1671.0,"15":1672.0},"Entry":{"0":"\n\n","1":" (cont)\nIn regard to our telepathic experiments we have developed our powers past all expecting for such a short time. To take one instance of complete success (& it is not alone) \nwe\n I drew a Church steeple & in a short time Vic gave me a church steeple as the impression received.\nDetailed notes on our experiments, & on our work with Laing (which\n\nis not of the best so far) will be found elsewhere, & I do not propose to refer more than briefly to that branch in future.\nOn Sunday morning we had the usual church parade except that the C.O. & officers were present. The military \"stand at ease\", & \"attention\" annoyed me. Bad enough to have compulsion without adding the awful military discipline to church matters.\nCommunion afterwards\n\nas usual.\nAfternoon a little experiment in my protism, & evening, Church & writing.\nWeather very fine all day.\nMonday 27 May\nInstead of physical jerks in early morning before breakfast, we had the miserable company drill.\nResumed early rising after couple of days spell during bad weather. That means getting up at about 5.30.which\n\nis ¾ hour before reveille.\nDuring the day we have had squad-drill ad nauseam. This afternoon it developed into the humorous case of lance corporals trying their hand.\nLes. Burnett, the rather girlish spoilt child of Cupnies who was my burlesque girl at Cormone, was the most amusing. He has more sang froid that knowledge of skill. At one time when our squad was marching full tilt at another\n\nbidding fair to come into violent collision, he, in desperation sang out: \"about-wheel!\"\nThe cropped state of my hair at present calls forth many facetious remarks, & more pointed allusion to my teutonic ancestry.\nCold & clear tonight so the \nslight\n temporary immunity from aeroplanes is likely to be cut short.\nWe have sent over\n\nmany planes since the weather broke, but only one or two observation scouts of Fritz have happened so far.\nTuesday 25 May.\nClear & warm turning to clear & cool in the evening.\nWe were to have had a meeting of the literary circle at midday, to decide a question of ordering books & to fill vacancies in the committee, but the polishing & cleaning attendant in preparation for C.O.'s\n\nparade, prevented it.\nNever have the 3rd been so spick & span as lately. The best-dressed man idea for guard has developed in latent passion for polishing all available metal, & boots. Australians seem to dislike cleaning up equipment at all, or else doing it down to the last fantastic detail such as the metal clip in the gas mask sling.\nAn interesting sidelight in the guard business has been the fact that many\n\nwho have got off as best dressed have been arrayed in borrowed plumes, turning up again in parade following mornings with the old rusty looking web belts in place of borrowed washed & shining ones.\nToday, however, it has been a case of every one for themselves, & thus for about two hours men were to be seen polishing boots, washing & polishing belts, mending ugly hole tears in tunics, and attaching long secluded identity discs around their\n\nnecks with white lengths of bandages, giving themselves the appearance of decorated oddfellows - - - - - - -\nI was not the least among these.\nC.O. inspected us & then Major Willis, under the eye of the Colonel, took us for Company drill.\nCapt. Watch (familiarly known as Iodine Joe), who is a bent bespectacled frowning kind of chap with \nnot\n no ready grasp of ordinary affairs, committed\n\nmany blunders, & had to be issued with prompted words of command from Willis on at least two occasions, to the great delight of the rank & file who were prepared for such happenings.\n Such commands as \"Rear rank one step - \nback\n !\" & \"Section! At the halt - \nright\n ! (the latter an attempt to move them forward in line, one not, I believe, to be found in the drill manual\n\nThe planes were over last night, but not in any great number, & not intent on damaging our locality, apparently. There seemed to be a bombardment of some kind on as well.\nWainwright, who put in for a transfer to No 3 A.G.H. has been marked unfit today. He has frankly been anxious to get away for some time, although he only arrived in France last Sept. In my guard, apart from his crotchety\n\nbickering, tendencies, he was inclined to be & became so which now seem to have been justified. Ever since my last little talk with him, however, he has been quite & different to me, despite his sickening tendencies.\nRather a problem to me, for I am not even now sure of the cause of his crotchety disposition.\n","2":"\nStarted learning the Sloan Duployan system of shorthand on Monday & am progressing well.\n\nYesterday I was on stretcher squad duty, & there being little doing, I studied shorthand, wrote, read, (Wells' \"Mr Baitling sees it through\"), in company with Vic who is exempt from parades engaged on printing an illuminated address for Sgt Canvin who recently exchanged with another Sgt of the 3rd A.G.H. at\n\nAbberville. That Sergeant is now in charge of B section in place of Sgt Canvin.\nVic Hall, Bert Emmott & I have been leading a pleasant life. Hall is exempt from parades, & so is Bert every third week, being on nursing duties with A section, while I attend all parades. – Yet spare time is not meagre.\nOn fine mornings we rise an hour before reveille & get kits and cleaning up done by the time we go on physical drill parade\n\nThus, between breakfast & 9 o'clock parade there is time for reading & writing. Bert is engaged pretty well up till 7 p.m. but Vic & I find \nsp\n plenty of time during the day for own pursuits.\nEvery second day we have \nph\n psychic experiments, & the rest of our time is spent in reading books on hand which are full of interesting aspects of the problems we discuss.\nDiscussion during the day is often desultory so we\n\nleave the last half hour \nin\n before going to sleep for the three of us to discuss some problem that has arisen during the day. Generally it deals with Spiritual matters, & there we have established a wonderful harmony --- soothing, comforting &amp encouraging.\nBert, the youngest, is questioning, but relies on us for general information as a rule, \nbut\n still he is to my mind the best type of Christian of the three of us. He is gentle yet firm with a splendid loyalty to his beliefs.\n\nMy discussions with people out side are restricted to those I have with Freddy Grey (the big Grey's younger brother), & with Darcy Dickson. The latter often has a long chat with me, & I find him very tolerant, but firm in his beliefs.\nOn the contrary, there is Sam Rickson, who has a reputation for narrow mindedness & intolerance, while undoubtedly being a sincere Christian of rigid life. He is shorter & slightly sturdier than the\n\nsolid Dickson, & very strong. His face is reddish with broad effects, & shows more signs of obstinacy & strength than of intelligence. Dickson described his mental attitude well yesterday when he said, \"He's got a little box of opinions & when he starts to argue the point he brings it out, opens it, & dishes them out one by one & then ---\" I finished the comparison for him. \"He shuts the box up, puts it back & goes home, leaving you gasping,\" said I.\n\nThe first clash I have had with Sam Rickson came yesterday afternoon, & I spoke bluntly, to the point, & a trifle sharply. Either from the mistaken notion that I was trying to snub him, or from disgust, he left before the chat I was having with Harry Melrose (in which he had joined) was finished -----\n","3":"\nAir raid last night with plenty of \ndogin\n dodging about overhead, but no local bombs.\nYesterday afternoon I commenced helping Vic paint physical jerks diagrams show correct & incorrect methods. A couple of days respite from chills etc.\nGlorious weather, & feelings of good health & confidence in the future. Fritz is at it again, & now it is south of the Somme\n\nwhere he has driven us & back about \n14\n 8 miles (I should imagine) on to Soissons & Rheims, the \nlatter\n former town being lost.\nThe day before offensive opened a significant paragraph appeared in the paper, arising subconscious wonderings in my mind whether he was to attack there. The substance of it was that the British had sent troops to defend the Rheims\n\nsector, prisoners from which Fritz had taken in a \nraid\n.\nSlight unpleasantness with Vic over gribblings. Soon smoothed out.\nBert is now on night duty so it remains for Vic & I to talk the last half hour away. Last night our chat on the sinister influence of the Romanists in this war, & a possible national church, (or if not a council of the heads of churches),\n\nwas interrupted by vigorous \nmag\n machine gun fire, & anti aircraft gun fire, the latter from very close at hand.\nSports tomorrow, of which I am entered for four events, the special one being 130 handicap in which I have 15 yds start. A good start this but professionals like Les Bryant can gain half that over the starting off. Darcy Dickson is on 7 – a good chance.\n\nThese sports are the deferred ones from Sec Bois, when Darcy refused to run in section race to provide beer for the mob. There was great argument & bitterness against him over that (by Mick Stafford among others). Yet he maintained his ground, & now he is even respected more if anything. These selfish bitternesses of the mob do not last. They die with the satisfaction or the hopelessness of gaining what they are crying over\n\nmen in a mob rarely shout loudly together except when their own desires are acutely at issue.\n\nSunday 2 ","4":"\n June\nGlorious day for sports yesterday. Bryant of C section, a young chap strong as a lion & with the materials of being good looking if he was straight & lived clean, as usual took most of the plums. The handicappers try to restrict his activities every time & always he\n\nwins his races in spite of them. The reason for this is that he seems to be that he is a deceptive athlete: he beats a man with (apparently) an effort sometimes, & really he could have done considerably better. In other words it seems as if his performances are governed by the he has to contend with.\nI had 15 yds start in the 130 yds handicap, & he was on 2 yds, but by ingeniously getting a \"flying start\"\n\n(which apparently means starting before the word for has left the lips of the starter, & which is much in evidence where a pistol is not used), he was up to me almost before I started. Therefore it is not surprising he won our heat, although he probably would have done in any case. I ran far better than I usually have done; that is without the awkwardness & stumbling & even falling as of yore. - - - -\nI was last but well\n\nin with the bunch --- about a couple of yards behind the lead & finished in far better condition than most of the others which seems to prove that I could do better with more effort & technique.\nVic Hall was only in the obstacle race, so he was a spectator for the early part: I was dragged away from shorthand to run the heat of the 130 yds.\nNext the potato race. In my heat I was easily first in picking up the spuds\n\n& finished well ahead of the rest, but by bad fortune I had not noticed a sixth potato & was disqualified. Some thought I was certain to win in any case, but one cant tell, although I vigorously said as much. - - - -\nThe other races were characterised by special performances by the football enthusiasts such as Pridmore (a surly butcher like youngster of boyish face, not energetic enough to use his powers & perhaps beat Bryant). Fuller,\n\nDickson & Graves; also by such strong men as Sam Rickson (a specialist in throwing the cricket ball), Robertson (a canny scot who can kick the football well).\nThe high jump was characterised by a duel between Darcy Dickson & Les Bryant. Here again the case of performance being regulated by the opponents was evident. Twice Dickson missed a jump, \ntwice\n & once just got it on the third & last attempt.\n\nSimilarly Les Bryant missed on jump twice & just saved himself by getting it on the last try, yet went & clear the two succeeding heights with room to spare! He won with a 4 – 11\" jump when Darcy failed three times.\nThe obstacle race had been claiming a great deal of conjecture from Vic Hall & I, & in the dinner hour we went over to the most formidable obstacle (the pond), to dive & get used\n\nto it, & also find the best place for jumping off. As it turned out it was unnecessary.\nThe course ran about the \noutside\n road outside the hedge (behind the marquees). (in bare feet) through the pond & then we had to find our boots from a miscellaneous collection, put them on & lace them up, go through a hole in the hedge (large enough to admit only one), & thence round our own pond,\n\nunder tarpaulin, into timbers & out again, under a low bridge of stretchers, in & out of a waggon with tarpaulin over it, up to basins of water with potatoes which had to be grasped in the mouth, & thence on hands & knees to the winning post.\nThose in the know were able to arrange boot laces beforehand.\nDickson was first across the pond, & I, having\n\nbeen squeezed out in the run up, was about last, & none too quick with the laces. Vic Hall had had to hurriedly thrust laces into his pants at the beginning, for he did not know of the lace up stunt, so his was along job.\nAfter the pond I went through the rest with no clear idea of any one behind, but of one immediately in front. Was blown at the last waggon, but kept on to the potato which I reached in time to find\n\nthe race won, & thus the hands & knees finish was superfluous. Vic Hall, it seems left the pond long after the others & made a vague short sighted (similar to myself of course in aspect) & intensely humorous rear guard. I could not have been much \nfart\n ahead of him, & if mud & blood stains \ncont\n count, certainly looked more rugged. . . . .\nThe O'Grady drill competition was keen. I was soon out, but Vic\n\nHall was \namong\n one of the last two, & was unfortunate enough to be dropped just when he was within sight of winning. This drill is in direct contrast to the ordinary, in that mechanical work is no good, & concentrated thought is everything.\nThe rule is that any order given by a certain Mr O'Grady must be obeyed implicitly, but without his sanction, a move means being put out of the squad. By this means\n\nthe squad is finally reduced to one man who wins.\n","5":" (Tom Pollack the scotch jerks instructor):-\n\"Squad shun! (no move) O'Grady says – squad shun! (all move) right turn! (one or two unhappy beings instinctively turn) Ha! Ha! there, out you go!\"\n\"O'Grady says, right turn! quick march! \n(or\n \"Ha ha out you go there. Quick march. O'Grady says quick march! O'Grady says halt! O'Grady says left turn\n\nstand at ease! – (roars from spectators at the result of his duplicity & the culprits dissolve).\nB. Section won the tug of war, A Section the team race, & Behan's squad won the stretcher spread race, which was one mad push of bearers & stretchers & with uncomfortable patients on top. One of B. Section's squads – Hopes with Hynes as a patient – collapsed three quarters of the way from home & disarranged\n\nthe patient somewhat.\nLittle \"Gunner\" from the cook house (diminutive, & of a type which by reason of its defective stature seems to expect & try to get all it sets its heart on. Spoiled & appetite not always or ever for that matter – spiritual) was conspicuous afterwards by his voice, distorted by beer, raised in complaining of the fact that his squad had not put much effort into it, & he could have been sure of his share\n\nof the prize (5 francs) if he had gone with another squad. \"They arst me ter go, & then a lot of - - here upon goes then lets a men darn! Wot abat makin ","6":"\n up the five frames?\" Half crying. Next minute half laughing. Like a child but with a past a bit worse than a child's.\nThe Count was pondering over near the gate where he went in friend at 6 p.m. Had\n\nto clean up & so missed part of the sports, although he saw from a distance.\nHad a chat with him in interval – he seemed quite out of it dressed up & away by the gate, while everybody (including the two \"females\" from the artillery) were following each evident with enthusiasm, dressed in all manner of costumes – mostly the necessary athletic one.\n\nShorthand after the sports.\nSick parade with broken glasses this morning, & then Church parade & Communion.\nVic Hall is at the present moment cleaning up for guard tonight.\nStunt on tonight, & a few squads might be wanted .\n\n Terrific argument\nStunt\nVery long argument with Vic Hall over the merits of dissecting critically the small words, & meanings, which as I had intended, had no direct bearing \nof\n on the issue. As the case in point was a personal one the argument became rather unfriendly & slightly personal, yet the end was quite satisfactory.\nSuch arguments are sure to happen & are best thrashed out.\n","7":"\nLast night there was a stunt on up our portion of the line, & successfully it was accomplished too. The squads referred to were not even warned, but we knew there was to be a stunt, nevertheless, & were prepared for a call up, which, however, never came.\nThe bombardment was supposed to begin about one or two, but I never heard a sound, although I dreamed of being wounded in a barrage\n\nThere was a bombardment however, & a pretty heavy one too I heard from Caesar Hood of the transport (motor) who, by the bye, was once the hero in the Cormont burlesque.\nThe first thing I knew of the results of the raid, was when I rose at about 5 Am when there were many cars coming & going, bringing cases from the line, & taking cases on to C.C.S. The lorries batch, attached to us, did good work in the latter sphere with walkers\n\n(But Emmott came & told me that the raid had been a complete failure, & that Merris Ridge or Mount Merris had been captured)\nI strolled over to the point of the dressing hut, & saw the light motors unloading \nthe\n our later wounded cases, & the Fritzes who had had to wait their turn behind our chaps, they not, of course being serious cases. There were some Fritz stretcher cases, but not many. As a matter of fact, odd wounded, --\n\nFritz, & Australian were coming along up till dinner time. We took 288 prisoners (I see by the paper Tuesday), & the raid was generally successful.\nThe Fritzes were poor types, mostly undersized & all looking war weary.\nSeated with Vic Hall engaged on sign writing I got fragmentary glimpses later on of short & fat Fritzes, short & thin, some long & thin, but none long & fat. There were anxious\n\nteutonic faces, white & pain stricken ones, comparatively happy ones, & cunning ones.\nGermans on a form one side, & Australians – comparatively big, sun burned happy & a little civilian with their slouch hats, compared to the dismal military training of the worn out \"new\" uniforms of the Fritzs, - these Australians are the other.\nCivilian ladies who were attending with minor hurts to be attended to,\n\ngazed curiously at the foe, & even showed off a bit - - -\nOne Fritz boy I caught a glimpse of as he lay on a stretcher being carried through the door, was softly but fretfully crying.\n","8":"\nThe German offensive has developed from the first attack on the Rheims sector, to a vast attack from to beyond Rheims. He has had conspicuous success in point of view of territory captured, but\n\nhas accomplished no disorganisation yet. Today the news of his arrival in the Marne \nfor\n at the front of the salient formed, has arrived, but he has been slowed up both in front & on the flanks, where real opposition has been put up.\nSignwriting during the day, & meeting of the Literary Society at 7 p.m. Reading \npapers\n by Viv. Maynard, to Dickinson, , & in place of Woodyard, V. Hall, The first\n","9":"\nQuestion of whether the Literary Circle may be mistaken as an essay at exclusiveness, dealt with by notices & special invitations for members.\nVic was sick last night with a kind of influenza which is known here as dogs disease, & is epidemic. This morning being slightly worse he was moved over to isolation by going on sick parade.\n\nThis evening his temperature is still near 101, but he is more lively.\nI wrote an article for the \"Daily Mail\" last night, had it typed this morning, & at present the Colonel has it for cencoring purposes. The title is \"Civilian rearguards\", & it deals with the type of civilian tragedy we witnessed at Silvester Cappels.\nFritz is held up\n\nabout 39 miles from Paris, & at present there is a drill.\nWhat threatened to swamp the intense interest excited by the offensive, in winter interest was the Billing trial. Most seemed to think that Billing had taken the opportunity offered by the courts of airing a grave scandal, but it is doubtful if any of us regarded his action in its true light.\n\nI still think there must be a great deal of truth behind his accusation, but I am not inclined to agree with his method of bringing the point into the court, nor of insulting the judge, barrister & witnesses.\nSurely something definite will yet come of it.\nWent to C.C.S. at Eblingham on duty as car orderly this afternoon.\nDrowsy sleepy afternoon\n\n& I hardly succeeded in seeing all the defence works for the dust which rose in white clouds from the road.\nTemporary cheer in the shape of a nurse whom we gave a lift to the C.C.S.\nInter section cricket is now the popular form of recreation. Caught a glimpse of Snowy Ever taking wickets in great style for A second\n\nteam this afternoon.\nStill Slogging away at shorthand, & still find time during the day for thoughts on God which were recently awakened.\n","10":"\nLull in the battle down \non\n below & slight indications of a kind of renewal of artillery, up here. Anyhow I hope he gets held up every time, & we don't lose so much ground in the initial stages.\n\nVic still under treatment in isolation tent, & no better.\nFinished Tom Pollocks physical jerks diagrams, & tomorrow have to prepare a board for their reception.\nWrote article for \"Daily Mail\" \"Civilian Rearguards\", & owing to difficulty over censor regulations, the Colonel has sent it down to the Base censor.\n\nVic well again.\n","11":"\nArticle came back from Base Censor with instructions to be sent to Press Bureau Whitehall. Beten very kindly fixed up the duplicate copy & sent if off for me.\nStudy circles were introduced on the H.G.Wells evening last Tuesday, & a general meeting for discussion held on Thursday. Very enthusiastic reception of the idea, & general scheme laid down. Since then embryo classes have been formed in\n\nsuch subjects as English, Greek, Shorthand & History. I am to take English, Arithmetic & theory of Mental Telepathy. As soon as books arrive we shall start.\nWent to Corps C.C.S. at Longnesques for eye prescription & repairs. Marked as unfit for service in line.\nFollowing morning paraded by Garland to Col Locke who told me the report would get me back to Base, but said I could have 24 hours to decide whether to join\n\ntent division \nof\n or go back.\nI did not want 24 hours but it showed his fine character in that he insisted. Result is on orders tonight: Oh S. Holt to B Section tent subdivision. Start duties at 8 am tomorrow looking after the dog disease patients.\nThis afternoon news arrived in a desultory way that Fritz was expected to attack tonight. Seemed to be rather rumourish at first, but developed quickly about tea time.\n\nIn quick succession came more definite news (Corps front 10 divisions), visit from Col Brennan of !st who are running A.D.S. at Bone, then visit from A.D.M.S. & other staff heads. Later all bearers warned, then paraded & inspected & told to stand to. Waggons parked & have to deal with large quantity of wounded.\nIt might be a stunt of ours, but it looks more like a projected attack\n\nof Fritzes.\nSupposed to open out at 2 a.m.\nAt present our are busy filling water bottles, making facetious remarks now for a fact & directing better in both their purpose.\nSleeping in clothes tonight of course & bearers not left yet.\n","12":"\nNothing happened.\nWhat was actually the mater I have since learned. It seems Fritz was concentrating guns all day, & masses of men had been on the move towards this front, so they were thought to be massing for a front attempt to break through.\nDuring the night regiment after regiment passed through on the way up to the line, singing songs - - -\nOne of our observation balloons was up all night, & as far as we were concerned, very thorough precautions were taken in conjunction with the","13":" Field at A.D.S. & the C.C.S. at .\nEvery body was if it would come off in the night, - but what time. When the morning broke without anything unusual having happened, new rumours of its having been postponed until a couple of nights today\n\narrived. Since then the rumours have finally died down, but the evidences of preparation have been in constant evidence.\nGreat squadrons of planes go over to Fritzes lines every day – 24 at least in each, on show everything seems to be well prepared. Consequently we are less highly strung now, but with a full knowledge of the imminence of attack (possible), feel we can go into the nightmare of work fully trusting the authorities to leave no \nfear they\n work that foresight can see the need of, undone.\nThe dogs disease, or epidemic form of some kind of influenza, is claiming plenty of sick in this unit, but they soon get better, & there appears to be no danger from it.\nStarted duty with B section tent subdivision last Sunday morning, & found I had to work over in \"dogs disease\" isolation (two marquees), with Leo Burnett\n\nwho is the Lance Corps.Tom Smith, George Goode, & Lex Riches. Les Binnett was, of course, the rather difficult to deal with hysterical burlesque servant girl of the torment days. Still I have been on very good terms with him ever since, & was pleased to find that he as well as the others, expressed \nsurprise that\n pleasure at my arrival in the tent subdivision.\nAs a result of a week of work with them I am quite satisfied that with things as they are, we shall always get on well.\nThe work consisted of feeding & washing up after the patients & cleaning up.\n Today C Section took that part of the work from us & we took over the duties of the dressing hut & dispensary. I am attached to the dispensary, & incidentally in charge of a marquee next to it (in which I am writing),\n\nwhere trench fever patients (if any come along) are to bath & have their clothes ironed.\nLes Burnett & I have the dispensary & this on our own, & I help by dispensing in the morning.\nLast Tuesday, we had a variation with the Literary Circle. We held an historical evening, & papers were read on \"Fred Great\", \"Franco Prussian War\", \"Clive\", History of Edinburgh\". Noticed one or two new faces there – chaps who had not taken any interest in our doings previously. Good discussions on papers, & also a decision in regard to the study carried (the starting of which had been discussed at a meeting a few days before).\n\nResult of study circle discussion was that we commenced a series of classes a couple of days ago after wards: English, & Arithmetic (which I am taking); Shorthand & French. Regular attendance & good earnest spirit on the part of the dozen or so in each class.\nPlane flights in two sessions lately, near balloon.\nThe last one was rather amusing. Several squadrons of our bombing planes had been going over, when, during a time of overhead quiet, a Hun plane suddenly swooped down from above & attacked our balloon quite near. The observer jumped out immediately, \nbut\n & the Hun continued to machine gun the balloon without success.\nInto this, without any\n\nwarning, half a dozen of our scouts came flying at full speed, & off went the Hun, straight over Hazelcourt. He had been caught napping however, for within three minutes he had been forced low & very soon as a fitting sequel he crashed in flames.\n","14":"\nOwing to the loss of this Diary for some hours, I started a fresh one, so the best way to fill up the blank pages in this one is to write a few notes.\nThis week has been a very busy one indeed, with the\n\npreparation of a concert for next Thursday, and the Tuesday's debate on Reprisals, in addition to the classes.\nOnly now & again have I felt the effort of the work to the extent of getting irritable. I have lost a lot of sleep through getting to bed late & rising abnormally early, especially since I came on night duty.","15":" first. with the great amount of organising to be done by reason of the three activities unwinding in one\n\nweek, I feel every day as if I simply could not get through the work in the time, but now all is clear. By stopping in now & again I have got things up to a good pitch & they are going swimmingly, especially in connection with the concert party.\nThe classes are developing and sustaining their original intentions & plans.\n\n"}}