{"Document Name":{"0":"Diary_0470","1":"Diary_0470","2":"Diary_0470","3":"Diary_0470","4":"Diary_0470","5":"Diary_0470","6":"Diary_0470","7":"Diary_0470","8":"Diary_0470","9":"Diary_0470","10":"Diary_0470","11":"Diary_0470","12":"Diary_0470","13":"Diary_0470","14":"Diary_0470","15":"Diary_0470","16":"Diary_0470","17":"Diary_0470","18":"Diary_0470","19":"Diary_0470","20":"Diary_0470","21":"Diary_0470","22":"Diary_0470","23":"Diary_0470","24":"Diary_0470","25":"Diary_0470","26":"Diary_0470","27":"Diary_0470","28":"Diary_0470","29":"Diary_0470"},"Date":{"0":"unknown","1":1485.0,"2":1486.0,"3":1487.0,"4":1488.0,"5":1489.0,"6":1490.0,"7":1491.0,"8":1492.0,"9":1493.0,"10":1494.0,"11":1495.0,"12":1496.0,"13":1497.0,"14":1498.0,"15":1499.0,"16":1500.0,"17":1501.0,"18":1502.0,"19":1503.0,"20":1504.0,"21":1505.0,"22":1506.0,"23":1507.0,"24":1508.0,"25":1509.0,"26":1510.0,"27":1511.0,"28":1512.0,"29":1513.0},"Entry":{"0":"\n\n","1":"\n\n1244 day of war\n\nDiary continued from Book VII\n\nThere was a heavy fall of snow last night. This morning was bitterly cold. It was much finer in the afternoon Today and tonight this front is very quiet. I am on first picquet tonight from 6 to 9. It is not very cold considering there is so much snow about. Today it was read out in orders that there is to go 32 men and NCOs and 3 officers on leave to England every week. All the original men in the Battalion are to go first\n","2":"\n\n1245 Very cold all day. There was the usual half holiday today. But it was so cold I did not go away from the camp. We have a good hut to sleep in, a hut – but it is rather far away from the stables. The Sgt. Corporals and a few privates sleep in it. I am one of them. This hut has a corporal of the A.M.C. in another division in it with a stock of medicines and it is used as a dispensary. The others sleep in a barn which is very cold and draughty –\n","3":" 1246\n\nNew Years Eve\n\nReveille 6.a.m. We got word late last night that the Battalion was shifting to Neuve Eglise & the transport\n\nwas to move off at 8.a.m. So every was out in time & at once got busy we got away up to time Some of the drivers had to make 3 trips in order to remove the Q.M. stores blankets & officers kit – etc. The roads were very slippery and none of the horses had frost nails or cogs in their shoes, so we had to walk most of the way as the direct road was congested with traffic we had to go through Romarin which made it a few miles further about 5 miles in all When I went to bed tonight some of the transports had not arrived at the camp, which is our old one viz South Hill Side Camp\n\n End of Year 1917\n\n","4":" 1247\n\n19 New Years Day 18\n\nWe had a half holiday this afternoon C. Charlise & I went out to an estaminet and had a bottle of Bol and some champagne which was shouted for us by some soldiers from the first Brigade there is a concert tonight not very far from here but I did not go as it was too cold.\n","5":" 1248\n\nCold & frosty this morning. There was a kit inspection today to ascertain if any one had things missing. Major Storey – the second in command, now that Major Robinson has gone to England, was around the Transports units this morning. He is not long out of hospital having been wounded at Ypres\n","6":" 1249\n\nA beautiful day but rather cold. Last night there was some intense artillery activity and again for a little while this morning.\n\nThere is great hostile aerial activity today. The news in the papers is good. Both the French & English have had victories in Italy as well as the Italians. The enemy is driven beyond the Piave. The Turks have sustained another big disaster North of Jerusalem in Palastine. It is very cold here with heavy rains & storms.\n\nThe Allies are to make an official reply to the German Peace note\n\ndelivered to the Russians. America is to join in. The outlook for Peace at an early date is favourable but it was so this time last year. It may not materialise and is the enemy’s policy to put America to all the expense necessary for a big offensive in the Spring and then when she is about to strike to dramatically come to terms.\n\n","7":" 1250\n\nVery cold & frosty. The clouds are very low and there is a misty haze which obstructs observation.\n\nL\/C J. Lawless & Frank Hambrook are to go on Blighty leave tomorrow. I asked Mr Boyland to see the Adjutant if I can get Blighty leave next week to see my brother.\n\nDuring the past week there has been 18 large ships sunk. Otherwise the war situation is very bright for the allies.\n\nThis morning I received a letter from Willie. He is yet at the Norfolk War Hospital Thorpe Norwich, in Ward B1 Anzac.\n","8":" 1251.\n\nCold & cloudy. The sky has been thickly overcast with low cloud all day. Visibility is very much restricted.\n\nThere was some intense artillery activity last night which lasted for several hours. Mr Boyland went on leave today. N. McNicol is in Paris on leave. I am picquet tonight. I was lucky enough to draw first picquet from 6 to 9.7.\n\n","9":" 1252\n\nThe first Sunday in the New Year. The King has issued a proclamation that this Sunday be observed as a day of Prayer by all classes & creeds. The London papers give special prominence to it & print various articles &notes by leading ministers.\n\nLet us hope that the days of trial will be shortened and that peace will be hastened for a troubled world.\n\nThere is the usual half holiday today. The weather is bitterly cold all day. Last night there was an exceptionally heavy frost and it is freezing all day. Water thrown out soon becomes ice.\n\n","10":" 1253.\n\nThere was rain last night and the roads\n\nare very muddy today.\n\nI was called up to the Orderly Room today to sign a paper in connection with leave. I am to go to Blighty on or before the 13th of this month.\n\nWith Bill Wilson I went to the 21 Battalion camp to see his brother George but he was in the lines. He had some rum which was issued to his mates in his hut. There is a rumour afloat that we are to go to Egypt before the winter is over This rumour has been afloat a long time & is very persistent. It looks as if the authorities expect the war to end this winter & we would be that much nearer home & in the event of the war continuing we could be easily sent to Italy or Mesopotamia.\n\nSome American officers of high rank have been inspecting this front of late and probably we will be removed to some other sector.\n\n","11":" 1254\n\nVery cold. About 8.am. it started to snow and at 9.am about 2 inches had fallen. Snow fell at intervals during the day.\n\nColonel Knox Knight inspected the Transport this morning, accompanied by Mr Hunter and Mr Hazeldine the assistant adjt.\n\n","12":" 1255\n\nCold & frost but clear. We took all the horses & mules out today for exercise. L\/C A Borthwick, Pte\n\nPhillips & Pte J. Chippendale went on leave this morning to Blighty.\n\n8 men from the Company were sent to the Transports this morning for fatigues.\n\n","13":" 1256.\n\nThere was rain last night & this morning most of the snow was melted.\n\nI sent a parcel to my wife today – a flower vause made out of a shell case. It cost 3\/6d to send it.\n\nWe were paid today I drew 30 francs = £1-2-0\n\nP. Ryan came back from England to the Transports tonight.\n\n","14":" 1257\n\nOn parade this morning Mr Hunter told me that Bil Kiley and I were going on Blighty leave tomorrow. This afternoon we got our pass, warrant & my our ticket directions and an order for an advance of £10 from Pay Master Horseferry road.\n\nTonight I packed my things, polished my boots & had a shave ready to go in the morning at 9.a.m.\n","15":"\n\nLeft the camp at 9 a.m and motored to Baileul\n\n1258\n\nwhere we caught a train to Calais which we reached about 3.p.m. Then we marched to the sea, went into a rest camp, were issued with tickets for dinner tea & breakfast. Then I had a square meal went to the recreation tent for a little while which is run by the Soldier’s Christian Association. Then I went to bed in a tent with 12 in it.\n\n","16":" 1259\n\nReveille 5.15 Breakfast\n\nearly. We marched down to the pier before daylight and got on board the “SS Scotia one of the London & N. Western Railways Co. steamboats on the channel.\n\nThere was a stiff breeze and a choppy sea but no one was sea sick. We done the trip in about 1 ½ hours, disembarked at Dover and took trains to London arriving about 2 o’clock at the Victoria Railway station. We had a dinner tea, sandwiches & cake, at the station then went to the Australian Base Depot Horseferry Road, had some more tea a hot bath and a change\n\nof clothes also a new tunic.\n\nI booked my bed at the A.I.F. War Chest Club 97 Horseferry Road London S.W.1\n\nI wrote to my wife tonight.\n","17":" 1918.1260\n\nI was up early, had breakfast a haircut & a shave. Then I took a bus(h) to Liverpool St. Station which is about half an hours ride from Horseferry Road. I called on the London bank of Australia and found that Willie was still up at Norfolk War Hospital. At 10am I took a train for Thorpe Norwich\n\nticket 9 \/5 1\/2d and at Colchester missed my train while having a cup of hot coffee. I sent a wire to Ipswich to the S.M. to get my haversack which I left on the train. I will have to wait at this station for the next train which goes at 2pm. Arriving at Ipswich I found that my wire had only arrived when the train was going out consequently my haversack was not there. On reaching Thorpe Station I found it in the parcels room. Then I bought a 2d ticket and took the train to the village of Whittingham and started to walk from there to the Annexe War Hospital\n\nI had not gone very far when I met my brother on the road in the best of health and looking well. I had tea at the hospital and stayed the night at a private house not very far away.\n","18":" 1261\n\nThis morning I packed up three parcels of post cards to send to Australia, including one of my diaries No. 6. Had a long talk with Willie and had a look around the hospital. It is a very large place and before the war was a lunatic asylum. This afternoon Willie\n\nand I went by train to Norwich posted 2 packets of P. cards had a cup of tea and some cake and saw Willie back on the train. At 5pm I caught a train to London travelling via Lyn and Cambridge arriving at Liverpool Station about 8.30 then I took the tube to St James station travelling several miles underground and walked from the station to Horseferry Road and stayed at the War Chest club for the night.\n\nI obtained 12 views of Norwich and gave 2\/- to a stranded Australian on the train. Last night the Germans bombarded Yarmouth from the sea. It is\n\nonly 18 miles from Norwich so the shells seem to follow me no matter where I go. The Evening News says this is the 4th year of the war and the 165 day which corresponds with the Daily express reckoning of 1261 days.\n\nI wrote to A. Fisher today asking him to bring under the notice of the War department some inventions of mine. This is the third day of my leave.\n","19":"\n\n1262 \n\nSnowing all morning & did not get up until about 9am. After breakfast I took a bus to Euston Station and made enquiries there\n\nand found that I could not get my ticket altered to go via Glasgow to Ireland so I am going via Holyhead and Dublin. I had dinner at the YMCA Euston and then went by the tube to Victoria Station and walked from there to Buckingham Palace to see the King’s horses, coaches and harness. I had a good look around and it was well worth a visit. The stables are magnificent and kept in splendid order. The horses are beautiful and very quick I saw the late King Edward’s Black Prince 10\n\nyears old also one of the latest editions to the stables “Anzac\" and the King’s favourite horse “Delhi\".\n\nAfter viewing the stables I went by electric tram on the Metropolition line to Euston had tea and caught the 7.10 train to Holyhead travelling via Crewe. After some delay at the pier I was put on board the mail steamer for Kingston. We left Holyhead about 2.30 and arrived at Kingston about 7.30. Caught a train for Dublin a journey of about 6 miles. Took a jaunting car for the soldiers & sailors home,\n\nthe fare being 2\/-for about a mile ride.\n","20":" 1918.1263\n\nThere was a heavy fall of snow when we left England and was snowing when we reached Dublin. After breakfast I took a tram up Sackville Street and saw the Nelson monument across O’Connell’s Bridge and also the ruined post office which has not yet been replaced I continued the journey until I reached Phoenix Park I had a walk around the Park which is hilly,has a lake and\n\nsome monuments. Then I came back by another route to O’Connell’s bridge and from there walked to Dublin Castle. Here I spent about an hour and saw some curios including Kitchener’s sword when he was invested with the Order of St Patrick. I was given some threads from one of Kitchener’s sashes.\n\nYesterday at Euston Y.M.C.A. I posted two packets two my wife, one containg French Post cards & the other a diary Book Vlll. Tonight sent a packet of Dublin & Belfast P.C.\n\nto my wife and one to my sister. At 3 o’clock I boarded a train at Amiens station Dublin & arrived at Great Northern Station Belfast at 10 to 6. I went for a walk after tea tonight purchased some P.C. and some writings & packing of P. Cards for Posting.\n\nI am staying at the Belfast Sailors & Soldiers Service Club. Waring St.\n","21":"\n\n1264 day of the war. I was up late this morning & had just time for a wash & a\n\nhasty breakfast before catching the 9.30 train at the Great Northern Station for Kesh. I had to change at Clonas and Bundorn Junction arriving at Kesh about 2.p.m. and walked down the line to my uncles. There was a heavy fall of snow last night and it continued snowing all day.\n","22":" 1265\n\nThere is a misty rain today and it is very unpleasant outside. This evening I walked out to Muldoons in the snow to see\n\nmy cousin Mrs Muldoon and stayed there until 8.15. They have a fine baby girl 4 months old. When I got back to my Uncles Mr & Mrs Gibson were there and stayed until late. I did not go to bed until 12 o’clock.\n","23":"\n\n1266 day of the war and the 8 day of my leave. The snow is all gone this morning and I filled in the time this morning writing letters\n\n 108.\n\nAs it was showery I stayed in the house all day. The Gibsons came for dinner & spent the afternoon.\n\nMonday Jan 21. 1918. 1267.\n\n9th day of my leave. There is a fair at Pettigo and I went to it by train. It was a cattle and pig fare. There was a lot of stuff there and the buyers went around and did the best business they could with the owners. I saw the Martins at the Fare and went home with them in the afternoon. Some young fellowers called in at night on the way home from the fare and they held an impromptue dance. I was too tired to enjoy it.\n","24":"\n\n1268. \n10 day of leave,\n\na dull miserable day looking like rain a contrast to fair day.\n\nI made up a packet of foreign coins to post to my wife 14 coins in all. Tom Martin drove me into Pettigo this evening to catch the train. There I saw another Miss Martin who came to the station to see me. I had only about 10 minutes to talk to her. When I was here before she was in Belfast. I got a letter from Willie when I arrived at Uncle\n\nGilmore’s informing me of his safe arrival at the Harefield hospital Middlesex and t5hat he is to be sent back to Australia very soon perhaps next week or sooner. I wrote to him tonight I also made up a parcel of P. Cards of Pettigo and the Kings Stable to post to my wife. Also some to post to my morther.\n\nWednesday Jan 23. 1918. 1269 day of the war\n\n11day of leave\n\nI received a letter from the High Commissioner of Australia directing me to call at Australia House London, in\n\nconnection with an invention of mine.\n\nI had posted in Kesh this morning a packet P.C. to my wife No.6 and a packet of shell fragments No 7 to my wife. The packet of coins makes the 8th I have posted to her since I left France I sent my mother this morning a pkt of Irish Post Cards.\n\nI had dinner with Mr & Mrs Gibson today and then cycled out to Coolaness to see Mr and Mrs Riley. They also have a new baby since I was here before. I got back about dark, doing a journey of 6 miles there and back.\n\nThursday Jan 24. 1918. 1270.\n\n12 day of leave\n\nI wqas up at 7 this morning had an early breakfast and caught the 7.30 train my Un cle seeing me off at the station. I changed trains at Bundorn junction and when I got to Enniskillen stopped and went into the town had a shave called at the Post Office and saw Kitty then I went to where she is staying – Mrs Creswell – and wrote letters to dinner time. I sent my sister a packet of Enniskillen post cards also sent a card to my wife Mother and Mrs Murphy also Tom Brown. Kitty Gilmore got\n\nleave and we spent the afternoon together at 4.30 I caught the train for Bundalk bidding goodbye to Kitty at the station. She was the first of my relations that I met in Ireland and she was also the last that I saw. At Dundalk I changed trains and caught the boat train for Dublin passing right through to Kingstown. At Aimens Station Dublin we were supplied with tea and sandwiches. The train ran on to the pier alongside the ship and we passed from the train to the SS Leicester leaving about 9. It was a smooth passage over, and we\n\narrived at Holyhead at 12.30 in the night and boarded a train which was waiting for us. On our way to London we passed through Crewe and arrived at Euston Station soon after 6. Then I went ,after having a cup of tea ,by the tube railway to St James Station en route to the War Chest Club where I had breakfast and done some writing.\n\nFriday Jan 25. 1918. 1271.\n\n13 day of leave\n\nPart of this mornings work is already chronicled under yesterdays heading. I visited Australia House and then\n\ncaught an underground train for Paddington Station and took a train for Denham 30 miles from London to see Willie and then motored out to the Harefield Hospital only to find that Willie had gone on furlough this morning so I had dinner and came back to London to Marylebone Station and then went by the tube railway to the War Chest Club where I am staying tonight. I bought an Ingsol watch this evening for","25":" I lost the old one I bought from Victoria last Christmas\n\nwhen getting my clothing fumigated. It was not a big loss for it had not been going for over 6 months. I posted to my wife tonight a registered packet containing 1Belgian 5 Franc piece and two French two franc coins. This makes the","26":" I have posted and two to my sister and 1 to my mother 12 in all\n","27":"\n\n1272 day of the war and","28":" and last day of my leave.\n\nIt is dull and cloudy this morning. The weather during the past week has been remarkable fine for this time of year. This is Australia day and a man is selling wattle blossom on the street in front of the War Chest Club. He has a basketful of fine large yellow bunches the first I have seen since I left Victoria. It is today the 130 anniversary of the settlement of Australia.\n\nI am posting this diary to my wife today together with some post cards.\n\nIt makes the","29":" parcel since I left France at various times and places. I will now start a new diary No. 9.\n\n"}}