{"Document Name":{"0":"Diary_0170","1":"Diary_0170","2":"Diary_0170","3":"Diary_0170","4":"Diary_0170","5":"Diary_0170","6":"Diary_0170","7":"Diary_0170","8":"Diary_0170","9":"Diary_0170","10":"Diary_0170","11":"Diary_0170","12":"Diary_0170","13":"Diary_0170","14":"Diary_0170","15":"Diary_0170","16":"Diary_0170","17":"Diary_0170","18":"Diary_0170","19":"Diary_0170","20":"Diary_0170","21":"Diary_0170","22":"Diary_0170","23":"Diary_0170","24":"Diary_0170","25":"Diary_0170","26":"Diary_0170","27":"Diary_0170","28":"Diary_0170","29":"Diary_0170","30":"Diary_0170","31":"Diary_0170","32":"Diary_0170","33":"Diary_0170","34":"Diary_0170","35":"Diary_0170","36":"Diary_0170","37":"Diary_0170","38":"Diary_0170","39":"Diary_0170","40":"Diary_0170","41":"Diary_0170","42":"Diary_0170","43":"Diary_0170","44":"Diary_0170","45":"Diary_0170","46":"Diary_0170","47":"Diary_0170","48":"Diary_0170","49":"Diary_0170","50":"Diary_0170","51":"Diary_0170","52":"Diary_0170","53":"Diary_0170","54":"Diary_0170","55":"Diary_0170","56":"Diary_0170","57":"Diary_0170","58":"Diary_0170","59":"Diary_0170","60":"Diary_0170","61":"Diary_0170","62":"Diary_0170","63":"Diary_0170","64":"Diary_0170","65":"Diary_0170","66":"Diary_0170","67":"Diary_0170","68":"Diary_0170","69":"Diary_0170","70":"Diary_0170","71":"Diary_0170","72":"Diary_0170","73":"Diary_0170","74":"Diary_0170","75":"Diary_0170","76":"Diary_0170","77":"Diary_0170","78":"Diary_0170","79":"Diary_0170","80":"Diary_0170","81":"Diary_0170","82":"Diary_0170","83":"Diary_0170","84":"Diary_0170","85":"Diary_0170","86":"Diary_0170","87":"Diary_0170","88":"Diary_0170","89":"Diary_0170","90":"Diary_0170","91":"Diary_0170","92":"Diary_0170"},"Date":{"0":"unknown","1":1079.0,"2":1080.0,"3":1081.0,"4":1083.0,"5":1085.0,"6":1086.0,"7":1087.0,"8":1088.0,"9":1089.0,"10":1090.0,"11":1091.0,"12":1092.0,"13":1097.0,"14":1099.0,"15":1101.0,"16":1103.0,"17":1104.0,"18":1106.0,"19":1107.0,"20":1108.0,"21":1109.0,"22":1110.0,"23":1116.0,"24":1117.0,"25":1118.0,"26":1119.0,"27":1120.0,"28":1121.0,"29":1122.0,"30":1123.0,"31":1124.0,"32":1125.0,"33":1126.0,"34":1127.0,"35":1128.0,"36":1129.0,"37":1130.0,"38":1131.0,"39":1132.0,"40":1133.0,"41":1134.0,"42":1135.0,"43":1136.0,"44":1137.0,"45":1138.0,"46":1139.0,"47":1140.0,"48":1141.0,"49":1142.0,"50":1143.0,"51":1144.0,"52":1145.0,"53":1146.0,"54":1147.0,"55":1148.0,"56":1149.0,"57":1150.0,"58":1151.0,"59":1154.0,"60":1155.0,"61":1156.0,"62":1157.0,"63":1158.0,"64":1159.0,"65":1160.0,"66":1161.0,"67":1191.0,"68":1193.0,"69":1194.0,"70":1195.0,"71":1196.0,"72":1197.0,"73":1198.0,"74":1199.0,"75":1200.0,"76":1201.0,"77":1202.0,"78":1203.0,"79":1204.0,"80":1205.0,"81":1206.0,"82":1207.0,"83":1208.0,"84":1209.0,"85":1210.0,"86":1211.0,"87":1212.0,"88":1213.0,"89":1214.0,"90":1215.0,"91":1216.0,"92":1217.0},"Entry":{"0":"\n\n","1":"\n\nI start this new diary, the 3rd since enlistment under conditions perhaps the worst since war was known i.e. The Somme offensive. Such tremendous efforts & concentration of the results of the greatest intellects of the age have never before been availed of for one purpose & now ‘tis used for the destruction of humanity. Such a possibility in this enlightened age even, was beyond the wildest of dreams and yet we are now in the","2":" year of this devastating wholesale murder. The enemy still oppose us in great strength altho’ slowly but surely our vast efforts are pushing him back. Were it not for the fact that we still push on, it would be deemed impossible for men to withstand such privations & conditions & still live, and yet the men go willingly forward, guided by the unseen directing force which represents the might of England intensified & directed into a channel \n\nfor the destruction of militaryism & to establish the right to live as applied to nations. Before this will be done however great grief, pain & distress will be inflicted on countless numbers to a degree unknown before & I hope never will be known again.\n\nAt present we are running an advanced dressing station close up behind the line in a valley torn up by shells. So far the position has been a safe one, the enemy paying attention to adjacent positions. The wounded we have through are in a shocking state as a rule, soaked through with water & caked with mud, ‘tis a wonder they can exist without contracting pneumonia much less suffer their wounds. Am in charge of the station at night coming on at 8.30 P.M. till 8.30 A.M. which suits me very well indeed. I sleep well during the day & am comfortable at night as I work alongside a good fire. It has one drawback, it prevents me from exploring the neighbourhood\n\na thing I rarely miss as a rule.\n","3":"\n\nVery little doing, mostly cases of sickness coming through the majority being trench foot cases. Hundreds are daily sent through this being a serious source of wastage. Every endeavour is being made to find out the best preventative & every patient is interrogated to try & find out what he did in the way of looking after his feet. Rubbing with whale oil & the use of dry socks so far is the only thing any good. Had a nasty looking case in, the whole of the lower face having been shot away in addition to a fractured knee & yet he stood the dressing like a brick, one of the dinkum heros. Instead of turning in yesterday I went into Albert by car & tried to locate Morris. My usual luck again as he had just left that morning. Arrived back at 6 P.M. & went on duty again at 8.30 but managed to get a few hours sleep as things were very quiet. On arriving back found two splendid parcels\n\nawaiting me, one of which contained a warm vest & bed socks very pleasing to the eyes. Have managed to get several letters away altho’ we are not supposed to send anything but F.S. cards from here.\n","4":"\n\nMatters still quiet, mutual shelling going on as usual. Weather very cold, frost at night and ice lasting all day. Have been put down for leave in about three weeks time so am looking forward to it. Took advantage of the slack time to have a sponge over & clean change of underclothing after which I washed what I took off. Tis a great luxury to be able to do this while out here. Watched the two 6\" naval guns firing tonight. They are about 50 yds from our huts & make a terrible row. The flash lights up the surrounding country as by day momentarily, the sheet of flame appearing from behind to be about 16 ft. in diameter.\n","5":"\n\nVery few wounded coming through, our last being a Fritz wounded in the foot. When he arrived in nearly all his buttons\n\n* Total\n\nOne division for 10 days\n\nhad been cut off & when he left us there were none left. Everyone he came in contact with cut off a button & he started buying favours by pointing them out when he learnt that everyone wanted one. Had I allowed it the beggars would have taken his cap knife etc. it being a perfect mania amongst the chaps. He had a gold watch & chain & each time he was handed over, the one in charge was notified of it so as to hand over intact & so on. Large number of trench feet cases coming through we having passed through 940 * odd cases so far. Evidence is being taken & I fancy that some of the O.C.’s will be hauled up over it as some divisions are singularly free from the trouble. So far as I can see the absence of warm food or drinks & gum boots is responsible for most. Many of the men were crying with the pain & I gave several morphia. Had a few shells land nearby during the day the nearest throwing mud on the roof.\n","6":"\n\nFrench foot traced to presence of bacteria in mud of trenches.\n","7":"\n\nVery cold weather, the ground being frozen hard. Had a very busy night our chaps being caught in a barrage while charging over – majority of cases were fairly severe. Had two cases of exceptional interest. In one man a nose cap of a shell was embedded in the flesh making a large cavity. The second was most gruesome. Whilst probing a wound the M.O. drew out some hair & on persevering he found a piece of a man’s skull which had been blown into the mans leg, being wounded in fact by this fragment of \nschoo\n skull. Plenty of shells coming over but so far none seriously close\n","8":"\n\nHad a fairly busy night with wounded with a few bad cases. Sick & \"trench feet\" have dropped in number the last couple of days & orders have come out which hold the officers directly responsible for undue cases. In one case they quoted the","9":" Division lost 100 through \"trench feet\" in one day while the adjoining division only had 6.\n","10":"\n\nOn day duty for a change, the change over giving me the opportunity to look around a bit. In the morning set off early & walked close to the line with the object of seeing a tank of which so much has been said. It was well worth seeing being practically undamaged except for some defect in the engine which has not yet been repaired. The length of the body was about 28 ft., the steering wheel making the full length about 32', width 8', height 7'. They are of two kinds male & female, the female carrying machine guns only, the other having two 6 pounder hotckiss guns mounted in turrets on the side. 300 shells are carried & about 9000 rounds of machine gun ammunitions. The engine is a Daimler motor engine 6 cylinder petrol being in two tanks forwards. Electric light provided inside also headlights. Clearance under main body about 18 inches. Caterpillars are used for propulsion, running underneath continuing over the top of the \n\nwhole affair. Periscopes were fitted on the sides the driver having a slit through which to see which he could close at will. In addition were two places where rifles could be used. On the roof were vent holes also a port hole about 14 inches in diameter. The heat & noise inside must be very great the heat being about 120 ° I believe. Leaving this I journeyed through Delville wood the scene of much fighting & was astonished to find the number of bodies lying unburied both German & English In one small area over 100 bodies could be seen practically all of \nof\n which were rotting & falling to pieces. Various parts of bodies such as legs or arms could be seen also headless bodies lying just as they had fallen, officers being amongst the number as one could see by their uniform. Practically all the bodies had been robbed their packs & pockets gone through in search of valuables & in one case, one had his\n\nboots taken off. Guns, helmets, bayonets, bombs & all the gear of a battlefield were still lying about, the battle evidently being a frightful affair. Not a tree was unmarked or its proper height. Bare trunks torn & scarred & cut off short was all which remained of the wood the sight was truly terrible & one never to be forgotten. \"Longueval\" the same as other villages in this area is but a name. Nothing now remains except the remains of farm implements, broken bedsteads etc. All bricks & stones have been used on the roads & now one wanders at will over cellars, seeing here & there relics of Estaminets, farmhouses etc. Not a foot of ground remains unshelled, torn by one side or the other & as we walked along the enemy was shelling different areas with both shrapnel & H.E. His plan is to put a few shells wherever ‘tis possible for men to congregate or work\n\nbut ‘tis remarkable how few he really hits. With four shells this morning in front of us he only hit one man. \n\nAs expected stringent orders have come out concerning trench feet making the officers directly responsible. The","11":" Division has been the worst affected having 100 cases in one day against 2 cases from the adjoining division. Now various remedies are made compulsory. 1. The feet to be rubbed once a day with whale oil & rubbed twice without. 2. Gum boots to be worn in the trenches. 3. A drying room to be provided for socks & each man to always have at least 1 pair dry. 4. Puttees not be worn in the trenches & bootlaces loosened. 5. One hot meal & drink at night. 6. Exercise to be taken preferably in improving the trench. These are the chief items & are supposed to be the result of two years experience.\n","12":" \n\nThings very quiet the last two days but have had a few shells over with a few casualties as a result. Have written several letters as had plenty of time to spare The flow of trench feet has stopped. Very few cases now coming in pointing to more care being taken.\n","13":"\n\nNothing much of importance to mention for the last few days. On Monday we had a fall of snow, a very pretty sight indeed. A wind was blowing which caused the snow to collect on one side only of trees etc. making a very nice shaded appearance. Had rather an exciting night. Several shells landed quite close throwing mud etc. all over our residence. The first was very close indeed & landed about 11.30 P.M. when everyone was asleep. It awakened me & after several seconds of silence during which the debris was landing on the \n\nroof I ejaculated – charming. This discovered everyone to be awake & started them talking but we all went off to sleep again only to be awakened again by another later. No damage however bar a tent.\n","14":"\n\nMore rain & cold weather. Mud now as bad as ever except when we are using boarding to walk on. One man had a narrow escape. He walked into some mud & found himself sinking, probably into a shell hole into which the mud had run, and before he was rescued by 5 of our chaps, only his head & one shoulder could be seen, another few minutes & he would have been finished. Walking at night off a settled track is impossible & even when on boarding is very risky. The only way possible is to wait for the gun flashes, take a few paces & then wait for the next. Had a case in last night where the femoral artery could be seen beating in the wound, being missed by a hairs breadth. Had it been cut death in the case would have ensued in a few minutes.\n\nWounds of today are mostly \nsheet\n from shell with a fair proportion of shrapnel bullets wounds being a rare occurrence.\n","15":"\n\nJust two years today since I enlisted and we are still a long way from victory. Am glad to say that I can still keep as cheerful a spirit as before, not being fed up or downhearted or tempted to slander everything military. Spent the day on a visit to Amiens. One of the officers was going on leave & the car was going to pick up some red cross goods so I took the opportunity of seeing the place instead of having a sleep We had 30 miles to go & it was fairly cold but thoroughly enjoyed the outing. The contrast was remarkable, from the mud & fighting on the Somme to the fine streets & well dressed people of Amiens. A four course dinner cost\n\nsomething under 5 francs with a bottle of wine & after that I paraded the streets buying a few views & things to take back with me. Tis indeed a fine town & very prosperous looking, crowded with soldiers, the few men in civilian clothes being well dressed & the women especially so. Certainly it was a sight for sore eyes. The Cathedral was a fine sight the front & main entrances being protected by sandbags also parts inside the building. Reached home about 9 P.M. just in time to go on duty for the night.\n","16":"\n\nWent in to Albert & Becordel for something to do as I did not feel very sleepy. Took in a meningitis patient to hospital & had dinner there going onto Albert. There we picked up stores & managed to buy some papers & then turned for home. It was very cold & the snow began to fall, soon covering everything. It was indeed an experience to me, motoring in\n\na snow storm. Saw Birdwood strolling up the road yarning to the chaps. The roads were all frozen hard & very slippery it taking us about an hour to get up one hill. The horses find it difficult to keep their feet even while walking much less pulling a load. Our division is now being relieved by the","17":" but so far have not met Morris.\n","18":"\n\nMore rain during the last three days & roads becoming soupy again. Fritz bombarded all round us on Wednesday & blew up some huts killing & wounding several. He kept it up all day sweeping the whole area of the valley & cutting the railway at one point. Next day Morris’s batt. arrived & I followed him up & had a good long yarn. I brought him back to camp & gave him some socks, comforters & a sheepskin. Our bearers have now gone back & we follow tomorrow having spent a month in this delectable spot.\n","19":"","20":"\n my third in the Army, the last being spent at Lemnos. On the 23rd we left our station at Bernafay Wood & came in by train to \"Meaulte\" where we picked up a \"Chara-banc\" which put us down at the Mill in \"Ribemont\" a very decent billet indeed. Next day hunted round & bought a goose for 38 francs also some vegetables & gave a woman 8 francs to cook it which she did very well. As our parcels did not arrive in time for Xmas, a very grave error on someones part, we had to buy cakes, puddings etc. We went to \"Corbie\" for wines & bought about 16 bottles at a cost of 85 Francs & taken all round our Christmas dinner was a great success considering our short time to prepare. At night a few of us visited the","21":" Field who were having their dinner at night. We timed our arrival after their meal\n\nwas over & received a great welcome. Their show was the best of its kind I have seen in the army, absolutely magnificent, 5 geese, several vegetables, wines, whisky, champaygne, soda water, beer, stout, creme de menthe etc. etc. ad lib. The weather has been rainy with plenty of mud as usual a state of things we are now accustomed to.\n","22":"\n\nNothing doing at all, rain & mud everywhere & things generally miserable.\n\nThursday 28th Nothing doing. Went for a bath to Heilly yesterday which was well worth having. At night went along to see a Troop run by the Comforts Fund & it was real good. Several of the jokes & songs had a trench flavour which made them all the more enjoyable.\n\nTis a great idea to provide amusement for the troops in this way. This morning had a parade at which a court martial sentence was read out, one of our wasters had deserted twice & was condemned to death but being an Australian the sentence was commuted to 5 years. The death sentence would have been a salutary lesson to several of the same kidney. Many a Tommy has been shot for less. Weather very cold, heavy frost at night.\n","23":"\n\nNew Years day passed off very quietly. Day wet & dreary with usual mud. Could not purchase anything in the poultry line so bought a roast & extra vegetables, soup, etc. & had a real good dinner. Went to \"Corbie\" the day before to purchase some wines & had a real good day. We were invited inside & met \n\nthe family, three spanking girls which meant that we missed tea & spent 4 hours there. Had sundry bottles of champaygne, old English 1904 at 18 francs 50 a bottle which meant that we had a most enjoyable time. Drove home at a great pace & finished celebrating the New Year at our billet.\n","24":"\n\nHad leave granted to England today & have just completed packing. My first leave for over two years so am looking forward to it greatly. Went by car today to various battalions to evacuate sick & had a good run round.\n\nHave just returned from leave & will try & write up my diary for that period. I found it utterly impossible to do so when away, my time was too much occupied, spare time all too little was spent in sleep.\n","25":"\n\nWe left our billet, 5 of us, to catch the 1.30 A.M. at Mericourt Station. First we had a cup of tea at the canteen and then repaired to the station to wait for the train. And it was a wait too. Not till 8.30 did it arrive during which time we shivered on the station cursing things in general and the train in particular. However we were at last on our way to Le Havre reaching there 3 A.M. next morning a very tiring trip indeed passing through Amiens, Dernalie, Rouen etc., the last being brilliantly lit up quite different to English towns.\n","26":"\n\nReached Havre at 3 A.M. where we were kept standing in light rain with our packs on until 4 A.M. when we were marched off to the Rest Camp. More delays at different points until I thought we would never get there. At last we were told off into shelters which boasted a roof & 3 sides & were late stables. However I procured\n\na paliase & slept till 10 A.M. At 11 we had our passes stamped to go off that night. The remainder of day I spent roaming round the camp which was partly tents & partly huts in various stages of construction. The place was crowded with men going & returning from leave & the Y.M.C.A. huts were crowded to suffocation, altogether a very dismal spot. At 6.45 P.M. we paraded & were not marched off until an hour later for the boat a distance of about 4 miles mostly through docks. Altho’ we started off in fours each time the men soon straggled and at times reached right across the road causing great crushes at certain spots. The docks were well worth seeing being crowded with war material of every description, everything seemed to be there & in plenty & spoke volumes for the output of Great Britain. On reaching the ship The Viper we were able to purchase a cup of tea &\n\nsandwich after which I turned in on deck there being every promise of a rough trip.\n","27":"\n\nSailed about midnight & as expected I was sick. We reached Southhampton at 5 A.M. but had to lay off until 7 before we could get in. Managed to get a good breakfast off the steward in the officers saloon which bucked me up a lot. At 9.30 we boarded the train a real treat after the French trains & reached London about 11.30. The day was beautiful & the weather mild a very happy start for our leave. We marched to Horseferry Road where our offices were but was much disgusted at our treatment there. The staff were much too casual & kept us waiting hours on end before they fixed up our pay & changed our French money, a great shame seeing the trials we suffer to get leave while they are all in soft base jobs. While waiting I went across to the War Chest Fund building & had dinner, cost 1\/- & was a ripping 3\n\ncourse meal. There I also had a wash, shave & clean up in general before going to the Hotel. After sundry delays I at last got fixed up but had to buy a tunic as they would not give me one & then took a taxi to the National Hotel, Bedford Place, rather a decent place. I had a bath & was fixing up things at the office when Miss Andrews, Miss Le Marchand & Mrs. Furber walked in much to my surprise & to theirs and as they were just going to the Coliseum they asked me to join them, so putting in a good night for a start. The show was a good one & I felt made as things were going so well.\n","28":"\n\nWrote a couple of letters to friends but before posting them went along to L.M. & Co. to see if there were any letters for me & whilst there Bill Drummond walked in to enquire for my whereabouts Such luck would seem to be impossible especially with one of the Drummonds as \n\nwe always seemed destined to be parted. Well we had lunch together & then took him to the Tower after which he came with me to the Hotel for a few minutes before leaving for his friends at Rickmansworth. That night we went to \"Home on Leave\" rather disappointing on the whole but funny in parts, Marie Lohr taking a leading part.\n","29":"\n\nSydsay being stranded took him for a long walk & showed him some of the sights through Hyde Park, Albert Memorial & Hall, Buckingham Palace, Whitehall, The Abbey etc. finishing up at the Tower. He then joined our party & we went to a Sunday Night Concert at the \"Palladium\" a real good show after which we had supper & then home, quite his best day in London he said. He was over on leave with his brother but were not happy together as they cared for different things. The brother hated anything historical so they found it hard to get \n\non.\n","30":"\n\nDecided to do some shopping & bought some genuine photos of the front to send home. Weather still good & much better than I expected. I found that when indoors such as going to bed it was much more comfortable than in Australia. There in the winter one has to undress & hasten into bed, the same with getting up in the morning, but in London I found the buildings warmed so well that no discomfort is experienced at all. At night we went to the \"Misleading Lady\" rather good acting by Gladys Cooper and Weedon Grossmith, parts were extremely funny & I thoroughly enjoyed it. Had supper at the Hotel as I did most nights.\n","31":"\n\nHad telegram from Will D. who was staying with friends, Roscoes at Rickmansworth, saying they wished me to go down so after lunch I went down & took cab at station for a drive\n\nof 4 miles, receiving a great welcome from them. They were a typical old English family doing things in good style without any false nonsense. Had a few hits at golf that afternoon & ended up with a walk, sleety weather but exhilirating. At night had a long discussion on things in general with the eldest girl, a very brainy person & much travelled, quite a treat. Slept very well that night a thing I could not do in London.\n","32":"\n\nWent for an 8 mile walk through very interesting country saw Milton’s Cottage with many of his relics & then went onto the home of the Quakers. Here we visited the meeting house of the friends & saw other places of interest reaching the house about 1.30 after a very fine walk indeed. Milton’s Cottage at Chalfont St. Peters and Quakers at Jordans, William Penn\n\nplace & also the Hostel frequented by the Quakers. Stopped inside & yarned during the afternoon the man driving us to the station for the 6.30 P.M. train to London. From here Will went onto Scotland having got an extension of leave & I promised to run up later. That night I stopped in the Hotel yarning & enjoying the lounge. Found letter from friend Ramsay announcing his arrival in London & to meet him next morning at 10 A.M. Weighed myself, result just under 12 st. \n","33":"\n\nWent to meet Ramsay at 10 but he did not turn up untill 11 A.M. having made a mistake in the time, a very unfortunate thing for me as I was up late & had to rush away without breakfast or a shave. We had lunch in The Strand, booked seats for the Opera \"Young England\" & later returned to the Hotel for tea. The show turned out to be very good, the theme, Sir Francis Drake being a stirring one & the music being splendid. Saw\n\nRamsay off after Supper.\n","34":"\n\nWent down to Horseferry Road & managed to get an extension of leave for 2 days which made a big difference & feeling happy I had a long walk along Piccadilly. Went back to Hotel & sent off photos & postcards of France also a nose cap I brought from Delville Wood & some books of views of London. At night we went to \"Vanity Fair\" a real good revue & the best I had seen so far. Had photo taken at Histeds.\n","35":"\n\nCaught the 9.50 A.M. to Cambridge in order to see H.B. Carr a friend who was in a Cadet Battalion training for officers. Had lunch in first rate style at the University Hotel commencing with whisky & soda & finished with coffee & liquers. During the afternoon was shewn round all the different colleges & buildings all of great interest indeed & then visited the Union Club, signed the\n\nvisitors books & had afternoon tea there, a first rate institution. Altogether was very pleased with Cambridge. At night no lights were allowed at all & it was very difficult to get along. London was not half so bad as a portion only of the lamps were obscured. Caught the 7.4 back & reached London just in time to get a taxi & rush across to Euston in order to catch the mail to Glasgow at 8.50. A small tip gave me a carriage to myself & I slept most of the way but was glad to get out once & receive a cup of tea & scone from some good ladies at 2 A.M. in the morning.\n","36":"\n\nArrived in Glasgow about 8.30 & was ushered in to a buffet & given tea & cakes after which I took a taxi to the Harpers. Went to church in the morning with them & a stroll in the evening but had to have a sleep between 6 & 8 as I could not keep awake.\n\nHowever at 8 we had tea & turned in shortly after 10 catching the 9.10 train in the morning back to London. I was very pleased I ran up as Will D. was there & I was glad of the opportunity of seeing them again.\n","37":"\n\nSpent Monday returning to London a trip I enjoyed altho. it was rather tiring. The whole country was covered deeply in snow & was indeed a very pretty sight & one quite new to me. Had lunch on the train, rather good. Returned to Hotel & we went to the 9 oclock house of the Palladium rather poor on the whole. Supper on our return.\n","38":"\n\nWent round flat hunting with friends, rather a quiet day. Went to see L.M. & Co. & saw Mr. Brown & Thoroughgoods, very decent to me. Would do all they could. At night went to see \"Theodore & Co.\"\n\nat the Gaiety which proved to be the best show I had seen. It was indescribably funny & had me in roars of laughter all the time. Walked back to Hotel & were just in time for supper 11.40 P.M. Such hours were the usual thing, rising about 9.30 in the morning but I really did not sleep too well in London, either the bed was too soft or I was having too good a time\n","39":"\n\nThe day of my return. Called at Cloak Room Charing Cross for a tunic & waterproof cape given me by Ramsay & later left mine there for him to pick up & keep for me. Saw my friends off to Winchester & went out with Mrs. Furber as she wanted \n me\n to buy me a scarff for a present as I had lost mine. After that I picked up my gear at the Hotel & went to Waterloo to catch the 4 P.M.\n\ntrain. The station seemed full of Soldiers returning & there was a great crush getting onto the train. Many were tonicked but no notice was taken by the heads and we moved out at 4 P.M. after various farewells had been said by those who had friends seeing them off. One old lady gave tracts to us with words of advice & so on, it was a strange experience altogether this leaving London. As one man said – he did not wake up until the train moved out. For 5 minutes conversation was brisk after that we all seemed to get sad at once & not a word was spoken for the rest of the journey, truly a sorry crew. At Southampton we boarded the \"Donnegal\" & at 8 P.M. set off for Havre reaching there about 3 A.M. I chose a good corner on deck & then went down to the galley to get something to eat & managed to raise some bacon & eggs & sandwiches for the morning but on my return to the deck I found a \n\ndrunk had been put in my corner. Not liking to pass him out I turned in alongside but later he was troublesome so I had to move. The last I saw of him was about 2 A.M. when he sat on my face just when I was well asleep. The trip itself was very calm but I managed to get very little sleep.\n","40":"\n\nLeft the boat about 7 A.M. & marched to the rest camp again being told off to our stables again & given 3 tickets for 3 meals. The meals turned out to be a lump of bread & butter with sardines & one had to stand in a queue for hours to get even that. I was feeling rather doleful but sent off a couple of letters & then tried to fill in time walking round the camp & generally found myself humming sad tunes. A rotten day altogether, cold & rainy. At 7 P.M. they gave us 3 blankets each & I was glad to turn in for the night after a meal of bread & butter\n\nSaw a couple of airships flying round used I believe looking for subs. in the channel.\n","41":"\n\nAt 3.30 A.M. we were called up & about an hour later were marched off to the train, boarding it about an hour later again. At 6 A.M. we set off thus beginning a journey which was a fearful nightmare to me. At 9 we were given a cup of tea & hardbiscuits, midday bully & biscuits & for tea, biscuits & tea. By nighttime I felt quite ill could not eat, back was aching & really felt that I was in for something serious. I began to feel desperate so lay down on the floor of the vestibule of the carriage not caring who walked over me. Altogether I lay there about 12 hours the whole journey taking about 26 hours a slow monotonous trip with long stops here & there. At one place I saw six trains stationary, one behind the other shewing the great congestion and\n\nonly 3 days before they had had an accident in this spot killing 12 & injuring about 20, all going on leave. However we at last reached Albert we the majority of us disembarked & I set off for ‘Becordel’ about 2½ miles away trusting to luck to find my unit there or if not I would be amongst friends so could get a feed & wash. It was bitterly cold, snow being everywhere & I was glad of the walk in order to get warm. When I reached Becordel I found my unit had arrived the day before so all was well altho’ I could eat nothing for breakfast.\n","42":"\n\nAbout the first thing I did was to have a wash & shave after which I began to feel myself again but the cold was very severe & I felt very cold & miserable all day, even near a fire my back would be cold so altogether my return was not of the \n\nImage\n\ncheeriest. The best thing of all was to see the chaps again as after all a mans unit is his home. During the day I managed to rake up some bedding & so prepared for a cold night which luckily I slept right through. During the day I was kept talking some, telling of my doings etc. etc. each comparing notes & those who had still to go asked questions until bed put an end to it all. My first duty was to write up this diary before I had forgotten it all.\n","43":"\n\nFelt very off colour altho’ managed to eat a little more than day before. Had great difficulty in keeping warm & felt generally miserable, quite out of tune. Wrote a few short letters in the afternoon being kept from actual shivering by a fire & wrapping myself up. Felt better towards evening.\n","44":"\n\nHardly knew myself again I felt so much better. Was O.S.\n\nfor the day & the old duties allied to shifting camp proved the medicine I required. During the day I definitely shook off \"Blightyitis\" & once more went about my work cheerfully as of old. At 9 A.M. we marched to \nfor\n \"Buire\" about 4 miles back to take over a rest station being run by the 1st Field Amb. Thoroughly enjoyed seeing my old unit again. C Section running the place so I took \nof\n over the Dispensary altho’ did not do much that day. Had the good fortune to meet Morris on the way down. We were marching through \"Dernancourt\" when he walked out of his billet into the street. Later he came up to see me & we spent several hours together when I told him all about my trip & how I had left Will etc. It was a great pity we did not do the trip together but it was not to be. Bitterly cold & snow still lying thick.\n","45":"\n\nExtremely cold altho’ not unduly affected by it. All my mixtures are frozen hard & have to be warmed before I can use them. Anything left damp such as a towel is frozen stiff & an overcoat if wet will stand up on its own. Temp. 15 ° below freezing I believe. Went through & checked dispensary during the day & sent in a recq. for more stuff. Took over a small canvas possie from one of the chaps leaving, very nice, contains stretcher, fire place locker etc. etc. a perfect little home & standing out amongst the snow by itself looks very quaint. At night lit the fire, boiled some water & had a good wash before turning in, a luxury this weather.\n","46":"\n\nHad to shift the dispensary so had a very heavy day as there was a great lot to move & rearrange. Twas a job I liked however. Still extremely cold the wind especially blowing over the snow almost cutting \n\none in half managed to keep warm however. Quite resigned to my work again my indisposition having quite left me\n","47":"\n\nStill moving the dispensary & carrying on ordinary work at the same time. Quite a lot to do & very nice too as tis bitterly cold & very painful away from a fire. Managed to get an oil heater during the day which improved things a lot. All the mixtures now get frozen & have to be melted daily & even freeze during the day after once having been melted. Even the ink has to be melted before writing & altogether things are only middling. Am feeling very well with a first class appetite. Getting stores is turning out very difficult & as we are using a lot of sulphur ointment I had to turn to & make it out of what was handy. This turned out to be whale oil usually liquid\n\nbut now frozen hard enough to make an ointment with.\n","48":"\n\nStill busy arranging dispensary making stuff & issuing drugs to battalions etc. Whale oil ointment turning out well & have to make more as supplies have not yet come to hand. Still very cold, snow everywhere several accidents from fellows playing on the ice. Bombardment very heavy & has lasted for some days.\n","49":"\n\nSaw Morris today with one star up. He was on his way to ‘Amiens’ but I could not manage to go with him. Guess he will do well as an officer. Work a little easier today but supplies still not to hand. Cold as ever, 20 &percent of frost being registered. The cold snap also covers England from what the papers say. Aerial activity today & a taube came down nearby.\n","50":"\n\nCold conditions still continue. Nothing much doing & have at last got recq. through for supplies. Plenty of strafing going on with Taubs over to see what it means.\n","51":"\n\nDrugs arrived at last so all is well. Report through which explains the bombardment. We had an advance yielding over 350 prisoners very good indeed. Weather still cold. Albert & surroundings heavily shelled today. Divisions going through to take over more of the French front.\n","52":"\n\nCold still continues with addition of snow, papers today stating that these are the coldest conditions experienced for 20 years. Our Christmas parcels arrived today, belated but welcome.\n","53":"\n\nStill very cold. Usual duties but a little trouble in keeping up supply of ointment for the scabies. Am\n\nat present making up a bucketful a day with whale oil usually a liquid but now a solid owing to the cold so the conditions are useful in some ways. Ground frozen to depth of two feet, tanks baths etc. out of commission, with ice.\n","54":" ‘17\n\nA mild day in comparison to previous week but towards evening wind came up and it was as bad as ever. Had interview with Colonel concerning ointment shortage & he telegraphed the base. Went for long walk at night, beautiful moonlight. Guns working up in intensity again.\n","55":"\n\nNothing of note, guns still plugging away & cold as bad as ever 13 ° below zero according to the papers Had a washing day & after bathing myself, by sections, put on a clean change washed in London & then washed those taken off, some achievement this weather & a slight cold as the result, however\n\nit was worth it.\n","56":" &","57":"\n\nNothing of note to recount. Usual cold prevails with no sign of a thaw. Duties same as days preceding. Guns still very active some specially large ones making themselves felt.\n","58":"\n\nNothing of importance doing. Great rumours about concerning American attitude over Germanys U-Boat manifesto. I annoy quite a number by refusing to believe that America has already declared war & that Austria has asked for a separate peace etc. Personally I save myself a great deal of worry by refusing to believe or even think about anything until it is official & don’t they flare up when I start putting such questions as Who told you? Did you see it yourself etc. Tis taken as a personal slight.\n","59":" to","60":"\n\nMostly ordinary routine with usual severe cold made worse by shortage of oil for heater so that have had no warmth at all. Bombardments very heavy at night with several successes of a small nature. Troops now hop over at same time shelling commences, that is intense shelling when guns of all sizes are in action, the barrage lifting every minute results have been very good. Had several bottles burst by contents freezing & great difficulty in melting contents for use. Had an afternoon off to go to Heilly 3 miles distant where I had a hot bath. We then had tea of new laid eggs & walked to Mericourt to an entertainment not much class however, & had supper at the Canteen in ‘Ribemont’ before returning home, quite a big day indeed. Went to ‘Albert’ for drugs one afternoon & had a drive of an old ‘Ford’ which had more whims & fancies than fifty ordinary cars.\n","61":"\n\n2nd anniversary of my sailing from Sydney.\n","62":"\n\nNow over two years since I sailed from Sydney in the old \"Seang Choon\" for active service and still the end is not in sight, however we know we cannot lose now so all will yet be well. Am sure the time has dragged with those at home, they have not had the variety of scenes & incidents to encounter that I have. Through it all I have only had the one sickness so must consider myself very fortunate. Had a jaunt on the Major’s mount. First went to Heilly & watched the horses while the others had a bath & then rode on to ‘Corbie’ where we had tea, 6 eggs being the chief item riding back just on dusk. A most enjoyable time altogether & did not feel cold altho’ snow covered the whole landscape. The thaw appears to have set in at last the temp. being much higher altho’ actually it feels just as cold as before.\n\nImage\n\nWednesday 14th Feb.\n\nGradual thaw continued today but very cold wind blowing, did not seem able to get warm all day. Guns on the go again on French side as well.\n","63":"\n\nSame old routine with weather much improved, not nearly so cold. Thaw set in properly altho’ ground still frozen hard. ‘Tis now raining, the first for over a month. Had a specialist here to report on our cases. He showed in no uncertain way that our M.O.’s knew very little of scabies a fact they certainly admitted. Almost half of our patients he said were dermatitis his advice & treatment being acted upon immediately. Supplies coming forward better.\n\nMonday 19th Feb\n\nThaw going on slowly assisted by some rain & just as well to as the roads are given a chance. Stood on a nail today which ran right through my rubber boots into my foot, very painful & after squeezing it etc. had an injection against\n\ntetanus. This soil is teeming with the infection & a rusty nail in the ground is a good carrier. My next job will be to mend the boots. Went for drugs today to \"Puchevillers\" a new place to me being in the 5th Army area to which we now belong, distance about 20 kilos & road not of the best. Heavy fog most of the day. At last the lack of supplies in drugs has been settled & I now have a large stock of ointment of which we are using a large quantity.\n\nTuesday 20th.\n\nNothing but rain all day so rested my foot which is not very bad altho’ gave me a bad time during the night.\n\nThursday 22nd Feb\n\nweather now fairly mild altho’ plenty of mud about things very quite. At 8 oclock at night orders came through for B & C Sections to move off at 10 a.m. next day rather too sudden for our liking as we had nearly 500 patients and all our\n\ngear was in use. However it had to be done so we set to & started packing up getting to bed between 12 & 1 A.M. having fixed up all bar the loading.\n\nFriday 23rd Feb.\n\nUp early being pulled out at 6 A.M. by the W.O. much to my wrath, it was just as well perhaps as much had to be done. By 10 we were ready to march being timed to go at 10.30. Owing to my foot being bad I rode most of the way it being very cold sitting on the waggon. We had about 11 miles to do as we had to take over the main Dressing Station at \"Longueval\", a little past our old station at Bernafay & we reached there about 3 in the afternoon taking over from the 12th next morning at 9 A.M.\n\nSaturday 24th Feb.\n\nTook over the station from the 12th this morning & found things very decent. Had a very busy time squaring things up as we had to carry\n\non with sick & wounded as well as unpack & arrange our gear etc. By the end of the day we had everything in apple pie order altho’ I found many very necessary things very short. We have several huts to work in with a few dugouts inhabited by a few of the personnel. Found the roads very fair altho’ very soupy, still the 3 days rest from traffic insisted upon from commencement of the thaw saves them from being cut up.\n\nSunday 25th Feb.\n\nAnniversary of this units formation at Tel-el-Kebir and we had arranged festivities to commemorate the event at \"Buire\" which however was knocked on the head by this move Menus & programmes had been printed Guard’s band engaged to play during the afternoon & a good dinner prepared all of which had to be given up. Had a fairly busy day with dressings\n\n& general work & getting a recquisition prepared. Most cases were trench foot with a few general sickness & wounded. Great happenings in the line during the night. It appears that something in the nature of a general withdrawal of Fritz from his front line was made & our Chaps have advanced a distance ranging from different reports from 600 yds to 10 miles. All we know for sure is that an advance has been made without opposition. We received a signal message to prepare to move forward at a minutes notice but the order was countermanded later & the 15th Field sent a section forward instead. Naturally everyone is much elated & eagerly awaiting further news.\n\nMonday 16th Feb.\n\nNothing further known here about the advance made all sorts of rumours being about. Today has been ideal, beautiful sunshine all day & very little\n\nstrafing going on. Just as I write this Fritz has started his evening contribution which are landing round the road a few hundred yards away, two Yanks out of seven so far. Work during the day has been very slack & I hope to get away tomorrow to go up & see a special dugout near the line. I can combine business with pleasure as I really want to know what stocks they hold.\n\nThursday 1st March 1917\n\nThings very quiet the last two days very few cases coming through. No one yet knows the extent of Fritz’s retirement, our chaps moving forward cautiously & consolidating as they go. Went out to day to the advanced possies one of which is a most elaborate affair. ‘Tis a series of tunnels extending for miles, very deep down & provides accomodation for ambulances, signallers\n\nImage\n\nheadquarters etc. all connected up. Had a good look at Flers which was being shelled & the day being fine had a good look at Bapaume a goal of long standing. Shelling was going on all the line both shrapnel & heavy stuff. Great improvements had been made since my last trip, light railways being everywhere & of great value the wounded being sent down by rail saving a very long carry. Had a couple of taubes over during the afternoon but our Chaps seemed to take but little notice of them. Roy C. turned up during the day having come to the 15th a couple of days ago.\n\nFriday 2nd March 1917\n\nThings very quiet altho’ indications of a busy time coming. Had several Huns through today, Bavarians & more to come. Weather on the cool side but dry.\n\nSunday 4th \nFeb.\n\nThe cold winds appeared to have started as today was cold & windy. Things very quiet in the line except for shelling, a pretty stiff lot being thrown over on our right. Planes fairly lively two huns & one of ours being brought down.\n\nMonday 5th \nFeb.\n\nHeavy fall of snow last night everything being covered this morning. Had about 15 cases in during the night all from one battery. They had just moved into position at Flers when Fritz located them & put over 200 heavies toute de suite playing up the very deuce. A dugout 30 ft. deep was destroyed burying the men inside, a tribute to the power of heavy guns & an anti-aircraft gun also got knocked rotten. One of our machines took on & brought down two huns during the day\n\nTuesday 6th \nFeb.\n\nGreat activity in the air today several encounters taking place. In one which I watched the Hun was forced to descend in his own lines. Went for a ride during the afternoon about 15 miles. Received by this mail Mums photo which gave me a great shock. It looks like a person years older & much saddened by great worry. ‘Tis really a good photo but I cannot get the sad look out of my mind, I only hope the war will end soon that I can get home & try & alter it. Dads photo was just what I expected, practically no difference at all.\n\nWednesday 7th \nFeb.\n\nHad a few cases through otherwise very quiet. Strong wind & bitterly cold all day, managed to write a few letters.\n\nSaturday 10th \nFeb.\n\nA fall of snow & a little rain describes the weather since Wednesday. Events very quiet except for shelling but the 2nd Div. hopped over and\n\ncaptured \"Irles\" with several machine guns & mortars, our casualties being very few.\n\nSunday 11th March\n\nAbsolutely a perfect day, beautiful blue sky, the larks singing gaily & things very quiet, large numbers of our planes policing the line during the day. We had one combat in which 12 planes took part 4 of which were brought down but we could not tell for certain whose planes they were. Went for a ride in the afternoon & had a good outing.\n\nMonday 12th ","64":"\n\nRaining nearly all day & very dull. Rode to \"Becordel\" late in the afternoon to see the Colonel over some promotions I had heard of, as I had at last decided to butt in on my own behalf. Had tea there & rode back in the dark the road being almost deserted the railways now doing most of the haulage. Got back to receive a good mail from Australia. Had a large shell land within 100 yds of our \n\nhut during the night throwing mud & debris on the roof followed by a Dud.\n","65":" ","66":"\n 1917\n\nFine weather all day. Sent in my particulars to the Colonel to see if he would recommend me for a W.O. so now will sit back to see if anything comes of it. I fear there is little hope as there is great competition for promotion in the A.M.C. & previous service counts etc.\n","67":"\n\nHeavy rain during the night & more during the day. Very little doing altho’ some new guns have come along to disturb our peace by shaking the place to pieces. Good news concerning ‘Bagdad’ being taken. We seem to have retrieved our failures there, also news from home that Ian has a son.\n","68":" ","69":"\n March\n\nLast few days very little doing notwithstanding a few ‘hopovers’ in our sector. In only one instance was opposition met & even then it was very little, we move forward now every\n\nday & rumour has it that we already have Bapaume. Most startling news was Russian revolution another illustration of how the people are blinded to real happenings. ‘Tis to be hoped that the dinkum war party are in power. Received orders suddenly today to close down our station & move a couple of miles further ahead a good indication of the advance.\n","70":"\n\nIn a dinkum advance at last. Up early packed the waggons etc. & went about 3 miles out. Everywhere was the spirit of advance in the air. How far Fritz had retreated we did not know but he was still sending shells overhead so knew he was not too far away. Even the balloons moved ahead it being a good sight to see the huge bag being carried along the road, fully inflated, by about 40 men, led by a Lieutenant & followed by the car & telephone etc.\n\nThree of us had walking sticks & did our march forward in great spirits, passing & being passed by transport of every description pack horses & mules all bent on the same mission but no sign of any disorder or bustle. Each little unit or section moving on with a definite plan, we stopped that night at the’ tunnel’ a huge system of dugouts in which we had a station alongside ‘Flers’ & plans were at once laid to open up in ‘Bapaume’ itself, the dream of us all. I was not among the fortunate ones to go, my turn I hope coming tomorrow. We had some cavalry casualties through, Indian & our own, these being the first we had handled & a good sign of our progress. During the afternoon not a shot of any description could be heard absolutely peaceful & we hear that the country the other side of Bapaume is quiet, the roads good, the whole countryside appearing to be untouched by war.\n","71":"\n\nJust biding our time & anxiously awaiting for orders to go ahead & see how Fritz left things & verify all the tales of the lovely country ahead, Bapaume & beyond being a promised land to us. Heavy traffic on every available track ahead which are quickly becoming mere mud tracks. The road gangs will shortly be the most important item in a few days & they are rushing food stuffs ahead in case the roads get blocked. A cool change again.\n","72":"\n\nStill hanging on here & waiting for the order to move up to Bapaume for good. During the day I sent up vital necessities such as dressings & comforts for the sick & wounded & collected an inventory of all stores etc. at our various outposts, everything now being ready to consolidate our part of the programme. We are only hanging on to these posts in case the new evacuating line breaks down a thing quite possible when tis realised it crosses the old trenches which are fearfully cut up.\n","73":"\n\nEverything very quiet the tide of battle having passed us by. Things dead slow as all wounded are being evacuated by another route, we only having a few sick to attend to. ‘Tis very annoying to be left behind in this way out of things but tomorrow I am going for a trip up as far as I can get to have a look at the new country. Managed to get a paper today which told me a little concerning the great retirement but ‘tis evident they do not know yet how far the huns have gone back, truly it must be an extraordinary experience for the people of the various towns to receive the British & French troops after being under the Germans for over two years.\n","74":"\n\nHad several falls of snow during the day although twas not very cold. Took the day off for a tour round the chief object being to see Bapaume. Set off about 9 A.M. & proceeded by the duckboards past\n\n‘Flers’ a ruin & the various posts passing through \"Ligny Thilloy\" also in ruins. Of course most men had moved up but large gangs were employed laying light railways & clearing & repairing the roads, a work which was proceeding at a good speed. It was wonderful how any transport had got over the huns front line as it was ploughed up into a powder, still it was done altho’ one could see where various mules & horses had been bogged & shot. At times the limbers almost disappear from sight into shell holes but with teams of 6 horses on the light vehicles & more on the heavy they are rushed through. We passed one huge \nshell\n mine crater about 60 ft. deep & 3 times as wide on the side of the Bapaume road. The road passing through \"Ligny Thilloy\" was obstructed in two places by mine craters designed to prevent our transport getting through. After passing here the \n\nroad was good to Bapaume & pleasant fields met the eye. Bapaume itself was smashed to pieces. Not one house was intact & the litter & rubbish was indescribable. Many ruins were still burning having been set alight before the enemy left. The church was practically non-existant, likewise the station & all rails & even sleepers had been removed, a very thorough evacuation by the enemy. Gangs of men were employed cleaning up the streets & making some of the ruins possible as billets for the men. Rather an interesting feature was the sight of various signs in German posted at various points and the number of men billeted in the various houses was also to be seen. Determined to see the country further on I went on a further two miles & everywhere Fritz had burned & destroyed even to his dugouts. All the cross roads were\n\nobliterated by huge mine craters to prevent our use of the roads but otherwise the roads were good. The sight of fields lately under cultivation & splendid avenues of trees was a sight worth walking miles to see after our months of experiences of nothing but mud & splintered woods. Was fortunate enough to see a German machine which had just been brought down with a Hun prince in charge, it was one of the latest type, an Albatross-werke. Altogether I did about 16 miles in country just vacated by the enemy & can see plainly that apart from his front line he had a much better time than we did we being forced to live in country destroyed by the fighting while he has fallen back onto pleasant fields & pastures new. So far as I could see he left absolutely nothing of military value behind.\n","75":"\n\nAfter fixing up things for the day at \"The Tunnel\" went down to our old post at Bernafay to see about getting drugs for \"Bapaume\". Fixed that up so filled in the afternoon by going for a ride round \"Contalmaison\" way to see how things were going. All guns had been removed except two 12\" naval they waiting for the railway to be fixed up. Came onto one road where they were taking up the metal etc. for use on roads of more importance further up. Arrived back by dark & was about to turn in when a special messenger came from Bapaume for dressings urgent. This meant I had to turn out 6 men & myself load them with two sandbags full each man & set off about 10 oclock in the dark along the duckboards. As Fritz was well away I took two lamps so that no time would be wasted. Luckily a limber met us\n\na little way out of Bapaume so that we got back by 1 A.M.\n","76":"\n\nDaylight saving comes into force again today the clocks going forward one hour during the night. Spent all day getting stuff away back to \"Bernafay\" in preparation for a removal, very tiring work as difficult to carry stuff in the tunnel. A note just arrived for me to go to Bapaume tomorrow so will shift quarters in the morning.\n","77":"\n\nStarted the lads working on clearing out the place & then went back to \"Bernafay\" to arrange for stuff to be sent to Bapaume. Whilst there took the opportunity to have a hot bath & change of new underclothing. Went back to the tunnel for my blankets & continued on to Bapaume calling at the various posts on the way having tea at \"Lusenhof\" \n\nImage\n\nfarm. Arrived at Bapaume just before dark & bunked for the night in an up storey room, without door or windows & loose boards laid for flooring. Our station takes up the ground floor of 3, 4 & 5 Rue de Republic, part of a terrace smashed to atoms but still giving some semblance of shelter. There is no doubt every effort was made by the enemy to make the town uninhabitable, a systematic blowing up of houses & burning being done & the rubbish in the houses is indescribable. Practically all flooring has been taken up & used & such things as doors & windows skirting boards simply do not exist. By closing up the windows with iron & bagging & covering the floor with miscellaneous boards we managed to make our room habitable although the ceiling is smashed & the rear of the house has fallen out. Heard a heavy explosion a few minutes after turning in but left all enquiries concerning it until the morning\n\nwhen I learnt that the Town Hall had been blown up by a mine. It happened about 10 oclock & the mine was set off in some way unknown with the result that the best building in the whole town was totally destroyed, buring in the ruins about 20 men who were sleeping there. Actually it was a trap the enemy thinking that the heads would pick the best building for headquarters thus giving them a chance to get rid of some of our brains. Immediately a start was made to dig out the victims several being recovered in pieces & I saw five rescued practically unhurt 16 hours later. Some are still missing (48 hours later) the exact figures being difficult to obtain. Early rumours stated 150 men had been entombed, actually it was about 20 odd. The next evening the 7th Brigade Headquarters blew up two being killed & the A.P.M. was saved from a like fate by discovery of a large bomb in his quarters. Which building will go next we do not know but many expect our\n\npresent quarters as although in ruins rank as the best in the place. Traps of a like nature have been discovered in many places so that everyone is now on the look out for such things.\n","78":"\n\nGot to work & fixed up a dispensary, utilising the morgue for the purpose. By nightfall had a very presentable show & had issued several battalions with stuff besides providing solutions for operating etc. Also spent a little time on fixing up my abode & closed up the windows as a very cold wind was blowing through. We now have proper chairs, a table, fireplace & even a bed gradually collecting odds & ends from the ruins & pressing them into use.\n","79":"\n\nA normal day with very little doing in my line, theatre busy however, over 100 coming through during the night, mostly shrapnel cases as our fellows are in the open a lot. Morris turned up to see me but I was away. Had a look at the ruins of the Town Hall & found\n\nthem still digging in the hope of saving the remainder the debris being carted away to fill in the mine craters at the various cross roads. Had a roam over the fields just on dusk in a snow storm & came on some interesting relics of Fritz’s occupation. Gun pits stables, trenches, observation towers etc. Saw motor lorries taking up what sleepers Fritz had left behind they being pressed into immediate service for our own lines, now pushing up with great despatch.\n","80":"\n\nWeather wet & dreary making everything miserable & muddy. Not much doing in my line. Latest theory of town hall blowing up is, that the mine was worked by an 8 day clock, the explosion taking place exactly eight days after our occupation. All houses now being systematically examined for bombs & mines. Our terrace now beginning to look much better, having cleared up most of the debris in the rooms, front\n\ngarden etc. the rain manages to find its way into all rooms however.\n","81":"\n\nVery cold & wet, steady work during the day & very few casualties. Rumours of our going out getting stronger daily especially as Canadians have again appeared on the scene. I have yet to learn that they have done as much as the Australians in this war.\n","82":"\n\nMud & yet more mud, the road gangs not yet showing up in the town. Went to see the local cemetary rather a fine one & must contain over a 1000 Germans. The men are buried in one section, well laid out, graves nicely kept & surrounding a French memorial built to commemorate the Franco-Prussian War. What Irony!!! The officers had a section to themselves & most had good headstones. One very prominent grave was that of a German\n\nofficer & was surmounted by a splendid monument plain but good with the iron cross engraved, indeed several had the iron cross judging by the number of graves so marked. Very little damage had been done a few graves only having been disturbed by shells, a few bones & skulls being unearthed. Two French deputies who had been killed in the Town Hall were buried during the afternoon, a firing party of 200 Australians being provided & they both looked & acted well looking well in comparison to the French soldiers present our lads certainly take a lot of beating as soldiers. At night orders came through that all buildings had to be evacuated owing to mines & that all men should live out in tents etc. for a period of 25 days. We could not see ourselves sleeping in the open so carried on as before. If they want us to sleep outside they\n\nwill have to provide tents & that is how the matter stands so far as I am concerned. The matter is serious however as more mines have gone off & a tunnel has been discovered running under our building which has many suspicious characteristics. It must have been a great funk hole of the hun as it contains about 100 beds the tunnel itself probably dating back hundreds of years. A roadway blew up today well behind our lines the reason being unknown, perhaps ‘twas a mine which failed to go off before or else definitely timed to go off when it did.\n","83":"\n\nHad a busy day supplying battalions with supplies very few wounded coming through so otherwise a quiet day. Managed to get a few letters off at night a difficult job as have had no mail for several weeks much to my sorrow.\n","84":"\n\nWent by car to \"Albert\" for drugs etc. altogether a very interesting trip. The road was in very good order considering that it contained several mine craters & the trenches crossed it only a week or so ago. Traffic heavy so the going was slow most of the way. Saw \"Le Sars\" for the first time a very interesting sight as ‘tis now merely a heap of matchwood. All bricks etc. have been used up leaving the broken beams etc. \"Pozieres\" has disappeared altogether. Saw no less than nine tanks on the way down all knocked rotten which makes the number about 20 that I know off. Seeing so many smashed up makes one curious to know if they were really successful. Also saw the remains of 4 of our planes which had been brought down. Albert was looking better several people having returned to it now that it is out of range. Passed a lot of cavalry\n\ngoing up both British & Indian quite a number of Indians appearing on the scene lately. ‘Tis good to see the progress made with the railways watermains etc., shows good organisation. A hop-over expected in the morning & we have ten extra cars in expectation of casualties, poor beggars!\n","85":"\n\nVery cold again. Fritz shelled Bapaume today for the first time several places being knocked & he also put a few over on to the roads. Very strong wind blowing which dislodged bricks etc. & caused several walls to collapse one tall one we had to pull down for safety. Towards evening had a heavy fall of snow a very pretty sight. 55th, 56th Battalions had a hop-over today & took two villages the stunt developing into a bigger thing to aid the French lower down. Losses fairly heavy & taxed my supplies as I had no warning of it. Had about 70 killed and\n\n350 wounded through so far rather severe although results were good. I believe Bombs dropped during the night caused little damage. Saw several prisoners come through but have not learnt the full parties of the affair yet.\n","86":"\n\nBapaume shelled the last two days for the first time pointing to Fritz having fixed up some heavy guns at last, many have been duds but a few places nearby have been demolished & we have had casualties in from them. Had several falls of snow which however soon disappeared. Had a visit from a very enterprising Fritz airmen, 3 balloons of ours being destroyed in 2 days. Two of the three were destroyed at once about 5.30 in the afternoon & \naltogether\n altho’ the airman was very low down & our archies peppered him, to some order he managed to get clear away his bravery thus being rewarded. Large number of\n\nheavy guns going forward of all descriptions the tractors etc. passing this place at all hours in fact great activity is being shewn in the transport line a very good sign indeed & we hear daily of batteries being moved higher up. Sitting in this room of mine at night I can easily imagine myself back in London when I hear the motors pass, it sounds for all the world like the London busses & taxis passing, the tooting etc. bringing thoughts of London to me everytime I hear it. Expect to move out any day now as the relief has arrived. I am quite ready as I handed over two days ago to the 15th. I believe the","87":" Field will be taking our place which is not quite so healthy since the shells started to come. Much distressed at the lack of mail, delayed no doubt by recent events it will be quite 3 months old by the time we get it now. Malish! Am now reading S. Pepys diary & enjoy it well\n\nknowing sufficient of London to follow it intelligently & have come on parts which recall places seen during my trip to England in addition I enjoy reading anything historical.\n","88":"\n\nReceived orders today to pack up to move next morning. Weather very fine in great contrast to the snow etc. we have had the last few days. \nI\n Had a few shells land near us today the closest however turning out to be a dud. Will have to ride again tomorrow as I ran a nail in to my foot again, this time in the heel. Heard that some of our heavy guns were knocked out by getting up too far. Great activity on the road motors passing all night long besides guns of all descriptions.\n","89":"\n\nMarched out of Bapaume today for \"Aveluy\" a mile out of \"Albert\" & took over a scabies hospital from the 1st Field\n\nAmb. this evidently going to be our rest. ‘Twas good to see our old friends again. The Albert Bapaume road was a great sight. The road itself was in a good state & had thousands of men working on it, laying metal widening etc., it being the main road in the place. Saw large numbers of Indians coming in mostly cavalry who appeared to be a workmanlike crowd & new artillery also on the march. Had several taubes over during the morning but they kept very high. Rode on the waggon down as I had hurt my foot on a nail. Received the long looked for mail today.\n","90":"\n\nDiscovered today that yesterday was \"Good Friday\". I had totally forgotten Easter but will try & go to church tomorrow if I can locate a service. Have been\n\nput in charge of the baths where all patients are washed as part of their treatment for scabies. Had a very busy day as we were late in getting a start on but tomorrow will be better. Weather on the mend. Had a congratulatory message from The Army Commander read out to us for our divisions fine work in the advance. The divisions mentioned were the 7th & the 4th & 5th Australian divisions, certainly they did do good work & at the end of a gruelling time in the line too.\n","91":"\n\nHad a very busy day & could not get away to church altho’ we had a service in the camp. Managed to get the day through with great success making my own system which will be further enlarged tomorrow. A beautiful day it being too warm to work in a tunic a vast change & almost unbelieveable.\n","92":"\n\nCold wet & dreary day with a little snow. Had to work a new staff as a section was sent away this morning & the old one belonged to it, however managed to get a good day in. Had a huge naval gun firing nearby the report sounding like a mine going off & the huns attempted to shell ‘Albert’ without success the shells falling short. As I end this book things are very bright for us, the Germans retiring to new positions thus acknowledging our power. The retreat is a masterly one as expected of the enemy but cannot prevent us from running a victorious offensive later, one advance moving forward at a fast pace without any disorganisation whatever a tribute to our leaders, & we have been able to bring a force to bear on the enemy that he has not been able to reply to, most noticeable in regard to gunnery. With every hope of peace before I end my next diary I now close this one at \"Aveluy\" a suburb of \"Albert\" Somme France.\n\n"}}