{"Document Name":{"0":"Diary_0356","1":"Diary_0356","2":"Diary_0356","3":"Diary_0356","4":"Diary_0356","5":"Diary_0356","6":"Diary_0356","7":"Diary_0356","8":"Diary_0356","9":"Diary_0356","10":"Diary_0356","11":"Diary_0356","12":"Diary_0356","13":"Diary_0356","14":"Diary_0356","15":"Diary_0356","16":"Diary_0356","17":"Diary_0356","18":"Diary_0356","19":"Diary_0356","20":"Diary_0356","21":"Diary_0356","22":"Diary_0356","23":"Diary_0356","24":"Diary_0356","25":"Diary_0356","26":"Diary_0356","27":"Diary_0356","28":"Diary_0356","29":"Diary_0356","30":"Diary_0356","31":"Diary_0356","32":"Diary_0356","33":"Diary_0356","34":"Diary_0356","35":"Diary_0356","36":"Diary_0356","37":"Diary_0356","38":"Diary_0356","39":"Diary_0356","40":"Diary_0356","41":"Diary_0356","42":"Diary_0356","43":"Diary_0356","44":"Diary_0356","45":"Diary_0356","46":"Diary_0356","47":"Diary_0356","48":"Diary_0356","49":"Diary_0356","50":"Diary_0356","51":"Diary_0356","52":"Diary_0356","53":"Diary_0356","54":"Diary_0356","55":"Diary_0356","56":"Diary_0356","57":"Diary_0356","58":"Diary_0356","59":"Diary_0356","60":"Diary_0356","61":"Diary_0356","62":"Diary_0356","63":"Diary_0356","64":"Diary_0356","65":"Diary_0356","66":"Diary_0356","67":"Diary_0356","68":"Diary_0356","69":"Diary_0356","70":"Diary_0356","71":"Diary_0356","72":"Diary_0356","73":"Diary_0356","74":"Diary_0356","75":"Diary_0356","76":"Diary_0356","77":"Diary_0356","78":"Diary_0356","79":"Diary_0356","80":"Diary_0356","81":"Diary_0356","82":"Diary_0356","83":"Diary_0356","84":"Diary_0356","85":"Diary_0356","86":"Diary_0356","87":"Diary_0356","88":"Diary_0356","89":"Diary_0356","90":"Diary_0356","91":"Diary_0356","92":"Diary_0356","93":"Diary_0356","94":"Diary_0356","95":"Diary_0356","96":"Diary_0356","97":"Diary_0356","98":"Diary_0356","99":"Diary_0356","100":"Diary_0356","101":"Diary_0356","102":"Diary_0356","103":"Diary_0356","104":"Diary_0356","105":"Diary_0356","106":"Diary_0356","107":"Diary_0356","108":"Diary_0356","109":"Diary_0356","110":"Diary_0356","111":"Diary_0356","112":"Diary_0356","113":"Diary_0356","114":"Diary_0356","115":"Diary_0356","116":"Diary_0356","117":"Diary_0356","118":"Diary_0356","119":"Diary_0356","120":"Diary_0356","121":"Diary_0356","122":"Diary_0356","123":"Diary_0356","124":"Diary_0356","125":"Diary_0356","126":"Diary_0356","127":"Diary_0356","128":"Diary_0356","129":"Diary_0356","130":"Diary_0356","131":"Diary_0356","132":"Diary_0356","133":"Diary_0356","134":"Diary_0356","135":"Diary_0356","136":"Diary_0356","137":"Diary_0356","138":"Diary_0356","139":"Diary_0356","140":"Diary_0356","141":"Diary_0356","142":"Diary_0356","143":"Diary_0356","144":"Diary_0356","145":"Diary_0356","146":"Diary_0356","147":"Diary_0356","148":"Diary_0356","149":"Diary_0356","150":"Diary_0356","151":"Diary_0356","152":"Diary_0356","153":"Diary_0356","154":"Diary_0356","155":"Diary_0356","156":"Diary_0356","157":"Diary_0356","158":"Diary_0356","159":"Diary_0356","160":"Diary_0356","161":"Diary_0356","162":"Diary_0356","163":"Diary_0356","164":"Diary_0356","165":"Diary_0356","166":"Diary_0356","167":"Diary_0356","168":"Diary_0356","169":"Diary_0356","170":"Diary_0356","171":"Diary_0356","172":"Diary_0356","173":"Diary_0356","174":"Diary_0356","175":"Diary_0356","176":"Diary_0356","177":"Diary_0356","178":"Diary_0356","179":"Diary_0356","180":"Diary_0356","181":"Diary_0356","182":"Diary_0356","183":"Diary_0356","184":"Diary_0356","185":"Diary_0356","186":"Diary_0356","187":"Diary_0356","188":"Diary_0356","189":"Diary_0356","190":"Diary_0356","191":"Diary_0356","192":"Diary_0356","193":"Diary_0356","194":"Diary_0356","195":"Diary_0356","196":"Diary_0356","197":"Diary_0356","198":"Diary_0356","199":"Diary_0356","200":"Diary_0356","201":"Diary_0356","202":"Diary_0356","203":"Diary_0356","204":"Diary_0356"},"Date":{"0":"unknown","1":930.0,"2":934.0,"3":937.0,"4":938.0,"5":993.0,"6":1010.0,"7":1015.0,"8":1027.0,"9":1028.0,"10":1029.0,"11":1030.0,"12":1031.0,"13":1032.0,"14":1033.0,"15":1034.0,"16":1035.0,"17":1039.0,"18":1043.0,"19":1044.0,"20":1047.0,"21":1048.0,"22":1049.0,"23":1050.0,"24":1051.0,"25":1052.0,"26":1053.0,"27":1054.0,"28":1055.0,"29":1056.0,"30":1057.0,"31":1058.0,"32":1060.0,"33":1061.0,"34":1062.0,"35":1063.0,"36":1064.0,"37":1065.0,"38":1066.0,"39":1067.0,"40":1068.0,"41":1069.0,"42":1070.0,"43":1071.0,"44":1072.0,"45":1073.0,"46":1074.0,"47":1075.0,"48":1076.0,"49":1077.0,"50":1079.0,"51":1080.0,"52":1081.0,"53":1083.0,"54":1087.0,"55":1089.0,"56":1091.0,"57":1092.0,"58":1093.0,"59":1094.0,"60":1095.0,"61":1096.0,"62":1100.0,"63":1101.0,"64":1102.0,"65":1103.0,"66":1109.0,"67":1113.0,"68":1115.0,"69":1116.0,"70":1117.0,"71":1120.0,"72":1121.0,"73":1126.0,"74":1127.0,"75":1129.0,"76":1130.0,"77":1132.0,"78":1134.0,"79":1136.0,"80":1137.0,"81":1141.0,"82":1142.0,"83":1144.0,"84":1145.0,"85":1147.0,"86":1152.0,"87":1153.0,"88":1154.0,"89":1155.0,"90":1157.0,"91":1158.0,"92":1159.0,"93":1160.0,"94":1161.0,"95":1162.0,"96":1163.0,"97":1164.0,"98":1165.0,"99":1166.0,"100":1167.0,"101":1168.0,"102":1169.0,"103":1170.0,"104":1171.0,"105":1172.0,"106":1180.0,"107":1181.0,"108":1182.0,"109":1187.0,"110":1188.0,"111":1193.0,"112":1198.0,"113":1200.0,"114":1203.0,"115":1204.0,"116":1205.0,"117":1209.0,"118":1210.0,"119":1211.0,"120":1216.0,"121":1217.0,"122":1218.0,"123":1219.0,"124":1220.0,"125":1221.0,"126":1223.0,"127":1224.0,"128":1225.0,"129":1251.0,"130":1252.0,"131":1254.0,"132":1255.0,"133":1261.0,"134":1262.0,"135":1263.0,"136":1264.0,"137":1265.0,"138":1266.0,"139":1267.0,"140":1274.0,"141":1277.0,"142":1278.0,"143":1283.0,"144":1284.0,"145":1295.0,"146":1301.0,"147":1303.0,"148":1304.0,"149":1305.0,"150":1311.0,"151":1318.0,"152":1319.0,"153":1324.0,"154":1325.0,"155":1335.0,"156":1338.0,"157":1381.0,"158":1382.0,"159":1383.0,"160":1384.0,"161":1387.0,"162":1389.0,"163":1390.0,"164":1391.0,"165":1394.0,"166":1401.0,"167":1402.0,"168":1407.0,"169":1410.0,"170":1412.0,"171":1417.0,"172":1419.0,"173":1426.0,"174":1444.0,"175":1445.0,"176":1458.0,"177":1460.0,"178":1463.0,"179":1472.0,"180":1487.0,"181":1488.0,"182":1492.0,"183":1504.0,"184":1505.0,"185":1510.0,"186":1511.0,"187":1522.0,"188":1539.0,"189":1540.0,"190":1541.0,"191":1565.0,"192":1580.0,"193":1581.0,"194":1582.0,"195":1587.0,"196":1588.0,"197":1592.0,"198":1595.0,"199":1596.0,"200":1597.0,"201":1598.0,"202":1601.0,"203":1609.0,"204":1610.0},"Entry":{"0":"\n\nOn ","1":" I fancied that I would very much like a trip to the War which had been then raging about 2 years.\n\nI enlisted at the Victoria Barracks Paddington & was granted four days in which to do all that had to be done before I went to Camp. I had not many things to arrange so it left me free to enjoy the last few days of civilian life at my disposal before I became a Soldier & donned the khaki. It turned out that these four days were to be my last days of freedom for almost three years.\n\nOn the","2":" day of July I joined the Australian Expeditionary force Camp at the Sydney show Ground & stopped there till the","3":" I was inoculated against fever while I was there & was also Vaccinated against Smallpox as well. We were all given three blankets & a waterproof sheet to sleep with, My quarters was the building used for the Draft Horse Exibits.\n\nI was sworn in here as well.\n\nOn the","4":" day I left the Show Ground Camp for Dubbo where I entered camp again.\n\nIn Dubbo camp I went through all sorts of drill and exersize. A few weeks after I arrived at Dubbo I was attached to the Army Service Corps that was there. The officer in charge of the Corps was at Liverpool Camp when I was there as a driver in the Corps and on my arrival at Dubbo he recognised me & got me attached to his staff. He and a couple of rather frisky horses & he needed my assistance in driving & managing them for him. I had rather a lot of trouble in getting away from him when the time came for me to move. \n\nEventually I got clear & came down from Dubbo Camp on the","5":" and joined the Camp at Kiama, on the South Coast line.\n\nAt Kiama Camp I went through the final course of training.\n\nKiama Camp was situated at the Show ground & adjoined the sea. It was a very nice camp, well laid out & kept in good condition & also kept very\n\nclean. There was a lot of nice scenery to be seen at a few minutes walk off the camp. The Kiama Blow hole was the main attraction, The Kiama Lighthouse which throws a green light to sea is situated on the headland on the North side of the Camp. \n\nOn the afternoon of the","6":" I was granted Final-Leave till the night of the","7":" I spent my leave mostly at home. When I returned to Camp I was not granted anymore leave till the night of the","8":" when I was allowed a few hours off.\n\nOn October the","9":" I left Kiama Camp for Sydney. I had previously been allotted to the","10":" Reinforcements of the 13th Battallion while at Kiama. Well I arrived in Sydney in due course & we were all quartered at the Show Grounds for the night, I was allowed a few hours leave to say Good-Bye to everyone at home.\n\nAt about 5 am the 21st Reinforcements left the Show ground & were marched through the city to Dalgetys Wharf at Millers Point where we embarked on the S.S.Ceramic belonging to the White Star Company.\n\nAll my family came to see me off with the exception of Dad & Alma. Dad had a carbuncle on the back of his neck & Alma stayed home with him. When I left Dad did not seem to be very bad, but later on the carbuncle got more serious and ultimately it led to his death on \n\nOctober the 30th 1916\n\nEtta Lewin & Sisters also came to see me off, Miss Lily Finigan & a few of the Old Army Service Boys came as well. Prior to my Embarkation I was presented with a Silver Cigarette case & a Gillete Safety razor by the Boys at the Army Service Corps at Darlinghurst of which I had been a member prior to my enlistment.\n\nDad presented me with a wristlet watch & Etta gave me a pocket wallet. I received other presents from several different People.\n\nThe route of the March from the Show Ground to the Ship was thus – From the Show Ground through Flinders & Oxford St. Darlinghurst thence through Colledge & Phillip Street to Circular Quay, along the Quay & George St North & through\n\nArgyle-Cut to the wharf.\n\nI embarked at about 6 am on the morning of the","11":" of October, Besides my Reinforcement there were Reinforcements for the following Battallions & Corps – 1st. 2nd. 3rd.","12":" 17th.","13":" 19th. 20th. 30th. 45th. 46th. 52nd. 53rd. 55th. – and 56th. Battallions One Reinforcement of the Cycling Corps, A full Corps of Engineers and Army Medical Corps. \n\nAltogether there was about 3,500 men on board. The Ceramic is the largest boat that has entered Sydney harbour up to the present date, She has about 16,000 tons displacement. \n\nAt 8 am everybody was on board & everything was ready so we pulled out from the wharf & anchored out in the stream till 4.40 pm, when we weighed anchor and passed out through the heads at 5pm. The Pilot steamer Captain-Cook followed us out to receive the Pilot when we were clear of the\n\nheads. All the rest of the day land was in sight on the Starboard side, Late at night we passed Kiama Lighthouse & Jervis Bay Light was to be seen later on. At 9.15 pm all lights on the ship had to be extinguished.\n\nSunday morning the","14":" found us well out at sea off the New South Wales coast. Toward evening a slight storm broke over the ship but it did not last long. During the night we passed through Bass-Strait.\n\nWe kept good weather until the","15":" when we entered the Great Australian bight and ran right into a heavy storm, the waves were breaking right over the forward deck & made everything very wet & miserable, Toward nightfall the storm increased its fury & up to the time I went to bed the wind had been screeming through the rigging & the rain had fallen very heavy.\n\nOn the following day the wind & sea had subsided somewhat & travelling was much more comfortable. During the day every man on board had to parade for boat drill with Lifebelts on.\n\nIt is the custom at sea to have Boat Drill every now & again, so that in case of any accident at sea everybody will know exactly what to do & do it quietly so as not to cause a panic.\n\nAt 8 oclock at night I went to see the concert that had been arranged by the men on board . It was very good indeed.\n\nOn","16":" We left the Great Australian Bight & shortly afterwards sighted the southern Coast of Western Australia on the Starboard Side, At 5 oclock pm we lost sight of the coast line again, Just before reaching Cape Lewis we turned off from the land & are now travelling almost due West across the Indian Ocean toward South Africa. Porpoises & Whales were quite close to the boat.\n\nThe weather continued to be nice & fine & travelling was very comfortable until the night of the","17":" when it came over very cloudy & rain fell in torrents flooding the decks & making everything very miserable generally.\n\nThe following day showed a clean ship and all trace of rain gone, Phisical drill parades were\n\nheld as usual in the morning & in the afternoon the ships sports were started such as boxing tug-o-war, etc-etc, & were continued until the afternoon of the","18":" when they were stopped owing to heavy rain.\n\nI attended Church Parade","19":" & for the rest of the day I wrote letters home and am going to post them at Durban S.Africa when we arrive.\n\nOn the night of the","20":" we ran right into a severe thunderstorm, The rain pored down for two hours & the lightening was very bright. The following day","21":" we anchored outside Durban harbour S.Africa at 3 am in the morning. At daylight when I came on deck I was very surprised to see that we were at anchor. The first glimpse of land after not seeing it for about a week was very pleasing indeed.\n\nAt about 7.30am we weighed anchor & proceeded in through the heads & we soon moored at the wharf. The Newzealand troopship S.S.Devon N.Z.64 passed by as we were entering harbour, she had a large crowd of men on board & was bound for the same destination as myself Vis – Plymouth England\n\nAt 10 o`clock we were all taken ashore for a route march. We marched through the town to the Ocean beach where we rested till 2.30 pm, we were then dismissed & allowed to go anywhere we wished about the city.\n\nI had a good look round the city & was much struck by the clenliness of the place. The buildings are not so large as they are in Sydney with the exception of one or two. The city is well laid out & the streets are fairly wide. The electric tram service is not so bad, The cars look very funny to me, they are all of the double deck variety. All trams & Trains are free for soldiers & sailors to travel.\n\nI visited the Durban Zoo & one or two other places. The Zoo is not so large as Sydney`s but it is much nicer & prettier. I think that Durban can beat anyplace in Australia for pretty flowers, everywhere you look it is nothing but a mass of different colored flowers. At 10 pm at night I left the city & took train back to the ship. I was well tucked into the blankets at 11.30pm.\n\nAt 10 o`clock to-day","22":" we were marched through the town again & were dismissed at the Town Hall at 2.30pn. I went to a few places of interest such as Toll gate, Overport, Musgrave Road & the botanical Gardens. The scenery at these places was very pretty especially the Gardens.\n\nThe tram ride from the city is about the finest ride for scenery in Durban, It leaves the Town hall & goes via Musgrave road hill, from the top of the hill one can get a fine view of the city which is laid out in blocks & looks very nice. In the Aristocratic part of the town the streets are called avenues & go by number the same as they do in America, vis – 1st avenue or upper or lower 54th avenue & so on.\n\nAnother mode of travelling used a good deal in the city by the European population is the Rickshaw which is drawn about by the Zulu natives. It is a very comfortable & cheap mode of travelling. The Zulus have some very queer head-dresses such as different colored feathers & large horns of the native cattle, They seem to go\n\nout of their way to make themselves look as ugly & repulsive as it is possible. Red, yellow & white paint is also smeered over their bodies. The Zulus are I am sure absolutely the finest race of men Phisically in the whole world. At 10 pm at night I Made my way back to the ship after writing & posting a few letters home.\n\nThe following morning","23":" saw the Coaling operations which were being done for the last two days finished. At 9.30 am we were taken ashore for another route march but were not allowed any leave, returning to ship at 2.0 oclock pm. At 4 o`clock we left the wharf & steamed out of the harbour & were well on our way by nightfall. \n\nThe people of Durban gave us a very good send off.\n","24":" I attended church at 10 in the morning. During the day we passed by Cape Elizabeth & Lighthouse, This is the last place where the S.S.Waratah was seen before she so completely disappeared a few years ago. For the most part of the day we kept land well in sight.\n\nIn the afternoon of the","25":" we passed Cape Agulhas the most southerly point of Africa quite close inshore. At about 6pm we rounded the Cape of Good Hope & anchored at the entrance to Table bay at about 10 oclock pm. Sharks , Penguins, Flying fish, porpoises & seals were around the boat in large numbers. The land that was visible during the day was thickly covered with vegitation & the heat coming off shore was excessively hot.\n","26":" At daybreak we weighed anchor and entered harbour at 7 o`clock . We moored at the wharf shortly after. The troopship Suffolk was in harbour when we arrived, she had a good many Australia troops on board.\n\nCoaling operations were once more started as soon as the ship was made fast. The natives do this kind of work, altogether there was about 100 niggers employed coaling this ship, They are very amusing to watch at work, They are always on the trot they never seem to walk & all the while they are working they chant some sort of native song, Its like bedlam when they are all at it.\n\nLeave to the city was granted at 1pm. We did not get such a good welcome here as we did at Durban, The Boor population are in the majority here & they are a very sullen & surly lot. \n\nI visited Government House & Grounds, The Gardens & fernery & also the Pier & Promenade. From the tip of the tower at the end of the Pier you can get a very good view of the City, Mountain & Bay. The city is built in the shadow of the Table mountain which rears itself upwards to a height of from 800 to 1,000 ft above sea level , At times the top portion of the Mountain which is flat like a table is covered with white mists which give it an appearance of a huge table covered with a white cloth, I was fortunate enough to see it when it was at its best, It was very pretty\n\nThe Harbour which is named Table Bay derives its name from the table mountain also. There is another mountain close to the table mountain which is called the “Lion`s head\". It has a wonderful resemblance to the head of a sleeping line & is very pretty.\n\nCape town is not a patch on Durban for Clenliness or civility, The native & Boor quarter of the town is not very safe for Europeans after dark. I returned to the ship at 10 o`clock pm.\n\nThe following day","27":" I went for a route march for about 3 hours, we marched all round the town & then returned to the ship. At 3 pm we left Cape-Town. We passed by Robin Island about 2 hours later. Robin Island is where the Birkenhead was lost while bringing Soldiers & their wives from England to Africa, the ship was lost in a fog & in bad weather.\n\nThe ship Rangatira was lost on the rocks just off Robin Island about 2 years ago, The funnel & masts are just visible above the water. The S.S.Rangatira was owned by the New-Zealand Steam Ship Company.\n\nWe left Robin Island Lighthouse behind at 6 pm. but kept land in sight for the remainder of the day. During our sty in Cape Town a small naval gun was mounted on the\n\nafter turret of the ship. It fires a 12 pound shell & is for protection against Enemy Submarines, there is two sailors from H.M.S. Kent to use & look after it on board. We are now getting into what is termed the infected area and every precaution is taken against any surprise enemy submarine attacks. At night all lamps are covered between decks & on deck no light whatever is allowed on any pretext. Smoking after dusk is not allowed. Durban & Cape Town is I think about 8 to 10 hours behind Sydney time. \n\nOn","28":" We left the land behind on the Starboard side, the weather is nice & sunny & the sea is very smooth. We are now in the South atlantic Ocean & are steaming in a North-westerly direction with Africa on the Starboard.\n\nTo-day November the","29":" fresh instructions as regards letter writing have been issued \n& rules are these &\n the following matter is not allowed to be inserted. – Names & Places of despatch. Names & numbers of the ships escorting us. Number and disposition of troops.\n\nRoute & ports of call. \n\nReference to larger units & Commanders. Ships met enroute. The reason of all this is so that if the letters were in any way to fall into the hands of the enemy he would not get any information from them that would be detrimental to the safety of our troops. It also make it almost impossible to give any news in the letters that we do write. All letters have to pass the Censor before going ashore\n\nOn","30":" the sailors in charge of the gun had a little firing practice, the target was a barrel floating in the water about ½ a mile astern. They did not succeed in hitting it, the sea was too rough.\n","31":"\n\nInstructions are again given out that no lights whatever are to be lit on the ship after sundown & that lifebelts are to always be worn until notice is given to the contrary & also at night men are to sleep with the lifebelts very close handy.\n","32":" finds me searching for a cool spot to sit & read in. The weather is boiling hot & canvas is spread above the decks to protect us from the heat of the sun, even under the awnings the heat makes the tar bubble out from between the planks of the decks.\n\nWe are getting very near the Equator now & should cross over in a day or two, Flying Fish are about in shoals to-day, Some of these fish can fly for a distance of about 200 yards, They do not move the two large fins that act as wings but get all their propelling force by dipping their tail into the water every now & again & swishing it backwards & forwards. Their large fins are used to steady the body & enable them to glide through the air like miniature aeroplanes.\n\nTo-day","33":" I am detailed to fatige duty, My job is holystoning the decks.\n\nTo-night I noticed that the southern Cross is very low down on the horizon in the South another day or two & it will not be visible at all. The cruiser Kent is escorting us & she is\n\nabout forty miles ahead, at night time we can see her searchlights quite plainly but at day light there is no sign of her.\n\nWe crossed over the equator at night & are now in the Northern Hemisphere.\n\nThursday November the","34":" saw us in the Northern Hemisphere & it also saw a good deal of fun onboard. All men who had not been over the Equator before, were as usual Baptised by dipping them in water or having the Salt water hose turned on them, Officers were treated just the same as the men I got ducked myself.\n\nThis morning the breakfast that was put before us was not fit to eat so we held a Mock Funeral with it. We marched around the deck with the Breakfast in a dish dragged along the deck with a piece of string, when we came opposite the Officer Mess the Burial service was read over it & afterwards the Breakfast was tipped into the sea. The Buglars blew the “Last Post\" as it sank out of sight, Then we all sang\n\nthe song entitled “Poor Old Jeff has gone to rest,\" & also another (Song Parody) as follows :-\n\nOnly one more marching order.\n\nOnly one more church Parade.\n\nOnly one more Kit inspection\n\nAnd of that we`re not afraid.\n\nWhen this cruel War is over \n\nOh! How happy I shall be.\n\nWhen I get my Civil clothes on.\n\nOh! No more soldering for me.\n\nAfterwards we flew the Union Jack at half-mast but were made take it down as flags are not allowed on troopships at sea.\n\nWe had a little more Lifebelt & Boat Drill to-day\n","35":"\n\nReceived Wireless news that the R.M.S. Arabic was torpedoed in the Mediterranean Sea on November 6th at Noon. Kit inspection to-day again.\n\nTo-day has been a very hot day & the sea has been like a sheet of glass not even a ripple to disturb the surface, The wake of the ship is visible for about\n\neight miles astern. The wake of the Cruiser Kent is plainly seen we are following a course parallel to it. The cruiser is not visible to the naked eye, but it is no doubt keeping in touch with us by wireless. Flying Fish & Dolphins have been about in large numbers again to-day, The amusement that we get from watching these Fish & the little drill we have is the only things that break the monotony of the voyage which is fast getting unbearable.\n","36":"\n\n5 am in the morning is to be the time to rise in future, the reason being that in case we are sighted by a submarine & torpedoed there will be loss of life. Daybreak is considered the best time for a Submarine to attack because we would be more likely to be off our guard than any other time of the night or day, So therefore we get up in the darkness & wait on deck till it breaks day.\n\nThis morning one man fell overboard from the Promenade deck a distance of about \n\n20 feet to the water, Soon after he fell two lifebouys were thrown over to him. These bouys have a small tin cylinder attached by means of a strong cord when the bouy strikes the water the cylinders immediately take fire when the contents come in contact with the salt water & burn with a very bright light. If it is at night or is dark when they are used the person in the water can see them easily & can do his best to reach them, When the boats are lowered the first place they make for is these light bouys to see if the person they are seeking is clinging to them, They also serve to - mark the spot where the accident occurred, without these lights there would be very little hope of seeing or finding anything in the darkness.\n\nThe crew of the ship lowered two boats to look for the missing man but could find no trace of him at all, he was not at either of the bouys so they rowed about to try to locate him. By this time it had got almost daylight & just as they were\n\non the point of giving the search up he was seen swimming toward the ship a few hundred yards away. When the Officer on the Bridge saw him he blew the Siren to draw the attention of the small boats & let them know that we had seen him, When he swam alongside the ship we threw a lifebelt over to him to hang on to till the boats arrived to pick him up. He was a little over an hour in the water altogether, he was a very lucky man to get back alive the sea was just like a sheet of glass & that no doubt saved his life.\n\nThe sailors got the Boats back on board & we were on our way again at 6.30 am having spent 1½ hours in looking for him. \n\nIt turned out later that just before he jumped overboard he had said good-bye to his friends telling them that he had had enough of it, He was an old soldier from Gallipoli having been wounded in the head which it is said effects his reason at times. He was also a Religious Maniac. He is at present\n\nin hospital under observation.\n\nWe passed a 3 masted Barque soon after we had started, She was making straight for the seat of the accident, Those on board her would most likely see the lighted bouys that we left behind in the water. We are drawing near to the trade Route now steamers & sailing vessels have been seen often during the day. Another lifebelt & Boat Drill Parade again to-day.\n","37":"\n\nTo-day I was put on guard over the Water tap & Sergeants Mess Cookhouse.\n\nNov.13th Monday\n\nThis morning I finished my turn of Guard at 9am Last night at about 4am we passed a small Island & it appeared to be very thickly wooded & very fertile. A remarkable thing about this guard was that 13 men of the","38":" Battallion were on it & that it was also the 13th of the month. If the number 13 is an unlucky number it looks as if we were in for a good share of bad luck.\n\nAt 12 noon the Cape Verde Island group came in sight. The Islands lie to the Westward off cape Verde which is on the most Westerly coast of Africa. The Islands are Portugese possessions, Eight Islands compose the group of which St. Vincent island is the largest, St Vincent island in appearance from a distance resembles Cape town a good deal. There is a table top mountain at the back of the town as in Capetown.\n\nThe town itself is extremely small the only port in the island is a small bay around the shores of which the town is built. The cliffs around the remainder of the coast rise sheer out of the water to an enormous height.\n\nWhen we arrived in the Bay & dropped anchor we were besieged by small boats full of natives who, when you threw a coin into the water, would dive & get it, even little children about the age of 5 or 6 years were diving as well. Sometimes 7 & 8 natives of all sizes & ages\n\nwould dive for the same coin & scramble under the water for its possession , some would stay under water for a very long time.\n\nThe European population of the island is mostly portugese, How they all get a living I cannot say, the island on what I can see of it from the ship seems to be a very barren place & absolutely free from vegetation.\n\nOne battleship of which I do not know the name & H.M.Auxiliary Cruiser Ophir are in harbour here. The Cruiser Ophir was at one time the King’s yacht, but since the outbreak of war she has been turned into an Auxiliary cruiser. She carries 8 guns, 2 on each side, 2 fore & 2 aft.\n\nWe weighed anchor & left again at 6.0 o`clock after a brief stay of 4 hours. I could not go ashore as no leave was granted. The reason for stopping here was to take a Sailor from the Cruiser - Ophir on board, He is being invalided home to England suffering from some sickness or disease.\n\nOn the","39":" we passed a suspicious looking craft on our Starboard side.\n\nOn the 15th at night we passed the Canary Islands. We are well in the danger Zone now & the ship is steaming at full speed.\n","40":" finds the ship still travelling fast. One man of the 3rd Battallion reinforcement who died was buried at sea to-day. This is the first death that has occurred on board and of 3.000 odd men.\n\nHe was sewn in canvas weighted with some heavy material. I could not get close enough to see the actual burial. The Funeral took place at the after end of the ship. The Burial service was read & the body consigned to the sea. The Buglars blew the last post & the Firing party presented their arms.\n","41":" the","42":" sees us out of the tropical calm Zone & well into rough water & strong winds. The early morning parade is in future to be cancelled owing to the dangerous Submarine Zone which we\n\nare in. Passed by very close to a four masted Barque in the morning, it looked very pretty in full rig.\n\nThis morning we sighted an object in the water not far from the ship, The sailors trained the gun on it but it dissapeared before they could fire a shot at it, We travell very fast & on a Zig-Zag course for about 4 hours after this incident.\n\nThe O.C. of the troops has taken extra precautions against a surprise by enemy submarines, he has formed what is called a Submarine Guard , which consists of a body of 70 men armed with rifles & ammunitions & posted along the deck in pairs at a distance of about 10 yards apart, They work in pairs and their duty is to look out to sea & watch for any suspicious object that may come within their line of vision. They have shifts of 2 hours on duty & 4 hours off. The idea of working them in pairs is to prevent false alarms, One man working by himself is very liable to delusions on\n\nthat class of work.\n\nThere has also been formed what we call a boat Guard, Their duty is to guard the life boats against any damage caused by anybody interfering with them, they also have to prevent them from being rushed or overcrowded in the event of an accident or being Torpeadoed They are also instructed to shoot any person who attempts to enter the boats without permission.\n\nThe crew are also on double watch 1 man is the lookout in the top crows nest & two men are in the bottom one on the Foremast, One lookout is on the foreward deck at the Bow & another is on the Bridge aft with the Sailor who mans the gun. Two Officers are on the Bridge & two Quartermasters are in the wheel house. The weather is getting very cold now. The temperature of the water to-day was 66 degrees. We are only about three days from Devonport & are now at sea off the coast of Portugal.\n\nI awoke on the morning of","43":" to find the ship in a very heavy gale, the wind was blowing in a South Easterly direction & tearing through the rigging & making an awful din. The waves are running Mountains high & breaking right over the whole ship. It is not over safe on deck & it is impossible to walk along the decks without grasping on to something to steady yourself. The crew has stretched ropes all along the deck to prevent us from falling & being washed overboard or getting hurt when we do venture on deck. These ropes prevent us to a certain extent from accidents & also enables us go get about on deck much better.\n\nThe ship is rolling & pitching a good deal at times when she rolls over on her side she lingers some moments before she begins to right herself again. Then before she is properly righted another green wall of water will crash on to her & make her shiver & shake from end to end & send her still further over on to her side. \n\nAt times when she is over on her side like this the bow will rise itself out of the \n\nwater & pitch forward right into another big wave which will wash all over the decks drenching everything. When she behaves like this it gives one a very queer feeling down in the “little-mary\" & almost spoils your appetite, & you have to hang on to anything handy that is solid to prevent a fall & a wash in ice cold water. When she rolls over like this it’s a wonder to me that she ever gets back again. At other times when the Ship plunges forward & dives into a big wave the propellers will come out of the water and buzz around at a fast rate which makes she ship quiver from Stem to Stern & sends your heart jumping into your mouth.\n\nPeople who have not been to sea can form no idea of what the waves are like and what a gale of wind can do to them especially in the Bay of Biscay where this happened, It hardly seems possible for a ship to live through such weather. This ship the Ceramic in calm weather\n\nis 20 feet from the water to her lowest deck & is easily 30 feet to the top Deck. Well to-day the seas are so high that they are at times 10 to 20 feet above the top deck & at other times they wash right over it.\n\nAt times when the ship is in the trough of the seas, you can see nothing but a green wall of water rushing toward it 40 or 50 feet high & expecting it to crash onto the ship any minute, But nine times out of 10 the ship will rise up and ride over the top, And at others the ship will get the full force of it. The “Log\" is out aft to register the speed that we are travelling against the storm, this is the first time the log has been out during the trip, Troop Transports as a rule do not use the “Log\", The reason why I do not know.\n\nA wireless message was received to-day reporting that several gales have been through Queenstown (Ireland) & had sank barges in harbour, unroofed houses & uprooted trees. If we get any more of these gales we shall be in for\n\na very bad time. I have not felt the slightest effect of seasickness yet, I have turned out to be a better sailor than I thought I would be. Still there has been hundreds of the other men sick.\n\nIt is very amusing at meal time when the orderlies are bringing the food down the stairs from the Kitchen, They have in most cases to use both hands to hold the dishes containing the food, & balance themselves as best they can, At times the boat will roll or pitch when they are coming down, then we hear a yell & look round to see the unfortunate orderly picking himself up from the floor covered with stew from head to foot. Somebody has to go short of breakfast on occasions like this because no more food can be got, still its worth the loss of a breakfast to get a little amusement.\n\nAt other times when we are eating our meals the boat will give an extra heavy roll & everything on the table will\n\ngo clattering to one end & mix themselves up into an awful mess, then the boat will roll back on the other side, & everything will go clattering to the other end, On to the floor, & everybody at the table will have stew, tea & etc all over him. The tables were not like some ships which have flanges fastened on them to prevent things from slipping about, These were quite plain! & in some rough weather like it is to-day, it is almost impossible to get much to eat.\n","44":"\n\nThe sea is still rough slightly worse than yesterday, the wind is blowing a gale. Two or three accidents occurred yesterday amongst the men through being thrown down & dashed against the bulwarks with the movement of the ship.\n\nWe passed very close to a steamer & a sailing vessel to-day, They were being tossed about a good deal at times they were not visible when they went down into the trough of the sea. Even the tops of their masts were out of sight, Church service was not held to-day\n\nowing to the weather being too rough.\n\nToward evening it Hailed & rained very heavy. The temperature of the water was 56 deg.\n\nMonday 20th the sea is still very rough but the wind has died down a lot but it is still bitterly cold on deck\n\nTuesday 21st at a few minutes to 6 o`clock I came up on deck to see the first glimpse of England. I saw the Lizard light flashing across the water from Lands End. Soon after when the light got stronger I could make out the coast line of England on the Port side, We picked up an escort of 5 Torpeado Boat Destroyers & passed by the Eddystone Lighthouse & Stump, shortly afterwards. All along the English channel on our way up I noticed that it was alive with steamer traffic & trawlers doing mine sweeping. We dropped anchor in Plymouth Sound at 11.30 am.\n\nWe all left the ship in tenders and were taken across to the landing stage and were on shore in England for the first time at 5 pm. \n\nThe Ceramic left Devonport for London to discharge her cargo of wheat which she brought from Australia at 7 o`clock pm.\n\nEND OF PART 1\n\nP.S.S. \n\nThe trip over on board the Troopship Ceramic, was, on the whole, very pleasant, My Reinforcement was allotted the best position on the boat for comfort & easy travelling, Our quarters was the old Second Class dining Saloon & it was situated right amidships.’\n\nWe slept on hammocks which were slung to the ceiling at night above the tables, And at day time they were taken down & rolled up neatly & placed in the crates provided for the purpose & are thereby kept out of the way. \n\nI was on the water for 45 days altogether & was not sick during the voyage. The Ceramic is a very good sea boat in rough weather.\n\nPART TWO\n\nChapter II\n\nConcerning my stay in England in November and","45":" Incidents of Camp life & when on leave.\n\nAt Plymouth Railway station I entrained at 8.30pm on the evening of the","46":" for Codford Camp in the Shire or County of Wiltshire.\n\nAt Exeter Station we had refreshments served to us free of cost. In every package was a message wishing us all the best of Luck form the Mayoress & women folk of Exeter.\n\nI was unable to see much of the country from the train as we went along, owing to the night being too dark, And also the different Places we passed through & the Railway Stations were either all in darkness, or the lights were turned down very low, as a protection from any chance Zepplin raid by the enemy. In the railway carriages there was notices asking all passengers to keep the\n\nblinds drawn down over the windows while the train was travelling between the various stations.\n\nThe third class railway carriages on this line vis The South-Western & Chatham railway are much superior to the first class carriage of Sydney. \n\nThe platforms are much bigger & the trains are also much longer than they are in N.S.W.\n\nI eventually arrived at Codford Station at 1.30 am on the morning of the","47":" The journey lasted altogether 6 hours.\n\nThe Camp is situated about 4 miles from the station on the Main Salisbury Road, so after marching about for two hours & being led astray into the bargain we eventually reached there at somewhere about 4 a.m. The night was bitterly cold & we were only given two blankets each to sleep in, I was shivering with cold all night and was unable to get to sleep at all. In the morning the ground was covered with a very thick & hard white frost. \n\nCodford is on the outskirts of Salisbury Plains and is about 60 miles from London by Rail.\n\nOn Wednesday 22nd I got out of bed because it was too cold to sleep & went for a walk to see some of the surrounding country. It is very much like Dubbo in N.S.W. in appearance, Almost every inch is cultivated, It is what the People call Hills –dales here, We in Australia call them the tablelands.\n\nThe two small villages close to the camp called Wylye & Codford we are allowed to visit after 5 pm in the afternoon till 9.30 at night. The villages are very small they consist chiefly of one street only with the houses bunched together & one or two stores & Hotels. As a rule there is a sign board bearing the name of the village placed on the side of the road at each end just before entering it.\n","48":"\n\nTo-day 3 men were killed by a bomb explosion and one man was wounded with a piece of schrapnell from it. The accident occurred while the men were at Bomb\n\nthrowing practice. Another man was shot through the arm while burning rubbish from around the camp, It seems that a live cartridge had found its way into the fire & exploded shooting this chap through the arm.\n\nOn the night of the","49":" I walked into Wylye village to have a look round, I was unable to see much of the place, the night was too dark, But what I did see of it struck me to be very nice & it seemed to be very comfortable . It was very quiet & old fasioned, All street lights were extinguished owing to the fear of Zepplins.\n\nTo-day I went to the village of Codford, as there was no parades all day I was able to see the village in daylight, It did not strike me as being at all nice. It was very dirty & not so homely or as comfortable looking as Wylye. I strolled back to camp after a while & got caught in a storm on the way & wet through into the bargain.\n\nTo-day","50":" I went to see the village of Wylye in daylight & I was considerably impressed with its nice appearance. It is a nice old fashioned English village, Most of the houses are very old with thatched roofs which are over grown with green moss, which tend to give the places a very comfortable & homely appearance. A small stream runs through the village near the railway station end. This stream supplies the motive power to the flour-mill which is built across it in one place. The village church is a very old historical building, It was built in the year 1200 when the place was in the possession of the Normans. One hundred years after the place was built the first rector was installed there. I went back to the camp for tea & turned in to bed early.\n\nThe following day the","51":" I was paraded to the doctor for inoculation\n\nagainst Typhoid Fever & afterwards was allowed the remainder of the day off duty. \n\nThis morning all taps & water pipes were frozen hard & we were unable to get any water for a wash or any other purpose. To night is another very cold & frosty miserable night.\n\nOn the morning of the","52":" I did not get out of bed till about 9.30am. My arm was so very sore as a result of yesterdays inoculation. I sat around the fire in the hut all day to get warm, Outside it is frightfully cold.\n\nOn the morning of the","53":" I moved camp & in the afternoon I was taken for a Route march with the remainder of the Reinforecement to the village of Wylye.\n\nOn","54":" I walked to the villages of Wylye, Hanging-Langford, Little-Langford & Steeple-Langford to pass the time, These villages will answer to the description of both Wylye & Codford, I returned to camp early. The following day I was on In-line Picquet at night. The duty of the in-line Picquet is to\n\nstand by in camp in case of any emergency, They act as firemen in case of fire Etc.\n\nOn","55":" I was inoculated again against Fever, My arm was very sore for a day or two afterwards.\n\nOn Wednesday I was attached to a draft that was to leave for france, But was eventually taken off owing to not having finished the Musketry course.\n\nOn the morning of","56":" I was given a leave-Pass for the days of from","57":" till","58":" inclusive. I left Codford by the 8.30 o`clock am train & arrived at Paddington Station London at about 11 o`clock am. I was marched through the City from Paddington via Hyde-Park to the A.I.F. Headquarters in Horseferry Rd. Westminster.\n\nDuring the afternoon I went about the City looking at the different places of interest & at the various historical buildings. I saw The Westminster Abbey, Houses of Parliament, the Monument of Queen Victoria, Nelsons Monument in Trafalga Square, St Pauls Cathedral, The Marble Arch, Buckingham Palace & the House Guards at Whitechappel\n\nI also went to St Pancras Station & inquired about a train for Nottingham & Mansfield for the morning. I returned to Headquarters on the Underground Railway. For the night I put up at the War Chest Club opposite army Headquarters at Westminster.\n\nOn","59":" I was up at 7.30 am. I had a little Breakfast & was enroute for Pleasley Vale by 9 o`clock.\n\nAt St James Park Tube Railway Station I took the Tube to Kings Cross Station, From here I caught the 10.20 am Midland train & arrived at Nottingham at 12 noon. I changed trains at Nottingham & caught one leaving for Mansfield & arrived there at about 1.30pm.\n\nThe country from London to Mansfield is in places very pretty, The grass was beautiful & green, But the trees were in most cases bare of leaves, They, having been shed in the early winter. The scenery is not so beautiful or so rugged as it is along the railways in Australia , The land here is for the most part cultivated & can boast of very little virgin timber\n\nFrom Mansfield Station I caught the train to Pleasley village, from the Terminus I walked to Pleasley Vale a distance of about 3 miles. \n\nI took Uncle by surprise, I had not written to tell him to expect me & when I walked into the Post Office & told him who I was he was very surprised indeed. Auntie was very nice & made an awful fuss of me, she dragged me around to see everybody at Pleasley Vale. Later on I saw Cousin Tom & Lily \t& Wilfred and I was also introduced to Mr & Mrs & Miss Robinson, Cousin Lily`s Mother & Father & Sister.\n\nAt night I went to a Social & played wist most of the time with Uncle John, Mr Robinson & Cousin Tom\n\nThe following morning I did not get up until about 9 o`clock. After I finished breakfast I sat by the fire talking most of the day. Toward evening Uncle Fred came over from Clipstone Camp to see me. He is working for the Army & Navy Canteen Board in the camp there.\n\nUncle Fred is very nice & jolly. He could not stay long so I went back with him\n\nUncle & Auntie came too. We arrived back home at sometime about 8 pm. The night was bitterly cold, We had supper & then I turned in. \n\nThe next day Monday the","60":" was very foggy in the early morning & the snow had fallen during the night, the ground was covered with it as late as 9. o`clock. This is the first lot of snow that I have ever seen & it looked very beautiful. I had breakfast & sat near the fire talking till 10.30 am when I had to go & meet cousin Tom at his place of work :- The Local Woolen mills. The manager took me over the place & showed me the different departments & explained how the wool was treated & the different processes it went through before it was made up into the final material. The manager is a friend of Uncle Fred. \n\nI returned at about 11.30 am & had some dinner, Said Good-Bye to everybody at Pleasley Vale & left for London at 1 o`clock pm. Auntie & Lily came to Mansfield Station to see me off, & issued strict instructions to come up again when the next opportunity was offered. I changed\n\ntrains again at Nottingham & eventually arrived in London, St Pancras Station at 6.30 o`clock Pm. From Kings Cross took the underground to Paddington Railway Station. I caught the 7 pm train at Paddington & arrived at Codford Camp at Midnight.\n","61":" All Parades are once more in full swing. This morning I am to go through a course of Musketry which will take a week or more to complete properly. On Wednesday I went to the range again, but it was too foggy to shoot. The targets were not visible for more than 100 yards distance. We all returned to Camp & were dismissed for the remainder of the day. During the afternoon I wrote letters to home & to Pleasley Vale also.\n\nThe weather continued to be too foggy till Friday when the fog cleared away & enabled us to carry on with the Target Practice. We all fired 30 shots each & then returned to\n\ncamp. To-day the weather is very cold every blade of grass & every branch & twig on the trees is covered with a thick, hard white frost, The roads & footpaths are so hard & slippery with frost that it makes walking very difficult & dangerous.\n\nTill to the present day","62":" all shooting has been postponed owing to the foggy weather. This morning it has been Snowing very heavily the ground is thickly covered. At 12 o`clock I was put on Guard over the Ammunition Magazine, I kept Guard till 8 pm the following night, It was raining & very cold all night.\n\nOn","63":" I was again selected for In-line Picquet duty & remained on duty till 8 o`clock Friday morning, I did not attend any more parades for the remainder of that day. The next day I was on Picquet duty again,, Snow fell heavily during the day & made the place very cold. The reason of these in-line picquets being kept so often was because there has been a lot of trouble between the men & the Military Police, One\n\nMilitary Policeman was killed in the village of Codford a little while ago, so these Picquets are held in camp to prevent any reoccurance & restore order if any disturbance occurs in future.\n\nOn","64":" I went to the village of Stocton & one or two other places. The village church at Stocton was built in the year 1300. Inside the building is a list of the different Rectors names dating back to the year 1300\n\nSome of the ancient inhabitants of the village are buried in the church, The vaults of some are let into the wall & others are buried under the floor. A church in the village adjoining Stocton is a very old building being built in the year 1624. Some of the Tombstones are very old . some are dated in 17th century & others are in the 18th &","65":" centuary.. some are even as recent as 1906 & 10. I walked slowly back to camp arriving in time for tea. At night I wrote a few letters. Monday December the","66":" Christmas-day\n\nTo-day we were given the best meal that I have had since I joined the A.I.F. At dinner we were given Pork & green peas, veal & plum Pudding. I eat that much that it made me uncomfortable, I had to go & sleep it off. The following day Boxing Day I took a short walk to the villages of Del Mere Stocton & Wylye, I returned to camp early as the weather was bitterely cold, I could not make my self warm, no matter how fast I walked.\n\nOn","67":" I was chosen to do in line Picquet again. \n\nOn Saturday I received letters from Ella & one from Uncle John telling me of Dads death. It came as a terrible shock to me, I do not know how it was but lately I could not get the thoughts of Dad out of my head. Something seemed to tell me that there was something very wrong somewhere, I had a presentment that I was going to hear some bad\n\nnews, I had had dreams on different occasions & every time I could see Dad either dying or else he would be dead. When I left Dad seemed to be in good health, If I had only known that he was going to die I would have not gone to the war – I would have deserted first. At night I wrote home to Alma. On Monday December the","68":" I applied for leave to go to Nottingham again, but they would not grant it to me.\n","69":" the","70":" 1917, I was put on Guard for 24 hours, I dismounted the following day.\n\nOn the","71":" we were all inspected by General Birdwood the Commander of the Australian Imperial Forces in France. On the","72":" I went to the villages of Chilmark, Fonthill, Fonthill-Bishop, Gifford & Heydon, had a good look around them,\n\nThey possess very old Historical Churches and are in many respects like the other villages that I have described earlier.\n\nI returned back to Camp footsore & weary, Having walked about 18 miles in brand new boots.\n\nTill the","73":" it was just the regular Routine of the camp, vis Guards, Drill, Picquet & Fatigues, On the","74":" I took up new duties of Mess-Orderly, \n\nOn the","75":" instant I had to Parade to orderly room for not having my work finished before 12 o`clock . I got punishment of 7 days Confinement to Camp.\n","76":" the","77":" I was selected to accompany the Draft that is leaving for France shortly, I was examined by the Doctor & Dentist & passed as fit. \n\nSome English aeroplanes were flying above the camp today.\n\nOn Friday the","78":" I Finished the Hut Orderly job & went out drilling with the draft. In the afternoon my Kit\n\nwas inspected by the Officer Commanding. \n\nOn","79":" I went to church and afterwards went for a walk to some of the surrounding villages.\n","80":" I was drilling all day long. At night I wrote letters to various people.\n\nI received a registered letter from Alma containing a \nRegist\n Allotment Papers. I made a new allotment payable to Alma, Captain Henry forwarded the Papers to Headquarters for me.\n\nOn the","81":" &","82":" I had practice at throwing Hand Grenades & also sent all valuables that I prized to Uncle to take care of for me.\n\nOn","83":" I Contracted Influenza, I stopped in bed & sent for the Doctor to come down to see me, He gave me some medicine & told me to stay in bed. The following day he came to see me again & the day after he allowed me to get up. At night I went to a lecture on India at the Y.M.C.A. Afterwards I wrote a few letters & then turned in.\n","84":" the","85":" of Feburary I was issued with some new clothing, In the afternoon I had some more practice at Bomb throwing, In the evening it snowed very heavily.\n\nFrom to-day Revielle is to be at 7 am instead of 6 am, Owing to the weather being so severe. The papers say that this winter is the most severe for 23 years.\n\nOn Sunday morning snow fell very thick & heavy , I had some great fun snow balling. \n\nDuring the afternoon I went to the villages of Steeple Langford, Bamford & Wishford, for a walk a distance of about 18 miles. \n\nThe snow remained very thick on the ground from Sunday till Wednesday the","86":" when the sun showed itself for about 4 hours, The snow thawed & made an awful mess in Camp.\n\nOn","87":" The Draft for Overseas left Codford camp at 9 o`clock am for Folkestone arriving there at about 8 am the following morning (Thursday 8th). At Folkestone we were all billeted in big residential houses\n\nuntil it was time for us to move.\n\nAt about 2 pm on the same day we were marched to the wharf where we embarked on small cross channel steamers.\n\n PART 111 \n\nConcerning the trip across the English Channel from Folkestone to Boulogne & the Fighting in france till","88":"\n\nWhen everybody was got on board, there were two full boat loads of men belonging to different Armies, Australians, Canadians, & British all boxed together.\n\nAt about 3 o`clock we left the wharf & proceeded at full speed across the channel toward Boulogne.\n\nFour British Destroyers escorted us across, The Channel was slightly rough & every body on board had to wear lifebelts in case we were torpeaoded by an Enemy Submarine, \n\nWe eventually reached Boulogne without any accidents & disembarked at Dusk.\n\nBoulogne Harbour is not a very good port for shipping it is much too small for very large ships, and at low tide it smells something awful especially in the upper reaches.\n\nOn disembarking we were marched\n\nto the rest camp at the top of Boulogne Hill where we stayed for the night.\n\nIt was bitterely cold, I had 8 Blankets & could not keep warm. In the morning it was reported that two men were found Frozen to Death there.\n\nI entrained at Boulogne railway Station at about 11 am on the morning of the","89":" Feburary & went by train to the town of Etaples which is situated on the coast & is the Base of the Australian Forces in France. \n\nOn arrival I found the ground covered thickly with snow & the weather very cold generally.\n\nI was issued with Rifle and Bayonet, a gas-helmet, steel helmet & 250 rounds of ball-ammunition.\n\nOn","90":" I left Etaples to join the","91":" Battallion in the Firing Line. I was marched to the\n\nRailway station & there I entrained for Albert on the Somme river. The journey lasted all day & on arrival at Albert at dusk we were marched to a rest camp where we slept for the night. At Albert on our arrival I heard the bombardment was continued all through the night. \n\nThe Front line trenches are about 10 kilometres away from the town of Albert.\n\nOn Monday we marched from Albert to Mametz where we joined the","92":" Battallion who were in camp there. At this time the 13th Battallion were resting after just finishing an attack. The artillery fire is to be heard very plainly from here the firing line is only 6 kilometres away. \n\nOn the railway line quite close to the camp there is a large 15 inch naval gun in action, It is mounted on a railway truck & is used for the purpose of bombarding enemy defences behind their own lines.\n\nI was allotted to No 1 platoon A company when I joined\n\nthe Battallion. During the day there were a large number of Aeroplanes overhead of both our own & of the enemy.\n","93":" the","94":" The enemy exploded one of our ammunition & shell dumps. They dropped a bomb on to it from an aeroplane flying about 2,000 ft above it, The shock of the explosion was very severe & was felt quite plainly for miles away. I was inspected by the Doctor to-day & afterwards I was given a little more practice at Bomb throwing. \n\nOn the","95":" there was very heavy bombardments at the front all night long, In the morning I had some more Bomb throwing practice.\n\nOn","96":" I walked to the town of Albert & over the battlefields surrounding, to have a look at what the Hun had done.\n\nThe town of Albert is for the most part utterly ruined, The beautiful Cathedral which stands in the centre of the town is absolutely in ruins & past repair. The statue of the Maddona at the top of the spire is in the act of falling owing to the supports being shot away in places. French\n\nsupestition says that when the figure falls the war will end, which to a certain extent, has come true. At the time of the last German attack & the English counter attacks in the middle of the year 1918 it was shot down, some people say it was purposely shot at, but others say that it was a pure accident, Whichever it was the War did not last long afterwards, the Armistice was signed on the","97":" the same year.\n\nThe fields around Albert are covered with shell holes, It is almost impossible to walk more than 10 yds in places without going into a shellhole. The small villages which before the War were situated at intervals along the main Albert road, are absolutely destroyed Mametz & Fricourt villages are absolutely gone, The only distinguishing mark is the red brick dust on the roads, where the bricks or stone from the houses have been used in mending the roads. Or perhaps at places there might be a Sign-board bearing the name of the village that was at one time there. At other places an old beadstead or some iron ware are the only\n\nmarkes which serve to show to the person passing that at one time a nice peaceful village was situated there.\n\nThe beautiful wood at Fricourt is in an awful state almost every twig bears either a bullet or shrapnel mark, A lage part of the finest trees have been wantonly cut down & destroyed by the Hun.\n\nThe following day the","98":" I went with a fatigue party to Mametz wood, to cut wood for use in camp. Close to where I was working there was 6 dead Germans, the bodies were in a half decayed condition & all their heads were missing. They have probably been lying there for six months unburied.\n\nAt lunch time we took some water from a shell hole & boiled it to make tea. After we had finished our lunch & drank all the tea, we discovered that the portion of a germans body from the knees to the chest was floating in the water that we had used, Of course the thoughts of it upset our stomachs & bit some of the men were sick afterwards.\n\nUntil the","99":" of the month nothing much occurred except the usual routine of the camp.\n\nOn the","100":" it rained & made everything very muddy & miserable.\n\nAt 9 o`clock am on the","101":" we all left Mametz camp enroute for the village of Ribemont, where we are to go into billets for about four weeks resting. Along the route we passed through the villages of Becourt-Becordal, Meault, Dermancourt & Burre-Souis-Corbie, on the road just past Dermancourt, we stopped & had dinner. We arrived at Ribemont at about 4 oclock pm. My feet were very sore through the frosty ground & the long tiring march.\n\nAs soon as we were all allotted to our billets I was selected for Guard duty, It was absolutely the worst duty I had done for a very long time, I was dog tired & the cold frosty weather made it impossible to stand still for long, my feet in the morning were as sore with the frost that I could hardly bare to stand on them. When we were relieved at 5pm I went straight away to bed.\n\nWe are billeted in barns & stables here, the sleeping accommodation is in bunks, one on top of the other. The quarters are very cold & drafty & in rainy weather the rain comes through the roof in many places. \n","102":" & Sunday the","103":" and","104":" I went to the Doctor to get my feet attended to. I have lately had a slight touch of trench feet, they are swelling up & beginning to turn black at the toes, It has been caused by the wet weather & the intense cold. \n","105":" the","106":" On one or two occasions last week I visited some of the small villages surrounding Ribemont on Monday I visited the village of Mericourt-Le Abbie & on Wednesday I went Heilly. Today I went to see Dernancourt, Meault & Burre-Louis-Corbie, Returning to Ribemont at dusk.\n\nAll these villages are much the same as one another, they all have the same dirty street & half ruined houses with thatched roofs. The houses that are not occupied by troops have fowls dogs & cats running through every room of the place. The French Peasant seems to florish where there is plenty of dirt around. Most places have the Houses, Cattle, Pigs, fowls & Human-beings living all under the same roof, In some cases the residential part of the house is in the loft above the cow-bails.\n\nIn the main street & in the centre of these villages you can generally see a shrine of the \n\nSaviour Jesus nailed to the cross, It is the custom right throughout France to have these Shrines placed in all Towns, Cities & Villages & also at intervals along all the main roads. \n\nIn olden times travellers used to worship at these shrines, But I think that the custom is gradually dying out now-a-days.\n","107":" the","108":" we had some very heavy snow, which continued to fall every day till Saturday the","109":"\n","110":" I again went to Church & after the service the Brigadier General presented medals to a few of the men.\n\nOn the next day monday Parcels from the Australian Comforts fund were to be distributed. At about 2 o`clock we were lined up ready to receive the parcels & had to march past a photographer who was taking Photos of us receiving them. As we were handed a parcel each we marched away a little distance till the Photographer was finished then were made to put the parcels back. The photographs were I think for the Australian papers, I do not suppose\n\nthat when the pictures were published in the various Australian papers the full facts of the case were published, The Australian people will not be likely to know how they are deceived with all these pictures of their men getting things which they have to hand back after their Photos have been taken & help to a certain extent in deceiving the people at home.\n\nOn","111":" I was taken sick with influenza & paraded to the doctor who sent me to Hospital. I continued in Hospital until the afternoon of the","112":" when I left & went back to my billets. The following morning we moved camp from Ribemont to Fricourt I was considered to be an invalid so was taken from Ribemont in an Ambulance arriving at Fricourt in time for tea.\n\nAt 11 pm on the night of","113":" all clocks were put on one hour for daylight saving, which is a sure sign that Spring is drawing very near, Although at the present time the ground is still frozen & the weather is very cold. On Monday the","114":" \n\nwe again changed our quarters. At 9 am we marched out from Fricourt for Bazentin, Along the route we passed the villages or the sites of the villages of Contalmasion, Bazentin-le-Petit, Bazentin Le Grand, arriving at out new home at about 12 o`clock thoroughly tired out, The rest of the day was free for us to go where we wished. I went to see some of the old Battlefields surrounding the place.\n\nThe next day Tuesday the","115":" we again moved camp this time to Walencourt where we camped in dugouts, On our way here we passed by the site of Poziers village & also two other shell shattered villages of which the ruins were still to be seen, not like most other places where everything almost has disappeared.\n\nPoziers village is where the Australians first charge was made in France in 1916 after coming over from Gallipoli & Egypt.\n\nOn Wednesday the","116":" we marched from Walencourt to Bapume a distance of about 9 Kilometres. When we arrived we had to build our own dugouts.\n\nThe Germans are dropping a few shells around\n\nbut as yet we have had no casualties. We are camping at half a mile from Bapume.\n\nBapume has only lately come into our posession, the only place in the town that was not destroyed was the beautiful town hall, When we occupied the place they used the townhall for the headquarters of both French & British battalions who were at that time fighting along the Bapume section of the Front Line, About 8 days after our occupation the building was blown up by a clockwork mine that the Germans had left there as a trap, About 40 men were killed in the explosion of both French & English. Parties were at work for days after the explosion searching for the missing bodies, some were never found. After this accident orders were issued that all buildings left standing by the enemy after he had evacuated any places were not to be used for the sheltering of troops until they had been thoroughly examined by the Engineers & pronounced to be safe.\n\nAll the roads which intersected one another were blown up at the crossings, All Railway lines were torn up, all trees including even the smaller fruit trees were cut down & the timber ruthlessly destroyed right throught Bapume & the villages surrounding. Also most of the building material from the destroyed houses was either destroyed or taken away.\n\nEvery day till April the","117":" I was either on road making fatigue, Building or collecting material for building dugouts from the surrounding destroyed villages or else I was doing some drill or Bomb throwing practice.\n\nOn","118":" one of the enemy aeroplanes destroyed an observation balloon of ours by dropping a bomb on it. When it took fire the observer left it by the Parachute & reached the ground without injury, Also during that day the Huns were shelling us fairly heavy & in the evening snow fell very thick & fast, the night was bitterly cold.\n\nOn April the","119":" we again moved camp this time about 1½ miles nearer the front line than Bapume near a small destroyed village named\n\nFlaville. The day was bitterly cold & the wind cut right through our bodies. When we arrived we had to set too & build our own dugouts, during our building operations we were shelled by Fritz from time to time. \n\nThe following day saw no improvement in the weather, we had rain in torrents all day & the bitterly cold wind did not tend to make things any better. In the afternoon one of the enemys aroplanes came over & destroyed two more of our Observation balloons, the Ocupants reached the ground by means of the parachute without injury . Our Anti –Aircraft guns succeeded in bringing the enemy plane down. It seems very queer that on these two occasions in which we have lost balloons through enemy attack, Our own aeroplanes have been nowhere about, but on each occasion it was only a few minutes previous that out planes were to be seen every where you looked. Till the","120":" fatigue duty was the rule, On Saturday we had heavy falls of rain & snow\n\nthe days are bitterly cold. \n\nOn the morning of the","121":" we had more Rain & Snow accompanied with very heavy hail & wind. At 10 o`clock pm we received orders to move into the front line & were on our way half an hour later, All that night we had no sleep. We were supposed to attack a strongly held German position at the village of Reincourt on the right flank. The attack was to be just at the break of day but owing to the tanks that were to accompany us failing to put in an appearance & owing to the artillary not supporting us, the attack was abandoned, we were given orders to retire back to the supports just as day was breaking. During the retirement the snow fell very thick which effectively screened us from the enemy & enabled us all to get back with very light casualties. It is my opinion that if the snow had not been falling we would almost all have been wiped out, as it happened there were very few killed. \n\nFrom the support line we then retired back to out starting point – vis, the village of Flaville, about 10 kilometres heavy marching.\n\nAt Flaville we had some food & a little rest but at 10 o`clock pm we were marched off again back to the Front line to finish the job that we should have done at daybreak. \n\nThe attack was to be made in three waves & had three objectives. The","122":" Battallion went off first & their objective was the enemy’s front line trench , which they succeeded in capturing.\n\nThe 15th & 14th Battallions went next & their objective was the enemy’s support & reserve lines, But owing to the tanks not being effective they were held in check, till the 13th Battallion which was the last to leave & whose objective was the village of Reincourt came up with them in No-mans land, & the three battalions advanced almost together & subsequently succeeded in reaching the enemys second line of trenches & saps, that led through into Reincourt village. The Tanks that were to assist us in this attack had been of very little or no use, Three were\n\nblown out of action by the enemy’s artillery fire before they had succeeded in getting to the barbed wire entanglements, in front of the German trenches, one only succeeded in getting through & that was put out of action just as it was crossing the front enemy trench. The reason why the tanks were so unsuccessful was because we had no artillery support, Our own artillery did not fire one shell while the attack was on, It was not till it was too late & everything lost & about 1,000 men killed that we got any support from them whatever. \n\nIt was about 10 o`clock am on the morning of April the","123":" that the first German counter attack was hurled against us, The only way they could attack us was through the communication trenches leading from the village to their 2nd line trenches. We succeeded in forcing them back & pushed on through the trenches, to where the trench that I was fighting in ended abruptly on\n\nto the road, that ran through the village of Reincourt, At this point we held them in check, till our supply of bombs began to run out. We sent messages back for more bombs & we gradually got some sent. Every man that attacked that morning had to carry 2 bombs with him, & it was these bombs that enabled us to keep the enemy back for so long a time. But gradually these supplies ran out, & finally we were forced to use the enemys own bombs that we took when we captured his trenches . In the meantime we had sent runners back to get some artillery support, as our communications were all cut off, We also sent carrier pigeons but it was of no use, the artillery did not come till after it was too late.\n\nThe fact that we used the enemy bombs let them see quite plainly that we were short of ammunition, so \n\nthey pressed heavier & heavier until finally we were forced to retire. We bombed as long as supplies lasted & prayed for artillery support, which, if we had got it, would have been the means of saving the position, & hundreds of lives & about 1400 from being captured.\n\nBut as no artillery was forthcoming we were ordered to retire back to the","124":" line trenches, &, as the Huns pressed us heavily here again, the order came to retire to the first objective, & later on we were ordered to get back to our own lines & every man for himself. \n\nTo retire back to our own front line was absolute suicide, as there was a stretch of barbed wire entanglements to cross, & also 11 hundred yards of flat snow covered country to traverse with the Germans shooting you down with Rifle & Machine Gun fire, & us absolutely without ammunition & unable to retaliate on them, nevertheless I attempted it, I was shot through the head & knocked out by a rifle bullet.\n\n I crawled\n\ninto a shell hole, Later on I managed to stop the flow of blood & put a temporary field dressing on myself. The next thing that I remember was a German yelling out to me in his own language, to come along, He assisted me along to their trenches where I met some more Australians, who were also wounded & taken prisoner, we were then taken through the trenches (which were almost 2 deep with dead men) until we reached a large pit about 50 yards long by 15 wide & which was packed full of Australians who had been captured earlier. \n\nIt was just at this time that our artillery started to shell the trenches, it was the cause of the death of an enormous lot of out men & also some of the Germans. We were taken from this pit through some more trenches & across some open fields, with our own artillery shelling us all the time, & killing large numbers of\n\nour party.\n\nThere was seven battalions in the attack altogether, but the","125":" 14th","126":" &","127":" Battallions which comprise the 4th Australian Infantry Brigade suffered the heaviest casualties. The section that the attack was made on, was the “Hindenberg Line\" between Reincourt & Bullecourt.\n\nI estimate the casualties at 2,000 Killed & 14 hundred Prisoners, The Majority of wounded were amongst the Prisoners taken.\n\nThis attack was always known as the Bullecourt blunder amongst the men. But with good management it would have come off alright & not one twentieth of the casualties would have occurred.\n\nThe reason why the Tanks failed us, was through the lack of artillery support. The Tanks given a proper chance are the best wepons that have been used in this war to work with the Infantry.\n\nAfter leaving the trenches we were all marched to the village of \n\nEcort St Quentin & were put in a large church for the night, after having my wound dressed. It was very painful. The interior of the church was in an awful state, some of the interior fittings were broken & destroyed, others had been removed. The night was bitterly cold & it was impossible to get any sleep.\n\nThe next day Thursday we were moved by rail to another village where we were put into barns to sleep for the night.\n\nThe next day I had my wound dressed again, It was very sore & the Germans were none too careful when attending to it.\n\nAt 4.0 o`clock we entrained for Germany after being seperated from the unwounded men. The men that were unwounded were taken to Germany, but kept at work behind the German front Line, Where in time the Majority were either killed by Germans or our own artillery fire, Some managed to get through\n\nto Germany later on through wounds & sickness. Starvation accounted for hundreds of deaths. Men unwounded are never reported by Germany as being prisoners-of-War till they are taken into Germany. They are kept for years behind the lines doing all sorts of work, And if they happen to get killed, they are considered to be not worth the time & trouble it takes to bury them\n\nPART IV\n\nConcerning my stay in Germany as Prisoner-of-War from","128":" till","129":"\n\nFrom Friday the","130":" until Monday the","131":" I was travelling in the train through France Belgium & Germany, The town or Cities that I passed through was Cambria in France, Leige, Namur & Charleroi in Belgium, and Minden & Hannover in Germany.\n\nWe were in cattle trucks all the while which were opened on two occasions to feed us, Our wounds were not dressed at all during the trip , which lasted about 60 hours. Some of the wounds were in an awful state, & which, when we reached hospital, was the cause of a lot of limbs having to be amputated.\n\nWe were all in a filthy condition swarming with vermin, and with our hair all matted together with mud.\n\nOn the morning of Monday the","132":" we arrived at Munster-Lager station , where we detrained were marched a distance \n\nof about 2 kilometres to Hospital, and on arrival we were given a basin of vegetable soup & afterwards washed & put in bed.\n\nThe water that I was washed in had been used for about 20 men before me, it was absolutely filthy & no doubt I made it much worse for I was very dirty myself. The following day I had all my particulars taken as regards name, Regiment & etc. \n\nI also had my hair cropped short & I was shaved all over the body, then moved to another Hut & into bed again.\n\nMy wound has been very sore, and they have not washed it or treated it in anyway excepting they put a clean paper bandage on it. \n\nUp till Sunday the","133":" I have had my wound dressed again twice. On Thursday & again to-day , one Russian Prisoner died, through bad treatment & starvation. On Friday I wrote my whereabouts home to Alma & to Uncle. The next day the","134":" another Russian & a Scotchman died.\n\nFrom the","135":" to the","136":" The food has been very bad, not enough to keep a person alive for long, on the","137":" one Russian & a Frenchman died, making a total of six in ten days.\n\nMy wound is healing up fast so I will try & get out of here & get to the big concentration camp at Soltau, in the hopes of getting better & more food. On the 29th another Russian died making the total of seven in 13 days, all their deaths were due to neglect & to starvation. On the first of May I had my clothes given back to me with the exception of my boots, which were new, I was given a pair of wooden clogs to wear which crippled my feet terribly. I left Munster Hospital at about 2 o’clock & entrained for Soltau.\n\nAfter a journey of 2 hours we arrive at Soltau Station, from whence we were marched a distance of 5 kilometres to Soltau Lager. That march was the worst march that I ever did, In\n\nmy weak & half starved condition I nearly fainted on several occasions along the road.\n\nEventually we reached Soltau Camp & were given a nice hot drink of Cocoa by the British Prisoners Relief Commite then in Soltau.\n\nIn Soltau Camp the food that is given to us is not fit to eat, But we have to eat as much as we can get or we would be dead in less than a week.\n\nThe British Relief Commite supply us with some biscuits every now & again & these relieve the pangs of hunger for a little while.\n\nOn arrival we were bathed & fumigated again & then were put into a small compound by ourselves for quarantine purposes for a length of six weeks.\n\nThe 11th of May I was vaccinated against Smallpox but I rubbed it off to prevent it from taking effect. During last week there was two more fresh batches of Australian Prisoners arrive. The weather is getting much warmer and is twilight till 10 o`clock at night.\n\nMonday 21st May. During the past week I have done a little work, We have also been searched twice by the Huns for money & valuables. Their idea is that if they can get everything of any value from us , it will prevent us from escaping so easily. General Heinz the Hun commander of the","138":" German Army inspected the camp. Thursday we got some more biscuits from the English Commite. The German food has been absolutely rotten.\n","139":"\n\nI am living much better now as regards food. This last week the British Commite has issue biscuits & tinned stuff twice, I am feeling much better now, but on Friday I had an attack of dissentry which pulled me down a good deal. On Thursday the camp was inspected by a tribe of Hun Generals or some other high rank, They were all dressed up to the ears, and had the Prussian spiked helmets on with the big spreading Eagle in the front. The other days I was doing some\n\npick and shovel work.\n","140":"\n\nDuring this week I had the first meal off English bully beef that I have had for many a long day. We had another issue of biscuits from the British Commite.\n\nTwo more batches of Australian Prisoners arrived here this week one on Wednesday and the others on Friday. On Saturday we were searched again for money & valuables by the Huns, I also received one packet of food from Copenhagen.\n","141":"\n\nI was inoculated on the right breast against Cohlera to-day . On","142":" I received a parcel containing Bread from Copenhaven, but owing to it being in an decayed state, I had to throw it away, It was absolutely unfit to ear or else you may be sure it would have been eaten. I also had another issue of biscuits from the British Commite.\n\nOn Tuesday I read the book that\n\nwas written by Sir Roger Casement it was entitled, “Ireland & the War.\" The man deserved hanging for having ever thought of the things that were written in that book. He was a traitor to his country & would have sold Ireland to Germany, had he not been caught & put to death before it was too late.\n\nThe body of Irish prisoners that joined Casement in his attempt to form an Irish volunteer brigade to fight for Ireland with Germany, were mostly recruited from the men of Limburg Prison Camp in Germany. In this camp were collected together all the Irishmen that they could get from the other camps, and then they were addressed by Sir Roger Casement who asked them all to join him. About fifty, it is said joined with him, The remainder would have nothing whatever to do with him. So were in consequence starved by the Germans\n\nuntil they did join. Men that did turn traitor were given a bright green uniform with gold trimmings & were fed with all the food that a person could wish for. The Germans would then show the men that would not join, how their comrades were fed, and would promise them all a real good feed if they would only join up too. A lot turned just on purpose to get the food, & afterwards tried to get out of it, but were beaten & almost killed by the Huns. Later on when Sir Roger Casement was captured & put to death by England as a traitor to his country, the Brigade fell through but I do not know what became of the men that had joined up. Some of them will find themselves in a very tight place if ever they go to England again.\n\nAfterwards the German Papers used to publish the Photograph of Sir Roger Casement as the “Great Irish Martyr & Patriot\" who the English had unlawfully executed.\n","143":"\n\nOn","144":" we were all shifted out from the Quarantine lager into the big working larger. From to-day it is going to be work & plenty of it, according to what I can make of it. \n\nOn Friday I saw a Zepplin for the first time, it was flying over the camp at a high altitude so I was unable to see much of what it was like. The weather is now getting much warmer & the twilight has lengthened out till 11.30 pm. We only get about 5 hours of darkness.\n","145":"\n\nI have had issues of food from the relief commite on one or two occasions during the week, On Thursday last I had a short bout at fisticuffs with another chap whose idea of honour wasn’t mine, I reckon I convinced him that I was the better man, because he gave in after about 10 minutes of fighting. The German food has been as it usually is (bad) I have succeeded in dodging work on two or three occasions during\n\nthe week.\n","146":" the","147":"\n\nDuring this week I have been getting one or two Parcels of food & clothing from England, and I have also received one parcel of bread from Switzerland. I have managed to dodge work fairly often, and I have also done some washing on two occasions through the week.\n\nOn Tuesday the","148":" I was given orders to prepare to move from Soltau to Konigsmoor. At 6 pm I with 11 others, were put in cells for the night. The reason that the Germans did this, was to keep us to-gether & prevent the men from escaping, & also so as they could put their hands on us when we were wanted to leave in the morning. The following morning the","149":" I left Soltau camp & marched to the station where we took train for Konigsmoor Lager, eventually arriving there at 7.30pm\n\nIn Konigsmoor the food that was given to us was very good, The reason being, because all Food Parcels sent to the \n\nFrenchmen were commandeered by the Germans & the contents used for making the soup, which was served out to everybody in camp. This continued all the while I was in Konigsmoor Lager.\n\nThe work that I did while I was here, was sorting Potatoes, We were to separate the bad potatoes from the good ones, The good ones were then buried in the earth to protect them from the frost of the comming winter, We had a Sentry watching us to see that we did it properly, & watch that no bad ones were put amongst the good, but every time he turned his back on us, we would put a bucket full of bad ones on top of the good ones & cover them over with straw. In all probability when they dug them up to use them they would find them mostly bad.\n\nOn Tuesday the","150":" I left Konigsmoor Camp together with 6 other Englishmen & 5 Frenchmen. We caught the 8.30 am train from Konigsmoor Railway station to Gnarrenburg arriving there at about 4 o`clock pm. From Gnarrenburg \n\nwe marched about 4 kilometres to a smaller village called Carlshofen. We are billeted in fairly comfortable quarters, and our first meal upon arrival was good, It is to be hoped that they will keep the food supply good.\n\nAt this place, the work allotted to us is “Peat digging\". The working hours are from 7 am till 7 pm with time off for meals. \n\nThe food to-day was something rotten . The good meal of yesterday seems to be the only good one that we are to get.\n\nIt is very fortunate for me that I get parcels from England, and am to a certain extent independent of most of the German tack. If the German food was to be all that we were to get I do not think that I would ever get out of this country alive. \n\nOn Tuesday &","151":" &","152":" I had disentry and was not feeling at all well, so I went to see the doctor & was excused from work each day. The weather just now is nice & warm, The camp No is\n\nSoltau Z 3015 & my No is 1202. On Thursday the","153":" I was payed for the work that I had done, The amount was 165 Phennings. Equal to about 1\/7½ in English money, at peace time rates. This was for 6 days work.\n\nThe official news item Published in the Leading Berlin Newspaper – vis – The Berliner tageblatt was as follows. Owing to the very heavy pressure on England by our submarines, the English have been forced to abandon London as capital, and annex Calais in France for the purpose.\n\nThe sentry showed me this & was overjoyed at the news. I felt as if I could kick the man to death for not having more sense.\n\nOn August the","154":" we had another good meal served to us by the Germans. The Felwebel came to-day inspecting the place so that accounted for the good food.\n\nThe last month has been nice & warm, but it is now gradually getting cooler. Rain has been falling in torrents all day, so\n\nI went sick on purpose to dodge work. \n\nOn Monday September the","155":" I was put on a new job, That of digging noxious weeds out of the ground. The food was absolutely unfit to eat to-day so we all complained to the Town –Major about it, There were a lot of small grubs amongst it & we showed these to him. The following day the food was a little bit better, but not quite fit to eat yet.\n\nA Zepplin numbered L.44. passed by us to-day, It was very low & had eight propellers, four on each side.\n\nThe Zepplin L.44. was brought down in the River Thames in 1916 by the English , so this (No2) L.44. must be just out to advertise itself to the German people and make them believe that the one bearing the original number returned.\n\nFrom the","156":" to the","157":" I was working at stacking peat & on the","158":" I again went in the fields digging noxious weeds out. These weeds had to be dug\n\nright out by the roots to kill them & make the fields fit for cattle to graze on. Well instead of taking them out by the roots, we would just cut them off at the ground & turn them over. & not injure the roots in any way. \n\nWhen the old farmer came & looked at it, he was very pleased because we had done the job so quick , but next winter he will get a big surprise when he sees them all grow up again, I hope he puts his cows into the field & gets them all poisoned, It will make him wish that he had given us better food.\n","159":" I had another fight with a chap belonging to the","160":" Battallion . It only lasted a few minutes & was another victory for yours truly.\n\nOn Monday the","161":" I was working in the fields again, but this time under a new farmer (the Town Major, the food is so far, good, & it is\n\nto be hoped that it will continue good. \n\nFive more Zepplins were overhead to–day, but they were too high to distinguish the number or see much of what they were like.\n\nOn the","162":" &","163":" some more official news was published in the German Papers to this effect :- The Australian People are tired of the War & are demanding all their troops to be sent back home, and that the troops absolutely refuse to fight any more for England..\n\nAnother report is :- That since the","164":" till to-day , 1800 Australians have been killed in France alone. This news is I think published for our benefit, & is of course taken with a pinch of salt.\n\nI have been constantly in recipt of food Parcels from England at the rate of 6,10lb packet per month. I also have been getting bread from Switzerland, at the rate of four, two loaf packets per month. I can manage to get along very nicely \n\nwith these, together with what is fit to eat of what the Germans give us.\n","165":" the","166":" I again moved, this time to the village called Zeven at a distance of about 100 kilometres. At 7 am we left Gnarrenburg Station changed trains at Bremennorde Junction & thence to Zeven arriving at about 12 noon.\n\nWe are sleeping on the top floor of the Farmer’s premises & have two big rooms between seven of us, It is the most comfortable place I have been in so far, The food is also very good, too good to last. The work that we are to do is Potato digging. We worked at the Potato digging job from the","167":" till the","168":" when we were sent away for not doing the work properly.\n\nWe buried as many potatoes as we could, so as to make the supply less than the demand, But after we were supposed to have collected all the spuds, the farmer went over the ground with the Harrow & scratched as many as we had collected up again.\n\nThis caused an awful row, and we all got the sack, and were moved to another village about 5 kilometres away , where we were again put on the same sort of job. This village was called Snackenburg, Here the food was not a patch on the other place, so the farmer did not get his work done to satisfaction either. The sentry kept his eyes on us all the time, which made it very difficult to leave many behind without being detected, But nevertheless we managed to leave behind a good many hundredweight of them.\n\nOn Tuesday the","169":" we all complained about the food not being good enough which caused no end of a row, For the remainder of our stay there, we were given food worse than it was before we complained.\n\nOn Thursday the","170":" one of the men went sick, so we took some breakfast in to him. The Huns made an awful noise about it. They were\n\ngoing to have us punished, and were going to do all sorts of things to us. Anyhow they did not attempt anything, which, no doubt, saved them a lot of trouble & perhaps some bodily harm, The incident made us all in a fine state to murder every German there was.\n\nThe Germans reckon that when a Prisoner is too sick to work, he is too sick to eat, and consequently gets nothing from them.\n\nOn the","171":" instant we all left this village of Snackenburg for Zeven, Where we caught the 6.30 pm train, We changed trains at Rottenburg Junction thence we went on to Konigsmoor, arriving at the camp at about 8.30 pm. As it was raining when we left the train, we got wet through during the march to camp.\n\nI remained in camp at Konigsmoor till the","172":" when I to-gether with 11 others were moved back to Soltau Lager. We left Konigsmoor by the 11 am train, changed trains\n\nat Buckholz Junction and thence on to Soltau, arriving there at 4 pm. On arrival in Soltau we were all given a hot water bath and we all had our hair cropped very short, We also had our clothes fumigated to get rid of the chats, if any. \n\nIn the camp I was doing odd jobs. On Wednesday I went into Soltau to have a tooth drawn. The Hun nearly drew my head off with the tooth. \n\nIn the same afternoon I was given orders together with 5 other Australians 3 Canadians and 3 Englishmen to prepare to move out to Lüneburg by the 6.30 am train the following morning.\n\nWe were all put into Clink for the night, so that we would not be missing when the time came for us to move off in the morning\n","173":" I arrived at Lüneburg at about 11am this morning. We are to work in a Table Salt Factory here, and according to all accounts it will\n\nnot be all bread and honey.\n\nLüneburg is a rather large town, with about 30,000 inhabitants. The place is well laid out, The streets are nice & wide and along the footpaths are planted trees at intervals of about 10 yards apart, The roads are all built of rubble stones, and are kept in very good order & very clean. A large canal runs through the centre of the town & connects it with Bremen & Hamburg, It is about 200 kilometre from the Holland border & about 50 kilometres from Soltau. All houses are on the flat principle.\n\nThe factory where I am to work is situated on the outskirts of the town, and is the largest factory in Lüneburg .The work that I was doing for the first week was unloading coal from railway trucks, Afterwards I was put on the Salt making job, I was with a German civillian for a month learning the job, Afterwards\n\nI was told to do it myself. The work was not too easy, and I was not too willing , so I did my best to do as much damage as I could without getting into trouble. I managed to spoil about ½ a hundredweight of salt per day. One day I was shovelling the salt on to the shelves in the drying room, and was standing on it with my dirty boots after just coming in from outside in the mud & snow. The German civillian who was working next to me, came in and saw me, He made an awful row roaring & shouting & spitting at me, I kept on at the work till I could stand it no longer, so turned round and shouted at him in English, I either shouted louder or spat more than him, Anyhow whatever it was he went away and left me alone afterwards. Later on he asked me what nationality I was, and when I\n\ntold him that I was an Englishman, he went away mumbling to himself, as if to say , (Oh that accounts for it!) Ever afterwards when he would see me about he would always salute me and pass the time of day. \n\nOn","174":" A general and his staff from Soltau visited the Factory, In consequence the food that day was good.\n\nOn the night of Sunday the","175":" the snow fell very heavy, and remained on the ground all day Monday. Monday was very wet, cold, frosty & foggy all day. Sunday snow was the first of the season.\n\nOn","176":" The Leading German paper, vis (Der Berliner Tageblatt) published officially , that Russia was suing for a separate peace with Germany and Austria Hungary. There are about 100 Russian Prisoners at this Factory, They are all wishing that peace can be patched up. I cannot help saying to myself (when I look at the class\n\nof men the Russians are,) Thank God that I am an Englishman, The Belgians are not quite so miserable looking, But they are almost traitors to their country. I have no more respect for Belgians than I have for the Germans, And that’s very little you may be sure. The Frenchmen are not as bad, they are the best allie we have. \n\nOn","177":" we had about 12 inches of snow, It looks beautiful on the ground, but it makes the air very cold.\n\nOn the","178":" I was sick with a sore throat & Influenza, I went to the Doctor, he gave me some medicine and work. \n\nThe snow that fell on Tuesday has just dissapeared. The food is as usual, (bad.)\n\nOn Sunday December the","179":" we had more snow which continued to lie on the ground till","180":" of the month. On two or three days last week we had a very heavy frost, and the early morning of all day, we had thick fog. The food was bad as usual.\n\nOn Tuesday January the","181":" 1918, I went with some of the other Englishmen to the town of Lüneburg to have my Photo taken, I was taken once in a group and once alone, I sent a photo of myself to Auntie, Alma & Etta, It was very bad picture, At the time I was awfully thin & hollow cheeked, And the big overcoat that I was wearing made me look more like a Bloomsbury Burglar than anything else I know, Nevertheless is was considered good enough for a certain person to take round, and advertise before everybody that person met.\n\nOn Wednesday the snow fell very thick again, At Dinner we were given preserved Potatoes to eat. Did you ever hear the like of it? If you were to give such food to a donkey, he would kick your brains out. On Friday we had snow again, In the afternoon I was watching the Russians fighting\n\namongst themselves, The Guards stopped the fight before anyone was hurt, Worse luck! \n\nOn January the","182":" we had a very hard frost which froze everything & made walking very hard, The ground was so slippery that it was hardly possible to walk about without slipping. Till January the","183":" we had snow falls every day, sometimes it was accompanied with rain, every day it was bitterly cold.\n\nOn the","184":" it thawed which made it very wet underfoot. The snow continued to thaw until it finally dissapeared on January the","185":" On","186":" I got a postcard album with a lot of different views of Lüneburg on it, A chap belonging to the Welsh Guards presented it to me. \n\nFor the past six months I have been constantly in recipt of letters from England & also from various people in Australia in addition to those from Alma and Etta. It is not necessary to say how the German food is, It is always bad, and inmost cases absolutely unfit to eat.\n\nFrom the first of February till the","187":" there has been no incident happen worthy of mention. The German food for the past month has always been very bad, The weather has been bitterly cold, with rain, snow, Frost and fogs on different occasions during the month, \n\nI have also been in constant recipt of Red-Cross parcels from England and Switzerland, and I also have received letters from both England and Australia constantly. On Saturday the","188":" I purchased a big German pipe as a souvenir, It cost me 7½ marks \n\nOn Monday the fourth of March the German papers published officially, that Russia had been granted peace. The flags were flying & the church bells were rung right through German to commerate the event.\n\nThe Russian Prisoners are not to be sent back to Russia until Germany has finally arranged Peace with the other nations. According to the terms of the treaty. \n\nOn Sunday the tenth of March the Germans searched us all\n\nagain for money and valuables.\n\nOn the thirteenth, I went to see the Doctor & as I was not feeling to well. The Doctor examined me, and told me that there was nothing wrong with me, He sent me back to work. \n\nAs a rule when a Prisoner is sick and there is no sore visible, he is classed as fit, And in the majority of cases, is driven out to work. But if he has a cut or sore, that can easily be seen, he is as a rule allowed a day or two off from work. You can be almost dying at times, and if you can show no mark or anything that looks sore to the doctor, out to work you go.\n\nOn Friday and Saturday the","189":" &","190":" of March, we had some slight rain. Sunday was very cold & dull looking, On Monday we had more rain & snow on Tuesday. \n\nIt is published that the Germans have started their offensive on the Western\n\nFront in the region of Cambria and Arras. And that they have advanced twenty kilometres and captured a large number of cannon, and 25,000 Prisoners mostly English. The German civilians here, say that their Soldiers are not allowed to send letters to Germany while this move is on. The Flags were flying here to-day.\n\nOn Thursday the twenty eighth day of March, The German papers published the reports of the German offensive on the western front as follows. That we have been pushed back to the town of Albert on the Somme district, A distance of about 50 kilometres. \n\nAlbert is where we checked the German advance in 1914, and also where we started an offensive in","191":" It had taken us two years to get to the point that we were at, before the Germans started their offensive a few days ago. They claim to have undone this, (which has taken us two years to get) in six days. I will not believe this\n\nuntil I get some more reliable news that what is in the \n\nGerman papers.\n\nIf it turns out to be true, our side must be slipping a good deal lately. Some more news is that we have retaken two small villages close to Albert. According to later news the amount of Material, munitions and Prisoners taken during the offensive were , :- very large quantities of stores, 200 guns & ammunition, and 70,000 Prisoners mostly English. These figures do not show that it was such a big victory. I expected to hear that the losses of our side would easily have been three times grater, for a big move like that. \n\nDuring the week we had snow on two occasions , it has also been raining on and off during the whole week.\n","192":" and Monday the","193":" are both Public Holidays, consequently we have no work to do. I received 10 letters this morning (Monday) so I set to and answered them, Needless to say that I did not write as many as I received, I\n\nwrote one, which was the answer for everybody. \n\nDuring the afternoon of","194":" I went with two other Englishmen and a Russian, to visit another Englishman, (named Lounds) who was working at a factory where the Coffee & Meat extract cubes were made. H showed us all over the place, (which was very dirty ) and also showed us what the coffee & meat Extract was made from. The coffee was made from the refuse of Vinyards that is, the skins, storks & seeds of the grapes, after all the juice had been drawn from them & fermented. The stuff smelt awful, and fowls were walking over it and scratching it about. I didn’t drink much German coffee for a long time after that. The Meat Extract cubes were manufactured form Potato peelings and course salt.\n\nOn Sunday the","195":" Reports say that the Germans have taken three more villages 15,000 Prisoners and another 200 guns.\n\nThe weather for the past week has been fine but cold. The food as usual, bad. To-day","196":" is a little windy and cold. \n\nYesterday was slightly cold and windy, To-day Wednesday the weather is beautiful, The mornings papers to-day the","197":" that the Germans have taken two more villages from us, Also that British and Japanese troops have landed in Russia to operate against the Bolshevists. \n\nI wrote to the Red cross acknolledging the receipt of a “Personal Parcel\" from Australia. The food these times is very bad, It is getting ever scarcer, Everything here is an awful price, Cigarettes range from 10 phennings to 20 phennings, the stuff that the civilians are smoking is a mixture of the dandelion flower and some scented leaf, It smells like an Australian bush fire when smoking. Luckily I get most of what I want from England, and am to a certain extent independent of the German tack.\n\nYesterday it was 12 months since I was taken prisoner, At times it seems like twelve years, at others, Its like only so many weeks. \n\nTo-day news has come to hand that the German have started another offensive in\n\nFlanders in the region of Ypres and Armentiers, and that they have taken one or two of our strong positions, and ten thousand prisoners\n\nAnother batch of Prisoners (Russians) came to the fabrik to-day, ten in all. \n\nFor the last few days I have been studying a German Grammer book, trying to pick up a little German, But I do not make much progress. I am going to write to England for one or two books on German, and start to study the Language in my spare time.\n\nThe weather is getting much warmer now, all the frost has gone and the trees are beginning to grow their leaves again.\n\nOn Saturday I wrote to Alma granting her permission to draw my money, which she asked for. On Monday April the","198":" news came through that Armentiers had fallen into German hands. The clocks were put back one hour at midnight last night for daylight saving, It is twilight till about 9 o`clock at night. To-day I wrote to England for some books on German Grammer, I intend to study the language while I have the chance.\n\nTo-day Tuesday the","199":" the German papers say that, Count-Czernin the Austrian Minister for War has resigned. The Kaizer also commends the British troops on their great bravery shown during the German offensive. The Germans have not got their War-loan. The Government is asking the people to send Horses & carts, Irion, Zink, copper & other material, if they have no money to give.\n\nThe British Ambassador to Holland visited the camp to-day","200":" We complained about the sanitary arrangements, which were disgraceful, We also complained about working on Sundays and not being allowed time off during the week . We also showed him the state of the sleeping quarters and dining room. He made notes of all that we told him and promised to do all that it was possible to have things altered. He admitted himself that we had plenty of room for complaint.\n","201":" the Germans also claim another success close to the town of Armentiers.\n\nOn","202":" I injured my back whilst I was working, I had 6 days off from work in consequence. When I started work on Sunday I felt my back to be slightly sore, and after I was working for a while it got worse & I was absolutely powerless to do anything, I could not use my arms to put my coat on, I returned to the Barrack and got another man to go in my place. I went to the Doctor on three occasions with it the following week, he did not give me anything for it, But just looked at it for a few minutes each time. On Monday I started work, but owing to my back not being fit I was sent back to the Barracks being of no use. \n\nOn Tuesday the","203":" I went to the town of Lüneburg to do some shopping with some other Englishman, I bought a cigarette holder & case, Meerschaum pipe, tobacco-pouch, Watch & watch case, and a gold ring. About 60 marks in all. I did not manage\n\nto keep the things for long. The Cigarette holder and case, I lost soon after I bought it, The Meerschaum pipe I smoked about three times then let it fall out of my mouth & smashed it in three pieces. The tobacco pouch I tore one day when I was getting some tobacco out of it. The watch and watch case I gave to cousin Wilfred when I returned to England, And the Gold ring I left in the lavatory at St. Pancras Railway Station London.\n\nThe food has been very bad lately with the exception of a day or two when we had it fairly good. For the last two weeks the weather has been anyhow. Some days we had snow, and others it was cold & raining. The sun was to be seen on few minutes on one or two occasions.\n\nI have been in constant recipt of Red-cross parcels from Switzerland containing bread, I also have had parcels of \n\nGroceries and tinned stuff from England. letters from England and from Australia have been arriving fairly regularly.\n","204":"\n\n"}}