{"Document Name":{"0":"Diary_0385","1":"Diary_0385","2":"Diary_0385","3":"Diary_0385","4":"Diary_0385","5":"Diary_0385","6":"Diary_0385","7":"Diary_0385","8":"Diary_0385","9":"Diary_0385","10":"Diary_0385","11":"Diary_0385","12":"Diary_0385","13":"Diary_0385","14":"Diary_0385","15":"Diary_0385","16":"Diary_0385","17":"Diary_0385","18":"Diary_0385","19":"Diary_0385","20":"Diary_0385","21":"Diary_0385","22":"Diary_0385","23":"Diary_0385","24":"Diary_0385","25":"Diary_0385","26":"Diary_0385","27":"Diary_0385","28":"Diary_0385","29":"Diary_0385","30":"Diary_0385","31":"Diary_0385","32":"Diary_0385","33":"Diary_0385","34":"Diary_0385","35":"Diary_0385","36":"Diary_0385","37":"Diary_0385","38":"Diary_0385","39":"Diary_0385","40":"Diary_0385","41":"Diary_0385","42":"Diary_0385","43":"Diary_0385","44":"Diary_0385","45":"Diary_0385","46":"Diary_0385","47":"Diary_0385","48":"Diary_0385","49":"Diary_0385","50":"Diary_0385","51":"Diary_0385","52":"Diary_0385","53":"Diary_0385","54":"Diary_0385","55":"Diary_0385","56":"Diary_0385","57":"Diary_0385","58":"Diary_0385","59":"Diary_0385","60":"Diary_0385","61":"Diary_0385","62":"Diary_0385","63":"Diary_0385","64":"Diary_0385","65":"Diary_0385","66":"Diary_0385","67":"Diary_0385","68":"Diary_0385","69":"Diary_0385","70":"Diary_0385","71":"Diary_0385","72":"Diary_0385","73":"Diary_0385","74":"Diary_0385","75":"Diary_0385","76":"Diary_0385","77":"Diary_0385","78":"Diary_0385","79":"Diary_0385","80":"Diary_0385","81":"Diary_0385","82":"Diary_0385","83":"Diary_0385","84":"Diary_0385","85":"Diary_0385","86":"Diary_0385","87":"Diary_0385","88":"Diary_0385","89":"Diary_0385","90":"Diary_0385","91":"Diary_0385","92":"Diary_0385","93":"Diary_0385","94":"Diary_0385","95":"Diary_0385","96":"Diary_0385","97":"Diary_0385","98":"Diary_0385","99":"Diary_0385","100":"Diary_0385","101":"Diary_0385","102":"Diary_0385","103":"Diary_0385","104":"Diary_0385","105":"Diary_0385","106":"Diary_0385","107":"Diary_0385","108":"Diary_0385","109":"Diary_0385","110":"Diary_0385","111":"Diary_0385","112":"Diary_0385","113":"Diary_0385","114":"Diary_0385","115":"Diary_0385","116":"Diary_0385","117":"Diary_0385","118":"Diary_0385","119":"Diary_0385","120":"Diary_0385","121":"Diary_0385","122":"Diary_0385","123":"Diary_0385","124":"Diary_0385","125":"Diary_0385","126":"Diary_0385","127":"Diary_0385","128":"Diary_0385","129":"Diary_0385","130":"Diary_0385","131":"Diary_0385","132":"Diary_0385","133":"Diary_0385","134":"Diary_0385","135":"Diary_0385","136":"Diary_0385","137":"Diary_0385","138":"Diary_0385","139":"Diary_0385","140":"Diary_0385"},"Date":{"0":"unknown","1":1118.0,"2":1126.0,"3":1127.0,"4":1128.0,"5":1135.0,"6":1139.0,"7":1147.0,"8":1148.0,"9":1154.0,"10":1160.0,"11":1161.0,"12":1162.0,"13":1163.0,"14":1168.0,"15":1172.0,"16":1178.0,"17":1180.0,"18":1182.0,"19":1199.0,"20":1203.0,"21":1212.0,"22":1213.0,"23":1219.0,"24":1220.0,"25":1221.0,"26":1234.0,"27":1241.0,"28":1242.0,"29":1243.0,"30":1244.0,"31":1245.0,"32":1261.0,"33":1270.0,"34":1271.0,"35":1272.0,"36":1273.0,"37":1274.0,"38":1275.0,"39":1276.0,"40":1277.0,"41":1278.0,"42":1292.0,"43":1293.0,"44":1294.0,"45":1295.0,"46":1296.0,"47":1310.0,"48":1311.0,"49":1312.0,"50":1313.0,"51":1314.0,"52":1315.0,"53":1316.0,"54":1325.0,"55":1326.0,"56":1331.0,"57":1332.0,"58":1333.0,"59":1340.0,"60":1345.0,"61":1346.0,"62":1347.0,"63":1348.0,"64":1349.0,"65":1350.0,"66":1351.0,"67":1352.0,"68":1353.0,"69":1354.0,"70":1355.0,"71":1356.0,"72":1358.0,"73":1359.0,"74":1360.0,"75":1362.0,"76":1363.0,"77":1364.0,"78":1365.0,"79":1366.0,"80":1367.0,"81":1368.0,"82":1369.0,"83":1373.0,"84":1374.0,"85":1375.0,"86":1376.0,"87":1377.0,"88":1378.0,"89":1379.0,"90":1380.0,"91":1381.0,"92":1382.0,"93":1383.0,"94":1384.0,"95":1385.0,"96":1386.0,"97":1387.0,"98":1388.0,"99":1393.0,"100":1395.0,"101":1396.0,"102":1397.0,"103":1398.0,"104":1399.0,"105":1400.0,"106":1401.0,"107":1410.0,"108":1411.0,"109":1420.0,"110":1424.0,"111":1426.0,"112":1427.0,"113":1428.0,"114":1432.0,"115":1433.0,"116":1434.0,"117":1436.0,"118":1437.0,"119":1438.0,"120":1439.0,"121":1440.0,"122":1441.0,"123":1450.0,"124":1451.0,"125":1452.0,"126":1461.0,"127":1462.0,"128":1463.0,"129":1464.0,"130":1465.0,"131":1468.0,"132":1469.0,"133":1470.0,"134":1477.0,"135":1478.0,"136":1479.0,"137":1480.0,"138":1481.0,"139":1482.0,"140":1487.0},"Entry":{"0":"\n\n1917\n\n","1":" pm\n\nThe New Year has passed off very quietly not withstanding the fact that it is \nthe\n festive season of the year with the French as much as Christmas is with us. Everyone in the north of France is feeling the effects of the war too much for gaiety. The weather is fairly wet and cold and strong winds are very prevalent; it is not often that we see the sun. No snow has fallen since before Christmas.\n","2":" to","3":" My leave to United Kingdom\n\nLeft camp at 3.30 am on","4":" inst. (Thurs) and travelled to London via Boulogne, Calais. & Folkstone. I caught a train at Victoria Station to Wallington in Surrey, about 13 miles from London, arriving about 9.30 pm at my destination. Stayed with friends that night and caught train next morning to London. Saw the changing of the Horse Guard at Whitehall, Trafalgar Square, Bank of Eng. Mansion House, Fishmonger’s Hall etc. etc. en route to A.I.F. Headquarters where I had to report.\n\nVisited friends in the Strand and then went out to Kew Gardens via Hammersmith. Caught train to Euston Station which I left at 8.45 pm for Dublin via Holyhead & Kingston. Arrived in Ireland’s capital the following morning at 7.30. Had a good look at Sackville St. & St Stephen’s Green – both well known in connection with last year’s riots. Visited local Scout Sec. who showed me round Trinity College, Phoenix Park & the Zoo. Went for a tram ride down to Kingston. Had a walk through the streets of Dublin in the evening – plenty of light, there being no fear of zepps. On Sunday went down to Bray, a town on the coast, and went by jaunting car out to Inniskerry. Paid a short visit to Dalkey on the way back to Dublin. Had a look inside Dublin Castle. At 8 pm went down to Kingstown & caught the night boat across to Holyhead. Caught a train to Crewe and changed at Carlisle where I had a look round the snow-covered streets. Arrived in Edinburgh about noon after a long & \"snowy\" journey. Visited Scout Secs. For Scotland &\n\nEdinburgh. Went for trip down to Leith, Newhaven, & Granton. Dined twice at the Unionists Club in Princes St. Next day had a look at the Firth of Forth and its great bridge, going out to Queensferry by motor bus. In the afternoon had a good look over Edinburgh Castle and then strolled along the \"histories mile\" of streets to Holyrood Palace & Park having various places of interest pointed out to me in this ancient part of the town. Looked up a chap living out in Sth. Oswald St, came back to Edin. & then caught the 7 pm train for London. Arrived at Kings Cross Station next morning pretty early and went straight down to Wallington. Here I stayed for four days with friends and had quite a good time. Went up to London fairly often, visited the Tower, St Paul’s Cath., Westminster Abbey & Zoo. Paid hurried visits to friends at Southall, Streatham, Clerkenwell, Kew Gardens, Sheperds Bush, Bayswater & Westminster. Had a look at a couple of shows. On Saturday evening,","5":" inst. I left Wallington by the last train for London. Made an early start next\n\nmorning for Folkstone – came to Boulogne & was back to Wimereux again about 4 o’clock in the afternoon. \"When shall I see the old Country again?\"\n","6":" (11.30 am)\n\nTo-day & yesterday have been the coldest days I think I have ever experienced. Both days nights bitterly cold with the water freezing into ice everywhere. Where is our sunny New South Wales! Our tent hospital is being converted into a hutted one & shacks are being going up rapidly. Have transferred my sleeping quarters from bell tent to a hut.\n\nAm now on different work. On returning from leave was to have taken over a portion of the Hospital wards as Section Wardmaster but have gone into the Quartermaster’s stores instead and am now in charge of the Steward’s store. I only took over yesterday and it will be some days to pick up the work, which consists of the supervising of the issue of all rations etc. to patients & personnel. Have applied for a transfer to","7":" Field Ambulance, which is at present somewhere down on the Somme.\n","8":" (9.15 am)\n\nThe weather is still jolly cold but nothing like as bad as a week ago. We haven’t had a drop of rain since I came back from leave, but plenty of snow has fallen, and everything has been covered with a white mantle for the past couple of days.\n\nLast night went into Boulogne & saw \"Carmen\" (Opera) at the Théâtre Municipal. All the artistes were from the Opéra Comique of Paris.\n","9":" (11 am)\n\nAbout four days ago had a very heavy fall of snow and it is still lying on the ground. The winter sun shines brightly every day but there is no heat in it, while a cold wind often blows across the snow from the interior.\n\nHave had two letters lately from Lieut Col Upjohn. One on \"trench foot & its treatment\" and the other on \"fractures caused by shell & bullet & their treatment\".\n","10":" (9 am)\n\nThe first death in our Unit took place on\n","11":" when Lieut Col Flashman, A.A. M.C. died from pneumonia. The funeral was held yesterday afternoon in the British military portion of the little cemetery the othe side of Wimereux village. A hundred of our Officers, N.C.O.s & men turned out; six of us Sergeants acting as pall bearers.\n\nOur three weeks spell of bitterly cold, frosty weather has broken and ice & snow are now melting.\n","12":" (3 pm)\n\nHaving fairly mild weather now. Fog & rain are not as bad as cold.\n\nMy first application to go into field not as having been successful I made another attempt – this time am trying to arrange an exchange with Sgt. Freeman of","13":" Aust. Field Ambulance.\n","14":" (4 pm)\n\nOn Tuesday went on a little exploring trip down the line. Went to Dannes-Camiers station by train, walked from Dannes to St Cecile beach past the big British Machine Gun School. From St Cecile’s walked along\n\nto St Gabriel beach and then back to Camiers. Had a feed at \"l’hotél du lac\" and then along the muddy road to Dannes-Camiers. We got back to Wimereux pretty late but could only be expected when there are so very few trains carrying passengers & they never run to time. Had a two hours wait on the railway station and watched train after train rattle past loaded with guns, food, timber, firewood, shells, troops, etc. etc. What will happen during the next 2 or 3 months? The beaches soon were not very pretty. The day was dull, wet & foggy and the seaside resorts deserted of course, as it is now winter. Exploring, however in France is always very interesting.\n\nTwo Divisions of Portuguese Troops are now in France with their Base at Etaples. Saw a couple of their Officers a couple of days ago.\n","15":" (10 pm)\n\nWe are now wearing service & good conduct stripes on the left forearm. One strip for each complete twelve months service since leaving Australia provided that there is no regimental entry involving pay, on the chap’s\n\nconduct sheet during the period. I have just put up my two stripes and am wondering what kind of a zebra I shall look like if the war goes on for another 20 years!\n\nAm going strong on my new job as Staff Sgt. Steward & Senior N.C.O. under the Quartermaster. Am looking after the ordering & issuing of rations & diets to nearly 1000 of all ranks. My second applic. to get into the field has not been successful. O.C.,","16":" Field Ambulance wrote to-day saying that the N.C.O. I wanted to exchange with had already left his unit.\n","17":"\n\nWent for a bike ride yesterday afternoon through various villages & did nearly 50 kilometres. I rode from Wimereux through St. Martin, Baincthun, Fort Mahon, Wirwignes to Desvres – 20 kilometres away, passing through the great \"Foret de Boulognes\". From Desvres I went along a muddy road to the big village of Samer (6 ½ kilometres) and from there on to Wimereux through Isques, Pont de Brigues, St. Leonard & Boulogne (20 kiloms). Both Desvres\n\n& Samer are Cavalry headquarters and in practically all the little villages I passed through British cavalry billets could be seen. I saw several Australian Light Horsemen & N.Z. Mounted Rifles although did not visit the Anzac Camp.\n","18":"\n\nYesterday morning we had a visit from our G.O.C. Lieut. Gen. Birdwood. He is the right kind of Chief for chaps like ours. Is ready to have a yarn to anyone & has quite a genial disposition.\n\nHad a fall of snow last night & when we turned out on 6.15 parade this morning it was coming down thickly.\n","19":"\n\nSpring is coming. Intermingled with snow, cold, rain & sleet we are now getting sunny hours which are heartily appreciated. The big offensive is being continued vigorously on the ‘front’ & the Germans are falling back rapidly, leaving numerous villages in our hands after more than two years of occupation.\n","20":"\n\nOn Saturday night a daylight saving Bill came into force & at midnight all clocks & watches throughout France were put forward one hour. Our reveille goes at 5.45 – pretty rotten getting up so early. The evenings will be much longer now and a considerable saving of coal & lighting should be effected throughout the country as the result of the change.\n\nThe number pf patients for the last few days in Hospital has not exceeded 200. Batches are evacuated daily to be transferred by Hospital ship to England.\n","21":"\n","22":" was the anniversary of our arrival in France. Twelve months have passed since our Unit arrived at Marseilles and the time has passed wonderfully quickly notwithstanding the severe winter now slowly drawing to a close. To celebrate \"the day\" a general bust-up was held down in the village & the Sergeants had a bit of a spread and a concert last night.\n\nThe weather is very changeable and to-day hasn’t been too hot. Yesterday however we had hail, sleet & snow intermingled with downpours of rain while a strong, cold wind blew across from the interior.\n\nAbout a week ago there was a zep. raid over Dunkirk & Calais with damage to buildings & several people killed. It surprises me that we don’t get visits here from German aircraft?\n\nAbout 40 young chaps from 16 to 18 years of age, transferred from various Units in the A.I.F.; have arrived here. Although young, they seem to be good workers. I have two of them in the stores.\n","23":"\n\nA big offensive from Arras to Lens commenced the day before yesterday and we are tremendously busy. A week ago we didn’t have 300 patients in Hospital while to-day there are 1700 patients – the biggest number we have ever had. The night before last they came in\n\nin hundreds but last night & this morning beat all records. Included in our convoys were over 400 wounded German prisoners and about 50 Portuguese. Everyone has been going at full pressure – to-day I issued from my store food supplies for over two thousand men. Our accommodation is being considerably overtaxed & it has been found necessary to put the prisoners in pretty cramped quarters until they can be evacuated. These men are of a very fair type & include many from various Bavarian regiments. They have now, however, a fairly dejected appearance and the majority are covered in mud (or blood). The patients are being evacuated to the United Kingdom as quickly as possible to keep the hospital clear for fresh cases.\n","24":"\n\nThings have now quietened down a bit. After having not less than a daily total in Hospital of 1000 for more than a week we are now down to five or six hundred. All our Germans (over 500) have been evacuated not however before\n\n \n\nI was able to secure a few souvenirs. Had a couple of yarns with these Boches and have now picked up a few words of German. Struck one chap who spoke fluent French – he said he had had quite enough of the war & was quite satisfied to be a prisoner. The same day I had my first talk with some Portuguese. At first it was tremendously difficult as none of them can speak a word of English & I didn’t know a word of their language. Yesterday the last of our dark-skinned allies were transferred to their Base at Etaples & my Portuguese lessons & conversation have come to an end. For the past week I have seen a couple of them every day and with the help of a rotten grammar – (the only Port. book I could find) have made fair progress. My two friends told me all about their sunny land of Portugal – so different to the cold & wintry part they are now in.\n\nOn Sunday evening,","25":" inst went to a concert organised by the Conservatoire de Musique of Boulogne\/sud-mer. Wednesday night there was a lecture in French on the \"Effort of Alsace – \n\nLorraine, preceded by a short Alsatian play.\n","26":"\n\nFour or five days ago 5 German destroyers bombarded Calais (18 miles from us) & did some damage to the town as well as killing & wounding some of the inhabitants.\n\nYesterday was Anzac Day,","27":" anniversary of the landing of","28":" Aust. Div. at Gallipoli. In the evening saw \"La Tosca\" (French opera) at Boulogne.\n","29":"\n\nOn Wednesday we had a visit from a German taube. Just after the early morning parade had been dismissed we saw her coming – about 3500 metres away and travelling at a great speed. Two bombs were dropped – one of which exploded in an open field adjoining our hospital and about 100 yards from the nearest tent full of patients. The other one fell in a little stream about 800 yards from us and only shattered a few cottage windows with the concussion. The anti-aircraft guns from three batteries in the neighbourhood\n\nthen opened fire and puffs of white smoke high up in the air denoted the bursting of the shrapnel. However the taube got clear away and was soon lost to sight, travelling towards the German lines.\n\nWe have had a wonderful change in weather conditions. Towards the end of last month the sun made its appearance pretty often although there was no heat in it on account of the cold winds. From the","30":" of this month however, the days have been quite hot and to-day is a regular scorcher. A French \"scorcher\" I mean. Have really forgotten what Australian hot weather is like.\n\nPatients are coming in fairly briskly and we have had between 600 & 1000 remaining in hospital daily since the beginning of the month.\n\nFailing to get a N.C.O. in the field to exchange with me. I put in for a transfer to one of the Ambulances now being formed in a new Australian","31":" Division.\n","32":"\n\nThe weather is continuing mild so that with the long days, everything is rather pleasant although somewhat tame. Yesterday I had my first swim of the season off Wimereux beach and found it pretty good. The countryside is now very pretty – everything is a mass of green. Sunny France is coming into its own!\n\nTrainloads of Australian troops have been passing our place for the last couple of days, evidently all coming off the Somme and going up to the Armentieres front. Perhaps for a big push in the direction of Lille. Personne no sait.\n\nThe French civilians in this locality are feeling the effects of the war pretty keenly. Sugar & potatoes are doled out on the presentation of cards and flour is so scarce that bread cannot be obtained some days. The army rations has been reduced but supplies still appear to be fairly plentiful.\n","33":"\n\nFirst saw American Troops arriving in France last night. They arrived at Boulogne and probably belong to a Medical Unit – all were young men & in brand new uniforms.\n\nHad a yarn to a French-Canadian yesterday who didn’t speak a word of English. He was born in Quebec and was now in France for the first time – he said he wasn’t anxious to stay in France and would be quite satisfied to get back to Canada. Exped. Force entirely comprised of French-Canadians and all French speaking Canadians that now come over reinforce the Battalion.\n","34":"\n\nOn Monday went down to Abbeville, a town on the river Somme about a third of the way to Paris from here. Left camp about 6 am on a fine bright sunny morning and walked to Boulogne railway station about 6 kilometres away, armed with the necessary permit authorising \n\n \n","35":" to travel by train. Left at 7.30 am and arrived at Abbeville three hours later after a very fine journey. France is now at its best and this short trip brought back memories of our journey from the south of France to the north in June last. All the fields & woods so wonderfully fresh & green. There is indeed a striking contrast between a French summer and winter. Our long train for the most part full of French \"poilus\" going on leave, stayed for some little time at Etaples where the Australian & New Zealand Base Depots used to be (now moved to Le Havre, and where big gangs of German prisoners were at work on the railway. On arriving at my destination I walked through the town and out to the","36":" Aust. Gen Hospital which only arrived from England a few weeks ago. The hospital consisting mostly of tents is in a large field adjoining","37":" South African Gen Hospital & No 2 Bat Stat. Hospital. I found numerous friends here and after having a yarn to them & a look round the place, had a short visit to the Sth. Africans and then\n\nwent for a walk round Abbeville. The town (of L. of C.) is not very large and has a population of about 20,000. I first had a look at the fine old Cathedrale (l’eglise Saint-Vulfran) and then went along the bank of the Somme for some distance. The river looked very pretty – a shady walk runs along both banks – the tall leafy trees keeping one well protected from the sun’s rays. I passed a number of Hospital barges just outside the town – they had evidently just brought a cargo of wounded down the Somme & would probably be going up for more. The waterways of France have been very useful in relieving the strain on the railways. Left again for Wimereux at 8 pm and arrived back 3 ½ hrs. later. \n\nIn the train I had quite a long yarn to French officer returning from leave to Paris, to the French front in Belgium. He shares the opinion of all French people and that is that the war will not be over for some considerable time & this officer said that we still had three\n\nyears to go. Things certainly aren’t moving very fast but we have great hopes of the approaching offensive in the north doing something.\n\nReturning again to the beauties of the coastline – several kilometres behind our camp lies the valley of De Nacre with its shaded glens, thick foliage, running stream & grassy meadows – truly a splendid piece of country.\n\nI have succeeded in finding a Sergeant of the","38":" Field Ambulance who is willing to exchange with me and as the Officers Commanding both units have agreed to the exchange, it is now necessary for the approval of the G.O.C., A.I.F. to be obtained.\n","39":"\n\nOn Friday we had a visit from G.O.C. Lieut. Gen. Sir R.W. Birdwood He stayed the night and went off again next day.\n\nPlenty of patients in hospital. Yesterday we had 1450 & to-day 1250 – admissions averaging about 300 a day.\n\nThe following is an abstract from a Southern French paper and gives an inkling of how much more the Aust. & N.Z. Troops are admired than the English by the French.\n\nIt is taken from an article (by a French writer) on the British Armies.\n\n\"Enfin, il y a les volontaines des colonies, Canada, Australie et Nouvelle Zelander: Plusieurs centaines de mille hommes. On les voit maintenant en tête de troupes de choc, des corps d’élite. Les officers gentlemen de la neille Angleterre n’avaient pas rependant, tait d’abord, gouts leur manière de concevoir la discipline.\n\nJamais un ANZAC – un homme de l’A.N.Z.A.C. AUSTRALIAN AND NEW ZEALAND ARMY CORPS – ne salue un chef, même du grade le plus élevé, s’ol le rencontre sur son chemin. Ce sont de purs démocrats, qui considèrent avec les officers sont du même gendre que celles qu’ils avaient avec leurs patrons à l’usine ou aux champs. On obéit à ceux-oi pour le travail; on n’a plus\n\nà les connaître une fois le travail terminé. Ceci a commencé par paraitre assey choquant au commandement anglais qui fait régner parmi les troupes en Angleterre des usages tout differents non seulement le soldat doit dire \"sir\" en s’adressant à un officer, le \"sir\" impliquant une idée de vassalite. Main guard on a ni les services que les Anzacs rendirent sur les champs de bataille, on n’a plus pense à insister sur ces marques exterieuses de respect!\"\n\nThe article concludes with the following paragraph relating to marriages between our chaps and French girls:-\n\n\"Le charme des femmes françaises, aussi! Il s’est contracté déjà pas mal de marriages, devant le maires et le airé Mais une question se pose, que je n’ai pu résoundre. Est ce le colonial anglais qui sectora en France ou sa femme qui accompyne au delà des mers? Dans le premier cas, ice serait un gain de population. Mais dans le second?....\"\n\n(Pierre Mille)\n\nIt is becoming increasingly difficult to get real Australian uniforms & equipment now. There is no doubt that the men in the A.I.F. leaving Australia are the best equipped troops in the war. But now everything is being made in England and the quality is nothing like the same. Our boots & riding breeches are of \"Tommy\" pattern and the hats & tunics are of poor quality. Those chaps who have real Australian stuff hang on to it like grim death. We are very proud of our distinctive uniform. The Canadians, South Africans & Newfoundlanders wear the same uniforms as the \"tommies\" with their own badges.\n\nMy exchange with a Sergt. Of the 14th Field Amb. Has been approved and on Wednesday afternoon I went through the gas course with box helmet & P.H. prior to going up the line.\n\nWe had a lecture about gas & helmets, helmet drill and about 10 minutes in the tir gas itself.\n\nSunday 17th June, 1917\n\nSaid farewell to No 2 G.H. and Himmend\n\non Friday night, 15th inst. and climbed on board a troop train which left Central Station Boulogne, at 10 pm bound for an unknown destination. At half past twelve we arrived at Etaples and two hours later at Amiens – from here the train ran on in the direction of the line (front) and the difference in the country became noticeable. The fields were practically uncultivated, old trenches & earthworks could be seen and military camps were frequently passed. The train rattled on over shaky old lines and came to a stop on a siding. Then came the order – all Australians out of the train; we hopped out on to the line and walked for a few hundred yards where after a short wait, we mounted another train and continued the journey. It soon became evident that we were approaching the area occupied by the Australians. The train passed numerous villages & isolated farms full of our chaps – all in billets. At 7 am we steamed into Albert, the town in the Somme Department\n\none occupied by the Germans and bombarded by them continuously for some time after they were forced to evacuate it. The Field Ambulance I was going to join (14th) is in the 5th Aust. Division which is at present out of the line and the Units of which are billeted in villages round Albert. The station (much marred by Fritz’s shells) was full of Troops and I managed to discover a 15th F. Amb. Corporal returning from leave to England who told me in which direction I should have to go to find my Unit.\n\nLoaded up with my kit and not feeling too fresh after a sleepless night spent in a small wooden box car of a troop train I tramped through Albert on a jolly hot summers morning. The town was practically empty as far as civilians were concerned. I passed house after house completely or partly demolished by shellfire. But the worse sight of all was the great Cathedral with its tall domes which acts as a landmark for miles around. The great building was only a shell – only the best part of the\n\nwalls standing. The big bronze figure on the top of the tower had evidently been hit by a shell and was hanging head downwards. Portion of the tower had been blown away.\n\nI passed through the devastated town and made for the village of Aveluy, two and a half kilometres away where the 14th Field was running a scabies hospital. About half a mile out of town I met a section of a Field Ambulance on the march. It was ‘C’ section of my unit leaving Aveluy for another village. I arrived at Aveluy in due course and found the Unit or at least one Section of it, quartered in a fine old château with the river Ancre running far below it and a fine big lake in front.\n\nHere I found a score of great hustle and activity – the Unit was moving out that afternoon to Warloy, a village twelve kilometres away. I handed in my papers to the O.C. who informed me that I was posted for duty to ‘B’ Section of the Ambulance as Orderly Room Sergeant. B Section was then at Pozieres but was\n\ncoming down that afternoon to Warloy. I was instructed to march out at 2 pm with A Section and report to B Section on arrival at Warloy. I had a swim in the river and a look round the place (& very nice too). We fell in at 2 pm and marched out with full pack up, water bottle filled, ration, gas helmets, blanket & sheeting, etc., bound for Warloy a full twelve kilometres away. We did it alright but it was a bit of a stingers in the blazing sun. Four men had to drop out from exhaustion on the way and were picked up by an Ambulance. On arrival at Warloy we found it full of infantry belonging to our Brigade (the 14th). \n\nThe place we were taking over. 5th Div. Rest Station, was in the pretty grounds of an old house. C Section had taken over during the morning and A & B Sections arrived together, the latter section marching down from Pozieres. The work here does not appear to be strenuous just\n\nat present. Sick are admitted from the various battalions in the neighbourhood and evacuated by horse & motor ambulance to Casualty Clearing Stations. The heat is pretty solid and much more trying than at Wimereux. Was forgetting to mention that at the back of the Scabies Hospital at Aveluy the side of the hill is full of dug outs used some time ago by the British.\n\nTuesday, 19th June 1917\n\nYesterday took a prisoner & escort out to No 56 Brit Cas Clearing Station at Edgehill about 12 to 14 kilometres from Warloy and near the village of Dernancourt on the Ancre. We went by motor ambulance, through fertile undulating country past rusty bark wire entanglements and old trenches and dug outs.\n\nHave taken charge of the Admitting of patients. Men are received either direct from Units or transferred from other Field Ambulances. If they are likely to be ready for duty in a few days they are kept at the Rest Station and then\n\ndischarged to duty. Worse cases are sent to Casualty Clearing Stations.\n\nThis afternoon walked over to Henencourt, a village 3 ½ klms away where the 1st Field Amb is at present. Met several old friends here, in fact am meeting chaps I know everywhere. The sector is full of Australians – the villages for miles around are full of our chaps and there are very few tommies about; quite a change after Wimereux. Heard that the 5th Inf. Battalion was in Henencourt Wood and went round to see a couple of cobbers, the battalion was away however on a bivouac. \n\nThe 3rd & 4th Aust Divisions are at present up north in the Armentieres district. The 1st & 5th Divn are resting in the district where we are now while the 2nd Div is up in reserve behind this (the Somme) front!\n","40":"\n\nYesterday evening borrowed a horse from Transport Sergt of ‘B’ Section and went for a ride through Baizieux, Bresle, & Ribement to Buire. The \n\n1st Brigade is billeted in this village & I met several chaps I hadn’t seen for ages. After a short visit to the","41":" F. Amb. Which is in the vicinity we went on to Lavieville to Henecourt through the pretty Henecourt Wood and back to Warloy. We had a regular torrential downpour of rain near Buire which left the roads in a fairly muddy condition.\n\nThe life here in the field is totally different from that down at the Base with the Hospital. I have spoken to very few French people since coming up & then only to villagers and French gendarmes. While at Wimereux I used to go to at least one opera performance or musical concert per month in the Theatre Municipal Boulogne and also attended several lectures in the same Theatre arranged by the \"Societe de geographic\".\n","42":" 1917\"\n\nBought some postcards in the village yesterday of Warloy and other villages in the war area. I intend to keep on getting as many photos\n\nas I can of places we go to and send them home – if I can get them past the Censor. It is strictly forbidden to use the French civil post for anything in the postal line but it can be done all the same.\n","43":"\n\nYesterday afternoon went with some patients to No 9 Brit. Cas Cl Stn, Aveluy in motor ambulances. Went through Bouzincourt to Aveluy then to Albert and back to Warley through Millencourt & Henencourt.\n\nWent for a stroll after tea to the next village (Vadencourt, 2.3 kiloms.) and then on to Contay (.8 kilom.). The road was very pretty being bordered with poppies & cornflowers as well as little white, pink and red flowers. Contay is very picturesque little village in which a couple of battalions of Australians are billeted. The fields are full of rusty barb wire entanglements and gun pits have been dug at intervals along the roadside. I passed one trench in good condition with steps leading down to a large dugout.\n","44":" 1917:-\n\nYesterday afternoon in order to have a look at some of the damage done by the Germans, went for a bike ride through Albert & Pozieres to Bapaume and back. Left Warley ay 1.30 pm & rode through Lavieville into Albert (10 kiloms). After traversing the town I gained the Pozieres-Baupaume road and soon arrived at Pozieres or at least what was left of it. There were numerous overturned tanks lying on both sides of the road and plenty of old steel helmets, barbed wire, equipment etc. Two large memorial crosses had been erected – one to those of the 1st Div and the other to the","45":" Div who fell at Pozieres ridge. The country side was dotted with small white crosses with a small cemetery here and there. The country right from Albert to Baupaume (19 kilom.) is a dreary waste containing a few shattered tree stumps. Entering Baupaume the road is lined on both sides by trees which have been badly knocked about. About 5 kiloms this side of Baupaume I went through the vullage of Le Sara with every building absolutely shattered to pieces. Confused\n\nheaps of wood & stone were all that remained. I saw the same thing only on a much larger scale on riding into Baupaume. The town which is fairly large, is nothing but great stacks of shattered masonry intersected by streets. I went round to Grevillers a couple of kilometres away where No 3 Aust Cas Clearing Stn is situated together with 2 other Brit C. C. Ss. Visited a friend here and then did my thirty kilometre ride back to Warley where I arrived at 8.30 pm.\n\nBetween Grevillers & Baupaume I saw an aerial combat in the distance. There were numerous machines up, also 3 or 4 captive balloons observing. The road from Albert to Baupaume is in good condition and was alive with traffic – ambulances, lorries, carts, horses. Motor bikes, push bikes, motor cars, etc.\n","46":" :-\n\nThe villages where we are running our Div Rest Station is only about 20 kiloms. from Amiens and the G.O.C. has authorised 10% leave every second day to the town. I paid\n\nmy first visit to Amiens yesterday (had been through in the train twice before). Got a ride in an ambulance to the nearest railway station Mericourt-Ribemont (6 kiloms) and arrived at the fine Gare du Nord at Amiens about 10 am. Had a good look round and left again by train at 8 pm. Amiens is a fine large town with broad streets and a good tramway service. It reminds one very much of Paris only on a smaller scale of course. The people speak good French and dress well – Parisian style.\n\nI visited the splendid Cathedral – one of the finest in France and well worth seeing. Amiens does not boast of many interesting features from a spectacular point of view. I had a glimpse at the old city ( Amiens), Hotel Dieu, Hotel des Postes, Hotel de Ville, Eglise Saint Leu. The Picardy Museum was closed so I did not see it. There are numerous French Military Hospitals about probably the finest of which is the one established in the Palais de Justice. Amiens was in possession of the German forces","47":" to","48":"\n\n \n\nFriday 29th June 1917:-\n\nFor the past three days have been finding plenty of work to keep me going. My predecessor let things slide a bit and I have been bust bringing them up to scratch. The weather has been very changeable. It is sometimes hot & sunny, then cold & cloudy with a downpour of rain now & again.\n\nA couple of evenings ago went to a little picture show rigged up in an old barn in the village by the Aust Comforts Fund.\n\nLast night had a visit from a couple of chaps who used to belong to No 2 A.G.H. & transferred to A.Y.C. Detail, 5th Inf Battalion. We were talking over old times for quite a long time.\n\nMonday, 2nd July 1917:-\n\nYesterday went for a stroll through the little cemetery at Wurley. After passing the graves of various inhabitants of the village who had died there, I came to the portion containing those of numerous British & Australian Troops\n\nwho had fallen. Some of the wooden crosses erected are the work of thoughtful friends. In one case the deceased soldier’s hat had been placed on the grave and on numerous others his metal badges & cloth shoulder patches had been affixed to the cross. I looked for names I knew and came across one – \n\nNo 1346, L\/C A. Fry, 13th Inf. Bn. A.I.F. \n\nLindfield N.S.W. Aust.\n\nDied of wounds, 14.3.16\n\nI used to go to school with him once. And by a curious coincidence I met a chap from Lindfield (Wynne, Gladstone Parade) who knew Allen Fry and I showed him the grave.\n\nWed 4th July 1917\n\nWent for a walk yesterday evening over to Varennes, 4 ½ kiloms. along a white road bordered by well cultivated fields in which old men & women were working industriously while all the able-bodied men are away fighting in the French sectors. The wheat & oats are ripening\n\nfast and should be ready for gathering. Varennes is only a small village of the usual French type with an old church as its only prominent building.\n","49":"\n\nYesterday morning the Ambulance was inspected by our G.O.C. Lt Gen Sir R. Birdwood who seemed satisfied with the turnout of men, transport and ambulances. Birdy gave a bit of a speech in which he stated that he could hold out no hope of an early termination of the war.\n\nThis afternoon I managed to get into Amiens with a carload of patients. We went through the villages of Vadoncourt, Contay, Heressart, Rubenpec. Pierregot, Raineville and then through the barrier into the city. Coming back, we started out along the fine Boulevard Alsace Lorraine on to the Albert Road and passed 1st Anzac Headquarters situated in a beautiful château in splendid grounds. Turning off the Almiens-Albert-Baupaume Road we went through Ribemont & Buire to the 56th Brit Cas Clearing\n\nStation at Edgehill. Here we deposited some patients and came back to Warley through Buire, Ribemont & Baizieux.\n\nHave been in all the villages in the district where we are. Went for a walk the other afternoon through Senlis and Hedauville back to Warloy-Baillon a distance of 14 kilometres.\n\nFriday, 13th July 1917\n\nYesterday the 5th Aust. Division held a grand Assault-at-arms near Henencourt Wood when the King was present. With two other chaps from out transport, rode over on our horses to have a look at \"Georgie\". The displays went off very well, especially that of the Field Artillery. The King was there with Birdie and numerous other heads. He stayed about ¾ hour and I got several good looks at him. The winkles in his face and his beard turning grey show that he is no longer a young or even middle-aged man.\n","50":" 1917:-\n\nOn Tuesday afternoon two of us rode over on horses to 5th Div Headqrs at Rulempre. The distance was about 11 kiloms. each way.\n\nThe same evening B Section of the Ambulance got orders to leave next morning on a two days stunt to Corbie (on the Somme). We marched out next morning at 8.30 with packs up and arrived at our destination, about 12 kiloms. away, by dinner time. Our billets were right in the centre of the town in a big deserted Château. We immediately opened up a small hospital and the Section went down to the river for pontoon work with the 14th Brigade, returning to billets a couple of hours later. I had a good look round Corbie which is a small town on the Somme with a population of about 4500. There are a couple of fine churches, one dating back to the","51":" or","52":" century. There is a very pretty walk for some distance along the river bank. We marched back to Warley the following morning, passing the","53":" Brigade on its way to go through the same stunt. We came through the villages of Les-pres Bonnay, \n\nBonnay, Franvillers & Baizieux.\n","54":"\n\nWent into Amiens on Sunday – seven kiloms in a motor amb. to a little railway station, and then 26 kilom. by train to the town. Went straight to an \"Etablisemont’ de Bains\" and had my first hot bath for over six weeks. Not bad either! (I didn’t say \nfirst bath\n). Spent the afternoon with the Eclaireurs Unionistes – French Boy Scouts belonging to the French Protestant Church. The Protestants are very few in number in France, nearly everyone being Roman Catholic. Their Church Service is all in French – no Latin at all. There are two Scout organisations in France – the official one being the Scouts of France (les Eclairians de France) anf the other the Unionist Scouts (les Eclaireurs Unionistes) formed in connection with the Protestant Church. Old Amiens is full of canals running off from the river Somme which passes through the town. Outside the town is the marshy district where market gardening is carried on by the inhabitants. The\n\nground is divided into little allotments by small canals & waterways upon which there are small boats, much resembling Italian gondolas. Picardie embraces the Somme region and all the inhabitants speak the Picard Patios (an old Roman dialect) as well as French. This is particularly noticeable out in the villages where we are, where the country people always use the Patios when speaking among themselves\n","55":"\n\nDuring the week ending","56":" we evacuated all our patients to C. Cl. Stns and loaded our waggons prior to moving north. At 5.30 pm on the","57":" we moved out of Warley-Baillon & marched 12 kilometres through Vadencourt & Tourencourt to Puchevillers where the Ambulance entrained together with 56th Inf Bn. & left at midnight. We travelled","58":" class of course, in other words in cattle trucks on the sides of which were written in French \"8 horses or 40 men\", I dossed in a truck with 8 horses & 2 drivers. The train arrived at Arques about 9 am and here the Ambulance detrained and marched\n\noff to the village of Ebblinghem (dept du Nord) twelve kiloms away. Immediately on arrival a small clearing hospital was established in some old farm buildings on the other side of the village and the Unit accommodated in various billets in the vicinity. We got some food during the afternoon and it was appreciated too after a \"light supper\" of bully beef & hard biscuits (Anzac wafers!) the night before and no breakfast nor dinner the following day. Soon after our arrival the rain started to come down pretty heavily and now on the third day here it is still raining. Everything is mud & slush and summer(?) too! Oh! Sunny France, where art thou? We are 9 kilms. From the town of Hazebrouck and in the evening of our arrival the Germans started to put shells into it, fired from long range, and kept it up right through the night. The Hospital in Hazebrouck immediately cleared out all their patients and we had to cease evacuating there. French civilians came streaming out along the roads and we gave up our blankets to 7 women & children who were accommodated in the little farm where my\n\nbillet is. The country people in the locality are quite different from those on the Somme. We are now in Flanders and about 30 kiloms. from the Belgian frontiers. The people are very fair in appearance and all speak the guttural Flemish language (& probably German also) in addition to French which is never used when speaking among themselves – in fact I believe that many old people cannot speak French at all. With a mixed Belgian, Flemish & French population there are plenty of spies about and captures often take place among the civilians. At present I am in charge of the admitting & evacuating of all sick from surrounding Units – we are too far back to get wounded. Yesterday took a convoy of patients over to Arques & St Omer. The last time I was on St Omer was when I biked over from No 2 G. H. at Winereux – 54 kilometres by road.\n","59":" 1917:-\n\nAfter 4 days continuos rain & slush the weather cleared up. This was fortunate for us as the following day the","60":" Brigade marched out\n\non a 5 days instructional stunt – A & B Sections of our Ambulance went out to. Instead of having to march the 28 kilometres to our destination, we were taken in big buses and went through Arques, skirted St Omer, through Wizernes & Halines to Lumbres on the river Aa. On Tuesday and today the battalions of the Brigade have gone through various battle practices and our stretcher bearers went with them. The tent sub-divisions are running an evacuation station for the clearing of the Brigade sick. We are all billetted in Lumbres and very comfortable too. We are allowed to find our own billets & two of us have struck a very decent little joint where we are very comfortable – the owner of the house is a French railway employee and lives there with his wife and three small children. The most comfortable quarters I have had since being on leave in U. King. \n\nLumbres is a very pretty village situated in a fertile valley with the river running through it. There are very few troops here and the place is not too bad. It is wonderful what a difference a\n\nfew thousand Australians make to a village. Our Brigade Units are billetted in various villages in the surrounding district. This afternoon I went for a walk up the valley, going through several pretty little villages in which a number of Portuguese Troops in their grey uniforms were billetted. I crossed the river and climbed up the side of the mountain and walked along the crest through thick undergrowth and a forest of young trees. On getting opposite Lumbres I looked down on the village below, nestling in the fertile valley. \n\nChateaux with railway line and a couple of factories, nade a very pretty picture. On the other side of the town, running across country like a white ribbon, was the road to Boulognes – 38 kilometres distant.\n","61":"\n\nOn Thursday the whole Brigade went through battle practice including bush fighting, bombing, etc. The troops advanced over\n\nwhole fields of rope wheat and other crops but the farmers are recompensed by the military for the damage done. Got a slight attack of trench fever (?) the night before with pains in the leg, intense thirst, feverish headache and cramping pain in the abdomen. Did not go out with the Ambulance the following day and spent my time alternatively lying down and drinking hot milk at a nearby farm. Left Lumbres the following day and taken about 14 kiloms. in motor lorries to Arques. From here we marched another 14 kiloms. (without packs) to rejoin A Section where we had left them at Ebblinghem. \n\nToday has been fine and very suitable for air activity. Dozens of planes have been passing overhead.\n","62":" 1917:-\n\nVery peculiar weather. Fairly fine days but sudden storms every now & again with heavy dumps of rain.\n\nFrom the northern newspaper \"Le Eelegrammes\" I see that the Boulogne\n\nMunicipal Food supply is selling goods fairly cheaply to the people :- eggs 25 centimes; potatoes 20 cents per kilo; butter 3fr 30 per kilo. The sugar cards are still in use in Bouligne enabling the population to buy 500 grammes or ½ kilo per head per month. (a lb sugar per month),\n\nThe strength of the Portuguese Army in France is now estimated at 60,000 although no-one ever hears of them doing anything. I don’t think anyone has much time for the Portuguese.\n\nThe Russians are still retreating under the German pressure. The country must be completely demoralised. Notwithstanding the comparatively fine weather the British are making no progress in the north. Is the war going to continue for another three years?\n","63":"\n\nWe are about 8 or 9 kiloms from Hazebrouck a fair sized town 28 kiloms from the front\n\nline. To-day has been fine and the Germans have taken advantage of this fine weather to fire a few of their long range guns and several big shells lobbed in Hazebrouck this afternoon. This is the third time the town has been bombarded since we arrived at Ebbinghem.\n\nHave just done 4 days general duty as orderly Sergeant and was out on company drill this afternoon. A chap isn’t always sitting down when he has a clerks job as a Field Ambulance.\n","64":" 1917:-\n\nI have just been watching a taube that came over us. The anti-aircraft guns have been firing at it and filling the air with white puffs of shrapnel smoke but the machine disappeared in the clouds. The sky is a lovely blue to-day with big white fleecy clouds everywhere. There is a fine breeze blowing just as if one was back at the old Hospital on the cliffs.\n\nThe country is looking fine to-day. The hedges\n\nare so green and the fields either full of ripe, waving wheat or covered with soft fresh grass. We are occupying some old farm buildings and on the other side of the surrounding hedge is a little forest intersected by narrow footpaths. Yesterday I gathered a few blackberries from the thickets in the little wood and also from nearby hedges, but they were not like Australian blackberries.\n\nOur tumbledown old farm is owned by Belgians – uncouth old people who only speak Flemish. There are numerous small, dirty children – these speak French as well as Flemish. The latter language is only a mixture of German & Dutch – a horrible jargon.\n\nI have just had a book lent to me by a chap – \"It happened in Egypt\" and now I am back again at Alexandria, out by the old Sphinx, on the dry old desert etc! Egypt never exercised that spell over me that seems to grip some people, but it is very interesting to read books about the country after fourteen months in the land of the Pharaohs. I only had a letter\n\nthe day before yesterday from a chap in the A.I.F. who is still in Egypt. We used to roam round together until he went over to Mudros. I saw him down on the old battleground of Tel-el-Kebir early in 1916, just before leaving for France.\n","65":" 1917:-\n\nThe last couple of nights have watched the taubes over Hazebrouck. The sky has been lit up with searchlights, flares, star-shells & bursting shrapnel with the boom, boom of anti-aircraft guns. I reckon the old town is doomed unless the Germans can be driven back. Yesterday evening went for a walk over to the next village, a quiet little place called Staples. The distance is 3 kilometres along a very pretty, winding road.\n\nTuesd. 21st Aug. 1917:-\n\nYesterday afternoon went to Arques & St Omer with patients (12 or 13 kiloms). Spent a couple of hours in St Omer – went for a walk through the pretty Public Gardens and also had a good look inside\n\nthe old Cathedral. In the evening had to take a patient from Ebbinghem to an Officers’ Rest Home at La Motte 15 kiloms. away in the opposite direction to St Omer. We went through Hazebrouck, which the taubes came over every night now, and saw a few shattered houses, and windows covered with sandbags. La Motté is only 5 kiloms the other side of Hazebrouck and the Rest Station is a fine French Château situated in beautiful grounds with a great, green park covering several acres. The place is run by Aust. & New Zealand A.M.C. personnel of 2nd Anzac Corps. We returned to","66":" Field Amb. by the way we came. Through Nieppe Forest along the road bordered by tall poplars into Hazebrouck where the people were sitting outside their houses, gazing up into the sky, waiting for the taubes to appear and the anti-aircraft guns to open fire (which they did an hour later). On the road the other side of Hazebrouck we passed numbers of people leaving the town and tramping out into the country carrying their belongings with them and pulling handcarts. The taubes came over for the fourth night in succession – over Hazebrouck & Aires. We are getting quite accustomed to turning in while the shrapnel plays a merry tune.\n\nFriday 24th Aug. 1917:-\n\nThe number of enemy subjects in Australia at the present time is 3,600.\n\nThe N.S.W. Govt. Statistician has issued a statement showing that the increase in the price of meat is 58.8% and of groceries 22.2% since","67":"\n\nGreat Britain paid over £24,000,000 for the Aust. Wool clip of 1916-17. Acting on representations from the growers, Aust. Is now offering to sell to the Imperial Govt. about 120,000 cases of dried apples at 7d. per lb. Out of 53,804,000 bags of wheat in the 1915-16 pool, 26,403,000 bags had been shipped up to","68":" The stock held by shipping agents totalled 11,484,000 bags, and the stock held by millers 1,034,000 on","69":"\n\nOn","70":" last it was 1000 days since the","71":" Aust. & New Zealand convoy for the war in Europe, left the last Australian port. The convoy consisted of 1 Aust. Div., 1 Aust. L.H. Brigade, 1 N.Z. Inf. Brigade & 1 N.Z. Mtd. Rifle Brigade.\n\nThe \"six bob a day tourists\" like spending money. The cabling of money by relatives in Australia to soldiers abroad has assumed alarming proportions, remittances aggigating something like £5,000 daily.\n\n2,000 Australian Nurses are serving abroad.\n\nSince August 1914, 43,487 horses have been supplied to the A.I.F. of which 40,265 were purchased at an average cost of £20 per head. The great majority of these horses have been shipped overseas.\n\nThe population of Australia on","72":" was 4,895,124. There are 1½ persons to each square mile.\n\nThe number of Aust prisoners in Germany is 1,743 and in Turkey, 98.\n\nAbove information is taken from the \"Anzac Bulletin\" issued to members of the Australian Military & Naval Forces in Great Britain, France and elsewhere.\n","73":" 1917:-\n\nLast night went over to","74":" Field Ambulance at present at Sercus. We went through Wallon-Cappel to Sercus and back to Ebblinghem via Hazebrouck & Wallon-Cappel.\n","75":" 1917:-\n\nYesterday the G.O.C. in C., Field Marshall Sir Douglas Haig inspected our Division and seem satisfied with the turnout. An Australian Division\n\ndrawn up in review order looks pretty well.\n\nFoodstuff seem to be pretty dear in that part of France occupied by the Germans, judging from the following prices that were prevailing last month in the Lille-Tourcoing-Roubaix district. Bread 3 fr. 50, flour 6 to 8 frs. (12 frs at Lille); wheat 7 fr 50; rice 10 frs, potatoes 4 frs 50; meat not obtainable (last sold at 20 frs.). sugar 16 fr 50. All these prices are per kilo (equals 2","76":" lbs).\n","77":" 1917:-\n\nA tremendous storm raged over the north of France on Tuesday & Wednesday and it is still wet and windy to-day. A lot of damage has been done to property, crops & fruit trees, especially in the Channel coastal towns. The best part of the old fort about 300 yards out from Wimereux plage, was demolished and a three-masted English sailing ship drifted on the same beach and became a total wreck. We, of course, are out in the country where less damages has been done, but there is no doubt that the fruit and cereal\n\ncrops will be greatly diminished on account of the bad weather.\n","78":" 1917:-\n\nWent into St Omer yesterday afternoon by motor ambulance. The town was crowded with Troops, for the most part Australians of the 2nd, 3rd & 5th Divisions. It seemed as if half the male population of Australia was there. All the Divisions of 1st & 2nd Anzac Corps are now out of the line. During the afternoon went for a walk through the Gardens thronged with troops on leave for the day, patients in blue suits from nearby military hospitals, a few Army Nurses (Australian & English), brown uniformed girls of the Women’s Aux. Army Corps, and French civilians in small numbers. We then made a tour of inspection over the Museum and after effecting several necessary purchases went for a long walk down the rue de Dunkerque, crossed the canal which links up St Omer with Calais and the North Sea, passed the fine Railway Station & the ruins of the old St Bortin Church, and returned to the centre of the town by the rue Carnot. The town of St Omer\n\nhas, I believe, a population of from 20 to 30 thousand and lies on a plain surrounded by rising hills. I noticed a new style of feminin headgear – a felt hat with rather narrow brim, evidently on the lines of the Australian, New Zealand and American slouch hats.\n\nThe six Brigades of our","79":" & 5th Divisions appear to all be in and around villages to the south of St Omer, plus the 12th Brigade","80":" Div) which has just arrived from the Messines district where the 1st Div & the other 2 Brigs of the 4th Div are.\n\nThe three Brigades of the 3rd Div. are lying to the north of St Omer. All are out of the line.\n","81":" 1917:-\n\nLast week commencing with the new moon on Sunday night 2nd inst. the enemy carried out a review of taube raids over the various towns in the north of France. Boulogne was raided three nights in succession and numerous bombs & aerial torpedos were dropped, killing 10 civilians, wounding many more others and damaging houses. Calais, Dunkirk & St Omer also received raids nightly as did towns on the English Coast. The raids had evidently been carefully planned and were carried\n\nout simultaneously each night, a number of deaths & an amount of damage resulting from each. In addition to the aerial torpedoes & bombs there were also dropped into the town boxes of poisoned chocolates, cakes containing infectious germs & imitation English lead pencils of an explosive nature. \n\nAt Marquise, a big village about 11 kiloms. from Boulogne in the direction of Calais a bomb killed 39 German prisoners & wounded 43 other boches, not bad! The anti-aircraft guns put up continuous barrages but only one machine was brought down as far as I know (others have since been brought down). We are at present situated about 13 kiloms. from St Omer & 9 from Hazebrouck and I had a good view of the searchlights & flashes from bursting shrapnel. The roar from exploding bombs & anti-aircraft barrage fire was continuous for hours. Several taubes passed over us – we knew them by the sound of the engines. The boches didn’t bother much about villages, scattered farmhouses & open country. The days have been fine & sunny lately, and odd German machines keep coming over – taking advantage of the fine weather.\n\nThe Australian batteries of Artillery have been in the line for some weeks past in the vicinity of\n\nYpres and have been getting a pretty rough passage. The","82":" Div. Artillery came out two or three days ago and is now resting in and around the village of St Momelin, , 4 kiloms. the other side of St Omer","83":" &","84":" F.A.O’s, 5th D.A.C. &","85":" A.S.C.). Went out there yesterday collecting sick from the batteries, etc. Going from St Omer to St Momelin we ran for some distance along the canal running to Gravelines & the sea. We followed along a kind of quay with the canal full of slowly moving barges on the right and small, huddled up dwellings on the left. This scene must resemble many in Holland & Belgium. \n\nDotted about all over France, even in the smallest villages, are splendid châteaux often surrounded by pretty gardens & parks which are however usually in an unkept state. These fine buildings are often secured for staff, Divisional, Brigade Headquarters, etc. The Ambulance has usually to be satisfied with old farm buildings more or less in tumbledown condition, & tents.\n","86":" 1917:-\n\nOn Sunday, 16th, we got moving orders so struck\n\ntents and loaded waggons for a start next morning. We left Ebblinghem at 9.30 am next day and joined our Brigade on the main Hazebrouck road. The Units marching out were the 53rd, 54th, 55th & 56th Inf. Battalions,","87":" Light Trench Mortar Battery, 14th Field Co. Engrs, 28th A.S.C. &","88":" Field Amb. \n\nWe followed the main road as far as Wallon-Cappel & then turned off at right angles and kept on to the village of La Longue Croix. After passing this village we bore to the right for tramping along with a full pack & equipment up along quiet dusty lanes bordered with red-berried hawthorn hedges & bushes laden with ripe blackberries. About 1 pm we halted by the side of the road for a hasty midday meal of bread & cheese or jam washed down with the contents of our water bottles. Continuing the march the long line of men, horses & waggons soon arrived at Caestre and on to the Steenvoorde Rd. On arriving at Steenvoorde, a fairly large town near the Belgian border with a pretty steepled Church, the Ambulance broke off from the Brigade, three kilometres further on. Off with pack etc., undress and into the water which, however, was too cold to stay\n\nin long. Back again for tea, some returns to make out and then to bed (but not to sleep!). The sergeants had two airy, comfortable apartments which were low-ceilinged little places with bricked, straw covered floors and which had previously either been horse boxes, pig styes or cowsheds. All our N.C.Os come from either N.S.W. or Vic. About half from each State & fairly evenly divided between the two sleeping-chambers. The result was that inter-state rivalry came to the fore & N.S.W. attacked Victoria (& vice versa) until about 11.30 pm when everyone seemed to have had enough. Was forgetting to mention that I went into Belgium for the first time during the evening when immediately after tea I went up with some sick to","89":" Div Rest Station at Remy Siding, the other side of Poperinghe . We crossed the frontier at Keukacrt about 4 kilometres from Steenvoorde, passed through the Belgian town of Abeele & Poperinghe to our destination. After crossing the border instead of the French gendarmes in their light blue uniforms, I noticed the Belgian military police who wear black uniforms with khaki steel helmet? During our journey up to Steenvoorde I saw hop-growing for the first time. The hops are now ready for\n\npicking and numerous women & children were at work filling baskets with them. The next morning we marched off again, joining the Brigade in Steenvoorde and set out along the cobbled road leading to Poperinghe that I had traversed the night before. On arriving at Strazeele the column turned to the right and got back in France again, so close were we to the border. However we soon after re-crossed the frontier to stay on Belgian soil je ne sais pas combine de temps. . I quite liked the idea of stepping from one country into another, the dividing line on the road being marked by customs posts with notices in French & Flemish and Belgian Mil. Police. The Ambulance arrived at Renningheldt about 3.30 or 4 pm and took over huts & buildings previously occupied by 74th Brit. Fld. Amb. We were now in the front area as could be seen from the mounds of sand bags round huts & odd tents and sandbag shelters built in different positions. \n\nThe place fairly hums with military activity. Troops are everywhere and the roads are thronged with one moving mass of motor lorries, cars, ambulances, waggons, horses, etc, while at night the sky is lit up with a red glare from the heavy gunfire. Everyone carries his small protective gas helmet everywhere in case of\n\na sudden gas alarm. There appear to be a fair number of civilians in the small town notwithstanding its proximity to the front line. They are all selling things to the troops at more or less exorbitant prices and I think would even sell bootlaces in a front line trench if they were permitted to go up. There is plenty of work to do and numerous cases have been admitted and evacuated to Casualty Clearing Stations. They are however so far practically all sick & accident cases – only one man with shrapnel wound & a couple of gassed men.\n","90":" 1917:-\n\nMy 21st birthday! The","91":" in Australia,","92":" in Egypt, 20th in France and 21st in Belgium. What a variety! Have had no time to think about birthdays – going hard at it all day.\n\nThe Australians are in action. This morning early our \"B\" Section stretcher bearers left us, later in the day \"C\" bearers followed & then those of \"A\" Section – all going to do their bit – one hundred and ten men of the best.\n","93":"\n\nDuring the night one or more big Fritz’ guns threw numerous shells over somewhere near us. A shrill whine and then a roar when the shell burst – not a pleasant sound at all. Of our stretcher bearers who only went up yesterday 3 have already been reported killed and 4 wounded – mostly from my Section (B).\n\nThis evening took some patients by motor ambulance to 2nd Canadian Cas. Clearing Stn. Near Poperringhe, and to 50th Brit. C.C.S. near Godewaersvelde in French territory. The British C.C.S. is situated on the top of the Mont des Cats in a fine old Convent surrounded by parks. From this lofty eminence a splendid view is obtained of the surrounding country while in the distance a long line of flame as the big guns along the line spat their missiles of death & destruction. A fine sight it was and so real – no stage performance I can assure you. We ran down the side of Mont des Cats, out through some level country and then another ascent, this time to the top of the Mont Noir from the top of which we again had a fine view of the gunfire.\n\nAfter crossing the Belgian border again we\n\njourneyed on until Reninghelst was reached about dark at 8 pm. During the latter part of our journey we got bushed but pulling up beside some Belgian workmen I discovered one who spoke a little French and he put us on the right track. So far I don’t know one word of Flemish but will have to make an early start and learn some as soon as I can get a bit of spare time. The Belgian people are so fair that when I saw them clattering about in wooden shoes and looked up at the whirling windmills on Mont des Cats I could almost imagine myself in Holland.\n\nSunday, 23rd Sept. 1917:-\n\nA, B and C Section bearers returned after a day & a half in the line. B Section lost 7 killed && 3 wounded out of 32 while A & C had no casualties at all.\n\nOn the 22nd we were busy all day. During the morning & early afternoon all patients including a few gassed and wounded remaining from previous day plus admission same day were evacuated to 5 Div Rest Stn. & C.C.Ss. About 4.30 pm orders were received to move off in an hour and a half’s time to go into the line. Eventually got away\n\nabout 7.30 pm in motor lorries which took us right up to Ypres. Before reaching the town we passed close to some big gun batteries firing big stuff and belching forth fire & smoke into the night. \n\nOn arriving at a viaduct on the outskirts of the town we got out of the lorries with gas helmets at the alert and marched in single file through the shattered ruins of a fine old Belgian city. We finally arrived about 10 pm at some decent dugouts built into a portion of the old ramparts once surrounding Ypres. We got in here for the night and notwithstanding the heavy gunfire in the vicinity, managed to get a sleep before turning out at 4.30 am. The Bearer Sub. Divisions of the 3 Sections & Tent sub-divisions of A & C left immediately for the Advanced Dressing Station about a mile the other side of the town on the Menin Road and not too far from M. Fritz. Our tent sub-div had to await orders at the Ramparts. We were quite close to what was left of the old railway station now a mass of ruins – in fact the whole town was nothing but heaps of stone & brick and shattered walls of various buildings. There is practically nothing left of the Cathedral & the famous\n\nCloth Hall adjoining. During the morning several Fritz shells came over pretty close to us (N.B. Prompt retirement to dugouts), killing and wounding several. There is not a civilian left in Ypres – all have been cleared out.\n\nAbout 5 pm we set out in single file for the A.D.S. to the tune of the roar of big guns. We traversed the deserted streets and continued along a dusty road alive with military traffic. About two kilometres from our starting point we arrived at our destination – the A.D.S. which consisted of several more or less sandbagged dugouts & shelters on the side of the road. The sound of the guns was deafening – a big naval gun not more than 50 yards from the side of the road being the chief offender.\n\nThe Dressing Station was surrounded by batteries – gone are the old Red Cross protection days. B Sect went on night duty and I have been busy recording particulars of smashed & battered victims of Boche artillery fire, carried in on stretchers – A welcome respite at 1.30 am is enabling me to scribble a few lines for my diary. So far 75 patients have passed through since the Ambulance took men during the morning. Most of them are\n\npretty badly wounded as we only take stretcher cases – a separate A.D.S. for walking wounded being established opposite us. We evacuated either to Main Dressing Station the other side of Ypres or direct to a Cas. Clearing Station at Poperinghe. Three more of our bearers have been killed & several wounded.\n\nTuesd. 2nd Oct. 1917:-\n\nAfter nine days at the Adv. Dressing Station am now back at Devonshire Farm Red Cross Camp near Peninghelst. What a welcome change! Nine days & nights of continuos shelling with taubes overhead dropping bombs & sending down a hail of machine gun bullets from time to time. During the nine days we received no less than 2000 stretcher cases and people far away in Australia could not possible imagine the condition of some of the poor beggars. The war on the western front has now developed into one long & terrible artillery duel – each side sending over thousands & thousands of high explosives & shrapnel causing horrible wounds. Some on being brought in were unrecognisable so much had they been torn about. The first shift I did was 30\n\nhours and to-day when we cleared out I had just come off an all night shift. During the intervening period I did a twelve hour shift from 7.30 pm to 7.30 am in the Dressing Stn dugout and had to get my sleep during the day which was hardly possible with the roar the big guns made. Our quarters were none too safe & a direct hit would just about have knocked us rotten I think. \n\nAlthough shells dropped all round us, no direct hits were registered. About the third day one of our men who happened to be just outside in the open was caught by a shell & killed immediately. A bomb dropped a couple of hundred yards down the road & killed 17 and wounded 43. Another bomb dropped in front of a dugout on the other side of the road killed 1 & wounded 2 while the casualties every day on the Menin Road were very heavy.\n\nFritz knew that we were sending up guns, troops, ammunitions & supplies by this road & he shelled is as much as he could. The 1st & 2nd Aust. Divisions hopped over on","94":" & made good progress. They held the new line until the evening of the\n","95":" when they were relieved by the","96":" &","97":" Aust. Divs. which, after a terrific artillery bombardment early on the morning of the","98":" hopped over and took more objectives and numerous prisoners. These Divisions in turn were relieved on the evening of","99":" by","100":" & 2nd Divs. There is no doubt our chaps make good even though the going may be pretty hard.\n\nOur bearers have been doing good work but the Ambulance has suffered heavily no less than 93 being killed, gassed & wounded during the period. So many A.M.C. stretcher bearers were put out of action that further squads had to be obtained from the Infantry. We were mighty glad to come out to-day where we are only liable to bombing raids.\n\nI had a good wash down on arrival at the Rest Camp – my first decent one for ten days during which time I never once took off my clothes. Some life this – a little different from that down at No 2 A.G.H. I ran across several old No 2 chaps during the stand and we grinned reminiscently at one another from under our steel helmets. Haven’t had a sleep for 27 hours so will ring off.\n\n \n","101":" (3 p.m.):-\n\nStayed all Wednesday at Dev. Farm Rest Camp but following day B & C Sections (Tent Sub-divisions) got orders to march out at 4.30 pm to be attached dor duty to No 3 Canadian C.C.Stn. & No 17 Brit C.C.S. respect., both at Remy Siding, a mile or two from Poperinghe. \n\nAfter a fine spell of sunny weather the rain came down before leaving & the day was cold & windy. After a march through rain & mud for several kilometres we were glad to reach the C.C.S., which is quite a home after what we have gone through lately. We are about 16 or 17 strong & have been posted to different jobs. There seems plenty of work for the C.C.S. here (2 Canadian & 2 British). The 1st &","102":" Aust Div hopped over on the morning of the","103":" and casualties are naturally coming through in large numbers. The railway runs past the C.C.S. and Ambulance trains convey the patients to the base.\n","104":" (5 pm):-\n\nStill attached to","105":" Canadian C.C.S. surrounded by nasal twang & various other home\n\ncomforts that one does not get in a Field Ambulance. Plenty of water for washing purposes, hot showers, good tucker & a decent table to eat it off, plenty of blankets to sleep on etc etc. I am attached to the Orderly Room registering deaths ( averaging about 18 per day) – not a very strenuous job. The weather has changed suddenly and is now cold, wet and windy. Winter has commenced! And what a prospect! Memories of last winter rise up before me.\n","106":" (9 pm) :-\n\nThe weather is continuing rotten and the days are rapidly getting shorter. At 1 am after midnight to-day we reverted to winter time; all clocks & watches being put back one hour. Now it is dark at 7 o’clock in the evening.\n","107":" (7 pm)\n\nThings have been going quietly for the past few days. Our chaps had several hopovers with very heavy casualties but little progress made. The ground is a perfect quagmire\n\n \n","108":" that together with the rain, cold & wind it must be real hell in the front line and supports.\n\nA Section of the Ambulance is running the Main Dressing Station about a mile from Dickebush and I had to go over there on Sunday afternoon. Went in a New Zealand Motor ambulance as far as Poperinghe to Brandhoek in a motor lorry and the remainder of the journey on foot, in a Belgian farmer’s cart & in a British horsed waggon, getting lost a couple of times on the way. Got back to the C.C.S. alright in the evening via Ouderdam & Busse.\n\nThe taubes have been going in for a lot of bomb dropping lately & searchlights & anti aircraft guns are going every night.\n\nYesterday was the third anniversary of my enlistment. Time has passed quickly but yet it seems ages since I came away. We are all longing to get back again but some poor beggars never will.\n\n \n","109":" 1917:-\n\nThere have been plenty of taubes over latterly including last night which was fine & clear. Taking advantage of the moonlight went for a stroll down the road, over the frontier, and on to French territory. Have started to learn Flemish in earnest – it looks easier than French.\n","110":" 1917:-\n\nFritz has been bombing our area like billyho the last few nights – London raids aren’t in it (mere fleabites). So far our place has escaped scot free. The bombs are of a deadly nature – bursting all directions without penetrating downwards.\n\nWe have just had some very interesting news – leave to England has been increased from ten to fourteen days from","111":" And about time too. There are crowds of chaps who haven’t had leave for 18 months & some for two years. The heads are only just waking up and sending more on leave. The papers have been kicking up a fuss lately & this no doubt the result.\n\nAt the rate we are going the war will never be over. The Russians have been forced back, also the Italians and we can’t do good in the bad weather on this front. The Germans are without doubt the strongest military power after three years of war and if we want to do any good we shall have to get hold of more modern methods. England still thinks that one Englishman is worth three foreigners and is trying to win on old British tradition – all this is quite played out. Get rid of the old fogies at the head of affairs & get in some new blood equal to, or better than, Germany’s leaders.\n\nThe first American troops are in the line somewhere on the \nmain\n French front. I think there is only one division of them ever here & that their weight won’t be felt for some time.\n\nThe French govt issued a decree a little while ago fixing the manufacture of a standard quality only of a chocolate & fixed the price at which it was to be sold – the price being printed on the wrapper. This is a sensible idea which could well be followed by Britain & Australia.\n","112":" 1917:-\n\nThe part of Belgium where we are is not very interesting. The fields are under cultivation – beet growing appearing to be the chief occupation. The people are of a quieter & less excitable nature than the French & all of a rural type. All the young & middle-aged men seem to be away in the Belgian army which is, of course, kept up by conscription.\n\nThe roadsides are dotted with numerous estaminets, coffee shops & little places selling gaudy postcards, silks, soaps, cigarettes etc – all are either old farm houses or hastily run up wooden shacks and exist for the Troops only. The beer shop – estaminets – seem to do the best business and are crowded daily during the allowed hours (12 noon – 2 pm, & 6 – 8 pm.) where the men amuse themselves singing more or less melodiously all kinds of songs while someone strums away on the piano – the room during the \"performances\" reeking with stale beer and thick with smoke. Practically all the civilians remaining in the area are making money out of the Troops somehow or other; the prices of some of the goods are not unreasonable. There is\n\na good source of newspapers arriving the day after they are published from Paris & London. The civilians have \"Het Vaderland\" (Flemish), XX siècles (Belgian Daily printed in French), \"Le Matin (France’s chief daily) all of which are published in Paris. There is a good variety of London dailies, all catering entirely for the English public with plenty of sensational war news, making great victories out of little minor successes, making setbacks look as small as possible etc. \n\nThe Belgians are divided into two sections Flemings & Wallons , the former being Flemish speaking and the latter French. French is the official language of the country and the Flemings want it to be Flemish. There does not appear to be much good feeling between the two factions, even in their army.\n\nWinter is coming and all the trees & shrubs (what few there are) are fast shedding their leaves. The flat, muddy country is looking less cheerful every day.\n\nThe recent French successes near Soissons & Verdun have proved that our Allies are not \"dead\" yet although of course they are fed up with the war. The French Troops are fine\n\nfighters, superior to the English in my estimation. The average Englishman is apt to look down on the French soldier, probably because he knows so little aabout him.\n\nOur Ambulance is at present split up into several sections. A Section complete is over near Estaires somewhere with the Brigade, B Sect tent sub-div is attached to","113":" Canadian C.C.S., & C Sect tent to","114":" Brit. C.C.S., while the bearer sub-divs of B & C Sects are over near Reninghelst? I don’t yet know the exact number of casualties during the recent stunts but I believe we lost between 70 & 80 killed, wounded & gassed. No less than 3 Dist. Con. Medals & 13 Mil. Medals were awarded to 14th Field Amb.\n","115":" (7 pm):-\n\nOn Tuesday evening went into Poperinghe & saw the \"Duds\" – an English military concert party. The costumes & items were good & the big extemporary theatre was well filled. One forgot for the time that he was anywhere near the line and in range of German big guns. Poperinghe has been bombed & shelled on numerous\n\noccasions and there are many shattered remains of buildings in the town. Although a number of the shops & houses are silent & deserted yet there is still a large portion of the civilian population left.\n\nThe following day I was fortunate enough to get a trip to Dunkirk on the coast, about 60 kilms. away. We left the CCS at 9 am on a lorry that was going in on duty, & went through Poperinghe, Proven & Rousebuigge. Continuing along the main Dunkirk road bordered with tall, leafless trees we crossed the Belgian border, went through the French towns of Oost Cappel & Rexpoede, skirted Berques & passed through the old fortifications into Dunkirk at 11 am. Shortly after passing through Proven we entered the sector occupied by French troops who are holding the line between the Belgians & us. This is the first time I have been in an actual French war sector and it was very interesting. The towns & villages we went through were all full of their troops in their blue-grey uniforms with occasional splashes of khaki, the uniform of the French colonial troops. Black troops –\n\nwearing red fezs were working on the roads which were crowded with horsed waggons, lorries, motor ambulances, etc, all painted a dirty, dull grey colour. French transport has a very nondescript appearance; the horse waggons are old hay carts, furniture cans etc. of different types & the mechanical vehicles all seem to be second hand & done up on requisitions. However they get the work done which is the main thing. We had 4 hours in Dunkirk & had a good look round. First went out to Malo-les-Bains in the tram, a well known seaside resort before the war. In the other direction we went to St Pol by tram. Both in the town & out at Malo were evidences of German handiwork. Dunkirk has been both bombed & shelled (from land & sea). Rusty barbwire entanglements run along the beach with trenches behind them. Inside the harbour entrance there is a fine system of waterways & canals full of naval & fishing shipping. We dined in an up to date restaurant – a real good French dinner. The town is fairly quiet & prosperous looking. There were numerous American sailors, Belgian officers & English military & naval men\n\nin the streets but no Australians. The lorry left the Place Jean Bart soon after 3 pm & arrived back at Remy Siding 3 hours later.\n\nThis morning we got orders to leave","116":" Can. C.C.S. & rejoin our section at Reninghelst Siding together with C Sect tent Div. which we did at 11.30 am.\n","117":" (10 pm):-\n\nStayed at Van Sohier Farm, Reninghelst Siding, with B & C Sections until the","118":" inst. when was transferred with a Cpl & 5 men to A Section (H.Q.) of the Ambulance at Locre about 6 miles away. I was glad to get away from the billets at the Farm where one was ankle deep in thick, slimy mud if off the duckboard tracks. There was very little doing at the Farm – did a couple of good walks. One to Remy Siding & Abede and return through Boeschepe & Poperinghe. At the siding struck some Belgians (Wallons) who did not speak Flemish. In addition to French they used a patois among themselves.\n\nAt Locre the Ambulance is in a laye Hospice & outbuildings & is running the","119":" Aust.\n\n \n\nDiv. Rest Station. The Hospice belongs to some Belgian Religious Order and the Nuns & orphans are still occupying a portion of the buildings. Locre is a small village with the usual big church & is situated in the Messines sector. The guns are roaring day & night but several miles away – too far off to worry us. We seem better off here as regards the \"taube-pest\" than at the Farm where there were plenty of dumps, camps & light & broad gauge railways.\n\nThe British are employing big gangs of Chinese labourers as working parties on railway sidings etc. They are a fine stamp of \"chow\" but would be no good in the line. When Fritz machines are over us dropping bombs measures have to be taken to prevent the Chinese bolting. Their tents are usually surrounded by tall, bard-wire fences.\n","120":" (7.30 pm):-\n\nThe Div Rest Stn. Opened on","121":" inst and patients came in freely. At present we have about 140 patients. Have been kept pretty busy up to date but managed to get out with some patients this afternoon to","122":" Aust Cas Clearing Station.\n\nWe went from Locre to Bailleul and in the centre of town turned off to the left & went on to Steenwerk. Two or three kilometres further on we arrived at the CCS. It is beside the railway line (for evacuation purposes) & has been there about 18 months.\n","123":" (10 pm):-\n\nTo-day is the third anniversary of my sailing from Sydney on the old \"Kyarra’s\" first trip. As in the case of birthdays & enlistment anniversaries, I spent the first in Egypt, second in France and now third in Belgium. We are behind the Messiness front where things are very quiet. Only a few wounded & gassed cases are coming through although the sick are giving us plenty of work. We are unfortunate in having a lot of British \"tommies\" around us who are on the whole a most ignorant and useless lot. There are always plenty of them parading sick.\n\nI have been carrying on a correspondence with a friend living at Marseilles who has just spent several months in Corsica, and have learnt quite a lot about this French island possession. \n\nThe inhabitants of the island who of course are French subjects, are of Italian descent and speak among themselves a dialect much resembling Italian. The French language is only spoken in the schools, in society and in business circles. The island is rocky & mountainous and dotted with small towns & villages. The country has a savage but picturesque aspect abounding with precipices, torrents & cascades. Olive & walnut trees grow in abundance.\n","124":" 1917:-\n\nOur Divisional Headquarters are at Dranoutre, a village two kilometres from Locre. The cobbled road running from one place to the other is lined on both sides with billets & horse lines of various Australian Units.\n\nThe weather has been cold & windy the last couple of days but we can’t growl – it is much milder now than it was this time last year.\n\nThe following is an interesting extract from an article (les propos de Fantasio) in the weekly paper Fantasio of","125":" \"On distinguee les soldats australiens et neo-zelandais à \n\nce qu’ile sont coiffés d’un grand chapeau mou à las Buffalo Bill. Signe particulierP: ils ne mettent jamais la main à ce chapeau. Le salut militaire leur est inconnu. Ils prétendent assimiler leurs officiers à des patrons d’usine. On obéit au patron dans le service. Hors du service on ne leur doit plus rien. Cette conception originale a d’abord un feu.\n\nLeave to Orange (& Paris and Wimereux)\n\nReceiving an invitation from a French family living in Orange in the Department of Vaucluse, France, to stay with them for a few days, I applied for six days leave & was considerably astonished when I was granted 8 days commencing","126":"\n\nThe leave came through about 10 am on the previous day and I got away an hour later. Hopped a lorrie to Dranoutre where I drew some money from the Div. Paymaster and then went on to Bailleul. Arrived at Railway Station and found there was no train until\n\no’clock next morning. Spent the afternoon in Bailleul and put up for the night at the A.I.F. Depot. Weather pretty cold.\n\nOn Monday morning got away ay 8 o’clock and after passing through Strazeele, Hazebrouck, Ebbingham, Benescuse, St Omen, etc, and arrived at Calais (75 kiloms) 3 hours later. Changed here and boarded Paris train at 12 noon (Paris 300 kiloms). Passing Wimereux & Boulogne I felt quite \"homesick\" – No 2 A.G.H. is quite close to the Railway line. At Boulogne I went into the wagon restaurant on the train and sat down to a good dinner with 3 Belgian officers. We got into conversation & I impressed on them how little leave we got and the good work the Austs. had done. Incidentally they informed me that their troops got leave every 3 months & I learnt later that their officers get regular week-end leave as well. A Frenchman once told me that the Belgians were everywhere except at the front! The French & Belgians don’t hit it too well. I had dinner in the car during the evening (slipped into wagon restaurant\n\nat Amiens) and this time was with a French officer & two civilians. We talked about the war, of cause (everyone does) and I also learnt that of the two civilians, one was physically unfit for military service and the other was doing national defence work & had been exempted. The officer had something to do with the aviation service. \n\nTrain arrived at Paris (Gare du Nord) at 8.30 pm & I was soon successful in capturing a taxi (no mean feat in these days). Gave an Indian Medical Capt. & Brit. Naval Officer a lift to the hotel where I put up, the Paris Lyon Palace in the rue de Lyon, quite close to the Gare de Lyon. Here I engaged a fine room well fitted up with all conveniences, bathroom attached etc. Took the taxi to the Alambra Theatre where I saw a good variety show. Walked back to the Hotel about 11.30 pm.\n\nDidn’t get up too early next morning. Made a few purchases in town and then travelled out in the metro to Auteuit to visit the Harrissons. I had dinner with them & then went by tram to the Arc de Triomphe. I got off there\n\n \n\nand visited Mr Clegg in the Avenue du Bois de Boulogne. Dined near the Place de l’Opera and at 7.30 pm went to the National Opera Theatre and saw Romeo & Juiliette. It was simply splendid. I had the play in French and followed it right through. The singing, the ballet, the orchestra of 100 musicians, the crowded theatre (finest in the world, I believe) gleaming with brilliant electric lights, the wonderful staircase & fine ballroom, will not easily be forgotten. Going back to the Hotel I took the metro from the Place de l’Opera to Place de la Bastille.\n\nThe following morning I went to the Latin Quarter to visit an Australian artist who has been living in Paris for the past 5 years. Took her and a friend to dinner at a restaurant in the Latin Quarter. The restaurant was typically Bohemian with paintings on the walls left at different times by needy artists who could not pay their bills. Some of these paintings are very fine. In the afternoon I went with my riends to the first Exhibition of the \"Rainbow Group\" (l’arc en ciel groupe)\n\n \n\nof Artists at which they were both exhibiting. The Exposition was held in the Galerie du Luxembourg, 73 boulevard Saint Michel (Latin Quarter) and there were some good paintings & other exhibits. A large number of Artists were present including, of course, those who had pictures there. I had tea with my artist friends, said goodbye, went back to hotel, packed up and walked to the Gare de Lyon. Here I booked for Orange, 714 kilometres from Paris, and left at 7 pm by the Riviera Express. The train was crowded with civilians, French permissionaires, a few odd British Soldiers going through to Italy and several Canadians proceeding on leave to Cannes on the Riviera.\n","127":" Dec:-\n\nThe train arrived at Lyon (Gare Perrache) at 6.30 am and left two hours later. During the interval I strolled off the station into the town with a Canadian who was travelling by same train, had some coffee, bought a few postcards and then back to the station. Lyon is a fine city and is France’s third largest town! At noon I arrived at Orange, my destination, and went straight to the Gendarmerie where an official\n\nlooked at my pass (written in English) pretended that he thoroughly understood it although he couldn’t speak a word of English, and made an entry in a register of where I was going to stay and the date I should leave. I then found the residence of M. Martin with whom I was going to pass my \"permission\" and was cordially received by his family. There had never been an Australian staying in the town before and I was quite an object of curiosity, admiration & awe. The news soon spread round that M. Martin had an Australian staying with him.\n\nMy few days in the south passed quickly. The mornings I spent about the place, sallying forth to partake of an aperitif before dinner at a fine big café in the town. I had a look over the old Roman Theatre built many years ago and now used in the summer by Opera parties from Paris. There is also an ancient Arc de Triomphe near the Gendarmerie, erected in the Roman era\/ I was of course taken round to all & sundry. One afternoon we climbed up to the top of a hill dominating Orange. From the\n\nloft elevation we could see the country for several miles around with mountain ranges in the distance. The town of Orange, spread out below, had quite an oriental appearance with the white verandaless wall of the houses and streets of the same chalky colour. On the summit of the hill is a statue of the Madonna and the ruins of an old Roman castle that used to stand there in days gone by.\n\nOn Saturday afternoon three of us rode on bikes out to Caderousse, a quaint old southern village 6 kilometres away. Caderousse is entirely surrounded by a high rampart to keep out the flood waters of the Rhône when it rises. We climbed up a flight of narrow steps and walked some distance along this digue or embankment! We then descended on the other side and going down to the river, crossed over on an old barge to a thickly wooded island where numerous Spaniards were working at a sawmill, cutting down the timber for uses of the French army. Many forests are being sacrificed on account of the war. Foreigners living in France are not compelled to serve in the French Army. We walked as far as the Château on the\n\nisland and then retraced our steps to the old barge & Cadeerousse. After a cup of black coffee at the café where the bikes had been left and a chat with the proprietress who knew my friends, we cycled back to Orange in the gathering dusk.\n\nEveryday I made new acquaintances and had to drink numerous coffees, liquors, etc. at various maisons I visited. The son (James) came home on leave to see me. Nearly two years ago he got a bad shell wound in the leg while on the French front and is now hobbling about with the aid of sticks. He is still in a hospital at Lyon awaiting a final medical examination that will discharge him from the Army. He is 21 or 22 and sings & plays well. We used to have plenty of songs, piano & violin solos etc during the evenings. The father who is 49 years of age was temporarily released from military service 3 months ago after continuous service in the French army since the beginning of the war.\n\nOn Sunday morning I attended Mass for the first time (Had often wished to see a French R.C. service), and in the afternoon to vary the programme we went to the Pictures. That day we had quite\n\n \n\na crowd of friends to dinner.\n\nThe weather was good practically the whole time with bright summer days. Much milder than the bleak climate of the north.\n\nThe people of Orange are of the real southern type, some with dark eyes and olive skins. They speak French (with a very bad accent), Provencal – the old language of the South, and a local patois – a dialect of French, Italian Provincial & slang mixed.\n\nOrange is a base for Salonica and in addition to French troops I saw plenty of Servians and Greeks belonging to Venizelos’ National Army as well as a few Russians. The latter, of course, are very unfavourably regarded by everyone in view of the way in which Russia is backing out of the war.\n\nThe town has a population of several thousand and is on the main line between Lyon (200 kiloms) and Marseille (150 kiloms). The streets are fairly narrow, plenty of well lighted shops and a busy market place. The cafés are large and covered in with glass. The surrounding country is quite flat. Living is fairly dear although products of the south,\n\nespecially wines, are cheaper. While I was there the supplies of cigarettes, tobacco and matches ran right out and notices to this effect were placed in shop windows. There is a scarcity of the weed throughout France. Matches are a government monopoly.\n\nAt 4 p.m. on","128":" I said goodbye to my friends at the Railway Station and in three hours time arrived at Lyon. I did not leave for Paris until 10 pm so was able to see some of the town by night. The broad streets, fine statuary, tinkling trams, glittering cafés and the big shops made an impression on me – there was no war here. British khaki was conspicuous by its absence. Plenty of French, naturally, and also a few Americans.\n\nThe following morning I arrived in Paris at 8.30. My train companions were all French, one of whom being a smartly dressed young militaire who much bemoaned his fate at being a common or garden cook in a motor column or something when he asked to get his pilot’s certificate in the Flying Corps. His people seemed to be rather big hits in Lyon and he was probably a pampered son. I left my pack & greatcoat at the British Club in the Place de la\n\n \n\nRépublic, Paris, bought one ot two things and then had a look at the second exhibition of the Allies War photos in a building in the Tuileries (gardens). From here I made tracks out to the avenue de Bois de Boulogne where I had dinner with English friends. Left them about 2 p.m. and went to Auteuil to see some French people. Here I stayed until about 9.30 pm. At 11.40 p.m. my train steamed out of the Gare du Nord bound for the north.\n\nThe train travelled slowly, stopping at many stations and did not reach Boulogne until 10 o’clock next morning. Hopping off here, I successfully eluded two members of a very unpopular branch of the service (M.Ps) and caught the tram out to Wimereux & No 2 A.G.H. Here I was soon shaking hands all round & yarning to all and sundry. I left them just 6 months ago to join the Ambulance. During the afternoon I had to visit several civilian friends in the neighbourhood and had dinner at night with a charming Paris family who have a holiday place at Wimereux and whom I met last year. Wimereux seemed about the same as when I left it except for it having become much more English. There are also plenty of German\n\nprisoners working about now and a big Portuguese camp in the vicinity.\n\nAfter a hot shower, breakfast and plenty of farewells at the Hospital I made for Wimille-Wimereux Station and caught a train at 10 a.m. for Calais where I arrived at 11.30 a.m. Spent two hours here and did not forget to satisfy the inner man in view of another train journey to Bailleul. Shortly after passing through St Omer we heard the whiz bang of a big shell followed shortly after by another and still another. The Germans were bombarding Hazebrouck with long range guns. Poor northern France – there is not a town that has not suffered from shell fire or taube raids (or both). The train stopped at Elblinghem, the station this side of Hazebrouck, but then made a detour by a loopline to Merrin on the other side of the bombarded town. Here we changed into another train and steamed through into Bailbeul at 7 p.m. While walking through the town I found that Fritz’s taubes had been busy since I came through last. A block of dwellings in the rue de la Gare had been completely demolished. The town was in pitchy darkness, the blackness being relieved only by\n\nby such \"interesting\" dull silhouetted notices as \"English beer sold here\", \"Estaminet\", \"Coffee, washing done, fried eggs & postcards\" etc etc. With the aid of a pocket torch which I always carry during the winter months, no difficulty was experience in gaining the Square and the road to Loire. Here I was able to get a lift on a Flying Corps lorry for several kilometres and walked the rest arriving at the Ambulance about 8.30 pm.\n\nMy holiday was simply great from start to finish. I talked French practically the whole time and felt quite like a respectable civilian again except when discussing more or less authoritively different problems of the war – the one and only topic of French conversation. No one thinks the war is anywhere nearly finished although all we hopeful of a successful conclusion. All eyes turn towards the Yanks who are expected to do great strokes but who have so far done nothing except to firmly establish themselves in Paris, Lyon and other such \"strongholds\".\n\nParis is still gay and will probably always be so – the most attractive city on the continent\n\nin pre-war days. Everything in the capital is pretty dear and the cost of living high as can only be expected. Paris notwithstanding more than three years of war, is still the centre of art, science and literature although its schools and universities are now but poorly attended.\n\nI did a fair amount of train travelling while on leave and was always comfortable. I did not travel 1st class on account of the large English element (officers) occupying the compartments and I did not go third because it would have been beastly uncomfortable. Therefore I travelled second where I was quite alright and always in a French atmosphere.\n\nThe French give their troops ten days clear leave every 4 months and there were crowds of pormissionnaires everywhere, from the fronts in France and Belgium\n\nas well as from Salonica, Murocco and Tunis. I was well received wherever I went. The Australians have made a name for themselves in France ( as have the N.Zs. & Canadians) and another point is that practically all our troops over here are in the field.\n\nFrance is greatly concerned over the backing down of the Russians, as she is on the discovery of two of her members of parliament implicated in a big plot against the country which is now being unravelled by the Sureté. The tenacles of this plot, known as the \"affaire Bole\" and organised by German brains and money, extend into Italy & Britain.\n","129":" m1917:-\n\nOn return from leave I found that with the exception of about 40 tent division men the Unit had marched out and was on\n\n \n\nits way to Cormont, the whole Division going out for a rest in and round villages near Etaples & Boulogne. I had been pretty hard at it right up to going on leave and on returning soon got back into harness again. The 1st Aust. Division is moving up into the Sector to take our place and the","130":" Field Ambulance arrived to-night to take over the Divisional Rest Station.\n","131":" 1917:-\n\nWe handed over the following morning and the next day marched off at 8.30 a.m. to entrain at Dehennebok, about 8 or 9 kilometres away. With several thousand troops of the Division we had a wait of a couple of hours in the snow with a cold wind blowing. The train left at 1 p.m. and arrived at Devres about 7 o’clock after a perishingly cold journey. We came through Hazebroyck and were able\n\nto see some of the results of the bombardment of","132":" &","133":" Numerous houses were completely demolished and great holes in the fields showed where odd shells had fallen. We detrained in the snow and marched to a big cement factory where about 500 were billetted for the night. The next morning we had a look round Devres and at 11 a.m. left for Cormont (vis Samov), 19 kilometres away, where the Ambulance was stationed\n\nWe were in Belgium three months.\n","134":"\n\nCormont is a quiet little village with a total population including \"environs\" of not more than 300. Our Ambulance, which is 240 strong, has practically taken the place by storm. We are all billetted on various farms. Two of us Staff Sergeants have a decent little place where we are quite at home. Cormont lies in a hollow and the trees and surrounding hills\n\nare covered with a thick mantle of snow. Quite a pretty scene. We are only 254 kiloms from Boulogne and 10 from Etaples.\n\nTo-day I went into Boulogne. We dropped some patients at","135":" Gen. Hospital taken over some little time ago by the American Medical Service, and then went out to Wimereux. Returning to Boulogne we made numerous purchases and got back to Cormont with a good supply of edibles to grace the festive board on Christmas Day. The town was crowded with troops & civilians; everyone seemed to be buying stuff for the Noël.\n","136":" 1917:-\n","137":" passed off fairly quietly. We did no work on","138":" 25th &","139":" On the morning of Christmas Day the Sergeants played the men football and were beaten 4 goals to nil. The ground was terribly slippery and covered with ice. We were continually falling. In the\n\nevening we had a splendid dinner and singsong. Yesterday evening (Boxing Day) we had a concert in the village. On Christmas Eve B Section tent division had a dinner in one of the farmhouses. \n\nWe are back at work again and I am at present on general duty. This morning was an inspection of gas helmets, a lecture & company drill. This afternoon there will be a route march.\n","140":" 1917:-\n\nYesterday I went into Boulogne on leave and visited various friends there as well as out at Wimereux. It was a rotten kind of day, cold & windy with plenty of snow on the ground. There are 6 or 7 sent daily from the Ambulance to Boulogne, being taken in and brought out on lorries.\n\nNot feeling too brilliant these last two or three days. Both morning and afternoon we are standing about in the snow which soon soaks through a chap’s boots.\n\n "}}