{"Document Name":{"0":"Diary_0016","1":"Diary_0016","2":"Diary_0016","3":"Diary_0016","4":"Diary_0016","5":"Diary_0016","6":"Diary_0016","7":"Diary_0016","8":"Diary_0016","9":"Diary_0016","10":"Diary_0016","11":"Diary_0016","12":"Diary_0016","13":"Diary_0016","14":"Diary_0016","15":"Diary_0016","16":"Diary_0016","17":"Diary_0016","18":"Diary_0016","19":"Diary_0016","20":"Diary_0016","21":"Diary_0016","22":"Diary_0016","23":"Diary_0016","24":"Diary_0016","25":"Diary_0016","26":"Diary_0016","27":"Diary_0016","28":"Diary_0016","29":"Diary_0016","30":"Diary_0016","31":"Diary_0016","32":"Diary_0016","33":"Diary_0016","34":"Diary_0016","35":"Diary_0016","36":"Diary_0016","37":"Diary_0016","38":"Diary_0016","39":"Diary_0016","40":"Diary_0016","41":"Diary_0016","42":"Diary_0016","43":"Diary_0016","44":"Diary_0016","45":"Diary_0016","46":"Diary_0016","47":"Diary_0016","48":"Diary_0016","49":"Diary_0016","50":"Diary_0016","51":"Diary_0016","52":"Diary_0016","53":"Diary_0016","54":"Diary_0016","55":"Diary_0016","56":"Diary_0016","57":"Diary_0016","58":"Diary_0016","59":"Diary_0016"},"Date":{"0":"unknown","1":877.0,"2":878.0,"3":879.0,"4":880.0,"5":881.0,"6":882.0,"7":883.0,"8":887.0,"9":888.0,"10":889.0,"11":890.0,"12":891.0,"13":892.0,"14":893.0,"15":894.0,"16":895.0,"17":900.0,"18":901.0,"19":902.0,"20":903.0,"21":904.0,"22":905.0,"23":906.0,"24":907.0,"25":908.0,"26":909.0,"27":912.0,"28":913.0,"29":914.0,"30":915.0,"31":916.0,"32":917.0,"33":918.0,"34":919.0,"35":920.0,"36":921.0,"37":922.0,"38":928.0,"39":930.0,"40":931.0,"41":932.0,"42":933.0,"43":934.0,"44":935.0,"45":936.0,"46":937.0,"47":938.0,"48":939.0,"49":940.0,"50":941.0,"51":942.0,"52":943.0,"53":944.0,"54":945.0,"55":946.0,"56":947.0,"57":948.0,"58":949.0,"59":952.0},"Entry":{"0":"\n\n","1":"\n\nThis will be my third attempt to keep a daily record of our doings, & I hope it will be more successful than my previous attempts one of which lasted 5 days & the other 21 days, some going alright. \n\nThe weather the last 5 days has been very windy & cold with occasional showers of sleet & hail, which needless to say made us shiver & pass uncomplimentary remarks about \"Flanders\" & the war in particular. At present we are billeted at a farm & I & a few others are sleeping outside in an old shed without sides & the roof is like a sieve thank's to German shrapnel, we have\n\nbeen doing \"fatigues\" (or as they call them over here \"working parties\") every night we go up to the firing line or somewhere close to it, & help build saps, dugouts, build parapets & so on it is dangerous work sometimes for they generally put the machine guns over where they think the work is going on, & the bullets come very low, last night one of our chaps was hit in the head & he died this morning, we leave our billets about 6 oclock & march anything from 2 to 5 miles according to where our work has to be done, work starts about 8 o'clock & we knock off about 1 A.M. arrived home it is no uncommon thing to find an old pig in your bed, & straight way there is a scrap, accompanied by much shouting from the owner of the \n\ndoss & squeals from the pig, boot & hair fly rapidly for a few minutes, & then all is quiet once more.\n\nLen is expected back from England to-day they have been ringing up on the telephone wanting to know if he or Sgt Downer is back yet.\n\nThe artillery is fairly active again to-day & shells are flying pretty fast & thick while aeroplane's are everywhere.\n\nYesterday was pay-day here, & great was the quantity of beer got rid of, some of the chap's have not turned up yet, they are making it a bit hot, & I guess they will cop out\n","2":" Len came back this morning from England, had a bonzer time & was treated splendidly. I am looking forward to my trip to the \"Old Country\" Saw George Vaughan this morning he had 3 stripes up & is on Brigade\n\nIntelligence Staff, we had a rifle inspection this morning, the first one for 8 days, our Coy changed over with A. so they do the fatigues & we do the \"stand to\" now, to-day is very dull and it feels rainified.\n\n12th. Parcel came for Len this morning from home, the first one for a long time weather still very dull, our platoon has to do a weeks punishment, on account of the many crimes we have to our credit no less than 22 during the week the boy's have been having a right royal time alright nearly all drunks & stopping away from roll calls, theres not much trouble about getting drink for nearly every other house is an estaminet or drinking place, this afternoon we built up a stairway with sandbags, so as the chaps who were camping up in the\n\nlofts can get out more quickly in case of an alarm, last week 2nd Division had 400 casualties during a gas attack which was accompanied by a violent bombardment. Saw an extract from a German paper this morning not very flattering to us either, for they describe us as the refuse of humanity, & they reckon we are a band of murderer's, robbers in fact everything that is bad, & they conclude by saying that it is a crying shame that good & precious German blood should be shed fighting the like of us, old Fritz had better keep his eye on the refuse for they have a score or two to settle with him between now & the grand finale; some very fast aeroplanes were scouting around here to-day I think they were French machines for they were of an entirely different type\n\nto the usual British aeroplanes which do the scouting here.\n\n13th. Last night we were on fatigue, had to go up to the Engineer's dump, & push loaded trucks of barbwire for entanglements, sandbags for parapets, & sap's, duckboards hurdle's & etc. on the way up to the firing line, our trucks ran off several times but we had no difficulty getting them on again, we had to run the gauntlet of machine gun & rifle fire more than once & several bullets hit one of our trucks, & they just missed our heads, if the elevation were a little lower there would have been a few casualties I'll bet, we had no sooner arrived at the dump than a fight sprang up it did not last long, on the way up with the trucks one of our chaps got his heel crushed with the wheel, & on lobbing back at the dump one of the boy's found that he \n\nhad lost his equipment so we had quite an eventful night, the threatening weather of late has turned to rain at last, & we have water everywhere to-day. This morning a fine big parcel of cake's lollie's & etc arrived from Littlehampton, so the soldiers had cakes for breakfast & very nice they were.\n\nThe other day a most amusing thing happened just close here to A. Coy. they were billeted at an old farm (Weathercock\") she was absolutely smashed to pieces, & the roof of red tiles was like a sieve, well the German's started to shell the old place like mad, while this was going on General Walker came along & ordered them to clear out & take cover in some trenches that were close handy, so they hopped into the trenches, next morning their officer on parade told them that a certain General said they were cowards for running away like they did, & they all sung out with\n\none voice liar, so one of the boy's composed the following piece of poetry & hung it in a place where everyone could see it,\n\n\"To our Company (A) I don't think\n\nThe shells have scattered our homestead\n\n The guns are blazing away\n\nWe'd mortage our chances in Heaven\" \n\n To be in Australia to-day\n\nWe knew that our homestead was settled \n\n So away to the trenches we fled\n\nA. Company's awfully frightened\"\n\nWere the words that a General said.\"\n\n \"Chorous\n\nIf that chap would only wait\n\nTill the boys were under fire\n\nThen he'll see that he's mistaken\n\nAnd know that he's a liar,\n\nFor the boys are not afraid\n\nAnd we are surprised that he\n\nShould throw that insult at Australia\n\nAnd the boys of Gallopoli\"\n\nOur boys gave proof at the landing \n\nThere wasn't a coward with them.\n\nWhen they dashed for the enemy's trenches\n\nWith a rush that the Turks could not stem,\n\n They built up a name for Australia, \n\nAnd a name that has made us all proud\n\n And when they say we are coward's\n\n Let us sing in voice's loud\n\nRefrain\n\nThe boys of A. Company are waiting\n\nFor the General to lead them to fight,\n\nOr will he just sit in his dug out,\n\nAnd say that we suffer from fright,\n\n That General may be a hero,\n\nOr he may be a dug-out King \n\nBut when he say's we are cowards\n\n Just lift your voices & sing\n\nChorous\n\nSame tune as \"If those lips could only speak\"\n\nBefore they moved from their billet they had\n\n2 killed & 5 wounded so it was time they got a move on wasn't it.\n\nAnother laughable incident happened the other day to a certain Coy. officer; they were having a gas helmet parade, to see that they were all in order, & the officer suddenly discovered that he had left his in the billet, now this is a pretty serious thing for no one is supposed to be without them night or day, so he borrowed one from one of the men, all went well till just before the finish when the officer in question noticed one chap without his helmet, he straight away pounced on him& started to lecture the bloke on the enormity of his crime, while he was busy talking he pulls the one out he had borrowed, but to surprise of all, his helmet turned out to be a pair of sock's a regular roar of laughter went up & the officer had to grin himself, it appears that\n\nthe bloke had lost his, & to make them think he still had it he stuffed the old socks in & not knowing which was the good one he had to chance it & give the officer one or the other.\n\nLast night the German's hung a board out on their barb-wire: \"Advance Australia Fair\" & in brackets \"(if you can\") they will see us all in good time.\n\nWhen General Townshend surrendered at Kut-el-Emara, the German's put a big notice board out, \"The famous Turk captures 13,000 English\", I suppose they thought it would dishearten us, but they were very much mistaken. \n\n14th. Last night we were shifted from our billets to one nearer the firing line & this morning we were on fatigue carrying sand bags from the old Weathercock\" house to our present billets, about 11 o'clock we knocked off & went to church, the church\n\nin question consists of an old wooden frame with Hessian stretched over it; she is built behind the ruins of an old house so as to be out of sight of the German observer's small as it is there is an organ in it, & it seems funny to hear the guns roaring & blazing away while the service is going on About 100 yards to the right of our billet a mobile gun was shifting the German's a bit she had a good target, for the observer could plainly see the result of her shots she was shooting at a mob of Huns who were round a store or depot, she punished them properly, they reckon yesterday she nearly wiped a Battalion out she caught them coming over a piece of open ground towards their trenches, & fairly murdered them they are very handy for they rush these guns from place to place, fire a score of shots or so & then gallop away, of course\n\nthey have their drawback for they draw the fire of the German guns on to us at times. I hear that there is a big Australian mail in I hope its true.\n\n15th. Out again last night driving stake's into the ground & running a wire along them so as we could find our way quickly to the firing line in case of an attack, we had a narrow escape there were 3 or 4 of us laying on the ground having a bit of a spell, we were yarning & laughing away when all of a sudden 3 bullets lobbed right in among us & scattered the dirt over us you should have seen us scatter its the fun of the world at times to see the boy's spring to it, no matter how tired & sleepy you may be when bullets or shrapnel are coming close you will do a get alright, no matter how much you would like a \"Blighty\", the meaning of Blighty\" is a nice little pet wound\n\nwhich will give you a trip to England it is a great word among the Tommie's The weather is still wet & windy whenever will it clear up, this weather is so miserable I cant say as how I care much about these Imperial rations we are now being issued with, our rations this morning were a tin of jam (marmalade of course) between 5 & a small loaf of bread for 3 of us, this with stew does us for 24 hour's.\n\nThe German's have scarcely fired a shot for 2 days now, I expect they are up to something or other last night flares were very plentiful & the Hun's had a big search light sweeping all around.\n\nI hear there were 3 of B.Coy's men hit last night while on fatigue in the 3rd Battalions line & one of D. Company's too. we had a few reinforcements added to our strength this morning, but we \n\n \n\nare still understrength.\n\nThe mobile gun is quite close to us again this morning & tearing into old Fritz. \n\n16th. At last the weather has taken up this morning is a beauty not a cloud in the sky, it is an almost perfect morning the sun is shining brightly, birds are singing gaily, while the whole countryside is nothing but a mass of green & leafy trees sweet flowering hedges blossoming fruit trees, & the paddocks are a riot of wild & garden flowers & the incense arising from all this mass of beautiful colouring is something lovely for you know it is Springtime here & we have all heard & read about this part of the world & the beauty of it for 6 months or so, & it quite deserves its reputation, but the other 6 months has a different side to it, \"what oh\".\n\n \n\nAs I sit here writing the \nis\nlovely green grass tangled with pretty flowers & clover is well over my knees & nearly reaches to my head, I am sitting behind a hedge & right in front of me is a nice little road, & about 600 yards away are the German trenches where men are waiting to kill one another What a farce Christianity\" seems when we have come to this, I reckon we are as bad as any race of blacks, for all our religion & learning.\n\nThe aeroplane's are flying all over the place this morning, & the air is full of the purring sound of their engines as they rush about sometimes climbing sometimes doing a spiral descent as the gunners get their range, & now & again they vary this with a steeply banked turn which almost throws\n\nthem on their side, & I have seen more than one of them loop the loop, they have indeed brought aviation to a fine art. I think it is much safer in the air at the present time than on solid ground I wonder how many would have agreed with that option at the outbreak of the war, I guess they would have laughed. Our guns are blazing away like old Harry\" it seems like a 4.7 battery from the sound of their shells as they pass overhead, & from the report of their shells as the burst in the German lines, old Fritz is also sending a few back, & you can hear the sound of the shell as it proceeds lazily on its death dealing errand, the bigger the shell the slower it seems to travel The birds here are not in the least frightened by gun fire, they sing away\n\nas if it were just an ordinary thing I suppose they are quite used to it by now & take no notice of it.\n\nLast night we shifted our billets again so as to be nearer the firing line & also closer to our work, we finished the stake driving last night, & some of it under machine gun fire its marvellous how we all escaped scot free. I would far rather be in the firing line than out on these working parties for they are far more dangerous\n\nThis morning I saw Walter Fisher a chap from Walcha he enlisted the same time as I did but I never ran across him till this morning he is in the 3rd Battalion\n\n17th. Yesterday afternoon the German's opened a furious bombardment on our support & communication\n\n \n\ntrenches, the extreme right of the 3rd Battalion & the Welsh Fusilers were the one's mostly concerned in it, I have not heard what damage they done, but I dont think there were many casualties old Fritz made the pace a cracker from the jump the bursting shells made one continuous roar, & it lasted for nearly 2 hour's our batteries never replied for nearly an hour then they opened a gradual return fire which kept on increasing till it reached a pretty solid pace & shut old Fritz up, but I suppose he had done all the damage he had wanted to do & was satisfied to stop.\n\nThey reckon a Zeppelin passed over here last night from the noise of the engines, it was not like an aeroplane for every now & again the engines would stop, & then start off again\n\nas if they were searching for their target, later on heavy explosion's were heard behind our lines.\n\nAt \"stand to\" this morning we were taken away up to Iron Post\" to build dugouts for the 3rd Battalion, wasn't there some growling & strafing it was about 3 oclock in the morning, & nearly daylight we finished at 7 oclock & came back through V.C. avenue, arrived at our billets we found an Australian mail waiting for us, how pleased we are when a mail comes in all hunger & weariness are at once forgotten, & we read our letters over & over so as to be sure we have missed nothing.\n\nThis morning an order came through for us to roll all our spare blankets up in bundles of 10, that means a blanket from each man, so I expect \n\nwe will be moving in a day or so at most\n\nThe morning is nice & warm & I hope it continues like it. The other day not far from here there were a few Maoris & some Frenchmen doing a job, when one of the Frenchmen asked a Maori how long it would take him to chop a certain tree down & he answered 1 min, the Frenchman laughed at him, & challenged him to do it, so the Maori hopped into it, & fell it 14 sec. under the min. the Frenchmen were astounded.\n\n18th. Nothing of any importance happened last night or this morning except a small & deliberate bombardment of our Company's billets last night they shelled them with 4.7s & 18 lb-ers, but all the damage they done was harmless its wonderful sometimes what a small amount of \n\nharm a heavy shelling will do to watch the explosions & see the amount of earth a single howitzer will shift, you would think no one would be left alive, but after it is all over you will see the boy's coming out of their cover very little the worse for the shelling, of course it is not always like this sometimes they get the range to a nicety & lob them right in the trenches they do some damage then alright & a man is very lucky to come out alive.\n\nSome of the 11th battalion were here yesterday having a look round the trenches they are taking over from us, I think the 10th & 11th are coming up from the","3":" Brigade to relieve our Brigade we were the first of our division to take over the trenches from the Tommies what a difference there is now, the English left this part of\n\nthe line in a most disgraceful state nearly all the duckboards were under water & slush the parapets & dugouts were in a shocking state, & as for communications & reserve trenches well they simply didn't exist for all the use they would have been if ever the Germans made an attack, things are a bit different now, its wonderful the improvements that have been effected even in so short a time. we have built 2 more new communication trenches numerous saps, besides improving all other things out of sight, the Tommies would scarcely know this part of the line now if they were to return.\n\nWe had a sing song last night in our billet this war so far as we are concerned is nothing but a huge picnic compared to Gallipoli.\n\nThis morning we cleaned up our billet for we are expecting to leave for Sailly to-night. As I write our gunners are blazing away at a Taube which has crossed our lines & is making for Sailly, this is the first one I have seen come so far over since I have been here. Last night the mail closed for Australia & there was a fair swag.\n","4":" To-day is the first anniversary of the great Turkish attack on us at Anzac, this day last year we were getting a bit of our own back, by nightfall we had slaughtered no less than 7000 Turks & taught them a very severe lesson. I wonder where I shall be this time next year; daisy pushing perhap's, or if my luck still sticks to me home in Australia for I dont think the war will last another year at any rate\n\nLast night we were relieved by the","5":" Battalion who came into our billets we left Weathercock\" about dusk & marched nearly 4 miles with a heavy pack up before we had a blow, my pack never felt so heavy before for I was carrying it Gallipoli fashion & the narrow straps cut into my shoulders like wire I can tell you we were all very glad when we reached our billets about 11 oclock, & it was not very long before we were all sound asleep. Len brought me up some letters just before we left our billets.\n\nThere was a fair bit of shelling yesterday especially from us our boys did stick it into them, & talk about aeroplanes there were score's of them up but for every\n\n \n\none the German's had up we were flying 10 there is no about who has the superiority of the air on this part of the line at any rate its wonderful how they dodge the shell's they seem to be completely encircled sometimes in clouds of smoke & bursting shell.\n\nAll our Brigade will be out of the trenches to-night & we will then form the Divisional reserve.\n\nThis morning we had a short parade & rifle inspection, it will be a regular thing from now on. The weather is still delightful.\n","6":" Yesterday afternoon there was a great commotion in the air a Taube was trying to break through our lines & our fellows shelled her heavily but with no result, for she got back\n\nsafely. Went down to Heqr's & saw Len, & while there he & 3 others ate no less than 25 egg's fried, I can't stand egg's myself for they turn dog on me even if I only eat one.\n\nLast night while going into the firing line the","7":" Battalion lost 60 men bad management somewhere for this is the second occasion that they have been hardly dealt with.\n\nHad a bit of fun last night with a couple of old bats playing tip & run Kelleway the cricketer was there & offered to get us a good set of cricketing material for a £1 so we are going to have a set as soon as possible. We were on fatigue all the morning building a bombing trench for practice the platoon never worked so hard before I'll bet for the sweat fairly\n\npoured off us we finished at 1 oclock. Yesterday Jock Mackie came back from the bombers had a row over the promotion & threw it in.\n\nAfter coming back from fatigue I went & had a good bath in a pond quite close to our billet, for the day was very hot & the sun bonzer 3 of us got into a row over the saluting yesterday I don't mind saluting a soldier, but hang these flash cold footed crowd that hang well behind the firing line & have all the skite, we have some wasters among us.\n\nEarly this morning an old pig came into our billets & every one being asleep she grabbed a bloke by the ear talk about a row you ought to have seen the dust & straw flying.\n\nAnother fair batch of mail came in \n\nthis evening.\n","8":" Yesterday evening there was a cricket match between No 11. & 10 platoon & after a most exciting match No. 11 won by a run the scores were 28 & 29 on the first innings.\n\nLen & Holme's were up here last night Len brought me a batch of English paper's.\n\nWe are having some great games of Bridge\" here its wonderful what a few can play it.\n\nWe had a church parade this morning held under the shade of some bonzer old trees & the grass we were standing on was nearly knee high.\n","9":" Fraser another mate of mine left the Coy. this morning\n\nto go to the stretcher bearer's he is going from there to the A.M.C.\n\nThe weather is still keeping ideal.\n","10":" We played the return match yesterday evening & this time No. 10 turned the Tables & beat us by 5 run's. To-night another chap & myself took up a collection for a cricket set for our platoon we got enough money easily. Last night Len & Holme's were up again & after the match we had a rubber or so of bridge. This morning on parade they called for volunteers for a raiding party, & nearly half the platoon stepped out, but strange to say they would not take old Anzac\" men, we were disappointed but nothing could be done for it\n\nwas a Brigade order perhaps we are to \nvaluable\n to lose, but I suppose they have a reason, the only thing we can think the reason of this is; that they want to give the new men a show, & give them a bit of confidence.\n\nHad a good long yarn with Roper yesterday he is a card but a good honest fellow.\n\nThis morning we had our bayonet drill changed again for the 50th time, they are always altering the movements, but I think this new way is by far the most interesting so far.\n\nTo-day was payday, I have not drawn a penny since the 1st March. Weather is very cloudy overcast & thunder is hanging about, we \n\nhave had a few light showers.\n","11":" A big mail came in this after noon but it was mostly paper's.\n\nWe had no physical exercise this morning, I rather like the physical jerks myself, they undoubtedly keep a man fit besides improving his appearance. This morning we went to Sailly for a hot bath & a change of clothing a bit different to Anzac eh; its wonderful what a number of men they can deal with in a day, the water was splendid & we thoroughly enjoyed it. Yesterday was pay-day & talk about the drunks that drifted back to the billets about 9 oclock, it beats me all to pieces whatever they can see in the cursed stuff, if I had my way I would absolutely prohibit the sale of\n\nsuch dope as beer & spirits are.\n\nA rumour is pretty current tonight that the 26th Battalion had a very successful smack at the German's & killed no less than 200 of them.\n\nThis afternoon we had another cricket match No10 & 11 combined played 9 & 12. we batted first & run up 153 runs I run up 16 of them for the last wicket. Crane made 63 not out, we only played one innings as the light was getting to bad, so the other side will have to bat tomorrow evening.\n\nI handed in my subscription list this evening I collected 45 Franc's from our platoon so we have plenty of money on hand for our purpose. This morning on parade we had a gas alarm, talk about fun you\n\nshould have seen the buttons flying off the cover, it took us 25 sec's to get them on not so bad I reckon but there is no time to lose once the alarm is sounded, for a mouthful of the stuff is about enough to settle a man for life.\n\nThe weather is still holding fine, it was a little cloudy today but nice & warm, just right for us.\n","12":" Nothing much doing today except for the usual bayonet & rifle drill, & physical exercise first thing in the morning. Mr Graham our officer wants me to take the sec. of our Platoon. I have not made up my mind yet. I don't care much about the job.\n\nThe cricket match will have to be postponed for to-night I believe we have to find 100 men for a fatigue\n\nparty I don't know where we have to go perhaps the firing line.\n\nI am doing a bit of letter writing to-day I don't care much about the job but it has to be done all the same.\n\nSome empty shell case's dropped from the clouds quite close to our billets this morning, our chaps were shelling a German plane which was up early doing a bit of scouting.\n\nWhat a difference there is between these French people who are selling things to us & the Gyppos, they never want the money first like the Gyppos, but will put their basket down & you can select the articles you want & pay after, they trust us & we give them a fair & square deal.\n\nThe weather is very dull & cloudy & it looks like rain this afternoon.\n","13":" When we fell in last night to go on fatigue, the weather looked very threatening, so they phoned down from Headquarters for it to be postponed, & we were to hold ourselve's in readiness, so at 2 oclock this morning we were pulled out of our beds, the whole company, & marched off to the joint where we were to do our job, the work in question turned out to be trench digging & parapet building they are building a place to train bombers & raiding parties for their work, the place selected for this is fair in the middle of a nice crop of wheat it doe's seem a shame to spoil a good crop like we are but of course the farmer will get compensation, & another thing practically all of the ground here is under\n\ncultivation & it is nearly impossible to do any work without spoiling something or other, but such is the fortune of war.\n\nThey are getting our band together again so we will be alright for route marche's the 3rd Battalion have theirs going already, I heard it early this morning & very nice it sounded in the crisp air.\n\nYesterday afternoon while we were practicing rapid loading with live ammunition, a chap in our section accidentally let his rifle off but luckily no-one was hit, the same chap also stuck his bayonet in his leg pretty deep, which made the blood flow pretty fast, a stab from a bayonet is a pretty painful thing as I can testify for I done the same thing myself at Mena when we were there.\n\nThis evening Jock Mackie & I went down to Hqr's to see Len & while there had a game of cricket, our match had to be put off this afternoon for we had no ball fit to play with.\n\nAs I write this we are having a sort of sing song we have got a cornet or two going & an E. flat bass, we started off with the old familiar songs which never seem to grow old, & we are now on some of our favourite hymn's. As I write this the boys are singing \"The hymns of the old church choir\" I think this is a very pretty thing. Weather is fairly dull & warm.\n","14":" This morning we had bayonet fighting with our gas helmets on, they are a horrible thing to wear, it nearly makes you sick for the first time or two, your throat gets real dry &\n\nyour eyes start to water & smart like anything but still they are a very necessary thing for without them a man would be dead in a few minutes so we take it as a matter of course & put up with it as best we can.\n\nThis afternoon we finished our cricket match in fine weather it was an easy win for us for they only scored 63 in 2 innings. I kept wickets the whole time, which made my hands very sore for we have no gloves or pads as yet. out of our collection we bought a football but the cricket set has not arrived as yet. This evening I sent a letter home, I gave it to Ern Gelding who is going on leave to England tonight, one of our corporals caused a great laugh tonight for he\n\nfell fair in a rotten cess pit while playing football, he went in up to his armpits, I'll bet he will stink for a week or so.\n\nThere has been a very heavy bombardment going on for the last day or so, it sounds towards Ypre's.\n","15":" The whole company was on fatigue last night from 5.30 till 9 oclock we were working on the raiding trenches again, they are being built on the same lines as the German trenches of which our aeroplane's have taken photos.\n\nThis morning there are a number of Tommie's from the Labour Battalion working on the road opposite our billets they are nearly all oldish chaps. Went for a short march this afternoon through Deiully , they made \n\nthe pace a welter to I can tell you. There was a foot race between 2 of our chaps yesterday afternoon over a distance of 50 yards the stake was 20 Franc's, it was a runaway affair, for Hyde won easily.\n\nGeneral Walker & Birdwood were through here today they looked very pleased as they rode through, smiles all over their face. We had a fairly good issue of rations this morning including porridge sauce & pickles.\n\nThis evening we had a fine bit of fun we had a lot of officers up on our pitch having a strike, Kelleway, Withy, Jackson McKenzie, Graham Lawrence MacGregor & a few more, the fun was fast & furious for a time.\n\nLen was up again to-night he brought me up some paper's.\n\nThe weather is still keeping fine.\n","16":" In the billet where we are resting there are hundreds of bird nests mostly sparrows of course, you should hear them twittering in the early morning, you should see them up by the firing line, they are nesting all over the old ruins of the buildings, regardless of the noise of the guns all round them. they have come to regard it I think as an unusually long thunderstorm, they are another example of the phrophesing experts connected with this war, for I read on several occasions where these knowalls predicted that all the birds would clear out of France, how they are mistaken for that part of France swarms with bird especially larks, its lovely of an early morning to hear them singing\n\n& they are that plentiful that you can hear them above the noise of the guns, they console us by not caring about us, they show us the happy continuance of Nature, under our circumstances, as it is the birds nest in man-made ruins & go on with their eternal labour, & are the same now, poor things as they were in the day's of prehistoric man.\n\nChurch parade this morning & we had our band playing, an English parson conducted the service for our own parson has an attack of the mump's & is away. what a difference there is between an Australian parson & an English one theres lots of word's I can hardly understand of the English chaps sermon such a funny way they seem to pronounce them, after the way we are \n\nused to hearing them pronounced.\n\nA wire has just come through from Headquarters to say that the German's have a board out all along their line it is hanging on their barb wire, & it reads. (\"War will be over by","17":" they don't say how it will end, whether they will chuck it in, which dont sound very likely, or force a decision either way's would be very welcome to us, but we take it for what it is worth, for on active service one hear's such wonderful tales.\n\nHave been doing a bit of letter writing this morning, after church parade.\n\nOur cricket match was postponed this afternoon, so we picked up a team amongst ourselves & had a good game. Kelleway played on the opposite side to our team\n\nbut we won by 4 runs after a most exciting game.\n\nOur soccer\ns\n player's also won their match against D. company this afternoon, it has been a lovely day to-day, I hear we are going back to the firing line on 10th June.\n\n4 of our raiders had a narrow squeak the other night they were reconnoitring the section of the trenches they are going to raid, & they were right close to the German lines when they spotted a bunch of Hun's coming out of their trenches with fixed bayonets, & the next thing they knew was that they were surrounded by German's so the officer gave the order for them all to sling their bombs & rush through them, so they let go, & hanged if they didn't get through though one of \n\nour chaps got a splinter of a bomb in his leg, it was a lucky escape.\n\n29th. Our bayonet drill was advanced another stage this morning. I had charge of one squad on this work, another shot was fired accidently this morning but luckily no-one was hit.\n\nWe also had some drill in bombing squad's which is also very interesting.\n\nI believe there must have been a Zeppelin up last night, for the aircraft guns were going pretty heavy about 7 oclock or so.\n\nThere is to be an inspection of helmets & iron rations this afternoon.\n\nCapt McVean came back from England this morning.\n\n30th Those who were short of iron rations went up this morning, & got 7 days C.B. a bit hot I reckon.\n\nThis morning broke wet & cloudy it rained a fair bit of the night, so this morning instead of going out on parade we had a lecture on gas, methods of fighting it, effects, helmets, & etc which is fairly interesting.\n\nThere was a fair sized mail came in yesterday, & an awful lot of papers. The S.M. went on leave last night to England, I don't know how he got away so soon for there are men that should go before him including my humble self but I suppose he worked it somehow or other.\n\nI have got a pretty heavy cold on my chest this morning the first one for I don't know how long. I got it through being overheated when playing cricket or football I suppose, & not taking care of myself.\n\nYesterday afternoon 8 of our chaps were wounded by the premature explosion of a bomb, but luckily no-one was killed, they were practicing at the bombing school\n\nThey are feeding us fairly well here a sample of the rations would be \n\n1 loaf of bread between 3 men 1 tin jam for 5 men every other morning\n\n1 lb butter between 12 men a fair slice of cheese & sometimes a few tins of bully, while 3 times a week we have porridge & bacon, for breakfast one of these every other morning\n\nfor dinner we normally have a pretty good stew with plenty of vegetables in it, or rice & rasins or prune's we have plenty of tea twice daily that is for breakfast & tea, & now & again sauce & pickles.\n\n31st. Yesterday evening I took our bladder down to Headquarters & fixed her up, she had a small puncture in her & the cover also was starting to rip. About 10 oclock last night we were ordered to \"stand to\" & be ready to move off in 5 minutes, I think our fellow's started it, for last night the batteries changed over & that generally means a fair bit of strafing, from our billet we could see the German shrapnel bursting all over the place, it was a very heavy bombardment & lasted for nearly 3 hour's, I think the 3rd Bde got the brunt of it. I have not heard how many casualties there were. Had charge of our section yesterday for bayonet fighting & squad drill.\n\nThis morning myself & 4 others from the Company were sent to a gas\n\nschool for instruction, but we had an 8 mile walk for nothing for the school doe's not start till tomorrow, we are to have 2 days instruction & then we will have a practical demonstration.\n\nI felt pretty crook last night, & was very glad when they told us to get back to bed, but sleep with our clothes on. Received a couple of letters this evening from home. \n\nWhat a difference there is between these people round here & the ones nearer the firing line, I believe those towards the firing line are nothing more than Squarehead's, they certainly are not as nice as the people further back the real French people haven't got much time for the Flemish they do go crook if you tell them they are Flemish, round Wallon Cappel Hazebrouck \n\n& Morbecque they are plenty of them far more plentiful than the French.\n\nin France from what I can see of it all the butter is churned by the dog's, the way they do it is this; they have a big wooden wheel about 12 ft in diameter, & the bottom of this wheel is fairly broad about 12 or 14 inches wide enough to allow a good sized dog to get in it, once the dog starts it he has to keep going, & this drives the wheel, attached to the wheel is a rod which drives the churn, & so they make their butter, they generally have two dogs so as one can relieve the other, some say the cats are made to work, they reckon they hitch them up to the sewing machines, but this I can't vouch for, but it is quite true about the dog,s, they \n\nalso use the dogs for drawing purposes you will often see a small hand cart coming along the road & underneath pulling for their lives is one or two big dogs & I can tell you they are willing workers & very strong, they don't believe in keeping useless animals here they all have to do their bit.\n\nThey started our tug of war team to-day for the sports which are coming off shortly. \n","18":" Last night we had a concert at our billets, the band turned up & played some tunes in between the item's we had a fair crowd present.\n\nThis morning we went to the School of Instruction again, the school is a very fine residence easily the best I have seen in France so far, they say the Crown Prince made it his Head-\n\nquarters, & when he left it he said he would not shell it, because the people treated him so well, it is a very fine place alright & has some lovely lawns flower garden's & bonzer shady trees. The room where we had our lecture was the room he used to dine in.\n\nAfter the lecture which was very interesting we were taken down to some trenches where they put the School through their tests, here we were shown gas proof dugouts & instructed how to build them, & also shown the working of the Vermal Sprayer & various other things connected with gas, we were then taken down to a big shell hole, & the Instructor was telling us all about the Lachromatry or teargas just when he had us all interested, a smoke bomb was \n\nexploded, you should have seen the rush hardly one of them thought about putting their helmets on, it was a catch alright & caused a great laugh, you should have seen our officers run it was dead funny.\n\nTo-day has been a great one amongst the French people, all the women & girls have been out dressed in their best & the little girls were all dressed in white just like a bride going to her wedding & the small boys were all dressed in black suits like a man & wore white ribbons and bows on their arm & bowler hats on their heads, it must be some religious ceremony.\n\nMr Hughes & Fisher General Birdwood & staff reviewed the Brigade to-day & we also had Battalion Sports. So the boys have had a pretty lively day.\n\nLast night a raiding party of Germans broke into the 11th Battalion trenche's but never a one got back again, they bayoneted 32 of them including a Prussian Guard officer they had no fewer that 28 bayonet holes in him\n\nAccording to report these aerial torpedoes are pretty crook things, they reckon they caused nearly all the casualties the other night, one of them lobbed right among a squad of Lewis gunners & blew the lot of them (7) to atoms. I saw a great aerial fight to-day between a Taube & one of our machines I don't know how it finished up but the Taube had the worst of it & was being forced down when I saw them last\n\nThere was a great string of barges towed down the canal past Sailly to-day there were about 20 of them\n\nin the string all loaded up, these barges are easily 100 feet long 15 ft wide they carry some stuff I can tell you, a lot of them were loaded with crushed blue metal for the roads, all stone for this part has to be brought here, for there is practically no stone here whatever, you would search a long time here without finding a stone.\n\n2nd. Last night one of our observation ballons broke loose & drifted over the German lines, when she first got loose she rose pretty rapidly how the squareheads shelled her, they painted the sky, red & white with their shells at last one of them hit the gas bag & she started to slowly descend all the while under heavy fire, she went down gradually & I believe she sank in the German lines, they never\n\ngot the observer, for he came down in his parachute, I suppose the Berlin papers will magnify this to a wonderful degree, & will hold forth on the marvellous shooting of their gunners.\n\nWe completed our course at the School of Instruction this evening it was a very interesting subject & one I took the greatest interest in we went through the real thing this afternoon, in the gas line, & the helmets showed up good, we also had a taste of the tear shell, how it makes your eyes smart & water it has the pineapple smell with the onion effect doubled 10 times once this affects your eyes, a man is useless for 3 or 4 day's, the goggles provided for the purpose \n\nare very effective, & when properly adjusted are proof against tear gas On the way home we called at an Artillery station & brought some smoke bombs away with us, from there we crossed the Canal in a punt which saved us a walk of easily 2 miles. Today nearly all our company were sent to Bacstinaur on fatigue the work in question was loading barges with coal, after they finished they had a hot bath.\n\nI hear Capt McKenzie is going to make enquiries over my leave, & find out why certain persons have gone before me, who were not entitled to it.\n\nWhile in Nouveau Monde to-day a lot of Welsh\" came through, they were going out to their billets, as we were coming home to old Fritz shelled Levantie\n\npretty heavy with shrapnel & high explosive, they are always shelling this place for something or other The weather lately has been cloudy and warm, not unlike rain hanging about.\n\n3rd. Back again at the old game more bayonet fighting & etc, we are pretty well trained by this time.\n\nPay day is around once more, & the boy's are happy as larks, I guess they will all be drunk as lords tonight\n\nA fellow see's very little silver in this country, practically all trade is carried on with paper, we have notes from ½ a franc up to 20.\n\nThere are great gangs of men working on the road quite close to our billet this morning, they are almost putting a new coat of metal over it, & cleaning the drains out properly.\n\nAbout 4 days ago I mended & washed a pair of shorts I had, & hung them on an old apple tree to dry, but when I went to get them they were missing, so I kept my eyes open, & hanged if one of our chaps didn't have the cheek to wear them this morning I frightened the life out of him, he made all sorts of excuse's to try & clear himself\n\nThis evening our cricket material turned up, & the boy's are bashing away as I write, we will have a bit of fun now for a while, it is money well spent for you can't beat a bit of sport in your spare time\n\nLen was up tonight & brought a budget of papers with him.\n","19":" Church parade again this morning General Birdwood & Staff were there, & he made a little speech\n\nin reference to the naval defeat our ships have just had in the North Sea he warned us to be careful & not let the German's get their tails up, but to give them fits whenever we have the chance, he then told us about the two partes of German's that have raided our trenches & the reception they got, the first one attacked the 20th Battalion & broke into their trenches & captured a few of our men.\n\nThe next time they smashed the 11th. Battalions trenches to pieces & then they charged, but they were facing a different Battalion this time & one with a Gallipoli name behind it, our chaps of the old 1st Division simply smashed the Huns to pieces & drove them back in double quick time, they got their first proper taste \n\nof good Australian steel & lets hope the forerunner of many more.\n\nJust as the parson finished the lesson's he asked General Birdwood if he would mind us sitting down on the grass, for answer he just sat fair down on it himself like the rest of us, although there were chairs there if he had liked to have sat in them. These are the sorts of things which make him so popular among us, he is almost idolized among the boys as he always calls us.\n\nAfter the review was over we marched past him & away home to our billets A big swag of our Company have gone away on fatigue. I am mess orderly today a job I dont care much about. I am going to wash my pants this afternoon for my \n\nleave is getting very close, & a chap must have a clean pair of pants to have a look at England in.\n\nI hear that Lieut Davidson was shot dead accidently yesterday by some of our chaps at the musketry school I feel sorry for his mother for she has lost both husband & son now in this war Major Davidson was a bonzer chap & he was killed at \"Lone Pine\" on the 18th August last year, we were all very sorry he went under The days are very long here now its light at 9 oclock in the evening & again at 3 oclock in the morning so you see we don't have much darkness to sleep in. I have seen a good few partridges & hares about here at times but of course they are out of season for shooting\n","20":" Had a good long game of cricket yesterday evening, its bonzer here playing of an evening\n\nThis morning 3 of us went down to the Q M.S & drew 1000 rounds of ammunition, most of which is for the reinforcements, of which we have a few more. That done we were sent over to the bombing school to get some bombs, & while there saw a Stokes mortar in action, they were showing our Brigadier Smythe the working of it, the raiding party is also training here for their little affair which is coming off very shortly.\n\nTook our ball down to Hqrs again to fix the puncture up.\n\nThe 3rd Battalion are out route marching to-day with full packs\n\nup, there is also a fair swag of artillery on the move to somewhere or other \n\nI heard something more about my leave this morning Capt McVean called me in, & asked me why I had not been away for my holiday, I told him, he said it was a shame, & would see about it quick & lively, Sgt Gelding came back from his leave this morning.\n\nMy cold is still pretty severe, she has been a snifter, I get them very seldom but when I do they are beauties\n\nThere is no parade this afternoon but we are falling in at 4 oclock so as they can get the entries for the sports which are coming off shortly.\n\nThis evening after having a strike I went & saw our Company football match it was Union Rules & very rough I'm hanged if I can see\n\nanything at\nt\n all interesting in it it seems just a rough & tumble to me after being used to \"Australian Rules\" which I consider is a far superior game.\n","21":" Went on a fatigue to Sailly this morning & it rained cats & dogs all the way, when I had been there about an hour or so, a chap came up from Headquarters with a note to say that I had to go back to my billet, as I was to go on my leave to-night, you should have seen me drop the pick which I was using When I got back I reported to our Captain, he told me to pack up & be ready to move off at 6 oclock I was also informed that I had a stripe to put up, so the day wasn't a bad one for me\n\nI am taking no less than 38 letters with me & about a dozen parcels of all sizes & sorts.\n\n7th. Arrived at Steenwerck last night per medium of a motor bus, slept all night in the YMC.A. Hut there, & caught the leave train at 4.30 in the morning, the journey from Steenwerck to Bologne took us about 6 hour's the country all along the line looks lovely for the recent rain has done it the world of good, & crops are forward.\n\nOn arrival at Bologne, we were marched around to a big building, where we had to wait for an hour or so for the boat to come in, they have fine big hot baths in this building & needless to say I was not long in getting under one & washing some of the sticky Flanders mud off me, that done I\n\nbought some cherries, they looked so tempting, & I had not tasted any since leaving Australia, there are also some fine canteens in the old house one for every floor.\n\nAbout 2 oclock & there was a great rush set in, for the boat was about to leave so we were all formed up once more & marched down to the ship, we went straight on, & collared the inevitable life-belt wherever we go they seem to follow us like bad pennies.\n\nJust before we embarked we heard the news of Lord Kitchener death but scarcely anyone believed it, we all reckoned it was another \"roughie\" but unfortunately it turned out to be only too true.\n\nOur trip across took us nearly 2 hour's there was nothing of any importance \n\nhappened except perhaps it was quite rough enough for me, & the great swag of officers on leave compared to the men it was very noticeable, & they in their usual selfish style took up about half the accommodation of the ship.\n\nWe were escorted nearly all the way over by a destroyer, the first sight I had of old Englands shore's were the white chalk cliffs which we have all read & heard about so often, who would have thought a short 2 years ago that I would be crossing the English Channel on my way for a well earned holiday.\n\nFolkestone where we got off at is a pretty big place, & very neat & clean all the houses seem to be built the same way, you can easily see that it is a very ancient place, after getting off the boat, we slipped straight along\n\nto the train which was waiting for us, the carriage I got into I thought I had made a mistake at first, I could hardly believe that they were 3rd class carriages, they were got up so well the seats & backs are nicely padded & they have bonzer springs, in fact the whole get up of the compartment is nearly as good as the","22":" class on the Australian Railways this might seem exaggerated but\ns\n its true all the same, & although they travel very fast you can talk in the natural tone of voice & be heard quite distinctly, it took us 2 hours to travel from Folkestone to London 80 miles I think it is, the whole journey you pass through country very much like the South of France, & when you get into Kent there is nothing but hop fields & orchards all the way.\n\nit is a lovely trip, & I thoroughly enjoyed it , we ran into Victoria Station about 7 oclock, talk about a crowd of people they formed us up again & marched us out through the people how they clapped & cheered us, theres no doubt about the popularity of the Colonials.\n\nMy first impression of London was nothing out of the ordinary, the streets don't seem to be as busy as George, King or Pitt streets in Sydney, & the buildings are all of a dark grey colour at the same time any fool can see that she is a mighty city.\n\nThey took us down to the Australian Hqr's first, & there I handed my rifle in, I then struck out for Peel House, & on my way down saw Bert Miller, & Alex Howarth arrived at Peel House I took a room had a good wash posted 40 letters\n\nhad my tea & here I am scribbling away in the fine reading & writing room attached to the House.\n\nI was not long in striking a girl although I had my old clothes on I was looking about this evening for the South Western Post Office when a girl overheard me asking a chap for the direction of it she straight way took me in hand & took the trouble to take me around personally, it was not bad of her she seemed a decent sort too. When we were being marched down the street the Kids would carry our rifles for us & they are as proud as Lucifer over it.\n","23":" Stopped last night at Peel House & after breakfast went round to the Australian Hqr's & got fixed up with new boots breeches & tunic, they allowed me 14\/- on my old tunic, but \n\n \n\neven then it cost me 34\/-, it has taken me nearly all the morning to get fixed up, & when I finished I came round to the house again to put some of my purchase's away & then went into the waiting room to scribble a line in my diary before dinner, when I sat down , I thought the chap opposite me \nlo\n was looking pretty hard at me, & at last he asked me where I came from, I told him he then to my surprise asked me which Barwick I was, Arch, or Len, I was dumbfounded, for I had not the slightest idea who he was I made all sorts of guesse's, but could not strike him, who do you think it was: why Jack Kearney I would never have known him he has changed so, he tells me \n\nhe is going home on the 20th. got a bullet in his thigh, & the wound wont heal it keeps running, who would have thought a few year's ago that we would have met in London of all place's, Jack is going about on crutches so his leg must be fairly bad.\n","24":" Yesterday I roamed all about London & saw the Tower Bridge, Bank of England Mansion House, Westminster St Pauls Cathedral By Jove shes a magnificent building, easily the finest as ever I have seen, it took just on 314 years to build it anyone reading this would scarcely believe it, but wait till you see the place then I'll guarantee you would wonder how it was built even in that time, I am not going to\n\ntry & describe it for it is impossible just imagine my feeling when strolling in this old place almost the heart & soul of the British Empire there are some bonzer pictures in there including The Light of the world,\" & the carvings are all in solid oak hundreds of years old, & they have a beauty all of their own, how long it took to carve some of it I have not the slightest idea, the old place is also full of monuments & statues erected to all of the great men for the last couple of hundred years.\n\nI was not in the crypt yesterday but am going in to-day, there is a fine monument erected to Wellington built out of the brass from captured cannon at Waterloo, all round it are engraved on plates the battles\n\nhe had fought & won, & hanging from the walls are old torn & tattered flags which have been in many a fierce battle, relics of Englands past glory & brave men. I spent nearly 3 hours in St Pauls & then never saw half of it, from there I wandered about the busy part of London, I dodged the heavy traffic alright but got bushed about a dozen times during the day, I had my photo taken yesterday also, don't know how it will come out I am going to have a look at the proof to-day, after wandering about till I was tired I came back to Peel House had my tea, & then went down to Victoria Station to see the Leave train in & to meet a mate of mine who I expected was coming in, a great crowd had collected there all\n\nwaiting for the train, I saw something here that satisfied me about the popularity of the Australians, the first to come through the barriers & pass through the crowd was the British Tommy & then followed the Canadian's, when the latter appeared the people raised a feeble cheer I thought they were the last & no Australians had come but still the people stayed there I was just about to turn away, when for some unexplained reason the people began to surge towards the middle, then all of a sudden a mighty cheer went up & the girls waved their handkerchiefs & clapped the boy's as they came swinging along all dirty & mud stained from the trenches, swinging\n\nalong in the free & easy style which belongs to the Australians only. Bravo boy's Welcome to London,\" Well done Australia\" & so on, yes if ever men were popular well the Australians are in England the people followed us along the street & the boys carried the rifles of the men down to the Australian Hqr's They think the same of the N.Z. too. This is no silly idle vapouring but its true absolutely.\n\nIt does not seem fair in one way for the Canadians have done a lot of heavy fighting & have fought well for England, & so far as I have found them fine fellows but there you are the Australians & N.Z. have captured the English peoples fancy & from what I can \n\nsee of it they are going to keep it they have held it for well over a year now, you would scarcely believe how jealous the other troops are of the Australians.\n\nHad supper last night at the Anzac Buffet\" they are a fine lot of people there nearly all Australian girls, & where I am stopping the work is all done free by the English ladies, & they are splendid the women of England like France are doing a splendid work. There are plenty of women ticket collectors on the bus & trams here. One thing is very noticeable here & that is the almost entire absence of horse's on the streets of London. This afternoon I sent a telegram, to Mr Duke at Littlehampton to ask\n\nhe would be home if I came down I got an answer 2 hours after, saying; yes come at once.\n\nSaw Tom Kearney this afternoon he has not changed much.\n\nHave been all around Trafalgar Square, saw Nelsons monument (whe the Kaiser say's Peace will be Signed) Downing Street where all the Heads live, the War Office & the Cavalry mounted as sentries dressed in all colour's, have been down the Strand & Fleet Street. I saw General Joffre just out side the War Office he was over on a big war conference, no doubt the amazing success of the Russians & the naval battle had a lot to do with it, there was a great crowd waiting outside to see\n\nhim, & he got a good reception from the people, the more I see of London the better I am pleased with it, she is a magnificent place & as easy to lose your way in as falling off a log.\n\nI went back to Peel House, fixed up my parcel's, I then struck out for Victoria Station\" but found I was an hour early so being hungry I went & invested in a meal at Grosvenor House Hotel a swell place right close to the Station.\n\nI got my ticket to Littlehampton & got in the train & away we went, the train was fairly crowded, & we seemed to be going through London for miles & miles before we struck the country when we did break away it was splendid for we passed through \n\nmile after mile of what they call the Down country, of which Sussex is one of the Counties, & it is splendid I never saw better grassed paddocks in my life, & the stock were all rolling fat, the journey took about 2 hour's reaching Littlehampton about 10.30 that night Mr Duke was there to meet me, arrived at his (9th) house which is a bonzer, & has lovely gardens & lawns, I was introduced all round, & made to feel at home, had some supper & went to bed, the bed I slept in was of solid oak, & \nwa\n is I think of great age, it was the best bed I have slept in since leaving Australia, I never woke no more till about 8 o'clock next morning I then got up had a bath, dress-\n\ned & went down to breakfast; where I found them waiting for me.\n\nAfter breakfast Mr Duke took me all round the town. She is a fair sized place & everything remarkably neat & clean, the houses to are very fine & solid, & most of them have ivy climbing all over them, he took me all round the promenade which is a very fine one there were hundred's of kids on the beach building castles with the sand & so on, he also took me round to his offices & workshops, we then went back for dinner, after dinner we went to Portsmouth the great naval base she is a big town & is well fortified as we all know, from the station we went onto a ferry boat & had a trip over to Gosport, here we engaged\n\na boatman to row us over to Nelson's old flagship the Victory a guide showed us all over her showed us the spot where Nelson was wounded, & where he died, there are some very fine pictures on her of scenes depicting Nelson life & career, she still has the same type of old muzzle loading cannon on her as were used in those days but she has 4 only of her original cannon's left, she carried altogether 104 guns & the biggest gun she had only threw a solid ball of \nstel\n steel a distance of 500 yards & weighed 32 lbs some difference to-day.\n\nThe old sails are still preserved on her they have 150 cannon ball hole's in them, 2 of these old guns are fired daily, one at 4 oclock in the morning \n\nwhich signifies the opening of the Port, the other at 10 oclock at night which closes the port to all shipping. The spot in the Victory where Nelson died is always covered by a big wreath, a fresh one is put there every 21st October the anniversary of his great victory & remains there till the next year comes round thus England keeps green the memory of the greatest sailor who ever lived & is ever likely to.\n\nThe old oak she is built of is as sound to day as when it was put in 135 years ago, she is kept spotlessly clean all over\n\nA lot of Nelson's writing both in letters & in orders are preserved in glass case's on the old ship & such was the quality of paper used in\n\nthose days that the documents are still in first class condition\n\nI bought 2 souvenirs on the ship both little pictures of Nelson & his ship, we spent nearly 3 hours on the old historic ship & then went back to Gosport, from there we went back to the \nPlymouth\n Portsmouth Town Hall which is a very fine building from there we went to Southsea a great seaside resort, from here you can see the Isle of Wight quite plainly she looks to be fairly heavily wooded, there are a good few of the old English oaks about here.\n\nWe left Southsea after a most enjoyable day & caught a train at Portsmouth which run us back to Littlehampton a distance of about 20 miles & so on to tea, just as we got in the \n\ntrain at Portsmouth a heavy thunderstorm broke which had been brewing all day, we just missed a good ducking. In the morning before we set out on this trip Mr Duke took me around to a Dr to see if he could do any thing for my severe cold he gave me a prescription which I got made up at a chemist's.\n\nThe people about here look on me a bit of a curio, for an Australian is a pretty rare thing in these parts.\n","25":" Got up pretty late this morning as it was Sunday, had a fine breakfast of fish, plaice they said it was, about 11 oclock Mr Duke a friend of his Mr Elliot who has been a fair while in Tasmania & is a jolly nice fellow, & myself went for a walk round the country at the back of Littlehampton, the country\n\nis beautiful & the grass & crops bonzer, we reached home about 1 oclock had a good dinner then Mr Duke Miss Sparks & myself went in a motor for a tour round the district, Sussex scenery is indeed magnificent, the elms, oaks, beeches, birch's & etc are all over the place & in parts of the road they quite meet at the tops & shade the road completely, while wild roses hawthorn, poppies, daisies, violets & etc are all over the place, it is almost impossible to imagine prettier country, it is almost perfect just like the old English scenes we see in the pictures. We passed quite close to Arundel Castle\" a great big old stone building, it is the seat of the Duke of Norfolk who is a \n\ncatholic & has built a small catherdal quite close to the castle. This old Castle is famous for something in history, I cant think what it is. After we had been out for about a couple of hours we pulled up at a fine house a friend of Mr Duke's & had some afternoon tea there. About 4 oclock we started off again & run through some old English villages they are quaint old places with a lot of thatch for roof's & are all without any exception built of stone or brick & have nice flower garden's in front of them, & ivy climbing everywhere, you should see how the ivy climbs the old oak trees, they practically cover the trunk of it, it looks very fine. We went right through the chalk country you can see it everywhere\n\n& in places there are great bare white patches showing on the hillsides, from the chalk country we got on to the famous Downs the home of the Southdown sheep & it is lovely country, finer you will never see, the roads too are something splendid, there is scarcely a hole in them big enough to put a half crown in, we crossed the Arun\" river twice through here she is not very big, not as big as the Coal river but runs fairly fast, they say the fishing in it is pretty good.\n\nAll the stock through here were rolling fat & looked well.\n\nCycling seems to be very popular among the girls round this part I saw scores of them on their bikes riding about the roads.\n\nWe reached home about 6 oclock after a most enjoyable ride of about 4½ hours during which time we covered a lot of ground, & the scenery I shall never forget.\n\n12th. Left Littlehampton this morning after a most enjoyable stay, since I have been down there I have done nothing but run about in cars, visiting people, & eating off silver plate of the finest quality for Mr Duke is one of the heads of Littlehampton & he has taken me round to all the principal people of the town & they have treated me splendidly I must say the English people I have come in contact with are splendid & thorough gentlemen, & the girls & ladies are tip-top, I have been treated almost to well.\n\nYesterday afternoon I believe there was a tremendous reception given to the boy's they were some of a most successful raiding party which entered the German lines done a lot of damage & brought back some prisoners. There is also in London here a big motor firm called the \"Anzac\" & a new seaside resort Anzac on the sea. The train I came on this morning came right through without a stop, she pulled up at London Bridge, I then had to catch a train to Victoria & from there I walked round to Peel House where I am now scribbling these lines, there was some rare fun last night packing up the little pictures I bought from Portsmouth Mr Duke would insist on packing them he is a \n\ncharacter all right he got some tacks hammer cardboard, pine brown & tissue paper scissors knives string & etc by the time he finished the table was littered with things & he had to give it up & let Miss Sparks finish it, he also gave me a photo of himself, & is going to send it home along with the parcels.\n\nI must now leave off for I am going to dinner, I think I will go to Llandudno tonight, to-day is a miserable one in London for it is drizzling rain.\n\nMet McGrath at dinner time & afterwards went out for a look round town again, we went up in to Cheapside & done a little business from there we went to St Pauls catherdal had a good look round it & then went down to the crypt, where\n\nall the noted men of England have been buried, all are buried with the exception of two beneath the stones of the crypt the two exceptions as you might guess are Nelson & Wellington, they have also got the immense carriage which Wellingtons body was carried through the streets of London, & on it are the weapons they fought with in those days a most interesting collection, in here we fell in with two ladies who volunteered to show us St Bartholmew's Church the oldest in London dating back from 1131 it is carefully guarded as it is a precious possession. In this old church you will find plenty of old oaken tablets with the old fashioned English way\n\nof spelling just close to this old church there is a brass tablet erected to the memory of the martyrs who were burned to death by order of Bloody Mary, St Bartholmew Hospital is just close here too. From this old church we were taken round to the famous Smithfield meat markets they are most enomorous things nearly a quarter of a mile long containing hundreds of thousands of beef & mutton carcase's & are an eyeopener alright.\n\nFrom Smithfield we struck off home had our tea, & then set out for the Gaiety, here we booked 2 seats which cost us 13\/- for the Dress Circle the play was entitled \"Tonight's the night\" & was a scream from start to finish.\n\nThe streets in London are quite dark of a night for all lights are shaded on account of the Zeppelin's. I have not seen a single bit of damage so far that they have caused I expected to find London in a more or less patchy state but all the damage they have done is trifling compared to what is claimed by them. It has been raining practically all day today.\n\n13th. Another dull day, this is one of the wettest summers London has had since 1903 this morning I am going to Burlington House Academy to have a look at the pictures there. Saw Digby this morning.\n\nI picked up with a New Zealander down the street this morning & he & I went & had a good look \n\nthrough Westminster Abbey it is a lovely building rich with \nl\n statues of all the famous men of olden times, from there we walked over London Bridge & doubled back to the Museum, it is a wonderful show \nwh\n we spent a couple of hour's in there, after that we had dinner, & then went to a picture show & saw the Williard -Moran fight, from there we pushed on up towards St Pauls for the great Memorial Service was being held there for Kitchener & the King & Queen were there we saw them as they drove through the streets they were in a carriage & were escorted by all sorts of flunkeys & soldiers the King was dressed in a kakhi suit.\n\nAfterwards I got into Cheapside & bought 2 picture albums one for home & the other for Aunt Amy posted & got them away, & came down per medium of a bus & had tea, I think I will go to the Adelphi tonight & see what she is like I heard to night that there are a lot of Australians at Salisbury Plains, they reckon they came from Egypt.\n\n14th. Last night I was talking to Lady Murray & she asked me if I would care for a ride in her car as far as Picadilly, so away I went she is a real nice lady her husband was wounded the day before Kut fell & is now in India, she takes a great interest in Peel House & spends nearly all her time \n\nthere. After getting out I went & booked a ticket at the Criterion\" \"A little bit of fluff\" was on there & it was the funniest thing as ever I have seen in my life it was a scream from start to finish I shall not forget it for a while I'm thinking, the theatre is not a very large one but elaborately fitted up & very fashionable & expensive.\n\nLast night I saw the searchlights for the first time sweeping the sky all around on the lookout for Zeppelins they look very pretty with their great white beams of light searching the dark looking heavens for the baby killer's.\n\nThe room where I am writing this in is as you may guess at \nPell\n Peel House there are lounges &\n\n \n\nsoft easy chairs all over the place bonzer writing tables with all conveniences, & plenty of small tables with papers, matches, games & etc on them, the windows of which there are 6 large ones with 3 bays to each are heavily curtained & fine pictures hang on the walls & big bookcases are placed here & there, while the floor has a lovely carpet on it that thick & soft that you can't be heard walking on it, while at both ends of this comfortable room big bright coal fires are burning for although it is Summer time it needs a fire I have scarcely seen the sun since I have been in London, at any rate such is the room & comforts here just imagine a chap\n\nhaving to go back to trench life again, & roll in the mud get lousy dirty, & nearly sick of life again after his holiday is over I'm afraid my spell is going to make me discontented & can you wonder at it.\n\nThis morning a party went from here I was among them we had 2 lady guides, & they took us to Parliament House, what a lovely & magnificent building it is from the outside it is built right alongside the old Thame's, civilians are not allowed inside but soldiers are privileged so we were taken through it, inside the house is magnificent lovely marble floors stained windows snifter painting depicting all the old time scenes & battles, coronations, portraits\n\n& etc, splendid chandeliers hanging from the ceiling are everywhere we went through a lot of bonzer rooms, & at last we pulled up in the House of Lord's it is not such a very big room but got up splendidly we were shown where the Lords sat & the Bishops the King & Queen, Speaker, & the meaning of the word Woolsack was explained to us, from the House we went into another room a sort of Hall it is & in it are 2 paintings one of the meeting of Wellington & Blucher at Waterloo, & the other the Battle of Trafalgar & death of Nelson, they are most enomorous things they are easily 40 feet long & about 15 feet wide & are worth seeing every little \n\ndetail seems to be painted in just through this is the Kings robing chambers it was never properly finished on account of the cost. From here we went into the library & saw the Death warrant of Charles the 1st & the Signature & seal of Oliver Cromwell, it is in a splendid state of preservation even though the ink & paper are nearly 300 years old they made things properly in those days, the next thing was The House of Common's it is nearly the same size as the House of Lord's & pretty much the same to look at, the guide told us all about it & pointed out the spot where Pemberton Billing leaped down into the House when the question of steel helmets for\n\nfor the troops was under discussion & also the places where the Suffragetes used to chain themselves to the iron bar's.\n\nI can say that I have sat in both the House of Common's & Lord's now if only for a minute, just fancy Englands Colonial troops strolling through these old places who would have thought it a few years ago.\n\nInside the House's of Parliament there are hundred's & hundred's of room's each one a thing of beauty in itself, the building must have cost millions to build From Parliament house we went to Westminster Abbey one of the oldest & most famous of English churche's it dates\n\nback to the 11th century, & contains the remains of nearly all the old Kings & Queens of bygone days Richard the first & 2nd Henry 5th Henry 7th Oliver Cromwell Edward the Confessor (lived just after Harold about 1112) Mary Queen of Scots. Where Richard the first is buried there is a great big black marble tomb not a bit of carving or engraving on it, for when he died he said his tomb was to be finished when Scotland was conquered & not before, Scotland was never conquered so the unfinished tomb is still there & likely to be.\n\nHenry 7ths chapel is a marvellous piece of work, they say it is the finest piece of Gothic work in England, how on earth the \n\nenomorus weight of stone hangs like it does from the ceiling with out any visible support beats me it is a lovely piece of work to look at & jealously guarded.\n\n15th. I done a mad hair brained thing yesterday if ever I did in my life before, at a quarter past 2 I suddenly took it into my head to rush down to Llandudno & see young Routledge, when I made this decision I was at our Head quarters & was going to get my rifle & bring it round to Peel House, I got the loan of a Bradshaw & after a few minutes search found that a train left Euston Station at 2.35 so there was no time to lose I bolted outside hailed a taxi, & told him to drive for the \n\nlick of his life round to Peel House so as I could get my overcoat, got round there alright, & picked a Tommy up who was going to Wale's, then commenced a mad race through the heavy traffic it was touch & go but we got there by 2.30 after paying the taxi I had to race down to the R.T.O & get him to alter my pass from Aberdeen to Llandudno, this took a minute or two, & just left me enough time to hop into the train as she was moving out, I dare say some of the people thought me mad. The trip down took me till 8.30 that night, we passed on the way Rugby, Chester, & Crewe they are all big place's, & at the latter place we changed trains for Wales.\n\nThe country through this part is\n\nvery much like the rest of England the scenery in Wales is very good it is more mountainous than England\n\nOn arrival at Llandudno, I went to Routledges place at once, & found he had just gone to Australia, wasn't I stiff after coming so far, so I decided straight away to get back as soon as possible on enquires I found that a train was leaving for London at 9.15. so I went back by it, so I did not get much of a look at Llandudno.\n\nReached London on the return journey at 5 oclock & took a taxi down to Peel House & here I am after my mad journey as hungry as a hawk. This afternoon a party of 20 men including myself went to a garden party at Sir Ian Hamiltons house\n\n2 ladies kindly escorted us round to the place on arrival there we were taken out into his garden a beautiful place, & in a few minutes he joined & shook hands all round with us, he then introduced Lady Hamilton to us she is not a bad sort Sir I Hamilton sat down on the grass with us & yarned away quite naturally the talk naturally turned on the old Gallipoli campaign, & many a laugh he had when we told him some of our experiences.\n\nAfter about an hour spent this way we all made our way to the dining room for afternoon tea was on & a right good spread we had.\n\nAfterwards they started a concert & it was very good we thoroughly enjoyed it, they separated all the \n\nall the Colonials from the Tommies there was a good mixed lot of us including, Australians New Zealanders, South Africans, Canadians, New Foundlands so the Empire was well represented, after the concert was over Sir Ian Hamilton his wife & all the rest of his guests shook hands with us at the door he is a fine chap all right is the General it's a pity he has not got some of our lads today, By Jove he thinks a lot of the Colonials & he is not frightened to say it outright. We walked a little distance then caught a tube, & so home.\n\nMcGrath & Digby were at the Garden party & old Digger gave the General his views on everything & the war in particular, he made the General\n\nlaugh at some of his saying's.\n\n16th. Last night I went & saw \"The Show Shop\" at the Globe\" it was very good, I got home pretty late & had a good hot bath for it was my last night in glorious London surely one of the finest cities of the world. I shall never never forget the time I had there the kindness of the people, the pretty girls, the taxis the play's & the roar of old London, it will sound in my ears for years to come & I shall always look back on it with pleasure \n\nat 10 minutes to 8 this morning we left her for good, for our leave was up & we are returning to; what.\n\nI am writing this on the boat that is taking us away from good old England, it took us 70 minutes to do the 60 odd miles down some \n\ntravelling wasn't it, I shall never hear England run down in the future, I have had my eyes opened the way they look on & treat the Colonials is enough for me.\n\nThe run across the Channel was fairly smooth thank Heaven' we had a full cargo of troops, & didn't they all look downhearted but we are beginning to cheer up again, now we are in Boulogne, they marched all the Canadians & New Zealander's & Australians round to the same big old building as we were in when we came down from the trenches, we stopped in this building until nearly 6 o'clock we then marched up to the railway station where trams were waiting for us, as we marched along we \n\nwere sorted out for the Canadian English & Australian's had different trains to catch, we were hanging about nearly 2 hours before we started but of course this is the same old military style, they generally keep us hanging on for a few hour's, as if it didn't matter at all.\n\nAt last we got away the sun was going down & the sea & Boulogne looked very pretty in the fading light, just outside Boulogne are 2 very big tunnels, once outside these we soon worked a fair pace up, on the way up between Boulogne & Calais there is an enomorous shed for airships I think it belongs to the French.\n\nWe reached Steenwerck about 12 o'clock & the motor buse's were\n\nwaiting for us, we were soon away & now I come to the exciting part of it, we had travelled about 2 miles when a strange smell came our way, I knew at once what was the matter a gas attack, for I knew too well what gas smelt like for I had been at the School of Instruction & we had a practical demonstration of it there, I at once shouted out for every one to put their helmets on but the majority of them laughed at the idea of it they reckoned it was only petrol, or lime, but you should have seen them about 10 sec later, some were sick some were gasping for breath & others were choking the car was at once stopped but we had run nearly 200 yards into the gas cloud, you\n\ncould see it quite plainly it looked like a bluish white cloud of smoke that kept on coming in billows some thing like waves roll in on a beach I just got my helmet on in time for I was beginning to stagger, my lungs seemed fit to burst & they were beginning to burn like anything while my throat had a choking sensation in it just as if some one were throttling me I reckon a couple more mouthfuls & I would have been a stiff one.\n\n2 chaps went out to it, I helped one chap to put his helmet on for he was nearly done, I think one chap will die alright from the effects of the rotten stuff, we were extraordinary lucky to get out alive, only presence of mind saved us for all concerned took it very cool indeed\n\nThat was a nice reception to get just as we were coming back from leave wasn't it, you should have heard the noise when the alarm was given, all the bells were set ringing whistles blown from the barges & engines, cans were beaten like mad so as everyone would be prepared for it, all civilians have their helmets you know within the gas zone it seems funny to see the little children running about with gas bags round their shoulder's, but it is the only way to protect yourself for the helmets are absolutely safe when properly put on everything depends on the speed of getting them on correctly, all gas casualties are caused in the first 2 or 3 minutes of an attack When these attacks are on they\n\nhave to gallop all the horse's within the danger zone as hard as they can lay their heels to the ground, to save them they seem to know something is the matter for they go like wildfire all stock within a certain radius are killed this was the first gas attack on this part of the line for nearly a year I think the New Zealanders got it about Armentieres for it seemed to come from that direction, to make matters worse they also sent over a lot of tear shell gas which affects the eye's very much\n\nWe were in our helmets for about an hour & a half we then took them off & started to walk on up to our units we had to walk about 9 miles to reach them so you can bet we were not half tired by the time we go into the trenches where the 1st &","26":" Batt\n\nwere, I was immediately pounced on by the boy's for all wanted to know what kind of a time you had in England\n\nAfter I had my breakfast, spare the mark for it consisted of a piece of fat bacon & a small piece of bread washed down with a mug of tea. I went down to our Doctor for my chest was pretty tight \nfo\n & I was feeling none to rosy on it, he gave me some capsules, & said I would have remain down with him for the rest of the day so as I would be under observation, so here I am stretched out on a stretcher in the warm sun scribbling away as per usual.\n\nThere are plenty of aeroplanes up this morning & the anti aircraft guns are kicking up a devil of a row but that's all about they seem to be doing wasting ammunition\n\nWhen I came back I had a few letters waiting for me which were very welcome.\n\nThis afternoon there was a wonderful sight in the sky no less than 8 aeroplanes were fighting 5 German & 3 British one big British battleplane fought no less than 3 Taube's at once & fell two of them to the ground, while two more Fokker's were smashed over towards Sailly our airmen did put it on to them it was a magnificent spectacle away up in the clouds the Taubes would dive almost nose down & try to ram the battle plane but to no purpose for she would dodge them by a miracle & all the time she was pouring the bullets into them when the Taube's would dive at her she would turn straight on her side & dodge them beautifully, bombs fell like \n\nhailstones, & the old battleplane would every now & again drop some smoke bomb's & coloured lights, truly a grand sight. There has also been a very heavy artillery duel in progress most of the afternoon, the heavy guns have been very active & I daresay damaging we had a few casualties today from snipers Captain McKenzie goes away on leave tonight I hear. It looks pretty dull this evening & feels something like rain, I hope it keeps fine, the companies are all on short rations today I believe.\n","27":" Last night Len had 5 men out on a patrol, & they had a narrow squeak for they came on to a party of Germans numbering anything from 15 to 20, Len challenged them straight away & ordered his party to draw the pins from their bombs, he never received no answer to\n\nhis challenge, but heard the party in front of him talking in some unknown lingo, so his party pitched 2 bombs at them & old Fritz shot one back, our chaps sneaked away from them then for they could not tackle them on account of their number's.\n\nI asked the Dr to send me back to the Coy. this morning for I had practically recovered from the gassing, he said I could go back but was not to go on duty till tomorrow\n\nAbout 11 oclock this morning our chaps slung some of them 60 lb. bomb's over to old Fritz they are an awful thing for they have the same effect as a 9 inch shell they are round like a pudding with a piece of bright steel sticking out of them, when the bombs are fired they describe a semicircular curve, & lob in the trenches tail upward's, they dig a\n\nhole 6 ft deep & 21 ft across, we call them tadpoles\" & are about the worst thing used on this front when we start firing these the German's turn all their available guns on to the portion of trench where they think they are coming from & give it particular Hell.\"\n\nHere I am again in a dugout there are 3 others & myself crouched in it for shelter, for there is a big bombardment going on our chap's are belting away with their gun's & the big bombs are sailing through the air like small ballon's, they burst with a terrific bang in the enemies trenches, & we can feel the ground shake like an earthquake when they explode, they strike terror into the German's heart, I saw one of the bombs myself lift a big German sky high he came down with his arms &\n\nlegs spreadout, they blow their trenches to pieces, they are shotting their small mortars & Minnewerfers at us in dozen's there are a few chaps getting hit.\n\nA squadron of our aeroplanes about 7 in number flew straight over the German trenches this morning they must be going on a raid somewhere.\n\nThe artillery have stopped firing now but we still have the bombs coming we now have watchers for the bombs, & they sing out when they see them coming , in this way we dodge a lot of them, nice isnt it & me just back from England.\"\n\nLen & his party are going out tonight armed as a fighting patrol, they never had a single weapon on them last night, except a few bombs, he & a few more are going out each night to see if they can come across them\n\nWe had no less than 8 casualties in our platoon today nearly a","28":" of our strength they were all wounded from the pieces of bomb, of which old Fritz seems to have a plentiful supply. \n\nIt has been a fine day & pretty warm.\n","29":" At one oclock last night our chap's started to paste old Fritz properly with the gun's, he quickly took the challenge up & wasn't there a noise we were all stood to\" in case of an attack the duel lasted nearly an hour & our chaps had the last say, they are the boys to get rid of the shells & with pretty good effect to, I think the squareheads are having a few more sleepless nights than they used to before the Australians came to France, we had some very big guns at work, when they were fired the whole sky would light up with\n\na dull red glare, & you should have heard the heavy explosions behind their lines We had a wiring party out last nigh at work in front of our trenches\n\nShortly after dinner to-day our chap's opened up again on old Fritz with the \"tadpole\" bombs they are awful things, & when they explode it is like a mine going up you can see pieces of men, timber, duckboards, & all going up in the air, you can see these bombs quite plainly as they are shot from the mortar, with each one of these murderous things the catapults shoot 2 or 3 hand grenades over, they must have inflicted heavy damage on Fritz, but we cop it when the bombs have had their say for they turn all their artillery on to us & give us something to dodge, parapets fly in all directions, & everyone holds their breath with suppressed excitement for you never know the instant you might be \n\ncalled to your maker\"\n\nAt last we have caught up to their supply of shells & for every one they send over they get easily 3 in return & not only that, our fellows shell them just whenever they please & always have the last say we have no fear of their artillery now for they get more than they bargain for, plenty of ammunition just suits our wild Colonial gunners they tear it into them night & day.\n\nI am detailed off as the gas N.C.O. & also have a section to-night.\n","30":" Had a gas alarm last night one of our chap's thought he smelt it, & gave the alarm it went right along the whole of the Army Corp & the villages took it up we could hear the Claxton horns real plain, but it was a false alarm, didn't the boy's swear this is the second alarm we have had since being in these\n\ntrenches.\n\nI was on the 12.30. to 4. relief but nothing of any importance happened except the murder of a large rat by me, the place fairly swarm's with them you can see them all over the place at night time, such big fellows too.\n\nRight close to where I am writing there is the ruins of a large convent the building itself is absolutely smashed to pieces, it must have been a pretty place before the war for a moat surrounded it, & from what I can see of it the Germans almost made a little fort of it only the walls which enclosed this convent are left & they are as you might guess full of shell holes & falling down everywhere it was in this place that the German's committed some of the worst crimes of the war on the French sisters, & the girl students who were living there at the time of the German invasion\n\nYesterday was pay-day here, I am going to draw as little as possible while here for money is no good to anyone while in the trenches, I would rather save it & have a good time in a decent place.\n\nLast night a Zeppelin flew over our lines but too high to be seen, though we could hear the whirr & hum of her engines quite plainly I suppose she was on a bomb dropping expedition somewhere\n\nI have run out of blue black ink so I have to fall back on this flash stuff.\n\nBill Hunt got a nasty crack this afternoon from a mortar which fell right alongside him lucky he was not killed\n\nPlenty of excitement this afternoon for shells & bombs fell very thick our guns levelled about 150 yards of old Fritzs tench when they finished it looked more like an onion bed, I'll bet he\n\nhad a few casualties.\n\nOur chaps are putting some rifle grenades over as I write this, they get no peace night or day from us when the Artillery are not at them we are slinging huge tadpoles\" bucksheesh\" over to them & rifle grenades they get them any time of the night or day this is getting quite a lively part of the line. To-night I have 2 sections to look after besides the gas & vermal sprayer I put a requisition in tonight for more Solution & Glass's\".\n","31":" Our chap's pasted the Germans like Hell\" last night with all the classes of shells the bursting shells quite lit the sky up & made one continuous roar, they levelled their parapets for them; oh they are getting it hot now alright.\n\nLast night the 12 &9th Battalions had a demonstration, the rifle & machine gun fire did rattle, I warrant old Fritz\n\nwas expecting something to happen\n\nJust as one of our patrols were going out from the sally port\" last night they spotted a mob of Germans waiting for them outside our barb wire, so they had to come back & get some rifles & bombs but when they went out the second time they were gone.\n\nI was very near shot myself last night a sniper was about 30 yards in front of our trench, & I was peering about looking for a shot at him, when he shot at me twice but missed me by a hairsbreadth each time I'm hanged if we could see him although we knew where he was so we concentrated our fire on to the spot & that shut him up, you haven't much chance of seeing them for \"no mans land\" is full of oats & grass about 4ft high, & trees, shell holes &\n\nold trenches & ditches are everywhere & they can so easily hide in them.\n\nWe are going to follow a new rule as far as we can in the future as regards fatigues each party will be given so much to do & when they are finished they can do a get it is much more satisfactory than the old way of working on till knock off time for then they never know when they are finished & naturally loaf as much as possible, the aim of all men under the old system was to do as little as possible , talk about the Goverment stroke\" its not in it with the boys on fatigue under the old style & you couldn't blame them for the more you done the more you might.\n\nI saw Len & his party of snipers this morning going up the trenches.\n\nThis afternoon myself & 2 men went down to Fleurbeaux to get some things\n\nfrom the Brigade canteen & on the way back had to run the gauntlet of a high explosive bombardment, anyone looking for thrills, haven't far to go for them when high explosives are about.\n\nWhile we were away the Germans shelled our trenches pretty heavy & caused a few casualties, our Coy. suffered pretty heavy during our stay in the trenches this time, but nothing to what old Fritz has suffered for he has had no rest night nor day since we came in, & every here & there his trenches have been levelled to the ground, with artillery, & \"Tadpole\" bombs & grenade's\n\n22nd. Was out last night with a reconnoitring & fighting patrol, there were 9 of us all told, Sergt Howarth took us out, once outside our barb wire we formed into fighting \n\nposition, this is how we done it, Sergt Howarth & myself were in front with 3 bombs each, on both our flanks & a little behind us were 2 more men one with bombs & the other with a rifle ready for any emergency, behind us again were 2 more men armed the same as the flank men, & to complete it we had a man posted in the middle of the party so it did not matter where they attacked us we could get our full strength on to them. The formation is like this, \n\nThe ground where we were out on is a tangle of wild oats, grass &etc, nearly up to your middle, broken here & there by trees & little streams, when you are out long it is a great strain on one, for you are expecting any minute to run across them or get wiped out by the machine gun fire which never seems to\n\ncease, & flares keep on going up, lighting \"no mans land\" up like day if you are discovered good bye to you\" for they would turn all their machine guns on to you & wipe the party right out. \n\nWe were out 3 hours but did not strike any squarehead's, which was perhaps just as well for both sides for its a certainty there would be a scrap\n\nWe have only 3 N.C.O.s in our platoon at present & I can tell you we don't get much sleep, we haven't had 6 hour's sleep for the last 3 days & nights & we are pretty well worn out, however we shall be out in a day or so, & will make up for it then.\n\nPlenty of aeroplane's up & from a distance they sound like a threshing machine at work, you should see the height the Taubes\" get up in the air\n\nwhy you can only just see them at times Such a difference to our airmen who are without a word about it as bold as brass & fly very low almost to low in fact, for sometimes I have seen the pilot sitting in his plane.\n\nThe day so far is nice & sunny hope it keeps like it for we can't have to much sun for my liking's\n\n23rd . Last night was very hot & stuffy, like a thunderstorm brewing, so we were all on the alert for gas, sure enough about 10 oclock the alarm was given, what a noise is kicked up with all the empty shell case's tins, triangles, whistles, being blown & beat, but above it all can be hear the shrill voice of the \"Claxton horn,\" it has a weird & alarming sound at night time & immediately suggests great danger, there is always a tremendous movement in the lines when the alarm goes, everyone getting their\n\nhelmets on as quick as possible, don't the dugouts get in a state blankets, equipment, tucker, clothes, &etc all being mixed up together for we sling things about some , when the alarm goe's, however this alarm like the one the other night, was a blank, don't the boys swear when they find they have been dragged out for nothing, for we get so little sleep, & what little we have is nearly always broken, on account of these \"stand to's\"\n\nD. Coy's patrol ran across a German party last night & there was a scrap right away, old Fritz turned his machine guns on to our patrol but they were to close to the German trenches to be hit so all the bullets went above their head's, our chaps had the best of the argument & forced the squarehead's to do a get.\n\nLen went away to hospital last night\n\none of his testicles is swollen very much the Dr thought it was probably caused by over exertion, I expect he got it from bicycle riding or football, I hope he never comes back, I would feel far more satisfied if he didn't , for it would be a terrible blow to Mother if he got knocked & it dosn't matter so much about myself I hope he gets a trip home out of it, he has earned it if ever anyone has this is the first time he has been away from the Battalion since joining, a pretty good record, 7 months on Gallopoli & nearly 3 months in France, & a dangerous job all the time he has been wonderfully lucky\n\nThere was another pretty solid bombardment yesterday evening A. Coy had 3 killed & 7 wounded I don't know what our or the other Coy's had\n\nour artillery does stick it into them they keep them busy nearly all day. \n\nNot far from here there are a couple of English graveyard's, & you ought to see how the French people look after it, they keep them in splendid order & have lovely flowers planted all over the grave's, & everything is kept spick & span in memory of these English soldiers who gave their lives for France. It's a pretty sure thing that England & France will never fight again. I am pretty well certain that I should not fight against her, & that is the opinion of practically all the Australians & N.Z.'s for we all have the greatest admiration of France & her people, the more we see & know of them the better we like them\n\nStarkey came back from England\n\nlast night with the same old tale of good treatment.\n\nA fair sized Australian mail has come in to-day, she is a welcome visitor\n\nThe weather today is frightfully hot & muggy it must rain shortly. I had a good bath this evening & washed some of the sweat off myself, to make matters worse out Capt. has issued orders to the effect that anyone caught without their tunics on would be crimed, the reason of this is of course the heads are frightened of gas.\n\nBy Jove we have just had a most terrific thunderstorm, the heaviest I have seen since leaving Australia, the trenches are like small rivers, & the clayey mud is nearly to your knee's, we shall develop fins I can see that if we are here for the winter which I dont think\n\nvery likely, our artillery accompanied the storm of rain with one of shells they vied with the Heaven's in the violence of their cannonade, & between the two of them they made a very good showing, ours was the heaviest bombardment I have seen our guns do, they fairly cut loose & went mad Old Fritz never even replied I think he was dumbfounded with the violence of it, there are great breeches in his parapet everywhere you look, & he got a very hot time behind the lines for our heavies were in action & firing as fast as they could he is beginning to find the Australian gunners pretty hard nuts to crack & very constant & they are not afraid to reply to their batteries no matter how solid they are,\n\nshoving it in.\n\nWe are going to move out to supports tonight the 3rd Battalion are relieving us, we have had 16 days pretty constant going now & the Battalion has had nearly 70 casualties, so we have had it pretty warm\n\nThe storm is all over & the larks & other birds are singing gaily & everything smells nice & fresh after the rain.\n\n24th. As we were leaving the trenches last night the German's started to shell a part of the line pretty heavily, but fortunately kept off the communication trenches & \"Convent Avenue\", our chaps took up the challenge instantly, & they soon shut up, one of our chaps broke his leg he slipped on the clay & did the trick, you have no idea how slippery this Flanders mud is, it bangs all, I have never seen anything like it\n\nbefore in my life.\n\nWe are now in an old billet in Fleurbeaux we have 2 Coy. camped in an old school house, & from the look of things about the walls there must have been some hand to hand fighting in & around it\n\nWe are now in supports & will have plenty of fatigues to do, I expect \n\nThe march down from the trenches was a solid one we had about 2 miles of slippery duckboards to negoiate & you should have heard the language of the boy's as they kept slipping of these boards into the mud & water, sometimes over their knees, & as you might guess the rifles were in a nice state, & to make things worse it rained fairly heavy & this with our heavy packs made it anything but pleasant & we were about done when we \n\nreached our billets, we just simply threw ourselve's down wet through & tired completely out for we have had a strenuous time in the firing line & everyone is showing the effects of it, we never stirred till nearly 9 oclock this morning when we woke up for breakfast, I think we are going to have the morning off, anyhow we will want an hour or so to clean our rifles.\n\nThis morning I went down to the 2nd Field Ambulance to see if I could find out where Len has gone to but all the information I got was that he had been sent to Sailly\n\nAnother Taube was brought down this morning quite close here.\n\nSaw Jack Rudkin this afternoon he & nearly all the Pioneer Battalion are camped hereabouts.\n\nThe weather is still showery & shows\n\nno sign of clearing up, the rain will do the crops the world of good for they wanted it bad enough.\n\nThere is a big fatigue party on tonight & I have been busy getting all the particulars of it. There is a rumour about here to the effect that we are to be stopped from sending any letters to England for 6 weeks they reckoned some of the English Officials opened some of our mail & found all sorts of information in it, what a terrible thing, pity we could not get some of these cold footed officials in the front line trenches, & give them a taste of the discomforts, shells & bombs that we have to put up with, they would not be so busy then opening letters & so on\n\nI believe last night the caterpillars hauled 8. 9 inch guns up to here & I believe tonight they bringing \n\nsome 12 inchers in some guns those\n\nAll around here there are shrines & its wonderful how they have escaped the shells you will see the shrine standing up amongst the ruins of houses &etc & scarcely touched they seem to bear a charmed life somehow, some of the shrines are placed like an altar at the end of a small little room & the effigy of our Lord or Mary is surrounded by flowers & candlesticks, & inside the little hut are placed chairs for one or two people to sit & say their prayer's, most of them are very pretty these of course are Catholic turnouts for that practically is the religion of France though Protestantism is fast gaining ground, other shrines are nailed to trunks of trees, or let into the sides of a house, & then again you will see them often at the cross roads, some\n\nthese latter are big life size one's & they show the blood running from the wounds in the hands & feet.\n\nThe eggs & chips are copping it pretty heavy to-day for the boys have a pretty good appetite up after coming from the trenches no one is allowed to loiter about the streets here for fear of attracting attention, & any number of men have to move in single file & that under cover of the walls & hedge's.\n\n25th. Last night we had another gas alarm, they are getting monotonous for this like other's turned out to be nothing, we were all nicely in bed when we heard the gongs & bells start to kick up a row, we all swore loudly & long & lay there until the officer came along & kicked us out we then had to stand by for about \n\n10 minutes until the order came along for to \"Stand down\", the worst, or best, of it I suppose is the ease with which one man if he thinks he can smell gas can arouse a whole Army Corp\" he has only to tap an old shell case & the thing is done, you can hear it travelling away down the line on either side of you for miles, & if one half of the curse's were to come true that the men put on him well he wouldn't live a minute.\n\n2 nights ago D Coy's patrol were out & they spotted some Germans laying wire in front of their parapet, so they sneaked up on to them, & when they got close enough they shot 2 of them dead & threw their bombs at the rest of them the Germans turned their machine guns on our patrol right off & scattered them, but luckily hit no one, but\n\nnow comes the funny part of the business, when they got back to their rallying point one of their number was missing, so they went out & searched a couple of hours for him but could not find him anywhere so they came to the conclusion that he had missed them & had gone back but when they got in they found that he was missing, so they went out again & searched till daylight still no result, so they gave it up & came in thinking the Germans must have captured him, the next night they went out again & searched nearly all night but could not find any trace of him, so they gave him up for lost, the next night he turns up & had a queer tale to tell, it appears when the machine guns started on them\n\nthey all scattered as they were ordered, & in the excitement he missed his way, he tried to get back all that night but each time he came near our wire he was shot at by our men, so that day he lay in an old shell hole till night came, he had another go, & got up right up to the trench the next night & just as he was going in he was challenged & he thought it was a foreign lingo so he shot the German with his revolver & threw a bomb at him, he then got for his life & the Germans sent a patrol out after him, but as luck would have it they missed him although he was surrounded by them, shortly after this a wiring party came out & started to work within a few yards of him, & they also missed him, after they went in he crawled towards our lines, but as\n\nday was breaking he had to take cover in an old crater, he was that hungry that he even took to eating green grass, he did not know what to do so he decided to have another go the next night, he gets up opposite the 12th. Battalion but they shot at him 12 times & he was missed each time, so he put up his hands & sang out to them they told him to keep low & come in when they got him he was nearly starving, & fairly rushed the bully & biscuits, the Dr examined him & found that he had nothing in his stomach, for they thought he might have been a spy, but it was a genuine case alright, he had quite an adventurous time didn't he, but it is so easy to miss your way in \"No mans land\" & mistake the German\n\ntrenches for our own, both rifles seem to crack alike out in front, but there is one point which is always worth noting & that is the flares for the squareheads use about 10 to our one & they are a much superior & bigger flare than ours\n\nWe had this morning (Sunday) a blanket, gas helmet, & rifle inspection it was only a short affair & we were then dismissed, 2 of my section were sent to hospital this morning, one of the chaps had \"the wind up\" (an expression for scare) one night & gave a false gas alarm.\n\nThe boys have a daily routine of our work here, this is their version of it 11 hours \"stand to\" 12 hours work & 1 hour for meals all the rest of the day you can have off for sleep &etc.\n\nThere will be a big fatigue party leave here tonight, I am on one of the jobs.\n\n26th. Last night we had a fatigue party up in the firing line earthing up Convent Avenue\" it is nearly finished, & a good job has been made of it\n\nBefore we went we were warned to take cover in the firing line as soon as our guns opened out for we were going to give them a taste of our gun's.\n\nAfter about 2 hour's work with pick & shovel, over come the first shot, almost instantly, the whole place was lit up by the flash of our gun's, & the roar was like a terrific windstorm magnified 100 times the whole earth shook & trembled from the concussion of our hundreds of guns, it was a magnificent but awful spectacle the whole horizion was lit with purple, red, yellow, & dark green flashe's as our shells burst in the\n\nGerman lines, & to make the scene more weird the Germans were shooting hundreds of large bright flares which lit the ground up between the trenches & made them bright as day.\n\nLooking over the parapet (for you were quite safe for nothing was coming back) you could scarcely see the German trenches for smoke, dust, & flying rubbish, but every now & again 2 or 3 of our big shells would land all in a heap & the combined flash from these shells showed us the havoc wrought in the sausage eaters trenches, everywhere there were huge gaps tore in the barricades & in places they were levelled to the ground, if they didnt lose a few hundred men last night I will eat my hat willingly.\n\nThe smoke & fumes that came back\n\n \n\nfrom our shells was nearly suffocating it smelt like phosphorous or sulphur, our gunners had the range splendidly, the shells were just clearing our parapets, one could not help thinking what would happen if one of these shells were to fall short, they seemed that low that if you were to put your hand up you could catch the monstrous things \n\nWhen you are in a bombardment, it makes you realize how small & puny a man's strength is when he is face to face with these powerful & terrible weapon's of mans brain, it would make the strongest man quail for you are so helpless against it you can only crouch down & wait for the worst, every minute you are expecting to get blown to pieces\n\n& you have a feeling of surprise that you are still alive, for you can feel the trenches & sandbags rocking & swaying & the air is all of a tremble. Heaven's only knows what Verdun must be like for it must be 10 times worse than last nights affair. After our chaps had been at it Hell for leather\" for about 10 minutes the German batteries opened up on our trenches, & soon we were in a hail of steel & high explosive but our batteries never slackened but shot it back the faster if anything\n\nThis was the first proper bombardment that I have seen in France & I can honestly say that I was surprised at the poor shooting of the German artillery especially when we have all read & heard so much about their wonderful markmanship \n\n9\/10th of their shells shot harmlessly over our parapets & landed between the firing line & reserve's, where they never done a bit of damage, if they can't put up a better show that that we wont have such a hard time when the word comes to advance, & another thing our artillery shot 2 to 1 in the matter of shells & of the marksmanship there was no comparison, & our fellows had the last say, this bombardment was right along the line I fancy it was a feeler to see what the Germans had in front of us.\n\nJust before the bombardment started we were sending a patrol out, & just as they cleared the parapet one of them got a bullet through both his legs just below the thighs.\n\nThis morning we had a short\n\nparade, & on it I gave a short lecture on gas & its effects on the men.\n\nA Taube dropped a bomb quite close to our billet this morning but it failed to explode.\n\nThe country round here is very pretty now there are wild rose's & tame ones blooming everywhere & plenty of scarlet poppies daises, pansies, blue bells, & all sorts of pretty flower's, for you know it was once a peaceful quiet place before the squareheads got here, & where all these flowers are running wild there was once nice flower gardens & quaint old farmhouse's now nothing but gaunt & roofless ruins, all eloquent testimony of the ravages of war & of the Kaisers mad dream of world domination & power, but by this time I guess his dream has been\n\ncompletely shattered once & for all.\n\nas you walk along the pretty roads you can hear the partridges & quail cluttering & calling one another in the tall grass & self sown crops of wheat & oats, makes a chap long for a shotgun sometimes, & then again you think that you would not interfere with them for anything for it sounds so nice to hear them calling one another, in the twilight, they don't seem to take much notice of the guns for there are batteries all around them & still they stop there.\n\nIt has started to drizzle again this afternoon I suppose it will rain all night.\n\n27th. Went on fatigue last night & talk about rain we got properly soaked to the skin, got up to the job, & the engineer said there was nothing doing so we\n\nhad our walk & ducking for nothing\n\nThere was another heavy bombardment last night, the","32":" Battalion got it, the Germans started it, & our fellows finished it, for they cut loose on the German batteries & trenches, & fairly rained steel & high explosives on them our chaps kept this up for the best part of an hour I don't know what old Fritz thinks of our fellows, for unlike a lot of the British batteries, they reply at once to the German's we have got them thinking alright.\n\nDuring the heavy bombardment the night before last we had 2 raiding parties out one from the 5th & the other from the 20th Bat & they were the most successful raids that we have had for some time on this front either British or other's, the 5th Batt. killed 40 German's & captured 11 Germans & 2 machine guns \nthe\n we lost\n\n2 killed & 7 wounded a very smart piece of work, the raiding party say that the German trenches were full of dead & dying men, & they killed all the survivors they found.\n\nThe","33":" Batt. got 9 prisoners & I don't know the exact number they killed, but they got some valuable information from paper's they got over there, & also captured a trench mortar, so you can see our boy's are keeping their reputation up, the German prisoners say they don't know what to make of the Australians for they can never tell where they are going to appear next or what they are going to do.\n\nWe have had a most successful week so far, our aeroplanes set fire to 3 of old Fritz's observation \nballo\n balloons, they dropped fire bombs\n\non them, I believe old Fritz pulled every balloon he had down, when he saw the fate of these 3, they reckon we have a special bomb for this work & it is a great secret, it appears to be very effective at any rate.\n\nHad a short parade this afternoon & about half the boy's were absent. \n\nHad some tinned peaches & cream for dinner today & very nice they were the little shops & estaminets are making a fortune out of the Australians for we have so much more money to spend than the Tommies, & the boys are pretty liberal with it\n\nThis afternoon the German's shelled the town we are billetted in Fleurbaix but I don't think they done much damage.\n\nThis morning we got a small parcel \n\nof Gift Stuff from the 1st Battalion Comforts Fund, I got a tin of milk out of it, I have just been reading in the Sunday Times\" a couple of articles referring to the cold footed \nco\n crowd of wasters that hang on at Liverpool Camp & elsewhere, & also the mob of curs that have malingered & schemed to get away from Egypt, By Jove I would like to have the dealings of the waster & curs, I would see that the public knew more about them, & stop them from posing as returned heroe's & such like, they are a blot on the men that really have toiled & fought for Australia & are still facing the enemy \"oh we have some mongrels in Australia just fancy some of them NCO.s who are hanging on at Liverpool have \n\nbeen there nearly 18 months, how the people haven't taken a jerry to it long ago beats me, its to be hoped that they have woke up at last, how I would like to have the dealings of them in the firing line, they would do their bit I'll guarantee, yes & a bit more.\n\nJust behind us the place fairly swarms with cavalry they reckon there is easily 60,000 behind us, & they also say the Light Horse\" are coming over shortly the hour has nearly struck & I think it will be goodbye Germany this time \n","34":" Had the most miserable & aggravating night last night as ever I have had in my life, to begin with just before we left, an order came round that no one was to be on the roads between the hours of 11 to 2. on account of artillery\n\nfire for our chaps were going to open on the German batteries, & we expected retaliation from them, that meant of course, that when we finished our job which would be about 1 oclock, we would have to stop at the \"Dead Dog\" dump till after 2 in the morning, so far so good, but when we reached the rail head, we had to wait for nearly an hour before the timber waggon's came up, we unloaded them pretty quick, & then had to load the\nm\n timber on to the little trucks that run the stuff to the firing line, all this is done, mind you in pitch black darkness & drizzling rain, we only had one small truck & on this was stacked over ½ a ton of timber & iron & off we started, we had not gone more than 200 yard's when off the \n\ncursed thing came, everyone looked to savage to even swear, but I'll guarantee we thought volume's in those first few second's, you should have heard the great sigh that came from all of us, as we gazed speechless at the flaming truck, & then the first shock over out came the language they can say what they like these wowser's (who by the way take very fine care not to risk their precious lives over here but much prefer to skulk at home & rave at better people than their selves, the hypocrites\") but swearing ease's one's mind a lot & you feel much better after it.\n\nAfter we had got the superfluous steam off our chests, we took stock of our damage & discussed our chance of getting the truck on the line again\n\n& the verdict was very unfavourable for us, just then along came 3 empty truck's from the firing line & I grabbed 2 of them I had the power for I was in charge of our party of 22 men while we were on the trucks, we unloaded the run off truck & made 2 loads of it, when one was loaded I sent a party of men off with it & when we loaded the other one off we went, talk about a rotten job pushing these cursed trucks, just imagine if you can a narrow wooden line running straight towards the enemies trenches, built up on clay the like of which for slipperiness you have no idea, & on this clay lay water & mud to a depth of easily 8 inches, along this imagine sweating & swearing, slipping sliding, & getting wet \n\nthrough with perspiration & water trying to push those heavy running trucks & always the chance of getting knocked out with shrapnel or machine gun fire at last we reached the Convent Wall where we had to unload, the first truck that had gone ahead were nearly finished Thank Heaven when we got there.\n\nUnloading these trucks was an awful job for it was black as ink & to make matters worse the Germans were putting over lots of flares, while these were up it was light as day but when they went out we were nearly blind, for you know what it is like yourself when you come out of a lighted room into the darkness, magnify this several times & you have an idea of the difficulty we were working under to say nothing of the rain which was falling\n\nAfter we had unloaded we had to tip our trucks off the line to let some more pass, while we were here a 3rd Battalion officer came down & ordered everyone to have their helmet at the \"gas alert\" for they were expecting gas, they are a proper alarmist crowd are the","35":" & always were.\n\nWe got away at last, & we were racing to get back before our fellows opened the bombardment but luck was against us for we had to take our trucks off the line twice to allow loaded ones to pass us, & another thing the cursed things kept on running off the line we got about halfway when like a clap of thunder our batteries opened up & almost lit the Heavens\" with the flash of the guns, now I thought we are in for it, for Fritz is bound to \n\nshell all the lines & roads, & we had not the slightest cover what soever we hurried on every minute expecting a hail of shrapnel \nf\n but for some unexplained reason the Germans took it all lying down & never fired a single shot, after about 15 minutes our guns knocked off & tried to coax old Fritz into retaliating but no good strikes me he got a lively towelling up the last time he replied to the fire of our batteries at night time, & thought he would hold off this time, however we reached the end of the line safely & wasn't we glad, I was never so full of anything in my life before, & never wish to have the same job again.\n\nLast night there was another highly successful raid by one of our Battalions it appear's that they saw the German's\n\noutside cutting their barb wire, they promptly turned the machine guns onto them, & then charged them with bayonet & bomb, to such good effect did our boys go for them that they turned & ran, & the boy's chased them back into their own trenches, here they tried to make a stand, but the boy's went for them in such a determined way, that they completely routed them, it was a most daring affair & from all accounts accounted for quite a number of German's, they brought 7 prisoners back with them including 2 officers, our reputation is bounding up here & lets hope it continues to do so In this case it was the raiders that was raided, there have been raids now every night for the last 10 days & some nights there have been two\n\nthere was to have been 2 raids last night but they were postponed.\n\nLast night there were scores of waggon loads, & motor buse's, filled with shells going along the road, we are getting some ammunition in alright\n\nThis morning we were filling sandbags 6 each man & then he finished\n","36":" Well last night our Battalion's raid came off, everything was fairly quite until about 1'oclock, when all of a sudden our artillery opened out on the German's, they gave them a terrible burst of artillery fire for nearly an hour, & the German's replied just as vigorously, the din was nearly deafening & the air fairly trembled with vibration from the terrific concussion from the hundreds of guns that were in action, meanwhile our \n\nraiders were creeping out towards rhe German trenches in spite of all the cross fire from \nou\n their machine guns & rifles, & when the artillery lengthened their fuse's, our boy's were in position for the rush & were already cutting the wire that the artillery had left, at a signal from their leader they charged straight for the trenche's & threw their bombs in, & immediately jumped in after the squareheads there was a short & sharp struggle which ended in our favor, they then set about killing all they could & from all accounts they wiped quite a number out, after killing all they could find bar 2 prisoners, they had a look for any booty that might be knocking about but failed to get anything of any value, this done they were\n\nsatisfied & started on the return journey, among a hail of shrapnel.\n\nWe lost 2 men killed & 7 wounded in this affair, one of the killed being an old hand who had been right through the Gallopoli campaign he was as game a chap as ever walked & a right good fellow besides, his name was Sergt. Downer, he was shot through the head just as he was about to jump over the parapet, his death caused quite a gloom in the Battalion for he was so popular & a clean living chap We all felt that the raid was not worth his life, but I suppose it was to be. That was the","37":" raid the Australians had made in 10 days & everyone of them was a success, a very fine record & one that will take some beating.\n\nThe prisoners they brought in were a \n\nmiserable couple, one of them was a chap of about 40 & heavy built the other was a miserable looking young fellow, they belonged to the Bavarian's \n\nOur chap's had the same experience as the other raiding parties, that is they found any amount of German dead & wounded in the trenches that the artillery had knocked out, there is no doubt about it they have suffered heavily since the Australians have taken over this portion of the line, our fellows bombard them night & day, & raid them nearly every night, they get no peace from us the result is that we are drawing a lot of extra artillery & men in front of us, & things are very lively indeed, the French people round here say, Australia to much bombard no bon\" the latter word means in French \"good\"\n\nwe are stirring them up properly & as I \nwit\n write this our artillery is pouring in the shells from all sizes of gun's.\n\nYesterday a shell came right through the roof of an estaminet, but wonderful to say no one was hurt.\n\nThis morning most of the Coy. went to Bac St.Mair for a hot bath & very nice it was though we had a fair walk. I saw several Frenchmen working on the road's with only one arm, I suppose they had lost it somewhere in this war\n\nThere are splendid crops all along the road now, oats wheat, peas beans, clover mangels, corn etc. the recent rains have done them the world of good. & the country looks beautiful\n\nOn our way back from the baths we dropped in at a little estaminet & had our dinner, chips & eggs are the most\n\npopular here, washed down with beer, milk or coffee. what a difference to Gallopoli or Egypt, you can drop in at these estaminets, & order your meal & you know that it will be clean, & nicely cooked by the French girls & a very reasonable price paid for it.\n\nSince I have been in France I have never seen tea served amongst the French people they all drink, wine light beer or coffee, the girls & women drink beer the same as we drink tea, it does seem funny to an Australian, for in our country we look on that sort of thing in horror, & I think we are right, I should never like to see any sister or girl friend of mine walk into a pub & order their beer & drink it without winking an eye, pretty much the same thing goes on in England among a certain \n\nclass of working people, you will see them walking about with their jug of beer quite unconcernedly\n\nAnother peculiar habit they have is that you never see short trousers on their young boy's, no matter how small they might be, they are in long trousers.\n\nWhen they brought the Germans in the other night, our Colonel poured out a cup of coffee & gave it to them I wonder if they would do the same by us.\n","38":" Last night I was on the Dead dog\" fatigue again, & it was another rotten job, we had 6 truck loads of sand bags timber barbwire, stakes, concrete slabs, cement, iron & goodness only knows what else, we got home dog tired at just on 3 oclock in the morning.\n\nThe artillery was very active last\n\nnight especially on our right, there was also a gas alert, but no one paid much attention to it.\n\nIt was very pretty last night, you should have seen the bright flares, the Germans were throwing them over in scores, & the flash of the gun's quite lit the dark sky up & the Germans had 4 big searchlights throwing their sword like beams against the dark clouds they evidently thought they could see something for they were shooting shrapnel way up in the clouds & it was bursting with a pretty red flash that stood out so distinctly against the night, they were as jumpy & as nervous as could be & were evidently expecting a raid or an attack, besides our gun's\n\nwere giving them particular Hell\" nor did they cease as the night wore on, instead the fire of our guns increased in volume & intensity, & about 4 oclock, it reached what is known as a \"drum\" bombardment that is one perpetual roll, a bombardment from a distance is a magnificent sight, but it's a different thing when you are under one.\n\nThis morning we had another gas demonstration, & the new way of having your helmets rolled was shown the men I think we are going to use gas in this quarter before very long somehow.\n\nI took a collection up from our platoon this morning to buy some vegetables so that we could have a good dinner with our roast mutton, I got easily enough so we will have a good\n\nspread for once in a while.\n\nI believe last night the Welsh took 750 yards of trench off the Huns & the Maori's had a success while there was still another successful raid, I wonder how many more times we can raid their trenches without a setback, it seems unatural, the ease with which our chaps can break into their lines, & practically do what they please with them.\n\nTo-day old Fritz has been shelling Fleurbaix pretty constant he is after the big naval gun that they know is here & doing heaps of damage to the squareheads, but they \na\n were landing the shells nowhere near the gun, every now & again just as if to aggravate \n\nFritz the big gun would let 3 or 4 shells go, I'll bet it made Fritz mad\n","39":" Another month started & we are going downhill to Xma's, but I firmly believe the end of the year will see the finish of this gigantic war everything to me seems to point to it & I only hope I am right, for I am full up of it, its not so bad if we were on the move all the while, but its the sitting back in the trenches that kills, the constant drudge day after day, for there is very little difference between one days work & another, except perhaps we might work 20 hours one day & 24 hours the next, people have an idea I think that a soldier lives a life of comparative idleness, what a shock they would get if they tried it on\n\nWe are now supposed to be resting & I will give you our daily routine Our Coy. is cut into 2 parties one a day \"fatigue\" & the \nth\n other night, I will take the night fatigue\" for that is the one I am on, we leave our billets at 9.30. each night & walk about 3 miles to our job which might be any thing from pushing & loading trucks to putting up barb wire, we arrive home from these jobs about 4 in the morning we then have what sleep we can snatch till breakfast, about 8. oclock, after breakfast, we have to fill 250 sand bags, then there is a gas helmet parade or lecture, after dinner we \"fall in' for musketry\" which generally lasts about an hour, the rest of the afternoon if nothing else turns up we have for ourselve's, so\n\nyou can see from this, we don't have much time for ourselves, then of course we are always supposed to be ready to move off at a minutes notice in case of an attack\n\nLast night we were on the Dead dog\" dump again, but as all the men were not wanted there I had to take 6 down to the \"Tin Barn\" & take a truck of timber & iron from there, to the reserve trenches of the 4th Battalion, we had no trouble at all on this line, & were finished about 1 oclock.\n\nYesterday evening there was a magnificent sight, for the sky was just black with aeroplane's, I counted no less 47 of them as they flew past, I expect they were bound for a raid somewhere how old Fritz fired at them but he never done any good for they just kept on going as if nothing out of\n\nthe ordinary were happening.\n","40":" Last night I was on a different working party\" 3 of us had 40 men earthing up one of the avenue's leading to the 4th Battalion, it was a fairly dangerous job, for every now & again a couple of German machine guns would sweep the ground we were working on from end & end, at the first crack of the bullets you should see the boy's duck, & I can tell you I was never far behind we would all lay flat on our stomachs & as quiet as a mouse, you cant help laughing when you look up & see all the silent form's, like a lot of Moslems at prayer. One chap dug a little shallow hole in the earth enough to protect his head & body, & when the machine guns started to play he\n\nwould lay in this, & cock his legs in the air, & sing out to Fritz to do his worst he was looking for a Blighty but when ever the bullets started to come close, down would come his leg's.\n\nWhile we were on this work a gas alarm came down the lines, some of the boys put their helmets on & some didn't, it turned out that we were using gas against the German's.\n\nAbout 3 oclock as we were coming home our chaps opened a tremendous bombardment on our left & right didn't they stick it in the whole German line for as far as I could see when the German flares lit up the scene was a mass of smoke & flame from the bursting shells, a bonzer sight when the Germans are catching it, what a time they are having;\n\nI nearly had my light put out last night, it happened this way just as we were coming round the corner on the way to our billet, 3 great German shells fell fair in the town & one of them lobbed right into a big stone house, talk about a frightful din & a blinding flash of flame as this great shell exploded the concussion from it knocked myself & a few more who were with me off our feet, & as I was falling a piece of tile or something hit my steel helmet with a tremendous bang & nearly stunned me, I should certainly have had my brains knocked out if I had not been wearing my helmet, it saved my life alright.\n\nHad a church parade this morning held under the shade of some \n\npretty green & leafy trees, so as if a German came over he could not see us, the padre preached a very good sermon.\n\nYesterday was payday here & the boys were very merry, but they behave themselves well here. We also had a full muster parade yesterday, & while the inspection was on a Taube came over & we had to get back in our billets\n\nNews is coming through of the advance our chaps & the French are making, I suppose it is just a feeler before the real thing comes off which I expect will be next month or September.\n\nNearly everyone seems to think the 1st Div. are shortly going to England, to be trained in Street fighting & etc. I hope its true what a time the boys would have in old England\n\nThere was a great bit of excitement here tonight, some of our aeroplane's were being shelled directly over our head's & most of the boy's were scattered about outside yarning & lousing themselves when all of a sudden pieces of shell & nose caps started to come down fairly fast you should have seen the scatter they all made a break for the cover of the billet quick & lively you can hear them coming hundreds of feet up but you have no idea where they are going to lodge, & if one hits you well it is goodbye\"\n\nLast night we could hear the whistles in the German lines quite plainly, they say they use them for \"stand to's\" they were evidently in great fear of being attacked for the whistles travelled as far as we could hear on both \n\nsides of us, I'll bet they are beginning to wish they had never started the war\n\nFrom where I am writing this there is very pretty scene, on my right the road stretches for nearly a mile in a straight line, & on one side it is bordered by pretty trees, all of an even size, the other side is nothing but beautiful growing crops of all sorts of things, & bonzer hedge's & every here & there an old & picturesque farmhouse nestles among the trees, & growing all over the old house's are fine old grape vines, & they flourish amazingly well & are loaded with beautiful grape's, France is famed & rightly so for her grape's, for she has the goods alright. On my left, the trees are also bordering the road & they run right into the now almost ruined Fleurbaix, once a most beautiful village but now\n\nshe is a mass of ruined houses & shell torn streets, scores of the houses are loopholed & barricaded while not a few of them are mined, in spite of all the shelling & fighting the place has seen there are plenty of people still in it, I suppose they don't like leaving their old homes, & would rather run the risk than leave them, what wonderful people the French are, one has to be in France for a while before he can fully appreciate them, I quite believe what a certain clever man said about her, that it was better 10 Germany's should utterly perish than one France, for undoubtedly they lead the world in science in many respects, & what would the world be without a France she is fighting a wonderful fight in this great war, & at last I think she \n\nis going to get some splendid assistance from England, who when all said & done will be the deciding factor in the war. News has just come through of a wonderfully successful raid by the 9th. Battalion, they killed 40 odd Germans took prisoners 26 men & 2 officers & brought back 2 machine guns & a trench mortar, that will take some beating\n\nOur Battalion received to-day a congratulatory letter from the 2nd Army Corp on the successful raid we made though we did not get so many prisoners as some of the others, we got a lot of valuable information.\n\nA few days ago a large fleet of our aeroplanes crossed well over the German lines, they carried liquid fire with them & when they came to any crops they shot this stuff over them\n\nit destroys everything it touches so some of old Fritz's crops suffered I'll bet, what games they get up to, but anything is fair to use against such mongrels as the Germans have proved themselves to be.\n\nThis evening I was sitting on the step just about twilight, I spotted a little thing like a mouse run across the road I run down to see what it was, & as it didn't move I picked it up I had no sooner touched it than I got a sharp little bite like a razor cut I dropped it quick & lively, it was a mole I had picked up & the first one I had ever seen alive \"my word they can nip alright, Lemnos was a great place for them some parts of that island was almost turned over with them though I never \n\nsaw one while I was there\n\nKelleway the cricketer got hit today he got one in the hip I believe\n","41":" Had a night off last night but it was not much good to me for about 1 oclock our fellows started the heaviest bombardment that I have ever heard it is impossible to picture the roar of our guns everything for miles around was all of a tremble & in our billet the plaster on the ceiling started to crack & fall, so you can guess it was pretty severe.\n\nThe Germans retaliated & shelled Fleurbaix & the billets for all they were worth, they got that close to ours that we had to get up & take refuge in some trenches that are always built close to the billets in case of shell fire\n\nThey burst the shrapnel all over us but luckily no one was hit\n\nThe shelling lasted for about 2 hours & then our batteries slackened off. After it was over a patrol of ours went across to the German trenches & there was not a living soul left nothing but a mass of dead & mutilated men, I believe it was something awful in the trenches, the patrol penetrated to their second line & it was nearly the same there, they brought one prisoner \nwent\n back with them & strange to say he had a pass on him made out for Berlin, how stiff was he, though I suppose he can count himself one of the lucky one's, the power & fierceness of our bombardment was indescribable, Lone Pine,\" was only a flea bite \n\ncompared to it, if we only had the same artillery support at Anzac\" we would have chopped our way through in no time, in our area I should think our artillery fired anything from 8 to 12000 shells in the 2 hours, the firing was that rapid that you could not hear single reports, just one continual roar a \"drum bombardment they call it, the shooting of the artillery was magnificent, they take a bit of beating do our gunners the most remarkable thing about this turnout, that while the Germans were annihilated in their trenches there was scarcely any casualties in ours this seems unnatural but its true.\n\nThere was rather a sad thing happened in this shelling, we had a patrol of 10 men out, & through some one's fault they were not told of the coming\n\nbombardment, so as luck would have it they were in \"No mans land\" when the dustup started, after it was all over they were found outside our barb wire cut to pieces.\n\nLast night some of our chaps got a German sniper, he shot a corporal dead , & his mates noticed where the flash came from so they stalked him & before he knew anything about it, one of them hit him a tremendous bang in the ear, I believe they gave him the father of a hiding before they handed him over, the magazine of his rifle held no fewer that 35 cartridges & the rifle had all the latest improvements on it.\n\nThe German's brought down 2 of our aeroplanes \ndown\n last night one was smashed to pieces, the other\n\nwasn't damaged much\n\nThis evening we all packed up for we were being relieved by the 45th Batt. & as I write this some of them are taking over the billets from us.\n\nPut most of the afternoon in playing Bridge\", its a game I am very fond of.\n","42":" At 8 oclock last night we held a full muster parade, & were ready to move off, but we had to wait for the 45th. to come in, they kept us waiting there till 12.30. real old military style.\n\nWe reached our old billets behind Sailly after a march of about 8 miles most of us were nearly knocked out when we got here which was about 4.a.m. some of us no sooner had our packs off when we made a break for some cherry trees that we knew were here, we had a good feed\n\nfor we tackled all sorts, it did not matter about them being green, I guess we will have a funny feeling in our tucker bag shortly.\n\nI dished our platoons rations out this morning instead of the sergeant.\n\nAs we were coming down last night a great fire started in the German lines & lit the whole sky up for miles around, it was either a big billet or an ammunition store that was alight I suppose our gun's got on to it\n\nA big mail came in this morning but I never got a thing out of it.\n\n5th. Nothing worth writing about has taken place since my last entry except a heavy fall of rain yesterday evening & the sky is still dark & gloomy looking the old farmer here has lots of green hay out & he is having some\n\ntrouble drying it.\n\nWent for a route march this morning through Dervil , & on the way passed a lot of cavalry Hussar's I think they were, for they carried a sword.\n\nThe Post cards arrived to-day & a regular rush set in for them, I have got orders so far for nearly 30 doz.\n\nAm in charge of the billet guard to-day The boys have the football going again to-night, the first time for a month, some of our chaps left the Coy. this morning to join the band again.\n\nBy Jove there are some magnificent crops around this part, one, in Australia has no idea the way France is cultivated, there's not an inch of ground hardly that is not under cultivation & talk about crops, well they are beautiful & one can't help\n\nremarking on it, especially anyone like me, whose sole thought is for the land, & all it grows, you can look for miles & miles over lovely crops of wheat & oats up to your head & over & as level as a table how I would like to have a binder working in them, what work one could make, it would be a pleasure to be slashing it down, the beans & peas here are a wonderful height on account of the great fertility of the soil, which is a splendid sort of dark brown clay, as strong as you like \n\nJust compare France to Gallopoli & the difference you can't explain they are so far apart, just imagine us here bogging into the cherries & plenty of them everywhere, I have had some splendid feeds of them\n\nthe trees are never pruned by the look\ns\n of them for they are a terrible size & bear well, but of course how could they do otherwise in such a beautiful & magnificent country, I am never tired of praising France, for the country part of her is almost a paradise it seems funny when you come to think of it us being here, & shedding our blood, over practically the same ground as a branch of our ancestors came from, notably the Normans.\n\nCapt. Street is leaving the Battalion tomorrow he is going on the 3rd Bde Staff he is shouting 5 barrels of beer to his Coy. & 3 doz. bottles of whisky, so there will be a lively night there tonight\n\nGot a couple of letters today one from Aunt Amy & she tells me that Stan has joined up I wish in one way he \n\nhadn't, but of course it is hard to stop out while we are fighting I can quite understand his feelings but why can't they send a few more of the shirkers first I could guarantee them a lively time of it\n\nHeard tonight that Len refused an operation at Sailly & quite right too I am wondering when I am going to hear from him its time he dropped me a line or a card, I would not be surprised if he ends up in England\n\nYou should see our horse's over here they are in perfect condition, they almost went mad I believe when they first saw the green grass, what a welcome change to them after the sand & tibbie of Egypt.\n","43":" About 1 oclock last night there was the usual gas alarm, some one had the wind up again I suppose &\n\n thought he smelt the stuff, it was impossible to use gas for the wind was blowing in gusts from anything to 15 or 20 miles per hour, & that rate is out of the question for gassing, the most dangerous is a steady wind from 3 to 9 miles per hour, a fellow wants to be on the lookout then for trouble.\n\nHad an early morning walk to Headqrs to get a letter stamped at the orderly room. Good news came through last night of the French & British, telling of large captures of men & gun's, what a smack to Fritz but nothing to the shock he will get later on this is only a preliminary canter to what is to follow at no future date.\n\nPhysical jerks are on this morning most of the men hate them, but I rather like the exercise for it undoubtedly does one the world of good\n\nThis afternoon all the Coy. N.C.O's were called up to enquire into the conduct of a certain working party who were detailed off to earth up a communication trench, the engineers complained about the men not working on the job, my diary came in handy for we could easily cast back & see who it was that was in charge, it turned out to be Corp. Suiter & Andersen, & they have to make out a report.\n\nOur band was out this afternoon with B. Coy.\n\nThere was a full muster parade of the Coy. this morning, the bombers & stretchers were out with them\n\nA good few howitzers & field guns are passing here today they have been relieved & like us are out for a bit of spell, & like us, the spell\n\nmight be for 10 days or 2 months, just depends how the battle goe's\n\nThe Colonel & Major were round the billets this morning having a look at things Have been doing a bit of patching this afternoon its not very often I come at this game, but they were my shorts & I have to wear them if we are doing much marching for I chafe so easily in trousers.\n\nPlenty of our aeroplanes are flying about today some of them are fairly low too.\n\nOranges are getting very dear now I paid 2½ apiece for some this morning, they are nearly all Spanish, & what makes them so dear I suppose is the end of the season\n\nThere were 2 football matches this evening in our Coy. between platoons, it was a proper rough & tumble go, 2 of our officers were playing & 2 more were on the boundaries, our officers are\n\ngood sports alright, they come in for a good bit of rough handling for all the boy's make for them like tigers as soon as they touch the ball its dead funny.\n\n7th. All those who were playing football yesterday were excused from early morning parade & well they might be for some of them were in a pretty bad state, one chap has a cut under his eye about an inch deep & 4 long, & most of the others have nasty bruises to show. I believe from all accounts our 4th Division the one who relieved us are a rotten lot they reckon they cant be trusted in the lines, & this much I know for a fact, that they sent down hurriedly for some of our artillery officers & men to go up to the batteries again, & they were \n\nsent up in motors to the gun's, what a shameful thing, \nour\n I believe their officers are a rotten lot take them althrough & the men have no confidence in them a bit different to the old 1st Division what a body of men they are, as good a Division as there is in France, its through the 4th Division that we are not going right back for our spell, its a bit hard on us especially as we have had a pretty hard time of it ever since the middle of April, & all were looking forward to a spell right back but I suppose it can't be helped.\n\nThey say our Div. is now part of a mobile Army & we are likely to go anywhere & you can bet it will be where the fighting is heaviest.\n\nAll the drill we are getting now is on the move, rifle exercises & all, they\n\nare trying to get all the surplus fat off us, not that the Army lets us get much on, but everyone is a little soft & flabby, for we don't get much exercise while in the trenches.\n\nThe Colonel was round this morning & he kicked up a row about so many men being in bed after reveille\" but when it was explained to him about the footballers all was right.\n\nRaining again today \"By Jove its wonderful the amount of sun we don't get here, I daresay the constant cannonade has a lot to do with it. I am quite satisfied that heavy gun fire don't cause rain, but if rain is hanging about it will bring it downs, the vibration causes the clouds to shake & as rain clouds are like a sponge this shaking, lets the\n\nwater down & so we get wet\n\n12 men were detailed off this morning from our platoon to go bomb throwing the practice with live bombs pretty dangerous work for accidents often happen\n\nThis afternoon we went for a short route march every available man turned out batmen & all.\n\nThere was a football match this evening between C. & B. Coy's B Coy won by 8 to 2.\n\nI hear the","44":" Battalion are going back to the trenches tonight so I don't suppose we will be long following them worse luck.\n","45":" Parade as usual this morning & an inspection of gas helmets, goggles, field dressings, & identification discs & also our iron rations, by iron rations I mean the bully beef; tea,\n\nsugar, soup tablets, & biscuits we are always supposed to carry these with us wherever we go, & the only time they are supposed to be opened is when an officer gives the order for the men to use their emergency rations which has only occurred once to my knowledge, & that was on the Peninsular when we first landed, but you never know when the same thing will crop up again\n\nYesterday we received a few more reinforcements for the platoon they were the 16th reinforcements for us.\n\nWhere we are billeted is a very pretty place a road runs between our billet & we have 2 platoons on one side & 1 on the other while the other one is camped up the road a bit, all around us are beautiful trees, & crops of wheat\n\nbeans, potatoes, & etc. & on our parade ground are bonzer fruit trees, such as cherries, pears, apples, plum's, & we have the free run of them, I have had some fine feed of fruit off them.\n\nThis afternoon we had an inspection of feet, for I believe we are going on a long march tonight or early tomorrow morning we also had the band up here this afternoon, it was a lovely day it put one in mind of being in a park for the piece of land was covered with lovely green grass where we were laying about, & bonzer trees were scattered all over it & plenty of fruit trees were among them while on all sides of us were tall trees green with leaves from the bottom to top, they look splendid.\n\nThe","46":" Field Coy. of Engineer's have just gone past, they are going back\n\n \n\nfor a spell & I think we follow them tomorrow morning all going well. We have the cricketing going again, it's a fine pastime, the French people can't make it out you will see them standing about watching the ball get slogged & chased about I expect they think it a mad game\n\nHad a good dinner today, meat, potatoes whips of butter & syrup, jam, tinned peaches & pineapples, milk & tea. not so bad you know, I hummed 3 tins of butter off the Q Master for the boys so with the bucksheesh\" & our issue we had a good day.\n\nThis morning on parade an order was read out to us warning the boys against writing back to some of the letters we get written by supposed girls here in France, they reckon a lot\n\nof them are spies, & try to get information from the soldiers in this way, how all this correspondence started in the first place was like this, as we came up from Marseilles, a lot of us threw our addresse's out of the windows at most of the principal stations such as Valence's, Lyons \nW\n Versailles, Abbeville Bologne Calais, & so on, we were not long in getting replies to them, some were written in French & some in English, some of them were dead funny, but I think most of the letters we got were genuine\n","47":" Reveille at 4.30 this morning we had to pack up & clean our billets out by 5.30, then we had breakfast, after that the Pioneer Battalion went through, at 7 oclock we formed up & moved off, we had our band with us\n\n& they played some fine tunes on the march, the roads & weather were fine for marching, & the country we passed was covered with splendid crops including (more especially as we approached Outersteene plenty of fine hopground's) just before we reached Outersteene, our band which was marching in the middle left us & went in front, they took up a stand in the town & played us through there were a lot of the 12th Battalion there & a good few French people.\n\nAbout a mile outside Outersteene we marched into a small grassy paddock where we are now resting for a couple of hours, while the Battalion who are now in our old billets pack up & clear out, everyone has taken their boots & socks off & we are stretched out on\n\nthe lovely green grass, having a nice sun bath among clover a good foot high & in full flower.\n\nThere was scarcely a man dropped out during the march of 2½ hours, & the pace was a pretty good one from the start\n\n10th. This morning broke nice & sunny we were all dog tired so we were up pretty late, I got all the platoons signatures on a big card sent by Queen Alexandria & am going to post it away first opportunity I get, I tried to get it away to-day but the post office in Outersteene was shifting so nothing doing. \n\nI saw some of the 26th Battalion this morning I was trying to find Harry Kelly he is in the Battalion bombers, but they were right at the head of the Battalion & I did not have time to go along as we were falling in a few\n\nlater, as soon as we had dinner today we marched out onto the parade ground & the roll was called we then took our packs off & all the billets & ground was properly cleaned up before we went, I saw Graham & Flattley this morning in Outersteene they both belong to the Pioneer Battalion\n\nThere was an issue of green envelope's & Field card's on the parade ground this morning & not before they were wanted\n\nAll the members of the our band are now back with the Company, all our instruments have been sent to Salisbury Plains in England that's a pretty good sign \n\nThis morning all the N.C. O's were issued with a pair of wire cutters, & a lot of the men with bags to carry bombs in sounds nice do'snt it, but the sooner its over the better\n\nAs I write this the boy's are kicking the football about & enjoying themselves in the nice sun.\n\nYou should see the old French people collect round our incinerator when we are moving they generally get some good articles for there is always a lot of good stuff wasted when we are shifting about from place to place.\n\nLast night there was a fight between our aircraft & the Germans I don't know how it ended up, but our fellows chased them till they were out of sight.\n\nI hear Captain Price is getting the D.S.O & Lieut Moffatt, the M.C. I dont know what for something to do with the raid I suppose\n\nLeft our parade ground this afternoon at 4'oclock & marched to Bailleul, she is a nice little town, & there are some solid buildings in her streets\n\nwe entrained here, 40 men were supposed to go in a truck, but I need scarcely say that there was nothing near that number in them, when the total reached about 30 the N.C.O's in charge of the trucks would yell out \"full up\n\nJust as we were leaving Bailleul we managed to buy a couple of loaves of bread we wanted them bad enough to, for we were as hungry as could be for we only had a ¼ of bread issued to us for the days rations & that won't carry you far.\n\nWe got away about 6 oclock, & I think the country we travelled through for the next 4 hour's was if possible the finest I have ever seen & that is saying something as far as you could see on either sides of you there was nothing but magnificent crops of wheat & oats.\n\nthe wheat would run easily from 20 to 60 bushels per acre, it was about 5 or 6 feet high & as level as a billiard table, & just beginning to turn the oats would run easily from 2 to 3 tons per acre for hay & hard to say what they wouldn't thrash, they are 90 % Algerians, they do wonderfully well here but then what wouldn't grow in bonnie France, she seems to be just one oast alluvial plain of the finest possible quality there is never a fence to be seen, nor an uncultivated piece of land everything is put to the utmost possible use, & at this time of the year she is a sight one would never forget, I can give you no idea what she is like for I have never seen anything comparable to it in any form in either Tasmania or New South Wale's all along the line & in the crop's there\n\noceans of pretty flowers, such as poppies red as blood, daisies marigolds, buttercups, violets, wild roses, of all colours & descriptions, & a wild flower a good deal like a carnation, it was as blue as blue can bee, a Royal blue I should call it, I reckon it is the prettiest wild flower as ever I have seen, it grows all over the place & makes the country look something splendid, one can never forget France. When we reached Hazebrouck we were shunted on to another line & off we went, noone knew where, but as we all guessed towards the \"Somme\"\n\nThere was a funny thing happened about 10 oclock on the train, it was getting very cold & we were shutting all the windows & doors on the truck, after they were all closed, everyone settled down on top of one another or anywhere they\n\ncould, but try as we could we could not find room for 3 men who were left standing up & scarcely room at that with the doors closed, so these men said if we could not make room for them they would open the doors & let the cold wind in so they started off to push the door back I was laying close to the door & for a joke I put my foot against the door to try & stop them from opening it, but with the result of them pushing & me holding it with my foot, the door raised off the ledge at the bottom, & before we knew anything more about it the whole door had gone bash\" she hit the line, & 3 rifles that were leaning against the door clattered down merrily after her, we could hear the rattle & smash as the trucks struck the door & rifles, you should have seen the look of astonishment of the mens face's, when\n\nthey recovered their balance for they had a miraculous escape they were all but out & so was I no one seemed to know what had happened for a minute some thought that shrapnel had struck the train others thought that the truck was going to pieces, however when we took stock of the damage we found we had lost 1 door 3 rifles & 2 respirators the latter were mine & I thought one of the rifles was to for a long time, at the next station we called an interpreter along & told him about it, he then explained it to the French officials, didn't they get excited, I'll bet they think the Australians are a nice lot can't ride in an iron truck without smashing something, the last 3 train journeys I have been on now something has happened or I might say 4, the first was coming from\n\nAlexandria to Tel-el-Kebir when we lost several men out of our carriage, the next was from Tel-el-Kebir to Seraphium when we lost another man from our truck, the third time was coming from Marseilles to Hazebrouck, when one night I opened the door of my carriage, & let it swing out it had no sooner done so, than bash she hit the entrance to a tunnel & splintered the door to pieces, & 4th was last night I wonder what the next will be\n\nWhen we arrived at Fieneilliers Candas our destination after a trip of 7 hour's\n\nI reported the loss of articles to our officers, they didn't say anything only smiled when I told them how it happened, I told them one of the rifles was mine, but a little while after, I found out that my rifle through an accident was not among them another took mine in mistake for his when\n\nhe got in at Hazebrouck & left his standing against the door, luck if you like\n\nWe saw a British dirigible flying about up this part of the world, you could see her quite plainly, for the night was a bright & starry one, she looked like a huge bottle sneaking about in the sky \n\nWe started off on our journey about 1 o'clock in the morning little thinking the distance we would have to march before reaching our billets, just imagine us if you can with everything we possess up including waterproof & blankets, & nothing to eat worth talking about since 1 oclock the previous day, & we were all as sleepy & tired as could be, under these conditions we had to","48":" miles lucky we did not know it when we started off or I am thinking there would not have been many see it through, we kept on plug-\n\ning away expecting every turn to bring the long wished for billets in sight, but we looked in vain for we walked on & on until nearly everyone was dead beat at every spell most of us would drop off to sleep through sheer exhaustion, but when the whistle blew up they would get & plod along till the next stop it speaks well for the endurance of the men for there were only 2 fell out during this long & trying march, one of the hardest I have ever been on, at last the long looked for finish was in sight, a little village & our billets were in it, we had to wait a little while in the streets, & then everything being satisfactorily settled we were detailed off to our respective billets, once inside the men never troubled about taking their boots off or undressing but threw themselves down on the straw & went to\n\nsleep in a few minutes.\n","49":" Breakfast at 9.30 this morning & quite early enough after the stiff time of the last 24 hours.\n\nThis morning is very dull & cloudy hope it don't rain, we are not so very far from Amiens here according to the map.\n\nThe country we are now in is mostly chalk & very picturesque, it is fairly hilly & well wooded, while the roads are the best I have seen in France\n\nHave just been round the village Dombart she is rather a nice little place & very pretty I don't think they have ever seen Australians before, for we attract a fair bit of attention, I notice the officers are having a job to get quarters for they are running about all over the place, & I notice our Brigadier is on the same job, our boy's are already making the old village\n\nlook lively & are writing all sorts of things on the wall some of them are very funny, in common with all other French villages, Dombart has a very fine church & it has the first chimes that I have heard in France, they are very nice.\n\nThe interior of the church is in some respects the best I have seen in France it is something like Gothic architecture the ceiling is all carried up in big arches & they look to be marble, it is all done in a dark blue & white shade, & it gives a pretty & cool \neff\n appearance to the church They have a fine model of Joan of Arc in here she is dressed in her coat of mail & looks very fine, they go in of very fine stained glass windows, & stone & wood carvings all coloured to give a good appearance to it, all theses churches are no doubt beautiful, but they\n\nalway's strike me as being to much color & tinsel about them.\n\nThere is to be a feet inspection this afternoon to see how the boys are standing it. \n\nBy Jove\" you should see how these French girls work they are wonderful, they work from early morning till late at night, & all sorts of work too, & they are so neat & tidy.\n\nThis evening after tea I went for a walk through a small forest here that joins the town, it is a most beautiful little place the leaves are that thick that you cannot see the sun shining through & the trees are very tall & scarce a limb on them for 50 or 60 ft up the trunk there are roads running all through this pretty little reserve.\n\nThe 4th Battalion came in tonight they were covered in white dust & looked very tired & done up\n\nI also had a look at their cemetery they are a wonderful people to look after their dead, I'll warrant some of their vaults & headstones cost a fortune, they are most elaborately fitted up, & no expense is spared some of the vaults date back for a couple of hundred year's.\n\nThis evening an enquiry was held before Mr Graham about the loss of the rifles last night on the train, I had to give the main part of the evidence, for I was in charge of the truck at the time, my report practically settled the matter, so I don't expect there will be anything more about the matter\n\nGreat rumour's tonight of a great British & French victory at Peronne I hope its true, its up to us to shake them up a bit.\n","50":" Got orders to pack up last night & be ready to move off at 7 in the morning so we had an early breakfast & off we\n\nwent, just before we moved off a few more reinforcements joined us.\n\nWe passed through several villages on the way they were all packed with our boy's of all Battalions up to the 8th. \n\nAfter we had gone about 2 miles we ran into much more hillier country, & the little hills & rises were all covered with lovely wild flowers, which made the countryside a riot of colour.\n\nWe finished up in Vinacourt a fair sized village with a lovely church, inside the church is beautiful for it is such a height from the floor to ceiling.\n\nThere is also a fine figure of Joan of Arc here just close to the altar she is carrying the French flag & part of the folds are resting on her shoulders it is very pretty, they also have all the flags of the Allies in here.\n\nI have been trying all over the place in each place we come to, to find a book suitable to keep my diary in but have had no luck so far, they all have the French note books which have very fine lines ruled both way's, & they are no good to me I shall have to one of some sort shortly for this wont last much longer\n\nSaw General Birdwood & Walker here this morning they watched us pass through the town, we done the march quite easily & the boys all came swinging down the street singing for all they were worth I expect the French people thought we were a happy go lucky lot.\n\nThere are 10 of us where I am billeted & the old couple are fine typical French people as soon as we had got our packs off they pumped some water up for us to have a wash with, & they were as \n\npleased as Punch with us.\n\nThere is Field Post Office here & I am going to send a few cards away today. One of our cycle corps passed through here this morning, they are attached to us I suppose. We are now among the real French people & they are fine as soon as we lobbed at our billet the old lady brought us out a bucket of water to wash in\n\nThis is practically speaking a way back town, & the people hardly know a word of English, they appear to be astounded at the amount of money we have to spend but as far back as it is nearly every house no matter how poor the people may be have their electric light\n\n13th Had my breakfast in bed this morning & did not get up till 9.30 for just then an order came round that everyone had to be out of their\n\nbillet by 10 oclock, as we were moving on again at 12.\n\nEarly this morning a lot of our chaps passed through here I think they must be the 2nd Bde. I did not get up to have a look for it was raining at the time, though it is nice & fine now.\n\nSugar is almost unprocurable here, you have to bring your own sugar when you want to get coffee.\n\nI sent a few letters & the autograph card away from here yesterday, & also received a parcel from Aunt Carrie, & a couple of Courier's\n\nBy Jove there are some beautiful rose's grown about this part of France, they are the finest I have ever seen, & are all colours & sorts.\n\nAt 12.30 this afternoon we moved off from Vinacourt, the weather looked\n\nvery threatening but nothing came of it, we had a long & tiresome march for you know we had everything we possessed with us, & we were very tired & footsore when we reached our destination (Allonville\") she is about 20 kilometres from Vinacourt a kilometre is roughly 5\/8 of a mile We passed a few French soldiers on the way they were navvying on the roads\n\nWhen we are on the march we have regular spells, the first half hour we have 5 minutes, & from then every hour we have 10 minutes, so you can see we don't have to much loafing & we keep a fair pace up all the time.\n\nNews is just through tonight of a success the","51":" Division have just had where they relieved us at Fleurbaix, it was not true about the men \n\ninefficient, this piece of work speaks for itself.\n\nThere is not a loaf of bread to be had in Allonville for love nor money tonight & we are all as hungry as can be we have been all over the place scouting for some dodger I was lucky got ½ a loaf at a private house, every biscuit has been bought up for miles around by the boy's, I should not be surprised if some of them don't make for Amiens tonight she is only 7 kilometres away & that is a mere trifle to some of them\n\nThere are a good few Tommy motors & transport cars here they feed a portion of the firing line from here, how they tried to frighten us about the awful cutting up the battalions are getting but the boy's only laugh at them we have heard the same old tale too \n\noften now.\n\nI am writing this up in a little loft among some straw on which I have my bed for the night, probably the last soft bed I shall sleep on for some time for I expect we shall soon be among the thick of it now.\n\nWhen we arrived at Candas 3 days ago we left some of our platoon there to do fatigues & when they went to the estaminets, they refused to serve them, they said they would not serve Allemand\" prisoners, they could not make us out they made sure the boy's were German prisoners, & when they told them they were Australians that was worse for they thought they meant Austrians, it took them some time to explain the difference, & when they understood, they gave them a royal \n\ntime, we are now you might say in the backblocks of France.\n\nReceived a few more letters tonight\n","52":" Had a good nights rest, for I was very tired after our march. We had a feet inspection this morning to see how the boys are standing it \n\nGot half a loaf of bread this morning & was very lucky to get it, there is not a bit of butter or jam to be bought in the town.\n\nThe captain reckons we are going to a pretty warm shop, he told us all about it this morning\n\nSaw Ferguson & Tom Flattley this morning, it's a good while since I saw Fergy last, Marseilles I think it was\n\nWe are taking the shortages of clothing & etc this morning\n\nWe are on very short rations while\n\non the march, its wonderful what a small amount a man can live on when he is pushed\n\nHanded one of the two gas helmets in this morning, I suppose they are going to issue us with fresh one's Nearly everyone has had their hair cut short I have dodged it so far.\n\nWent for a short route march this afternoon & the sun was very warm\n\nThere is a small mail in & they are dishing it out.\n\nAbout 30 German prisoners went through here last night. I never saw them, but should like to have done so.\n","53":" Still at Allonville but I think we are moving this morning, B. Coy. were paid yesterday & I think we will be today.\n\nI wrote & posted 3 letters yesterday \n\nfor they had the mail opened\n\nI should like to have a look at Amiens it is very close to here, you can see the Catherdal quite plainly, she looks a fine big town & there are electric lights & trams in her.\n\nAny amount of aeroplanes about here they are nearly as common as motors. Had a good close look at one of our battleplanes yesterday, they are fine big ‘planes, there is an aerodrome right close to us.\n\nWent for a stroll last night with Don Fraser & Charlie Tonkin, the roads & lanes are beautiful around here & a pleasure to ramble about in lovely flowers & creepers everywhere. I saw the tallest peas I ever saw in my life the other day, they were easily 15 feet high, they were on sticks\n\nWent for a short route march this morning, & done a little squad drill, as if we have not had enough of both, according to Battalion order's A. Coy. marched the best the other day & C. Coy the worst.\n\nYou can see quite plainly our observation balloon's up from here especially of an evening\n\nOut again this afternoon, the boys were in a bad humour & so was the Captain so things were anything but pleasant the boy's don't like the idea of the two parade's daily & are kicking a bit over it, I can see some fun shortly if the parades are continued\n\nOur Colonel has gone to the trenches today to have a look at things\n\nThis evening 2 other chaps & myself went over to the Flying Corp's\n\nAerodrome, to see if we could get a ride in one of their plane's, they said that if we came next day they could probably fix us up, how I would like a fly in the air, they have easily 20 planes in these shed's some of them are mounted with 2 machine guns\n","54":" Last night about 11 oclock just as we were dropping off to sleep the whirring sound of an aeroplane startled us, not that there was anything uncommon in that but we had no sooner heard the aeroplane than something else could be heard whistling through the air bombs\", 3 of them dropped in the village quite close to our \nvillage\n billet, but luckily failed to explode, instantly everyone was alert & our guns aided by the searchlights evidently found the raiders for they started to blaze away at them, & the nose caps\n\n& pieces of shell fell all around us but no one was hit, but 4 horses bolted out of the A.S.C. lines & could not be found this morning\n\nYou should have heard the French people when the shells & bombs were flying, they were terribly excited & started running about & looking for shelter, some of the boys quietened them a bit, they were saying \"Allemand us bon, \"Allemand bombard\", some of our planes went up after them, & with the aid of the guns accounted for 2 of them.\n\nGot orders last night to pack up & be ready to move off at 9 next morning I was Orderly Corporal this morning so I had my work cut out to get my work finished & pack up in time.\n\nAt 9.30 off we went our Coy leading & all as merry as crickets\n\nwe marched at a good steady pace with 10 minutes breathing space every hour, till 1.30 & I can tell you no one was sorry when we reached our destination \nWiloroy\n Wallory Bailon, our pack straps cut into our backs like pieces of string & the sweat nearly blinds one its not the distance that counts its the load we have to carry, when we got on top of a fairly high hill we could hear quite plainly the guns booming in the distance, the old familiar sound again we had been out of earshot of them for nearly a week, & no one was sorry to miss them, as we were coming into the village we passed some Tommies on the road & some of them were wearing spiked German helmets, trophies of some scrap they have had with them.\n\nThe billeting part of this town is\n\nsadly overcrowded, half of us are sleeping outside under the green & leafy trees, this is bonzer while the fine weather lasts, but no good when it rains & it looks very threatening tonight.\n\nThere is a fairly big canteen here, but it is nearly bought out now, the boys fairly rushed it.\n\nRun into a good sort of an English officer today 2 or 3 of us were standing in the street when he came up & slapped us on the back, Australians eh\" he said & you are goods sports & so am I, I like you chaps he said; it appears he is one of the original officers of the famous old 29th Division the Div that Sir Ian Hamilton spoke so well of & which fought so splendidly at Cape Helle's, he had often\n\nseen the boys in action, & thinks the world of us\n\nTo-day is Sunday & the French people are going backwards & forwards to church arrayed in their best clothes, some of them look very smart indeed\n","55":" Physical jerks this morning & a short route march afterwards, we were marched out & then all the N.C.O.s were called out & the Captain told us about his visit to the trenches, & all about the big push we will be in it in a few days time & from all accounts it is going to be a sort of Hell but everyone is very confident\n\nLast night we had a cup of coffee with an old lady & she told me her story one time 2 years ago she belonged to a village over the line & now in German possession, her husband was a well to do farmer & all here people the same\n\nnow they are all ruined their land & property gone, most of the family & her husband dead, & her mother was murdered by the Hun's, can you wonder at them hating the German's & they hate them with a deep undying hatred that you can hardly fathom\n\nIt seems to me so funny when you come to look at things in this 20th Century light, here is France one of the most enlightened nations in the world, yet there is a barrier across her, varying from 20 too 400 yards in width right from the North Sea to Switzerland & no power on earth can get you past it, it seems peculiar that just across that just across that narrow space of struggling green grass there are towns & villages as far removed from you as Mars might be, & you might say we know\n\nas little of their lives as we do of the Martians who are supposed to inhabit Mars There it is you can travel from any part of the world you like until you reach this barrier, you are then in a place which no power which has ever been produced in this world can break, not all the money \n not\n nor the inventions, nor the labour the brain, nor the physical power in the whole world has yet been able to pass, the German nation for reasons of its own, has put this barrier across another peoples country, & made a fool of the civilised world, but there will come a day when that line will snap like thread, & English & French armies will pour in their thousands on to the promised land\n\nSo much for that outburst, I suppose some people would call me a fool \n\nfor writing in that silly strain but the very fact of it being so appeals to me\n\nGot a letter from Len to-day I have been waiting anxiously for news of him, he is in 18th General Hospital at Cameaies, & pretty crook however he is much better off there than here for we are in for a stouching up for a certainty, for we are going to try & do what English troops have so far failed to do & that is take a wood near Highwood, they have taken it twice, but each time were driven out I believe the artillery fire is something hellish, & I don't expect many of us will come out alive & our Brigade are the first to go over & I think our Batt are leading the charge, it is bound to be a most terrific fight\n\nwhether we take or fail in the charge however the boys are all very confident over it, most of the Battalions are new & untried practically & they little know which is just as well for them what they have to face, I am speaking of course of our reinforcements, for nearly 90% of the men are reinforcements there is of course no harm in being that in many ways they are better than old hands for they dont realize the danger like one who has been through the mill does, & I believe the old saying is pretty true: that a soldier fights best in his first battle, I'll bet the boys will go like tigers & take a lot of stopping however the future is in the lap of the Gods.\n\nPayday so the boys are all as merry as crickets\n\nAll the Compane's nominal rolls were checked today, a healthy sign of coming battle.\n\nSome of our platoons went for a bath today but they were sucked in for they had to have instead of the usual hot bath a cold shower & no change of clean clothing\n\nThis morning I had charge of our platoon for physical exercise, & tonight I am in charge of the billet guard, a very soft snap.\n\nIt has been drizzling rain all day & the roads & streets are very sloppy Its funny here to see the boys with champagne it costs 6 Francs a bottle as a rule (5\/-) & they buy a lot of it, its like feeding pigs on strawberries, to see them guzzling the sparkling liquid down\n\ndrinking it out of old dixie lids or anything they can lay their hands on.\n\nThere are hundreds of motor loads of shells & etc go through here every day, you might say the traffic never ceases, for if anything it is busier at night, as I write this I can hear the gun's real plain belting away for all they are worth.\n\n18th. Received orders at 6 oclock this morning to pack up & be ready to move at a minutes notice, so perhaps this may be my last entry in the diary it is still drizzling rain\n\nSome German prisoners went through here yesterday & from all accounts they were a rough looking crowd\n\nThere was a most terrific bombardment all last night, it was just one \n\ncontinuous roll of thunder, there were a few monstrous guns that you could hear above the roar of all the others every time they were fired I expect they were our 15 inch naval guns of which we have a few in action on this sector\n\nI addressed Aunt Carries parcel she sent to me, to Len, for I opened his when it came for he had gone to hospital Received a letter yesterday from Miles & Kay in reference to Post Cards the price is very satisfactory but before I go any further I shall wait & see how I come out of this scrap\n\nYesterday men were detailed off for the different jobs, all runners are wearing red armlets on both arm's the bomb carriers have green bands & the wire cutters have blue, so you can see everything is worked out to\n\nthe smallest detail & nothing left to chance, we have also got 6 more Lewis guns to the Battalion, so we are pretty well equipped for the hurly-burly. I guess she will be some dust up\n\nWe were to have moved off at 8 oclock this morning, but the order was cancelled, & now we are out on parade\n\nAll the Tommies were \"stood to\" all last night on account of the heavy fighting that is going on.\n\nThis afternoon I was up before the Captain the S.M had me & a couple more up but I beat him hollow, & my case was dismissed \n\nOld Mac. had all the boys singing tonight, he came round to our billets where there is a small piece of vacant ground almost in the middle of the town, he started with just a\n\nhandful, but you should have seen the crowd grow it was wonderful, in no time he had a sacred service in full swing nearly all singing you know, & with just a prayer in here & there, he is a grand fellow, the best of the boys will tell you in the A.I.F he is almost idolised by the Australians you have no idea how that man is liked, I'll bet he can sway the whole of the Australians any way he chooses, & he would give you half of his last penny: such a man is Capt. Mackenzie a Salvationist, all the boys know him by Mac. he was granted a Military Cross for his work on Gallopoli, you have often heard me speak of him\n\n in my letters from there, & I'll bet his medal was one of the hardest earned there of any of them a V.C. would have been more like it.\n\nA couple of hundred or so of our Light Horse passed through here this morning we want them all over here when we break through the German lines\n\n19th. Everything is bustle & hurry this morning, for we are getting fitted up for our charge, helmets have been inspected top see that there are no flaws in them, extra ammunition has been served out making in all 250 rounds per man, all of us have our pink patches sewn on to the tunic at the shoulder blades they are about 6in square & are there so as our artillery can distinguish us from the enemy, some of the boys look like jockeys with the \n\ndifferent colours up.\n\nOur steel helmets have also been inspected, & the Dr. gave us a lecture on how to adjust the Field dressing properly & how to stop bleeding\n\nWe are leaving our packs at the dump all letters & diaries have to be left behind I am going to give this to our parson he is a good sort of a chap Mr Graham gave us a lecture this morning & he practically told us to give no quarter & take none, that will suit the boys down to the ground I'll bet. I myself will have no pity on them if spared to get over to them & I have a friend sitting alongside me fixing his helmet up who will have no either, I reckon a man is quite justified in shooting the dogs on sight, they stick that fast to\n\nthe recognised rules of warfare that the Red Cross men have to carry arms to protect themselves when gathering the wounded.\n\nWe are going to have a church service here sometime this afternoon, the last one a lot of the boys will attend worse luck.\n\nA most remarkable coincidence has just occurred to me, it was nearly this time last year, that I went up before the Colonel & did my stripe I did not care so much about that & could probably have cleared myself had I liked, but I did not want it at that time, now yesterday I was up for almost the same offence trivial as it was, & like last year, it was 2 days before Lone Pine\" & this time 2 days before this big charge & they\n\nare the \nfir\n only crimes I have had with the exception of one at Mena, when there were about 30 of us up together on the same charge, we got 1 days C.B. over it, there are \nfewe\n few men in the Battalion with the same length of service with as few crimes as that, however this time unlike last year I beat the SM. easily, he is a two faced chap I can tell you, you have always got to be on your guard when dealing with him as a good few of the boys have found out\n\nIt is a lovely & glorious day today the sun is shining brilliantly & everything looks nice & fresh. I reckon it is a good omen, for it to be a fine & sunny day for us is to move off on after all the miserable weather there has been lately, we go over the parapets I believe tomorrow morning, & then\n\nthere will be something doing.\n\nThe streets of this little town are almost as busy as Sussex St in Sydney for there is an increasing string of vehicles passing both ways a lot of empties returning from the firing line, while those going up are loaded with ammunition to blow the Huns sky high out of the pure air they are contaminating with their foul bodies if you sit where I am just now penning perhaps my last entry, you will see all sorts & manners of carts go rambling by, Red Cross wagons & motors galore water carts, telephone repairers, Army Service waggons transports of all descriptions & size from the one horse chaise of the Battalion, to the great motor waggons belonging to the different Army Corps engaged on this front, some traffic I can tell you, while motor\n\ncars, bicycles, & the ordinary push bicycle are as common as the soldiers who throng the little narrow cobble streets of this little French village.\n\nI saw 3 English nurses walking through the streets this morning.\n\n20th. Well after all I did not give my diary to the parson, as I was too late so I decided to chance it & carry it myself. We left our billets in a hurry, we got 10 minutes notice to pack up & fall in, we carried our \nblanket\n waterproof & overcoat rolled in bandolier fashion.\n\nHad a pretty long & tiresome march & just outside Albert we pulled up & had tea on the roadside, we were now getting close to the scene of conflict for all around us great guns were firing.\n\nAfter we had our tea we fell in again & marched through Albert, she has been\n\na fine big town in her day, but is now absolutely ruined there is scarcely a house in her that has not been hit by German guns, the church there which was once a beautiful building present a most peculiar sight, she is battered & bashed almost pieces but still the tower stands & right on top there is a bronze figure of the Lord which weighs 20 tons, a shell has hit the statue & knocked it completely down & there it hangs hundreds of feet in the air suspended from nothing by the look of it, & in the attitude of a man about to take a dive into the water\n\nThere are thousands of troops billeted in and around Albert, for the place is pretty safe now the Germans have been driven back from it, its hard to say what the people will do with the town for she is hardly worth while rebuilding\n\nWe pulled up about a mile outside Albert, right opposite a big camp of Tommies, how they rushed down to have a look at us I think to a lot of them we were the first Australians they had seen, they were not bad sorts of chaps by any means, here a most remarkable sight was to be seen, hundreds of guns right out in the open & almost wheel to wheel, they had made no effort to hide them all the cover they had was a bit of canvas over them to keep the rain off the gun's, these were some of the guns that had smashed the German trenches to powder, most of the guns back here were from 4.7. to 15 in. while we were there some 12 in guns were firing they kick up a terrible stink & shake the whole place when they go off, they are also lots of batteries\n\nof the famous 7 5.'s a bit in front of our big guns, they are all manned by Frenchmen, for France wont allow others to use here secret gun. you ought to hear the Tommies praise these spitfires up they do give them a name.\n\nWhile we were waiting here lots of Tommies were coming back from the trenches & any amount of them were carrying German helmets & there were some beauties among them too.\n\nOne thing struck me very forcibly here & that was the utter disregard they had for the German artillery, hardly anything was under cover bodies of men were camped about everywhere & horses waggons & stores the same, you would think old Fritz would blow them to pieces, but the reason is pretty well understood for he is practically blind we have such a \n\nabsolute mastery over him in the air he sends neither observation balloons nor aeroplanes up now, that is to say worth speaking of, for as soon as he does our chaps swoop down on them like a hawk on a chicken.\n\nWhen it got sufficiently dark enough we moved off for the trenches, when we topped a little rise from where the British front line trench was before the advance started, we could see nothing but a maze of trenches a regular network they were one time the German first line, but now all smashed to pieces, we have a lot of field guns in them now, & they were firing like one thing as we approached them where ever you looked on the ground you would see shell holes some of them big enough without a word of \n\na lie to cover 10 horses up, you can hardly walk for these shell holes the ground is pockmarked all over with them, all over the place are little white crosses which tell their own tale, they are the graves, just hastily covered over of the brave fellows who broke the German lines, & who were killed in the charge\n\nThe German trenches are much superior to ours, they are deeper, better drained, & have all the conviences possible even down to electric lights & feather beds, their dugouts are from 18 to 30 ft deep & any amount of them have rugs pianos, & all sorts of things inside, & beer was to be found by the thousands of bottles, they like the Austrians never had any idea of being shifted from these positions for they thought they were impregnable according to the amount of digging & barb wire there\n\nis to be seen, they should have been too.\n\nWe passed trench after trench & at last we topped a rise almost overlooking the battlefield, here we had to double across for there are no communication saps for cover, I think we all got across safely until we reached an old road that we had to pass down & the Germans were shelling it like mad, we had a few casualties in here but when we left the old road & went down one of the Germans old trenches, we should have by all of the rules of warfare lost ½ our company but as luck would have it about 70% of their shells were duds they were shooting like mad at this trench for they knew well enough that all reinforcements had to come down that way, once we all got crowded up together now I thought we'll cop it\n\nbut fortune still favoured us & we got out of it, leaving the trench we had to rush over some more open ground & pass through a curtain fire that the Huns had on it\n\nOnce over this we were soon into a shallow trench, & here we had to stop & act as reserves, A. & B. Coy. went into the firing line the same night, & I think tonight we will be having a charge, last night we had to dig rough possies in the trenches & today we have to lay as quiet as mice for if the German artillery spot us they will blow the trench to pieces, they are very suspicious as it is & have kept 3 big guns trained on to it ever since we came in & they keep up a steady fire on us, they buried 3 chaps this morning 1 of them was killed, & we have had a few casualties from splinters, I had a narrow shave for a fair size piece of\n\nshell struck me on the wrist but it only caused a big bruise.\n\n2 of our officers were gassed last night they got it from a gas shell I think & about 8 or 10 men are suffering from the same thing.\n\nAll our artillery will be in action tonight so old Fritz is in for a very lively time\n\nAs I write this there is a most terrific artillery duel in progress & you can hardly see anything for dust & smoke\n\nWe are right facing Contalmaison She was a pretty little village no doubt one time but now there is hardly a wall left standing\n\nI can count no less than 21 of our balloons up & 17 aeroplanes are scouting about, about 2 hours ago the Germans fetched one of our planes down, she was \n\ncompletely smashed up & dived head first to the ground in flames I think machine gun fire caught her.\n\nA 3rd Battalion chap has just done a brave deed, he rushed over to within 50 yards of the German trenches & rescued a wounded Tommy who had been there for 5 days both got back safe.\n\nJust close to where I am there is a German gun, & thousands of rounds of ammunition, By Jove there is some stuff laying about, rifles, ammunition, wire of all descriptions, clothing, gas helmets & etc. thousands of picks & shovels, & plenty of German helmets, the ground about here for miles is just one vast mass of shell holes, there must have been millions & millions of shells shot away by both sides, & there is any amount of dead men lying about\n\nThis afternoon a shell buried no less than 8 of our machine gunners but they got them out safely, though all were suffering more or less from shock It is Hell here alright & would try the nerves of the strongest man, I am absolutely certain we are going over tonight, won't it be a charge.\n\nThere are no English troops on our part of the line now, we have taken over this sector.\n\n21st. Last night there was a fine duel fought right opposite our lines between 2 Taubes & 2 of our machines, they circled & dived around one another for some time each manouvering for position to put the finishing touch on, at last one of our machines appeared to be beaten & started to dive headlong to the grounds the Taube followed her closely, our\n\nplane appeared to be helpless & we all thought she was done, but all of a sudden the other plane of ours could be seen swooping down on the diving Taube like a thunderbolt, & to the amazement of all, the plane the Taube was chasing to the ground suddenly righted itself & shot up past the Taube like lightning the Taube tried to do the same but our other plane was too close to him so he continued in his mad dive & was smashed to pieces quite close to our lines how the boys cheered, it was a cunning ruse alright like the first plane of ours did to kid done, & let the other plane finish him off.\n\nThe air around here is simply swarming with our planes we have scores of them, they won't let a German plane live long over here.\n\nWas down with a fatigue party this morning to get our rations such as they are, the food here is very poor & scarce\n\nPoor old Andy Anderson one of the originals was killed this morning, a piece of shell went right through his steel helmet & killed him instantly.\n\nA lot of our Australian artillery is in action today, they are firing like mad & have got the range to a nicety, the way they shell the wood in front of us is something terrific, all day long there are shells bursting in it from 3 in. to 12, I can tell you the latter send the earth & stuff easily 300 ft high & go off with an earsplitting roar, I have seen them uproot big trees, such is there power, our chaps have never stopped bombarding since we came into the trenches, I don't know whether you believe it or not but it\n\nis nearly impossible to sleep on account of the vibration & concussion, for it is one perpetual & constant roar, which never ceases, I reckon for every shell the Germans send over we send 20.\n\nThey have been using some of the captured German bombs against them some of them weigh 180 lbs they are monstrous things something like an aerial torpedo & do a terrible lot of damage\n\nThey are also getting there liquid fire what they use in the shells back our chaps dosed the wood in front of us with it yesterday, it is a terrifying thing to see the fire shoot down in a great sheet of flame when the shell bursts\n\nThere is one thing that gets over me properly here & that is the way you can expose yourself & not get hurt its just marvellous there are thousands of men walking\n\nall over the place right out in the open & not more than \na\n 1000 yards away from the German guns, anywhere else I have been you could scarcely show your nose out of a communication trench without getting a dose of shrapnel over on to you.\n\n22nd. Last night every man was issued with 2 bombs & 2 sandbag's, & he has got to take these with him in the charge tonight\n\nTook a fatigue party of 21 men down today & got a load of water for the firing line. Another furious bombardment this afternoon the Germans are making it a welter & knocking scores of our blokes out & wounding hundreds, God knows what it is like in their lines for our fire is much more severe than theirs.\n\nI have just come back from a visit to the firing line, all the Coy N.C.O.'s. were over, or supposed to go over\n\nbut only 3 of us got across the others jibbed it, fire to hot; the reason we were over was to have a look at our objective tonight so as we will know where to take our men & all about it, the funny part of all this is that the firing line is as safe as can be, but behind it whew \"She is Hell\"\n\nThis is a rough plan of our offensive tonight\n(Village & wood a great stronghold)\n\n3rd Battalion objective, German trench & village\n\nC.Coy. objective 2nd line trench\n\nRailway line\n\nclear ground but shell torn\n\nA Coy. objective 1st trench\n\nClear ground but shell torn\n\nfiring line\n\nB.Coy. 1st Battalion\n\nContalmaison & Reserves & supports A (11th Batts)","56":" Batt) (Supporting)\n\ncoming back from the firing line we had to run the gauntlet of the German guns they were pouring it in properly, evidently they think we are massing man in a little gully just close to Contalmaison, but they are sadly out of it, the ground around here is simply turned upside down with shells it must have been something awful the fire, there are also some German guns destroyed quite close to here, I'll bet there is about 30 acres of ground here that you couldn't ride a horse over for shell holes & some of them are 15 or 20 ft. deep it is a sight that has to be seen before you can form any idea of what it is like.\n\nA small mail came in tonight but I never got any\n\nI am going to leave this with our Q Master Freddie Turner he is a good sort of chap & will see that it is sent home if the worst happens & he is spared.\n","57":" Well thank God I have been spared to come through another fierce charge safely & with scarcely a scratch I think Providence must watch over me, for my luck seems unatural.\n\nAfter I passed my diary in last night, we sent all our \nb\n overcoats & blankets into a big dugout. at 10.30 we moved out, & all the way we had to run the gauntlet of a pretty heavy shell fire for the Germans were very suspicious & evidently were expecting an attack, they were slinging their rockets about all over the place lighting the country almost like day, we reached the firing line at 11 oclock, & took up our positions & waited for the time to come for us to hop over, while in the trenches\n\nevery man was either given sand bags or picks & shovels, for they are just as necessary as you rifle & bayonet in a charge when you have to dig yourselves in as we had to do\n\nAt last the fateful hour came & A. Coy. sneaked quietly out & we followed them, when we were about 100 yards out our gun's opened up the bombardment it lasted exactly 2 minutes on the first trench & we all advanced under cover of it, so good was the timing that when we were about 40 yards off their barb wire the guns lifted & A. Coy. rushed the trench supported by C. the instant our guns lifted, the German batteries & machine guns which had been waiting opened up on us & let Hell lose for a torrent of high explosive shrapnel & bullets were let loose on us men fell in all directions, but nothing could stop the boy's now their blood was up into the trench they dashed & bayonetted & shot \n\nlike fury, the squareheads were thunderstruck at the violence of the assault, & hopped out of their trench & run for their life, with the boys after them hot foot, they dropped everything they had, their one thought seemed to be to get away from the despised Colonials.\n\nOur Battalion got about 60 prisoners in this trench, & its hard to say how many were killed for they were laying all over the place. A. & B. Coy. were supposed to stay in this trench but no fear on they went like a pack of hungry dog's now they had tasted blood, this first trench was about 300 yards distant, & on we all swept line after line, but soon all were mixed up together & bunched dangerously close, the shell fire was now hellish\" & the noise deafening, but just to show you how cool the boys were, why some of them were walking up with rifle's at the slope & singing \"I want to go home\" what do you\n\nthink of that, at last we reached the railway line, & laid down while our boys pasted the second line with shells, we had not long to wait, but it seemed hour's to us laying out in the open waiting for the fire to lift, at last the fuses were lengthened, & like a pack of hounds the boys rushed the trench our objective, but there was very little in it & it was ours in a few minutes, at this period over came the 3rd Batt. closely followed by the","58":" 11th","59":" their objective was in front of us again, & scores of our Battalion went on with them to the wood which was just in front, we started straight away to consolidate our position so as to be ready for the counterattack which usually follows the charge, by daylight, we had a fairly good line dug out & organised & were ready for them to try their luck against the scum as they had sneeringly referred to us in their papers.\n\n"}}