{"Document Name":{"0":"Diary_0177","1":"Diary_0177","2":"Diary_0177","3":"Diary_0177","4":"Diary_0177","5":"Diary_0177","6":"Diary_0177","7":"Diary_0177","8":"Diary_0177","9":"Diary_0177","10":"Diary_0177","11":"Diary_0177","12":"Diary_0177","13":"Diary_0177","14":"Diary_0177","15":"Diary_0177","16":"Diary_0177","17":"Diary_0177","18":"Diary_0177","19":"Diary_0177","20":"Diary_0177","21":"Diary_0177","22":"Diary_0177","23":"Diary_0177","24":"Diary_0177","25":"Diary_0177","26":"Diary_0177","27":"Diary_0177","28":"Diary_0177","29":"Diary_0177","30":"Diary_0177","31":"Diary_0177","32":"Diary_0177","33":"Diary_0177","34":"Diary_0177","35":"Diary_0177","36":"Diary_0177","37":"Diary_0177","38":"Diary_0177","39":"Diary_0177","40":"Diary_0177","41":"Diary_0177","42":"Diary_0177","43":"Diary_0177","44":"Diary_0177","45":"Diary_0177","46":"Diary_0177","47":"Diary_0177","48":"Diary_0177","49":"Diary_0177","50":"Diary_0177","51":"Diary_0177","52":"Diary_0177","53":"Diary_0177","54":"Diary_0177","55":"Diary_0177","56":"Diary_0177","57":"Diary_0177","58":"Diary_0177","59":"Diary_0177","60":"Diary_0177","61":"Diary_0177","62":"Diary_0177","63":"Diary_0177","64":"Diary_0177","65":"Diary_0177","66":"Diary_0177","67":"Diary_0177","68":"Diary_0177","69":"Diary_0177","70":"Diary_0177","71":"Diary_0177","72":"Diary_0177","73":"Diary_0177","74":"Diary_0177","75":"Diary_0177","76":"Diary_0177","77":"Diary_0177","78":"Diary_0177","79":"Diary_0177","80":"Diary_0177","81":"Diary_0177","82":"Diary_0177","83":"Diary_0177","84":"Diary_0177","85":"Diary_0177","86":"Diary_0177","87":"Diary_0177","88":"Diary_0177","89":"Diary_0177","90":"Diary_0177","91":"Diary_0177"},"Date":{"0":"unknown","1":1899.0,"2":1900.0,"3":1901.0,"4":1902.0,"5":1903.0,"6":1904.0,"7":1905.0,"8":1906.0,"9":1907.0,"10":1908.0,"11":1909.0,"12":1910.0,"13":1911.0,"14":1912.0,"15":1913.0,"16":1914.0,"17":1915.0,"18":1916.0,"19":1917.0,"20":1918.0,"21":1919.0,"22":1922.0,"23":1923.0,"24":1924.0,"25":1925.0,"26":1926.0,"27":1927.0,"28":1928.0,"29":1929.0,"30":1930.0,"31":1931.0,"32":1932.0,"33":1933.0,"34":1934.0,"35":1935.0,"36":1936.0,"37":1937.0,"38":1938.0,"39":1939.0,"40":1940.0,"41":1941.0,"42":1942.0,"43":1943.0,"44":1944.0,"45":1945.0,"46":1946.0,"47":1947.0,"48":1948.0,"49":1949.0,"50":1950.0,"51":1951.0,"52":1952.0,"53":1953.0,"54":1954.0,"55":1955.0,"56":1956.0,"57":1957.0,"58":1958.0,"59":1959.0,"60":1960.0,"61":1961.0,"62":1962.0,"63":1963.0,"64":1964.0,"65":1965.0,"66":1966.0,"67":1967.0,"68":1968.0,"69":1969.0,"70":1970.0,"71":1971.0,"72":1972.0,"73":1973.0,"74":1974.0,"75":1975.0,"76":1977.0,"77":1978.0,"78":1979.0,"79":1980.0,"80":1981.0,"81":1982.0,"82":1984.0,"83":1985.0,"84":1986.0,"85":1987.0,"86":1988.0,"87":1989.0,"88":1990.0,"89":1991.0,"90":1992.0,"91":1993.0},"Entry":{"0":"\n\n","1":"\n\nThis book is the tenth of the series completed during my period at the War & as I am on my way to Australia it will probably be the last. The 9th edition was commenced a few days after the armistice & yet we are still awaiting the peace treaty to be signed, while in the mean time rumours of further trouble are rife & and strikes and disturbances are common in England delaying our demobilisation. \n\nUp too late for breakfast so made a piece of toast & had a cup of tea made by some tommy engineer who are looking after us. Had a hair cut at the barbers & spent next day cleaning up boots etc. At 5.30 P.M. we went out for the evening ( 7 of us) to a café, the owners lending us a private room with piano etc. with the aid of thoracic lubrication singing and dancing we spent a most enjoyable evening, returning to camp about 10. so far having a real good time indeed.\n","2":" Still very cold but my hut helps to improve things. At 10 oclock there was a roll call & we handed in all our equipment, no check being made as the proper system had apparently broken down under weight of numbers. Spent the remainder of the morning on my diary writing. Afternoon went into town for a bath and had a good one, 1½ hours after which we visited a café and had dinner at Samouns opposite the Palais de Justice. Returning home we called in at a halfway house and had a few dances etc. arriving home at about 10.30 after a real good outing. My heel is once more giving me trouble & I may have to do something about it. Collected my sea kit bag & a towel today & one draft left for England.\n","3":" Just missed breakfast by 5 minutes and had a cup of tea. Spent the morning filling in time & also put up another blue service bar, today being\n\nthe anniversary of my sailing 4 years ago. Resting my foot in a slipper. In the evening went back to the café & had a splendid night. Nine of us in the party & dancing and singing until about midnight making a fond farewell as we left. They have been extremely nice to us & it has gone a bit towards making our stay here enjoyable.\n","4":" Weather not quite so cold but the same beautiful sunshine. The men of my draft had a bathing parade & another issue of underclothing was made. Rumours of us going today, some members having already been warned. At night went to the camp cinema & listened to an address later by Padre Gault, one of the mens favourites.\n","5":" Applied for a pass in the morning in order to visit Havre which I did in the afternoon. The city has little for a visitor to see but I strolled round\n\nthe Docks & watched the shipping etc, a very interesting afternoon. Returned in time to go to a dance in the Gym. Hall, plenty of W.A.A.C.s in attendance & had a real good night.\n","6":" Rumours of our departure today so packed my gear ready arranging my sea kit bag with straps as a pack. Immediately after tea we fell in ready to march off and were checked over a couple of times & then given a ticket for the boat. This took about 1½ hours after which we marched to the boat about 5 miles through mud and slush, the thaw having set in. The boat, a paddlewheel, left about 8.30 making a remarkable easy trip & anchored off Weymouth about 5 a.m. & we \n","7":"\n\nlanded at 9. As we went off another ticket was given us with which we obtained a cup of tea and scones, after which we received another ticket with which we received a bag at the station, containing biscuits, cheese, a bit of chocolate, which was for our\n\ndinner in the train. We reached Codford & marched to the no. 4 camp arriving around 3 p.m. A wash up and a shave was my first pleasure. Tea at 6 p.m. & everything promises to be very comfortable. The train journey this side was a treat after the cattle trucks of France. The whole journey so far has been most pleasant, all arrangements being splendid.\n","8":" The M.O. who accompanied us went away today & another took his place & told me we were to remain here indefinitely . This I protested against but he referred me to the S.M.O. Raining all day and dull. They are busy taking particulars of the men arranging for their furlough and medical examinations but nothing is being done on our behalf. Codford a rather pretty place & would be ideal for a man recuperating from an illness. All conveniences as regards shops Y.M.C.A. library etc.\n","9":" Decided to get some satisfaction today. First saw the M.O. who referred me to the Senior S.M.O. a Colonel, who gave a grudging consent for my request to be sent to Fovant my proper destination. He referred me to a Captain who would arrange it. Walked ¾ miles & waited on the Captain who was sympathetic but would not do it without written authority from of the Colonel. Hurried back to him & obtained it, then had dinner. Returned to Captain & after waiting 2 hours agreed to send me to a Staff Captain for the necessary authority. Fortified with this went to Furlough officer who gave me a warrant to go. Returned to camp reported that I would be going next day. Wrote to S.M. & Co. to send my mail to Fovant also £5 as my present wealth amounts to 1½d & my paybook is in London. At night went to hear a lecture by a man who had been a prisoner in Germany, rather good. \n\nHave just finished a book \"Paul Stranger\" by Louise Brown very good scenes around Melbourne.\n","10":" Feb.. Snow falling again. Set off about 9.30 to catch the 10.10 train to Fovant but was nearly stopped altogether by the Adjutant who said he had no authority to let me go. Reached Salisbury then changed for a Fovant train arriving at the camp about 2 p.m. First had dinner at the mess and then reported, pleased to see dozens of our chaps who had left a couple of months ago and who were still waiting for boats, the strike etc. holding them up. At night went to the Y.M. & listened to a lecture by an Indian doctor on India.\n","11":"\n\nAfter parade in the morning went for a walk & later received my mail from London and also £5 from S.M. & Co. Went to pictures at night a real good show. Put in an application for leave for 14 days to commence from Friday next. Weather wet and depressing. \n","12":" Had a bath, hot shower & otherwise prepared to go away on leave. At night went to Y.M. to hear a lecture on New Guinea by Chaplain Bartlett & it proved to be one of the finest addresses & incidentally the best defences for missionary work that I have ever heard. At times he was really thrilling.\n","13":" Telegraphed to London for a room at the Bonnington in the morning afterwards having a long walk, weather beautiful. After dinner it commenced to rain heavily. I caught the 4.20 train to London changing at Salisbury where I had tea. Arrived in London at 9p.m. & found my room ready. Sent off a few letters making appointments for the next couple of days. \n","14":" A busy day. Did a certain amount of shopping, visited Horseferry Rd. & collected 10 of the best from S.M. & Co to help me\n\non my way. Afternoon called on F. Gissing, had tea there & then did the pictures arriving back at the hotel at 11.30 p.m. Collected Australian mail at L.M. the first for many moons.\n","15":" Wrote letters in the morning. Afternoon went to see D.W.A. at Bayswater but found they had shifted so did not see them. Had tea at the Aldwych Y.M. then went to a concert in the Queens Hall splendid orchestra & good music. Heavy cold on me.\n","16":" Received a ring from D.W.A. giving me the new address so went round for tea and dinner. Arrived home about 11.30. Sleeping much better lately the threatened insomnia disappearing.\n","17":" At 2 oclock met D..W.A. at Earls Court & took tube to Kew then went over the gardens. Looking very well considering the weather & war conditions\n\nwent over the hot houses making acquaintance with Australian gums again by rubbing the leaves on our hands. Walked by way of the tow path along the Thames to Richmond where we had tea and returned to Earls Court. Returned straight to hotel & turned in early as was feeling bad with my cold. Influenza is raging everywhere so may be in for it.\n","18":" Made arrangements to have some dancing lessons as I wanted to learn the latest one step, foxtrot, 3 step etc. before returning to Australia. Had my first lesson at 12 midday returning at 5 p.m. to watch another class which however did not eventuate. Turned down an invitation to an evening as did not feel up to it. On way home decided to see \"Twelfth Night\" or What You Will at the Royal Covent Garden theatre so got out at Sloane Square & had dinner. Enjoyed the comedy very much indeed & would like to see it again.\n\nCollected my pay book from Horseferry Road it having been audited & found that I was overdrawn a few pounds & and that they had charged me 6\/- for my fare from London to Folkstone last December when I took the ordinary leave pass-ticket.\n","19":" Cold a little better went to dancing class at 11 and then to S.M. & Co. for mail and another fiver. Arranged to have lunch with Mr. Thoroughgood & Brown the following Thursday. Had lunch at the Aldwych & then went to the West End cinema chiefly to see a C.C. picture \" Shoulder Arms\" very funny. Had a look over the Guild Hall as previously I had missed it, very little open to the public owing to the war. Had dinner at Lyons in Coventry Street, a fashionable cheap place, having a good dinner for","20":" with the music from a Jazz band thrown in, my first experience of one & judge it to be catching on for the new dances only.\n\nAt 8 went to Earls Court for a dance & spent a wonderful evening. Managed to get on well with the new dances & had some splendid waltzes, one steps, foxtrots & waltzes being the programme. Finished at 11 p.m.\n","21":" Had my last dancing class at 11 a.m. then returned to town having lunched at Lyons Coventry St. Went to Brixton to see F. Gissing in the afternoon & at night the Pantomine \"Babes in the Wood\" at Drury Lane with D.W.A. Very fine with a splendid \"Peace Pageant \". A fine old theatre with tremendous stage.\n","22":" Up late feeling very much worse with my cold. Had lunch & breakfast combined & made a few purchase before returning to Hotel & packing my things ready to go to Glasgow. Went out to Earls Court for a dance 4 till 7 & had a good time finishing up with dinner\n\nwith aunt &: D.W.A. next catching train at Euston for Glasgow at 11.30. Carriage not crowded so had a good sleep going up.\n","23":" Reached Glasgow about 10 am & received the usual welcome from the Harper family, it was like getting home. Spent the day indoors & yarning with friends at night.\n","24":" Weather fine but cold. A long walk with Mr. Harper in morning & pictures with Elsie during afternoon. Had trouble getting in people being simply mad on pictures up this way.\n","25":" Foggy and cold. Visited the city in afternoon with Elsie and bought a couple of things for home also chose a book thy wanted to give me for a gift. Afternoon tea at Craig’s and then home. In the evening\n\nhad a gathering of friends & had a real good evening with dancing etc. which found me trying to demonstrate some new steps.\n","26":" Had a quiet day remaining by the fireside the whole time. Cold and wet. Telegraphed for an extension of 4 days & received answer same day granting 2 so will remain here until Friday evening.\n","27":" Remained in all the morning, foggy and wet. Afternoon cleared up & went for a walk to Rooken Glenn, a fine Park a few miles out of the city. Went to Mrs. Hunters at Newlands for the evening & had a real good time, feeling at home all the time.\n","28":" A cold day and snowing so stayed at home by the fire. My cold much better. Caught the 8.45 train to London being farewelled by Elsie A. Meg K. & Mr. & Mrs. Hunter. Collected some Chaste Salutes\n\non my departure also a book of Emersons essays from Elsie & Omar Khayyam from Sophie. Very sorry to say goodbye as my various spells in Glasgow have been particularised by perfect contentment.\n","29":" Reached London about 7 A.M. after a fair night in the train. Went along to the Bonnington where I had breakfast & a clean up then set to & completed a very busy programme. First to Lewis’s in Gower Street to buy some medical books, then to S.M. & Co. to collect another fiver & pack up my belongings I which them to ship for me. Said goodbye to Mr. Thoroughgood & then bussed to Brixton where I purchased a pair of rubber shoes 8\/11 for shipboard use, also collected my watch which was being repaired ,10\/-, & finished up at F.S. Gissing where I had lunch & left at 3 oclock after saying goodbye. Back to Hotel then to Earls Court for a dance with D.W.A. very enjoyable. Dinner at Longridge Road, then to Pictures\n\nat Kensington, pleased to see one of Melbournes beauties.\n","30":" My last day in London. Left hotel about midday and went to Earls Court for dinner after which strolled through Kensington Gardens & Hyde Park having tea at the Corner House. Said goodbye to D.W.A. & went to Waterloo where I caught the train to Dinton, walking from there to Fovant. Arrived about 11 p.m..\n","31":" Found the camp much as I had left it very few having gone away. Idled the day away and went to the pictures at night.\n","32":" Nothing doing all day. Went to a lecture at the Y.M. at night on Alsace Lorraine, part was OK but the usual trash about Nurse Cavell etc. spoilt it. \n","33":" A cold change. A stroll during the morning and by the fire during the afternoon passed the day. Reading and playing Quoits the medicine. Concert at night by the Attractives quite a good show.\n","34":" A beautiful day the sun shining as a promise of spring. Already the bushes are budding & the country seems ready to welcome the great awakening. A walk of about 6 miles with morning tea filled the morning & in the afternoon 5 of us took a car to Salisbury, 10 miles away £1 each way. Arrived there we visited the Cathedral first very fine & much brighter inside than most. Dates from 1220 being 473 ft. in length & constructed on the plan of a double cross. The spire, the tallest in England is especially beautiful & graceful, said to be the most beautiful in the world. The number of windows is said to be equal to the number of days in the year, the pillars the hours, and the doorways the months. Took a few snaps but the weather dull. Had dinner at the Red Lion & there learnt of a dance at Hales Hall so completed the day with a most enjoyable evening. Practically everyone I met was a good dancer. Took car about 11.30 & was home by midnight. Salisbury a typical old country town enlivened by the presence of the soldiers.\n\n \n","35":" A short walk this morning it being a beautiful day. After dinner witnessed some boxing, a 6 round no decision lightweight, a 3 round heavy weight, a real good scrap then a spar. At 4.20 two of us went by train to Wilton for a dance. Had tea there and a real good night most of the girls being first rate dancers. Arrived back by car about 1 a.m.\n","36":" A quiet day. Went to the pictures at night.\n","37":" Have been put on a boat roll, a Castle line ship, due to leave almost at once. Walked to Dinton & went to Church, a real old fashioned minister, years behind the times, a fact reflected by his small congregation. At night pictures.\n","38":" Had a quiet day preparing to leave for the ship tomorrow. At night went by car to Wilton for a \n\ndance & had a real good evening, spoilt later by someone stealing my hat, a real good one I had bought myself.\n","39":" Up early & had a bath & early breakfast. At 8.30. 41 of us all told set off for London where we changed to Fenchurch St. Station. Had 3 hours in London & I bought a few things I wanted as films etc. We found our ship the Kildonan Castle at the Albert Docks & were well pleased with her appearance over 9000 tons all fitted out anew, she having been used as an auxiliary cruiser during the War. Very cold and dreary weather. No special accommodation for Sgts or W.O.’s so told the Adj. I expected something. Nothing doing as yet because we are taking passengers to Alexandria . Spent a good night on one of the hospital beds. \n","40":" During the morning we moved off through a lock into the river anchoring off Gravesend. Passed some ships which I had last seen at Lemnos notably the Aragaz a waterboat & the Manitou. At Gravesend the passengers came aboard, about 70, all for Egypt & about 10 p.m. we set off again this time for Devonport where we take on troops. During the afternoon I commenced getting up the dispensary stores from the hold, unpacking them and getting ready for work. Weather cold.\n","41":" Spent a good night & awoke to find the ship tossing a bit, some of the lads very ill. Carried on during the day arranging the dispensary having to unpack some 20 odd cases. The Embarkation officer decided that my accommodation was not sufficient so he made arrangements to build a room on the saloon deck during our stay at Plymouth. I will probably make\n\nit my home for the voyage. The weather fine & sunny but cool & during the day had a promenade up & down the deck enjoying the sight of some youngsters playing about. The passengers are a decent crowd apparently & several show signs of Cairo breeding. Will berth at Devonport by 8 A.M. tomorrow and will take on troops during the afternoon. I will go ashore during the morning and will post some letters of farewell.\n","42":" Reached Devonport during the night & berthed at naval wharf at 8.30. Saw a number of battleships such as the Warspite, submarines and Destroyers. Received orders that no one was allowed on shore whereat the passengers were very angry. About 800 troops came on during the afternoon the Sgts and W.O.s being fearfully disgusted with their quarters which are exactly the same as the mens whereas the Government pay for a second class passage. The Colonel, Adjutant & Embarkation officer came along to try & smooth things over\n\n \n\nsaying that they were very sorry that the passengers had been given the cabins but they would do all in their power to alter things. The food they promised would be of the best and every endeavour would be made to improve our lot. After an hours discussion things quietened down, but in any other circumstances than going home, the whole crowd would have left the ship. What hurt many of the Sgts was the fact that they had missed several boats being told that they were being kept until proper accommodation could be found for them. Did a little work during the afternoon many of the \n\nChaps requiring attention. 10 nursing sisters are on board and appear nice & two medical officers, the senior being a fine fellow so far. Have received a considerable mail, my letters having been forwarded on & I have been able to answer them all.\n","43":" At the wharf until 3 P.M., took on supplies, water & some timber, the latter to build a dispensary on the main deck. At 3 P.M. pulled out & started the long voyage home. Felt a\n\nwee bit excited as we were cheered out of the harbour some boy scouts giving us a particularly good round of cheers. Fairly busy during the day attending to fellows but there is no real illness. Our meals were good today and slowly served so the crowd are fairly cheerful. We have a band on board & they played Goodbyee as we left the wharf. \n","44":" Fairly busy during the day. Weather mild, sunshine, rain etc. with sea rougher toward evening. Promenading on deck the lads formed a long queue in fours & marched around & around. Two boys and a girl aged about 8 have been made mascots by the lads. The girl has W.A.A.C on her shoulders whilst the boys have battalion colours, service stripes, rank, medal ribbons etc, all over them. Many sick after tea, the ship pitching a good deal.\n","45":" Fairly calm so those sick began to pick up again. At night a singsong on deck very good, all hands\n\n \n\nnow beginning to muckup & look for amusements. Sgts mess improving. Breakfast was porridge, fish, liver & bacon. Lunch soup, fish, meat rice curry & potatoes & beans, jam roll pudding. Dinner soup, fish, roast pork & fowl & vegetables & plum pudding. There were no complaints today.\n","46":" Very rough weather during the night, the boat rolling heavily in a corkscrew fashion. At 1 A.M. I got up to see how my bottles were standing the rolls only arrived in time to save a crash. Felt very heavy all the morning & to make matters worse, a huge sea swept over the ship & flooded the dispensary besides washing a women passenger & a couple of the lads along the deck, no damage however. Took me an hour to clean up the mess & all the time I felt like getting out to walk home. Matters improved during the afternoon. About 11 A.M. we passed Cape St. Vincent close and expect to pass Gibraltar early tomorrow morning. After tea witnessed some boxing on the prom deck, both good and\n\namusing. All gambling has been stopped at least openly, the only game being allowed being \" House\". Several schools are running & all over the ship can be heard the cries, Who’ll have a card?, eyes down, Kelly’s eye, Clicketty Click, Top of the house, legs eleven etc. etc. Altho not in sight in imagination one can see a number of men gazing intently at their cards waiting for particular numbers to be called, until one calls out House & all sit up, relax & then prepare for the next round.\n","47":" A beautiful day with sea as calm as a mill pond. Passed Gibraltar during the night & this morning could see the snow clad mts of Spain. Thursdays run totalled 336 miles. Entered into a Calcutta sweep for the next days run. Tickets cost 2\/- each & each man has a distance drawn for him, the distances later being put up for auction so that a fancied number may be bought by an outsider unless the owner buys it back by bidding higher. To keep mine I had to bid 4\/-. The band played selections during the evening.\n","48":" a quiet day, nothing of interest to chronicle. Educational classes commence tomorrow on several subjects & a fine library has been opened by the Y.M.C.A. Entries are being taken for sport & a concert party has been formed & presents its first effort tonight, fair only. Have made an effort to do some study in my own line, much easier than I expected.\n","49":" 11 A.M. & I have just finished the mornings work & now sit on the poop deck aft, conscious of a perfect day with the sun shining down with a warmth not felt for months. The ship ploughs through a sea topped with \"white horses’\" which emphasizes the wonderful blueness of the Mediterranean & as the gulls circle overhead ? their plaintive cries, the faint throb of the engines & with the splash of the sea makes a music the very essence of peacefulness. The attitudes of the men reflect the peacefulness of the day. The majority perhaps are basking in the sun, some reading others yarning or sleeping. Small groups are busy with cards, whilst other larger groups are intent on games of \"House\" the monotonous voice of the caller mixing with the tap tap of a punching ball. In another place some are skipping, training for sports & from a \n\ngroup on the promenade deck can be heard sudden burst of laughter & clapping: ‘tis where men are engaging in light spars in preparation for the boxing tournaments. Sailors move about their duties in a listless manner splicing ropes or painting as the case may be whilst the passengers lounge in deck chairs in various attitudes. Perhaps the best of all to watch are the children. There are several on board and they play trains etc. by the hour, moving amongst the boys freely, getting carried pick a back for the asking. ‘Tis the home touch which makes every man cast his thoughts homeward. Passed Sicily this afternoon & apparently met a minefield as we put overboard two paravanes or minecutters, one on either side. Very interesting and procured some snaps. Band played some selections at night.\n","50":" Altho. well on the way to Port Said, I cannot yet realise that I’m homeward bound, I think it is because we are still in the war zone & and until we leave the Red Sea behind, that feeling will exist. Mileage\n\n \n\nyesterday 330 miles. Boxing championships held this afternoon & provided good sport. The ring was on the well deck aft & the spectators were perched everywhere, even up the rigging. At night there were two dances, one for officers and passengers, a fancy dress effort, & one for diggers on opposite sides of the ship, did not do much myself as being walked on in the first waltz crippled me for the evening. attended a French class & may carry on with it.\n","51":" Church Parade was held on the well deck aft this morning which gave an opportunity for a large number to be present spread over a kind of amphitheatre. Passengers as well as troops were present & there is no doubt it was a unique experience to attend a military Church Parade. A Church service at sea is always more impressive than on land & this was no exception & made me recall others of a like nature, one in particular being prior to the landing at Gallipoli. The hymn \"Eternal Father strong to Save\" a popular \n\none at sea was the favourite this morning & was sung with feeling. The Padre spoke of the duty before those returning to those who would never return in a feeling way, so much so, that a passenger wept. Developed some films during the evening the result fair. Learnt today that the Canteen takes about £80 daily which shows its necessity, it closed last night to reopen after we leave Port Said owing to the Customs regulations. With aid of a lantern we had a sing song of hymns at night. The Band played selections also & with the calm sea, bright lights and music the night had quite a carnival air about it. Atmosphere close & a large number of the men now sleep on deck.\n","52":" a quiet day on the ship. Shifted to the new dispensary on the port side of the Prom. deck this afternoon the move, complete with some extra dispensing keeping me busy all day. The Captain\n\nhas been manoeuvring about a lot today & he has reduced speed in order not to reach Port Said before the morning with what idea I don’t know unless it is to save unnecessary wharfage dues, so we expect to see Port Said early tomorrow morning. We do no yet know whether we will get ashore as it depends on the local military heads. A sing song of hymns with aid of lantern slides at night as well as selections from the band. Some pictures were shown later of our various states and towns & the Padre speaking to them rather encouraged a little barracking & it was very amusing to listen to.\n","53":" We arrived about 6 am at Port Said & all hands were up earlier than usual to see the sights. We anchored at the mouth of the canal & straightaway commenced to take on fresh water & coal. Barges came alongside on both sides & soon the Gippos were busy transferring the contents to our bunkers with extraordinary rapidity but their usual noisy babble. Owing to rioting ashore \n\nwe were not allowed off the ship but we were soon surrounded by boats ladened with silks, curios, ostrich feathers & the like & bargaining and haggling went on all day. The Gippo vendor used to ask three times the value and then work down to about half at which most of the fellows reckoned they had a bargain but these fellows are as cute as possible & know the game from A to Z. A large trade was done the lads buying some awful trash but no doubt it will please at home if only for the spirit of the present. Oranges were in great demand & were very welcome. By evening coaling was completed & a film of coal dust covered everything, then we took on frozen meat & other cargo & eventually left about 11.30 P.M. During afternoon we increased our numbers by 90, officers & nurses & convalescents, many being Light Horse looking swanky in their Kangaroo feathers. Posted some letters & post cards.\n","54":" We pulled up for a couple of hours during the early morning probably to allow \n\nanother ship to pass but after that we continued on our way without stop until we reached Suez about 3 P.M. the same day leaving again at 6 P.M. The distance is 90 miles & was a most interesting part of the trip as apart from its beauty we saw again the places we knew well from our experience of 1916. Ferry Post of course was dead likewise Serapeum as the advance into Palestine had wiped them out but I took some snaps of some permanent buildings there. I was up early being well repaid for the energy expended. Perhaps the journey through the Canal did not appeal to me as much as it might have done had I not known the canal from previous experience but yet it was rather wonderful.- The ship glides slowly through the desert apparently the only moving thing in the land. The water of the Canal is a peculiar green & as we proceed a wave on either side follows the ship & expends itself on either bank. At intervals we pass signalling stations set amongst a bunch of green trees as this land only wants water to produce vegetation & in places the lakes have \n\n \n\ndried away & have left wide sheets of salt which glisten in the sun like snow. As night approaches the sinking sun clothes the sky anew, an ever changing series of colour & when it dips behind hills, they stand out as commanding silhouettes against the sky. Finally a haze covers all, the whole giving that \"atmosphere\" felt by many- The day has been warm. The sun now shines like the good old Australian sun which warms & cheers the blood whilst the star lit sky gives promise of the warmer sky to come so different to the cold heavens of the northern land : one thing yet remains to be seen i.e. the Southern Cross, which should be seen any day now.\n","55":" Much warmer today but a cool breeze equalised matters. Have been very busy as the change has brought on a lot of minor complaints such as colds etc & altho I arranged special hours for the dispensary I find myself called in between times. My hours are 9. AM – 1030 AM, 1 P.M. – 2 P.M. 4.30 – 5.30 P.M., during which time I am besieged for physic chiefly cough\n\n \n\nmixture. The M.O.’s are first rate and we get on well together making it pleasant working.\n","56":" Hotter still but we have been saved by the awnings put up over all unprotected decks. They have made a wonderful difference and also increased the deck space which gives shelter. Another institution most popular commenced today. Two canvas baths 10’ x 8’ have been erected and are full of lovely sea water during the early morning. I now get up in the neighbourhood of 6 A.M. for a dip. The majority are now clothed in \"shorts\", in fact wear as little as possible which recalls other days we sampled snow. ‘Tis the only way to be comfortable however, it really is glorious to be reduced to something near a swimming costume and then laze about. At night they actually had a dance. The majority of the nurses took part but I found it better to watch especially as it had a humorous side. There was no special toilet, they danced in their scanty garments but the fair partners did not appear to mind. Most of them (the diggers) were bare legged, clad in shorts & singlet, tunics being\n\nimpossible owing to the heat; how the girls managed I don’t know. Distance for day 306 miles.\n","57":" Very hot and I feel very slack, my good intentions concerning study being seriously unfilled. Started the day at 5.30 A.M. by a dip which acted as a tonic for a time. Very little doing with sport but a few enthusiasts are still training & boxing, whilst a tug-of-war takes place daily between rival teams. Cricket has also broken out, stimulated by the fact that we have Macartney, one of our own leading cricketers, on board. At last the fact of nearing home has been realised. I could plainly see the Southern Cross & each succeeding night now we Should see it higher in the heavens. I never realised quite, the significance of the emblem of the Southern Seas before.\n","58":" A warm muggy day relieved towards the evening by a fresh breeze. The evening song service was dispensed with & no hymns were sung in the morning as it would have disturbed a serious pneumonia case who has been low for several days. At 7.P.M. we arrived opposite Aden, the \n\nlights looking rather pretty, so we have left the Red Sea behind. Land could be seen most of the afternoon, the sunset over the african hills being very fine.\n","59":" A hot day with little to break the monotony. Boxing contests were postponed as the patient was too ill to risk any noise. At night listened to an extremely interesting talk by Capt Bean, our war correspondent & one of the fairest & most authentic chroniclers of the war, on the Signing of the Armistice he conducted a party to the Peninsular consisting of the official photographer, officers & ORanks, both to enquire into the state of graves & clear up matters of doubt relating to the Campaign there. Turkish opinion stated that had the ships persevered in their original attack perhaps for 15 minutes longer their efforts would have been crowned with success, owing to their ammunition running out, but he left the Turkish view points as a whole until another time – They landed at Chanak which was practically burnt out by our bombs, the forts in general being little damaged by shell fire. Mine fields surrounding the old \n\nlanding places prevented a landing at Anzac but apart from that the piers & jettys had almost disappeared, but the ships sunk as breakwaters & the River Clyde were still as before. At Anzac a monument to the Turks had been erected & they had used many of the piles on our own pier to form a fence around it. The Turks had salved practically everything we had left behind but there were still some things remaining of little value such as eating utensils & a heap of jam tin bombs. The first matter attended to was that of the Graves. Reports had been received that these had been desecrated but this was found not to be generally the Case. Practically all crosses had disappeared having been used for firewood, the graves being overgrown. Some had perhaps been uprooted by Jackals whilst in other cases bodies had been disturbed for the sake of the money & valuables upon them, this latter being confined to those who had fallen in No Mans Land, it being done to friend & foe alike. The Turkish Authorities had made an attempt to preserve four of the many cemeteries, this being \n\ndone in fear of the consequences likely to ensue by the visit of a delegate from the Pope. They had fenced these cemeteries and had constructed a series of regular mounds, irrespective of how many were buried, upon which the delegate was invited to inspect the good work & take photos for publication. For some time a party of the Graves Registration Corps had been at work with wonderful results, their greatest difficulty being these places that the Turks had looked after. By records & private information available, the officer in Charge had traced the large majority although no Crosses existed, but owing to the earth being loose over a grave, the grass appeared different & a depression could be seen & thus could be found the different graves. The Australians had 8000 killed on the Peninsular 7000 being left there. Of these 5500 had been buried in Cemeteries & of these 4700 had been definitely identified. The resting place of the others was chiefly in No Mans Land & few here could be identified altho. they still remained practically where they fell. The work of decently dealing with this matter he said would\n\ntake at least 5 months & he advised strongly that no visitors should be allowed there until it was finished. Speaking of the different attacks & how they fared, how far they reached etc he stated that some men did actually go far enough to see the Narrows on the first day. The fighting on","60":" cost us dear. In one place no less than 1000 bodies were lying where they fell, a part of Kitcheners army which went astray through some reason & reached their objective after unheard of difficulty only to find the enemy ready & able to outflank them. The Turks tho. Suffered more heavily than we. In one of many Turkish Cemeteries he counted no less than 3000 graves & in one gully, in which our guns caught them assembling for an attack, lay even a larger array of bodies than the 1000 mentioned above. The trenches were practically as they were left except where we had blown them up & the Turks had removed the timber for other purposes & an interesting part of the lecture was his description of the trench system of the enemy etc, ours &\n\nin one place being only 3 ½ yds apart the top of each being protected with wire netting from bombs. The sites of famous guns, such as Beachy Bill, a costly gun for us as it dominated the beach & so on, he located, & the effect of the Naval fire, especially that of Queen Elizabeths 15\" guns were noted. Shell holes as we know them in France were unknown but one shell had made a crater nearly equal to that of a large bomb, the Naval fire had been of little value however except from a morale effect. Numerous relics were collected for the A.I.F. Museum. (Distance for day 309 miles)\n\nTuesday 8th Hot & oppressive still. Passed Socolia island during the day. At night a Fancy Dress ball was held but did not have sufficient energy or interest to take part. The costumes were very good considering the opportunities, nurses of course helping. One dressed up as a Light Horseman in shorts, service stripes covering one arm & so on; receiving a prize for the effort, there were 4 prizes in all.\n\n \n","61":" A great sameness about the days now hot weather & calm seas & the same routine of work. There still continues the same sports for those at liberty with the inclination, cricket at present holding premier position. Today the nurses from France played those from Palestine & judging by the cheering and laughter, provided amusement if nothing else. At night four boxing contests were held, after which- lecture with lantern slides was given on Lord Nelson, whilst the band rendered sweet music at the other end of the ship.\n","62":" Nothing fresh. Evening brought with it a concert by the concert party, their best effort so far but endangered by the fact of items being given which date from the Ark. Why oh why have we to suffer G. and \"Mad Karou\" from every man who wishes to entertain his comrades? Kipling I am sure never intended us to be tortured so\n","63":" The same as yesterday only more so except we did a record run of 345 miles. Boxing Contests at night.\n","64":" Listened to an oration on Palestine\n\nat night, a good subject dealt with very roughly, still the lecturer did his best and it was a buckshee show so cannot complain. Expect to reach Colombo tomorrow.\n","65":" 13thour hottest day, the perspiration simply poured from us. At 6AM we reached Colombo & a storm working up the air became cooler so we will perhaps have a decent night even if we do commence coaling. Went to Communion in the morning & had a good Song service in the evening.\n","66":" At Colombo. We commenced coaling & taking on water but at a leisurely pace so there is apparently no hurry. The whole crowd were given leave for the day, the announcement being received with loud cheers, & at 8.30 A.M. 10 large barges came alongside upon which we flocked & were slowly towed ashore. The heat was most oppressive & having our uniforms on we felt it very severely. As we walked off the Jetty we were besieged by Rickshaw men and instantly\n\n \n\n \n\ncameras came out & wrought execution, natives being eager to pose especially for backsheesh, & before many minutes the 1000 odd men had spread themselves over the city each pursuing his own particular bent. The silk & curio shops were well patronised & in the evening most of the men were ladened with some type of package. Liquor was forbidden the troops so icecreams & lemon drinks were welcomed & saved the situation. We were a party of 8 & first we went to The Bristol where we had iced lemon squash & ordered dinner for 1 P.M. after which we split up into couples. I did some shopping & then per Rickshaw had a run around, taking snaps when something interesting turned up, then some more bargaining, finishing up at the Rendezvous for dinner, where I was much incensed at being asked for payment, 3\/-, before being served. Afternoon found us buying some curios, another Rickshaw ride & a motor trip to Victoria Park & Cinnamon Gardens , a very pretty spot about 3 miles\n\n \n\n \n\nout. We included the Native Markets in our itinerary, the display of tropical fruits being very fine & there we purchased bananas, oranges & pineapples for use on the ship. Arrived back tired and hot & changed immediately into our cool clothing. Colombo is perhaps one of the most interesting of places to visit. There one sees east & west mingling yet divided, the most up to date emporiums rub shoulders with native shops which bargain as in days gone by yet preserve their native atmosphere although. their trade is done with white visitors. The passing traveller is catered for strongly & rarely does he go without making an exchange invariably to the huge profit of the barterer, Yet one is satisfied as one not only acquires a curiosity but enjoys the work of getting it. The city to the eye is wonderfully pleasing, red roofs & white walls contrast with tropical vegetation richly green & pleasing with bright blossoms. The population\n\n \n\nis scarcely less brilliant. Natives of various sects dressed in brilliant colours mingle with Europeans in latest western fashion, the Cinghalese themselves mostly in whites, their long hair neatly coiled & adorned with large combs come & go silently whilst poorer classes dressed only in a loin cloth gaze pathetically at one & beg for backsheesh or try to sell imitation jewellery. Motor Cars vie with antique wagons drawn by small hump backed bullocks for roadway whilst Rickshaws draw by scantily clad natives ( not half as grand as the Durban men) run hither & hither, ringing their bells to clear a passage. ‘Tis a memorable scene.\n","67":" Today we passed lying at anchor slowly taking on coal. No one was allowed on shore & the time was passed in various ways. Some went in swimming, it being beautiful in the water, almost too warm, & here one native had his boat capsized by a hilarious mob, whilst others gained \n\nmuch amusement by getting native lads to box one another for pennies. Slim lads with huge boxing gloves on would belabour each other with the greatest goodwill, performing extraordinary antics, making decidedly more cash than their elders who were coaling the ship. Other natives moved about selling fruit, native money & sham jewellery. Rarely does one meet one who has not some store or ornament to sell. Altogether a quiet & interesting day, but we are eager to get away. Last night a heavy shower came on & caught numbers who were sleeping out & judging by the blankets out to dry today, they were well drenched.\n","68":" Left Colombo about 8 A.M. & after being out for ½ hour discovered a nigger on board, asleep in the hold, so pulled up to place him on a catamaran which came along side in answer to our signals. His compatriots seemed loath to take him however & the nig. refused to go over the\n\nside so an attempt was made to throw him. He fought & wept bitterly & at last the attempt was given up & we turned round & returned to Colombo & placed him on the pilot boat which met us. Resumed our voyage, the incident having caused a lot of excitement & given me an opportunity to photograph a catamaran at close quarters. Sports recommenced during the day, such races as cigarette & relays taking place after which the pillow fight on a pole over the swimming bath. This caused much amusement. At night Capt Bean gave us his lecture on the Turkish version of the Peninsular fighting & it was most interesting. It was a detailed account which showed how close we were to victory several times, the excellence of the Turks as defensive fighters, their losses, much heavier than ours & several incidents which explained many doubtful points about which there was controversy on our side.\n","69":" My 31st birthday & no one knows of it here. I thought of \n\nit myself during the morning. ‘Tis the 5th spent in the army. Now approaching the equator but ‘tis no hotter than it has been during the week past. Sports still going, endurance skipping being the plum, the winner keeping up to 1226 without stopping once. At night Capt Kelly completed his lecture on Palestine, better than his last & his pictures of Biblical scenes were interesting.\n","70":" a quiet day with church services. Passed the equator about 2 A.M.\n","71":" Now filling in my spare time reading, with a game of cards occasionally. French & my books get a turn when I am feeling fit which will be more often now that we are reaching cooler climes. At night a concert was given but very ordinary. A new artist tried our patience with a long monotonous recitation which few could hear, the termination being received with vociferous applause and calls for more, which earned well merited rebuke\n\nfrom the leader of the show.\n","72":" Weather more invigorating tho’ still hot but the nights are cooler. The \"Kursk\" with munitions on board which sailed a day later than we did from England appeared on the horizon this morning & will probably pass us if our speed does not alter, the average since Colombo being about 270 per day, much to the chagrin of the lads. Heavy rain during the early morning & afternoon.\n","73":" A limerick competition on going home was decided tonight in between selections by the band & provided much amusement. There were 11 entries and the Padre read all in turn asking for a vote on the second reading everyone to call \"in\" if in favour & \"out \" if they judged against it. Over some there was no argument, the \"in or \"outs\" being very definite but others were evenly divided & then bedlam was let loose. However after 5 readings they were reduced to 2 the following was judged to be the best\n\n Said a \"dig\" to his \"bint\" in Paree\n\n Now you compree la guerre est fini\n\n I’m returning to Aussie\n\n A real dinkum possie\n\n Vouley-vous promenade ma cherie?\n\nThe \"Kursk\" has remained level all day altho’ we only ticked up 251 miles. Our notice board has the following up. Lost since leaving Colombo 50 knots per day. Finder please return to engine room. \n","74":" Finals of boxing championship held during the afternoon whilst at night pictures were shown of Australia. Sent off a radio-telegram telling them what ship I was on & probable arrival, rather a novelty & only 11d per word. Everyone is now being medically examined as regards pension rights etc. but most on board are A class. All the work connected to our discharge is being done on board. Our pay books have been checked over with records from London and within four days of our landing, these will be paid into any bank named, all money owing to us including deferred pay & the full amount of furlough \n\nallowance. Things this way are working very smoothly. Developed several films, all of which were satisfactory. \n","75":" Nothing of interest.\n","76":" Anzac Day\n\nThe fouth anniversary of the day & I had hoped to be home for it. We received a wireless from the munitioneers on the \"Kursk\" of congratulation, also one from Holman N.S.W. on behalf of the State. Concert last night but we have no interest now except to see the end of the voyage. The ship is speeding up a bit & expects to reach Fremantle on Sunday. Weather now Cool and absolutely delightful after the heat.\n","77":" A quiet day ending with a lecture on Lord Nelson. Very rough during the afternoon and a few went down to it, felt heady myself. Reach Fremantle tomorrow.\n","78":" Reached Fremantle at 3 P.M. our first sight of Aussie being taken very quietly except by the West Australians who were rather excited. We anchored between Rottnest Island & the shore the Quarantine Authorities coming aboard at once & I was pleased to get three telegrams of welcome from Sydney. The Q. Authorities were very strict, examined our records closely and they took the temperature of every soul on board finishing up at 6.30 P.M. when were informed that we were in quarantine & no one could go ashore. Everyone greatly disappointed as relatives and friends were waiting on the wharf. We commenced taking on water during the night.\n","79":" A beautiful morning but rained a little during the day. At midday the West Stralians, 150 all told, went away by barge to the Quarantine station where they have to remain for 7 days, a severe blow but necessary perhaps altho. the lads are very indignant because of our freedom from any flu on the ship. The ship besides water \n\ntook on fresh vegetables & mutton etc. the troops receiving such comforts as fruit cigarettes & papers so matters were a little brighter. One case of pneumonia and an eye case sent ashore. About 11 P.M. we resumed our voyage. \n","80":" Daylight found us travelling down the Coast with a good sea running and promise of worse to come which eventuated when we passed The Leuwin at midday, when several became casualties. Turned in early to read, it being safer in bed & spent a good night despite the fact that it was rough. At midnight was awakened by a succession of crashes, everything moveable being thrown from side to side, all kinds of articles skating on the floor whilst the mess gear made a fearful clatter preventing many from sleeping. \n","81":" Heavy swell still running & the ship rolls heavily from side to side although we ship little water.\n\nAt one time we went so far over that the bulwarks were under. Tomorrow we enter the Gt. Aust. Bight so expect the rough conditions to continue. We (Sgts & W.O.’s) were asked to sign a statement that we received a 2nd Class passage, this being done with the proviso added, that it consisted of food only, the accommodation being the ordinary troop deck. Each day now the temperature of every man on board has to be taken & they are also asked to pass through a steam chamber. At Fremantle sprays were fitted - into one of the lavatories, the steam passing through nozzles draws up a vaporiser a 2 per cent solution of Zinc Sulph. We do parties of 50 men at one time for 10 minutes, the prevention of influenza being aimed at altho. we are likely to reap several colds from it. \n\n","82":" Weather conditions improving & no longer do we have to chase our plates up & down the table. At night Capt. Bean\n\ngave a lecture on Australia, dealing mostly with its geological history, pointing out how the knowledge helps us to deal with national problems peculiar to our land.\n","83":" Nearing Adelaide and the South Australians (crow eaters) are excited accordingly. Impromptu concert at night.\n","84":" Arrived off Kangaroo island at midday, it being in sight for the remainder of the day, a long barren looking island with white cliffs in places. Arrived at Adelaide about 11 P.M. and anchored out in the bay.\n","85":" At 8 a.m. the Quarantine officer came on board and everyone had to pass before him for inspection, the said inspection consisted of walking past him with our chests bare – result satisfactory. Two Coal hulks came alongside early and we were coaling until 11 at night when we left for Melbourne. The croweaters (140) went off during the morning & rumour hath it that they were allowed\n\n \n\nto go to their homes. The Kursk is still following us & usually arrives about an hour after. \n","86":" A quiet pleasant day with everyone in the best of spirits, sunning themselves in the light of a perfect day & the prospect of an early end to the voyage. Land was in sight all day & the fine beaches looked very inviting. Started packing up surplus dispensary stores for landing at Melbourne, keeping sufficient to last the voyage. This meant a busy day as lists had to be prepared to account for everything.\n","87":" Arrived off Port Philips heads about midday & then took on the pilot thence passing through the entrance & dropping anchor at Portsea, the Quarantine Area, where we were inspected by the medical officers and allowed to proceed on our way. About 6 P.M. we anchored near Brighton with intention of going alongside by daylight. Victorians (Gumsuckers) and Tasmanians (Specks)\n\nleave us here over 500 all told so\n\nit will make a noticeable difference in our numbers. Completed my packing today and list of stores and at night did some washing which should be about the last for some time as I look forward to getting home on Saturday.\n","88":" At daylight we went alongside the new pier – (a fine affair) – at Port Melbourne. All hands had an early breakfast & the Victorians & Tassies (590) commenced to land at 8 A.M. Soon a fleet of cars & charabancs arrived and all were taken to the Barracks where relatives were in waiting. It was rather an inspiring sight, the cars were decorated and a band was playing, which gave a festive air to the scene, the old tune \"Pack up your troubles in your old kit bag\" being our welcome in. Later we took on board fresh water, potatoes, onions, vegetables, meat &: bacon & at 1 P.M. resumed our voyage to \n\n. Sydney. My cases of drugs were taken ashore and papers and cigarettes given out to the troops. Surplus Red X comforts were also distributed.\n","89":" Making good progress towards the goal of my hopes, so much so that we will arrive at midday tomorrow & disembark at 3 P.M. so that I will be in the bosom of my family very shortly. Demain der tag has been my slogan for the day and I’m looking forward to it intensely. The coast has been in sight most of the day, the calm sea & sunshine cheering us up wonderfully. Completed my packing up today and at night had a final bath & packed my kitbags so all is now ready.\n","90":" The great day broke fine & sunny and all were mildly excited at the prospect of landing. Confound der tag was the slogan. We were later than we expected but\n\nentered the heads about 2.30 having had a good view of the beaches from Cronulla up. We were soon stirred. A tug boat met us, on board of which were representatives of the Comforts funds & they wildly cheered us whilst their band played Home Sweet Home. Many a silent tear was dropped. Then as passing Ferry boats saw us they gave Cockadoodle with their sirens and the few representatives with us from other States were lavish in praise of both the harbour & our reception, nothing of which had been attempted in the other states. We dropped anchor whilst the Quarantine authorities came aboard & inspected the ship after which we proceeded up the harbour to Woolloomooloo. Ferry boats blowing their sirens as we passed. At the wharf we were met by \n\nmotor cars taken to the Anzac Buffet at the Domain where our relatives & friends were in waiting. Dad saw me first & yelled out then Dick saw me & then I was taken round to where mum was waiting all in a flutter. They were some excited. Then we went outside where Syd was watching the Car with Gwen and Joyce both of whom had grown out of all recognition. Off home next, flags being hung out in honour of my arrival & soon I was siting down in the old place just as if I had been away for a week end instead of 4 years and 88 days.\n\nSaturday 10th. Bill Drummond came out early to see me and later we went down to the Barracks where I received my discharge.\n\nIt consisted of first receiving a medical examination the result of which showed me fit, then a dental officer certified that my teeth were in good order, the next stage being when my service was checked & my pension and furlough rights made out. From there I proceeded to the Office where my discharge was written up and after which I was given my civilian clothes a poor affair, & then walked out a free man but actually in the army until 9th July on which date my furlough on full pay & 3\/- a day sustenance allowance expires. It is made up of 7","91":" days for every 6 months service abroad. I was also given a first class railway pass between Ashfield & Sydney and a pass for all tramways for the 60 days. \n\nAustralia is another name for opportunity\n\nOur whole history appears like a last effort of divine providence on behalf of the human race.\n\nEmerson \n\n"}}