{"Document Name":{"0":"Diary_0133","1":"Diary_0133","2":"Diary_0133","3":"Diary_0133","4":"Diary_0133","5":"Diary_0133","6":"Diary_0133","7":"Diary_0133","8":"Diary_0133","9":"Diary_0133","10":"Diary_0133","11":"Diary_0133","12":"Diary_0133","13":"Diary_0133","14":"Diary_0133","15":"Diary_0133","16":"Diary_0133","17":"Diary_0133","18":"Diary_0133","19":"Diary_0133","20":"Diary_0133","21":"Diary_0133","22":"Diary_0133","23":"Diary_0133","24":"Diary_0133","25":"Diary_0133","26":"Diary_0133","27":"Diary_0133","28":"Diary_0133","29":"Diary_0133","30":"Diary_0133","31":"Diary_0133","32":"Diary_0133","33":"Diary_0133","34":"Diary_0133","35":"Diary_0133","36":"Diary_0133","37":"Diary_0133","38":"Diary_0133","39":"Diary_0133","40":"Diary_0133","41":"Diary_0133","42":"Diary_0133","43":"Diary_0133","44":"Diary_0133","45":"Diary_0133","46":"Diary_0133","47":"Diary_0133","48":"Diary_0133","49":"Diary_0133","50":"Diary_0133","51":"Diary_0133","52":"Diary_0133","53":"Diary_0133","54":"Diary_0133","55":"Diary_0133","56":"Diary_0133","57":"Diary_0133","58":"Diary_0133","59":"Diary_0133","60":"Diary_0133","61":"Diary_0133","62":"Diary_0133","63":"Diary_0133","64":"Diary_0133","65":"Diary_0133","66":"Diary_0133","67":"Diary_0133","68":"Diary_0133","69":"Diary_0133","70":"Diary_0133","71":"Diary_0133","72":"Diary_0133","73":"Diary_0133","74":"Diary_0133","75":"Diary_0133","76":"Diary_0133","77":"Diary_0133","78":"Diary_0133","79":"Diary_0133","80":"Diary_0133","81":"Diary_0133","82":"Diary_0133","83":"Diary_0133","84":"Diary_0133","85":"Diary_0133","86":"Diary_0133","87":"Diary_0133","88":"Diary_0133","89":"Diary_0133","90":"Diary_0133","91":"Diary_0133","92":"Diary_0133","93":"Diary_0133","94":"Diary_0133","95":"Diary_0133","96":"Diary_0133","97":"Diary_0133","98":"Diary_0133","99":"Diary_0133","100":"Diary_0133","101":"Diary_0133","102":"Diary_0133","103":"Diary_0133","104":"Diary_0133","105":"Diary_0133","106":"Diary_0133","107":"Diary_0133","108":"Diary_0133","109":"Diary_0133","110":"Diary_0133","111":"Diary_0133","112":"Diary_0133"},"Date":{"0":"unknown","1":821.0,"2":822.0,"3":823.0,"4":824.0,"5":825.0,"6":826.0,"7":827.0,"8":828.0,"9":829.0,"10":830.0,"11":831.0,"12":832.0,"13":833.0,"14":834.0,"15":835.0,"16":836.0,"17":837.0,"18":838.0,"19":839.0,"20":840.0,"21":841.0,"22":842.0,"23":843.0,"24":844.0,"25":845.0,"26":846.0,"27":847.0,"28":848.0,"29":849.0,"30":850.0,"31":851.0,"32":852.0,"33":853.0,"34":854.0,"35":855.0,"36":856.0,"37":857.0,"38":858.0,"39":859.0,"40":860.0,"41":861.0,"42":862.0,"43":863.0,"44":864.0,"45":865.0,"46":866.0,"47":867.0,"48":868.0,"49":869.0,"50":870.0,"51":871.0,"52":872.0,"53":873.0,"54":874.0,"55":875.0,"56":876.0,"57":877.0,"58":878.0,"59":879.0,"60":880.0,"61":881.0,"62":882.0,"63":883.0,"64":884.0,"65":885.0,"66":886.0,"67":887.0,"68":888.0,"69":889.0,"70":890.0,"71":891.0,"72":892.0,"73":893.0,"74":894.0,"75":895.0,"76":896.0,"77":897.0,"78":898.0,"79":899.0,"80":900.0,"81":901.0,"82":902.0,"83":903.0,"84":904.0,"85":905.0,"86":906.0,"87":907.0,"88":908.0,"89":909.0,"90":910.0,"91":911.0,"92":912.0,"93":913.0,"94":914.0,"95":915.0,"96":916.0,"97":917.0,"98":918.0,"99":919.0,"100":920.0,"101":921.0,"102":922.0,"103":923.0,"104":924.0,"105":925.0,"106":926.0,"107":927.0,"108":930.0,"109":931.0,"110":932.0,"111":933.0,"112":934.0},"Entry":{"0":" \n\n","1":"\n\nVery hot all day – Went for a route march – across the desert a bit.\n\nWent into Cairo at night & met two fellows from Enoggera – fly flats – they were going to show us Cairo, which they did with a vengeance, we finished up lost in a blind alley & in a very poor delapidated quarter. All soldiers have to be out of Cairo by 9-15 pm – this made us late – so much so that we had to take tram out to Helliopolis & walk across the sand – got home by 10 pm.\n","2":"\n\nVery hot a dust storm all day – sand blowing about freely – very hard on the eyes. Never gave St Patricks day a thought – Have a very sore heel I strained a tendon a week ago at the Pyramids – comes against me marching\n\n17\/3\/16 Friday\n\nA Surprise Fall in about 5\/30 pm they wanted 36 AMC for somewhere – 14\/2nd L.H.F.A volunteered & hopped out to a man only to be turned down again – Very cold at night. Was Orderly Corporal first time today – got along alright – had a lot of running about & felt it with sore heel.\n","3":"\n\nAn awful dusty & windy day – very hard on the eyes – Had charge of a fatigue party at Headquarters at Helmieh – finished up at noon. Myself & the boys went to the Zoological Gardens – It was both an education & an object lesson – to see the number & variety of Birds & Animals – Giraffes – Hippotamus – Alligators – Zebras – Elephants – Snakes – Vultures – Dogs – Wolves, Foxes. There are several variety’s of Kangaroo’s & Wallaby\n\ndonated by A.I.F. Coy’s. It is really a days hard work to do this Zoo thoughly – Put in a very pleasant night at the Y.M.C.A Rooms – Had an impromptu Concert etc.\n","4":"\n\nHad the most wretched night I’ve had for a good while – often got slightly wet & had rig tents – tighten pegs of an night at Enoggera – but last night was exceptional for Cairo – It had been blowing dust & Sand all day \nyesterday\n last night about 1-30 am the rain came down – had about half an inch, it came thro our grass hut – my blankets kept it out for a while, then I tried my Coat but had to get up & walk about, when I found I was laying in water – never said anything but booked it up against the Kaiser. \n\nI went down to Mass at the Zeitouin Convent. \n\nAll L.H.F.A men had instructions not to leave camp but be ready to march out at\n\n2.30 pm – Paraded at 2-30 pm & were dismissed, but still to be readiness to march out. My old Friend Bill Bedsor came over & dug me out at 3 pm very pleased to see each other – We pushed off to Cairo – Visited Native Bazaar & several other places. Had Tea at a very flash place. After Tea Bill introduced me to some Gypo Friends. The two girls took us for a drive in their Gari all around Cairo & then to their Home at Helliopolis. They spoke very good English & rather enjoyed the evening. Got into camp rather later than regular time.\n","5":"\n\nVery cold last night – At the 6 am Parade we got orders to stand by & march out at a moments notice. 1.30 pm got marching orders to Report No. 1 Heliopolis Hospital – Only a rumour myself \n\n& 17 L H F A didn’t roar, we counted out a Lieutenant Staff Sergeant etc – One L.H.F.A Sergeant crawled out & wouldn’t come with the rest of us – I reported at the Palace & needless to add fell foul of the Warrant Officer – by parading & \nalmost\n on behalf of the Boys almost refusing duty. \n\nI was immediately reported to O C. as being insolent etc – Was ordered to be reduced with option of one stripe – I told them straight, they could have uniform etc – as myself & Boys were prepared to walk out immediately, if they would transfer us to any other Corps – nuff said We all got at it – & started to pack up No. 1 A.G.H.. – Only a rumour there is no stuff to pack – some where about 300 Tons I should say – It is a lovely building &\n\nplenty of marble etc lovely Piazzas hanging Electric lights etc.\n","6":"\n","7":"\n","8":"\n","9":"\n","10":"\n","11":"\n","12":"\n","13":"\n\nNot worth notes this week as we were all disgusted.\n\nA G H\n","14":"\n\nVery Hot – Got orders to be ready to march out at 7.30 am, needless to add, we didn’t waste any time time to get away from the wretched A.G.H – which all us L.H.F.A were very loathe to go to even on fatigue.\n\nI should say that \non one\n yesterday while loading, there was a string of motor lorry’s & A.S.C wagons, some 50\n\nin number, & from 2 to 6 horses. Two special trains were despatched to Alexandria. I fancy myself the A.G.H will be reestablished at Marseilles or South of England. We walked across the desert from Heliopolis to B Details at Zeitoiun – arrived there about 9-30 am – never done anything all day. Went to Cairo at night, had a pleasant evening – went to the Kursaal a music Hall.\n","15":"\n\nVery hot all day – Had a heavy dust or sand storm – it was very hard on the eyes. Had a Route march in forenoon to Matarich, in the evening we marched to the Sewerage Farm. Got my first line today from Frank. Went to Cairo at night, write several letters at Y.M.C.A. Today myself – L. Penfold. A. Jenkins. A. Jowett\n\nvolunteered for the 4th Division of Artillery. I am quite prepared to do my stripes etc in – the A.M.C right through is not what it is cracked up to be. For instance I’ve learn’t nothing but what I’ve taught myself – we have not to date done any decent ambulance work & there seems to be no possible of us joining our unit. I have been doing nothing but in charge of fatigue partys, so have decided after due consideration to join the artillery, where we will probably have some fixed work & probably learn a lot.\n","16":"\n\nVery cold last night – Very warm during the day. Orderly Corporal Fairly busy with parades etc. Went in to Cairo at night, saw some\n\nvery fair pictures Charley Chaplin etc.\n","17":"\n\nVery hot all day – Cleaned up the lines till 11 am. No passes granted till 3 pm. Went into Cairo & was going out to \nGizeh\n – none of the party had passes, so the picket, would not let us over the bridge, in fact we were lucky not to be detained. Went to a variety show at night – after making a good inspection of the fashionable parts of Cairo – round about “Shephard’s Continental etc.\n","18":"\n\nVery cold last night – Orderly Corporal – never said a word of course as Sunday is the best day to be on tours etc – Didn’t mind so much when news came through that general leave of all Camps was stopped till further\n\nnotice – Thousands of men leaving for unknown destinations daily, the Camps are almost deserted & Cairo is feeling the pinch – I am certain – we that is camps at Zeitoun – Helmieh expect to get marching orders any minute. \n\nHad another dose of Typhus vacceine today – arm very sore. Couldn’t get to church today.\n","19":"\n\nVery cold last night – stiff breeze blowing – All the Camp on various fatigues – I happened to be without a party, so made myself scarce all day. Leave still stopped, went to a picture show at Zeitouin at night. Had a check roll during the day.\n","20":"\n\nCold again last night – very pleasant during the day. Forenoon took a party through Matarich for a route march. Went for a route march across the desert in afternoon.\n\nAll leave stopped.\n","21":"\n\nVery nice day. Had charge of fatigue partys all day. Went to Aerodrome Camp after tea, to look for Lt Trickett, to sign some papers for me, but he had gone to Alexandria or some where. Still under orders to move out at a moments notice. Had a check roll 9-30 pm. Truth is without a doubt stranger than fiction have often heard & read accounts of body snatches & men disturbing the\n\ngraves etc but never dream’t I would be a party or a witness to such things. Nearly every tent here has a skeleton outside as an ornament or something esle & from some grave. Not far from our camp is the Cemetery of ancient Heliopolis - & the whole ground is strewn with bones & skulls, all graves are exposed & left open, some of the Australians have dug for days to be only rewarded with a skull & perhaps a few poor specimens of beads. No doubt it is on records some fellows have found valuables among the vaults. One gets that way that you think nothing of doing such things.\n","22":"\n\nRather a nice day. All leave still cancelled – Very few men left at Zeitouin – two brigades of L. Horse are to supply all the Guards picquets, I think they are going to remain here – rumour has it the 11th & 4th LH. will remain till the Anzac Police 2,000 odd being formed are trained to take over their duties. All N.C.O’s were dismissed from all parades in our section – not enough men to go around. Talk about rag time guards etc., at 7.30 pm myself 5 Corporals & 1 Sergeant 36 men called out for guards & picquet, quite a good joke here AMC Picquet.\n\nI had to report Garrison Orderly room & sign on, who to my surprise should be there as Orderly Sergeant but Billy Bedsor, soon\n\nas the picquets were placed, I doubled back and had a yarn with him.\n\nWe never even got a catch last night – saw one chap out of bounds & he was that surprised or frightened we couldn’t see his heels for dust.\n","23":"\n\nVery nice day – Fairly tired all day – had a good Camp. Went down & dug out Bill & we went to the pictures – Finished up by having cocoa & cakes in Y.M.C.A., was in the Company of several other N.C.O.’s & an Officer also the Chaplain of Y.M.C.A an argument started on religion, one sergeant boasted of no religion but argued the R.C. would do him after what he saw of the R.C. Parish on the Peninsula he said they were always foremost &\n\nshoulder to shoulder with the boys, when no other ministers of other denominations were to be seen or heard of. ?\n","24":"\n\nThe O.C. gave us a hint, that the leave embargo may be lifted, but we were all disappointed as we were all refused passes. Just tried to keep cool – have been lucky enough to get hold of a few books, to keep me from going ratty. After Tea went down to Bill Bedsors dug out & swopped yarns & memories with him till 11 pm.\n","25":"\n\nVery hot all day. Took the R.C. parade down to the Zeitouin Convent to 7.30 am mass. Put in the forenoon\n\nwith Bill Bedsor – reading “West Wind” in the afternoon. Myself & 4 others went down to Zeitouin Convent to Benediction. It was very nice – there were about 30 Soldiers – 6 Sisters French order & about 12 French people. We all sang & Sister played accompaniments of Hail Queen of Heaven, Faith of our Fathers – we also had issued to us printed forms of Tantum Ergo & others which we struggled thro. One of the features of this mornings Service was the serving by a huge B.W. Indies Nig about 14 stone weight & 6 ft 3 & as black as Kiwi. He served very nicely & so devoutly that he was an object lesson to lots of whites. He was also carrying Sergeants Stripes. After Benediction I went around to Helmieh Soldiers Club\n\nrun by some English Ladies, they have nice reading rooms & a Restaurant where refreshments can be obtained very cheaply in comparison to others – All A & B Details were inoculated today & most of us were growling at bed time about sore arms & feeling onkuss. \n","26":"\n\nWe all had a poor nights sleep Cpl O’Malley was very ill all night, I stopped up most of the night with him, also Cpl Pearce – nearly mad with neuralgia & effects of Inoculation & not having a good nights sleep myself don’t feel too good – my arm is very sore. There is no doubt that a man wants to be in good fettle to take on this military business – if for no other reason than his own health. For instance – Sick Parade at 7. am. If a man falls sick 10 minutes\n\nafter this time – you are politely told you should have attended sick parade & there is no possible of having Drs attention unless you show very serious symptom until 7 am next day – a man could peg out in his tent unknown to authoritys only for his comrades. I have seen some genuine cases of agony & they got no redress but wheather it out till next sick parade.\n\nFlies make a man say many a thing – that otherwise would remain unsaid. Things that crawl also do their utmost to make the soldiers lot an unhappy one. In charge of Q.M.S Fatigue Party.\n\nMonday\n\nVery hot & dusty – I don’t mind fighting for my country but it is a bit rough when it is forced into your mouth & down your\n\nneck. Tried hard to keep myself out of mischief all day. At night went down to Y.M.C.A wrote to May & & couple of others.\n","27":"\n\nVery hot & sand storm still going strong and I prefer not to express myself about the flies. Took the Boys out of the way on a route March thro \nMatarich\n as some new arrivals had never seen the sights – Met in the Church Sister’s Eldridge & Allworth who were on the Wondilla – had a good old chat with them & they took some snaps of us.\n\nGot a General fall in at 8 pm & were told we would probably move off at some time tomorrow for an unknown destination. Most of the Boys are stoney broke & we have been disappointed\n\nover & over again at not being paid, we were told could get it today & were disappointed – the whole of A & B Details – Artillery. A.S.C etc are growling at no leave – no pay – bad tucker & short rations – about 9 pm they wrecked the wet Canteen & helped themselves to Tobacco & shicker. Chaos reigned supreme – Officers were useless – at last a strong guard were called out & kept the Boys in order – several free fights etc. The Officers got some plain talk, such as why the A.B.C. don’t you give us some pay – tucker or leave.\n","28":"\n\nRevallie went at about 3 am Had to tumble out – drop Tents,\n\npack Kits – leave ground clear of debris, it is a sin to see what we have to burn as it is too much to carry, only allowed issue. Yesterday it was very funny – as the lads are stoney, they were auctioning things to the highest bidder – Boots, Hats – Curious, Keepsakes, etc. I was orderly Corporal & needless to add I wasn’t an important person, only wanted at once in about six places. Had breakfast or rather Bully Beef & Biscuits & Tea at 6 am. \n\nHas the Camp as clean as a new Pin – all rubbish burnt, all Kits, tents, etc, packed ready for A.S.C Waggons, we moved off at 8.30 am with water bottles filled – sea Kits & Blankets, no rations issued. Marched to Zeitouin siding where a very cheap looking train was waiting\n\nconsisting of 40 odd open trucks of all descriptions, into which 40 men were lined up, also had a truck of prisoners, we sat in trucks in the boiling sun to say nothing of flies till 11 am, then found out we were going to Telekebar. We passed a place called Abu Zabul, where there is a very important Wireless station, also nearby is a Quarry, where there are hundreds of unfortunate Gypos & Arabs working in chains – this seems to be the principal Gaol. I lost my Cap in transit – Arrived at Telekebar about 2 pm – got some cheese – Beef & Bread at 5 pm – some Tea an hour later as the water is bad – This Camp is a huge one – were allotted to Tents – met a lot of lads I knew – We are nearly all sick & depressed, put it down to effects of Inoculation & of course were glad to try & get to sleep.\n","29":"\n\nA charming day – eh – About 9 pm last night up comes a sand storm with about 10 drops of rain – I got up twice & drove in pegs & tightened the ropes to keep the tent over us – Had about 2 hours sleep.\n\nI will not try to describe a desert sand storm – but the usual willy Willy’s & clouds of dust that generally precede an Australian storm are only a hint in proportion – Blowing all day you can’t see more than 50 yards, excepting for necessary fatigue partys, we couldn’t do anything – I got a dozen volunteers & went over & got 13 bags of mail so hope to get some. The rest of the day confined to tents, with flaps all weighted down to try & keep the sand & dust out. My eyes are just raw & do not feel too good from Inoculation. The water is condemned & are on ¾ of a pint of tea at meal times only. The Boys\n\nunanamously agree with me that Hell must be only about half a mile from the turn off to here.\n","30":"\n\nVery cold early morning – Had about 10 more drops of rain – the dust appears to be laid a bit, but still blowing sand.\n\nFatigue partys going all day, trying to square things up sanitary & otherwise. There are very few Horses here, any transporting to be done has to be done by ourselves. About 20 men get fastened to a wagon & pull to its destination. A lot of Tents – Huts & Native Villages are levelled to the ground after the storm.\n\nSaturday\n\nVery cold all night – rather a cool day. I was Orderly Corporal & as the Summer Routine Orders are out today for first time, so it fell to Sergt McDonald & I to get all\n\nfirst days abuse. The Guard called us at 4-30 am, so Mac & I had to get busy & get them out at 5 am – Only Whistles are to be blown as Reveilles, the bugles are cut out, it is a lot harder to get the men on parade. Very busy all day – men coming in – men to be paraded, Fatigue partys wanted everywhere in short everybody wanted Orderly Corporal up till 9 pm. The Boys got an issue of Tobacco, it has saved them from going on strike as most of them are stoney & no sign of any pay. A Details broke into the Canteen last night & played up generally.\n\nThere came in to B. Details today about 100 Flying Corps, they want to come under us Details - but our lot do not wish to own them, they are a flash lot – nearly everyone carrying stars or stripes – we christened them the Stars & Stripes – They actually brought a Piano & a Band, they have about 12 Motor Cycles & at least 30 Officers.\n\nOur Kits only came to hand today & about 6 Kits have been cut & anything decent or valuable taken out, the guards caught one man in the act, so we hope they give him 5 years. One of my boys L Penfold lost everything, & they must have changed & left him the dirty change, but they were careful not to leave any names.\n\n16\/ Sunday\n\nVery hot – nice & cool after sundown. Went about 2 miles across the Camp to Church at 7-30 am. The C.E parade was a fine spectacle – About 3,000 men & perhaps 150 Officers were arranged up in a square, the Minister in the middle, together with the Band. Had charge of a Guard all day – just posted them & gave them their shifts & M.Oed. Went over to the 14\/2nd L. Horse Camp, but Lt. Trickett was out, it is about 2 miles away – alongside are the Indian Lancers. They are very knatty & very clean – they kill their own meat, they have a lot of Goats yarded up in a barricade to be killed. One thing\n\nvery noticeable about their horses is that they are very light in proportion, to the Australian L. Horse, they have all come from Australia, they are what we would call light Buggy or Sulky horses, of course they haven’t much to carry as the average Indian I think runs from 9 stone to 10 stone. Some of the Boys went across to A. Stationary Hospital & got a lot of mail & papers, some of the Boys L.H.F.A. got a dozen letters, needless to add my luck was out. From these letters we learn that the \nWondilla\n & Itonus were supposed to be sunk , 4 days out from W. Australia – Also that the papers contradicted it – Also of D. Bowmans decease. Went over to A.S.H. Camp & saw Sergt Gray, F. & N. Hill & other Boys of the","31":" of the 1st. – Fred was busy cooking. A lot of Motor A.S.C. marched out our S.M. Turley also left with them, needless to add we were sorry to lose him. Made a fire about 9.15 pm & made some Tea. Green tea of course – it was jolly good - & made me think of Maud & Mrs. Single, who used to always give me green tea. The Flies nearly drive one mad.\n","32":"\n\nSergt McDonald promoted to S.M. very popular move. From an A.M.C. mans point of view this camp from a Sanitary point of view is disgraceful & reflects greatly on the Heads & more especially the Medical Men. \n\nThe authoritys do not hesitate to inoculate us against all epidemics etc & yet they cater for disease by ignoring sanitary arrangements & endeavouring to keep down \nto keep down\n the cursed flies. It is all the more serious since the Medical Men think that every fellow that parades sick is a malingerer – they are now putting into to force this fact – Fit A Class, be ready to move off to the front. Class B fit to be Classified. Class – C unfit – go back to Australia: means Fit or Unfit.\n","33":"\n\nVery Hot – Corporal of a Picquet all day. Went over to 14\/2nd L.H. & paraded myself to Lt. Tricket, stated my\nself\n case to him\n\n& asked his assistance to get me into his unit or Artillery – He said he has no authority whatever as he is bullied himself asked him about my corporals pay, etc – says I will have consider myself on backsheesh from day of landing & lucky if I get any extra duty – he said out of his 600 men they are only paying 3 Sargents, balance had to go into ranks as private – Advised me to keep up stripes & act & my turn might come so I have decided to do so while in details. I was offered a good job by Sergt Major McDonald, a Dresser for No 2 Australian Stationary Hos. but no good to this chicken – put on two friends.\n","34":"\n\nDusty – but rather cool. Corporal of a picquet all day. Read a lot all day. Wrote a few letters at night. The Orderly Corporal today instead of having his sick parade at Dispensary at at 5.30 am, was a bit late & the Medical Officer point blank refused to see some 50 men, who were sick, that meant they can get no redress till 5.30 am next day.\n\nThis is only one instance of M.O. indifference or callousness.\n","35":"\n\nVery cold last night – Very fair day.\n\nCorporal of a Picquet all day. Rumours that there is heavy fighting on the Canal. A lot of men are moving off. We heard that owing to the delay in leaving Zeitoun Camp – my name was called at Telekebar for Artillery & not being there to answer it was crossed out. Needless to say I am very disappointed. This is a very large Camp. I think I would be right in saying it is 5 miles long – so it is hard to imagine unless you see it what numbers of men are in Calico City – They style this Camp third line of Defence – Rumours of a lot of casualtys amongst Australians in France – also that no more transfers from A.M.C will be considered. \n\nThe Flying Squadron alongside us – condescended to give us an evenings music on the Band, we all appreciated & broke the monotony. \n","36":"\n\nVery cold last night. Pay day – as it was a £2 pay the lads consider themselves well off – Attended a lecture at Y.M.C.A at night on Discipline etc. At 6 pm we got marching orders to march over to No. 1 A.S. Hospital – which is only a couple of camps away – Camped their overnight – Orders to move at in the morning to some unknown destination.\n","37":"\n\nGood Friday - & well myself & 150 A.M.C. men that moved out from Telekebar will remember it. At 9.30 am after a severe medical examination, we boarded a Hospital-train which runs along the Canal daily – Our destination was Ishmailia – here we got out & had to carry our home or anything we wanted with us, that is blankets – etc, – 48 hours rations, water, etc, it was beastly hot & talk about dust. We marched from Ismailia to Ferry Post – crossing the Suez Canal by hand Ferry, we arrived at our destination\n\nabout 4 pm – completely knocked out. Several of the Boys threw away their Kits, but they are the sort who pinch their comrades stuff when they require it. After fixing up tents, we considered ourselves free & as it was just on dark, a lot of us when down & had a good old swim in the Canal – it is about a couple of hundred yards wide where we went & very deep – it is the \nonly\n best swim I’ve had since I left Bundaberg & of course I was in my glory. Almost immediately one fellow got into trouble & we got him ashore safely after a lot of trouble.\n\nSeveral large Boats passed. Ismailia is a very pretty Town & quite refreshing to see the quantity of trees & the fine avenues & parks, it is built on one of the many Lakes of the Canal. In the lake there are several Monitors & Cruisers. It is marvellous the amount of shipping that goes thro the Canal daily. We are now Camped on the Arabian side of the Canal & in the first line of defence – It is a very large Camp & all units are armed to the teeth. The Allies outposts are out about 10 miles & it is reported\n\nthe enemy outposts, were engaged here a few days ago, with only a few casualtys to our men. Here we have anti Air Craft Guns constantly on the lookout & well manned. The Water is turned on at fixed hours & then there is rush, as a man is allowed a water bottle ful per day to drink – clean dishes – Teeth etc. Without a bit of exaggeration you can see daily a string of men ¼ of mile long waiting for the Bar & the Canteen to open. There is no hope of us getting into L.H.F.A., so we expect to be pushed into Field Ambulance Units. This place is all entrenched – wire entanglements etc. It is near where the Turks tried to rush the Canal after carrying galvanized iron boats across the Desert, these boats were riddled with shot & are now to be seen in Cairo at the Zoological Gardens. The sand here is very fine & white, so it is not too pleasant with the wind & traffic. \n\nI brought a Billy Can from Telekebar & of course they all said I was balmy, an old dog for a hard road, all our Tent had cocoa & Biscuits before going to bed, then they appreciated the Billy.\n","38":"\n\nReveille at 5. am – Bagpipes & Band. General swimming parade at 6.15 am, I can say I have a record now that is to say I have swam from Arabia to Egypt. Very hot all day. I can see all the N.C.O.s being cut out of their stripes as I heard they have sufficient N.C.O.s in Camp already for 2 Divisions.\n\nAbout 10 days ago General Irvine with 3,000 men set out across the Desert from Telekebar to here Ferry’s Port – needless to say he was on Horseback – enough to say 400 men, marched in here, 21 died – 1 Lieutenant shot himself & the General is reported under arrest. By the aid of aeroplanes – the stragglers were located & it is on record that the New Zealanders done good work here in rescuing & suppling water.\n\nAbout 8.30 am there was a general alarm, anti air Guns were regulated – Artillery men stood to their posts – Men grabbed their rifles & awaited further orders, we couldn’t see any sign of the hostile ships with the naked eye & nothing eventuated, they say it is of common occurence\n\nfor hostile ships to fly over, a lot of our own are continually flying over. A.M.C. men \n\ndoing some jobs about the Camp all day – About a dozen of us went for a swim after tea – this is the only chance one has of a wash. About 5.30 pm there was another Aeroplane alarm – every body rushed to their post – the Mechanics – run out with Telephone wires & attached to main Wires to advise etc – nothing eventuated – quite cold at night.\n\n23\/4\/16 Sunday\n\nVery hot – On fatigue work all day. Never got a chance to attend Church parade.\n\nIt takes our 2\/- a day to keep up a decent supply of tucker – We had a good Easter Sunday dinner – Tinned Meat. Pineapples – Cherries – biscuits etc.\n\n14th Reinforcements of","39":" L.H.F.A are cut right out & belong to nobody now. I had to pull down my stripes they offered me acting, but I told them I have done too much already for nothing. The Prince of Wales was ¼ of a mile from here yesterday. Had a good swim after tea.\n\nBattle of Telekebar\n\nOriginal trenches still to be seen at Telekebar\n\nThe English history in connection with Egypt really started in 1881 – When Mahommed Ali started his reign of extravagance – the National debt of Egypt at the time amounting to about £3,000 000 – but this was soon increased as Ali thought it was such a simple & convenient way to borrow large sums & just pay small sums of interest annually for such – he thought nothing of building Mosque’s – Palaces etc. On one occasion a Princess advised him she intended to visit Egypt & would like to visit the Pyramids, Ali set about & built a beautiful road from Gezirch Palace to the Pyramids in 3 days by forced labour – when the National debt got to 93 millions England thought it was time she looked to some securitys – together with other little facts such as Consuls & other Officials who used to generally die of Appolexy, together with rebellions & massacres. An English party came to Alexandria but were not strong\n\nenough to land, so they awaited R’efts. They went down the Canal as far as the Lakes at Ismailia & landed, they marched as far as Carsisia & bivouacked – Sir Garnet Wolsely here decided that to be successful, an attack would have to be by surprise & at night, they arrived at the enemy outposts at about 3 am (1) luckily the sentrys were asleep & the English passed within a few hundred yards of them marked un knowingly & instead of attacking as expected that is to outflank at end of trench X 80 miles along, Wolsely delivered a sharp sudden attack at 2-3-4 & demoralized them – breaking them up in great confusion – Mahommed Ali & his Generals hearing the firing etc immediately bolted from headquarters (5) they took train to Cairo along line Railway (6). By means of a forced march by Indian Lancers they reached & demanded the surrender of 10,000 men at Zag a Zig, another lot of 250 British went on demanded the surrender of 2,500 troops at Abyssia – General Watson with a small party went around about way to the Citadel & demanded the Keys of the fort – The Egyptian Officer wanted a medal for doing them this great service. They had Cairo surrendered 36 hrs after the Battle\n","40":"\n\nWent for a swim at 6.15 am. Great consternation in Camp Sergt Nicoll & 5 other Sergts had to revert to the ranks as privates – also C’pls Clare registered Anzac 4\/4\/1914, also C’pls O’Malley, Faulkner, Farmsworth, Edwards, Wardrope & others – it seems to be a general order & that they do not want efficient N.C.O. We are now bullied & paraded by three Lance Jacks – 1 Colonel – 1 Major 3 Captains.\n\nHad some stiff drill on the land all day – Had a good swim after Tea.\n\n25\/4\/16 Tuesday “Anzac Day”\n\nAnzac Day. Excepting Fatigue partys all hands were free. Father King held a Requiem Mass not far from our Camp on the open desert. He gave one of the finest addresses have ever listened to, he reminded me of Father Byrne. In short he said our Boys had done the impossible & we were here to follow their standard. I and two other boys were lucky enough to get passes to go & get mail at Telekebar, the others went, but I stayed in Ismailia all day the other boys got letters, I got a p.c. from\n\nTom O’Hagan telling me he was in Abyssia Hospital & had been ailing since December.\n\nI put a very nice day in Ismailia, wrote a lot of letters & sent Eileen some things from (Dayanam Brothers – Merchants Ismailia). They are very particular about passes, I was stopped about a dozen times – more especially at the ferry. Got home about 9 pm. Saw a lot of Turkish prisoners also wounded going through to Cairo from the engagement not far from here 22nd 23rd 24th.\n\nThe Tommies are not held in confidence by the Australians here \ngenerally\n & there is not the best of good feeling – rumour has it that only for the Australians the other day the Tommies would have been cut off – In Ismailia today an Australian had a few \nlaagers\n in him & indulged in a bit of horse play. The M-P’s ex London Police, Cold footers – took to them & got a hiding result – they went back, called out all the whole of MPs in Barracks armed to the teeth. If there had been a few more Australians I’m sure there would have been a battle royal.\n","41":"\n\nAbsolutely the hottest I’ve ever experienced, majority say Temperature was \n115\n in the shade.\n\nOne could hardly stay in the tent. The dust, sand & heat was very hard on my eyes, so I am now wearing goggles & find much relieved – Drilling all day on the sand, we were quite busy all day at times bringing in fellows sunstroke etc from the Division we are at present with. There is a general activity here, all units going their hardest. Artillery firing all day. Infantry rifle firing bomb throwing & trench digging – Bayonet practising etc.","42":" F. Ambulance getting everything ready. \n\nBrigadier McKay – Prince of Wales & Staff are buzzing about every day – all these things tell me that they expect the Turks here any day. We have also been warned against hostile airships.\n\nWe all had to do a perish for water to day, got some water about 8.30 pm – only about 2,000 men waiting. Had two good swims.\n","43":"\n\nHad a swimming parade at 6.15 am. Drilling on the sand all the morning. We had to get up about 5 am & roll out as an airship was located, it turned out to be one of our own, so we were quite disappointed at not having a bit of fun. Had a Kit inspection in the evening, they called in a lot of stuff & only left us with a bare change – it means we shall not have quite so much to carry. Wrote to Tom O’Hagan.\n\nCan notice the Gun Boats throwing out their search lights all around them all night.\n","44":"\n\nQuite a cool day. Had two good swims. Stretcher drill & lectures all day.\n","45":"\n\nHad two good swims – Struck tents & cleaned up the Camp – While having a swim two large boats passed thro the Canal, but women or no women on board, the lads were in stages of dress or undress, most of us swam alongside.\n","46":"\n\nHad a very fine roll up at 8\/30 am Mass on the desert. General McKay & General Godley together with the staff attended. Father King, who is attached the","47":" Division gave a very eloquent sermon, which I much enjoyed, there was a general march past after Mass. Had two good swims – Saw two fine Russian Destroyers going the Canal.\n","48":"\n\nQuite a scare of aeroplanes all day – On Guard during the 24 hours. At night it was very cold. Rumoured all thro the Camp that General Townsend has had to surrender – altho we can’t get anything Official – Artillery firing & Bomb throwing etc going on all day. The 5th Division went out on a route march & when they came in, I noticed Father King at the head of a platoon with his water bottle etc, had been doing his bit with the boys. I never see any other minister out.\n","49":"\n\nReveille 4.15 am – General route march of the whole Division for a Field day. All our fellows excepting duties had to roll out – Ambulance transports etc. I had the day off for being on Guard during the night. Had two good swims.\n","50":"\n\nVery dusty all day – Drill all the morning – we also had collection of supposed wounded, up sand hills & down the banks of the Canal – In the evening we had a medical inspection – one man was put out. They also made enquiries about our gear & the Major said he wanted us to be uniformly dressed as we would be criticised in France. All our Ambulance transport horses were commandeered by the Artillery & today we got in a draft of raw mules, talking about fun on the Bristol – any man could pick one & do his worst. I never laughed so much for a long time.\n","51":"\n\nVery hot – Drilling on the Desert all the day. All the Division busy at their special work.\n","52":"\n\nVery hot. Went for a march across the desert – some 6 miles & drilled a good deal – Late in the evening we were all busy preparing & cleaning gear etc for tomorrow which is to be a Review & Divisional day. We got in six wounded men from the Canal trenches, from accidental bombs exploding – one fellow had his foot blown nearly off. Also passed thro to Clearing Hospital several wounded men & Officers from Rail Head, where they had another engagement with Turks yesterday.\n","53":"\n\nReveille at 3.45 pm – had breakfast & had to fall in 5 pm in full marching order. Went with the 5th Division out to the 7 mile Post near Rail Head & there had a Review \nday\n & Field manovers. Everything went off without a hitch & all the\n\nunits were congratulated in having carried out its work successfully – we were supposed to have done our part very quickly & got credit accordingly. It was awfully hot – tearing about in the desert with stretchers – we also had the Camels out with \nstretchers\n catalecs attached. Got back to Camp about 12 noon & had a good old swim. The whole thing was an eye opener to me to see two \nDivisions\n complete – it was just men – men horses & men everywhere – I daresay there must have been some 38,000 men mustered.\n","54":"\n\nTerribly hot day, hardly a breeze. I went off to first Mass & Communion – got back in here to bolt a piece of bread & just fall in for General Church parade – so I had to go to 8.30 Mass again. Were busy all day with men or malingerers going before the Medical board – most of them were ordered back to their units. I don’t know what my tent mates were drinking all day but about 11 pm we were rudely awakened by one who insisted the place was on fire – we had just got to\n\nsleep again, when a fellow named \nBretherton\n next went clean mad & took a fit, nearly everybody got for their naturals away from him, by main force we got him down to the Hospital, now find it is a case of cold feet – he has worked himself up to this.\n","55":"\n\nVery hot – Drilling from 6.15 am to 10.15, then had a swim. None of the Boys like the new regulations as we often have to be on Parade, full marching order at 5.30 am on a very slender Breakfast. \n\nThe 29th Brigade left at daylight for the trenches, some of us fellows will have to go out as Ambulance to them. Brought in a fellow out of the Division with 3 toes chopped off accidentally with an axe.\n\nWhile down at the Canal saw 2 Large Passenger Boats going thro, – one was an American & on the side she had painted the full width U.S.A. we all threw off & asked if she was carrying another note. They both had a lot of women passengers on & we were in all sorts of dress & undress, it was quite refreshing to see some of our white girls & children, there must have been some Australians on board as they gave us a \nCooee\n & needless to say they got a good one in return.\n","56":"\n\nSome hot all day. On Guard from 3 pm to 6 pm & from 3 am to 6 am – nothing eventuated all day – The Gunboats on the Lake throwing their searchlights till daylight.\n","57":"\n\nHad the day off – but all leave was stopped couldn’t leave the Camp – Got a letter from Bill Bedsor, said he was at Telekebar Camp & didn’t like it after Cairo. All the Boys were issued with shorts – helmets – puttees – so as to be all uniformly dressed – as I have been wearing puttees & shorts for some time & I am as brown as a berry. All sorts of rumours going around, as to moving off & yet there are other rumours that 30,000 Turks are near our outposts looking for \nus\n – As far as the 15th F.A. are concerned, we have now all hands well trained & equipped to move off at an hours notice – also have rigged 5 – E.P. Tents for any casualtys & the transport is also 18 Carat – also 20 Camels with ambulance stretchers attached.\n\nFather King said Rosary for about 50 Boys out of the 5th Division.\n","58":"\n\nDrilling & Tent Pitching practice from 6 am till 10 am – Then had a bonsur swim, I swim across the channel twice each time I go down just for practice – Major Moseley said that as we worked so well in the morning, we could have the rest of the day off – A Big Australian Mail is supposed to be in & we are all roaring at the way the Postal arrangements are run, some of us intend parading – some of the Boys have not had any mail for six months. A Postal Corps was sent from Australia to run things properly, but all they seem to do is play tennis with the Gypo’s & amuse themselves generally – The Anti Air Gun Corps have left for Rail head. Still have rumours of going to Mesopotamia – France – Tripoli -\n","59":"\n\nAt 11.45 pm last night we got a general surprise alarm & every Tom, Dick & Harry had to be ready to march out at 12.30 am, we got a pint of tea & a biscuit to eat. We that is about two Brigades set out in the pale moonlight for\n\nRail head, we had to march in the sand & it was a crime to either talk – make a noise or smoke, it was terribly heavy walking, it reminded me of \nthe Song\n Deathless army – (Solemnly & silently through the night etc.)\n\nWe kept in touch with our Brigade by communication wires – we arrived at the desired Point at about 3.45 am & waited for daylight. Everybody seemed to be on pins & needles, & when daylight dawned we were all disappointed the blokes that were supposed to be looking for us had not materialised, at daylight our aeroplanes then got to work & located them going northward. We started about 4.45 & got home about 7.30 am – Major Moseley said we done so well we could have the rest of the day to try & keep ourselves cool. We spent most of the day in the Canal – We brought in with the Ambulance one fellow who took a fit. this was the only casualty – excepting for sore & blistered feet – Father King said the Rosary in his little isolated tent on the desert. I helped to swell the number by attending.\n","60":"\n\nIt is a wonder there is anything of us left after the awful heat – just perspiration from daylight till sunset & the flies did not help things at all. General cleaning up of the lines. At 3.30 pm - a General parade was called for inspection by General McKay & Godley – They seemed quite satisfied & said that we were doing splendid work that is running a Field Ambulance & yet they make use of us a clearing Hospital also, also have in our charge 40 rejects for Australia – We all seem to think we will not be here long now after this inspection.\n\nI bought a pocket Kodak for 75 Piastres off a fellow in the lines, hope to get a lot of pleasure out of it, if they will allow me to keep it. Have since heard that in the coolest E.P. Tent the Thermometer registered 117.\n","61":"\n\nEverybody confined to Camp lines were not even allowed to Church. I \n\nwent to evenings devotins & Father King gave us about an hours humouros anecdotes to pass away the evening, very hot all day & dusty.\n","62":"\n\nEven hotter than Saturday – Very hot wind blowing – it was cruel drilling – I took a few Photos of the Boys in our tent, went for a swim in the moonlight – we all seem to agree that we would like to try our luck in the firing line in preference to staying another three months.\n","63":"\n\nVery hot – Drilling from 5 am till 9 am – rest of day we were trying to keep the dust out of the Tent.\n","64":"\n\n122\n degrees down in the operating E.P. Tent – I have never & hope to never again experience similiar conditions. A dust storm raging all day, you could not see 50 yards ahead & the wind was that hot it almost burnt your face. At 12.30 pm, two stretcher squads were ordered out over to the Lake trenches,\n\nabout 2 miles away across the sand, here we found 5 poor devils suffering from Sunstroke & effects of the heat, they were all unconscious – We done what we could to give them relief & brought them in two sand carts – We were just about done up ourselves – a fellow must do a job like this across the sand to really understand what a hard lot a stretcher bearers lot is. About 6.30 pm I took sick & had an awful night – had got a touch of the sun – I nearly went mad, was vomiting blood.\n","65":"\n\nA lot cooler – I felt very weak – Drilling till 9 am – Then went for a swim – The Tent next to us are always arguing with each other – they got into holts to day & one fellow had two stiches put in his eye & another was out for a long time, having been hit with a tent mallet – Charley Chaplin knock out was not in it.\n","66":"\n\nFairly hot. Not feeling too good yet. Had an easy job on Guard all day. Had a good dip at night.\n","67":"\n\nRather cool all day – at night it must have been down to \n70\n degrees – it was too big a difference & nearly all the Camps have colds. All our leather equipment was called in & \nweather\n web gear issued, also our colours, only for our crosses, it is hard to distinguish us from the Infantry – Had the day to myself.\n","68":"\n\nFirst Mass at 4.30 am – second at 5\/30 am. I went to second – Done very little all day.\n","69":" - Monday\n\nQuite a respectable day – only for the flies & dust. Went down to the Clearing Hospital & rigged up some large Tents. Had a grand swim at sunset, a large Boat passed & threw over some Cigars & plug tobacco, needless to say there was a great scramble in the water.\n","70":"\n\nA cool breeze blowing – quite cold at night. Fixing tents at Clearing Hospitals most of the day.\n","71":"\n\nA cool but dirty day – Packing up tent etc in our own lines – All camps in the 5th Division are getting ready to move, as we are all under marching orders.\n","72":"\n\nReveille at 3.30 am – General McKay held a Divisional Review at 6.30 am, everything went off well – We had to carry complete Marching Kit & the Review was held about two miles away – Got back to Camp at 9 am. \n\nAt 5.30 pm we were ordered to appear for a Review by General Officer Commanding General Murray – We put up a good show & he seemed perfectly satisfied – It was a great sight to see so many General’s, with their staff of mounted Indian Lancers – One Indian Prince is attached to the staff – I think there is no finer sight than Divisions in Review, here you see the essence of manhood, men well trained & in the pink of condition, tanned with the monotonous \n\nheat of the desert, it is a scene that brings a lump in a fellows throat to think that these fine men will never muster again in the same numbers – as no doubt this is our final Review.\n","73":"\n\nRather hot & dusty – Read out in Brigade orders, that we deserved credit for our display yesterday & the G.O.C. thanked us – On Guard all day – Another Kit inspection – All cameras have to be got rid – under severe penaltys for disobedience, as no Camera are allowed to leave Egypt.\n","74":"\n\nHad the day off for being on Guard yesterday. The Boys pulling down & packing our Marquee tents etc - We are ready to move at half an hours notice – While swimming at night two big Boats went through one was the Whitecourt & the other a French Mail Boat converted into a transport, it had a lot of Indians on, also a lot of mixed passengers aft, we were rather surprised to see women & children we had to take to the water as we were in all stages of dress, they gave a good cheer.\n","75":"\n\nWent to first Mass at 5.30 am. ","76":" 30th & 31st marched out at 3.30 am for Moaske. Three Battallions of Tommys moved in about 10 am, our fellows gave them a bit of borax, such as – Have you got a Woodbine chum – Have you got a Piastre on you Chum. Had two good swims. Sent my camera although a bit knocked about, over to Frank, somebody must have pinched all my films, only had two films to send away. It looks as tho we will not move out till the 15th Battalion are ready.\n\n29th Monday\n\nRather hot & dusty. Men moving in & Australians moving out at all hours of the night & day. Packing & cleaning up all day – A big passenger Boat passed while having a swim, they said they had come from East Africa & Kindly threw us over some lovely Navel Oranges – I managed to get one & they were just a luxury.\n","77":"\n\nHot & dusty – Marching out orders as far as we are concerned are postponed for a few days.\n","78":"\n\nHot & dusty – Had a route march & heavy drill on the desert.","79":" & 5th Artillery moved out – The Royal Sussex Reg’t moved in – one fellow gave me a badge for half a loaf of bread – We are not at all displeased at not moving – as we hope to have so much less time bivouacking at Moaska – We found a set of gloves & had some rare sport. I found a bottle branded O.O. Whiskey, but was disappointed as it was Kerosene; I made an improvised lamp out of a Fruit Tin, so we can now have a read of at night, have just found a good book “Lorna Doone”.\n\n1\/6\/16 Thursday\n\nHot & dusty – Went for a Route march of about 9 miles – Started pulling down balance of tents & packed waggons etc ready to move out at any time – Had a Bivouac for the night. We got strict orders to only take 1 Pair of underpants 2 Singlets 1 Towel 1 Holdall 1 House Wife 1 Great Coat 2 Blankets 1 Waterproof sheet 2 pairs of soxs 1 Cardigan Jacket, everything\n\nelse had to be destroyed, it hurt us all very much to part with our private stuff. I gave the Tommies such a lot of stuff, also had to let books – Curios etc go.\n","80":"\n\nReveille at 3. am. Had to have everything ready to march out 4-30 – Moved off at 4-30 behind the","81":" Brigade for Moaska, after an uneventful march arrived Moaska 7-30 am & were not sorry to drop our packs. The Camp had to be straightened up – A few tents rigged etc – will have to Bivouac preparatory to moving to Alexandria – This Camp is a little more cheerful than the last, he we are near a Rly line - & altho it is sandy where we are the monotony is broken by a few date trees etc in the distance – Good water is very limited altho we are on a sweet water Canal, it is very bad for drinking, it is full of \na\n little worms called the Nile worms, it is not advisable to even bathe in, so we will miss the salt water Canal for swimming etc. I was just wondering if owing to the recent passing of the daylight\n\nOfficers 15th F. A.\n\nLt Colonel A. Horn – Major Mosely\n\nMajor Bollin – Camp Adjutant Bullin\n\nCpt McIntosh – Capt Minty\n\nCpt Coppleson – Cpt Baird – Cpt Klose\n\nLt Dentist Foster – Lt Q.M. Kerr\n\nWarrant Officer Geo Black.\n\n(Friday)\n\nSaving Bill, probably the Calender was so upset that the Egyptian Mail wished to balance – as their Edition yesterday was dated May 33rd.\n\n3\/6\/16 Saturday\n\nReveille at 5 am. Major Moseley & 3 Doctors took us for a route march, we cursed them up hill & down dale, they took us across some awful heavy country for 3 hours or about 8 miles. six of our fellows fell out sick, we were all ringing wet with perspiration & completely knocked out after our march in yesterday – We had a swim in a little back water from the Canal, it was not too sweet, but it freshened us up.\n","82":"\n\nVery hot – about \n110\n in the coolest tent, the wind blowing about 30 miles an hour & the dust would blind you – Two fall ins – done a little fatigue & tried to keep cool the rest of the day. No church parade.\n","83":"\n\nVery hot – even \nhoter\n hotter than yesterday – hot winds & sand storm still raging – hot enough outside, but the bell tents are just like ovens – Had some heavy drill under Capt Coppleson – also some lectures & drill on loading a new style of Ambulance wagons – Went for a march over to the best water offering – which is back water from the Canal – it was a compulsory swim & all the division were there, it was a great sight & just man everywhere.\n","84":"\n\nVery hot – Sand storm not quite so wild. Went for a swim after the morning drill. Had some heavy & swift drill, our Major says he wants us to make a name for ourselves in France.\n","85":"\n\nNot so hot – but still very dusty – On Guard – We got news – that we would probably have to stay here till about the 15th inst. We got paid – but instead of getting what was due about 250 pt we only got 50 pt, they also advise that we will only draw (most probably) 1\/- per day in future – the Officers tell us that they are cut down by one third also.\n\nLast night the lads wrecked all the Canteen & went mad generally – I laughed to see them cooking their own eggs etc at the Gypo Canteen – they pinched all fancy goods – to day their was a surprise Kit inspection to try & locate some of the goods they got nothing in our lines, they were too slow.","86":"\n\nHad the day off – Rather a pleasant day. Went for a swim – while marching along we noticed a despatch rider coming along the sand at the water’s edge & next we saw that the horse had shied & both horse & rider were in deep water – Major Moseley & Capt\n\nCoppleson & 6 of us volunteers were soon on the scene, got the Tommy ashore, with all his gear, but the Horse nearly drowned himself & us too – pulled him ashore, when he stopped kicking & after about 5 minutes he came to, the Tommy hadn’t even lost his rifle, but his letters were wet, so he rode off as if nothing happened.\n\nWhile coming over the pontoon on the sweet water Canal, some of the planks upended & a Tommy Officer fell in & couldn’t swim we got him out, but he only had some baxt off in places – While swimming a lot of Gypos were selling water & rockmelons – chocolates, lemonade etc, for some unknown reason the lads rushed them & commandeered everything & when the Nigs started making a row, they run them down & threw them all in the Water.\n","87":"\n\nVery hot & dust galore – Lectures & practice lessons all day – The Officers said we could use the horses freely, as they are just jumping out of their skins – we rigged up two hurdles & were making them jump late in the\n\nevening – one horse fell & made an awful mess of a fellow.\n","88":"\n\nThe G.O.C said that while here he wished us to have as good a time as possible – in regards to leave he said our movements were too well advertised & known to the other side & it was better for us to be heros alive than dead heros in the Mederteranian. Rumoured that the Managers of “Shephard’s & Continental Hotels have been arrested as spies – A Spy was also caught today in Ismailia. Had Brigade Sports starting at 6.30 am – some of our boys scored – on the whole the records were very creditable – especially on the tucker – Have picked up several curious if not valuable stones & petrified wood, but it is out of the question for us to try & carry them around & as far as the 5th Division are concerned all outgoing mail has been stopped for the past week, so we cannot post anything till we get to the other side - Had one of the best Concerts under the circumstances I’ve ever attended at night it was given by the 15th Field Ambulance, all the other units greatly appreciated our efforts\n\nin our unit, we have a few professional singers, also a Hypnotist who in himself amused us.\n","89":"\n\nVery dusty & fairly hot – Went 6 am Mass also went to Communion – We done very little all day. Went down to the 60th Battalion lines & Father said the Rosary & gave a very interesting address on the origin of same.\n","90":"\n\nFairly warm – Lectures & Demonstrations by Drs Coppleson & MacIntosh – Kit inspection & a full marching order parade – Went down to the 60th Line & attended rosary.\n","91":"\n\nHot & heavy storm blowing. Had a course of Semaphore Signalling – The 8th Battalion moved out – Had a general medical inspection.","92":"\n\nG.O.C granted a full holiday – Most of the Division assembled & had a splendid forenoon of sport, which was both lively & very interesting. They started at 6 am, I stayed till 10 am, then it got too bally hot. I got leave\n\nto visit Ismailia & had a very pleasant evening in the shade of the gardens, quite a treat to be able to get a nice cold drink etc.\n\nBombs dropped on Serapeum Camp by enemy Aeroplanes – several West Indians injured.\n","93":"\n\nVery hot – about \n110\n - Had Kit inspection & drill etc with pack up. 8th Brigade moved out from Sundown till midnight – about 5 train loads – Last night the Tommys who are replacing us – gave us Australians a tip top farewell open air Concert, we all appreciated the great efforts they made to entertain us.\n","94":"\n\nVery Hot – Getting things ready to move out, clearing out most of the sick & wounded from our hospital Tents, have sent in a lot to Cairo Hospitals – More of the Division moved out.\n\n17\/6\/16 Saturday\n\nVery hot \n115\n - Bivouacking in the heat is cruel. Last night I never saw such heavy dew, my Blanket was ringing wet when I awoke, also my head & face. Troops moving out again after sundown.\n\nTent Mates\n\nNo. 8781 Pte L. Gurner\n\nLusmore Avenue\n\nKnightsbridge\n\nAdelaide\n\nS. Aust\n\nNo 8792 Pte H. Ramsden\n\nFire & Ambulance Station\n\nCentral Mine\n\nBroken Hill NSW\n\nNo 8856 Pte A. W. Jowett\n\nCr Jane St & Hardgraves\n\nWest End\n\nSth Brisbane\n\nQld\n\n8851 Geo. R. Faulkner Dr.\n\n15th F.A.\n\nRail Head\n\nFerry Post\n\nNo 8853 Pte A. C. Jenkins\n\nEdith St.\n\nNewtown\n\nToowoomba\n\nNo 8854 Pte. R. L. Windsor\n\nSandy Creek\n\nVia Mackay\n\nNorth Qld.\n\nAustralia\n\nNo 8855\n\nPte A. E. Powell\n\nWadhurst\n\nDublin St\n\nClayfield\n\nQueensland\n\n4344 Pte. Bowden L. T.\n\nTelegherry\n\nVia Stroud\n\nN.S.W.\n\n8852 Pte. J. L. Penfold\n\nBridge St\n\nKauge\n\nToowoomba\n\nQueensland\n","95":" \n\nwe were working \netc\n all night getting Ambulance waggons – Panniers etc away. Saw our Aeroplanes coming home last evening after successfully attacking enemy Camp & Aeroplanes. Capt Coppleson took us for a route march & swim – Hope to leave during tomorrow for Alexandria.\n","96":"\n\nOdd jobs about the Camp – not quite so hot, \n as The Camp are getting ready to mov\n\n \n\nMoved out at 9 pm for Alexandria Personally I’d prefer the firing line to doing duty here for another month, apart from the many mysterys & wonders of this land of sand – I will be extremely relieved to see nature in a different form. 19\/6\/16 Monday\n\nTravelling all night we were packed some 30 odd into open trucks & told to make ourselves as comfortable as possible – (of course we did) sleep was out of the question & were all shivering – \nafter\n it was a wonder we all have not got colds, as we were just wet through with perspiration from loading the train to get her away. We passed through some lovely country, as level as a billiard table & would grow anything – At unearthly hours such as midnight 1 & 2 am at stations where we had to pull up for water etc – the incorrigable Gypo was there, wanting to sell us (Eggs a Cook –) watermelons 4 pt – (very sweet lemonade) etc – Arrived Alexandria about 5. am, were run straight on to the \nwater\n wharf where our transport Royal George was awaiting us, after a lot of fiddling about, we got on board, moved off from the\n\nwharf & anchored, we were to move off at sundown, but the order was cancelled. roundabout us lying at anchor are 6 transports full of part of the 5th Division – 14th &","97":" F.A. are alotted to Cabins & first sitting – first Saloon Mess – so we feel like the Kaiser just it. The Tucker is a bit better & quite a change to Camp.\n\nIn the Harbour – which is a very fair one, all sorts of boats are at anchor – the fashionable P & O & White Star liners – most of them turned into troopships – also the seldom seen 4 masted Sailing boats – interned German boats – Greek boats, etc. Got up a scratch concert at night, around the Piano – no smoking or lights allowed after 6 pm or sundown – all port holes to be kept closed, it is just about one removal from hell below deck – I slept on deck.","98":"\n\nStill lying at anchor – one troopship returned to port that went out yesterday – all sorts of rumours about – awaiting strong convoys – also several other troop boats have been torpedoed – they also say there has been some trouble in the Canal & that we might have to disembark – to say the least is that something must be radically wrong\n\nas it is no small item to have so many troops laying idle here – Boat drill & physical jerks. Have to carry our life belts with us at all times. Very hot below deck, most of us running about in only shorts – no boots or shirt.\n","99":"\n\nRather hot – Yards & Yards of orders read out. Some of sneaked over the side & had a good swim – Capt Coppleson afterwards got permission for us to swim at our own risk. Capt Coppleson got up a Boxing tournament & I entered & got a man a lot heavier, he only had one hit, but it was a good un & my ribs are very painful if not broke – he threw in the Towel in the 5th as I peppered him from his chin to back of neck. There is some very hot stuff on board & I don’t think I will venture further in the tournament. The Officers arranged a Concert on Deck for us. Still lying in Harbour – all sort of rumours.\n","100":"\n\nRather a nice day – Troopships moving out from daylight – the slowest first & so on – the Royal George must be the fastest as we left last. \n\nWe have a convoy \nof\n in sight of 6 mine sweepers\n\ntwo Cruisers. On this boat, all life Boats are swung out – Two sailors independent of the Bridge are on the lookout & our own lads are also on the lookout, have a strong guard armed for any emergency’s – Every man including Officers, is fined, who does not wear his life belt at all times, even have to sit down to dinner with them on, needless to add they are uncomfortable & hot.\n\nNo lights after sundown is hard on us. The course we are taking is like this. Alexandria is a very busy port, & has large accomodation for the largest ships. The town proper is also very nice, clean & some fine Buildings – of course there is also the usual native quarters, to mar the horizon – Farewell Egypt – Finish Piastre – Finish Saida – Finish Gypo Mail – Finish Tomatoe & Eggs a Cook. Capt Coppleson very kindly consented to give any volunteers a few hints on French Language, so we hope at least to be able to find our way about, of course nobody knows our destination yet.\n","101":"\n\nHeavy wind blowing & sea very choppy, so far feel pretty good – very tired all day, slept forard last night on deck & only had a single blanket, nearly perished & had very little sleep. A lot of the boys down to it. Quite close to us is a French Destroyer & a Japanese Cruiser so we are in good company. Have on board 4 men from Warships to work the guns we carry aft\ner\n – The old Royal George is going some, but she is zig zaging a long way out of her course – we are manouevring the Islands of Crete, as it is a bit hazy, we cant see much on land. \n\nI suppose we have on Board 2,000 Troops, & General & all the Doctors of the 14 & 15th Field Ambulances. Had some lessons in French – also Boat drill – A man has got to get in position for the night before dark, or you cannot get about, it is very awkward without lights. A Boat which turned out to be tramp steamer approached too near us & was immediately challenged by our guns so they are not risking anything in this zone.\n","102":"\n\nNice day – Sea a bit choppy – Passed plenty of boats, every now & again, a man of war – cruiser – or destroyer appears from the sky line & honours us with their company. Plenty of Boat – Lectures, etc – We all appreciate the twilight, owing to no lights allowed – No sight of land all day","103":"\n\nHeavy fog \nearly\n all the morning – fog Horn constantly going – Had Mass at 6.15 by Father Kennedy. Sea very calm, passed two lots of land – probably Malta. Several large steamers passed us, one we noticed pull up as tho somebody overboard. Today we are escorted by Torpedo boat & Destroyer 69","104":"\n\nSea very calm – Rather hazy all day. In touch with islands all day – Destroyer 69 still escorting us – Good few boats in view. Finished the Sports Programme Tug of war, won by 15th Field Ambulance, also got a few wins in boxing. My rib was very sore\n\nall day. Dr Macintosh thinks he may have to still strap me – no more boxing for me for a day or two. Dr Coppleson gave us a French lesson.\n","105":"\n\nStarted to blow a hurricane about sundown last night – bitterly cold. cold & blowing a treat all day Sea very rough – waves washing the deck – our destroyer escort, at times the waves go right over her. My ribs very painful. Blew into Marseilles about 4 o’clock, it is easily the finest all around place I’ve seen to date, that is for harbour & natural scenery, also some very fine substantial buildings. Quite a treat to be greeted by our own kind, the girls & women do give us a hearty reception. Not leaving the Boat till early morning. Some of the Buildings that strike a stranger as imposing the – Cathedral La Marseille – Le Chateau d’Ii – Fort St Jean – Notre Dame de la Garde – Le Pont transbordeur.\n","106":"\n\nBreakfast on the Boat at 3-30 am – all hands off the boat by 4-15 am. Took the train from a siding near the Wharf, had all our gear on board & moved off at 8-15 am – raining a treat & fairly cold, quite a change to see mud. Strict injunction not to accept any gifts of eatables along the line, also to treat\n\nall strangers as spies, nothing to eat till \n4\n 2 pm, then iron rations, had another sort of a feed at 1 am.\n\nThe train journey from Marsailles is just magnificent nature just runs wild – The hard work of man has made it more pleasing to the eye in the shape of fine buildings & a very fine railway. – I think \nI\n one may find scenery & country to equal, but not to excel. About 1700 men on the train, so not much comfort, can just move – had about an hours sort of sleep – Cleared up towards midday. At a Village called Advancette, situated in a valley & immediately in rear is a huge straight faced mountain & on a ledge near the top are built 3 large Crucifixes & can be seen a great distance away – on another ledge I saw a Statue of the Blessed Lady.","107":" & Friday\n\nGoing some all night. My eyes are sore from trying to see too much of this lovely Southern France. Lovely roads trees planted both sides. Poplars, Plain & Fir trees. Had breakfast at 9-30 am at Nuit Sous Ravières – Dinner at Macon 2 pm – while waiting at Advancette we heard & whistle & something flew along, it was the Paris Express travelling at the rate of between 60 & 80 miles per hour. Laroche is a very important Junction & somewhere about 100 Engines\n\nNo of A\/c 69892 Com. Bank\n\nD Howes – Sandgate\n\nare in waiting – also have a lot of German & French prisoners working. It is really cruel to see the train loads of wounded coming in & their broken limbs etc. \n\nNearly every woman here is in mourning for a relative of some sort – The women here are bricks, cleaning engines, working on the railway Good sheds – Farming etc. A Good many men are allowed to return to assist harvesting – Such a treat to find everything eatable etc scrupulously sweet & clean after the cussed Gypos – Arrived at our destination about 4 pm & marched about 4 miles from the siding Thienes to the village of Steenbecque, where we are temporarily billetted in stables & barn’s – rather rough but better than roughing it in all sorts of weather. It had been raining off & on & bitterly cold – We were all knocked up after the march, after being cramped in the train for three days & nights & 10 days on the Boat. In the Village we bought some fine beer 1 per glass, as the water generally is bad. Also managed to buy some bread\n\nWater\n\nThe most useful chemicals for purifying water for soldiers in Cairo or on the field are Alum Permanganate of Potash & the acid sulphate of Soda.\n\nAlum\n 1 Teaspoonful to a bucket\n\nPermanganate of Potash\n added to water to make it pink – also has mild actions on germs – Cholera germs are most readily killed by this – Gives no taste to water – harmless though pink.\n\nAcid Sulphate of Soda – is generally supplied in tablet form that is Sulphuric Acid – sweetened with saxine & flavoured with oil of lemon – 1 Tablet to a water bottle – Thursday & Friday\n\n& had a good feed. Had a lovely rest, I was too tired to look at the Hay even – Altho we never had things fixed up till 10.30 pm, it was then just getting dark. Nearly every – Town we passed, boasts of a Cathedral & some are very imposing – I was speaking to the Catholic Priest or \nPadre\n & he said we are 12 miles from nearest point firing line Ypres the guns can distinctly be heard – dozens of aeroplanes going overhead. We were disappointed at not going thro Paris – Bologne is a huge City & overlooking the wild English Channel Also came thro Amiens, the Germans were in possession a short while back.\n","108":"\n\nVery cold last night – slept beautifully – very nice day but on the cool side – On Guard all day – C Section busy fixing up a hospital for clearing purposes only. About from 5 till 9 pm, we witnessed in the distance at Ypres – an aeroplane duel also heavy firing – went for a stroll around the Village – quite a treat to get a glass of fine beer 1 per glass – Tea – coffee – cocoa 1 , postcards 3 per dozen, the people generally are so natty & clean to a fault almost.","109":"\n\nNice cool day – Got permission to go to the Cathedral for 11 o’clock Mass. It was a very nice service & happened to be High Mass, they finished up with a procession of the \nof the\n Sacrament around the Village, they carry out Catholicity to the letter here. The Cathedral was erected 1821 & beautifully finished inside, lovely carving etc. Father speaks English very well altho the sermon was in French. In the afternoon I went for a stroll thro some of the lanes & thro the farms. The Germans were in possession of next Village Hazebruick for 3 days, the Tommys & Australians came & drove them back to Ypres, the women tell me they had all their stuff packed to clear out &\n\nthere were only 24 left in Steenbecque, rumour has it that they the Germans are killing For maiming all male children. There was incessant heavy artillery firing all last night, result – to day is we scored 3,500 prisoners, went thro by train & captured 1 Aeroplane. Our observation Baloons can be plainly seen – The balance of the 5th Division are blowing in daily – the 59th Battalion arrived today & report, many got killed fell out of the door while train was moving.\n\nMajor Mosely appeared last night late & rolled in with the men nobody knew, one fellow this morning in order to be funny, went around kicking every body telling them to get up, he gave the Major a good one, but nearly dropped when he saw who it was – Got orders that could only write 2 letters per mail & no views of France to go. I have a lot of views I will have to hang on to. I am trying to get 4 p.c. away in each letter.\n","110":"\n\nVery nice day – Lectures etc. also went for a route march – Major Mosely resigned from the","111":" – to the 14th – we naturally are very sorry to lose him – seems so funny for us to have to be in bed, by 9 pm, which is just about sundown, no lights or noise allowed Saw a lot of our airships going over to the firing line, heard the usual bombardment thro the night.\n\n4\/7\/16 Tuesday\n\nWent for a route march to Canal & saw the English Engineers with their great barges, ready for a retreat, or advance, these barges are readily turned into bridges over canals etc for heavy artillery. Had some practice at Gas Helmets. Heavy storm in the evening & violent lightning & thunder – We still get good news of our victorys – A lot of our division have moved nearer the firing line.\n","112":"\n\nDull day – Gas practice – it is very sickening under the Helmets, had \nto\n half an hours drill without taking them off. General Birdwood Inspected the different Units. He told us he has volunteered to take Lille at the point of the bayonet, if the authoritys will give him the Australians. \n\nVery severe bombarding at Ypres all last night – One cannot realize the meaning of heavy artillery – who has never seen or heard one – and such as is going on at our lines at present, is just terrifying & hot enough for any thing altho very cold.\n\nWednesday\n\nGot paid 86 Francs £3-0-11 & the boys are spending money freely in the Village – I think the business people never experienced such good business – the children nearly drive us mad for pennys – we have taught them to say Saida – & gib it Backsheesh – B-Section changed to C. Section on account of our new Major being a Junior.\n\n"}}