{"Document Name":{"0":"Diary_0483","1":"Diary_0483","2":"Diary_0483","3":"Diary_0483","4":"Diary_0483","5":"Diary_0483","6":"Diary_0483","7":"Diary_0483","8":"Diary_0483","9":"Diary_0483","10":"Diary_0483","11":"Diary_0483","12":"Diary_0483","13":"Diary_0483","14":"Diary_0483","15":"Diary_0483","16":"Diary_0483","17":"Diary_0483","18":"Diary_0483","19":"Diary_0483"},"Date":{"0":"unknown","1":937.0,"2":938.0,"3":939.0,"4":940.0,"5":941.0,"6":942.0,"7":943.0,"8":944.0,"9":945.0,"10":946.0,"11":947.0,"12":948.0,"13":949.0,"14":950.0,"15":951.0,"16":952.0,"17":953.0,"18":954.0,"19":955.0},"Entry":{"0":"\n\n","1":"\n\n - Paid the men in the morning and then all hands got busy packing up for our move. Fell in in full marching order at 1 p.m. and moved off in Brigade column of route with our transport train in rear. The men all loaded up with packs and blankets but right throughout the march they stuck it very well and only two or three fell out. It was the boast of Nos. 9 & 12 that none of them had to leave the ranks. In the other companies it was very noticeable that the \"beerheads\" fell out. \n\nThe route lay through what was easily the prettiest country we have seen since coming to France. We moved along winding roads bordered by green hedgerows or by crops of waving corn. The roads twisted in a most remarkable fashion almost doubling back on themselves at times. One minute Bailleul and the observation balloons near there were on our right and then would suddenly appear on the left or perhaps behind. The long column wound round all these curves and what was perhaps a 9 mile march became very much longer. \n\nWe passed through two or three very neat and trim little villages and then came into sight of a hill upon the top of which seemed to be a convent and a number of tents – a very pretty spot. As the march progressed many of the men showed signs of fatigue but plodded on. The hedges are a very beautiful thing in this country and are planted along the ditches which border each field and are deep dug. Thick grass grows rankly down into the water of the ditch. Between paddocks they have no fences, nor are there any along the roads, the cultivation comes right up to the road itself! There is no wandering stock but sometimes one sees a flock of sheep going along following the shepherd and his dog. The crook as a rule has an iron curved head as a good piece of wood shaped naturally in the curve is rarely encountered. The farmhouses looked neat and homely nestling among trees and crops their old thatched roofs often just being visible above some fold in the ground.\n\nStrazeele\n\n8\/7\/16\n\n Each farmhouse as a rule is closely circled by its kitchen garden and a few flowers also lend to the ornamentation of the place. On the way today we passed a good many fields of that twining wreath of the Bacchantes – hops. Well cared for and trained up their poles, these hops look very well in the sunlight. The Flemish aspect is given to the landscape by real old Dutch windmills – not very many but old ones. The farmhouses are close together because a living can be made in this fertile country off a very few acres. This population leads to a frequency of villages all local architecture being dominated by the church. Very clean places these French villages. \n\nWe reached Rouge Croix and went into billets at a fine farmhouse. An idea of the size of the barns can be gathered when it is noted that we accomodated 450 men in those here. The haymaking is now in progress and on the march we passed many workers in all sorts of quaint garbs, returning from the fields. There are plenty of estaminets hereabouts so tonight the lads will make merry with great wealth of liquid refreshment. The officers are all in a loft. Looking from the door of it a spreading vista of lovely blowing crops and lovely little farms meets the eye. The elm seems to be the principal tree. Just a little further on down this road is a small village which has a church in the centre. \n\nHeard tonight that Bird has lost his leg, poor chap. My Sergeants are a fine lot and a very happy family, Yeadon, Groves, Watkins, Nicholson, Thurlow, Glasscock, Bodinnar & Trevena. Mounted are Jock Munro & Crane and Stone is away. Went to bed early but very much to my disgust, was called by an orderly to see the C.O. at 11 p.m. Swore roundly and had just turned in again when orders for the march arrived and necessitated keeping awake. Slept in a bare floor in one blanket and got very cold by morning. Itch also very persistent about dawn and does not seem to get any better.\n\nBorre, Hazebrouck, Wallon Chapel, Ebinghem\n","2":"\n\n The country round about was very pretty – just about 3 miles away on the summit of a small hill is a monastery. We left on the march again at 10 a.m. and pushed on in column of route. It was a pleasant sunny morning with a little wind. The road ran across some high ground and about 15 miles away rising above a dark belt of timbered land were two pyramidical objects probably slag heaps of some distant mine. The dark belt of timber was just like that along the banks of the Nile and these heaps rose above it just like the Great Pyramids of Egypt. All the men commented on it. A splendid view of the whole country was obtainable from here and \"Belle Vue\" seemed a very appropriate name for an adjacent estaminet. \n\nWe used to think that landscape targets were no good and presented an artificially regular scenery. Not so, today’s trip we have passed through just exact stereotyped landscape target country. \n\nThe people hereabouts speak Flemish in much the same way as they speak Gaelic in certain parts of Scotland. French is the standard language but is much punctured with the local Flemish patois. Flemish is much used by the common folk whose conversations we cannot understand. English is also taking its place as a spoken language owing to our occupancy of the land. \n\nWe passed a \"forest\". There are no big trees in their forests as they are all kept thinner but under their splendid system of forestry saplings and young trees of medium height constitute their forests. \n\nSeveral troop trains have passed us today and we have also seen plenty of goods trains with the familiar \"Hommes 36-40 Chevaux 10\" painted on the doors of the trucks. We did today stretches of 45 minutes followed by\n\nHazebrouck & Renescure\n\n9\/7\/16\n\n 15 minute spells. At each halt the men are turned in their fours and marched right on to the edge of the road close to the ditch and arms are piled. The men then fall out through their rifles clear of the road. No man is allowed to fall out of the ranks for fatigue, illness or other reason without having a \"chit\" signed by an officer. Towards the end of the march the men were very tired and could hardly stick it out. Sawyer of No. 10 is an elderly man worn almost to a shadow and manages to keep going very well and nearly at the billets in Hazebrouck we halted for lunch for an hour the cooker had a meal of hot meat ready which was served up. \n\nJust alongside where the arms were piled was a big caterers shop. The proprietor sent out girls with big cardboard boxes of cakes which they distributed 2 to nearly every man in the battalion as souvenirs. They also brought out a bucket of a weak wine mixed with water. Went in to thank the owner for his kindness and he seemed a jolly old chap \"very pleased to have the honour\" as he said. He sat down to a glass of wine and over the bottle we drank each others healths and had a little lunch. \n\nWent through to the back and Mademoiselle came forward most obligingly to solve any difficulties. \"Cabinet monsieur? Voila m’sieur!\" There is no false modesty about these good sensible girls. The treatment we received from these people was remarkable seeing the thousands of troops that must be passing through regularly enough to render the sight of a column of soldiers no novelty. They could not do enough for us and the little children made friends with the men and sat on their knees. Perhaps we are the first Australians hereabouts. We passed through Renescure about 5 p.m. and got\n\nRenescure\n\n9\/7\/16\n\n good billets for my men except about 50 for whom the accomodation was indifferent. Where the officers are located the beds are lovely and white and the walls of fine large airy rooms are covered with framed educational, agricultural, and military certificates of what evidently is a smart family quite capable of holding its own in examinations in places as far away as Lille & Versailles. The usual souvenirs of missions, certificate of first communion and religious pictures are on the walls but there is a shortage of crucifixes. \n\nWent round the barns after tea and found a good many laid out to it and some very bad feet. All cheerful and joking though. The hardy ones went into the village and others foregathered in the farm kitchen and drank beer what time a French farm hand sang the songs of his country concluding with that song of passion the Marsellaise. A Frenchman becomes quite obsessed when singing this and starting quietly gradually works up to frenzy of patriotism spitting out the stirring words with venom. Awakened after a short doze between the sheets by orders arriving and the giggles of a M’selle and the low amorous pleadings of one of our men kept me awake still longer as a stealthy love encounter took place beneath my window.\n","3":"\n\n Up at 7.15 a.m. Still no signs of my tack so had to shave etc. with my batman’s gear. Fell the men in at 10.30 for rifle inspection and general brush up. Went down to the village to Curnow’s billet and found him quartered in a two storeyed place the owner of which is a Civil Engineer. Two nice mademoiselles and two maids. A very nice place inside with a good collection of china and all the bedrooms were spotlessly clean. Breakfast of raspberries etc. and cream and all served up in snowy napkins. Just opposite to this billet\n\nRenescure\n\n10\/7\/16\n\n is the chateau of Bernard de Renescure a fine old place whose owner is at the war. It is surrounded by thick trees. On the right hand side of the entrance door is a sundial with a Latin motto and a projecting iron rod gives the shadow. The seasons are shown as well as the hours. This family are evidently of some local importance as I noticed their tomb in the graveyard of the church. The church is a very old place which was originally built in 1380 but restored at different times since. The usual recent graves surround the church but there are a couple of old family tombs. The door is of carved stone and evidently very old. In a little niche in the portal is a small carved figure of a monk reading a book. Inside the church is very bright and there are some old paintings on the wall. In the floor are flags carved to denote whose grave is beneath. The tower is something like that of the Hotel de Ville Bailleul. Behind the church is another cheateau. The village is a clean prosperous looking one, the schools are still being held. One cannot help noticing that the physique of the youngsters is poor compared with Australian children perhaps owing to so little meat being eaten. \n\nSlept all the afternoon and received orders at 8 p.m. to move off at 3.40 ready to entrain at St. Omer 7 miles away at 6.40 p.m. Issued necessary orders. Thence our route is via Calais, Boulogne, Etaples, Abbeville to Amiens where we billet. It will be a 7 hour journey in daylight so should be very enjoyable seeing all the interesting country. We have now been right across France from Marseilles and know portions of the country like a book. We have marched across a good deal of North Eastern France so have an intimate knowledge of a good deal of the country. Unable to get into St. Omer to see all the places of interest there and shall have to be content to see a lot from the train. Every place here is historic and it hurts to pass without lingering for a while to see these places.\n\nSt. Omer\n","4":"\n\n Wakened up about 12.30 p.m. by the squealing of Mademoiselles and sounds of much merriment from the estaminet portion of the premises. Got the sentry to call the Corporal of the guard (O’Bierne) and gave him orders to take the names of the revellers and to clear the place. Rose at 2.15 a.m. shaved and breakfasted, found the midnight revellers included Sgts. Stone, Bodinnar & Glasscock so got the Sergt. Major to parade them and read them a lecture. \n\nLeft at 3.40 a.m., had a short rest at the starting point and then set off on our road again. Very pleasant in the growing dawn swinging along, the air heavy with the fragrance of new mown hay. The heavy packs made the halts welcome although we are now blanketless having returned all ours to store. Through Arques in which is a peculiarly shaped mill tower which reminded me of the Bishop Hatto legend. Turned alongside the canal Neuf Fosse & marched into St. Omer. Quite a lot of military & other barges on the canal many marked with the Red Cross. The railway station is on the north of the town. On the left hand side coming in is a tall church or abbey tower. The body of the place seems to be in ruins. \n\nComing along the towpath we passed a number of young people of the poorer class carrying hoes going out to work in the fields. Comments: \"B--- going to work. Another: \"Crise! Tivey’s crowd!\" \n\nWe entrained with all our transport into a train composed mostly of trucks with a few carriages for the officers. The men were in the familiar trucks taking \"40 hommes\" each. In Renescure the other night some diversion was caused by one of our chaps knocking at a door of a house where a rather elaborately garbed mademoiselle dwelt. Our friends kept calling out a price in hopes of getting the door opened. Rap, rap, rap, 40 francs m’selle. No answer. Rap, rap, rap m’selle. No answer. 50 francs m’selle. Rap, rap, rap. No answer. ‘F’ --- yer!! \n\nThe French railways are very up to date & their engines splendid. Not much of the town can be seen from the station. The leading section on the march today was very good at whistling and made the distance pass quickly. Left at 8 a.m. and passed through varied country until we came within about 10 miles of Calais. A good deal of marshy land intersected by canals. Some varied.\n\nCalais, Boulogne, Etaples\n\n11\/7\/16\n\n The surrounding country is wind swept and a salt tang is in the air. We skirted the town which is a large place. A peculiarly shaped spire caught the eye. It was foursided and appeared to rest on a squat base. The line swings round with just an occasional glimpse of the Channel passing through open farm land. From one spot a very fine view of the whole country including Calais is obtained. The roads are white chalk and later we passed big quarries. The country was open right up to Boulogne which is a fine city with a crowded harbour. Our train skirted the town, soldiers seem to be running everything. Part of the place appears very old. From here to Etaples the country is sandy & there are big camps full of troops training. There are also plenty of hospitals. Some ambulance trains full of wounded were in. \n\nVery poor and uninteresting country from here on to Abbeville, low marshy peaty country until the Somme is met. Here a lovely region commences the trees are thick and line the banks opening now and then to disclose some neat chateau. At Abbeville we only spent a few minutes and then continued along the basin of the Somme to Amiens. The country round here must be some of the pick of France. We passed through the city and went right out to a siding at Longerau where we detrained. Some of the land is very marshy but intensely cultivated like market gardens most of the work being done by women. They get from plot to plot in peculiar gondola shaped boats like sampans propelled with a pole. An old chap looked very comical sitting in one in the waterway between two garden plots patiently fishing. The A.A.G. met us and we found to our dismay that we had to march 12 miles back to a place called Breilly – a village we passed in the train. They could easily have dropped us there but advanced as a reason that there were no facilities for unloading the \n\nAmiens\n\n11\/7\/16\n\n transports. The battalion could easily have been detrained at the billets in 15 minutes and the transports gone on alone to the further place. But no: the glorious British Army takes the men 12 miles past their billets lets them get out & then marches them 12 miles back over cobblestones. Things like this make one sick. I wouldn’t mind being Fritz would not be fool enough to do a similar thing. \n\nWe set off and marched right through Amiens which is a fine old large city with wide streets. It seems fairly scattered. We went via subsidiary streets & created quite a sensation even in a place where the tramp of armed men has been heard daily for two years past now. The people were much taken with our hats. The spire of the cathedral is a striking thin sharp one and has a beautiful airy effect. The men marched very well through the streets the people all seemed very prosperous and neat. Plenty of French motor transport about, the blue uniformed drivers appear very smart and brisk. We pushed on right through the town & pulled up for tea near a big cemetery a delightful spot full of lovely green trees. A number of women came round up to all the tricks of Egypt exposing themselves & proposing to g— the soldiers. \n\nLeaving the town we passed through a number of villages and past cornfields covered with poppies & blue cornflowers. Turned off at St. Savieurs & thence to Brilay where we billeted the men in a ruined Chateau in the cellers. Wire bunks had been fitted in – a most extraordinary place. Lovely avenues of trees approaching the place. Officers billet in a farmhouse with an old virago of a farm wife we had to argue furiously with. We have had a hell of a day today been on duty continuously for 21 hours marched 21 miles & been 8 hours in the train. All finished up cheerful.\n\nAmiens\n","5":"\n\n Slept in until 9.15 a.m. & at 11 saddled up the horse & left with Major Matthews to ride the 8 miles into Amiens through cobbled streets along a tram track where fine electric cars were being driven by women conductors. Past the Hotel de Ville and stabled horses at an hotel. All the people staring at us & much taken with our hats. Fine shops in all the streets. \n\nWent down to the Cathedral upon which you come suddenly and the delicacy and airiness of the wonderful dream of stonework takes your breath away. The whole of the outside is carved & chiselled into hundreds & hundreds of images and statues. The building was commenced to go white with its 700 years of age. The spire is an extremely slender & tall one which has an air of lightness about it. The lower portions of the building are encased in sandbags & a good many figures are hidden thereby. \n\nIn the front of the church is the open paved Place de Notre Dame which sets off the Cathedral. Around about were several beggars, some very persistent. In rear of the church is a statue of Peter the Hermit. The central figure of the front – the Bon Dieu d’Amiens - was hidden by sandbags but just above the portal a figure is represented as sitting in judgment the curve of the portal above represents the heavens and is full of a whole heavenly host in stone – hundreds of angel figures. Below the figure are row after row of persons awaiting judgement some have plaster heads & there are also on this wall numbers of fabled monsters cut in stone horses with fishes tails &c. Marvellous gargoyles glare open mouthed from among the statues, their purpose is to act as drain spouts & to discharge rainwater out of their mouths. High up are large statues of the apostles and others beautifully done. The round exterior of the rose window appears above these. Flying buttresses are all round. One wants to sit down on the opposite side of the square & let it all sink in. The\n\nAmiens\n\n12\/7\/16\n\n longer one looks the more enchanted one becomes as fresh beauties disclose themselves. Inside the loftiness of the ceiling & the boldness of the pillars impress one. The light is splendid. Over the front entrance door is a rose window meant to represent the wheel of fortune. The two rose windows on either side of the church above the side doors are the most beautiful one can imagine. About the glass there appears to be a subtle caressing softness, & the tracery of the framework is a marvel of intricacy. No clear design emerges from these windows, it is the marvel of colour that constitutes their beauty not the art of the scenes represented there. Little figures and little scenes seem to make up the whole window. \n\nBehind the high altar are 8 radiating chapels with huge stained glass windows all exquisitely done. Directly in the centre high up is a big plain glass expanse of windows which looks a little out of place among its coloured brothers but adds much to the church’s lighting. Two bronze tombs (the only two in France) of old dignitaries are on either side of the nave as you enter & on the left is a marvellous piece of shining bronze work in the shape of \nof\n a huge figure of a saint apparently crucified. \n\nThe choir stalls which are the most beautiful wood carving, were being all encased in girders and sandbags but we managed to get in & see that most marvellous wood work in the world. Sweet and young grained wood it is: oak trained & chosen for such work sound now as 500 years since. Under the carvers hand it seems to cut like clay, to fold like silk, to grow like living branches, to leap like living flame. Canopy crowning canopy pinnacle piercing pinnacle – it shoots & breathes itself into an enchanted glade inextricable, imperishable, fuller of leafage than any forest and fuller of story than any book. Each seat and each partition is carved most delicately into lords & ladies, dogs & animals of all kinds & a hundred else.\n\nAmiens\n\n12\/7\/16\n\n There is an intermediate altar at the near end of the choir screen, which is elaborate ironwork. The High Altar is designed with a background of sky effect. Huge clouds with the sun in the centre its rays of gold shooting out on each side. There is a golden statue of a mitred dignity above the altar. Behind the altar Canon Lucy is buried & there is a monument to him a tablet surrounded by weeping angel children considered one the finest in the world. We were not allowed to ascend the spire as doing so renders the Cathedral fair game for the enemy. On the outside of the choir stalls is stonework depicting the life of John the BaptiSt. All the people are dressed in 13th century clothes. In a cabinet encased in gold and surrounded by precious stones is a tiny fragment of bone once belonging to the Baptist so they say. Outside the west wall away to other statues are noticeable 2 monks praying both laughing and looking very comical. \n\nAfter leaving the Cathedral we went round the town & walked through the main streets which in places are quite as busy as Alexandria. Fine shops of all kinds especially military outfitters. French officers and soldiers are everywhere the former looking very smart and alert. Talking to some one says \"What pretty ‘ats you ‘ave!\". Very nice fellows. Had strawberries & cream & then dinner of Hote d’ Universe. \n\nWe left our horses at a hotel & had a devil of a job harnessing up as the man knew more about motors than about horses & had all the gear most horribly mixed up. Eventually we got away & reached home late after a really most enjoyable day. The glory of Amiens is its wonderful church. With revisiting it and saturating ourselves with its beauties and every minute disclosing something more to charm. The Museum was closed during the war and there is nothing else much to see. Numerous canals intersect the lower portions of the town. It is a lovely old town and its good to see nice people in the streets. Amiens is the Samarobriva of the Ceaserean era.\n\nBreily\n","6":"\n\n Parade at 6 and again at 9 on the latter occasion all marching down to the Somme for a swim. Houses fringe the wooded banks and girls watched the nude men in the usual matter of fact French way. They think nothing of such things here and yet no one could possibly be more mild & dainty than the French Mademoiselles. A very strong current runs through the stream hereabouts and it was almost impossible to swim against it. This is the country of Picardy. \n\nReturning to the ruined Chateau all admired the avenue of trees their branches entwining in a green arch overhead. When the sun shines one gets the full effect of the colour tones but grey days are so very frequent here that the opportunities of just feasting the eyes is rare indeed. The men are billeted in the cellars and vaults on wire netting bunks. Altogether this is a most peculiar place. At H.Q. they have a fine billet & last night the family joined in a game of auction bridge. We go over the parapet into the land of fire & slaughter in a day or two. \n\nThis afternoon went out to a field passing through Breily to get there and ascended over a high portion of the road to a fallow meadow a-blow with poppies & cornflowers among the sere crops. An excellent view over the valley of the Somme was obtained. The river directly below with its thickly wooded banks and its fringe of peat bog. Open country rather fully and chequered with cultivation goes up from here. \n\nDirectly opposite is a Roman Camp. All round had evidently been a deep excavation which still is like a great green snaky scar encircling the place. There are chalky outcrops hereabouts & what look some ruins near the back of the camp. The men are billeted in an old ruined Chateau quite roofless and deserted & sleep in the dark cellars on wire netting bunks. There is a splendid avenue of trees up the drive to the residence, the branches interlace and form a green aisle which looks lovely when the sun is on it.\n\nBreily\n","7":"\n\n Another of the succession of grey days. The men swam in the Somme this morning. They look splendid muscular white skinny strong men. They are rough as nails – march their 20 miles without turning a hair, sleep out in the open without blankets or other covering & eat the rough issue rations. English regiments passing through wear their trophies captured in the advance. The push continues fairly satisfactorily.\n\nIn the afternoon the parade took the nature of an attack practice in the new formations over high chalky rises on the Northside of the Somme. The ground is nearly pure chalk in places. There are great flowing rivers of green hill and dale & one looks down on the little village nestling in among woods.\n","8":"\n\n Bathing parade in the Somme during the morning. After lunch marched to the chalk heights on the opposite side of the river and there carried out a Brigade practice attack. The soil here when upturned glows white with the pure white hunks of chalk. From here one looks over a great expanse of open downs. Tiny little villages nestling in their woods and radiating out from them are the cultivated fields. In the distance lies Amiens’ rising in the centre of which is the old Cathedral with its lofty walls and slender spire and dominating the whole city. The \"Push\" is said to be going well and successfully pierced their past time and set our cavalry & horses. late in the day the ASC had a that a General, his whole staff, & 6,000 prisoners had been captured.\n","9":"\n\n Being Sunday we looked forward to a sleep in but suddenly at 9.30 orders arrived that at 10.30 the head of our column must swing out en route for the trenches. It needed swift packing and quick orders but punctual to the time we were on the march. Not bad to clear out at an hour’s notice leaving all clean behind us. Our transport accompanied us. Passing through St. SAVEUR we came\n\nBertangles, Coisy, Rainneville\n\n16\/7\/16\n\n along a white chalky road winding over high downs. Poor country with stunted crops and not very many houses in sight. Reminded me very much of some Australian landscapes. The tower of Amiens Cathedral is a landmark for miles and miles around. \n\nApproaching Coisy the pretty country starts again. In Bertangles we passed several little crucifixes set in the middle of a ring of trees like a Druidical grove. Just the other side of the village there is a fine long avenue of parralel rows of trees with a road running straight up to a chateau at the top. The trees are the chief beauty of this country & the people pay very great attention to their culture. \n\nWe came into Rainneville into poor billets – the accomodation of the little village being overtaxed by so many regiments. We had great arguments with the very old dame at our billet she pointblank refused to allow the batmen to use her stove so after explaining that by law she is compelled to do so and greasing her palm a little we got on alright. \n\nGood news through from out in front but poor Mackay had bad news as he received a cable telling of his father’s death and the boy broke up completely. Today is Sunday, we always seem to move on the Sabbath. Some drizzling rain tonight. There is some talk of there having been a rape down the street and a roll call being held. The old dame introduced us to strawberry and black currant bushes in her garden and we had a tin of Ideal Milk too. \n\nNo mail is being accepted for transmission from us and correspondents at home will wonder. We march on again tomorrow. From here we are back to the familiar sound of guns once more.\n\nRainneville\n","10":"\n\n This place has justified its name and we have rested here all day and taken things quietly. I lectured for an hour this afternoon on the different phases of open fighting and trench attacks. All round the back of this little house is the deep green of tree and hedge & a silent wet rain is falling. Much tolling of church bells for some person who died last year. Rumble of distant guns like those at Helles.\n","11":"\n\n Sudden orders stand by to move at 11 am. We moved off correctly at the appointed time and marched for 8 miles over country that is as totally different to Flanders as any you could well imagine. Passed through the pleasant little villages of Pierregot, Rubempre, & Toutencourt. The country is a little hilly & the road undulates. From the higher points it is spread out like a carpet full of different coloured patches, where various cultivation is done. No fences, but merely the division of colour. In some places we passed fields of poppies evidently grown for the morphine. Some woods square and fairly young. \n\nReached Toutencourt and found through staff messing we had no billets and had to march to Puchevillers. There we succeeded in getting a good billet in the village. These villages very pretty all embowered in green leaves. Lovely winding lanes. Little planted groves of trees with their central shrine a Calvary. A grey day. Always grey. \n\nRumours of a set back last night to our people. Ambulance wagons busy going up. Sir Douglas Haigh passed us in a car. Men have a furphey that Erquinghem has been plastered and the old 900 yeared church knocked down. Paid the mess after tea. This is a good billet with a nice m’selle who sang for us and madame caters for the mess at the rate of \"quatre francs per jour\". Big casualty clearing stations in this small place. 9,000 Germans put through there wounded since the 1St. They say our gun fire is awful.\n\nPuchevillers\n","12":"\n\n First parade 9 a.m. was held on a little enclosed piece of ground at the back of the farm. A rather fine sunny morning for a wonder. The church in this village is an old one with a square tower after the style of the Erquinghem one. The roads outside the town immediately commence to rise over the small hills. Picardy is a place of green rolling hills and fields the same as Flanders is level cornfield. The normal population of this village might be 500 but with the soldiers it now runs into thousand. Problems of sanitation arise with so many crowded up together and the local people lose a good deal of their homelife by men running in and out. It coarsens everyone, but our men are very good. \n\nIn the afternoon met Bert Curnow and went up to the big casualty clearing station which is full of wounded. The sight of the sisters cheered us up. Went into a tent full of wounded Germans most of them not badly hit but did not look round much as I don’t think it the thing for officers to look at them as a sideshow, poor devils. Human leg blood covered thrown into incinerator as \nwe\n Bert passed. Curnow came to tea and afterwards we played poker assisted by Andrew & Rodda the result being a win of 1 franc 5 centimes for me. Received orders for a move tomorrow morning early.\n","13":"\n\n Head-dress\n\n The women are often crude peasant folk and wear kerchiefs over their heads. Babies often have tiny little close fitting straw hats with a little tassel. The men favour a peaked cap and corduroy breeches. Women wear short skirts & long big boots. \n\nThe men all had a great deal of beer last night and argument and disputation was carried far into the night with wealth of verbiage. We left from Puchevillers and made Lealvillers at 12.30 after a tiring march up and down hill. A hot dusty muggy morning. Passed plenty of motor transport, all named after Pickwick characters & others, each with a rather good appropriate little painting on the side of the wagon. Lealvillers is an ordinary village with the conventional brass rooster crowning the tower of the church, & crooked streets radiating from it.\n\nPicardy\n","14":"\n\n Set out at 9 a.m. on a bicycle for Rubempre and with the wind behind soon covered the intervening 8 miles passing through little villages with twisting streets en route. Most of them we had marched through before. A good many officers had assembled to hear a very good lecture on machine guns delivered by a Staff Officer with a good string of ribbons and a splendid grip of his subject. The place was the village school. \n\nBoys and girls are educated at separate schools and as far as one can judge the educational system is very good. All the little girls (pretty clean little youngsters 7 to 8 years old) sat outside on their forms in the yard with their neat little teacher, a mademoiselle aged about 22. Inside the school were the usual fittings and pictures of places in \"Notre Belle France\". \n\nAfter the lecture we returned home, and while having a little lunch orders arrived for a route march and in 25 minutes we were on the warpath with full transport and marched about 7 miles. From a high portion of the road we spotted a very large shell burSt. Observation baloons were up all round the horizon. A great deal of motor transport passed and repassed continuous trains of wagons running along. \n\nAt night, we all attended C.O’s billet for a conference and the question of discipline came up. No doubt there has been a tremendous amount of drinking lately and it is the curse of the A.I.F. and only noticeable after pay days. With beer at a penny a glass they get too much for their money. They should be cut down to the same rate of pay as the Tommies and then a lot of the trouble would cease, but at present the men work like the deuce all day and do their duty splendidly but after parades in the evenings drink gets going on and one sees fellows drunk in the company who never before touched liquor. We have not had a church-parade for weeks now owing to moving round and although not a religious individual I think the weekly church parade has a good restraining influence on men.\n\nPicardy\n\n Lealvillers\n","15":"\n\n Early morning parade at 6.30 am followed by the usual morning parades later when triangle of error was done what time boots and gas helmets were also on issue. In the afternoon route marched again over the same ground as yesterday. The roll of guns came ceaselessly from the south as the battle goes on. The village of Harponville is a quaint small place with a \"barny\" looking church the spire of which is surmounted, like all French churches, with a large gilt tufty tailed rooster who perches on top of the cross. Very open rolling country this like that about Broadmeadows and eminently suited for open fighting. Heard today that the 5th Division were tidy up to some extent at Fleurbaix and poor little Norris killed.\n","16":"\n\n All night long an intense bombardment was kept up and some big stuff kept landing comparatively close with big thuds. The shelling was about 12 miles away and a constant roll of deep booms continued. Towards dawn it increased in ferocity and there was a furphey that our 1st Divn. attacked and were met with the flamenwerfer. Wounded men passing through all day. Being Sunday we slept in until late and then had a Battalion Church Parade. \n\nIn the afternoon a kit inspection was held and some Australian tunics arrived. These were most welcome and were used to requip the officers and senior N.C.O’s. A grey day today. A Taube came over this afternoon and gave the anti aircraft gunners some practice.\n","17":"\n\n A grey day. Slackening of artillery fire in front. Stood by for a route march but no orders having arrived at 10 a.m. we carried on with bombing and other work. Lyon having reported took charge of No. 9 platoon. Major General Legge, Col. Bridges & an A.D.C. came round and dropped a few platitudes. Heavy bombardment in front all night vivid flashes darting up luridly. Quite a party assembled here in the evening & we merrily gambled at poker till late, our batmen serving supper.\n\nTHE Somme\n\n (Lealvillers)\n","18":"\n\n A grey day with wreaths of smoke forming a haze, due to the heavy gun fire in front. Perhaps the cloudy weather can be traced to the same \ncourse\n cause. In morning parade we marched out and did an open attack and in the afternoon routemarched round the Harponville square back to here. Dropped out at Varennes. It was a most unpleasant march owing to the heat and all finished up dust begrimed and tired. At Varennes a big concourse of officers including 2 Generals, assembled to witness ‘a bomb demonstration’ by Stokes guns. They created hell with their devasting expolosions. The little bit of countryside selected was ripped and torn to pieces as shells plunged in thick and burst with streaming flame and acrid smoke. Some fine old fruit trees were stripped of their leaves and the selected area was laid waste.\n","19":"\n\n At 3 a.m. an orderly walked in with march orders and at 4 a.m. we marched out in column of route. Rather quick work. No breakfaSt. Marched 8 miles on empty stomachs and reached Albert at 8 a.m. The town lies in a hollow and is dominated by its shell wrecked church atop of which is the Falling Virgin – a big brass statue on top of the spire which has been knocked right over by German shells but still has not fallen. What holds it I don’t know but the statue is balanced at this angle on top of the spire. Local legend has it that when the statue falls the German Empire will fall also. Some shelling and a couple burst near us. We are under orders to advance tonight and shall return either crowned with laurel or wreathed with cypress.\n\n"}}