{"Document Name":{"0":"Diary_0243","1":"Diary_0243","2":"Diary_0243","3":"Diary_0243","4":"Diary_0243","5":"Diary_0243","6":"Diary_0243","7":"Diary_0243","8":"Diary_0243","9":"Diary_0243","10":"Diary_0243","11":"Diary_0243","12":"Diary_0243","13":"Diary_0243","14":"Diary_0243","15":"Diary_0243","16":"Diary_0243","17":"Diary_0243","18":"Diary_0243","19":"Diary_0243","20":"Diary_0243","21":"Diary_0243","22":"Diary_0243","23":"Diary_0243","24":"Diary_0243","25":"Diary_0243","26":"Diary_0243","27":"Diary_0243","28":"Diary_0243","29":"Diary_0243","30":"Diary_0243","31":"Diary_0243","32":"Diary_0243","33":"Diary_0243","34":"Diary_0243","35":"Diary_0243","36":"Diary_0243","37":"Diary_0243","38":"Diary_0243","39":"Diary_0243","40":"Diary_0243","41":"Diary_0243","42":"Diary_0243","43":"Diary_0243","44":"Diary_0243","45":"Diary_0243","46":"Diary_0243","47":"Diary_0243","48":"Diary_0243","49":"Diary_0243","50":"Diary_0243","51":"Diary_0243","52":"Diary_0243","53":"Diary_0243","54":"Diary_0243","55":"Diary_0243","56":"Diary_0243","57":"Diary_0243","58":"Diary_0243","59":"Diary_0243","60":"Diary_0243","61":"Diary_0243"},"Date":{"0":"unknown","1":1209.0,"2":1210.0,"3":1211.0,"4":1212.0,"5":1213.0,"6":1214.0,"7":1215.0,"8":1216.0,"9":1217.0,"10":1218.0,"11":1219.0,"12":1220.0,"13":1221.0,"14":1222.0,"15":1223.0,"16":1224.0,"17":1225.0,"18":1226.0,"19":1227.0,"20":1228.0,"21":1229.0,"22":1230.0,"23":1231.0,"24":1232.0,"25":1233.0,"26":1234.0,"27":1235.0,"28":1236.0,"29":1237.0,"30":1238.0,"31":1239.0,"32":1240.0,"33":1241.0,"34":1242.0,"35":1243.0,"36":1244.0,"37":1245.0,"38":1246.0,"39":1247.0,"40":1248.0,"41":1249.0,"42":1250.0,"43":1251.0,"44":1252.0,"45":1253.0,"46":1261.0,"47":1273.0,"48":1276.0,"49":1277.0,"50":1278.0,"51":1279.0,"52":1280.0,"53":1281.0,"54":1282.0,"55":1283.0,"56":1284.0,"57":1357.0,"58":1358.0,"59":1359.0,"60":1361.0,"61":1363.0},"Entry":{"0":"\n\n","1":" &","2":"\n\nLeft Amiens 3.45 a.m. in troop train for Romescamps, spent day there where we saw very pretty hedges & a rather quaint church. Some of tombstones in yard have date of 1780. \nAt\n Waited in Y.M.C.A. which by the way was like an island, surrounded by mud knee deep. Left Romescamps at 11.30 p.m., arrived at Edgehill at 3.30 a.m., \nspent\n slept till 7 in an empty carriage, rose, breakfasted with some Indians, reported to R.T.O. & set out to find No. 1 F.A. which was billeted at Buire, found them on the move so came through the shell shattered town of Albert, to Aveloy. We were quartered in a ruined Chateau once the residence of Baron Rothchild. Cavelcade billeted in the old stables.\n","3":"\n\nReveille at 7 a.m., got up at 8 a.m., told off for duty, passed a quiet day. Two \"Fokers\" flew over at a great altitude. The guns in Albert opened fire on them, without effect. It was interesting to watch the shrapnell burst all round them. Washed in the River Ancre which flows at the foot of the grounds.\n\nWent into Albert in the afternoon. Saw ruined Cathedral. Legend says that when the virgin falls from the top of towers, that day the war will end. British engineers have fastened it so as, they say, it cannot fall. Went to Anzac Coves a vaudeville run by the Anzac troops. Saw Sharo there – knew him in camp – he is their commedian. Very heavy snow fell.\n","4":"\n\nContinued with duty of day before. In afternoon explored an old French stronghold. It runs for great distances in several directions & was very strongly protected & fortified. Some 40 ft. under ground a suite of cement rooms were built, presumedly for the staff, a little way further on were the mens quarters. All round the hill are still to be seen the cemented loopholes, where the machine guns were fixed.\n\nLater went on tour over the old battle front of Somme & Ancre. The scene of devastation & havoc is complete in every sense of the words. It would be hard to step 2 paces, where great shells have not torn up the ground – rifle bullets & machine guns & smaller shells have left no trace, unexploded shells lie about in plenty, owing to the muddy ground, failing to give the required amt. of percussion,\n\n4th Continued\n\nunused amunition, rifles, bombs of every kind & shape, from the deadly little \"Mills\" to the giant \"plum pudding\", bayonets, helmets caps, clothes, all lie about in profusion. What would seem impassable barriers of barbed wire entanglements have been torn up & cut into atoms by the artillery. Woods are torn up, in places only pieces of stumps left to show where a thick forest once grew. Beside the roads the shell holes are most frequent, they are large holes of some 15-20 ft. in diameter, all full of water, in some the water is very much blood stained. Light railways, the great assistance to the advance, run all over the fields, great dumps of ammunition, rifles, etc. are met with, every here & there. Little grave yards are lying among it all, men who have done their bit bravely & well & made the supreme\n\nsacrifice lie here taking their last sleep in this life for a time deaf to sound of fritz’s guns & our own.\n","5":"\n\nThe day passed uneventfully. In evening went along railway line, saw damaged tank & went along another battle front.\n","6":"\n\nMarched to Byzantin with heavy packs, this the old Posieres battle field. Here the blasted scene of desolation was very noticeable. Debris & salvage lay everywhere – forests were laid bare to the ground.\n\n7th\n\nMarched to Bapaume – 10 miles – over the old field through deep mud in places, for the rest over duck boards. Arrived in Bapaume rather tired after 3 hours hard marching. Not a single home in this part is left undamaged, some have been pulled\n\n5th Leaving tomorrow\n\nwith horses, some mined, burnt & destroyed in every conceivably way. The destruction of Bapaume was evidently one of those systematic pieces of cruel vandalism in which every man played his part.\n\nIn afternoon Germans shelled us with big naval guns, some 5-10 large shells fell in Bap. doing slight damage, 14 horses & 4 men being killed. These were are in the vicinity of Railway Station.\n","7":"\n\nDid fatigue all day. At 8.30 p.m. left Bap. to go into the line. Marched to a little village to A.D.S., proceeded to \nthe\n a damaged railway station, turned in \nfor\n till 4.30 & then proceeded down to","8":" Batt. Aid\n\npost next morning.\n","9":"\n\nCarried under an irregular fire from the enemy all day, had a few fairly narrow escapes, at night carried again – got lost in dark, but eventually found our dug-out.\n\nDuring the night Fritz landed one shell into the side of our dug out – another one the top, both splashing us with mud but doing no damage, same dislodging a few feet of earth. No rations came for us & it was very cold.\n","10":"\n\nCarried again but very few shells came over to disturb us. A little village to our left was shelled heavily, passed a quiet day & went for rations straightened our dug out.\n\nDuring night a few shells came over but did not disturb us.\n","11":"\n\nRecd. orders to move & were later relieved by No. 3 field Amb. Went \ninto\n for a rest into dugouts on the right flank – where I write this – late in afternoon fritz shells batteries on our ridge, with coal boxes but none came within 200 yds. of us – but close enough. 4 of us are here living in a comfortable little dug out & are in the best of spirits, rations have come along & we have had a good hot meal. Our position is exposed to the enemy but all are so tired that we are prepared\n\nto take any risks for a night’s sleep.\n\nSnow falls heavily & all the whispering pines of the adjacent woods are covered with fairy flakes of snow, giving a picture of rare beauty. All the fields for miles around are white.\n","12":"\n\nRested in same \"posie\" as previous day, rested & enjoyed our rations.\n","13":"\n\nRecd. orders to move down to R.A.P. of 3rd Batt. Arrived there – \"nothing doing\" so spent day in \"digging in\" & making a comfortable home – finished at dark & were having tea when orders came to move off in 10 min. Proceeded under cover of darkness to a chalk pit 200 yds. behind our front line, \"dug in\" & spent a quiet night.\n","14":"\n\nInfantry \"hopped over\" at 4 a.m. & took 1000 yds., fritz no where to be seen. A few shells landed on our right & left, the day was quiet.\n","15":"\n\nMidnight was barely passed when fritz began a barage all along our front. Shells fell everywhere & I thought our hour had come. We lay in our dugouts & waited – what more could we do? This murderous fire contd. till day break toward which I said the first prayer for many a long day. At 4 a.m. the enemy \"came over\" in massed formation but after appaling losses retired without any gain.\n\nI hear some say they lie 3 & 4 deep in front of our trench. Prisoners told us that 3 regiments came all the way from Cambria to attack at this point. While I write the shells\n\nare falling round our position, but not as plentifully as a few hours ago. The screams of our own big shells going over to the enemy do help \ncelerate\n celebrate \"the day\". The whir of nose caps, the explosion of his 5.9’s & the sound of howitzer & other guns make our nerves jump. In any interval that may occur the larks sing to us joyously. Here as so often before we have the sublime, & the terrible side by side. The day is well spent but not over, \nbut\n. Why should I want for night to write these few lines? We may not see darkness fall for any minute threatens to be our last. On our last carry, a big shell narrowly missed us in passing, & burrowed into the ground a few feet away. We fell on faces, & escaped. A shell has carried away a large piece of the bank above us.\n","16":"\n\nLast night passed comparatively quietly & all day we have been undisturbed & nothing has happened worth recording.\n","17":"\n\nMorning quiet & uneventful, a few shells fell at times. Moved in afternoon to rest camp in a wood near La Bouchigne 4 miles back.\n","18":"\n\nMoved back into line, built new dressing station & made dug outs, at night I got mixed up in barbed wire entanglements, fell into trench & got an iron bar into groin. Went to dressing station No. 2 F. Amb., got injection & was retained there.\n","19":"\n\nLaid up with wound at field Ambulance. Met Allebond & spent quiet day resting.\n","20":"\n\nReturned to unit & afterwards shifted to 1st Relay, did a little fatigue.\n","21":"\n\nOn water fatigue, went into village of Hermies.\n","22":"\n\n11th Div Field Amb. relieved us in the line at 1 p.m.\n Went back into line at Hermies, very quiet all day save for a bit of shrapnel which came over at intervals. At night big demonstration for half an hour. Taube brought down into our lines at 8 p.m. Raid (aerial) on Cambrai by 22 of our planes , all returned.\n","23":" \n\n11th Div. Field Amb. relieved us. Duke of Wellington Light Infantry relieved Infantry at midnight.\n\nWent back to La Bouchigne. Fritz shelled it all day. Left at 4 p.m. for Bapaume.\n","24":"\n\nLeft Bapaume for Pozieres, marched over the celebrated road & found it very hard after the soft ground encountered in the line.\n","25":"\n\nMarched to Albert for a bath. Went to football match No. 8 V No. 18, met Tod Nicholson, Raon & C. Bowler. Came back to Pozieres in time for feed up & concert, it being Anzac day.\n","26":"\n\nSaw Dentist – old Les Schooles now a captain, had tooth filled. Big guns - naval – went up, football in afternoon.\n\nEverything\n","27":"\n\nFatigues all day, went to Theipval in afternoon. Saw hundreds of dead bodies lying about. 18 lb. shrapnel capes lay every few inches. Not an inch of ground that has not been torn up\n\na dozen times. Were warned of the escape of german prisoners, we encountered what we believe were same disguised, later we armed ourselves with a rifle & bombs (mills) to lessen any risk that there might be.\n","28":"\n\nGot leave of absence & proceeded to Becordel with Bill Roach, passed thro death valley, sausage gully, casualty corner & the other old place where hell reigned on earth.\n","29":"\n\nPolling day on active service, great interest shown by most of the boys.\n","30":"\n","31":" afternoon off uneventful till its close.\n","32":"\n\nNothing happened worth recording.\n","33":"\n\nAlso uneventful, \"C\" section proceeded to Beecourt Chateau.\n","34":"\n\nPlayed cricket against 1st Amb. Supply Train, won by 100 runs at Aliert. Our opponents treated us royally, supper supplied after the match & a lorry brought us home to Pozieres.\n","35":"\n\nGot orders at 4 a.m. to prepare to go into the line. \nto\n Left at 7 a.m. for main dressing station, loafed about all day, met a lot of old boys at night went \nto\n into line, encountered two or three duds of tear gass, & sundry other unpleasant experiences but reached the Regimental aid post without casualties,\n\nworked hard all night bearing through machine gun fire & heavy shelling – it was perfect hell.\n","36":"\n\nWounded still arrive in large numbers, \nthe\n bearers can scarcely keep up all fagged out. Leaske killed, Ridgeway, Gibson, Haymen, Madocks, Marlow, Sgt. Clifton wounded in our lot, many bearers killed & wounded at all the posts. Fritz barage lashed all night & nearly all day, it was awful, everyone was hit but not all wounded. It seems miraculous that anyone came out alive. In afternoon went for water & rations into village. Fritz shelled it with 9.5 while we were there, I never saw such a scene in my life. One shell landed a few feet away from me blew most of a house over my head a brick of which\n\nhit me in the side & knocked me over. Concussion gave me a slight touch of shell shock. All ran for their lives between shells for shelter. I felt very bad for some hours, however got back with water & rations – thankful to the powers for such a miraculous escape. Several shells landed near enough to blow us into a million pieces, but fortunately they failed to explode. Got back to R.A.P. safely, things quiet for couple of hours. We were relieved about 9.30 & got out before, just before, the barage began again. Fritz is said to have attacked all along the line \nbut\n but in the morning very sorry. We came out at the \"tout suite\" sorry for our heavy\n\nlosses, but jolly glad to have escaped at any rate. We came up into a sunken road \nwith\n for a few hours sleep & to be held in reserve. The barage was awful, but soon all fell asleep after one of the most eventful days in our lives and one that we shall always remember with horror & sorrow as long as any of us live.\n","37":"\n\nNot called out yet, feeling much refreshed after a sleep & a meal. The bombardment continues but on a small scale. At 5.30 p.m. went back to sunken road & learned that we were held in reserve for the \"hop over\". 10.30 load of blown up. Went to rescue the wounded in the face of a most awful barage, met the Gordon Highlanders going in\n\nwhen we arrived at the scene of accident, found about 40 dead & 10 wounded – it was a murderous fire but by some miraculous means none of us were injured. Carried to the waggons for the rest of night.\n","38":"\n\nLay down for 1 hr., & were then sent into the line to clear the wounded. The Gordons were going over & had captured a village & our 9 Batt. had gone over. The barage continued tho now concentrated mainly on the \"Kilties\", but the machine gun fire was murderous, bullets whistled by like bees, we was afraid to move, we pulled our steel helmets over our faces & went forward not knowing but that the next moment would be our last. We arrived thro’ it all at the R.A.P. How – God alone knows. Carried thro’ this all morning, dead & dying\n\nlay everywhere. At 11 a.m. we were relieved, while taking our last case a \nlone\n fritz sniped at us all the way with \"whiz bangs\" & on nearing the end of our carry with 5.9’s. One big shell – probably 9.5 – landed about 15 ft. behind us. The concussion nearly knocked us all, the mud nearly buried us, but no one was hurt. Came straight out then at the \"tout suite\" thankful to the powers to have escaped from so imminent a death. We came out thro still swept ground to where we are resting.\n","39":"\n\nStill at , rumour has it that those relieved went \"right out\", but that shows nothing certain. Here we are feeling better after a few hours sleep but we dread of having\n\nto go in again tonight. The rest of the day passed quietly. Very heavy bombardment at night, fritz counter-attacked 4 kms lost, very heavy & gained nothing.\n","40":"\n\nSpent morning at . Dressing Station shelled at 1 p.m., 5 casualties recd., orders to the effect that we were to go into reserve for the \"hop over\", but on reaching reserve trenches, were sent back up to the death trap & \"the valley of death\". It is now much quieter. Had two carries & encountered a heavy barage on way back, got into shell hole till worst of it was over, & then made a run for the bank which we reached in safety.\n","41":"\n\nStill at \"death trap\" but our conditions are better than formerly & the casualties so few that we are not all the time out. Relieved at 11 p.m. & not too soon. 8th field got lost on way in & took some time to find us. 8 men went up into Hindenburgs line, hell came out, reached Veaulk at 4 a.m. \nhad breakfast\n","42":"\n\nHad breakfast & came by light railway to Bapaume – too much exhausted to march. Arrived Bapaume & marched to Beaulencourt, camped in open air for night, hung about.\n","43":"\n\nHung about all day & are to march to Pozieres after tea. G.O.C. with Birdie inspects us at 5 p.m.\n","44":"\n\nSince","45":" been at Pozieres doing light fatigues. Nothing eventful happened.\n","46":"\n\nLeft Pozieres marched to \nHencourt\n Henencourt where we billeted.\n","47":"\n\nStill in Billets at Henencourt. Training continues. Everything is \nroped\n robed in spring vesture & very beautiful.\n","48":"\n\nInterambulance sports held yesterday. More reinforcements joined up. Among them is Wilkie.\n\nTo get issued \n\nShirt\n\nunderpants\n\nList of Articles issued\n\nSB\n\nSlacks\n\nwriting paper\n\nboots\n\nink\n\nBadges for Hilda & Freda\n\nAustralia’s\n\nhat & cap\n\nhandkerchiefs\n\nshirts\n","49":"\n\nWent to Amienes where we spent an enjoyable day. Saw the cathedral – now the most beautiful in architecture (Gothic) in the world with its many towers & steeples, its pictures, paintings of the old masters & its time honours slabs of marble. It is now all sandbaged up round the entrance in case of attack from aerial craft.\n\nTruly Amiens is picture of war. Trades pursue their usual crafts, girls & women fill the offices of the men who are fighting for honour & home.\n\nFew places are damaged but devastation is a mild effect of war, nearly every woman is clothed in deep mourning, few indeed they are who\n\nwear ought but crape. Went into one restaurant – the one we have always patronised because it is clean – but today what sounds greeted our ears – the little girl – an only child is crying for daddy while the wife is too full for words. We asked the reason & learnt it from her sobs, \"daddy is dead\" gone to that venue whence no traveller returns. He like others have given all for those he loved but enough of this, thousands are today bereft of someone who is just as dear. We went into the art gallery (Picardy). It is closed now but by going to the French Military Office Australians are allowed in.\n\nWe went to the right men & put our hands into our right pockets and a few franks the poorer went in & saw the wonders of Picardy.\n\nFor the whole day we wandered about the city, seeing what was to be seen, & admiring with opened eyes the scenes of a once beautiful France. I am sitting on a bank beside the River Somme to write this, the ful fledge of spring has covered all. For miles & miles on all sides, as far as the eye can reach the ground has been trodden by nailed feet, but now I must go back to the train to return to our little wet homes.\n","50":"\n\nAnother phase of our lives dawns today. We have the option of sport or drill. We choose the former & before we start I write this.\n\nTwo cricket teams try conclusions with the 4th F.A. while a football team plays scratch. It seems strange to watch the long procession of boys so recently mud stained, blood stained, wet, & cold running hurriedly about in full sports togs. - \na spo\n consisting of a pair of boots, trousers cut off at the knee & a sweater, singlet or shirt, as the case is.\n\nIt is so strange a change that were one to stop & think he would become melancholy to the extreme, but we do not think, to do so would make us cowards.\n\nOverhead the skies a bright & blue, everyone save a few grumblers are bright & happy. Underfoot the green grass reminds us of home – way up country where life was gay & free of care.\n\nLater\n Our","51":" 11 won by 10 runs, our second lost, due mainly to my mistake in changing the bowling.\n\nJerry came over to see me but Joe got hold of him while I was fixing up the cricketing material. The light is bad & I can hardly see to write now. He often comes over now with news of Alf & Harry. Poor old Alf he got his wish after all – a boy from a good home who never wanted for anything. I knew him when in Hospital, he was anxious then to come up with the boys. He got his wish, & now he lies in hospital – dying they say –\n\nsomewhere in France. I must leave off soon & write to his sister. He or I had an agreement once, that if anything happened either of us the other would write home. I wish I could see him but alas – I cannot yet I feel him near and Harry too, has saved his brother at the cost of all that made life worth living. Poor Harry I feel sorry \nfrom\n for him. He has an old mother to keep & someone else is waiting for Harry, far away over the water.\n\nI fear sunshine is not in France for him. Sometimes he used to talk about Carrie & I know that she was ever in his thoughts.\n","52":"\n\nJerry came again. Alf is better & on his way back up the line – hard luck – he is not as rough as we are & was cut out for a better calling.\n\nLast night the rats drove us out of our bunks. Harold N. has all his nose bitten & Billy F. his ear eaten – such a sleep was brought on by the good vin rouge we\n\nhad before retiring. Today went for a bath – but no not a bath – each man had about 3 pts. of water dirty at that to bath in. Afterwards we were issued with \"clean\" clothes. I refused to take mine because it contained more energy than the one I wore. In the Pied Piper of Hamblin they write of rats, but Hamblin I think was far behind us both for rats & I am sure for chats. Chats why they carry one out nearly. \n\nEver since we were in the German dug outs under the railway embankment\n\nwe can’t get rid of chats.\n\nIf the Germans were better looked after than we were their chats, we mighty hungry.\n","53":"\n\nCamp life grows pretty monotonous, yet if we told to go into the line, I suppose would curse our luck. I think we must find something to occupy our time. Today we drilled for 4 hours while poor old \"Kirkie\" Capt. Kirkwood watched us. In the afternoon \"Lord Brasso\" – our O.C. – otherwise known as Col. Brennen rode out to inspect us. We cursed him up & down but it didn’t make much difference.\n\nWe must bear our lot uncomplainingly & make our own fun. Played chess with Brownie, whom I beat after a good fight I finished a \"perfect day\" – I don’t think – with a small gain of 1d. Poker with Metcalf’s crowd. We must do something here on these gruesome days. Harold & Billy, Toby & Frank moved to Amiens on leave.\n","54":"\n\nJoe has fallen in love with the Marquises daughter – lucky dog – a skit has been put up. I hope he takes a hint in time.\n\nIn the afternoon I lay down & slept till cookhouse went. Will have to toe the carpet tomorrow morning I expect unless Aitken\n\nputs in a word. After tea we went over to aviation corps to a concert. It was splendid. The opening singer sang \"Somewhere a voice is calling\". Never have I heard anything so fine. One of the sheds were emptied of planes & filled with men, cheers rang for 5 mins. or more. The boys not wanting anyone else than --- one of England’s best singers they say. He returned & sang \"Nearer my God to thee\". We encored again & again until he came back – sang \"A long, long trail\". By this time the boys went wild & no wonder. He surpassed anything I have heard.\n\nOne other performer appeared on the stage – he too was called back time after time & so ended the finest concert I have ever heard.\n","55":"\n\nThis is my lucky day but up till now 8 p.m. nothing has happened worthy of note.\n\nThe guns sound more active today, but we have no news yet.\n","56":"\n\nStill the same monotonous routine continues, cards, chess & poker has been\n\nthe day’s programme.\n","57":"\n\nMuch has taken place since I last wrote in this diary. Today nurse gave me this, & asked me if I wanted it. I am in Hospital (Brit.) No. 2 Stationary at Abbeville. It’s worse than in the line – for 3 days I’ve lain here to my recollection & had not even a dressing on my wound. The doctor a real flash sort comes in sometimes, looks at one or two & goes to play tennis. All that I see done in the ward is \"red tape\". If a patient dares\n\nto move in bed a nurse comes flying up with a lecture against making beds untidy. I’ll be glad to get away from here if ever a man was glad to get away from anywhere.\n\nThis morning there was a big O.C’s inspection, orderlies grafted like trojans, nurses flew about excitedly & while we wondered what was doing. Before long we found out \"Ward – atten-shun!\" roaded a voice then the Sgt. Mjor. stepped inside – polished up to the nines.\n\nThen came a procession which I shall never forget, if I live to be 1000 years old.\n\nA Colonel marched in, followed by a Major, done up in red braids. Then came another Major, then the ward doctor, next came the \norder\n matron, then the orderly officer, W.O., Company S.M., Orderly Sgt., orderly Corp. & vice Corp. & two off siders. The Col. made a close scrutiny under the beds & over the beds, found something amiss, & passed on to the next ward. What a sight, what polish & what a waste of money\n\nwhile the rank & file bleed in the cold wet trench with scarcely enough to wear at times. I used to be on the side of the officer – once – seems however make one think & now I am for the private always.\n","58":"\n\nNothing has happened yet. I am lying here still, no more enamoured to English hospital than I was yesterday. Today the \"quack\" said \"Well whats wrong with you?\"\n\nI said I don’t know. He said \"what are you suffering from?\" I said, shell shock, gass & wounds.\n\nhe replied \"Ah!\" & went away. The afternoon sister got me a copy of Wordsworth, so I have been right all afternoon.\n\nWe can’t smoke here only between 6 & 7 in the morning 12 & 1 in the day, 5-6 in the evening.\n","59":"\n\nI am in high glee because of being sent away from this place, away from the red tape & show, no one knows how I long to get into one of our own hospital among people who look after their patients rather than their wards. I am going to No. 24 General at Etaples for an operation which for some reason they do not want to perform here.\n\nI am the only Australian in this ward and the English nurses – who evidently have had little to do with Australians treat me as a kind of joke while the orderlies regard me as something strange to say the least of it.\n\nHowever I am soon leaving & so long as I’m not sent up the line I don’t much\n\ncare where I go. Everything will come in the cause of achieving service experience.\n","60":"\n\nAfter 10 hours – long weary hours too, I am snugly tucked away in 24 General. Thank God the people are different here. All the \"show\" and red tape are gone and I am in a hospital again.\n\nWas Xrayed this forenoon, the operation is tomorrow. Then I hope a few weeks in Blighty. My companion here on one side is a Gordon Highlander, the other is a Derby man. The Scottie & I are good chums, the other chap I feel\n\nsorry for but I cannot take any interest in him.\n\nJock comes from Ayr & is a bonnie lad but he is badly knocked about & will I am afraid never walk again as he used to among the bonnie Purple heather.\n\nOur ward is full & the little sister is run off her feet, still she smiles & keeps on going.\n\nJock knows her history which is, by the way, an interesting one. Her mother is Scotch, her father is English, they gave her an education and intended that destiny being kind she would rise to something high. Poor little sister, she did not rise.\n\nWhen everything else\n\nseemed for a time to cloud over she train as a nurse in a benevolent home in Glasgow. Time ran on in sun & shade, war broke out & here we find little sister – still a lady with a kind heart – although it is a broken one.\n\nLater\n\nTea time came & sister’s history is not completed. I am in pain now & cannot write again.\n","61":"\n\nI am still in hospital, the operation is over – i.e., a small one, the doctors have not agreed about me & so I am off to dear old Blighty to be returned to Australia, more than likely, what feelings raise in the heart as we think of that land of our birth.\n\n"}}