{"Document Name":{"0":"Diary_0229","1":"Diary_0229","2":"Diary_0229","3":"Diary_0229","4":"Diary_0229","5":"Diary_0229","6":"Diary_0229","7":"Diary_0229","8":"Diary_0229","9":"Diary_0229","10":"Diary_0229","11":"Diary_0229","12":"Diary_0229","13":"Diary_0229","14":"Diary_0229","15":"Diary_0229","16":"Diary_0229","17":"Diary_0229","18":"Diary_0229","19":"Diary_0229","20":"Diary_0229","21":"Diary_0229"},"Date":{"0":"unknown","1":1610.0,"2":1612.0,"3":1613.0,"4":1614.0,"5":1615.0,"6":1616.0,"7":1617.0,"8":1618.0,"9":1619.0,"10":1620.0,"11":1621.0,"12":1622.0,"13":1623.0,"14":1626.0,"15":1627.0,"16":1628.0,"17":1629.0,"18":1632.0,"19":1635.0,"20":1637.0,"21":1638.0},"Entry":{"0":"\n\n","1":"\n\nDefinitely decided that we go up the line this afternoon or evening. We are supposed to be relieving a section of the other ambulance.\n\nSome say there is a for Meteren, & others that is only just an ordinary relief, so that it is impossible to say. Feeling just an ordinary.\n\nWeather has again become misty. The waning moon perhaps prevented a raid of any proportions last night. Very light shelling today: one or two heavies onto Caestre at intervals.\n\n \n\nPacks filled & put in the 2. MS store, & all else ready for moving off.\n\n11.30 p.m.\n\nUp the line.\n\nWe left Sylvester Capel about 5 p.m. & marched to A.D.S. at Caestre, which is in an old chateau. Found Caestre rather knocked about: houses smashed up, roofs blown in, so that one would get a glimpse of domestic confusion inside. Madame Van house was knocked about, with curtains flapping outside paneless windows. Empty boxes, coffee pots & other relics of the \n\n \n\nold shop & coffee room could be seen lying about. \n\nA direct hit had been obtained on the old candle stick \nchurch\n church spire.\n\nAfter Caestre we separated into parties & single file followed the road from Caestre to Fletre past shell holes, dead horses, smashed farm machinery, & fallen trees to Fletre.\n\nBut what a joke!\n\nThe clock still told 12 oclock as of old, for it has never been in working order since I have known it. But what a wreck Fritz has made of the village. The Caestre end is not so bad\n\nbut reaching the top of the hill & turning to the \n (had we gone on we would have been in the full view of Meteren, the next village, which Fritz holds) to keep in the cover of the ridge. We passed between the shells of burnt out & blown up houses. The same domestic confusion was evident \n\nAfter the village we followed tracks across fields to a farm house in the cover of which was an ambulance car. This was the waggon loading post.\n\nNot far beyond was\n\n \n\nthe relay post where we dropped a couple of squads ( I did not mention before that I was in charge of a squad. Walton, Hynes, Hogg & Wainwright are in it; - of these more anon). This was in a cottage at a cross roads. Such cottages are scattered over the country side here, some single & some in bunches; some hit & some untouched. Shell holes in the lanes & paddocks denoted how problematical was the future of any of these cottages.\n\nAfter a spell during\n\nwhich Paddy Daly delighted us by assuming a most extraordinary top hat that he had salvaged from somewhere, my squad & two others ( Dickson’s & Steven’s) started off: we for the next relay post, & they for the R.A.P. of supports.\n\nIt appeared that ours would be a mile & a quarter distant but we would have a wheeler to convey the wounded. Our track was a road, but as this is under direct observation of Fritz, ordinary journeys such as up\n\ntonight, had to be taken by way of fields covered by hedges.\n\nShells round the field tracks showed where \nrelieving\n the direct observation worked.\n\nAll the way up from the post the man I was relieving was explaining how things stood with us. Unfortunately he was quite explicit that our place gets more than its share of shelling every day. On the other hand \nwe\n they have not had much work, so it has its good points.\n\nPassed French dressing station & then came to ours\n\n \n\nwhich was one of three or four buildings. Others occupied by French soldiers.\n\nHave had one case already, & two walkers, one a 1st lieutenant.\n\n","2":"\n\nAll last night the guns around here were barking out so that I found it impossible to sleep until about dawn.\n\nA few German shells came near, & a great many passed over. These, I found this morning were directed at des Cats for this morning to my astonishment, I found\n\nits steeple missing. Another familiar and pleasant landmark gone! \n\nAs we went out on the case last night there were flares & gun-flashes everywhere, & all noise, so that it was one continuous noisy firework display. Many flares & gun reports over the direction of Kemmel, told of heavy fighting there. It is impossible to say who holds Kemmel. The latest paper reports say Fritz does, but countless rumours & definite statements by French & English soldiers say we have counter attacked & driven him out. I hope so\n\nfor Kemmel is too dominating for my liking.\n\nAll day today we have kept to our little room, & the guns have barked & crashed. \n Our artillery have been very active, but Fritz’s has not replied much. A few shells fell the other side of the hopfield facing us, but so far we have been lucky enough not to have taken shelter in the trenches by the side of the road. \n\nOne of the five – W.C. Hogg has been appointed cook, & at present he is laying out \n\nplates full of hot beef steak pudding on a white cloth. This is possible because the flour & domestic utensils left behind by the civilian residents.\n\nWe have a tin alarm clock, butter dish, pails & jugs, a typical Belgian stove (which we used today as it was misty & cloudy) & a sugar basin.\n\nHave been chatting during the day to some of the French soldiers. They are a full spirited have class of men. One even, regardless of Fritz & to our consternation at the\n\n \n\ndanger of drawing crabs, indulged in some rifle practice today. One chap who is having dinner with us to-night, is a native of (near where we rested at )\n","3":"\n\nHad a good night’s rest last night, only one period of wakefulness, & that was caused by jabbering Frenchmen \n\nThe mist has been clearing up today, & since about 1 oclock it has been a sunny spring day. Not even the clappings & smashings have caused\n\n \n\nthe birds to refrain from singing. Only when nature has been ousted out will they disappeared. At present there are still plenty of trees & grass. The young crops are coming on well. -\n\nThis morning Bill Hynes – Irish descent sharp features piercing eyes, not uncultured but quick of temper- took a \ncars\n case down with me. On the way down only the exertion of pushing the wheeler in the hot moist atmosphere caused discomfort: found the estaminet at cross roads with a shell through it, & a barbed wire barring \n\nthe last high point of the road from traffic owing to observation. Unfortunately that does not apply to stretcher bearers so we got under the wire.\n\nOn the way back just as we were getting under the wire he started shelling apparently forward of us in salvoes of three. We kept on & soon, coming over the rise, saw the shells bursting round the cross roads ahead which is known as the most dangerous spot round here. One of the three shells just falling \n\non the left of the road, & the two others somewhere on the right but all very near it.\n\nI thought for a second & then told Bill to keep straight on (more by instinct than judgement), & soon we had six in two salvoes just ahead. The pieces flew all over the place. We kept on & to our great relief he stopped just before we hurried across the cross roads.\n\nWhen we got back I found three walkers waiting to be sent on for sick parade. I went with them & showed them their track past the danger \n\nzone & then returned untroubled by any further display from Fritz.\n\nOn the way I found a piece of shell & put it in my pocket as a souvenir.\n\nSince then he has been shelling round there pretty consistently at intervals, but we have had no more cases so far. I notice a cluster of houses in hollows some distance from here have been set on fire. Metoren & Bailleul are still burning. The latter shows as a reflected glow every night & the former burns brightly in full view\n\nas far as the tops of the flames are concerned.\n\nWas pleased to find that I felt cool this morning on the road, although naturally one gets very anxious. The main thing is to be sure that the effect finishes with the end of the danger.\n\nHeard a piano going in one of the houses occupied by Australian pioneers. What next I wonder!\n\nBandaged a sprained wrist for a talkative French soldier this afternoon. We are great plans with our French neighbours.\n\nCapt Young & Sergeant come round every night to see that all is well. Tonight they told us that we might be leaving for another post in the morning.\n","4":"\n\nNo cases this morning despite the fact that Fritz was shelling the hollows in front pretty consistently.\n\nAt about 3 p.m. Rogers & B. came along with an order for me from Capt Young to return with all equipment to the central relay post. (n ear wagon loading post)\n\nSaw the others on the field \n\ntrack, & Blackwell, Rogers & I pushed the stretcher full of rations & equipment back to the central post. The two squads above our late post who had carried to us had to go to a new post directly behind the line. Thus we just have the one main line of evacuation now, in about four or five relays.\n\nSgt detailed my squad for work during day time between central relay & waggon loading post.\n\nAfter supper (dusk) Capt Young & he took me with them over their rounds. We visited all the posts\n\n(four), going by fields & roads, but mostly roads. Shelling ahead on the way up, & not comfortably far away either. On the return he started shelling behind us at a cross roads we had left, & following the other & not our road thank goodness. Then some fell ahead but it was erratic. Still \nthey all fl\n a few fell far too near for comfort. One man killed & a couple wounded on the track ahead of us.\n\n \n","5":"\n\nThe central relay is a cottage whose back door is away from Fritz’s lines, but whose surroundings are under direct observation. Capt Young & Sgt live here, & we all mess together at a hard double table in the living room. There was a food stove in originally, but a better has been salvaged (with an oven) & put in today.\n\nOur squad sleeps in a tunnel of in an adjacent building. This was once a hop drying kiln, & is\n\n \n\nlined with ovens or furnaces. It appears to be safe from his favourite shell about here, which is the grass-cutter.\n\nThis is a shrapnel shell which has so sensitive a detonator that it explodes immediately on touching the ground or anything hard. Thus a deadly spray of pellets is shot all round near to the ground. If one hit a roof I imaging it would hardly affect the ground floor.\n\nRestless night, & was called out at 6.30 am for a case. After that we have been kept busy at intervals\n\nall day. We carry shoulders high, one at each corner, which makes the work very light compared to two to a stretcher stunt.\n\nShells fell near all night, & the next cottage along the road was hit.\n\nThis morning he shelled Fletre with heavies for some time & set one place alight, or else smashed up a plaster wall, for the clouds of deep pink were sent up \n \n from where the shell hit.\n\nWe have a quiet time in this living room when not\n\nat work. It is wonderful how near to home comforts we get so near the line. Young the batman, & Hogg have joined forces for working & we do well out of it.\n\nThe most remarkable thing about this room is a picture. It ia an ordinary cheap copy of a poor picture entitled metinea \"Meteren","6":" 1914” Les Anglais à l’ assault du village. Think of it: a picture dent denoting the capture of Meteren by the English in Oct 14. Now, in","7":" Fritz has it again, but he is only\n\nbarely in full occupation for we are in the outskirts I believe. We were near the village last night, but behind a ridge.\n\nWonder if the inconvenience of the double occupation of the village with an interval of 4 years will have any significance après la Guerre. \n\nSunday 5 May\n\nThis \nmorning\n afternoon Cecil Rogers (who has acquired a reputation for \"saloaping”) & I went into Fletre to see what there was to get. Fritz shells the village with heavy stuff every day, but he had a good smack at it in the morning so we decided to chance it.\n\n(I am back to prove it: the piano episode should come first)\n\nAbout midday we had paid an earlier visit. Rogers had told us of a piano in a large white house there so I decided we should view it. Accordingly after we had evacuated \n\na car load of wounded we went straight on to the . In the private house attached to this we found the usual confusion of overturned furniture, scattered clothes, floors littered with post cards & private matter, & smashed glass & brick. In the front room, which had evidently been nicely furnished, was a good suite of furniture (dust covered), some good mirrors (broken by near shell burst) & a piano. The latter had the bottom part of the front missing, was a good one by Klein of Paris & in \n\npretty good condition.\n\nHaving the wheels with us, & finding the piano fairly light we decided to take it back right away, there being four of us (James. Rogers, Walton & I). It took manoeuvring to get it through the garden gate, not to mention the front room window, but we managed it & then did not waste a second in hurrying back\n\nImagine the surprise of the other bearers & Sgt & Capt Young to see a piano arriving.\n\nWe installed it in the\n\nliving room, & since then Bill Hynes & I have enlivened the place from time to time. The tone is distinctly good, which is marvellous considering its treatment.\n\nNow to return to our later visit.\n\nRogers & I went down in the late afternoon & visited the brewery residence first. Every room was in the same topsy turvey & dilapidated condition. From what I saw here & other places I think the residents must have had barely time to clear out with what they stood up in.\n\nIn many cases I found evidence of a commencement to methodically pack up household goods which had been abandoned half way through. First news of a possible advance by Fritz on Hazebrouck must have arrived & then, suddenly & startlingly the near gun fire.\n\nWe got some antique popular English music, & a French copy of some overtures including & \"Norma”. Also I found some splendid post-cards, including a Napoleon series.\n\nAt other houses I got\n\n \n\na German shell case, an alabaster ornament, ivory bound prayer book, & a plentiful stock of note paper & exercise books (from school).\n\nI noticed the Mayor of Bailleul had opened an office in a farmhouse, & there we found stationary, ink, coal rations cards etc., all in one zig zag heap as a result of a shell in the roof.\n\nWent via church & \npassed\n past an estaminet with a French flag still flying from a lower window (evidently left by inhabitants). to another road out & back\n\n \n\nto our home.\n\nNoticed two Fritz observation balloons up not far away, & can easily see from that how dangerous is the observation. Still we have better I believe, for we have all the commanding positions.\n\nMonday 6 May\n\nThe result of the observation balloon’s ascent yesterday was evident during the night in the very frequent shell fire. One shell fell in the farm house on the other side of the road & aroused suspicions\n\nof gas on account of the burning effect on a man sleeping near. As a result Wainwright went on gas guard all night. Many shells fell fairly near, & it was early morning before I got to sleep. As cases were not numerous however, it was not necessary for me to get up till about 11 oclock.\n\nDuring the day there have been one or two cases, & I have been down to the loading post for rations & walking wounded notices. At intervals he has consistently shelled\n\nthe area round the next relay post which can be seen a few hundred yards forward, & also the row of cottages to our left on the road to our old post.\n\nThis afternoon with the sudden clearing of the atmosphere we could see far beyond Fritz’s lines. Meteren showed up clear on the hill to our right front. We have shelled it passed recognition, & the church particularly has suffered, having lost its tower.\n\nThere are rumours that the division will soon be relieved. Some say in a day or two & others not till the end of the month.\n\nYesterday morning an old man & a boy appeared in search of some household goods. Later I saw them returning with a & some beds, & a very big pail.\n\nIt is impossible to convey a full impression of what Fletre looks like. Meteren can now be likened to Ypres in the complete destruction that has\n\novertaken it, but Fletre being in an earlier stage beggars description.\n\nOne can say that it looks as if an earthquake had occurred at one part of the \ntown\n village & big fire at the other. At places where he has sent over incendiary shells, or the ordinary ones have caused fires the shell wreckage has been effectively finished off by the fires. Apart from these effects which are grouped, the rest is just smashed houses, with terrible domestic confusion inside. Each house\n\n \n\nhas its particular wound, either a hole in the roof or through the side, or just splinter marks. The road is lined with broken bricks & broken glass.\n\nA wounded man here tells me Fritz is massing for another attack, but our planes are giving him no rest, bombing them every day. Our artillery gets on to Meteren & Bailleu & all roads behind & between them.\n\nWe are supposed to be putting over a great deal of gas in cylinders tonight.\n\n \n","8":"\n\nLast night it fell my lot to do gas guard. Sat on a chair in a perfectly dark barn like central part of the hop place, listening to shells for two hours. \n\nThen I went over to the living room & found Baird doing his vigil with a magazine & a solitary lamp. We made some coffee & had a yarn then I returned.\n\nBy then it was half past three & beginning to get light so I strolled round the road, watched \n\nMeteren burning, tried to see where our shells were bursting & generally explored.\n\nAs soon as it was daylight it commenced to rain heavily so I went inside. Then I went down the road & looked over the cottage which is about a quarter of a mile nearer Fletre. A shell had smashed almost a whole side of it, & with the rain dripping outside & half of the inside, the effect was very eerie in the half light with ghostly tappings & drippings. . . .\n\n \n\nThe engineers sleeping in a tunnel next to ours & leading off the same house like part of the hop factory, arose at about 7.30, so I turned in then & slept till breakfast time at 1130, when Walter came & woke me.\n\nNews greeted me that we were to be \nbe\n relieved tonight by 1st Field bearers.\n\nAm packed up ready now, expect to leave in about 3 hours time. Considering the front we are in, we have had a fairly good & fortunate time for the eight days or so. No casualties & not too\n\n \n\nmany wounded ,& splendid living conditions.\n\nArtillery slack this morning. Fritz has put one or two on the road between here & the cottage.\n\nRogers just arrived back from taking orders about relief to the various posts. He has brought back a rumour to the effect that Fritz is supposed to be putting over a barrage at 2.30. It is now 2 p.m.\n","9":"\n\nThe expected barrage of Fritz’s never came off, but we put one over on the left instead. Perhaps that was what the original of the rumour said.\n\nStarted off for Caestre at about 6 p.m. on Tuesday evening, – about a dozen of us – three squads.\n\nUnderstood there was a good cross country track from Fletre & had an idea of taking it to avoid the shelled road. When we were opposite the brewery in a long straggling file ( Long with two\n\n \n\nstraggling kids on the end of strips of bandages for leads) Fritz began to shell the road where we would turn to the right on the main Caestre Meteren road, so we hurriedly decided we would go across country\n\nFound a good track, & soon a couple of Fritz planes came over low flying, with menace of machine gun fire – happily not realised.\n\nDead horses etc. still on the side of the road near Caestre.\n\nReached Castre without\n\n \n\nany shells troubling us. Found church more knocked-about still, & several blocks of houses (including one on the corner opposite church where canteen used to be, where I got milk chocolate for petit Albert at Madame Van ) gutted by fire, so that only blackened shells remained. \n\nA few French privates were hanging around the village, one or two of whom accompanied me in my tour of Madames house They – \"Tout casse” N’est pas bon \n\nl’ Allemande – eh?”, at intervals. Not a thing of value or as a remembrance remained, unless it was a strip of orange silk or suchlike. What shells had failed to spoil the troops had naturally taken, & only rightly too. I fancy that she had got most of the stock away from the shop in time.\n\nRejoined the boys at the chateau near the station, which is A.D.S. Had hot coffee & biscuits in cellar underground, & no sooner finished it\n\n \n\n& up above again than he started putting heavy high explosives into the village.\n\nSome \nwer\n were near enough to send pieces near, but Dickson & I remained above with one or two others until one came too near in the front \nright\n to be pleasant, even though we were at the \nleft\n back. Then I went below, but Darcy Dickson remained round the corner. No sooner was I under cover than with a huge roar followed \n\nby a deafening explosion & a huge shower of dirt & stones, another arrived.\n\nIt fell at the back, a few yards from the building, & within a couple of yards of the horses destined to carry our wagon back.\n\nNeither the horses nor \n the\n Dickson against the wall of the building, was touched. The horses had a miraculous escape.\n\nMany more fell but the other side of the road & shortly Cecil Roger’s squad (\nPaddy Wally\n Blackwell, Rogers, James & Baird,\n\n& Paddy Daley’s squad who were from farther posts & thus later) came breathlessly in. They had been chased from tree to tree at top speed by the shells falling in the village.\n\nCastre will soon be as bad as Ypres for it is a so small that little will be needed to accomplish such an effect compared to the bigger town.\n\nFrom Castre by horse ambulance waggons to Honninghen where the","10":" have transferred the\n\nmain dressing station from Sylvester Capel.\n\nRaining & lack of preparation made arrival miserable, & caused me to address Sergt (rejoined) & incidentally Major Routledge (unwittingly) rather bluntly not to say rudely.\n\nGot a shake down & a cold feed in a barn & slept two nights’ sleep in one, making a good job of it. \n\nSpent yesterday (Wednesday) in cleaning up.\n\nDuring the day he \n\nput over a fair quantity of shrapnel, evidently at a near balloon but was nearer to sprinkling our tents than hitting the balloon. Baird got a hole through his hat & a bump on the head from one.\n\nAbout dusk a few long range shells fell between here & Hazebrouk whose \n twin\n two church spires can be seen on the horizon. A railway here seems to claim Fritzs attention a great deal for he is always shelling either or shrapnel.\n\n \n\nPlanes over in evening but I was asleep before he dropped his bombs thank goodness. None near us.\n\nRoute march & issue of socks this morning.\n\nAfternoon sentries inspection, then I had a bath in the pond & cleaned up generally, preparation to writing a few letters.\n\nNoticed Guards drilling near here while on the march this morning.\n\nBelieve Madame Machine Gun is in Honinghen.\n\nNo news of Madame Van .\n\n \n","11":"\n\nWas on stretcher squad yesterday but did not get more than a few cases. We are only evacuating from the Borre & Strazeele areas now as the English have taken over Castre & Meteren. Our A.D.S. run by the 1st Field Ambulance is at Borre which is being shelled just as badly as Castre I believe.\n\nFrom rumours to official reports I have got clear idea now what happened when the Germans were finally held up here\n\nWhile I was at our division was on the way to the Somme where they stopped (Amiens) for a couple of days.\n\nNo sooner had they had left the northern sector (north of Messines), which was left very thinly held, than the Germans broke through the Portuguese & made their rapid dash on Bailleul.\n\nNeuve Eglise & Bailleul proved to be slight checking places, but after the capture of Ballleul things were very critical indeed\n\non the northern side of the salient they had created.\n\nThereupon the Guards were rushed in at Meteren & Strazeele, while French troops rapidly arrived to take over the dangerous from Bailleul to , where other British troops joined them.\n\nMeteren & Strazeele however, being the nearest point \non the\nto Hazebrouk which was the first objective of Fritz, were the most important points. Thus the Guards were picked to defend them, with\n\n \n\ninstructions to hold on anyhow for 24 hours when the Australians ( our division hurrying back from the Somme) would relieve them.\n\nFritz attacked again & again, & as the fighting was all open it soon resolved itself into isolated groups of combatants. Many an isolated groups of Guards fought on until machine gun ammunition was exhausted, & the men thus annihilated.\n\nOne can picture what this country must have been like during those \n\nfateful hours. Now, although it is still semi open warfare, there is order & the shelling is more or less regular; but for a day & a night, with German rifles & machine guns bunking in farm houses & sweeping the half back areas such as that between Castre & Fletre, it must have been terrible. Not to mention the bloody & sweating battles fought out in the high green fields of crops, with hedges as cover.\n\nThere was one particularly\n\n \n\nhot piece of close fighting when the Germans first captured Meteren.\n\nAt a time when I was on my way back from Harve to the line, the division arrived back from the Somme via St Pol to Hazebrouck. It was bombed at Amiens, bombed at St Pol, shelled at Hazebrouck where it detrained, & then sent straight into the line. It went in one night on the Strazeele Nieppe front line, in open order. Shortly they advanced meeting groups of wounded\n\n \n\nGuards, through remnants of \nisolated\n battalions & accidentally isolated Germans, till it had left all our troops behind & nothing lay ahead but enemies.\n\nSoon the advance guard ran into the main German body at a \nfew\n hundred yards or less distance, & planes went up & machine guns constantly rattled out. In very quick time our boys dug themselves in & by the following night had established a holdable line of defence.\n\nMeanwhile the sorely tried Guards were relieved, & they are still here near us drilling up on their old style & polishing their buttons in great style- \n\nSince our division came in it has shifted its actual sector two or three times, & has of course gradually restructured its line from the first lengthy one. Good trenches have been \n put\n dug up not only in the forward area, but behind Dug Outs have begun to appear in parts of the forward area, & many lines of \n\ndefence have appeared between the front & as far back as St Omer.\n","12":"\n\nService yesterday morning by Major Makeham chaplain of 3rd Brigade . Curiously enough he was the man to whom a note of recommendation by Bishop Long of Bathurst had been sent on my behalf. \n\nAn oldish man (56 years) he is an old naval chaplain. Shortly going to return to England to take over Chaplain in Chief at Tidworth and later\n\nLondon. \n\nDuring his sermon on Ascension Day he made very definite statements regarding a Heaven which is not far away, but a spirit world all round us. I felt it very keenly in the bright spring sunshine, despite the warlike appearance of two bulging observation balloons & the shells bursting a few hundred yards away.\n\nThe fact we are simply material flesh & blood actuated by personalities is very clear to me now. When one does the personality survives & becomes a member of the spirit world.\n\n \n\nWhile one lives one can get communication with the spirit world & the Master by prayer. That minds should be able to communicate with each other with no outward physical body such as we understand it is not by any means a far fetched idea once one understands the first rules of philosophy, & the amazing harmonious of earthly outlook. \n\nAfternoon – cricket match which is becoming quite a regular thing. Our team played played A.S.C. but were defeated. afternoon\n\n \n\nthey obtained a sweeping victory over the","13":" Batt however. On that occasion I helped serve out the tea biscuits & eatables to the Lancashire band & the cricketers.\n\nI have been practising bowling a fair bit & improving the batting, but our team is far too good for any immediate chance of my playing.\n\nChurch in evening with address by D’Arcy Dickson. His subject was sin & its reward as instanced by Naaman’s looting of the \n\nBabylonish garment & the silver & gold. He treated the abstract part well, but I think he paid too much attention to getting a vivid picture of the ancient event & not enough attention to the modern practical application He is tremendously earnest & \nhowever\nessentially a man, with no sense of fear whatever.\n\nBeer appeared in the canteen in the afternoon & the rougher part of B section in our marque proceeded to cart the bottles over in stretcher loads & make beasts of themselves.\n\n \n\nEvery one of this crowd is strong & burly, & the right class of stretcher bearer. Many have been through nearly all the big stunts in France, including the heaviest of barrages & are undoubtable game. For me \nwho\n not having done what they have done, & being above all of a very mild disposition compared with them, they have \nthe\n a certain contempt with a little admiration for my brain.\n\nNotwithstanding the fact that physically, I should probably crack up early in a continuous stunt, is this\n\n \n\ncontempt justified?\n\nPersonally I think not, for I am sure I have no more fear than they, although it would be absolutely impossible for me to do the work they could. Have I not justified my manhood by ! To such as Vic Hall, Walter Hynes & & myself, this job is far more formidable than to these. Yet their attitude is that the ones who shine at \ncricket\n football, get drunk whenever opportunity offers, never appear without mentioning \"bastard” & & a few other choice oaths &\n\n \n\nare built for hard graft, are the \"men”, while those who think more & are only able to perform in a secondary way at sport are weaklings.\n\nThe position is interesting & provides food for thought, for above all they are needed these days.\n\nArgument with Sep Paile (the Staff Sergeant dispenser with whom I used to make trench foot powder at ) on the \nrespective merits of\n conscription aspect of democracy. He thinks conscription is undemocratic, & as I think it is justifiable to force \n\npeople to be democratic. He argues very badly.\n\nSgt Behan chipped in when we half revived the argument in the middle of the parade ground as dusk was falling.\n\nC section bearers returned from the line just before lights out, & Arthur Evers came into the tent & told me of letters received from England, & promised to have a talk in the morning (this morning).\n\nMany Fritz planes over, & that combined with boozer’s supper party & internal pains.\n\n \n\nkept me late awake, but by concentrating my thoughts on elevating topics I was asleep before bombs were dropped. One fell fairly near, but there was no danger to speak of.\n\nFritz has had his daily shell today, mostly concussion H.E. & a little nearer us, but nothing to worry about.\n\nThe noisy crowd held a lesson in bomb throwing in the tent at about 1.30 this morning accompanied with taking the pin out, - a rather dangerous proceeding for drunks; & then \n\nbombed the pond for fish.\n\nArthur brought me some letters this morning & showed me some responses to some nice things I had been saying about him (merely truth if I remember rightly) by his cousin who gained it from the . Also there were references of a complementary nature both to him & me.\n\nHe told me all about the line up at Strazeele & Bone, & it seems even better than Meteren.\n\nStrazeele & are smashed almost beyond recognition, & Bone is being\n\nconsistently shelled.\n\nArthur is really in A section but he went up with a mobile squad this time.\n\nFreddy Grey was in for Vic Hall’s group, & served up a four course dinner one day! Vic Hall was chef\n","14":"\n\nYesterday changed leather equipment for web \nleather\n & doing a ","15":"\n latrine in morning.\n\nWarned for guard in afternoon, & as the best dressed man gets off, spent the hours after tea in cleaning up. Letter & diary in afternoon.\n\nWainwright of my squad, who is a short tempered crotchety, eccentric slightly unhinged chap, untidy & against most in authority caused great amusement by scoring a new pair\n\nof slacks & cleaning up first class. He did not get off, although for the work he did in getting ready he should have done. A chap lucky enough to have new clothes & who made the most of them, got off.\n\nSince I had a plain home talk with Wainwright up the line he has been very affable with me, & this incident of cleaning up for guard marked a turning point \nin his\n ( or what looks like one) in his army career. \n\nMy shift was from 10\n\n \n\nto 2 a.m, & considering that Fritz started bombing in fine fashion at 9 p.m. & did not finish till about 11-45, I had a fairly exciting \nbeat\n time.\n\nIt was interesting to watch the large number of searchlights at work, especially when they got a Fritz plane in the search light. None was brought down, but some were made to drop their bombs rather hurriedly.\n\nA few light bombs were dropped near, & the dirt & pieces from one\n\n \n\n \n\ndropped in the camp, but not much risk was run.\n\nI noticed that a plane was at its most dangerous position from the point of view of watchers from the ground, when it is at an angle of 45° to 60° in & moving towards one. The bombs apparently drop something like this\n","16":"\n","17":"\n\nThe principal events of the past three days have been in the shape of extra work & increased heat, & these are bound up in each other.\n\nThe weather has suddenly become warmer then hot. One wakes up after a heavy dead\n\n sleep, (which the northern warmth always brings & not the Australian heat) to promise of a hot day in the warm haze. Unusual heat in the morning & midday keeps ones mind occupied with the thought of the discomfort\n\n \n\nof energy. It requires an effort to wash ones .\n\nIn the afternoon a slight reduction in heat & the advent of a slight breeze awakens memories of hours of pre war pleasures. My mind wanders first to the Thames, Hampton Court, Putney etc. others to Grafton in summer, long walks with Rita - South Grafton with heat & dusty roads but pleasurable walks. Ice cream & lazy hours with Rita claim my thoughts, for the country here brings such thoughts to ones mind. There are\n\n \n\nhedges high & green; \nN\n neat trees short & tall in full foliage, & the field is covered with buttercups!\n\nIt makes me long to be back with Rita more than I have longed before unless it was at Dorrigo.\n\nCricket claims attention most afternoons, but for the past two or three days we have worked all day. The cricket pitch is in front of one line of four marquees & enclosed in the \nindecipherable\n rectangle formed by this line & a line of bell tents. The facetious remarks by the bearers directed at the transport\n\n \n\nthis afternoon were very amusing, especially in the case of one individual in a dilapidated officers tunic.\n\nThe increased work is are a result of increased air activity lately, & the promise of more with the just beginning. We have put protection of clods of earth round our own tents, round the officer’s tents, & lastly (a heartbreaking job), enclosed the horse lines \nindecipherable\n with earth walls about four feet high. All for protection against bombs.\n\nI saw the hole of the \n\n \n\nsupposed dud or light bomb which fell near on the night I was on guard, & saw the reason for the small amount noise, yet the splattering of dirt over the chaps near me a quarter of a mile from the explosion..\n\nThe explanation is that it made a hole quite 20 feet deep! Such a hole I have never seen before from an aerial bomb. It must have been a time fuse aerial torpedo. \n\nLife here would be about ideal but for the anxiety of the future. From\n\nindications I should judge that we will be in the line till Fritz has finished his push. Any day he may commence, & that he will push us is as certain as can be. Therefore I think that this soft time will be followed by an unusually severe one. He will not cease trying til all means have been exhausted, & though he may not commence here, it is certain that he will try here sooner or later for Hazebrouk & the coast.\n\nI suppose, provided we hold him in, things will be \n\nfar brighter when he has tried & failed .\n\nHave been experimenting in telepathy every evening with Vic Hall, with very encouraging results. I am surprised at what we have achieved as a beginning. On at least two occasions, a direct thought has been almost fully transmitted when no indication of its nature & not the slightest help was given. \n","18":"\n\nSince Sunday there has been nothing of special interest to report, except for an air raid, & also some specially good results at telepathy. \n\nOne of the latter must be mentioned here for it represents our first real transference of a complete image.\n\nBert Emmott & I concentrated on a large figure of the following design\n\nThis is what Vic Hall received & drew before seeing our drawing. (It shows where two can cause an overlapping of the double as it were.\n\nI am now living in a bivouac constructed of two stretchers for roof & waterproof sheets; the whole suspended on wooden sticks. He built it & then me in, but sundry \n\n \n\nimprovements were needed after that. Dangerous of heavy weights on thin stumps, & faulty supports. Then a protection for splinters from bombs was reinforced each side, & that has been completed today, with the addition of a drain.\n\nBert Emmott is the third & latest arrival in this little abode, & we are remarkably well asorted . we are each earnest Christians.\n\nBert Emmott the most\n\n \n\nstrong,- & each in his own way probers after truth. I suppose Vic Hall & I are more in harmony intellectually, but spiritually we are all remarkably in affinity which perhaps explains the good results we got from telepathy experiments last night referred to above. \n","19":"\n\nAm on guard to night, & although I cleaned up with great display of energy, failed to get off.\n\nKneeling in the grass at the cross roads writing this up by the light of the lantern I use to signal traffic along the by- road leading past our farm.\n\nVery cool wind blowing in great contrast to the heat of late.\n\nAll quiet & calm.\n\nFull moon, & horizon lit from time to time with\n\nflash of guns, ours here now there. Shrapnel bursting high in the air away towards the line.\n","20":"\n\nVery inspiring time during that 10 p.m. to 2 a.m. shift on guard. Clear moon, just surmounting a bank of clouds grey with white ridge.\n\nThese clouds were the beginning of a great change in the weather. Early evening was just warm & in keeping with the perfect weather of late. As I went off at 2 a.m.\n\nclouds had obscured the moon & most of the sky, & it was beginning to show signs of raining. When I awoke at 7 a.m. it was to find Vic adjusting a mackintosh over my feet that were getting the benefit of a little blown in rain from the open end of the bivouac. Bert Emmott was saying \nthat\n \"Is there anywhere else that it is dripping on Ol.? Vic brought me some tea & a bacon sandwich & I dozed on until it was time to resume the beat at 8 oclock. Then I had a two hours\n\n \n\nspell of cold wind & rain which eased with characteristic contrariness when I went off at 10. \n\nRained fairly heavily again at dinner time but in the afternoon cleared up sufficiently for us to remove sundry \"acquired \" sheets of corrugated iron which we had put in the roof to make certain of dryness & combat sundry monor leaks. It stood the weather magnificently.\n\nYesterday evening we put over a fair amount of gas, & this morning\n\n \n\none of two cases who had been caught by a shell falling short very far forward, told us that Fritz must have had a deadly time. \n\nStill cool today, but the sun shone. This evening there is threatening of rain. \n\nOn Wednesday night & Thursday night we made a new departure in the psychic department. Vic had heard that Scotty Lane of the dental was a spiritualist, & his wife a medium, so that the four of us met in the shed adjoining the bivouac for \n\n \n\n \n\na preliminary chat on Wednesday night. Scotty held the floor mostly, & I gained the idea, subsequently confirmed, that his knowledge is all concrete or as one might call it, practical. The only books he has read on the subject appear to be the text books of spiritualist societies. He has since lent me a publication entitled \"Reason”, & published regularly in a small American bush or cowboy town. This seems to take up a position of absolute belief in communication with the dead. & is as \n\npositive as any of the Christian Churches.\n\nHis talk on Wednesday dealt with his experiences, & described his control on friendly spirits & Voda, & his wife’s - \"The Chief”. He is not a close reasoner & appears to me to be too credulous while is not lacking in protestations of not absolutely eliminating the possibilities of subconscious mind workings.\n\nThursday’s experience I must leave till tomorrow as it is now almost dark.\n\n \n","21":"\n\nOn Thursday night we had a little of alleged messages, & a little hypnotism. \n\nScotty Haine, who again held most of the conversation, is a gruff Scotsman with swarthy face & iron grey hair (although still young), & rather penetrating eyes. By appearance he seems of rather a commanding personality until one gets to know him & then – one gets the impression that his personality is not large enough to fill the body made for it. He seems a little worn out, & apart from that, not of a very brilliant intelligence \n\nI have mentioned his credulity which will be exemplified in what follows. He has also, a little trick of repeating little parenthetical sentences ad lib, forgetting that the rather unimportant point referred to be made is in danger of being unduly brought forward. Thus in referring to his wife he hardly mentions her in connection with any episode but \nwhich\n he adds \"My fiancée which she was then” or \"of course she was my fiancée at that time”, or \"my wife or fiancée as she then was”.\n\n "}}