{"Document Name":{"0":"Diary_0397","1":"Diary_0397","2":"Diary_0397","3":"Diary_0397","4":"Diary_0397","5":"Diary_0397","6":"Diary_0397","7":"Diary_0397","8":"Diary_0397","9":"Diary_0397","10":"Diary_0397","11":"Diary_0397","12":"Diary_0397","13":"Diary_0397","14":"Diary_0397","15":"Diary_0397","16":"Diary_0397","17":"Diary_0397","18":"Diary_0397","19":"Diary_0397","20":"Diary_0397","21":"Diary_0397","22":"Diary_0397","23":"Diary_0397","24":"Diary_0397","25":"Diary_0397","26":"Diary_0397","27":"Diary_0397","28":"Diary_0397","29":"Diary_0397","30":"Diary_0397","31":"Diary_0397","32":"Diary_0397","33":"Diary_0397","34":"Diary_0397","35":"Diary_0397","36":"Diary_0397","37":"Diary_0397","38":"Diary_0397","39":"Diary_0397","40":"Diary_0397","41":"Diary_0397","42":"Diary_0397","43":"Diary_0397","44":"Diary_0397","45":"Diary_0397","46":"Diary_0397","47":"Diary_0397","48":"Diary_0397","49":"Diary_0397","50":"Diary_0397","51":"Diary_0397","52":"Diary_0397","53":"Diary_0397","54":"Diary_0397","55":"Diary_0397","56":"Diary_0397","57":"Diary_0397","58":"Diary_0397","59":"Diary_0397","60":"Diary_0397","61":"Diary_0397","62":"Diary_0397","63":"Diary_0397","64":"Diary_0397","65":"Diary_0397","66":"Diary_0397","67":"Diary_0397","68":"Diary_0397","69":"Diary_0397","70":"Diary_0397","71":"Diary_0397","72":"Diary_0397","73":"Diary_0397","74":"Diary_0397","75":"Diary_0397","76":"Diary_0397","77":"Diary_0397","78":"Diary_0397","79":"Diary_0397","80":"Diary_0397","81":"Diary_0397","82":"Diary_0397","83":"Diary_0397","84":"Diary_0397","85":"Diary_0397","86":"Diary_0397","87":"Diary_0397","88":"Diary_0397","89":"Diary_0397","90":"Diary_0397","91":"Diary_0397","92":"Diary_0397","93":"Diary_0397","94":"Diary_0397","95":"Diary_0397","96":"Diary_0397","97":"Diary_0397","98":"Diary_0397","99":"Diary_0397","100":"Diary_0397","101":"Diary_0397","102":"Diary_0397","103":"Diary_0397","104":"Diary_0397","105":"Diary_0397","106":"Diary_0397","107":"Diary_0397","108":"Diary_0397","109":"Diary_0397","110":"Diary_0397","111":"Diary_0397","112":"Diary_0397","113":"Diary_0397","114":"Diary_0397","115":"Diary_0397","116":"Diary_0397","117":"Diary_0397","118":"Diary_0397","119":"Diary_0397","120":"Diary_0397","121":"Diary_0397","122":"Diary_0397","123":"Diary_0397","124":"Diary_0397","125":"Diary_0397","126":"Diary_0397","127":"Diary_0397","128":"Diary_0397","129":"Diary_0397","130":"Diary_0397","131":"Diary_0397","132":"Diary_0397","133":"Diary_0397","134":"Diary_0397","135":"Diary_0397","136":"Diary_0397","137":"Diary_0397","138":"Diary_0397","139":"Diary_0397","140":"Diary_0397","141":"Diary_0397","142":"Diary_0397","143":"Diary_0397","144":"Diary_0397","145":"Diary_0397","146":"Diary_0397","147":"Diary_0397","148":"Diary_0397","149":"Diary_0397","150":"Diary_0397","151":"Diary_0397","152":"Diary_0397","153":"Diary_0397","154":"Diary_0397","155":"Diary_0397","156":"Diary_0397","157":"Diary_0397","158":"Diary_0397","159":"Diary_0397","160":"Diary_0397","161":"Diary_0397","162":"Diary_0397","163":"Diary_0397","164":"Diary_0397","165":"Diary_0397","166":"Diary_0397","167":"Diary_0397","168":"Diary_0397","169":"Diary_0397","170":"Diary_0397","171":"Diary_0397","172":"Diary_0397","173":"Diary_0397","174":"Diary_0397","175":"Diary_0397","176":"Diary_0397","177":"Diary_0397","178":"Diary_0397","179":"Diary_0397","180":"Diary_0397","181":"Diary_0397","182":"Diary_0397","183":"Diary_0397","184":"Diary_0397","185":"Diary_0397","186":"Diary_0397","187":"Diary_0397","188":"Diary_0397","189":"Diary_0397","190":"Diary_0397","191":"Diary_0397","192":"Diary_0397","193":"Diary_0397","194":"Diary_0397","195":"Diary_0397","196":"Diary_0397","197":"Diary_0397","198":"Diary_0397","199":"Diary_0397","200":"Diary_0397","201":"Diary_0397","202":"Diary_0397","203":"Diary_0397","204":"Diary_0397","205":"Diary_0397","206":"Diary_0397","207":"Diary_0397","208":"Diary_0397","209":"Diary_0397","210":"Diary_0397","211":"Diary_0397","212":"Diary_0397","213":"Diary_0397","214":"Diary_0397","215":"Diary_0397","216":"Diary_0397","217":"Diary_0397","218":"Diary_0397","219":"Diary_0397","220":"Diary_0397","221":"Diary_0397","222":"Diary_0397","223":"Diary_0397","224":"Diary_0397","225":"Diary_0397","226":"Diary_0397","227":"Diary_0397","228":"Diary_0397","229":"Diary_0397","230":"Diary_0397","231":"Diary_0397","232":"Diary_0397","233":"Diary_0397","234":"Diary_0397"},"Date":{"0":"unknown","1":1113.0,"2":1114.0,"3":1116.0,"4":1117.0,"5":1118.0,"6":1119.0,"7":1120.0,"8":1121.0,"9":1122.0,"10":1123.0,"11":1124.0,"12":1125.0,"13":1126.0,"14":1127.0,"15":1128.0,"16":1129.0,"17":1130.0,"18":1131.0,"19":1132.0,"20":1133.0,"21":1134.0,"22":1135.0,"23":1136.0,"24":1137.0,"25":1138.0,"26":1139.0,"27":1140.0,"28":1141.0,"29":1142.0,"30":1143.0,"31":1144.0,"32":1145.0,"33":1146.0,"34":1147.0,"35":1148.0,"36":1149.0,"37":1150.0,"38":1151.0,"39":1152.0,"40":1153.0,"41":1154.0,"42":1155.0,"43":1156.0,"44":1157.0,"45":1158.0,"46":1159.0,"47":1160.0,"48":1161.0,"49":1162.0,"50":1163.0,"51":1165.0,"52":1166.0,"53":1167.0,"54":1168.0,"55":1169.0,"56":1170.0,"57":1171.0,"58":1172.0,"59":1173.0,"60":1174.0,"61":1178.0,"62":1179.0,"63":1180.0,"64":1181.0,"65":1182.0,"66":1183.0,"67":1184.0,"68":1185.0,"69":1186.0,"70":1187.0,"71":1188.0,"72":1189.0,"73":1190.0,"74":1191.0,"75":1192.0,"76":1193.0,"77":1194.0,"78":1195.0,"79":1196.0,"80":1197.0,"81":1198.0,"82":1199.0,"83":1200.0,"84":1201.0,"85":1202.0,"86":1203.0,"87":1204.0,"88":1205.0,"89":1206.0,"90":1207.0,"91":1208.0,"92":1209.0,"93":1210.0,"94":1211.0,"95":1212.0,"96":1217.0,"97":1223.0,"98":1230.0,"99":1231.0,"100":1233.0,"101":1234.0,"102":1259.0,"103":1260.0,"104":1262.0,"105":1265.0,"106":1266.0,"107":1267.0,"108":1268.0,"109":1269.0,"110":1272.0,"111":1275.0,"112":1276.0,"113":1278.0,"114":1283.0,"115":1287.0,"116":1288.0,"117":1289.0,"118":1310.0,"119":1312.0,"120":1315.0,"121":1320.0,"122":1328.0,"123":1334.0,"124":1335.0,"125":1336.0,"126":1340.0,"127":1341.0,"128":1342.0,"129":1343.0,"130":1344.0,"131":1345.0,"132":1354.0,"133":1369.0,"134":1383.0,"135":1386.0,"136":1389.0,"137":1391.0,"138":1392.0,"139":1397.0,"140":1398.0,"141":1399.0,"142":1400.0,"143":1403.0,"144":1404.0,"145":1405.0,"146":1406.0,"147":1408.0,"148":1409.0,"149":1410.0,"150":1411.0,"151":1412.0,"152":1413.0,"153":1414.0,"154":1415.0,"155":1416.0,"156":1417.0,"157":1418.0,"158":1420.0,"159":1421.0,"160":1423.0,"161":1424.0,"162":1425.0,"163":1431.0,"164":1445.0,"165":1459.0,"166":1462.0,"167":1463.0,"168":1468.0,"169":1469.0,"170":1488.0,"171":1489.0,"172":1490.0,"173":1494.0,"174":1501.0,"175":1506.0,"176":1507.0,"177":1508.0,"178":1516.0,"179":1518.0,"180":1535.0,"181":1536.0,"182":1550.0,"183":1677.0,"184":1704.0,"185":1705.0,"186":1708.0,"187":1710.0,"188":1711.0,"189":1712.0,"190":1713.0,"191":1714.0,"192":1734.0,"193":1747.0,"194":1753.0,"195":1759.0,"196":1762.0,"197":1763.0,"198":1764.0,"199":1765.0,"200":1767.0,"201":1768.0,"202":1769.0,"203":1770.0,"204":1772.0,"205":1773.0,"206":1774.0,"207":1775.0,"208":1776.0,"209":1778.0,"210":1779.0,"211":1780.0,"212":1781.0,"213":1782.0,"214":1783.0,"215":1784.0,"216":1785.0,"217":1787.0,"218":1789.0,"219":1801.0,"220":1802.0,"221":1803.0,"222":1808.0,"223":1814.0,"224":1823.0,"225":1824.0,"226":1825.0,"227":1826.0,"228":1827.0,"229":1831.0,"230":1832.0,"231":1861.0,"232":1862.0,"233":1871.0,"234":1893.0},"Entry":{"0":"\n","1":" Left Waterloo station at 4 pm arriving Southampton at 7 pm. Embarked on\" “ right away and left for Le Havre at 11 pm. Gee! it was rough! The ship tossed like an eggshell & practically everyone was sick.\n","2":" Disembarked at 8 pm & marched round to rest camp. Stayed here all day. Very cold.\n\n31st Left Rest Camp at 4.30 am for train on which we embarked at 5.45 am. Train left Station at 7am . What a tiresome journey arrived in Albert at 3 am on","3":" Marched to house in which I was living prior to leaving for Blighty and turned in. About 8 am I was awakened and given a delightful surprise-\n\nI was informed that I had been awarded the Military Medal. The dispatch read-“for good work done under fire\"etc.\n","4":" Cold though there is no rain. We leave for Ribeinout tomorrow.\n","5":" Slight drizzle of rain. Left Albert about1 pm. After walking slowly we reached Buerre about 3.45 pm. Here we were informed that no billets were available in Ribeinout. So we had to stay the night in Buerre.\n","6":" Raining & miserable. Nothing definite known as to our movements, though I believe we shall form the Pack Train here. Of course there is the usual percentage\n\nof mud, though it is nothing to what we experienced while at Montaubau.\n","7":" Raining sent to Ribeinout met Bert Duschbuny(k) Lieutentant.\n","8":" Struck camp 9am & and left for Montaubau about noon & called into Pioneer Battalion at Mainetz. Here I was met & congratulated on my decoration by adjutant Lewis Gaudie & Lieut. Minefield. They toasted my health & I was presented with my card of Congratulation from General Cox & handed my medal ribbon.\n\nAfter lunch I went on to Montaubau where I sunk knee deep in mud. The\n\nPack Troop had not yet arrived so I went to the observation Station & saw Reg Mastuson (Lieut) I then returned to Montaubau, but as the accommodation was bad & and it was fast becoming dark I decided to return to the Observation Station & stay till morning when I would have a day in which to make a Suitable dug out.\n","9":" Raining. Returned to Montaubau. Everything is in undescribably chaos. Hard work all day to get things in order. Convoy blown up 1 man killed. 4 wounded. 2 seriously. 7 mules killed. Certainly a bad start. Still we hope for better results later on.\n","10":" As per usual raining. Plenty to do, to get camp in order. Convey returned safely, though many animals were bogged in shell holes.\n","11":" Raining & intolerably cold. More men march in. Fritz was very quiet all day as were our artillery. No casualties. 8pm our artillery is going some. Gee I shall be glad when this show is finished, though I am of firm opinion that it will end by June. \n","12":" Very cold, but fine. While convoy was going to Flers, a German flew over our line in a captured British plane. However he did no damage. Our artillery opened out a bombardment about 8 pm\n","13":" About 8 am Fritz greeted us with a repetition of Nov 23rd. Gee! He did sock it in. Still I stayed in bed for it was too cold & muddy outside Ha Ha. No casualties however.\n\nAbout 11 am it started snowing.\n","14":" Cold and raining. Fritz was fairly lively to day, sending over high explosive. 1Convey was hit & several men were wounded.\n","15":" Snowing. Things were very quiet all day, tho, our artillery was active during the night.\n","16":" Snowing & miserable. Conveys reached their destination & returned home OK. Fritz sends over a few shells during the night. Too close to be pleasant\n","17":" Very cold. Freezing . Once more the ground is hardening through. Gee! it is cold. Fritz was fairly quiet as far as his artillery was concerned, but about midnight he made a raid on our trenches near Flers. It was a “washout\", he was “knocked back\",“Bravo Tommy Australia\"\n","18":" Still freezing. Fritz sent in a few shells but did no material damage in or vicinity. No casualties in our troops. Gee! but it is cold. ","19":" X)\n\n17th how beautiful the place looks this morning! It snowed heavily during the night & the ground it covered with about a foot of snow.\n\nCertainly beautiful but what danger lies beneath that\n\n \n\nWhite mantle!! During the day snow ball fights took place in plenty- anything to relieve the monotony of life in the Army. Our convoys had rather a rough time tonight. The snow had obliterated our tracks & consequently men were riding into shell holes. It was one of the most difficult journeys our chaps have done. Still they got there.\n","20":" Still snowing tho lightly. Fritz is still lively, but is doing us very little harm. Convoy has another rough time.\n","21":" freezing. Gee! but it is cold. Fritz sent a few shells over about 7pm.Gee! hear them whistle!\n","22":" Fritz sent a few shells into\n\nthe Camp at an early hour. They sang fairly close but as they did not touch me I fell off to sleep again. It is still freezing & hell how cold it is. Great things are expected of the forth coming Spring. The British hope to completely crush Germany. Tanks are in galore. They are much faster than the first ones & much more deadly. Cavalry are to be in readiness & from all reports we shall have Fritz on the run very soon.\n\n Of course we are doing nothing now but hanging onto our captured positions, but there’s going to be a scatter as soon as the fine weather starts. I am more confident than ever that the war will be over by\n\nJune. Every man in the whole of the British Army will cry with their joy when the war is over. That is the present feeling (it has been so for some time) of the men in France. That we are confident of victory goes without saying, yet as I have said, we shall all be glad when it is all over. Our convey was blown up last night 2 men killed & wounded also several animals also killed.\n","23":" Cold, snow is fading slightly- nothing much doing except for the usual shells from Fritz.\n","24":" Cold. Fritz was very quiet all day but rocked the shell in about 9 pm. I don’t know what damage\n\nwas done but I guess someone was hurt. During the night it froze hard & next day","25":" we experienced the coldest weather we have ever had. It was impossible to keep warm. The sun came out for a few hours (the moon in Australia is warmer than that) and Fritz sent a few taubes over.\n\nGee how our anti aircraft guns rocked them home to him. One came down to earth a mass of flame. Still that did not deter the Huns for several other taubes came over. However these were driven back- 5pm. It is freezing to same order. Fritz sent a few shells among us\n\nabout 8pm.\n","26":" Cold and miserable at 12 noon I went out to Flers where I worked walking tracks over which the mules could walk. The road, which was under water during the wet weather is now solid sheet of ice & although it is strong enough to bear the weight of an animal, it is impossible to walk on it owing to the slippery nature . Fritz was shelling fairly heavily around us but no one was hurt. One of our 18 powder guns had a premature burst blowing half the barrel of the gun within 20 yards of where we were working. Returned to camp OK. Freezing all night\n","27":" as yesterday. Dammed cold. Fritz makes thing lively about noon sending some big shells fairly close- apart from that everything was quiet.\n","28":" Cold & bleak. Artillery fairly active. Nothing much doing.\n","29":" I was awakened about 4 am & I was very forcibly reminded of","30":" last. Same bombardment was in progress. Fritz’s lines were shelled continuously for 2 hours. A charge was made which resulted in many prisoners being taken. This was done by Welsh Fusiliers of the famous","31":" (Gallipoli) Division.\n\n28th Still freezing. Our artillery is still very active. Nothing much to note.\n\n29th Cold & miserable. A little snow is falling. Fritz sends over a few shells.\n","32":" Nothing doing. Snowing slightly.\n","33":" This is indeed a beautiful day. The sun is shining. Gee! how I wish this dammed war was finished. Life at present is but an existence.\n","34":" Cold and miserable. Our artillery still going strong. 15th Battalion “hop over\" tonight 7.30pm. Our artillery open up a barrage lasting about one hour. 8pm 15 Battalion go over-God be with them! \n","35":" 15th Battalion lost the \n\nposition won by them last night. At 5am 80 Germans were captured but we lost 100. Perhaps that will teach the authorities to give the Australians a spell. \n\nLively artillery all night.\n","36":" Cold. Heavy artillery engagements in the Perromme region. Everyone is really interested in the new Policy of the German’s- submarine blockade. I reckon the German chancellor is right when he says that Great Britain is not attempting to obtain peace. Perhaps this blockade will hasten the end. I hope so for I (as well as millions of others) are heartily fed up.\n","37":" Cold. Transport Troop disbands tomorrow and all men will return to their respective units. About dinner time I secured 2 gallons of rum and Bill Cahill, Doug Gordon, Sid Dave(HB) Hay & myself “hogged “ into it. Gee! what a “large night\". Dave thought he was Robinson Crusoe & Sampson HaHa ! What a night. About 8pm (I was ok by then) the artillery opened up a terrific barrage. The 13th Battalion were “hopping over\" to try and recapture the portion won and lost by the15th Bat. all night long & up till 7am \n","38":" the artillery kept going. The 13th Battalion captured the position. Fritz counter attacked\n\nbut was driven off by the 13th with hand grenades.\n\nMarched out to Pioneer Battallion & reported for duty at 2pm\n","39":" Very cold and windy. Rode to head quarters 4th Pioneer Btn. Things were very quiet all day. About 8pm we were warned to keep our gas helmets handy as it was anticipated that Fritz would send gas over. Anyhow he didn’t. So that was all right.\n","40":" Cold & windy. About 6 German planes flew over us this morning dropping bombs. Of course our anti-aircraft guns “has a go\" at them but missed. Oh Yes! Britain commands the air & sea- I.D.T.\n","41":" Still cold & windy. Today I submitted my name as a candidate for the Cadet officers\n\nTraining School. Moorefield recommended me, and I also received a letter of recommendation from Captain C.R.Walsh 7th aasc. Unluckily I have missed this months school, so shall not (providing I am accepted) go for another month. I hope I do go & am successful for more reasons than one. Very quiet except for the usual artillery duels.\n","42":" Cold & windy. Heavy artillery bombardment during the night. Fritz planes came over.\n","43":" This morning I was informed that the major wished to see me accordingly I rode to Head Quarters & interviewed him. He asked my reasons for submitting the application, also if I was getting a bad time from Moorefield. I said “yes\" so he said he would interview Moorefield\n\nAt the same time saying he would do whatever he could to send me to the School. Gee! I hope it comes off!!\n","44":" Cold and clear. Have aeroplanes up and over our camp. Fritz sent over some big shells about 5pm. Wounding several and killing 2 men. Billie Walsh came over.\n","45":" Cold & misty. Slight shower of snow falling.\n","46":" The sun is shining today & the frost on the ground has melted leaving small pools of water. Once again we experienced mud. Taubes up but no damage done. Artillery active.\n","47":" Once again the sun shines which of course makes things seem more cheerful.\n\nAt night Bill, Dick, Mac & I\n\nrevived some of the old songs to keep our spirits up. This wave is beginning to tell very heavily on us. One & all are heartily sick of it. Besides there is no fair play. A chap does not get a “square deal\". Here I am kept under on account of a difference I had with my O.C. That is not the action of a man. From what I can learn I stand Buckley’s chance of getting away to that School.\n","48":" Cold, though the sun is shining. Several taubes flew above the camp & though they dropped bombs none fell on us.\n","49":" Dull. About 6.45am a terrific explosion occurred. Fritz had dropped\n\nbombs on an ammunition dump. For 5 hours it continued to explode & splutter sending flames hundreds of feet in the air. Certainly a victory to Fritz. In all 3 million pounds damage (approx) was done. Another proof that Britain Commands the air!? During the day it started to rain making the ground as muddy as before.\n","50":" Dull. Things are very quiet. Slight showers of rain. Gee! How miserable everything seems. The ground has now reverted to its previous state. I prefer the intense cold to mud anytime. Fritz sends over a few shells to let us know he is still playing.\n","51":" Still miserable and wet.\n\nGee! how full I am of the whole business. Nothing further has been heard of my application. Fritz was fairly lively during the day sending over 8.2\n","52":" Hell! How wet it is. On such a day as this, all would like to stay in bed & read. But there are no such things as naps in the Army. Into the mud we splash Oh Yes! France is sane place in the winter, I don’t think. About 8 pm Fritz sent about 10 shells over- by the sound of them they were winner piercing. Gee! some poor beggar gone to Paradise.\n\n@1st Same as yesterday. Muddy & raining. Fritz left us alone all day. They say we are moving out of the line on","53":"\n","54":" Miserable & wet. Heavy mist encircles the Camp. Business is very quiet except for an occasional shell.\n","55":" Misty & wet. The ground is fast becoming a sea of mud. Every day we sink deeper as we walk. A peculiar fit of depression & came over me tonight and I would have given anything to have been in London or some big city. There is talk of a move soon. Gee! How glad I shall be to get away from this confounded hole.\n","56":" Heavy mist. Sent to Meaulte with convoy. Here I met Geo. Tobson with whom I had a talk. Returned to Mauretzabout 3pm. Very quiet.\n","57":" Misty & cold. It is starting to freeze & if it continues the ground will soon become hard. Bill Cahill held a consultation & made a \n\nPlan whereby Bapaume could be captured easily by the Pioneer Transport-minus of course several brave members-R.B. & oths.\n","58":" Very mild. Most of the 4th Div infantry are moving out of this line. Dawn reconescense has it that Fritz has evacuated his trenches and retreated for a couple of miles. Still his shells continue to come over. About 8pm our artillery opened out a bombardment of Fritz’s line which lasted long after midnight.\n","59":" Cool & misty. Business is very quiet but during the night our guns opened out. Fritz has not returned so far.\n","60":" Cool. Business was very quiet all day, but about 8pm a terrific\n\nBombardment opened out in the direction of Perromme. Also around was a bit of an uproar. The sky was lit up five miles. Fritz is still from Bapaume under little pressure.\n","61":" Beautiful day. The suns rays are actually warmer. Few taubes flew above but did no material damage.\n","62":" Dull. Nothing much doing during the day but a lively bombardment took place during the night.\n","63":" Fine. Today I took charge of transport (temporarily). All night long the guns were banking. \n","64":" Very cold & wind blowing. Heavy artillery action is taking place now in the region of P Gee! they\n\nare rocking it in. During the night there was snow blizzard. Snow was driven into the most obscure corners and even my dug-out was invaded. Snow falling on my head. Some sight.\n","65":" Snowing very heavily for a couple of hours, then it stopped just after dinner it commenced to thaw & by 4pm there were puddles everywhere. It is now a beautiful, calm night, but the line is gradually becoming .Everything points to a freeze-up by morning.\n\n","66":" Freezing. Nothing much doing.\n","67":" Slight fall of sleet. Very cold. Bit of an artillery duel in progress.\n","68":" Some blizzard! Snow is thick on the ground & is still falling. Very cold during the night .\n","69":" Still snowing. Snow is being\n\nDriven into every nook and cranny. Gee! I will be glad when this show is finished.\n","70":" left camp at two pm for where I am to be decorated by the General. We went through Meaulte, Dernancourt, Buire & Ribemont and arrived about 7.20pm at our destination. A miserable, one house power outfit. We stayed the night in an old barn. We did not sleep, but shivered until morning.\n","71":" Beautiful day . Brushed up & fell in our church Parade before the whole of the 4th Division (minus Div. Troops &16th Battalion) After the sermon, the men who were being awarded were decorated by General Sir Willilam Birdwood. \n\nMy medal was not there, but \n\nhe shook hands with me & said he was sorry it had not arrived but it would come later. He then thanked me for my services & handed me my ribbon. Left at 12.30pm & reached Mametz (by motor via Albert) at 2.30pm. All night it rained heavily.\n","72":" Rain has cleared off & the weather is much warmer. Nothing doing all day.\n","73":" Wet and miserable. Mail from Australia. Wrote &readA.G. I am full up of quibbling.\n","74":" Still wet and miserable. Nothing much doing. Fritz is still retiring.\n","75":" Drizzle of rain. Few shells (big ones) being close.\n","76":" Our aeroplanes go over \n\nFritz line & return ok. Fine all day. Nothing doing at night.\n","77":" Beautiful day. Very quiet. Hardly a shot heard, though at night, flare shells & shrapnel could be plainly seen & heard. \n","78":" Another splendid day. It is now rumoured that the Germans have invaded Bapaume. 13th light horse are said to have been over, everything points to a speedy end. I wonder what will arise from the Russian revolution? I hope it helps to hasten the end. I have had orders to “stand by\" to shift the Companies to Le Sars tomorrow.\n","79":" Left camp at 6 am for\n\n Bazentin le Grand. Here the trains hooked into wagons & drew then to Bazentin Siding, where we unloaded. We then moved off with empty wagons in the direction of Bapaume, passing through Bagueten le Petite, Martinpuich, le Saris & Warlencourt. At the latter place we reloaded baggage which had come along per Light Rly. & took it into Bapaume. The town presented a very destitute appearance while walking down Rue de la Liberte the first thing that met my gaze was the rafters & wood work of one of the houses. other houses were burning & and some had stacks of light wood covered with tar in\n\nthe centre of the rooms. Presumably this was to set a fire but was forgotten or cancelled. Fritz has left quite a lot of useful things in our hands, such as coal, metal ammunition etc.\n\nFritz what I can learn he is still retiring.\n\nDuring the night it blew a hurricane & rained like hell. I was indeed glad when I saw the lights of the Camp show up in the distance.\n","80":" Still blowing some. Fritz has retired a few more miles. Hardly a shot is heard now \n","81":" Moving day. Packed up & left for BazentinLe Grand. Here we pitched camp where\n\nsome of the artillery had been camped. Several men had been recently killed here & blood and hair was still visible. Fritz is still retiring, the fighting the rear guard action. \n","82":" Snowing fairly heavily. During the day this turned to sleet. Occasionally the sun shone but there was no warmth in it. No shells were heard at all. During the night it froze.\n","83":" Beautiful day. The sun is shining & everything looks bright. We are now making preparation for a move which I believe is to be in a northerly direction.\n","84":" Cold and miserable nothing much doing all day.\n","85":" Snowing. Very little is heard from Fritz these days. Five lads are steel chasing here.\n","86":" Raining and cold. Fritz by a 7 day time fuse timed by the clock of the Bapaume Town Hall blew that place up to day at 11.45am. There were only HQ casualties.\n","87":" Cold and rain and sleet. Our artillery is fairly active. Our troops are now approx 10 miles past Bapaume. Cecil Sutton pulled a tooth for Fastue. Gee! it was the funniest act of dentistry ever yet witnessed. Some bombardment in progress.\n","88":" Cold. Business is very quiet. No success re allotment. Wrote to Sylvia. No mail.\n","89":" Cold with slight showers of rain. Fritz is still retiring. Our front line is fare beyond Bapaume though I do not know how far. Since the Town Hall was blown up men are afraid (officers incl.) to dwell in the houses of the town. Several explosions took place in the region of Bazentin le Petite during the day.\n","90":" cold with the usual rain. Nothing much doing all day. We are to move out beyond Bapaume very soon. That finishes our dreams for a trip north. Instead we go further into the land of devastation. Raining heavily all night.\n","91":" Still raining heavily. This cleared off during the day\n\nGradually the Battalions gear is being conveyed to Bapaume. More stuff is to go tomorrow. We shall all be out there by Wednesday next. (today is Saturday) I have not seen a daily paper for over a week so do not know what the outside world is doing. Some say that the betting is 5 to 1 on the war being finished by August. Gee! I hope it is true. Today has been miserable. It is now raining heavily. Hell What a life! Sutton is again in the DTs. \n","92":" Some fool we! Caught before & hit the ground. More gear sent to Bapaume today. It will only be a matter of a couple of days before \n\n(Address takes one side of the page)\n\nJames F Bennet\n\nCare of Mrs M.A.Bennet \n\n52 Belvidere St\n\nEast Perth\n\nWA\n\n1587 Pte J.F.bennet\n\nA Coy 48th Btn\n\nAIF\n\nPte W.H.Walsh\n\nB Coy\n\n45th Battalion\n\nAIF\n\n3240 Leslie J Butche\n\nA Coy\n\n4th Pioneer Btn\n\nwe are all out there. It has been raining all day with intermittent showers of sleet. Gee! It always rains where we are to move. Nothing has been heard of Fritz but we are too far behind the line here to hear very much.\n","93":" Left camp at 8am for Fremencourt. It had been freezing all night & the roads were very slippery. Several times the Convey was hung up especially at Martinpuich where the roads (Gun pit road) were in a frightful condition. Eventually after passing through Le Sars, Beaullincourt and Bapaume we reached our destination at St RueHere the roads were in good condition except for the occasional crater\n\nor two which were fast being filled in. It was indeed a treat to see green fields after the much and slush we left behind. During the afternoon it snowed to same order so we could do nothing all night long. Fritz was sending shells into Bapaume and the surrounding villages. It was freezing hard all night and the snow having ceased to fall about 8pm and next day.\n\n","94":" The full show clearing all traces of snow away. Gee how the wind blew a small hurricane but this died down by 6 pm. About 7pm we witnessed a rather exciting incident. A German flew over in a captured British plane. So we respected him until he flying very low turned his machine guns onto one of our Captive Balloons\n\nThis set fire to the latter which soon fell to the ground- the observer was I am afraid burnt to death. The occupants of the Second balloon seeing their comrades fall activated their parachutes and left their balloon which was soon hurting to the ground a Blazing mess. Then the audacious Fritz flew back to his line at an altitude of about 6oo feet, Machine guns, anti aircraft and rifles were turned on him but he got away safe, although a German he was a brave man.\n","95":" Rain and Sleet. Some bombardment is in progress. Shells of all calibre are hurtling into Fritz lines. Everything is in uproar\n","96":" Terrific bombardment is in progress-1pm Fritz \n\nin galore are coming in, motor ambulances are flying past with wounded, many are walking out. Very cold with sleet and rain.\n","97":" Raining A.J. Cameron died about 2 am. Same stunt in Progress, hundreds of prisoners were sent to the rear.\n","98":" Some air fight.15 Fritz doing 120 knots ph have “boxed on\" with 6 of our planes\n\n (50 knots) knocking the stuffing out of them and sending most of them to the ground. I brought 2 airmen to dressing who came down from a height of 1000 feet. Both were alive.\n","99":" Beautiful weather. Nothing is unto.\n","100":" Anzac Day. Very lively. \n","101":" Left for Abbeville to undergo a special training course of transport work. Arrived ok, same night. Had a good trip down, formed a syndicate of 6 i.e. Alf Nicquet, Jim Fox, Bill Trupp, “Jumbo\" Creighton, Geo Brackenbridge and myself. Some Syndicate\n","102":" The end of a perfect day. The school is finished and I must return to the battalion, anyhow I passed everything. Left Abbeville at 10 am and arrived at Etaples at 1,30pm. Stayed here all night and at 8am on","103":" left for Steinwick where I arrived about 3pm reaching camp at Vieux Berguin about 6 pm.\n","104":" On the move again. Left Vieux Bergin8.30 arrived at Neuve Eglise at about 4pm Beautiful day \n","105":" Beautiful day but Gee what an eventful night. Left camp at 9pm for trenches on the way out we ran into a barrage of H.E. Several were hit including three from my team of 4. Bill Cahill also had 2 hit. Shells were bursting everywhere and a man was lucky to get back alive.\n","106":" Another beautiful day. Fritz is certainly to some order! I wonder if I shall have to go out tonight, later I guess I did \n","107":" surviving it. Ran into a barrage of tear shells. Hills what an ordeal. Anyhow came out ok and returned to camp by 4am\n","108":" visit- nothing doing.\n","109":" Beautiful day. Full drill parade on which I was presented with my medal by Col. Sturdee D.C.O. \n","110":" Left once more to join the Mule Corps. This will be far than the two previous ones.\n","111":" Left camp for Newcombe Farm arriving about 10pm. Round about us are several heavy artillery. At 12 midnight the bombardment started. Gee how they racked it up. This continued until 3am meanwhile Fritz sent myriads of tear and gas shells \n\nAmongst us which caused some with sore eyes. After a bit he sent over liquid fire and incendiary shells. Gee what a night Messives blown up at 12.\n","112":" Bombardment still on. Boys are now past the miseries, the object of the attack. Fritz continues to shell camp.\n","113":" left camp at 7pm for trenches, with a convoy of water, bombs and ammunition. Arrived at Bayles Farm at 8.15 but could go no further as Fritz was counter attacking the 13 Bde. The din was awful. Race into a barrage. Several men and animals knocked. Dead lay all over the place \n\nIt was the worst night I experienced for ages arrived back in camp at 4am and dog tired. Beautiful day. Heavy artillery action.\n","114":" Each day up to date has had its thrills- yesterday while out with a convoy I ran into a very heavy thunderstorm which strange to say took place only in the region of the trenches. Needless to say I became soaking wet. Today we break up and return to our units.\n","115":" out with convoy to Birthday Farm (Messives Ridge). Fritz was too busy so returned home very lucky to do so. \n","116":" Heavy thunderstorm which soon passed. Nothing doing.\n","117":" Air raid at about 5am Fritz dropped bombs in field nearly doing no damage.\n\n I’ve a paper which arrived yesterday’s mail. I read a statement by Billy Hughes at Bridgewater Victoria to the effect the Australians had been withdrawn from the line for three months owing to lack of reinforcements. This is a lie- The Australians have never yet been away from the forward area. In fact they have been in all the heaviest fighting. Since the offensive began in 1916 Colonial troops have taken the brunt of it all along the line.\n","118":" Left camp for Calais to get arrived there same night.\n","119":" Had a good time in Calais and am now returning by road to Neuve Eglise\n","120":" Arrived at Neuve Eglise. Beautiful day\n","121":" Left Neuve Eglise for Vieux Bergin where we arrived about 1pm Beautiful day \n","122":" Today we were reviewed by General Plummer who is in Command of the","123":" Army. Also attended a lecture rendered by the Rev. Arch. Deacon Ward in the dangers of V. Disease.\n\n It was indeed a splendid address.\n","124":" Wet and miserable. Wrote to Bill Cahill we are to move again tomorrow. Foster is about to\n\nget a commission and I have been informed by him that it is to be a go between Baker and I for his place. Who will win one never knows!\n","125":" Of course it is raining! Left the Farmhouse in Vieux Berguin for Wolveringham at 9am arriving about 2.30pm. Gee, how it does rain. Violent bombardment in progress.\n","126":" Beautiful day, but what a miserable and highly exciting and eventful night. Several teams were warned to be ready to move off to the line at 7.30 of course I was in the take. Exactly at 7.30 we moved off and simultaneously the rain came down in torrents. It was simply a deluge and very \n\nsoon all of us were soaking wet. The rain continued for two hours without a break then it ceased as suddenly as it started. During our trip to Fannys Farm we were subject to many shocks in the shape of shells. The animals were nearly unmanageable and for a time utter chaos reigned. Eventually we got through and left at a gallop for safety arriving in camp at 3am.\n","127":" inst Lieut. Redclilffe who was seriously wounded in the thigh. The rest of us are indeed lucky to get home.\n","128":" Raining work at Fannys Farm. Quiet.\n","129":" Fannys Farm Lively Raining and miserable.\n","130":" Fine. Fannys Farm job very warm.\n","131":" Fannys Farm job- Red hut misty and miserable.25\/yr\n","132":" Left for Neuve Eglilse for arrived Hazebrouck 5pm. Raining hard- canals.\n","133":" Left Boulogne for Blighty and arrived at London about 5.30 pm. During my free days I certainly enjoyed myself, but would have much rather been at home.\n","134":" arrived at St Sylvestre-Cappel and rejoined unit. Beautiful day. \n","135":" Left Ypres at 6 am arriving Chateau at about 5pm beautiful day. Big fight in progress. Germans are clearing for their lives and if the weather\n\ncontinues a big victory is certain.\n","136":" Another heavy bombardment before dawn. 1,000,000 men including French hop over. I don’t know what the result is yet- 9amFritz is now shelling our camp with H.E.\n","137":" Beautiful day also ditto night. Fritz played merry hell for a few hours dropping 160 pound bombs. Gee he did kick up a row and caused some damage.\n","138":" Preparation for Fritz tonight everyone is building dugouts. Beautiful night. Fritz came over and dropped bombs around the camp.\n","139":" Out to ridge with planking for Corduroy Road. Gee! what a wild night. It rained like hell and Fritz\n\npoured shell after shell into the roads. \n","140":" At 5am we left for the camp pursued by shrapnel and H.E. shells. It was indeed terrifying. Many wounded Major MacRae and Capt. Graham killed.\n","141":" This work still continues. It is raining and the roads are in an awful condition.\n","142":" Still raining-work continues. Our division has long since gone out of the line but we are still in and are likely to remain for some time.\n","143":" Fourth Div. are about to come into the line again. Gee! how much longer are we to stay in this living hell?\n","144":" Still raining. Job still progressing. Rotten.\n\n \n","145":" Miserable weather. Always a drizzle of rain. A few shells dropped near the Camp to night.\n","146":" Raining as per. When is this damnable show going to end? I am full up and do not intend to see the winter through with the battalion.\n\nRaining and altogether a miserable day. We are now walking in mud up to our knees. All dug outs are full of water but as it is unsafe to sleep above ground we must perforce use the dugouts. So with the aid of a few duckboards this difficulty is soon overcome. An order came through from13 H.Q. to take some wagons up to a forbidden area(dangerous \n\nand closed to traffic during the day by army corps) by disguising the animals as pack animals. Such are the ruses which gain decorations for the officers and death for the men.\n","147":" This is a much better day than yesterday. The sun is shining and everything is bright- yet this makes no difference to the mud which is everywhere. Fritz took advantage of the elements and came over in hordes in his new planes. Gee! They were whoppers and through am anti- aircraft boomed away at him, he got clear away. He dropped some bombs in the region of Poperinge, but I do not know what damage was caused.\n\nPay today what the hell is the good of it in this God forsaken hole?\n","148":" Another fine day. Fritz takes advantage of this and comes over during the day and night dropping. Such occurrences almost makes one wish for wet weather again.\n","149":" Out to Zonnebeke at 4am. Cold. Few shells flying about including mustard oil shells Fritz dropped some bombs near the road. Reached camp again at noon. Very seedy today.\n","150":" Fine. Eyes becoming worse everyday. Fritz came over to have a look at the sights but say! He did not return. A couple of our (Australian) scouts caught him and very soon he was hurtling over ten thousand feet to the ground in a mass of flames. The pilot fell out of his\n\n \n\nmachine about eight thousand feet up. So poor buggar was dead before reaching the ground. No doubt his compatriots will try and avenge his death tonight by dropping a multitude of bombs on us. “Still ces’t la quaere\"\n","151":" Fine Out to Zonnebeke. Fairly warm-today is my third anniversary of leaving Australia. Where shall I be in 12 months time?\n","152":" Raining like hell during the day but fine at night. Fritz came out and dropped a few eggs.\n","153":" Out to Zonnebeke Gee! It was hot. Shells\n\nof all calibres were dropping everywhere. 2 animals killed and one man wounded. Someday.\n","154":" Fine, another man killed today. This Zonnebeke is some hot joint.\n","155":" Out to Zonnebeke-shelling very heavy in the region of the village 1 animal killed. Five all day.\n","156":" Battalion shift to Ypres to make permanent Camp for infantry. Fine all day. Fritz over at night.\n","157":" Fine – preparations for a move. It is believed that we are going back to Dilletts Rained heavily during the night. Fritz sent a couple of shells over which fell in the lines.\n","158":" Clear but very wild. “il fait beaucoup de ici\" we shall move \n\nsometime tonight and entrain during the morning.","159":" Reveille 3am Left for Poperinge at 10 am arriving about 2pm. Raining like hell. Entrained and left for Verchin 10am arriving at 5am cold and miserable arrived at camp at 2pm.\n","160":" Raining. Shifted camp1\/2 mile further into village. Here I obtained from an old lady who kept a farmhouse a bed with sheets and eiderdown quilt and some room.\n","161":" Raining. Foster left for Ypres with convoy Ordinary routine.\n","162":" Drizzle of rain, nothing much doing. I will be satisfied to stay here until the war is done. There is a church in this village which was built in 1630. Gee! one does encounter some quaint things in the village.\n\n1stNov still nothing doing\n","163":" Left camp for Boulogne to draw \n\n(date missing) Arrived back in camp.\n","164":" Left Verchin for Frittemule where we arrived on 25th.What a hole we have been told that we are to stay here over Xmas .\n","165":" Our hopes were dashed to the ground we have under orders to move out up the line. So much for our spell\n","166":" Left Frittemule for Waincourt at 12.30am arriving at 4am. Entrained here Gee! It was cold. Train pulled out of station at 6am arriving at Renonne at 2pm. During the trip we had a fire bucket in our truck and the smoke made by it caused us to become very black by the time we reached our destination. But what did we care as long as we were warm.\n\nBy 4pm we had detrained and left by road for Haut Allaines which was reached by 6pm. There we camped in a nice muddy field. But we are so accustomed to mud now that a little extra makes\n\nlittle or no difference. \n","167":" Colonel Monaison delivered the address to the Battalion today apropos the Conscription referendum- no one seems in favour of it and I don’t think the rates will carry much weight in putting it through. During his address the Colonel said\" think of these slackers home in Australia! They are not helping us a bit. Instead they are stealing your job and mine\" and somebody way back in D coy shouted “yes selling matches your B-.\" Col Morrison wasn’t very well liked Ha Ha \n","168":" left Haute Allaines\n\nFor Templeux la Fosse about 10 kilos distant. It is a fine day and the ground is beginning to harden as a result of the recent frost.\n","169":" We are now renovating the trenches and breaking new fortifications round Gouzeacourt. Hardly any shells falling, but Fritz comes over regularly at height in his planes dropping eggs.\n","170":" Snowing heavily and the ground is now covered in about a foot of snow. Wood is at a premium and the only way we can get it is by pulling down the lining slats of the old German dug outs in the vicinity.\n\nI have been feeling off color lately as a result of a night in the line without shelter during a blizzard. Doctor says its pleurisy and I must take things easy.\n","171":" Left Perrone for the north. It was freezing hard and if it wasn’t for the rum that was issued we should have frozen. Still we stick it and about 6pm on the","172":" we reached Voistraate where we took up our quarters in the old camp.\n","173":" We are now fixing up the line wind banks and last night \n\nabout 20 of our battalion and nearly a Company of the","174":" Brd. were gassed by Fritz. I was lucky in that I got away a quarter of an hour before the shelling started. \n\nStill I am feeling far from well and at times I can hardly move. I managed to crawl across the mud to the Doctor but he just gave me a pill and told me I would be all right by night time and marked me M.D. Calls himself a doctor- he should be in the Veterinary Cops-\n","175":" Can stand this pain no longer. Cpt. Ogilive G.M.C. attachment came to my dugout and took my\n\ntemperature. It was 104 degree so he forthwith bundled me into an ambulance which took me to the dressing station at Bailleul. \n","176":" The Doctors here have diagnosed my case as Trench Fever and I am to be sent to the Base. Still feeling fairly rotten.\n","177":" Arrived at No 2 Aust.Gen. Hospital Wimereux just outside Boulogne. The treatment is fine but I don’t seem to get any ease from the pains in my legs and body.\n","178":" Hurrah I am booked for Blighty and will leave in the next draft.\n","179":" Left Boulogne for\n\nDover where we arrived about 6pm. There we were carried to transport and later left for Chester where we arrived about 2am. Cars met us at the station and we were whizzed round to the hospital which in pre war days was a workhouse.\n\nIt is some home and I don’t care if I never leave it.\n","180":" Arrived at Harefield Hospital near London but say what a hell of a hole it is. It is just like leaving paradise and going to hell- to come here from the Chester War Hospital.\n","181":" On leave in London. Ran into an air raid which tore houses down and wrecked the train line between Harefield and London. Good excuse for me so I stayed out all night.\n","182":" Discharged on furlough and as the weather was freezing I decided on Bournemouth. Stayed at the Lansdowne Hotel and had a gay time. I did not salute one officer during the whole 14 days and if I had stayed in London my arms would have had to keep going like a pendulum.\n","183":" Arrived back in\n\nFrance and joined the Battalion at Bussy les Daours.\n\nEverything is quiet, but from what I can hear I guess there is to be something doing soon-Just my luck I always find trouble.\n","184":" I am more than convinced now that a big stunt is coming soon. Tanks are rolling in galore. Big guns come up from the base by every train and ammunition columns are going up to the line all day and night.\n","185":" Shifted camp to the village of Boves. Here we camped in an old chateau and slept\n\n \n\nin real (albeit a bit lousy) beds. But the","186":" Pioneer Btn. is not fated to have easy times and on","187":" we shifted Camp and returned nearby our last camping ground at Daours.\n","188":" Big arrangements are still being made and I guess Fritz is going to get the biggest hiding he ever had in his life.\n\nCharlie Dingle of Sydney and Bill Townsend of the Yarra City have been picked to go over the bogs tomorrow morning with half timbers and to carry pickets to mark the advance. Gee they certainly expect to move at some pace.\n\nI and two more fellows have been selected for ammunition bomb and ration carrying and I don’t like my job a little bit and as we leave camp at 9pm tonight for the line, I have just made my will for who knows whether I’ll come back or not.\n","189":" The first wave went over at about 2am and for hours we marched before we caught them. Fritz was only discernable going for his life over the horizon leaving guns, stores and ammunition to us- about 6pm we arrived at Morcourt where our Btn. had its\n\nfirst casualties. The who were on our left were hung up by Fritz with the result that the Hun was behind us and let us have some H Es to keep us company. The","190":" Btn. to whom we were attached sustained many casualties and it wasn’t till some of the 1st Aust Div went to help their chums that we got any rest. Prisoners came in hundreds and I guess there’ll be more tomorrow\n","191":" Advance still continues only Fritz is getting a bit cheeky and retaliates\n","192":" Pulled out of the line and went to Longreau\n\nnear Amiens for a spell. Weather is fine and we are taking things easy.\n","193":" Left Longeau for line and say it is much further away now than what it was where we pulled out for we went through many villages before we reached our ultimate destination at Vraegnes. At Bouverecourt we had a funny experience - we pulled in for the night to an old dump that had been used by the Yarlies. We had all been warned about traps and mines and were all on the “qui vive\".\n\nOne chap went looking for a decent dug out\n\nand finding a rather decent one put a sign up “mined’. This was done to keep others away and I guess it succeeded too. When we joined him he told us – Jim Vaulawick, Bill Reidy, F Baker and myself what he had dome to save the dug-out for us and we all walked down and dumped our kits. At nightfall Vau found a wire running along the wall and said Gee! we’d look funny if this place was mined.\n\n This put the “wind up\" all of us and one by one we found some excuse to beat it. I went in with the cook under a very heavy tarpaulin.\n\nIt rained the greatest part of the night and when the rain wasn’t falling the Fritz was over in their planes dropping bombs. In all I spent a hell of a night and the next morning I went across to see how the dug out got on and there were three of the boys nicely settled down near a fire they had made in it and quite at home. I guess I’ll chance the next dugout.\n","194":" Hop over to Vendelles. Many prisoners and guns taken. Fritz pays us many nightly visits in his planes and drops many bombs. I’ll be glad when we pull out of this\n\nfor bombs have a nasty habit of hurting and killing and I’m too young to die.\n\nSept.20th My Australian leave has come through so I’m off and will not be back till March next year. Still I’ll be willing to come back if I can have a month or so in Aussie for it seems Centuries since I saw dear old Sydney. Left Vraignes per boat for nucleus at Perrone to await craft leaving for Australia. Fritz was over during the night giving us a send off with bombs but he got no prizes.\n\nOn","195":" we marched out of the Nucleus and arrived at Bray about 4pm. \n\nHere we were formed in parties for various states and on","196":" entrained for the South. We are to go via Italy so we should see some fine scenery.\n\nLeft Bray Sur Somme at 8 am \n\nArr. Amiens 1.4pm\n\nSt Omen en Chausse 4.45pm\n\nBeauvois 8.30\n\nNeru 7pm\n\nPerron Beaumont 7.45pm\n\nMelun","197":" 7am\n\nChampagne Sur Sune 8.25\n\nMontreau 9. 10\n\nChampagne Sur Yonne 10.5\n\n Cexy 11.5 \n\nInighy 11.15 \n\nLa Roche Yonne 12.30pm\n\nSt Florentein Vergigne 1.50pm \n\nTonnerre 2.25\n\nMaultard 4.40\n\nLes Laumes 5\n\nDijon 7.50\n\n(of cherry brandy fame)\n\n Lyous","198":" 7.45am \n\nGevons Canal 8.20\n\nVienne 10.15 \n\nTaurnau 11.50\n\nAvignon 7pm\n\n(of papal fame)\n\nMarseilles 11.30pm \n\nAubagne","199":" 7.30am \n\nToulon 9am \n\nCannes 3.45 \n\nThe train stopped, night leave with promenade and beach and as it was very hot the boys lost no time in stripping and going in for a swim – some wore the small white\n\nunderpants issued by the Military but most of us wore natures own costume. A lot of ladies came down to the promenade and those who were in the water had to stay there until the ladies had passed on- Gee! The swim was very refreshing and I truly wished we could have stayed longer.\n\nAt 4.15 we left Cannes and arrived at Nice at 5.30pm\n\nMonaco 6.20 \n\nMonte Carlo 6.30\n\nMention 6.35 we then crossed the French Italian boarder and arrived at Ventimigia at 7.20pm. So far the trip has been fine we have been well\n\nReceived everywhere we have called but things aren’t look good in Italy. After travelling at night we reached Saupurdarina at 7am \n","200":" At 8.30 am we marched Ronca after passing through the Simplon Tunnel which took us 20 minutes at about 30 miles and hour. A special electric engine was attached for the purpose and at Ronca we returned back to steam.\n\nArrived at Arquata Scrivea at 9.40am\n\nTortona 10.55\n\nVoghera 12.45pm\n\n The Tommy garrison here made us tea and we stayed\n\nabout an hour for dinner. 6pm found us at Firenzouk and at7am","201":" we reached Faenza where we detrained and proceeded to a Tommy camp for breakfast.\n\nThe camp is very well laid out and each small street between the huts bears the name of some well known thoroughfare in London such as Strand, Brampton Road, Tottenham Court Rd. The huts are named after the various railway stations i.e. Euston, St Pancreas and Waterloo.\n\nAs in all fixed camps the management is fairly good and the whole place has a look of health about it. In the grounds are kiosks run by Italians,so that when the\n\nEF canteens are crowded or if one prefers the Italians he can have a drink without bursting himself to procure it. We were very unfortunate for just before we arrived it started to rain and this of course made things very miserable. The Tommys occupying the camp made us very welcome and did their utmost for our comfort while we were there but their famous Red Caps went out of their way to try and get cases amongst us. Every man was warned to be on his best behaviour lest he be sent back to join his unit.\n\nThough this took little effect on a good many, there were those who took chances.\n\nStill they broke no civil law and did not commit any crimes so why worry? Surely a chap is entitled (if he feels so inclined) to a bust up and as we were only passing through the Greasy Jacks might have left them alone. \n\nAfter dinner we entrained and the train pulled out at 1.15 pm 2.10 found us at Canbettlo and there we headed towards the coast. About 7pm we started a run parrel with the Adriatic and all lights we extinguished in trucks and carriages (I forgot to\n\nmention that the officers travelled in luxurious first class compartments) after sunset, in the event of submarines being in the vicinity.\n\nAt 7.15 am we reached Faveo a small and dirty town, but did not stay above a few minutes ans then we were on the way again.\n\n10am on","202":" we reached Termolo where we procured hot water fromteh engine made tea and while the trein was going had our breakfast and at 10.3oam we passed through San severo arrived at Tupalto at 12.45 but did not stop tillwe reached Foggia at 4.15pm. At 2am on the","203":" we reached\n\n Ban, but we were all too sleepy to pay much attention to the dirty place.(nearly all Italian villages and towns we have passed through up to date have been filthy, squalid places) About 9.30am we reached Acquaviva where we stayed for about half and hour while the men made tea and had breakfast. The people of Italy do not appear to have had much meat, for all along the line dirty unkempt children and even men and women have been wailing in pidgin English ‘Bullybeef de vino\" at same time holding out a bottle of wine (very poor quality) which they will barter for a tin of Bully Beef or\n\na tin of maconochie rations. The kids are always in a ragged condition and look underfed so I can quite imagine Dagos not wishing to return to their beloved? Italy. Gee! I’ll be glad when we are on the boat and away from the smelly land of dark skinned, greasy Dagos.\n\nAt 2.30pm we reached to Taranto. The last lap is over, but seeing the way we are shunting etc I guess we’ll be here till morning. I won’t attempt any description of Taranto for it is too dirty to waste time on – we continued \n\nTo move about the yards of the station till about 4pm when the Powers that be decided we should move to Cimino about 4 miles distant round the harbour.\n\nHere we detrained at a Tommy rest camp. It appears no arrangements had been made to receive us and consequently there was nothing for us to eat except in a few isolated cases where men had saved a little of their rations from the train. But who ever heard of these things that are supposed to govern men being able to do anything properly or on time\/\n\nWe were packed into huts and were forced to wait until 8am 5inst for our breakfast which consisted of a very fatty piece of bacon which was found after a very diligent search in the corner of the -Tea and a small portion of bread and jam (I found the latter) completed our breakfast. After this most sumptuous repast we were allowed to while away the time (inside the camp-no one except officers were allowed to go to Taranto) as best we could. So Townsend and myself utilised our time looking for eats, but our search was futile so we had to wait perforce till 5.30pm when tea should\n\nhave come. But tea was conspicuous by its absence for we were politely informed no rations would be issued that night as we would be embarking on the morrow and breakfast would be served aboard, so the boys did another starve. At 5am on","204":" we were awakened and marched to the pier and after much fooling about eventually got on board the Kaisa-I-Hind, at about 10am more fooling about and at 11am breakfast? arrived. This consisted of Bully Beef and the very best quality biscuits. These biscuits were originally made for armour plate but were too hard, so were given \n\nto the troops to eat.\n\nAt noon we sat down to a sumptuous feed of biscuits and the best quality beef and some liquid in a tea box, which had contained onions. So we have not done too badly but hope for better as we go along.\n","205":" After a night spent packed like the provincial sardine on the lower deck (4four of us slept on deck until we were driven below by rain at 3am) we are all feeling very drowsy but after a shower bath I soon freshened up again.\n\nBreakfast came along at 7am. It was only just breakfast \n\nI have seen better stuff thrown into a piggery. Still we can do nothing, for complaints avail to nothing so we must abide by the decisions of the ‘powers that be’.\n\nThis ship boasts a Canteen which makes about 800% profit on each article. Muk may be obtained for 3shillings per tin and small tins of salmon (very inferior quality) cost us 2shillings and 6pence.These prices are exorbitant and I will starve rather than pay the profiteering crew such amounts. I think it is disgraceful that troops should be submitted to living (or rather should I say existing) conditions like these. \n\nGee! How glad I will be when I have my freedom if it is only\n\nfor a couple of months.\n\nThe officers live in absolute luxury- Cabins and umpteen niggers to wait on them. They can obtain a whisky and soda for the asking- and loll about in smoke rooms till all hours of the night while we ordinary common-o-garden diggers have our tongues hanging out for the want of a glass of beer. About 10am ship weighed anchor and pulled out of the inner harbour- as we passed down the stream, all the ships in the harbour commenced blowing their hooters and the men aboard the Italian war ships cheered lustily.\n\nWe eventually passed through a huge gate like the gates \n\nof a lock- and on either side hundreds of people congregated and shouted “war fini\" This puzzled us, for as far as we knew the war was not finished. Later on we heard a rumour to the effect that Austria was asking for an armistice. I fervently hope this is true but at the same time I don’t want the war to end until I get back to France.\n\nAbout 11am we anchored outside the harbour to await an escort across the Mediterranean to near Egypt.\n","206":" Beautiful day but very warm. During the afternoon a rope ladder was lowered over the side from the well deck and the men were allowed\n\nto go for a dip, providing their lower limbs were covered. It appears that only naval ratings were allowed this privilege, and judging by the number of men in the water one would imagine all men aboard were members of the Navy.\n\nSome one found a ball and for a half and hour or so we managed in that papillon aquatic spirit, Polo. Then came the pull to get back on board and to the majority of troops this proved a very difficult job. I just reached the top and had there been any more rungs on the ladder I would never have been\n\nto reach the deck. I was so exhausted. Anyhow it was worth the strain for the swim was very refreshing. There has been no word of moving yet- the maybe, we shall move tomorrow.\n","207":" Weighed anchor and left Taranto at 9.30am .The sea id very calm and if we do not encounter any tin fish we should have a good trip. \n","208":" The food is still very bad and I’ll be mighty glad when we get to some place where we can get a decent feed.\n","209":" Arrived Port Said 6pm and anchored inside the breakwater.\n","210":" After lolling about\n\nthe ship all day we disembarked about 4pm and entrained for Port Suez. It is a beautiful night and it is just as well for us that it is for we are huddled up in open cattle trucks. Guess we do travel in style – The officers of course have first class carriages, for I suppose the war could not go on if they had to rough it like the boys.\n\nThe train pulled away from the wharf about 7pm and came to a stop at Said station. Nearby was a stack of English beer and of course within a short time that stack (or the greater portion of it)\n\nwas transferred to our truck. However the loss was discovered and soon the train was searched by the A.P.M and his staff. The search revealed nothing for the diggers were too cute. Not even an empty bottle was found out of 60 cases. Ha! Ha! I wonder who had that beer? We got away eventually and at about 11pm just as we were nearing Rautara the couplings broke and the train was divided. Very soon the back portion of the train was lost to sight and though we blew our whistles as hard as possible the Gippo driver did not hear- at last Lahiff our souvenir \n\nKing came to the rescue by firing some vincy lights in the air. (Lahiff was reputed to have in his possession anything from a rifle to a 15 inch gun) This caused much consternation among the Arabs sleeping along the line and the driver looking behind saw that he had mislaid half his train so started to back pedal. At 5 am on the","211":" we reached Suez and went into a camp alongside the railway line. It is very hot and though we were all augstered it was impossible to sleep.\n","212":" We were paid this morning and all hands had leave to Suez which like all Egyptian \n\ntowns is not very clean. There the Tommy Red Cops. tried to assent their authority which resulted in a riot.\n\nSeveral “Jacks\" were carried home or to the hospital on stretchers. Ha Ha!!\n","213":" Still very hot. The town is now out of bounds to us as a result of last nights row, but I should worry for the Camp is just as nice as the town.\n","214":" The town has now been put in bounds but drink is ‘Lapao’\n","215":" Further concessions booze is obtainable in all hotels.\n","216":" Still here no move yet but I think we will\n\nBe aboard the boat by Monday- very hot and dusty.\n\nSunday20th left Camp for H.M.S Port Sydney and embarked about 4.40pm we pulled outside the breakwater and at 9pm headed for the Red Sea.Hurrah- we are on our way at last.\n","217":" Very hot. Progress is very slow but still we are on our way and the lord is good. \n","218":" Ran into miniature cyclone which made the old Port Sydney look sick for a while.\n\nNov.3 arrived in Colombo and was granted leave from 10am till 11pm. Had a gay time with several English tea planters. Our \n\nSmall boat left at 6pm so one of the planters took us to the boat in his launch.\n","219":" Ashore again. English residents put their cars at our disposal and we were driven around the Cinnamon gardens and shown all the beauty spots of Colombo. After the drive we wee entertained at the Y.M.C.A. by the local Concert Party. There is a rumour that Austria is asking for an armistice. Our Congolese shopkeeper said today that if Austria was granted the armistice, Germany would crumble in a week, I wonder – \n\nLeft Port at 11.30pm\n","220":" News has just come through that the Allies have granted Austria her Armistice. Great excitement on board-Sea calm.\n","221":" Everything very quiet except for the West Australians who expect to land in a day or so.\n","222":" Wireless message has just been posted up saying Germany has been granted and Armistice. But no one seems to worry much. Most chaps are talking of what they will so when they are discharged, but nearly all of us are sorry that we were not in at the death. Still as we are all original 1914 men \n\nOn board I think we are lucky we are alive at all.\n","223":" Arrived at Fremantle but as there is supposed to be flu aboard we are not allowed to land. The W.A.s were taken off on small boats during the afternoon and we were left to gaze on the nice water and lovely sharks which circled the ship. I guess no guard will be required while these ugly monsters are about.\n","224":" After a good trip we arrived at S Melbourne and anchored at Portsea\n","225":" All hands were transferred to the quarantine station where we will undergo quarantine for a fortnight\n\nGee ! So near and yet so far. The accommodation is good and the tucker is fine. I had the first decent meal today I have had since my last leave in London.\n","226":" We have just been through a tick spraying operation which reminds one of the gas chambers we had to pass through before we were allowed to go up the line. As we come out of the door we were given cigarettes and an apple. This bought back memories of Sunday School picnics and I was tempted to ask the man giving out the tobacco and fruit if I could have one to take home to my little brother.\n","227":" Today we were issued with 2 pairs of rosettes which we are to sew on our shoulders one inch below our battalion colours. Gee! we will look little circuses when we have all our glad rags on!\n\nA meeting was held after tea to decide whether we would proceed to Sydney by the Port Sydney or by train.\n\nThe boat is lousy and the crew are trying to stay in Sydney for Xmas and to further their ends they will feign illness so as the boat will be quarantined. The boys found this out and have decided to send delegates to interview the Colonel.\n","228":" At a mass meeting of N.S.W. and Queensland men\n\nit was decided unanimously not to return to the ship. The men who were detailed for guard over the officers kits aboard refused to leave the wharf this morning and consequently officers had to guard the boat and guard their own gear.\n\nMajor Burret of the","229":" Btn Officer i\/c N.S.W. and Queenslanders called a meeting this afternoon and told us that if we went aboard the ship he would see that each man had a hammock to sleep in (there was a shortage during the trip) and would issued with clean blankets. The ship would be thoroughly cleaned and disinfected.\n\nfurther more he would wire to the officer i\/c quarantine in Sydney and get a clearance for the troops providing no case of flu broke out among them before they reached Sydney. If any of the crew got the flu it would make no difference to our landing as soon as we reached Sydney. We accepted these terms and on Sunday afternoon","230":" we marched aboard. At 3pm the ship pulled out of Portsea and headed for Sydney.\n","231":" Everyone is a little excited. To think that by this time tomorrow we shall be HOME.\n","232":" It is misty and though\n\nWe know we are close to land we can’t see it. \n\n8.30am Have just sighted a collier who told us we are at Broken Bay so we are turning about now.\n\n10am Manly is sighted on our right and Sydney Heads are not far distant. 10.15 Have just entered the heads and are heading for Coasters Bay \n\n 11am The health officer has been aboard and we are now on our way to the wharf. The old ship is decorated from stern to stern with bunting. Ferry boats- launches and skiffs are chasing about us and everyone is madly excited. We are the first boatload\n\nof soldiers to come direct from the trenches to Sydney via the heads.\n","233":" noon we are now getting ready to go ashore. Also wagons are waiting on the wharf to take our kits to the Barracks where we will have to go and collect them tomorrow- but we have decided to carry our own gear for we did not bring souvenirs all this way to have them taken from us now.\n\n1.30pm Home at last. Gee! what a reception we got from the people of Sydney. It was worth all the risks to come home to such a welcome. \n\nI have sixty days furlough and then I will be discharged from the A.I.F.\n\nI have had some rough times and some good times- but isn’t it good to be free again?!! \n","234":" Discharged after a total service of 4 years and 157 days.\n\n"}}