{"Document Name":{"0":"Diary_0359","1":"Diary_0359","2":"Diary_0359","3":"Diary_0359","4":"Diary_0359","5":"Diary_0359","6":"Diary_0359","7":"Diary_0359","8":"Diary_0359","9":"Diary_0359","10":"Diary_0359","11":"Diary_0359","12":"Diary_0359","13":"Diary_0359","14":"Diary_0359","15":"Diary_0359","16":"Diary_0359","17":"Diary_0359","18":"Diary_0359","19":"Diary_0359","20":"Diary_0359","21":"Diary_0359","22":"Diary_0359","23":"Diary_0359","24":"Diary_0359","25":"Diary_0359","26":"Diary_0359","27":"Diary_0359","28":"Diary_0359","29":"Diary_0359","30":"Diary_0359","31":"Diary_0359","32":"Diary_0359","33":"Diary_0359","34":"Diary_0359","35":"Diary_0359","36":"Diary_0359","37":"Diary_0359","38":"Diary_0359","39":"Diary_0359","40":"Diary_0359","41":"Diary_0359","42":"Diary_0359","43":"Diary_0359","44":"Diary_0359","45":"Diary_0359","46":"Diary_0359","47":"Diary_0359","48":"Diary_0359","49":"Diary_0359","50":"Diary_0359","51":"Diary_0359","52":"Diary_0359","53":"Diary_0359","54":"Diary_0359","55":"Diary_0359","56":"Diary_0359","57":"Diary_0359","58":"Diary_0359","59":"Diary_0359","60":"Diary_0359","61":"Diary_0359","62":"Diary_0359","63":"Diary_0359","64":"Diary_0359","65":"Diary_0359","66":"Diary_0359","67":"Diary_0359","68":"Diary_0359","69":"Diary_0359","70":"Diary_0359","71":"Diary_0359","72":"Diary_0359","73":"Diary_0359","74":"Diary_0359","75":"Diary_0359","76":"Diary_0359","77":"Diary_0359","78":"Diary_0359","79":"Diary_0359","80":"Diary_0359","81":"Diary_0359","82":"Diary_0359","83":"Diary_0359","84":"Diary_0359","85":"Diary_0359","86":"Diary_0359","87":"Diary_0359","88":"Diary_0359","89":"Diary_0359","90":"Diary_0359","91":"Diary_0359","92":"Diary_0359","93":"Diary_0359","94":"Diary_0359","95":"Diary_0359","96":"Diary_0359","97":"Diary_0359","98":"Diary_0359"},"Date":{"0":"unknown","1":294.0,"2":295.0,"3":296.0,"4":303.0,"5":310.0,"6":312.0,"7":313.0,"8":314.0,"9":315.0,"10":316.0,"11":317.0,"12":318.0,"13":319.0,"14":320.0,"15":322.0,"16":323.0,"17":324.0,"18":325.0,"19":326.0,"20":327.0,"21":328.0,"22":329.0,"23":330.0,"24":331.0,"25":332.0,"26":334.0,"27":335.0,"28":336.0,"29":337.0,"30":338.0,"31":339.0,"32":340.0,"33":341.0,"34":342.0,"35":343.0,"36":344.0,"37":345.0,"38":346.0,"39":347.0,"40":348.0,"41":349.0,"42":355.0,"43":356.0,"44":357.0,"45":466.0,"46":467.0,"47":468.0,"48":469.0,"49":470.0,"50":471.0,"51":472.0,"52":473.0,"53":474.0,"54":475.0,"55":476.0,"56":477.0,"57":478.0,"58":479.0,"59":480.0,"60":481.0,"61":482.0,"62":483.0,"63":484.0,"64":485.0,"65":486.0,"66":487.0,"67":488.0,"68":489.0,"69":504.0,"70":505.0,"71":514.0,"72":519.0,"73":567.0,"74":594.0,"75":595.0,"76":622.0,"77":623.0,"78":624.0,"79":677.0,"80":679.0,"81":684.0,"82":708.0,"83":709.0,"84":710.0,"85":713.0,"86":716.0,"87":762.0,"88":788.0,"89":802.0,"90":824.0,"91":825.0,"92":826.0,"93":827.0,"94":832.0,"95":857.0,"96":879.0,"97":896.0,"98":897.0},"Entry":{"0":"\n\nI left Dungog by 9.50 am Train on ","1":" reached Sydney, 3.30 pm arrived Kensington Camp at 5 pm. \n\nOn","2":" at 10.Am it was raining very heavy at about 11.Am. We set out in the rain to march to the boat, just our Company went on the boat. We arrived at 2 pm all pretty well drenched to the skin most of us had to go on Guard but luck happened I was not told off. I went to bed. about 7.30 pm. that night & slept very well. \n\nWe were all up at 6.Am. on","3":" making ready for the arrival of the other 900 troops. They arrived at 10 am. & were all on board in 20 minutes as soon as the horses were put on at 11.Am. we moved out towards Watsons Bay and anchored there. At 4.30 pm we moved & went out through the Heads at 5 pm. I was very uneasy all the night nearly every one was sea sick I myself was not sick but felt very scormish so I did not have very much sleep but felt better next morning. There was nothing very startling happened on our way to “Albany\", we saw several “Whales\", “Sharks\" & “Flying Fish\" The sea was very calm hardly any rocking at all.\n\nOn Sunday the","4":" when we woke we found ourselves surrounded by a number of small islands which were like small mountains towering into the sky. an hour later we reached the heads of Port Albany,\" Western Australia. It was a very pretty sight it took us about an hour to go from the heads up to the “Jetty\", and during that time we had church service, we also had the Band playing. Just before we reached the Jetty we seemed to be passing between two high walls of rocks & they seemed to be only a few yards away from the boat. When we reached the Jetty it was about 11.Am. & by the time we got close by & were made fast it was 12 pm. Their were not many people on the Wharf only a few children at 12.30pm the Mail steamer arrived from “Fremantle,\" bound for Sydney there was great cheering which I will never forget the Jetty is only just room enough for a double line of Railway to run along it is very small \ngauge\n guage only 3Ft 6\" about the same as Queensland railways. as near as I can say so we were quite close to the Mail boat there we a good few passengers, a rough guess 350 they only stayed a couple of hours to pick up & drop the Mails.\n\nWe took in water all the afternoon & during the time there were a good few people gathered around. there were some tricks among them at 5.30pm we shifted out into the Harbour, Every morning when we got up we could always notice fresh boats. anchored in the Harbour. While we stayed here, & during this time we had rather a good time, the Band played nearly every night & we had some very good concerts. One especially was very good as they had fancy Costumes, on Sunday morning","5":" at 7 Am we lifted anchor & made another start there were also 43 other boats it was a great sight to see them all lining up & making for the Heads out to Sea. Each one had its band playing. \n\nBy Tuesday we were many miles out in the Indian Ocean it became very rough at times I thought the blessed old “\"Suffolk\" would tip over. Towards evening it become so rough that our usual Parade had to be cancelled owing to it being so rough. Most of the boys are sick again we could not keep anything on our tables at tea time as the roll of the old boat used to slide everything from one end of the table to the other.\n\n \n\nA lot of the boys are suffering from bad colds the night of the","6":" was pretty rough about 2 Am. there was a bit of excitement took place one of the Electric wires fuzed which caused a big blue flame one of the men shouted fire men were tumbling over one another trying to get to the deck I myself stuck to my bed & never moved. However the fire was not serious & did no damage. \n\nOn the morning of the","7":" our Company peraded as usual at 10 am. after we had gone through a little semefore signalling we were taken up to the nose of the boat on the top deck where a big canvas bath had been erected. So we all had a bath it was good sport only it was not hardly deep enough. \n","8":" It was very warm last night we are now getting towards the tropics about 11.Am we were having our usual perade when the H.M.A.S. Sydney passed quite close after the perade was dis-missed the bugal sounded for Beer which most of the men on board longed for, most of them pass away the time by gambling, as soon as they draw their pay away it goes.\t\t\t\t\t\t\t\t\t\n\nThe chief games they play are Crown & Anchor & Banker. last night was very warm again most of the boys slept on deck, yest terday afternoon a large Mail boat passed us it was travelling much faster than we were our speed for yesterday was 243 Knots we had another concert last night it was very good. This morning","9":" is much cooler & very cloudy I got nockilated yesterday & my arm is very sore this morning \n\nOn","10":" nothing very startling happened we had another bath perade & they threw a couple of the men into the water clothes & all. my arm is still very sore. \n\nOn the","11":" we had a boxing & wrestling contest last night it was very good when ever there is a row between two men they always settle it in the ring. The days are getting very warm, nearly all the men are sleeping up on deck. I had rather a good sleep last night a little better than the night before as somewhere in the middle of the night a bag of turnips rolled down on a couple of us. Its just a week ago today since we left “Albany\", time soon flies. It is very amusing to see some of them taking their usual early morning bath, when they are hoseing the deck down.\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nsome of the men get out on the deck & get hosed down. Pat Throsby is always among them, he gets about in the day time in a little short pair of trouses he looks a trick. At 10.am we fell in & had church perade & at 2.30 pm eve were turned out in full marching order to have our Kits examined after about an hour we fell out & had nothing to do the rest of the afternoon but to amuse our selves. So we had Dancing, & games, we a getting pretty well into the Tropics now. We have received several wire-less messages. \n","12":" Last night was very warm I slept up on deck light rain fell about mid-night & a lot of us were disturbed just as we got settled down we were woke up by several shots from big guns we have not heard what they were for yet. We can see several of our Convoy in sight, about 10am this morning we noticed two of our Battle ships making west-ward at great speed & guessed something must be doing after a while we could hear several shots but were very faint at 2.30 p we received a wireless to say \nThe “Sydney\" had sunk the Emden\n which had been causing so much trouble. There were two killed & 13 \t\t\t\t\t\t\t\t\t\t\n\nwounded on the “Sydney\" there was great cheering among us & we were given a half Holiday. \n","13":" Last night was very warm there was a great disturbance when it was announced that all lights had to be extinguished & everyman to sleep with a life belt on owing to the fear of more enemy boats being about & fearing that the Emden had laid mines.\n\nThe","14":" This morning I did not feel very well I had a very sore throat so I went to the Dr. about 7.Am when he saw me he ordered me to Hospital. I was there until this morning","15":" its been raining very heavy this morning we have all been granted a holiday as we crossed the line today. There is going to be great excitement as the old custome those who havent crossed the line before have to be dipped by old “Father\" “Neptune\" about 2 pm the fun started nearly every man on board got dipped into the water. they had a large canvas tub made it was about “4 Ft.\" deep & was full of water, every “officer\" on board got dipped “Father\" “Neptune\" dressed like a hairy man was the old “Bostin\" of the ship & “Major\" “Gordon\" was the Barber.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nThere were about 10 or 12 acted as Police the Police used to catch any one that had never crossed the line before they had a bucket of fat, soap & salt all mixed together & they used to catch the first one they saw & smear him all over with the fat & throw him into the water. There was not very much hope escaping it as they looked in every cabin & all the places where anyone would be likely to hide when they had pretty well finished dumping all the men into the water, they went in & got all the cooks & butcher & gave them a dipping & at last they grabbed “Major “Scobie\" & gave him a dip.\n","16":" Last night was very hot. I was up about 5 am and had a good cold shower & then went up on the top deck & had a smoke & watched the sun rise over the water it was a very pretty sight & also all the great line of boats the New Zealand troop ships 10 in all left our convoy yesterday & have gone ahead, we expect to reach Colombo tomorrow.\n","17":" This morning is very dull & like rain. There was nothing of any importance happened last night. The band\n\nplayed a few good selections up on deck, & after that a lot of us joined in & had a dance it was very good we kept it up till 9 pm when the bugal sounded for lights to go out so we went down for our hammocks & brought them up to sleep on deck as it was very hot. We had just got nicely settled when a very heavy shower of rain came on, you never saw such a devil of a scatter in all your life as the hatch is not very large & it put me in mind of about 50 rabbits all trying to get into the same hole at once. Anyhow those who did not get down were shoved or pushed down & by the time all the pushing was over the rain had stopped. Well this morning we were all pleased to see a bit of land once more, \nus\n the first we have seen since we left Australia. It is the south coast of “Ceylon\". We expect to reach “Colombo\" about midday. Well we arrived at 2.30 pm & anchored & were well protected by Gun boats. There is a large Russian Cruiser not very far from us at present. “Colombo\" from the distance is a very gay looking place. We can see the principal Hotels in the distance they are surrounded by Lawns & trees which gives the place a very actracting apperance.\n\n& at night when the city was \nlight\n lit up it looked very pretty with 50 or 60 boats lit \nlight\n up as well. The high mountains which form the back ground of the city is called “Pedrotaliagalla\" & is 8,280 ft. high.\n","18":" The Captain & some of the ships officers went ashore & brought back the papers with the latest war news. The Dr. read it out to us all which we were very pleased to hear. Looking with a pair of glasses at “Colombo\" you can see the natives running along the roads pulling “Rickshaws\" which are very comical things to look at one man remarked that they looked like big Turkey’s.\n","19":" This morning is very warm, last night was passed away by a boxing contest it was very amusing two fights ended in \nko\n nock-outs, there was great excitement when Jimmy Gray of (H Coy) & another chap entered the ring to have a 4 round spar. it was the wildest hitting I have seen for many a long day Jimmy nocked up his hand in the first round & had to throw the towel in. We left Colombo at 12 pm & were escorted out by a Russian & English Cruisers. they passed quite close to our boat. \n","20":" \n\nWe were to have had some more boxing last night but owing to having to travel with all lights out it was posponed until a later date most of us were sleeping on deck last night & about 12 Am it started to rain so we had to go below & finish the night we are travelling at top speed 12 to 14 knots per hour.\n","21":" There is nothing of any importance happened today, they had a bit more boxing this afternoon. I may mention when we left “Colombo\" we left the New Zealand troop ships behind 10 in all & they are just coming up in the distance now.\n","22":" This morning was very clear its very pretty \nits very\n to see the big fleet of troop ships dotted here & there with a few Crusiers There is nothing of any importance happened today.\n","23":" This morning about 4.30 am search lights began to work from the line it was reported that two men were overboard from the troop ship “Shropshire\" last night was a little cooler than usual.\n\nWe had our usual drill it was very amusing to see us of course they call it exercise we were having wheel barrow races leap frog it all helps to fill in time after we had finished we were all marched up to hear a little war news that they had received by wireless we have heard several yarns re the search lights this morning some say there were two men overboard others say that two of the troop ships colided with which the latter turned out to be right, we are getting issured nearly every night with lime juice which is very nice as the water has been very bad this last few days the colour of tea; I have been sleeping up on deck every night lately as its much cooler we will soon be getting into the cooler weather now. We have 2,621 miles to do before we reach the Suez Canal. We average about 250 miles per day we have had very good weather so far. there has been no rough weather to speak of only one night was very rough. last night Pat Throsby & I had a good old yarn of old times & wondered what they were doing at home we are\n\n \n\nsleeping along side of one another we often talk for hours of a night & wonder if we will ever return to tell the tale.\n","24":" Last night it came on a very heavy shower of rain so we threw a tarpaluan over us so we were alright & never got wet. This morning one of the boats broke down & one of the cruisers went to her assistance this morning is much cooler & also the \ny\n days are getting shorter just fancy 8 am here & its dinner time at home this afternoon passed away very enjoyable to hear the band & also some Piano and Cornet playing\n","25":" This morning we sighted land on the East coast of “Africa\", we could just see it in the distance I suppose its 20 miles away we have noticed an Island on the coast its very barren looking with sandy hills behind.\n","26":" We passed Aden this morning & we expect to call at port “Said’ which we will reach in about 7 days\n","27":" we are getting close to the Red sea now while in Aden which we did not expect to see\n\nas our course was changed instead of going right through to Port Said we stayed a few hours in the harbour its a very barren looking place to look at in the distance & is surrounded by high mountains & behind them there is nothing but sand, they say it has not rained here for years.\n","28":" &","29":" We mounted guard in the Red sea & passed what they call the gates of “Hell\" which is rightly named.\n","30":" We came off guard and got the news we were to land in Egypt & great excitement prevaled.\n","31":" Last night was a little cooler than usual about 4.30 am this morning one of the crews fireman died the burial took place this morning at 10 am its rather \nal\n different from those on land they sew the corps up in a canvas bag and put large weights in it to make it sink quickly they carried the corpse on a stretcher to mid ship & placed it on a large board then the burial service was read by our Colonel the boat was stopped dead & the corps was then \n\nslipped off the board into the water then the band played the dead march – it was a very pitifull sight it seemed to pass a gloom over the boat all day\n","32":" Its been very cool all day they had some more boxing this afternoon we can see land on both sides of us now we hope to reach the canal tomorrow morning\n","33":" Last night it blew up very windy & it is still windy & cold. we are now right up at the north end of the Red Sea. We are hemmed in on both sides by large rocky mountains we reached the entrance of the Suez Canal about midday it was a grand site to see so many boats close together & at night, all the lights from them looked like a large City, there has been no drill this afternoon on account of some more boxing. Contests \nha\n that had to be finished before we left the boat\n","34":" & Thursday 2. & ","35":" I may mention that we layed out side the canal waiting our turn to get through as only one boat can enter the “Canal\" at the time & they have to be about a mile apart. this morning we made a start \n\nto go through the much talked about Canal. Just before we started we could see a Fleet of about 15 Troop ships coming up behind us & we learned afterwards that they were Indian troops so this made about 70 boats in all waiting to get through about 8.am the Piolet came on board & we made a start. it was a fine sight as we entered the canal. There were hundreds of small sailing boats full of Natives the “Canal\" is only a few yards across Suez Town is not a bad place to look at there are some fine buildings with plenty of trees in the streets one of the streets runs right along the banks of the “canal\" you could through a stone out of the boat into the street & on the other side there were several Natives with Camals. the streets are full of Donkey Carts, we are getting into a more dangerous place now they have all the banks well fortified with Machine guns for fear the Turks may envade it & and there are some 40 thousands troops guarding it, & nearly all have their trenches dug out. about 3.00 pm we passed the town of “Ishmalia\" there are hundreds of natives along the banks they are doing some repairing, we had\n\ngreat fun throwing things into the water & they used to dive in after anything at all I am sure some of them followed the boat for miles they are a very dirty race & would run along pulling their clothes over there heads & some of them had none on at all to pull over. The Indians look a fine looking lot of troops that they have guarding the “Canal.\"\n","36":" 14, Last night it was a lovely moonbright night all along the Canal they have planted some kind of a tree which is like a hedge & as the railway line runs along under these trees I can tell you with the lights from one of the Express trains & the lights from the boat shining on the water was a very fine sight I turned into bed about 7.30pm & went to sleep. at about 10pm I heard a devil of a row. I could not make out what on earth it was but when I got up I found we were w at Port Said & there were hundreds of natives men, women & Kids, all yelling at the top of their voices with a basket each & were coaling the boat. Its was the funniest thing I ever saw. I Knew there was no hope of\n\ngetting any more sleep so I got up & sat & watched them all night. I have often read & have been told about Port said but one would never bleive it until he saw it with his own eiyes. there are hundreds of boats in the Port. There are 3 large “Aeroplanes\" stabled along side of the wharf. in large Canvas sheds the \nsa\n small boats came along selling Cigaretts matches & oranges, about 9 am we made another start it was a very pretty sight to see all the Crusiers lined up on one side & as we passed our band struck up & played us out of Port. Just as we were nearing the enterance a large “Hydroplane\" rose up & came flying only a few feet above the masts of our boat it was great excitement as it was all new to us. it was travelling at great speed. the Piolet \nwaved way\n waved to us. it was making a terrible noise like a big Loquest. As we came out we cheered every boat we passed & they also cheered us.\n","37":" We landed at “Alexandria\" about midnight & layed in the harbour it is a pretty large town\n\nWe are waiting to disembark, all our company are on guard today.\n","38":" There is nothing of any importance happened today only we are still waiting to disembark.\n","39":" About 12 oclock we went in along side of the wharf their are hundreds of natives along the wharf the native Police are very funny they bang into them with a big stick if they dont keep away. out of the road We are going up to “Cairo\" tomorrow\n","40":" About 9.30am we were all ready. A. B C. D & E Company. to disembark we started off about 9.45am & by 11 am. we were all in the train the railways are worked on pretty well the same system as ours in NSW & are all native worked We were taken about two miles out by a small Engine & then that was taken off & a large one put on.\n\nI can tell you some of their trains are not too slow. & as the road was clear & the line is a very level one we rocked along at a fairly good speed for awhile it took us 7 hours to go to Cairo its a fine sight along the track as the country is very thickly populated with villages built of mud every few hundred yards & they are full of Egyptians & they are as thick as bee’s when we arrived at Cairo we had hot tea & bread & cheese provided for us. & set to work to unload our train & load it into tram cars it was raining all the time, after about an hours work we finished loading them & got into another lot of cars that were ready for us. they are all Electric trams after about an hours ride we reached “Mena Camp\" where we had to set to work & unload all the trams after this was done we marched over into the camp & dossed down on the sand about 11 pm for the night\n","41":" Well last night it was very cool & as the ","42":"\n old saying is when the “Sands of the desert grow cold. Well its true alright. Well we were very busy today looking around for old bags pieces of timber ect. to see if we could make a sort of shelter to sleep under as we did not have any tents any how we managed to dig up a few bags & made a very good one. “Cairo\" is about 6 to 8 miles away but it dont take long in the tram. The “Pyramids\" are quite close to us just behind the camp. they look like huge mountains how ever in the name of goodness they built them I would like to know. they are wonderful. no mistake. I got some of my English money changed in Egyptian money talk about money for a £1 I got a pocket full but goodness only knows I dont. for he may have only gave me 10\/- or 15\/- worth any way I cant argue with them, for I dont no one coin from another.\n\nEnd of trip from Australia to Egypt.\n\nFrom","43":"\n\nTo","44":"\n\non\n\nTroop Ship “Suffolk\".\n","45":"\n.\n\nWe left Mena Camp at 5 pm yesterday & marched into “Cairo\" arrived at 9.30pm. on No.1 Centeral Railway we left at 12 Am & arrived at “Alexandria\" at 5.30am & Embarked on the “Derfflinger\" A 10. which was captured by the British The trip from Cairo to Alexandria was not a pleasant one, as we were crowded into","46":" class carrages & did not have any room to even move our legs & little alone get any sleep. at about 2pm we were on board the 2nd&","47":" Battalions about 2,500 all told.\n","48":"\n\nToday was a very busy one about 300 of us were kept busy loading 5200 sand bags after we were finished them we were put on to carry 50 Lbs boxes of biscuits to be loaded we had to carry them fully 200 yards & by the time we got one of these to its destination they were pretty heavy there were 2000 cases to load so it was no small task. at 7.30 pm we made a start for this unknow destination\n","49":"\n\nI am too sick to write any.\n","50":" I got up this morning feeling pretty crook but feel much better this afternoon we have been in sight of land all day & we have been issued with ball cartridges.\n","51":" About 11am we arrived at the Island of “Lemnos\" There are several boats here when we arrived. We can see in the distance the high mountains which are the “Dardenells\" which is somewhere about 40 miles away.\n","52":" This morning is very cool somthing like the climate at home quite a change from Egypt.\n","53":" Today is a bit windy we filled in the afternoon by going for a swim\n","54":" Today is a beautiful day nothing at all doing most of us laying around on the decks.\n","55":" Nothing doing\n","56":" It is raining very heavy.\n","57":" About 10 am we were all put into rowing boats & tugged ashore to have a dumy landing it was great excitement when we landed we marched up on one of the hills close by which was covered with beautiful grass & wild Poppies which were all out.\n","58":" Nothing doing\n","59":" Its a beautiful morning most of the troops went ashore but our Coy. did not go. During the afternoon a lot of the boys went in for a swim.\n","60":" &","61":" There was nothing doing yesterday & today to write about\n","62":" I got up this morning not feeling to well had a very sore throat so went to the Dr. & he gave me some tablets & the day off duty.\n","63":" Today There was nothing doing\n","64":" When we go up it was very rough looking & started to rain it has continued all day its terrible miserable everything being so wet.\n","65":" Nothing.\n","66":" Its a beautiful day during the after noon\n\nour Platoon with Leut Westbrook went out boating over to see the Queen Elizebeth.\n","67":" still on boat\n","68":" About 6 am we got into Destroyers & were taken some distance towards the shore & then got into life boats & were tugged towards the shore with small tug boats then we had to row the rest of the way. I can tell you it was a very exciting time shells were flying every where & some of them were splashing the water over us its a wonder to me that any of us are left to tell the tale. As the shrapnel was whistling all round us & one of the boys sitting next to me got hit in the thumb. when we rowed close enough to be Beach the officer gave the order to jump out & make for the shore. I made a jump out and found myself in about 3 ft of water. anyway it did not take me very long to reach the sandy beach & I can tell you. I was not last in arriving there we had to run over the sandy beach & get under cover for the shells we busting all round us & plenty of my mates only a few feet away\n\nwere blown to pieces after we got together what was left of us. made up the steep ridge & every now & again one of the boys would drop either wounded or killed. as they could play the machine guns on us. After going a few hundred yards up over the ridge & into a gully we were opened fire on & it was pretty warm too. So we at once layed down & opened fire in a thick brush where the firing seemed to come from After a few minutes it eased off & we made a sharp rush forward & got possession of it I came across a Turk laying wounded with his rifile laying beside him so I grabbed his rifle & broke the stock off it so as he could do no harm with it. After we got through the thick brush we had to climb a very steep cliff so we helped one another up. when we got to the top we were met again with heavy rifle fire but we charged over the ridge & got possession of it & facing us we could see the Turks in trenches ahead of us. here we kept under cover & took off our heavy packs as we\n\nwere justed about run out of wind After we all got rid of our packs we made a charge with Baynots at the trench & what Turks that did not bolt away were killed. by this time we found ourselves mixed up with all different boys from every Battalion as it was very easy to get lost in the thick bushes any way we formed a sort of a line & started to dig in with our entrenching tools & I can tell you it did not take us very long to heap up the dirt & fill the sand bag we were carrying with us by this time the Turks had found out where we were & they started to attack us but we kept them back with rifle fire any way they made it pretty warm for us as we were laying flat on the ground & you could not lift your head as the \nmachine g\n machine gun bullets were plowing up the dirt in front of us & they started to shell us which made things a thousands times worse I thought my end had come many a time as men were falling all around me & some of my best mates were\n\nlaying killed & wounded by this time night was coming on & I was detailed off to go & carry water & amunion up to our line I can tell you it was a long carry from the Beach six of us set out with a load each but only two of us arrived as the others were all wounded. I thought it was the longest night I ever put in there were wounded & killed laying every where\n\nWell we are now in a place called Browns Dip it somewhere about a week since we landed things have \nquait\n quitened down a bit since then. Diary writing has been out of the question as any spare moments one was very glad to get a little sleep. We have got fairly good trenches dug & we are all busy making ourselves dug outs. During the last week I have been detailed off as a stretcher bearer to my Coy. B Company. as all the old bearers have been killed or wounded. I might say I lost my tobacco in the landing & I havent had a smoke for over a week what would I give for one. any thing. but again I would give more for some steak & onions\n\nas Tucker is not too plentyful but I suppose we ought to be thankful to have any.\n\nWell what day or date it is I cannot say I asked a couple of my mates but they did not seem to know but any way its some day in 1915. We have made ourselves very comfortable now. the Turks have been putting some very large shells at us this last few days one fell just above my dug out & did not go off just as well for it was a huge thing I could not lift it off the ground. so it was some size.\n","69":" There was great excitement today when we found out that the","70":" Light Horse Bridgade had landed during the night. & I can tell you we were pleased to see them too.\n\nAfter doing my 24 hours on in the trenches as bearer. I came down to my dug-out about 50 yds from the front trenches & went & had a sleep. About 3 am on the morning of the","71":" my mates woke me up & told me that something was doing you could hardly hear yourself speak for rifle & machine gun fire I rushed up to the trenches & found\n\nthat the Turks were attacking & they were coming in Thousands & our boys were mowing them down as fast as they come it was only about 50 To 60 yards to the Turks trenches. some of the boys rifles were running hot with so much firing of course we were kept busy getting out the wounded. it finished about 8 am when the Turks thought the game was up.\n\nThere were Turks laying as thick as bees in front of our trenches dead. things were very quiet all day. on the","72":" we held an “Armistiss\" for the Turks to bury there dead. they started about 8 am in the morning & were kept very busy they buried some thousands they say they have lost 7000. for my part I would not mind if they had lost the lot. some of the Turks were dressed in green uniforms they looked like some picked troops some say they are the sultains guards. they finished about 5 pm & we started to fight again.\n\nThings have been very quiet of late nothing very much doing since the Turks attacked us perhaps they have had enough of it.\n\nOn the","73":" I was\n\ntransferred to the A.M.C. details attached to our Battalion. Three of us boys in the stretcher bearers were asked by the Dr. if would take it on so we said we would. \n\nOf course it was all new to us. so we had to buck in & learn all we could about the different things Things have been very quiet. I dont mind telling you we are always looking forward to the mails coming in & some letters & papers from home. There are 5 of us & a Dr. in the A.M.C. & we have to cook for ourselves we each take it in turns to cook 4 of us day about our most common dish is Bullie beef & stews & pancakes. we grind up the biscuits by hammering them with an entrenching tool handle & make porridge with them they are not to bad at all.\n\nThings have been very lively this last few weeks they have been digging a sort of roads all round the steep hills & we were wondering what they were for but we soon found out for a few days after fresh troops began to arrive & we found out that our Brigade had to take what\n\nis called The Lone Pine every body has been wondering when it was to come off but we were told it was to come off on the","74":"\n\nThe","75":" arrived & in the evening at 4.30 pm our guns started to fire on the Turkish trenches. & a few minutes after our boys hopped over the top & charged the Turks. almost straight away the wounded started to come in. I was over into the Turks trenches not very long after the boys got there for there was plenty for us to do. After it got dark enough we started out to pick up all the wounded that were laying between the two lines of trenches I can tell you there were some terrible sights men laying their with broken legs, arms, & some with a leg blown off. we could not do very much for them only put them on a stretcher & carry them back to our old trenches, where they could be put in safety\n\nI can tell you the boys were fighting very hard all night hand to hand all the time & I dont mind telling you the Turks kept on attacking our captured position to try & gain it back but we were not to be shifted The Turks trenches are very deep trenches & they put me in mind of an Ant’s nest & most of them were covered in with sleepers with dirt thrown over the top of them. I dont mind telling you I had some very narrow shaves. I was hit in the back & nocked down by a piece of shell but luck happened it did not hurt me very much. We were all very pleased when we got word that we were being relived by another Battalion for we were all just about \nk\n nocked up.\n","76":" well we are back on the Island of Lemnos. We got payed today. We are over for a spell. Whats left of us & I dont mind telling you its a treat to be out of that hole of a place. We \nwe\n got a boat & three of us & went over the Harbour to Mudros to see if we could get some butter & tinned fish well after we arrived there we found a Greek shop in an old wind flour mill\n\nhe seemed to have a good stock of butter & Tinned fruits so we bought 20 Lbs of butter of a lot of Tinned fruit & fish & made back to our boat, going back it was a bit rough & I got terrible sea sick & I can tell you I was not sorry when we pulled into the shore. Well we are in Tents here & are very comfortable too there is a village quite close to where we are & we can buy plenty of fruit & tomatoes so we are living very high with bread & butter evry meal I can tell you it a treat for I hadent tasted butter since I left Egypt. Our old Dr. was sent away yesterday sick so today we received a new one. Major McDonald. We are having a very good time. nothing to do. only our sick perade every morning.\n\nWell things are much about the same. we had a very good concert a few nights ago. something new for us. At the finish they sang boys of the old Brigade. Capt MacKenzie of the","77":" Btn. asked all the boys to sing “where are the boys of the","78":" Brigade & I dont think there was a dry eye in the place. it was very sad. the New Zealand band\n\nplayed some very nice music.\n\nWell we have been very busy this last few days getting things together to go back to “Anzac\" We are now on a boat called the “Ismania\" about 7000 Tons. Well on leaving the camp today I never had such a load of things in all my life I had all my equipment & a big sugar bag of tinned butter fruit & fish for we knew we would not get any once we left. I will never forget it We had about 1½ miles to walk & I thought it was 20 miles one of the men along the road who was riding asked me if I was a camel. Well we arrived on board","79":" Well we amused ourselves by playing cards all day & night. on the evening of the","80":" we started back again & arrived that night & camped on the side of the hill. next day we went up into the firing line & stayed there for a few days & then came round towards Browns Dip to relieve one of the","81":" Brigade Battalions. Well we are settled down very comfortable in a nice big dug out partly covered with tin & partly with water proof sheeting.\n\nWell things are very quiet We go down to the beach nearly every day & have a wash as fresh water is so scarce.\n\nWell I am many miles away from Anzac now.\n\nOn the","82":" in the evening it came up very cold & windy & talk about blow well it nearly blew our roof off our dug-out but anyway by two of us hanging on to one corner of it \nwe\n we managed to save it from being blown off. when \nwe\n I woke up in the morning of the","83":" to our surprise I \nwe\n found that snow was falling the first time in my life that I had ever seen snow. of course we had some fun snow balling one another. about 4 pm in the evening I got a fit of the cold shivers & could not get warm. things were very quiet & as I could not hold my head up I layed down in the dug out & \ntryed\n tried to go to sleep but I was so cold my mates gave me their over coats & put them over me but I was still cold & my head was nearly bursting \nI had\n in the morning I felt terrible bad & about 2 pm on the","84":" they put me on a stretcher & carried me down to the\n\nHospital on the beach. To No.1 stationary Hospital. on North beach where I stayed until the","85":" & was taken on a stretcher in a launch out to a Hospital ship & put a board where they found “Diptheris\" was my complaint I can tell you I was very bad & did not know anything until the","86":" when they took me off the boat at “Alexandria\" & took me to the","87":" General Hospital “Alexandria\". \n\nI have been here some weeks now in Hospital. I am beginning to feel myself now. The nurses are very good to us all & they gave us a very pleasant Xmas. Its a beautiful Hospital & was once a German Hospital.\n","88":" Well I arrived back to my old unit yesterday. & I can tell you. there was a great re union among old mates. \nWe are ho\n at Tel-el-Kebi. We are having a good old time as we are in tents. I have been down to the old Cemetery where a lot of men are burried who fell in the battle of Tel-el-Kebi. the remains of the old trenches are still to be seen around the camp. The train line runs quite close to the camp.\n","89":" We left\n\n \n\nTel-el-Kebi yesterday by train & arrived in this hole of a place called “Seraupen\" nothing but sand. On the “Suez\" “Canal\" its a terrible miserable place here.\n","90":" There was great excitement today when the Prince of Wales came riding into the camp. he only looks quite a boy. There are rumers of us leaving here any day so we are wondering when its coming.\n","91":" On the","92":" we broke up camp & marched across the pontoon bridge over the Suez Canal & arrived at 4 pm. at a railway siding & sat down to wait for the train & it did not arrive until 1.30 am. so we got into open trucks & made a start I don’t mind telling you we did not get any sleep. we arrived on the morning of the","93":" about 9 am at Alexandria & embarked on the Ivernia & sailed about 4.30 pm. last night was not too bad I am not sea sick we are very comfortable & have bunks to sleep in its \nabout\n a very fine boat some say its about 14,000 tons. \nIn France.& our Trip\n the first place our boat called into was a place called “Toulon\" on the","94":" It is in the South of France\n\nIt is a very pretty place & is the French Naval Base & is strongly fortified. It was 2 pm when we arrived & we dropped anchor & stayed until next morning at 9 am we made another start & arrived at “Marseilles.\" about 11.30 am the same morning. it was a fine sight coming into the harbour & we flew the old Australian flag. We pulled into the wharf & went ashore at 5 pm & marched about a mile through the city to the train where we got on board & finally left “Marseilles\" at 8 p.m. the people all seemed to go mad & they cheered us all along the streets. We seen scored of German prisioners working along \nalong\n the streets at different places. cleaning out the gutters. We were all night in the train & were pretty well cramed in. we had a bit of a sleep We were all very pleased when it broke day-light to see what the country was like everybody seemed to be very happy our first place to call at was “Orange\" our next place was Lyons where we stayed & had breakfast & its a very fine place. \nof Other\n We passed through some very large towns & went over some beautiful rivers & bridges\n\nOur next place to stop at was “Matargis\" where we had tea. & a little later we pulled up at “Mateskerbes\" but we only stayed a few minutes at every place we pulled up at their were Thousands of people at the stations about 10 am the following morning we passed by “Paris\" we could see “Affiel\" Tower in the distance it looks a beautiful place the next place to call at was Massy-Palais-Eau where we had coffee & it went down OK we were all getting very tired of the journey at one of the stations we stopped at their was a train load of French soldiers & talk about cheering & shouting & then their band & ours started to play but you could scarcely hear any music for the cheering. We stayed for a while at “Versealles\" which is a very pretty place. it was very amusing to us to see some of the get ups of the women at some of the large stations along the way. Talk about the latest “Parish\" fashions I cant describe them on paper. We all had a laugh at them. as we never saw such get ups in all our lives the next place was “Amiens\" where there were a lot of English soldiers & of course as\n\nusual there was more cheering. Altogether we were 3 nights & two days in the train & finally we were landed at our destination at about 5 am in the morning at a place called “Eklingham\" & marched to a place called “Renescure\"\n\nIn Hospital\n\nAfter we had stayed in “Renescure\" for 3 weeks we made a move up towards the line & went into the line at a place called Paten -Hall. the following day I became very sick & was sent to No.7 General Hospital. with mumps. I was very Crook for a few days. I came down here on the","95":"\n\nOn the","96":" I was discharged from Hospital & set out to join up my unit which I did not reach until 4 days afterwards & finally found them at a place call “Fleuabere\" I can tell you I was very pleased to see all the boys again they were out of the line & in supports.\n","97":" on the evening of the","98":" I got a terrible shock when they came & told me to get ready to go on 7 day leave to London.\n\n"}}