{"Document Name":{"0":"Diary_0510","1":"Diary_0510","2":"Diary_0510","3":"Diary_0510","4":"Diary_0510","5":"Diary_0510","6":"Diary_0510","7":"Diary_0510","8":"Diary_0510","9":"Diary_0510","10":"Diary_0510","11":"Diary_0510","12":"Diary_0510","13":"Diary_0510","14":"Diary_0510","15":"Diary_0510","16":"Diary_0510","17":"Diary_0510","18":"Diary_0510","19":"Diary_0510","20":"Diary_0510","21":"Diary_0510","22":"Diary_0510","23":"Diary_0510","24":"Diary_0510","25":"Diary_0510","26":"Diary_0510","27":"Diary_0510","28":"Diary_0510","29":"Diary_0510","30":"Diary_0510","31":"Diary_0510","32":"Diary_0510","33":"Diary_0510","34":"Diary_0510","35":"Diary_0510","36":"Diary_0510","37":"Diary_0510","38":"Diary_0510","39":"Diary_0510","40":"Diary_0510","41":"Diary_0510","42":"Diary_0510","43":"Diary_0510","44":"Diary_0510","45":"Diary_0510","46":"Diary_0510","47":"Diary_0510","48":"Diary_0510","49":"Diary_0510","50":"Diary_0510","51":"Diary_0510","52":"Diary_0510","53":"Diary_0510","54":"Diary_0510","55":"Diary_0510","56":"Diary_0510","57":"Diary_0510","58":"Diary_0510","59":"Diary_0510","60":"Diary_0510","61":"Diary_0510","62":"Diary_0510","63":"Diary_0510","64":"Diary_0510","65":"Diary_0510","66":"Diary_0510","67":"Diary_0510","68":"Diary_0510","69":"Diary_0510","70":"Diary_0510","71":"Diary_0510","72":"Diary_0510","73":"Diary_0510","74":"Diary_0510","75":"Diary_0510","76":"Diary_0510","77":"Diary_0510","78":"Diary_0510","79":"Diary_0510","80":"Diary_0510","81":"Diary_0510","82":"Diary_0510","83":"Diary_0510","84":"Diary_0510","85":"Diary_0510","86":"Diary_0510","87":"Diary_0510","88":"Diary_0510","89":"Diary_0510","90":"Diary_0510","91":"Diary_0510","92":"Diary_0510","93":"Diary_0510","94":"Diary_0510","95":"Diary_0510","96":"Diary_0510","97":"Diary_0510","98":"Diary_0510","99":"Diary_0510","100":"Diary_0510","101":"Diary_0510","102":"Diary_0510","103":"Diary_0510"},"Date":{"0":"unknown","1":998.0,"2":1000.0,"3":1001.0,"4":1003.0,"5":1004.0,"6":1006.0,"7":1007.0,"8":1010.0,"9":1016.0,"10":1017.0,"11":1018.0,"12":1020.0,"13":1023.0,"14":1024.0,"15":1029.0,"16":1030.0,"17":1031.0,"18":1032.0,"19":1033.0,"20":1034.0,"21":1035.0,"22":1036.0,"23":1042.0,"24":1043.0,"25":1044.0,"26":1048.0,"27":1049.0,"28":1050.0,"29":1051.0,"30":1052.0,"31":1054.0,"32":1060.0,"33":1061.0,"34":1064.0,"35":1065.0,"36":1066.0,"37":1067.0,"38":1068.0,"39":1076.0,"40":1077.0,"41":1078.0,"42":1080.0,"43":1086.0,"44":1087.0,"45":1089.0,"46":1090.0,"47":1091.0,"48":1092.0,"49":1093.0,"50":1094.0,"51":1095.0,"52":1096.0,"53":1098.0,"54":1099.0,"55":1100.0,"56":1101.0,"57":1102.0,"58":1103.0,"59":1104.0,"60":1106.0,"61":1108.0,"62":1109.0,"63":1110.0,"64":1111.0,"65":1112.0,"66":1115.0,"67":1116.0,"68":1117.0,"69":1118.0,"70":1119.0,"71":1122.0,"72":1123.0,"73":1125.0,"74":1126.0,"75":1130.0,"76":1131.0,"77":1133.0,"78":1134.0,"79":1136.0,"80":1138.0,"81":1140.0,"82":1141.0,"83":1142.0,"84":1144.0,"85":1145.0,"86":1146.0,"87":1147.0,"88":1148.0,"89":1149.0,"90":1150.0,"91":1151.0,"92":1153.0,"93":1157.0,"94":1158.0,"95":1166.0,"96":1170.0,"97":1179.0,"98":1181.0,"99":1184.0,"100":1187.0,"101":1194.0,"102":1198.0,"103":1200.0},"Entry":{"0":"\n\n","1":" Taken over the line at Ypres. A pretty warm spot it’s a big salient and Fritz gets a line on us from all directions. He put a couple of \"Rum Jars\" (Trench Mortars) over yesterday and got 17 (5 officers &1:3 Sigs) all killed except one, he was buried for 8½ hrs and when they got him out he’d one broken ankle. They could only find little pieces of the others. Was running wires from the front line all day yesterday wandering in liquid mud up to the knees, it’s a rotten place and abounds with snipers, the enemy in places\n\nare only 15 yds off. They started to put some wire out last night, but our bombs got 8 of them so they got back. Got three letters from home, heard that McGinty and the crowd have come across, but they are still ion England (Lucky beggars) \n","2":" Out all last night in the Front line mending and running wires, they are in an awful state up to the knees in Liquid Mud, and raining too got in at 5 this morning covered in mud and had breakfast and when I had to go out again. spent all day up there.\n","3":" I was held last night so had a night in but my lively little companions would not let me sleep Collins, one of our runners sniped through the heart. It is rumoured that: Fritz is going to fall back on a new line behind hill 60 but I dont think so. 11.Sept Second Div started slinging French Mortars over to Fritz last night \"to get the range\" Fritz retaliated in kind with \"Rum Jars\" and Torpedoes but they had the range, consequence was I was out on the line again half the night.\n\nhad a few killed a few wounded. Been sending a few H.E’s and shrapnel over but nothing doing. May be relieved tomorrow, hope so. Fed up with mud. Have been just reading a piece of the \"Sun\" a few extracts from \"soldiers\" \"at the Front\" amuse me one says that \"things are very slow in Flanders\" another that his billet is fine, nice bed, warm bath if required etc It probably is, I suppose he is in the Military Police or Light horse certainly not in the infantry, as far as the chap who reckons Flanders is slow, well he either never seen Flanders \n\nKnights & Knighthood\n\nIn days of old when knights were bold,\n\nThey wore tin suits that tinkled;\n\nAnd it could seem rain with might and main, \n\nBut these suits never wrinkled\n\nIn days of old when knights were bold,\n\nWhene’er their tin suits rusted\n\nThey used a cake of Monkey Brand\n\nExcept when they were busted\n\nIn days of old when knights were bold\n\nAnd tin mitts needed pressing\n\nA Tin can opener was required\n\nto help with their undressing\n\nIn days of old when knights were bold,\n\nLike canned goods they were pickled\n\nThey’d have a jar and go to war\n\nAnd then to death were tickled\n\nIn days of old when knights were bold,\n\nThey’d sometimes need a Tailor\n\nThe wife would go to \"Snip & Co\"\n\nAnd tell them what to \"Mail\" her\n\nor else he’s a hog for excitement. ","4":" had some more rain yesterday evening and the lines broken, as ill luck would have it they broke on the brow of a hill and I had to run a temporary till dark, went out out again at dusk but we started too early and had a rough Passage, got about 40 yds when the snipers got busy sending over alphaus, we had to disguise ourselves as a blade of grass for a while, but they got tired after a bit slinging em over in Singles, so they put a belt on us they went wide a bit but they soon were\n\nwhistling in the grass a few inches above our heads, we had to hug the wind for 20 minutes, then we crawled the rest of the way and got the line through, It has not broken again as yet. We are not being relieved today as I hoped, but its coming off tomorrow. A few more trench mortars came over last night and got a few of us.\n","5":" being relieved today. Just been showing the other crowd’s his lines he doesn’t look overjoyed at the prospect. Its still raining nice drizzly dope you know. War news this morning is good and they reckon \n\nleave is going to start on","6":" and Ive \"lost\" my pay book so everything looks lovely. ","7":" relieved last night marched to Ypres and waiting three hrs for the rest of the Bn By Jove it was cold got back to our huts at 4AM. Gee it was cold Got a letter from Griff hear all is A1 at home. I was glad to hear it I was a bit dubious at one stage of the game.\n","8":" Still \"Resting\" been raining for two days, mud everywhere, went into Popperinge without leave had a fair time, been issued with a new Tunic, and a Flag\n\nbadge, wonder what’s going to happen, dead Broke lost my last 10 Francs at Poker last night in two hands hard luck Jack Power one of our sigs lost a leg and we all thought he had a \"Cushy\" in the knee\n","9":" Going in again this evening. A few men going on leave haven’t got mine yet. Was in Popperinge all day yesterday had a good time and missed getting caught, I was in the night before that though and got caught by the Major at Bda, Told me to report next morning, needless to \n","10":" I forgot but has he. ","11":" am The close supports not bad . The enemy just brought down one of our planes damn ‘em. The linemans job wont be so bad here I think only been out 3 times in 24 hours but there is practically no enemy shelling, but \nif\n our heavies are going over in droves don’t feel too good on it today. Wish I could get my leave heard that Thiepval and Combles had turned it in, Combles must have been a dammed\n\nunhealthy place to live in let alone to take a wife there.","12":" just a little cold, our guns handing it out in good old style Fritz put a few back , not many gave me a bit of work mending wires. Rats are fairly also Lice Won 15 Francs at Poker. no leave yet.","13":" In close support nothing doing very wet putting in spare time blowing rats out with Howitzer Pads, good sport. Put in a Protest about the leave stunt but was knocked back \n\nam not getting a fair deal at all. But it will be all the sweeter when it does come. Morning up into the line tonight its not a bad Possie had a look over it yesterday. Senior Major and a few men of the","14":" killed yesterday by Minenwerfer.\n","15":" in the line not bad. The Artillery opened up a bit this morning but Fritz took it lying down. The rats here all some, have to keep a light running all night to keep the buggers down even then they at our bag of rations two loaves of bread and a hunk\n\nof cheese but its all in the life.","16":" One of our chaps killed just now by the Trench \"Minenwerfer\" or \"Minene\" they dont leave much of a chap when they are finished with him. A man of the","17":" reinforcements going on leave tomorrow, they are putting the dirt into myself and and another chap good and hard, I hope I ever get the chance to repay.\n","18":" On a new fangled phone apparatus, its some phone . Fritz caught a few shells from our crowd last night.","19":" thought there was a big stunt coming off last night but it was put off, going over\n\nto visit Fritz going to stop about 20 minutes I believe. This place is lousy with Machine Guns and if Fritz tries to counter he is going to get something in the neck good and hard, wild rumours floating around. I hear one minute that we are going back to the Somme for some more big stoush next I, hear a rest for the division is ordered some say stoush up north been sending a lot of stuff over the wires today that point to a move back, well I hope its right I could do with a rest, though I’d like my leave better \n\nhave tried the experiment of filling the holes near my head with pepper, to see if it would do the rats any good, but I guess not all the sneezing that was done, was by yours truly. Had a letter from Lill today also one from England.","20":" Trenching Party on tonight got to run the line for it the stunt starts at 6.30. Fritz is going to get a surprise I guess. ","21":" The raid went over last night. got two prisoners and sent a good many on the one way trail. Got a few casualties. Our prisoner \n\n dopey sort of Place judging by the Photo","22":" Just in off Parade they ought to get some of these chaps and put them in a rat house or something, it was as cold as blazers when we started off and landed in a big cultivated paddock for drill, it then started to rain heavy, and the Major would not take us in but made us drill for an hour right through it, it hailed after a while and the cold stinging rain \n\nInquire Within\n\nIf you want to know the time\n\nThe exact date of cessation of Hostilities\n\nWho Pinched your Rations and drank your rum\n\nWhy Fritz does not turn it up\n","23":" the Kaizer love his son\n","24":" \"Boshes\" eat their young\n\nWhen Am I going on leave\n\nWhens pay day.\n\nHas Shrapnal Fallen \n\n& Why does Greece hang back\n\nWhy did not Noah make a dead cert of the two \"chats\" \n\nwhen he had ‘em safe in the Ark\n\nOh Any old thing all\n\nAsk a Signaller \n\nwas in an awful fright he ought to have been too our artillery was some Fritz didn’t put over much but got a few with bombs, got em when they were half way over, saw them by the flares, but our chaps stoushed em up alright. ","25":" Just behind the line @ the Somme going to be some big stoush coming off tomorrow. its damn cold and Mud well don’t talk about it am just writing this up for if I get skittled one of the Cobbers can sending it \n\nover to Lill. We came up here part of the way in the train part in Motor wagon (French outfits) some Cars.","26":" We are still here in the Mud, the like of which I have never seen in places so thick & gluey that horses useless Men & wagons get stuck alike, Thin mud that rises over the boot tops and knees and makes your feet & legs as cold a frozen meat. the weather is still inclement but nevertheless I think our crowd hopped the parapet again early this morning the artillery fire was \n\nterrific like sustained rifle fire never ceasing for a minute, increasing in volume at about 4 this morning when the roar of the Guns were awful, its still going but not with such intensity, I Pitied the chaps in the line it must have been awful but we’ll be in it in a day or two now. Biscuits issued for food today worse luck had a letter from Mum last night but have no time to write. When we came out from Ypres we went back past Watten a fairly big town and \n\n\"The Comparison\"\n\nThe Knights of old went to the fight\n\nArrayed in shining armour\n\nReflecting back the sunshine bright\n\nAnd smiled on by fair charmer\n\nWho sent her hero on to dare\n\nSome deed of knightly duty\n\nIn open Air and forest fair \n\nAll clothed in Verdant beauty \n\nNo shining armour can array\n\nThe warriors of \"Wipers\"\n\nUnless they want to fall a prey\n\nTo lurking German Snipers\n\nNo glittering steel from head to heel\n\nBut Flanders mud attires them\n\nLike Mice and Moles they darkly steal\n\nWhatever war requires them.\n\nNo charger prances or glances\n\nOr Pennants wave before them\n\nThey creep and crawl with slow advance \n\nWith ooze and sluice all o’er them\n\nThe days are done of battles won\n\nBy cavaliers bold riding\n\nToday we aim to beat the hun \n\nBy artfulness in hiding\n\nBut deeds as bold as e’er of old\n\nAre done on fields more bloody\n\nAnd times recording page may hold \n\nThis knights all stained and Muddy\n\nWho Volunteer and Valiant stand\n\nAgainst our knightly foreman\n\nAre worthy of their well loved land \n\nAs e’er were knights or Yeoman\n\nThe Atavastic Maid\n\nListen, Sweetheart to my plea\n\nCut this highly cultured game\n\nAll this fine gentility\n\nGrows to be exceeding tame\n\nWhat I want is lowbrow love\n\nHeavy, knock down, cave man stuff\n\nI’m no cooing turtle dove\n\nTreat me rough kid, \n\nTreat me rough\n\nCan the soft and weepy sighs\n\nChop the meek and humble prose\n\nI’m no cut glass raffle prize\n\nI’m no fragile little rose\n\nGrab me with a python grip\n\nIf I struggle, call the bluff\n\nWant my love, then take the tip\n\nTreat me rough kid\n\nTreat me rough\n\nI don’t want my cheek caressed\n\nWith a nice respectful peck\n\nYank me wildly to your chest\n\nIf I fight you, break my neck\n\nPlease dont be a gentle dub\n\nSpelling la-de-dah-ish guff\n\nWoo and win me with a club\n\nTreat me rough kid\n\nTreat me rough\n\nEveryone speaks of the Anzacs\n\nOf their wonderful brave display\n\nBut does anyone hear of the Surrey Boys?\n\nWho were up in Sulva Bay?\n\nTheir work was good and dangerous \n\nTheir Trials and conditions hard\n\nBut they have not been feted in London\n\nOr cheered on the French boulevarde\n\nNo they are working damned hard out in Egypt\n\nFrom civilisation away\n\nIn the farthest unsanitary quarters\n\nWhere the Arab himself will not stay\n\nBut Tommy’s the boy to be cheerful\n\nAnd work like a slave night & day\n\nAnd put up with sauce for a tanner\n\nNot six bob that’s Anzac’s Pay\n\nentrained at the city of St Omer for the Somme, passed through Calais and other coast towns till we finally reached destination going to be something big this trip, bigger even than the Posieres stunt but the weather is so crook that it will be a tough job but I guess we can handle it ","27":" Still here stunt postponed on account of mud. Fritz sent a good many shells over last night mostly duds but very close though all the same, Our officer Darley \n\nAllan saw the Major yesterday and he told them that I’m next on HQ for leave that means about 10 days question is can I keep alive for 10 days I hope so. Jove its cold and still raining we have a bit of canvas slung over a piece of muddy ground but still it keeps the rain out. \n","28":" Got our patches on and bombs ready Going up into the line at 10 O’clock, its raining and the mud is thigh deep horses and waggons are all bogged and in an awful mess its very cold too, guess Fritz\n\nwill strike some bad tempered Australians this trip ","29":" Everything is in an awful mess been flooded out wet right through and have to sleep in the open have built a big fire which is a great mark for Fritz shells which he is putting over pretty often I’m cold wet and hungry, they have just shot a horse that got bogged in the mud. just writing this to put in time.\n","30":" out this morning everything bright once more some entry of mine last night but I’m alright this morning thanks, one of the sigs was blown to \n\nlittle pieces yesterday went into the line to have a look around Gee its muddy up to the seat of your Pants never saw anything like it ","31":" In the line Of course the other lads weren’t glad to be relieved Oh no. Our stunt has been postponed for a while on account of the wet and all leave has been stopped again. I’ll just about get stopped myself before I hit that elusive leave, the sky was absolutely dotted with our balloons and planes last evening not one of Fritz’s to be \n\nseen he hardly ever dares show his planes now they get knocked back to quick\n","32":" Just out of the trenches some stoush too, the worst place Ive ever been in when we went in we had a mile or two to walk through mud thigh deep, when we hit the trenches it was up to my hip pocket Lord it was awful, I had to run a line to the forward company through it, I got tired of it after a while and ran it along the top of the trenches\n\nOld Fritz was sniping some too but I got it through we had five \n\ndays of that and the longest time the line lived was six hours, one night we were out four times on it in the dark, the line was chopped and flung in all directions big shells and shrapnel all over the joint, coming back we had to run a barrage of shell, how Mac, the other linesman and I got through it I don’t know, we were mud from the top of the trousers to the boots and dam tired we started to run but had to stop couldn’t \n\nrun another yard so hopped down in a shell hole for a spell it was the most severe shelling Ive seen we proceeded like that till we were in our dug out properly done up of course the line was down again. Next day we went down to HQ and dragged a couple of pairs of thigh boots, coming home we witnessed some good air fights, about six of fritz’s mob, came over and started to put it over one of ours they were firing twisting and turning in a marvellous \n\n\"Dinkum Oils\"\n\nThe \"dinkum oils\" come pouring in,\n\nMorning noon and night;\n\nStartling news of every kind, \n\nAll about the fight.\n\nHeres a sample of the kind,\n\nGiven by those who know, \n\nBased on a batman’s whisper soft, \n\nThen Rumour’s on the go\n\nRussians Capture twenty towns;\n\nFive thousand tommies killed;\n\nNo recruits are offering now,\n\n‘Cause their feet are chilled.\n\nNo more houses to be cleaned;\n\nLeave to Ireland stopped;\n\nNo more beer is sold to troops\n\nDage’s cut and chopped\n\nWe are going home quite soon\n\nThe fleet is sunk again;\n\nThe Australians all for India,\n\nGerman Troops in Spain,\n\nDarcy’s training now in camp;\n\nThe Japs have got conscription\n\nOur battles with the MMP’s\n\nSurpass all mans description.\n\nGreene is climbing off the fence,\n\nSmuts taken \"German West\",\n\nTurks are in the Whassa;\n\nAustrians much distressed,\n\nBilly Hughes has died of gas\n\nFrom Politicians speeches;\n\nGhidleys clothes are soon to be\n\nThe fashion on the beaches\n\nBush fires burn Canberra out;\n\nThe Murrumbidgee’s dry;\n\nThe Wowsers have another win\n\nTwo million Beer Wasps die;\n\nShackleton has met his fate;\n\nThe Bulgars fly on Bikes;\n\nThe Kaiser runs a \"two-up\" school\n\nDutchmen flood their dykes\n\nThe King is now in New South Wales\n\nAnd says he’s gong to stay;\n\nZeppelins bomb a few more babes;\n\nYanks are making hay.\n\nAnd this goes on for ever, \n\nAnd seldom is it true,\n\nBut I know for a blankey cert\n\nThat Tomorrow we’ll have stew\n\nMany a ship’s been lost at sea\n\nFor want of a skilfull Master.\n\nMany a Tommy has lost his tart\n\nCause Anzac’s Proved the faster.\n\nway, when Our fleet came on the scene then things got mixed up some, before you could say Jack Robinson there were four fights going on One fritz came down in flames. One of ours came down in a very tired way, Another one of Fritz’s turned it in and did a get so there was only one fight left to watch there were four enemy planes stoushing up one of our own when all of a sudden one of ours plane away up high came down in one long dive, just like a hawk swooping\n\ndown, and another fritz hit the turf the rest evidently reckoned that they had had enough and put the towel in, On the Fifth the","33":" went over the top, just before they hopped it it rained like blazes, and when they were going across they got half bogged in mud. Fritz was waiting on them with bombs and machine guns and cut 3 Twos out of them they didn’t do any good and got a lot of casualties. I dont know when we go over, by Jove I pity the wounded this \n\nthis weather mud all over them and in some places if you get wounded its certain death because you have no hope of ever getting out of the mud. We are just about 12 miles from the line at Delville Wood and Fritz shells it fairly heavily, we came in last nigh and as I was lying shivering in my muddy blanket I heard my name called. I got up swearing thinking it was a fatigue or the line down again but not on your life it was leave, I go\n\ntonight or tomorrow morning, wont be stiff if I stop one between this and then, Im going to Ayr Scotland and because you get 10 days for that and only 8 for London all the same I dont think Ill get passed London ","34":" Walked 10 miles from Fders to Albert to catch the train every inch of the way was over knee deep in mud and water and bitterly cold, caught the train was in it all night caught another next day for Rouen and finally landing in Havre at \n\n3.30 two days later, some train service this and some organisation, the train would go about 100 yds and then stop for a breather, we spent 3 days doing the whole distance that should have taken, under ordinary circumstances 6 hours, was wet with mud and water from head to foot and no food. It took all my imagination to keep me from going dopey but leave will be all the sweeter when we get there. We went up to the boat night before last, couldn’t \n\nget on it too crowded. Went up last night same thing happened, got severely knocked back going up again \ntonight\n might get away this time Jove the little crowds of Australians here are a disreputable crowd mud all over torn Pants, tin lids and colored mufflers, while the Tommies are mostly spick and span, but we’ll all be alright when we hit London and get a new rig out.\n","35":" Back again from leave and in the Blest Rest Camp @ Havre move \n\non to the Bn at 4 this evening dont like the idea nor do any of the others But by Jove I had a fine time in London, Theatres Music Luncheons nice beds etc oh dont wake it up, absolute paradise and then back in the mud again no wonder nearly all the crowd are quite and sitting down smoking and looking into the rain with a far away look in their peepers. I hope I get a decent knock that will send me home again to Blighty but I wish I could have got home instead \n\nI had a look inside two English homes, one belonging to one of the Aristocracy I guess was some and came about in this way, four of us were going into the Anzac Buffet and just got inside the door when and old Gent with a Silk Lid on and a very nice young lady on his arm blew in and haded us an invitation out to his ranch for the evening, bet your life we were on it, and went, had a fine dinner and afterwards coffee and smokes in \n\nthe music room, and his daughter and two other young ladies who blew in gave us some music, say they could rattle the ivories all right, his daughter played before the Queen and caught an encore, so you can guess she’s some. They were very nice people and had a grand old ranch had quite a chat to both host and hostess and left about 7 PM with the invitation renewed, The other home was just ordinary where the missus growls\n\nat the boss and the boss boots the cat, but I had a good time at both places. Your money soon goes here though I want to see everything of course and money slips through. The crowd at our base even wanted to charge me for my uniform, but jibbed, handed em back, and went round the back and pinched the lot back again. The Music halls were fine I wish Lill could have seen them with me, I took a couple of ladies in\n\nto see them with me not both at once you know, oh no. One was shy very shy, the other wasn’t but they were both good little sports and sent me invite’s for evenings but Id want to month to do it in. I got lost in the tubes too but they are A1, and hit the pace up at a fine bat too. Got to fall in now for the line again they say our battalion is just going in, I would not mind at all if it went in without me but its all in a life\n","36":" In a train bound for the unit. We fell in yesterday at 4 but fell out again guess the head Joe’s were rattled they didn’t know what to do with us fell us in this morning at 1.30AM Phew is wasnt cold or raining \"not Arf\"","37":" Miles and then had to wait for the train it was supposed to be in at 4 then it was 6 then well gave it up and waited it rushed into the yard at a terrific bat amid a cloud of dust and cheers about\n\n8, the engine was a superb piece of workmanship and should be worth a good deal as an antique betting is variable on the speed We we raise on the journey 2 + 3 miles per hour are favourites while 5 + 10 have hardly any takers, its 9 o’clock now and we are still in the station, asked some of our chaps, who have just got in for leave where our crowd were, they say they are still down on the Somme, Im going to try and work my\n\nhead don’t like the idea of wintering in the trenches, Our \"lost division\" (the","38":" is coming across shortly I believe, well the sooner the better they may relieve some of our chap’s.","39":" Here we are at Albert waiting for a train that’s supposed to start @ 4 but that will mean about 4 tomorrow morning. \n\nWe got into a place with a name like a sneeze at 7 this morning and after waiting for two hours in the wind the RTO told us he didn’t know where our unit was\n\nand that we had better find out for ourselves. We Thanked him of course and hit the Trail and after sundry lifts in Motor Waggons etc we arrived in Albert in O’Clock and to beat it back to the unit, they wanted to send us to a reinforcement camp but we werent having any.","40":" back again with the unit and don’t like it, had a bunch of letters\n\nwaiting for me, one from England rather surprised me those English people get me, gong to bed.","41":" Battalion had a snide attack today and it was raining pretty hard all the while, Swear! Gee I went some, couldn’t help it we get enough dinkum attacks without pushing us out for snide ones in the Rain, hear that Divil Sig. Co in going to be enlarged Am going to have a try to get in\n","42":" Yesterday raining all day, church Parade, Put in time writing letters wrote dopey one to Lill don’t know whether \n\nIll Post it or not, nice day today, Paraded this morning Nothing Special doing. Roumania still getting 3 Twos cut out of her.\n","43":" Nearer the line again the last night in the last billet was a circus, the Amateurs went on the booze, laugh it was funny, the liquid for a start was doped, I’d had half a dozen the night before to get me warm and I nearly put my ticket in, and when this crowd hit it, the fun was A1, One chap was carried home, dead to the world and started \n\n\"Our Billets\"\n\nOur billet is \"airy\" Our Billet is \"sweet\"\n\nYou can smell the dam place as you come up the street,\n\nA manure heap in front, a manure heap behind,\n\nWhy, man, you’re in clover, that is - of a kind\n\nThe place is quite \"Holey\", and oft unawares\n\nThe wind comes whistling with various airs,\n\nIt is a bit draughty, but, then, you are told\n\nTo live in fresh air, keeps one clear of a cold.\n\nThe straw that you lie on was laid on the floor,\n\nWhen France was at war\n\nwith the boshes before;\n\nYou dare not disturb it, though \"it\" looks a mess,\n\nAt whats underneath we just tremble and guess.\n\nWhen you walk on the surface you raise such a dust,\n\nAnd to use your gas helmet you certainly must,\n\nIt may make you cough and make misty your eyes, As you lay neath your great coat and study the skies, \n\nWhy our dugout’s a palace, though Fritz oer the way\n\nSends us \"Iron Rations\" which we haste to repay;\n\nAt least we are free from the\n\nOld womans jaw\n\nAnd salubrious odours of Manure and Straw\n\n to go to Europe, another blew in, said it was the first time he was stink, handed us the information that if his mother knew she’d throw a brick in or something and then subsided in an awful mess, another got dingbats and saw blue spiders offered all the German army out and started down the road, he was mad, we followed him, he pulled up in a bog in a field and\n\nshed his linen and then invited everyone or everyone to come and try and knock his head off, but there was no response, it was very foggy too, he went to sleep in the mud so we had to drag him home before he froze, next morning we had to move off at 4 am Lord it was cold and they could hardly stand, we marched to the railway, got there at 5.30 and had to wait in the cold and sleet till 11 AM it was awful my feet froze stiff and I didn’t care what\n\nhappened, couldn’t get any wood for a fire just had to stand there and shiver, we got out of the train at Ribencourt and marched to another village where we turned in, we got a fire and went to sleep, Today we have been parading and mucking about, got a card from Lill, heard about the I W.W stunt in Sydney you ought to hear the crowd, I wish those mongrels were over here rather guess they’ed get a rough passage the swine. Think we will be in The line\n\nfor Xmas, don’t much care myself, in fact at present I don’t much care one way or the other. Im getting very tired \n\nwill probably rope in something that’s water\n\nlogged or dopey, nice and warm tonight, have got three blankets and am dry, and have just finished 6 coffees, the french can make some coffee. The Guns are going some tonight. A good many going away sick with crook feet mine are not too bad up to present, Lord knows how long they’ll last though.","44":" Sunday, just had a church Parade no more today, went into a butchers shop coming home and bought a pig’s liver and 9 eggs, cooked\n","45":" and 3 of us got it into us, one of em is now dead to the world and you can nearly see liver & eggs coming out of his eyes I feel dopey too, but it was a great feed. Thinking of going to the next village tonight to see what it is like but all these places seem the same, got a Post Card from Auntie Annie, trouble is I don’t know whether its Mrs or Miss but I wrote it quick so I guess it will pass muster, she must.\n\n beating in ones faces all the while, we got wet through, and ones faces and hands as cold as ice and of course no dry things to put on when we finally got in to our billets have to go out again this evening, it has stopped raining but the wind is bitterly cold and we are all wet through but never mind. We go up to the trenches tomorrow I think, I dont know whether we go in or not, may be on road making it does not matter much though as its \n\nall up to the neck in mud.","46":" Encamped in huts in Mametz Wood. Huts are not bad, but the mud outside is some, we are well within range of shell fire and Fritz is putting a few strays over, had a","47":" miles this morning and I nearly died, although I beat em for 3 by hopping on a Motor Lorry. Just went down to get our blankets but found the lorry they were on has been bogged in the mud 2 miles back, they may come up tonight, I hope so, if they don’t we are going to do a freeze.\n\nI hear we are here for a few days, being reserve brigade, nearly time we were reserve something and we are to be put on Road Mending, it will be nice making roads through the mud, every man in the Bn is crook, mostly with colds, and its quite pleasant and rather funny to hear the chorus of coughing every now and then","48":" Still in huts, been raining slightly all day, have been looking for coal but nothing doing, managed to pinch some wood and have a fire now thanks. A Chum from the Artillery\n\ncame up to see me yesterday he wants me to try and get in the Artillery, I am going to have a try but I think I will get severly knocked back, great rumours flying around about a big Fritz attack that is supposed to be imminent. The crowd here are all arguing the point about conscription etc and making an awful row, hear that the Roumanian Capital has put the towel in at last, guess Fritz is getting a wriggle on over there. The Greeks also seem to be enjoying them \n\nselves, putting their Mayor through it while their Princess, sits and looks on, and calls for an encore, some Princess eh.","49":" Raining all day but have not been out in it, have been spending the time rubbing oil into my feet, writing letters and sending some Photo’s of my Phiz away, They arrived today and are not all what I ordered but I guess they’ll do. Jove the lads here are going crook about the way the I.W.W mob are\n\nrunning gay in Sydney and so they ought to. They ought to be hung without a trial, there are dozens of better men here being shot every day and living under the worst conditions imaginable while those swine are allowed to live in luxury and do what they like, they would get no trial from me Id shoot em down like dogs. Have heard that one Xmas mail has got wet and badly damaged I hope it isn’t true. We are fairly comfortable here 30 in a hut\n\nand they are rainproof. The trouble is to get wood or coal for a fire, have not had one today but it has not been extra cold.","50":" nothing all day, its Sunday, it’s been raining part of the day, having quite a rest though have not done anything for 2 days practically, mail came in today but none for","51":" had a couple of parades today, heard Roumania has Pitched the Towel in and the crowd are all arguing about England’s chances of winning This\n\nwar, they have just had a big issue of Rum (6 spoonfuls) of course I didn’t. They say we are to consolidate for the winter no more stunts here for a bit, good enough for me, I don’t want any more stunts in the mud, The Colonel has gone away for a weeks Wot Oh","52":" been raining and snowing all night it is now sending down sleet fairly heavy, the crowd has gone for a bath but I don’t know where they are going to get it, the mud and cold is awful, I am on duty? so gave it a \n\nbye. The 32nd Batt, came out of the line today been in for three weeks, in the front 9 days, we were in 18 days but it seems its getting worse. They hopped over once and went looking for Fritz’s, couldnt find any and went on and got spread around the landscape by our own artillery, 30 came back. Our officers went to have a doppo at the line today so we will be going in shortly.","53":" Lord Im tired not in a physical sense just mentally. Fed up I guess would be a better\n\nway to put it. Its raining now, nearly always is, steady drizzle with a heavy downpour every now and then but once your wet you don’t mind much, you cant get any worse, you have got all the mud on you that is possible to get and you are that cold you cant feel so you don’t care a dam what happens\n","54":" Feel pretty crook this morning, lost my voice like most of the battalion, you go out side and nearly everyone speaks in hoarse whispers, every second man has lost his voice, Ive got a \n\nA Soldiers Philosophy\n\nOne or two things will happen either you will be called as a soldier or not.\n\nIf you are not there is no need to worry. If you are, one or two things will happen. Either you will be sent to the front or to a place of safety behind the line.\n\nIf you are in a place of safety there is no need to worry, if you are sent to the front one or two things will happen. Either you will be wounded or you wont.\n\nover\n\nif you are not wounded there is no need to worry. If you are one of two things is certain you will be wounded slightly or else seriously.\n\nIf you are wounded slightly there is no need to worry. If you are wounded seriously one of two things will happen. You will either recover or die.\n\nIf you recover there is no need to worry. If you die you cant worry.\n\nbonny headache too, they give us a rum issue every day but it does not help much, by the time it reaches us its nearly all water, a lot of details are coming back to the Bat now. A little mild excitement was in the air last night when we got the Kaisers terms of Peace, the crowd immediately split up in different groups and started in to argue the point, one chap was croaking in a stage whisper, said he give old Bill all France let alone Poland and\n\napologise for the rotten state the country is in. They all seemed to agree about one thing though and that was that the Kaiser and all his crowd were half a dozen different kinds of B--s. Got a letter from Mum & Maud yesterday and one from England. I believe one division is in for 30 days, very nice I dont think. Our","55":" Divis which has been having a good time in England has a last come across they have been becamped down Armentieres way, I wish they were up\n\nhere with us on the Somme, Armentieres is a home. Our bat is going to have a couple more raids this time I dont mind them in good weather but in this mud – ugh! .16.12.16 Got Paid yesterday 40 francs and got roared on for slouching in with my hands in my Pockets, So gave him a grunt and caught some more, been playing Poker won 50 francs. Fritz is getting Peace proposals handed out to him tonight, all the big guns are tearing 3 twos out of him, Guess Fritz is\n\nwondering what sort of Peace it is, The French have been cutting the hide off him today at Peronne and Verdun. Our chaps all hopping the parapet all over the joint and he is getting rattled. Im feeling better tonight, the R.S.M is drunk (on our rum) and he wants to take 20 to 1 about the Fritz outfit putting their ticket in before Xmas some Xmas, eh. If Im alive on Peace Day Im going to get horribly skifs and break things \n","56":" Going up into the line again tomorrow\n\nRotten weather. Got a lot of new reinforcements tonight, one chap says he’s going to try for a cross he’ll probably get one (a wooden one) Feeling Pretty crook can’t speak at all, went to the quack gave me light duties, (peeling spuds in the cold, with my feet in 6 inches of mud) but I wasn’t having any. One of the cobbers in England leg smashed\n","57":" up at Bernafay wood and the roads and little streams and gutters are frozen hard, it was hard walking very uneven\n\nand we just got in when it started in to snow. The R.S.M was drunk and very funny. Got a lot of reinforcements 150 some of the old hands back again. We lost 6 Sgts today. A Mills bomb exploded in a hut, someone put it in the brazier and it burst and laid out 6 of em one chap lost an eye, blown right out, another a smashed leg, one chap got more than his fare share, got it all over him I think he’ll just about Put his ticket in I think we go right into\n\nthe line tomorrow but am not sure. I hope it keeps on freezing its better than mud. The crowd are yelling for a game of Poker so Im going to have a game.","58":" Anniversary of our evacuation of Gallipoli. not quite in the line but in a worse possie, got two sheets of tin for a roof and two inches of mud for a floor, and shots flying all around us similar dug outs I wonder how long this one of mine will last Gee they are sending them over the last one lobbed about 20 yards a-\n\nway, its cold too and Im shivering like a leaf partly from cold and to be honest partly from shell shock. I look up every two lines to see how close they are, theres another one now, blown up another dug out, no use bunkering just as bad everywhere, we are in this place for 6 days if I see six days out it will do me .\n\n4.30PM. its nearly dark and the shelling has abated a little bit, a very little bit. Lord they sent a lot over they are after a battery of \"hows\" \n\nabout 200 yds away and they haven’t got one yet but have put them all round knocking over dugouts one by one, they are moving very close to this and the next shell might get it – nice - Very. ","59":" Not been too bad today as regards shells, putting a few well over. Have to run lines tomorrow should have done it today but had no wire. The crowd we relieved have gone back to Bernafay wood into the huts, it’s a crook place was only there one night and was \n\nextremely glad to get out of it. They have a gun that Plays on it and it is one of those slick guns cant hear them till they burst, the first one went 100 yards well over the second & third a little to the right and closer, the fourth about 40. Pte Wright began to sit up and take notice then the next one came right in front of the hut, Wrightie went up the hill for a stroll when another one came – on the hill – tried to kid myself I was armour plated but\n\nnone of the flying debris hit me. they kept it up till we left, and as a kind of a send off they kindly blew one of the huts sky high, made an awful mess of it.\n\nRS.M. was still drunk, must have thought I was his missus, he roped me in for a stayer and kept calling me kiddie.","60":" The old dug out is still here though much Plastered with mud from shells. Ran two lines yesterday they lasted about ½ an hour. Fritz’s guns were very busy yesterday bumped a\n\nbig one into a flare dump at \"Flers\" (we are about 500 yds off Flers) and there was some fire, its still burning though it has been raining all night, it was a Pretty sight to watch, it was a good size and of course when Fritz saw he’d caught something he started in to give it Particular nothing Howitzers big and small were pumped over sending lighted Flares in all directions. been out on the lines again today they are alright so far. Very \n\nhigh wind blowing but its not too cold. have just had my dinner Mac’s ration and Mud its very hard to get wood for a fire and when you do get some you’ve got to go some to get one going. Been sending a few shells over this evening got 4 men 1 killed ( LT Turnbull) others wounded. lines are all down and they can stop down its raining like the big flood and Im stopping right here till morning\n","61":" Ran the lines again this morning both OK. Fritz has been pretty quiet\n\nup to know but he still has Plenty of time to liven things up. He got one of our Planes this morning, two Taubes brought it down, it fell in our own lines and came down steady. Im tipping a Pretty hot time Xmas day & we are in a crook Possie for a stunt. I rescued a German egg bomb this morning and rendered it harmless its not a bad souvenir and rather scarce so I am going to carry it, as its not to heavy or big. not raining today. A mail has\n\njust come in, I wonder how it got here the Authorities must have stretched a Point for Xmas I got 1 letter and 2 cards and a parcel. The letter was from a cobber in hospital in England with a broken ankle, the cards from friends in England, and the Parcel from Auntie Annie, Consisting of a Pot of Dope for rubbing on your clock if it gets chaffed etc, a box of Pills, which according to label are guaranteed to cure everything from ingrowing toenails to shellites some Bovril, baccy and a Pencil Good old Auntie but I \n\nwish she wouldn’t send ointment & Pills but Ill hand em out to somebody. \n","62":" day, its some Xmas, its wet, very muddy and bitterly cold. Fritz caught a decent bombardment from us last night and this morning and he has been putting a few back he’s had one on the jump all the evening with his shrapnel so far no casualties though. they issued us with a Xmas Pudding in a tin, otherwise everything is the same, I wish they would stop the shrap & shell for a day at least, its \n\ngetting on my nerves. Could not make a fire this morning until the cobber thought of the ointment Auntie sent me it was A.1. burnt fine and still have enough for tea. Xmas dinner consisted of cold bully beef and an onion but we cant growl. Im not feeling too good on it today too cold & wet. Fritz is putting a good deal of stuff over now, usually shrapnel. There is a Tank (a new one) about 200 yds from here and he is going very close to it with HE. The is another Tank further out but its put its ticket in \n\nI had a look inside it nearly made me sick its crew were still there , dead, burnt.","63":" is out today and the Planes are making a home of it, our Mob went up and bumped a Fritz outfit just over their lines, they got right into it and one Taube out on its own engaged one of ours, Say they did twist some but the Taube got rattled and presently, came to grass in Flames, it was Pretty, but an awful death, it fell slowly at First, gradually gained momentum as it neared the ground when it \n\nlooked like one blazing streak of flame, it hit the ground with a good hard bump and didnt bounce, and a great column of smoke came up from the place. well Quits now they got one of ours yesterday. The shelling here this morning is not too bad. Have just been talking to one of the officers and he says that the Plane that came down this morning was one of ours, hard luck. \n","64":" Had a rotten night last night, about the best nightmare Ive had for a long while. It was Pitch\n\ndark and raining, when about 10PM Fritz got busy, he sent scores of high velocity H.E. shells over and kept it up all night, the Pal who was with me in the dugout, went for a stroll, I stopped in, and swore if they wanted to get me out, theyd have to blow me out, they didn’t, but they went darn close. nice sensation lying in a dugout full of mud bitterly cold and hats all over you, the tin above you leaking, and only capable of stopping snowballs, its bad enough when its quiet but when he starts \n\ndumping shells around its real A.1. believe me. The boots this morning were frozen hard and caked in ice, The Sun is shining and Fritz has a good many planes up but they are not mixing it much. 9.30PM Lord Im Tired just been on fatigue carrying 8 reels of armoured cable to Front line, each reel took two men it was heavy going got to lay the stuff tomorrow 2 miles of it through the mud something to dream about.","65":" Just in from laying cable, Armoured Steel cable I wish the man who \n\ninvented it would invent some more and then put his ticket in. The cold today is awful been freezing hard and a low lying mist to go with it, never felt so cold in all my life, feet hands and face were dead to all the world. The Front line is awful mud up to the thighs with a thin coating of ice on top, when you put your foot on it you go right through, there was a good distance to go too and the ice was cutting our rubber thigh boots all the while, letting the water in. Fritz caught us in chalk\n\ntrench with a herd of shells but didn’t get any of us. Feeling a bit warm now, am back in the dug out, with my boots off and blankets wrapped round them I Pity the poor beggars who cant get their boots off at all, saw some this morning being carried down with \"Trench feet\" which is the army’s term for frozen feet, and its an offence to have em too, they issue us with oil to rub in, that is alleged to Prevent them but its not much good. We did not finish the\n\njob today so have to go back again tomorrow and do it. This term in the line will do me for narrow escapes, last night Fritz put a lot over one landed about 10 yds off our little home, I was asleep at the time believe me it was some rude awakening. We move into the line on Saturday, I think. We will be better off from shell fire there\n","66":" Weve had a pretty crook spin the last 3 days to begin with we went up on the night of the 29th to lay armoured cables to the front line, doesn’t \n\n-- Mud --\n\nWhile were fighting for the nation, in our Present situation,\n\nWeve example in the good old common mud,\n\nFor it sticks with desperation, and makes quite a decoration\n\nTill a soldier man looks something like a spud\n\nWhen you meet an old relation, and he starts the conversation,\n\nIt’s the same – unless you nip it in the bud –\n\nFor we curse the whole creation for its slimy old foundation,\n\nDrives a man to Aviation – does the mud –\n\nWhen with frantic jubilation, we shall hail the fermentation\n\nOf the war, then e’en forgetting.\n\nall the blood,\n\nAs the train comes to the station we shall stop in sheer elation \n\nTo the land in which theres not a speck of mud.\n\nF ------------S\n\nsound much but gee it took some doing, it took 6 hrs to do the job, raining all the while, by the time we got the coil of wire to the starting point we were just about all in, and then we had to lay it, we pulled and strained for a couple of hours, falling down in shell holes wading through mud waist deep, and got the cable\n\nto within 20 yds of the station when she petered out, we were all too tired to swear much, but we got some more wire and finished the job. The walk back was a nightmare, we were too miserable to speak and Fritz was putting a ton of shrap and HE over, we got lost in last and wandered round for a while, Fritz got a line on us, from a plane and twisted a machine gun on us, it kept us cuddling mud for a while they were sending little\n\nsplashes of mud round us. I didn’t care whether one hit me or not, I was properly done up. It took us 2 hours to get back and into our dug outs of course we were mud from head to foot and awfully cold and we had to stop in our wet clobber all night. Im not dry yet. the coy headquarters to where we laid the line was blown in yesterday by a heavy gun, killed a capt so we will have to go out again tonight. Our bat moves into \n\nHow to run the war\n\nWeve heard a fair amount of noise,\n\nOn how to run the war\n\nWithout undue extravance ,\n\nBut here’s a little more,\n\nA lot of things you issue us\n\nIn many ways are good,\n\nBut even yet economy \n\nIs little understood\n\nOur biscuits, now, for mending roads\n\n(Where metal reigns supreme)\n\nOr armour plating round the tanks-\n\nThey’d make a bonzer scheme\n\nOr soaked for weeks in kerosene\n\nThey might be used for fuel\n\nAnd save some hero from the cold\n\nWhen winter time is cruel.\n\nAnd then theres all that saddle soap\n\nAnd soap of common kind\n\nYou know they both are waste of cash\n\nTo any frugal mind\n\nThe cheese that we are issued with\n\nWhen things are as I hope,\n\nWould do to wash our hands & face\n\nAnd do away with soap.\n\nThen why waste all that ration jam,\n\nWith fancy names galore,\n\nWhen axle grease would do for both\n\nAnd save a little more, \n\nOr put some poison in it too\n\nAnd add a little fat –\n\nAnd we could use it very well\n\nIn killing off the chat.\n\nOr spread the oil that’s issued us\n\nTo keep our steelwork clean,\n\nUpon a slice of issue bread,\n\nAnd save the margarine.\n\nOr pass it to the HMC\n\nInstead of number mines\n\nTo cure some sole from agony\n\nWhen he unwisely dines.\n\nIt must take quite a lot of iron,\n\nTo make those ordnance razors,\n\nBut what about the biscuit tins,\n\nAllowed to go to blazes.\n\nI think theres still a lot to learn\n\nOf various ways of saving,\n\nAnd after twenty years of war\n\nThey’ll know that I’m not raving\n\nF----------------S\n\nthe line today, and then for 8 more days joy.\n\nhe is shelling a good deal now, don’t much care if he puts one in here. We got a pudding today with instructions to boil it for 1 hour, how the hell are we going to boil it. Im going to bog into mine raw. Oh I nearly forgot the boss gave me a dixie of rum yesterday and told me to fix it, I did and it nearly fixed me. \n","67":" First day of the new year in the line, Jove I had a joy ride getting here, I had an Idea that all the guns in \n\ncreation were concentrated on yours truly, they did make the fur fly, I think Fritz had a rough idea that we were relieving, we got a good many casualties, the Old R.S.M was knocked today, he was glad enough too, smiling all over his dial. Mac the cobber is out now on the line Im having a night in dont feel up to it, been ordered to Lay down by the Quack\n","68":" Out of the line at last, by jove she’s been a crook spin this trip, wet and muddy, shivering all the while, and fairly didn’t care a hang, but\n\nwe are out now once more so whats it matter\n\nOn the","69":" Fritz got wise to our head Quarters and put some shells into it, caught us lovely killed 10 men with one shell and wounded 6 a couple of cobbers were killed, blown to bits, gee its crook, just being killed without having a crack at him first, Sgt Devine a chap, like myself who has been right through without getting knocked, got wounded too, the work on the wires this time was \n\nrough we were out on them every night, and it was armoured too, and ran out in No Mans land in one place, and talk about dead men, gee they were lying everywhere and my wire ran between them, I tell you running that line of a night, which was the only time you could, took some doing, if you went over in the day would be lying there yourself. Sometimes we would be out 4 hours and get back only to hear that it is down again, broken\n\nby shell fire, and out we’d have to go again. On the Night of the 3rd &","70":" Fritz came across about 400 of him and started to dig assembly trenches for an attack when Our Artillery got onto him and chopped him to bits, the Artillery next day was very active too, I just came from the line and was spelling in a chalk Pit, when we opened up, the light guns and the heavies went their hardest for an hour Say it was real Pretty to watch, great\n\ntrees, and columns of mud were thrown up all over the place, I watched for about 15 Minutes when Fritz began to send some back, I got back then to the chalk Pit., it was rough shelter though, So I legged it to another spot. The men in the line have had a rough time, there are no trenches, cant build them, too muddy, So they man Post’s and the men have to take dixies of stew & tea up to them, its heartbreaking work, the walk is a long ,the load a heavy one, and the way very\n\nmuddy and rough from shellholes, and when Fritz begins to send em over its generally the last straw. They have given us Plenty of rum but the warmth it brings is only temporary. We were relieved on the night of the","71":" by the 48th Bin, and just before they took over, I’m hanged of the line didnt break, Mac & I were ready to get out of the line, but we had to drop our packs and go out on the wire, we mended it got back safe, and Im hanged if it didnt\n\nbreak again, we mended it, and nearly got skittled, came back and went out, talk about tired, it was nothing we had no interest in anything we got down & through Delville Wood OK, where we got can of hot Pea Soup, gee I never tasted anything better in all my life, it was fine, after a spell we got on again, we had to go to Coolgardie Camp but do you think we could find it not on your life, we went all over the joint and finally lobbed into some tents, it was \n\nraining like blazes, and we were wet through and covered in mud so the fact that the floors of the tents were all mud didnt worry us, we just dropped and we must have slept, for I woke up next morning stiff & cold as a Polar bear, we were in Coolgardie Camp alright but we got out of it at 12 marched to a train bumped us in the open waggons and brought us to a place where we had to","72":" miles to another place\n\nthat other place is this joint, called Ribencourt its some too, but Im dry now and warm, got 3 blankets too so I dont care a hang for anyone now, only we have to go back again thats the crook Part about, once I used to be able to look at dead and shattered men & crook sights, without turning a hair, there were a few thousand at \"Lone Pine\" but now I get nervy, been too long at it without a spell I think Jove I hope my nerves dont give way. \n","73":" In billet in Country been here two days, have been feeling rather crook on it the last two days, went and saw the quack this morning and have got a day off. I had to go back to Albert on the","74":" to get some gear, gee I was cold, I went in a limber and as limbers have no springs, it was a rough ride, we were just nearing Albert when it started to snow and it kept at it up till we got home again. The old Padre here is starting a band and he’s as pleased as Punch about it too.\n\nIt snowed here yesterday and its thawing today, I wonder if there is anything worse than cold feet, if there is I’d like to find, just for the experience. They say we are going up to the Arras front this time, I hope so there are trenches there at any rate.","75":" Feeling a bit better today and have been parading, A cobber came round last night and borrowed 10 francs, asked me to go out with him for a drink, It was pretty miserable sitting in the dark in a dirty cold barn and I told him if he could find \n\nanything to drink Id go, we went out anyhow and hit a ranch up a back alley, put the word on the bride in charge, no she had nothing except beer would the messieurs drink beer, no the messieurs wouldnt , so we strolled further on and roped in a piece from a farm as a guide, she was a bit dippy I think, she led us half over France, by way of dirty filthy lanes she opened a door at the end of one of them and bumped us in a little room\n\nlit by a single candle, swear, Lord we did beef it out, and the bride was looking on with a silly grin on her dial, the floor was made of earth, just the old ground, and walls were bits of packing cases with some more earth to fill up the cracks an empty biscuit box served as a seat, and pictures torn out of a Paper that called itself the \"Petite Journal\" adorned the walls. We sat down on the biscuit box and asked the girl to produce the liquid, \n\nshe went outside, and brought back a couple of bottles said they were wine, and by Jove it was, not the sour dope they hand out at 2 a glass, but good dinkum sweetwine the first mouthful I could feel trickling all the way down, it was lovely and warm, so we made a bit of a fire and sat round and finished 3 bottles between the two of us it did me good too Im feeling much better today, The crowd have all got their band\n\ninstruments, and they are making the place hideous with their row. Heard today that one of our chaps has put his ticket in through overindulgence, he was in the trenches Xmas week and got hold of a jar of rum and drank the bally lot, and threw the , what a glorious death, he wasnt like one of the","76":" Bn lads though he was taking rum to the line got to what he thought was one of our Posts and sang out, come and get your rum you B____\n\nthey came out and got him and the rum too, they were Fritzs, he’d went to the wrong post.\n","77":" Nothing much has happened the last few days, it snowed heavy night before last, and we had a march through the snow, it wasnt very cold while we were moving but when we stopped it was some. Have written a few letters home and have got myself fairly clean on it now. Saw Claude Wilkins tonight, at least I think it was Claude\n\nhad a yarn to him, he’s alright, has just joined up and has not seen the line yet guess his lot is to come. I think we begin to move up again on Sunday but am not sure. The country round here looks pretty under the snow, in fact it looks rather well, all the mud and slime is covered by the snow and looks A1. Wait till it starts to thaw through, guess she’ll look rather pretty then.\n","78":" The Bde has been out making snide attacks\n\nagain today, but they were not too bad at all, all I did was walk about 100 yds and light a flare, which consisted of a sandbag rolled up and dipped in kerosene, it took a while to get the darn thing to light and the C.O. was swearing some but when she finally got going, a mighty cheer went up and I sat down and warmed my feet while the rest cantered over the snow. Got a parcel from Griff today, also a letter.","79":"\n\nhad a church parade, had to get our equipment to bits and march out in an open field, and stand in Ice and snow for an hour, while the Padre told us what a good chap Jesus was Lord it was cold on the feet, the crowd soon got restless and forgot all about the service and there were mutterings and curses everywhere, spoken none too softly either., I think the old Padre got wise, anyhow he cut it short and let us go in. I have had the blankets wrapped\n\nround my feet all the rest of the day to keep em warm. We move up again on Tuesday, back towards the line again On the Somme, guess there will be some big stoush here shortly, well the bigger the better Im fed up with seeing my cobbers spread around without any chance of getting one in yourself.","80":" In Huts at Becourt, not a bad camp at all, in the forward area and liable to be shelled but we may be lucky, had a 12 mile walk to get\n\nhere, left at 10.30 this morning and marched through Warloy & Albert and on here, I didnt feel the march extra much, but I was jolly glad when it was through. Everything is frozen hard here, all the Taps on the water carts and pumps frozen hard, you are constantly reminded of the facts that you have ears. It was very cold yesterday and miserable, but today the sun was actually shining, the first time Ive seen it for a long time\n\nIt is rumoured that we are going to have another hop over, on a big scale and if the ground keeps frozen as it is now, there will be nothing surer but it will be hard work we have got Fritz well beaten though, and by the time our Artillery are finished with him guess there wont be much for the moppper’s up to do except stop his shells. It will do me though.\n","81":" Still here in huts but we are moving up into the line or nearer to it tomorrow. The last two days have been bright sunshine but\n\nbitterly cold. The water and food freezes, the bread is like iron, the first time we ever tasted frozen bread and I dont want to taste too much of it, guess there will be plenty of frostbite when we hit the line, if this weather lasts. Got two letters from Mum & one from Maud last night, this Mauds a character though.\n","82":" In huts at Basentin. Marched here this morning, Got wise to a coal dump as soon as we landed and put our frames in with a fatigue party and collected 3 bags of coal, and we\n\nnow have a very fair fire going, it took some to get it going though there were only 8, giving advice and poking at the dashed thing, but she is going good now. They have cut our rations down and I have been hungry for 3 days, Im afraid to sit down to a feed or Ill eat all my days rations at one pop. Am going out foraging this evening to see if I can cadge any from the batteries, there are a lot along the road mostly 6 & 8in real beauties\n\nthat will tear the hide off Fritz in the spring, he got it hot last July, but it will be nothing to what he will catch this trip, they will simply spread him round in little bits. The Tommies who have come out of the trenches \nlast year\n last night say they lost 24 men, died from exposure, and there are no trenches here either, just Posts really shell holes, with a bit of the mud off.\n","83":" Just been in from getting some water gee it was some, we had to fill\n\nthem at big canvas tanks and the water was frozen over, ice inches thick, we knocked a hole in it and filled it one dixie and while I was filling the other Im hanged if the other dixie didnt freeze, well it got me, I knew it was deadly cold but for water to freeze while you are looking at it well it will do me for a bit of a feast, one chap warmed up his water for a shave and while he was rubbing the soap into his chin the water in the Pot froze hard and he did swear, I reckon we all \n\ngoing to do a freeze this time in the line, The rations too are getting very crook, one loaf to seven men and a tin of jam to 10 and a tin of Frozen bully thrown at you for dinner, oh its some country this\n\nI saw a Photo the other day in the Sydney Mail, a Photo of Posieres, it was a dinkum Photo alright, I cut it out and am going to keep in this book, the building is part of a house and underneath is a German dugout, that is where our signal station was and down\n\nin the gully where the chaps are walking was where my lines ran to the Front line and back to Brigade, and didnt they get shelled it was lively believe me running those wires, the ground round the dugout was littered with dead when I was there but I dont see any in the Photo.","84":" nothing much doing yesterday & today, its still freezing hard and we move up into the line or close supports tomorrow, by all accounts its fairly lively. Played Poker last night and \n\nwon a few francs, wrote to Lill & Mum. Heard that the Tommies had hopped over yesterday morning and took 1000 prisoners & 6 officers. Our Bde might hop over this trip if it keeps on freezing. The boss has just been in to verify my numbers and Christian names in full, I wonder what its for. Been Playing Poker came out square, got a Parcel from Mum and the undershirt was bon. \n","85":" Not moving up today as I thought, go tomorrow night, its snowing lightly this morning and still\n\na few degrees of frost lying in the air. The boss and me of the chaps have been up to the line, they say it is not a bad possie, but the Lines (Phone Lines) are very crook, so crook in fact that the boss is putting on two extra men in with me, so Ill enjoy my spell up there.\n\nThe temperature the day before was 8, 24 degrees of Frost and it was all out too, the Forecast for tonight is between 5 below and Zero Phew. I had half a cup of whiskey last night and by jove it was good it warmed me up a treat and I \n\nslept fairly warm. Tried to get some coal or coke but nothing doing so we will have no fire tonight.","86":" In the line again, it was cold last night, had to get up and walk about to get the blood going again. I have a new man on the lines with me, the other chap joined the band, and they dont come into the trenches we came up at 11 O’clock 3 mile walk along duckboards covered in ice, we fell on an average about every 50 yds they were so slippy The Signal station is not bad about 30 feet underground, but the lines \n\nor wires, are crook, buried in snow and ice and when they break its a hard job to find the ends, the chap who was showing me over them was slightly dippy I think and I told him so, he went crook we are about 700 yds off the Germans and they can see our every movement against the snow why they dont snipe more at us I dont know but its a kind of mutual arrangement I think, its a case of if you dont shoot we wont, a happy state of affairs, but how long \n\nit will last I dont no we relieved the Tommies and they keep quiet but our chaps generally leave a place a darned sight warmer than when they came in, I think they would make paradise pretty warm. Its a dreary desolate place, nothing but snow and ice everywhere and the cold is deadly. Our Artillery opened up this evening and Fritz retaliated in kind and sent a big 5.2 right on our dugout, but we are about 15 feet underground so it didnt get any\n\nof us but I hope he does not put another one there or its goodnight nurse. We are here for 12 days nuff said. I asked the boss today what he wanted my name and number for, and he grimaced (a tricky sort of smile) and said \"Oh something\". I wonder what it is. Just had a feed of bully, onion & bread all were frozen, the onion was nothing but ice and you couldnt taste the onion in it at all, like crunching ice, the bread took 5 minutes to \n\nget a slice off and the bully Oh never mind.\n\nWe are moving out of here in four days to take another possie lower down. And the latest rumour is that Peace will be declared soon\n","87":" Fritz is shelling a good deal just at present, big heavy stuff too. I went up to have a look at our new Possie today, its about 300 off Fritz, but its fairly Quiet, he had a couple of shots at me this morning at about 500 yds and missed, and Im a fair target","88":" Fritz been quiet and lively by turns today, on the\n\nwhole nothing doing, still Freezing, and I hope it keeps up, Im dreading a thaw. This is a rotten place for snipers, they had another go at me today, but they must be rotten shots, for they went wide had a decent drink of hot tea, for tea tonight, and my lines are holding well.","89":" The Boss and I went up the line to to look over the wires Lord they were in a Tangle, and talk about a bombardment it was pretty after it subsided the snipers started in to amuse themselves\n\none chap fired 10 shots at me, the tenth one got me, in the side and out the back, I didnt swear either but I could walk so It did not matter walked down to the dressing station at Basentin and am now waiting to go away to the Casualty clearing station it will do me, though he could have hit me harder if he liked I wont get much of a spell out of this lot but she only missed the heart by 2 inches so I suppose I shouldnt\n\ngrowl, The chap next to me had a shrap in the legs and is crook with the effects of the innoculation. They innoculated me but I had no after effects, We arrived at Edgehill in the evening and were examined, the chap who was next to me died in the train coming down, We go on again tomorrow to another hospital wont be sorry either This is cold as charity\n","90":" Awoke early this morning very cold, was awake nearly all night listening to the roar of the guns, some\n\nbombardment believe me, we left here at 10 o’clock for the Hospital, we were to go to either Rouen or Etaples, Rouen we didnt know much about, but Etaples we did, if not personally, by repute, it was dead rough no tucker and plenty of work, so we all prayed for Rouen, and there we went, we got in about 10PM had some hot soup and a bath and got into bed","91":" This will do me, got a bonza bed, and nice and \n\nwarm, the tucker is not up to much but otherwise she’s good O\n\nThe doctor came round at 12 had a dekko at my wound, said it was a good shot and got out. There is a sister in charge of this outfit, she’s no oil painting but still a mans cant get a lid on his coffin out here. Its snowing outside now but its not worrying me in the slightest I wish that hun had cracked a few of my ribs up for me while he was at it, I\n\nmight then have had a chance of getting to England.","92":" up today, feel pretty well the nurse asked me to black led the bit of a stove here, I did, but she didnt think much of the Polish she asked me could I scrub I gave a decided no, The tucker is pretty crook and the whole outfit is not paradise Oh no, the only good thing about it, is the bed, it is some, no chance of getting to England but Ill be here for a day or two yet the wound has\n\nbeen rather painful but I can get about A.1. The days are very cold on it but warm in bed.\n","93":" The last week has been a bonzer rest, and Im all OK again now, will be going to the convalescence camp soon The doctor here is a nut he is too tired to move about, comes round of a morning and its Hullo Dad, how are you \"oh not too bad\" \"carry on then\" never troubles to look for himself One chap was alright had been for a week and when the doc asked him how he was \"Im alright\" \"Lets have a look at it.\"\n\n\"huh\" \"better have another day.\" We have two sisters here one of them a senior and they are some, cant stand for women mucking around me, but Ive got to take ‘em with the rest.\n\nThe senior one used to nurse in a babies outfit before the war, and she has been decking us out in Red Ties and little Frills etc, she has even got 6 toys here, little sheep and roosters, that squeak when you bump em Oh Lord shed drive you dilly told me to go to church on Sunday told her I didnt believe in it\n\nshe took it all in and lectured me for about 20 minutes. The other one is an artist a pretty little piece too and she has half the doctors in the ranch running after her, she can hand out the glad eyes too, but shes a good nurse.","94":" In convalescence camp, came here last night, Oh believe me its some camp, the walk down opened up my wound again and the old shirt got a bit of gore on it and stuck to my side, it was a bit cold too, so\n\nwhen a malingering sgt chatted me about feed I went crook, so did he, had quite a heated argument but I won the day, you see I was a bigger man than he was. The beds are the same as in the hospital minus the sheets but I dont mind that, the tucker is , for breakfast (6.30) we get a piece of bacon cold size of a cigarette cold a piece of bread and one plate of Porridge between 8 men, we are going to toss for it tomorrow to see who\n\nhas the lot. dinner consists of bully beef and biscuits tea of bread and butter. The worst of it its so cold, the huts have no fires in the, and if you want to get into the YMCA, where there is a fire, and opens at 11 you have to line up at 10.30, in fact you have tom line up for everything here, dinner doctor wash and canteen, They have not paid any of us while in Hospital but I believe you get 5 francs after you have been here a week. \n\nMy wound was very sore this morning and the \"doc\" reckons I should still be in hospital, so do I, but there are such a lot of wounded coming in that we had to get out, but it feels better now that it has been dressed. Some of the wounded that come in bear some awful wounds, and the poor beggars suffer agony, but it all in war.","95":" Getting better Quickly, they took us to Rouen to the pictures yesterday the town looked good to me so I handed\n\nthe movies a bye and went in, its some place bout as big as Sydney the River which runs against the town was frozen over and looked A.1. I had a look at the Cathedral which is a beauty, pretty old too, all the faces of the figures have been washed off by the rain. I had a feed and a couple of beers, but my francs then gave out so I had to come home, got there without getting caught, and am now putting in my \n\ntime wishing for money to go back again. I expect I will be out of this in a week now.","96":" Went to the Quack this morning \"well hows the side\" \"not bad\" \"Lets have a look\" while he was having a dekko he spots a rash on my back bumped me down to the skin specialist who examined me reckoned I had exzema so have to stop on here now, crook Luck. Theres too much religion in this camp far too much, went into one hall here, and a Parson was spruiking about always smiling\n\nno matter if your wife or sister dies, smile, be happy, a chap would look nice hopping into a ranch where one of the family had petered out and start ragtiming on the Piano, if you go to the Library all the books are about Jonathon or some other Guy belonging to religion, if you go near the other huts where they have fires you have to stand for Fight the Good Fight etc, and we’ll have a lantern lecture, a few slides, and a hymn a few more, and\n\nanother hymn, then a short address, a few more slides and another hymn, we wont keep you long boys so join in\". Gives me the pip. I want to join up my unit again Im fed up with con camps and cold footed beggars moaning & whining & swinging the lead, a man feels inclined to stoush em. They Pay 5 francs a week here about 3\/7, I, having been burdened with the honour of one stripe, caught 10, the first time it has ever been any\n\ngood to me. Have just finished mucking about in the skin lines, we went first to get a bath, I thought, this will do me, we went into a tent undressed and handed over our clothes into the chap in charge, lumbered with an overcoat around us, to the bath, nice and chilly, and instead of a hot bath 13 of us were poped in a room and they let loose a cloud of yellow vapour on us, it had a peculiar smell, to say the lest, and was very dense. We stopped in about 10 minutes, came out gave ourselves a rub with a \n\ntowel and lumbered to another joint for our \"new\" suit, I got mine and got back to the tent to put it on, and I never saw such a filthy lot of clothes in all my life, the shirt I put on after a row with the orderly but I couldnt come at the singlet, it was the last word in filth. I got the tunic & pants on somehow and utterly disgusted was walking out when \"Hi choom what are you going to do with this\" \"this\" was the singlet \"I dont know\" I said \"better put a brick on it till I tell the princess to come\n\nalong and bury it\" \"Youse Orstrilians are allus mighty smart arnt yuz\" I went down to the tent then to get the rash painted, an orderly was sitting on his hip Pocket. I showed him my paper \"That jar over there and heres a piece of bandage, do it yourself\" \"Thanks\" I said \"Awful war isnt it\" \"That jar\" had a concoction like treacle in cold weather in it, but I smeared some on me and got out. Im going to get out for keeps as soon as I can I think that damned vapour got into my \n\n\"The Dinkum\"\n\nwound too, its stinging some.","97":" \"Bless all our Soldiers and the wounded both ours and the enemy\" Oh hang! \"Bring cheer and sunshine into our hearts\" I feel as cheerful as a hungry cat in cold storage and just as cold and this dippy old Guy is still going on in his dull sleepy monotone \"give peace in our time Oh Lord\" He’ll hop over here in a minute and ask me if I met him, he’s asked me about a dozen times already and Im nearly off \n\nmy nut, morning noon & night its religion nothing but religion, trying to kid us all that this little war is just a love token or something like that, the mans balmy, you cant get away from him, you meet him on parade and he pushes a tract under the icicle on your nose, and \"have you met ......\" \"Yes old chap\" and you get for your life, creeping down of a morning for your compulsory wash, you meet him\n\n\"Have you given thanks for the Glorious Sunshine that heralds forth the birth of another day\" Oh Yes! the fog as thick as pea soup, mist heavy like rain, and water all frozen and you are going to wash, Sunshine, Yes, Thats what I and all the rest want, not all this drivelling rot, about religion, half of the crowd are balmy with it, one joint handed me the whisper, in a beautiful, \" Im one of the chosen tone\" of voice that it must be awful to kill a\n\nman, Yes old chap awful, but it would give me great pleasure to fix him, he’s in khaki a conscript, and he yaps to me, about love I yarn to him about hell and he gets mad if I dont soon get out of this joint Ill go mad but Ill have to stick another week of it at least.","98":" They are yelping out something about the Old Old Story, but Im cold so have to stand for it, the bride rattling the ivories is rather pretty too, she ought\n\nhave better senses. My rash is getting worse and the wound better. The old doc pushes at it with his stick and allows its excema, hes a nut everything is excema to him from ingrown toenails to boils, one chap had a bonza boil, nice and ripe He gives it a prod with his stick \"Ha excema\" another joint had a hole right through his leg by a machine gun bullet \"Hmm excema\"\n\n\"excema be damned its a wound\" \"Im the Medical Officer here put down Excema\" Oh hes a Oh damn the old guy is howling for someone to tell him the Old Old Story, I cant write, I wish someone would chat and tell him a yarn, Im going.\n","99":" Gee its cold this morning the wind would chop you to bits, Ive been walking about trying to get warm and wanting for this joint to open theres a fire here but no hope of getting \n\nnear it though, but its warmer than outside. Didnt see the doc this morning, couldnt pull it on at any price, fancy coming to the tent door with only your socks on, and stand there while he jabs at you with his stick and argues the point with the orderly after the orderly is thoroughly convinced that you have exzema he says I think you have better go and get anointed with Cod Liver Oil\" You are blue by this time \n\nand wish for the tent to get on with the anointing you get in and \"bump some Cod Liver oil on one Cobber\" \"Na poo\" Orstrilia finish\" and he grins at you like a fiend very fine joke so you go away and put on your duds & by the time you are warm again, you get wise to the fact that it was all for nothing\n","100":" Its been snowing hard the last two days and today a thaw has set in and its Glor-ee Gloyy Halleluiah Glor-ee-ee, and the Doc\n\nis just about rattled went up to him yesterday he asked me how I felt, the chap before me said he felt cold and he roared, so I told him \"Just about the same\" \"Hmm let me see you’d better try – try what did you have yesterday\" \"Powder Doc\" \"Then try tar today\" Ive tried every darn thing hes got in the ranch, but nothing doing, I started off with a vapour bath then smeared dope like treacle all over myself then yellow Paint\n\nthen Zinc ointment then Boric Ditto, I then gave both of em a fly together (arf & arf) you know, he then gave me \"Cal – lotion\" then Borasic Powder but none of em were any good and the old doc got kind o’ rattled, he scratched his head Poked me with his stick and \"Let this man be anointed with olive oil\", well I was anointed in the best John the Baptist style, but no bon so I hopped back on the Powder\n\nagain and today its Tar, nice black, sticky ordinary common or garden tar, does he think mans a lizard or a footpath, but I suppose Ill have to put it on, but if it fails Im hanged if Im going to eat blue metal, but Ill take it all it might finish up in blighty and then \"for what we are about to receive etc 14.3.17Am sent back to the Con Camp with Boils, yes boils, blind ones, beauties, they were so obviously boils that the \n\nold doc couldnt call em anything else, though the first time he noticed them he called em eczema and looked up to see if I noticed it, it must have broke his heart to have to finally admit they were boils, but they are and I know it, Im stiff its seems Im destined to stay here, and watch Tommies eat, they are beauties one chap eats his soup with a spoon and evidently relishes it by the row he makes, but gets tired after the first two or three spoonfuls, too slow, and puts the plate to his mouth\n\nand the alleged soup runs out the corners of his mouth, and he tries to guide it back again with fingers that never been washed since the war, to finish up he cleans his plate for the next course (nothing) by the simple expedient of licking it clean, straight up & down, then criss cross, when clean he puts it down with a sigh, wipes his hand across his mouth and blows his nose he hadnt a handkerchief, The orderly, who washes up, comes along sees\n\nhis plate and tosses it among the clean ones \n","101":" Asked the Quack to send me out yesterday but he sent me to bed. I went of course, Im sick of this I want top get back to get my mail there ought to be some there for me by this. The weather the last few days has been good, sun out and not too cold.","102":" Still in Con Camp\n","103":" Went to see the Colonel today he has marked me England. Gee!\n\n"}}