{"Document Name":{"0":"Diary_0454","1":"Diary_0454","2":"Diary_0454","3":"Diary_0454","4":"Diary_0454","5":"Diary_0454","6":"Diary_0454","7":"Diary_0454","8":"Diary_0454","9":"Diary_0454","10":"Diary_0454","11":"Diary_0454","12":"Diary_0454","13":"Diary_0454","14":"Diary_0454","15":"Diary_0454","16":"Diary_0454","17":"Diary_0454","18":"Diary_0454","19":"Diary_0454","20":"Diary_0454","21":"Diary_0454","22":"Diary_0454","23":"Diary_0454","24":"Diary_0454","25":"Diary_0454","26":"Diary_0454","27":"Diary_0454","28":"Diary_0454","29":"Diary_0454","30":"Diary_0454","31":"Diary_0454","32":"Diary_0454","33":"Diary_0454","34":"Diary_0454","35":"Diary_0454","36":"Diary_0454","37":"Diary_0454","38":"Diary_0454","39":"Diary_0454","40":"Diary_0454","41":"Diary_0454","42":"Diary_0454","43":"Diary_0454","44":"Diary_0454","45":"Diary_0454","46":"Diary_0454","47":"Diary_0454","48":"Diary_0454","49":"Diary_0454","50":"Diary_0454","51":"Diary_0454","52":"Diary_0454","53":"Diary_0454","54":"Diary_0454","55":"Diary_0454","56":"Diary_0454","57":"Diary_0454","58":"Diary_0454","59":"Diary_0454","60":"Diary_0454","61":"Diary_0454","62":"Diary_0454","63":"Diary_0454","64":"Diary_0454","65":"Diary_0454","66":"Diary_0454","67":"Diary_0454","68":"Diary_0454","69":"Diary_0454","70":"Diary_0454","71":"Diary_0454","72":"Diary_0454","73":"Diary_0454","74":"Diary_0454","75":"Diary_0454","76":"Diary_0454","77":"Diary_0454","78":"Diary_0454","79":"Diary_0454","80":"Diary_0454","81":"Diary_0454","82":"Diary_0454","83":"Diary_0454","84":"Diary_0454","85":"Diary_0454","86":"Diary_0454","87":"Diary_0454","88":"Diary_0454","89":"Diary_0454","90":"Diary_0454","91":"Diary_0454"},"Date":{"0":"unknown","1":1860.0,"2":1861.0,"3":1862.0,"4":1863.0,"5":1864.0,"6":1865.0,"7":1866.0,"8":1867.0,"9":1868.0,"10":1869.0,"11":1870.0,"12":1871.0,"13":1872.0,"14":1873.0,"15":1874.0,"16":1875.0,"17":1876.0,"18":1877.0,"19":1879.0,"20":1880.0,"21":1881.0,"22":1882.0,"23":1883.0,"24":1884.0,"25":1885.0,"26":1886.0,"27":1887.0,"28":1888.0,"29":1889.0,"30":1890.0,"31":1891.0,"32":1892.0,"33":1893.0,"34":1894.0,"35":1895.0,"36":1896.0,"37":1897.0,"38":1898.0,"39":1899.0,"40":1900.0,"41":1901.0,"42":1902.0,"43":1903.0,"44":1904.0,"45":1905.0,"46":1906.0,"47":1907.0,"48":1908.0,"49":1909.0,"50":1910.0,"51":1911.0,"52":1912.0,"53":1913.0,"54":1914.0,"55":1915.0,"56":1916.0,"57":1917.0,"58":1918.0,"59":1919.0,"60":1922.0,"61":1923.0,"62":1924.0,"63":1925.0,"64":1930.0,"65":1931.0,"66":1932.0,"67":1933.0,"68":1934.0,"69":1935.0,"70":1936.0,"71":1937.0,"72":1938.0,"73":1939.0,"74":1940.0,"75":1941.0,"76":1942.0,"77":1943.0,"78":1944.0,"79":1945.0,"80":1946.0,"81":1947.0,"82":1948.0,"83":1949.0,"84":1950.0,"85":1951.0,"86":1952.0,"87":1953.0,"88":1954.0,"89":1955.0,"90":1956.0,"91":1957.0},"Entry":{"0":"\n\n","1":"\n\nNew Years Day in the Field again. I am on duty as Field Officer. We have several football matches going & Mrs. Chisholm’s \nTea\n!!! Buffet is coming. All ranks had 2 bottles Beer per man.\n\nNowell did not go to France but on the Western front here Sollum – it was my mistake – Cath Fetherston-hough are taking the wife to dinner today. I am so glad as the wee girl would have been alone. Damn General Cox for turning down my leave is my very bad wish on the New Year but it was inconsiderate & cruel.\n\nLove to all at home\n\nYour son.\n","2":"\n\nPosted notes yesterday. New Year passed all right after all, a good deal more talk than anything else. Officers Mess Tent was cut down last month & a drunken \nCorporal\n tried to get men to raid it. We drill over the old Rafa Battlefield but it is hard to recognize country again. Big engine shed, Water Towers & a Beersheba Railway came in on the old line of Trenches. We have had the wooden crosses repainted & an officer & men have gone to Gallipoli to do the same thing there. Frank Chase & Trooper in 6th L.H. came over for a year last night. His brother Lyle died of pneumonia.\n","3":"\n\nPresident of 3 Field General Court Martials today. Went into figures of 1st L.H. Regt. & find the following –\n\nCasualties, not sickness\n\nOfficers – Other ranks\n\n46 – 636\n\nnot counting twice, wounded. These figures are larger than any other Australian Unit yet many people think the L.H. have done little or no fighting.\n\nSee next page.\n\nGeneral Allenby’s words were printed in big white letters –\n\n\"I was proud of you once. I am proud of you no longer.\" This was the end of this speech after the Bedouin affair.\n","4":"\n\nDolly’s Birthday\n\nWe have Divisional Sports today to try & occupy the men but they are hard to please these days.\n\nHad nice letter from Dolly’s brother, a Captain in R.F.A. I will send it to you later on.\n\nThree nurses from Gaza Hospital came to Mess last tonight after the Sports, our illuminations on the table consisted of Slush Lampas candles are unprocurable & only Pint Pots to drink out of but they I hope knew active Service Conditions – Fancy Dress. Prize went to a Trooper dressed like an old B’dary Rider plus soldier’s equipment, all torn & bended on a very thin horse. Round the Horse’s neck was hung a placard on which\n","5":"\n\nRaining today. Most of the Padres have gone home, so Y.M.C.A. carries on the work, they provided the Prize money for yesterday’s sports, about 200\/-\/-. We have started Polo Club but I feel too old to enter much. Never again will we be young men. Will women make allowances for what has happened to us. I feel so old with Dolly sometimes who is a kiddy in her ways & thoughts. A big Handley Page aeroplane flew over our Camp on its way to India. I took photos in Cairo of one of these machines.\n","6":"\n\nLetter from Joe posted at Honolulu, he will be home long since. Just been yarning with an Officer from Beiyrut, he tells me the distress is very great up there among the civil population – Children picking up grain out of horse manure in the streets to eat!!\n\nDivisional Field Officer today, ramps are being built at the railway so men are evidently not marching further than this. 7 horses are sent by train.\n","7":"\n\nBeautiful weather now, but all ranks are chafing at the delay in getting away, no fresh rumours.\n\nPlease order for me to await arrival from Peapes, Sydney, a suit of mufti – chose Homespun Australian Tweed of grey material – tell them to \nhold\n till I arrive to try on as there will be a rush for civil clothes. They have my measure & beyond the Tummy might have altered I am little different.\n","8":"\n\nRafa\n\nHad a game of polo today reminding me of holidays I spent at Coomete how many years ago?? Tomorrow is anniversary of our fight here 2 years ago. One of our best performances & purely Light Horse – work.\n\nDolly writes all is well with her & the Babe. She would like to go home before Australia but I want to see you first. Very stiff after Polo, if I was a rich man I would love to go in for it.\n","9":"\n\nWent Belah to get evidence from a man in Hospital. We had a Ford Car & ran along the netting road which was put down over 2 years ago & is still in good order. By netting road I mean laid flat on the sand. \n\nWe are just on the Boundary of Sinia & Palestine & altho’ sleeping on the ground it is softer than the black soil, but more lice. We have a delousing parade tomorrow using Boilers captured from the Turks.\n","10":"\n\nField Gen. Court Martial continued today. I hate being President of these things but it has to be ‘did’. \n\nStrong rumours we sail in a month, I hope so, also hear a mail is in from Australia but no letters yet.\n\nMrs. Chisholm’s Soldiers home has arrived from Kantara so it does not look as tho’ we were going there. I still think we may be on board a Boat in a month’s time.\n\nDolly & the Babe are both well & happy but no leave is granted to any Anzac Officer owing to the Bedouin affair.\n","11":"\n\nRafa\n\nBrigadier Gen. Cox inspected us today, he played to the gallery as usual, often at the expense of the officers – visits to the \"Two Up\" School etc. This is of course outre.\n\nVery windy & dusty & last night very cold. \n\nWent for a hunt with the Rafa Hounds some English Officers have here. About 15 went out & we ran 2 Foxes & a Jackal. We are now getting up a Race Meeting for the men, anything to keep them occupied & happy if possible. \n\nNo news only waiting.\n\nWith love to you all\n\nYour fond son\n\nF.W.\n","12":"\n\nOur Y.M.C.A. Church Service, Padres all gone home. Rained hard but I am in a Bell tent. Posted you my Diary today. Letters from Australia delivered just after posting diary – 2 from Mother Nov. 10th and Nov. 24th with Diary printed.\n\nDolly likes to get them sent on to her. Also 2 letters from May & 1 from Lorna. Papers no doubt will follow.\n\nPlayed Bridge last night with some Gunners.\n\nI find you & Day & May had all influenza & only hope no ill effects. We are a good constitutioned family. I could never have come into what we have done had it been otherwise & thanks to your early care of we children.\n","13":"\n\nSquadron drill & building Cookhouses – out of mud. 100 more Horses shot today, no one wants them when they are old & their eyes have grown hollow. Wood is very scarce & we are now issued with a cotton oil seed cap & fine coal neither very serviceable. At Neby Musa near Jordan there is a shale depos. that burns very well when once lighted but the powers that be do not appear to realize it.\n","14":"\n\nRafa\n\nSquadron went to Beach for a bathe, too cold for me as I have a touch of bronchitis again.\n\nGeo. Smith now a Capt. in R.E.s, France wrote congratulating me on my D.S.O. & saying he was going back to H.L.A.\n\nPresident of another Field General Court Martial. I get a lot of this sort of work & do not like it. Prefer now the war is over not to print anything I write now not worth it but nice for my own books of scraps & to interest you in my daily life.\n","15":"\n\nNice & warm again. We can see Trawlers sweeping for mines on the coast & I dreamt last night we were embarking from the Beach here – a la Gallipoli but for home.\n\nMy job of writing War History of the Regiment means a good deal of extra work – if I had my old Diary I could do it well but it has to be done at once.\n\nOne has no conveniences cramped in a Tent & other calls on my time.\n","16":"\n\nRain again last night but the sand absorbs it.\n\nDolly now writes she thinks she would like to sail next month for Australia – will cable you when she does & hope it won’t be too hot in Deniliquin for her in March. Nothing definite re myself but I have hopes of being home by then. Not much chance of our sailing together.\n\nPlayed a game of Polo yesterday, am not much good but like it very much.\n","17":"\n\nCensors have ceased work. I think it a pity. This is a sample of what comes in.\n\n\"We are polishing irons & bits, & doing ceremonial work, practising for a visit from the King or Prince of Wales. What do we want him for, he’s not been fighting & is only a man – if the officers aren’t careful there will be a riot etc. etc.\"\n\nThe rations have been reduced 10% since Armistice & coming back to area of Canteen etc., but the men growl a lot & we hope to get the 10% on again soon.\n\nSaturday 18 January 1919\n\nF.G.C.M. again today & a game of Polo in the afternoon. I’m not much good, always been too poor to indulge in much sport. I’ve done a lot of hard work in my brilliant!!! career.\n\nOn a Board of Inquiry tonight as to shortage of Bags & emergency rations – the former are always short & we Squadron leaders have to pay 2\/- each for them. The latter are eaten by the men & are also charged to Squadron leaders at 1\/6 each rations so we have a good many calls on our pay.\n\nSunday 19 January 1919\n\nBeersheba\n\nWent Beersheba to see the graves of our men & get crosses erected – it was interesting seeing all the Shellal country again. I noticed the mosaic was reproduced in the Australasian lately. \n\nA man named Miller from Mathoura came into my Tent & wanted to know how to become a \"Stock Inspector\"!! He said he knew Joe & had been a drover!! \n\nThere are 20 1st L.H. buried in cemetery among young Gum Trees & 4 miles out among 38 of the 4th &","18":" & where my old Sergeant Major lies Paddy Lenehan.\n","19":"\n\nRafa\n\nThe Military Governor came in his car around the Battlefield & promised to look after the graves. He said the Bedouins were paying their taxes, & altho’ a few burnt our crosses they were not digging up our dead as at first.\n\nThe Railway joined up the old Turkish line running from Gaza to Beersheba. The latter town is not large, usual Mosque, Hospital, etc. The Turks’ schools seldom have roofs on them, more a sort of courtyard. \n\nThe driver of our train was just off to England & being his last trip he \"let her out\" till I expected another accident.\n","20":"\n\nRafa\n\nPost today & enclose snap shots of Babe, hope to go on leave in a weeks time. I get very homesick at times, it seems such a waste of time out here, when a man’s youth is gone.\n\nLove to you all.\n\nBronchitis better but still not too fit, hope no permanent effects from Influenza you all had.\n\nJoe will be settled down again & thankful to be in his own bed I expect.\n","21":"\n\nRafa\n\nWe have an officer on the Peninsular attending to Anzac graves, some have been violated by Turks.\n\nRumoured Gallipoli men are to wear the Mons ribbon so it means another one for me. The word \"Digger\" applied to Australian soldiers is NOT correct here & was never heard 12 mos. ago, more common in France I believe. Letter from Mother & Day Nov. 17. You will have many from me ere this, a long time coming over 2 months! You need not fear about \"Dolly\", she is such a sweet disposition, I am sure will be happy at Bronte. It all depends when she arrives, but may be with you ere these notes reach you.\n","22":"\n\nRafa\n\nThe Two Up School keeps me awake till midnight each night. I gave my Batman a £1 for pourboire and he won £33\/-\/- in one night, some other poor devil lost! Very cold & Bronchitis bad. Trying to write up History of Regt. but with Drill Orders & interruptions it is an impossible task. We are supposed to give men Technical Training for after-war life. The Lectures are a farce given by Amateurs who are very nervous & the men feel it is sort of \"Trying it on the dog\" business as no one else would listen.\n","23":"\n\nRafa\n\nGot as far as the Regt. reaching Egypt in my History, but records are poor to work on.\n\nAttended a Lecture on the problems of the East in the Y.M.C.A. but too cold for comfort.\n\nHere at Rafa is a large ammunition dump & at different hours loud explosions take place in destroying quantities of Turkish ammunitions. Great numbers of arms of all sorts have been thrown into the Mediteranean. More Australian mail in. Mother & Day December 1st with Diary & cutting, many thanks. Hope Joe has arrived safely long before this.\n","24":"\n\nJust got a letter from Debrett, England, asking for particulars as to education, birth, etc. etc. for insertion in re D.S.O.\n\nJim Ayre has a job in Cairo, he sent me some Australian letters he had got – best rumour that Neilson Mills is going to marry Mrs. Ainslie!! This from Frank Chase who came into my Brig. for a yarn. \n\nCold better, may get leave to Cairo tomorrow, this does me good.\n\n3 Australasians arrived together, many thanks for sending same – also local paper.\n","25":"\n\nDivisional Field Officer today. C.O., N.Z.M.R. objected to being inspected!!\n\nHeard report of Anzac garrison. Trenches there still in good order, olive trees grown again, Xs & Headstones removed but graves not violated, in fact Turks had fenced some in. Few identity Discs found in no man’s land & a good many had trophies found in among the bones. Most of the officers got up to Constantinople & were well received as Americans!!! The French garrisoning Gallipoli were most hospitable & I understand the Australians have left a good name behind them.\n\nGot leave, off tonight!\n\nMonday 27 January 1919\n\nCairo\n\nArrived midday & found the wife & Babe well. I am afraid the latter is rather spoilt by so much attention, but she is such a healthy strong youngster. I enclose some more snaps but legs rather out of focus.\n\nWarmer here. Best news is the Regt. sails 1st week in March, so we will be home by end of March. Dolly will come with me if possible, if not she will sail end of February & arrive about the same time, but will cable you. Love from us all & hoping to see you soon in the old home. Your loving son Frank.\n","26":"\n\nWent Shepherds for dinner, took seats at Opera for Jim Ayre, Dolly & self Thursday night.\n\nArranging as well as possible for Dolly to go end of February. 1st L.H. go","27":" week in March so will be on the water I hope when this reaches you.\n\nThe Babe grows visibly each week & is very fit.\n\nHave been appointed Assistant Judge & Steward for Anzac Divisional Gymkana & take up a case of \"Cups\" on Sunday.\n","28":"\n\nLovely warm weather, it is a treat after Rafa & my Bronchitis is much better. Cairo suits me & I would not mind living there, only very expensive!\n","29":"\n\nHospital\n\nTook Dolly to No. 14 to have teeth attended to, going opera tonight.\n\nIt costs lest attention by Military Dentist than these yellow xbreds called Dentists in Cairo.\n","30":"\n\nDentist with Dolly.\n","31":"\n\nHeliopolis Races & dinner at Shepherds Hotel, give you an idea of cost – 3 of us had dinner which cost 4\/-\/- extravagance – which I cannot afford & do not enjoy – really but as a Senior Officer must show up at these functions sometimes.\n","32":"\n\nLeft Cairo, nine inches of rain had fallen in 6 hours equal to 4½ years average which is about 2½ inches. In consequence Train line was flooded & the Motors charge 2\/-\/- to get in from Heliopolis.\n\nHad to bring a case of Silver Cups for sports so had to get on early. Padre Colonel on board inclined to be rough on Australians. I replied that after what we had been thro’ we were certainly inclined to damn comfortable Christianity as represented by him. He was making his first trip to the Holy Land yet 3 years in Cairo.\n","33":"\n\nRafa\n\nField Officer on arrival. Just read a letter from a Colonel’s wife re experience on the transport to Colonels. Saloon had a fancy dress dinner & in the middle of it a bucket of slops was dropped down the skylight & a hose was put through one of the port holes & half drowned some of the passengers, nice!!!\n\nLetter from Mother & Day Dec. 8th – you had just received my first cable saying I was coming end of January. Papers also arrived, many thanks.\n\nThe foregoing rather strengthens the Padre’s opinion, eh?\n","34":"\n\nUsual Parades & Football in afternoon. Drafts left for Kantara getting very drunk before leaving which is considered to be the correct thing – by all ranks. We all find something to growl about & hardly appreciate the war being over!! till we thinks.\n","35":"\n\nRafa\n\nN.Z.M.R. Brigade Races, busy writing diary. Cold little better. Letter from Laura thinking I was in Australia.\n\nLost money at Races but even so life here is cheaper than Cairo & if the men do gamble better to keep them employed than hankering after the Flesh pots of Egypt & breaking away.\n","36":"\n\nRafa\n\nMajor Irwin our C.O. promoted Lt. Col. vice Granville to England.\n\nHeavy sandstorm preceded rain – Y.M.C.A. blown down. Busy writing Regimental History & arranging try-outs for Gymkhana. Cold nights & my cold bad.\n\nJust got word cannot travel with wife & Regt. sails about 21st Feby. – but still nothing definite - & wife may be allowed to sail with me.\n\nLove to all.\n","37":"\n\nRafa\n\nPosted notes yesterday, just heard we go in about 3 weeks which is good – but I do not build too much on rumours there.\n\nThe Authorities are pandering to popular tastes in providing a surfeit of football, racing, boxing, etc. Few realize the strenuous times ahead & one often hears the men growl, \"What has the war done for me, etc. etc.\" I get very disgusted at the heroes!!!\n\nAny written here for you Mother to burn after.\n\nLove from son.\n","38":"\n\nGen. Cox replies to my application to travel with my wife – \"NO\". This officer \"is required to look after his Squadron!!!\", so that blows out that.\n\nDivisional sports again dismounted – a surfeit of demands for prize money from Officers who supply the windfall for all this sport.\n\nAm afraid poor old Day will find this hard to read but it is not laziness on my part – stationery too hard to get & to carry & I am so used to my Diary I \"carry on\".\n","39":"\n\nMy throat & cold is bad & my hair is falling out. I don’t know whether from worry or what, but I am still fat & should be thankful. We are on the winning side.\n\nHad photo taken by official photographer yesterday for Records. John Ayre who is on a job at A.I.F. Hd. Qts. now wants to come home with the Regt. I am applying for him. He sent me letters from Miss Ellie Stewart, Mrs. H.L.A., Percy Smith & others with all the Hay news. Sorry the fires have been so bad.\n","40":"\n\nDisinfecting saddlery & classing horses out to be shot & skinned tomorrow.\n\nLetter from Daisy, December 15 – sorry poor little Mother not been too well – of course I will telegraph from Western Australia my movements.\n\nJoe will be home by this. I hope he escaped the flu. Dear old Day has been very good in writing so often & so much.\n\nJim Ayre may come. Nowell has no intention but I have not seen or heard of him for a long time. \n\nWe have no Padre only a drunken priest at present.\n","41":"\n\nIf you engage a Cook even at 2\/-\/- a week I will pay all extra expense at Bronte. I do not wish to be an expense or to make work for Day.\n\nAm glad you sent May some clothes for Jack. I expect I shall be too stout for many to fit. What a lot I will have to tell you. I hope to get a decent billet for a home for Dolly & my Babe. 7 weeks & I should be home dear old Mother & Day, I do look forward to it.\n\nCold better, throat bad. Filled in form for every man re Demobilisation, his previous work, pay, etc.\n","42":"\n\nDivisional Field Officer. Whole topic of conversation among the men is \"What they will say to the Officers in 6 weeks time – far worse than ever it was after S. Africa, simply a kind of \"Bolshie\" business. \n\nGertie, a little cob I was riding, was shot this morning among 100 others – being over 8 yrs.\n\nAnonymous letters to Officers as to what will be published in the Papers \"when the Regt. gets home\". Officers have been allowed to buy their saddles, the men NOT. That is another source of imaginary grievance.\n\nThursday 13 February 1919\n\nStirrup leather\n\nMeasles have broken out & quarantine commenced. After all we may not go for a while – all very uncertain.\n\n a polo match, 1st Brigade v 2nd Brigade –","43":" Brigade won 3 goals to 1.\n","44":"\n\nRafa\n\n41 today & feel every year of it – but I’ve not altogether wasted my life.\n\nCold better but so many men being in one Camp, not too healthy.\n\nNothing new re sailing – may go end of this month. Dolly will not be \nwith me\n, but another boat. Sorry but can’t be helped. Love to all, your son.\n","45":"\n\nGymkhana\n\nWell the Gymkhana is over, one works hard to amuse the men &ampl get little encouragement.\n\nWe have a Stadium. Owing to my cold, I am in bed but I can hear the Referee being hooted & the lovely flow of language – am afraid that Soldiers on their return will not be much of a \"brake\" on Bolshevism – our old men are back by this or gone west & we have many youngsters who have not been through the Test.\n\nHear that Bertie Austin was actually at 2nd L.H. Hd. Quarters yesterday but did not see him.\n\nWill call if I go Cairo.\n","46":"\n\nKhamsin blowing. R.C. service in Y.M.C.A. We have a Priest of sorts attached to the Regt.\n\nBusy trying to carry on War History but I have only done one year so far. Hope to finish on the Boat. Leave not sanctioned until Brigade returns from Cairo. He, Gen. C- is no friend of mine like old J.B. Meredith was.\n","47":"\n\nLast night we trucked the remainder of our horses to the Remount Depot, Moascar. O.C.s Squadron keeping one horse only.\n\nWet & cold & I cannot shake my cold off.\n\nPolo team in Cairo doing well, winning all before them, against the pick of the English players & the pick of all the Ponies in Egypt.\n\nStilling living in uncertainty in regards to embarking but I do think the end of the month will see us away.\n","48":"\n\nDivisional Field Officer again & also C.O. of Regiment as all the Senior Officers are away. Busy disinfecting saddlery & Horse blankets, the former by dipping in Creosote, the latter by heat in the delouseing Boilers.\n\nThe first thing I want done when we get to Bronte is to christen our Babe, her name is Registered in Cairo & Somerset House, London as Kathleen Dorothy but she has not been sprinkled with the Jordan water yet!!!\n","49":"\n\nHeard a peculiar lecturer today – a Black Jew, born in Dahdmen near Timbuctoo, educated in Glasgow, with a Scotch accent. Claimed to belong to the lost tribe of Simeon? practised Polygamy, wore no clothes, till he ran away & got on a Tramp Steamer at the Gold Coast, fluent, dramatic, & amusing, held his audience spellbound. Not sure he was all he said, but C.O. Jewish Battalion guaranteed him. West who married Brice Fiddle has got his commission.\n\nThe Division has bought a fishing boat & nets & carted to sea, idea fish for the men – some wag has branded the boat ANZACS, last hope for home.\n","50":"\n\nCol. Fulton told us the following that Colombo was now closed to all troops as the Infantry had stolen or broken 3000\/-\/- worth of jewellery, English in fact all country Sailors are on strike & it is indeffinite when we go home, but I will cable.\n\nIt is not known for certain whether the Troopship will go strait to Sydney or if we disembark in Melbourne & go by Train – No boat for Dolly yet. I hope to be in Melbourne first to meet her & so save anyone else the trouble & expense.\n","51":"\n\nHand in Rifles today also Bandoliers & Bells – the men will march on board with their kit-bag & sea kit bag, the latter being pillow cases. All Blankets water bottles & Haversacks left behind.\n\nPresentation of Race Cups at 2nd L.H.B. Hd. Qrs. Mess last night. I went but could not stand the smoke & foul air with Bronchitis, so got out early.\n\nAustralian Mail - Mother, Jany. 5th with Diary Notes & from Joe. Hope our Ambulance people don’t see what I say re Revolver etc. Will get an anonymous letter from driver I expect. Glad Joe got home safely & alls well. Yes, I’ll be glad to hear of a decent job in Riverina if possible.\n","52":"\n\nRafa\n\nDaisy’s letter Dec. 29. Sorry Egyptian officials mutilated Cable & I printed it, remaining – note re Katandra – St. Ives do well, but I hope to meet myself now if only 1 night will go Scotts. Mother’s letter Dec. 22, also letter from Pearce of Pastoralists Review, he said old R.B. Wilkinson still going strong. Very glad Joe is safely home & well – we will have a lot to talk about.\n","53":"\n\nI have enquired into the chances of a good job over here but the British high commands have all got their sons & relatives to provide for – like everywhere else without influence a man can do no good – 1st essential speak Arabic.\n","54":"\n\nGen. Chauvel inspected the Division & said the usual things – but still here & the latest definite news is we sail on March 18 or 19 – that means arriving Australia end of April. The wife goes in the first good boat available next month.\n\nI was Divisional Field Officer – cold much better now that the warm weather is here. \n\nDolly & child are well, love to all. Your son, F.W.\n","55":"\n\nRafa\n\nKhamsin blowing hard – our men have nothing left of equipment & the drill is now ABC Infantry – like my Diary rather uninteresting, but one has to listen to a \"Talker\" and a man need not & read. Lectures are also given by poor Amateur lecturers, the men cursing all the time – it is a great waste of time for every one. One Officer who has been drunk for 3 weeks is detailed to give a lecture to N.C.Os. on the \nduty\n!!! of N.C.Os. in the field. Can you not imagine the Bolshie feelings of those men.\n","56":"\n\nRafa\n\nKhamsin still blowing – letter from Mother Jany. 19th, note Melbourne address & all news. Cannot be home till end of April now.\n\nBusy writing the History of the Regiment, if I had my own Diary it would have been a great help. Tonight a Variety Show was given by Concert Party in Y.M.C.A., no accommodation alotted for Officers & when a few from Hd. Qrs. tried to see they were \"counted out\". Shows again the Bolshie spirit. One dare not leave a shirt out to dry but it is stolen.\n","57":"\n\nRafa\n\nKhamsin still blowing – everything smothered in Dust like a Darling Shower, in a Tent, water becomes mud, food sand etc.\n\nI am the Lecturer today. May the men listen & curse in silence – topic Court Martial procedure. Heard old ","58":"\n Sir Samuel McC. had gone west. I wonder if true – somebody will come in for many millions. Sorry to hear Hunter Landale gone.\n","59":"\n\nKhamsin over & a better day, rode to Beach to see our fishing party who have a mud boat & nett at 275 pt. a day. So far the catch has not justified the expense. It seldom does in the Army, \nno\n one works.\n","60":"\n\nStill Rafa.\n\nStill hoping for leave to Cairo, the wife is tired of waiting & the suspense of not knowing what she is to do. Don’t forget Sinclair.\n","61":"\n\nCairo\n\nActually travelling to Cairo in charge of Anzac leave Party & to remain one week & buy comforts for voyage & write up War History – left kit at Kantara – could not sent a Civil telegram so sent an Army one as follows, \"Stralis Cairo, arriving Sunday midnight advise other Unit,\" meaning Dolly.\n\nFound all well & child grown.\n\nMonday 3 March 1919\n\nCairo\n\nBusy Cairo, lunched with Dolly at Shepheards. Sorry Mr. Austin had gone back, never saw either, am sorry. Tired after journey & rushing around, nothing definite re going Australia yet, but hope to remain with Dolly till I do sail. Arranged Jim Ayre to leave his job & come with me home on same boat.\n\nTuesday 4 March 1919\n\nHad Jim Ayre out to dinner - & had a good yarn, he is a great old scandal monger & loves a yarn. It will be news to you but of course strictly confidential, Dolly thinks she may be having another Babe in 8 months time – so am keen to get settled, but we hope it may not be so yet.\n\nDolly has a big appetite compared to any of our family & eats as much as I do. Of course she is nursing her Babe herself & she is 7 months & gets no artificial food of any sort.\n\nWednesday 5 March 1919\n\nBusy buying games – Concertina, Banjo, Picolo, Tucker etc. for voyage. Very cold & wet for a wonder in Cairo – Dolly & Babe well.\n\nHad lunch at Shepheards with former costs 150 pt. equal to £1:10:- for a meal!! I \nbought\n bought ½ lb. ham for Dolly, it costs 8\/-s, eight shillings a pound!!!\n\nWhile on Tucker, will you get a ham cooked at Jagos also fowls & ducks say twice a week when you want them cold & leave the bill for me, if Dolly goes first. I don’t want Joe to go to any expense for her in any way & as she now thinks another Babe is coming – naturally the Mother must eat more.\n\nThursday 6 March 1919\n\nLatest is Dolly goes on the 14th Mch. for certain on the Euripides or Derbyshire, both fast good boats so I will cable when she sails name of Boat & probable date of arrival Melbourne. It will be a load off my shoulders when she is safe on board with her Kiddy.\n\nLove to all,\n\nAll’s well.\n\nFriday 7 March 1919\n\nBusy at A.I.F. & Cooks etc. re Dolly’s passage, going by Derbyshire on Mch. 12. I think I will go Suez with her. Do not say to her re another Babe till I get home. Had lunch at Turf Club & went to Polo in afternoon. The Regt. goes in Ulimaroa about same time, pretty rotten Husband & Wife not being allowed to travel together. The wife is quite ready after a night’s rest to go strait on home to Deniliquin. I do hope Joe will meet her if he can. I will have to go on to Sydney with my Regiment.\n\nSaturday 8 March 1919\n\nIn town arranging Permits to travel, money matters, etc. As I told you, have sent Dolly’s money to Commonwealth Savings Bank, Melbourne, with specimen signature so she can draw on arrival. With her I am sending the following kit,\n\n1 New Steel Uniform Box 4\" x 2\"\n\n1 old ditto\n\n1 Wooden Box about 4½\" x 2½\"\n\n1 Big leather Trunk\n\n2 Black Tin Trunks\n\n1 Gladstone Bag\n\n1 Brown leather Trunk 4½ x 2½ \n\n1 Hat Box\n\n1 Suit Case\n","62":" Dressing Case\n","63":" Cradle\n\nThe first 3 mine.\n","64":"\n\nI am sending about 400\/-\/- to open an a\/c with Commonwealth Savings Bank, Deniliquin. 100\/-\/- is Dollys but she has her a\/c in Melbourne. I shall draw on above. You might get a statement from Gov. Savings Bank of N.S.W., Deniliquin for me as to how much I have there, please. I enclose the Military Telegram I sent Dolly. Other Unit was understood by the A.I.F. Hd. Qtrs. Busy packing. Dolly will not want to go to any Theatres or anything just a rest & then to Bronte.\n","65":"\n\nCabled you as follows, Dolly embarks Derbyshire fourteenth, I follow with Regiment in the Ulimaroa.\n\nAlls well,\n\nLove.\n\nTuesday11","66":"\n\nPort Said\n\nAs Smallpox broke out at Villa Montrose, I had to get Dolly, Babe & self vacinated. Further difficulties arose owing to riots. The leading Nationalists were deported to Malta so the Natives broke windows & cracked a few soldiers on the head, broke Trams up etc., paralizing Business. I had difficulty in getting a car thro’ the crowds at the Station, 2 Natives were shot. Then all Baggage that I had sent Suez I had to get back to Port Said by Passenger train - I have taken now on board S.S. Ulimaroa to relieve Dolly. All my purchases were hung up & travelling is terrifically hard work, no one should attempt to travel for 1 year.\n","67":"\n\nEmbarked men at Kantara & sailed at 3 p.m.\n\nArrived at Port Said with wife last night – had a big job to get accommodation. Hired a launch & visited the Ulimaroa & arranged for Stores etc. to be loaded, also an increase in the meat ration from 13 ozs. to 20 ozs.\n\nReturning to Hotel & stayed the night but we had little sleep owing to 3 drunken Officers singing next door till early morning.\n\nWent by train to Kantara.\n\nThursday 13 March 1919\n\nS.S. Ulimaroa\n\nEmbarked men at Kantara & sailed at 3 p.m., leaving the wife behind at Port Said to come on in Derbyshire. I leave her luggage with me or most of it.\n\nWeather Hot & boat crowded altho’ we have 6 Red X nurses on board, my wife was not allowed to come. The 2 Regts. 1st &","68":" are on Board with Gen. Cox as O.C. Transport. 52 Officers & 1032 or. ranks on a boat built to carry about 400 passengers. However, everyone is glad to say Goodbye to Egypt. I got all my Stores safely into the hold & find I share a Cabin with 2 other Majors. Of course as Gen. Cox is here we have a Band!!!\n","69":"\n\nRed Sea\n\nAll ranks settling down, anchored off Suez to take in Water & then pushed on. \n\nThe Tucker is good & the men are given all the Deck space there is. I opened a Library & issued canvas shoes to all ranks.\n\nThe men have been issued with 200 Packs of Cards, draughts, Punching Balls, Boxing Gloves & literature, & only have the general inspection once a day.\n","70":"\n\nRed Sea\n\nToday all ranks were put through a Steamer to disinfect for influenza, already 12 men are in Hospital with malarial relapses.\n\nVery hot and I am wondering how my little wife is getting on about 2 days behind in the Derbyshire.\n\nWe should reach Sydney on the 16th April, it is doubtful if the boat calls at Melbourne.\n\nVaccination beginning to tell so I must have needed it.\n\nMy job on the Boat is to look after comforts & to finish the War Diary, I have 2 years to do yet.\n","71":"\n\nRed Sea\n\nChurch Service & Concert at night. Spent an hour in the hold so feel a bit seasick.\n","72":"\n\nRed Sea\n\nBoat drill & education classes but as the latter are voluntary, the average soldier thinks he has learnt enough.\n\nFresh Breeze & cooler. We get up at 0530 & have half an hour physical jerks. It is a treat to eat good meat again -all N.Z. frozen mutton & Beef as the Ulimaroa was last there.\n","73":"\n\nPut all ranks through Steam Disinfector again. Busy writing History of the Regiment.\n\nOf course I pay \nall\n Joe’s expenses if he comes to meet Dolly.\n","74":"\n\nUsual work for me, Sweets, Tobacco, Cigs. issued to the men – we average about 300 miles daily.\n\nA week at sea tonight & each day nearer home.\n","75":"\n\nCalm & uneventful.\n","76":"\n\nUsual Physical exercises & busy on Diary. The Tucker is very good & all ranks are as contented as they could ever be.\n","77":"\n\nVery hot.\n\nSent Dolly a wireless to say alls well & that the S.S. Ulimaroa would be in Colombo on Tuesday & received a reply in an hour’s time saying all was well & that the Derbyshire would also reach Colombo that day, her ship is about 190 miles behind.\n","78":"\n\nMy job takes me down the forward Hole each morning getting Stores etc. & then I am kept busy on the Regt. History so missed church. The men have a free run all over the ship & pasted some doggerel in the Saloon about many of the Officers, generally insulting to all except to Brig.-Gen. Cox, C.B., D.S.O., C.M.G., etc., who plays to the democracy at the expense of his Officers.\n","79":"\n\nThis boat is a good one but like all Transports \nvery\n dirty & the Stewards most independent lot.\n","80":"\n\nArrived Colombo about 7 p.m. & found the Derbyshire got in at 3. Asked permission to visit wife & was refused by Brig. Gen. Cox, only a cable length between the ships. Later permission was granted for all ranks to go ashore next day so at 2 a.m. I slipped away having received a helio message that Dolly had gone ashore & was at the Galle Face Hotel. She was surprised to find me tapping at her door so early. I had difficulty in getting a boat but found plenty of rickshaws at the wharf.\n","81":"\n\nColombo\n\nOne of the best Hotels in the world I think. We took Rickshaw & did some shopping in Colombo, both Dolly & the Babe looked wonderfully well. I put them on board the Derbyshire at 5 p.m. & returned to Ulimaroa. The former boat left the harbour, some 4 hours ahead of our board & as our Firemen are drunk not much chance of keeping up. I am glad to say Capt. McLean is on the Derbyshire & is very good to the little wife.\n\nBought 50\/-\/- Bananas, Pineapples & Oranges for the men & 15000 cheer.\n","82":"\n\nAt sea\n\nGot a rotten cold & still very hot – most of the men behaved themselves, tonight someone threw an onion at some Senior Officers playing cards & one generally gets bombarded on the troop deck. Anzac heroes!!! When the National Anthem is played only a very few take any notice of it.\n","83":"\n\nAt Sea\n\nStill hot, no sign of Derbyshire. Gen. Cox talked about putting me under arrest for visiting my wife but I chanced it & if he had no court martial would have found me guilty – as the A.I.F. especially into that Husbands & wives should see & look after the women. Today a kit inspection was ordered but the men simply struck & would not.\n\nThen tonight we cross the line & the men ran free all over the boat & although I had a cold Jerry Weir had to go thro’ the bath – dragging \nmen\n officers out of their cabins etc.\n","84":"\n\nCrossed the line\n\nIssued free Mineral Water, Matches, Cigars & tinned Fruit but one feels no pleasure in trying to make the trip pleasurable. \n\nCold very bad – I think the fans were too strong in all the shops, hotels. I want a spell in dry Riverina.\n\nHad difficulty in persuading Dolly not to buy another hat, it is a mania & fancy choosing a hat in a hole & corner place like Colombo!\n","85":"\n\nStill very hot & cold too bad to go to Church parade. Jim Ayre & I do War history each day – & hope to finish by Freemantle.\n","86":"\n\nThe Derbyshire is now 200 miles ahead so doubt if I will see the little wife in Freemantle but she will telegraph approximate date of arrival.\n","87":"\n\nWas out at 0330 this morning being April Fools, Reveille blew at that hour.\n\nSea a good deal rougher.\n\nHope you can read this – we now get in to Freemantle by midday Monday 7th Mch., so will soon be home now, Mother dear.\n\nAll my love.\n","88":"\n\nDid I mention that Bevy Liddles ex husband W. West is on this boat & has now his commission. I was about the only one who knew his career & kept quiet about it. Cold better & Diary nearly finished. Wireless came today saying calling at Albany, Sydney & Adelaide so I will be a week later than Dolly. I hope some one meets her alright.\n","89":"\n\nRougher. \n\nAs Major Franklin of the 2nd L.H. who was put on shore at Colombo developed Smallpox all the ship have now to be vaccinated. Just thankful I was done before sailing.\n","90":"\n\nCold better & Diary finished.\n\nOnly doing small rate as coal is bad but hope to arrive at Albany on Tuesday.\n\nLater. We are not going Albany but to Freemantle. I shall wire for a room to Lavender & Scotts Hotel as being Easter they may all be crowded. I think I have a good chance of getting off at Melbourne now & the Derbyshire will only be a day & a half ahead of me.\n","91":"\n\nI do hope Joe can meet Dolly in case I do go on to Sydney – if I do go Sydney will send Dolly’s luggage by Permanent Weight & direct to D’quin & if Dolly does not wait but goes home with Joe, send a wire to C\/- Wilkinson & Lavender, Sydney, then I would not go Melbourne.\n\nLove, Frank.\n\n"}}