{"Document Name":{"0":"Diary_0507","1":"Diary_0507","2":"Diary_0507","3":"Diary_0507","4":"Diary_0507","5":"Diary_0507","6":"Diary_0507","7":"Diary_0507","8":"Diary_0507","9":"Diary_0507","10":"Diary_0507","11":"Diary_0507","12":"Diary_0507","13":"Diary_0507","14":"Diary_0507","15":"Diary_0507","16":"Diary_0507","17":"Diary_0507","18":"Diary_0507","19":"Diary_0507","20":"Diary_0507","21":"Diary_0507","22":"Diary_0507","23":"Diary_0507","24":"Diary_0507","25":"Diary_0507","26":"Diary_0507","27":"Diary_0507","28":"Diary_0507","29":"Diary_0507","30":"Diary_0507","31":"Diary_0507","32":"Diary_0507","33":"Diary_0507","34":"Diary_0507","35":"Diary_0507","36":"Diary_0507","37":"Diary_0507"},"Date":{"0":"unknown","1":425.0,"2":426.0,"3":428.0,"4":430.0,"5":438.0,"6":439.0,"7":440.0,"8":441.0,"9":442.0,"10":446.0,"11":447.0,"12":448.0,"13":449.0,"14":450.0,"15":456.0,"16":458.0,"17":465.0,"18":466.0,"19":467.0,"20":468.0,"21":469.0,"22":470.0,"23":471.0,"24":472.0,"25":473.0,"26":474.0,"27":475.0,"28":476.0,"29":477.0,"30":478.0,"31":479.0,"32":488.0,"33":500.0,"34":749.0,"35":750.0,"36":751.0,"37":752.0},"Entry":{"0":"\n\nBirthday parcel received from Mater. ","1":"\n\nDischarged from Isolation Hospital Feb 23rd 15\n","2":" Received three letters from Mother & one from Cis Robinson\n","3":" Received letter from Cis\n","4":" \n\nPosted letter to Mother\n","5":" received from Mr F Evans\n","6":" received three letters from Mother one enclosed from J Kempley, 10\/- enclosed from Mater.\n\nRegister package for WKF 5 p.t. stamps for G. Bluman\n","7":"\n\nReceived three letters\n\n1 from J Kempley\n","8":" from Cis. Robinson\n","9":" from Pearl Spies\n","10":" wrote to Cis R.\n","11":" received letter from Mother\n","12":"\n\nReceived letter from Cis R in Caufield, Melbourne\n\nPractically our first experience of rain in Egypt occurred today. About four pm. Light showers commenced which abated \nuntil\n about 5 pm. Light showers at 4 am. ","13":" commenced raining in real earnest. At 7 am however, it\n\nhad cleared again, but sky very cloudy. 9.15am commenced raining once more, abating at 12 n.\n","14":"\n\nReplied to Cis R. to Melbourne PD\n","15":" received letter from Mother\n","16":" received papers from home\n","17":" wrote to J Kempley\n\nMrs Evans\n\nAp. 4th wrote to mother from Alexandria and sent views & cards\n","18":"\n\nReceived orders for departure on 3rd\n","19":" A&B Cos. leave Mena, en route on foot to Cairo. Left camp 7.30 pm arrived station about midnight\n\n Easter Sunday\n","20":" 2.30 am train leaves for Alexandria which place was reached at 8 am.\n\nEmbarkation on Derrflinger immediately. The latter ship by the way was one of the armed German merchantman recently captured by\n\nthe British. Ship’s external appearance very dirty & unattractive. However, passenger’s quarters very well accomodated, & officers made very comfortable.\n","21":"\n\nDerrflinger still moored to wharf & crew & fatigue parties of troops busy taking on stores, ammunition etc. 10am No. 3 Platoon A. Co. Mount Guard\n\nThe Derrflinger is to be used in transporting 2nd & 3rd Battalions & is naturally very crowded. At 6.30 pm weigh anchor & leave harbour. Light sea running.\n","22":" Stiff breez blowing all day. Sea pretty choppy.\n\nMajority of troops suffer from sea sickness.\n\nNo land in sight.\n","23":"\n\nStill windy. Land sighted at day break on Starboard side.\n\nPresume we are in the Grecian Archipelago. All signs of sea sickness vanished, with the exception of scuppers not washed out. Ship’s crew mostly Dagos, who try to dispose of fruit, cigarettes, etc. at extortionate rates.\n\n10 am ‘A\" CO get issued with 200 rounds ammunition, pay books handed in &\n\nfixed up for pay at 2 pm.\n\nLand still in sight on both sides (Islands). Paid £2.\n","24":"\n\n9 am Paid an extra £1.\n\nEnter harbour & anchor at 9 am, almost surrounded by land. Many other Transports at anchor & several men-of-war cruising round. Not sure whether mainland or islands. Apparently the latter. Day beautiful & warm, sea like a lake. Russian Cruiser at anchor close by. Same ship in Colombo when Euripides was outward bound from Australia.\n\nHaving become possessors of gold once more, troops indulge in gambling. Though only paid yesterday, many are penniless already.\n\nThursday (cont’d)\n\nAt about sunset, two more men-of-war enter harbour, one apparently damaged.\n","25":"\n\nAwake to find several more ships in harbour, transports & men-of-war. The cruiser we took to be damaged, leaves about 8 am. Dull morning. All hands on board eagerly awaiting time when we shall leave Derrflinger. Lower decks very stuffy & overcrowded. No more meat to be issued on board. This necessitates troops living on biscuits, cheese & jam, with a bread issue once daily.\n","26":"\n\nVery windy. More transports enter harbour.\n","27":"\n\nNice weather. Hydroplane evidently attached to one of men-of-war in harbour, soars over island & finally alights in water close to cruiser.\n","28":"\n\n12 am receive Dad’s letter telling of mother’s illness which he says Dr Martin reports as very serious. Had this letter reached me in Cairo, I was then in a position to write or even cable a reply, but living in Lemnos island without permission to send other than the F.S. postcards, one naturally feels it more acutely. May God grant my dear mother will be spared to see the kiddies reared. S.S. “Armadale\" moors to “Derrflinger\". Receive 2 let. from Cis & one from Mother.\n","29":"\n\n7.45 am A Co. practise leaving ship in boats. 10 am steady rain sets in.\n","30":"\n\nAll hands leave Derrflinger in naval launches & cutters being towed ashore by pinnace. Carry out short skirmish on Island. Natives very clean looking & all houses built of stone.\n","31":"\n\nFeel out o’ sorts & don’t attend afternoon parades.\n","32":"\n\nWeigh anchor at six a.m. & steam out of harbour under escort.\n\nWrote to mother","33":" from Trenches\n\n1916\n","34":"\n\nMy 22nd birthday.\n","35":"\n\nApplied to Agent General for N S.W. for £20 of my Sydney bank account.\n","36":"\n\nMoney received in £1 notes.\n\nHanded over to Mrs Hilder £20\n","37":"\n\nReceived news of my chum J Vitish more than delighted to hear that, after five months on Gallipoli was uninjured and doing well.\n\nJan. 27\n\nDrew £4 pounds of sum deposited with Mrs Hilder.\n\n"}}