{"Document Name":{"0":"Diary_0428","1":"Diary_0428","2":"Diary_0428","3":"Diary_0428","4":"Diary_0428","5":"Diary_0428","6":"Diary_0428","7":"Diary_0428","8":"Diary_0428","9":"Diary_0428","10":"Diary_0428","11":"Diary_0428","12":"Diary_0428","13":"Diary_0428","14":"Diary_0428","15":"Diary_0428","16":"Diary_0428","17":"Diary_0428","18":"Diary_0428","19":"Diary_0428","20":"Diary_0428","21":"Diary_0428","22":"Diary_0428","23":"Diary_0428","24":"Diary_0428","25":"Diary_0428","26":"Diary_0428","27":"Diary_0428","28":"Diary_0428","29":"Diary_0428","30":"Diary_0428","31":"Diary_0428","32":"Diary_0428","33":"Diary_0428","34":"Diary_0428","35":"Diary_0428","36":"Diary_0428","37":"Diary_0428","38":"Diary_0428","39":"Diary_0428","40":"Diary_0428","41":"Diary_0428","42":"Diary_0428","43":"Diary_0428","44":"Diary_0428","45":"Diary_0428","46":"Diary_0428","47":"Diary_0428","48":"Diary_0428","49":"Diary_0428","50":"Diary_0428","51":"Diary_0428","52":"Diary_0428","53":"Diary_0428","54":"Diary_0428","55":"Diary_0428","56":"Diary_0428","57":"Diary_0428","58":"Diary_0428","59":"Diary_0428","60":"Diary_0428","61":"Diary_0428","62":"Diary_0428","63":"Diary_0428","64":"Diary_0428","65":"Diary_0428","66":"Diary_0428","67":"Diary_0428","68":"Diary_0428","69":"Diary_0428","70":"Diary_0428","71":"Diary_0428","72":"Diary_0428","73":"Diary_0428","74":"Diary_0428","75":"Diary_0428","76":"Diary_0428","77":"Diary_0428","78":"Diary_0428","79":"Diary_0428","80":"Diary_0428","81":"Diary_0428","82":"Diary_0428","83":"Diary_0428","84":"Diary_0428","85":"Diary_0428","86":"Diary_0428","87":"Diary_0428","88":"Diary_0428","89":"Diary_0428","90":"Diary_0428","91":"Diary_0428","92":"Diary_0428","93":"Diary_0428","94":"Diary_0428","95":"Diary_0428","96":"Diary_0428","97":"Diary_0428","98":"Diary_0428","99":"Diary_0428","100":"Diary_0428","101":"Diary_0428","102":"Diary_0428","103":"Diary_0428","104":"Diary_0428","105":"Diary_0428","106":"Diary_0428","107":"Diary_0428","108":"Diary_0428","109":"Diary_0428","110":"Diary_0428","111":"Diary_0428","112":"Diary_0428","113":"Diary_0428","114":"Diary_0428","115":"Diary_0428","116":"Diary_0428","117":"Diary_0428","118":"Diary_0428","119":"Diary_0428","120":"Diary_0428","121":"Diary_0428","122":"Diary_0428","123":"Diary_0428","124":"Diary_0428","125":"Diary_0428","126":"Diary_0428","127":"Diary_0428","128":"Diary_0428","129":"Diary_0428","130":"Diary_0428","131":"Diary_0428","132":"Diary_0428","133":"Diary_0428","134":"Diary_0428","135":"Diary_0428","136":"Diary_0428","137":"Diary_0428","138":"Diary_0428","139":"Diary_0428","140":"Diary_0428","141":"Diary_0428","142":"Diary_0428","143":"Diary_0428","144":"Diary_0428","145":"Diary_0428","146":"Diary_0428","147":"Diary_0428","148":"Diary_0428","149":"Diary_0428","150":"Diary_0428","151":"Diary_0428","152":"Diary_0428","153":"Diary_0428","154":"Diary_0428","155":"Diary_0428","156":"Diary_0428","157":"Diary_0428","158":"Diary_0428","159":"Diary_0428","160":"Diary_0428","161":"Diary_0428","162":"Diary_0428","163":"Diary_0428","164":"Diary_0428","165":"Diary_0428","166":"Diary_0428","167":"Diary_0428","168":"Diary_0428","169":"Diary_0428"},"Date":{"0":"unknown","1":454.0,"2":455.0,"3":456.0,"4":457.0,"5":458.0,"6":459.0,"7":460.0,"8":461.0,"9":462.0,"10":463.0,"11":464.0,"12":465.0,"13":466.0,"14":467.0,"15":468.0,"16":469.0,"17":470.0,"18":471.0,"19":472.0,"20":473.0,"21":474.0,"22":475.0,"23":476.0,"24":477.0,"25":478.0,"26":479.0,"27":480.0,"28":481.0,"29":482.0,"30":483.0,"31":484.0,"32":485.0,"33":486.0,"34":487.0,"35":488.0,"36":489.0,"37":490.0,"38":491.0,"39":492.0,"40":493.0,"41":494.0,"42":495.0,"43":496.0,"44":497.0,"45":498.0,"46":499.0,"47":500.0,"48":501.0,"49":502.0,"50":503.0,"51":504.0,"52":505.0,"53":506.0,"54":507.0,"55":508.0,"56":509.0,"57":510.0,"58":511.0,"59":512.0,"60":513.0,"61":514.0,"62":515.0,"63":516.0,"64":517.0,"65":518.0,"66":519.0,"67":520.0,"68":521.0,"69":522.0,"70":523.0,"71":524.0,"72":525.0,"73":526.0,"74":527.0,"75":528.0,"76":529.0,"77":530.0,"78":531.0,"79":532.0,"80":533.0,"81":534.0,"82":535.0,"83":536.0,"84":537.0,"85":538.0,"86":539.0,"87":540.0,"88":541.0,"89":542.0,"90":543.0,"91":544.0,"92":545.0,"93":546.0,"94":547.0,"95":548.0,"96":549.0,"97":550.0,"98":551.0,"99":552.0,"100":553.0,"101":554.0,"102":555.0,"103":556.0,"104":557.0,"105":558.0,"106":559.0,"107":560.0,"108":561.0,"109":562.0,"110":563.0,"111":564.0,"112":565.0,"113":566.0,"114":567.0,"115":568.0,"116":569.0,"117":570.0,"118":571.0,"119":572.0,"120":573.0,"121":574.0,"122":575.0,"123":576.0,"124":577.0,"125":578.0,"126":579.0,"127":580.0,"128":581.0,"129":582.0,"130":583.0,"131":584.0,"132":585.0,"133":586.0,"134":587.0,"135":588.0,"136":589.0,"137":590.0,"138":591.0,"139":592.0,"140":593.0,"141":594.0,"142":595.0,"143":596.0,"144":597.0,"145":598.0,"146":599.0,"147":600.0,"148":601.0,"149":602.0,"150":603.0,"151":604.0,"152":605.0,"153":606.0,"154":607.0,"155":608.0,"156":609.0,"157":610.0,"158":611.0,"159":612.0,"160":613.0,"161":614.0,"162":615.0,"163":616.0,"164":617.0,"165":618.0,"166":619.0,"167":620.0,"168":621.0,"169":622.0},"Entry":{"0":"\n\n","1":"\n\nSunday 21st. It has been a lovely day & we had a very fair attendance at Church this morning. We were putting the afternoon in folding overcoats, & strapping them to the saddles & getting everything ready for inspection to-morrow. We are to be inspected at Zietwoun. Idleboy’s leg is still bad as the result of the kick he received last Monday. Took my new tunic to one of the shops this afternoon to have the sleeves cut down to the right length, went nowhere after tea, & put the evening in, writing. Pitt return ed from hospital.\n","2":"\n\nMon. 22nd. General inspection of the Division by Sir Henry McMahon this morning, & it was a grand sight. The second time we marched past was at a gallop & we were lucky enough to be in a good line as we went past Sir Henry; even the nurses from the Heliopolis hospital were there. We arrived back in camp about one oclock, & had nothing to do but \"stables\" all the afternoon, after tea Cork & I had a game of billiards & then went to the pictures, but they were nothing to write home about.\n","3":"\n\nTue. 23rd. This morning we started from camp at 8.30 on a four days bivouac. We went out on the desert & ran against the 2nd Contingent of L.H. from Maadi, & had a sham fight with them, it was hard work, but the umpires reckoned we had beat them, so we all rode into Maadi Camp together. It was after sundown when we struck camp & had tea at seven thirty we were all about knocked up & felt in no humor to parade the streets of Maadi but were under the blankets as soon as we had finished tea.\n","4":"\n\nWed. 24th. Arose this morning feeling fit for anything, had a lovely nights rest, with the corners of the large flags tied together, making a good protection to our heads from the dew. We left Maadi shortly after 9 oclock, & it was glorious riding down the roads lined on either side with trees, & all the gardens in bloom. We followed the road all day, on the banks of the Nile; at 4 oclock we arrived at Helouan, & soon had the horse lines down & finished tea shortly after sundown. We then paraded the town looking for a bath which we found at the\n\n24.3.15\n\nWinter Palace Hotel, we had a hot bath & put the rest of the evening in playing billiards & it was the cheapest nights amusement I have had in Egypt as both billiards & bath were free. Helouan is famous for its sulphur baths, but they are not open at present on account of the war, as there is no tourists this season. The Winter Palace Hotel is run by English people. It was about ten o’clock when we arrived back in Camp & were soon asleep, with the large flags tied together for a shelter for our heads.\n","5":"\n\nThurs. 25th. The bugle called us up at 6 oclock this morning, & most of the boys were surprised that they were not called during the night, as the officers told them before going to bed, to sleep with all their clothes on, as there would probably be a night alarm. We had the lines up by 9 oclock & were soon on the same road back to Maadi. It is a fine trip with the Nile on one side, & lovely crops of lucerne & barley on the other; we arrived at Maadi about 4 o’clock & were finished tea by 6 oclock. The Maadi boys held a concert in our honor, & it was very good; some of the boys raided the canteen & captured 3 barrels of beer, one was retaken by the guard.\n","6":"\n\nFri. 26th. Left Maadi at 8.30 this morning, we had hardly enough bread for breakfast, & took none with us for dinner. Fighting Charlie Cox came along a few miles with us about midday we met the New Zealanders, & had to fight them on an empty stomach before we could get into camp, we arrived here about 3 o’clock & had a few biscuits before \"stables\", needless to say we did justice to an excellent stew for tea. I put the night in writing home, & was feeling too lazy to do much, was on the feeding party at 9 o’clock.\n","7":"\n\nSat. 27th. Dismounted for a change & we put the day in cleaning equipment. Penny & Nelson received a pass out from dinner time, I went in after tea & met Penny at the Kursaal at 6.30. The Kursaal was very good we then went to York House for supper, had a good time there learning French, arrived back in Camp at 10.30. Merga Mack, Jack Plush & Fitzgerald had to-night out & arrived in camp about 10 oclock & Mack was paralytic. By Plush’s account they had a royal night of it at Shepherds with some officers (infantry) that Mack knew.\n","8":"\n\nSun. 28th. Very windy & dusty this morning. Church parade as usual, but the Y.M.C.A. was cloudy with dust & we had only a short service. A lance Corporal from A Squadron died yesterday at the Heliopolis hospital from pneumonia & was buried this afternoon. Received a pass out from dinner-time, but did not go to Cairo until after tea. Cork, Francis & I went to York House, for a sing-song, & returned to Heliopolis early to find there was a letter from Billy Simon & one from Edie Tomlins.\n","9":"\n\nMon. 29th. No parade this morning, as we received the morning off to clean our gear, for an inspection by Sir Ian Hamilton. Idleboy lost a shoe last Friday, so I took him to the smiths, & had him shod, which took up nearly the whole morning; we had dinner at twelve, & filed out at 12.30, & marched to the same place as we were inspected at last Monday. We only marched by Sir Ian H. once, & it was quite enough, as the dust was dreadful, we arrived back in camp at 3.30. Penny & Butter has gone to town. I put the night in writing to Edie T.\n","10":"\n\nTue. 30th. This morning we went out with our dinners on the desert; & the troops were put on trench digging. I was holding horses & had a good spell lying in the shade of the horses. The day was very warm, & we had our share of dust as usual. We arrived back in camp soon after 3.30, & enjoyed a good tea; went nowhere after tea & wrote to Jennie Sanson. Heard tonight that we are to teach our horses to swim next Friday, Sat. & Sunday.\n","11":"\n\nWed. 31st. We had a very easy day of it. Nelson, Stan & I, rode out onto the desert a couple of miles & were signalling back to camp with the Heliograph at 11.30 we returned to Camp, & had a sprint to test Stan’s mount on the way home, but Idleboy finished up in the lead; had nothing to do after dinner; Stan went into Heliopolis to receive a lesson in French with some lads of the 14th Btn. I stayed in writing; Pitt & Cameron came home \"blithered\" & caused a good deal of amusement, for half an hour or so.\n","12":"\n\nThis morning Stan took our horses out with the Sqd. for exercise; Nelson, Smithers & I was practising the setting up of the Helio. all morning to kill time, no parade after dinner & we dozed in the tent all the afternoon. After tea Cork & I had a game of billiards & then went to the Y.M.C.A. as a concert was on & it was very good indeed, we stayed there till it was time to turn in.\n","13":"\n\nFri. 2nd. This morning we were on the road at 9 oclock & marched through Cairo, & had a lovely ride through fine cultivated lands to the Barrage Delta. It is 26 miles from Heliopolis. A Sq. went on Wed., B Sq. on Thur. & we passed A Sq. at dinner time on their way back to Camp. We arrived at the Delta, & tethered our horses under lovely trees & only a few yards away from lawns, & were told we could go where we liked, & sleep where we liked, so long as we were back for stables next morning. Stan & I went to bed early close to the horses.\n","14":"\n\nSat. 3rd. All the boys who slept on the lawn last night had a cold time of it, as a heavy dew fell, & they were not under trees. We took the horses to the Nile & had great fun swimming the horses over, on an endless rope. A couple got tangled & were nearly drowned, but they came to after some coaxing, one of our lads was kicked on the jaw while unhitching them & was put to sleep for half an hour, but came around all right, two lads were stripped to help any horses that got tangled, but as they capsized one of the boats going over, several others\n\n3.4.15\n\nwho got wet also stripped; & it ended up with 15 or 20 in the water by the time we had finished; we got the whole of the horses back in 15 minutes, & finished up by one of the lads pushing two of the natives off the boat into the water. We had the afternoon off & had a look at the Weir & Bridges, also a walk through the gardens, & finished up by a look through the Museum which is full of engineering models. We heard a rumor to-day of a riot in Cairo last night; in which 3 Aus. were killed by the Red Caps who fired on them. To bed early.\n","15":"\n\nSun. 4th. Were called \ncalled\n out of bed at 5 oclock this morning & were sorry to say good-bye to ‘Barrage\". We had a 6 oclock breakfast \nthis\n & were shortly afterwards on the road; & making for Heliopolis. At 9 oclock we halted, & gave our horses water & feed; also had a meal ourselves. It was a lovely morning & the ride delightful; we arrived back at Heliopolis shortly after 12 oclock & found Crook is in Cairo giving evidence on the riot, as it is asserted he was standing beside one of the men that was shot. As we were coming into Cairo we passed two trains with\n\n4.4.15\n\nAustralian soldiers on board going to Alexandria also a train load of Gurkhas. It is rumored that practically all the troops from Mena was sent to Alexandria last night & this morning. No leave was allowed for Cairo, on account of the riot on Friday night but we were allowed to go to Heliopolis. A couple of nights ago the New Zealanders burnt their picture show down, as they were not satisfied with it. Put this evening in writing home & to Edie T.\n","16":"\n\nMon. 5th. It sprung up very windy & dusty during the night; & as we could see only a few yards through the dust this morning, we were told there would be no parade & we were comfortably dozing in our tents at 9.30 when the \"fall in\" blew, so we had to bustle about & get food for our horses & ourselves, as we were to be out all day, but as soon as we were mounted & started to move off we were lost, the dust was cruel, & we were taken back on the lines at 11 oclock; a lecture in the mess room after dinner. The most miserable Easter Monday I have ever had.\n","17":"\n\nTue. 6th. Had a very good day, were on a scheme at Zietioun & had a good deal of riding through cultivated fields, had dinner by the Canal & came back to camp soon after dinner. We had very little dismounted work & enjoyed the days outing. This morning we received a big Australian mail, & it kept us going all the morning reading. Nelson is to be made either Sergeant or Ser. Major on the head quarter lines, as Ser.-Major Warneford has been made a Staff Officer, that leaves a vacancy for a Capt. in C. Squadron, writing after tea.\n","18":"\n\nWed. 7th. Another Regimental scheme to-day & had a good time of it; we were working by the pumping station, & had dinner there arrived back in camp about 3 oclock. The supply of tucker has fallen off the last few days, & we appear to have a short allowance now; leave was granted for Cairo to-night, & Nelson has taken advantage of it & gone in. Nelson has been working with H.Q. the last couple of days & \"Penny\" & I have been working C Sqd. on our own.\n","19":"\n\nThurs. 8th. This morning we were signalling with Head Quarters & got into communication with some signallers on the hill behind the Citadel. The Squadron was mounted, but there was no parade this afternoon, but we were paid instead, a party from here went to Luxor last Tuesday, & arrived back this morning, they say they had a good trip, shortage of funds stopped me from going. A \"two-up\" school is going strong here in the mess room tonight, trying to get rid of their pay; had to fall in at 8 oclock as on line picquet till 10 o’clock.\n","20":"\n\nFri. 9th. Another parade amongst the cultivated fields, & had a very enjoyable day, came back to Camp through Heliopolis. McFarland’s horse threw him & put a couple of cut in his head. Nelson got malaria yesterday & is still \"crook\" on it. To-day we got tied up in the irrigation canals, & had a job to find a track out. Edmonds horse fell with him jumping a drain. The Abbassieh men from here returned last night; played billiards & finished off a letter to Jessie.\n","21":"\n\nSat. 10th. This morning we had nothing to do but clean equipment. After dinner we had nothing to do but stables; at 5 oclock we had to fall in, in full marching order, as it is C. Sqd’s turn for line picquet, we are on duty for 24 hours & have to sleep with all our equipment on, in case we are called on during the night. After we had tea, I saddled \"Idleboy\" & we were snapshotted by Roffe. At 11 oclock to-night some of the Infantry (13th Btn.) leave Cairo for Alexandria; more leave to-morrow morning at 9 o’clock. Just our luck to be left till the last.\n","22":"\n\nSun. 11th. Put in a fairly good night, considering we slept in full marching order. No one from C. Sqd. went to Church this morning & we had nothing to do but lay about the tent all day. Pettinbery paid us a visit at tea time to say good-bye. It is the first time I have met him. They leave at 7 oclock tonight & take the train from Zeiteoun. We were dismissed from line picquet at 5 oclock this afternoon. Put the evening in writing, as usual. A good many of the Infantry tents were pulled down to-day.\n","23":"\n\nMon. 12th. B Troop are on town picquet to-day (mounted). Stan & I went out a couple of miles on the desert, but failed to get into communication with H.Q. but were signalling with the 2nd L.H. Signallers. We went on no parade after dinner but slept in the tent all the afternoon. After stables we collected some washing & had a couple of icecreams & lemon squash’s. An English mail arrived this morning & an Australian mail to-night, so am putting the night in reading & writing. The horses took fright last night & broke the ropes, we all had to turn out to prevent a stampede.\n","24":"\n\nTue. 13th. B Troop returned from Cairo & arrived in Camp at 1 o’clock this morning, reville went at 5.30 this morning, as the days are getting longer. Stan & I went on parade with B Troop & were getting squadron drill all the morning, arrived back in Camp for dinner at 2 o’clock; had nothing to do between dinner & stables; boxing with Conway after tea, had a game of billiards, & put the rest of the evening in writing. Stan went into Heliopolis to-night.\n","25":"\n\nWed. 14th. Mounted parade with Squadron; had a fair amount of Signalling with H.Q. this morning & had dinner in the shade of the Palm trees & returned to Camp shortly afterwards. The Colonel appeared to be in a rather bad humor all day & gave us a bit of a lecture before we started on the parade, he says we are getting rather slack in our work. Was boxing with Conway after tea. We were to start on an 8 days bivouac tomorrow, but the Transports are getting repaired, & it has been postponed.\n","26":"\n\nThur. 15th. Major Vernon was in command of the Regt. to-day & we were out doing Regimental drill, had dinner in the same spot as yesterday, we also had some trench jumping this morning. We returned to camp soon after dinner. Reveille has been altered from 6 oclock to 5.30 since Monday, & we have been doing half an hours bayonet exercise every morning before stables, & consequently work up a decent appetite for breakfast. Put the evening in boxing & writing. Concert in Y.M.C.A. tonight.\n","27":"\n\nFri. 16th. Brigade day, were out early & had to fight a sham with the New Zealanders. This Regt. was annihilated; arrived back in Camp at 2 oclock, after having a very easy days work. Had no bayonet exercises this morning. After tea I went to Head Q. lines & found a lad from the Infantry had turned up, & wanted to fight Conway. He apparently has a screw loose, & goes by the name of \"knock out\" Smith; all the infantry boys he has sparred with went \"out\" to him. As Conway is not boxing tonight I obliged his mates who brought him over, & went \"out\" to him in 2nd round. It caused the best sport we have had.\n","28":"\n\nSat. 17th. Had to make bag-rugs to keep the flies off the horses this morning (more army rot) & put the rest of the morning in cleaning gear. I received a pass out from 1 p.m. till 10 p.m. & put in this afternoon in the Y.M.C.A. writing, had a game of billiards before tea, more boxing etc. after tea. There was a concert at the Y.M.C.A. tonight, put in some time there, but it was too monotonous, as I have heard all the singers & songs scores of times retired to bed early.\n","29":"\n\nSun. 18th. Came out in orders this morning that Nelson is Sergeant in Head Quarters on probation. Felt too tired & lazy to go to the Church service this morning, so dozed in the tent till stables sounded. After dinner I was watching an Egyptian boy drilling, & he knows more about it than does most soldiers. In fact the Regt. S.M. Lindsell could not think of an order that he could catch him on; he collected 37 piastres on his work; he was taught by the lads at Mena. Stan had an afternoon pass, & went to Cairo.\n","30":"\n\nMon. 19th. Regimental drill all day & had a fairly rough time of it. Idleboy has been lame since Friday, & I rode Nelsons mare to-day & found her to be as rough as it is possible to get them. We were drilling on the desert; arrived back in Camp before 3 oclock. After tea Pitt & I had a game of billiards & then put in half an hour at a concert that was given as a send off to Mr. Bell who is connected with the Y.M.C.A. here.\n","31":"\n\nTue. 20th. Had a touch of tooth ache last night, so I plucked up enough courage to interview the dentist this morning & had it extracted. No parade this morning & the time was put in getting overcoats strapped on saddles etc. as there was an inspection of the L.H. Brigade by General Maxwell this afternoon. I did not go as I had an excuse of going on light duties on account of having visited the dentist. We were paid just before tea time, & I had a game of billiards with Roffe, & had to lend a hand to feed up at 9 o’clock.\n","32":"\n\nWed. 21st. Five o’clock reveille this morning, had an early breakfast, saddled up, & then had to stack our kit bags in the Mess room. We then pulled down the tents, & stacked them, & left the Aerodrome camp at 8.30. We went through Heliopolis into Cairo, & then on to Maadi, we arrived there about 3 o’clock & had no chance of getting dinner before 3.30. We were very hungry otherwise had a fair good-day, saw Alick Samuels & Perritot after tea & then went to the Stadium & witnessed one or two very willing goes, retired to bed at 9.30. Idleboy is still lame in the shoulder & I rode one of Edmund’s horses.\n","33":"\n\nThurs. 22nd. Awoke this morning at 5.30 feeling fit for anything, had a good breakfast & were on the road to Helouan at 9 oclock, had a very good trip & a nice breeze was blowing, the boats on the Canal were busy & were sailing along the Nile in great style. We arrived at our destination at 2.30 & were soon settled, with the horses lined up facing the Tewfik Palace Hotel, we were off duty by 3.30 & then strolled to the Canteen & tested the Ice-creams & cakes, after tea we went to the Winter Palace Hotel & had supper for 10 pt. each & then played billiards till it was time to return to Camp.\n","34":"\n\nFri. 23rd. Five oclock reveille this morning. A Squadron left here at 6.30. B Sq. at 8.30 & C at 9.30. We went to the Nile & found we had to wait a couple of hours, to give the others time to get across. So we put the morning in lying by the road side, buying cucumbers, onions etc. off the natives. We had dinner before the boats were ready to take us across. Just as we were loading our horses on the boat, a Ferry came up the river with M. Venizelos was on board. He had come up to a Greek Restaurant that is on the Nile. I believe he came up also to see the\n\n23.4.15\n\ntroops crossing. After crossing the Nile we had half a mile ride & then came to another river & had to embark the horses again to cross. It was now getting late & we had a good canter till we came to the step pyramids, we had a look through a tomb, & then returned. The roads were dusty & the ride was far from being an enjoyable one. We arrived back in Camp about dark. Getting the horses across the rivers was the only fun we had, but we got them all over safely. After tea I went straight to bed. Stan went up the town to the Winter Palace Hotel again for a bath.\n","35":"\n\nSat. 24th. This morning half the lads took the horses out for exercise whilst the remainder cleaned up the lines. I received a pass out from dinner time & went to the Sulphur Spring & had a bath. Stan went also, the water looked a greenish color, & did not smell too sweet, but it was lovely to swim in, so long as we kept our mouths shut; about two oclock the bath was pretty well filled. I then came to the Winter Palace Hotel & had afternoon tea & did a little writing; and put the evening in at a Concert held at the Tewfik Palace Hotel, the concert was the best I have ever heard. Woods made a \"hit\" singing a duet with an Italian lady.\n","36":"\n\nSunday 25th. Had Church Service this morning at the Tewfik Palace Hotel & had a good service. There is a Church of England Church here & I believe it is a fine place. After dinner I put in an hour in the sulphur baths, & had a very good time there. The baths were pretty well filled early in the afternoon & by 3 oclock it was crowded. Stan received a pass out from dinner time & had a hot sulphur bath. I was feeling rather tired & went to bed as soon as tea was finished. Had a very easy day of it.\n","37":"\n\nMon. 26th. This morning half of us led the horses out for exercise, while the others cleaned up the lines. No parade after dinner & we had time enough to slip down & have our farewell bath in Helouan. Stables at 3.30, then tea, & had to be ready to leave Helouan at 6 oclock. It was just dark when we marched by the Tewfik Palace Hotel, & were soon on the road to Maadi. The night was cool & the moon came out shortly after we started, but I was too sleepy to enjoy the ride, & was glad when we arrived at Maadi at midnight & were asleep within half an hour, & rather hungry to be comfortable.\n","38":"\n\nTue. 27th. Six o’clock reveille this morning, & were tired enough to sleep for a week when the bugle went. We had a buckjumping exhibition & Maxwell was there. The 6th L.H. has an outlaw that has not been ridden, he succeeded in throwing three of our riders this morning, no holds are allowed, & have to ride him in the military saddle, so the men had very little show of riding him. We had a good trip from Maadi to Heliopolis through Cairo. We arrived back in Camp about 2.30, & found there is no water in the pipes or troughs & had take the horses to the Vetinary troughs & found Arthur Welch is camped, came from Mena last Saturday, to bed early.\n","39":"\n\nWed. 28th. Ordinary parade to-day & it was quite a treat to be on Idleboy again, he was quite frisky after his spell. We had dinner in the clump of palms near the pumping station, & one of the lads raced one of the natives at dinner time as there are great arguments as to who is the fastest, the natives or the troopers. The trooper won easily. We arrived back in Camp at 3 oclock, after having a very easy time of it. To-day was rather warm. After tea I went over to see Arthur but found he had gone to town, had a game of billiards & put the rest of the evening in writing.\n","40":"\n\nThur. 29th. Mounted parade & went to the junction of the canal, had a sleep there at dinner time & were back in camp early. After tea Arthur Welch came over & we went to Heliopolis, & saw a Red Cross train come in loaded with wounded Australians \"mostly the 10th Btn.\", they were as pleased as punch & were mostly wounded on the legs & arms. They were fighting Sunday morning last & done some good work. The 9th Btn. of infantry were cut up only 23 men & 3 officers answering the roll call. Returned to camp at 10 oclock very interesting time.\n","41":"\n","42":" Dismounted parade all day & were signalling to B Sqd. had a fairly easy time of it. I see by tonights paper that there was great rejoicing in Australasia when they heard of the work done at the Dardanelles, these papers publish no news of any consequence.\n\nTonight at the Y.M.C.A. Col. Merrington said that our casualties was 2,500 & 600 killed. I put the night in writing. I believe my name came out in orders tonight as Corporal of C Sqd. signallers.\n","43":"\n\nSat. 1st. My name is in orders this morning as Corporal. We have been getting great reports of the doings of the boys at the Dardanelles, dismounted parade & were cleaning gear & watering the horse lines. After dinner we had nothing to do, but lay about the tent. Boxing with Conway after tea, & put the night in writing. To-day was fairly hot.\n\nI believe more wounded have arrived from the Dardanelles.\n","44":"\n\nSun. 2nd. Church parade at 9.30 this morning & we had a very good sermon. The Y.M.C.A. was packed, Col. Plaine preached the sermon. Had a sleep after dinner & went \nnowhere\n over to the Vet. Corps after tea. Arthur Welch & I went to Heliopolis & heard that 400 more wounded Australians were to arrive to-night, the first train arriving at 12 oclock midnight. Jim Trainor from N’mine is in hospital here with a shrapnel wound in his neck. I am Cpl. of the feeding up party tonight at 9 oclock.\n","45":"\n\nMon. 3rd. To day we rode to a clump of gum trees in Zeiteoun & tied the horses up there. We then signalled a few messages till dinner time. Stan went to the dentist & Smithers & I were out on our own. After dinner we came straight home & were in camp at 3 oclock. The Colonel gave us a lecture this morning & said there was too many applications for transfers to the Infantry, & said to use Maxwells own words that we would have a belly full of fight before the war finishes.\n","46":"\n\nTue. 4th. Had another easy day. A good many of the roads here are lined on either side with mulberry trees, & we had dinner under some of these to-day. The Sqd. Sig. left the Regt. & we were signalling back to H.Q. from a mile away per Heliograph. We were under the Mulberry trees, but put most of the time amongst the branches & I had the biggest feed of mulberry I have ever had before. Returned to Camp early & Conway, Jeffries, & I had a good long run after tea & gave boxing a spell. There is a rumor out tonight that we are to leave here as infantry.\n","47":"\n\nWed. 5th. The Regt. had dismounted parade today. We were signalling with H. Quarters this morning & played quoits after dinner. This afternoon C Sqd. took back all the horses belonging to the reinforcements to Abbassieh, & all spare horses in the Regt. were also returned. I believe that 75% of the Regt. have to go to the South of Greece to guard Turkish prisoners. The other 25% are to remain here & take care of the horses. After tea I went to Heliopolis with Arthur & a couple of his friends & had a good time.\n","48":"\n\nThur. 6th. This morning we were busy greasing our saddles & packing them in bags getting ready to leave. We heard to-day that we are to go to the Dardanelles & are to go into the firing line & the camp is in high spirits in anticipation of a scrap \nof\n with the Turks. The Regiment was paraded before the Dr. to-day to see who was medically unfit to go, several lads were put into the reinforcement on account of having bad feet. Am Cpl. of the feed party tonight.\n","49":"\n\nFri. 7th. Yesterday we packed our saddles etc. & this morning we placed them under the grand stand of the Aerodome. I packed all my spare clothing in the signalling pannier so we should fare well for clothing at the front. The Sqd. signallers were issued with bicycles to-day & we put the greater part of the afternoon in getting them in going order. After tea Penny & I came to Heliopolis & put our time in writing at the American Mission. There was boxing at the picture show last night, & again to-night, but I did not go to it.\n","50":"\n\nSat. 8th. I had a bad throat last night & bought a gargle from Fletcher & my throat is still very bad this morning. Arthur Welch came over soon after dinner then went to Town & returned about sunset & took some letters & photos to post for me as I believe that our letters are being censored when posted in Camp. Fell in to answer the roll call at 8 oclock & every man was issued with 150 rounds of ammunition per man. We were also issued with knapsacks during the afternoon. \n& the signallers with leg\n.\n","51":"\n\nSun. 9th. At 11.30 last night we fell in at the Camp & gave Col. Meredith three cheers as he is staying behind. The Col. gave a bit of a speech & said he was very sorry he was not going with us, but he knew we would do our job. We marched through Heliopolis with our Infantry pack on singing & shouting a treat. We boarded the train at Helmiah Station at 12.30 this morning & Berry who had scaled in was arrested & I was put on guard over him till the train was about to start & then had to put\n\n9.5.15\n\nhim off. I fell to sleep soon after the train started & did not wake till sunrise. We arrived at Alexandria about noon; had a dip alongside the wharf, then changed the few piastres I had into English money, bought a couple of cups of tea & cake from the Y.W.C.A. which is on the wharf, & very good & cheap & then we were marched on to the boat, after having our leggings taken away & given infantry pants & putties in place of them. The ship moved away from the wharf at 7 oclock & I have never seen a happier crew.\n","52":"\n\nMon. 10th. I have had a bad throat since last Fri. & it has now turned into a cold in the head & as we cannot get medicine on board, it is not improving. Last night Stan & I slept down a hatchway in the rear of the ship & when we awoke this morning, we were covered in coal-dust, had a lecture on how to dress wounds etc. before dinner & were also cleaning rifles this afternoon. We passed some small islands before sun-down. We were issued with cards to send home & retired to bed early.\n","53":"\n\nTue. 11th. Feeling a bit the worse for wear when I awoke this morning, a bad cold & a bad head, went a good way towards putting me in a bad humor, had a rifle parade on deck before breakfast but I was feeling sick & went to Corporal Gabriel & was told there was to be no sick parade to-day. I then went to the Surgery & tried to \"hum\" a dose of cough mixture from the A.M.C. men. When they heard we could get no sick parade one of them went to the Lieut. Col. who went icy on Gabriel & we had a sick parade at 11.15 a.m., in consequence. We have been passing small islands all\n\n11.5.15\n\nthe morning. The day turned rather cool & we had a few drops of rain before dinner, also passed a couple of warships, one I believe is the Majestic & the other only a dummy. At 4 oclock we came to a camp of Tommies who were banging away with Artillery. Warships were also firing on guns inland & their fire was directed by two aviators who dropped smoke bombs for the gunners to get the range. We waited here for an hour & then proceeded along to where the 3rd Bde. landed & anchored for the night. We were given two days rations of Bully & biscuits & went to sleep in our clothes with all our gear at hand as we expected to land during the night.\n","54":"\n\nWed. 12th. As soon as reveille sounded this morning we were ordered to get ready to leave, we could hear the roar of the big guns a few miles further back & the rifle & machine guns here all night; at 7 oclock we left A3 & stepped onto the torpedo boat & were soon making for the beach. Eric Dowling was hit in the mouth & had his front teeth knocked out, while on the launch coming ashore with a stray bullet. We put all the morning in sitting along the side of the hill that rises straight up from the beach & the same that the 3rd Bde. made their gallant charge on. We put the time in watching shrapnel bursting along the beach & it has been dropping rather close to be\n\n12.5.15\n\ncomfortable, several New Zealanders were wounded & a mule killed. The bullets have been whistling over us but they cannot touch us here. At one oclock we came along a valley in which a road has been made; in several places we had to double passing dangerous points & soon arrived handy to the firing line & made ourselves as comfortable as we could on the side of the hill: one of our boys was shot while going for water. Twenty odd men a day are sniped off here & the noise of the rifles, machine guns, shrapnel & hand grenades is deafening. We boiled our quart pots & had tea early & were soon dug into the hill & fell to sleep despite the noise of the firing. My cold is still bad & cannot get medicine.\n","55":"\n\nThurs. 13th. Had a very good nights rest & were up at 4 oclock ready to go into the trenches if required, we had to stand ready in case of emergency. It looks a grand sight this morning from here; the hills are covered with green bushes & the hill opposite us is so steep steps have had to be cut in it to allow the lads to go up & down. With the glasses we can see a few dead Turks among the bushes also one or two Australians. I believe there are dozens of our lads dead & they cannot be got at on account of the fire from the Turks. A few shrapnel shells burst over us this morning but they burst high & there was no damage done; but about 10.30 they started again & dropped several\n\n13.5.15\n\nright on top of the hill opposite killing one man & wounding several others. At 11 oclock we came on to take up positions in the trenches to relieve the 13th Btn. Penny, Smithers & I were placed in a dug out on the end of a field telephone & soon were quite comfortable & as safe as it is possible to be. Macdonald of the machine gun section was hit in the leg this morning by a bullet. After tea the Turks kicked up a hell of a row with machine guns & rifles, but did no damage. Smithers, Penny & I are taking 2 hour shifts on the phone during the night. Soon after nine oclock the Turks threw some rockets amongst us to see what we were up to & gave Penny who was on duty a bit of a shock.\n","56":"\n\nFri. 14th. The Turks kept up a heavy constant fire all night but none of our boys were injured; yesterday Varley of A Sqd. was wounded in the leg with a piece of shrapnel, & this morning Wylie Woods B. Sqd. was shot through the stomach by a piece of shrapnel & is not expected to live, some of the lads had marvellous escapes from shrapnel but there was no more casualties in the 1st Regt. The Queenslanders (2nd Regt.) are getting a much rougher time as their trench is only a few yards from the Turks & hand Grenades play a prominent part in their days work. At 12 o’clock (noon) A Sqd. signallers relieved us & we set to work to enlarge a \"dug-out\" & I have suspicions that\n\n14.5.15\n\nwe are in close proximity to a Royal Marine Light Infantry man. I found his rifle (loaded) also cartridges in a \"dug-out\" a few yards away, also his overcoat, stained with blood; he was apparently shot by a sniper from the hill opposite & I believe a man is lucky if he digs any ground here & does not strike a \"stiff-‘un\". This morning, when the sun was shining on the hill opposite, we could see scores of dead Turks on the opposite hill & one is hanging in a tree, he had tied himself to a limb for sniping purposes & was shot & still hangs there. I went into the valley for water this afternoon, & when I returned, shrapnel was chopping leaves off the bushes around us, needless to say I made a scramble for the dug-out.\n\n15.5.15\n\nSat. 15th. Last night the 2nd L.H. made a charge on the Turkish trench, but were mowed down by machine guns. Out of 100 that charged only 45 got back again. This morning I went for water & decided to look up Morgan Welch. I had a 3 or 4 mile walk but found him quite well. It is a rather dangerous job walking down the valley, as we have to pass places in sight of the Turks & 3 men of the 3rd L.H. were hit by a machine gun, just before I passed. B Sqd. signallers went on duty on the telephone at midday. Lance Cpl. Crisp of B Sqd. succeeded in bringing one of the wounded lads into the trench & has been recommended for the D.C.M. About 4 oclock a sniper succeeded in wounding Sergeant Lovett through the leg\n","57":"\n\nas he was walking along the path. Negus was following with his rifle on his shoulder, the rifle was splintered & Negus only grazed. Lieut. Nickoll received a bullet through his cap & the bullet grazed his head; a good many of the lads have been scratched but not bad enough to put them out of action. Cameron was scratched down the shin by a piece of shrapnel. The sniper that got Lovett slightly wounded 5 men in a few minutes but they found out where he was hidden & poured in a pretty warm fire where he was, & we have heard nothing of him since. I still have a rather bad cold & can get no medicine for it. Wylie Woods died this morning.\n","58":"\n\nSun. 16th. Last night the boys in the trenches thought the Turks were charging once or twice, but nothing happened. The noise of the guns affect us not a scrap & we (signallers) did not wake till sunrise. We are all supposed to stand to arms at 4 a.m. every morning, but we have escaped it so far. Paddy Moy of B Troop was shot dead this morning, he was shot through the left eye, he was a fine fellow & very popular, he received a D.C.M. in the South African War. The 1st L.H. are holding the extreme left of the trenches, & are consequently farthest inland; we are about 4 miles from the beach. It was reported yesterday that six German Submarines succeeded in getting into the Meditteranean Sea. We have a grand view from here looking\n\n16.5.15\n\ndown the valley with a steep hill on either side covered with green scrub & looking down the valley we can see the sea, with warboats & torpedo boats everywhere & at the back of them we can see islands belonging to Greece. We get our water supply from shallow wells dug in the bottom of the valley & as we can get only enough for drinking purposes we have to put up with a drovers wash once a day & a good many don’t even get that. We went on duty at 12 oclock & were no sooner settled than shrapnel fell on our trenches here, three shells burst over us & we were covered with leaves & boughs from the bush overhead. Langford was hit through the neck & wounded pretty bad & Chivers had his face cut, both have gone to hospital. A sniper killed an Engineer officer at 4 oclock, Gen. Bridges was hit in the hip a day or so ago & is pretty bad on it.\n","59":"\n\nMon. 17th. I heard last night on the telephone that Italy had joined the Allies. Last night was the quietest we have had & the firing was not near as heavy as usual. This morning the Turks got to work early with artillery onto the beach, & spent a good deal of ammunition before our guns silenced them. Yesterday afternoon our Artillery blew up some trenches on Quinns Hill but the Turks were busy during the night & had the trenches reformed this morning, but our artillery made a mess of them again. This hill we are holding is named Pope’s Hill, & Fishermans Hut is the place we landed at. Our Artillery have been very busy all day & the Turks have been having a very rough time of it. Their trenches have been getting\n\n17.5.15\n\nit hot, practically no rifle firing has gone on at all to-day, & the Turks appear to be lying low. The Euryalus & Triumph have been firing on guns inland & at 3.30 large shells began to fall around the Euryalus & she had to back farther away from the shore to get out of danger, perhaps \"The Goeben\" was the cause of the big shells as she should be across the Peninsular (12 miles away). Half an hour later, one of our battleships farther on opened fire & was going constant for the remainder of the afternoon. Penny, Smithers, & I came off duty at 12 oclock & had a sort of a bath in a couple of quarts of water & also washed our socks in it. Had a chance to drop a p.c. home to-day. The sun sets here at 7.30 & rises about 5 oclock.\n","60":"\n\nTue. 18th. The valley has been shelled several times to-day with large \"Lyddite\" shells, but I believe only two lads was killed by them & one of the barricades blown down. The Goeben gets the credit of it, as we hear no shooting & have no idea they are coming till they explode. They have the range neat & the shell makes the earth fly when they lob. To-day has been the quietest we have had, & we go for minutes at a time without hearing a rifle shot, although the Artillery was fairly brisk all the morning. Lieut. Edmunds was wounded this morning, also Stan Crichton by shrapnel. 30 odd 8.2 ins. shells have fallen since morning from a fort inland, we can see the shells coming through the air like a bird before they explode. The fort has been located & the warships commenced to bombard them at 6 o’clock, damage done not known.\n","61":"\n\nWed. 19th. At 4 oclock this morning the Turks charged our trenches. The attack was expected & only one Turk reached our trench & was bayoneted. This morning dead Turks are to be seen lying in every conceivable position. Their losses were enormous. Chambers, Moffat, Whittle, Aldridge, McArthur, Fisher, & Hunt were killed in C Sq. Lieut. Nickoll was seriously wounded & will lose an arm if he lives. Cpl. Milligan Pett (N-mine) was wounded in the mouth, I believe he has half his tongue shot away. Todhunter \"B Troop\", Selff & a few others were wounded, but only slightly. The fighting was terrific for an hour, soon after 5 o’clock the Turkish Artillery got busy & gave us a very interesting time; apparently they are not short of ammunition this morning, but the New Zealand trenches on the opposite hill to us seems to occupy their attention mostly. C Sq. bore the brunt of last nights\n\n19.5.15\n\nattack, & suffered most. Mansell was also found outside our trenches dead. At 1 oclock we were relieved from the trenches by the 3rd L. Horse & were soon on our way for a spell. A few \"Jack Johnsons\" fell in the valley this morning & we passed about 20 lads who were killed during the night & this morning. They are stacked in a dug out till night & then carted down nearly to the beach & buried. We had a stiff climb up a hill & found we were on the wrong one & just settled down on the next when we received the order to stand to arms & were hurried up the hill opposite & put in the trenches to support the 2nd L.H., very heavy fighting all day. The Turks made a couple of half-hearted attacks on the trenches, but we mowed down every time & our casualties were practically nil. We had to sleep in the trenches all night.\n","62":"\n\nThurs. 20th. Left the 2nd L.H. trenches early this morning & made a very comfortable dug-out on the eastern hill which took up all the morning. I believe the New Zealanders captured a line of Turkish trenches yesterday afternoon; shortly after dinner Smithers, I & some others went to the beach & had a very enjoyable dip in the sea. A little before sundown, we were having tea & hearing cheering & as all firing had ceased, we looked out to see the cause, & found the Turkish trenches lined with unarmed men & white flags flying. Apparently a parley is going on between our officers & theirs, & the Turks are busy getting their dead & wounded away, also rifles; I believe they asked for 3 hours Armistace to collect their dead & wounded, we conceded ½ an hour & as soon as the half hour was up they rushed Quinns Post & got a very warm reception. Hailstone (B Troop) wounded.\n\n21.5.15\n\nFriday 21st. Last night soon after our firing commenced we were ordered to fall in, in the valley, & had to \"double\" into the 2nd L. Horse trenches, very heavy firing was going on all the time. I believe the Turks suffered heavily in their charge on Quinn’s Post & the Artillery was very constant all night, the fire from the guns lighting up the valley. We are supposed to be spelling but go in the trenches as supports to the 2nd L. Horses every night, a 5 inch Howitzer from the N.Z. quarters was doing good work. As we were coming back to our \"dug-outs\" this morning Arston was wounded by a sniper, also one or two others but not \nby\n of our Sqd. Lidster (C Sq.) & Wise (B Sq.) were both shot dead coming down the valley last \nnight\n evening by a sniper. Today the Artillery have been shelling the Turkish trenches to the west of Popes Hill. The\n","63":"\n\nTurks have been very silent with their artillery & only an occasional shot fired from them. The Turks have been sniping down the valley all day & succeeded in wounding several. Jack Johnson apparently has been silenced as we have not been molested by him lately, it is rumored that he was located behind the Turks hospital & we gave the Turks 4 hours to get their wounded away, probably the warships blew him up. D Troop are in the trenches as supports to-night & the remainder of us are sleeping in our \"dug-outs\". Stan & I have \nstill\n bad colds still, but are gradually getting rid of them.\n","64":"\n\nSat. 22nd. I believe the Turkish Field Marshall was at the beach yesterday having a consultation with Sir Ian Hamilton. Rain commenced to fall soon after sunrise this morning. We tied two waterproof sheets over our dug-out & managed to keep dry: a lovely afternoon although clouds are still hanging about. Sergeant Paul was sniped to-day while in his dug-out, it is said he is dying & was shot through the head; practically no fighting to-day although the Turks have been busy all the afternoon with shrapnel on the beach. We are getting very good food here & plenty of it, quite a change from Heliopolis. To-day is the first that our aeroplace has not been seen or heard by us since we arrived here. The weather here has been perfect & we are having a good holiday with just enough danger to make it interesting.\n","65":"\n\nSun. 23rd. Some Japanese arrived here a few days ago with bombs equal to a 6 inch shell, also a gun capable of firing them 450 yds. & they have been giving the Turks particular fits with them. No fighting to-day, only a few shells & an occasional bomb & a few rifle & machine gun shots to remind us there is a war on. A mail arrived to-day & I volunteered with others to go down to the beach to get it, & it was hard work lumping it up. Were issued with fresh beef to-day. While I was cooking the breakfast this morning a spent bullet fell into the Quart Pot & I received a hot shower in consequence; had a shave & a wet towel bath this afternoon.\n","66":"\n\nMon. 24th. This morning we were hauled out at 3.30 this morning to stand to arms. The Japanese bombs were speaking fairly constant when we retired last night. An Armistace has been arranged for to-day from 8 o’clock till 4.30 to allow the Turks to get their dead away. The Australians have to take all the dead bodies half way where they are taken over by the Turks, so as the Turks can be kept away from our trenches. Rain commenced at 7.30 but we are quite dry here with a couple of water-proofs sheets over our dug-out. After dinner Stan & I went to the 4 Btn. to see Morgan Welch & Bolden. Morgan was wounded through the shoulder on the 19th. The Australians & Turks have been changing coins, cigarettes & biscuits this afternoon & been having friendly yarns while shifting the dead Turks. We saw Bolden & had a long talk with him.\n","67":"\n\nTue. 25th. A few bombs & a little rifle fire was all that was doing after the Armistace ceased yesterday, bullets have been dropping too close to be comfortable this morning, while having breakfast one spoilt Matheson’s water tin only a yard or two from us, & another landed at the door of our dug-out. A Warboat has been dropping shells on the Turkish trenches on Popes Hill this morning, the shooting is marvellous. About dinner time to-day the Triumph \nstruck\n was hit by a German Submarine & sunk here close into the shore. It was rumored a week ago that the Goliath had shared the same fate. Had one or two rather heavy showers of rain soon after dinner but the sun shone out brightly at 4 o’clock & our Artillery spoke up soon after. It is rumored that the submarine was sunk but we hear nothing official. Stan put the afternoon in with Pittenbreigh & hummed 3 envelopes off him.\n","68":"\n\nWed. 26th. Snipers have been paying us marked attention all day; early this morning I was hanging our blankets out on the bushes to air when a bullet hit the ground alongside of me & knocked some dirt in my eye, it was close enough to make me take cover, about dinner time another one came our way & went through one of the blankets & Stan’s overcoat. 10 men were tipped over by snipers soon after daylight, poor old Pope being shot dead. McMaster who was also hit has only a sporting chance of surviving his wound which went through his liver. The warships have kept up a continual bombardment all day otherwise things have been very quiet only for Turkish snipers & they have accounted for a good many of our boys to-day. The weather is perfect. We have to stand to arms in the valley every morning at 3.30 a.m. but do nothing else; of course the men have to do sapping but the signallers are exempt.\n","69":"\n\nThurs. 27th. The Warboats have been rumbling like thunder all day. Things are quiet here generally but we had to stand to arms at 8.30 this morning as a dozen or so Japanese bombs were hoisted into the Turkish trenches & it was thought that they may get desperate & charge us, but they did not, although the bombs played havoc with their trenches. Our aeroplane was only one day off duty & she is as busy as usual again hovering over us. Snipers have given us a fairly safe time to-day, \"a bit of a change from yesterday\". It is rumored here that the Majestic has also been sunk, but rumors are afloat of peace & several other things & are generally taken with a grain of salt. The only reliable news we get of the war is what happens in & around this valley (known as Shrapnel Valley & it has earned its name).\n","70":"\n\nFri. 28th. At 12.30 a.m. we were called out of our dug-outs & had to stand to arms in the bottom of the valley as an attack was expected; nothing happened out of the ordinary & we were dismissed at 4.30 & told to fall in again at 7.30 to go sapping. The sapping order was cancelled & we slept till dinner-time; after dinner a party of us went to the beach for a swim & it was lovely. Snipers have been exceptionally busy to-day & 5 lads were wounded trying to pick up a tin of biscuits, the task was then abandoned & we were told that we would have to wait till dark before we could draw our rations, but the tucker was rescued soon after dinner otherwise we would have done a starve; bullets have been falling very handy to our \"dug-out\" all day too. The beach is well patronised every day with men \"off duty\" swimming. I pinched both pockets full of onions at beach to-day & we had steak & onions for tea.\n","71":"\n\nSat. 29th. Last night after tea I asked the Dr. for some opening med. & I got it in the shape of 6 pills about 10 o’clock. I thought I was going to die with cramps in the stomach & vomiting. I nearly cut Stan out of chlorydine to restore order inside. At 3 o’clock this morning the Turks succeeded in blowing up the trench our sappers have been working in. They had undermined it & as soon as they fired the mines, they rushed the trench. The sappers that had not been blown out of the trench lost no time in getting away as they were armed only with picks & shovels & the Turks had possession of 100 yds. or so of our trenches. Our machine guns were set to stop any Turks from returning\n\n29.5.15\n\nto their original trenches, & the sappers were armed with bombs. Our boys then had an easy task as they dropped bombs every yard or so along the trench amongst the Turks. The Turks that tried to retire were mowed down by our machine guns & the rest killed with bombs. We lost a good many men when the trench was blown up but nothing in comparison to the Turks. About 20 Turks came over & surrendered this morning, we get an odd prisoner or two every few days. 3 C Sqd. men were wounded this morning, we had 10 men amongst the sapping party. A Sqd. had 3 men killed. When we got out of bed this morning Stan noticed a hole at our feet, we investigated & found five or six inches deep the timing portion of\n\n29.5.15\n\na shrapnel shell. It fell within a few inches of Les Smithers leg during the night & right inside our dug-out. A sniper winged Caban (H.Q. Sig.) early this morning while he was going for water. They have been giving us a warm time also, & this afternoon a bullet went through Les’ belt breaking a pouch & a clip of cartridges, it also broke one of the flag poles. At 4 o’clock we received the order to stand to arms ready to move off at a moments notice, although heavy firing was kept up all the afternoon, we were not called out & received the order to stand easy about sundown. This afternoon two bags containing parts of Turks, also 30 odd whole Turks were buried by our men, the results of bombs.\n","72":"\n\nSun. 30th. My cold rather bad last night so I did not get out at 3.30 & slept till dinner time. Soon after dinner we had the order to pack our gear ready to move off. At 1 o’clock our boys from \nPopes Hill\n Quinns Post charged the Turks & captured a machine gun, a two lines of trenches, there is some doubts as to whether they will be able to hold them or not. We received orders to attach ourselves to B Troop till further orders & were then put in the trenches on the right side of Popes Hill & told that the Turks had been heavily reinforced & an attack was expected before the moon rose (about midnight). Two of our aeroplanes have been scouting all day & it was a fine sight watching them as the Turks were trying to bring them down with shrapnel but with no success.\n","73":"\n\nMon. 31st. The warships were booming all night further back, but the attack we expected did not come off & things were very quiet here all night. A few bombs were exchanged between our boys & the Turks on Quinns Post during the night but that was about all. I had no sleep last night but managed to get 3 hours this morning in the trench. At 3.30 p.m. one of our aeroplanes flew over us & the Turks must have fired 20 shrapnel shells at her but they all failed to hit her. Yesterday both flanks advanced, New Zealanders on our left & Aust. on the right & have managed to hold the ground they took. Our torpedo boat destroyers appear pretty busy this afternoon, probably scouting for submarines. We were relieved from the trenches soon after 4 oclock & were soon after into dug-outs close by on the side of the hill.\n","74":"\n\nTue. 1st. Had an excellent nights sleep last night & lay about in our dug-out till dinner time. \"Jock\" Davidson (Quartermaster Sergeant) was going down the gully this morning & was wounded through the head \nwith\n by a sniper. There has been complaints at different times of our shrapnel shells bursting short & occasionally getting our own men. 11 of our men were supposed to have been killed by our own guns on the morning of the 29th & a sergeant of the artillery was caught red handed altering the fuses of some of the shells; he was courtmartialled found guilty of being a German syp, four volunteers were called for to shoot him, every man in the battery volunteered & he\n\n1.6.15\n\nwas shot on Sunday morning. Last night a good many New Zealanders came & camped at the bottom of Popes Hill. At dinner time to-day Major Granville told Sergeant Mack to call for two volunteers to go up the valley between the Turk trenches & our own. Fletcher & I volunteered, we are to go after dark & do not know yet what we are to go for. We went into the trenches at 4 o’clock to relieve the men now in 24 hours in the trenches & 24 out is the daily \"menu\" here. Soon after going in Maj. Granville & Lieut. Kater came along & gave instructions of what we had to do after dark in Dead Mans Gully, we have to explore it &\n\n1.6.15\n\nsee if we can find any snipers or hear any digging going on as it is thought probable that the Turks are putting a drive in to blow Popes hill up. Our Engineers are putting a drive in from Popes Hill to blow the Turks up, so it is a case of who gets through first wins. At 8.30 Fletcher & I were ready to start off armed only with pistols when we received the order not to go out as the Engineers on Quinns Post were attempting to to blow up a part of the Turkish trench at 9.30. We put in half an hour on Quinns Post about sundown as we could get a good view of the gully we had to explore & as far as I can see there is very little danger in the undertaking unless a man gets careless.\n","75":"\n\nWed. 2nd. I believe the blowing up at Quinns Post was quite a success last night & things were fairly lively for a while. At 9.30 a.m. the 3rd L.H. came in to take our place & we were moved further up Popes Hill. One of the 3rd L.H. officers was shot dead (hit through the eye) while taking over the position. Last night just before dark a New Zealand \ner\n Engineer, who has done good work here & received a D.C.M. a couple of days ago, was sitting by our trenches smoking when one of the Japanese bombs was fired on Quinns Post & a piece of the shell came across cutting the Engineers throat & he bled to death in a few moments. When C Sqd. had got settled at their new\n\n2.6.15\n\nposts, Penny, Smithers & I came down the hill & made a dug-out between Marsh & Howarths. A Sqd. is on duty to-day on the telephone, B Sqd. tomorrow, & C the day after. We were going for water this afternoon & at the danger point in Shrapnel Valley a bullet fell between Calthorpes feet covering him in dust. We had to go nearly to the beach before we could get water & as we had a large biscuit tin full to bring back, we found it fairly solid work carting it up Pope’s Hill. I received a fine newsy letter from Edie Tomlins this morning. Everything is very quiet to-day so far as fighting is concerned.\n","76":"\n\nThurs. 3rd. Had a good nights rest last night & did not get up till after sunrise; at 11.30 a.m. Howarth was told to report to the H.Q. signallers for duty so we had to relieve Marsh & Co. at midday. At 3 o’clock one of our warboats opened a heavy fire on a village some distance to the N.W. of us. Turkish troops were mobolising at the back of the village & our aeroplanes discovered them & the warboat gave them hell for an hour or two. A few Jap bombs were fired this afternoon, things were quiet otherwise. About 15 of our lads were sniped this morning in the valley. We have had 209 casualties in the 1st L.H.R. since we arrived not counting to-day. There were 442 men & 25 officers in the Regt. when we arrived.\n","77":"\n\nFri. 4th. This morning our warboats opened fire to the South of us & have kept up the heaviest cannonading all day that I have ever heard, there are several rumors afloat, the most popular being that the Turks are making a charge on the English & French troops, but they must be getting a lively time at all events. A naval officer made a wager with Cobcroft (A Sq.) laying £125 to £5 to say there will be no fighting in Turkey after Sunday next. I hope it is right & that we are sent across to France straight away to see the finish there. A Sq. Signallers relieved us at dinner time & we have put the evening in sunbathing. Some rifle shots by snipers has been the full extent of the fighting here to-day.\n\n5.6.15\n\nSat. 5th. Last night Quinns Post charged the Turkish trenches, they did not stop at the first line of trenches but jumping over them captured the 2nd & 3rd line, they were unable to hold them however, as the Turks made it too hot with bombs; about 60 Turks were taken prisoners out of the 1st line of trenches, a Turkish machine gun \ns\n was in a position to enfilade this trench & gave our boys a warm time of it. The bombs from the Turks also made Quinns Hill uncomfortable, we had no bombs to throw back so the fight was a bit onesided & lasted all this morning; our casualties were 1 officer & 4 men killed, & 5 officers & 70 men wounded, & the positions now are just the same as before the attack commenced. The cause of\n","78":"\n\nthe heavy firing from the war-boats yesterday was that the French & English troops made an attack & advanced 400 yds. The Turks lost heavily. Matheson had the top of his head damaged this morning by a bullet. I do not think the wound is serious. We went on duty at 12 oclock to-day, a fairly quiet afternoon. We have been been running foul of the Acting Quartermaster since \"Jock\" was shot (Cpl. Moylan) as he has been cutting our rations short. When the attack was made last night we stood to arms for awhile but as we could see that we were not likely to be wanted, we returned to our dug-outs & slept the sleep of the just. I believe the Warspite was taking a hand in the bombardment yesterday.\n","79":"\n\nSun. 6th. An order came out late last night that there was to be religious services this morning, but as we were on duty until dinner-time we did not attend. Everything the same to-day as usual & no armistace. It is rumored that 18,000 Turks have been cut off by the English & French & will either have to surrender or be annihilated. About sundown a few Jap bombs were fired into the Turks trenches. Complained to the Dr. this afternoon about my cold & received some pills for it. Flies are getting very bad here. All precautions are being taken against diseases & colds are the only sickness to be found.\n","80":"\n\nMon. 7th. The latest rumor is that a peace conference is being held in Constantinople at present. A sheet of paper is printed here daily & pasted up on the beach for the benefit of the troops, the news it contains is practically about what we are doing & can see; there is practically no news of the fighting in France, & as we are about 3 miles from the beach & my cold is too bad to go in swimming at present, & have no opportunity to read the \"Peninsular Press\". Received more pills this morning from the Dr. & they seem to be doing my cold good. On duty at 12 oclock. Mylie Edwards is brick to keep the papers up to me as he does every mail.\n","81":"\n\nTue. 8th. Last night another charge was made from Quinns Post. I believe 27 of our men were wounded, 9 killed. An alarm was given about midnight that \nthat\n the Turks were advancing on our left, but it proved a false alarm, heavy firing was maintained all night & Johnny Hailstone was shot dead, having the top of his head blown away; he belonged to B Troop & like Paddy Moloy was a reinforcement. ‘Tis strange but it appears that the best men among us are the ones that get killed. I cannot find out any particulars concerning the attack last night \nbut\n so I suppose it was a failure. Came off duty at 12 & argued about farming, politics etc. with Penny & Howarth until it was time to turn in at dusk (8 oclock).\n","82":"\n\nWed. 9th. At 9 oclock this morning the 3rd L.H. Regt. relieved us from the trenches, & we came into the gully directly under Popes Hill. We Signallers got in early & secured a first rate dug-out, but found we were in B Sq. boundaries & put in a good deal of argument to keep it but finally succeeded. We have been living very well since we arrived here & this afternoon we were issued with prunes, figs, bacon, steak, onions, cheese & biscuits; so that is not bad for active service, & loaf of bread would be very acceptable now as we have had none since leaving Heliopolis. This afternoon Les Smithers was told by Adams (Acting S. Major) that we were to go on sapping\n\n9.6.15\n\ntomorrow, sapping in rather hard work, so I went to Sergeant Nelson & arranged that we are to go on despatch carrying, & then pratted my frame up to Adams & told him we could not go sapping as we had to do despatch carrying; so we shall probably get tomorrow off doing nothing but I do not know how long it will last. Cool drinks etc. can be bought on the beach, there is also a supply ship a little distance from the shore, but I believe they have sold out of writing paper, envelopes & ink; so we are as bad off as ever.\n","83":"\n\nThurs. 10th. We did not fall in \"to arms\" this morning as we were too sleepy. C Sqd. has been supplying sapping parties all day, we Sig’s slept all the morning & went for a swim after dinner. The water was quite chilly & the beach looked more like Manly during a summer holiday than in Turkey at the front. The beach is packed with rations, ammunitions etc., scores of small wharves have also been erected all along the beach for unloading goods & water, & it is off these we swim. We received quite a shock to-night when we were drawing rations, to find we drew half a loaf per man (of bread) & it is quite a luxury after being on \"dog\" biscuits so long. I gave my towel a rinse in the sea to-day.\n","84":"\n\nFri. 11st. Were standing to arms at 3 o’clock this morning. At 2 oclock the rifles & machine guns were rattling away for half an hour or so; as if something was doing. Fighting has been very tame during the last few days & we have been faring very well, so far as casualties are concerned. The warboats were hammering away to the south very constant for a short time this afternoon. We have done absolutely nothing but draw our rations to-day & are having a real picnic. B Sqd. sig’s do Quarter Masters fatigue, & A Sqd. Sig’s have been despatch carrying to-day, but we have managed to miss work up to date. My cold is fairly well again. I believe our horses are dying wholesale at Heliopolis (infantry will do me).\n","85":"\n\nSat. 12th. Received a bonza mail to-day from Aus. & England, also plenty of papers. A Sqd. sig’s were on duty despatch carrying from 1 to 5 a.m. this morning & Maj. Lorrie (A Sq.) complained to the Adj. about his sig’s doing Head Quarters work; the Adjutant went to Nelson & they had a proper argument, but it ended in us severing connection with H.Q. so I had to report to the S.M. that we are no longer on H.Q. so I suppose we shall be on a sapping party tomorrow, a few hours on the \"banjo\" will do us no harm, as we are getting quite fat & flobby. Everything very quiet to-day & one would hardly think a war was going on. The flies are very bad here & we have a very poor chance of sleeping during the day on account of them.\n","86":"\n\nSun. 13th. Church Service was held this morning here in the gully. Stan & I were too busy writing to attend. The warships have been firing pretty constant all day. About dinner time a Turkish gun picked up the range of the New Zealand observation post on the hill right over us & dropped \"lydite\" shells onto it, & the trenches in the vicinity with monotonous regularity, throwing sand bags & earth in all directions. We are within 200 yds. of where the shells were dropping & got a fine view of the proceedings from our dug-out & we were quite close enough for observation purposes. I generally have to fight our acting Q.M. Sergeant when drawing rations before getting our full allowance & I am that used to it now I feel disappointed when I cannot find something to raise an argument on.\n","87":"\n\nMon. 14th. While we were having tea last night, our aeroplane flew over us quite low & the Turkish machine guns were rattling away in fine style firing at her, they also fired artillery at her & the shells were bursting uncomfortably close. The aeroplane did not seem to mind, & flying straight over us dropped three bombs, two in the Turks trenches & the third apparently on a gun, as she dropped it some distance behind the trenches. It was a fine sight & we gave her a cheer as she dropped each bomb. It is stated that the Turks were bringing up 30,000 reinforcements yesterday & the warboats with an aeroplane directing the fire killed 5,000 of them. Last night a party from\n\n14.6.15\n\nC Sqd. had to rebuild the trenches the Turks gun blew up yesterday. I believe the 8th L.H. were occupying the trenches which suffered. We had to swing the \"banjo\" this morning making a road with a party of C Sqd. men from 9 a.m. till 12, it is the first work of this sort we have done & proved to be good exercise. By rules & regulations the sig’s should do no work but rules & regulations are up to putty here & everyone has to do his whack & it is only right that we should. We had decided to go for a swim this afternoon but Penny went to sleep & I made myself comfortable sunbathing (reading the Worlds News) so Smithers was the only one that could raise sufficient energy to go. The warboats have been firing constantly all the morning. It is\n\n14.6.15\n\nreported 16,000 reinforcements (mostly Australians) landed to day a couple of mile south of us. I suppose that accounts for the warships fire. About sundown to-day we witnessed the most interesting fight I have seen. One of our torpedo-boats (a cheeky little beggar) came in close to shore & opened fire at something on land; big shells immediately began to fall all around her, the Torpedo boat would stay still for a few seconds & then go full steam ahead for a few hundred yards then she would zig-zag, then stop then back away, then full speed ahead again, firing all the time & the Turks shells would follow her up falling \nwere\n where she had been a second or so before; & although the splash from the shells often fell on the boat none of the shells hit; one of the Turks shells would have been quite sufficient to sink her, warned to go on sapping at midnight.\n","88":"\n\nTues. 15th. Last night we slept with B Troop at the bottom of the valley & was called out at 11.45 p.m. I was in charge of the sapping party had had to report at the Supply Depot at 12 oclock. The party consisted of 10 men besides myself & were were set to work making a road around one of the barricades. As I was in charge I sat back & watched the others work. We were on from 12 to 4 a.m., shortly after 2 oclock a fussy New Zealand Sergeant came along, who appeared to think he was the General, at the time the lads were having \"a blow\" & the Sergeant said, I see you only have one man on this shift, before I could answer Gordon Cooper (a 14 stoner) was telling the Sergeant off in fine Australian style. The Sergeant said not a word but\n\n15.6.15\n\nshortly afterwards slunk away & we saw no more of him; I was more than half inclined to ask him who was in charge of the party some time before this over a remark he passed about the men, but as I knew he was an engineer supervising the work I refrained. The Australians work like Trojans if left alone but they will not standing being driven & \"bullying\" they will not stand at all. The warboats were busy again to-day. Stan & Les had to go on sapping at 12 oclock midday & I have been warned to go on at 4 oclock this afternoon. We had breakfast as soon as we came off sapping this morning & then stripped off & slept till dinner dinner time. It was the first sleep I have had with my boots off since we arrived in Turkey.\n","89":"\n\nWed. 16th. I was in charge of another party of 10 men from 4 till 8 last night. We were on the same job at the Supply Depot & the officious Sergeant was quite the reverse & affable, apparently the telling off he got from Cooper the night before brought him to his senses. Penny went to the beach for a swim this afternoon but the Turks were dropping shrapnel on the beach all the afternoon & he had to return without it. Yesterday afternoon we were issued with new socks, flannels & pants & we put in this morning cutting off the surplus material on the bottom of our trousers. At 12 oclock to-day we had to go on sapping on the New Zealand trenches. Lieut. McMillan was in charge; while we were on it, an artillery duel was fought lasting half an hour. Our warboats have been very busy all the afternoon, more troops landing.\n","90":"\n\nThurs. 17th. Penny, Smithers & I were on a sapping party from 8 till 12 this morning at Popes Post. We had a very easy time of it & as I was in charge I had nothing to do at all. Last night it came out in orders that volunteers were called for, for men to go as officers for Kitcheners army, anyone picked to go would have to sign on for 5 years. I have been thinking of putting in for it, but came to the conclusion not too, as they only get 7\/6 or 10\/6 per day & 5 years is too long at this game. I will be satisfied to turn the game in as soon as this war finishes. After dinner to-day we went to the beach & enjoyed a lovely swim & gave our flannels & socks a rough wash in the sea. This afternoon \"Sandy\" Cameron was cross-questioned by an officer on Quinns Post who thought he may have been a German spy. The best joke we have had up to date.\n","91":"\n\nFriday 18th. While we were having breakfast this morning shrapnel began to fall too handy to be comfortable, two of our men & several Queenslanders being hit. At 8 oclock I had to take a sapping party to the Supply Depot, we were working till 10 o’clock & then a Jack Johnson fell within a yard of a heap of boxes packed 10 ft. high. It made a very large hole & a few of the boxes fell off the top & cheeses were rolling in all directions, we were covered in dirt from it, but no one hurt. A few minutes later another fell a few yards further away from us & the Engineering Officer told us to get away till the shelling ceased, we got away alright & did not go near them again so we got off with only two hours work to-day. No jam again to-day we have only had one tin of jam between the 3 of us during the last 5 days. Warships busy at times to-day.\n","92":"\n\nSat. 19th. We were sapping at the Supply Depot from 8 to 12 this morning, I did not feel in a working humor & sat down & supervised the work, the officers down there should be nigger driving, they are N.Z. Engineers & both officers & Sergeants are the most officious men I have ever met. Australians are not allowed to work there during the night as they have been making the pace a welter amongst the supplies & only N. Zealanders work on the job during the night, one lad belonging to the 8th Btn. was sniped while working there this morning, he was shot through the leg above the knee by an explosive bullet & will probably lose his leg. We received a tin of jam with our rations to-day, quite a luxury after being so long without any. After dinner Penny & I\n\n19.6.15\n\nwent for a swim & it was lovely & well worth the walk to the beach. On our arrival back we were warned to fall in at 8 oclock to go on outpost duty under the Turkish trenches. Our aeroplane was busy again this afternoon & dropped 3 bombs on the Turks position. Artillery & machine guns were firing at her, but she seemed to treat them with contempt. I am satisfied it is a lucky shot that happens to bring one down. A popular rumor is afloat that the First Light Horse Brigade is leaving here for \"somewhere\" (probably England & then France) on the 27th of this month, we are all hoping it is true as a little more touring would be very acceptable; a shell burst on the point of the hill here this afternoon wounding two men.\n","93":"\n\nSun. 20th. Fell in at 8 o’clock last night & were marched up the hill under the New Zealand trenches & between them & the Turks, we are quite close to the Turks & could hear a gramophone going & the Turks having a smoke concert or something of the sort. Lieut. McMillan was in charge of the party (15 of us all told) Sergeant Loveless was the non-com in charge till midnight & I was on duty from midnight till 4 o’clock this morning. At 4 a.m. I was put in charge of a party of four (Penny, Smithers, Stanford & Hayes & are to remain on duty till 8 oclock to-night. One has to keep watch (2 hours shifts) & the others are allowed to sleep in the trench, we are not to fire on any account & only here for observation purposes. At 8 oclock a couple of\n\n20.6.15\n\nbillycans of tea was brought up to us, the same at dinner time. Sometime during the night one of our warboats & a battery on land had a go in, the flashes from the guns lit up the valley & hills here despite the fact that they are some miles to the South of us. It was a fine sight to see with the search light of the warship playing on the land & the flashes from the guns every second or so. Gibbs brought his camera with him & gave all his films to a Tar off the Triumph to finish off for him, but the Triumph went down filmns & all, so he is worse off than ever. Everything is still very quiet here & only an occasional rifle shot & a few shells remind us a war is on. Peak went to Heliopolis to-day, he has gone deaf I believe.\n","94":"\n\nMon. 21st. Nearly 9 oclock this morning before we raised enough energy to get up & get breakfast ready, soon after we rose the Turks artillery commenced to drop shells on the point of Popes Hill, they had the range to a nicety & dropped the shells right on the trenches, they fired about 20 shots before our 6 inch Howitzer opened up & silenced her after firing 5 or 6 shots. Stan & Smithers had to go on a sapping party at one o’clock, we received a large mail to-day from Aus. & England. I was agreeably surprised to get a letter from Lilian Tomlins. The warboats have been firing continuously all the afternoon, about 3 o’clock several Turkish shells fell right amongst the 3rd L.H. dug-outs on the hill opposite us, none of the shells exploded before landing & no one was hurt by them.\n","95":"\n\nTue. 22nd. The shells that were falling amongst the 3rd L.H. yesterday proved to be 9 inch shells, it is marvellous that no one was hurt. I believe the English & French have taken a large part of Achi-Babi Hill, heavy fighting was maintained down there during the whole of last night, & the artillery has been very constant this morning. The Turks have been dropping shells onto Popes Hill (just above us) again this morning. I was on a sapping party from 4 till 8 this morning putting through a small tunnel. Stan & Smithers were on from midday till 4 p.m. The aeroplane came along observing at dinner time & had the usual shrapnel fired at her but none of them went near her. Matheson sent along a box of paper & envelopes for B troop, but we did not receive any as we have nothing to do with any troop now but draw rations etc. with\n\n22.6.15\n\nHead Quarters. Major Granville went to the Canteen on the beach & bought some pickles, sauce, milk & oatmeal. As there was not enough for all of us we had to \"sell a horse\" to see who would get them, the signallers luck was out & we got nothing at all but Les Smithers was the only man in the Sqd. who possessed a plug of tobacco & he gave it to Sergeant Mack for a quart of oatmeal, so we had porridge for breakfast this morning. It was our turn to go without jam again to-day, but I managed to beat Moylan for it, for a wonder so we are living well at present. The Turks have been dropping shells on the hill opposite very constantly all the afternoon. Butter & Bourke have been told of to practice bomb throwing.\n","96":"\n\nWed. 23rd. We went into the trenches again this morning (at least the Regt. did) & we signallers took over the signalling box from the 2nd L.H. who were on, after building up on one side of it with sandbags to make it safe from shrapnel fire. The Turks have been dropping shells on the beach & I believe they succeeded in hitting some of our lads. The last couple of nights we have had \"bush concerts\", only a few of us. (It reminded me of the good old times at \"Brooklyn\".) I have had a very busy afternoon & it ended up by me taking 5 periscopes (broken) & 3 broken Periscopic Rifles to the Supply Depot & getting \ngetting\n new ones in place of them & by the time I got back here on Popes Hill, I was convinced that I had a heavy load. A couple of shells burst in the gully rather handy to where I was but no one was hit. There is a bomb thrower within 5 yds. of this telephone box.\n","97":"\n\nThurs. 24th. About dark last night the Turks opened fire with high explosive shrapnel shells, & there was no fault with the range, they fired quite a number of shells & wounded 16 New Zealanders between here & the Supply Depot. The Turks opposite us have been busy the last night or two reconstructing their trenches & the bomb thrower here has been firing bombs at them on & off all night. A Sqd. Signallers relieved us at dinner time to-day & Les, Stan & I went for a swim this afternoon & it was lovely. The Turks succeeded in shelling & sinking 3 of our water barges yesterday & Tuesday & have been short of water in consequence & had to go about two miles towards the beach to get any to-day (to the wells), a battery of 5 inch Howitzers were landed on the beach this afternoon.\n","98":"\n\nFri. 25th. One of the boys on the beach was riddled with shrapnel this morning but the Drs. say none of the bullets struck a vital part & he will live, another shell exploded as it hit a stack of cases containing cigarettes, tobacco, etc. & I believe it lifted cases & tobacco & cigarettes into the sea wholesale, swimming was barred for a couple of hours in consequence. I believe there were several lads hit, some say 15 were struck by one shell. On the ‘phone again at midday. I have had a head-ache all day & am not feeling to bright on it. At 4 o’clock this afternoon the Lord Nelson came up opposite us escorted by 5 torpedo boats, & fired 40 or 50 shots from her guns (heavy) she had a high elevation on her guns, so was probably firing at something across the Peninsular. The Turks had the hide to try & drive her away with shrapnel. Just before\n\n25.6.15\n\nsundown, the Howitzers that has been arriving lately opened fire on the Turks opposite Popes Hill. I believe they were testing a new explosive, however they appeared to be doing good work, only about 6 shells were fired by us & then the Turks took up the running with high explosive shrapnel, they had the range to a nicety but only one man was wounded, he received a compound fracture of the left arm & was a B Sq. reinforcement. A German Taube flew over us this afternoon & dropped some papers on the Turks, (I suppose it is the Turks pay day) shells have been bursting in the gully at intervals all the afternoon but they have done no damage. Received some pills from the Dr. to-night. Chanak in flames on account of the bombardment this afternoon.\n","99":"\n\nSat. 26th. Had a pretty rough time last night on account of head-ache & diarrhoea & all day long I have been feeling only middlin’. At 9.30 last night we had a rally to try & draw the Turks fire, so as to find out where their machines guns were situated, but they would not bite. The Turks landed a few shells on the hill opposite & wounded a lad of the 2nd L.H., he was wounded through the leg. They have been dropping shrapnel here & on the beach all day. The closest water available is about one mile away, so we get plenty of exercise, even if it is only getting water. Have been feeling rather queer all the afternoon & did nothing but lay down & keep the flies off myself, which is a big order here.\n\n27.6.15\n\nSun. 27th. A rally of rifle & machine gun fire woke us soon after daylight this morning. The Turks we apparently having a joke with us & started the business by dropping a few bombs on us, one dropped on the roof of the Drs. dug-out but fortunately it never exploded. We had to stand to arms for half an hours. The Turkish artillery played havoc with the New Zealanders’ trenches & a piece of a shell fell in \"Dad\" Howarths dug-out cutting his blanket & oilsheet & only missed \"Dad\" by an inch or two. The Turks undermined the 8th L.H. on the \"R.F.\" & blew up there H.Q. at 2 a.m. this morning, killing & wounding a good many of them, quite a number of casualties on the beach to-day also & a bomb thrown over Courtneys Post accounted for 11 men. We have been suffering rather heavily during the last few days. The Turks are using a German mortar to throw bombs & it doing good work for them.\n\n28.6.15\n\nMon. 28th. Just before 2 oclock this morning our sappers at Quinn’s Post exploded a mine under the Turkish trenches damage unknown to me. Soon after sunrise a cruiser accompanied by 16 torpedoes boats steamed across from Imbros Island & joined several other warboats a few miles to the South of us & opened up the heaviest bombardment I have seen. The hill they were bombarding appeared one huge cloud of smoke & dust every gun carried on ships took part in the bombardment from the 15 inch shells to the 4 inch on the Torpedo boats. At one oclock this afternoon the 9th Btn. & B Sqd. of the 6th Light Horse who are on our extreme right charged the Turkish positions along the coast, the charge was principally made to keep as many Turks here as\n\n28.6.15\n\npossible, as it was thought that they may have taken troops from here to reinforce at Achi Baba, very heavy fighting has been going on in that direction all day. A German Taube flew over us \nflew over us\n again to-day. About sundown yesterday 6 of our planes were flying over the point that the warboats bombarded to-day & they made a grand sight. I was not feeling too bright this morning & went to the Dr. again, he gave me 7 pills to take at one dose & I have been too frightened to move all day. The attacking party on the right had orders only to take 2 line of trenches, but they were not satisfied with that, but took also the third, the warboats seeing men moving in the 3rd line of trenches thought they were Turks & opened fire on them, our casualties were about 200 in consequence. 9th & 12th Btn. & a Sq. of","100":" L.H. took part, the Turks.\n","101":"\n","102":" Bourke of A Sqd. was killed last night in the trenches here. We gave the enemy a display of fireworks at 9 oclock, with Indian Star Shells, it was a fine sight, the shell is fired from a gun & when they explode send out 5 large stars (either blue or red) which lights up the country wonderfully. The enemy counter attacked during the night at J13 & were repulsed. A party of Turks established themselves between J11 & J12 & were this morning enfiladed by machine gun fire & either killed or captured. Respirators & water to damp them have been placed in the trenches to-day, we have been anticipating an attack of gas for some time, but it is seldom the wind blows in the right direction for them & we have not had a whiff of gas so far. Artillery has been fairly constant from the Turks & large shell still fall on Walkers Ridge every evening. One of the shells hit a man to-day & he has not been seen since.\n","103":"\n","104":" We had no sleep last night, but had quite an interesting time instead; at 9 oclock the Turks opened up with heavy rifle & machine gun fire, a good many Turks also left their trenches & came down the gullies on both sides of Popes Hill. The 2nd L.H. met them between Popes Hill & Walkers Ridge & the Turk soon made back again. They were threatening to attack right up till daylight & I believe the only thing that stopped them was that they were too frightened. Monaghan B Sqd. was killed last night & 5 others wounded from the","105":" Regt. Major Nash of the 2nd L.H. was shot dead last night; their casualties were 2 killed & 3 wounded. As soon as daylight broke this morning we had snipers out shooting any Turks that still happened to be out of the trenches, we can see several dead Turks this morning, & one\n\n30.6.15\n\none\n was taken prisoner last night, another was found badly wounded during the night amongst the bushes, but he died shortly after they got him to the dressing station. At 9 o’clock we were relieved by the 3rd L.H. & came back opposite the Supply Depot. I came down early & secured a good dug-out. One of our aeroplanes was flying over us again this morning. I believe in front of the New Zealand trenches 250 dead Turks can been seen. It is said that Enver Pasha was leading the Turks & intended to wipe us off the face of the earth, but we are still here & Allah has failed them once more. When they charge they shout out Allah, Allah, Allah & so on, & the one that surrendered last night threw his rifle away as soon as he saw our men & said putting his hands up, \"Allah finish, Allah finish\".\n\n1.7.15 – July\n\nThurs. 1st. Last night after tea Stan & I decided to go to the beach for a swim, the sea was choppy & the water warm & it was the most enjoyable dip I have had, we had to hurry back as a thunderstorm was coming up & no sooner got in our dug up after arranging a couple of blankets to break the fall, the rain came down, we had two sharp showers but managed to keep ourselves dry. After the moon came out we bailed out the water which had accumulated at our feet, then spread the blankets out & slept the sleep of the just. Temple was sniped off just as we were getting up. 5 minutes later Ibott was spreading his blankets out to dry & a sniper got him through both legs. 10 minutes later Stanford was tossing a friend to see who would take the lime juice ration & a sniper got him through the \n\"latter end\"\n thigh so we came to the conclusion that this place is not as\n\n1.7.15\n\nsafe as it could be. 3 men in a quarter of an hour is no joke. Early this morning we were warned to go on sapping at 12 o’clock, but as we are to have signalling practise, I went to Adams & told him to take us off the sapping party, we had rather a strong argument on the subject, but I had the best of it. After tea Stan, Les & I went to the beach for a swim & the sea was rougher than I have yet seen it & it was glorious to swim in, just as we came out 3 Turkish prisoners were marched down for a dip & to wash some of their clothing, they seemed happy enough for anything. Murgha Mack went to the field Hospital (on the beach) this afternoon with inflamation of the bowels. Dr. Wells has also left us with ear trouble & I hope he never returns as he treats none of the lads properly. It is said that Standford’s thigh is broken.\n","106":"\n\nFri. 2nd. A sap is being put up through our dug-outs, we sig’s have had nothing to do to-day, as Nelson has failed to secure a buzzer or Heliographs to practise with. This afternoon a New Zealander dropped his rifle by accident, it went off & the bullet went through his knee. This morning we had some excitement as a kite was up from one of the boats observing. A parachute was either freed or broke away & came sailing down & fell between our trenches & the Turks, at least it appeared to be, some papers also flew out of it, just before it came to the ground, some falling in our lines & some in the Turks. The Artillery has been fairly busy on both sides to-day & a howitzer firing from towards the beach & dropping shells on the left of Popes Hill is doing considerable damage to the Turks. Calthorpe was wounded by an 8.2 ins. shell on the face this evening. Went for a swim again to-day.\n","107":"\n\nSat. 3rd. Geo. Edwards went to Lemnos this morning to buy stores for C Sqd. I gave him 7\/- to buy rice, oatmeal, milk & sugar. Cameron was sent away sick this morning, nearly all of us have had a touch of dysentery, but yesterday & to-day I have felt as well as ever I did. I gave Cameron 1\/- (my last) to buy paper & envelopes when he is coming back. Stan has not been feeling too well lately & is still crook on it. Rained a little last night & this morning but we managed to keep dry by spreading a couple of blankets over our dug-out. We have been talking a good deal about having some signalling practise but have not raised the necessary energy so far. We went for a swim again tonight & it was glorious. Our Howitzers have been doing a good deal of firing to-day otherwise everything rather quiet here.\n","108":"\n\nSun. 4th. This morning went up the sap towards Walkers Ridge into a gully there & had some flag-wagging & I rose a blister on my left hand in consequence. Hobson was on a rather high piece of ground & a bullet went clean through his flag. After coming back from practise this afternoon I found an English mail in & a letter from Edie Tomlins, saying she has sent along writing material & a note book, so I am free from all care & worry again. Smithers & Cork started to go round to look up some friends in the 6th L.H. this afternoon. Cork struck a friend on the way, who had a \"plant\", they went no further but returned with a couple of lbs. of good tobacco & a tin of jam each. The tobacco & cigarettes we have been issued with during the last\n\n4.7.15\n\ntwo or three weeks have been rotten, most of it mouldy. Les said he was too tired to go for a swim to-night so Stan & I went on our own, on the way down to the beach we met Wilson (Morgan Welch’s mate) & he told me he had no word from Morgan. The sea was calm again tonight & a Torpedo boat was firing away at a target somewhere on land to the North of us. The sunset tonight was the best I have seen since we landed here, as we were coming back from a swim 40 or 50 Maori’s were marched along the beach for a dip, & they were like a lot of kids as happy as could be. A couple of Turk prisoners were in swimming with us this afternoon. We still have to stand to arms at 3 oclock every morning.\n","109":"\n\nMon. 5th. Signalling again to-day as usual. At Steel’s Post early this morning our Engineers put 300 lb. of gun-cotton in a drive under the Turks Trenches, & fired her off apparently the Turks also had a mine ready & the explosion of our mine set the Turks off too, a few of our lads were slightly wounded in consequence. The Turks also gave Steels Post a healthy peppering of shrapnel soon after daylight causing a good many casualties to us. Stan went to the telephone on Walkers Ridge at 6 o’clock this evening to do a shift in Calthorpes place as he has been wounded. I went for a dip after making our dug-out as rainproof as possible. I believe it is nothing but the swimming that is keeping the troops so fit & healthy here.\n","110":"\n\nTue. 6th. When going for a swim last night we reached the beach in time to see the 16th Btn. of Infantry on their way to Lemnos for a spell; the Turks gave them a send off with a hail of shrapnel as far as their guns would carry, do not know if they suffered any casualties or not, the shooting seemed bad. A new 6 inch Howitzer was also on the beach. These hills are now covered with guns & most of them have not fired a shot so far. Signalling practise again to-day, a good deal of artillery firing has been going on this afternoon. I inquired this afternoon if there was a parcel for me but was told there was none with this mail, so perhaps I shall not get the writing material after all. The Turks dropped some large shells on Steels Post about 6 oclock this afternoon which did considerable damage. Smithers, Penny & I went for a dip again this evening.\n","111":"\n\nWed. 7th. Had no signalling this morning & at dinner time to-day A Sqd. signallers had to go on duty at Popes Post with B Sq. Sig’s. After dinner we were practising signalling in the gully; a good deal of shrapnel was being thrown about this afternoon & as it was falling rather handy to us we knocked off early. We went for a swim just before sundown & coming back passed several wounded men being carried to the beach \nwounded\n, they were wounded on Steels Post which was shelleded rather heavily just at dusk.\n","112":"\n\nThur. 8th. Scotty Hamilton had a fight with McDonald in their dug-out, stopped by McMillan (a draw). Another row eventuated between Cork & Cooper, Cork hit Cooper on the head with a tin of \"bully\" making a nasty cut, Cork placed under arrest. Everything else the same as yesterday even to the swim & the usual sundown shelling\n","113":"\n\nFri. 9th. A court case to-day, Cork was sentenced to 5 days fatigues, he should have got nothing as Cooper was the aggressor; on returning from a swim last night I found a letter block here, sent from Cairo by Arthur Welch. Geo. Edwards & the stores he went away for arrived to-day, was signalling this afternoon. Last night there was a few rallies of rifle & machine gun fire & to-day we have had the usual amount of big shells kicking about with Steels Post suffering heaviest as usual. The stores were issued out this evening before we went for a dip, we got 3 tins of condensed milk, 2 tins of jam & only 6d. worth of rice & oatmeal & no sugar. I pinched some Indian meal off the beach when coming back for a swim, used half of it for breakfast this morning & traded the rest to Burke for sugar. Smithers had to go on the Phone to-night in Marsh’s place who has fallen sick.\n","114":"\n\nSat. 10th. Indian meal for breakfast again this morning & it is very good, had rice for dinner (quite a luxury). Les came down shortly after dinner & has to go on again at 9 oclock tonight, put the afternoon in practising signalling & about 3 oclock the Lord Nelson \n& Warspite\n came on the scene opposite us & opened fire with heavy guns & appeared to be dropping them on a hill this side of Achi Baba. Had a good feed of rice for tea & then went to the beach for a swim the water was rather chilly tonight also last night, but well worth the trip. The days are getting hotter here & it is no trouble to work up a good perspiration.\n","115":"\n\nSun. 11th. Stan & I attended Church parade in the Valley this morning, Col. Merrington conducted the service. We had an issue of frozen beef this morning & had steak for breakfast, stew for dinner & rice for tea (living high). The Turks have been giving Steels Post a rough time again this evening & a good many bombs were exchanged with the Turks on Quinns Post, our bombs lighted the Turks \"bomb Proofs\" & burned gayly, a battery of mountain guns opened fire about sundown with a rattle but only fired about 20 shots. The Turks gave Steels Post a rather warm time about 7.30. Stan & I went to hear Col. Merrington give a lecture on Constantinople, a piece of shell caused an interruption, as it buzzed close over our head & fell about 30 yds. farther up the gully.\n","116":"\n\nMon. 12th. This morning everyone had to put in for any shortages of any description & had an inspection of gear, it is also said that \"iron rations\" are to be issued again this week. I hope it means we are to advance shortly. 15 men were sent out from Steels Post this morning to shell the Turks out of their trench with bombs, only 5 returned, they got a rather warm reception & never reached the Turks trenches. The Turks artillery also played havoc this morning with the front line of trenches on Steels. Stan has to go to Popes Post tonight on duty so Smithers & I started signalling in the same old place we just got nicely settled when two shells burst right over us, the pellets fell all round us but strange to say none hit us & we did not wait for the third which burst just as we got under cover. The 11 ins. gun that has caused Steels Post so much trouble was busy again this evening (had the usual dip).\n","117":"\n\nTue. 13th. A demonstration was given last night, our rifles, machine guns & artillery made the pace a welter for half an hour. We did no work to-day but put the day in reading, at 5 oclock this afternoon the Turkish 11 ins. gun opened fire on Steels & Courtenays, it was the worst day they have had 6 killed & 60 odd wounded on Courtenays, while Steels did not suffer nearly as bad. We are right opposite them here & could see men coming out of the trenches black as charcoal from the powder from the shells, one was carried out with one foot blown clean off, men were constantly waiting with shovels, & after nearly every shell they would have to run in & dig someone out who was buried in the dirt, one lad was blown to pieces & we could see his mates pieces of him at the time. Our own guns have been trying to silence her but without success (went for dip).\n","118":"\n\nWed. 14th. While cooking breakfast this morning 120 reinforcements turned up for this regiment, we came up to Popes Hill at 9 oclock & relieved the 2nd L. Horse. A Sqd. signallers took over the Phone so we had nothing to do but cook decent meals for ourselves. Went for a swim soon after tea. A couple of shells fell very handy just as we arrived & just as we were dressed ready to leave a shell whizzed just above our heads & exploded low on a barge from which dozens of men we dressing & undressing on; one lad had both legs blown off at the knees, another had one foot blown off & all the lower part of his body peppered with pellets. I believe 5 men were hit altogether, if the shell had had burst higher it would have got more. Penny put pinchers on some more Indian meal tonight.\n","119":"\n\nThur. 15th. We relieved A Sqd. at dinner time, at 3 oclock a warboat escorted by several destroyers came on the scene & opened up a heavy bombardment, apparently on Achi-Baba. Bomb-Proof shelters are now erected here & the ‘Phone is under one of these & quite comfortable. Cameron returned.\n","120":"\n\nFri. 16th. While cooking breakfast this morning the Turks opened fire with a 16 pounder & gave our trenches a rough time of it. Simpson was wounded in both legs also Davidson & Beale of B Sqd. received wounds. Sergeant Loveless took a swimming party of 6 men to the beach this morning. Loveless & two of the men were wounded with shrapnel while they were on the beach. A Monitor came along & put in an hour or two bombarding this afternoon. Penny & I went for a dip, a shell exploded on the beach as we were leaving (no casualties).\n","121":"\n\nSat. 17th. Relieved A Sqd. at dinner time. This afternoon some presents to the soldiers arrived from Princess Mary such as \"flint lighters\", pocket knives, money & tobacco pouches etc. 2 lads wounded to-day.\n","122":"\n\nSun. 18th. Last night word came along that some men were to leave the trenches at \"Courtenays\"; at 2 oclock this morning they were to go out & set fire to the German Officers trench & then return to \"Courtenays Post\" if they could; our orders were not to fire but to try & locate position of enemy’s machine guns, if they should open fire, but the night passed by without anything out of the ordinary happening to disturb us. Dr. Fiaschi arrived on the scene this morning, he is our Reg. Dr. from now on, every one here is glad he is with us. We had the usual amount of shelling from both sides, but we did not suffer many casualties at any rate.\n","123":"\n\nMon. 19th. We went on duty at midday, after putting in a quiet morning reading. Our aeroplane flew over us for a considerable time & laid an egg on the Turks before she retired off the scene. Two Monitors took up positions opposite us this afternoon & there was a good deal of shelling from both sides. Some large shells also feel uncomfortably close to a battery of our Artillery.\n","124":"\n\nTue. 20th. Last night the Turks seemed to be affected with nerves, as they we doing a good deal more firing than usual & were throwing bombs all night, some of which came right over us & exploded half way down the hill but neither the shooting or bomb throwing did any damage. At 10 oclock a message came through that we were to have a gas alarm before daylight. This happened at 4 oclock this morning & we had to knock about for half an hour in helmets, a fair amount of shelling, but nothing out of the ordinary to-day.\n","125":"\n\nWed. 21st. At 8 o’clock this morning we left Popes Hill & came on to Walkers Ridge & had to take over the ‘Phone (which is only a few yards from the outpost) straight away. C Sqd. is camped up the ridge from the gully where A & B Sqd. are camped, it is not the safest place in the world as large shells fall there occasionally. We have to carry gas helmets with us always now & everything points as if we are likely to get a taste of it soon, messages keep constantly coming through the ‘phone for sentries etc. to keep a sharp look out for any signs of it. Heard a message coming through that a destroyer would open fire during the night & the Talbot (destroyer) would also open fire at 4.30 this morning. From the Phone here we can see shells bursting on Achi-Baba. It is reported that 100000 Turkish reinforcements have arrived on the Peninsular, aeroplanes have been busy.\n","126":"\n\nThurs. 22nd. A few shells came over & burst in the Turks trenches opposite about 10 oclock last night, we were expecting a big demonstration but it was a false alarm. General Byrdwood was around inspecting this morning. Great preparations are being made to-day to give the wily Turk a warm reception tonight as it is confidently expected that they are to make a big attack & everyone has to stand to arms all night waiting for them, needless to say everyone is in a state of excitement & looking forward to it as we all want to see a big decisive battle to end it one way or another. The Turks have been shelling Popes Hill a bit this afternoon & one of our lads (Rider) was wounded last night by a bomb, but rifle & machine gun fire has not been speaking at all. Our men have been busy the last day or two erecting barb wire entanglements etc.\n","127":"\n\nFri. 23rd. The expected attack last night proved a false alarm, we stood to arms at 11.45 last night & 2.45 this morning. A destroyer fired a good many shots & played havoc with the Turks trenches opposite & they could be seen (from our \"outpost\") building up their trenches all night, the same performance is to be gone through to-night in anticipation of their visit.\n","128":"\n\nSat. 24th. Stood to arms twice during the night but nothing happened the Turks used fire shells last night but they can do no damage here, as there is nothing to catch fire, a few blankets caught fire from them last night but their owners soon put them out. Went for a swim this afternoon over walkers ridge & had a great view of the country from there; a good many killed & wounded by shrapnel on the beach to-day.\n","129":"\n\nSunday 25th. Nothing during the night & did not have to stand to arms till 3 o’clock this morning, today has been a good deal hotter than usual, a good many splinters of our own shells fly back into this gully from own shells, no-one has been hit but they drop mighty close after every shell is fired. I do not think there is enough force in them to put a man out of action for long. The Turks appear to be using a new powerful mortar for throwing bombs & it seems to be a success.\n","130":"\n\nMon. 26th. As soon as we were dismissed from standing to arms this morning Charlie Burke & I went to the beach to see if we could buy any groceries from the sailors, all we could get was milk @ 1\/6 per tin, we sig’s now have 10 tins on hand; we had a swim before returning & relieved the Sigs on N.T. Phone at the outpost at 12 oclock. The 2nd L.H. who were brought up as reserves have been taking a turn on the ‘phone so we only strike a shift every 6 days.\n","131":"\n\nTue. 27th. Tommies have arrived here & are taking over the Army Service work on the beach. Mark 7 ammunition \nh\n is also arriving & as it will not fit our rifles a rumor is gaining ground that we are likely to soon be relieved by English Tommies & we will make a move goodness knows where. Murga Mack arrived back to-day he was sent to Cairo & appears to have had a good time as he looks very well on it. Dr. Wells also showed up this morning but was at once ordered back to the beach, it is said he had a row with Col. Meredith at Heliopolis & came over here without permission & has to go back again & no one here is sorry. Fiaschi is the man we want, he has been busy to-day inoculating us against Cholera. A good deal of artillery firing going on this afternoon from both sides. We were relieved from the phone at 12 oclock.\n","132":"\n\nWed. 28th. It is only a rumor about Wells being sent back, as he took over from Fiaschi to-day, before Fiaschi went he put in a report that that the health of the Regt. was not good enough for heavy work; the majority have had diaoherrea very bad for weeks now. A fatigue party of 100 men were taken from C Sqd. to-day to dig dug-outs ready for the Tommies when they land. Cooper (B Sqd.) was shot dead to-day by a sniper, he was standing by his dug out & shot through nearby.\n","133":"\n\nThurs. Last night a fatigue party from this Regt. had to go to the beach & drag a 6 in. Howitzer over the hills up onto Walkers Ridge. This afternoon as Penny & I were about to go for a swim a German Taube flew over us & came pretty low to drop 2 bombs on the beach (the bombs fell in the sea & did not harm) one of our machine guns opened fire on her & got a bully, as she seemed groggy & was falling fast when we last saw her over \"Steels\". It is said she turned over before reaching the ground & caught fire.\n","134":"\n\nFriday, 30th. Came on duty at 12 oclock to-day relieving 3rd L.H. who were on (2nd went in the trenches yesterday). Word came through to-day from Kitchener saying the Turks were routed on the Euphrates & the road is now clear to Bagdad, a good deal of ammunition, stores, guns & prisoners taken. Word came through to all the \"posts\" at the same time \"per ‘phone\" & when the message was read out to the troops they gave 3 cheers from Popes, Quinns, Courtenays & Steels, also around to the extreme right. The Turks hearing the cheering apparently thought we were about to charge as they opened up a heavy fire (wasting more ammunition). Last night the Turks fired a mine at Courtenays killing 3 & wounding 8 of our lads. Johnny Hayes was shot through the chest last night, he was alseep with a dozen others up here on the \"Out Post\" at the time, it is a wonder there are no more hit as they have to sleep in the open; at 4 oclock this morning I was at the L.H. tanks for water & one of the 3rd L.H. was shot through the chest by a sniper while waiting for water.\n","135":"\n\nSat. 31st. One of our warboats came in opposite us during last night & was firing heavy guns constantly for an hour, she was firing back probably onto Achi-Baba. Was relieved from the ‘Phone at 12 oclock, went for a dip after tea.\n","136":"\n\nSunday 1st. When coming back from the swim last night, things began to hum, as all the rifles, machine guns & a few howitzers opened fire along the full front of our firing lines, we hurried back to see what was doing, but found it only a demonstration to keep the Turks here, as the Tommies are making a big attack at the Cape, shortly after 10 o’clock the warboats opened fire & by the noise at the \"point\" the fighting must have been terrific; we heard this morning that the attack was successful. Last night Hayes (B Sqd.) was shot dead while asleep in his dug-out & his mate Davis was wounded with the same bullet. Innoculated against Cholera.\n\nAugust\n","137":"\n\nMon. 2nd. Major Vernon has been away for several days now sick; the Reg. Quarter M. Sergeant-Major (Webb) has also been away for over a week. We are on a short allowance of water only 1½ bottles allowed per man to-day. Went for a dip after tea.\n","138":"\n\nTue. 3rd. Last night Gurkhas were landed here. We relieved the men on the ‘Phone at dinner time, but were relieved ourselves at 4 oclock as the 1st Regt. moved onto Pope’s Hill & went in the trenches, A Sqd. took over the ‘Phone, so we made a dug out comfortable & put the rest of the afternoon in reading the papers, as the papers of the last mail only arrived to-day. About 9.30 to-night we gave the Turks a demonstration. Signal fires burning green & red smoke was lighted on Walkers Ridge, also red & blue parachute flares were fired. These flares are in a class of their own here they are fired high in the air by a gun & descend very slow, lighting up the country as plain as day.\n","139":"\n\nWed. 4th. Between 7,000 & 8,000 Tommies were landed last night, we went on duty on the ‘Phone at dinner time to-day; early this morning a German Taube flew over us & dropped a bomb amongst the Tommies; water rather scarce.\n","140":" (War Anniversary)\n\nThur. 5th. Another demonstration last night; at 9 & 10 oclock everything looks as though we shall make a move before long, a meeting was called this afternoon & all the O.C’s had to attend, we were issued with iron rations to-day.\n","141":"\n\nFri. 6th. Some trenches on our right have been changing hands lately, they were taken by the Turks yesterday & retaken this morning by the 6th Light Horse, a good deal of shelling has been going on lately & two mines on Quinns exploded this morning. We suffered heavy losses on the right; today we have been sewing white bands on our sleeves & a white patch on the back of our tunics, so as the artillery will not mistake us for the enemy.\n","142":"\n\nSat. 7th. At 4 oclock yesterday I witnessed the most impressive scene I have ever seen, after a heavy bombardment from our artillery & warboats, the boys on the right charged & it was a grand sight; the country looked as though a bush fire was raging, white smoke from the shrapnel & the black smoke from the high explosive shells mixed with the red soil cut up by the shells made a fine picture, & our boys sprinting through it with bayonets flashing in the sunlight set it off. At one place the Turks seemed to dispute our trespassing right but only for a few moments, then they turned & fled. It was too far from here to see the men falling, & so only saw the grand side of the affair; especially as our boys were advancing, leaping line after line of trenches, only allowing themselves a few moments occasionally to get their breath, & then up again to keep the Turks on the run. The troops on the extreme left also charged at the same time, a part of the New Zealanders & all the Ghurkas, & have\n\n7.8.15\n\nkept the Turks on the move ever since. 200 Royal Welch Fusiliers came along & manned Walkers Ridge & they were a fine lot of men. I knew as I looked at the charging on our right yesterday afternoon that the 1st L.H. would be making an attempt to push back the Turks from Popes Hill at 4.30 this morning (as it was then anticipated that the left & right flanks would then be up level with us) but I hardly thought of the sight I was to witness & felt disappointed when orders came out that C Sqd. had to remain & we had to attend to the ‘phone. A & B Sqd. had to charge with a troop from C Sqd. as bomb throwers, 200 men all told. Quinn’s & Walkers should have commenced the attack a shade before us. The first line of men leaving Quinn’s were all mowed down by machine guns & no more were sent out from there, the Welch Fusiliers were a shade slow off the mark & all the enemy’s fire was directed on our boys as they jumped over the parapet. I had a grand view of the Welch boys as they left their trenches to charge, they were no more than 400 or 500 yards from here in a direct line. It\n\n7.8.15\n\nwas simply murder, the Turks machine guns were playing along their parapets, & it was pitiful to see the brave fellows falling, it is marvellous any of them managed to get through at all, but the Welch boys took two lines of trenches, but were forced to retire to the first line again, the 1st L.H. managed to get into the third line of trenches, but as the flanks did not come up, the Turks began to close in on both sides & gave us particular fits with bombs, & we were compelled to retire to Popes; the Turks trenches are lined with Turks (thousands of them). Major Glasgow (who was in command) was the only officer that went out & was not hit; he is one of the best & bravest soldiers we have. Major Reid was killed (Sigs) Howarth, Creighton & Arston wounded, our casualties were \nabout\n 159. Major Glasgow has temporary command of the Regt. The fighting on the left is very fast & the Aus. & New Zealand forces have taken the hill which was their objective, they took it about sundown.\n","143":"\n\nSun. 8th. Heavy fighting everywhere to-day, our artillery horses have landed & from Walkers Ridge they can see the Artillery galloping into action, our advance still continues on both flanks & we are doing all we can to keep as many \nmany\n troops engaged on our front as possible. The L.H. charge yesterday was only for the purpose of \nget\n keeping a large quantity of Turks here, apparently the Turks expected the main attack from here. The Ghurkhas & Maoris & Sikhs have reached the foot of hill 971 (their objective).\n","144":"\n\nMonday, 9th. We left Popes Hill to-day & went on duty at Hinton’s Post (N.T.) at dinner time, was issued with Webb equipment before the charge took place, we have had very heavy casualties everywhere the total loss to the 1st L.H. was 159 killed, wounded & missing as the result of our charge; very heavy fighting still continues on our left & front; 971 has not yet fallen.\n","145":"\n\nTues. 10th. The Turks have been counter attacking on 971 our artillery has been doing great work all the morning, it is estimated by the Artillery officer that the Artillery accounted for between 1,000 & 2,000 Turks to-day, our machine gun on Popes also accounted for a large number of Turks who were formed up behind Quinns Post, a party was sent up the Bloody Angle last night & succeded in getting another wounded man & 3 dead men down, the dead had been gone through by the Turks & the identification discs taken, & were unrecognisable through decomposition. All the transport drivers arrived here from Alexandria yesterday, Plushy amongst them, our mail was sunk while coming ashore on a barge last Sunday. I believe Tancred & Barrow were mentioned in despatches for bravery in carrying out bombs when the attack was on.\n","146":"\n\nWed. 11th. Relieved the men on the ‘phone at dinner time to-day, a message came through this afternoon that a 3 days feast commences with the Turks & probably another attempt will be made by the Turks to drive us off the Peninsula (with the aid of Allah) their fanaticism has not helped the much in their previous attacks; things have been fairly quiet to-day & I believe both sides are busy \"digging in\" at present; about sundown or a little later the Turks on the left flank made a determined attack, but were repulsed with heavy losses. From the top of Walkers Ridge we can se the Red Cross waggons busy going over the ground we took from the Turks. We failed to take hill \"971\".\n","147":"\n\nThurs. 12th. A fair amount of shelling to-day & the Turks were seen to be \ntak\n withdrawing their ammunition & stores, from the front of our right flank, on donkeys & mules. An alarm was sent to Hinton’s Post last night that a German spy (suspected) was trying to get through to the Turks line, it proved to be Leiut. Edmonds.\n","148":"\n\nFriday 13th. A German Taube was flying over us about sundown yesterday, when one of our planes came on the scene & chased the Taube, a second Taube rose to help, & our machine appeared to think it was time to quit & came back. Otherwise everything quiet, a little shelling.\n","149":"\n\nSat. 14th. Another quiet day; last night the Turks were burning dead bodies & the fumes we get here are nearly enough to make us use our respirators. The Turks have been coming out of their trenches during the night time & collecting the boots off our dead & one was shot dead last night while in the act; demonstration last night.\n","150":"\n\nSun. 15th. The Turks made a determined bomb attack last night on the right flank, but were easily repulsed & strange to say our casualties were practically nil. The Turks suffered heavily. Everything in Monash Gully very quiet.\n","151":"\n\nMon. 16th. Very heavy bombardment took place at Achi-Baba from 3 oclock to 3.30 this morning. A fair amount of artillery work on both sides, a number of Lenster Fusiliers were brought from the left flank & are to be put in the trenches here. It is said they failed to hold some springs the Aus. & New Zealand troops took, they turned when they saw the Turks counter-attacking in large numbers, the Aus. & New Zealands had to retake the springs later in the day.\n","152":"\n\nTue. 17th. Mills has got a job interpreting with the Indians as he understands their lingo, the 1st Light Horse appears to be practically a thing of the past; 30 men were told off & sent around to the left flank as snipers yesterday & to-day, 15 more was sent off to various positions for the same purpose, the remainder of the Regt. go to Popes Hill every night as support, half the Regt. one night & the other half the next.\n","153":"\n\nWed. 18th. One of the Lenster boys was shot dead through a loop-hole at Quinn’s last night; by finding men for outpost duty at Hintons Post & at the end of this gully & at the Bloody Angle, together with fatigues during the day time our Regt. is getting an exceptionally hard time just at present, & every day there is a sick man or two sent away, there are not many of old lads left & what are left have nearly all been sick & are run down & should be sent away for a spell, but all the posts around Monash Gully are rather weak & it would be very risky to weaken it further by sending anyone away that is still strong enough to show fight, we are also on a better diet again rice & desicated vegetables being issued to-day, also a ration of coffee, but I believe we get no more coffee.\n","154":"\n\nThurs. 19th. Stan & Les went to the beach yesterday afternoon after coming off duty & managed to buy some milk & this morning we bought a tin of cocoa-milk from Chivers. Stan also got a tin of Curry yesterday so we are well in the joke at present, we have also had two issues of bread since Sunday. We have been working the ‘phone at Hintons Post since we came off Popes Hill, 24 hrs. on & 24 off so we are faring fairly well.\n","155":"\n\nFri. 20th. We came of duty at dinner time. Stan & I went to the beach for a swim & to see if we could buy any luxuries, one tin of maconochie for 1\/- was the result. A good deal of shrapnel was flying about the beach & I had two attempts to have a swim, but gave it up as the shrapnel was dropping too handy.\n\n21.8.15\n\nSat. 21st. I believe the 17th, 18th & 19th & 20th battalions of Infantry was landed yesterday afternoon & last night some were landed here on the main beach & some on the left. We went on duty on the ‘phone at 12 o’clock today & soon found things moving some, our rations were given us at 2 o’clock instead of 5 as usual & at 3 oclock the warboats & artillery opened up a very heavy fire on the left flank. I walked to the top of Walkers Ridge & had a grand view of the fighting in the low country below us, but there was very little one could see only clouds of dust & smoke & the flash as the shells exploded, the bombardment was terrific. I knew that hill 971 was\n","156":"\n\nto be attacked again this afternoon but did not wait to see any of the charging as I was on duty & thought I might be wanted on the ‘phone, everyone had orders to stand to arms at 3 oclock as it was expected the Turks may counter attack here if they are driven back far on the left, & we are wear Plush & Langford were both wounded while sniping on the left yesterday; Langford shoulder & Plush on the foot with shrapnel. Received a the long delayed parcel from Edie T. this morning, a good deal of shrapnel flying about these parts this afternoon. After the bombarding the left flank charged & immediately took a well & some trenches & were advancing steadily till dark.\n","157":"\n\nSun. 22nd. I believe casualties were very heavy again on the left on account of the attacking. General Russell who is commanding the attacking forces sent word that his right was held up with machine guns. This morning our aeroplane was busy & sent back a wireless message saying Turks were bringing up a large number of reinforcements, heavy fighting still continues & the 17 & 18th are in the thick of it & I believe have suffered rather heavy. Neither Penny, Smithers or myself have been feeling too frisky to-day stomach troubles. I believe Tapp has to leave here on account of being blind in one eye, he does not like going & he has been bad with dysentery the last week or two.\n","158":"\n\nMon. 23rd. Slater Tapp will probably be sent to Australia as Broardbent says it is not safe to have him working on a machine gun with only one eye & that he will have to see a Dr. about it. Fitzgerald after recovering from his spill at Heliopolis was fitted up with a new glass eye & was told he could stay in Egypt or go back to Australia, when he found he could not come to the front he decided to go back home & I suppose Slater will have the same offer when he gets back to Egypt. There was some heavy firing on the right flank last night. The 18th Btn. received a particularly rough time yesterday evening, they were attacking a very strong\n\n23.8.15\n\npart of the Turkish lines, yesterday the Turks counter attacked & with sheer weight of numbers went through our lines, it is the first time to my knowledge that they have shown fight with the bayonet. A few days ago they retook some positions the Lensters (Irish boys) were given to hold \nbut\n with the bayonet, but the Lensters admit they did not wait for the Turks as they were charging with overwhelming numbers & the Lensters blame their officers who are mainly only boys & have had no experience whatever. The Lensters were then sent to relieve the Australians on Walkers Ridge, Quinns, Steel’s & Coutenay’s Posts. What they went through on the left has completely unnerved them & they cannot now say are we downhearted NO. On\n\n23.8.15\n\nWalkers Ridge their officers refused to take over the trenches during the night time for want of confidence in their men & the Aus. hold the trenches during the night time & the Lensters during the day. On all the other Posts they are put in day & night with an equal number of Australians mixed through them & they appear to be ideal soldiers but do nothing without orders from an officer, without officers they are lost & some of their officers treat them like dogs. One of our boys were sent to Quinns yesterday on fatigue work & he said a Lenster officer was speaking to one of his men in such a manner that he had to walk away for if he waited ten seconds longer he would have been telling the officer what he thought of him, in fact when\n\n23.8.15\n\nhe got back here he was so indignant over the Tommy’s ill treatment that he could hardly speak & if the officer could only have heard the Australian names he was called, I believe he would have been flattered. Les Smithers was grazed on the back of the hand by a piece of shell the morning of the charge & it put a nasty cut in one finger which does not appear to be healing too well & today he is very bad with dysentery & had to go off duty to-day, so Penny & I have to take the ‘phone on our own to-night. Sergeant-Major Kirby was promoted to the rank of Lieutenant about a week ago, & he is panning out a very good officer & was in charge of Hintons Post here last night. 9 men & 1 officer is all that is holding this outpost during the night & 6 men & 1 N.C.O. during the day, we would get some \"hurry up\" if the Turks charged us, as it would be impossible to retreat.\n\n24.8.15\n\nTue. 24th. Last night an order came through from Brigade H.Q. to the 1st L.H. to send 100 men of all ranks to Popes Hill at 3 oclock to-day to relieve 100 men of the 2nd L.H., a reply was sent back a few minutes later saying all told the 1st L.H. could only raise 96 men; we have about 45 snipers in various positions & that would bring our total up to 140 men. When we landed we had 442 \nofficer\n men besides officers, & since then we had 120 reinforcements in one lot & on several occasion we have had two & 3 men at at time coming into the Regt. so counting killed, wounded, missing & sick we have had a rough time. The attack still continues on the left & the Turks who have been fighting very fair up to \ndate have at last resorted to foul tactics. Copy of Message received last night.\n All men particularly new arrivals are to\n\n24.8.15\n\nbe warned against intended surrenders on the part of the enemy AAA. Following trick was played on Australians yesterday a number of men without arms & hand in hand headed by one man with white flag, came to our trenches then made a rush threw bombs & bolted AAA. Somewhat similar trick was played on Sikhs. In all cases of apparent surrender sufficient rifles should always cover the enemy till their good faith has been proved by surrender one by one, search for weapons including bombs & despatch to the rear AAA. Especially warn new arrivals that any man coming forward to surrender with arms is not to be allowed to approach till he has thrown down his arms & is without means of defence including bombs AAA. ADDRESSED 3, 4, 5, 6 Sect’s N.Z. M.R. Bde., N.Z. Inf. Bde., 4 & 5 AUS. Inf. Bde. Some of the Drs. here say the sickness that is so prevalent amongst the troops\n\n24.8.15\n\nwould have been enteric fever if they had not been inoculated. Between 20 & 30 men are sent away from the 1st L.H. Bde. every day & the Lensters average a good many more than this. At Major Glasgows request only 50 men of the 1st L.H. went onto Popes Hill to-day & 40 2nd L.H. came out, all that came out ","159":"\n were sick & they look a sorry lot some of them can hardly walk, a large mail came in to-day. Stan’s long delayed parcel came along with this mail, also a parcel of cigarettes & Tobacco from Edie, we now have more writing material than we know what to do with. Fighting seems a thing of the past just at this particular spot but things are lively both to the North & South of us, a dry thunderstorm came over us this afternoon but no rain.\n","160":"\n\nWed. 25th. The weather has been inclined to be stormy the last few days & heavy clouds have been going over us but only a few sprinkles have fallen; heavy bombarding has been going on around Cape Helles. I suppose the boats are still banging away at Achi-Baba. It is rumored that the boats are bombarding the Narrows & Achi-Baba for three days & then our Monitors are going to try a dash through the Narrows. We went on duty at Hinton’s out-post again a dinner time to-day. Smithers is a little better to-day & is going on duty with us again tonight. Popes was shelled today but no damage done.\n\n26.8.15\n\nThurs. 26th. Very heavy firing from the warboats to the south of us last night, on our right flank there was a good deal of rifle & machine gun fire also but along our front of the firing line there was scarcely a shot fired & we could quite plainly hear a dog barking behind the Turkish lines opposite the right flank; I should reckon we have a fighting front of from 10 to 13 miles, 3 or 4 miles to the right of us & the remainder on our left but our position on Popes & Walkers Ridge is probably the furthest inland although the left flank is practically level with us & the right is not much behind.\n\n26.8.15\n\nMessages have been going through all the morning concerning our future movements & one order came through that we would be relieved to-day & tomorrow we would either go to the level country behind the left flank to build shelters for the winter or else be sent to Lemnos for a spell first. Our Brigade Major has been battling to get us as spell, but does not know yet whether we will get it or not. However the order was cancelled later in the day & we have to go on here just as usual for 2 days more there is not 20% of the men left fit to do any work as they are all too sick & many are that weak they can hardly walk. Mack received commission.\n\n27.8.15\n\nFri. 27th. Just as we got nicely settled in bed last night the rifles & machine guns opened fire & after the quiet time we have had I began to wonder whether the Turks were charging or not but it only lasted from 15 to 20 minutes so we lay back & slept the sleep of the just, & found this morning that it was only a demonstration, one of the lads on Popes was wounded with shrapnel as the result. At 3 o’clock this afternoon all the guns & warboats opened fire on the Turks trenches on the left flank at 4 oclock, the charging commenced & the fighting has been very heavy all the afternoon, some regular English troops are taking part & we hope for good work from them, they are the Connaught Rangers from India.\n\n28.8.15\n\nSat. 28th. We had a rare bit of amusement at Hinton’s Post telephone at 8 oclock last night, a 2nd L. Horse officer was on duty there for the first time & went up to the searchlight about 10 or 15 yds. up the sap to Walkers Ridge, to see the men on duty there, as it happened the sentries had been \nbe\n called to the top of Walkers to get issued with respirators & as he met no sentry he went on up the sap to the top & enquired about the lamp & one or two other things which caused the men to be suspicious of him. The Officer returned back to the ‘Phone & was talking to me when two sentries from Walkers appeared & presenting the business end of the bayonet asked him for the password which we had not then received, the officer told them,\n\n28.8.15\n\nthe pass word had not come down so they wanted to take him back to their H.Q. with them, but I intervened & told them he was the officer on duty at Hinton’s Post & could soon convince the sentries of their mistake by ringing up our H.Q., this was decided on, so I rang up Major Granville, explanations followed & the sentries soon convinced. They belonged to the 20th Btn. who only landed last Sunday & came on duty relieving the 3 L.H. Bde. last Thursday, they are very fresh & have German Spy’s on the brain apparently but they took the Officer (McMartin) in hand in a very business like manner & say they are anxious to test their bayonets on the Turks, but they will find that a bayonet charge loses\n\n28.8.15\n\na good deal of its fascination after they go through their first, or witness one at close quarters, charging through machine gun & rifle fire to get close enough to use the bayonet, knocks all desire \nfro\n out of ones head to charge, if he has witnessed or been through one before. A message came through from the left flank last night at 10 o’clock, saying the Connaught Rangers had already taken the trenches, which was their objective & they should have no difficulty in holding them. The Australian & New Zealanders had taken 9\/10ths of hill 60 which was their objective & were being reinforced & were to going to push home the attack to the top at midnight. That was the only message that came\n\n28.8.15\n\nthrough on the ‘phone, but this morning we heard from Bde. H.Q. that the Connaughts bolted three or four times later in the night & the 3rd Bde. of Light Horse were sent to reinforce them & as no reports have come in on the ‘phone we surmise the result of the attack was far from satisfactory. The Lenster Regt. was condemned here by English officers as well as our own & we were hoping the Connaughts would do something brilliant to uphold the good name of the English Tommy, but I am sorry to say they appear worse in the eyes of everyone here now than they did before, especially as the Connaught’s are practically all regular soldiers, even the Indians are not backward in condemning the English boys here & their Officers appear worse than the men.\n\n29.8.15\n\nSun. 29th. Yesterday Col. Meredith arrived with 50,000 reinforcements, Frank Hobson from N’mine being amongst them. Bob Wall is in the 20th Btn. Today A Sqd. of the 12th L.H. was attached to this Regt., what was left of the original A Sqd. is now put with what was left of B Sqd. making B Sqd. from the two & with the extra Sqd. & reinforcements we are not far below fighting strength again. I believe B & C Sqd’s of the 12th Regt. are reinforcing the 5th & 6th Regts. so the 12th L.H. is a thing of the past. The same fate fell to the 11th Regt. as they were split up to reinforce the Queenslanders & the lads of the 1st L.H. who have been in the trenches with the 2nd on Popes during the last week left the trenches at 4 oclock this afternoon & a Sq. of the","161":" took their\n","162":"\n\nplaces. I was feeling particularly good this morning & went to the Church Service; & went on duty at Hintons Post at 12 oclock. This afternoon we had a naval Officer here taking bearings & range finding; the Turks have been busy every night for some considerable time now building up some earth works at the top of Popes Gully & as the building is now getting a considerable heights the Heads appear to think it is time to knock them down again, our Artillery opened fire on it this morning with high explosive shells but did not appear to do much damage to the work, they have come to the conclusion that the work is being built up with cement & the warboats are going to make a target of it tonight. Mack is on duty on this outpost tonight.\n","163":"\n\nMon. 30th. The Engineers on fired 3 mines at 8 oclock last night & a warboat fired a few shots at the earthworks at 10 oclock, we could hear the Turks coughing as a result of the fumes from the high explosives used, but the shells did not do much damage to the works as far as we can see this morning. A message came through last night saying the 10th L.H. had taken a new trench & there was no sign of a counter attack, they are now consolidating their positions. The signallers that came from the 12th L.H. relieved us to-day & we now have 48 hrs. off & 24 on, there were 7 sigs. that belonged to the","164":" with us now, so we should have an easier time from now on, until a few more gets wiped out at any rate.\n","165":"\n\nTue. 31th. Last night the Turks mounted a machine gun on the earthworks they have lately been building & trained it down this gully, but they started it a little too late as we had all just retired to our dug-outs for the night. This morning our artillery again opened fire & blew a lump off the top of the works. Murray who was sent away sick a few weeks ago returned yesterday & said the boys sent to Lemnos with this disease which is so prevalent amongst us, get no attention paid them at all. They are put in tents & when they wake up in the morning they have to fold & stack their blankets neatly on one side of\n","166":"\n\nthe tent, take the sides of their tents down & clean up generally, certainly the whole of the work would not amount to much for a healthy man, but the men are that weak when they leave here that they can scarcely move & every morning at Lemnos the stretcher bearers have to \nleave\n go to the latrines to bring back men who have managed to get to the latrines & were too weak to get back to the tent & have laid in the cold some of them for hours waiting till morning to be carried back. These men are dying by the score for the want of proper attention. One of the Drs. here said the disease is enteric fever counteracted by inoculation,\n\n31.8.15\n\nthe men suffering from it cannot eat & fall from strong healthy men to shadows in a few weeks, the only medicine given them \nare\n is pills & until recently could not get any soft food, but now they are put on a diet of milk (condensed) porridge, groats etc., this they can manage to eat, but cannot always keep it down. It seems a shame that men who have been constantly (for 4 months in the trenches) fighting to when taken sick, not to able to get proper treatment. Any man who happens to get wounded gets proper attention by our own Dr. & red Cross men, but a mate who may have been fighting side by side for months with the lad who was wounded, falls sick our Dr. & Red Cross men have no\n\n31.8.15\n\ntime (or I should say inclination) to look at him & I know scores of cases where the sick man was told by an orderly that you can’t see the Dr. to-day, call again at 9 oclock tomorrow morning & if the Dr. was \nindisposed\n they would have to wait till the next day & if the sick man demanded treatment, the Corporal would probably give him some pills to go on with, no temperatures are taken till the man is that weak they can hardly walk to the dressing station & in nearly every case that a man’s temperature is taken he is either sent away to hospital or to our own Field Hospital.\n","167":"\n\nWed. 1st. We had a demonstration here last night to keep a few Turks engaged here & as soon as the rifle died down along our lines we could hear them hard at it on the left & most of the warboats were banging away in the Narrows. I believe we took some important positions as the result of last nights attack. Some dressing station stuff was brought to the foot of Popes Hill last night (on mules) belonging to the 17th btn. of Infantry. It is generally believed we shall be relieved from Popes Hill by the 17th Btn. & we are to be sent to the left, either to take a hand in the fighting or put up winter quarters, the 3rd L.H. Bde. was sent from Walkers to the left armed with picks & shovels, but the first night they were there, they\n\n1.9.15\n\nwere called out to support the Connaught Rangers & have been fighting constantly ever since. The Lenster Regt. has been on permanent fatigue work for the remainder of the war. Our Artillery has been peppering the earth works of the Turks again to-day & made some impression on it in places. The Turks retaliated by putting a few shells onto Popes, but they did not do any damage; one of the old 12th L.H. boys was shot through the neck this afternoon by a sniper from the earth works they have been building. Another opportunity has arisen to draw money & Les, Stan & I put in for £2.0.0. \neach did Stan & Les\n Everything is very quiet along these lines but there is generally some fighting on the left flank.\n","168":"\n\nThur. 2nd. Orders came through last night for the Regt. to be ready to move off soon after dinner to-day & we were to go to No. 1 Outpost. As we are on duty on the ‘phone I went down & saw Major Granville & found we are to stop on duty on the ‘phone here at Hintons Post till we are relieved by the 17th Btn. of Infantry, who are taking over this position from us. We packed up our kits took them up to the ‘phone & waited till 5 oclock before we were relieved, came over Walkers Ridge & arrived here where the 1st Regt. is camping just in time to cook & have tea before dark, as we were coming down from Walkers Ridge we had a spell looking at a 5 inch Howitzer gun firing Lyddite shells at the enemy.\n","169":"\n\nFri. 3rd. Last night was one of the best I have had for comfort & contentment. The Hospital Ship lit up gaily with Red & Green lights looked a pretty sight standing out some distance from the shore, she was the only boat visible, although we knew that scores of warboats & destroyers were there, about 9 oclock a flash of flame followed by a loud report & the screeching of the shell over us was proof enough that the warboats were still there, she fired 30 or 40 shots & then again silence broken only by an occasional rattle of rifle fire; as we were coming along the sap yesterday evening we passed scores of wounded men mostly English \nbet\n being taken to the beach to be sent to the Hospital boat, they had been in a scrap early yesterday morning.\n\n3.9.15\n\nCon. We are situated at present only five or six hundred yards from the sea, so we are handy for swimming & washing, directly below us is a strip of country 400 or 500 yds. wide \nwide\n which is in view of the enemy & a dispatch rider has to run the gauntlet from 2 to 3 times a day carrying important dispatches. The Turks have snipers & sometimes machine guns turned on this part of the road in hopes of bringing down the horse or man, one man has been winged only, up to date, so it has hardly paid the Turk for his trouble. I believe we are only here for 3 days & then go into the trenches, if we do I think we are likely to be put in some rough charges, as it is along here that we are forcing the fighting. Penny went away to see\n\n3.9.15\n\nMills shortly after breakfast & did not return till nearly sundown, but he brought back a tin of fruit, 3 tins of milk & a tin of sardines, so he did not do too bad. Smithers & I went for a swim this afternoon & gave all our spare clothing a good soaking. Stan & Les have to go on duty on the ‘phone from 4 till 8 oclock to-morrow morning. Sergeant Nelson is pretty bad with dysentery or malaria & will probably go off duty tomorrow. At last I am to the end of this book & I start the next on my 24th birthday.\n\n"}}