{"Document Name":{"0":"Diary_0142","1":"Diary_0142","2":"Diary_0142","3":"Diary_0142","4":"Diary_0142","5":"Diary_0142","6":"Diary_0142","7":"Diary_0142","8":"Diary_0142","9":"Diary_0142","10":"Diary_0142","11":"Diary_0142","12":"Diary_0142","13":"Diary_0142","14":"Diary_0142","15":"Diary_0142","16":"Diary_0142","17":"Diary_0142","18":"Diary_0142","19":"Diary_0142","20":"Diary_0142","21":"Diary_0142","22":"Diary_0142","23":"Diary_0142","24":"Diary_0142","25":"Diary_0142","26":"Diary_0142","27":"Diary_0142","28":"Diary_0142","29":"Diary_0142","30":"Diary_0142","31":"Diary_0142","32":"Diary_0142","33":"Diary_0142","34":"Diary_0142","35":"Diary_0142","36":"Diary_0142","37":"Diary_0142","38":"Diary_0142","39":"Diary_0142","40":"Diary_0142","41":"Diary_0142","42":"Diary_0142","43":"Diary_0142","44":"Diary_0142","45":"Diary_0142","46":"Diary_0142","47":"Diary_0142","48":"Diary_0142","49":"Diary_0142","50":"Diary_0142","51":"Diary_0142","52":"Diary_0142","53":"Diary_0142","54":"Diary_0142","55":"Diary_0142","56":"Diary_0142","57":"Diary_0142","58":"Diary_0142","59":"Diary_0142","60":"Diary_0142","61":"Diary_0142","62":"Diary_0142","63":"Diary_0142","64":"Diary_0142","65":"Diary_0142","66":"Diary_0142","67":"Diary_0142","68":"Diary_0142","69":"Diary_0142","70":"Diary_0142","71":"Diary_0142","72":"Diary_0142","73":"Diary_0142","74":"Diary_0142","75":"Diary_0142","76":"Diary_0142","77":"Diary_0142","78":"Diary_0142","79":"Diary_0142","80":"Diary_0142","81":"Diary_0142","82":"Diary_0142","83":"Diary_0142","84":"Diary_0142","85":"Diary_0142","86":"Diary_0142","87":"Diary_0142","88":"Diary_0142","89":"Diary_0142","90":"Diary_0142","91":"Diary_0142","92":"Diary_0142","93":"Diary_0142","94":"Diary_0142","95":"Diary_0142","96":"Diary_0142","97":"Diary_0142","98":"Diary_0142","99":"Diary_0142","100":"Diary_0142","101":"Diary_0142","102":"Diary_0142","103":"Diary_0142","104":"Diary_0142","105":"Diary_0142","106":"Diary_0142","107":"Diary_0142","108":"Diary_0142","109":"Diary_0142","110":"Diary_0142","111":"Diary_0142","112":"Diary_0142","113":"Diary_0142","114":"Diary_0142","115":"Diary_0142","116":"Diary_0142","117":"Diary_0142","118":"Diary_0142","119":"Diary_0142","120":"Diary_0142","121":"Diary_0142","122":"Diary_0142","123":"Diary_0142","124":"Diary_0142","125":"Diary_0142","126":"Diary_0142","127":"Diary_0142","128":"Diary_0142","129":"Diary_0142","130":"Diary_0142","131":"Diary_0142","132":"Diary_0142","133":"Diary_0142","134":"Diary_0142","135":"Diary_0142","136":"Diary_0142","137":"Diary_0142","138":"Diary_0142","139":"Diary_0142","140":"Diary_0142","141":"Diary_0142","142":"Diary_0142","143":"Diary_0142","144":"Diary_0142","145":"Diary_0142","146":"Diary_0142","147":"Diary_0142","148":"Diary_0142","149":"Diary_0142","150":"Diary_0142","151":"Diary_0142","152":"Diary_0142","153":"Diary_0142","154":"Diary_0142","155":"Diary_0142","156":"Diary_0142","157":"Diary_0142","158":"Diary_0142","159":"Diary_0142","160":"Diary_0142","161":"Diary_0142","162":"Diary_0142","163":"Diary_0142","164":"Diary_0142","165":"Diary_0142","166":"Diary_0142","167":"Diary_0142","168":"Diary_0142","169":"Diary_0142","170":"Diary_0142","171":"Diary_0142","172":"Diary_0142","173":"Diary_0142","174":"Diary_0142","175":"Diary_0142","176":"Diary_0142","177":"Diary_0142","178":"Diary_0142","179":"Diary_0142","180":"Diary_0142","181":"Diary_0142","182":"Diary_0142","183":"Diary_0142","184":"Diary_0142","185":"Diary_0142","186":"Diary_0142","187":"Diary_0142","188":"Diary_0142","189":"Diary_0142","190":"Diary_0142","191":"Diary_0142","192":"Diary_0142","193":"Diary_0142","194":"Diary_0142","195":"Diary_0142","196":"Diary_0142","197":"Diary_0142","198":"Diary_0142","199":"Diary_0142","200":"Diary_0142","201":"Diary_0142","202":"Diary_0142","203":"Diary_0142","204":"Diary_0142","205":"Diary_0142","206":"Diary_0142","207":"Diary_0142","208":"Diary_0142","209":"Diary_0142","210":"Diary_0142","211":"Diary_0142","212":"Diary_0142","213":"Diary_0142","214":"Diary_0142","215":"Diary_0142","216":"Diary_0142","217":"Diary_0142","218":"Diary_0142","219":"Diary_0142","220":"Diary_0142","221":"Diary_0142","222":"Diary_0142","223":"Diary_0142","224":"Diary_0142","225":"Diary_0142","226":"Diary_0142","227":"Diary_0142","228":"Diary_0142","229":"Diary_0142","230":"Diary_0142","231":"Diary_0142","232":"Diary_0142","233":"Diary_0142","234":"Diary_0142","235":"Diary_0142","236":"Diary_0142","237":"Diary_0142","238":"Diary_0142","239":"Diary_0142","240":"Diary_0142","241":"Diary_0142","242":"Diary_0142","243":"Diary_0142","244":"Diary_0142","245":"Diary_0142","246":"Diary_0142","247":"Diary_0142","248":"Diary_0142","249":"Diary_0142","250":"Diary_0142","251":"Diary_0142","252":"Diary_0142"},"Date":{"0":"unknown","1":1056.0,"2":1057.0,"3":1058.0,"4":1059.0,"5":1060.0,"6":1061.0,"7":1062.0,"8":1063.0,"9":1064.0,"10":1065.0,"11":1066.0,"12":1067.0,"13":1068.0,"14":1069.0,"15":1070.0,"16":1071.0,"17":1072.0,"18":1073.0,"19":1074.0,"20":1075.0,"21":1076.0,"22":1077.0,"23":1078.0,"24":1079.0,"25":1080.0,"26":1081.0,"27":1082.0,"28":1083.0,"29":1085.0,"30":1086.0,"31":1087.0,"32":1088.0,"33":1089.0,"34":1093.0,"35":1094.0,"36":1095.0,"37":1096.0,"38":1097.0,"39":1098.0,"40":1099.0,"41":1100.0,"42":1101.0,"43":1102.0,"44":1103.0,"45":1104.0,"46":1105.0,"47":1106.0,"48":1107.0,"49":1108.0,"50":1109.0,"51":1110.0,"52":1111.0,"53":1112.0,"54":1113.0,"55":1114.0,"56":1115.0,"57":1116.0,"58":1117.0,"59":1118.0,"60":1119.0,"61":1120.0,"62":1121.0,"63":1125.0,"64":1126.0,"65":1127.0,"66":1128.0,"67":1129.0,"68":1130.0,"69":1131.0,"70":1132.0,"71":1133.0,"72":1134.0,"73":1135.0,"74":1136.0,"75":1137.0,"76":1138.0,"77":1141.0,"78":1142.0,"79":1143.0,"80":1144.0,"81":1145.0,"82":1146.0,"83":1147.0,"84":1148.0,"85":1149.0,"86":1150.0,"87":1151.0,"88":1152.0,"89":1153.0,"90":1154.0,"91":1155.0,"92":1156.0,"93":1157.0,"94":1158.0,"95":1159.0,"96":1160.0,"97":1161.0,"98":1162.0,"99":1163.0,"100":1164.0,"101":1165.0,"102":1166.0,"103":1167.0,"104":1168.0,"105":1169.0,"106":1170.0,"107":1171.0,"108":1172.0,"109":1173.0,"110":1174.0,"111":1175.0,"112":1178.0,"113":1179.0,"114":1180.0,"115":1181.0,"116":1182.0,"117":1183.0,"118":1184.0,"119":1185.0,"120":1186.0,"121":1187.0,"122":1188.0,"123":1189.0,"124":1190.0,"125":1191.0,"126":1192.0,"127":1193.0,"128":1194.0,"129":1195.0,"130":1196.0,"131":1197.0,"132":1198.0,"133":1199.0,"134":1200.0,"135":1201.0,"136":1202.0,"137":1203.0,"138":1204.0,"139":1205.0,"140":1207.0,"141":1208.0,"142":1209.0,"143":1210.0,"144":1211.0,"145":1212.0,"146":1213.0,"147":1214.0,"148":1215.0,"149":1216.0,"150":1217.0,"151":1218.0,"152":1219.0,"153":1220.0,"154":1221.0,"155":1222.0,"156":1223.0,"157":1224.0,"158":1225.0,"159":1226.0,"160":1227.0,"161":1229.0,"162":1230.0,"163":1231.0,"164":1232.0,"165":1233.0,"166":1235.0,"167":1236.0,"168":1237.0,"169":1238.0,"170":1240.0,"171":1241.0,"172":1242.0,"173":1243.0,"174":1244.0,"175":1245.0,"176":1246.0,"177":1247.0,"178":1248.0,"179":1249.0,"180":1250.0,"181":1251.0,"182":1252.0,"183":1253.0,"184":1254.0,"185":1255.0,"186":1256.0,"187":1264.0,"188":1265.0,"189":1266.0,"190":1268.0,"191":1269.0,"192":1270.0,"193":1294.0,"194":1295.0,"195":1296.0,"196":1297.0,"197":1298.0,"198":1299.0,"199":1300.0,"200":1302.0,"201":1303.0,"202":1304.0,"203":1305.0,"204":1306.0,"205":1307.0,"206":1309.0,"207":1310.0,"208":1311.0,"209":1312.0,"210":1313.0,"211":1314.0,"212":1315.0,"213":1316.0,"214":1317.0,"215":1320.0,"216":1321.0,"217":1322.0,"218":1323.0,"219":1324.0,"220":1325.0,"221":1326.0,"222":1327.0,"223":1328.0,"224":1329.0,"225":1330.0,"226":1333.0,"227":1334.0,"228":1335.0,"229":1336.0,"230":1337.0,"231":1338.0,"232":1339.0,"233":1340.0,"234":1341.0,"235":1342.0,"236":1343.0,"237":1344.0,"238":1345.0,"239":1346.0,"240":1347.0,"241":1361.0,"242":1362.0,"243":1363.0,"244":1364.0,"245":1369.0,"246":1370.0,"247":1371.0,"248":1372.0,"249":1373.0,"250":1374.0,"251":1375.0,"252":1376.0},"Entry":{"0":"\n\n \n\n \n\n1916\n\n","1":" Sailing. S.S. Afric A19.\n\nDestination unknown. Sneaked away from Show Grounds at 2 am morning. Band playing Terrible secret Enemy must not know we are going. Sat on wharf till nine, then on Board, no Breakfast. Anchored out till noon. They called it dinner. I reckoned we would miss Bathurst and Liverpol Camps.\n","2":" Easy day. No body knows what is doing. Very few details Fatigues Etc.\n\n5 Thursday Men divided in sections drill again dam funny trying to keep in line with the old tub rolling I scored a Good Job. Capt of Mess Table and one of my 12 was a Canteen Assistant. I made good with Ship’s Butcher. \" Ducks Etc\" Cooked and Stuffed","3":" each\n","4":" Adelaide, a great many Broke away. We were taken a route March. no leave. Pubs Open was the reason.\n\n \n","5":" Leave. Granted for about 8 hours 2 till 10 P.M. S.A. soldier’s came aboard in morning no leave granted them, Pub’s all shut. At Adelaide 5\/- each man got from an chap. Sells Poetry. Good Feed and Free theatre’s. Plenty of side door Beer V.A.Ds Glorious each day.\n","6":" Sailed 3 a.m. a couple of hours sleep. Reveille Hurts. Two of our Batt desert Murphy & William’s. Church Parades and Concerts etc.\n","7":" Steering direct Durban. I am made regimental Barber. No. Parade. 3d a shave Have to put clippers over head only free to my Battalion\n","8":" Pointer’s are beginning 250 on sick Parade. Afraid of fatigues Heavy work getting out supplies. Sailors asked to do anything Soldier’s made scrub decks etc. seamen resting. Cause’s discontent M.P. appointed\n","9":" Wilson Sgt of M.P’s recognized as man who killed a man when Porter at Salvation Army , threw him down stairs He gets a rough time all day.\n","10":" Thur’s. Lt Col Dean very severe on the Fines a Couple of ships Passed\n","11":" Business good in Barber’s shop other Battalion’s starting opposition I have to get an assistant. Cost &pound1.0.0 to A.B. Wadsworth our Lt. We decide to Partner & he buys his own Razor’s We do well early of morning.\n","12":" Had a good win at Banker, Gave it Mr Bell Y.M.C.A For Durban\n\nNo Parade everybody wants shave Cook stop’s hot water supply Sailor’s selling rum 8\/- a Flash Night increased to 10\/- Beer is 2\/- a Bottle. Steward’s selling our Tucker and Tea Coffee etc. trouble\n","13":" Church Parade etc nothing sensational\n\n \n","14":" Soldier’s fined for abusing Steward’s Cook’s Etc. They still sell Cooper Etc at 6 a mug. 1 Bun\n","15":" Competitions starts. I win Both. Heat’s Chess and Draughts also am Training 3 Pug’s, Fletcher Eather & Stanley. Fletcher is good one of skuthorpe’s old Buck Jumper men. Enters for Heavy & Middle weight.\n","16":" Harvey. Church England Padre organizer Boxing Catholic Preist Time keeper Lt Pettit Official Referee Fletcher meets Cooks, Heavy 1 punch with Eather Bantam Beat Feild on Points Feild licks Stanley K.O. not too bad two wins to start\n","17":" I win 2 round chess. Raining Indoor Games. Concert in Saloon we nearly Smothered in Hold’s Win again Draught’s tough game M.P. Sgt ?lassoed & Hung up was nearly choked before release He is a character cannot read or write, yet is made sergeant of the Police. Fun over lights out Spoils nap and Poker School’s\n","18":" Doing splendid with Barber’s shop. Cut C.Os.Hair Dr Stewart and Shaved a nurse Comfort fund’s Pay me to shave all Hospital Patient’s.\n","19":" No Parades, Saturday, sport’s. I win rope quoits out right Fletcher fight’s Conquest. He knocked the Preist out with a Back Hander meant for Conquest Preist very fat. S.A.Army captain recovered, sea sickness good sport Fletcher wins Middle Weight also a Fiver. I get 30\/- Officers win a lot give us nothing only a whiskey each. Eather wins 2nd Heat\n\n \n","20":" More church all want two up Banker Etc. Names taken for dodging Concert’s & Deck Games Put in day. Saloon open till 9.\n","21":" Gen. Excitement close to Durban Passed Wreckage supposed Submarine’s also Several ship’s our Troopship one Hospital ship. Plenty fine’s about for Dodging Parade’s.\n","22":" Strike on in Canteen men want extra money for working late hours. 9 p.m. soon over. I win Chess Competition £1.10.0 Eather win’s Bantam Champ. A Good War Baby. Only 18 old.\n","23":" Girl Signal’s us Welcome to Durban Looks pretty Place Anchored out 2 hours after have to Pay 6d each way to go ashore on Lighters. Marched around Town\n\nWed 25 continued Marched back. Paid a 1\/- to Parade Durban\n","24":" General clean up Inspection etc. 2 PM. Fall in march Durban Pub’s shut We visit Durban Camp Canteen sell But must have own Dixie. Plenty of Beer at camp. VADs as at Home splendid treat\n","25":" Gen. leave Go to Baths Get Rickshaw’s my Coon a good Trotter. Beat Salvo’s Capt easy enjoy swim. Go to city with the S Army Capt get Photo taken in Rickshaw to gether. Visit Market’s. Black Policeman wants us to go to Brothel No good to Army man\n\n \n\nHe goes to Army Officer to Tea I meet a Lady I knew in Melbourne Enjoyed myself. Buy clean clothes Post correspondence etc. Met the Salvo Captain again have a walk around with him. Saw a Kaffir woman confined in Gutter. Horrible Hardly any notice taken. Niggar Hawker’s a Pest. Good entertainment at Y.M.C.A. V.A.Ds and Tucker good. Swap Card’s addresses Etc\n","26":" no leave taken along Beach Route march lay in very hot sun for hours Biscuit’s and Bully for Lunch waiting for coaling finish\n\n28 Sat continued\n\nPaper settled. have raided the Adjutant’s tent good man Mr Tait (Adjutant) He let all prisoner’s out of clinck to see Durban. Col. Dean very tight on return sailed at 8 PM for Capetown.\n","27":" Usual Church Concert. Gambling Etc.\n","28":" Saw more wreckage Floating Past a Convoy Troop’s going to Mesopotamia, Very rough and Cold. Water scarce have to wash ourselves in Salt Water. Use Coal Tar (Dog’s Soap) To get a Lather. I won the Finish of Draughts Tournament Fletcher Broke his hand in Heavy weight Fight against Big Stevenson. Stevenson is very clever a Policeman from Orange also on Board is popular\n\n \n\nOfficer’s oblige the skit with a Concert as advertized Verdict \"1 to 10 out\"\n\nSinging Competition start’s Beveridge Silver Tenor a surprise\n","29":" Every body Back at duty again Still Cold and rough. False alarm of submarine was only Gun Practice. Min. Rifle Range Put up. Terrible Poor shooting. German’s need not fear. Lt. Owen Best shot so far I have a row with Corp Baskiville tell him Ill make him say Three \"Hail Mary’s , before done with him. Fined 10\/-\n","30":" Raining no work Cannot even open open air Saloon. Play Nap & Banker all day. Lost a \"Quid\" Take up a Collection for our Mess Fund’s get a special Blow out From the Butcher Living very high so far. But funds are Scarce. Only our Pay of 10\/- is to be Given till England. Big row over no sugar in Porridge. Col. Say’s Aussie too sweet a Tooth. in two or three Hundred Year’s you will have no teeth in your heads. He is Believed\n","31":" Thur’s Still raining but not so rough. Chance Cold and Rain for fresh air The Hold we occupy stinks awful The \"Quack’s kept Busy give Cough dope. Old Routine of Card’s Nurse’s organizing a Concert we hear rehearsal. Decide to stick to Card’s and Gramaphone. Also old Bill Smith the Shearer with Violin. Jack Thompson with the man from \"Snowy River I forgot the last Verse\n\n \n","32":" \"Beveridge, Best Singer Perkins Best Comic L. Holmes best Liar (special Prize un.catalogued McLeod & McMillan cut the Recitation.\n\nA Raid made on the M.Ps at Light’s out. They won they took the Switch lever away\n","33":" Capetown in sight We thought we would get leave but we anchored out and stopped there longing for 4 day’s a few bought a seat from the Sailor’s & Hired their Clothes and got ashore General discontent the \"Book\"Full\n\nNo interest in any amusements. No business even in my Saloon. \n","34":" A Boat Tank came along side and Brought fresh water and Pumped it in on us. As soon as that was done We sailed, was not sorry The old routine began although the men were a bit more cheerful\n","35":" We sighted Simonstown and East London little Sea Side Places. Pouring Rain & Very Cold all turned in early.\n","36":" Was surprised at \"Reveille to See the Spires of Capetown again. The Boat had Put about thro’ the night. All Routine was suspended and it was amusing to hear the conjectures as to why? The favourite one was we were chased by a Submarine. We Anchored again for an hour and then went out again we were none the wiser\n\n \n","37":" Still Wet. No Parade’s popular But Lectures are to be given. On orders Posted up. We are given a little War news by Marconi Also full acc of \nMelbourne\n (Sydney) Cup is sent along creates more interest than war.\n","38":" A Submarine Guard is placed. Church Parade Etc A Burial service held over the Food. Bugler excelled Himself on the last Post. It ought have been the Cook. The food was Beautiful if only cooked well. Passed several Boats one a P & O Mail Steamer Going to Australia. Brought longings & Regrets.\n","39":" Lectures & Flag Signalling began. Men Pleased at break in the Monotonous forms Fours form two deep. Right Etc. A Dopey chap named Stettler surprised the ship with his remarkable shooting at the Rifle Range. !st Prize\n","40":" The men are very interested in a new stunt a Prize is Put up for the Best turn out of the Guard Full dress. Shorts Etc The 54th won Credit 1st day\n\nThe Submarine Guard not Eligible as it is Permanent The Nurses Concert Held, Men were forced to attend. Those that missed were fined 10\/-\n","41":" Saw S.S. Orotava, P & O, she is now Auxiliary Cruiser & is our Convoy. Passing Transport’s Coal Boat’s Sailing ship’s of all nation’s but Germany. Also a lot of Wreckage. Now we see two destroyers one on each side. The \"Orotava\" keep’s on darting ahead and Zig Zagging about to see if our track is clear\n","42":" Sieia Leone Hill in Sight Freetown is name of town as Fort is showing her Gun’s at us\n\n \n\n17 Continued. This is the Gold Coast Called the white man’s Grave. We were there two hour’s and told to fill our Water Bottles with Water take our own Ration’s and granted leave The dirtiest Hole ever I went to yet there are some pretty spot’s a Few mile’s out it is Populated by a Bastard Breed of Portoguese & English & Kaffir Mixture. It is hard to classify them\n","43":" Ashore again. not much to interest. We met a lot of the men who were on the Port Lincoln Transport that ran aground there I knew a great many at Liverpool They were dying to get away. Some had been there 10 weeks no Pay & no Tobacco\n","44":" Had to coal the Boat ourselves working all day at that. Fresh Water shut off, we had to Bath in Salt could not shift the Coal dust any how.\n","45":" Same as yesterday\n","46":" four more Transport’s pull out with us. We take as many of the stranded Port Lincoln men as we can, and continue on to \"Dakar\" We are now convoyed by a French Battleship. She is a Beauty. We are now about the Equator and the heat is awful we get ½ Pint of lime juice Given us. The Boatswain is Fixing up \"Neptune’s Bath.\n","47":" The Bath is Good The Nurses start mixed Bathing. A Sad Fatality Occurred. Corp. Ward of Grenfell dived and Broke his neck Diving Forbidden the Col. say’s its dangerous Funeral 2 hours after death. A Hat was sent round £264 for his Widow I hope she gets it. I don’t trust Col. Dean Owing to Death in Family & Heat all amusement’s cut out.\n","48":" Crossing line very amusing. The Colonel is no sport though. Going to crime the men that Ducked him he disrated L. Corp Boon for it on the spot Ship’s Capt. Secretly delighted at his discomforture. Of course the crew was exempt, but I scored a good one when I captured the cook and\n\n \n\nWed. Continued\n\nand made him eat a plate of his Curry. Even \"Old Dean\" had to Laugh. The Rest took it all in good Part especially the Nurses. We forgave them about the Concert. But Porky Wilson the M.P. Sgt. he got an extra special Father Neptune\n","49":" We are making Record Time and expect to be at \"Dakar Senegal\" on the 28th Parade’s are off it is too hot to even play \"Nap\". The Cook’s are Preparing For \"Christmas\" They have nearly all the soldier’s as Fatigues. A prize is to be awarded to each Deck for the best decorated Table. Our Twelve are still Financial and we get a Fiver together We order Pork. Duck’s Fowl’s Fruit Tinned is to be had at the Canteen. The Butcher Promises us a ½ Doz of Beer at 2\/6 a Bottle. We are to receive a Bottle each as an issue We get cakes Etc through the Baker one of our Mess took a Job with the Baker’s so we were set.\n","50":" Church Parade. Then a General Muster. The Col read’s a Message From George R.I. it is received more with or as a Joke than as a genuine Message The S. Aus. Got the Prize for the Decoration’s and even the Capt. of ship congratulated the Mess Orderlies. It was good & also surprising how they got the Flag’s Tinsel and Colored Paper Etc to make their Display Our Dinner was a great Success but we had to dine late. Waiting for the Head’s to go\n","51":" was devoted to all round Tournament’s Cock Fighting Etc. One man a Russian got sunstruck and Jumped Overboard. He was picked up in 15 minutes He in fact we all had to wear life belts That kept him afloat.\n\n \n","52":" Church Parade & Gambling Food getting Very Unsatisfactory Lovely Legs of mutton spoiled Boiled in Salt Water A Royal Commission to be held to-morrow.\n","53":" No Parades in Tropic’s Thank God no human being could Stand it. The men were like a Fowl yard show Head down & mouth’s open Even Amusements were cut out. It was hard to even get a man to wind the Phonograph. Arrived at Dakar at noon Anchored out, no leave\n","54":" & 30 Tuesday. No leave. Boat Races arranged. The 58th won. The 57th 2nd W.A. Third Spent the day Fishing some good sport but the Fish was Foreign to me different to our species. At night We sneaked a Boat and rowed to \"Dakar\"\n\nIt is a very nice Place and the French People gave us a great time of it There are Some Beautiful Building’s also.\n\nWe paid a \"Niggar\" to take the Boat Back and say he found it Drifting if he was caught tying it up. So we stayed the night and the next day about every-where Went all over the Fort along the Marine Drive’s and out in the Country a Bit. It was Glorious. About midnight we hired Boat’s & Coon’s to Bring us Back We had Fruit and Luxury’s untold. Champagne 3\/- a Bottle Whiskey Flashe’s 9d. Bottle’s of Martel’s Three Star only","55":"\n\nWe got all aboard safe It was too hot for a watch and the Harbour had a Submarine net across its mouth so it was easy after all\n\n \n","56":" Other Transport’s waited outside and we Picked up Anchor and Started for England. Supposed to be 10 day’s trip. We now had to sleep prepared for an attack From Submarines We saw a lot of wreckage Drifting and one of the destroyer’s Picked up two Boat Load’s of Seamen From a Torpedoed Spanish Collier\n","57":" New Year’s Day (1917) We are now passing the Verde Islands or Some of the Canary Group. No one will enlighten us. The Guards are sharpened up. Boat’s are swung out on their Davit’s and we are Penalized if we are 2 feet away from our life Belt’s\n","58":" Lectures are beginning again. Nothing else interesting\n","59":" The usual Church Parades & Gambling. A Fleet of Destroyer’s 8 in all have Joined us on either side\n","60":" We are now getting into the cold Weather and wet. Parades are stopped every Body is on Pin’s and needle’s in expectancy of our arrival in England. There has been nothing outside of the usual Routine to report\n","61":" Just a Similar matter\n","62":" No alteration unless something occur’s I will not bother entering.\n","63":" At Church Parade. The Solemnity of the Service on Deck was disturbed owing to a Fight between one of our men and the Cook (ship’s crew)\n\nThe soldier was Fatigue and he helped himself to the Carpenter’s Breakfast and the Cook tried Corporal Punishment on him. Poor Cook, it Beats me how he can see to do his work\n\n \n","64":" \"Snowing\" We are ordered to throw old Dungaree’s Etc over Board And get our Kit Bag’s to gether And Have a Kit Inspection. We then had to be all shaven ready for the Morning as we were expected to Land at 10 a.m. next Day. At 10 P.M. Our Boat stopped and the Convoy left us. I do not know what went wrong. It was supposed to be Engine trouble But we were 12 hour,s Behind the other’s by morning.\n","65":" We are travelling Very Slowly as if we were crippled, guard’s are doubled and we are going about 6 or 7 Knot’s per Hour. We cannot understand 10 PM at last we are at Devonport. We disembark at Devonport then on the train for a place called Dinton. We are warned we must keep the Blind’s down and not show a sign of a light. We travel about 3 hours and stop at Exeter we are given Coffee as much as we can drink and as many Bun’s as we can eat by the Mayoress of Exeter. It put Fresh Heart in us, we were cold\n","66":" Arrived at Dinton, Pack all our Kit’s at Station and have to Stand on Ice for an Hour Till a Guide took us to our Camp at Hurdcott. We got to bed at 4 up at 7 again and was given the day to get our camp in Order.\n","67":" Frost and Ice underfoot & thawing the Water from Pipe was strange us Yet we were very comfortable. We began Drill again & it was learning again. The drill in Aus was nothing. We are in for the Business now and had to learn to fight. Tucker is not the best & Scarce. We managed a few Trout with the aid of the Officer’s Tennis net. 4 P.M. Tea and General Leave 4.30 P.M. till 11 P.M. Late Passes issued if for Salisbury. We made Wilton our Fancy\n","68":" Same old physical jerks They only make a Middle aged man stiff and sore. Drill Etc.\n\n \n","69":" Only Half Day to day. Drill General leave till 11 P.M. Week End’s Granted For Salisbury & Shaftesbury. Football Matches Arranged. I saw my first glance of an English fox Hunt. I was amused at the Horsemanship, a Slow Canter was the Fastest speed I saw The General Pace was a trot behind the Beagles. Theatre at night. Hotel’s open at 12.30 till 2.30 p.m. and close. Re-open at 6 P.M. and close at 9. 5 hours a good scheme. Smoking in Theatre very good also\n","70":" Usual Exercises. Shave Etc & Church Parades. Afternoon Leave Pub’s open on Sunday’s\n","71":" Draft’s leaving for France They had been here 3 month’s. Usual drill General leave at night At Present am not too highly pleased with what I saw of England. Cold & sloppy. Snow 2 ft deep. It was pretty to see the snow but no Good to our System’s after our Lovely sunshine\n","72":" The Usual Routine \n","73":" Snowing too hard to drill The Col’ sent us into Hut’s For Lectures. Col’ Jackson Challenged anyone in the Training Battalion to Fight him for a £10. We got Lynn Truscott But he was too old. Jackson won in 6 rounds \n","74":" Still Snowing An indoor instruction of Musketry Sick Parade’s increasing Pneumonia Prevalent Cold’s Prevalent\n","75":" Usual Church Parade’s. Obtained Leave. Went to the C.E. Cathedral at Salisbury a Beautiful Edifice a Window for every day in the year. After Service Visited Stonehenge and went to a Café for Dinner Cost 3\/6 for dinner not as good as a 6d one in Sydney. Glad to get Back to Camp out of Cold\n","76":" Have joined what is called the Lead Swinger’s Viz sick Parader’s. Am ordered to Bed for a few day’s. Better than out in the Snow. Poor Ferrier of Katoomba died at Fovant Hospital. I am looked after well.\n","77":" Am Convalescent. Doctor wont let me on Parade so I am given a job to look after a Drying room. A 20 x 12 Brick Room 10 ft ceiling gas pipes 9 in apart under Ceiling to put clothes on. A Coal stove each end. I label each man’s clothes and they dry Quickly.\n","78":" I buy a Smoothing Iron and do well pressing Officer’s and Sergeant’s suits. They want me to start a Laundry. Soap is scarce in Camp though\n\n \n","79":" Close up shop for day at 2 P.M. go to Wilton. Buy soap and Blue. Can do alright. Wet & cold beastly weather. Saw 25 Aeroplanes Flow over Just like a lot of Wild Duck’s. We learn how to catch Pheasant’s At School of Arts’ Wilton I meet the Game keeper from Hurdcott house next to Camp. He is Champion of Wiltshire at Draughts. I win from him. Invited to dinner Sunday.\n","80":" Am Delighted Mr Davey & Family splendid am shown all over Sir H. Bakers place it is Beautiful. His Farm Laborer’s are all girl’s Found them interesting. Am told come and go without any ceremony and at any time.\n","81":" Laundry in full swing finished the day 11\/- Profit\n","82":" Arthur Brown Put in the Drying Room next to me. We go into Partnership Business Booming\n","83":" No Parades every body to see the Doctor and then get ready for leave 4 day’s to London any going Scotland 6 Ireland 8 I got 8 day’s but hang Ireland\n","84":" Up 4 breakfast 4.30 Inspection Catch train Wilton 6 London 11.30 First call Bank. Got Lodging Lambeth with People, Armstrong Miss Armstrong very good is pilot for me. 12.30 Midnight tired out\n","85":" Up early go to Covent see Market’s a Drink to be had early owing to Gardner’s. Had Breakfast at Covent. Went down to Holborn. Had a look West minster & Horseferry Road. Back to Lambeth got my guide out of Bed saw Windsor and Buckingham Castle’s Went out to Clapham and dodged here there and every-where From the Tower to Mdme Taussards Waxworks. Another Tired Feeling\n","86":" Up early go out for a walk. See a Digger Curled up under a Hot Pie Stall. Got full and no cash left. get him to where I lodge give him a Drop From Flask. Make him shave and clean up. A feed and I hardly knew him. It was a difference. I give him a few bob to go to Horseferry Road and make a draw. Surprised he came back at night and paid me Paid for his Breakfast and went to Y.M.C.A. to stop. Went to Chu Chin Chow, Oscar Ashs Theatre \"Magnificant\"\n","87":" Went to Mass Westminster Wonderful Pomp and Ceremony Cardinal very poor preacher\n\n \n\n5 Sunday. Continued. Took a Tour all over Hyde Park. Fell in with a Party and saw all over the King’s Mew’s (Stables) got into a row, Pulled a few hairs out of a Horse’s tail. Afternoon late went river Excursion. Enjoyed scenery on Thames.\n\n6 Mon. First call Bank, a Fiver dont last long here. 2\/6 a bed Meals","88":" where I stop if outside costs 2\/- and go to two places to get a feed owing to rationing. Am having a General Top of Bus look around London & the Palladium at night\n","89":" Have had a Great day cost 3\/- to go up in Airoplane had a good trip to Brooklands. Was invited with a party to go to Lady Yoeville’s City Mansion. Home at midnight. Only mates I saw is men with Scottish or Irish Leave Passes, like myself. Rest gone camp\n","90":" Earl Pembroke allows a Look at his Picture Gallery. And Fisher Let us have an outside Veiw of Australia House. Saw War Red Cross, Y.M.C.A. Union Jack Club. My Pilot Knocked up. Had to Battle about on my own all day. Got nearly \"Blithered\"\n","91":" Had a lay in, the Pace a bit Fast. Went around Bond St and out the Old Commercial Road to the \"Bostock\" Circus. Not as good as Werth’s\n","92":" Last day here. Get my Guide a Brooch. go to Bank again. And Theatre in Afternoon. Out again and see Henry VIII played. Pack up Parcel’s post letters & things home and start for Camp. 12.15 Midnight train get to Wilton at 5 and Camp at 6. I have a Flask and that Square’s the S.M. He gets me a week end pass for Salisbury\n","93":" Nothing in Drying Room. So have a sleep just back from Smoke 2 P.M. start for Salisbury. Old Game keeper come’s with me. Learn all about the History of Salisbury See the Tichbourne Estate \"Davey goe’s Home\n","94":" \"No Church Parade\" Had a lovely sleep was settled after my 8 day’s London trip Usual dodge about Salisbury and Bed at Midnight.\n","95":" Work starts in Earnest now. Bayonet Fighting Trench digging. Rifle Practice. Signalling every thing solid. I miss this. Have only 2 hour’s daily \n\ntoo Valuable in drying Room.\n\n \n","96":" \"Porky Wilson\" M. Police surprised the Camp. Married the Cook from the Pommy Canteen His wife in Aus’ only two month’s dead. Weather fine now but Cold. The German Prisoner’s have to clean Camp up. They are road making and levelling off and Greatly interested in our method of Instruction. Go to \"Davey’s\" place at night.\n","97":" A visit from the Cheif General Sir Newton Moore. The usual yarn. Fine body of men. A row over Y.M.C.A. putting 2d Tax on Cigarettes Etc. Was unfair, it was only Proposed to Tax in June They are Boy cotted Officers Had a Mock Court Martiel on the Official Head and sentenced him to live at Y.M.C.A. instead of Officers Mess.\n","98":" Slightly warmer & Ground not so sloppy. Usual Drill all day\n","99":" Similar to yesterday\n","100":" Drill till 12. Foot-ball matches Men now Getting very fit Our Battalion got Beaten by 33rd Batt Was Umpire. \"No More\"\n","101":" Church Parade, Tommy Concert Party in Afternoon. While concert on Barrel of Beer Pinched From Canteen (Mr Nobody)\n","102":" Ploughing Block Land to sow \"spuds\" Other’s digging Vegetable Gardens. Vegetables very scarce. They are robbing the Cow’s of Turnip Top’s to make \"spinach\"\n","103":" Gardens all ready. Back at drill, War Babie’s muck up, won’t drill not allowed to go away till of age Whole lot made Mess Orderlie’s Batman, slushies etc.\n\n21 Tues. Usual day at drill. Beginning Machine Gun Lecture’s at night. Objection’s to losing Leave\n","104":" Old Routine. Machine Gun School opened in Leiu of night instruction. Bomb Throwing Lesson’s with live Bond’s One slight accident\n\n \n","105":" We are catching it now. The time is getting close for some of us to be sent to enquire about Fritz. We have been about all day like a lot of \"Ghouls\" Gas masks over our heads to get used to them. 1st hour I felt inclined to Vomit. Yet use is next to nature. We lived it out. But were glad to take them off. Reverse’s are coming in From France and work is going hard. They are putting it on now in the Moonlight.\n","106":" We go through a prepared Room that is Gassed, a few got a small dose of it through Faulty Masks and also thro’ neglect in fixing them on. The Weather is Dry now and the ground is Frozen hard But it is nothing to see a man shoot out equipment & all on a lump of ice. In Parts it is like a skating Rink.\n","107":" Per. Special Invitation of Lady Wilton (Dowager) her Palace at Wilton was Thrown open for us to look over. It is very Beautiful, and the Heirloom’s & Armour’s Weapon’s From the Old Tudor Period were many and very interesting. But how we were watched. They still think we are Convict’s\n\nTheir Ignorance of us is Woeful. We Finished the night by an entertainment given to us by Mrs Lena Ashwell was good.\n","108":" Any one who had cash or chose was allowed to stay in Wilton Last night and have Sunday any where Salisbury out of Bounds So no Church for Your’s Truly a good Lay in instead and actually Breakfast in Bed, Got up at 11 a.m. I met Sir William Rawlence going home to Bulbridge Park after Church and he was good enough to invite me. He seemed to take a Great interest in Aus’ & our Framing & stock raising System’s. But I astounded him when I told him Sydney Kidman owned or held 1,000,000 square miles of Territory for stock Breeding. Tall but true. His is a Lovely place. But his \"Dog’s Cemetry\" took my eye. Memory of FIDO Faithful to the Last Etc over about a dozen of them. I enjoyed his Poultry for Dinner and also his afternoon trip in the Car.\n","109":" Our Surmise is correct. The first 25 From our ReInforcement is picked and go on Wednesday. They are Given 24 hour’s Leave and then get special equipment and go to France. We are kept hard at it and our turn is not so far away.\n","110":" Same old hard graft.\n","111":" Leap Year Y.M.C.A girl proposed to me. I bought her a box of chocolate’s instead She scored about 30 I hear\n","112":" Too wet for Parades Lecture’s all day. V.D. Lecture in afternoon by Drs & Clergy.\n","113":" am sent to Burford V.D. Hospital as guard Heaven’s it’s awful to see the poor wretches sufferings Officers, Clergy are inmates I’ll be glad when my week expires. The N.Z. Artillery are 1 mile away at Park House. As many Planes here as Bars, a very large Avo’ school\n\n \n","114":" On Guard last night. Have day off go to Lark Hill to see a mate in Carmichael’s Thousand. Had a good day among them Just got Back in time to Mount Guard\n","115":" Usual Church Parade. We were exempt after Guard. Put in day in Camp reading sleeping Etc.\n","116":" Inspection. Fined 2\/6 twisted Chin Strap. Mounted Guard more sleet when shift was over was very Glad.\n","117":" Went to No 1 Aus’ Command at Perrim Downs had a look at Tidsworthy and Back in time for Guard.\n","118":" Same routine. Two Funeral’s From the Hospital. An Aviator got a spill but escaped. Some of his machine is good kindling wood.\n","119":" Discovered a Frozen Pond Had our first go on ice skate’s soon got the knack. Wonderful how it warm’s a Person. Ladies From different Part’s or Farm’s came down used to Bring Tea & Cakes\n","120":" Usual Guard Then skating Big Boxing match on at Stadium Johnny Summer’s gave Hughie Mehegan fearful Thrashing in 6 Round’s. A very Popular win Mehegan a Military Policemen\n","121":" Last day of Guard. 1 day’s leave and Back to Hurdcott\n","122":" Had 24 hour’s leave. Went to see Shaftsbury it is a Fine old town and the Drive out in the Motor Bus 14 miles was worth 5\/- return. Our Band was engaged to Play in the square on Sunday Afternoon’s Alternate with the No 9 Training Batt’s Band. Enjoyed a very Pleasant day\n","123":" Back on the old Double up Form Four’s Etc for ½ Day. Bomb Throwing & Signalling the other Half. Another draft going to night. 15 From each of the 7 Battalions Training\n","124":" A Day weeding the Garden. We borrowed the German prisoner’s from their Conscientious Objector Guard’s . But our Officer’s would’nt stand it so we had to do it ourselves\n","125":" Same old Drill Etc.\n\n \n","126":" Had a trip to London to escort an A.W.L. prisoner Back But only had 2 hour’s there was up at 4 a.m. & in Bed 1- 40 a.m. next day.\n","127":" Was allowed to sleep till Breakfast, then attend Court with our Bird. He got 14 days Field Punishment 20 days of his pay Robbed.\n","128":" Cricket begin’s. it is day light now till 8 p.m. It seems funny to see Daylight so late. Am beginning to like England now it is getting Warmer and our Camp is in Glorious Country.\n","129":" Church parade. A trip to Broad Water in the Afternoon Finished at night Poaching Rabbits\n","130":" Beautiful Weather now it makes a person glad to be alive. Men are getting very fit and lusty looking for fight now Another Draft Picked\n","131":" All ordered a special clean up. Full Pack Etc. to be ready. We wondered But was not told any thing\n","132":" Up at 5 Breakfast at 5.30 quick march at 6. Going a Route March to Bulford. King’s review\n\n21 Wed. Continued. to be held there on Thursday. It Poured Rain all the march. Went through Wilton & Salisbury. Camped at Rolliston. No Blankets and Dry Ration’s we boiled Tea.\n","133":" Fall in we are all Wet & Cold Hardly any tucker. March on to Bulford Still Pouring Rain. It was not \"God save the King sung. We got to Bulford on time and we had a great feed. We fell in for the Review. The Duke of Connaught represented the King. Sir N. Moore and General Mackay with him Moore spoke ½ an Hour Mackay also Connaught \"Fine body of men I’m sure. Owing to Wet dismiss. Hoo Ray\n","134":" Those who could Pay fare’s were told they could go back by train So not relishing 19 mile more of it, I lit out for the Station and had a good day in Bunk.\n","135":" Glorious day. Men not Back yet only about 40 of us in Camp so get a day off. I went to Dinton. Got adopted there and did A.1\n\n \n","136":" Church Parade Too wet to go any where or do any-thing. Sing Song’s in Canteen’s Favorite\n","137":" Col Jackson called me off Parade and handed me a letter of invitation to play a serie’s of Game’s with Wilton School of Arts. Chess, Card’s Dominoes Etc. He gave it into my Hand’s & I Picked a Team. He gave us leave from Parade to Practice and Bought us Board’s Etc. We won the contest and He was very pleased.\n","138":" More Drill Etc. Some cow got among our Radisches and it was Suspicious it only took Radisches\n","139":" Nothing doing. Watch set for the Cow.\n","140":" Drill all day. The Hut Orderly reported the cow was our Lt Levy with 4 Cloven Hoofs. Officer or not he had to ante up. It cost him a 10 Gal Keg to square Dear Radisches\n","141":" All day on the Rifle Range\n","142":" Fool’s were made of us all. Pack’s Etc Rifle’s everything was ready. Fritz was supposed to make a landing. We flew to it. The seargent’s nearly went mad excited\n\n1st continued. all in readiness. We were ordered to stand by for orders. The Officer’s came and told us to put our Pack’s away you \"Darn Fool’s\" We did & then fell in and then marched out of Camp to Wilton.\n","143":" My first Guard in this Camp. I prefer it to the droning old Padre on Church Parade. I am here now for 24 hour’s.\n","144":" Off Guard Off duty. Go fishing. My Friend the Game Keeper lent me tackle and Put me onto a Pool. English rivers are very shallow. The deepest I saw was only 6 ft deep. The water very clear of course except the Thames. I got 8 Beauties. I gave Davey two & sold the rest 3\/- each to the Officer’s Mess. I went back to the Game Keepers for Tea & he & I went for a \"Joll’o’ to Barford St Martyn’s\n","145":" Another Draft, Going to night We can miss our chum’s now. Our Family is getting very small. The 8th Re inforcement’s are expected in a day or two then we will soon get a start The War Babies are to be kept here till they are old Enough \n","146":" A Day among the Machine Guns Concert to night Very good, Some good Talent come here\n\n \n","147":" Kit Inspection I was one Pair Boot Laces short 1d entered in my Pay Book and a new pair issued. We have had our Christmas Billy’s given us I scored cigarettes Etc. and ½ Quid in mine\n","148":" Another day at the Rifle Range\n","149":" Machine Gun Work & gas Masks Cricket matches against Warminster\n","150":" Church Parade & Concert’s\n","151":" Usual drill\n","152":" Had a day of Field Skirmishing\n","153":" Pat Wilson Buried. one of the Firing Party.\n","154":" Usual drill\n","155":" Ready for Draft\n","156":" Taken off Draft I was the oldest and there were 2 over strength had a Holiday\n","157":" On Guard\n","158":" Applied For 3 day’s leave & got it. Bee line London\n","159":" Having a good time Met Col. Jolliffe, Got leave extended one week \"I’m a good Tale Teller\n","160":" to","161":" Go to Scotland. Beats London Bad. Edinborough Great\n\nBack to London & Put in time till due at camp.","162":" \n","163":" Back quite fresh but had to toe the Carpet The S. Major did’nt know I’d had extended leave. But soon Learn’t\n","164":" Again on draft. Have every thing ready. Dr says are you alright. I say yes alright His Exam Over, I am away this time. Staying Folkstone the night All shifting is done in night\n","165":" In Bologne then Etaarp’s Camping there All the rest here never fired a shot.\n","166":" More drill, This is what is call the Bull ring\n","167":" This is solid Craft. Ive been learning how to carry Duck Board’s all day. The Practice is hard. The Dinkum will Kill a fellow.\n","168":" Church. must have that French People pleasant very immoral\n","169":" More men arrive not many left be hind now\n","170":" No Holiday for us plenty of it to do.\n","171":" Same Drill all day\n\n \n","172":" Sent up to Albert’s & Bapaume, not much Fighting Here.\n","173":" going to Bullecourt. We caught up to their Rear Guard Our Advance Guard settled them without us having a Look at them. Then our turn came We entrenched out on the left of Village and had a little rest. An awful Cannonade woke us it sounded like a Million clap’s of Thunder at once. We were Pulled to-gether and made Hop over. Poor old Dooley & Perkins Killed. I am Blood splashed But not a Scratch. I was an Absolute Mad man. I went with my mates don’t know what I did or said Scotty McMillan got it in the Ankle, I got a crack in the neck and had to take Mc to the dressing station. I was made stop there\n","174":" I am very sore and away from the noise. The re-action set in and a cried for hour’s My mate’s arm was Blown into my chest and Peices of Perkin’s were splashed over more than a dozen. My head was wrapped up like an Egyptian Mummy, but the wound was not much although my Thigh was sore I don’t know what from I was not shot in it.\n","175":" We can hear the Gun’s Booming From here and now and again the screech of shell’s passing over They are sending the Patient’s Further Back from the line\n","176":" I’m sick of Hospital already But they won’t let me out yet The Poor fellow’s coming some can not possibly recover. Hell don’t the Drs & Nurses work. How can their nerves stand it. Awful is no word to use. I’d sooner be in the trenches. I makes a man forget God and the Year’s of Christianity Men that are doing this to each other and claim God is with them. Yet we think he is with us when we see the Horrible desolation The outrage & distress the German caused We feel in our heart’s he must be punished\n","177":" Our lad’s are at Morlancourt and Held up The Germans must be\n\n \n\nMon Continued\n\nin Myriads. Their losses must be some thing terrific Our’s is heavy enough. God know’s. Still the Wounded are Coming and this is only really a first aid station.\n","178":" I am now at Albert’s again. I have joined in with a portion of our Battn who are resting by Garrisoning Albert’s. I am alright only for the scab on my neck. Report’s are To & Fro. One a reverse another a Recovery & so on But no nearer to St Quinten. Poor Bobby Emmet is gone he was in my section. Claude Holmes is here with half a Foot. Bert Fletcher Hit through the Shoulder. The French shrug their shoulder’s and Pass on. In a great many Part’s they have proved them-selves to be freindly to the German’s And the Belgian’s also. The Canadian’s are now going up. They are to try & get to Messine’s.\n","179":" Still at Albert’s. The roar of the Artillary appear’s closer & the Rocket’s and Flare’s show as if they are working around toward’s here Several more Regiment’s have come yet our new’s is Very Vague\n","180":" We get word that our men are still about Morlancourt & Bullecourt. But are meeting with very Hard Knocks. We are now Concentrated for a move But have no idea where\n","181":" We are now at Bapaume, laying communication between trenches and clearing up the remains of the last Week. Still Battling near St Quinton We are salving every thing of use it is put in a truck and sent to the Base\n","182":" New’s come the German’s are back in Bullencourt But we cannot yet beleive it as they were on the Run to the Hindenburg Line in the last report’s\n","183":" Heavy Cannonading again and at night the Heaven’s are lit up. This is horrible this suspense we do not get any authentic Particular’s\n","184":" We are told our men are retreating and going to work with the Canadian’s at Messine’s and that the 1st Division was Holding at Bullecourt & would slowly work Back here.\n","185":" All the tales are out. We are withdrawn from Bapaume. The Sherwood Forrester’s releive us. We are sent Back again to Albert’s and the Other’s go on to Arras.\n","186":" to","187":" Nothing but Garrison duty at Albert’s. We can get no more information of what is doing yet the noise appear to come nearer every day. Aeroplanes are Flying over more plentiful\n\n \n","188":" Continued And an Observation Baloon Was seen from here to day. We got word the Canadian’s got Messine’s But at a heavy loss to themselves Fritz must be strong he is losing an awful lot but yet is forcing his way along.\n","189":" There seems to be a great Lull in proceedings as if the gun’s are being removed to other position’s We have been instructed to be on the alert But nothing has come to alarm us\n","190":" We are still Pegging away to day We are took out and moved about as if we were making a sortie from various point’s & Fixing up Sand Bags. The Guns are still Barking again with what appear to us renewed vigour Now and again a shell whistles over which tell us they are working around toward’s us. I am feeling very dizzy and Queer as if I had the Flue or Something.\n","191":" Am no better can hardly move go for a dose The Dr says Fever sent to Bologne then to England to St Thomas’s. My age 43 is up against me and I fear a bad time of it.\n","192":" Thomas’s Hospital London What a Luxury. I am very off, But Hopeful.\n","193":" Can write a letter now. Have had little news. My foot is Better But this fever has cut me down very much. I am out in the Sun and it is \"Glorious\"\n","194":" nothing different\n","195":" Am allowed a bit of Hard Food it is a Bit of our old Freind \"Bunny\" But I enjoyed it was not let stay out long. Back to Bed. It was worth getting sick to be looked after like this\n","196":" tried a Cigarette. It won. But did A.1. with an egg & Toast also an Orange. No Tea yet am on the \"Teat (Milk) Diet. A Couple hour’s in the Sun and am feeling good. Visitors are very kind also. The Flower’s are glorious They Bring Book’s Games Etc Tobacco & Fruit. But the nurse sees to the distribution of Fruit.\n","197":" Feeling a bit Lively now can get up and go to the Bath & Wash my self am allowed to walk about a bit.\n","198":" Am allowed a suit of Blues and go about the Ground’s Am getting along Just like a house on Fire\n","199":" Have Blue Band’s on now Over-Coat over Blue Suit allowed out no \"Booze\" All Theatre’s & Drives\n\n \n","200":" Am Boarded by Dr or Col Maudsley and Sent to Weymouth to Monte Vidio Convalescent Home. I was there 2 hour’s and then sent to the Verne Citadel at Portland. This Fort is a Revelation\n","201":" am held for Inspection. Dr Brook’s say’s I am a Passenger for Australia That was Good News. Our mates are catching it hard in France now But I would be of little use. My foot is still Lame and I still use a stick The Wound in my neck is still sore if I move quickly. Have had a good look over the Fort to day & Watched Air ship’s & Seaplanes scouting around Portland Harbour.\n","202":" Another Board. Major Bell’s this time He is called the \"Gutzer King\" He asked me my age I told him. He said is this Paper Correct, That is my Medical History, I replied I’d never seen it. He said I suppose it is alright. Dismiss. He wrote something and called the next.\n","203":" Had a day round Portland Easton and Fortune’s Well. Went over the Old Rufus Castle and paid £1-0-0 to the Old Soldier who loook’s after the Royal Apartment’s in our Fort. He showed me round all of it, it is all under -\n\n4th Thurs Continued. - neath the whole Fort Parade Ground Etc. The Royal Apartments he said was used as a prison for a Queen of Portugal. The Underground stores were Wonderful. There was coal to last 7 years, also Condensed and Preserved provisions in the event of a siege.\n","204":" We were allowed (if the Dr permitted) week end From Friday at 6 to Monday Morning. I was let go and the Dr said a glass of Stout would’nt hurt me, so I took the Blue Band’s off. I saw Pool from the train going to Weymouth, and I went there. It is a lovely Place and it reminded me a great deal of Geelong. I enjoyed my trip and remarkable to say I forgot about the stout.\n","205":" & 7 is all written together\n","206":" Had to report to the Dr He said I’m alright if I go slow. He laughed over me forgetting the stout. Put in the day about Weymouth. We saw some old History there and the Famous White Horse cut out on the side of the chalk Hill. There are amusements here Galore & the People are good to us. I was taken to Wyke-Regis for Tea, Mr Tall is a Grand Old John Bull.\n\n \n","207":" Stayed in the Fort all Day. Played a Heat in a Billiard Tournament & got licked Went to a Concert in the Gym at night in Bed at Lights out.\n","208":" Another Medical Board The Soldier’s Terror \"Charley\" Ryan. He made me peel off and sounded me and then read the Medical History. He had a look at my scratches, and referred me to Dr Maudsley in two day’s time\n","209":" No leave owing to the Board To-morrow, So put in time writing Home and to some of my mate’s. One is here. Lou Holme’s same Complaint as me Fever, it Broke him up he was a Big strong man.\n","210":" Called into the Board Room, Col Maudsley was more Considerate than Col Ryan. He read the History first then told me to take off my Boot He thought an operation needed for the foot. I did not have to strip. He Passed me for Treatment in Australia That was my last Board in England. So I was able to write and say I’d soon be home.\n","211":" Having my week end at Bournemouth. A great little Sea Side resort.\n","212":" Nothing to do but wait for a Boat roll. We could go in and out of Camp as we liked so we began to get well acquainted at the little surrounding villages Between Portland & Weymouth.\n","213":" I had often watched from the Battlement of the Fort the Torpedoes being tested in Portland Harbour from WhiteHeads Factory. Today we were Granted the privilege of having a look over the works. We saw all the Work’s & Construction except the method of Charging the Torpedoes. The Firm also Gave us afternoon refreshment’s\n\n \n","214":" The Boat Roll’s are Read out this Morning. I am booked for the \"Nestor\" Also an old Batt mate Sgt Jack Thompson. We are to be ready to go on Board on the","215":" the rest of the week is to be devoted to getting money sent down & Transferred to Australia Buying up comfort’s Etc. for the Voyage.\n","216":" Having Bid good-bye to Freind’s I made, in one way I was sorry to leave the \"Verne\" But Home had a greater attraction. We Marched down as well as Possible to Portland Station and entrained for Devonport. We Went through Pool Somerset, Yoeville, and Stopped at Exeter, Where we were once again treated to a feed by the Mayoress. It is said she did not let our Troop Train thro’ without refreshment’s at all hours day & night Arrived on Board at Noon\n","217":" Continued. and anchored out waiting, We saw the Oratavo towed in with an awful Hole in her side Another Boat mysteriously blew herself into the Water the day before while tied to the Peir.\n","218":" Still Anchored out. Only amusement is watching the Dirigibles & seaplanes Scouting\n","219":" thing.\n","220":" \"Ditto\"\n","221":" Men Clamouring to be put or allowed ashore when We suddenly at Noon up with the Anchor and moved off. One Hour later we had a magnificent sight There were 11 Transport’s and 8 Destroyers two Battle Cruisers in the Convoy. The Nestor was the Commodore Boat\n","222":" No Church Parade the Clergy were sick. Lolled about Deck all day.\n","223":" Very little difference Weather good.\n","224":" Nothing extra occurred\n\n \n","225":" Capt E. Hordern asked me would I act as Clerk to Capt Kelly the Padre. I did. I was acolyte for Him and also in charge of all Y.M.C.A. Material. I was kept Busy giving out Books Games Etc for a while so I obtained an Assistant I got an especial tip in the way of food From the Steward every day. He thought because the Preist Had a late Breaskfast, I did so I had all meal’s with the Steward’s\n","226":" Nothing Fresh to write the usual. Crown & Anchor. House Two up amusement’s were in full swing up to Seirra Leone. We Put in there and got fresh Water Major Inglis and Col D. Warren went ashore and got back Gloriously drunk. The Major fell off the Ladder Back into the Water. He was helped up with a rope under his arm Pit’s, We sailed Immediately\n","227":" We went on our way to Capetown, to-day we Passed a lot of Wreckage. The Submarines had been Busy. We heard a destroyer gather in a raft loaded with Sailor’s\n","228":" Church Parade. Full Uniform Heat intense. I am Having enough Church Parades now Father Kelly say’s Mass every morning and I am his Assistant The Smoke Room is the Church and the Piano the Altar. On Sundays the C.E. Padre Rev Mr Clark uses the altar He also \"nipped\" Father Kelly for Communion Tablets He has no wine, ‘A funny Communion no wine to wash it down with\" But the symbol was there And I’m sure it was as earnest as if he had a Barrel & would get perhap’s a greater Blessing.\n","229":" After Mass & breakfast we saw a lot of Signalling and wondered. Suddenly one Blast Blew, every ship stopped and turned her stern out showing her Gun’s it caused Great excitement. But was only a Practice\n\n \n","230":" Saw how provisions are passed From one ship & another at Sea.. The Glasgow H.M.S. came alongside close to us About 100 yds off \n\nBoth ships stopped they lowered a boat Put a Basket in it and about 4 in crew and an Officer Came over. Our Boat lowered a rope over & got the Basket and sent Beef Mutton Pork, Turkey’s Fowl’s Bacon, Etc & Sundry Bags of spuds Onions Turnip’s Etc. The swede Turnip was a standard thing Everywhere we went.\n","231":" A Death occured . A Queenslander ex. Jockey Paddy Byrne. He died with or from Pleurisy. It was sad for me to assist Father Kelly to bury him.\n","232":" A Collection was started and closed at £96 odd for Paddy Byrnes widow. The Officer’s shelled out well.\n\n8 Friday. Nothing Eventful Entries taken for Deck sport’s But Poor Nomination’s. All Invalids\n","233":" Continued\n\nSo Card Tournaments & singing \nContributions\n Contests were began. There were some good Talent. The Officer’s donated all prizes, I won a Fiver I guessed the speed of the Boat on a days Run. But had to give the Engineer 30\/- for giving me the Tip of Course the Crew was Barred.\n\n.\n","234":" Passed a large school of Whales and Flying Fish Following us like Swallows. A Game of Deck Bowls with Rope Quoits catch on and is played on the Saloon Deck. We had the Run of the ship Officer’s and men alike, it was greatly appreciated\n","235":" Usual Routine\n","236":" Every body Polishing up we expect Capetown To-morrow The Destroyer’s all gone Back We have no Convoy now as we are supposed to be out of the danger Zone.\n","237":" Arrived at Capetown at noon Granted Leave immediately. We were sat down to a Banquet at the Feather Markets. Loaded up with smoke’s and Fruit and that was to be every day of our stay.\n","238":" Went to Cecil Rhodes Place at Claremont (now a zoo) Free Trams every where. Pubs all shut. Cant bear Africa’s Nippers. Dirty Beasts\n\n \n\n13th Continued. Grand Promenade Concert at night or free Pictures as you chose Cape-town very lively place.\n","239":" Kelly got Wirth & me an early Pass at 8.30 to go up and get Altar Wine. We took a Gladstone with us. I had to see a preist at St Mary’s Cathedral But the Bishop had the Key of the Cellar We had to wait so we got to the first Pub. We had a good run till 10 am the Police shut it up then as the rest were getting off. Went back Our Port was full I paid him but had to get a Cab to cart it Back to the ship We had enough for the Voyage Home to Aus\n","240":" Sailed For aus. We only Had the Euripidies & the Ascaneus with us now. & we expected Fremantle in 12 day’s. Our Major Had a row over a Nurse & Has a Lovely Black Eye, So there is no Officer’s inspection\n","241":" Nothing much to write about for this Fort,night – Just the one routine up till to-day we got to Fremantle. Early no leave till 5 P.M. Big strike on \n","242":" Continued\n\nPatriotic Workers coaling us some shut up their Business Houses to do it. Free train to Perth a Big Spread at Boan’s big store got Back at midnight. No leave the next day, a lot got ashore But were caught and Brought Back. We got off at night, Labour trouble the Cause of no Leave\n","243":" Leave From 4 P.M. till 11 P.M. W.A. gave us a good time. Sailed at 3 A.M. Several misses\n","244":" off to Adelaide. An open Go between the Euripidies & us The Euripidies won by 8 ½ hours\n","245":" We got in at Noon & was let off at once We could not Pass those V.A.D. Girls. They made us eat They had a Wharf shed full of food Trains and Theatre’s Free another V.A.D. Feed in City & the ship at midnight. The Girl’s stopped up to give us a drink of Tea when we got Back.\n","246":" Church Parade at Port Adelaide then Leave at Adelaide Adelaide very quiet on Sunday.\n","247":" Another Big day. Sports Etc for us. treated fine.\n\n \n","248":" Sailed at Day light a Few Missed but caught train to Melbourne.\n","249":" We kept the Coast all along till we got to Melbourne The Weather was grand and I promised myself never to leave it if I had the whole lot of other Nation’s\n","250":" Got into Melbourne 9 a.m. Had to make a Customs decoration I had no Ostrich Feather’s no silk work I got in Africa no. & They never looked or Capt Hordern’s dog might have bitten them I had him Tied up in my Kit Bag. Soon got off and Cars run us to Werth’s Circus Building & had the Best Meal since I left Australia over 12 months ago. A General came & shook Hand’s with me and Enquired as to how I was. I replied & said plenty of this treatment would soon cure me. He Laughed, I learned after He was the Gov. General a most affable Gentleman\n\n2 P.M. On Train for Sydney no leave in Melbourne. Red Cross Etc on train our Jaw’s are not idle a moment Either Eat or Smoke. Albury good Just changed & on again. People with Food Smoke’s Etc. Wagga Cootamundra. Junee. Goulburn Moss Vale & Bowral. We were Absolutely Gorged. \n","251":" Sydney at Last. Off to Anzac Buffet More food. Got (two) £2 and Friends waiting had our leave and Railway passes on the train so had no Red Tape trouble for Once. Finished 14 days leave & was sent to hospital, Boarded Preferred my discharge and Received it on the","252":"\n\n"}}