{"Document Name":{"0":"Diary_0196","1":"Diary_0196","2":"Diary_0196","3":"Diary_0196","4":"Diary_0196","5":"Diary_0196","6":"Diary_0196","7":"Diary_0196","8":"Diary_0196","9":"Diary_0196","10":"Diary_0196","11":"Diary_0196","12":"Diary_0196","13":"Diary_0196","14":"Diary_0196","15":"Diary_0196","16":"Diary_0196","17":"Diary_0196","18":"Diary_0196","19":"Diary_0196","20":"Diary_0196","21":"Diary_0196","22":"Diary_0196","23":"Diary_0196","24":"Diary_0196","25":"Diary_0196","26":"Diary_0196","27":"Diary_0196","28":"Diary_0196","29":"Diary_0196","30":"Diary_0196","31":"Diary_0196","32":"Diary_0196","33":"Diary_0196","34":"Diary_0196","35":"Diary_0196","36":"Diary_0196","37":"Diary_0196","38":"Diary_0196","39":"Diary_0196","40":"Diary_0196","41":"Diary_0196","42":"Diary_0196","43":"Diary_0196","44":"Diary_0196","45":"Diary_0196","46":"Diary_0196","47":"Diary_0196","48":"Diary_0196","49":"Diary_0196","50":"Diary_0196","51":"Diary_0196","52":"Diary_0196","53":"Diary_0196","54":"Diary_0196","55":"Diary_0196","56":"Diary_0196","57":"Diary_0196","58":"Diary_0196","59":"Diary_0196","60":"Diary_0196","61":"Diary_0196","62":"Diary_0196","63":"Diary_0196","64":"Diary_0196","65":"Diary_0196","66":"Diary_0196","67":"Diary_0196","68":"Diary_0196","69":"Diary_0196","70":"Diary_0196","71":"Diary_0196","72":"Diary_0196","73":"Diary_0196","74":"Diary_0196","75":"Diary_0196","76":"Diary_0196","77":"Diary_0196","78":"Diary_0196","79":"Diary_0196","80":"Diary_0196","81":"Diary_0196","82":"Diary_0196","83":"Diary_0196","84":"Diary_0196","85":"Diary_0196","86":"Diary_0196","87":"Diary_0196","88":"Diary_0196","89":"Diary_0196","90":"Diary_0196","91":"Diary_0196","92":"Diary_0196","93":"Diary_0196","94":"Diary_0196","95":"Diary_0196","96":"Diary_0196","97":"Diary_0196","98":"Diary_0196","99":"Diary_0196","100":"Diary_0196","101":"Diary_0196","102":"Diary_0196","103":"Diary_0196","104":"Diary_0196","105":"Diary_0196","106":"Diary_0196","107":"Diary_0196","108":"Diary_0196","109":"Diary_0196","110":"Diary_0196","111":"Diary_0196","112":"Diary_0196"},"Date":{"0":"unknown","1":852.0,"2":853.0,"3":854.0,"4":857.0,"5":866.0,"6":867.0,"7":868.0,"8":869.0,"9":872.0,"10":873.0,"11":874.0,"12":928.0,"13":929.0,"14":930.0,"15":931.0,"16":932.0,"17":933.0,"18":934.0,"19":935.0,"20":941.0,"21":947.0,"22":948.0,"23":951.0,"24":952.0,"25":960.0,"26":961.0,"27":962.0,"28":963.0,"29":964.0,"30":965.0,"31":966.0,"32":967.0,"33":968.0,"34":969.0,"35":970.0,"36":971.0,"37":972.0,"38":973.0,"39":974.0,"40":977.0,"41":986.0,"42":992.0,"43":993.0,"44":1023.0,"45":1024.0,"46":1025.0,"47":1026.0,"48":1047.0,"49":1048.0,"50":1049.0,"51":1054.0,"52":1055.0,"53":1075.0,"54":1076.0,"55":1077.0,"56":1078.0,"57":1079.0,"58":1085.0,"59":1086.0,"60":1087.0,"61":1088.0,"62":1115.0,"63":1208.0,"64":1209.0,"65":1210.0,"66":1211.0,"67":1212.0,"68":1231.0,"69":1232.0,"70":1233.0,"71":1236.0,"72":1237.0,"73":1238.0,"74":1240.0,"75":1241.0,"76":1270.0,"77":1301.0,"78":1302.0,"79":1303.0,"80":1304.0,"81":1305.0,"82":1306.0,"83":1307.0,"84":1308.0,"85":1309.0,"86":1331.0,"87":1332.0,"88":1338.0,"89":1341.0,"90":1342.0,"91":1364.0,"92":1372.0,"93":1373.0,"94":1374.0,"95":1375.0,"96":1376.0,"97":1377.0,"98":1396.0,"99":1400.0,"100":1413.0,"101":1434.0,"102":1435.0,"103":1436.0,"104":1437.0,"105":1456.0,"106":1457.0,"107":1458.0,"108":1518.0,"109":1544.0,"110":1550.0,"111":1551.0,"112":1572.0},"Entry":{"0":"\n\nFrance April\/16\/\n\nArrived back in Cairo from the Western Frontier Expedition on Feb 6\/16 and were stationed at Zeitoun Camp near Heliopolis which is the big training camp for the New Aust. & N.Z. troops, had a very quiet easy time with plenty of leave to visit my old friends the Sabbaghs & Hachem (Syrian Families) whom I met last year.\n\nIt was an open secret that the 1st & ","1":" Divs. were bound for France & a month \nlater\n after reaching Cairo we left for Alexandria where we met the other 3 companies of the Div Train who had also been up on the Western Frontier.\n\nWe were camped near Sidi Bishr Camp about 8 miles from the centre of the city close along the sea shore. We had our\n\nhorses with us but had handed over our waggons to one of the new Divisions in Cairo as we were to get British Pattern Waggons in France. \n\nOn Mar 25\/16 we went on board the S.S. Manitou; It used to be a heavy task embarking & entraining the horses but now they are all veterans and walk into railway trucks or up ship’s gangways and along the horse decks as part of a regular routine.\n\nWe pulled out from the wharf at about 5 p.m. and anchored out stream for the night. Our ship load consisted of the 1st Aust. Div. Train about 500 men & 700 horses and a Brigade of Howitzer Artillery another 500 men.\n\nI couldn’t help noticing the difference in leaving the quayside this\n\ntime to last year \nwhen\n en route for Gallip. Then we answered the waving of the few spectators with cheers & choruses. Now sea trips had lost their novelty and we were quite callous to all enthusiasm.\n\nWe weighed anchor at daybreak next a.m (Sunday) we were immediately issued with lifebelts with strict orders that they had to be worn continuously by everyone – men & officers alike – and at night to be used as a pillow.\n\nShe was a dirty old ship having been used in the Atlantic Cattle Trade – the cattle pens had been extended to take a horse so that the alleyways between the rows of horses were very narrow which didn’t make the work of feeding & watering the horses any easier.\n\nA troopship is always a troopship – a thing to be endured – and our deck was \nbelow\n the horse deck & we were as usual packed like sardines so it only \nsaw\n me at mealtimes, at night I took my blankets up on deck preferring the chilliness to the stuffiness.\n\nWe had good weather except for the last 2 days when it was a bit choppy & wet – and on Saturday morning six days after leaving Alex. we steamed in at daybreak to Marseilles passing (so I was pointed out) the Island of the Castle of Monte Christo on our way in\n\nWe unloaded the horses & tied them up on the quay while we unloaded our baggage then moved across to our train. The Railway Siding was only a few hundred\n\nyards from the wharf so we didn’t get much chance of seeing Marseilles, but what I did see was ridiculously French \n\nThe only policeman was short & stout with a pair of gigantic buffalo horn moustaches The soldiers guarding the wharves etc. were the old French Territorials dressed in the out of date dark blue coats & baggy red trousers just like the stage type French soldier of pre-Entente days\n\nIt was 4.30 in the afternoon when the train started on what was to be a 48 hour Railway journey across France a journey I will always remember with pleasure. It was just like one long scenic Cinema Film. The majority of our fellows had never seen any old fashioned\n\nrural scenery and we’d all been about 18 months amidst the sand so that we fairly drank in the green fields, orchards, gardens & farmhouses. Everyone stopped work in the fields to give us a wave as we passed, while the Kids lined the railway side crying ‘Souvenir\". \n\nAbout twice during each day we pulled up at some village siding and carried a bucket or so of water to each horse. These stations were evidently regular halting places for troop trains as the French Red X Society were always ready for us with hot tea.\n\nWherever we halted a crowd very soon assembled & hung over the Station barriers with of course all the youth & beauty of the \n\nvillage well to the front yet pretending to be very shy – of course we told them all we’d come back to see them again \"apres la guerre\". \n\nThe old country women came along to give us buns fruit etc; one old woman seemed to take a fancy to me & gave me a couple of apples do I asked her if she would like some biscuits (army Variety) She said \"Oui M’sr\". So gave her some & she tried to bit one – She made an awful face at it, then grinned & opened her mouth to show me – she’d only 2 teeth all told & they didn’t coincide.\n\nIt was nightime when we skirted round Paris passing Versailles just at daylight We reached Abbeville at 4 p.m &\n\ndetrained our horses & baggage & marched out to our temporary Camp \n\nAbbeville which is a Transport Base is an old provincial town of some 12,000 inhabitants – a fine old abbey stands in the centre of it – with a market square, stone paved streets very narrow with brick & half timbered houses on either side. \n\nWe got our waggons here & also some new horses from the Remount Depot and after a 3 days spell we set off by road to join up with our Division. It was a good trek taking 4 days, easy stages of 14 or 15 miles each day, and as our halting place each night was near some little village we were able after we had fixed up\n\nour horses to go into the village & get a feed at one of the cottages – usually chipped potatoes & eggs.\n\nFive of us one evening went into the village chemists shop to make a few purchases – I had to act as interpreter We were evidently the first Australians the old chap had seen & he persisted in our going into his house behind the shop & being introduced to his wife & daughter & drinking a glass of wine with him.\n\nStrazeele","2":"\n\nIt is a week yesterday since we arrived here by road from Abbeville and our Company is billetted on 3 neighbouring farm houses about ¾ mile from the little village. Since\n\nwe have been here we have had a sample of every variety of weather Snow, sleet, hail, wind, warm sunshine in turn – today it is drizzling rain.\n\nAll our 1st Division is billetted round this neighbourhood at present being in Reserve. We are about 15 miles from the front line & expect in a few days our Division will go up & relieve the","3":" Division which is holding a share of the trenches. We are kept pretty busy taking supplies round to where various units are billetted.\n","4":" I believe.\n\nBy all the rules of pre war health conditions we all ought to be down with pneumonia or at least bad colds as\n\nthis is only the second day since reaching here that it has been fine & only at night when between our blankets at the billet have we had dry feet & we are just slathered in mud & it is impossible to keep clean when you are working amongst horses this weather. But everyone is fit & there is hardly a case for the sick parade except sores and bruises.\n\nThe Farm we are billetted in has had every breed of soldiers thrust on them in turn Germans, English, French, Canadians & now Australians. The advance guard of the Germans reached here on their first dash for Calais in Oct ’14 but they were only here two days when the\n\nBritish arrived & drove them back. One can still see signs of fighting particularly one brick cottage whose walls are a mass of bullet splashes.\n\nI don’t know whether this is Flanders but it seems so by the name of the place & the country people amongst themselves speak Flemish. The names on the tombstones also read more like Dutch than French. This sounds as though I have been posing as an antiquarian but as a matter of fact our Supply Depot is alongside the village church – stacks of biscuits & bully beef, groceries, sacks of oats bales of hay along the very walls & we draw up our \n\nwaggons alongside to get our loads so cannot help reading the quaint inscriptions while waiting.\n","5":" 23\/16 Easter Sunday – Doilleu\n\nWe arrived here late yesterday afternoon on the pouring rain – soaked through & covered in mud. \"Here\" is a large roadside farmhouse about a mile from the village – it is also an \"Estaminet\" or inn & we are billeted in the various outbuildings wherever we can get in. It reminds one of the old song \"Fifteen of us on the parlour floor\" except the parlour is a disused stable. \n\nIt wasn’t very long we were crowded into the kitchen & Madame was at the stove frying eggs \nif\n as if her life depended on it\n\nAfterward I got a chair near the stove next to \"Gran’pere\" \nwho is I guess\n He had the biggest pair of feet I ever saw on a man & seemed proud of them. He was a garruluous old fellow & when he found I had a smattering of French there was no holding him I don’t think he’d had such a hearing in his own home for years.\n\nHe told me he was a soldier in the war of ’70 and as he only had one eye I though I was on the track of a tale but he missed a great chance & told me the truth – it was the result of a hayfork accident 30 years ago.\n\nToday we had reveille at 4 am. this is our regular time now & I was\n\ndetailed to report with my limber waggon to the Sanitary Section in Sailly-sur Lys about 4 miles away a small town just within range of the German Guns but which doesn’t receive much attention from them at present. Most of the windows are broken in the houses & now & then one passes a building which has \"stopped one\" \n\nThe principal Church has been destroyed by fire & now is nothing but 4 walls & a tower. It is now the wood & coal supply depot & proved to be where I had to go to pick up a load for the San. Section\n\nI drove straight through the Tower where the main entrance\n\nhad been & took up my share of coal on the right aisle & the wood from the left aisle \n\nWhile in there waiting to be loaded saw an exciting aeroplane action nearly overhead. A German plane which our \"anti-guns\" were firing at for all they were worth & at the same time two of our planes pursuing it.\n\nWe heard a machine gun rattle overhead but couldn’t see the finish as they got in between us & the sun.\n\nA lovely day – one could almost see the crops & the hedges growing in the warm sunshine after all the rain we have had\n","6":" 25\/16\n\nA year ago today, since the landing at Anzac.\n\nWe were informed today that reveille is to be in future at 1.30 a.m.! So that the waggons will leave here at 2.30 reach the railhead at 3.30 a.m. and pick up their loads & carry them on to near where our Division is billetted unload at the Supply Depot & reload the various supplies in small lots as requisitioned & deliver them to their units. \n\nWe have got to be early birds because for the last few days the German Planes have been very active overhead & they must have seen & noted the daily gathering of the Supply Column & our \"Heads\"\n\nanticipate an air raid. So by starting earlier we shall finish the part of our work done in which the waggons are assembled together soon after daybreak; an the column will have split up before the enemy starts its usual observation flights\n","7":" 1\/16\n\nWe moved our camp yesterday to a spot near the \"Supply Depot\" I was only thinking that in happier times it would be the ideal spot for a week end camp. In a \nfarm\n field adjoining the farm buildings we have pitched tents near the hawthorn hedge & under some high trees. There is the farm pond close by & at the farm we can buy milk\n\neggs etc. During the last few days the enemy aircrafts have been very active & not a day has passed be we’ve had aircraft actions overhead\n\nThis morning their guns started shelling Sailly which is about a mile away from the camp we could hear the shells coming through the air. We learned they were shelling the Railway Station & also the big building where the Engineers have their quarters. Had to go into Sailly this morning & as we crossed the river we could see the smoke from the explosion of the shells & we met the Drivers\n\nof the Engineers who were leading their horses out into the country while the bombardment lasted\n\nI have just heard that Estaires a little town about 2 miles from here also got it pretty hot today\n","8":" 4\/16\n","9":" years today since I left England\n\nQuite a red letter day – Mail – & also I had a hot bath at the Nations Expense A big Laundry at Sailly has been turned into the ‘Divisional Baths’ so as opportunity occurs the troops can have a hot bath. Thirty of us who were off duty went down. When we entered we stripped off our tunics & trousers & these were tied up with our identity \n\ndisc & taken into a room where French women were employed; they dusted them over with insect powder & ironed the seams & they were delivered back to us by the time we had finished our bath.\n\nIn the dressing \"Room\" we took off our other clothes, boots, leggings etc handed our dirty underclothes into another office & there received \na\n metal discs marked for whatever garments we had handed in We presented these discs at another counter & received in exchange for them corresponding clean garments – with these \n\npreliminaries over we repaired to the bath room originally the laundry wash house The floor was covered with tubs filled with hot water from a hose in which we had our bath\n\nFinished that we went under a hot shower & then a cold plunge dresses into our clean underclothing & pressed tunics etc & we came out feeling as fit & fresh as possible\n\nBac St Maur Railway Station was shelled this morning & a number of our waggons which were drawing supplies had to make a hurried exit luckily no one was hit.\n","10":" 19\/16\n\nThis attempt\n\nat a diary seems to be dying from the disease common to all diaries, but although correspondents could probably hash up column after column about our daily life we have got so thoroughly accustomed to the routine that there is nothing to us of interest to record. \n\nYesterday was my first trip up to the trenches I had to hook in my team to a waggon & with two others meet the Q.M. of the 103rd Howitzer Battery in Sailly. There we picked up our load Coleman’s & mine were \"Bursters\" – cement slabs, about 2\" thick & measuring about 2’ x 1’ for building into gun emplacements, each\n\nweighing about 40 lb each, we took up 100 on each waggon, Neal took up on his waggon some thin steel arches for the roofs of the gun pits. We pulled into the Artillery Transport Billets at 4 p.m unharnessed & fed our horses & ourselves & waited for dark before doing the last 3 miles up to the trenches\n\nIt was a heavy load & the road was not very good so the Battery supplied us each with a pair of lead horses We left at 8.15 p.m. just getting nicely dark. The Artillery Ammunition Limbers were with us taking up their daily supply of shells, We passed many small parties of Infantry\n\ncoming & going from the trenches as our","11":" Brigade was being relieved after its spell in the line.\n\nAlthough it was dark we could now see something of the real ravages of war – The crops had been put in but the farm houses were chiefly ruins walls blown in, roofs burnt holes in the road from shells roughly filled in, we couldn’t see these but felt them as we passed over with the waggons.\n\nThe Battery was just behind the trenches at the apex of the Armentieres Salient and as we reached our destination we could see the rockets & flares going up on either side & in \n\nfront. it was forbidden to strike a light or smoke as we were told the Germans sometimes played a machine gun on the road at night when they thought any traffic was going along. But we got rid of our load uneventfully I am glad to say & heard nothing beyond an occassional rifle shot Got back to our billets at 11.45 quite ready for my blankets.\n\nThis morning had to hook into my limber & take 2 wheels into Sailly to put on to a waggon which had broken the tire of its wheel – a couple of hours did that little job & the rest of the day have\n\nbeen doing the odd jobs that are always waiting with a pair of horses & a waggon – For instance groom horses, pull them a bag full of green grass from the hedge bottoms as a treat, the my \"bits\", grease the waggon wheels – \n\nAeroplanes very active overhead today as is always the case on a fine calm day\n","12":" 1\/16\n\nVery heavy artillery firing last night – one of the Artillery Brigades was moving out into the Reserves & another Bgde taking its place The Germans had probably got wind of the change & chosen the opportunity for bombarding the gun positions\n\nSeveral of our waggons were up moving the baggage & our Company suffered its first Casualty in France Bill Southam coming back with a Shrapnel Bullet in his leg – he was taken off to hospital this morning & I think most of us envied him – I know I did – a few \ngood\n weeks good rest & change with the probability of being sent to England.\n","13":" 30\/16\n\nThere has been a long gap between this & the previous entries but we have been too busy – only time to write the scantiest letters home & the rest neglected or F.S. Cards only & yet with all the work we have been getting through there is nothing fresh \n\nto report. \n\nI have been reading some of Kiplings articles on Submarine Warfare & to use the official phrase he continually quotes we have been \"employed as requisite\"\n\nTaking supplies from our \"Dump\" to the various units during the morning \n\nNight trips with cement slabs, timber wire, iron etc up to the trenches & gun pits – there is always a bit of lead flying overhead on these night trips and then there is another side of active service which one doesn’t see on the cinema Film of \"Life at the Front\"!\n\nSailly is in the fire zone and the Municipal Council or its French\n\nequivalent has been taken over by the Military & my company has to supply 2 limbers each morning to the Divisional Sanitary Section & whosever turn it is for that duty has to drive up & down the two long main streets, collecting the road refuse which is swept up & shovelled into the limbers by a gang of old Frenchmen & boys. \n\nThis job is commonly known amongst us as being \"on the Council\" & of course one comes in for a deal of chaff when engaged on it particularly by ones own mates \"What did you do Daddy in the great war\" is the commonest gibe!\n\nIt was read out on Parade tonight that all leave to England is stopped One knows absolutely nothing but there is a feeling of anticipation that we are on the eve of the biggest British effort yet attempted. Things have been too quiet this last month \n\nBut the artillery has been increasingly active these last few days. Last night was the heaviest bombardment I have heard on our immediate front I was on horse picket from 10 pm till 2 a.m and the roar of the guns big & little never ceased for a minute while their flashes lit up the sky like an aurora\n\nBorealis. Corlette was back at Strazeele 8 miles in the rear with his waggon & says there are big bodies of cavalry now billetted there waiting for a chance which I hope they’ll get.\n","14":" 3\/16 Monday\n\nOn Saturday afternoon ‘Scottie’ (N.R. Scott) look me up he had just come out the day before from 2 months in the trenches. He was my great pal at John Sands Ltd in Sydney & this is the first time we have met since I left Australia, although we have been chasing each other for the last 12 months \never since he arr\n We celebrated the \"meet\" by an extempore supper at the nearest ‘Estaminet’\n\nThe menu was as follows 10 (five each) Fried Eggs – salad – bread & butter tin of Herrings I had left over from my last parcel – Coffee & then afterwards a bottle of champagne consumed while smoking some 10 for 2d cigarettes! Champagne & Woodbines & yet such is active service.\n\nHe is billetted at ‘Jesus Farm’ near ‘Nieppe’ about 5 miles on our left so yesterday afternoon got a permit & rode over to see him & after another tea – eggs as usual only boiled this time – we laid in a grass paddock & smoked & yarned of old times & watched the aeroplanes & shrapnel \n\nright overhead.\n\nHis platoon went into the trenches two months ago 63 strong & came out with 24 only. We are on the tip toe of anticipation that the big move has come at last\n","15":"\n\nThe","16":" Division is being relieved & our line of front taken over by the","17":" Division \n\nFor the last 3 days we have had \nthem\n their corresponding unit of AASC Transport camped alongside us & they have taken over our work – They are a pretty raw lot in many ways They carry on their work with about twice the amount of pomp & circumstance & take twice the \n\ntime over it. \n\nWe understood that we were to go a few miles back for our Divisional Rest but now no one of us knows where we are bound. Dame Rumour has it that we have a train journey in front of us; we have had an overhauling of our ‘gas bags’, field dressings etc so I think we are bound for the Somme where our present offensive is.\n\nWas is Estaires this morning taking a man into hospital. The place was full of the 4th Div Infantry \"going up\"; Marching by companies each followed by their travelling cookers, limbers, watercarts, etc. They looked a very fine body &\n\none couldn’t help feeling a thrill as they marched through whistling the Maiseillaise.\n\nIt reminded me of the days when our Division marched off from ‘Mena Camp en route for the Dardanelles – They had the whistling spirit in them then but one doesn’t often hear them at it now. It has become too much of a routine & necessary evil\n\nThe old 1st Division reserved the right of all old soldiers to have a gibe at the Rookie Divisions or Dinkums as we call them The following little encounter took place a few mornings ago when\n\nthe 4th Div Train joined up with us one morning on our Daily Routine just to pick up the work. One of their smart new Corporals rode up to the waggon of one of our old","18":" E.F. Drivers & told him to fold his waggon cover neatly – The latter just looked down & said \"Get to H\" \"We are not a sideshow We are the","19":" Division\" Exit the officious corporal.\n","20":"\n\nOn Monday we broke camp at 9 a.m. & trekked to near Bailleul where we parked up in a field at 2 pm halted for the rest of the day & on Tuesday morning Reveille at 1 a.m\n\nleft at 2 a.m for the rail head at Godervaersvelde 10 miles away which after part of our column getting lost (me amongst it) we reached at 5.30 a.m. Entrained and left at 8 a.m. I travelled on the flat truck underneath the waggon it was loaded with \n\nReached Doullens at 2 p.m. unloaded horses & waggons harnessed up & pulled out at 3 p.m.\n\nDoullens was a good sized country town very straggling but clean & picturesque with good shops & I wished we had been halted there. But we pushed on and at about 6 p.m. halted to water &\n\nfeed the horses while the cooks made a drink of tea for us – we pushed on passing through \nthe\n other villages Bonneville then Canaples & then bivouaced about a mile past the latter. \n\nIt was 10 p.m before be finally halted & by the time we had unharnessed – stretched our drag ropes from waggon wheel to waggon wheel (to tie the horses on to) watered & fed our horses ditto ourselves – It was midnight & we were quite ready for our blankets – one of the longest days I ever remember on the go for a full 23 hours.\n\nIt is now Wednesday morning\n\nI’ve groomed & fed the \"gees\" had breakfast & am now writing this at 9 a.m. & \nare\n we are expecting to move off very shortly \n\nThis is very different country to the flat Armentieres district we have just left. It is very heavily wooded, undulating with deep valleys Just like many parts of the Surrey countryside. As one Londoner said when he woke this morning – It just looked as if he was on maneouvres with his old Yeomanry.\n\nEvening\n\nWe are bivouaced at Flesselles a large but poor looking Village on high ground from\n\nour ‘bivvy’ we can see for miles across the undulating country of crops & little hamlets\n\nIn the middle distance is a deep valley which I think must be the Somme Valley & right along the horizon we have been watching the columns of smoke being sent up by the shells bursting.\n\nIn the centre of the village is a chateau – just the sort of place the Williamson’s rapturize over in their books – surrounded by a high brick wall Through a fine pair of Iron gates we got a glimpse of the drive lined on either side with standard roses in full bloom. One of the more modern\n\nparts of the building had the date 1747 on it. But the main building must have been much older\n\nIn all the sights it has survived there cannot have been a more undreamt of one than to be surrounded by Australian Soldiers horse, guns & foot billetted in the cottages of the chateau\n","21":" Varennes\n\narrived here this afternoon at 4 p.m having come today from Val de Maison a distance of 11 miles where we had stopped 2 days when it rained the whole time. Our waggons are pulled in alongside the village street – The horses in a paddock\n\nclose by & we are billetted in some empty barns. \n\nHave just walked down to see a batch of German Prisoners who have just been brought in – about 200 behind barbed wire of course. A smattering of old men & boys but the majority are solid lumps of young men.\n","22":"\n\nWe got immediate marching orders at 4 p.m. and within an hour were on the road we soon struck the main road & joined the mass of traffic proceeding towards Albert about 5 miles away.\n\nI have never seen such a mass of material & men, either side of the road was just one series of bivouacs\n\nthe whole way; while on coming to the top of a hill my brakesman told me to look behind & I could see the road a mile behind & it was just one long sinous snake of marching troops & the same ahead all going forward\n\nMeeting us were motor ambulances with wounded & one big fleet of omnibuses.\n\nWe have just bivouaced outside Albert & the bombardment is the biggest I have heard one ceaseless roar while with the big guns one can follow the whirr of the shell through the air & the distant\n\nburst. \n\nAlbert about ½ mile away & we can see what was the church The spire has been hit & its back broken & although it has not fallen it is bent in half & the top of the spire is pointing to the ground. There is already a local prophecy that the war will end when the spire falls\n","23":" Senlis\n\nmoved here to a bivouac 2 miles from Albert – Cpl C had been celebrating St Patricks Day (he does it every pay day!) and was fast asleep in the corner of a dark barn when some practical jokers suggested holding a ‘wake’ on him.\n\nHis recumbent snoring form was surrounded by about 30 lighted candles & the boys then started a \"wailing\" It really looked most gruesome. The noise awoke the ‘corpse’ who on first coming too am sure thought he was a corpse – He was too drunk to rise but gave vent to his feeling. This incident must now close on \na\/c\n account of the language of the body which was most fluent.\n","24":" 23\/16\n\nCame off horse picket at 10 p.m there had been a terrific bombardment the whole evening & several of the fellows were going \n\nup to a redoubt on a hill a mile away to watch so I went up with them & we stopped there until 1.30 a.m. The Trench flares were going up for miles on either side but directly in front of us was where the chief fire was concentrated It looked an absolute hell of bursting fire & it seem impossible that anyone could live through it.\n\nI learnt afterwards that our Infantry assaulted it at 2.30 a.m. captured four lines of trenches & the viallage of Pozieres.\n","25":" 27\/16 (Thursday)\n\nHad a good surprise today – learnt that the 49th W.R. Howitzers horse lines were only ¼ \n\nmile from us – went down & met A. King (Jack K’s brother) all the Ben R. fellows were up at the Gun Pits – so they lent me a horse & I rode up behind their Cooks cart to see them. Passing through the village of Aveluy\n\nThen we crossed the Ancre Marshes formed by the overflowing of the Ancre which was one of the causes of Von Klucks failures in the early days – they say that when these marshes dry up somewhat one can see the remains of his transport waggons etc. \n\nAll the old Ilkly & Berk Boys had a surprise at my arrival The two Daves\n\nthe two Richardsons, Reg Rhodes & Jack Eddison (now Captain) & Paul Steinthal (now Petrie) Major O.C I stopped till dark & did not get back to our lines till 11 p.m.\n","26":" Bonneville\n\narrived here from Senlis yesterday afternoon about 15 miles back, a very hot day which the horses found trying, Passed through the villages of Contay & Herissart en route. Various units of the 1st Division are here waiting for reinforcements to make up their strength again. We have to go 1½ miles to water our horses (that means 3 miles each journey 3 times a day)\n\nto the village of Montrelet hidden away among the woods in a deep valley\n","27":"\n\nAfter 2 days at Bonneville we moved back 4 miles to a fresh ‘Bivvy’ handy to water at Pernois & have been here since.\n\nThe Division is on its way in again. The Infantry Brigade passed out yesterday & the Divisional Troops expect to move out today.\n\nThe 2nd Division has just come out & is billetted round about here ‘Scottie’ in the 20th Battn is only 400 yards away. I saw him last night he has had a charmed\n\nlife up to the present but I would have liked last night when I went to look him up that he had got a nice ‘Blighty’\n\nGus Nicholls returned to the company last night from the Artillery unit he is attached to in order to get a new pair of horses as his team – the 2 crack greys – were hit with a shell & killed & although he was lying alongside he never got a scratch.\n\nYoung Panton in a frivolous mood wrote out a mock programme & as it contained many Topical Allusions I have made a copy of it\n\nTonights the night at Munro’s Menagerie\n\nBumper Programme of Dyed-in-the wool Brand of Performers from all parts of the World\n\nThis menagerie has successfully toured Australia – Egypt Gallipoli & Tripoli & is now showing in France\n\nDon’t fail to witness this great collection of freaks as there may not be another war.\n\nProgramme\n\nOverture by Orchestra Useless Underwood (Conductor) \"Don’t go down the mine Dad\"\n\n(1) The 3 loose-legged Comedians (Deadlegs – Ridie & Abdul)\n\n(2) Firey Frank in his stockwhip manipulation\n","28":" Officers Quartette \"I lost the Convoy in Flanders\"\n","29":" The OXO Trio \"Eccentric Dancers\"\n","30":" Chorus of N.C.O \"Give me the next Commission\" followed by an exhibition of blowing & voice throwing\n","31":" Imitation Gas Attack by Prof Gosling\n","32":" Mad Mul The Saviour of Soles will lecture on crimes & their punishment\n","33":" Drivers Coon Song \"Hark I hear dem pole chains rattling\"\n","34":" \"Nippy Noel will recite \"Who pinched the Bacon from the Sergeants Mess\" or \"I didn’t want to do it.\"\n\nInterval\n\nof a few minutes only (During Interval no drink containing more than 5% of alcohol to be consumed) a nice hot cup of tea can be obtained at the cookhouse\n\nOverture ‘Lights of Abbeville\"\n","35":" Bomber Brown will give an exhibition of Bomb throwing (Patrons are requested to be ready to Duck during this performance)\n","36":" Whistling Rufus ‘Hush the Picket Sleeps\"\n","37":" Deadlegs & his educated Bully Beef\n\nGawd Save Ireland\n\nTom-o-the-Diddlo\n\nManager\n","38":" Rubempre\n\nhave been here 3 days on detachment duty with D.E. \n\nThe","39":" Div. is ‘going in’ again & we leave this afternoon for Albert\n","40":" Albert\n\narrived last night and are camped near a long 12\" Naval Gun on a railway mounting which was firing as we passed & nearly sent the horses silly\n\nHave been out this morning distributing rations to several working parties Guns of all sizes firing but saw very little reply from the Huns.\n\nPassed through what was La Boiselle but should not have known it had been a village unless told – Not a wall\n\nstanding 5 feet high. Tremendous shell & mine craters alround & the line of the German Trenches almost indistinguishable. It seems impossible to have lived through such an upheaval. Although all the German Dead had been put into shell holes & covered over – yet the smell was very bad.\n\nWatched two anti aircraft guns firing at a Taube & they got it. Must have hit the petrol tank for it caught fire & came down looking somewhat like a falling rocket or shot pigeon. Fell I believe just outside our present\n\nline of trenches in no man’s land & if the pilot was not already burnt he must have been instantly killed by the ‘bump’\n","41":"\n\nOur","42":" Division has done its bit on the Somme & has pulled out. \n","43":" we trekked back to Rubempre, Friday on to within two miles of Doullens where we entrained yesterday morning & came North again. We detrained last night at Hopontre Siding near Poperinghe & are bivouaced close by waiting to march to our billets on this sector of the Ypres front.\n","44":" 9\/16\n\nWe have been stationed since arriving at Hoograf\n\nand our Infantry has been doing short spells spells in the Ypres trenches with longer spells in the rear billets & huts Our spell is over & we are under orders for a move in a few days \n\nIt is distinctly Autumn weather now. We have had some very wet & cold spells & during these days have been covered in mud & wet through. This is what we must expect as a regular thing during the winter & we are none of us looking forward to it to say the least. One & all of us would not be sorry to be sent to Egypt for the winter again, although we cursed\n\nthe place heartily while there & hoped when leaving never to see it again\n\nWe all prefer the Belgium country people to the French they seem much more hospitable & ready to \"put themselves about\" in doing little things for us although they are just as keen over the \"bawbees\". More enterprising in fact every little cottage seems to be a small store.\n\nNo leave to England yet The officers, Batmen, clerks & a \nfair\n good number of NCO’s have been but the poor Driver who is bearing the brunt of the hard work in this Corps has had none. It is a damned scandal many of us with over\n","45":" years service without a crime & yet preference is given to Batmen etc who have the softest of jobs – \nno\n jobs that a man who respects himself won’t take on.\n\nBut it is the way of the army a thing like this should not go by favour but should be settled by length of service all on an equal footing There is a very discontented feeling over this matter especially when the press correspondents write articles in the Australian papers saying that all the \"old hands\" have been over on leave etc.\n\nMany remarks have been made about lax discipline of the \n\nAustralians but when one is close to the line & in action – no-other force gets the job done with less fuss than our fellows – But apart from that when more or less off duty they persist in neglecting to salute every little Tom, Dick or Harry who has just got a Star up most probably through family influence. It is a silent expression of contempt for the social \"caste\" that they attempt to keep up\n\nIt may have been alright & necessary in peace days when the officer & man were each drawn from a different education & home & were \ndoing it\n soldiering\n\nfor a profession. But in these days when one has just volunteered for the war & all made equal home sacrifices. It is galling when one does go into a town with a free afternoon to find the only decent hotel & restaurant where one can get a civilized feed marked \"officers only\"\n\nWe \noff\n often discuss the snobbishnes & selfishness of the many things we see going on around us like this but we have no redress – one just grins & bears it – So thank God for a sense of humour & the fact that ones mates are as good & straight a mob\n\nas one could possibly get\n","46":" Albert again\n\nA week last Sunday morning we (Bob Duncan & I) reported with our limbers to Div. Engs. picked up our loads of Baggage & Rations & joined the","47":" F.C.A.E. on trek to Rlway. The men of the D.E going on with part of the Baggage by Motor Lorry. \n\nThree days trek passing through some of the prettiest scenery imaginable far different every thing – people included – \nfrom\n to the stricken belt of front we have been so used to & come to regard as France. Passed through Steenwoorde, Cassel, Whatten & \n\non Tuesday evening reported to D.E. billetted in a brewery at at little village of Tilques about 5 miles from St Omer\n\nToo late to get anything hot to eat or drink in the village & as we were cold & famished I told Bob to look after my horses & I would do some foraging. Appealed to a Mlle in the Brewery Yard about making us some hot coffee – She came back & said yes come into the house\n","48":" in a few minutes we entered the back & found the Mlle who turned out to be the servant – seated in the back living room with the Brewer & his wife who were just finishing\n\ntheir supper. They seemed a bit frigid at first but we have got pretty thick ‘hides’ nowadays & they soon thawed unde the influence of my \"Parlez-vous ing\" as Bob & I made our selves at home & put 2 tins of Maconochie into the oven to heat They put a jug of beer in front of us & then gave us some hot coffee & cognac. \n\nBilletted in Tilques for 3 days & spent each evening in their house & they told me if ever passing through again to be sure to go & see them.\n\nThe evening before we left Bob – myself & Ted Hamel arranged for the Madame at a farm next the \n\nBrewery to make us a dinner who should I meet that afternoon but Scottie just come into the village with an advance Billetting Party. So he made a fourth.\n\nMadame had ‘spread herself’ & we had the happiest little dinner imaginable Chicken Broth, Boiled Fowl, White Sauce, potatoes, cabbage, carrots & turnips, a bottle of Vin Rouge & coffee all for 10 francs.\n\nLeft Tilques Saturday morning at 3-a.m – freezing hard - & got to Ardruick Railhead at 7 a.m. Ardruick was a big ammunition depot & had been bombed in July by the German Planes & blown\n\nup – a most tremenduous & disastrous explosion of course kept out of the papers – all the houses in the village close by fallen in with the shock Railway waggon wheels & other debris hundreds of yards away from the line\n\nEntrained at Ardruick & came by Rail through Calais, Boulogne Etaples, & detrained east of Abbeville did about 10 miles that night & billetted at a little village of Ailly.\n\nToo late for the cooks to get us anything hot but persuaded a cottager to stir herself – Next day on to St Sauver arrived at 7.30 p.m. again the cooks didn’t light their fires but got an\n\nomelette with coffee & cognac at a cottage – Very cold at night for sleeping in the open now.\n\nnext day left at 8 a.m. passed through Amiens & after pushing on reached this Billet at Belle Vue farm at 9 p.m. dead beat men & horses the latter especially as the column had got no oats with them & our horses had nothing since 6 a.m.\n","49":"\n\nWent this morning with the limber to draw Rations – The dump is at Fricourt then one of the villages captured in the first push of","50":" Now about 3 or 4 miles behind the line Shows how we have advanced since then – Everything a sea\n\nof mud & bitterly cold – We have got a waggon cover slung between two trees & a fire pot burning underneath tonight so things are comparatively comfortable.\n","51":" Pommies Redoubt\n\narrived here on Monday afternoon after being 6 hours on the road doing 4 miles. The road being blocked with traffic as the","52":" Aust Div was going in \nthe\n & the","53":" Div coming out.\n\nPassed their Inf. on the road Munsters – R.IR. – Essex, Lancs Hants. They looked a pitiable sight – slathered in mud & shaken with the strain & hardships. \n\nYesterday\n","54":" took rations out to the R.E yards at Montauban & Longueval \n\nRoads in a terrible condition – transport & guns of every description – infantry going through both ways in single file. Rations & Ammunition going up on Pack mules & horses – Drivers ride one horse with 4 shells & lead another horse with 8 shells\n\nUndulating country – devastated by shell fire \nwhich\n by day it is one mass of men & horses and at night just a dark screen pricked out with twinkling camp fires & the flash of guns.\n\nIt is rumoured that we are preparing\n\nfor a great push against Bapaume as soon as we have a spell of dry weather.\n\nI am sleeping in a canvas hut – some of the men are living in \nan\n old German Dugouts on the door of one of which is still hanging the sign \"Gott strafe England\"\n","55":" 8\/16\n\nHave been taking rations up each day to the dump at Longueval & Montauban – a good deal of shell fire at the cross Roads near the Dump. Roads blocked with traffic & in bad condition\n\nYesterday left at 8 a.m. & got back at 5 p.m. on the road all the time. 9 hours doing about 6 miles. Owing to them shelling\n\nthe dump the motors taking up Material did not go up today & naturally as I went up today did not see a German shell anywhere near.\n\nLast night the Germans made an \nbig\n airraid. We were awakened about midnight by our anti-aircraft guns & the sky was alight with searchlights. In a few minutes saw a tremenduous outburst of flames many miles away & then a terrific explosion which fairly shook the ground many small explosions with an occasional big one went on for several hours through\n\nthe night. We guessed that a Taube had successfully bombed an ammunition dump.\n\nThis morning learnt it was a French Dump that had been blown up but of course heard no details.\n","56":" 20\/16\n\nThe Division ‘pulled out’ about a week ago & we put in 4 days at Ribemont & came on yesterday to Vignacourt (10 miles from Amiens) where we are to put in the rest of our spell.\n\nThe weather has been very cold & several frosts & our first fall of snow It was only a taste of what we must expect but I am not looking forward\n\nto the winter at all.\n","57":"\n\nWent into Amiens 10 miles away yesterday – A very beautiful Cathedral but the facade & the interior woodwork is all sandbagged up as a precaution against air-raids nothing else of interest. \n\nJust a good provincial town of 100,000 inhabitants at present filled with British soldiers – specially officers – Prices exhorbitant was charged 1 franc for cup of cafe au lait at a middle class confectioners.\n","58":" Ribemont\n\nwe arrived back here on","59":" a terribly cold\n\nfrosty day with a slight fog All the trees & grass white with the frost – about 20 miles riding & alternately walking to keep warm.\n\nThe","60":" Inf Bgde who have been spelling at Vignacourt were sent on by train instead of the usual marching as \nthere\n their feet are so bad through the frost & wet of the trenches\n\nHave just heard that Montauban Railhead where we draw the supplies from was heavily shelled a few days ago & amongst other casualties Bob Kennedy, George Hyde & G Brandie of our Company were ‘blesse’ slight ones only;\n\nWe go back\n\ntomorrow into the line for another short period & expect shall again be stationed at Pommiers.\n\nHave just received the Australian Papers with reports of the Conscription & Anti Conscription meetings It fills me with nausea to read some of the speeches – We know that the issue has been lost & it makes one feel almost ashamed of one’s adopted country. Am afraid the voting out here at the front went ‘against’. Personally I voted ‘for’ \n\nFor many reasons it went against the grain to do so but it was the only possible thing to do – for after all the one thing that matters is to \n\nwin the war. I think most of the chaps have not really understood the vital issues & have looked on it from a personal point of view.\n\nDrawn from a country where there really is freedom of action & equality – They have been for 2 years denied freedom of speech and have had many petty grievances which ‘rankle’ & seen much hypocrisy. They have in fact the feeling in war time that Kipling writes of in peace time in his poem which includes the line \"We serve no redcoats here\"\n","61":" as I think why they have turned it down is that this is the first\n\ntime they have been allowed to express an opinion & they have said \"no damn it no\" out of contrariness. Their spirit & morale is just as high as ever – only tempered with experience.\n\nThough how people in Australia can refuse to send the single men away & leave those who have gone possibly short of reinforcements beggars my understanding.\n\nFor the voters who have near ones away must now far outnumber the voters with eligibles they are trying to shield. Perhaps it is because they havn’t confidence in the present Government to handle\n\nconscription. The Kings Rules & Regulations which were framed for the guidance of a small professional army are not suited for the mentality of a nation in arms & the freest of all nations at that – Australia\n","62":" 26\/16\n\nPulled back to Pommiers over a fortnight ago but was at once taken sick with an influenza chill – was relieved of my team & have been ‘laid up’ back with the Company at Becondel in a ‘Bivvy’ – a pretty miserable time – couldn’t eat the army rations & have been dieting myself as best I can on\n\nSoup squares, Oxo, Condensed Milk etc made on the oil-drum fire place we have in the ‘Bivvy’\n","63":" 24\/17. Etaples\n\nSince my last entry I have been more or less on the sick list – Early in January I returned to duty with the Engineers & was up at Pommiers – I had only been back 4 days when I was given my long expected leave to Blighty – wasn’t feeling over fit but as \nas\n I told my O.C. I would have crawled there.\n\nWell a diary of those 10 days would fill the rest of this book enough that I \nlived\n every minute of them & grudged\n\nevery minute in bed. – \n\nFunny I had been told of it but couldn’t believe it until my own experience but the first 2 night could hardly sleep in a bed also I used to be fond of pastry & fancy cakes but found now I couldn’t look at them at all – had lost all taste for them. –\n\nGot back the end of Jan. & took over my team again – When I had left for leave everything was a sea of mud but on returning it was frozen hard & was in the grip of \nof\n the keenest frost for over 40 years I had never experienced anything like it\n\nAmongst other things – icicles on\n\nthe noses of the horses formed by their breath condensing – pulled the blankets over my head at night & woke up to find where my mouth was – it was frozen hard & covered with a white hoar frost on the outside of the blanket – it was my breath condensing \n\nGreat difficulty in watering horses as the troughs & shell holes were frozen solid – While washing was just a neglected detail. \n\nSeven days of it did for me & I had to report sick & was at once ordered away to hospital with Bronchitis after passing through various Clearing\n\nStations landed down by hospital train at the Base & was sent to Casino Hospital – a very pleasant change & one I was not too sick to appreciate but my chief grievance was \ntoo\n being \ntoo much \n \"tucked in bed\" that is ‘niceness’ seem to count more than ‘comfort’ & the nurses turn the sheets down so as just to leave your shoulders out & then tuck the close in to the sides so tight that it leaves a fearful draught down your back!\n\nFrom there to a Convalescent Depot – nine days there & then marked A. & \n\nentrained for Etaples to Details we left Havre at 10 p.m & got to Rouen at about 10 next a.m. we had to go to a Rest Camp there to wait a train for Etaples In fact we were hung up there a week for some reason or other Another nights travelling & we reached Aust General Base Details there to wait a draft for the ‘line’ again. –\n\nWas at Etaples 5 days & taken sick again this time German Measles & rushed off to Hospital. My chief ‘grouse’ about this time was the \nearly\n morning wash – In fact they seem to be always washing down\n\nhere whereas we have learnt how unecessary it all is – as one chap \nside\n up the line was boasting about his personal cleanliness & said \"he always had a wash once a week whether he wanted it or not\"! \n\nWell at this place it depended you were first or last on the night orderlies round But if you were unlucky enough to be first (& I was for 1 week) he used to \nwake you up & tell you\n bring a basin of hot water & \ntell\n wake you & tell you to sit up & have a wash at 3.30 a.m. If you were lucky last it was 5. a.m. \n\nWell I \n\nsurvived the early washing & after 11 days there had a week in the Con. Camp & have been back in Base Details about 4 days waiting for another draft.\n","64":" 16\/17\n\nThis morning on early morning parade my name was called out amongst others mostly old","65":" Division men for the next draft up the line & I am not sorry to be off again as we are all bored with the monotony of this camp life – the little we do has no interest in it & we are all prepared to put up with the mud & hard work in return for the comparative freedom of action up the line where one gets about ones work without eternally ‘shunning’ & ‘Stan at easing’\n\nThough I have enjoyed the evenings here in the Recreation Huts always some lecture or Entertainment on. \n\nOne particularly good lecturer who always drew & held a crowd Chaplain Miller a fine speaker have heard him on ‘The Martyrdom of Service\",\n\n; \"What we are fighting for\" & \"Democracy & Liberty\" \nall of which\n in all of which he impressed us not to forget the great issues on account of the petty annoyances & hardships.\n\nAlso amongst others heard the","66":" Life Guards Band. The music didn’t please everyone for one man yelled out to them to \"play some Ragtime\". \nBut there are\n\nI wonder if our officers ever think we \n\nnotice things & give us credit for any criticism \nof their doings\n & memory \n\none day a Major came into the mess hut & warned us \"not to waste \nbiscuits\n as economy was of great importance & every \nindividual\n effort was necessary\" That day I was up at the Quartermasters Hut & saw in his waste box two slices of \nbuttered toast thrown away\n that I would have willingly paid a franc for, for we are on short bread rations in the mess hut & have to make up on biscuit. Also \nthe following\n the following day the officers gave a dance & we had to clean out the mess hut & I was one that was set to shred out about 7 lbs of \nGover\n\nArmy Candles to tread into the floor. Also I gave seen their preparations for supper and their regular mess menus \nnever\n and then they come & ask us not to waste biscuits! \n\nIt strikes me as ignorant hypocrisy & a little \npositive\n example would be better than all the requests but one says nothing just \nlike\n lies low like Brer Rabbit but thinks a lot.\n\nAnother piece of the first duty of an officer to \nput the\n study the comfort of his men We had a few wet days & one of the tents in the officers lines leaked & we were ordered to pull it down & \nexchange\n it\n\nfor one of the tents in the mens lines! Who can blame men for voting against conscription & yet down in our heart we never loose sight of the main thing.\n","67":"","68":"\n\nWe left Etaples on ","69":"\n ","70":"\n Wednesday morning & arrived at Albert during the afternoon & camped there the night. Next morning marched down to the gas school & were issued with box Helmets & put through the gas test left there about midday & marched through Contalmaison to Bazentin where we camped the night in some huts.\n\nThe country looks more devastated than ever for now there is no traffic on the roads\n\n& no moving masses of horses & men – just a desolation without any life except an occassional man looking after water tanks etc\n\nWe left Bazentin early Friday morning & after about a mile \njoined\n got on the main Albert-Bapaume road & joined the column of traffic passing through Le Sars & Warlencourt at the latter\n\nplace the Germans had blown up a mine in the middle of the road & so the track had been taken round it. Seemed a waste of labour as it was an easy matter to run the road run & could hardly delay our troops.\n\nHalted on the outskirts of Bapaume for dinner\n\nnear some old German dugouts – very deep & the timber & labour used in building them made one think that the German had no thought of advancing just hanging on.\n\nBapaume in ruins and an occassional shell was dropping in it still as we marched through after some trouble found out where it was & rejoined \nour\n the Company about 5 o’clock about 2 mile East of Bapaume on the Cambrai road \ndeep\n dead tired – \nnot being in\n after 15 miles with ones pack up & not being in marching condition\n","71":"\n\nWe have just had our\n\nballot on the Australian elections My vote went for Hughes Party The Ministerialists & I think the majority in this Company did the same. For it seems to me they are out to \nwin\n get on & win the war without the petty selfishness & trade union quibbling of the opposition & I.W.W traitors\n","72":"\n\nThe last few days have been very hot – midsummer weather. The Taubes have been very active flying high up during the day but venturing low at night and playing their machine guns on the various camps round about\n\nNeutrals\n\nWhen the job seems rough & risky\n\nAnd you’ve got no rum or whisky\n\nKeep on smilin’, smilin’ smilin’\n\nTill you’re like a currant Bun\n\nAnd the Huns they nearly shell yer’\n\nBloomin Taubes they try & fell yer\n\nKeep on smilin’, smilin, smilin\n\nTill you’re like a bullocks yoke \n\nCause the Huns they know were martyrs\n\nNot real soldiers only carters\n\nBad the ’uns they show real pity\n\nfor the purely neutral Bloke\n\nN.J.\n\nAA.S.C\n\nBapaume \n","73":"\n","74":" 22\/17 Tuesday\n\nDetailed to take over Adeney’s team with the C.R.E while he was on leave. I pulled out on Sunday carrying some of their Baggage & also the packs & blankets of the Infantry Fatigue Party – travelling with the","75":" Field Coy Engrs. We camped that night at Contalmaison & arrived here at Lavieville \nlas\n yesterday midday.\n\nThe last years Somme Battlefield is well cleared up by the Salvage Parties stacks of shells & empty shell cases, old clothing & equipment being gathered into Stacks at the road side ready to be carted away.\n","76":" 30\/17 Wednesday Basieux\n\ncame on here a few days ago to stop with the C.R.E while we are out here spelling. – ‘Jock’ Barclay & I got a pass for a days leave in Amiens for Monday. We got hold of our passes the night before so set off Sunday evening & walked down to Buire 5 miles away so as to be ready to catch the early morning train in \n\nGot a camp for the night at Buire Baths – our camp consisted of a borrowed great coat each\n\nGot into Amiens about 9.30 a.m & had a good day, sweltering hot great to be amongst civilization & \n\nshops & trams again – got back to Ribemont Station at 9.30 very tired & were starting the march ‘home’ when a lorry came along & we hopped on & got a lift right into Basieux.\n\nOne wouldnt recognise this as the same country of 4 months ago – It is \ngot\n just one landscape of green crops with a few brown patches of ploughed ground the fruit trees in the farms & along the roads are in full blossom\n\na farm near here had the thresher going yesterday \nof course it drew\n being worked as usual by the whole farmers family\n\nThree generations of them. After tea the sight drew a big crowd of our chaps & gradually \none\n they \nchap\n chipped in & gave a hand and before many minutes it was completely ‘staffed’ by Australians & Grandmere & her descendants were standing by watching our fellows making the ‘straw’ fly.\n\nA withered & toothless old woman bent double with Rheumatics came along with a huge faggot of wood on her back. So one of the fellows relieved her of her burden & carried it home for her. She grinned & ‘swanked’ past with her escort \nwhen\n as we gave them\n\na bit of a cheer.\n\nThe people in these little village have never had such a shaking up as this war. It is like some irresistible force to them \n to have some\n for a sleepy hollow of a place \nto ha\n with perhaps a couple of hundred inhabitants to suddenly have 1500 rollicking soldiery billetted on them. They live half way between fright & laughter\n\nThe other night I saw a ‘fresh’ soldier in the crowded room of an estaminet juggling with 2 empty beer bottles & 2 glass tumblers the faces of Madame & her daughter were a picture\n","77":" 23\/17 Peronne Rd near Bapaume\n\npulled in here again with the Company \ntravelling\n from Behencourt in one long days trek travelling through Albert Pozieres, Le Sars. all last years battlefield is now a blaze of colour – covered with wildflowers \nwhere\n last winter one would have thought nothing would ever grow again –\n\nAlbert itself is being cleaned up, the least damaged houses being repaired and the inhabitants are beginning slowly to come back – a dreary homecoming it must be.\n","78":" 1\/17 Haplincourt Wood\n\nam here\n\non detachment with Colin Hall with ‘Don Ack’ (Divisional Artillery) expect to pull out in a few days – it is common rumour that we are going North to the Belgian Coast for a big push against Ostend & Zeebrugge a few days will show whether rumour is right or wrong –\n\nThings very quiet here this last hew days hardly any artillery fire & even aircraft duels are rare enough to awaken ones interest.\n","79":" 11\/17. Wednesday. Sarton\n\nWe ‘pulled out’ to near Albert five days ago & I rejoined the Coy. with my limber. Yesterday afternoon we picked up our loads of Rations after Reveille at 3 a.m. We left\n\nthe Camp & travelled to Sarton within about 5 miles of Doullens. arrived here at 12.30 – I had to go on to the village (Orville) to deliver my load of Rations to D.A.H.Q. & on my way back to our Camp picked up tomorrows load of rations which is taken along with our Companies Column to deliver at the end of tomorrows journey. Unharnessed today about 3 p.m.\n\nJust a year ago today since we entrained for the first time for the Somme front where the Division has been all the time except for six weeks at Ypres last Sept-Oct\n","80":" 14\/17 St Michel\n\narrived here\n\nyesterday afternoon & leave in the morning –\n","81":" 15\/17. Amettes\n","82":" 16\/17 Steenbecque\n\nthe country has been changing the last two days and coming along today from Amettes the latter half of the journey was quite flat – we passed through Aire an old provincial town & are now well into Flanders, today we passed the first dog team we have seen since leaving the Ypres sector – \nbegan\n","83":" 17\/17 Staple\n","84":" 21\/17 Reninghelst \n\nhave been here 3 days – there is a big number of troops & material here and our gun fire has\n\nbeen very heavy & constant these last few nights. – looks like a big stunt ‘coming off. The","85":" Aust Div Artillery that we are with are temporarily attached to a ‘Tommy’ Division. Our Infantry has not yet come up from the South.\n","86":" 26\/17 \n\nCycled over yesterday afternoon to Neuve Eglise & saw both Colling & Jimmy Shaw. Coming back at dusk I saw a procession of \nmany\n tanks moving up nearer the line, today there has been heavy artillery all day & the air alive with lanes The offensive is evidently not far off.\n","87":" 29\/17 Sunday Reninghelst\n\nThe night\n\nbefore last we had just put the candle out in the bivvy and were having a final pipe in the dark when Tom Cornes said \"that sounds like a Taube overhead\" one can distinguish the different sound of the engine & sure enough a few seconds after we heard the loud explosion of a bomb in the distance then followed others in quick succession each one nearer until one went off \nin the next paddock alo\n & lit up all our surroundings & fairly put the wind up us \n\nI was as close to the ground as it was possible to get & one could almost ‘hear the silence’ of the camp We were wondering whether the \n\nnext one would just get us But the Taube passed overhead & dropped the next further on & then the silence broke & everyone laughed. We went next morning to where the nearest bomb had dropped in an adjoining Camp of British Engineers. it had landed in the horse lines & killed thirty horses – one man killed outright & about fifteen wounded, 3 of whom died that day.\n\nIt gave us a good deal of respect for the Taube Bomb and yesterday most of us had marked down some handy ‘funkhole’ for the next visit and sure enough last night about the sam time\n\nwe heard him again & a distant bomb – the searchlights were trying to pick him up But we wern’t giving him any chances and cleared out – three of us – to a \nditch\n dry deep ditch where some trees had been felled across & squatted down & we had to laugh at each other as we were a comical sight peering up into the sky.\n\nBut this time he did not reach the village but got turned back by our ‘Archies’ & our Planes. The night wasn’t through as about 3 a.m. this morning the gas alarm went & we had to stand to with our\n\ngas helmets but the gas did not reach us.\n","88":" (Hondeghem near Hazebrouck)\n\ncame here two days ago to join up with the Div Train Headquarters about 16 miles on the road raining the whole way\n","89":" Vieux Berquin\n\nI reported last evening to D.H.Q. \nto move\n at Hazebrouck to move off with them this morning We were awakened by a visiting Hun dropping Bombs on the town and by our anti-aircraft guns \n\nThis morning as we were getting ready to move off The Germans started shelling the town with \n\na big long range gun\n\nImmediately the people started to clear out of the town – women pushing prams, carrying & dragging babies along – many of them just looking as though they had jumped out of bed into their clothes – it was rather pitiable\n\nBut it had its comic side one fat old man on a bike collided with another ditto running & they both went sprawling on the ground they got up & started to wave their hands about & talk in their usual French style of quarrelling & we were wondering if they \n\nwould ever get past words when another shell came along & they forgot all about their quarrel & \n‘got’\n as fast as they could.\n","90":" 18\/17 \n\nStill at Vieux Berquin and no idea how long will be here \n\nthe last week I have had a \nreal\n bed at a little Estaminet across the road for which I pay the exorbitant price of ½ franc a night\n\nThe last few nights – Fritz aeroplanes have been very active round about here – we are having bright clear nights and every night \nat early dark about 9.30 p.m. we have heard his engines &\n we have got\n\nin the habit of sitting up until it \nis over\n is all over.\n\nI & another fellow who shares the room with me sit outside the estaminet with the Frenchie & wife & their family. At the first warning the wife usually takes here her kiddies below into the beer cellar\n\nPunctually enough the last 4 nights at early dark about 9.30 p.m. we have heard their engines and then our searchlights have lit up and the Archies & quick firing guns started and then \none hear\n after a few minutes one \nhears the\n sees the flash & hears the crash of the bomb.\n\nThere is a certain amount of relief when one hears him get rid of his bombs. – We have been lucky he seems to have peppered the surrounding villages but we have escaped his attention so far.\n","91":" 3\/17.\n\nAnother visit from the Taubes last night in the surrounding neighbourhood \n\nHeard\n The Company up at Dickebush has had its first fatal casualty in France. Hogan of the supply being killed by a bomb & two \nof\n Drivers wounded (Seymour & Turnbull) S. is away at present on a months rest!\n\nWe have had some very wet stormy weather this last fortnight but today is bright & warm & looks as though it has \n\nsettled for a spell of good weather\n\nNo news of any move yet.\n\nHop picking started today, this morning early the cumbrous french farm waggons went out loaded with women & girls to the hop fields for the hop harvest which lasts some two or three weeks – it is piece work seven centimes a kilo and this evening about 8 pm the \nlittle girl of 14\n daughter of my landlord \nage\n almost 14 years old came home with the news that she had earned 4 francs. A huge sum to her – when the wage for a days farm work of a man is only 2 or 3 francs – Julienne the mademoiselle next door had earned 7 francs. She is the heroine of a little village\n\nlove comedy & comes in for a good deal of chaff which she doesn’t dislike. Her father is an insignificant little man but a domestic tyrant who objects to her fiance a young French soldier – the latter was home on leave a fortnight ago and it was amusing how he hung about until the old mans back was turned – and at night when the old man was snoring below she would be leaning out of her attic window whispering to ‘Romeo’ below with all the neighbours for an audience.\n","92":" Scottish Line Ouderdom\n\nMoved up here yesterday from Vieux Berquin via Caestre where I left\n\nsome officers Baggage at a Reinforcement Camp & then travelled on through Fletre, Goedaervelde & Reninghelst arriving here about 4.30 p.m. The roads particularly the last part of the journey one long column of Australian Troops all moving ‘up’ \n\nAlthough the rain has held off this last few days there is a decided autumn feeling about the weather now.\n\nBob Evans \nwho\n about 3 months ago \ngot\n after a good deal of trouble got a furlough to Australia to fix up his fathers affairs who had just died – Have just heard that he has been drowned in a U Boat affair – After taking his chance out here – to be \n\ndrownded on the way back – makes one a fatalist.\n","93":"\n\nYesterday & today have been taking rations up to advanced HQ near Dickebush & then gone on to the R.E. Dump near Ypres for sandbags to complete the H.Q Camp. Hot & very dusty weather.\n\nToady between Dickebush & Cafe Belge – Fritz was sending some heavy stuff over at one point of the road – and we went through at a gallop for about 400 yards.\n\nOne shell had torn a hole in the road just ahead & we smelt the powder as we\n\nswerved past. But one whole attention was on the horses & the road ahead as one could see little for dust & the motors were coming throgh at full tilt.\n","94":"\n\nOur Infantry have been over the top & taken their three objectives & are to pull out in a couple of days as the 1st Division is now a ‘Storm Division’ kept for offensives only. Behind the lines we have had a lively time with air raids the last day or so. The night before last Fritz put a lot of heavy shells over \nnear\n\nround about here although this is quite 8 miles behind the front line & in the morning we were wakened by the machine gun of his aeroplanes playing on some road near here –\n\nLast evening he got one of our sausage baloons & we saw it destroyed by fire while at dark he was over with his bombs & although our searchlights ‘picked him up’ & we saw him in their light he dived & dodged the lights\n\nIt has been cloudy today and about noon a fleet of \n16\n 13 of his planes suddenly came out of the clouds & dropped their bombs & then\n\ndived back into the clouds before our guns had a fair chance to get at them.\n\nLast year bombing raids were a rarity this year they are an every night occurence & if the war lasts another year & the same rate of progression keeps up \neveryone will\n it will be pretty lively\n\nSept 28\/17 Steenvoorde This is Friday\n\nwe arrived here on Tuesday and are having a quiet time as regards work though the town is lively enough being filled with troops – I saw Alec Macrae of the","95":" Battn a couple of nights ago \n& last\n\nThe","96":" Division on passing through this town on their way up to the line & last night hearing the","97":" Brigade were just the other side of the town looked up both Colling & Jimmy Shaw.\n","98":" Scottish Lines\n\narrived here from Steenwoord yesterday at midday passing through Reninghelst I saw David Bellhouse on a motor lorry. I shouted out to him & he jumped off & we just had a word while the column was halted. a strange meeting – \nhe had been\n\nClear sky & a full moon which mean Bombs & Fritz delivered them in large quantities last night\n","99":" Dickebush\n\nhave been up here the last 4 days & am \nkept\n taking up the rations to our advanced headquarters in Ypres. it must have been a beautiful old town but now after three years of artillery fire is just a mass of debris.\n\nI pass through the Lille Gate \nand\n between the solid old ramparts of the town which still stand though bearing the marks of many shells & across the moat upon which I noticed \nswimming serenely\n amidst all the noise of traffic & of our guns – two swans \nswim\n\nswimming serenely\n\nThe weather has broken and mud & rain prevail & we are back at last among winter conditions We have got the fire bucket going in the bivvy tonight for the first time since last winter\n","100":"\n\nJust three years since we sailed from Sydney Harbour\n\nYesterday afternoon I rode over to Vlamertinghe & saw Tom the first time for 12 years – \n\nam back at Scottish Line with D.H.Q the Company is still up at Dickebush and having a pretty hard time In addition to the ordinary work\n\nthey are sending up 30 waggons each night with road timber to Westhoek Ridge – they struck a rough patch the other night and had 7 waggons blown up – 5 horses Killed several more wounded but luckily only one Driver (Musgrove) wounded. \n\nThe air fighting never ceases day & night \nthe Germans are\n Couple of days ago I saw a German brought down by one of our airmen from a great height the wing of the plane came off & \nthen\n after the aeroplane had fallen some hundred feet we saw the pilot drop out & come tumbling over down\n\nto earth faster than the plane \n\nA man who was near told me the pilots corpse hit the ground head first and went \nnea\n about 2 feet in \noff of\n with the rest of his body sticking out – of course it was just a pulp.\n","101":" 5\/17\n\nStill with D.H.Q on the Ypres Front – am at present taking rations up to advanced Headquarters at Lille Gate each day from Dickebush \n\nFritz has been very busy ‘bombing’ each night & pretty well everyone even back here is ‘dug in’ even the horse lines have ramparts of earh build behind the horses.\n\nThe Company is still \ntak\n working at night on the advanced road work \n\nBert Ridewood was killed up there – Devine & Bill Baird have been wounded while we have had over 20 horses killed, a number wounded & lost some 30 waggons –\n\nQuiney & Macrow have been given the M.C. while Humphreys, Col Hall, L. Collen S. Dunstan & Percy Dixon have got the Military Medal.\n\nThey dropped a bomb in the Company lines a few days ago & killed the Majors Hack & wounded 15 other horses luckily no men touched – It was the worst\n\nnight we have had from his bombs – he was dropping them all night like shelling peas!\n","102":" 13\/17 Renescure (W. St Omer)\n\narrived here on the","103":" from Reninghelst some 20 mile trek – billetted in the barn of a farm – & last night Gosling, Adeney, Gaynor & myself got the Madame of the farm to cook us a dinner of Soup, Chicken, Chipped Potatoes & White Sauce, with a couple of bottles of Vin Blanc – \nafterwards\n Adeney had brought his violin & when he started playing they invited us all into the kitchen to sit round the stove ‘en famille’\n\none of the family was home ‘en permission’ & they opened a large bottle of Champagne in his honour so what with the violin & choruses we had a merry evening\n","104":" 15\/17 The Chateau, Fauconbergue\n\narrived here last night & are stopping here a few days. The Chateau is a very fine place but the owners are away in Paris & it is given over to a H.Q. Billets when troops are moving through. We have got our horses tied up practically on the front lawn\n\nThe Country is now quite different to flat Flanders it is hilly with running streams.\n","105":" 18\/17 Samer –\n\narrived here today after about 18 mile trek and are billetted on a farm about 1 mile out of the village. It is we are only 15 kilo from Boulogne. It is typical November weather – mild grey days\n","106":" 14\/17 \n\nFor the past month six of us have been billetted on the farm of Lance-Lelin, Breuil W. Samer & it has been quite a home – The most kindly people we have met in France\n\nWe have had a table put on one side for us in the big farm kitchen & had the use of their fireplace in the kitchen while we have been able to buy milk from them & they have given us\n\napples & cider \n& as\n \n\nIt has been a pleasure to give them an occasional hand with the farm work which like all farms in France suffers from want of labour. The farmer is of military age but by one of those practical French Laws – because he has six young children he is exempt from military service\n\nThe Division is going into the line again & I leave tomorrow morning for the trek\n","107":" 18\/17 Dranoutre\n\narrived today after 4 days hard trek from Samer – bitterly cold with sleet & freezing hard. The mild\n\nweather is over and we are now in the grips of winter\n","108":" 29\/18 \n\nJust returned from my second leave to Blighty & expect to pull out any day for a rest The weather is quite mild & we are experiencing a much better winter than last & also under much better conditions than on the Somme.\n","109":" Merris\n\nWe pulled out here about 3 weeks ago for a Rest & expect to be moving ‘in’ again in a few days time. This is a quiet little village between Bailleul & Hazebrouck – both two fair sized country towns.\n\nThis has been the mildest February for Europe that I have ever remembered.\n\nHorwood has left us for a furlough to Australia The first man to go from D.H.Q. We are all hoping that it is the commencement of the promised furlough to Australia for the original men.\n","110":" La Clytte\n\nwe pulled in here on","111":" – (it is a sector of the Ypres front) it was one of the bitterest days I have spent on the road & glad it was only some 16 kilos journey. \n\nThe old church in the village is interesting for the fact that on the \nchurch\n tower where\n\nthe clock \nusually\n is usually placed is occupied by a large sundial on the two \nfaces\n sides that face the sun\n\nThe first time I passed it – I was with a bush bred Australian & he did not know what it was.\n","112":" La Clytte\n\nare still here & during the past 3 weeks Fritz has been remarkably active shelling these rear areas – keeping up a slow but steady fire day & night on the various little villages & crossroads. it is more or less blind firing and comparatively ineffective. \n\nRumours are\n\nflying about today – we have just got the news that Fritz has attacked on a wide front near St Quentin & Cambrai & pushed our fellows back considerably & we are all debating on our getting a mover down there again.\n\n"}}