{"Document Name":{"0":"Diary_0036","1":"Diary_0036","2":"Diary_0036","3":"Diary_0036","4":"Diary_0036","5":"Diary_0036","6":"Diary_0036","7":"Diary_0036","8":"Diary_0036","9":"Diary_0036","10":"Diary_0036","11":"Diary_0036","12":"Diary_0036","13":"Diary_0036","14":"Diary_0036","15":"Diary_0036","16":"Diary_0036","17":"Diary_0036","18":"Diary_0036","19":"Diary_0036","20":"Diary_0036","21":"Diary_0036","22":"Diary_0036","23":"Diary_0036","24":"Diary_0036","25":"Diary_0036","26":"Diary_0036","27":"Diary_0036","28":"Diary_0036","29":"Diary_0036","30":"Diary_0036","31":"Diary_0036","32":"Diary_0036","33":"Diary_0036","34":"Diary_0036","35":"Diary_0036","36":"Diary_0036","37":"Diary_0036","38":"Diary_0036","39":"Diary_0036","40":"Diary_0036","41":"Diary_0036","42":"Diary_0036","43":"Diary_0036","44":"Diary_0036","45":"Diary_0036","46":"Diary_0036","47":"Diary_0036","48":"Diary_0036","49":"Diary_0036","50":"Diary_0036","51":"Diary_0036","52":"Diary_0036","53":"Diary_0036","54":"Diary_0036","55":"Diary_0036","56":"Diary_0036","57":"Diary_0036","58":"Diary_0036","59":"Diary_0036","60":"Diary_0036","61":"Diary_0036","62":"Diary_0036","63":"Diary_0036","64":"Diary_0036","65":"Diary_0036","66":"Diary_0036","67":"Diary_0036","68":"Diary_0036","69":"Diary_0036","70":"Diary_0036","71":"Diary_0036","72":"Diary_0036","73":"Diary_0036","74":"Diary_0036","75":"Diary_0036","76":"Diary_0036","77":"Diary_0036","78":"Diary_0036","79":"Diary_0036","80":"Diary_0036","81":"Diary_0036","82":"Diary_0036","83":"Diary_0036","84":"Diary_0036","85":"Diary_0036","86":"Diary_0036","87":"Diary_0036","88":"Diary_0036","89":"Diary_0036","90":"Diary_0036","91":"Diary_0036"},"Date":{"0":"unknown","1":917.0,"2":918.0,"3":919.0,"4":920.0,"5":921.0,"6":922.0,"7":923.0,"8":924.0,"9":925.0,"10":926.0,"11":927.0,"12":928.0,"13":929.0,"14":930.0,"15":931.0,"16":932.0,"17":933.0,"18":934.0,"19":935.0,"20":936.0,"21":937.0,"22":938.0,"23":939.0,"24":940.0,"25":941.0,"26":942.0,"27":943.0,"28":944.0,"29":945.0,"30":946.0,"31":947.0,"32":948.0,"33":949.0,"34":950.0,"35":951.0,"36":952.0,"37":953.0,"38":954.0,"39":955.0,"40":956.0,"41":957.0,"42":958.0,"43":959.0,"44":960.0,"45":961.0,"46":962.0,"47":963.0,"48":964.0,"49":965.0,"50":966.0,"51":967.0,"52":968.0,"53":969.0,"54":970.0,"55":971.0,"56":972.0,"57":973.0,"58":974.0,"59":975.0,"60":976.0,"61":977.0,"62":978.0,"63":979.0,"64":980.0,"65":981.0,"66":982.0,"67":983.0,"68":984.0,"69":985.0,"70":986.0,"71":987.0,"72":988.0,"73":989.0,"74":990.0,"75":991.0,"76":993.0,"77":994.0,"78":995.0,"79":996.0,"80":997.0,"81":998.0,"82":999.0,"83":1000.0,"84":1001.0,"85":1002.0,"86":1003.0,"87":1004.0,"88":1005.0,"89":1006.0,"90":1007.0,"91":1008.0},"Entry":{"0":"\n\n","1":" We draw our kit tonight & go to Weymouth tomorrow. Rang up Com’ Bank London but theres nothing there for me. \"Rotten luck\" ! Unable to get artificial eye until we reach Australia.\n\n20 Up fairly early. 60 of us going today. Believe 300 wounded are waiting to come in from Plymouth & Wandsworth. Nice fine day so will have a good trip. Left London at 12.25 & arrived Westham Camp Weymouth about 5, after a nice trip through beautiful Country. There are about 25 or 30 of us \n\n(Dorset) Weymouth (Dorset)\n","2":" in this hut & we sleep on straw mattresses on the floor. \n\nJust been down town & made a few purchases for the voyage \n\nFeeling goodo. Was paid £ 1 at Harefield so am fairly financial yet.\n\n21 Rotten night last night , fellows coming in all night variously shickered & confoundedly talkative and I was scratching some too – must have been the rough blankets. We are not allowed in the main part of the town without a pass, but can ramble about elsewhere. Pretty rotten camp & not a very\n","3":" clean hut, but we wont be here long. \n\nRather nice here by the quiet backwater, with the green low lying hills in the foreground & the intermittent chirping of the birds. And what a change after the everlasting desert, the intolerable heat & the dirty niggers of Egypt. In this secluded spot there is a peace & quietness not found in the vastness of the desert. Passed the Doc & his S.A. inspection safely\n\n12.15 Just remembered today makes 1 year older – (24) Bought some beautiful strawberries for 8’ a pound. Managed to get hold of a\n\nJune 21 pass & came down town about 5 pm. Had nearly reached the bridge when I met Fred Melraine, so we strolled through the town & along the Prom’. Fred looks real well & has had a real good time, but his foot will never be really better & I expect him to follow me to Australia.\n\nWeymouth is rather a nice place, good Prom’, fairly decent beach, plenty of girls, several bathing sheds, theatres, gardens etc & - a white horse. But it cant come up to Coogee or Manly, & there is no surf at all, just a few little wavelets. The kiddies\n\nJune 21 enjoying themselves no end digging in the sand, racing about, riding donks & pelting one another. Most of the shops are closed so I couldn’t get any Batt Colors, but scored rather a good tea. Its rather amusing sitting here & watching the people go past, & as usual soldiers & girls predominate. Flappers, flirts, fast flitters, pretty, plain, ordinary, shy, awkward, young, old & otherwise, all sorts, conditions, sizes & \ncomplexions\n As regards the latter, there is needed some sorting out. You see the natural fresh girlish complexion, & the naturally painted one – which predom-\n\nJune 21 inates in the faces of ladies over 20 & under 70. Just as well they cant read this. Lots of our boys have girls, & lots havn’t, praps like yours truly they are either too shy – or else broke. There are also a fair sprinkling of civilians, & a few invalids. Charlie Jackson & Sgt Rumsey (both 6 of 2nd) are in Camp, & leaving in this boat. Had a chat with Charlie about the old days. –\n\n22 Talk about a row last night, the drunks kicked up the devils own shindig until long after midnight Most of us were absent from parade this mng. & only just got up in time\n","4":" for brek. I know my head was dashed sore. \n\nFour Tommies on the Prom sat down in some deck chairs near a couple of girls. Presently the collector came along for the usual 2’ each & only one Tommy could pay up The others cleared out after vainly searching in every pocket for the necessary cash. Unable to get colors yesterday so took French leave today & the picquets don’t worry a P.U. man\n\nAlmost certain we go tomorrow as there is a muster parade at 2 pm. \n\nLovely on the Prom’ this afternoon, & got outside some icecream (the dinkum stuff) & then\n\nJune 22 strawberries & cream. Dodged a light shower & purchased a Barling & Batt colors\n\n23 Slept so well that the Orderly Officer came round & caught us in bed, but he didn’t say anything. Not leaving today, but tomorrow morning –\n\nMy name – through some blunder – has been omitted from the final boat list & it looks very much as if i‘m going to be left behind & possibly be given a job here or in France.\n\nLuckily there is £ 25 waiting for me at London, so if I don’t go ill apply for \n","5":" a few weeks leave & have a jolly good time. Still it makes a fellow feel damned wild for being left at the last moment almost. \n\nBeautiful Weather too, altho’ even that fails to cheer a fellow up any!.\n\nMost of the other Harefield chaps are listed safely.\n\nRec’d 3 letters today – all wishing me \"Bon Voyage\" !\n\n‘Later\" Just been told to get ready to leave tm’w morning so am still hoping hard.\n\n24 Drill & like rain, with a cold wind. Still worse luck. Name not on the boat roll & my kit has gone on the train but\n","6":" think ill get it again OK. Feel like doing a damn good swear. Have been to the Doc & he’s going to do his best. Obtained a pass from 2 pm to 11 but will have to go easy as I only have 18 bob. Strolled round the older part of the town ran into sundry dead ends & narrow highwalled lanes, & unearthed a couple of Methodist Churches. Got several splendid views of the town & Harbour, but the weather is dull & not conducive to sight-seeing. – Several men & women are in bathing &\n\nJune 24 the Kiddies are enjoying themselves in the sands, & riding about on donks, & natty little carriages drawn by goats. This saluting gets on a fellows nerves; so far i’ve only chucked one. Met ! –\n\n25 Sunday again in England, & this time in Camp. Church Parade at 10 but I’m dodging that. Might go along tonight. Swept out the hut, there are only a few of us here now. \n\nLovely down on the Prom this morning & a few waves are rolling in too. My bag has not returned from Plymouth yet. \n\n Sunday\n","7":" Pr’aps it will go on to Australia. Went & had 6’ worth of Church, in the pit. The School Kiddies, teachers & others sit in the gallery. Good organ and choir & not a bad Parson. \n\nJolly nice gardens here; plenty of shady spots & any amount of girls. Met Fred again & wandered around for an hour or so. Kit bag arrived\n\n Sunday\n","8":" Orderly Officer went crook because I was in bed when he came round. Give a man the pip he \nwould!\n Must see the M.O. again at 10. Taken before Orderly Room for not being up at Reveille, & the \n\ndamned upstart of an Officer gave me 3 days CB, & said he had let me down light Talk about injustice, I felt like slathering him out First they mess a mans papers up & he misses the boat home\" & then they drag him up for practically nothing. Just drew a quidlet & am now 26\/- overdrawn. Drill & miserable sort of a day\n\n27 On Physical drill this morning – pretty rough isn’t it on a PU chap?\n\nUnable to trace packs.\n\nSenior MO says I can get an eye at Weymouth instead of returning to Harefield\n","9":" Messed about at Monte for about 4 hours & have to go to Eye Hosp! tomorrow. Got towel sox Shirt & tooth brush. Was coming out of the YM & fell head over heels into a nice heap of stones.\n\nRecd a letter from Uncle, & one from the NSW Bank re £ 25 cabled to me. Written a long letter home. This eye socket gives me jip at times, & the glare of the sun & much walking or reading makes me feel dizzy. Packs are at Plymouth so have written for them to be sent on here \n\n M\n\n28 Missed physical jerks \n","10":" this morning, & was put on QM’s fatigue, but did nothing – just fell out & went to Medical Hut. Am applying for leave tomorrow but don’t know how I’ll get on Several chaps were boarded today, some for Australia, & others for home Service.\n\n28 On QM’s fatigues again this morning. Am taking on hut orderly tomorrow, as it’s a damn good job. Cold as blazes; just like winter in fact. Cleaned up a few things, but nicked away at 10 oclock – presumably to see the Quack. As it happened the Doc did see me, & said i’d have\n","11":" to wait until Tuesday for that eye. Went (with several of the boys in a drag) to a sort of garden party, & it was pretty decent too, only the rain pelted down when things were going strong, & the wind blew like one thing. Yes – its great weather for summer time! Five more chaps are living with us now, so guess our family looks promising\n","12":" H.O. today. All except A class men leave shortly for Monte Video Camp – which is another mile or so from town. Went for a nice long walk over the downs & along the beautiful lanes\n","13":" Half way up the hill I sat down on a heap of stones by the wayside & watched 2 or 3 Companies of Tommies March past. \n\nBelieve they are trying to crime me again – for something I don’t know anything about – to wit – the non return of a tea bucket to the cook house.\n\nGirls, did you say? Not for mine – yet! –\n","14":" Like rain again. Saw the S.M.O. about my leave which he says will be granted, but first I must have my eye attended to here. If Board Papers turn\n\nJuly 1 up theres a chance of my getting home in the next boat. Anyhow, he’s written about them to London. Just saw the girl in the -------- jacket, but ---. The sun has come off top dog again & here am I carting a big overcoat about. Went the pace – what! & purchased a Khaki Handkerchief. – \n\nWonder am I growing reckless ? It is interesting sitting here studying the different faces outlined in the windows along the terrace. Most of them are middle class people on pleasure bent or in search of better health, altho’\n\nJuly 1 there are one or two aristo’s & a few of the \nidle\n rich.\n\nNoticeable are several invalids some in bath chairs, others hobbling along on sticks or crutches. A rather ferocious bespectacled grey-haired lady keeps her eyes glued on the Prom’ & doubtless sums everybody up! A young lady sews \"industriously’ & \nmethinks\n smiles not a little - at yours truly I hope? And then there are the maids with their natty little caps & neat pinafores – they also love to see what is going on, & you bet \nthey\n smile! Then we must not forget \n\nJuly 1 the shortsighted old lady who industriously studies her newspaper, & mayhap gently strafes \"That naughty man The Kaiser, & those \nhorned, horrid\n Germans. And there is a rather nice girl (with a nice long plait of dark hair) who rides a cycle & smiles sweetly. Apparently she hails from the country or some inland town; & is well looked after by MA! (Hang MA!) And there are many prams – an occasional one conveying two passengers. Well built men of 45 & upwards are not altogether absent, doggy ladies\n\n \n\nJuly 1 are fairly numerous, & I have spotted at least 2 women who drive their own cars. Of messenger boys one, walking, carried a fat brown paper parcel; & the other sported a bike, & a basket in which reposed a well-plucked fowl, - its head dangling absurdly over the side. (The rest we will reserve for some other fine day).\n\n2 Officers going crook about Mess Orderlies & state of hut, so we told them straight that all the permanent Orderlies were put on guard.\n\nLeaving for\n\n Sunday\n","15":" Monte Camp tomorrow morning. Down on the Prom’ again this afternoon Church Parade this m’ng went to St Pauls C of E\n\nNo luck with the jacket, not on the Prom’ at all, but there’s a nice grey one just opposite. \"Shall we resume our study of the Prom’ers\"? The ultra-smart ladies of whom there are several. Some few of the costumes are both daring & effective, others equally daring but far from effective, & many confoundedly ugly or else common! Few of the wearers are pretty or even good looking, but this little \n\n Sunday\n\nJuly 2 girl in grey is jolly nice. Went to Church at 6.30 good Minister.\n\n3 Left for Monte Video Camp, & am now in a hut with the other unfits. We are supplied with beds, do no parades & have our meals in a special hut. It’s a bit of alright after being stuck at Westham & having to do Mess Orderly & parades. There is a beautiful view from Hill 60 – on the left stretches the sea & a long sand bank, in front, beautiful green fields, innumerable hedges & scattered hamlets, & to the right lies the Harbor\n\n Monte Video\n","16":" & the City of Weymouth. The background of cliffs stands out clear & distinct against the deep blue of the Harbour. \"And it is a \nperfect\n day\" From the trees & the hedgerows come the songs of the birds, & some happy youngsters are playing among the heather. Thank God that the children at least no little of the horrors of war!\n\n4 Parade at 6.30, half an hours physical drills & then finish. Listened to the Band outside the Officers mess & then went for a walk with Fred out past the Coast-guard Station & along\n","17":" a beautiful avenue of fine old oaks, beeches & elms. Met 2 girls on the way home ?\n","18":" The Lt. took us for a walk this morning , just a nice short one; we fell out had a smoke & a yarn, returned to the parade ground & then dismissed. Did a little fatigue, & after lunch went to Weymouth & was fitted out with an artificial eye. It’s a little lighter than the other one but looks OK. Fred & I went for another walk along the avenue\n\n6 Putting in for 10 days leave today &\n","19":" going to ask about being boarded. -- Later, unable to get leave until my Board Papers arrive, & goodness knows when that will be. Looks as if I’ll be left in England for duration\n\n7 Thought it was too good to last. At first we only had to fall in at 6.30 & then finish, but now the damned Orderly Room & the Quack have put in extra parades, fatigues & put several of us on Pioneer fatigue – which is a job for a class men. Drew 1 quidlet & am going to the Jubilee if the rain hangs off (Later)\n\n M, Mill, R.\n","20":" Rather good concert at the Jubilee Hall. Some, or at least nearly all of the boys stayed for tea, but I imshied to the Prom! & had a look around. Landed home about 8.15 & went for a stroll along the Coast.\n\n8 No sign of Board papers yet therefore no leave will be granted until they arrive or I am reboarded. Have pass from 2 to 11, & it’s a topping day. Saw the girl in the --- Jacket, but alas (Mum).\n\n\"The Rosary\" (screened at the Paladium) was a beautiful picture, &\n","21":" Lasted 2 hours solid. This artificial eye of mine is providing some amusement. In the theatre it twisted round some, showing the white, & I was wondering why people were looking so hard. Later, The Provost Marshall pulled me up for not saluting, but he climbed down when I told him that my left eye was \nminus\n\n H.C.\n\n9 On Pioneer fatigue & its not a bad job, just a couple of hours in the morning. Inspection this morning by the Colonel & we had to turn our beds up. Had a good hot shower, an equally\n\n Sunday\n","22":" good dinner & the went for a nice long walk through the avenue & some private grounds. Went to the Congregational Church tonight 6 to 7.15, an old fashioned Service.\n","23":" Woke up confoundedly late after pleasant dreams which I hope may only come true. Rec’d a letter from Uncle, & enclosed were 2 from Mum dated May 17 & 20th. Just heard that my board papers are OK, so have applied for 14 days leave.\n\n\"Isolation Itchy – Koo Ltd\" -- is the name given to the Scabies Hut – (Wms)\n\nSome of the P.Us have\n\n A.D.\n","24":" been picked for guard Damn disgrace I reckon. Unable get leave for over a week.\n\n11 Two of the cripples are doing a hop on the hut floor; in fact the one limbed, & the lame are the jolliest boys in the crowd. \n\nWandered away over the hills & discovered the picturesque Village of Wyke with its fine old Church, neat little gardens, & shady avenues. \n\nIn the distance was Portland with its famous prison.\n\n12 Cold, & still more cold; & now its raining a treat. My blankets\n","25":" were spread out on the grass & I just got them in time to dodge the rain. Several of the P.U’s have been put on \"Isolation Permanent guard\"\n\nBelieve we (those of us who are going) leave in the Anconia on Aug 4th.\n\n Mill, M.\n\n13 Like rain again, but much warmer. Nothing doing except that the P.U’s have been released from Guard after several of them had paraded sick. Jolly nice walk along the Portland Rd. & one gets some fine views from the top of the Hill, as the country on both\n","26":" sides is plainly visible. There’s a demented chap in our hut who makes a darned nuisance of himself, but he goes into Hospital tonight. Its jolly hard luck – especially when a man gets blown up with a shell.\n","27":" Dumped my stick & pinched another from the woods, but its too heavy so guess I’ll have to buy a decent one.\n\n15 Cleaning out day today; 2 stiff brooms, plenty of water, a couple of mops, & there you are (or at least there the hut is) It looks cleaner anyhow, & there are\n\n \n","28":" sundry pots of flowers to brighten things up.\n\n(11.30 am) Miss Eileen Boyd (a Sydney girl) & several other artistes entertained us, & handed round smokes. After – the whole party made a tour of the Camp, passing through our mess hut. No 4 Coy (that’s us) is now provided with a special rec’ room including piano & Billiard Tables. Perched up on the church yard wall & yarned with a School master for about half an hour.\n","29":" Pay day tomorrow, & my leave paper goes in. Church Mafeesh; \n\n \n\nJly 16 A fellow cant work & then listen to a Parson. Between the hours of 8 & 11 pm this hut is the funniest I know. – an endless stream of wit & humour, & roars of laughter. Somewhere about midnight a lonely cat curled up on my bed & I got the shock of my life. Gave a devil of a heave; \nthat\n cat hit the floor rather suddenly & the old Doc’ next door nearly fell out of bed with fright, and then a ‘Lost-horseman’ heaved puss out the back door & all was peace and quietness again (JC. JB.\n","30":" Pay day – received the sum of £ 1; & handed my pay book in, only 26\/- overdrawn. Granted leave until midnight on Sunday, & get away from here tomorrow midday. It looks as if we’re going to sail this month?\n\nGot hold of pants & puttees\n\n18 Talk about a rough house & Comic Opera; why, they’re nothing to No 76 hut! Drunks innumerable, challenges, repartee, beetle crushers, & a cut head to finish up with. Never as long as I live will I forget No 76 & \"Andy Fishers Ragtime Army\". Had\n","31":" about 3 hrs sleep, & then we were roared on this m’ng for not turning out at 6 oclock. Left for London at 2.20 & arrived at Wimbledon about 7 pm. Managed to find Uncles place after sundry inquiries, Phyl met me at the door.\n","32":" Went to the City with Uncle (who took a day off) & saw St Pauls, Houses of pl’t, Westminster Abbey etc. & in fact had a good tour round.\n\nThere is the quietude of the old world cloisters where ones footsteps echo & reecho along the dim, arched –\n\n Wimbledon Park\n\nJly 19 corridors; & the poets corner – where lie so many famous men sleeping \"the sleep which knows no waking\" until that \"Great Day\" when the myriad dead shall rise, & this old Earth be no more.\n\nUnable to get in to see Parl’t sitting, but went to the afternoon Service at the Abbey & was well rewarded. The organ is magnificent, & the choir sang beautifully.\n\nSecured a railway warrant for Portishead & then collected £ 25 from the NSW Bank. Saw sundry Dookes & Earls at the House of Commons – also Haldane. Gee! I nearly forgot\n\nJly 19 to mention the changing of the guard at the Palace, & the Scots Guards Band, & the goosestep. Some soldiers – What?\n\nGuess Phyl & Mary seem nicer every time I see them. Came home at 5, & after tea went for a nice long walk round the Common.\n","33":" Lovely morning; not up until after 7, but feeling A1. Mary & I went per train & bus to Hampton Court Park, & rowed down the River Thames just below Richmond for a couple of hours. There were several boats about, &\n\nJly 20 a score of houseboats lined the side of the River. Jolly fine ‘boats too some of them. At first I caught several crabs, but was going good at the finish. The Park is a real beaut’, & old Father Thames runs smooth & clear between banks of emerald green. Had a good dinner at the Hotel overlooking the water & then made for home. Met Phyl’ coming home from work, & the three of us walked home. Tip top supper at 10.30.\n","34":" The cat came in during the night, hopped\n\nPortishead\n\nJly 21 on the bed & gave me a deuce of a fright. \n\nLeft Wimbledon at 9.30, London at 11; arrived here just before 3, & drove up to Gledhow. Both Aunt & Uncle were surprised to see me. Confoundedly hot today, hottest i’ve known it here. After tea Uncle & I went for a long walk. Called at a cottage on the way back & had a glass of beautifully clear, cold well water. Solid supper & then turned in an hour before midnight – feeling tired & sleepy\n","35":" Up at 8 (not 6!) Like rain, but fairly warm\n\nJly 22 outside Went into Portishead for sundry articles (necessary and otherwise) & returned at 1.30 to a splendid dinner – (duck, green peas, new spuds, gooseberry & loganberry pudding, custard pie, & fruit) Do me! Talk about being full; I’m well packed (A nice little kiddy named Audrey Weaver (7½) came up this afternoon to \nsee the\n Australian. ?-)\n\n23 Cut Church out & went for a walk along the Coast. Am leaving for Weymouth this afternoon – via Waterbury. Theres a graceful sailing boat lying\n\n Sunday\n\nSunday\n","36":" about half a mile out, at first (being painted white) I almost mistook her for a Hospital Boat. Weather close & muggy. Not feeling too good. Left for Weymouth at 3.35, reached Bristol at 4.15; left again at 6.15 & arrived home at 10.10. Came by car from the Station.\n","37":" 3 letters waiting for me, & perhaps a Board. A lot more chaps here now. Back on the old job Rec’d 44 letters – nearly all from Australia. Had a nice hot & then cold shower, & am feeling A1. Just been to the Salvo’s & had M\n\nJly 24 my dial snapped with several other boys. Either we sail shortly, or else go before another Board.\n","38":" Fun galore until after midnight. Laugh! I’ve never laughed so much before. Some of the boys have been reboarded. Secured 11 oclock pass, so am down on the Prom amusing myself. Went to the pictures; Not a bad show. Pretty well dark now at 11 oclock. Bought Pittmans shorthand Teacher.\n","39":" Several of the boys going to Dorchester. 40 chaps came down\n\nJly 26 Harefield this m’ng, & I met my old cobber from the same place. Photos taken at the Salvo’ Army Hall aren’t bad. Fire alarm just went & we all had to turn out at the double. It was a dinkum fire too. Half holiday so didn’t go down town, must go tomorrow. Went for a stroll round Chickerell.\n","40":" Muster parade today? But nothing doing. Rec’d 12 letters from home. Just rec’d 6 more letters incl’ 4 from Australia. The flying Board is marking lots of chaps for active, Ada, R, Mill\n\nJly 27 Service, so p’raps they’ll give me a job too\n","41":" Going before Morseley & Ryan this m’ng for the Verdict; nearly 300 here now. \"Later\" Not going before the Board, or at least I haven’t been warned. \n\nBuksheesh entertainment at the Jubilee Hall this afternoon, & it was a jolly decent show too. Came down in a Charabanc but it had insheed after the show. Had Photo taken, doz pcs – Also met the girl in the – coat, & had a nice long chat.\n","42":" Clothing requisitions being filled \nin\n this morning, so things look promising.\n\nJly 29 Rather warm the last few days. Query? Am I for Australia or Home Service? Have 2 to 11 pm pass & came down by car about 2.30, but nothing doing at all. Just my luck. Scores of bathers in the Briny, including lots of our boys. Several 3rd Div men & officers on the Prom. Turned the old Cady down for the first time; on a\/c of the heat. (Weight 11-8, just about the same) Jolly nice tea, & pictures weren’t too bad. (9pm) Beautifully calm sea, & quiet & peaceful way down here on this end of the Prom. Just ahead is a Coastal boat\n\nJly 29 crossing the mouth of the Harbour; old Sol has gone to rest full half an hour since, & a sea mist is creeping slowly in. Soon the outermost cliffs will be hidden from view, & I guess things will be getting a wee bit damp. Almost I can imagine myself back in dear old Tamworth – sitting in the same old easy chair & gazing out over the familiar hills. The tide is setting in, & there is just the slightest breeze – enough \nonly\n to ripple the surface of the water, & make one forget the heat of the fast fading day –\n\nJly 29 And tomorrow is \nSunday\n the day of rest, & thank goodness we don’t get up until 7. Hope there are no drunks to disturb my rest tonight – else the extras hour in the morning will be wasted. Chased all over the place for a car but managed to get one before 10.30.\n","43":" Our lovely SM tried to make us go to Church! But theres nothing doing Came down town with Fred (about 3 oclock) but failed to do any good; so after wandering along the Prom & through the gardens I caught the first car home. Three Sunday\n\nJly 30 rather inquisitive kiddies sort of paraded round me & argued with one another as to whether my eye was dinkum or merely artificial.\n","44":" Rumors still floating round (re the Seramic in which we are supposed to leave shortly). Priv Bendrey of the 2nd Batt \nis\n on the Boat Roll for Australia & tomorrow we draw our extra kit from the QM.\n","45":" Pay day today & I drew 28\/-. So am only 26\/- overdrawn.\n\nSpent sundry quids on brooches, belts knives, etc for home so hope I’ve made a good selection? Nothing doing down town.\n","46":" The usual disturbance last night by the drunks brigade, but they quietened down about midnight. A couple of the boys were clinked for sundry offences. Tried out the boots, but don’t go stacks on them. Wandered round the villages.\n\n3 \"Kut day\", Rumored that several of us are to be struck off the Boat Roll. Sold boots for 15\/-. Pass from 2 to 11, so \"carred\" to town, & bought another pair of boots & several other articles. Great crowds in the streets & along the sea front; & a fairly decent procession. Another\n","47":" procession (minus the Anzacs) at 6.30 including a reed band & 2 \"brassies\".\n\nThis child \nis\n on the boat roll alright. Am afraid though its going to be a 2nd or 3rd rate boat.\n\nBeautiful weather; temp’ only 76 in the shade, nice spring weather ‘twould be called in Sunny New South.\n\nThousands of girls to choose from – What!\n","48":" Boat Roll to be called again this morning.\n\n(Today is the Anniversary of Great Britains declaration of war against Germany). \n\nGot photos OK. The full length is alright, but the other is rotten.\n","49":" Nothing definite yet, although our pay books were taken. Cool & clear, but rain still Mafeesh. Met old Dad Walters, who is also going back home. We sail on Tuesday the 8th, so have written several letters Harry, Dad\n\n6 Today, ","50":"\n is the 4 anniversary of the famous Lone Pine Charge when the 6th\/2 rec’d their baptism of fire & incidentally were badly cut up. Rec’d a letter from Rev Dains who is at Salisbury.\n\nWent to Wesleyan Church. \nSunday\n\n7 Fred Melvaine is now in charge of coal &\n","51":" wood supply depot. Cold a treat, & like rain.\n\n3 parades already, & am expecting more. Just rec’d 9 letters from Australia. Finished up with 6 parades, & the final Boat Roll was called on the 6th. This child is going to Aust. alright this time. We leave Camp for the Station at 12.30 tm’w morning, & expect to sail for Australia the same night. Rough sea today, far rougher than usual. Not many on the Sea Front. Got home fairly early\n","52":" Leaving for Portland at 12.15 to go aboard the ? Marathon. Met Bill Kent this morning. He expects to leave in the next boat. Left Camp at 12.30 & went on Board about 3 pm. Not a bad boat at all, & rather bigger than the Karoola I think (9000 tons, & \ncan\n do 16 knots) Left Portland (escorted by a destroyer) at 3.30. Was M.O. for tea. Tucker fairly good. Beautifully calm sea & lovely weather. And just about 14 months ago the Karoola left Sydney Harbor (outward bound)\n\n (Portland) (At Sea)\n\nAug 8 and now we are \"home-ward bound\" for the \nsame \n dear old Harbor. Practically our only danger now is from Submarines & by the morning of the 10th even \nthat\n danger will be \"nil\" – because it is not until then that the destroyer leaves us. All the time – she is crossing & recrossing our bows, \never\n watching for the deadly periscope.\n\n9 The time is now put back an hour as we are no longer within the zone of the \"daylight saving scheme\" Slept well last night (on the deck). Hammocks don’t like me at all. Rec’d a parcel from home (just before leaving) containing\n","53":" cigars, sox etc. Pretty good breakfast, so will only mention complaints in future. \"Destroyer left us & returned home about 10 30\", so we’re pretty safe now- Deck chairs galore have been handed out, the Canteen is open, & this afternoon we get our red cross gift. \"Head feels pretty crook\". The Red + kit consisted of shirts, sox, towels, soap, pyjamas, choc, shoes etc etc. Hanged if I know how we’re going to carry all our kit.\n\nIssued with 4 pkts of cigs (or ¼ pound of tob’y) Capstan too. The Latrines are tip top.\n\nAug 9 passed several fishing boats, trawlers & tramps. Imagine a fellow lying full length in a comfortable deck chair, puffing contentedly away at a cigar, & gazing out over a beautiful moonlit sea\n\nWrote a letter to Eng’ for one of the old chaps – who cant write too well; he’s an old k’nut too. ‘Dad’ I call him.\n\n10 Feeling A1. Fair swell this morning, but only a light breeze & a few clouds. Much singing on the deck last night, especially when the Sisters happened along (\"Sister, my little sister\") was \nthe\n song then.\n\nA well wet Sg’t tumbled up the gangway\n","54":" about 10 oclock, & proceeded to give sundry selections on a Concertina while his \nmate\n attempted to perform the Highland fling & the Irish Jig. \nHe\n managed the shouting part alright, but his legs got very wobbly & eventually tangled him up amongst the deck chairs & foot rests. Discovered the bath (with the aid of a kindly Chaplain) & had a good hot swim. Soap mafeesh as the water was salt. Shoal of porpoises sporting on the Port Side. Deck tennis – croquet, quoits etc piano, & sundry books & papers. What more do you\n\nAug 10 want? What we don’t want perhaps are the parades at 10.30 & 2.30. Guess the old jigger is doing about 10 or 12 an hour, & she increases it at night. Pay day today, but im not in it as my book is a quidlet overdrawn. Guess it doesn’t matter – seeing that I’ve got a fiver! The Doc is also out of it as his book is in England – also his wife! \nSentr\n Alan McDougall is on board with us. He watched the Colonel dishing out our pay. Very few Hospital cases yet, so the Nurses & Doc’s have plenty of leisure time. Beautiful sunset & a sea like glass\n","55":" Blowing some, & a fair swell on making a chap side step a little. The Colonel softened ,& antied out a \"one’er\", so I’m even more financial now. School of whales sighted on the Port side. Two of the boys have started Barbering; both on the well deck \"aft\".\n\nPaid out 5\/- to the MO’s for 5 weeks duty in advance. Just passed a full-rigged schooner on the Starboard Side. She’s doing about 7 or 8 an hour & looks very pretty with all her sails set \"prettier than a chap would feel aboard her\"?\n\n12 Still a fair swell on causing us to roll some\n","56":" Slept well forrard, on deck last night & feel much fresher. Only had 2 blankets but didn’t feel at all cold. No job so far, altho’ many of the boys are M’ps, orderlies etc. A Sg’t was looking for a Typist, but I knew \"nothing\"! Supply of silver on board is very poor! Concert after tea on the main deck. A couple of the boys sang well, the pianist was good & the ships Surgeon played his piccolo to some purpose; but the Colonel was \n\"awfi guied\"\n & when he was loudly encored he failed to tumble, & gave us another heartrender. The cigar, the sea & the setting sun were The best part of it\n","57":" Rudely awakened at sunrise by a man with a formidable looking hose, who wanted to swab the deck. Not being a lover of impromtu showers I decamped & put me on a pair of khaki sox. On ordinary days I go sox-less, but today is as you know, Sunday, & one must hie himself to Church. I regret to state that during the greater part of the Sermon I slumbered. You see the ships pumps were discharging much water into the Atlantic – the noise whereof did drown most effectively the voice of the Parson. Had our photos taken on the gun-\n\n Sunday\n\nAug 13 .5 one-eyed chaps & two jack tars ().\n\nBit of a sing song tonight, but it was ‘rather awful’.\n","58":" Believe I mentioned that Senator McDougall is on board & consequently we are getting good scran. Plenty of spray & dew last night; but it only made a chap feel fresher. One of the Nurses photographed the \"old Sth Africans\", & then \nwe\n of the one-eyed squad.\n\n15 Universal washing day, in fact we’re not \nsupposed\n to wash clothes on any other day? Weather getting warmer as we approach the line, & the sea is just a bit \"rocky\" – like. Sighted a \n","59":" a big shark just astern, & hundreds of flying fish dart away from the ships side. Running before a fair sea, & av’g’ng 300 a day. Detailed for fatigue tomorrow. Washed a shirt & towel. Heavily laden cargo boat passed on port side – dipping her nose well into the briny. Our boat nearly stopped during the night to effect repairs in the engine room. \n\nAs the full round face of the moon shows through the dark cloud mass, so do the waves subside, & the wind drops to the merest puff.\n\n16 Head wind & a fair swell, but sultry withal. Helped to clean Troop deck\n","60":" No 3, & per-sweated a devil of a lot too. V.I. by the Doc, & some of the boys have been ‘overhauled’:\n\n\"The Sentimental Bloke\" was lying on the Piano, so I pinched it, & returned when read. It’s \ngood\n. \n\nCricket is the latest craze aboard although tennis gets some rough handling from the Sisters & Ooh. Ahs!\n\n17 Much wild wind last night, & just a wee drop of rain. A sailor woke one up at 1 am - wanted to fix the ventilator. Chart put out for troops. Yest’ys average was 276 miles. Unearthed some excellent toffee at\n","61":" the Canteen. Senator Mc came down on the mess deck to test our tucker\n\n18 Rain chased us in off the foc’stle last night, & by gee it did rattle down. Beautifully cool this m’ng but fairly rough sea. Went before the Quack today, & was asked quite seriously if I could see out of the left eye. And he didn’t half like it when I told him it was a \"glassy\". \n\nJust finished one of Haggards novels. Have read two good books \"Lytton\", & \"Dickens\" works, but am afraid they’re aren’t too many others about . Overhauled A full\n","62":" rigged Schooner on the Starboard Bow so cut in behind her & left her to Port. She passed very close & dipped the salute in passing. Counted 27 sails in all & could distinguish several figures on deck\n\n(12 Noon) averaging 300 a day & just 3,170 off Capetown.\n\nEvery night the piano is in full request & the voices of \"the boys\" float out over the Atlantic, and it is the \ngood old\n songs they love the best of all.\n\n19 Nosing our way through heavy seas & a head wind, but there’s no dip; only a bit of a roll. Crossing the line about\n","63":" midnight tonight. Only 288 during the last 24 hours. Buksheesh Concert ,& as usual the Colonel caused much laughter, but the best singer was a deaf chap.\n\n20 Heavy seas last night & a strong head wind. Crossed the line about midnight. One of the lads (a dentist) extracted a \nsailor\n \nboys\n tooth, & after the agony a wit advised \nhim\n to fill the offending molar with sugar & watch it ache. It was a \nlove\n of a tooth. Just spotted a nice friendly shark which gazed\n\n Sunday\n","64":" longingly at us. Record for last 24 hrs is only 254 miles. Usual Church Service at 10.30 & sing song at night.\n\n21 Hunted in by a sharp shower at 7.15, but no damage done, altho’ I only \njust\n got down in time for brek.\n\nScran keeping good, but the head winds & heavy seas are bad for progress. Read a couple of good books, looking for another now (unearthed \"Shirley\") \"Tableau’ Starbrd Saloon deck – aft. Abramovitch & Cohenstein are on bad terms. Suddenly I see a lightning like rush, 2 arms swinging almost simultaneously, & then –\n","65":" Abramovitch sprawling on deck & dimly wondering what had struck him. Next morning – \"Orderly Room\"\n\n22 Two more British cruisers gone! Weather cool, sea a little rough. Sort of a dopy kit inspection this afternoon because our \nfriend\n \"the Cormorant\" has lost a pair of shoes. \"288 todays reckoning\"\n\nMc (otherwise the Hon Alan McDougall) is a damn fine fellow; as far removed from an ‘Oo Ah’ as heaven is from earth. Ships Officers – (who are a pretty decent lot) have been ordered to mix not with the common herd IE \"the privates\" \n","66":" they don’t like the restriction either. But Mc makes himself perfectly at home.\n","67":" Still cloudy & unsettled Understand the figures on the Chart are faked by the 2nd Officer, & that we will reach Capetown on Sunday or Monday instead of Wed! Beginning to get a jolly good appetite, & the weather is perceptibly cooler. After sundown it is interesting to lean over the rail & watch for the flash of fins as the fish (& sometimes sharks) come to the surface. Evidently they are attracted by the light.\n","68":" Tomorrow the \ncensored\n mail closes, but I’m going to try & post mine at the Cape. \"Mafeesh Censor\".\n\nQuoit Championship today, under the supervision of Mc. Left my cap on the deck, & some rotter ripped the lining out of it. Had some good cocoa for supper the last few night; Red X issue I think.\n\n25 The sun is trying hard to break through the clouds after being hidden for several days. The old ship rocked \nsome\n during the night, & I got not overmuch sleep. Bit of a shindy over the MPs & sundry other things inc’ a Buksheesh Cpl. Have\n","69":" read 3 books today?.\n\n\"Cocoa finished\" for the present at any rate\n\n26 Another \"cradle\" night, & it was cool too. Plenty of large rats on board. One of them went prospecting in Dad Drury’s bag in search of concealed chocolates. No posting on todays Chart, as the 2nd mate has gone crook on us. Gee! You should have been to the Concert tonight. The 2 crookest items were by the heads, & most of the others were so so but all the same I never laughed so much before Unluckily Tom Tit (the Col) & Whistling Rufus (S. Surgeon)\n","70":" didn’t take part. Cat calls, mournful howls, turkey gobbles, \"mawpork\" cries, & sundry other strange noises were part of the programme ---.\n","71":" Once more a Sabbath Day, & best of all, Capetown isn’t far off. This mornings wireless is from Capetown, & Assension Island.\n\nSeveral gulls flying round the ship, & also a number of prettily marked smaller birds. Heavy swell causing her to roll a good deal \n\n‘Gentle Annie’ is the name allotted to one of our good natured harmless looking Lts.\n\nJust finished my last cigar. Woe is me! Must purchase at the Cape\n\n Sunday\n","72":" A night of rolling, much wind & cold as b-----s\n\nTomorrow night we will reach Capetown. an extra blanket has been dished out so we wont rattle the timbers any more with our shivering. Pte Wilson is shortening my greatcoat. – which should look OK.\n\nNo sign of any pay yet?\n\n29 \"Darwins Missing Link\" \"Chidley\" & sundry others! They’re all on board this boat, in fact it’s a panto’ in itself. A fairly large whale appeared for a few seconds & then sounded. Noticed several birds: - Albatross, stormy petrel & Cape pigeon\n","73":" 1 pm Sighted land, & 4 steamers, all the boys are excited after their enforced idleness. And we have seen practically nil for 21 days. Sighted table Mtn at 2 pm – about 50 odd miles distant. Arrived Capetown 7.30 & anchored in the Harbor.\n\n (Capetown)\n\n30 Came alongside early this mng. The Miltiades (a sister ship to this) is on our Starboard side & has Vic’s & WA’s on board.\n\nTable Mtn is close by, but don’t think I’d like to climb it. Weather good, but misty. No sign of leave yet. \nLater\n - Came ashore at 11 am & go back\n","74":" at 8 pm. Wired Hilda, had dinner, bought sundry things, inspected the old town. Caught the Camps Bay tram & did the round trip via Sea point & by ------ it was great! The scenery is simply magnificent. There above towers the giant Table Mountain; below the blue waters of the Atlantic break endlessly on the rock bound coast. And yet, there is a beautiful little sandy cove nestling behind the rocky outposts, but alas it is unsafe owing to the dangerous quicksands. Along the shore are a few ref’ rooms a private Hotel & several private buildings\n\nAug 30 The mountains are rocky rugged & steep, in fact in many places perpendicular The tram winds quickly down to the Bay – on our right the \"Lions Head\" pierces the upper air, while the far famed Table Mtn (wilder & more rugged than our dear old Blue Mtn’s) guards our left.\n\nThe tram line from Capetown to the bay is cut into the side of the mountain & one wonders what would happen if she skidded or back-kicked. Returned to town, made sundry purchases, & then betook myself to where our generous Sth African\n\nAug 30 friends were preparing to entertain us. And now they \nare\n doing it in right royal style, after providing a ripping spread. It’s one of the best Concerts ive had the pleasure of seeing. Singing, dancing, piano – selections, & you bet the boys enjoyed it. Talk about cheer – they nearly cheered the roof off, and the chap in charge (the boss cocky) bearded the old Col & secured an extension of leave until after 9 pm And tomorrow they are going to take us for a trip to the Bay. Arrived on board about 9.30\n\nSeveral chaps are dead shik, one lying on the deck, another took sundry fits, & altogether they were a damned disgrace to Australia. Some of the rotters seem to think of nothing but booze & ---- , & yet they are tip top fellows when they’re sober. There will be some beauts of heads in the morning ---.\n","75":" Up at 7 am & am feeling A1 – but would like a good hot bath. The Miltiades had left the Dock & is lying in the harbour. Rumored that we leave at midday. The Mountain tops are wreathed in mist which is here & there pierced by the rays of the sun. Smoke belches\n\nAug 31 forth from scores of funnels & chimney stacks – hiding the greater part of the city. Our decks are literally smothered in coal dust, the result of coaling by the \nKaffirs\n. They’re K’Nuts too some of these blacks, & dearly love anything gaudy or jingly.\n\nRecd a telewire from Hilda at 10 am, & we sailed at 12.30. It’s a glorious sight, leaving the harbour as peak after peak & scene upon scene break into view. Too many niggers in this country. As we passed through the breakwaters there were hundreds of em’ lined up\n\nAug 31 along the wharf, fishing for their tea, & they seemed to be catching some too. \n\nLost sight of Table Mtn 5 hrs out (60 miles). –\n\nRec’d 2 to 4 oranges each which means finish buksheesh I suppose. Still in sight of land at 10 oclock\n\nSeveral Hospital cases came aboard this mn’g - chaps who, enroute to England were put off at the Cape with Meninghitis, brain-fever etc.\n\nSptr 1 Dull & cold. Going fairly well, but believe the coal isn’t much chop. Did 302 yesterday & both sea & wind are with us today. Bough a 25\n\nSpt 1 box of cigars for 10\/-, & they are a tip top smoke. Patiently waiting for pay, expect to get 1 quidlet.\n\nStill plenty of birds keeping us Company, some of ‘em only little uns too.\n\nBoat parade at 2 pm & of course I fell in on the wrong boat. Recd the large sum of ten bob.\n","76":" Head wind & sea, & rather chilly. Paraded to the Doc & he gave me some pills of aloes. Played several games of deck quoits just to fill in the time like. Good cigars which I got in Capetown. Concert tonight, & better\n\nSpt 2 than usual. A couple of the stewards took part & livened things up a bit. Tom Tit \nsang\n 3 times, & caused more laughter than \nall\n the rest. \"Wanted\" one Ragtime Band, Tin whistles, mouth-organs or any other old thing.\n","77":" Fairly rough during the night, one or two waves coming well into the forrard well deck. Misty, cold & windy No Church on a\/c of the weather. A few waves came over the Saloon deck & made us duck for cover. Raining now like a son of a gun, & cold as blazes. \n\n Sunday\n\nSpt 3 Both wind & sea are behind us now, & we’re travelling well. Its great sport standing on the Port Saloon deck waiting for the big waves, & then ducking for cover. Just spotted a Cape pigeon; it’s a devil of a long way out for a small bird (900 miles)\n\nChurch Mafeesh, so have to be satisfied with a cigar & biscuits.\n","78":" Believe one of the propeller shafts is smashed, but luckily we are going with the sea & wind. Rec’d the usual \nfag\n issue of 2 packets.\n\nEverywhere – foam crested\n\nSpt 4 Sun-kissed waves, for there is a stiff westerly blowing, & the white horses are out for keeps – All piffle about the propeller shaft. The men played the Officers cricket, & towled them up by an innings & 6 runs. And after the match the Nurses had a little game.\n\nA couple of waves came well over the saloon deck & hunted the majority of the boys below.\n","79":" Still running before a heavy sea & making the pace a welter. Good luck to it too – every day sees us a few hundred miles nearer home. Played\n\nSpt 5 several games of deck quoits. Plenty of birds still following us. Fairly heavy rain this morning & last night The Sisters are playing the boys cricket, & judging by the laughter it’s a dead funny game. \nOne\n Sister holds the bat in the appropriate style, & puts in some pretty work too, but most of them get well away from the bat, & make wild hits at the atmosphere. \n\nOnly 295 yesty; think the skipper must be economising in coal. Now & again an extra large wave heaves the propeller out\n\nSpt 5 of the water & the ship shudders from end to end. Today is washing day, but theres very little doing – too d ---- cold!\n\nAt present I’m perched on a deck chair, way back aft among the birds On my left is the gun platform; the gun itself was dumped at the Cape.\n","80":" Did 300 yesterday – despite slight stoppage; should reach Fremantle on the 16th. One of the \n\"cured\"\n Meningitis cases taken aboard at The Cape has had a relapse, so this m’ng we all had our throats painted. It wasn’t a very pleasant\n\nSpt 6 sensation either, especially if a fellow felt a bit sea-sick. More rain & less sun appears to be the motto the last few days, altho’ some of the boys have misconstrued & made it read \n\"more sleep\"\n.\n\nToo cold to stay on deck, so went below did some reading. Am afraid tho’ that I don’t remember much of that book, because the boys were telling yarns about the good old times they had in Egypt, Gallip’ Eng’, France & best of all in dear old Aus’ –\n","81":" A playful wave came in through the porthole & caused much bad\n\nSpt 7 language. This cold water shaving is a rotten gag, but it’s a case of neck or nothing unless you can persuade the cook to part with a mug-full of the hot-stuff The ships barber is a ----- rook. Calabash pipes worth 2\/- he’s selling for 4\/6, & Cape Views worth 1\/6 hes asking 3 & 4 bob for. Raining again, & even harder than before. Its nearly time old Sol unveiled himself. Anybody would think he was an \n\"Eastern Lady\"\n, so shy is he of venturing out. Cocoa on at 7.30 tonight, but\n\nSpt 7 its too cosy \nhere\n ‘tween decks, & this book is too good to leave\n","82":" ‘Latest Wireless’ – this ship is searching for Shackleton. Think we’ll be sighting icebergs soon. The ‘Funnel’ Captain produced sundry apples from his pocket, & I happened to get in the line of fire & stop one.\n\nLast night saw the playing of the Euchre Tournament, & now there’s another quoit match in full swing.\n\nSo heavy was the hail storm that the Nurses & some of the boys pelted one another with it as with a snowball\n\nSpt 8 Another throat painting as a preventative for Meningitis. Finish cocoa, emptied the last tin tonite\n","83":" Cigars going well – should see me over Fremantle & half way to Melb’. \n\nCohen the Jew played up, did his block, & is now in Hospital – recovering. For fuller partics apply to \"Jock of the Tamoshanter\"\n\n(\"Scene, Saloon Deck\" Pte Jones politely hands to Pte Smith a bottle of fiz – the ship lurches – Jones slithers, hits the deck uncommon hard & upsets Smith into the Scuppers. The fiz takes a flying leap at the rail & \nbusts\n\nSpt 9 Much laughter & cries of \"give it buksheesh lemonade\" & \"let me like a soldier fall\". The usual Saty night concert, but the audience was small owing to the Polar weather. Several chaps have put up colors & gold bars when they’re not entitled to them, so theres to be an investigation by one of the ossifers.\n","84":" Sgt Shinnanikins? Came down at 7. & blew his whistle but was impolitely told to imshi and then in his childish way threatened to crime the lot of us! Pretty fair Sermon this mng by the C of E parson.\n\nSpt 10 The other padres looked on. Think there are about 10’ D’s aboard\n\nRec’d 3 pkts of smokes, & wonder of wonders, 2 small slices of Qld. Pineapple. Red X stuff it was. The noble Sgts had a tin each but the fighting mob only got 2 tins between 13 men. Often we wonder how much Red X stuff is stolen, sold or unfairly apportioned\n\nJust washed a towel, yea – a very black towel in commemoration of the \"pineapple\". Below, the boys have pooled part of their\n\n Sunday\n\nSpt 10 fag issue & are playing poker to see who takes the lot. \n\nSwung the hammock for the first time, & rather like it.\n","85":" old boiler gone bung again, & we’re down to half speed. A fellow will be lucky if he sees Melb’ inside of 14 days. Slept fairly well in the hammock, but you cant beat the old bed – especially the Spring mattress sort.\n\nAnother throat painting parade for Meningitis. \n\nHanged if I know how these birds keep it up, but they are still\n\nSpt 11 following us. –\n\nSome of the Canteen prices go up this week when we reach Australian waters. Have got 3 notes 2\/8½ left; Query? Will I have to break a quidlet before we get paid again?\n\nBack to the deck again – \"finish hammock\"!\n","86":" Blowing half a gale from the N.E. & we’re shipping water a treat. One wave doushed me while I was hanging a shirt on the f’cstle, but luckily it was an infant. Today is washing day, but most of us have turned it into a holiday owing\n\nSpt 12 to the rotten state of the weather. Plenty of games for a wet day, deck & peg quoits, John Bull, croquet, billiards, tennis & cricket. Did 306 today. Quise!\n\nBought a ½ lb tin of Old Friend to mix with Capstan; Canteen prices \ngo up\n tomorrow.\n","87":" Are we going to Fremantle or Albany? – is the momentous question which is disturbing the minds of some 200 soldiers. Anyhow if she keeps up todays record of over 300 we should sight land on Saturday the 16th\n\nSpt 13. Cold, wet & windy today as yesterday, but we still hope to see \"old Sol’ score a victory\n\nSeveral fairly decent seas have been shipped on the Port Saloon deck & the well decks. Q’ld pineapple dished out again last night; a tin to 3 or 4 men. No 7 table – noted for hums & appetites. When we eat all our own tucker we hum some more from the other tables. The mail for Melb’ closes at 8 pm on the 13th ins’t. Expect to reach Melb’ in time for the show.\n","88":" At last the weather\n\nSpt 14 has broken. Beyond a slight Westerly & a few scattered clouds there is nothing to denote that the rain-god held full sway for \ndays\n past. The fc’stle head is a regular \"flapper\", clothing of all sorts & sizes hung out to dry, and there are even blankets, & a pair of leggings. –\n\nThere was a \nfarcical\n hammock inspection at 2 oclock. In a great many case the Sgts didn’t even see our hammocks – let alone say how many blankets they contained. Six devil dodgers we have on board & not a damn one of them\n\nSpt 14 ever mixes with the boys – or makes inquiries of any description.\n\nAll they think of is eating, drinking, sleeping & playing games with the Nurses & Officers. The \"Major\" Devil Dodger we call the \"Sea Lion\", but a private who sports the nickname of \"The Broody (ca? Hen\" is about the queerest looking chap yet!\n","89":" Cloudy & cool withal, but still the sun does show out occasionally & as yet there is no sign of rain. Only 291 today, so if we \ndo\n run into Fremantle tomorrow it will be fairly late at\n\nSpt 15 night. –\n\n\"What is Nature but \"The living mantle of God\"? Thus speaks Carlyle in his \"Sartor Resartus\".\n\nSplendid Concert tonite by the Stewards of the boat, - absolutely the best yet on the old boat. Its really a farewell to the boys several of whom get off at Fremantle tomorrow or the day after. The WA boys were paid £ 1 each today, so they are about the only financial chaps amongst us.\n","90":" A sea as of glass, a gentle breeze, & a few scattered clouds, - such\n\nSpt 16 is this morning, & let us hope that is a good augury for the remainder of the trip. Yesterday we saw the last of the birds which followed us all the way from the Cape, & now we are beginning to sight some of our Australian birds. On fatigue all the morning cleaning up between decks, sweeping , packing lifebelts, scrubbing tables etc.\n\nOld Sol disappeared at 5.53, & at 6.8 we caught the first flicker of a lighthouse. The WA boys (sandgropers) are all ready to go ashore.\n\nSpt 16 Saw the lights of Fremantle at 7.30, the pilot came aboard at 8.30 & we anchored in the stream.\n","91":" Passed through the breakwater early this morning but haven’t gone alongside yet, & don’t expect to. I can hardly realise that just about 15 months ago we were in this self same Harbour on board the Karoola – bound for Egypt & Gallip’ and now we are returning to Sunny New Sth Wales. The WA boys have just gone ashore, but we are not getting off, in\n\n Fremantle Sunday\n\nSpt 17 fact 2 lighters are now busy coaling us & we expect to leave this afternoon. Another transport (A 46) enroute to England arrived this morning, & the Euripides is expected some time today. Gee! Its great to feel that at last we are really \"home\" in Australia – despite the fact that ‘Sy’ is still many miles away.\n\nThe sun is beautifully warm & not a cloud is visible. Believe we were expected at 6 yesterday mn’g & many friends & relatives had been waiting since that time.\n\n \n\n "}}