{"Document Name":{"0":"Diary_0481","1":"Diary_0481","2":"Diary_0481","3":"Diary_0481","4":"Diary_0481","5":"Diary_0481","6":"Diary_0481","7":"Diary_0481","8":"Diary_0481","9":"Diary_0481","10":"Diary_0481","11":"Diary_0481","12":"Diary_0481","13":"Diary_0481","14":"Diary_0481","15":"Diary_0481","16":"Diary_0481","17":"Diary_0481","18":"Diary_0481","19":"Diary_0481","20":"Diary_0481","21":"Diary_0481","22":"Diary_0481","23":"Diary_0481","24":"Diary_0481","25":"Diary_0481","26":"Diary_0481","27":"Diary_0481","28":"Diary_0481","29":"Diary_0481","30":"Diary_0481","31":"Diary_0481","32":"Diary_0481","33":"Diary_0481","34":"Diary_0481","35":"Diary_0481","36":"Diary_0481","37":"Diary_0481","38":"Diary_0481","39":"Diary_0481","40":"Diary_0481","41":"Diary_0481","42":"Diary_0481","43":"Diary_0481","44":"Diary_0481","45":"Diary_0481","46":"Diary_0481","47":"Diary_0481","48":"Diary_0481","49":"Diary_0481","50":"Diary_0481","51":"Diary_0481","52":"Diary_0481","53":"Diary_0481","54":"Diary_0481","55":"Diary_0481","56":"Diary_0481","57":"Diary_0481","58":"Diary_0481","59":"Diary_0481","60":"Diary_0481","61":"Diary_0481","62":"Diary_0481","63":"Diary_0481","64":"Diary_0481","65":"Diary_0481","66":"Diary_0481","67":"Diary_0481","68":"Diary_0481","69":"Diary_0481","70":"Diary_0481","71":"Diary_0481","72":"Diary_0481","73":"Diary_0481","74":"Diary_0481","75":"Diary_0481","76":"Diary_0481","77":"Diary_0481","78":"Diary_0481","79":"Diary_0481","80":"Diary_0481","81":"Diary_0481","82":"Diary_0481","83":"Diary_0481","84":"Diary_0481","85":"Diary_0481","86":"Diary_0481","87":"Diary_0481","88":"Diary_0481","89":"Diary_0481","90":"Diary_0481","91":"Diary_0481","92":"Diary_0481","93":"Diary_0481","94":"Diary_0481","95":"Diary_0481","96":"Diary_0481"},"Date":{"0":"unknown","1":724.0,"2":725.0,"3":726.0,"4":727.0,"5":728.0,"6":729.0,"7":730.0,"8":731.0,"9":732.0,"10":733.0,"11":734.0,"12":735.0,"13":736.0,"14":737.0,"15":738.0,"16":739.0,"17":740.0,"18":741.0,"19":742.0,"20":743.0,"21":744.0,"22":745.0,"23":746.0,"24":747.0,"25":748.0,"26":749.0,"27":750.0,"28":751.0,"29":752.0,"30":753.0,"31":754.0,"32":755.0,"33":756.0,"34":757.0,"35":758.0,"36":759.0,"37":760.0,"38":761.0,"39":762.0,"40":763.0,"41":764.0,"42":765.0,"43":766.0,"44":767.0,"45":768.0,"46":769.0,"47":770.0,"48":771.0,"49":773.0,"50":774.0,"51":775.0,"52":776.0,"53":777.0,"54":778.0,"55":779.0,"56":780.0,"57":781.0,"58":782.0,"59":783.0,"60":784.0,"61":785.0,"62":786.0,"63":787.0,"64":788.0,"65":789.0,"66":790.0,"67":791.0,"68":792.0,"69":793.0,"70":794.0,"71":795.0,"72":796.0,"73":797.0,"74":798.0,"75":799.0,"76":800.0,"77":801.0,"78":802.0,"79":803.0,"80":804.0,"81":806.0,"82":807.0,"83":808.0,"84":809.0,"85":810.0,"86":811.0,"87":812.0,"88":813.0,"89":814.0,"90":815.0,"91":816.0,"92":817.0,"93":818.0,"94":819.0,"95":820.0,"96":821.0},"Entry":{"0":"\n","1":"\n\nGreat deal of bustle and stir and orders out to destroy all plans and pack records for carriage to Alexandria. Seventh Bde. and others leave tonight we are due after them I suppose and the lads do want a rest. Good many men moving to and fro and a lot of furpheys flying round. Brigadier rang me up and said he wanted at once a fatigue of 100 men. Had 119 over there inside half an hour and put Lieut. Stewart in charge. \n\nNew hospital ship in today fourmaster similar to French Croix Rouge ship I saw at Cape Helles but this flies our colours. \n\nLast night \"D\" Co. sent a patrol up Wiregully. Norey (a daredevil) an old hand, saw a Turkish sniper, detached his bayonet from his rifle put it between his teeth and crept off after the Turk in Gurkha fashion. Didn’t score a kill but brought back the headgear of a dead Turk he came on in his travels. \n\nAt 1430 the enemy commenced a heavy shelling with 8.2 shells which tore up the earth & filled the air with fumes. They come with a low swish through the air and can be seen dropping to earth which they shake the ground in the vicinity. Some burst down Gully, one buried a man completely but when they dug him out his only injury was a sprained ankle. Another wrecked rear wall of a trench and wounded two severely. \n\nMen busy digging trenches on Braund’s Hill and work is to be carried on all night in other directions. Bodies of men filling the forward tunnels with tons of ammonal, tamping these mines with sand bags ripped up from the road or anywhere else in rear and rushed in after the explosive. Indeed we have trouble in restraining the Engineers from pulling down our defence sandbags! M.N.M. and 13 L.H. at loggerheads – taking over again. A personal chat with other O.C’s would fix everything up always and a little give and take makes things a lot smoother always. \n\nSome .75’s flying round. An aeroplane up - too high to distinguish whether ours or a Taube. All day a heavy rumbling could be heard from the South and from Chanak. \n\nLieut. McKay Bde. Orderly officer leaves to night with officer’s baggage so I took over the Brigade Canteen money from him and sent Stewart with it to find the Field Cashier. \n\nTwo of our aeroplanes aloft diving late afternoon and the Turks put\n\nAnzac\n\n12\/12\/15\n\nsome shots very close to them with their anti-aircraft guns. 5th Field Ambulance also moving off. Our men working on detached jobs are all reporting back today - some of them we have not seen for six weeks or so. The men tonight are getting sauce and other extras, 30 cases of gift stuff having arrived form England. Paton, A Coy is still missing, - as he is the gentleman who is always complaining of \"invisible & noiseless bombs\" perhaps he has gone clean of his head and taken to a wandering fit. After dark the sniping from the Jolly sharpened up and the bullets seemed to be flicking by in concerted bursts, heavy bombing was also in progress and a good amount of Hotchkiss and machine gun fire. One of our guns on Plugge’s Plateau was belching out into the darkness and the sound of rattling winches from the beach spoke of activity there. The place looking its very best and very impressive in the moonlight our patrols went out but did not encounter anything of note. Have made Peart clean out the whole place today burning and scrapping all unnecessary documents. Overhauled personal gear and jettisoned superfluous articles to lighten the load. Went to bed at 2030 and had just got to sleep when Colonel Crouch woke me up and showed me a letter saying he was appointed commandant Australian Advanced Base Camp Mudros and to leave at once, or before noon tomorrow. Major Smith then came in and said Q.M. tells him Ordnance have orders to pack up, stores are going off as fast as they can send them, and they have supplies of petrol for such stacks as they cannot get away. Told him about C.O.’s shift and then went to sleep again. Wakened up after 2200 by C.O. who had been to see Brigadier and found we had to leave by early morning boat at 0600. He said Brigadier was asking a good deal about me and they seem to have me marked out for some job. Got up and took over all secret documents and plans also books and papers relative to Battalion and other funds. Turned in again and the extra heavy firing was rather disturbing. Awakened again about 0300 by C.O. to say Goodbye. \n\nAnzac\n\n13\/12\/16\n\nSlept until 0555 when orderly roused me for the stand to arms. \n\nAfter stand to slept again until awakened by C.O. again who found boat was not going today. He says lighters full of shells were going off on all sides and great bustle. During the night the beach was well shrapnelled by Beachy Bill, the sound of whose discharge seemed much louder than usual. \n\nLoaded with packs the C.O. and his party had a rough exhausting climb up the hill and Coustler came to me and said one of the fatigue men was ill through the exertion and could I give him some rum. Then R.S.M served him out a good tot of grog and Coustler called in after to say it had saved the man’s life! Rum seems to cure a variety of ills and the men look forward to it. \n\nThis is a day of furpheys Beachy Bill very busy shelling beach and about lunch time a heavy bombardment took place on the left. The captive balloon was up from the balloon was up from the balloon ship for observation purposes. .75’s and stick bombs active. \n\nIssued orders which will get us under \"bare poles\" signal and medical stores packed and sent to QM. Capes and thigh boots returned to store. All rubbish papers &c in dugouts to be sent to incinerate. The men’s kits \nthe\n kits overhauled and all they cannot carry burned. Packs to be partially packed, all surplus gear returned to store and generally all ready to \nmarch\n out. Big parties at work trenching on Braund’s Hill and right down hill and across gully are barbed wire entanglements. Quartermaster’s stores packing up tools equipment and other impedimenta, Engineers barricading and loopholing communication trenches further back from firing line and laying mines. All smoking stopped in tunnels on account of those already laid, and of the quantity of fuses & ammonal about. Odd men picking and tapping on the different faces in order to\n\nAnzac\n","2":"\n\nkeep up the noise while big parties are tamping the mines in main tunnels with sandbags taken from the support trenches. Fire trench being put into slap up order. One machine gunner (24th Battn) killed about 0930, bullet came through weak point in the emplacement and hit him in the stomach, - died almost at once. \n\nDr Fogarty having left Drummond is doing ours & the 21st sick parade as well. Remarkable fact that the unsettled feeling in the air has cut down sick parades to vanishing point. Previously they were extra large. Orders out no more letters accepted for transmission through the post except urgent official. \n\nReported this afternoon that Ordnance Stores at the Beach where thrown open to all comers and British warms, gumboots underclothing and a hundred other things were to be had for the scrambling. Thousands of pounds worth of goods scattered round in dugouts and gullies, privates wearing officers warm coats and leggings and burdening themselves with a lot of stuff which will only be cast away when the novelty wears off. Not much to the credit of those on top that what costs so much to produce should be wasted so. Our stores here will probably be similarly treated. Made provision for the secret disposal of all surplus rum on hand, leakage is bound to occur or stuff overlooked in shift and any temptation is best destroyed. \n\nBig engineering fatigues working all day and all night putting tons of ammonal under the Turks in the mines. Entanglements and trenches now across all gullies and roads in rear and work pushed on with feverishly. \n\nNo enemy aircraft up today but ours was aloft during the afternoon. Bombing & sniping as usual and not so far as heavy from enemy as last night. Machine gun bullets flicking overhead in little whizzing flights. Another migration of birds appears to be taking place perhaps woodcock or quail. Some clouds of them flying very low and it was amusing to hear our \n\nAnzac\n\n13\/12\/15\n\nsports wasting a few bullets into them & hear the sharp crack of Mausers as the Turks in front did the same. Heavy rumble of artillery in the distance seemingly from the direction of Narrows. Rumoured an 11 inch howitzer was put into position by our people today so old Abdul should get some hurry up from it. \n\nAt Brigade headquarters during afternoon and talking to Brigade Major. Had a narrow escape before tea, a stick bomb burst near Parade Ground and big splinter smashed into bank a few inches off. Several thought I was hit but I walked on as if nothing happened – needless to say the unconcern was far from what I was feeling. \n\nTurned in at 2045 and except for sundry messages &c had a good rest.\n","3":"\n\nCalled out at 0500 to speak to Brigade Major Goucher in connection with spies who are suspected to be about and several suspicious events have occurred. Just after retiring last night I heard a fumbling and creeping noise on the hillside and took revolver and crawled on belly on a stalking expedition. Just nearing the quarry when a flow of good crimson Australian oaths and curses established the bonafides of the person who was a signal linesman repairing a fault in a telephone wire that runs on the ground all along the scrubby hillside. \n\nColonel Crouch got away before dawn so will now be on his way to Mudros. Our patrols saw some Turks wandering round in front probably snipers. Owing to units getting out some have not destroyed their rum and the flowing bowl has been circulating round some dugouts rather fully. Taking strict precautions. \n\nBeachy Bill shelling the beach in bursts. Cleaving everything heavy right out of the place altogether. Expect some fun here soon & the devil take the hindmost. \n\nAnzac\n\n14\/12\/15\n\nEvacuated all the sick who are not able to walk. Corpl Cowan A.M.C (10 miles cross-country champion) sent of with appendicitis to hospital ship. Shipping active along beach during night but all standing well out to sea in daytime. \n\nOliphant and Sanderson brought back under escort from the beach not having completed their term of imprisonment. As they had been doing Field Punishment No.1 and been chained to posts not wishing to humiliate them before their comrades in the trenches I had their sentence in that respect, suspended but of course forfeiture of pay continues for full term. The thanks the two wasters rendered was to promptly \"imshi\" absent without leave so on their return I clapped them under close arrest and will lose no chance of running them up for court martial. \n\nRegarding venereal disease it is not the custom to evacuate men suffering from clap or gonorrhoea. We have had men with a discharge for months past beyond an occasional piece of wadding &c no trouble has been taken over them. \n\nThe Engineering fatigues require a lot of working as our numbers are so reduced it is all we can do to man the firing line. They don’t seem to know what they require but recognise their big job & we meet them as far as possible. Last night a fatigue made a dump for spoils of our newly excavated latrine pit which we had got down 20 feet after much labour!. \n\nOur aeroplanes very active during the morning no less than 5 being aloft at once. A Taube flew over later on and our antiaircraft guns did some close shooting. Observed from the Tambour post that the enemy were seen in larger numbers than usual going towards their latrines. Mackay reported so in almost these words and our repetition to Brigade evoked a rather amusing reply. Maconachi ration for tea am saving mine for when we move out meantime in the mess we have a large \n\nAnzac\n\n14\/12\/15\n\nstock of salmon and tinned fruit to get through (Arab chanty:-\"Ah lah dis! \nChorus\n Yallah Yallah). \n\nErected entanglements today right across gully and also laid a rope of barbed wire among undergrowth keeping it about 2ft 6ins high. In Pedler’s dugout after evening stand to arms like a big cellar 15ft underground. As soon as darkness came, trawlers and other craft some apparently a fair size stood right in under the cliff and the continuous rattle of winches told a story of busy loading. Beachy Bill plugging all the time with well aimed shells, the sound of the gun can be heard very plainly today followed by the scream of the shell and then its explosion. Two fixed lights for naval shooting, shining very brightly from Walkers Ridge. Turkish patrol suspected in front so sent a rocket up at 2030. Except for the usual snipers our patrols encountered, everything seems quiet between the trenches in \"No Mans Land\". It certainly was rattling and bombing hard on the left during the darkness. Fatigues working all night, tamping &c.\n","4":" \n\nA cold windy morning. When day broke the sun came out and made the white caps of the rough sea look very pretty. Two large white hospital ships close inshore, the cargo boats going to Suvla during the day. Brigade Major and Staff Captain in, talking and we are thinking of our second line of defence and its problems of ammunition supply &c. Surplus jam tin bombs ready to be dumped in a choice spot where no one would undergo the unpleasant job of fishing them out. Very heavy rumbling cannonade the other side of the peninsula. No 75’s today. \"Dinkum oil\" received and 1600 and I volunteered for the job of being the last to leave this position when they do go. Stores &\n\nAnzac\n\n15\/12\/15\n\ntinned chicken sent up by A.S.C. who are clearing out stocks. After dark very heavy machine gun fire and bombing up on Russells Top. Before stand to, up the firing line talking to the men. They have rigged up notices. \"TrenchesTo Let\" \"Abdul! Call again in Spring\". All the lads as happy as Larry. A bright moonlight night, the hospital ships gay with lights close in. We are making some noises in front with rattling tins for Abdul’s benefit. Gave Hogarth the tip to dispose of mess stuff. Peart asked for permission to have some shots & unloosed 10. Made him clean and oil all my pouch ammunition and sharpen bayonets &c. Extra A.M.C. men reported for duty. Men getting puttees, leggings &c from Ordnance in large quantities. Our patrol saw a Turk within 10 yards of our trenches hidden from view, which shows necessity for conversation in undertones. Reported the other night one crept right up under cover of a steepish cliff and looked right over parapet. Seen by man who was a few yards away from his rifle. Sniping slack.\n","5":"\n\nCloudy day no wind sea calm. Later a sunny day but cold in the shade. Four hospital ships in. Capt. Thomsen to hospital with mumps. Corpse out in front poisons the air, one putteed leg drawn up, quite like early days here. Chaplain embarks tonight. Posting strict guard on hillside tonight orders to shoot to kill on sight. Picked L Cpl Chalmers for the job as a steady determined man for Corporal of the Guard. Am to be the last out of our lines myself when the fun commences. Rather a tribute to the strain of war that we have had to call today for a return for half-witted and \"soft\" men in order to get them out of the way so as to leave the remainder reliable. The \"human machine gun\" still flourishes but the voiceless bomb maniac is missing. A big gun (new) of ours slashed out suddenly at dusk and provoked a prompt reply of shells from Abdul most of which burst in the air\n\nAnzac\n\n16\/12\/15\n\nin beautiful little fleecy clouds with a core of fire and death. A Taube up very high and our planes also up, guns shooting at them from both sides. Men are busy today making moccasins out of blankets to muffle the tread of their feet. Talking to Stewart in trench and could hear splinter of a high explosive shell coming closer every second with a sound like the ignition of a match. Skimmed past my ear and buried itself in the bank in front. \n\nA glorious moonlight night. Walked over to Bde and got preliminary orders. Entered upon a period of silence for 3 hours which was a success enemy remembering their experience last time when they had 150 dead. Upon resumption of fire a demonstration continued for a time but soon died down. The moonlight prevented the sending out of patrols. Shelling of beach kept up all night from Olive Grove. Weird to lie abed and hear the message of death screaming through the darkness. Bed 2200.\n","6":"\n\nBusy telling off boat parties &c. A lovely sunny day admired, view from Regimental office looking down from our 400 feet, the blue sea and sweeping coves in front and beneath our feet quiet ravines no longer busy with mules and mulecarts. Our aeroplanes very active and circling round dodging Abdul’s shells. A good many torpedo boat destroyers about today.\n\nDrew iron rations, and had biscuit, Maconachie and pineapple for lunch. Saw flashes like signalling down valley and sent the R.S.M to investigate. It proved to be a piece of tin on wire twisting round in the breeze. Some shrapnel and 75’s today. Some of our \"warbs\" are very irresponsible people calling out \"Cooee\" and \"so long\" until severely warned, and also throwing discarded shirts over the parapet. On explanation that any man will be shot in his tracks if he does these things, the froth is taken off the exuberance of these spirits.\n\nQuiet in early part of the evening. Beachy Bill putting his shells well over on to the North Beach. Hospital ships lying on smooth water which is, all the same, so full of treacherous eddying\n\nAnzac\n\n17\/12\/15\n\ncurrents, that in a blow a vessel’s engines have to strain their hardest to keep her from going ashore. Discretion forbids writing a fraction of the interesting things I should like to about the last few days. \n\nAbout 2000 a mist came up the gullies – white wreaths in a calm moonlight. Mac, canny Scot, making sure of every detail by reference to me. Up from the sea at the change of watch comes the sound of the ships bells. R.S.M Salmon says my bell for orderlies can be heard down the valley. At 0100 a dense fog came up and sentries had to be doubled. 3 heavy howitzer shells plunked into hill just outside my dugout. Broken sleep orderlies in and out during the small hours with orders and messages. Had to get up at 0400 to inquire into a patrol – the place looked so beautiful I shall never forget it. The moon was dipping into the sea, the clouds dense black\n","7":"\n\ncovered the entire sky save one little strip of moon on the horizon. \n\nA dim light showed up the frowning ridges around and fog filled the gullies below. Reflection of a big fire on the North Beach lighting up the sky there. This fire broke out about 0100 and burned furiously throwing up clouds of sparks from occasional explosives. An enormous pile of stuff on fire most unfortunate at this critical time and probably due to treachery. Beachy Bill keeping up a steady bombardment right through the hours of darkness. A dull foggy day which towards evening became brighter. Sea very calm and tranquil fortunately for the slightest roughness euchres us. \n\nReceived fully detailed orders and I am leaving in command of the second last party which is followed in 5 minutes by the last. Sergt. Stone DCM & LtSgt Campbell will be with me. 150 rounds rifle bayonet and revolver and a bomb in each pocket. Pack being sent on before per Mitchell as I am wearing fighting order same as the men and let all the Turks come! Old Ped will also be in at the last scene of the strange eventful history. Late at night the first batch slipped away like ghosts in the night, good lads they made no noise with their feet swathed in blankets and not a cough was to be heard among them. Taube flying very low hovering around after dark. All quiet sea smooth & an occasional sailors hail can be heard from the water at 2330.\n\nAnzac\n","8":"\n\nAt 0130 Mackay left with 250 men, not a sound rifles slung downwards and butt plate covered with cloth. Mess tins rattling made more noise than any other part of the equipment. We had spread loose earth all over the floor of the trenches and over the paths and rocks. They were just like a flock of sheep following each other and not murmur. Some of the men had a scared look but had implicit faith in their officers and looked to them for everything. Good trained men. Mac. looked so young and boyish and seemed to feel his responsibility. Shook hands before he went and seemed to think we would never hold on till the next night, seeing all his had gone. \n\nWent to bed and had two hours sleep. Day broke cloudy and enemy commenced heavy shelling with 8.2 shells. Our kitchen wrecked and pieces of shell flying all round. Such a bombardment with big shells was unprecedented and they came roaring by like a train. We had just had our last hot meal when one shell blew the kitchen to blazes. We stood to arms with our thin garrison for an hour. It was an anxious time as it looked like the prelude to an attack and a repitition of the Lone Pine business. 75’s also busy. Monitor last night said to have kept a searchlight on Gaba Tepe for hours and prevented observation from there. \n\nMy party tonight:- 24th. Bn. Gunners Hogan, O’Brien & Brandeburra 22nd. LtSgt Campbell, 826 Hall S., 7 Payton A, 916 Wood ROS & 21st. Ptes. Moffatt Stapleton & Tait. Tripod covering party. \"A\" Co. Daniel & Glover. \"B\" Co. Lugton Haylock & Heffernan. \"C\" Co. Sgt. Stone D.C.M, Oldfield & Anderson \"D\" Co. Parsons and Anderson. In C3 party is included Fenton Horan. We rigged up in\n\nAnzac\n\n19\/12\/15\n\nthe Tambour a group of dummy soldiers officer and men and made them very lifelike. Our seaplane up during the morning and kept very busy as we wish to avoid aerial reconnaisance by Abdul for obvious reasons. ‘Plane did some fine evolutions diving alighting, rising and circling round the torpedo boats &c. for the rest of the day there was little to note.\n\n(Mudros. 21\/12\/15. Have had no time to write in this book up to date but here goes)\n\n19\/12\/15\n\nAs the valley and the rear of our position were absolutely deserted and all the usual throng and bustle there at ordinary times was absent, we were especially anxious to avoid aeroplanes of the enemy and our planes in consequence kept aloft all day. It was rumoured that a German submarine was about. The enemy had no idea of our intention to evacuate I am sure and being prevented from aerial reconnoitring by our planes, they thought rather by the activity of shipping and so on that we were bringing in troops and preparing to attack!. That we were clearing out never struck them apparently. \n\nDuring this afternoon a terrific bombardment of Achi Baba took place and continued till next day. The hill was white with shell bursts and the continuous rattle of a heavy rifle fire told of a battle down there. We heard later that some Turkish trenches were captured. We held our line with about 450 men all day. At 2300 about 140 left and all the rest except 60 men left at 0100.\n","9":"\n\nFrom that time on we held the line with 60 men only against heavily reinforced enemy stated by our intelligence to be 2200 strong.\n\nAnzac\n\n20\/12\/15\n\nThe men kept sniping up till the last moment and then in batches quietly slipped away along soil covered communication trenches to ledge at back and then with blanket padded feet and loaded with packs and gear crept silently away through the deep gullies, looking in the moonlight like gliding shadows. My job consisted in seeing all these various parties off and then reporting their having left to H.Q. Bde. H.Q. shifted at 2200 to Reinforcement camp and after that we were blocked right through on a line to the O.C. Rear Guard on Plugge’s Plateau; where, in case of accidents a force remained heavily garrisoned with machine guns. \n\nAfter the last big party left and only our 60 were left we shifted Batt.H.Q. up to Pedlers dugout and I took a turn at patrol duty in the fire trench, walking along and telling all my party (C2) our plan of action and all were quite prepared to fight our way out and we had bombs in our pockets for unforeseen occurences. Furnished beforehand nearly every man with a watch, calling them in from others to do so and set them at Divisional time checked through the signallers. This time checking was quite a feature of the whole evacuation and as parting times came officers were conferring watch in hand and checking the mens watches. Sergt Craner was of great assistance to me checking off the men’s times and finding the way about.\n\nAnzac\n\n20\/12\/15\n\nThere now remained in the trenches in front of Johnstons Jolly at 0100 from the other side of Wire Gully up to Lone Pine ( ½ to ¾ mile) only 60 men. There were however 10 machine guns with a crew of 3 each and about 20000 rounds of ammunition to each gun. The remaining 30 men were all picked volunteers reliable and dying for a scrap. If Abdul had attacked at 0100 while we still had the machine guns I think we would have repelled it with our guns with the stream of bullets. \n\nJust before the guns left I fired the parting shots playing the fire along the enemies barbed wire entanglements about 80 yards off. Lance Sergt Campbell gave me a piece of the belt as a souvenir of what was perhaps the last British machine gun fired in Anzac. – I certainly heard no other afterwards although Turkish machine gun fire was heavy. \n\nAt 0215 the machine guns were all dismounted and 20 gunners, Major Smith and Stewart departed the men carrying the guns but abandoning all the S.A.A. This left Pedler and myself with 40 men between us, our plans were to keep on sniping as usual letting the men run from loophole to loophole firing so Abdul would think our trenches occupied as usual. If attacked we were at all costs to hold on until all previous parties clear and then fight a delaying action getting down to the beach the best way we could. \n\nWe filled our pockets with bombs in case of a last stand and had sent packs and everything else on ahead keeping only fighting kit. It was quite novel walking along the deserted trenches all littered with earth kit and other gear and in a \n\nAnzac\n\n20\/12\/15\n\nfilthy condition very different to our usual spotless cleanliness. Word came by phone that I was to leave 5 minutes before Pedler. I wont forget the excitement of this time, the trenches deserted except for an occasional sniper pottering away in an absolutely isolated position, Sketch \"A\" Co particularly walked up and down and from \"B\" Co down to B8 there was not a soul. A daring enemy scout had only to put his head over and look round and we were done for. \n\nIt was cold and a bright moonlight the rifle and machine guns reports cracking sharp. Biscuits bully beef and other stuff lay everywhere and I carried a small miners pickaxe and carefully punctured any tins I passed so the contents would be useless. Flare oil was running to waste, waterproof sheets slashed to pieces and rubbish & blankets lying deep on trench floors. It was a remarkable sight. Time seemed to drag and we kept looking at our watches, the excitement caused excessive secretions and the rear trenches and dugouts were systematically fouled, the need for the observance of the rules of sanitation being passed. Hostile sniping was fairly heavy. \n\nAt 0235 I was due to go but stayed laughing with Pedler at the splendid joke we were putting up on Abdul over a bottle of stout so we left together the last Australians out of Johnstons Jolly. We formed up near Dressing Station and on road respectively and then set off down valley. All our trenches were now empty & Abdul had only to come over to take them. There was now complete silence from the whole of the Anzac position except for the straggling reports of a few fuzed and timed rifles we had rigged up with cord weights &c so they would automatically fire some minutes after we had cleared out. The enemy continued to plaster the trenches with the usual hail of bullets. We went straight down by road to the Lower Banks.\n\nAnzac\n\n20\/12\/15\n\nIn the clear moonlight the hills on either side rose steeply. Our one idea was to push on as fast as possible and the men struggled along panting and nearly exhausted. We then went through Rest Gully (I had sent guides over the route during daylight) and found the climb over the Hole in the Wall very severe. The Beach was crowded, other parties were converging and from here on things got mixed and some of my chaps went one way and one another. Got aboard a lighter on which were all the last to leave, the OC Rearguard, the M.L.O, B.M. &c. \n\nWe then put off and made for a transport the bullets flicking alround some very close. Abdul was still firing hard at empty trenches. Standing on the deck of the steamer we were out of range of the bullets. Before we left the beach though and when still on the lighter we heard a big explosion and a pillar of flame shot up into the sky. It was a mine of ours exploding on Russels Top. This at once provoked a very heavy burst of machine gun or rifle fire at the deserted trenches and it seemed strange hearing no reply in the duller thud of our musketry. \n\nThe big mines we laid containing tons & tons of ammonal were never fired owing the direct orders to the contrary. The Turks would get a good haul of valuable explosive. Why these were not fired I don’t know, certainly there was no lack of volunteers to touch them off. I think it was a big mistake to leave them as they would have blown hundreds of Turks to hell. I don’t think the heads looked for the evacuation being such a success, and consequently the question of firing these was overlooked. It would have been a great spectacle – the fame of these mines had spread abroad and on the cliffs at Imbros the members of our 1A party were straining their eyes expectantly to see a great explosion that never occurred.\n\nAnzac\n\n20\/12\/15\n\nThe proposal to tie bombs &c on to hats and other articles in the trenches so any inquisitive Turks who picked them up, would be blown to pieces was vetoed on the grounds of humanity – quite wrongly I think as all is fair and we are out to kill. \n\nThe evacuation was a thorough success and the enemy completely bluffed. The cost was large. We left behind in Anzac hundreds of good shells, millions of rounds of SAA and thousands of pounds worth of stores. A lot was destroyed by us but they acquired a lot of valuable munitions and provisions. Into our latrine pit we threw 70000 rounds SAA 1500 grenades and bombs. The enemy are welcome to this if they like to clean it. The men punctured all bully tins and cut up their waterproof sheets. In one place they had erected a big board placarded all over with ribald postcards and cartoons of Kaiser Bill and the Sultan and underneath was the legend scrawled in lead pencil. \"Abdul: you silly c – \"! And so he was, to be fooled so easily. \n\nAll the way down the tracks and gullies were pads of blankets and strips of cloth that had come undone from the mens boots. I worked my moccasins puttee fashion and they wore through the soles before I had started to go down the track. Still dark we clustered on the after deck of a slate coloured steamer about 6000 tons. From Suvla came the sight of a large fire which was their tents burning and stores fired. A lot of transports were standing out from there having taken the troops off. We weighed anchor before dawn and I rolled up in a blanket I had carried over my arm from the trenches and dozed till 0600 when the biting cold woke me. Got up and met Stewart also prowling found saloon crowded with officers and men all filthy dirty lying huddled up on the floor. Had some breakfast and then laid down on a heap\n\nAnzac\n\n20\/12\/15\n\nof dirty rags and papers and slept. After 3 days without sleep it was sweet. Awakened at 0930 by someone saying \"We are going alongside\". Went on deck on found we were lying in Mudros harbour. Transhipped to TS \"Camponilla\" and after lunch transhipped once more to the \"Waterwitch\" which landed us at a pier at Sarpi. We marched about 5 miles to camp and being fired and loaded up with packs we had to rest frequently. Reached camp after dark and after getting tents got to bed about 2100. Slept like a top, all the lads dead tired and not a sound heard except snores until 0800 next morning. This day the 20\/12\/15 is the longest in my life. I’ve fought Turks, gone thro’ an evacuation, sailed in various craft, and done God knows what including pitching a camp since last midnight.\n","10":"\n\nSettling down in Mudros Camp no parades but plenty of fatigues arranging sanitation and stores. Heavy rain during day and wind. Had this rough weather come yesterday it would have blocked us getting off the Peninsula. Providence? – or the Devil? Our first (1A) party has not turned up probably at some other port. Q.M. Craig & 170 others in this. Quiet, all dog tired, weary, and nervous, thanking God for a rest\n\nThe men smile at each other and seem all strung up to a high tension. They go about in a strained way frightened to shout or to go over a sky line and a wag has only to make a hissing noise like a shell to cause a scatter. When a man hears a shell his instinct makes him go for cover. Men have got behind a waterproof sheet. The Maltese & Egyptian labours used to cover their head.\n\nLemnos\n\n21\/12\/15\n\n\"B\" Coy. have an orderly named Gilham. This fellow has a weak face and has grown a soft and silky beard which gives him a very spiritual and aristocratic look. He is known universally by the nickname of Jesus. It seems strange at first to hear his comrades expressions. \"J - you - - pass the -- jam.\" He answers to the name and everyone takes it as a matter of course. \n\nSome of our men have not had a bath since we went into the trenches four months ago and most of us have not had our boots off for a few weeks. Last night all stripped and had the luxury of a sleep between blankets and as the men are 14 to a tent the hum can be better imagined than described. Perhaps the funniest incident in our journey from trenches to camp was that of the indefatigable Peart and his batman. Peart was loaded up with pack & blankets like a camel covered with haversacks bags of stationery loose straps and iron rations tied on anywhere. He struggled along under this load but found it too much having to bustle round for parade state and he found it too much. Next thing I knew was Peart reporting to me at the head of the column & rolling his bloodshot eyes as he handed over the parade state. Behind him was an undersized filthy Egyptian slobbering & diseased with a roll of blankets round his neck & grinning. Peart had \"hired\" him to carry his gear. The men did not move a muscle at the ludicrous sight. But when \"I roared\" Take that – nigger to hell out of this\"! they roared with laughter.\n\n22\/12\/15\n\nReveille 0700 struck camp during afternoon and I reerected on new site. Fine day. This place full of enormous camps the harbour very fine and full of ships, the beach only about 400 yards off. The scene at night is beautiful. The hospital ships lying rows full of lights and a blaze of illumination from stem to stern. Plenty of warships rushing about. Staff Capt says we are off to Egypt in a few days. Received orders all of we \"C\" parties are to parade at DivHQ tomorrow\n\nLemnos\n\n22\/12\/15\n\nfor inspection by G.O.C. In the evening went over to see Col Crouch at his camp near a big tower found him well and happy housed in a stone place. \n\nThe men all happy in their tents and singing. The first time for months they have dared to exercise their lungs in song!\n\n\"At the halt on the left form platoon\n\nAt the halt on the left form platoon\n\nIf the odd numbers don’t mark time two paces\n\nHow the hell can the boys form platoon?\"\n\nTune:- \"Red White & Blue\"\n\nOld Brown’s cow went &c. Tune:- John Brown\n\n\"I want to go home! I want to go home\n\nTune:- Hymn On! Steadily on!\n\nAll beards shaved off today and hair cut generally smartening up. Great night of song in the lines.\n\nCapt A R Wiltshire\n\n22nd Battn AIF.\n\nArrived Anzac 4 Sep 1915\n\nEvacuated Anzac 20 Dec 1915\n\nArrived Lemnos 20 Dec 1915\n\nArrived Egypt 7 Jan 1916\n\nTel el Kebir 9 Jan 1916\n\nDesert of Sinai 25 Jan 1916\n\nLeft Desert of Sinai 7 Mar 1916\n\nArrived Moascar 8 Mar 1916 \n","11":" 182\n","12":"\n\nSlept on wet ground in same tent as Doctor. Up at reveille 0700 and followed usual routine. Parade at 0900 drill section & squad drill with arms, men soon picking up their smartness. Stayed in doing odd jobs about the place. Message arrived just as \"C\" parties were ready saying ceremonial parade would not take place at Divnl Headquarters owing to \"embarkation tomorrow\". We expect to leave for Egypt any time now. List required by 1130 after about ¾ hour notice as to all clothing equipment requested and may want. Being unable to supply correctly without kit inspection sent in rough estimate. This to enable Division to have stock in Egypt. Great talk of a mail but owing to prospective move will probably be withheld. \n\nThe weather today very chilly and dull. The side of the harbour nearest to us is allotted to the hospital ships indeed the harbour is full of shipping. Kit inspection and pay this afternoon. About 1600 with Major Smith Mackay & Drummond went along beach for about a mile and a half. Aquitania nearly 30000 tons 4 funnels now a hospital ship now coming in through harbour entrance. The country very stony, it is an easy job to build a hall or a road. Saw a peasant ploughing using a pointed stick two oxen drawing this implement. On some donkeys close by noticed the same type of wooden saddle as used in Imbros. After that found a man wandering about with very few clothes on, as he was drunk had him looked after.\n","13":"\n\nRaining during morning so buglers sounded \"no parade today\". It is great to hear the bugles again. In the afternoon marched out with rifles and equipment and did some drill and then the men played duckstones and relay racing. It seemed strange to see men some of them quite elderly laughing and running about playing kid’s games!. Anything to keep their minds occupied. 30 cases of Xmas billies arrived during the day and every man got one and a plum pudding. All delighted. Sparrow returned from Imbros with his stores. He says May and our first party of 180 have already gone on ahead to Egypt. Detailed Roth & 15 others as our advance party ready to embark at a moments notice. All hands feel unsettled here as unable to take much interest in the place. \n\nWe are well away from the waterside, the harbour seems very shallow round here. The land seems to run in folds with little gullies at foot where wells are. Any amount of stones about. Our peasant was ploughing again with his oxen & wooden plough and sowing barley from a small bag. Being Xmas Eve the camp was a merry one. Viewed from above the place was a sea of lights and from the rear the hum of other camps came. All our men inside their tents playing mouth organs & singing. Many times sung with much gusto – well known hymn tunes but the words most profane. To the tune of \"Holy Holy Holy Lord God Almighty\" they were chanting \"Rousing, rousing, rousing always – well rousing\" Plenty backsheese sucker, sweets &c today. My billy came from Presbyterian Ladies College and two others from Sybil GreySmith Melbne & Miss Reynell South Aust. \n\nFind evenings very long with nothing to do. Tomorrow we get a half holiday and we were going to Therma where there are hot springs for a bath but we are some way out of Sardi where the donkeys are. Castro the other port is on the other side of the island. The splendid harbour here takes my fancy, surely Britain will never give this island up again. Read & bed early.\n","14":"\n\nXmas Day. Foggy and chill in early morn but sunrise at 0900 was remarkably fine one golden beam of light making a shining pathway across the water to the East. The bulk of ships showed up distorted by the mist. At 1000 the Battalion turned out with the Engineers to Church parade. The men all cleaned wore cap and tunics breeches puttees & side arms and formed up in a hollow square.\n\nVery pleasant in the warm sun. Most afterwards made for the beach armed with towels while others sat naked in the sun lousing themselves. Am still very lousy myself and look forward to a good hot bath if we strike a decent boat en route to Egypt. \n\nXmas dinner in my tent. Padre Bennett, Major Smith & Mackay & Dr Drummond. Two kerosene boxes side by side served as a table and we squatted round on packs. Dinner consisted of stew plum pudding dates figs oranges and some sweets. After lunch I spent a half hour picking up the run of the mechanism of a Turkish rifle. They do away with the ejector screw by simply cutting away the cartridge causeway. \n\nThe sun continued warm after lunch so Major Conway Dr & I went down for a swim, soaped up well and after the dip sat down searching for lice. Continued further along the low stony beach the Aquitania is still here – rather a neat dodge making her a hospital ship to avoid her sharing the fate of the Lusitania. All the men in great heart now as merry as sandboys. Put a 17th. Bn man under arrest for fouling water reserve and sent him off under escort. Porter is acting R.S.M. think I will keep him on the job. He has a family and increase of pay means a lot to him. Mitchell my batman continues good and reliable and has now looked after me faithfully for 6 months. A shrewd head. Slept soundly and warm although the wet ground seems to send the cold up through groundsheet and blankets.\n","15":"\n\nBoxing Day broke with a very fine sunrise and although cloudy cleared later on but not as good a day as yesterday. Church parade at 1000 went off well. After an inspection took place of the men and a number were found with unshaven chins and long hair. During the afternoon their mates were busy with clippers and razors brightening them up. \n\nAfter lunch met Harry Conway and walked across to the village of Portiana and another place both thronged with soldiers. Dirty places with pigs very close to living quarters. An old church on a rocky place surrounded by a stone wall. Watched some women grinding corn and a grain like small peas between two circular stones – the bottom one fixed the top with a handle revolving. A laborious operation as each handful was ground several times and winnowed by the lady blowing on it. An Indian sepoy was after a chicken but the answer was \"finish\". All nations around the Meditteranean seem to know this word and use it more extensively than any other. \n\nCalled on Dicky and found him comfortable we stayed for afternoon tea. He says we go on Tuesday but he only goes by rumour. His location will probably be shifted to Alex. Furpheys today (1)We are all going to be turned into mounted infantry (2)Our new camp is being prepared at Tel-el-Kebir (3)Greece & Roumania have joined on our side.\n\nSome good football matches in progress today. Sent Cawthorne and a party off to see if they could get 70 bags of mail belonging to us said to be on beach. It is the one thing our men need to make the Christmas complete. Drummond unwell today. This harbour takes my fancy – so capacious and yet the narrow entrance with its guns is easily defended. The boom is a double one. Turned in about 2130. Drummond ill.\n","16":"\n\nVery sloppy after rain in early hours but sun came out later and on parade became so hot that after lunch my cardigan jacket is going to be shed. Section drill with arms – all very rusty officers & N.C.O’s weak in word of command. Am holding a class this afternoon in communication drill for non coms. \n\nDoctor imshied to hospital this morning with quinsy. He has worked hard ever since leaving Melbourne. Dr. Craig took over in lieu. Quiet night.\n","17":"\n\nMorning sunny after a lovely sunrise. Took N.C.O’s for a class and gave them practice in communication drill. Some people further up are striking camp. Our regimental bugle call cut down to one call. \n\nAfter lunch went an 8 mile route march passed through Kundia but at foot of rocky hills all houses loopholed with the holes plugged up with pebbles. The upper story loopholed as well. The church decorated with quite elegant stonework, all the kids in school. Not as clean a place as Tenedos, in fact the people and village on Lemnos are not as clean as might be. There seems to be a strain of Turk. Most of the better looking girls are said to be collared by periodic incursions for the harems of the Ottoman, the mixed race is perhaps the fruit of the rapine of invasions. Good open country between the foothills most of it lying fallow. The oxen & crude wooden plough are everywhere in use. Under the bright sun & cool wind the green countryside appears most agreeable. \n\nBrigadier says today we may be here another week yet. Also reported two of 21st. were fired on yesterday in Kondia. The place is dirty enough to be half Turk. We sent 100 men down from Brigade and they brought our mail up. Great bustle in Camp and talking and laughing. Allowed some latitude regarding lights out.\n","18":"\n\nAnother fine day. Letters from home and all my usual correspondents. Parcel from Mutual Store sent by the Melbourne office staff. Struck tents for airing purposes at 0900 on a \"G\" from the buglers and then marched out to parade. N.C.Os class practisng word of command. Place of assembly near a little rough stone cottage and sheep fold. A circular threshing floor about 30 feet across constructed of irregular stones set on a level. \n\nNot so much shipping in the harbour to our immediate front today. Another small snug harbour just over hill from here crowded with small craft, great hammering and pier building. After lunch we kept up half holiday. A good many of the men setting out for Kastro and Thermos, at the latter place warm baths are to be had at natural shrines. The Brigade Advance party leaves tomorrow for Egypt. \n\nI spent most of the afternoon reading on the rise overlooking the sea. The beach was quite animated, so many men washing themselves and sitting quietly in the sun tracking down creepies. Amused at the scraps of conversation that came floating up – some of the lads can swear alright. Read Times till 1600 and then returned to camp. Some of the lads found great variety of things in their billies some few discovered f. l’s put in by fair hands. The whole camp is overdosed with parcels, food sweets &c and nobody wants them much – in the trenches we’d have given anything for them. Drummond isolated in hospital. Buckley writes from Cork Ireland. Bed 2030\n","19":"\n\nUp at 0700 Dr Craig fairly large sick parade. Left at 0900 for route march fighting order meal in haversack. Small parade so left two officers in lines to round up all there and drill them. M.M.L & K.R. will find further grounds for going further. Drilled on open ground in front of Kondia. Very pleasant in the sun. Peasants hard at work ploughing. Civil guard very elaborate in their neat uniforms. All walls loopholed and at every tactical feature on the country there seems to be some trap. Even the general layout of the villages takes a funnel shape to draw a force on and the houses built up hill one above another offer tiers of fire on different levels. No trees here and the hills have a bare sweep at places very rocky and steep.\n\nReturning we did an \"attack\" against a small rounded hill coming up in fine style and making the lads puff. Marched back into camp at 1600. Rumoured that we will be here another fortnight. Want to get out of this and back to civilisation for a week or two. All our water supply here is obtained from wells the water is pumped into tanks and then purified with chloride of lime. The soakage appears to be considerable and the under side of my waterproof ground sheet is wet every morning.\n\nShipping quiet in harbour, one torpedo boat destroyer tore out full speed. About 1700 saw a slight aurora borealis. Some of the issue English boots are n. b. good the mens feet are on the ground already and they can’t do parades as they ought. We’ll use them for stationary fatigue. Bed 2015.\n","20":"\n\nDense fog which cleared later and made sunrise a beautiful sight. Great hooting and blowing of whistles on the harbour. It did not lift until fairly late in the morning. Out over the ploughed land and loose stones and carried on with drill. I took the N.C.O’s and extended them in a circle to 10 paces and practised word of command. Great improvement alround and a general increase of confidence. After lunch practised the artillery formation and all hands did it excellently.\n\nThe Aquitania came into harbour late in the afternoon, a wonderful ship, her huge bulk dwarfing all other craft. Painted white she looked well in the sunlight. After dark one got a better idea of her size outlined as she was with lights from stem to stern. A good many transport in today. Our advance party leaves for Egypt in the morning and the latest \"dinkum oil\" says we sail on Wednesday. \n\nPeart unwell probably jaundice. Mackay & Craig in my tent yarning and swapping lego-medical reminisences. Having signed a number of chits for beer, there is considerable joy up the lies and the G.O.C has extended \"lights out\" till 0015 tomorrow (New Years morning). Singing and joking all are in good heart. In the 23rd. & 24th. lines there seem some very joyous spirits who give a great \"ahoy\" on each defaulters call. This camp at night is a great sight. With a candle in every tent & tents on all sides the place is bright with light. Turned in at 2145 and slept until 0000, a fine clear night and not too cold. Was awakened at 0000 by the\n","21":"\n\nsounding of bugles, blowing of the ships whistles and the cheering and singing of the men welcoming the New Year in. At 0015 lights out sounded and soon all was quiet. Heavy rain commenced about 0430 and dawn broke very cold and bleak. The harbour grey and foam-dashed full of craft, - some warships just making the entrance. Rain continuing after breakfast the no parade was sounded. \n\nA thing that strikes one both here and in Egypt is the absence of fences. For them is substituted the landmark, perhaps a rock, perhaps a furrow. To the outsider these boundaries are not apparent but do you trespass and the owners soon materialise!\n\nAfter lunch went with Dr. Craig to 3rd. General Hospital to look up Drummond. Found him in isolation ward looking very bad with para-thyphoid. Lister let us in though visitors barred. Very muddy and cheerless place, the nurses wearing gumboots and putties. Their quarters are wooden huts, but lack privacy and the life is very rough for any girl. Canadian sisters in similar quarters sporty looking pieces. Anyway it is good to put eyes on a woman and let’s hope next Saturday might well see us roaming out towards Mattarich or Le Caire with an armful of girl! \n\nOur advance party left this morning. One is struck at a base like this at the hundreds of men building roadmaking &c. Consider the hospitals & the hundreds employed there. Money poured out on all sides. Elaborate cement platforms constructed all over these valleys for pail latrines. Discovery afterwards is made no pails available and then no timber.\n\nGreat football match A & B v C & D Coys resulted in win for the former. Rumours that the evacuation of Helles is now proceeding, that there are 300000 troops in Egypt, that we sail on Tuesday, that the Kaiser is dead, and that our pay is going to be reduced 1\/3rd. A goodly budget. Cold night slept well curled up in blanket on wet ground until awakened by reveille.\n","22":"\n\nCold and bleak morning. Church parade 0900 fell in, sized and equalized coys marched to gully & formed up as Bde. Arrangements mixed up. Strong wind prevented Padre Stewarts voice being heard. Our chaps smart in greatcoats with sidearms on outside. Inspected them afterwards and found most of them very clean; a few razors are very dull and shaving is agony. Hope for a new issue soon. Blasson \"A\" Co was said to have shaved until he nearly cried but, knowing it would not pass, had the razor in his pocket and duly produced it.\n\nAt 1130 left with Davis & Roberts for Kastro and returned at 1930 a walk of 20 miles in all. Passed through Kondia and past a guard on stony mule tracks very similar to that in Imbros. Big row of windmills here grinding. Pushed on getting occasional glimpses of the sea and half way reached a very neat house with grounds enclosed by stone walls and kitchen garden & other cultivation alround. From one wall gushed a rippling spring and we passed several others of good water along the road. After long walking caught a sight of a high peak with sea beyond on upon it a tower, in point of fact a castle. Considerable mule and donkey traffic along road, from this on, the men frequently wore the red fez and appeared more than half Turk. \n\nComing into the town we chanced upon what was evidently the low quarter but an officer directed us to the best French cafe for a meal. Passed along cobblestoned and twisting streets and turned down a side street and entered a little low dining room full of English & other officers. Menu Omelette (very good) Fish Steak Rissoles Potatoes Cheese\n\n2\/1\/16 \n\nand Cafe Turque. Plenty of liquor on tap but we did not bother with any. Some French officers and soldiers about in the vari-coloured uniforms. Around the streets we found the shops well stocked and the place prosperous and much larger than other places I’ve seen probably about 16000 people. The sea comes right up to the street and some sort of a breakwater is there. The boats are wicked looking Greek craft of lateen rig. There appears to be a custom of placing wreaths over the doors of the houses. \n\nThe people are peculiar and seem distrustful, the men in their fezs look very Turkish and some had a turban arrangement like Bedouins. Some pretty girls. A baby put its fingers up in a cocksnook and some boys yelled out Australia no – good. One youth attached himself as guide and was joined by another both proclaimed Australia very good very nice and \"Turkey -- ! Also tried to indicate way to gay houses. Greek church a big place locked gates but went in and found priest intoning service with his clerk no one else present. Very prettily decorated usual glass chandeliers & incense. Lace hung round ikons. Date 1837. Turkish mosque closed, looked like a club from the street and their cemetery with tombstones crowned with tarbousches & turbans in stone was deserted. Number of buildings with Arabic inscriptions. Saw man with his face eaten up with syphilis and also a syphilitic boy. \n\nReturning we saw three nurses on donkeys with their escorts. Spoke to them. One had a cannonball from fort. Tasted turkey lolly in a shop. Sardines in barrels packed in alternate layers of salt and salted olives also seen. Reached Kondia again in dark and home pretty tired. We are said to go on Thursday now and camp at Tel el Kebir. Have invitation to a dance at 2nd GH tomorrow night. Bed tired 12.30.\n","23":"\n\nPiercingly cold. On morning parade wind cut right through one’s clothes. Did some skirmishing & manouevering over skylines &c. Returning from our walk yesterday we met some men well oiled. We won’t be sorry to reach warm Egypt again. The women wear a white kerchief for head dress and when in villages wear shoes which they carry in their hands later on when on the road. The dwellings of the plough men and lower class are rude to the extreme and the same roof shelters horses pigs & poultry as well. The men are now wearing sheepskin coats. Their wooden ploughs have an iron tipped share. \n\nSuch fishing craft as are about are lateen sailed. Some queer vessels skirt the coast of Africa both north & south of the Canal but the wickedest are these piratical looking rakish rigs. The very look of them is redolent of rascality, smuggling and all other nautical vices. The disreputable appearance of the craft is usually matched by that of their crew, swarthy dark skinned sharp eyed rascals that would as lief crack a head as a nut of any other kind. You might call these craft the larrikins of the high seas. Rather than frequent large harbours, they favour the bypaths secluded coves &c. \n\nIn the afternoon we practised artillery formations & we coached up our guard which mounts tomorrow. Brigadier says all or part of us are certain to sail tomorrow so made preliminary preparations. Present indications point to a sojourn on the Canal. Dr Craig & McKay went to a dance at 2nd AGH but I had to remain here in case of orders. The big four funneled hospital ship left this afternoon. Sea rough & white caps dancing in the sun. Bed and slept soundly.\n","24":"\n\nAwakened by some several reveilles and noticed that of the 21st. & 13 LH who had received their orders. Slept on till 0730 & was then called to Bde HQ receiving orders to march on to camp at 1130. Set to work and left camp as clean as a bone at 1030 and spent rest of the time in readiness to move. \n\nSet off for Sardi pier but no guide was provided and in consequence we took a muddy road at times almost impassable which, with heavy packs, made the march a slow one. Some of the men still stick to their Xmas billies and attach iron rations, Turks water bottles, thigh boots and other treasured things they have picked up, to every strap and buckle. We passed one Tommy wearing his overcoat. Just out of trenches, he was carrying a Turkish rifle the usual heavy pack and a huge bundle of \"personal property\" dangling by a couple of straps from his rear. This aspect tickled our chaps very much.\n\nMy batman Mitchell very unwell with inflammation of the spermatic cord. Davies & Watkins with a pole went a head carrying our kits and we picked them all up on the ship. Sardi is a small place and the people undesirable. The soldiers soon teach the shysters their lingo and one hears some choice oaths from fruit vendors &c. Passed detachments of the RN Division coming into camp said to be new men. The evacuation of Helles is said to be proceeding and tonight alleged to be the last night. They will be lucky if they get out as easily as we did.\n\n4\/1\/16\n\nReaching Sardi pier we sat down there and lunched. Gang of Egyptians were stamping upon metal with wooden stampers. Formed in two rows and led by a tall fellow who chanted a snatch of a chanty they all lowered their stampers as they replied in chorus. I noticed their chorus was always the same, the leader varied his words though and accompanied it with gesture. A lazy loafing crowd, they kept quarrelling among themselves and the overseers had frequently to sail in with blows.\n\nAt 1400 we went aboard the Waterwitch and went across harbour passing a submarine en route. Came alongside the Blue funnel 10000 tonner Ascanius and got all the boys aboard. Duggan Ships Adjutant. With Major Smith in a fine cabin. Destination Egypt probably via Canal disembarking at Ismailia. Dinner very elaborate after Ulysses style and the first off a table with a cloth on for some time. \n\nCrozier has drawn a good picture called the Furphey depicting two trench soldiers meeting in Shrapnel Valley and exchanging supplies. The men are fairly comfortable in the troop decks and at present are indulging in singing with piano accompaniment. We have here BdeHQ 19, 20, 21 & 22 Bns & 6 Field Am here - we are anchored in Mudros Bay and sail tomorrow morning. Had a hot bath & once more experienced the delight of sleeping on a spring mattress & between sweet white sheets.\n","25":"\n\nBathed at 0630. Round Troop decks where all were rather mixed and a lot of people like lost sheep not knowing where to go. Fell in on well deck aft at 0700 and checked lifebelts. After breakfast all fell in with rifles and lifebelts at boat stations. Carried on cleaning rifles inspecting & so on. Went round with O.C. Troops on inspection of troop decks. All troops cleared out from below between the hours of 9 to 11, 2 to 4, only mess orderlies and troop deck sergts being below then. The gear all supposed to be stacked in the racks overhead but owing to lack of accommodation was in heaps in some places. The men all told off into messes and all sit at their tables for meals using their own mess traps swabbing and scrubbing all done before 1100. \n\nAft on the troop deck is a 4.7 gun with gunner we told off a crew of 6 to assist. Lt Col Mackenzie wanted to know why the gun was trained to starboard! Machine guns also mounted at different posts and men on the gun continually. Two sentries with fixed bayonets and two men for lowering purposes are on duty constantly at each boat and everyone carries lifebelts all the time. The ship do the cooking at galleys fore and aft.\n\nA fair sea on this morning and some men sick. Mitchell is in the hospital and not to well. Last night someone ran into us and knocked the boat on the port davits of poop deck to pieces. Latest furphey is we disembark at Alexandria not Ismailia. Passing small islands all bare and green. Col Gwynne & Major Bruggy are on board. Fell into boat stations during afternoon. Wrote & read before tea and turned in at 1000. Boat rolling & was a bit sick.\n","26":"\n\nA fine day with a sun that is growing more powerful as we go further south. We expect to make Alexandria at 1000 tomorrow. The sea is still choppy and a few are sick. Inspection of ship at 1100 was a long business and a long retinue followed in the wake of the O.C. Troops. McCaul, Davis, Pedler & Elmiger are all laid up and under the doctor. Time is flying so rapidly that our stay in the trenches will seem like a dream. Then we get back to the desert (N.B. Our local trench names Imshi funkhole, Backsheese alley, Zigzag alley, Allah Road, Reilly St. Drain, Yarra Road, Curnow St. Nazir). \n\nAfternoon fell in and cleaned the ammunition pouches. The iron ration issued at Mudros is our landing ration, any who broke into it will be sorry. It should never be broached without an officers orders and is contained in a canvas coin bag. Consists of 1 tin bully beef and about half the bag of small white biscuits about one inch square & also a soldered tin containing a packet of tea and another of sugar and some cubes of meat extract. \n\nSome good seas running and the roll is most unpleasant. About tea time we run into a thunder storm. The air is quickly becoming very close & we are shedding warm clothing rapidly. All the ports and windows are fitted with dead lights and we are going along with all lights doused. Packed kit ready for disembarkation and turned in. Slept like a top. Ventilation bad all ports closed for lights.\n","27":"\n\nUp at 0700 land in sight and gradually became more distinct. The coast of Egypt is low and this part shows up a few trees fringing the horizon, some lighthouses or towers and a forest of masts stretching right along the seafront, for Alexandria is that which has length without breadth and lies like a lead pencil along the coast.\n\nThe pilot came aboard at 0830 and we are well in among traffic now, steamers tugs and odd sailing craft. The water is a light pinky blue different to the usual indigo seas of the Meditteranean, owing probably to the shallow waters. The channel is a tortuous one winding about in a most eccentric fashion. Numerous buoys are out and beacons erected on shore. The beach is surf swept by heavy white rollers. A good many factory chimneys catch the eye in the city. We will probably entrain after disembarking, - the Egyptian State Railways are very business like and alert and put special trains on in no time. \n\nIf we have any chance in Alexandria I intend to see the catacombs which I missed last time. The men are very merry singing all sorts of love songs which show they are entertaining amorous imaginings and bodes a hot time for the beauties of the Wazir if they get close enough. However I think the scheme is to run right out to this camp remote from the city to avoid Cairo being painted red. \n\nThe breakwater is of a kind of light stone and a boom has been put right across the entrance since we were here last. The harbour was\n\n7\/1\/16\n\nwhite with seagulls. One very imposing light stone building I noticed fronting the water, probably the Customs House. The hospital ship \"Assaye\" being tugged near us. Issued orders no men are to buy from the bum boat men who come alongside. \n\nThe water police are natives and wear blue jackets togs and a fez. A paper seller came alongside and there was a very exciting gesticulatory and vocal encounter between them but the paperman got aboard by stratagem much to the joy of the soldiers. A Lieut. of the native army came on wearing his fez and a pea jacket, his extremely thin legs encased in leggings. A naval native also came aboard clothed in purple and fine linen. These elaborately uniformed officials are a most amusing sideshow. \n\nOn shore there are bands of niggers who wander round the wharves and with nets like those for crayfishing dredge out from the eddies and corners enough food and other odds and ends to keep body & soul together. Many of the ships around have their names written in Turkish as well as English. The palms ashore give the whole place that characteristic Eastern look and glimpses of sand recall desert camps and marches. Fruit vendors a nuisance so put a revolver bullet through one boat which had the effect of scaring some off. \n\nDoctor says Pedler will have to go to hospital today and Davis also. It is hoped our advance party has got all ready for us.\n\n7\/1\/16\n\nThe water is covered with seagulls sitting on the waves as a hen sits on a nest. About 1100 an M.L.O came aboard and from his appearance (he looked a queer bird) was at once christened by all hands \"the stork\".\n\nWe entrain at 2030 tonight for Tel-el-Kebir a long journey that will take about 6 hours, but owing to the heavy canal dues it is better to go by train than to ship to Ismailia. After lunch we went alongside the quay on which were the usual gangs of filthy coolies. We passed a Greek ship with her name and national flag painted large upon her sides. Neutrals take no risks. Launches and tugs dashing round and even a real railway train is on view and some gharries plying for hire. The boat is taking a long time to tie up alongside and the bumboats with their wares are alround. Viewed from here Alexandria is a vista of blank walls and backyards, the quarter round the docks is the squalid portion of the city. The minarets of mosques can be picked up. In the centre of the city is that busy square where the Bourse and other fine modern buildings are.\n\nAt 1600 I went into the city and donned a Sam Browne belt and passing down the gangway the lads gave ahoy! Took a gharri at the entrance and noticed that nowadays they have British soldiers on guard in addition to the native constabulary. Rattled out over the cobblestones and swung into the street leading to the Square. Passed through a new departure since our last visit here to wit a miniature Wazir, the women (European) exhibiting their charms freely and pulling soldiers about. Some blue jackets drunk. Into the business streets and passed a group of vieled chattering women several enciente. Light rain\n\n7\/1\/16\n\nwas falling and still continues and the air is quite cold – so different to our previous recollections of this place. \n\nDismissed the gharry at the Square and walked down past the old gardened house towards the Bourse. The trees were full of birds all chattering and noisy. The street urchins playing about and the little girls though wearing the viel took no pains to avoid the scrutiny of an unbeliever. Passing along noticed several of that unfortunate class of men who wear the towel headgear. To protect their tarboushes from the rain some of the better dressed were wearing handkerchiefs over them. \n\nWent along to Rue Ramleh to Records office and inquired there after Jack, beyond telling me that he was admitted to 1st. Canadian Hospital Mudros they could say no more except that he went there on 27\/10\/15 with diphtheria. Thence to Eastern Extension Telegraph Coy and sent off some cables for the other fellows. Went into several newsagents but could get no English papers except one nearly 3 weeks old. The trams very busy up and down with their French advertisements on them. The cafes brisk and many a game of backgammon absorbing attention. The gesticulation and yabber of these people are most amusing to the onlooker.\n\nMet an \"A\" Coy man in the street whose\n","28":"\n\nname I cannot remember & he said Curnow was nearly well and others. \n\nReturned per gharry to the ship and had tea. The 19th. Battalion were entraining and in fairly heavy rain the 21st. disembarked at 1900. We commenced to leave the ship at 2045 and got 500 men off by single gang way only taking one man at a time \nby\n within 40 minutes. Each third class carriage here holds 48 men so we told them off into 48’s. Getting into the carriages takes time with only two doors and cumbrous packs. About 10 men \"imshied\" and will be dealt with later. Some well tanked having been down in the crews quarters and had to be carried on to the train. \n\nAll got aboard at 2145 and after a last look at the Ascanius we steamed off at 2215 for Tel-el-Kebir. A chilly night Alexandria is full of soldiers mostly British, such Australians as are there look smart having new tunics, hats &c. The railway carriages are good and lighted by electricity, over each seat are globes for reading purposes and photographs of the country are let in above the seats. The driver is a coal black negro and the fireman a nigger to but seem to know their job. There is not much wrong with the Egyptian state railways. Curled up on half a seat and went to sleep.\n","29":"\n\nIt is 0400 and we are still on the go. Occasionally we stop at a station & native vendors run up and down calling out Orinkis (oranges) or Xecook! (eggs to cook)! The men buying and much shouting of Yallahoos &c. Most of the stations are well lit by electricity. The smell of Egypt is everywhere – a smell of wet straw with a bouquet of pigsty. \n\nReached Tel-el-Kebir in rain and darkness and received the cheering intimation no tents were on the spot and the men would have to sit down on the ground in the open until dawn. Fortunately it was not far from station to camp and as we swung along the usual slinging off was indulged in just to cheer us up. From round comfortable fires fellows would call out \"No tents, boys!\" \"How do you like your eggs\". The latter remark provoked the instant retort \"As hard as your – dial\". When we turned the men loose their first question was \"who is in these tents (the few that were erected). On hearing they were reinforcements they immediately passed the word to \"stand to\" and slung all the reinforcements out on their ears! remarking that they were not going to stay out in wet & darkness & let cold footers have comfortable tents. Our veterans now consider themselves entitled to all the good things. Daylight came and found most of them lying out in the open with a waterproof sheet over their heads and the rest of the body getting wet.\n\n14\/1\/16\n\nPut on parties sorting the mail and received a big batch myself. The Regtl Office full of bags and parcels &c. the reinforcements 260 in number were taken over this afternoon and drafted to their companies. Most of them are smart looking chaps and alert and will be an acquisition. Messing in the QM’s tent with the Major & Padre. This place is close to a fresh water canal and the masts of the vessels look as if growing out of the ground. Plenty of palms and other vegetation round, and cool (almost cold) weather made conditions very pleasant.\n\nOur mule drivers are back here once more having been up as far as Salonika. Rumoured H.J. Smith is coming back as B.M. tomorrow we lay out the Camp again. Big orderly room, two men uncoupled the train they were travelling in and were sent for Courtmartial. Simonson among the reinforcements and will very likely transfer to 14th. Battn. General Monash being his Brigadier and his uncle. \n\nHeld a mess meeting in the evening and decided to get as homelike as possible. Jakey sent some very good photos. The old trenches of Tel el Kebir are not far from here and relics can be dug up there. Turned in on floor at 2000 and read for a while. It gets very cold towards morning and the climate with heavy dews in unfavourable for sleeping out.\n\n9\/1\/16\n\nUp at 0720 bright sun shining but cold morning. Messing with Q.M. at 0900 fell in for church parade caps sidearms & got a good square fixed up with padre in centre. Will order \ncaps\n hats in future the sun getting too hot on the necks. Struck all tents at 0900 and shifted on to new ground. Roth pegged the camp out. Had a yarn with young Simonson. Very busy in the office at work on correspondence and returns &c. Saw a transport wagon full of natives go along all chanting to a chorus filthy brutes like a wagon load of monkeys. Arranged guard & other duties for tomorrow. The desert here has set hard with the rain and there is very little soakage in the pits. It seems quite different from Heliopolis. Our transport and mule drivers rejoined after some going to Salonika. This will be a big camp when all the tents are pitched in it.\n","30":"\n\nRose 0630 and at first parade marched the whole battalion out into the desert and sat them down there checking their kits. Parcel arrived from Jakey also some papers and other things. Afternoon at drill delightful day a little warm but nothing to growl about. Fairly busy in office in fact am just about full up of the job and would relish a change for a while. In a day or two will take to horse again and ride. Still without tents and no leave is being granted as yet. Brigade slow Divn slower. Goucher left today. HJ back.\n","31":"\n\nUp at 0630 lovely morning a fog lying over the cultivated land the desert set hard with the heavy dew. The battalion paraded on physical drill at 0700 and I started with the NCOs class again. Next parade 0930 marched in mass with fixed bayonets – good work. Then out to site of old trenches. Drilling on a battlefield. The trenches well sited and commanding but the ground very full of folds in some of which a whole battalion could muster. In fact although within a few hundred yards of each other the companies were at times quite isolated.\n\nTook horse out in afternoon, a black hack, and she went well. A very sharp white thorny bush grows which the horse seems to like but as one gentleman remarked it would give his the quivers. Acquired a vestpocket Kodak later in the day. Too busy in office altogether.\n","32":"\n\nArtillery formation with NCO’s first thing stayed off second parade preparing Courtmartial papers &c. Half holiday in afternoon, read up back papers and letters and went for short gallop but Tommy Robert’s horse got away with. Letter from Jack and also a number of Australian letters too. Requisitioned for pay and arranged other routine. Still some tents short but Pedler is sending along mess stuff. In the evening attended at Bde and we are to proceed to the Canal to take up a defensive position there. Since coming here I have become desperately lousy again and am itchy from head to foot. My horse is lousy too. The itch is intolerable at times. Imshied sick man off to hospital, didn’t mind him in orderly room but objected to vomit &c. Imshi eggere!\n","33":"\n\nAh lis! Yalla Yallah! – Chanty \n\nOr -- --\n\nFor Chorus Ah lis\n\nBringing stampers down on early parade the sky presented a most extraordinary striped appearance with sweeps of ominous clouds right across. Did artillery formation and then an attack with the non.coms. Pedler returned with LeCaire I go tomorrow morning taking Spendlove with me Mitchell being still in hospital. Unless my box arrives this morning I shall have to borrow decent clothes to wear up there. \n\nStayed in at office all day. During the morning a troop train passed through with much cheering probably new Australians arriving from Suez. More mail coming to hand gradually received a fair number today. Before dusk took a walk down to station passed all the different battalions in order and saw the 6th Field Artillery disentraining. Just past Brigade a cinema show is being erected by natives. The 8 ½ is in the hands of a contractor allowing a rebate of 2\/- a man per month in conson. of getting the business. Lappas allowed 4\/- per man rebate – an instance of the business morality here. \n\nIn preparation for Cairo trip gathered up sufficient clothes to turn out smartly. Breeches & puttees from Bird also shirt & tunic from Sparrow. My own clothes are awful. Sgt De Boos in this afternoon. Turned in about 2200 & read till late.\n","34":"\n\nMorning cold very raw out in the desert with the class. Attack and reinforcing the work. Dressed up in borrowed clothes and left camp about 1000 with Jackie McCaul and my man Spendlove. All the way from camp to station returning sentries compliments. Great bustle of transport all along the railway. The native vendors of fruit carry it all round their body inside the clothing. Reached Tel el Kebir station crowded with niggers and soldiers. Bootblacks very busy. \"Boots er clean \"Junkis\" \"Eggsercook\". One a cripple with either no legs or very deformed who swung along on his hands.\n\nBoarded train at 1100 with Brund and some others and an English colonel told me that at Suvla during the blizzard he lost 5000 of his men with frostbite. A column by Dicky in the Times of 31\/12 on Australian marching songs & also details of our evacuation. The stationmaster of the station elaborate gold braided person. \n\nPassing through the usual delightful green irrigation just like a market garden with its groups of workers & odd camels & donkies. Only for the palms the landscape might be an Australian one. The Port Said express has just rattled past. Bedouin tents quaint looking things. Stated that labour is scarce for railways on the fields the peasant earns 4pt a day on railways 12pt and yet there is this dearth. They have to put a levy on the shieks of the villages, scarcely said to be due to religion, perhaps dislike of work though. Approaching Cairo the outlines of the Pyramids became visible. A regiment of LH passing along the road, new requisition.\n\n14\/1\/16\n\nThe train came into big station which reminded me of Princes Bridge but Lord, how much more magnificent. Glass roof Moorish architecture, an ornamental clock and a general fine look. A buffet and shops. Noticed the dead end was furnished with big hydraulic buffers. A hospital train was in white carriages painted with a crescent and a star upon them. The ordinary carriages are differentiated in their classes by Roman numerals I, II, III,. \n\nOutside the station hailed a gharry, observing drinking water divided into two classes British & Indian. Now that living picture which is Cairo began to unfold itself before our eyes a carnival of colour, the bread sellers with their rings of bread on their arms the sweetmeat sellers, vendors of canes sellers of cloth &c, and with all that quaint smell which is peculiar to Cairo a perfume that speaks of romance and filthy, ecstatic pleasure dreadful pain & disease. The natives have nearly all a small tatoo mark or two above the temple and the faces of many are cicatriced with slashes lengthwise and across usually on one cheek only. Some men wearing an ear ring through the top of the ear. Sugarcane abundant everyone biting strips off and sucking them \"Boots a clean Post a cart\".\n\n14\/1\/16\n\nReached Shepheards hotel and was hailed by Colonel who let loose a long rigmarole about finance. Saw Manager but room was crowded and it looked as if we should have to go away, as luck would have it Dr Fogarty of the 21st cooperated and we took a double room. \n\nLunched in the grill room. Fine gardens full of trees some gums among them. The house servants in red clothes resplendent with gold braid. In the centre of the street was a Turkish looking man in fez attending upon a motorcar heavy with gold and blue and wearing a shining sword. Went round different shops and could not help noticing how the women do up their eyes with belladonna. Above the viel are these deep black eyes and plenty of powder. The European women of course also there buying clothes &c. \n\nComing back to these old scenes again I feel quite like an old inhabitant. About 1900 I got in a train to go to Heliopolis but current failed so bought a motorcar for 40 piastres. Arrived at Gordon House found nothing doing and returned by train. The place crowded with soldiers all in new equipment – reinforcements - and things there seemed much the same. Reached Shepheards again and about 2030 tried to get some dinner but had to wait\n\n14\/1\/16\n\ntill 2100 before getting some. Plenty of generals and other big birds lingering over their wine and cigars among the plashing fountains. Met Jackie and went to Abbaye des Roses. A few girls there and a few soldiers and tarboushes. Show very flat aged tart about 40 singing. Dead as a door nail. One good singer singing French song and a dancer in a voluptuous rag-tango twirl. Cherie Vert there looking well but did not recognise us, a callow one star youth at her feet and a bevy of tarboush dancing attendance. Called for cafe and was charged 15 p.t. pour deux. Latrine in old Continental style stinking and one quite likely meets one of the ladies returning as you enter. \n\nNo sign of the Dreadnought. Took a gharry and drove up to the ExContinental through dark sleepy streets for it was now 2300 with their silent gliding robed wayfarers busily bound from nowhere to the same place. Pulled up at the door where other gharries were and the usual crowd going in and out. Up the old stairs to Pension Beuvoisie and received there with open arms, the old hands all embracing and kisses. Ma foi! The perfume and dainty deshabille pyjama &c! – Marcelle tres bien and Robert too. Georgette still there but a wreck of her former self poor girl and coarse. Two rounds drinks @ 20pt a time. They admit \"Cairo no good, casino finish, too many soldier, officers only come here get drunk finish\". Resisted all endearments but\n\n14\/1\/16\n\nJackie played some opera tunes to which Marcelle & \"Nobs\" danced. Discovered the secret of a good deal of their wonderful vitality, when unearthed in rummaging a supply of cocaine. Swallowed not used hypodermically as the wrist and arms showed very few punctures and those admittedly morphine. Were greatly distressed at our finding out which I did only by observing them meet and go in for the dope. When in there later looked for that specialty. Poor little devils what an end for them.\n\nLeft about 0000 and Jackie remarked how bored they made us and on our only having drinks. He said truly \"The trenches have made us take a far more serious view of life\". Only new youths sowing their wild oats now affect these places. For all the old hands truly \"Cairo finish!’. Back to Shepheards and to bed. \n\nThe gesticulation & vociferation of this race is remarkable. Row on in the street over some canes. Shrieks & curses but never a blow!. Query over the fourposter was attached a pair of antelope’s horns – a relic of phallic worship? Noticed that many natives are wearing handkerchief round the fez like those at Kastro. Calling each other \"Hamid Hami\". Arabic \"Stana stop, menak right, shemalik left. Gharry drivers Ouah menak. The bread & cake vendors carry a basket slung from their shoulders like quoit pegs on which are ringed their rounds of bread. Evenings very cold and most of their frequenters sat inside the cafe instead of out & there played their backgammon. The fez must be better class native faultlessly clad perhaps in evening dress looks well in his fez. Despite their religion they can still indulge in dalliance with the daughters of the unbelievers I saw in the Abbaye de Rose.\n","35":"\n\nHot bath in marble bath room and then to breakfast. After took gharry to Bank and Pay office and drew pay &c. met Reynolds there. In the Bank very busy and plenty of Imperial officers about noticed that the clerks are not free from the prevailing eye trouble and that they have coffee brought round to them. The messengers in flowing robes but the porter magnificent in purple & gold.\n\nWent also to the National Bank of Egypt solid & steady judging by looks. Before lunch McCaul brought Curnow up to my room, almost recovered from his septic sores. He dined with us amid the usual congregation of generals. After lunch we took a gharry and went down to Davis Bryans but finding them closer continued on to Senouide’s where we got the purple & red flags. Some glad eye from behind the soap and scent counter or I am much mistaken. Chattering Moslem women making small purchases. \n\nThence to a shop after a tin box and after that to the Mousky. Busy as ever and thronged with its multi-coloured crowd. From an incense seller intended to get a supply but did not. Got some more films and then on to Hatoun. A wonderful shop the entrance to which is obscure. In the doorway sat a weaver making carpets and thousands of carpets were stacked in this and ajoining rooms. In the courtyard are a\n\n15\/1\/16\n\nnumber of old images and statues and plenty of that harem lattice work that is now becoming so scarce owing to the present generations laziness. \n\nIn the shop the most wonderful collection of goods in brass and copper gold silver ivory and ebony. Lamps (pendent) hundreds of years old of dull brass, vases, incense burners, bowls and a thousand other articles of brass ware. Cabinets inlaid with mother of pearl. McCaul bought one of ebony and ivory for 5 pounds and Curnow one of ivory and inclose wood for the same. Plenty of little prayer desks. I bought a small Koran stand inlaid with mother of pearl. Some tables inlaid worth hundreds of pounds and against one wall a throne and dais in light wood with a design in creepers worked in mother of pearl. Some carved ivory and beaten metal work from India, old muskets steel & chain armour and Saracens head pieces. Porcelain ware in great variety. \n\nWent into work shop where turner was working a rough lathe with a bow the string which was reefed round the curve of the article in manufacture thus getting it to revolve. Crouching over his work he held the chisel between his two big toes using his feet like hands and as deftly. He gave me a small piece of ivory he had turned not a quarter of an inch in length & yet exquisitely moulded. Behind him sat a child not 7 mechanically \n\n15\/1\/16\n\nwhittling down wood. Another turner working alongside. A sawing machine tracing out intricate designs and a man engaged in inlay work fitting each tiny bit into its place after much filing and scraping. Others lacquering and polishing and an artist drawing designs.\n\nThen along the street to the brass bazaar passing the tailors with their eyes glued to their task. How dreadfully prevalent eye trouble is nearly every second one is affected. One military tailor busy with gold braid and with a stock of court swords. In the brass shop bought an incense burner and there watched the brass workers. Whole families engaged in the work their hammers tap tapping on the little chisels quite automatically the children working over the designs already traced out by the craftsmen the articles set in cobblers wax to prevent their bending. \n\nReturned along the same street gay with signs & traders plenty of notices of sage femme & medecins treaters of skin diseases. Came back past the lawyers booths and past Steins stores said to be run by a German firm. Through the Ezbekieh gardens looking delightful to the street again. In front of the Shepheards shops met Tulloch Forman & Hennessey. In Mousky trader wanted to sell me erotic cigarettes for marriage use.\n\n15\/1\/16\n\nTo Saults for tea with Curnow and then took train for Heliopolis riding on step. Met J. and took her for gharry ride to Mattaric giving her a squeeze. Walked to obelisk and meditated for a few moments on its antiquity. The carvings so plain & the obelisk delightfully situated. Took a turn up and down the winding paths between the growing crops. \n\nReturned to Heliopolis hotel and had supper met J. who seemed to me too smart to be good. Arranged to meet J. tomorrow afternoon. Returned by train with Nicholas whose wound is pretty well all quiet in the town and the occasional stink and perfume of the streets gives that so Oriental touch. The trenches have so changed us that we are quite sobered indeed almost wowsers and these things no longer stir our pulses as of yore. The niggers seem to sleep out these cold nights noticed 12 in a row under a verandah huddled up together sitting heads on knees fast asleep. \n\nShepheards very gay a dance being on. Bare shoulders fine dresses and soft eyes looking into soft eyes. Shepheards is not the place it was five months ago nor is Cairo the same vicious city. Rumoured that no men are allowed in Wazir now and picquet is hell of a size. Tired slept like a top between white sheets, the doctor with a cargo of drinks followed.\n","36":"\n\nShepheards is in Charia Kamel. After breakfast sat on the terrace gharries & motors passing and a constant stream of officers in and out. Some sign boards:- Pohoomul Bros Oriental Jewellers Hotel de Paris, Grand Fabrique de Cigarettes Egyptiennes Dr N Chazar Dentiste Professeur de Ecoles Dentaires Dr A Garatendean. Prithas Rupehand Curio merchant. Round street to Pharmacie & changed clinical thermometer noticed in the sun clusters of natives sitting with head bowed to knees or with head back eyes up to sun and full of clustering masses of flies. Poor children stunted and weak with rheumy eyes and syphilitic sores.\n\nLunched and at 1400 Curnow called after much chattering we hired a motor car and tore out to Heliopolis and got to Gordon House. Matron told me that Sister Grace Gerrand had been run over by tram and consequently could not come, one of the white trams had knocked her down. Dr Ramsay Webb went up with matron and set her dislocated & fractured shoulder. \n\nWe took Jake to Helouan passing a troop of Egyptian household cavalry escorting a carriage presumably containing the Sultan, and we saw the troops in the Egyptian barracks resplendent in blue uniforms with white facings and white boots & gaiters. Our driver going at top speed & with his Renault and doing dare devil tricks, very fluent in his maledictions at obstacles. \n\n16\/1\/16\n\nThrough the residential quarter and clubs and past old Cairo and the banyan trees. The shops with their miscellaneous wares full of business. The Boulay quays very interesting, unloading sugar cane and a hundred other kinds of merchandise the masts of the native ships constituting quite a forest. Old Father Nile flows placidly on. \n\nThe road to Helouan is a banked up one winding as an avenue between irrigated fields innocent of fences. Quaint how the people let their domestic animals pasture in the crops. Reaching the town we met several animated groups, not to say crowds, of natives en fete today being the natal day of the Prophet. Helouan a quiet place gay with bouganvilleas the sulphur baths at the outskirts of the town. Circled round and then turned homewards. \n\nMet another crowd with banners inscribed with Koran texts the people beating tom toms and chanting the children wearing sashes of embroidered cloth with gold figures worked thereon. Many carrying wooden swords at the ‘carry’ & all very jubilant, one full of drugs and face smothered with white powder. Under a pall they had some tinsel images somewhat like the Buddhas I saw on the arabias in Ceylon. There was also a ‘pantomime’ camel two boys under a cloth from which protruded a camels head of wood. All in a state of religious ecstasy worked up by their music.\n\n16\/1\/16\n\nFrom here could see the Pryamids of Giza and those of Sakkara too. Returned and pulled up at Groppis there one seizes a plate and fork and walks round the shop taking as many cakes as one wants. Pay at desk and then into teagarden to eat them. Plenty officers met Kingie and Billy. Took the latter home in the car. Found on arrival there Gerrand had gone to hospital at Palace. \n\nBack to Shepheards, Fogarty & Co in possession of 391. Sundry drinks and then to dinner. Moet et Chandon all more or less ‘so so’. Liquers after. Shepheards not half the place it previously was, the dinner very inferior. Notice posted up in vestibule that all officers have to rejoin their units before 2200 tomorrow. Something doing?\n\nA true specimen of Eastern sensuality to be seen here. In the bar is a fat tarbousch with pendulous jowl, lack lustre eyes and a growth on his neck, eating all the time. Plenty of money & ministering solely to himself, disopbeying the law of Prophet prohibiting liquor. At dinner he gorges and gorges ravenously, sinking into a kind of lethargy or sleep of repletion in between the courses. Awakened by the waiters he sets to again tickling his palate until at the conclusion of the meal he can just lean back in his chair like some satiate beast. Between meals his huge stomach breasts the bar and he stands or sits like some filthy beast. His nights probably are likewise devoted to himself.\n","37":"\n\nTea in bed and then to breakfast. We retired late a little thick in the speech. Found Naylor in bed when we woke up today. Padre Bennett & Bladen at breakfast and later met Skenesmith. With Curnow went down to Pay office, Cairo round there is a well built city with imposing buildings. Then to the Egyptian Army Sports Citadel. The approach very fine the gardens on either side of the road before reaching the two mosques well kept and trim. The mosque Sultan Hassan bears on its front the shot holes of a French bombardment the cannonballs still remaining in some holes. \n\nCould not get what we wanted from the stores but determined not to leave without once more viewing the city from the ramparts. Passed through the Indian hospital, fine fellows Gurkhas and Sikhs most punctilious in saluting. A glorious view the Pyramids of Gizeh & Sakkara, the river, below the city stretching in all directions. One large square mosque arrests attention on an enormous place in the middle of a busy part. On the ramparts are the guns captured at Tel el Kebir. \n\nThen to Mousky our driver taking us through narrow pleasant streets full of busy people and their arabias and donkeys &c and coming out in the Mousky street saw an Arab funeral the coffin covered with a pall and the hired mourners going on in front chanting their dirge. Did some shopping up near Steins and then to station for railway warrant. Curnow says he asked a man who had been in the Abbassia detention barracks what he thought of the place. The man replied it is a place where they tame – lions. Curnow dined with me at Shepheards, a very medium kind of meal the hotel has shed a lot of its glories. Executed all commissions and am ready now to get back to camp.\n\n \n\n17\/1\/16\n\nAfter lunch heard a noise of band playing and so on and a queer procession passed. A native band playing in all discords a thing something like or supposed to be Australia will be there. Followed a gharry with an Australian soldier and some women in it then more natives and then another gharry full of fat native women. I believe it was a marriage, some fool marrying a native. Some have also married French girls, as a rule flossies, who never miss pay day and scooping the soldiers allotment.\n\nSettled bill for Dr & self amounting to 1258 piastres of which my share was 500. tips no small item – even bath was put on bill. Caught train at 1800, dining car and table d’hote very up to date. Reached camp at 2130. new tent up & so to bed.\n","38":"\n\nStayed in off morning parade but at 1100 went field firing with battalion in desert. Passed over pontoon bridge through fields covered with a white deposit like salt brought out by the irrigation. Shooting fair, machine guns firing on our right sending spurts of sand up. Coming back Conways horse lay down and started to roll much to mens amusement. Every time they halted would be cries of \"bis!\" – the order of a camel to kneel. In evening unpacked leather box and went through my belongings.\n","39":"\n\nA quiet day with a half holiday in the afternoon. Rumoured we leave on Sunday, clothes commencing to arrive now for refitting men. Officers mess in full swing. A good many men A.W.L. and I don’t blame them altogether seeing they have earned a rest. \n","40":"\n\nOut in the desert and doing attack assault and retelling off. 100 A.W.L. today! Busy in office all day. Peart still away on leave. This inactivity in Camp no good. 8 ½d allowance ceases today – the system of rebates immoral but a product of the way of doing business here. 4\/- per man per month at Heliopolis, 2\/- here.\n","41":"\n\nReveille 0530 and at 0700 left for the rifle range. Pontoon bridge rigged up by Engineers swayed a good deal from side to side. Did some good shooting out in the desert. Machine guns hard at it spurting up the dirt. Irrigation brings out white deposit on ground like salt. Cotton in one plot in ear. Plenty of bird life among crops snipe quail and king fishers.\n\nReturned for lunch, had to hurry across bridge as some sailed vessels came bearing down canal. Sand makes rapid fire a problem as the bolts sweat with oil and collect the sand. \"Tucker\" Vienna applied for leave for a \"beer up\". A good worker but too fond of beer to be reliable. Emanuel is his Christian name and he was run over by a gharry at Heliopolis while drunk but later joined us in trenches and did good work. Before mess received definite order we leave for the Canal on Monday.\n","42":"\n\nA lovely day. Tried NCO’S at early class on artillery formations the centre sections of each platoon getting on an irregular frontage by doubling out. Rumoured Mackay will not be second in command but Groves is in the running. Major Smith in Cairo. In afternoon our m.g. section had contest with 7th Battn. The 7th won by 97 points and I lost P.T. 50 by backing ours. They have a smart section and a smart little officer is wearing the D.C.M - a first here. A few months ago he was Lance Corporal and at Lone Pine kept his gun going under great difficulties. His gun was blown out by shells time and again but by patching up he kept going until he had the party of about 7 other guns in his. One man mounted gun in 30 sec alone. Crew time 40 sec Carragher (wounded) in guard tent with D.T.’s.\n","43":"\n\nChurch parade last parade by Capt Bennett who returns per \"Kanowna\". Men put on style and marched in to band is splendid style. Big orderly room and the acid was put on some, - decent chaps who took leave when none was granted. One must be hard and make no excuses. Delightful the way they carry their cigarettes behind their ears. The lines full of washing some of our Reinforcement officers came down for the day, - theirs is an unhappy lot they are unwanted. \n\nFixing up the 8 ½d ration allowance, put Bazeley on the job and had a little fun with the QM’s Dept. More letters tonight. All the machine gunners in their tents and being Sunday tonight singing hymns in most dolorous tones. Group of sinners passing threw gravel on the tents and yelled out. \"Shut up you bas - !\" Received a bill from St Elmo hospital Malta for one handkerchief cost 3 1\/2d. British red tape. Received orders for embarkation or rather entrainment to Ismailia.\n","44":"\n\nA day of bustle and stir. Struck all tents at 1100 and got them and all the baggage away. Piled arms and stacked accoutrements and cleaned the place up. Bivouacked all the men expected to move off anytime but we left them in a delightful state of uncertainty. The poor soldier is not told much! Lighted fires and all sat round their camp fires singing and yarning. Cold night for sleeping on hard ground but slept in tent myself. Camel corps men left us today some good chaps there. Experience some – 300!\n","45":"\n\nBitterly cold in early morning and ground hard full of pebbles about the size of a marble. One of the old heads remarked to a mate \"Five months ago we’d have been excited to think we were off to the front in an hour or two – now we merely regard it as a bloody nuisance!\". Rain just before dawn added to the discontent of the bivouac. All loaded up to the eyes marched out on to desert field piled arms & then sat down. Detached 4 platoons and cleaned the camp site up. \n\nLeft for station at 0920 and entraining. Open trucks 35 men to each, and the horses in closed trucks. The entrainment quietly and speedily carried out and train ready to leave. Niggers calling out \"B paper Egyptian mail one piast\", \"Orankis big one!\". The country we passed through was verdant vegetation on one side barren desert on the other. Reached Moascur and disentrained – fine railway yards and then marched along side of Sweet Water Canal. Bitter Lake & Suez Canal on our right. Warships on the lakes . Marched through Ismailia a fine place, much bigger than one would judge viewing it from a ship in the Canal, reminded one very much of Colombo. Green avenue of bean trees, motor track, fine houses (French) all ablaze with scarlet and indigo creepers, lovely gardens. Plenty of motor cars & other motor transport. Saw Generals Legge & Godley. \n\nCrossed Canal on a pontoon bridge and reached camp site. Collected our tents, sited the camp and within one hour of marching in were comfortable in tents all laid out correctly and smart. Tea before dark. Right in the desert, there are plenty of camels and trenches and entanglements near the Canal. The 8th. Brigade are here. Our march discipline today was rotten, reinforcements the trouble and want tuning up.\n","46":"\n\nAll out to physical drill at 0730 and then sat at Orderly Room and sentenced a few offenders against discipline to loss of pay &c. The Battn marched into the desert in full marching order, packs &c at 0930 with advanced flank and rear guards and then carried on with range finding and judging distance. A good exercise but owing to scouts failing to keep their direction we described a large semicircle. In the desert with nothing but sand rolling in hills from one side to another and no land marks the maintenance of direction without a compass is almost as difficult as the same task at sea. \n\nA few Bedouin Arabs sitting in the sand some miles out lousing themselves these treacherous dogs have potted off a few men it is rumoured so shall carry revolver always in future. Returning we passed a very large caravan of camel stretching in a long string across the landscape and all laden with material. The camel a peculiar long suffering brute very often minus almost a square foot of skin on his legs and full of sores and other ills into the bargain\n\nMajor Smith went with Brigadier to see our trenches further out and expects to be away all day. Major Newcombe also out there. We may leave anytime and would go tomorrow only the railway engine has broken down and cannot take the tents. Spendlove my batman, thought I had also gone and had provided no dinner. He and Davis in the village getting a skin full of beer. Guard tent on their return. Our M.O Dr Craig away. Asked him what work he was going to give the stretcherbearers. We had the\n\n26\/1\/16\n\n\"F’s this morning and this afternoon. I am going to give them the Gs – Gout, gut aches gonorrhea\"!\n\nFell in at 1400 and went out to outposts. On our right the canal and bitter lakes with several cruisers and other war vessels on the water. Dredges going constantly. The canal like a blue ribbon shining between low waves of desert sand. A luxurious patch of foliage is Ismailia. The desert hereabouts presents another variety different to any we have before seen. The sand is somewhat like that at Heliopolis and a few varieties of stunted herbage occur in places, mostly though it is just plain sand. In places are patches of small limestone flakes, almost like small tiles. One can generally retrace ones steps on a calm day as the footprints remain in the sand. A handy feature this when it is so easy to get lost. Managed to fill all mens waterbottles today by running watercarts to the pontoon bridge pump. \n\nShips whistles and quite a lot of busy noise coming from the canal. This place has hitherto been just plain desert but since this activity has become \"Staging Camp\". Sinai Peninsula \"somewhere East of Suez where East is East and West is West and never the twain shall meet\".\n\nHeavy rain came on while practising outposts & soaked us. Major Smith returned from a look round the trenches 8 miles out. Lying in bed last night we listening to a most amusing argument between two drunks. Cronin & Gascoyne of A Coy – as a rule very quiet chaps. They had a good cargo of beer bought in Ismailia. The argument was centred round \"Captn f – Bean who lived at b—Shepheards for fifteen f—months\" and the argument waxed furious until lights out Cronin pronouncing never times that he was not \" argu f---, ---bator!\" but always reverting to \"Capt f— Bean\". Others merry too and all round the camp in the morning was a thin pink ribbon of Japanese beer bottles. \n\n27\/1\/16\n\nAbout the lines early. We worked the men yesterday so are giving them a half holiday today. \n\nRe the death penalty being enforced for offences in the field. At least two men to my knowledge have been executed; one for sleeping on his post at the Dardanelles. The other (Sgt Robins of the Wiltshire Regt.) refused in Decr. to go out on a patrol and was shot in accordance with the death penalty on the 2nd. January. \n\nOrders reached us to leave here at 0700 tomorrow morning. Trucks to be pulled by horses. Advanced Guards during morning, long strings of camels passing, their drivers mere bundles of rags. \n\nAfter lunch being a holiday went with the C.O. to Ismailia, ferried over the canal with Indian troopers and their horses, the natives hauling the chains to the tune of a chanty. Per Gharry along the shady avenue and round the streets of this most anglicised of the towns of Egypt. Native quarter full of stinks and dirt. All hotels closed and boarded up and most private residences deserted, local Europeans either imshied out or cleared of their own accord to avoid prospects of invasion. The streets all named after different towns Rue de Dublin, Rue de Suez, Rue de Lisbon &c. The likeness of the place to Colombo is remarkable. Very few shops, one stationer &c selling at the most exorbitant prices. Camels used the same as horses here long strings of them blowing bubbles with their tongues.\n\nMove in the morning arranged early meal and tent striking. Contradictory orders are the curse of this military work, messing up the men awfully but somehow we muddle through. Bitterly cold weather with sleety showers.\n\n28\/1\/16\n\nReveille at 0545. Breakfast 0600. All tents struck at 0630 and packed on trucks which were drawn by horses out to Railhead. – a dead end out in the sand. All other heavy baggage taken out similarly. The Battalion marched out fully equipped and left the camp site as bare as a match at 0900, advanced guard furnished by \"B\" Co, the rear guard by the 21st. Battn. This was our first \"dinkum\" march in hostile country with an advanced guard out against a real enemy. They remained but after we reached our destination until the outposts were well in position. \n\nThe men were very heavily laden with all their worldly goods, blankets 150 rounds of ammunition and big packs. We found the going very heavy the desert sand coming almost over the boot tops. At first we tried 50 minute marches but the pace was too killing and eventually we were marching 15 minutes and then halting ten. By the time the halt came many were staggering along with open mouths gasping and several times men staggered out of the ranks and fell sprawling face downwards in the sand right out to it. The calculation in text books that an infantryman can do his 3 miles 720 paces per hour does not hold good on service in the desert. We traversed in all about 9 miles and this took us from 0900 to 1600 – the men on reaching camp just pitching forward dog tired. \n\nDuring one halt while all were getting breath one remarked \"This soldiering is a fair b—\" His mate \"Why, Joe, think what tales you’ll be able to tell your grandchildren of your campaign marches!\" \"No good to me\", was answer I’ll never be able to have any grandchildren after this\".\n\nR.S.M Porter & Peart just about knocked out.\n\n28\/1\/16\n\nThe railway is still being pushed forward into the desert and all our baggage was dumped and then loaded on to camels of which we had 90. All tents arrived as soon as we did and camp was erected before dark all being under canvas. Outposts in front, guards in camp. No bugle calls. Our present pioneer sergeant is a M.Sc. of Melbne University and it seems incongruous to see him disposing of excreta &c, but as a N.C.O he is no good for anything else. \n\nWe are going to be short of water and fuel here like Anzac, everything depends on camel and we are isolated by sand. Our men are good camel drivers already and shout \"bis\" or make the hissing noise and accompany it with the necessary tapping on the neck in order to get the beasts to kneel. The brutes blow their tongues out like bubbles and froth a lot at the mouth. Groaning and grumbling all the time. I rode my horse today well loaded with feed, wirecutters horseshoes picketing gear &c. Outposts alround tonight under Pedler who fell off his horse today & probably broke a rib. \n\nShifting camp tents &c and getting settled right down here again before dark was good work. All settling down here and we shall be fairly comfortable. Every tent lighted up though no candles were issued being old soldiers the men save all candle ends for future use. This is what makes the packs so heavy; for the comfort afterwards they will cheerfully hump a pack that almost crushes them with its weight. Sleep at 2100.\n\n29\/1\/16\n\nAll slept in this morning but the outposts were relieved at 0700. In the morning straightening up tents was carried on with and those companies not in rest did musketry and close order work. The morning was delightfully sunny and the men resting stripped and did a good lousing. \n\nIn the afternoon we marked out the line of trenches for our \"keep\" making them run so as to be always on a reverse slope with a field of fire of 60-100 yards and to avoid enfilade the line was very tortuous and twisting. The first position I’ve had a hand in laying out against an enemy. Very little water and have only had half a cup of tea today, more expected any moment. This place is at present indefinitely named being called \"Canal Zone\". A prominent sand hill between us & the 21st is known as Hog’s Back. It took us the whole afternoon to site the trenches of the keep. \n\nA short thorny bush about 9 ins. high is sprinkled over the sand and under it are sometimes seen white shells. Snails are sometimes seen. The shells may be snail shells but resemble sea shells very much and occasionally a flat sea shell is seen. From high ground in front Ismailia can be seen 9-10 miles off. Transferring my batman Spendlove to HQ tonight. Owing to being so long without a mail there is a great shortage of bumf. Camel train arrived in darkness and their cargo of water was issued out to thirsty men.\n\n30\/1\/16\n\nSunday, all slept in until breakfast and afterwards lay about in the warm sun until dress for parade at 1030. Church parade at 1045. Padre Stewart, officers as well as the men wearing drill order web equipment. Very warm standing in the sun, the parade was a nice compact little square with the 23rd & 24th parties and the 40 of the 6th F Engineers we have attached. \n\nPioneers being reorganised and a special fatigue formed for permanent dirty work. Josiah Thomas of \"D\" Co (son of Australias postmaster General) is one of these men. Cowan our A.M.C Corporal is a champion runner having done his 10 miles in 58 minutes. Joe Slater is the champion 100 yard sprinter of Australia.\n\nA good many small sand lizards running about and also some chameleons. King showed me an insect about 3 inches long whose color is exactly that of the small brushwood about. After lunch as President presided over a gathering of the men and officers and chose a Sports Committee. A boxing tourney to start at once £ 50 in prizes, and a big general sports meeting to be held next Sunday week. Spendlove hammering up boxes and other conveniences for the test – he is alright away from beer. Mitchell ruptured. \n\nSome time after we reached camp here, two stragglers came slowly over the skyline laden with their kits. \"Burke & Wills\" they were dubbed at once. The pack tins the camels carry the water in are called fantassas. No water has arrived today and Q.M has had to go down to the railhead about it. We still have no ammunition here and tomorrow start trench digging.\n","47":"\n\nIt will be hard to think in English money again after being used to piastres. The habit of reckoning the 2 ½ piastre as a penny is a costly one. Messing in the open with two tables and three forms, owing to one of the latter collapsing the meal was finished standing up. \n\nWe are on the Desert of Sinai where the Israelites were and where the Holy Family crossed. Rode out to a dump of Engineers material and brought some of the stuff back with a party of 150 men. The hills loose shifting sand into which the feet sink deep at every step. The horses soon get blown if the pace is more than a walk. Padre Stewart was telling us about a man something like our Fenton Horan – waster in Egypt, a splendid soldier in the trenches. In his dugout in the trenches this chap had a board of trench rules hanging up. One night a shell landed right inside and blew things to pieces. Our friend seized a candle and went up to notice board. \"Nothing in the bloody rules about bloody shells\" he remarked and then turned into the remains of his bed. At Mudros one of our chaps was wandering all over the landscape well blithered. Asked what the Hades he was doing he replied \"I’m looking for the skyline, Sir & can’t find it.\" \n\nOwing to a mistake the officers sat down to tea tonight before the men had theirs, roused up all concerned to prevent a recurrence. Had much pleasure in turning down Graham’s request for a trip back to Australia – the cold footed b--. No word of any mails yet – transport is problem. 23rd &","48":" still at Tel el Kebir. R.S.M Porter in civil life is physical culture teacher and boxing coach of Scotch College. With a deep raspy voice he roars like a bull and runs them in and out of Orderly Room like fun.\n","49":"\n\nDug our trench today around keep, about a mile of it extended to four paces and got to work. No traverses yet merely scooped out the earth 3’ x 3’. Revetment is by rush mats and expanded metal. Also improved fields of fire by chopping out bushes &c. \n\nAfter lunch rode round the outposts with the C.O. and put an extra picquet in. The outpost position commands the country in front and as far on the left as the","50":" and on the right as far as a prominent hill called the Sphinx. An Indian patrol of two right out in the desert ahead and our aeroplanes out every day for purposes of reconnaissance so we ought to get timely warning of any enemy movement. \n\nTomorrow am riding back to Ismailia and may return after dark steering by stars and compass. Cables and other missions pouring in of course. Out in the desert we noticed the footprints of dogs and some have been seen – perhaps jackals. How does this dingo exist? Ants and earth worms also seem to live there too. No birds of any sort. The sand assumes some peculiar shapes. One hill some miles off has seeming embankments all along the top just like trenches while Hogs Back is just an enormous smooth mass of loose sand. The sight of all \"C\" Coy rolling and toboganning down this was very amusing.\n","51":"\n\nIntended to leave for Ismailia at daylight but though wakened early by Spendlove it was after 0700 before I set out. A delightful cool morning and very pleasant riding along. Had to trust entirely to a small compass to find the way. Constant reference to this was necessary or one would be going in a circle. One sandhill resembles another so closely that landmarks cannot be picked up. \n\nSteering due West missed Railhead though the sound of camel drivers voices could be heard in the distance. Came in sight of Roadhead which contains a big native camp – all colours and races. About 100 camels being fed and watered. Soudanese troopers with their legs ornamented by a small puffy ball – big black chaps. A good deal of transport mostly N.Z. on the road carrying supplies. The rattle of the dredges became louder on nearing Staging Camp and pulled up at the Transport where Bird came out. Horse sweating a good deal. \n\nStabled horse and with Bird went into Ismailia taking two orderlies and a Maltese cart. Engineers very busy round canal and singing gangs of natives at work. (Ismn, come here, ou-ah git out of the way, awas. Cam how much, ouah riglah look out ‘mind your feet’). Round the shops and bought some officers mess stuff and then to railway station to send cables. All native clerks busy at telegraph instruments and all of the washed out enervated appearance. Most favour long greatcoats with collars turned down over European clothes.\n\n1\/2\/16\n\nAll wear the national headdress, the fez. To the French Club for lunch and a fine lunch too for P.T 11. all dishes in French style with dusky attendants. Fruit and Benedictine. Plenty of Staff officers and G.H.Q. in to lunch. All officers however members of this club. \n\nReturned to camp about 1500 and spent afternoon packing mess provisions in panniers for the pack horses. Also got on track of the mail and hope to have it by tomorrow for the \"boys\". The Transport a steady lot, old Nicolulla a character on the \"heada the quart\" (Malish: never mind). Capt Talbot Bde vet, in after ten and yarned. (Leban milk, moyn water.). \n\nAeroplanes up today. Golf links in the desert near avenue. Naval officers playing with jack tars as caddies. All the rest of the division marching in tomorrow. Dickens went into the town with Snowy to get into touch with Army Post Office. Prices of goods fairly reasonable in the town, Tried several \"epiceries\" in travels. Searchlights going at night and the warships signalling. The lake here is LakeTimsah, not Bitter Lakes as previously thought. Burns boiled some water and I had a hot bath and then turned in on the floor between a couple of blankets and slept till dawn.\n","52":"\n\nLeft Staging Camp at 0700 and rode out into the desert – the pack horses following. Very pleasant riding along past gaily clad gangs of natives on the road making job. Struck out into the sands & picked up some landmarks to steer by. Not able to go much above a walk with the horse. Chaplain Stewart over for the day and my batman looking after him. Made Spendlove shave me and then settled up accounts. Bread a welcome addition to the menu of the mess.\n\nAfter lunch rode out with Major Smith round our forward line and sited the trenches there. Fine trench usual winding communication trenches, supports, and \"get away\" to the keep in rear. Some pieces of pottery lying in the sand in places and also saw footprints of dogs. Turkish patrols seen today 15 miles out. Our agents report 13000 Turks at Beersheba and others scattered all over desert as outposts. Pte. Handasyde D Co Accountant Melb Herald age 54 enlisted to be with his son, the Sergt. & now finds himself too old to keep up with the young men. Misguided patriotism for him to have come away putting his country to needless expense. A decent old chap. \n","53":"\n\nA lazy day. Strolled round in shorts cool wind but hot sun. \"B\" Coy did 10 mile route march. 6th F Engineers revetting the \"keep\" with hurdles & matting. Major Pidgeon supervising French digging in our forward position, the men can stand their rifles upright in the sand but the practice affects the visibility of the picquets and has to be prohibited. Tried out some NCO’s. \"When I says Fix! You don’t fix but when I says \"Bayonets\" you whips them out and whops them on!\". Recruit with the rifle loaded, \"10 cartridges in the tin box & 1 in the funnel\". Brushed up semaphore work and also tried the mekometer.\n","54":"\n\nAnother very lazy day. Out at early patrol wandering round. After breakfast heard a burst of rifle fire followed by scattered shots about 2 miles South – Sou’West. Outpost reported the same thing. Received word Major Norris 7th Dvn Training Camp is to be LtCol and command here. Practised range taking with the mekometer before lunch. Teeth gritting upon the sand in every dish at mess. A cool southerly wind raising fine drifting sand which penetrates everywhere in a fine layer. Last night the sun went down in a kind of fog of sand in suspense in the air. The tops of the sand hills when you get on top seem to be shifting almost bodily – the sand is never at rest, the particles are always shifting and moving and even on the stillest night if one listens intently a subdued sound like a distant sea can be heard which tells of the ceaseless rolling of this sand ocean. \n\nRound \"A\" Coys forward trenches and the picquet line. The men busy entrenching and the 23rd Batt on the right getting into position. Our No 1 picquet very visible owing to mess tins reflecting the sun over the skyline. From \"Nowhere\" came 7 camels driven by lean ragged Bedouins wearing the burnous a veiled woman driving a flock of goats and kids and some ragged children acting as goatherds. A few live fowls tied on to the camel’s saddles. How do these folk manage to subsist in the desert, where no water is. \n\nOur machine gunners & sigs. returned from school some more leave tomorrow. A mail of parcels came in per camel. Presided in evening over meeting of the general Sports Committee and accepted programme of Sports for Sunday week. Estimated firing heard this morning was five miles away – sound travels on the wind. Quiet camp all go to bed early, in every tent is a little card school playing by candle light. Bird had two men made 1500 piastres at \"Heart & Anchor\". Who’ll have a card\", \"Come on my lucky lad!\"\n","55":"\n\nA brute of a night and day. Wind plucking at tent, sand drifting in everywhere and like a smoke cloud travelling along surface of desert about 2 feet from ground. Clouded over in afternoon and rain started just after the afternoon parade. \"D\" Co route marched and brought back some telegraph poles from a line which was erected by us prior to last attack the idea being for the enemys line of advance to follow the line and thus lead them where we wished. Semaphore at early parade. A Co dug trenches after breakfast. \n\nAfter lunch \"B\" Co did an attack 3 platoons against one entrenched myself as umpire. Advance in three lines extended until under such fire no further advance possible then by rushes sections long at longer angles & platoons short at short ranges. Work fair. Indian mule corps out with British surveying officer. Most of the life insect and otherwise here harmonise almost exactly in colour with the sand or the scattered shrubs. The many shells lying round appear to be mostly those of a form of snail. This route (Ismailia – Hassana) is used by caravans to avoid the camel fly in certain seasons.\n\nGeneral Legge and staff round here this afternoon. Thomas \"C\" Co. up on a charge of begging and insulting a nurse, developed V.D. today. A bright specimen. Rations cut pretty fine nowadays. ¾ pound of biscuit per man per diem is not enough. Plenty of meat and cheese. Water supply getting better. Prior to leaving Anzac an axe was put through two Barr & Stroud range finders value £160. These could have easily been carried by one man. Waste! Officers mess tent erected today on right flank of camp. Mail expected tomorrow or Monday, Davison having now taken the postal service over. Another party left for the Zeitoun school today. R.S.M Porter going well, with a bulls voice he is the King of N.C.O.s as my trusty Sergt Peart is the Prince of Clerks. A man drifted in with a string of lost camels the rain having washed away their scent in the sand.\n","56":"\n\nHeavy rain fell during the night and dawn broke very pleasant. Special orders out to safeguard our maps and plans as the Turks are dependent on ones that are very old and unreliable. Church parade at 0930 padre Durnford new to the job. A nice compact little square all clean and smart. Hats drill order without rifles. R.Cs. marched over half way to 21st and held mass there.\n\nAfter lunch had the preliminary bouts of our boxing tourney. Weighing apparatus like a gibbet constructed of telegraph poles and we used cases of bully beef for the weighing. Engineers rigged up ring tarpaulin & matting, Porter referee Cpl Ryan time keeper. A good crowd including Brigade Staff and some hefty bouts blood and hair flying. Lawson v Q.M’s storeman Stephens very amusing, Lawson like a dog lifting his bloodstained smiling face up to the R.S.M when taking the count. Survey officers passed mounted on camels with an escort from the Indian Camel Corps. A camel is only given a drink once every three days (can go for eight) and then absorbs 1 fantassa full or about 10 gallons. Natives can get on a camel when it is standing by climbing up the legs and then standing on the neck and scrambling on to the hump. Some use a loop of rope, others ascend via the rear though a camel kicks like a cow. If the animal is unruly the drivers cruelly belabour it about the head. \n\nThe trenches we dug are nearly filled by the sandstorm and engineers as they go on revetting have to dig them out. The allowance of ¾ pound biscuit for the men in lieu of 1 lb. bread proves too little, a mans tea amounting to about one biscuit and a half. Rumoured that all existing units are to be divided into two separate battalions and then half reinforcement men and officers added so as to have a leaven of old soldiers right through the AIF. What is exercising the minds of we in the desert is the thought that cold footers at the Base being on the spot will pull the strings and get the good jobs. Our new C.O. turned up tonight and is at BdeH.Q. The C in C Sir Archibald Murray will be out tomorrow and the \"furphey\" is that it is on his favourable report that the \nsuccess\n decision will be made about sending us to France.\n","57":"\n\n\"Tucker\" Vienna, cooks fatigueman has a Rosella cardboard parrot cut out of an advertisement and has this thing nailed to a perch and a cage round it. The thing looks splendidly life-like in its Egyptian wicker prison. The same \"Tucker\" after our return from the trenches used to hold new reinforcements spellbound with tales of how he killed hundreds of Turks & sucked their blood!\n\nEarly morning parade at 0630 semaphore. Morning 0830 acted as umpire in \"C\" Coys attack up to stage of fire fight for superiority. Afternoon 1300 \"D\" Coy attacked against \"C\" in defence covering fire signals broke down. A day in the saddle. Brigade Major & Brigadier out. Our parade hours are now 0630 – 0700, 0830 – 1100, 1300 – 1530. Engineers revetting trenches we dug with hurdles and matting. Dugouts constructed of wood and sandbags proof only against shrapnel. Sand very difficult to work in having no standing power of its own. Great rumours roundabout the splitting up of each Battalion into two. Colonel Norris took over command today. \n\nThe camps of the remaining battalions of the brigade are all in view from here and their camel trains and so on are always across. The native camel drivers vocabulary seems limited to very few words which our fellows soon master, the stock words of the gayhouses of the Wazir pass current in the conversation. The sight of long strings of silhouetted camels against the skyline and the sea of sand all around has a fascination. The moonlight of the desert is wonderful but is surpassed by the blackness of Egyptian night. The stars seem to show doubly bright when the black Egyptian night falls, no wonder the ancient dwellers of the desert were such astronomers. The Great Bear, The North Star, and Orions belt, Mars with its red glow are all familiar. \n\nAll our outposts are to be relieved at 0430 before dawn in future and stand to arms as per FSRegs. At 1200 the boom of a heavy gun was heard. Aeroplane reconnoitring in front today and volplaning over the camp. Sir Archibald Murray went along our line today with a bodyguard of Bengal Lancers.\n","58":"\n\nCol Norris has not taken over routine yet. Did some semaphore at early parade. Morning rode round trenches and measured our traverses for Engineers work. Then rode out over sand hills. Afternoon did Advanced Guards and had a platoon out scattered as enemy. Routine office stuff not many furpheys. All quiet and myself feeling rather fed up with this dam seniority business. Talk about the inertia it is the father of. \n","59":"\n\nRoused like a fury at reveille over slackness and caused quite a flutter in one or two quarters. Round engineers in trenches and had a look at the bivouacs in continuation of the company lines. Being half holiday after lunch there was a good scrap between Rhoden and Harwood both dyed crimson on their bare skins with the gore from eyes and noses, \"Sailor\" Parsons and \"Storeman\" Stevens was a put up job and declared no fight.\n\nWriting most of the afternoon and then to a conference of officers presided over by C.O. The Brigadier was present and we settled a few tactical phases. A hostile mounted patrol has been reported. The weather today cold and some rain making conditions generally favourable to an advance across the desert. Resiting some of our trenches to get a field of fire on the forward slope for if the enemy have no heavy guns. Bed early.\n","60":"\n\nFog thick at reveille. Turned out before many were abroad and noticed a big improvement upon yesterday. First parade physical drill make a raid and found only two shirkers. Present at guard mounting parade. \"Bivvies\" of hurdles and matting at the head of each company’s tents to avoid overcrowding in tents. This morning \"A\" Coy did Advanced Guards \"B\" Route march C in rest D outposts and duties. After lunch C went on Engineers fatigue and I walked round where they were walking, the opinion of the C in Chief having modified somewhat the plans for the trenches. The Brigadier said very truly that these changes and chopping and turning of ideas and plans must be accepted and minds made elastic to readily adopt them, although changes confuse the man in the ranks and the officers then are a necessary evil and based on past experiences. \n\nWe are getting new ideas on tactics now that are the fruit of the last British advance in France. Furpheys round about the reorganization of the AIF and our going to France as the Australian Army. Up on top of Hogs Back (367’) with Skene Smith & Pedler and rested by the \"trig\" point. Two artillery officers came up and we regaled them with tales of the trenches. I could not help noticing how sanguinary our language got at times. Discussed guns &c. \n\nFrom here a great view of the country can be obtained, a sea of sand with glistering sand hills all like this one, like waves on the sea. The far side of this hill slopes off steeply in a smooth sand slope and altogether is a most remarkable formation. Every puff of wind shifts the surface of the hill. R.S. out putting up range marks Col Norris looking after administration and R.S. after defence. \n\nSome tents have good singing parties down our lines and a concert is proposed now. In the sports are Hogs Back Cup, Desert Dash, Wilderness Race and a race for officers a sweepstake of P.T. 5 with a tin of bully beef and biscuit added. Some mail arrived tonight. Candles cut out as an issue, a hardship which has been brought under notice of Brigade. Tracks of a hostile party seen leading to a lookout 5 miles E of Hogs Back. As our artillery observers had not returned we warned our outposts very carefully to avoid firing on them.\n","61":"\n\nWas \"the first man up\" in camp this morning & buzzed round early. Bayonet fighting the first parade. Digested mail and at 0900 went out with Colonel Norris to select a position for a rifle range out in front of the outposts. Noticed some pieces of paper blowing round and had steps taken to avoid same in future owing to the use documents &c might give to enemy. Decided on a site using the sandhill called the Punchbowl as a mound. Fine view of the canal and the blue rises beyond. Running like a living ribbon through the desert. A four funnelled warship signalling and some big guns firing further south. \n\nAfter lunch tried to pick up \"C\" Coy doing artillery formation but missed them. Across sand hills to the south and noticed snails crawling with white shells on their backs, also two beetles one (dead) an ordinary black beetle the other with little studded projections all over his back and a body spider shaped. Small tiny tufts of a shrub in places quite green and one with a tiny blue flower. Whitish stunted bushes covered with long shiny needles fairly common. \n\nHad a look at our miniature range and the bayonet fighting \"field\". Where the sand had drifted away in one place came upon a large number of white bleached bones probably animals’ but a leg bone had a human look. Beside the caravan routes in places are these bones. Took notice of the imprint of camels feet although not much larger than a horses foot, the camel’s only leaves a slight impression in the sand, \"the pad\" not indenting the sand much. Native drivers in bare feet. – Their feet larger than the average European and very broad across the toes as if spread out there. Our company out on route march brought in 3 Beduins and camels under arrest. Down the lines after dark the men were indulging in blanket tossing. Furphey from Staff Capt we are going to Mesopotamia.\n","62":"\n\nFirst parade fighting back to the I.T positions and styles of on guard. The Battalion digging all day except \"D\" on route march. Revised C.O.’s orders for the defence and the alarm stations. Wrote some letters sending £5 and some photos. To Airlie Avenue. Round to \"C\" Coy digging trenches and had some range finding on the mekometer with Bazeley. Some good positions for machine guns where attackers would come along through funnel shaped wadis.\n\nSome green succulent small plants in places with small flowers and one with tiny downy seeds. Major Smith brought back a queer bulb with clenched leaves. Pay today. After lunch went out in front putting out timber range marks T200 Ix300 II500. Quite able to control the movements of any of our men from a long way by signal and most can read semaphore. The Australian is smart and knows the reason why every time. \n\nErected observation post of Hogs Back and garrison it by day tomorrow. Outposts save sentries have fixed bayonets by night. Great keeness over rifle exercises each coy has a team from every platoon and after dark the lads are drilling themselves. Heard one group returning remark \"Some b-- good teams in fer this Bill!\" \"My b-- oath Yes, yer wanter keep yer block\" \"Yes, yer wanter think what yer doing every b-- time\". The prize is P.T 200. Some gift stuff arrived and one fellow tearing along announced he was after the \"b-- backsheesh\". The small hurdle bivouacs at the head of the lines are comfortable and favoured by those who like their own show.\n","63":"\n\nSlept in until 0730. church parade 0930, fairly small owing to \"B\" Co being occupied on defence work. Erected an observation post on Hogs Back, very difficult to work in owing to the loose sand shifting and blowing easily. About lunch a nigger was brought in under arrest from 21st – found prying round their trenches. He squatted down on the sand and over him was a big sentry with fixed bayonet, \nbig\n hot sun streaming down on the sand and over his little skull cap. All the lads inspecting him, - comments firing, \"He’s a Joe! The’ve gotter b— Abdul\". \"He is neither a b— Joe Burke or a b— Sigheader - he is a b—Armenian\". \"Armenian be b— he’s a treacherous Abdul b—.\" Another also brought up for examination very picturesque Arab burnous. \n\nAfter lunch had some boxing and rifle exercise competitions. No. 6 platoon, M. guns, and No. 2 still to go. 16 teams of 12 competed and the interest taken was wonderful, the work very good. 23rd band over. A good afternoon with Brigadier B.M & CO as judges. Men sing to tune of Holy! Holy! Holy! a song \n\n\"Marching! marching marching\n\nAlways b— well marching\n\nWhen we are dead and in our graves\n\nWe’ll b— well march no more!.\n\nRevetting, entanglements and digging are being pushed on with all speed and all hands work hard. Rumoured today the 19th Battn is split into two under the new organization. A number of gift magazines arrived and a great many lined up to the padre’s tent for backsheese literature. Our mess very good with Dixon as messman and the waiters from the ranks are all old stewards. Lights out is greeted by the singing of \"Good night Abdul\" to the tune of \"Good night Ladies\" we’ll meet again soon.\n","64":"\n\nNot feeling too well so slept in and then took two number 9’s. All available men on digging all day. Talking at BdeHQ. and fixed things to dodge being attached as a Staff Officer to Divisional Headquarters. Four FG CMartials to be tried here tomorrow so had a busy day overhauling papers and preparing case for the prosecution. Stayed close to tent all day reading and writing. Tomorrow a scheme for leave commences, 13 men to be allowed off at a time and to march to Staging Camp and there catch a train from Ismailia to Cairo returning at 1915 the same night. The whole scheme is a farce, the fellows will get full of beer, and get hold of a woman and never get back here on time. We have had no trouble up to date but from now on with this offences will commence. Being nearly killed by the march out they thought they were a hell of a distance from civilization, - now they can see its proximity. \n\nFour men imshied last night. Horan was one. He has gone to the pack completely and is no good as a soldier and more trouble than he is worth. Late a barrister & solicitor of Dublin, soldier of fortune in South America and elsewhere he consorts with the lowest who look up to \"Barney\" as their leader. A splendid soldier in the trenches and an ex-Grenadier Guardsman, he has now lost his self respect.\n\nOrders to push on with our bayonet fighting, and construction of swing targets. No materiel can be supplied & our orders are to make them. Red tape very bad higher up and make one think we deserve to lose the war. The transfer of a private soldier from the 7th Battn to this cannot be done without the signature of 2 Generals, one the Army Corps Commander. Quite ridiculous and opposed to KR 333 which vests the power in C.O.’s. Growing opinion here we are to go to Mesopotamia. Peart went up to Cairo today with all the paybooks and plenty of commissions to execute. Bed 2000.\n","65":"\n\nA windy sky and later very cloudy. A light rain commenced about lunch time. Busy with Court Martials all day, prosecuted in four cases. Major Harris 21st the President. Curnow’s parcel of photos arrived and sent a few home. Things quiet. Kirkwood \"C\" Co. a little weedy chap who was wounded in the trenches has rejoined. The circumstances of his wound were very funny. He was one of a party putting out barbed wire and suddenly he was hit by a bullet in a very delicate place. Clasping it he tore back towards the parapet and floundered into a heap of barbed wire. It was pitch dark but he got out somehow and raced over into the fire trench, then tore down to the dressing station to get it dressed.\n","66":"\n\nA fine windy day. Great furphies about forming new units and C.O. asked to submit recommendation for appointments there. Brigadier has sent my name on for staff work, am trying to get it withdrawn. Rumoured that 3 new Divisions are forming 1 in Australia and 2 at Tel el Kebir. Rather a coincidence that 606 is the regimental number of one of our company clerks Lance Sergt. Glasscock of \"C\" Coy. The proposal re units seems to be to split them into two half the senior officers to go to one and half to another. Interviewed Brigadier and told him I did not want to go on to Staff job but wanted to handle the men not the orders. He promised to explain same to Divn.H.Q. \n\n70 bags of mail arrived on camels for the Brigade. Attached they have 3 of the Indian Camel Corps men under Bekanees. Our picquets were again shifted today this time to a place further forward. Barbed wire and range marks &c being still put out. Had hoped to start a company on bayonet fighting tomorrow but Engineers now want a fatigue of 100 for road building purposes. Two good fights this afternoon and a \"straight pull\" two out of three for a side wager. Good sport and men all interested. Bed.\n","67":"\n\nAwakened by Colonel at 0555, could hear 23rd band playing, some officers lazy and lying abed so roused all round. A lovely sunny morning but very raw in the early hours. Work bayonet fighting positions. After breakfast rode round outposts and our forward trenches – some lovely barbed wire entanglements, rusty stuff festooned up to 2’ 2\" from ground and 12’ wide – pretty rough for old Abdul’s bare feet supposing he comes. \n\nWent round out in front at a hand gallop – the further you go in this desert the more tempting defence and other positions you see and the higher places for lookout purposes. Party of 250 men working on the wire. We also have detached 100 men as platelayers or rather railway builders just in rear of camp. Rode up to foot of Hogs back and found them under difficulties as regards observation. The top of the hill in a state of skimming agitation all the while, 2 feet of sand drifted into the dugout during morning and the sentry had great trouble with his eyes owing to flying particles.\n\nAfter lunch went out on the horse again round the defences but returned early and did official work. Took a summary of evidence in the case of fraudulent alteration of pay book and fixed up an officer of the 24th who was under close arrest. At 2000 under arrangement sounded the alarm whistle and in a few seconds the camp was alive with running men silently getting to their posts. In five minutes time the whole battalion was formed up in mass facing east about 900 on parade all in fighting order. Ammunition parties at their posts sigs. & m. gunners at theirs. Within 6 minutes all had moved off complete even to stretchers and within 20 minutes the trenches in the forward line were occupied. Bright moon by which one could read small print, scattered cloud gave the desert a foggy look caused by patches of moonlight. Lights out 2200 and so to bed.\n","68":"\n\nGreat improvement in early morning turnout. Organized permanent working parties will allowed \"B\" Co this morning to do bombing and other field work. They were practising the assault from trenches against sand bag dummies and enjoyed it, swinging along at a jog trot and getting good thrusts home. A report from an agent that O.C. Turks Camel Corps has issued orders for an attack on outposts for reconnaissance purposes. Advancing over desert under cover of darkness and attacking at dawn. We are ready. \n\nRode round outposts and defence works wearing shorts pulls hairs out of legs, riding. New Brigade Commanders today. Also Brigadier returned from D.H.Q and told Smith that Norris was to get command of the new unit and that Pedler’s name and mine had been sent on for company commanders, the other two recommendations being turned down and that our names were now in the hands of the Army Corps Commander. \n\nWent round the works again in the afternoon \"D\" Co. hard at work on the railway and making good progress. Large cutting to be made through sand hill but the ground easy enough to work in all conscience. Some mail arrived for Brigade 14 camel loads. Good fight this afternoon between Rhoden and Lawson. Lawson won doing very good ducking. Word received that G.O.C will inspect us on Sunday next at 1330 so perforce our sports were cancelled. Message received advising 40 Turkish cavalry and some patrols about 3000 yards out. \"B\" Co. and M.g.s all got into fighting kit ready to move out at a moments notice and take up positions in front and will stay so all night. Great clicking of bolts and bustle down the lines the old heads quietly and affectionately caressing their rifles and praying for dirty work. Do not expect anything will transpire. Bed. \n\n18\/2\/16\n\nTo bed but not to sleep. Called out at 2200 to put out a screen in front, one platoon reinforced each picquet, one to the Punchbowl under Alderson and the balance of the local reserve bivouacked in trenches. A squadron of 13 LH went out at 0300 taking our doctor with them. Bde. making complaint to D.H.Q to avoid our losing our M.O again. \n\nDr. Craig, very Scotch, and one of the driest old sticks. Discussing Court martials the other day someone said \"Three years penal servitude is a very hard sentence\" \"Yes\", said Craig, \"I’d almost as soon go through the war\".\n\nMackay after lunch said \"I’ll leave the table, doctor\". \"Yes\", said doctor, \"it’s about all you do leave\".\n\n\"If the sick parade has no serious cases\", says he \"I lock all the poisons up open all the panniers and say to the AMC men \"Go ahead lads!\"\n\nHaving to turn out with the L.H. his horse took some procuring and much language was wasted because saddle was missing. My batman told me that in the pitch darkness they could hear someone outside and one of them called out \"Have the batmen to stand to arms\". The laconic reply was \"B— the batmen!\"\n\nNoticed camels drinking water out of their throats. Where Adams apple should be they have a slight dip like a pelican and reserve water there. When they want a drink the head is thrown back and this water ingurgitated. The yelp of wild dogs can be heard alround and their foot marks are to be seen in the sand hereabouts. Sound travels remarkably far at night. Last night the Orderly officer called out in an ordinary hail \"Regimental Orderly Sergeant\", this call was distinctly heard ¾ mile off out in No. 2 picquet. \n\nWhen Craig returned from his tour with the Light Horse Smith said \"How are the Light Horse, Doctor?\" \"I don’t know\", says Craig \"but I can speak very feelingly for myself\".\n\nThe men sing a song to tune of Marsellaise. \n\nBacksheesh! \n","69":"\n\nThe Battalion stood to arms on the alarm post with bayonets fixed fro 0500 to 0600. Bright moonlight and the men stood in their places silently. Outposts reported all quiet so the line was thinned down to normal and the Punch bowl garrison withdrawn. Our Light Horse found two camels and brought them back. Went back to bed and slept. Round the outposts on horseback after breakfast with C.O. found all normal. The post on Hogs back under great difficulties owing to sand the sentry having to put his greatcoat over his head. The Light Horse squadron returned at 1300 having completed their job. \n\nMilitary justice – the R.S.M gives me names of offenders and what they have done. I know them all and put in either a good word or a bad one and suggest say 28 days field punishment No. 2 for a tough nut. C.O. goes down to orderly room and hears case awards the agreed punishment and accused is out before he knows what’s up. \"Escort & accused right turn left wheel quick march\". However on the whole this system works very well. Roth returned from Cairo. \n\nAfter dark went round the outposts with the C.O. the whisper of the sand insistent in the bright moonlight and every little tuft and fold of ground & quite deceptive and like bodies of troops. Picked up no. 2 picquet and went on foot to the sentry groups. Very alert \"Halt! Hands up\". Then to Number 2 picquet which we had very great trouble in finding so easy is it to get lost. Eventually we tumbled on a sentry group & located ourselves. Returning to camp we lost our bearings again and found ourselves about a mile away near the 23rd Battn. Camp. Picquets are about ¾ mile from camp, sentry groups about 500 yards out during day but reduced to about 200 yards at night. Reinforced each picquet with an additional platoon & bivouacked the inlying picquet on the alarm post. Double sentry over arms. Our reports today show enemy mounted concentrating 80 miles away and scattered Arab patrols close in. Bed 2200.\n","70":"\n\nStood to arms before dawn until after sun well up. Church parade at 0930, put in the pegs for ceremonial parade at 1230. The camp spotlessly clean and tent flaps up, kits dressed. Lunch 1100. Fell in for inspection by G.O.C. at 1210. Big parade and the men looked well and we gave general salute as the Staff rode up. Formed square and the G.O.C. spoke on discipline. \n\nAfter dismissal the sports commenced with a good fight between Telfer and Anderson – the latter being knocked out after a few bloody rounds. Unearthed a very good runner in Smythe of \"D\" Co, who won the Hogs Back Gift, Wilderness Cup and Canal Zone Flutter. Montgomery won the old stagers burst and Fleming was successful in the cockfighting. A good afternoons sport. Paid out about 4800 piastres tariff during the evening – a good Sunday. Cloudy and cold in the morning, windy and a few drops of rain in the evening. \n\nSaw a small snake (viper or asp) sandy coloured but light brown markings killed among the tents and also others out in the open. Also noticed a small lizard which was nearly transparent, - a very fragile looking little thing. Jimmy Alderson did good work on the sports and deserves much credit for the good he did. R.S.M Porter a great battler, with a voice like a roaring bull. Shakes up all the duties Peart not back yet but expected Monday. All niggers who get out this far selling papers are put under arrest and sent back. No. 6 platoon won the rifle exercises, lovely work full of quips & swank. No. 2 second. Stand easy Dismiss (long pause).\n","71":"\n\nBayonet fighting and saluting practice first thing. The men playing a fair amount of gambling games. Crown & Anchor one of the most popular. Little rings gather after dark with a stump of candle. Pitch & toss also going in places. Poker and other card games also running. Rumoured that some of the men have won as much as 1500 piastres tariff. That is the bad part of it, if they don’t get a fair gamble for their money. However, although contrary to Kings Regs. we don’t propose to interfere unless it becomes a pronounced evil. One:- because they are men, not children and know what they are doing. Two:- because time drags heavily and anything that restricts their leisure is to be avoided, as montony here is very trying.\n\nCorporal Johnson our M.P. Corporal is hard looking nut. He is a finger print specialist in the Criminal Investigation branch. One of his excuses to get leave was most ingenious to wit that he wanted to send some of the special powder used for showing up the marks back to Australia Vienna, the other source being stopped. He superintends the work of the \"bad eggs\" who are the sanitary squad and also is the bloodhound we put on to detect petty thefts &c. \n\n139 cases of backsheese fruit arrived today and all ranks are living high. Our aeroplane reports 200 Turks 30 miles east of the Sphinx yesterday mounted so may expect raid any time. We have plenty of barbed wire out in black festoons and the intervals between trenches are covered by a high barbed wire fence with sloping entanglements on exterior side. Rode round outposts this morning with the C.O.. Roth building rifle range out there. \n\nHeard today Harris, Fethers, & Norris new Battalion commanders. Instituted a new night picquet and have supports and inlying picquet in bivouac. Our mess here is one of the best I’ve been in. cheese is almost a staple of diet and very excellent too, good bread only trouble lot of sand gets into food, particularly on windy day. Small mail tonight.\n","72":"\n\nGreat improvement in early morning work, 10 minutes saluting is included with great advantage upon the programme. Our times for parades from tomorrow are to be 0630 – 0700 0830 – 1130; 1300 – 1600. The days are becoming longer and decidedly warmer. The trees and cultivation along the Canal showing up very distinctly today. At 0900 went round the outposts with the C.O. and fixed up permanent latrines for them. Big parties working on barbed wire. After taking out details, Sigs. m.gunners, bombers and engineers fatigues besides supplying our outposts there are not many men left. Made up Courtmartial papers for .\n\nAfter lunch went round the line again and also with Smith after tea. Hard to find picquets and groups in the dark and sentries very alert. \"Halt! Hands up!\" \"Advance one and be recognised!\" \"Pass\". At 1806 heard a shot fired about a mile off about S.S.E. Had afternoon tea with the Brigade Staff, it is proposed to give us 3000 gallons of water to allow a reserve to be held. Padre went up to Cairo. Bladen says he was passing a group in the 23rd and he heard one man say. \"He’s not a bad old b--.\" \"Yes!\" said other \"he’s a decent old b--.\" Read in paper tonight that Belgian officers kissed ours in Flanders. Dr. Craig \"Another of the horrors of war.\" \n\nRumoured today that we will not get any of our men or officers back from the school of Zeitoun also that 16 new battns are forming at Telle Kebir and 500 from the 16 Batts. of the 1st Div are being taken to stiffen them. Persistent rumours we are going to France. Reported that Fethers is not getting a battn after all but is getting a staff job. Lots of furphies but no dinkum. They don’t know as much at Bde HQ as we do.\n","73":"\n\nNothing doing. Rumoured alteration of establishments for units. Good fight this afternoon. Lawson v Harwood won by latter – a very gory encounter. General Holmes present also Brigadier and Staffs. Engineer’s fatigue hard at work this afternoon, although the rest get holiday. Peart returned full of information. All quiet.\n","74":"\n\nCurnow and Slater returned to duty today. Usual routine today and in addition went round the outposts with Curnow in the afternoon. Furphies that Colonel Brand is to be the new Brigadier on account of Gwynne becoming BGeneral and going to Army H.Q. General White going to G.H.Q. . Our wandering bird Henley returned to us under escort today. This life becoming very monotonous and consequently much gambling is going on. In rear of the lines little schools gather round candles at dice games. \"Anymore for anymore.\" Our band is coming and a harmonium came today.\n","75":"\n\nA&B Coys route march today. The new units are being organized on the reduced establishments for the New Armies. A windy day but sunny, a good deal of French wire being festooned in front of the trenches. Rode around the line with the C.O. first thing and had a fairly easy time after both Ped. and myself waiting for news of our transfers to the new units. \n\nNoticed the tracks of lizards and snakes out in the desert today and also indications of the jackals or wild dogs we hear barking round the camp at night. Some \"dinkum\" arrived about 2130. Norris appointed to the 53rd and Harris to the 59th. German wireless intercepted stating the Australian \"Indian troops\" had risen and that the officers were shooting their Moslem servants even if they were only guilty of clumsiness! \"C\" Coy did a night operation and found direction hard to keep. Am getting quite a star gazer and know Great Bear North Star, Orion’s Belt, Mars Venus &c.\n","76":"\n\nColonel Norris left at 0800 for Ismailia. Major Smith in harness again. Took long summary of evidence in the case of Henley. The mens abbreviated or decorative language very amusing. \"Niagara falls; also \"fleas\" Jack Lees. Divisional Order at noon gave all the new Battalion commanders right up to the 60th. After lunch walked right round the outposts with Curnow, very warm in the sun. The view from the groups of No. 1 picquet is remarkable embracing about 10 miles, - as far as the eye can see are sandhills and sand like a great sea. This group has a telescope and commands the whole scene. Observed here that the small parralel tracks thought to be caused by lizards are in reality those of black beetles whose legs lie almost flat on the sand so they can get along easily. A disposition of Providence that enables them to cover far more ground than the ordinary beetle could with its feet. \n\nProposed in view of the big success of last sports to have others the officers donating one days pay to provide the prize money. Spiller introduced to mess for the first time, we are a happy family. Plenty of rag time music down the lines with the harmonium Peart brought out. Our band now at Staging Camp and waiting removal so shall make them march out tomorrow and collect their instruments. A small mail today – two or three papers and letters.\n\n27\/2\/16\n\nBeing Sunday slept in, church parade at 0930 with rifles. A windy unpleasant day, developed a temperature so missed lunch and slept during the afternoon. Later with Bert Curnow watched a few sports events and then a football march. Went round outposts and found all quiet except for reported movement on 24th front and which an Indian patrol went out after. The groups withdrawn to their night positions too early it was quite daylight they should wait until dark. Reported tonight 2nd Div. is off to France inside a fortnight.\n","77":"\n\nSuez Canal Zone\n\nNothing especial to note, rode around this morning and stayed in this afternoon. The most circumstantial rumours flying around about leaving for France on the 16th March, the","78":" Division to go, the others when they are organized and sufficiently trained. \n\nPromulgated three sentences of Court Martial in two cases 12 mos hard labour was inflicted for uncoupling a troop train. The formation of a Pioneer Battn and of a Brigade machine gun coy. are now going on. Lewis guns to be given us and the Bde. Company to be equipped with Vickers in their place. About 500 of the men’s kit bags came out on the camels. Gambling tonight after dark. \"Bet a lot & win a lot\" \"On the heart & on the spade\".\n","79":"\n\nShorts are a most rational & comfortable part of a soldiers uniform and would be ideal for our Australian climate. Around as usual this morning and also this afternoon. Announced Capt Kennedy","80":" to be Major & second in command here – my junior: Lanyon (Duntroon) reported and commenced work as Asst Adjutant. No word yet about our transfers to new units, rotten being so unsettled. Peacock returned this afternoon – put him under open arrest on a charge of absence without leave. \n\nIn rear of camp about 200 yards a railway track is being built up and ¼ mile further in rear a 4 inch water pipe is being laid. Long strings of camels wending their way over the desert like long snakes laden with stores and water fantasses. A remarkable scene from hill tops, undulating sand and the blue of the canal vegetation westwards, the warships seeming to float on the sand too. Our men hard at work on the trenches digging and revetting and other parties putting out barbed wire. Using a good deal of French wire on our entanglements. The Pioneer Coy. and the Brigade Machine gun company are going to take a lot of men from us. It does hurt losing our old men who served through the trenches with us and who know their officers as well as we know them.\n\nSuez Canal Zone\n","81":"\n\nDies irae! Round about early in the morning but coming on very warm did not stay out long. Great engineering and manoeuvring regarding our supersession by Kennedy. With C.O. went across to Hogs Back to meet General Godley. He was too late to get across, so we rode back with the Brigadier & Bde Major. After lunch the Brigade came down (Gellibrand) and talked and after more talk and trouble I find I am to stay here. Dies irae.\n","82":"\n\nPedler appointed to the pioneer company so I took over command of \"C\" Coy. A filthy windy day the sand getting in everywhere and stinging the legs and face. The Punchbowl sand hill is a most remarkable formation. On the side from which the prevailing wind comes there is a gradual rise of fine loose sand, the reverse side of hill is an almost sheer descent into a crater fully 100 feet deep. This precipitousness is to be seen on all these sand hills. In the wind this morning the sand was flying off like smoke, the hill having the appearance of a volcano. The work consisted of visual training and judging distance with such of the Coy as were not on outpost. The afternoon was cruel, the sand filling the mens pouches and equipment. It was almost impossible to see more than a hundred yards or two ahead at times. \n\n25 jack tars arrived here at midday and we are accomodating them in our lines, the midshipmen went to BdeHQ. Mackay on his route march found the remains of an old Turkish camp, a relic of last year’s invasion. The ground strewn with ammunition boxes & clips and twisted ironwork. We commence musketry tomorrow the outposts being withdrawn for that purpose and all firing to be done from the trenches. Our rifles are being changed for those taking Mark VII ammunition and bayonets also being changed. Divn. H.Q. memo says on account of early departure for Europe we are to get rid of all undesireables. Had afternoon with two A.M.C majors on a tour of inspection. A filthy day.\n\nSinai\n\n2\/3\/16\n\nJust before dark went out to place detached post, the position was overlooking the junction of two wadis about ¼ mile north of Punch bowl and Danger Hill – a very difficult place to find and the visiting patrols all night were quite unable to locate this party. The fine sand was skidding across in the strong wind making the horse cough and soon after the men not on sentry laid down they must have been quite covered over. \n\nRode back now quite dark passing No. 2 group of No. 3 picquet and after that in blinding sand and darkness without compass and no stars visible became quite lost. Eventually found that I had not ridden in the direction of camp at all but had gone at right angles right across the position. Stumbled on No. 2 group on the extreme right flank of our line and could not find the picquet although knew it was only 100 yards to the left. After much stumbling at last rode into the 23rd Battalion lines a mile and a half out of my course. Steered north by the Great Bear seen fleetingly through flying cloud wrack and reached camp again about 1945. Left horse and made way out to supports \nof\n on foot steering on a compass bearing. \n\nReached No. 1 picquet who furnished a guide who took me 100 yards out the track but at about 2100 I reached the supports. The stinging sand flying across the desert got in everywhere and made our stay in the supports a misery. Got into sleeping bag with all clothes boots &c and pulled the mackintosh right round head. The thing was soon stifling hot but was better than being buried in sand. Frequently disturbed by visiting patrols and others with reports & messages and lay listening to the sand beating on the cover of the bed like rain. Stood to arms at 0430 very cold and still windy but the dew had laid the dust. Stars shining very brightly and everyone much fatigued. Eyes plastered up as with mud and greatcoats and other articles flying about had to be dug out. Made our way back to camp the other picquets &c converging and enjoyed the luxury of a wash and a half holiday. The naval men quartered on us have been taken in hand by the men and some great yarns are being exchanged.\n","83":"\n\nSpent the morning’s half holiday recovering from the effects of the preceding night’s experiences. A hot day with a wind full of sand which penetrated everywhere and spoilt all food. The last night and day have nearly killed all our trenches and the shape of Hogs Back is completely altered, a valley having formed down the middle.\n\nHad early lunch 1100 and rode out to front line the company coming afterwards. All the outpost withdrawn and with improved targets we carried on with musketry firing out into the desert. The wind abated in the afternoon and the shooting was not too bad. Marching across the desert we found its appearance quite altered with drift sand and firm underfoot. Against each tuft of grass had grown quite a small hillock – these big sandhills are built up in this simple way. A row of small scrubby bushes and a prevailing wind are the two requisites. A small mound grows up over the stopwind of bushes and mounts up like a growing mountain with fresh deposits. \n\nOur wags again. We are in the wilderness of the Children of Israel and Moses and the wandering of the Chosen People are frequently discussed. A sentry challenged a moving figure in the pitch dark of a night or two ago. \"Halt! Hands up\"! Who comes there?\". \"Moses\"! was the reply. \"\nAdvance\n Pass Moses & hand over the Ten Commandments\". Yesterday I sentenced 2 men for talking in the ranks to 3 days Field Punishment No 2. When read out on parade \"pour encourageur les autres\", - I heard one remark. \"There you are: Joe, got mentioned in b – despatches!\" .\n\nNotice camel drivers though of the lowest type and half imbecile snatch any spare moment, such as while their camels are being unburdened, for prayer. Five times a day from Russia to South Africa and from Sierra Leone to China, do the faithful turn in devotion towards Mecca in obeisance to a small cube of black stone there.\n","84":"\n\nThe shape of the mighty crowd of Muslims prostrating themselves towards Mecca is, ironically enough, the shape of a mighty cross. A marvellous cross of 230 millions repeating that direct challenge and slap in the face to Christians: - \"La ilaha illa Illahu!\" There is no God but God\" and added \"Mohammed is his Prophet\". It is a custom in the desert for the boys to draw a cross in the sand merely choosing that shape so they can defile it. \n\nAfter 0500 reveille we left for Railhead as a battalion and found the road & rail much advanced with motor wagons running on the former. An enormous park of camels here lying in rows and starting out to all points of the compass with supplies & water. We exchanged all our rifles for converted ones for the high velocity Mark VII cartridges. Some very old patterns among them. In yesterdays musketry we unearthed a great many defective and worn rifles so all the men are like children with new toys.\n\nGot back into camp before lunch the wind blowing fairly strong in directly opposite way to yesterday, the sand going off the tops of the sand hills like smoke from a crater. Received the tip today to pack up all heavy baggage and get ready for transfer to Moascar very soon. Davis returning will take over Adjts work. Rodda returned today from the Lewis gun school. Had half holiday in afternoon after mornings march.\n","85":"\n\nEarly breakfast and out before 0730 to the musketry range. All outposts withdrew at dawn and we carried on with rifle shooting. Some very good rapid practices carried out and all taking a great interest as they were trying out their new rifles procured yesterday – most of them go high. Some men very smart in their rapid shooting, getting their rounds off very smartly and in record time. Returned to camp for lunch and then received orders to repost the picquets at once so sent Elmiger & Bazeley out accordingly. Rumoured two companies return to Staging Camp tomorrow and new units come here. We are expected to embark on 14th – it will be interesting to see how near this is to the date we do go. \"House\" \"Crown & Anchor\" &c prohibited from today. Today is Sunday. Slept out in the outpost.\n","86":"\n\nSteering on a bearing of 90° eventually got to bed in the outposts. Lying in the blankets on the sand studied the stars which shone bright against the night \"as dark as Egypt\". A beautiful night with a dead silence broken only by the challenge of the sentries. One man \"Squeaker\" Dyson got lost and was wandering about the sand in the dark. A sentry caught sight of him and two men went out after this supposed enemy and soon had a bayonet at his chest and shouted \"Halt\". \"J – C – I am glad to see you b—s\" squeaked Dyson in his falsetto in reply and it sounded irresistibly comic after the tension of hunting this supposed enemy. Slept like a top, stood to arms before dawn and were back in camp before reveille. A soldiers song:-\n\n\"Old soldiers never die, never die, never die\n\nOld soldiers never die they simply fade away.\"\n\nA wailing shriek following the last note after a pause. This is sung to hymn tune \"Kind words never die\". Another favourite is sung to the tune of \"What a friend we have in Jesus\" and goes\n\n\"When this bloody war is over\n\nOh! How happy I shall be\n\nWhen I get my Sunday clothes on\n\nNo more soldiering for me!\"\n\nMen marched out on this morning parade carrying all their belongings and a fatigue of 30 then got to work and imshied all other stuff down to the incinerator. Word came through we leave for Moascar tomorrow to concentrate. The artillery today are having firing practice and it seems like old times to hear the noise of explosion & the burst of the shell. Camels busy being loaded up with Q.M.’s stores and other kit in charge of the loading party is my old playmate, now one of my men, Corporal Bud Shields. At mess we had a roast goose! It has been quacking round for some days & I thought it would be rather a joke if some of the men had collared it! However it survived this peril to come to a horrible end for an officers mess. A good deal of whisky flying round in the mess and a good deal of jollification down the lines and singing. \"Down where the watermelons grow\" is a prime favourite. Slept on a mat with only one blanket and spent a cold night. Sleep 2130. \n\nSinai\n","87":"\n\nUp at dawn and got the men on to packing up and getting into full marching order. Struck tents after breakfast and sent stacks of wood, boxes and other rubbish down to the incinerator. Fell in fatigues and sent them over & over the ground picking up and then send long \"waves\" of men through picking up the remainder of the stuff. Camels roaming and bubbling as their loads are put on and the scene is a very busy one. Noticed some of the camels have their tails tattooed like the Cairo donkeys. \n\nA very hot day and a good many water bottles emptied before the march even commenced. Fell in finally at 1130, the N.Z. mounted rifles have taken over & laid down their horse lines. The amount of stuff that a move discloses is wonderful. The incinerator has been a raging furnace all the morning, consuming a lot of rubbish and not a few good things. Rather than carry an extra blanket or their iron rations men will fling these into the fire if not checked. The packs with the roll of blankets and waterproof sheet around them are great burdens and with 150 rounds of ball and a rifle added make the soldiers load of heavy one. \n\nMoved off with our band playing in great heat at 1200 and turned back on Brighton Beach Hog’s Back and the other waste places. Halted for 5 minutes after every 20 minutes marching. Was mounted on an English charger but carried a pack on my shoulders which was a devil of a weight. Along the line of march we constantly passed strings of camels going along with their peculiar swaying gait and with their picturesque drivers. The true Arab wears a coil of horsehair twisted round a head shawl which gives the headdress its burnous look. At Railhead we struck the road and at once the men bucked up and said it was like \"walking on a springboard\". Passed the N.Z. Mounted Rifles Ambulance and also some motor transport. After the yielding sand it was a wonderful relief to get on this good road. No men were allowed to fall out without a signed pass & poor chaps they hailed every passing nigger\n\nSinai\n\n7\/3\/16\n\nwith cries of \"Moya\". They all bucked in & cracked great jokes all the time. Every time they picked up their packs after a rest they made the groaning complaint a camel does when rising under its load, or yelled to each other \"She’s a beauty, feel her weight\". One chap said his brother had a pigeon and sent it from his home right up to Queensland. It flew right back twice so when they caught it they cut its wings and sent it off to Queensland again. The bird disappeared & when they caught it again \nthey\n it had corns on its feet with walking! \n\nWhile we were still about 10 miles out and in blazing heat a flock of sparrows flew overhead towards the Canal. Yesterday I saw 2 crows right out in the desert. One chap said \"A bloke I know has got a good job at Koroit\" \"What is it\" said another private\"\n\n\"Lifting cow dung with a crowbar\"! said No. 1\n\n\"Aw! That’s nothing\", replied the second \"Bill & I have gotter better\".\n\n\"What’s that\".\n\n\"Oh! Bagging up the seagulls at Alexandria\".\n\nThe heat was cruel and the sweat soaked right through the mens tunics and into their packs. The chief topic of discussion was beer in all its phases and all determined on a good blow out. The other longing all expressed was for a dip in the Canal. Still plodding on we got close to Staging Camp, the band now & then playing & making a wonderful difference. Marched the last mile at attention the fellows going along with a great swing and marching splendidly. Passed several N.Z. regiments swinging along in the other direction. Formed double mass on a clear piece of desert near other units and went into bivouac. The QM had a splendid tea ready for the men and there were lollies, fish & biscuits, \"backsheese\". \n\nI write this lying on my belly on the sand at 2130 a candle flickering shielded by a pack & water bottle. Sleeping men lie all around.\n\nStaging Camp Suez Canal\n","88":"\n\nDawn broke foggy and cold and one did not lie long under the blanket wet with dew. Breakfast at 0700 and we found the dew had rusted the rifles completely overnight. All got to work at once and cleaned up and all the blankets and waterproof sheets were taken in on transport wagons. Moved company completely off the bivouac ground and cleaned it up. Inspected the men and roused about untidy packs and buttons undone. The Brigade were side by side in double mass of battalions and the 21st moved off at 0845 followed by us at 0900 to the crash of our bands. Our camp was right up against the side of the Canal along which run trenches which we veterans laughed at well knowing a few 75’s would have knocked them to hell in no time. In rear of the camp was one lonely Muslim tomb with its double tombstones and raised mound of brick.\n\nBird was round with all our transport wagons. Swung out of camp in column of fours with band playing and crossed the canal on a pontoon bridge which swayed a bit. My horse was a new one and took some managing. The waters of Lake Timsah sparkled blue in the hot sun and the warships lay off at anchor, we passed a good many naval men, and some marines in their round caps. A number of aeroplanes were up and the men of the Royal Flying Corps were in prominence in their close fitting uniforms. Our fellows call them \"the angels\". Along the avenue into Ismailia a fine ashphalt motor track shaded with beautiful Ceylon bean trees and bounded on one side by the Freshwater Canal which Joseph is said to have built. Motor transport and trucks passing us, the fellows sweating under their heavy packs but going with a splendid swing whenever the band struck up. The cornet player was nearly done but kept going. \n\nIsmailia – Moascar\n\n8\/3\/16\n\nPassed a travelling workshop with electrical lathes &c and also extensive ordnance stores very prettily situated amid a wealth of tropical vegetation. Carloads of tibbin passengers driven by their Indian drivers and one wild looking Indian sitting on a camel made a good picture. The waterfront to the lake is bordered with small bathing boxes and boat houses. The avenue takes a curve where gardens are situated – a few old monuments and other stones among the heavy foliage which is mostly Cingalese in nature. Some fine houses with blazing purple bouganvillias covering the walls and garden shrubs. In one corner of a garden was a clump of cocoanut trees almost covered with this beautiful plant, - the smell of tuber roses was in the air and the blaze of the sun made the scene one to remember. At each of these residences they have a good many native servants some gardening, cutting grass &c others acting as boabs (watchmen or doorkeepers). At the top of a date palm was a native gathering the fruit. This particular part of Ismailia is a paradise of green and a sheer riot of color that was a joy to us after the bare waste of desert of the last six weeks. \n\nSeveral bodies of New Zealanders on the march passed us and a motor ambulance full of French nurses in odd Dutch caps – \"withered beldames old and drawn\". Some houseboats on the canal hereabouts. We then passed through the quartier Arabe with all its native life and native filth. A mosque dominating the quarter. Natives with their arabeas, wicker cages & baskets \"eggs acook\" & \"orankis\". Little nigger children boys and girls running along by our band wearing little skull caps, - some of them mites not over four years old. Veiled women passing in the streets noisy idlers in the Arab cafes and donkeys. Noticed one tiny little girl playing in the dust utterly rotten with syphilis the flies were clustered upon her sores and then clinging in the eyes of others. These kids were eating a meal of beans awash in what seemed to be dirty dish water.\n\nMoascar\n\n8\/3\/16\n\nCivilians appear to be at a discount, Ismailia is thronged with troops, British & Colonial! Leaving the town we plugged along through heavy sand for about 2 miles and through hundreds of tents moved to our camping ground and compactly piled arms. After lunch a party marched down for a swim. We picked up 2 officers & other details there and later erected some tents and settled down. We are only here for a few days leaving soon for Europe. All the other battalions of the brigade are camped here too. Some backsheese at the QM’s store and new hats of which I got one. Paid Alderson 75 p.t. for snaps and Conway 50 p.t. for a \"gorblime\" cap. Prices in Cairo are graded according to rank. In a bagnio a Lieut has to pay 5 p.t. for a whisky a Captn. 10 and a Major 15 p.t. Such rooks! \n\nIn my company are three jockeys, Snowden McMullen and another, little stunted weeds who cannot keep up with the others when marching but are good little soldiers who do their work well and give no trouble. \n\nThomsen’s story of J.Thomas at the lats.\n\n\"Gimmee piece of paper.\" Carl duly handed same up\n\n\"I wonder how far it is out to the b – warships\" 3rd party \"As the crow flies?\"\n\nJ.T. (after much deliberation) \"F—the b—crows!\"\n\nNo wonder women are such a power in diplomatic circles. All movements of troops and location of officers and their abilities, ups & downs & questions of command are freely discussed and in an officer’s azbacia one can in a few minutes obtain from the residents there a surprising amount of confidential and accurate news. \n\nRecalling the fleas and lice in Gallipoli dugouts there were nights when in agony one would get out of bed and walk the trenches. The fleas used to draw blood and one would toss & turn, positively hurting oneself in tossing from side to side. Some beer going round the lines tonight after our exile in the wilderness and a good deal of singing. Trains passing and an occasional glimpse of a civilian remind us we are near civilization. Bed 2100\n\nMoascar\n","89":"\n\nReveille 0600 physical drill and after breakfast carried on with platoon drill & rifle exercises. After lunch company drill and rifle exercises. Most of the men who have been in details are quite out of practice in handling the rifles and show up to great disadvantage compared with the others. Drilled east of Camp on desert near railway signal box. Trolleys are pushed by a nigger who runs along on the rail the road examiner sitting on the trolley with his umbrella up. Niggers round selling \"Eggsacook big one\" and \"Baa per\". Put up some tents during the afternoon. \n\nThe camp at dawn this morning was thickly strewn with beer bottles and the physical drill parade was a heavy one with slow moving \"soreheads\". Skene Smith took in our details to draw their high velocity rifles. Reported today that our siege battery has been in action at Verdun. No leave to Ismailia but big parties are being marched down to Lake Timsah for swimming. Several trains full of soldiers in open trucks passed during the afternoon and one full of Indians. Bugles sounding all round in the camps and a very pleasing sound it is after being so long without ours playing. \n\nThe freshwater canal runs just in rear of camp and although the Canal cannot be seen the large sails of the canal boats stick up high and have the appearance of protruding right out of the desert sand. Had an injection of serum against parathyphoid and not feeling very well got from Dr Craig at the same time two No. 13’s. Great amount of beer flowing tonight, all the pioneers drunk as Lords and not in a fit state of sobriety to change over their tents!\n\nMoascar\n","90":"\n\nFeeling very unwell after my inoculation. At 0830 took the Company down to Lake Timsah for a swim. Over a pontoon bridge through irrigated plots along the sandy. High sand bank leaving a narrow beach. The lake a fine wide one with salt blue water. A monitor and other war vessels lying at anchor. The North edge of the lake fringed with palms and other tropical vegetation above which rises in the distance the minaret of the Ismailia mosque. The water deepens very quickly and a few paces out takes one well out of depth. \n\nAfter a pleasant swim all hands basks on the beach for an hour lousing themselves. A launch running round the lake on patrol duty. A captive balloon and several aeroplanes up. The other day an aeroplane alighted near two of the men out in the desert and brought them in as passengers & so saved marching. A picturesque crowd kept passing on the narrow beach of the lake, camels with the loads donkeys almost hidden by loads of green stuff and robed people coming and going. Boys selling \"eggsacook\" & \"orankis big one\". \n\nReturned via DHQ to lunch & afterwards all the men were inoculated against parathyphoid and had the rest of the day off duty. Interviewed the Brigadier with regard to transfer to the 53rd but being up against the government all the way, do not expect to go. Received a wire from Colonel Norris offering me the appointment of second in command to him. What a pity it did come a week ago! As it is I shall almost certainly have to remain on here in an inferior job without promotion. Brigadier is to see the General tonight. My batman Spendlove after being absent all day turned up hopelessly drunk at night and fell asleep on my blankets while trying to make bed. Kicked him out & will sack him in morning.\n\nMoascar\n","91":"\n\nNo physical drill parade owing to all being hors de combat from inoculaton. Morning parade kit fitting and finding how to make the equipment comfortable. In the afternoon prosecuted in the case against Mouritsen charge of fraudulently altering his pay book. The Court Martial found him guilty! On the evidence I would have discharged him. Military justice is rough and ready.\n","92":"\n\nSpendlove sober again. Up at 0700 and shaved the Company fell in at 0830 and marched to a siding at the Moascar station. All the men stripped naked there and got into their greatcoats. Their lousy clothes and blankets were all tied up into bundles and put into a closed truck attached to a locomotive from which steam was pumped into the truck. After boiling for 40 minutes the greatcoats were put in. The mens tones of commiseration for the lice were amusing. \"Poor bastards\" was the general expression. \n\nThe Egyptian State Railways is a splendid institution, admirably run. The whole service is marvellously up to date and efficient. The express trains are splendid, the clerks smart and the nigger engine drivers in their fezs as good as any. The railway yards are very big and big stacks of stuff about. The large camps look very neat & comfortable pitched on the bare desert, the fringe of palm trees and other vegetation on the irrigation canal make a welcome relief to the eye. A great article of diet is Eggs. The natives call out \"Eggsacook\" & \"Eggsafresh\", \"Eggs laid tomorrow\". The paper sellers call out \"Egyptian Mail – a good news 500 Australians killed at Lone Pine!\" \n\nSkene Smith received word that big preparations are being made for our reception at Aldershot. Other furpheys state we are going to Bombay. Aeroplanes alighting just near the sterilizing plant – very pretty descents. The language of the men is filthy but they mean no harm. Sunday today. \n\nMoascar\n","93":"\n\nUp in the dark being Orderly officer got things going early. At 0745 the Battalion marching out with the 21st with transport and pack animals and reaching Ferry Post carried out billeting practise and then returned for lunch. An 8 mile march excellently carried out and the men marched splendidly. A fine day and Ismailia looked its best – there is one brick house with gables and a lovely garden where bouganivillaes are a riot of purple and have covered the date palms with a flaunting cloak of colour. The air full of heavy tropical scents. The public gardens are prettily situated and seem to boast a few old monuments. I should have liked to see these gardens properly but have lacked the opportunity. \n\nNear the A.S.C in among a thick grove a guard of Gurkhas turned out us. The N.C.O stood at the salute like a bronze image and a \"sentry\" stood with his kukri at the carry. A fair number of Indian lancers about who pay compliments by keeping their lances at attention and give \"eyes right\". Noticed that the native women today seemed to be very careless about their viels – a thing they are usually most strict about. In the town we passed a number of French naval officers one wearing a decoration. On Lake Timsah there was a new vessel with four low funnels – a French warship of some size. An ungainly British monitor was also there. The native shawish have often a good string of ribbons for service in Sudan and elsewhere. \n\nIn the afternoon we fell in at 1430 and I gave a lecture on Billets and some points on French Army ranks &c and Intelligence. All the lads look forward to moving. Bazeley went to Alexandria today as our advance officer and the Brigade Major also. Received notification that G.O.C will not approve re 53rd so finish there. Great expression by Mesdames when challenged by picquet \"Escari mafeesh\" (Soldier finish). The 7th Bde were addressed by General Birdwood today and leave tonight. We are ready to move at short notice. We are well seasoned troops now.\n\nMoascar\n","94":"\n\nPhysical drill parade getting slack owing to a lack of knowledge by the junior N.C.O’s. Will fix definite programme daily. Was a member of a Court Martial which sat all day and we tried and convicted four men. One was a splendid specimen physically wearing a fine string of ribbons, the two South Africans, Ashanti India and Sudan and one nonfighter. A tiring day hearing evidence. \n\nAt 2000 the Battalion marched out to take up an outpost position about ¾ mile away. It was moonlight and the men formed mass first without a sound and whispered words of command. Moved off similarly and our march could not have been more silently carried out. The column swung along without a scrap of noise and then we were met by guides who took us to the relief of the 21st. Told off picquets & groups and then inspected the position. Returned 2200 most noise made by rattle of entrenching tool against bayonet, - remedy tie piece of cloth round bottom of bayonet. \n\nElmiger remarked to Craig that the English look upon us as half savages and ready to go along whooping wildly. \"Yes\" says Elmiger \"they expect to see us behind bars\".\n\n\"Well\", said Craig \"Won’t they all be behind b—bars.\n","95":"\n\nA quiet day. Sitting on a Court Martial all the morning. Half holiday in the afternoon. Major Conway & Capt Craig warned to report to Intermediate Base probably return to Australia. Furphey we move 48 hours hence. R.S. up at Le Caire today. Drew a good pair of Zeiss glasses from Q.M. magnification 8. Notice a tremendous improvement in the discipline and bearing of men. The drill we have been having has the effect of stiffening them up. They salute with military precision and walk about stiffly turning sharp. Heard Kennedy does not come and Mac. takes second in command with Curnow crowned. General Legge and Birdwood inspected today to a smart march past. Bugles & trumpets sounding gladden one’s heart. Artillery have a good band, our too shrill.\n\nMoascar\n","96":"\n\nBayonet fighting first parade. Purkis a character to look at, has been with the coy. since the start but is a clumsy character who will never be smart. After breakfast went over to 5th Bde HQ. as witness on Court Martial, General Holmes President. Very hot in the sun in the morning. Spent the afternoon at the same place. Our soldiers very smart especially at saluting – quite a change. Aeroplanes starting and alighting very skilful. Roberts left today for 53rd. Roth probably going to Pioneers soon. 5th Bde leave tonight, tip we go on Sunday next. \n\n"}}