{"Document Name":{"0":"Diary_0084","1":"Diary_0084","2":"Diary_0084","3":"Diary_0084","4":"Diary_0084","5":"Diary_0084","6":"Diary_0084","7":"Diary_0084","8":"Diary_0084","9":"Diary_0084","10":"Diary_0084","11":"Diary_0084","12":"Diary_0084","13":"Diary_0084","14":"Diary_0084","15":"Diary_0084","16":"Diary_0084","17":"Diary_0084","18":"Diary_0084","19":"Diary_0084","20":"Diary_0084","21":"Diary_0084","22":"Diary_0084","23":"Diary_0084","24":"Diary_0084","25":"Diary_0084","26":"Diary_0084","27":"Diary_0084","28":"Diary_0084","29":"Diary_0084","30":"Diary_0084","31":"Diary_0084","32":"Diary_0084","33":"Diary_0084","34":"Diary_0084","35":"Diary_0084","36":"Diary_0084","37":"Diary_0084","38":"Diary_0084","39":"Diary_0084","40":"Diary_0084","41":"Diary_0084","42":"Diary_0084","43":"Diary_0084","44":"Diary_0084","45":"Diary_0084","46":"Diary_0084","47":"Diary_0084","48":"Diary_0084","49":"Diary_0084","50":"Diary_0084","51":"Diary_0084","52":"Diary_0084","53":"Diary_0084","54":"Diary_0084","55":"Diary_0084","56":"Diary_0084","57":"Diary_0084","58":"Diary_0084","59":"Diary_0084","60":"Diary_0084","61":"Diary_0084","62":"Diary_0084","63":"Diary_0084","64":"Diary_0084","65":"Diary_0084","66":"Diary_0084","67":"Diary_0084","68":"Diary_0084","69":"Diary_0084","70":"Diary_0084","71":"Diary_0084","72":"Diary_0084","73":"Diary_0084","74":"Diary_0084","75":"Diary_0084","76":"Diary_0084","77":"Diary_0084","78":"Diary_0084","79":"Diary_0084","80":"Diary_0084","81":"Diary_0084","82":"Diary_0084","83":"Diary_0084"},"Date":{"0":"unknown","1":1145.0,"2":1146.0,"3":1147.0,"4":1148.0,"5":1149.0,"6":1150.0,"7":1151.0,"8":1152.0,"9":1153.0,"10":1154.0,"11":1155.0,"12":1156.0,"13":1157.0,"14":1158.0,"15":1159.0,"16":1160.0,"17":1161.0,"18":1162.0,"19":1163.0,"20":1164.0,"21":1165.0,"22":1166.0,"23":1167.0,"24":1168.0,"25":1169.0,"26":1170.0,"27":1171.0,"28":1172.0,"29":1178.0,"30":1180.0,"31":1181.0,"32":1182.0,"33":1183.0,"34":1184.0,"35":1185.0,"36":1186.0,"37":1187.0,"38":1189.0,"39":1190.0,"40":1191.0,"41":1192.0,"42":1193.0,"43":1194.0,"44":1195.0,"45":1196.0,"46":1197.0,"47":1198.0,"48":1199.0,"49":1200.0,"50":1201.0,"51":1202.0,"52":1203.0,"53":1204.0,"54":1205.0,"55":1206.0,"56":1207.0,"57":1208.0,"58":1209.0,"59":1210.0,"60":1211.0,"61":1212.0,"62":1213.0,"63":1214.0,"64":1215.0,"65":1216.0,"66":1217.0,"67":1218.0,"68":1219.0,"69":1220.0,"70":1221.0,"71":1222.0,"72":1223.0,"73":1224.0,"74":1225.0,"75":1226.0,"76":1227.0,"77":1232.0,"78":1233.0,"79":1234.0,"80":1235.0,"81":1236.0,"82":1237.0,"83":1238.0},"Entry":{"0":" \nThe Bugle\n After a good \nnights sleep\n days excitement I was tired & slept like a top & awoke at the Bugle Call at 6 am ","1":" after rolling my blankets in my hammock I put them away in the place set apart. The Weather being fine but still a large number were sick & laying about every where. As there were no Parade I amused myself playing Draughts & Cards & walking about as I am a fair Sailer I symphasised with my less fortunate friends. I must say a good word for the Catering, we could not wish for better food, we get Sausages for breakfast & stew in turns also Porridge & Roast Beef or Mutton with Peas or Haricot Beans & Potatoes foe Dinner for Tea it is Bread & Jam & Butter\n\nalso cheese. Passed a Hospital Ship at 10 am going North I Presume to Colombo. An Event Boat they say. We had a Impromtu Concert in the Evening & it was very successful & turned in at 10 Pm. Awoke next morning at 6 am","2":" & had a good Breakfast, all my Sick friends were fairly well & as the Weather was still fine it was very pleasant on board. In the afternoon there was a parade & each man had to come on deck with his life Belt on & instructed what to do in a case of an alarm. Another Concert in the Evening & then to byebye. \n","3":"\n\nAll hands up at 6 am. The Weather being still fine & the Sea Smooth all hands enjoyed their Meals & the Sick were their old selves again. We were handed out our pay books out & told not to lose them as we could not secure any Pay if they were lost. We had Roast Mutton & Potatoes & Peas for\n\nDinner & it was real good & Plum Pudding. We were paraded at 2 Pm & had Physical Exercise & Boxing contests. I enjoyed 3 Rounds with a Fireman from N.S.W. it woke me up as I was getting very stiff. After Tea another concert was given & it was enjoyed by all hands. \nDin\n Turned in at 9 Pm as the Weather had changed & it came on to Blow & rain commenced to fall, all hands who were sleeping on deck were ordered down below. During the Night I awoke up twice & the Good Old Ship was rolling very much.\n","4":"\n\nUp again at 6 am. Had Porridge & Stew for Breakfast. The Weather was very Wet & Windy & the Ship rolled \nvery mu\n & dipped very much\n\nmaking a lot feel off colour. The Men laying about every where. I joined a Card Party & had a game of Euchre, 2 a side, owing to rough Weather we were all allowed to remain in our mess rooms, at 10.30 am Officers Inspection took place & as every thing was spotless there were no complaints. In arranging for Mess Orderlies \nto\n for each Mess two New Volunteer for the Voyage & we pay 1\/- Per week each which amounts to 7\/- each Orderly & their duties are to Keep the Table & Crockery & utensils clean, draw dry rations, lay the Table bring down the food from the Cooks Galley, cut the Meat & serve it out, clean off & sweep up. In our Mess we have two good men & they take a great interest in their work & we are all satisfied\n\nWe had Soup, Corn Beef & Potatoes and Beans for Dinner. During the Afternoon I got on the lea Side of the Boat right Aft & had a pleasant sleep in the Sun. During the Afternoon I paid my first Visit to the Canteen & was surprised at the reasonable rate for Tobacco, Biscuits & Drinks, Cigarettes are sold at 2d Per packet of 10, Havelock at 4 oz for 1\/-, \nmy\n Enjoyed a game of Draughts before Tea & then I had 30\" Exercise on the Bridge, Walking up & down with a Chain, at 8 Pm Hammocks are drawn & then comes the Fun, all are busy in slinging them except the ones who sleep on the Floor. Myself I sleep on the floor near the staircase, place my Hammock on the floor & a Blanket & then use my Boots & Leggings with my clothes for a Pillow, using the other \n\nblanket & my Overcoat for a Covering. It was very amusing when Hammocks were drawn as some of the Lads who Slept up on deck last Night got their Blankets wet & were \nput\n left there & the Ship’s Police collected them with the result that they had none to sleep on & took somebody else’s Kit & then the fun started. All Hammocks have our name & numbers on & one lad had another & turned the Hammocks inside out & swung it bye & bye down came the owner & knew his hammock & as the lad would not get out of it, he was pulled out on top of some lads who were sleeping on the floor underneath, then there were a general mix up for a while, we all enjoyed the fun. All was quiet at 10 Pm.\n","5":"\n\nUp again at 6am & had a promenade\n\non deck & was late down for breakfast in fact the lads had their second helping of Tripe which was A.1. & me being late, I had to be satisfied with a small allowance. They all barracked me so I must be more punctual in future. After Breakfast I visited two friends in Hospital both were down with Sea Sickness, they had been in bed since the day after our departure, still they are slowly improving. The Hospital is situated under the Poop Deck & has 40 Cots provided for patients & everything is painted White & spick & span, there are 8 A.M.C. Orderlies who came from South Australia & as we had 12 A.M.C. boys from Western Australia they all joined up together. Dinner time came round & we had Roast Mutton\n\nPeas & Potatoes & it was very nice & all enjoyed it. After we had a meeting in our mess room to form a Sports Committee to arrange for contests against other Units, to be decided during the voyage. After that our Officer Commanding our Corps came down & allotted our positions in Boats & Rafts in case of emergency. Our Mess was detailed for a Raft on the Well Deck. When Tea was over the 9\/51st Reinforcements gave us a Concert which passed off well \ntill Be\n also there were Boxing Contests which is always amusing. Bed Time came round all hands turned in. After a good \ntime\n night’s rest awoke again at 6 am.","6":" I had breakfast at 7- was of Porridge & Fried Chops & after wards it being our first Sunday on board a church parade was\n\n4\/2\/17 Sunday\n\nheld in our Mess Room & it was crowded with the boys, \nthe Officer\n The Lieut Colonel, Chief in Command & his Officers was present also two Red Cross Nurses which were the first time we had the pleasure of their company, & they were two pleasant looking ladies & caused quite a stir amongst the Boys. During the Church Service the Chaplain took for his lecture the beginning of things & quoted the life of a Soldier & asked us to think of our folks at home & to play the game & act up to our traditions, after the Service the Lieut Colonel gave us a lecture on Dicipline & expressed his pleasure of our conduct & trusted that we will carry on in the future as we have done since we have been on board. Dinner \n\nduly arrived & we had Roast Beef, Cabbage & Potatoes & Plum Pudding. After \nour\n Dinner was the usual promenade & forming into Groups & discussing different Subjects. A Gramaphone was brought down to amuse those who stayed in the Mess Room & as there were a number of latest Solicitations all the boys down below enjoyed it. After Tea there were a Service Conducted by \nthe Y.M.C.A.\n Mr Manning who represents the Y.M.C.A., Pieces of Paper with Hymns printed on both sides were handed around. The Music was supplied by Three Violins, one Clarionet & the Piano. While I am on the subject of the Y.M.C.A. there is nothing else but Praise for their good works. They supply us with writing Material also\n\nMagazines & also a Library of Books which are handed out on application. The Gramaphone was playing down below until bed time. All hands turned in at 9-30 am & silence reigned supreme once more.\n","7":"\n\nUp again at 6 am had Curry & Rice for Breakfast afterwards teams for the Tug of War were picked & practicing \nheld\n all the Morning which caused a lot of excitement & enjoyed by all hands, the Teams picked were all about the average weight & there were fair contests. Dinner time arrived & we had Stewed Rabbit which was a luxury & it was enjoyed by all, after a Smoke we were paraded at 2 Pm for Drill on the Bridge Deck., all privates on end & Non Com’s \n\nthe other end we formed up two Deep about 20 in Peace Squad & after light Drill such as Right & Left Turn, O Grady Drill was indulged in. In describing O Grady Drill, we form up two Deep & the Officer instructs us that only orders that O Grady gives are to be carried out, for instance, O Grady says attention & we spring to attention, As you were is the next order, & If we make any movement we are out & stand aside every order must be O Grady first, it causes a lot of fun & very hard to do as the orders are so quick one is liable to make a mistake, after we are tired of this Drill we all sit down in a Circle & one man stands in the Centre & folds his arms & keeps himself Stiff & falls over on to our hands & we pass him Around\n\n& around & if one man allows him to fall down he has to take his place this game is a favorite pastime. After Tea our Corp gave a Concert & enjoyed by all, we have some good talent although only about 25 % gave an item, our next concert others will assist. Light’s now go out at 8.30 Pm & all the Port holes ar closed up tight as I believe we are now in the Danger Zone, as \nwe\n to where we are, nobody nows for sure. The Weather has been Cloudy & Drizzly days & we will all be glad when we have some Sunny Weather. Lights out at 8.30 Pm was to early for us all so to amuse ourselves in the Dark, some of the boys started imatating the Fowls, Ducks & Cattle it was very amusing\n\nbut still a little of that goes a long way so a lot of the Boys counted them out, that is they count, 1. 2. 3. 4. 5. 6. 7. 8. 9. & then Out which means (stop it). Gradually they all settled down & went to sleep, during the Night I \nwas\n awoke up by one of the Boys shouting in his sleep as if he was having a bad time or a Sub-Marine had got him, he must have had a bad Night Mare anyhow some sang out to him to drop it & again all was silent.\n","8":"\n\nAll hands up again at Bugle Call & found the Weather Cloudy Windy. Sausages was served up for Breakfast & relished by all. Sports started at 10 am & was \nh\n held on the Bridge Deck. I was unable to see them as it was\n\nour Washing Day. The Boat has square tubs fixed under the Wash Basins, which are lifted up Frame and all & hooked on to a Frame in the Wall & there is about 30 of them so when all are in use things are busy. There were lines supplied \nat\n right Aft on Top but these were not enough so a lot of us had to use parts of the rigging, also it is necessary to sit & watch ones Clothes while they are drying otherwise they are liable to be Stolen, it was amusing to see all of us sitting down reading & keeping a Watch. I had my all dried about 2 Pm. Had Roast Beef, Potatoes & Peas for Dinner & had a look at the Pillow Fight in the Afternoon which was amusing. A Pole \nwas\n 1 ft\n\nin Diameter place across the Deck & Mattresses underneath & the Boys each with a Pillow had to sit astride of the Pole & on a signal given had to hit one another until one fell of or around the Pole & then the other lad hat to beat him off to win, the Winner proved to be a burly Chap from our Batt & he kept his balance well, in fact his opponents made little impression when hitting him, he was to big & heavy to knock off.\n\nAfter Tea another Concert was held & enjoyed by all who attended. All hands amused themselves, one way & another until bed time. Lights out at 8.30 & all was quiet.\n","9":"\n\nUp again at 6 am, Weather Wet & Stormy in fact it was the worse\n\nday since we left Port. Raining & Blowing & a heavy Sea running, our Good Ship made very little progress Against the Elements, Seas were breaking over her all day. Another Company held sports which I attended & it was interesting. The Tug of War was easily decided by the side which got the first pull on swing to the Deck being Slippery. The next item was the Bun Contest There were 19 lads to 18 Buns which were tied up to a rope & each man with his hands tied behind his back had to bite the bun & get it off the String. The Winner bit the Bun off the String & knelt down & dropped it on the Deck & had to lay down & eat it from off the Deck when finished he had to show \n\nthat he had swallowed it all. The next contest was 8 Rope Quoits were place in a line & there were four lines & for tryers who had to run up & bring one down & put it on a peg & then another until his eight quoits were place on the Peg, the Winner proved to be a Corporal who was very fast & good on his feet, some in their excitement fell over & others missed the Peg, after this Dinner was on which consisted of Soup & Roast Mutton Potatoes & Pumpkin as the Weather too rough the Sports were posponed till later on. All Lad were down below Card Playing & Draughts were played until Tea Time & until Bed Time.\n","10":"\n\nAll hands astir at 6. am. I went for a promenade until Breakfast\n\nwhich consisted of Porridge & Sausages. After a Smoke, the Siren was blown which meant the Alarm & all hands had to proceed down below & put out their Lifebelts & stand to attention until ordered up to their Stations. I was having a \n\n read right Aft on the Boat Deck & I had to hurry down when I found all hands below, having adjusted my life belt the orders were given to proceed up in the order of our Messes on arrival on the Well Deck we had to stand two deep near our Raft After all hands were inspected we were marched down below & after Stowing our Belts we were dismissed for the day. \n\nThe day passed of fairly well although the Weather was only fair. We had Pea Soup & Corn Beef\n\nfor Dinner during the Afternoon I had a Read of my Book also a Nap although Sports were being held on the Bridge Deck I felt more inclined to have a Snooze. After Tea I partook in a friendly game of Bridge until Bed Time. Lights out at 8.30 Pm & all were soon asleep.\n","11":"\n\nAs I was not too well I will pass on to the Next Day.\n","12":"\n\nUp at 6 am & after breakfast of Porridge & Tripe we received orders tp put on our life Belts & stand to our Mess Tables & await orders to proceed up on deck, it was done to see how long it took us to come up & fall in our places afterwards we were dismissed & had to remain on Deck until Inspection by the Ships \n\nOfficers, the weather was very cold & Drizzly Rain was falling in fact we must be well down South as we have had very little Sun this week we will be all glad when we change our course & get a little more Sun. When it is cold & wet it is very miserable up on deck owing to the large number of Troops on board there being no place to sit & be comfortable. Dinner time came around & we had Barley Broth Roast Mutton Beans & Potatoes. After a Smoke I had a Delightful Hot Salt Water Bath, having bought a Cake of Salt Water Soap which will lather in the Salt Water I hope to visit that Bathroom very often although one has to wait his turn as there is only one Bath provided, of course there \n\nis plenty of Cold Showers available. After Tea the usual Concert was held & in due course lights were out.\n","13":"\n\nAll up again at 6 am & as the usual routine was gone through I will now skip to the day of our arrival as from the","14":" until the","15":" there were no thing startling to report \n","16":" \nMonday\n Wednesday\n\nAll hands astir at 6 am & after Breakfast all hands started cleaning the Boots & Leggings as we knew that we would make Durban during the afternoon.. After Dinner we were Ordered to dress & parade on Deck, which was duly carried out. Excitement was very high as we were anxious to have a run ashore, we were told to fall in & Stand to attention & at 3 Pm Land was first \nahea\n \n\nseen right ahead, it was like a Mist & the faint outline of hills could be seen, gradually the land came \ninto\n nearer & I could see a large Range of hills on my left & on the right a lot of Country under cultivation looking very green which I learnt later was Sugar Cane. After picking up a Pilot we approached the Heads & entered into the Harbour. Durban has a beautiful Harbour & is well land locked only a narrow strip of Water at the Entrance it is surrounded by Hills covered with green Trees & bushes & looking very beautiful no time was lost in making the boat fast to the Wharf. It was amusing to see the Black Kafirs running about in great numbers. Tea was served at 4-30 Pm & we were paraded again at 5.30 & was marched ashore at \n\n6 Pm the Town proper is about 1½ miles from where the Boats are berthed so after 20\" walk we were dismissed & told to fall in again at 10.15 Pm & be marched back to the Boat. I met my chum & we took a ride in a Rickshaw pulled by a Zulu, a big black man dressed very peculiar the head gear is made up of all sorts of Colours & \none hor\n two horns protruding out. They are very fleet & their Rickshaws are very light & well balanced they run about all day long & fare is 3d per mile, they hire the Rickshaws for 5\/- per day from what I learnt they make good Money. They trot up & down the Streets making peculiar noises with their mouths & have a small Cow Bell attached to the Shaft. The Main Street of Durban is called West Street & there is a double line of \n\nTrams. It is a very long Street & very wide. Trams run everywhere, they have accomodation on Top as well as inside, Two seats on top are reserved for the Natives, the gauge is very wide. The buildings are very large & stand out well. The Town Hall facing West St & on the opposite side is a square laid out very nice, at the top end of West St is the Esplanade, having met a young lady who took me along the Esplanade where there is Surf Bathing by both sexes also a large Pool for Children. Up above the Esplanade are these deal Hotels for Visitors, who come down from upcountry for the Summer. The Buildings & Conveniences are laid out beautiful & are admired by all. After thanking my Lady Companion for escorting me around I made my way back \n\nto the Boat, & turned in.\n","17":" ","18":"\n Friday\n\nAfter a good nights rest all hands were up at 6. am & the Morning was occupied in Cleaning Clothes & Boots for a Rout \nine\n March. Fall in was announced for 11.30 am & at 12.15 Pm all the Troops were line up on Shore \nat\n & at 12.30 the March was commenced down the Point Road & into West St & down along the Esplanade to a point opposite the Imperial Camp. The Weather being very hot & close we were glad to arrive at our destination, we were dismissed at 1.30 & was told to fall in again at 2.30 for final dismissal for the day. A large number of the Troops\nwaited there\n went to the Dressing Rooms to prepare for a dip in the Surf. I & a Chum took a Tram & went\n\nup for a run in the Hills getting back in time to fall in. This over I had a dip in the Briney which was A.1. After Dressing & a Drink in a Cool Drink Shop my Mate wanted to remain there so I left him & took a Tram to the Zoo. On my journey a Lady spoke to me & invited me to her home for Tea & spend the Evening which I duly accepted. On arrival at the Zoo I took leave of my Lady Friend & had an Interesting Stroll for 1 hour viewing the Animals & Birds, the Zoo is small but is laid out beautiful on a sloping hill facing the Ocean. Every thing being green & well attended to. A large number of Natives are duployed as Gardeners & Attendants & they all do their work well. After satisfying my Thirst I came\n\nout & waited for a Car. While I was sitting on a Seat alongside the Tram Line another Lady asked me if I enjoyed the Scenery & seemed anxious to know about Australia so I had a long chat with her, we joined a Tram together & told me about different points of interest while we were getting back to Town. The Journey to the Zoo is 2½ Miles from Town & the fare is 2d & the return Journey 2½ miles practically a Circle is made up through the Hills amongst beautiful Residences & Gardens. There are very few fences in front of Houses mostly Hedges, the same between the Houses. The Houses are built of brick & high off the Ground as I am told the White Outs are very bad in Durban. In Town & Suburbs a lit up with Electricity & look Beautiful of a Night\n\nAfter bidding Good Bye to my Second Lady Companion I went into the Wesley Hall where Refreshments are provided by Ladies of the Church which is very kind of them. I had a Cup of Tea & a Sandwich which are provided free. The Ladies of Durban are very kind to us, & try to make us feel at Home. After a Wash & Brush Up in one of the Municipal Lavatories which are built in several places for both Sexes & are up to date & very clean, I took another Tram to Stamford Hill which is in another direction I think there are about 7 or 8 different Tram Routes. I \nwas\n asked the Conductor to put me down at Sutton Park Having been given a Card instructing me where to go I left my Card & had no difficulty in finding the address\n\nAs soon as I turned into the Avenue I looked for No 42 & found my Lady Friend out at the Gate to meet me, her name was Mrs F Jones & when I went inside of the Gate, her husband came out to meet me. I introduced my self to them & was escorted inside, they have a very nice home & nicely furnished, Real Australian style which I soon made myself at home. They both were born in Victoria, Australia. Mr F Jones is an Electrical Crane Driver in the Natal Government Workshops & my occupation being Locomotive Engine Driver, it was right into my line. After Tea which I enjoyed I amused myself on the Piano Singing & Playing. They have one little Girl aged 7 years & very sweet & between Colours. After long Chat I had Supper & the time came to \n\ntake my departure. I was given several Illustrated Papers, & invited to Tea the next Evening which I could not accept. If I could have had the time Mr Jones was going to take me over the Hill at the back of their House to see the Monkeys in their wild State which I \nwas very disappointed\n could not accept also. After thanking my Host & Hostess for their Kindness I promised to write later on I caught a tram back to the boat. On inquiry I found that wages were slightly higher also Living was a little higher than Western Australia, Fruit very scarce, Apples 2\/- a dozen, Bananas were 6d a dozen Pine Apples 2d each, & fairly small, the latter Fruit very plentiful. Clothing & Boots are on a level with W.A. The Ladies of Durban were very anxious to have us in their homes as I found out that\n\nseveral of our Troops received an Invitation out to their houses which they accepted. Having arrived on board at 11 Pm I turned in being tired after my day.\n","19":" \nFriday\n Saturday\n\nAll hands astir at 6 am. Orders were given out that Routine on board would be the same as at Sea, which meant no leave ashore. We passed the day watching the Kaffers Coaling the boat also the Hindoos selling Pineapples to the boys, they buy them at 1\/- a dozen & sell then at 3d each. It was very amusing watching the White Boys taking the Pine Apples out of the Hindoos baskets & throwing them aboard. They did not try to stop them. They were doing well out of what they sold. We left the Wharf at 4 Pm & Anchored in the Harbour till after Six & then a start was made\n\non our Journey. The Weather all day was very Muggy. A Thunderstorm was working up which broke during the Evening. The Lightning was beautiful like Skyrockets breaking in the Sky. I never have seen any thing like it in W.A. It was raining all night but the Sea was smooth. Lights out again at 8.30 Pm so all soon was quiet.\n","20":"\n\nAll hands astir at the usual time. The Weather has cleared up & it was very pleasant all day. Land could be seen during the day & at night a Lighthouse could be seen, I believe it was \nA the\n East London. Church parade was held on the Well & Poop Decks at 10 am & was well attended. Had a very nice Dinner of Roast Mutton, Potatoes\n\nand Peas also Plum Pudding for desert. A lot of lads were busy writing letters home in the Afternoon as the mail closes at 4 Pm. The usual evening Song was held by Mr Manning of the Y.M.C.A. and a large number of Boys attended. Lights out again at 8.30 Pm & soon all was asleep.\n","21":"\n\nArose again at the usual hour & as we anticipated making Capetown all hands were anxious after Breakfast Land was sighted very faintly which caused great excitement. The Table Mountain which Capetown is noted for was seen away on our right. Land was in view practically all day. After dinner our course was altered & gradually the outline of Capetown came into view, there is no mistake Table Mountain & other \n\nMountains make a beautiful View from the Sea, as the Weather was fine & Sea smooth the Passage in was done in good time. Capetown Lies at the foot of the Table Mountain which is protected on the right by smaller mountain called the Lions Head which no doubt is true to name. I noticed that if there were any clouds about they were always hanging over the Table Mountain making what is commonly called a Table cloth & as the Atmosphere is warmer on the Town side the clouds as they come over the Top they seem to evaporate. We dropped Anchor in Table Bay at about 5 Pm & remained for the night. After dark when the Town was lit up it was a magnificient Light from the Boat, & was admired by all. As lights were not out until\n\nlate all remained on deck \nfairly\n a good while \nuntil\n after bed time.\n","22":"\n\nAs we were having breakfast next morning we came into the Harbour & tied up to the Wharf, although it is only a small harbour the way it is constructed it can accommodate a large number of boats, and it was fairly crowded with overseas Steamers. Parade was ordered for 11 am & at 11-30 we were marched ashore & up to the Town & before we were dismissed we were told off in parties of six & instructed to remain together all day which was not carried out. The Wharf Lies about 1½ Miles from the Town proper. As soon as \nth\n we were dismissed we all strolled up the Main St. called (Adderley Street) which is fairly long but not wide. The Trains start from this Street\n\nfor all directions, but first move was for Dinner & after a little while our party which I was in charge off came across a Dining Room & soon \nwe\n the under man was satisfied. Afterwards an inspection of the Main Street was made, & I must give Credit for the way the buildings are laid out some of them are very high 4 & 5 storeys. The Railway Station & Offices are very imposing structures built of Stone, & is in the Main St. The Post Office & the Standard bank of South Africa is likewise both Splendid buildings. Gradually our party got separated & only two us were left, & as we were advised to take a Train ride \nride\n to Camp Bay which is situated behind Table Mountain we soon was aboard a Car, & the Trip was an eyeopener to both of us. The Line winds\n\naround through a number of streets which are laid out well & the Style houses are similar to our Australian houses. After \n30-20\n about 20\" ride we start climbing up the side of the Table Mountain & soon we obtain some beautiful views of the Town & Table Bay we rise up some 800 ft above Sea Level. After the view of the Town from the Bay & then from the Train they both \nform\n make a Sight which is beyond discription & which I will never forget. I notice the Weather there is similar to our West Australian Weather. After attaining the height of 800 ft \nth\n we start going down to the other side & we get a glimpse of the Ocean. After arriving at Camp Bay we all alighted & was directed to the Warm Sea Water Baths which were opened free to the Soldiers & soon we were supplied with Towels\n\n& Costumes & in a few minutes we were enjoying a swim. The Water is kept warm by inflowing hot water at the Top & cold water going out at the bottom. The baths were soon filled with Soldiers & all seemed to be having a grand time. After a Swim we were directed to the Free Tea Rooms where Tea & Cake was supplied to the Boys by the People which was highly appreciated after I had a cup of Tea & some cake & thanking the Ladies I caught a Car & continued on my Journey around Lions Head Mountain & after passing through several beautiful scenes made up of houses & gardens we arrived back in Town at 5 Pm after enjoyable Afternoon. After having Tea at the Railway Institute I had to report myself at the Drill Hall for Picket Duty for the Evening walking up & down\n\n& maintaining order & as the Hotels were all closed there was practically no noise & all the boys arrived home likewise the Picket before Midnight.\n","23":"\n\nParade was ordered for 9-00 & soon we were lined up for a Route march around Sea Points some 7 miles. We moved off at 10 am all our Unit & we were marched for 20\" then we had a halt for 10\" this was continued until 12 Midday. The Road around a Sea Point is well made & kept in good order & when we were marching at ease all sorts of Songs were indulged in. We followed the Coast line for about 3 mile, & some very beautiful homes were passed & we were cheered by the Residents & at several places Fruit was handed out to the boys. The Train Line runs paralell with the Road but unfortunately the Coast\n\nis very rocky therefore very little bathing is indulged in. After leaving the Road we turned up a side Street & into a nother Road & followed the Train line into Town & was marched up to the Gardens were we were dismissed at 12-15 Pm. After Dinner several of us adjourned to the Gardens for a Rest as we were fairly tired after our March \nto have\n . The Botanical Gardens are beautifully laid out with Flowers & Palms & Lawns of Buffallo Grass & there are several Hothouses full of Ferns of every description also several statues of Men of Fame, one I noticed was Cecil Rhodes the Great Man of South Africa, another one was of a Gentleman whose name was written in Dutch. The Museum is a splendid Building & contains some wonderful Collections of Birds & Animals also\n\n65\n\na number of Figures of Natives. There is a beautiful Walk alongside of the Gardens about ¾ of a Mile long & is planted with Shady Trees & Seats \nfor\n are provided for the People. This Part is called the Avenue & Parliament House is situated on one side & is another beautiful building. Alongside the Avenue there is provided a place for Soldiers who obtain \nTea for\n a Cup of Tea for 1d in fact every thing is 1d & is all day crowded by the boys. As Tea time came around a large number of the Troops made their way to the Institute near the Esplanade for Tea which is provided Free. There is accomodation for 1000 Troops at one sitting. Great Credit must be given to the Ladies of Capetown for their Kindness in Catering for the Boys. After Tea having bought the Evening Paper I made my way on to the Pier\n\nwhich no doubt is a Magnificient Structure, it is built of Reinforced Concrete Tiles & square Slabs & the Side Walls. There is a large number of Inlets with Seats provided for the Citizens. The Promenade itself is about 1 Chain Wide & about ¼ mile long towards the end is built Tea Rooms & a Pavilion where Band Concerts & Moving Pictures are regularly held a Small Walk of about 4 ft Wide circles around the Tea Rooms & Pavilions & widens out towards the end of the Pier at the end is a Tower where one can get a \nlong\n splendid View of the Town & Surroundings. Under the Tower \na\n is conveniences for Bathers, Costume & Towels are hired for a Small Charge. There is a small Charge of 3d for each person entering the Pier, (Soldiers Free) no doubt to pay for the Work which must of Cost a large sum of Money.\n\nAfter Spending a most enjoyable Evening there I made my way at 10 Pm to the Station for the Dock Train & soon was on board again, after a splendid day.\n","24":"\n\nAll hands up again at the usual hour we were ordered on Parade at 9.30 am & marched to the Oval where Sports were held by several Units on our bot. After a few minutes marching we arrived at the Oval \nanother\n which is laid out well They had a very wide track for Cycle Racing which is sloped fairly high at the ends also a narrow Track for Trotting or other Sports, unfortunately Water being very scarce in Capetown due to a bad Season the Lawn was very dry. The Water is shut off to the residents from 4 Pm daily until next morning. After watching the Sports for a while I caught Train back \n\n6\nto the Town & had Dinner at the Railway Institute where 5 courses are provided for 1\/- it was largely availed of by the Troops it being continually Crowded at \nthe\n Meal hours. During the Afternoon I went for a Motor Ride in the Ambulance Car out to the Military Hospital at Maitland about 3 to 4 miles out, they were taking one of our boys there who was very bad with Pneumonia. On arrival at the Hospital I had a chance to have a look around. It is laid out in blocks & substantially built, they have 1000 Soldiers there in all stages of Sickness, & of different nationality, I noticed a large number of Black Troops, some were in Chairs & others laying about on the Grass. After assisting the Orderly to take our Patient in to ome of the Wards & making him comfortable I came back to\n\nTown, & had Afternoon Tea at the Drill Hall & adjourned to the Y.M.C.A. in Long St for a Read & to write a letter after having Tea at the Soldiers Tea Rooms I spent another Enjoyable Evening on the Pier & arrived back on the Boat at 10.00 Pm.\n","25":"\n\nWhen I awoke next Morning I did not feel to well, having a Head ache I remained on board \nuntil\n although the troops went for another Route March, & after Dinner I dressed & went ashore at 3 Pm & caught a Train a Train & went up towards the Mountains & spent an hour looking down over the Town. On Returning I met a Chum Kept a precious appointment & went out to Tea to a friend of his place, \nI\n a Mr Taylor who is \nin the\n a Black Smith in the Harbour Works. Mr & Mrs Taylor live in one of the Dock Cottages\n\nhaving 2 Rooms down Stairs & 2 Rooms up Stairs they were very sociable People & made us quite at home. After a Splendid Tea, 2 more Soldiers came around also 3 Young Ladies & Mrs Taylor having a Splendid Piano we had a lot of Music. Two of the Ladies played the Piano also Miss Bella Taylor had a good voice & Sang Several Songs, during the Evening we cleared the Dining Room & had several Dances. These Ladies all had some of their People in the Firing Line. Mrs Glover has her Husband up \nat\n in German East & Mrs Wilkins has 2 Brothers one has been Killed & the other wounded in France & Miss Roberts has her intended Wounded & in Hospital in England. After Supper we all had several Games & at 12.20 am the Evening was brought to a close & After Saying Au Reivior & Thanking\n\n \n\nMr & Mrs & Miss Taylor & Ladies for entertaining us so well, we all made our \nb\n way back to the boat. Before concluding my visit in Capetown I would like to mention that on my visits to the Botanical gardens \nI\n it was very amusing seeing the South African Squirrells running about the Grass & up the Trees there seem to be a large number of them, they appear to be very tame & sit on the Limbs of the Trees while you pass.\n\n24\/2\/17. Saturday\n\nAfter we had Breakfast next Morning word was passed around that no leave would be granted so it was taken for granted that we would be leaving the Wharf during the day, as it turned out we pulled off at 12.30 Pm & Anchored out in the Bay during the Afternoon after Tea the English Mail Boat (\n\n Walmer Castle) came out & soon we started on\n\n \n\n7\nour \ny\n voyage, as there were Several Boats going we formed into a Convoy. There were three Boats with Australian Troops on also two Boats with New Zealand Troops on also the English Mail Boat so we formed into a line of ","26":"\n two Deep 3 Boats on each Side with an Armoured Cruiser in the Centre in the Lead, from what I learned we had two Cruisers one on each side about 25 miles off acting as Scouts, Unfortunately one of our Transports could not go more than 10 knots per hour so we had to reduce speed to that Mileage. As there were no concert on Board in the Evening as the part set apart for them was occupied with Coal we had to amuse ourselves in Groups talking of our experience of Capetown and as all lights above were out at 7-30 Pm we all retired to our Troop Deck for the Night\n\n \n","27":" \n\nAs I was told off as Orderly Corporal for the Main Guard I had to report at 9- am at the Guard Room & as there were two Orderly Corporals, one Sergeant & 22 men, we had to remain on duty for 24 hours ending 9 am Monday. I was told off for the first 4 hours although the men were 2 hours on and 4 hours off my position was 4 hours on & 4 off. I had to march my Men off to their respective positions which are all numbered. No 1 position was the Orderly Room No 2 was the Guard Room No 3 was to guard the Lieut Colonel’s Quarters No 4 & 5 was on the top Bridge Deck one on each side No 6 was on the Prison No 7 was down amidships in case of Fire & to guard the Ship’s Stores No 8 was on the Wheel House keeping any unauthorised \n\n \n\nperson away from interfering with the Steering Gear, No 9 was on the 4 Point Gun situated at the Rear of the Ship on top of the Boat Deck, No 10 was down in the Troop Deck \nat\n in case of Fire. This being my first experience of Corporal of the Guard it was quite a novelty also interesting when it came to Evening & being a Dark Ship it was very awkward to march the Relief around owing to the Men sleeping up on deck so it was decided to instruct each man to \nreliev\n relieve his Man & tell him to report back to the Guard Room by that means it was known if every man was relieved, & the Orderly Corporal made an Inspection of his posts in between Reliefs. After being relieved at 9 am next Morning.\n","28":"\n\nI took things very quietly all day, as I was tired after my work.\n\n \n\nAs we have a large amount of Coal stacked on the Promenade Deck on both sides it is impossible to hold any Sports or Concerts & as we have practically nothing to do there is little of importance to nots so I will just mention any thing of importance in brief. On\n","29":"\n\nWe had the pleasure of our 4 Point 3 Gun being fired for the first time since she was placed on board. There was a Target thrown overboard it was a Barrel with a fled Flag attached to it & the first Shot fired off just went over the Top & the second hit it fair & blew it to atoms. The Omral who is steaming on behind us had her practice on Friday & the Malwar Castle \nstea\n who is\n\n \n\nahead of us steamed away on our \nright\n left & being to far away I could not see her result but this I do know just as she started Firing her Gun Our Alarm sounded it was 4 Pm so I had to hurry away to fall in at my post with our Life Belts on, I might mention here that we have to Carry our Life Belts with us every day & if we leave it down stairs the Military Police stop us & order us to go & bring it up, it is necessary in case of a raid of any description. There was one incident worthy of note & that was one of our Fireman attached to our corp is very Stout & as there were no uniforms in Camp to fit him, he had to come away in his private Clothes & having only what he\n\n \n\nstands up in he has to keep in the Bathroom when he wants to wash his clothes & so it happened that he was washing his clothes when the alarm was sounded & having only a Towel around him he had to stop in the Bath room & as it is necessary to close all Water tight Doors \nin an\n when the alarm is sounded he was forgotten & shut in & when our Officer Commanding made the Inspection below he opened the Bathroom door & found him inside of course the man explained his position still he had to come up in his Towel with his Life Belt on which caused a lot of laughter on board, we were soon all dismissed for the day. As we are practically now in the Tropics the Weather is getting very\n\n \n\nhot & oppressive it is remarkable how calm the Sea is hardly a ripple to be seen.\n","30":"\n\nIt being very hot & close we all were feeling the heat so we had no drill to day.\n","31":"\n\nI was Corporal of the Guard all day from 10 am to 10 am next day & did practically the same as the previous Sunday. We had to supply a Submarine Guard of 50 Men also their duty is to be posted on different parts of the Ship with rifles & watch for Submarines they do duty for 2 hours on & 4 off, as we are now daily getting nearer our destination the danger of Enemy Submarine is Greater so of course the number of Men will increase. The Men\n\n \n\nhave to stand at attention facing the Sea.\n","32":"\n\nThe Weather still being hot & close although now & again we have a good shower of rain still it is very close, down below we we have our meals it is very stuffy, although we have two Wind Sails which come down below. I am very fortunate as I took up a position on the floor to sleep & have slept there since leaving Fremantle & as one of the Windsails is directly over my head I have it very cool all night. As there is still a doubt when we will cross the Equator I believe we must be almost on the Line. We have most beautiful Sunsets now it is a glorious Light As the Sun Sets the Sky is lit up brightly it reminds me of large \n\n \n\nbush fires & clouds of Smoke arising above the flames it throws a beautiful light on the Water. The Sun now sets about 6 Pm & does not rise until about 5.45 am so the days are getting shorter. As no lights are allowed on deck after dark the boys congregate in Small numbers & have Sing Songs until bed time.\n","33":"\n\nAs I cannot find out definite if we are over the line still today has not been so hot as the last few days & this evening we have a fair breeze. Drill was cancelled today owing to having the final events of the Sports decided & as there were such a lot of lads watching the events I could not get a look in so I adjourned down below this afternoon & had a quite\n\n \n\nnap. Sergeant Burden & myself starts a Class for First Aid tomorrow amongst the Railway Boys we have about 40 names on our list so hope it will be a Success. We have a large number of Certificated Men amongst us so we will not be Short of instructors.\n\nWednesday 6\/3\/17.\n\nAs I anticipated there were a fair number of Lads turned up for the First Aid & having a fair number of Bandages & Splints we had a very interesting two hours, as we are close on our next port the class will be postponed until we get to sea again.\n","34":"\n\nPassed off very quietly nothing happened worthy of note.\n\n \n","35":"\n\nAfter Breakfast Land was sighted at about 10 am away on our \nLeft\n Right & everyone was interested in making our next port. We continued along the Coast until about 12 noon when we altered our Course & our fleet formed into Single Line our Armed Cruiser Orcoma leading then came the Walmer Castle 2 then our Boat Militiades 3 then the Omrah 4 Waitani 5 - Qta. Ultimaroa 6 and the Auchices 7. Number 5 & 6 has all New Zealand Troops & the 3. 4. & 7 Australian Troops & No 2 has ","36":"\n English Troops returning from German East Africa also a large number of Civil passengers. We continued in Single Line until about 4 Pm when we steamed through the Channel between the Main land & a long Reef. At 4.15 Pm we \n\n \n\nAnchored opposite the Town about 1 mile off as there is no Wharf Accomodation we could not land so have to remain on board all the time. The Country around here is known as Sierra Leone & the Town is called Free Town . Having had the Loan of a pair of Strong Glasses I had a splendid view of the Town all the Houses & Buildings have their Roofs painted Red & the Green Trees growing amongst them it makes a beautiful Panorama View. Free Town is built at the Foot of the Mountain which is named Mountain Lion. There are numerous Houses built amongst the Hills which look very pretty. The Gov. Residential Quarters is built on Sloping Ground \n& \n which is laid out\nwhi\n with beautiful Green Trees growing between the Houses\n\n \n\nSeveral of the Small Hills are Fortified, through the Glasses several Guns can be seen, also the Inhabitants are seen moving about in White Clothes. The Weather at present is beautiful, the Atmosphere very clear, of a night however a Heavy Dew Falls. Having obtained some Interesting History of this Country I will endeavour to give it in Print. About 400 years ago, a Portugese Navigator landed here & as the Mountain appeared to him \nthe shape of\n as a roaming Lion so he named it Sierra Leone which means Mountain Lion. In the Eighteenth Century a British Company formed & obtained permission to sent the Black American Slaves to this place with the Intention to try & teach them what liberty is, so when they arrived & formed a Town\n\n \n\nwhich was named Free Town. but it was not a Success so the Company handed the Settlement over to the British Government who placed an English protectorate over the Town & District. In 1807 the Church of England Missioners arrived & established a Mission & later on the Wesleyan Methodist people did the same so today there stands two Churches in Free Town which belongs to these Denominations. The White Population numbers about 400 & the Native some where near a Million in the District generally. Their Commerce is made up of Rubber, Copra & Tropical Fruits. Vegetables have to be imported & Cabbages cost 2p each, Bananas are sold by the Natives who have small Canoes & come alongside at 1\/- dozen & are a very intelligent class of Black. Their Dress is very Scanty a large number\n\n \n\nonly have a small cloth covering their loins, the children of the poor class run about naked, the Women of the Poor Class have a light garment of Print of different Shades & the Rich have of more costly material, they as a rule are a tired lot of people only producing what they require with some exceptions. There is a Railway of 400 Miles which runs through the Rubber & Coconut plantations, it is of a 2 ft 9\" gauge & the Engines & Carriages are of a Small type. The rainfall averages about 130 inches per annum & the Rainy Season starts about April for 6 months & the Temperature very seldom drops below 86 degrees in the Winter. The Government Officialls if they are stationed here for 12 months count as 24 months, & the Soldiers times is counted the same. There is a very strong current running\n\n \n\nwith the Tides averaging about 5 Knots. The Anchorage is very well protected from the rough Seas, Sierra Leone is a Peninsula. While we are in Port we have a Lighted Ship of a night so we have been having Competitions in Singing, Friday & Saturday Evenings. Our Corp has had two victories namely Baritone & Corus Singing. These Contests will be continued when we leave Port before dusk. One matter I forgot was the Native Canoes they are made out of Trunks of Trees. The centre os the Trunk is burnt out until the Shape is obtained & then it is finished off, the Natives have one man at the Stern with a Paddles his work is to keep the boat moving & steering it while his Mate does the trading. The Canoes range from 12 ft to 20 ft in length & they have a flat Piece of Wood in the \n\n \n\nshape of a spoon to bale the Water out of the Boat. In the Town there are no Shops all the trading is done off the ground by the Native Women, as the men work in the plantations. The Town is very dirty.\n","37":" & Sunday passed very quietly with the exception of a Concert & a Church Parade. All day Sunday\nwen\n we were taking in Water from a Tug which brought 260 Tons each Trip & there were four Trips.\n","38":"\n\nOn coming up from our D Deck at 6 am, I noticed a large Four Funnelled Mon O War leaving her Anchorage for Sea, just after Breakfast we weighted our Anchor & when the Orcoma & Walmer Castle passed us , we started on our journey also the other boats in their turn when we were clear of \n\n \n\nthe Channel we all took up our usual positions. Once we got away from the Coast of Sierra Leone the Atmosphere very soon changed & became cooler & not so heavy we started on a Westerley Course. Our Ship is darker than ever now & it is very awkward to move about up on deck & as the lights down below are lit until 10 pm all hands remained down until Bed Time.\n","39":"\n\nThings all day were very quiet except \nf when\n that we were paid in the Afternoon, the last pay until we reach our destination, As there is only an amount of £ 2. placed on board for each man we had drawn 1\/10\/- previously so there were only a balance of 10\/- coming to us. As the Officers of our Corp has to make up the cost any articles lost on\n\n \n\nthe voyage such as Blankets,, Hammocks, Knives forks spoons, Plates & Pannikins, it was decided to allow the Officers to deduct 1\/- from the 10\/- & after we disembark it there is any shortage it is paid for out of the amount deducted & the balance if any goes into a Company Fund. A new Order came out that from now onwards Hammocks will be issued at 6.30 Pm & all hands must be in bed by 7 Pm for some reason or other, although some turn in straight away I fix up my Bed & then go up on deck & into the Alley near the Stewards quarters & sit & Smoke & as a rule there is a Gramaphone playing which is pleasant to listen to, it is generally near 9 Pm when I turn in.\n\n \n","40":"\n\nOur Musical Competitions were continued & the Events decided were Impromptu Speech. There were 5 entries & the Winner turned up in Private Peter Hodd of the Trades Hall, Perth. The competitors had to draw their Subject \nfrom\n which was on a piece of paper from a Hat, the Winner drew for his, Is life worth living, & Peter made a splendid speech & was given a great reception when he had finished the other Speeches were, The Girl I left at home, Is married life happy & Curiosity. The Afternoon was put in well also the evening Card playing.\n","41":"\n\nThe Weather now is glorious cool & refreshing. I spent the morning reading & after Dinner\n\n \n\nI was playing Draughts when the Alarm was given that a strange Steamer was approaching on our Port Side. On going on deck, all hands were very excited as the Stranger did not fly any Signal. Our Armed Cruiser (Orcoma) shot out to meet her. The Walmer Castle turned her stern on to her also our boat did the same. The Stranger was surrounded & the Ships & Guns were trained on to her. Eventually the Stranger put up her Flags & was slowed to proceed. The impression was that she might have been a Decoy Ship for the Submarines & that a Submarine might have been behind her waiting to strike. The was no mistake it was a scatter & Boats, Our slow boats made off in all directions\n\n \n\nto keep clear. She was only a Coal Boat making in an Easterly Direction. No doubt we will get a few more scares before we reach our destination. After Tea one of the Engineers came down & screwed up the Port hole doors tight as we were altering our course from West to Nor West would be running into colder Regions & likely rough Weather. After playing bridge until 8.30 I turned in for the Night.\n","42":"\n\nWhile we were having Breakfast a number of us was notified for Submarine Guard & we had a parade at 3.0 Pm in the Afternoon for Rifle-Fireing before taking up Guard. I took things easy in the Morning & duly paraded at 3 Pm we were formed into line on the Promenade Deck & each man was handed a Rifle & five Rounds of Ball Ammunition. The Rifle issued\n\n \n\nto us is called Small Magazine Lee Enfield it weighs 8 lbs 10¼ Ozs it holds 10 Cartridges in the Magazine & one in the Breach. After we were instructed how to Load we had to Fire one round after repeating the orders given by the Officer Commanding. At 200 yds naively. One round at the Horizon & when he blew his Whistle it was the signal to fire. Then we were ordered to load again & repeat same orders again & then fire. After firing two rounds we were to fire the three rounds left as rapid Fireing. This was duly done but not altogether as a large number of us was new to the game & \nat\n a bit nervous for the first time. Then we were dismissed until 5.45 Pm. After having Tea & a Smoke & rolled our Overcoat we paraded at 5.45 Pm. The Guard Consisted of 3 Sergeants 7 Corporals\n\n \n\nand 62 Privates. After being inspected by the O.C. 15 Privates & 2 Corporals were marched away to the Aft Boar Deck. As there are 5 Positions to guard it is done in 3 Shifts. The remainder was then marched upon the top Boat Deck above the Promenade Deck. As \nI was the\n the Unit forming the Guard was short of its strength ten of us was required to make up the Number & as I was the Senior Non Com I was given the position of Corporal of the Guard in Charge of our number although we were scattered amongst the others I was given the post on the Port Side. As there are 3 Corporals on the Port Side, one \nin\n as a Stand By. The other two work 4 hour shifts. There are 9 positions made up as 3 on the \n\n Forecastle Head & 6 on the Port side of the Boat Deck. The Guard \nissued\n is on for 2 hours & four Hours off. Their Duty is to stand to Attention with their Rifle which has 5 Rounds of Balls\n\n \n\nAmmunition in the Magazine. They face the Sea & must not take their Eyes off it. If they see any Suspicious Objects \nthey\n or Lights in the near distance they must Fire one round & point in the direction & Shout out to the Corporal of the Guard. If it is a long way off they let the Corporal know who reports same to the Officer on the Bridge. On the Starboard Side there are 6 positions. The Corporals duty is to place the Men & Inspect them every ½ hour to see if they are keeping a sharp look our as we are well in the Danger Zone & no chances are taken. The Ship also has a Man posted right at the Front of the Forecastle Head also in the Crow’s Nest. After doing duty on the Port Side all night I was transferred to the Starboard Side at 6. 1m in the Morning \n","43":"\n\n \n\nSt Patrick’s Day\n\nMy duty was a lot easier as I only had Six positions to look after & no Men to look after on the Forecastle Head. As the Weather was chilly with a strong wind blowing it was necessary to keep on our Overcoats. Our Course was West Nor West nearly all day. At 6 Pm we were all lined up & when the new Guard arrived & our Men relieved we were marched down on to the Promenade Deck & dismissed & we were not sorry after our Cold & Windy Shift. \n\nWe have now a Draughts Tournament started it is competed for in 3 classes 1. 2. & 3. I am in the 2nd Class & as there are a Euchre & Cribbage & Bridge Tournament we will have a very busy Week next Week which I trust it is the last of our Voyage, as it is nearly 7 Weeks Since we left Australia, & we are all just about tired of Ship Life.\n\n \n","44":" and","45":" passed off quietly nothing happened out of the ordinary.\n\nTuesday 13\/3\/17.\n\nThis day was our saddest of the long voyage, we had the misfortune to lose \noff\n one of our comrades who was attached to the 24 Reinf of the","46":" Battalion. He had been ailing for some time & was in the Hospital 4 days & he gradually sank & Died early this morning. After preparing him for his last resting place his Mortal Remains was Commited to the Deep at 8 am. All Troops were ordered to stand to Attention ar the Bugle Call while the Remains was brought from the Hospital & placed on the plank covered by the Union Jack, After the Minister \n\n \n\nhad read the Burial Service the Remains moved off the Plank into the Sea. It cast a gloom all over the Ship as we all hoped to reach our destination without a loss of a Man. At 9.30 am a pigeon was liberated from off the Boat Deck, where it was to go to was hard to say. At 9.45 am the General Alarm was sounded & all hands had to parade with Life Belts on at the Respective Stations, it was carried out in quick time. At 4 Pm our Ship altered her Course & steamed away from her position for Gun Practice. As Volunteers was called from the Troops to assist in manning the Gun at the Stern they were given an Oppertunity of showing their Skill, A Barrel was thrown overboard & at a \n\n \n\ncertain distance it was fired at. The First Shot fired just cleared the Flag on the Barrel & it fell off. The second shot was still over the Top of the Barrel which by this time was along way off. An Empty Case with another Flag was then thrown overboard & it was also missed. One of the Shells could be seen plainly going on its Course. Taking the Shooting on the whole was very good for the novices as if there had been a Ship or Submarine there both would have been hit. We are still having fine Weather, a bit cloudy but beautiful & cool & the Sea like a Mill pond. The voyage from Australia has been one of calm & peaceful Weather & all Troops have \n\n \n\nbenefited by the Trip. After Tea, Cards & Draughts was indulged in until bedtime.\n","47":"\n\nDuring the night a storm arose & rain commenced to fall & as the Top of the Hatch was uncovered & the Windsails down below the rain poured down below making us all who slept near the staircase shift our Beds further back, any how the Hatch was soon covered up & Windsails removed & every thing again was soon quiet. Breakfast one of our boys from our Mess who had a pair of Field glasses was told off to take up duty on the top o f the Dummy Funnel to watch for suspicious objects. The information he received from the Ships Officer, re Submarines is interesting so I will try & repeat here what the Chap told me. He was instructed to report any\n\n \n\nsuspicious looking objects, such as small Sails which has been known that Enemy Submarines, go about with a Sail up to mislead our Boys, & after following a ship & taking the course & speed they can submerge & come close up & fire their Torpedos. The German Submarines only fire their Torpedos from Fore and Aft & not Amidships. Also if a Pieroscope is seen \nwi\n moving in the Water from Side to Side it is generally attached to a Floating Mine. All day long it was cold & showery & all hands had to put on warm clothing. After the usual parade in the after noon & after Tea the usual Cards & Other Games were indulged in, & then lights out.\n","48":"\n\nThe Weather was still Wet, & a strong Wind blowing & it is\n\n \n\ngradually getting colder & colder. I was on again at 5.45 Pm for Submarine Guard on the Bridge Deck it was a very cold position & I was glad to be relieved after 24 hours. Things generally were quiet all day After finishing guard I got my Hammock down & turned in for the night.\n\n","49":" On Guard\n","50":"\n\nThe Weather still being cold & Wet I remained down below all the morning. About 1.30 I was laying down having a sleep when I was awakened by the Engines working faster & on going on Deck there was great Excitement as a Steamer was bearing down on us so our Armed Cruiser went\n\n \n\nfull steam off to intercept her as she was flying no signals. The Slow Boats of our Convoy made away in another direction & the Walmer Castle slowed down & put her nose to the oncoming Steamer, & we did the same. The Cruiser ordered the stranger to stop & show her Signals at the same time turned her stern Gun on to her. After Signals were exchanged she was allowed to proceed on her journey. It was very amusing to see the movement of the Convoy in a scare. The Cruiser acts like a Hen with her Chickens, rushing away when there is any likely danger. After a while the cruiser Signalled to all the boats & we soon were into line again. After the usual Cards & Draughts all hands turned in to bed in good time.\n\n \n","51":"\n\nThe Weather was still miserable. On going on deck I saw that several other boats were close to us although they did not join us, as after a while they steamed off in different directions. There were three of them, one which is a large Steamer is away ahead of us. Just before Breakfast a Sailing Ship was sighted away to the East of us, it was a Brigantine & looked well at a distance, in fact it was the first Sailing Vessel I have seen with her Sails out at Sea, it was admired by all the graceful way she glided through the Water before the wind. After Church Service we had a Kit Inspection to find out what is missing & it was reported, I have lost two articles since I embarked. After I put my Bags\n\n \n\naway I went up on Deck & got a Surprise to see a lot of little Boats making straight for us. They came at a great Speed & turned out to be Torpedo Destroyers (7 in all) they circled right around us & then all of a Sudden the Convoy broke up & each Troop Ship took a Destroyer as an escort & made off each in a different direction. They caused a great Stir on board & the Promenade & Poop Decks were crowded with Troops. They cross & recross ahead of us all the time & as we are now on our own we have increased our Speed from 10 knots to14 or 15, as one of our Convoy was only a 10 knot per hour we had to go at that speed all the way since we left Cape Town, which accounts for our long voyage. Our Armed Cruiser (Concomas) turned around & made back again I presume for \n\n \n\nSierra Leone. We hope to be in Port Tonight or Daylight tomorrow.\n","52":" 26\/2\/17-\n\nThis day was very Stormy & Blowing Moderate Gale, making it very unpleasant for all on board. We all felt the Cold & all had their Great Coats on all day. The Submarine Guard was strengthened by 40 men placed on the Promenade Deck, 20 men each Side, during the day it came to our Corps turn to supply the Guard & Volunteers was called & I made one & at 2.30 Pm took up duty. We had 30 on each Side of the deck twice. The Port Side was very cold & Wet & the spray from the Breakers froze & blew along the Deck in \nwhite\n small white balls. Our escort the Destroyer was having a rough passage, pitching and Tossing about so that half her \n\n \n\ntime she was out of sight in between the big Seas. As orders were that Reville was 1 hour earlier in the Morning all hands turned in early I likewise but during the night. I was perishing cold in my place where I sleep near the Companion Way that I had to shift my Blankets & Hammock away in the Corner of our Deck which was much warmer. \nWe were all\n","53":"\n\nWe were all awake at 5 am & hoped to see Land but our luck is out & we only have the Sea to gaze on. We were called on to supply another Submarine Guard & as I had a nasty Cold I did not volunteer. At 9 am all Hammocks were ordered to be placed on the Mess Tables open for Inspection to see if we had lost any of our\n\n \n\nblankets or Hammocks. After the Inspection there were not any missing so we had to pay for none. At about 10 am Land was sighted on the Port Side & it \n\n gradually became plainer to the Naked Eye, of course it was unknown to all of us what part of England it was, anyhow after about an hour or so a Light House was visible & soon the news spread that it was Eddystone Lighthouse, it stands away out to Sea & is built on Rocks, it look a very imposing Monument, We all knew now that we were making for Plymouth & easeing our Speed, we passed several Patrol Boats we cain into the Bay & Anchored for a while & then after being taken in Tow by a Launch, we made our way up the River Ply passing \n\n \n\nseveral Man O Warships, Destroyers & Naval Dock Yards we came alongside the Wharf at Davenport at 2.30 Pm. After we had brought up our baggage & put then on the Promenade Deck, we all had to stand by & wait our turn to disembark. Some time later a number of Carriages came along side & then the Infantry Units marched ashore & entrained as soon as the Carriages were full they moved off accompanied by cheering from us on board & then in return, after a wait for a while, Our lot of Carriages came along & as soon as the last of the Infantry Units was ashore We started & lined up alongside of the Train, awaiting instructions from the Transport Officer when all was ready we were told off in\n\n \n\nlots of eight & told to Entrain which was soon carried out. As the Weather was chilly \nalthough a\n & the Sun setting we were all glad to get settled down. The Carriages were all Third Class & \nvery\n very comfortable. Hot Pipes under the seats were provided. As we pulled away from the Wharf all hands gave three cheers for the Officers & Crew of the Good Ship Militiades (A28) also our Lieut Colonel – Ministers who remained on board. After Shunting along the Wharf & out of the Dock Yard Gates we were picked up by another Engine & taken further on & then Stopped again for a while, then our Train Engines, two in number coupled on & we started on our journey as we moved slowly along the People of Devenport gave us a great Cheer\n\n \n\nThe Little Boys & Girls waved their hats & shouted out to us. We in turn gave them the (Australian Cooee.) The Seenery through the City was beautiful the Long Rows of Houses & Narrow Streets & the people at the Windows gave us a Welcome by waving \ntheir\n all sorts of Articles. \n\nAs we left Devenport at 6 Pm & the Sun \nwas at mo\n had almost disappeared, we could only get a partial glimpse of the Country en route, but still what we did see it looked beautiful & Green, the Ivy growing all along the Embankment & up the buildings. The Paddocks \n& Hedges\n were all laid out in Small blocks & separated by small Hedges & embankments, we continued on our journey until we reached Exeter at 8.20 Pm where we were provided \n\n \n\nwith a Bun & Tea after a stay there of 15 minutes we started off again until we reached Westbury 10.30 Pm where we shunted on to a different line until we reached Codford where the Infantry were detrained for their Camp, we left at 11.30 Pm & arrived at Hanover Junction at 12.40 am the A.M.C Unit detrained there & we continued on and arrived at Bordon at 3 am which was our destination for the time being. After placing our Kit Bags in to Motor Lorries we formed up in our platoons & marched off 4 abreast at 3.20 am after going for about 1½ miles we came up to our quarters & after numbering 33 men off we marched into a Hut. Once inside of the Hut we soon picked out our positions for sleeping. After the rest of the Corp had been allotted their Huts we \n\n \n\nwere supplied with Bread & Jam & Tea which was readily devoured as we were very hungry & tired, a few moments later we were issued \nBla\n 5 Blankets & as there were Iron Beds Provided all hands made a shakedown on the Iron Beds & retired for a little Sleep it being then 5.45 am.\n","54":" 1917.\n\nAfter having 3 hours rest we were all up again being anxious to have a look around the Camp. In describing the Camp, I am afraid I am unable to do it justice, but I will do my best. Of what I have seen this Camp which is named Bordon is built on both sides of a long road enclosed with a hedge on both sides as far as the eye can see & the Huts are built of \nIron\n\n \n\nWood & Galv Iron , in several Rows, for a depth of about ¼ of a Mile. It is a wonderful Sight to a Stranger & after all said & done it is only a small Camp to others, it is built on a slope & has excellent drainage. There appears to be a large number of Royal Engineers & Railway Men in Camp. Each Hut contains 30 Private 1 Corporal & 2 Sergeants, in the centre of the Hut is provided 2 Fire Places & 3 Tables & 6 Forms. The Routine of our Hut is that the Corporal which I have the honor to be is Mess Commander & has 4 Mess Orderlies under him, when the Orderlies bring in the Food, I carve & serve it out & the Orderlies place each plate in front of a man who are seated at the Tables, by this arrangement each Man receives his equal\n\n \n\nshare. After having Breakfast at 10 am we were paraded for a roll & then dismissed until after Lunch when at 1-45 Pm we had a full dress parade & were inspected by the Colonel of the Camp who spoke very feelingly in welcoming us to Bordon & congratulated us on our successful although dangerous voyage from Australia. After giving us a few words of advice we were all Medically examined & then given some drill to liven us up, as the Weather is very cold & all of us feeling the change we welcomed the Marching Exercise. After witnessing a Fall in & dismissal of a large number of Troops those movements were an eyeopener to us all. The Troops went\n\n \n\nthrough their work like a clock to be exact, it was impossible to find a fault & shewed us what could be done by Systematic Training & Discipline. Of what I have seen up to date it is a credit to the Drill Instructors. After a splendid Hot Tea provided I took a stroll up to the Village of Borden & was struck with the quaint Homes of the People. The Houses are built of Stone & Slate & Tile Roofs. After a pleasant walk up & down I adjourned to the Picture Hall to see a programe which was crowded with Troops. Afterwards I being tired & sleepy I made my way back to my quarters, & made up my bed for the Night. After enjoying a quiet Chat of our day experiences when lights out was sounded at 10-15 Pm all hands were soon fast asleep.\n\n \n","55":"\n\nAs there were no early morning parade at 6-30 am all hands did not rise until 7 am when breakfast was over we were paraded at 9 am & had some drill & marching until dinner time & at 2 Pm we were again paraded & marched on to a parade ground to await an Inspection by Sir Newton Moon Bridager General of the A.I.F who duly arrived at 3.30 Pm & after being inspected \nwas\n we were welcomed & congratulated on our appearance, we were dismissed & after Tea I went for a long walk about 5 Miles along the Road with two chum. There was a lot of Troops walking along also & it was quite enjoyable. There is very \n\n \n\nlittle Civilian population as nearly every house is occupied by the Authorities. On returning I adjourned into the Salvation Army Rest Room & enjoyed some Music & a Read. At 9 Pm I made my way back to my quarters, & Bed.\n","56":" 1917.\n\nUp again at 7 am & paraded at 9 am & \nwas\n all was marched up to the Parade Ground & had Company Drill until 12.15 Pm when we were dismissed for Dinner at 2 Pm we were again paraded for Roll Call & then dismissed for the Day. I took things easy during the Afternoon, reading & Smoking until Tea Time & afterwards I went for another walk in another direction for about 4 miles over \n\n \n\nvery open & cold Country & coming back I went up into \nthe\n another village which was crowded with Soldiers it being their pay night & the few Shops in the Village seem to be doing a fair trade. On coming back again I went into the Salvation Army Rest Room & had a cup of Coffee &1 piece of Cake for 3d which is very reasonable these hard times afterwards I adjourned to my quarters tired after my days work.\n","57":"\n\nWhen all hands awoke this morning we got a surprise, it was Snowing hard outside everything was covered & look a picture, it was a Picture in reality of what I have often seen in print. It caused quite a Commotion amongst us Australians as the majority of us had never seen\n\n \n\nsnow before. We started making it into Balls & throwing it at one another I got one on the Ear but having a Muffler over my head & neck did not feel it. It was about 3’ thick on the ground all the Trees & Scrubb looked well. We were to go on a Route march this morning but owing to the Snow it was cancelled so I went for a walk instead to warm myself up. After dinner I went for another walk to Bordon Station about 1½ Miles & \nsaw\n coming back I watched a Football Match played by Tommies for a while when I returned to quarters to Tea. After same we were paraded to sign new pay books, we had to sign three times. This took up all the evening.\n","58":"\n\nAt 9 am we were paraded & marched into a Hut & there addressed by the Medical Officer on how to conduct\n\n \n\nourselves when we are on our long leave, we were supposed to have 6 days & instructions received it was cut down to 4 days which was a disappointment to all of us as we all looked forward to 6 days enjoyment after our long voyage to England. After Dinner 6 of us went for another walk to a Village called Headley. About 1¾ miles, the journey was very interesting, the Roads wind around, hardly a straight line of road was encountered for any distance. Turf thrown up on each side between the Homesteads made the dividing line which was covered with Hedges & Hazel Nut Bushes which was very interesting to the Eye, along the Road I came across one Old Mill built over a Waterway, the Water was used to drive a Wheel to cut Chaff & corn.\n\n \n\nabout ¾ of Mile on further we came to the Village of Headley which was very pretty & picturesque the Church of England building is covered all over the sides & Front & back with Ivy also the Tombstones were very old some dating back to 1783 & perhaps earlier as several Tombstones were covered over with Moss. The Ivy Creeper I noticed was growing up amongst the Trees & along the Roadway. After inspecting the inside of the Church we started on our return journey which was done in quick time. After Tea we had to parade at 7 Pm to receive our pay & later on at 10 Pm for our Railway tickets. As we were leaving early next morning for London we were all busy cleaning our Boots & Leggings. We all settled down at 11 Pm & soon was fast asleep.\n\n \n","59":"\n\nAll hands astir at 6 am packing what was necessary for our Journey. after breakfast a number of us going on a long journey paraded at 7 am & marched off to the Station through about 4 inches of Snow, & still Snowing. The journey of about 1½ was soon got over & arrived at the Station at 7-40 am & had to make ourselves \nvery\n Comfortable with what shelter there was available, & that was not much as the Roof of the Verandah was not on. At 8 am the Train arrived & after attatching another Coach we were allowed to entrain & at 8.10 am we started on our journey. We made good progress to Aldershot we we picked up more Coaches with Soldiers on & left again & as it still was snowing I could not get a good\n\n \n\nview of the Country, which was a pity as I would have like to see the Towns & fields anyhow when we gradually approached Waterloo Station, the Railway lines were an eyeopener Steam & Electric Trains running in every direction. It was snowing heavy on arrival & very cold. After detraining & waling up the platform we were soon lost in the busy throng it made me feel quite nervous at first, thanks to a pall I soon found myself down at the Tube Railway & after buying a Ticket we went into a lift & down to the platform underground where a number of People were waiting, after a few minutes along came an Electric Train of 3 Coaches & soon we were on our way, in a few minutes we arrived at Charing Cross & left the Train & walked along a passage where we came to a Moving Staircase\n\n \n\nwhere I was puzzled how to Step on to it, anyhow, after seeing a young Lady step on we soon followed suit & up we went to another passageway & along for a short distance were we came to another platform at this point I was absolutely dumbfounded not knowing where I was likewise my pal, soon we were on another Train, & in a few minutes arrived at Victoria Station. We were amused at the Girl Porters at the Barriers, it seemed so strange to both of us. After inquiring about our Train to Bognor & having 40’ to wait we both went outside to find a place to have some lunch, one had to keep their eyes opened the large number of Busses moving about they likewise had Lady Conductors, on reaching the other side we went into the Y.M.C.A\n\n \n\nRooms & had a cold lunch then we made our way back to the Station across a very slippery road & still snowing hard. Having purchased each a Ticket we went along the platform & joined our Train & soon was speeding on our way & in due course arrived at East Croydon & there had to change into another Train which duly arrived & off again until we arrived at Brighton, the Weather here was a lot brighter & not nearly so cold. After joining another Train was soon off again to Barnham Junction through some very nice country, gardens everywhere & Nurseries. We had to change again into the Bordon Train this making the","60":" Change of Trains in a run of about 100 miles I was just about full of changing & was glad to arrive at Bognor,.\n\n \n\nwhere I \nwas met on by\n had the pleasure of seeing my Sister again who lives there, after some 3 years. On arriving at her home on the Esplanade I soon made myself comfortable & spent the rest of the Afternoon \nChatting\n & evening Chatting over old times. As the Weather next day was very bad in the Morning I did not venture out till the Afternoon where I had my Photo taken by myself & also with \nmyself\n my Sister & after having a Walk around the Town & seeing the sights which I very much enjoyed. Bognor to my mind is a very pretty place & during the Summer Season is largely patronised the Beach & Pier & Esplanade is beautifully laid out. After \neveining\n Tea I enjoyed my\n\n \n\nSisters Singing & playing & in due time turned in for the night.\n","61":"\n\nAfter arising at 7 am & had Breakfast \nI took my leave\n I said Good Bye to my sister thanking her for making my stay enjoyable & proceeded to the Station in fine weather I did not have far to go & was soon on the platform, I had a word with the Engine Driver after introducing myself & he invited me to ride on the Engine to Barnham Junction which was only a few miles on reaching there I had to change into another Train which soon arrived & off I went to Victoria Station through a different Route to what I did going to Bognor as the Weather was fine although Cold I interested myself in viewing\n\n \n\nthe Country along the Line. I was shown \nNor\n the Castle which belonged to the Duke of Norfolk who had died only recently & I believe was the Richest Peer in England. The Train arrived at Victoria Station 30 minutes late & I soon made my way to a Bus going to Waterloo Station I sat on the Top so I could get a good view of the Sights enroute the Bus wound around & around through the busy Streets & at last I arrived at Waterloo Station. I walked across the road & into the Union Jack Club where I intended Staying, during my rest of my leave. After booking a Bed I adjourned to the Dining Room for Lunch \nwhich is a\n It is a very large Room & was full of Soldiers of numerous Regiments\n\n \n\nalso Sailors. Everything is very Clean & the Waitresses very obliging. There is no stipulated charge for Lunch everything has a price & according to what you order is the amount you have to pay. After Lunch I met a Warrant Officer from Canada & he & I walked over Waterloo Bridge & made our way to the Hippadrome \nin Piccadilly\n near the Strand where the Revue called Zig Zag is performed after paying 1\/4 I went upstairs to the Amphitheatre & took a seat. The Usher showed us into a good Seat & I hired a pair of Glasses. This Theatre is a beautiful place & was an eyeopener to me it was beautifully lit up & could accomodate a large number of people. This Theatre is I believe the largest in London. When\n\n \n\nthe Orchestra arrived I counted the Performers which numbered 31 & a Conductor, the String Instruments were all on one side & the Brass on the other. They played together Splendid & was quite a treat to listen to. The Artists & staging was First Class especially the Comedian George Poobey who Kept all in a state of laughter. The Singing was grand the Young Ladies all had first class voices The performance started at 2.30 & finished at 5 Pm. On returning by Tube Railway to the Club I had a brush up & I met another Chum & we took a Bus to St Martins Theatre to see Drama (Damaged Goods) but could not get \n\n \n\nin it being to crowded so we went along to the Ahlambra to see another Revue (Variety) called The Bingham Girls. After buying a Ticket we went up stairs & duly got a seat. This is another find Theatre not so big as The Hippadrome but very compact & beautifully finished off.\n\nThe Orchestra was another large one 33 & the Conductor. The Music was another treat, every performer was a Master of his Instrument. This Revue was also Splendidly Staged & the Singing also first Class, it was a long performance starting at 8.30 Pm & finishing at 11-20 after coming out we took the wrong turning & soon both was lost anyhow we walked for a while & then was directed by a policeman to a Bus which\n\n \n\ntook us to Charing Cross Station, we did not mind being lost as we both enjoyed ourselves wandering about. On arriving at the Station we too the Tube Railway to Waterloo & soon was at The Club & reaching there at 12 \nM\n 15 am After having a Sandwich & a Cup of Coffee I made my way to No 128 Room on the Second Floor. The Bedrooms each contain 1 Bed & are private & very clean. They are situated in long rows, There must be a large number of them. There are also Hot Bathrooms for 2 & Lavortories on each Floor. The Charge for a Bed is 1\/- per night. As I was very tired after my day’s excitement I soon was fast\n\n \n\nasleep. \n","62":"\n\nAfter a good sleep I awoke at 8 am & dressed & made my way to the Dining Room for Breakfast. As this was my last day’s leave I intended to make the Best of it. I first took a Bus for the Tower Bridge, & after passing through several Streets \nI passed\n I noticed large numbers of Women waiting in a crowds to buy potatoes which in England are very scarce & dear at the present time. I left the Bus at the approach to the Tower Bridge & walked over the Bridge at this moment it was opening in the Centre to allow a Steamer to pass. This was very interesting to watch & no doubt is a great piece of work. Naturally the Traffic was held up & when the centre closed \n\n \n\nagain the Traffic on one side was allowed to pass over & then the other side. After walking a large garden I found my self at the Tower of London where I presented myself for a Free Pass to have a look over it. I fortunately met a Y M C A Guide who piloted me & a number of soldiers through. I was shown Sir Walter Raleigh Walk also his Cell also the Traitors Gate where the Prisoners were admitted into the Tower from the River also the Room where the Two Princes were smothered also the Sax Ring where \nthey were\n Prisoners were chained to & the Model of the Rack where Prisoners were stretched to make the confess also the Scavengers\n\n \n\nDaughter for holding the neck hands & feet in a sitting position the Block & Axe on which Lord Lovat was executed on the","63":" also the Scaffold Site on which many famous personages were beheaded including Queen Anne Boleyn, Queen Katherine Howard & Lady Jane Grey. The Crown Jewels which are magnificient & are enclosed in a Glass Room Guarded by Iron Rails. They are a Splendid Collection. After having lunch in the Tower Café the guide took us through St Pauls Cathedral. This is another magnificient Building. The Ceiling & Dome being done in Mosiac Style of all Colours to the Whispering Gallery about ½ way up the Dome. We walked around to the opposite side & was told\n\n \n\nto put our left ear to the Wall & his voice travelled around the Wall & we could hear every word, the distance across is 112 ft, then we went up a further flight of Stairs when we came out on the outside of the Dome & had a Splendid View of London, the Weather was fine which was in our favour. We were shown a building in the District which the Germans dropped Bombs on from a Zepplin, also we could see Nelson’s Monument in the Distance. The distance around this gallery was 365 feet & the height of the Dome from the Cross on the Top to the Ground is also 365 feet. On descending to the Floor again we went down into the Cript where a large number of Tomb’s \nstones\n We were shown the Duke of Wellington’s Tomb also\n\n \n\nLord Nelson’s Tomb & Lord Robert’s also several Poets, there were a lot of Tablets to the memory of different people. The Guide \n\n took us to view the Duke of Wellington’s Carriage which bore his mortal Remains, it weighs 18 Tons & took 18 days to build it is made out of old Guns, it is beautifully finished.\n\nAfter taking a Tube Railway we arrived at Cheapside & then into the Guild Hall another old & ancient building, it is here where the Lord Mayor of London holds his Banquets. There is a beautiful painting in the Gallery where the Lord Mayor gave a reception to the Soldiers on their Return from South Africa also another beautiful Painting of the Late Queen Victoria in her Carriage outside of St Pauls Cathedral in 1897 her Diamond Jubilee of Celebrations. After thanking & saying Good Bye to our Guide a friend\n\n \n\nbelonging to the Sussex Yeomanry took me to see Buckingham Palace We took a Bus to Pall Mall & walked along the beautiful Drive passing St James Palace also was shown The Late Lord Kitchener’s Home on proceding further I arrived at the Late Queen Victoria Monument outside of Buckingham Palace which is a beautiful piece of work. The Statue is surrounded by Fountains which were empty for Military reasons. On returning we went to view Westminister Abbey but it being after 4 Oclock we could not see the inside, as I was tired & footsore we rested outside the Abbey for a while, then we walked over Westminister bridge & down York Road to Waterloo Station & into the Union Jack Club for Tea. After Tea I walked along the\n\n \n\nstreet to view the poorer class shopping it being the night before Good Friday the shops were all open late. The Barrows in the Streets contained all sorts of Food stuffs which were very dear. Meat 1\/- lb upwards likewise Fish. Vegetables being very scarce the outside Cabbage Leaves & Turnip Tops are sold in bundles, we walked about until 9 Pm then I said Good Bye to my Friend & made for the Station to catch the Train back to Camp. On the Station there were a large number of Australian soldiers lined up before they were entrained for their respective Camps, at 9-10 Pm after we were all seated the Train moved off, we passed the time telling each other of our experiences & the journey to Bordon in Hants was covered in good time. After detraining we marched to our Camp and arrived there at 11-45 Pm & after having a Cup\n\n \n\nof Tea & Bread & Butter we all turned in all being very tired after our 4 days excitement.\n\nFood Friday 6\/4\/17.\n\nAfter Breakfast we were paraded for teeth inspection by the Dentist & then dismissed for the Day, after resting I went for a Stroll in the Afternoon along the usual walk till tea time & after Tea I spent the evening writing home. Good Friday was a red letter day for our Corps it being our first Mail Day from Australia, there were great excitement in the morning when our letters were handed out to us.\n","64":"\n\nAfter Breakfast a number of us were paraded some for Teeth Extraction & some for Impressions. As I unfortunately had broken my\n\n \n\nlower plate on Board Ship, I had an impression taking for a new plate. After I was attended to I then made for the Post Office to send my Mail away. After Dinner I laid down & had a Grand sleep until Tea Time, then my chum & myself went up the Town to the Palace Theatre, to see the Pictures. It is a nice Hall & accomodates a large number of Soldiers, it was crowded & after seeing the Pictures which \nwere\n I however had seen in my own Town in Australia before, little did I think when I saw them in Midland Junction, Australia that I would be in England the next time I would see them. There is no get a way from the fact, that time works wonders. After having a good night’s rest I awoke fresh, next Morning.\n","65":"\n\nAs the Clocks were put on at 2 am\n\n \n\nfor I hour we will have another hour of Daylight. After Breakfast 2 Chums & myself went for a stroll as the morning was beautiful, the Sun was shining & the air cool. I enjoyed a walk along the Wood until Dinner time. After Dinner I took my Chum for a long walk to Headley, as this place to my mind is very interesting I enjoy the walk. My Chum was very much taken up with the Village especially the Old Church which I am informed that the Tower portion is over 400 years old & the Beams supporting the Roof originally came from an old Barn. This Church was burnt down & rebuilt. On coming back I took a short cut which landed into private Property & on apoligising to the Owner\n\n \n\nfor Trespassing he allowed us to proceed through the Property which brought us on to the Road near the Old Mill. It was interesting going through this property. The Barns & Homestead were all built of Brick & a large number of Fowls were running about. After having a rest at the Old Mill we met two Royal Engineer Boys & the four of us walked back together to our Camp to Tea. After Tea we went for a walk & then into the Church of England Rest Rooms & I had a jaine of Draught & a chat & after having a Cup of Cocoa & Cake which cost us 2d each which is very reasonable we returned to camp & turned in.\n","66":"\n\nAfter doing Squad Drill for exercise I went over to Bordon Recreation Ground where sports were being\n\n \n\nheld by the Troops, there were a very large number of Troops around the enclosure including a large number of Ladies form the District. The Weather was very Cold & Snow was falling several times during the Afternoon, but as all hands in were warmly clad, we were quite Cheerful. The Events passed off well & caused a lot of excitement especially Tilting the Bucket, as was done by one soldier in a Wheelbarrow who was\npus\n wheeled along by a Chum \nthe\n & the Soldier in the Barrow who had a long Pole had to put it through the hole of the Stick under the bucket without spilling the Water in the bucket, the Bucket as a rule is generally toppled over & the Wheely receives it on the head which caused a lot of Laughter. The Horse\n\n \n\njumping was a frost very few horses taking the jump nearly all baulking. The Winners of the Tug of War challenged our Corp for a pull but we could not beat them they were two good for us. Our Team was only a Scratch Team which I was included, but we had no training & could not come near them. After I had Tea I spent the evening at the Pictures held in the Church of England Hall which was crowded.\n","67":"\n\nAfter being paraded at 9 am we were reformed up in Alphabetical order for a further issue of clothing, they consisted of two abnominal belts (Flannel) 1 Sheep’s Skin Waistcoat, 1 Water Proof \nCoat\n Cape (very long reaching down to our leggings, a splendid article) 1 Blanket 1 Waterproof Sheet \n\n \n\nThis took up the morning & .in the Afternoon we had some more drill, as it was very Cold in fact Snowing on & off all hands enjoyed it as it kept us warm. After Tea I & my chum went to hear the Artillery Band give a Instrumental Concert from 7 to 8 Pm \n& then we\n This band is composed of Returned Heroes & they are all masters of their Instruments. They played splendid together & received a good reception from the large crowd of Boys, it was held in the Garrison Theatre a very fine building afterwards we went into the Salvation Army Reading Room where a Royal Engineer was playing the Piano, after listening to several Singers I obliged the Company with two Songs at 9 Pm after having a Cup of Cocoa & Bun we made\n\n \n\nour way to the Artillery Sergeants Mess where a Ball was being held, on our arrival we were made Welcome by one of the Committee & invited to have Supper, I was not in there very long before I found out that it was restricted to Sergeants & Officers & me being a Corporal I did not take my Cape off so I was not identified. My Chum however was a Sergeant he enjoyed several Dances. One of the Commitee asked me to have a Dance with a Lady & I said I had a bad ankle so I amused myself looking on until nearly 12 midnight, when we made our way back to our Barracks.\n","68":" 4\/17.\n\nThe Morning was wet & Cold & Snowing so the Morning Parade was cancelled & after Dinner we had an illustration by a Corporal\n\n \n\nwho had returned from France, on the use of the Gas Mask & Inspirators, he had a good reception & was very interesting, he showed us how to fix the P.H. Mask over our head also how to carry it in the Front of us under our Tunic, it is a Strang looking Thing like a Bag made of Flannel with a pair of Glass Eyes & a valve outside & inside, the inside portion we put in our Mouth & hold the Bag tight under our neck we inhale the air from inside the Bag which is treated so as to Kill the Fumes which enter with the Air & it is made harmless, to exhale the air you put the inside valve in your mouth & \nbreathe outward air breathe\n exhale the air through it. There is also Eye Masks to prevent the \n\n \n\nGas from the Lear Shells hurting your Eyes. We are supplied with Two of the P.H. Masks one as a Stand by. We all have got to have several lessons on the use of the Masks at an early date. After having Tea, my Chum & myself went to hear a Concert Party from London give us a treat in the Garrison Theatre, it was crowded to the Doors & the artists were something out of the ordinary. The first artist was a Lady Pianist who gave us several old Chorus which the Boys all joined in heartily then a Gentleman gave us a Tenor Solo, he had a splendid Voice & received a splendid hearing, he gave us another as an encore. The Next was a Lady Violinist who played beautiful, it was a rare treat to listen to her, she was cheered over & over again for her\n\n \n\nitem, she had to repeat her item three times before the Boys were satisfied. Then came another Lady Soprano, another good Turn who also was encored & then came a Gentleman Comedian who also entertained us with funny Sayings & Comic Songs. The Artillery Band opened the first part with a Splendid March which they played very well also the opening Selection for the Second part, the both pieces we well received. The Second portion of the Programe was a repetition of the First Part, & each Item brought down the house. The Concert terminated at 8-45 Pm to allow the Artists to catch their \nret\n Train back to London. After having my usual Cup of Coffee I turned in for the Night.\n\n \n","69":"\n\nAfter Breakfast the usual parade & Drill was held and after dinner We were paraded for a Route March. There were a fairly good muster & we moved off at 2-15 Pm & marched along the road to the Old Mill near Headley, when we halted for a Smoke, after a 10’ Smoke off again until we came to the Less Road where we turned off & along this Road for about 3 mile when we halted again at this Spot we saw a large number of Troops about 2000 Strong marching towards us with the Band leading when they arrived at the Cross Roads they turned up towards Bordon, we then marched towards them & followed them in the Reear, when we arrived back in Camp we were all tired having walked about 7 miles altogether. I had a rest until 7 Pm when I had a Brush up\n\n \n\n& got ready for the Ball which was held in the Garrison Theatre. As I could not purchase a Ticket I could not gain admittance but the Doorkeeper told me that if I could get a partner I could go in, so I waited a while when a Lady came along by herself, I then walked in behind her, as if she was my partner, & I was admitted. After putting on my shoes \nI made my way\n in the Gentleman’s Cloak Room & having hung my Coat up I went into the Ball Room which was crowded, as there were my Gents to Ladies, I had a difficulty in getting a partner but after 8 oclock the Girls from the Shops arrived when I soon had a few dances engaged ahead. I sorted my way with a Circle of four Ladies & I had a grand time, at 9 30 Pm Supper was\n\n \n\nserved around & then the 2nd half of the programe was commenced. As there still more gents than Ladies they were allowed to Dance together & by that way everybody had an enjoyable evening. The Ball terminated at 11 Pm & all hands made their way back to their quarters.\n","70":"\n\nAs I was Orderly Corporal for the Day I was kept busy with the work attached to that position. I had to parade the Sick to the Doctor also march the Mess Orderlies to the Cook House at the Meal times. I had to stop in the Orderly Room after Tea until Bed time.\n","71":"\n\nAt 10 am our platoon No 1 & No 2 were paraded for Gas Mask Drill, we were each supplied with a Mask & after a Lecture for about 1 hour we\n\n \n\nwere marched away to the Drill Ground for Practice. After being Shewn how to put the Masks on we were given the Signal to put then over our heads. This had to be done in less than 6 seconds. The sensation was strange at first. The Masks are placed in a Water proof bag inside of a satchel which is hung over the left shoulder. After taking the Mask out it had to be opened & put over the head & the Valve inside is put in the Mouth & you can breath through your nose or mouth but you must exhale through the valve, after we had done this a few times to the satisfaction of the Instructor we were then dismissed for the Day. During the Afternoon my Chum & myself went up the Street to the Photographer & had\n\n \n\nour Photo taken together, I was sitting & him standing with our hats off. They will be finished on Tuesday Evening.\n","72":"\n\nAfter Breakfast the usual Church Parade was held & was largely attended by the Troop. During the Afternoon I went for my usual walk till Tea Time. As it came up wet after Tea all hands remained in their Huts.\n","73":"\n\n Nothing unusual happened during the day but having had my Invitation to a Send off in the Sergeants Mess I & my chum attended, we were introduced to several of the Sergeants & made welcome straight away. The Spread was held in the Billiard Room, small tables were placed around the Billiard Table & Sandwiches were supplied in plenty\n\n \n\nlikewise Cigarettes. The Send Off was to several Sergeant Majors who were under Orders to rejoin their Regiments in France. After the Toast of our departing Friends was drunk, Singing was indulged in. These English Non Coms are a fine lot of Chaps & make one feel at home straight away, having obliged the Coy with a Tune on the Piano likewise a Song which was (Australia is the Land for me), which was the first time it had been sung in Bordon it was received very well & I had to repeat the last verse & Chorus before the boys were satisfied. After all had as much as they desired in the way of Eatables & Drink the proceedings terminated at 10-15 after singing the usual Closing Tunes & all hands\n\n \n\nmade their way to their respective quarters.\n","74":" 17\/4\/17-\n\nAfter parading at 2 Pm the Corp was marched up to the Gas Chamber to go through a practical Test. After supplying half of the Corp with Helmets they marched up the Hill to the Chamber with the rear portion of the Corp behind. After the first Portion had adjusted the Gas Helmets they marched in single file down a Passageway & along a narrow passage about 8 ft underground, the Cylinder with the Gas was pointed towards us as we marched along & of course as we came closer it became more Stronger, one could tell that there was something in the air when it was drawn through the mask it had a peculiar taste & Smell anyhow all hands went through without\n\n \n\nany ill effects & then we took off our Masks & dipped the \nValv\n Inside Valve portion in a Solution & then we handed over the Masks to the latter half & they practically did the Same with the same results, after Marching back to Camp we were then dismissed for the day. After Tea I took my usual stroll till Bed Time.\n","75":"\n\nOnly had a parade in the Morning & after Dinner we were given the afternoon off so I took things easy laying down Reading, some of the Boys kept up a round of Choruses until Tea Time. After Tea the usual Concert was held in the Garrison Theatre at 7- Pm. A Concert Party came from London to entertain us. These are\n\n \n\narranged by the South African Entertainment Committee. The Artist were a first class lot. There were 4 Ladies & 2 Gentlemen, one Lady gave us a treat on the Violin another had a beautiful Soprano & was encored 3 times before the boys were satisfied one Gent was very amusing as a patter Comedian & had us in roars of laughter likewise one of the Ladies a Comedienne who gave us turn Cecil in the Tube, the Boys could not get enough of her & she received a grand reception. The Second part of the Programe was as good as the first portion. The Artillery Band played selections during the evening, this is a first class band & their playing is always welcome. After having Supper I turned in.\n","76":" to","77":" passed off quietly as \n\n \n\nI had a very severe Cold. I did not go anywhere, I never in all my life had such an experience. I was not the only one as a large number of the boys were down with it, if that is what they call an English Cold I don’t want another one, it was not only on my chest & in my head but my throat was that sore I could hardly Cough. Anyhow today Tuesday I am a lot better. Last Friday I was appointed Corporal in Charge of the Baths, my duties are to Keep the Enamel Baths clean & allot a Certain Amount of Hot Water to each man. This job will suit me until we leave for France when that will be nobody knows although there are Railway Drafts\n\n \n\nof other Units leaving fairly regular so our turn will come bye & bye.\n","78":" 25\/4\/17- \n\nThis being Anzac Day a half holiday was granted to the Railway Corps No 1 & 3 Sections so it was decided to hold Sports on the Bordon Recreation Ground. So a large crowd made their way & the Afternoon passed off pleasantly. The Sports held were fairly Interesting After Tea a Concert was held in the Wesley Hall by Australians & there was some good talent. The Longmoor Brass Band played several selections & no doubt they are a first class lot they received a Grand reception one artist \n\n Private Hook of the Dental Corp he gave several turns & his patter was very laughable he was encored several times, the Concert terminated at 10 Pm & the large audience went\n\n \n\nto their quarters quite satisfied.\n","79":"\n\nOwing to looking after the Hot Baths for nearly a fortnight I was granted a spell from Saturday until Monday, so I decided to take a run up to London. After Breakfast \nI cleaned my Leggings & Boots\n I made my way to the Station & booked my Ticket to Bentley \nwit\n The Train took 20\" to arrive at Bentley where I had to detrain & wait for a connecting one leaving Bentley at 12.32 Pm, so \nto\n having about 1 hour to wait I adjourned to the Hotel & had some lunch. The rain came in to time & \nsoon\n after getting another Ticket all hands were soon aboard & after a short run arrived at Aldershot where several more Coaches were attached & off again the Country alongside the Line was\n\n \n\nlooking very green, the Trees & Hedges were all covered with Leaves making a beautiful Scene. As the Weather was glorious it was a treat to be out. The Train stopped at several stations until Worthing was reached where after several more coaches were attached we left Worthing & made a through run to Waterloo arriving there well on time. On getting out of the Train I made my way to the Bakerloo Tube Railway, my destination was Baker St & after passing several Underground Stations I duly arrived at Baker St After up the Lift I soon found myself out in the Street. After making a few inquiries \nI\n in a few minutes I found myself outside of Madame Taussaud’s Waxworks having paid 1\/- admission I passed through the Turnstiles & found myself inside a large \nViewing\n Room\n\n \n\nafter passing through the ","80":"\n Large Room & through the Dining Room I soon was amongst a large number of Wax Figures of different people. The Works of the Figures were a treat to look upon The Ladies & Gentlemen Figures were of a Natural Size & beautifully dressed. After admiring the beauty in this large Room I went upstairs to view another large number of Celebrities. The Figures of the Late Lord Kitchener, Lord Robert Lloyd George, Late Queen Victoria Queen Alexandria, Queen Mary & King George were all beautifully done \n&\n including the Dresses & Uniforms. \n\nThe Wax Figure of Sleeping Beauty a Handsome young Women of about 21 years was laying on a Bed, she had beautiful Fair Hair done in long Curls with one arm around her head, some contrivance\n\n \n\ncaused her Bosom to heave as if she was in reality Breathing. There is no mistake it is a beautiful piece of Work, likewise the Two Princes who were Smothered in the Tower. These two Boys were laying on a beautiful bed, the Oldest with his arm around his brother & two Men standing over them ready to Smother them on the order of a third Man standing behind. The String Band upstairs was playing sweet Music during the Afternoon. After I had Afternoon Tea downstairs I met a Canadian Soldier & after a few minutes chat we decided to take a Bus for a ride. We inquired of a Policeman to direct us as we wanted to have a look at Billingsgate Fish Market, he soon put us on to \nthe\n a Bus Number & we were soon aboard & in due course arrived at the Market, but our luck\n\nwas out as the Market was closed so of we went to have a look at Selfridges Emporium in Oxford St so we hailed a Bus & after a few minutes we arrived at our destination where our luck was out again, as they also were closed, so we took another bus to Shaftesbury Avenue where my friend \nhad\n was staying at the Shaftesbury Hotel. On arrival at the Hotel I went up to his room for a Wash & a brush up, & down again into the Dining Room for Tea. After satisfying ourselves we decided to spend the Evening at a variety Show, but several of the Houses were all booked up except the Front Seats we had to content ourselves by going to a Picture Palace, after perusing several programes outside we \n\nwent to the Pavilion, a very nice Theatre with a full Orchestra & a good programe we remained there until 10.30 Pm & then we adjourned to a Restaurant for Supper \nat\n after having some very nice Fish & Bread & Butter & Coffee I went along with my friend to his Hotel were I booked a Bed & Breakfast for 5\/-. As I was tired I \nsoon\n turned in & soon was fast asleep.\n","81":" 29th\/4\/17-\n\nI awoke at 8 am & after having a Hot Bath I adjourned for Breakfast. Then I went into the Shaving Saloon & has a Shave & off I went for the Day as my friend had made previous arrangements & bade him Good Bye & went along for a Walk. I decided to look up a family whose address I had, so after taking a Bus & then a Train I soon found\n\nmyself in King’s Cross Road. The address I had was Albert House & after walking along for a good way I at last arrived at a large Building with the name outside, I went upstairs to No 3 & knocked at the Door. A young lady answered the Door & after introducing myself I was invited in. The Lady of the House had received word from Australia so was expecting me. The name of the Family is W.A. Smith. After a few words I was told to make myself at home & then I entertained them with some of my experiences until Dinner Time. Having made no other arrangements for the Day I accepted the invitation to remain with them until I had to return at night to Camp. After an enjoyable Dinner, their two\n\ndaughters Miss Adelaide & Lilly invited me out for the Afternoon for a walk which I was pleased to accept. We were not long out before another young lady joined us & the four of us walked along the Embankment a beautiful Walk which was crowded with People, we turned up some Road & soon was in The Strand . This place was also crowded with \nbeautiful\n Ladies dressed in beautiful Clothes as it was a lovely Summer Afternoon The Strand was crowded & every body looked a their best. I thoroughly enjoyed the Walk with the young Ladies who were Charming Companions. After taking a Train we eventually arrived at King’s Cross Road & upstairs to my Friend’s Home. People living in Flats was very strang to me. This House was ","82":" families\n 5 Flats each occupied by a Family it is built on the Top of the Tube\n\nRaily\n Railway (Inner Circle) at the Back of the House is a large Shaft for Ventilation purposes & one could hear the Rumbling Sound as each Electric Train passed along. When we went inside there were two more ladies who had arrived during the Afternoon so I was in Good Company 5 Ladies & Mr Smith & myself, we were soon seated around the Tea Table & all enjoyed the Compliments from one to the other. After Tea Mr & Mrs Smith took me around to see her Sister so after bidding the Young Ladies Good Bye we took a Low Train Underground to Waterloo. This Train goes down under & along a long Street, it has 3 Stopping places & there is 2 Lines, it goes underground for about 1 mile & then up again\n\nto the Surface, after leaving the Train & walking a short Distance we duly arrived at Mrs Smith Sister Flat, their name is \nRobertson\n Mr & Mrs Robertson. They are an elderly Couple & have no children Mr Robertson is in the Army Service Corp. & is on Home Service. I spent a very enjoyable evening chatting to my friends until about 10 Pm when we had supper & then my Friends came with me to the Station to say Good Bye. As there where a large number of Soldiers returning the Station was crowded with People. After thanking my friends for their Hospitality & Bade them Good Bye & passed through the Barrier & into the Train & in a few minutes we were off to our Camps. After a fairly fast run I arrived at Bordon at 12.30 am & after\n\na good walk I arrived at my quarters at 1 am & soon was in bed fast asleep.\n","83":"\n\nAs I am leaving for France in a day or So I now close No 1 Diary.\n\nNo 2 Diary will follow on.\n\nwe at am at Anchises Ulimarra.\n\n"}}