{"Document Name":{"0":"Diary_0293","1":"Diary_0293","2":"Diary_0293","3":"Diary_0293","4":"Diary_0293","5":"Diary_0293","6":"Diary_0293","7":"Diary_0293","8":"Diary_0293","9":"Diary_0293","10":"Diary_0293","11":"Diary_0293","12":"Diary_0293","13":"Diary_0293","14":"Diary_0293","15":"Diary_0293","16":"Diary_0293","17":"Diary_0293","18":"Diary_0293","19":"Diary_0293","20":"Diary_0293","21":"Diary_0293","22":"Diary_0293","23":"Diary_0293","24":"Diary_0293","25":"Diary_0293","26":"Diary_0293","27":"Diary_0293","28":"Diary_0293","29":"Diary_0293","30":"Diary_0293","31":"Diary_0293","32":"Diary_0293","33":"Diary_0293","34":"Diary_0293","35":"Diary_0293","36":"Diary_0293","37":"Diary_0293","38":"Diary_0293","39":"Diary_0293","40":"Diary_0293"},"Date":{"0":"unknown","1":1027.0,"2":1028.0,"3":1037.0,"4":1042.0,"5":1045.0,"6":1046.0,"7":1047.0,"8":1049.0,"9":1056.0,"10":1057.0,"11":1058.0,"12":1059.0,"13":1060.0,"14":1062.0,"15":1063.0,"16":1064.0,"17":1071.0,"18":1072.0,"19":1073.0,"20":1074.0,"21":1075.0,"22":1076.0,"23":1077.0,"24":1078.0,"25":1079.0,"26":1080.0,"27":1081.0,"28":1082.0,"29":1083.0,"30":1085.0,"31":1086.0,"32":1087.0,"33":1088.0,"34":1089.0,"35":1090.0,"36":1091.0,"37":1092.0,"38":1093.0,"39":1094.0,"40":1095.0},"Entry":{"0":"\n\n1916\n\n","1":"\n\nOffered self at Victoria Barracks for third time. Accepted as fit except for teeth and referred to Major Donald Smith re same and passes as `fit` by him.\n","2":" Vaccinated\n","3":" left by 7.25 P.M. Melbourne express and proceeded to Hobart.\n","4":" Acted as `best man` at Bob Williamson`s marriage.\n","5":" arrived home after a rough trip on the `Morraki`\n","6":" Examined in English 111 A\n","7":" Examined in History 11\n","8":" Examined in English 111 B\n","9":" -Miss A. Mills Xmas - Card - Durban - S.A.\n\n- Miss K .Pendergast\n","10":" - Miss E.Brooks - Card - Durban - S.A.\n\n- Mrs Rew\n","11":" - Mrs & Mr Falconer - Xmas Cd. - Durban. - S.A.\n","12":" - Miss J Falconer - Xmas Cd - Durban - S.A.\n","13":" - Mr. H.A. Wilson - X Cd - Durban - S.A.\n\n- Mrs H.A.Wilson - X Card - Durban - S.A. \n\n- Ken Wilson\n\n- Alan do\n\n- Toby do\n\n- Miss Angles (B)\n\n- Miss M. Buckley\n\n- Rev. Grant Forsyte\n\n- Mrs Macdonald (St -)\n\n- Aunt Mary (Melb)\n\n- Annie Rew\n","14":"\n\n Examined in Psychology 7 logic.\n\nOct. 31 \n\n Reported at Vic. Barracks. Pies and tea and cake served out by young ladies to recruits. Marched to showground and issued with dungarees etc; inoculated; final medical examination. Made aware that we would sail for England on 10th Prox. Sworn In .\n","15":"\n\n Marched to Railway Stn. Thence proceeded to Liverpool. There lectured by Adjutant and others on Camp duties, on the soldiers life generally, on his temptations and the attitude with which he should regard them. The Australian soldier has qualities hitherto unknown, but\n\n- (1) - Bob Cruikshank\n\n- (1) - Mrs. Cruikshank\n\n- (1 - Jack Gordon\n\n- (1) - F.Hynes\n","16":" - (1) - J.H.Moyes - Xm Cd Durban\n\n- (1) - W.Briggs\n","17":" - (1) - Prof.Wood - Card and note Indian Ocean\n","18":" - (1) - Dr. Lovell - Card and note Indian Ocean\n\n- (1) - Mr.J.Henderson\n\n- (1) - Mrs. Ewing\n\n- (1) - Miss. A.Ewing - Card and note Indian Ocean\n\n- (1) - Mrs. Macfarlane - Card and note Indian Ocean\n\n- (1) - Miss. J.Fletcher - Xmas Card - Durban\n","19":" - (3) - Mother and Father - letter Indian Ocean\n","20":" - (2) - Miss Symons - letter Indian Ocean\n\n21 Nov 16 - (2) - Miss Buckley - letter Indian Ocean\n\nevery soldier must be \ndisciplined\n, he must \nobey\n implicitly, and must remember that the true soldier is also a true man. Respect all women, shun those who have shown themselves unworthy of their glorious calling, cherish and guard those who are true to what God made them.\n\nOne feels very strongly on this point, for, while many of our men are presumably fighting to defend outrage honour, they nevertheless by word and deed worship every species of impurity. May we all be led to feel & understand that if we dare try to take another`s life because he has sinned, be place\n\n21 Nov 16 - (2 Jessie - Post - Card Indian Ocean\n\n- (1) - Miss G.Hunt \n\n- (1) - Miss Quinn \n\n22 Nov 16 - (2) - Miss M.Scott – Letter - Indian Ocean\n\n22 Nov 16 - (2) - Cathie – Letter Indian Ocean \n\n21 Nov 16 - (2) - Miss J.Fletcher – letter Indian Ocean \" \n\n23 Nov 16 - (2) – George - Card Indian Ocean \n\n23 Nov 16 - (2) - Jeni Falconer \" \n\n25 Nov 16 - (2) - W.B.Briggs \" \n\n25 Nov 16 - (2) - Mr. Wilson \" \n\n25 Nov 16 - (2) - J.Gordon \" \n\n26 Nov 16 - (2) - Bob Cruikshank \" \n\n26 Nov 16 - (2) - Aunt Jessie \" \n\n28 Nov 16 - (2) - Miss A.Ewing \" \n\n28 Nov 16 - (2) - Aunt Agnes & Grandma Card Indian Ocean \n\n30 Nov 16 - (4) - Mother & Father - Card Indian Ocean \n\nthereby a great responsibility on our own shoulders both to perfect our own great failings and to make certain that neither in thought, nor in word or deed, do we countenance in our own lives that for which we so often condemn German and other hostile soldiers. \n\nThe private in the infantry should be a perfect gentleman and a right living citizen, otherwise his actions will condemn him as an unjustifiable murderer.\n\nNov. 2 \n\nMake out allotment paper. Begin to know a few of the lads. Allen Walker and Barry Heffernan are my particular friends but \n\n30th Nov.1916 - (2) – Mrs. H.O.Wilson – letter Indian Ocean\n\n9th Dec.1916 – (5) – Mother and Father – Letter between Durban and Cape T\n\n9th. Dec.1916 – (1) – Aunt Emma – Card – Durban and Cape T\n\nhave a growing love for some of the others, McManery etc. of whom more later. \n\nFinal leave allowed from 4.30 to 11 on 6th Nov.\n\nNov3 \n\nOn leave. Surfing & billiards. Presented by Mr Camboys - Under Sec. – and fellow. Officers with fine wristlet watch. A very touching ceremony .\n\nMy reply was to effect that the sacrifice being made was not on my part but on that of those dear to me.\n\nThe watch would help me to be punctual etc. but that was its least value, for it would be a treasure inasmuch as it reminded me of the good old days of friendly\n\nfellowship amongst the members of the Mines Dept. \n\nThe good wishes and warm handshakes received from everyone were sufficient in themselves to stir the dullest, most unfeeling heart to strenuous endeavour and never-ending determination, but to a mind open to and seeking such encouragement, they came as living coals upon ones fevered lips to give incalculable inspiration for an eternity of struggling.\n\nNov 8\n\nFarewell social at St.Enoch`s\n\nNov 11\n\nFall in at 3 A.M. Embark on \"Suevic” A29 at 7 A.M. in Wooloomooloo Bay leave wharf almost immediately and stay in midstream till 12 noon. Then set sail and\n\nwith a gay patrol of motor-boats to the heads plunge forth into the great unknown buoyed up with the atmosphere of moral support, strengthened by unknown but almighty Power. \n\nThe day was bright and beautiful in every respect, and well suited as an omen to the accomplishment of the task before us. \n\nMeals on board are excellent. Our mess-room and sleeping room combined is right foreword. All have hammocks which we sling each night to the ceiling and which are infinitely more comfortable than cabin-beds.\n\nNov 12\n\nFine day. Allen & self explore much of the ship from end to end. We went down into the engine-rooom and explore nearly everything to be seen down there\n\nuntil the engineer intervened. We also found a nice `private room` under the canvas of one of the life-boats which is slung over the side of the ship and there we had a pleasant afternoon nap and after smoking away comfortably at our pipes like two old soldiers. \n\nMet a certain Mr. Marr an old high-school mate who is an officer to one of the battalions on board.\n\nWe passed close by several ships today, and the boys cheered as though they were charging an enemy trench. \n\nSaw a great number of porpoises and migrating birds and what seemed to be several whales. Allen and I have found a little `nest` which we call\n\n\"Annie`s Room” and which is situate between the ceiling of our bed-room and the floor of the next deck up.\n\nWe are right against a port-hole up there and Allen cleans his teeth by letting his tooth-brush out on a string into the ocean etc. \n\nOur room is two stories down in the foremost hold and has full accommodation for about 240 or 250 men and all within it make up a very happy and fairly contented company.\n\nAs the hours of this, our first Sunday on board, went past, we continually imagined to ourselves what our people would be doing,\n\nwhether going to church or etc.\n\nOur vessel is a fine one, 15.000 tons and doing about 12 knots, slow but sure. \n\nShe was wrecked some years ago and lost half-of herself on the rocks and all of her stern had to be built again.\n\nFrom our position in the life-boat we can see her almost from head to tail and right proud we feel of her grand dimensions, more proud are we of all the brave boys aboard.\n\nNov 13\n\nAllen and self up with a few others at 6 A.M. to hose and sweep down the decks. With boots off and trousers up and water splashing everywhere our happiness was\n\nwell-nigh complete. Seqs beginning to get rough, especially after we passed Cape Otway.\n\nNov 14\n\nStormy weather. I never imagined that such a big ship as ours could be so helpless in face of the elements.The waves simply lifted her aloft and shook her as though angry with her, and then tossed her down again, altogether disgusted with her. \n\nOur speed was much curtailed in view of the heavy winds but no doubt we will arrive somewhere sometime. \n\nThe lads were very sick today but can still sing and laugh. When all seems gloomy and hopeless they sang \"The big world still goes rolling round.”\n\nThat reminds me that on Sunday evening we had a\n\nlittle service on the upper deck and sang many hymns notably \" Where is my wandering boy tonight \" and \"lead kindly light amid the encircling gloom” and the captain gave an address on this hymn showing explaining that the `valley of the shadow` was not altogether dark, but was brightened by a shining star, which would lead us on in the right path, and which would likewise, cast a ray of hope and beauty on our way.\n\nBy way of diversion, Allen was this afternoon playing with the foremost port hole in our room and when trying to screw it up extra tight broke the screwright across. He scampered across the ceiling, and up the stairs straight\n\nto the captain on the bridge and told him and before he got back again a man was there mending it but not before two or three seas had burst through, soaking our hammocks and washing right across the nearest tables.\n\nNov 15\n\nStill very rough and stormy, being by this time half-way across the `Bight`a notorious place for dirty weather. Plates and dixies fly about everywhere, full ones as well as empty ones, and the orderlies have been spilling stew and vegetables down the stairs and everywhere. \n\nAlmost every wave now comes splashing right across the middle deck. On the top deck it is much better although windy for there we all sit together on the floor, nestling close like\n\nso many pups on a cold night. We all make pillows of one another, and no one minds, for if Bill lies on Jim`s legs the latter will be so much the warmer.\n\nMutual help and mutual dependence seems to be the order of the day. \n\nJust this morning I saw a big bewhiskered fellow getting across the deck with a bed under his arm and someone wanted to know where he was going to doss the reply was that he was only going to fix up a decent bed for a sick chap. In the same way many sea-sick fellows are fed and looked after every day.\n\nAfter a sing-song on top after tea, Allen and I dossed on the deck. There were so many of us on the boards, and \n\nwe cuddled so close to one another that despite wind and spray we were all as warm as bunnies but had to get out rather early in the morning to escape the deck hose.\n\nNow, for the first time, do I realise the glorious privilege of being one in a body of Australian soldiers. The brotherly feeling which exists everywhere on board is very strengthening, for we are in truth brothers in trouble, brothers in sacrifice, brothers in love of home and Australia, brothers in anticipation of suffering, and heroism. \n\nYesterday it was rather rough and the middle deck was quite flooded and one of the boys dropped his hat in the water and there\n\nwas only one boy near without his boots on, but he was too much occupied with his own fears to try and get the hat and I overheard someone saying that the next minute or so this same chap would be calling the one who lost his hat `brother.` The remark had the desired effect and the hat was at once rescued.\n\nOwing to the rough weather and the almost universal indisposition on board most of have not shaven since leaving port so you can well guess what `Australia` looks like on A.229.\n\nI forgot to note that the Governor-General of Australia came through our transport the day we embarked and addressed us in our \n\nmess-room in the forecastle. He said we were most tidy in every way, and that he was sure that `Australia`would continue to make herself felt across the the seas; and we thought so too and expressed our feelings on the matter by three echoing cheers. Even the cockpit of the \"Victory” never heard such cheers, and even her heroes were not so sure of success as are we.\n\nNov 16\n\nHave my hammock on deck now and intend to make this my permanent `bedroom`. From here I can see the angry sea by day and the speaking stars, `the poetry of heaven` by night. \n\nOne night on waking at about 2 A.M. I saw the moon coming up through\n\nthe clouds . The picture was complete and I could not help sitting up in bed, in order to see all there was to be seen. The white shining caps on the waves reflecting the rays of the silvery moon, the rolling clouds , the roar of wind and wave, the rows of silent sleepers along the deck at by side all sent a thrill through my heart and made me feel \"how excellent is it to be alive” and how unfathomable are the creatures of Him who made and cares for all things.\n\nAfter a fine day`s trip Allen and I took a blanket up on to the prow of the boat and there chatted till bed-time and there we realised what it is to be truly contented for we thought\n\nand spoke concerning the deepest depths of human experience and drank richly of the cup prepared for all who will but drink.\n\nNov 17\n\nFinds us 1,500 miles from `dear old Sydney Town` the weather still perfect. I am mess orderly for the day and my duties are as follows. Rise at 5.30, take down hammock ,fold blankets and hammock together, parade before.bake-house by 6 for bread for my table; parade at 7.15 for breakfast rations , viz fish and coffee; after breakfast my mate and I wash up polish all our knives forks and spoons and dixies till you can see your face in them and then arrange them on end of table for daily inspection and officer. Same performance for dinner; more bread at 4 P.M. tea at 5 \n\nWe have company parades at 10 A.M. & 2 P.M. but so far the boat has been too wet amp; unsteady for drilling but we expect soon to commence physical training of various sorts at these parades in order to get us fit for our coming work. We go to bed early; lights out at 9.30.\n\nWe are not quite used to the sea and are beginning to feel as fit as fighting –cocks. We often hear the expression \"home was never like this” but I guess it is seldom meant to be taken literally.\n\nA good number of the boys have excellent voices and often at night, when the lights are turned down we are greeted with burts of song. Two boys just near me sing together so beautifully\n\nHad my hair cropped short today and cannot part it now. With white shoes, puttees, bare-knees, short pants and dungaree coat, gaol-bird crop and little red cap, I would hardly be recognised by you now.\n\nNov.18\n\nWe are launching out into the great Indian Ocean this morning. The sea is beautifully calm at present but the sky is somewhat overcast. However it is\n\nan ill wind that blows no good for we will be able to evade `drill` is somewhat misleading unless qualified by an explanation. Our physical `drill` is of a most informal and most interesting kind. We skip, box, jump along in lines something like golly-wogs, and some of the contortions that the boys undergo in trying to master some of the new exercises are most amusing, and most of them, including the instructor, often tumble over with laughing. Our `comforts` fund has also supplied cards, quoits, dominoes etc. for out use, so ou can see how well we can occupy our time. So much concerning our `drill`.\n\nLast night we3 saw for the first time in\n\nour lives, the sun setting in the ocean . This was quite a novelty to most of us, and as warm-hearted old Sol sunk out of sight and left behind him his train of brilliant colours our thoughts wandered with him to persons and things now hidden from out view by the intervening seas.\n\nWe passed a mail steamer at 9 AM. But she was so far away that we could not see her too plainly.\n\n12 O`clock noon today we sight the South West extremity of Australia and have the last - for a while – glimpse of out native land. One might expect to see a touch of pathos in this parting –scene, but all the boys seem too full for words, or tears, just having finished their dinner. They are all\n\nsitting or lying on deck, half asleep, or quite asleep, or dozing.\n\nWe met among our men a chap de Winton Jones by name, who is attached to the Pres.n Church of Victoria, - one of John Flinns mission agents, he seems to have been, and he is really a fine fellow, although somewhat talkative and over-confiding. He was just telling Allen & self that he is engaged and that he has really very much missed his fiancée since leaving Sydney , and we thought this to be a very remarkable thing under the circumstances.\n\nSaturday afternoon being half-holiday on board Allen & yours truly have found a nice corner right aft and there we smoke & talk and write all the afternoon despite\n\nthe invitation given by one of the boys to have a trip to Manly and a little light refreshments, strawberries & cream etc down George St.\n\nGambling is going on everywhere, two-up , cards etc; needless to say we \"taboo” all such things. We are very thankful that the `canteen ale` has only 2 percent of spirits in it and consequently there is no drunkenness aboard, for the men could drink this stuff all day without serious results accruing.\n\nMatters looked like the `real thing` when we were all issued with life-belts and ordered to parade with them on this morning. But alarm was unnecessary, for the life-belt parade is merely a precoutionary measure to prepare us for possible future emergencies. We have\n\nno need to fear torpedoes yet although a good look-out is always kept, not only the officer and A.B. on the bridge being always on the qui vive,but also an A.B. on the stem of the prow and another in a look-out box about halfway up the fore-mast. These lookouts are kept at all ours of the day and night, the silent `watchers of the deep` ever guarding us and the king`s interests.\n\nNov 19 (Sunday)\n\nTo-day we have an easy time and we need it after the strenuous exertions put forth last night at our concert. Thanks to the Captains generosity, and the sailors handiness a large tarpaulin was stretched over amidships and underneath its sheltering wings several hundred of the boys sat in happy delight, enjoying in silent(?) admiration of the gay\n\nflags which decked the impromptu stage and listened in silent (???) awe to the very entertaining items given by the lads. The concern was extremely novel and delightful to both Allen and myself. \n\nhe boat rolled steadily along, and we could feel the throb of her mighty heart; we got occasional glimpses of the setting sun through interstrices in the canvas awning; we could see a strip of dark blue sea on either side of us, and in the midst of it all, as happy as could be, and oblivious of all else, the boys lost themselves for the time in the amusement of the moment. Allen & I had an exalted position on a piece of flooring-mat fixed between two of the donkey engines on an\n\nupper deck from which we could see both the officer on the \"stage” and the man in the \"pit”\n\nAfter a heavy tea of fresh bread & butter, pickled onions & cheese, which were issued to us, and tinned herrings & more bread, and fancy biscuits, which we bought, and after the heroic efforts at making a noise at the concert, we all turned into our hammocks, tired out but happy, ad unium.\n\nAfter dolling ourselves up in out tunics and khaki trousers, and polishing up our boots (but not brushing our hair, for we can`t) we attended church parade this morning but I was a little disappointed for the chaplain did not seem to make the best of the good opportunity which has been placed\n\nin his way.\n\nI would here beg of any casual leader who may peruse these records of an interested mind to forgive the mosaic method of mixing the various themes mentioned but the circumstances of the case make a connected narrative well- nigh impossible .\n\nOn board A.29. everybody takes the liberty of speaking to everybody else and last night Allen & I were talking to a stranger about things in general & happened to speak about the engine and this chap gave us his views about it. He had thought that the refrigerating engine drove the ship, and later when he saw the real engine descrbed it as being a number of inverted boilers (meaning cylinders) with rods (pistons) moving in &\n\nEv Sun wet & cool wind etc.\n\nThose at home\n\nStill small voice \n\nout of them\n\nNov 20\n\nThis same chap is very friendly when speaking to us, and keeps patting Allen or me on the shoulder & knee to inforess his words ; he seems a bit countrified, but is delighted with the trip, and on one occasion exclaimed, with gusto, \"I never et so much in my life”.\n\nThere is another `bird` down in our mess-room a real `pommy` with a voice that can be heard everywhere, He is evidently a born worker for besides his ordinary duties he & his mate (Bottle & Murphy by names) have arranged for a small consideration to act as mess orderlies for their table all the trip . He also shaves & cleans boots for 1\/- he takes in washing from \n\nthe boys, and to cap all, the other day he purchased a bag full of bottles of Ale, biscuits, fruit etc etc from the canteen & now has a \"shop” of his own, down stairs, on the end of his tables & sells things at double price, and gets it too, on account of the difficulty of getting through the crush at the canteen. As a finale to his work he collects the empty bottles & gets 1d each for them & one day he returned 63 in this way.\n\nThe boys have about half-an-hour to wait outside the cook-house each meal, and generally wax very loquacious. They once asked the cook about some roast turkey or such and we were told that there was plenty roast duck for us that day and that the\n\ncook had left a few feathers in each of their wings in order to give them a bit of flavour They also asked for more fruit in their Sunday`s pudding & were told to apply to the \"Sultana-Sergeant.”\n\nWhen we turn in at night & the sergeant calls out for`lights-out`, feeling homesick , yellout with emotion, often passionate in its extreme pathos (!?) `kiss me sergeant.`\n\nDe Winton Jones, before-mentioned, fell (?) out of his hammock last night. Some one basely suggested that he was assisted in this manoeuvre, but all that I can add by way of explanation is`honi soit qui mal-y-pense`.\n\nToday is just perfection. The sea is calm,\n\nsave for the steady swell and the tiny splashes on the surface of the ocean which dance & twinkle like so many stars in an ocean of blue. The sky is clear, except that here & there blotches of white cloud, soft as fleecy wool, or loose kapok, have scattered themselves, the better to help us appreciate the depth of their blue background. \n\nAllen & I are up high (Australia always on top), right on the summit of the engine-house, Alllen trying to sleep, myself trying to scribble . Time is 9 A.M. breakfast being in the process of digestion.\n\nLast night at 7.30 we had a song-service on the middle deck and there once again in a vivid but inarticulate and incommunicable way we learnt something of the power of the Spirit\n\ndark world & wide`. There is a text which says `where there is no vision, the people perish` and I often used to wonder why we were not told what would be the result where there was a glorious vision; now I believe that it was because the writer feared lest mere words would fail him in this altogether.\n\nAt 10.A.M. Parade we had a few good games; for one, we all (18 in our section) sat in a circle on the deck and one of us had to stand up aslant in the middle and keep stiff & let the rest pass him round & the first to let him fall had to go in the middle etc. \n\nWe also played with the medicine ball, which is as big as a soccer ball & full of straw or such. We also skipped , `all-in together` etc & some of them\n\nhad a box with the gloves. A boxing tournament is beginning this afternoon, and nearly all the lads will be there, but I am not over fond of such things yet, and prefer to stay down in our quarters & write etc. No doubt there will be plenty of time and opportunity for all of us to exercise our pugilistic instincts when we come in touch with the Germans.\n\nOur ship is a twin screw and her engines are arranged somewhat differently from those of other ships which I have see, so I add a plan of the cylinders.\n\nNov.21.\n\nWeather somewhat cold & rainy this morning, but still nice & cosy downstairs. \n\nA unique announcement was made by officer last night. Just as we were getting ready for bed, singing furiously to the squeak of a fiddle, he told us that a member of the 53rd Battn had died in the afternoon and that he would be buried, or at least that the early case of his spirit would be left to the keeping of the deep until that day when `the sea shall give up its dead`.and I thought of the picture in Jessie`s book which illustrates this subject. \n\nAt 9 P.M. the engines were stopped and the ceremony of a burial at sea performed. It was with quieter hearts that we turned into our hammocks, and slept awhile!\n\nDay turned out to be fine but \n\nuneventful.\n\nAll the guards on the ship now wear life-belts constantly, but this is merely a precautionary measure in case of accident. Turned in at 8 P.M.\n","21":"\n\nNot feeling too good to-day and the weather is somewhat rough & stormy but appears to be clearing up again, \n\nThis afternoon is our `washing day` and we have to wash all our dirty clothes ourselves & hang them on lines just like the sailors do on the men-of –war.\n\nWe have been putting our watches back every night 21 minutes and so we must be quite a considerable time behind you by now. When we get up at 6\n\nRun,what,complaint\n\nin the morning, you will be well on in your day`s work.\n","22":"\n\nOn duty as Quartermaster`s assistant for today from 7-9AM. 1-3 & 7-9 P.M, which means practically that I am to do nothing. For, while on duty I have merely to sit on a box in the corner & keep a tally of the sporting material etc used by the Company & besides I have four hours off between each shift during which time I can read & write. \n\nAnd so here I sit on my box, munching ginger-nuts and half-asleep. I read a number of poems by Mrs Browning this morning – most of which are really excellent, especially that one entitled \"He giveth his beloved sleep”\n\n\"What would we give to our beloved? \n\n\"The heros heart, to be unmoved,\n\n\"The poet`s star turned harp, to sweep , \n\n\"The patriot`s voice, to teach & rouse,\n\n\"The monarch`s crown, to light the brows\n\n\"He giveth His beloved, sleep,\n\n\"O earth, so full of dreary noises!\n\n\"O men, with wailing in your voices!\n\n\"O delved gold, the wailers weep!\n\n:O strife, O curse, that o`er it fall!\n\n\"God makes a silence through you all\n\n\"and giveth His beloved sleep”\n\nThe psalmist David, whose words these are, was also a soldier & like us wandered far from home,& was often times lonely & weary; his words of\n\ncomfort are as true for us as they were for him.\n\nAllen & I had a stroll onto the prow of the ship last night just before turning in. The picture there presenting itself possessed more of awe and majesty than otherwise. \n\nThe sky had a gleam like newly cut lead except where the last rays of the setting sun glowed behind the clouds like molten silver. \n\nThe sea was smooth & dull except where our prow cut it insunder, and there the phosphorescent foam shone like snow on a sunlit mountain-side and all along the ships side could be\n\nseen tiny spots of light, apparently resulting from the movement of the fish below. And then behind us in utter darkness except for the red & green lights came silently onward our great ship, almost terrible in its solitude & inanimate grandeur. \n\nThe sea by night is weird & yet fascinating; lonely but homely; silent but more eloquent than words, and the stars are still the poetry of heaven\n\nAllen & I always read together the allotment for each evening from my `Daily Light` so if you do the same you will always know exactly the thoughts &\n\nThe hopes with which our eyelids close each night.\n\nBy way of anti-climax, we had a novelty in the way of jam for tea to-night. It is called rheubarb jam and judging from taste & appearance I should say that it consisted of rheubarb & plums in about equal proportions & is really excellent as is also the marmalade which we occasionally get. \n\nIn fact, although I do not generally eat marmalade at all, I liked it so well the other night that I ate so much that I do not think I will ever be able to look at it again - till next time.\n\nI read an article in `The Forum` on Revolution in organised Religion which railed against the apathy in modern church\n\nRumour, plans, grumbling\n\nlife but failed to suggest a remedy. Perhaps the present struggle in which we are engaged will of itself suggest what measures may be taken or perhaps the apathy itself is but the necessary forerunner of a reconsecration of the Christian Church.But these questions are too hard to answer yet. And there is a more immediate work for our hands to do ere we return to the work which we have left in the keeping of others in the meanwhile.\n","23":"\n\nSea is beautifully calm & serene this morning and all of us are feeling particularly fit.\n\nRumour is ever a great source of error but on ship its exaggerations become amusing. By rumour, men have died in hospital, the ship is under quarantine,\n\nwhales have been seen, one of the main engines has been out of gear, we are going to train in S.Africa for two months and a thousand other unfounded things,, But by way of climax, one of our firemen has dreamt for three nights following that on a certain day next month our ship is to be torpedoed. Some of the boys no doubt place faith in such superstitions, but, whether or no, I think they will be greatly disappointed if we do not come upon shoals of periscopes before our journey`s end.\n\nDespite the fine treatment and good wholesome food which we receive on board our transport, the great majority of the men are constantly\n\ngrumbling. This is specially evident at meal times, when they turn up their noses at everything. Many of them I am sure have never had such decent stuff in their lives before & yet last night for instance one table of ten men did not touch a fine big dish full of rice & dried apples, and they complained to the officers & made a great fuss about it. Needless to say Allen & I made hay whle the sun shone & when we had finished our own share of it, `divvied` on what was left until we were almost too full for words. \n\nI think that lots of the men have never heard of dried apples or apricots before , & think that they are being imposed upon when it is served to them. At any rate such cannot have any \n\nspirit of patriotism or any idea of self-sacrifice for a noble cause, for if they had they might substituting something of Stoic heroism for their Epicurean propensity if the eating of stewed apricots is a hardship to them. And further, if such things represent hardships to some, surely they have further to go before they reach the trenches than those who have learnt elsewhere to moderate the lower tendencies of human nature when hope & glorious odds are at stake.\n","24":"\n\nUsual routine today, including a strenuous game with the medicine ball. We also received our first pay on ship, which mounted to 10\/- the balance being held till we reach England.\n\nAllen & I having called on the chief Engineer yesterday and finding that he had no objections to out proposals, we visited the engine-room once more & as we now had the proper authority we made a most thorough inspection of everything that was to be seen and for half-an hour or so wandered between eccentrics & cranks & pumps & steam-pipes.\n\nWe went along the main shaft tunnel, which is about 150 or more feet long and were within about 4 feet of the propeller & saw the water trickling through the propellor bearings. The shaft must be about 14 inches thick.\n\nWe next went into the stokehold and stayed there for about 15 minutes. We saw every detail of the \n\nstoking process. When the fireman first opened one of the furnaces we thought we would shrivel up, and at once the sweat started out all over our bodies but in time we got a little used to it. \n\nThere are 4 main boilers with 3 furnaces at each end and one smaller boiler with 3 furnaces at each end and one smaller boiler with 3 furnaces only, making a total of 27 furnaces each one of which is enormous and almost white hot. \n\nAfter coming on deck again we had a fine salt-water shower while we were yet hot & felt as fit as lions for our tea.\n","25":" Third Sunday on board.\n\nChurch Parade at 9.30 Service was much better than last Sunday but one wonders whether these services do any good, for where Allen & I are now sitting it seems as though we were in the midst of some huge gambling saloon and we can hear nothing but \n\nthe noise of the two-schools and on all sides are little groups playing at all sorts of gambling games. This practice never ceases and although the officers have forbidden it, there sees to be no abatement at all.\n\nEarly this morning I saw for the first time, a flying-fish. It was about 6 or 9 inches long & looked just like a toy aeroplane & travelled about 30 yards in the air. It is shaped roughly like this:-\n\nand seems to glide through the air without moving its wings at all.\n","26":"\n\nAs many of the hammocks which had been brought on deck got soaked with the rain & spray, Allen & I had to return to our proper\n\n ships mail\n\nsleeping quarters last week, but it became so dreadfully hot down stairs that we determined to find a cooler sleeping-place and so last night we took our hammocks right up on to the top of the forecastle and slung them side by side from the railing to a pair of bosses just about 20 feet from the prow of the ship & with nothing overhead but the star-spangled canopy of heaven.\n\nBy 9 o`clock we were hidden between the sides of our hammocks & were soon asleep on the deep` The air was delightfully fresh, even cold, & we rose at 5.30, feeling quite renewed in vigor. Needless to say, we intend sleeping there every night until we meet wet weather.\n\nI have been made orderly for out table for this week & on that account am freed from all other duties & so J.D.M is to be seen all day long, \n\nin shorts , with no coat & no hat & sleeves rolled above his elbows, washing polishing, carving etc. \n\nToday at dinner time I carved two big joints of beef, and had to do it in a hurry too, for the boys are always hungry. This part of the work is rather menial and in fact one has often to sink his own wishes and to be the servant of all sorts of men but while at work to-day I thought of One who although the Son of the Almighty, came as a minister to many and even on one occasion, as Mrs. Browning points out , washed his disciples` feet. \n\nThis thought was a great consolation to me in my vocation as private in the Infantry & I thought of Ken & imagined that perhaps, after all, this saying is true, \" the last shall be first”.\n\nOur duties being over early in the day I found a nice `posie` between our ceiling & the next floor right against the port-hole & there with Mrs.Brownings poems & a packet of chocolates, & the fresh breeze right off the sea which was just a few feet away, the world & its troubles melted out of my memory & the bliss of heaven entered only to be distubed when it was time to get dinner ready.\n\nIt is evening now, & once more Allen & I muse audibly to one another on our past experiences & our ideals for the future, until the sun sets & leaves the world to darkness & to us; still we sit on till the stars shine out brightly , & we think of all at home in Australia by\n\nnow soundly sleeping and then down for hammocks & another day separates us from all we love except Him whom the darkness cannot hide ; to whom the night shineth as the day. \n\nAnd so life goes on & `each morning sees some work begun, each evening sees it close,` something attempted something begun, has earned a night`s repose`\n","27":"\n\nLeg-pulling is practised extensively on board, especially at the expense of some few of the weaker-minded members of our crowd. For instance, one chap came down this morning with the news to one of the boys that a tug had come alongside in the night & had left the mail, and the fellow quite \n\nnaively went to the non-com & asked for his letters. They were also circulating the news that there was an accumulation of ashes in the stokehold & that the engineers were going to take the funnel off in order to clean these out. In fact the weather is so warm that they are going to bring the boilers up onto one of the upper decks in order to be able to get to them better.The weather, too, is going to be so rough that a reef has to be taken off the rudder, lest it be entirely washed away.\n\nToday is extremely hot especially down stairs & the sweat runs out of us while doing our orderly work. After my dinner had settled & all our washing-up was done, I\n\nhad to skip to get up a good sweat & then had a beautiful ,cool, refreshing salt-water shower which made me feel fit for anything.\n\nSo far we have been in wireless communication with Australia ,and have heard a brief summary of the current news, re referendum, strike war etc, but we are now in communication with Mauritius, a British Island off the African coast. The latest message from there was not too promising with regard to the Allies advance but, no doubt, better times will come & the dark cloud will be turned inside out, revealing the silver lining which lurks there.\n","28":"\n\nDavid was a soldier, and had to leave home & native village, but at times at least\n\nhe was tremendously optimistic and his words, spoke from the deeps of his soul & recorded in the few psalms following on from Ps.120 cannot but inspire all who find themselves in circumstances similar to his.\n\nWashing day again to-day. And by now we are quite experts at this branch of the service. I washed two shirts,1 handkerchief, two pairs sox, one towel. And one white hat. All of these were washed both on inside & outside, and dried on the inside first. It is hard to get the white hat stiff, but they say that if salt-water is used to wash it, starch can be dispersed with.\n\nThe sun was very warm to-day but the weather otherwise was fine. Dominoes occupied part of the evening; bed at 9.P.M.\n","29":"\n\nWe were surprised this morning to notice how the time was flying and we wondered if the time since we left Sydney seemed as short to you as it does to us.\n\nA 1rude awakening` was our lot this morning. After getting my dixie in the cook-house line at 4.30 I was just nicely tucked in my bunk again when the warning was given that the decks were to be hosed and so 5 A.M. found us with hammocks rolled & stowed away and enjoying the glorious warmth of the rising sun.\n\nfor, although the stars & moon are inspiring in their own way, they seem cold & dead in contrast with Sol as he rises out of the Eastern Sea. The stars & moon are like memories clinging to the depths of the soul, they remind one of the dying past, but Sol is full of the vigour of a new day`s ideals and hopes and aspirations and he advances as the others pass away.\n\nSome of the boys, - in fact the majority of them hate the sea by now, and one constantly hears it said that they will never go to sea again & this reminded me of that exclamation of John`s , spoken at a time when the sea surrounding him, and meant to describe one of the great\n\nBattle`s 8 and\n\nP30\n\nattractions of heaven, \"there was no more sea”. On the other hand the ocean seems so glorious & so wonderful & so sublime to me that I prefer to think of the `crystal sea` upon whose shores His beloved will one day rejoice. The sea has a tremendous attraction for me now, & I revel in watching it as the hours go by.\n","30":"\n\nPrivate Battle, above mentioned (on P30) held the inaugural performance of the 19th Battn Band. He got one of the seamen to rig up a bass drum, which consisted of a small keg with canvas sretched over the ends. The other instruments are as numerous & various as are our dixies\n\nand spoons. Some consist of bottles filled with spoons which we shake violently; the bell effect is obtained by suspending the metal part of the entrenching tool by a string & banging it with a knife, mouth-organs, a mandolin & whistles and numerous kettle-drums, in the shape of dixie lids, partly complete the means whereby bright martial music is called into being. \n\nWe enjoy this immensely, as the beaming faces testify. The `band` paraded round the deck in the evening, more to our gratification and amusement than to the enjoyment of the audiences.\n\nGood health and novelty of environment, combined with a deep determination not to turn back from the plough to which we have set our\n\nhands, assist greatly in helping us to forget that we are away from home & country .Especially when we are engaged in making our organised noise, - called music by some – are we inclined to feel `home was never like this`.\n\nIt is only in the quiet evening hour, when lights are out & we lie gazing at the stars above that we feel the need of something stronger than ourselves, to whisper that `God`s in his heaven etc`, and to uphold us in the belief that all is not vanity , & vexation of spirit.\n","31":"\n\nThe orderly for the table next to mine has always appeared to me as being of an approachable sort & consequently, on hearing him say something about Newtown one day\n\nI asked him where he lived & to my surprise he told me Watkin St. and further, he lives in the terrace at the side of our place, six doors from the end, and it was he who used to practise bicycling on that patent rider that used to make so much noise & he remembers the children looking over the back fence at him. Strange is seems that we should meet so far away!\n","32":"\n\n Fourth Sunday at sea and still well & happy. Wind arose from the north last night and is blowing fairly strongly. At about 2.30 this morning myself & a number of other sleepers were surprised in our deck bunks by an extra large wave which\n\nby the aid of the wind scattered itself, & us all over the deck . There was a hurried awakening, a grabbing for blankets, shirts etc in the dark & an ignominous descent into our more sheltered but less comfortable quarters in the fore-hold; and on the floor of that latter place, in a spare corner, yours truly dossed till 5.30 as though nothing had happened.\n\nLast night at 7.30 we lowered a second chap into a watery grave. He had been coughing the night before & broke a blood-vessel and died within about 16 hours. Once more we were assembled in our quarters and those who wished were marched right aft to witness the short ceremony; and \"his day`s work was done”.\n","33":"\n\nIt was very stormy when we turned\n\nWater\n\nBath\n\nSpectations\n\nMock trial\n\ninto bed last night, but a few of us determined to run the risk of sleeping on top, and as a consequence met our \"Waterloo” exactly at midnight. This time it was not the rain merely, or even spray, but a veritable torrent of salt water that nearly drowned us. Out beds were so soaked that we simply grabbed shoes etc & fled leaving blankets & all behind, and sought shelter below. The chap next me was so wet that he had to dry himself with a towel after taking his pyjama-shirt off. But the fun was fine & well worth the wetting, which ran off like water from a duck`s back!\n\nTo-day we had a compulsory shower parade and every section aboard had in\n\nturn to strip off on deck and file into the shower rooms & then back to their clothes on the deck. More fun !!. Photographs would have been good …but …ha! ha! ha!!!!\n\nWe expect to arrive at Durban early tomorrow and so one can imagine the state of feeling aboard just at present. But we must still wait to see what the morrow will disclose.\n\nA mock trial is to be held in a few minutes from now, and one of our men, De Winton Jones (above- mentioned) is the prisoner & is being accused of breach-of-promise. An example of the humour of the case is illustrated by an extract from a letter\n\n Summery of trip so far\n\nyellow flag\n\nEarly repeats\n\nIn sight ,boat,shove\n\nCalm,blue\n\nDockers on wharf\n\nN.Z.men.\n\nRickshaws\n\nDescribe cliffs etc\n\nTown hall etc.\n\nwritten by the defendant in which he says \"I will cleave to you like the flees to a dog`s belly.\n","34":"\n\nArrrive in Durban at about 9.30 this morning after a fine approach. \n\nTo summarise re the trip from Sydney, we had a smooth passage to Bass Strait but met heavy seas & stormy weather through the Bight. The Indian Ocean was exceedingly calm except for two days which were a bit blowy & rough.\n\nFor an hour or more before we reached Durban, the shore was clearly seen by us as we clustered anxiously around the rails, watching & waiting & wondering. At last we passed the Lighthouse & steamed up the approach to the harbour which was \n\n Free tram ride & views.\n\nStreets etc & flowers trees\n","35":" cities black & white\n\nTea in Anzac Café\n\n& eels all other in daintiness,coffee,toast etc rolls\n\neggs & bacon ,fruit salad more coffee \n\nexceedingly commodious and to our surprise was quite a busy shipping centre with something like 2 miles more or less of wharfage.\n\nThe only defect is with regard to the entrance which is very narrow, & artificially deepened, & protected by a stone breakwater.\n\nWe were somewhat chagrined when a yellow flag was hoisted to the mast-top, but our doubts were soon dispelled , for the medical authorities exempted us from quarantine & down came the `dirty yeller`.\n\nWe went alongside the wharf & coaling commenced immediately.\n\nWe were granted leave from 3 to 10.30 P.M. and spent the time till then in watching the blacks on the wharf; they were an endless source of amusement to all the boys.\n\n Y.M.C.A. & girls\n\nWesley Hall\n\nZulus & kaffirs\n\nMarch back\n\nBlack labour\n\nBlack coalers at night \n\nAt 2.30 P.M. we filed off the ship & marched in column of route to the Town Hall, a distance of 2½ miles & were there dismissed. Alan & I wandered through the city ,bought our Post-cards & addressed them from the Soldiers Institute; we then had tea in one of the finest restaurants I have ever been in or seen. Strawberries & cream, toast & coffee, eggs & bacon & more coffee & meat rolls were a few of the articles which did the disappearing trick.\n\nWe visited the Y.M.C.A. which was thrown open to soldiers, we had a round trip in the tram, which is free to soldiers, visited Wesley Hall, where free feeds & free concerts never end & from which the badge I am sending out, came .Later we had more tram & then marched \n","36":"\n\n leave granted\n\nPicquet Police St \n\nback to the boat, arriving there at 11.30, tired, soaking with the wet, for we were caught in a shower & had doubled for part of the march. Alan & I had a shower & turned in at about 12 midnight.\n\nOn the next day, 6th Dec, we again had leave for a similar time. We went by free tram to the Zoological Gardens, which are free to soldiers and are really magnificent, though small. They are set out with great taste and are `Gardens` in very deed.\n\nAmong other animals we saw some penguins; these are birds which cannot fly but walk upright on their legs & are sometimes called `Soldier-birds` on that account. \n\nThere was also a fine Bengal tiger, a crocodile, a seal & a number of Australian eagles\n\nand kangaroos & wallabies. The boys made a great point of asking the keeper what the Kangaroos were, & where they came from, professing entire ignorance of such a kind of animal\n\nFrom the Zoo we returned to Y.M.C.A. Hut for tea , which was real good & only cost 4d each. 1d for each article, and one of the articles was fish salad!! & another coffee!! \n\nAfter tea Alan & I determined to visit & have a chat with the local Presbyterian minister, as we thought this would be more satisfactory than wandering round the streets. At the city directory we gained directions to his place and off we went. However when we got there, we found that the directory was out of date,\n\nMrs. Rowan, 485 Windermere Rd.\n\nStamford Hill, Durban. S.A.\n\nand that the Parson had left the city but the people who were in his house knew him & were evidently Presbyterians & the young lady asked us in, & we did not refuse In a few minutes a black boy servant in a white coat brought in coffee & cake & then we spent a delightful evening.\n\nThere were two fine girls, one about my age & one about 17, also an invalid son and the mother, who was one of the real good homely, motherly sort, & made us perfectly at home. \n\nThe eldest daughter Violet Rowan was in Germany when war was declared & had a very exciting time in returning thence to England; we sang & played & were very sorry when we had\n\nto leave. The girls podded the red berries which I am sending out to you. They left one pod in the box to let you see how they grew. The berries are consided as tokens of good-luck by the blacks and can be threaded on a string if a red-hot hat pin is used to bore a hole in them. We promised to write to these people again & to call there on our return trip.\n\nOur orders had been that we should sail at 1 o`clock but the sea was so stormy that we could not put out & stayed there another day, but I was on town picquet and so was on duty nearly all the time the rest were on leave. Our headquarters were the police-barracks, which we could not leave, but the\n\ntroops were so quiet in the city that we had very little work to do, but returned by midnight very tired and woke next morning","37":" to find ourselves outside the harbout & on our way South towards Cape Town.\n\nThe three days stay in Durban was beyond all doubt the best holiday I have ever had. Although the time was so short, the experiences which we met were legion, and it would take volumes to describe all that we saw and learned there. As soldiers, and especially as Australian soldiers, we seemed to have everything at out disposal and the people did their utmost to make our stay happy one.\n\nDurban really consists of two cities in one.\n\nThe blacks, Kaffirs & Zulus, live in one part and the Europeans in the other and we marched about 1½ miles through the former after leaving our ship. \n\nAll the menial work of the city is done by the natives and the Kaffirs coal the ships. The latter were in great force on the wharf all the time our boat was there, much to the amusement of the troops who threw pennies, potatoes & bits of cooked rabbit to them. Most of this class are very poorly dressed, and none of them wear boots or socks at all. \n\nThe native Zulus are tidier in appearance than these and seem to do all the unskilled work in Durban, such as driving carts etc, In fact I do not remember seeing a single white man\n\ndoing any menial job. The Zulus also pull the Rickshaws of which there are thousands in the city. Many of the boys had rides in these, and they take the place of cabs for the local residents.\n\nThe Zulus also have milk carts & luggage vans which they pull themselves. These people also hold positions as servants to the whites and are generally very nicely dressed in white trousers & coat & no boots, but their legs are so clean & shiny that these can well be dispersed with.\n\nThe native police wear a fine dark uniform with trousers to the knees & have a long stick as weapon. While we were on picquet duty at the police station\n\nwe saw one of these getting ready to do his rounds & he was washing down his legs in the yard with a big scrubbing brush & plenty of soap & made quite a good job of it.\n\nOn one occasion we saw a native woman with her baby tied on to her back with a strip of calico, or something like that , and the child seemed \"quite at home”.\n\nI couldn`t help liking the niggers, They always seemed so kind and were always smiling and chattering. We used to wave to them in the city and they always smiled, showing thir pearly teeth, and saluted us back . We also spoke to a good few of them, and they were very funny & interesting. I patted a few on the head\n\njust to feel their bristly little curls and their eyes twinkled with delight.\n\nThe two Post-Cards which I sent to George are real pictures of Ricksaw men, just as they appear. They are all dressed up somewhat gorgeously, with short pants only about half way down to their knees, and make a pretty sight as they fly along the city streets with their light vehickles & gay passengers. The feather which I am sending was pulled out of the adornments of one of these Ricksas whilst we were plying the owner with our foolish questions.\n\nOf course the coaling of our boat went on all night & throughout that time we could hear the Kaffirs singing as they worked.\n\nabout forty of them were engaged on one hatch and carried the coal up gangways in baskets, singing a peculiar drone kind of song all the time; and seemingly enjoying themselves immensely.\n\nI don`t think I will ever forget one night, after returning from leave at about 11.30, when we saw a number of them waiting further orders on a corner of the deck. I went over & spoke to them. The night was dark, & the niggers were blacker than ever with the coal dust, and as they spoke & smiled their eyes twinkled & their white teeth sparkled like glittering pearls, and they were as pleased as little children that any whiteman should take an interest in\n\nthem, especially when I gave them one of those red tokens each, which they carefully stowed away in a pocket. And these were not children, but big, broad-chested men. With proper training & proper, kind treatment I think we could expect great things from these people.\n","38":" much for the natives, The Europeans however, also deserve attention for the fact that they are only engaged on the more advanced kinds of employment makes them more refined & cultured generally. It has been said that the Greeks were able to advance along the road of civilisation and of art & culture, on account of the fact that their slaves did all the \"dirty work” & left them the time\n\nfor higher callings, and in a small degree this seems true of the people of Durban.They have a clean & well-set out city to begin with. Their Town Hall is as big as the Sydney one and is well shown on one of the cards which I sent home. It faces an exquisite little park, which is beautifully green & well kept & lit by cream coloured flambeaux by night. All the streets are wide & the trams are double deckers and from the top of the latter we were able to see all that was to be seen.\n\nAbout ten minutes by tram from the town Hall brings one into the suburban country. Here the roads are lined with trees, mostly the `Flamboyant` which were covered with brilliant red flowers\n\nwhen we saw them. The suburban villas are not by any means extravagently built but nevertheless they are most lovely, nearly everyone being surrounded by trees & gardens. The house at which Alen & I were entertained was very neat inside. It had electric lighting throughout and was entered by means of a circuitous approach through a garden and from all appearances was an ideal home. It was quite a new experience to me to meet such nice people so far from home. It is indeed wonderful to think that in far-off Africa the land of jungles etc. there should be homes just like ones own with people as thoughtful & as kind as one`s own dear ones.\n\nsurely the world is a bigger place than we can ever fully comprehend.\n\nBoth at the Y.M.C.A. Hut and at the Wesley Hall we were also cared for in the best possible manner and sweet girls by the score spent their afternoons & evenings there working like bricks and smiling the while, despite their strenuous exertions. As we sat in these places we wondered, between ourselves , how our own loved ones would delight to be helping in this work which is an example of charity in very truth, and which appealed to every soldier`s heart as well as to his stomach.\n\nAnd so you may well guess that Durban and her people will continue\n\nto bring sweet memories to us and those in Australia owe a great debt to them for the way in which they are treating their loved ones.\n","39":" Fifth Sunday at Sea.\n\nDurban is only a memory now, and once more we are tossing on the deep blue sea, and waiting expectantly for the next port of call, which is Cape Town & which we will most likely reach some time tomorrow morning.\n\nOccasionally we hear echoes of our black brothers of Durban in the form of an imitation by the boys of their drone songs. The lads can imitate them real well and when about thirty of them start\n\n Approach\n\nSee Durban from Table \n\nSeagulls & whistle\n\nPenguins, swim with wings and dive\n\nWild ducks also dive\n\nWalk up mount\n\nPoor quarter\n\nBiscuits \n\nat this down in our troop-deck, you can take my word for it, `there is something doing!\n\n£1. Pay today, which will be nice for Cape Town.\n","40":"\n\nFive o`clock found many of us up on deck this morning for `Cape Town` was expected to be reached before dinner. Like bloodhounds who have tasted flesh & who have reddened their fangs in the gore of their prey, and are eager for yet another victim so were we, after our stay at Durban, anxious for the landing at Cape Town. \n\nForty miles from port we could plainly discern the outline of Table Mountain, a level ridge amidst an army of sky-piercing, rocky peaks. The mountains skirt the coast for miles, and form\n\n pineapples\n\nSame old bingy\n\nMarch back\n\nDec 12 Tuesday deck guard\n\nLunch free\n\nBilliards\n\nWhite Dutch houses\n\na background for the city of Cape Town. They are barren, irregular and awfully rugged, but from the distance they have a grandeur which almost approaches the sublime. \n\nAt daybreak a mist wove itself along the shoreline, and here and there the splashing of the breakers on the rocks flecked the white mist with a yet pure whiteness, and the strong warm beams of the sun leapt like stormy torrents oer the ridges above & bathed us with sunshine and gave enhancing shadows to the peaks.\n\nAt two bells the pilot was aboard and after preliminaries had been gone through we tied up in the harbour. Of course the most conspicuous part of the city is Table Mtn. Its name descries it well. I overheard one\n\n guard duty 9 – 11 etc\n\nWed\n\nEarly leave 10\n\nBaths\n\nof the boys trying to persuade another that it was possible to see Durban from the top of it, and strange to say, the chap seemed inclined to think that was some truth in it despite the fact that Durban is 800 odd miles distant. \n\nAnother characteristic of the harbour is the presence of hundreds of birds mostly seagulls & wild-duck, & a few albatrosses, all of whom live on what they find on the waves. The latter two are excellent divers, and spend the whole day in diving to the muddy harbour bottom for refuse etc. The seagulls fly around the ships like flies round a honey pot and this in itself creates quite a contrast to the matter-of-fact routine of Circular Quay. But, needless to say, neither\n\n Thaurs Alan on Picquet\n\nparade at 8am\n\nlunch in haversack\n\nreturn 4.30\n\nshower & leave at 6\n\nAnother egg cracked\n\nPower House\n\n3000 re turbine \n\nof the harbours which we have visited so far, can be in any way compared with that which we left in Australia!\n\nThere is seemingly a big majority of blacks & dutch and half-castes in Cape-Town and as many of these are far from being refined, there is much to repel one from the place. The blacks are different from those at Durban, and are cheeky and are also quite a nuisance to everybody. It is rumoured that our long stay here is due to the fact that trouble is likely to arise between the British & the natives, but I doubt the truth of it.\n\nThe plot is deepening , life`s expanse is growing ever broader, we are more & more losing ourselves in the duty which is to our hands, & the star of vision though at time dim, never becomes entirely obscured,\n\n"}}