{"Document Name":{"0":"Diary_0468","1":"Diary_0468","2":"Diary_0468","3":"Diary_0468","4":"Diary_0468","5":"Diary_0468","6":"Diary_0468","7":"Diary_0468","8":"Diary_0468","9":"Diary_0468","10":"Diary_0468","11":"Diary_0468","12":"Diary_0468","13":"Diary_0468","14":"Diary_0468","15":"Diary_0468","16":"Diary_0468","17":"Diary_0468","18":"Diary_0468","19":"Diary_0468","20":"Diary_0468","21":"Diary_0468","22":"Diary_0468","23":"Diary_0468","24":"Diary_0468","25":"Diary_0468","26":"Diary_0468","27":"Diary_0468","28":"Diary_0468","29":"Diary_0468","30":"Diary_0468","31":"Diary_0468","32":"Diary_0468","33":"Diary_0468","34":"Diary_0468","35":"Diary_0468","36":"Diary_0468","37":"Diary_0468","38":"Diary_0468","39":"Diary_0468","40":"Diary_0468","41":"Diary_0468","42":"Diary_0468","43":"Diary_0468","44":"Diary_0468","45":"Diary_0468","46":"Diary_0468","47":"Diary_0468","48":"Diary_0468","49":"Diary_0468","50":"Diary_0468","51":"Diary_0468","52":"Diary_0468","53":"Diary_0468","54":"Diary_0468","55":"Diary_0468","56":"Diary_0468","57":"Diary_0468","58":"Diary_0468","59":"Diary_0468","60":"Diary_0468","61":"Diary_0468","62":"Diary_0468","63":"Diary_0468","64":"Diary_0468","65":"Diary_0468","66":"Diary_0468","67":"Diary_0468","68":"Diary_0468","69":"Diary_0468","70":"Diary_0468","71":"Diary_0468","72":"Diary_0468","73":"Diary_0468","74":"Diary_0468","75":"Diary_0468","76":"Diary_0468","77":"Diary_0468","78":"Diary_0468","79":"Diary_0468","80":"Diary_0468","81":"Diary_0468","82":"Diary_0468","83":"Diary_0468","84":"Diary_0468","85":"Diary_0468","86":"Diary_0468","87":"Diary_0468","88":"Diary_0468","89":"Diary_0468","90":"Diary_0468","91":"Diary_0468","92":"Diary_0468","93":"Diary_0468","94":"Diary_0468","95":"Diary_0468","96":"Diary_0468","97":"Diary_0468","98":"Diary_0468","99":"Diary_0468","100":"Diary_0468","101":"Diary_0468","102":"Diary_0468","103":"Diary_0468","104":"Diary_0468","105":"Diary_0468","106":"Diary_0468","107":"Diary_0468","108":"Diary_0468","109":"Diary_0468","110":"Diary_0468","111":"Diary_0468","112":"Diary_0468","113":"Diary_0468","114":"Diary_0468","115":"Diary_0468","116":"Diary_0468","117":"Diary_0468"},"Date":{"0":"unknown","1":1256.0,"2":1257.0,"3":1258.0,"4":1259.0,"5":1260.0,"6":1261.0,"7":1262.0,"8":1263.0,"9":1264.0,"10":1265.0,"11":1266.0,"12":1267.0,"13":1268.0,"14":1269.0,"15":1270.0,"16":1271.0,"17":1272.0,"18":1273.0,"19":1274.0,"20":1275.0,"21":1276.0,"22":1277.0,"23":1278.0,"24":1279.0,"25":1280.0,"26":1281.0,"27":1282.0,"28":1283.0,"29":1284.0,"30":1285.0,"31":1286.0,"32":1287.0,"33":1288.0,"34":1289.0,"35":1290.0,"36":1291.0,"37":1292.0,"38":1293.0,"39":1295.0,"40":1305.0,"41":1306.0,"42":1307.0,"43":1308.0,"44":1309.0,"45":1310.0,"46":1311.0,"47":1312.0,"48":1313.0,"49":1314.0,"50":1315.0,"51":1316.0,"52":1317.0,"53":1318.0,"54":1319.0,"55":1320.0,"56":1321.0,"57":1322.0,"58":1323.0,"59":1324.0,"60":1325.0,"61":1326.0,"62":1327.0,"63":1328.0,"64":1329.0,"65":1330.0,"66":1331.0,"67":1332.0,"68":1333.0,"69":1334.0,"70":1335.0,"71":1336.0,"72":1337.0,"73":1338.0,"74":1339.0,"75":1340.0,"76":1341.0,"77":1342.0,"78":1343.0,"79":1344.0,"80":1345.0,"81":1346.0,"82":1347.0,"83":1348.0,"84":1349.0,"85":1350.0,"86":1351.0,"87":1352.0,"88":1353.0,"89":1354.0,"90":1355.0,"91":1356.0,"92":1357.0,"93":1358.0,"94":1359.0,"95":1360.0,"96":1361.0,"97":1362.0,"98":1363.0,"99":1364.0,"100":1365.0,"101":1366.0,"102":1367.0,"103":1368.0,"104":1369.0,"105":1370.0,"106":1371.0,"107":1372.0,"108":1373.0,"109":1374.0,"110":1375.0,"111":1376.0,"112":1377.0,"113":1378.0,"114":1379.0,"115":1380.0,"116":1381.0,"117":1382.0},"Entry":{"0":"\n","1":" \n\nContinued from Book 5.\n\nThis is the opening of the sixth diary since I have left Victoria, and two of them written in England & on the water I have already posted to my wife.\n\nThe war is dragging very slowly to an end. There has been a lull in the Western front during the past few weeks, but lately we have renewed our attacks & gained small ground, especially on the R. Scarpe, and at Ypres. There is a big muniation strike in England, which is not very encouraging. Firmer measures should be taken with strikers in war time.\n\nI wrote a long letter to my wife to be posted in England. No 78 \n\nMr. Narick got word to leave here for Steenwerch to night enroute to England tomorrow. I helped him to pack up his things. He gave me a new shirt and underpants – that he could not take with him. \n\nTo night is very quiet. The rain has left off, but the ground is very muddy.\n\n","2":" \n\nThe day is dull and cloudy but fine. The mud is drying up.\n\nFritz sent over a few shells from the direction of Fluerbad, They went over Nieppe & fell near Steenverck.\n\nI answered Mr. B. C. Miller’s letter to day. Wrote 4 pages to him.\n\nMy sister in her letter of March 20, says,\n\n\"Sunday the 18, was the anniversary of poor Martha’s death. We put a memoriam notice in the local papers. It does not seem as if a year has gone round since we laid her to rest. Father has had a nice iron railing put around the grave\"\n\nThere was great excitement here this evening. One of Fritzs aeroplanes tried to get one of our observation baloons that is stationed near us. Fritz flew round the baloon several times empting his machine gun into it. The two observers jumped out in their parashoots. Our archies opened a heavy fire on Fritz & he made off without getting our baloon. He appeared to be hit & flew very low. I doubt if he got back to his own lines safely. Everyone including civilians & soldiers came out to see it.\n\n","3":"\n\nA cloudy day but fine and warm.\n\nI heard this morning that one of our planes last night brought down one of Fritz’s observation baloons about half an hour after his attempt on ours.\n\nI wrote to Mr. Parkinson to day.\n\nThis evening I started to read a very interesting Book Called \"The Miner’s Cup\" by Nat Gould.\n\nPte. Woodlaw who came into the hospital a few days before I left, came back today. He is looking well and was laid up with a bad foot.\n\n","4":" \n\nA fine day. Nice and warm. all the mud is dried up.\n\nI went with the mess cart driver this morning to Brigade Headquarters workshops to get 4 Safes for the companies\n\nFritz’s sent over a few heavy shells to day.\n\nThere is good news in the papers today. Briton is forming a trade union among the allies to prevent Germany dumping goods in the allied nations after the war. It is having a startling effect in Germany. Strike leaders have been arested in England. All the bus strikers have returned to work. British artillery is helping Italy. General Cadorna’s prisoners number 6,432. The British Navy has sunk 12. U. boats in 5 days. Russia is at last making a move.\n\nOur Quarter Master has been made a Captain & wore his 3 stars today.\n\nI was out for a walk this afternoon with C. Handcock. We met several men of the 45 Battalion 4th Division who are now in this front ready to go in. I anticipate there will be very big things doing shortly on this front.\n\nOur M.O. Captain Yule is in Paris on line. There was a Major filling his place in the trenches. He went to bed about 10 and was called at 12, to attend to a patient. He could not be roused and died soon after. It is believed he was gassed by fumes from a leaky gas cylinder. It was a regrettable affair.\n","5":"\n\nIt is clammy hot and very close today. In fact it is oppressive.\n\nI saw a wedding party today. A New Zealand soldier was married to a French girl. There was some \"swank\" about it. A fine carriage. There had their wedding breakfast at an estaminet where I understand the girl resides.\n\nI received a letter from my wife written at Shepparton and dated March 27. I sent her an Anzac Bulletin of May 9, also one to Lizzie Gilmore. I also wrote a letter to her.\n\nThis afternoon I got another letter from my wife No 58. Dated April 1. Written at Shepparton.\n\n I was only 51 days on the way.\n","6":"\n\nThere was a lot of rain last night and it continued showery all the morning. \n\nOur Battalion is now out of the trenches.\n\nI am to go down to the Transports this evening.\n\nD. Company had all their rations carried on pack mules today, this is the first time that rations for our Battalion have been so carried.\n\nIt is 6 months today since we left Lark Hill Salisbury Plains.\n\nThe German casualties according to their own published statements is nearly 4¼ millions.\n\nI arrived at the Transports A. L’Epinette about 4.30 this evening.\n\nI cleansed out an old wash house, put a stretcher in and made a bed there, as all the huts are full. It is handy and convenient and much better than in the tents.\n\nThere is some very heavy artillery activity this afternoon, between Armentieres & P’loegsteert.\n","7":"\n\nIt is bright and fine to day. All the rain is gone, and the mud is quickly drying up.\n\nThis is the 1024 day of the war. When the war runs 1099 days, if it does run that long, it will be going exactly 3 years, the estimated duration attributed to the late Lord Kitchener.\n\nTo day it is 6 months\n\nsince we arrived in France at Le. Harve.\n\nTo day I have been sharpening chaff-cutter knives. I also made a scraper to clean the iron work on the travelling cookers, in preparation for painting.\n\nThe war news is very bright today. The British hold 8 miles of the Hindenburg line. New gains secured severe enemy losses in recent fighting. Haig reports 16 enemy aeroplanes down. Hostile artillery has again shown considerable activity on the N. bank of the Scarpe, with the exception of a sector of 2000 yds. We hold the whole of the Hindenburg line from a point one mile E. of Bullecourt to Arras. A successful raid has been carried out near Loas.\n\nSargeant Mapilson of the Transports received his commission today. He is now a second Lieutenant and will take Mr. Hunters place as Transport Officer for our Battalion.\n","8":"\n\nA Beautiful day with a nice cool breeze. \n\nThere are a lot of aeroplanes about, and a few of Fritz’s.\n\nI was again cleaning the cookers in preparation for painting.\n\nI saw Fordry Keiler this evening. He is now a driver in the 39 Battalion Transports. He has been with them ever since the\n\nBattalion came to France.\n\nAfter six this evening there was a lot of aerial activity, and our archers were kept busy \n\nin keeping enemy planes at a distance. Late in the evenings is a favourite time for Fritz to come over. He can see better. The sky is usually clear, and he escapes the glare of the Sun. He is an expert in keeping behind cloudes to avoid being seen and always flies at a very high altitude about 2 miles. He is then practically safe from gunfire but cannot observe much.\n\nI wrote to my father this evening.\n\nOur big guns are now operating with no uncertain voice S. from here.\n","9":"\n\nA fine warm morning, but during the day it was rather warm.\n\nIt is now day break some time before 4 o’clock and is not dark until near 9 o’clock. This makes the day very long, but we have a very long afternoon to rest or enjoy ourselves.\n\nThis morning I fitted some knives on the chaffcutter and sharpened the ones I took off. There is only one chaff cutter (A. Benhall) 3 knives for the whole Brigade & others also use it. It is going every day, and gets a lot of rough usage.\n\n For a long time I have been studing a new machine power\n\nand I believe that I have at last succeeded in inventing a machine that costs nothing to run, for it works in still water. I started on it long before the war, made some experiments on the steamer coming over also in England and this past few months have give a lot of study to it and have several ideas in my mind. I mentioned the matter to Mr. Hunter this morning ∧ will have an interview with him this evening. I am desirous of getting time ∧ facilities to experiment.\n\nThere was a fleet of our aeroplanes hovering over Fritz’s lines this afternoon for a considerable time. There was over a dozen planes in the fleet they flew at a greater altitude and all Fritzs shots were below them.\n\nThis evening all our gas respirators were examined and a new apparatus attached to them to counteract a new gas that Fritz is using.\n\nI forgot to mention that last evening I was paid 15 Francs equal to 11\/-.\n","10":"\n\nIt is very hot to day, or rather we feel the heat very trying after the long cold winter.\n\nThis morning I again sharpened and set the chaff cutter knives, and started to clean a cooker.\n\nI had a lengthy talk with Mr. Hunter \nthis\n last evening who is an experimenter himself, and interested in a new patented advertiser.\n\nHe thinks it would be much better for myself not to do anything at present but to wait until after the war, for there would be a risk of some one attempting to copy my ideas, and the war office might not take it up, as it is not a man killing device though it would possibly help to shorten the war by supplying cheap motor power.\n\nI bought 4 nice silk post cards to day in a little shop adjoining the A. L. Epinette Estaminet. They cost 6d each and I sent them to the following. My wife my two nieces, Maggie and Kitty Kittson and Mrs. W. Riley coolaness Envinstown, Ireland, and Mrs Kitty Marbin, Iniselin, Tertigo, Fermanagh.\n\nThere is good news in the papers which did not arrive until late this evening. Italy had won a great victory and pierced the Austrian line on her second war anniversary. She has captured many strong points with the help of 10 British batteries and taken 9000 prisoners. Since May 1 the French have taken 8600 unwounded German prisoners.\n\nThere was a raid by 4 Zeppelins over E. cost towns in England.\n\nHaig reports 11 hostile aeroplanes down, and a hostile raid in the neighbourhood of Armentieres was driven off with machine gun fire.\n","11":"\n\nIt is hot again today\n\nThere is good growth in vegetation of all kinds. The crops are coming on splendid. All the trees are covered with leaves, and most of them are done flowering. The cherries have fruit on them about the size of peas, and I anticipate that about the end of June there will be ripe cherries on the trees.\n\nSome of the other fruit trees are in full bloom and look splendid. \n\nThe country looks splendid and it is a pity that there is a war on.\n\nThe total number of prisoners taken by the Italians on the corso front now numbers 10,245, and much war material is captured.\n\nMr \nLys\n Lloyd George made an important statement in the House of Commons on the Submarine menace that there was an unexpected improvement.\n","12":" 1917,\n\nIt is again hot to day\n\nThere is a lot of aerial activity this morning. Fritz has been over several times and each time got away safely. His big guns are also very active.\n\nI heard today that the 38 battalion was cut to pieces last night\n\nbeing caught by their own barage. Either mismanagement or a lack of discipline, or a misunderstanding. A huge blunder somewhere, I am told that there were about 80 killed, but did not hear the number of wounded.\n\nYesterday the Padre Cap. Davidson ∧ another officer at the billet were slightly wounded by bursting shrapnell.\n\nThere was another air raid on England on Friday evening by 16 Hun aeroplanes. They all escaped with the exception of three that were shot down by sea planes near the Belgium coast on their return journey to Germany.\n\nThere was great loss of life 76 killed mostly women ∧ children and about 170 injured.\n\nMr Hunter is to go to England to morrow. He only got word today.\n\nThis evening I received a letter from Kitty Gilmore Enniskillen. She says her sister Lizzie was married at Easter. Good luck to her. The Butter Factory Manager Mr. Gibson was paying his attentions to her when I was over last year.\n","13":" \n\nThis is the 1030 day of the war.\n\nIt is cool today. The sky is overcast with clouds and it looks very \n\nlike rain.\n\nMr. Hunter went away early this morning.\n\nI was helping to cut chaff this morning and also yesterday morning, also sharpening the knives ∧ setting them.\n\nTo day 1 blanket was called in from each man in readiness for the big push. We have now only 1 blanket each, but as the weather is fine ∧ Summer coming on it does not matter ∧ we have the less to carry.\n\nI was putting dubben on a lot of new flocks in readiness for the big push.\n\nThe big push cannot be long delayed now. Residents up near this front especially in the vicinity of Ploegsteert are leaving and taking their things with them.\n\nI saw several carts going past here. They were ordered to leasen as it was not considered safe for them when the big strafe takes place. When that is over we return. I regret leaving here as I am very comfortable, but it will probably be unsafe in a few days if not sooner.\n\nThe Italians have obtained more victories on the Corso. Their total prisoners now reach 20,669.\n\nThere has been a great war demonstration of\n\nworkers in Hyde Park. No separate peace is their motto. A telegram from French President was read \nreiterating the determination to insist on restitution, reparation, and guarantees\n.\n\nSeparate peace was an insult to Russia was the text of the Russian Ambassadors speech.\n\nTo day I finished reading a book \"The Head Lad\" by Nat. Gould. It is a sporting story.\n","14":"\n\nCloudy but warm.\n\nThe Italians continue their great battle on the Corso ∧ made further progress in the neighbourhood of Monte Hermada, the mountain fortress which bars the road to Trieste. Strongly fortified trenches were captured, a village near the coast occupied ∧ 9.6 in guns in perfect order for recent were taken. British monitors assisted.\n\nThe British ∧ French have succeeded in bringing down 39 German machines.\n\nThe British Censor after all the world finding out from German sources, allows the press to state, that Folkestone was the town recently boombed by Hun aircraft. The \"Express\" reprints H. G. Wells appeal made 2 years ago to increase the number of our aeroplanes by thousands ∧ attack Germany from the air ∧ keep on attacking until the war is ended.\n\nU.S.A is throwing in all \n\nher resources into the war, and is making big efforts for an immediate attack on a gigantic scale & to keep on doing so.\n\nLast night & to day was very quiet on this front.\n\nI have started to read \"the man who rose again\" by Joseph Hacking it is a very interesting book.\n\nI was again working on the cookers this afternoon.\n\nMr Mapelson has now left transports, but sleeps here temporarily at present. He is attached to \nBrigade\n Divisional Headquarters.\n","15":"\n\nA fine day but rather windy.\n\nYesterday, last night & to day were very quiet, scarsely any bombardment & no enemy planes about, but the low visibility accounts for that.\n\nIt is the prelude to the coming holocast, which may come at any time. All traffic on the road from here to Nieppe will cease at 12 o’clock to night, & it is said that there are 1000 guns to the mile on this front ready to bombarde the enemy at a given notice.\n\nAfter Sundown one of Fritz’s planes made a determined attack on the observation baloon stationed here. He was almost on the baloon before he was observed coming from a great hight. Our archers opened fire & also other batteries, but he was undaunted, & flew around\n\nthe baloon firing at it all the time, but he missed it. Turned & flew around it, the second time he succeeded in firing it from the top. In a few moments it was ablaze. The two aviators on the first approach of danger jumped out in their parachoots & escaped.\n\nThe whole affair only lasted a few minutes, & the balloon burned rapidly, falling as it burned, until there was nothing left but the basket & a few ropes. Fritz rapidly made off, & received a terrific storm of shrapnell as he went. A few minutes after word arrived that he came down in Armentieres but it was not confirmed.\n","16":"\n\nA fine beautiful morning. Fritz is about very early this morning, our archers being in action before I was out of bed.\n\nI was paid again to day 15 francs = 11\/- by Lieut. Aitkins.\n\nA few days ago I sent out some washing to a French woman on a farm 2 shirts 3 pairs of socks & 3 handkerchiefs. She made a good job of it and only charged me 1 fr. 1 d. = 11d.\n\nThis evening I finished reading a wonderful novel \"The Man who rose again\" by Joseph Hocking. \n\nA very interesting, thrilling and entertaining story. It is fascinating.\n\nFritz has put over a lot of big shells to day not very far in from this camp. He was searching for guns & dumps.\n\nThis afternoon a new\n\nbaloon was put up in place of the one destroyed last night.\n\nThere are about 10 or 11 ballons on this sector within sight of here.\n\nA new order has come out that harness need not be cleaned & polished every day as formerly. The 4th. Division say jokingly that we are not Australians but Tommies on account of our harness. They are typical Australians there harness being dirty & tied together with wire, but they are a long time in France & are a war worn Division.\n","17":"\n\nFine & warm to day but cloudy in the afternoon.\n\nThis evening I started to white wash the stable.\n\nThis morning and afternoon there was intense artillery activity evidently the prelude if not the commencement of the big push. The papers say there is a lull on the western front. And the German nerves are very Jumpy in consequence.\n\nThey cannot understand the reason of it when they expected an offensive.\n\nThe Austrian Parliament has met for the first time since the war & the new Emperor has addressed it promising reforms.\n\nThere is nothing special to chronicle to day.\n","18":"\n\nIt is a year to day since we left Victoria. How the time flies. It does\n\nnot seem very long, & one can hardly realise that a year has flown by. Most of that time has been spent in France, for we are here over 6 months, about 4 months was spent in England & a little over 7 weeks on the water coming over. During this past year I have seen a lot of the world, have been under fire, have had some good times, and also suffered a lot of hardships.\n\nWhen I left Victoria I thought the war would be over by now, in fact when I left England I thought it would be near a finish now, but I fully believe it will go on right through this Summer & finish about the end of it or perhaps in the Autumn. I will be lucky to get home in time for christmas.\n\nThere was a lot of heavy bombardment last night & again today. This afternoon it increased to great intensity, clouds of smoke rising, and a continual roar.\n\nAfter tea one of our planes had a fight with one of Fritz’s or fell in his fires, with a wing broken, turning over & over as it fell.\n\nThere were 12 of our observation baloons up this evening & 5 of Fritz’s.\n\nAfter sundown when all was quiet one of Fritzs aeroplanes made a sudden attack on one of our baloons. He seemed to come from no where, so sudden was his appearance & opened fire on the baloon from a long range. The two observers jumped out in the parashoot our guns stationed at the stables were very slow in opening fire, but the guns at Steenwerck put a barrage around the baloon, nevertheless Fritz came on firing as he came, he missed every time, circled around the baloon & then made off, without getting the baloon, though all through he was sure to get it. He evidently was too excited to hit. He flew away very low & was probably hit.\n","19":"\n\nA beautiful but rather warm day.\n\nThere is a lot of aircraft about this morning & our archers are in frequent action. The Huns are again sending over a lot of shells. They also sent over some tear shells early this morning, & everyone’s eyes were sore. I was asleep at the time and knew nothing about it until afterwards. I noticed that my eyes were a little bit sore but I attributed it to the light.\n\nI sent a whiz bang-field P.C. to my wife this morning. I would have written a letter only I did not know that a mail was closing today. I also sent some to T. Douglas, H. G. Kittson, K. Gilmore.\n\nThe workers in England are very dissatisfied, with \n\nsome the wages have increased but not much as prices. Of many others the wages have not risen at all. Accordingly, although work is not skimped, the fruit of it in terms of food & clothes is pitifully meagre. This is the principal cause of strikes. The remedy is to check the Profiteers, & increase wages to a living standard.\n\nIt appears that at Ploegsteert the Germans sent over a lot of gas shells and a number of soldiers on fatigue were gassed Some of our transport saw the bodies removed.\n\nLate this evening the Huns shelled a factory at Erquinham about a mile from here & destroyed it.\n\nBrazil has rescinded her resolution to remain neutral.\n","20":"\n\nThis is the 1037 day of the war.\n\nIt is very hot to day\n\nThere is a lot of bombardment sent today, and the Hun aeroplanes are also very active, but are keeping very high up, appearing like specks in the sky.\n\nThe French at any price meeting at Leeds was a failure last Sunday, many of the delegates were refused lodgings at the hotels, and the meeting was a very stormy one.\n\nSome of our mules are at another stable towards Erquingham, the stable was shelled, but the mules were removed in time to the roadway. I hear the huts were blown up.\n\nOne of our mules at Ploegsteert was killed yesterday & another injured. No one was near them at the time.\n\nMr. Mapelson returned this afternoon to take charge of the 37 Battalion Transport.\n\nTwo big naval guns fired shots from the railway. The guns are marvels of ingenuity. The shells are 12 in & weigh about 50 lbs. With others I went over & had a look at them. They are in charge of English Gunners.\n","21":"\n\nIt is windy and rather cold this morning.\n\nAll night long there was very constant artillery activity in the direction of Ploegsteert, and it is being continued without interruption this morning.\n\nThe German reply is very feeble. Yesterday they succeeded in destroying some dumps & batteries, and dropped a boom on an ammunition train at Bailleul, so it was reported here.\n\nNo one is to leave the camps to night. There will probably be a stand too. A speedy evacuation by Fritz is expected on this front, at any moment.\n\nThe Bombardment has continued throughout the day. Fritz retaliated and burned down a large Factory at Pont de Nieffe. The smoke rose in clouds for a long time. A number of civilians has been killed this past few days, and several families have been shelled out of their homes at Pont de Nieffe & passed here this evening foodless & homeless.\n\nThere are innumerable sparrows about here,\n\nthey are resting in the trees, and chirping everywhere. They come to the door of my hut at meal time & gather up the crumbs.\n","22":" (1039.)\n\nIt is hot today.\n\nThe bombardment continued last night with great severity, but gradually died away towards morning. It is reported here that the boys went over the top last night, and have taken Messines and advanced past it, taking over 1000 prisoners.\n\nI also heard that the Pioneers are put into the Companies, with the exception of Len Sherman & myself, who are at present with the Transports. Sherman is a saddler. Possibly C. Handcock is still cooking at the I. M. Store. This is not surprising for vacancies in the Pioneers are not being filled, with one exception that of plummers.\n\nThe Papers this morning report another air raid on the S. E. of England by 16 raiders. There were 31 victims, two of them being killed. The principal attack was on naval Establishments in the Medway. Two German Aeroplanes were brought down. There was a certain amount of damage done.\n\nThere has been a chapter of accidents in the transports to day. When we were getting our dinner to day at the cook House a stray bullet shot Waxey Campbell through the head He dropped like a stone. I was only a few feet way & saw him fall & heard the smack. He never spoke & bled profusely. I helped to carry him on to a stretcher. He was put in a motor car and taken to the hospital\n\nbut died as he got there. The bullet penetrated through the head & I could see there was no hope for him. He was married in England when our Battalion was there. He was sent down here for a spell. Before tea Jack Wilde was kicked in the side by a horse.\n\nThere is good news coming in from Ploegsteert, more prisoners have been taken guns captured, and the enemy put to route, and suffered severe losses. Our casualities have been light.\n\nA French boy told me tonight that 100 people have been killed at Pont de Nieffe half of them being soldiers.\n\nIt is raing this evening It has been threatening for some time, but the air is very close & warm.\n\nPrivate Campbell was buried early this evening at the hospital in a grave that was already prepared. The saddest part of it was that the bullet that killed him was one of our own fired either from an aeroplane as a signal or from some camp.\n","23":" (1040.)\n\nIt was again close & warm this morning, but became cool & cloudy in the afternoon.\n\nThere was another terrific artillery duel last night which continued with great intensity all night. Fritz put over a large number of shells. Our artillery played havoc with the enemies trenches. Our transports were up with new positions with pack mules leaving here at 9 pm & returning at 4 p.m. They had a firing trip but fortunately it was a clear\n\nnight & the moon shining brightly. They had to lead the mules over duck boards and shell holes large enough to bury a wagon, & delivered the rations in no mans land, where the Company I. M. took delivery of it & will carry it to the Fighting line which is now miles away in territory that was a few days ago occupied by the enemy. It was reported here early this morning that we have got 40,000 prisoners in this big advance & taken from the enemy two miles of the coast. It is believed that this battle is the prelude to the biggest advance yet made on the W. front. Our Battalion has had very severe casualities, but mostly wounded cases. A company suffered the most \n\nThe papers print more news went the recent air raid on the Medway. There were ten raiders brought down out of 20, which makes it very costly for the enemy. They were brought down off Ostend.\n\nOur artillery is now 7 p.m. putting up a big straff on the enemy.\n\nThe sky was speckled all over with our aeroplanes late this evening. They were of all sorts. I saw 16 planes of a new type come back from a raid. They were cutting all sorts of antics in the air, diving, turning, rolling over & over, falling and looping the loop. There were some 3 deckers, that is 3 pairs of wings one above the other which gives them fast climbing powers & great speed said to be 200 miles an hour.\n\nThe big 12 in naval guns are in action this evening, as well as the usual artillery.\n\n(1041)","24":"\n\nIt is fine but cloudy to day.\n\nThe artillery bombardment lasted all night with varing intensity, and is continued this morning but with less intensity, & appears to be gradually dying down.\n\nThe 4th. Division got too far ahead yesterday & were cut badly by our barrage. Our Battalion also suffered the same way. At dinner yesterday there were some 500 & for tea only 86.\n\n There are hundreds wounded but not so great a number killed as one would expect under the circumstances. Most of the casualties are caused by being too eager & getting under our own barrage.\n\nThe enemy suffered terrible destruction by our series of mines, £ 1 million worth of explosives (aminol) being used, the greatest explosion ever known in the areas history. Our aeroplanes also did terrible execution in the trenches, pouring machine guns bullets in the trenches, engaging hostile planes, & dropping bombs.\n\nI have not heard any particulars about Lieut. McNicol or Sgt. Robinson\n\nHaig reports on Thursday 11.5 am \"we attacked at 3.10 am this morning the German positions in the Messines Wytschaete Ridge on a front of over 9 miles We have everywhere captured our first objective\" from N. of Lee Douve Brook to N. of Mont Sorrel. Up to 4.30 this morning over 5000 prisoners have been brought in \"An attempted counter attack was completly broken up by our artillery fire, 9 enemy aeroplanes were brought down & 9 others driven down out of control\"\n\nThe \"Express\" 8\/6\/17 describing the battle says \"The Earth opened & the line disappeared\" Tremendous new attack by the British begun yesterday a new offensive on a 9 mile front just south of Offres. Heralded by the greatest explosion in the history of the world, the British began yesterday a new offensive on a 9 mile front just south of Offres. This moves the vital centre of the whole war to the North for the moment. It may have a tremendous effect on the future course of the operations. A Series of mines, charged with over 446 tons of light explosives, were fired & then at 3.10 a.m. the attack began. The attack is made at a point where British & Germans have been facing each other since September 1914. Messines was the scene of the famous charge of the Loudon Scottish on Oct 31. 1914. The Battle ground touches the Offres salient, where the British, under Lord French, fought two great Battles, which kept the German hordes from reaching Calais.\"\n\nThroughout the day I heard of soldiers I knew well either being \n\nkilled or wounded but so far I have nothing of the Pioneers.\n\nThere has been intermitent artillery activity during the day.\n\nAt tea this evening I heard that N. J. Jorgensen of the Pioneers was killed being blown to pieces and Sgt. Hammett was severly shell shocked while Sgt Robson escaped with a scratch on the back of his neck. I was very sorry to hear of poor little Jorgensen’s death.\n\n(1042)","25":"\n\nCool & cloudy to day.\n\nThe bombardment last night was not so intense and gradually died away \n\ntowards morning. It was mostly by guns in action. The bombardment is being continued today. The noise of the big mines at Messines exploding was heard in the S.E. of England. Mr. Lloyd George rose at 3. a.m. on Thursday at Walton Heath near London to hear the great British mines explode in Flanders. The distance is approximately 140 miles The sound would travel that distance in about 12 minutes. The French are delighted with the great success. No series counter attack has come from the enemy as yet, but it is expected, for this is a blow at the vitals of the enemy. The papers give fuller details of the battle but report no fresh fighting & say nothing about Ostend, or other fronts.\n\nYesterday we had an issue of tobacco, matches & cigarettes. I have yet 2 tins of Australian tobacco that I received in a parcel from my wife about a fortnight ago.\n\nOur rations lately have been poor, and short. This is the first time that I have had cause to complain since I have been in France. The big push is no doubt the cause of it, coupled with a very poor cook in the Transport section.\n\nOur Battalion \nagain goes into\n does not the trenches to night. They deserve a longer rest after the strenuous time they had a few days ago.\n\nThis past five days there have been scarsely any enemy aeroplanes about. They have lost a lot lately, & get a very hot reception every time they come over here.\n\nIt is reported here that the enemy out of spite is shelling Armentieres. It is of no military value to him, & endangers the lives\n\nof the civilian population. Our Batteries, especially the big guns, are severally shelling the enemy.\n","26":"\n\n(1043) It is cool and cloudy today, with occasional showers in the evening.\n\nThere was very heavy artillery activity last evening which gradually grew in intensity towards midnight.\n\nFritz put over some smoke boom & gas shells around some of our big guns before dark. A spy was caught here in the vicinity of these guns. When he was bowled out he admitted and said if he gets his way 5 shells would come over, & sure enough they did. How the spies manage to send search signals is a mystery.\n\nFritz put over a tremendous lot of shells in Armentieres last night and about 10 O’clock started a big fire there. Later on there was a gas alarm , we were all in bed & I was asleep but it was a false alarm for no gas came near us.\n\nThere were a lot of refugees arrived here last night from Armentieres being shelled out of their homes.\n\nThis evening Fritz put over 4 shells right over the stables & our billets. They fell in an adjoining field of corn and did no damage beyond giving a fright to those in the stables. He was evidently in search of the balloon station for theirs were in that direction & each shot got nearer to it & further from the stables. The\n\nanti air craft artillery took their billets.\n\nLater in the evening he put over 6 more, the last two falling where we were lined up at the cook house for tea.\n\nThe last shell fell within 60 yards of us. There was a scatter and a shower of earth fell over us. Orders were given to remove all horses out of the stables which we did in quick time & took them half a mile up the road to another stable.\n\nAs we were going up shells were bursting around many of them being shrapnell shells & bursting high in the air, one very close to the baloon. A stream of women & children followed us up. We came back for tea leaving a picket with the horses. By this time the schrapnell were bursting short of us falling about Erquingham. He had a balloon up observing his shots. Our big guns are now busy replying and I hear no more of the enemies shells from that direction S. of Armentieres.\n\nTursday","27":"\n\n(1044) Fine & warm to day. There was another terrific bombardment of the enemy by our artillery last night which continued with varying intensity throughout the night. From a point South of Armentieres Fritz this morning shelled Bailleul with a long range gun; the shells passing right over our stables & billets. He is evidently in search of our aerodrome\n\nor dump & is perhaps bent on destroying the town before evacuating from this section of the front. He has also an aeroplane about which occasionally comes within range of our archies. Our balloon is up all morning observing. I hope they spot his gun. Then our artillery will make short work of it.\n\nBefore dinner Sgt. Partridge received orders to send all available numbers to the I. M. Stores to remove the Battalion to Bulford camp, which I believe is near Steenwerck. I hope our Battalion has a long rest after their strenuous work of late for they need it & thoroughly it\n\nThe enemy continued shelling after dinner turning his attention to the railway line and also our big guns, but he failed to score a direct hit though he frequently went close.\n\nI have a bet of 10 francs with Private Lamb that the war will finish this year. He hopes he will loose.\n","28":"\n\n(1045). Cloudy, but close and hot to day.\n\nI was on stable picquet last night. From 6 to 6.45 and again from 9 to 11.15, when I was finished for the night. 3 hours in all. This is the first time I have done a whole shift on\n\npicquet though I have mounted picquet to act as relief when the appointed picquet was absent.\n\nOne of our lads named Hooker was absent all day yesterday and has not turned up this morning. He has not been seen since Monday night when we were shelled out of the stable, the last seen of him he was running up the road. He was sent here because he was supposed to have shell shock.\n\nBefore dark last night a big 15 in gun came to Nieppe & fired a number of shots at the enemies positions. After that it was taken away again by the armoured train; apparently it done its job well for no more shells is coming over from Fritz this morning. The other guns on the railway also retired. About 12. a.m. Fritz sent over a number of H. E. and gas shells. They fell near the railway.\n\nThis morning I saw an air fight in the far distance. The report of the machine guns in action drew our attention to it, all our planes returned safely. The enemy also escaped. At one time one of our planes was engaged by 6 of the enemy and escaped.\n\nNo papers came here yesterday or to day. Apparently the paper boys were frightened by Fritz’s shelling of this place on Monday & Tuesday.\n\nThere was another aeroplane duel this morning. 15 of the enemies planes attacked by 9 ours near hit but they all came home safe. The archies were watching them through their glasses.\n\nThere is again heavy artillery actions this evening & to night.\n\nI have seen a number of German Post cards taken off prisoners. They are cards soldiers in the trenches received from Germany also German money and Helmets. Their helmets are heavy and far inferior to the English or French. The French look the best but the English are the best life preserver.\n\n(1046) Thursday June 14. 1917.\n\nA fine day but warmer. There is a cool breeze blowing.\n\nThis morning there is nothing special to chronicle.\n\nThe British declaration to Russia shows identity of war aims of the allied nations, & express willingness to examine all agreements made from time to time & if need be revise them. Britain’s position at the outset was to defend the existence of their country & to enforce respect for international engagements. To these objects has now been added that of liberating populations oppressed by \nthe\n alien tyranny.\n\nThere are some strange contrasts in this war, a mixture of everyday life and tragedy. A field that was terribly shelled on Monday is now being cultivated by an industrious Frenchman.\n\nThere is a very narrow margin between civilian life & the battle front. The soldiers camps are dotted about the fields, around the villages, in the towns. In fact they live with the people whose homes we have come to protect. The civilian has come to regard the screech of shells, & the bursting of schrapnel as a matter\n\nof every day life. There is no panic. Troops of them who were shelled out of their homes walked quickly down the road carrying a blanket, or a basket or a shall, most of them being women & children and nearly all bare headed, and scattered amongst them were few men, mostly very old, I have seen farmers in the field stanging by their plough to watch the bombardment while the horse rests, or a number of women weeding in the fields straightening their backs to locate where the shells are dropping, without any sign of fear, & heedless of danger.\n\nIn the villages the shops are open and doing a good trade with the soldiers, and people are sitting in the streets in the cool of the evening before their homes reading the war news, or talking to their neighbour, occasionally glancing up as the hum of an aeroplane can be heard overhead, & at once pronouncing it \"Allemond\" or \"Angletere\". The women knit in the streets or make lace, and are very clever at their work, but they seem to be part astonishment & take everything as a matter of course.\n\nThe English people or rather British & French Troops take control of Greece, King Lino has been ruthlessly pushed aside by the Allies, & his role as traitor & German Tool is ended. Allied troops have been landed in Corinth. An Anglo-French column has been landed in Thessaly the entire Thessalian crops are being purchased & a system of control is being instituted. \n\n1047. Friday June 15,1917.\n\nA fine morning but hot. There was not much artillery activity on this sector last night but S. of Armentieres the rumble of the big guns could be heard.\n\nEnemy aeroplanes were overhead this morning, were engaged by our archies and aeroplanes. They beat a hurried retreat.\n\nThe most disastrous air raid on England occurred at 11. a.m on Wednesday. The East End of London was attacked and boombed. The loss of civilian life is appaling. There are 120 child victims 26 being killed . The total killed is 97, and the total injured is 439. The list may be lengthened as it is not complete.\n\nNo damage of military or naval nature was done.\n\nAt least one German plane was brought down. One bomb fell into a railway station hitting an incoming train 7 persons were killed & 87 injured here. Another bomb fell on a school, killing ten and injuring about 50 children. The \"Daily Express\" demands \"Reprisals\" and more reprisals \"as being the only method of bringing the Huns to their Senses. We are far to soft with them\". There is a new activity of the U. boats 32 vessels being down for the week ending June 10, and 23 unsuccessfully attacked. The Allies have deposed King Lino. He is succeeded by his second son. The Entente troops are in Greece, and are well received by the population. German intriguers have got to go. It is rumoured that Al. Venizclos is back in Athens.\n\nThis evening I received 4 letters from Victoria 1 from Annie W. Nicol dated April 9, and 3 from my dear wife dated April 3 No. 59,","29":" No 60 &","30":" No 61. I was very glad to get them, as I had no letters from Vic. for over 5 weeks.\n\nThis evening I boiled some water and had a good hot bath, the first bath since I was at the reinforcement camp at Steenverck last April.\n\nI hear that Pte. Hooper has reported to Head Quarters, after a few days absence.\n\n1048","31":"\n\nIt is very hot today. In fact this is the hottest day that I have experienced in France.\n\nI saw some sheaves of beautiful green lucerne & red clover that was brought into the Stables this morning. It was a treat for the horses, and reminded me of Merrigum, the green fields there. This country is similar to Merrigum, green fields everywhere but unlike Merrigum it is thickly populated & the farms are small. The whole landscape is dotted with farm houses & villages and little shops and estaminets,\n\nThe \"Daily News\" reports important gains on two points on the Arras front, first line positions abandoned near Armentieres. An Zeppelin was brought down in flames in the N. Sea by the Navy.\n\nAn enemy observation balloon was brought down East of here. It came down in flames. It was several miles away and there was only a great cloud of smoke when I saw it.\n\nWe were paid this afternoon. We were paid short as there was a shortage of funds. I received 10 francs = 7\/2, though there is about £ 1 due to me. \n\nWe were also issued with tobacco & cigarettes from the comfort funds. I received 2 packets of \"Volunteer S bag\" & 1 stick of \"Half Dark Nailrod\" a scotch tobacco. The tobacco on issue before was \"Imperial\" & \"Crown\" in flat cakes.\n\nI received a short letter from my little niece today, (Maggie Kittson) dated April 9.\n\nI heard last night that Charlie Bayley of Shepperton died from wounds in the Hospital\n\nHe was a tailor at Shepperton an officer in the light horse there, amp; came into camp the same day as I did from Shepperton.\n\n1049.","32":"\n\nIt is again very hot to day. The days are very long. The sun rises about 4.30 and sets about 9.15. Lighting up time in London is 9.47, or roughly a quarter to ten. \n\nLast night was very quiet, but a few enemy planes flew over here this morning & were engaged by our archies. An enemy ballon was burned down this morning. I saw the smoke in the distance.\n\n\"The Daily News & Sender\" is opposed to Reprisals as advocated by the Express. Attacks on German open town would have no effect upon the enemy who would not deviate from his fixed object of attacking English towns in order to keep a large number of skilled airmen & gunners in England.\n\nThe kind of reprisals it advocates is attacks on enemy military points factories, & forts.\n\nThe enemy is sending over occasional shells between here & Armentieres.\n\nI was at a church parade this evening in the 40 transport lines. Cpl. Davidson was the Chaplain. He paid a nice tribute to the memory of those who had fallen in the battle of Messines also to the work of the Transports & mentioned Pte. Campbell who paid the supreme\n\nsacrifice in the Transport lines while drawing his dinner. This is the third church parade that I have been at while in France.\n\nWe had green peas for tea this evening. They were very nice.\n\nThis afternoon the enemy sent over a lot of shells in this direction, many of them falling not far from the stables and five shrapnel shells burst in the air some of them right over our billets evidently in the hope of hitting our baloon which was promptly hauled down.\n","33":" June 18,1917 \n\nIt is again very hot today.\n\nSome enemy planes are aloft this morning. The first were about very early this morning & were fired upon by our archies at 5 o’clock long before I was out of bed, and re-appeared several times throughout the fore noon. Their purpose evidently was to observe the enemy’s shots which he was continually sending over towards Bailleul.\n\nI met some English Royal Engineers this evening. Their camp is only about 10 minutes walk from here. It appears that some of the shells that passed over here last evening about 9 o’clock blew up one of their huts, killing one man and severely wounding a \n\n \n\n \n\nnumber of others. A few escaped without a scratch but were dazed. One of them told me he heard nothing. The floor disappeared & they fell underneath, while the roof and sides collapsed. He saw a red flash and that was all and could scarcely realise what had happened. \n\nThe enemy is again shelling this afternoon. A number of civilians were killed in Armentieres this morning.\n\nThis afternoon it was very close & sultry with thunder and at about 3.30 there was some heavy rain.\n\n1051","34":"\n\nThe weather is very close & sultry with occasional loud peals of thunder, and a little rain.\n\nEnemy aeroplanes were about at daylight this morning & were engaged by ours active air craft artillery. \n\nThe enemy also shelled Steenwerck this morning but with what result I have not heard, but I anticipate nothing serious.\n\nAnother Zeppelin has been brought down in flames in an East coast field.\n\nA Kent town was heavily bombed before dawn . The casualties are 2 killed & the injured.\n\nAt a monster meeting in London a unanimous motion for air raid reprisals was carried and immediate action demanded. This resolution was sent to the King & the Premier, there were dramatic incidents and stirring speeches.\n\nIn Spain the army & people are in revolt. High prices are the primary cause. \n\nI received a letter from Irene King last night dated April 21, and one from my wife dated April 22 also another this morning dated April 17. No. 62. \n\nHaig reports that Portuguese troops have repelled several raids during the month, There are some of them stationed in camp not far from here. \n\n1052.","35":"\n\nThere were some very heavy showers this morning very early. The ground is wet and muddy but by mid day it was dried up again. Today is cloudy, close and sultry.\n\nThis past three days all hands have been busy cleaning up in readiness for an inspection by the \"heads\". \n\nToday we have been free from enemy shells.\n\nI wrote to Kitty Gilmore last night and this morning I received a letter from Kitty Martin.\n\nThe \"Daily News & Leader\" reports another troopship sunk in the Mediterranean and 63 lives lost. There is not much war news.\n\nFritz has 10 observation baloons up this evening.\n\nAll of a sudden two enemy planes merged out of the clouds and brought down two of our baloons in flames, despite a heavy fire from several anti air craft batteries. The observers jumped out in their parachoots. Fritz’s plane got away apparently unharmed. Great consternation was felt here\n\nat the enemy’s success & the failure of the batteries to protect the baloons. The gunners attribute all the fault to their officers, & felt disgusted. They knew they had the wrong range but had to obey orders. If it was up to the men or the Sargeants who are all experienced, they claim the result would have been different.\n\n1053.","36":"\n\nThere were occasional storms last night, today is dull & cloudy.\n\nA new baloon is up today in place of the one that was burned down alongside this camp last night. So far none has yet been up in place of the other burned one.\n\nThe enemy is sending over occasional shells this morning \n\nWe expect to be leaving this camp for a new one probably at Bailliul any day now.\n","37":" (1054.)\n\nShowery to day.\n\nIt has been very quiet here today & there is nothing out of the way to chronicle.\n\nI heard that on Wednesday when the enemy planes turned down to our baloons he dropped a smoke boom & a few minutes later a big H.E. shell came over and killed & wounded nearly 20 horses.\n\nThere is a lot of talk about spies among the civilians, and a few have been caught & dealt with, there is also a yarn about a traitor in the who was caught signalling to the enemy, was court-\n\nmarshalled & shot. But I cannot say if it is true.\n\nI made a boomerang out of a French penny a finger ring out of a British shell case, and a horse shoe out of a piece of shrapnel from one of Fritz’s shells that exploded over our billets in this camp.\n\nSaturday June 23 1917 (1055.)\n\nIt is seven months to day since we landed in France.\n\nIt is fine to day but there are big fleecy clouds an ideal day for an enemy \nday\n attack on our baloons, and sure enough after dinner 3 Hun planes dived from behind the clouds and attacked the baloons . There were 6 baloons up. Our archies stationed around the baloons opened fire immediately, but the enemy succeeded in setting fire to 3 baloons in quick succession and made off. Our fighting planes came up but not in time. They went over to Fritz and attacked his baloons, but his airmen jumped out; & Fritz hauled down the baloons to a low altitude, & it was not prudent for our airmen to dive low enough to attack them. All our observers jumped out of the baloons in parachoots which are like bright umberallas, and open as they descend gradually lowering the men to the earth. Of course they have to take the risk of getting a bump or a \n\nmachine gun bullet from the enemy. I never saw so many observers floating in the air in parachoots before. The ballon next our camp escaped & the observers landed about half a mile away. Fritz knows his work, but always takes care not to come over when any fighting planes are about. They subsequent returned but kept high above the clouds.\n\n\"The Express\" 22\/5\/17 in a leading article on \"the war in the air\", says. \"The German aviators are afraid to fly over the British lines in France & Flanders\" Question?\n\nJust before going to tea our attention was drawn to our baloon by the guns at Steenwerck coming into action & we saw a German aeroplane falling rapidly nose first and twirling round as it fell in a field. Some of our boys ran away to see it, but they had a long way to go & came back in about an hour. It appears that the plane dived out of a cloud to attack our balloon, but dived too suddenly, lost control & before it could right itself, the guns had it, firing only 3 shots, one of the aviators was shot dead, & the other severly wounded. He could speak English, was taken to the Hospital but is not expected to recover. Some of the lads brought back pieces of the plane for souveniers. There was a great crowd around it, happly Fritz did not shell it.\n\nA hit dump was also blown up in the enemy’s lines just before the plane fell.\n\n1056. Sunday June 24,.1917. \n\nThere are 40 more days to go before the awful war has been raging 3 years.\n\nBefore sun rise this morning I was awakened by our anti air craft artillery attacking one of Fritz’s planes. It evidently came over to see where its fellow plane had fallen yesterday evening. It got away safely, flying at a great height.\n\nThe enemy has been shelling this district all morning. He also put over two big shells in the direction of Bailleul.\n\nBefore dinner an enemy plane darted out of the clouds and attacked the second Baloon from here. He circled around it, firing all the time & then made off at a tangent for his own lines. Several of our batteries kept up a hot fire all the time.\n\nWhile we were watching him escape the baloon suddenly burst into flames, & in a few seconds was all consumed, the basket & ropes falling to the earth very quickly. The two observers had previously jumped out in their parachoots as soon as Fritz emerged & started firing.\n\nIn all probability we will remove from this camp tomorrow. The 40th is going to morrow & probably the 38 and 39.\n\nWe got notice to move out this evening, and there was a hurried packing of kits supplies etc. J. Matthews, Len Sheram & myself remained behind as a baggage guard & to clean up the billets.\n\n The enemy has been shelling our balloon from a long range bursting shrapnel around it. It was hauled\n\nand sent up again without any men in it. This was a great joke played on Fritz. He kept shelling it for hours but failed to hit it. Then he left off probably feeling that he could not frighten the observers who were not in it.\n\nThere was a very heavy cannonade south of Armentieres this afternoon.\n\nSoon after dark a fleet of enemy air craft came over dropping bombs and started two large fires in the direction of Bailleul and penetrated a long way to the rear. In the distance we could see two of our search lights examing in the sky at one place & at another place 1 search light.\n\nWe did not go to bed until 11.30 for fear of being bombed out as the enemy repeatedly crossed & recrossed our billets.\n\n1057. Monday June 25, 1917.\n\nIt is again cloudy this morning.\n\nA french woman told me that there were 27 horses killed yesterday.\n\nWe are very busy cleaning up.\n\nLeft Ependabe about I p.m. and arrived at the new camp in Belgium about 4 p.m. without any accident. We passed on the way one of the marvelous \"tanks\". It crossed the road in front of us, went over ditches & fences without the slightest effort.\n\n The new camp is at \"Carmel Hill\" and there were only two tents for the men, & one for the officer. It came on to rain & rained all night, so I and another were invited to sleep in the officers tent, others slept in limbers with tarpoleons over them. Some of my mates had to go with mates to \n\nshift ammunition & did not get back until 3.30.\n\nTuesday June 26, 1917. (1058.)\n\nShowery this morning but fine in the afternoon. There is a fresh drying breeze blowing.\n\nJ. Mathews & I this morning put up a new latreen.\n\nThis part of the country is Belgium. It is hilly and our camp is in a well sheltered hollow between two Hills.\n\nThis afternoon one of Fritzs planes attacked a baloon, the aviator jumped out in a parachoote but Fritz had to beat a hasty retreat from the archies who opened fire on him. I heard afterwards that the aviator who jumped out was a war correspondent Beach Thomas. I wondered at the time that there was only one man in the cage.\n\nWednesday June 27, 1917. (1059)\n\nFine today. I slept out last night in the grass, with a number of others.\n\nThis afternoon Fritz burned down one of our baloons near hear.\n\nThe Brigader was around this morning. I was busy cleaning waggons in readiness for an inspection by the General to morrow.\n\nThere was a concert here last night and again to night. . I was issued with a pay book cover this evening.\n\n1060 Thursday June 28, 1917\n\nThere was very heavy rain last night towards morning, and our blankets got wet. In fact it was raining heavy when we got up. Ferguson my bed mate got more wet than I did.\n\nThe concert last night was a great success it was given \nfrom\n by the \n\n.\n\nPieroits from the 36 Ulster Division, and the greater part of the 10 Brigade attended.\n\nGeneral Monash inspected the Brigade today, and we have been very busy this past few days getting ready for it.\n\nIt has been fine this evening but it is going to be wet again to night & we don’t relish the prospect of again sleeping out in the open.\n\nI have not seen any newspapers for several days.\n\nTo night a terrible storm came on, the rain fell in torrents, the wind blew with terrific force, & I thought it was going to blow the tents away, and the lightening came in blinding flashes, and the thunder was awful. It was the worst storm I have seen for years. Fortunately it did not last long. It commenced about 9.00 & was over about 10. p.m. We would have been wet through only we took the precaution to erect the mess cart cover over our beds, & fixed up the sides with bags & limbre covers, and the whole tied securely to the ground.\n\nFriday June 29, 1917. (1061).\n\nIt is fine this morning but the ground is wet, and the creek running through the Valley is running a banker.\n\nJust before the storm reached its climax last night one of the baloons was brought. Fritz had been shelling it but whether a shell hit it or it was struck by lightening I cannot say. A ray of light shot away from the baloon & it collapsed & gradually floated down to earth. The baloon did not catch fire.\n\nTo day I received a letter from my sister dated April 17, 1917. It was not correctly addressed for the envelope had not the number of my Battalion or it.\n\nToday with Len Sherham we pulled down a dug out that was used for storing artillery shells. We wanted the iron to make a roof for a fodder shed for the horses. We got 17 sheets half width.\n\nI saw a fight in the clouds between enemy aeroplanes and some of our own. None of them came down.\n\nMy sister says in her letter that my brother Willie is a bombardier in the artillery and at the time of writing was still in Victoria.\n\n I wrote to my sister to day, and also sent away a number of whizbangs.\n\nSaturday June 30, 1917, (1062.\n\nA wet miserable day. It was drizzling all the morning and commenced to rain very heavy about10.30 and continued until the afternoon, when it cleared. My tent being the mess cart cover the rain came through it like a sieve. Most of the other improvised tents shared a similar fate. However we managed to keep our blankets dry by means of the water proof sheets and a few rain coats. We had dinner in the rain. The cook had a big job to keep his fire alight, He managed to boil enough water to make tea.\n\nThere is very heavy and continuous artillery bombardment North East of here. The little brook that runs past here known as the river Douve is running a banker.\n\nI saw a paper today. A large force of Americans have landed in France. There is a great scandal about the treatment & neglect of 7 wounded returning on a troop ship from Messopotamia.\n\nSunday July 1, 1917. (1063.)\n\nA cold wet miserable day.\n\nThis time last year we were on our way from Cape Town to St. Vincent Is.\n\nI finished putting the roof on the fodder shed.\n\nFritz sent over some half dozen shells this morning when church parade was on. They landed not far away from the transports & quite close to some troops marching along a road. The Sargeant got the wind up = i.e. got frightened, & we removed the horses on to the road, but then the shelling stopped & we brought them back.\n\nThis afternoon 2 more tents arrived and we were not long in putting them up. But as the tents here are set down haphazard they will have to be pulled down to morrow in order to put them all in a straight line.\n\nI am on picquet to night, and every night as long as the trench training fatigue lasts which takes 5 mules & 10 men, I will be permanent picquet.\n\nI saw Saturdays \"Express\" today. The enemy has received another blow from the British. Entry forced into Avion. Blazing oil & suffociating smoke was used in an attack on huns. British airraid on Jerusalem.\n\nMonday July 2, 1917. (1064).\n\nA fine beautiful day, in marked contrast to the weather prevailing lately.\n\nJack Wilde got shell shock last night on the trench training, & was sent to the hospital from there. All our men had a trying time.\n\nI am No 4 picquet to night. I go on at 3 in the morning & come off at 6. \n\nEach Battalion has its own little canteen, but things are very dear in them all. I paid 2 francs & 6d for a tin of tomatoes, & a few nights ago 2 francs for a tin of sausages. A small tin of sardines costs 1 franc, & a small tin of apricot jam 1 fr. 50 centimes. I saw Sgt. J Hammett to night. He is still suffering from\n\nshell shock, and is doing nothing. J. Handcock is acting Sargeant for the Pioneers. \n\nThe Battalions are all drilling. There are N.C.O schools all over the place. They work long hours and are kept going pretty constant.\n\nWe had a lecture in grooming horses this morning by an old and experienced English Colonel. All the Transports in the Brigade attended. It was an interesting & instructive address full of practical hints. He addressed us as officers & \"gentlemen\", and prefixed his advice with \"please\".\n\nTuesday July 3, 1917. (1065.)\n\nA beautiful morning. I was up at 3. a.m. to go on Picquet, and had a good time until at 6 a.m when I came off & went to bed, my duties to guard the camp, tie up any horses or mules that get loose light the cooks fire, & put on the water for breakfast, and call the Sargeant at the required hours, this morning at 5.15.\n\nThe enemy sent over a lot of shells in search of a battery. They landed about a quarter mile from the camp. This morning he sent over a lot in the same place. An Enemy aeroplane returning from an expedition flew directly over the camp about 4.30. a. m. the archies fire but without effect.\n\nI received a large envelope from the Base Post Office containing 8 letters from my dear wife & one from Tom Douglas who obtained my address from the Defence department. His letter is dated Jun 8. My wife letters are:- Christmas day 1916. No 41. Jan 1. No 42. Jan 8. (44) Jan 19 (45). Jan 22. No. 46. One Post card","38":"","39":" (47). & one Post card from Annie M. Nicol These letters were a very pleasant surprise. They had been sent to the Hospital when it was there but they did not reach me, for the name of the hospital was not stated. I had given up all hope of getting them. \n","40":" (1066.)\n\nFine but cloudy to day.\n\nThere was a very heavy artillery activity last night & while I was on picquet several enemy aeroplanes came over, but did no damage here.\n\nThe King visited some camps not far from here today, and inspected troops.\n\nThe Battalions in our Brigade were practising for the Sports this afternoon.\n\nLast night I was on picquet from 12 to 3.\n\nWord has came through that the Russians have had a series of successes & captured some thousands of prisoners.\n","41":" (1067.)\n\nFine but cloudy and rather cold.\n\nThere was a sports meeting at the 37. Battalion in the adjoining paddock & it was largely attended. There were a fair number from other Battalions in the Brigade present. The sports consisted of foot racing, including a quarter mile event, a sack race, a spoon race, throwing the cricket ball, long jump, and alarm race, etc.\n\nAll the officers were present & assisted in carrying out the programme & acted as judges. I saw Lieut McNicol. He is looking well & fit.\n\nThere was a very heavy bombardment last night & early this morning. I was on picquet last night from 9 to 12, and to night from 6 to 9.\n\nThe Russian success continues & the Italians have shown the way in reprisals, & dropped messages stating that it would be repeated for every crime committed by the Austrians.\n","42":" (.1068.)\n\nA first day, bright blue sky & fleecy clouds. \n\nThe enemy bombarded several fields this morning\n\nand continued it at intervals throughout the day evidently in search of guns. Some of the shots were quite close to our lines\n\nI saw one of our baloons come down this afternoon. It collapsed and gently fell to the earth. The aviator jumped out in a parachoote. The baloon must have bursed caused either by the valve blown out, or the gas expanding with the heat of the sun, or a bullet or shrapnel striking it.\n\nThe Battalion sports were continued this afternoon and the various heats run off.\n\nThe Russians have captured 18,000 men, 300 officers, & 29 guns. This is a brilliant victory for General Brusiloff. The French have also great success on a 13 mile front, & the Italians have inflicted reprisals on Trieste. I saw the daily \"Sketch\" & \"Express\" today, the price is now 2 1\/2d. Enemy U. boats attacked American Transports in the Atlantic without success. At least one U. boat was sunk. \n\nI finished reading a book \"Heroes & heroic deeds of the Great War\", by Donald A. Mackenzie.\n","43":" (1069.)\n\nA fine day, cool fresh breeze.\n\nI was on picquet this morning from 3 to 6.a.m. There was a very heavy bombardment last night. This afternoon the Transports had a half holiday & with others I went to Bailleul. It is about 4 miles away and we walked down the railway line and came back in a Transport cart. The town is not as large or so beautiful as Armentieres, nevertheless there are some fine shops & buildings. The night before Fritzs planes dropped a lot of bombs & some fell on a Hospital & killed & wounded a lot of patients & some of the staff. I got post card views of some of the chief sites in the town. Beer is 3 ½ first glass. All foods \n\nare very dear , but other things are fairly cheap especially P.C.\n","44":" (1070)\n\nI was on picquet this morning from 12 to 3, there was a very heavy & continuous bombardment nearly all night. A storm came on & there was very vivid flashes of lightening around the sky, and in the morning the rain was coming down in torrents & the river Douve running a banker.\n\nI was shepperding horses this morning. There are no shots to be heard, and all are commenting on the remarkable quietness.\n\nWe are to go to Neuve Eglise to stables there next time we move which will be in the course of a few days. It is reported that Colonel Smith is leaving the Battalion on account of differences with the Brigider , & that the second in command will fill his place. The Battalion is loosing a good man.\n\n When I was in Bailleul last evening I saw some Portuguese officers. They are very dark & bronze.\n","45":" (1071).\n\nA cool cloudy day but no rain. There was a slight artillery activity for a little while last night, but to day has been remarkable quiet scarsely a sound until after 6. In fact yesterday & to day there has been a lot of comment on the unusual quietness. I was on 2 picquets last night from 9 to 12 & to night a picquet from 6 to 9.\n\nI put on a pair of shoes on a mule to day, & removed the straw binding that was put on the wheel hubs a few weeks ago.\n\nI was paid 20 francs to night equal to 14\/8\n\nEarly on Saturday morning a fleet of from 20 t0 30 enemy aeroplanes visited London & droped bombs on the city. The total casualties are 37 killed & 141 injured. Only 4 planes were brought down. The Public are roused & very angry with the Government. The \"Daily Sketch\" says the people are paying £ 7,800,000 a day & their homes are not safe & asks \"If the defences of London \n","46":" (1072)\n\nIt is cold & windy today. \n\nThere was Brigade sports to day. There was a good programme of events. The programme was printed at Hazelbrook in booklet form, & was marked somewhere in Belgium, price 3d. It found a ready sale. There were 30 events. \n\nThere was an inspection of wagons horses & harness today. The 38 Battalion got first, and the 37 was a good second.\n\nA few baloons were up this afternoon the first time for several days.\n\nI am No 4 picquet to night from 3 to 6. a.m.\n\nI was at a concert to night near our lines & was attended by members of all the Battalions in our Brigade. Col. Davis distributed the prises to the winners in todays sports. The two most striking characters at the sports was the \"Swagman\" who carried his bluie & billy all day at the sports, \"Charlie Chaplin\" who continued his antics all day & evening & caused great amusement, ending by quietly taking a cigarette out of an officers mouth and smoking it himself, eventually throwing it over his shoulder in feigned disgust.\n","47":" (1073).\n\nA beautiful fine day. We packed up everything this \n\nfor removal to our new camp West of Neuve Eglise. We also shifted the 2.u stores. After dinner I rode the Doctors horse from our camp at Kammel Hill to our new camp. When we were leaving several enemy planes came out of the clouds and swift as an arrow darted at our baloons and succeded in burning down three in quick success, and made off admidst a shower of shells from our archies. None of our planes were about. Our airmen were again caught napping.\n\nWhen we arrived at the caps we put things in order stacked the tools, picks shovels, axes etc. There are two tents to sleep in but several of us including myself preferred to sleep out under tarpulans etc.\n\nThe camp here is a good one. There are splendid stables, but it would be very wet in the winter although it is on top of a hill in Belgium. The country round about is very hilly and also very pretty. There are several Estaminets & shops here, so it is more civilized than the last camp. The 43 Batt. went into our old camp when we left.\n","48":" (1074.).\n\nA fine day rather warm.\n\nWe were all busy cleaning up the new stables to day – and disinfecting them.\n\nThe G. M. Stores are alongside of us, and also all our other Battalion Transports and several other units.\n\nThere are english stables and billets everywhere. It is not a lucky place at all and there are also shops, estaminets, and a Y. M. C. A. all within a few minutes walk.\n\nThere is good news in the papers to day successes all along the line, E. & west. There is a Political crisis in Germany.\n","49":" (1075).\n\nA fine warm day.\n\nThere was a lot of aerial activity last night & early this morning by enemy planes flying over our billets. The anti aircraft guns were belching away late last night & early this morning.\n\nI was 2 picquet last night of watch.\n\nThe Transport drivers had a rough time last night & the night before taking rations to the trenches They saw a motor lorry driver lying killed alongside the road. Numerous shells were about. I was on picquet tonight 6 to 9, first picquet.\n\nThere is good news of another Russian Victory of 10,000 prisoners & a large number of guns making a total of 28,000 since July 1. The British have suffered a reverse in Belgium near the Sea.\n","50":" (1076).\n\nA very sultery day. \n\nIn 20 days more the war will have been running 3 years the estimated duration attributed to the late Lord Kitchener, who by the way is believed by some people in England to be still alive. \n\nEarly this morning Fritz’s planes came over our billets and dropped bombs, the explosions from which wakened most in camp. Our archies opened fire & our planes attacked them, but they escaped. It is rumoured that another spy in the air service, or rather traitor has been spotted.\n\nThe big political crisis in Germany is not yet over. The Russians continue their succession of Victories.\n\nWe were issued with cigarettes & matches this afternoon, also a pair of comfort fund socks.\n\nI finished reading \"Evelyn Hastings by Victoria Cross. A Mystic story with a strong religious strain of simple piety and strong belief in the efficiency of prayer\n","51":" (1077).\n\nAbout 10 O’clock last night, we were awakened by shells lobbing around us and the horses pracing in the stables. We all got up & took the horses out, and away for about and hour. \n\nThere were 3 or 4 shells altogether and as no more came we put the horses back. One of the shells fell near the road about ½ a chain away from the 40 stables and 2 or 3 from ours.\n\nWe got back to bed when it soon started to rain & by the time I had to go on picquet 3. a.m. the place was flooded, one of my boots was full of water and my overcoat spread over the bed drenched, & the edges of my blankets wet. However I got them dried during the day.\n\nSince we came to this camp there has been no officer for Mr Mapleson is indisposed. There is a rumour that Transport officers are to be dispensed with- They are really not necessary – and sent back to the infantry. No doubt this is a shock to the T----- Officers.\n\nI have read a few leaves torn from a book called \"Susie Suckit\", which is the filthiest vilest & most immoral trash that ever was printed. The pages were torn & well thumb marked. It is the confessions of an indecent woman.\n\nI exchanged picquet with Phillips to night as he wanted to go to a cricket match\n\nFritz has sent over a lot of shells after baloons this evening. They are bursting both sides of the stables.\n","52":" (1078.)\n\nThe weather is again fine but cloudy.\n\nLast night was very quiet Enemy war ships have been seen off the Dutch coast about 100 miles from German waters. A British Transport has been \n\ntorpedoed in the Atlantic. The Germans have been repulsed on the , & the Russians continue their victories at Halicz and Kalurz. S. of Limberg in the D’niester Valley.\n\nWe are busy cleaning 2 limbers & I cooker in peperation for painting & varnishing, to compete in a show on the 22 of this month.\n\nEarly this evening the enemy made a brave but vain attempt to bring down one of our baloons with machine gun fire from one of his aeroplanes, admidst bursting shells from our archie batteries. He made of admidst a hail of shrapnel vainly attacking another baloon on his way. Later on an enemy plane made another attempt & succeeded in bringing down another baloon much further away. Throughout the evening the enemy has been trying his long range guns on our baloons but without success, though some of the shells burst very close & the pieces fell close to the stables. Just before dark he made another attempt at shelling our baloons & the shrapnel from two shells burst over camp, I was out in the open & they fell all around me & within a few yards. I was lucky another shell, a dud fell near another stable a few chains away.\n\nI am second picquet to night 9 to 12. \n\nThis evening I made some match box cases out of brass artillery cases, also a butter knife\n","53":" (1079).\n\nA fine day but very cloudy.\n\nThere were a few enemy planes over our billets this morning. The papers to day publish an account of the King & Queens recent visit to the front. The \n\nvisit lasted 12 days. The King made a tour of the battlefields of the Somme the Ancre, Arras, Vimy and Messines, while the Queen visited hospitals. Daily Express 16\/7\/17 gives a vivid description of the tour. Bethmann-Hollweg has been shifted & the new Chancellor is Dr. Michaelis a subordinate\n","54":" (1080).\n\nCloudy and showery.\n\nWe are very busy cleaning polishing the brass work, painting and varnishing 2 pairs of limbers and 1 cooker for the show to be held next","55":"\n\nIt is a pity the Heads could not get some other day for the show.\n\nThe Russians have been met with a reverse at a village, but their total number of prisoners since July 1 is now 39,000. America is making great aerial preperations & announce they are after big results that will astonish the allies as well as Berlin. Austria & Bavaria want peace. A majority in the Reichstag want peace without annexation or indemnity.\n\nIn 16 more days the war will be raging for 3 years.\n\nI filed & polished 7 collar or drag washers for Limberes – a hard days work. J. R. Mathews, W. Wilson and I worked 3 hours after tea on the Limbres.\n","56":" July 19,1917. (1081).\n\nThere was very heavy rain last night & the ground is very muddy & amp; sloppy this morning.\n\nI am on picquet this morning from 3 to 6. At 3.30 I lit the cooks fire and made myself a cup of cocoa.\n\nMr. Mapleson is now in Hospital and Mr Robinson is now acting in his place. Some seem to think that Mr Mapleson will not be coming back to the Transport.\n\nThis morning I got short notice to pack up my kit and go to Brigade Headquarters with another man. J. Watson drove us up. The Brigade Headquarters is underground and at the back of Messines. We are to put out some water 3 times a day & one at night. The dugout is about 45 feet underground, and we are to sleep there.\n\nIn the evening with others I walked over to the battle field to the old german trenches, and inspected the mine creators made by the great miners in the famous battle of Messines. I saw 5 or 6 of them. They are of varing sizes but all large enough to bury a church in. Some of them must be 60 to 80 feet deep & 2 to 3 chains across. They were the greatest explosions of history. The German trenches don’t exist. They are a series of shell holes\n\nEnormous dug outs have been flatened in, and the inmates buried. I saw several human skeletons in the mud, and bones & a skull bleached white evidently bones out of a grave that had been blown up. I saw a number of crosses with German inscriptions on them, where the enemy had buried their mates alongside the trenches.\n\nConcrete dug outs were smashed in, and heavy railway rails used in this construction were bent and twisted in all shapes, and barbed wire entanglements were blown to smithereens. There were some concrete dugouts that escaped destruction, but they \n\nwere flooded, also several mine shafts that\n\nwere lined with iron. It was 10.p.m. & just getting dark by the time we worked our way back to our dugout over a series of shellholes entanglements & trenches.\n\nFriday July 20,1917. (1082.)\n\nAll the sleeping rooms in this vast dug out are overcrowded and dozens sleep on the hard damp floor, and many use the various passages. There are 5 exits, and it is very warm inside, especially near the gas engine used for driving the dynamo. It was 12 Oclock when I got to bed & I did not get up until near 9. This morning the hold was full of water & it took over an hour for two of us to pump it out. I went up on top for about ½ an hour for some fresh air. Fritz was shelling some of our guns behind & many shells fell close to this cavern. When I was getting a drink at the cook house at no 9 exit a shell landed within 10 yards of me. There were the two walls of the trench between me & it, & I was stooped trying to get some water out of a petrol tin when it went off, so it all went over me. There were others about & none were hurt.\n\nLater I heard that the shell was a dud. I was so close to it I could not tell & did not stop to examine. It broke in the trench which was repaired in the evening. While doing so a corpse was discovered under the trench.\n","57":" (1083.)\n\nI slept in one of the tunnels last night in company with a lot of British Artillery men who were shelled out of their billets & came to the tunnel for safety. There is more room here, & better air, & it is not so\n\nso hot. This morning when we finished pumping out the sap, we had to lift a lot of duckboards in a tunnel & sweep out underneath. It was a dirty job, for it had not been cleaned out for months & was full of mud & slush, which had to be carried to the surface in Petrol tins. The job filled in the most of the day.\n\nThe enemy is heavily shelling Batteries on each side of us today. By the way the name of this subtraneous system of rooms and tunnels is known as the \"Midland Dugout\".\n\nThere has been intermittent artillery activity during the day & in the evening it grew to great intensity, a number of 12 ins Howitzers were continually barking all evening.\n","58":" (1084)\n\nA beautiful clear warm day outside, but always the same down here.\n\nThe artillery drill is being continued this morning and there are a few enemy aeroplanes afloat.\n\nYesterday evening I counted 21 of our observation baloons up. The largest number I have seen at once. I saw 7 or 8 of the enemies. His are few & far between. But this afternoon I counted 26 of ours and 15 of the enemies baloons. \n\nAll day long there has been a constant artillery duel between our big guns and the enemies. The enemies shells are big stuff, and mostly H.E. with occasional smoke shells, incendiary shells and some schrapnel.\n\nLately I have seen lots of packages of tobacco thrown\n\naway by the troops that are the gift of Australian Comfort Funds. The tobacco was of inferior quality and could not be given away. The French civilians who are always very anxious to get things from the troops would not touch it, though they would smoke Australian tobacco. It is bad policy & a waste of funds to send \n\nover inferior tobacco. It would be far better to send less and better quality.\n","59":" (1085)\n\nI made a brake of 5220 strokes of the pump this morning, without a stop about ½ an hour after breakfast.\n\nAll night and again today their is a terrific artillery duel going on.\n\nIt is reported that another mail ship with mails to Australian has been sunk. This will probably make another brake in my letters home.\n\nWhen going down to the dump to day at the foot of the hill for petrol we had to hasten for a lot of shells were coming over. A corporal an Aust. was killed there this morning. There was a lot of traffic on the road, & all were hastening. We had to wait some time for the rations & petrol, & then hurried back.\n","60":" (1086.)\n\nThe weather upstairs is hot, close & cloudy. In fact it is oppressive, but one must go up now & again to get some fresh air. The enemy is continually shelling a hill on our right all morning. But doing no damage, but he thinks he is. It is hard for his planes to distinguish between dummy guns & real guns. Yesterday afternoon I was \n\nparaded to one of the Brigade Officers in reference to an improvement in the rife Grenade so that it can be fired with ball cartridge.\n\nI made a brake this afternoon of 636 strokes on the pump. This beats all competitors.\n\nThis afternoon I saw for the first time our 12 in shells going through\n\nthe air from our 12 in Howitzer. I had often watched them before but could not see them. The way to look is to watch the gun & when she flashes look up about a chain from the muzzle and the shell can be plainly seen as it travels through the sky until it is lost in the clouds on its way to the enemy about 12 miles away. These 12 in shells are about 3 ft long and in their flight through the air look no bigger than a bird but of course their flight is at a tremendous rate and their trajectory is very high the gun being at an angle of about 45 degrees.\n","61":" (1087).\n\nIt is a year to day since we landed in England from the S.S. Persic, at Plymouth.\n\nIt was fine this morning, but started to rain about 9. a.m. and continued steady rain I put my blanket out this morning to get aired, & when I finished pumping I went up and found it all wet.\n\nIt is a current belief with the artillery men around here that the war will go on to about the end of September. They pin their faith to a prophesy that the war is to last 42 lunar months, which is about 3 years and 2 ½ months. They also say that on this sector the enemy is as strong if not stronger than us in artillery of all\n\nkinds. He has evidently concentrated his artillery from hereabouts to see in anticipation of a break through by the British. They also say that the artillery duels is as strong in intensity and duration as anything on the Somme ever was. This is one of the warmest sections in the whole Western front and there will be some violent struggles here during the coming weeks.\n\nThursday July 26, 1917. (1088).\n\nIt is fine to day.\n\nI borrowed a dry blanket last night from a canadian while my own was drying in the engine room.\n\nThe enemy is continually straffing all around us today. Two British gunners were wounded, one last night & the other this morning. The enemy put in two shells in the dug out at the foot of the hill, but hurt no one, but damaged this dug out, which is now being repaired.\n\nI received 3 letters from my dear wife today, dated May 22, No 67, May 25, No 68. The last letter I got was dated April 22 so there was a gap of about a month between them, but a few may come in yet, & others are probably at the bottom of the sea for many mail ships have been sunk lately. I also got one letter from Annie McNicol of","62":"\n","63":" (1089.)\n\nIt is again fine to day.\n\nAll this morning the enemy has been straffing all around here, shells are falling fast and furious & it is not safe to go out for long at a time. 4 were killed on the road passing by here and\n\nthree wounded this morning.\n\nI made a serviette ring and a table knife out of a copper band cut off a shell for a signaller in the Brigade. He \n\nAt 2.a.m. I went with two Canadians to the Dug out at the foot of the hill for rations and petrol during a lull in the enemy’s bombardment when we got there the stuff had not arrived and the shelling again started and continued all evening. It was 8.30 when I got back. I waited an hour longer than the others for the rations & had to return without them.\n","64":" (1090).\n\nIt is fine and warm today.\n\nLast night 2 days rations was sent to us from Brigade Stores, which I take to mean that we will probably go out to morrow or Monday.\n\nThe enemy artillery is fairly quick this morning. I chiseled off the copper driving bands on some enemy shells this morning to make some souveneirs. Thisevening while waiting for petrol at the foot of the Hill I chiseled off the driving band off a German 5.9 Howitzer. I saw a new German Gas shell that failed to explode. It was dug out and brought to Brigade H.Q. to be examined.\n","65":" (1091.)\n\nIt is wet to day. At 10.a.m. there was a heavy storm – loud peals of thunder, vivid flashes of lightening and torrents of rain.\n\nThere was a terrific artillery duel yesterday evening and last night. The enemy shelled all this sector & drove all the artillery men into this dug-\n\nout for the night. Many of them had narrow escapes in coming up. The last only came up at 12 O’Clock just when the lights were put out.\n\nMonday July 30, 1917 (1092).\n\nIt is wet & sloppy this morning. I got another letter from Irene Ring dated Jan1. It was sent to the hospital and had been all round the country. I also received a letter from my brother. He is in Hospital in England with mumps. His letter was dated July 25, 17, so it was not long coming. His address is No. 33173\n\nBdr. W.G.Wilson \n","66":" Rfts\n\nVictorian Field Artillery\n\nYork Hill, England.\n\nHe was 10 weeks on the water. He came in the Shropshire and called at Fremantle, Mauritania, Durban, Cape Town, and Sierra Linone.\n\nThere was a heavy bombardment \nlast\n this night in preparation for the raid that is to come off to night. The 11 Machine gunners came up under CaptainTaylor who used to be O.C. of H.I.D. in the 37. Bat.\n","67":" (1093)\n\nThe bombardment continued all night and grew to great intensity at 4.O’Clock when the raid was in progress. Several batches of prisoners came through this morning, and I believe the raid was a great success. The weather is much better today. Later news to hand reports that the offensive was on a very extensive scale and a brilliant success. The 4 and 5 army corse and the French obtained all their first\n\nobjectives, La Busnic has been captured, and there have been brilliant gains, hundreds of prisoners South from here and North to the Sea. Armentieres is the first and we are advancing each side of Lille, which will compel the Germans to evacuate Lillie. This they will not do without a terrific struggle, but once they are out their hope of holding Belgium is done.\n\nThroughout the day there was intense artillery activity all along this sector. During a lull we went to the front of the hill for Petrol and had a trying time coming back, we met the chaplain riding his bike back from the front, admidst it all accompanied by his batman. We left without the rations & came up with some borrowed petrol. This morning a big H.E. shell exploded about a chain away from me. This last day of July will be remembered as a big battle day, on the W. front, a day that is drawing us nearer to glorious victory. \n\nThis evening a signaller told me that over 3000 prisoners have been brought in. There must have been as many more killed for our bombardment was terrific. The enemy counter attacked this evening and was received with a terrific hail of shells.\n\nI am on night duty all night on account of the lights being wanted all night, and I have to pump water for the engine tank every 3 hours. I go to bed between times. My mate done it last night when the lights were wanted all night. I am writing these notes at 1.30 to night.\n","68":" (1094)\n\nAt 2.25 a.m. a shell cut the wires leading to the dug out at the foot of the hill & cut off the light. The engine saved & the lights here increased in brillancey or we would not have known.\n\nAs the lights were not required here after midnight we stopped the engine & went to bed.\n\nThere was heavy rain all night and it is showery all day. The sap was overflowed and the pump half emerged.\n\nIt took Ferguson & me three solid hours to pump it out. It has been making water fast all day & this evening, & we have been in the pump pretty often.\n\nI have not seen a paper this week and we have heard very little news from the office except that we are holding our gains & made some further gains last night on this sector. The French are doing well.\n\nThere was great artillery activity last night & throughout today. I heard some of our 15 in guns at work. They shake the earth. Fritz sent over this dugout a large number of high velocity shells in slearch of batteries.\n","69":" (1095.)\n\nThe ground is very wet and sloppy, & the roads are covered with soft slippery mud, & off the roads one sinks over the boot tops. There were frequent light showers. This sector is very quick today. There is not much artillery activity, especially from the enemy.\n\nThere is a plague of vermin in this dug out. We are all more or less covered with lice and all continually scratching. I have frequently taken off my shirt and slautered the enemy. Fortunately there are not many rats in the dug out for there is no cover about, but at the horse lines they are very numerous & as large as small rabbits.\n","70":" (1096.).\n\nThe war has been raging exactly 3 years today. Those three years have been a terrible time for all the countries concerned and in a lesser degree to neutrals, for there is no nation that has not suffered more or less by the Great War. But the signs of the times points to its early termination. Some of the British artillery point to a Biblical phrophecy that it will end when it has run 42 lunar months. That would be 3 years & about 2 months and 3 weeks, or about 22 of October.\n\nThe weather shows an improvement today. But it is yet very muddy, and the sky is cloudy.\n\nThere was some intennce artillery activity N. of Messines. By the way the ruins of Messines is only about half a mile E. of here. This afternoon is very wet & sloppy & miserable.\n\nWe have been expecting to leave here this past few days, & at last we are to leave to morrow. I had another interview with Mr. Murrey the Brigade boomer re my attachment to the Mills Grenade.\n\nSince I came here I have had my P.H. Helmet & bayonet stolen. But I got another bayonet this afternoon.\n","71":" (1097).\n\nThe weather took up a bit this morning, but in the afternoon it was as bad as ever, and the roads are a quagmire.\n\nWe expected to go today. I packed up and rolled my blankets this morning in readiness, and later we got word that we are not to go until to morrow. The sky being so cloudy, there have been very few aeroplanes about during the past few days. Our artillery in this sector has been fully active this evening, but the enemy is doing little. He killed a number of men on the road.\n","72":" (1098.)\n\nThe weather has taken up a bit. \n\nWe were all up early this morning and Bill & I had the water pumped out by 9.a.m. and our blankets rolled in readiness to move out. Most of the others had gone out by 10.30 but we are to remain to clean up. \n\nAbout 1.15 we left the dugout (Bill & I) and started to walk to the camp at Neuve Eglise but we got two lifts along the road which carried us much of the way. We arrived at the Stables about 3.30. After tea I pitched a tent for the night, and also made a butter knife out of a driving band from a shell.\n","73":" (1099.).\n\nIt was fine this morning but started to rain again in the evening. There was a heavy artillery duel last night.\n\nA number of shells dropped near here about 10.p.m. and soon after an enemy plane dropped 5 bombs.\n\nI helped to make two bridges today crossing a drain into the stables the 10 machine gunner transports left here this afternoon. We are to remain here another fortnight while the Battalions are resting, & then I understand they are to go again for a short time into the trenches prior to getting leave.\n\nThere is great unrest in the army.\n","74":" (1100)\n\nDull and cloudy but fine. The mud is drying up a little.\n\nLast night was fairly quiet. The enemy\n\nagain sent a few shells in the close vicinity of this camp.\n\nThere was an inspection of all the mares in the Transports yesterday, with a view to picking out all suitable for breeding. Two were selected. This looks like as if the Government expected the war to end soon.\n\nJust as we were going to dinner the Transports got orders to move to a new camp near the Battalion & not very far from our old camp at Hamel Hill. We hastly packed up and got everything away including the G.M. Store & our tents up before dark. We had fine weather for the shift and only about 2½ or 3 miles at the most to go. We passed through hilly country all the way along a winding road, we passed several new weather board Estaminets which the enterprising Belgains erected for the mutual benefit of the troops and themselves. The scenery was very picturesque farm houses & camps all the way, interspersed with Estaminets, and at one place we passed within a few chains of the French frontier, a long pole finished \nabout\n near the end & weighted marking the barrier which was used in peacetimes to intercept traffic by the customs. Now it is pointing heavenwards & all & sundry may come & go as they please.\n","75":" (1101.)\n\nThis morning Bill Murdock & I built or rather dug a latreen & then built a cook house. We scoured the country for parts and wall plates. We did not get it finished to day.\n\nThis morning we were paid. I received 30 francs, £ 1.2.0.\n\nBefore dark it started to rain & we dug a trench around our tarpolen tent.\n","76":" (1102)\n\nBefore we got into bed last night it started to rain like one thing. It poured through our tarpolen like a sieve and we had to spread our overcoats over our blankets to keep them dry and put our bats on. It is not a new experience for me to have to go to bed with my bats on to keep dry. There were some very vivid flashes of lighting & loud peals of thunder. It was over in about an hour. Then about 3.30 a number of enemy planes came over on a raiding expedition & dropped some bombs, one falling not far from here.\nshook\n Our search lights spotted them & our guns & air craft got to work & drove them off. About 10 this morning 2 enemy planes came over again. They were above the clouds, & our archies peppered the sky beneath them. Two of their shells were duds & fell just outside our camp, one dropping each side of me with only a few seconds interval.\n","77":" (1103).\n\nFine but cloudly all day.\n\nWe started building a harness room yesterday & carried on with it today. Just before dinner we got instructions to clean the wagons for a Brigade ceremonial parade at 2.15. We had a hurried dinner, & all hands started cleaning & washing the Limbers & got away in time. The other Battalion Transports alongside of us had the same notice as ourselves, & also made haste. The whole Brigade followed by the Transports marched to Bailleul & on the outskirts of the town formed up in a paddock & was inspected by B. general McNicol, and then we came home again. I was one of the Brakesmen & had to walk behind the limber, but I rode coming back. We had a short allowance for tea to night, only bread & jam. It has\n\nbeen this way for several days past. So yesterday we put in a franc each & got a supply of vegetables from Bailleul.\n","78":" (1104.).\n\nLast night about 3.a.m. an enemy plane dropped a number of bombs around our camp one falling about half a chain from the cook House and shook the ground we were sleeping on. \n\nEvery one started cleaning the wagon & moved off about 10 a.m. to the Parade ground at Bailleul where we were reviewed by the C. of 2.9.C. General Plumer, accompanied by General Monash, our own Brigader and several others. They were highly pleased and we returned arriving at the Transport camp about 2.30.\n\nI made some service rings yesterday & this evening out of the driving bands of enemy shells. I varnished them when finished.\n","79":" Aigist 12, 1917. (1105)\n\nLast night was very wet in the early part of the night, but it is fine to day. We have a half holiday this afternoon & I spent it writing letters. We are to go to St. Omer on Wednesday, probably taking 2 days for the journey, & it is possible we may not come back to this sector.\n\nWe are to move to morrow morning.\n","80":" (1106).\n\nWe were all up bright and early & got away by 10 O’Clock\n\nthe whole of our Battalions Transports assisted by the A.S.C. moved off together. I was brakesman for W. Kicleys limbre and drove by turns with him riding the near side mule while doing so. We went through Bailleul and through two villages beyond it, when we halted for dinner. After dinner we made another start and kept going until we reached Staple when we unharnessed and camped for the night. We passed through several nice little villages, and saw many on both sides of the roads in the near distance in fact the whole landscape was \ncovered\n dotted over with villages & farms, the spires of the churches standing out prominently. It was beautiful weather and harvesting was in full swing. Side by side with very primitive methods of harvesting such as the hook & scythe were some of the latest American binders the Massy Harris, & in one village through which we passed was an agency for these machines displayed in prominent characters. Through the open doors & windows of some of the houses we could see hand looms at work and also old women making lace. The scenery was very beautiful and overhead there were scores of British Aeroplanes \nflying overhead\n protecting the land from the devastating hands of the Huns. We crossed many railways, the engines & trains of many being British, & all engaged in carrying munitions of war. The whole distance we travelled from No. 2 camp at Kamel was about 15 Kilometres miles\n\nBefore dark I went with W. Kirby to Wallow Cappel to obtain rations for men & horses, a village about 3 K. or 2½ miles away.\n\nWe pinched some sheaves of hay on our way back for the mules. All the others transports (one Limber from each) had also to go.\n","81":" (1107.)\n\nReveillie was at 5.30. The morning was bright & fine after a little rain through the night. We got away about 9.a.m. and travelled on towards St. Omer passing similar country as we did yesterday. The fields of wheat & oats grew larger as we got further into the country and many Reapers & Binders were at work as well as many scythes and hooks, for the latest & the oldest ideas work side by side in beautiful France Windmills were everywhere & on one hill I counted 8 or 9 large windmills. This particular hill has a large monastry on it. We passed through several little villages and at Arques we saw 3 brick kilns in full working order. We passed over two canals or rivers the last one being at Arques which is 4 kilometres from St. Omer which we could plainly see. Here we turned at Right angles and went away from St. Omer to Lumbre passing along the banks of a little wooed stream with a ridge of hills on each side and almost a continuous line of vilages the whole way. We arrived at Lumbre about 6 where we halted for a spell. It started to rain here & we had several heavy showers before we reached our destination at about 7 or 8 miles away which we reached after dark. After a long delay we found our billets unharnessed in the rain made our beds in the wet grass after having a \n\ntea in the dark, & turned in about 11.30. A few slept in a barn. There was some heavy rain through the night & the tarpolin failed to keep out all the rain I was sleeping on the grass with a tarpolin spread under me & over me, others slept in limbers & some in the barn. The Battalion arrived by train ahead of us, but they had about 18 miles of a march from the station.\n","82":" (1108)\n\nA miserable wet morning. I had 3 hot coffes & brandy at a French house which was well patronised & then had breakfast. We had very little to do to day in fact a rest after the long journey. This evening I had a look around the village. Its name is Belequin, and it has a very beautiful church with a spire, and well-fitted up inside. The village is very small. I shifted my camp this morning into a large barn.\n\nThe \"Daily Express\" publishes an appeal by the Pope to the waring nations for peace on the grounds of restoration, return of captured colonies and special treatment for Alace & Loraine & Poland.\n\nToday is Ash Wednesday and the local church bell was ringing at intervals throughout the day. Many services were held in the church for the French. It was the first church bell I have heard ring since I have been in France. They are not rung in the war zone.\n","83":" (1109)\n\nIt was fine last night but threatening rain to day. We are at the usual routine work today; feeding, grooming, & cleaning. I received a letter from Willie this morning. He is now at Lark Hill & getting on well. He left Melbourne on the 10th of May & arrived at Devonport on July 19th.\n","84":" (1110)\n\nA beautiful morning. The weather has now taken a turn for the better. Last evening was an ideal day. There is a little creek running below the barn, which has beautiful clean water in it, & flows very rapidly. I can hear it bubbling over the stones as I write. It is the best water I have seen in France & the stones in this district the first also. They are mostly flints, with some hard lime stones.\n\nThis afternoon all the transports washed & cleaned their web equipment & brightened the brass work in accordance with Brigade orders. This is the first time we have done it since it was issued to us at Seymour. At one time it was a penalty to brighten the brass work. There is evidently to be an inspection.\n\nI packed up ready to send to my wife the following souveniers. 1 horse shoe made out of a German shell. 1. Butter knife & 1 paper knife made out of the driving band of a British 18 pounder shell, 1 serviette ring made out of a German driving band, 1 piece of alluminium being a fragment of the timing fuse of a German shell. I wrote to my wife this evening letter 89.\n\nThe Pope’s peace offer is not entertained by the Allies. It is inspired by Berlin & has caused great enthusiasm there & in Vienna.\n\nThe French & English have delivered\n\nanother smashing blow to the Hun in Flanders. Langemarck is captured. Important successes & over 1,800 prisoners, the attack was on a front of over 9 miles N. of Yres-Menin road. French troops operated on the left. This afternoon we received this morning's London \"Express.\" This is the first place I have been where we could get the London morning paper in the afternoon.\n","85":" (1111)\n\nA fine morning but cloudy. There is a plague of small minute vermin like wood lice in these old buildings which have not been in use for years. They crawl on our clothes but do not bite. Horse lice still annoy us and we have frequently to take off our shirts and pick them.\n\nI was at a very good concert at the Australian Y.M.C.A. Tent which followed us here for the entertainment of the Troops. Capt. Toul contributed two recitations which met with great applause. An officer in the Artillery also contributed two items. All the other items were contributed by the soldiers of this Battalion.\n","86":" (1112)\n\nA fine day. There was a general inspection this morning by Major Robinson including the transports section. He was highly pleased with the Transports. Alick Holmes had a toe broken this morning shoeing a horse, & was taken to the Hospital. We have a holiday this afternoon. I went for a walk with Fred Barclay this evening around the village & out into the country lanes. Most of the crops are all cut and stooked in sheaves.\n\nAn Australian mail is in & I got two letters from my dear wife dated June 1, No 69. & June 5, 70.\n\nI was on picquet last night. No 4. from 3 to 6.\n","87":" 1917(1113)\n\nA beautiful day. This afternoon 7 of us went to a village several miles away to cut some chaff for our horses.\n\nI have got a very stiff shoulder and neck this afternoon, & if it is no better in the morning I will parade sick. \n\nI sent the parcel to my wife today, & registered it. It cost 1 franc and a half to register it.\n\nA big battle is raging in Flanders and Langemarck has been taken.\n","88":" (1114)\n\nA fine & beautiful day. I was on sick parade today & got my shoulder rubbed with some embrocation & took it easy the rest of the day & had a good sleep.\n\nToday I finished reading an Australian Book. \"Ginger Mick\" a tale in rhyme by C.J. Dennis of a larrikin who enlisted and done his bit at Gallipoli\n","89":" (1115)\n\nA beautiful day We were on the usual routine work this morning cleaning harness. There is to be a route march to morrow & the Transport is to take part in it. We were paid this morning. I received 20 francs. 14\/8.\n\nThere is a half holiday this evening, but there is no place within easy walking to go to. \n\n X\n","90":" (1116)\n\nWe are 9 months in France today. It is showery. We are at the usual routine work. Only the coopers & water carts with their drivers had to go on the start today.\n\nBill Grey went on the blighty leave this morning. The leave train near Bologne colided with an ammunition train & it is reported here that 40 were killed & injured.\n\nLater. The first report is not correct. The collision was near here, but it was a goods train not a leave train that collided. A number of trucks were smashed. This is another instance of the number & character of \"furphies\" that travel around.\n","91":" August 24.1917. (1117.)\n\nWindy all day with a few showers. We were all at the usual routine work today. A large number of good conduct stripes were served out this evening to those who were elegible- that is 12 months service without a crime.\n\nI received a letter from my sister this evening dated May31.\n\nI sent Christmas cards to my wife, my sister and my Father & Mother.\n","92":" (1118)\n\nA fine morning but cloudy. This morning with others I went to a village called Senlecquin where the 38 Battn. is camped to cut some hay into chaff. We returned before dinner. At a Debilant, which is another name for estaminent, we called in on our return and had 3 hot coffees & cognac which we enjoyed. \nI sent\n This evening is a half holiday.\n\nYesterday I made a shaving mug out of the brass of a shell nos cap. It is a British one. The base is a copper ring which I made out of a driving band off an enemy shell. I got the Plummer to solder the ring to the cap.\n\nWith Len Sherham, J R Matheson I went blackberring. We travelled several miles of country lanes and I had the bigest feed of ripe blackberries I ever had in my life. Also a few strawberries. The land here is stony being full of small flints & reminds me of England.\n","93":" (1119.)\n\nA fine day. We have another holiday this afternoon. There was the usual inspection this morning just before dinner. Lieut. Mapleson has returned to this Battalion, and will in all probability resume his duties as Transport officer much to the regret of a number of the men who prefer our present officer Mr Robinson.\n\nThree of the men here were sent away to divisional H.Q. this morning to act as Traffic control. Bill Murdock, Tom Byrnes & - Lamb.\n\nI finished reading a very interesting Book \"False Evidence\" by the well known author E. P. Oppenheim. It is a story of an officer who was cashiered & lost his commission on a charge of cowardice the evidance was false & the truth did not come out for 25 years when his half brother admitted it, & the officer again becomes a hero.\n\n8 pages.\n","94":" (1120)\n\nIt was wet last night & this morning. I was on No. 3 picquet from 12 to 3. It was windy with occasional showers & no moon. It was a bad night for picquet duty. There is occasional showers today and a strong wind from S.W. The war news during the past month has been . The \"Express\" today reports the Italians capture a great mountain fortress Monte Santo one of the outstanding bastions of the Austrians fortified line The Austrians are in retreat hotly pursued, 23,000 prisoners and 75 guns are captured by the gallant Italians, who are showing tremendous courage and resourcefulness. The battle is raging along the whole Italian front & in favour of the Italians. 233 aeroplanes were engaged in the struggle, & only one failed to return.\n","95":" (1121)\n\nA cold wet miserable winter day. It was rough & stormy last night, and all this evening, and there is every appearance of it continuing through the coming night.\n\nMr. Mapleson took over the Transports this morning. From returns published the Allies have taken over 167,780 prisoners since April.\n","96":" (1122.)\n\nToday the weather is cold & showery. We have a half holiday this evening, but the weather is too bad to move out of the barn, so most of us are staying in some reading some writing and some playing \"two up.\"\n\nSeveral mails have come in during the past few days but I have received none. The latest dated letter that I have heard of is June 25, which is 20 days later than mine. No papers came yesterday, but Tuesdays paper came tonight, & reports a succession of allied victories. Haig says:- \"the enemy cannot stand many more such blows.\"\n","97":" (1123.)\n\nCold South winds with occasional showers. I was shepherding horses yesterday morning and again this morning on the roads in order to give them a feed of grass. There is generally good grass along the sides of the French roads in this district.\n\nThis afternoon I made & fitted a pair of rollers in a set of nickel spurs.\n\nEverything is very dear in the canteen & at the Y.M.C.A. I paid 1 franc & 6d for a tin of nestles condensed milk.(sweetened) I had a feed of to night.\n","98":" (1124.)\n\nShowery today. This afternoon I made a \n\nblade for a curved bootmakers spokeshave.\n\nI have had griping pain all today & this evening. I took a dose of salts this morning but felt very little better.\n\nI received two letters from my wife this evening dated June 27& 28 and No 74 and 73. She had received 5 letters & 2 P.C. that week- a feast of mails x C.P.& T.B. & the Miller girls, & I. Ring also received P.C.\n\nI was issued with a new pair of brown Australian boots today size 8.4. I needed them very badly as the ones I was wearing were leaking & I was wet footed every wet day. I had them since last January. The Aust. boots are far superior to the English boots. There is better material in them& they are better made & better shape.\n\nThere is to be an inspection of the whole Battalion transports included next Tuesday and during the past week we have been busy making preperations for it, getting our equipment clean and 8 made good.\n","99":" (1125.)\n\nThis is the 9th month of the year, the war is not finished but the end is in sight, and I believe that about the end of October will see the end of it. If it does not end about then it will probably go another winter, which neither side wants, least of all the enemy. The recent Italian Brilliant series of success bring the end appreciably nearer and has a marked effect on the conduct of the war throughout.\n\nI received another letter from my wife dated Jan 31. No 48. One of the first written from Merrigum & describing the trip up & the stay at Seymour. It had been through the various hospitals & eventually sent back to the Battalion. \n\n I wrote to Cis this evening.\n","100":" (1126.)\n\nCloudy and showery. There was the usual half holiday yesterday & again this evening but the weather was too changeable to go out.\n\nA lot of reinforcements came in early this morning and today amongst them being Driver McDonald one of the original Transports who took sick at Lark Hill last year & has been there ever since. Lieut. Hunter sent a message wishing to be remembered to the Transports.\n\n(1 line of shorthand)\n","101":" (1127)\n\nA fine day and clear bright sky. I saw a French funeral procession this morning. The priest led it, chanting all the time, & it was followed by the pall bearers & then the hearse, & then the mourners. The mourners were all dressed in black. The hearse was a covered in farm two wheeled conveyance improvised for the occasion and draped in white with a black cross on the sides. The priest was dressed in white and the pall bearers were ladies. The coffin was carried into the church where a service was held. The coffin was a small one evidently that of a child, & perhaps a girl.\n\nI was shoeing all day. This is the first whole days shoeing that I have done since I have been in France. I had a new Farrier Campbell who came to the Transports last night helping me but he had not much experience & could only nail on, & was very slow. We done 8 horses and 1 mule, one horse a draught had a full set put on. I done all the fitting & most of the \n\nnailing on. There was an inspection today, being a rehearsal of the stunt for tomorrow, but the Farriers were exempt from it. To night we can hear a heavy bombardment in the distance.\n","102":" (1128)\n\nA beautiful morning. We had breakfast an hour earlier, viz 6 o'clock, in order to be in readiness for the stunt at 1 o'clock.\n\nA new farrier came in yesterday evening. His name is T.J. Ryan He has had previous experience & is a very good man. The other one, Campbell, had no experience in civil life and was again sick today. We shod four this morning including a mule. \n\nWe had an early dinner and started punctually. I was brakesman for Mr Kieley's limbre. We were in full mobilisation order, but carried our own rifles and packs in the waggons. All the Brigades Transports were out and the Brakesmen were not allowed to walk. We marched to a village about - miles away called Senleneques, outside of which The Brigader with his staff and General Monash were waiting to take the salute. Then we came home.\n","103":" (1129)\n\nA fine day. Shoeing all the morning with T.J. Ryan. Campbell paraded sick.\n\nA half holiday this afternoon Bill Wilson & I walked to a little village called\n\nNielles Lez Balequin 2.5 killometres away. It is a much larger village than this one. The New Zealanders are camped in it. We met two of them in an estaminet and had several glasses of rum together, 6d. per large glass. One of the men was 64 years of age. His military age is 39, and he has a son in the army who is 42. He is now on traffic control. \n\nWe made several purchases & had a walk around the town which is rather picturesque. It has a water mill and a fine church the steeple of which can be seen a long way. We got back before dark & just before the rain came on.\n","104":" (1130)\n\nCloudy but fine. \n\nI was on piquet this morning from 3 to 6. There were a few heavy showers but I did not get wet.\n\nI was shoeing all day and I had T.J. Ryan helping me. He did most of the floor work. While shoing a french woman came over & said something about a V..... & gesticulated We went over & found a cow that just had a calf & she wanted it carried in to the shed. We did it & they were awfully pleased. Provided us with a dish & towel & shouted whisky all round.\n\nI received two letters from Cis today. One was dated Jan 2. & the other June 15. No. 2.\n","105":" (1131)\n\nDull & cloudy. There was rain last night, & it is threatening this morning. I made out a list of shoes & nails required for the Transports this morning.\n\nI have been shoeing all day with Ryan helping me. A wet canteen has been opened by our Battalion this evening on the side of the street in a lean too erected by the Pioneers.\n\nThe Germans have advanced past Riga & the Russians are retreating. Lord Rhonda has made an appeal to the Farmers of England. Sacrifices must be made in the gravest crisis of our history. Compulsion is the only alternative to compliance. If farmers continue to hold up their cattle the Government will intervene, supplies will be requisitioned, & competitive buying stopped.\n","106":" (1132)\n\nIt was very foggy this morning but it turned out a fine day when the fog cleared away. We shod a Brigade mule this morning, a wild one & we had to put it in the crush, also 1 pair of shoes (Front) on one of our own mules.\n\nIt is a half holiday this evening, & I stayed in & \ndon\n wrote some letters.\n\nThis morning our blankets were called in & sent away for fumigation, & in the evening we received other blankets in place of them. This caused lots of dissatisfaction as many of the blankets were almost worn out. I was lucky & got a fairly good one.\n\nI went over to a French farm house opposite the blacksmiths shop & handed in a piece of paper on which was written \"Voulez-vous me vendre du lait\" s'il vous plait\" which means \"Will you sell me some milk please\" It worked like a charm & I got the milk at once. half a franc for a \n\nmess tin full. Then we had some for supper.\n","107":" (1133)\n\nA fine day. We were shoeing again this morning and had a big rough hack to shoe which gave us a lot of trouble.\n\nThere is a half holiday this evening and I spent the time reading.\n\nThere is to be a Brigade route march on Tuesday, the Transports accompaning each Battalion.\n","108":" (1134)\n\nA fine day. I was shoeing all day with the two floor men helping me. We shod two draught horses & one mule 1 shoe before dinner. After dinner we put on one set on a hack, 1 par of F. shoe on a hack and 1 hind shoe on a mule. This evening we cleaned & put our equipment together in readiness for the march to morrow but the chances are I will get out of going.\n","109":" (1135)\n\nA beautiful warm day. Before breakfast I took a shoe off a mule & fitted leather under it because it was lame, but it was of little avail for it was not fit to go to the show, which was also held this morning. Punctually at 9. O'clock the Transports started off on the stunt. I was detailed to stay behind & look after the sick horses & mules. I saw Cpt. Chaplain Davidson this morning. He is going away tomorrow morning. I am sending \n\nLast night our iron rations were collected & issued to us for dinner today. We will shortly be reissued with a fresh supply. Only the bully beef was called in.\n\nThere is another revolution in Russia, in fact civil war between two rival sections headed by the Premier on one side & the head of the army on the other.\n\nThe Swedish counsel at Buncos Ayers has imperilled the neutrality of Sweden by sending messages for the Germans there. A huge system of spies have been discovered in Sweden together with their code book & \n\nTwo more of the transports went on Paris 10 days leave this morning.\n\nWednesday Sept 12. 1917. (1136)\n\nFine but cloudy. I was shoeing again this morning, with Ryan helping me. There is the usual half holiday this evening. There is to be a foot ball match this evening. Last evening I received a letter from my cousin Kitty Gilmore in which she stated she had written several times & the letters were all returned. But the number was omitted on the letter \nthe\n I received, & that probably accounts for it.\n\nThursday September 13. 1917. (1137.) \n\nFine but cloudy. I was at a very good concert in the Y.M.C.A. Tent last night given by the officers of the 37. Bat. It was a beaut. The favorite was Cpt. Toule with his witty Irish songs. The \"Three fat Fritzs\" given by the officers a parody on three blind\n\nmice written by Lieut. Mc Nicol was also well received. \n\nWe were shoeing all day & put on 4 sets including 1 draught and a police horse. I received a long letter of July 7 from Tom Douglas today. Also two from my wife dated July 8, No.76 and July 11. No 77, also two from my sister of","110":" &","111":" Five letters in all. This is the best budget of Australian mail that I have received for a long time. No parcels came although they were sent a long time ago, but it is possible they may come later.\n\nThe rival forces in Russia have not yet come into collision. Kerensky becomes commander in chief. General Klembousky who was appointed, but thrown in his lot with Korniloff, who is marching on Petrograd.\n\nI sent a French P.C. to T. Douglas today in acknowledgement of his letter.\n","112":" (1138.)\n\nFine but cloudy. Driver J.R. Mathews came back from the Hospital last night, and helped us with the shoeing today. We put 7 horses and mules through our hands today.\n\nI received a letter from Annie Mc. Nicol today, and a paper \"Weekly Times\" from Cis also.\n","113":" (1139.)\n\nDull & cloudy, look like rain. Shoeing this morning. Only pair and Mathews did it while I set & tempered a curved blade that I had previously made for a bootmakers spokes have also a screw driver for same, & some S links for a Limbre sail board. There is the usual half holiday this evening, & there is a football match on.\n\nA soldier in C. Company was\n\nshot in an orchard a few nights ago while stealing apples by a Frenchman. He received several fillets of shot in the back of one of his legs. He is in hospital. He got a great fright but is not much hurt. There will be an enquiry into it.\n","114":" (1140)\n\nDull & cloudy, but fine. We put on a set of shoes this morning.\n\nSummertime in England ends on Monday at 3. am, when all clocks will be put back one hour to 2. am. This will be Greenwich time. The clocks in France will not be altered until next month.\n\nThe German papers are buzzing with rumours that Britian has offered peace terms. This suggestion is of course devoid of foundation. Probably the intention is twofold; to alarm Russia & to divert the attention of the German people, in other words they are fooling the German public. The promised extra meat ration has not appeared in Berlin & the bread ration is still short. Petrograd seems further off than ever & it is not even certain that Riga is now \"the German city.\"\n\nThe Swedish & Mexican diplomatic exposure are no more cheerful reading to the Germans than the military news. America's strength is at last being recognised. Growing evidence of exhaustion cannot be ignored\n\nToday I received two \"Argus\" of","115":" and 2, &\"Hamilton Spectator\" of June 21. from my sister.\n\nAlthough today is Sunday there was a foot ball match between B Company and the 10 field Ambulance. The honours of victory were with the Field Ambulance.\n\nOn Tuesday 10 men from the Transports are to go to Boulogne with the companies in Motor Lorries, & return the next day.\n\nMonday Sept. 17. 1917. (1141.)\n\nFine but threatening rain. Mathews, Ryan & I put on 13 shoes today.\n\nI made 4 needle boxes for J. Lawless & 1 for my self out of cartridge cases this evening. I unfortunately put one in the fire without noticing that the cap was not exploded. It went off \nand\n the cap blew out and entered the back of my hand. I washed it well in the creek, & went to the A.M.C. to get it dressed, the Doctor was away, & the corporal attended to it. I must have washed the cap out in the creek for the could not find it by probing.\n\nI paraded sick this morning because I had a sore throat & chest, was given medicine & light duties.\n\nReveille will be at 5.45 to morrow morning, breakfast at 6.30, & we are to be ready to parade at 7.15 for the motor journey to Tardinghem. Troops will parade in fatigue dress, blankets & water proof sheet to be rolled & carried on the right shoulder Mess tins with cover, also Haversack & shaving outfit to be carried. Tardinghem is on the sea coast near Boulogne.\n","116":" (1142)\n\nWe were up at the appointed time, had an early breakfast & got away in time. 3 motor lorries took away the H.Q.D. and the companies followed later. We passed through numerous Hamlets & villages on the way. In one village there were large works for making Portland cement, the quarries being on the outskirts of the town Other important villages were\n\nDouver and Marqueis, the last being a little town. We arrived at our destination soon after Eleven being about 3 ½ hours on the journey, and the distance close upon 20 miles. When we got out of the lorries, we formed up & marched to the beach, and eat our dinner. A lot of shipping is passing up & down the channel three war vessels passed along before we were there very long, and numerous others throughout the evening. Soon after 2.p.m. we were alloted to our tents and then had a bathe in the surf, which we thoroughly enjoyed although there was a light drizzling rain which continued all the evening. The beach here is planted with Marram grass and our tents are planted down on the marram grass. This is our first visit to the sea side since we came to France & I enjoyed it immensely.\n\nPeter Silver came back from England & rejoined our Battalion last night, after being away since February. He was a week at Le. Havre before coming here. He is one of the original pioneers of this Battalion, & was our cook at Houplines. After tea we went for a walk along the beach as far as the lighthouse. On the beach there were some french fishermen setting lines for catching fish. The hook is baited with worms and covered with sand. When the tide comes in the sand is washed away & the fish gets the hook. When the tide goes out the fish is removed. At the lighthouse there are a number of guns for protection against aircraft. It is a revolving light, & outside the fence there is a notice \"Denfense de Tarror.\" There are some\n\nold wrecks along the beach, which are dry when the tide goes out. About 2 miles away there is a German submarine which was run ashore in a damaged condition. It is broken in two, & there is a French guard over it.\n","117":" (1143.)\n\nCloudy cold & windy. Revallie at 7. Breakfast 8. Sick parade 9.30 at which I attended because my hand was swollen up & very painful. I got a hot foment on it & another to be put on at 1.30. There is a bathing parade at 10, but I am not going on account of my hand. We are to leave here at 2.p.m. I am staying in the tent this morning. There were numerous search lights last night, some of them at sea & others on the English coast.\n\n"}}