{"Document Name":{"0":"Diary_0361","1":"Diary_0361","2":"Diary_0361","3":"Diary_0361","4":"Diary_0361","5":"Diary_0361","6":"Diary_0361","7":"Diary_0361","8":"Diary_0361","9":"Diary_0361","10":"Diary_0361","11":"Diary_0361","12":"Diary_0361","13":"Diary_0361","14":"Diary_0361","15":"Diary_0361","16":"Diary_0361","17":"Diary_0361","18":"Diary_0361","19":"Diary_0361","20":"Diary_0361","21":"Diary_0361","22":"Diary_0361","23":"Diary_0361","24":"Diary_0361","25":"Diary_0361","26":"Diary_0361","27":"Diary_0361","28":"Diary_0361","29":"Diary_0361","30":"Diary_0361","31":"Diary_0361","32":"Diary_0361","33":"Diary_0361","34":"Diary_0361","35":"Diary_0361","36":"Diary_0361","37":"Diary_0361","38":"Diary_0361","39":"Diary_0361","40":"Diary_0361","41":"Diary_0361","42":"Diary_0361","43":"Diary_0361","44":"Diary_0361","45":"Diary_0361","46":"Diary_0361","47":"Diary_0361","48":"Diary_0361","49":"Diary_0361","50":"Diary_0361","51":"Diary_0361","52":"Diary_0361","53":"Diary_0361","54":"Diary_0361","55":"Diary_0361","56":"Diary_0361","57":"Diary_0361","58":"Diary_0361","59":"Diary_0361","60":"Diary_0361","61":"Diary_0361","62":"Diary_0361","63":"Diary_0361","64":"Diary_0361","65":"Diary_0361","66":"Diary_0361","67":"Diary_0361","68":"Diary_0361","69":"Diary_0361","70":"Diary_0361","71":"Diary_0361","72":"Diary_0361","73":"Diary_0361","74":"Diary_0361","75":"Diary_0361","76":"Diary_0361","77":"Diary_0361","78":"Diary_0361","79":"Diary_0361","80":"Diary_0361","81":"Diary_0361","82":"Diary_0361","83":"Diary_0361","84":"Diary_0361","85":"Diary_0361","86":"Diary_0361","87":"Diary_0361","88":"Diary_0361","89":"Diary_0361","90":"Diary_0361","91":"Diary_0361","92":"Diary_0361","93":"Diary_0361"},"Date":{"0":"unknown","1":993.0,"2":994.0,"3":995.0,"4":996.0,"5":997.0,"6":998.0,"7":999.0,"8":1000.0,"9":1008.0,"10":1009.0,"11":1012.0,"12":1013.0,"13":1014.0,"14":1015.0,"15":1016.0,"16":1020.0,"17":1021.0,"18":1023.0,"19":1024.0,"20":1025.0,"21":1026.0,"22":1036.0,"23":1037.0,"24":1038.0,"25":1044.0,"26":1054.0,"27":1055.0,"28":1056.0,"29":1058.0,"30":1059.0,"31":1060.0,"32":1076.0,"33":1077.0,"34":1078.0,"35":1089.0,"36":1090.0,"37":1091.0,"38":1092.0,"39":1093.0,"40":1105.0,"41":1106.0,"42":1107.0,"43":1111.0,"44":1113.0,"45":1114.0,"46":1115.0,"47":1116.0,"48":1117.0,"49":1118.0,"50":1119.0,"51":1120.0,"52":1121.0,"53":1123.0,"54":1124.0,"55":1128.0,"56":1129.0,"57":1130.0,"58":1138.0,"59":1144.0,"60":1147.0,"61":1148.0,"62":1156.0,"63":1158.0,"64":1159.0,"65":1162.0,"66":1170.0,"67":1178.0,"68":1179.0,"69":1180.0,"70":1181.0,"71":1182.0,"72":1186.0,"73":1187.0,"74":1188.0,"75":1189.0,"76":1195.0,"77":1196.0,"78":1197.0,"79":1203.0,"80":1209.0,"81":1210.0,"82":1211.0,"83":1212.0,"84":1213.0,"85":1214.0,"86":1215.0,"87":1216.0,"88":1217.0,"89":1225.0,"90":1226.0,"91":1227.0,"92":1229.0,"93":1230.0},"Entry":{"0":"\n","1":" :- Took some photos in Port Said & did some business in morning. In the afternoon went over H.M.S. Jupiter & the R.M.S. Morea. I envied the passengers on their way to Australia. Posted old diary per Reg. Post.\n","2":" :- Left Port Said at 7.30 a.m. for Romani. Deposited parcel at the Continental Hotel to be kept till called for. Port Said is not much of a spot, nevertheless the two days I spent there were a very nice break after being in the Desert so long. Left 7 Rolls of films to be developed.\n","3":" The","4":" A.L.H. Brigade moved out of camp at 7 p.m. for Bir-el-ab, 22 miles distant where we arrived at 4 a.m. on the 16th inst. Early on the night of the 16th the Second & Third L.H. Brigades moved out from their camps near Bir-el-ab to a point about 22 miles East. The","5":" Brigade left Bir-el-ab at mid-night on the 16th inst. but being only the supports to the reconnoitering force went only about 14 miles East, where we took up our position & waited in case we should be required.\n\nThe main Turkish position at Bir-el-Mazar was not attacked, but the","6":" &","7":" L.H. Brigades in conjunction with the Camel Corps reconnoitered all the country & gained the information required. They also succeeded in capturing two Turkish outposts (about 30 men). The Turks brought up some artillery & shelled our fellows fairly heavily for awhile, however we had three \nBarr\n Batteries of artillery there & they silenced the enemy. We had very few casualties on the stunt. The","8":" Brigade acted as\n\nrear guard on the return trip & we arrived back in camp at Bir-el-ab about 9 p.m. on the","9":" inst. We left Bir-el-ab at 10 a.m. on the","10":" arriving back at Romani just at dusk.\n","11":" :- Hind, Martin & myself left Romani 7 a.m. for 48 hours leave to Port Said. Had a good trip but was violently sick on the last night there. Was over the Mooltan on","12":" \nCo\n O’Connor & Andy Kerr arrived in P. Said on","13":" Had some good sailing on the Canal. Arrived back Romani on 23-9-’16.\n","14":" The","15":" A.L.H. Brigade left Romani at 5 A.M. en route to Hill 70 where we arrived at 1 P.M. We went via Duiedah, the distance being about 18 miles. I believe we are in for a month’s spell for horses & men, & we should all have at least one weeks spell at Sidi Bishr near Alexandria.\n","16":" :- Thirty One men from “A\" Squadron of our Reg, & including all “A\" Troop left Hill 70 at 9 A.M. for Bally Bunion. We arrived here at 11.30. Bally Bunion is the rail-head from Ballah\n\nwhich is situated on the Suez Canal about 9 miles south of Kantara. Bally Bunion is about 5 miles from the Canal, it is very strongly fortified & inside the barb wire entanglements are sufficient shelter sheds for some thousands of horses. While here we should be most comfortable, quite a treat after Romani & the long stunts we have done from there. However we expect to be here only a few days, a camp is being prepared for us elsewhere. Our duties while here are to patrol out about ten miles East of here.\n","17":" :- Patrolled out to El Eras which is about 10 miles East of Bally Bunion. There is a very fine Hod here in which we had breakfast & many dates, & remained till mid-day. After lunch we patrolled to Hill 300 & then home.\n","18":" : O’Connor, Hind, \nMartin\n & myself went down to Ballah by the light railway & had a couple of hours very fine swimming in the Suez Canal.\n","19":" :- In the afternoon went swimming again in the Canal at Ballah. One Troop from the 2nd Brigade arrived to relieve us.\n","20":" :- The troop left Bally Bunion at 9.30 a.m., crossed the Canal on pontoon bridge at Ballah, & then followed the Canal north & arrived in camp about a mile south of Kantara about 2 p.m. The 1st \n &","21":" \n L.H. Brigade & New Zealanders are all camped here. persistent rumours are in circulation to the effect that we are shortly to go to camp near Cairo for cavalry training with swords & lances. We are camped right on the Canal bank here & should have some very good swimming.\n","22":" :- All men of the Brigade are to receive eight days leave to Alexandria. They have been going in batches & more than half the Regt. have already gone. I hope to be going tomorrow. Have been getting some very good swimming in the Suez Canal.\n","23":" left Kantara in the morning for Sidi Bishr Rest Camp where we arrived about 5 p.m. The camp is very comfortable & is situated close to the sea. Alexandria is about 5 miles distant connected by electric tram service.\n","24":" :- In the afternoon Hind, O’Connor & Self went to Alexandria. Did some business in the afternoon & later on had a very good dinner & evening at the Windsor Hotel.\n","25":" : Arrived back at Kantara after spending a very pleasant week at Alexandria Sidi Bishr.\n","26":" :- The whole of the","27":" A.L.H. Brigade moved out of camp at Kantara, crossed the Suez Canal about 9.30 & arrived at Duiedar just before dark & bivouaced for the night. We moved out of\n\nDuiedar \non the\n next morning camping that night (the night of","28":" at Romani, the following night near Oghratina, & the next night, the","29":" at Gila which is our destination. Rain fell during the night we were camped at Oghratina with the result that we had to sleep for two nights with wet blankets.\n","30":" :- “A\" Squadron & one Troop from “B\" Squadron of the","31":" A.L.H. were today detached from the Regt. “A\" Squadron proceeded to Hod Willegha about 1 ½ miles S.E. of Gila? & the “B\" Squadron Troop to a point about 5 miles East of Hod Willegha.\n\nWe are now doing patrol duties & are getting into close touch with the enemy. Taubes were overhead today & bombed Bir-el-abd, one plane was very nearly brought down by our anti-aircraft guns. The railway line crossing the Desert has been hurried along lately & is now about 15 miles East of Bir-el-abd, \nduplication work is proceeding apace\n and water from the Nile is being brought out \nin\n through two large pipes, one about 8 inches in diameter & the other about 12 inches.\n","32":" :- The brigade left Hod Willegha about mid-day today, the Imperial Camel Corps relieving us. We are moving out beyond the rail head & we shall then be the ","33":"\n nearest troops to the Turkish positions. We are all speculating as to whether we are going to launch a big attack on El Arish or not. We camped at Bir-el-Mosefig tonight about six miles East of Willegha.\n","34":" We left camp at 7 A.M., watered our horses & had lunch at Bir-el-Malha, about 12 miles East South East of Mosefig.\n\nWe were between two & three hours watering all the Brigade so did not get moving again till about 3 p.m. We camped for the night about 5 miles further on, at Bir el Arnussi which is our destination for some days I believe. We are about 5 miles South East of Mazar & 18 miles from the Turkish base at El Arish. The nearest Turkish outpost is only 5 miles beyond here, but it is apparently only occupied at irregular periods.\n","35":" Left Arnussi about 10 a.m. & moved another 2 ½ miles Eastward to New Wells. Our regiment only is camped here\n\nbut the whole of the Brigade is camped at different sites in the vicinity.\n","36":" Taubes have been showing activity of late & been treating us to a number of bombs. The Brigade H D. Qrs was bombed today but so far have not heard whether there were many casualties. While on patrol some days ago we reached to within 8 miles of El Arish & could with glasses distinctly see the mosques & other large buildings of the town. our patrols have on a couple of occasions come into contact with Turkish patrols & we\n\nhave taken an occasional few prisoners. This camp (New Wells) has been renamed Bir el Parramatta.\n","37":" ’16 The 1st Regiment moved \nco\n on today a further 4 miles East, & about 2 miles South East of \nKel\n Kilo 128 on the railway near rail-head. We are now the most advanced outpost on the front. Taubes have been extremely busy of late, paying particular attention to the bombing of Rail-head. We have a large number of ‘planes on the front now including some Martinsides which\n\nhowever are not quite a match \nof\n for the Taubes, \n& we here thus for the first time gained the supremacy of the air\n here. Some days ago one troop from “C\" Squadron penetrated right \nof\n out to the Wadi (watercourse) of El Arish & returned safely, they gained some information & saw a number of Turks in the distance & captured five who were isolated from the main body. our troop patrolled out to within about 7 miles of El Arish a couple of days ago. We could see\n\nthe town in the distance. we bumped a Turkish outpost but retired without engaging them.\n","38":" ’16 news was received yesterday that the Turks were evacuating El Arish. Our Brigade, \nthe 3rd L.H. Brigade, The Australian Camel Corps\n suddenly received orders to move out there & we left camp soon after dark, we entered the Wadi of El Arish just \nat\n before daylight, the Brigade drew a cordon round the town & commenced searching the houses & inhabitants. \nNex\n\nLater in the day, the \n1st\n","39":" L.H. Brigade, a Yeomanry Brigade, a Brigade of New Zealanders, & the Australian Camel Corps arrived here. The beach has been found to be infested with mines & today our Squadron Serg. Major (Geo. Shepheard) & Corp Struthers were blown to pieces by one which had been blown up on the beach.\n","40":" A Cruiser , a couple of Monitors & about 5 mine sweepers have been traveling all day & fished up a number of mines.\n\nWe have taken many Bedouin & camel caravans prisoner during the last couple of days.\n","41":" :- last night about 11 p.m. the whole of the Anzac Mounted Division with the exception of the 2nd Brigade, accompanied by the Australian Camel Corps & two Batteries of English Artillery (18 Pdrs.) & one Battery of Indian Mountain Guns marched out along the Wadi for about 20 miles in s Southerly direction. Travelling was good along the Wadi & we\n\nreached the Turkish Base at Magdaba near the Mogara hills soon after daylight. The whole force formed up in parade ground order about 2 miles from the Turkish position, then suddenly launched the attack. It appeared to be an absolute surprise to the Turks & as we were all mounted men we soon had them almost surrounded except at one point on the high hills in their rear, & the New Zealanders attacking strongly on the Turks right flank drove them in for over a mile into their trenches, thus\n\ncutting them\n completely surrounding the entire enemy force with the exception of two or three hundred which may have escaped before the complete encirclement was effected. Our guns poured over 1,000 shells into the Turks who were entrenched killing over 200 of them outright. We were to have made a general assault on the enemy at 4.30 p.m., but the Turks who had been flying the white flag for some time at one end of their line completely\n\n“threw in the sponge\" at 4.15 p.m. Our attack \nat\n was really a wonderful success as we had only 26 killed & \n40\n 117 wounded in our entire force. This wonderfully small casualty list is accounted for by the fact that there was never any real dismounted assault on the enemy’s positions, the mounted men surrounding the enemy’s positions & the artillery did most of the rest. We took nearly 1500 prisoners, 6 small field guns and eight machine guns, a\n\ncouple of thousand rifles & other booty. Previous to our attack a \nlarge\n number of our ‘planes dropped a large number of big bombs on the enemy’s trenched & redoubts which must have done considerable damage as well as having a great demoralising effect. We hear that a similar & successful raid was carried out by our forces out from Ismailia & not a great distance from the scene of our attack. These last operations mean\ns\n that we shall have very little trouble in regaining\n\nthe whole of the Sinai Peninsula probably without further fighting, however we may possibly attempt an advance into \nSyria\n & we shall then get all the fighting we want. We returned to El Arish on the night of the","42":" our troop was escort to some gun limbers but we got “slewed\" about 3 a.m. when only 2 miles from El Arish so camped till daylight. There are now","43":" a large number of Infantry here which have marched up during the past few days. Had a \n\nvery dull Xmas & Boxing Day here, it has been raining intermittently during the past couple of days making things generally uncomfortable\n","44":" ’16 :- The whole of our Brigade moved out of camp at 8 a.m. on reconnaissance work & marched out practically due East for about 15 miles where we camped near a Hod for the night. (Sheiks Zowaiid)\n","45":" ’16 Part of the Brigade moved again last night a further six miles & entered Rafa unopposed early this morning\n. Rafa is a small port on the frontier between the Sinai Peninsula and \nSyria\n Palestine. The force returned early this\n\nmorning","46":" & the whole Brigade trekked back to El Arish arriving here at 1.30 p.m. The country which we passed through today for the first time, is a decided improvement on that which we have been operating on for the past seven months. We are now getting into country bearing some semblance of fertility. There is much less sand, & travelling is much better for the horses, the ground being of a sandy-clay composition. Today we passed through a considerable area of country cultivated by the Bedouins, & the\n\ncrops, chiefly barley & wheat are now only a few inches above ground. We met a tribe of Bedouins displaying the flag of truce, & marching in to give themselves up to us, as per instructions sent out to the various tribes by the military authorities.\n","47":" ’17 :- Two Taubes bombed the artillery & Infantry camps here today, however they did poor work, killing only 1 engineer & wounding 4 natives, also a couple of horses.\n","48":" ’17. Two taubes bombed the various camps here today, they killed about 25 niggers\n\nworking on the new railway \nwork\n earthworks, but only one soldier, an engineer was killed, also about 20 niggers wounded. Two taubes also made a night raid on the Light Horse Camps here tonight about 8 P.M. The moon was almost full & they could have easily come down to within 300 ft of the ground & inflicted severe casualties upon us, however they did not venture so near the ground & consequently their raid was an utter failure, the 18 bombs dropped fell harmlessly wide of their mark.\n\nA machine gun from each ‘plane was also turned on to us, but they also missed their marks.\n\nJan 8th ‘17th At 4 P.M. today the","49":" and","50":" A.L.H. Brigades, the Camel Corps, one Brigade of New Zealanders, and a Brigade of English Yeomanry, with one \nBatter\n Howitzer Battery, 2 Field Gun Batteries, & one Mountain Battery, together with all transport camels, limbers, & red cross waggons, moved out of El Arish, our objective being, to attack the Turkish entrenched positions at Rafa 28 miles up the coast (about due East)\n\n& on the Sinai Peninsula \nSyria\n Palestine frontier. After a sleepy night march, daylight on the","51":" inst found us once again in fertile country, about 5 miles South of Rafa & two miles from the Turkish entrenchments. our aeroplanes arriving soon after daylight reconnoitred all the surrounding country & soon after their reports being received by the Commanding General we \ncommenced to\n deployed and encircled the Turkish positions which \nwere\n commenced about 1 ½ miles in from the coast.\n\nThis we soon completed, being mounted, the Turks opening shrapnel fire on us when about 2 miles from their positions, their shooting however was bad. When 1500 yds from the enemy fortifications we dismounted & handing our horses over advanced by short stretches over about half a mile of open, level & cultivated country. We were not subject to heavy rifle or machine gun fire until within 800 yards of the enemy. Our own machine guns & artillery very effectively covered our\n\nadvance sweeping the Turkish parap\nh\nets making it very uncomfortable for those who showed their heads above. Our howitzer & field gun batteries kept up a heavy bombardment of the enemy earthworks all day, & did excellent work. \nUnfortunately\n Our heaviest assaults were made between 1.30 p.m. & 4.30 p.m. but up to this time only a small part of the enemy defences had been taken. News had reached us during the afternoon from our patrols that 4,000 Turkish re-inforcements were on their way to the relief of\n\nRafa & were then only 4 miles away & at 5 p.m. it seemed that we would have to withdraw otherwise we should \nrun\n run a big risk of being surrounded ourselves. Just as the orders to retire was being signalled to the various Brigades, (in fact some units had already received the order & were retiring) the New Zealanders by a most gallant attack captured the main Turkish redoubt nearest the sea. This immediately changed the whole position & a general assault from all fronts on to the remaining earthworks was ordered & ended in our taking \nof\n the whole position. It was now getting dark, & so\n\nlarge enemy re-inforcements were not far off we had to hurriedly assemble all the prisoners & get them away as well as the captured guns. Two Regiments of the","52":" L.H. Brigade did not participate in the attack on Rafa, they being sent out some miles Eastward \nto\n on patrol & to guard us against an attack \nin the \/\n on our rear by the Turkish re-inforcements which had been reported by our aeroplanes early in the forenoon to the coming up. They only had slight skirmishing with the Advanced Guard of these troops during the day. It was mid-night\n\nbefore the ambulances had gathered all the wounded from the battlefield and taken them to the clearing station two miles west of Rafa, \nour\n Unfortunately our Troop was detailed off as an \nguar\n escort for these ambulances, we had therefore to spend another night in the saddle & did not arrive with the ambulance waggons at Sheik’s Zowaiid \ntill daylight 12 East of\n 12 miles west of Rafa till daylight. We had thus been one whole day fighting & had spent another afternoon & two full nights in the saddle. We had had\n\nvery little to eat during this time, so we had breakfast at Sheiks Zowaiid, after which we again saddled up & rode in a further 16 miles to El Arish arriving there at 2 p.m. on the","53":" inst. very weary & tired. I had the luck to be one of a party of 24 men under Major Irwin, who early in the fight were detailed off to rush what appeared to be some snipers in dugouts about 60 yards in front of our position, there was no one there as it happened, but 15 yards further on we encountered a small Turkish trench occupied by 25 men. We rushed this\n\n& took them all prisoners including 3 wounded. Only Major Irwin in the party was hit, had the Turks stuck to their post they should easily have killed the lot of us. At one stage of the attack some men of our own regiment who had captured part of a hill & had advanced along its crest came under the fire of our own shrapnel & had to retire some of them unfortunately being killed & others wounded. The artillery had not yet received the order to lengthen the range in time. On the night of the","54":" inst a large number of\n\ntransport limbers with a protecting force of two Squadrons of Light Horse were sent from Sheiks Zowaiid to Rafa to gather up all rifles & booty which had to be left \nthe nig\n when we withdrew from the battlefield earlier in the evening. These men had quite a good “scrap\" in the early morning with enemy cavalry and camelry & succeeded in keeping them off while all the rifles, equipment & other booty were gathered up by the transports. The number of Turkish killed is estimated at 300 and\n\nwe took prisoners numbering nearly 1600 including wounded. Our own casualties amount to something like 450 in killed & wounded. We also captured four guns, a number of machine guns (7) nearly 2000 rifles & much ammunition. Most of the enemy machine gunners were Germans, & they also had a few German Officers with them. There are a large number of Bedouins encamped in the vicinity of Rafa, a number of these are hostile to us, so the precaution\n\nwas taken, previous to the attack of rounding up most of the likely looking fighting men amongst them & these numbered some hundreds. In one of the huts the New Zealanders found some Turks disguised as Bedouins & in possession of a machine gun.\n","55":" ’17 General Chauvel, the Commander of the Anzac Mounted Division addressed the Brigade today & thanked us for the work done at Magdaba & Rafa. Two taubes visited El Arish this afternoon but did not drop any “eggs\".\n","56":" :- the","57":" Regt. moved out of El Arish at * A.M. to do escort \nduty\n & guard duty to a party of engineers camped 8 miles East of El Arish at a place named Bir el Burj.\n","58":" :- When we left El Arish we expected to be away only 48 hours, & consequently we brought only a couple of blankets & no tents or oilsheets. It rained heavily last night & we received a good soaking. It now appears that we are to be out here for a week or ten days, & rumour has it that when we return we are to receive a few days leave.\n\nThe engineers and a party \nof well\n from the Regt. have been sinking wells near the beach for the past three days. They have secured good supplies of fairly fresh water at only a very shallow depth. A Division of mounted men or even more will easily be able to water here. Small bodies of Turks have been coming in from Shelal (15 miles East of Rafa, & 30 odd miles East of here) & giving themselves up to us. Some have been armed & some have discarded their rifles previous to arriving here. We have taken about 30 of them since we came out here from El Arish.\n","59":" :- The Regt. returned from El Burj to El Arish today two regiments of Yeomanry relieving us. There is now a pretty big force of Infantry at El Arish, also more heavy artillery, and we hear that some of the famous Tanks, similar to those used in France are on there way here from Kantara. Our aeroplanes have been giving the Turks particular Hell of late carrying out big bombing raids almost every day & also on suitable moonlight nights. The construction of earth-\n\n-works & other defences is proceeding apace here, it is also evident that they intend to push the railway & two wire-netting roads at least as far as Rafa. Both roads & railway are now completed for a mile East of El Arish & the work is being pushed ahead vigorously.\n","60":" ’17 :- The","61":" A.L.H. Brigade moved out of El Arish at 10 a.m. on","62":" inst. camping that night at Kilo 139 which is about 12 miles West of El Arish, the following night at Mazar which is \na further\n 13 miles West of Kilo 139, on the\n\nnight of \nof\n","63":" inst. we bivouaced at Tilul eight miles West of Mazar & the following night at Bir-el-abd which is sixteen miles West of Tilul. On the way out we dropped a Squadron of the Second Regt. at each of the following places :- Mazar, Gererat and Tilul. The Third Regt. are remaining for the present at Bir-el-abd while our Regt moved out this morning to Bayud, about 10 miles South of Bir-el-abd. This is the place where one day last Summer our Brigade\n\nfought a slight action w\nh\nith a force of Bedouins. We had been two full nights \nb\n riding before we came into contact with the Bedouins, & both horses & men were about “petered out\" & badly in need of water. Eventually the Bedouin broke off the engagement & we returned to Oghratina, a number of men falling off their horses on the return journey through fatigue & lack of water. We are all most disgusted at being sent away back here, it is unlikely that we\n\nshall see any fighting for the next three months, & after the work the","64":" Brigade has done on the Front, it seems most unfair that we should be sent away back here from El Arish just as we were getting off the Desert & on to good country. However we are now due for “leave\" again, so that we shall probably be granted a week in Cairo or Alexandria shortly which will be some recompense to us.\n","65":" :- “A\" Troop left Bayud this morning for\n\nHassaniya, situated about 5 miles North West of Bayud. This is a small camel depot & our work here will be to escort the supplies from Bir-el-abd to the different outposts. The supplies coming from Bir el abd are transferred here from one line of camels to another which distributes them to the various small encampments. “C\" Squadron of this Regt is encamped at Bir el Mageibra which is about 15 miles West of South from Bir el abd\n","66":" – Our troop returned to Bayud this afternoon, being\n\nrelieved by a Troop of “B\" Squadron. We had rather a “cushy\" job \nat\n & were rather disappointed at having to rejoin the Regt. We had a couple of trips on escort to Bir-el-abd during the week & on each occasion stayed the night there. That place, which six months ago was absolute desert is now transformed into quite a busy centre, traffic on the railway especially seems to be particularly heavy. O’Connor & I one day inspected the water scheme there. The storage tanks & pumping\n\nplant etc, are all in duplicate. Each of the two concrete storage tanks has a capacity of 500,000 gallons; \nbi\n two 66 H.P. Hornsby Stationary Oil Engines, & two smaller engines are installed for pumping purposes. Each of the two larger plants \nare\n is capable of pumping 450 gallons per minute. Similar plants are installed at Romani Mazar & El Arish.\n\nMch","67":" Martin & I & a party of men left Bayud this morning \nfor\n on leave to Cairo.\n\nWe have to report to Bayud again on the","68":" inst. Caught train at Bir el abd at 2.20 p.m arriving at Kantara 6.30 p.m.. As I wished to do some private business at Port Said, I parted from the others at Kantara & caught the 10.10 p.m. train there, arriving at port Said about mid-night.\n\nMch","69":" After satisfactorily concluding business caught the 12 o’clock (mid-day) train to Cairo, where I arrived at about 5.15 p.m. Went straight to the National Hotel & found most of the lads there.\n\nBooked a room for a couple of nights. Went to Kursaal.\n\nMch","70":" Have had an excellent two & a half days here. Have not been doing much sight seeing this trip being rather busy shopping etc. yesterday afternoon we took the tram to Abbassia, intending to go to the Camel Corps camp & look up “Cec\" Jones, we however omitted to leave the tram at the correct spot & consequently missed seeing him. This morning we walked for sometime through the native bazaars,\n\n& also went through one of the silk weaving mills, all the work in this mill was being done with old hand spinning wheels. At one of the native bazaars they tried very hard to persuade us to buy a lot of Amber cigarettes (10’- for box of 50), & showed us numerous letters of recommendation from people of note, including one from Mrs Asquith, wife of the recent British premier. We have much appreciated the good meals, hot baths etc of the past couple of days, truly great luxuries\n\nto us these \ndays\n times. Posted today to Father, Dardanelles Book & a map of the Sinai peninsula operations enclosed. Caught the 6.5 p.m. train to Kantara where we slept the night. Left Kantara at 6 o’clock on the morning of the","71":" arriving at Bir-el-abd about 11 a.m. & at Bayud at 4 p.m.\n\nMch","72":" :- Left Bayud this afternoon for Gila where we arrived about 4 p.m, the other two Squadrons of the Regt having previously moved over there. We hear that we are, in the course of a few days to move out again\n\nto El Arish & perhaps beyond. All the mounted troops are to be sent \nindecipherable\n off the desert & all the Camelry will be kept here to do the Desert patrolling etc. We are all looking forward to the campaign in Palestine & shall be glad to once again get into fertile & interesting country. \nSome of our mounted men have already penetrated to within 15 miles of Jerusalem.\n The Turks have lately been getting a bad time on all fronts & during last week the British had a great victory in the capture of Kut-el-Amara & Bagdad.\n\nMch","73":" The","74":" and","75":" Regts moved out of Gila and Bir-el-abd respectively today for Tilul where we bivouacked. On the night of the","76":" we camped at Mazar & on the following night at Kilo 139. We arrived at El Arish on","77":" \nat\n shortly before mid-day. One Squadron of the","78":" Regt remained at Mazar & the other two Squadrons of that Regt are camped separately from the brigade. great advance just taken place in France on a 45 mile front by 10 miles deep. Bapaume & Peronne captured. Revolution in Russia.\n\nMch","79":" :- This morning our troops commenced an attack upon the Turkish positions at Gaza, 15 miles across the Sinai Peninsula – Palestine frontier. Yesterday three Divisions of Infantry, the 52nd (Scottish), the 53rd (Welsh) & the 54th Division, with a large number of guns, \n& a\n also ","80":" B\n the","81":" and","82":" A.L.H. Brigade, a Brigade of New Zealanders & two Brigades of Yeomanry moved out \nto\n of Rafa. Monitors also supported our troops, & though we are 45 miles, as the crow flies, from\n\nthe scene of action\ns\n, the bombardment can distinctly be heard here, in fact troops 23 miles further down the line at Mazar reported hearing the guns.\n","83":" 1st5 :- During the past few days a large number of wounded have arrived at the hospitals at El Arish & many more have gone through by rail. our troops entered Gaza two or three days ago but were driven out by Turkish counter attack. \nIt is\n The enemy’s casualties are reported as being 7000 in killed & wounded, & our captives include 900 prisoners & two 4.2 inch Austrian Howitzer guns. Our own casualties have\n\napparently been heavy though no official list has yet been \nmade\n published. Included amongst the prisoners taken are a number of Austrian Officers & N.C.O’s.\n","84":" ’17 :- Our Brigade held a race meeting today in the Wadi el Arish. I was unable to see them myself being on guard duty, however I believe they were successful & very good fun.\n","85":" :- \nTo-da\n Today our Brigade moved out of El Arish on trek to the Front, though we have been getting goo swimming in the sea, at\n\nEl Arish & also having a pretty easy time, all hands are very pleased at the prospect ahead & are anxious to get into Palestine & on good country. We camped the night at Sheiks Zowaiid about 16 miles East of Kilo 152 our starting point, (about 1 ½ miles West of El Arish).\n","86":" The Brigade left Sheiks Zowaiid at 8.30 A.M. & camped at Rafa on the Sinai – Palestine \nfor lunch\n frontier for lunch, & near where the Rafa engagement was fought on","87":" last. We passed through miles of beautiful level & fertile country today all\n\nwell grassed & looking wonderfully green. The grasses growing round Rafa are chiefly rye grass & Crow-foot, \ntwo very excellent\n both of which are well known in Australia & excellent feeds for all classes of stock. After leaving Rafa we pushed on a further seven or eight miles to Khan Yunis, & camped near the village for the night, & we shall probably be a \nweek or so\n few days here. Khan Yunis is situated about 8 miles across the Sinai Peninsula – Palestine frontier, about 2 miles from\n\nthe Mediterranean coast. The town is \nsit\n in a beautiful valley & such fruit as oranges, almonds, peaches etc are grown extensively. The population of Khan Yunis in normal times is something like 7000.\n","88":" :- Our front lines are about 8 miles East of here (Khan Yunis) & today a party of us was sent out near there to Divisional Hd Qrs. for some pack horses. We have a big army here now & I am expecting big things to happen very shortly. Today I saw something like 30,000 horses in the various camps, some thousands\n\nof camels, all kinds of motor transports & some of the famous “tanks\" which have made such a name for themselves in France. We now have a great number of guns on this front, both large & small howitzers & field guns. We now have an army of something like 100,000 men here in Palestine composed of three divisions of British & Scottish infantry, four Brigades of Australian Light Horse, one Brigade of New Zealand Mounted Rifles, two Brigades of English Yeomanry, & a great deal of Artillery.\n\nBesides the thousands of men which compose the various A.S.C.’s, A.M.C.’s etc a number of black troops are employed here chiefly in pioneer and transport work. These include Indian Sikhs, British West Indians, & the Arab labour corps employed on road & railway construction. Enemy aeroplanes have been accomplishing much reconnaissance work over our encampments during the past day or so but have not bombed at all. The rail-head is now about six miles East of Khan Yunis, \n\na branch line runs to the coast, & three fair size merchant ships yesterday discharged cargoes of shells & other material on the beach. We are expecting to be moved up nearer to the front line any day now, & shall probably be doing outpost duty until the next big “scrap\".\n","89":" :- last night at about 8 P.M. the Brigade moved out of camp & after a sleepy nights march arrived near Shellal. This is a very strongly entrenched position & only recently evacuated by the Turks. We found a big\n\nsupply of water in the Wadi & while watering our horses were bombed by Taubes, luckily there were not many casualties. A big force of Turkish cavalry estimated at 6000 men are operating on the plains here guarding the Turkish flank, we have not yet come into touch with them but have to be always on the alert. Tonight we do outpost duty in the Shellal trenches.\n","90":" :- Last night the whole of the Anzac Mounted Division & part of the","91":" Mtd Division with 8 Batteries of 18 Pdr. Guns moved out from the vicinity of Shellal up the Wadi to a place\n\nnamed Erk on the Turkish left flank. The whole of the mounted troops & artillery shortly after daybreak attacked the Turkish flank, the engagement lasted all day & at times was pretty severe. The Third Brigade had a fairly large number of casualties & \na\n two companies of the Camel Corps were badly cut up. \nour casualties however on the whole were light.\n We captured a number of Turkish positions & our artillery must have inflicted severe losses on the enemy, it completely outclassing the enemy batteries.\n\nTowards dusk we came into touch with Turkish cavalry but they did not appear to care to engage us at close quarters, two of our batteries opened fire on them as they retired just at dusk. Out attack on the flank was merely a demonstration in force to assist the British Infantry which all day have been attacking the strong Turkish fortifications around Gaza. We hear that the Infantry were successful in taking some of the main defences around Gaza & in making an appreciable advance.\n\nUnder cover of darkness all the mounted troops & artillery retired to Tel el Gemme where we arrived just after mid-night & camped till morning. Our casualties (the mounted troops operating on the flank) for the day would amount to something like 450 in killed & wounded, but our attack was considered quite successful in its object of helping in the main attack at Gaza.\n","92":" :- Our Brigade was on outpost duty last night. Today we had a few slight skirmishes with Turkish cavalry, \nbut\n we spent hours trying\n\nto lure some of them into a trap we had prepared for them but without success, they proving too wily. We were relieved from outpost about 4 P.M. by a Yeomanry Brigade & we then rode into near Khan Yunis where we arrived at 11 P.M. & camped till morning.\n","93":" :- This afternoon the Brigade trekked back again to the front cavalry outpost line where we expect to be camped for awhile at least. We have been bombed frequently of late, in one raid three Taubes accounted for 70 odd horses & seven men killed & wounded in our Brigade alone. The Germans have lately brought a number of new fast ‘planes to this Front, we have however accounted for seven of them during the past couple of weeks, & \n\nthey have also brought down an approximate number of ours. There is now a lull in operations on this Front, though heavy artillery fire usually breaks out at night. I think we are waiting for fresh Infantry Divisions to arrive. The Turkish fortifications around the hills near Gaza are apparently of great strength & will take a great deal of winning. We certainly have great superiority in artillery here, & warships lying off the coast assist in the bombardments. We have great stacks of gas shells \nhere\n, & lately we have all been given gas helmets, so possibly we shall employ gas to eject the enemy if it cannot be done otherwise. They\n\nare most unpleasant things to have to wear. On the plains here are a number of \nwell\n splendidly built Roman wells or cisterns capable of holding something like 15,000 galls. of water each. They were built 1200 years ago.\n\n"}}