{"Document Name":{"0":"Diary_0420","1":"Diary_0420","2":"Diary_0420","3":"Diary_0420","4":"Diary_0420","5":"Diary_0420","6":"Diary_0420","7":"Diary_0420","8":"Diary_0420","9":"Diary_0420","10":"Diary_0420","11":"Diary_0420","12":"Diary_0420","13":"Diary_0420","14":"Diary_0420","15":"Diary_0420","16":"Diary_0420","17":"Diary_0420","18":"Diary_0420","19":"Diary_0420","20":"Diary_0420","21":"Diary_0420","22":"Diary_0420","23":"Diary_0420","24":"Diary_0420","25":"Diary_0420","26":"Diary_0420","27":"Diary_0420","28":"Diary_0420","29":"Diary_0420","30":"Diary_0420","31":"Diary_0420","32":"Diary_0420","33":"Diary_0420","34":"Diary_0420","35":"Diary_0420","36":"Diary_0420","37":"Diary_0420","38":"Diary_0420","39":"Diary_0420","40":"Diary_0420","41":"Diary_0420","42":"Diary_0420","43":"Diary_0420","44":"Diary_0420","45":"Diary_0420","46":"Diary_0420","47":"Diary_0420","48":"Diary_0420","49":"Diary_0420","50":"Diary_0420","51":"Diary_0420","52":"Diary_0420","53":"Diary_0420","54":"Diary_0420","55":"Diary_0420","56":"Diary_0420","57":"Diary_0420","58":"Diary_0420","59":"Diary_0420","60":"Diary_0420","61":"Diary_0420","62":"Diary_0420","63":"Diary_0420","64":"Diary_0420","65":"Diary_0420","66":"Diary_0420","67":"Diary_0420","68":"Diary_0420","69":"Diary_0420","70":"Diary_0420","71":"Diary_0420","72":"Diary_0420","73":"Diary_0420","74":"Diary_0420","75":"Diary_0420","76":"Diary_0420","77":"Diary_0420","78":"Diary_0420","79":"Diary_0420","80":"Diary_0420","81":"Diary_0420","82":"Diary_0420","83":"Diary_0420","84":"Diary_0420","85":"Diary_0420","86":"Diary_0420","87":"Diary_0420","88":"Diary_0420","89":"Diary_0420","90":"Diary_0420","91":"Diary_0420","92":"Diary_0420","93":"Diary_0420","94":"Diary_0420","95":"Diary_0420","96":"Diary_0420","97":"Diary_0420","98":"Diary_0420","99":"Diary_0420","100":"Diary_0420","101":"Diary_0420","102":"Diary_0420","103":"Diary_0420","104":"Diary_0420","105":"Diary_0420","106":"Diary_0420","107":"Diary_0420","108":"Diary_0420","109":"Diary_0420","110":"Diary_0420","111":"Diary_0420","112":"Diary_0420","113":"Diary_0420","114":"Diary_0420","115":"Diary_0420","116":"Diary_0420","117":"Diary_0420","118":"Diary_0420","119":"Diary_0420","120":"Diary_0420","121":"Diary_0420","122":"Diary_0420","123":"Diary_0420","124":"Diary_0420","125":"Diary_0420","126":"Diary_0420","127":"Diary_0420","128":"Diary_0420","129":"Diary_0420","130":"Diary_0420","131":"Diary_0420","132":"Diary_0420","133":"Diary_0420","134":"Diary_0420","135":"Diary_0420","136":"Diary_0420","137":"Diary_0420","138":"Diary_0420","139":"Diary_0420","140":"Diary_0420","141":"Diary_0420","142":"Diary_0420","143":"Diary_0420","144":"Diary_0420","145":"Diary_0420","146":"Diary_0420","147":"Diary_0420","148":"Diary_0420","149":"Diary_0420","150":"Diary_0420","151":"Diary_0420","152":"Diary_0420","153":"Diary_0420","154":"Diary_0420","155":"Diary_0420","156":"Diary_0420","157":"Diary_0420","158":"Diary_0420","159":"Diary_0420","160":"Diary_0420","161":"Diary_0420","162":"Diary_0420","163":"Diary_0420","164":"Diary_0420","165":"Diary_0420","166":"Diary_0420","167":"Diary_0420","168":"Diary_0420","169":"Diary_0420","170":"Diary_0420"},"Date":{"0":"unknown","1":372.0,"2":373.0,"3":374.0,"4":375.0,"5":376.0,"6":377.0,"7":378.0,"8":379.0,"9":380.0,"10":381.0,"11":382.0,"12":383.0,"13":384.0,"14":385.0,"15":386.0,"16":387.0,"17":388.0,"18":389.0,"19":390.0,"20":391.0,"21":392.0,"22":393.0,"23":394.0,"24":395.0,"25":396.0,"26":397.0,"27":398.0,"28":399.0,"29":400.0,"30":401.0,"31":402.0,"32":403.0,"33":404.0,"34":405.0,"35":406.0,"36":407.0,"37":408.0,"38":409.0,"39":410.0,"40":411.0,"41":412.0,"42":413.0,"43":414.0,"44":415.0,"45":416.0,"46":417.0,"47":418.0,"48":419.0,"49":420.0,"50":421.0,"51":422.0,"52":423.0,"53":424.0,"54":425.0,"55":426.0,"56":427.0,"57":428.0,"58":429.0,"59":430.0,"60":434.0,"61":435.0,"62":436.0,"63":437.0,"64":438.0,"65":439.0,"66":440.0,"67":441.0,"68":442.0,"69":443.0,"70":444.0,"71":445.0,"72":446.0,"73":447.0,"74":448.0,"75":449.0,"76":450.0,"77":452.0,"78":453.0,"79":454.0,"80":455.0,"81":456.0,"82":459.0,"83":460.0,"84":461.0,"85":462.0,"86":463.0,"87":464.0,"88":465.0,"89":466.0,"90":467.0,"91":468.0,"92":469.0,"93":470.0,"94":471.0,"95":472.0,"96":473.0,"97":474.0,"98":475.0,"99":476.0,"100":477.0,"101":478.0,"102":479.0,"103":480.0,"104":481.0,"105":482.0,"106":483.0,"107":484.0,"108":485.0,"109":486.0,"110":487.0,"111":488.0,"112":489.0,"113":490.0,"114":491.0,"115":492.0,"116":493.0,"117":494.0,"118":496.0,"119":497.0,"120":498.0,"121":499.0,"122":500.0,"123":501.0,"124":502.0,"125":503.0,"126":504.0,"127":505.0,"128":506.0,"129":507.0,"130":508.0,"131":509.0,"132":510.0,"133":511.0,"134":512.0,"135":513.0,"136":514.0,"137":515.0,"138":516.0,"139":517.0,"140":518.0,"141":520.0,"142":526.0,"143":527.0,"144":532.0,"145":533.0,"146":595.0,"147":596.0,"148":597.0,"149":701.0,"150":708.0,"151":721.0,"152":722.0,"153":723.0,"154":724.0,"155":725.0,"156":726.0,"157":736.0,"158":737.0,"159":772.0,"160":773.0,"161":813.0,"162":831.0,"163":832.0,"164":833.0,"165":834.0,"166":835.0,"167":837.0,"168":838.0,"169":839.0,"170":840.0},"Entry":{"0":"\n\n","1":"\n\nEnter 1915! But without that host of \"good resolutions\" with which one is accustomed to welcome the New Year. There is absolutely no time for that sort of thing on a troopship.\n\nAt Muster Parade to-day, a death on the troopship \"Borda\" was announced; and, at 11.5 a.m., when the body was committed to the deep, the troops on the whole of the fleet, were called to attention for a minute or two, the fleet slowing down for 15 minutes. The first death occurring on the first day of the year, was looked on by many superstitious people as an ill-omen. However, the holiday, which was given to the troops, was fully enjoyed. Two cricket matches were played – the","2":" Battalion v. the 14th, the officers playing one match, the men the other. Enthusiasm ran high, as it practically amounted to a match between the rival states, Victoria and N.S.W. Myself being a N.S. Welshman, the latter won, of course!\n\nSaturday 2 January 1915\n\nTo-day I had to submit to what in my ordinary life, I would have considered a very serious social stigma in the shape of having my wearing apparel sterilised and fumigated. But in the military, that is all in the day’s work; and although you may personally take offence, you say nothing because you are only aware that it is done, in the long run, for your own comfort and your own advantage.\n\nThis evening something very serious occurred. The men were served with a ration of what was apparently bad tripe. Soon after tea, several were badly affected with ptomaine poisoning, and it was not long before the hospital was full of prostrated patients. The medical officers seemed to take it all very lightly; and had they continued to treat the sufferers in the callous manner which they began, the men might have made it very unpleasant for them.\n","3":"\n\nNine o’clock this morning saw the recovery of most of last night’s poor unfortunate, although there was far from being a full muster at Church parade. The aforementioned little Presbyterian parson again stuck his chest out, put his ears back, and laid down the law about the excessive use of what he called the \"Australian adjective\". He pointed out that, if we did not cut it out before we reached England, we should all be ostracised from polite Society. Then his week’s work which, by the way, cost the Commonwealth Government exactly £7-17-6, finished. I can’t help again remarking that this sort of sinacure job should be promptly abolished.\n\nTo-day, canvas awnings we put up over the decks, and the first touches of the tropical heat made themselves felt. The troop decks were stifling; and the Lord only knows what it will be like in a few days from now.\n","4":"\n\nA very monotonous, uneventful day – very hot and very ennervating. We are just beginning to realise how dull the life on a troopship really is. Each day, when you wake, you see the same ship, in precisely the same position and at exactly the same distance from \"A38\". The \"Ceramic\" (A40) is on our left, and the \"Themistocles\" (A32) is on our right. These two, together with our own ship, are the leaders of their respective columns, three in all.\n\nThen there is the same wonderfully calm, deep-blue sea, that, when you go on deck in the morning, you wonder if you have really moved during the night.\n\nThere are wild rumours going round the ship to-night that we will go in close to Cocos Island and that we may see the \"Emden\". The scenes of enthusiasm, if it comes off, (I do not think for one moment that it will) may well be imagined. But I have learnt never to heed the rumours you hear on board ship.\n","5":"\n\nTo-day, for the second time on board ship, I was a member of the Guard. And now, we are beginning to realise that this is a serious business we have undertaken; the picnic is slowly being transformed into an active service campaign.\n\nEverything is worked now on a most cautious basis. To-day, the fleet slowed down, then stopped, while the submarine, AE2, went on, full speed ahead; result – wild rumours of German cruiser having been sighted. Besides the AE2, nothing is seen of our other escorts, although their searchlights are occasionally seen at night. For the last few nights we have been steaming with \"lights out\" after 8.30 p.m. And all lights which are not put out, are masked by having the portholes blocked. Last night, on guard, the only white lights visible was a single light on each successive masthead, and together with the red and green lights, it gave a most impressive, wierd, mysterious effect.\n","6":"\n\nTo-day was a fair \"scorcher\" and a spirit of listlessness pervaded the whole ship. Hardly a breath of air, and the night seemed hotter than the day. The muggy, tropical heat is taking all the energy and vigour out of the troops; it is also causing everyone to be snappy, irritable and bad-tempered. In a word everyone is getting on everybody else’s nerves, as is want to happen when a great number of men are living under confinement and under the most trying conditions.\n\nTo-day I had a good conversation in French with a most remarkable linguist. He speaks eight languages, including Hebrew and Arabic. His French, as far as I can judge, is spoken with an excellent, cultured and refined Parisian accent. So you may be quite sure that I intend to see a good deal of this individual during my trip.\n\nTo-night, a mere sprinkling of rain has made this stifling night absolutely unbearable – \"hell with the lid on\" as one fellow said.\n","7":"\n\nThe hot spell was broken to-day, by a good shower of rain. In many respects, it was the most remarkable rain that I have ever seen. At ten minutes past one, in the afternoon, we gradually lost sight of all the other troopships, as each, in turn, was obscured by a blinding sheet of rain. Then it gradually closed in on us, so that it was raining all round the ship at a distance of about two hundred yards from her. As yet, not a drop had fallen on the decks of the \"Ulysses\", and it was quite ten minutes before we got the tail end of the shower. It cleared the atmosphere considerably and it is now much cooler.\n\nFor the first time since I have been on board, I slept on deck last night. The troop decks, of course, are what are ordinarily \"platforms\" or divisions of the hold. Besides being badly ventilated, the odour is by no means similar to \"4711\", as we also have our meals there. So in the very hot weather, I draw the line at sleeping there.\n","8":"\n\nA beautiful clear day, fresh and cool, was the result of yesterday’s rain. At half past three in the afternoon, we were treated to an extremely novel spectacle. Suddenly \"Stop\" was telegraphed from the bridge and at the same time the signal was given to the rest of the fleet to do likewise. The \"Ceramic\" coming quite close to us, lowered a boat, and, with two naval and one military officer in her, it reached our side in a few minutes. There was an exchange of despatches etc., and the boat returned. Meanwhile, the ships had closed up considerably and the men cheered each other vociferously; and the sight of seventeen troopships lying idly in mid-ocean was very novel; and the enthusiasm of the men proved that they fully recognised that they have a common aim – the upholding of the Empire’s and, most particularly, Australia’s honour in whatever place they may be brought into action.\n","9":"\n\nBeing hopelessly \"broke\" (we have not been paid for nearly three weeks), I have not the wherewithal to pay for my washing. So to-day the Chocolate Soldier was transformed into the real active service soldier – the man who is washer-lady as well as fighter. It is the first (and I trust, the last) time I shall have to perform the task. Not that it was particularly arduous or strenuous work, but the results were so pathetically unsatisfactory, for the clothes were dirtier at the finish of the proceedings than they were when I started.\n\nMy company had the great pleasure of being vaccinated to-day. But I happened to be one of the fortunate, much-envied ones whom the medical officer passed, thanks to my being done during the smallpox scare in Sydney in 1913. It is really surprising to perceive the mens’ fears of and doubts about the beneficial advantages of vaccination, owing no doubt, to the wild rumours that characterised the Sydney scare being repeated.\n","10":"\n\nHygenic ideas are gradually being instilled into the mens’ minds. The officers have, for some time, been reminding the men of the necessity of keeping themselves clean so that when the time comes, they will be able to act as efficient soldiers, filth and disease being at a minimum. To-day, the labours of the officers bore fruit; for some of the men, acting on their own initiative, proceeded to forcibly cut the hair of those men who, they considered, wore their hair at a length which was not conducive to hygenic and sanitary conditions of living. Some of the scenes were extremely amusing, and, for the most part, the victims took their hairdressing in good spirit. The foppish man-about-town style is as much out of place on a troopship, as a Methodist parson is at a Tango Tea.\n\nDrew up a programme for my French lessons to-day, and started a regular two and a half hours course to-day. Will I keep going …??\n","11":"\n\nCrossed the line at 1.40 early this morning; so there was practically no undue excitement with the one exception of a little horseplay in the sergeants’ mess, as was plainly seen by the dilapidated appearance of those worthies at the early parade. Boot polish stains are likely to remain on some \"dials\" for quite a time to come as a result of the evening’s frivolity.\n\nTo-day, in the presence of the Brigadier and our own Colonel, an inter-company tug-of-war was held. Enthusiasm ran high and the betting was very brisk, each man wanting to lay his \"screw\", or, at any rate, the greater part of it, on the team representing his own company. After several closely contested \"pulls\", \"G\" company won the right to contest the \"South of the Murray\" team; this is set down for to-morrow. It is remarkable how these tests of strength create a friendly feeling of rivalry between each company of a regiment, Sport, pure and as opposed to base professionalism.\n","12":"\n\nAt 8.30 a.m. this morning, three of our fleet, the \"Ceramic\", \"Persic\" and \"Seuvic\", (all White Star liners) left their places in their respective lines and made off in a south-westerly direction, bound for Aden.\n\nThe rest of the fleet is due to arrive at Colombo to-morrow morning. In all probability, I shall see practically nothing of the town, as we will not go ashore. As far as I can judge, our stay in port will not be a long one – perhaps only 36 hours.\n\nThe inter-state tug of war, N.S.W. v Vic., the","13":" Battalion v the 14th, came off this afternoon. There was only one pull, and after about five minutes, the 13th team was seen to have a slight advantage, the superiority of the \"north of the Murray\" men causing general satisfaction among the 13th. Our 13th officers then \"pulled\" the officers of the 14th, the \"Ma\" State once again asserting its superiority over Victoria. And, although there is ample scope for interstate rivalry on board, any feeling of jealousy is, happily, absent.\n\nWednesday 13 January 1915\n\nA cloud or land? Sceptics expressed their cynical doubts, but after some time, we sighted land for the first time in the Northern hemisephere, the island of Ceylon. Slowly the \"Ulysses\" led the convoy into Colombo harbour, and, in about three hours the whole fleet was anchored safely behind the breakwaters. Two things immediately impressed me about Colombo harbour. One was the cosmopolitan nature of the scene – a P. & O. mail boat, a Japanese tramp, and a Norweigan schooner all in close proximity to each other. The second was the oriental appearance of the landscape. This strongly appealed to me as an Australian who has not travelled. The palms replaced the immortal gum, domes replacing church steeples. After the Port Health Officer had come on board (we all flew the yellow flag on account of the measles), we began to receive visits from the coolies who proved to be a continuous source of amusement throughout the day. Only a few of the very fortunate got ashore, the rest having to be content to see Colombo from the ship.\n","14":"\n\nAwoke this morning to gaze on a scene of tremendous activity – coolies on their ponderous harbour craft howling and gesticulating, officials’ swift steam launches darting here and there and finally, the brilliant Australian, the Australian who, on active service, is refused leave and promptly proceedes to take it. From an early hour, when they knew for certain that there would be no chance of getting ashore by legitimate means, the \"lads in kakhi\" poured over the sides of the ships in one continuous stream, until many hundreds were on shore, all without leave. This is bound to be treated as a serious breach of discipline.\n\nColombo, to-night, looked extremely fascinating and inviting and I only wished I was staying at this place, instead of proceeding to Aden. Anchor was weighed at 7.30 p.m. and, although the points of light dotted here and there was a point of similarity to Sydney Harbour by night, one could not help noticing the artificiality of this harbour when compared with Port Jackson. At 9.30, we anchored a few miles out.\n","15":"\n\nEarly this morning the fleet took up its usual sailing position. But on account of yesterday’s ship-breakers, we did not commence the next stage of our journey until well after 9 a.m. The \"Ulysses\" had delayed its departure from the harbour for the special purpose of taking on board all those worthies who had seen fit to go on shore without leave. After being rounded up, they were all taken on board the flag-ship, where they spent a very pleasant evening in the lavatories! Early in the morning they were sorted out, and proceeded by tender to their respective ships. Included among this \"rowdy mob\", is the \"scum of the earth\", men who, in ordinary civilian life, are of the hang-about-the-pub-corner-and-wait-for-a-shout type. Just as the speed of the army is regulated by the speed of the slowest man in it, so is the general character of a body of uniformed men judged by the standard which is set up by these Wooloomooloo gentlemen. The whole trouble is that there is a certain class which has no conception of what I may call enjoyment with moderation.\n","16":"\n\nQuite an ordinary, uneventful day with the single exception of one of those wild rumours of German warships being in close vicinity. At any rate, our course from Colombo to Aden was suddenly changed to almost due north so that, for about 12 hours, we were steaming up the west coast of India. Far in the distance, about forty miles away, the faint outline of what were apparently islands of the Lakadive, could be seen. But after 3 p.m., we again changed course, and the fleet is now steaming due west.\n\nReceived my Sydney papers to-day, and I cannot describe the pleasure with which I began to read them, from cover to cover. As might be expected, war items formed the most part of the reading matter; but that portion which interested me most, was the local news which brought me back into touch with dear old Sydney, and all its associations which are so dear to a Sydneyite. I say a great deal when I declare that I appreciated my papers as much as my letters.\n","17":"\n\nThe usual old Sunday to-day. Church parade as usual, and, for the rest of the day, sleep, more sleep, and then a little more sleep. One of those days when you get quite an unaccountable and inexplicable fit of laziness and slackness over you. You are conscious of a desire to do something, then, just as you are on the point of getting up to do it – well you don’t. You feel inclined for a game of deck quoits, you have made up a game – but ,just as you rise to start, someone says \"Oh hang it all, I can’t be bothered!\" Everybody heaves a grateful sigh of relief. In the same instant, a game of auction bridge is suggested. Everybody is agreeable, but when it comes to the question of going below for the cards and scorers – \"nothing doing\". This strange phenomena is, to me, inexplicable. We are conscious of the apparent laziness, and there is a weak incentive to combat it. But our vital enegy is too slow – it cannot carry out that desire to act, to do something. This tendency is very pronounced on board. The heavy sea air is the explanation, I suppose.\n","18":"\n\nAs I have remarked before, the best way of getting a soldier to do as he is told, is to appeal to his stomach. But this is \nnot\n done. Again, to-day, a meal was served, and its fitness for human consumption was very doubtful indeed. At any rate, everyone \"turned down\" their food, and the officers and the chief steward were subjected, in not a mild or complimentary manner, to the scathing criticisms of the occupants of the troop decks.\n\nAs far as I can make out, the whole trouble is this. The chief steward, a pig of a man, most unpopular and deservedly so, wants to make his fortune and retire after this trip. The Commonwealth Government’s allowance to the Shipping Company with which to feed the men, is, I am informed, 1\/4 per day per man. A bigger allowance of course for officers’ and sergeants’ messes. Now, for the class of food we are getting, -\/6 per day per man is probably an excessively high estimate. The chief steward could, if pressed, probably throw a little light on the matter. But how the other -\/10 is spent, God alone knows – and, luckily for the chief steward – He won’t tell us!\n","19":"\n\nIn spite of the inconveniences and unnecessary discomforts to which we are subjected on board, a feeling of good fellowship with the vessel which is your home for a month or so, seems to be present within you. You no longer look on the steamer as so much steel and wood, all fitted together to form what we call a \"liner\". It gradually acquires a personality. Your whole interests, for the present, at any rate, are wrapped up in, and indeed are part and parcel of, the interests of the boat. And after a time on board ship, there comes a time when you recognise this salient fact.\n\nAn almost exactly similar parallel is the case of the infantry soldier, and that powerful accurate weapon with which he is armed – the modern rifle. After a time, there comes the day when he no longer looks on the daily cleaning of his rifle as a bore but as a natural duty to a friend, an almost live thing, a personality. It is no longer so much steel and wood – the trained soldier knows that some day or other, his own life is going to depend on it and treats it accordingly.\n","20":"\n\nYet another death occured to-day, making to date for the whole convoy six. Out of these, one was the boatswain of the \"Themistocles\", and of the remaining five, three occurred on the same ship, with one each from the \"Vestalia\" and the \"Borda\". The burial to-day was very impressive. At a quarter to three, \"parade\" was sounded, and at 3 p.m. the fleet stopped and the men were called to attention. The body being committed to the deep, the buglers then sounded the \"Last Post\". The call, which was excellently played, rang out clearly across the waves. The convoy then proceeded on its way.\n\nThe mail, to be sent from Aden, closed to-night at 6 p.m. I sent away a great number of postcards, not that I could give anybody much news, but a card marked \"On active service – passed by Censor\", will I suppose, be somewhat of a novelty in Australia, at least for a little while. Even if I do not get large mails while I am away, I shall deserve them judging by the size of my outwards mail.\n","21":"\n\nNo rumour, but a reality to-day! We have become sceptical as regards the sighting of strange or unknown men-of-war. But to-day, at 12.20 p.m. one was actually sighted, away to starboard. From the flagship, signal after signal was sent, but no reply. By 2.10 p.m., excitement ran high. Every starboard deck presented a compact front of faces, field-glasses and telescopes, and naval officers wore a worried look. The \"Berrima\", on ahead with the \"AE2\", was ordered to starboard, for, although the stranger was flying the White Ensign, none of our signals had been acknowledged. We then signalled to the \"Berrima\", \"Let submarine know warship not disclosed identity, prepare\". But the submarine, anticipating the order by a few minutes, had already disengaged, and dismantled its wireless, preparatory to \"going below\". At length, only after our little escort had taken up a decidedly threatening attitude, did she deign to reply. It proved to be an East India Marine, employed by the Indian Govt. for patrol work, putting down pirating, preventing smuggling etc. Usually it flies the Blue Ensign, but in war time, the White Ensign. It is to be reported for its laxity in delay to reply.\n","22":"\n\nEarly this morning, the fleet stopped for two reasons, both of a medical nature. Firstly, the medical officers of the \"Themistocles\" and the \"Borda\" changed from one ship to the other, and secondly, two men suffering from acute appendicitis were brought over to the flagship to be operated upon.\n\nThe reason for the transfer of medical officers, it was rumoured, was the incapacity of the \"Themistocles\" original doctor to cope with the work entailed on such a large ship (by the way, to-day saw the fifth death on this boat). But I take this rumour for what it is worth on board ship – and they were not worth much.\n\nOne of the boats of the convoy, \"A37\" a prize ship, having no facilities on board for carrying out a surgical operation of such delicacy as appendicitis, had to tranship two sufferers to the Ulysses. This meant a journey in an open boat of about three-quarters of a mile, and had not the patients been of a hardy, virile type, there might have been no need for the surgeon’s knife. At 12 o’clock, the operations were over, and it was reported \"both doing well\".\n","23":"\n\nEarly this morning, I caught my first glimpses of Arabia. Indistinct at first, a large mountain gradually became quite plain, and as we came nearer and nearer, the details of a huge, bare, barren, rocky headland became quite visible. Except in the near vicinity of the lighthouse, there was no a trace of green – absolutely nothing to relieve the monotony of the grey and brown tones of the rock. The fleet anchored, not in the harbour of Aden, but in the roadstead. Mails went ashore, the naval officer in charge of the convoy went to Aden for orders, we received a visit from an officer of the Aden Port Trust, and from the medical officer. Of course the niggers put in an appearance and quickly disposed of their stocks of dates, Turkish delight, tinned fruits, etc.\n\nDuring the afternoon, the principal transport officer returned on the submarine. By a combination of flash steering and a choppy sea, the little craft got underneath our stern, with the result that the wireless was put out of action, the conning tower being slightly damaged. A little after four in the afternoon, anchor was weighed, and the fleet started for Suez.\n","24":"\n\nEarly this morning, we passed the island of Perim, and then entered the Red Sea, through the Straits of Bab-el-Mandeb. At about 7 a.m., away on the port bow, we sighted the islands off the coast of Africa, known to sailors, as \"The Twelve Apostles\". These islands, like the land we saw at Aden, are extremely rocky and barren.\n\nLater on, an armed merchantman, painted \"battleship grey\", flying the White Ensign, and having what, in ally probability was a third dummy funnel was seen on the port bow. As she came abreast of the fleet, we dipped our flags in salute of the White Ensign. In the afternoon, a P. & O. liner was passed. How many on board, I wonder, would have given their last cent to be returning to dear old Australia on her? A noticeable feature of the Red Sea is the great number of lighthouses - we have passed seven already. In spite of a fresh wind all day, the Red Sea is keeping up its evil reputation for its hot weather, for this evening you could cut the air on the troop deck with a knife.\n","25":"\n\nMore Red Sea weather to-day, so things were far from pleasant on board. However, it was pay-day so everybody, under most trying conditions, was far from irritable and bad-tempered. Besides receiving my twenty shillings (most of them have already disappeared in an effort to obtain a supply of good food from the saloon galley, per favour of a certain steward), I was also presented with a few million smallpox germs. A short time ago I was passed as being successfully vaccinated. But apparently military red-tape has asserted itself with the result that a convoy order was published stating that \nevery\n man must be done while aboard ship.\n\nI only realised to-night what getting to much of a good thing means. We have all been interested in our brass band, and have listened to it day by day, and have appreciated its increasing proficiency. But now, the continual blare is becoming boring and nerve-racking. We get too much of it – too many marches and \"patriotic selections\". Anything for a comic opera selection, or a tango dance played by a string band!\n","26":"\n\nNow that we are in closer touch with the Old World, and able to make use of the wireless more freely, being in comparatively safe waters under British control, we are able to get smatterings of war news. War bulletins are issued daily, and are posted around the ship in conspicuous positions, in the lavatories, for example. The news, generally speaking, is uninteresting and incomplete, due in great measure to the wireless operator being interrupted by unearthly noises of the rowdy element outside the Marconi room.\n\nWe have been out of touch with the rest of the world for a month now, which under the circumstances, is a very long time. And it is marvellous how you get used to going without anything – even if it is war news or rather \"war lies\". So that, taken all round, the bulletins are not appreciated. But even in camp, in both New South Wales and Victoria, war news was always unpopular. So it is not to be wondered at that, being so unaccustomed to hearing anything of the war in which we hope to take part, the sinking of a German dreadnought fails to arouse much enthusiasm.\n","27":"\n\nThere has been a most remarkable change in the weather to-day. From the unpleasant heat, typical of the Red Sea, even in winter, it has changed round, until it is now quite cool. It is these sudden changes of temperature that are accountable for the many cases of pneumonia, influenza and colds which are very prevalent throughout the convoy.\n\nThis morning, through the clouds, we were just able to discern the huge mountain ranges of Northern Africa. Most grand-looking and impressive, they were a kind of reminder of the vastness of the continent of which they form a part. Then there were more of those barren islands and away to starboard, dignified Mt. Sinai of biblical interest (the ark rested there, said one Australian savant and theologiste) was seen. Then a general discussion commenced on the wanderings of the Israelites – a most appropriate subject for a troopship debate. The debate was adjourned however when the business-like instincts of the Jews, someone declared, originated with Moses, in always doing everything in duplicate – even Commandments!\n","28":"\n\nAwoke this morning to gaze on Suez and its beautiful, novel surroundings. At least it appeared so to me. On the one hand, those barren, rocky, oddly shaped hills reared up which, seen as they were through a clear atmosphere now of cold purple tones and then of the most beautiful rose tinted hues (the sun was just on the point of rising) were, to the artistic mind of the acme of perfection. On the other hand, lay Port Suez, and the town of Suez, looking quite diminutive and \"petite\" by comparison. As the sun rose, the details of the place became more and more plain. From the \"Ulysses\", it looked very pretty and inviting; but, as with most Oriental towns, so I am told, distance lends enchantment to the view, and the unpleasant odours, filthy streets and such like would, no doubt, take away its great charm for me. We received the usual visits from the officials and also the Arab hawkers, but contrary to expectations, did not go through to Port Said. Rumours of fighting on the canal was responsible for protecting the starboard side of the bridge with bags of flour, these rumours being definitely confirmed by our delay in starting.\n","29":"\n\nThe convoy, with the exception of the \"Wilochra\" which had New Zealand reinforcements on board who had landed at Suez, proceeded to enter the canal shortly after 9 a.m., headed by the \"Ulysses\".\n\nSteaming slowly up the canal, the boat we first past was H.M.S. \"Ocean\". We saluted in the usual way, i.e., by dipping our flag and standing at attention. As was the case all day to-day, the officers had little control over the men, and, in spite of the numerous \"Fall-ins\" on the bugle, Australia’s ragtime army was all over the ship, cheering the merry mariners with the greatest enthusiasm. (Further up we passed the \"Himalya\", an old time P. & O. liner on the Australian service, the \"Orsova\", bound for gum-tree land, the P. & O. \"Persia\" and lastly the French man-of-war \"Requin\". At frequent intervals on both sides of the canal, the 7th Ghurkas, Sikhs, Punjabis, the Royal Engineers and the Lancashire Engineers were all strongly entrenched at various points. We were heartily cheered and of course we reciprocated. For the night we anchored in one of the Bitter Lakes near the town of Ishmailia. \n","30":"\n\nLeft for Port Said this morning. As was the case yesterday, we received a good reception all the way up the canal. We are now getting quite used to the camels and palm trees, as a substitution for horses and gum trees.\n\nPassing an Italian man-of-war, and also the Australian hospital ship \"Kyarra\" we steamed slowly past the Canal Offices at a little after four in the afternoon. We received an enthusiastic reception all the way along the town which reminded me of picture of Venice. Coming to a standstill almost opposite to the statue of that great engineer, De Lesseps, we were pestered by the usual crowd of divers, hawkers, musicians, all of whom, after a while, kept at a distance away from the Ulysses by the vigilance of the military police. Of course there was no leave, and for the remainder of the day, we were entertained by the appearance, antics and harmonious melodies of the coolies who were coaling the ship. Also, everybody was interested in the French hydro-planes which continued to buzz overhead and to skim along the surface of the water till nightfall. When I retired at 11.30 we were still at anchor.\n","31":"\n\nAwoke this morning to find ourselves at sea. So I was just as well pleased that my suggestion to break ship and go ashore was promptly squashed by my older more cautious, and less irresponsible mates. In the morning everybody was busy preparing his kit for disembarkation.\n\nIn the afternoon, the \"Ulysses\" which had gone on ahead of the rest of the fleet, entered Alexandria harbour. Personally, I was disappointed with the whole place. The harbour was crowded with ships of all descriptions, most of which, we were told, were German and Austrian captures. But everything was deadly quiet so different to all the other ports at which we have called. The whole thing was quite unattractive and uninteresting, and our landing-place failed to create a favourable impression. After a great deal of manoeuvring in the shallow harbour, the \"Ulysses\" was got alongside a wharf which was evidently a very quiet part of Alexandria, for absolutely nothing disturbed us. No excitement, no nothing. At 6 p.m. we tied up for the night.\n","32":"\n\nThis morning, reveille sounded at 5 a.m. and soon the troopship was a scene of the greatest activity, with preparations for the disembarkation. A little after nine, the right half of the 13th Battalion assembled on its alloted deck space and shortly afterwards was marched off on to the wharf. There, having been issued with rations for 24 hours, we proceeded to the train. The entrainment was carried through without a hitch, in a quiet soldier-like manner. Then we settled down to enjoy what, for most of us, was the most novel train journey of our lives. The stuffiness of the third class carriages was almost unbearable, but we were not conscious, for the greater part of the journey at any rate, of our discomfort. Our first stop was Damanhur. Everything was novel – the mud townships, cemeteries, houses in the trees, the shrines of the saints all along the road. Next was Ita el Barud with its camels, goats, its mules, and its fertile irrigated farms. At 12.45 we crossed the Nile, arriving at Tanta some time later. From there to Banha and then to Cairo concluded the train journey. Then after a dusty walk of about two miles, we arrived at our camp, which is near Heliopolis.\n","33":"\n\nHaving had a strenuous day yesterday, \"the heads\" did not work us very hard to-day. Getting up at nine o’clock, we did not have breakfast until ten. The situation of the camp is on the outskirts of Heliopolis, which is, I am informed, is the Toorak or Potts’ Point of Cairo. Excepting the buildings of this place, the landscape is one of sand – sand and bell tents. Needless to state, ourselves and our belongings are covered with dust – brownish yellow Desert of Suez sand. But the camp is run on sound military lines. We are under Imperial jurisdiction now, and the difference, even at this early stage, is most marked. Everything is run on sound military and regimental lines. There are both wet and dry canteens, and also a café where the troops may purchase cheap palatable and wholesome meals. Only authorised native hawkers are permitted to enter the lines. The Arabs are made to do most of the fatigue work, so that all together, we are not going to have such a terribly bad time.\n","34":"\n\nAnother feature of the Imperial way of doing things which is very much appreciated by the Australians is the Mess Room idea. Previously, at our camp in Australia, our meals were served to us in the lines; but now each company has its own Mess room with tables and benches. So that instead of having our food cold and covered with sand, it is served in a hot, palatable condition.\n\nThis evening, I paid a visit to what was formerly the Palace Hotel of Heliopolis, but is now known as No. 1 Australian General Hospital. Unfortunately I could not appreciate all the beautiful tones of colour by the artificial light. But there is absolutely nothing tinny or tawdry about it. Everything is of the best from all the interior fittings to the solid slabs of granite of the basement. Of course, it has been greatly changed by its previous formation into a hospital containing five hundred rooms. But the beauty of the building and its surroundings still remains. I intend to see this place by daylight before we move from Heliopolis.\n","35":"\n\nTo-day, complying with the issued instructions as regards the new infantry organisation, the Battalion was reformed into 4 companies and sixteen platoons. After the old order of things, this seems very strange, but I daresay we shall get used to it very soon. My new section commander, although he is a very decent fellow, is, militarily speaking, an ignoramus. So I am feeling very sore about going on active service under a man who knows such a lot about his job that he gives the order \"For inspection, port arms\" from the \"Present arms\". It hurts, I can tell you.\n\nThis afternoon, the officer commanding the division to which the Fourth Infantry Brigade is attached, General Godley, officially opened the Y.M.C.A. building which has been constructed in close proximity to our camp, for the convenience of the troops. In a short but appropriate speech, the General referred to the good work of the Y.M.C.A. both in Egypt and Australia. This building, he continued, was especially of great service, as it would do something towards keeping the troops from playing the fool in Cairo.\n","36":"\n\nNothing of any particular importance about which I can write to-day. We are settling down to the ordinary routine of camp life which is briefly as follows:- Reveille 6 a.m., Parade 7-7.50, Breakfast 8, Parade 9.30-12.30, Dinner 1 p.m., Parade 2.30-4.30, Tea 5.30, First Post, 9 p.m., Last Post 9.30 and Lights Out, 10 o’clock. So it will readily be understood that there is not very much of interest. The parades are held in the desert of Suez, or rather on the outskirts of this extremely barren tract of land. The dust arising from the sand is disagreeable in the extreme. And that is performing simple company movements. What it will be like when we make a start with our Brigade training, march discipline with full pack up, and all the Divisional concentration, I do not care to anticipate. Sufficient to say that many of our town bred Australians will curse the day they left their jobs to join the Force. And yet these dusty marches through the desert will be nothing compared to what will be the hardships not of ragtime active service but the genuine article.\n","37":"\n\nThe Colonel, this morning, appeared on parade for the first time since we have been in Egypt. After the morning parade, the battalion was assembled, and he spoke a few words to the men. We must congratulate ourselves, he said, on our safe arrival at our destination, and that without the death of a single man in the batallion. He reminded us that we were in a strange country, close to a city totally unknown to us. He advised us to look after ourselves, and not to run the risk of being sent back to Australia, diseased and disgraced. \"Be careful of yourselves\", the old man concluded, \"both for your own sakes, and for the sake of the good reputation that the 13th Battalion has already won for itself\".\n\nAs a recognition of the good work put in by the men since disembarkation, a half holiday was granted by the Brigadier. It was not as greatly appreciated as it might have been as most of the men are fairly \"broke\". But the majority of the men were out of camp, the remainder staying behind to enjoy the first really decent clean up since they have been here.\n","38":"\n\nI was a member of the Quarter Guard to-day – the first land guard that I have done since I joined the Force. I may mention Guard is not a very strenuous job usually (although you have to keep your wits about you). But to-day there was a lot of \"presenting arms\" to generals and other \"heads\", as a big ceremonial church parade was held. The massed bands play the hymns, and it took two of the twenty-two-and-sixpence chaplains to conduct the service. Generals Maxwell and Godley were present, and a march past was subsequently held.\n\nTo-night I put in a couple of the coldest two hours I have ever spent. I was on sentry-go towards midnight, and the cold was really \"something to write home about\". You can put your hand flat on the ground, and, it does not need a great deal of imagination to suppose that you are laying hands on a block of ice. Being a Sydneyite, these cold nights, after fairly warm days, do not in the least appeal to me or my exaggerated idea of comfort.\n","39":"\n\nThe Battalion did its first route march to-day, with full marching order. It was not a very long march, only of three hours’ duration, but it was long enough to make us detest the Egyptian desert. As we got further, away from Camp, so the marching became heavier, the ground became more stoney, and, on account of the loose stones lying everywhere, walking became more difficult. But there is no use complaining – this is child’s play to what we are going to do in the way of route marches.\n\nThis evening I paid my first visit to Cairo. So very novel was everything, that I cannot write about anything in particular, because all is a blurr. But Cairo has made a great impression on me. The cosmopolitan nature of the place is everywhere apparent. For nearly four hours, we wandered through the streets (in the native quarters, the \napologies\n for same). And yet, as I said before, I have no definite impressions of the place. It will take several visits to individual places before I can really say that I know Cairo.\n","40":"\n\nThis morning a route march was held through Heliopolis. After yesterday’s little jaunt over the desert, this was mere child’s play, although we marched \"at attention\" all the way. This has called forth the righteous indignation of the members of the Battalion who are old soldiers with Imperial service to their record. We are now virtually in the field, they maintain, and marching should be made as easy as possible by marching \"at ease\". The phrase \"sheer ignorance of bum colonial officers\" sums up in polite language the remarks which I overheard on this point.\n\nBut these same allegedly inefficient officers have not neglected another important point – the care of the footwear of the men under them. This afternoon a boot inspection was held, and as a result, several pairs, in my own platoon, were condemned. The importance of seeing that men have comfortable serviceable boots, especially in an infantry regiment, cannot be overestimated. Do a ten mile march in a bad pair of boots, and any civilian will realise this.\n","41":"\n\nTo-day, the first divisional concentration was held. Reveille was sounded at 5.30 a.m., and by 7.45, the four battalions were formed up on their respective parade grounds, ready to move off. Shortly afterwards, the Brigade, headed by the Brigadier, Colonel Monash, on foot mark you, set out on its march for a large parade ground on the outskirts of Cairo, a place called Ab … It was not a long march, but the walk worked up quite a ruddy complexion on the face of corpulent and rather ponderous Brigadier. Shortly afterwards, the New Zelanders, the Light Horse Regiments and the batteries of Artillery put in an appearance, and the division was complete.\n\nAfter a sumptuous repast of biscuits and cheese (we shall be lucky to get that in a few months’ time), we had a march of a few miles in another direction, and finally returned to Camp at 5 p.m.\n\nThis evening, the 13th Battalion band gave a band concert in the Y.M.C.A. tent which was greatly appreciated by the troops. Our band is, at present, the crack band of the military forces in Egypt.\n","42":"\n\nThe usual parades this morning and a blanket inspection after dinner. This resulted in the discovery of several \"sharks\" who had taken more than their share of blankets, thus leaving their comrades (?) to pass the bitterly cold nights without sufficient covering. But I suppose this sort of petty thieving and \"pointing\" is typical of the \"Surry Hills push\" in the battalion.\n\nI received my first batch of letters and papers to-day. And how I enjoyed reading each line of those letters from my nearest and dearest, away, a long way away in Sydney! The letter written to me by my dearest little Mater, was the most beautiful letter I ever remember having read. Sentiment is no doubt one of the ruling forces of the whole world. It is not very apparent in a military camp, but thank God I had not lost all my sentimental instincts as not to be touched by every little idea contained in that letter – all her little worries as to my health, warm clothing, her reminder of her continual thoughts of myself --- To-night I shall dream that I am in Paradise, Paradise, at home with my loved ones!\n","43":"\n\nAnother day in the field to-day when a sham fight was very well stage-managed solely for instructional purposes. Some of the Light Horse, the Artillery, and the Infantry of our Division, carried out a mixed sort of attack on dummy targets. The rest sat down, had dinner, and then slept, while the officers, who should have been explaining the \"tactics\" to their commands, all wore expressions of horrible boredom. But if we saw nothing else, we saw the explosions of the now much talked of shrapnel shells. They certainly did \"stir the mud up\", and rumour has it that one man was shot accidentally.\n\nThe next day we go out, we shall doubtless play the role of combatants, while the fighters of to-day will, on this next occasion, be the spectators. The view of Cairo was, to me, the most interesting part of the day. Seen through a Blue Mountain of haze, with the tall, white and stately looking buildings of Heliopolis in the foreground, Cairo, seen from the eminence on which we were stationed, looked quite squat and tiny, although the vast area which the town covers was apparent. Cairo contains over one million inhabitants, and even if the majority of them do live under the same conditions as sheep, they must live somewhere.\n","44":"\n\nEverybody in camp, or rather, the members of the 13th Battalion, are now very \"hard up\". The other battalions of the Brigade have all received some pay since disembarkation. At any rate, there has been a great deal of justifiable dissatisfaction for the last few days. And to-day, the colonel, in granting us a half-holiday referred to this all important topic. His excuses (which almost amounted to apologies) were pathetically feeble. \"Money is difficult to obtain, some errors have crept into the new and complicated forms for the requisition for pay, and generally, we have not settled down to the new style of things.\" If he had stated that the administration of his own battalion was rotten, he might have been believed. \"Qui s’excuse, s’accuse\". He forgot to mention that the other battalions had to face the same allegedly unsurmountable difficulties to the prompt payment of the troops, and had apparently been able to make their men a contented body of keen and enthusiastic workers. If a man knows that, after a hard day in the field, he has in his pockets that which will obtain for him a packet of cigarettes and a pint or two, he ceases to be an apathetic soldier as the members of the Battalion are at present.\n","45":"\n\nThe inevitable and boring Church Parade to-day during which the religious Australians select a human target in one of the front platoons, and vie with each other in piling up the largest number of \"hits\", made by throwing the innumerable small peebles in the sand as accurately and rapidly as possible. As in acting service firing, the combination of accuracy of aim and rapidity of fire wins the day, so, even on the Sabbath we learn a little more about soldiering, the weak-voiced, uninteresting chaplain being treated as a negligible quantity.\n\nThis afternoon a pal of mine, a real good old pal of the Sydney days, came over to Heliopolis to pay me a visit. And how good it was to have a talk about old times (for now it seems a long, long time since we left our old Sydney life for that of a soldier’s life). It is only when you are in a foreign country, without any vital interests for you, that you recognise the true worth of a friend, a man whose interests are your own and yours are his. Now I know the meaning of the word Friendship.\n","46":"\n\nSame old parades to-day and nothing about which I can particularly comment. The dust is still the same, very disagreeable to the lungs and very tiring. All to a man, are resolved that Egypt is no good, bum – very bum. But various men express their opinions in different ways.\n\n\"This \nis\n rotten wheat country\" says the man from the country. \"Hopeless for putting greens for golf links, or for lawn tennis courts\" is the man-about-town’s comment, grass couldn’t grow here in half a century. This is what we think of the place where we do all our work. But will it always be an unpopulated wilderness? Perhaps, perhaps not. In spite of such checks on the growth of the population, such as this war, in years to come this very spot, sandy, barren, dry as it is, may be the scene of a flourishing, wealth-producing farm, a highly complicated scheme of irrigation, and the Lord knows what. Man and his ever fertile resourceful brain, aided by a pampered artificial Nature, produces economic Wealth. I suppose all this will someday happen. And to look at it now, to live here and enjoy the sand --- Hell with the lid on!\n","47":"\n\nTo-day the Battalion left camp at an early hour, bound for the rifle range, which is situated behind the barracks of Abassia . The day put quite a different complexion on the Australian army. Except for the matter of Unity of Empire, I realised what a stupendous waste of money this really is. And I noticed it for the \nfirst\n time. Here is a battalion of infantry which has to march a few miles to a rifle range, fire ten rounds a man and take a day to do it. This day cost the government 6\/- a day per man at the very least, with the 17\/6 a day for subalterns etc. There was absolutely no material increase in the efficency of the shooting of the battalion, because it took them at least ten rounds to get their sighting correct. Further there was a mistake about the rations, and the men had to shoot on nearly empty stomachs. It is to be hoped that it will not take this battalion eleven hours to do exactly the same work as a neighbouring battalion did in a little over six hours. Time is precious, at present. It means more than money, it spells human life.\n\nWednesday 17 February 1915\n\nNo early morning parade this morning, and only a short 9-11 parade after breakfast. At 2 p.m., the battalion was assembled and moved off at full strength, on bivouac for the night. The transports and travelling kitchens accompanied the main body, so that there were only a few left in camp – those on the sick list, including myself, the guard and only the absolutely necessary fatigue parties.\n\nIf you have ever been in a deserted or partially deserted military camp, you will recognise my feelings of to-day. A shadow of dull dreariness and great loneliness seems to spread over the whole place. The contrast is so marked. Instead of the busy life and bustle of a camp, uniformed men rushing hither and thither, you have the almost lifeless step of the sick men – those who are marked on the sick report as \"light Duties\", who do not go on parade but are responsible for all the light fatigues. Then there are the sentries, ever on the move along their respective beats. But they are always there, you are quite accustomed to seeing them that they are part and parcel of the camp. An empty camp is a far more dreary affair than is a house, half full at the theatre. In fact, to some, it is intolerable.\n\nThursday 18 February 1915\n\nThe battalion returned from its first bivouac this morning at 11 o’clock. My information as to the proceedings of the battalion I am obtaining from what I judge to be a quite reliable source. It appeared that the 13th took up a fairly strong position on a rising, some distance out of Heliopolis. After entrenching at various points, they settled down to wait for the expected attack on the part of their opponents, the 14th (Victorian) battalion.\n\nThroughout the night, a keen look-out was kept for the enemy by the numerous sentries. But until just before dawn (the stereotyped conventional hour for making an attack) their watch was in vain. Then the enemy appeared and vigorously attacked the half-asleep men in the trenches. What happened after, no one is certain. The","48":" got the decision, but to all my interrogations, I merely got the reply, \"They didn’t win at my point\". And as I asked a man at each of the various points in the line, and got the same answer, the decision appeared to be rather erratic. But the men forget that half of them would probably have not lived to tell the tale. Hence the explanation. After breakfast (supplied from the field kitchens) the start on the return journey was made, the battalions reaching camp at a little after ten.\n","49":"\n\nLeft camp early this morning to take part in a divisional field exercises. Marching through Heliopolis, we reached the point where the road led into the desert. For the first six miles or so, the going was quite easy. After that we had to assume a new formation as we were under imaginary long range artillery fire. That meant spreading out to either flank, with a result that we had to traverse, at a high rate of speed, a stony, sandy tract of very difficult country. A great many dropped out as the pace was too hot, the usual \"nail-in-their-boots\" shirkers being later reprimanded by the divisional commander. This fast tramp lasted for about one hour, and at the end of the stretch we were complimented by no lesser personage than General Birdwood himself. After a rest, the 13th was formed into the reserves, and we were just getting our chance to breast the top of a hill and reinforce another battalion already \"in action\" when the \"Rally\" was sounded. Forming up again into close order, we commenced our long walk of 12½ miles back to camp at 4.10 p.m. Reached camp long after dark, thoroughly tired after what has been (","50":" far\n mark you!) our most strenuous day.\n","51":"\n\nBeing a half-holiday, I had my first look at the capital of Egypt by day. We drove straight up to the citadel, thus making a commencement of seeing Cairo in detail. The citadel is a large but ancient fortress built on the highest point of Cairo. At the bursting of a single 6 or 8 in. shell, I daresay half the structure would tumble down – a heap of ruins. At any rate an armed guard is on duty at the entrance of the place to prevent civilians or those without passes from entering. So I suppose the old place is worth something.\n\nBut the chief interest of the place is the well-known Mosque of Mohammed Ali Pasha. This is considered to be one of the finest mosques in Egypt. After putting on slippers, you pass through the outside courtyard, and from there, into the interior of the building. The first thing that strikes one is the beautiful harmony of colour in the multi-coloured effects – nothing gawdy, nothing inartistic or displeasing. Then there are the wonderful curved effects of the interior, from the great dome of the roof down to the beautifully rounded bases of the polished alabaster pillars. And after the squalor of the native quarter of an eastern city, the rich red carpet, soft to the tread, gives the necessary reminder of the luxury of the Orient.\n","52":"\n\nAfter Divine Service to-day, I visited the Zoological Gardens of Cairo. Taking the electric tram, we crossed the Nile and proceeded out towards the Pyramids. Quitting the car, we entered the gardens for the sum of -\/2½ - one piastre.\n\nThe gardens themselves are beautifully laid out and are kept in the pink of condition by the numerous gardeners and attendants. This is one of the advantages of a country with a cheap labour market. Then there are the attractive pathways which consist of small stones, the shape and size of a pigeon egg, in three colours. These are cemented in, and the designs, and the effects obtained by the various patterns, are wonderfully striking and original.\n\nAs to the Zoo proper, the most pleasing and interesting feature is, of course, the animal life of Egypt itself – the queering-looking snakes, the sandy-coloured birds of the desert, the crocodiles of the Nile, the hippopotamus, and the rhinoceros. Then there is a fine collection of the carnivore group, some fine zebras, and the usual humorous element of any zoo – the monkeys. And Australia is now represented at Cairo Zoo – a wallaby, presented by an Australian unit, having taken up its quarters there.\n","53":"\n\nBattalion field training to-day. Great attention is now being paid to the rapid extension from the ordinary column of route to a formation which minimises the possible loss from shrapnel or shell fire. We practised this continuously to-day, so that the battalion is evidently not too keen on being wiped out by the artillery. To-day I was impressed by two things. One was the competence, \"command\" and intelligence of our second-in-command, a highly trained colonial soldier and the other was the lamentable incompetence, lack of control, and mental dullness of our Commanding Officer, one of those so-called veterans, \"a South African\" man. Most of this latter class of \"old soldiers\" are more bother than they are worth – especially if they fail to display a single soldierly quality. On the other hand Major Ellis is a born soldier – a man in whom any person in this battalion would place the greatest confidence. His ideas are clear; and these same ideas are formulated in clear, concise orders. He knows what he wants done – and gets it done. But the other … absolutely hopeless!\n","54":"\n\nOnly a short parade this morning – a little training in \"Company in attack\" and then we returned to camp. An inspection of feet was held later – a most necessary and frequent measure in an infantry force. Then a solution of Condy’s Fluid was supplied, and after bathing their feet in this, the men were ordered to rest in their tents until 4 p.m. At 3.45 the \"quarter\" or the \"warning for parade\" sounded, and shortly afterwards, the battalion fell in and was marched out for a pleasant evening in the sand. Going along merrily for about four miles, we reached a slight rising in the ground. Here we ate the evening meal which had previously been issued and then proceeded to entrench ourselves against an imaginary enemy. Outposts were told off and sentries were posted – a full dress rehearsal for the real thing. After a time, we got word that the \"enemy\" had shifted their position, and we commenced a long tramp across the sand in pursuit. However, they managed to elude us, and after a number of hour’s weary wandering in the wilderness (a la Israel) we reached camp considerably after midnight, throughly tired, as a result of the evening work. One advantage, its much cooler than working in the day.\n","55":"\n\nThis morning I was picked for a party detailed to mark at the butts for the 13th reinforcements. These men have apparently never done any shooting before, so they carried out some of the simpler and less difficult practices during the day. When you are in the trenches attending to the targets, you have a good opportunity of judging what the shooting is really like. I was in charge of the field telephone and had a particularly good chance of watching the general effectiveness of the fire.\n\nAs is the case with the whole of our regiment, the troops do not \nknow\n their rifles as well as they should – the little individual and characteristic points of their respective weapons, such, for example, as a rifle firing a trifle high or a trifle low. I dare say the authorities have made every endeavour to give us plenty of rifle shooting but there has not been nearly enough of it – not by a long way. What is the good of a complex and elaborate scheme of training all drawn up with a single object in view – to get your men into the firing line with a minimum of loss – if when they do get there, they fail as an efficient fighting force merely because they cannot shoot.\n","56":"\n\nMore battalion field training this morning so that it is beginning to get a little irksome. The whole object of this work is to teach the officers, on a given signal, to move their commands about the field as rapidly as possible. It is, I think, a recognised principle of infantry tactics, that once the infantry man is fatigued beyond a certain point, he ceases to be an efficient fighting unit. So whenever it is possible, all movements are done at a quick brisk step, not at the \"Double March\".\n\nThe Egyptian winter has shown the first signs of drawing to a close for this afternoon it was considered too hot to parade so an inspection of feet and rifles was held in the company lines. The rifles, in this dusty country, are extremely difficult to keep in a clean serviceable condition. To use the regulation Russian petroleum is to get your rifle choked full of a mixture of sand and oil. So a dry-cleaning method has to be adopted. Rifle cleaning is not the easiest of jobs in this country, and those that had been at all slack about the care of their rifles had a good stiff half-hour’s work yesterday preparing their weapons to pass the critical inspection of an exacting and precise subaltern.\n","57":"\n\nThe day was set down for divisional training so reveille sounded at 5.30 a.m. However we were evidently a reserve force for an order to hold ourselves in readiness, to move off at any moment, came through from divisional headquarters. So all morning, we remained in our lines. And it was not until 2.30 p.m. that we moved off, through the village of Zeitoun where the New Zealanders were encamped. However, when we got to the base of operations, all action was over and after a short spell, we returned to camp.\n\nThis evening, I listened with great pleasure to a powerful address by a Scotch Y.M.C.A. Secretary, on the War and its effects generally. This gentleman, fresh from the battlefields of Europe, depicted, with vivid realism, some of the terrible scenes which he had witnessed. He concluded with this exhortation to his Australian audience: \"Your turn, your chance to play your part in this awful struggle, is close at hand. The eyes of the world will turn their gaze on to the hitherto untried Australians. See to it that, when the time comes, you worthily uphold your country’s honour\". And I may add that his speech made a deep impression on the majority of his audience.\n","58":"\n\nThe usual half-holiday, or rather the apology for same was granted this afternoon at exactly quarter to four! Morning parade ends at 12.45 p.m. Dinner is always finished at the latest by 1.45 p.m. Where the delay comes in, nobody seems to know, but the fact remains that this Saturday half holiday business is becoming a farce. Of course, it is argued, there need be no holidays or no leave granted on active service. But when orders to officers commanding units distinctly state that work is to be arranged in such a way as to make the half-holiday possible, and especially as the other battalions of the brigade are off by at the latest at 2 p.m., the grumbling at the falling in to inspect the lines, then the falling out until the \"disperse\" is sounded, and then the falling in again to be dismissed, is obviously excusable. It is exactly this continual suffering of petty annoyances and petty tyranny (you can conveniently hide a lot of things under the phrase \"military discipline\") that is causing discontent and ill-feeling towards the officers. For myself, being young, and always used to a certain amount of discipline at school and at home, I do not feel this being constantly humbugged about. But for older, married men with families (\"Wait till I get him in the firing line\").\n","59":"\n\nAfter lunching in Cairo, a friend and myself paid our first visit to Mena and the Pyramids. After a most enjoyable eight-mile drive, for the most part along an avenue shaded by rows of \"Labakk\" (shade) trees, we arrived at Mena House, now a military hospital of considerable size. After a short inspection of the neighbourhood, we hired camels and rode around these wonderful structures of the ancient world – the famous Pyramids, those grand, solemn, historic edifices, the temples and the tombs of that wonderful Pharonic dynasty. Being pressed for time, I did not have the pleasure either of inspecting the interior or of climbing to the top, thus missing, I am told, one of the finest views of Cairo and the Nile that can be obtained.\n\nWith the Sphinx, I was very disappointed. All the pictures and postcards that one sees of this great piece of work are taken in such a way as to grossly exaggerate the size of the figure. But in reality it is quite a small affair. A lions body with the head of one of the ancient kings, this sacred sculpture is, to the people, the emblem of Wisdom, Force, Power, Energy, Watchfulness, and, as the English will have it, the symbol of loyalty to Britain.\n","60":"\n\nTo-day the batallion carried out a more advanced musketry practice, and carried it out very badly. To start off with, the company officers lost themselves and their commands – it took them exactly one hour and fifteen minutes to find the butts, where we were to shoot. Backwards and forward we wandered from range to range, a badly controlled mob with hopeless officers. If they are going to loose all sense of direction on a rifle range, God knows what we shall do in the field.\n\nAs for the shooting, for troops about undergo an active service campaign, it was absolutely rotten. The targets represented an entrenched enemy at various ranges and were designed to teach officers and non-commissioned officers to point out the \"objective\" and give the approximate ranges. The bad shooting (in one case a section failed to score a single hit) was due, in many instances, to bad fire control, orders that were not clear and concise, and lack of fire discipline with the inevitable confusion which is always present under such circumstances. The percentage of hits was about twelve. With more efficent control this might have increased to 20%. But firing on a rifle range and under heavy fire are two vastly different things. So are the percentages of hits!\n","61":"\n\nThe Battalion, this morning, left camp at an early hour, in full fighting order. The usual field work was carried out, in fact the morning was devoted to a recapitulation of previous days in the field. We got back to camp earlier than usual and I spent the evening in Cairo.\n\nOur usual rendezvous is Shepheard’s Hotel. This is a fine building furnished on a most lavish, luxurious scale. As might be expected, everything is of the best and is much appreciated by those who know oriental art furnishings. The billard-room and bar are wholly frequented by officers and soldiers, for there is hardly a single tourist in Egypt. And many are the humourous scenes that Shepheards has witnessed during the last month or two. The idea of a private entering the best hotel in the town, and paying 1\/- for a drink is wholly foreign to the English \"officah\". And in spite of the monocled gaze of an Imperial Staff Officer, the Australian private, with that brazen effrontery typical of him, continues to drink his cocktails and liquers with the best of them. At the same time, a \"Terrier\" is spending his hard earnt piastre on a cheap beer somewhere in the slums.\n","62":"\n\nToday, the brigade had the hardest, most strenuous day of any since it has been in Egypt. Leaving camp at 9 a.m., the troops trudged many weary miles through the soft sand. Then, after skirmishing over the country for five hours or so, the weary sore-footed infantry returned to camp at eight in the evening.\n\nBut fortunately for my dislike of discomfort in any shape of form whatsoever (or rather, in the long run, unfortunately for my standard of efficiency as an infantry soldier) I was selected as a member for the Heliopolis town picquet. The duty of this noble band is to assist the military police to keep good order, and to see that the beer houses are closed at a reasonable hour, and to pack the beer-chewers back to camp with the greatest possible speed. I did not find it a very difficult job – on the other hand, I knocked a great deal of fun out of it running in the drunks, and acting the policeman generally. But there was not as much doing to-night as their usually is – hard graft during the day does not give the troops that desire to \"stir the mud up\" as though no day’s work could ever remove his natural appetite for a drink or two.\n","63":"\n\nBy a big fluke, I managed to obtain day leave to-day, that is, leave during working hours. So I made the best of this splendid opportunity to see a little more of Cairo by day. After visiting the ancient and famous mosque of Gammea Amad in Old Cairo. We then proceeded to another part of the city, through the seemingly endless maze of the streets in the native quarters of an Oriental town, and entered the Azhar mosque and university. From what I could find out from some of the students (I never indulge in those pests known as \"guides\"), the mosque and the university are run in conjunction with each other, as Mohometan theology formed the whole curriculum of the institution. The future priests sit about in various parts of the building, taking in its \"atmosphere\" and using it as a scource of inspiration, studying the Koran. The deep earnestness with which they work is apparent on every face. With them, \"sky-piloting\" is evidently not looked upon as a profession.\n\nLater in the day, my friend and I paid a visit to the Museum. This fine building is the home of the treasures of the Egyptologist – those treasures, those precious links which connect us with the wonderfully fascinating world of ancient Egypt. As we had no learned Egyptologist with us, the visit was robbed of a great deal of interesting explanations.\n","64":"\n\nThis morning, as the battalion was ordered to carry out some entrenching exercises, the first opportunity was given to me to show my capabilities as a \"pick and shovel\" man. As the ground was soft and sandy, I got along famously, but how I would manage in difficult country, I do not care to imagine.\n\nIt turned out that this morning’s work was merely a rehearsal for the evening’s performance. At about nine o’clock in the night the brigade moved off to take part in our first divisional night operations. After going for about eight miles, a halt was made, we entrenched in a favourable position and settled down to a long wait for the enemy’s attack which was expected at dawn, and at dawn it came. But it was a feeble affair without an effective results; and we had gained the day. The work was very satisfactorily performed as indeed is all the more advanced stages of our training, which is now drawing rapidly to a close. Still I have had quite enough of even one single night in the trenches on a bleak, cold desert to last me for a long time. What about three months of Hell in France …?\n","65":"\n\nQuitting the trenches (which we afterwards filled in either because (i) the Egyptian Government is not too keen on paying damages to the Arab whose stray camel falls in and breaks his neck, or (ii) because General Maxwell, when the Turks \ndo\n eventually cross the Canal and make an advance on Cairo, does not want them to find trenches already dug for them) at the outrageously early hour of 6.30 a.m., we formed up and commenced our early morning walk back to camp which we reached a couple of hours later. After breakfast we had the rest of the day to ourselves, and I proceeded to have a regular good \"clean up\" – disinfect the tent, fumigate the blankets and have a good shower bath.\n\nIn the afternoon things were fairly quiet. A few went to Cairo, but, for the most part, the fellows indulged in a luxury they are now quite unused to – the little afternoon nap or \"forty winks\". Such a thing has been unknown to me since I joined the Force. But after a bivouac comes a rest, and you don’t feel very enthusiastic about flying round Cairo after one of those pleasant little evening flutters of the military.\n","66":"\n\nTo-day I was fortunate enough to dodge the usual church service, and proceeded forthwith to Cairo, with the object of visiting one or two of the Egyptian bazaars. And very interesting they proved. To penetrate through the maze of the back streets of the native quarters, I had, for the first time, to hire a dragoman or guide, and as might be expected, he was more bother than he was worth. As I strolled down the street, the absence of khaki struck me as pleasing and refreshing – it also had the same effect on the natives, for they were the happiest smiling crowd I have, as yet, seen in Cairo. A host of articles are offered to one – from a thick, luxurious carpet to an uncut emerald, from a silver coffee service to an imation coral necklace. Then one sees the Egyptians at work on their brassware, chiseling the quaint, distinctively Egyptian designs together with the ever present \"Koran\" inscriptions. Some time at a \"Turkish delight\" depot and a visit to a perfumer of cigarettes brought a very enjoyable afternoon to a conclusion.\n","67":"\n\nConcluded our course of musketry to-day, when two more practices were successfully gone through. The shooting showed a vast improvement on last day’s feeble performance at the range – the average of three hits out of five being fairly consistently maintained throughout the whole battalion. Nor was the weather conducive to good shooting. A high wind with the usual accompaniment of dust, made it very difficult to pick up the khaki targets, so that the splendid performance was all the more meritorious.\n\nThe first exercise was snap shooting at stationary targets at 200 yds, five seconds for each round. The second was with the moving targets which covered a distance of thirty yards, during which time, you were expected to fire five rounds. This proved to be more exciting as it introduced a little inter-section rivalry. And anything in this line always suits an Australia.\n\nMarching to and from the range amidst clouds of dust was very disagreeable, and practically every man finished up with sore, watery eyes. \"Thank God we will soon be quitting Egypt\" was the common remark of the haters of dust and dust storms.\n","68":"\n\nThe work set down for to-day was kit inspection in the morning and inspection of the Battalion by the Brigadier in the afternoon. Kit inspection was the usual thing – a man’s deficiencies in accoutrements, clothing etc. are taken for the hundredth time but you never hear any more about the carefully complied lists that are handed into the quartermaster’s store. A half-day wasted, at the minimum of 6\/- a day!\n\nThis afternoon, however, was more profitable. The battalion, in full marching order, moved off to a suitable parade ground and the inspection of the","69":" & 14th Battalions was commenced. At the conclusion of the proceedings the parade formed a hollow square and the Brigadier addressed the troops. After expressing his satisfaction and pleasure at the smart turn-out, and also his praise for the manner in which our work in Egypt had been carried out, he went on to deal with our future movements. And in this Colonel Monash was very cautious and tactful (his barrister’s training doubtless serving him in good stead). Then he concluded: \"Your high standard of efficiency has secured its reward – you will be under fire within very few weeks from now. See to it that you cheerfully perform the job which you have undertaken.\"\n","70":"\n\nTo-day another divisional exercise was carried out. The division was split up into two forces – the Brown and the White Forces, commanded by Colonel Monash and Colonel Braithwhaite, Chief of the Divisional Staff, respectively. As per usual, no clear or concise scheme of attack was explained to the men, and thus half the benefits of the exercise were lost. At any rate the 16th Battalion was ordered to attack the enemy, the 13th forming the second line of supports. But apparently the enemy’s mounted infantry carried out a flanking movement, the battalion wheeling round to oppose this force and thus forming a new firing. Some of our troops suffered heavy loss, the umpire, in many places, ordering the casualty screen to be raised. Amongst the \"prisoners\" captured by the \"enemy\", was our second-in-command. However, our force was given the decision, and the return to camp was begun, rather earlier than usual. Being a hot, dusty day, the men suffered a great deal of discomfort. One thing is certain – we shall have to regulate the rate of consumption of our water to the limited capacity our our small (for this country) water bottles. I mention this because the water carts were rushed.\n\nThursday 11 March 1915\n\nThe first definite indications of a departure at an early date were given to us by the nature of our work all day to-day. First, our feet were very carefully inspected, and then treated with methylated spirits. Then a through inspection of the rifles was followed by the issue of certain deficencies including such very necessary articles such as boots, breeches, hats. This is by far the most hopeful sign of our early departure from Egypt, for God knows how long we have been in completing our kit.\n\nIn the afternoon, a general clean-up was ordered. Forthwith operations of a cleansing nature were commenced on stained tunics, dirty hats etc. For the most part, the articles looked very much worse as a result of their rough treatment. But this is all that can be expected from slipshod, camp washing. So altogether we were not overworked to-day, on account of yesterday’s hard day, and also, it is rumoured, in anticipation of some heavy work to-morrow. Our training is now coming to an end – and nobody regrets it. You can always have too much off a bad, as well as a good, thing, and we have had quite enough of those heavy, dusty marches across the Libyan desert. And, in addition, 2\/- a day in Cairo, for an Australian, is hopelessly inadequate. When on leave, he cannot live – he merely exists. Therefore you hear: \"The sooner we quit Egypt the better\".\n","71":"\n\nReveille at 5 a.m. this morning, and by 7 o’clock the brigade had moved off to take part in a divisional exercise which was the embodiment of some intelligent person’s fanciful idea. The general idea is this, roughly: A khaki state, in violation of a treaty with a \"white state\", desires to encroach on certain oil wells, belonging to the latter party. After all its endeavours for peace have proved to be fruitless, the \"white state\" decides to defend its right and the treaty by force of arms. It therefore mobolises in haste and takes up a defensive position in an excellent praiseworthy manner. Meanwhile the \"khaki force\" consisting of the whole division \nless\n the howitzer battery, pushes forward, the commander knowing that only a small number of the enemy could be mobolised at such short notice. This forecast is confirmed by our scouts who discover that the enemy’s strength is about four guns, a few cavalry, and a brigade of infantry. At any rate after a long, tiring march, we came to grips with the foe. But there was no sting in our attack (our march had been too severe), and the East Lancashire \"Terriers\", our enemy, had entrenched themselves in such excellent positions that it was inevitable that they should win the day. So after a strenuous day of nearly twelve hours’ duration, we returned to camp a little after six.\n","72":"\n\nNothing particular to note to-day. Much to the annoyance of everybody, the 13th was ordered to carry out a forced march during the morning, while the other battalions, on account of yesterday’s hard day, were permitted to rest in their tents. And a forced march it was; for during the morning, we must have covered at least ten miles, and that over very difficult country. The sandy nature of the ground makes walking very hard; hence everybody is developing most remarkable leg muscles.\n\nOne incident of the morning called forth a short address from the Colonel before we dismissed for the afternoon. Our second-in-command had given a certain order, and was hooted for his trouble. So the Colonel, with righteous indignation, complained of a certain lack of discipline in the regiment, especially as we were on the verge of an active service campaign. We were congratulated on last week’s work – the most strenuous of the battalion’s existence – by the divisional commander and by General Birdwood, but, at the same time, we were reminded how necessary it was to overcome that one serious weakness characteristic of all colonial contingents – a lamentable lack of discipline. \"Military discipline is going to win this war, and that only, not brillancy, in skirmishing and shooting,\" concluded the Colonel.\n","73":"\n\nTo-day, I visited Maadi, a little place east of Cairo. You take the train at Bab-el–Louk Station – a kind of branch station in Cairo – and after a short run lasting only fifteen minutes, you find yourself in a very pleasant little spot, plenty of vegetation and no dust. A few minutes walk, brings you right to the banks of the of the Nile, and at this particular point, the river with its graceful bends, and the tall stately palms on the opposite bank, looks very charming and picturesque. After an al-fresco afternoon tea, we paid a visit to the Turkish concentration camp containing about three or four hundred Turkish prisoners captured on the canal. They seem a very contented lot, nothing to do and all day to do it in, better fed than their guards (a detachment of \"Terriers\") and, I am informed, in receipt of -\/6d a day for their trouble. The \"guard\" is an absolute farce. Why, they wouldn’t leave their comfortable quarters for the worlds!\n\nLater in the afternoon we went to the military camps at Maadi – chiefly occupied by the Light Horse and A.S.C. After dusty Heliopolis and Mena, this camp is an ideal spot. Quite a little township has sprung up round the camp which has the appearance of being quite a permanent affair.\n","74":"\n\nLeft camp early after breakfast this morning to practice extended order work. The Colonel, as usual, was not on parade and the brunt of the control of the battalion thus fell on our fool overworked second-in-command. All morning and for the greater part of the afternoon, we extended, closed in again, changed direction, and the usual run of this sort of work. It all means running about like a lot of sheep, and, in the heavy sand, this is no easy job. However, we started for camp early in the afternoon and, on the way home, the wonder of wonders happened! It actually \nrained\n. Rain in Egypt? Almost inconcievable! We had almost forgotten what rain looked like and we took advantage of the reminder. Hats were off, jackets unbuttoned to make the best of the few points that did fall. I am waiting to see the morning paper to-morrow. War news will be right in the background, I imagine, and, in big headlines, will appear: \"Terrific rainstorm in and around Cairo. Nearly ten points registered.\" It makes one think what wonders old Nature works. To make up for the absence of rain, he makes arrangements for the Nile to overflow at regular intervals. Hence a great deal of fertility and cultivation wherever there is irrigation. Poor old Egypt if it had to depend on its tremendous yearly rainfall!\n\nTuesday 16 March 1915\n\nAfter yesterday’s pleasant day in the sand, they had the \"cheek\" to order reveille for 2 a.m. After a great deal of shaking and other persausive efforts the officers and N.C.Os eventually aroused the men. Sick parade was at 2.30, morning tea and biscuits at 3, and by 4 a.m., the Battalion moved off for a little stroll of ten or twelve miles. At break of day, we were half-way and by 8 o’clock, we had reached our concentration point. The \"advance on Cairo\" then began, the infantry being assisted by a howitzer battery and some mounted infantry. The whole affair however, was a failure. The \"enemy\", consisting of the other half of the division, were strongly entrenched on very favourable ground, our advance was shockingly carried out, and in the real thing, we would have been completely obliterated – wiped clean off the map. Our infantry is just beginning to get too much of this – they are getting stale. And except for occasional patches of brillant skirmishing, there has certainly been no improvement – rather the contrary. We did not even have any energy enough to make the culminating bayonet charge. To put it shortly, we were fairly \"in the soup\". After our decisive defeat, we formed up and returned to camp, weary and irritable, which we reached at 2 in the afternoon, after exactly 12 hours hard going.\n\nWednesday17 March 1915\n\nA good instance of how a humorous incident will bring about an end to an awkward or difficult situation. At breakfast this morning, there were a host of complaints regarding the food, an absence of butter, doughy bread etc. The orderly officer, who endeavoured to pacify matters, was hooted, counted out and nearly shoved right out of the mess for his pains. At any rate, the situation, in the hands of this highly disciplined Australian army was just beginning to get interesting and lively, when the beautiful harmony of the bagpipes broke right through the terrific noise of the uproar: and \"The Wearin’ of the Green\", played on bagpipes, mark you, simply brought the house down. Then, roars of laughter, as a little procession, headed by the bagpipes, followed by the bearer of a emerald green flag and a bevy of happy sons of Erin, passes along the mess room. It’s certain that St. Patrick’s Day is that same orderly officers lucky day!\n\nThis afternoon the battalion marched out at half past four on bivouac for the night. At eight o’clock a halt was made, the blankets were distributed, sentries were posted, and the camp slept. I wonder how many dreamt of France and of trenches as a change from Egypt and dust!\n","75":"\n\nThe Brigade was astir at two o’clock this morning and proceeded to attack their opponents, the New Zealand Infantry Brigade. The 14th, 15th and 16th Battalions formed the firing line, the local reserves and the supports, our battalion remaining in the rear to dig trenches for ourselves, as well as for the rest of the Brigade. This was in case a retirement was necessary, as our troops would then have a line of defence upon which they could fall back. As it happened they did have to retire, and a hot engagement took place at dawn between the New Zealanders attacking, and ourselves defending in the trenches. Daylight put an end to the operations, no decision being given. Both the Brigadier and the Divisional commander complimented the men of the","76":" on the excellence of their trench digging which, they declared, was carried out in a good soldierly spirit, considering the difficulty and irksomeness of the task. Shortly after eight, we arrived back in camp. And for the rest of the day, a well earned spell was granted us.\n","77":"\n\nThe work set down for to-day was exercise in moving camp at short notice. At nine o’clock the Battalion was ordered to be ready to move off by 10 a.m., accompanied by our complete transport section. In fact we had an hour to get ready for active service as it were. Blankets and waterproofs were rolled up and placed on the transport wagon, black kit bags, to be left at the base, were packed and securely tied, and the stipulated articles of clothing were packed in the valise. By 9.45, we we ready to move off, in full marching order. For convenience sake, tents were not struck, so it will be seen that we could have finished the complete job in just a little over an hour. Very satisfactory indeed for the first time.\n\nThe Battalion then moved out of camp and was afterwards inspected by the Colonel. This being finished we had lunch and returned to camp. At 5 p.m. I left camp to go on guard at the Palace Hotel, Heliopolis. Quite a change from camp life, even if it is only for twenty-four hours. And after sleeping on the cold sand, it’s good to feel you are in barracks with a straw mattress to sleep on.\n","78":"\n\nGuard at the Hospital is the easiest, sweetest job I have done so far. Three good, nourishing meals and plenty of nice warm blankets made this usually irksome task really pleasant, and even enjoyable. To begin with, there was the novelty of guarding what is probably the finest hotel in the world. Also, all the surroundings were novel, the nursing sisters in their attractive uniform; the ever present badge of the Geneva Convention, the scrupulous cleanliness of a well-run institution. How different from dusty Heliopolis!\n\nI had the opportunity of seeing the interior of this most beautiful edifice by daylight. Everything was evidently worked out on a grand scale, immense and imposing, stately and splendid. All is of the best throughout the whole three floors – from the beautiful cielings and the elaborate, oriental light fittings, to the fine slabs of marble of which the floor is composed, the beautiful marble pillars, the exquisitely colored designs of the walls. All is Arabic in style though the work of the French architect, Jasper . Truly a wonderful building. There were three burials to-day, all with full military honours. It is this that brings you down to Earth again from this wonderful hall of \"Demi-paradise\".\n","79":"\n\nA party of us to-day left camp at an early hour on a visit to the ancient city of Memphis. We were accompanied by an excellent dragoman whose information was of great interest. Leaving Cairo by train we reached Badrashen, a village fourteen miles from town. At the station, we took donkeys and passing through the native village of Mit Rahinah came to the ruins of ancient Memphis. This city, the guide informed us, was founded by Menes and for many years was the capital of Egypt. But whatever fame or glory it possessed, the rise of Alexandria \"finished\" Memphis and it becomes merely an unimportant provincial town. The first points of interest are the two colossal statues of the great Rameses II. One is 42 feet in length and the other shows the sword stuck in his belt – the symbol of Royalty – and both are composed of hard limestone. After inspecting what were probably the walls of Memphis, we proceeded a distance to Sahkarah the most wonderful of all cemeteries and burial grounds where the great kings, statesmen and priests of the land were entitled to have as their last resting place. We inspected the Step Pyramid, the Pyramids of Unas, Teta and Pepi I. Then after a delightful lunch in the midst of the wilderness, we turned our attention to the Serapeum, the vaults of the sacred Apis Bulls. Our visit concluded with an inspection of the tombs of Thi, that great statesman and priest of ancient Egypt, and also an ancient monastery of the fifth century A.D. Easily the most enjoyable day since we have been in this country.\n","80":"\n\nReveille at 5.30 a.m. this morning, followed by an early muster of the Battalion. A careful inspection followed, and each platoon was sized, that is to say, the tallest on either flank, the shortest in the middle. The Brigade was then marched about half a mile out of camp and the Division formed up in review order, to be inspected by the High Commissioner for Egypt, Sir H. McMahon. The \"review\" as usual, was a farce. Twenty or twenty-five horsemen, headed by Sir Mc. and General Godley, galloped past the front line of each unit at about 50 yards distance away. Then the \"inspection\" was over. Afterwards the March Past took place, the Australian Light Horse and the N.Z. Mounted Rifles looking very fine indeed, and making a great impression. But the infantry was, to say the least, disappointing. The marching was not good and the dust shocking. In fact, this dust nuisance spoilt the whole parade.\n\nIn the afternoon, we brushed up our company drill – a department of our work in which we are very weak. This is noticeable throughout the whole of the second contingent – the great weakness in ceremonial work. But it is more than counterbalanced by our greater efficency in field work, a department of much more importance on active service.\n\nTuesday 23 March 1915\n\nThe Battalion marched off at full strength this morning, just as it would leave the base of operations for the front. After going three or four miles, the \"enemy\" was sighted. A protecting line of skirmishers were sent out, and the other three companies began to entrench. We practised more of the drill part of trench-digging to-day. Each platoon is responsible for a certain length, the platoon commander \"sites\" the trench, the men are divided into reliefs or shifts and the work commences. As each relief comes up, the men take off their equipment and tunics, lay down their rifles, \nmuzzles to the front\n, and commence their task. Then, if they enemy make a surprise attack and the order to man the trenches is given, each man knows exactly where his gear and his weapon are, and can rapidly occupy the partially dug trenches. These precautionary measures against confusion are especially necessary at night. During this time the transports are well to the rear, so that the whole scheme of a battalion preparing for an attack is as complete as it can be.\n\nLater in the day, a careful inspection of rifles and bayonots was held, a few cases of gross neglect and carelessness being shown up. At the same time, however, it may be stated that it is an absolute impossibility to keep the rifles like a new pin in a country like Egypt.\n\nWednesday 24 March 1915\n\nIt is quite obvious that the troops, if they were kept going every day in the working week for several weeks, would not, in a difficult, sandy country such as Egypt, be able to keep up the arduous training which we are now undergoing. This applies especially to the infantry units. To obviate this, \"Rest\" days are periodically granted to the various battalions so that they may have a chance to recuperate – an opportunity for getting some of the dust off their lungs. On these days an inspection of feet and rifles is held. These inspections having been carried out with satisfactory results, the medical officer takes over the battalion, and a parade, to guard against the possibility of any spread of venereal disease, is held. After that, the company lines are cleaned up, the men are dismissed and have the rest of the day to themselves.\n\nThis afternoon the first death (i.e. not counting a drowning case at Liverpool at a time when the battalion had scarcely been formed) occurred in the 13th, the poor unfortunate being a patient in No. 1 Australian General Hospital, suffering from abcess on the liver. It speaks well for the general good health of the regiment that the first death should not take place till after six months since the battalion was formed.\n\nThursday 25 March 1915\n\nThe work set down for to-day, was brigade manoeuvres and shortly before nine the 13th, 14th and 15th battalions left camp and cut across country, rushing through the sand at breakneck speed, as if their very lives depended on it. The 16th had already taken up a strong position and at the first halt, the day’s scheme was explained to us. A White force, the","81":" is making an attack on Zeitoun, and a Brown force, the rest of the brigade, is sent out to oppose them. The two forces engage, and the smaller party has to retire, for the purpose of reforming and regaining its \nmorale\n. The \"Browns\" immediately press home their advantage by a vigorous frontal attack combined with an outflanking movement. The enemy are forced to take up a defensive position and hurriedly entrench.\n\nBut the cover was sufficent to protect them from the deadly rifle fire of a superior force, and so good a target did they present, that the umpires gave us the decision although at least four hundred yards from the leading trench. The \"cease fire\" was sounded and we reformed. After lunch (very stale bread and \nsardines\n of all luxuries) and a rest, we began our tramp back to camp along the old Suez road. A fairly warm day, so the very cold water of the shower bath was very acceptable.\n","82":"\n\nEarly morning parade is now taken up with bayonet fighting. Up till this it has been the same old \"On Guard:, \"Right Parry\", \"Butt\". But this morning, we made several charges on dummies – a line of bags filled with new dust, suspended from a rope which ran overhead. Although the performances with the bayonet were rather crude, the exercise was a novel one, and throughly enjoyed by the men, and after the first few mornings, there shall doubtless be a marked improvement.\n\nPunctually at one o’clock this afternoon, the battalion moved off on bivouac. The work set down for us was \"Battalion on Outpost\". We were politely asked to quit our originally selected position for this work, as the Lancashire Territorials were being put through divisional tactics there. So proceeding on some distance further, we entrenched ourselves on the outpost position, selected by the battalion commander posted sentry groups and sent out patrols, and kept watch for the \"enemy\". At 10 p.m. the exercise finished as, according to our company commander, \"we had some stiff work for to-morrow morning\".\n","83":"\n\nNow that the weather is becoming warmer, real open air sleeping is delightful. You pick a nice little hollow in the ground, dig a small hole with your entrenching tool, where your hip is to go, make a pillow of the soft sand, and, with two blankets and a waterproof sheet, you pass as pleasant and as comfortable a night as you could wish for. Throughout the night we all slept like tops, and reveille at 4.45 was very annoying indeed.\n\nAfter an excellent breakfast, ten rounds of ball ammunition per man were issued and the companies were marched away in succession for the purpose of practising field firing. Starting at about 900 yards distant from the cardboard targets representing the enemy in an entrenched position, we first secured round the base of a hill, and coming into the open, extended, under cover of the machine guns. At 600 yds., the order was given to reinforce the firing line. After that a steady advance towards the trenches was made, fire control, fire discipline and the idea of mutual support being fairly well carried out by the officers and N.C.Os. The shooting though far from good, was satisfactory and we especially distinguished ourselves in the final assualt – the bayonet charge which is the culminating focus of all infantry attack.\n","84":"\n\nThis morning we experienced a terrific dust storm – one of the most extraordinary sights I have ever seen. Just about the time for Church Parade the fresh freeze became a gale, the wind blew at a terrific rate, and of course, the sand and the dust and the heat were indescribable. Huge columns of sand were seen to be fifty feet high, just like a whirlpool. Several of the ramshackle buildings around the camp were half blown down, and the tents did not getting of scot free, especially the carelessly pitched ones. This strange sight lasted for about an hour and was followed by a spectacle none the less novel.\n\nAfter the worst of the storm was over, a few of us went out of camp a little way for revolver practice (these weapons, of course, are strictly forbidden, being against regulations, but that does not matter in the Australian army). Then we found ourselves fairly in the midst of huge armies of locusts – not the good old noisy Australian locust, but a funny looking thing more like a grasshopper. There were millions and millions of them, the air was thick with them. No wonder poor old Pharoh was driven half-crazy by the pests.\n","85":"\n\nSir Ian Hamilton is now paying a hasty visit to Egypt and to-day, the set programme of work was cancelled, and a review of the division by this distinguished soldier was substituted. As on the occasion of last week’s inspection by the High Commissioner for Egypt, the whole effect was spoilt by the clouds of dust that arose, as a result of the tread of horses and men in massed formation.\n\nAt a little after 2 p.m. the division was formed up and at 2.15, with military punctuality, the General came on to the parade ground. The \"G\" on the bugle was sounded, and we came to the \"Present\" for a minute or two. A salute was played and then the inspection commenced. It was exactly the same as the last review, only that a keener interest was taken in the troops by the soldier than by the worthy diplomat; further, we had the newly arrived Maadi contingent on our right, in whom the General took especial interest.\n\nThe march past was a farce and a very dusty farce at that. \"Keep your eyes to the right and count the number of Sir Ian’s ribbons\" said the General. \"Lend us your field glasses and we will\" was the quick retort.\n","86":"\n\nMine being the company for duty, I was not on parade to-day. So I was told off to report to the Regimental office as orderly. It is just this kind of job, that occasionally brings you into touch with the purely administrative part of the battalion. Of one thing I am absolutely certain, for an active service campaign, military red tape is scandalously allowed to reign supreme. This was the one single impression that the day’s work left on my mind.\n\nDuring the day, I delivered a whole host of divers papers to various officers. And I generally made it my business to find out as much as I could of the contents of each packet. Being chumy with the Orderly room Sargeant, this was not a difficult task. And the result of my investigations was something as follows. From big batches of Court Martial papers to faked Parade States (heavy penalty on active service), from War Diaries to tentative Embarkation States, everything is a huge farce. Both parties know & shortly will know the gist of the information contained in the important looking official blue envelopes, without the necessity of useless correspondence. Meanwhile, huge stationery bills and overworked clerks are the only appreciable or noticeable result of that mighty ruler – Red Tape!\n","87":"\n\nAnother rest day for the 13th to-day. So after a general clean up of our lines, our tents, and finally ourselves, many of us left camp for Cairo. It is one of the remarkable features of this fascinating city – its power of attraction. The soldiers, to a man almost, are not only beginning to be bored with the lures and the pleasures of Cairo, but they are beginning to detest them. Yet in spite of this, where do they look forward to going most whenever they get the chance – to Cairo, of course. Those wonderful ruins of Memphis, the magnificent museums of this city, in fact, everything of historic interest in this most interesting, most historical of countries, is, to the majority of the Australians, very ordinary and very tiresome. Of course, no one expects them to become learned Egyptologists straight away. But there ought to be present something more besides the one desire for the questionable pleasures of Cairo. And yet the fact still remains – they are tired of them. Why then do we all flock to Cairo every time we get an opportunity. The explanation, I think, lies in that subtle, mysterious and ever present lure of cosmopolitan people of a distinctive city, of a Cairo in a word.\n","88":"\n\nThe battalion left camp early to-day on bivouac. And a pleasant surprise was in store for us. Instead of making for that dusty, uninteresting district around the old Suez Road, we turned down through Heliopolis, and passing by the rear of the New Zealanders’ camp at Zeitoun, made tracks for that fertile country near the Nile. We soon came to a place called Marg, and were in the midst of a big date palm plantation, owned, we were told, by Sir Thomas Lipton. Everybody seemed light-hearted and cheerful, and we all enjoyed the luxury of having a shady grove through which to march. A \"tram\" with accomodation for four passengers and drawn by a donkey, called forth a roar of laughter from the Colonel downwards.\n\nReaching our destination, we had an enjoyable luncheon in the shade of the palm trees. And how nice and soft the Lucerne felt beneath us! Then we rested until tea-time. And after the evening meal the band joined us, and we had a concert and sing-song. Retiring to our luxurious beds at ten, we slept till day-break when, after a meal of excellent curry and rice (on Good Friday Friday) we returned to camp well satisfied with our 24 hours’ worth.\n","89":"\n\nAfter yesterday’s enjoyable little picnic, we left our bivouac grounds at any early hour and returned to camp at about eleven. After a shower and a general spruce up, many left camp, bound for Cairo. I shall always have cause to remember Good Friday, 1915, for I witnessed a most remarkable sight – a great military riot on the part of the colonial troops. How it started, nobody can say for certain. A few New Zealanders and Australian Light Horsemen, it appears, had some good reasons for taking strong objections to either the inmates of or certain incidents that occured in a house occupied by several public women. The house is one of many on the same street which has an evil reputation, and these few soldiers began to show their objections in, to put it mildly, a most practical manner. They began by emptying the whole of the contents into the street – wash-basins and tables, underclothes and wardrobes, even a piano! Then in the narrow street, they made a huge pile and a great bonfire was in full swing. By this time huge crowds of soldiers had appeared on the scene. The native police were helpless and when a last the mounted military police appeared on the scene, and were forced to fire several shots things began to get really lively. Several were shot, but this did not daunt the courage of the mob, for when the fire engine appeared on the scene, the poor\n","90":"\n\nCamp, this morning presented a busy appearance, as we left camp at an early hour to dig trenches. Although, for me, this pick and shovel work is very tiring and to a certain extent, disagreeable, I am beginning to full realise the necessity for absolute proficency in this part of a soldier’s work. And it is especially the case in this war.\n\nWe marched a short distance out of camp, behind the New Zealanders’ Camp at Zeitoun, and then proceeded with the day’s work. All trenches were dug to full depth, so the work was fairly stiff. The firing line was connected up with the trenches for the supports, by means of communicating trenches. So that altogether, everything was fairly complete at the end of the time. Firing line trenches are not always dug the same way, the officer elects the kind of trench which he thinks is best suited to the conditions of the moment.\n\nfiremen received a very rough handling, the engine was nearly overturned and the hoses hacked with jack-knives. Not till after nine hours (at midnight) were normal conditions restored. Altogether a disgraceful affair.\n","91":"\n\nThis morning I took the Holy Communion at a service which was held in the Y.M.C.A. but at 7.30 a.m. And what a different service it was to that usual boring farce which is held every Sunday and which is labelled \"Divine Service\". To-day is the first day that I have communicated since I have been in the force, and I feel very much better for it. I prayed for my dear little Mater and my dear young brother away in Australia, and for my dear old Dad who is at present away in Japan. It is just these little religious reminders, the recognition of a Supreme Being, a Star guiding our destinies, that can keep a man straight, especially if you take into consideration the conditions under which the average man now lives – no restraining parental influences, no refining influences of female society. And today I agreed with that wise Frenchman who wrote: \"If there were no God, it would be necessary to invent one\".\n\nThings were very quiet round camp to-day. All leave to Cairo, of course, after Good Friday’s brawl, has been stopped and officers and men are \"confined to barracks\".\n","92":"\n\nOnce again we have had the pleasure of one of those enjoyable dust-storms. This time however, the dust was twice as bad as last week’s little blow, and there were no locusts. Sand and dust everywhere – in the tents, in the food, it even penetrates through solids and gets into your water-bottle. I was on picquet to-day – duty in camp to see that the naughty little soldier-boys did not violate hygienic principles by drinking out of the tap and that they did not waste the water! Dam farce, these red-tape picquets! At any rate, I got my full share of the dust but not as much as those who had to go on parade.\n\nRapid moving of the battalion was practised. The men, at short notice, packed their kit bags, rolled up their blankets and waterproofs, and were ready within a very short time to march off with full pack up. We are now hourly awaiting embarkation orders. And I am right when I say that ninety five percent of the troops will be glad to quit this infernally dusty hole.\n","93":"\n\nToday we got the first definite hints of an early departure from Egypt. The programme for the week’s training was suddenly cancelled, and the week or part thereof, was put at the disposal of \"officers commanding units.\n\nSo we did what we had all learnt, or what we were supposed to have learnt 7 months ago – Squad Drill. to say that the men we disgusted would be to put it very mildly indeed. Yet to their credit, they did not show their displeasure in the usual Australian fashion, namely by indulging in a little hooting exhibition. No! they carried out the various movements with a remarkable show of smartness and discipline. Everybody on the parade ground was surprised – the officers were astonished that no objections were made, the men, that they could knuckle under and, for once in their military careers, behave like the soldiers of (say) the Continental armies. To put it as I heard it said \"Gawd blimme, why the hell did we do squad drill all day just like a British Tommy would, without a single b--- objection!\"\n","94":"\n\nWe got word this morning that embarkation would be delayed for several days yet, but nevertheless, preparations for leaving camp were immediately begun. Kit bags were branded, all boots were hobnailed and a hair-cut all round was ordered.\n\nA pair of clippers were issued to each company and soon, the camp lines began to get very hairy. Fair golden curls, jet black, silky locks (all allowed to flourish for the purpose of attracting the attention of the Cairo damsels) had to be parted from their proud and loving owners. Everyone had a close crop, and we began to assume the appearance of convicts – and soldiers, real active service soldiers.\n\nDuring the day, the men listened to short lecturettes, given by their respective platoon commanders, on subjects of great importance on an active service campaign. Such subjects as Camp Sanitation, Duties of an Outpost, Conservation of Water, Care of Arms, were dealt with, and I think the Colonel will find that they are more profitable than is Squad Drill.\n","95":"\n\nToday, for the first time, I think, the old man had us out on the Field on his own. Up till this we had always had either the second in command or the adjutant with us, usually both. Whether this is due to the Colonel’s incompetence in manoeuvres or to his weak voice, I could not say. But anyhow, he proved himself this morning. We marched out along the Old Suez Road. Having gone some distance, he halted the Battalion, informed the men, for certain, that they were shortly to leave the sands of Egypt (loud and prolonged cheers), and that the time had now come for them to quit Cairo and its attractions. Then marching across the desert, several tactical exercises were practised. Also the companies were mixed up, as would occur during an action, and rallying, on a given signal, was practised. And today we returned to camp more satisfied with our commanding officer than we have ever been before.\n\nTo-night an event of tremendous importance happened. It is typically\n","96":"\n\nThe day was taken up with general preparations for embarkation. Active service kits were packed; and then the remainder of our personal belongings we placed in our black bags, fastened them up securely, and piled them up in heaps ready to be stored at the Base. An infantry soldier takes to the front only what he carries on his back; so you may be sure that nobody is very keen to carry an superfluous articles of clothing around with him.\n\nA muster parade was held to-day and amongst the absentees a good sprinkling of be-ribboned, more-bother-than-they-are-worth, old soldiers (or veterans as they like to call themselves) were conspicuous by their absence. The Colonel reminded us of the order \"No leave to be granted\" and how necessary it was for every man to be on the spot, ready to quit camp. Also, his little talk on the severe penalty for \"Desertion while on Active Service\" went well home and made a decided impression.\n\nAustralian and a mere statement of the fact speaks volumes for its importance and significance. The Australians have, temporarily at least, drunk Cairo out of beer!\n","97":"\n\nAfter the Company commanders had given a short lecture on various subjects concerning troops in the Field, we indulged in a short route march around about Heliopolis. Our training in the desert has, thank the Lord, come to a conclusion and it is now just a matter of keeping in form. And the little work we are getting now is enabling us to keep fit and at the same time removed the temptation of going to Cairo. For if we lay in our tents – well we wouldn’t! Half the regiment would probably be in town.\n\nMuch to the disgust of all ranks, we were not granted even the usual Saturday half-holiday. The \"Fall in\" sounded as normal, and we were marched out to our old friend \"The Desert\", and there we went through the well-known musketry exercises several times, listened to the non-commissioned officers’ boring lectures on musketry subjects such as Judging Distance, The Theory of Rifle Fire. And after this dull afternoon, we said \"Good-bye\" to the Desert, for the last time we all hope. Carriages which are rather like sheep trucks.\n","98":"\n\nDefinite news! We leave the desert to-day. To good to be true, but it’s a fact; and at Church Parade everybody looked pleasant, talked gaily, and gave the bum parson the poor hearing that he deserved. After service there was a rush on the Y.M.C.A. hut for letter-writing, and I suppose every fellow in my regiment had the decency to write a farewell letter to his people.\n\nIn the afternoon a muster parade, in full marching order, was held on the Battalion parade ground, rifles and kits were piled, and then tents were ordered to be struck and the battalion lines cleaned up. Later in the afternoon, we had our last meal at Heliopolis and were issued with a 24 hours ration. High spirits prevailed everywhere and when the","99":" Battalion moved off at 6.30 p.m., it was to the loud and enthusiastic cheering of the 13th and also the Light Horsemen. The latter, by the way, are to be left behind as there is no immediate need for mounted men where we are going. Hence the looks of envy on their faces were very noticeable.\n\nOur battalion got under weigh at 8 o’clock. After a short march through Heliopolis we finally entrained at 10.45 and made ourselves as comfortable as possible for our 6 hours train journey to Alexandria. A crook journey in III Class .\n\nMonday 12 April 1915\n\nConsidering the uncomfortable conditions, we arrived at Alexandria harbour at 5.30 a.m., all fairly fresh. As it happened, we were dumped on a coaling wharf, and as may be imagined, soldiers equipment, rifles were all covered with dirt and cold dust, in a very short time.\n\nOur own transport had not yet arrived at the wharf so we spent the time in looking over several vessels at the neighbouring docks including two fine French transports, \"La Provence\" and La Savoie\" previously trans-Atlantic liners but now armed auxiliary cruisers. Then, the majority of the troops indulged in a bathe and the result was the disappearance of a considerable portion of the coal dust. At about 11 a.m., our feeble looking transport put in its belated appearance. Our look at her was enough – we knew we were in for Hell on the \"Ascot\".\n\nAfter our transport section and stores were loaded, we finally embarked at 6.30 p.m. and were shown our quarters in the hold. Something terrible was that filthy, foul-smelling place. \"The Black Hole of Calcutta\" wasn’t in it! \"A33\" did not leave that evening and how we last the night in that stuffy hole nobody quite knows.\n","100":"\n\nThe sleeping accomodation for the troops on this old tramp could not be dignified by the term \"troop deck\". She has just carried a cargo of guano, there are no hammocks, no mess tables, practically no light, and very little air. At any rate we woke up early apparently none the worse for our night on the hard cold steel plates. After a great deal of delay, we left our moorings at about 1 p.m.\n\nUnlike our dull, unostentatious entry into Alexandria, our departure was the cause of enthusiastic cheering on all sides. There are still a great number of captures in the harbour, most of which have been fitted, or are now being fitted up, as troopships. Amongst the ships which I particularly noticed, was the Indian hospital ship \"Gascon\" and needless to say our turbaned brothers in this war, gave us a rousing cheer. Clearing the harbour a little after two in the afternoon, we steamed for a time in a northerly direction, a few degrees west. Then the speed of the boat was noticed to decrease. Finally we stopped for an hour. Just think of it. The scratch crew of Greek stokers on His Majesty’s troopship in a war like the present one could not keep up the necessary pressure of steam.\n","101":"\n\nEvery man on board ought to thank his lucky star that there is every likelyhood of a calm trip across to Turkey, for at this time of the year the Mediterranean is particularly smooth, as is the sea to-day. Otherwise we might have had cause to curse the Ascot ever more. As it was things were just bearable. To begin with there are a thousand men and three hundred horses on board, there is absolutely no deck space for parading or for exercise; everything including sleeping deck is cold steel; and finally there is a terrible shortage of water. How long the limited supply has to last, no one can say; so it is difficult to obtain a drink, much less a good wash. Therefore we are likely to remain dirty till further notice. Of accomodation there is none. No salt water showers, no proper officers’ mess (these worthies have to have the meals in relays), no room for a ship’s office, no quartermaster’s store, nothing in fact that should be here. To put it quite briefly A33 is not even an apology for a troopship. But we must not grumble, we are on ‘fair dinkum’ active service now.\n","102":"\n\nGeneral attention today was paid to the rifles. All ranks were ordered to clean them throughly and afterwards an inspection was held. And they needed it badly, very badly in fact. For the usual rust, combined with the dust and grit from this pigsty, has in a few days, caused many of the rifles to border on the verge of being unserviceable. Rather serious, a few days before they are going to be used in action!\n\nI would not like to say for certain, but I think that this ship of ours has a chart on board. Anyhow I could not get a look at it and consequently I do not guarantee the correctness of the information I received on deck with regard to our position. But this afternoon Rhodos Island was on our starboard, and the Island of Karpathos to port. So I take it that we are now getting up into the Aegean Sea. The land such as we have seen, is similar to certain parts of the Tasmanian coast. Rocky in parts, but green and fertile – trees are conspicuous by their absence. The country is hilly but pleasant, and for troops wearied of sand and desert, it is especially inviting – just the place to have a standing camp for a week or two.\n","103":"\n\nThe passing of Kandeliusa lighthouse at eleven o’clock this morning was proof that we were well on our way to Lemnos – our immediate though not our ultimate destination. A little while after, we had our practise fire turn out. On board a troopship, according to regulations, troops must be shown their respective fire stations, and occasionally fire alarms are given to accustom the troops to a prompt and silent turn-out. So there was nothing very extraordinary in the fire alarm being sounded. But when everybody, crew included were ordered to put on lifebelts, things began to assume a more serious aspect. Our course was suddenly changed and rumours of important wireless information and submarines were circulated throughout the boat.\n\nBut after an hour’s expectancy of an attack, the troops were dismissed and ordered to sleep beside their life-belts. It is just this occasional reminder which makes you realise that what you consider to be a big picnic, an elaborate tourist trip and a supendous waste of money, is really an active service affair.\n","104":"\n\nYesterday’s rumours were today’s realities. For we received definite news that one of our fellow troopships the \"Manitau\", with British troops on board had been attacked by a hostile submarine. Three torpedoes were fired but without result and beyond the fact that everybody got a severe fright and confusion got the upper hand no damage was done. The enemy’s boat subsequently ran, or was run ashore so all this by wireless, accounted for yesterday’s precaution as well as an armed guard during the early hours of the morning.\n\nAt 6.30 a.m. we passed Lemnos Bay light, and steaming up Lemnos Bay, we finally dropped anchor in the waters of Port Mudros. They were all there, those British ships which are making history, including the \"Queen Elizabeth\" and the \"Agamemnon\". And the troopships. The bay was swarming with them. Vessels of all sizes and descriptions taken from the mercantile marine both of France and England. As a background not the sands of Egypt, but the welcome green hills of Lemnos. And what with Britain’s mighty warships, the ever moving small craft flying the Tricolor, and the innumerable merchant ships, this sight of the concentration at Lemnos was one of a lifetime.\n","105":"\n\nChurch parade was held this morning under extremely adverse conditions. The whole of the thousand men on board were hustled up forard, and packed like sardines in a tin. Our chaplain came over from the \"Seang-Chun\", the troopship which is transporting our Brigade headquarters, and arrived at service in a half drenched condition due no doubt to a swampy life-boat. The usual Sunday farce, then began and ended. Some more about this wonderful scene that meets the eye at Lemnos. There is now quite a big fleet of troopships and men of war off Lemnos. Fresh arrivals are frequent and today’s newcomers including a transport on whose deck was seen the towering of a huge airship. The flag of our ally, France, is also prominent; the swift, silent movements of her small craft particularly arouse the interests of we Australians and her troopships are comprised of what must be the cream of her mercantile marine.\n\nThe scene at night is one of extreme novelty and fascination. For the most part, the vessels are in darkness except for the continual twinkle of the Morse signalling lamps on each boat. Contrasted with these dots of light is the glare of the searchlights. And further up the bay are the outlines, in silhouette, of grim immovable cruisers and super-Dreadnoughts.\n","106":"\n\nA pleasant surprise was in store for us to-day. The order came through for the troops to have practise at disembarking, subsequently going to shore and going through a little squad drill by way of exercise. Happily, this was cancelled and a swimming parade was substituted. I have never enjoyed a swim so much before. From this thickly over-crowded, troopship the cold water of the Mediterranean was like an iced whisky and soda after a week on tepid lemonade.\n\nEverybody, officers included, enjoyed themselves to the utmost. After the bathe, a sun bath, the crowd lying stark naked in the midst of a Lucerne crop which came right to the edge of the sea. This was followed by a short stroll around the neighbourhood. This fertile spot is dotted here and there, with small Greek villages. Everything points towards prosperity, and the inhabitants bear this out with their contented appearance. At 5 p.m., the pleasant afternoon came to a close and we all went on board in a happy frame of mind. Australia, unconcerned, takes its troops a few miles from the firing line. It was a novel sight, well worth the guardians of so many precious lives. Now and again, a steam cutter passes by and completes this scene of sleep and stillness but, at the same time, been activity and bustle.\n","107":"\n\nAll preparations had been completed for the fleet to sail for its destination at some place or places as yet unknown on the Gallipoli Peninsula. Officers superintended the final packing of our kits, and were ordered to see that every man had his water bottle filled, that he was in possession of a 24 hours’ ration as well as two \"iron\" rations, and also that he had 200 rounds of ammunition and a first field dressing. All this had been completed, when, at about 11 a.m., an hour before the time set down for our departure from Lemnos, the fresh winds increased to hurricane force.\n","108":"\n\nThis morning was still blowing hard, and in addition it was raining \"cats and dogs\" – just as if it hadn’t rained for months. So there was nothing doing all day. Everybody had to spend the day on the crowded troop decks.\n","109":"\n\nA most monotonous day on board to-day. In fact, the expectancy of sailing from Port Mudros is becoming quite as tiresome as was our delay in moving from Egypt. Even on a fine day, there is very little of interest on the \"Ascot\". The usual muster parade and ship’s inspection, of course, is held every morning at 10. Then, in the afternoon, the company officers read extracts from Military Handbooks with regard to the subject of effecting a landing under fire, and such like matters concerning our immediate future. In addition, orders and messages from headquarters are also read. To-day a short but sweet message, but with plenty of \"ginger\" in it, was read out from our General, Sir Ian Hamilton. Addressed to \"The Soldiers of France and of the King\", it ran somewhat as follows: Before us lies an adventure unprecedented in modern war. Together with our comrades of the Fleet, we are about to force a landing upon an open beach in face of positions which have been vaunted by our enemies as impregnable. The landing will be made good by the help of God and the Navy; the position will be stormed and the War brought one step nearer home.\n","110":"\n\nMore preparations to-day and several departures of troopships from Port Mudros to the outer harbour, Lemnos Bay. And needless to say, the Australians instead of paying the usual compliments to passing troopships by standing at attention, wildly cheered their comrades in this Gallipoli expedition. We expect to be right in it within at least twenty-four hours, provided, of course, if the first landing parties have left us anything to do.\n\nTo-day General Hamilton received a message from the King which appeared in a special order from General Headquarters, \"The King wishes you and your Army every success, and you are all constantly in His Majesty’s thoughts and prayers\". Neat and effective but not inspired glorious close. \"Remember\", said Lord Kitchener, when bidding adieu to your commander, Remember that once you set foot on the Gallipoli Peninsula, you must fight the thing through to a finish. The whole world will be watching your progress. Let us prove ourselves worthy of the great feat of arms entrusted to us. Inspired words, soldierly and worthy of a Ceasar, which made a profound impression on our minds.\n","111":"\n\nI spent an interesting day studying the Australian soldier, the typical infantryman of the A.I.F., on the eve of the prospect of going under fire for the first time. At present, before the grim realities of War have been brought home to him, he looks at it in the light of a football march on a large scale, an affair with plenty of cheering, plenty enthusiasm and plenty excitement. He does not realise the gravity and deep seriousness of what he is about to undertake. He is confidently optimistic and delightfully cool-headed. He is taking everything now with that good old matter of fact nothing-out-of-the-ordinary style distinctly Australian. In this spirit, be it as you decide, good or bad, the men of Australia prepare to do battle for her honour and glory. Nor when the time comes will Australia have any cause to complain of her representatives.\n\nThis afternoon, I managed to obtain a glance at the Operation Orders for the Gallipoli campaign. The principle feature of the whole scheme is its completeness, the throughness of its operations. A masterpiece of detail, it will, if carried out to the letter, go down as a model of constructive skill based on sound strategic principles.\n","112":"\n\nThis morning at 11 a.m. we left Port Mudros, and sailing in to Lemnos Bay, proceeding from there up the west of the Gallipoli Peninsula. Many transports ahead of us and many in rear. At about six, we arrived at our destination – a point exactly opposite to the Narrows so that, for the present, at any rate, our theatre of operations will be confined to a small area whose width is just a little over four miles.\n\nMeanwhile the first Division had effected a landing under the deafening roar of the Navy’s covering fire. As soon as possible, the landing of the 9th Division of which we formed part, was commenced. At 9.15, the destroyer Chelmar came alongside the \"Ascot\" and we changed over to the former, her decks being packed with two companies – about 480 men in all. The first Brigades had, it appeared, suffered very heavily during their landing and, for some time, it was doubtful if the operation would be a success. So that when it was rumoured that they might have to take to the transports again, our own landing was delayed. Result, cruising around close to shore, and consequently, several casualties, no chance to rally. Altogether a useful though nerve-wracking experience. Somewhat after 2 a.m., we finally landed and fixed ourselves up in temporary shelters from \n","113":"\n\nAt daylight we left our temporary entrenchments and proceeded to climb the hills to the firing line. And this proved no easy task and we were soon compelled to take off our packs. This made the ascent less difficult and we were soon in a position to dig ourselves in as a protection from the shrapnels. Later in the day, lost my company and platoon and became mixed up with an assorted body of men, of every Australian infantry Regiment together with stray New Zealanders in the supporting trenches. These are a few hundred yards behind the actual firing line but quite near enough to make you duck your head when you hear the screaming, piercing whistle of the enemy’s shells.\n\nNow I know what War is – terrible, loathsome, bitter – indescribable. Besides the dead, scattered here and there, the fearful agony which they suffered being shown by their twisted frames and contorted expression and the wounded, moaning piteously for water, for the stretcher bearers, for the medical officers. And some crawl, some stagger in the direction of the hospital. Blood everywhere, and this was the most unkindest cut of all, we are compelled to disregard their entreaties for assistance. And by God, it takes some doing. Without misusing the language, War is Bloody Hell only worse!\n","114":"\n\nUnder heavy fire from rifles and howitzer batteries all day to-day. At about 11 a.m. we advanced from the reserve trenches to the supporting \"dug-outs\". News from the firing line was a little more satisfactory than it was yesterday, although it is apparent that we have struck a considerable force of Turks, probably a main body. But to-day we are holding our own and a little more. Except for a little clever sniping work, the enemy’s shooting is very poor, a huge proportion of both rifle bullets and shrapnel, shells going wide of their mark. The Australians, on the contrary, are aiming with deadly accuracy, which gives us a decided advantage. All day long, the warships have kept up a heavy fire, the lyddite explosions causing great consternation to our friend \"Johnny the Turk\". The aircraft, as yet, have failed to locate the source of the enemy’s shrapnel fire. When they do this, the warships will shell their positions, and as they have already reduced any forts, or apologies for same, in this vicinity, their work will have been nearly completed. A little after 6 p.m. we got the order to fix bayonets and prepare to reinforce the firing line. This we did, and waited, waited for the unshrinkable Turk to charge. But he wasn’t having any, so we dug instead.\n","115":"\n\nMy first night in the firing line was one of work. At about 1 a.m., I started to dig myself in under a heavy fire though, as is more or less the case with all night firing, the shooting was somewhat erratic. Still the lead was there and standing in the open I used that pick and shovel as I have never used it before. However, I got over this ticklish part of the job without mishap, and at 3 a.m. settled down to a look-out till daylight. We allow the Turks to do most of the shooting, and content ourselves with an occasional \"fire rounds rapid\" just to remind them that we are still where we are. In this fashion the bitterly cold night was passed, under cramped, trying conditions. From my first experience of it, I should think a very little trench fighting will be quite sufficient for me.\n\nAll day, a desultory fire was kept. Both sides are cautious and keep well down in their trenches. So we have a very poor target at which we can shoot. The casualties were very few to-day, and what few shots did get home, were the results of the clever work of the enemy’s sharp-shooters. These plucky fellows (one cannot help admiring them) come right up to within 40 yards of our trenches. And the moment a man puts his head over the trench his brains are as good as blown out. So it behoves us to play cautious and avoid be the victims of this most remarkable shooting.\n","116":"\n\nEarly this morning practically the whole firing line was relieved. Some of the men have been fighting continuously since Sunday morning, many are unable to hold their heads up through sheer weariness and want of sleep, many have already collapsed. So at two o’clock, I found myself making towards the beach. And during my two mile walk down hill, even in the same darkness, I noticed a tremendous difference in the place from its general appearance on Monday. The engineers have done wonderful work. They have made fine roads and our fresh water supplies assured. Communications from the base to the firing line have been definitely established by means of telephones and hard working little mules toil continuously up and down the gullies, bringing our bacon, bully beef, biscuits and jam.\n\nAs the Brigades are to be re-organised as soon as possible, I subsequently rejoined my company in the reserve trenches. All day we spent the time ducking the enemy’s shrapnel (we have christened \"Turkish Delight\"). And late in the night, we were relieved by some British regulars – the Chatham and Portsmouth Division of the Royal Marines of Antwerp fame. We then withdrew to the beach preparatory to joining our Battalion and Brigade.\n","117":"\n\nAt daylight the Battalion assembled and moved off in the direction of the 4th Brigade’s position in the firing line. As the trenches were fully occupied, we were given our first real rest since Sunday last and we took full advantage of it. A general clean-up was the order of the day and the rifles, our clothes and ourselves, all received a general attention. Fortunately there is plenty of water so the old Billy was boiled, bacon was fried and generally we had a good day of it snugly concealed there in a protecting valley.\n","118":"\n\nThis morning the roll was called, and we learnt for certain who our missing comrades were. A roll call on active service is always a sad sort of affair, and this proved no exception. The official list is then compiled, and the casualties are reported, the dead, the wounded, and the missing. The thirteenth, true to its reputation as a \nlucky\n number, has suffered less than any other regiment, only a little more than 10% of the regulation war strength being hit.\n","119":"\n\nEverything was comparatively quiet this morning so we knew that our anticipated \"big move\", otherwise known as a general advance, was to be made. Towards evening, water-bottles were filled, a 24 hours’ ration was issued, and 200 rounds of ammunition were distributed to each man. Early in the night a terrific bombardment was commenced, and together with the machine gun and rifle fire, the noise was terrific. Under these conditions we advanced up through a narrow defile previously visited by the Engineers. Having gained some ground this way, we received the order to charge. I always thought that the Australian was pretty good on his feet, but he can do nothing against Johnny the Turk. We didn’t get near striking distance as most of them seemed to do the 100 yards in well under the 11 seconds. But their Maxims were busy and our casualties were by no means few. Eventually we reached a favourable position, the firing line entrenching just over the crest of a hill, the supports on the other side just below the skyline. Digging a trench under fire is by no means the easiest of tasks, but by midnight, we had established a fairly strong position. A terrible odour arose from the ground, the decomposing bodies of our dead enemies – the victims of our exploits of the last week.\n","120":"\n\nDig, dig, dig! At the first signs of dawn we were ordered \"to Stand to Arms\" and prepare for the attack which we felt sure the Turks were about to make, in order to recover their lost ground. But they have evidently begun to realise the full force of Australian doggedness and cussedness and resolved that it would be useless to attempt a recapture. Towards midday I noticed we were gradually being enfiladed by a concealed machine gun, and shortly afterwards I stopped a bullet in the calf of the leg When I found that the wounded could not quit the trenches till nightfall, I determined after being trodden all over by men passing water and ammunition to try and bolt for a protecting gully a distance of 20 yards. With a ramp assistance I climbed on to the parapet of the trench and while I was in the act of wriggling down the bank on my stomach, snake fashion, that dirty dog of a machine gunner ploughed a bullet through my – you know where! At any rate, I reached cover and was conveyed to a dressing station by the stretcher bearers. From there to the clearing hospital the shelt. M.O. men took me in charge and in the evening I found myself safe on board a hospital ship.\n","121":"\n\n\"Stand to Arms!\" \"Fix Bayonets!\" Then I woke up, not from my disturbed \"forty winks\" in the narrow trenches, but from my best night’s rest for many a long day. Only in a dream did the harsh words of command ring in my ears, only in a dream did I prepare to rise from my cramped position, and reach out for my rifle. For I woke up to find myself lying on a soft mattress with three or four blankets over, very warm, very cosy. Then the events of yesterday dawned on me. Of course, I had been brought on board the Union Castle liner \"Gloucester Castle\" by some of the boys from H.M.S. London, I had been hoisted up over the side on a stretcher and made very comfortable. So here I am, with many others, helpless and wounded but happy. This fine transport is being fitted out as a hospital ship and for a week or at any rate will be our home.\n\nTo-day the rest of the A.M.O. officers and men came on board – a detachment from the West Australian section of No. 2 Stationary Hospital. Operating Rooms were established in various parts of the ship and they \"got busy\". But more and more wounded came and the medical staff vainly endeavoured to cope with the rush.\n","122":"\n\nTo-day things were straightened up. The Red Cross people by working night and day have done marvels, and we are beginning to see daylight. Colonel Ryan, a Melbourne surgeon is on board, and under his direction and supervision the operating tables were occupied all day. There are some fearful wounds to be dealt with including those caused by hits in the head, the organs, and the bones, I am among the very lucky ones merely suffering from flesh wounds. I had them dressed this morning and am now feeling O.K. In fact, for a man who is not badly hit, this is simply a rest – nothing to do and all day to do it in. I am still on my back to give the leg a chance to heal but there is no pain. Some are suffering fearful agony and we had about six deaths to-day including a patient suffering from pneumonia. But the medical cases are few and far between, most of the lads having stopped some Turkish lead. More wounded from shore to-day and the boat is now filling rapidly. But we shall not sail for a day or two yet.\n","123":"\n\nOperations still being performed to-day at breakneck speed. Some of the more complicated wounds will have to be left until we get to a permanent hospital as the appliances for carrying out certain parts of the more delicate work are not available. Meanwhile every precaution is taken against the wounds becoming septic.\n\nTo-day I succeeded in hobbling round the decks for a little while. The staff of hospital orderlies being quite inadequate for the amount of work that is to be done, have not the time to serve up full course meals all round so unless you can walk you have to be content with beef tea, bread and butter and tea. But to-day I managed to go which is at present serving as a dining room for the \"One Arm only\" Brigade. And a good cup of soup, cooked meat and \"spuds\" and plum duff to finish up with was a very welcome change to the fare of the trenches. We now have very nearby our full complement of wounded, about 1 hundred in all. We expect to receive definite sailing orders tomorrow. So we will bid farewell to Gallipoli for a time.\n","124":"\n\nThis morning at 7 a.m. we weighed anchor and our journey to Alexandria. Just leaving we got definite word from the Front that everything was O.K., the good position which we had obtained still being held and the Turks keeping very quiet. So evidently they are beginning to find the place too hot for them. Well for the time being, \"Good bye Johnny the Turk, goodbye Gallipoli!\"\n\nPassed Lemnos at about eleven and shortly afterwards we stopped for a few moments to bury the dead. This sad work being finished we again went on our way cheerful for the most part, and enjoying our holiday. We have all received some pay, and as there is an excellent canteen (dry) on board we can enjoy many little luxuries such as cake or tinned sausages, condensed milk and sardines. Prices are low so the almost convalescent Australian, broken only in body but not in spirit has a real good time. Beer and stout are also obtainable and needless to say even against the medical officer’s orders we all indulge in our little nightcap each evening.\n","125":"\n\nStill speeding southward for Egypt and hospital. Some of the worse cases are showing marked signs of improvement which must be very gratifying to the medical people considering the difficult conditions under which they had to work. The weather is beautifully fine and everybody is in the best of spirits talking about getting back to the front already.\n","126":"\n\nAt about 11 a.m. this morning, we once more sighted Egypt – Egypt of dusty memories – so our short Mediterranean cruise was in a few hours to come to conclusion. Shortly after dinner, we slowed down, the pilot came on board and we were soon within the breakwater picking our way slowly through the maze of ships with which this harbour seems to be perpetually blessed. After a great deal of manoevring, we got alongside. Everything was deadly quiet just like that other Sunday in January last, when the Second Expeditionary Force put in an appearance.\n\nOrders had been issued to disembark the patients as soon as possible. But there was a shocking amount of delay – no system, no method. Everyone gave orders but apparently nobody was keen on carrying out anybody else’s dictions. But with his superior air, the infantryman, a disciplined fighting unit contented himself with the remark: \"No explanation is needed – it’s only the A.M.C. \" However, they managed some of the worse cases on shore. Many were too bad to stand the train journey to Cairo so the Red Cross took them to an Alexandria hospital. One train load left for Cairo and the rest of us stayed on board.\n","127":"\n\nMore delay and confusion on the part of A.M.C. but by eleven o’clock I found myself hobbling down the gangway of the Lancaster Castle. Another half hour or so brought me to the special hospital train one hundred yards away. These hospital carriages painted white are very comfortable and the carrying capacity for each is twenty stretcher cases or ten stretchers with twenty patients who can walk. Attentive Indian orderlies from the Punjab, pretty Red Cross nurses, plenty of lemon squashes, beef tea, bread and cheese, and cigarettes, all combined to make our journey (which under ordinary circumstances would not have been very comfortable) of the pleasantest. \n\nThe run towards Cairo was fast and we were soon shunting on to the Heliopolis Electric Railway line which has of course the same gauge as the Egyptian State Railway. So we were able to run quite close to the No. 1 General Hospital and my old friend the beautiful Palace Hotel. Motor Cars took us the few hundred yards from the platform to the front entrance and after giving full (military) particulars of ourselves we were allotted to comfortable bed, a comfortable ward and a pretty nurse.\n","128":"\n\nMy first experience of military hospital. Just after daylight the night shift or night staff I think they call it, woke you up to take a bath if you are unable.\n","129":"\n\nThis afternoon the ward was straightened up (beds made to look more tidy and all that sort of thing) in anticipation of a visit from Sir Henry McMahon and his dame.\n","130":"\n\nYet again the prospect of a visit from the distinguished Sultan of Egypt, for the orderlies at an early hour, were busy preparing the hospital for the new order. Show the visitor an artificial state of things and he is sure to be favorably impressed, you know. At any rate the colored gentlemen turned up at 9.30 a.m. but the other members of the visiting party, General Maxwell failed to put in an appearance. So we saw nothing either of the English officials or the Turk.\n\nHowever as a sort of compensation a typewritten message was handed round from ward to ward, from Lord Kitchener.\n","131":"\n\nWe are now beginning to feel the dreary monotony and routine of a military hospital.\n","132":"\n\nMore boredom to-day, even although it is Saturday.\n","133":"\n\nStill jogging along the same old way – nothing to do and the whole day in which to perform the difficult task. Thank the Lord, there was no church \"parade\". Certainly a few stray Chaplains turned up and went through the words with their huge bundles of Churchy literature. At every bed they stop, and with apparently a great effort, manage to get out the words: \"Have a tract?\" in precisely the same tone as one would say \"Have an orange?\" Spiritual food is what they call their wowseristic productions, I expect.\n","134":"\n\nThis week starts with little prospects of getting out until the end of the week. One wound is giving a little trouble.\n","135":"\n\nAbsolutely nothing fresh to-day. Same old thing.\n","136":"\n\nEverything straightened up early this morning in anticipation of a visit from a person called Sir Edward Tree, a hospital specialist or inspector or organiser or something. And by Jove they want him badly, as the patients will declare.\n","137":"\n\nThis morning, the medical officer pronounced me quite fit enough to be transferred to what was formerly Luna Park at Heliopolis. This pleasure resort has been turned into a hospital. But it is really the stage between hospital and convalescent home.\n","138":"\n","139":"\n","140":"\n\nGiven the option of Communicating to-day, but did not have the energy necessary to get out of bed and have a brush up.\n","141":"\n\nCullen\n\nKavella\n","142":" Wolgen Rd\n\nMos\n\nR. Slee\n\nAnston\n\nNorth St.\n\nMarrickville\n\nGeo Schadel\n\nHillside\n\nElizabeth St.\n\nTighes Hill\n\nNewcastle\n","143":"\n","144":"\n\nBrigadier’s speech – general advance ordered – Ian Hamilton’s special order issued – \"Soldiers of the old army and of the new. Some of you have already won imperishable renown at our first landing, or have since built up our \nposition\n foothold upon the peninsula, yard by yard, with deeds of heroism and endurance. Others have arrived just in time to take part in our next great fight against Germany & Turkey, the would be oppressors of the rest of the human race.\n\nYou veterans are about to add fresh lustre to your arms. Happen what may, so much at least is certain.\n\nAs to you soldiers of the new formation, you are privileged indeed to have the chance vouchsafed to you of playing a decisive part in events which may hold the birth of a new and happier world. You stand for the great cause of freedom. In the hour of trial remember this, and the faith that\n","145":"\n\nis in you will bring you victoriously through.\n\nIan Hamilton, General\n\n- advance at night on left of positions, by march under fire – several bayonet charges.\n","146":"\n","147":" in – afterwards regain company – march 1½ miles – entrench at bivouac and after as supports.\n","148":"\n","149":"\n\nBack form Lemnos to Durrants Post.\n","150":"\n\nSnow for the first time – early fall – numerous cases of frost bite! Everything very quiet. Gallipoli will never spell success to Allies.\n","151":"\n\nFirst rumours of Evacuation. Are we on the eve of the most stupendous, colossal blunder in the annals of military history? Maybe, may be not. A week will tell, at any rate.\n\nDec. 17\n\nGen. Birdwood visits firing line.\n\nDec. 19th\n\n\"Der Tag\". Everything upside down. Waste beyond description. Many own crosses & friendly warring against the Teutons left with Johnny Turk. Also Dummies galore.\n\nFriday 4 June 1915\n\nDec. 19-20\n\nIt is a clear moonlight night. The fires are still burning in the incinerators and our trenches are manned by about 50 men from each Battalion. Turkish lines almost uncannily quiet. For our part an occasional burst of machine gun fire. Is it one huge hoax? Has the British Empire bought over the alleged decadent Ottoman Empire? I wonder.\n\nThe result of our eight months (all but a week) toil, hardships & fighting? The great crisis of Britain is approaching. Will we weather the storm or follow in the tracks of Rome or Athens? Certainly these are momentous times. We are living history.\n\nEmbarkation – a marvel of organisation. Everything orderly & quiet from \"Garrison\" changeover at Mudros to .\n","152":"\n","153":"\n","154":" months to-day since we left Australia – and ye Gods! what a twelve months! It seems like 12 years since we sailed from Port Melbourne hoping, as at least 90% of us hoped, to be back within six months. What a string of events since that memorable day! Xmas ’14 at sea on a troopship – the tropics – Egypt – the subtle charm of the East then the weary desert marches – preparations for the great Adventure – culminating in the meeting of the M.E.F. at Mudros. – April 25th – back in Egypt again, invalided –","155":" – Lemnos – Durrants Post again, & finally the Evacuation.\n\nAnd here we are at Lemnos again. Great have been our feats of arms – but with what military, political, economic or diplomatic victories? Certainly we have kept a huge Turkish Army occupied together with German & Austrian artillery and that’s about all. Politically Gallipoli spells Mud & Failure with a capital M & F\n\nrespectively, for the Allies, and the whole of Europe & Particularly the Balkans. The whole of the Dardanelles campaign is a remarkable example of colossal wastage of economic energy, & finally, Gallipoli has seriously harmed British & French diplomacy in the Near East. Who is to blame? Time alone will put a finger on the weak spot or spots. Meanwhile, Tommy & his relations at home foot the bill of physical discomfort & hardship in the one case, & unnecessary pain, anxiety & bereavement in the other.\n","156":"\n","157":" – everything very quiet – no excitement – time camp fire concert.\n","158":" – Holy Communion – prayers for my dear ones at home – very quiet Christmas – all our Xmas presents turn up at 7.30 in the evening.\n","159":" – Embark on \"Tunisian\" for Egypt. Hurrah!\n\nNew Year’s Eve – everything quiet, \n\nNew Year’s Day, everything quite.\n\nIsmalia – Moascar.\n","160":" – Review by Gen. Sir Archibald Murray.\n","161":"\n","162":" – Inspection by H.R.H. the Prince of Wales.\n","163":" – Left Tel-el-Kebir at 1600. Bivouac 5 to 6 miles out.\n","164":" – Starting at 0500 reach Mahsamah at 0800. Leave at 1500 and arrive at Moascar at 0900 on","165":" All troops very much fatigued.\n","166":" – Leave for Serapeum & cross canal from Africa to Asia.\n","167":" to","168":" – Recuperation after long march. Bathing in the Canal. On","169":" we leave for advance trenches & reach \"Railhead\".\n","170":" – In the desert. Post No. 3 occupied by B Coy, 45th Batt., part of sub-section commanded by Gen. Cox.\n\n"}}