{"Document Name":{"0":"Diary_0376","1":"Diary_0376","2":"Diary_0376","3":"Diary_0376","4":"Diary_0376","5":"Diary_0376","6":"Diary_0376","7":"Diary_0376","8":"Diary_0376","9":"Diary_0376","10":"Diary_0376","11":"Diary_0376","12":"Diary_0376","13":"Diary_0376","14":"Diary_0376","15":"Diary_0376","16":"Diary_0376","17":"Diary_0376","18":"Diary_0376","19":"Diary_0376","20":"Diary_0376","21":"Diary_0376","22":"Diary_0376","23":"Diary_0376","24":"Diary_0376","25":"Diary_0376","26":"Diary_0376","27":"Diary_0376","28":"Diary_0376","29":"Diary_0376","30":"Diary_0376","31":"Diary_0376","32":"Diary_0376","33":"Diary_0376","34":"Diary_0376","35":"Diary_0376","36":"Diary_0376","37":"Diary_0376","38":"Diary_0376","39":"Diary_0376","40":"Diary_0376","41":"Diary_0376","42":"Diary_0376","43":"Diary_0376","44":"Diary_0376","45":"Diary_0376","46":"Diary_0376","47":"Diary_0376","48":"Diary_0376","49":"Diary_0376","50":"Diary_0376","51":"Diary_0376","52":"Diary_0376","53":"Diary_0376","54":"Diary_0376","55":"Diary_0376","56":"Diary_0376","57":"Diary_0376","58":"Diary_0376","59":"Diary_0376","60":"Diary_0376","61":"Diary_0376","62":"Diary_0376","63":"Diary_0376","64":"Diary_0376","65":"Diary_0376","66":"Diary_0376","67":"Diary_0376","68":"Diary_0376","69":"Diary_0376","70":"Diary_0376","71":"Diary_0376","72":"Diary_0376","73":"Diary_0376","74":"Diary_0376","75":"Diary_0376","76":"Diary_0376","77":"Diary_0376","78":"Diary_0376","79":"Diary_0376","80":"Diary_0376","81":"Diary_0376","82":"Diary_0376","83":"Diary_0376","84":"Diary_0376","85":"Diary_0376","86":"Diary_0376","87":"Diary_0376","88":"Diary_0376","89":"Diary_0376","90":"Diary_0376","91":"Diary_0376","92":"Diary_0376","93":"Diary_0376","94":"Diary_0376","95":"Diary_0376","96":"Diary_0376","97":"Diary_0376","98":"Diary_0376","99":"Diary_0376","100":"Diary_0376","101":"Diary_0376"},"Date":{"0":"unknown","1":1795.0,"2":1796.0,"3":1797.0,"4":1798.0,"5":1799.0,"6":1800.0,"7":1801.0,"8":1802.0,"9":1803.0,"10":1804.0,"11":1805.0,"12":1806.0,"13":1807.0,"14":1808.0,"15":1809.0,"16":1810.0,"17":1811.0,"18":1812.0,"19":1813.0,"20":1814.0,"21":1815.0,"22":1816.0,"23":1817.0,"24":1818.0,"25":1819.0,"26":1820.0,"27":1821.0,"28":1822.0,"29":1827.0,"30":1828.0,"31":1829.0,"32":1830.0,"33":1831.0,"34":1832.0,"35":1833.0,"36":1834.0,"37":1835.0,"38":1836.0,"39":1837.0,"40":1838.0,"41":1840.0,"42":1841.0,"43":1842.0,"44":1843.0,"45":1844.0,"46":1845.0,"47":1846.0,"48":1847.0,"49":1848.0,"50":1849.0,"51":1850.0,"52":1851.0,"53":1852.0,"54":1853.0,"55":1854.0,"56":1855.0,"57":1856.0,"58":1857.0,"59":1858.0,"60":1859.0,"61":1860.0,"62":1861.0,"63":1862.0,"64":1863.0,"65":1864.0,"66":1865.0,"67":1866.0,"68":1867.0,"69":1868.0,"70":1869.0,"71":1870.0,"72":1871.0,"73":1872.0,"74":1873.0,"75":1874.0,"76":1875.0,"77":1876.0,"78":1877.0,"79":1878.0,"80":1879.0,"81":1880.0,"82":1881.0,"83":1882.0,"84":1883.0,"85":1886.0,"86":1887.0,"87":1888.0,"88":1889.0,"89":1890.0,"90":1891.0,"91":1892.0,"92":1893.0,"93":1894.0,"94":1895.0,"95":1896.0,"96":1897.0,"97":1898.0,"98":1899.0,"99":1900.0,"100":1901.0,"101":1933.0},"Entry":{"0":"\n\n","1":"\n\nGot up at 5.30 am, had brekker took tube to Victoria & managed to book a job on the train. Made me miss the morning boat. Picked Woodhams up & we then went for brekker. Wandered around Folkstone, caught 2 nurses going back to hospital to sleep. Had a talk with them & then went to lunch. Got boat at 3 & crossed over. Met 2 sisters I knew. Reported to MLO at Boulogne. He gave us a movement order for Le Havre. Then saw the R.T.O. & told him we had to Etaples to report & he gave us a ticket for Etaples. Arrived at Etaples & went up to the club & met the girls we knew. Had dinner there. Met the Ass. Adjt. of the 3rd M.B.D & had a talk with him. Went to the Board Depot to sleep.\n","2":"\n\nReported at the Depot Office & they gave us warrant for Le Havre. Stayed round the club all day & got the train at 9.30 pm. Should have got one at 8.20 but it was late. Got to Abbeville at 11.30 pm & got met. Woodhams went on to Le Havre. Went round to the A.P.M & managed to get a chit to stay at the club. Had to tell the A.P.M that somebody else had my movement order.\n","3":"\n\nWaited for a lorry till 12 noon & then went to the club for lunch. Met Phipson & we had lunch together. Managed to get a ride out in a car to Martinville & from there walked to & reported. Had to ring the Colonel up & find out where I was going. Am still in ‘B’ Coy. Met all the Coy people. (McGowan, Scriven, The Major, Perkins & Capt. Jackson.) The boys seemed to be pleased to see me. Went for a stroll after tea with Mac.\n","4":"\n\nWent out on range for practice. Only 30 yards range. Shooting wasn’t bad. Tried my small shooter & it was good. Do me. Went over to ‘A’ Coy & saw them all. Ross Knuckey came back from Paris leave, Duke came in to have a look at us from his school. Wrote a couple of letters.\n","5":"\n\nMajor took the company parade & we . Teale fought in the afternoon & won his fight in 1 ½ minutes. Took on Orderly Officer at 4 pm (1600) after having a hot bath in a captured Fritz bath. Was goods.\n\nThe big dinner of the Battn officers took place at 7.30 & was goods. Gen. Foote was there also Greenway. Some (nearly all) of the officers got drunk & played up, but for all that we had a good time.\n","6":"\n\nHad very little to do all day. Inspected the guard & the billets & played football in the afternoon. Am Coach of the battn. Team. Put in an application for the Flying Corp. got parcel from Harry Brevett. Played football & the first team lost.\n","7":"\n\nDrill from 9 am till 1 pm (0900 to 1300). Teale fought again & won in the first round. Changed my billet & now live alongside the mess. Played cards. Armistice with Austria at 3 pm begun.\n","8":"\n\nTook the football team out for a run. It rained all day & made everyone miserable. went to a court martial.. rained all day.\n","9":"\n\nHad singing class all the morning on account of rain. Went to Oisement for a walk in the rain. Terms of armistice in paper today. Very stiff too for Austria. Rained all day & night.\n\nMajor came to light with the news that the Colonel goes on leave on the 20th. Major McClean goes as C.O. 4th Pioneers & that he goes as C.O. to the Battn while the Colonel is away & also the Duke takes on O.C. of the Company. Very good news this.\n","10":"\n\nGot my outfit allowance put in my pay book. Scriven McGowan & self left for Abbeville at 7 am per wagon. Went to the club for brekker & had a real good one. Shopped till 12 (noon) & then went to the hospital & saw Mary. Went back to the club & had lunch & then met the girls & went to their club for tea. Left them at 7 pm & rushed back to the square to get a lorry. Just managed to get it & had a ride as far as St. Maxent & walked from there home. My boots hurt some & gave me some blisters.\n\nOur shopping consisted of buying vegetables & eatables at the market. Gee I was a scream. Carried two big bags of vegetables up the main street to the club. Got the wagon to bring them back. The French people in Abbeville gave us the news that “la guerre fini\". Do me if it is true.\n","11":"\n\nWas clear for awhile but rained in the afternoon. Went over & saw Teale fight. He won again in half a round. Gee he landed the other boy some beauts. No good to me. Scriv. & I applied for leave & got it. I go to Abbeville tomorrow. The reason is that we expect to move again on Monday & possibly Sunday. Some very big advances have taken place the last two days. \n","12":"\n\nGot leave for Abbeville & after taking the platoon for an hour Scriven & I left for Abbeville. Walked from here to St. Maxent & got a lift in a Ford to Abb. Went to ordnance & bought a pair of boots, a scarf & some polish & stuff. Then went up to No 2 & saw Mary. She was going to a concert with a Captain but put it off as we went for a walk (4 of us) & caught a lorry to St. Riquier. Had a look at the church. Gee it is good. Very nice inside. Had omelette for tea & then we started for home. Scriv & Miss Kearney got in front & Mary & I in a car in rear. It had its front wheels lifted. Was goods. Did me.\n\nLeft the girls at 4.50 & then went up to No 3 & saw Miss Murdoch & Sisters Nicholls & Vicars Forte. Then went back to No 2 & saw O’Connell. Found out that old Dad Hutton had only left that morning for Le Havre. Was real stiff ‘cos I could have seen him on Thursday. Managed to get a lorry back at 9 pm & got out at St. Maxent & walked from there home.\n","13":"\n\nChurch parade this morning. Good sermon but it was too long. Got our orders to move. We entrain at Pont Remy & detrain at Epehy (north of Roisel). Lovely day today. Have seen the sun now for 2 whole days. Great. Orders cancelled in the afternoon. Went to Oisement to get a paper.\n\nKaiser abdicates\n. Do us. Met Bruce Sloan, Charlie Thomas, Beck & Mayne. They told me poor old Alf had been killed. Gee that is bad. Hope it isn’t true. Came back & wrote 15 letters. Nice day all day. Hope to be able to go into Abbeville tomorrow.\n","14":"\n\nThe day of days\n. Started the day by going on parade & after having an hour of it we got the glorious news that hostilities cease at 11 am. Marvellous. We cheered to cancel order. Dismissed the men & had to have a general muster so that the Major could tell them all about it. Was too late to go into Abbeville so played football & treed my revolver.\n\nGot our orders to move again. Do me. Hope we get some decent work to do. Major got his substantive rank of Major. Whitfield got a captaincy. Brown came back tonight. Started to rain. Just as we were going to bed we got word that the move was cancelled & that there would be a thanksgiving service tomorrow.\n","15":"\n\nChurch parade at 11 am this morning. Only parade we had. We all polished our leather \nboots\n belts. Played football (rugby) in the afternoon.\n","16":"\n\nWent to in the morning. Went in the Amb. To 8th F.A. at Le Translay & . No work done that day so hoofed it over to see the 32nd Battn. at . Nobody home so walked back to the main road & then managed to pick up a lorry all the way home. We all (officers) had our photos taken in the afternoon.\n\nThursday. 14.11.18.\n\nMac, Scriv & I went into Abbeville at 7.30 am. Went to the market & bought our vegetables & then did our shopping. Then went to the hospital & saw Mary & Sister Highman. Also saw Ted Wauhope (in hosp) & quite a big gang down the street. Met Mary at 5 & we walked. Left her at 7 & went back to the boys. They were having dinner with Lt Col McLean (had only that day been promoted). They had plenty of fizz. After dinner had to look after them. We got an ambulance to take us as far as St Maxent. Walked the rest of the way. Had to wait 2 ½ hours for the ride tho & got home at 12.30.\n\nFriday. 15.11.18.\n\nMajor left last night for H.Q. & is now 2nd in Command. Major McLean was promoted & goes to the 4th Pioneers. Did some shopping for the mess at our canteen in the morning. Watched our boys play football (soccer) in the afternoon against the","17":" F. Amb & they won easily (8 goals to nil). Went to tea with Palmer & then came back to this mess & had something to eat. Had the Colonel, Adjt & Major Wilkie over to dinner. Gave them a decent feed.\n","18":"\n\nReal decent sunny weather now. Always a frost on the ground tho. & the mud is frozen hard. Very hard to play football on. Went to H.Q & fixed up our ground for this afternoon. Our Aus. Rule team got a bye today. The officers played the NCO’s at rugby. The NCO’s won by 8 points to nil. I played but didn’t do too much. Went to a concert\n\nat Oisement. Jack Tiller was doing the mimic act again. He came down & had a talk to me while the show was going.\n\nSunday. 17.11.18.\n\nThe battalion went to a service at of the 8th Brigade. Gen. Hobbs spoke to us & told us we were going to Germany during the next week. Would very likely go by train as far as the German & Belgian border but we had to be prepared to march. Would billet in Belgium for awhile & then march to some German towns. Trips would be arranged for us to visit the historic places on the Rhine. Cameras could be taken. Immediately wired to Marie for mine. 9 Colonial Divisions are going out of 32 English Divisions","19":" &","20":" Army). Wrote a lot of letters. \n","21":"\n\nHad a parade & then got bikes & Scriv, Brown & I rode into Abbeville. Got a tow from a motor lorry & went at some pace. Went to ordnance & bought a pair of gum boots. Saw Mary & she took Scriv. & I to tea at her club while Brown had a hair cut. Rode back & gee it is some ride. Prefer walking & lorry hopping I think. Have a parade for the colonel tomorrow. He goes on his 75 days leave then. Played football in the afternoon & managed to get my toes warm for a while.\n","22":"\n\nThe Colonel had a parade this morning & said that he was going on leave today & would not see all the boys again but hoped they would fare well & that if any of them ever saw him they were to stop him & tell them how they were etc. Got 20 letters but they were a very mixed lot. Some were from Blighty & should have had them before I went on leave there. Others were from Aussie dated July & August. Wrote some more letters. Had to have a kick in the afternoon on account of the cold.\n","23":"\n\nUp at 7.05 & on parade at 8.30. Marched \n\nover to the rifle range for the Assault at Arms. The inspection was OK. Got 3rd place but the drill for the Coy was cruel. Capt Jackson gave wrong commands & made a terrible mess of things. \nGave\n for General Salute Present Arms. He gave Company will present arms for General Inspection. Present Arms. He then marched us back into close col. alright but then he got mixed again & gave us Coy will move to the left in fours. Form fours left & just left us there. For one thing we should have been going to the right & another he should have given us Slope Arms first. The General (Gen Hobbs) passed a remark to Major Wilkinson that if we had had a good Coy Commander we would have done very well. Jackson wasn’t a bit ashamed of himself after the show either. In all the rest of the events we did very well & held our own easily. Wrote more letters. Gee I’ve written some lately too.\n","24":"\n\nHad the footballers out in the morning & fixed up the ground. Played the Div. Sigs. in the afternoon & they ran all round us. They played well together while my boys were worse than school boys. Scores were about 10.2 to 4.4. We easily made up in the 3rd quarter for awhile. Managed to get one goal but played very poorly. The umpire was to blame ‘cos he let the game get too rough. Was not strict enough & allowed things to be that he should have been stopped. Got my wind knocked out in the last quarter. Went to ‘C’ Coy for dinner with Bill Buchan & John Casey. Got 19 letters.\n","25":"\n\nSlept in till 11 & then had a bath & got up. Had a kick or two to get warm. Went for a walk into Oisement in the afternoon & wore new boots & got a lovely blister. Wrote more letters & received one more making a total of 40 in 4 nights. Some . Made supper of Bovril & biscuits. Was goods.\n","26":"\n\nHad a good sleep in. Had a parade from 1000 to 1045. Paraded again at 1230 & moved to Cerisy & the battalion moved thro. Ramburelles to a big field outside to a Brigade Review & March Past (8th Brigade). The General was Gen. Hobbs & the show was very good indeed. Had a supper tonight on Café au Lait & biscuits.\n","27":"\n\nLoafed all the morning. Got orders at 1 pm to go to Pont Remy as billeting officer for the Coy. Went in by H.Q motor car. Passed thro Abbeville. Went back that way too & had tea there. Had a talk with a G.H.Q. Major (V.C man too). He spoke very well of the Aussies. The two officers I went in with had to arrange for trains etc with the R.T.O. They are the entraining officers for the Division & have to 22 trains away 7 from Abbeville & 15 from Pont Remy. They are Capts Chapman & Keys & are very nice fellows. \n\nGot back at 6.30 pm & we got things ready. We go out as a wading party & the other 3 Companies follow on Wednesday when we all entrain for Bertry. I move out at 8 am in the morning. Started raining tonight. Spose it will set in now. Madam gave us a fowl tonight & also cooked it for us. We will have it cold for lunch tomorrow. Started to get my gear ready after dinner.\n\nMonday. 25.11.18\n\nA month today & we’re there. Left Fresnes Tilloloy at 8.30 am & got to Pont Remy at 11.10 am. Passed thro Marquenneville, Limeux, Bailleul, Bellefontaine & Douce. Saw the area Commandant & got the billets fixed. The company arrived about 12.45 pm & we gave them lunch & then put them into their billets. Two officers are staying in one hotel, 2 in another & the skipper staying in a hotel where we are Messing. \n\nThis billeting stunt will do me. Two nice girls at the hotel Scriven & I are at. Mac. & Brown are at the one next door. Rooms are decent. Rained during the night. My photos arrived & they’re cruel.\n\nTuesday. 26.11.18\n\nLt Cunningham & Crack arrived from ‘D’ Coy bringing 50 men. They are to help us. We start work tonight at 1.30 & work till 9.30. We have to load the wagons etc on to the trains. Each party has to do 2 trains & Brown & I caught this shift for tonight & tomorrow night. Capt Chapman turned up so we have 8 officers for mess now. Capt Keys turns up tomorrow so we’ll be set then. It’s raining again tonight & I’m very sleepy. Wrote 7 letters today & tonight.\n\nWednesday. 27.11.18\n\nSlept on the floor of the mess till 1.30 am & then rushed out to work. Started loading at 2.30 am. & gee it is some job. All mud & slush & some of the wagons are heavy. Started off by loading the cookers & then on to G.S. wagons & limbers. This train (the 8th) was 2 ½ hours late on account of the froggies. The transport came an hour late but we managed to catch ½ an hour up, but the stupid old froggies kept the train late. The second train was done in the light & it only took us 1 ½ hours. This was very heavy work too as there was Filled Amb. Wagons & very heavy GS. Waggons. On the first train we could only get one light (acetylene) & we couldn’t get that till we had nearly finished. Finished work at 10.10 & came over for brekker. Went to bed then & was called at 3.30. Came over & had a bath & it was goods. Do me. Had tea, wrote some letters. Received two more too. Had dinner & went to bed till 1 am.\n\nThursday. 28.11.18\n\nDidn’t get up till 3 am & had to wait\n\ntill 3.30 till the train came in & then started loading. Got it finished at 4.55 so did well. It rained some too & of course it was extra muddy. ‘D’ Coy officer turned us down. They only did one train & then knocked off & we had to do their other one. It is now 11 am & we are still waiting for our first. The train came in at noon & we finished loading it at 1 pm & sent the men to lunch. Of course it rained again. Kelly & Roberts were half an hour late so we made them do an extra half hour. Mac & Scriven’s train (their first didn’t turn up till about 15.30 & it left at 8.30 pm King George’s train to Paris went thro here at 11.20 am. McGowan, Bill Cunningham & Jackson got their MC’s for Bellecourt stunt. Am very pleased that Mac got one cos he has earned it often. Had quite a lot of visitors today & our rations got hit to . We need a conjuror for a cook & I think we have it.\n\n29.11.18\n\nGot up at 8.30 am & went to brekker. Had to load the 19th & 20th trains & entrain on the 20th. The 19th was for the 15th F. Coy Engrs & their position took some loading. Had to split the train so that we could get the pontoons on at the end & have a straight run. Put the men in their train first & then put them on to loading it. Another field coy (the","28":" this time). This took us 2 hours altogether. Said goodbye to Madam & the mademoiselles at the hotel & then got on to the train ourselves. It didn’t leave till 11.30 pm.\n","29":"\n\nGee it’s cold, couldn’t sleep much ‘cos my toes were nearly frozen. At daybreak I put on my boots & went for a walk to get warm. We were just past Chartres then. Managed to dig up a fire pot & got it going. Put it in the carriage & wasn’t cold any more. Went thro. Peronne, Fricourt, Rousillon, Marcoing, very near Cambrai (outskirts of it). Got out when we stopped & had a walk\n\n& when the opportunity came we went into the villages. Gee some of the places were knocked around. Specially as far up as Cambrai. Nearly all houses were practically razed to the ground & very few had roofs on. On the train our cook (Beaton) did very well indeed. Managed somehow to give us something to eat. For one meal he gave us steak. Was goods too. Five of us got out on to the front of the carriage & sang ourselves hoarse. Heavy fog came up at 4.30 so our sight seeing was finished. Eventually we reached Caudry. Stayed awhile & then moved on to Bertry arriving there at 11 pm. Everybody was grumpy. Capt. Jackson complained when he was told we had to","30":" kilos. & immediately went & saw the Town Major & managed to get billets for the rest of the night. No 8 wouldn’t get out of their truck for some time but we got ‘em out ok & when the billeting was announced went as quiet as a lamb. Just as well too, didn’t want any trouble. Got to bed myself at 2 am. Had to pack some of our mess gear in a wagon so that the boys could get more sleep.\n","31":"\n\nHad brekker at the cooker. Piece of bacon in one hand & a slice of bread in the other. Started from Bertry at 10 am & marched thro Maurois. Honnechy, Escaufort, St Souplet, L’Abre de Guise & Mazinghein to Rejet de Beaulieu. The whole of the Battn. are here. The place is much knocked about by British shell fire. Much the same at Bertry although very few are hit there. The billet we had there (Bertry) had been occupied by Bosche officers. They had treated the people badly there, specially a girl \nthere\n. She will soon be a Mother & isn’t married yet. Bad luck for the kid. The old man & old lady were very pleased to see us when we went down for brekker as Rept our billet is with the Mairee. He is an old man & his house is very poor. We have 2 beds for 4 of us. We double bunked. We also used it as a mess. Had a room adjoining ours & used that as a kitchen & let the dingbats sleep there. So long as we have a room is the main thing.\n","32":"\n\nMoved from Rejet to Bois de L’Abbaye. Took a wrong turning but it didn’t put us out much. This place is very knocked about. B Coy is at one side. Part of D Coy are near us. The other half are miles away. ‘A’ Coy are in La Groise & ‘C’ Coy in part of Catillon. The billets are dry that’s the main thing. Scriven, McGowan & I are in one room & only have one bed. Jackson & Brown have a room but have two beds. Nearly all the people here hid in cellars when Fritz did a bunk. The mess is ok. ‘D’ Coy haven’t one so we made a joint mess. Should be ok. Played cards & made a bed of straw for Mac & got a bunk for myself.\n","33":"\n\nHad a muster parade & then Mac Scriv & I went for a walk to Catillon. Had a look at C Coy people. Nothing much to see in the place. Old Fritz ratted the place completely. He took everything but 2 accumulators from big power plant. It rained a bit & we all got more or less wet. My camera arrived ok with 2 spools. Do me.\n","34":"\n\nStarted at 9 am to salve. As usual it rained & made the work monotonous instead of interesting. Came across a lot of minesweepers & flammenwerfers in position behind a hedge, \nwith\n all set & lined on to the Canal. Gee they must have made things for awhile. Was very interesting. Got quite a lot of Machine Guns. No trenches about at all. The fighting was all hedge to hedge. Not many casualties on either side thank goodness, by the look of things. Loafed around in the afternoon.\n","35":"\n\nWent in with a G.S. wagon to Le Cateau for mess gear. Passed thro Catillon & Bazuel to get there. Catillon is knocked about a bit. The church is napoo , only \n\nhalf of it standing, all along to Bazuel. The ground has been much cut up by shells. Saw 3 (partly) planes on the side of the road. They had crashed some. Fritz had a railway along the road & had blown it up all along the way. Bazuel is very much cut up, but as for Le Cateau, well at the present time it is most interesting. Saw lorry loads of civilians on the road returning to their homes & in the town itself they were standing at their doors waiting for the keys. Wish I had taken my camera. The place has been knocked about a lot & I think mostly by Fritz. All the homes look as if they have been ratted. Couldn’t get anything for the mess ‘cos the canteens had all moved to Avesnes. The padre came to dinner & gave us some gramophone afterwards. Was very nice. Jackson went on Paris leave. Left Brown in charge.\n","36":"\n\nMore Salvage today. Saw the sun tho & took some snaps. Goods. We salved a ’77 (whiz bang) & a dead fritz & a lot of pontoon gear. No 8 platoon played rest of the company rugby this afternoon & won easily 11 points to nil. Got some Aussie mail. Do me. Answered quite a lot of them. Wrote to Stewart Dawson, & Mappen & Webb, also to Jimmy Hibbard & Gibbs Bright & Coy about positions. Mac is sick today.\n","37":"\n\nWrote letters all the morning. Officers played the NCO’s at rugby & were beaten 5 points to nil. Very good game. Mac stayed in bed all day. Had the doctor to him. Getting along ok tho. Took the family photograph today.\n","38":"\n\nChurch parade this morning. Real glorious day all day. Do me. Played cards all the afternoon & evening.\n","39":"\n\nMac still sick. Much better tho. Will be up tomorrow. Both he & I had brekker in bed. Was too lazy to get up. Rained in the morning & was nice & sunny in the afternoon. Went for a stroll with Scriv. & then came back to Mac & played cards.\n","40":"\n\nBoth Scriv & I had brekker in bed. Brown came down & we had the graph going till 11 am when we got up. Beastly wet again. Played cards & read all day & evening.\n","41":"\n\nWork today so got up for brekker. Had to bring in some shells. Heavy rain all day. Went to HQ. had a hair cut & then up to the canteen. Couldn’t get anything cos they don’t get any stock till 6.30 or thereabouts. Gee this ground is absolutely soaking. Jus tas well the ‘froggies’ wear clogs. Our boots get wet thro. every day.\n\nJust finished playing bridge. Had Palmer down & Mac & I beat Scriv & he. Mac finished up by getting it over in no trumps. Palmer & Scriv called 2 hearts & Mac called two no trumps & didn’t hold a heart in his hand. Gee it’s a scream.\n","42":"\n\nBit cloudy today but very little rain. Had a meeting for games etc for the coy. when we get to Hestrud. Played cards in the afternoon. Gee this life is monotonous. Wish we could visit some decent places & take some interest in things. As it is\n\nwe have nothing to do & so get lazy. Tonight the canteen managed to get a little in. about time too. Got some sauce, fruit & tinned fish. Will keep things going on a little. Palmer came down & had a hand. Had cocoa & milk for supper.\n","43":"\n\nBrekker in bed again. Am some expert at this now. Went over to Catillon in the afternoon & saw our beaten team play a Tommy team (Motor Transport & Tunnellers) at Soccer. We won 3 to 1. it was a good game. At last I’ve got a couple of letters. Played cards & then answered them.\n","44":"\n\nRained in the morning. Had a parade & then an officers meeting at the transport lines was about educational & sports. No 8 played rest of the company at Australian rules & beat them easily notwithstanding that only Holmes & I knew anything about the game. Gray & his brother played anywhere.\n","45":"\n\nNo church parade today. Had a full marching order parade to get ready for our march. Sent Xmas cards away.\n","46":"\n\nThree of us (Mac Scriv & i) had brekker in bed. Did nothing all day ‘cept play cards. The Major came round to see us so we asked him to tea. Went into the mess & found we hadn’t anything to eat or drink. Gee it was funny. I laughed some & had to apologize to the Major for the state of the mess. After this we went back home. He went back to his own mess for tea. About half an hour after two parcels arrived, one each for Mac & Scriv. Needless to say we ate some. Managed to get 15 letters when the mail came.\n","47":"\n\nReveille 6.30 am. Scriv got up grumpy & when getting his towel broke the lamp glass.\n\nMac. put some water in the dish, turned round & did something, then threw the water out. As soon as he had done this it suddenly dawned on him that he hadn’t washed. This put him in a good humor. \n\nVery heavy rain all night & all the morning. Scriv got annoyed again ‘cos the door was being opened all the time. He gave us quite a lot of amusement altogether. We moved from Bois at 8.30 am & it was drizzling. Whole of the 14th Brigade were on the march. We are the last of the line. Passed thro Prisches & stayed the night at Cartignies. Arrived there at 1 pm. Billets are fair. Beaton put on a good dinner for us.\n","48":"\n\nStarted the march at 9.45 am. “B\" Coy headed the battalion & No 8 headed the Coy. Passed thro Avesnes. Place is knocked a bit but mostly from bombs & things. Passed an train. Had been blown up by Fritz ‘cos he couldn’t get it away. Gee there was some mess too. Shells everywhere. Some Fritz prisoners passed us, while we were halted \nnear\n outside Avesnes. The French women jeered at them & some men made as if to jab a bayonet into them. Made us laugh some. While here at this halt a very heavy hail storm came to light. Railway & bridges were blown about some. Moved on & came to Semeries where we stayed the night. The billets here are very good. Bonny big stove & the kitchen was spotlessly clean. We all went to bed early. Mac & Scriv came into my room & we sang for half an hour or so before going to sleep.\n","49":"\n\nVery funny old morning. Was cold last night but slept warm. Looks as if it will rain but since getting\n\nup it hasn’t. rained some last night. Left Semeries at 9.35 am. Passed thro Solre le Chateau (Div. H.Q.) & came to Hestrud on the Belgian border. Coming along saw a grave with a cross on showing where two S. Africans had been buried. They were killed on the 10th Nov. real bad luck. The war finished round these parts.\n\nBillets for the men are cruel. Are ok for summer but no good for winter. The batt. are the same right thro. Our billets are fair although Mac is on the floor. Scriv & I are together. Had a fire & played cards till 9 & then went to bed. Gee it’s some cold outside too.\n","50":"\n\nThe Major went & saw Divvy about our billets & one Coy is to go to & the rest of the batt. to stay here. Moved No 8 to another place & they should be O.K. now. It’s going to be icy cold here. Started filling in the Demobilization forms today. The Major went round & had a look at the billets & now has altered everything. No 8 have to move again. Saw them & they refused to go. Think as they do. “D\" Coy are to move in but because No 8 refused to get out they refused to come over. Sent Brown up to see things for himself. A man from every platoon in the Batt paraded to the Major & stated their case about the billets. Very sensible of them. Answered 7 letters.\n","51":"\n\nChurch parade this morning on Belgian territory. Major came there & announced that he was going straight to Division to see about new billets & would see the platoon reps at 4 pm & tell them all he knew. He went & was taken to Beaurieux. The billets there so he says are good & we move to them tomorrow. They are about 5 kilos from\n\nhere. Hope they are good else there will be some argument. Mac came up tonight & we had some bridge. Then wrote some more letters.\n","52":"\n\nAn advance party moved out early to the new village & we moved out at 11 am. Needless to state it rained all the time. Very heavy too. We were wet some long before we started on the march. The name of the village is Beaurieux & is about ½ an hour’s walking from Hestrud & also about the same from Solre le Chateau. The billets here are only as good as at Hestrud for the men but for the officers they are cruel. ‘B’ Coy can’t get a mess at all. It’s taken us all our time to get billeted even. Put the wind up the Major about the billets. Was very funny. Our mess is cruel now. Have one room to cook in, eat in & for the cook to sleep in. Not a bit of use at all. Worried everybody all day about it anyway.\n","53":"\n\nReal bonny day. Scriv & I got a billet. The old lady here had been carried to Cologne & made to work there while the Fritz used her home. Tried hard to get it for a mess but failed ‘cos the 1st M.G crowd had played up. Still haven’t a mess. Have walked round all the village & can’t find one. Tonight we moved (borrowed from our house here) a stove to two rooms above the school & we are going to mess there. The men are going to have their Xmas dinner tomorrow & we have been moving about it all day. It is going to be by platoons ‘cos we can’t get a big enough place for the whole Coy. Should be goodo tho. Started to snow at 6.30 & was going at 10.30. Gave No 8 a bottle of whiskey for Xmas. Got a letter from Marie. Major Bill Hammond came up for a game of bridge. After \n\nthey left I answered it.\n","54":"\n\nXmas Day. Out of bed at 9 am. Had a church parade at 10.30 & gee it was cold ‘cos the snow was thawing. Saw quite a lot of the sun today. The dinner was goods. The NCO’s & myself waited on the men & then had some ourselves. ‘D’ Coy had a company affair but we had ours by platoons. The place had been a stable but had been cleaned out thoroughly. The decorations were very fair indeed. The meal consisted of, turkey, ham, beef, pudding, tinned fruit jelly & custard, with lollies, chocolate, pea nuts, & tons of good cake. Besides all this each man got a parcel from the Comforts fund. Most were from Kalgoorlie, but quite a lot were from Sydney. Some of the parcels had a pipe & tobacco. Most had sox, chewing gum, cigarettes & lollies with a little tinned stuff. (Sardines tongues etc.) the whole meal was good. My parcel was from Sydney.\n\nAt 4 p.m. all the officers went to the Chateau at the invitation of the Count to afternoon tea. Gee he is a decent fellow & we had a good time there. His wife is in Paris but was expected home today. At the Chateau are his father & mother in law & his two daughters. The wife & the rest stayed there when Fritz held this place. She had been sentenced to 2 years imprisonment for different things but got off with 2 days imprisonment. The Bosche tried to blow his safe in but failed. They had all their silver stored there. His father in law had been a hostage & had been taken to all the big towns, Valenciennes, Tournai, Leus, Maubeuge, Charleroi & such like.\n\nThe youngest child (about 5) doesn’t know her father yet but does the same to him as she does to us. The elder one (about 12) does tho & is a bonny kid. The old man sat at our table & was very funny. Tried to keep our cups & plates full all the time. The Count has been in America instructing in tactics. He had 4 English officers & 4 french under him. Says the Yanks talked too much & wouldn’t be shown till they made mistakes. Took things far too easy.\n\nMoved our mess to the top of the school room. Now have two rooms, about time too. At the other place we had one room in which to eat & cook in & for the cook to sleep. No good at all. Wrote two letters. One thanking for the parcel. Am feeling very full. Old lady brought us in two nice cups of cocoa. \n","55":"\n\nWet & cold all day. Couldn’t find a bike so got the horse & rode to Sars Poteries to the","56":" Field Amb. to the dentist. He put in a temporary dressing for about a week. A French girl had her tooth pulled while I was there. Got some wet in the feet. Got two parcels. One from Marie & one from Harry. Nice chocs & shortbread from Harry & a bonny diary & 4 spools from Marie. Have\n\ngeneral parade at Solre tomorrow to see the Prince of Wales decorate some of our people. Sgt Gray gets his M.S.M. The parade was cancelled but the investiture was on. The rain caused the trouble.\n","57":"\n\nGot up early for the parade. Didn’t know it was off till the last minute. Had a rifle inspection & then dismissed them all. Mac is now O.C. of the Coy ‘cos Brown has gone on leave. Scriv has dicked for Town Major ‘cos Edgley has gone on Paris leave. Am 2nd in command now. Had a sports meeting in the afternoon. Read & played cards in the evening & went to bed early.\n","58":"\n\nFooled again this morning. Got up & dressed for church parade but it crashed. Did some running around fixing things up about the sports etc. Steve & I put in for Paris leave. It goes in tomorrow. Wrote to 8 jewellers re position. Put in the whole afternoon writing of course it rained all day. Something unusual now if it doesn’t. Got an intro to the Countess this morning. Was marching round their ground & they came out to go to church. Played cards in the night after the dinner. Gee it was some dinner too. Had 7 courses & it was good, do me. The fowl in particular being exceptionally good.\n","59":"\n\nMade a court in the morning & had a game. Got Gray out of going to Paris. Umpired for a scratch game in the afternoon. The playing was much better than when we were at Crecy. Peter O’Meara was playing. Gray was to go to London to play football & turned it down as well. Had to see the Major & fix it up. No 8 have to go to Williers tomorrow & stay there for 2 or 3 days & \n\nrepair a road. Am taking 23 down.\n","60":"\n\nLeft in motor lorry at 10 am & arrived at 2p.m. Had to wait at Liessies for the Town Major. Had an argument with the driver of the lorry ‘cos he wouldn’t drive us on. Said he couldn’t turn. Eventually got him to move. The Major & Duke came out & saw us while the argument was on. The road is badly blown up. Right at the foot of two hills Fritz blew the culvert up & made a good job of it. Managed to get decent billets for the platoon. Had 2 tries for my own. First the old lady & the girl were very much taken up with some digger who had taken a room there, so didn’t worry them. Then I was going into a room where 2 diggers were & the old lady didn’t like it so let them keep it & went next door & got a funny old bed. Still doesn’t matter ‘cos I’m only here for a day or so & they’re here for weeks & weeks. Had lunch & dinner with the A.S.C. (10th) & they asked me to mess with them all the time. Gladly accepted. Was too dark to start work.\n","61":"\n\nStarted the year by working. Started on the job at 8.15. C.R.E came out & had a look at it. Decided on the way he wanted it done. Knocked the men off at 12 noon. They went to some sports. So did I. met Eustace from the Hill there. This is a monotonous place to put the night in. Went over to the platoon & talked there till 9 pm. brought over some cocoa. Was Bon. The old lady where I stay is deaf. Gee it’s funny. Some very pretty girls here. \n","62":"\n\nDoing goods on the job. Had to send two in to the battn. For the Div. platoon. Rained in the afternoon but the sun was out in the morning. Took a snap of the job. Spent the first part of the night talking to the platoon. Won’t be sorry\n\nwhen I get back to the Coy. This is too monotonous here in the night. brings over a dixie of cocoa in the night, just before I hop into bed.\n","63":"\n\nSame old job in the same old way. Nothing altered at all. Wish I could play cards or go to a show or do something as soon as work is finished for the day.\n","64":"\n\nStarted putting in the sets for the culvert this morning & have 3 more to put in yet. We’ll do them tomorrow & then board them & then start the filling in business. Knocked them off early this afternoon to let them have a look at a game of football. Gee it was an awful match. Am trying to arrange a match with the 113th Battery. They have an unbeaten team. Guess we’ll stir them up a bit. Mail very poor lately. Have slipped a treat.\n","65":"\n\nFinished putting in the sets, but had to stop at 10.30 ‘cos we ran out of nails. Had been ordered the day before but didn’t arrive till 2.30, was too late to start then. Major rang up & wanted rugby players sent in but they wouldn’t go in.\n","66":"\n\nBorrowed a horse from the 10th AASC & rode into the dentist at Aains. Had a temp. filling put in again & have to report back on Wednesday. Bought another job. Had to go to Liessies to look at a bridge, but it was O.K. with a bit of supervision so managed to get out of it. Went to the railway bridge, blown up by Fritz had a look at it. Gee it was a lovely blow up. Do me every time. Work was done as usual.\n","67":"\n\nWork as usual again. On the filling in now. Went to the bridge again with Gray & took 4 snaps of it. Hope I manage to get a decent one out of it. We pushed part of the \n\nbridge left into the water. Made some splash too.\n","68":"\n\nNo wagons today as no work done all day. It’s the D.A.C. sports. Guess they’ll crash tomorrow tho. Went to the dentist again & had another filling put in this time to kill the nerve. Have to go again on Friday. Has been a glorious day. Had the sun all day. When in Sains went for a stroll & took a snap or two of some factories there. One had been used by Fritz as an hospital. Could see the big cross in the yard. Looked well.\n","69":"\n\nBought another job. Had to go & examine the railway & report on it between Semieries & Felleries. Got back at noon & found we were to be relieved at 1pm. Sent the men away & waited. Scriven came along about 4 pm. Took him to the mess & handed over to him & then borrowed blankets from the A.S.C & slept with Scriv. Had steak & toast for supper. Also almonds & raisins.\n","70":"\n\nWent from Ranousies to Sains to the dentist. Got fixed & then hoofed it from there thro. Semeries & upt o Felleries & managed to get a lift from there to outside Solre le Chateau & had to hoof it from there to Beauriex. Some work. Davidson left with the first 1915 batch for Aussie this morning. Casey & Fuicher leave tomorrow. Steve & I are not going to Paris till Campbell returns. Keen is O.C. of the Coy. & Cowlishaw (a ) is with us. Cold tonight. Wrote some letters.\n","71":"\n\nSent out notes re sport. Campbell retd. as Steve & I go to Paris tomorrow. No money from Blighty so borrowed 103 francs from & 160 from Beaton. Holmes retd. yesterday & brought me 6 spools. Got them today. Got everything ready for leaving for Paris tomorrow.\n","72":"\n\nHad brekker early & left the square at Beaurieux at 8.30 am & walked as far as the main road to Solre where we picked up a lorry going to Beaumont. As the roads were so very bad we went via Sivry. Got to Beaumont alright but couldn’t get another lorry to Charleroi until the leave bus came along. Had a good look round Beaumont & it is exactly like all frog villages. All goods were expensive. Charleroi is very thickly populated & is a coal mining district. It is a big town. \n\nArrived in Charleroi at 1.15 & as the train to Brussels left at 2pm we went straight to the station & managed to get a seat. Train left alright but was absolutely packed. Just after leaving Charleroi we passed a station yard absolutely covered with debris from 5 or 6 railway trains blown up by Fritz. Gee he made some mess of things alright. A Belgian got in at Courcelles & spoke English very well. He had been in London for 3 ½ years working & had just come over to his wife & children & was going to Brussels to look for a home. We arrived in Brussels about 5.30 pm but couldn’t get a room for awhile. Got settled at last & then had dinner in a restaurant. Was very plain but expensive. Met 2 Belgians at the restaurant who were very funny. Made Steve have some wine & a cigar with them. One spoke a little (very little too) English & was very hard to understand. \n\nAfter dinner we went for a walk into the main street. Absolutely packed with people. Plenty of picture shows. Plenty of stuff in the shop windows but it is some price too. Street very nice & wide & the buildings quite modern & look well. Electric trams in the street, combination of overhead & underground rail. Went to a picture show for ½ an hour but got sick of it so came out & then visited one or two cabarets. Girls in short dresses (above their knees) & low cut, dancing around. When you sat down & ordered a drink\n\nthe girls immediately floated round & wanted drinks & a smoke. Very poor class of girl. They were in four or five places we visited so we went home to bed. Like the look of Brussels & will return & have a look at it in day time.\n","73":"\n\nUp at 4.30 a.m. Had brekker across at the restaurant & then got our tickets for Paris & went in & managed to get some seats. Train left at 7 am & gee it was an interesting trip. We went via Tournai, Lille, La Bassu, Loos, Albert, Dernacourt, Buire, Treux, Mericourt, Heilly, Corbie, Blangy & Amiens. One or two of the places are absolutely in ruins. Couldn’t see a house standing in La Bassu, Loos or Albert. The Canal too has been knocked some, the Tommies working on repairing it being assisted by Fritz prisoners. Quite a number of bridges were blown by Fritz too & Tommies are busy repairing them & also in fixing up the main railway line from Brussels to Paris. In quite a lot of places we saw French people filling in shell holes, & in some cases trenches. Also saw small patches of ploughing done where there wasn’t any shell holes evidently. Gee the frogs soon got to work. \n\nWe arrived in Paris at the Gare du Nord about 9 pm. Couldn’t get a taxi for ages so started to walk but as we didn’t know where we were going we soon returned to the station & as luck would have it we managed to get a taxi. This taxi driver didn’t know too much about Paris ‘cos he had to ask his way several times. Went to 4 or 5 hotels but they were all full on account of the Peace Conference. We managed at last to fit in at Hotel Castille in Rue Gambon . We didn’t stay out of bed too long.\n","74":"\n\nNeedless to say we had brekker in bed. After brekker we went to the Paymaster at the \n\nHotel Windsor & then reported to the Area Commander. Met a Canadian at lunch & after lunch we went sight seeing visiting the Champs D’Ellyses , Arc de Triomphe, Eiffel Tower & then along the Seine seeing all the big buildings (War Office, Foreign Office, where the peace conference is being held, & such like places). All along the Champ D’Ellyses on both sides are guns taken from Fritz. This is a very wide Boulevard & starts from the Place de Concorde & finishes at the Arc. All in the Place de la Concorde there are all sorts & shapes & sizes of guns etc including a ‘rubber gun’ & a fritz tank. Managed to get snaps of them all. The Arc is a massive big thing & has chains all round the outside to stop vehicles from passing under it. Has been closed since 1871. had dinner at Poccardi’s (in the Boulevard de Italliene ) & then went to see a show at the Opera Comique. Couldn’t understand it too well ‘cos it was all in French. Orchestra was excellent (50 & over strong). The play was called Le Roi D’Ys. Singing was very fair & the costumes good. Went straight home to bed after the show.\n","75":"\n\nBrekker again in bed. Went to the Invalides to see Napoleons tomb but the place was closed. Went round & visited some of the things in this place tho. Amongst other things saw parts of Zeppelins, 2 fritz aeroplanes & the seroplane used by . From here we went to the Luxembourg, but that also was closed so we got a taxi & went back for lunch. After lunch we visited Notre Dame & the Hotel de Ville. Notre Dame is some place alright & must have cost some money. It isn’t as good as St Pauls tho.\n\nIt rained in the evening. Not much tho. Had dinner again at Poccardi’s. managed the glad eye business & hooked a girl (very easy thing to do in Paris). After dinner we met her & took her to the\n\nCasino de Paris. Liked the show here very much indeed although it was all in French we could understand quite a lot. The two main artists were a man called Maurice Chevalier, (who had been a French soldier & a prisoner in Germany for 3 ½ years) and a woman named Mistinguett who sings & dances like a kid of 20 but whose age is 47 or thereabouts. During the interval we went out to the promenade. Here they have a Jazz band. It is going all the time the show is on & quite a lot of people only go for the promenade amongst this class are many girls who hope to pick up men. The flower & chocolate girls are up to all sorts of dodges to make money. If they see you with a girl they immediately come up & try to persuade her to get you to buy her something. If you do the girl, at the first opportunity resells it to the girl you bought it from for half the price, so that each girl makes money on the deal. Real shrewd heads. This little girl of mine looked after us tho & strange to say didn’t let me down at all. The theatre itself is very poor, but the staging & dresses are very good. Tons of Yanks everywhere here.\n","76":"\n\nBonny & fine today. Visited Place de la Concorde & Nap’s tomb. Took some snaps. Old Naps tomb is some place alright. Has a great big tomb, enough to cover dozens. Went back to the hotel for lunch & after that we went for a long walk up the Grand Boulevard right up to the Place de la Republique. We got a taxi back & then visited the Madeline. This is a much used church & is very plain inside but nice & high & comfy. Went to the Imperial Club & had afternoon tea & wrote Scriv. a note. Went to the Follies\n\nBergerye in the morning. It is much the same as the Casino but is an English show. (Zig Zag Lasing Shirley Kellog, Daphne Pollard & Fred Kitchen in it). Promenade here is much better but the class of girl the same. Met quite a lot here I knew, including Chas Thomas who was on his way to Nice.\n","77":"\n\nThis morning after brekker the Canadian Steve & I did a trip with the Y.M.C.A people round Paris. It was in a dray with 5 horses. We got in the back seat & 4 sisters (3 Canadian & 1 digger) sat opposite. We went all over the place. First we visited the Opera & got it’s history & from there we went to the Place de la Republique & the Bastille & then over to some old places, amongst them seeing Victor Hugo’s house. From here we drove back to the Hotel Windsor (the Aussie Y.M joint) & had lunch. After lunch we drove to Notre Dame & had a look at tit once again then to the see the Museum de Cluny (all nice stuff here, had once been a Roman bath). At this place they were only just returning the goods & chattels from the vaults where they had been stored during the war. We then visited the Hotel de Ville. This also is a good big building like most of the places we visited. This trip finished at 4.15 so we took the sisters to afternoon tea at the Tipperary tea rooms. Was very nice. The sisters were good sports alright. After this we took them to the tube & buzzed off home to our hotel. We had dinner at the hotel & after dinner I went to the Nouveau Cirque while Steve went elsewhere. The show was very fair, one twin being very funny. He was an Englishman & spoke very little French & being a conjuror he often \n\nhad to speak in French. He more often finished his sentence in English tho & of course said the most amusing things. There was also some sea lions which acted both on land & in water. These also were run by an Englishman. Enjoyed the show.\n","78":"\n\nup at the usual (10 am). Went on another Y.M. trip. This time to Versailles. We went by tube to the station & then by train arriving at Versailles in time for lunch which we had at the Swiss Hotel. The palace & grounds are simply wonderful. Enjoyed this visit immensely. Went right thro the palace & saw all the places Louis XIV visited, slept in & held court etc. he knew his business alright when he had such a place built. The Hall of Mirrors is great. This is where the peace program will be signed. Used to be the dancing room of Louis. All round the sides are huge mirrors. Plenty of windows too, but the ceiling is one mass of beautiful paintings. So also are the majority of the other rooms. The park & grounds are great. Would love to see them in Summer. The avenue is due east & west, as also is the street in front of the palace. Louis bedroom is also right in a straight line with these two. When the sun came out it had to pass right over his head. This is why he was called the Sun King & had as his emblem, the Sun with his head in the centre with the rays coming out from the edges. \n\nWe went back to Paris & just had time to wash before we again picked up a Y.M. party for the Opera. Gee it\n\nit is marvellous inside. Gaily decorated with gold etc & great huge pictures on the ceiling & a massive chandelier which now has electric light instead of candles. The seating accommodation is poor for a crowd, but the seats are great. There is the orchestral place (orchestra 70 odd strong which is great) then the stalls. Above the stalls are boxes right round holding 6 & 8 per box. These then go up in height & there is about 5 or 6 floors of them. Above these are the pits. The promenade is great, but unlike the Casino & Follies girls don’t go there to catch but just for exercise. The whole building is great. The play was Aida & was good. Singing, staging & costumes were excellent. Enjoyed the whole thing immensely. After the show home to bed.\n","79":"\n\nAs usual up at 10am. Went for a stroll & then to the Hotel Astra for lunch picking up a crowd to go to the football (rugby union) match between the French & the Aussie Corps. We started to go by tube but got lost so came out & got a taxi. The ground was at the Parc des Princes, in the Bois de Boulogne. Very decent little ground but a bit heavy today for football. It was a very poor game our boys winning by a try (3 points) to nil. Came back to town by tube. Went home & washed & then to the Grand Café for dinner. Met a couple of Yanks there & they would persist in our having a drink with them etc & telling us how much they admired the Australians etc. picked up a very nice young thing here & walked with it. Very nice indeed.\n","80":"\n\nUp at 2pm today. Had both brekker & lunch in bed. Managed to get £5 from Lloyd’s bank. Got my snaps from Kodaks & some other joints which we took some spools & couldn’t find till today. Went out to the flat for dinner & had a bit of a sing there. Also visited the Gare du Nord & got our tickets for Blaudain (French & Begian border). Also packed my gear.\n\n21.1.19.\n\nUp at 4.15am. walked from Rue Marbeau to rue Gambon. We then managed to get a taxi to the station. Couldn’t get a seat in the train in a first but managed a corner seat in a second which was about the only seat vacant. We were lucky to get these. The train was absolutely packed, people standing all over the place. This time we made sure about the dining car & at the first stop found that lunch would be on at 1.30 pm. \n\nWhen the time came the train stopped for a few seconds & of course all carriage doors opened but as the train moved again nothing happened. It again stopped at 1.45 so out we hopped & ran along to the dining car. As we got there a lot were coming out. They were nearly all out when the whistle blew & the train moved. Quite a lot of people were out on the platform & were unable to get on ‘cos the train instead of slacking, put on speed. S’pose about 20 or 30 were left behind. We were not tho, being about the 3rd &","81":" in. Don’t know why the train is not made a corridor. It could be quite easily ‘cos the majority of cars are corridor.\n\nQuite a lot of work has been done to the railway since we went down.\n\nQuite a lot of work has been done by the frogs too, who in some cases have been filling in shell holes & trenches & in some ploughing up parts of their fields where the least shell holes are. The canal is getting repaired too the Tommies having Fritz prisoners working for them & in some cases Chinamen. Quite a lot of salveing is being done too. Managed to get a few snaps & hope they turn out O.K. Took one of Buire & a place or two near there & one or two of La Bassee. \n\nWe had tons of time for dinner ‘cos the train stopped for 2 ½ hours giving us tons of time to get to the car & finish our dinner & then return. It also stopped for an hour after leaving this place. The reason for these stops is because this train has to give way to food trains. This being the condition on which the British gov. let the Belgians run the train. We eventually arrived in Brussels at 12.45 am & were very lucky in getting a room & a feed at the first place we called (Hotel Providence).\n","82":"\n\nThis time I actually managed to get up for brekker. Then worked around Brussels returning for lunch & then going out again. First thing we noticed was the price of things. Boots at 175 francs (£6.14.0) & an ordinary felt hat at 50 francs (£1.18sh). All the shops seem to be well stocked with things. Saw plenty of lollies, chocolate, cakes, boots, hats, caps, furs & clothing in the shop windows. Bought some views of Brussels so that we could find all the places of interest. Saw & visited such places as the Louvre (in the main boulevard) monument of Edith Cavell (this is only a model, the actual\n\nthing is now being made). Hotel de Ville, Palais Royale etc. (in a very small square). These places are all decent buildings & look very nice. We then visited the Palais de Justice which is on a hill & commands a complete view of Brussels. Fritz knew this cos he had wire entanglements on each side of the main drive. This building is the best in the city & is quite a modern building. There are one or two very nice churches there, one being made of brick (much after the Notre Dame of Paris). The bricks are starting to decay which is rather a pity. \n\nWe went to a very nice little place for afternoon tea getting very nice cakes & chocolate there. The sun was up all day so managed to get one or two snaps. After tea we went to a picture show which cost us exactly 1d each. It is by far the cheapest I’ve ever been in. The pictures were all of some part of the war so we enjoyed them. Got very cold in the evening, so after having dinner at the hotel we went to bed.\n","83":"\n\nUp early & rushed over to catch the train. Only managed a third class seat. There wasn’t another seat in the whole train. Long before the train started the people were standing in the corridors in the carriages & one was very lucky in being able to move at all. Got to Charleroi about 9.30 am & had to wait there till the leave bus left for Solre. Went round to the Officer Club & had a good old feed of ham, butter, jam, & preserved fruit. Lorries left at 11 am & we arrived home at Beaurieux, getting here about 2.30. Met all the hobo’s & then had afternoon tea & got settled down. It snowed in the morning but was a very\n\npoor exhibition. Scriv & I are together again in the same old billet.\n","84":"\n\nCold again. Bought a job tho. Am on a court of enquiry re two horses pinched last night. No trace of them tho. Very poor evidence. Bought another job too in the evening getting orderly offices as well. Kicked up a row about it too. Snowed again this afternoon & all the evening. Looks as if it is going to make a decent job of it for once. \n","85":"\n\nCourt sat again. Did a bit for the sports etc. but very little doing. Posted the guard again & found that Perkins should have been on. Snowed again for awhile but got very cold. Gee it was cold. The place looks very well, all white.\n","86":"\n\nClicked for another job but lost the orderly officer business. Had to do a reconnaissance of Hestrud & Grandrieu for water, factories & cultivation. Came back to the orderly room & was just in time to hear a message over the phone saying I had bought a job at Le Havre & had to leave for Charleroi in the morning. Some job on demobilization or some such thing. Very cold all day again. Had a kick in the morning & so managed to get\n\nwarm. Had all my gear packed in the evening ready for an early start.\n","87":"\n\nUp early but had to wait while Beaton cooked the brekker. Got the limber OK & had our gear taken into Solre where I reported to Johnny Walker. Some argument occurred at Solre about conveyance. Only had 4 lorries for 5 lorry loads. Still we eventually got away & arrived in Charleroi about 1.30 pm. It was some trip too. Gee the bumps were great (I don’t think). Had some lunch at the club & then walked round the town seeing things (even saw the waxworks. They were of human beings showing different parts of the body & diseases). After this went out to Chatelet in the train & wandered around some looking for Dave Hilton. He didn’t turn up for about 2 ½ hours. When he did we went to the mess & had dinner & then for a stroll going home to his billet where I slept the night.\n","88":"\n\nUp at 6.30. shaved & washed & then caught the train back to Charleroi where I met the N.C.O’s then went & had brekker & went over to the train. All trucks the train consisted of. Left Charleroi about 10 am & gee it was some ride. When the train started we were bumped off our feet & the same when the train stopped. We had a stove in our truck but it took about 4 hours to get a decent heat & then it wasn’t constant. We had plenty of rations & after a bit managed to get a little straw. We had 12 officers in our truck while the ‘Diggers’ had 28 & 30.\n","89":"\n\nGee, it was icy last night. Got a couple of tins for washing. Had a ride on the engine for awhile getting water. Managed to get a shave without cutting myself. Got tons\n\nmore rations. Also raided a supply train & got some straw making the joint good for warmth. The diggers raided some trains & got wine & eatables & finishing up nearly all shickered was funny. Got to Arras about noon & as the driver had been on 31 hours with only 3 hours sleep he refused to take us any further & took his engine off. We had to wait till 10pm when the frogs put an engine on & took us away. They did fairly well too.\n","90":"\n\nSnowed last night but we were bonny & warm. Much different from last night. Nearby are the diggers steel drums. Still plenty of rations. Train kept going fairly well. Arrived at Harfleur at 3pm & then moved to the camp per boat. Gee everybody is dissatisfied. The camp is cruel. After our good little billets in France we come down here to a terrible hole & sleep 16 in a hut without a fire. Its cruel & we are all growling some. Managed to click for a job for tomorrow. An orderly officer.\n","91":"\n\nAbsolutely the coldest night I’ve put in for ages. Feet more like ice. Did orderly officer duty but there wasn’t much to do, so did as little as possible. All the captains who came down with us have been transferred to the A.I.B.D while we remain here. P’raps we will soon get some idea of our jobs.\n\nManaged to click for another job. Had to go to the station at 9 pm & bring a draft into camp. They didn’t arrive till 11.30 so I didn’t get into bed till 1 am. No good to me.\n","92":"\n\nCold again last night but was warm. Went into Havre in the afternoon & did the clicking business. Managed to get a few meets for the rest of the week. Had afternoon tea & dinner at the American Y.M. Very poor feed tho.\n","93":"\n\nActually got a bath. Managed to scrawl a couple of letters. Went into Havre in the afternoon & managed to catch a couple of Y.A.D. Took them to tea. Had dinner at the American Y.M & then came home to bed. Move to a new hut tomorrow.\n","94":"\n\nRained all day. Havre as usual. Had dinner again at the Am. Y.M.\n","95":"\n\nFine day today. Took a walk to Montville in the morning & Havre after lunch. Rain in the evening again. Quite settled now in our new hut. Scrawled some more letters.\n","96":"\n\nSnowed to some order during the night & all this morning. Very heavy indeed. Did nothing much all day ‘cept take a run into Havre. Met Haldane.\n","97":"\n\nVery cold last night & today.\n","98":"\n\nCold very intense, everything frozen. Pipes bursting all over the place.\n","99":"\n\nStill very cold altho the sun came out.\n","100":"\n\nCold getting better. Nice & warm in the sun. saw Dave again & had a look at the Yanks play some of our people basket ball. Yanks won easily. Had a dance after. Wasn’t bad. Had one or two with some Yank YM girls.\n","101":"\n\nWeather getting warmer. Dance again today.\n\n"}}