{"Document Name":{"0":"Diary_0460","1":"Diary_0460","2":"Diary_0460","3":"Diary_0460","4":"Diary_0460","5":"Diary_0460","6":"Diary_0460","7":"Diary_0460","8":"Diary_0460","9":"Diary_0460","10":"Diary_0460","11":"Diary_0460","12":"Diary_0460","13":"Diary_0460","14":"Diary_0460","15":"Diary_0460","16":"Diary_0460","17":"Diary_0460","18":"Diary_0460","19":"Diary_0460","20":"Diary_0460","21":"Diary_0460","22":"Diary_0460","23":"Diary_0460","24":"Diary_0460","25":"Diary_0460","26":"Diary_0460","27":"Diary_0460","28":"Diary_0460","29":"Diary_0460","30":"Diary_0460","31":"Diary_0460","32":"Diary_0460","33":"Diary_0460","34":"Diary_0460","35":"Diary_0460","36":"Diary_0460","37":"Diary_0460","38":"Diary_0460","39":"Diary_0460","40":"Diary_0460","41":"Diary_0460","42":"Diary_0460","43":"Diary_0460","44":"Diary_0460","45":"Diary_0460","46":"Diary_0460","47":"Diary_0460","48":"Diary_0460","49":"Diary_0460","50":"Diary_0460","51":"Diary_0460","52":"Diary_0460","53":"Diary_0460","54":"Diary_0460","55":"Diary_0460","56":"Diary_0460","57":"Diary_0460","58":"Diary_0460","59":"Diary_0460","60":"Diary_0460","61":"Diary_0460","62":"Diary_0460","63":"Diary_0460","64":"Diary_0460","65":"Diary_0460","66":"Diary_0460","67":"Diary_0460","68":"Diary_0460","69":"Diary_0460","70":"Diary_0460","71":"Diary_0460","72":"Diary_0460","73":"Diary_0460","74":"Diary_0460","75":"Diary_0460","76":"Diary_0460","77":"Diary_0460","78":"Diary_0460","79":"Diary_0460","80":"Diary_0460","81":"Diary_0460","82":"Diary_0460","83":"Diary_0460","84":"Diary_0460","85":"Diary_0460","86":"Diary_0460","87":"Diary_0460","88":"Diary_0460","89":"Diary_0460","90":"Diary_0460","91":"Diary_0460","92":"Diary_0460","93":"Diary_0460","94":"Diary_0460","95":"Diary_0460","96":"Diary_0460","97":"Diary_0460","98":"Diary_0460","99":"Diary_0460","100":"Diary_0460","101":"Diary_0460","102":"Diary_0460","103":"Diary_0460","104":"Diary_0460","105":"Diary_0460","106":"Diary_0460","107":"Diary_0460","108":"Diary_0460","109":"Diary_0460","110":"Diary_0460","111":"Diary_0460","112":"Diary_0460","113":"Diary_0460","114":"Diary_0460","115":"Diary_0460","116":"Diary_0460","117":"Diary_0460","118":"Diary_0460","119":"Diary_0460","120":"Diary_0460","121":"Diary_0460"},"Date":{"0":"unknown","1":1257.0,"2":1258.0,"3":1259.0,"4":1260.0,"5":1261.0,"6":1262.0,"7":1263.0,"8":1273.0,"9":1274.0,"10":1275.0,"11":1276.0,"12":1277.0,"13":1278.0,"14":1279.0,"15":1280.0,"16":1281.0,"17":1282.0,"18":1283.0,"19":1284.0,"20":1285.0,"21":1286.0,"22":1287.0,"23":1288.0,"24":1289.0,"25":1290.0,"26":1291.0,"27":1292.0,"28":1294.0,"29":1295.0,"30":1296.0,"31":1297.0,"32":1298.0,"33":1299.0,"34":1303.0,"35":1308.0,"36":1311.0,"37":1312.0,"38":1313.0,"39":1314.0,"40":1315.0,"41":1316.0,"42":1324.0,"43":1325.0,"44":1326.0,"45":1335.0,"46":1336.0,"47":1337.0,"48":1338.0,"49":1339.0,"50":1340.0,"51":1341.0,"52":1342.0,"53":1343.0,"54":1344.0,"55":1345.0,"56":1346.0,"57":1347.0,"58":1348.0,"59":1349.0,"60":1350.0,"61":1351.0,"62":1352.0,"63":1353.0,"64":1354.0,"65":1355.0,"66":1356.0,"67":1357.0,"68":1358.0,"69":1361.0,"70":1362.0,"71":1364.0,"72":1368.0,"73":1369.0,"74":1370.0,"75":1371.0,"76":1372.0,"77":1373.0,"78":1374.0,"79":1375.0,"80":1376.0,"81":1377.0,"82":1378.0,"83":1379.0,"84":1380.0,"85":1397.0,"86":1398.0,"87":1399.0,"88":1400.0,"89":1401.0,"90":1402.0,"91":1403.0,"92":1404.0,"93":1405.0,"94":1406.0,"95":1407.0,"96":1408.0,"97":1409.0,"98":1410.0,"99":1411.0,"100":1412.0,"101":1413.0,"102":1414.0,"103":1415.0,"104":1416.0,"105":1417.0,"106":1418.0,"107":1419.0,"108":1420.0,"109":1421.0,"110":1427.0,"111":1428.0,"112":1429.0,"113":1430.0,"114":1431.0,"115":1432.0,"116":1433.0,"117":1434.0,"118":1435.0,"119":1436.0,"120":1437.0,"121":1438.0},"Entry":{"0":"\n\nEntry ","1":" We train here reinforcements for the 4th Brigade - 13th,14th, 15th, 16th. Bns. as they arrive from Australia. The Training ground is on a hill near the camp - called \"The Pimple\" by the men.\n\nThe ususal route march (taking place twice a week) is from the Camp through Steeple Langford, Hanging Langford and Wylye.\n\nToday we had an all-day route march and field operations between Wylye and Noyle - marching altogether about 15 miles, our Bagpiper Band marching all the way. Our Brass Band met us near Wylye coming home.\n\nI started a Debating Society in the Camp last night. About 400 to 500 men, NCOs & Officers attended & a very interesting Debate took place,\n\nThe Governemnt, led by Lieut Nelson (15th) contending that \"The White Australia Policy should be altered after the war.\" The Government was beaten by about 300 to 20, the leader of the opposition (Cpl. Champion,","2":" Bn (a N.S.W teacher) becoming Premier for next week. He is to argue that \"State Governors & Parliaments should be Abolished.\"\n\nSome of last nights speeches were very interesting & well delivered. There were speakers from every state.\n\nThis evening our Camp Pierrots give their first entertainment in YMCA Hall.\n\nEntry Sunday ","3":"\n\nRaining this afternoon. I arranged to motor to Bath with Capt MacPherson (16). Lt Towers (16) & Lt Thorpe (15) but car did not turn up. So we remained in mess & spent an\n\nuninteresting afternoon. At Church Parade this morning. Our Pierrot Concert on Friday night was a great success. The Concert last night by a Salisbury party was very poor.\n\nI obtained Leave to visit Birmingham on Monday to see Reg & London on Tuesday to see Lex; but the C.O. this afternoon asked me to conduct Leave Draft to London tomorrow instead. Gladly accepted as I get 4 days instead of two.\n\nWe leave camp tomorrow at 6.30am - Major Harris & myself with about 200 new reinforcements on their 4 days' leave. I shall visit Reg in Birmingham on Tuesday. I must travel & have 4 days' leave on £6. Cheerio!\n","4":"\n - Left Camp at 6am with 200 men for 4 days leave - disembarkation Leave - Waited at Codford Station from 7 to 8 & then entrained - A beautiful trip to London - We marched from Paddington through Hyde Park, in front of Buckingham Palace &down Victoria Street to Horseferry Road Headquarters. There the men received a short lecture on their leave in London.\n\nI made enquiries about several of my men in the Casualty Room. After a light lunch I visited St Pauls for an hour. It is much more beautiful in the bright sunlight. I then tubed to Mark Lane & visited the Tower of London. Here I met a party of Australians and Canadians, among them were Dr. Cos Fowler, Lt Les Fowler, & \"Abdul\" aCanadian. \n&\nWe visited White Tower together. We then \"taxied\" to York Hotel, where Cos Fowler has his room.\n\nCos & myself then walked along Chancery Lane had a drink at \"Ye Olde Mitre\" & while drinking entered into conversation with some singer\n\nChap who once lived in Petersham & who belonged to the Petersham Choral Society. Dined at Australian Officers' Club at my expense & then at his expense we visited Savoy Theatre where Henry Irving was playing \"\nThe Bells\n\", preceded by \"Waterloo\" - both excellently acted. Met Major Marks& \"Capt \"Bom\" Wells.\n","5":" - Tuesday\n - Visited British Museum, but found it closed. Met Lts John Brown & Wallach (13). Caught 2pm train from Paddington to Birmingham.\n\nVisited Dudley Road Section Hospital & saw Reg & his mate Moroney. They were in the same tent in Kiama, came together, in action together & both now have right wrist severely wounded. One holds his meat down with a fork while the other cuts, one pulls one side of a knot in a bootlace, while the other pulls other side.\n\nStory\n\nCapt. T (19) \"Well what about surrendering boys.\"\n\n\"Not while we've got a bomb or a bayonet Sir.\" This reply so heartened the\n\nCaptain that a great defence was put up, and very successfully.\n\nStory\n - Reg & the man with a broken thigh. \"Cobber,\"Reg with useless right hand & bleeding head.\n\nStory - \nMan to be crimed- R saw his body hanging on barbed wire without any legs\n.\n\nReg buried Tom Dowd\n","6":"\n morning Visited 345 Rotten Park Road to take German Automatic pistol to the Uncle of C.S.M. Lord.\n\nVisited hospital & yarned with Roy & his mate Moroney.\n\nafternoon\n Visited hospital again & took Reg & Moroney on Trams to Bearwood & through Dudley \"Black Country\". We had a long walk, afternoon tea & tea together. I visited them again this evening at 7.30 & took them cheese, meat paste & cigarettes. I then visited other wards & yarned with\n\n\n\nmen of","7":" & others I knew, including Easterbrook whom Jess & I met with his wife at Kiama. I visited Uncle of Lord this evening as he was not at home this morning. Raining.Wrote Jess & Ina.\n\nEntry","8":"\n\nSince arriving back in camp there is nothing exceptional to report. I have got a good debating society going in the camp and we have had two good debates on \"The White Australia Policy should be changed after the War\". \"State Governments in Australia should be abolished.\" the former was defeated by about 300 to 20, the latter was carried by 50 to 30. We have full field days every Friday now - out all days with full packs up. I have been with Musketry Party for 5 days. It is very monotonous work after the first day.\n\nI was appointed Battalion Bombing Officer about a fortnight ago but have had\n\nvery little opportunity to carry on my work on account of shortage of officers necessitating my taking other duties.\n\nI was O\/C Codford Picquet one evening (Saturday) from 6 to 10. I stayed at George Hotel after handing my party over until they were ready to return. We returned in a heavy thunderstorm.\n\nYesterday afternoon I borrowed Capt. Macpherson's bicycle & rode through several villages to Wilton and then to Salisbury. At Wilton I inspected the beautiful church erected by Earl of Pembroke at a cost of over £80,000. It contains 4 pillars from Pompeii, mosaics from various places, stained glass of great antiquity & other fine work.\n\nI then cycled to Salisbury about 3 miles further on. Here I met AdjuttentDay, had a walk with him, left my bike at the \"Red Lion\" and then walked\n\nabout the streets & around the Cathedral. We dined at the \"Red Lion\" - a poor meal for 6\/6. I then cycled along London Road a few miles, then across to \nOld Sarum\n, which I did not have time to inspect properly as I had promised to be at our 4th Training Battalion Pierrot Concert in Salisbury Council Hall, a concert given to the Soldiers & Sailors' Club. The Mayor treated us afterwards & showed us many souvenirs his son (M.C.& bar) had brought from France. I left Salisbury about 10 & cycled back to camp in about an hour.\n\nWe had usual Church Parade this morning after which I took Communion at the Church Hut.\n\nLast Monday evening I gave an address on \"Early Church History\" to the proposed members of the C.E.M.S. in the Church Hut\n","9":"\n6 \n7\n\nA lovely day warm with a breeze - I am feeling very tired somehow or another.\n\nConference (at 5.30pm) of Group & Bn. Bombing Officers at Group Hqrs which I attended. Played cards after attending a good concert given by R.G.A club.\n","10":" - Conducted bombing all day. Attended Lewis Machine Lecture in Evening after which Smith & myself went to Y.M.C.A. to Conjuring performance.\n\nEntry ","11":"\n - Wrote to George & Reg last night & also wrote several postcards to Jess & the \"littlies\".\n\nSent my Bombing Certificate to Bn. for record. Wrote congratulations to LtRose & Lt Parsonage on their M.Cs. Wrote to A.I.F. Headquarters (Casualty Branch) and asked for casualty information concerning about 110 of\n\nmy reinforcement men. I now have a room to myself in our hut on account of a shortqge of officers. It is very comfortable with the hot weather now being experienced. Conducted Bombing all day.\n\nFriday 8th\n - Received J's letter of","12":" - Her mother passed away","13":" - Poor kiddy. What a brave letter she writes in all her trouble & worry. I shall write to my J. \nthis\nnow.\n\nMajor Murray visited us today, looking well but more worn than when I last saw him. His VC, DSO with rosette and DCM lookfine. His modesty is still as apparent as ever.\n\n\"C\" Coy debated \"B\" on The Bomb versus the Bayonet\". The Bayonet party won. Lieut Capt McPherson £1.\n\nAll our T.B. received 2nd Innoculation for T & para Typhoid.\n","14":" - No training this morning on account of yesterday's innoculations.\n\nI was inocualted myself this afternoon but it is not worrying me much yet.\n\nI wrote to Lex re his mother's death.\n","15":" - Ill today with Inoculation - very dizzy. I remained in bed until 3pm. After tea I played several games of draughts with Ward and Anderson.\n\nEntry Friday\n","16":"\n\nInocualted arm sore on Monday.\n\n11th\n Attended Bombing Officers' Conference at Group Headquarters.\n","17":"\n - Complimented by Staff Captain Currie on \"very fine\" work in Bombing instruction, mainly in reference to my ground diagrams. The Battalion carried out Night operations on a wood north of the camp. Capt. Kock & 36 of \"A\" company with Goldstein & myself\n\ndefended. Goldstein worked the smoke bombs.\n\nCaptain Smith","18":" Bn) with 4 platoons of 50 each attacked. A scout & myself led Lt Willis & 52 men to note a trap & captured them. Conducted debate among men in Y.M.C.A. Hall.\n","19":" ","20":"\n - Payday. I drew my Outfit Allowance of £5 and £1\/10\/- pay.\n\nPaid Mess £3 and gave notice to Secretary that I did not desire hired furniture in my room. Played chess with Padre.\n","21":"\n - Received letter from Mr Lord of Brmingham stating that my old C.S.M. Lord was a wounded prisoner in Germany.\n\nReceived list of casualties of men of my reinforcement from A.I.F. Headquarters.\n\nReceived letter from Reg in which he enclosed letter from Mother & Ina.\n\nPlayed chess with Padre\n\nAssisted Group line bombing all day.\n","22":" - Inspection by G.O.C. Gen. McKay during the morning. This afternoon Smith, Ward & myself ate a 3\/- box of strawberries & another box this evening, with condensed milk (cream unobtainable).\n\nThis evening I played Bridge with Smith against Ward and Freeman for 6 per 100. I lost","23":" Wrote Reg & Jess.\n","24":"\n - Church parade in open air under trees near Wylye Creek. Medical inspection of every man in camp after. This afternoon Smith & I walked about 16 miles through Fisherton de la Mere, Wylye, Hanging Langford, Little Langford Steeple Langford, Stapleford & Deptford, walking very quickly, covering measured\n\nmiles in 111\/2 & 12 minutes.\n\nHad a sponge bath on our return. During the walk we enjoyed the scents of many flowers, carnations, roses honeysuckle, hedges & many others.\n\nWe had a long drink at the Pelican Inn at Stapleton & then ate our \nlunch\ntea which we carried, on the grass near the bridge above Stapleford.\n\nWe saw at Hanging Langford three Australian soldiers conducting a religious meeting, the whole village almost attending in their Sunday best \nand\nproviding forms and joining vigorously in the singing to the accompaniment of the two cornets played by our soldiers.\n","25":" - Rained slightly this morning.- I had about 60 Mills' Castings half filled with cement to make them the correct weight.\n\n\n\nAttended a conference of Bombing officers at G.S.O.'s office this evening. Wrote to George. Wrote to Comforts' Committee regarding sending parcels to 7 of my reinf. now prisoners of war in Germany.\n\nEntry -","26":"\n\nDuring the past week we had an inspection by Inspector General of Infantry Training in the U.K. - A warm early week was followed by a cold windy weekend. I was elected Mess Secretary on Tuesday & have been disentangling accounts etc since then every spare minute with the assistance of Lts Brierley & Ward.\n\nSeveral officers have gone overseas - Smith Major Harris, Brierley of","27":" with Davis & Dwyer to go tomorrow.\n\nWe had very successful Bn. sports yesterday on the hill. A Marquee was erected for our bar & afternoon tea. For the latter we had strawberries & cream in plenty. We had in addition to usual sports,\n\na Maori Haka.\n","28":" we had a long route march through Wylye & Chilmark. On our return we were caught in a thunderstorm & all got very wet.\n\nSpent 2 hours reorganising Mess Books with Ward.\n","29":"\n\nBombing instructions all day. - Visited by Capt -, Southern Command Bombing Officer.Attended Group Bombing Officers' Conference at Group Hqrs at 5.15 to 5.50 pm. Then cycled to Codford for small purchases.\n\nReceived letter from Jess; others from Reg, who has been transferred from hospital at Birmingham to Harefield & is going to Weymouth today.\n\nWrote Reg \n&\n Received letters from George & his photo.\n\nPosted 6 letters to relations to relations of men of my reinforcement who have been killed, captured or seriously wounded. Posted letter to \nMrs. Bentley\n & to Jess.\n\nAll the huts have been overrun with Earwigs for about a week. They crawl up ones legs & sleeves, fall from the roof on one's face as he sleeps, get in socks & clothes & generally make pests of themselves.\n","30":"\n - Visited Salisbury this afternoon with Mess Sergeant Crofts to arrange purchase of spirits, also tobacco, groceries etc for our Officers' Mess, of which I am Secretary. Left my watch to be cleaned & inscribed with my name & Battalion. Bought a few little souvenirs for Jess. Returned to Wylye Station & walked from there to Camp.\n","31":"\n - Bombing all day.Special demonstration by Group N.C.O's of Rifle Grenade firing at Shell holes, communication trench, and also from a Rifle Battery.\n","32":" - Left Codford for Lyndhurst to attend Bombing School there (Southern Command Bombing School) for one day (Friday) to pick up anything new. Trained through to Southampton where Jackson & I spent a few hours wandering the streets. We were not allowed into the Docks & had too little time to seek a pass for admittance. Trammed out to suburb of Shirley. Southampton seems a very tidy city for a port. The trams are large double deckers. I bought a few little ornaments for souvenirs.\n\nWe reached Lyndhurst Road Station at 5pm & took large motor bus 3 miles to Lyndhurst, passing through some of the New Forest. Reported at the School at 5.30, were received well & asked to afternoon tea by the C.O. Major -.After this we walked to the town & took rooms at the \"Stag\", Jackson & I sharing a large old fashioned bedroom (No.4) containing 3 large double beds. Jackson & I then went for a walk but rain turned us back. I hired a bike for 2 hours and rode through the New Forest, visiting Rufus Stoneand Sir Walter Tyrell Hotel nearby.\n\nReturning to the Stag about 9pm in the twilight. I had supper - Bread & Cheese & a glass of stout.Slept excellently.\n","33":" - Breakfasted & then went to the Bomb School. We spent the morning on Administrative Points & the afternoon at a lecture and a demonstration of a Bombing Attack, at which a very fine air & ground bursting barrage was put up, & several \ncrate\nmines blown up. It rained nearly all the afternoon. We left Lyndhurst about 4.30pm, changed trains at Southampton & reached Codford direct about 6.30pm. Motored to Camp for 5\/-\n","34":" - Cycled in the afternoon through Wylye, across rough roads to Dinton via Baverstock, Teffont& Wylye again. Visited Grovely Wood through which runs an old Roman Road, & Roman ditches & earthworks.\n\nChanged (upon C.O.'s orders) our Mess sergeant. I am Mess Secretary.\n\nEntry","35":"\n\nEntertained Col. P. McGlynn at Guest Night yesterday evening, heard of General Holmes' death in France. This evening Mrs Padden's Bristol Concert Party gave a good Concert in Y.M.C.A Hall. Our Corporals also gave an Evening to which all officers were invited. I was sorry I was unable to attend butbeing Mess Secretary I had to arrange entertainment of Concert party at supper.\n\nWrote to Norman this evening.\n\nReg arrived here on Tuesday afternoon & spent the night with me. We went to the Debate, of which I am President, in the Y.M.C.A. hut. The debate was \"A policy for Repatriation of Soldiers.\" It was of a fairly high standard, McQueen","36":" Bn) from No4 Command Depot making the best speech. I gave Reg £5 for his holiday which he intends to spend in Durham & Scotland. He left by train about midday for London.\n\nEntry Monday - It rained heavily on Saturday & Sunday. Sunday afternoon between 4.30 & 9pm Lt Anderson","37":" & myself went cycling. We passed through Deptford, Steeple\n\nLangford & Stapleford to Wishford where we had tea at the \"Royal Oak\". A very nice tea - farm ham, salad, a boiled egg, plenty of bread & butter, sweet gooseberries and plenty of fresh cream, and red home made gooseberry jam for 2\/- Returning we cycled through Wylye in the rain, enjoying it thoroughly, through Stockton & Codford back home.\n\nThere was a \"birthday\" on last night, Captain Blayney, who is leaving us shortly attempting to get everyone drunk. Through our bike ride, Anderson & myself missed commencement of the fun & wisely kept clear out of their sight on our return, or we would have had no rest.\n\nToday it rained slightly and was wintry cold. I marked out a new system of bombing trenches & as Lt McKillop was away I took his Trench diggers to dig my trenches.\n\nA fleet of 11 battle planes passed over our camp like a huge V this afternoon. We could hear them before they came into sight & after they disappeared in the distance.\n\nThe C.O. Capt Cox gave a lecture this evening to Officers & NCOs - a very poor lecture but nice & short.\n\nI attended the Group Bomb Officers' Conference at 5.15 this evening.\n\nTwo sergeants from 13th who were wounded at Bullecourt & who are now convalescing at No4 Command Depot (Commanded by Col McGlynn) visited Marper & myself this evening.I posted letters to Jess & Merle.\n\nEntry 16th July\n Returned from Bristol this morning, getting up at before 5 to catch the 6am train.\n\n12th July\n - Arranged Ladies' evening at Mess, for the wives of 4 officers - Capt. Parker, (16) Capt Smith(15) Lt Fish (15), Lt Whiting (16). We all attended a concert of men by Lena Ashwell's London Party afterwards in YMCA Hall.\n\n14th July - Obtained leave to visit Bristol to purchase material for our Mess. Left Codford 10.36 and arrived at Bristol about 12.30 just in\n\ntime to do a little shopping, & enquiring regards purchase &hire of furniture.\n\nI met Lieut Goninon of 15th. who is convalescing after being wounded, in Bristol. I had met him previously at 4th Divisional School at La ChausÃ©e in France. After booking my room at the Royal Hotel, College Green, Goninon & myself went to the Zoo to the UK Commercial Travellers' Sports. The Sports were simply like Sunday School Picnic sports, there were dozens of side shows & a fine merry-go-round, all of which took pennies, twopences etc, tickets being pressed upon us by dozens of girls who would not be denied. The proceeds were for War Invalids.\n\nLeaving here Goninon & I then taxied to the Centre, had afternoon tea - Raspberries & cream, cake & bread & butter & a pot of tea for 1\/- each - really reasonable. Then we went to the Pictures for an hour, & afterwards had dinner at St Stephen's Hotel for 4\/9 each. We then taxied back to the Sports at the Zoo, threw balls at coconuts for pennies, fired pea rifles & saw the \"Three smallest people in the world.\" Goninon met a\n\nyoung lady, so I returned to my hotel, read a few papers & went to bed.\n\nSunday\n - Had a cup of tea in bed, a bath and breakfast, finishing breakfast at about 10.40. A heavy thunderstorm then came up. After it cleared up I went in a motorbus to Avonmouth, but the docks were closed to visitors. It is a very pleasant trip from Bristol to Avonmouth - about 6 miles for 6d.\n\nI then had a few tramrides & on one I met a gentleman & his wife named Holman of Barry in Wales. He is connected with shiip building. He was just recovering from effects of Drunkeness. I joined them in afternoon tea at the \nSwan\n. I had intended spending the night at Bath but this delayed me, so I booked a room at the Swan.\n\nMonday \n16th\n - Left Bristol at 6am & arrived at Wylye at 8 and motored to Camp.\n\nRaining on & off today. Made out Mess Accounts & collected some this evening.\n\nWrote to \nJess\n\nJuly\n","38":" ---\n\nIn camp at Codford. A Beautiful day. The 25th reinf. of 13th. Bn. (142 men & officers) arrived here on Friday night. Yesterday afternoon we had Group Bomb & Bayonet Fighting Sports. The 4th T.B won the Bayonet Fighting which went to 16th. Bn. & also the Bombing. 4th. T.B. won 1st. 2nd. & 3rd prizes for Bomb throwing & tied for 1st. in Rifle Grenade work - the 1st & 2nd. throwers being from","39":" Bn. & the","40":" from the","41":"\n\nBeautiful weather all week.\n\nEntry","42":" - A very bleak damp night in the writing hut at Lyndhurst Bombing School. Arrived here yesterday (Monday) afternoon from Bournmouth where I spent Sunday afternoon & Monday morning, staying at the Central Hotel. I\n\nOn","43":" I rode bike into Salisbury on Mess Business. Riding over a newly tarred road in Wilton the tar splashed\n\nfrom the wheels over my new coat, trousers, puttees & boots. I was in a terrible mess when I reached Salisbury, having to use sandsoap & hot water to get the tar off my face & hands. I spent","44":" in getting a tailor to try & shift the tar but it was of little use - the tar still remains.\n\nWard & I spent two evenings last week going thro' Mess Accounts as he is to take off my Secretarial duties while I am away at the Refresher Bomb Course at Lyndhurst.\n\nI was group Field Officer on Friday & so missed an \"All Night\" operation near the old Yarnsbury Castle Camp.\n\nLeaving Camp on Saturday at 7.30pm I reached Southampton about 10.30 & put up at the South Western Hotel. Slept in Sunday until 9.30, then after breakfasting I went for a walk through the Park in the city. Left for Bournmouth at 2pm. Bournmouth is a beautiful clean city, with fine up to date shops, a\n\nfine promenade pier, beautiful walks & fine bathing facilities.\n\nI spent the Sunday evening walking through the Gardens along the beach walks & on the pier.\n\nYesterday morning (Monday) I walked the streets - bought a few small articles - then did the \"Circular Tally Ho\" drive - which takes one through Bournemouth into the country, along the River Stour & back again in about 2 hours for 1\/-. It was a beautiful drive & thoroughly enjoyable.\n\nLeaving Bournmouth at 2pm it began to rain heavily & is still (Tuesday evening) very unsettled & showery.\n\nArriving at Lyndhurst Road, an ambulance wagon brought in several officers - to the Camp.\n\nHere we are in tents.Very bleak & damp last night.\n\nIt promises to be wet again this evening. Am writing to Jess & \nhome\n\n\nRead \"The Drums of War\" last evening. - fairly\n\ninteresting fatalistic story.\n\nEntry\n","45":"\n\nIn troops Train travelling from Rouen to Hazebrook on Belgian front. I am O.C. Train which consists of 50 trooptrucks & carriages. Troops include English, Scotch, Welsh, Australians & Indians. After a heavy shower of rain just before starting from Rouen at \n3.30\n the day is now delightful, the country beautiful after the rain.\n\nI am given a compartment to myself but have Jock Willis (Lt","46":" with me. We have boots, coats & collars off as it is rather warm. The Seine - a beautiful & large stream looks well - quite crowded with small stream vessels & barges.\n\nWe arrived in Rouen about 7 this morning, went to \na\n barbers for wash & shave, to Officers' Club, but as they were extremely slow there getting breakfast, Willis & myself went to a small restaurant & enjoyed Coffee, bread, butter & French Cheese. --\n\n\n\nThe Palais de Justice and\n\nThen visited the Cathedral before reporting back at 9.45 to R.T.O. (Railway Transport Officer). Informed we were to report again at 3.15pm. Therefore we trammed out to St Etienne - a suburb about","47":" miles out. Very poor quarter of Rouen. Returning to Hotel de Ville we saw monument to Napoleon 1, & visited L'Eglise Saint Ouen, a magnificent but dirty & neglected structure. We walked around the interior balcony & exterior walk on roof of this church & had more interesting views - several churches, the tower where Joan of Arc was imprisoned, the Seine & its shipping, several bridges, gardens & busy streets.\n\nWe lunched at Hotel Bordeaux - a poor lunch with sour cider which we unfortunately changed for sour wine and paid 3 francs extra. Again walked the streets, bought a few little trinkets - some swimming animals for Billie & Alan, a salt spoon & paper knife for Jay. I sent Merle some cards yesterday from Havre. Revisited Officers' Club, Slept for almost an hour in an\n\neasy chair then taxied to entrain.\n\nEntry 18th - (Arrears)\n\nHad a very busy 4 days at \nBourn\n Lyndhurst & a 3 hours' examination after.\n\nLeft there on","48":" Aug, spent the afternoon with another officer","49":" Division) in Southampton. We had afteroon tea together at the Savoy - the Crab mayonaise was delicious. We trammed out to the Common - a beautiful road and a grand heavily timbered picturesque place for picnics. The Southampton Gardens & open places are very fine. Leaving Southampton about 8.30pm we reached Salisbury about 9.30. I stayed at Neslon Temperance Hotel. Spent Saturday morning in Salisbury, bought several articles of furniture for the mess & reached Codford Camp at \nat\n 1.30pm.\n\nI was informed by Adjutant that I should most likely be going to France within a few days. So I applied for 2 days' leave - from 10pm. Wed to 10pm","50":" to 11th.\n\n\n\n\n\nEntry ","51":"\n In \nTrain\n ex \nRouen\n\nAug th Aug. I left Camp with Mess Sergeant to arrange business in Salisbury for the secretary succeeding me. Left Camp at 7.30am, arrived Salisbury about 8.40.\n\nLeft Salisbury about 1pm. for London. Arriving at London (Waterloo) I tubed to Tottenham Court Road & booked a room at \nIvanhoe \nHotel, Bloomsbury St - 6\/6 bed & breakfast. I then took a bus to North London & another to Crouch End. A fair walk brought me to Mrs. & Mrs Spears - the latter my mother's cousin.Address 31 Crescent Road, Crouch End, London N.-I was made very welcome indeed & had tea there.\n\nReturning to London I went to a theatre & saw Gaby Deslys in \"Suzette\". - a very pleasant performance ---\n\nHad supper & then returned to Hotel to bed.\n\n16th\n","52":" \nAug\n Received telegram from Adjutant that my \nleave\n for 48 hours had been approved by Group, I pondered whether\n\nto visit my mother's cousin in Durham or in Wales. Decided on Wales as it was cheaper. Left Paddington at 1 & had a quick trip to Bristol. Here waited about","53":" hours for Swansea train. Visited the business part of the city, bought postcards & gloves. Taxied back to Station.\n\nA very pleasant & interesting trip through Severn Tunnel, Newport & Cardiff & Coal towns to Swansea.\n\nMotored out to Mumbles with a Mr. Finlayson, whom I had met in the train. Booked up at Langland Bay Hotel - a beautiful building near a fine beach. Rang up Dr. Lloyd-Jones of Glen-Cerrig, Mumbles. His daughter & wife answered the phone & gave me a most cordial invitation to come to their place as soon as possible ie early in the morning.\n\n10th\n Visited Glen Cerrig - most cordially received & made quite at home. Mrs. Lloyd Jones is my mother's Cousin or second cousin\n\nI took the 3 daughters & one son's fiancÃ©e out in a boat in Mumbles' Bay. The tide here today \nrose &fell\n 38 feet which they say is ordinary.\n\nWe had an enjoyable walk along the cliffs & hills near the sea & then returned to a good dinner - Welsh lamb & Somerset Cream were the specials.\n\nAfter dinner Dr. L-J. gave me half a dozen cigars and then motored me around for about 1 1\/2 hours. Returning to Langland Bay Hotel we put my portmanteau on the car returned to Glyn Carrig for tea at 4.30pm, then motored into Swansea very quickly to catch the 5.15 train back. I got a through \"Salisbury\" car & so was comfortable to Codford. Arrived Codford Station at 10.16 pm & had a very tiresome walk over 3 miles to Camp.Reg, my brother, was waiting to meet me. He was in Convalescent Camp about 13 miles away - Hardcott & had got 2 days' leave. He brought me a pair of leggings\n\nin exchange for puttees.\n\nWe spent Saturday morning together then walked along Salisbury Road for 2 miles when he was lucky enough to get a lift in a grocer's van going to Salisbury from the Camps.\n","54":"\n Aug. Left Codford Camp at 7.30.Caught Train at Wylye at 8. Reported to Embarkation Officer at Southampton Docks at 11am. Free then until 6pm. Lt Long (51st. Bn.) was with me from Salisbury to Southampton. He was going to Bomb School at Lyndhurst. We spent the day together in Southampton until 4pm when he left for Lyndhurst. Visited Common, a picture show & parks.By myself I visited Chitterne? Bitterne? Park.\n\nReturning to Southampton I met a","55":" man on Convalescing furlough, & took him to Dinner. Then boarded the boat for Havre. It began to rain heavily.Passed quite close to Cowes & Ryde\n\non the Isle of Wight, also to the large vessel Aquitania - a hospital Ship. I slept well \nfrom\n going across the Channel.\n\n14th\n Disembarked at le Havre at 7am. - visited Officers' Club. Then walked about until 10am. Then took Harfleur train to report at Camp.\n\nAfter reporting to Camp Adjutant had a long walk to our 4th. Division Camp.After Lunch at 4ADBD I got leave & \nagain\nreturned to le Havre. Walked about the streets - some very fine streets & buildings - an extremely busy port. A few fine Boulevards.Changed £9 into francs. Trammed to St Adresse beach.Went to \nRevue\n after dinner - but it did not start until \n9.10pm\n & my last tram was at 10, so I saw only one part. Got lost among the camps returning to","56":" Div Camp & it took a great deal of walking to reach my tent.\n","57":"\n An easy day - Censored letters. Visited Dentist & received preliminary filling for a tooth.\n\nWent for a walk with Jock Willis to Rouelles Village - Saw model of the Brigand Calabrais.\n","58":"\n Censored letters. Visited Ordnance at Havre & purchased Map Case & electric torch. Posted vase to Merlie.Spent about 11\/2 hrs after dinner near the entrance to Havre harbour watching the shipping - quite an astonishing amount mixed up with destroyers & submarine chasers. Spoke with some American soldiers - Went to Picture Show until 9.50.\n","59":"\n Left base at le Havre at 8pm. - motored to Entraining Station - Had a good journey to Rouen.\n","60":" - \nAbove \n- Still passing (6pm)\n\nthrough most beautiful Country - plenty of hay, apple & pear orchards, dairies. We are stopping at Buchy, Serques Abancourt, Abbeville (11pm) Etaples (3am) Boulogne (5.30am) Calais 11\nam\n, St. Omer (1pm), Ebblinghem \n2pm\n & Hazebrouck at 3pm, but we will probably be late everywhere. It means 24hrs continuous in train at least. Cheerio.\n\nEntry\n ","61":"","62":"\n\nJust passed thro Calais where we waited 30 minutes for breakfast. I am feeling very dirty & sleepy. As O\/C train I was on duty last night & so was awakened several times. At Abbeville the Frenchmen took off the truck containing Officers' Kits & shunted it on to another line. Finding out just in time I awakened 20 men to carry them back to another\n\ntruck on our train. This truck was also shunted off at Etaples. The train started without myself & 12 men who were again removing kits to another truck on our train. However we made a fuss & stopped the train. About a battalion of Portuguese marched into the siding at Etaples while we were there. They seem to be dressed in French Uniforms with British tin hats & rifles & equipment & are small, but rather blocky lot. They all look very pasty.\n\nThe country we are now passing through - between Calais & Belgium is very low, level & marshy with plenty of old fashioned windmills like one sees in Dutch scenes. Apples & pears grow well, there are large fields of silver beet hay & lucerne. Hedges line all the roads which are good, and fields. Red tiled houses predominate, (The French Children are, and have been since daylight, along the line calling out \"Bullee beef\", \"Beescet\", \"Souvenir\",\n\n\"Pennee\" & \"Cigarette\". They are like the Kaffir children at Durban for begging, only more persistent.\n\nMost of the hay has been cut & now is lined in Stooks for miles ready to be carted & stacked. The French women & children do a great deal of field work. A good many French soldiers seem to be assisting in field work.\n\nSmall boys - they appear about 4 or 5 - smoke cigarettes with great deliberation a & apparent enjoyment.\n\nThere many canals & drains - necessary to drain the fields - with hardly any current at all.\n\nI placed 2 Australians, 2 Scotties, 3 Englishmen under arrest yesterday evening for stealing apples from a French garden where we pulled up, but I relented after a bit of rough talk to them.About 1500 of all ranks are on this train.\n\nEntry ","63":"\n - \n2.30\n pm\n\nIn Owl Trench - X or Reserve Line between Messines & Gapard Farm. Arrived here last night about 9.30 from resting at Drouancourt near Belgian Border. Coming up we had hot cocoa & milk at Bde Hqrs. Met Gen Brand here.\n\nMcKillop, Cleland, Westwood Merifield & myself. Sniped at coming in but no casualties. Trench fairly dry, but sloppy in places.\n\nIn charge carrying parties last night carrying from Mule Dump to Reserve & Front Lines beyond GapaardFarm. A quiet night comparatively here but tremendous straffing on either side, especially North.\n\nEntry\n","64":"\n\/8\/17\n - \n6pm\n\nSeveral aeroplanes overhead - our & enemy. One enemy plane came repeatedly over us this morning - Very gamely indeed\n\nHave been salvaging rifles, overcoats, box respirators, P.H. Helmets, picks shovels ammunition, bombs, magazines for Lewis guns, steel helmets, and dozens of useful articles today - & every day. - There are thousands of pounds worth of salvage lying everywhere. We buried a few Germans & one of our own unknown men - apparently killed here and partly buried by shells over a month ago.\n\nOur dugout is inside a room of an old farm which has been blown to pieces on top of dugout, thus forming a good head cover. An old German dugout in which they once had electric lights.\n\nThe trenches are very smelly & sloppy in many places.\n\nCapt Browning arrived last night (O.C. \"C\" Coy) Major Marks - arrived today.\n\nWriting to J. & my people.\n\nReceived letter from George on leave in England, also from Roy Woods in pioneers\n\nat le Havre\n","65":" - Rather a quiet day; interspersed however with bursts of artillery over us, both our own & enemy.\n\nI cleaned, examined & reset 8 boxes of Mills bombs & Rifle Grenades. They were caked in mud to such an extent as to be hardly recognisable. I also inspected new place for Mule dump. The mule train brings up rations every night to a dump & my party then man-handle these to cook houses, which are situated in German Cement block houses. Casualties about a dozen last night. Received letter from Gladys. Writing home to J.\n\n25\/8\/17\n Heavy straffing of our right front line by enemy artillery, to which ours replied in retaliation, three times today. Luckily very few casualties.\n\nI cleaned Bombs & Ammunition. Three Enemy planes over us this evening. We fired at them with Lewis Guns &\n\nrifles but with no apparent result. We improved our trench in parts today sandbagging the junction of Fanny's Trench & Owl Trench. Here two 14th Bn. were sniped last night, just as I left them. One got a bullet in shoulder, the other throught his ear. Our trench was shelled early this morning. I am \"Chatty\" today more than yesterday & expect to be more so tomorrow as I have several \"nits\" on my singlet.\n\nOne Mule train is very \"windy\" & they don't like waiting to be loaded with our salvage at the \"dump\".\n\nThe 15th. Bn. erected a cross over their late CO's grave (Major Mundell who was killed the day before we arrived here.) & also over graves of others of 15th. Bn. Two","66":" Bn. killed near here night before last also buried. The weather still good but rather cold at night. We are fortunate in having no rain. Read a very interesting novel \"The Impenitent Prayer\"\n\n\"There are 3 of them esses toe315 and one pip C\"- Message on phone.\n","67":"\n - In dugout in Owl Trench near Gapard Farm, Messines.\n\nI have just returned from Ration Carrying. We had a very lively time as Fritz evidently saw our Mule train coming over the ridge in the Moon light & gave us shells & machine gun fire hitting two mules but luckily missing my party.\n\nWe deepened our trench during the past few days, revetted & drained a good deal of it. Last night we were carrying kneedeep in water for a considerable distance but our draining & duckboarding today made our track fairly dry for tonight. A captain & Corporal of - - have just been making preliminary arrangements for taking over from us tomorrow night.\n\nEntry\n -","68":" -\n\nIn billet at Madame Richomme's, Lisbourg. I have a comfortable well ventilated room & very clean. Madame has her daughter & the daughter's children living here. Her son in law is at the war. They are all very obliging. On the night of","69":" we were relieved by","70":" Manchesters. After a tiresome & muddy march we had hot soup at Brigade canteen & then came on to Neuve Eglise where we stayed \ntwo\none night\ns\n. Here we all had a bath and a clean change of clothing which were very much appreciated by us all. On the","71":" we were billted near Vieux Berquin having arrived here on evening of","72":" after a long tiresome march. Lt Parsonage and Lt Turner who had been on leave in England joined us here.\n\nOn\n","73":"","74":" we marched a few miles & then came on in Motor Lorries - 150 - to Lisbourg. Yesterday & today have been beautiful sunny days. This afternoon we all played cricket after a great deal\n\nof trouble in finding a decent ground. Wrote to J. George & Mother.\n\nNames of Hotels & Estaminets I noticed along a road.\n\n\"Au Gros Mur\" - The Big Blackberry\n\nA l'Epinette - The Little Pinetree\n\nAu coeur joyeux -- The Joyous Heart\n\nDemur Chretien - The Demure Christian?\n\nAussi bon qu'ailleurs - \"The As-Good-As-\n\nElsewhere.\"\n\nLe coq rouge, \nle\nAu Cheval blanc., Au cheval noir.\n\nEntry","75":"\n - Going to Brigade Pierrot Show in a few minutes. Received Letter from J.","76":" yesterday. Dug trenches for bombing yesterday with 50 men - quick work done.\n\nWeather still fine but occasionally showery with thunder.\n\nIncidents\n - Madame sells the fowl run over by heavy motor lorry (6 francs).\n","77":"fight leads to noisy quarrel among neighbours. -\n\nPyjamas\n fairly astound the whole family; they had never heard of them before. The same experience by other officers\n\nEntry\n","78":"\n A beautiful calm day, sun shining brightly. \ncalm.\nHave just come in from giving instructions in firing Hales No 20 Rifle Grenades & Mills No. 23 with a 10 inch rod.\n\nLast night we marched a mile across country in our box respirators.\n\nEntry","79":"\n In tent at Staples. We arrived by motor bus yesterday. I am Battalion Orderley Officer today.\n\nThe people at L- treated us very well & were really sorry when we were leaving.\n\nWe had a Bn. dinner on","80":" at L-a very decent affair.\n\nWrote home to J today.Received letter from George.\n","81":"\n In tent shelter at Steenvoorde, West of Ypres. A terrific cannonading is going on this evening west, north west & South of us.\n\nThe people here are Flemish & cannot understand French. In fact, although\n\nwe are in France, they understand so they say, English better than French. They have swinish habits of eating and are filthy in mind & body. Their two meals today consisted of potatoes partly mashed in olive oil. Meat, I have not seen eaten by the French, in the four families I have struck. Walnuts grow well here & are just about ripe now. I had plenty last night. Barcelona nuts are plentiful along the roads about Lisbour. Raining this evening. \nRained\n heavily and came through our tent last night.\n\nEntry","82":"\n\nBelgian chateau near \nYPRES\n\nCamped near Belgian Chateau, about a mile from Ypres. This is my third camp here in a fortnight. We camped here for about 30 hours before going into the line., two nights on our return from the line or rather one night and a bit, for the first\n\nnight we did not arrive at camp from the trenches until about 3am. We came from Steenvoorde in 'buses. Left our packs & valises here in our transport lines while we went up the line.\n\nIt was a tiresome walk up. We had tea at China Wall & then went on. At Hellfire Corner we were stopped by a heavy barrage but luckily had no casualties, although troops nearby & mules were suffering severely. Crossing Westhoek Ridge we were again pelted with Jack Johnsons. The march in the dark, over frightfully boggy shell holey ground was very trying. We went thro' the heaviest barrage I have yet gone through but quite marvellously without a casualty in our company. The following company had 4 killed and a few wounded. The morning after the relief there was a heavy fog \non\non the low ground in front of us. Lt Joe Westwood took out a small fighting patrol of 10 and surprised & captured a German working party of 10. They were\n\nvaluable for Identification purposes - belonged to 49 Prussians. It is hard to imagine their pleasure \nof\n at being captured. When they reached us they were all smiles & delighted exclamations.\n\nWe were heavily shelled at periods during the next day and night, also the second day in. On the night of","83":" we advanced a sap out into No Man's Land for 150 yards so that we should have less to complete after the coming attack in order to reach the new objectives. On the \nnight of\n the 25th. we brought down two enemy planes that were rather inquisitive. One toppled over about 300 yeards in front & remained on its back, the other fell about 1000 yards in front. One man ran from the former and we observed two running from the latter toward the German lines. I claimed & was given the credit throughout my Company of bringing down these & another plane the next morning. As at Gaspaard Farm I organised a party of rifles to fire 3 lengths in front & 3 above a plane flying either towards or parallel to us. TheLewis Guns co-operated in the fall of the\n\n\n\nsecond plane, but Rifle fire alone was responsible for the first. The next morning after the attack we brought down a third in our new lines. It fell near the ancient mound in Polygon Wood - The Butte of Polygon. This mound is an old prehistoric burial place so old that old trees cover it as they do the Wood. Rather stumps of old trees for our artillery has smashed the wood to splinters.\n\nOn the night of the \n25th.\n The enemy drove in our outpost & patrol from its position about 150 yards out in Noman's Land. I was given the task of recapturing & reconsolidating it. After a very exciting scouting trip & continuous dodging from shellhole to shellhole, also dodging a German machine gun that swept across us every few seconds we bombed the position & then rushed it. But the Germans had left. However we went about 100 yards further out to reconnoitre for we could hear Germans working\n\nand talking. I was also anxious to find the dead or wounded Germans reported by our outpost to be killed before the retirement of our party. They would be useful for identification purposes. We brought in the packs of two killed & also a wounded German - 49th Prussians again.We dressed him & sent him back.\n\nThe Intelligence officers were now busy setting out tapes to guide the 16,14,15 Battns. into position for the attack the next morning.\n\n26th. Sept\n\n\nWe had held our front line position for 3 nights & had made No Man's Land good. The 16th were going through us to take the first line about 700 or 800 yards ahead, & the 14th & 15th through us & them - leapfrogging - to take final objective about 1200 yards out. At daybreak our wonderful barrage came down cutting a clean line just ahead of us. Those who have \nnever\nnot seen & heard a barrage like this can never imagine it. Theturmoil of even the\n\nelements would be minute when compared with belching of thousands upon thousands of big guns supported by a continuous hail from hundreds of machine guns. The whizzing over our heads was like that of millions of serpents and then the bursting of thousands of shells just in front. We watched it in amazement ducking our heads whenever a shell passed low. Any such ducking would have been too late. This went on for a few minutes. Then \"Get Ready 16th\" was heard & the 16th (Westralians) lined up just behind where our shells were churning the ground. It was grand. Almost every man lighted a cigarette quite cooly - although many had never been under such a barrage - or any barrage before. I saw some men who were in action for the first time. What wonderful faith they had in the gunners behind and in the shells themselves. The few minutes passed slowly. The 14th & 15th\n\nwho were supposed to be 200 yards behind the 16th. were anxious & had come close up. We won't wait for the - barrage, we'll show it the - way\" I heard from a 14th. \nThen the\n\"What the hell are you in a hurry for?\" replied an older soldier; \"we'll get enough before we've finished.\" \"Oh, go and get your face camouflaged,\" was the reply courteous.\n\nThen the swish lifted, the line of dust churned ground & hurtling lead & iron crept slowly forward never missing a square foot of ground. \"Come on 16th\" some officers exclaimed. \"Here help me over your trench 13\" said one after another as they hurried to take their place. And the whole line moved forward. We watched them mingle into the smoke& dust - (am going to issue rum now), then the line of 14th & 15th went over. Soon they too were lost to sight. Then the wounded began to trickle back; first walking cases then stretcher cases. Then a batch of\n\nbewildered but pleased prisoners without a guard. We rounded them up into stretcher parties & made them carry back the wounded. This they cheerfully did. The smoke & dust clearing somewhat we saw the","84":" on their captured line consolidating & higher up on the slope of the ridge the 14 & 15 also in position consolidating. One batch of about 200 prisoners now passed back, also a few here & a few there. We got 500 on our brigade front line I believe The German loss in killed must have been great. We officers walked about on top to show the men confidence. Even if we didn't feel it we pretended quitea nonchalance. Soon every man was out carrying bombs, water, ammunition etc to the captured positions or bringing in prisoners & wounded. Then a shell lobbed in our left outpost & smashed up our Lewis Gun crew - 2 killed & three wounded.\n\nEntry","85":" \n1917\n - In small tent, sandbagged around, near Belgian Chateau.\n\nPosted letters tody.\n\nThis morning I took a party of 30 through Ypres in a lorry to BirrCross Roads & then we walked to near Westhoek. We banked up a cable from here back to BirrX roads about a mile. Heavy shells came over us & scattering & burning a few dumps but luckily we had no casualties. I examined a tank in a crater. It had evidently been mined. I got a piece of a tank shell case from it. We have not used the tanks much lately. No one who has not seen Ypres can ever imagine the wreckage of beautiful buildings there. It is the worst I have seen for a large town. I have seen smaller towns on the Somme & near Messines totally obliterated except for a few bricks here & there, but for a city like Ypres, it is terrible\n\nEntry ","86":"\n - Midday. Raining heavily on and off since last night. A light railway train is puffing past my little tent. Wonderful what loads these 2ft. lines carry. This engine is now pushing over 120 tons of munitions & there are hundreds of these engines as well as bigger ones always going on dozens of lines. There are immense military stores everywhere one goes. It is no wonder a dump or two are now & again blown up by enemy shells. Yesterday morning four of our Australian divisions made another very successful push. They caught the Germans just ready to attack us. They were lined up on their tape - 1500 of them - at daybreak when our terrible barrage came down. Not one escaped - 900 were killed & 600 captured - so I have had it reported to me by an officer of","87":" Bn who was there.\n\nHeavy guns are constantly firing somewhere or other the nearer reports sharp & incisive, those far away like the trembling\n\nabout & rolling of big tanks. A roll another longer roll, a bump or two, a heavier bump, a roll and all over again. I think of a big tank, or several of them, on wagons, being hauled over a corduroy road. Some of the guns over 10 miles away shake the sandbag walls of my tent, while the naval 10 inch gun about ¼ mile away shakes the earth here quite violently. Six of my men are filling in Shellholes where enemy shells have struck our cable routes, out east of Ypres.\n","88":"\n Have a slight cold so have just had a hot rum & condensed milk & got to bed. Raining nearly all day. Went for a long walk this evening for exercise. Very muddy & slushy. Took 6 men over to Kruisstraat Farm to act as runners for Signallers. Inspected men's feet, all O.K. Received a big mail today for the company. I received 5 from Joy. Wrote to J - the 6th time this week. Read magazine.\n","89":" \n- A cold miserable rainy day - raining all day long. A tremendous bombardment is going on up North. Everywhere everyone is soaking wet, but still we carry on while skunks at home stab us in the back by \"striking\" against their Government while we are over here. I can understand people striking against private employers or against a\nn\n Governemnt that does not represent the Majority, but against a Government where we have universal suffrage & at this time! I am sure they cannot possibly appreciate the position. I have been censoring men's letters, most of them unionists, and they unanimously express disgust against those at home striking against the Government.\n\nRead \"The New Magazine\". Heavy bombing took place several times during last night, several bombs striking fairly close to us. Three of my men have Dysentery.\n","90":"\n Very wet miserable day. The ground is frightfully sloppy. I visited Ypres today & saw Lts Nugent & D'Arcy-Irvine near Lille Gate. Had pleasant afternoon tea with them and invited them to tea with me tomorrow evening. I arranged with 1st Bn. Pioneers to allow their men (Nugent & Irvine) as well as my own to have a hot shower bath tomorrow afternoon. Got wet through coming home. Have just issued rum ration & am going to bed to read \"Bulletin\" of 12 July before going to sleep. Tremendous cannonading on up north all last night & this morning. Met Sid Lloyd (57th Bn) in Ypres going into the line.\n\nRequisitioned extra socks & some new boots for my men on account of wet weather & heavy wear.\n\n10th Oct (Morning)\n\nVery wet. Our relief for the cable track repairing job arrived last night - from 3rd Bde. - 9, 10, 11, 12 Bns. Lt Devine o\/c\n\nI wired Bn. this morning notifying releif & awaiting instructions. My party had a hot shower bath last night at 1st. Pioneer Bn. Baths. Lt Swinburne & myself visited","91":" Div Canteen yesterday to buy goods. Then had a hot shower. Read a Bulletin & a \"New Magazine\". Rain has evidently set in for a few days. Heavy fire up North towards the Coast. -\n","92":"\n 1917 - Near Caestre & FlÃªtre resting, or rather supposed to be, as there is not much rest in a muddy place like this in wet weather. Leaving Kruisstraat near Ypres on evening of","93":" we rejoinedBn. at Montreal Camp. The next morning ","94":"\n the Bn. moved up the line, but myself & party came back here in motor 'buses. Very damp ground even inside the tents.\n","95":"\n Today I was prosecutor in a General Court Martial (President Major Hyndman, Members, Capts Mosely (13) & Capt(16) - but witnesses did not arrive from Aire, so case was adjourned.\n\nPlayed cards last night & today and lost beaucoup francs. Censored letters\n\n16 ","96":"\n In barn near Caestre & FlÃªtre. On Sunday \n14th\n I conducted 50 men up to Ypres to join the battalion \nf\n before they went in. We left camp in two motor buses at 8.15 & reached Ypres about 10.30. Returning an hour later I took an English wagon from Ypres to Poperinghe. Stayed there an hour. Then took Australian wagon to Abeele on Belgian border then walked 2 miles, took another Australian Bus to Steenvoorde. Leaving Steenvoorde I took a Canadian bus going to Hazebrouke asfar as a small village, then another Canadian lorry to Caestre. Very cold sleeping in a damp tent.\n","97":"\n Nugent left this morning on his English leave. I took Bn. details for Route March to Strazeele & FlÃªtre, inspected their feet & took a shortage list.Then supervised banking around tents to prevent spreading of bombs that may\n\nbe dropped by enemy planes. Last night a big French plane was brought down near here by our guns. It was lost on its return from a raid & was showing no lights, hence our gunners took it down, much to the annoyance of the French aviators. I visited it today. Very cold again this evening.\n","98":"\n Jay's birthday.Took Bn. for route march this morning. This afternoon our Brigade played","99":" Bde Rugby and Australian Football. The former a draw we lost latter by 10 to 62 pts.\n\nEntry ","100":"\n\n18th\n This afternoon Geo. Marper & myself visited our Transport Lines near Ypres to get any mail. We caught a motor transport from Fletre to Ballieul. Here we bought a serviette ring each & some postcards. The next lorry took us to Locre where just as we were getting down, General Plumer passed us. A walk for a ½ mile and another lorry\n\ntook us to \nReninghelst\nLa Clytte, another walk & another lorry to \nRoningheft\n near Dickiebush, still another walk & a ride in a staff car to Cap Belge & finally most muddy walk brought us to the Camp near Belgian ChÃ¢teau and also disappointment for the mail. Administrative Bn. Hqrs were at Ypres, about 2 miles farther on & which it was already too late to visit. So we had tea with Padre Rettie & returned. Catching a lorry at Vlamertinghe we journeyed to Canada Corner on the Border where we caught another lorry to Ballieul. Some exciting runs helped us to catch two other lorries along the Ballieul - FlÃªtre road. The second of these was loaded with Australians singing as if their life depended on it. We all sang all the old songs we could remember until we debussed at FlÃªtre, giving a tip to the Tommy Motor driver. Our Australian transport drivers won't take tips from us, but the Tommy driver always - as far as my experience goes - welcomes them.\n\nWe arrived back at Camp late and enjoyed another good dinner. Our Bn. hadseveral Gas Casualties.\n","101":"\n - Route March through Strazeele after sleeping in until 11am. Tired after our journey to Ypres.\n","102":"\n \nSaturday\n Paid about 100 men & officers.Route March through Struzeele & Borre.\n","103":"\n \nSunday\n Changed camps \nfrom\nto \n\nnearer Caestre. Played cards.Wrote to Jay, Reg & Mother. Received letter from Reg, George & Elsie L Jones.\n","104":"\n Resting this afternoon after an inspection this morning. We are expecting an order to move any minute to another camp. Have censored letters. A fine day.\n\nEntry - Morning","105":" -\n\nSitting by fire in Billet in Rue d'Heuchinat Fontaine-les-Boulans. Have just inspected my platoon's feet - one man with slight \ntrench toe\n\nOn \n23rd\n we marched from Caestre to Reninghelst, a long wearisome march and arrived at Reninghelst at 4.30pm. Camped in tents that night. A very stormy wet night. The next day","106":" we went into huts & billets in Reninghelst. We messed at Officers' Restaurant, managed by Belgian women. Here we had plenty of omelettes - each egg about a franc. I bought 30 francs worth of Clunes & Torchon Lace for Jay. We were bombed here each night but luckily none fell on our quarters. We left Reninghelst at 5am","107":" & marched to a siding near \nVlamertinghe\n. Here we were issued with rum & as we had had no breakfast & had just had a long 5 mile march, it soon made everyone talk.\n\nSome men collared two jars of rum. These could not be found by the officers looking for them - naturally in crowded carriages. Hence we had a great many very drunk when wedetrained near St. Omer,\n\nThe Guard was kept busy. Near St Omer embussed and came South to this place where we hope to remain for over a month at least. It is a very countrified quiet place with tremendously hard working farmers. Joe Westwood & I walked through Henchinyesterday (Sunday) morning & made a few purchases. Joe \nwon\n has his MC won on","108":" The town of Lisbourg in which wewere billeted last time we were in this area is about 5km distant. Hence many of our officers & men yesterday visited the place & received a great warm welcome. Also the","109":" Bn. visited here - their place last month- & received similar warmth.\n\nEntry\n - ","110":"\n A dull day. It is now 4p.m. and almost too dark to write. We have been here a week now, and are all doing well in the quiet farming village. About 40 men were evacuated yesterday with skin troubles such as scabies, which is a common complaint. The gassed men\n\nhave not yet got their voices back, & on all sides one hears whispering men & a good deal of coughing. We have played cards each evening lately to pass away the time. Col. Durrant arrived during the week & took over the Bn. - Col. Marks went on leave today to South of France & Italy. I have practised revolver shooting this week with fair results, splitting a beetroot three times out of four shots on an average of 20, 25 or 30 yards.\n\nDes Betteraves\n\nWe had two football (Rugby) matches yesterday \"C\" Company defeating \"D\" by 3-0 & \"A\" defeating Bby 9-0. Our men are practising for Bde tournaments. I bought for \"C\" Coy enough straw for sleeping on but some getting muddy. I tried to get more today but was unsuccessful as there was none beaten. The farmers are all covering their beets forwinter feed for stock. \n\nWe have a very comfortable & well managed Bn.Mess in a fine large chateau. Major Murray V.C. D.S.O. is President & Lt \nEast\n Secretary. Joe Westwood received his M.C. ribbon from Gen Birdwood today.\n\nA few days ago I received a fine box of chocolates from Reg in London. I have applied for Paris leave & am hoping to get it.\n\nEntry","111":"\n - Yesterday (Sunday) was my 31st birthday. An Ausralian mail was delivered but unfortunately for me I received none. There is another batch of Australian letters in today & so I still have a chance. I received a Deniliquin paper from my mother. After Church Parade in the field yesterday, we had a Bn. Football match, A & B Coys versus C & D. Neither team scored. Then after afternoon tea Joe Westwood & I walked across to Lisbourg to visit our old friends there. The welcome we received was one of astonishing warmth, considering that we were soldiers they were practically obliged to billet. They all (3 families\n","112":"\n\nvisited) made us overeat & overdrink ourselves, had cooked pullets & a rabbit in case we should chance to come. A rabbit is worth about 8 francs here & is \"some\" luxury. Joe was very happy with Celinde Richomme while I talked with her old mother. We met Merrifield there. These French people fairly idolise us. Our men behaved themselves excellently there in September. Several French soldiers have asked me for information about Australia & have expressed their intentiion \nof\n to emigrate to there after the war. They would be very valuable citizens too, especially the farmers from this district.\n\nLeaving Lisbourg about 10.15pm we took a little over an hour's quick walking to reach our billet. We each gave the children a couple of francs.\n","113":"\n I conducted \"C\" Company musketry this morning & censored letters for an hour this afternoon.\n","114":"\n In Paris with Joe Westwood. We received permission at midnight on","115":" - caught train at \nAnvin\n for St Pol on","116":" & thence to Amiens.Here we changed for Paris. We were accompanied throughout our train journey by Officers of Indian cavalry who spoke excellent English. Arrived Paris \nGare du Nord\n at 9pm, took tube to \nRepublique\n, dined well at \nArmy & Navy Club\n and then booked up at Hotel Moderne, on La Place de la Republique. We then went on a walk through several streets but rain came on.\n\nThis morning we tried unsuccessfully to get a bath \nbut\n. Although we ordered it at 8 it was not ready at 10. We had a cold cup of coffee & a small piece of bread & butter for 2 francs each and a tip. I asked Waitress for newspaper. She sent a boy who also had to be tipped. We had no soap & asked for a little\n\non the washstand. Waitress made a big fuss & sent waiter with a small common cake worth about 1½ in Sydney, for which he demanded \nun sheeling\n (1\/-) also a tip. At last we got away from the hotel & walked through several main streets, including the \nHalles\n orMarkets.The streets & boulevards are magnificent. We visited Palais Royal, Bourse, reported to A.P., Mon Place du MarchÃ© de St HonorÃ©. then we walked to the \nTuileries\n Gardens. Everywhere we were asked for collections for wounded prisoners of war, orphans & other purposes. Many Americans are in Paris, a fine class of man too. The Place de la Concorde is a beautiful square with groups representing the departments of France. Those of Alsace Lorraine were covered with wreaths. Our next walk was along Champs ElyseÃ©s, & over the Bridge of Alexander 111 to Les \nInvalides\n. Here there are a War Museum\n\nshowing aeroplanes, captured guns. mortars etc, the aeroplane of Guynemerthe famous French Aviator, a picture gallery of war pictures & above all the tomb of Napoleon. We all take off our hats to the idolised \"Hero\" of France.\n\nAfter afternoon tea we taxied through the Champs ElyseÃ©s to Etoille and the Arc de Triomphe.\n\nEntry","117":"\n Yesterday ","118":"\n we visited Hotel de Ville, Eglise St Georges, Notre Dame, Palais de Justice. The interior of the Hotel de Ville is extremely magnificent, the walls of three halls and the roofs being covered with valuable paintings of industries, professions & allegories. Notre Dame was rather a disappointment after the cahedrals of Amiens & Rouen. In the evening we went to a Cinema.\n","119":"\n This morning I slept in late. When Westwood came in it was about 11am. So we waited here at Hotel Moderne for lunch. I wrote to Jay & prepared postcards for the post. This afternoon we visited Bastille, Boulevarde Germain, Chambre des DeputÃ©s, Effel Tower, the Great Wheel on which we went.\n\nReturning we went through \nCommerce\n a very busy shopping suburb. Here I bought a few articles for Billee.\n\nA tube (Metro) brought us to \nMadeleine\n\nfrom\n near\nRue Royale\n in which is the famous \nMaximes\n where we had a couple of Manhattans with another Australian officer we met there.\n\nAfter Maximes we walked Boulevards des Capuccines & continued right along the street to RÃ©publique.\n\nAfter dinner we had an interesting conversation with Miss O'Connor an Australian Artiste who has lived many years in Paris & Madame Rieu whose husband, an Englishman, was killed two months ago in The Foreign Legion of France\n\nEntry ","120":"\n (In Restaurant at Anvin \nnear\n St Pol (Pas de Calais). Just arrived here from Paris. Left Paris this morning at 9, passed through Amiens to Abbeville. Here we caught a goods train to St Pol, as the passenger French train would not get us to St Pol before 11pm. As it was we arrived there at 5.30. Then after visiting officers' club for Refreshments to wash we walked along the road & picked up a Motor Transport to Anvin where we are now awaiting dinner (7.40pm) before walking 6 or 7 km to our billets in F-.\n\nYesterday","121":" Westwood & myself visited Boulevarde de Michel, Cluny ruins, Latin Quarter, Pantheon (exterior), Eglise St GÃ©nÃ©vieve, Jardin des Plantes, including a poor Zoo, taxied to Jardin de Luxembourg, spent a pleasant hour there, then taxied through Champs ElysÃ©es, past Etoille & Arc de Triomphe, through Avenue de la Grande Armee to Pont de Neuilly & back to Arc de Triomphe.\n\nThis magnificent Arch we examined with the greatest interest. It is inscribed with the names of all Napoleon's generals in each of his wars & all his victories among which I noticed \nYpres\n the scene of so much in the present war. Walking from Arc\nh\n de Triomphe through Champs Elysees & Place de la Concorde to the Madeleine, a beautiful church with an exquisite interior lavishly adorned with white sculptings.\n\nA short walk brought us to Restaurant de l'Opera where for 7 francs each we had an excellent dinner. After a visit by tube to Gare du Nord we promenaded from Opera to RÃ©publique visiting a Cinema on the road.\n\n"}}