{"Document Name":{"0":"Diary_0024","1":"Diary_0024","2":"Diary_0024","3":"Diary_0024","4":"Diary_0024","5":"Diary_0024","6":"Diary_0024","7":"Diary_0024","8":"Diary_0024","9":"Diary_0024","10":"Diary_0024","11":"Diary_0024","12":"Diary_0024","13":"Diary_0024","14":"Diary_0024","15":"Diary_0024","16":"Diary_0024","17":"Diary_0024","18":"Diary_0024","19":"Diary_0024","20":"Diary_0024","21":"Diary_0024","22":"Diary_0024","23":"Diary_0024","24":"Diary_0024","25":"Diary_0024","26":"Diary_0024","27":"Diary_0024","28":"Diary_0024","29":"Diary_0024","30":"Diary_0024","31":"Diary_0024","32":"Diary_0024","33":"Diary_0024","34":"Diary_0024","35":"Diary_0024","36":"Diary_0024","37":"Diary_0024","38":"Diary_0024","39":"Diary_0024","40":"Diary_0024","41":"Diary_0024","42":"Diary_0024","43":"Diary_0024","44":"Diary_0024","45":"Diary_0024","46":"Diary_0024","47":"Diary_0024","48":"Diary_0024","49":"Diary_0024","50":"Diary_0024","51":"Diary_0024","52":"Diary_0024","53":"Diary_0024","54":"Diary_0024","55":"Diary_0024","56":"Diary_0024","57":"Diary_0024","58":"Diary_0024","59":"Diary_0024","60":"Diary_0024","61":"Diary_0024","62":"Diary_0024","63":"Diary_0024","64":"Diary_0024","65":"Diary_0024","66":"Diary_0024","67":"Diary_0024","68":"Diary_0024","69":"Diary_0024","70":"Diary_0024","71":"Diary_0024","72":"Diary_0024","73":"Diary_0024","74":"Diary_0024","75":"Diary_0024","76":"Diary_0024","77":"Diary_0024","78":"Diary_0024","79":"Diary_0024","80":"Diary_0024","81":"Diary_0024","82":"Diary_0024","83":"Diary_0024","84":"Diary_0024","85":"Diary_0024","86":"Diary_0024","87":"Diary_0024","88":"Diary_0024","89":"Diary_0024","90":"Diary_0024","91":"Diary_0024","92":"Diary_0024","93":"Diary_0024","94":"Diary_0024","95":"Diary_0024","96":"Diary_0024","97":"Diary_0024","98":"Diary_0024","99":"Diary_0024","100":"Diary_0024","101":"Diary_0024","102":"Diary_0024","103":"Diary_0024","104":"Diary_0024","105":"Diary_0024","106":"Diary_0024","107":"Diary_0024","108":"Diary_0024","109":"Diary_0024","110":"Diary_0024","111":"Diary_0024","112":"Diary_0024","113":"Diary_0024","114":"Diary_0024","115":"Diary_0024"},"Date":{"0":"unknown","1":1384.0,"2":1385.0,"3":1386.0,"4":1387.0,"5":1388.0,"6":1395.0,"7":1396.0,"8":1397.0,"9":1398.0,"10":1399.0,"11":1400.0,"12":1401.0,"13":1402.0,"14":1403.0,"15":1404.0,"16":1405.0,"17":1406.0,"18":1407.0,"19":1408.0,"20":1409.0,"21":1410.0,"22":1411.0,"23":1412.0,"24":1413.0,"25":1414.0,"26":1415.0,"27":1416.0,"28":1417.0,"29":1418.0,"30":1419.0,"31":1420.0,"32":1421.0,"33":1422.0,"34":1423.0,"35":1424.0,"36":1426.0,"37":1427.0,"38":1428.0,"39":1429.0,"40":1430.0,"41":1431.0,"42":1432.0,"43":1433.0,"44":1434.0,"45":1435.0,"46":1436.0,"47":1437.0,"48":1438.0,"49":1439.0,"50":1440.0,"51":1442.0,"52":1443.0,"53":1444.0,"54":1445.0,"55":1446.0,"56":1447.0,"57":1448.0,"58":1449.0,"59":1450.0,"60":1451.0,"61":1452.0,"62":1453.0,"63":1454.0,"64":1455.0,"65":1456.0,"66":1457.0,"67":1458.0,"68":1459.0,"69":1460.0,"70":1461.0,"71":1462.0,"72":1463.0,"73":1464.0,"74":1465.0,"75":1466.0,"76":1467.0,"77":1468.0,"78":1469.0,"79":1470.0,"80":1489.0,"81":1490.0,"82":1491.0,"83":1492.0,"84":1493.0,"85":1494.0,"86":1495.0,"87":1496.0,"88":1497.0,"89":1498.0,"90":1499.0,"91":1500.0,"92":1501.0,"93":1502.0,"94":1505.0,"95":1506.0,"96":1507.0,"97":1508.0,"98":1509.0,"99":1510.0,"100":1511.0,"101":1512.0,"102":1513.0,"103":1514.0,"104":1519.0,"105":1526.0,"106":1527.0,"107":1528.0,"108":1529.0,"109":1544.0,"110":1545.0,"111":1546.0,"112":1550.0,"113":1551.0,"114":1552.0,"115":1553.0},"Entry":{"0":"\n\n","1":"\n\nSeeing as how I am 10 days behind I will not be able to record the dates for a time until I catch up so here goes.\n\nI must start from the morning I got my leave & set out for bonnie Scotland, caught the morning train at Amesbury & was in the big smoke in a couple of hours, slipped round to Horsferry Road & drew my leave money & through a little mistake in the pass they would only pay me for 9 days instead of 10, had a great argument over this but no good I had to go without it, I had no intentions of stopping in London so that night I took the tube to Euston & caught a fast train while I was in London I saw Digby & Peter Bowling they had just come across, strange to\n\nsay Digby was across the same time as I was last year, travelled all night & morning found me in Glasgow a fine big town, I had my breakfast here & then a hurried look round, that same morning I took the train for Edinburgh with the full intention of going on to Sterling, but first of all I must mention a little coincidence just as I stepped off the train at Glasgow I ran fair into Corrigan he came across the same time as Digby & I 18 months ago, you could have knocked both of us down with a feather neither of us had any idea where the other was & to think the whole 3 should have met again & Corrigan had travelled all night in the next compartment to me & did not know it. When I landed in Edinburgh it was drizzling rain, & things looked pretty miserable, one of our chap advised me to go up to \n\nRamsay Lodge a place for Overseas soldiers so up I goes up a very steep hill only to find the whole joint crowded out, so they sent me round to the overflow house \"Blackie House\" here I got fixed up, & gave the Matron all my money &etc to look after, had some dinner & then went down the city, what a wonderful place Edinburgh is, all the while I was there I don't think I saw a single wooden or brick house nothing but solid stone is used & it gives the place the appearance of being as solid as a bell. Princes Street is something splendid, reckoned to be the finest street in Europe & I can quite believe it on one side there is nothing but beautiful big buildings stretching for a good ¾ of a mile & as straight as a die while the other side there are fine gardens statues &etc the whole way along & overlooking it all\n\nstands Edinburgh castle perched right on the edge of a big cliff it is a splendid sight & one I am very glad I have seen.\n\nI wandered about the city all the afternoon for now it had cleared up & the sun was shining, I was strolling in the Gardens quite casually when I saw 3 girls approaching, not that there was anything unusual in that for there were thousands in there but one of them sent a thrill through me & I knew something was going to happen, she was dressed in a brown dress & hat & a black fur round her neck, also she was the shortest of the bunch I could scarce keep my eyes off her I don't know what she must have thought of me, but I know I would have given something for an introduction, but I knew this was impossible for I had no friends, there, so I started to \n\nthink furiously how I was going to have a talk to her, we passed one another & I thought I saw just the faintest smile on her face but I was not game to say anything after they had gone a little way I turned round, walked in their direction & passed them, at the end of the track I decided to put my luck to the test & speak to her as she passed, I have no idea what I said I only know the lot pulled up to see what I wanted for they are very obliging & will go to a lot of trouble to put you right, we were talking for a few minutes on one thing & another & I plucked up my courage which was fast deserting me & asked the smaller one if she would show me round for a little while as I was only a stranger, she hesitated for a time & then consented, she had a good look at me & evidently thought I was genuine, so she introduced \n\nherself & the other girls to me after I had told her my name, I was in the 7th heaven of delight as we walked along & she pointed out the various old places & sights, we went down by train to Portobello & strolled along their promenade, I was walking on air for she was a little beauty & no mistake very small about up to my ears, lovely brown eyes black hair & the best set of teeth I have ever seen & a complexion like a rosebud, I could tell by her speech she was well educated & refined in her tastes, her name was Peggy Middlehurst & we were soon quite friendly & she trusted me, at 9.30 I took her home she lived up in the best part of Edinburgh, & before parting I made an appointment with \nthe\n her for tomorrow night, on my way back I was stopped by dozens of women but I could no more think of going with them after being in Peggy's\n\ncompany than flying in the air, so I strolled slowly home & went to bed quite happy, I always thought I was girl proof but what a \"gutser\" I have come.\n\nAll next day passed slowly & I thought 7 o'clock would never come & I thought perhaps she would not turn up, so you can imagine my feelings, but on the tick of 7 I saw her coming looking more beautiful than ever, & this time she took my arm & off we went I had booked 2 seats at a theatre during the day & we went there & spent a most enjoyable evening when I took her cloak & hat off I thought she was the loveliest girl I had ever seen, she had a white blouse shot with green on & her black hair was held back by a velvet band around her forehead, a lot of the people around couldn't keep their eyes off her & I know I couldn't I\n\nwas a prisoner pure & simple. We were among all the heads & it was no trouble to see that she was well born she carried herself so well, I felt quite proud of myself all this was a new sensation to me for I had always been shy of girls but things seemed so different now I seemed lifted out of myself as the saying is, & I am sure I am a different man today, I can quite understand how it is now that a woman can have such an influence for good or evil over a man. I took her home again that night a fine place she lived in, & as the next day was a general holiday I asked her if she would come out again, she said yes, so we decided to meet again next morning at 10.30. I was there to time & she woman like was about 10 minutes late, what a day we had I shall never forget it, first of all we went out by train to the \nRed\n Braid\n\nHills from there you get a magnificent view of all Edinburgh which lies at your feet, I took my camera out & got a few shots from here we taxied down to the Waverley railway station & I booked 2 first class fares to Burnt Island about 20 miles out & a very picturesque pleasure resort, we crossed the great & wonderful Forth Bridge on the way arrived at Burnt Island we had some lunch & then went down to the sea & had a stroll round, about 3 oclock we came back to Edinburgh & then motored out to the Forth Bridge stopped out there till about 7 oclock & then came back & went to the theatre again I had booked good stall seats early in the morning & we spent an enjoyable evening after the theatre we had supper at a fashionable\n\nrestaurant & then I took her home tired but happy, & so the days went on, we were out on every possible opportunity, she told me all about herself & people & I told her about mine, things ran nice & smoothly & I was happy. You should see the Colonials in Edinburgh Australians especially & they are just it there, I never saw a single Colonial misbehaving all the while I was there. They have a very poor Zoo, but they make up for it in their Museums she is the finest I have ever seen. They are also behind in their train system using the old cable yet, they are both slow & noisy but in cleanliness order & etc they are right on the top.\n\nI saw some splendid crops of wheat about Scotland, they were getting it in as fast as ever they could while the weather was favourable.\n\nThe Scott Monument close to Waverley station is a very fine piece of work, another Sgt & I climbed right to the top & from it you can see all over Edinburgh, she is 200 ft in height, has 287 steps, the Architect was a shepherds son George M. Kemp, there is a little story connected with this monument when they were putting the last stone in position right on top they found their machinery was just a couple of inches short & the great stone hung in the air they did not know what to do & it was a drunken sailor who showed them how to get the few inches, he done it by simply wetting the ropes causing them to shrink & the stone was placed in position, it took 4 years to build & was opened in 1844 costing £15600.\n\nEdinburgh is rich in statues & monuments some of them very fine & costly.\n\nWhile there I went out & had a look at one of their football matches (Soccer) there were a fair crowd there nothing to the Melbourne crowds though. \"Morton & the Heart of Midlothian were playing & it was a good game the favorites Morton being beaten 1 goal to nil. There is scarce a Tommy in Edinburgh & they have very little time for them from what I could gather from talks with various people. Colonials are all the go there with the Australians leading the way, strange to say the New Zealanders are not such great favourites in this city.\n\nOn Sunday in Edinburgh all places of amusement are closed, & the drink traffic is well controlled. The weather was splendid the whole time I was in Edinburgh & this added greatly to my enjoyment. Things seemed to me to be much cheaper than England & food more plentiful. \n\nHad my photo taken don't know\n\nhow they are going to turn out. On my last night in Edinburgh Peggy & I went & saw the \"Maid of the Mountain\" at the Lyceum she looked splendid & lovely it beats me how on earth she could like me for I am anything but handsome, during the day I bought her a nice little brooch the first present I had ever given any girl, & she wore it tonight in preference to the others After the performance I took her home we walked all the way for it was a lovely night, we were both quiet for it was my last night & I believed she did not like the idea of my going although we had only known each other 8 days it seemed years, however when we said good night I told her that if ever I came back to Edinburgh I would have something to tell her she hung her head at this, & I\n\nbelieve tears came to her eyes, but said nothing, but promised to write & send parcels to me & said she would always be interested in my future & would look forward to my next visit (of course I won't). I told her I was leaving by the 9.15 train & she said she would come down & see me off in the morning, true enough she was there, & just as the train was moving off I plucked up my courage & kissed her, & she blushed so prettily, & the last I saw of Peggy was standing on the platform waving to me, I did not like leaving I can tell you but I knew if I did not soon get out I would have tied myself down & that would not be fair to the girl even supposing she would have me, but if ever I go to Scotland again, there will be something doing for I will put my luck to the test. \n\nSo ended my trip to Scotland & the finest holiday I have ever had in my life, after leaving Edinburgh I did not care how soon my leave finished for it would be rotten without Peggy. On the way down to Liverpool we passed through typical Scottish country all hills & valleys & creeks & everywhere fences made of granite & the old Scotch firs climbing about the hills, when we got to Carlisle we had to change & I had an hour & a half looking round the old town. Ran into Liverpool about 5 oclock & I set out to find Mr Hawley's place which I thought from the address I had was at Kirkby but no one seemed to have even heard of the place not even the policemen, they knew of Kirkdale & Kirby, at any rate I thought the best thing to do to make sure was to go round to the Post Office \n\n& have a look at the Directory which I did, soon found out where he was Kirby was the place so out I goes only to find the whole family away, & only the servants home, at any rate I stopped the night there, it was the most beautifully furnished home I have ever saw, must have cost thousands of pounds, next morning caught the train at Lime Street station & so on to London. I had only a fleeting glimpse of Liverpool & she struck me as being a particularly dirty place made it seem worse I suppose after Edinburgh which is so clean. Lancashire which we passed through is nothing but a mass of factories, chimneys wherever you look pouring great volumes of black smoke out, seemed to be some fine crops there too took us 5 hours to get to London & I can tell you I was fed up\n\nwith travelling for I had had quite a lot of it lately.\n\nSlipped down to Victoria by the tube & then walked round to Peel House & had tea, here I met a S.African Sgt born of Dutch parents but he could talk quite good English, & soon we were yarning away like one thing. I wanted to know all about S.Africa & he Australia, afterwards we went to the Hippodrome to see the popular revue Zig-Zag, George Robey & Shirley Kellog were playing in the cast, but I did not care a great deal for it, but the scenes & dresses were beautiful. Next day the 21st was the last day of my leave & I done a little business at Horsferry Road & got a few snap shots round Picadilly & Trafalgar Square & Victoria railway station, then in the afternoon I met a chap & he showed me round a few places where\n\nthe Germans had dropped bombs during their last raid, along the Embankment one fell within a few yards of Cleopatra's Needle a huge block of stone brought from Egypt another one just missed the Hotel Cecil, that night I caught the train at Waterloo for Amesbury & so back to Camp arriving there at 1 A.M.\n\n","2":" Have been packing up all day for the draft leave on the","3":" & I have quite a lot to do. Jock is coming also, so we are going back together again.\n\nThis afternoon I went over & saw Albert Sillack. I do not think he has changed a bit if he has it is for the better the Army alters people alright\n\n23rd We were to have gone today but it is put off till tomorrow morning now, & just as well for it gave me a chance to get my things packed up & this afternoon I borrowed a\n\nbicycle & took a fair sized box down to Amesbury Station & sent it off to Mr Duke at Littlehampton. Hot & close like rain hanging about this afternoon hope it hangs off. We have got a young fox in this camp they are trying to tame him I don't like their chance.\n\nThe other night no less than 3 prisoners escaped including the notorious Wayne the chap who was married here a few days ago to a girl while he was still in the clink, they cut a hole in the floor & got away. Got 2 pair of socks today 1 from Miss Owen & the other from Iris Robson. Johnny Nicholson & I went over to the concert at the Palace tonight it wasn't much good.\n\nWell tonight is I hope & suppose the last night I shall ever spend in this Camp. I have not had a bad time take it all round, the Camp as it is now is very much better than it was when we came\n\nhere first. My spell over here has done me the world of good & I feel in first class form, though I can't say as how I am looking forward to the coming winter especially November & December for they are so wet & cold, but who knows but that I may get a nice little Blighty & get right out of it.\n","4":" And still here going tomorrow now I believe, if there is anything I hate it is hanging about, like we are doing at present.\n\nI got quite a little surprise this morning when I took my old platoon over for the day, when I walked out on to our parade ground all the lads cheered me & it was quite genuine, they were glad to have me back after the chap who had been in charge during my absence. I had no idea they thought that much of me, for as a rule most chaps can't stand me at first, & they say it takes quite a while to understand me\n\nI suppose I am a bit stand offish but I can't help it.\n\nIn the morning we done Battalion drill & Lewis Gun & the afternoon was spent in Consolidation of positions & we are going out again tonight. It has been a beautiful day quite hot at times & plenty of sun.\n\nMarched my platoon down tonight & reported at B.O.R. Capt White was in charge so I walks up to him & says \"look here Capt. how about letting us off this parade tonight as I have just come back from leave & am expecting to go to France any day & I am all behindhand with my packing. Capt. White looked at me & laughed Oh I know your little game Sgt. you have got a tart to see somewhere I suppose, its not the packing that's trouble you I'll bet, \"Yes, buzz off we will managed without you, & you bet I did, he's a good chap is this Capt & I have always got on well with him, he belongs to the 3rd Battn.\n\nThere are rumours of this camp moving to Sutton Viney, & also of an enomorous great aerodrome to hold 500 planes which is being built by the Yanks quite close to here \n","5":" This morning at 9.30 we moved off for France, took us nearly an hour to get away with all the lads shaking hands & wishing us good luck & good bye, every one seemed in rare spirits, yet it was easy to see that underlying all this outward show of merriment & gladness there was a strain of sadness & they done their best to hide it, for well we all knew that some of us would never see each other again & the Fragments are all friends with one another.\n\nWe had to go to Bde Hqrs before leaving Larkhill, here the Commandant inspected us & said a few words of encouragement & advice & told all the N.C.Os why they were being called back before their time was up. Just before leaving Sgt Whittle the V.C. of the 12th Batt. called for three cheers for the 3rd Brigade, then one of our Sgts\n\ncalled for the","6":" Brigade, 3 more cheers for the","7":" Division, all were heartily given, but the last 3 called for the Commandant broke down in the middle it was a very feeble cheer, after that we marched off with the Bands playing & the boys rushing out to shake hands with some cobber or other whom they recognized, the majority of the","8":" Bde were very drunk, some of them had to be carted down for a wonder our Bde were all sober with the exception of 1 chap and he walked down, we were a fair while getting to Amesbury for they had to go slow on account of the drunks one of whom fell in the tar which was being put on the road heavens what a mess he was in when they pulled him up when we got to the station we slung our packs off & went over to the little restaurants & got a cup of tea & sandwich. Just before the train started down rushes Jock Mackie Cocky Curran Dave Revelle & a few more in a motor they had been into Amesbury & had got a couple of\n\nbottles of whisky for company on the way down, the A.P.M. spotted Jock who was trying to hide the bottles under his coat, & pulls the whole lot up then an argument started for they did not want to part with their whisky, but the APM was firm & he told them either to give the drink up, or put their packs on & go back to the camp. Needless to say they preferred the former but they parted from the whisky with a very bad grace, when they got in the train they started passing disparaging & sarcastic remarks about the cold feet who hung about stations & etc all of course directed at the A.P.M. he must have felt mad but he could do nothing. We'll go to France & keep the Germans back.\" You'll sleep sound tonight.\"\n\nGive us back our whisky, cold feet. \"We'll send you over champagne, brandy wine & so on were the remarks that were hurled at him, while some I would not care to mention were also shouted about. however in the end he gave the bottle to either the officer or N.C.O in charge of the draft \n\n& they are now after him, but I think they will be lucky if they ever get it, for to the majority of men a bottle of whisky is a very tempting thing to have thrust into your hands to look after.\n\nReached Southampton after a run of an hour & a half & I am now sitting on the wharf writing, within a few yards of me lies a big ship & they are embarking horses & men for Egypt, while the great cranes are swinging big guns about as if they were blocks of wood so easy do they handle them Southampton at the present time is full of shipping the harbour looks crowded & it is a nice day.\n\nThey have fine big assembly sheds here & it is crowded with all sorts, soldiers of scores of different units, sailors, civilians, Flying Corp men, yes & even plenty of Japanese a lot of the crews of the boats are Japs.\n\nWe had our dinner here or rather tea for it is now 4 oclock, the boat sails at 6 I believe wonder how I will stand the run across the Channel.\n\nhope I am not too bad for we have a 6 miles march on the other side before we get to our Camp.\n\nJock & Cocky have just come back from seeing about their whisky, theres going to be a row over it I think, it appears they told the officer that if he did not give them back their whisky, they would not go aboard the ship, the officer said he had given the whisky to the Major, & that their conduct was practically mutiny & he did not know whether the ship would sail or not tonight certainly not with Jock & true enough \nit\njust as we were getting aboard old Jock was ordered to go over & see the Embarkation Officer & he put him under arrest the last we saw of Jock was being marched off to the clink between 2 Sgts. Jock waved his hands to us, Curran & Revelle wanted to go with Jock for they were equally guilty but the Officers wouldn't listen to them & so thats how the matter stands for the present, I am sorry for Jock\n\nfor it is almost a certainty he will be reduced, but it won't be for long he is far too good a soldier to keep without stripes, there are no better soldiers in the line than Jock is, that I'll bet he's as cool & steady as if he was going to a picnic no matter how dangerous & hot the corner may be & don't know what fear is I went & saw the officer myself but I could do no good he said it was too late & so we left without I am sorry to say \nwithout\n old Jock.\n\nWe were 12 hours on the boat crossing she was simply packed, what a loss of life there would have been if we had been torpedoed, when we were a couple of hours out we were held up by a destroyer for some reason or other, probably a \"sub\" was somewhere in the vicinity, I must be improving in my sailoring for I was not the slightest bit upset by the trip & I was down below among the crowded decks & in the hot & stifling air,\n\nwe were not allowed on deck until we were some distance out, I made the best of my situation uncomfortable as it undoubtedly was, I took my tunic off, for it was very hot, & laid down somehow & there I stopped till early in the morning when I found we had arrived in Le Havre, I also stripped myself of the life belt what a nuisance they are, they seem to weigh you down.\n\nMarched away from the wharf at 7.30 saw some Yanks & plenty of Englands Volunteer Women workers on the way out, these workers looked very smart in their Government issue & gave us plenty of smiles as we marched past. Had a march of 7 miles or so before we reached our Camp, here I found Len he is Orderly Sgt here, needless to say I was pleased to see him, after we had got fixed up, we were issued with our gas helmets & put through the tests, then came the Medical inspection which did not last long.\n\nWhat a difference in the Messes here compared to our Sgts Mess in England, not in the same street.\n\nThis afternoon strange to say I struck a chap who actually knew the Dukes in Australia he was the first one I had ever come across. Len introduced him to me, Sgt McAllister is his name & one time he was a parson, I was very pleased to see him & I asked him several questions concerning the girl, he reckoned they are fine people, of course I knew that but I had other reasons which I shall not state here just yet, I did not have long with him for he was going to England this afternoon, but he gave me all the information I wanted. Have been issued with a rifle bayonet helmet & etc. & so I am a soldier once more, & the sooner we get back to the Battalion the better I'll be pleased. This evening Len & I went for a walk along the old roads & very pretty they are, we had much to \n\ntalk about as you may guess.\n\n27th Len & I slept together in his tent last night, reveille went at 5.45 & it was quite dark, they have not altered the time over here yet & we are still an hour ahead of English time, at 7.10 we had an inspection by the C.O. Lt Colonel Stevens, what a pig of a man he is, when he finished inspecting us he turned round to the 3rd Bde N.C.Os & said \"Well you are the dirtiest lot of men I have ever inspected on this ground. A nice thing to say to any troops & on this occasion it was absolutely uncalled for, when he said this Jack Whittle answered him, he said \"Yes, but the best soldiers you ever had. None of that Stevens or \"Stiffy\" as they call him said, \"very well sir Whittle replied. Stevens the big bully then turned round & said, put that man under arrest he is drunk & turning to the Adjutant & Orderly officer said you will be witnesses on this\n\nI'll bet all I got that Stevens comes a gutser over Whittle, for ever there was a good soldier, well Jack is he has a DCM. & a V.C. they speak for themselves, Whittle is a Tasmanian belongs to the 12th Battn. After this little affair we marched away full marching order, out to the \"Bullring\", & all the day was spent in putting us through gas we were all heartily sick & tired of the whole concern by the time we finished which was not until 4.30. in the afternoon.\n\n28th Len & I went to the fight last night at the \"Dell\" as they call it, it is a very nice little place & a natural stadium shaped like a saucer. Some of the fights were good, but not up to the Lark Hill standard. This morning we had a kit inspection by the C.O. & at 9.30 we marched off nearly 300 all told this practically skins the Camp out for there is scarce a man left.\n\n& there are not too many in England. The band played us out for nearly 3 miles during which time we passed through a succession of Camps, there are thousands of troops round here.\n\nIt was a very tiring march into the railway station at Le Havre for we had a fair load up & had not been used to carrying our packs for some considerable time, & they cut into our shoulders I can tell you. You would laugh if you could only see the class of apple's they are selling round here & for that matter England too, they charge 2d each for apples that you would only feel to pigs in Tasmania, scaley, grubby, sour & colorless things they are, do you know I have scarce seen a good apple since leaving Australia, with the exception of the imported fruit.\n\n29th. Started our train journey at 4.30 \nthis\n yesterday afternoon, the country looks splendid right through, we went round by way of Amiens, Arras & branched off at Aichet-le-Grand, & followed the fighting area right along\n\nwe travelled all night & it was rotten, cramped up in the carriages. During the last part of our journey the country we passed through was nothing but a mass of farms everything looked splendid, all the women were out working in the fields carting in their hay, digging potatoes stripping the beans which they dry on long poles in the sun & all sorts of jobs, they do work these French women & no mistake, we had never been through this part of the country before so it was new ground to us We played cards drank & ate the whole time, that night we lobbed at Caestrae here we got out & marched out to the 1st Divisional Reinforcement Camp here we found no tents or nothing to lay under, so they wanted to give us big marquee's to put up, these would take about 2 hours & everyone was very hungry & tired, so they all strolled off towards the little clump of wood which was just handy, when the\n\nofficer saw them going off, he called out for everyone to fall in, but not a man took any notice, this narked him & he grabs a Sgt & tells him to collect all the men he can lay his hands on, right oh he says & dodges off & never came near him again, next morning old Skinner was under arrest for disobeying orders but he got out of it. The Fragments had an unlucky run on the way over, first of all Jock Mackie was clinked at Southampton, then Whittle was put under arrest at Le Havre, next Cocky Curran was made Sgt in charge of the prisoners who we were bringing along with us, of course 3 of these mongrels had to do a bunk & Cocky, Jack Berry & Ison were put under arrest, but I think the 3 of them will get off & then Skinner & Frith got into trouble so we have done pretty well.\n\nSnowy Carswell & I slept in the little wood last night & we were real warm, though neither of us \n\nliked the idea of turning out for breakfast this morning which consisted of tea biscuits & bully we were late & missed the porridge as per usual.\n\n30th After a lot of messing about we got a move on but only went about ½ mile, & we are still here for no one seems to know where the detail camp we are making for is. It is a glorious day like October in Australia, only you can see it is Autumn instead of Spring for all the leaves are turning golden & they are slowly fading & falling, there is not a cloud in the sky, & the only thing you can hear is the steady roll & thunder of Britains terrible artillery which is fast winning this war, everyone over here is more confident than ever about our victory which is fast coming\n\nLast night as we were marching in a Taube came over & dropped 3 bombs not very far from us\n\nI notice our aeroplanes carry lights at night now, it looks very funny to see them flying about in the sky at first you would wonder what on earth they are.\n\nSaw Cook & a few more who are going across to Blighty on the 6 months stunt this morning. About a 1000 Australian & New Z. cavalry have just passed us, I suppose they are going up in case they are needed during the next stunt which comes off in a few days time. At 1.30 we moved on again but not very far & we are now hung up at an old French farmhouse waiting like Micawber for something to turn up. The Brigade is going in today & tomorrow they reckon we won't go in with them worse luck.\n\nWe are all short of money at present, I had 5 francs so 3 others & I walked into the old farm & with this bought some cider & milk, & we then knocked up a feed up of sardines a little butter\n\na very small piece of bread & a few hard biscuits some dinner I can tell you but it satisfied us. I also had to look round & draw some rations for the men of the 1st Battalion for at present I am the senior N.C.O. & their looking after falls on my shoulders. Have been wandering round the hedges picking blackberries they are nice & ripe now & fairly plentiful.\n","9":" Another glorious morning almost perfect & the sun is quite hot. Well we are back again where we started from yesterday morning, all the walking for nothing & the Division won't let none of us join our Battalion's as yet.\n\nLast night we slept under the stars again it was fine, the hum of the aeroplanes sent one to sleep, there were dozens of them up, it was bonza to lay in your bed & watch our planes cutting about with their head & tail lights on, & watch the shells as they flew upwards towards the\n\nGerman planes which were over on a bombing raid again, you can follow the shells quite easily of a night for they are quite red as they fly upwards, the Taubes were over our heads several times during the night but I never heard any bombs dropped, there was a fight quite close to us you should have heard the crackle of machine guns.\n\nThere is a most terrific bombardment raging this morning, we are about 15 miles behind the lines & you can scarce hear one another speaking & the vibration is wonderful, everything seems to be quivering, in the morning the boys are going over, Scotties Guards & N.Z. are with them, while I hear the 9th Lancers the crack English cavalry regiment are following our Bde over. Wherever you go now all you can hear about is the wonderful work the Australians are doing on this front, at the present no power on earth will stop them, they are so confident, more like school boys for they are convinced without a word of \n\n \n\na lie of their absolute superiority over the German, & you might guess how formidable as fighters this makes them, yesterday the 4th Bde had a very successful stunt & the casualties are light, I know we would not believe it while in England but it is true for once.\n\nBack once more after a march of 7 miles to where all the remnants of the Battns are gathered, they are leaving so many men out of the line each time now a good idea for they always have a few left to fall back on should they get cut up. Saw a few of the boys including Lindsay Graham, quite a number of new officers knocking about.\n\n2nd Another glorious morning, its quite remarkable such a stretch of fine weather at this time of the year Providence seems to be trying to make up for all the past disappointments as regards the weather, rumour has it that the Germans are retiring again I don't like their\n\nchance this time.\n\nThings are very lively round here this morning, puts me in mind of when we were in camp in Kensington in Australia, with all the bands and bugles practicising, only one thing was different there was no perpetual roll of artillery nor the scores of planes that are at present flying round here, everything is quiet & peaceful this morning all the tents have been struck & lines cleaned up, now the men are laying about in the sun resting, the only places where there is any activity is round the cooks line & Q.M. stores here a few men are on fatigue, & above all this scene of quietness the bands are playing. You can hear tunes from all directions the gentle breeze floats them to us, so taking it all round it is a perfect morning, such as only France & Australia can show us, such has been my experience France in all our opinions has a much better climate than England.\n\nThe German planes were over again last night, they dropped several bombs close to us but did no damage. All the farmers are hard at work round here getting their potatoes in, ploughing sowing harrowing &etc. the war has not touched this part of France & work goes on as usual, there is very little land left untilled in this part of France & they get splendid crops for the ground is very rich & flat, a lot of it is almost chocolate while the remainder is a fine deep friable loam, easily worked. All root crops thrive remarkably well especially mangolds & potatoes, one has to see France before he can form any idea as to the richness of the land do you know there is scarce an acre that I have seen here yet that could not be cultivated & on these great Northern plains, stone is almost unknown, & has to be railed great distances, canals, beauties at that run everywhere, these canals are generally 30 to 50 yds wide & carry tremendous big\n\nbarges, holding hundreds of tons, I never saw a country so well supplied with communication, both by rail & water as this sunny & glorious land of France is no wonder France is in many respects looked to for examples in these affairs & they seem to be well managed & looked after what an eye opener this trip of ours has been in many ways, but for all that, we, in Australia can teach Europe a lot of things especially in the agricultural & pastoral line we are far ahead of them there, & I reckon our girls & women are in a class of their own especially in regard to morals, & general appearance & capabilities, I suppose anyone reading this will say what right have I to set myself up to judge people & I guess in one way they are right; but for all that I think all those who have seen as much of the people over here as I have will agree with me.\n\nMoving day over here is funny, early in the morning you \"show a leg\" generally before dawn, blankets have to be rolled, billets cleaned, rations issued, & a\n\n \n\nhundred & one things beside, about 5 A.M. you parade in the village street carrying the whole of your worldly possessions on your back, & the unconsumed portions of the days rations in your haversack, your Captain appears & you \"form fours\" but he quickly changes his mind & desires the \"2 deep\" formation, for a while he wavers as if reluctant to leave familiar scenes, but at last you get the order \"by the right quick-march\" As you move off Mme Marie, from the estaminet at the corner cries \"Good luck\" & wipes away a tear with her apron for your love of café au lait & vin blanc\" have done much to keep her home fires burning while Monsieur is fighting with the Boche.\n\nYou reach the station fully an hour before the train starts & your Captain goes to interview the R.T.O.(railway transport officer) a peppery individual whose one idea is to see the last of you, under his direction you march to a siding & entrain into cattle trucks, now French cattle trucks\n\nare not the palaces of luxury & comfort you might be led to expect, in more senses than one they are a \"dirty business\". Each is labelled \"8 chevaux ou 40 Hommes\" as you enter the atmosphere is still suggestive of the 8 chevaux, which have recently vacated the truck, but you are in great spirits, & after a lengthy struggle you settle down & sing of Lucky Jim or your mythical home in Tennessee. Eventually the train starts, & you arise for French cattle trucks have their ups & downs in life - & give yourself to the study of the scenery.\n\nFrench railways are guarded by soldiers of the National Reserve whose age in every case appears to be Biblical, they wear baggy red trousers containing sufficient material to clothe the inmates of Dr Barnado's Home, their tunics were origionally blue, but time has called for reinforcements of varying shade & texture until they now resemble the patchwork quilt in Aunt Emilys bedroom, but they are merry old fellows & their grin\n\nexpresses great gratitude, if you heave a tin of bully at them.\n\nYou pass through villages & the school children rush to the line demanding \"bully bif\" or biskeet\" should you fail to supply them with these desirable commodities, they shout with the full strength of their lungs \"You no bon\"\n\nAbout midnight, you reach your de-training station & tumble out of the truck with creaking joints & aching limbs you fall in & march away into the darkness to the village which is to be your new home.\n\n3rd Started to rain slightly early this morning but it soon cleared away, but this afternoon it is coming up again. This morning 2 Sgts from each Battalion went out to the range with Mr Stobo, we done a bit of shooting & tomorrow we have to put a lot of men through the same course.\n\nSome of the Battalions have been sending down for their spare men, so I am expecting to go up any minute, I should rather like to, for I have never\n\nmissed a single hop over that our Battn has been in since she was formed. Bad weather for aeroplanes so there were none over last night.\n\n4th Dull & heavy this morning, looks very much like rain, hope it keeps off. Just as we were going to the range this morning an order came down that all ranks were to stand fast & be ready to move at half an hours notice to the firing line, I don't think somehow our chaps have gone over for the weather is too dull for observation purposes & this means a lot.\n\nHave just heard that the boys hopped over last night & succeeded in carrying all their objectives, good going, we are now expecting to move at any minute & are all packed up in readiness, most of the other troops are moving up. \n\nAll sorts of rumours are flying round as is usual after successful stunts, but I am quite used to them by this time. A fair number of men are going on leave wish I had half their luck\n\nA Sgt had to be sent to Hazelbrouck this morning, to act as escort to Sgt Adams, who cleared out the morning the Battalion went to the line, I guess he will cop out unless he has some very good excuse, & a man of that sort deserves it, hot & strong.\n","10":" Great commotion last night at 12.30 the bugles blew \"Orderly Sgts\", we knew this meant something out of the ordinary at this time of night & we all guessed what it meant, a hurried trip to the line, after Orderly Sgt, the bugles sounded the \"fall in\", how we all swore as we got slowly out of bed & shook our single blanket off & mighty cold it was, we all dressed & got into full marching order then the order came down that the Band only was wanted & that the rest of the men could turn in again. It was funny when the quiet rest of the Camp was disturbed by the screaming blasts of the bugles & great arguments followed as to whether it was dinkum or whether the buglers had gone mad but unfortunately it was only too true.\n\nOrders kept on coming down every minute, some one must have had the \"wind up\" properly. I think Divisional Hqrs were to blame for it, however we all turned in again \"full marching order\" (which means in soldiers language, fully dressed) to snatch what sleep we could between 1 AM & reveille\", needless to say very little was got, the Band were issued with 24 hours rations & were sent off in a bus to do stretcher bearing up in the line although we succeeded in taking our objectives our casualities have been fairly heavy it is reported that so far there have been 700 men & 36 officers knocked in the Bde which works out at about 45% of the men engaged, but then of course all sorts of rumours keep on coming down. It rained off & on last night, but this morning broke nice & sunny, but this afternoon showers have set in.\n\nI am taking a party of men up to the line this afternoon don't know what its for. \n\n6th Yesterday afternoon 60 men were sent up I was in charge of the lot\n\nwent through Baileul & a few more places & finished up in Dickebusch just outside Baileul we passed a cage full of Huns, fully a thousand were yarded up, all wearing their steel helmets, officers & all were mixed up. After reporting to Bde, the party broke up & reported to the various \"transports\" where we stopped the night, had no trouble finding them, On arrival saw a few of the old boys including Freddie Turner, Bill Bradley, Major McKenzie & many others, also got word of a lot of the lads who had been killed I got a shock I can tell you when they told me young Holmes Billy Bellchambers, old Bob Creasy, Dick Sharp, & lots of others had been killed we all had been mates for so long, I don't know how Holmes mother will take it, if ever there was a game kid he was & he had a name for courage second to none in the Battalion, & he was a fine little kid & very popular. I can hardly realize it as yet, Bob Cressy the last that was seen of him, was\n\nbattling singlehanded with 7 Germans he killed 6 with the bayonet & the last one they killed each other, according to the boys they had a very easy win as far as the Hun infantry went, they even met them coming over in mass formation with full packs up, & from papers captured their objective was Dickebusch nearly 6 miles away, their time for launching the attack was 10 min's too late for the boys were on them, & our wonderful & deadly barrage caught them & fairly butchered them, as the barrage swept over them they went to turn back but could not get near our wall of fire, so they were caught in a nice trap, a deadly barrage behind, & a more deadly foe in front for by this time the Batts had hopped over & were making for them, when the Huns saw them coming they were terrified threw down their rifles & run towards our chaps hands up & begging for mercy. Some of them even grovelled\n\nat their feet, so terror struck were they only here & there did they make a stand but nothing will stop our lads their first objective was taken in a few bounds & some of them even ran into our own \"barrage\" so impatient were they, over the ridge & through the \"pill boxes\" they swept, & established a line 400 yards down the other side of the slope & thus completed the capture of the famous \"ridges\" it was a great & clean victory & adds another bright spot on the Australians record of successes, the 1st & 2nd Bde's were the ones engaged. Some of our stretcher bearers collected a lot of the Fritzs & got them on carrying the wounded, a job they were only too glad to do, for they knew it meant a good chance of saving their skins so once again the Kaisers picked troops had been met & soundly beaten by amateurs, or at least that is what they used to call us at one time, but how things\n\nhave changed.\n\nI don't know how many Divisions of Australians were engaged 3 I think & on their flanks they had picked English & Scotch regiments.\n\nYesterday afternoon I counted no fewer than 37 tanks pass our Camp dirty business somewhere or other.\n","11":" Last night I was detailed to take a party of 22 men up the line to act as a burial party, so early this morning we set off & reached our joint after a long march, we are now quartered in great underground tunnels all lit with electric lights & bunks fitted up, these tunnels are full of men of all units our Bde will be coming up the line again to night to act as supports to the 3rd Bde who are making a stunt pretty rough on the men, for there are very few left, & they are worn right out.\n\nHad some men sent to Hospital with alcholic poisioning, too much rum\n","12":" Raining heavily for the last 12 hours but this morning broke fine & clear with a strong westerly wind which is fast drying the mud & slush up.\n\nOur old Brigadier, General Leslie was very much upset about having to send the boys in again so soon after their cutting up, he met our Battalion on the road last night & told them how sorry he was that he had to send them in again but never mind he says you will have a good time when you come out, he wanted to take the whole Battn over to a YMCA & buy them tea & biscuits, but the boys reckoned it was too far to walk, that's the sort of a Brigadier to have.\n\nStarted out on our burying job early this morning, but we had a walk for nothing never buried a man, couldn't find any, other parties had done it. If you could only see the guns we have on this front, they are easily 6 mile deep & if put in a row would be more than wheel to wheel, wherever you look there is nothing but guns, guns\n\nfrom the monstrous 15 inches right back to the snappy & vicious little field gun in front, the whole countryside is simply smothered with shells, stacked all over the place & in places the 9.2 are chucked about like logs, to look at these shells lying in the mud & water you would think they were ruined, but they drag them out, wipe the mud off & shove them in the breech of the gun, shove what looks for all the world like a roll of red & white blanket in behind them close the breech & see what happens, a tremendous roar, a flash of fire, & a black object flys out of the gun which you can follow with the eye until it loses itself in the clouds & that's the last of the muddy shell which you saw a few minutes ago, the rest of it concerns old Fritz, its not the slightest exaggeration to say that there are millions of shells lying about in this awful Flanders mud waiting to be used up. one of the saddest sights on this great battlefield is the great number of fine\n\nhorses that have been killed, there are hundred of them along the corduroy roads I don't know how we would get on if it was not for our horses in spite of the motors trains & etc, the latter can only bring things a certain distance & it then falls on the horse to plough through the mud water shell holes & etc, & they have the shells to face for theirs is a dangerous road, but they never seem to flinch not even when they see each other getting blown out, they are much more courageous than a mule.\n\n9th The 2nd Div & our","13":" Bde hopped over this morning, about 11 oclock the prisoners started to trickle down, they reckon they got a fair number, the French & English also went across on our left, they also gained all their objectives funny thing no one seems to have much trouble now in pushing Fritz out of his strongholds if it wasn't for his artillery the war would be over in a week.\n\nBuried a few more chaps today, I don't care much about this game myself\n\nits too gruesome.\n\nLast night there was a bit of excitement a German plane dropped 6 bombs almost on top of our dugout made my head rock & reel the concussion was awful, but wonderful to say no one was injured, some of the holes you could almost put a house in & all were in a straight line.\n\n10th Terrific artillery bombardments have been raging all day, & we have had some very narrow squeaks, got chased once by 4.2 & we were lucky to get away you would have laughed if you had seen the mob scatter, put the wind up some of them, & I think there was a record or two made if we only had the watch on. The 10th Bde relieved us tonight, & we marched down to Dickebusch where the Battn was camped they having come out last night.\n\nSun 3 German planes brought down this afternoon one fell in flames, it was a pretty sight as he came rushing down at a tremendous pace.\n\n11th Early this morning we marched out\n\n& entrained at Ypres, saw a lot more of the boys who had come across from Blighty, some of them had not done more than 3 months.\n\nPassed about 2000 prisoners on our way down they were taken last night. Got out of the train just outside Poperinghe & had to march about 2 kilos, to where we are now camped in tents, they are pretty cold too.\n\nPay day today & the first for a long time most of the lads are drawing extra for Xmas money.\n\nIt has been a lovely day plenty of sun & things are drying fast.\n\nLast night I received a batch of 12 letters & my photos from Edinburgh, the letters were very welcome.\n\n12th What a night we had last night 3 other Sgts & I went into Poperinghe with the idea of having some fun & we got it, cost us some money, though it nearly all went in presents which we were buying to send back, among the 4 of us, we spent nearly 400 francs.\n\nThis morning the Battn went for a bath & we wanted it badly.\n\nRained again last night & things are very sloppy again.\n\nIt has been raining off & on all day long & the ground is in an awful state I can see a rotten time when we go in the line next time. Am Battn orderly Sgt tonight & it is a rotten job for we are supposed to have no lights at all in the Camp & I have to see that it is carried out.\n\nHave been doing a lot of writing this afternoon.\n\n13th Been raining pretty well all day & things have been fairly miserable Howard Dimock & I went into Poperinghe to get our woolly locks cut last night & coming home I trod like a big mug into a big pool of water.\n\nYesterday I received a little parcel from Mitchells.\n\n14th You should have seen the tiny parade at Church this morning, easy to see the Battalion has been severely handled, it was the smallest parade I have ever seen.\n\nWeather is much finer today hope it keeps fine.\n\nHave been writing hard all day catching the Xmas mail.\n\nThis evening Bluey Dimock & I went over to the A.S.C to see Ferguson & had tea with him, got filled up with a pound or so of juicy steak butter marmalade &etc. had a good long yarn & then came back armed with a loaf of bread & a 7lb tin of butter, not a bad nights work, that's the beauty of having cobbers on these sort of jobs, you can always get a little bucksheesh stuff off them. On our way back we called in at a little Belgian estaminet & had a drink of coffee, got a shock for the girl started to curse & swear in English evidently some one had been giving her a few lessons & she had done remarkably well, a credit to the soldier who taught her, she thought she was doing a fine thing I suppose, but there's nothing I hate\n\nworse than to hear a girl swearing or smoking cigarettes, there is far too much of the latter goes on over in this part of the world for my liking, if you walk into any of the flash restaurants in London or any English city you will see them sitting at the tables drinking coffee & smoking cigarettes just like a man, I think its a most disgusting habit \n\nHeard today that Len has gone on \"leave\" from Le Havre.\n\n10th All the platoons were reorganized this morning, for the time being we are only going to have 2 platoons, joining 9 & 10 & 11 & 12 together this is on account of the Company's weakness. Howard & Dimock are taking 9 while Starkey & I have 12. we were together just before I went to England.\n\nA lovely morning & plenty of sun a good number of planes are up both ours & Fritzs so the Archies are pretty lively. \n\n16th Last night there was a wonderful sight in the sky, it was a brilliant\n\nmoonlight night not a cloud to be seen in the sky, just the night for raids & sure enough about 1 oclock, we got the signal 3 blasts of the whistle & all lights had to be put out, then the great search lights started throwing their great beams into the Heavens like some great monster searching for its prey, while overhead could be heard the ominous drone of the water cooled engines of the Gothas there were dozen of lights all searching then all of a sudden one of them picked a plane up in a flash all the rest of the beams concentrated on the plane, & coming from all directions as they did & directed all on the one spot, they made an almost perfect \"Union Jack\", I would not have cared to have been in the Gotha with all this light showing & dazzling round me, the big plane looked for all the world like a huge & monstrous horsefly & seemed positively helpless just like a moth in a flame try as he would he could not get away from the lights, & soon\n\n \n\nthe Archies & machine guns started to put the wind up him, it was very pretty to watch the shells flying upward they look a pretty pink colour & can be quite easily seen, all the \"tracer\" bullets which the machine guns fire, in the hope of hitting their petrol tank & setting the plane alight can be quite easily seen also they put a very nasty \"barrage\" up & were barking from all sides, the old Gotha evidently thought little of his chance so he turned tail & made off towards his own lines & the last I saw of him was being hotly chased by bursting shells.\n\nShortly after another plane tried to break through but met with the same luck as the other one, but the third one got through & try as they would the lights could not find him, although he could be easily heard overhead all of a sudden there was a series of heavy explosions about 500 yards behind our lines, evidently the Hun had the wind up or thought he was over his objective & let his whole cargo of bombs go, they went off like a\n\npacket of crackers & the only damage they done was to tear a few holes in a paddock, but the thing that I thought the funniest of all was, that after the Germans had all gone home our planes went up & started patrolling about 2000 feet lower down than the Fritzs were ever likely to come, they were lit up like a bus with head & tail lights burning.\n\nThis little raid spoilt a dinner which our officers were giving to the nurses from round about, but it did not stop our band from playing, they blew their horns & thumped their drums as if it were an ordinary every day occurence. Last night we got a few details from the 6th Division nearly all N.C.O.s we are well supplied with these now.\n\nWe had a bit of fun during our parade hour this morning, B Coy challenged C. Coy to a tug of war of course it was accepted, for it was a welcome break if nothing else from the monotony of drill. B Coy won the first match.\n\n& C. easily accounted for the second so things so far are equal.\n\nI am sitting writing all this tonight in a noisy crowded little estaminet I have 20 men on piquet & have split them into 4 parties, & as things are very quiet on the whole I have told them all to take up their Hqrs in some little estaminet till just on closing time, when we will all meet at a certain place & proceed to clear the estaminets which have to be emptied at 8 oclock this of course just suits all hands & they are enjoying themselves. \n\nAt present you can scarce hear yourself talking the little \"boozer\" is chock full of Tommies & Australians, & beer, wine, mullager\" & grenadine is circulating freely & opening all their mouths, & as for smoke why you can scarce see to the end of the little room, & every now & again some one strikes up some old tunes on the piano & there is a violin to help, at present they are playing & everyone is singing \"If you were the only girl in the world\"\n\nthey have already sung \"They wouldn't believe me\" that beautiful song that I first heard sung 18 months ago at the Gaiety in London, & the lovely strains always bring back old memories & days that have been & perhaps will come again soldiers take them all round are very sentimental & anything in this nature appeals to them far more than any classical music ever would, this might seem strange to any one outside karki, but if they were only among us for a while they would understand, perhaps the very fact of ours being so uncertain a life & the distance we are from home has a lot to do with it, & no where have I seen the power that music has to sway people so pronounced as among soldiers many & many a time have I seen tears brought to the eyes of some of the hardest men it would be possible to dig up anywhere & they have become as easily led as kids so great a charm has sentimental music got, no matter what Beecham says against this class of music\n\nwhich he reckons is all rot, neither he nor anyone else will ever be able to produce classical music, that will have the same fascination for people such of course is my opinion & I don't think I am very far out.\n\nIt is just on 8 oclock & I will now have to close up & proceed to clear the \"boozers\" this job always calls for a little tact, & thats a thing that I think I have learnt since being in the Army, it gives one a rare insight into the handling of men, & this is always handy to have, it all depends how you go about handling the average Australian, if you start to put the bounce in you are a \"goner\" for they simply will not be driven\n\n17th It appears from what I can hear this morning that we were the first Australian piquet to come into Abbeuil, it seems that the Tommies had been doing it, but our chaps had got them bluffed & the A.P.M. had sent for an Australian piquet to come to take it over, when I went to clear the first estaminet last night, the Tommy\n\npolice said to me \"be careful Sgt they are a rough lot\", I looked at him & I could see he was frightened, so I walked in on my own left all the men out in the street, blew my whistle, & said \"times up lads drink up your beer & buzz off, how they looked at me, but they saw I was an Australian & so they quietly obeyed, & they were a proper rough lot it only wanted a few badly chosen words & there would have been quite a nasty lot of trouble, the Tommy police gazed in open mouthed astonishment at the ease with which I got them all out, I had the 6 cleared by 8.25 & from what I can make of it, they never used to get them cleared till all hours & only then after a lot of trouble, so much for a little tact.\n\nJust as I finished writing that last sentence I had to rush out to see a bonza airfight between Fritz & one of ours they were up a terrible height & the first thing we saw was a sheet of flame burst from the Hun, that meant that our chap had\n\nfired his petrol tank, the German seemed to right himself for a few minutes, then we watched our plane diving straight at him he seemed to almost touch him so close did he go, as he left him, the Hun plane burst into another sheet of flame his nose turned downwards & that was the finish of him, he came down at a terrific pace the sun glinting on his wings as he turned round & round like a corkscrew in that last thrilling dive, the airman must have been dead long before he hit the ground, it was a beautiful sight, I love to see these air fights, they are so exciting.\n\nYesterday a monstrous French aeroplane came down in mistake quite close to here he had got lost & was right out of his sector, she carried a heavy gun nearly 3 in. some plane eh, they say she is one of the planes the French use in the reprisal raids on German towns. The tug of war was resumed this morning C. Coy beating both B & D pulled them off their legs\n\nIn consideration of last nights piquet all the men who were with me have been given the morning off parade. It is a glorious & sunny morning quite a pleasure to be out in the air.\n\n18th Rained steadily during the night but the morning broke nice & sunny & it remained good all day.\n\nThis morning General Birdwood & staff inspected the Battalion & the usual \"polish\" was thrown at us, old \"Birdie\" said that we all knew what terrible sufferings & hardships the Australians had gone through & all this sort of thing & how nobly & gloriously they had fought never failing in anything they had been asked to do & he finished up by saying, & now boys I know what you have done before you can do again, there's only one more \"ridge\" to take & we must have a hand in that, this one more ridge is getting a trifle monotonous there has been this one \"ridge\" ever since we started fighting & it still seems to be there, but still the lads are\n\nin as good a spirit as ever.\n\nIn the afternoon 5 Court Martial cases were read out, 1 chap was sentenced to 10 years penal servitude needless to say he is a very bad character, & looks it. Then after this the Battalion went for a route march, we had our Band out with us, I can tell you she is some band now the best this Battalion has ever had, we have 36 players, & they make a really fine bunch of noises such a difference to any other combination we have put up. I suppose at the present time they are equal if not superior to any band in the 1st Division. Major MacKenzie is the man who deserves the credit mainly for this great attraction in the Battalion he has worked hard & done everything in his power to bring it on, & has undoubtedly made a success of it.\n\nWe only had a short march & after it was finished B & C company had a football match (Rugby) it was the roughest turn out I ever saw, & I nearly killed myself laughing, they\n\n \n\nfairly rushed one another like Tigers & tore the trousers & tunics to rags, yes & right off their backs & legs, one chap finished the game in a few shreds of his guernsey only, I don't think the Tommies ever enjoyed themselves so well before in their life, they reckoned the Australians are a tough lot, they never saw a game of Rugby before & it opened their eyes. B Coy won 3 to nil. Yesterday at the same as they brought the aeroplane down we saw, no less than 3 others were trapped, the French & British were operating together & led them into a nice little trap.\n\nWell today is the 3rd anniversary of our leaving Australia & it looks as if we will have another one away yet, tonight the old hands are having a big booze up to celebrate the occasion, so you can guess there will be something doing tonight, I am not going down myself for it is no good me going seeing as how this class of festivity is not in my line, it will be nothing but\n\ndrink drink, & still more drink.\n\nAt present I am writing this quite comfortably for I am seated at a little table in the Regimental Quarter Masters office. Freddie has gone down to the spree so I am making good use of his table.\n\nAt the present time there is a great agitation in the English papers over the \"leave\" question, the wives of the English soldiers reckon that it is very hard & cruel of the authorities to make the men stop in France a year & eighteen months without getting to England, for that matter they are quite right, but, what about the married men in our Force, some of them have not had a glimpse of their wives or people for 3 years & more, these are the men in my opinion who ought to have a little consideration shown them there are great rumours flying round about the return of the remnants of the 1st Div, they talk about 5000 in the papers I should like to know where they are going to dig them up, although we all know there are hundreds & hundreds \n\nin England & elsewhere on cold footed jobs, but they would have no chance of raising that number. Why the other day they took a tally of the original men in this Battalion & they totalled 28 including Hqrs & Transport. So taking a line from that they will have some difficulty in finding the number at any rate, we who are left, are living in hopes of such a thing coming off, but it seems too good to be true, it could be easily done this winter for there will be very little doing between the end of this month & March. The whistles have just blew \"lights out\" so there must be some enemy planes about. Yes, as I write this I can hear the engines of the Gothas overhead quite plainly.\n\n19th. Fine football match yesterday C. Coy played & beat A. by 25 to nil, there was great excitement over it, we had a really good team in the field. Issued the first lot of winter clothing this evening, getting quite nippy now. We were also paid today, & there are quite a number stunting tonight.\n\n20th Heavy hailstorm yesterday afternoon the first I have seen over here, we must expect these now I suppose with the approach of winter.\n\nLovely day again & there has been some terrible heavy firing all through the night, some one must have gone over. There are great rumours of 14000 Canadians hopping over in a day or so.\n\n21st Received about 50 reinforcements today nearly all belonging to my old platoon which I used to have in England, they are about as fine a lot of men as one could wish to see, & the irony of it all is that C Company never got a single one, we had too many details come back at the same time & of course they filled up with them first. I was so disappointed for I had counted on getting some of them & I knew them all so well, they nearly all wanted to come to C.Coy but no good. Sunday & not much doing I am Orderly Sergeant.\n\n22nd Last night Dimock Howard & I went down to the 2nd A.S.C to see Fergie, & we all repaired to a quiet\n\nlittle boozer that stood on the frontier of Belgium & France one side of the road belonging to each country, we had a really enjoyable evening, plenty of coffee & biscuits, & we all took it in turns to tell yarns, & 9 out of 10 of them were connected with Australia. We tried to bring one of our chaps home with us he was dead drunk & sound asleep we could not wake him so Howard & I carried him outside, the cold night air had a magic effect on him, he suddenly woke up & started to lash round with his hands & feet the leather was flying properly & I managed to stop one on the fleshy part of the leg, that's what we got for trying to do a good turn, however, we got hold of him shook him & gave him his hat & a little fatherly advice & left the young waster, these are the sort of swine that give troops a bad name I reckon we ought to have dragged him home & given him a good ducking but it was too much trouble so\n\nwe left him alone, cursing & swearing like a trooper, he was little more than a boy . Another beautiful & sunny day. We are having bonza weather now, such a difference to this time last year.\n\n23rd One of Fritzie's planes caused a mild sensation here this morning, there was a very heavy mist, & we could hear the hum of an aeroplane very plainly of course we took no notice thinking it was one of our own, imagine our surprise to see through the odd break in the mist a German plane, she was too low down for our anti aircraft guns even to fire, but the machine guns opened out on her properly, some of A Coy opened fire on her with their rifles, but she got away from us, although she was brought down over Ypres, they reckon why he was so low was because his \"controls\" jammed & so left her unmanageable. The Battalion played the Brigade Machine Gunners & beat them easily\n\n26th \n\nAnother nice & sunny day\n\n24th. Rained heavily last night, & today things are very muddy & nasty. Had a full marching order inspection this morning for we are moving to the line in the morning have had \"iron rations\" issue so it looks as if something is doing again this time.\n\nBluey Dimock & I went down to a concert which was given to our Battn by the 8th Field Ambulance, it was held in the Y.M.C.A. turned out to be a pretty tame affair, a fair number of nurses were present from the \"clearing stations\".\n\nRight close here there is a big military cemetery 8000 are said to be buried there, & there looks to be all out that many. This afternoon Adam's Court Martial was read out with a few more to the whole Battalion they socked it into them alright they were all \"desertion\" cases but the court brought them in as A.W.L. (absent without leave) there is a reason for this, desertion in the Imperial Army is the death penalty but A.W.L. is not, we are under the\n\nImperial Government in practically everything but as regards punishments the Australian authorities refused to allow the death penalty to be inflicted on Australians without first getting the consent of our Government so this is one reason why A.W.L. is nearly always brought in, sometimes I think a little shooting would do no harm, as it would put a stop to the large number of desertions which are now taking place, & in 9 cases out of 10 the guilty ones belong to the latest reinforcements. I don't know what it would be like if Conscription were passed its almost a certainty they would also bring the death penalty in, we would certainly want it, for there are a lot of rotters coming along now & a few years in gaol is neither here nor there to them. The sentences today ranged from 8 months hard labour, to in Adams case \"being reduced to the ranks (Sgt) & in addition 10 years penal servitude, sounds stiff don't it, but he was found guilty of \"desertion\" & being an NCO they made an example of him, I guess these sort of sentences will put the damper on a lot of them\n\n25th. Moved today from \"Patricia Camp\" we marched out & after a short distance caught the motors, which were to convey us to our next stopping place.\n\nWe in our tent had a funny experience last night, the wind was blowing a howling gale the whole night through & our old tent was gradually getting slacker & slacker, but no one would get up & tighten the ropes & pegs, & at 5 oclock down she come, the rifles which were hanging on the pole came clattering down, & I got my fair issue of them including one fair on my big toe, nearly squashed it, when she come down Bluey Dimock & I who were sleeping together were left out in the open for we were laying with our heads to the wind when this happened we all decided to lay there rather than get up & fix her, talk about a mix up, we were all grabbing one another's bedclothes & mixed up with rifles, equipment & etc, I was laying next to our little pantry & got mixed up with sardines biscuits mugs, & etc. oh we had some fun but we stuck it out till morning\n\nWe are now camped just outside Ypres in Nissen huts, better than our tents. 26th Went over & saw old Bill Graham & Tom Flattley last night & while there old Fritzie dropped bombs all round us but fortunately none were close enough to catch us. I think they are after the big 15 inch guns which are pelting the big stuff at them.\n\nOnly a couple of hours have been put in today by the men, & this was in the huts on instructional work, for it has been raining nearly all day. \n\nNews has just come down of another push, Canadians & Australians took all their objectives as usual, & the 5th Army on their right have been held up, there has been very heavy artillery firing the last couple of days, also we have heard of the successful punch the French have put over on the Huns.\n\n27th Very cold last night & we nearly froze, 1 blanket isn't enough for this time of year for the nights are bitterly cold, however the morning\n\nLast night the artillery fire was very severe, just one continual roar, our huts trembled & shivered all the night, while outside the heavens were lit up by the flash of the guns, mixed with the German S.O.S. which plainly told of their distress & fear of being attacked.\n\nGreat aerial activity this morning, scores of planes both British & German being out, once there away up in the sky a squadron of Hun planes surrounded one of our scouts, he looked a \"goner\" but he done a marvellous \"nose dive\" & got right clear of them.\n\nAnother time some German machines were making straight for some of our balloons, the observers evidently got the \"wind\" up for out they jumped & immediately the \"parachutes\" opened like a big white umbrella & down they slowly drifted & the wind gradually carried them towards the enemy lines but I think they would hit the ground before they got that far at any rate their haste was needless for the Germans never touched the balloons, they got headed off\n\nWe have all been out drilling this morning for the ground has dried fast, & I reckon it is the maddest thing I know of, just asking for trouble with the German machines watching every movement if we don't get bombed tonight I'll eat my hat.\n\nAnother issue of winter clothing, we are getting plenty of it at any rate so far this year \n\n28th Digby & I went down to Reinelhurst yesterday evening to see the Field Cashier over money matters. Digby is going to Paris on leave & I am advancing him the money off my pay book for the purpose, on account of him not having enough on his own, we got a lift down in a motor from Dickebusch but hanged if the cashier was at Reinelhurst so we had to go to Scottish Lines 3 kilo's away, he was not there either but luckily the 5th Div fixed us up, we then walked to Ouderdom, & got a motor back to Dickebusch & walked the rest.\n\nJust what I expected happened last night old Fritz bombed the Camp & caught the 2nd Battn. properly killed 11 & wounded 30 more, 1 bomb wiped a whole tent out\n\nthere were stretchers & Red Cross cars all over the place, we had 4 casualities in our Battalion, one bomb dropped almost on the dump & about 40 yards from our huts, caught the chaps who were at the latrines, & also killed 2 tommies, so much for drilling in sight of the planes & in the \"forward area\" this might teach those in authority a lesson but I doubt it. They are holding a voluntary R.C. & C. of E. parade this morning.\n\nThis afternoon I found out where the 12th Battalion were camped, over in Ypres in the Belgian Barracks, so I went over to see Stan, strange to say I had a dread of enquiring for him, something seemed to tell me that I would hear bad news, & I was not very far out, you can imagine what kind of a shock I got when they told me he had been killed, the world seemed to stand still for a few secs, & I nearly fell, but I recovered my balance & forced myself to keep quiet. George Vaughan must have heard someone enquiring\n\nfor a Barwick so he came out of the dugout George was surprised when I told him, he had no idea it was Stan who had been killed, at any rate he & another officer gave me all the information they could & the map reference.\n\nHeaven only knows how they will take it all home, they will be cut up properly, poor Stan could be ill spared, of the 3 of us I reckon he was the best, & to think that he is the first to go, though now he has gone Len & I might follow quickly, for the lucks been broken. I'm out for revenge for the future, & God help the German that comes into my hands its he & I for it.\n\nStan was killed on October the 8th just close to \"Reims Wood\" between Zonnebeke & Passchendale, & in this stunt George Vaughan won a M.C. & Bill Barwick a M.M. Bill I could not see as he was away at a school on a 5 weeks course, I also saw Eric Salter he has a commission in the 11th Battalion.\n\nFritz dropped a large number of bombs round some of our batteries this afternoon I don't know what damage they done & tonight they are at it again.\n\n29th Great activity in the air again this morning for it is a nice day & plenty of sun for a wonder.\n\nThe lesson of yesterday seems to have been forgotten for all the men were out drilling again, just advertising themselves. A big Australian mail came in last night but I got nothing out of it, all gone to England again I suppose.\n\nThe Huns have been using a lot of our guns & ammunition against us, they captured them from the Russians, & from what I can hear our shells are far worse than the German ones, hurts I can tell you to have your own stuff shot back at you.\n\n30th There was a regular raid on last night, Fritz must have dropped some hundreds of bombs, big ones at that, for they shook the ground for miles around & he kept it up nearly all night long\n\nput me in mind of a hop over with these great bombs bursting & scores of machine guns rattling away, we could get scarce any sleep the whole night, & it was just the night for raids, a brilliant moonlight bright as day, we could see the great \"Gothas\" quite plainly, I don't know if they brought any down or what damage they done, must have done some for it was like a battle they just emptied them out like cartloads of bricks & back they went for more, by the way they carted their eggs over, I should think they had a contract on & were getting so much per dozen. I can tell you these bombs are not the nicest things to have falling around you, for you are so helpless against them. Taking a line from what is going on now Heavens only knows what next Spring is going to bring forth in the matter of fighting in the air, I should not be surprised to see it finished there, both sides seem to have given up the idea of going for one another like they used to\n\nthey seem to think that planes can be more usefully employed in bombing & they are both pretty right, there were constant streams of our planes passing back & forth last night on the same game as old Fritz, & I'll bet many an old Fritz had the \"wind up\" as he anxiously listened for the hum of our planes & wondered what the night would bring forth. At the present time the Hun is dropping 2 different sorts of bombs, one of them acts more like a big shell, blows great craters in the ground that you could easily put a house in, this bomb is used more for destroying dumps, guns, roads, railways, & etc. the other bomb has an instantaneous fuze which bursts the instant it touches anything, it is a very heavy & terrible powerful bomb, it only makes a hole big enough to put a bucket in, but as for doing damage to troops & horses it is second to none, for it bursts into thousands of small pieces & these all keep very low, about 3 ft high, so that one is far safer standing up\n\nthan lying down, to counteract this nearly all huts, tents, & horselines have a sandbag, sod, & in many cases a dirt barricade built up round them so as to stop the flying particles of steel these are generally built from 3' to 4' high & about 2' in thickness, & seem to be pretty effective.\n\nWe are moving this morning into safer \"diggings\" under the rampart in Ypres. there we shall be safe from bombs & shells at least for a few days before moving up. Am acting C.S.M. today & will be for a few days. George Gould (R.S.M.) has gone on leave & Lindsay Graham has taken his place while away.\n\n31st Rained nearly all yesterday afternoon & made the ground quite slippery again the 7th Battn. moved into our huts. Well here we are camped right under the big rampart which used to be in olden days the fortifications of Ypres, around this great brick & stone wall there used to be an old moat, but now it is dry in many places and water lies\n\nonly here & there.\n\nToday the whole Coy. has been making a small stone track round the edge of the ramparts.\n, this is a pretty easy job for all the boys have to do is to knock the bricks off the top of the wall, & spread them along the bottom & we have made a pretty good job of it.\n\nSubmitted 2 more names today for a Paris leave.\n\nGreat rumours are flying round about the Italians, & what they have lost & etc. I feel real sorry for them, for up to date they have fought so well & practically saved the Russians, Capt McGregor was telling me that it was only a fluke that all the Australians were not sent to Italy, if we had been a little more organised we would have gone, wouldn't that have been a trip.\n\nIt has been a beautiful & sunny day quite a pleasure to be out in it.\n","14":" We have been at work this morning knocking a big arch down that was dangerous, it was\n\nlikely to fall at any minute, I think every one from the Captain down had a go at it, we used all sorts of implements picks shovels iron bars, battering rams & etc, we fell the whole lot just on dinnertime. Fritz dropped a shower of bombs last night some of them very close to us, but all the damage he done was to puncture the tyres of a motor car which was standing close by.\n\n2nd. Duty Coy today & I have sent a party of 50 men off on a sandbagging job round a dressing station. Very dull but the rain is hanging off well, it is quite warm this morning. This morning B.O.R. wanted to know how many books C Coy. wanted of \"Australia at the front\" the Comfort Funds are selling them at 3\/- each. We sent in a return of 130 for the Company.\n\nIt is now just on midnight, & I am writing this before turning in, Jack Hayes, Howard & I have been round to spend the night with Lindsay Graham, we played bridge, yarned &\n\n& ate biscuits fruit & etc till fairly late & to finish up the night Howard & I went up to Jacks dugout & got the little spirit stove to work & boiled some water. Jack & Howard had some \"toddy\" & I had milk, & we put another supper down, & so ended a rather enjoyable evening. We have our good times as well as bad ones in the Army you know, & it is seething with humour if you only look on the right side of things. The whole Coy went for a bath, each batch was allowed 3 minutes under a tiny little sprinkle, but short as was the time & water, it done us the world of good for we were very dirty\n\nI hear old Jock Mackie got out of his case in England & very glad I am to hear of it, we all said Jock would either talk himself right in or out & he appears to have done the latter. Colonel Stacey came back to the Battalion yesterday, most of the chaps give him a bad name. I don't know him yet so I'll have to \n\nreserve my opinion until some future date, as its no good being predjuiced Saw a Regiment of Canadians marching out through Ypres this morning with their colours flying 4 Sgts & an officer were escorts to it.\n\n3rd Frank Forder & I had to re-organize the Coy this morning, cutting the establishment down from 4 to 3 Platoons caused a bit of grousing but one has to expect this of a disagreeable job. Jack Hayes & I chatted the Capt about letting us get away together on Paris leave, he said he would do his best for us when we came out of the \"forward area\".\n\nA German plane came down very low this morning, & there was a fine rattle of machine guns, but I think he got away safely. \n\nEvery man in the Company has been issued today with a set of 8 buttons & catches to sew on his overcoat, copying the French again, the idea being to loop the overcoat up & so keep it \n\nout of the mud, the men are not half cursing it either.\n\n4th Capt Whitby got up at 5.30 this morning to go with the other Coy. Commanders to have a look at the trenches we are going to take over from the 3rd Bde. He reckons at the present time it is very quiet the Battalions at present holding it have had only 1 or 2 casualities since they have been in there.\n\nA couple of nights ago old Fritz attacked & took a little \"outpost\" off the 9th but they drove him out immediately, but he came again & retook it, then the 9th drove him out again & held it during this little scrap one of the 9ths runners got taken prisoner twice, but the Huns could not get him away, the second time he was handing his things over to them, & he pulls out a Mills bomb jerks the pin out & slings it among the mob, just for companys sake, & at the same time he makes a bold rush for our lines, & got there safely with nothing worse than a bullet\n\nthrough the shoulder, we got 1 officer & 8 Fritzs as prisoners during the little side show. There was a terrible heavy barrage put over by our guns this morning, we all thought an attack was coming off, but it appears to have been only a \"practice barrage\" Old Fritzie dropped some heavy shells round our Quarter Masters this morning he caused 1 casualty, & that was a little sparrow who was knocking about on the road looking for his breakfast he had one of his eyes knocked out & one of our chaps picked him up & is looking after the little \"spadger\".\n\nHave been busy getting fatigue parties off for drawing ammunition, sand bags rations & etc ready for our move tomorrow. Another dry & fairly fine day, weather still remains quite mild for time of year. Rumours are flying round about Russia throwing up the sponge & etc, time she did either one thing or the other at any rate for at present she is a drag on us. Len came back tonight & brought some more men for the Company\n\nAfter tea Jack Hayes Len & I went round to Lindsay Grahams \"possy\" to have a few games of bridge & while there a runner came round to get Jack & I, the Capt wanted us, for moving orders had just come out & there were a lot of unexpected little things cropped up that had to be attended to, so that ended our evening for we had to get busy\n\n5th Up early this morning for we were moving & things had to be cleaned up & etc, we pushed off at 9.30 & after a march of an hour & a half reached \"Anzac Ridge\" our new camp, on the way up we passed some enormous great naval guns 9.2 & 12 inch, they were firing at a long distance for they had their great black snouts cocked away up in the air at a very sharp angle. Since I was here last the ground, the surface at any rate has dried considerably but all the shell holes are full of water a chap would get a suck in if he fell in some of them, for quite a number\n\nare fully 12 ft deep, wherever you look there are duckboard tracks, roads, light railway lines & so on, & whats more they are pushing the heavy line on, it is now well the other side of Ypres, & as it creeps forward it carries monstrous guns on its rails, old Fritz was shelling Westhoek Ridge solidy as we came up, but for a wonder \"Hell fire corner\" was quiet.\n\nWe are relieving the 10th Batt. & by some mistake we got here 3 ½ hours to early so we have to wait until they clear \nup\n out. About an hour ago I saw a pretty duel in the sky, but our chap got the worst of it the Hun out manouvered our chap, he hit the plane with his gun alright for I distinctly saw pieces fly out of his wings & down came the plane but quite under control & he landed somewhere behind Westhoek\n\nTo day is the first anniversary of our disastrous stunt at Flers, when C & D Coys were almost annilhiliated, I never saw the like of that night neither before nor since & as for mud & rain well don't mention it.\n\n6th I am sitting in my little dugout & it is just exactly 6 oclock, I have been up early getting some parties away & I had just sat down to write & the instant I took the pen in my hand thousands of guns lashed out as one, words cannot describe what is going on as I write this the air is simply chock full of screaming & howling shells & everything around is vibrating & quivering like a leaf while the noise is indescribable just one perpetual boom, & the only thing you can pick out is the sharp bark of the 18 pounders for a lot of them are quite close to us, the view from my dugout is a splendid yet terrible one, we seem to be between 2 walls of fire the flashes of our guns behind & the burst of the shells in front, where the line can easily be followed by the orange blue, yellow, pink, green & many varieties of red & golden flashes from the various explosives used, & mingling among this medley of lights are the German flares & S.O.S. & onion strings which he is madly throwing in the air, for well he\n\nknows what is following our \"barrage\" there are no Russians behind but men 10 times more deadly to meet & who give little quarter these are the Canadians & they are after the village of Passchendale this morning\n\nIt is wonderful what men can face, why our guns alone are enough to frighten the life out of anyone let alone where the shells are falling it must be perfect Hell then, especially now we hold all the high ridges, it's a bit strange for old Fritz to be on the low land & with very little observation, but that is where the Flanders offensive has put him & he is being punished severely by our artillery.\n\nLast night I saw an awful sight, we were having our tea & watching Fritzie shelling a road that strings of mules were passing up & down laden with ammunition going to the line & returning the shells were bursting right among the animals raising frightful clouds of dust & smoke & knocking the men & mules like ninepins, just pure murder I reckon but the traffic never stopped on they went to the guns, we could\n\nsee the mules & men going sky high & now & again some maddened beast would break loose & gallop for his life down the lane of death those drivers must have had fine nerves to carry on like they did, this transport work is nothing near the cop it was at one time.\n\nOur rations came up late this morning they had some difficulty getting past the cross roads on Westhoek ridge the Germans were shelling it heavily, so consequently all our fatigue parties were late getting away. Got a little packet of photos from England today they were those I took of Peggy while in Edinburgh. Fritz dropped gas shells about us nearly the whole night long, but luckily the wind blew it all away from us, & so saved us the inconvenience of sitting for hours in our helmets gas is a thing that has lost all its terror for us long ago, & it is a greatly exaggerated danger taking\n\nit all round, we get so used to the steady \"plonk\" of them that we take little or no notice, gas shells are easily told from others for there is scarcely any noise, they have just a small charge of explosive about enough to crack the shell, this is all that is wanted for the gas inside which is in liquid form immediately starts to vaporize & so liberates the gas, but it takes a tremendous lot of shells to do much damage anyone who knew nothing about these shells would say \"what a lot of duds old Fritz is putting over tonight\", for that is what they sound like, he is at the same game tonight & is slinging them over in dozens, a lot of them are landing quite close too, & there has been a couple of alarms but the \"all clear\" signal was given after a few minutes in each case, our guns are still hammering away at Fritz & waves of drumfire burst out every now & again like as if you lifted the lid off Hell.\" \n\nThere has been some great air fights today I saw 3 Huns & 1 of ours come down, one fight took place within a few hundred feet of us, they manouvered, & ducked banked, sideslipped, till they were both quite close to the ground, then all of a sudden our plane by a clever swoop & a pretty turn got over & above the Fritz & started to pour his gun in to him we could all see the bright red tracer bullets striking the plane as the S.P.A.D. followed him driving him to the ground, when he had him finished he left him & flew away up in the air again to join his mates & the Hun came down about a mile away. We got news today of the great victory the French have just had over the Huns on the Aisne, beats me how they get so many prisoners & guns each time they make a move, but of course they have wonderful shrewd generals & they fight well do the French, & they are easily our best Allies.\n\nFritz has been using a lot of incendinary shells of late, they look very pretty of a night for they light up for a long way round with a bright fiery red. \n\n7th Old Fritz put a heavy fire on us first thing this morning & it continued right up till dinner time when he slackened off.\n\nI had as narrow an escape this morning as ever I have had, & for that matter wish to, I was walking over to see Dimock, when my well trained ear heard a big shell coming my way, I knew it was no use running so I just stood still, held my breath & waited for the fearful crash these are moments one never forgets, waiting for what seems almost certain death for you are so powerless, what was probably a second seemed an eternity to me & down she come, there was a blinding flash, a sickening thud & the earth seemed to rush up & meet me, & the next thing I knew that I had been flung in the air & had landed in the mud & great lumps of dirt were falling all round me, I was half dazed & my head was full of trains rushing\n\nthrough tunnels & I was tingling all over from the concussion, the big shell 9.2 had not landed more than 3 yards from me & marvellous to say I was not touched, all the metal seemed to fly forward for everything in front was absolutely riddled & torn to pieces, if it had acted as high explosive generally does I would have been torn to ribbons, as it was at any rate I got quite big enough shock to last me for a while, he threw these great shells among our Coy. all the morning & wonderful to say never got a man though he put the \"wind up\" a lot.\n\nOne of our fatigue parties had a terrible experience this morning they got caught in a salvo of \"heavies\", & poor old Snowy Hills got blown to pieces & Charlie Crane & Costello were also killed Costello had his head blown off, we buried the 3 of them this afternoon. 1 Sgt 1 Cpl & 1 Pvt. Neville & Chalinbers were wounded they are giving us \"Hell\" again this afternoon they seem to have got us set to some order.\n\nBlue Dimock & I had our photos taken this afternoon when we went down to bury our mates, an A.M.C. chap had a camera & he snapped us standing in front of a \"pill box\". We lost no time burying them for the shells were falling thick & fast. Received a packet of photos from Edinburgh this morning.\n\n8th Fairly cold first thing this morning & one had to keep moving to keep warm. Issued bombs sandbags, \"Tommy cookers\" rum, socks, & a few more articles they are looking after us pretty well of late this is the best Army we have been attached to since I can remember the 2nd Army will do me & they have treated us well both as regards food accommodation & work.\n\nWe moved away from \"Anzac Ridge at 1.30 this afternoon & made off up the duckboard track that leads to the remains of the village of Zonnebeke, we passed through the top of \"Remus Wood\" where poor Stan was killed, the wood is practically torn to pieces\n\nin places we had to wade through mud nearly a foot deep, the most mud I have seen since the good old \"Somme\" days when we practically swam in it, just before we reached our dugouts over came a couple of 12 inchers, but luckily they shot harmlessly over our heads & burst with a terrific crash & roar throwing bricks & mud ski high & shaking the whole joint putting the fear of God into some of the chaps.\n\nGreat aerial activity again this afternoon & quite a number of machines have been brought down mostly \"Boches\".\n\nWe are now camped under an old cordial factory nothing but a pile of bricks remain on top to let you know that a building once stood there, but the cellars underneath are still sound though very uncomfortable for these sort of places are always crowded. Of all the torn & shattered battlefields as ever I have seen the one round here takes first place. I have never seen such frightful holes shattered out of land & there are so many of these craters, the whole place has been turned over & over \n\nmany times, it would be hard to picture a more dreary & desolate scene, everything blasted & shattered to ribbons & as for the railway station & line well they are both blown out of existence nothing but a few shattered & broken rails are there, silent witnesses of what was once a prosperous & smiling countryside.\n\nToday I saw one of the most daring actions by a Fritz plane as ever I have seen in spite of the concentrated fire of scores of guns & machine guns he swooped down to within a couple of hundred feet & came straight at us, he looked a formidable & terrible affair, & it seemed as if nothing could stop him, when he was over some of our guns he dropped some bombs (6 in all) & not a single one exploded. I'll bet he was no further than 100 yards from us just as he turned, our machine guns peppered him & we could plainly see great chunks flying from his wings but I think he got away safely.\n\n9th The platoons were all out on fatigue last night, carrying & filling tins of water\n\nmaking duckboard tracks & etc during the night we had 3 more casualities. Another heavy & fast barrage this morning & they kept it up for an hour.\n\nWhat a picnic we have just had, C.Coy had to carry the whole of the Battalions rations from where our transport dumped them to our Hqrs & B.O.R., they were to have brought them as far as the remains of Zonnebeke Church, but they were dropping a few \"crunchers\" round about her & apparently they got the wind right up for they shot the rations off more than ½ a mile off where they should have, for once in my life I was genuinely out of temper & I told the Quarter Master pretty straight what I thought of the whole concern himself included & the \"Transport\" in particular, rather than risk 4 or 5 horses & 10 or so men for about 15 minutes, it meant that the whole Company would be exposed for at least 2 hours, to say nothing of the extra work involved for where they had to come across was just a sea of mud & a couple of\n\nlittle creeks chucked in to cross, one of the worst tracks imaginable & very subject to shell fire, at any rate we started off & all went well for the first hour only an occasional shell dropping, but just as the last load was leaving a regular torrent of 9.2 & 5.9s burst right among the lads I thought the whole lot were skittled, they got the fright of their life for they dropped their loads & for some unexplained reason they all came running back to me, what for I don't know, for there was no cover where I was superintending the loading & despatch of the rations, I shouted to them to get what cover they could, for it was murderous standing outside, it is in a time like this that a chap has to keep cool for men always look to a Sgt for a lead & if they see you are cool they will take notice otherwise obey you, but if you are \"windy\" well that's the end of things a couple of wounded men came hobbling up to me & I showed them up to an old dugout, & when all the men were under cover & fairly safe, I went up & dressed \n\nthem, one of them had a piece of shell as big as a pigeons egg graze across his backside & cut three nasty gashes in it & bruised him terribly, I put iodione all over the wound & fixed him up. We had 1 man killed & 3 wounded wonderful how there were no more. Coming back I managed to tread up to my waist in water & slush a pretty pickle I was in & wet for the rest of the day. This was one of the worst little \"barrages\" of heavy stuff as ever I have seen & the casualities we had can be laid at the Transports door.\n\nA funny thing happened at this dressing station a few days ago, they brought a wounded man down & when they cut his clothes off to dress the wound, the Dr nearly fainted, for the supposed man was a girl, she had been in one of the Berkshire regiments for nearly a year & no one dropped to it what price her for a game kid, I believe she was sent straight on \"to Blighty\" & she deserved it & more besides\n\n10th Another heavy barrage this morning the Canadians were going over again. We have been living like lords of late more tucker than we know what to do with. The platoons are handing in all their spare ammunition & bombs, that will lighten the loads some.\n\nImperial troops are taking over all the line from the Australians, 5th Lancs are relieving us.\n\nGot a bit of a shock this morning a chap said to me, youre in the 1st Battn. I turned round & had a look to see who it was & to my astonishment who should I see but Woodfine, I used to know him on Gallipoli when he was in the 5th Battalion he is now in the 2nd Field Ambulance.\n\nThere has been very heavy artillery firing all day long & some of the big ones have been coming uncomfortably close to us & to make it worse it has been raining steadily & the ground is now in an awful state.\n","15":" Well I think I laughed the most \n\nlast night as I have done for a long long time, the way these Tommies go about things is a screaming farce after the way we carry out our \"reliefs\". First of all they were late in making their appearance, they kept on turning up in little mobs all hopelessly lost & out of touch with everyone, why not even their N.C.Os nor officers knew for a start where they were going or who they were going to relieve, if you asked them anything all they could say we are 2nd\/7 (second sevenths) & they were going to relieve the Australians what Battn they had no idea, Capt Whitby & I questioned them & from what they told us I think we were able to put them on the right track, but to make things worse it had been raining heavily all day & the ground was in an awful state & they came the worst possible way & the poor little Tommies were wet to the skin covered with mud & tired out, they had given up all hope of ever getting to their positions & were content to wander aimlessly round through\n\nthe mud & water, if ever I felt sorry for men, it was for these chaps, you have no idea how different they are from Colonials, they never question their leaders even if they are on the wrong track but will blindly follow him, bit different to our chaps. A Tommy once he gets in the Army seems to lose all individuality & initiative, & their so called discipline exists only when the eye of authority is over them, & they have to be told to do every little thing just like a mob of kids, & they live in dread of their officers & N.C.Os of all the incompetent & useless officers as ever I saw in my life these Tommy leaders were just them. I wouldn't follow them as far as I could throw a ton, to watch this batch coming in was a pretty sight there they were circling round & round like a mob of sheep we could see them quite plainly by the flash of the guns & wherever you looked you saw small parties & long\n\nstrings of men coming from all directions of the compass, the most hopeless \"box up\" as ever I have seen, when our Coy were going out they come across a poor little Tommy who was stuck in the mud nearly up to his armpits, & his mates were standing open mouthed gaping at him didn't know what to do. Lew & a few more dug him nearly out with their hands & they had to stand up to their knees in mud & water to do it even then they had to take their equipment to pieces & pass the straps round his body & pull him out by sheer force when they hauled him out he was a sorry looking object covered with mud from head to foot & nearly dead with fright & cold, he lost his respirator & when he saw it was gone he burst into tears & said that he would be crimed & punished if he went back to his Battn without his respirator so Lew took pity on him & gave him his own, that's how the Imperial Army treat their men. \n\nThere were Tommies bogged all along this track & our lads were pulling them out from time to time they had a lovely experience coming out the heavy rain had swollen all the little creeks & washed the duckboards away & they had to wade through as best they could, nearly all got wet to the shoulders, they were in a lovely state when they lobbed back to Ypres nearly 1 oclock in the morning, poor old Blue Whittaker done the Capt Webb act & swam the little torrent & I believe the language from Blue was very sulphurous & he passed in common with the others many disparaging & sarcastic remarks about the war & Belgium in 1 particular & what he wouldnt do before coming to another war & etc. etc. old Blue had another nice experience when on fatigue yesterday he was carrying 2 cans of water over his neck by the aid of a strap, the ground was in an awful state, & by\n\nthe time he came to the little creek he was in a mood fit for anything, as luck would have it in crossing the creek he made a bad guess & stepped right off the board with the result that he nearly disappeared in the awful mud the water cans weighed him down & Blue showed himself a master of well chosen language I never heard such an eloquent flow before & I nearly died laughing, this made old Blue go right off his head & when he clambered out leaving nearly all his trousers behind I nearly collapsed. I believe I should have laughed had he been drowned he looked so comical & he is such a hard case. November is not exactly the nicest month for bathing either especially when you have no dry clothes. We had quite an eventful time & one I shall not forget as long as ever I live Capt Whitby 2 runners a signaller & myself were the last to leave for we had to get all the incoming relief\n\nin their positions & this took us nearly an hour after our last platoon had moved off, we pushed off about 10.30 & we risked a walk down the Roulers road & luckily we got through without scarce a shell coming our way, this road is lined with dead horses mules broken waggons timbers, motors guns & etc. & it is a fairly rotten place for there is no chance to bury any of the animals, it is too dangerous to linger on for heavy shells are constantly dropping on it. it is no exaggeration to say that there are millions of shells stacked down both sides of this road, the place just stinks of them & there are big guns on both sides a little away from the road, our little party stopped twice on the way down to get a drink of coffee & cocoa from the Australian Comfort Funds & Y.M.C.A. & I can tell you we were grateful for it, we arrived at the Ramparts about 12.30 & as we were passing through the big\n\nsquare just past the ruins of the old Cloth Hall old Fritz dropped some heavy shells quite close to us. The cooks had a hot meal waiting for the boys & they needed it.\n\nEarly this morning we made another start & nearly stopped another couple of big shells, they just cleared our heads on our way down we nearly got in the way of some big Gothas which were bombing round close to us & in broad daylight at that. We marched slowly down to our present Camp Halifax & I have had a very busy afternoon issuing blankets, packs, soap & powder for their feet & etc.\n\nJust as we were going to bed tonight the mob rushes into our little hut & declared a rough house. there was Con Conellaw, Frank Ford, Pudding Pickering, Jack Hayes & a few more & what a lively time there was for a few minutes, everything upside down lights out & men sprawling all over the joint \n\nwe often raid one another & this causes a bit of fun I can tell you.\n","16":" Heavy frost & very cold this morning but we did not have breakfast till 8 so that was not so bad, in the afternoon we held a kit inspection & took all the shortages of which I might say there were many, after this the Coy had finished for the day & we put the rest of the evening in pulling down an old cover which had been used at one time to stable horses, & what wood we got out is being used for our fires tonight.\n\nYesterday our Dr had a \"feet inspection\" & he marked 60% as unfit for walking the other 3 Drs in the rest of the Bde done the same, they are trying to get us carted off in buses, but I think they will come a \"gutser\" for I hear we have to march, the 2nd &","17":" Bdes went away in motors but for some unexplained reason we have to march although we were the last out of the line all our officers are very sore over it, & rightly so.\n\nGeneral Birdwood was round the lines this afternoon having a yarn to all & sundry, his only another ridge to take boys is a standing joke in all the Australian Battalions, they have made a little bit of poetry up about it starts something like this.\n\n\"Oh the boys all look so beautiful & calm\" Another \"little ridge\" wouldnt do them any harm\"\n","18":" Marched out from Halifax Camp this morning, but \"thank goodness\" they carried our packs & blankets a 7 mile march they told us, but it was nearer 11 for it took us exactly 4 hours & we only had 3 short spells & I can tell you we were very glad when we pulled up just outside St Jan's Capelle, a small village the people we are billeted on are a rotten crowd, as soon as we arrived they took the handle off their pump & would not even let the officers draw any water, a Mills bombs down the pipe wouldnt do them any harm, some of the lads got \n\na little wood off one of their old tumble down sheds & they kicked up a terrible row over it.\n\nThere has been a most terrible bombardment raging ever since morning sounds to me round Warneton or Armientieres, the whole air is quivering with the vibration.\n\nWe (Sgts) had a great feed of fish tonight, spent our last francs on them & made a proper meal of it.\n\nA lovely day, more like early spring than winter, & tonight there promises to be a heavy frost\n","19":" This morning we moved off at 8.15 for what proved to be the longest march this Battalion has ever done, we marched till 4.15 with only the usual 10 mins per hour spell, & an hour & a half for dinner which we had on the road, covering just on 19 miles, not bad going that but we carried no packs, scarce a man fell out which was pretty good, we are now camped for the night in an enomorous great barn, B & C Coys & Hqrs are in\n\nit & A & D are in another portion. I fancy in peace time they do a lot of fattening here, we picked the band up on the way down & they played us a few tunes. Passed miles of N.Z. transport as we were coming down, they were all going up to have another look at them, & just before we reached our destination along comes great strings of N.Z. & Australian cyclists the mob were all spelling at the time & they kept up a running fire of remarks as these sweating & muddy peddalers toiled by, it was very heavy going for the road was wet & muddy & the husky cyclists were full to the neck. We are now back almost in the same place as were we first billeted on our arrival from Egypt, Wallon Cappel \n","20":" We struck another lousy old swine last night, we cleaned our billets nice & clean, but when he came to inspect before signing the \"billet clearance\" the old swine kicked up a row because he saw a few handfuls of clover where one of the boys had been\n\nsleeping. & to make it worse he caught one of the batmen bringing a little armful back, for about 5 francs worth of hay he tried to hit the officers up for a 100 francs but I don't think he got anything, & I should think not, these are the sort of French people which spoil the boys opinion of the whole nation & you run across them here & there, & the richer they are the worse they are to get on with, its a pity we did not burn the whole show down. Moved off again this morning for only a short march as they told us, but we know from experience what instance these short marches really mean, so we were prepared for anything & by Heavens we got a snorter, 4 ½ hours solid foot slogging which would mean anything from 12 to 13 miles, too much altogether for the men are very soft after laying about in the mud & water for so long in Flanders, & its time they took a jerry. I sometimes wonder if they are trying to put a record up by the ground we are covering towards the end of the journey the men & I might say myself also got very hungry\n\n& they started to pull the turnips that grew alongside the road, even the officers were having a cut at them & carrots were also in great demand, I had a good feed of both so hungry was I. Major Mackenzie arrived in camp carrying a cabbage & a bunch of carrots, he's a dag alright is \"Blinker\" as the lads call him & up to any game & a jolly fine sport.\n\nJust before we marched out old Georgie Stien joined us up again after an absence of over 2 years he left us at \"Lone Pine.\" We are now billeted in Heurlingham the usual brand of French village with its little estaminets, tall spired church, & broad market square, & cobbled streets with dirty little kids running about to say nothing of the mud & stink.\n\nWe passed through some magnificent agricultural country on the way down as fine as ever I have seen, this must be a very thriving & wealthy part of France, saw thousands of tons of sugar beet stacked by the roadside, & at one place along a canal there were mountains\n\nof them, at first I wondered what these great stacks could be, for the beet seems to be a cross between a mangold & a parsnip, they are very sweet to taste.\n","21":" On the move again & C Coy were leading today this makes the marching much easier for the leading Coy always have the band in front, Coys take the lead in turn while on the track, I was sorry to leave our billets for the people were real good & treated us well. The country we passed through today was regular agricultural districts all the land was being worked for miles around, & there were easily twice as many women & girls as what there were men working in the fields, pulling roots crops of which they seem to grow enonorous quantities, such as mangolds, beetroot, turnips, carrots & etc, the land is wonderfully rich judging by the crops they take off, & almost ideal for farming purposes, being so level & stoneless.\n\nAs in former days we skirted all the\n\nmain roads, & followed the little second class roads which wind in & out among the picturesque old country villages, this was all new ground to us, & therefore interesting & to a lot of the French people we were a bit of a curiosity for they had not seen too many soldiers before, it was a long march & when we were getting towards the end of our journey we came across the 1st Pioneers billeted in a nice little village, which lay right in a pretty little valley, now we thought we can't be far from our joint, but just after we cleared the town, the Battn came to a halt to hold a consultation as to where they were & etc out came the maps & the mob stated to groan, for it is usually a bad sign when these are fished out, at any rate they decided to halt where they were for an hour & have lunch, & continue afterwards, but no \"cookers\" were in sight, so we just had to wait with what patience we could till it was time to push off, while we were waiting Jack Hayes & I strolled \n\nover to where we thought we could see some turnips growing, & we guessed right so we collared one each & had a feed off it. Men are pretty hungry when they come at this I know I could have eaten anything. We finished the last stage of our march about 3 miles at a rattling good pace, & pulled up in a quiet little village miles from nowhere, & I can tell you the mob were glad to throw their gear off & lay down we had walked since 8.45 & the time we finished was 3 oclock & nothing to eat between, must have covered 15 miles \n","22":" The Battn are resting today & they need it badly too.\n\nWe are all billeted on fine people here, give you nearly anything some of the lads had coffee brought in to them while in bed this morning & apples were distributed freely. Last night I had a yarn with one of the French girls who work on the farm, she could talk a little English, & I asked her a good few questions about one thing & another, she told me that French girls work just the same in peace times on the farm\n\nas in war times, she couldn't understand why it was that the women & girls in Australia don't do the same, they have got a great down on the \"Pork & beans\" (Portugese) she reckons they are a rotten lot, no education at all & less manners, she said they never think of saying \"merci (thank you) for anything, but act like pigs, they had a lot billeted on them for 5 weeks, the British & Portugese had a fight here once with the result that a number of the latter were sent to hospital, the Australians have a fine name down here Australia bon she says, plenty polite & good manners. The one great topic at the present time is when are we going to get paid, everyone is stony broke in the Coy even I am a most unusual occurence for I generally have plenty this is the first time I can ever remember being penniless, & I don't want it to occur again.\n\nA big mail came in this afternoon & I got a few unexpected ones out of it but none from home so far.\n\nThis afternoon I went for a short walk down the little valley, everything showed the signs of Autumn, the trees slowly shedding their golden & russet leaves & gently floating down in the cold still air covering the grass which is fast turning yellowish, with a brown layer of leaves the old trees looked very bare with the pale sunlight flooding the countryside & only here & there could be seen a few hardy flowers which still hung out in spite of the cold winds & frosts, never the less the old valley had a certain kind of beauty which was unmistakable it must be a very beautiful little spot in Spring & Summer & a delightful place to spend a little holiday in, so quiet & peaceful & far removed from any big town. Salvecques is one of those quiet little French villages that still lie buried far from the roar & rattle of the busy towns & railways & kinder people it would be hard to find once we get away from the war zone the difference in the people we meet is remarkable\n","23":" & on the move again we marched out at a quarter to 9 & after nearly 3 miles picked up the rest of the Battn, nearly the whole of the little population were there to see us off, they were bonza people & we all were sorry to leave them. We did not have a very long march today about 9 miles & we are now quartered in a small little village, Becourt, the old chap who owns the billet we are in was greatly against the boys going upstairs to sleep reckoned the floor wouldn't stand them & he was right for tonight as we were playing cards there was a terrific crash & down came boards plaster, & etc & with it a mans leg, old Case had gone through it & the whole concern seemed to be cracking, the floor must have been a hundred or so years old by the look of the timber. When the Captain came in, we showed him the hole & he laughed like anything.\n","24":" Toddled off again this morning at 9 oclock, & we had a fairly long march but most of it was\n\nvery interesting & at times hilly, we had several splendid panomoric views of the surrounding country, once just as we got abreast of Desvres the scene was very fine, as far as you could see towards the West, the land rolled away like gigantic billows the sides all covered with green growing crops & grass, & scattered all over the place were clumps of trees, while at your feet lay the busy town with its tall factory chimneys with smoke curling slowly upwards, from here the road lead gradually along a pretty ridge but ever climbing, climbing & at last we reached the summit & a splendid view was unfolded, we were on a high hill, the highest anywhere about & away below us lay a beautiful fertile valley & on the opposite slope lay a fair sized town & a white road stretching for miles, the boys all gasped when they saw this, these never ending roads are not the nicest things to have in front of you.\n\nAs we were spelling before going through Samer, the 3rd Battalion came along & passed us, we then followed them through the town with our Band playing their best, & our rifles all slung on the right shoulder, trying to make as good an impression as possible for to these people we were almost the first Australian soldiers that they had ever seen, they were all lined along both sides of the street as we passed through, & the kids were singing out \"Welcome to Samer\" or something to that effect, the old familiar \"fish & chips\" smell was very noticeable & we one & all wished we had a plate of them in front of us for we were very hungry. We pulled up just outside Samer & had dinner & after this we pulled the old No.9 platoon out, & made the 4 again. Saddled up again & off to our new home & what a beauty she is, the Coy is scattered over a good mile No.11 are billeted quite close to an old church in Verlingthun & from there to Coy Hqrs it is a good mile & what billets they are\n\nto think that we marched 80 miles for these why you could find better billets without leaving the \"forward area\" at any rate this march finished the long long trek & all are heartily glad, we were very fortunate right through for we had almost ideal weather for marching\n","25":" Breakfast 9 oclock this morning so we had quite a long sleep in, after breakfast I made a fire & set to & washed every bit of clothing I had, tunic, trousers, shirt, underpants socks towel & etc I went through the whole lot, & when I finished I felt quite proud of myself, I always do after a washing day which needless to say is very seldom.\n\nAt 2 oclock the much needed dough came to light, the first for nearly 5 weeks, I might mention there were no absentees for this parade, also sent 5 men on leave to Bologne we are quite close for you can hear the steamers blowing their foghorns quite plainly, almost any time.\n\nJack Hayes & I have been discussing what we are going to do & where we are going to go, when we go on \"leave\" to Paris, we have quite a lot of plans but I'm afraid they won't all be carried out.\n\nReceived a few more details tonight also supplied a guard for Hqrs.\n","26":" The Coy was on parade this morning but it was mainly physical jerks & football, & in the afternoon there was a match between B & C Coys. The former won easily.\n\nThe troops put up a fine stunt last night, some of them never got home til nearly morning, old Digger was showing well, he came into our joint where we were sleeping & poured some beer down Bill Bradleys ear, old Bill jumped up in a terrible rage, I thought he was going to kill \"Digger\" but nothing came of it, a reprisal raid Digger called it, for some of the stunts the Q.M. Staff have been putting up on him.\n","27":" Very misty & foggy this morning could scarcely see 100 yards from us more football & plenty of rough ups, but these are the finest things in the world to get troops fit.\n\nHad a couple of the Band up for Orderly Room this morning, the M.P.s. caught them just outside their Camp & ran them up, but the Capt. dismissed them both.\n\nMr Beckett left us yesterday to take over the Transport for a while, Capt Witby did not like losing him, & for that matter none of us.\n\nIt looks as if we are not going to have a vote this time on the Conscription Referendum, perhaps they are afraid that the soldiers will vote strongly against it again but they are making a big mistake, for many of those who voted No last year will vote Yes\" this time including myself if only they give us the chance, another thing that beats me is why on earth they won't let a man vote who has \n\nleft Australia to fight for his country just because he is under age, if he is good enough to fight he should have a vote 10 times in preference to the rotten stinking swine's of loafers & strikers who remain in Australia, this last big strike about settled us over here, especially when they refused to load our mail or food, all I hope is that the whole box & dice of them get sent over here, they might change their opinions then.\n","28":" Lovely & sunny this morning, quite remarkable weather for this time of year, its more like early Spring with the exception that the trees are very bare & grass looking ragged, but everything else is bonza. Lindsay took over the C.S.M. again this morning I had quite a long run on the job & I rather liked it.\n\nJock Mackie came back last night & we were all pleased to see him back he is still the same old stick, Jock is going to No. 11 platoon.\n\nTook all our shortages again\n\nthis morning, you would be surprised at the amount of stuff the men are short of these \"requisitions\" are divided into 3 distinct parts viz. A.B.C., the first coloumn A is for articles that never have been issued, the next, B. for articles that have been lost by shell fire or through action of the enemy, this coloumn practically covers all deficiences, it is a good loop hole for stuff that has been lost by them or thrown away owing to some of them being too lazy to carry the gear. I might say that nearly all shortages fall under this coloumn, otherwise they would be made to pay for the stuff the next coloumn C is for exchanges, that is to say that whatever you have under this heading, you have to put an article in return, all old worn out & dirty clothing & equipment & etc are exchanged for new stuff through the Quarter Master in this way, I don't know what the troops would do if we did not go near the firing line sometimes\n\n \n\nI can see some of them with a pretty bill to pay for articles lost, I have just had to knock off for a few minutes for Jack Hayes our Quarter Master has been annoying me, wanting signatures & etc for some of these articles.\n\nSplendid news came over the phone last night, telling us of the 5 mile advance of the British down towards the old Somme\" way again, what a splendid performance the \"Tanks\" put up, & they have quite justified the high opinion formed of them when first they were introduced last year.\n\nJack Hayes & I sent 4 big parcels away this morning \"(more souvenirs)\" C. Coy played A yesterday afternoon & beat them 9 to 3 but just before the finish they discovered that C. had an extra man playing, so they declared it a no decision match, so they are playing it over again this afternoon. Strikes me I am getting a batch of \"scabies\" for little pimples are breaking out all over me, & I feel as if I\n\n \n\ncould tear myself to pieces so itchey are they, this is quite a common complaint among troops, they cure it by giving plenty of sulphur baths & a rest, I don't want to be sent away yet a while not until I have had my Paris leave at any rate, I don't mind then.\n\nA. Coy won this afternoon by 11 to 3 it was a very rough game, as most of them usually are.\n\nThere was a rare bit of fun round Poperinghe some little time back, one night the Huns dropped some bombs among a camp of Chows, & they got for their life, next morning when they called the roll there were but 28 answered out of 180, the rest were anywhere between Poperinghe & Paris took a good week to collect them all again they would do me to fight against these Chows but the chows got even with the Germans for they collected a lot of Mills bombs & went & heaved them into the cages where the German prisoners were quartered & they killed quite a number in their cowardly way of theirs \n","29":" The usual parades this morning & plenty of organized games. Signed for our Australia books today wonder if they will ever get them. C & D Coys officers played A & B this afternoon & after a very rough game beat them by 3 to nil.\n","30":" & Church parade we held it in an old quarry, & there was a regular hurricane blowing & the wind was as cold as ice.\n\nWe had a fine dinner today roast fowl (don't ask questions as to where they came from) potatoes, turnips carrots & parsnips, all salvaged by the troops, you cant beat the Australians for foraging. \n\nNews came through tonight of the capture of Cambrai, some victory this latest one of ours, there is great jubilation in France over it.\n\nGot a small batch of welcome letters this afternoon.\n\nAs I sit here writing I can hear the troops returning with the night\n\nbooty, I fancy they are the turnip & carrot party, there are others out after fowls & turkeys, I can see some fun when they discover their poultry missing & perhaps we shall have a bill to pay, however we are out for a spell & this covers a lot.\n","31":" Very cold & windy last night but the morning broke beautiful & sunny & this afternoon it is simply glorious out in the sun not a cloud in the sky, just perfect. We had a very easy mornings work all games practically & we do knock some fun out of them.\n\nDimock came back from Paris & Starkey went away last night. Jack Hayes & I will be next away I suppose.\n\nAll round here the French people have great pits dug into which they cart the sugar beet after all the goodness has been taken out, & dont it stink puts me in mind of mangolds chopped up very fine. I fancy they feed their stock on it during the winter months. I should think it would be suitable for that purpose.\n","32":" We were to have had an early morning muster, but it rained heavily & so spoilt everything.\n\nIn the afternoon \"organised games & a cross country run were on programe. The run was about 2 miles & to my great surprise I finished 5th in the Company, Len was second, but wasn't I stiff after it, scarce could walk about. In the evening a party of us played \"pontoon\" till 11 oclock with varying fortune, Jack Hayes, Lindsay Graham, Jock Mackie, Lew, Bill Elder, Cameron & a few more of the hard heads.\"\n","33":" Lovely morning & plenty of sun parades are not so bad under these conditions.\n\nAs I was coming home last night I saw someone lying in the gutter alongside the road I walked over & has a look to see who it is, & to my surprise it was old Beggs, he had been \"stunting\" & had got this far & could get no further, he was paralytic drunk, so I picks him up &\n\nafter a bit of trouble got him up the ladder & into the loft where he sleeps, lucky for him that I came across him for if he had slept out in the mud & water this time of the year, it would have gone hard with him. Received a welcome batch of Australian letters yesterday. \n","34":" There was a great game of football yesterday afternoon, the teams were from A & C who played B & D, & the rivalry was very very keen, the losers had to pay for a dinner, the wagering was was heavy & plenty of money was to be picked up if you felt inclined. B & D were very confident, but they got a shock, the first half they kicked with the strong wind that was blowing across the ground & although they tried their hardest they failed to score, the next half was very strenuous & the excitement raw high at times especially when Jimmy Lynch after a great race with another chap scored a \"try\" this was the only score of the match but it enabled us to win after an excit\n\ning & splendid match, at the present time our Battalion have a very fine team & they will take some beating. This afternoon we had a fine bit of fun 9 & 10 Platoons played 11 & 12 football & they kidded me to have a go. I had never played Rugby before & it seemed the funniest game out to me, at any rate I think I held my own, we were supposed to play 20 mins each way, but when the time was up the troops wanted more, so we had an extra ½ hour, of course it wasn't rough \"oh no\", for a start I broke some of old Jocks false teeth & split his lip slightly in 3 places, this was purely an accident, when we finished up I was very stiff & sore, & plenty of fine big bruises, especially on my hips, legs, arms, & wrist, & the rest of the mob were something the same Lindsay Graham was bleeding like a pig, but all were as happy as larks.\n","35":" Yesterday our Battn scored a runaway victory down at Bologne over an hitherto unbeaten Conval-\n\nescent Camp team, scores 53 to nil. Weather still holding remarkably fine, & whats more it is far from cold, all I have worn so far is just a singlet & occasionally a cardigan jacket after tea, in addition to my tunic.\n\nThis morning after yesterdays strenuous scrambling I am as sore as can be, but I feel as fit as a fiddle otherwise, I am in the best condition now I think as I have ever been since I enlisted, I am feeling tip top & am fast getting my wind back. Instead of going on parade this morning 7 of us were selected as being the best rifle shots in the Coy. Bill Cameron, Patrick Rusty Egan, Jack Hayes, Raffan, & Len & I, we got a lot of ammunition & took a note over to Capt Booth whose Coy was using the range, asking him to let us have a couple of targets to try our rifles on, all right he said, so we started on the minature range first & the whole 7 shot splendidly the bullets practically cut one another so accurate was it. We were in great spirits when we left\n\nto try ourselves on the longer ranges then the fun commenced, Raffan was first to go down on the 100 yards, & he is a first class shot, he scored the high tally of 8 out of a possible 20 how we all laughed & Raffan was as mad as a March hare, Len was next down & he got a doubtful 10, Jack Hayes & I fancied ourselves after this display I was next down & I thought I would allow for a degree of wind, & I did & I got the best score 11, well this sort of ting went on, all rotten scores, till we moved to the 200 yards then the pantomime started Cameron got a wash out, so did I & the best score was a miserable 7, when they waved me a washout I was nearly speechless for I could have sworn I held the rifle as steady as a rock we could not make out what on earth was the cause of it, for all were shooting absolutely rotten, the only thing was the day which turned out at 12 oclock rotten heavy shower of mist were drifting across & it\n\nwas cold & we were wet but you would never think that this would have such an effect. I won't tell you what happened at the 300 better left unsaid, & the language was strong, very, why the worst shots who ever held a rifle could have beaten us hollow, & we were the picked shots of the Coy. \"Lord help the worst\", well I laughed & laughed till I nearly cried when each mans shoot was signalled back to us, the blank look of consternation & amazement that gradually spread over their face, when they found their score totalled about 4 or 5, & sometimes a \"washout\", it seemed so impossible & ridiculous that all these crack shots could get no more than these paltry scores I think I enjoyed myself as much as I possibly could, the situation was so funny. The weather was about the only possible explanation, for it was treacherous at any rate I shall never forget this day as long as ever I live, the day when C Coys crack shots went shooting.\n","36":" The Coy was paid last night the 3rd time in a few weeks. Very cold & miserable this morning a light rain is driving across the countryside making things miserable 10 & 12 platoons got into a row over their billets this morning they were dirty & the Capt went crook. This afternoon they kidded me to have a match with the Coy. against D. it was a wet & dreary afternoon but nevertheless the match took place, I was playing centre-forward, that is one of the places in Rugby where 3 men on each side rush in with their heads down like mad bulls & try to shove each other off the ground. The scores were 5 to 3 D Coy winning, it was a fine game & very even, & I think I more than held my own, they reckon I did at any rate but what a mess we were in you should have seen us, our jerseys & knickers were covered with mud from head to foot, & when we got home we turned to & heated some water up & had a hot bath, I stood it well, the running & bustling\n\n \n\nfor at the present I am in the pink of condition never felt better in my life speaks well for the Army don't it, but I have been taking care of myself & I always have had a fine constitution or I should never have got away with the \"originals\", I was a good inch under the required standard at that time but the Dr. said I was so sound & solid that he would let me through, I was lucky, at that time they were turning hundreds of big strong chaps down for miserable & paltry little defects, & it was a constant source of wonder to a lot of the lads how it was that I had passed & it is also a wonder to me even to this day. Nearly had a disastrous & painful accident a little while ago while trying to unload a R.G. Smoke bomb, I had carried this bomb for a long while, waiting until I could come across a vyce to hold it while I unloaded her, there happened to be a vyce where we are camped so I got to work on her & started cutting the side away I could see little flashes coming from where I was cutting & I was going\n\n \n\nvery carefully, but unfortunately just as I was finishing, off she went & scattered the phosphorous particles all over the place, well you talk about a stampede for there were a number of chaps watching the delicate operation, they fairly flew for their lives & left me alone with the bomb blazing & spluttering like mad, as quick as thought I unscrewed the vyce whipped her out, & pitched the whole concern out in the mud where she burnt herself out after raising tremendous clouds of smoke & fumes, & I was just able to stamp the rest of it out before it set the whole billet alight, but I never got off \"scot free oh no\" some of the phosphorous caught on 2 of my fingers on the left hand & burnt like H.. the only way I could get it out was by dipping the hand in mud, this killed the phosphorous but my fingers are badly burned & blistered & are very painful & sore, but that is nothing, for I still have the bomb & she is unspoilt, the boys all reckon one day I will blow myself up\n\nI came pretty close to it this time but it never came off, they always keep clear of me when I am handling \"souvenirs\" it is dead funny & I shall never forget the fright this lot got, when the old smoke bomb exploded, they thought it was their birthday \n","37":" A bitterly cold wind blowing this morning cuts like a knife, a regular East wind, the old sun is shining but you can't feel no heat. We had turkey & fowl for dinner today the results of a raid by some of the lads on a miserable old swine round here, it don't pay to be that way for the boys will get even. Yesterday afternoon the Battn played the Brigade Machine Guns & beat them easily 19 to 3.\n\nHave been doing up parcels all the morning & now have 5 more ready to be sent to Mr Duke. One of my men took very ill last night & the Dr. had to come up to the billet to see him \"trench fever\" I think.\n\n3rd Jack Hayes & I had a good win at \"Pontoon\" last night nearly broke the school. Beautiful & sunny this morning, & we have been on the range, the whole Coy \n\nhas been shooting & the best shots have been selected after a competition to represent the Coy in the Battn sports which are coming off shortly, this morning I upheld my reputation, as a rifle shot scoring the highest number of point in the Coy. beating Len & Raffan two noted \"howlers\", the last round was very close Raffan got 19 & by the way he smiled he thought it wouldn't be beat, I went down next & scored 20 all in a group & just missing the \"bully\" Len got 21 & beat me for the first time this morning, but my aggregate total was the highest, & I can tell you I felt proud of myself for there were some good shots out against me Jack Hayes & I won 20 francs over it. I shot very consistent all the morning, first score was a \"possible\", 2nd 22","38":" 19.4th 21 5th 20. Not bad you know for the conditions were not of the best a nasty cross wind was blowing. This afternoon 9 & 10 Platoons played 11 & 12 & got beat, I scored the only\n\n\"try\" for our side, so for once I have had a successful day, these little matches cause a great amount of fun & merriment & they are as rough as can possibly be.\n","39":" The whole Coy, went to Etables to day in motor buses for a bath, took us a good hour to get there & we went straight in & got our wash, they told us we were going to get a clean change of clothing & we were looking for this, so we were not prepared for the surprise they sprang on us, when we got into the drying room we sang out for our clothes & in marches a little \"Tommy\" & slings on the middle of the floor a bundle of the filthiest & dirtiest clothing as I have ever seen we were all speechless for a few secs then you should have heard the roar that went up, Len jumped up on a bench & advised the mob not to touch the stuff until an officer was brought round to have a look, so away they went to find an officer & make a complaint, the Tommies were dumb founded, for they never expected\n\nthis sort of thing to happen, they must have thought we were like themselves take anything thats given them & ask no questions as the majority of them undoubtedly do, but not so our chaps they demanded their own clothes back for they were 10 times better than those they wanted to give us, & when the officer came round they insisted on it & they had to carry it out & return all our clothes, & would you believe it they were in a far worse state than when we handed them in, they had put them through the disinfecting machine & they were in a pretty state & you should have seen the tunics after coming out, they ruined them absolutely, the Coy. were split into 2 parties & they went to different baths & exactly the same thing happened at both places, surely this is not how they always manage things, or perhaps they were trying to pile some rubbish on to us, if that was their intention they used bad \n\njudgement in their choice, at any rate we are a sorry looking push now, the Coy went down looking smart & business like but they came back like a lot swaggies & sundowners, & all concerned are mad about it.\n\nA very heavy frost this morning & the ice is nearly ½ an inch thick on the pond. Taplin & a few more back from Blighty \n\n5th A heavy frost and not too promising morning, but it turned out a lovely afternoon plenty of sun but very cold. This morning the platoons were judged for the \"best turned out platoon\" A & D Coy. tied for first place No 11 platoon were 3rd.\n\nThe shooting competition also started after the usual preliminaries A Coy. went down first & shot very well we followed them, Len got a \"possible\" I got 22 the next highest score, Jack Hayes 21 Edwards 20 & Raffan 18 D Coy. were next & they pipped us by a point, the scores of these Coys were close. A 105 C 106. D 107, we knocked \n\noff then for dinner intending to finish it during the afternoon, but we were playing D Coy. football so Capt Witby rang up & got them to postpone C Coy. shoots as Len, Edwards & I were playing with the Coy. in the afternoon so they did\n\nD Coy. won the toss & kicked with the sun on their backs, & all through the first half we stopped them from scoring & we thought we had a fine chance, but they scored a lucky \"try\" soon as we started on the 2nd half & try as we could we could not catch them, so they won by 3 to nil, after a very willing game during which I managed to get 2 very nasty cuts over my eyes, one of them nearly stunned me & I bled like a pig. I now have two lovely black eyes & my Paris leave about due, stiff isn't it. & the shooting comes off tomorrow its bound to affect me to a certain extent but we will play football, bet your life. Got about half a dozen new men for my platoon today & they are badly wanted for our strength is dwindling away.\n","40":" The shooting match was resumed this morning, the shooting was only average right through, but I could do no good at all my black eyes settled me, at 300 yds I missed the target ","41":"\n 5 times out of 7 & I could have sworn I held it steady & true but my damaged eyes were deceiving me. Len shot very well again.\n\nC.Coy. won the \"best Lewis Gun team\" by ½ a point from A pretty close going. Starkey came back from Paris last night & this morning he went to Hospital. Voting day today for Conscription or otherwise, I voted \"yes\" this time & I am sure that there will be a big majority in favour of it \n this time\n how ridiculous & unfair it seems that all those under 21 are not allowed to vote, this privilege should be granted at once, if a man is good enough to risk his life & all for his country why in the name of all thats holy shouldn't he have a vote.\n\nSending 3 parcels of souvenirs over to Mr Duke by one of the chaps who \nar\n is going on leave tonight, hope he gets them over safely\n","42":" My Paris leave came through last night, so this morning I have been getting ready &etc. I don't know what they will think of my eyes for they both look very suspicious, guess they will say, Keep your eye on this young waster for he looks a bit of a roughien, & he might get you into trouble, but I am going all the same for I don't want to miss this chance of seeing the gay city.\n\nIn the afternoon I went along & got my \"pass\" & then went on to Somer about 3 miles off & drew my money from the \"Divvy\" Paymaster & after that went into a restaurant & had some tea (steak & potatoes coffee & bread & butter) not wonderfully appetising but filling.\n\nThe first part of our Battalion sports were held this afternoon, the weather was not too favourable & the ground very slippery & a nasty mist was falling, the short spell of frost seems to be broken. \n\nAfter all our planning & scheming Jack could not get away with me, although his \"pass\" is laying in our Orderly Room\n\nat the present time, someone has got a down on Jack & is holding his pass back. Jack is going stone mad over it, & is going to be paraded to the Brigadier to see what satisfaction he can get. This evening while waiting for the train at Somer, I had quite a long yarn with the old R.T.O. who is stationed there, he knew Tasmania & parts of New South Wales where I had been in real well though it was years ago since he had been there, & he was very interested in lots I could tell him.\n\nLeft Somer in a cattle truck on \nmy\n the first stage of my journey to Paris, & I got out quite close to Bologne & while waiting for the train had quite a bit of fun, an Australian & a Tommy were pretty well inked & were acting the goat, the Tommy was imitating Tom Burrows the champion club swinger & for this purpose he was using 2 empty wine bottles much to the amusement of all concerned, while the Australian whistled the tune to which he swung the bottles.\n\nJust before the train moved off I saw Tom \n\nFlattley he also was going to Paris, so we hopped in the same carriage, but on the way down at Amiens I lost Tom while changing carriages in the crush but expect to pick him up on arrival. \n\nA funny little thing happened me while waiting at Amiens, I was holding the door of a corridor carriage open looking out for Tom, & I noticed a French officer walking up and down, at last he said something to me in French. I could not understand what it was so I says \"whats the matter digger\" the old boy says, \"me no speak\" an English officer was standing just close & he said to me with a laugh That's a French General you were calling digger\" Aussy. not bad was it.\n","43":" After travelling all night I arrived in Paris at 6.30 It was raining steadily & quite dark so I could see very little, a guide met us at the station & collected al the new arrivals & took us round to the Club which is in an immense & beautiful hotel (Hotel Moderne) here we booked our beds \n\nhad a wash & trooped down to breakfast, which we had outside in a big Café, here I had an argument over my bill of fare, the waiter brought me round eggs, which I never ordered nor ever eat. I told him I did not want them but he took no notice & left them on the table, when I saw this I was quite determined I should never pay for them & I wouldn't either athough they tried their hardest to make me. After breakfast some Canadians & a few of us went round to the barbers to get a clean up & for just a plain hair cut they socked us for 2 ½ francs, from the barbers we taxied to the barracks where we had to report & after that we were free till our leave is up, here we picked up an old English guide & we engaged him to show us round some of the more interesting parts of Paris the slums & such places for which as every one knows Paris is famous & I can tell you I had my eyes opened I cannot say on print what we saw in\n\nsome of these houses for you would never believe me & it would scarcely look nice on paper. I saw one of the flashest houses of ill fame in Paris & it was furnished like a palace, & everything was up to date I reckon it does one good to see these places provided he can master his passions, at any rate I'm glad I went & saw them & it cost a pretty penny my expenses for the day were a modest 120 francs, & all I had to show at the end was a little souvenir of the \"Notre Dame\" that ancient & magnificent Catherdal which almost stands on the Seine, she is lovely inside with its towering roof & Gothic architeture & the loveliest stained glass windows as I have ever seen.\n\nThis evening after cutting about all day we went & saw the Alhambra they put a good show there, one thing in particular got me & that was the way they used the colored lights easily the finest I seen anywhere.\n\nThe buses here have a good idea, instead of issuing tickets on the bus, you get your\n\nticket from outside, great bunches hang on posts put there for the purpose & all are numbered & you take your turn according to the number of your ticket & pay inside saves a lot of time & trouble.\n\nHad a 9 course dinner today went right through the menu (cost 8 francs) & then I felt hungry they dish up such small & paltry dishes under all sorts of false names \n\n9th Did not get up till 9 oclock this morning had a lovely bed & I was very tired last night, another chap & I went for a stroll round some of the little side streets, & in one little café we struck we had a bit of fun with some girls, there were all sorts French Belgian Spaniard Italians & etc & they were hard cases you can bet, we stopped there drinking coffee & sweet wine till dinner time then we came back to our hotel & had a good dinner, here we picked Frank Forder up he had followed me down after dinner we all went up to see if we could get a seat at the Comique Opera a magnificent theatre,\n\nwhere they were playing \"Carmen\" we were too late so we booked seats for \"La Travita\" 4 days ahead, from here we taxied down to the Rue de Sebastopol, & as it was getting late we decided to have our tea so we went into a big restaurant & set to work, & I ate something tonight which I never thought I would be game to tackle in the \"creation of eats\" nothing less than a plate of \"escargots\" (snails) fancy sitting up to a plateful of them, 3 of us had them & 2 doz oysters, the snails were dished up in a little tray, boiled in their shells with a little bit of green chopped very fine over their mouth, a special fork is provided to eat them with, & would you believe it they do not taste too bad, we ate them quite easily what do you think of that, they have a sweet taste something like liver, this was the best restaurant we have struck so far & very reasonable 7 course dinner for 4 francs & a good one at that before leaving Paris I must taste some frogs they reckon they are pretty good & I should not be surprised after the snails.\n\nThis evening five of us went round to the Gaumont Picture Palace supposed to be the finest & largest in the world, shes a bonzer & no doubt about, & an eye-opener, we were flash & had a \"box\" how all the people stared at us 5 Australian soldiers together, & in a box, we have been doing it in style so far, there is every possible convenience in this theatre & the pictures are absolutely first class after the performance we caught the tube home & so ended another day\n\n10th Frank & I have been out in the city all day long & have just arrived home 12 oclock PM, we have been all round the Champs Elysees the world famous & beautiful boulevard, saw the \"Arche of Triumph\" an immense great arch built to commemorate the Revolution. Paris is a lovely place & no mistake easily the finest I have ever seen knocks London into a cocked hat, the streets are so wide & beautiful with the trees growing along both sides & the magnificent buildings all so regular\n\nWe went into an American Y.MCA for dinner & we struck 2 of the best chaps imaginable we were the only Australians in there & 1 of the chaps said come along with me I'll take you to a good table, so we said alright & followed him. He led us round to a quiet little corner where we had bonzer plush seats, & he brings an officer to dine with us, & I can tell you I put in as pleasant a couple of hours over that dinner as ever I have done for a long time, they were very anxious & keen to know all about the trenches & etc & we discussed a hundred & one different subjects, from the preparations America is making down to the Conscription issue in Australia. What impressed me most was the way in which they have changed their opinions regarding Englands way of doing things, these chaps had been with the French Army for 6 months & they reckon we are far & away in front of them in every respect & hanged if I don't think theyre right. After dinner was over & it was a good\n\none served up with plenty of silver flowers, serviettes & etc & which by the way they would not listen to us about paying for anything one of them settled it & it was a tidy sum, well after this was over Morrison the officer would take me upstairs to his room to show me his revolver a French one he had just bought. he like myself is a collector of souvenirs & is very interested in such things, after this we all went to the \"Folies Bergeres\" a splendid French theatre & totally different from any other I had seen, By Jove these were 2 fine chaps & I must say that all the Yanks I have come in contact with so \nfor\n far are splendid, & totally different from what ever I expected to find them they'll do me.\n\nThe taxis are very cheap here about the only thing that is, wherever you go there is some one holding out his or her hand for a tip, they get no pay but live on the tips, it is a rotten system I reckon for your hand is always in your pocket & don't the money fly\n\n11th Have been roaming all over the city & the more I see of Paris the more beautiful & stately it appears to get, the Tuileries Gardens are magnificent & what they are like in Summer when all the leaves are on the lovely trees is better imagined than anything else, these Gardens are full of statues & works of art & laid out perfectly, the kings of France used to use these Gardens a lot in the olden days, I have crossed the Seine in dozens of places for it is just one mass of fine bridges, & in many places it is a fair sized river.\n\nThe \"Invalides\" where all the German trophies are shown is well worth a visit, they have Captain Guynerners plane on show here in which he brought down 19 German planes she is only a little thing & the French keep it covered with flowers in honor of one of the greatest aviators who ever lived in here is one of the most beautiful buildings as I have ever seen, it is only a small place but it is\n\nmagnificently built, partly in Roman Gothic & Corinthian Style, & there is the most peculiar light imaginable inside this lovely building is built in the shape of a great dome & the 4 corners are squared off, in the centre of this building there is a great round opening, & at the bottom enclosed in 3 coffins lies the great Napoleon the crypt is built in such a way that who ever looks on his last resting place must bow his head, one could not help wondering what would happen today if the idol of the French Republic could be brought to life & put at the head of the French Army once more, his is easily the finest tomb that I have seen, the greatest man France ever produced as the French say, & they almost worship his name so popular a hero is he in their eyes, & what a General he was, in here also lies the remains of his great Marshals, their names I forget, the corners of this structure were intended for Napoleon brothers whom he made Kings, but so\n\n \n\nfar only 1 of them is resting there. I fancy this place is Frances \"holy or holies\" \n\nfor everyone who goes in there must tread lightly, speak quietly & reverently & remove their hat, as a mark of respect to their idol, the place is not a church it was at one time but it has been disestablished I fancy this place will remain in my memory longer than any other of Paris there are also hundreds of flags hanging about here, these are the trophies of war captured by the French ever since they have been fighting & that is practically ever since they existed, some are that old that they are merely hanging together. We also visited the French Museum of War pictures they are very good.\n\nEveryone has heard of the French people as being polite, & by Jove they are, you could not wish for better & more obliging people & they will go out of their way to put us right, more than once French Officers have crossed the road to enquire if they could do anything to help us when they have seen us standing about\n\narguing the toss as to the way to go. Have been through a lot of them big\n\nshops & they are splendid, but all the same I don't think they are much` more up to date than we are in Sydney in this branch. Their tubes are splendid & wonderful to say I find them even easier to find my way about than those of London. Last night Frank & I went & saw a Grand Opera, \"Rigoletto\" it was in the National Opera & to try & describe their theatre would be foolish, magnificent is no name for it, built in the olden days of the French Monarchy it is a masterpiece. London theatres are book shops compared to this marvellous pile & she is something I shall never forget I wonder if there are any finer theatres in the world than this masterpiece I doubt it for Paris is the home of this sort of thing, although we could not understand a word of the Opera which is of course all singing we thoroughly appreciated it for the music & etc was lovely, & the acting good. \n\nI love strolling about in the Boulevards for they are full of life pretty girls & dresses & if they don't open your eyes well I'll eat my hat I wouldn't have missed seeing Paris for something, walking along the Boulevard you can see the uniform of practically every branch of the allied nations, there, tall & dark Servians & Montenegrins, slim & wicked looked Portuguese, smart & capable English & Colonial officers, tall Americans with their hat something like ours, dark & heavily moustached Italians & still a few Russians are to be seen & of course like London there are thousands of crawling rotten Belgians, I simply hate the sight of them, all they are any good for is to promenade the streets & don't the French people hate them, the old Australian & Canadian are easily the most popular of all the troops in Paris, you can get a kindly glance & smile from almost every Parisian & they will tell you themselves that the Australian & Canadian\n\nare classed amongst the greatest fighters in the world, we have a name sure enough, & may we never do anything to disgrace our splendid reputation, the Yanks think a lot of the Colonials too, they have told us so themselves, & they say that if they can do as well as our chaps have done they will be satisfied & I don't think they can pay us a bigger compliment than that, & they are sincere. Paris is full of them but strange to say in spite of all you read to the contrary in the papers they are not popular with the French I can't understand this but I have spoken to dozens of French of all classes & shades & all are of the one opinion, Angleterre or England they all speak well of for they say she is Frances greatest friend & she will never forsake her \"La vie Angleterre\" as they say, all the one time bitter feeling has practically vanished from both sides & France & England will never fight no more, they all seem sure of that & they are pretty well certain to be right.\n\nHave been out to Eiffel Tower & the big Ferris wheel she is some ride round takes 20 minutes to do the circle I don't know how high she goes, but men below look like ants running about. Tobacco is very scare in Paris nearly all tobacconists have notices in their windows to the effect that they are sold out, & when they get a fresh supply you ought to see the people line up in the street waiting for their turn to buy & how pleased they look when they come tumbling out with a couple of packets of what the French call cigarettes, our fellows would sooner go without than smoke them so you can guess what they are like, if you give a Frenchman an English cigarette 10 to 1 he will put it carefully away so that he can enjoy it on some special occassion, it seems so funny to us seeing great crowds of people of both sexes lined up for tobacco. The train & bus service is very good & wonderfully cheap you can ride for miles & miles for 1½ pence.\n\nTheir gendarine or police are very rough looking compared to the London police & the traffic is not controlled like in London, but they are all very obliging chaps & nothing is a trouble. It seems to be a great fashion among the girls over here to powder up their face until it is as white as snow & then for some unearthly reason darken all round their eyes, I reckon this spoils their otherwise good looks & they are all so neat like a new pin & talk about dress & fashion well here is the place to see it alright, but when all is said & done the English & Australian girls stand out on their own & are incomparable, from what I have seen of this old world, girls in Australia are treated with more courtesy & respect than anywhere else in the world & the average Australian girl thinks most men rude & rough, well she just ought to take a trip over this part of the world & she will go back with changed opinions\n\nThe Zoological Gardens here are about the poorest I have seen for the size of the place, & everything looks so dilapidated & dreary, the reason why is that labour is so scarce & things have to be let slide, they have only a handful of animals, among them being the Kangaroo Tasmanian black opossum rosella parrot white cockatoo & a few more birds, take them all round they are a very poor collection, but the Paris of today is not a patch of pre war days. There has been great rejoicing over the fall of Jerusalem the whole population are as happy as larks, one can easily see that they are much more swayed by their emotions than the hard & cold Britisher it takes quite a lot to stir our blood compared to the French, & the place to see it is in a theatre you would be surprised. The roads & streets here are a pleasure to walk or ride on they are splendid so wide, & level as a billiard table a lot of wooden blocks have been used\n\nThis afternoon I went through 2 of the most modern shops in Paris the Rue Lafayette Galleries & another fashionable shop (Au Printemps) they are simply wonderful inside the floor space is tremendous & all round the shop there are galleries with the different departments & the top or roof of the shop is all glass built like a dome & from the centre of the floor great staircases wind their way upwards & elevators are all over the place, & it is one of the prettiest sights imaginable to stand on the 6 or 7th gallery & look down on the thousands of people & many colored lights below & thousands of flags are flying & hanging everywhere the shops are all being decorated for Xmas from what I saw this afternoon I shall have to change my opinion as regards their shops for I fail to see how they can very well be improved they are absolutely splendid.\n\nAll buildings over here seem to be heated by steam pipes in the winter & I can tell you they make the rooms\n\nlovely so soon as you step inside from the cold night air you can feel the difference right away.\n\nThere is one thing about the French that I admire & that is that they have no such thing as false modesty, for instance the chambermaid will come into your room at any old hour no matter whether you are in bed or not, it makes no difference to her, though I'm afraid we feel a little embarrassed especially if you have just got out of bed & in she pops with a towel or some soap or a cup of chocolate, but she takes no notice just the ordinary common place everyday thing to her, all she cares about is your tip for they are paid no wages whatsoever, & I have an idea that they make a fair screw out of these tips.\n\nAnother remarkable thing about Paris is the almost entire abscence of children, I have scarce seen one in the city though there are plenty on the outskirts, they reckon that nearly \n\nall people come to Paris for amusement so leave what children they may have behind & I think this correct for almost everything here caters for amusement & a good time, oh she's some city this gay Paree & you want rolls of notes to keep going At the present time fruit is frightfully dear mandarins 2 ½ each apples 6 & so on, though of course it is the same everywhere since the war Got introduced this afternoon to a decent but fast young lady & I got her to show me round some of the places I had not seen I told her to go ahead & I would pay for I was out for experience & as much fun as I could get, & By Jove I got it sure enough, what with taxis & such things I will just give you a little account of where we went & what we done, we kicked off with a taxi & went to the highest part of Paris Montmarte from here there is a splendid view of the city & surroundings, back again to the city & to a café for coffee\n\nwhich is indispensable to a Parisian after coffee she must have a \"crème de Menth\" a dark green liquer & very strong. into a taxi again & down to a big shop for gloves & handkerchiefs, which of course I paid for, then she must have some flowers, so over to the flower stand & we come away with a big bunch of violets & carnations, we then decide to go to a Matinee for an hour or so but before going she must have her hair rearranged so to a coiffeur we depart & she gets dolled up, then some more coffee, another liquer, & a box of chocolates & bon bons, in the theatre she gets a trifle sick through eating so many chocolates so we call the waiter over & send him for some pastilles to take the taste away, & also for some wine for she must have something to drink & so on through the day, she showed me round sure enough, after dinner which cost a pretty penny we went to the fashionable theatre Casino de Paris, I had booked\n\nOrchestrea stall seats during the afternoon, & I shall never forget this performance the dresses were magnificent & there were over 300 of the prettiest girls in Paris & London performing there, it was principally all dancing & so on, the theatre itself was a revelation, I'm satisfied we don't know much about such things neither in England nor Australia compared to Paris, In fact I'm just beginning to realize I'm alive & kicking I had only one difficulty with the girl in the theatre, like all French girls she was passionate & wanted to put her arm round my neck & kiss me in front of all the people she could not understand why it was that I would not let her for all around the French people were doing it & nobody takes any notice but we English have never been used to that sort of thing & it was abhorrent to me so I would have none of it, she was a beautiful girl & no mistake as most of these Parisians are, but when all is said & done give me our\n\nown girls, they may not be so chic & smart, but there is something about them, which puts our girls in a class on their own, & to me they will always be incomparable, they have a certain proud manner & carry themselves so well as if they realize they are the finest women in the world, would you believe it but English people you can pick out in the streets by their bearing, looks, & manner of dressing & there are any amount of them in this marvellous city of pleasure, but I am getting away from the girl she behaved herself after I gave her a \"talking to\" & bought her another box of bon bons & a liquer, the performance scenery, dresses singing dancing & so on was splendid, & the enthusiasm was boundless when twenty odd English girls came on the stage dressed as English officers, & sang the telephone song \"Hullo my dear\" it even made my cold blood run hot for it is then that we realize \n\nwhat a nation England is & what they & the nations think of us, & we realize how practically the whole world is leaning on old England & looking to her for lead at any rate I shall never forget the applause with which this little item was greeted, it practically brought the house down, & some of the French people nearly went frantic on several occasions when English items were on, especially when in one scene on a great lattice work the girls formed a beautiful Union Jack, there was a great outburst & the whole theatre rose like one man & sang Rule Brittania & God Save the King, & the curtain went down amidst an almost indescribable scene of enthusiasm & cheering. I can tell you my chest swelled out for I felt proud of being English or British for it is all the same.\n\nGaby Deslys the world famous dancer was performing here, also Harry Pilcer the crack American, & what a pair they were I could watch them all night\n\nThe music was lovely so soft & sweet & I enjoyed this theatre the best of any I have ever seen in my life, after this we had supper & by a streak of good luck we got a taxi for they are very scarce at night time & so I run her home & then back to my lodgings, she was a costly girl to me but the experience was invaluable who ever reads this at home will think I am a funny sort of fellow I suppose & I guess they are right, there is a big difference in the Archie of old who in 1914 was almost too shy to kiss his sister, and the same ruffian of today, knocking about the world has worked wonders, whither for the best or not I should not like to say, that will be for other people to judge, but this is certain I look upon life in an entirely different manner to what I used to at one time long long ago. \n\nI found it far less expensive if you are taking a girl out to let her do all the paying & give the tips, it is dead funny when you hand the girl the money & watch the face of the cabby or waiter or\n\nwhoever he may be when she pays him, he will hand the change back to you so as you can tip him, but you make him give it to the girl, she will then just give him the bare tip & no more, & he will look as black as thunder & shake his head. I used to nearly die laughing every time to watch the manouvering of the waiter so as he could get the tip from the stranger & then watch his expression when the girl hands him a few coppers where we would otherwise give him francs.\n\nDuring the afternoon we also visited Versailles travelled out 1st class by train which takes about 20 minutes, it is only a short walk from the station, we engaged the usual guide who hangs round these places I don't care much for them myself too much of the parrot like chatter & this one who could speak English was no exception to the rule, he showed us round all the ancient old places both inside & out, the Grand chambers where the old Kings & Queens of France used to sleep were very interesting\n\n& the furniture & etc were magnificent, also saw the old Chamber of Deputies where once every 7 years the President of France is elected the Gardens fountains, lakes, walkes statues & etc are simply splendid but it would take days & days to go over it all, we spent a couple of hours there only, just a hurried look round most of the principal places for one has not too much time, & then down to the town for some lunch & after that back to Paris.\n\nUnlike London, Paris at night time is a blaze of light & splendour they don't seem to trouble about the Zepps & planes one little bit, & it makes the city seem ever so much better & it looks beautiful at night with its many colored lights & crowded streets for Paris does not wake up till about 10 oclock, she is some city from then on till 12 or 1 in the morning London & for that matter all British towns have Paris skinned as regards sanitation we are far & away ahead of them, & there is room for great improvement in this line, especially where their latrines are \n\nThose stains are iodine which the orderly has just accidently spilled while dressing my wrists.\n\nconcerned, they are very poor.\n\nThe last day I was there Len came & saw me, I was in bed, never used to get up till 11 oclock, oh I can tell you we make the most of our opportunities when we get them & what a change it is to lay back & ring the bell & wait for the maid to bring your breakfast up or early in the morning a cup of coffee tea or chocolate & a roll of bread & butter nice & hot, & the rooms themselves are lovely I had a golden room, everything in it was of that color, clothes, curtains, walls, plush covered chairs, & settees bed curtain splendid pile carpets on the floor, & all modern conveniences such as hot & cold water, baths, steam heated room, life size mirrors, side tables, flowers, 3 different colored mantles for the electric light, blue golden, & rose, electric buttons at your head & many other little things, the room used to cost me 7 francs a day, the same room in Blighty would not be got under 15\/- everything here is built for beauty & comfort.\n\nAfter dinner Len McKeown, Frank & I went & had some dinner, & after we went down to the jewellers in the Boulevard de Sebastopol & got my watch which was being repaired, from here we all went to the Casino de Paris to book seats for I wanted them to see this performance at all costs, when we got there, there was a frightful crush all on the same job booking seats.\n\nAs we were leaving here it started to snow lightly & when I left Paris that same night it was snowing heavily & quite 4 inches were laying on the ground. I would have liked to have stopped that night for it would have been very pretty next day but my leave was up & I had had a splendid time so I thought it best to get back & not spoil things, so at 7.20 that night I said goodbye to gay Paree & the finest holiday I have ever had & the biggest eyeopener of my life, I will never regret as long as I live the money I spent here for I had the full worth of it many times over.\n\n17th. Travelled all night long in freezing carriages & crowded. I slept on the rack as one could get a stretch there, it was still snowing when we reached Bologne & we hopped off here & went across, Tom Flattley & I & had some breakfast & then we walked down to another station & caught the Northbound train for soldiers, & she was a cold ride in cattle trucks to Hazelbrouch where we got off again & caught a train going to Baileul where they reckoned we would find our units, Tom & I pooled our cash & had some tea before setting out on our hunt, oh its nice coming home from your leave, you don't give a cuss how things go & you are fed up with everything\n\n18th After a long hunt I found the Battn last night, they having moved from down below, & I can tell you I was pleased to catch them up, & soon I was sitting beside a roaring fire having a good feed & relating some of my Paris experiences to the boys & it was quite late when we went to bed\n\nThis morning I went to the Dr about my scabies\" for I have had no sleep for the last 2 nights they itch something dreadful when you get warm, he marked me Hospital straight & told me to hold myself in readiness to move perhaps today. The weather is very cold now an iron bound frost having settled on the land & mud is a thing of the past\n\n19th Went away this morning in a car Freddie Turner & Mr Hamilton also have been evacuated, a lot of the lads laughed when they heard I was going to Hospital for they all thought I had something else which men going on leave often come back with (veneral) but they are sadly mistaken, not this child. We only went about 4 kilos & they dropped the \"scabies\" at the 1st Field Ambulance & they are treating us here, the treatment consists of hot baths & tons of sulphur ointment & iodine, clean clothes, they take all our old clothes away & fumigate them thoroughly, we have nothing to do only lay down in our beds, we\n\nhave 4 to 5 blankets a man & its not too much for this freezing weather, there are about 40 patients in the ward I am in & we sleep on stretchers.\n\n20th Nothing to report only the usual treatment & the Dr inspection, & the arrival & departure of a few more patients.\n\n21st. The old frost still holds with iron hands on the land, ice is 12 inches thick & the whole countryside has the appearance of being under a heavy fall of snow, a thick haze hangs over all & the cold is intense, chills right to the marrow bones. Food is not too plentiful but we just about get enough for breakfast, we have a bowl of tea, porridge, 2 small slices of bread, & a little slice of bacon or ham, for dinner we have a bowl of tea & plate of stew or currie, & a couple of slices of bread, tea consists of the usual bowl of tea 2 slices of bread sometimes meat, & a little jam & cheese, & for supper we have biscuits & cocoa, rice is served every other night for tea, so you can see we don't live like fighting cocks but the food is plain & well cooked\n\nI am trying to do a little writing but the cold is not favourable for much of this sort of thing, my feet are my main trouble trying to keep them warm.\n\nDown in Paris it is very funny if you happen to go into a flash restaurant on your own you will be sitting down at a little table by yourself when in will come a flash & beautiful girl & plump herself down right opposite, you will look her steadily up & down & wonder what on earth she is up to, the best way I find is to touch her feet with your boots & then say in an apologetic tone & as if you were really sorry \"pardon Madamoiselle\", if she is what you think she is & a mistake is seldom made, she will say 10 to 1 (San farian) I don't know how it is spelt in French but this is the pronunciation of it & it means it \"doesn't matter\" or anything to that effect.\n\nThe English papers let themselves in nicely over this Cambrai affair, when the success was reported almost all the papers made a mouthful of it \n\n& they repeated it over & over again that this stunt was carried out solely by Imperial troops & no Colonials whatever were engaged in it, this was about the only stunt that Colonials have not \nhave\n had a hand in, & what a gutser the Imperial troops came in the end, it has turned out a dismal failure about the worst defeat in one way that has happened to Britain in this war & thank heaven no Colonials were in it, though a lot of Australian artillery have been taken down there in the last few weeks, I guess the London papers are rather sorry they spoke so hastily, for it has only improved the Colonials prestige.\n\n22nd. Temperature is rather milder today which is very welcome after the perishing cold of the last few days.\n\nHave been utilising my time by writing & have been getting off some back correspondence. Saw a fight this morning 2 of the AMC. chaps had a row & they settled it in good old British style.\n\n23rd. Discharged as cured this morning from 1st Field Ambulance rather too rapid I think to be permanent, & I'm certain that they will break out again After leaving I walked about 4 kilos to our Camp & wasn't it cold, but I soon warmed up once I got going, the trees looked very pretty loaded as they were with the white hoar frost, looked more like as if there had been a heavy fall of snow than anything else, only the hard & dry appearance of the road & ground exploded that idea, for everything was frozen as hard as steel.\n\nThere was a little incident that happened in Paris that I had forgot all about & I think it is worth mentioning, it concerned both Frank & I, we were returning from the Opera & it was about 12 oclock previous to this Frank had complained about feeling sick & dizzy while in the theatre but he reckoned on coming out into the cold night air that he felt better so we took a tube all went well till we got right to the Place de la Republicque\n\nwhere we were getting out, & just as the tube pulled up with a rush Frank fainted & went right out to it, you can just guess the excitement & confusion that followed, there was I alone among all these French people with a dead man on my hands, a gendarmie & I carried him out on to the platform followed by the usual inquisitive crowd of women & we laid him on the seat & loosened all his clothes while the women poked their smelling salts under his nose to bring him round & fanned him with their hankerchiefs & fans, I must say they were very good & kind & done their best to help me and him. While all this was going on, I asked in a loud voice if there were anyone present who could speak English & a young chap came forward & said he could speak a little, so I said for Heavens sake give us a hand to get Frank up on top so he did, about a dozen helped to carry him up the steps & we took him over to one of the seats in the square & Frank soon came round, we then thanked\n\nthose who had helped us & we walked to our hotel which was quite close, next day Frank went to the Dr & he wanted to send him to Hospital but he actually refused to go wish I had been in his shoes, would have meant an extension of leave after coming out, however he was alright in a couple of days, a slight attack of trench fever I fancy.\n\n24th. Big guns have going through pretty constantly last night drawn by monstrous \"caterpillars\", and they were travelling very fast, we are preparing all along the line for possible German attacks which are bound to come, for they will do their utmost to crush either Britain or France before America is ready which wont be before the Spring for a cert, as far as we are concerned let them come & we will welcome them & they will have a little of what we have been going through for the last year or so. Great rumours have been flying round about the Conscription voting the latest is that the No's are 200,000 in the lead\n\n \n\nin Australia, if this is true it is not much encouragement to us who are soldiering over here, for it practically means that the people of Australia are not behind us & this is not very nice to know, & if Conscription don't pass I'm thinking that the average of the Australian Army will fall considerably for no one will have much \"guts\" as we call it to take much of an interest any further in the fighting, & can you wonder at it, if you could only see the class of men who voted No over here, nearly all Catholics I.W.W.s Socialists & etc, & all the muck & rubbish in the Army, makes one mad when we think of it, & I suppose it's the same in Australia, for the Irish element is very strong & we know what a down they have on the English. Billy Hughes made the greatest mistake in his political career when he let the people of Australia decide the Conscription affair by a Referendum instead of passing it through the House straight away like America did & no more about it, as it is now he has put his foot in a hole properly\n\nHeavens how miserable & rotten & ashamed I feel of my country & I was always so proud of Australia & all she has done in this war now our name is mud, & we all feel as how we can scarce look any one of the other colonies in the face, oh how I wish that we could lay our hands on the B--------- swine it would be some consolation to punch their lousy heads to a pulp, & then jump their guts out for them, I would do it with pleasure myself. Australia can't be much of a place to live in at the present time, its pretty evident that all the best have gone from our one time beautiful land, & oh how proud we all were of her, & we used to hold our head so high & look the whole world in the face, now its all a thing of the past, seems like a bad dream to me for we can't accept the facts of the Australian people turning us down so badly, it is as much as to say, serve you right for going away & good enough for you if you get killed\n\nyou have no idea how it hurts us, hits in a tender place, at least we used to think if nothing else Australia will appreciate our services, but no just the opposite it seems. I thought the women would have carried it through but we seem to be entirely forgotten \"out of sight out of mind\" I expect is the case with all except a few who will always remain true & faithful if it wasn't for these life would not be worth living, unless things alter considerably Australia will be no place for me after this war if I am spared to live through it all, I can see myself hitting out for some other land, for I would never live among such mongrels as there seems to be at the present time in Australia. Thank God I am single & have no encumberances & there is only one person outside my own family that draws me like a magnet & it is for her sake & strange to say whom I have never seen that I still continue to box on hoping against hope that one day I will have the good fortune to meet her, & thank her for the splendid letters so cheery & bright that she has \n\nwritten to me, many & many a time when I have felt lonely & miserable I have pulled her letters out & read & reread them. & I have always felt better for it, we have been corresponding regularly for over 2 years & we seem to know one another so well, & I daresay we are both wondering what will be the end of it all, but not a word has passed between either of us that you could take a line from, but underlying it all there is a certain strain & I fancy we can both read between the lines at any rate if it wasn't for her & my people Australia wouldn't trouble me any more under the present conditions prevailing there, her name I wont mention, as I don't want people to know of it.\n\nAccording to report the 4th Division were the only ones who voted solidly for Conscription, & they are now going to break them up & send them to reinforce the 3rd Division & the 5th are coming to us, I reckon the 3rd Div. should be the first to be broke up for they are junior both in formation &\n\nservice & they are a flash lot, I can see some rows when the 4th get among them this will be the ruination of the Australian Force for it is going to destroy all \"esprit de corps\" & this is a great thing in an Army & also all promotions will be knocked in the head for all Battalions will be overrun with N.C.O.s & officers, nice state of affairs, & I feel sorry for the 4th & 5th Div.\n\nWe had a visit this evening from the Royal Warwickshire Fife & Drum Band & by Jove they were something lovely to listen to a bit different to most of the rag time bands we hear, they must have been playing together ever since war broke out for they were almost perfect especially the side drummers, & the whole show were well turned out & looked fine. We (the Sgts) have 7 fowls for tomorrows dinner paid","44":" per pair for them & only ordinary fowls at that, we plucked them this evening & our cooks are going to fix them up for us tomorrow.\n\nTook over Battalion Orderly Sgt this evening\n\nThe Y.M C A. are giving to every member of our Forces a nice little pocket book it will come in very handy.\n\n25th. Xmas Day & true to its traditions it has been snowing, but only slightly. We expected to be called out last night, had orders to be ready to move off at half an hours notice, they were expecting the Germans to attack but happily nothing came of it. A lot of the lads were very merry last night & I being B.O.S. was called out at 10.45. to go round & quieten them a little, B. Coys Orderly room were the worst offenders closely followed by our officers, & C.Coy. machine gunners, our little crowd were quiet for once in a while, & Jack Hayes & I played Jock & Depina \"bridge\", we beat them by nearly 1400 points had a rare run of luck.\n\nC.Coy had to find 2 working parties to move off early this morning bit stiff but the war can't stop just for Xmas.\n\nOur little bunch (Sgts) have started the penalty list for swearing again, costs a penny for each word, & we all have quite a number up already, & today seeing as how we are all broke or badly bent, we have suspended the penalty for today & of all days too, so we can give vent to our feelings & carry on as we like for once in a while.\n\n26th. What a Xmas we have had I enjoyed it the best of any ever since I can remember things went off rather quietly till after we finished our dinner which was about 7 oclock, we had fowls, roast potatoes & green peas, & for sweets stewed figs & custard & plenty of canned fruit & a few other little trifles, altogether a very nice little dinner, most of the lads had sobered down by dinner time for most of the day had been spent in paying visits to old cobbers & etc. & of course this meant the production of the whisky or rum bottle to drink one anothers health & it took most of the afternoon to sleep it off, so\n\nby the time 7 oclock came round most of them had suffered a recovery & for the rest of the night we sat round a brazier with a nice fire burning, we had quite a merry little crowd, including our visitors, these were some of those present Captain Edgely & Witby, Lieut Beckett & Wilkinson, Regimental Sergeant Major Gould, Drum Major Downes, Sergt Major Graham, Quarter Master Sergt Connellan, Turner, & Hayes Sgts Howard Price, Depina, McNabb, Mackie & Langford Cpls. Andrews, Fordes Harris, Brown, Frost & our Company cook Digby, needless to say there were plenty more hanging round for what they could get, & I might say there was no shortage of grog the Battn had been saving the rum up & it was issued along with some \"bucksheesh\" beer to the boys the whole Battn were drunk practically the whole day, old Drummie went off early in the night & we blackened his face with a burnt cork & spilled candle grease over his hair, what \n\nfright he looked & Price & I took him home early in the night, then George Gould went mad & started shotting things about first the candles went sky high then the rum jars followed & afterwards he made a flying leap at the brazier & sent the fire flying, after this we forcibly ejected George & he was sent along to one of the other Coys.\n\nNext item was a fight between Connellan & White they were both too drunk to hurt one another & it was the fun of the world however after an exciting 5 minutes they parted best of friends, then Capt Edgely started making rum punches & cocktails, he used cinnamon & lemon & etc & the boys all voted them tip-top, he's not a bad old Sport is Edgely, then the singing started we sung practically everything we ever knew & then old Digger gave a fine dramatic display laugh I nearly died, & to crown all I actually smoked 2 cigars the first I had ever smoked in my life \n\nPrice gave them to me, I can see I am gradually slipping but I have full control of myself & know what I'm doing during the evening a little Tommy came in, & he caused some fine fun after he had sunk a cocktail or two we christened him George Robey & had him singing & arguing the toss about the war for an hour or so, he & Digger had the mob in hysterics the evening ended up by all joining hands & singing Auld Lang Syne & \"he's a jolly good fellow\" the officers left us about 11 oclock having spent more time with us than in their own mess to finish the evening up we turned out & had a good old snow fight at midnight & so ended our Xmas fun & a bonzer time we had. Plenty of snow on the ground this morning & nothing but snow fights wherever you went, some of our lads pelted the life out of a Tommy officer & he came over & made a complaint about it, reckoned even if they\n\nwere Australians they should show more respect to an officer & not pelt him, what do you think of that how we all laughed over it, they don't understand our lads, you should see our officers they bog in with any of the boys & have a bit of fun.\n\nThis afternoon 4 officers & 4 NCOs had to go to the firing line to have a look at what we will be taking over & mostly it was a long walk up & everything is frozen hard & white as snow, a few shells fell unpleasantly close on the way up but we reached \"Rose Wood\" safely about sundown, we then had a drink of tea & afterwards inspected our dugouts & strong points, just before we left the Germans started to sling gas shells over in dozens & we had to put our helmets on & walk in them for a full mile during which time I managed to get a nasty whiff of gas & fell in a new shell hole which they had dropped on the train line. \n\nLen came back tonight he & McKeown had been kept down in the Reinforcement Camp at Carstrae.\n\n27th. Howard & I took 90 men out this morning on fatigue, had to march for about 3 miles along a hard white frozen road & busters were very plentiful & oh the language you should have heard it. Our work was shovelling metal into motor lorries & spreading it thinly on the road so as the traffic can get a holt we finished about 2.30 & had a ride home in the motors.\n\nThe O.C. run a few men up this afternoon for being unable to produce their \"emergency rations\" most of them got a small fine & a few days C.B. Things are very quiet in our little hut tonight most of the boys have gone to see the \"Kookooburras\", a little show run by the Australians. \n\nHave been feeling very restless & miserable lately & don't seem to care a hang what happens, the war is getting on our nerves I suppose\n\nI can't settle down to read or even write like I used to be able at one time just at present I have a severe attack of homesickness, but whats the use of that in the military, all the longing you might have in the world is of no avail, so you just have to grin & bear it, if I were only free I should pack up & get for my life back once again to the Sunny South if only for a few days, I'm certain that would be a certain & rapid cure for our restlessness, & all the boys are feeling the same way, we almost have to force ourselves to write now, & everything military is getting hateful to us all, people in Australia or England don't long for this war to finish any more than we do I'll bet, & as the days go past we hate it more & more.\n\n28th. Had a day off today & Jock & Depina took the fatigue party out, Hayes & I went over to the wood to see if we could shoot\n\na pheasant or hare there are a few about here & we get one now & again with the rifle.\n\nLindsay Graham & Capt Witby went to the Army School today.\n\n29th. Fatigue as per usual & a nice distance we had to walk took us an hour & a half to get to our job which was cleaning up an old road on Messines Ridge, & wasn't it hard for it was frozen like steel & the weather was icy cold we were all practically knocked out by the time we lobbed home again I cut my finger badly on this job with a piece of barb-wire & it bled very freely, on our way home a Gotha nearly sat on top of us so low did he come must have lost his way for there was a heavy mist hanging about he was too low for the guns to shoot at, but the machine gunners gave him a lively time, but in spite of it all he got safely away\n\n30th. Had to go to the Medical room this morning to get my arms dressed for they are very sore, breaking out all over, a sure sign I am getting run down in health & want a change. Depina left here early this morning to go to England to the Training Battn still very cold & plenty of snow hanging about & the land is held in a grip of iron.\n\nJock Mackie went on Paris leave yesterday struck it at a good time we have only 2 Sgts left in our Coy now McNabb & I, & McNabb has never been in the trenches yet so I can see plenty of work falling on my shoulders\n\nSunday & pay day the best day of the lot for the boys. Was to go on Quarter Guard but am exempt on account of my arms which are painful & sore.\n\n31st. Moved out from \"Rossignol Camp\" this afternoon for the firing line, & after wandering about for nearly 4 \n\nhours during which time I in common with many others \"looped the loop\" times out of number & what language was used you should have heard it, we are now camped in \"Rose Wood\" my platoon are in a strong little \"strong point\" quite close to Hqrs.\n\nMy finger is very sore & I have a great trouble to write at all so for a time entries will be short & brief.\n\n1st. New Years Day came in very quiet, scarce a shot being exchanged on either side, this front seems to be very quiet at present hope it remains so. New Years night I spent with a party of men digging & building a \"strong post\" we are putting a lot of these up in case the old Hun makes an attack he will get a warm reception I'll bet. \n\nFatty Gilll & I were nearly grabbing a Tommy officer while on this job. I noticed this chap strolling about asking questions & etc & my curiosity & suspicions were aroused, so I followed him about, he had a funny\n\naccent & on his shoulder he had only 1 star, I asked one of the 21st Machine Gun Coy if he knew anything about him & he said he had been around for the last 2 or 3 days & he thought he was an O P. officer, so I thought this good enough, but afterwards I felt sorry I had not grabbed him for now I feel sure he was a German it is a very easy thing to get through the outpost & picquet line as they are at present.\n\n2nd. Started to thaw a little today & a shower of rain fell making things very unpleasant.\n\nFritzie has been putting a lot of gas shells & 5.9s over this morning but he has hurt nothing so far. \n\nThe boys are all heartily cursing the soap & powder racket for the feet, also the sock returns.\n\n3rd Things are very quiet this morning it has frozen hard again & the sun is shining brightly but of course there is no warmth in her.\n\nReceived 2 parcels last night \n\nfrom home the first for a long time. our Xmas Mail should be here any day now its all behind somehow.\n\n4th. Capt Edgely had the mob out wiring round my \"strong post\" last night batmen, Company Clerk & all were out & didn't they like it, bit of a change for them I believe it was very funny to see the way they ducked when old Fritz swung his gun across the open ground searching for any stray fatique parties who may be unlucky enough to get in his way, if he only knew how close he comes to our dugouts he would keep his gun going I'll bet, sometimes he plonks bullets in our doorway.\n\nThe stretcher bearers & I had a narrow escape this afternoon old Fritz shelled our possies heavily for ½ an hour or so & he dropped 1 5.9 not more than 3 yards from our dugout, gave us all a proper headache from the concussion.\n\nThis soap & powder for the men's feet is a regular farce, they are supposed to wash their feet & powder them twice\n\na day, they get the ingredients all right but instead of putting it on their feet they throw it away & really I don't blame them this cold frosty weather, I wouldn't do it myself I know I cant see where the benifit comes in for like the whale oil of last year it only softens the feet.\n\nGreat bombing activity last night both German & British planes were on the game, you could hear the hum all night long, & searchlights were pointing practically everywhere\n\nSome of our officers get on my nerves they are drunk half their time & on the Army rum at that, that is one of the reasons why I am so predjuiced against issuing rum, if I had my way no spirits should be allowed in the \"forward area\", officers especially should have their wits about them for they have the lives of so many men in their hands, & especially at this time when we have so many new men in our Companys.\n\nBread issue has been very light of late for some reason or other, had 13 to a loaf this morning.\n\n5th Very cold & raw today looks like a thaw setting in.\n\nThe Tommies on our left were to have made a raid last night but they came a gutser, never got past their own wire I believe\n\nOur Heavy Trench Mortars are putting some stands down for their heavy great torpedoes, \"flying pigs\" we call them, they weigh 190 lbs & have a range of 1200 yards, they are about the last thing for frightfulness as far as explosives go I have seen these monsters dig craters 30ft in diameter & 15ft deep, Heaven help anyone who gets close to these murderous things they are going to try & blow a pair of powerfully built German pillboxes up in a few days the \"twins\" they are called, & so strong are they that they withstood\n\nfor a whole day an 8 in. bombardment, but the \"flying pigs\" will test them, its not very nice to be camped near these mortars for the Huns do their utmost to blow them out & the infantry cop it\n\n6th. Last night Howard Jimmy Lynch & I had to go to the front line to have a look at things before taking over, what we are holding is simply a string of \"outposts\" connected by visiting patrols we have 4 of these outposts on our front which is roughly 800 yds in length, our left flank rests on the ruins of Hollebeke & here we join the Tommies (Bedfordshires) the surrounding country is very flat but what high ground there is we hold, all the country is swept by machine gun fire & we had some very close shaves last night Lynch was hit by a bullet in his respirator knocked Jim over but luckily he wasn't wounded, if ever they attack us here the men who are\n\nunfortunate enough to be in the \"outposts\" are a goner for a certainty for the piquet line could give very little assistance, by day these posts retire to dugouts & pill boxes leaving only a man here & there to watch the front, at the present time with the exception of patrols the front is very quiet but you never know when it is going to flare up again. I think the ground is too hard & slippery just yet for any heavy fighting these pill boxes old Fritz builds come in very handy for us as we go forward for they take a lot of blowing out. \n\nBy the time we got home we had done enough physical jerks to do us for a week or so, especially on the hands down, & I might say it was not done to the count of 3 when old Fritz sends his bullets whistling past your ears, cracking like a horsewhip one second we would all be walking along as bold as brass, there would be a crack & you wouldn't see a\n\n \n\nsingle soul every man would be hugging the snow as close as he could with the bullets sizzling & cracking over your heads or cutting the ground up in front or all round you, puts a nasty taste in your mouth but when all is said & done you have to laugh when you think of it, we had a good look at our front & got home at 5 in the morning.\n\nGot a few chocolates from the Comforts Funds this morning.\n\n7th. A big thaw seems to have set in this morning, for it is very muddy & fresh outside & the ice is melting fast not too promising for our trip in the line.\n\nA small mail came in last night I got 3 letters out of it.\n\n8th. Left \"Rose Wood\" early this morning for the line, had breakfast at 3.30 & moved out just as the late moon was rising & wasn't it cold, we had no trouble relieving for all \"posts\" were told off & they\n\nhad simply to be guided to their positions & they were set, we just got nicely settled down by day break. I was in the \"Elephant\" with my party a great big old pill-box, & she was very dirty & stuffy inside, we had to lay low all day long for we are under direct observation & if they saw us moving they would blow us out, it is the same with all the \"posts\" both sides alike in this open warfare have to keep out of sight during the day \n\nOur front extends for 800 yards & on this we have 4 strong posts. 2.0.11 3.0.11 4.0.11 & 5.0.11 behind these again we have what is called thepiquet line, these number the opposite way 11.0.5 11.0.2 & 11.0.1, the garrison of the strong posts are 1 Lewis Gun & 10 other ranks, Len had 5.0.11 & this post had to be held at all costs if attacked, not a very nice situation to be in, the whole of the front is wired but only\n\nthinly, they are getting a good belt out by degrees, you can see from this how thinly our front is held, & the Hun is something the same, I had the nice little job of working the \"fighting patrol\" this consisted of 9 men & myself & we had to patrol \"no mans land\" looking for stouch, luckily we found nothing tonight, though if we had followed the plans that Capt Edgely planned out at first there would have been some fun & bullets flying, he had the crazy idea of going out with Hales rifle grenades & a Lewis Gun, he intended to shoot the grenades into their strongposts & then turn the gun on them, the maddest thing I ever heard of what gutsers we would have come he would have chopped the legs from under us for the place simply stinks with machine guns, he & Kelleway were going out at first, I nearly died laughing to see the look on poor Kelleways face when Edgely was planning his scheme Charlie is no hero, & makes no bones\n\nabout it either, he regards Edgely as a madman & I fancy the majority of the Coy have the same opinion, he's what you would call a military maniac therefore he's a nuisance to the troops, at any rate I pointed out the utter madness of the whole concern & he ended up by calling it off & squibbing it himself, sent Kelleway out to see what was going on, we found nothing after being out for a couple of hours & getting nearly frozen to death for the ground was snow white & frozen hard.\n\n9th. We get our 3 meals daily they are brought up each night 7.12 & 4 oclock, & there is plenty of it. \n\nHas been snowing heavily all day long the whole country is covered with a snow white mantle.\n\nThere were 2 raids carried out last night one on our left & the other on the right, I hear they were both successful, & kid there wasn't no machine gun fire, the air \n\nwas simply screaming with them & you had to be careful, old Fritz made the night like day with his S.O.S. & flares he keeps on putting them up all night\n","45":" We were relieved last night by D Coy. & luckily we got out without a casualty & there was plenty of bucksheesh flying about.\n\nGeneral Birdwood & his Staff have been round our dugouts this afternoon the (\"ravine\") we have all great underground tunnels & dugouts here & are quite comfortable, a fellow can tip a raid or something when you see the heads hanging round.\n\nGreat rumours of peace are flying about wish they would settle it quick & lively, but I can't see how it will end before Xmas Just close here the Germans had a steel tree which they used to use for observation before they were driven back it is cleverly built & you would take it for an ordinary tree it is copied so true. The Tommies caught a sniper out in front of Len's post last night, he was a Jaegar\n\nThe snow has melted again & things are very very sloppy.\n\nBlue Dimock & Jock Mackie came back yesterday, Jock from Paris, Blue from Hospital\n\n10th. Slept nearly all day in our deep tunnels for we were very tired.\n\nThe old \"Flying pig\" scored a couple of good hits today on Fritzies pillboxes sent them skyhigh, when she hits something has got to go for 56 lbs of ammonal will shift some muck. From our observation post you can see several villages quite plainly in front of us Comines is one of them & she gets shelled pretty heavily by our chaps, at night you can hear his trains coming in & out quite plain for some reason or other we don't shell them either.\n","46":" Started to rain again today & things are fairly rotten.\n\nD Coy had a few casualities last night mostly shell fire.\n\nCapt Edgely had Sgt McNabb up today for cowardice, it appears \n\nhe was sent on liason patrol, or otherwise a connecting patrol, a mere nothing, but he squibbed it, & went back & reported all correct, his officer had his suspicions so he questioned him & eventually put him under arrest he got a severe reprimand & a great lecture. He won't last long his platoon have no time for him, & once that happens good-bye, it was his first time in the line & he made a sorry mess of it. \n","47":" Up to the line again tonight or rather early this morning, we rose at 3 oclock had breakfast & moved off at 4 we reached the line in no time & took over, things were very quiet coming in scarce a shot being fired by Fritz, I had charge of the \"fighting patrol\" again & Jimmy Lynch was with me, but we done nothing the first night, too wet & dark.\n","48":" Very quiet scarce a shot fired wonder what old Fritz is up to, I expect a new mob is in.\n\nthey are generally quiet for a while till they get the hang of things. \n\nWe put another little \"barrage\" into \"no mans land\" with the idea of clearing a few machine guns out of her, there are one or two nasty ones which play over us at times, one of them the lads reckon plays \"the watch on the Rhine\" its funny but gunners seem to get a tune out of them, often you would swear they signalling in \"Morse Code\"\n\nThe old \"flying pig\" knocked a big pill box rotten split her fair in half & knocked the end out of another, they are the lads for this sort of work, better than guns, but they are dangerous to work, the gunners load them by slipping the great torpedo down a steel tube & then attach a piece of fuze light it & run for their life they get a safe distance 50 to 70 yds & there is a terrific bang & a great tongue of flame shoots into the air & away hops the \"pig\", if the \n\n \n\ngunners stood close to her when they fired her they would be killed by the concussion which is very great. \n\nWas out on patrol again tonight with Kelleway & Traill, had to go out & nose round an old pill box which looked suspicious they thought the Hun had a machine gun in there but luckily he didn't, the ground was very slippery & hard as steel.\n\n14th. Had to go & take over 5.O.11 after finishing my patrol & I put in a very cold night waiting for the Boche just before we were relieved it started to snow & soon the ground was as white as a sheet & all tracks were covered, I had to take my party out & use my judgement for direction I got out alright but you wouldn't believe how easy it is to get lost when the snow is on the ground & you are on flat country, some of our chaps are always getting bushed, & have almost walked into Fritzs hands. \n\nThe Dr. has condemned C & D Coy.\n\nfor working purposes, he reckons the men are too weak & their feet are giving & he is quite right, they are not treating us right, we have to do an extra 8 days now, this will mean 24 days in the line, too much altogether for the winter & we are holding such a big stretch of the line, & a most important part at that.\n\nOld Heine don't get a look in with his planes round here, our chaps take good care of that, if he makes an appearance they are after him like a flock of hawks, & all night long you can hear our planes going back & forth carting bombs over, occasionally you can hear them dropping.\n\nA big German dump was blown up last night back of Comines.\n\n15th. Miserable outside today for a thin drizzling rain is falling & the country looks so desolate & barren. We had a great discussion this morning as to the best things we have seen in our Travels & you would\n\nbe surprised to see how closely the majority opinions were, these were my opinions the best 3 bridges I place the \"Forth\" \"KasrerNil\" & the Hawkesbury in that order, the best street, Princes St in (Edinburgh), best monument Sir Walter Scotts or De Lesseps, Harbours (Sydney & Hobart), both out on their own so far theatres, Opera House (Paris, Picture palace Gaumont (Paris) music Hall \"Folies Bergeres & Casino de Paris, (Paris) Hotels Shepherd, Continental & Palace Hotel (Cairo) most imposing building, Parliament House (London) most beautiful Catherdal Salisbury (England) or Amiens (France) finest interior \"Notre Dame\" (Paris) 2 finest railway stations (Sydney) & Waverley (Edinburgh) Post Office (Sydney) fresh water river \"Derwent\" tramway system Glasgow & Sydney. Docks (Liverpool) Museum (Edinburgh) Acadamy (Rouen) finest city (Paris) prettiest girls (Australia & England) shops (Paris) Sunsets (Gallopoli) & (Tasmania) Mountains, Alps & Mt Wellington\n\nfinest ship \"Brittanic\" since been sunk. Bank, Credit Lyonnais (Paris) best controlled traffic (London) most miserable day","49":" or one day in January at Guedecourt 1917) best dressed women & girls (Paris) busiest streets Strand & Picadilly (London) agricultural methods Australia) best castle Edinburgh Castle) (Edinburgh) finest tomb Pyramids (Egypt) or \"Napoleons tomb\" (Paris) best taxis, (Sydney & London) bet buses, (London), biggest breakwater Colombo & Alexandria, restaurants (Paris) roses & other flowers England & Tasmania) rottenest hole in the world Belgium & France in winter, one & all are of the same opinion as regards this I could go on for ages at this sort of thing, they are my opinions which I have formed since leaving Australia & I am satisfied without being in the slightest way predjuiced that Australia stands alone in this world her climatic conditions in itself entitles her to that position \n\nwithout any of the other natural advantages she possesses, if people only knew over here what she is really like we would be swamped out.\n\n16th. Rained heavily all day yesterday & most of the night, & things are in a pretty state rivers of water wherever you look, & everything as miserable as can possibly be, but still everybody seems to be fairly cheerful. \n\nRose again at 2.30 & off to the line to do the first of our \"bucksheesh\" days luckily by the time we kicked off the weather had cleared somewhat, though she still looked dark & stormy, paddling through the mud & slush reminded me of the old days of Flers & Guedecourt & busters were plentiful the majority of the men arrived at their \"posts\" wet to the skin & covered with mud, a pretty prospect for the next 24 hours. \n\nThe ground between us & Fritz is in a dreadful state just a mass of water & mud & it looks to be the same as far as I can see this morning, its bad enough on our side & we are on the\n\nhigh land \"heavens\" only knows what his part is like for he is in a morass & has all the low lying ground, a bit of a change for him, he is now going through what we have been putting up with ever since the war started, & good luck to him. Had a bit of luck last night at \"pontoon\" couldn't go wrong.\n\nMy long expected Wagga letter turned up last night, cheered me up a bit. \n\nAll the billets behind us are full of Yanks the 2nd Bde & 3rd &","50":" Batts are breaking a lot of them in, I'll bet they are having some fun, wouldn't mind taking a few of them in hand myself our artillery have a good few also, putting them wise to all the fine points of the game. What a prize this diary would be for old Fritz, I am breaking all rules by bringing it near the line, we are supposed to always leave all these sorts of things behind for fear of them falling in to his hands, but like all rules they are only made to be broken. I have always carried mine with me where\n\never I have gone & most of our officers know of it but they never say anything\n","51":" Had a good nights patrolling last night but we struck nothing we were all rigged out in proper patrolling costumes, water proof & rubber lined suits, we looked more like munition girls than anything else they are splendid things hanged if you can see a man more than a few yards off with them on, our patrol was 12 strong & we were armed with rifles & bombs & were quite prepared for any scrap the Huns might put up, but our luck was out, though I nearly walked on an old German machine gun post she was empty & covered with facsines, we were a good 400 yds in front of our wire & got as close as 80 yards to some of the German pill boxes & outposts without being spotted, my belief is that he is withdrawing from the low land in front of us & only comes out\n\nat night with his machine guns & sends a few patrols out to see whats doing, he is still as keen as ever on his flares he puts them up all night long, I reckon this is a good sign for it shows he has a wholesome fear of being surprised & attacked, & he still suffers from nerves for every now & again he breaks out, up will go the flares & his guns & machine guns let fly at nothing, you have only to rattle the wire & he will bang away, this is how I like to see Fritz.\n\nI done rather a useful nights work taking things all round, for after coming in from patrol old Fritz opened out on 5.0.11 with a big mortar & he was dropping them very close, & as luck would have it I caught a glimpse of the flash from the mortar, so I got 2 sticks & climbed an old mound of earth & waited for him to fire again when he did I got the direction &\n\nin about ½ an hour I had him fixed exactly. I then reported it to Hqrs & at 1 oclock in the morning an artillery officer came along & took the \"bearings\", & I heard later on that they blew him right out, so for once I done a bit for my country, it appears they had been trying to silence this mortar for some time, but they had been shooting too far to their left.\n\nThe land is still horribly wet & a chap is constantly getting bogged but the big old gum boots save us a lot our possy the \"Elephant\" is swimming with water & we could neither stand up, lay down, nor sit down, so you can guess what kind of a time we had but still the war goes on.\n\nThe Coy is getting in a very bad state this morning we had no less than 16 marked \"no duty\" & 8 \"light duty\" & 1 Hospital, there is far too big a strain placed on the men & its time they took a jerry.\n","52":" In the line again still very wet & sloppy but weather fairly mild. Early this morning I saw 2 Huns strolling about as cool as you please in front of us but we could not have a pot at them for fear of giving our position away, what a snap they would have been if we had been outside our pill box, in the evening we watched for them again & sure enough down they come, I fancy they have a post there somehow.\n\nOld Fritz come a proper \"gutser\" the other night when he raided the 2nd Battn. they got wind of him & were waiting, they reckon they accounted for the whole party, they got 1 prisoner out of it he got stick on the wire.\n\nThe 48th Battn who are on our left also were responsible for a smart piece of work, some Germans brought a machine gun out & started to fire her up when our chaps spotted them & sneaked out & pitched a few little \"Mills\" among them, & they ran for their life they then turned a Lewis\n\n \n\non old Fritz & I believe he squealed like a pig, put the wind up him alright\n","53":" Mr Sampson & I had another patrol out last night, we done the right sector this time, shes nothing but water & muck & a mass of old tangled barb wire, when we were getting through our lot old Fritz spotted us & opened out with a machine gun, made us bow I can tell you but luckily he got no one, I know \"no man's land' fairly well now from one end of our sector to the other, we tried to cross the valley last night but had no hope for it is full of water & easily 200 yard wide in places to attack first here is impossible for you would have to punt men across, & what kind of a stunt that would be you may well guess, we were out a good 400 yds but never saw a sign. I fancy we have him bluffed now, its a cert his machine guns are, the instant one of them starts to chatter a battery of field guns open out on him & he shuts up like a book this is the proper way to do things don't give him a chance\n\nWilkinson & I came out of the line at 1.30 last night to take over billets at \"Rose Wood\" & what a trip we had down pitch dark & raining & I'll bet we trod & fell in every shell hole between the line & Rose Wood, & to finish up we both fell in to a muddy trench that had been \"camouflaged\" talk about drowned rats well you should have seen us, & to finish up I had to go back as far as the \"Ravine\" & tell the Coy to go round the tram track for they would get bogged taking the short cut as we did\n\nLen was nominated today for the 1st Training Battalion in Blighty hope he gets over I'll feel more relieved, one of us at a time is quite enough at this mad game, especially now Stans gone Everbody is under the impression that we are going to Egypt shortly, wouldn't that be great, a chap could write home & say \"Mother I'll be home\" for he would be dead stiff to get knocked out there it seems quite feasible for look at the transport alone it would save & we\n\nwould be half way home to dear old \"Aussy\" & a chap wounded or sick would stand a good chance of getting back\n","54":" D. Coy had a bit of hard luck in one way with their patrol last night they took 2 of Fritzs pillboxes & cleaned out the occupants, & in trying to do the same to a third ran foul of a machine gun which wounded & killed practically the whole party, one or two got clear one of them ran into Lens Machine gun post early this morning, he had got lost in the confusion & in some remarkable manner had got past our wire & Fritzs \"outposts\" & so back into the support line fully a 1000 yds behind the line, up to this morning they had got 3 of the wounded in, but there are still an officer & 3 or 4 more out there somewhere. I expect they will find them tonight. \n\nWe got a clean change of clothes this morning the first change we have had since the","55":" we wanted it for the chats were eating us\n\nalive & how we used to curse them, you never saw such things to keep men awake, we had few opportunities to sleep & when they did come along, well the chats wouldn't let you, no, they would march up & down your body in Battalions & you had to scratch scratch, & the more you scratched the more you might, heavens only knows what a relief it will be when we are free of these cursed insects. \n\nThe \"Stretcher Bearers\" have to do the Gas Guard while here & how they are roaring parading to the Dr &etc.\n\nThe artillery on both sides is fairly active this morning, things will soon start to wake up now the days are lengthening.\n\n21st. Things are very quiet here today & nothing doing, with the exception of planes & artillery which are both very active. Australian mail is beginning to come along pretty well now.\n","56":" Last night being a very favourable one for planes there was a constant string of ours passing overhead, old Fritz must have got a swag of eggs bursting round\n\nhis ears.\n\nSaw a monster Zeppelin tearing through the clouds, I could see him quite plainly he was travelling at a great height & speed, looked more like a cigar than anything else.\n\nOur artillery is very active this morning they are shelling his lines like one thing aeroplanes are plentiful also, so you can see things are livening up.\n\n23rd. Have been jolly crook all day, & no wonder, we were relieved by the 3rd Battn last night, & I might mention nearly caught in machine gun fire coming out, we marched out to Wychaete & went into fairly good dugouts, we were tired & thirsty so we decided to boil a dixie of water on a Tommy Cooker & make some tea, I went out across the road & dipped into what appeared to be a clean shell hole of water, being dark I could not be sure but a soldier takes all sorts of risks, we boiled it & made our tea & went to bed, during the night we were seized with rotten pains in \n\nour stomach, we could not make out what was the cause of it at all, when we got up I went across to the same hole to get some water to have a wash in, & I nearly had a fit, no wonder we were crook, lucky we were not dead, it was about the dirtiest water imaginable nearly green & slimy, & it looked to be full of arsenic, I'll bet if the truth was known theres a dead man or two in her.\n\nHalf the Coy went on fatigues today & the other half went to Kemmel for a bath but I stayed in bed, however I am much better tonight.\n\nLast night the","57":" Battn patrol found Lieut Bull, we all gave him up for either dead or a prisoner of war, he was the officer who had the smash up with the patrol, he was wounded in the back & leg & had lain for 72 hours exposed to all the weather, it's a toss up whether he lives or not.\n\nLast night Jack Hayes, Bill Elder & Digby put a suspicious looking\n\nTommy officer under arrest he could give no satisfactory answers so they marched him down to Battn Hqrs. have not heard yet what he really is \n","58":" Wilkinson has gone to B.Coy & Parkinson has taken the platoon over.\n\nNice and fine this morning & there is much aerial & artillery activity things are waking up with the approach of Spring & soon she will be in full swing again. The Tommy Officer who the lads arrested last night, turned out to be genuine, he was shaking like a leaf when they got him at Bn. Hqrs, our chaps must have put the \"wind up\" him properly.\n\nLately they have been issuing us with our bacon boiled instead of fried, its a rotten idea for no one can eat it on account of the fat. I made a complaint about it this morning, for the men only throw it away, dont know how far it will go.\n","59":" Beautiful & sunny today & its just lovely to see the sun again. Saw a bonza airfight this morning there were a few Fritzs knocking about\n\nbut there did not seem any prospect of a fight for we could see none of ours but all of a sudden from out of the clouds there darted one of our small squat fighting machines & he poured a few rapid bursts into him, & in a few minutes we saw the Hun burst into flames & down he started he kept fairly good control of her till he got within a thousand feet or so of the ground, then she took a mad dive & headed straight for the ground she must have hit the land with terrific force for when she struck we distinctly saw sparks & smoke fly from her in a cloud, how they all cheered when she was coming down you could hear them for miles & miles One of our ballons broke loose this afternoon & rose to a tremendous height, our gunners fired a few shots after her but did not get her so they let her go, both of the observers hopped out & came down in a parachute they would just about fall in our lines. \n\nWent for a bath to Kemmel yesterday afternoon & when we got there they told us we were too late for hot water, but I was determined not to go back without a wash so I said I'll have a cold bath & 6 others came with me, but they did not want us to have even this, we argued the point for a while, until at last I said \"well look here if you don't give us a bath I'll make a complaint to Army Corp.\" this had a magic effect they let us in quick & lively, & would you believe we had one of the best \"showers\" as I have had since being in France, the reason why they did not want to let us in was that they had just taken up the duckboards & were too lazy to put them down again, on our way back we saw a lot of civilians I did not know any of them but I suppose they were Members of Parliament or something like that they were having a look round Wychaete, & the \"ridge\". Today has been both a meatless & breadless day, what the reason is I have no idea, perhaps it was to\n\nget rid of the \"iron rations\" & so save carrying them about when we move. A rather peculiar thing happened 2 nights ago to an \"outpost\" of the 8th Battalion they saw an old Fritzie & they waved & beckoned to him to come across, & hanged if he didn't, when he got over he asked them what they were & they said Australians, he said no, youre not, youre the same as I am, a \"Saxon\", they had quite a yarn with him, & just as he was going back an officer spotted him but it was too late he was gone, he then put the whole \"post\" under open arrest for allowing old \"Heine\" to get away, of course the proper thing would have been to collar him, but it would be a rotten thing to do for they called him over & if he was game enough to trust coming across \"No Mans LAND\" in daylight, it was up to them to let him go again, this is a case where your military duty clashes with one's code of honor & conscience & I might say situations similar are constantly cropping up, when an\n\nofficer has to make decisions in favour of the military machine, no matter how it may go against his nature to do it. I expect the officer who put them under arrest hated doing it, but he had to do it & so the chain goes on, its not all beer & skittles being in charge of men.\n\nIf ever a chap felt homesick well I did today, makes a chap think of Australia when the sun is shining nicely & even the birds were singing as they were here today, put me in mind of happy days I had spent in Tasmania & New South Wales, when I had not a care in the world, & my ambition was to own land & see the world, in fancy I could see the old \"Coal River\", with its \"weeping willows\" trailing over the clear old river & the trout \"rising\" in the quiet pools which were half hidden by tea tree wattle & clematis, & oh the scent of it all, it sticks in my nostrils yet, & then I was in New South Wales & on my pony out on the \"runs\" looking round the fences stock & etc, & the sun was nice & hot, & in the evening as I rode home\n\nthe old gum trees sent forth a beautiful perfume which is famous the world over & the sun went down in a ball of fire heralding the approach of another hot day & the old \"laughing Jacks\" packed together & roared & sang & chuckled to their hearts content, then as the twilight deepened the rabbits hares, wallabies, kangaroos & etc made their appearance, & bush life of the night commenced, & when you got home, unsaddled & fed your pony & went up to dinner, with the thought of another days work well done, you thought Australia a bonza place to live in, & wondered what the other side of the world was like, we know now.\n","60":" Captain Somerset took the Coy. over today, we are having quite a number of changes lately.\n\nOld Fritz lobbed 5 shells quite close to our dugout last night, & you would have laughed if you had been there to see the speed with which we lit our candle & grabbed for our respirators we thought they may have been gas \n\nshells for there was no report as from an H.E. but they were all duds. \n\nWe are having a very easy time out here all the men do is about 4 hours work out of the 24 & tucker is very good, the platoon Sgts have had the easiest time since I can remember, for we have done nothing only look after our men & detail them for the various jobs.\n","61":" We have been expecting some sort of an attack today on account of the Kaisers birthday but nothing came of it, things were very quiet, with the exception of our \"heavies\" & they pounded him all day long.\n\nPay day again for the troops\n","62":" Lovely morning & the sun is shining brilliantly, this is a marvellous winter & take it all round so far it is very little worse than the average Tasmanian winter, with only half the quantity of rain.\n\nOur 9 months men are getting Blighty leave now, I am beginning to look forward to my next trip\n\nthink I will spend a few days with Mr Duke & then go on to Ireland for I would like to have a look at her before going back to \"Aussy\".\n\nOur guns (\"heavies\") were blazing out tonight with a vengeance the aeroplanes must have spotted some movement of the Huns for they circled over the \"batteries\" for a full hour signalling with their machine guns & directing fire.\n\nI laughed this afternoon, a Fritz plane came across & got well over our lines he made straight for one of our observation balloons he darted at it like a hawk & out flew the occupants like birds & parachuted gracefully to the ground & after all the Fritz missed the balloon & he had the luck of his life to get home but he put the \"wind up\" the observers. \n","63":" Lovely & sunny again this morning quite a treat to be out in it, puts one in mind of old times\n\nAm acting C.S.M. today Jock having gone with Len & Charlie Tonkin to attend as witnesses in McCarthys\n\nCourt Martial case.\n\nCeaseless bombing raids were the order of the day with our planes last night. Just one continuous stream of them going backwards & forwards.\n\nWhile Len was down on the Court Martial case this morning an \"order\" came round saying that he had to report at Battn Hqrs \"full marching order\" at 2' oclock for the purpose of proceeding to England to go on the Instructional Staff, you may guess how glad I was, for he will be practically safe for the duration, surely the war will be over by the time his six months up, so one of us will be sure to return, & besides he has earned his spell he is taking a German rifle & a lot of souvenirs of mine with him & I gave him a few of my surplus francs to carry on with, we have always shared our money since being in the Army & Len & I are the best of pals & I shall miss him greatly for a while Mr Traill did not like Len going in one way for he is a jolly good N.C.O.\n\na thing not so easily procured these days & besides he is as good a soldier as we have as anyone can tell you. How pleased they will all be at home there should be no need to worry any more for it matters so little about myself, I have been so long away from home now that it must seem as if they never knew me, & besides Len is the younger what luck he has had, been fighting practically ever since war broke out & has never had a scratch, theres very few as can say that worse luck, however theres only one thing I hope & that is that he never returns to France while this war is on, & I don't think any one could wish better than that. The 55th Battn. are taking over our dugouts when we move out, the","64":" Dn are very strong nearly 230 men per Coy. bit different to us.\n","65":" Another glorious & sunny morning & you can just about start to feel the heat from the rays now. \n\nTook a party of men up to \"Clarks\n\nDump\" this morning to get a truck load of duckboards for improving round about the \"Catacombs\".\n","66":"\n\nNever saw such a mix up in my life as there was last night when the 14th Bde. relieved us, by some mistake or other they came in by the wrong road & missed our guides who were waiting on \"Estaminet Corner\" for them, the consequence was they had no idea where they were going & there they were wandering about with full packs up like lost sheep, everybody was cursing one another, even the officers were biting one anothers heads off, the duckboards were crowded with men going both ways, oh she was a but by degrees we got them sorted out & fixed up somehow, & when we left the 53rd & 55th cooks were going to have a fight over the cookhouse both sides reckoned it belonged to them & they had their gear there\n\nWe slept at Rossignol Camp & early this morning we were taken away to our present billets quite close to Meteren & Bailleul, the whole Coy. is billeted in a large barn & I think we will be comfortable when we get settled down, there was another mess up with the motors coming down & the road was badly choked with traffic especially coming through Bailleul, for the streets are so narrow.\n\nIt is frightfully cold today a thick heavy mist hangs over all the land & there is no sign of the sun\n\nWill have all my clothes off tonight the first time for 32 nights, so you can guess what kind of a relief it will be for me.\n","67":" Started parades again this morning & it was very very cold, we did not do much only tried a new way of falling your platoon in, some style & show I can tell you, you would have split your sides laughing if you could\n\nonly have seen the push falling over one another & the NCO's & myself getting boxed up, but we got the grip of it at the finish\n\nLens promotion was read out today also Sid Harris & McKeowns.\n\nThis afternoon I reckon our officers done the most unsportsmanlike thing as ever I have seen, there are 2 football grounds here, & 1 of them was allotted for a game of Soccer & the other for Rugby, the officers were playing Rugby but when they got down to their ground they thought it was too wet so they decided to come up to the other ground where the Soccer match was in progress, so up they come & after a terrific argument they hunted the players off, the chaps called them for everything I believe, & then left the ground in a body. This I reckon was a dirty rotten piece of work & instead of encouraging sport they are going the right way about things to kill it properly\n\nTook 50 men into Bailleul for a bath this afternoon but it wasn't much good too much red tape about it for my liking, I refused to have one on account of some of the regulations\n","68":" & nearly the whole Coy is on fatigue, for we are Duty Company\n","69":" Usual parades & I scored a little victory in one way for when the Colonel & Major came round, they wanted to know if all the platoons were organized & mine was the only one that was & I had no officer either, done it on my own account, & besides I have every little detail fixed up correctly.\n\nMcNabb & Dimock went away with \"scabies\" today but they never got very far only to the D.R.S. they are very prevalent throughout the Div. I reckon 70% of the troops have these pests in a more or less severe form, I still have them myself, & I am frightened to go near a military bath with them for they would surely grab a chap & shoot you\n\noff to some out of the way place or other where you can have the pleasure of watching yourself slowly starve to death while undergoing the cure\n\nJust before Xmas I believe the French Authorities issued an \"order\" to the effect that if any girl between the age of 16 & 18 was caught walking out with a soldier she would be sent away to work on munitions & also any female caught sitting with Soldiers in an estaminet or café or doing anything of this sort, she also would be dealt with similarily, in one way this is a good thing but they should have enforced it long ago, from what I can see of things they are a crook lot of women round here as far as morals are concerned anyhow.\n","70":" Got a bit of a pleasant surprise last night about 9.30, Jock & I were in bed at the time when Jimmy Lord came up & wanted to know if I was in bed or not, if I was not Mr Parkinson wanted to see me at once\n\nthe bed was too warm so I said \"Oh I'll be down in the morning, & away Jim went, in a few minutes he was back & said Mr Parkinson told him to tell me, that I had been awarded the Belgian \"Croix de Guerre\" & that it had come out in tonights \"orders\"\n\nCapt Edgeley also got one, I think we are the first 2 in the Battalion to received this decoration & needless to say I am proud of it, in the afternoon the Coy. were drawn up & the awards were read out on parade, & many were the congratulations I received both from all our officers & lads. I don't care such a wonderful lot as far as I'm concerned but those at home will no doubt be pleased to hear of it & it is for their sakes that I am more pleased than anything else\n\nThis afternoon the 5 senior N.C.O.s of each Coy. were sent down to the Brigade School at Meteren to attend a lecture by an English Colonel on strategy, all officers\n\nwho could attend were there & the Hall was well filled, it was most interesting & I followed it closely, but what struck me most of all was the wonderful opinion he had of the French & the brainy way they go about their attacks, in all of which I thoroughly agree with him for the French are a wonderful & good race of people.\n","71":" Had a full marching order parade this morning, after falling in we marched out on to our parade ground took our packs off & done a little drill platoon drill & rifle exercises till 11 oclock then we marched down to the Battn parade ground for an inspection by the Colonel, here he presented A.Coy. with the silver bugle which they won at the last inter Company sports, C.Coy won it first but A Coy. beat us at the last sports, it is a fine bugle & it is for competition among the Coys of the Battalion, it is a good thing for it creates a feeling of rivalry.\n\nAfter this was over the Colonel called the Battalion to \"attention\" & asked for all those who landed with the Battalion on the Peninsular to \"slope arms\", & of the 1200 odd men who jumped out of those boats, but 17 were here today, it is then that one realizes how lucky he has been & thanks his lucky stars he is still going strong, after this we marched off home & all were heartily glad to get rid of our heavy packs.\n\nThis afternoon was a holiday so I took advantage of it to wash a shirt & go down with a pair of trousers to the Battn tailor to get them altered, on the way down I was pulled up by a dozen or so officers for congratulation & in the town I met Capt Edgeley he was smiling all over his face & he said I suppose we will have to congratulate one another, & he asked me did I know the color of the ribbon, I told him I did not, & he said no one seems to know any\n\nthing about it, but he said we are the first to get it in the Bde & he believed Division, & also that it was a rare & distinguished decoration, he is going on leave to Blighty tonight & he said he will bring me back some ribbon to put up till we get decorated, not a bad old stick is Edgeley & we have always hit it well together, there are plenty of French \"Croix de Guerres\" about but ours the Belgian is a distinct rarity.\n","72":" Parades had to be cut short this morning for it started to drizzle just about 11.30 so we marched our men into the billet & started them cleaning up their ammunition gear &etc till 12.45 which is our time finishing parades.\n\nIn the afternoon we had some rare fun out on the parade ground if you go the right way about it you can get the men interested & things fairly hum then.\n\nLindsay Graham came back tonight from the Army School.\n\nWe had a lecture this morning from an Intelligence Officer about a lot of things concerning prisoners of war & what information you are supposed to give &etc, if ever you happen to be unfortunate enough to get grabbed by old Fritz.\n","73":" Went for a rather long & trying route march this morning, we first of all formed up on the parade ground & as it was raining slightly we had to pull our watersheets out & put them over our packs, this of course made the marching very uncomfortable but we carried on just the same, we went through Meteren Guterstiene, Merris, & back through Meteren again about 11 miles all told, & we were all pretty well done by the time we got home. On the afternoon we played hockey & I thoroughly enjoyed the game, we had a rare bit of fun & took some fine cracks mostly on my shins\n\nToday old Digger packed up & started \n\noff for Australia, he is the first one of the origionals to go back on the 6 months stunt to Aussy, they are sending them away according to their length of service with the Battalion Digger has only been away a few days since he first joined I must keep my head down for I must be in the running for I have only been away 11 weeks all told through wounds &etc so I am in the running\n\nMr Beckett came back to the Coy & took charge for the time being.\n","74":" Usual morning parades & Mr Beckett took the Coy over, in the afternoon we had a rare bit of fun playing hockey all the officers were playing & things were very willing. I got a beautiful smack over the eye & I saw all sorts of pretty lights as you may guess, then later on I got 2 square inches of skin knocked off my right knuckle & a gash along the thumb, but for all that I enjoyed myself thoroughly, she is getting a good hold of the Coy now, all the boys are taking to it.\n","75":" Saw the best football match this afternoon as I have seen for many a long year, it was between the 1st &","76":" Batts both unbeaten teams, the Brigadeir of the 4th Bde kicked off & the game started she was willing right from the start & in the first half 3 of the","77":" Batts. men were down & out, but they soon brought them round, this was a little unusual for the","78":" it has been generally the other way about, the first half was very tame our chaps could not get going at all & just before the bell went the 13th scored a try but failed to convert scores were 3 to nil, shortly after the second half started, the 13th scored again, things began to look very black for us & the 13th officers & men were very cocky & began to sling off, but a change came o'er the scene, for all of a sudden our backs got moving & some of the prettiest passing & running as ever you see resulted in a try for us, amidst a scene of great excitement things began to liven up properly now\n\n& our chaps took charge, & after some more brilliant play on the part of Boardman Stevenson & Hadley another try was scored, you should have heard the barrackers shouting for the \"green & black\" (our colors), great excitement reigned & nearly everyone was more or less affected by it, & after some more lovely combination we scored again, the cheering was terrific Colonel & all taking part in it, the boys went nearly frantic & hats & coats were wildly waved you would have thought the result of the war depended upon it so keen was the excitement, I was carried away myself & barracked for all I was worth, especially when our last \"try\" was scored, there was a great & mixed crowd to see this match, for it was a long talked about one, the 13th Batts. played in their colors (blue & blue) & we played in ours (black & green) & as the day was a rather nice one, it made a rather pretty sight. I'll bet these old French people never heard\n\nsuch cheering & hooraying for many a long day, they think we are a queer lot I'll bet to go mad over such things, I wonder what they used to play before the war, I'll bet football will be popular after for all the kids wherever you go in France you will see them kicking an old football about, & they are as keen as mustard over it, & attend all the matches about, however our game ended in a win for us after a great uphill game for they lead us by 6 to nil at one stage of the game, final 13 to 6.\n\nPrice & Brown were returned to the Coy. this afternoon.\n\n11th. The whole Battalion were on a musketry stunt this morning, they put a platoon at a time over the course which was a fairly easy one, first of all the platoon started off in line & after getting to a certain point they got the \"order\" to lay down & load 5 rounds & fix bayonets then on the signal they had to rise & charge an imag\n\ninary line of men which consisted of a number of bags lying on the ground with a piece of white paper for the bayonet to be used on, after passing this they came to an old trench which they lined & here they got the order to fire 5 rounds & the Lewis Guns had to open also on big white targets abut 300 yds distant, they had a minute to get rid of this, then they had to charge another line, & man an old parapet, here they had to fire as many rounds as they could get off in 2 minutes, & didn't the Lewis's spit them out, though Goggins & Earnshaws guns jammed a little but they made up for it at the second range, the object was to get as many hits as possible & points were also given for fire control, steadiness, turnout, &etc, I don't know how any of the platoons got on, but I think the Coy. done alright\n\nHockey was all the go this afternoon again, & we had a pretty good scratch match going & the fun was fast & furious for an hour or so. \n\n \n\nJack Hayes Paris leave came through at last & he has gone to the gay city. Blighty leave is still very plentiful I have no less than 8 of my men away at the present time, & they are still going, I believe there is some rumour about cutting it down to 10 days again but giving it every 6 months. We shifted our \"Mess\" this morning we now have a nice little room in a private house which is much better than where we were.\n\nBlue Dimock came back from hospital this afternoon, he tells a lovely tale about McNabb, & how he schemed & malingered to get sick & so get sent away.\n\nThe Battalion have never been so well looked after before, as they are being at the present time as regards food clothing boots, leave, &etc, we seem to be able to get what we want quite easily, which is a little uncommon in our \n\nArmy, they are all well dressed & shod, I think nearly\n\nevery man in my platoon have got new tunics trousers hats & boots since coming here & they look much smarter, besides the Coy. have a Regimental barber, tailor, & bootmaker, attached to us & they attend to their respective duties, this keeps everyone up to the scratch for there is no excuse for being untidy, & also every morning the cooks supply a big dixie of hot water for the men to shave with this is a little unusual, but you can see they are not having a bad time, a far better one than we Platoon Sgts are having for there is a tremendous amount of work falling on your shoulders getting all these things issued &etc to the men you would be surprised at the amount of clerical work this entails, for the Army is full of red tape.\n\n12th. The Colonel was round this morning while we were on parade, & he was very pleased with C.Coys performance of yesterday, our machine gunners filled 1st 2nd & 3rd places & we only had 3 platoons for parade, mine was all on fatigue\n\nFreddie Smith of No.11 got no fewer than 108 hits out of 136 rounds fired with his machine guns & C Coy total of hits was more than double that of any other some going alright, No.11 won the competition for the Battalion, so they will have to represent us in the Div. competition. This afternoon I was down in the Cinema Hall attending a lecture on German Africa by Professor Elliott it was most interesting & there was a great crowd of officers & N.C.O.s present, after this was over we all went up on to B Coys parade ground to have our photos taken (Battn NCOs). The Colonel & all the officers were there I am right on the extreme left of the picture standing on the form, hard to say how they will come out for the day was very dark & dull, the officers had theirs taken after ours. \n\nA.& C. Coy. played a draw this afternoon at hockey, they also tied at Soccer, rather a coincidence. \n\nThere has been some heavy firing up round the line, we could hear\n\nit quite plainly down here, old Fritz has been frightening the people round here by dropping pamphlets telling them he would be in Bailleul in 2 weeks time. Received a letter from the Secretary of the Enquiry Bureau asking for any particulars I could supply them of Bob Creasy who was killed on the","79":" we often get these & nearly always are able to tell them all they want to know. According to \"orders\" read out on parade this morning all mail reaching London for Australia & New Zealand between the","80":" &","81":" has been lost at sea. I have 4 letters on this, gone down for a moral, & 3 of them were long ones I had taken time over, enough to make a man jump up & never come down.\n\n13th. Started raining fairly heavy this morning so the parades were called in, & for the rest of the morning our section commanders took their section shortages. In the afternoon the whole Battalion were fallen in & marched down to the ground at Merris where we were going to \n\nplay the","82":" Battn, how all the lads roared for it was supposed to be a half holiday & walking 4 Kilometres did not appeal to them in the slightest, but after all it well repaid the work of walking so far, for in spite of the slipperiness & smallness of the ground, our boys gave the finest exhibition of passing & running as one could wish to see, they simply toyed with the 4th & ran out winner by 37 to nil, if it had been fine the score would have been doubled what a team ours is, got the wind up the rest of them properly, though the","83":" reckon they will give us the fight of our life when they meet us.\n\n14th. Last night our officers gave us a dinner, & a fine one it was 7 courses & as much whisky & beer as they could get away with, old Jock was soon out of the running, for he was mixing his drinks, beer & whisky soon knock them, by the time she was finished I was the only sober one there. Price & Parkinson were arguing about the\n\nsights of a rifle, Sid Harris McKeown, Mr Davis & I were trying to play \"bridge\" & none of them knew what they were trying to get & I'm sure they could all see twice as many spots on their cards as what there really were, judging from their calls, & Mr Beckett was giving advice to all, & keeping their glasses full, Reubens was trying to play cards & telling them all about a machine gun, & then Mr Beckett started them arguing about the color of the Belgian Croix de Guerre ribbon, you would have laughed if you had seen the way they got tangled up over the color. About half way through a stream of \"runners\" started to make their appearance, & to every one of them Mr Beckett said what nationality are you, & a most remarkable thing everyone of them said Scotch, & of course they then had to have a drink of whisky, these runners know their work trust them for that. \n\nWe finished up at 11.45 & for a wonder no one was under the table, though some of them managed to fall in a \n\ngutter or something judging by the appearance of their clothes at breakfast time this morning, those present included Mr Beckett, Parkinson, Sampson Davis & Champion, Sgts. Mackie, Price, Dimock, Harris McKeown Ruebens & myself, just a nice little party, & one of those informal dinners which we often have among ourselves, & it does the world of good, makes the Sgts & officers more like friends than anything else, which they should be, for then both sides get the best to be had from one another, & it creates a feeling of good fellowship.\n\nWe have been doing nothing all day long for there are only a few men left in the Coy. for we sent nearly 70 away to the musketry course at Tilts, down near St Omer.\n\nGot our Xmas parcels yesterday they nearly all came from Victoria again it was the same way last year the wrong States got the parcels you would think they would be able \n\nto arrange things differently.\n\n15th. Had a very easy time this morning there were only about 8 N.C.Os. left after all the fatigues had been found, so we all got on to the Lewis Gun till about 10 oclock, after that a lot of the men began to come home, so we got our hockey sticks out & had a fine bit of fun we played right up till 12 oclock, Jock is the most amusing player as ever I have seen he tries to play & umpire at the same time & he talks talks all the time, & consequently gets every one mixed up\n\nIn the afternoon we played the","84":" Battn in the final for the Brigade & beat them 8 to 3 after a most exciting & magnificent game nearly every one went silly for she was a great game, in the excitement our Colonel threw his hat in the air & our Dr stood on his head so you can imagine what it was like, it's a long long while since I heard so much barracking in fact I don't think I ever did, we were all hoarse\n\nas could be at the finish & highly delighted, there were thousands at this match & the rivalry was very keen, as it always is between the Battalions the 3rd thought they had us at half time when they were leading by 3 to nil but Lieut Boardman scored 2 brilliant \"tries\" & the mob nearly went frantic hats, sticks, gas bags, all went sky high & a terrific roar went up when Donelly converted the first one & gave us the lead 5 to 3, you can't imagine the scene when after a pretty bit of passing he raced across the second time & put the issue beyond doubt, the whole ground appeared to be a mass of waving hats & cheering men, I'll bet they could be heard for miles & miles, & so ended one of the hardest fought & closest games that I have ever seen, for you never knew right up till the last when the","85":" would score for they had a very fine team in the field & they played a rattling good game especially a little snowy chap who\n\n \n\nwas playing \"scrum half\" for them he was a little wonder no doubt. \n\nAfter the match was over Harris & I had to take a piquet into Meteren, & patrol the town & clear all estaminets & boozers after 8 oclock, but things were very quiet for no money was about.\n","86":" Heavy & hard frost last night but it has been a glorious & sunny day, we played games & football till 11 oclock, when Mr Beckett marched us down to Meteren where we put the mob over the bayonet course there & it was dead funny at times to watch the antics of some of them when they tackled the dummy men, while we were here a Fritz plane came over & our \"Archies\" started firing at him but they were going no where near him, but C Coy. Machine gunners got on to him, & hanged if they did not bring him down, he landed about 300 yards from our billets, I believe it was very funny when he started to come down, some of our cooks were running about with knives in their\n\nhands \"shouting\" give it to him Abdul & Abdul tore it into him, put 6 magazines through his gun, Rusty Egan nearly cut his finger off in the excitement, & all the Frenchies were running about overjoyed at the sight of the \"Allemand\" coming down, he had no sooner hit the ground than he was surrounded & sentries posted round her, & the Hun was got out marvellous to say unhurt he said he had only been on this front 8 days, so it was another nice little win for our Company.\n\nIn the afternoon there was another football match, advanced the competition another stage, by beating the","87":" Battn 11 to nil it was a rather easy win though previous to this they were unbeaten, but they were no match for our team, its a bit rough on our chaps having to play so often, for these games are very strenuous & take it out of the men, but still they seem to glory in it, there is some talk about\n\nplaying the","88":" Battn tomorrow, its only a friendly game but our chaps are foolish if they do for they have to meet the artillery on the","89":" & they will want their best team in the field for this Just before the match started an Australian airman gave us a fine exhibition of corkscrewing & looping the loop & he came daringly low to do it, you can tell our planes for on top they have a big black boomerang & on the sides a big A. is printed, they are practically all Anzac planes in this sector now\n","90":" Went to the Presbyterian Church parade this morning for a change but there is very little difference from what I can see of it to the Church of England.\n\nIn the afternoon the 2nd Battn. played the","91":" on our ground, & after a very close game were beaten 5 to 6. After this game was finished our officers & the A.M.C. played a short match & it was the funniest thing I ever saw in my life, our Colonel \n\n& \"Brasso\" (as they call the Colonel of the 1st Field Ambulance, for his fondness of having all brass work clean & shiny) were both playing, it was a drawn game both sides scoring a \"try\", you would have laughed if you could have heard the barrackers singing out go.on the butchers, No. 9, iodine, &etc, meaning this of course for the A.M.C. who were all doctors, there were a few Australian nurses down at the match this afternoon, & they were dressed in pre war day clothes, & they looked mighty fine, made us all feel miserable to a certain extent I think for we seem to be wasting our time so long have we been away from the society of our own bonny girls, & we miss them more & more as the days roll by.\n\nI put a nasty gash in my hand yesterday evening while we were having a bit of fun with the ball must have got caught in something sharp on someones clothes for it made a pretty mess of my hand, \n\n& today it is very very sore.\n\nAdams came back tonight, he was an ex Sgt. in our Coy. & last October was Court Marshalled for desertion, & sentenced to 10 years penal servitude, he served up till now in a prison & had an awful time according to his tale, they let him out on 3 months probation to see how he shapes again in the Battalion.\n","92":" Went down with the Coy. this morning to Meteren to do some wiring it was very funny for we were doing it according to drill book, & you might guess what this was like. \n\nC.Coy. beat A this morning in the tug of war & they have to pull B tomorrow. Received 2 books from Mr Duke yesterday for the carrying on of my diary. Heavy frost this morning but it is a beautiful & sunny day. \n\nWell the long looked forward to match between us the Artillery came off this afternoon in the presence of a large & enthusiastic crowd it was an almost perfect afternoon \n\nfootballing, we all expected it to be one of the hardest fights of the season for hitherto the Artillery were unbeaten & they were very confident of pulling the match off, but they had not the ghost of a chance for our chaps played a magnificent game & ran out winners by 24 to 3, they had them run off their legs at the finish & were doing what they pleased with them, our next match is with the 1st Field Ambulance & this is going to be a hard fight for they always put a good team in the field, they have been training hard for this match & every time we have played them has been a lot of their officers looking on & sizing things up, so I expect they will have Boardman & Stevenson marked out properly, & they will want some watching, for they can both run like hares & pass beautifully. I heard one officer say \"this","93":" Battn team is a second \"All Blacks\", he reckoned they were the finest team playing he had seen for years & years, & no\n\ndoubt they are pretty to watch I am fast becoming a convert myself to Rugby, one time I could see nothing in it, but I understand the game well enough now & it is both fast & scientific.\n\nHarris & I had to take the piquet into Meteren again last night, this is a rotten job, for you are standing about for hours doing nothing, for everything is so orderly & quiet, with the exception of pay nights then things are a trifle willing & noisy Fritz dropped a few bombs round Bailleul & Outersteene last night, must have been big ones by the noise of the explosion he drops a terrific bomb at times, she is 9 ft long & weighs no less than 2000 lbs one of these has just been dug up a dud some bomb eh. but I don't think they would do much more harm than a number of smaller ones, for its so seldom that a bomb lands on its objective\n\nMy hand is frightfully sore & painful today, if it don't improve I shall have to go to the Dr & I don't want that\n","94":" We are off parade this morning for we have no one to take on, all the men are on fatigue so the Captain said to us you can go & make your rolls up if you like Sgt. so we streaked off.\n\nThis afternoon we all went down to see the semi-finals in the Brigade boxing tournament, the fights were of a very poor class & were soon over, in the evening Ferguson from the A.S.C. came round to tea & we put the rest of the evening in playing cards. \n","95":" The Brigadier (Sticky Stevens) as he is popularly known in the Bde. was round to see the Coy do some rapid loading this morning, & they shaped very well indeed, the majority of them got their 6 chips off in 60 secs which is the time laid down for this particular class of work, some of them done it in 50 secs this is getting it down to a pretty fine point, they are paying special attention now for rapid firing, in anticapation of the coming German offensive, & I think it's a pretty good & sound idea\n\nThis afternoon the much talked of & looked forward to match between the 1st Field Ambulance & our team came off, it was not a pleasant day by any means for a thin drizzly rain started to fall but this did not deter the spectators from turning up, they were there in hundreds & all keen followers of the game. There was little or no money to be had on the ground for they snapped it all up yesterday, somewhere between 2 & 3000 frames the Field Ambulance backed themselves for so confident were they that they could beat our team. Ours was practically the same team as we always played with one or two exceptions & they all played a splendid game, we took charge practically from the start & a try was scored a few minutes after kicking off, & from then on they never had a look in the Ambulance was thunderstruck they never expected to get a licking like they were in for, & eventually we ran out winners by 22 to nil\n\nit was the \"forwards\" day out & they rose to the occasion & played like clockwork especially Andrews & Rusty Egan our little \"scrum half\". Rusty scored one beautiful try, Carstairs also played a splendid game & he was as sure as a bag. This game practically makes us the premiers of the","96":" Division, we have only 1 more team to beat & they are a soft snap for our combination, I doubt whether there is a team in the Australian Force that can beat them at present, in this competition we have scored 102 points & have only 6 scored against us thats pretty good going\n\nHad my hand lanced this morning for it was beginning to look bad it is still very sore & painful but the swelling & throbbing have all gone.\n","97":" Beautiful & sunny this morning quite Spring like & things are looking well Had a scratch match in the Company this afternoon B.Coy. were going to play us but they never turned up so we had a cut on our own, the Dr had a game\n\n& he's a character & plays fairly well, after she was over Price & I went down to a little estaminet & had a hot bath, an old lady was there making lace she had hundreds & hundreds of little wooden shuttles & she worked them back & forwards like lightning, quite surprising the speed and accuracy with which she worked I asked her what she got a yard for it & she said 17 francs. I should think it would be worth about 40 by the time it takes to make.\n\nJack Hayes Jock Mackie & my name went in to Orderly room this morning for nomination for Australia leave, they also asked for our \"conduct sheets\", so there must be something doing. I fancy if a chap can keep his head down for 608 weeks, he should stand an excellent chance of shaking the mud of France off his boots & be hitting out for the sunny South \"what bon\", just imagine a mans feelings if he ever has the luck to be told to pack up \n\nfor Australia at once, he would go nearly off his head with delight of getting home once more among his people, I don't think I should ever come back to France if ever I hit Australia, at least the temptation to do so would be very strong for a chap would naturally think that after serving just on 4 years he could well be spared.\n\nGot chipped about not being \"properly dressed\" again today, this is over not wearing my ribbon. I have never put it up yet but must do so in a few days, for as the Major said it is an honor & one has to wear it, somehow I have never troubled my head in the slightest over the decoration, as I said before the only thing that makes me proud of it is for my peoples sake & for that reason I am glad.\n\nThe spirit of economy is raging throughout the Army now, nothing is wasted not even the tins, paper &etc. all of these are collected now instead of being buried & burned as they were \n\nin past days. Coys send them twice weekly to Battalion Quarter Master & they forward them to special plants which deal with this class of salvage, all the solder is extracted from the tins & paper & cardboard is remade, pity they did not start all this long ago they would have saved millions.\n","98":" Very windy this morning & a light misty rain started to fall but not heavy enough to drive us in off parade worse luck, after the usual stunts on the parade ground, we marched down to Meteren & done some more wiring & got our hands & gloves tore about in the process. Howard came back from school this morning so we are well stocked with Sgts once again.\n\nPay day so we can look out for a few lively nights for there is bound to be some pretty stunting\n","99":" Sure enough there was trouble last night; it happened this way Jock & Price were down in one of the\n\nlittle estaminets that abound round here, just as they were coming out they spots a chap hopping out of a window with a pair of new boots & they grabbed him, he turned out to be one of my birds, James by name & a beauty, Jock took the boots from him & brought them up to our billets so as he could have the evidence, he should have put him in the clink but never thought of it at the time hanged if James did not go back & try to get the boots the second time they belonged to Mr Forrest our Quarter Master who is billeted in this estaminet next morning Jock put James under \"close arrest\" & he was tried for thieving a serious crime in the Army, there has been quite a lot of thieving going round about here lately & I am pretty sure this joker is responsible for a good deal of this & they should sock it in The C.O. remanded him to higher authority, & in the afternoon the \n\nAdjutant took the \"summary of evidence\" for this will be a Court Martial offence I had to give evidence on this for I called the tattoo roll at 9.20 PM. & James was missing.\n\nTook the Quarter Guard over from Dimock for a few hours this afternoon for he was wanted for practicing.\n","100":" & a Brigade Church parade we had to walk nearly to Merris where we pulled up in a paddock it was a good morning for marching so we did not care so much. \n\nIn the afternoon Howard & I went & had a bath & after that we played hockey till nearly tea time the Coy. also beat A this afternoon at baseball this sport seems to be catching on fast\n\nReceived a bonza cake tonight from the Wagga Comfort Fund.\n\nThe Colonel has been knocking round all day. He seems a different man altogether of late & the boys are all beginning to like him\n\nAll the musketry party returned last night from Tilts, young Freddie Smith put a record up with his gun down there scoring the possible at both ranges, some gunner is Freddie.\n","101":" Started to rain fairly heavy last night & nearly drove Howard & I out of our cosy nook, we are sleeping up in a loft & I can tell you there is no lack of ventilation, we can see the stars of a night time, gleaming through the holes in the tiled roof, but we are comfortable all the same, never get up till 8 oclock in the morning dress hurriedly have a flying wash & rush down to breakfast, finish this just in time to hop into our harness & fall our platoons in, this is the best time we have had in billets since we left Sailly & Fleurbaix nearly 2 years ago, & we will be sorry when we have to depart which will be very shortly judging by the way things are pointing for today the Capt went up to the line to\n\n \n\nhave a look at the sector we are going to take over, we are leaving about Wednesday so rumour has it. Received the parcel of Turkish Coat of Arms cards this evening & they are all gone again, they go like wild fire. Was down at the lecture this afternoon held in the big cinema hall in Meteren it was on Verdun & was given by the \"area commandant\", it was real good & I thoroughly enjoyed it. \n\nA big fight took place this afternoon in Meteren it was between Hollingsworth & Kirkpatrick of our Battalion the former challenged any one in the AIF. of","102":" he belonged to the D.A.C. it created a great amount of interest & went the full twenty rounds, our man won, so the old Battalion is holding its own all round, (hang this pen it don't belong to me mine has run dry just at present).\n","103":" There was a full marching order parade for the Battalion this morning it was held on our football ground. \n\nafter the Colonel had inspected us we had some Battalion drill, & I can tell you it was pretty hard with full packs up, just before marching off he spoke a few words about the portion of line we are going to take over & told us we would have plenty of work to do, for the present state of affairs was very unsatisfactory from a military point of view, hanged if I know why it is but we generally get a very weak & unimproved section of trench to go into, & we have to set to & put it into a proper state of defence, but I suppose it can't be helped some one has got to do it. Issued iron rations & ammunition to all the men just before dinner. In the afternoon the final for the championship of the","104":" Division came off between the Engineers & us, it was a very windy afternoon & this to a certain extent spoilt the play nevertheless it was a good game & we won easily again by 14 to nil\n\nsince starting the competition we have scored 120 points & have but 6 against us, thats going if you like after the match the Colonel told the team that he would try his hardest to get them a trip to Paris, after coming out of the line this time, he takes a very keen interest in the team & is as pleased as Punch over our victories At half time the final for the tug of war was settled between the","105":" Battalion & the Pioneers, the","106":" were far the heavies team, & to look at them one would have thought they would have pulled the legs off the Pioneers but they never had a look in, the first time they were pulled off their feet in a few seconds & the second pull they were over again when the judge stopped the pull & gave it to the 9th because some of the Pioneers were laying down to it, there was much criticism over this decision so when the 3rd one was being decided there was much barracking\n\nfor the Pioneers but it was needless for they hauled the 9th over inch by inch & won the championship. \n\nThen again after our match was over the final for the Australian Rules was played between the","107":" & Pioneers it was a very fast & interesting game & the first one of Australian Rules that I have seen since leaving Tassy. The","108":" Battalion won by 4 points scores 20 to 16, there was a great crowd to see these matches & we had a very good time & saw some good fun\n\nLindsay Graham our C.S.M. came back from leave this morning & he in common with many others has fallen a victim to the Scotch girls charms, got engaged while away, I had an idea he would for he met his girl last leave & has since been corresponding with her. You can't blame our chaps in one way for its a long long time since we have seen any of our own girls\n\n \n\n& there seems no prospect of seeing them for some considerable time so when one is thrown amongst such charming lassies as the Scotch are, well what is he to do, I know I very nearly done the same thing myself when I was in Edinburgh, but now I am very glad I kept my head for the very warm feelings I entertained of the girl has died a natural death, & I am still as free as the winds, & living in hopes of getting for my life partner a certain little Australian girl whom I have never even seen, sounds silly I know but its true, her photo I have & we correspond regularly & I seem to know her so well, if nothing should ever come of my romance, I can still consider myself a lucky man for I have tried to live a better life & to a certain extent I have succeeded at least I think so, trying to make myself worthy for this girls sake its a good thing I have found to have an ideal to live up to, & makes\n\nany sacrifice you may have to make much easier, for your conscience points you the way, even though a lot of your comrades may misunderstand your motives for abstaining from a lot of things a lot of chaps have got the idea into their heads that because they are well away from home & all their people, they can carry on just how they like & never give a thought to the future, & many of them regard chaps as fools who don't get boozed at every opportunity & in short make proper fools of themselves.\n","109":" Left our good billets this morning for the line, the old dame shook hands with all of us just before we left & wished us a bon trip to the trenches & a speedy return back to her, I think she sort of looked on us as her sons, for she could not have treated them better, at any rate she was a fine old French lady. \n\nThe march was not over long though it was a fairly tiresome walk for we marched right over the top of \n","110":" Noir one of the highest hills in this part of France, just on the top we had a spell & a Belgian girl came out with great kettles of hot coffee & gave it to the lads, when they finished one lot she went & got more, it was one of the kindest actions I have seen done for many a long day, & I'll bet this little act of kindness will go a long way towards altering the lads opinions of the Belgians, they were only poor people & she gave it in a good spirit, & wouldn't hear of taking money for it, lots of the lads wanted to give her some but no good the girl seemed only too pleased to be able to do some little thing towards the defenders of her & her country, its the same nearly the whole world over the poorer the people the greater their genorisity & kindness towards their fellow men, & Belgium is no exception \n\nThe Franco-Belgian border is right here & looking down from the hill the whole country beneath seems\n\nto be just a mass of villages & farms, it is very thickly populated swinging down the hill at a good rattling pace we struck the Locre Dickebusch road & this we followed till we pulled up at De-Zon Camp & here we are comfortably installed, but only for tonight tomorrow we move again, right into the line. \n\nLooks very threatening outside tonight & a light rain is starting to fall hope it dont rain too much while we are in the trenches, though of course we are due for some wet weather.\n\nSid Harris left us just as we were marching away from our billets this morning, he is going to England on the 6 months stunt, struck it at a good time just as the Battn are going in for their cut. While we were playing \"bridge\" tonight & having a bit of good old fun over it, a runner came round from B.O.R. with a message saying that I had to report to Mr Forrest at 8.30 in the morning full marching order \n\nI think it is for a School somewhere for my platoon officer with whom I am on good terms told me this morning that he had nominated me for a Corp School but B.o.R. turned it down because I had been through \"Candahar\" & also because they had selected me already for another job, so I ought to consider myself rather lucky to get it just as we are going into the line too, not that I have any objections to the trenches but I think I have had my fair cut in front of Fritz, & a little turn out of the ditches won't be out of place, especially as how my Australia leave is so close & this means practically all to me, you have no idea how I am looking forward to this holiday, though leaving all your good old mates who have stuck to you through thick & thin & have been as true as gold through all rough & hard times will be a bit hard, for we are almost like brothers, by we I mean\n\nour Coy. Sgts who are a jolly fine crowd easily the best in the Battalion, any one will tell you that. \n\nWe have only 1 blanket each tonight so I can see Howard & I doing a bit of a freeze, though we have come at the old \"Domain\" stunt, collected all the spare paper we could find & put it under our bed to lay on, it makes a good bed & is very warm thats one of the little points soldering has taught us, you cant beat practical experience & the Army is the place to get it, what?\n\nAt this Camp there is a model laid out in minature of the Ghelevult sector & it is very interesting, all the villages roads, woods, hills, valleys, trenches gun positions &etc being plainly shown, they had one of the same sort made for the battle of \"Messines\" & all the officers & N.C.O.s had a look at it, before the show came off, it was a good idea & well repaid the trouble, for this was one of the cleanest wins we \n\nhave ever had.\n","111":" After reporting to Mr Forrest at 8 oclock this morning I had to dump my pack & go off with the Transport to where they were going to dump the rations while the Battalion is in the line, & a pretty walk it was for they took the wrong turning in La Clytte & made off towards Kemmel just before reaching her however they discovered their mistake & turned down \"Bear Corner\" to come almost back to the same track, coming out on the road we should have taken at MilleKruisse, an hour and a halfs walk for nothing, once on the right track they made the pace a cracker & were soon in Keerstraat turning to the left here we struck down towards Vermoozeel, & turned to the right, about a mile from here, we came across the first lot of guns a battery of 9.2 & they were firing, nearly blew our heads off in passing, didn't we\n\nbless them, about a mile on from here we struck \"Spoil Bank\" which is on the edge of the Ypres Canal, we were now in country with which I was familiar for we were holding the line in 1916 round here, one would scarcely know the place again, but the big Canadian cemetery is still here, these men were nearly all killed with the German gas attack in 1915, & later on the terrible fighting round \"Sanctuary Wood\" which is quite close, this is the place where the Canadians made their great name & justified the faith placed in them although they were only volunteers, all round here & along Middlesex Road the","112":" Divison are putting in field guns getting ready if ever the Huns do succeed in breaking through, but I should not like to be among them if ever they get this far back, what a time they will have crossing the ridge, we pulled up at last after a walk of 4 hours just outside the famous Hill 60\n\nwhich was blown up during the battle of Messines, here we dumped the loads & set off back again, I got a ride as far as Veerstraat, & had to walk from there to our Camp about 3 miles & arrived there just as the Battn were moving off, here I had a bit of stiff luck for I missed the \"Mess Cart\" by a few minutes, I was going back to Hill 60 with it, I had a bit of a hunt for it & then went into the RQMS store of the 8th Battalion who went into our huts when we moved out, but I could get no information from them, they are a most disobliging crowd these Victorians & never will give much assistance to the \"Cornstalks\" so I thought the best thing to do was to go down to where the boys were entraining \nof\n on the light railway here I got all I wanted, & set out to follow the Mess Cart up, jumping on a Flying Corp lorry I got a good lift & then hopped on a mess cart belonging to the","113":" Battery, hopped out of her\n\nat \"Confusion Corner\" & took a short cut to Vermoozeel thinking to cut him off there, but on enquiring from the Traffic Police if a Mess Cart had gone round the corner, I picked a skinner so that finished me I decided to chase him no longer & set off back to \"Enforden Camp\" where the G.M. staff where here I found Jock who had also been left behind to go to a School, so I was set. While waiting for our tea to cook I borrowed a bicycle & went down to the 8th Battn. to get my overcoat & trench boots, & when I got back I was just about knocked out for I had been on the go all day long & had had nothing at all to eat, so after tea I turned into bed & had a good sleep\n","114":" There was a very heavy bombardment on our left last night must have been another raid. I believe I am out here till about the 12th my School does not start till the 14th so I am rather lucky being left out of the line till\n\n \n\nthen, my luck must have turned for it is the first time I have ever had such good treatment.\n\nThere was a heavy frost this morning & later on during the day it turned very cold & light hail started to fall. A heavy drum fire broke out about 9 o'clock tonight & continued for a good couple of hours, the Huns attacked the 5th Div & came a beatiful gutzer they never even reached our wire. \n\n2nd This morning I went into Bailleul in our Mess Cart, took one of my trench boots in to get repaired & also to do a little business while there I bought my \"Croix de Guerre\" ribbon & put it up, so now the heads will be satisfied. \n\nYou can get any amount of fresh fish in here so I brought a dozen back with me I think they were whiting & they are very good to eat Bailleul boasts of the second biggest rathouse in France, & she is some building, the grounds\n\nseem to run for miles & they are very pretty & well laid out, did not see any of the rats about, I suppose it was too cold for them.\n\nWhat a time we had on the way home for just as we were clearing Bailleul a frightful snowstorm broke & it beat in our faces the whole way home, we were nearly frozen to death & covered with snow from head to foot, it was easily the coldest drive I ever remember & I don't want many more like it took a good hour to get properly thawed & warm again.\n\n3rd Still very cold & miserable, snow lying all over the ground & no sign of the sun, this cold snap will give the vegetation a bit of a check for encouraged by the mild winter, everything is shooting & budding like wild fire, giving promise of a very early Spring in places the hedges were beginning to show a faint tinge of green\n\n& the buds on the trees were swelling fast, now I suppose they will have to call a halt for a while.\n\nThis morning Fatty Gill & I & a few more of the chaps round here cut a little road for the Transport to the R.Q.M.S. store, it was only a small job & we fixed it up alright. We are living like fighting cocks here breakfast at 8.30 & in bed if you like, plenty of steak, chips & toast, & good tea, dinner, roast meat & vegetables, tea, maconochies bacon chips, onions &etc & plenty of little side lines which Rusty Egan our cook makes up for us, there are only 4, Bill Bradley (the Coy storeman) Egan (the Cook) & Fatty Gill & I who are waiting to go to School which opens on the 14th March so you can guess we are having a good time, the only fly in the ointment is the people at the other end of our hut, who have a rotten stove & nearly smoke\n\nus to death at times, they do put a \"barrage\" over, & don't we bless them.\n","115":" Got up fairly early this morning for Fatty Gill & I had to go down to Bailleul to get a prisoner no less than the notorious James of my platoon, the joker who was caught snatching the boots down at Meteren, we were to have gone down in our Mess cart but we chose to take a chance & pick up lorries, so off we set, had to walk as far as La Clytte before we got our first lift this took us as far as Locre, hopped out here & caught another one which took us into Bailleul, Jimmy & I dumped our gear here, down in our Battn store & went & had a bonza hot bath in a private place after this the next item on the programme was to have some dinner so to a little tea room we rushed & had some of the inevitable steak chips & eggs, there's one thing that the French cant do & that's make tea, of all the wishy washy stuff as ever you tasted well they make it, tastes something like slops & is invariably cold & weak\n\nWhile in there today I saw a most interesting sight, & that was the \"calling up\" or beating the young French lads of the 1918 class 19 years old a great crowd were parading the streets all wearing the national colours & carrying great Red white & blue flags & if ever you saw patriotic & enthusiastic lads well these were, all singing & laughing as if they were going to a picnic but this is the spirit of this wonderful & magnificent people, I don't think anything will ever break their hearts & I'm certain the Huns never will, I laughed when I saw a great crowd of young boys & girls coming down the street hand in hand & singing at the top of their voices in English, a little ditty which we often sing a mixture of French & English, called( \"Parley Voo\") you would have thought they never had a care in the world. I felt sorry for these youngsters, little they know what they are so gladly coming to take part in.\n\nOn arrival at the Compound, we had to wait 10 mins for the gates do not open till 2 o'clock, when they did I went in they only allow one in at a time & presented my papers to the Captain in charge, what a horrible looking lot of men they are in here both the Staff & their birds, seems a fitting place for the whole crowd, they took me to one of the clinks where James was supposed to be & when they opened the door I never got such a shock in my life, the inmates resembled a lot of wild animals none of them had any tunics on & they rushed the door like animals in captivity do, the whole bunch had chains on their hands & feet, made me step back a pace or two & I thanked my lucky stars I never have had to suffer such indignity it would break my heart to be associated with such men, brute force reigns in these places, however a man can prefer these dens to going in the line will always remain a mystery to me, & yet some men do, but you can bet they are the very dregs of\n\nsociety & fit inmates for such rottenholes. While waiting for James, I overheard an officer interrogating a German officer who was captured in last nights great raid by the 3rd & 5th Div. the most successful that has ever been on the Western front, no less than 200 being snared, he was complaining bitterly of the way in which he had been robbed of a valuable gold watch & chain by one of our lads he had about 2 inches of the chain left where the chap had snipped it off with a pair of wire cutters or something, he was also going sore about the way in which he said the –B- Australians dished the wounded up & also because they used cogwheels on sticks to knock old Fritzs heads off, little did he think it would recoil in their own heads for they were the first to start using these handy little weapons, some \"knuckledusters\" but our chaps only laughed at his tale of woe, if he took my advice he would be a little more careful about his complaints for accidents happen to these sort of men in such places. \n\n"}}