{"Document Name":{"0":"Diary_0180","1":"Diary_0180","2":"Diary_0180","3":"Diary_0180","4":"Diary_0180","5":"Diary_0180","6":"Diary_0180","7":"Diary_0180","8":"Diary_0180","9":"Diary_0180","10":"Diary_0180","11":"Diary_0180","12":"Diary_0180","13":"Diary_0180","14":"Diary_0180","15":"Diary_0180","16":"Diary_0180","17":"Diary_0180","18":"Diary_0180","19":"Diary_0180","20":"Diary_0180","21":"Diary_0180","22":"Diary_0180","23":"Diary_0180","24":"Diary_0180","25":"Diary_0180","26":"Diary_0180","27":"Diary_0180","28":"Diary_0180","29":"Diary_0180","30":"Diary_0180","31":"Diary_0180","32":"Diary_0180","33":"Diary_0180","34":"Diary_0180","35":"Diary_0180","36":"Diary_0180","37":"Diary_0180","38":"Diary_0180","39":"Diary_0180","40":"Diary_0180","41":"Diary_0180","42":"Diary_0180","43":"Diary_0180","44":"Diary_0180","45":"Diary_0180","46":"Diary_0180","47":"Diary_0180","48":"Diary_0180","49":"Diary_0180","50":"Diary_0180","51":"Diary_0180","52":"Diary_0180","53":"Diary_0180","54":"Diary_0180","55":"Diary_0180","56":"Diary_0180","57":"Diary_0180","58":"Diary_0180","59":"Diary_0180","60":"Diary_0180","61":"Diary_0180","62":"Diary_0180","63":"Diary_0180","64":"Diary_0180","65":"Diary_0180","66":"Diary_0180","67":"Diary_0180","68":"Diary_0180","69":"Diary_0180","70":"Diary_0180","71":"Diary_0180","72":"Diary_0180","73":"Diary_0180","74":"Diary_0180","75":"Diary_0180","76":"Diary_0180","77":"Diary_0180","78":"Diary_0180","79":"Diary_0180","80":"Diary_0180","81":"Diary_0180","82":"Diary_0180","83":"Diary_0180","84":"Diary_0180","85":"Diary_0180","86":"Diary_0180","87":"Diary_0180","88":"Diary_0180","89":"Diary_0180","90":"Diary_0180","91":"Diary_0180","92":"Diary_0180","93":"Diary_0180","94":"Diary_0180","95":"Diary_0180","96":"Diary_0180","97":"Diary_0180","98":"Diary_0180","99":"Diary_0180","100":"Diary_0180","101":"Diary_0180","102":"Diary_0180","103":"Diary_0180","104":"Diary_0180","105":"Diary_0180","106":"Diary_0180","107":"Diary_0180","108":"Diary_0180","109":"Diary_0180","110":"Diary_0180","111":"Diary_0180","112":"Diary_0180","113":"Diary_0180","114":"Diary_0180","115":"Diary_0180","116":"Diary_0180","117":"Diary_0180","118":"Diary_0180","119":"Diary_0180","120":"Diary_0180","121":"Diary_0180","122":"Diary_0180","123":"Diary_0180","124":"Diary_0180","125":"Diary_0180","126":"Diary_0180","127":"Diary_0180","128":"Diary_0180","129":"Diary_0180","130":"Diary_0180","131":"Diary_0180","132":"Diary_0180","133":"Diary_0180","134":"Diary_0180","135":"Diary_0180","136":"Diary_0180","137":"Diary_0180","138":"Diary_0180","139":"Diary_0180","140":"Diary_0180","141":"Diary_0180","142":"Diary_0180","143":"Diary_0180","144":"Diary_0180","145":"Diary_0180","146":"Diary_0180","147":"Diary_0180","148":"Diary_0180","149":"Diary_0180","150":"Diary_0180","151":"Diary_0180","152":"Diary_0180","153":"Diary_0180","154":"Diary_0180","155":"Diary_0180","156":"Diary_0180","157":"Diary_0180","158":"Diary_0180","159":"Diary_0180","160":"Diary_0180","161":"Diary_0180","162":"Diary_0180","163":"Diary_0180","164":"Diary_0180","165":"Diary_0180","166":"Diary_0180","167":"Diary_0180","168":"Diary_0180","169":"Diary_0180","170":"Diary_0180","171":"Diary_0180","172":"Diary_0180","173":"Diary_0180","174":"Diary_0180","175":"Diary_0180","176":"Diary_0180","177":"Diary_0180","178":"Diary_0180","179":"Diary_0180","180":"Diary_0180","181":"Diary_0180","182":"Diary_0180","183":"Diary_0180","184":"Diary_0180","185":"Diary_0180","186":"Diary_0180","187":"Diary_0180","188":"Diary_0180","189":"Diary_0180","190":"Diary_0180","191":"Diary_0180","192":"Diary_0180","193":"Diary_0180","194":"Diary_0180","195":"Diary_0180","196":"Diary_0180","197":"Diary_0180","198":"Diary_0180","199":"Diary_0180","200":"Diary_0180","201":"Diary_0180","202":"Diary_0180","203":"Diary_0180","204":"Diary_0180","205":"Diary_0180","206":"Diary_0180","207":"Diary_0180","208":"Diary_0180","209":"Diary_0180","210":"Diary_0180","211":"Diary_0180","212":"Diary_0180","213":"Diary_0180","214":"Diary_0180","215":"Diary_0180","216":"Diary_0180","217":"Diary_0180","218":"Diary_0180","219":"Diary_0180","220":"Diary_0180","221":"Diary_0180","222":"Diary_0180","223":"Diary_0180","224":"Diary_0180","225":"Diary_0180","226":"Diary_0180","227":"Diary_0180","228":"Diary_0180","229":"Diary_0180","230":"Diary_0180","231":"Diary_0180","232":"Diary_0180","233":"Diary_0180","234":"Diary_0180"},"Date":{"0":"unknown","1":1078.0,"2":1079.0,"3":1080.0,"4":1081.0,"5":1082.0,"6":1083.0,"7":1085.0,"8":1086.0,"9":1087.0,"10":1088.0,"11":1089.0,"12":1090.0,"13":1091.0,"14":1092.0,"15":1093.0,"16":1094.0,"17":1095.0,"18":1096.0,"19":1097.0,"20":1098.0,"21":1099.0,"22":1100.0,"23":1101.0,"24":1102.0,"25":1103.0,"26":1104.0,"27":1105.0,"28":1106.0,"29":1107.0,"30":1108.0,"31":1109.0,"32":1110.0,"33":1111.0,"34":1112.0,"35":1113.0,"36":1114.0,"37":1115.0,"38":1116.0,"39":1117.0,"40":1118.0,"41":1119.0,"42":1120.0,"43":1121.0,"44":1122.0,"45":1123.0,"46":1124.0,"47":1125.0,"48":1126.0,"49":1127.0,"50":1128.0,"51":1129.0,"52":1130.0,"53":1131.0,"54":1132.0,"55":1133.0,"56":1134.0,"57":1135.0,"58":1136.0,"59":1137.0,"60":1138.0,"61":1139.0,"62":1140.0,"63":1141.0,"64":1142.0,"65":1143.0,"66":1144.0,"67":1145.0,"68":1146.0,"69":1147.0,"70":1148.0,"71":1149.0,"72":1150.0,"73":1151.0,"74":1152.0,"75":1153.0,"76":1154.0,"77":1155.0,"78":1156.0,"79":1157.0,"80":1158.0,"81":1159.0,"82":1160.0,"83":1161.0,"84":1162.0,"85":1163.0,"86":1164.0,"87":1165.0,"88":1166.0,"89":1167.0,"90":1168.0,"91":1169.0,"92":1170.0,"93":1171.0,"94":1172.0,"95":1173.0,"96":1174.0,"97":1175.0,"98":1178.0,"99":1179.0,"100":1180.0,"101":1181.0,"102":1182.0,"103":1183.0,"104":1184.0,"105":1185.0,"106":1186.0,"107":1187.0,"108":1188.0,"109":1189.0,"110":1190.0,"111":1191.0,"112":1192.0,"113":1193.0,"114":1194.0,"115":1195.0,"116":1196.0,"117":1197.0,"118":1198.0,"119":1199.0,"120":1200.0,"121":1201.0,"122":1202.0,"123":1203.0,"124":1204.0,"125":1205.0,"126":1206.0,"127":1207.0,"128":1208.0,"129":1209.0,"130":1210.0,"131":1211.0,"132":1212.0,"133":1213.0,"134":1214.0,"135":1215.0,"136":1216.0,"137":1217.0,"138":1218.0,"139":1219.0,"140":1220.0,"141":1221.0,"142":1222.0,"143":1224.0,"144":1225.0,"145":1226.0,"146":1227.0,"147":1228.0,"148":1229.0,"149":1230.0,"150":1231.0,"151":1232.0,"152":1233.0,"153":1234.0,"154":1235.0,"155":1236.0,"156":1237.0,"157":1238.0,"158":1240.0,"159":1241.0,"160":1242.0,"161":1243.0,"162":1244.0,"163":1245.0,"164":1246.0,"165":1247.0,"166":1248.0,"167":1249.0,"168":1250.0,"169":1251.0,"170":1252.0,"171":1253.0,"172":1254.0,"173":1255.0,"174":1256.0,"175":1257.0,"176":1258.0,"177":1259.0,"178":1260.0,"179":1261.0,"180":1262.0,"181":1263.0,"182":1264.0,"183":1267.0,"184":1268.0,"185":1269.0,"186":1270.0,"187":1271.0,"188":1272.0,"189":1273.0,"190":1274.0,"191":1275.0,"192":1276.0,"193":1277.0,"194":1278.0,"195":1279.0,"196":1280.0,"197":1281.0,"198":1282.0,"199":1283.0,"200":1284.0,"201":1285.0,"202":1286.0,"203":1287.0,"204":1288.0,"205":1289.0,"206":1290.0,"207":1291.0,"208":1293.0,"209":1294.0,"210":1295.0,"211":1296.0,"212":1297.0,"213":1298.0,"214":1299.0,"215":1300.0,"216":1302.0,"217":1303.0,"218":1304.0,"219":1305.0,"220":1306.0,"221":1307.0,"222":1308.0,"223":1309.0,"224":1310.0,"225":1311.0,"226":1312.0,"227":1313.0,"228":1314.0,"229":1315.0,"230":1316.0,"231":1317.0,"232":1318.0,"233":1319.0,"234":1320.0},"Entry":{"0":"\n\n","1":"\n\nWet day, a few shells over during the night. Mud something cruel. Things very quiet. Scarcely a gun firing.\n","2":"\n\nRaining all night and half the day. Tonight at 8 oclock, ice was on the water, and by 9 oclock, was a white frost. The big guns are bombarding. A lot of our men getting sick and going to hospital. A number of Indian troops here. Infantry going to trenches.\n","3":"\n\nVery foggy. Shoeing smiths Hooper and Heyden injured. The first named hit with a piece off of the heel of a shoe, Heyden torn with a horse nail, both out of action. Hun aeroplanes busy. One of ours coming down in flames. The best piece of work I ever saw. The pilot had complete controle from start to finish. He actually picked a place to land. It was an exciting few minutes. A few coal boxes about tonight. Some men blown to pieces on the road.\n\nThis road is about 100 yards from our camp. The men in aeroplane on fire landed well, no injury, clothes a little singed.\n","4":"\n\nFoggy day. Colonel and Co. gone to form a school of instruction. Some nasty 5.9 inch over at 3.30 p.m. Some ghastly sights at dressing station in rear of our lines. The unfortunate fellows all over blood and mud. Officers and men all the same, no special treatment, no class distinction. Some with trench feet, can’t walk, carried in on a stretcher. Feet swell to an enormous size. To prevent this whale oil is issued, to be well rubbed into feet. Lieut. Rigg gone with Colonel.\n","5":"\n\nFreezing, bitterly cold. Everything outside was covered with white frost; our wagon line was shelled at 2-30 p.m. One landed in the prisoners compound, killing the only Hun there. A piece of shell, weighing about 2 lbs. hit him in the mouth. Killing\n\nhim \ninsnt\n instantly, must have broken his neck. Another shell landed between three of our horses, it was a dud. Another knocked over a tent in 3rd Bty. Earlier in the day a driver of a G.S. wagon was wounded, and one of his horses killed. These shells are 4.7 inch, high velocity. Sad Sgt. Buckler gone on leave to England for 10 days.\n","6":"\n\nTwice today we were shelled. In the morning on shell burst in a tent, blowing it to atoms. All the kit one man had left was a pair of field boots. The S.M. tent in which we dine was absolutely riddled, blankets full of holes, Haversack and gas helmets, lifted sky high. In the evening, the cook house of the engineers, which is just behind our lines, had the roof lifted off. Only casualty was one mule wounded. Fritz has started again, now 7-30 p.m. Some big stuff screaching over our heads. Hope he don’t shorten. Good heavens, he has, a mass of dirt has landed on the roof\n\nof the shop. I live there with a shoeing smith. This is the third issue. No one hurt. Some talk of moving wagon line.\n","7":"\n\nAt 4 oclock in the morning, one shell landed in A Sub horse line, killing one and wounding 12. At 10 oclock, another on in same lines killing 6 and wounded several. The Vet. Officer wounded in elbow, Driver Donald wounded in several places, Driver Donrnan in hand, arm and back, Driver Karthew in shoulder. This evening in the new wagon line at 3-30, another man was wounded. The muscle of his arm torn out. We started to move in the morning. Most horrible sights amongst the horses, legs broken, heads half blown off. One had the rug blown right off, and never got a scratch. The horse lines, like a butchers shop. These shell are high explosive. Two men of the 1st Dragoons guards were killed in the same stunt last night. It is hell upon earth in this spot. Today is freezing, bitterly cold\n\nwind blowing. A big stunt on 8 p.m.\n","8":"\n\nSettled in new wagon line. Cold and freezing. Heavy frost. 11 horses dead. 4 sent to Vet. Hospital wounded. One shell landed about 6 yards from my dugout, last night, time to move. Fritz got into a heavy Bty. near the road, one mans legs blown off, another had a hole in his head, almost get your fist in.\n","9":"\n\nFritz still shelling at diffrent times during the day. We are still bombarding, only on a small scale. 91 horses in Bty., expecting 8 remounts today. Sgt. Watson gone on leave, Bdr. Strong to go to St. Johns Wood, almost got his commission.\n","10":"\n\nThe sun was shining, the first time for two weeks, Fritz shelling all over the show. Hun planes busy. Q.M.S. Thompson back from Hospital. George Gibbs, a friend of mine tramway employee, was killed\n\nnot far from here, he was working on a light railway at Mametz Wood. 5-30 p.m. an issue of shells over in our lines, no one wounded, a fire bucket knocked out. The concussion was so great that the lights in the tents went out. Great Artillery activity on just now. This is a real hell hole, don’t know the day a man will get slogged out. Just heard how G. Gibbs got killed. Three coal boxes come over, he and two more took cover behind a stack of timber, the third shell hit the timber, killing George and a signaler Sgt., the third man escaped. I am trying to find out where his grave is.\n","11":"\n\nWet, with hail, very cold; nothing much doing. A bit of a stunt just starting. Germans sending a few shells over, 6 p.m. A rumour that the Bty. is going to be formed into a 6 gun Bty. 8 remounts received. D.A.C. getting all mules.\n\n6-12-1916\n\nThis morning at 1 a.m. enemy shelling.\n\nFarrier Sgt. Croft and Saddler Sgt. Richardson of 1st Bty. killed in dugout, direct hit. The","12":" Bty. lines join our, where the two Sgts. were killed is about 50 yards from my tent, further on. An Officer’s groom wounded. New Vet. Officer on job, sending 5 horses to Vet. Mobile, and destroying two. Anniversary of my birthday. Bitterly cold.\n","13":"\n\nNo rain, terrebly cold. The usual performance last night. Shelled just on right of our lines. Today at diffrent times he shelled our old position, killed two engineers, and a number of horses. A pair of horses in a small arms wagon bolted. Think of horses bolting in this mud. Three more of our horses destroyed, and four more sent to mobile.\n","14":"\n\nWet day. Leave cut out. Shoeing smith Heyden was to go tonight. Shells amongst the engineers, twice today, only 200 yards from our lines. Terrific explosion, pieces\n\nof bags, iron, and timber, going up in the air.\n","15":"\n\nRaining all day. Terrebly sloppy; extra issue of shells over during the night, three guns firing on us. A man working on light railway wounded. Sgt. Delaney back from Hospital. Got his commission, S.S. Heyden gone on leave for 10 days to England. A bit of a straff on, 6-30 p.m.\n","16":"\n\nPartly wet, still cold. Change of shells over today time shrapnel. Three men working on railway wounded. Later in the evening high explosives over in cart loads, smashed up the railway, and again wounded some of the workmen. Some of our drivers were taking timber to the Bty., one man got mixed up with these shells, lost his horses and timber. Horses turned up later.\n","17":"\n\nThe morning was fine and frosty. About\n\n10 oclock the weather changed; bitterly cold. The Hun planes were up at 1 oclock this morning, dropped bombs on Albert. Our supply dump shelled this morning, starting at 10 a.m., 8 inch percussion high explosive. A few shells near our lines during the night. Three horses sent to mobile. Most of our drivers suffering from sore feet. My feet are terrebly sore, what is known as trench feet. 21 men short in Bty. Orders out, that the Bty. will be made into a six gun Bty., when we come out of action.\n","18":"\n\nSnow, rain, sleet, and wind, all in one day. Bitterly cold, tonight, still raining. Very trying weather, men going to Hospital every day. Some dirty shells over during the night, one landed in 1st Bty. forage stack, one horse wounded. Our ration wagon stuck in mud, can’t move it with 8 horses. The heavy Artillery pulling out, and parking their gun in the square in Albert.\n","19":"\n\nFine, but dull. Enemy celebrating the fall of Bucharest, out on parapets, drunk, our Artillery opened fire on them killing hundreds. This happened at 10 p.m. Very quiet last night, and today, as regards shells coming over. A few singing about, but not near us.\n","20":"\n\nTen remounts received, making our total of horses up to 99, instead of 119. Quiet night, a few shells about today. Some talk of sending 40 horses back to Albert, one shoeing smith to go with them. Report from Bty. One shell landed in a dugout, (no one in it) another alongside of gun pit, and numerous time burst. No casualties. Capt. Heslop, V.O., To be Major in today’s orders.\n","21":"\n\nShowery, not so cold. The usual shelling last night, no damage. New Vet. Officer, Capt. Lucas. I was using some thick heels and toe shoes, he picked one up and said, of course you belt down those, pointing to the thick heels. Where ignorance is bliss, tis folly to be wise.\n","22":"\n\nSnowing, very cold. A few shells about. 10 horses gone to Vet. Section mobile. The total number sent to mobile from this position is 50. The poor wretches are up to their hocks in mud on the lines. Never out of it, day and night, where ever you go, mud, mud, mud. Spent 2 hours putting a set of shoes on one of our original horses, fell down three times. Three men on the job, one holding, one propping him up, and the other nailing the shoe on. The horses are that sore, all over, that to pick up their feet causes them pain. Absolutely the worst job that I ever had, and to think that I am trying to battle through with it, God, the people in Australia don’t know what we are putting up with.\n","23":"\n\nFoggy. Shells amongst the 3rd Bty. last night, scattered the feed heap. Got mixed up with one myself this evening. Went to get a duck board, shells landed near me, rolled me over in the mud, I done a duck. Now he is peppering\n\nus with time shrapnel. Now so foggy, that you can only see a few feet around you.\n","24":"\n\nCold, and freezing 5-30 p.m. Today reported success at Arras by the British 9,000 prisoners. A few Artillery stunts during the night. Xmas gifts arrived, our Sgt. Major received a parcel from England, had a banquet, cold roast fowl, Sweet Nell apples, Plum pudding (heated) and cake, topped up with chocolates.\n","25":"\n\nSnowing, very cold. Comfoforts here in charge of Q.M.S. 1,100 Huns captured by French at Verdun. Some time shrapnel over last night. Some of our men going on leave, Sgt. Torpey here tonight, to go tomorrow, lucky man. Two parcels received today from home.\n\n20-12-1916\n\nSunny day. Real Hell, Huns shelling all round us with 5.9 and 10 inch. Terreble destruction. Elephant huts blown to atoms, one shell in 3rd Bty. lines, one horse plastered on the sky. Engineer suffered, shell landed in officers dug out. Several men\n\nkilled and wounded, one man shell shock. ","26":" Bty. wagon knocked out. They are just behind us. Railway line one mass of ruins. It was a horrible day. Even now 7 p.m. the shells are coming over. The following sketch will show how lucky we were. The dots represent shell holes.\n","27":"\n\nShortest day. Wet cold, and windy. With the exception of early this morning, no shells over. 30 cases through dressing station, result of stunt yesterday. This does not include killed. Most of the shells were 9 inch armour piercing, high velocity, 3 ft. 6 in. high. Two casualties at Bty. yesterday. Corp. Redshaw wounded in chin and arm. He was just sent up from wagon line, and was in gun pit, taking over gun and stores, when a shell carried away one wheel and dial sight. Gr. Allen was wounded in head. Fierce Artillery activity in our quarter all night, and all day.\n","28":"\n\nSun shining this evening. Hun shelling about our camp. Artillery active all along the line. 130 shells sent over by the enemy on the 20-12-1916. Conditions are damnable, almost every body with sore feet, and colds. This is our ninth week in action.\n","29":"\n\nA very wild day. Rain and wind. A few shots over early this morning. Fitter Corp. Roberts wounded. Lost a man last night, he was sent up to Bty., out all night, turned up this morning 10 oclock.\n","30":"\n\nXmas Eve. Each man recieved a card board box, sent through the comforts funds, containing, sweets, potted meats, fish, and writing pad, extra issue of rum tonight. Fairly fine day, not so cold, raining at times. Some time shrapnel over at 4-30 p.m. A close go, a matter of a few yards. Same last night, mud and stones over our tent, Gr. Boden reported for duty, from Hospital, just as he did so, a few shells were coming over, he was immediately sent\n\nback back, suffering from shell shock. This is the third time.\n","31":"\n\nXmas day. Dreary, cold, wet and windy, shelled again last night, one landed fair in our horse lines, luckly it struck a soft spot, and failed to explode. A few more landed about our tents. Fair dinner, Ham, and tinned peas, Plum pudding and sauce, Preserved fruit. Artillery firing like fury all night.\n","32":"\n\nStill raining. Some nasty time shrapnel over at 4-30 p.m. One large shell lobbed in D.A.C. Artillery very active, 100 rounds of ammunition sent to Bty. Shoeing smith Heyden returned from leave. Weather mild.\n","33":"\n\nFine bright day. Aeroplanes busy. Five Hun planes tackled one of ours, and brought him down. Three of ours brought down altogether. With all the rain and mud, it has its advantages, the ground being soft, the shells, in most cases fail to explode, or, if they do, they are too deep in the mud to\n\ndo any damage. But the Hun is cunning, he is putting over a lot of time shrapnel.\n\n28-12-1916\n\nFreezing, terrific fog. A few shells coming over, some large stuff flying about. Saw a 4.5 Howitzer coming down on light railway, smashed to pieces. Sgt. Major Short going to school got a commission. Farrier Sgt. Curtain of 1st Bty. under arrest, for having a driver in shop holding a horse. Officer said it was not necessary. The Farrier said it was. One horse in 1st Bty. smothered in lines. One of our horses destroyed, injury to hock. A man in","34":" Bty. seriously wounded. Hun plane over supply dump, opened fire with his machine gun, done a lot of damage. Later he dropped some bombs about here.\n","35":"\n\nTerrible night, shelling terrific. Some big ones over. A horrible sensation to be lying in your tent, listening to these shells coming over, never know where they are going to drop, and every now and then an avalanch of\n\nof dirt covering your tent. Last night they were landing all around us, and fortunately no damage was done. Albert was shelled a day or two ago 11 men out of 17 going on leave were killed. Four horses sent to Vet. Mobile. Bty. getting shelled this evening, one horse wounded.\n","36":"\n\nRaining in torrents this morning. Mens dugouts swamped, lines in an awful state. No shells over. Tonight our 12 inch is speaking, come up on the broad gauge railway. Mild day.\n","37":"\n\nLast night about 100 5.9 inch landed 100 yards from our lines. And this evening some heavy stuff landed around a 6 inch Bty. Tonight is the last of the old year. Our O.C., Capt. Olding, sends his compliments, and thanking us, in the wagon line for our loyal support. The guns just now are quiet 7 p.m. An officer in 3rd Bty. killed.\n","38":"\n\nNew Year’s day. Weather dull. A few\n\nhigh velocity shells over this evening. 400 rounds of ammunition to go to Bty. A bit of a stunt coming off. My Corp. on English leave.\n","39":"\n\nStill a few shells flying about. Weather dull. Terrific bombardment. Another Vet. Officer, Major O’Gorman. The Salvage Corps working here collecting 18 pdr. cartridge cases. A few time shrapnels over. 9 remounts recieved. Fine looking horses.\n","40":"\n\nHorses and men from D.A.C. to take ammunition to gun position 7-30 p.m. did not get there, lost 5 horses and ten boxes of ammunition in the mud. Only one man got to guns. One of our horses stuck in shell hole, went up with rations, sending 2 horses to pull him out. Bty. getting shelled.\n","41":"\n\nRaining the best part of day. Tonight is bright, aeroplanes up, search lights trying to pick them up. Huns driven back. No shooting by the Bty. this last two days.\n","42":"\n\nGlorious day, Artillery very active, aeroplanes up in hundreds. Close call last night wagon line shelled, one landed 10 yards from tent, covering the tent with dirt. Marvelous the little damage that is done. General Bessel Brown in wagon lines, telling the Sgt. Major that 300 reinforcements coming for 1st Bde. Taking a long time to get here. A message tonight from Major General Hobbs, to the troops of","43":" Division thanking them for their support, & etc. He is now attached to the 5 Div. 6 horses sent to mobile vet. section. One of our old Bty. hand, who was transferred to a T.M. Bty. was killed (Corp. Challen).\n","44":"\n\nCold, no rain. 4 shells just landed in our old wagon line. Some talk of moving out. Enemy very quiet last night. Only 2 or 3 shells over. Our Artillery were firing almost all night. A lot of traffic on the light railway running past our lines. Two small steam engines No. 107\n\nand 111, hauling 18 lb. ammunition, duck board, gun pit props & etc. up to forward dumps.\n","45":"\n\nRaining all night; Bitterly cold, blowing a gale. Enemy plane over. The usual straff by the Hun 7-45 p.m. Supposed to move out of action on the 13th inst. Fitted outrigger to mess cart. Had to find an old tyre to do the job, got an old G.S. wagon wheel out of shell hole.\n","46":"\n\nA few duds over during the night, some time shrapnel coming over now, raining and cold. Horse fell into shell hole taking ration to Bty. Sent 2 horses to pull him out. He was dead when I got to him, frozen to death. Another Sgt. attached to Bty., come from Etaples, rather rough on our N.C.O. Considering that he was an original Light Horse Sgt.\n","47":"\n\nFine day, Enemy aeroplanes busy. Several duels in the air. Horses and limber sent to\n\nBty. to pull right section guns out. Seven guns on our front blown out today. Also one 9.2 in. Tonight the Artillery active.\n","48":"\n\nSnowing, freezing tonight. Left section coming out of action some time to night. We were in action at Fleurs. Three D.A.C. men killed. Over 50 shells over. 16 reinforcements from D.A.C., 4 horses Vet. Hospital.\n","49":"\n\nSnowing and raining all day. Move out tomorrow at 9 a.m. Shelled again last night. Sgt. Galloway the new Sgt., wounded. One horse wounded hit in eye.\n","50":"\n\nOut of action. A terrible job to get the gun out, had to depend upon one pair of horses; we would never have got out without them. In leaving the wagon line we had to double bank the teams to get on to the main road, 8 horses in a water cart. My old horse well again riding him out. Arrived at Buire 4-30 p.m. Pronounced bue air. When we started it\n\nwas snowing, then turned to sleet, later the weather cleared, but still bitterly cold. Supposed to be here 6 days.\n","51":"\n\nSnowing, very cold. Horses out in the open, on brick standings, shoeing horses on the line. Sgt. Gibson posted to Bty. He was invalided to Australia, hit in head.\n","52":"\n\nStill in rest camp, under canvas, a rotten hole. B subsection team gone to Meault work shops for gun, guns getting repaired. 5 horses sent to Mobile, mostly necrotic sores. Freezing all day.\n","53":"\n\nSupposed to move from here on the 19th inst. Recieved a letter from Vance in England also one from home. Major General Walker inspecting lines. Major Matson A.D.V.S. inspecting horses.\n","54":"\n\nSnow 6 inches deep, not so cold. As far as you can see is white. This is the first\n\nbig fall of snow that I have seen.\n","55":"\n\nOn the roads again tomorrow. Reveille at 5 a.m. Move off at 8-15 a.m. Weather still cold, snow and rain yesterday, snow thawing, very sloppy. Two of our wounded men back. Corp. Redshaw and Gr. Allen. 4 more horses to Mobile.\n","56":"\n\nLeft Buire 8-15 a.m. Perishing, cold to the bones. Arrived at Rainneville at 2-15 p.m. In fairly good billets. The country covered in snow. Quite a change to get a cup of hot coffee and biscuits in a warm room.\n","57":"\n\nSnow on ground, still cold, Horses in an old brick field. Sgt. Gibson acting Q.M.S. 1st Section of D.A.C. with us. Major Matson A.D.V.S. inspecting our horses, only 63 in by now. Shoeing horses in old brick shed.\n","58":"\n\nFreezing, no remounts available. Snow still on ground inches thick. One of our\n\naeroplanes made false landing. We supply a guard.\n","59":"\n\nSnowing, fairly cold, Capt. Olding out of hospital, we move from last billet without him. A bit of a stir up in Bty., everybody to attend all parades, Artificers included.\n","60":"\n\nToday, sun shining, tonight freezing. Baloon floating over our lines, adrift. Converted into a six gun Battery. Absorbed left section of the 22nd Battery. I got an extra S.S. Corp. and shoeing smith.\n","61":"\n\nStill terrebly cold, very severe frosts in the mornings, intermingled with wind. The D.A.C. cleared out this evening, The 101st Howitzer Bty., taking their place. Promotions amongst the Officers. Capt Olding to be Major, commanding the 2nd Bty. Capt. Selmes to be Major commanding the 101st Howitzer Bty.\n","62":"\n\nCold and frosty morning. On the move again tomorrow. All horses to have frost coggs in shoes. Horses recieved from 22nd Bty. in an awful state as regards shoes. Had to shoe 20 today ready for the roads tomorrow.\n","63":"\n\nLeft Rainneville at 9-15 a.m. I was working at 5 a.m. with my shoeing smiths, putting frost coggs in shoes ready for the march. This is drivers work not mine. I have quite enough to do to keep the horses shod. Anyhow we got most of them done. Cold as a frog, hands almost frozen. Arrived at Behencourt 2 p.m., hard frost, bitterly cold. In passable billets, some of our horses under cover, others in a stable with no roof, likely to move into action on the 28 inst. Our journey today 6 miles.\n","64":"\n\nStill cold and frosty. Hun aeroplane over. Going into action in a day or two, one section at a time.\n","65":"\n\nCentre section gone into action. Two horses to Vet Mobile.\n","66":"\n\nFrosty, very cold. Move off tomorrow 8 a.m. for firing line. Rumoured that 60,000 Cavalry behind the line, ready to make a push forward, when the time arrives. Col. Anderson suffering from frost bite on hand. Sgt. Younger to Hospital, rheumatism. Our men are suffering terrebly 90% have bad feet, and a number with colds, I have a cold, the third on top of one another.\n","67":"\n\nLeft Behencourt 8-15 a.m. Arrived at Bottom Wood 2-30 p.m. Snowing all the time, very cold. We relieve the B Bty. 251 Bde. Terrible mix up. Two Btys in one wagon line. Tonight, with the Vet Sgt. Sad Sgt. and Q.M.S. sleeping under a tarpaulin, which was erected for a harness shed. In the morning we were all covered with snow. The Tommy Bty. will move off tomorrow morning at 5 a.m.\n\nHorrible journey today, in places the road is like glass, several horses fell down. Our wagon line is 4 miles behind the Bty. Appears to be a quiet spot.\n","68":"\n\nSnowing all night, cold. A stir up amongst the batmen, they were put on picquet. Fine class of men these, duds of the Army. Frost cogs used extensively, even then horses fall down and cut themselves to pieces, roads like glass.\n","69":"\n\nStill freezing, no snow, bitterly cold. I am not too well, heavy cold. Rations very light, not enough to feed a rat.\n","70":"\n\nThe 1st Bty. had a man and horse wounded, rations plastered on the sky. Artillery active last night. My feet are sore again. Things all up side down. Country still covered in snow.\n","71":"\n\nFreezing day and night. Washed a shirt, hung it\n\nout today, went like a board. Everything frozen. Bread, meat, tinned stuff, light a fire under water cart. One of our planes down, a dozen yards away. Shoeing smith Heyden Hospital. Very busy shoeing and frost cogging.\n","72":"\n\nFairly quiet. Three guns out of action. Hun shelling Albert with 12 in. shells. No shells in our wagon line.\n","73":"\n\nNot so cold as usual. A big stunt on last night. Our Infantry hopped over. A lot of ammunition going to Bty.\n","74":"\n\nTerrebly windy; Bitterly cold; Freezing all day. A fleet of enemy aeroplanes over last night, dropping bombs, and opened fire with their machine guns. Brig. Gen. Leslie now in command of 1st Division.\n","75":"\n\nBitterly cold, a high wind blowing. Still freezing. 9 Hun planes over in one\n\nSquadron. Rumoured that we move wagon line. 600 prisoners in the hop over the other night. Took the Germans 7 minutes to establish their barage. We maintained a steady rate of fire all night, expecting a counterattack. It did not come off.\n","76":"\n\nCold and windy. Hun aeroplane over, one bomb dropped about 200 yards from horse lines. Terrific bombardment on from 5-30 till 6 p.m. Our Bty. had a stunt for 15 minutes.\n","77":"\n\nFine day, the wind has dropped, not so cold, but still frosty in the morning. Nothing doing, very quiet.\n","78":"\n\nBombardment just opened up, 8 p.m., supposed to last 6 hours. Hun aeroplanes up again last night, beautiful and moon light opened fire with machine gun. Lieut. Morris back from leave. Leave again cut out, this has happened several times lately\n\nowing to the congestion at Le Havre, preparing for the spring offensive.\n","79":"\n\nFine day. The heavest frost this winter, on the ground all day. A few shells over, a fair distance from our lines, mostly time shrapnel. 1st Bty. moved their wagon line this evening.\n","80":"\n\nGas alarm tonight, Guns very busy. Not so cold, snowing, raining this evening. 1100 rounds of ammunition to go to Bty. Q.M.S. Hunter, our new Q.M.S., got a Phonograph today. Had an enjoyable night. 45 Bty. just pulled in alongside of us. (Col. Rabetts Bde.)\n","81":"\n\nA thaw has set in, getting very sloppy. A bit of Artillery shooting on this evening. Weather getting warmer. The gas caught some of the D.A.C. last evening.\n","82":"\n\nFine day. Hun aeroplane over, Two shells in an elephant hut, Plastered it on the sky.\n\nHard frost. Enemy plane brought down last evening. Artillery very active. a complaint in orders today, about horses picking up nails, 700 in Vet Hospital in one week.\n","83":"\n\nThe snow is gradually disappearing, days getting longer. A leave train was wrecked, on the 13th. 50 men killed and a large number injured. A rear collision, rumoured that the tail light was missing off the leading train. A leave boat was torpoeded coming to France. 1,900, only 100 saved. The shells that landed in elephant on the 14th killed 2 men and wounded seven. A few shells over. Hun aeroplanes busy. Our artillery getting to work.\n","84":"\n\nHun planes over this morning at 5-30 dropped bombs, one fell on an ammunition dump, setting it on fire. Thousands of rounds of ammunition destroyed. At 10-30 a.m. the report was terrific. Such an upheavel I never saw, Frightened all of our horses. Horses in G.S. Wagons and water \n\ncarts running away. The fire continued till about 4-30 p.m. The weather is mild. Major Matson inspecting horses, made numerous complaints. The most rag time show I was ever in, men loafing about all day, over 100 men in wagon line at present. He said the Militia Btys in Sydney were a long way better.\n","85":"\n\nWet and muddy, a big straff on 5-30 a.m. Big fog all day. The dump blown up yesterday £1,000,000 damage done, several men killed and wounded.\n","86":"\n\nAn extremly quiet day, nothing doing, plenty of mud about. The Baziltin dump almost blown up, shells all around. Lieut. Benham is in charge.\n","87":"\n\nFine but foggy; the mud is increasing. A few shells over at 8-30 p.m. Lot of men going sick. The price of eatables very high, small tin of pineapples Fr. 1-60, a large tin 2-6, a small\n\npackage of rolled oats s.1\/1d. Rice 1\/4 per kilo 2½ lbs.\n","88":"\n\nWet muddy and miserable, nothing doing, too foggy and wet for any big stunt. Just recieved a letter from Sgt. Leeming, he was wounded in lung. He is now in England, never got over it, pieces still in lungs.\n","89":"\n\nIn orders tonight, attention is drawn to the number of men caught with gas, greater care must in future be taken, and gas helmets always carried. Some men in wagon line sent to relieve men at guns. Artillery active during last night.\n","90":"\n\nCapt. Hogan, attached to Bty. He is from","91":" Bty. I am left in charge of wagon line. 2 shells over at 9 p.m. Terrebly wet and muddy. No heavy traffic alowed on roads for some days, on account of the thaw; which is taking place.\n","92":"\n\nDetailed to go to Edgecliff Siding for remounts. Drawing horses for the Brigade, 25 Light\n\ndraughts (All English horses) for each unit.\n","93":"\n\nThe Infantry hopped over last night. They went as far as the third line. No opposition. Not a German in sight. The Cavalry were ordered up. They patrolled 4 miles, enemy not in sight. Bapaume is evacuated. We recieved orders to be ready to move at a moments notice. Our first line wagons filled with ammunition ready to advance. Our guns are out of range. Plane over at 10 a.m. dropped one bomb. Weather still fine but foggy. Our heavy artillery is now firing 8 p.m. The sun was shining a little this evening, our aeroplanes were up in scores observing.\n","94":"\n\nStanding by, ready to move the guns forward. The 1st and","95":" Btys out all night. Got back to Wagon lines 11 a.m. Had to assist the 46th Bty. Lieut. Roberts wounded. The weather is fine. The A.D.V.S. inspecting our horses. The Huns we now hear has fallen back 1,500\n\nyards. Rumoured that they are going back 15 miles. A number of Btys are in action, in what was his front line. Hun plane over, opened fire with machine gun: a few shells over.\n","96":"\n\nFine day, Guns gone forward, in action at a place called Seven Elms. Enemy still retreating, sniping our men with machine guns, loosing a lot of men. This is the second night our men has been out. Had a terrible time last night, only got one gun out of action, one fell into a shell hole. Having a hell of a time getting teams and packs out, day and night at it. Mud over your boot, and feet sore. 1½ hours to turn out two 8 horse teams.\n","97":"\n\nTerrible mix up, men out all night again. Got the guns into new position. Likely to move again. One round Hogan away on leave. Huns still retreating. Mowing our men down with machine guns. Our tanks\n\ngetting into action. Indian Cavalry went up tonight. The Huns are leaving men in charge of machine guns with trench feet. We are taking no prisoners. Very systematic move on the part of the enemy. Weather fine, mud getting dry.\n","98":"\n\nThe best and finest day for months, still moving forward the Artillery, our Bty. out of range, never fired a shot. Sending up hundreds of rounds of ammunition. Lieut. Archer in charge of wagon line. Rations and ammunition going to Bty. on light railway working day and night. One of our baloons brought down in flames, by a Hun plane.\n","99":"\n\nService stripes issued, one for each years service. We are still advancing. A few shells flying about light velocity. Carting ammunition all day. Our first line wagons in a new position. Likely to move our present line. Rations and 2 men lost during the night. Bty. without\n\nfood, great row about it, terrible tangle. Filled wagon with ammunition from the 45th and 46th Bty. position. Taking ammo from old to new position.\n","100":"\n\nFrosty morning. Ammunition still going to Bty. Bty. shooting all night, mud stickey.\n","101":"\n\nBeautiful day. Coming out of action in about 2 days. Some old Colonel in our lines, finding fault with the way are horses were groomed. After all the advancing, the enemy can still shell Albert. Relieved of charge of the wagon line, Sgt. Watson here. We have two lines, vehicles in one horses in the other. I am at Bottom Wood. Change of officer in wagon lines, Lieut. Morris. Mess cart shafts broken, putting in new ones.\n","102":"\n\nVery heavy snow storm last night, stopping at 11 a.m. Going out of action on the 7 inst. More remounts recieved 16, not bad looking horses. All ammunition in wagon line\n\nhanded over to the 46th Bty.\n","103":"\n\nMoving off tomorrow 8 a.m. Pulling guns out at midnight. Things very quiet. Snow all melted, very muddy.\n","104":"\n\nLeft Bottom Wood at 10 a.m. Arrived at Behencourt at 4-30 p.m. Second time in this village, very cold.\n","105":"\n\nSnowing this morning. Very cold. Great stir up, the C.R.A. in camp. I am kicked out of shop. Likely to be here some time. 3rd Bty. gone to school. ½ an orange per man issued in lieu of jam.\n","106":"\n\nSnowing, and raining all day. Shod 10 horses. The billet where we are was built in 1713. Staying here 15 days, going to do Battery manoeuvre.\n","107":"\n\nWet and miserable. Nothing doing.\n","108":"\n\nFine day, half holiday for the men, plenty of mud. Our stay is prolonged to three week. Supposed to be mange amongst the horses, also Derminitis.\n","109":"\n\nWet and dull, shoeing horses for Major Vaughn, O.C. in charge of German prisoners. Our men getting plenty of work. Read of the fall of Baghdad tonight.\n","110":"\n\nFine weather. 18 remounts recieved this evening. Very sleepy hole of a place this.\n","111":"\n\nReallotment of horses in Bty., teaming and etc.\n","112":"\n\nSame routine, a Bty. of the 4 Division 110th Bty. just in from the line, there 4 days, never fired a shot. Huns still retreating.\n","113":"\n\nFrost this morning. General Walker inspecting our lines yesterday.\n","114":"\n\nGlorious day, St. Patrick day. Half holiday. First pay in new pay books. General Birdwood here. Bapaume has fallen 4-30 a.m.\n\n18-3-1917, Sunday\n\nWeather improving. Football match. 1st Bty. v","115":" Bty. Men granted half holiday. Sgt. McNamara gone to D.A. to get his Military Medal.\n","116":"\n\nRaining. Good progress made on our front. 32 Kilometres in all. The town of Bapaume dates back 864 A.D. It was set on fire by the Germans.\n","117":"\n\nSnowing, sleet and rain, very disagreeable day. Struck a snag in the remounts, had to rope him.\n","118":"\n\nColder than usual. A move rumoured on the 26 inst.\n","119":"\n\nSupposed to be going North, nothing doing.\n","120":"\n\nFine day, frosty morning. First day of spring. A lot of 60 pdrs. passing through the village, entraining somewhere, going North. All Btys seem to be short of horses, one Bty. had only 45 all told.\n","121":"\n\nAgain frosty morning. The 19 Division moving through the village. This is the Division that we were attached to on the Peninsula. Sgt. Major and Sgt. Ward racing their horses tomorrow evening 200 Francs on. Permission has been granted by the O.C. Very bad issue of horse shoes, two horses pricked lately.\n","122":"\n\nBeautiful day. Columns of troops still passing through this village. The Horse race was won by Sgt. Ward’s horse (Sorry Jim), Four lengths, rotton track. I was appointed judge. Recieved a letter from brother Vance. Big move on somewhere.\n","123":"\n\nIn holts with Vet Officer. Made a complaint about shoes. Lieut. Archer’s horse was shod at 11 oclock, went lame in two hours, supposed to be pricked, Vet Officer got another Farrier to have shoe removed. The Vet Officer told me the horse was lamed in shoeing, I asked him if it was pricked, all he said was it was lamed in shoeing. He said, in answer about the shoes they were made that way on purpose, I said it may appear so, to a man that learned it out of a book. He threatened to put me under arrest.\n\nAll Artificers Sgts. to march their men from early morning parade to work every morning.\n","124":"\n\nRoute","125":" miles. Inspection by General Coxon. Weather good. Found great fault, marching order parades, untill further orders; No shoes off this day.\n","126":"\n\nRaining all day, very sloppy. Horse nails\n\nto be reduced from 60 per horse per month to 40. Sweedish iron getting scarce.\n","127":"\n\nRaining again, nothing doing. Lecture tonight by O.C. on ammunition.\n","128":"\n\nShowery; Half holiday. Pay day. Troops still passing through the village.\n","129":"\n\nA dismounted route march, 6 miles this morning, in lieu of Church parad; The O.C. liver must be out of order, he is leading the column, he is also acting as orderly officer. Stirring things up. I am ordered to make 100 hoof pick for drivers.\n","130":"\n\nSnowing, very cold before it started. Bty. shooting this morning, instructional purposes. An order I recieved today.\n\n1st Australian Division\n\nInstructions for shoeing horses. For Farrier Sgts. and shoeing smiths. (1) The shoes must fit the foot, not the hoof made to fit the shoe\n\n(2) On no account must the frog or sole be paired or interfeared with in any way.\n","131":" No rasping of walls is permitted, except a small nick to let in clenches.\n","132":" No more than 7 nails should be used, as too many nails weaken the wall; one shoe seen contained eleven nails.\n\n(5) Nails must not be driven too high, and should shew in a level line on the outside of the wall.\n\n(7) Walls should be lowered sufficiently to allow frog to toutch the ground, except in deformed feet.\n\n(8) Heels should not be left too long, as this causes contracted heels. This is the kind of rot a man has to put up with, too many so called Farriers in the Army. I may say this order is by Col. Matson, A.D.V.S.\n\n3-4-1917\n\nA fine day, but a terrible wild night, snow, wind and rain, Grand to be in a good house. Lecture by Col. Fernshaw on stable management and wagon lines.\n\n4-4-1917\n\nSnowing again. Another rumour of a move into action in a day or two. The Somme aeria is now recaptured.\n","133":"\n\nLeaving Behencourt tomorrow at 9 a.m., going into action 4 miles from Bapaume. Weather good.\n","134":"\n\nLeft Bapaume, 9-30 a.m. Arrived at a place named Spring Garden camp 4-30 p.m., 12 miles march. A bit of a shower this evening.\n","135":"\n\nIn action Lagnicourt. Boot and saddle 8-45 a.m. Move off 9-30. Arrived at Bapaume. Camped one mile outside, 5-30 p.m. Beautiful country very level. Clean as a new pin, seemed to be cultivated. Bapaume is absolutely in ruins, not a sound house there. All trees including fruit trees cut down. Everything destroyed. The Huns were living in the cellars because, as we went through the town, one could see written up Keller, 40, Man, and so on. Huns shelling the town this evening. 10 or 11 tanks on the road disabled. All water\n\npoisoned. First day of the offensive.\n","136":"\n\nFrosty morning; Beautiful day. Three of our aeroplanes smashed to pieces, one in making a bad landing. Two in an air collision, in a cloud, one dived straight to earth, dropped a bomb, killed 3 men and wounded 2. Only one man aboard, got his jaw, one leg, and one arm broken. The 101st Howitzer Bty., two men wounded. The 6th Bty. had some men killed. A lot of men and horses killed in Bapaume last night. The broad gauge railway near our camp torn up and carted away. Rails and sleepers, only the Blue metal left. All timbered dugouts burned. The destruction was carried out on a wholesale plan. We are camped on an aerodrome.\n","137":"\n\nCold and windy, with hail and sleet, Huns still retreating. Putting up a barage to stop our advance. Ammunition 454 rounds going to Bty. Saw one of the planes that collided (No. 5772) smashed to pieces. Went to another\n\nvillage this evening, blown to atoms. Terrific bombardment last night.\n","138":"\n\nBlizzards, all day, cold as charity. In an open field, no shelter at all, wind howling all day. A few shells in Bapaume. Bodies of some women found in a well. These Huns are dasterly people. 12 casualties in 2nd Brigade. Two more of our planes smashed up, (false landing) men carried away on stretchers. We move in a day or two. Huns still retreating.\n","139":"\n\nWet cold and miserable. Two casualties in Brigade, Staff Fitter Vic Hansen of B.H.Q., and Fitter Sgt. Trewheller both killed. Our Infantry getting cut up. Ammunition going to Bty. tonight. This is the first position this winter, that we used our wagons. Now having a go for the Hindenberg line. The Somme is finished with. Lost 10 tanks last night; They are almost a failure.\n","140":"\n\nLarge body of Infantry going to line. Hopping\n\nover tomorrow night. 608 rounds of ammunition going to Bty. A big stunt coming off. Great success at Arras 4,000 prisoners, and 80 guns of all kinds including 8 inch.\n\n13-4-1917\n\nFine day, just a small shower at 2 p.m. Testing a new type of aeroplane, arrived here in cases at 9 oclock, flying them at 2 p.m. Smart work. Rumoured that we move wagon line 2 miles forward. Infantry still going to trenches. Three horses, 1st Bty. poisoned. 13 wagon loads of ammunition to Bty. tonight.\n\n14-4-1917\n\nA direct hit on one of the R.O.D. engines in Bapaume, went up in a cloud of smoke and steam. Enemy planes over our lines. One of our baloons down in flames. The village of Fountain set on fire, and blown up. A new site for a Divisional wagon lines picked out. Erecting horses lines, when the enemy put some 5.9 shells into them. Finish wagon lines. Sgt. Frank Daley of the 101st Bty. killed. He was at one time batman\n\nto Major Rabett, a smart man, one of the few that could take his place as driver or gunner. A Bdr. was also killed. Sgt. Muddle back to Bty., he was one of our original drivers. Fitter Corp. Robert reported back, he was wounded at Longueville. 1,000 rounds of ammunition drawn from D.A.C.\n\n15-4-1917, Sunday 5-30 a.m.\n\n“Lagnicourt\". Lost all of our guns. Captured by the enemy this morning at day break. The 1st, 2nd and 3rd Btys. 18 guns in all. The 101st Bty. under Major Selmes, stuck to their guns (Howitzer) and was firing at a range of 200 yards. In a few hours we got our guns back. In the wagon got orders to harness up and stand by ready to retreat. Our gunners coming to wagon lines in twos and threes. Some with dial sights, telecopic sights, breech blocks & etc. The whole trouble occurred through the Infantry patrols going to sleep. They ran through our guns, Germans following them. We got the orders to retire. Disgraceful, not a shot fired. 2-30 p.m. Enemy driven\n\nback. We now hold what was his front line; 2nd Brigade also lost their guns. Most of them destroyed. Two batman prisoners. Sgt. Moody of the 101st Bty. killed. He was with me on the peninsula, Sgt. in this Bty. Weather cold and wet. Two of our guns destroyed by the enemy. The","141":" Light Horse and the 56th Battalion were called to our assistance. Bannigan Staff fitter","142":" Bde. captured.\n","143":"\n\nOne of our baloons down in flames. 101st Bty. gun blown out, 4 men killed and several wounded.\n","144":"\n\nWet, cold, snow, and sleet. Moving wagon line tomorrow 1½ miles forward. Plenty of mud. Horses dying from exposure, getting very poor.\n","145":"\n\nMoving camp. The D.A.C. had a number of horses killed last night. Sgt. Chamberlain slightly wounded, also his horses. One of our horses destroyed this morning.\n","146":"\n\nShowery. Erected a shop today. A big bombardment on just now, 6 p.m. Vet Sgt. Bunn on leave to England, another Vet Sgt. reported this evening. A bit of a village shelled by enemy 5.9. 42 Infantry men attached to Baty.\n","147":"\n\nSix remounts recieved from D.A.C. The 1st, 3rd and 101st Bty come out of action last night. Enemy used gas during the night. Rumoured that they are still moving back. Plenty of heavy Artillery going past here. Saw a dummy railway cut in the ground, also a dummy gun, made with a log, by the Huns. Our men are constructing the heavy railway 5 miles per day, and the light 10 miles.\n","148":"\n\nFine day. One of our planes turned turtle when landing, killed one man and injuring the other. Two new Sgts. attached to Bty., Crane and Gordon. Plenty of shelling about, but none near our lines.\n","149":"\n\nWeather fine. Hun planes over in dozens. One of our baloons down in flames, Major Olding, down in wagon line, stirring things up. A big stunt coming off on the 25 inst. Anzac day.\n","150":"\n\nAnother fine day. A village in front of our lines heavily shelled 5.9 high explosive. 18 teams going to Bty. with ammunition. The stunt for the 25 inst. is now postponed till 29. Generals Coxon and Walker in lines. Everything wrong. Three horses sent to mobile Hospital. Terrific bombardment all night. The enemy attacked using gas. We drove them back. One of our guns knocked out. Crew evacuated before this happened, Hun still shelling about 150 over.\n","151":"\n\nEnemy artillery active, one of our ammunition dumps blown up. Howitzer in front of our lines blown to pieces. The 101st Bty. going into action tonight.\n","152":"\n\nA fine day, cooler than usual. Bty. coming out of action for a few days, 130 shells\n\namongst our guns. One knocked out. Two guns of third Bty. blown out. About 150 5.9 shells 200 yards from our camp, pieces were falling amongst our horses, no damage done. Gr. Isaac of 3rd Bty. killed. 22 aeroplanes and 7 kite baloons brought down by us during last 2 weeks.\n","153":"\n\nBattery out of action, with the exception of 2 guns. Going back into action tomorrow night. Ammunition going up to position. A big stunt coming off. 4 casualties in 101st Bty. and 2 in 1st Bty.\n\n27-4-1917, Fremicourt\n\nCloudy and cold. Great preparations being made for the offensive. Hundreds of guns going into position. Very busy corner, near our wagon lines. Tons of shells in dump, heavy stuff. Roads alive with motor traffic, Bombardment just started 7.30 p.m.\n","154":"\n\nFine day, shelling all about us, three shells in amongst horses at horse trough, no damage\n\ndone. Doubtful about going into action, the big stunt put off till the","155":" General Coxon inspecting again. No complaints for a wonder.\n","156":"\n\nLike a summer day. Aeroplane duel. One of ours landed, Polot shot through shoulder. The Hun machine was painted red, they are leaders of battle squadrons, very brave men; He opened his machine gun on our horses, just missed then. Voting day for the Senate and house of representitives. \n","157":"\n\nFine day. Enemy planes busy. One of our landed at aerodrome with the pilot wounded in a score of places, even the eye, in the neck etc., blood all over, lucky man to get back at all. The Bty. was ordered into action; They are now standing by. The enemy shelling terrific. The heavy railway is now carrying a lot of trains,\n","158":"\n\nWeather continues fine. Winter clothing called in. Bty. gone into action; Gas attack\n\nby enemy last night 12 oclock. Hun planes over 5-30 a.m. dropped a number of bombs. They generally keep out of range of our guns. It is now moon light mostly all night. Our planes out during the night, they carry lights. The 101st Bty. used gas, deadly stuff, the gunners wear gas helmets whilst firing.\n","159":"\n\nWagon line shelled today with 9.2 inch. 8 horses at shop shoeing, all bolted, men and horses everywhere, Three of these shells landed from 10 to 15 yards from my shop; I left. Saw a horse lifted bodily into the air about 40 feet. One shell went through a railway truck on the line, lifted the top clean off. This truck was loaded with ammunition. One man killed on railway. Vet officer of 2nd Bde. knocked over with a lump of France. One of our drivers, had a shell burst at his rear, he fell into the hole, not hurt. The big stunt come off in the morning. One million men ready to hop over, Our guns are blazing away. Two of our Bty. guns blown\n\nout, no one hurt. Dropping shells in the Bty. all day. 17 shells in and around our lines, all 9.2 inch high velocity. 600 rounds of ammunition to Bty. Another lot in just now 8-30 p.m.\n","160":" Writing at 2-30 p.m.\n\nThe attack started this morning at 4 a.m. with a terrific bombardment, which lasted till 10 a.m. We captured his first and second line trenches. Casualties very heavy. 1,000 rounds of ammunition to go to the guns. This is the first time that it has been sent up in daylight. Enemy shelling a big gun position on our left. Weather fine, but a little windy. Hundreds of 18 pdr. wagons on road. 8-30 p.m. Eight G.S. wagon loads of ammunition roughly 1,000 rounds recieved. Another stunt just starting.\n","161":"\n\nAnother issue of shells in wagon line. Railway line blown up, A direct hit on road, square stones hurled hundreds of yards. These shells were so close that we\n\ngot orders to move wagon lines. 200 rounds of ammunition sent to Bty. last night. Things quiet now, not a gun firing. Another 1,000 rounds just sent to Bty. No news from front. 9-30 p.m. Enemy planes over, dropped 3 bombs. Vet Sgt. back from leave.\n","162":"\n\nThunderstorm. Now in another wagon line. 400 yards from the last. Recieved 900 rounds of ammunition. No shells in wagon line. Capt. Hogan returned. I have to report, if any horse not able to do three days journey. Some move coming off.\n","163":" 8 p.m.\n\nBombardment last night. Cold change, terrebly windy. 800 rounds of ammunition going to Bty. position. General Coxon in lines.,\n","164":"\n\nTerrible day. 8 inch armour piercing high explosive, base fuze shells all over the place; Evacuated the horse lines six times during the day. The amount of damage done\n\nwas slight. The only man hit was one in 5th Bty.; He was hit with one of our anti-aircraft gun shell cases. Cut a piece out of his arm, and cut his foot off. The case was dug up later, it contained the piece of flesh, also a piece of leggin, boot, sock and leg. One shell landed on a stack of harness in 6th Bty’s lines. It was plastered on the sky. These shells make a hole about 16 feet across and about 10 feet deep. All the ground about here is soft. Major O’Gorman V.O. on leave. More ammunition going to Bty. Hun plane over at 2 a.m. firing his machine gun.\n","165":"\n\nRaining all night; cleared up at 1 p.m. Plenty of mud again. Capt. Lucas V.O. attached to Bty. Very quiet day. Rumoured that we move in a day or so. Bit of a stunt on 6 p.m. Too foggy and misty for aeroplanes and baloons. Huns got one of our dumps last night, 6 in. Naval ammunition.\n","166":"\n\nWeather fine, A German mine exploded\n\nthis evening, killing 2 men, A few yards from our lines. Hun counter attack during night. Our people answered him with a terrific bombardment. In which the heavies joined. Lieut. Hogan’s groom just landed, been lost two weeks, hell of a row. Hogan is going to draw and quarter him. Appears one horse went lame, and could not travel, so this Australian made the best of a bad job, put up at a village, and had a royal time. 8-30 p.m. Sun just set.\n","167":"\n\nRaining. Some of our planes about. A few 5.9 shells on a big gun position. These guns are just in front of a Hospital. A bit of a stunt on Artillery firing like fury. Raining in torrents. O.C. in wagon line.\n","168":"\n\nMoving camp near Haplincourt. Three miles away. Started at 10 a.m., still going, now 3 p.m. I am waiting for a wagon to move my stuff.\n","169":"\n\nTwo Hun baloons brought down by our planes. Hospital shelled. Two men killed. B.S.M. going to sea side, also Lieut. Morris, for two weeks rest. Taking up new position, guns pulled out last night at 12 oclock. A few shells over on our right this evening. Our planes over enemy line flying in fives and sixes. Weather fine but dull.\n","170":"\n\nRelieved the 17th Bty. 2nd Division. They go away this morning at 7 oclock. They left the camp in a filthy condition, Our lines are in a wood, Velu, Wood. The Huns used this place for a horse line. The Doctor condemned these line; Living along the edge of the wood On Sgt. seriously wounded, and 2 horses wounded. One Bdr. killed in 1st Bty. It was fair hell. In a wood near us is a Chateau, the owener was out to have a look at it yesterday. When he saw it, he cried like a child, and well he may. One mass of\n\nruins. The only thing not blown to atoms, was the gate of the drive leading to the Chateau. This part of the country differs a little from the rest, seem more fertile. The tree almost in full leaf, they are not evergreen. The weather is warm.\n","171":"\n\nRaining this evening. Things quiet. Horse lines in a terrible state, under water. Generals, Colonels and etc. inspecting our lines. One will come along and say, horses looking well, another will say not half as well looking as the Infantry, and so it goes on day after day. Hun aeroplane over just before dark having a good look.\n","172":"\n\nWeather still unsettled. Terrific bombardment all night. Visited the Chateau, Owned by a French General. The first part was built in 1719, another part in 1863, and the remainder in 1890. Just previous to the war, the owner expended 1¼ Million Francs on improvements. Two mines were discharged\n\nin main building; Scarcely a brick upon brick left. The stable, which appears to be a racing stable, was destroyed by fire. The names of the horses are still in frames on the wall in each stall; Some of the names are Lydie, Courcelette, Black, Tom. The feed place was enamelled iron, likewise the drinking vessel. The garden is destroyed; a garden path with an avenue of apple trees trained on trellis work, were cut down with an axe. All fruit trees in orchard blown down with explosives, the only fruit not toutched are the currant bushes. They are loaded with green fruit. The green house is in one mass of ruins, flower pots strewn everywhere, and to cap all, between 500 and 600 Germans are buried in the front garden. What troubled the owner most was the felling of the trees in the wood surrounding the Chateau. Hundreds were chopped down falling across the road. This wood was also used by Huns for horse lines.\n","173":"\n\nWet and wintry. Very trying weather, Hot for a few day, and then a change, almost freeze you. Very quiet today. A little Artillery activity just now 7 p.m. Visited the village of Bertincourt, about 1½ miles from here. We are midway between the above named place and Velue. Terreble wreckage, not a complete house there. With the exception of a dozen Tommies, the only living things there are a few cats. In the centre of all these villages, are large ponds of water, where the villagers water their horses. This particular one is marked poison. There is a grave yard containing about 200 graves (Germans) and in the middle is an Englishman’s grave, Pte. Davies, 10\/3\/17 inscribed on a wooden cross. This was erected by the Huns. This yard was in perfect order.\n","174":"\n\nDull day. No rain, getting relieved by a Tommy Bty. on the 18th inst. Going to treck \n\nsomewhere. The Bty. in a quiet spot, no shooting since we moved into this position. No aeroplanes about, too misty. District orders tonight reads, No Gunner or driver will ride on limber or wagon, Signed General Gough. This is on account of poor horses. Although our horses are looking better than ever. Coxon in lines. All horse rugs called in, and blankets, with the exception of one per man.\n","175":"\n\nB. Bty. 142 Bde. are relieving us, half of their Bty. going up tonight. Half of ours coming out. Move from here on Sunday 20th inst. Our aeroplanes busy. A few shells over this evening.\n","176":"\n\nBit of a bombardment lasting ½ an hour. Moving off tomorrow morning.\n","177":"\n\nLeft Velue wagon line at 6-15 a.m. Arrived at Albert, 1-30 p.m. Weather fine. All gunners had to walk. Feet inspection 3-15 p.m. Doctor\n\nsending in a report. Staying here tomorrow.\n","178":"\n\nOne or two showers today. Weather now fine; Wagons loaded ready to move in the morning, enroute for Behencourt. One driver kicked, fractured arm. A number of our planes damaged, brought in on Motor lorries, also tanks. 1st Division of Infantry passed through today.\n","179":"\n\nRaining this morning. Left Albert at 6-30 a.m., arrived at Behencourt 11-30 a.m. This evening is fine. In the same billets as before. Everything is looking grand, trees in full leaf, grass a foot high. Oranges 3½d. each.\n","180":"\n\nAnother fine day. Shod 4 horses from the school, which is still here under Col. Anderson. Waiting 3 week for us to come back. The","181":" Brigade Farriers shod a horse or two, and pricked one with 4 nails out of six. Terrible row over it. The Vet Officer operated on a horse. This horse\n\nA new idea in buffers, istead of springs, air will be used. Put in all evening repairing pump at baths. The","182":" Bde. has taken over these baths, and working them for the Division, Sgt. Todd N.C.O. in charge.\n","183":"\n\nSgt. Major returned form sea side, No bon he said. Have to attend parades, and route marches. Great activity conserning this competition. One Sectional Officer is giving 50 Francs for the best set of harness in his section, and 25 Francs for the next best.\n","184":"\n\nFine day. The Bty. has the afternoon off. Great preparations for this harness competition. Major Olding on Blighty leave.\n","185":"\n\nFootball match, won by 2nd Bty. Australian rules. Amiens leave cut out for three days. By getting very regimental, duties carried out in fine style. Drivers grooming, jackets off, braces down, and shirt sleeves rolled up,\n\nLines as clean as a new pin. All manure carted away in G.S. wagon.\n","186":"\n\nContests, Picking out best men for certain events. Weather fine.\n","187":"\n\nBoxing contest. Driver Cook, heavy weight 1st Bty.\n","188":"\n\nFine day. The 3rd Bty. won the tug-o-war. We meet the 101st Bty.\n","189":"\n\nLieut. Hogan, to be Captain. Harness competition on this evening. Horses looking well, Singing to be carried out on a few with long hairs. The horse master here almost every day. King’s birthday. Lost the Tug of war to the 101st Bty., who will pull the 3rd Bty.\n\n4-6-1917\n\nHarness competion, One section from each Bty. Col. McLaughlan, assisted by Capt. Little, Capt. Lucas V.O. and Lieut. Strong, judges.\n\n5-6-1917\n\nBoxing contests, best in Brigade. Best subsection won by 3rd Bty. 1st and 2nd place. Our Bty.","190":" place. Best gun and team from each Bty, now competing. Weather fine.\n","191":"\n\nFeather weight, semi final. Driver Hollis 101st Bty. Bty. winner. Middle weight, Corp. Nelson 2nd Bty. Best gun and team postponed untill the 12 inst. Major Olding back from leave. Lieut Archer returned from Paris.\n","192":"\n\nThunderstorm this evening. Boxing contests on this evening. Corp. Nelson of the Bty. won 2 bouts. The day has been very hot, Capt. Hogan going to D.A.C., Capt. Wilkinson coming here.\n","193":"\n\nToday recieved 6 remounts, the men were away 2 days. Divisional sports finals tomorrow. Our Brigade is handing over six guns to the 5th Army Corps going to spring gardens camp, a two days trip. Fitter Sgt.\n\nGyson out of dock, he was hit on the chest with the recoil of a gun.\n","194":"\n\n1st Divisional sports finals this evening. ","195":" Bty. on top with 6 firsts, 3 seconds, and 2 third prizes. The boxing, light and middle weight, was won by Corp. Nelson of this Bty. He met Barry, and Keogh. The running, 100 yards, Elphick, 220 Elphick. The day was hot. A number of Generals there, including Coxon, Bessel Brown, Milne, Col. Matson and Fernshaw.\n","196":"\n\nThe change of Captain in Bty. is again altered. Hogan remains here.\n\n11-6-1917\n\nThunderstorm early this morning, General Walker in lines. He said, that peace is likely to be anounced at any time, and that this is the first time that the Army Corps has mentioned this subject. Muster parade at 3 p.m. inspection by C.O., and reading out Court Martial. 60 days 2nd field punishment awarded to driver Mcdonald.\n\n12-6-1917\n\n1st Divisional Artillery and Infantry sports. Contest for the championship, of the","197":" Australian Division. I was sent for by the C.O. wanted to know if I would like a trip to Paris, or a spell at sea side. I refused. The team competition will take place tomorrow. Rain has just started.\n","198":"\n\nDivisional sports continued. We got first prize for gun and team, 12 points to the good. Elphick won the 100 and 220 yard foot race. Today we gained 3 firsts and 2 seconds. Blue ribbon put around lead horses necks of gun team B Sub-section. Whilst at the sports the order come through to go to line, the Germans had broken through a Lagincourt . Just as we were getting away, the order was cancelled. The","199":" Bty. is on top as regards prizes in the Artillery Division.\n","200":"\n\nTent pegging, one first, and 2 thirds. Nothing doing. Weather fine.\n","201":"\n\nHot day. General Coxon stirring things up in 3rd Bty. lines. He was there from 9 a.m. till 12 noon.\n","202":"\n\nSgt. Major Fitzsimmons recommended for a commission. Muster Parade at 9 a.m. O.C. inspection. New officer attached to Bty.\n","203":"\n\nMuster Church Parade, weather hot. Lieut. Heppingstone, new officer. Capt. Hogan back from Paris. Lieut. Morris on Blighty leave.\n","204":"\n\nThunderstorm, very little rain. Rumoured that we move into action this week.\n","205":"\n\nThunderstorms prevails. Move into action tomorrow. Reveille 3 a.m.\n","206":"\n\nLeft Behencourt at 5.20 a.m. Arrived spring garden camp 11 a.m. Raining at 3 p.m. Off again tomorrow. Two shoes off on march. Shod 4 horses this evening.\n\nMaking for Bapaume. Weather fine now 4-30 p.m.\n","207":"\n\nReveille at 4-30 am. move off at 7-15 a.m. Arrived at wood, between Velu and Bertincourt at 12 noon. Relieving the same Bty. that relieved us. A couple of shells landed in wood yesterday, and wounded 2 men belonging to B Bty. 241 Brigade.\n\n22-6-1917, In action Diognes\n\nThe right and centre sections going into action tonight 9-30. Flooded out last night. Thunderstorm. 5 remounts recieved. \n","208":"\n\nLeft section going into action at 9-30 p.m. The position is Diognes. About 3 miles forward B. Bty. 241 Bde. Move out tomorrow.\n","209":"\n\nFine but cloudy. The 241 Brigade marched out this morning at 8 oclock; one of our men Hewson O.C. batman, slightly wounded. One of our guns blown out. Wheel off, dial sight blown away. All villages about here, out of bounds for\n\nAustralian troops. Sgt. Crane acting Sgt. Major. Sgt. Major Fitzsimmons promoted to first class W.O.\n","210":"\n\nAnother gun blown out. One man killed and 4 wounded in 6th Bty. General Coxon in lines. Tin hats to be worn at all times. I am busy shoeing.\n","211":"\n\nFine day. A rumour that the remains of the 1st Division will be going to Australia in August on furlough. Cap. Hogan said that he got it from a Staff Officer. No officers to go. 2 shells over, one Hun aeroplane over. Ours very busy.\n","212":"\n\nShowery. Centre section moving forward tonight. Guns back from workshops repaired. Sgt. Galloway back, he was wounded at Xmas time. Artillery active. The enemy shelled wood in front of our lines.\n","213":"\n\nIndications of more rain. Things very quiet. Lieut. Morris returned from Blighty leave. Rumours that we treck north shortly. Vet Officer checking my tools.\n","214":"\n\nAnother gun out of action. Had to send a team to Bty. position at midnight, to pull it out. Heard that my brother come to France on escort duty. O.C. in wagon lines. At 8-30 p.m. a violent thunderstorm. The enemy shelled on the right of wood, in front of our lines, at it all day. Reinforcements arriving for the Bty., men who have been away 8 or 9 months.\n","215":"\n\nWet all day. Cold snap. General Coxon inspecting lines, finding a lot of fault. Sgt. Galloway to report to Vet school at Haverness. Rumoured that we move out on the 4-7-17.\n","216":"\n\nShowery all day. Muster Parade, gas helmet inspection. Centre section\n\ncoming out of action tomorrow night.\n","217":"\n\nFine day. Saw today Major Heslop, he is now A.D.V.S. of this Division. He inspected our horses, asking me how I was getting on. Some big shell coming over near the water trough, about ½ mile from here. Hun aeroplanes over. The enemy got a direct hit on the railway line, almost carried away a bridge, missing it by inches.\n","218":"\n\nTaking 4 guns of the relieving Bty. into position, and bringing 4 of our out; going to workshops. Gas alarm at 10 p.m. Hooters and whistles blowing everywhere. Gas cloud coming over, it did not reach us. We have a percentage of horse gas helmets issued. When this gas is on, our guns open up, to try and break it up. The Artillery has opened up now 10-30 p.m.\n","219":"\n\nRaining in torrents. Another gas alarm last night at 11 oclock. Heard that Lens had fallen, Great movements of troops, particularly Infantry. A large number about our camp; no room in the trenches alloted to them. Four of our guns gone to workshops.\n","220":"\n\nFine day. Some of our gunners coming down from guns. The number of men who took part in the Pozieres attack in July and August, to be wired to Bty. Artillery very active on our front. Filling up with ammunition.\n","221":"\n\nHun aeroplane dived on one of our baloons, brought it down in flames. Enemy shelling the wood in front of our lines, all day with 5.9 high explosive.\n","222":"\n\nReveille at 4 a.m. Move off at 8-15 a.m. Arrived at Becourt Wood 2-30 p.m. My horse lame, injured knee, The whole 1st Division of Artillery camped here. Don’t know where we are going. This camp is near the noted\n\nSausage Gully, where a lot of our men were cut up last July and August.\n","223":"\n\nTerrific thunderstorm at 3 a.m. Lightning struck at tree in wood, shattering it to pieces. This evening is fine but windy. Memorial Service at Pozieres, unveiling a large wooden cross. Representitives from each Bty. present. Rained in torrents.\n","224":"\n\nStill at Becourt Wood. Brother Vance joined us here, Attached to 2nd Bty. General Coxon in lines; The horse Master was with him. The boys nicknamed him Colonel Headcollars, on account of always finding fault with head gear. Rumours of a three days route march. Passing the starting point at 4 a.m. And ending at 10 a.m. the first day.\n","225":"\n\nGreat stir up. Reveille tomorrow at 1-30 a.m. All vehicles packed today, boxes of horse shoes carried on limbers. Medicial examination today for Scabies; Guns back from workshops.\n","226":"\n\nOn the road, passed starting point 4 a.m. Arrived at “Sarton\" 9-45 a.m. Off again tomorrow at 6 a.m., going about 15 miles. I am told that we are trecking to a new front. This is likely to last six days. On this stunt we have one meal per day. Weather fine.\n","227":"\n\nReveille 4.45 a.m. Move off at 6.30 a.m., arrived at Rebreuviette 11-30 a.m., covered about 15 miles. Day fine, and hot. The church here, built in 1785.\n","228":"\n\nReveille 3-30 a.m. Move at 5 a.m. Short march 7 miles, destination for today Ostreville. About 1½ miles from St. Micheal. Spell tomorrow. Weather fine.\n","229":"\n\nMoving again tomorrow. Reveill at 1-30 a.m. Move off at 3 a.m. Supposed to finish day’s march at 2 P.M. The day is hot with thunderstorms. Hospital train full of wounded passed through here this evening. The local blacksmith very busy, cutting and shutting\n\ntyres. Col. Anderson in charge of Brigade again. Major McLaughlan in charge of 1st Bty.,\n","230":"\n\nMoved off 3-30 a.m. Arrived at Ames 9-45 a.m. Raining like fury. Looking at local R.C. Church built in 1603. In good billets.\n","231":"\n\nMoved again 6-30 a.m. Arrived at a bit of a village. 2 kilometres from Aire. Weather fine. Off again tomorrow. This stunt is playing havoc with shoes; when we halt at a village, I have to start work. The town of Aire is a large place. Appears to have been bombed lately, marks on some of the shops. Seven men per sub-section granted leave to go to town. Lieut. Archer, back at Bty. Getting near the firing line, in sight of a baloon.\n","232":"\n\nMoved off 6-30 a.m. Arrived at Staple 10 a.m. Trip of 10 miles.\n","233":"\n\nReveille 3-30 a.m. Move at 5.30 a.m. Camped now between Godewaersvelde and\n\nSteenvoorde. Arrived 10 a.m. Very bad billets. Lieut. Morris gone to D.A.C. Lieut. Seagraves from D.A.C. coming to Bty. This is the 3rd time we have been at the town with the unpronouncable name. Almost in Belgium. Rained most of the day.\n","234":"\n\nReveille 3-30 a.m. Move 6 a.m. Arrived at Rennehelst 10 a.m. Our second time here. Hundreds of wagon lines here. 14 men dead on a G.S. Wagon, gassed with a gass shell. The enemy shell this place occasionaly. Weather wet and windy. Guns go into action tonight. Enemy shelling road heavily. Tight go to get our guns into action.\n\n"}}