{"Document Name":{"0":"Diary_0125","1":"Diary_0125","2":"Diary_0125","3":"Diary_0125","4":"Diary_0125","5":"Diary_0125","6":"Diary_0125","7":"Diary_0125","8":"Diary_0125","9":"Diary_0125","10":"Diary_0125","11":"Diary_0125","12":"Diary_0125","13":"Diary_0125","14":"Diary_0125","15":"Diary_0125","16":"Diary_0125","17":"Diary_0125","18":"Diary_0125","19":"Diary_0125","20":"Diary_0125","21":"Diary_0125","22":"Diary_0125","23":"Diary_0125","24":"Diary_0125","25":"Diary_0125","26":"Diary_0125","27":"Diary_0125","28":"Diary_0125","29":"Diary_0125","30":"Diary_0125","31":"Diary_0125","32":"Diary_0125","33":"Diary_0125","34":"Diary_0125","35":"Diary_0125"},"Date":{"0":"unknown","1":845.0,"2":851.0,"3":855.0,"4":861.0,"5":862.0,"6":863.0,"7":864.0,"8":865.0,"9":868.0,"10":872.0,"11":878.0,"12":879.0,"13":886.0,"14":887.0,"15":897.0,"16":898.0,"17":899.0,"18":900.0,"19":901.0,"20":903.0,"21":905.0,"22":906.0,"23":910.0,"24":911.0,"25":912.0,"26":915.0,"27":917.0,"28":918.0,"29":919.0,"30":922.0,"31":923.0,"32":925.0,"33":926.0,"34":928.0,"35":932.0},"Entry":{"0":" It is now ","1":" & - God help us we are still here. The other night all amenities of the Scotch brigade caught fire or was set afire and at about midnight there was a noise like a demonstration at Pope’s.\n\nIt was a Sohag a few days ago that I had my first introduction to \"Habhan\". That is the Arabic for it; what the English is I don’t know, it is a small seed or grain that they put into the coffee which makes it delicious it is just as if a drop of Benedictine had been put in it.\n\nYesterday there was the most unpleasant & most impressive sandstorm that I have yet witnessed in this land of sorrow. It was like an enormous curtain of dust stretching from the earth right up to the clouds, breaking down on one, swallowing up the country as it came. There was not a breath of wind until the curtain of dust was about 20 yards away & then, in a second, one was in a swirling dusty twilight & objects more than two or three yds away were invisible. It lasted an hour & was said to be the worst they have had for six years.\n","2":"\n\nStill here and apparently every probability of staying here at Sohag for some time yet.\n\nA propos of the sandstorm that I have just described I was going to add that Fortunately these visitations only occur in the daytime! But since then we have had a beauty in the middle of the night, which is certainly rare as far as our eighteen months or so experience of this country goes.\n\nAnyway we all went to bed at the appointed time like happy little innocents, some inside the\n\ntent & some outside. Fraser & I remained inside but we had all the Flaps up. At about 11.30 up comes a strong gusty wind, it was very hot & we welcomed it at first, then it blew stronger & stronger. I got underneath a blanket until I was nearly suffocated & the perspiration was pouring off me, then we both made a dash & let down the flaps, got about three hours sleep out of the night & got up in the morning looking just like sweeps.\n\nThe following night in \naddition\n \n\naddition to a few of my usual bedfellows, to wit, fleas, I had another friend. I woke up in the morning with a large tick on the back of my \nright\n neck. Truly this is a charming country. It must have been very unpleasant here during the plagues, that is all I can say!\n","3":"\n\nLast Sunday we were stung again \"Stinging\" by the way is the vernacular for innoculation. On Monday we were all looking at the world & the horse lines in particular with a very jaundiced eye.\n\nIt is a most extraordinary thing but every time I come off first picket I seem to be fated to meet the drinks of the evening. Last time it was Macrae, our D.C.H., very voluble, asserting that he was in charge of the Picket & that I would ‘do him’. Last night it was Alf Boucher, the cook, who arrived just after I had got into bed, also voluble, & positively wrapped up in beer bottles, - he produced them like a conjurer form all over his person -. He paid me 10 piastres which I had lent him a few days back & insisted that I should drink a bottle with him: I demurred until he declared that he would ‘pour it\n\nall over me\"…. We parted the best of friends. This morning he came to the tent & paid me the 10 piastres over again, but to his great astonishment I returned it. I then explained, and ----- he retired from the unequal contest.\n\nTwenty reinforcements arrived today thank goodness: of late we have been leading two & sometimes three horses apiece for exercise. The sickness here is as bad as on the Peninsular.\n","4":"\n\nThe heat now is getting beyond all reason – 116 &degree yesterday 116 &degree today But, thank god, as yet there are\n\nno mosquitos.\n\nGeorge Hamilton & two others went down to Cairo on leave yesterday. They will be drunk for forty eight house about & George will come back with a broad smile, eyes rather bloodshot & face a shade redder, but otherwise perfectly well. He told us \nthat\n before he went, that he & \n\nGerry Chandler were going to get a room at the National, George would be in bed one side Gerry on the other; on each table at each bedside there would be a bottle of whiskey: They would wake each other up at intervals during the night and \"have a\n\nsip’ & thus be well oblitterated when they got up!\n\nAnother instance of war economy – of time – I suppose of Late we have had to keep our candles in a bucket of water to keep the, from melting into the Jam or over our clothes as they have been known to do lately.\n","5":"\n\nNow that I am out here at the \"palms\" I may as well describe it. We often come out here nowadays more often than not, in fact, because the heat is too great for the horses standing out on the lines with no\n\nshade; N.B. too hot for the horses not the men …. However, we have come out today to a new palmgrove it certainly is a trifle better than the last place but -. I have no doubt that just taking into consideration the main facts & overlooking all details, it appears idyllic, – the manner in which we spend our days. Take the facts. We saddle up & take two horses out to a shady grove of date palms, where we tie up our horses, eat our lunch & laze the day away with book or cards, lying full length on the shade; Then we leisurely ride back to camp in the evening. Does n’t it sound\n\ndelightful? Now take the details. It is about 95 &degree F when we start for the grove, hence we arrive these4 covered in sweat & grime & melted dubbin from off the reins: Then, having tied our horses up we spread out a saddle blanket now on the green sward as perhaps the imagination would depict in a palm grove, but on a very fine dirty black dust, which harbours every kind of offensive wog from fleas to big black beetles that defy classification.\n\nMeanwhile the thermometer rises steadily higher & higher & one drags ones weary way around the tree\n\nin pursuit of the somewhat inadequate shade it probably affords. The flies pester one whenever there is a lull in the scorching, dust laden, wind of \"Khampsine\" \n\nThe last mentioned, by the way, is the \"wind that blows for 50 days\" during the better part of April & the month of May; \"Khampsine\" is the Arabic for 50.\n\nPerhaps now you cease to wonder why this scrawl is filled with curses on Sohag and all things Sohagish?\n\nLast night we had a concert which was honoured by the presence \n\nof \"His excellency the Muller of Sohag & surrounding districts\"; I was not impressed by him, he wants dieting & a strict course of Saullows, like all native bigwigs. He retired at half-time among shouts of good night. Happy New Year etc.\n\nCharlie Cox the brigadier was also present to declare the concert well & truly open. I went there mainly to hear what he would say. I expected him at least to refer to the landing – as it was the anniversary - & possibly to let fall a few hints as to what he thought we should be doing this year: Instead of which he merely introduced\n\nthe Muller & then proceeded \"I am very pleased that you are having a concert. I should like to see more of them; they keep the men together & gives them something to think about of a night. I wish you every success.\" Illuminating, wasn’t it? needless to say as all beer & spirits are now taboo in Sohag the concert was just about a very poor success.\n\nI understand that the Mudir is going to give the troops a days sports, on the","6":"\n\n God grant we shal’et be here!\n","7":"\n\nHaving now nothing of import to do, think, say, or read as is too often, unfortunately, the case; a description of my immediate surroundings would not, I think, be without interest. \nFor muyse\n \n\nFor myself, I am lying inside the tent writing, exuding a gentle sweat, for although it is dark & well past seven oclock it is still fiendishly hot & close. \n\nMy friend & co-mate in exile who has his \"posie\" next the door amid the blessed\n\ndraught & the cursed dust, is seated at his correspondence, giving one the impression of a bird with a fountain pen – I notice that most of the time it is in his mouth – for a break, brooding in a dowry nest of note paper, composed of the numerous letters he has received \ndur\n in the course of the last five mails or so.\n\nThe next man, who sleeps next to me is just outside the tent engaged in a hot argument, to his shame be it said, for he is on first picket & should\n\nbe keeping a faithful watch & ward on the horselines. On the opposite side of the door, directly opposite to the burst of correspondence stand an imposing row of four \"Goolahs\" big porous earthenware jars, all empty at this hour, mute yet eloquent testimony to the eternal thirst produced by this waste of dust & dryness.\n\nNear them lives another member who has followed the fortunes of this corps from its birth through its greatness to this present state of stagnation in which it lies. He is lying \n\nstretched full length, & it is a long length too – approaching six foot three – seeking a monumentary oblivion in sweaty slumber from the cares of this world, with his head on a heterogenous mass of dirty shirts, socks & handerchiefs which for the moment constitute an excellent pillow.\n\n A murmur of voices comes from outside the tent, for the most part indistinguishable except when some voice takes individuality as it is raised in indignant expostulation or denial. In the distant mess\n\ntent the gramophone shrills out its well known songs & tunes most of the, heavy with age.\n\nOver everything the hot still atmosphere hangs giving one the impression of being baked in a slow oven; all things are hot to the touch, even the candle cannot stand unprotected.\n\nSoon, very soon now, the first post will be \nlag\n languidly blown \nby\n and one will prepare for what one calls bed with a sickening knowledge that tomorrow \nwill be possibly the \n , the night after & the night after that will all be precisely the\n","8":" \nwer\n trivial round of wearying monotony.\n","9":"\n\n\"The happiest day of all the glad new year\" Most emphatically NO!\n\nHowever I think somehow that things are looking up a little. I expect to be in Tal el Kabir shortly & then \"Hey, for the Persian Gulf\".\n\nTruly things are becoming unbearable here now.\n\nMice wake us up from our sleep by running over our faces. The other night I caught\n\na centipede crawling up my leg & Frances caught a tarantula with the same object on him. They are beastly things, however ‘de mortuis’.\n\nRumour is getting busy at last down at the brigade forge, It is the Press bureau for the brigade. The Smiths swear & sweat working to the tunes of \"Jesus loves me; I don’t think\", \nusually no\n They seem to work better to that tune than to any other.\n","10":"\n\nWe are supposed to be moving shortly – I hope to goodness that it comes off – and mean while I am \nsupposed\n somewhat exercised as to how I am going to carry all my stuff.\n\nWe are supposed to be travelling light i.e. one is permitted to carry what one can get on one’s horse & a few things rolled up in ones blankets. I have managed – by means of honeyed words in the ears of one of the drivers of the \ndrill\n transport wagons to bring along with me a small infantry pack also. But now\n\nit will require some ingenuity to get all my stuff along on this next move. I have a saddle and bridle, grooming kit, heel peg, ‘toggle rope’, water bucket, mess tin, feed bag, great coat, & water proof cover for my saddle & a chain bead rope – all that poor unfortunate \"Bernard\" M.C. Evan’s ch.g., will have to carry . In addition I have two blankets Two prs of breeches, two pairs of trousers Two coats, one suit of pyjamas, two prs of boots, a sun helmet, a slouch hat, a cap. Three shirts, two singlets, 6 or 8 prs of socks, one cardigan jacket, one haversack, water bottle & numerous small trifles such as a towel\n\nshaving gear, pipes & tobacco, hair brush etc etc. Yea God’s & I am travelling light! Yet one thing is certain, it will all go. I think I could hold my own with mother at packing now & the more \ncomf\n comfortable it is.\n","11":"\n\nWe were delayed from moving last week for some reason or other, but we are going for certain this week. I think on Sunday for I have just seen the orders from Headquarters.\n\nWe are going down to Kantara which is right on the Canal.\n","12":" tomorrow there will be alarms & excursions I suppose & poor old Jackie – our 8 hr – won’t know whether he is on his head or his heels and the hard workers will do all the work while the pointers take a holiday & do nothing; Oh! I could map out the programmes of the next few days as accurately as if they were already past! – But I had better not anticipate. Let it suffice to say that we are at least about to shake from off our perspirings feet the thrice accursed dust of Sohag.\n\n\"Hill 40\" \n","13":"\n\nNow we are quite the other side of Egypt altogether, but I had better record how we got here first.\n\nWe managed to get all our horses & stuff on board the train at Sohag by about 9.30 on Sunday night.\n\nI provided a very fitting climax to my unpleasant stay at Sohag by losing my money belt with a fiver in it just before we left. \n\nWe spent an uncomfortable night in the train. I slept in the alley way being continually\n\nwoken up by the mud \nfrom\n dropping on my face from the boots of the man sleeping on the seat above me.\n\nWe stopped however at Beue Sueff & Zagazig to water & feed so there was ample time to wash.\n\nWe arrived at Kantara at about 6 in the evening & were encamped about 15 minutes walk from the canal.\n\nThen I experienced two of the hottest days of my young & tender life; 124 &degree F in the shade with a hot wind that feels like a blast from the biggest furnace\n\nGod ever made, one simply dried up it was impossible to sweat – but it defies description.\n\nThen yesterday morning at 2 oclock we crossed the canal by the pontoon bridge & rode out to this spot – \"Hill 40\" it is seven miles from the canal. There is a limestone road running out here also a railway which is nearly standard \ngage\n guage & there is a meagre supply of water laid on: so all things considered we are very well off. Though \nyest\n yesterday we had to wait an hour\n\nand 40 minutes to water our horses \nwhich by the way is pure cruelty in this heat\n \n\nThe last two days have been beautifully cool owing to a North Wind but God help us if we get a South wind.\n\nThe transport has remained at Kantara \nas\n further than this all transport work is done by camels & I should not be surprised if they gave us Camels in place of horses.\n","14":"\n\nI am unfortunately, today on day picquet so I am going to sneak enough time while the horses are\n\nfeeding to write a little more about this spot. Our Division the HM. is holding \nof\n from \nhere \n the sea to Tsmailiah: But I can of course only describe the defences or the actual way by which we came out. Having crossed the pontoon bridge over the Canal, imagine in front of you a fairly good limestone road on both sides of which are encamped battalion after battalion of infantry. This continues for perhaps, a mile and half, then, about half a mile after the last of the tents, we come to a system of trenches running as far as the eye can see north & \n\nsouth from the road which, of course runs about almost due East.\n\nThe Trenches have of course their usual complement of murderous barbed wire \n\nAfter this the road leads away out into the distance like a great white snake wriggling in & out of the dull neutral tinted sand dunes, occasionally one passes a salt lake two or three feet deep – for it is very little above sea level, - but there are no more signs of camp life until one reached \"Hill 40\" which as its name implies is nothing more than a slight mound.\n\nAs I declared I would, I managed to carry all my clothes etc with me to Kantara, but now I am really travelling light as I left everything there except one blanket, one shirt, & 3 prs of socks.\n\nLast night I had a severe shock, I dined off some boiled meat, both cold & greasy, & found to me horror & astonishment that I was enjoying it immensely! Truly its time I returned to civilisation.\n\n\"Romani\"\n\nEnd of May\n\nWe have moved out from \"Hill 40\" and are now 20 miles further out, making the distance from the canal in all about 30 miles & quite far enough too.\n\nWe started at 3 o’clock yesterday morning with just as much as we could pack on the saddle.\n\nWe first traversed a sandy ground interspersed with large & frequent hummocks of desert vegetation, then , descending a steep bank, came out on a species of swampy marsh – evidently one of these salt lakes just dried\n\nup – our last stage was across pure sand, heaped into every shape & position, terrible going for the horses but really rather a pretty sight to see the long column of horseman climbing up & down \nin sand of\n in & out amongst the enormous orange coloured sand dunes set off by the deep blue of the sky. In fact read any decent fiction books’ account of the Azure sky, golden sands etc & you have it. there were only these two main colours, as there was no vegetation or trees.\n\nThe horses got not water until we\n\narrived here at about 10 oclock so they had a pretty poor time; mine kept on trying to bite into my water bottle.\n\nNow we encamped in a tiny little palm grove with enormous sand dunes two sides of us & underfoot brackish water about two feet down. A very fair place for a desert camp.\n\nThere is a railway out here so we don’t do so badly for food but all our drinking water comes by train so it will be very scarce if we have a heat wave.\n\nHowever at present we are very comfortable, we have a tent pitched under a palm tree: At the side there is a well for washing water made by the simple process of digging down a few feet & sinking a punctured kerosene tin; \non a\n while on a neighbouring tree hangs our home-made shower bath also constructed out of the ubiquitous kerosene tin which one fills, \nhulls\n hauls up to a branch by means of a pulley & dashes underneath \"in pures naturalibus\" as Mr Hinchcliffe says. At the tent door stands our kitchen range, yet another kerosene\n\nalso\n tin, also ‘treated’, by means of which we make cocoa o’nights for the stomachs sake.\n\nTruly a nomads’ paradise.\n\nThe evening of the same day.\n\nI might have known some judgement would have been visited on me for the above lines of my satisfaction. Now DAMN all kerosene tins, tins of every kind, both big & small, round & hollow, but most eternal and everlasting be the damnation of the particular tin on which this evening I cut two of my right hand fingers. After which to crown my disgust a miserable\n\nbeast of a horse kicked me on the shin. Of for the humdrum days of peace!\n\nThey can’t leave us alone even here after dragging us out 30 miles into the desert. Tomorrow night – I believe – we are going out for a two or three day’s \"stunt\" with the \nalledged\n alleged object of rounding up an out post of Johnny Turk,\n\nAfter that Rumour says that we are going to leave here & embark for somewhere she apparently does not know where.\n\n\"Dubarbos\" \n","15":"\n\nThe great \"Stunt\" is on! We left our pleasant little retreat at Romaneh at 10 pm. It was a fine sight to see the start lines of horsemen passing by – we had to wait for a brigade to go by – they looked very well passing by, rather impressive in fact, as they stretched as far as \nyou\n could be seen in both directions, always moving past without a sound or a light; In short it gave one the impression of attending a phantom review. We started out shortly afterwards & getting about 5 miles out of camp we lagged behind a little for some reason or other & the result\n\n \n\nwas that we lost sight of the preceding unit & lost ourselves in the open desert! The O.C. for about an hour & half asserted that he was sure that it was \"straight on\" & confidently led us in circles – any ass could have told that we were circling by watching the stars –. Finally they \nligh\n lit sufficient matches to \nwait\n cause the annihilation of an Army Corps had any happened to see them; and by this means took a bearing with a compass & found to their astonishment that instead of East, we were going due South. Thereupon they retired from the unequal contest & we\n\nlay down where we were until dawn & thus arrived at our bivouac here at midday instead of early morning. Tonight if all goes well we should get to grips. It is intended to be a surprise but I think the turks knew all about it before we started, anyway they would be very slow if they didn’t. We go out again tonight & return here all being well tomorrow night. So now I am going to slumber.\n\n\"Dubarbos\"\n\n7.15 pm \n","16":"\n\nWe move at 8.30 pm tonight, if all goes well we should round up the Turks at about 4 a.m. & get back here again for our evening meal.\n\nThat at any rate is the idea. How it will pan out we shall see. Promises to be a chilly night; there is a North wind off the meditearanean, will be really cold in the early hours. It will be somewhat of a strain keeping awake tonight as we were travelling all last night with the exception of an hour and a half & then the sandflies had a huge meal.\n\nIt will be hell for anyone who gets wounded badly as they have to travel by camel for over 30 miles and it is not very comfortable for an ordinary rider.\n\nI must light up my last pipe now as it grows dark & \"no smoking after dark\".\n\nAbout 11 pm\n\nHalted beside some evil smelling marsh in order.\n\nAbout 2.30 am\n\nHalted again. always halting now. The sandflies are awful. Nothing doing yet though it is still dark as you can see from my writing.\n\nSome miles beyond Bir el Abd\" about 5. 30 am \n\nWell the darkness is over & the sun us up and not a shot fired!\n\n\"Sic transit Gloria Belle\"\n\nHowever there is or has been some excitement with the other column. shots can be heard in the distance. We shall probably go over there later. The only result of these glorious proceedings is that we are all as cold as charity. I, at any rate have had about two hours sleep the last two nights & nearly fell out of the saddle several times last night by dropping off to sleep.\n\n\"Romaneh\" Next Day\n","17":"\n\nThe \"stunt\" is now over thank goodness and we are now back in Camp at Romaneh. however to continue\n\nmy recitation of events. After writing the above I went over to this ridge & there discovered that half an hour before I arrived the New Zealanders had come upon a camp of about 2-300 turks & \"shots were exchanged\" but owing doubtless to the \nsun being\n dawn having already broken, the enemy had almost all got away. The aeroplanes of ours did some very pretty work as they were getting away diving \ngo\n down to about 200 feet, dropping bombs, & as she rose again letting go with the machine gun in her tail. The whole scrap gave me the impression of a little comedy perfectly staged with us in the boxes\n\nThe total result was that we had two of our men slightly wounded and captured – don’t laugh – one Turk (untouched) our nondescript dressed in what looked like, & I believe was, an old Irish dress frock coat, bright green with age (wounded in three places).\n\nOne old woman (about 100 & anything) one \"wallad\"\n\nTwo very dirty looking \ngirls\n \"biuts\" one child in arms (not the military issue). Also we buried about six stiff’uns. Then we left the place at about 8 oclock, leaving the camp – comprised of palm leaf huts – in flames.\n\nBut it was a terribly large net to catch such small fish. \n\nWe were composed of: - one General with staff complete. Two Brigades of mounted men – roughly 1500 men – one big 18 pde gun. Two Ambulances and nearly a thousand camels bringing water, stores & equipment.\n\nI think the trouble lay in the fact that since the aeroplane’s last report – at sundown- the enemy had shifted about 4 miles further than Bir el Abd where we had proposed to surprise them, the result being that we came on them half an hour too\n\nlate; the dawn, as I have said having already broken.\n\nWe left Bit el Abd at about 8 oclock got back to our temporary camp – the place where I commenced this lengthy despatch, I don’t know its name – about 3 oclock; drew fodder & rations; stopped at \"Oghratina\" for tea; then proceeded back arriving here at about 1.30 on the morning of","18":" (today), having sustained one casualty – a horse, which was shot as its leg was broken by an exceedingly well-directed kick \non the\n as we \ncoming\n came home – \n\nIt was exceedingly fortunate for us that we came straight home\n\nfor at about 6.30 thin morning a few hours only after our arrival an enemy aeroplane came over the camp, having evidently followed us up, and dropped seven bombs on the camp, doing a lot of damage in fact killing 4 men of the","19":" Light Horse & wounding nearly 20 more 6 of which have already died from wounds, 2 officers and killing or disabling about 30 to 40 horses. Thus it was extremely fortunate that \nwe\n the aeroplane did not catch the column on the march. \n\nOf such a kind then is one of these \"stunts\". I feel an overwhelming sympathy with, & pity for Poor old Xenophon\n\nsuch my\n My main impression of it is an intense desire, sometimes for water, sometimes for tobacco; and above all an \noverwhleming\n overwhelming sense of irritable sleepiness inable to be appeased: for from 6 oclock on Monday morning until 2 oclock Thursday morning I only had four hours of sleep altogether.\n\nMy only comment is \"God forbid that we shall go on many more of these obnoxious affairs\"\n\nAs you see I tried taking my diary with me and jotting down things as they occurred, but it is not much good as one has not time, inclination or enough light.\n","20":" \n\nA disaster has overtaken us! We have been incontinently booted out of our pleasant little retreat beneath the Palm trees, consequent upon the arrival of the rest of the corps to this district. The place in which we are now situated is on the top of a hill on the bare sand. \n\nBy the way, the aeroplane reports that there are thirteen Turkish dead lying \ndead\n where we had the scrap beyond Bir el Abd, so we did not do so badly after all. I have drawn a map of the district below.\n\nRomaneh – The district in which our troops have a standing camp. Extends over a large area consisting of a number of Palm grove\n\nKatieh – A well of good water & a few Palm groves A Regt. of Yeomanry were surrounded here in","21":"\n\nEr Arbah – Salt water marsh & grove.\n\nOghratina – Single big Palm grove & wells backed by big sand dune. A whole Squadron of the Yeomanry wiped out here one man surviving same time as Katieh\n\nDubarbos – Palm grove & wells in which we made our temporary base for the advance on\n\n Birelabd – which is a small grove with old well & full of some herb which when crushed gives out a strong musk like scent very noticeable in the dark. \n\nThere was an aeroplane scare this morning – reported about seven miles away by an outpost – Everyone scattered all over the desert with his horse & then , of course, being ready for it, the cussed plane did not turn up. \n\nLast night some stuff was found missing from the QM store. The result was that \nthe\n two \"officers\" in that beautifully, tactful & gentlemanly way some of these people have immediately without a word of explanation to apology searched everyone’s kit!. I, & everyone else too, was furiously angry but afterwards it occurred\n\nto me that it was so like the unfortunate parlour maid having her boxes searched after a jewel robbery. However – enough.\n\nI was interested to find out that during the stunt we traversed one of the oldest roads in the world, in fact I did not know it until I was told afterwards, but \napp\n apparently Pharoah took that road then Napolean to Aire\n","22":"\n\nJust now I am engaged in guarding our water supply – a futile business, largely the outcome of the stealing episode. However I am on first shift and there is a good moon so it is not so bad. In fact it is mainly on these occasions alone that one has time for ant protracted meditation in this chequered existence.\n\nThere is one redeeming feature about Egypt – the nights are wonderful. \n\nHere we are 30 miles odd East of the Suez Canal in the bare desert, at night there is\n\nnot a sound, save the occasional bark of a desert jackal or dingo, both of which seem to abound in all parts of the desert both eastern & western.\n\nWild Rumours have been rearing their fantastic heads of late – Kitchener & his staff have been drowned off the Orkneys – I hope that’s not true. 31,000 Turks in Mesopotamia & 25,000 Germans at Verdun have surrendered – another – Verdun has fallen, & so on & so forth; one hardly knows – or cares much now – what to think\n\nJust had a visit from our new Q M. Sgt. to see how much water we had; he is a shrewd lad, and successfully carried through a rather amusing and, by all accounts, a somewhat unscrupulous intrigue to obtain this high office. Well, good luck to him, if you don’t look after yourself in this outfit you may be quite certain of one thing, namely, no one else will do so.\n\nI have just lit my curved pipe, which ought to carry me through until 10 oclock, when I rout out my relief who\n\nwill also sit idly in front of the water for three hours a eloquent, I may say, an extremely eloquent witness to the fact that he is being sacrificed to Red Tape.\n\nThe mosquitoes & sandflies are beginning to make their presence distinctly felt, so I think I will keep on the move.\n","23":"\n\nJust back from another of these cussed ‘stunts’. For once it is a novel & interesting experience but after that they become a succession of monotonous & extremely tyring discomforts.\n\nThis time we made an excursion right off the right hand bottom corner of the map, or at least of the map that H.Q. supplies.\n\nWe went out at 3 am on Saturday morning & went direct to Sarghia (vids map.) reaching that delectable spot at about 10 oclock. We set out from there at 8 pm intending to travel South East to Bir el Bayud which was to have been reached at dawn. We were however at 1 oclock delayed by a thick fog until 5 oclock & finally got to our destination about 9 oclock. There we found a small outpost in possession of a ridge & a long range duel\n\nensued in a desultory manner for about 3 hrs: the only casualties - on our side at any rate – being two horses slightly wounded by strays.\n\nI myself heard three bullets whistle over, the first I have heard since Anzac, - I was forgetting that there was a war on.\n\nThe whole thing was very funny Officers would ride up smiling & rubbing their hands \"there is a beautiful little engagement going on up on the hill there\" \"Anybody hit yet?\" \" Oh no not when I left\" It seems so incongruous after\n\nthe peninsular.\n\nAt about 1 o’clock, having attempted to water our horses, without much success as the water was black & stank – full of H2S I think – we filled in all their wells & departed in peace, reached Oghratina for ten and got back here soon after midnight – early this morning in fact - .\n\nThe Joke is that while nearly everyone was out of Camp – except guards of course – two Turkish ‘planes came over & peppered it with machine guns.\n\nThese excursions into the unknown are a great strain as one gets little\n\nenough sleep at ordinary times with having to \"stand to\" at 3.30 am.\n\nWe are, in fact, leading a cocky’s life at present, up at 3.30 every morning & taking our horses off the lines until daybreak: what for, goodness only knows; planes or an attack presumably, but even then, - However who am I to enquire into the dispensation of Red Tape?\n\nDuring the last few days several thousand infantry have arrived out here, and are now busily employed constructing redoubts & trenches, apparently\n\nmaking, in fact, a first Line of defence. Whereat we rejoice greatly as it points to our leaving here, as the men at Divisional H Qs declare that the scheme out here is not an advance but merely an offensive to keep the Turks out of gunshot of the Canal.\n","24":" when the line of trenches & redoubts are completed & they have finished the 6’ pipe of water they are running out here, we shall be practically useless unless we have to advance further out which is unlikely, being well out of range of the casualties.\n\nThen there seems to be a chance that we shall be withdrawn from here and shall go to Europe. That is the current rumour, & some hardy liars (I think) even declare that the","25":" Regt has already gone.\n\nThen we shall have no more of these unpleasant stunts, the gentle reader has (probably) no idea how unpleasant it is to go riding on & on over endless sand using all one’s muscular energy in a futile attempt to keep ones eyes open.\n","26":"\n\nWe have had very dull days lately nothing at all has happened, no aeroplanes, not even a rumour\n\nSome of the fellows had to go out on another stunt last Wednesday but luckily I escaped that as Bernard has a sore back – no fault of mine they made us take him out last time when his back was beginning to be rubbed.\n\nHowever I am very glad I did not go as they went out as far as Bir el Abd but never saw a turk not fired a shot, so there was not much in it.\n\nI am afraid that Bernard will have to be sent back to the remount depot as he is as poor as a crow & in addition to \n\nthe sore on his back, there is something wrong with the skin or muscle just behind his withers anyway he is very tender there. Will take him to the Vet tomorrow & find out.\n\nOf Late we have had some tobacco & Red cross Gift stuff doled out to us in one packet of cigarettes there was the address of the sender, and I have just written to her. She took my fancy because of instead of signing herself Miss L Stoggs etc as most of them did she wrote her Christian name Lillian Horner I like \"Lillian\" so I wrote an\n\nattempt at an amusing letter just to see if the good (girl,) (Lady) (old woman) will answer it.\n","27":"\n\nThey are springing the Sohag Stunt on us again now & we have to take our horses down to the palm trees for shade. Which is a miserable business because we cannot sleep in comfort.\n\nI am getting very tired of Romaneh now we have not seen a paper since we left Sohag and we not now even know if Fathy Pasha still takes the \"Iftar\" with the sultan everyday as he used to do, I think it must be a patent medicine or\n\nsomething…\n\nThe chief topic of interest in camp now seems to be when our worthy S.M. is going to put on a new shirt. Controversy waxes strong on the subject and, I believe bets have been laid. He is reported to have worn the same shirt continuously during our stay at Sohag, but at Kantarah, amidst public rejoicing, he blossomed forth into a white singlet. It was and indiscreet step for white shows up the dirt rather markedly and now – after a month – it had distinctly lost its white & shining lustre.\n\nYesterday about seven oclock in the morning about 10 or more ‘Planes went over to raid El Arish the Turkish base. They dropped 88 bombs & did a lot of damage & lost three of our ‘Planes. So now we are expecting reprisals though no Turkish ‘planes have put in an appearance up to now.\n","28":"\n\nNuthing’ doin’ in the Turkish Planes business yet, I think our people must have put them out of action.\n\nDown in the palms again today Been occupied sewing a new corner onto my haversack with the\n\naid of a prodigiously large needle & a piece of an old nose bag. It is now finished & may be described as being a very stout & reliable piece of work, though hardly calculated, perhaps to enhance the already somewhat faded beauties of the haversack. There has been a miscalculation somewhere & the result is one corner is larger than the other; something like this- :\n\nI am, however, beginning to think that with Ecclesiastes in that \"Vanitas Vanitatum!\" \"Omnia Vanitas!\"\n\nA Rumour is running rife (if they do run like that – I forget) concerning a stunt tonight at midnight However as Bernard is still undisposed it is unlikely that I shall go out.\n","29":"\n\nI was right, our Intelligence Bureau was correct even if its methods were somewhat devious. The Stunters started at 3 oclock this morning, I, I am thankful to say, not among the number.\n\nIron mongery in the Beef!! \n\nA certain hesitation & circumspection\n\nis noticeable now among those who eat Bully beef when masticating that wholly delightful food. This is the result of a morning read out in general orders to beware of small steel hooks in the beef. Fancy one’s stomach peopled with small steel hooks!\n\nAs I heard someone say ‘what tales to tell after the war \"Ah Thems’ was the days, Bill, when I’ad four gross \nof\n o’steel ‘ooks took out o’ me innards\"!\n\nThe Hun is a delightful fighter. Of course if is possible it is an economy scheme on the part of the military authorities for\n\nthe conservation of tinned meat.\n\nOf Late there has been a terrible shortage of jam in our mess, and proposals for the holding of a Jam Ramadan have been seriously discussed.\n\nHowever now we come out to these palm trees every day the problem has not been so pressing.\n\nNowadays our needs are very small give us a little shade, a blanket & some tea: Everyday now we string our way down to these palms, tie up our horses, spread out our saddle blanket much as the moslem puts down his\n\nprayer carpet. And there we lie stretched in attitudes of hardly graceful ease, until the clarion call of Ie-e-e-e-e-o. breaks in our eager ears; then with a clink & clank, as of a multitude of mugs being grabbed, each walks or runs according to his disposition, the heat, and the state of his throat, to the place by the fire where one uttering strange cries & brandishing a pannikin dispenses the amber fluid. \n\nThe rest is silence, save for the gnashing of teeth and occasional irrelevant remarks\n\nanent the mystery of the position of the opener.\n\nFollow sighs of repletion & a hot controversy on the identity of him who shall bury, cause to be buried, or otherwise makes away with the fearful array of empty tins drawn up around our blankets, given testimonials to the rapacity of man & members of one mess in particular.\n","30":"\n\nThe heat has increased noticeably since we first arrived here. Late last night our noble fighters\n\nfor the freedom of Europe returned home not having heard a shot fired & being kept out there a day extra in order to bring back one of our aeroplanes they discovered. This is one of the three we lost in the last raid on El Arish.\n\nIt appears very much as if we are not going to be relieved here for another month according to the common report. How the horses will stick another month I don’t know they are all terribly ticked up now: It means a lot of deaths if this is so. We have ten horses over in the","31":"\n\nCorps lines which is nearly 10% & the Regiments are nearly as bad.\n\nWe had Macrae on the go last night telling us his experiences on the Tramways. It is every bit as good as reading Kipling to listen to him. He told us that different types of passengers From the regular city man who has the exact fare always ready to the chatty young thing that has to search their vanity bags to get to her ‘holy of holies’ purse to extract the necessary ‘dena’ How a drunk deposited the change of half a soo on the seat\n\nbeside him & departed , happy in the belief that it was in his trouser pocket.\n\nHow he stood on a ‘tray bit’ on George St to Waverley ringing the bell with the wrong foot before he could pick up it; & so on & so forth. He kept it up for two solid hours & kept us laughing all the time.\n","32":"\n\nAnother aeroplane scare this morning. there was, however, nothing doing as one of our ‘planes came up & shooed him off. It was just before breakfast at about half past six, we all took out our\n\nhorses & scattered, stayed out about 10 minutes & then proceeded to break our fast, one or two fellows who evidently take these scares somewhat too seriously didn’t get back until after breakfast affording great merriment to the crowd.\n\nThe evenings from five oclock now are the only parts of the days worth living for, they are really quite nice. I remember about this time last year we had the nicest weather I have ever experienced cruising amongst the Aegean Isles on the SS Galeka. I remember one morning in\n\nparticular about 7 oclock we were passing a beautiful island covered in varying shades of green vegetation; it seemed to rise steeply from the sea until the peaks were obscured by fleecy white clouds. I was sitting right up in the bows of the boat lost in admiration & rhapsodising over the blue sea & green island golden sunshine etc when up comes \"Dug\" Brownfield who is most distinctly of the earth, earthy, with the request that I should help him transport a corpse to the stern of the boat – we were carrying wounded to\n\nAlexandria - , which was an unpleasant job as the man having died in the cabin – the \"Galeka\" was not a hospital boat – his unfortunate lay had to be up ended like a milkcan several times before we could get it out on deck.\n\n\"Dug\" – he left us on the Peninsular in Australia now – was particularly adapted for that job. He was emphatically not a sentimentalist He would shout to me. ‘Er give us a ‘and to carry a stiff ‘un aft\". Then he would throw down his cap – it was as far as his respect for the ‘stiff’un’ went, otherwise he was\n\neminently businesslike – Then off we would stagger with our burden, Dug swearing, spitting, sniffing & saying with brutal directives \"Gawd ‘e don’t ‘arf pong do ‘e? It would have been pathetic has one had time to realise it, for such was in many cases the sole requiem for a Hero of Anzac.\n","33":"\n\nJust been watching a most thrilling sight while it lasted. About 8.15 we had another Aeroplane scare & waited about 20 minutes until our ‘plane – which had evidently been telephoned\n\nfor from Kantara – arrived. He sighted the Taube & a very pretty piece of manoeuvring took place in which which our plane got the position on top, & \n\nthen the two ‘planes went at it with machine guns. This was at about 1500 feet almost directly above our heads, & there was the added excitement in that at any moment the Turk might take it into his head to drop a bomb on us.\n\nHowever, he did not fortunately & after a few rounds he made for home with our ‘plane close on him. As far as we could\n\nsee, he got away as his \nmachin\n machine secured faster than ours. Ours has not yet come back so we don’t know as yet what happened. However it was as good as having your shirt on the favourite in the last race while it lasted.\n","34":" ‘16\n\nFrom all accounts Johnny was too good for our plane the other day as they say that our plane had to come down at Katia and I think that is right because a ‘plane riddled with bullets was taken back to Kantara by the train yesterday. Johnny was\n\nreported from Oghratina, flying very shakily. I don’t think he got quite home either.\n\nAt 2 oclock this morning half the corps went out on a stunt I was in the lucky half & stayed at home. I should have anyway probably as Bernards back is hardly right yet.\n","35":"\n\nThe latest is second hand from the mouth of the Major himself that we are going to England at the end of this month – I wonder. During the last few days there has been an extraordinary increase in the number of crickets\n\nhere, so much so, indeed that they are becoming quite a plague. They are everywhere, in ones blanket, spare clothes, the food box, absolutely everywhere. They are not very prepossessing creatures either being dead black about the size of the ordinary black beetle & kick up a most unholy noise, just like the cicadas in Australia.\n\nI wish we could have dugouts instead of tents here. The dugout is a much superior dwelling for the nubile private. In a tent there are usually seven or eight while in a dugout one seldom has\n\nmore than one companion, in fact it lies with the occupant as to the caracter & number of \nyour\n his companions, & his doings & the disposition of his goods & chattels concerns the occupants alone not the OS OO & OC as is the case when living in tents.\n\nThe dugout, in short, may be described as being the height of luxury for the proletariat of Military society.\n\nAfter the Dugout comes the Tent, which is neither so comfortable nor so untravelled an existence as the former\n\n After the Tent comes the most uncomfortable mode of existence of the lot namely the Trooper : or Rather I should say that these are two degrees of discomfort the Long distance Trooper carrying a Unit of number of units; here at least one has ones 18\" hammock swinging space which, if negligable, is at least ones own. \n\nSecondly, the short distance trooper carrying details, here one reaches the absolute limit. The trip is behaps only a week or few days hence the boat has been many times before & as a result is probably\n\n"}}