{"Document Name":{"0":"Diary_0509","1":"Diary_0509","2":"Diary_0509","3":"Diary_0509","4":"Diary_0509","5":"Diary_0509","6":"Diary_0509","7":"Diary_0509","8":"Diary_0509","9":"Diary_0509","10":"Diary_0509","11":"Diary_0509","12":"Diary_0509","13":"Diary_0509","14":"Diary_0509","15":"Diary_0509","16":"Diary_0509","17":"Diary_0509","18":"Diary_0509","19":"Diary_0509","20":"Diary_0509","21":"Diary_0509","22":"Diary_0509","23":"Diary_0509","24":"Diary_0509","25":"Diary_0509","26":"Diary_0509","27":"Diary_0509","28":"Diary_0509","29":"Diary_0509","30":"Diary_0509","31":"Diary_0509","32":"Diary_0509","33":"Diary_0509","34":"Diary_0509","35":"Diary_0509","36":"Diary_0509","37":"Diary_0509","38":"Diary_0509","39":"Diary_0509","40":"Diary_0509","41":"Diary_0509","42":"Diary_0509","43":"Diary_0509","44":"Diary_0509","45":"Diary_0509","46":"Diary_0509","47":"Diary_0509","48":"Diary_0509","49":"Diary_0509","50":"Diary_0509","51":"Diary_0509","52":"Diary_0509","53":"Diary_0509","54":"Diary_0509","55":"Diary_0509","56":"Diary_0509","57":"Diary_0509","58":"Diary_0509","59":"Diary_0509","60":"Diary_0509","61":"Diary_0509","62":"Diary_0509","63":"Diary_0509","64":"Diary_0509"},"Date":{"0":"unknown","1":787.0,"2":788.0,"3":789.0,"4":791.0,"5":796.0,"6":797.0,"7":798.0,"8":806.0,"9":808.0,"10":809.0,"11":814.0,"12":815.0,"13":824.0,"14":832.0,"15":833.0,"16":835.0,"17":836.0,"18":839.0,"19":840.0,"20":841.0,"21":856.0,"22":865.0,"23":868.0,"24":870.0,"25":872.0,"26":875.0,"27":899.0,"28":900.0,"29":902.0,"30":904.0,"31":907.0,"32":908.0,"33":914.0,"34":917.0,"35":922.0,"36":923.0,"37":924.0,"38":925.0,"39":929.0,"40":934.0,"41":935.0,"42":938.0,"43":940.0,"44":941.0,"45":942.0,"46":944.0,"47":947.0,"48":948.0,"49":949.0,"50":950.0,"51":951.0,"52":952.0,"53":953.0,"54":954.0,"55":955.0,"56":956.0,"57":957.0,"58":958.0,"59":971.0,"60":974.0,"61":975.0,"62":976.0,"63":977.0,"64":978.0},"Entry":{"0":"\n\n","1":"\n\nA lot of changes have now taken place in the Brigade our battalion is split up into two and things are in a bit of a mess we are now known as","2":" Bn right wing and have got reinforcements belonging to another Bn. Of the Second Div. and the crowd are not taking too kindly to the new conditions. \n\nGen Birdwood who has addressed the crowd today says that with a bit of luck we may see some fighting in\n\nfrance don’t much care myself whether we do or not. \n\nSaw the two Boyles yesterday with Bob Mitchell and some others They don’t look to well on it and do not appear to be enjoying the life well neither am I but I don’t advertise it.\n\nI think we shall shortly be on the move to the Canal \n I think \n but do not anticipate any joy or fighting down in that direction\n","3":"\n\nAn order has come out to the effect that no\n\nsomeone else, I was sorry, she writes a good hand, wants turkish coins, she cant get them Ive got some \n","4":"\n\nWe are now2 able to post letters providing we like to take the trouble to try and find out something to write about.\n\nWe have all ran out of cigarettes and tobacco and money so things do not look too good at all.\n\nThe general exclamation is give us the \n","5":"\n\nGot a new Brigadeer and he is some, he came out on Sunday to church parade dressed well and neatly, I don’t think\n\nI wanted to get in the rear ranks thought he might put it on me for my tunic, but my fears were groundless, however for he didn`t notice me at all, an oversight that I put down to his nervousness .\n\nCame and had a dekko at the lines after and he seemed a decent sort of stick though regimental \n\nIm sorry we have lost our old Brigadeer general\n\nSmythe VC. he was a real good old sport, Col McNaughton our Col. has come back today and his limp is more pronounced than ever. I think hed peter out if anything went wrong with the Bn, he is out looking at the new reinforcements now, and he does not seem to be enjoying it, wants to know what their occupation is in civil life and they are gaping at him with open mouth \n\nGot paid the other day 30\/- put it on him for more\n\nbut he did not respond got a few wads and a feed and there were no more left trying to raise the wind by playing house, Oh it was nice, Im out in the road with a handful of cards and a hoarse voice singing out “housey housey” “come on who`ll have a card”\n\nwe don’t bar sgts.”etc we collected about 30 piasters worth about 6\/- and had a go at two up after Sunday ups and downs we came out\n\n50 piatres to the good about 10\/- now that’s all gone and we have to go out again to night to try our luck .\n\nIt was given out on parade the other day that the Russians had had some very marked successes and the turks are on the run, we gave em three cheers . If its true I wouldn’t be surprised if we got a move on to france, do me, fed up with Egypt and its dirty inhabitants, they get on my nerves.\n\nI went gay in Cairo a few days back and stoushed a few of them up and got 10 days F.P. for it, never mind Ill take it out of them if we ever get busy in real ernest gee I`d enjoy insinuating my bayonet into the vitals of the brutes and then giving it nice deft twist before pulling it out and handing another chap his dose.\n","6":"\n\nOh this army is a beaut we have to mess about all day and every day\n\npulling down tents and putting em up again, putting your kits and mess tins in particular folds, and the head gee comes round and has a dekko and says they are dirty – they have never been clean yet to my knowledge- and then goes to tea and leaves us to more messing about\n\nJust came in for our boots, got to get them mended, no new ones to issue, and a minute after they want to send\n\nus on leave but because we have no boots we cant go, I sometimes think that there is a lot of method in this armys madness but It would be all the same if we had for we have no money no candles tonight and the crowd are having a great old cuss\n","7":"\n\na day off parade today – no boots – had a grand sleep in the morning and thought the afternoon would be ditto but not on your life, it would\n\nSimply awful to think of giving a chap a whole day off and they had full packs up too so off we had to go with all our worldly possessions on our backs – five of us- it was just over those stones in bare feet, and the language was awful but it got worse when we got out there and found that we had to display everything\n\nI had a four display a couple of clean shirts blue cardigan, very \n\nnice one, socks singlets etc and a pair of new trousers up comes the boss and grabbed the whole outfit, and I went crook, but he threw me back my overcoat Muffler 1 pr socks and a singlet and took the rest well I thought that was pretty cool and said so but was told politely to shut up, well we were all pretty mad when we hit our tents and found that they had been round there\n\ntoo and had taken all our sheep-skins towels tobacco in fact every thing and have left us nothing to smoke or wear, If I could only be granted the luxury of free speech for 5 minutes with the big nobs guess I tell em something dont think I ever felt so bitter against the whole outfit since I joined but I`ll be alright in the morning its no good going crook you only it harder\n\nyou would perhaps think it impossible but you can take it from me it is not. \n\nWhen I get back Im going to take a job every day for a week and tell the boss to go to hell just to experience the pleasure of feeling that you need not stop unless it pleases you.\n\nI was to go on leave tomorrow but cant get any money although Ive got over £30 in my pay book to draw but such is army life.\n","8":"\n\nLeft Tel-el-Kebir and entrained for Serapeum where we arrived same day, very nice sand felt deep and very fine it was great marching with full pack up . \n\nCrossed the canal at dinner time and got to the camp about 3 Pm. The worst hole Ive struck yet, sand and nothing but sand and when aided by a night wind it’s the worst torture out fills up everything this lasted for three days \n","9":"\n\nI am going to the Instruction School at Zeitoun for three weeks\n\nIt was as dusty as a dead mud fish in a whirlwind and we were pleased to hear that we were going went by launch to Ismalia and from there by train to Cairo. \n\nIsmalia is a very prim little place all hotels open at 11 and close at 3 We got there about 4 and it took all we knew to get a feed. Id like to get on the rantan there and wake it up a bit\n\nHad a rotten ride in the “wagon” down to Cairo, the railway people call em carriages\n\nbut that’s a fallacy I tried to sleep on the floor but some would persist in digging his spurs into my ribs .\n\nI expostulated with him but to no good so I had a look at him saw he was shickkered and shifted,\n\nWe arrived in Cairo about 2 am and after a nice little march finally got to bed at 3 am \n","10":"\n\nAt Zeitoun pretty dirty little place \n\nI hope we are able to collect some money if we do we will have\n\nsome time, tried to get some today in Cairo but no good, going to have another fly to –morrow \n","11":"\n\nWe got paid on the","12":" I collected £2.11.4 I put a chit in the pay book humbly requesting the payment of a fiver but I guess that chit hit the waste paper basket, but 50\/- was better than nothing, \n\nWe had a very good feed in fact we had a couple and then sat on the balcony of an hotel and drank beer looked at the picture and smoked 1\/-\n\ncigars, went into Cairo yesterday thought we could raise money but no good \n\nwe went without tea and paid a visit to the Kursaal, a theatre which was fairly good and its Sunday and we are broke again..\n\nSuch is life in the army .\n\nA long monotonous daily routine to get through to say nothing of the sand relieved here and there by little bright gay patches that mark the fortnightly or otherwise payment .\n\nThey owe me about £20\n\nand I don’t see why I cant get, but the chaps in Authority evidently think otherwise for I cant get any but Im going to word the Colonel of this outfit tomorrow to see if I can do anything.\n","13":"\n\nhave after futile attempts , managed to collect my back money per medium of a dentist it cost me £12 but as I think Ive got my money`s worth it does not matter only another week in the instruction school and we go back to the desert again.\n\nThe second div have gone\n\naway France I think. I wish they would send us there Im tired of Egypt and Cairo every time I go there I come away in a bad temper \n\nhad a look around Heliopolis on Sunday went to the empire club which is run by Australian ladies for Soldier cakes and sandwiches very cheap upstairs there is a gramaphone and plenty of reading matter then there is the America mission I went in there for a rest and there were two big tables full\n\nof papers and books so went up to but they were all tracts and Missionary reports didn`t think that there were so many different religious papers on the market well it gave me the pip there wasn`t even a daily paper the only touch humour in the whole serious outfit was a half drunken soldier rattling out ragtime on the Piano it was Sunday too I left and went home\n","14":"\n\nOn Bourd the Transport “ Simla “\n\nThought it was a decent boat but its not the tucker is awful bully beef all the while they gave us some fresh stuff the other day but we had to heave it overboard it was bullet proof. \n\nWell fair amount has happened since my last entry in here. \n\nTo begin with we were recalled to join our battalion at Serapheum and we started, reached Ismalia no one in charge of us put the night in there and walked about\n\na mile next day with full packs up expecting a boat to take us up the canal but it was non est Came back got a tram which landed us about a mile on the opposite side of the Canal so we had the trudge through 2 miles of sand with about 1 cwt on our backs for one camp was one mile the other side and we were in no good humour when we reached it. You\n\ncan judge of our surprise, there were only two of us when we were told that we were to be left be we swore we raged and entreated but all to no purpose when Lane the other chap told one officer privately that he was a --- -- - ----- and got 12 days Clink\n\nI was going up to see the C.O. a little later when the officer called me in told me he could not help it and \n\nsaid he would do what he could for me so I found that next morning I was in it. \n\nThey had to put out another chap though but that did not worry me so long as I got in.\n","15":" here I am on board a Transport bound for France. Been playing house and have made £15 between 5 of us in four days not too bad.\n","16":"\n\nDocked at Marseilles won a fiver each at house I done\n\nit nearly all in at nap still got a few bob to have a dekko at the place if I can for it’s a hilly also a chilly outlook they say we have a","17":" miles, others say 36 hours in the train to Flanders. \n\nI know the army a bit better and am prepared for the worst.\n","18":"\n\nBatt fell at about 1 PM and marched through Marseilles, Saw plenty of French soldiers looking very neat in the Grey and Red uniforms nearly \n\neveryone here is in uniform even the German prisoners of whom there were a good many knocking about pretty hefty crowd and fair complexions.\n\nSaw some lady train guards and drivers and finally pulled out at 5 PM.\n\nPassed through the second biggest tunnel in the world and it was some tunnel passed through some beautiful country for 61 hours it was rather weary travelling but we did not mind we had some wine\n\nwhich cost us 1\/- per bottle and put in the time some how we thought at first that we were going to Havre but changed our minds to Calais after we passed that it was something else We finally pulled out early in the morning at hazebrook and marched 10 miles to Staples to out billets we have a fair billet and it’s a lot better than canvas. \n\nWent to a bomb school to \n\nbe instructed in the throwing of same wasn`t bad \n","19":"\n\nbeen on a signal station but had to come in no sun its jolly cold too.\n\nJust going down to the “estaminet” which is French I guess for drinking outfit you cant call em pubs they are only as big as bath rooms , some nice girls here beat Australia Ive got one in a Coffee shop, the chaps want to know how I came to meet her, says she`ll marry\n","20":" after the war, well she might but I wouldn`t gamble on it, nice place this, if I could only hand out some of the bugs, Gee what a time wed have, but as it is got to do it all with our hands, The girl says she will teach me but we have to move tomorrrow, \n","21":" \n\nJust bullets near the trenches with plenty of shells and shrapnel flying round. One shell wiped out 24 and wounded 29 all on\n\nits own today that’s going some eh. Have not seen the sun for a long while and we have had some pretty stiff marching to do through mud rain and an occasional bit of snow Oh it was miserable but now that we are in it again it wont be so bad.. but the rain and mud are pretty bad and its as cold as the deuce. \n\nIts pretty quiet tonight, a machine gun splutters now and then and during the \n\npause a big gun lets one go just to keep it moving.\n\nThey have been slinging the ironmongery about here alright churches are their forte they do bust em up properly but the villages and farms all got a pretty fair share I guess.\n\nGee its cold , Im up in a barn with a telephone and its raining outside and plenty of rats inside.\n\nNearly 11 o`clock relief is just about due and then to bed\n","22":"\n\nGot our first rations (iron rations) \n\ndished out a couple of day ago, They went down well – into the ground – but they did not smell too good\n\nthey only sent 8 over 5” I think next day they started in the morning, gave us a visit again in the evening no casualties though it was an education to watch the sentry outside our billet warning all to hurry along as it was under fire, \n\nThe first chap was an English Officer with two orderlies all mounted, “you want to get a wriggle on there”\n\nsaid the sentry “some shells are floating round” “eh! Whats that” said the officer and the whole outfit stopped “you want to get a move on this road is under fire” “Oh whats under fire sentry” “Oh here comes another “ said the sentry drily “Guess you`ll soon know”\n\nThe officer cocked his head on side got the drone of shell and they moved some, another chap was coming along on a bike, when one went off about 15 yds off him, he slithered into\n\nthe middle of pond bike and all.\n\nThey leave some crater when they bust a man can easily stand up in them and remain hidden.\n\nHad a gas attack last night Gee it was great, our first experience of that article, didn’t get much but didn’t fancy the sample at all, the helmets you have to wear are nearly as bad as the gas, only they don’t quite put you out for keeps, the other does.\n\nI was in the nighttime\n\npeace and quiet, that is comparatively quiet and Im wondering what is on for dinner\n","23":"\n\nearly in the morning, listening to the snores of my relief I wish he was listening to mine.\n\nGot a few shells over yesterday the billet next to us is not here now, its gone to a better land than this, and things are looking a trifle ruddy\n","24":"\n\nCame into the trenches yesterday, some trenches, I don’t think, cant hold a candle to Galipoli\n\nThey are only a breastwork of sandbags the Germans \n\nhave got half of France and I think we have the other half in Sandbags.\n\nTalk about mud guess the people in Ossie have never seen mud, nice black slimy dope feet deep and giving off a most delicious aroma. \n\nIts pretty quiet here, There were two live 9.2 shells lying here when we came, the OC reckoned they weren`t safe he was right they weren`t, a party took one away and buried it came back for the other one, but unfortunately the\n\ndarned think exploded and we couldn`t find the party to bury ` em\n\nThey say we are only in for 16 days, I don’t want any more, got a “possie” 6ft by 5ft and by the time the phone is in there is just room for two but Ive got to camp 6 in it.\n\nOur rations came this morning so am just going to cook it the chum is outside now picking to grass off a bit of bacon fat.\n","25":"\n\nGot a pen and ink again, also got the pip and my eye on a big rat\n\npreparing to chew up my days rations in a couple of bites \n\nFritz got ratty again tonight and played up, started with big stuff then brought out 25 & 18 pounders in the trenches Rifles M Guns bombs flares mud and curses were all mingled with the gas I haven`t seen yet or smelt it either, they say one sniff sends you out for keeps but I cant speak from personal experience\n","26":"\n\nSome bombardement yesterday big and small lydite shrapnel Hows and\n\ncommon shell kept it up for 3 hours when the smoke cleared our parapet was down trench stuffed and everything generally in a hell of a mess,\n\nthen our “Neutral” Artillery got busy , they opened the ball by pumping three big howitzers into our own line “three cheers”, There was frantic rushings to Phones hot biting words passed over the wire and the battery shut down and went\n\nhome, \n\nWe had an officer of the Artillery here yesterday afternoon, asked permission to use my phone, of course with my usual politeness I replied in the affirmative, after spending half an hour looking for the target which was right under his nose he gave em the wink through the phone to get No 1 gun ready, after another brief period he gave em the order to fire, they fired the shell came over failed to burst \n\nand he allowed that another one would not burst, well he kept on allowing for over an hour and said it was too muddy, I said “some battery”\n\nand he looked as if he`d like to make a battery out of me.\n\nThey played a joke on the Fritz outfit the other day, but cant vouch for though I believe it to be true, Some of the crowd had a gramophone and started it in the trench, it must have been german music\n\nit was playing for Fritz started in to cheer and hand out “hocks” by the yard we kept it up for half an hour and we had em all leaning over the parapet listening to the beautiful strains, when one of em yelled out give us something Australian we did, The machine gunners turned 4 machine guns on their parapet, I don’t think they liked for they got ratty and started on to sling bombs which were returned in kind. \n\nWe had the “Tykes” commercial \n\ntraveller in today he generally announces himself by poking his head in the door and asking if there are any tykes in the ranch hes a nut, came into our tent at Serapheum and told us he heard a chap down the road who let off a dozen Fs and half a dozen B`s before he came to nigger\n\nIts raining now, sleet fine hail etc guess we are going to enjoy ourselves\n\nThere is a yarn going about that Fritz came over further down the\n\nline in broad day light bombed our chaps out took a lot of prisoners slaughtered the rest and raided all papers, in fact they thoroughly enjoyed themselves and then were driven off with enormous losses to their own outfit. dont forget the enormous losses. \n\nThink Ill get leave shortly hope so, Id like to see England before I peter out.\n\n12.5.1\n\nFritz blew up a mine yesterday a pretty bum one too hardly shook the ground\n","27":"\n\nbeen here in billets about 8 days, the trenches were fairly quiet a few left their beanis on the parapets a few wounded Capt Judge, one of the old boys got his.\n\nSome bombardment last night expected to go in but did not don’t feel up to much myself, got that way I don’t much care which way she blows\n\nBilly Hughes visited us\n","28":"\n\nNothing much doing went to tea at Sidonies wasn’t very exciting \n","29":"\n\nHeavy bombardment on the line thought we would be called out but was not\n","30":"\n\nbaksheesh attack on Sailly, very nice, increased my knowledge of language\n","31":"\n\nhad another dekko at Sidone in a bad humour told her to go to bed and went home \n","32":"\n\nMoved to Fleurbaise in a decent billet with carpet on the floor but lord it was dusty \n","33":"\n\n“Stood to” for a gas attack at 12.40 AM very nice etc\n","34":"\n\nanother B – gas attack the novelty is beginning to wear off\n","35":"\n\nmoved to Wye Farm some place\n\nfull of rats, went outside and saw one big rat chasing the cat and that cat was going some believe me.\n","36":"\n\nwires broken by shell had to go and mend em very nice and exciting\n\nC.O. wanted to know if id had my leave told me no told me nothing\n","37":"\n\nwires down again had to mend them in the middle of the night heavy bombardment about 14 casualties.\n","38":"\n\nAdjutant wants\n","39":" for a raiding party so I hoofed it back to Fleurbaise for training\n","40":"\n\nRaid off, after special training in Gas Helmets etc, didn’t say anything Oh No.\n\nArrived at Sailly about 4.30 went down to Sidonies and got a beer also a good welcome\n","41":"\n\nWent back to Trenches for the raid nearly wore a pair of trousers out on the G.S. Waggon going down first time Ive been driven to the trenches\n","42":"\n\nRaid off again went to Outersheim in Evening (the whole Bn) about 7miles\n","43":"\n\nLeft Outersheim marched to Balleul entrained for Candos, we were bumped in an Trench\n\nMarched 9 miles from Candos to St Omer some town, some March ,some beer, some people and some billet like to stop here for a week\n","44":"\n\nleft at 8.30 without breakfast, got no rations not hungry either reached Viguacourt a rotten village where the \n\npeople keep their peepers on you all day , as if we would screw the pet rabbits neck, although one does hear of cases when they do dissappear in a hurry\n","45":"\n\nMarched 11 miles to Allouville,nearly dead tried for a beer, got it, also a tongue banging from the girl in charge but I was dry rotten place. \n\nSaw Gordon Morrison \n","46":"\n\nwent with two pals to Amiens some city, hit a car tram car you know and \n\nhad a fine time got back at 2.30 AM and justed missed getting court.M.\n","47":"\n\nMarched 11 miles to Warloy pretty hard work after last nights dissipation\n","48":"\n\nJust finished on two court Marchals of Stoushing up NCOs\n\nBoth wash outs.\n","49":"\n\nLeft Warloy for the Front\n\nHit Albert at about 8 PM\n\nMet Tommies coming out carrying German helmets look all right, must get one or two if I can\n\nleft Albert at dark and walked across the old german lines which looked as thought they had been struck by an earthquake they were twisted some, \n\ngot to their second and then they began to hand out some shrapnel and H.E.\n\nonly got one casualty by jove there are some dugouts here all boarded up, dinkum stairs, and bedsteads mirrors in fact quite palatial.\n\nWall paper on the walls genuine stoves etc. \n\nGee I guess it would take £1000 easy to build it over outside in Peace time.\n\nThey got one of our aeroplanes today and we have been bombarding them like hell.\n\nThey are still at it and tomorrow morning we once again make our debut on a dance across no mans land,\n\n I just stepped\n\non my sand bags and the bombs are looking at me.\n\nCant quite help wondering what fate holds in store for me tomorrow.will my good luck still hold or do I go west?\n\nOh well what ever it is guess Ill take whats coming to me easy.\n","50":"\n\nMy birthday again gee some birthday did not do the trick .\n\nThis morning billed\n\nfor tomorrow night I believe.\n\nBe bombarding all day, few casualties saw some new trick shells, hand out streamers of fire over the trenches as well as shrapnel they look pretty deadly, but they are ours thanks.\n\nSaw Trippy today back at the transport. He gave me some dinner and tea for which I was grateful, plenty of German souvenirs\n\nkicking around but cant carry em.\n","51":"\n\nOur lads went over to night. We marched up in artillery formation hit a block in a communication trench \n\nFritz put of three big ones wiped out about 20 , first blood for Fritz,\n\nWe went over at about 11.45 not many casualties going over, charged over their first, 2nd and 3rd lines took the village had some fine stoush in the \n\nwood giving the tin openers a chance to make a name for themselves.\n\nHans does not make much noise when hes wounded with the bayonet just throws it in with a sigh\n\nDidn’t see much of it myself was quite busy enough getting messages in and away . \n\nGot my share of shells etc some shells\n","52":"\n\nFritz is putting it over good and hard and plenty of their trenches all levelled\n\ncommunication trench blocked and broken the road is being shelled it blazes dead men all along it, lithle curly Eeds gone, this waiting for sudden death gets on your nerves \n\nour boys of the artillery are sending out a bit too but we are collecting enough to go on with \n\nthe bombardment kept up all day and night, managed to signal to the aeroplane from the \n\nfront line. ticklish work, ground sheet blown to blazes, about 11 PM he sent a lot of Tear shells and gas shells gee they were crook, we were all crying like blazes when we had to beat it down the road to the dump for bombs and rations.\n\nFritz was going some at the time too, running down a road at midnight with a box of bombs in each hand , and , Fritz\n\nshelling that same road with H.E. shrapnel and tear gas, and plenty of dead lying round to bear testimony to his fire, your eyes smarting and running from the gas, believe me its no joke, a bit exciting but a little goes a long way.\n","53":"\n\nStill shelling heard a lot of the boys have petered out, good lads gone out a bit off, \n\nthe stretcher\n\nbearers are doing fine work getting the wounded away, getting the German Prisoners to work carrying the wounded about time too, \n\nthey got an A.M.C. man carrying a jagged edged bayonet, I hope he’s happy now\n","54":"\n\nStill going strong the strain on the nerves is beginning to tell but we may be relieved at any time, \n\nTook another communication trench with bombs, collected\n\na few prisoners,\n","55":"\n\nbeing releved to night shelling not so bad but still plenty of it feel fairly tired no sleep etc. \n\nbegan to move out at 11.30 PM\n\nFritz is still shelling the road but I think we will get through.\n","56":"\n\nGot out alright marched althrough the night to Albert got there at 5.30 AM had a drink of tea and tried to sleep but was too tired\n","57":"\n\nmoved back another 9 miles slept in\n\na wood had a good sleep and wash \n","58":"\n\nOn the march again, gee its tiresome been looking up the cobbers some are gone some wounded (lucky beggars) some still here.\n","59":"\n\nhad a spell back at Halloy, had a fair time, got paid went to a fair sized town to spend it, got pinched, got seven days F.P No 2 and a lance jacks stripe \n\nGee it was funny promotion and punishment\n\non the same order, about time I got something out of it though been in it long enough\n\nJust behind the line going in again in a few days, judging by the noise there are still plenty of shells left yet, I hope I stop a little piece somewhere in a soft place I could do with a “cushy”: and a rest \n","60":"\n\nCamped for the night in a wood believe we are going in again\n\ntomorrow\n","61":"\n\nMarched to Albert with full packs, arrived pretty weary, over 9 miles, had dinner got our battle order on and went into the trenches, or what were once trenches, had a pretty rough passaqe\n\njust as we got in doing a little double over the open they plumped four nine two`s over, the first blew the fourth man to me to pieces \n\nI got dirt and stuff all over me and did\n\nnot wait to see whether the others got any more got to our possie and relieved the others\n","62":"\n\nbeen running between the shell bursts with messages warm work\n","63":"\n\nrunning lines Dunn my pal on it too got skittled lost an eye got it on my pal now.\n\n2 AMC men blown to bits while dressing a wounded man.\n\nFritz came over last night but went back – quick – \n","64":"\n\nHopped over last night a fierce fight with bombs heavy casualties & heavy shelling\n\n"}}