{"Document Name":{"0":"Diary_0461","1":"Diary_0461","2":"Diary_0461","3":"Diary_0461","4":"Diary_0461","5":"Diary_0461","6":"Diary_0461"},"Date":{"0":"unknown","1":1441.0,"2":1442.0,"3":1443.0,"4":1444.0,"5":1445.0,"6":1446.0},"Entry":{"0":"\n\n","1":" - left Fontane-les-Boulans as Billeting officer for Battalion. Cycled with Billeting party of 5 signallers to Ruisseauville. On the road one signaller became sick & I left him with 15th Rn. at Crepy. We then had two broken bicycles & so walked to 4 miles in the dark. At Canlers while the men were mending the bikes in the Estaminet I went to a private house for tea and received a most cordial reception.\n\nSome Australian Mounted troop Officers had been billeted there & had left an excellent name behind them. There were some English Officers there & they told me to expect a very cordial welcome from the family as they (the family) were always telling them about how they loved the Australians. When I entered their dining room \"Oh Un Australien! Un Australian\" was repeated several times quite joyously. I was received quite\n\nenthusiastically. Madame Deloziere (Address Canlers par Fruges, Pas de Calais) cooked me two eggs, gave me plenty of bread, butter, jam & coffee for which she would take nothing. Leaving them (after eating so well) shortly afterwards Madame & her two daughters embraced and kissed me quite affectionately.\n\nArriving at Ruisseauville rather late I found a comfortable bed & was soon asleep.\n","2":"\nFound billets for the Rn. & a bed for every officer except two.\n\nHad a remarkably big appetising dinner at 2 pm after Rn. had settled down. (Veal cutlets & chipped potatoes) tender & beautifully cooked by a Madame.\n\nCycled through the village of Agincourt and on the famous field of the Batle of Agincourt where now stands a small monument surmounted by a high crucifix the whose surrounded by a hedge enclosing trees.\n\nLeaving RuisseauvilleI cycled with my\n\nbilleting party towards Wambercourt, but darkness came on quickly & we had to walk last 3 miles. I called at a house attached to a mill, found an excellent bed, billets for my 5 signallers, and a good supper. Some officers of \n50\nRn. billeted nearby came across later on & gave the people a concert which all thoroughly enjoyed. The mill wheel acted as accompaniment for it was turning all the time, the old miller in his flour covered cap & clothes going out every now & again to attend to it.\n","3":"\nThe next morning after arranging (with great difficulty) sufficient billets & seeing all in comfortably. I cycled back here & inspected the ruins of an ancient Feudal Castle, battered & destroyed by Henry V in 1415 about the time of Agincourt. The town nearby has an ancient church with relics of Feudalism (It had often been plundered by the Court of Crigny? who held this Feudal Castle.) and signs of Spanish Occupation. I had previously noticed serveral very Spanish looking people in those parts, and have\n\n\n\n\n\n\n\nHe advised us as to our conduct in marching through Belgium & Germany. We have to be most punctilious this side of the German frontier but in Germany we are to let them know we are the top dog.\n\n18th \nSpoke with serveral French people just returned from Belgium (Germany) whither they were evacuated. They describe the Bosche treatment for 4 years as brutal (Vide Battalion Journal for 18th Novr).\n\n \n\nThey shed tears at our welcome to them. It was too good after 4 years of les sales Bosches.We gave them two meals today leaving ourselves short.\n","4":" \nRoutemarch through Bohain & Seboncourt. Saw German prisoners clearing up mines on railway & crossroads. Got No 4 Issue of \"Two Blues\" out.\n","5":"\nCompany bathed at Divisional Baths & received change of clothing. Rode withMerifield to\n\nBohain. A bright clear morning but a heavy fog came on this afternoon making it quite dark at 4.30 pm. My Company played D Coy Rugby this afternoon - Pay day - Our new C.O. Major \"Tubby\" Allan took charge of Rn. today.\n","6":"\nRoute march from Fresnoy to Croix Fonsomme (The Source of R. Somme). German prisoners cleaning up Rn. Area, cookers & \n\nA bright warm day. Lt Mc Rae with 20 men ofA Coy marched ahead to erect tents for Rn. along our route to Germany.\n\n"}}