{"Document Name":{"0":"Diary_0253","1":"Diary_0253","2":"Diary_0253","3":"Diary_0253","4":"Diary_0253","5":"Diary_0253","6":"Diary_0253","7":"Diary_0253","8":"Diary_0253","9":"Diary_0253","10":"Diary_0253","11":"Diary_0253","12":"Diary_0253","13":"Diary_0253","14":"Diary_0253","15":"Diary_0253","16":"Diary_0253","17":"Diary_0253","18":"Diary_0253","19":"Diary_0253","20":"Diary_0253","21":"Diary_0253","22":"Diary_0253","23":"Diary_0253","24":"Diary_0253","25":"Diary_0253","26":"Diary_0253","27":"Diary_0253","28":"Diary_0253","29":"Diary_0253","30":"Diary_0253","31":"Diary_0253","32":"Diary_0253","33":"Diary_0253","34":"Diary_0253","35":"Diary_0253","36":"Diary_0253","37":"Diary_0253","38":"Diary_0253","39":"Diary_0253","40":"Diary_0253","41":"Diary_0253","42":"Diary_0253","43":"Diary_0253","44":"Diary_0253","45":"Diary_0253","46":"Diary_0253","47":"Diary_0253","48":"Diary_0253","49":"Diary_0253","50":"Diary_0253","51":"Diary_0253","52":"Diary_0253","53":"Diary_0253","54":"Diary_0253","55":"Diary_0253","56":"Diary_0253","57":"Diary_0253","58":"Diary_0253","59":"Diary_0253","60":"Diary_0253","61":"Diary_0253","62":"Diary_0253","63":"Diary_0253","64":"Diary_0253","65":"Diary_0253","66":"Diary_0253","67":"Diary_0253","68":"Diary_0253","69":"Diary_0253","70":"Diary_0253","71":"Diary_0253","72":"Diary_0253","73":"Diary_0253","74":"Diary_0253","75":"Diary_0253","76":"Diary_0253","77":"Diary_0253","78":"Diary_0253","79":"Diary_0253","80":"Diary_0253","81":"Diary_0253","82":"Diary_0253","83":"Diary_0253","84":"Diary_0253","85":"Diary_0253","86":"Diary_0253","87":"Diary_0253","88":"Diary_0253","89":"Diary_0253","90":"Diary_0253","91":"Diary_0253","92":"Diary_0253","93":"Diary_0253","94":"Diary_0253","95":"Diary_0253","96":"Diary_0253","97":"Diary_0253","98":"Diary_0253","99":"Diary_0253","100":"Diary_0253","101":"Diary_0253","102":"Diary_0253","103":"Diary_0253","104":"Diary_0253","105":"Diary_0253","106":"Diary_0253","107":"Diary_0253","108":"Diary_0253","109":"Diary_0253","110":"Diary_0253","111":"Diary_0253","112":"Diary_0253","113":"Diary_0253","114":"Diary_0253","115":"Diary_0253","116":"Diary_0253","117":"Diary_0253","118":"Diary_0253","119":"Diary_0253","120":"Diary_0253","121":"Diary_0253","122":"Diary_0253","123":"Diary_0253","124":"Diary_0253","125":"Diary_0253","126":"Diary_0253","127":"Diary_0253","128":"Diary_0253","129":"Diary_0253","130":"Diary_0253","131":"Diary_0253","132":"Diary_0253","133":"Diary_0253","134":"Diary_0253","135":"Diary_0253","136":"Diary_0253","137":"Diary_0253","138":"Diary_0253"},"Date":{"0":"unknown","1":1661.0,"2":1662.0,"3":1663.0,"4":1664.0,"5":1665.0,"6":1666.0,"7":1667.0,"8":1668.0,"9":1669.0,"10":1670.0,"11":1671.0,"12":1672.0,"13":1673.0,"14":1674.0,"15":1675.0,"16":1676.0,"17":1677.0,"18":1678.0,"19":1679.0,"20":1680.0,"21":1681.0,"22":1682.0,"23":1683.0,"24":1684.0,"25":1685.0,"26":1686.0,"27":1687.0,"28":1691.0,"29":1692.0,"30":1693.0,"31":1694.0,"32":1695.0,"33":1696.0,"34":1697.0,"35":1698.0,"36":1699.0,"37":1700.0,"38":1701.0,"39":1702.0,"40":1703.0,"41":1704.0,"42":1705.0,"43":1706.0,"44":1707.0,"45":1708.0,"46":1709.0,"47":1710.0,"48":1711.0,"49":1712.0,"50":1713.0,"51":1714.0,"52":1715.0,"53":1716.0,"54":1717.0,"55":1718.0,"56":1719.0,"57":1720.0,"58":1721.0,"59":1722.0,"60":1723.0,"61":1724.0,"62":1725.0,"63":1726.0,"64":1727.0,"65":1729.0,"66":1730.0,"67":1731.0,"68":1732.0,"69":1733.0,"70":1734.0,"71":1735.0,"72":1736.0,"73":1737.0,"74":1738.0,"75":1739.0,"76":1740.0,"77":1741.0,"78":1742.0,"79":1743.0,"80":1744.0,"81":1745.0,"82":1746.0,"83":1747.0,"84":1748.0,"85":1749.0,"86":1750.0,"87":1751.0,"88":1752.0,"89":1756.0,"90":1757.0,"91":1758.0,"92":1768.0,"93":1769.0,"94":1770.0,"95":1772.0,"96":1782.0,"97":1783.0,"98":1786.0,"99":1787.0,"100":1788.0,"101":1789.0,"102":1794.0,"103":1795.0,"104":1796.0,"105":1797.0,"106":1798.0,"107":1799.0,"108":1800.0,"109":1801.0,"110":1802.0,"111":1803.0,"112":1804.0,"113":1805.0,"114":1809.0,"115":1810.0,"116":1811.0,"117":1813.0,"118":1814.0,"119":1815.0,"120":1816.0,"121":1817.0,"122":1818.0,"123":1820.0,"124":1821.0,"125":1825.0,"126":1826.0,"127":1827.0,"128":1829.0,"129":1830.0,"130":1831.0,"131":1832.0,"132":1833.0,"133":1834.0,"134":1835.0,"135":1836.0,"136":1837.0,"137":1838.0,"138":1839.0},"Entry":{"0":"\n\nWednesday\n\n","1":" - Day of Embarkation\n\nLeft Liverpool 11.50 & arrSydney station at 5 to 1numerous haltsapparently without reason:Soon ascertained troopswere withdifficulty proceeding in single file - decidedtomarch in pairsby joining hands but owing to numerous halts abandoned scheme. At 2.20 I was still in eddy avenue. Here saw Ivy Ormsby & later Nina Kelly. Before passinginto GeorgeStsaw one whom I was glad to see & she walked in with me. All attempt to march in military formation having been abandoned We still wandered it was not even walking so dense& so insistent was the crowds. Everyone desiredto shake ones hand. say good byeIt seemed they were glad to get rid of us. To me it all seemed so much rotasthesepeople yesterday neither knew of nor cared for me & yet today overflowing with sympathy & well wishes. If they thought so much of the soldierelementthey might have demonstrated it to the men during the periodthey were staying in Sydney prior to their embarkation. On Brickfield Hillmet my mother & sister & walked with them on edge of crowd. Am afraid mum will break down so persuadeher to leave me & afterwards rejoin me at St Mary. Route of procession is Eddy Avenue Rawson Place George St Martin place Moore St Castlereagh St Hunter St MacquarieSt St MaryRdStJohns CrescenttoNo 1 Warburton.\n\nAt Queens place mater& sister found me & I said goodbye for last time & moved away quickly with a heart filled nigh to bursting as canbe well imagined - saw Mrs Crachersfriend. MetBenPrice who informed me that twomen one elderly was waiting for me suppose it to be Hawkins. At bottom also met Her& we marched together\n\ntowharf. After other parting this was indeed bitter. But she bore it bravely & we parted perhaps never to meet again even if I survive. At wharf crowd has closed in & there was no way. Forcedmy way in & found no one. Returned & directed troops to our standard&again met Her. This parting was more bitter and she almost broke down. But she is brave. See MCleamon& promise tobring her down but never return as reinforcement is almost ready & cannot get out. We move on wharf & finally on board. Pay starts& am in middle of it as ship moves away from wharf cannot get upon deck but cast a hurried glance thro a port hole but fail to seeher. Luckhas been given me on wharf. It was Hawkinswho sought me & he has given me a letter to Arthur Masonstrangehis wife isMissGraham of Greenwich if I remember rightly. Work israpid& continuousbutfinally all square about 9. & we found we rest in servicetill 11amnextmorning so rumour says.\n","2":"\n\nWe up anchor at 6am & proceed out - cannot see anyone at Hy. Bl.but wave continuously. Sometimes I think I see a wave but am not sure. But continue waving.I am standingon Hurricane deck under boats I continue towave till we have passed Heads & after leaving pilotcontinue waving \nfor\n till we are about 5 miles away & my arm is tired. Sea is like glass. We carry on for about 20 M & then turn south so away go our hopes of Panama. We keepland all day so Panamaseems farther away. No work today. There is a swell & everyone is sick.\n","3":"\n\nI am deck orderly officer today & have quite a busy time instructing an stowing hammock in.At 11am grand inspection by CO ship & OCtroops. Captain is careful about closing\n\nport holes so this looks like heavy weather coming on. There is a good pitchingbut nothing to speak of. Ship is a good weather boat. On her previous voyage 12 men left her because they thought she was topheavy.This is untrue Her rolling powersonlast voyage more due to the fact that boat was in ballastAllotment in boat stationcame out today. I get a collapsible boat out on arrangement. - Speedis 11 ½today Price is our orderly he has been valet to an Indian Rajah & hotel waiter at Australia - some orderly eh! I am sitting at head table with Carmichael& Pearce opp. Major CrespinCO Troops, SMO & adjutant BorrodenThis is shortest day in year & it has passed somehow.\n","4":"\n (Sat)\n\nOut of sight of land - supposed to have entered Bass Strait last night midnight. Thoughts returnof home & for a moment one thinks deeply but \na wave \nspray breaking over deck & the cheers of the men who have not been wet by it change one thoughts whch are resumed only to be interrupted by some one making a complaint or asking information. Mole& myself divide duty between us. As is his day on duty today & I am off I will try& learn some German. The task does not seem very hopeful asone book says it is necessary to learn 10,000 words before one can hope to be fluent. \n","5":"\n Sun\n\nDecide to go to C of E padre who has been an infantryman at front & stretcher bearer in BMC & has been once wounded. There were only 2 services Protestant & RC Gorrie took protestant as Prespadreis ill. Service is very impressive amid the waste of water - no land in sight. Hymns very appropriate. Our eyes fill with tears\n\nwhen prayers for loved ones at home are offered up. We hear today that mail closes Tuesday to allow censor to finish it by Thursday. All officers are appointed Censor & Padres chief censors Such a job Inever desire againApart from prying into other peoples private affairs the amount of work and the tiresome nature of it is beyond belief.Germanhas now gone by board as some men have written as many as 42letters & postcards. There are only 150 men in unit but thank goodness each one does not write so many. \n","6":"Mon\n\nStill censoring - sea is a longer swell & the ship is rolling more. Tonight there is a concert. I start to go & met the C of E padre & speak of censoring letters in French. Later in evening we met on deck & find a masonic bond thro speakingof Rasocrucians I see hisMasonic Bible & certificates & afterward return to censoring. \n","7":"\n\nI am ships orderly officer. - slidout of sight of land sea running a heavy swell beamsea. Make formal inspection of ship with \"red men\". We are travelingas a dark ship - no light at all being visible - passed a 4 masted steamer this afternoon - \nleft\nBoat stationpractised this afternoon. Bates goes to Hospital - spend night in cabin with German againbut go to sleep.\n\nCensoringgives amusing episode\n\nWe areescortingtwo man of war\n\nkeepwellMum & ask dad to throw beer in though I dont suppose he will for me\n","8":"\n\nRain squalls all day - remained below - boatstationspractised in afternoon\n","9":"\nexpected to reach land 2am yesterday still no landin sight. Very heavy sea during the night& in morning Molesworthclothes are wet though mine have escaped by sherluck This morning a heavy gale isblowing. white horses everywhere. Ship is punching her waythrow& they sayall decks even to promenade with heavy cloudsof spray - on either side of bows water displaced as she buries herself is lashed into a broad white way by wind. Land is visible every now & again through the showers. Occasionally a ray of sunshine addsbrilliance to the scene. I spend most of morning watching the sea. At\n dinner\nluncheon I have smoke with Corre Varis& he lends me a book. While talking to him ship enters smooth water. at 7.45pm. We go up on deck & find ourselves in an open roadstead- very rough as westerly gales still raging. No sign of Albany visible We continue on & passin & thenceAlbany. We let go starboard anchor& as itfails to holdthe other one moor in mid stream. Areboard by Naval& militarypeopleHMC etc Albany is a quaint little town at the foot of a high \nhigh\nhill with a black prominent cliff. Harbour is good&safe though on large size as windshave goodplay on water. We put ashore VD. Padres SMO YMCA& ACF & adjutant go ashore - no leave for remainder - but coalhulks & 1 water tank come alongside & we ship 450 tons of coal due to leave 8pm tomorrow. I have sent ashore 2 telegrams 1 home & 1 other. perhaps the post mark will give portat which we have arrived Have just stepped up on deck to see Albany by night Scene is very pretty with moon on water & lights in distance. Coalingis going on just over our heads is very noisy probably no sleep tonight. 4 gangs are at work each shifting 20 tons per hour. While coaling lasts no sleep is possible. In addition to coal hulks (one is called Kelat) on both sides we have a water tank unit heavygoing all night. Party onshore have not returned. YMCAis\n\n\n\nNoteYMCA Sydney 100swent ashore\n\nloaded with commissions over£100& hassent 450 telegrams back. When the shore party return it is over the coal & coal hulks. Met customs officer & he tells me vessel is to sail at 7 am tomorrow.\n","10":"\n\n\nArise early- & try my usual warm saltwater plunge but warm water is off as we are in port. I hurriedly dress myself to go up & see land before ship sails. Weatheris very cold - a strong north wester is blowing.\n\nThe water is deep inside with good holding ground elsewhere the water is shallow& vergesto a bright green near shore - prominent basalt cliffs jut out especially on Melville. In many other parts white patches of sand resembling in many places chalkcliff. Ground is barren - no trees save one clump -practicallyno habitations save at township. I take some photos but expect no results. Have seen sun rise over land for perhaps the last time. very prettyrising \noyt\n over headlands which rose in tiers & interspersed knolls. Now told that ship will not sail till 10. It must await train from Perth When train arrives it brings nothing for ship but as ship has waited it can go. Another example of general orders being forgotten by someone.\n\nStill some delay but at noon we move off. Pass on starboard rock marked basalt. This is evidently volcanic & for most part is destitute of even grass which Passingdown we passed Michaelmas Is. resembling somewhatin shape & position Lion Island at Broken Bay. then Breaksea a long basalt rock covered in parts with a green carpet of moss or small shrub. Waves are atomised on cliff & thrown in white clouds along cliffs for considerable distances. In other parts beautiful cascades are formed one especially right beneathLighthouse. Flag at lighthouse blue ensign dipped three times to us & people wave.View ofSound withwarm sunplaying on our quarterfor first time & sparkling over waters is very pretty. Our last glimpses of Australia in spite of its barrennessis one of sparkling waters & white beaches. It takes 1\/2 half from mooring to cross out passing out at 12.30. The sea is fairly rough & increases to galetoward night. The heaviest roll we have had so far. In cabin I was readingMoles cabin trunk knocks me off my feet & books fly at my head from all shelves In midst of my attempts to save some things from falling light goes out & all is confusion. I take refuge in saloon above. One officer sitting on a bench is hurled across saloon & cannons of another officers (also on ground) feet & comes back. Well for us it is that dinner is finished. Even at dinner time pears from one table were hurled at feet of people on other side of saloon & now it is worse. Difficult it is to write & at each instant one must pause to grip the table. Outside it is a dark ship & a darker night. It is impossible to see your hand or find where the door is. I turn & fall down companion ladder but luckily my hand strikes & catches rail otherwise I should not have been here tonight. The waves show faintly luminous. She is punching her way thro & every now & again shudders from stem to stern During the night sea increases & we have some very heavy rolls some being as much as 30o especially in saloon after tea. Penby does his famous slide & collides with Creighton& quartet practice a major roll\n","11":"\n\nStill rolling heavy - few have slept during night Captain Jackson tells us ship can do much better & that he expects fine weatherbut we\n\nwill get it very rough round cape as we will strike it in mid winter. One officer at this time of year did 70 miles per day. Sea is so rough that Capt takes off engines to allow me to draw their meals at galley Ships run so far for 24 hours has been 253 & there aboutslast 24 hours she has averaged 10 knots. The sea is not exactly rough but wind is almost a hurricane. Many of caps of waves wash over bow& are carried to promenade deck. Too rough this afternoon for usual boatstations. At dinner tonight OC announces a concert among the officers & Carmichael asks me to collect the artists& invite the sisters In midst CSM see me re VD space below & engages me till nearly 8 Igo in one nearbybunkin whichshe is lying down seasick &converse with this unknown sister in the dark just tocheer her up as she is too\n dark\nsick to come to concert. I then go aloft to find captain &my word but I never knew it was blowing so hard. I find wireless room & knock & instantly lights go out & operator comes out. He shows me captain cabin but yell as loud as I can one can scarcely hear. Coming down & attempt to decidewhether to hang on & get wetor move forward & be blown away. Wind is hurricane speed. Impromptu concert is a great success. This afternoon I forgot to state Penly repeated his sliding act& covered Carmichael with tea. Carmichael goes below changes & he's down in about ¼hour ship ships a sea & flings it against Carmichael porthole which is not properly closed & thoroughly drenches him. I return him his book \"L'amant de la petite Dubois\" a french romance he had previously lent me.\n\nList of officers on board\nOCTroopsMajor Crespin Adj. Lt Borrowman\nN3 Sutton& Harod \nN5 Elliot& Parsons AMC\nN4Kidd & Hawkins Major Griffiths\nN6 Little G C & Uren Cap. McCutcheon\nN7 Scanlon & Lea \" Cochrane\nN8 Little & Molesworth \" Love\nN9 Penly & Creighton \" Meagher\n\n Capt O. Behram(Dental)\n\nSisters\nI Lambert ThomasCurtain MacDonell Black Smith O'Donnell\n\nAttached\nEllis NMCR Pearce HCF\n\nPadres\nMangon RC Gorrie C of E Rankin Pres\n\nAfter concert for first time I play draughts with Rankin then promenade the deck a risky performance on a dark ship in a rough sea &retire. At 1 I am awakened Molesworth has been been bombarded by flying missiles Everythingis adrift. Ship is doing very good at rolling. Cabin next door has 2 inches of water all over the floor & we take some of their goods into our cabin At 4.15 I am again awakened Molesworth trunkis rolling from one side of cabin to other & striking wooden partition of next cabin very forcibly every timeWe let it go & sleep. Molesworth cant sleep. Few on ship have slept.\n","12":"\n (11)Eleventh day out. Truly ship has excelled herself at rolling. Captain has eased boat at 11 pm last night at 8 am this morning she is doing 4 knots & has done 160 mile in last 24 hrs. Nochurch parade today as weather is too rough I seize","13":" gambling school in N 9. Go up on promenade deck before dinner & she does some beautiful rolls but she is so quick at recovering herself that I am never afraid. At dinner it is eat when you & holdon all the time. The water in reservoir has run over withroll& wet all my clothes. Trunks are now lashed up.\n","14":"\n (12) Still veryheavy roll ship eased for breakfast. Drill commenced today but men are not yet steady. Much confusion exists as this is first parade. Very heavy rolling all night. Port engine stopped on account of a hot bearing - Rolls over her scuppers Majors Lecture.\n","15":"\n (13)\n\nShip has had very bad night & is eased up for breakfast - has in spite of yesterdays mishap & stoppages covered 273 miles - expect to reach Durban Monday week. Drill as usual - Concert at night N2Sudden lurch ends performance of band & ship -band & all officers catapultedinto one used jumble in corner.Fortunately no one is hurt though chairs are splintered into matchwood. Light is placed in wrong place & ship\n\n\n\nofficers close it down. Concert proceeds in dark but keep on meansare invisible - we proceedwith a torch Concert in dark is very weird - no light whatsoever & the phantom shapes on a rolling platform - the darkness lit now & then by bright points of cigarette ends The sides seem to be rolling aboutin space.The journeyfrom saloon toconcert was weird asship is dark & we had to hang on to each otherwhen ship allowed it & Molefelt his way. After concert continue German with interruption from Penly & find Behren can speak German.\n","16":"\n-18 Wed\n.(14)\n\nNight has been much quieter - Drill as usual this morning but as we are duty company only about 20 men on parade. Sea is calm & sun is warm we are evidently in Tropics - have lost touch with Perth wireless today. This afternoon sports of N2no parade. Chatsdiscovered in N2 & our guard washed & fumigated This afternooon sport and CSM writing out a general order. Ernstrepair books. Digweeddistributes citrate of magnesia. Tonight lecture by Major Griffiths on VD & the Empire & chatted with Padre Gorrie after. Before dinner yarned with Carmichael & consumed of his hospitality After dinner went up on deck & marched like kids arm in arm, in single file, &hip onhip on the dark deck If we lose touch we bump each. Break dish today.\n","17":" 15 \n\nI rise later & sleepier each morning. This morning the boy woke me & drank the coffee & slept again. After breakfast came the usual parade & after dinner owing to a case of measles All officers & the 7 sisters go into the inhalation room & thence to parade. Sea is calm now boat scarcely rolls - a strange occurrence. Days here in the tropics of the Indian are always the same. Dull grey morning which burst into \nsilvery\nbright sunshine(which turns the water silvery) about 11 & continues so till near 4 when the day turns grey again. This morning about 1 pm whilst at luncheon the day seemed very grey & the horizon closer & yet shadowy & ill defined\n\nAfter a while I found we were passing through a bank of fog \nat.\nThis afternoon delivered a lecture to NCO. At dinner tonight we drink toast of allies as this is Independence Day & attempt to play Star Spangled Banner but no one knows it in any key whether whiskey or Yankee. Very good concert tonight but it lacks eeriness of other concerts as aconcealed light is used and sea is smooth.\n","18":"\n (16) Sea still calm - rose 6.30 & visited men & then wentupon deck & gazed at ocean Everywhere the same grey sky - grey almost blue grey in someplaces in others just thinning to show lighter clouds Vessel crushingwaves into pretty blues - ascrestleadsagain into the main whilstalongside the foam of vanished & seething water lendsthe only bit of colourto the sceneThe monotonous & irresistibledrawing of the vessel thro the waste seems unnatural & I turn my eyes out to sea where only solitude & the restless sea exists & lose myself in them Then someone interrupts & I come back again. Capt tells us Llandovey Castle a hospital ship of Union Castle Line which he has builtsuperintended has been sunk. After breakfast parade physical training & in afternoon the same. Spent most of day censoring letters only to receive twice as many to be censored. Tonight at dinner Capt explained gross,net& registered tonnage & Simpson's rule also that yachts pay no dues or wharfage. After dinner lecture onGas& officers concert & then long talk with C of E padre.\n","19":"\n (17)\n\nIn the morning the parade as usual but the afternoon \nDans le mater le\n is reserved for sports. Today it is boxing & there is some good sport. I and the officers are up on the boat deck & the men everywhere. One chap up a rope when told to come down lets go & gracefully slides down. Boat rolls & 100 men fall over. One is hurt I think. Sgt gets so excited that he yells directions which cannot be heard below\n\n& nearly falls overboard. Wind is very cold at night 8pm we organise a meeting of Masons on board. We turned to number of 27 \n30\nexpelling nurses from saloon. I am nominated SW. We decide hold similar meeting every week., to visit lodge at every port, to help each other, to have a dinner on board & to print a souvenir at Durban meeting disperses at 9.30 as men are waiting to sleep in saloon.\n","20":"\n (18)\n\nChurch service as usual. Glorious day - no sea Toward end of service sun disappears & the wind is cold. Letters are rolling in again & I pass all day censoring or sleeping only to find that at 7pm I am presented with about 500 extra letters the result of the days work by the men. In future I think I must find work for them.\n","21":"\n (19)Sleepier than usual this morning. Usual routine breakfast parade - use medicine ball for first time. Parade at 2 pm ocuppy¼ usual space & CO is annoyed because his game of quoits is disturbed. Tonight Carmichaels lecture on Paschendale 1st engagement5,000 prisoners then 8 days rest & slaughter of us. Impromptu concert. As I am ships orderly officer make round of ship after lights out . Ship is like a rock now. Distance 2326 M to Durban.\n","22":"\n (20) nosea - ship has forgottenevenhow to roll. Am orderly officer ship & rise early - shower- a par boiled ballas there is no cold water. Ship inspection means visit to AftGun Deck which is used as a isolation hospital for measles. Deck has awning low & covered at side with tarpaulins - ideal airyhospital so long as \nar\nrain hangs off - men are in ships hanging cots - an excellent idea - it gives shelter from weather to a small extent. In aftenoon deliver lecture to N.C.O. & then turn in early as head is aching.\n\n\n","23":"\n (21) Off duty can lie in - have a good bath & then back to bed to cool - Before breakfast go up on deck. One of the finest mornings possible. trulywe are in tropics - the calm blue sea the suggestion of heat in a cool summer morning a picture fringe of cloud low on the sky. one instinctively turns to lookforthe for the broken fringe of surf which marks the coral reef but alasonly water - we are in mid Indian Ocean exactly1000 milessouth of Mauritius the Capt told me as he affectionately placed his arm aroundmy waist After breakfast make an inspection of men for purpose of finding men for duty while at Durban. In the afternoon we have our company sports wheelbarrow race - obstacle race (under seat, then roll a distance, then crawl then somersault, then run & vault over chair withdanger of splitting thru head)apple & treacle, knocking out of ring tug-of-war. Excitement ran high & men thoroughly enjoyed themselves Among the competition competition was keen. In obstacle race there was one man left so he did course alone with more cheering & encouragement than if he had a big field. & he responded & went as hard as he could just as if there were other competitors in the race. Owing to company being on guard I had to postpone sports as they were unfinished. Atnight in the troop deckswe had a cribbage & euchre tournament. Tonight we have had almost a riot in the mess as one of the ships wireless men has been carpeted for smoking in the saloon & has objected to others doing same thing. Consequently all military officers are requested to refrain from smoking till 9.30 pm. OC is furious. At dinner we arrange to leave as a body when Capt. rises & leave the ships officers the saloon. Action is unanimous & itwas difficult for me as I had to stop CO from leaving before skipper. Tonight I delivered a lecture to the officers re Hygieneships officers were absent. Also padres owing to a concert in B-deck So much the better I thought. After lecture I was bombarded with\n\nquestions but successfully fenced or answered them.\n\n11-7-18 (Thurs)\n (22)\n\nUsual routine - boil in bath - 645 return to bed - rise again 8.10 - shore - go on deck at 8.25 - five minutes an & then breakfast. Parade at 9.15am. Afternoon pay of£1 to each man desiring it. ie 1\/- per day calculated to nearest 10\/- Paybooks have to be signed in 2 places acquisitionsroll by men & paybookby me. I am not touching my pay as yet. There is£10 for me, menonly touch£2.10.0 during voyage. Meals are touchy at king table each officer excuses himself & retires as soon as possible. It is the smoking trouble still rankling. At dinner all leave in a body again. All day long have utilised Bartlet Taylor Bate & Blackett (a cousin of Blackett the barrister) all ex officers to do censoring in my cabin. Mail has closed today at midday for the men. Tonight as I write\nthars\n this officers &nursesare coming back from concert & are amusing themselves talking in gibberish imitating the nigger stewards but which is laughable all the same. Theyhave been singing just now. None of them has the least conception of music. The exhibition was veryfunny particularly as in event of a pause the words of another song were sung in rapidlywith wonderful results. I am sitting alone aloof from others & nurses- writing this & some letter home presently. A solitary man alone with his thoughts not caring for the thoughts of others or desiring to share them. The majority of officers here are the men who previously were Staff Sergeant Majors & for the most part they are not particularly well bred & their manner of eating at table is rather nauseating to anyone with refinement. I prefer my own thoughtsto their company. Molesworth is a boy beside me\nn\n& between his thoughts & mine there is all the breadth of an educated man & a schoolboy.\n\n12-7-18 Frid\n (28)\n\nUsual routine. Sea is still calm & the sky the\n\nsame Indian or rather semi tropical morning that I have described before. Deck officer today Molesworth is now permanently detached for the ceremonial guard & thus free. Little time to myself to-day. This afternoon usual routine. Molesworthis preparing his lecture for to-night - Dinner & after that Molesworth's lecture. Then the usual Friday night concert & topical song - a versesetting out the events of the week & considering any officer.\n\n13-7-18 Sat\n (23) Parade as usual - at 2pm boxing tournament continued. weak exhibition - fought on starboard side aft well deck - Muldon (13.5) has a byebut puts up an exhibition spar. Taps several times successively - takes hits on jaw & shows very clever footwork. At night continue the good work of writing home - hope letters give more pleasure at home than it gives me to write them. We yarn with padre Rankin.\n\n14-7-18 Sun\n (24)\n\nHave waiting till midnight to seeday in & immediately commenced a letter. Tho Sunday refuse to go to church & spend day in cabin in communion with her Finish a letter to her & wonder what she does, & does she remember this day of days. In afternoon pass with Sainton. He has been 4th mate of a ship & was on La France & GerardDusquesneas gunner. His leg was broken at Sydney & sent to Georges Head Hospital. When well his ship has sailed & he is ordered to join up at Noumea on 1 days notice. He asks permission to join up with AIF which is granted. He tells me of Marie Ducesnehis one time fiancee who has called his lack Littleshe knows him who has enlisted with a defective heart. Before this I have avoided him because memories would \nhave\nbeen too strong but today I welcome him a voice which reminds & saddens. Thus passed this day of sweetest memory which saddens while it inspired. At mess we drank the health ofFrance & band played Marseillaise whilst we stood to attention. Write to Hawkins & McDougall this time. Censorship is still going on. \n\n15-7-18\n (Mon) 25\n\nHave been expecting to reach land all day. Sight it at 1 pm Day is clear but course of boat peculiar she goes due North & then in a circle. The day is very clear & warm & sea smooth. As we wait for pilot we see large tug towing a whaler & have to wait for next tug. There are 3tugsin this port supposed to be the three most powerful in world as breakwater is narrow& agale would have powerful effect on a sailing ship The tugs are bigger than old north coaster with twin screws - flying bridges etc with one or two yellow funnels. Single funnel is Harry Escombe & another is Richard Hill. It was the latter which met us . All hands go to boat stations.All troops had previously gone to one side & her rudder was hard over & the list was so pronounced that Capt was scared. The port is as per map. Water evennear wharf is shallow except where dredged. Dredges here are a powerful fleet (Nautilus, Cetusetc). We berth near breakwater heading as for sea. Men now start throwing coins to natives to see the fight that occurs for each penny. Some pennies have been heated. The natives are like gibbering monkeys. The demand for money is right hand thrown from left shoulder to side. then both palms turned up hollowed. My post during entrance is upon ladder. Price is near at hand. When alongside the sionquay like noumea with large sheds along quay & between sheds & water the railway line gauge 3‘6\". When gangway off. \nStaff\ncivilmilitary & naval officers to number of about 40 board vessel. No quarantine. Whilst waiting for this watch natives dressed in multitudes of rags on wharf begging & scrambling. Miss Ellen MCampbell sister of Dr Campbell is alongside in a Ford car (the inevitable Ford) & passes oranges, signals greeting etc. Two well dressed niggers escorted by a wild object in rags who makes room for them. Leave is granted tonight & at 6 pm we all fall in on wharf & march to Town Hall & are dismissed. NCis exceptionally steady. We are then dismissed to fall in at 10 pm. March 40 minutes. Carmichael in charge of parade dismissesit with officers in rank & owes drinks. He collects available officers & goes to Royal Hotel (see photos). Refusalto give drinks save with\n\nmeals & Carm. busses off to send cables which are not sent. Some of officers then proceed to Durban Club. (A magnificent mansion used in Boer War as HQ & enlarged by Govt. still£28,000 in debt.) On the Marine Esplanade. We make ourselves honorary members by signing a book & buy books of coupons (10\/- & 5\/-) to purchase articles. Drinks are obtained & we set out to dine. Urenwanting oyster saloon. Party was Scanlon Little, Harrod Urenmyself & Scotson. At Club one man makes himself our host for the whole of one shout. Party loses Scanlon & Little & proceeds to Grosvenor. Place is almost empty & we go into smaller room. Onetable a colonel & staff captain, at another 1 officer & girl, another thereCSM & girl etc. Urenmethod of eating disgustsme & I have to regard ceiling intently. Drinks are unobtainable here as elsewhere after 8 pm even with meals. We leave & go out only to be assailed by rickshaboys. These are zulus (see photos) who earn large money, retire to hills, buy wines, drink,leave off exercise contract a heart trouble &die. Usual life is said to be 3 to 4years. We take a tram to Beach (Marine Parade) a beach with chairs,walk, abundance of side shows & catch pennies like Glenelg - lose Harrod & Uren.Scotson & I decide to walk back purchasing post cards on route. Fall in at 10 pm & march back to boat. When on board tearing & crashing sounds forwards &boat \ntwis\nrollsslowly but continuously to \nport\nstarboardAll make sure she is capsizing. I decide to order troops to port side to counterbalance weight but thinking everyone else may go funky & do same order them to stand fast. List ceases but is still considerable & remains like that for night. Starboard tanks only had been filled while port boilers emptied & the boat was heldupright by springs. The weight of troops was sufficient to upset balance & springs broke or tore up the iron attachments& over she went.\n\n16-7-18 (Tues)\n 26\n\nI am detailedas thedaypicquetas Molesworth was on last night. I report at 9 am to APM. Capt Smith (staff colour is blue here as Dutch object to red) who is not there. W.O gives me a guide toPolice Court & we\n\nfind a large room set aside for purpose. I return to APM who does not want or expect me till 2 pm & in no case wants patrolsout byday picquet. We are merely a reserve. I arrangeshifts - allow balance to go on leave for fixed periods. Digweed is here. My H.Q is Durban Club or Royal Hotel but I must not wander elsewhere. In court is a long queue of ricksha boys re registering & near entrance we pass a lightly clad, slight native with headdress 2 ft long. This is her hair bound up with string & taking about 7\/10 months to do up. I go to Royal for morning tea but find no one to talk to or interest me. I then go to Museum in Town Hall buildings. Collection is small contained in 2 large rooms but several fine specimens of large animals, eg.hartebeeste,eland,\ngazelle\ndeerwildebeeste & lions while the evolution horse from fox size to present size by jawbones & hoof (once 5 toes) is illustrated. Also an excellent piece of colouration - a bird on nest impossible to detect at first sight. Also difference between male & female insects. There is also a Japanese land crab. Body about 1 foot diameter legs about 5 to 6 ft long & 2 ins thick. Claws as bigas my hand. side legs about 2 ftlong. There is also a cococraba pigmy alongside this animal. From Museum I mount to Art Gallery on next floor. This again is small but contain (1) a dying tigers head inverted by Sir W Landseer (2) a landscape with shore in whites & greys by Leader (3)Pursuit of Pleasure. A woman naked with figure of Medici & alluring face is pursued by a crowd of all ranks - women as beautiful as herself are trodden underneath by crowd. Flesh of women seems natural. How I do not know It is smoother than varnished oil. (4) Many excellent copies of Italian masters GiottoDa Vinci, (including one of Mona Lisa) & Titians (Last Supper) From gallery returned to piquet & thence to Durban Club for lunch. Lunch is not as good as I would expect from such a wealthy Club with native labour in fact University Club is equally as good. A naval officer in civilian attire lunches next to me & as usual asks impression Ipoint out the absence of girls or rather abundance of men & apparently strike a sore point as S.A men do not enlist readily. Sedition is rife & in fact very little would cause a warA plot today at Pretoria to seize members of Govt has just been thwarted\n\nI speak of the extraordinary thickankles of the girls here & suspect that it is a relic of their Dutch extraction He tells me of a master who in recent years sailed his ship thru breakwater. He was fined£100 as if he had stranded the whole harbour might have silted up. The fine was remitted afterwards by public petition. This afternoon I intended to go to Zoo but wait for APM to go to tea. I stand outside station & met Molesworth & SMO who inform me ship may sail tomorrow. OC & adjutant join party & all take ricksha for beach. I thinkset out to search for MasonicHall & find \ni\nthat there is ameeting tonight; Wed Installation SC Thur Royal Arch SC working Mark Frid. Grand lodge SC Sat Installation 3pm & dance 8 pm. On way back a soldier & mason intrduces me to his cousin McIvorwhom I take over to Digweedwho is out. Digweed returns with Brewster & ( McIvor returns about 6pm.) We decide to form a party & go tonight. I set off now 4pm for afternoon tea at resort of the beautiful of Durban The Model Dairy(kept by one Baynes) On way meet Penly & buy a butterknife 10\/6for mater & Ruffbox for Mollie (7\/6) with Durban coat of arms thereon & then Penly refusesto tea & I teawith cold drinks alas without the beautiful but many staff officer & a live Bg general Creighton relieves me & I go to Royal met Pearce (a surly cub with unlimited cash going across to represent ACF but will soon be returned on arrival as useless) I walk around town for a while. Finally I leave him & go to dine at Lounge. After waiting 3\/4 hour I go out without being served. Try Royal & find Pearce OC Troops & adjutant joins us. I have mixed grill (1\/9) not much chop sausages 2 in long & chop invisible. I leave here for Masonic Lodge Ceremony is IC Salute is different. It is installation 1) W.O. Roberts. Opens in 10receive visitors - Installing master appoints his officers - Presentation of W M elect - D ofC recites ancient charges - B.B retire. Conclave of PM. BB return WM proclaimed in S then W then E - Presentation of Maul collar, jewel, USL Book of Constitution & Byelaws & Warrant of Lodge. WM saluted by Lodge. Investiture of Officers & address to them. Collection in aid of Benevolent fund from all & closes. Menu Fish poultry cold meats & saladscold pie fruit sweets, cheese, fruit. Toasts(1) King (2)- the 4 const. (3) Prov. GM & officers IC (4) absent BB (5) Dist GMN Natal EC SC & visitors (6) WM & new enlstofficers - The Tylers toast.\n\nAt intervalmet Capt Sutherland OC No 1 sector Congella Camp & Lt Sutherland Royal Scots. Whisky is abundant especially during the interval. Grand lodge does not make a statement in Lodge. Door is actually locked. I wear Green SC apron edged with Gordon tartan &green yellow crossings. blueband 2 black lines ground green blue band 2 double black\n\nWe all return home in rickshas & go on board.\n\nWe\n","24":"27\n\nParade at 9 am & march via Marine Esplanade to Park. Leave No 2 & Molesworth to clean up & move off N 8in rear. They march well & like soldiers in fact are the only soldiers in column. Near beach the old guard join having marched there direct under Sgt Davidson (Of LIsmore). Column proceeds to Beach for swim. Municipal authorities place baths at our exclusive disposal till 2 pm. N 8 is last in but gets all the gifts of the folks. Pretty girls & ugly fat women are in abundance in the chairs (free) & motor cars are plentiful While troops are swimming we Penly Scotson & I have ice cream & tea & cakes (3\/4) woman waiter cannot understand what is an ice creamsoda & brings first an ice cream then puts ice cream in soda & when asked to add flavouring brings a glass of raspberry & water. After swim troops are marched to rear of Beach. dismissed. I then wander on thro native quarter & outskirts of town to boat. Change into slacks as weather even tho this is winter is warm. Still coco palms are not fully grown & so I think there must be a small rainfall. I go to zoo & Mitchell Park meeting on tram Lee & Creighton (whom I soon drop as tastes dissimilar) I proceed via Musgrave St. Michell Park is a pretty little spot -thought it was botanicgardens at first trees overhang pleasant walks tho vegetation is not very varied.There is a tea room & tables on lawn also a tennis court in one corner. The zoo is within this park & is free to soldiers. The specimens are exceptionally good. The tiger is the largest I have seen & I waited ¼ hour to see it rise. The lion & lionesses are also magnificent\n\nwhile the collection of Australian animals & birds is very good. I return to town & decide to go to Umgeni where the river & mountain scenery is good. The baboons come out on road & scamper away in\n thousands\n groupsas tram passes. on return some chap in tram advises me to dine Grosvenor but I go to Marine Hotel - a vast structure on Esplanade & the last word in hotels a\/c Durban. Tariff here is Breakfast 3\/- Lunch 3\/- Dinner 4\/6 Daily tariff 15\/- Suites comprising Sitting room, Bedroom, Bathroom etc from 27\/6 & for two persons 42\/- per day. There is a new lounge, Palm Court & Private Ball Room. As no one is in dining room I start to make enquiries & find dinner is 7:30 As there was no one to ask I stopped an English Officer Lt. D. Ferraby","25":" East Yorks.Rgt & Lt. A Hutchinson","26":" East Yorks now both in KAR. Ferraby ask if I have ordered table as otherwise I will possibly not be able to get one & invite me to share their table if their table can be substituted for a table of 3. They go for brush up & ships captain comes in & asked if I am of the OC party. Ferraby comes back & goes into Dining room & comes back & informs me that all is well & we go in to dine. They insist that I shall l be their guest. We talk of many mattersand they sharply criticise the table manners of some of the Aust. officers. After dinner they tell me they have an engagment but will be going to a dance at Royal after & send me along at once with their apologies. Here I meet Mrs Jack Phillips PO Box331 Johannesburg. A fine tall & beautiful woman who is giving dance. She introduces me to some girls. Here are many officers of KAR who sail Friday & other officer. As well as all the wealth & all the beauty (mostly Jewish) of theRand. Names are too difficult to remember save Berman who asks me to a harbour excursion to Island tomorrow at 2. Ferraby will give merendezvous during march thro street tomorrow. I promise to look up Capt. P. Hayes","27":" Battalion (1917 Nov) & then Ricksha back to boat.\n","28":"\n (28)\n\nParade this morning via Esplanade. N 9 in rear under Creighton makes bad tail. Incident of Hawkins thence to Park where our team plays S. Africa. We score 100 & lose match by 20 runs only.Nowiseplays for them. Parade is reformed at 1.30 & dismissed. Hence no march thro city & I am stranded as I do not know arrangements for this afternoon. I go to Royal to see if I can find them Scotson accompanying me. Met Gorrie & decide to return with him to ship On way look into Town Hall which is not as big or as finished as ours. Here we meet Jan & Michel Chermasky & we go to book tickets after hearing them play. Then with Gorrie go to ship & change then we go to Botanical Gardens These are small like most other things here. There is no variety orsilence& palm & hot house are filled with ferns or young palms - no choice or rare plants. The place is artistically laid out but apparently is not yet finished as lower part is used as a tip The one point of beauty is a palm tree walk running at footof hill. Path is\n bot\n straight & level & here there are some borders & plants with perfume. We then walk along Bot.Garden road & catch tram to Tollgate & walk along to Mayville though it is too dark to see much thoughit would be beautiful in daylight One house on a hill standing back from road is fine effect. Then we return to Club & I met\n Pa\nMcCutcheon, Molesworth & Major Maxwell Lyte & dine with them. Lyte devotes much attention to me & talk turns on zoological subjects. Sample Dracenburg sherry & for a liquer Van der Hum. This is McCutcheon dinner, Major wine &my cigars (10deach) Conversation continues re animals. I ask re kraals& agree to see Major tomorrow re engage a car for visit to Drummonds (Valley of a 1000 Hills )£4-10-0 or Maritzburg£9-0-0 or Unkomaas£7-0-0 These are Cooks price & are for four persons. Car gets back by 5pm Starts about 9am\n\n20\n19\n- 7-18 (Frid)\n (29)\n\nToday is leave. Go up to Cook then to char alonethen to Major Lyte. He tells me Sunday is probably free for our trip to the Valley of a Thousand HIlls. We go to Belgrave Hotel. The barmaid is Lottie Little then to Base Commandant Office & after Major has taken me to last rank to F Kitchen 53 North St Telephone 2036 & arrange tentatively for Sunday. Thence to Raily a large building of redNGR has 4 platforms all trains for day are exhibited on indicators - turned down as train left. Railway are now consolidated in Dominion & are known as South African Railways. Thence to municipal markets - These are 3 long buildings running from street to street & abutting end to end. The first has meat, butter & egg - these are auctioned by sample & if bid is high enough the whole consignment is sold at thatprice. If price not high enough it is put up again. The native officials are always much in evidence. Next building is meat but mainly vegetables while third is grain & poultry. Meat here at auction sale at Municipal abattoirs at 11.30am ","29":" Carcasses of beef 38\/- max 20\/- min av. 29\/9 per 100lbs. Carcases of mutton 8½d max 2d min av.6d per lb. Carcases of pork 10d max 6½d min av.8½per lb. I then passed on to Indian market but being doubtful of my way asked the only white man I could see who said if I waited till he finished his conversation he would show me. He was Fred W Holmes ofHolmedene 55 Montpelier Rd Durban & an Inspector of Nuisance. The best man I could have found for it is his duty to visit kitchens &cafe's & the markets & he is about to commence a tour which he enlarges for my benefit. We pass by Mosque & enter a Kaffir restaurant consists of long tables covered with tinat far end is a counter. Tea is supplied free sugar & bread fora ration. In open square dishes 3' x3'x4\". One of these is piled with a soup with lumps of meat & fat in it. \nThese \n The other contains a gravy. Both are kept hot by an oil lamp. Food must be visible if dished from kitchen native would not eat it. One on made \"clinchies\" a lump of fat or \n\nmeat in a flour covering. Now flour is too dear. The proprietor seems to be a Greek. From here we pass to an Hindu or Indian restaurant. This is wealthier. Tables are covered with marbles. Often see a table with plenty of room & yet newcomer goes & sits in yard. This is because of a different caste sitting at the table. Food \ncons\nconsists of 3 courses served 1 big plate rice & 3 saucers 1 of ^white salad (onions)1 of soup (vegetable) &1 of stew& 1 spoon. With spoon alittle soup is put on a portion of rice & mixed with fingers & then eaten with fingers. Spoon only used to dish out. The kitchen resembles an ovalpicture. Open fireplace with great round marmites one large one is full to top with rice & is off fire. The others supply soup & stew. Outside in yard are the peelers & another open fireplace. In another small room is man making confectionery. Mealy is ground & sieved Then mixed with ingredients dipped in a cauldron of boiling syrup & then dried over fire. Confectionery contains an undue amount of sugar but looks tasty. Vegetables - even eschalots radishes etc are largely used. Pastry kitchen has modern stove. Red colouring at 20\/- per ½ lb is largely used in place of eggs. On my way out I taste chilie bites a batters with pieces of eschalots & lots of pepper. Burning taste remains in mouth for a long time. Anything I desire to taste is given to me on account of my friends position. The whole place is very clean for a foreign race. From here we proceed towards markets. These are approached by a street which about 4 till 6 am is a market itself. It is cleaned up by council men of waste leaves etc at about 11 am. The sight is very animated & worth seeing. In this street saw a Hindu with many cases of oranges, mandarins ready for shipment. Holmes asks me if I have tasted a \"naartjze\" (pron. narchee). On which vendor opens a case of each kind & gives me ½ dozmandarins6 oranges 6naartjze which is a cross between orange & a mandarin.Skin is thinner than mandarin We next go into a yard where banana packing is in prgress. Each bunch is cut into a hand of 6 or 7 according to number on stem, placed in case end up &then top filled in with the dead leaves \n\nHere I see for first time the jack fruit tree. It resembles \nsmall tr\ncontracted marrow with rough exterior & grows on the main stem of tree & not on a branch. The interior resembles pommegrante . We now enter the market (native part).\n\nA represents stalls having native work shields, sticks, books.Jewellery exhibited. In one of them a native is making theanklets & armlets we see on certain castes or tribes by binding silver wire round horse hair.B is a Zulu drinking garden. The liquor is supplied by council who regulate quantity of alcohol. When a fresh lot arrives a bell is rung & all natives at hand with a penny form a queue. They paymoney receive a ticket which they surrender at a stile & receives a pot of \" utywala\" or ijigi. No one can get a second helping without quitting & re-entering in his turn. I taste the drink it is thick & pink & has very sour taste. I amuse the Zulus by the faces I make when drinking. We then pass to C the dining tables. Food is great hunks of fat, liver, sweet meat or any other rejected part of animal. Mealie abounds & bread fills gaps. Also the greasy stew with lumps of fat - taro root, yams. See a Zulu woman with headdress & investigate it much to girls amusement. She has only a rough clotharound her shoulder & waist. Arms neck breast & legs exposed.Her head dress in about 2 ft long & took 10 to put up. The hair is wove in & plaited with strands of string or fibre. These girls are from a kraal on4 or 5 days leave granted by Govt & return at end of that time. Girl has a slight but well moulded figure. Then pass to snuff vendor & sample the snuff using a snuff spoon. It causes me to sneeze & old Zulu says it must be good. then visit the medicine men - herbalists - their initiate is mingled with superstitious ideas dislike amputation but cup much with end of a horn.Teeth are extracted bydigging it out with a spear or any sharp piece of iron. Medicines are made of decoctions of leaves, roots, without regard to size of dose. Often patient succumbs. Poultices \n\nof leaves or bark are used for sprains, sores etc. with good results. Pieces of fish, head of animals & skins of snakes, hyena, porcupine & iguana are also used. Horns are used for storing ingredients. Then visit butcher shop. This stock is all the offal of markets & heads - Every bit is utilised even if rotten. Then proceed to Hindu fish market. Big heap of heads of a large kind of fish. Then pass into HIndu market proper - fruit vegetables mainly though a little confectioneryStall or tables are close together & tended by a woman or young child. Hindu women if young could be pretty tho they disfigure themselves by putting big brooches throughtheir nose. I here again have right to taste whatever I desire. The girls are well developed women at 14 & are very pretty. There is every variety of fruit & vegetable & are of very good quality. We then visit a fakir or divination expert. He is seated squat legged - small box on which he burns a powder in front of him. ornamented with bead & sign of Vishuin white & red. His fingers nails are 4 to 6 inches long middle fingers being full 6 ins.Then visit Indian cemetery This is just an ordinary field no sigh of a grave yet. I am told that it is chock full of deal It is crossed by one narrow foot track. Then return to RC Cathedral called Emmanuel as there was no saint day on 25 Decthe day Natal was founded. Present Bishop is Bishop Lavelle who about 14 years broughtout station of Cross from France.These are carved out of stone & painted & are the finest sculpture in stone that I have seen. The pillar & arches of the nave are of imported Venetian marble The whole church is without colour & yet magnificent tho subdued The altar is however decoratedwith gold & pale blue. From here we go to Mosque. Shoes must be taken off before entry.The man washes his feet hands head ears & mouth. There are electric lights for night. He then mounts platfrom & go through purification prayer. Two kinds of bowing half down & on hands & knees.\n\nThen one waits to enter mosque. Here whole place is carpeted. These carpets are divided into two squares &each square represents on place. All sit crosslegged. There are no women. Priest read a script & then delivers a lecture. Always a thinshrill voice chants some little pharse at odd intervals. At conclusion priest descendsfrom rostrum, lays aside his staff & prays congregation salaaming when he does. We proceed to buy a m'weter = cn' wahitu & my friend demands that it should begiven to me. I then go to another shop & my friend obtains some sea horse or sjambok also for nothing but pay 4\/- for a 6\/- mooencha (spelt umtya)I proceed to shield factory. The leather is washed, soaked & cleaned & then stretched out to dry. It is then slit & pieces of other coloured strips of hair threaded thro it &grip made for fingers not hands. In one room see two native Zulu women in from kraal with their characteristichead dress chatting with their workmen perhaps their brother. They are light hearted slim creatures evidently having a good time & happy as can be. They are seated on mats. In next room a native with only a waist cloth on is making mealy that is crushing the white corn. Near we see a native stoning hisfeet which by constant stoning have become white. This is custom & is no more efficacious thanwashing. Then superintendent making of a snuff spoon. He carves it & then covers it with sealing wax put on a hot knife. Whole is then fileduntil the carving becomes apparent & whole is polished. Foot is usually used as anvil or rest.The finished articule is \nmade\n presented to me& demand for \" ticky\" which my friend tells me not to give. Holmes then finds a stick made of um-zim-beet (phon) Price is haggeled over by my friend in Zulu who beats price down to 2\/6 & tells me to give 2\/- rather a cheap stick. My friend here leaves me having invited me to his home tomorrow & informs me he is a Mason. He tells me that price of house here\n\nare very dear. usually cost about£1000 Rent is 7£ per month. Allotments are 50' +130' & for this you pay£700 to£1000. I return to boat with my curios& then to Railway. Trains for Zululand (North Coast) & south coast - distance may be judged by times between stations.\n\nPort Shepstone line North Coast Line 4 hrs 42 mins\n\nDurban 9.35 am 2.45 pm Durban 7.0 am\n\nBerea Rd 2.49 Greyville 7.4\n\nCongella 2.50 Churchill Rd 7.8\n\nUmbilo 3.3 Stamford Hill 7.13\n\nSC Junction 3.8 Umgeni 7.18\n\nClairwood 3.15 Greenwood Park 7.40\n\nMedebank 3.18 Red Hill 7.45\n\nReeds Sliding 3.21 Avoca 7.59\n\nReunion 3.24 Duff Road 8.10\n\nIsipingo - - Pohoenix 8.15\n\nUmbogentwini 3.28 Mt Edgecombe 8.25\n\nAmanzimtoti 3.46 Ottawa 8.33\n\nDoonside 3.57 Verulam 8.47\n\nWarner Beach 4.0 Umdhloti 8.56\n\nWinkle Spruit 4.6 Mt Moreland 9.7\n\nIllovoRiver 4.9 La Mercy 9.15\n\nIllovo Beach 4.19 Tongaat 9.45\n\nKarridene 4.22 Frasers 10 -\n\nUmgabad 4.29 Compensation 10.9\n\nDrift 4.40 Umhlali 10.19\n\nLR Umkonaasaar 4.44 Chaka's Kraal 10.30\n\n to drift returns to D at 11.56 pm Costs 17\/6 Tinley Manor 10.42\n\n Groutville 10.59\n\n Stanger 11.42\n\nTrains\n here carry 3 classes. The 3rd is reserved for natives & is very rough. The first is similar to our box compartments save no seat near lavatory but there is atable with folding sides in centre. This makes compartment wider thanours & gives a footrest. \nTrams\n are double deck or electric stopping at recognised places to pick up & put down. If required to stop at next stop push button 2 poles before stop. Circular Drive\n\n\n\nTollgate (for Sydneyham, Mayville, Sanatorium & Nazareth House) 2¼ miles 2d. 16 mins (every 15 minute service)\n\nBotanic Gardens 2½ miles 2d. 14 mins service 20 minutes\n\nPoint 2 miles 2d. 11 mins every 7 minutes\n\nUmgeni 4 miles 4d 22 mins (every ½ hour)\n\nOcean Beach 2d 5 mins\n\nOverport 3 miles 2d 22 mins 15 minute service\n\nTrip to Amanzimtotu. Caught train 2.45 left 3.7 accidentat Illovo. Chum up with a mason & another man who gives me his seat & we become intimate. The country is open with range of hills on coast from which train is never far away. Pass big sugar factory & wireless station with 3 masts - chemical works - Kynocksexplosive factory with each group about 2 miles apart & in each group all little building surrounded by embankmentsopen at the four corners. Each little hut occupied by 1 workman & a boy.Wheels revolve very slowly sometimes hardly moving. Arrived at A & friend asks me to drink & find the proprietor of cafe has been suspended & the line Inspector iscarrying on. The man ismy friends brother-in-law & has a Zulu who can speak English & show me a kraal. We mount to kraala lonely position sea on one quarter, & deep valley & plain on other ringed in with hills. Whole is screened with bush from view. On way met finishspecimen of woman I have seen. 5'10\" or 6' tall with shapely limb & laughing face clad in mooencha (pron). Next meet headman named Mad de gazelle. He has only mooencha Hehas 4 wives each wive has a hut, a small one in rear for children & a storehouse& kraal for cattle in centre. Enter one hut. Wife without headdress & naked making kaffir beer. Sa ku bona is her greeting. Hut (seelater) The appearance of laced twigis brilliant black but is dry - youngsters have no dress & at very young age carry pickanninies. Women carrier wood on their head seem picturesqueMadwomen do all the work including ploughing. Men do nothing so I ask permission totake photo & he demands ticky Photos will probably be bad as light is no good. Return to station to catch 5.40 pm train. It leaves at 7.45 owing to accident. Go down to\n\nAmanzimtoti River & stand on bridge. River is subject tosudden rise & only half course is at present filled. Scene is very pretty & calm Meet SSF Reed of 30 Payn St Maritzburg & engaged timbering on location nearby When train does arrive I get into a saloon car. All sides glass. There is electric light in car but is burning at a brightness sufficient to give a dim light. On arriving at Durban I go to concert but am already ¾ hour late but hear Mishel (our friend of other day) on violincello in Sumer night Sulzsky Serenade Herbert Arlequin C Cui \n\nJan (Piano) in Nocturne in D Flat }\n\n 2 Studies (1) C minor Op 10 No12 (2) F major Op 25 No 3}\n\n Polonaise in A Flat Op 53 } Chopin\n\nLeo (Violin) Concerto in F sharp \nmago\nrMajor Glazounow\n\nThe only thing to be said about concert is that it was excellent & could not be surpassed They are truly maginficent. After concert met Miss Berman & several other all accompanied. In street meet Capt. Smith APM & claim my supper of the other day. We coffee at Royal & as he leaves I slip along & say good bye to Miss Berman & Mrs Phillips & come home in Ricksha I posted the presents home today. (spoon & snuff box\n\nGlimpses of Zululand at Stanger\n","30":" \n(30)\n\nFor stations see previous day.\n\nHut is round - made of wickerwork & covered with straw or grass The wickerwork is wattle (acacia mollissima) poles placed upright in circle 2 ft apart. Smaller twigs are interlaced between these 2 openingsleft 1 for window (not always there) & 1 for door 3' x 2'6\" There is an inner circle of poles to support roof & fire is in centre of these The dome of roof is same wickerwork as sides & above this is placed bundles of straw till roof asumes shape of a dome. Zulu huts rarely have plastered walls like Basutos There is no chimney & rarely window On entering the master of house (umnumzana zana) occupies central position near fireplace. His women are on left (entering) & men on right had side of hut. On entering\n\n\n\nutter salutation 'Sa ku bona\" This means like see you. It is easy to see them when ones eyes are accustomed to gloom as all are stark naked except for beads & mooencha. Visitor remains silenttill master of house asks his business & conversation opens. On the left the side occupied by the women are a pile of wood, sleeping mats, wooden pillows, blankets, pots & various utensils a space exists alsoin some kraals for calves, kids & fowls, thoughthis is not always the case. About 30 yds away he puts up a small hut (unyango) for barn or storehouse. About 80 yds from central hut we have a cattle kraal 30 to 40 yds in diameter. Animals are driven to pasture in early morning by younger sons At noon all return, cowsare milked & all then run till sunset when they are penned for the night. The milk at noon is immediately poured into a gourd (ityalo) & allowed to curdle. Native do not like fresh milk. This curdled milk (amasi) is largely used with porridge of corn or maize Women do not interferewith cattle save a mother of bride can choose one as dowry. This animal is called the \"ingquter\".\n\nWives cost 11 head of cattle including the ingquter Each wife has a hut & children a smaller one. Work to native is a unfortunate necessity to be got through as rapidly as possible When building a new hut all friends are invited to assist & they do & drink utywala made from maize or corn \nPloughing\ncommences about October (spring) Each kraal has about 5 ot 6 acres of land\n\nTo scare birds from crops youngsters spend most of their time in field in a tiny wicker work hut (amapempe) & birds are kept off by cries or placing a piece of moulded clay on a rod & switching it at bird like sling\n\nCrops\nmaize (is staple food) millet, pumpkins, calabashes, sweet potatoes, Kaffir beans & a tuberiferous herb \"idumbe\" - no annuals like cabbage\n\nTobacco\nis largely grown. Leaves are dried & made into a gigantic cigar 3 ft long & 3 to 4 ins in diameter & the whole covered with native matting & used\n\nas required. Snuff is made by grinding leaf between stone or drying it in sun or under a sheet of tin with aloe roots burnt on top. Leaf is crumpled by hand till only stalk is left & then aloe ash is added.\n\nReaping\ncommences about May or June.\n\nDress\nmen wear \"umtya\" &loin cloth of animal skins \nsometimes\nsometimesa light blanket is worn over shoulder. Women same. Bead are added. Children also absolutelystark. Baby girls however have the umtya. At 4 or 5 years of age children get a blanket.\n\nThe cultivationof hair has been explained before. Kraal owner of about 45 years often wear atuft of feather or a head ring (isicoco). A bride has a head ring of beads (white) which she wearsfor 3 years after marriage. After marriage Wedding dress consistsinitsabsence & rows of beads on head & neck, an armlet, a waistbeltand a square patch of cloth in front and rear open to hip at each side. Children are very free & lovetheir home. Girls nurse babies &youngsters tend herds. Older boys make younger wait on them & perform any drudgery until umnumzanafinds out & then trouble.\n\nGovt.\nEach tribe is under a Chief (who is responsible to the local Magistrate) He is assisted by^privy councillor or indunas who report any happening to Chief Tribes are divided into Clans with a clan name (isibongo) like Clan Stewart. The Locations are divided into a number of wards each under an \"isibonda\" Young men are subject to umnumzanawho is responsible to the \"isibonda\" who reports to the \"induna\" who laymatter before Chief. Heir as chief is selected eldest son of principal wife being usually chosen. As principal wife is usually chosen late in life eldest son rarely inherits.\n\nArts\nwood & bone carving is good. Women indulge in pottery & make water urns, beer pots, drinking cups. Material is worked up in soft mass. Then shaped, dried in sun & baked by placing in pole in ground& wood heaped over it & burnt. Grass Weaving for mats, beer strainers, baskets & palm leaf plaiting. Men sometimes do this \n\nBlacksmith - smithy passesoblong hole 2' to 3' long & 1' deep At one end a long mound of good clay is erected with small hole through centre on basin side coals are placed in hole a horn to large end of which two bags are fastened. These bags are raised or lowered alternately mouth being opened in lifting & closed in lowering. Assistant does this. Anvil consists of ironstone & a smaller piece is hammer. Tongs are barks sharpened at eachend & bent double like tweezers. Soon burnt out. Household utensils summed up = 2 or 3 cooking pots (clay, wooden spoons, eating mats (izitebe) on which meat is served, clay beer pots, palm leaf beer strainers, & several knives. Plates, forks, dishes, cups had originally no wood & were unkown. Now Kaffirised woods have been made. Wheelbarrow oncecarried on head Native women carry 40 to 60 lbs weight eg firewood gracefully balanced on cranium. Water is carried in this way. Assegai only made even now by native smiths often used as a knife. Lamps & candles unkown. Fire gave all light needed also smoke. Fire made by pulling pointed stick in hole of another. The first being turned rapidly between palms of hands contrivance called \"uzwati\" \n\nNative mill. A long hollow stone with smooth round crushing stone which is wored rapidly back & forwards.\n\nGrain stamper. Trunk of small tree with stamper 3 ft long with large knob on each end like dumbell. Grain is poured in mixed with water & \"pestled\" until husk is removed & this washed dried & boiled. Pear shaped calabashes are hollowed from small holes in neck Gourds are scooped out & now used as plates. Althoughusualmethod is toputporridge in one large pot & each one dips his spoon in it in turn. A separate pot is given to women.\n\nBeer is brewed by soaking maize or millet in water till it sprouts. The sprouted maize is then dried in sun ground in mill as described & boiled.This is allowed to stand till fermentation takes place when it is again boiled & put in earthenware pots until ready for use. The process\n\nlasts about a week or 10 days - was intoxicating - served in grass baskets each holding about 2 quarts. Dish is placed in hut, master drinks himself & hands on \npot\nmeasure till pot is emptied. It is gross breach of etiquette for master to hand anything to his visitors without first partaking Native axeslet intohandles of wood thru a hole Musical instruments ugwali 3' stick with bullock sinews thro rooks quill. Place lips on quill & inhale & exhale\n\nUmtyingo\n3' stick hollowed one end cut at angle. Fingers placed over this & other end placed in mouth Isigupu skin stretched over hollowed gourd.\n\nBetrothed\n- intro clan marriages not allowed & if made merits wrath of ancestral spirits. Chief often claim 50 or 60 head of cattle for his daughter. On engagment girl with her friends go to kraal & shows her diligence & skill in housekeeping. A goat is killed for her & her friends a feast & dance takes place then bride elect returns home taking with her a bullock to show that she is acceptable to her future father-in-law & his family (If not acceptable she gets 2 head as compensation) Young man continues to visit lady periodically. The lobola (price) is paid by degrees & when complete (or sufficiently complete to satisfy brides father) nuptial knot is tied. On day a beast is killed & beer provided - no invitations news spreads & all are \ninvited\nmade welcome. During proceedings bride receives a charge from her people as to how she is to conduct herself in hernewsphere. After public acceptance of each other the feast proceeds - young people dancing & singing. At close of reception bride groom & his friends go home & later in day is followed by bride & her friends.\n\nBirth & Childhood\n- looked foward to by natives not dreaded as by Europeans. Older women of kraal assist & do the job. But if unable a professional accoucheur is called in. A boy (inkosana yikaya)= young master of kraal) is heralded; a girl (umvoosi yomzi)= raiser up of kraal is proclaimed. An infant is smoked (ukufutiva). Several medicinal herbs are placed in a vessel with some live coalsto produce a dense\n\nsmoke & child swayed to\nwa\n& froin fumes. This is carried out every morning at sunrise till child is 6 mos old. Then roots are hung around infants neck with pieces of goat or sheeps skin. These protect child from machinations of evil spirits. Once father was supposed to be absent from\n fix \nhome at birth. If chief for 3 mos, if headman 1 mos if commonr14 day) On return to home a great feast & relatives bring presents &father sees child. If caught peekingfines imposed & collected by old women Custom now almost obsolete\n\nWitch doctors\n natural death (except senile decay) impossible. Must be due to witchcraft. & livesare full of superstions.He usually knows everyones business & enemies & for reason of illness or evil assigns your enemy who is as a rule boycotted& find it advisableto remove fromlocality\n\nNative Herbalist\n see under\n","31":" 31\nThis is sailing day at noon Board 11am fromforward well dock & though orderly & susceptible to command of Scotson refused to sail. Other reinforcementis a portion of each follow them in sympathy but are induced to return. N8 stands fast the only one Boat draws out about noon to No5 mooring & waits. About 6 pm men come on board having gained the right to represent their case to the authorities at Capetown. It is now too late to sail so must wait till daylight.\n","32":" 32\nSails at\n 8\n9 0. heavy roll crossing bar through there is no sea. Back now to old routine. 9am parade. About 11am we have an excellent view of a pretty portion of the coast with green field & trees running down tapering hills. 2pm parade. mist has come up & coast is no longer visible. I spend afternoon in cabin on my new table Tonight the rain has arrived & everthing will be miserableto-morrow\n\n2\n4\n \n23-\n7-18 Tues 33\n\nNo parade today as it is too wet - spend the day with diary & censoring. There is I am tolda double sunsettonightasif there were twosuns\n","33":"\n","34":"\n -7-18 Wed 34\n\nCensoring again, assisted by Bate & Blackett About 11pm ship turns on its tail & reason is a steamer on horizon which comes closer & turns out to be a British warship on patrol duty & no raider as imagined. Still too wet for parade. I desire to read of War but no parade sports.\n\n26\n\n25 \n- 7 -18 Thurs 35\n\nThis morning we hope to get in at 6.0 At 7 we are lying off but not daring to enter. View of Table is not possible yet it is cut off by the twelve apostles. This morning we find that ships storehas been broken into & 4 cases whisky - cases of salmon &£10 taken. NCO warned tolook for offender. This is serious in view of threats of an avowed mutiny About 9 we enter & see the Table mountain enveloped entirely in a white shroud. Rain occassionally cuts it out & indeedfor a long time we could not see it at first. After clouds became a table cloth. It is a great majestic basalt rock with a little town at its very foot which it dwarfs & overshadows by it abruptness & grandeur. On its right is the Lions Rump & Head. \"The Lion which guards the Land of many mysteries\" & as if despised the puny town turns its tail on it & looks out to sea across its body. \nThe view\nIt is only possible to see that it is a Lion Head if seen when Head & Rump are in line with each other. On left of mountain is Devil's Peak. We are examined by various examination steamers a process of about 1½ hours & then sail in about 10 am assisted by the tug Ludwig Weiner. Alongside is a Japanese warship which hauls to sea before our eyes & Λwe give the salute & Japanese\n\n\n\nanthem. All officers on boat saluting. Our appearence & steadiness compared very favourablywith theirs. Leave is granted at 2pm We form up & march out the Docks. These Docks are an area set apart for shipping & enclosed between two artificial breakwaters. It is much too small for needs of port & tugs are necessaryall the time as there is so little room to turn The graving dock fairly large & slip as well as all the shipping of port is in this locality. The \"Cutty Sark\" is here having recently had a new mizzen put in. I go for evening with Major Briscoe a returned MO from East & West Africa & full of information re interior. I spent last night with him in my cabin. We passed out of Dock & examined the pier. - a concrete structure opening out onto acinema& teagarden & closing again to terminate in a round tower. All along sides are bays holding seats for 4 or 5 & in front statue of Jan Van Riebeeck who found the Dutch colony in 1652. \nAfter\n In 1686 Hugenos arrived owing to Revocation of Edict of Nantes. In 1795 colony rebelled against Dutch & conquered by England on behalf of Prince of Orange & ruled by Eng till 1802 when it was restored by Amiens. In 1806 retaken by British under Sir David Baird & ceded to UK in 1815. Then we proceeded up Adderley Streetexamining the Railway station with its winebuffet & first engine ever on its rails also timetables. Trains are similar to those of NSW tho engines are different & smaller. Next visit PO & saw a stone which was unearthed here P.O was \noriginal\nsite of old water place for ships & the steps at one time water edge now rest in museum. Next looked into StandardBank of SA. Most magnificent I have seen. No colours all white with½ roof windows. Then entered Dutch memorial Church very plain & well lighted by electricity all seatsare boxes 5fthigh. Next visited Cathedral an unfinished edifice- only one coloured window - contains several historical flags & tablets to fallen soldiers in various wars. Next visited Parliament House. Tho closed found an attendant & saw\n\nAssembly Hall - much same as ours - Labour has 2 seats only - Unionists (Dutch) Nationalist (govt) then visited Senate - luxurious. Between two is entrance Hall . A marble Hall with black marble pillars & within the whole is oranged by coloured windows It contains constitution & Edward II seal & signature - also proclamation of Dom with George V seal & signature. The dining room is fittedwith small tables & pictures of past speakers & Governors. Next enter Museum which is reached by traversing a park - very pretty but only trees no variety but plenty of Gum & wattles - At entrance to \nLibrary\nMuseuma black 7 ft high was superintending cutting off stone of Bushmen drawing. These are splendidly coloured & executed drawing or paintings on rocks.The work is of high order but Bushman is very low. Hence some doubt if Bushman. On\n entrance\n vestibule to Museum. There is a collection of stories. These are letter stories for depositing letter for boat due to call or memorial stories & hashistory of Cape. As follows A padrao erected by Diogo Cão in 1485 at Cape Cross - another at Angra Pequena by Bartholomew Diaz in 1487 Both in German S.W. Africa. Da Gama 1497 - 1499. There is complete life size coloured castes of Bushmen. The original inhabitants of S.A. almond eye. (1) men can suckle young (2) women have enlarged posterior \nwith\non which they can live for long periods men have it in slighter degree. (3) minor labi often extrude as much as 2¼inches - always some extrusion specimanis very big Ribbon fish with ribbon of red on it back is peculiar The art Gallery is disappointing & contains no good paintings. Hard to discover entrance from statuary. All pictures of importance are in Michael's Collection in old town Hall - with a Grecian or Roman Garden. Next visited R.A Colly & medical school. meet Drennin see physiology & embryology museums. Rain comes on mountain is lost in mist: Visit university consisting of round dome & two large roomsused for exam & \"capping\". See Hugenot Memorial Church again with some man who explain that Capetown is Port capital Bloemfontein the judicial & Pretoriathe administrative capital of the Union. Then go to Royal Hotel to dine\n\nHere more so than in Durban it is impossible to get a drink. Then go to Tivoli a vaudeville theatre. Meet two friends withMacqueenPotter (dentist) of 78 Strand St & WH Richards of Richards & Barlow Glass Merchants 131Long St Capetown. Adjourned in trioto Callow Bldg - roomofRichards at half time for refreshment & returned to theatre. Afterwards went to Club whre we were enrolled as Honorary members then to ship. incident withAdam & perser last drink went to bed at 3 am.\n","35":" (36)\n\nPiquet duty all day At Wale St Police Station - missed seeing Masonic Temple (see description 16\/8\/17) But took 36 mile motor drive around 12 apostles - Green Pt, CampsBay, to Houts Bay - a restful hotel and had tea there - crossed Constantia neck thro fertile vineyard into an English locality with avenues of oak trees now denuded of leaves meeting overhead - sometimes for avenues - go to Cecil Rhodes (1) Grote Kunste a Dutch building with everything Dutch in it. Dutch clocks show day, week, no of days to go in month, moon, etc. In Rhodes room is Napoleon clock & outlookis upon terraced Dutch garden & valley of hydrangeas. On table inlaid with silver & bronze made by Hugenots bought for £25now insured for£3000 see flag Cape to Cairo & others - elephant roer -utensils inbilliard room are encased in big chest. Room where he laid in state - dismal to look thro a dead man's undisturbed home. Upstair alcove overlooks vestibule. House is now official residence of Prime Minister. Bed are impossible to ship & big enough for four person. No showers exist in the massive bathroom. Originally building was destroyed by fire & Rhodes erected this on Dutch model & every bit of furniture in it is bought in S.A & Dutch if posssible. Return to piquet dinewith Richards in privatesuniform &agree to meet him at 11 when piquet has returned. He is not there when I return with Scanlon & go on board. I find two stranger Speller & Campbell asleep in my berth(X)\n","36":" Groote Schuur = Krkut gear\n","37":" (37)\n\nPull at 7 leave 9 after circlingsound outside breakwater in the interval. View of Table Mt without a single cloud is grand & dwarfs the pigmy town. As day wears on meet DeBeer & Runian two flying men This is the day of muckup ofberths & to my disgustfind myself with 9C Little & Urenthetwoofficersof the SSMschoolwhodisgust me more thanthe others.The officers on board are\n\nLt EHTBurgess (Gloucester Rgt) * Lt PF Campbell RF & RAR\n\nCapt E L Scales KAR * Lt Duncan RAForce\n\nLt de Beer RAForce* Col Huygke Belgian Army\n\n\" D.A. Young RFA Lt Barber \"\n\nLt Col J F Trelawney Major C F Forster KAR \nRACS\n\nMajor P J H Smith KAR RMLI Lt JM Dallas \" RS\n\nLt Bourke McCauley KAR * Capt Wolseley Bourne KAR\n\nCapt H E C Clunies Ross KAR* AIP Lt CH Speller \"\n\nCapt H O C Hammond KAR\n\n \" C T Soames KAR\n\nLt.L V Lewis KAR RRR\n\nBoat drill as usual this afternoon. sulky afternooon re change of berths.\n","38":"\n (38)\n\nEarly rise bath & return to bed to read & then giveup as eyes are bad. wonder if I am only tired or in for influenza. Church read more all morning & chatted with Saintou. Slept all the afternoon. After dinner went up on deck & yarned mainly with Campbell & then went below & bought this diary up to date for first time since arrived at Durban. Will now be able to start copying it again for home. To night we ran into a fog & blew fog horn. As this was our signal for boat station most of officer dressed in lifebelt& overcoats\n","39":" (39)\n\nMy Birthday - decided to do nothing in way of work today - read Palgrave & spend day with poets In evening stand cigarsfor table& others& find sufficient whisky brought from Liverpool to drink my health. Day isquietly spent.\n\namid memories that will never fade till time shall cease to be & closer companionship can no one have than his home ones & his loved onewhom he never more may see. Spent night with my new found friends talking of Africa & Ross dilated on lions. Lecture by Kidd on sentries saw whaler & 4 whales in afternoon.\n","40":" (40) \n Orderly officer - usual job - note re paybooks issued by adjutant at 2 pm - men double round deck for½ hour morning & evening good exercise but likely to produce bruised feet as there is no give on deck - then a washbasin concert in D deck by N8 & 9.\n","41":" \n(41) Washing day for N8 no parade - play quoits retire to newly constructed cabin table - works well it consists of 3 board nailed together with cleatsthe exact width of bunk & is jammed intoposition & cannot be moved. I have also invented a wardrobe owing to congested state of cabin we are now 3 instead of 2 to a cabin. Today we practise our new gun which we have taken on board at Capetown. It is a 4.7 Japanese Range 13,000 & is a quickfirer said to do 14 per minute Shootingnot of the best. Practice is about 6 or 7 rounds Afternoon is sports so no parade. Our meal table consists of De Beer RFCpilot. Campbell an MC& Mons manRE, Clunies Ross, Pearce, Duncan an observation man RFC & Bourke McCaulay an Irishman \nConcert tonig\nLecture tonight.\n","42":" (42)\nUsual routine - consulted in afternoon re a DCM yarnin morning with Saintou. Sea is not a sea Days onwe are near equator. Read articlesof war.\n","43":" (43)\n\nParade as usual but I am occupiedre DCM & succeed in \napsitting\n upsetting constitutionof the court. At dinner time announcedthat ports may be left open if lights cut off at switch\n\n& guarded & spent most of afternoon looking for switches. These are hopeless owing to alterations made at Cockatoo. They are \n4\n5 sets of switches to extinguish lights on our deck. In afternoon write up diary to send home. At dinner tonight McCauley tells of his experiences in German West Africa - lack of water eggsfruit salt - ham& biscuits - Land is fertilein interior but fromsea to 50 or 60 miles there is a belt of desert. Where railway line was natives are constantly employed to keep it clear. & the sand hills are covered with sacking to keep them from shifting. Nights are now becoming warmer. sea is like glass & we never have a breeze now. We must be in a calm belt\n","44":" (44)\n\nParade as usual. But muchin request with the court martial. I point out constitution of ct is not valid & it is reconstructed. In afternoon sportsN8 wins two events. \nBantan \nOgilvie & Deckiewinning the semi-finals At dinner propose toast of King & King of Belgiums. Later toast is proposed by Carmichael & reponded in broken English by Colonel Huyke. SMO asks everyone to fill their glass with port & propose the allies & successful end to year as this is eve of anniversary of war. Yarn all night with 7 of Engineers. & thenturnhaving missed both the concert in the officers saloon & the concert on \"D\" deck.\n","45":" (45)\n\nAnniversary of outbreak of war. Day is hot as we crossed line about 7 am this morning. Men are ducking each other thoughactual visit of Neptunehas been postponed till tomorrow. Miss Church service is short owing to heat or alleged heat. It is not really hot. And sea is absolutely calm In fact boat has not shown any sign that she is at sea since a few days out from Albany. It is impossible to think of sea being so calm for so extended a period.\n","46":" (46)\n\nThe day of DCM Pres Major Smith \/\/6 KAR & Molesworth - all day. 2pm today Neptune is due but court continues on. However I see Procession of Neptune his wife, a nurse. Procession paraded round deck to Captains cabin Neptuneshould have arisen over the bows & hailed Bridge & demanded permission to come on board but he did not. Procession was well got up. Procession adjourned to aft well deck to square tank about 3 ft deep made of cassia.Here the usual ceremonies of shaving, taking off beards etc. took place. One man with a moustache took his off & put on a false one. When Neptune's barber commenced the whole show fell off. However I missed all this as I was sitting on theDCM again at 2pm & continued until 5pm. \n\nTu\n","47":" (47)\n\nContinued the court in the morning - till midday In the afternoon parade as usual. Sea is still calm Weather is cool I would have thought it impossible to be so cool under the equator.\n\n7-8-18 (Wed) 48\n\nLand looms up in sight about 7am. Several isolated objects atvarying intervals stand out & speculation makes them the masts of different vessels at anchor. However they turn out to be isolated trees. However vessels do soon appear as weget closer & in number as they are broadside on & seem to float on the horizon they would make an excellent targets. The silhouette is perfect & seems to enlarge the vessels. As we approach we see a long line of buoys with a narrow opening for which we make. Just outside we see a wreck which is most unlike a wreck. It is an Elder Dempster boat which was put ashore by the mate whohad been logged by captain & revenged himself by spoiling a good boat \nwh\nbecause skipper was not on bridge when he should have been\n\nShe now restshere \naft\n & has been lyingthere for 6 years & she is without a sign of rust orloss of a single rope How she keeps this freshly painted appearance I do not know. Perhaps it is the climate perhaps she is repainted. She is surrounded by water & lies inside a reef. Storms do not seem to have affected her. If they have storms here.There is no attempt to salvage here. Before entering two boats flying white ensign pass out - look like minesweepers. On entering formalities are few. On right point is covered with dense tropical undergrowrth - seems unhealthy Coco.are here but do not seem numerous As we pass up we pass various ships including Moreawhich is to be our escort. She is now an auxiliary cruiser. Current is very strong a 4 knotone &tears past boat We have arrived in the rainy season of year. Weather is very cool due probably to the overcast sky.Though when it is bright sunshine it is not very hot. The town consists of a collection of houses clustered at foot of a large hill - barracksare on an isolated knoll & a few houses on top of hill\n\nThe white popoulation is about 200 & the remainder black. A fine physical race but VD whosesole delight is eating & women therecost about£5 & morality is very low. Their language is Mendibut nearly all speak a sort of English especially the swear words. Fruit & fish vendors come alongside in canoeshollowed out of tree trunks & paddledby a native in stern Fruit is hauled up in a basket in which the money has first been lowered. They do not trust soldiers. Prices are exorbitantbananas 1d a piece & fish 1\/- each SMO forbids them vending as place is full of malaria. For this reason no one is allowed on shore. We pass the day gazing at shore. Some say we only stay here \n4\n8 hour but no attempt to coalyet made though it commences at 6pm.\n","48":" 49\n\nCoal has come alongside in lighters - all coal is bagged &is welsh. It is bagged on collier & placed into punts of about 250 tons. These punts are placed alongside ships bunkers ports & staging of 1 2 or 3steps as required are put up & coal is passed by gangs of 50, in pairs. One pass to next pair to next right up to bunker holes & bays thrown down to punt. The work is done by the negroes who receive 2\/3 per day of 02 hrs& 6\/-per night of 11 hrs(6pm till 5am). They load 13 to 18 bags per minute (each bag is cut) when working but they talk more than they work. On one occasion during 1 hour they loaded 13bags. Their system of tallying is noisy. One individual count for each bag with all the noise he can make with a weird cry for each tenth bag.^ 1.1 more","49":" tally-ho tally one.Another enters it on tally. Theconstant calling & yelling grows very monotonous expecially during the night. \n\nDay is not very hot though many are sleeping on deck. This morning there is little current. This is due to fact that there isa river at head of the bay & when is running in this banks up & on release current is rapid. I do not know if this is real reason. Native boys in their logs come out this morning & dive for silver they ignore copper - pretend they cannot see them. They fall out of boat & sink below coin which\n\ndescends very slowly & invariably catch it. They then climb into boat a very difficult operation. Other men in boat steadying craft with a paddle on off side. Two men Todd & White are adrift - got ashore last night in lighters. The natives handle all trip & the wonder is they manage to keep them afloat. They are fullof dents wherethey have crashed into any handy obstacles. Their knowledge is nil but somehow they \ncarry\nmuddleon like our Govt. At dinner the negroes are disgusting. Their food is sent from shore about 12 noon in big dishes. They sit round it & pick it out with their hands whichare dirty from handling coal - they never wash. If too much in his mouth he spits it back into dish again. What an opportunity for spreading disease. Their yabber is excessive. After dinner they sleep where they are in the coalanywhere.\n","50":" 50\n\nSpent allthe morning judging the physical training squads & in intervals watching the waling operations & the alleged seamanship of the tug captains. Then play off my quoits match & in muddle of it man falls overboard. Chips goes after him & rescues him but is himself borne away by current. Boat is lowered after a while & picks him up & then tries to sail right back in teeth of wind instead of tacking When it gets back its wind is cut off by ship & it falls to rear again. Then it rows & gets alongside after a long time & catches a rope but current is too strong & away goes boat. A launch with wireless men come along but refuse to assist in spite of all entreaties beach goes on. The blacks here are the cheekiest I have seen & seem to think they are on an equality with the white men. At last boat is brought aboard & chippy is cheered In the afternoon boxing is continued between Brennan & Hollingshed & at night usual routine dinner, smoke on deck, retireto cabin, undress & read M. L in cabininpyjamas. Brittania and in Brazilian fleet 2 TB destroyers storeship & several destroyer\n","51":" 51\n\nSailing day. Got off earlier than expected about 6pm We proceed out in a long line Morealeading. It is a pretty sight. The scenery is picturesque long line of low shores fringed with lakes& behind the cloud piercing summits of rugged hills. The wreck looks like a vessel putting into port. Outside we form toodeep and afterward the calculationsare incomprehensiblenow one formation then another sometime in square & sometimes under One fact I notice is that we are always in the centre. It is comforting to know we are in a safe position I spoke a lot this afternoon with Saintou & make him my orderly. Price supervising him. This \nafternoon\nevening before dinner I speak with Belgian officer Lt Barbier in French so far I have avoided doing so but he has asked me to do so. Iask him to have aperitif but \nhe\nI must watchthe arrivals& so have not time. After dinner usual routine\n","52":"52\n\nChurch parade this morning but I remained in cabin reading up ML. & afternoon likewise.\n","53":" 53\n\nDCM of Ward this morning. Not finished but adjourned till tomorrow. Boxing finals this afternoon N8 with Ogilvie wins one but Dickes loses But one final & onesemi is not bad for one reinforcement. In afternoon write up diary & chat with Saintou.\n","54":" 54\n\nDCM continues till 12. I forgot to say I am prosecuting once more. In afternoon slept & evening usual routine. Convoy consists of Morea Sheridan 4500 Omara 5000 Patani Oanfar 16000 Akbar6308 Highland Park8000\n\n\n","55":" 55\n\nAddressed at DCM & verdict of Not Guilty. Court visited deck. Afternoon sleeps after dinner usual routine Read Interpreter the novel by Whyte-Melville given me by Major Lyteat Durban.\n","56":" 56\n\nNo court todayasresult of thework. CO calls me reDawson & speak with Meagher - return below and finish reading McTodd by Hyne another book lent by Major Lyte.\n","57":" 57\nShower - no cold water - shave - & back to bed to cool & frame a charge - Smith comes down & chargeis settled - Inventory taken of mensutensilshammocks & blankets to find amount to be levied to cover breakages & deficiencies. In midst of which I am wantedfor court as witness in Vernon'scase. act as troop deck officer & judge tables. dinner - meat mostly fat - afternoon played quoits & lost place in tournament - slept because eyes are tired Usual routine after - at night went on deck. Moon blazed a silent track across sea missing the dark objects the ships which like hidden danger lurked on either side but which the path to glory missed. & I passed many hour far in to the night with the beauty which eye cannot see & the music only heard in silence.\n\nFrom earlier\n 26\/7\/18\n\nIron gate on the base on which is written Loge De Goede Hoofe Gov 1772 Winding path leads to building See plan \n\nChamber of S--e\nFigure of white draped woman with one hand on mouth & fingeron lips signifying silence. Walls are dead black - Roof domed - no furniture save a chair. This is first in which he is taken after prelimexam. Here C-S- & W given & a secret lecture on value of S. If decline to go on can retire if goes on he is left to meditate on lecture He leaves room by twoinclinedl_sHere he is blindfolded & 2 BB assist him over l _s while lecture details meaning. Bandage comes off & he is lead out He is not at this state prepared for chamber This comes after second chamber.\n\n\n\nHe crosses to opposite door which is shaped like Triplewindow & is 4\" thick. Massively built & bolted resembled dungeon grille. raised panelling. A peep hole in arch part. Height so low as to cause a stoop to get in Statue of man naked with cloth thrown across body resting on elbow facing down head thrown back 3 cuts blood running down breast. ABC contain emblems of M -\n\nFar side has similarly constructed door work. bottle shaped hole in archedpart into which a bottle of similar shape is placed - which contain pure crystal water behind which a light was placed - now electric but system was earlier than this & water used as a lens. Effect is ghastly on S Y = stone bench - no back Left here in solitude for 1½ hours If for 1 goes back to main hall If for 3 goes ahead.\n\nA tunnel 6' to 10' long & dark - no door this end but iron grill Bible set in 1749 has never left - his room since 1772. is oblong 7' x 4' & 2 ft deep - Seatbehind grill is 4' high dais in recess about 4' high. dais has three seats but inclined. Whole approached 1 step & curtain on flank. No windows.\n\nMain Room. 3 windows in wall & electrically lighted in rear. representing 5 points, S&C, Head. Roof is rounded but ridge 4' wide in centre - painted. Thunder & lightning at will Pyramids &white with clusters of candles sealed along side Humility - strength - Floor 5 ft high approached by sick. at this end together, seats at side broken in centre. Dais there for 3 Far dais for 4 all in dutch. Door hammered out in course of year & a new bit inlaid\n\nNext room contains about 30 of WMS including one of Francois Renier Duminy . Some are photos some only sketches also contain the old charts from Holland & other documents \n\nEntrance Hall. different charts oron walls has a table & desk\n\nHistory\n. Founded 1772 WM generally seafaring men descendants of same are still in here. Course takes 3 years\n\n\n\n\n\n\n","58":"\nSea still calm - water blue as if under seaborn skies Convoy is becoming monotonous as in always see same shirt in same place at same time. Better the empty sea for we know that this is not the same as yesterday. No company for drill as all are on musketry or duty. Usual afternoon program.\n\nAt dinner Elliott Cook very nice. Concert after dinner & then wet night. McCauley .\n","59":"\nService this morning - went for a change & glad. Padre Gorrie sermon was a treat: he his farewell remarks in afternoon compiled account of lady with Browser & CSM afterwards Gorrie & Millikin. Wrote up diary & war report.\n","60":"\nSea calm & quite blue. smoke on horizon. After breakfast Morea bolts to sarboard at right angles Object is boat looking like Empire but flags a green flag probably Brazilian. She has not answered promptly enough to our signal Morea still seem unsatisfied but does not pursue & leaves her alone - No parade as men on musketry. pay this afternoon & distribution of pay books. Morea at 4pm goes off on another ramble to starboard & then drops astern hang in rear for a while & then comes through convoy passing quite close to us. Coe Hughe invite to a party to morrow. After dinner lectured by Ross on Cyclist corps & then bar, then bed.\n","61":"\nInformed by Penlyat 6am that I am deck O. Officer & refuse to get up if he can warn in the day before. I am dead tired this morning but am too busy to have a little nap. Judge the best\n\n\n\n\n\n\n\ntable this morning & then inspect the paysheets. then kit inspection at 2pm interval. 6d collection for breakages. 3d for chaps who saved the Sgt up in the shark infested water of Sierra Leone. 2\/- for magazine. i have so far taken 3 copies. Morea has not taken any shoals to day. After dinner to night took table to see news & then wrote diary & then visited decks. Found 2 ports just opening impossible to detect offender but it was N9. reported the matter.\n","62":"\nRose & dressed by 8. Sainton says I am lazy he is funny. He roused on me this morning for not allowing him to wash my clothes & said I was to dirty. He is very attached to me & will do anything for me. I forgot to add that he is my orderly the little frank chap met in Market Street. This morning there we have changed position with Oanfa. This is at first sight worse for us but when escort joins us a TBD takes our place & we drop back into the centre. we hope to pick up escort tonight or to morrow. After 5pm all ranks must wear lifebelts by day & night. Tomorrow all port holes will be closed for rest of voyage so that in case of boat being hit & listing the water will not fill thro portholes & hasten matters. Busy now inside cabin this does not apply to me. Hair cut this morning - arranged my case to see what things I have - run in potato race this afternoon but was beaten in the heat. This is first exercise I have taken on board & being a distance of 200 yd with stops to pick up potatoes was very solid & I was not the only one knocked up. This afternoon Morea went for a walk & hung in eye of sun on left rear for some time &then came back. It is now very light for about 1½ hours after dinner. Talked with Campbell re trip to Scotland & Northumberland & then talked with Hammond re Indian service & then to diary & then bed\n","63":"\nI am officer of submarine guard & go on duty at 9 am & remain on 24 hours soon after 10 am. a periscope was sighted on starboard side Morea wheeled on her caul & started at full speed for it. My feeling at this moment was peculiar. I was full of interest & was concerned that submarine should not escape before Morea could ram her. I was only keenly excited in race. If it had really been a submarine the danger to ourselves would have been real & in a few seconds our boat would have been gone but while we thought of the possibility my feelings were only those of interest in affair. However the periscope turned out to be an upturned cable & Morea let it pass. so did next boat Yokohama but the last boat front up E (submarine signal) & we alarm 6 whistle & turned her stern on to it so as bring her gun into action. However it was unnecessary. While on duty read hand book Memoirs d'une longue chaise & wrote home as mail closes today at 12 noon. Escort is expected to day but so far have not seen it. As all my 3 sgts on guard are only Cpls & as Cpls are only available. As 5 out of 6 are under 19 years of age & sad to say awake all night The Bar closes tonight definitively; There is a wild happy reunion. After the final flutter go up on deck & yarn with Ross. While yarning see a boat float by which however occasions an alarm from forward sentries. 1) lay down about 2 & at 3.30 there is wild rushing overhead on bridge & clanging of telephone bell. wheel is spun round & there is a babel of voices. thinking something has happened which guard has not warned me of I rush outside & find night quite calm & peaceful. Moon is shining brightly but a cold wind is blowing & occasionally a shower. Good night for submarines but sentries are all alert. However submarines guard would be of little use & it is all are\n\nin ranks by order of adjutant.\n","64":"\nAbout 6.30 am 6 black spots are seen extending from one side of horizon to the other. One of these spots is flashing with electric signal lamp in the moonlight. Searchlight here extend for about 4 before & 4 hrs after sunset. Soon these black lumps are seen to be 3 funnels 130 & they circle round & take up their position. They are handled with perfect seamanship & one of them runs up under our counter passes a line on board & ties a packet of orders to line which is drawn on board. It is a knife edged trim little craft with a roll that seems incredible in this calm sea. One signalman excites admiration as he stands on a plank without guards or railing ropes or anything to steady him but he moves & he seems quite at ease & for the moment one thinks he must be stuck on the remain there but he moves & this disproves this theory. Am relieved at 9 am & go till 1 pm & then lunch & read all the afternoon. Now find that we will not land till Monday at earliest & then at Tilbury, so perhaps we will hear the finish in France before we get there. Water is running out & washing of clothes is prohibited. Taps in officers lavatories are plugged. prolonged journey casts a gloom over ships & we are 3 more days in life belts. To night we had a splendid concert. Maclean & Gordon are excellent singers. They were all officers & are excellent voices as good as any concert platform will produce. After concert were on deck & though a bright moonlight night could only distinguish 1 destroyer. All other vessels very visible in the clear moonlight:\n\n\n\nbout 8.15 on horizon on port-bow a convoy of 12 vessels apparently no escort - though a few small vessels looking like trawlers were among their number. On horizon an airship c 60 appear & attach itself to us a large aluminium 3 conjoined cylinder affair looking like a seagull the floats underneath resembling feet at a distance Car contains 6 men & she carries a depth charge one of which is missing. Thenpassing over convoy. Another one is seen at breakfast but it attaches itself to the other convoy. Air ships float majestically over as now a silent witness to Englands might. (The first airship view over usat 6 am but Iwas in bed) About 11 it moved with her 2,000,000 bullion accompanied by Sheridan the slowest boat in the convoy & 2 destroyers leave for Devonport whither we originally intended to go. Airship C10 still remains the white ensign fluttering defiantly from its tail & the union jack underneath the fore: About 10 this morning two destroyers wheeled & let something fall wheeled again & then signalled supposed to be a submarine. One ship in other convoy fired 3 shots. Toward noon a seaplane came over circled round the other & crossed & recrossed apparently handing over orders & then bigger one the one whichaccompanied us all day returned to her station disappearing at an enormous rate: after saying goodbyeto us At noon we were supposed to be off Falmouth? - land on the horizon has been visible all day & at 3 is very plain. At 2 pm we are off Start-Point. After dinner air craft have left us & we are left with our own TBD less 2 with more away on starboard quarter is Cascade light. Sunset is glorious to effect is marred by two grey clouds. Moon rises blood red & looks at first like a ship on fire asrest of orb is visible Air is cool & flu prevalent. Rumour now has it we are bound for Havre.\n","65":"\nBeachy Head is abreast this morning awhite chalky cliff looking as if it had just come out of a landslide. This is England at hand & does not impress me as it should: just past see Eastbourne a sea side resort. Two immense buildings are hotels & are some size thothey cover more ground than their height justifies. Next we pass Pevensy Bay where William I landed & then Hastings. Next Dungeness with its light. Land appears pasture land but is really farm land. Windmills the emblem of Eng are seen here & there & clumps of bush. All afternoon out of sight of land. A submarine was sunk 17 miles in rear of our convoy this morning by an airship. Entrance to channel we pass a fast & large convoy going outward. The number of sights no end to them fills one with amazement at the British navy power. ThoGermany sends out hersubmarines yet it seems powerless to affect British shipping. Destroyers of all shapes & speeds surround us. Early in morning 3 airships (silver fire) sweep over sea in our direction & trawlers underneath sweep for mines. Aeroplanes sweepers everywhere. French coast is invisible owing to fog. Fishing boats carry on vocation regardless of submarine. 5 Barges are towed off away from France. Our hospital ships come across with wounded. Pass Dover with its false Harbour at 1.0 pm. Warships & channel boats visible old time Castle where Henry VIII invaded France across overhanging hill. On right a harbour lies 5 masted the largest sailing ship in world which went ashore before war owing to big rope breaking 2 masts still remain. land here is farmland divided by hedges or trees. White cliffs of Dover are now dirty owing to soil washing down them. Pass south & then\n\nSouth Foreland. Goodwin Sands with 3 masts still showing & enter Downs. lifebelts are discarded, happy relieved all vessels leave us though every boat fly white ensign & even towing boats seemed to be armed with a gun. Last RBD has apparently no funnel looked a speedy craft. Pick up Pilot in the Downs & then proceed. Enter Estuary at 2.45 pm & pass up river. land is flat on water & slopes back to hill. All is cultivated no towns or houses. River is barricaded around ground. houses are quaint & ancient style. First people I saw in Eng were farmers & men of a farm with square shape.\n\nPassed a boat which had been upended cut in pieces & each piece lying tied to bank. Finally anchored at Gravesend or Tilbury Dock - its the same \nthing\nplace. Left here 3 am.\n","66":"\nFound ourselves at Albert Dock & woke up about 5. Reveille 5 am no sleep camedown with influenza. Disembark 9 am & train came 11.30 by Great Eastern & S.W.R to Fovant in the south of Salisbury. The undulating country with its vivid green & dense clumps of trees together with harvested hay defies all description & it is such scenery as I have never witnessed before a sort of refined beauty not the vast rugged grandeur which it has always been my lot to see I saw in reality the pictures of McWhirter & whose painting I have often studied. But amid all the beauty the suspicion of a congested population struggling for existence & living satisfied with little. Stopped at Woking & reached Foran about 4 pm disembarked & my troops went one way & I went another. Army officer Major Blake is VC & Capt Lindly is Assist Adjutant & alsoPMO of SWS . The officers are a very nice lot & everyone does all they can to make\n\nus comfortable. WAAC attend to us. Concert party here tonight & party afterwards in mess singing a little dancing & much merriment. As influenza is still bad & blow on neck from craneon ship still sore I retire about 11.30 but get no sleep till 2\n","67":"\nStill down with flu. Wander round camp in morning & in afternoon was awakened to check equipment. at night too ill to sleep. Molesworth refusing to take breakfast parade for me. Took Dover powder to treat cold.\n","68":"\nOwing to fact that breakfast parade brought me out of bed at 6.15 influenza increased rather than decreased. Worked checking equipment all the morning. Retired early & nursed influenza as leave commences to morrow\n\n29-8-18 Thurs\nSpent morning preparing, collecting cash railway passes & meal-tickets Here if one wishes meals he must give a coupon before he can obtain it or even purchase it. There are in the books coupon is enable person to buy 1 weeks ration of lard, tea, sugar. However I am not drinking tea & sugar I take golden syrup with porridge. Bacon & eggsdo not come under the heading of meat or other meats (other meats includes fry.). By permission of Capt Lindly who knew me at Casula, obtained leave to get away by the midday train altho my leave did not commence till midnight. Molesworth is coming with me & we have to curtail our dinner. I pack some unnecessary things (boots, pyjamas) which I would not take if on my own in Molesworths bag & to keep\n\nmatter along & allow Molesworth to have a bite I hurry on to carry port but pass it in the middle of the path. go to tent & my room & then return to find M. waving astick in air& pointing to the bag which is plainlyvisible at 100 yds. We then hurry as train is almost due to start. M. then remebered he has left his overcoat behind & returns for it & carrying on the good work with the bag which is above my weight. As I struggle on a bounding form in rear draws near & says if we are too late we will be back here together & offers to buy my ticket for me to save time. This is Major Kerby. he does & we enter nearest compartment which unknown to me contains two lady friends of his Mrs Hill & Miss Phillips. M not in sight but draws near as train is moving out. Train waits for him & he bundles in. Pleasantries are exchanged between these 2 unknown women & ourselves Major omits to introduce us who he pictures as rapscallions, Bill sykes etc. We only go about 1 mile in this car & then arrive at Denton where we change & I get change to repay major. M book his ticket. We travel with Major & his friends to Salisbury where all change again. Major friends here go off inviting me to come & visit them at Fovant major is coming on with us. Train arrives but is crowded. It has a dining car on board & major conceive idea of buying a meal for the sake of the seat. Girl attendant says we must go when we have finished our meal & we tell her we will stayfor afternoon tea & any other meals that may be necessary to permit us to retain our seats. The three of us then commence a race to see who will be the slowest. Meal costs 2\/6 & tea 1\/-\n\nbut as journey took 3 hours it was worth the money for the sake of the seat. On arrival at Waterloo decided to take a taxi see one empty & beckon it. He merely points to the inside & refuses to move. If we want taxi we must walk up to it & this we do as taxi is essential to us. M gets off in Chancery Lane & Major soon afterwards I continue alone to Threadneedle & leave car in Basinghall St & set out to find Chamber. Thanks to a handy tongue & people conveniently placed I find it without difficulty. The square is approached thro an iron gate which leads into an alley & then opens into a Court in the centre of which a large tree flourishes. By an insignificant entrance with winding staircase I find office & am announced as another khaki officer. Mr Alcock is very nice & sends a cable home for me (costs me 6\/-) & gives me a letter from Sydney the only one to arrive dated","69":" Enquire where is Charles Agency & Mr Alcock accompanies me to find out & when found it turns out to be closed. This is awkward as we must start tomorrow without any walls. I then walk back to Chancery lane to pick up M. & I now lose myself in this great alley which is only 1 mile square itself. There is little difficulty finding ones way in the alley itself. The Streets are narrow & traffic is not heavy. The tale of asking a policeman toescort you to an island & then rushing the remainder is all a myth. Its not as difficult as Macquarie st & the narrow streets make negotiation easier. Together we tramp through this interesting city. see Trafalgar Square & are admitted members of the Royal Automobile Club then to marble arch a huge & ugly memorial arch composed of white marble which looks coal dirty\n\nTrams are double decker & they move at a slow speed. Taxis are conspicuous by their absence & after waiting some time for one we get a newsboy to find one. Tipping here is universal & everyone is looking for a tip where we hesitated as to which way we would go an urchin of about 3 & his smaller sister demanded where we wanted to go & could they help us (for the sake of a tip).\n\nAs we have no desire for dinner we omit it & go to theatre. Drury Lane happens to loom up & we go there perhaps attracted by two Australian names playing there Dorothy Brunton & Ivy Schilling. The theatre is bigger than any I have seen in fact too big for the voices of the actors which seemed lost in the entourage who played in \"Shanghai Theatre is beautifully decorated & has 4 tiers in house. We come out at interval & make for Custom where we are staying for the night City is weird with its absence of light & indeed it is difficult to find ones way\n","70":"\n\nWe rise 6 & go to Tube & thence to Charing Cross as we hope to find a taxi there & this is the easiest way to get to any place whose whereabouts we do not know. In fact Lee's amusement is to set out for some place & when we have hopelessly lost ourselves call a taxi to find ourselves. But this morning not a taxi is to be seen but nevertheless we find our way to Club & await pleasure of a barber who never seems to be there. I in despair decided to shave myself & find a dressing room with hot & cold water baths etc & shave & bath myself while M is merely having a shave. We must find out that train does not start till 10 instead of 9 so we decided to have some breakfast. Before this we decided to do without it. Breakfast consists of porridge (no sugar only syrup) & fried sole (the nicest Ihave ever\n\n\ntasted & 2 poached eggs. No meal tickets are required for this as coffee is without sugar. In midst of breakfast M starts off to meet Lees who had expressed a desire to travel with us & had to meet us at Kings Cross Station. M. is not heard of after this He apparently went to Charing Cross. I see Lees on platform but he is detained at Horseferry & cannot accompany us. Have not seen M. Train starts Itis 22 carriages long. In my compartment are 3 flying cadets One has lived in Victoria for many years. Imight say I only just caught train as it took nearly a ½ hour to catch a taxi. The Club porter running out in middle of road every time he saw a motor & waving a red flag. We pass thrusuburbs of London & am surprised at the freshness of the rosy cheeked girls in factories. Women are everywhere in this land doing a mans work whether in the field or factory If necessary for the work they wear a loose bloomer arrangement. Country soon comes into view & consists of multitudes of pocket handkerchief sized farms each surrounded by a pretty green hedge. The fields alternate between the straw colour of ripened crops or the verdant green that only England knows. We have nothing so green in Aust: & it is only here that one learns the meaning of the word green. \"Talk not of green till Eng you have seen\". Often a field is straw & tinted red by myriads of poppies In Kent I believe the fields are straw with stripes of red. On On we fly thru the pleasant fields of Lincolnshire which weary by their features. This fen country is very flat. This is succeeded by the flatness of the Yorkshire moor which the harvest is still as dense. The fields on which harvesting has commenced are still full of the piles of ungathered sheathes. Everywhere it is the same & in fact in the north the harvest has not been touched Pass thro Grantham & on thro Durham with its old castle perched on a knoll overlooking the river and as defiant as of yoreguarding & protecting a huge monastery as heavy as itself\n\n\n\nFurther on on same side is a more modern castle situated pleasantly in a clearing in the woods for the country now has some dells & dense woods. Then run into Newcastle the great city of the North & great indeed it is Here I must change into forward part of train In Eng if you do not change trains or carriages every two or three stations you know that you are in the wrong train. Never have I seen such a place to change. Here I make friends with a Melbourne man & a Dr from Edinburgh. Country now becomes seashore as Line tends to come on to the coast. In the distance one can see Holy tree & its monastery famed of old & between it & the line feature sand banks on one of which lies a small wreck. From now on to Berwick & for some distance past it we are in the old debatable land & relics of old towers & pillars are numerous. often only a foundation stone left. The hedges have disappeared & all divisions are by small stone walls the cost of labour on the execution of which seems to me to be out of proportion to sheer value. They are loosely placed one on the other & no mortar. It seems a good strong wind or a snowstorm would cause them to collapse. We cross the river & see the old image of Berwick below us. The old castle wall of the old Castle is now part of the station & the train passes through its once impenetrable barrier. North of Berwick which by the way once read in proclamation as distinct from from Scot & UK as \"& the town of Berwick\". We now skirt the coast line running on the top of cliff while often a fishing village nestles at foot Here & there we catch glimpses of trawlers while on rear is a naval squadron & to the north a large convoy. Ruins abound everywhere here We pass the Battle of Dunbar & then Prestonpans & after a while run into the outskirts of Edinburgh On the left stand Holyrood the chapel end in ruins the other part more or less preserved.\n\nOn arrival at Edinburgh at 8.00 it is still light & my friend takes me down Princes st the wide & noble thoroughfare of this city. & which constitutes the main artery of the new city the older part being on the other side of what was once a loch & now is a fertile valley used for railway lines. Across this valley placed in an imposing position the Art Gallery while in rear is old Edinburgh Castle with its square castle of the Stuarts its batteries & frowning walls. At bottom of valley lies the old water supply of the castle. In Princes St stands the huge memorial erected to Walter Scott & if ever a man deserved a national monyment it is he for without him & his work the country would lose nearly all interest. It is only because Rob Roy lived here or Rhoderic Dhu fought there that many places have any interest at all. Unable to find the officers decide to dine at the Caledonian hotel & sit a table with two medical students from South Africa or rather they are doctors at the infirmary. One has had a birthday & has been celebrating & invites me to join in the party. One of them Dr Volthuter arranges to meet me at Frasers Lothian Bar near Lyceum theatre tomorrow at 7.30 pm but I will be far from here to morrow. I have great difficulty in getting a room & go to Troussiers Parisien Cafe Duke St for supper. Lees train arrives at 4 am to morrow & I have agreed to meet him but I dont think I shall be out of bed at that time.\n","71":"\n.\nAs did not meet 4 train I go to all trains leaving for Callander to intercept Lees I visit Waverley Station & he is not on 8.10 am the next is 8.55 am the one I am travelling on. I walk round castle visit old quarter of city & buy a paper which speaks of Billy Hughes as the\n\nPremier from \"down under\". Holyrood is shut until 9 am so I cannot enter. Have a good view of Calton Gaol a huge edifice erected for a gaol but constructed exactly the same as an old Castle & it is hard to believe that it is not one. I catch the 8.55 am at Caledonian Station & proceed north having as a companion Lt A.G. MacLaren 3 Bn Argyll & Sutherland Highlander from Allans Water who points out the places of interest Sir Wallace Monument and the site of Battle of in rear on left the site of Bannockburn & the hill where the camp followers massed & led Edward to believe that a fresh army was coming into action Pass thro Stirling with its ancient castle & blood strewn battlefield now verdant fields. MacLaren descends at Bridge of Allan & I journey alone to Dunblane where the inevitable change takes place & I spend the time in the old Cathedral which was erected in 1240 & contains traces of 3 sisters Euphemia, Margaret supposed wife of James IV& Sybyl all of whom were poisoned & interred at foot of the altar in 1501. Then see castle at Doune one of the oldest in Scotland. Today there is a flag over it as one of the family is being married & my friend a Highland Captain is going to the wedding as it is his cousin. MacLaren has been full of enthusiasm for the Highland scenery & has mapped out an itinerary for me different from what I had intended. He recommends me to have a meal at a place kept by one Cramwho has been in Aust. I arrive at Callander & find Cram. He is in the bakehouse (they are bakers & pastrycooks) & I go there & explain that MacLaren has sent me & have a yarn & am adopted as their guest & given carte blanche of whole house. I spend a half hour looking over library. Then dinner commences & a pleasant one\n\nit is. Food here is in plenty as flour etc is used for bakery purposes & bacon is not rationed. After dinner one of the brothers then details himself as my guide. We then go out through Kilmahog past an ancient mill run by a sluice from river. On past a church of 11th century of which all which remains now is the bell which is in centre of gate. A stone wall made from stones of old church & now surrounds a fairly old burying place. Then we commence to climb one of the high hills on the top of which is Samson's putt a large stone of a different composition to anything seen in the neighbourhood. It is supposed to have come down in a glacier & the glacier dissoved here. Samson threw this stone from one hill to the next & as it was before breakfast he had not strength enough it fell on a low lying hill in the centre. From this point (wherethe bridge was very strong) we commenced ascent of Fordoun or Drum Mohr on two sides it is protected by a series of ditches with two bastions on which is a well still with water in it. It is said when Water lockon Kennacker was put in spring was cut but nevertheless water was in it when I saw it. It is said that somebody intends to dig up this well for weapons but if iron they would be rusted & if flint of no particular interest. The fort was impregnable in old days & was of British origin as Romans never built on a hill. The remains of an old Roman camp below - all that remains is a wall or rampart with a raised portion in centre said to be general headquarters.\n\nThe view from this hill is magnificent. Ben Ledi is near & whence the stag started in the \"Lady of the Lake\" while the place where Scott stayed is seen nestling among the trees. In the distance is seen the Wallace Monument. I gather much bluebells & heather which I will send home also some bell heather. Also my friend gathers some blueberries for me. We descend & cross river on a quaint old bridge. All bridges here are built on a semicircle & if river is broad the arch rises above the road we have a steep rise & fall in road. Stepsseem unknown. We then wander thro wood & shaded walks back home passing on way. Near house is a round mound palpably artificial & much speculation exists as to its origin. It is probably a funeral mound. After dinner at which I could not eat enough to satisfy my host. Peter Cram & myself set off on another tour this time to Bracklynn Fall. These are reached by passing down main St in which his home is situated. here Itry the bag pipes & can not raise one note. The road to falls is ascending & wild the country however is not of such ruggedness as on the other side. Away in the distance I see a white tower which is supposed to be the centre of Scotland. After visiting the fall we walk along the thickly wooded burn for some distance - past a once famous castle of which only a pile of stones about 4 ft high remains & home by shaded walk where trees meet overhead passing on the way an old crazy woman & her home. That night we have supper & yarn until after 11 pm & am dead beat & long for bed. It is a magnificent room they give me\n\n\n","72":"\nAm to leave Callander by 9 am train for the most rugged & aweinspiring part of Scotland. Train is not to time when all two bells are rung to announce it arrival if from the north one bell only. Girl at station (they are all girls on railway) tells me to get out at third stop Glenogle siding. Sunny is mountain above & sparkling lakes or lochs below. We pass Loch Lubnaig, then Loch Earn & Loch Lay. Lochs are silvery waters nestling at foot of enormous barren craigs. The squared end of Loch Earn is peculiarly pretty. Two men in carriage insist that the other line train has stopped is not really upthere but an occasional one & my real stop is further on. Hence I stay on train which flies past next stop & lands me at Luib 7 miles away still I am glad. The day is before me & I find myself in valley between two rugged hills with Ben More at end of valley. Mists sweep across & I have every possible view of Ben More. First back in sunshine & purple with its heather then slightly obscured by mists with the silvery white clouds peculiar to Scotland in rear & finally wreathed in clouds. Valley is very pretty with its ripened fields & quaint houses while aspath goes on it winds near to the River which rustles by hidden by a thick screen of bushes. Anon it breaks into a shallow turbulent mountain stream full of eddies & breaking over stones & making minor cascades. Several times I put on my overcoat as the mountain mists overtake me only to take it off again when the sun shines out. Met a seaman near villageof Killin & speak to him re Australia. People here all speak Gaelic. The entrance to the village is the prettiest I have ever seen. On left runs a low stone\n\nwall below which the river forms a series of cascades dividing itself with an island densely clad with trees & mosses only to meet again & fall into cascades under an old bridge which was overhung by tall trees on either side while on the right is a series of old fashioned verandahless thatched cottages end to end & old fashioned in the extreme while between the river & the cottages runs the winding road. Below the bridge river divides round an island with very high & dense trees. This dreary isle is the burial place of the N'etal & its dismalness justifies its choice. Passing into the village I see the usual old mill year 100 years old & worked by sluices. In the village as I have an address I go to it but it is full, same on second floor & so on. At last I find a place & close as I do not expect to find boarding house in this little hamlet. However I soon discover there are many boarding houses & even a rather fine hotel. Having established myself I set off to view the ruins of Finlarig Castle a castle erected in 1607. On the judgment mound is a holly tree about 3 ft in diameter & on lawn a sundial with 14 faces made by the old monks. Just outside the ruin in a hollow square pit connected with dungeon by underground passage. It was here that he gentlemen of noble birth obtained the privilege of being beheaded while on other side is the hanging tree with a branch at a rightangle about 3 ft in diameter tho this has disappeared but the tree is a veteran compared with the others. The ruins consist of a turret a few rooms including entrance door with the royal arms quartered above it. Walls are of loose stone about 9 to 13 ft thick. The place is now kept in order & surrounded by a stone wall made from ruins which preserves the ruinsas the neighbouring village has been built from it.\n\nThe custodian is an old veteran of the tourist guide type interesting & garrulous. i then go along a beautiful wooded path where trees rise 200 ft high & meet overhead to the Loch Lay & rest on the pier. The sunset is sublime & tranquil which the shadows of the peaks & densely wooded shore in the still waters of the loch give vivid reflections. I return to tea which is served in the room which constitutes sleeping room & dining room. Mealis bully beef & treacle owing to shortage of rations & unexpectedness of my arrival. I have fire made up & washed my socks & dried my clothing & went to sleep. I must start tomorrow by 7.0 am train back to Callander.\n","73":"\nTrip back is same as coming below the loch above the crag & the purple growing so close that one can almost touch it with the hand. Arrive in Callander about 8am & go to Crown who have breakfast waiting for me. I then walk out to see the Pass & Falls of Leny which is reached through old loch gate (Rent 800£ per annum once) at Kilmahog past the Roman camp. The path as winds is overhung with trees to such an extent that though it rains I am not wet. Falls are pretty (see picture) & I return in time to lunch & good bye tomy new found friends & get a box seat on the coach for the Throssachs. When train arrives Lees & Molesworth turn up & get on a coach in rear. The trip is said to include the prettiest scenery in Scotland but in my opinion it is just as grand further north. The road runs past Drummohr (see before) past duct round with Fitz James & Coilantogle Ford to Loch Venachar glistening in the morning sun. The road leads us over the Brig o' Turk where last\n\n\n\nboar in Scotland was killed. All these places have Gaelic names which the old fashioned coachman with side whiskers loves to give us & amuses us very much especially as everyone tries to pronounce them & someone will ask his neighbour what did the driver say was the name of this place.\n\nWe halt half an hour at the Throssachs hotel a stately mansion with alcove in the dining hall hung with curtains. Having luncheon at Callander I do not repeat but ramble down in the Loch Ackray thro wooded path & gaze at the hills which rise sloping steeply back from the rosywaters of the loch. (By the way there is only one Lake in Scotland Lake of Monteith where Mary of Scots was imprisoned. On resumingwe enter the Trossach Pass \"where twines the pass etc\". The road is overhung with trees & winds in out among towering hills visible only at intervals finally finishing with one immense crag called Rod look out on edge of Loch Katrine. Here we take ferry the Sir Walter Scott & pass alongside of Ellen's Isle a small densely wood isle not worthy of a hiding place for an outlaw & opposite it a silver strand. Most of the Scottish scenery owes most of its interest to Scott & whole lines are quoted about spots we pass which otherwise would be unnoticed. We pass down Loch Katrine & land at Stronachlacher Hotel which is closed & await arrival of coach which is a four in hand. We pass by Loch Arklet & are amused at piece of tin hung on telephone wires to prevent the night-flying grouse from running into the wire so coachman said. We get out at Inversnaid Hotel & for 1\/6 have a cup of tea & bread & jam. Visit the Inversnaid Hall near by but have not time to visit\n\nRob Roy cave near by. We then take boat down Loch Lomond & recall the strains of Bonnie Banks. Ben Lomond looms on our view an unscalable peak but on other side is quite easy to walk. We pass Rob Roy's prison. We are in Rob Roys country & everything has some connection with him. This part of Loch is narrow & hemmed in by craggy & bare hills while lower down it opens out hills recede & numerous densely wooded isles come into view in one of which Inchmurrin is ruins of an old castle tho little remains of it. The lochs are all very much similar & one tires of them so much so that we decided to cancel our trip to Loch Fyne tomorrow.\n\nWe arrive at Balloch & take train to Glasgow. Railway Hotel is full & a friend whom I have met in train intercedes for us without success. We try several hotels & get in at one we do not like Lees so back to & finally we get in there & are very comfortable.\n","74":"\nStill with Lees & Molesworth & subordinate my scheme to those & am not as well satisfied as if I had remained on my own. We visit & a Mrs Anderson goes to no end of trouble to arrange a days outing for us. We then set out to visit Art Gallery & walk through it & see nothing tho it contains many gems. Next we return to city lunch & go to National Projectile works, a munitions factory - nothing interesting - girls do all the work which is machine lathing & turning. Shells are delivered forged & then are turned to crrect size - then bottled in process below & then returned & turned again & again then varnished & dried in furnace inspected & despatched. Labour saving devices are rare &\n\nvisit was not worth time spent there. We then returned & caught train to Trossachs to connect with river steamer to see the shipyard.\n\nInformed steamer leaves 5.20 but in Lord of the Isles only arrives 5.40. We pass by many yards often as many as 10 ships berthed alongside each other only a few feet separating them. The boats are of all class from battleships to trawlers. One indeed is queer The Argus she has an immense superstructure hollow above her deck & squared & level we put her down as a balloon carrier. We pass the Yarrow yards & Harland & Wolf on the right. The yard or rather two yards for there is only a church & two rows of houses separating them & these have recently been purchased is a larger plant than at Belfast & is used up to its fullest capacity. On both sides we pass shipyard after shipyard with boats in all stages of construction. We pass old Dumbarton Castle & the residence of Denys of Dumbarton the great shipbuilder. His yard is further up Clyde. We reach Dunfermline & book seats at Alhambra Theatre - stalls at 1\/10deach. The performance Be careful Baby is given in two sittings one at 6.20 & then at 8.20 pm hence the prices. We then return to hotel. breakfast at hotel costs 3\/6 & consists of Porridge, fish & eggs bacon dinner is 5\/6. Voyage passed Lanark steel work, Glasgow shell - coal mine & other enormous mounds - station Abington Beattock Lockerbie.\n","75":"\nLees & Molesworth set out for London by 9 am train & I for the English Lake district by 10 am for Penrith to which I duly arrived after changing several times according to custom. i pass thru Carlisle but have not much time. On arrival at Penrith find a car ready for Ullswater & driver gives me a box seat. Am informed that I must catch train here tonight in fact had better\n\n\n\n\n\nstay at Pooley Bridge but find my informant is daughter of local innkeeper there. I catch boat down the Lake. This is prettiest lake I have seen. It possesses all the rugged & aweinspiring beauty of a cultivated locality. At first densely wooded hills slope down to waters edge & then land recedes into pleasant hills & farms as we go on the cultivated aspectdisappears & bluff as wild & rugged as any in surround loomed up on both side from after leaving Howton view is particularly aweinspiring. I land & am lucky enough to find a coach going to Ambleside whence I can catch a train tonight for Bristol. The drive is magnificent & well worth taking the risk of missing a train. Away in distance is High Street the ridge on which the old Romans built their road & later Higher Bell the highest point in the street. It is wonderful the level ridge they chose. We pass by Brothers' Water where two brothers were supposed to have drowned. A small but pleasant hill edged lake. Then coach enters the Kirkstone (pronounced Cuxton) Pass a narrow ribbon of road shut in by closed piercing crags of loose stones. After a while we have to walk & land at Kirkstone Hotel one of the highest licensed houses in England. It is 1481 ft above sea level. We have scones & milk then sign the book & hear the adage that only a fool takes a coach in Kirkstone for everyone walks. After we pass a sign Dismount accidents have occurred but if we obeyed all signs we would never be in the coach. Pass now descends rapidly & driver puts a shoeon one of the wheels which henceforth toboggans down the hill. At Hotel is a good echo which coachman tries for us. The descent is dangerous in extreme but horse knows the way & driver is confident. This road is not often\n\nused on account of its danger but another via Troutbeck which is 5¼ miles longer. However we are late & driver takes the risk much to terror of the only lady on the coach. Slate quarries now unworked are numerous & Helvellyn is in the distance. Arrive I go to White Lion Hotel intending to visit RydalWater & Grasmere before dinner. However I see the new church & dine at 9.30 & intend to retire early but yarn with an officer & the landlady till late into the night & then sign the book & turn in for the night. Hotel. Bed 4\/- Dinner 4\/6 Breakfast 3\/-\n","76":"\nThe last day of leave intend to spend day travelling stopping for a while at Bath. Motor 6\/- to Windermere for train at 7.25. The number of time & changes today is innumerable & the connections awful in fact it is just 12 when I arrive in camp & I have had no time to visit Bath. At Preston I have 1½ hours to wait & visit town. A Gallery & Museum with Egyptian painting a wonderful scheme done in water colours. I think I see the site of Battle of Preston & some battle relics visit the C of E church & also St Wilfrids the RC church a magnificent interior with marble columns & costly altar. Rejoining train again I get as far as Crewe where I decide to dine as I have another hours wait. Then I wait again at Shrewsbury then another train in Pulford where I have tea on 2 cups of Bovril & sandwiches. I detrain here as by waiting 1 hour I need not wait 2 hours somewhere else (Newport) & will get to Bristol quicker. I go through the Severn tunnel 3 miles in length 7 minutes journey actual part under river is 1½ miles &¾ miles tunnelled approachis said to have cost£2,000,000. Pumps are kept constantly at work. At Bristol I have to rush to No 1 platform to catch train for Salisbury there is none to Denton or Fovant & arrive at Salisbury 10.35 pm get a taxi & then ride for camp like the devil\n\nThough the night was dark we must have averaged 40 miles the horn was going all the time & the fog made driving uncertain. Journey cost£1 & as I am strange to Fovant it takes me some time to find my bearings but finally reach room to find a different inmate. The wild drive was a fitting close in a day of delays & rushes.\n","77":"\nReport at Staff Parade to Lt Todd & am detailed to report to him later at his office at 8-15 am where he explains organisation of camps & advises us to change our equipment for week & that we are to go on a funeral this afternoon of Cpl McIlrich one of my men. Ceremony like all military ceremonies is impressive. Route is picturesque thro the village of Fovant a pretty place thro which runs a river opening at times into cress beds & all others flooding north of the road which as usual winds thro leafy lanes. Arrived at ceremony padre is not there but finally we lay our comrade to sleep in the peaceful old churchyard far from the stress of battle which he had come so far to share. Strange are the ways of Fate that one should come 12,000 miles to find a resting place in a small English hamlet.\n","78":"\nRoute march today & it is worth the march. We are on Salisbury Plains but Fovant is not on plain itself but the edge of it. A large hill back in camp & on the side of it in the green is all the devices ofvarious regiments who have been quartered here. These stand out for miles & one is of the rising sun of Australia in each of the rays of which 50 man can stand. The march is thro delightful country. Surely no place was sweetly pretty as\n\nan English village & its lanes. One place in particular an overhead bridge approached by a leafy shaded sunken avenue was memorable. We arrive back at 12.15 & sleep for afternoon & in the night while everyone else is out I bring diary up to date& hope to write letters tomorrow.\n","79":"\nBreakfast is at 8 this morning & then left 11.35 for O.T.S. Carried no rifle like others. All other officers on boat are joined in this school. We are 12 in this room Elliott, Varsons, Molesworth, Little, Uren, Crighton, Penly, Chow, Lees, Davis, Naigh & attended a lecture straight away.\n","80":"","81":" day at this school which I am informed with musketry school at end lasts 8 weeks. The day consisted of lectures & one little part of drill in afternoon. Walk to village in afternoon with Paroon & return warmed. Wrestled with Uren today & smashed a bottle in my pocket & had to wash my clothes.\n","82":"\nSlow work today - nothing of interest to relate.\n","83":"\nNothing - rain\n","84":"\nDay topography. We had to find our way. The old house at Tedworth\n\n\n\nis a magnificent old home now used as an officers club. The walks around here are glorious. The old trees meet & there is a green grass underneath to which the sun rarely reaches. The spots are ideal & the walks magnificent. At one time we reached a plantation & there were avenues cut into it - leafy walks which never lose their beauty. Here it rains several times a day & then sun comes out between showers. with such weather conditions trees & grass could not but help to grow. Even the trees having green moss right up their branches &those that have not are shrouded with small leaves & twigs. The effect is same as you see in the old pictures. It is indeed worth coming 13,000 miles to see the softened beauty in this country which is never harsh, never aweinspiring but is inspired spiritual loveliness.\n","85":"\nToo wet to go out stayed in & answered questions in class, slept & took hot plunge in afternoon.\n","86":"\nCompulsory church parade 9.30 & all marched to C of E church a new building with square columns & round arches giving a flat suggestion to the archiltecture. Aeroplanes pass here all day & night sometimes singly sometimes pair but generally in flights of 7, 8 or 9. They perform all sorts of wonderful manoeuvres - winding around on side - falling headlong from skies without engines & then regaining control looping the loop among others. By night they fly with electric lights on their planes. It is truly wonderful what they can do. ut they are so common & frequent that it is rarely we take any notice of them. After dinner to night we went over to Tedworth House & which is now an officer club. The\n\nwalk there & back & this shady clump of beeches I think I have described before. The house is full of large rooms & has a lovely conservatory a long narrow building with sweet smelling shrubs on one side & on the other chairs the passage ending in a large cupola with tree ferns & other exotic plants.\n","87":"\n- nothing -\n","88":"\nEngineering all day\n","89":"\nNothing save usual routine. We have been constructing fences of barbed wire the last 3 days & are glad of the week end in order to grow the flesh on our hands. Outside the window where I am sitting there is a pool of rain water in which the starlings are washing themselves - they are not so dirty here & even a little sparrow with much trepidation has joined them perhaps because dust is a negligible quantity. It is always raining here never bright sunshine for more than an hour without a heavy shower of rain. And now a chaffinch the first I have ever seen has joined them. The building adjoining us here is a hospital filled mainly with wounded Huns. Indeed Huns are plentiful about here wandering about under Allied Guard but too well content to make any attempt to escape.\n","90":"\nChurch this morning - on way home see11 planes overhead in the same quarterof the sky. They resemble a flock of birds.\n","91":" to","92":"\nNothing save usual school of Instruction work -\n","93":"\nRode on bike to Stonehenge & Amesbury a distance of","94":" miles returning by Chorlderton a smelly little village with a ditch running round it which is crossed by several brick bridges. Each quaint old house stands back from path & is full of flowers even at the late period\n\n\n\n\n\n\nthe roads are closed in & compressed by the hedges which rise above you on either side while the approach to Chorlderton is through an immense avenue of high trees. The country is flat with one big hill where view is superb. The old church at Amesbury musty with damp & agedcolumns 15 ft square & dead above & below was interesting whilst the view from the stone bridge looking up the avenue was picturesque. On return I was dead beat had a warm bath & lay in my overcoat for 1¼ hours & got flu.\n","95":"\nWent into hospital this morning temp 102.6 & remained here on starvation diet called subsistence till","96":"\n","97":"\n\nWithout being allowed I get out of bed & walk round the room as is usual & was ordered to get up & go to Clive House - a convalescent home where one has nothing to do but eat & go for walks & get strong.\n","98":"\n\nWent for long walk the word with Cotton a friend who has invited me to Bournemouth if leave is granted.\n","99":"\n\nWent on long walk delightful woods where above the trees are all the tints of autumn leaves & below there is a carpet of the same below while the straight branchless trunks look unreal. The blackberries are in profusion & very ripe. I left the beaten track &rambled for hours thro these woods where the sky is never seen & the growth is luxuriant. The rides in the woods are always overhung & the trees on either side meet in the centre & tho underfoot ground is wet one will forgive much inconvenience for\n\n\n\nthe pleasure of seeing this sylvan beauty.\n","100":"\n\nLight showers make our walk impossible this morning soI just stay indoors & see the sloping lawns with dark strip where countless hedges cross them showing between the meadow strip or else the white ribbon of a road in the distance a row of trees at regular intervals planted as if for ornamental purpose whilst on the low hills on the plantation in all their rich verdure clothes them to the edge of the foothill.\n","101":" till 28-0-18\n\nStill the same old convalescent routine - eat & walk. Be in for meals & out not later than 9 pm. Class of officer here are ill bred illiterate slips of youths of the RAA who have mastered the principles of flying about as much as their principles of English & having crashed down & destroyed valuable property arehere recuperating all they can damage some more. One hassmashed his plane in to wreck & another was so rattled that he does not know anything of the earlier stages of the accident. Truly the type of officer is nothing like the old RFC officer & it is no credit nowadays to be associated with such a class.\n","102":"\n\nMothers Birthday - impossible to send anything from here & even if so it would be too early for her next birthday. Lt Col Goddard visited hospital to day. This morning M.O. had sent me to DADMS to see if I could be transferred to a convalescent home but it appears from Aust HQ view that I am British & from the British Hospital people that I am Aust & so beyond their jurisdiction so neither does anything & I stay here with a cough that the heavy fogs round here do not help. I explained to Col that I was trying to get away from Tedworth & the result he asked me if I would ask for 48 hours leave to which I said yes & asked if he would not make it a little longer. He could not grant more than 48 hours but promised to extend it if I wired. There are two trains to townI am informed 4.10 pm & 7.35 pm. As I must get my things\n\ntoge& let the bed free to hospital for the night & incidentally get more leave as I should have an extra night in London. However at 6 I find that this train does not run & ring up station to verify same & am told that staff is gone to dinner but if I ring at 7.20 or 7.30 I might get some one. I am about 2 miles from station as I am compelled I decide to stay here for night.\n","103":"\n\nAsk orderly to call me at 6 but as his clock is 1½ hours slow it is lucky I can wake myself. I bathe shave & get a snack of food & arrive at station about 20 minutes too early. However leave does start & I get as far as Andover where I change. I chum up with an officer from Wiltshire who like every true Britisher never knows anything about his own country. I decide to see the relief of Home guards at Whitehall. This officer tells me to go down into the underground railway system with him. Normally I never go underground as I invariably get lost. I should have changed at Charing Cross but this intelligent scion of the noble English race did not know this & I was landed very far away from where I wanted to go. When I arrived at Whitehall the guards had been changed. Two mounted men motionless on motionless horses in a little box are on duty. Their dress is the armour plated style of ancient knights through which scarlets & blues flash & dazzle ones eyes. Inside dismounted men with clanking swords & dazzle of brass etc stride with clumsy steps in & out of the arches. I pass thro to St James Park, a park composed of winter grass covered with the fallen autumn leaves which no one has had time to gather up for the park in front is a Royal palace it certainly needs some supervision. Across park are low trip wire supposed to be a fence. The Palace Buckingham is a big solid looking structure imposing but not beautiful. The guards were changing the Welsh were relieving the Scots Guard.\n\nThe performance was nothing to speak of I have seen our own men as steady when occasion demanded. In front of the palace outside the Gates is the enormous unfinished statue erected as a memorial to Queen Victoria. I then set out for Horseferry Rd the Australian Headquarters a quaint red building with a large courtyard of grass & then bigger building beyond altogether rather a large place in spite of its small facade. Having drawn all pay available I go down to Commonwealth Bank to visit it & adjust my accounts which have been muddled up. The current a\/c has been transferred fro Aust & put into a savings bank account in this Strand Branch while the savings Bank a\/c has been transferred with a note that it was not to be operated on. However I saw the manager Mr Finnly & all was straightened out. Time is now near one o'clock. I thought of Jack Kennedy & decided to go upstairs & look him up. Sure enough I find him & is quite surprised as I put my head round & greet him with \"Hello Jack\". He shows me through this enormous 7 storey building constructed from Aust. marble & prisoners. From the roof I have a good birds eye view of London with St Pauls dome one end & Westminster the other & below us in a little island in the street is St Clemens Church of which one has heard before in the old song Oranges & Lemons the Bells of St Clemens. The same old bells are there now. We go down stairs & see the library a magnificent chamber with pillars of marble brought from Australia as is also everything in this room save a big carpet which weighs about 1½ tons & cost over£1,000 & was made in Donnegal. We go out for dinner Jack as my guide & I as the leading spirit. I decide to go to Pinolli 17\/00 Wardour St. (Regent 1664 phone) off Coventry St Lunch 1\/6 (noon till 4 pm). Hors d'oevres, soup, fish, meat or Poultry, Vegetables , Sweets & Cheese. Dinner is 2\/- & consists of 8 courses with salads, cheese, & sweets as courses. After Luncheon we walked throughout Soho & saw all the places once dreaded by law abiding citizens. Now all is\n\nquite as any party of the city. We strolled in & out looking at the small shops & innumerable cafes & restaurants. Then to Legrand Gerrard St for a cup of coffee. Here a separate brew is made for each person. After this we made a tour of theatres including John Bulls office where 300 were roasted alive in a raid. Then to Covent Garden theatre a palatial building now used as a store but in front of which is a trumpery gas jet light vastly incongruous with the structure. then to the Market. Here it was Paddy's market without its life. The prices amuse me Grapes 8\/- & 6\/- per lb. Peaches 4\/- & 5\/- each Pears 2\/- & 3\/- a piece, small melons 1 ft long & parched looking 15\/- each. I asked the vendor if anyone ever bought at these prices & he seemed surprised especially when I told him I wanted a case for that price. This is not the slum part but was originally & until the formation of Shaftesbury Avenue the foreign part of London. All the cafes are French & Italian or other foreign elements as are all the shops. Notice in window states that \"Here one speaks -- \" Here & there especially after nightfall one meets a chap that looks his part but the whole Soho is peaceful now & even frequented by many of the richer class for here only is it possible to obtain a good meal in London. The large Hotels go in for glitter & shout & music & the food part of the meal is forgotten.\n\nWe go to Regent Palace Hotel for afternoon tea. The Lounge is the largest space seen with a big circular dome rising in the centre with a glass\nroof. Everywhere little tables & easy chairs at which tea & cake is served for 8d. The lounge has marble pillars, palms & much gold decoration & is known as the Rotunda Court. Many women are present, but English beauty or the apparent beauty for the beauty if existent is often covered under a cloud of paint & powder, does not appeal to me. The vestibule to Court is very large while the entrance is thro a circular glass door revolved by machinery & at first takes some judgment as to exactly when\n\nto attempt the passage. At side are two ordinary glass doors. Time is now about 5 & it is dark. We start off looking for hotel & wander from one to another till we have visited about 15. Finally find Dean Hotel with an attached breakfast in red red blind & little candles on tables with red shade & having settled the place of residence we went out to dine at the Rendez-vous. However this being full we went to \"Au petit Riche\" Le rendezvous des Gourmets 44 Old Compton St London W. phone Gerrard 5988. Here we dined intending to go to the theatre at 8. At 8 we had only finished about 3 courses out of 8 at 10 to 8 & so missed theatre. As we were too late we decideto Colosseum the largest theatre here. It is vaudeville & you can go in at any part so as it was a good meal we lingered over it till 9. At one part I got annoyed at the slowness & lapsed into French & thereafter head girl came round & chatted & showed me books she was reading. She is naive as other French girls. When we arrived at Colosseum Jack asked for seats & though girl had just given seats of a medium price to 2 people as soon as she saw me she had none below the highest price & as I thought I was being got at I refused to go there & we wandered down to Strand Corner House for coffee & refreshments. The place is owned by Lyon who is the Sergeants Ltd of London & has places everywhere. The Corner House has a roundopening within, aroundwhich the floors of 4 or 5 stories run, the band being on the lower floor & sound travelling up thro opening while down below is the Hall of Mirrors which is not very much. Then at 10 we left no supper is seved after 9.30 here. Arrived at Hotel I yarned with Jack in the vestibule & then feeling done up retired to Room 111. There I tossed about on bed until after 3 am. I had smoked heavily during the day after a long abstinence due to impossibility of purchasing cigarettes of Turkish or Russian\n\norigin. Whether it was the tobacco or the fact that I had overtaxed my strength which I had got & am not as strong as I thought & several times during the day Jack was very anxious. I am satisfied that this old heart is not yet fit for active service but I will carry on with it just the same.\n","104":"\n\nRose 9.45 & went for shave. First shop no one in - next was for ladies only & the third was all sorts shaving, manicure & chiropodist. The museum is near by I walk down to it passing on the way Mudies & many other names I know. The building is now almost all closed up only a few of the rooms of the Graeco Roman period are open. All the rest is closed so it is impossible to describe it. Disappointed I took bus to the Bank. The bus system is excellent. They run every few minutes, travel very fast, pull up where required & are as cheap as our trams. While from the top one can see London under ideal circumstances & as seats hold two it is easy to ask names of buildings on the way. All along I see names familiar to me on Customs invoices. I go to Alcocks but there are no more letters - indeed I could hardly expect them for on","105":" I got 6 which I have not yet answered. Mr Alcock then takes me round to Mansion House which is closed as Lord Mayors Feast is soon to be held & then on to St Pauls Cathedral. I enter by the door neath the dome and find myself under the enormous dome with its Listening Gallery round the top of it. It is much like any other church with glorious stained windows & memorials to the dead. Half the church is devoted to the clergy & choristers. The statue of Nelson is undergoing repairs. I go down into the crypt to see where \"high ambition is\n\n\n\nlowly laid\" & pause before the tombs of the victors of Trafalgar & Waterloo & the funeral car of Wellington on which are encircled the names of his many victories. One tablet appealed to me. Just an inscription to the dead who perished in the old Cathedral & whose bones lie somewhere under the crypt. Names include & Duke of Lancaster. Near by is St Pauls Churchyard a little park with a monument in the centre on the very spot where the Cross of Old St Pauls originally stood. I then wander along Lombard St to Fenchurch St to Mincing Lane to see Mr Pettit but he is out & I return with Mr Alcock to take him to dinner. He heads for Sweetings a London business with many fish restaurants all over the city. Meal is good but not startling. Fish called plaice is nice though a little too soft in the flesh. After dinner I set out to see the Tower about which I will say nothing as guide book I am forwarding gives all particulars. Here I met a U.S. officer who asked if he might come along with me. Soldiers are admitted free civilians pay. The old beefeaters in their clumsy uniform edged with red cord with short mantles. These now act as a sort of police of the Tower coupled with the duty of guide. The moat is dry & used as a parade ground for the marines. The guides insist on your seeing everything but they are much the same & we did not feel inclined especially as my limbs are so weak to wander up towers for the sake of saying we had seen this or that particular piece of stone or room, an attitude which the guides could not understand. However our tastes were similar & we left to see the abbey but as it was too late we went for tea to the lounge of the Bristol Hotel Burlington Gardens. then we came through city again. The majority of people in London do not know their way about but will never refuse to direct you or admit ignorance consequently you are often sent in an opposite direction even though you are\n\nalmost at the place where you want to go. After being at such a place I was directed to go 5 streets away in the opposite direction & when things seemed wrong I asked a bobby & he told me to go back to the original starting point - I opened out in good Australian on the fool who had directed me. The outburst staggered & then amused the bobby who hoped that I would not encounter the individual as he forecast visions of a fight. We dropped in to the Regent for another cup of coffee really to put in time as it was too late to go anywhere & too early for dinner: Here my friend met two girl friends who took me as far as my Club & then to cafe au petit riche where I had an appointment. Without them I should have been lost as I find my way in daytime by look of building & at night all is changed. London is a city of darkness. All lights are out & the street lights are shaded or blue. The main illumination is the small headlights of the motor omnibus. At cafe my friend did not turn up & the dinner was Bohemian. The French waitresses remembered me. An English officer came in & sat down & afterwards joined me. Two ladies at the table near by joined in conversation but there was no forwardness such as one would expect in an English cafe if same thing took place. The atmosphere was different. Rain came & I went back to automobileclub for an overcoat where I met Miss Dolly Lox of 12 Albert Mansions Baker St. As rain is heavy do not go to theatre.\n","106":"\n\nAfter Breakfast which I had in bed I set out for Mde Tussauds (see catalogue). This is inferior. The faces are in some cases not true to life (eg Cromwell) though the costumes are. The Chamber of horrors has nothing horrible in it save criminal relics & murderers who after all are men like\n\n\n\nthe rest of the community in appearance. The collection of Napoleonic relics is good & interesting whilst the guilotined heads of the French Rev. are worth seeing. There is a large tea room in the building. Many of the exhibits are difficult to see owing to the decreased lighting arrangements. From there I went on to the Regents Park with the Botanic Gardens & Zoo Park is very desolate & the fallen leaves give it an unkempt appearance. The numberof perambulators & babies is very great, it seems the babys promenade of London & in fact the only place for that I have seen babies. The Park abounds in squirrels & if you have a nut in your hand they will come across the green & eat out of your hand. Dogs are not admitted to park & the squirrels run no risk. The Zoo for a large place like London & allowing for deterioration due to deaths & inability to replace animals, is decidedly poor. The specimens are not of the largest kind. The arrangements for heating rooms & keeping the animals from the warmer climates in comfortable quarters are excellent. But the smell from animals kept in artificially heated rooms must be overpowering. The bears are there separated by a ditch as at Taronga but the monkeys are still in cages likewise the lions & tigers. Lizards snakes & tortoises are kept in hot houses. Here I asked a keeper where the gorillas & orang utangs were kept & after repeating my question he replied \"The way out is up there\". Strange I cannot make myself understood in English. From Zoo I crossed to High St (down Park St) & caught bus for town, where I was advised to dine at Royal. However this was full so I tried Carlton Hotel, Trocadero & other places noting the arrangements in each & the menu. I am satisfied if one wishes to dine well he must seek the foreign restaurants & not the big & showy hotels. So I set out for Restaurant d'Italie 26 Old Compton St Soho where Luncheon is 12 till 3 & Dinner 5 to 9.\n\nThis is an Italian restaurant with excellent brands of Italian wines. The dinner for 4\/- is the cheapest, largest & best cooked meal for the price. In the small room I occupied a french girl & man were at one table. A theatrical manager & his fiancee sat at my table & the far table contained some English ladies & the remaining table was occupied by an English colonel & some old male friends in frock coats. Quite a mixed crowd & so interesting to me. Most English women smoke in public. Young boys of 16 & 18 wear hard little hats & carry sticks quite like little lords. After dinner I set out for Mincing Lane & at the Bank encountered the first traffic jamb necessitating a few minutes wait till a gap occurred in the fast moving traffic. The motor buses travel at full speed & need some dodging. There appears to be little slow traffic & one must keep your eyes open. At present time motor cars are few owing to petrolrestrictions & this minimises the traffic. Thence I went to Pitot but he was out so I retraced my steps to city to Westminster only to find Abbey closed whereat I vented my opinions on the autocracy of a priest who shut up the possessions of the people. But the poor chap said it was not his fault. Then as I did not want to walk to Parliament house to repeat same story & seeing a YMCA enquiry Office nearby I dropped in to make enquiries. I found that Parliament House was closed but that a party would start from here at 10 tomorrow with an experienced guide to see both Abbey & Houses of Parliament so I decide to form party & meanwhile returned to city. Seeing a nice shop with shaving over door & red curtains I went in only to find women. They explained they could shave as well as a man & I submitted. Shop is in Macclesfield St. Then I booked a seat at Daly's Theatre Leicester Sq WC2 (Phone 201 Gerrard) for \"Maid of the Mountains\" & then to Club for room. Club is full & I am directed to Enquiry Office. Man says which hotel do you\n\nwant & threw me a sheet with about 30 hotels most of which I had tried on previous evening. It appears that the military reserve a certain number of beds in all big hotels for military officers especially from overseas & given an order to any hotel. Thus tonight I find myself at Regent Palace Hotel. Then I step round to 1 Hunter St for supper & then to theatre. Dalys has 4 tiers but is not as big as Drury Lane. The priceis excellent &music good. Programmes cost 6deach. After theatre I went back to hotel & had some cocoa & cake. Whilst sitting two of my old sgts now cadets in Air Force came up & spoke to me. They were going away to Oxford in the morning & each said they were only too glad to see me as each owed me a£ which was worrying them. We spoke for a long while & then we all went to bed. Bates & Minnetwere staying here.\n","107":"\n\nMet Bates & Minnet in Lounge at 8.45 & we went into breakfast together after which I left them as I wanted to form YMCA party at 10. On arrival it had not started & then was a wait for some othersto join in. Amongst the waiting party were 5 YMCA girls from America one of whom had torn her dress. I helped her out of her difficulty & we became friends. The Houses of Parliament are the most magnificent chambers I have seen & are well explained in the guide. The statue of Cromwell & a massive equestrian statue of Richard I are the only statues adorning the exterior of Westminster. Cromwell was buried here in all the pomp possible & on Restoration his body was dug up - hanged at Lyburn & head put on a pikestaff outside Hall where it remained for 25 years till staff rotted. Now his statue is one of the two on outside of Hall & from pomp to degradation to pomp again such is the wealth of fame. We saw vast hall once a Banqueting Hall, Star Chambers, Court, where Wallace & Charles I, & Stafford were tried for their life. The\n\n\nspot where Charles I stood during his 7 days trial is still marked with brass plates. Then we entered the Abbey (see Guide) hoary with age & history & full of the ashes of the famous dead. As we move among their tombs we feel instinctively that we are touching all that is great in English history & the responsibility of our duty stands exemplified by the influence which the past sacrifices & memories of the dead overshadow us. Leaving here I proceed to London. The greater part of London is not London but the city of Westminster. I step in Carlton Street quite different from ours then Royal Cafe, Trocadero all of which places it is impossible to get a seat unless you have booked it in advance - a thing that revolts me for I love to wander without plan & to be committed to no set scheme of action but more like the wind where I listeth. Finally the name Elysee Cafe in 244 Coventry St catches my eye & I go in - see M. Card. It is said to be a replica of the dining saloon on the Lusitania Table 76. Luncheon 4\/6 Bass 1\/4 & is very nice though the Italians do not make good waiters. In the afternoon I took a bus 15 to the slum quarter of London down Aldgate, East India Dock Rd, Blackwell Tunnel, Poplar, East Barking, North Woolwich. These slums are much the same everywhere small houses but few tenement buildings these seem to exist nearer the city. Salmon Lane is a lively street & is dangerous. Chrisp St is an avenue of shops buttressed by two rows of costermonger barrows in the gutter while the crowd is thick. The way they eye me makes me verify that my pockets are buttoned especially one which has£20 in it. However I got back & had a look at Petticoat Lane about which more later. Dinner I had at Trocadero, one of Lyons places & a place so fashionable that you must order well ahead to get a place. However I found a place & had pleasure of seeing people line up in a queue among the tables waiting for a place whilst otherswandered among the tables seeking a place. It was like having your meal in the streets & everyone envying you\n\nyour place. The service was damnable. The waiter brought me my wine with my ice & I told him off in public& as he had not got his tip he was afraid to answer back. The food was poor years behind the foreign restaurants. Still it is as well I went for purposes of comparison. I met here Lt Hay from Hendon with whom Ihad a drink & then I caught Tube for Waterloo & thence to Hospital arriving there 12.15 am & squared the orderly on duty to keep quiet.\n","108":" &","109":"\n\nTook all day to rest.\n","110":"\n\nWent out taking photos. This is the first day with sunshine for 4 weeks. Thought I must be back in Australia again. The trees here are becoming desolate & depressing. Their black stems looking like limbs twisted in deaths agony though the carpet of autumnal leaves laying in their last sleep in a brown velvety carpet on the ground is a sight one can now but remember.\n","111":" & 7\n\nMet an old friend of dads - Mabee - now a cattle breeder in NZ & 2nd Lt in NZA. we went out for a walk & are firm friends.\n","112":"\n\nWent out for walk over to Cholderton& then in afternoon with Mabee to Sudbury where there is an old Celt fort consisting of two deep trenches circular the inner one 30' deep & about 50 ft across. I plucked some holly from thehill, also some hawthorn which I am forwarding home.\n","113":"\n\nAll English officers who have had flu have been granted 4 weeks leave but all colonial officers must remain in hospital until fit for discharged\n\n\n\nWhat a pity one is a colonial sometimes. We have had several days with sunshine here but even though sun is bright the landscape is clouded with mists. Such is the manner of England.\n","114":"\nTuesday\nArmistice was signed 11 am yesterday. I am desirous to see how London takes the news. I apply for 48 hrs leave the longest allowed to colonial troops but decide to commence my leave today. In all I take 5½ days an extension of 48 hrs was allowed & the balance taken. Left by 4.10 pm & arrived at about 7 pm. made friends on train with a naval officer & went with him to Chandos Hotel. Drinks are impossible bar is ever full to brim but few are drunk. We then adjourned to a small little cafe in Greek St kept by a man called Gustave where the food is excellent though the appointments are not on the same level. Here we consumed many bottles of champagne. Then we go into the street & strive to make our way through the crowded square. There is a dance at Regent Palace Hotel but crowd is too dense to approach it & we go to Cafe Royal only to find no admission. However by various ruses & lies we stepped in. Inside the room was a howling seething riot shouting & cheering. All more or less drunk the women generally more. The atmosphere was revolting & I escaped as soon as possible with an English captain of the Gloucester Regiment. In wandering around the streets we found two distressed women who had not been able to get anything to eat & instead of advising them my friend in a quixotic humour went from restaurant to restaurant until we found & he insisted to my annoyance on seeing them to their train. Had they been young & pretty perhaps I should not have minded but one was at least 50. I then wandered in & out & among the crowd which was noisy &\n\namusing itself in the heavy clumsy manner that characterises an Englishman when he attempts to be gay. The munition & war girls form the bulk of the crowd & nearly everyone is drunk or getting that way. Civilians & girls take the bulk of the throng & enormously outnumber the soldiery though these increase in number after the first few nights. The forms of amusement are generally of a horseplay character. (\nOn Wednesday\nthe guns weretaken from mall to Trafalgar Square for purpose of being buried. The students from Bart hospital rescued them after a severe fight with the crowd. The gates at Regenet Palace were rammed with a gun carriage but held though it took two days to repair them.\n\nCircles of dancers of all sorts were everywhere. Rings were frequently made round the police & ring a rosy indulged in. One circle consisted of land girls & kilted scots - the order of clothing had changed.. Motors & taxis were afraid to come near the crowd. Any which did were assailed by soldiers & girls who scrambled on top. Every car appearing in Piccadilly underwent this treatment. On one taxi roof a merry quartet danced until driver accelerated his pace & one couple fell off the top. The girl got a nasty shock but no serious injury & the two revellers continued their gambols on terra firma. The police interfered as little as possible with the jubilation even when the cannons were burnt. The granite base of Nelson's monument has been damaged. Last night (Tues) the crowd burnt the YMCA at base& when fire brigade turned out with the hoses & the whole square was inundated. Fireworks are few - although there are some. Anything will attract a crowd here. A man selling feathers put a paper hat on & a big crowd immediately collected. A group sings a song & crowd stops & collects. General form of celebration is to form a procession. Trumpets or drums or bugles lead the way. Roughness\n\nif you are in the way is certain. The crowd is not open free & joyous as our own but each part keeps to itself more. Francis day in Australia resembles this celebration but there was no confetti battles as there. The only real gaiety I saw was a group of Italians in Soho who danced for sheer joy & not for sake of cuddling or being cuddled. In Piccadilly I saw Randall & allied myself with a Belgian officer whose knowledge of English was very limited. So far I had not a room in which to sleep. The Belgeoffered to share his bed likewise two older Belges but I thought this would be too uncomfortable & at least they might be comfortable in their own beds. The Belge then wandered about the streets with me & at about 2 am we came upon an adventure. An air force officer had been thrown out of a two storey building by some women & was wallowing in his blood strange to say not killed by his fall. The police raided the place & here I met another Belgian a waiter at the Coventry & his girls who were waiting to go home by the Tube at 4 am. Time was now 2.30 am. We all five then went for a walk to get warm & I thought AAC could put me up with a blanket at any rate cover so we all walked in that direction & by luck I slept in another mans bed.\n","115":"\n14.11.18\n15.11.18\n\nThe doings of these three days are very much confused & I cannot now divide each day into its travels so I will lump them. The doings each night are as abovethough I stayed at different hotels.\n\nRichmond & Kew. I took a bus out the way & passed through different styles of houses. In some places the houses had been\n\nbuilt before the streets & were so high that you had a broad wall with a series of steps approachingit. Atanother there was a picket fence on this terrace. Harrodsis a great big place now so large as A Hordernthough it is a much larger. The Kew gardens though they may be beautiful in summer are certainly dreary in winter when the leafless limbs are unrelieved by a spot of green. If only these Englanders would plant some evergreens like spruce or pine on the exterior edges they would make their parks more inviting. But it is another case of as it was in the beginning etc.\n\nKensington Museum both natural history, science are well worth visiting. The collection of clothing & tapestry in the Royal Albert museum is excellent though a little wearying to the ordinary visitor unless he has some point to settle. The natural history is part of British Museum which contains nothing of this kind.\n\nTea rooms. Visited Cave Tea Room in Strand off Charing Cross under Dunn Buildings an underground crowded smoke filled basement where the waitresses are exceedingly pretty. Baltic Tea Room 39 St Marys are also underground but nicer than above. Bluebird in York Place Piccadilly a neat little rendezvous place with cushioned & secluded chairs.\n\nRestaurant Molinais in Soho an Italian restaurant mostly show but good. Trianon, nothing particular.\n\nVilla Villa 37 & 38 Gerrard St old home of Burke proprietors Peltamault & Zappeloni Dinner 3\/6 wine 2\/9 & coffee 6donce very notorious now rather on shabby side.\n\nCheshire Cheese in Fleet St with its old fashioned beams & special pie & Johnsons seats which you can occupy for a special sum.\n\nMaxim. One of the nicest of restaurants built like Elysée (see pic}. The crowd is\n\nvery excited & commence by smiling at each other then throwing little bits of paper, then serviettes & even table cloths from each other & down to & up from the lower floor. Armistice does not come every day & they are making the most of it. Then floor is cleared & all done. The poor old head waiter is in a great funk & runs up to every one he sees throwing anything. I want to see night dances in London & head waiter finds a frenchman Meney of 6. Blandford House Frances St Tottenham Ct Road WC (phone 649 Museum) who took me round to Albert Rooms Whitford St where dancing is till 4 am, entrance£1 each. Women are mainly actresses & do not arrive till after 11. Men are nearly all officers from every race & quarter of the world. I have now become a nightbird staying out till 3 am every night soman hour later makes little difference. This cosmopolitan collection interested me muchly. Trocadero Bar a very small place. Bar here usually means a place where drinks are mixed not where they are consumed & so are usually small. Thus the greatest in London would be considered small in NSW.\n\nMonea Bar, best about 8 pm, foreign element. Globe Theatre. Here Marie Lohr was playing Nurse Benson. She is not good though her reputation is great. She is to play Langdon but I do not fancy her in it. She is well supported.\n\nLondon plays are as a rule exceptionally good & the same piece runs for years. Chu Chin Chow is now considerably over its 1000 nights. Picture shows are poor & many of the leading theatres would only be considered third rate with us. Nearly all the theatres are clustered in or about Shaftesbury Avenue. Imperial hotelin Russell Square is an old time hotelbut now much behind the times, largely patronised by Americans though whyI do not know as it is hopelessly out of\n\ndate no hot water in rooms - dirty walls & latrines. Berners Hotel in Berners St is very good but very quiet. The rooms contain easy chairs & ordinary chairs, washing stand, drawers, wardrobe. Carlton Hotel is about best in London occupies a square to itself. Bedrooms have telephone easy chairs is above with a bathroom & lavatory attached to room, costs 30\/- per night, can ring Paris from your bed or any room in Hotel, service is good. Lounge is dwarfed by high roof. Meals cost about 15\/- to 25\/- though there is a limit on soldiers of","116":" Hence the inattention they often receive. Shaftesbury Hotel not bad interesting Murrays (under way) Regent St is theatrical club once but now admits any members. 400 Club & Caro are soon to open but not yet.\n\nManicure shops exist all over the place & are largely patronised by men. Nearly all shaving places keep a manicurist. Rogazski near Piccadilly Grill Rooms in Piccadilly all persons employed are women nice room with lounge & paper, writing desk, telephone & grate fire with easy chairs around it. 10 New Bond St is a manicure place only luxuriously fitted up Piccadilly Grill Room is a magnificent place with numbers of chandeliers & mirrors which reflected them & you seemed to be looking along an avenue of chandeliers.\n\nAt Imperial Hotel I met in the large lounge an officer in unknown uniform. Woollen tunic no belt collar edged with red piping. Blue epaulettes with stars. He is a Russian. Yarned till 1.30 am.\n\nBurlington Arcade is a long arcade very narrow & more congested than ours. It has the appearance of a church aisle. The Art Gallery is worth the visit although all the old masters have not yet been put back. They were also taken into the basement for safety. The figures stand out from canvas quite naturally. Albert Moore's Blossoms a woman in pink\n\n\n\nwith a background of white flowers appealed to me more than any other perhaps because I know it best.\n","117":"\n\nThis morning as I leave London Igo to see the upper reaches of the Thames. The best way to do this is to go to Reading (pron. Redding) & walk along tow path through Maidenhead to Windsor then train to Slough (19 M) & connect with main line. In train I met a French lady named Madame Paape of Taplow who told me that I might use her name with Mr Boss to get entréinto Cosmopolitan Club Rupert St. The Thames is pretty as no river I have seen before. The autumn leaves have not yet fallen & the colour of russet brown is glorious while a similar carpet is everywhere underfoot. looking up from the double bridges at Maidenhead scene is glorious. I lunched here at Skindles near Murrays. The banks are finally made up but covered with reeds to edge. One island has many houses on it but one can scarcely see them so dense is the vegetation. Houses are built on side with back waters running under them. One house called House on the creek is built across a creek & hemmed in with high hedges & trees. The bigger houses have lawns like green carpets running down to waters edge with shade trees & seats & stars of flowers in the lawn. One on an island was glorious, laid out with poplars planted regularly. At one bend a large building like a monastery rang its bell over a silent landside. The river on one side is flat meadow lands & on the other beech covered hill sometimes green with spruce & in other parts the autumn tinted brown. Rock & luxurious growth & growing right down to waters edge. I return to town & go to Berners Hotel Berners St near Oxford Circus. The hotel is quiet & the\n\nroom well fitted somewhat similar to Carlton but hot & cold water is not laid on nor telephone & only 1 electric light. As I had some difficulty on finding hotel I decided that it was too far away & would telephone RRC for another. Then I asked for telephone at Frascati & was misdirected. Then to find my way Iasked a man but could not understand him. Theydo not speak the English that I learnt in Australia. I thanked & asked next man who was a mute. At last I did find phone & discovered that the system was the same as Australia. In neither can you get your number but it costs 3dto get annoyed in England whereas in Australia it only costs 2d. I then went Cosmopolitan Club on Mde Pappe recommendation & had no difficulty in obtaining admission. The Jazz Band is here & I see a very clever exhibition of dancing by some of the coons. Here life is very Bohemian & after supper there is a dance at which everything is free & easy & every now & then some member will get up &give an exhibition which was well worth the visit. After leaving here I wander round the city again which is lively as on our first night. This afternoon the Americans who have done so little organised a big procession, & many other processions were formed including one by girl munition workers & WRAC's to Buckingham Palace. Yesterday I forgot to say I visited the Connaught Room of Kingsways & saw the Grand Lodge Rooms. A magnificent chamber massively decorated in gold with a faint light dimly lighting up the interior. Royal Arch is held in some rooms but there are only baout 5 other lodge rooms the temples being very numerous in London one at Frascati upstairs & one at Holborn Restaurant. The Monk Lodge has rooms in same building . I also visited Rose Croix in Dukes St. As to night is Saturday I think celebrations may culminate I decide to overstay leave especially as the medical authorities will never know the difference & it is not difficult to find a good excuse\n\nduring periods of armistice & this does not happen every day.\n","118":"\n\nThis busy Sunday morning I go to Petticoat Lane a narrow street in the slum quarter which is used as a mart by the Jews on Sunday. Everything that you can name is sold here. There is nothing missed on which aJew can make a sale - even dead men's clothes are vended as such on one stall. The crowd is drawn there mostly by curiosity but they invariably fall to the wiles of some persevering Jew. It is just the same though not as crowded or so noisy as Chrisp St where in place of warehouse walls there are shops i e 4 rows of shops or stalls on a very narrow st. Leaving the East End I go to the West to Hyde Park & alight at Marble Arch. I then walk through the park which is just ordinary paddock with a fringe of leafless trees till I come to Rotten Row. Here the wealth of London passes its Sunday mornings torturing horses - a habit which the society of prevention of Cruelty to animals should intervene to stop. They are leased to call it riding. But as I said before I cannot speak the language of England riding must mean something different from our meaning. Then I visit the Lake - a big expanse of water very shallow, never more than 14 ft in which are several islands & which is crossed by a big solid stone bridge. I then try to catch the train & find the conveniences of the London Bus system. You signal driver to stop & he tries to pull up. Conductress does not see you & rings the bell & you are left. Next one is too crowded & wont stop & so on till you have missed the train. I had to go to Hotel to pack up overcoat & then to Tube which is some distance away. The hotel is not well situated. I just missed a tube & this makes me miss the train though I carry on hoping that there may be some fast trains which\n\n\n\nwill overtake it. But alas there is none & I have to wait till 7.35 pm as I have expended all my cash. I have","119":" left so decide to go to Regent Palace Hotel & collect 11\/00 which was owing to me through their system of deposit. Here I met an Aust officer & have morning tea with him & toss him to see who will pay. I win. I then have a good look round lounge which I hope never to see again & then set out for Jack Kennedy 4.30 near Radcliffe Gardens & met his wife & child. Instead of going to concert at Queens Hall as I intended I stay here & finally meet a mate Handerley Thursfield 9 Cathcart Rd South Kensington SW.10. & have afternoon tea at his place & finally catch train for Tedworth. In train are some English officers & when I ask if this train goes to Tedworth one a major replies in a tone which suggests I ought to address such questions to a porter. The English are truly a surly disagreeable nation & not merely conservative.\n","120":"\n\nWent down & saw General McGlynn. He was affable & told me I was be in a week after I left here. Received a letter from Syd Uni Union re Xmas greetings. I was quite pleased but amused to find that it was Xmas 1917 & had been all this time reaching me . The address was","121":" Bn.\n","122":"\n\nDischarged from hospital today.\n","123":"\n\nThough only a few days out of hospital I decide to borrow a bike & go to the Forest of the Savernakea forest near Marlborough. it is a ride of 28 miles. The forest & the pond avenue the finest avenue in England consists of an avenue of beech trees 3 deep on each side of the path. The path with its carpet of leaves & overhead barren limbs & dales & hills is very pretty but not worth the effort to get there. On my return\n\ndarkness set in & I was put off the right road by the prevailing courtesy of English people who are either the greatest idiots on earth or people with a perverted sense of humour which delights in misleading strangers within the country. A more lying & deceitful race it is hard to find. They are so shameless. Owing to misdirection I had to walk last 6 miles. I was so tired that I could not sit on bicycle & had to ask some men to wheel the machine for me. The road is lonelier than Australian bush & as black as a pitch barrel. I went over the handle bars several times owing to running into side of road which I could not see. Once I landed on a hawthorn hedge & a lively & prickly seat it was. I tore my face, had gravel rash on my hands & cut my trousers. When I arrived at Barracks I had no tea owing to having to meet someone at 8.20 pm or 20-20 as they say here. Pearce & Smith were merry & insisted on riding the bike round the room & ended in a heap with tables, forms & bicycle in one big heap & the bike was damaged when it was returned. I was told I would not be allowed to have it again - at least I had some fun out of it.\n","124":" to","125":"\nExams & loafing is order of the day mixed with wild rumours as to movements of Australians.\n","126":"\n\nThough low in funds have decided to draw some money & go on leave Torquay & Bournemouth being my objectives. The control of a Bradshaw is an art& can only be acquired after years of experience. However as I was puzzling over it in the Club a pretty fair haired dolly faced wife of an officer came to my assistance & we worked out a time table an act of kindness as for few & far between with English people that I will always cherish its memory.\n","127":"\n\nThough leave commenced yesterday yet I did not start till this morning so that I could see the country through which I was passing. At station I met Dr Donlevy who is travelling as far as Bath. Change at Ludgershall then at Swindon & walk to Swindon Jn about½ hours walk & thence on to Bath. Country is same as elsewhere a succession of green fields with hedges around them, no sign of hills or forests. Arrived at Bath Donlevy escorts me as far as Wells (see booklet). after seeing these I went over the Abbey which is much the same as other abbeys although much worn by time. All the houses here are constructed of Bath stone & it does not stand the weather overmuch. I then walked the Roman promenade on the site of the old Roman walls. Many of the houses here bear plates stating that so & so lived here & the old dates. Lord Nelson once lived in a corner house & the tablet records this fact. Then I strolled to Museum which contains a good selection of relics taken from Barrows near by & one mummy of an Egyptian princess which is only about as tall as my breast pocket. I wondered if this is the normal size of the Egyptian of that day or whether it has shrunk. Met an Aust. officer & we paid a visit to Angel Hall. Bar is about 6 ft long capable of allowing 4 only to stand at it but rest of room has tables & chairs. In the train I find that owing to bad connections I have an hour to spend either at Exeter or Taunton & get out at Taunton with a naval officer I had met on the train. Taunton with its narrow streets is not very interesting save by its\n\nhistory & the fact that hotels are open all day. Train stops at Newton Abbot & change for Torquay. I had been recommended to go to Victoria & Albert Hotel & on arrival found the hotel car waiting & before I knew where I was had arrived at Hotel just in time for dinner 7.15. Meal = soup, fish, a morsel of meat, dough (called pudding on menu) toast with a suspicion of cheese on it. Coffee is taken in the lounge where every one looks askance at you & make you feel like an intruder. It gets on my nerves & after smoking a cigarette go outside to find a cinema or theatre. Finally find Electric (pronounced Lattrick) Theatre. Then I wander round the town along Union St into Belgrade St & then to bed.\n","128":"\nSunday\nThere are no trains in the village till 2 pm on Sunday which is rather difficult for sight seeing. However the restriction of petrol has been lifted for day &cars can go within a 30 miles radius. I walk down Belgrave St to Promenade where a fine view of the three hills with clear rows of white houses rising in tiers one above the other. These three hills comprise the city. Road leads past Princess Pier the land south basin or Harbour on the edge of the firstthere is a neat little garden. Further on there is the town & a naval aerodrome & then road seems to lead away from coast so I take what seems to me to be the natural turning & find myself walking along past Imperial Hotel & little secluded bays but road finally ends in a track leading to natural arch which I try to scale but am too weak & soil too greasy so retrace my steps. Road is now on series of full coastal views though there are no real cliffs & the rocks seem a kind\n\nof clay or rather the rock decomposes readily into clay. Beaches of sand do not exist but here & there one can find a shingle beach. The bays are at first small & cosy but after passing Hydro & Osborne Hotel it lengthens. The view from a lookout near Hydro is fine. The shingle beach being many hundreds of feet below. Continuing walk leads on to Babbacombe a pretty little spot which is reached by travelling up a gully. here I cut across private grounds much to amazement of chap I had asked for way & find myself on Lincombe Drive which is a drive around the top of the cliffs which here rise to a great height. One view above gully is exceptionally beautiful being a saddle between two near hills clothed with trees & grass on which sheep feed & everywhere the eternal hedges cutting across it. The drive winds in & out among trees some of whose branches are dressed in ivy & now & again receding as some valley cuts into hills. It is a pretty trip. I leave Drive near Manor House & wander among the Manor Gardens. The climate here is a little tropical & all the trees & bushes are evergreens. The Garden consists of snug bower& little winding path with trees meeting just a few feet over one's head. From here continuing a walk round the tops of cliff I enter rock walk (after climbing many steps) & thence into Carey Gardens & home. The road or path here often for great distances run between rock walls each about 6 ft high. These so obtrude themselves that one has the idea of going through a prison rather than a seaside walk. In afternoon I took the train to Paynton, visited Cockingham, & thence on to Totnes. Just before reachingTotnes near 3 M past a magnificent view is obtained looking across to the Dartmoor Hills. The whole countryside is very hilly with deep ravines. The hills are covered with trees. This is certainly the\n\nprettiest country in Eng. The roads are always sunken being walled up to 6 to 8 ft or else & then as more usual a bank 4 to 5 ft & on top a hedge. With beech trees on each side & meeting overhead. From Totnes road stretches on to Kingswear & across the River Dart is Dartmouth with its great naval college. The day is foggy & covered darkness 5 pm obscures everything. The soil is red & thoughts of \"Red Devon by the Sea\". At hotel girls waiters are liveried rather strange to see a girl all big buttons. Women here wear furs & hats to Lunch perhaps for fear of losing them. Old women here in great numbers & conversation between them is very banal. Some seem to drink wine because it is fashionable know as etiquette & empty bottle by turning it perpendicularly upside down irrespective of sediment. It seems to be object fullest quantity for money invested & this is not Brighton where Jews predominate. After dinner I yarn with an old lady & her husband who have spent many years here& were very interesting. Then hunted up Bradshaw.\n","129":"\n\nI find that to get to Bournemouth I must start earlier than I expected. Train leaves at 9. I manage to scramble an early breakfast & get a few post cards at the station. Train passes up to Newton Abbot & then skirts the very beaches almost till we reach river Exe an apology for a river being a little water moving over mud banks. The cliffs are a red soil rather than rock. Though the views are softer than our coastline yet it is more barren. On arrival at Exeter where I change I get out at St David's station & find that the connecting train leaves from another station Queens about 1 mile away & that it left \"5 minutes\" before I arrived. Hence I did not make the connection & found myself in Exeter with 4 hours\n\non my hands. I visit the walls & see towers of Rochester Castle & gaze across countryside from its walls. A magnificent view with the River Exe & Exmouth in the distance. Below the castle are the beautiful Rougement Gardens while on the outside run the old city walls with the precipitous approaches, walls which enabled Exeter to gain its title of the \"ever faithful city\" & which now form a promenade. Then to Cathedral much worn with age but with its still beautiful carvings on west fronts. The inside is spoiled by the position of its organ while in nave is a grand old two faced clock which also day of month. Then I slip into a room with Elizabethan panelling just as it was when the naval military leaders who fought the Armada met in it in 1588. Further on I find the Guildhall which was built in 1300 or thereabouts with its numerous panels on it each guild & everyone different. It is now used as a municipal meeting place & a Court of Assize. Near by is an old carving of St Peter (?) trampling on the dragon for which there is a trust - producing£25 per annum for its upkeep. Then I visit Museum with a wonderful collection of lower forms of sea life. Here I met a Canadian officer who was opening a collection of Canadian war pictures & allowed me to look through though not officially opened. Incidentally he recommended me to go to Rougement Hotel for lunch where I again saw him. I catch train at 2.10 & after many changes & a long wait at Templecombe a small insignificant town arrive at Bournemouth West. There are two Bournemouths & I did not know for which I was making but meeting an officer in train he put me on to Imperial Hotel & accompanied me to it. Hotel is very comfortable with a mass of statuary in every corner & its frescoed or painted walls & painted ceilings. Seats & lounges exist on every landing & along all the halls. At dinner I met an interesting\n\ncompanion who chatted with me in the smoke room & into our conversation a third person joined who is I understand Solomons President of R.A. recently camouflage, artist to British army Tanks. Conversation is very interesting.\n","130":"\n\nAs I have lost a day through missing trains I must hurry to make most of my time here. So I go out before breakfast along towards Beach. The avenue or streets here are pretty. Scotch firs & evergreens abound & on each side of streets are narrow plantations while at cross roads a little green rotunda. The cliff is not rock but soil clay with rounded quartz. A zigzag leads down & there is a lift electric worked on counterpoise systems. Along beach at bottom of cliff runs a wide asphalted promenade. Beach varies in depth from a few feet to 200 yds near pier. Pier is a cuddling resort on which band plays during certain hours. The end is suitable for dancing & numerous panes of glass give protection fromwind. Opposite to pier are the Winter Gardens with the or Pine Walk. Through the centre runs a stream which could have been made artistically beautiful with a very little effort but is just a bare drain. After breakfast I walked along drive on on top of cliffs to Bournemouth & up through Boscombe then to train whence I went to Southbourne & to Hengistbury Head whence a good view of Isle of Wight & the Needles the nearest point can be obtained. Then I took train to Christchurch. Fare here was very dear even as compared with rest of England & all trains are doubledeckers & awfully slow. One can walk as fast as trains. Their speed rarely exceeds 8 miles per hour & their halts are excessively long.\n\nI return viaBrescombe a thickly wooded little ravine with path at the bottom & a large pool for children half way down. Then along beach. Hundreds of Bath cars drawn by little shetland ponies & occupied by stout elderly ladies promenade for the fresh air. Along beaches are little cubicles which would be blown away with first decent wind or washed away if sea became rough. The cliffs are now rock & if grass or something steps be not taken to preserve it crumbling away there will soon be no cliffs. In afternoon I paid a visit to other side (Poole). Walked along cliffs & across Durley Canalthen Middle Canal& then up Alan Canalwhich is spanned by two bridges & is the prettiest of the three. Then to Rly Station & booked ticket then to Nobbys for afternoon tea & then to metropole whence I went to Station & had a long argument in train with an English barrister re merits of English race. Arrived in camp finally & found all in confusion but managed to find a home.\n","131":"\n\nDettman had arranged to bring my luggage down for me & leave it in his room. I get them down & find contents of trunk has been rifled to extent of£10 or more including my service revolver. I report matter & ask for a search. This is done & man Fisher is leaving for Australia & revolver is found but nothing else. Have rested all day in room writing up diary.\n","132":"\n\nDodge parade all day or else walked around & looked intelligent. No one worries now as war is finished & all interest is gone.\n","133":"\n\nA concert party called the Scots arrived & after concert came to mess. I discovered a brother Mason & a little Irish French girl called Barrie. As some officers had left for Australia that day it was very wet in the mess & everyone happy. Party is farewelled about 2 am with fusillade of Very lights. Then Cox & I adjourn to kitchen & make ourselves many slices of toast & dripping & then at 3 am try to carry my room mate out & put him among the cabbages.\n","134":"\nSat.\nGo to Salisbury. Lucky enough to catch a special train after waiting 2¼ hrs for a car which we had ordered early in the day. I had wired someone to meet me at Leatherhead & although she must have had 3 hours notice she did not turn up so I visited Cathedral an airy edifice building all in one style & as per post cards. Then we rambled through Salisbury - visited an hotel built in 1100 called the Haunch of Venison & another The sign of the George built in 1329 & now dry. Spent some time at Crown Hotel & dined at Bluebird. Here you can only buy one glass of whiskey in each hotel & you walk to the next hotel for the next drink. Rather expensive on shoe leather. The hotels are nearly all very old.buildings. We came home by train which carries no lights in same carriage as two nursing sisters.\n","135":"\n\nThis afternoon Eade & I went for a long walk 14 miles to see an old ruined castle called Wardour which with 30 men held 1200 at bay for 5 days under the lady of the house Blanche Arundell & was afterward besieged by the owner & blown in pieces. The situation is in a narrow gully & not on a wood hill top as one would suppose. The lands approaching glade are filled with trees as large as I have ever seen in England & has a hill on one hand & river bed on other. Scotch fir &\n\n\nspruce lend funereal or ghostly air to place. The Castle has a lake at foot & raised walk. Plan . The approach is about 1½ miles & the spot is idyllic. The trees are evergreen & the lawn & fount within the walls look even now like a painting. This quiet & secluded spot is rich with charms & a beauty that still lingers on in spite of Ruins touch. The Castle possessed 4 stories & a dungeon floor. The dining hall was about 12 ft above ground level & entered from a door on right of courtyard up a winding staircase. Reluctantly we entered this scene of desolation & one time loyalty. Arrived home too late for dinner but had a heavy supper & Richards 32.\n","136":"\nMon","137":"\nTues\nUsual loafing & fooling around. Camp was to have been moved to Codford No 6 Camp Wednesday now it is Friday & at present Saturday.\n","138":"\nWed\nThis morning worked at loading lorries for shift & finished at 11 am & dismissed me on my own responsibility to cover. This afternoon all that is left of company is 10 men & 3 officers. Betts goes off & Eade & I take these 10 men & lose them on hill giving them instructions to walk back to camp at dismissal time & we inspected Chiselbury Camp a raised circular mound with a light ditch perhaps 6 ft deep. Then we walked over to Broad Chalke an old rural village.\n\n"}}