{"Document Name":{"0":"Diary_0332","1":"Diary_0332","2":"Diary_0332","3":"Diary_0332","4":"Diary_0332","5":"Diary_0332","6":"Diary_0332","7":"Diary_0332","8":"Diary_0332","9":"Diary_0332","10":"Diary_0332","11":"Diary_0332","12":"Diary_0332","13":"Diary_0332","14":"Diary_0332","15":"Diary_0332","16":"Diary_0332","17":"Diary_0332","18":"Diary_0332","19":"Diary_0332","20":"Diary_0332","21":"Diary_0332","22":"Diary_0332","23":"Diary_0332","24":"Diary_0332","25":"Diary_0332","26":"Diary_0332","27":"Diary_0332","28":"Diary_0332","29":"Diary_0332","30":"Diary_0332","31":"Diary_0332","32":"Diary_0332","33":"Diary_0332","34":"Diary_0332","35":"Diary_0332","36":"Diary_0332","37":"Diary_0332","38":"Diary_0332","39":"Diary_0332","40":"Diary_0332","41":"Diary_0332","42":"Diary_0332","43":"Diary_0332","44":"Diary_0332","45":"Diary_0332","46":"Diary_0332","47":"Diary_0332","48":"Diary_0332","49":"Diary_0332","50":"Diary_0332","51":"Diary_0332","52":"Diary_0332","53":"Diary_0332","54":"Diary_0332","55":"Diary_0332","56":"Diary_0332","57":"Diary_0332","58":"Diary_0332","59":"Diary_0332","60":"Diary_0332","61":"Diary_0332","62":"Diary_0332","63":"Diary_0332","64":"Diary_0332","65":"Diary_0332","66":"Diary_0332","67":"Diary_0332","68":"Diary_0332","69":"Diary_0332","70":"Diary_0332","71":"Diary_0332","72":"Diary_0332","73":"Diary_0332","74":"Diary_0332","75":"Diary_0332","76":"Diary_0332","77":"Diary_0332","78":"Diary_0332","79":"Diary_0332","80":"Diary_0332","81":"Diary_0332","82":"Diary_0332","83":"Diary_0332","84":"Diary_0332","85":"Diary_0332","86":"Diary_0332","87":"Diary_0332","88":"Diary_0332","89":"Diary_0332","90":"Diary_0332","91":"Diary_0332","92":"Diary_0332","93":"Diary_0332","94":"Diary_0332","95":"Diary_0332","96":"Diary_0332","97":"Diary_0332","98":"Diary_0332","99":"Diary_0332","100":"Diary_0332","101":"Diary_0332","102":"Diary_0332","103":"Diary_0332","104":"Diary_0332","105":"Diary_0332","106":"Diary_0332","107":"Diary_0332","108":"Diary_0332","109":"Diary_0332","110":"Diary_0332","111":"Diary_0332","112":"Diary_0332","113":"Diary_0332","114":"Diary_0332","115":"Diary_0332","116":"Diary_0332","117":"Diary_0332","118":"Diary_0332","119":"Diary_0332","120":"Diary_0332","121":"Diary_0332","122":"Diary_0332","123":"Diary_0332","124":"Diary_0332","125":"Diary_0332","126":"Diary_0332"},"Date":{"0":"unknown","1":274.0,"2":275.0,"3":276.0,"4":277.0,"5":279.0,"6":280.0,"7":281.0,"8":282.0,"9":283.0,"10":284.0,"11":285.0,"12":286.0,"13":287.0,"14":288.0,"15":289.0,"16":290.0,"17":291.0,"18":292.0,"19":293.0,"20":294.0,"21":295.0,"22":296.0,"23":297.0,"24":298.0,"25":299.0,"26":300.0,"27":301.0,"28":302.0,"29":303.0,"30":304.0,"31":305.0,"32":306.0,"33":307.0,"34":308.0,"35":309.0,"36":310.0,"37":311.0,"38":312.0,"39":313.0,"40":314.0,"41":315.0,"42":316.0,"43":317.0,"44":318.0,"45":319.0,"46":320.0,"47":321.0,"48":322.0,"49":323.0,"50":324.0,"51":325.0,"52":326.0,"53":327.0,"54":328.0,"55":329.0,"56":330.0,"57":331.0,"58":332.0,"59":333.0,"60":334.0,"61":335.0,"62":336.0,"63":337.0,"64":338.0,"65":339.0,"66":341.0,"67":342.0,"68":343.0,"69":344.0,"70":345.0,"71":346.0,"72":347.0,"73":348.0,"74":349.0,"75":350.0,"76":351.0,"77":352.0,"78":353.0,"79":354.0,"80":355.0,"81":356.0,"82":357.0,"83":358.0,"84":359.0,"85":360.0,"86":361.0,"87":362.0,"88":363.0,"89":364.0,"90":365.0,"91":366.0,"92":367.0,"93":368.0,"94":369.0,"95":370.0,"96":371.0,"97":372.0,"98":373.0,"99":374.0,"100":375.0,"101":376.0,"102":377.0,"103":378.0,"104":379.0,"105":380.0,"106":381.0,"107":382.0,"108":383.0,"109":384.0,"110":385.0,"111":386.0,"112":387.0,"113":388.0,"114":389.0,"115":390.0,"116":391.0,"117":392.0,"118":393.0,"119":394.0,"120":395.0,"121":397.0,"122":398.0,"123":399.0,"124":400.0,"125":401.0,"126":402.0},"Entry":{"0":"\n","1":"\n\nWe should have sailed today for England but for some reason embarkation has been indefinitely postponed.\n","2":" Company drill. No leave.\n","3":" Drilling only\n","4":" Field work and drill.\n","5":" Company drill competition between Sections and rifle exercises. Won by No. 1 Section.\n","6":" Field work and sanitary instruction. No. 1 got leave tonight for winning competition.\n","7":" Usual drill & instruction in erecting whims Derricks etc:\n","8":" Fatique – Church Parade and half day leave granted.\n","9":" Usual Field work & drill. Sapper Cotterell committed suicide by placing the muzzle of rifle in his mouth & working the trigger with his toe blowing his head to pieces. Reason for action unknown.\n","10":" through City of all Expeditionary troops. Enormous crowds thronged the streets. Engineers did well.\n","11":" Usual Field work, also a Military funeral to Waverly Cemetery. Given notice to be prepared to sail at 12 hours notice.\n","12":" Usual routine.\n","13":" Usual drill & Field work.\n","14":" Usual work.\n","15":" On Guard today. Day Guard twenty four hours 2 on 4 off.\n","16":" Usual Field work & drill also constructing trenches by night.\n","17":" Field work constructing trenches etc:\n","18":" Drill Field work constructing Barrel Piers etc:\n","19":" Field work & constructing suspension Bridge to carry 30 tons\n","20":" Light duties. Leave in afternoon to 11 P.M. Very wet.\n","21":" Light duties no drill. Friend allowed in Barracks from 2 P.M. to 11 P.M. Farewell concert & dance. Ruby brought my tea an she & Charlie Lette came in later & stayed till 11 P.M.\n","22":" - Left camp at 4.15 by tram for Fort Macquarie & took Ferry from there to A 19 S.S. Afric\n\n18th There was a good deal of excitement on the way down. I was disappointed at not being able to see Ruby anywhere although I kept a lookout until the Ferry left the wharf. \n","23":" We left Sydney at 5 P.M. yesterday. Squally with rough seas as soon as we got outside of the Heads & continued rough during the night. I was sick as soon as we got outside of the Heads as were most of the boys but felt a great deal better in the morning but still not too good. A great many are still bad. We are now off Green Cape with the Suffolk just astern. Just met \"Charteufels\". Sounds German!\n\n20th Met Burrumbeet about an hour later. Not too sure about geography but think we passed Eden \"Two Fold Bay\" about 3 P.M. Bright sunshine now with stiff breeze blowing. The coastal scenery along here looks beautiful - sandy beaches with undulating ridges & high mountains in the background. Feeling pretty decent now!!\n\n21st Passed Wilsons Promontory about 7 a.m. About 12 Islands lying off the end of the Prom – all worn smooth by the action of water & a little growth on most of them. The Promontory looked beautiful in the morning sunlight. The morning \n\nbeautiful & fine. The country is very rugged.\n\n22nd Passed Port Phillip about 3.30 but too far out to recognise anything. Passed Cape Ottway about 1 P.M. steaming a little N. of west & were soon out of sight of land. Cape Ottway is a very rocky rugged part of the coast & has a Light House. A calm day with smooth seas. Saw 3 whales. Met a steamer 8 P.M. signalling \"Karoola\" and good luck. Afric signalled A 19 & good night.\n\n23rd Nothing of importance – Troops in good health and spirits. Sighted some whales & Porpoise. 6 P.M. somewhere in G.A. Bight. Long ground swell coming on.\n\n23rd. All well nothing fresh except the breeze. Troops in good health & spirits. Sighted \"Karoola\" about 8 P.M.\n\n23rd Still no excitement – weather overcast but fine. Should sight land tomorrow afternoon & be in Albany Sunday Morning. Boat coming up astern believed to be a troopship. A bit seedy.\n\n24th Nothing of importance. The weather was the roughest since leaving Sydney. A dense fog settled about 5 P.M. followed by heavy rain & wind – soon abated though but wind continued brisk & cool till today. I have a nasty touch\n\nof Influenza. Sighted a couple of ships today.\n\n25th Sunday – Arrived & anchored in outer Harbor at Albany about 5 a.m. The Harbour is well sheltered being circular in shape and surrounded by fairly high hills – very rocky near water edge & covered with dense green scrub from a little way up from the water edge to the top with patches of white sand. Cannot see into Inner Harbor or the Township. Entrance to harbor appears to be rather open with two Islands in mouth. Can see about 1 doz Troopships in Harbor at present.\n\n25th Left Sydney 18th 10 14 miles \n\nTravelled:- 19th to 20th run 192 \n\nTravelled 20 to 21 run 303\n\nTravelled 21 to 22 run 284\n\nTravelled 22 to 23 run 281\n\nTravelled 23 to 24 run 283\n\nTravelled 24 to 25 run 168\n\nSome of mileage not shown on Charts Total 1806.\n\nList of Transports\n\nNo. – Name. – From.\n\nA1 – Hymelus – Melbourne\n\nA2 – Geelong – Hobart\n\nA3 – Orvieto – Melbourne\n\nA4 – Peru – Melbourne\n\nA5 - Omrah – Brisbane\n\nA6 – Clan Macquoradale – Sydney\n\nA7 - Medic – Adelaide \n\nA8 – Argyllshire – Sydney\n\nA9 – Shropshire – Melbourne\n\nA10 - Karoo – Melbourne\n\n25th List of Transports \n\nNo – Name – From\n\nA12 Katuma - Hobart\n Freemantle\n\n11 – Ascanius – Adelaide\n\n12 – Saldania – Adelaide\n\n13 – Katuma – Hobart\n\n14 – Euripides – Sydney\n\n15 – Star of \nMelbourne \n England – Melbourne\n\n16 – Star of Victoria – Sydney\n\n17 – Port Lincoln – Adelaide\n\n18 – Wiltshire – Melbourne\n\n19 – Afric - Sydney\n","24":" - Herorata – Melbourne\n","25":" – Marere – Melbourne\n","26":" – Rangatira – Melbourne\n","27":" – Suffolk – Sydney\n","28":" – Benalla – Melbourne\n","29":" – Anglo Egyptian – Melbourne\n","30":" – Armidale – Melbourne\n\n27 – Miltides – Sydney\n\n28 – Southern – Melbourne\n\n25th During the day a good many boats arrived making about 120 in all. Weather continued cool & squally - nothing of importance.\n\nMonday 26th Weather rather cold with heavy rain falling most of the time. Not able to do much. Drill on deck. More boats arrived making about 26 Orvieto arrived with Head Qtrs aboard. Orvieto is the Flagship. Troops in good spirits.\n","31":" Nothing of importance happened today. Heavy rain fell during the morning but cleared off during the afternoon with sun coming out brightly. In the evening a crowd of the boys took possession of the main deck\n\narmed with a pair of clippers catching everybody with long hair & cutting it short. Much amusement and some chargrin. One of the Engineers was put into the Guard room for participating\n","32":" This will be a big day in the History of Albany – the day on which all the great transports had assembled in her Harbor. The N. Zealand boats arrived this morning – 12 transports all painted slate color and escorted by 4 Cruisers – making fourteen in all. They presented a fine spectacle as they approached the Harbor and were met by the Melbourne.\n\n28th A Japanees Cruiser was the 1st to enter followed by the rest of the Cruisers & some of the transports. While some anchored at the entrance of the Harbour. The 38 great transports presented a fine sight in the Harbour . The weather has been beautifully fine today everybody appears to be in high spirits.\n","33":" – Still nothing fresh all boats appear to be in.\n","34":" Entered Inner Harbour & went alongside wharf to take water & provisions Bennalla on opposite side of wharf!\n\n30th. The Inner Harbor is circular – very similar to outer surrounded by hills – a feature being the green appearance of the grass & scrub. The township is situated on the right of the Harbor as one approaches through the entrance. It is situated on the slope – extending from the waters edge and high up the slope to Mt Sterling and appears to be very scattered. A feature appears to be a large number of \"Hotels\" and a large Church. Another feature is the trees scattered through the town and there also appear to be a couple of Parks.\n\n30th We went ashore this afternoon for a route march & marched \nall round\n through the town & all around Middleton Road. Middleton Road is a fine drive of about 5 miles in length & starts from the township & runs right around a hill & back to the Township. The scenery is good all the way & in places commands a beautiful view of the Harbor. Taking everything into consideration the double Harbor of Albany together with the township nestled snuggled under Mt Sterling – the surrounding hills with their green foliage – the white beaches & deep blue \n\nwater have a pleasing affect on the eye. The whole may safely classed as charming but cannot compare favourably with Sydney Harbor.\n","35":" Left the wharf early this morning & steamed back to our anchorage in King ‘Georges’ Sound. Nothing fresh - clear bright day. Had to get on Fire Parade 5 a.m. A fire occurred in one of the holds amongst some provisions mostly intending for the relief of . A good deal of flour sugar etc was destroyed. The fire was soon subdued.\n","36":" The morning came warm & fine. At about 6.30 a.m. the Orvieto steamed from her anchorage followed by several other boats & at 7 am. the Afric moved off. The \"Euripides\" is the \"Flagship\" of our five & she moved off followed by the Argyllshire, Shropshire, Afric, Benalla\" & 5 others the Miltides being 10th in our line. N Zealand boats followed in rear. As we moved out everything looked beautiful. Breaksea & her sister Island looked very fine as also did the Head on the western side of the entrance. The rock appears to be of an acqeous formation – although the rock about Albany is of an Aqueous nature of a hard bluish grey color\n\nSunday 1st We steamed straight out of the Heads & then turned abruptly toward Perth. About midday a sudden change took place in the weather, a sudden rain storm came up & it remained cool & windy during the rest of the afternoon. The coast is almost obscured with rain. I am Troopdeck Picquet tonight. I believe the three Cruisers escorting us are the Melbourne, Sydney and Minotaur from China Station.\n","37":" Nothing of interest to note to-day. We were 250 miles from Albany at midday & just about rounding Cape Lleun. The weather is windy with choppy seas but not cold.\n","38":" Two \ncruisers\n boats joined us today from Fremantled today the Medic & the Ascanius with two Cruisers escorting. The sea is rather rough with a big swell: Nothing else of importance. \n","39":" The wind has dropped considerably & the sea is much calmer. A boxing tournament was today. Usual drill – nothing fresh.\n","40":" The day has been bright & clear In the early morning sun the boats presented a beautiful sight. There was great excitement at about 7 P.M. as the \"Osterley\" a sister ship of our Flagship passed us. She passed quite closely & the people on her could be seen distinctly \n\n5-11-14 As she passed there were roars of cheers from our fellows. Inside much Coo-eeing - & the response could be heard distinctly from the \"Osterley\". She passed from sight at about 9 P.M. Nothing else of importance. \n","41":" Nothing of importance to record. The weather is very warm & fine. A little sickness among the troops but things are very satisfactory.\n","42":" Getting very warm. The showers are well patronised & most of the troops are going about half clad. We are sleeping on deck tonight. News came through today that an engagement has taken \n\n7-11-14 place between 3 of our Cruisers & 5 Germans. The report is not too favourable for our boats. Vague.\n","43":" Fresh news by cable about the engagement of 3 Brittish Cruisers & 6 German off the Chillian coast. Two of our boats are supposed to be lost and 3 German. Nothing known for certain. This morning the Minotaur left us for other service wishing us good by & good luck. The Melbourne is now our \"Fragship\". The Flagship of our line the \"Euripides\" stood out & stopped her engines today while one of the troops were buried. \n\n8-11-14 This is the 1st death I believe to occur on any of the boats. The weather is very warm now – we are well into the Tropics. Most of the boys are going about half clad.\n","44":" 11-14 11.30 a.m. Great excitement on board – news just through H.M.S. Sydney engaged German Cruiser \"Emden\" & ran her aground at \"Cocas\" Island & is now chasing collier Sydney left our lines at 7 a.m. Afternoon – The news has come through that the Sydney has captured the collier that was coaling the Emden. Supposed that the Sydney opened fire at a distance of 7 miles and that & that the first shot took effect. The Emden ran for Cocas Island & beached in a sinking condition. Rumoured that 2 men were killed, & 15 wounded on the Sydney. The weather is now very warm & most of the men are sleeping on deck.\n","45":" Sydney captured collier that was coaling Emden & after taking crew off sank her. After fixing Emden up & taking crew on board she will proceed to Colombo. The weather is very hot & the sea calm. Nothing fresh of importance. \n","46":" Nothing at all fresh. The weather continues very hot & calm. A little diversion was caused last night – we were all sleeping on deck & during the night a thunder storm came on. The lighting was very vivid followed by four heavy claps of thunder following very quickly on one another resembling closely heavy guns being discharged. At once a number leaped from their beds believing that an engagement was on. One man in a hammock leaped out exclaiming – My – There’s something doing now alright & it was a good while before he & some others could be convinced that it was thunder.\n","47":" A little cooler today with a fair breez blowing. The Melbourne left us this morning for Colombo. It is believed that the faster boats are to steam ahead of the slower ones & take water at Colombo by the time the slower boats come up The Japanees boat is now \"Flagship\"\n","48":" Today has been wet most of the time. There was great excitement today on account of crossing the Line and a Neptune ceremony was Kept up. A large canvas tank was fixed up and a\n\nnumber were ducked mostly officers. The victims clad only in Pyjama pants or something more scanty were mostly covered with flour and paste on some greasy material & in most cases were shared with a large wooden razor after having their faces covered with paste & then were placed on a on a chute & pushed backward into the water \nbackward\n where a number of duckers were waiting to give them a good time. Before the ceremony took place the engineers had a mix up with hoses & wet towels hats, socks, bags or anything that came handy & things were quite lively for a time. The day ended with everybody very wet and happy. Later in the afternoon the N Zealand boat left us with the intention of getting into Colombo before us & start taking water and whatever provisions they require.\n","49":" The day has been calm & \nsmooth warm\n fine with a very smooth sea. This evening the N Zealand boats were just visible. Nothing of importance\n","50":" When we turned out we were well abreast of Ceylon\n\n15th At about 2 P.M. we anchored outside \nColombo\n the Breakwater at Colombo. Inside the Breakwater are a great many boats including the N Zealand boats – the Sydney - \nMelbourne\n a Russian & a Japanees Cruiser. There does not appear to be much of an anchorage & the Bay is formed by a Breakwater across a wide mouthed Bay. Coming into Colombo the view was very beautiful indeed the foliage being vividly green & the buildings all lending color with their restyled roofs & brick walls – while some are beautiful \nly\n white walled structures. There appear to be a number of \nbeautiful\n very fine structures including a number of large Hotels. The Island was partly covered with cloud all the way as we cruise along so that we could not get a clear view of it – but it appears to be very mountainous. The hills looked very fine in the early morning partly covered with cloud and mist with here & there portions of a very high Range showing out above the clouds. All along the coast a feature was the great number of Native fishing boats there being\n\nhundreds & hundreds of them to be seen. To night the lights of the settlement form a very pleasing contrast to what we have been used to lately.\n","51":" Nothing of interest happened today. We are still lying outside the Breakwater. About noon a few Natives came over to our boat & did some diving for money. They will dive for any silver coin thrown into the water rarely ever missing to recover them. The water hereabouts is very much discolored\n","52":" At about 11.45 a.m. about 28 of our boats steamed away presenting a fine sight as they steamed away in the bright sunlight over a beautiful rippling sea. This morning the cloud lifted from the great mountain behind Colombo & they presented a fine spectacle. The mountains here rise to a great height I believe about 8000’. One peak soaring away into the Clouds rises like a Church steeple. At about 7.15 P.M. the remainder of our boats got away. As we steamed away Colombo presented a beautiful appearance with its myriads of lights along the sea front \n\nwhile 3 great searchlights played over us till they dipped & were lost sight over the Horizon. Farewell Colombo!\n","53":" Everything is going well – the weather is beautiful & the sea is almost as smooth as glass. A Boxing tournament today but nothing else of importance. Did 192 miles up to 12 a.m.\n","54":" Nothing of importance today – was taken off mess-orderly to make one of Rifle team.\n","55":" Caught the boats today who left Colombo Wed morning. Nothing fresh. The weather continues excellent. Nearly forgot, a man was lost overboard from the Shropshire in the early hours & although life belts with lights attached were thrown overboard and a thorough search was made he could not be found.\n","56":" Weather still good and we are right up in front rows now. We are all very busy preparing for the boats rifle teams competition. This morning the four Sections Engineers competed for place to represent the Coy in competition and No 1 & No 3 won No 1 being 1st.\n\n22nd Everything going well. The great topic of interest is – who will win the Comp:\n","57":" We are all very busy preparing & training and No 1 are favourites with A.S.C. second Church parade today. The weather is still fine and warm.\n\n23rd A day of great excitement. A Rifles Team & drill competition was held – a team represent every section on board taking part. The result was a rather easy win for No 1 Sec Engineers No 3 being second, and A.S.C. being 3rd \nbeing\n 1st & 3rd teams – thus bringing the","58":" three places to the sharp end. When we turned out this morning we were up to the Island of \"Secotra\" and we just passed the westerly end at dark. The Island is very mountainous – having some splendid mountains on it. A very noticeable feature as we approached the westerly extremity is that the mountains were covered with sand in a great part right up to the top of some of the highest. The weather is still very fine. I may mention that the mountain scenery in parts was very fine \n","59":" Nothing much of importance. The sea is so smooth that it appears almost like glass. Still hot – usual drill & Lectures.\n\n25th Rather a day of events! When we arose there was land visible on the Starboard side\n\nand at 4.30 P.M. we had anchored at the entrance to Port Aden. We are still a long way out from the Township & wharves. Both on the Starboard & Port high forbidding rock rises abruptly from the water while on the Starboard particularly the rock is very rugged & very interesting rising up in great precipitous masses with small patches of vegetation sparsely scattered on it’s steep & barren sides. In the distance on can see what appears to be enormous \nstructures\n stretches of sand backed by rather high mountains. Taken as a whole there is nothing particularly pleasing to the eye except the grandeur of the great rocky walls at the entrance. Tonight one can see the lights of the town & it appears to be a fairly large settlement. Also there is a Military Base visible on the Starboard of the entrance. The final of the Boxing tournament took place today. Altogether the place gives one the impression that the sooner one gets away the better.\n\nNames of winners of Rifle Drill competition","60":"\n\nLCpl Lundy\n\nSec Cpl Dobbie\n\nL Cpl Baldwin\n\nL Cpl Shoosmith\n\nSprs Bird\n\nSprs Finnie\n\nSprs Murray\n\nSprs Smith\n\nSprs Waters\n\nSprs Sutherland\n\nSprs Twchet\n\nSprs Hay\n\nSprs Murray. E.\n\nSprs Wells\n\nSprs Lytton\n\nSprs Gatty\n\nSprs Banks - King\n\nSprs Cridland - Stock.\n\n26th–11-14 Steamed away from Aden this morning at about 6.15 the N Zealand boats leading the way. After leaving Aden we passed a few small rocky Islands. The rock bound entrance to Aden looked well in the early morning sun as we left. Aden appears to be a very important shipping Port judging by the number of boats entering and leaving. Sailing on toward the Straights & looking at the Arabian Coast one can see nothing but great sandy deserts with broken mountain ranges behind. The coast altogether gives one the impression of great desolation – nothing pleasing to the eye being visible\n","61":" At about 10 am we passed the Island of Perim which I believe is an important British Naval Coaling Base. The Island is only a small one & does not rise to a great height above sea level. There is a Lighthouse & Military or Naval Base on the Island. Also passed another small boat about 9 a.m. The African coast was visible & remained with us most of the day. The day has been very hot & trying & we expect it to be so until we get away from the Red Sea. We also saw several Troopships returning after conveying Indian troops to Marsailles. Two passed close on the starboard side, the Sangola & the Ademi.\n","62":" - Another very hot day & most of the fellows are feeling rather badly. We passed a couple of small Islands today with Lighthouses but do not know their names. Saw several Troopships returning today & a couple of mail boats.\n\n27th Cpt Mathers donated £5 to No 1 Sec this morning & Corlett shouted drinks. Nothing else of importance.\n","63":" Most important thing that happened today was a wireless message ordering us to proceed to Cairo to complete our training. We are to disembark\n\nsomewhere in the Suez Canal & go per rail to Cairo.\n","64":" A cool change set in \ntoday\n last night & has continued all day. We had our last Church Parade this morning on board ship. It was good service & we sang 7 or 8 Hymns & had a couple of Instrumental renderings everything being very nice. At the completion of the Service an Officer got up & after Eulogising Mr Owen of the & his work during our voyage asked all the men who considered that they had benefited in any way by the Services or had got any pleasure from the Services – every one stood up to a man. Mr Owen had made himself very popular with the men. Nothing else of importance.\n\n29th Nothing of importance usual routine.\n","65":" The day has been fine but very windy & very cool. About 11 am we sighted land on the African side & a little later on the Arabian coast. As we came close to the land one could see that on the Egyptian as on the Arabian the land was very sandy & very barren – nothing but rocks & sand – mostly sands. Toward night we got close into the Egyptian coast. There is a mountain range not far from the sea-board\n\nnot very high but very much broken much more broken & rugged than I have ever seen before the tops of them being almost like the teeth of a saw. There was a very fine sunset this afternoon – the coloring along the mountains being very fine while the filmy clouds over the tops of them looke splendid. Passed a small Island about 8 P.M.\n","66":" Last night we were all cold – while this morning the wind is still blowing. Many are wearing there Great coats. As we approached the end of the Gulf of Suez we sailed close to the Egyptian coast. The country is very barren not a vestige of vegetation to be seen. The hills along the coast rise almost \nabruptly\n wall-like in places & are very interesting. They appear to be of a soft rock formation very much weathered & scored & scarred in all kings of irregular shapes with sand climbing up in places to the very top. As one gets closer to Port Suez there are still wall like hills but here they appear to be piled up sand – the sand being hardened by time. Everywhere is sand - nothing but sand!\n\n1 12 14 Where the mountains recede from the sea-shore there is nothing but sand as far as the eye can reach & not a sign of herbage to be seen anywhere. In all it appears to be a very desolate land. As we approached the Port we could see the boats that had gone on ahead beside some other boats – about 40 in all - & behind was to be seen the Settlement & a couple of small tree-covered areas the first to be seen for many hundreds of miles the whole presenting a fine sight. The settlement appears to be built in two distinct parts one to the Eastward at the entrance to the Canal & the other West and where there appears to be an oil storage or something of the kind. None of the buildings appears to be very imposing structures apparently square concrete structures. About 3 P.M. the N. Zealand boats got a move on & were soon lost to sight in the Canal. It is still very cool. Noting else of importance.\n","67":" As we passed into the Canal we found the houses to be built very close to the water edge – having nice frontages & trees growing in front of & around them.\n\n2 12 14 On either side of the Canal there are huge tracts of barren sand with the exception that on the western side there is an Oasis extending for several miles having small trees & other rough vegetation growing along it while there are a good many Natives living in mud hut along this part. About every 5 miles along the Canal there are what appears to be wireless Stations. These generally consist of a couple of square stone buildings with tyled roofs & trees planted about them, & of course the necessary apertances for a \"Wire less\". These Stations look well & lend a pleasant relief to an otherwise barren desert. Every few miles there is to be seen Military Outpost consisting of colored troops with British Officers. They all appeared to be in high spirits & cheered heartily & waved frantically as we steamed past. All along the Canal there are to be seen trenches formed in the silt banks on either side that has been thrown in forming the Canal. About 3 P.M. we entered the Bitter Lake – a Lake of very considerable dimensions and about 5 P.M. we anchored near Ishmalia. We stayed here a couple of hours and then made another move. \n\n2-12-14 Almost as soon as we left we were out of the Lake & once more into the Canal. After leaving the Lake on the African side there is a hedge of small trees growing almost all the way to Port Said but on the opposite side there is not a vestage of vegetation. The reason appears to be that the silt has been throw out of the Canal all on one side along here & it must be of a fertile nature. Although it was night time judging by what one could see in in the moonlight this hedge must look very nice growing along the canal edge. Taken all though the trip through the Canal is a very interesting one and although we passed through much of it at night – but as it was moonlight & I was on Guard I saw a great deal of it. Every now and again as we passed during the night we would come to a Military outpost & see the Sentries doing Guard along the banks. About 1 a.m. we passed a big Cavalry Outpost which also had with it a large number of Camel.\n\n3rd We arrived at Port Said at about 4 a.m. & found a large number of boats anchored here beside several Cruisers & a couple of Battleships; British & French.\n","68":" The Town is built with square looking structures not very imposing in nature but mostly all having a great deal of coloring about them the whole making a very pleasing effect. The Streets are narrow & planted with trees, but one feature that strikes one is the absence of flowers & Parks. The water is crowded with Native Craft & these Natives drive an trade – selling everything almost that one can think of. One fellow pulling his boat along picked up a small dead fish floating in the water & offered it for sale. They have been on board all day & drove a great trade. The boys have been Coo-eeing at intervals all day to the shore and being answered in even the natives taking it up. Port Said will long remember the Australian & his wild coo-ee. At 6 P.M. we weighed anchor & pulled & anchored with a number of other boats outside the Port. Goodbye Port Said! \n","69":" At about 7 P.M. we pulled up anchor & made & start for Alexandria. None of the other boats left with us but they made a start later on. The night is cold and a little rain has fallen the first we have seen for some weeks.\n","70":" When we got out this morning Alexandria was already in sight and we dropped anchor at about 8A.M. Port Alexandria like Port Said & Suez is a Port dredged out & formed by Breakwaters & Canals. There is a long Breakwater on the Mediteranian side & inside this a Harbor has been dredged out. But he Port is a good one & there are splendid wharves. There is a great deal of shipping here at present a feature being the large numbe of sailing vessels at anchor. During the day a number of vessels went alongside and the troops & munitions were taken off & away. Most of the N Zealand troops are off \nnow\n We do not know when we will go off the Afric but it may be tomorrow. The town appears to be a large one of ininteresting \nb\n square buildings. There appears to be very few trees & indeed very little vegetation of any kind. Like Port Said & Suez there is of course a large Native population. This morning two of the Infantry tried to get ashore in a Natives boat but getting a shot over them they quickly returned and are now in the Guardhouse. \n","71":" The Transport of troops still goes on but there are still a great many to be taken off the boats.\n\n6th Sunday – This morning the Clan Maccorquadale came in and anchored alongside the Afric – a couple of other boats also. We had Church Parade this morning as usual. In the afternoon a young fellow in the Infantry died on boad. This is the first death on board the Afric so far. The day has been fine & we have had more sunshine than we have had for a long time. There has been a good deal of life on the water today. A notable feature is the small number of white people to be seen. It is probable that most of the white women have been shifted to a place of safety.\n\n6th It is rumoured that the Khedive has flown.\n","72":" Nothing fresh of importance going. The transporting is still going on but there is a large number of boat to go alongside yet. We expect to go in tomorrow. Last night two of our fellows with several others got ashore but were caught coming on board again. The sentry refused to let them come on board & the native who has rowing them land them on the buoy that we are anchored to. They were fined seven days pay & 100 hours detention for breaking ship.\n","73":" 12-14 We pulled into the wharf at about 8 a.m. All has been activity today unloading & tonight most of the material is off. We loaded our carts onto the trucks tonight. The right half Coy of 1st Infty got away today. Most of the labor here is done by Native labor. The Natives here appear to be of a low order & are very dirty in there habits. Expects to be out early in the morning! \n\n9th We were out early this morning to disembark. Some of the Engineers got away this morning to the rest Camp just outside of Alexandria while 12 of us stayed behind to look after our cart & baggage. We had a couple of hours leave to see the town. Outside of the European Quarters the Sts are very narrow & dirty while of course the population is mostly Native & is very dense. In the European Qrts there are some very fine buildings including the Anglo Egyptian Bank the Bourse-Exchange. The Grand square is one of the features of the City & around this town appears to revolve as it were. There is also an Electric tram service but it would appear to compare very poorly with that of say Sydney.\n","74":" Only a few sts are a decent width while the remainder are very narrow. Very few English people are to be seen an only a few white people altogether. We expect to start for Cairo at about 10.30 P.M. & reach there at about 3 a.m. tomorrow.\n","75":" We arrived at Cairo at about 3 am after a fairly cold trip from Alexandria. When we arrived it was cold & it had been raining over night & everywhere about the Station it was muddy. Some of the R.E. met us & helped us with our Carts & baggage most of the labor being done by Natives. We put our carts into the R.E. depot & proceeded to Mena Camp per electric tram. In the afternoon we climed up the Great Pyramid & also had a look inside. The Pyramid is supposed to have been 471’ hight but is now about 450’. The floors of the passages inside are of polished marble & are as smooth as polished glass & were it not for having foot holds cut into it would be almost impossible to keep ones footing. The Kings Tomb is a large square chamber built of large square granite blocks polished & in it is the Casket from which the mummy was taken. The Casket also\n\nbeing of granite. The Granite blocks are so closely set that one could scarsely get a thin knife blade between them & they are supposed to have been brought some 500 miles from up the Nile. We finished up very tired & slept without rocking.\n","76":" Usual drill & Engineers work.\n","77":" Nothing fresh to note. Going on steadily with work.\n","78":" We went to Mena House this morning & had a swim in the Bath. The Bath is a fine one about 30’ long & lined with marble. At 2 P.M. we mounted Guard.\n","79":" No 1 Sec: leave tonight & we went into Cairo. Lt Cpl Balwin and I struck out into the Native Quarters to have a look at things. After leaving the main Sts they become narrow & are simply teeming with people mostly Arabs. Some of the lanes running off these narrow Sts are only a few feet wide without a light showing. The Native Quarters are anything but clean & the Natives also are not too clean. Everywhere one sees stalls with something to sell - all kinds of things that the Natives eat - all kinds of fruit vegetables spices etc: & the smell is something to be remembered.\n","80":" Nothing fresh to note I was working in the new Sgts Mess Room today fitting up some tables – forms – screen & etc.\n","81":" Inspection & instruction in tools in Carts today. Also No 1 went to the Sphinx this morning to have our Photos taken. Leave tonight.\n","82":" We had a heavy day at Coy Drill today. Nothing fresh.\n\n18th We started on a route march this morning & marched out to some ancient ruins & tombs about 4 miles from here. There is a large excavation about 80’ x 60 x 40 entered by an excavation gradually sloped from the \nservice\n surface to the bottom of the Chamber. In the bottom are placed enormous granite blocks weighing many tons – some probably 30 or 40 & placed side by side & nearly in the Centre is the Kings Tomb. The \nCaske\n Tomb is an oval casket cut into the top of an enormous Granite block – rectangular & polished & is about 8’ long. Over this is a lid or cover correspondingly in shape to the tomb & is a good piece of work being nicely polished & having good curves. The Granite is said to have been brought down the Nile in barges some 500 miles from Assuan.\n","83":" The formation of the country is very interesting. Almost every where is same & where the hard formation protrudes is a mass of marine \nshell\n lime formation masses of shell & having become firmly cemented & formed a great marine lime stone formation while there is a great deal of broken Gypsum lying about. The walls of the excavation are cut through solid Marine Lime Stone showing masses of shells & veins of Gypsum running through it. About 25’ from to top a layer of shale\/clay runs through the formation & lower again another layer of similar formation & lower again another layer of smaller dimension protrudes into the formation making the whole very interesting. \n","84":" The British Flag was hoisted in Cairo today making Egypt a British Protectorate.\n\n20th Company Drill this morning. As we were drilling we could distinctly hear the Royal Salute being fired as the Flag was hoisted thus making Egypt a British Protectorate. There was a large number went to Cairo from Mena this morning & a large Military Parade took place in Cairo today.\n","85":" No 3 had leave this afternoon but No 1 had to stay in camp. \n","86":" Went to Mena House this morning for a bath & had leave in the afternoon. We went to Gizeh Zoological Gardens & had a look through. They are very fine Gardens. The Grotto is one of the finest features of the Gardens being a work of art done by the Natives. Inside are figures of animals done with rough cobble & cement & they are very interesting. There are beautiful pathes leading from the Grotto formed with water-worn pebbles of different colors & they are very artistic.\n\n21st 12-14 The most notisable of the animals is an enormous Giraffe – he must be at least measuring from his hind hoofs to the top of his head 20’.\n","87":" This is No 1s Fatigue week Cpl Lundy & I have been detailed to supervise the water system. There is a Steam Plant & an oil engine to watch beside many taps troughs etc: The Plant is worked by Natives but has to be supervised by the Engineers.\n","88":" General supervision of the water system & minor repairs. Cpl Lundy and I have been kept very busy\n\n& we have done a great deal of walking over the sand as the Camp is a large one.\n","89":" Very busy again today repairing taps and doing general work on the water System. Tonight the Native who was looking after the Pump at the Camp pumping Stn got his finger caught in the \ntop\n pump & took the top of it. When I went across to the Engine I found that they had run it hot & the \nCylind\n Piston had seized in the Cylinder!\n","90":" A very busy day today of course the most of the Coy have leave but there is no leave for those on Fatigue. It took all day to get the engine going again but we had it going about 6 P.M. We had a splend Xmas Dinner today & altogether we have had a better Xmas than we expected to have when we left Australia. Each mess clubbed in & in that way we were able to get a good a dinner. All the boys are in good spirits!\n","91":" Leave again for most of the Coy but none for us. Worked again all day & did the usual amount of walking.\n","92":" Nothing fresh since work on the water system & the Coy doing the usual Field work.\n","93":" This is our last day on Camp Fatigue & we are not sorry. We have walked hundreds of miles I think looking after the water. We will be well trained by the time we leave here.\n","94":" old field work, drill etc: nothing fresh.\n","95":" Field work consisting of erecting barbed wire entanglements & drill.\n\n31st Field work – making anchorage for Derricks etc. Nothing fresh going – just going along steadily with Field work & preparing generally for \"The Day\". All going well - men in good spirits & health & everything satisfactory.\n","96":"\n\nSummary\n\nFrom the time we left Sydney 18-10-14 to the present all has gone well with our Forces. There has been very little sickness & few deaths & taken all through the dicipline in all ranks has been good. Much has been said about the want of dicipline in Australian Troops but my impression is that taking everything into consideration that we are Freeborn men used to living a free life with very few restraints of any kind – recognising no one as Master – in fact I think\n\n31-12-14\n\nliving the freest-life possible for any subjects of any country to live & still being good law abiding citizens - the Dicipline is good!\n\nCertainly there are some undesirables but they are very far in the minority. All across on the voyage we had good weather although it was very hot coming across the \"Line\". It is winter time here now & so it is not too hot – but the days are very warm and the nights cool – at times almost cold – but taking it althrough the weather & the climate is good and all appear to thrive in it. Taken on the whole I think the movement of our Troops & our undertaking has been as successful as it it is possible to be in so large an undertaking. Our Troops are well fed – far better than the Territorials at Heliopolis, while our pay is higher than any other troops in the world! Taken all through every thing is satisfactory & all is going well. Speaking for the Engineers we have good officers & we are getting along well & should be able to give a good account of ourselves when we go to the Front. Much is expected of us.\n\n31-12-14\n\nSince coming to Mena we have not been able to do much Field work as we would like to do & this is chiefly owing to the fact that we have not been able to get the stores that we want. However we are getting along well now & are & are again doing Field work - such as Trenching – Bridge building wire entanglements etc:\n\n31-12-14 Sir George Reid addressed the troops at Mena Camp this afternoon. Of course we all had to turn out in our best & look our smartest in the March-past. All the troops looked well!!\n","97":"\n\nToday has been one of the best days I have had since coming to Mena Camp as I had leave from 9 a.m. to 11.15 P.M. & made good use of the time. Cpl Lundy – L. Cpl Baldwin & I started out on bikes at about 9.00 & did a good tour of the place. We visited the Zoo – The Mosque - \nand Mena.\n Heliopolis. The Mosque is a wonderful building – or rather it has some wonderful ancient–work in it. - There are beautiful high arches in it & much fine work. There are doors inlaid with Ivory, M. of Pearl & Ebony - one of Bronze with studs of solid silver & gold walls inlaid with Malachite – Turquoise – Beautiful blue enamel & \n\nother fine work. There are some beautiful Marble tombs done in wonderful carvings one of which is said to have cost £ 22000. There are great candlesticks in solid silver, silver, & for the & silver also. On the outer walls can be seen the marks of 40 odd cannon ball fired from Napoleons guns, & one of the round shot is still adhering in one of the holes made by them. Heliopolis is practically a European Quarter & is a very nice place & has some splendid buildings & fine roads. We arrived back having seen a great deal of interest & well satisfied with our tour.\n","98":" \n\nForming cover trenches today – finishing a trench that other Sections had commenced. The trench was a splendid one when finished.\n\nDemolishing trenches that we built yesterday. Had ½ day off – but No 1 had to stay in Camp all the afternoon but other Secs had leave.\n\n4th \n\n2-1-15. Demolished cover trenches today – formed a few days ago. Had ½ day off but No l had to stay in Camp\n","99":" Had ½ day leave today. I went to Cairo and had a look at the big Museum. The ancient work there is something wonderful & no one who has not seen it can form any idea of what it is like. There all kinds of stone carving & Statues all done in beautiful work. There are dozens of Mummies some of them thousands of years old & still have hair on their heads & their finger nails well preserved.\n","100":" This morning we marched out to a Canal to prepare for building a Trestle bridge. We put in the day in preparatory work & it was 7 P.M. when No 1 got back to Camp. About 9 P.M. a large reservoir immediately above us - & holding 200,000 gls water burst & completely flooded our camp & did a good deal of damage – splintering our Stove like match wood & flattened out two of our tents. For a time we were knee deep in rushing water trying to save our belongings – a good many of which were either lost or destroyed by oil which had been spilt by some casks bursting in the rush of water.\n","101":" All day was devoted to cleaning the debris away from our Camp & drying our tents after the bursting of the Reservoir last night. \n","102":" We were building a Bridge today across a Canal about 2 miles out but did not finish it although we worked till after dark. \n","103":" We again marched out to the Canal this morning where we were building the bridge. No 1 then proceeded for a march up the Canal while the remainder went on building the bridge. We marched about 5 miles till we came to a Native Village. We marched through the village scarsely seeing a Native for a while but when they found we were friendly they came out in dozens. These are only very narrow lanes leading through or between the houses & everywhere is very dirty. The country on this Canal is very fertile. In the afternoon we completed the bridge & it is a splendid job. Brigdr Gen. Bridges gave us great praise for it.\n","104":" Today was devoted to demolishing the Trestle bridge – form raft bridge for Infantry in File & commencing a Suspension bridge.\n","105":" Again marched to the Canal & dismantled small bridge & did other field work while other Sections went on with suspension Bridge.\n","106":" Today our Coy take over the work of the Camp again for one week. My duty is again the supervision of water supply.\n","107":" Worked on water supply today - & had a good day. Some from each Sec: were out road repairing & came in late & tired. Nothing fresh.\n","108":" General supervision of water supply & a little repair to Plant. Some of the boys were out dismantling a suspension Bridge & some were at other Field work.\n","109":" Working on water supply. The majority were out Trench forming & sapping - & they will be out in reliefs at the same work all night: All is going well with the Troops. There appears to be some likelihood of the Turks & Syrians under British Officers making an attempt at the Invasion of Egypt. In that event it is likely that we will be sent to assist in the checking them.\n","110":" Working on water supply. All sections are still working hard in the Field.\n","111":" General work on water supply. Training in the Field going on steadily.\n","112":" Working on water supply. Last day of fatique this week for 1st Coy. Still uncertain when we are going down Canal. Censorship again on mails.\n","113":" – Sunday - Church parade this morning & I went to Presbyterian Service – had leave in the afternoon & went to Cairo Museum & later to \nSt\n All Saints C. England. There was a large congregation - I should say about 500 including a lot of Military.\n","114":" – No 1 Sapping & \nre\n filling in trenches recently formed.\n","115":" Route march for whole N.S.W. Brigade of about 7 miles - Had some heavy & fast marching - but very successful.\n","116":" No 1. Musketry. The shooting generally was good.\n","117":" No 1 & 2 marched about 2 miles to Canal & formed barrel rafts, bridges & Trestle Bridges\n","118":" Did Field work in morning & had leave in the afternoon & went to Cairo. Nothing fresh.\n","119":" No. 1 F. Coy starts a week fatigue work today. My duty is on the water supply. A busy day.\n","120":" Had a very busy day. The water supply is not too good & is causing a good deal of trouble.\n\n25th–1-15 Usual routine on water supply again. Have a good deal of work to do.\n","121":" Water supply duty as usual.\n","122":" Getting water into much better condition. Water rising in reservoir.\n\n27th Work going on satisfactorily.\n","123":" Still on water supply water rising well in reservoir.\n","124":" Had a good day. Have the water in reservoir standing at 6’ while it was only 4’ when we took it over at beginning of week.\n","125":" Work going well. Have had a busy week but leaving things in good order for No 2 Coy taking charge tomorrow.\n","126":" Church Parade this morning. I attended Presbyterian Service. Had \n\nLeave in the afternoon & went to Cairo. Went to Presbyterian Church at night. Revd Gillan B.A. Had a pleasant afternoon.\n\n"}}