{"Document Name":{"0":"Diary_0479","1":"Diary_0479","2":"Diary_0479","3":"Diary_0479","4":"Diary_0479","5":"Diary_0479","6":"Diary_0479","7":"Diary_0479","8":"Diary_0479","9":"Diary_0479","10":"Diary_0479","11":"Diary_0479","12":"Diary_0479","13":"Diary_0479","14":"Diary_0479","15":"Diary_0479","16":"Diary_0479","17":"Diary_0479","18":"Diary_0479","19":"Diary_0479","20":"Diary_0479","21":"Diary_0479","22":"Diary_0479","23":"Diary_0479","24":"Diary_0479","25":"Diary_0479","26":"Diary_0479","27":"Diary_0479","28":"Diary_0479","29":"Diary_0479","30":"Diary_0479","31":"Diary_0479","32":"Diary_0479","33":"Diary_0479"},"Date":{"0":"unknown","1":615.0,"2":616.0,"3":617.0,"4":618.0,"5":619.0,"6":620.0,"7":621.0,"8":622.0,"9":623.0,"10":624.0,"11":625.0,"12":626.0,"13":627.0,"14":628.0,"15":629.0,"16":630.0,"17":631.0,"18":632.0,"19":633.0,"20":634.0,"21":635.0,"22":636.0,"23":637.0,"24":638.0,"25":639.0,"26":640.0,"27":641.0,"28":642.0,"29":643.0,"30":644.0,"31":645.0,"32":646.0,"33":647.0},"Entry":{"0":"\n\n","1":" Egypt\n A busy day. At 6 am all marched out on the parade ground with all kit & equipment and leaving sentry over it struck all tents. Worked hard until 9 – the whole camp clear then and cleared up. Fell in coys. as for bivouac and piled arms. Kit and equipment placed on either side. We now have to look forward to dwelling here without tents or shelter for a couple of days. After lunch all hands to use their own expression \"p. off’d\". The whole camp being AWL just like when leaving Broadmeadows. They have their pockets full of money and consider they have earnt a spree. Tomorrow they will return ready for hard work once more. What a casual individual the Australian must seem to Imperial officers. Good many well abed and happy. Word just arrived that sent to hospital with injuries caused by gharry running over him while lying drunk on road. After all the trouble we have had with the drunken sot to think we won’t have the satisfaction of pushing him into the firing line. Such wasters are a drag on the whole army. Today the \n\nmost crowded imaginable. Reinf arrived at 6.30 marched straight off and pushed through musketry course, all garrison duty and medically fit struck off and sent away. Mule drivers left for Alexandria by midday train and generally the number of details in and out enormous. General Legge addressed all officers & N.C.O’s and gave some interesting & good advice. Stayed in camp all evening issuing orders and straightening out financial mess. Longed for a final run round the wickedest city in the world, Le Cairo, and all the old incense and perfume scented places that seem so exotic and Eastern. But suppose as we move off to Turkey tomorrow or next day that there will not be time for \"Stippolak\" or Getz or another glance round Cairo de Paris Abbaye or Kursayl. The men now (9.55) returning to Camp freighted with wine and quite happy. No buglers in camp & only 100 men out of 1000 on parade this evening. They’ll have no money from now on and will work like hell. Bed very tired.\n","2":" Up by starlight. Must have chosen the hardest spot in camp, no sleep after once waking up. Out on parade only one man absent at reveille roll call this morning but a good many since cleared off to have another splash. Program battn drill and anticholera inoculation. Bdier on warpath re parade state. Officers slack & won’t get grip no ad at H.Q. Great talk in Cairo last night over the first appearance on the stage of an Egyptian actress. Up to now always been considered degrading to appear on the stage as of course their faces must be uncovered, but there has never been any objection to their going in for café concert entertaining. Madame Murrira the first woman to cross the footlights. The play said to be very wearisome and not up to expectations.\n\n28\/8\/15 our kits & everything still all packed up we only want our marching orders now and the sooner the better. All hands want to get to Anzac (Aust. N. Z. Army Corps, Anzac) and hope for an attack before we have to settle down to trench work.\n\nGreat many details cropping up all day culminating in full moving orders from Bde. HQ at 7 pm. We leave at trains going 9 pm & 2 am so it means all night as well as day. It will be a day of mixup and block losing but we will get away somehow. Kits etc to be shifted and all Ss paraded and march past before 9. The GOC Egypt to inspect. Details to be kept going all day Dies irae! Bed 10. Quite ready for sleep\n\n29\/8\/15 Up at 5. Big church parade stayed in lines and issued orders. March past At 9 all kits stacked near road and motor lorries turned up. The motor service most efficient from one end of the road to the other one long line of lorries close behind one another, getting away when loaded and then another coming in. No bustle no confusion just shows what motor transport can do. A memorable sight. All hands slept on ground and slept like tops breeches the best pillow. The only trouble is feet which will persist in sticking out. Australian mail just arrived in time to catch us before leaving. Trains go at 9 pm. 2.30 am so all night we’ll be travelling. Our transport is H.T. Scotian, our complement about 1300 military. Our own battalion all together fortunately not split between 2 boats like some of the other regiments. We also carry the 6th Field Ambulance\n","3":" Q. What is the significance of the shaved or close clipped patch on top of the head of most of the natives and small tattoo symbols on both temples. Just \nside\n on both sides of mouth near lips also tattoo marks mostly in women which gives a drooping sort of look to face. Hands also often tattooed. Niggers very funny settling up – all bringing in faked a\/cs & when bowled out take it quite as a matter of course. Mohommed and washing man rebuffed severely. We have a tremendous day ahead of us yet God knows when we sleep, as we are travelling all night. Big Australian mail just arrived. The men will relish their letters before they go. Jack up to say goodbye & swopped letters. Camp pretty clear. Surprised by the number of men who rush any job connected with horses. Only ask for a groom or mounted officers batman and fellows positively plead to be taken on saying they love horses & so on\n\n29\/8\/15 Left Camp at 5.30 with 16 officers 507 men representing the right half battalion – the left half to catch a train at 12.30am. Marched through Heliopolis passed through streets and passed Luna Park no sign of J. – though. Patients gave rousing cheers. Reached Palais de Becuba heavy packs made pace slow, and sat down in plenty of time and waited while Capt Peale & self marked off train with chalk allotting men to different compartments. Entrainment took place quietly and quickly. It shows excellent training when one thinks of militia entrainments. General Spens on platform. Cries of \"sigh-eader\" from men & natives While waiting on small piece of grass in front of over 500 men two natives turned towards Mecca praying.\n\n29\/8\/15 The operation consists of first spreading a garment or mat on the ground facing East and then standing with bowed head & clasped hands, meditating. Then down on knees and touch ground with forehead muttering prayers. Repeated 2 or 3 times and then up.\n\nTrain then to Cairo and switched on to Alexandria line. It is now 9.35 am we may be on board a transport 120 miles away in a few hours before dawn any way. Looking at Cairo passing through the mind runs back to the Mouska & the Arabian Nights. Slept two hours. At midnight we are passing at great speed through irrigated country, the plains stretching on either side a canal running all the way along the right hand side. The area full of a dank smell like and we rushing along through the at express rate\n\n29\/8\/15 12.30am. Have just taken a walk along the train the compartments are full of equipment the men lying sprawled about in the most queer attitudes sleeping like little children an odd one stirring slightly but the majority tired out and dead to the world. We have had a tiring day today and they are all knocked out. We are not finished yet and still have more experiences to undergo. Arrived Alexandria at 1.15 am and disentraining on to the quay just alongside HMT Scotian and embarked. The disentraining & disembarkation a credit for silence & rapidity. The Scotian a vessel of 10000 tons (Allen& Co Chief Daniel McQueen) and as a passenger boat Canadian Trade very comfortable 500 men stowed \nforward\n aft in 3rd class cabins. Allotted cabin with Capt Curnow very comfortable. Supervised embarkation until 4pm then had some tea, shaved & bathed. When reveille \n\n29\/8\/15 went. Completing a whole day without sleep. A crowded day\n","4":" Mitchell arrived and carried on. Had a look round ship and like her well. 24th embarking on HM Nile. Alexandria natives we notice as before differing in dress etc from further inland. A busy port transports all round and the high masts of Arab dhows sticking up everywhere. Busy round ship. Went into Alexandria at 10pm for morphine for the doctor and had great difficulty in getting same. Eventually got 200 grains for 3 pounds 5 pence. The docks very extensive and the city round that quarter very squalid. Better class places are about 2 miles away. Passed through the native\n\n30\/8\/15 quarters. Markets and small shops. All very dirty and people seemed dirtier too than Cairo the colour of the people varies a great deal – too many armies have been quartered in Alexandria for its race to be a pure one. To Mohamed Ali square oriental stores & the Bourse fine buildings. Thence down side street where finest buildings are – a credit to any city prosperous and clean. Great variety of colours in the street. To chemist and then to Eastern Extension to send a cable for Col. Back to ship for lunch. Quiet afternoon the men all very good and hard at work. Memo get bayonets sharpened up\n\n30\/8\/15 HM Nile pulled out with 24th. Found three stowaways on board and put them ashore. Amused for a long time by the crowd of youngsters scrambling for coins and the very futile efforts of policeman to stop them. Left 5.45 swung out from wharf and tugged out through shipping. The beauty of the harbour forces itself on one. In front the thick shipping and winding narrow channels in rear the white city like a leadpencil straight along the coast. A good bye to Egypt, fascinating, filthy, beautiful repulsive the home of an intense religious people and the mother of vice\n\n30\/8\/15 outside the breakwater a heavy sea was on and the pilot boat and tug were tossing very heavily. The process of dropping the pilot full of excitement, he swinging about on the end of a rope ladder a few feet above the water, and then the drop into the pilot boat at the exact pychological second.\n\n10pm. We are bowling along in pitch darkness with all lights out on account of submarines. Two machine guns are mounted with crews standing by all the time and guards with ball are also on sentry. It is a quaint feeling to know that any minute may mean a good big torpedo into the centre of the keel\n","5":" A fairly large roll on and a good many sick. Felt squeamish about bed time and had a great sleep this morning beautiful blue seas and sun with cool breeze. Sharing cabin with Capt Curnow. This boat \"Scotian\" a fine vessel most comfortable usually on the Canadian run. Boat drill at 11 o’c. All hands standing to their boats. More practice needed as there were too many who did not know where to go. Remember a funny incident marching through Heliopolis. As head of column passed Marche noticed a native woman pushing a cart of sukkar melons. As soon as she saw the soldiers coming she turned round and bolted down side street with her fruit. This happened quite a number of times – experience teaches them to take no risks with thirsty & tired Australians. Small boy singing on Alexandria wharf yesterday to tune of Marsellaise – words English-Egyptian conveying nothing to the uninitiated. Alexandria harbour full of shipping from all quarters. The chief port for Northern Africa. Before Officers mess Lou P. & Hugh B. very p.--d. P. had to retire after a futile effort but B. survived. On boat deck cool breeze so strong as to make walking a difficult process\n\n31\/8\/15 Had a look at the chart and a blow on the pitchdark boat deck. Yarning to doctor till 10 and then turned in. The whole ship in darkness no lights anywhere\n","6":" Up at 6. on boat deck very fresh and cool. Sea at its best and delightful after three months in the desert. Some seagulls on the port bow – land probably not far off. The route we are on is that ploughed by the earliest sailors in the world & the Phoenician galley. Probably the transports, the dark ribbed ships of the Iliad en route for Troy were past here. We shall pass through the Archipelago soon all the islands between Greece & Turkey towards Lemnos the base of our A.I.F. the island whence Homer’s galley returned \"freighted with wine\". Two officers on lookout for submarines all the time.\n\n1\/9\/15 11am Land on starboard bow evidently fairly high land very likely Crete. High land in sight further where probably all one island, a slight haze makes rather indistinct. Beautiful sun blue sky 2 sea and cool breeze A cargo boat about two miles away steering the same course as us After lunch meeting of officers in Orderly room re Batt Funds and disposal of effects etc.\n\n4pm. Passed more land on port side large island about 5-10 miles long with large town or village. Small vessel (steam) just off island, a transport about four miles in front, a half submerged object of some sort is following in her wake probably a British submarine convoying her. Later – turns out to be a water barge in tow. Land alround us now we are getting the Archipelago Yachting to these seas must be sheer delight – perched on the heights of the land appear to be white buildings – a fairsea on\n\n1\/9\/15 The Australian language will acquire some new terms when all the \"tommies\" get back. They never say \"go away\" always \"imshi Yallah\", and other terms. A great song with them \"Down where the watermelons grow\". Also \"If the odd numbers don’t mark time two paces, How the hell can the boys form platoon\". Made arrangements for issue of 150 round of ammunition, & the iron ration to every man and to have 3500 rounds more belted up for the machine gun. This tomorrow morning. Quite a number of Imps well p. Tonight made narrow escape. One gentleman ‘Bai jove \n\n you know it would be terrible to be torpedoed while you were drunk don’t yer know.)’ Another Oh! where is that Q place plan) A very decent lot though and they improve on acquaintance. Before mess passed large island with house on highest point & large village or town on lower slopes, scattered about white houses and on skyline a row of windmills.\n\n1\/9\/15 Dr Maplestone a good trencherman. Rather interesting to watch his development. We expect to make Lemnos tomorrow morning but the Master expects to lay off a couple of days.\n\n10pm. Darkness everywhere on deck all saloon windows are covered with thick blankets. Still passing among islands had a good blow on saloon deck and so to bed\n","7":" Up and had a bath – \"very goood very nices very klean\". Fresh sea & wet decks, no land about, issuing ammunition & iron rations The men quite amusing in their excitement & earnestness. \"How much do we get, where do we put it\", and so on. Each man as he gets his allowance getting away into a corner by himself like a dog with a bone & stowing it away in his cartridge pouchs. Lemnos in sight a long rugged barren looking island the sea in between - shining in the sun & covered with white cliffs. Coming into harbour swing round large cape, score of big transports & warships in sight – a beautiful place 3 hospital ships & big camps beyond. Glorious blue sky & sea. Embarkation officer just aboard HM Southland. 63 off. 1362 men (Bde Div 21st & Co 23rd ) sunk by submarine just behind us. Much afraid Jack on board her\n\n2\/9\/15 The entrance to this harbour is by a narrow mouth from the open ocean, across this mouth a boom is also fixed leaving only about a shipslength gap in the boom The harbour then bends well round to the right into a large deep bay surrounded by beautiful green hills and divided into sheltered coves by projecting spurs. The depth of water is about 15 fathoms and scores of large passenger vessels (transports) are lying at anchor. Coming up to our position we passed through two rows of warships French & British, a good fleet in themselves. Four hospital ships also lying there Anchored before lunch, scattered camps all over the green slopes and one village in among the trees. Exquisite shades of green on the hills and right down to water’s edge. Dancing seas and bright sunlight make a peaceful and quiet scene And yet at 9 o’c this morning the nearness of war came very close to us by the sinking of our comrades on the Southland, I hope to God Jack on \"Haverford\".\n","8":" I am going to signal her as soon as she arrives to ask. But I am afraid it is a forlorn hope\n\nLater. Embarkation officer has just hailed us \"The Southland has not been sunk. Only two boat loads of men lost. She is coming in under her own steam. Frantic cheering.\n\n6pm Torpedo boat destroyer & Aeroplane boat passed full of 21st men. Nearly all taken off \"Southland\" which was said to be hit 2 feet below waterline and heading for the beach when last seen. Flag signal \"We have lost some of our men\" also unofficial the B’dier went down. Barges full of wounded passing to hospital ships and after dark from the bridge the roar of the artillery at Gallipoli could be heard. Looking round from this boat the harbour looks like Suez or Port Melbourne. Liners everywhere gay with lights but no sound at all\n\n3\/9\/15 About 20 men over the side swimming – \"gib it, gib it baksheesh Australia very good very nice\n\n4\/9\/15 Men in swimming, lowered boat in case of accidents. Marvellous physique; splendid specimens all of them, Much afraid the report of Bdiers death only too true. We may land here and reorganize. \n\nThings very quiet aboard nothing to do. We are to expect 2 hours notice to disembark. Rumoured that 8000 Aust. Are being sent back from Anzac on account of water shortage The Aquitania has just pulled in packed with some of Kitcheners army on her somewhere over 5000 on board. The tonnage of the ships in harbour must be very large. This is a delightful spot with its villages nestling among the trees and the white camps on the rises. The green slopes rising gently from the water’s edge. The water as calm as a pond and everything quiet and peaceful and yet outside are the fighting tops of French & British war ships and the roar of the guns can be faintly heard near the trenches 4 hours away\n\n3\/9\/15 Busy censoring letters when marching orders came. We sail tomorrow for Anzac at 11am. Carring 2 days iron ration – one waterbottle full has to do us for two days\n","9":" All bustle at 6.30 with ration drawing. Up on boatdeck a fresh cold wind blowing and the water all churned up. The harbour a memorable sight. The green country-side alround and in the water the large ships; the two rows of warships lying right down the centre. Across in lines are the large liners The Maurietania with her four funnels is about a mile off and looks quite small. The Empress Britain crowded from stem to stern. Sailing serenely down the centre a large hospital ship painted pure white all over except for the large red crosses.\n\n9am. We leave on \"Osmania\" at 11 oclock. All hands getting loaded up with rations etc. The men carrying firewood as there is said to be none over there. Two ASC men at this late hour – blind eye!!\n\n4\/9\/15 Sailed from Lemnos at 6.30pm on \"Osmanieh\" for Gallipoli. The waiting about from 11am was most trying. Embarkation well carried out and usual submarine guards oc mounted. Passed out through the shipping The \"Aquitania\" a very fine vessel towering over all the neighbouring ships. Passed two of our own submarines. The Osmanieh about 10000 tons & very finely built – speedy. A fresh sea & cold wind. Came into search light area and soon after (steaming along with all lights out) we could hear the rattle of musketry and roar of big guns. Several star shells exploding illuminated all the rises. Lighters emerged out of darkness and troops slowly and quietly filed on to them all in the dark. They had to be packed like sheep but like good lads did their work quietly towed ashore by tugs to small pier. The coast rises abruptly in scrub covered sand hills, all\n\n4\/9\/15 burrowed with dugouts and with rough huts running down to waters edge. We were under fire nearly all the journey but most of the bullets were high although an occasional one whizzing past the ears made everyone duck. Guides met us at wharf and conducted us along beach & up gullies to a position behind the trenches. A terrible journey with the packs & on reaching the destination all just sank down and slept. The rattle of rifle fire going all the time and every few minutes a big boom and subsequent explosion as they shelled the other trenches. The illuminating shells very pretty and lighting up the whole position. The whole country most difficult & after the first precipitous sand & scrub rise the country goes back in very rough hills like those about Frankston.\n","10":"\n\nAll night the firing continuous but at the hour before daybreak the fusillade was enormous. All the artillery & available rifles were brought to bear and the noise was indescribable. At present breakfast time hostilities seem adjourned until after the meal and all is peaceful. The men are lying in terraces right up the hillside.\n\n5\/9\/15 Looking round – We are in a defile at the mouth of which is open sea, at the other end is a steep bluff. On either side cliffs rise abruptly all sand with clumps of low stunted brushwood about 2 feet high. The whole place has been cut into terraces on which we have stored our men. They are all on one side – that nearest the enemy. 10am. Went through the trenches opposite Quinns post for the first time. Entrance overlooks the Agean Sea with sea, land at feet for miles round. Shrapnel bursting on hills occupied by Kitchener’s army. At feet a camp of Territorials. On right the whole line of trenches of Anzac. Went in with Field Artillery Officer. Bullets whizzing about and had to be careful. Saw the whole position through telescope impossible to describe but simply one mass of earthworks, and incessant crack and burst of shrapnel, cordite & bombs. Stench of dead very bad. Men & officers killed over a week ago still there and gradually undergoing disintegration\n\n5\/9\/15 Put Pioneers on to dig latrines but unfortunately at about 3 feet they dug up some English tommies corpses & trying again found a patch of others. Eventually found a clear space. The batteries have opened fire over our heads and the shells can be heard \"whizz\" over head. We anticipate a reply soon & will have a lively time. Capt Curnow dropped in, went round back of Courtneys Post & Steels lookout with him and were fired on by Turkish snipers. Went to his dugout and had a drink. Returned to Camp, sharing large dugout with Major Smith. \n\n(Egypt – Mafish foulous – finish money\n\nYou go a Dardernell Mist Captain\n\n\"Get it Moyor\" – 3 a 3 – Shy tea, Leben milk. Baksheesh tip)\n\nRound trenches again. Down to beach for a swim after dark. Sniper dead lying between two high pinnacles of rock. Not much firing going. Bed 11pm. Cannonade started mounting for sea & big guns & machine guns on land\n","11":" Up at five. We go to relief of 6th & 8th Battns at 9 o’c. Their trenches are said to be very large and well fortified. All up early & hard at work. Seaplane reconnoitring – puffs of hostile shells all round. \"Beachy Bill\" a big gun concealed in olive groves giving our beach a warm time – the shells whizzing overhead now, quite visible on their flight and these have burst on a rise just the other side of the gully. The men getting kit ready for their move into firing line and cleaning up. They had erected little tents with their blankets and rifles. Some of them were sleeping among dreadful stench as under their beds were dead Turks in fairly large numbers. Fell in at 8.30 and at 9 moved up to trenches. The long line in file extended right up gully to top. Put 500 into firing line to relieve others and stowed 500 others in dugouts on the side of Brauns hill. The trenches entered from the rear. Went up with Hedge and took over from Hays of 6th. A lovely morning and from the Office dugout the Aegean sea lies blue in the sun\n\n6\/9\/15 In the distance Imros stands out – in the foreground scattered vessel warships & store ships lying at anchor. Looking down – a large gully sandy, steep on both sides with scattered scrub something like Faithfulls creek basin without the creek. 2pm. Went through trenches with Guilfoyle, took long periscope. Looking through periscope there was nothing in sight but a confused mass of earth & sandbags about 250 yards in front – Turkish trenches running parallel to our line right along. Absolutely no one in sight and yet beneath the parapet they are in their thousands. Our trenches a network of deep trenches as confused as the catacombs of Rome surely. The support trenches have recesses cut in them for sleeping purposes where men rest. The fire trench is full of observers & others specially armed and always on the alert. \n\nEnemies shrapnel bursting towards Rest Gully from the gun Beachy Bill. When it opened fire we were passing a big group resting on open spot. One to others \"Hullo boys if you want to live come back here or old Beachy will have a say\" A few good shells bursting about\n\n6\/9\/15 our old ground in rear & we could see them over Shouba Bay as well. Battery (mountain) of artillery working – (no telephone) passing orders by word of mouth. Old Indian NCO standing & repeating orders hand up to side of face. Eye blown out bullet entered sideways. Refused to be relieved. \"I can’t see but I can still repeat orders\". High explosive – men some distance away killed. Legs flattened absolutely against side of trench – all by concussion only. Bed. Roused midnight by heavy fusillade & big guns.\n","12":" 4.20 Stand to. All alert & on post. Stink very bad. Too many corpses uncovered. Went back to mat until 7.30. Round trenches with Major Smith – all cheerful. No casualties among ours but a few of the old hands wiped out and our men standing alongside drenched in blood. Corpses a fortnight old lying midway between trenches, all in full equipment. Men buried in the saps also and alterations in trenches bringing them to light. The men doing their own cooking in dug outs and sleeping all over the place. Snipers at work all the time. The tunnels a special feature running from section to section, pitch dark & cellar smelling. Many queries from men \"What the hell is the good of sitting here. Why can’t we charge & blow the bastards out? Reply from old hands. Yer b – ds put yer b – head over parapet & get a little sudden death. You wouldn’t get 5 b- yards\n\n7\/9\/15 Ian Hamilton’s despatch before first landing headed \"Soldiers of France & of the King!\" Attack ordered \"on a position vaunted by the enemy as impregnable\" \n\nGreat expression here is \"dinkum oil\". People in trenches wanting to ascertain facts send down to Battn H.Q. and ask \"Is there any \"dinkum oil\" today?\" A good many shells alround but not much damage. \n\nI slept all day. Bed 9.30.\n\n8\/9\/15\n Up 4am. Cold. 6th moving out Back to bed at 5 and slept till 8. Lovely day, sunny and perfect view from rear of trenches over the sea. The fleet there lying peacefully at anchor. Some shrapnel bursting pretty close. A fairly quiet day. 6th moved out and I took over administration here. Very busy with orders. Bde HQ arrived & commenced to organise. General Walker in & Col. Forsyth later. Made arrangements to sandbag up corpses before wet weather starts washaways. Several boots sticking out of side of hill, attached to dead mens feet. Our chaps take boots off & wear them themselves if they are a good pair. Unfortunately in pulling them off they often get the foot too! Arranged to tuck all these in & sandbag them up. Bed ","13":"\n 2100 – not in trenches today. Plenty of bullets passing over\n","14":" Very Cold at the stand to arms. Coy reports slow in coming in as orderlies lost their way in the dark. A lovely morning. Looking over the sea from near the mess \"dug out\" the scene was something to remember. Not a ripple on the sea and all the fleet lying placidly at anchor except for a monitor spitting an occasional shell towards Abdul the Damned. Through the cliffs a glimpse of the flat stretch leading to the hills beyond Shoubra just like a glimpse of Australian scenery small puffs of white bursting miles away. Shoubra Bay full of shipping. Aeroplane overhead. Bursting shells round it left delicious creamy white little clouds which seemed in no hurry to dissolve but slowly melted away. Quiet afternoon and early evenings. Great many of all corps. on fatigue \n\n9pm Ruse. flares tins & moving sandbags bayonets etc followed by furious cannonade on both sides of m. guns rifles & bombs Abdul had his flares up in 30 sec. Stood next to Capt Abbott in firing line and hail of lead tore overhead zipping into sandbags and flame & bullets streaming back from us hellish din. Returning got lost on hillside wandering about under fire for ½ hour but bed 2230\n","15":" Good sleep after stand to arms. A fine cool typical Australian day; plenty to do and lot of messing up from Bde. who are \"on their ear\". Peppered with high explosive during afternoon and although N. De B. buried under ruins of his dug out no one badly injured beyond a couple of flesh wounds We have some \"points d’appui\" a technical term too tough for the \"warbs\" who call them the \"points der putty\". \n\nShell hit clip of cartridges in pouches and exploded them but no harm done. During afternoon rally when shower of high explosive was going two Abduls poked their heads up to observe effect. Quite comical the way they threw their arms up when our bullets went through them. Being in such close contact with the men breeds a sort of friendly familiarity particularly as saluting & ceremonial are all dropped. Will have to watch or they will be calling their officers by Christian names. Issued lime juice ration 1\/10 of a gill to each man. An orderly (old chap) from \"C\" Co sitting outside. Gave him balance of rum ration left over from last time – a good stiff tot. He greatly delighted. \"Ere’s luck to yer, Sir & to Orsetralie\". The same gentleman had the nosecap blown off his rifle today but escaped himself unhurt. His lucky day!!\n","16":" Cold as - , & pitch dark at \"Stand to arms\". Signallers woke us too early so had to freeze about for half an hour. Lovely fresh morning. Sea flecked with white caps. Took telescope & searched whole position could see sailors at work on men ‘o war distinctly. Abdul very jumpy during the night and pumping lead in wholesale. Saw men off duty indulging in latest sport. Take off shirts and search for \"scotch greys\", all are infested with colonies of lice. Being lousy a quaint & novel feeling at first but after a while one would not be happy without a few about. \n\nMere fleas no one troubles about. Burial party went out from next unit last night under fire, collecting corpses We had an advanced post reached by long underground tunnels to about half way between ours & enemy trenches. Cut upwards for air and light are sort of manholes opening above ground. Burial party did not know what these were and looking round for likely holes dropped a dead man in each!! The garrison in this post nearly overcome with stench but stuck to it. Went up to arrange their removal (impossible until night); poor devils lying head first and all ways down these holes. One about 30, bald, dark no features left. The others young but quite unrecognisable. Ordered pioneers to collect them in blankets and bury them in rear. Colonel Onslow Thompson’s grave with its cross actually in the trenches like many more\n\n11\/10\/15 At sunset all the artillery start work shells flying all around \nalround\n crashing and whizzing and the boom of big guns is heard both on sea & on land. Bed early. Pioneers came up in a body and said they thought after the \"dreadful job they had just done\" (burying and handling stray limbs & corpses all decaying) they should get a \"little stimulant\". Told them to go to h - . as they would have to get used to that kind of work, but later relented and sent down an extra ration of rum for them. A quiet night.\n\n12\/10\/15\n Sunday up & stood to arms 4.30 – 5. very cold; very busy with returns and correspondence till 1830 and then back to bed and slept till 2030. Shaved, and breakfast on \"porridge made of ground biscuits\" and a little steak bought from a sailor who stole it from the ships larder. Mitchell an excellent batman who can forage round beach and picks up everything that is going & asks no questions. A pillow materialised yesterday, and when asked he said \"Oh someone mislaid it sir\". \n\nSpent morning in trenches inspecting sat up on step and yarned with men who like the life, and stayed about half an hour cracking jokes etc. All very merry with bullets flying rounds – there are some \"wags\" about. Some of their letters to home very amusing – notice them when censoring One man described terrific battle (nonexistent) how battalion charged and Turks fled his mates on either side dropped, one shot through kidneys\n","17":" but the other \"absolutely blown to pieces by shrapnel, but by God’s grace I was spared and charged ahead, killing five Turks, until we cleared them all out.\" This fellow had never been within half a mile of a Turk. Another writing to his sister. \"I reckon one of us boys is equal to any three of these black cows in a dinkum fight.\" All very pleased with their food and remark how different it is to what they expected. At the present moment, 1420, not a sound of shooting is to be heard we might be miles away from war or anything else. Yet only four hundred yards away the other army is lying quiet also, both on the watch & ready to leap out at each other but not daring to on account of the inferno that would break loose before one man had traversed 10 yards. Sitting down in fire trench, men cleaning their rifles, sleeping eating & so on and only to poke his head up a few inches over the top sandbag means sudden death. Shots on both sides very good – constant practice. Our chaps & the Turks can put a bullet through a small loophole every time Great expression \"possy\" means position. A man got a comfortable place to sleep announces – \"gotter good possy\"\n","18":"\n The usual routine. Men in supports performing toilet one shaving, another washing with damp rag – no water. Others hunting lice and \"scots greys\". Several using fire sticks to burn them out of the seams. – some of these chaps \"knuts off the Block\". Pioneers completed dugout for me. Peppering bullets round them all the time. Spent evening in firing line. All fairly quiet. A few wounded and one chap killed Just breathing when the stretcher passed me.\n","19":"\n Very cold at stand to – in fact so chilly today that bare legs and shorts will have to go I think in favour of breeches once more Bad cold and slept in until 8.30 after the stand to was over. Today quite wintry after the tropical weather we have been having since leaving Australia. Very slack today as regards fighting. Colonel Bennett leaves tonight his greeting \"Good morning, nice day for the war\". Heavy bombardment during morning by artillery all rifle fire ceased while ourselves and Abdul the Damned sought our dugouts. The trenches all clear except for the observers with their periscopes waiting to sound the alarm if necessary. One man killed and one with his arm blown off. Two others injured. Went up to secret observation post with telescope and had a good look at the chess board and could see them hard at work. Quinns post a marvellous affair, well wirenetted overhead. Round all the other trenches, no one in sight. After breakfast nothing doing so sat down in dugout reading Bulletin. Not a shot to\n\n14\/9\/15 be heard anywhere and one needs constantly to remind oneself that he is at the \"front\" in the trenches, and only a very few yards from the enemy. Flies very troublesome and spreading disease as they come from ghastly banquets out in front where the unburied lie and then crawl over the food. Commenced censoring a proportion of the letters and dislike the job of reading a man’s private thoughts to his people at home etc, but soon become quite mechanical at the work. All comment on the quietness and comparative safety so different to their expectations and on the excellent food they get. Letters to their Mothers even from the roughest and hardest cases full of solicitude; - and, \"don’t worry about me,\" the burden of not a few. Others to friends and pals. Very amusing. Truth not allowed to stand in the way of making an interesting letter and one full of terrible adventures. All speak of the absence of washing and the novelty of being \"chatty\" and the stupendous task carried out by the First Division in their wonderful landing and attack. The Turk is always referred to as the \"Joe Bourke\" or Abdul. Heard full account of Bert Biggsleys death. He was the bravest of the brave and loved by his men. His batman came down the hill crying like a baby and told Col. Bennett. The same man makes a daily visit to the grave and lavishs his spare time making it look decent with white stones. It seems a 75 caught Bert after plunging through a \n\n14\/9\/15 solid traverse in a place regarded as perfectly safe and killed him and a small group instantly. A mail from Australia due today at Brigade HQ of Brigadier –General N. M. Smith V. C. our newcomer. (Remember Garden St. & Kenna when Posey came along (\"!\" Suvla Bay well boomed across and full of warships, sweeps, trawlers and a lot of small craft. Round the beach a white camp of AMC easily discernable through the telescope. Across miles away on the hillside the Terriers trenches confronted with Abduls just as ours are here. An occasional white fleece ball of cloud denoting a shell burst. Monitors lying off firing occasionally. A few the names about. – Legge Valley, Monash Gully, Bridges Road, Shrapnel Valley, Hell’s Spit, McLaurin Ridge Dead mans Gully, Sniper’s post, Steells post, Courtenay’s post, lone pine, Tambour Crater, Quinns post, Brighton beach, Wire Gully, Browns dip Gun lane, Artillery Rd. Remarkable how soon the action of artillery commences after aeroplane reconnaissance. All ranks instructed to look down and not to turn the face up when one is passing overhead. Bed early and slept off bad cold\n","20":" Up at 0415 raining and very wet Clay mud in all trenches – this place is going to be awful in winter and the old dugout catches full force of every gale off the sea. One man killed in \"D\" Co\n\n15\/9\/15 while fixing a sandbag. One bullet probably a ricochet took half his face off. Buried about an hour afterwards. Abdul very jumpy last night and pouring lead into us and generally jerking ironmongery into the landscape. Tried funny business during morning waving flag and so on to which we replied in kind. Lower down one \"Jim Bourke\" put his head right up and made some funny remarks to which one of our lads responded. Some tried a shot at him to which he responded by signall ing a \"washout\" by waving his shovel from side to side. Taube aeroplane over head this afternoon which dropped a lovely bomb on Walkers ridge and left quite a big gap in the hillside. Artillery firing at it but she escaped unhurt. The bursting shells with beautiful filmy white cloud in bright sun to be seen alround her. Remarkable how the result of her observations are communicated so soon to enemy artillery. Mail arrived this evening. Daring bomb thrower in 23rd doing great work but to get in good shots raised head & shoulders above pit. Abdul laid in wait for him with machine gun and the stream of bullets cut the top off his head like the top of an eggshell. The more one sees of this place the greater seems the deeds the Australians have done in these parts. Beachy Bill & Rickety Kate busy today. Censoring letters by slush lamp until 1930 and so to bed.\n","21":"\n Another quiet day. All batmen standing to arms headed by Jery Bernan the cook and young Steve Murphy – a motley crew indeed. During the day nothing doing but discovered this morning that Abdul has withdrawn his firing line about 50 yards in one spot and lower down what looks like a flag but really an artillery mark is hanging over his parapet. Sniping nearly nonexistent and for hours not more than a score of shots fired. Don’t know what the game is but it looks almost as if his trenches are practically deserted. Sniper below Crater active and bombed out. \n\nRoused stretcher bearers up – instance how callous one gets after a little of this. Man of 24th got a bullet through head. Stretcher bearers picked him up ran him down to Pioneer Sergt. And said \"here’s a job for you\" and then cleared off. Pioneer promptly buried him without any doctor having seen him!! Point arises was he dead? A case two days ago man with brain protruding from similar wound lived 24 hours. Made full inquiries and from all accounts this man must have been dead as he was plugged right through the skull and his brains pretty well scooped out. Room for doubt all the same. Paraded the stretcher bearers and roused hell into them told them they had buried man alive and so on. Also roused Pioneer Sgt. and scared the whole crowd of them. Callousness comes in here – the man dropped when hit, stretcher bearer walks along turns him over and said, \"Oh he’s dead it’s a job for the Pioneers to shift\" and left him there for 12 minutes before being ordered by an officer to shift him. Then picked the corpse up and shoved it into a grave without doctor viewing it. And these men only a few weeks ago would have fainted most likely at the sight of blood & dead men! It is wonderful how this business hardens one\n\n16\/9\/15 Abdul very quiet during evening but at 10.15 by concerted action for miles along front we drew his fire. At 10.15 flares and rockets followed by rapid fire, fixed bayonets , noise etc. His flares up at once and rifle and machine gun fire poured in on us. Went up into firing line quarter of an hour before so as to be on the scene in good time. Punctual to time the ball opened. The rockets a beautiful sight illuminating the scene and making it as bright as day. Enormous things with sticks 6-7 feet long. Inferno of noise on both sides, bombs etc. The machine gun & rifles pouring a hail of flame over our head and cracking into the sandbags. A few casualties but not serious. Achieved desired result and established at least one fact that there are very few of them immediately opposite us, but the trenches are probably mined and enfiladed and no good result would be served by our occupying them. Bed 10.20 and slept very well.\n","22":" Up Bitterly cold. The winter campaign here is going to be deadly severe on us. Cold in head. Climate in Egypt suited me – always in top form there. Round trenches and yarning nearly all the morning and examined the position alround per periscope , trenches near Lone Pine seemed deserted – most striking feature was the utter absence of anyone to the view. Chessboard most prominent feature one mass of criss cross trenches just like its name. Abdul opened with 3 new guns and put shells closer to us than ever previously. We got several fragments. Mess dugout completed. Doctor Drummond Stewart MacLennan Sup C.O. \n\nNote\n. Turkish latrines on Osmaniele\n","23":" Artillery started at \nstand to\n an early hour and seemed to aim at \"A\" Co. A big shell case charged with gunpowder with a detonator was discharged into the section from a mortar but did no harm. Jack looked in and had a yarn. He is Corpl of a Garland machine.\n\n10.45. Derrick & Buckley blown right out of their dugout by a .75. Derrick badly hurt and will be away some time. Hughie cut about head and also went to hospital. \nLater\n It seems the shell was 8.7 and ripped through 3 feet of clay and 5 inches of hard planking before blowing them all head first out of the dugout. Sorry for them both and wish for a speedy recovery. Posted Curnow to the Coy. as temporarily in command, and told C.O. a Lieut. could run \noffice\n this job if any more are blown out as I like the men so well. A lovely day beautiful warm sunshine just a good Australian spring day down on a busy rifle range with people shooting and bullets zip zip all the time. We are quite used to it now but at first could not distinguish between the impact of the bullet and the discharge of the rifle. The high velocity bullet landing makes a sound just like a rifle does when discharged only a little bit muffled. Bombs are going off alround they make a good boom. The hospital ships at night are a pretty sight they lie just off the land with every light going and electric signs out La Rouge Croix All warships keep away and they with their cargo of pain remain there undisturbed.\n\n18\/9\/15\n At 1452. Abdul woke up and played hell. Artillery commenced and got heavier until shells bursting everywhere. Over towards Suvla Bay see the shrapnel bursting in clouds everywhere. Immediately it stopped thousands of rifles broke out and machine guns spitting bullets in thousands. Bayonets shown above Turks trenches and all the bustle and noise incidental to an attack. We replied with steady fire picking objects and their fire as suddenly ceased and things resumed their ordinary course Two aeroplanes up. Clods of earth shrapnel splinters and bullets falling all round. Talking to Hogarth and one hit him but bullet was stopped by pocket books. Picked some bullets up – all red hot soon dropped them. Few casualties. One man’s eye blown out. All quiet now except for an odd shell. Bde. Major rang up but could not hear a sound on account of the roar of guns, until the signallers swathed the receivers and my head in blankets. 2 dead 6 wounded. \n\nBuried the dead in one grave – all inside an hour. Life & death are very close here. The wounded are badly injured, if Derrick recovers he will always limp and some of the others have lost hands etc. Resembles what happened at Suvla Bay and what Col. Bennett said they were like in the firing line. What the Royal Marine Light Infantry did to their own C.O. Two days before shifted\n\n18\/9\/15 Slush lamps in vogue now – a tobacco tin full of fat and a wick of flannel or rope – stink awfully. A lovely moonlight night all hoping Abdul will come out. Revolver on and ten good cartridges in Lee Enfield rifle; rusty but sharp bayonet fixed – dirty enough to set up blood poisoning in any wound it makes. Two papers tonight from Eveline & home. Artillery say they put shell after shell into Turks trenches tonight bursting after entrance. German officers trench heavily garrisoned. From secret observation post at 2000 yds could see Turbaned Turk & mules passing also others moving to & fro in groups. All day & night working at subterranean passages and shafts in bowels of hill. Amusing to watch the hot fire they were plugging into my dugout this afternoon during the demonstration – evidently they regard it as a very special spot. The sniper will get me if he perseveres long enough. Abbott’s wonderful dash from beach knocked him out had to make him rest and tear a few rums into him. Saw base of shell that knocked Derrick out 8\" in diameter – an awful thing fired by \"Asiatic Annie\" right over in Asia Minor at us in Europe. A quiet night, yarning and so to bed\n","24":" morning.Parsons unable to get congregations, all on duty but RC’s turned out somehow. Went up trenches with Stewart lovely sunny but cool morning only an occasional shot or shell. Went into secret observation post – very cunningly placed overlooking German Officers position of enemy. This post quite concealed from their view but a good telescope mounted there. They are only about 200 yards away. Seem to be short of sandbags as they use black kitbags full of earth and blankets sewn up at the corners. Entanglements & overhead cover together with the nature of the ground make their position impregnable. All the way up and over the hill are layers of earthworks. Work going on at top could see shovels going and two Turks in turbans and robes engaged tramping the earth down as it was thrown up. Too far to bother having a shot at them. Walked along and inspected the crater with periscope. They are close enough there but nothing would be gained by our getting to them – bombs do our work. \n\nYarning to Thomsen and some of the men. They said in one post they could not get enough cover as a piece of earth was projecting. Ordered it to be taken away. The sea very tranquil – looking down into the depths shrapnel valley the men look like ants moving about and the extreme neatness of the whole place from here to the beach show what organization does. All rubbish is burned in incinerators. If as many thousands of ordinary civilians were camped here one shudders to think the condition the place would be in now with tins and papers to say nothing of sanitary arrangements. Memo. descend to shafts by ropes.\n\n19\/9\/15 Incident last night’s dust up. One man horribly wounded running up and down firing line. Sergt. \"Why the - - don’t yer get down to the hospital\". Wounded man \"They are going to charge, man\". The idea of being at the hospital while fun going on was too unthinkable Murphy, C.O. batman , tearing up the firing line with rifle and bayonet. Stopped by Davis. What are you doing here? Murphy \"I’ve come up for me shots Sir\". Badly injured carried off on stretchers, cursing awfully – not with pain but with rage at being outed before getting blood on their bayonets. The language of the army is awful. The Territorials’ is most filthy as their national swear is much more disgusting than ours. At the same time the expression some of them put into their swearing is delightful. Two from bush smoking & a big silence then. \n\nOne\n The Southland had er narrer escape with the torpeder? (Pause puf puff puff.) Then.\n\n\"There’s some b— good men in the 21st Batt.!\n\nTother\n \"My b— oath there are!\" (puff puff puff)\n\nOne\n Old Jim Brown is a --- good man (puff puff puff)\n\nTother\n \"My — oath he is.\" (puff puff puff)\n\nThen silence\n\nIn Heliopolis shortly after our arrival there a good Australian & a Terrier comparing notes\n\nAust\n \"We get 6 --- bob a day\"!\n\nTerrit.\n \"Aw we awnly get one and --- tuppence!\n\nAust. (slowly in surprise) You poor --- ---d.!! \n\n19\/9\/15\n At 3 pm went down to beach with Major Smith for a swim Got down with safety passed the two burial grounds. Some graves very well kept and neat. Large hole dug one corpse there but waiting for some more before filling in First time had clothes off for 3 weeks., filthy dirty – feel awful. Never enjoyed a wash better – got thoroughly clean. Cut short by Beachy Bill putting three shells within 20 yards of us so got out in hurry. In among the Indians – theirs a smart business-like uniform and all alert lithe little chaps with their mules. Up the gully and quite a number of shells bursting behind us but no one hurt. Bed early. A pleasant Sunday. Noticed the same old dead Turkish sniper caught between the two enormous pinnacles of cliff. Another shot sitting down. Been there a month. Sent man out to bury him, knew it was an awful job. Said \"How’d you get on, he replies \"Alright only the \"gravy\" ran all over me!\" When bombardment opened the other night a new chum bowled in with his eyes staring out of his head with fright and looking like a scared sparrow in a storm. Said \"What are you doing here\". He. \" --- if I know!\"\n","25":"\n Stand to 04.15 am, as cold as can be. The closest shave I want for a while too. Just rose from blanket and bullet hit within two inches of my head. Monitor putting some into the Suvla Bay position. Bang – pause – plonk. HMS Ulysses Barber Ireland Turner Macleod Benjamin. Old up for drunk at Heliopolis after signing the pledge in a previous case.\n\n20\/9\/15 His statement to the Court. \"An I wuz walking along & I felt the cold heavy on me an I passed a pub and I looks and I sez \"No, Jack old boy, yer promised the Colonel.\" And then I sez to myself. \"Jack, old boy, I sez, a little tot er rum won’t do you no harm\" & that is how it happened Sir.\" This morning cleaned teeth shaved and washed in a pint of water. A Nazir cry \"Come on Australia!, very good very nice\" A peculiar bomb affair in Lone Pine. A man (bomber) (evidently a new man) lit a bomb and having done so seems to have become mesmerised with the deadly thing he had in his hand, and remained staring at it mesmerised, not able to throw it. It burst and blew him to pieces killed two others and wounded some more. Up into the fire trench and sat on fire trench step yarning to the \"heads\" – how they love a yarn with an officer and how they curse in their conversation!! All merry and bright, had a good quiz at their little sector where every piece of grass and sand is known to them. Bullet planked into sandbag & only had 3 inches more to get me in the \ntrench\n chest. A miss as good as a mile. Put a bomb into a place only 30 yards away where snipers said to lurk and got bomb machine laid ready to put one into them during the evening. Sgt. C. cleared out of A’dria & came across in gunboat. Put him under arrest. Also T Gorman \"A\" Co neglect of sentry duty\n\nCopy of notice in firing line\n\nPalais de Shrapnel Gallipoli\n\nAccommodation for 6 bob a day tourists. Ground floor\n\nMeals at all hours\n\nApartment a louer\n\nNewly married couples must have luggage.\n\nVisitors are requested to keep off the parapet – offenders will be shot.\n\nVisitors must not use the drinking water for washing purposes\n\nGentlemen wishing to change their hose are requested to do so at night & as near the enemys trenches as possible\n\nFleas, flies, & lice are to be had gratis. No extra charge if served up in the tea. Turkish delight dealt out daily \n\nNew arrivals can get instruction free (at the rear) in use of firearms etc. No licence needed. The management will not be responsible for barbed wire etc removed from the plateau.\n\nVisitors requiring lights will find the feathers in the beds quite light enough for anything\n\nNo credit will be given to \"stiff\" Turks\n\nBullets, bombs, grenades, shells and shrapnel will be exchanged here day and night until further notice. Open Sundays and all holidays.\n\nThis is no comic opera show\n\nD.C.M.’s dished out daily Positions vacant on our Staff for Lady snipers\n\nMENU\n\nBiscuits a la Canine\n\nBeef de Bully\n\nRation a la Macomachi\n\nBunghole a la carte\n\nDuck le bullets \n\nFoul a la Turke\n\nSmell a la Turke et Howitzer Sauce\n\nTurk Salad and Mauser Cream\n\n20\/9\/15 Before we left the boat for Anzac, every man was told put a few sticks under the straps of his pack as kindling wood was scarce in the trenches. One gentleman was heard to remark \"It’s bad enough going to hell, but it’s a fair --- having to carry your own firewood!!\"\n\nAt 2146 after receiving word that digging was going on in front near a row of black sandbags all the firing line \"stood to\" – ready and eager. And to the minute we put two rounds from each rifle into them and then down. We did not get one shot from them in reply which seemed to indicate unreadiness on their part and we probably caught a few Bed 2200.\n","26":" Letter from D.R.Adams. Jack in Connells last time he was in there inquired after the \"dark gent\" and sent his regards. Such is fame!! Artillery bombardment after breakfast, stood watching shells burst. No sign of any splinters just a filmy white cloud first and then a few seconds after a reverberating crack. Went down firing line and had a look through the secret observation station. The German officers trenches marvellous, with barbed wire and so on quite impregnable. Back to H.Q – mail in. very ill all the afternoon and had to go to bed and stay there for 24 hours\n\n21\/9\/15 This climate no good to me. Egypt for me – never in finer trim than while there and the hard training suited me. Dugouts unhealthy – cut out of clay and underground they are damp and like cellars and the damp can be seen up the walls. In winter they will be streaming with water the soakage of the hills round about; the water filtrating through graves.\n","27":" Better, but still not too good. Atkinson 23rd killed. Ellerton went mad when two men killed one on each side – quite insane now. This is no place for the highly strung man. Lone Pine a hot spot among bombs but we head the casualties here in this section owing to artillery getting to us. Only separated from Abdul by a steel plate with two loopholes in it at Pine. On Field Court Martial at Brown’s Dip all afternoon, returning with another officer got lost in the maze of trenches and came out again exactly where we started from! This in broad daylight. San Macindoe Foote still in Egypt with a sore finger. Turned in early and had a good rest – should have been most annoyed had Abdul attacked.\n","28":" Up at stand to – for an hour in future The coldest morning yet with a wind like ice. Sea very pretty, all flecked with white horses. Shrapnel whizzing very close here this morning probably guns a long distance off with consequent very steep angle of descent. Went down to niche in hill and stood there watching our shells bursting on enemies trenches at right angles to us. No bad shots every one bursting in their trenches. Watched there until \"moved on\" by their snipers bullets\n\n23\/9\/15 Bitterly cold right up on these heights looking down Braunds Hill & others lying right beneath us. The hillsides getting quite denuded of firewood. The sea very pretty to look at in the distance Imbros and the sister island towering with their high peaks out of the water. Warships signalling by flash with electric helios. Siege battery smashing Turks trenches up this morning. Dropping shells in, that send sandbags & earth up 50 feet into air. Very good shooting as they have to be careful not to hit us and the shells are landing only 100 yds in front of us – we are so close to the enemy. Piercingly cold wind and cloudy. Went up into fire trench and watched effect of siege battery’s fire – ripping their trenches to pieces. Not a Turk in sight – as one gentleman remarked \"It frightened C--- out of them\". Another declared they could be heard crying \"Allah! Allah!\" At 1900 Abdul’s artillery got to work and our warships had to push out further out of range, Suvla Bay being quite deserted At 2035 went to bed – lovely moonlight night the view from these heights being magnificent. Below the deep ravines and the tops of smaller hills only an occasional bomb & rifle shot lets one know a war is on. Turks repairing trenches\n","29":" A dreadful sleepless night driven nearly mad by vermin. One mass of flea bites from head to foot and the irritation of lice in head and at the axillae almost unbearable. Not an inch from tip to toe that is not lousy. Later – On conducting search find black & grey varieties christened Black Watch & Scots Greys. Their parade ground my chest but they bivouac in the lowlands. Sent Mitchell for a supply of verma jelly from Q.M. – A lovely day but cold still. Censoring letters – one gentleman makes rather novel proposal to his wife regarding \"carrying on\" during his absence. The hills here are all covered in one shade of green undergrowth but of 3 different varieties in main. No where do these shrubs grow higher than about 5 feet. Between Indian Camp and Suvla Hills some trees are scattered about on the plains but here there are none. The shrubs are a kind of holly, the rhododendron and \ndraw\n dwarf oak trees about 2 feet high. Wild olives are also to be seen – In the gullies they say a species of blackberry grows. Birds are scarce but robins and linnets and an occasional thrush come and sit on the trench parapet. Most animal life though shuns this place as accursed the only living things that seem to flourish being the flies and they are in their millions. At night hanging up a coat on the pegs at the top of the dugout causes a hum and stir like a beehive.\n\nVery quiet all day until about\n\n24\/9\/15 1955. We fired a rocket and waited. Presently our artillery broke loose and started to play hell. The warships made chessboard one sea of fire. Our F.A. got on to Turks in front of us and we rattled away too. Not many there. With Major Smith up above parapet level in parados – very exposed as still incomplete. Bombs coming too near to be pleasant and set sandbags on fire alround. Enemy’s artillery not idle and noise awful. 75’s tearing round and nearly buried us in dirt. Bullets raining hot about a foot above head. Too much moon for rifle flashes to be picked up through periscopes but trench mortar easily located. Weight of firing on our left. Returned HQ all quiet. Bed 2257 o’clock. Everything smothered in powder and verma jelly – hope no lice tonight\n","30":" Slept well. Bright moonlight when got up, nothing doing. Artillery got going early and plastered Chessboard. DeBoos & Crowley to Alexandria – Peart to come here. Mountainous islands look delightful over the blue sea. Last night could see distinctly from Regtl. Dugout the outline of Bulgaria. More fresh meat lately. Lovely day. Saw piece of wet equipment sticking of parapet, pulled it, brought some ribs with it. Owner buried now\n\n25\/9\/15\n Memo. Rum issue wants careful watching – great stuff to leak if not supervised. Remarkable how well all our shirkers and wasters have turned out over here. They are playing the game and settling down to real hard work splendidly. Being away from drink & other temptations has a lot to do with it I am sure. The trouble is to get them here. The wasters who are big strong men and just have outbursts of animalism are alright – the weak vaccilator who is a slave to a vice and has no \"guts\" drops out by death or disease long before he gets as far as this. At 1630 went up to \"conning tower\" – the highest point of the firing line where a little sandbagged stronghold is being built by engineers for our use for control of operations. Suggested arrangement of fixed small mirrors on different faces of the work but with the reflecting mirrors grouped side by side in front of box so that the whole panorama would be before the eye of anyone while sitting at the ‘phone. The only objection is that one .75 shell would blow all the sandbags they like to put there away and wreck the whole show while it would be constantly suffering in the daily bombardment. At 1635 the siege battery started and put lovely timed 6 inch shells into Abdul’s Lone Pine defence sending geysers of earth 50 feet into the air and leaving huge craters\n\n25\/9\/15 The shooting very good but the resultant blow back rather dangerous to us as our trenches are there only 100 yards from enemy. Several pieces of shell casing landed here in our fire trench. The Turks will have to put in some solid work tonight to repair this damage. Their artillery will probably blow us about tomorrow in retaliation. An aeroplane circling above all the time registering the shots for our artillery. A lovely view at sunset Imbros and Tenedos lying peaceful and rugged against the melting sunset. In the distance northward the southern coast of Bulgaria much more low lying. Looking through telescope at open country beyond Anafarta Bay could see the troops cautiously stealing across some exposed ground. Behind Turkish trenches in front of us the country seems quiet peaceful & cultivated A white farm house fairly close and then a white town on the side of the hills further off, beyond them the dim outlines of Asiatic mountains. General Spencer Brown takes General Smyth’s place as Brigadier\n\n25\/9\/15 on Friday next. Glad to have an Australian back although Smyth very fair. HQ says nothing can come up to our men, and mention the Territorial’s want of \"guts\" so very evident here. Vacated a trench when attacked by massed battalions 15000 strong. Ours hold on – 5000 killed and wounded by our artillery & m.g.s and then Australians leap out to meet them. No \"vacating\" for them. Insects here not very numerous. Two species of ants somewhat like bulldog variety & always at war with each other. Occasional dragon fly to be seen. Myriads of small house flys most persistent. Kept down very much by the scrupulous thoroughness of the sanitary arrangemts. The blowfly a small genus with beautiful golden belly. A gay bird for the loathsome banquet he comes from. Saw one corpse, good looking young fellow, he had been covered with these golden flys and just \nof\n a blaze of gold. Crawling in one eye and out the other! \n\nHear Luscombe is a prisoner of war at Constantinople.\n\n25\/9\/15 N.B. The Turk, who we regard as a heathen, comes into action with the name of God on his lips in a triumphal shout \"Allah! Allah!\" Our Christian soldiers go in with shocking oaths and curses. The soldier who goes in praying is one of the things you read about, but never meet. If the dying man can speak he goes out cursing the --- --- and his only regret is inability to tear his injurer to pieces. Badly wounded going to hospital curse all the time. Probably all of the cursing due to nervous excitement the tongue belching out apart from brain control. On the Moslem Sunday (Friday) sounds of their praying reach us but our soldiers’ only prayer is the remark as he caresses his bayonet edge. \"By --- I hope --- old Abdul gives us a go for it today\". Our men good clean swearers compared to English Tommies although their range of swears is far greater. English Tommy’s national swear most disgusting but it’s constant repetition delights him.\n","31":" Lovely day but stench from buried dead penetrating everywhere. Put party on to cover up any limbs &c sticking out. Aegean Sea a remarkable sight this morning not a breath of wind and the water all striated and in patches the craft lying idle and those with smoke have it going straight up in the air. The currents can be traced eddying round in a remarkable manner. A warship standing close in to shell the German officers trenches. C.O. struck a surprise packet today. Asked one man his occupation. Drapers Assistant C.O. remarked \"rather effeminate\". Man: \"I was in hosiery and always found it emphasized my masculinity! Sir\". Taube aeroplane overhead now dropping bombs. Most like a bird – but more similar to a hawk than the dove it takes its name from. Padres running round like lost sheep looking for their congregations. Men all on duty – very difficult for them to get to church even if they wanted to go. Jack just passed marching a squad down to draw bombs. Looking well, will be in this afternoon. Fatigues sweating up the slopes carrying boxes on their shoulders looking like ants clinging on the hillsides. Killing work carrying every drop of water & round of ammunition up these heights and wears the men down to the bone. Oilstoves being supplied to keep the trenches warm in winter.\n\n26\/9\/15 \nEgypt\n Remember guides at Sheapheards. \"You wanter guide Misser Captin.\" Pyramides tombs and Temple of the Spinkus Misr Captin. Very good very nice.\n\nAt night\n Seductive whisper \"You wanna guide Misr Captin\" Very good, very nice, very clean. How they used to scuttle on \"Imshi! Yalla.\" The futility of the shawish when dealing with white men in a brawl and yet the same gentleman only of the Lords anointed among the niggers. What night owls the natives are, the streets packed from 2000 until 0200 buying and selling, and crying their wares. Rogues all and not at all disconcerted when found out. Just the smile and ‘mafish’. Drove some shrewd bargains before leaving and made up for being taken down so often when new. Georgette, Josez, Gita, Dreadnought, and all Casino frequenters, ‘leafe’ Egyptien. The tune always heard at Casino. \"Old Continental\", Cherie Verst etc. the workers in the bazaars & Mousky. The incessant tap tap of the tiny hammers of the brass workers in the brass bazaar; the cloying overpowering perfumes of the Suk-el Attarin bazaar. The malicious fierce glances of the fanatics of Sami-el-Azar. The delicate yaminaks of upper classes and the looks. – The inertness and enervation of the average tarbousch– the pendulous underlip. The apathy of the old nigger broken down with years. The glorious moonlight and charm that seemed to spread over the country after sunset transforming the place from a sunscorched awful place to a scene of romance and awe\n\n26\/9\/15 The day continues glorious. Imbros and Samothrace look abodes of the blest their highest points shrouded in white fleecy clouds. The men ask leave in fire trench in evenings to go down to little parade ground and see the wonderful sunsets. Occasional bombing and sniping. They will probably give us a go tonight. Hope things are pretty warm and we all into clinches. Our men quite ready for them any minute. Aeroplanes circling about. Taubes have eagles painted on the wings. Flight Commander Sampson our man. Periscope rifles very accurate and used without slightest danger by snipers. Rifle grenades very handy for applying \"move on\". Trying to arrange for our sick returning to bring some tinned milk and other things to vary monotony of bully and biscuits. (N.B. Cond. M. label) Jack called in and spent afternoon, has been doing some good work with the bomb machine – one blew a Turk right out of the trench up on to the parapet, not known how many they bagged in the trench. Abdul believes in taking extreme measures to get a definite result. One bomber very daring, promoted to Corporal for his work. Abdul waited two days and then at night secretly shifted machine gun directly opposite. They had to roll him onto the stretcher when taking him for burial\n\n26\/9\/15 In evening siege battery blew Abdul’s trenches about. Down at Hellas a big action seems to be in progress – the distant roll of heavy ordnance sounds like angry thunder. A quiet evening here only relieved by a little outburst at 9 pm. Our bombers picked a little redoubt and dropped a good bomb right inside – dead silence. Fired another and the worm turned. Blazed away at us with machine guns and rifle fire. Bombers well under cover with their little piece of drain pipe and gunpowder charges keep quietly plonking more in until a silence descended on the scene so loud that it could almost be heard. Bed 2155\n","32":"\n Stand to 0435. hospital ships a mass of lights lying side by side. Rifle fire fairly heavy. Rumble of artillery at Cape Hellas continuous all night. The monitors here dealing out heavy shells which land on Turks trenches with resounding \"plonk\". Back to bed at 0535 till 0800. Very nice to lie in dugout and hear the warships lamming it in. Bombs & m. gun and heavier musketry than usual make up the peaceful country life we wake up to here! Snipers on Chessboard slapping into top of sandbags near my door crack, crack, all the time.\n\n0700. Turkish (German) artillery commenced to bombard us and kept it up with 1.75m shells for two hours. Firing at the rate of 2 shots a minute so fully 200 shells landed hereabouts – pretty warm. Mostly bursting on rear of hill quite unoccupied\n\n27\/9\/15 as if their information is faulty. Quite satisfied that most of their shells did very little if any damage, and if they killed & wounded a dozen or so it is very small game for the cost of ammunition.\n\nLater. They tried very persistently to knock out the guns on the next rise to us but cannot succeed. The big gun doing this is about 5 miles away and we see the shells going through the air with their \"whiz\" if you are lucky enough to get sight at the right moment. No uniform in the trenches, the dress very nondescript in character. We were inclined to resent leaving our helmets behind but the Australian felt hat is the best for over here besides giving us the distinctive Australian look, which our men cultivate not wanting to be confused with Kitchener’s weaklings. Caps worn a good deal. The wire pulled out of the crown which causes the cap to collapse into a soft shapeless mass which is comfortable and does not reflect the light. Tunics with web equipment always on. Shorts bare legs, perhaps socks and a pair of boots. In hot weather the dress from waist up naked, pair short khaki trunks pair boots cap. Most have beards and unwashed look like toughs from Collingwood. Everyone full of jokes and fun. Diarrhoea one of our chief troubles caused by the hard tinned food and the flies. Chronic with most men & weakening. Everyone wears mosquito net round the hat, dyed by soaking it in tea for invisibility\n\nAeroplanes above reconnoitring. Very noisy\n\n27\/9\/15 Sunsets viewed from this height are wonderful. Last night most magnificent violet shades. The sun going down behind the peaks of Imbros & Samothrace. Stood with Doctor watching for half an hour The shades changing each second.\n\nAfternoon normal sniping and enemies replies. He has established a new sniper post which unfortunately commands this spot. Very hot fire about lunch from there. Cooks stirred up round the fire and some too close to be comfortable. A pitch dark night but the bombardment of Suvla position remarkable sight. The whole range lit up by the bursting shells and the crash of the discharge Flash of big guns like a sheet of flame leaping out into the darkness and the bursting of the shell cast a glare up into the sky. Heavy rumble from down south at Cape Hellas. The guns have been roaring without ceasing for 48 hours now. The enemy very active in front and the rifle fire heavy. The men cursing because all the fun is on our flanks Bed 2056\n","33":" Crowley & De B left at 0435. Pitch dark standing to. Abdul hard at work all night repairing his damaged trenches but our fire kept them hindered. They seem to have a sort of platform going up probably for gas attack but our bombers hunted them out. This morning the dawn disclosed entanglements they had place in position probably ready made and then carried out in front afterwards and set up.\n\n0925. Enemy’s bombardment recommenced they have already put in 109 shells (1020 o’c), ours are replying with interest tearing the side out of the hill. Rifles quiet. Beach parties buildings piers and landing places. \"Beachy Bill\" picks off a few every day. Sunk an Egyptian ketch of iron & timber close in – shallow water. A few masts sticking up hereabouts marking different craft which have foundered. The \"Majestic\" was submarined just a few hundred yards out. The men in the trenches could see the periscope. She just turned over and is only just submerged. 1030. A \"football\" bounced on roof on this dugout and burst about 20 feet away air full of splinters and fumes. Large iron shell about size of football\n\n28\/9\/15 full of explosives. Taube just dropped bomb on dressing station but no casualties. The careless way they are throwing shells and things about today is scandalous. Abdul will be hurting someone if he isn’t careful. Pte Crozier did a pencil sketch of me. He says his technique is getting alright again but he has just missed the expression in his sketch. Will get him to do Jack tomorrow. Quieter now. RSM carrying on as ORS in addition to his other work. Overhauling all H.Q. and determined to give everyone enough to do \nthe\n to send them tired to bed every night. Not going to have any N.C.O.s or officers loafing about while I am Adjt. Roused everyone up today and have everything now going in stiff, precise, methodical manner like a machine. Rather different to the laxness \nwhen\n before taking over. Some sickness owing to cold weather. 4 pneumonias one chap 3rd time since enlisting predisposition always greater after\n\n28\/9\/15 after having it once. Have tied grappling irons on to rocket and are going to fire it to see how far it will carry the irons. After the experiment we will fire it over at Abdul and then all hands on to the rope to pull his entanglements in with the grappling irons. What a joke if it goes over their trench and they catch hold of the end and pull too. A tug of (real) war!\n\nThe rocket experiment a failure, went the wrong way owing to the weights being unevenly balanced and landed down in the ravine. It seems a job for a daring man and a dark night – fixing it on the entanglements. Aeroplanes up while Turks artillery firing, seemed to signal result of shots by a gun carried in the ‘plane. Probably machine gun. One of ours last night came very low over them about 0000 and they let go a furious fusillade of rifle fire.\n\n"}}