{"Document Name":{"0":"Diary_0488","1":"Diary_0488","2":"Diary_0488","3":"Diary_0488","4":"Diary_0488","5":"Diary_0488","6":"Diary_0488","7":"Diary_0488","8":"Diary_0488","9":"Diary_0488","10":"Diary_0488","11":"Diary_0488","12":"Diary_0488","13":"Diary_0488","14":"Diary_0488","15":"Diary_0488","16":"Diary_0488","17":"Diary_0488","18":"Diary_0488","19":"Diary_0488","20":"Diary_0488","21":"Diary_0488","22":"Diary_0488","23":"Diary_0488","24":"Diary_0488","25":"Diary_0488","26":"Diary_0488","27":"Diary_0488","28":"Diary_0488","29":"Diary_0488","30":"Diary_0488","31":"Diary_0488"},"Date":{"0":"unknown","1":1220.0,"2":1221.0,"3":1222.0,"4":1223.0,"5":1224.0,"6":1225.0,"7":1226.0,"8":1227.0,"9":1228.0,"10":1229.0,"11":1230.0,"12":1231.0,"13":1232.0,"14":1233.0,"15":1234.0,"16":1235.0,"17":1236.0,"18":1237.0,"19":1238.0,"20":1239.0,"21":1240.0,"22":1241.0,"23":1242.0,"24":1243.0,"25":1244.0,"26":1245.0,"27":1246.0,"28":1247.0,"29":1248.0,"30":1249.0,"31":1250.0},"Entry":{"0":"\n\n","1":"\n\nMametz\n\nWord arrived that we are to move up tomorrow and this morning will shift to Becourt Camp The snow still lying thick on the ground but the thaw has commenced to make everything slushy. George Norman experimenting with a bomb thrower, had an accident and will probably lose 2 fingers. General Howe was there at the time. Left Mametz Camp in search of 6th Ambulance dentist at 9.30 and walked through the wood noting many graves both German and our own. On arrival at Fricourt Camp found that the Ambulance had gone on trek and the whole place was deserted. The 5th Brigade were shifting out of the adjoining camp. Pushed on down to Becourt and saw Colman and then with Archer arranged the billeting. McLennan was there with his machine guns and had just last night returned from the front line where things were not too good, the 4th Divn being pushed back with losses and tanks proving very slow. All the \n\n12\/4\/17\n\nBecourt\n\nthe Battalion and gear is expected to come in about noon. The other Battns. parading as usual – bands playing. Arranged for baths this afternoon 50 men half hourly. In the morning we leave early clearing Pozieres at 9 a.m. marched in about noon and settled everyone down in the huts which had not been properly cleaned by the outgoers. Had a long cold wait before anything eatable appeared and lost touch with O.P. my batman. When he appeared he said he had been having his lunch. Rather amusing! Later he went into Bapaume and did not return until late and then odorous of drink. A dag! Several officers much off color owing to thyphoid inoculation. Heavy snow fell in late afternoon and drifted into a thick carpet covering everything. In the evening C.O. assembled O.Q. Corp for a few remarks on march discipline\n\nTransport. Ours is becoming too slack Evans being fat & easygoing. A change there would be good\n\n13\/4\/17\n\nBecourt & Benagetre. \n\n Astir at 5.30 a.m. and moved off as head of Brigade Column at 7.45 a.m. snow and frost still heavy on the ground. General Gellibrand lead and I had the job of seeing all the inevitable batmen and other stragglers roped into some orderly formation. Some delay when we got on to the main road owing to the intervals between platoons taking time to get out. The G. started to rouse me for not pointing out to the C.O. the effect of the orders he gave. Took a firm stand and disagreed with him as it is not my job to teach the Colonel his. Halted for lunch at Misty Way and some nurses passed in motor ambulances going to Bapaume – this is the furthest forward we have seen them. Busses were conveying 4th Div people back to the rear – from all accounts their casualties equal about 50%. Rumoured that Jacka V.C. is a prisoner A nasty sick stunt. Marched through\n\n13\/4\/17\n\nBegnatre\n\nBapaume and found the country the other side very pretty and undamaged. The 5th Field Ambulance is established here. The men marched fairly well and very few fell out more than a few yards behind. At the end of the march we had a foot inspection and found many blisters. In a pleasing rolling paddock crossed by thick barbed wire and a trench we were told to camp. About 300 could be accommodated in existing dugouts and all commenced to \"snipe\" and dig in. An artillery sergt of the British on an 8\" gun was heard to give hurried orders \"Dooble the guard on the timber and \"keep yer oeyes in the back of ye’eds \"The b--- Anzacs are ‘ere.\" With a barbed wire entanglement, a waterproof sheet & a blanket, a good shelter for two is made. they \"dig in\" and heap the sods round the outside and sleep together in remaining blanket etc. About dark Fritz brought one of our planes down. It landed safely. Later a sausage balloon went up in flames. Our \"archies\" drove him off. Loud cannonading\n\n14\/4\/17\n\nBeugnatre\n\nA clear sunny morning with cold wind. After breakfast received word to go to 7th Bde H.Q at Fauvreuil to sit on a to try an officer for drunkenness. Rode off on my little black (now acting better) and passes General Gellibrand who stopped me for a talk on some regimental matters. Pushed on to main Bapaume road (pron. \"Bapuume\" by our men) and then along a new roadway to Fauvreil – a little ruined and desolated village which has been very pretty. Laid out in a large square it has been thickly covered with trees – and indeed they still stand. An old towered chateau dominated the village and now lies in ruins. Rode round muddy debris strewn streets but no one knew of the 7th Bde. Some very tired and dirty troops leaving the town & going rearwards. G.S. wagons were taking stones from the civilian cemetery for paving the roads. A German cemetery large and agreeably filled with crosses took up another quarter. After much wandering round found the place and members started to\n","2":"\n\nBeugnatre\n\ngather. A war bitten lot and someone remarked that there not many without war ribbons. General Wisdom D.S.O. & Order of St Stanislaus, Colonel Annan D.S.O. Major Wiltshire M.C. Basil Holmes & were undecorated. We met in a place that had been a stable at no distant date. Accused pleaded guilty and an English officer acted as Judge Advocate General. A little hitch owing to the charge sheet having been signed by General Smyth V.C. instead of Colonel Pye, the Battn. Comdr. but we got this fixed up. A sentence of cashiering was recently quashed on the grounds that the charge sheet was not signed by the Regtl. C.O. but by the Corps Commander. This rule does not apply to G.C.M’s. after finishing I met my horse and orderly again and saw a \"drachen\" being run in to its moorings, men and bags of sand hanging all over it. Rode home for lunch – very pleasant & delightful country this. Constant\n","3":"\n\nBegnatre\n\nsound of shell explosions – big – in advance of this town place. Early this morning was a terrific bombardment and a heavier and louder crackle of machine guns going mad than ever heard before. About 5 pm the Colonel was warned to stand by ready to move and that we would hop over in the morning at 5 am. Great excitement and bustle. Extra bombs, bomb buckets, jackets, gloves, pistols, cutters, mats etc all issued. Officers assembled and given scanty orders. After waiting a long time we received orders to move and that we hop over the day after tomorrow. Set off and met guides at Distillery and from there pushed on in file. Our m.g. and cookers should have gone on ahead in daylight but followed in rear of each company and consequently took time to unload and blocked the traffic. Several big tank traps and a couple of old ruined villages en route. Coming into Montreuil were some big guns belching fire and smoke and loud sounding\n","4":" \n\nNorrieul\n\nAbout midnight reached Batt HQ and there found guides to take us forward. Coys of 24th alongside ours. It was early morning before all were in and on their own ground. All stuck along a sunken road thickly crowded with men – as many as could dug in. too many lights and shelling was frequent. Carried shoulder high stretcher cases passed us. Pulled up in a miserable shelter into which one had to crawl on all fours to enter. Crowded with H.Q. officers. Parties passing and runners arriving I decided to go up the line walking over green fields led by a guide. Pitch dark except for a flare now and then. When one went up we froze statuesque. Machine gun bullets flicked overhead and a few shells lobbed occasionally. The firing line was an old railway line manned some troops in front and some in rear. Got back before light to tune of skylarks greeting the dawn. Heavy shelling in anticipation of an attack\n\n15\/4\/17\n\nNorriel \n\nRested for a little in dugout when a message arrived that our line had been pierced by Huns and simultaneously heavy rifle fire opened on our right flank. Both artillerys got busy and the enemy took Lagnicourt and worked nearly round us using flares extensively. They occupied one of our sunken roads and killed some men. Met one gunner with a broken gun – all his crew had been killed. We rushed some guns to Bde HQ and lined the adjoining contours but a counterattack drove him back before hand. We retook Lagnicourt killed many and made 230 prisoners Hardly a successful stunt for them!. We then sent out fighting patrols in front to find out if his line occupied. Much shrapnel used during attack. The 12th Battn was the one pierced and two battalions participated in the attack. Our Lewis guns knocked over many and 4.5’s put barrage behind them while 18 pounders chased him back\n\n15\/4\/17\n\nBullecourt\n\nPrisoners at 11 o.c amounted to 300 and stretchers full of wounded and moaning Germans passed & repassed. Our patrols have been moving about No Mans Land not seriously molested. About 9 oc he sent a strong bombing attack against our left flank. We knocked out about 8 or 9 of them and their wounded are still in front of our lines. We had 1 killed 3 wounded. Shifted down to next Battn H.Q. about 11 am and understand from Stewart everything is on for tonight. Road in front of Battn office being shelled heavily. Major Dooley received a blighty in hand and shoulder. During lunch time many badly hit Germans were brought in by men specially detailed as S.B’s. some groaning in the most ghastly manner shattered limbs and mangled bodies. Also got 5 men of ours who had been out 5 days a ghastly sight wounded limbs all swollen up. A carnival of pain and in hearing of the groans we sit with papers and maps planning still more trouble.\n\n15\/4\/17\n\nBullecourt\n\nWent down and saw General re some obscure details in operation orders. Rain fell during afternoon and the whole place is muddy. Our heavies caught Germans massing at Caen. Big bombardment of heavy guns before tea. We have had a number of men killed and others wounded today, and the doctor has been busy. Wounded Huns still arrive and are devils to groan. After tea went up to firing line and discussed plans with Bunning and in their dugout. While there Thwaites came up with report that 50 Germans were coming up at our left flank. Prayed to God it was true being ready for a scrap but I could see nothing there. A party of 9 attacked Gawler’s post this morning and left 8 dead. Altogether a day of fights. Coming home we got lost and rambled a long distance out of our way. Found AMC congested with wounded on stretchers. No sleep for two days. Hope for some tonight.\n","5":"\n\nHindenburg Line in front of Bullecourt\n\nLast night slept on a hard duckboard with fits and starts although very dead beat. Aroused to a sudden gas alarm and wasted no time donning gas mask. Our mornings fighting appeared satisfactory against the flower of Germany and the numbers killed were high. German has been the only language talked in hell today! After breakfast settled down to the luxury of a wash and a shave. Finer weather but still a good deal of mud – Spent morning fixing up details of supplies for stunting - always a trouble this unless one keeps pushing hard. General Birdwood round after lunch looking at the show. Guns busy cutting the wire in front. A few men wounded at Dressing station. Very heavy bombardments all day on the wire and in late afternoon some large ones got very close to the road and burst loudly. The Padre returned from hospital\n\n16\/4\/17\n\nHindenburg Line in front of Bullecourt\n\nand brought a small cake and some fresh butter sent to him from England. The General and B.M. came in and have agreed to my proposal for Battle Headquarters. The Colonel visited the 2\/7th West Ridings on our left this afternoon. Some rain in evening. Turned in about midnight in a puddle of water which sopped into my clothes but nevertheless slept not unsoundly. During the night two men of 4th Divn came in after having been out between Fritz’s wire and trench for no less than 6 days. After their people retired they got in here – four of them and every time they moved they were fired on, so with true Australian calm they collected rations & greatcoats off corpses round and settled down to make themselves comfortable. At night they found the wire too thick to penetrate so straight on. Next night they made \"traversing mats\" of old greatcoats etc and made a dash for it – two were killed. They made another rush tonight and got through\n\n17\/4\/17\n\nBullecourt\n\nAwakened about 8 and rose at 9 the C.O. telling me that I had to attend a conference on 4th Divnl stunt at D.H.Q. Had some breakfast and then set off on foot. A few men killed and wounded last night and this H.Q. well and truly shelled. With Hunt & Gunn walked through Norrieul and through Vaulx. This latter is a village of some size and has been a pretty little place. The local post office remains standing but well dinged. The church is a tangled heap of ruins- evidently blown up. The clock face is planted up on the heap of ruins. Streets extremely muddy & sloppy and the roads dreadfully boggy. Many dead horses lying round. Reached Q.M’s store and shaved and put on clean clothes. Had some lunch and then sent for horse. Went over with Hunt to transport lines and on the way passed through hail and snow storm. With horse pushed across to D.H.Q. which is a row of houses (portable). The main Arras road is paved and straight. The\n","6":"\n\nBullecourt\n\nComemorative Monument is a small granite stone surrounded with green trees. Yarned for a while with Colonel Ralston, Pedler, Major Watson also officer. Then adjourned to mess where were Major-General Smythe and Generals Smith, Gellibrand and Brand etc. We discussed matters for a while and took notes. After this walked back to Trnasport at rear of Favrieul and got horse. Changed into fighting kit at Q.M.’s store and rode back home. Roads extremely bad and cut up. The guns extremely thick and active right up and all our places being shelled. Padre conducted weird funeral services tonight over our dead men. Went to Bde. H.Q.s and had a discussion with the General who was in a comical humour. Some heavy strafe during evening. Snow. A company relief carried out without casualties. Some shells landed nearly on top of this flimsy structure but not quite – just as well\n","7":"\n\nBullecourt\n\nA wet and sloppy morning with roar and scream of shell fire. It is wonderful to think that this keeps on unceasingly day and night on 300 miles of line on this front and on the Russian, Balkan, Italian and Mesopotamian front as well. It is stupendous. By the time we do our stunt this pleasant ground is going to be well and truly churned up. A few hundred yards down this road is a large wooden crucifix with life size figure. Arranged to commence a sock drying place again because many men have wet sox and the doctor is afraid of trench feet. Stayed indoors all afternoon and had some visitors in shape of people from Pedler’s Battn. After tea the General and B.M. and an Artillery Major came in and had some tea and a talk about all sorts of things – generally hardships we have gone through. An entertaining subject which we all enjoy discussing frequently on very slight provocation. C.O. & Stewart went up the\n\n18\/4\/17\n\nBullecourt\n\nline afterwards to stir some of the companies up a little. Talking to Gawler of his little stunt the other morning – It seems that about a dozen Huns came at his post stumbling on it as they made towards the Tommies. Our chaps fired at them and they thereupon rushed our post under the leadership of one big fellow. Gawler killed him by revolver shot and the rest of the post accounted for the others, killing or wounding them all. The wounded lay on the ground in front of our posts but were all killed by our men. Their involuntary movements in their pain drew our men’s fire on them. The bodies were all well \"ratted\" next evening but there were few marks of identity or souvenirs. Slept in clothes in a damp blanket with a waterproof overall – very cold towards morning. A number of 5.9’s fell very close here and caused our foundations to quake. A dark night in which the flares showed up brightly, roar of guns & shells, and over and under ground crawl those poor worms called men.\n\n19\/4\/17\n\nBullecourt\n\nThe G. was in the small hours to see us and to watch the explosion of some Bangalore torpedoes which had been pushed under the wire by some sappers guided by our patrols. Awakened about 4 a.m. with streaming eyes, nasal rheum and every symptom of approaching bad cold – a rarity since starting to soldier. Three Dovers powders from Craig aborted it. During morning word came for our relief by 7th Bde. Some of our men on road work others cutting a sap over an exposed crest on the road. Farrell had about 6 horses right up here this morning. Inspected positions along the sunken road and found the whole place dirty. Tins strewing the tops of the banks and much food and other rubbish about. Unless extreme care is exercised there is a considerable waste of bombs and S.A.A. Sanitation under these conditions is a matter requiring unremitting attention. Roused everyone up and got large improvements made.\n","8":"\n\nBullecourt\n\nOur new reinforcements are not up to the standard of the old heads and take a long while to acquire guts. Our veterans are like lions among them. The sick parade is nearly all new men and the complaints are aches and pains and some exhaustion. Yesterday one chap was sitting down with rain streaming down his steel helmet. \"I wish I could get a drink of water\"!. The old men had their ground sheets hung out catching water and soon filled their water bottles. Another said \"Can I go into the stretcher bearers, Sir I don’t like being in the line like this!\" Discovered today that Durnford is a M.A. Cantab. Craig is M.A. Edin in addition to his medical degrees and our arguments and conversations here are generally of a thoughtful nature. At lunch time a warning came that Huns were massing near Bullecourt and the gunners stood to arms. Nothing came of this however. We go back to Favreuil tonight and push on ahead our billeting parties. The\n\n19\/4\/17\n\nBullecourt\n\ntraffic along this sunken road is nearly unceasing – crowds of every kind of people passing all day at this spot only about 1000’ behind the firing line. Just at present we are indulging in fighting that is neither trench or open warfare. Inspected trenches again at 7.45 p.m. and just before dark rode away on horse which orderly had waiting. A long valley leads from Norriel – a dark place full of guns and mud. A few shells came pitching over and gun flashes lighted up the whole scene vividly, many little graves. In truth a valley of the Shadow of Death. Through Vaulx which was nearly a foot deep in slush and right round to Favriel. Once a very pretty little place. Brought up at the transport lines, roused Evans and after much searching found a few tents, more bivvies and niches and a few dugouts where the Battalion is to be camped. All night tired men will be coming in from the line. Sound tonight of battle on 100 mile front\n","9":"\n\nFavreuil\n\nTurned out about 11 a.m.. A fine day and this camp seemed very pleasant its tents on good grass flats and the thick and undamaged woods of the village forming a background to it. General R. Smith came in for a yarn and the inevitable cup of tea. Put on dress uniform and went over to the 6th F. Ambulance to see the dentist. They are very comfortably located – a band was playing. How different is this battle to that of early Somme days. Received from Gawler some postcards found on dead Germans and posted them home. Guns quieter today and only a very few big ones passed further back than here. Our men busied on cleaning off mud and on brushing themselves up. A large Y.M.C.A. canteen close by is much appreciated. Squadron of aeroplanes flew over about dusk and drew fire of the enemy’s Archies. Commenced battalion mess again for the few days out and had our buglers on the job once more. A fine Last Post blown by \"Muldoon\" who puts his soul into his bugling\n\n21\/4\/17\n\nFavruiel\n\nA pretty rural locality with only the roar of guns (and it was heavy this morning) to remind us of our closeness to the firing line. The level green grass is unpitted by shell bursts and the background of thick wood round the ruined village is pleasant to the eye. Inspected the camp with the doctor first of all putting some ginger into all men left in the lines. Met the B.M. & General Gellibrand and directed them to where the Coys were working. The G. returned to lunch with us and talked over the attack and different points in connexion with it. Went to the dentist at 6th Field A at 3.30 and had 3 or 4 teeth stopped by him. A very neat and comfortable establishment is theirs now. In the evening a Taube came over but did no damage. Mess in an open place with a few tarpaulins round it acting as walls. General has detailed me as liason with the British Brigade attacking on our left.\n","10":"\n\nFavreuil\n\nThe Padre had arranged some services as the day is Sunday but orders for a 2 Brigade stunt cancelled everything. From 9.30 we practised our attack with flags as barrages close to camp but owing to lack of explanation to officers it was not too good. Some of our new subalterns are miles removed from the high standard of old days. After a hurried lunch everyone fell in at noon and marched over to a field between Sapignies and Bullecourt. Two brigades were there and stunted – fine sight to see the attacking waves going over the green slopes. The barrages were represented by Light horsemen. On every side a fine vista of gentle sunny fields and woods. Were it not for the ruined villages one would never know the Hun had been over it. Reached camp at 5. Mess at 7 with 7th Brigade band playing. Hostile air craft active today and one was only a few hundred feet overhead early and neither m.g. or our fire could hit him. Later he crashed with phosphorus one of our balloons. Heavy outburst of guns about 8.30 out in front, a menacing growler is the 18 pounder\n","11":"\n\nFavreuil\n\nDawn was ushered in by a heavy and continued bombardment in which 3rd Army was rumoured to have hopped over with a result, as we later heard, of 2000 prisoners. Lt. Grieg at our Bde Bomb dump was badly wounded with a piece of shell just above the heart. The weather today was sunny and perfect. The many trees round are showing a blush of green and underfoot is a fine sole of grass. Transport horses from the lines surrounding were scattered all over the hillsides and in the hollows. Going to water they are in long columns and their watering places generally a sea of mud after very little rain. Taubes were over early and archies and emma gees as usual made much noise and little execution. Sausage balloons up all round but are not as venturesome as of old since Fritz has crashed a few for us. In the balloon sections (100 strong) is much waste man power – soft jobs. At 9.30\n","12":"\n\nFavreuil\n\nthe Coy commanders with maps & plans lectures to N.C.O.’s and men on the coming attack. In the afternoon each company did a practice and Stewart and others went to a 5th Bde practice at which General Birdwood was present. Watched a battery of 60 pounders in action their long venomous noses kicking up with recoil at each discharge. Read with much amusement Phillip Gibbs’ account of the Lagnicourt stunt. From an authorised war correspondent one would look for something a little nearer to the truth. Personally I feel inclined always to accept as reliable the German official. Made preparations for an early morning stunt tomorrow having a reveille at 1.30 am. C.O. very slack and slow about furnishing returns to Brigade H.Q. and takes up a novel stand as amusing as it is possible. In their cemetery here the Huns have erased dates off the wooden crosses so no information can be gleaned from them. Heavy stunt about twilight – roaring of guns\n","13":"\n\nFavreuil\n\nA perfect Australian sunny day with a light breeze blowing. The Transport men out shepherding the mobs of grazing horses lie in the grass and think of home. In the distance over rolling grass land is the little village of Morez. Skylarks up aloft trilling out their songs and many aeroplanes aloft. To get a day like this after months and months of dullness is like taking a draught of wine. Took out ‘C’ Coy and put them through their attack practices, the barrages being shown by flags manipulated under the direction of that animated mushroom clothed in purple and fine linen - \n. Tried the 2 wave principle and consider that a 2 pace extension leads to dangerous bunching. At 10.45 sent the men in (they are looking very fit at present) and let them get their lunch at 11 a.m. and their kit ready to fall in at noon. Last night there was dirty work by rifle and m.g. fire and heavy gunning on our left as the Hun counterattacked the 3rd Army. Hear that Fontaine is in our hands and surely Bullecourt becomes untenable\n\n24\/4\/17\n\nFavreuil\n\nA perfect day still. In the afternoon went out to our practice ground and carried out a two Brigade attack practice one of finest sights I think that I have ever seen. About 7000 men in waves as relentless as Fate sweeping across country with set intent. Rode along in rear & then attended a pow-wow at which the General was present. Just like a big field day at home both in the operation and the surroundings. We rode out through Sapignies which had been most systematically and thoroughly destroyed by the ruins. The Church is a high heap of rubble and nothing else fringed with a few still upright tombstones of grave and respectable burghers. Some Indians camped in here. The trees round have been chopped down and left lying. The men carried out today’s exercise well and show how once they have a thing explained and discussed they can do it. Bunning lamed by a kicking mule\n\n24\/4\/17\n\nFavreuil\n\nA white parachute descended from a distant sausage balloon. Our counter to Hun activity in downing balloons is to put a barrage round them – rather a desperate remedy seeing that our archies are alleged to have shot down one of our own planes yesterday! Watched one balloon drawn in on its motor winch to the enjoyment of a crowd of curious Anzacs. It comes down with many dangling ropes and when within reach, the little officer in the basket says: - \"Hand over hand haul down\" which is at once repeated loudly by a sergeant \"’And over ‘and ‘aul ‘er down\" A scene of much excitement and cries of \"Stiddy the’ Anzacs\" for our chaps out of devilment would like to bump the basket hard on the ground just to see if the officer could swear. Our chaps hate being called \"Tommy\". One R.F.C. addressed one of them as \"Tommy\" and our chap said nothing but gave him a withering look and took no notice of what the fellow wanted done. General Smith dropped in before tea for a few minutes. Stunt postponed.\n\n25\/4\/17\n\nFavreuil, Ervillers, Gomiecourt, Mory, Sapignies.\n\nWith G J. ONeill rode off across country to get in touch with the H.Q. of 185 & 186 Brigades with whom I am on liaiason Reached L’homme Mort after inquiring of sundry Tommies and saw B.M. there and their General. Rode across country to Ervillers and found General Hill 186th British Brigade and discussed action and barrages with him. Then to Gomiecourt and saw B.M. 185th about similar things. Both these villages are a heap of rubbish and nothing else having been absolutely torn to bits not by gun fire but by such means as knocking out walls etc so that the roof collapses. The British tommies in these places were very punctilious about paying compliments and markedly different to ours. Came back through Sapignies having a good ride which would have been even more enjoyable had the weather not been dull. In the afternoon officiated as judge at sports, today being a holiday on account of being Anzac Day. Unearthed some fine athletes. Much struck by how dirty the men are in person & clothes owing to no baths. Long hair prevalent too owing to packs being back in dump. Cold evening and smoky brazier turned us into black-a-moors with its fumes\n\n26\/4\/17 \n\nFavreuil\n\nDull weather. In the morning pitched a camp of tents and bivouacs on our right flank for the 21st & 23rd who later marched in from Vaulx. In the afternoon two companies did the passage of wire by means of traversing mats which we found acting well when once in position. 400 of the men had a bath in the village. Sent Hunt into Albert with the mess cart – a long journey from here. Our aircraft have been exceptionally active today and doing much fancy diving and turning somersaults. One chap did a springboard turn jumping up and then flopping down to within a few feet of the ground. The observation balloon was up from near us and the usual crowd of happy Anzacs were hanging on the guys. Colonel Hastings 2\/6 West Yorks. came over in the afternoon for a talk regarding the stunt. Their chief anxiety seems to be to get into rest area again. About mess time Fritz put some heavy naval stuff over on to us but most of them duded. Evidently searching for the 60 pounds battery\n\n27\/4\/17\n\nFavreuil\n\nReveille at 12.30 and after a cup of tea all the companies moved off independently to the practice ground between Bihucourt and Biefvillers. Although everyone had been over the ground at least a couple of times before the place was not too easy to find and it would have been any easy matter to get lost. Rode with Stewart through Sapignies where some of the ruined houses in their time have been places of some importance. On reaching the road in rear of the we found that the rest of the people had not arrived but they gradually loomed up over and assembled silently. From here they were fed forward on to the tape and moved up very silently and well. The chief noise came from the rattling of the entrenching tool handle against the empty scabbard. Bayonets had been fixed and the picks and shovels secured to their carriers back at the place of assembly. The waves (in which they have been all along organized, messing etc together) filed up from their respective flanks and lay down. A lesson\n\nFavreuil\n\nhere arose. There was a gap between A & B Coys are this was not discovered by me for a while in the dark and the whole lot had then to be moved. When the 21st had in turn strung out behind us I walked along to the right flank of the battalion and there found the General nearly crying with vexation and worked up into a state of despair with Davis. Between ourselves and the 24th was a gap of 100ft without a man on it. This was due to the officer marking the boundaries pacing off from the left and not the right. The right boundary of the Bde. was on a fixed point but the left was in the air so to speak as it terminated somewhere near the \"blowback\" space of the heavy barrage. At 4 am (zero) we hopped off the barrage being represented by fiery torches carried by Light Horseman – an excellent and impressive barrage too. At daybreak horses took up the running. Some confusion occurred through waves of the 21st getting themselves mixed among ours. It was still dark and\n\nFavreuil\n\nnot possible to see very far on either flank. Arranged to fill the gap between ourselves and the 24th by feeding up some men from the rear waves but the 24th converged on us and gained normal connection. The men grasped the idea very well and kept very close up under the barrage as its bright chain of lights retired. Flares denoted the taking of the first objective. By gradual stages the second trench was reached and more flares fired but here the leading waves became too thick owing to the road boundary going off at an angle and squeezing the men into a heap. Here the General had some words with the Colonel and, as the old man said, \"stamped his foot\". It was now nearly light and a thick rime of frost was on the grass. Away on the right could be seen the waves of the 5th Bde. The 21st now passed through us and pushed well forward and seemed to be keeping good lines\n\ntheir officers contrary to our practice, using whistles very freely. Their halts under barrage were as frequent as they were short and here to my mind, the operation fails. Throughout the density is too intense and numbers so many that the men are nothing but food for m.g.s. In the latter stages the dense lines doing these frequent halts under barrages must afford great chances for the guns on the slopes in front. At about 6 a.m. formed up and marched back to Camp. Went to bed after a bracing hand gallop over the fields and slept until about 10.20 when Hunt brought some breakfast. Then slept on till 1 pm when the C.O. returned from an F.G.C.M. in the afternoon put the whole battalion through wire traversing with mats and the keeping of their waves after passage of obstacles. Went at 6pm with the Dr & Spiller to the Baths in the village for a good hot shower.\n","14":"\n\nFavreuil\n\nRather overslept and had a hurried breakfast before falling in. The battalion formed up in mass and carried out an advance in column of platoons in line across fine open ground and it was a fine sight to watch. Reforming into column of route we crossed the road and made for our Brigade practice ground where we occupied ground slightly to the right of where we were before. The contour of the ground was quite good enough for us to carry out our operation in entirety. The forming up on the tapes was again carried out well and the advancing waves kept their formation well. The N.C.O.’s show a very marked indisposition to \"butt in\" and correct mistakes and have cramped initiative for fear of being roused up for making mistakes. A pleasant ride back across country & afternoon off. A normal evening was followed by the usual 10 pm \"Lights out\". At 11 pm we issued an alarm order with every appearance of genuineness to all the company commanders with instructions for them to move and\n\nFavreuil\n\ngarrison the Corps Line with their right resting on H11. The whole battalion was in position by 12.30 ready to have charged. The only serious defect was that the men’s waterbottles were not full and some of them would have gone forward thirsty. A serious defect this. The newer men were without rations in some cases but the old heads had dived in and collared a double load! Experience teaches. Some of the officers were slow in turning out and had some nasty remarks from me. The cool morning air would cool a few fevered brows. The Q.M. did not rise to the occasion and reposed in a circle of stout bottles. All the men considered it as a serious stunt and all their guns were mounted. Some 23rd were billeted in the trench there and came creeping out half asleep asking our chaps \"for the oil\". It was a very silent night on the front. About 1.30 under orders they returned to camp again and then turned into bed and another spell of sleep.\n","15":"\n\nFavreuil\n\nA good warm sunny day. Church parade 10 am, with band which made our big men step out finely. A F.G.C.M. with myself as president and Captns. Bunning and Godfrey as members was to meet at 10 a.m. but the latter did not turn up so I adjourned until 2 p.m. Major Parkes dined with us. The votes for the General Election were taken today but interest was very slack and many men were too apathetic to vote. Slater said most of his voted Opposition. Struck tents to let the good sun get on to the ground. Sat as President of F.G.C.M. at 2 pm on a real cold footer – a reinforcement. True to his type he pleaded guilty and made no defence doing all in his power to attain his heart’s desire – freedom from personal danger in the firing line. The charge was only A.W.L. and we had to pass 2 years HL probably just what the beggar wanted. About tea time a Taube came over and our archies put up some splendid shooting. As a rule it is rotten. Quiet evening closed lovely sunny day\n\n30\/4\/17\n\nFavreuil\n\n\"Get out of bed\" was sounded at 12.30am. \n\n A mild morning with a pale moon. After a drink of tea and a bite to eat all the companies cleared camp and silently marched across country to their place of assembly. Rode with Stewart and passed the 23rd moving along in column of route & our own people as well. The movement was carried out very silently and one could have been only a few yards away and yet remained in complete ignorance of such large bodies of troops being in motion. Found the jumping off tape but to find the rallying place was far more difficult as everything alters so much at night. In our training we need a good deal of practice in the dark. Eventually the companies commenced filing up to their hopping off spot but the 21st became hopelessly mixed up with them owing to Brown getting his markers in the wrong place. This was all rectified just as time enough to give everyone a breath in their correct place before jumping off. Picks & shovels were carried by certain men stuck\n","16":"\n\nFavreuil\n\ndown the braces of their equipment and worked very well. At intervals flares were fired from the enemy lines and all men seemed to be bathed in light as they stood in their waves. There was more noise than at our previous practice but the people in the enemy trench could not see anything. At 4 am the barrage (denoted by flaming torches) appeared and the advance commenced. There was some hesitancy in kicking off and the General roared but once off the whole Brigade was in motion. The direction was kept by different men on the flanks 3 were responsible and marched in file instead of line. Despite a little bunching the taking of the first and second trenches was rather well done and the success flares went up promptly. Some men showed lack of imagination in not choosing good cover and many had to ordered flat down on their bellies perhaps because the ground was rimy with a frost. The flush of dawn was\n\n30\/4\/17\n\nFavreuil\n\nflushing the East as the 21st passed through us and clung closely to the creeping barrage (now horses. Away to the right and connecting with us we could see the 5th Bde operating. After the","17":" had carried out their phase we formed up and marched in. A contact ‘plane arrived just after the operation was complete. Rode back through the ruins of Sapignies and had a hard hand gallop across country to a fine old tree that is our landmark. A squadron of 6 aeroplanes humming off overhead on some mission. Very mild and bracing this early morning. Lost no time in slipping into bed on arriving back at Camp and slept until noon when rose shaved & dined. The Brig (Gellibrand) rang up and told the C.O. to be ready to move up with the unit tonight but I don’t think we are likely to go now until tomorrow. The last two days have been ominously quiet on the front – probably both reserving shells.\n","18":"\n\nFavreuil\n\nAnother of us finished fighting. Grieg got a piece of shell over the heart and, although almost well yesterday, he died today under an operation. God rest him. In spite of their potatoless days in England we seem to manage to have them nearly every day here. Our mess cook is an expert and out of respect for his culinary skill we are keeping him out of the stunt and not sending him over the bags. The evening was quiet & balmy and the men had a concert under Alderson’s direction. The doctor and I walked up and down talking about things in general and the War and its ways in particular. A smell of gas was noticeable in the air probably due to a few gas shells being thrown about. The gun flashes were vivid more than usual tonight. The","19":" &","20":" moved up and took over the firing line – we follow the day after tomorrow and it seems only too possible that they are going to march us right from here to .\n","21":"\n\nFavreuil\n\nAnother fine sunny day. After breakfast with Spiller rode up to Vaulx-Vraucourt the roads were heavy with dust and passing motor lorries made them unpleasant. In Vaulx a number of the German proclamations are still on the walls and their signboards remain. At the junction of roads in the village there is a large crater where the fork has been blown up. Many heavy guns with their large stocks of shells are in position among the ruins – rather a good job \"the Heavies\". Just outside the town on a piece of green bank backed by a hedge is a large crucifix undamaged. A Taube was over spotting for a heavy battery whose shells were landing on the road about 500ft from us. Selected a suitable valley in which the Battalion can assemble and rest prior to moving up to the front line. Returned to camp again much enjoying the ride over the paddocks. Skylarks and other birds filling the air\n\n1\/5\/17\n\nFavreuil\n\nwith song and mobs of transport horses grazing everywhere like the flocks of peace. After lunch into saddle again and rode down to the 3rd Aust C.C.S. at Achiet to Greig’s funeral. Passed the Monument Commemoratif and D.H.Q. and cut right overland to the hospital. A nurse was sitting in the sun drying her hair – the first woman some of the officers had seen for months. In spite of the fact that the starred ensign flys at the jackstaff there are many Tommies on this hospital staff and apparently able bodied & young men were doing the safe work of bearers while less fit Australians are repatched up & jostled back to the trenches without respite. An ambulance car drove up as we waited and two cases were taken out. On one of the stretchers was a man with blood on his face and hair. His head resting on a pad of cotton wool and each sigh forcing bloody froth from his nose. As one of the bearers remarked \"\nHe’s\n a goner!\"\n\n1\/5\/17\n\nFavreuil\n\nWe all walked down to the cemetery and there were long pits dug some of them partially banked up. At the end of the freshest heaped up earth was a blanket in which was laced up poor Greig. The padre read the funeral service while we stood round and \"Muldoon\" Cumming sounded the \"last post\" as only he can sound it. Everyone turned away with a swelling heart for Greig was brave honest and manly and we old heads feel it when one of us is taken far more than we can say. On returning to Camp, Stewart the CO & self went deep into plans and maps for an hour working out details for more slaughter. The evening was a languid summery moonlit one with the smell of thirsty earth and trodden grass in the air. From the front the gun flashes leapt up luridly and in the tents everyone made merry until lights out. Some of the subs. A little afterwards – different to our old sedate crowd. A startling heavy round of salvoes about midnight\n","22":"\n\nFavreuil\n\nAnother warm sunny day with a cool breeze. More detailed Brigade orders arrived for the stunt and we held a conference of company commanders to finally talk over things. The R.S.M., platoon sergeants and one private per platoon went on ahead to where Stewart had been last night to break up the dumps and get their contents ready distributed so they can be easily picked up. Later the patrols went up to get out at dark and gain command of No Mans Land. The markers for the jumping off tape are to go up with Hamilton later in the day. Rations were cut up and issued to individuals so every man is complete in himself with what he requires. I take Hunt and 4 runners to 185th Bde H.Q at L’homme Mort for liaison. The doctor picks up 24 extra ambulance bearers on the way up. Orders lay down that no Huns are to be brought in until our own chaps are attended to. Prisoners will carry wounded men back\n\nFavreuil\n\nAfter lunch the companies fell in and practised their march on at the jumping off tape. The method of sending the men forward on D3 wire was tried but to my mind proved a ghastly failure. (1) Strung out on the wire a force 600 strong covers over a mile (2) The wire acts as a barrier & prevents lateral traffic passing through the files (3) Men falling jerk the wire and cause it to break. There was good deal of difference of opinion about the wire among the officers. C.O. Lt Col Davis then proposed increase in number of markers up to about 60 – far too many & cumbersome and highly dangerous in No Man’s Land. Some raised the question of the right wheel of the Indian files on to their markers and C.O. said \"there are acres to wheel in\". Tres comique!. My views were ultimately adopted. All greatcoats mess tins blankets and officers gear dumped at QM’s store. Coy seconds in command. 1 L.Gunners per team, 1 Sergt per Co. and all specialist instructors including left behind here. Men looking very fit and tough\n\n2\/5\/17\n\nFavreuil & Vaulx\n\n7pm Battalion moved off in waves in column of fours with 50ft between half waves and 100ft between companies. The men carried 6 bombs each & 4 sandbags, 2 of the latter being round the legs. The 24th crossed our line of march in column of route with their band. Halted at Vaulx until the twilight deepened. The enemy put up a fairly stiff barrage on the Longatte Road – shrapnel mostly. The waves picked up their guns (which had been transported ahead) and all their wire mats, carrier’s bombs etc at the gully near aeroplane Hill.\n\n9pm my men left them here & marching on the map in the moonlight found the 186th & 185 Bde H.Q. at L’homme Mort staying with the latter people. About 11pm. 10 tanks passed slowly up along a tape & made the same noise only as a motor, silencers being used. Dreadful uncanny looking things sliding along over all obstacles. The Hun puts some heavy stuff round here continuously. Having reported to B.H.Q. by phone turned in. the runners \"dug in\" to a bank\n","23":"\n\nL’Homme Mort \n\n2 am Awakened, and had some breakfast with the staff here. Everything very quiet and reports came back that the troops had commenced going out on the tapes. This was evidently carried out without\n\n3 am much trouble as no m.g. fire could be heard at all and both our guns & theirs were nearly quite silent. Few flares\n\n3.40 All still quiet. Another tank passed on its way up. Everyone outside waiting\n\n3.45 am ZERO Like one the guns lashed out and two Armies hopped over. Within a couple of minutes the guns had reached a high pitch of violence and their bursting shells showed up like big stars only a few yards apart. The noise was great but no more intense than some trench raids – a large operation like this sounds louder the further you are back from it\n\n3.50 The Hun’s barrage seemed to shut down on front line – no shells back here. The flashes became less distinct as the fumes and smoke filled the air. This calls for artillery & his usual flares did\n\n3.55 L’Homme Mort\n\n not show up much. The guns now quickened to a violent 4 rounds per gun per minute. 1 gun to each 15 yards:\n\n4.10 Still continues unabated. No sound of any machine gun fire. Dawn breaks fog wreaths & fumes.\n\n4.30 Fire slackens somewhat.\n\n4.45 Word received that Australians have taken the first trench. No word at all from the Tommies. Barrages still continue but of less ferocity being just steady heavy firing Took hot tea in the mess with R.G.’s & others These people are wonderfully comfortable – huts, good mess with good stock of food, flowers, beds, valises etc. & unlimited whisky\n\n5.15 Still no reports. Broad daylight. Heavy barrages continue. Smoke forms a mist\n\n9am The battle continues to rage with unprecedented fierceness and walking wounded dribble past towards the rear. Heavy losses seem to be the order of the day and news of many killed comes down to us. It soon becomes apparent that all is not well in Bullecourt though our people\n\n3\/5\/17 L’Homme Mort\n\nhold part of the village. 186th & 187th Bdes. Seem to have done no good and fell back on the railway. Later were reorganized and sent over again. The 2nd Anzacs do good work and carry all their objectives but their flank is in the air by reason of Bullecourt still holding out. The tanks wander round one or two on fire. Kept in touch with Bde, by means of runner and ‘phone. Our aeroplanes flew over in squadron form\n\n11 am The Hun seems to have cut off those of our men who entered Bullecourt and causes much annoyance by m.g. fire. A Trench Mortar Corporal comes in with blood stained hand and clothes and tells how the Huns blew him and his mates up with all their guns and ammunition. A thick mist of smoke covers the whole scene which the shells tear through. Here we sit in huts dug into a bank in pleasant places while death goes on outside. The 5th Bde have evidently fallen back before Riencourt but the old 6th appears to have done good work. Losses will be very heavy & a dirty business.\n","24":" L’Homme Mort\n\nRound to the 186th several times for news but beyond finding out that plane had seen some of our men in the Factory and some burning flares to the left of it.\n\n1 pm There is no doubt as to the result of this morning’s attack on a front of 14 Divisions. The Boche has bloodily repulsed it and our troops are as they were back in their old lines. The losses are extremely heavy 80% in some regts. The Division on the left of this 62nd has failed too and only the Anzacs have done their allotted task. Poor lads they must die in scores for they cannot hold on where they are as the Tommies have left their flank right up in the air. The failure would appear to lie in underestimating the strength required to take the place and sending over battns. about 300 strong. – all due to not striking detached men right off fighting strength. Red tape? – blood red!!. The 22nd Brigade relieves this one tonight and will have another go at Bullecourt\n\n3\/5\/17 L’Homme Mort\n","25":" pm Snatched some sleep.\n\n6 pm General Steele and staff 22nd Bde came and took over A tincture of Guardsmen in this crowd. The G.O.C. and brigade staff moved forward to Ecoust but declined to allow me to accompany him. Position now seems that only the Australians have done any good and they still hold the line front & support.\n\n8 pm Much transport and many troops on the move up to the line. The Hun put up heavy shrapnel barrages. Dirty work. A day of victory this for the Germans. Runner says that Joe Slater is killed Spiller badly wounded Elmiger Alderson and others wounded and casualties very heavy.\n\n9.30 pm The Germans seemed to make a counter attack on the Anzacs. Green flares went up and our guns put up heavy barrages. It was just dark and the flashes of the shell bursts made a great show. The Germans sent up tremendous number of flares. Sent a runner to Bdes H.Q. with a report and hope to get some information back. Here the\n\n3\/5\/17 L’Homme Mort\n\n10 pm the English officers love to congregate and drink whisky and tonight a most elaborate dinner was served up port, other wine etc etc. This on a bloody battlefield Our heavy shelling and barrages is all going on top of our wounded lying out there. Brutal game this and so useless.\n\n10.30 pm 22nd Brigade (English) attacked Bullecourt under a heavy barrage which lit up the whole place very vividly. Flares were very numerous from the Boche but there were not many calls for artillery support. In front of the Australians the flares were noticeably further back than they were in front of the British which would show how much further we had pushed ahead there\n\n11.30 Cannonade ceased and there was an almost uncanny silence after all the noise of the last 18 hours. The burst of bomb, rifle cracks, and the rattle of m.g. fire came very distinctly to ear and was sign of heavy battling hand to hand. Reports came back that they had gone right ahead and captured their objectives.\n\n4\/5\/17 L’Homme Mort\n\n12.30 am Fighting continues but no reports reach here. General Steele still at his advanced headquarters at Ecoust. Turned in and slept in a bivvy until morning.\n\n9 am There was not much strafe at dawn and all divisions must be taking time to repair their losses. The 22nd Bde. this morning are back in front of Bullecourt some elements in the Hun front trench & some in an old trench in front of that. The battle so far is entirely in favour of Germans and the British have received a towelling up that will leave them very short of men. The 1st Bde appears to have relieved the 6th . General Steele 22nd Bde came back here to L’homme Mort. A very fine warm day and a few such will make the place stink awfully with so many dead about. This Bullecourt stunt seems to be one of the toughest things struck up to date. Hun losses must be light compared with ours. Two m.g.s in Bullecourt with their two small crews seem to have wiped out hundreds & hundreds of our men\n\n4\/5\/17 L’Homme Mort\n\n11 am The British seem to think that some of their men are still pushing into Bullecourt and occupying some of the houses there. Things seem extraordinarily mixed with both Boche and ourselves in the same trench. At 1 pm dined with Generals de Dalbe and Steele and Staff. The Divnl. Major General came along while we were at it. For some people this is a good war, an Armstrong hut let into sandbag barricades serves as a mess room and daintily arranged flowers are on the table. Abundance of wine beer whiskey soda etc and dinner of numerous courses served by men who are evidently trained waiters. An enormous wicker hamper is part of the mess gear evidently. They do themselves extraordinarily well. Two great expressions \"as a matter of fact\" and \"bucked\" or \"awfully bucked\"\n\n2pm My two runners returned from Bde HQ. Our boys now hold still the Hindenburg line both front and support trenches in spite of their flank being in the air. Thwaites and Bennett killed and other officer casualties. Men pretty heavy. The 1st Brigade took over last night and ours moved back into the Noreuil sunken road.\n\n4\/5\/17 L’Homme Mort\n\n2.30pm Colonel of 2\/8 W Yorks told me he gave a platoon orders to go to Factory and make a strong point there. They are now entirely missing. Aeroplane reported seeing some going into the Factory so God knows if they are still there. The 185th had a muster parade before getting ready to move out. One battalion had 300 who had been carrying the others ran out at about 38, 58, and so on per battalion.\n\n3.45pm The General commanding the 20th Bde arrived and wished runners to our Bde HQ but subsequently changed his mind and went back by car to Divnl H.Q. at the Monument. They are evidently having another cut at the village what a price to pay for putting too few men on at first and for leaving that damned gap between Corps. Guns fairly quiet today compared with yesterday. Weather like summer hot & close and a haze mostly gun smoke about. Loss of direction by English the other morning is largely attributed to the smoke of the barrages blowing back on to them like a thick cloud. 186th had nothing fresh to tell us this morning.\n\n4\/5\/17 L’Homme Mort\n\nThe A\/Staff Captain of the 22nd Bde. made a personal reconnaissance of the position in front and found very few of our people in the Bullecourt line. There can only be a few Boche there. Our fellows have established strong posts and are bombing down to meet the Devons who are supposed to be going along to them. The vague idea the H.Q. of these people possess of what is being done is wonderful contrast to the energy of the Australians. If they don’t know at Bde HQ what is doing the Coys. must know damn all. Tonight a most elaborate mess. Dishes wonderfully cooked, cauliflower & the like luxuries. Iced sweets. Port wine coffee bon bons etc. served by men who are waiters for all their khaki uniforms. Hunt came back from Q.M. with story that our ration strength is only 236. Griffen and others killed. There will soon be none of us old heads left alive if this keeps up Tonight our heavies will strafe the trench behind Bullecourt and obliterate it. Warm summer evening.\n\n5\/5\/17 L’Homme Mort\n\nThe operation by the Devons against Bullecourt was another addition to the list of failures. The 8th Devons relieved the R.W. Fusiliers on the left of the village and established a line of strong posts from there on to the road entering the village about midway. They found that the Hun was again in his front line trench and there was much trouble from the right hand corner of the village. All other troops of this Bde now appear to be back behind the railway bank. Rang up the left Anzacs and find that they have been pushed out of about 500’ of the Hindenburg supports but are holding on in the front line still and doing good work. Over Ecoust this morning the enemy was putting much shrapnel which like all of his bursts very high and harmlessly. Over at 186th Bde there is no fresh news. My runners are all filthy dirty looking and ragged people but are good willing smiling chaps. They come back with yarns of our battalion being all wiped out and other tall stories but all these have to be well discounted.\n\n5\/5\/17 L’Homme Mort\n\nAt 11.30 orders arrived for me to rejoin my battn in the Noreuil-Longatte sunken road and Hunt soon packed up and we pushed off overland – 6 of us loaded up to the eyes with gear. The sun was damned hot and the enemy was putting up heavy barrages in front blotting whole areas of ground out with the smoke and dust of shell burst. The large crumps bursting made pretty soft dense clouds of black or grey silky smoke. We rested near a crashed plane and then made the sunken road. The railway embankment was obscured in a dense heavy barrage of shells ripping right into it. Reported to the General and stayed with him for a while and then returned to hear our own Battalion’s yarn Bean was at Bde HQ. Our casualties 400 out of 600 and some good friends killed. The boys it seems got well off the mark in the attack but Fritz tried a new dodge, a lateral barrage which chopped the waves in two and some of those on the left lost touch. However they carried the trenches and did very well throughout. The smoke from\n\n5\/5\/17 Norreuil\n\nthe barrage was thick only dim forms could be discerned progressing through it. The barrage was well timed and did not necessitate many halts. Some say that many of our chaps went charging through it – the reverse to the Tommies. Once in the trenches there was desperate fighting. Jo Slater was killed in No Mans Land and some men who later tried to get his body found nothing but a leg with an officer’s boot on it. Evidently his body had been blown to bits. Scammell was killed by a sniper who shot him through the head and Filmer had his brains blown out. Hogarth has not been seen since he fell wounded. Griffen was killed on the road near Brigade H.Q. Bennett got a bomb fair in the face but is still alive Fraser is missing. Gordon Maxfield went right through to the second objective and got his leg shattered. He is said to have died there. Jones 21st died of his wounds 57 officers killed and wounded in the four battalions and about 1000 men. The padre pushing round burying\n\n5\/5\/17 Norreuil\n\npeople. During the afternoon the Huns put up heavy barrages on the railway. Orders came down for the C.O. to go back to DHQ details camp for a rest and I to take over command of the battalion – now only about 200 strong. Of these 100 went away on fatigue about 8.30 pm At 11 pm the Germans attacked and our artillery put up intense barrages on the S.O.S. going up. Our troops stood to arms on the sunken road and extra bombs and SAA were issued at once and the Lewis guns emplaced. About 12 p.m. the fire slacked and we stood down. The rum issue seemed to be rather too much for some of the men – in their present highly strung and nerve wracked state a little of the strong firewater unbalances them. Considering everything all the men are wonderfully cheery and bright despite our heavy losses. Todays papers speak of victory on just this front! More lies for a credulous public – why not admit things?\n\n","26":" Norreuil\n\nSat up all night on duty. Stewart and the Doctor slept the full deep sleep of very tired men. The latter has been hard at work repairing man’s wilful damage to the delicate machinery of the body and there is much blood on his clothes. At 3.30 a.m. there was a heavy bombardment by our people just as dawn would normally be breaking. Owing to the clouds daylight came later than usual. At 4.15 on the left our guns mostly 18 pounders got to work and did some heavy shooting. The Germans sent up many of their orange clusters in addition to white flares. We had a party of 100 out digging a trench in No Mans Land on the right flank. They did their job and had no casualties. The stunt last night would seem to be a case of \"wind up\". Just about half an hour after dawn the Hun put up a most heavy barrage on the railway embankment quite blotting it out in a dense cloud of smoke and dust which was almost impenetrable for any living being. Soon afterwards word came through that the Hun had attacked and I had to turn out\n\n6\/5\/17 Norreuil\n\nall our poor tired chaps again. Used this opportunity to group them and their dugouts into their platoons (the battalion is now only equal to 1 coy. in strength). Also organized these four platoons into their 4 component parts gunners, bombers, rifle bombers and riflemen. Can raise about 200 bayonets. The attack was beaten off as one chap said \"We bombed C-- out of them!\" Stood down at breakfast time. During the morning the shelling was normal. Winter & Redheap 23rd were killed and Rossiter wounded. The General came along and said that the first Bde and the 2nd Gordons will take Bullecourt tonight and the remnants of the 6th Bde will be formed into a composite battalion about 1000 strong under myself to occupy the railway as supports. Commenced all the necessary preparations – bombs, SAA, panniers, reserve officers. Quite a number of 12th Battn stragglers hanging round here today and their excuses are pathetically weak. Bumped them all back to the firing line under the guidance of runners. A bad case of shell shock in one of our stretcher bearers – all atremble & shaking\n\n6\/5\/17 Norreuil\n\nA few shrapnel round the road before lunch and landed pellets round us. About 8pm orders arrived for all the survivors of the Brigade to be organized into a composite battalion with myself as C.O. and Stewart as Adjt. Each company to be fully organized and to have 8 Lewis guns. Arranged these details with Colonels Bateman and Forbes and established a headquarters near Brigade H.Q. At 3.45 am the 1st Bde and the 2nd Gordons are to hop over into Bullecourt making the third effort to capture the place. We act as reserve in this road and are to be ready to move up to the railway embankment if necessary. The evening was bright moonlight and some heavy shelling filled the air with phosphoric dust. There seemed to be a lot of Highlanders and R.G.s about and a good deal of transport. The \"Frightfulness\" detachment of the R.G. lost their way and drove their G.S. wagons of ammonal out into No Mans Land. The Huns spotted them and started shelling with heavy crumps at last exploding the whole thing killing about 60. a horrible sight mangled meat and limbs everywhere strewed the ground. Our doctor went forward & some stretcher bearers\n\n7\/5\/17 Norreuil\n\n2.40 am Many of our shells going over. A 4.5 how battery a few yards away is most disconcerting and shaking this wretched little place dreadfully\n\n3.30 A heavy rally of artillery which died down soon\n\n3.45 Zero A deafening little brute opposite started to speak very loudly. Clear cold moonlight artillery ammunition teams will have a warm passage out through the village. No much noise here at 3.50.\n\n4 am As before but away towards the left there is a loud crumping sound that means big ones going over. Owing to the almost entire absence of noise we commenced to think that the stunt had not come off. The barrage behind the embankment was very heavy and contained a large proportion of shrapnel. Walked along and saw a number of wounded Gordons going across country and one said that he had been in the charge and right into the village. Lost my fountain pen at Bde H.Q. last night and this morning at 4am sent over for it. The orderly went down into the dugout and awakened the general! A very calm fresh morning and the smoke blotted out the scene. A few flares, a few crashes and much rattling of m.gs was all that was to be seen of the battle of Bullecourt.\n","27":"\n\n5.45 am. General Gellibrand rang up \"We have taken Bullecourt – there is no need for the Anzacs to bomb down!\" Despatched a carrying party of 100 to 1st Bde dump to carry up to them. It looks as if the Jocks have again done good work where the English cannot. A lovely sunny morning – the aeroplanes overhead calling for information by means of a flaxon horn. The 23rd a couple of days ago shot down a Hun bird with their Lewis guns. General Gellibrand came over after breakfast and we yarned nearly all the morning about matters of Battalion and Brigade interest. Latest reports show the Scots not quite through the village so that there will be some dirty work in the counter attacks at dusk if our people don’t move up and get their blow in first. Barrages all round Bullecourt but round here all is very quiet and there is nothing doing. Saw what I have often heard of before today in a 4.5 howitzer – the shells leaving the gun and in flight. These batteries being so close to us every report shakes the whole ramshackle place and brings dirt down\n\n7\/5\/17 Norreuil\n\nAbout 4 pm turned in and slept until 7 Hunt was out all the afternoon ratting dead Germans but found them all fairly well cleaned up. Some of the relieving troops commenced to arrive and take over from us. About 7 the Hun put up a barrage of heavy stuff on us and blotted out the place with dust & smoke. Most took refuge in the brigade dugout. Our counter batteries silenced him – or he had fired his allotted number of rounds! Later he shelled down the valley close to the village and did some splendid shooting. Flame, dust and smoke rose in curtains. Several dumps went up burning fiercely. This valley is now the nearest approach to the Valley of the Shadow of Death. Always being strafed, there are scores of dead lightly buried and stink is in the air like a poison. The artillery have a rough time. Just behind here are some batteries of 18 pounders firing directly over us. They are always kept busy but work in reliefs so get some sleep. About 8 pm inspected the sunken road and found it clean on the whole. The 1st & 2nd Bdes are\n\n7\/5\/17 Norreuil\n\nstarting to come in now and our tired chaps won’t be sorry to get well back. At about 10 pm Q.M. & C.O. arrived and while they were there the General ordered us to move right out tout de suite back to camp. Needed no second telling but got to work at once and started them moving pushing on by horse with Stewart & Evans. It was pathetic to see the \"coys.\" Marching out – groups of about 40 men each. We marched in each 160 strong – fine tall gallant lads. Riding home our thoughts ran on our dead. Dyer a Lance Corporal and a beautifully built giant is dead. He was the incarnation of brute strength & energy at our sports a week ago. Joe Slater Hogarth, Scammell, Filmer, Fraser – all dead God rest them. Dear old Bert Curnow, Doc Mackay, Bruce King – what grand chaps we have lost. Rode on in silence our backs to the flashing hungry guns. A still close evening with bruised grass calling out for rain. Clouds were gathering and drops commenced to fall\n","28":" Favreuil H20 C\n\n About midnight we reached H20C where the cookers were on the job. The camp here was to be vacated at 5 am and meantime our people were to bivouac in the open. There was a meal of hot tea and mutton stew for them. Unfortunately fairly heavy rain started which will make things uncomfortable as the poor devils are tired out. Turned in under a tarpaulin after much ingenuity had been expended on devising shelter but was roused nearly at once by orders arriving to move over to Favreuil as we go early to Le Sars. Started to walk across but met orderly with horse. The men being quartered hereabouts in the old \"bivvies\". Having a batman spoils one as a fellow feels quite helpless if such jobs as rolling a valise have to be done. Rain is continuing heavy. Slept all night in a tent near Q.M. store most of the men were in shelters and little dugouts but some spent the night in the rain. The language of the troops just now\n\n8\/5\/17 Favruiel\n\nhas reached almost a climax of filthiness and obscenity floats on the still night and everywhere. Indeed they have enough to swear about considering all things! At about 9.40 in heavy rain we set out to march to Le Sars. The hedges and some of trees near the village are all bursting into green leaf as spring approaches and they look very well. Bapaume was very quiet as we came through. After getting through the town we were diverted into a railway siding and after some delay each Battn in turn entrained in little trucks and went to Butte de Warlencourt. Marched through Le Sars to a tent camp about ¾ mile out and settled down there. Everything most uncomfortable and muddy. Had Colonel Watson as a travelling companion for part of the way down. Rain cleared off about noon and day muggy. No valises arrived early and my clothes were wet through about the knees. busy today making up recommendations for honours.\n","29":" Le Sars \n\nA splendid sunny summery day. At 10 am we moved off in column of coys. at 100 interval passing through Martinpuich & Fricourt. It was very pleasant going across country and grass is linking up the shell holes. Many a good man is sleeping there who was alive in all his fitness during the gentle days of last Spring. We rode right up to the camp at Mametz – the same one as we occupied last time we were out of the line. Received a complimentary notice from Haig for breaking the Hun line. Dined in comfortable mess tonight and the Padre re-established his reading and writing room. The doctor put up his crowns today – a very well earned promotion. The fighting has left us very short of N.C.O.s and officers and promotions will have to be made to fill casualties. The unfortunate part is that good men away wounded may see inferior chaps who did less and evaded risks by getting in shell holes etc, getting promotion over their heads\n","30":" A quiet day in Camp cleaning up\n\n11\/5\/17 A quiet day in Camp cleaning up and hair cutting. All the officers nearly have had a very close crop. Four barbers hard at work on the men. Weather very warm and close with a very hot sun. After lunch went to Albert which is quite transformed since becoming Army Headquarters. The place has been cleaned up and some civilians have returned. A motor water-cart driven by 4 Tommies was watering the road in front of Army H.Q.!! The way the English luxuriously run this war deserves them to lose it. Bathed and bought some things at the Officers Clothing store and at the GFC. Then to afternoon tea and met Major Murray V.C. D.S.O. a nice chap. Some of the younger officers we see nowadays are much below the standard of the past. Rumors that we move up again soon and that 4th Div are going to 2nd Anzac and up north. Rode home through green leafy roads. Becourt Wood in good leaf. Found Bob Holland at the camp & he messed with us. Then walked over to his camp.\n\nWe have had some wonderful characters in the regiment, most of them have left since Gallipoli. A few come to mind \"Tucker\" Vienna Killed at Pozieres The Old Grey Mare (Cunningham) Prisoner in Germany Bennett (Crippled) who lost his voice Geordie ONeill still here in Transport Sergt Pennie badly smashed up Old Pat Hannaberry Senile decay :Squeaker\" Dyson. Malsworthy Smith – \"Allinga - man to dig in!\" T. Rout now back in Australia.\n\nBattn. passing another. Tired men coming out of the trenches:- \"What mob are yer?\" \"Mob er goats\" \"Crise, I knows that without telling!\"\n\n(An old man would always answer one of these questions courteously particularly to a man coming out of the line – etiquette. Reinforcements know no better).\n\nGoing in to do a stunt with many new men most of them must have felt nervous at the first experience. We passed a heavy battery full of flame and roar and one of the new chums turned to me and wistfully asked \"Are we going into dugouts Sir?\"\n\nOrders arrived at nightfall for a charge some miles away at dawn. Faint hearts soon started to make their appearance. But J. contrary to all expectations although ill, insisted on going on. I marvelled at this to the doctor as being so contrary to what we expected of this person \"Yes: said he \"\nDelirium\n perhaps?\n\nThe Australian. We had a sharp attack on one flank and our line pierced with loss. We took about 200 prisoners and wiped out a good many others. Within an hour the skyline was thick with chaps after souvenirs!\n\nDr:- \"I see Scotland is saving the Empire again. Stewart:- How much is she charging?\"!\n","31":" General Birdwood:- \"There was nothing but German talked in Hell yesterday\"! Great expression,\"Dear Bill\" when things are bad or uncomfortable. Said to arise from this joke of a soldier’s letter \"Dear Auntie, This is no ordinary war I am sending you 5\/- out of my pay but not this time, Bill.\n\n"}}