{"Document Name":{"0":"Diary_0467","1":"Diary_0467","2":"Diary_0467","3":"Diary_0467","4":"Diary_0467","5":"Diary_0467","6":"Diary_0467","7":"Diary_0467","8":"Diary_0467","9":"Diary_0467","10":"Diary_0467","11":"Diary_0467","12":"Diary_0467","13":"Diary_0467","14":"Diary_0467","15":"Diary_0467","16":"Diary_0467","17":"Diary_0467","18":"Diary_0467","19":"Diary_0467","20":"Diary_0467","21":"Diary_0467","22":"Diary_0467","23":"Diary_0467","24":"Diary_0467","25":"Diary_0467","26":"Diary_0467","27":"Diary_0467","28":"Diary_0467","29":"Diary_0467","30":"Diary_0467","31":"Diary_0467","32":"Diary_0467","33":"Diary_0467","34":"Diary_0467"},"Date":{"0":"unknown","1":1197.0,"2":1198.0,"3":1199.0,"4":1200.0,"5":1201.0,"6":1202.0,"7":1203.0,"8":1204.0,"9":1205.0,"10":1206.0,"11":1207.0,"12":1208.0,"13":1209.0,"14":1210.0,"15":1211.0,"16":1212.0,"17":1213.0,"18":1214.0,"19":1215.0,"20":1216.0,"21":1217.0,"22":1218.0,"23":1219.0,"24":1220.0,"25":1221.0,"26":1222.0,"27":1223.0,"28":1240.0,"29":1241.0,"30":1242.0,"31":1253.0,"32":1254.0,"33":1255.0,"34":1256.0},"Entry":{"0":"\n\nTuesday March 20.1917\n\nA cold bleak wintery morning. Everyone is pitying the poor fellows in the trenches during the past few days and nights. There were frequent cold showers last. The roads and trenches are very slushy. With the recent bombardment the trenches, especially Avenue and Irish Avenue are in a deplorable condition and afford no shelter at all. \n\nSince I have been in Hospital this time I have done a lot of newspaper reading. We get the London papers every day. There are also a lot of\n\nAustralian papers sent to the Hospital, such as the Bulletin, Leader, Weekly Times, and the Australian. I always like to see an australian paper. It reminds me of home and old times, and also enables me to keep abreast of australian politics. I note a war Government has been formed with Joe Cook, Watt, and other liberals in the cabinet.\n\nThis hospital known as the Divisional Rest Station is situated on the road to Erquinghem and about ¾ of a mile from the town of Steinwerck \n\nThe chief war events of the past week as reviewed by the \"People\" are as follows:-\n\n1 Capture of Baghdad\n\n2 Relations severed between China and Germany\n\n3 Revolution in Russia\n\n4 Capture of Bapaume\n\nA truly kaleidoscopic week indeed. A week, too, that has brought us nearer to ultimate success than any week of the whole war period. Events moved with almost bewildering rapidity, every one of which is a severe and crushing blow to the enemy.\n\nThe papers did not arrive until this afternoon. Probably\n\nthe rough weather prevented the french girl coming in the morning. They are filled with a succession of more victories. The \"Express\" says they are the greatest success in the war. Peronne Chaulnes, Roye, Le Transloy and over 60 villages captured by the British. There are also great French victories. There has been a joint advance on a front of 60 miles from Monchy-au-Bois about 2 miles North of Gommecourt to Noyon, which is about 20 miles N.W. of Soissons. The depth of the advance varies from several miles up to 10 miles. Cavalry is in pursuit of the enemy north of Bapaume. The Germans burned the villages as they retreated.\n\nThe liberated inhabitants gave a joyous welcome to the French troops. As a reprisal for the burning of Bapaume a french aeroplane bombarded the town of Frankfort-on-Main in Germany and about 150 miles from the French line.\n\nThe Russians have captured Van on Lake Van and the British have had further successes on the Tigris.\n\nOrder is now restored in Russia and the new Government renewed its pledge, and will fight to the end against the enemy. Grand Duke declines the throne until elected. There is great enthusiasm among our troops and some Battalions\n\nrefused a rest, rather than desist from pursuing the huns. One third of our line is advanced.\n\nThe news of the great success delighted the patients in this hospital, and the papers were eagerly bought from the french girl who comes round every day. There was a very good concert to night in the mess tent for the patients who were able to go out, given by members of the A.M.C. I was not at it because it was too cold, but I could hear some of it in this ward. One of the heads who presided said in reference to the war, that we would soon be all back in Australia, which elected great applause.\n\nWednesday March 21.1917\n\nIt is again cold and stormy today. Last night was very rough. Those in the trenches must have a very rough time of it now.\n\nIn the day time there are two orderlies in each ward. Their duties are to clean out the ward, assisted by those patients who are able to do a little work, after breakfast every morning. They accompany the doctors on his rounds, and make a note of the treatments for each patient while the doctor marks it on the patients card which is fixed\n\nup at the head of each bed. They also bring in the food and serve it out to each patient, except to those who have their meals in the mess tent. They dress the wounds and bandage them, and administer the medicine. They have one day off each week. They come on duty about 7 o’clock. There is one orderlie on duty all night. His duties are to put out or turn down the lights every night at 9 o’clock keep an eye on those patients who are restless, or whom the doctor orders to be watched. If there is a spare bed in the ward they generally avail themselves of it in preference to sitting before the stove. They go off in the morning soon after the two orderlies come in. On the whole the orderlies are very attentive to their duties, and considerate for the patients who regard the hospital as a home. There are numerous doctors, who hold the rank of captain or major or Lieut. Colonel. There is one Lieut Colonel to each hospital, one or two majors\n\nand all the others are Captains. Each ambulance has its own transport, both motor and horse driven. There are a number of Sargents including a Farrier Sargent, and a transport Sargent.\n\nThis is the third year of the war and the 230 day. 960 days in all. The \"Mail\" reports another great allied advance, 40 more villages taken, and Arras – Bapaume road crossed. The French are marching towards St Quentin. Peronne is the most thorough example seen or imagined of the deliberate brutality of German destructiveness. The houses have been blown in by mines and furniture and everything of value removed or smashed.\n\nSince the recent sinking of the U.S.A. ships by U. boats it is assumed in America that a state of war actually exists, but Congress is the only authority capable of declaring war, and until Congress meets a state of armed neutrality will continue.\n\nThe German explanation of the recent victories is to enable the Huns to regain the offensive, and to fight where and when he wishes, and in the most favourable circumstances. Men of military age have been sent into Germany, & to the allies is left the task of feeding the \n\npeople left behind.\n\nRussia is now quiet, and rapid progress is made by the new government. Every Turk called up, as the result of the fall of Baghdad. The Sheik-al-Islam has declared a holy war and the Government has issued an irade.\n\nAnti air craft guns are now called \"archies\".\n\nSeven of the patients in this ward were discharged this afternoon.\n\nAt bed time one of the orderlies informed us that British cavalry had cut off a division of Uhlans who surrendered, and British cavalry were approaching Lille. The 10th Brigade are on the way to St. Omer for special training. It is 3 days march of about 10 miles a day. The 37 Battalion is on the way now, also the 38th.\n\nThursday March 22.1917\n\nIt is much finer to day and the sun is shining brightly. There was a heavy fall of snow last night, and the ground is all white. Early this morning the snow was still falling.\n\nThe Germans are continuing to burn villages in their retreat, & smoke can be seen as far off \n\nas the outskirts of Cambrai. The British are 6 miles beyond Bapaume, further beyond Peronne, and have engaged German outposts 4 miles beyond Sailly-\n\nSaillisel. German artillery is dumb. The new German line appears to be from Douai to Siossons passing through Cambrai, Le Catelet & La Fere. Spanish papers say it is clear the Germans evacuated because they were forced, and that it is impossible for them to hold new places, when they yielded up places that they spent two years in fortifying. \n\nThis afternoon one of our aeroplanes developed engine trouble and came down in a ploughed field near the hospital. It was opposite the hospital and flying low when I was saw it. It flew up the road, dodged a house on the farm and landed safely in a ploughed field, along side a telephone line. A crowd soon gathered round it, I amongst the number, and a lot of French boys & a few farmers. I had a good look all over it. It was the kind known as a tractor, that is with the propeller in front. The engines were of the V type with 8 cylinders. There were\n\ntwo exhaust pipes leading to the top of the planes. The planes were covered with silk. Each plane had a double covering of silk with about two inches of space between them. All the were so placed that the edge was forward so as to offer as least resistance as possible, even the exhaust pipes were flattened and placed edgewise. The propeller was made of wood and was a fine specimen of workmanship. There were two Lewis guns on board, and two seats one in front of the other and some distance apart and the occupant of each seat had control of the guns. The whole was mounted on two stout pneumatic tyred wheels and a skid behind to support the tail. Their were instruments for ascertaining the height, points of the compass, amount of oil in tanks, revolutions of engines, temperature etc. The pilot and observer were dressed in leather overcoats and bonnets lined with fur. \n\nIt is reported here that the Germans are burning Lille\n\nFriday 23 March.1917\n\nIt was cold last night, in fact freezing, and ice on the water this morning. The cold continues today, with some cold showers.\n\nThe papers report a rapid advance of our troops. They are within 6 miles of St. Quentin. The foe’s resistance stiffens at Points, but their rearguards are steadily driven from their positions. There have been successful raids, our progress continues, and another 40 villages have been liberated. There was considerable artillery activity during the day on both sides in the neighbourhood of Armentieres and Ypres. The foe continues to burn villages, sack houses, cut down orchards, poison or polute wells, carry off or destroy everything of value. Before evacuating the huns stripped the villages of all metal, and stripped the gutters & roofs of the cathedrals. \n\n24 British ships ships have been sunk last week, which is more than the previous week. I have been in doors all day reading and playing draughts. There was no pleasure in going out.\n\nI think to day is good Friday but am not sure.\n\nI am 4 months in France to day, having arrived at Le Havre on the morning of November 23rd. 1916, and have been most of the time in Houplines, Armentieres and the vicinity.\n\nIt is persistently reported here to night that the Germans are evacuating Lille. That the French were driven back 6 miles, received reinforcements, counter attacked and drove the Germans back 12 miles.\n\nSaturday March 24.1917\n\nThe sun is shining out brightly this morning, but there is a bitterly cold wind from the East. It is doing some good however, for it is a very drying wind. There was a heavy bombardment last night, and very early this morning, on our front, possibly with the object of preventing the Huns sending reinforcements from this front to the Somme.\n\nThere has been occasional bombardments during the day, and some brisk firing at enemy aeroplanes. The arrest of the Ex-czarina is reported from Petrograd. Fighting from St. Quentin to South of Arras continues during snowstorms. A hostile party entered our trenches N.E. of Arras but were driven out.\n\nThe British are very angry at the Huns trail of ruin and are eager to get at the Huns, Germany is facing starvation. A Berlin paper says that Germans are determined with a will of iron to conquer or to drag down with ourselves, if need be, half the world in one vast common XXX ruin and desolation. It looks like it, but they wont succeed in either. The British government is making another attempt to solve the Irish problem.\n\nSunday March 25.1917\n\nA fine morning but cloudy. There was very heavy bombardment on this front during the night, and at intervals during the early morning.\n\nThe gramophone was brought back to this ward last night, and it has been going up to late last night and first thing this morning.\n\nFrance has adopted the daylight saving scheme. At Eleven o’clock last night the clocks were put \nback\n forward one hour, or\n\nas the French would say \"Un heure\" This will mean getting up one hour earlier every morning, and getting all meals one hour earlier.\n\nThere is a wealthy French farmer close by whose girls provide soldiers with 2 eggs and chips and bread for 8½d. The French are better to deal with than the Belgians. The Belgians are sharks, with a few exceptions of course. The French tries to help the soldier, but the Belgians are out for money every time. And they are very numerous here, many of them being refuges, and most of them have something to sell the soldiers, generally eggs and chips. Armentieres is on the border. The people all speak French, and it is difficult to distinguish between them. But you soon find out if you go to buy anything. They inter-marry. There are also Germans or their descendants. Spies are numerous. And some have been caught and dealt with. Numbers of the inhabitants are not loyal to the country they live in, and what nationality they spring from it is difficult to say.\n\nThe French newspaper girl has not turned up to day and we have no papers. \n\nThere was a church parade in the mess tent this afternoon. It was a church of England service conducted by an A.I.F. chaplain. I attended it. There were not many at it, a little over a dozen. It was the second church parade I have been at since I have been in France.\n\nNews came in to night that the Huns are flooding the country to prevent the allies following them up.\n\nMonday March 26.1917\n\nThere were frequent showers last night, and this morning it is light rain continuously, and from all appearances will continue all day.\n\nThere are several maories in the hospital. One brought in a box gramophone to this ward this morning. It is a much better instrument than the old one, and the Maorie knows how to regulate it to the best advantage. There are many maories among the New Zealanders and they are good hands with horses and mules. Their hair is very dark, but their skin is not, and they have a very clear musical voice. They are well built, and a fine type of men, probably superior to any of the dark races, the hindoo not excepted.\n\nThe papers have not turned\n\nup to day; but it is rumoured that the French have had some more successes, having captured St. Quentin. If this is true the Germans new line is broken.\n\nTuesday March 27.1917\n\nThe weather is very changeable. Rain early last night, freezing late in the night and snowing late this morning.\n\nThe papers came to hand this morning. The \"Sunday Herald\" says Fighting continues to be more stubborn along the Cambrai, St. Quentin and La Fere line, & especially towards the South it is severe. But for the inundations created by the enemy the French claim that La Fere would be in their hands by now. The banks of the Oise has been reached N. of La Fere. This shows that the famous Moy road between La Fere and St. Quentin has been cut. There is yet however no definite indication that the \"Hindenburg\" line has now been reached, but it is probably. \n\nThe Russians have inflicted another defeat on the Turks in Persia and have occupied Kerind which the turks set on fire. Socialist members of the Reichstag paint vivid pictures of the misery of the peoples & hold the Kaiser & Chancellor guilty of the death & misery of millions.\n\nWednesday March 28.1917\n\nA fine morning after a cold night. The wind is gone down.\n\nI have got a bad cold with a headache yesterday & last night, but it is a little better to day. I think it was caused through a chill. There is a big draught comes in through the corner & through a hole in the floor when the wind is from the East. I spread a carpet over it, to close the hole. My temperature was very high 98.6 last night & 99 this morning. I was given some medicine & felt alright this afternoon.\n\nTo day I am 1 year in the army. There is very little war news in Mondays papers to hand. Artillery has been active on both sides in the neighbourhood of Ypres, and the enemy have been driven out of Beaumetz. Our troops have occupied Roisel, 7 miles east of Peronne.\n\nThere are a lot of enemy planes about today. A dud fell not very far from this hospital before dinner. It was probably a shell from some of our own antiair craft guns.\n\nThursday March 29.1917\n\nA fine day but windy, the wind is from the West. A new doctor, a major who had seen service in Gallipoli. He prescribed painting my feet,\n\ntwice a day with iodine, & a dry dressing.\n\nThe Daily Mirror of Tuesday’s date says the British attacked and took lagnicourt Village, 12 miles west of Cambrai, North of the Bapaume – Cambrai road, and captured 30 prisoners & a machine gun. There has been considerable artillery activity on both sides east of Neuville St. Vaast and Armentieres.\n\nU.S. calls up 20 more infantry regiments for the protection of property in the event of possible internal disorders. The Germans are nervous on the whole western front. The Russians are in Mosul province in Asiatic Turkey. Mackinnon is in Constantinople to organize the Turkish army.\n\nI have done a lot of reading since I have been in Hospital. I finished reading yesterday \"In the roar of the Sea\" by S. Baring Gould. It is a very tale of smuggling and adventure on the cornish coast. There is also a love story woven into the tale. The heroine is the vicar’s daughter.\n\nWednesdays papers came in this afternoon. The British Hospital ship Asturias torpedoed without warning in the English Channel about midnight on Tuesday. She was attacked while full lights and red cross signs were showing. There are 3 dead, 12 missing, and\n\n39 injured. The vessel had previously landed about 900 sick cases from Salonika. \"The whole thing happened with a rapidity that was as startling as the work of the Hun pirates was rapid & unexpected\". Savages could not be guilty of a grosser & more horrible crime. It will be remembered to the eternal disgrace of the German nation, and justice demands that the lives of the heroes be avenged. The \"Asturias was previously attacked in the Channel in Feb. 1915. There are 6 other hospital ships attacked or sunk since the war started. Two of our destroyers are sunk, one struck a mine & the other collided with a steamer.\n\nThe St. Louis, 14000 ton U.S. liner as arrived at Liverpool, having come through the \"U\" boat zone. She was armed fore & aft, & is the first to come through. British have captured 3 more villages & the French have made further important progress towards Laon. U.S. Congress meets on Monday for important war progress.\n\nFriday March 30. 1917\n\nA dull cloudy day but otherwise fine. No papers came to hand this morning. At dinner in the mess tent I heard on good\n\nauthority that the British obtained a big victory over the Turks, capturing 900 prisoners and the G.O.C. of troops in Mesopotamia. This is exceedingly good news if true.\n\nSaturday March 31.1917\n\nDull & cloudy with occasional showers. There is a cold wind from the west. This is the last day of March. Three months of the New Year gone. This time last year we all thought the war would be over before this. However we are very near the finish, and every day we are gaining more successes. In another two months, we will in all probability see the end of it, or thereabouts, & possibly before.\n\nThere must be a great congestion of traffic on the railways, for no papers have come to hand either yesterday or to day. It is very annoying seeing that the news is so important and interesting.\n\nLast night and today I had some very pleasant games of Euchre.\n\nCaptain Mahon told the orderlie that Pte. Saunderson who was in bed 29 alongside mine & was sent away to a clearing station over a week ago, had been eating some rotten food in Steinwerck and now has typhoid fever. It is to be hoped an appenedemic of Typhoid will not break out.\n\nWe were again served out with some delicious oranges this evening. I believe they came from Spain. They were blood red inside, sweet & juicy.\n\nThere was some very heavy straffing last night below Armentieres. The distant booming of big guns could be plainly heard.\n\nSunday April 1.1917\n\nVery dull & cloudy, looks like rain.\n\nYesterday I was put on light duties, by the doctor, but had no work to do. The whole of the month of March I have been in Hospital, with sore feet. This is the 972 day of the war. The war would have to go on another 4 months, to make up Kitchener’s estimate of 3 years; but I don’t think it will last that long.\n\nFriday’s papers came to hand to day. Sir Archibald Murry reports our troops advanced 15 miles from Rafa to the Wadi Ghuzze (a river) 5 miles S. of Gaza (on the Palestine coast 50 miles S.W. of Jerusalem), to cover construction of railway. Some days later they were heavily engaged with Turkish force of 20,000. Heavy losses were inflicted upon the enemy & 900 prisoners taken, including the General & the whole staff of the 53 Turkish Division. The Anzacs were also engaged, & behaved splendidly.\n\nOn the 19th the \"Alnwick Castle\"\n\nMemo for\n\nthe comforts of a Brave boy at the front wishing him God sped & a safe return home to Australia from Dorothie Edwards Grovedale Via Geelong\n\nliner was torpedoed without warning in the Atlantic, 320 miles from the nearest land & sank. The passengers & crew were abandoned. The British have captured another village 7½ miles E.S.E. of Bapaume. \n\nThis afternoon I went for a walk to Steinwerck, and on the way saw 2 observation balloons, led across a paddock to a road where they were anchored to a car with a winding engine on board and taken away to another observation post toward Niepe.\n\nMonday April 2.1917\n\nThere were several smart showers last evening and snow in the night. The ground is all white this morning. It is cold and very cloudy to day, but the snow is melting away fast. Saturdays \"Express\" says there has been sharp fighting in the British advance on Cambrai. Three more village fortresses taken, Ruyaulcourt, Sorel-le-Grand, & Fins, & prisoners taken. The Germans are making greater resistance, in obedience to the Kaiser’s command that no French village should be surrendered without a fight. German Socialists break their truce with the government & both wings of the party refuse to vote for the Budget. The demand for democratic Government is growing.\n\nThe Chancellor’s refusal to deal immediately with the question of the extension of the suffrage has provoked bitter opposition. The Socialists are numerous & are in a dangerous mood. The country is seething & bubbling. The leaven of the Russian Revolution is working in Germany. The people distrust the Government. Herr Bernstein is the Socialist leader. The suffrage question may well be the forerunner of important events in Germany, perhaps the downfall Kaiser Bill and the House of Hohenzollern. The \"Daily Mail\" says the Reichstag \"is a bogus Parliament & its sham debates have no influence upon the policy of the German Government\". I expect a rising in Germany but I doubt if it will be as successful as in Russia. The visiting doctor told us to day that the heads says \"our heavy guns are 50 to Germany’s one, and that they expect the war to finish in August.\n\nThere was a fall of snow this afternoon, and a cold wind.\n\nTuesday April 3.1917\n\nThe snow is falling fast this morning when we went to breakfast. The ground is all a white mantle of snow. At mid day the clouds cleared away and the Sun shone bright and warm, and most of the snow melted away except in hollows and sheltered places and in corners where it was blown in heaps.\n\nDuring the past few days I have\n\nlearned to play whist. It is an interesting game, and superior to Euchre.\n\nCaptain Mahone gave us a puzzle this morning. Plant 4 small trees equal distance from each other. He wants an answer in the morning.\n\nThere was a very good concert this afternoon in the mess tent given by a company drawn from various Battalions and called Periots. They borrowed a piano from the Y.C.A. in Steinwerck. The programme consisted mostly of comic songs \n\nThe doctors were present & the Colonel presided. \n\nSunday papers to hand are mostly a rehash of the weeks news. There is another raider on the Atlantic. She is a sailing ship with some form of combustion engines. She carries the Norwegian flag & shows signals of distress to attract her victims. A French barque has landed at Rio de Janeiro 200 survivors from sunken vessels off Trinidad.\n\nWednesday April 4.1917\n\nThere was some very heavy showers last night. This morning is dull & cloudy but calm. This morning there was a gas alarm, and everyone had to have his respirator or gas helmet at the ready. There was no gas, & the object was to\n\nascertain if every one was supplied.\n\nSince I have been here there has been some half dozen patients sent to the C.C.S. A few of them were certain to go to Blighty. The \"Daily Mail\" of Monday is organizing a new policy for the Allies. \"No peace and no terms with the mad house of Hohenzollern and all that it represents. Down with Prussian Junkers. Let them be pariahs and outcasts. The unclean leaper which the civilized world shuns. Let there be no hesitation in declaring this the Allied policy, and ensure the future peace of the world\".\n\nThe Russians threw off the House of Romanoffs, but the Germans have no such courage without outside help. That anointed traitor of Greece should be similarly treated, and the world would be nothing the poorer. \n\nThe Germans have destroyed St Quentin. Haig is 2½ miles away, & strong defences are reached. The French have destroyed 7 Hun planes & the British 2. The British storm . The Huns have a new long range light gun drawn by 2 horses. There is a new victory in Mesopotamia. The enemy plan is foiled & reinforced turks in full retreat. Our men are near the Russians, only 50 miles apart. Our troops now occupy positions 56 miles to the N.E. 50 miles to the North\n\nand 36 miles to the West of Baghdad.\n\nThe Atlantic raider has sunk 11 vessels. During the enemy’s withdrawal the British captured 1,239 prisoners. The total for the first 3 months of the year is 4600. There was some very heavy artillery activity yesterday and last night, but it was a long way from here.\n\nI heard this evening that Captain Wilson (Adjutant) and Major Storey are at the Rest camp on their return & also that Colonel Woods is coming back.\n\nThursday April 5.1917\n\nA fine morning. The sun is shining out brightly. There was heavy artillery activity last night south from here. I was on light duties this morning with others. It consisted in emptying the latrines. Tuesdays papers announce that as a result of President Wilson’s address to Congress on Monday night, a state of war exists between U.S.A. and Germany. This news was in a stop press wire of the late editions.\n\nThe Hindenburg line is melting away. It is assailed with great success at all points. Sweeping gains are reported by Sir Douglas Haig, whose troops are only 2 miles from St. Quentin\n\nwhile the French are within 5 miles of it from the South. The British captured 14 villages & other fortified points in a great sweep on a 10 mile front. Prisoners & 6 guns have also been captured. \n\nIn our victory at Gaza more than 700 prisoners were taken & it is estimated the Turks suffered 8,000 casualties.\n\nThe Barrow engineers are still on strike & unless & unless they have returned to work on last Tuesday drastic proceedings will be taken against them under the Munitions Act. The Leaders are liable to life sentences, & the strikers to a fine of £5 per day. They have received official warning. Their union urges the men to resume work at once, in order to avoid trouble.\n\nThis afternoon with others I was paraded for a bath. We went in a horse ambulance to the baths at Steinwerck. They are shower baths there and the water was very hot, just the thing to take the dirt off. It was the first bath I had since I was in the reinforcements camp at Steinwerck. To day I had the bath at the same place. \n\nI heard this afternoon, in fact I saw it posted up at the Ambulance orderly room that the British have defeated 45,000 Germans on the Hindenburg line.\n\nFriday April 6.1917 Good Friday\n\nA fine morning but rather cloudy.\n\nThere were a lot of enemy aeroplanes about this morning and were attacked by out planes and also our \"archies\" They beat a hasty retreat disappearing in the clouds.\n\nThe papers are full of the American news declaring U.S.A. war on Germany. The Presidents speech advise the Nation to accept Germanys challenge in the interest of liberty & the world’s peace. It outlines method of helping the Allies. An addition to the army of 500,000 men the immediate strengthening of the navy to deal with the submarines, and liberal financial help to the Allies as well as the supply of material. The speech is hailed with general rejoicing in America and has a strong moral effect on recruitment.\n\nAmericans in England are well pleased, as they are no longer \"neutrals\" which word was becoming odorous to them. America is not out for spoils and wants no material recompense for their help. The President assures the German people that America has no quarrel with them, but only\n\nwith the murderous Prussian autocrats, who have both before the war and during the war have lied and spied and plotted in America, and incited their neighbour (Mexico) against them.\n\nThe menue to day, although it is Good Friday is the same as usual, porridge & bacon for breakfast, Roast beef & rice for dinner and bully beef (ground up in the sausage machine) for tea & bread & butter. We had tea three times today We usually have soup instead of tea for dinner.\n\nI was on light duties again today. This time in the cook house. I scrubbed some tables and opened close upon 100 tins of bully beef for tea, also had a turn at the sausage machine. I was again on duty after dinner grinding biscuits for porrage.\n\nThere is an inspection of all Wards to day by eight doctors, some of them being English doctors, one a Lieut. Colonel was so deaf that he carried an instrument & put it to his ear when he wanted to hear anything. In addition to the 5 wards in this hospital there are also 7 large tents for patients making 12 wards in all. All the wards are separate buildings or tents\n\nSaturday April 7.1917\n\nA fine morning but cloudy and rather cold. There was a heavy bombardment last night and this morning. There is generally a heavy bombardment every night. Thursday night or Friday morning the Huns tried to come over at Plug st, but failed to get into our trenches.\n\nYesterday Fred McGee was returned here worse than ever. He was sent away the same way to another hospital. The orderly told me that he will be sent on to England. He is suffering from stomach troubles, and will not be any use to the army for a long time. He can only partake of very light food.\n\nThe papers to hand this morning announce that Germany is furious with U.S.A. and promise the Negroes there a separate Republic, and social equality in the vain hope of causing of causing a negro revolt. \n\nThe British admit German superiority in the air. We are constantly loosing more machines than the Germans. Our men are braver & more reckless than the Germans, & consequently take more risks. Our machines as a rule are inferior to the Germans, whose machines are\n\nand have better soaring qualities. Our latest machines, though limited in number, about equal to the enemy’s. We have a lot of obsolete planes.\n\nNine enemy aeroplanes, Berlin reports, were shot down and 2 captive balloons were shot down by german airmen. Haig reports that enemy counter attacks were a complete failure, and 6 guns were brought in.\n\nThere is great unrest in Hungary & in Bulgaria. The two Kaisers are in conference & it is believed in Germany another peace offer will be made on Easter Monday.\n\nI am to leave this ward to day, being discharged cured, and to go into the rest camp North of Steinwerck this afternoon. I will have to spend 3 nights there before getting back to my Battalion. The Battalion is back from St. Omer & I understand it is in Armentieres. On Thursday Pte. Whitelaw and Pte. Henry came from St. Omer by motor and are in this ward. They were unable to walk, and passed the Battalion on the way. The whole Brigade was at St. Omer doing extra training for street fighting.\n\nThere are 4 observation balloons up this afternoon.\n\nAll of them are close to Steinwerck.\n\nAbout 2 o’clock I got my equipment & rifle out of the store also blankets & water proof sheet, and put them together in readiness for the road. Soon after 3 all that were discharged were marched through Steinwerck to the Reinforcement Camp which is a little over a mile away. We arrived there in plenty of time for tea, and drew 2 blankets each in addition to our own, though those who had blankets were not supposed to get any.\n\nA fleet of our aeroplanes flew over the town this evening. It was the largest number of Aeroplanes that I have ever seen up at once. They carried out some manouvers in the air. There must have been about 20 machines up.\n\nLater on several of our machines went over Fritz’s lines. He kept up a hot fire and eventually set one on fire. It came down a mass of flames. The operator kept control for some time guiding the plane away from Fritz’s lines, but it eventually fell to earth a glowing mass of flame. If the men were not burned to death they were certainly killed by the fall. It was the first \n\nfirst plane that I have seen brought down.\n\nSunday April 8.1917\n\nA fine sunny morning but cold. There was a very heavy frost last night. The water in the fire bucket were covered with ice.\n\nIt being a bright morning there was a lot of aeroplane activity. Several of Fritz’s planes were over here and were heavily bombarded and also chased by our planes. They all managed to escape.\n\nAt 9 o’clock there was a parade and with 6 others I was relisted for Guard. This is a new thing at this camp. The Guard lasts for 24 hours. 2 hours on and 4 hours off. We get no fatigue or duties of any kind to morrow. The first guard goes on at 10 o’clock and the last guard finishes at 10 o’clock to morrow. There are two posts, one guard at each. I was in the second relief and went on at 12 o’clock and was relieved at 2 p.m. I go on again at 6 p.m. and relieved by the third relief at 8. I go on again 12 a.m. come of at 2. go on again at 6 & come off at 8 when I am finished. 8 hours guard and 16 hours resting out of the 124. As the weather is fine, in fact this is an ideal day, it is a \n\nvery easy job being on guard, especially so when it means resting all day to morrow.\n\nThis is Easter Sunday. I will remember it because it is such a fine day, in fact it is the best day I have experienced since I have been in France, & also because I am on guard to day.\n\nThere is great aeroplane activity today. The enemy’s planes frequently come over, and are well peppered by our archies. Their path across the sky is dotted with little balls of white smoke from our shells bursting around them in an endeavour to hit them or failing that keep them at high elevation so as to prevent them observing.\n\nI heard this evening that the Germans brought down one of our observation balloons at Bacull. It was seen in flames from here. This afternoon a lot of reinforcements came in for the 9, 10 & 11 Brigades also reinforcements for the Engineers & Pioneers.\n\nMonday April 9.1917. Easter Monday\n\nEarly this morning it commenced to rain, and\n\ndrizzling rain fell all the time I was on guard, 6 to 8. But as I stayed in the shed all the time I got practically none of it. It is a winter day and in marked contrast to the beautiful day of yesterday.\n\nI have not seen any papers yesterday or this morning, & have heard no war news at all. Yesterday the Germans shell from a long way off one of the 4 observation balloons stationed around here but failed to hit it. They succeeded in causing it to be drawn down. As I have nothing to do when I came off guard, I removed my bed from the guard hut to the reinforcements huts, remade it and turned in for a rest if not a sleep. A new guard was appointed but before they had taken over a detachment of Tommies from England, (conscripts) came into camp and took over all the guard duties of this camp.\n\nThis afternoon I had a hot bath at the Divisional baths attached to this camp – I got my towel changed. I heard today that the British had another big advance after hard fighting in the region of St. Quentin also that we lost 28 planes. \n\n \n\nTuesday April 10.1917\n\nA fine bright morning, but frosty. There was a very heavy fall of snow lasting about I hour before dark last night. This morning it was frozen hard with the frost.\n\nI packed up my blankets & put my equipment together ready for the road in case I have to march into Armentieres to day. I expect to get back to my Battalion today. With others I came away in a motor Transport to Niepe and started to walk to Armentieres but were picked up by another motor transport and taken to the outskirts of Armentieres. Then we reported at Brigade Head Quarters, then to Battalion Headquarters & from there to the Q.M. store & reported to and had dinner about 1 o’clock.\n\nMondays Daily Mail reports that Cuba has followed U.S.A. lead and declared war on Germany and can put 25,00 men in the field and also patrol transport with her war ships. Brazil owing to the sinking of some of her ships is likely to declare war on Germany. An important meeting of the cabinet is to be held to decide the case. \n\nI expected a lot of letters when I arrived and got\n\nnone. The Postal orderlie had sent them away, addressed Hospital, but I got none of them & not likely to because the name of the Hospital was not stated. They will probably be returned. It is very annoying & disappointing.\n\nPioneer Sgt. Robson has been transferred to A Company and is now platoon Sargeant, at present he is away at a school. It seems he done some good work when in the trenches. The Pioneers are now without a Sargeant and are 3 men below strength. Cunningham & Silver are both in England. They are not coming back here for they are both struck off the roll & no one has been put in Matthews place.\n\nWednesday April 11.1917\n\nA dull cloudy and cold morning. To my great surprise and delight I got a letter from my wife dated ","1":" & written from\nMerino\n Merrigum and numbered 51. She told me she got my letters written on Dec. 10 & 23 and also a post card written on christmas eve in France.\n\nYesterday the goods in the Quarter Masters store were shifted to a larger building in another st. and to day we also moved in.\n\nOn arrival there we were kept busy cleaning up. In the evening I went into a French blacksmith’s shop and saw how the French shoe horses. They put all the horses into a stock and tie them up. They tie up each foot as they shoe it. Their method is an excellent one for rough horses, but I would not be bothered with it for quiet ones.\n\nLast night in an Estaminet I saw a german pistol. A Tommie had it & sold it for 10 francs. Dirt cheap at the price for a souvenir, but I fancy their would be difficulty in getting ammunition for it.\n\nheard to night that the British have taken 11,000 prisoners at Arras, 136 machine guns and a considerable number of other guns.\n\nThursday April 12.1917\n\nThere was a very heavy fall of snow yesterday evening lasting about 2 hours. To day is showery with occasional light falls of showers. About 7.30 two shells fell in the heart of Armentieres near our store but did little damage. The Germans yesterday\n\nheavily shelled the road used by our transports when coming into Armentieres.\n\nLast night I got another letter from my wife written at Merrigum dated Feb 18 and numbered 50. I was very glad to get these last two letters, for I lost a lot of her letters through being away.\n","2":" April 13.1917\n\nA nice morning early but it soon got cloudy and cold. I swept out the office and the back yard and made things tidy. Also took some letters to Battalion Headquarters.\n\nThe Quarter Masters stores are in a big building on the corner of Rue De Moulin and another street. It is 4 stories high with another store underground. \n\nThe sign board bears this inscription\n\nDancoisne Freres\n\nTissage\n\nde Linge de Table\n\nDamasse et Ouvre\n\nGenres Panissieres\n\nForchons en tous Genres.\n\nEvery day now we hear good news of further victories on the somme & at Arras. I was down at the railway station this afternoon to load some firewood.\n\nFriday\n Saturday 14.1917\n\nA cold cloudy morning. There has been heavy snow showers in other parts of France especially where the big push is going on from Arras to Cambrai.\n\nPanama has proclaimed that it will assist U.S.A. in the defence of the canal.\n\nI received two letters from my dear wife to day written from Merrigum and dated","3":" & 13 and both numbered 49. She tells me that I have got another nephew at the Lakes, and says she did not know whether Willie had then sailed or not.\n\nThis evening I sent a \"Field Service\" Post Card to the following:- Irene Ring, B.C. Miller, K Gilmore, L. Gilmore, A. McNichols , my wife. These field service Post cards are known in the Army as \"Whizz-bangs\"\n","4":"\n Sunday April 15.1917\n\nA showery miserable day. There was a lot of artillery activity last night and this morning. \n\nThis is the 986 day of the war. The British have made more progress on the Westernfront.\n\nThe British captured two strong positions in the enemy lines N. of Vimy Ridge astride the river Souchez and progress has been made on the River Scarpe. The French have also had important gains and the enemy reports violent artillery fire.\n\nMr Lloyd George made an important speech to the American Luncheon Club. \"Strange things have happened in this war\" he said \"but there are stranger things to come, and they are coming rapidly\". The Express says \"it is the hint of the dawn of peace for the world\". Reports of peace intrigues are circulated from Sweden, Switzerland and Rome. \n\nI saw Dave McKean to night & had a couple of drinks with him. He told me that he got 16 letters all at once from Australia. A little before 8 O’clock to night our guns opened up a terrific bombardment and soon after all hands in the store got orders to stand too. Those who had no ammunition were supplied. Later we got orders that we could go to our rooms but to keep our equipment, & be ready to stand to at a moments notice. I filled in the time in writing and in addressing post cards\n\nthat I bought this evening. We were paid early this afternoon. I received 30 francs = £1-1-6.\n\nAs I write the bombardment continues with terrific intensity. We got word that Fritz is raiding our trenches at Houplines. I guess he is getting a hot time of it.\n\nThe bombardment finished about 9 O’clock. Some of our men who were on provision carts had narrow escapes from the enemy’s shells.\n","5":" April 16.1917\n\nA fine morning. The papers report more British victories. We are astride Hindenburg’s line & captured 6 fortress Villages. From last Monday to Friday morning the British captured 13,000 prisoners 285 officers and enormous bounty. At Ploegstreet (N.W. of Armentieres) a hostile raiding party came under our machine gun fire & failed to reach our trenches.\n\nThis afternoon I was in charge of the pack cellar, receiving packs from the 4 companies prior to them going into the trenches to night. I received a letter from my wife to night, dated","6":" No 52.\n\nalso a letter from Irene Ring dated","7":" To night our Lance Corporal Harrimert received his Sargeants’ stripes and will in future be our pioneer Sargeant. We expect to go into the trenches to night, or at least down to the dumps to take charge of the rations & got ready to go, but did not go.\n\nTuesday April 17.1917\n\nA dull cloudy morning with occasional light showers. There was a lot of rain last night. Sundays papers announce further victories & and todays French papers contain very good news. The French have captured 11,000 prisoners, & the English have splendid gains at Lens.\n\nBolivia has severed diplomatic relations with Germany & handed the Ambassador his passport.\n\nWednesday April 18.1917\n\nA very cold morning with occasional light flakes of snow continually falling. The British armies are at the gates of Lens and St. Quentin. Our troops have captured Lievin, an important colliery town and have passed Cite St. Pierre a suburb of Lens. The troops at St Quentin are within a \n\nfew hundred yards of the town after the village of Gricourt had been carried at the point of the bayonet.\n\n\"The Americans appeared on Sunday in official communiqués for the first time. A German report claimed that the French, British and Americans lost 17 machines in aerial engagements\". \"Express\". The front along Armentieres has been very quiet of late though almost every evening they put a few shells into the town. They put one in this evening but it was a dud & fell in the street making a big hole.\n\nThursday April 19.1917\n\nA dull cloudy morning but fine. Most of the rations are sent down in trucks to the firing line along the old electric tram line which has been repaired. The trucks are drawn by horses of our transports. \n\nTo day the war has been raging \n1000\n 900 days. I think a few months longer at the most will see the end of it, and all sides, especially the men in the trenches will be pleased.\n\nThere is good news about the war. The French have made a great offensive, together with the British they have captured 30,000 prisoners\n\nand vast amounts of material. There is a report, I cannot say if it is true, but it is persistent that the Germans are boiling down their dead to obtain the fat for making glycerine for high explosives.\n\nI have been collecting souvenirs since I came to France, especially coins. Last night I got a 5 franc piece & to night a pair of French soldiers buttons. I also saw a gold 20 franc piece called a Louis d’or but I was too poor to purchase it.\n\nFriday April 20.1917\n\nA dull cloudy day, but fine. To day 2 cooks from the Battalion are busy in the back yard making plum puddings out of biscuits and boiling them in coppers for the boys in the trenches. They will be taken down to night and warmed up to morrow. About 4 O’clock Sgt. and N.J. Jorgensen got instructions to go down to the trenches and take their blankets with them.\n\nLater the Sargeant came back for\nJorge\n C. Handcock & Allan Holland, and sent word to the transport to return the two pioneers that are there, L. Shorham and W.H. Handcock.\n\nSaturday April 21.1917\n\nSoon after 8 p.m. last night our artillery started a terrific bombardment with heavy guns which continued for nearly 2 hours constant, and intermittently throughout the night until 7 a.m. this morning. The Hun rations may be on a famine basis, but our artillery all along the western front give them plenty of food for reflection, and it is calculated not to allay their feelings or soothe their nerves.\n\nBonar Law stated in the House that the U. Boats again sink Hospital ships & in reply to questions said reprisals have already been taken, but refused to give information about future intentions.\n\nThe French Battle front is extended. Several large Hun units surrendered. Total captives were 17,000 & 75 guns. They have brought up 12 new divisions 180,000 men on the front from Soissons to Auberive to our victories. Haig reports a further capture of 228 guns. German nerves are upset by our victories. This is the 992 day of the war, the weather is fine but cloudy.\n\nSunday April 22.1917\n\nA fine bright morning. There are some enemy aeroplanes about, and our archies are constantly firing at them in order to keep them high up. Yesterday evening our artillery put over some very big shells from guns that were so far back the report could not be heard, only the screech of the\n\nof the shells through the air. During the night there was intermittent artillery activity. The papers all relate more particulars about the Germans extracting fats, for making lubricating oil & nitro glycerine from their dead, & the by products used for pig food & manure. Horrible cannibals.\n\nThere was a big service in St Pauls attended by the King and the U.S.A. Ambassador to give thanks for U.S.A. help in the war.\n\nTo day I was issued with a shirt & underpants. I received a letter from my sister dated","8":" and two from my wife Feb. 23 No 51 &","9":" No 53. Sgt. Robson returned from the school to day. He will be in A. Company. No. 1 Platoon & went into the trenches this Evening.\n","10":" 23.1917\n\nA beautiful morning & fine throughout the day. There are lot of enemy aeroplanes about & our archies are continually shelling them. After the transports came back from the dumps last night, our artillery opened up a terrific cannonade & kept it up most of the night. During the strafe last night a number of our men were killed & others wounded including Lieut. Hunter & Long.\n\nNo papers came to hand today but a wire said the Huns attacked Dover & sustained heavy losses.\n\nLater news from the trenches state that there were 9 killed and 19 wounded. Private Gilles of D .Comp. was severely wounded & Lieut. McNichol was slightly wounded but returned to duty. Lieut Long was among those wounded while Hunter was killed.\n","11":" April 24.1917\n\nA beautiful day. The sky is blue & clear, and the Sun is shining out bright & warm. Fritz put over 4 shells this morning, two of them close to the Q.M. store & two in our old billets at 11.30 square. after breakfast he put over about a dozen. He seems bent on destroying Armentieres before evacuating Houplines.\n\nThroughout the morning he continued to put in more shells, & by dinner time must have put over fully 30. Enemy aeroplanes were about all morning but very high up & just about 12 one of our planes succeeded in bringing one of Fritz’s down, admidst great excitement & rejoicing of the people who exclaimed \"Tres Bon\" very good. Bon English. The plane came down almost vertically & at an acute angle, & I believe fell in his own lines.\n\nLater news to hand says that the enemy plane fell in our lines & burst into flames before falling.\n\nThe two Germans in it jumped out, one broke his neck and the other broke both legs and was taken to Hospital. Two more enemy planes were also brought down near Steinwerck, & an enemy balloon was also brought down.\t\n","12":" April 25.1917\n\nA dull cloudy morning but fine. There is a light E. wind blowing. Last night our big guns kept up a continuous bombardment, they were a long way off, but there flashes could be seen in the sky like lightening flashing across the heavens, but owing to their distance & being fitted with silencers only a dull report could be heard.\n\nThis morning I was engaged in arranging and packing wounded and dead mens equipment & clothes to be sent to the salvage stores.\n","13":" according to German reckoning is the 1000 day of the war. It was not until a few days later that Britain joined in the great war of all history.\n\nOur Battalion came out of the trenches late this evening. They will now go in again in this sector, but will remove to another sector probably on Friday and possibly to Ploegsteert\n\nThe Battle of Arras is resumed by the British. Stiff German resistance. Good progress at some points but not at others. Over 1500 Hun prisoners. \n","14":" April 26.1917\n\nA cold dull cloudy morning. Looks like rain. There is no activity in the air this morning, but there was heavy artillery action last night. Haig reports that there was very smart aerial actions, we brought down 15 Hostile machines & 24 others were brought down out of control. We lost two.\n\nA twin engined 3 seater hostile machine was brought down & its occupants made prisoners. 40 machines in all, the greatest amount of air fighting in a single day since the start of the war. Fighting along the front is of an exceptionally fierce nature.\n","15":" April 27.1917\n\nWe were up at 6.30 this morning and had an early breakfast. The weather is dull & cloudy & looks like rain, but it has been threatening this past few days but no rains fell. At 9.30 we voted in the Australian elections both for Senate & Representatives. There are three vacancies for the Senate and one for each of the Federal electorates. My electorate was Echuca & I voted for Palmer, the Ministeralist and for 3 Ministeralists for the Senate. I believe the Ministeralists is the present Nationalist party, and best for the soldier, best for the country and will end the war the quickest.\n\nThe heaviest list of sunken ships by U. boats & mines has been just issued by the Admiralty for the week ending April 22. It contains 55 ships in all, 40 over 1600 tons & 15 under. The U. boat is a very serious menace now.\n","16":" April 28.1917\n\nA cold dull cloudy day. We were up at 6 a.m. this morning, folded our blankets and made other preparations for moving out about 9 a.m. for I believe a place that was once a village but now a mass of ruins called Ploegsteert in Belgium. \n\nI filled \n\nAbout 9.30 we moved off & partly rode & partly marched to Ploegsteert arriving there before 12 O’clock. We set up the Q.M. store in some old houses that are badly knocked about by shells. The road is very dangerous in places & there are sign boards up to that effect. I fitted up a room for Mr Narick Q.M. for the combined office of bedroom & office, & then cleaned out a room upstairs for myself. There are no civilians living in the houses about here though quite close I saw some farmers working on the lands. There are big guns roundabout & they are incessantly belching forth shells at the enemy. Between the trenches & our stores there is a ridge of hills\n\nSunday April 29.1917\n\nYesterday evening it turned hot and sultry and it is again very close to day. Our stores is surrounded by Batteries, and they kept up an intermittent fire all night and early this morning. I saw some Belgian soldiers last evening. They are dressed different to the French their uniform being dark blue while that of the French is steel grey, or perhaps it can be better described as a blue grey.\n\nThere was a lot of cleaning up to do this morning in order to make the rooms fit for receiving the stores which the A.S.C. delivered before dinner. Our own transports delivered the coal and coke & charcoal.\n\nOur issue of rations are exceptionally good during the past few months. In addition to the issue of tobacco, we get an issue of oranges several times a week which are much appreciated. As their are no civilians living about here we do not get any newspapers, which is a drawback. I am told that the billets down at the trenches are carved out of the ridge of hills running parallel to the trenches & are something marvellous, & are absolutely shell proof, but the trenches are a very hot place\n\nThis afternoon I received a new tunic and a new pair of trousers (pants). I removed my badges from the old tunic & put them on the new one, also sewed on new colours.\n\nMonday April 30.1917\n\nA beautiful spring morning. The weather is idea and warm, in fact some days it is rather too warm after a long cold winter.\n\nThere was constant artillery activity last night and about 4 a.m. there was a terrific bombardment from the Batteries all around us, which shook the house, a brick one, all over, and when at regular intervals the big guns went off it made the floor jump, & violently shook me in bed. There were a lot of aeroplanes about this morning, & I saw one (the enemies) brought down by our archies & a battle plane soon after breakfast. Fritz raided the 39 last night & inflicted some casualties, and the 37 had to be in readiness to stand to. Fritz suffered very severely. I saw a squadron of our aeroplanes, large & small fly over our billet in battle formation. They made a hum like a hive \n\nof bees in the air.\n\nSeveral duds fell around here to day & one H.E. shell exploded behind the kitchen. I finished reading a book called \"A Son of the Sea\" a magnificent story of Life & Adventure in the British Navy by Beverley Keat & Victor Darning. It is of absorbing & trilling interest from start to finish. No 342. The Boys friend Library.\n\nTuesday May 1.1917\n\nA beautiful bright spring morning. There was lot of artillery activity last night and this morning Fritz shelled one of our batteries for a long time before breakfast.\n\nFour months of the year have flown. Time is speeding on and every day our position is getting stronger and that of the enemy weaker. It seems to me that our artillery is only playing with Fritz for time, like a cat with a mouse, and when the opportune time comes will wipe him out. The weather is so beautiful that it seems a pity that there should be a war on. This part of Belgium is hilly & there is a wood along the ridge of hills, and I am told that it is the King of Belgiums hunting grounds. The ridge N. of us is known as Hill 6.\n\nThe wind was favourable for a gas attack & as the Huns were observed getting their gas cylinders ready we were warned to sleep with our respirators beside us in readiness.\n","17":"\n\nA beautiful morning, but there is a haziness in the air which makes visibility not so wide & clear as our airmen would like. Our Batteries are continually shifting their position & it is well, for Fritz has been reaching for one with H.E. shells, dropping them in a line parallel to our store, & on the old battery site. Up to 10 O’clock he must have put over 150 shells, a large percentage \"duds\", and all for nothing so far, and costing the enemy over £1000 for shells. At the time of writing he is still shelling, schrapnel from the bursting shells coming quite close to our billets. When I was shaving I saw a company of soldiers narrowly escape being hit with a shell. It burst in front of them, they ran across, when a \"dud\" fell behind them.\n\nOther companies made a wide detour. The concussion from the bursting shells shake our stores & rooms.\n\nI heard last night the Jack Brake is in the 30 artillery near here.\n\nThis evening I examined the shell holes made by Fritz this morning & saw hundreds of shell fragments lying about. I recovered a few for souvenirs. A Tommy was killed about 10 chains from our stores by shells this morning.\n\nHis head was frightfully mangled. Others were killed & injured elsewhere. A few chains down the street from here there is a small Belgian church severely damaged by shell fire, & all the interior fittings have been destroyed or removed. A school across the road is also badly damaged.\n","18":" May 3.1917\n\nA fine morning. Last night and again this morning there was artillery actions by our Batteries at intervals but I did not hear much of it, for I slept very soundly. I generally sleep well when there is a bombardment on unless it is very violent, or shells bursting close. Fritz again put over some shells and \"duds\" this morning.\n\nThis morning two anti-aircraft guns mounted on motor lorries arrived and set up alongside our cook house, and started shelling German planes. The concussion brought down the plaster & dirt from the ceiling & the walls in the cook house. The shells there fired were nearly 3 in in diameter & some of them were High Explosive, H.E. After dinner they fired another volley at a hun plane, packed up & departed much to the satisfaction of our cook.\n\nWe were paid to day by Lieut. Aitkins. I received 15 francs = 11\/- in English. The frank has slightly increased in value, which is a good sign. Formerly 30 francs equalled £1-1-6 now it equals £1-2-0. \n\nAll men were deducted 6d. to day for barrack damage at Lark Hill, Salisbury Plain. There was much dissatisfaction over it. We want to know how they arrived at the estimate & why they were so late in presenting it, also when was the assessment made, if when we left, the account was not presented at once, & if not then how do they know the damage was caused by the 37 Battalion. \n\nI saw some mosquitoes a few nights ago, the first I have seen since I left Victoria. There are only a few, & not very troublesome, but they are about every night.\n","19":" May 4.1917\n\nYesterday evening I went down to the 30 Battery and saw Jack Brake, He is now a first Lieutenant in the Field Artillery. I had a long talk with him & stayed until after 10 O’clock. He is in charge of a Battery of 4 guns 18 pounders, and he showed me the workings of the guns, the timing of the fuse the method of finding the range, and the sighting. It is all very interesting work. He has been shelled out several times & has had to shift his\n\nBatteries from time to time. The batteries are well screened & it is impossible to a casual observer to locate them. They have iron & concrete protection, & are often situated in old houses.\n\nTo day is very hot, or at least we feel it hot so soon after the cold weather.\n\nI went down with the coal transports this morning to the mouth of the catacombs. This morning is very quiet, the archies again set up alongside our kitchen, but left at dinner time without firing a shot. \n\nI slept in this morning and did not get up until 9 O’clock. As this is a danger zone, the A.S.C. has ceased to deliver the rations here & yesterday & to day our own transports have to bring it as well as distribute it to the companies in the trenches. We are to move from here tomorrow to Niepe as this is considered a very dangerous spot for the stores. \n\nThe Huns have sunk an Australian transport. All hands were saved & the Anzacs on board her \"Ballarat\" behaved with great heroism recalling the \"Birkenhead\".\n\nThis evening I read over a lot of old letters from my dear wife. I kept a few and had to reluctantly burn the rest to make room.\n","20":" May 5.1917\n\nA fine morning but rather warm.\n\nI was up early this morning; and packed up my own things & Mr. Nariks. About 9.30 we started off for Niepe. Our billets & stores there we found to be very dirty & we had a lot of work in cleaning them. I had dinner in a French house, & paid 9d for it. There are a lot of disreputable people about here and dirty children, mostly Belgian refuges. The French people are all right. The Belgians I have met here can speak French but cannot read it, only their own language, Flemish. Unlike Ploegsteert, which has no civilians, Nieppe is full of people and there are numerous shops and estaminets.\n\nWe made our beds in a dirty old hay loft, over the barn which we use for a store. There were close upon 20 of us in the loft & a few down below in the barn. Several Battalions have there Q.M. stores, & we being the last to come in of course got the worst place.\n","21":" May 6.1917\n\nThere is a cold wind from the East this morning, but the sky is clear. Fritz put over 20 shells after 12 O’clock last night in search of our guns close to here, & our artillery severely bombarded him for\n\nseveral hours by way of reprisal.\n\nMany of the little boys in France have uniforms made out of khakE\n","22":" May 7.1917\n\nA nice fine warm day. There was very little bombardment last night. I had a walk around the town last night with C. Handcock.\n\nI got a copy of the \"Argus\" from Merrigum today, dated","23":" \nLast\n To night there was a gas attack in the Armentieres sector and we all had to get out our gas respirators & wear them at the alert, & go to bed with them by our side. From 8 O’clock until near mid night our artillery in this sector kept up a tremendous straff. Fortunately the gas did not reach here. The local people were greatly excited & made for their houses.\n","24":" May 8.1917\n\nIt was raining this morning early & continued to about 10.30. I saw Charlie Bayley, Tailor of Shepparton. He came in this morning to the\n\nstore for colour badges for 40 reinforcements. They had to march from Boulogne to Etapes & thence to Baileau He was 12 weeks on the water, & was chased by sub marines and landed in England in January. When he was at Seymour he was Depot Quarter Master, now he is only a lance corporal. He came into camp the same day with me from Shepparton.\n","25":" May 9.1917\n\nA fine morning. The sun is shining brightly. Last night was very quiet, scarcely any straffing.\n\nThere have been parcels and letters coming in almost every day lately, but I have got none so far. I may get some to day.\n\nI had a letter from my wife today dated","26":" No 54. and also one from B.C.Miller of","27":"\n\nI saw in the \"Daily News\" this evening that the Ministerialists Mr Hughes party, have had sweeping majorities both in the Senate & House of Representatives. This is good news and the boys are glad. One Ministerialist, Mr Glyn is probably beaten.\n","28":"\n\nA nice warm day, inclined to be hot at mid day.\n\n Alice Miller Kathleen Miller, & my wife.\n\nA reassuring statement has been made by Lord Devenport on the food situation. Meatless days will be abolished. There is a satisfactory margin of wheat without compulsory rationing. Our supplies of fat are better this year than last.\n\nThe Germans retake Fresnoy after furious fighting.\n\nI sent an \"Anzac Bulletin\" to B.C. Miller also one to H.G. Kittson, both dated","29":"\n\nYesterday our transports had an exciting time delivering the rations at Ploegsteert. Shells were dropping quite close to them. The huns were shelling the road, but no one was hit. I spent the afternoon writing letters & post cards. In the evening I went out for a walk & bough a book on French price 1 Frank.\n","30":" May 11.1917\n\nTo day is inclined to be close and muggy. Last night was very quiet in this sector. To day is the 1012 day of the war and it is far from being finished. Sometimes I entertain doubts about being back in time for\n\nnext Christmas, but am living in hopes. I entertain no doubt about the war being over before then, but it will take some time for us to get away, there are so many thousands of Australians in France. \n\nI received a letter from my dear wife today, dated","31":" & No. 55. She told me she received 4 letters & cards also the cushion cover & table centre I got sent away from Armentieres by the French shopkeeper through the civil P.offfice. It was very nice to know she got them safely. After dinner I went with the transports to deliver the rations at the Catacombs Ploegsteert, Belgium. The journey was uneventful but we saw several places where the huns had been shelling the road this morning.\n","32":" May 12.1917\n\nA hot close muggy morning. Last night it was very quiet, but there is some artillery activity in the region of Ploegsteert this morning. Probably Fritz is shelling our roads. There is also some aerial activity, our archies are occasionally shelling Fritz’s Planes here in order to keep them up & prevent them observing. There are also a lot of our planes about. The mail goes out to day & another on the","33":" of this month.\n\nSunday May 13.1917\n\nIt was cool in the morning but very hot after 11 am. There is some artillery activity S. of Armentieres, to day. I can hear the boom of the guns. I put a handle in an this morning for the butcher. There was a little rain about 3 O’cLock but hot & close again in the evening.\n\nThere has been a new man put in the pioneers named J Hughes a Plumber in place of C. Cunningham now in England. Sgt. Hammett was in this evening, and left orders that the Pioneers are to go back to the trenches, this time to bury the dead. Our Battalion is to go in shortly, perhaps to morrow\n\nInternal affairs are far from satisfactory in Russia. The Admiralty assures us that U. boat menace is well under control. The Italians have sunk 13 submarines of Austria in 3 weeks. The Huns are again using Flamenwerfer (Liquid fire) on the W. front.\n\nThe church in this town is badly damage with Hun shells. I have a post card view of it & several other place in this town & also Pont de Nieppe\n\nMonday May 14.1917\n\nThere were several heavy showers last night. It is very close and muggy today. I was at a service of song in the Y.M.C.A. last night. There tent is alongside the damaged church.\n\nThere was a good deal of aerial activity to day.\n\nTuesday May 15.1917\n\nA cool cloudy day. I was in Armentieres this morning helping to load coal. As no vehicles are allowed over the Bridge at Pont de Nieppe, we had to come back by another route through . A L’Epinette pass by our transports billet and by the Nieppe railway station to our store.\n\nA Battalion of New Zealanders camped to day in a paddock along side of us. There are 7 fine milking cows out in a little grass paddock near by. It is the first time that I have seen them out of their stalls.\n\nI wrote an article on France for one of the men in the Transports last night & will finish it to day.\n\n Hambrook.\n","34":" May 16.1917\n\nA cool cloudy day. I was busy this morning bagging coal & charcoal for the trenches. Things are very quiet on this front at present.\n\nW.H. Handcock was sent to the front yesterday to help N. J. Jorgensen & Sgt. Hammett who were the only pioneers there. The others are here in the store. There was a lot of rain\n\nthis evening and to night.\n\nThursday May 17.1917\n\nA cloudy wet morning. There is a decided change in the weather, & it has all appearance of continuing showery for some time.\n\nThere was some artillery activity last night on the right of Ploegsteert. \n\nThe German Chancellor has delivered his speech in the R. There is very little in it, but many high sounding words and phrases, and offers a separate peace to Russia on German terms couched in vague language. He declares Germany’s peace terms to France & England remain the same as usual. \n\nMotto of the \"Daily Mail Over-Seas Edition\"\n\n\"As cold water to a thirsty soul, so is good news from a far country\" Proverbs, chap. XXV, V.25.\n\n"}}