{"Document Name":{"0":"Diary_0109","1":"Diary_0109","2":"Diary_0109","3":"Diary_0109","4":"Diary_0109","5":"Diary_0109","6":"Diary_0109","7":"Diary_0109","8":"Diary_0109","9":"Diary_0109","10":"Diary_0109","11":"Diary_0109","12":"Diary_0109","13":"Diary_0109","14":"Diary_0109","15":"Diary_0109","16":"Diary_0109","17":"Diary_0109","18":"Diary_0109","19":"Diary_0109","20":"Diary_0109","21":"Diary_0109","22":"Diary_0109","23":"Diary_0109","24":"Diary_0109","25":"Diary_0109","26":"Diary_0109","27":"Diary_0109","28":"Diary_0109","29":"Diary_0109","30":"Diary_0109","31":"Diary_0109","32":"Diary_0109","33":"Diary_0109","34":"Diary_0109","35":"Diary_0109","36":"Diary_0109","37":"Diary_0109","38":"Diary_0109","39":"Diary_0109","40":"Diary_0109","41":"Diary_0109","42":"Diary_0109","43":"Diary_0109","44":"Diary_0109","45":"Diary_0109","46":"Diary_0109","47":"Diary_0109","48":"Diary_0109","49":"Diary_0109","50":"Diary_0109","51":"Diary_0109","52":"Diary_0109","53":"Diary_0109","54":"Diary_0109","55":"Diary_0109","56":"Diary_0109","57":"Diary_0109","58":"Diary_0109"},"Date":{"0":"unknown","1":1659.0,"2":1660.0,"3":1661.0,"4":1662.0,"5":1663.0,"6":1664.0,"7":1665.0,"8":1666.0,"9":1667.0,"10":1668.0,"11":1669.0,"12":1670.0,"13":1671.0,"14":1672.0,"15":1673.0,"16":1674.0,"17":1675.0,"18":1831.0,"19":1832.0,"20":1833.0,"21":1834.0,"22":1835.0,"23":1836.0,"24":1837.0,"25":1863.0,"26":1924.0,"27":1925.0,"28":1931.0,"29":1932.0,"30":1933.0,"31":1934.0,"32":1935.0,"33":1936.0,"34":1937.0,"35":1938.0,"36":1939.0,"37":1940.0,"38":1941.0,"39":1942.0,"40":1943.0,"41":1944.0,"42":1945.0,"43":1946.0,"44":1947.0,"45":1948.0,"46":1949.0,"47":1950.0,"48":1951.0,"49":1953.0,"50":1984.0,"51":1985.0,"52":1986.0,"53":1987.0,"54":1988.0,"55":1989.0,"56":1990.0,"57":1991.0,"58":1992.0},"Entry":{"0":"\n\n","1":"\n\nOn Guard until 4 P\n","2":"\n\nDrill in morning Finished putting up a tent at Head 2 in afternoon\n","3":"\n\nDull fornoon Changed a pair of Boots afternoon\n","4":"\n\nAm supposed to be in the “soft” company here but\n\nthey keep us on the move when we are drilling It only lasts for about 2 hours in the morning as we have nearly a mile of a march to the parade ground Volunteers were called for a Signiling School this afternoon so I fell out. It is really swinging the lead in a way as it takes 12 weeks to go through the\n\nschool I believe. Spent afternoon putting part of hit in & drawing some extra clothing \n","5":"\n\nWent to parade ground but Majr Young sent us back to camp & inspected our Kits. Went through Gass Chamber in Afternoon Some Cow stole my riding trousers yesterday. Should not have him so vain on leave & would\n\nhave him 38\/6 in pocket. Do not feel up to much tonight\n","6":"\n\nWent on Sick Parade & was much surprised when to Dr sayed “Hospital for you” My temptr was just over 100 ° & that is the great thing in the Army If you have a temptr you must be sick if \nyou\n it is normal you are not It was 8 AM when \n\nI went to the Dr. Had to put our stuff away & be ready for the ambulance by 9.30. It did not turn up until about 11. Went to No 1 Command waited some more. Then went on to Hospital did another wait untill it suited a Dr to look at us. Then we were told which Ward to go to No 19 It was 1.25 PM when I was shown my\n\nbed & was able to lie down. It was a long time before I got a bath & was able to get to bed properly but this could not be helped as the place is over full & I am in a Marque one of two being used as overflows for this one Ward & I believe some of the other wards also have Marques. It is all on account of Spanish Influenza\n\nnot a very fill complaint\n\nIt \nwas\n is not more than 3 miles from the camp I was in to here & yet we were 5½ hours from the time we went sick until we were shown our beds \n\nThis is one of the worst pieces of management I have struck But to show we are not neglected, I had to give my full particulars 4 times & 2 or 3 copies were made each time \n\nJune \n","7":"\n\nLike some other Hospitals I have been in. They start early about 5.30 Temptr you have just about dozed of again when they make your bed another respite & you have to wash Then a good wait &\n\nbreakfast. Sayed in bed all day.\n","8":"\n\nFeel \nt\n a bit better today. Had\n\nFish & Rice for dinner the first meal since Friday night. Only Milk \n&\n Supe & Tea. Got up this afternoon. \n&\n The Nurse brought us some books so have something to read – one of O. Henrys\n","9":"\n\nNothing fresh \n","10":"\n\nAs usual A good lecture on Panama Canal \nI\n in YMCA stayed \n\nto it & in consequence got in late 7 oclock is the time never gave it a thought but as there was no one to stop me coming in it made no difference\n","11":"\n\nGot 13 letters mostely Aussie & not very old – mostely April.\n","12":"\n\nDrew my Clothing\n\n& was turned out on the cold world At least on the world it was not cold \nWent\n Walked to Sandhill Camp & went through the form of Reporting Back Got Blankets & settled down in the Hut once more\n","13":"\n\nWas put on as Hut Guard ","14":"\n went to Sutton Veny \n\n& found a lot of my old mates who have not been to France Drew £ 2 from C.S Bank in Warminster Got my Photos they are Rotten\n","15":"\n\nWalked over to S Veny again\n","16":"\n\nStill Hut Guard\n\nT\n","17":"\n\nHut Guard A lecture by Trevour a YM man who was on the Beltana, About what the Ym would do for you on leave\n","18":"\n\nStill Hut Guard. Walked to Sutton V & saw some of my old Palls.\n","19":"\n\nSports at Sutton V. Had the\n\nafrenoon of to attend them. Hall 2 I went to a concert afterwards\n","20":"\n\n Still Hut Orderley. Warned to be on parade tomorrow for Overall Kit inspection\n","21":"\n\nHave had a bit of a cough all week so went sick this morning Got some stuff for \n\nit. Went to Sutton V after dinner. Hall & I walked to Warminister & went to pictures. Stayed in Training Camp for the night\n","22":"\n\nStayed in Training Camp all day. It is a change to be with mates that one knows well\n","23":"\n\nOn paraide\n\ndrew Oversee Kit. Payed. Leave for France tomorrow. Walked to Sutton V & sayed goodbye to my mates. Got very little sleep as half the Hut were drunk\n","24":"\n\nWent to the Dr this morning as I have a bit of a cough\n\nSee Book ","25":"\n","26":"\n\nContinued from book No ","27":"\n 5\n","28":"\n\nA lecture Life of Nelson by an Oficer Interesting Passed 3 little sailing boats a long way off\n","29":"\n\nA nice cool breeze. Usual classes Major Paterson was on the Mendelson theory of X breeding\n","30":"\n\nPassed a fair sized Steamer is about all that happened. Our deck won Tug of War Lecture on Palestine in evening could not get a a good place. what I did hear was not interesting. Medical examination 2nd on the trip\n","31":"\n\nUsual services extra hot. Ceylon showed up early in afternoon & we went through the Breakwater at dusk. A shower of \n\nrain just after we droped anchor coold the air slightly\n\nMonday 14th\n\n8 Barges were brought alongside about 8 to take us ashore. It was a slow job getting on board & very hot trip to the landing about ½ a mile First thing was to look for a cool drink. A native took us in hand, but did not produce the drinks as cureo selling was his game. By being sterne we got the drinks & left the cureos. Then went to \n\nthe YM bought a bunch of bananas for 1\/- about 3 to 4 doz 5 of us finished & several cocoanuts & Pineapples Then went for a tram ride & took Garries on through some gardens When the niggers get tired & want to go slow they tell you the names of the trees etc. Went to a temple & one chap got quite a start when the nigger wanted to take his boots of before he inside Had ice creams Tea copious drinks & got back loaded with \n\nfruit Paid 6d per head for a boat instead of waiting for the Barge It is quite a town buildings are very showey even the native ones are quite decent. The niggers are rather a widdy lot but clean Saw very few whites\n\nTuesday 15th\n\nWas put on picquet on the gangway to stop chaps going of for grog coming on 9 -11 & 3 to 5 the man who should\n\nhave called me did not do it so missed the 3 to 5 turn but happened to be there before the Sarg came around about 5 30 Rained heavily about midnight hunting a lot of them of the mess deck & it was some hot \non the mess deck\n with a large number sleeping there.\n\nThe hospital is full drink & heat did not mix well\n\nThey are slow getting the coal on & very quiet about it for niggers \n\nA lot of the lads have been enjoying \n\nthemselves swiming about the coal barges The water is not very clean. A lot of them got on a niggers boat & capsized it but they put it right for him again. Rather a dreary hot sort of a day to put in every one is keen to be on the move.\n","32":"\n 16\n\nCoaling finished some time last night & we started about 6.30 When properly outside & the Pilot had left a Nigger was found asleep in a \n\nbunker. As there were some catamarans about some wanted to throw him overboard & let them pick him up. The Catermarans were not on. One cannot blame them as they are very frail & little crafts We had to turn back & a boat came out for him. It is much cooler now we are on the move. Our deck got","33":" prize for being the cleanest & one of our Mess orderlies chucked up the job a mean trick\n","34":"\n\nCap Kelly finished \n\nhis lecture on Palestine. Had a fair possie so sat it out. It was hard as he is a very poor speaker. Deck Sports \n","35":" (Good)","36":"\n\nBad fish for breakfast so did without Eggs were supplied but were left untill dinner. Much growling. The sea is particularly smooth & gives the impresion that we are going very slowly another growl have done 17 miles more than yesterday\n","37":"\n\nNo thrills\n","38":"\n\nRained this afternoon cooled the air a bit. A boat has showed up on our near side flank otherwise the Port beam. It is our chief excitement. The usual cheerefull lot said it would pass us in a few hours but it has been about the same place all day. In fact the same boat was sayed to pass us 2 days ago.\n\nPadre lectured on The Microscope Band at night Usual services\n","39":"\n\nSports. Band & Fancy dress Ball. Some Rain\n","40":"\n\nMuch cooler Nearly all hands slept down stairs last night. 41 table came allmost to blows about the Peace conference\n","41":"\n\nThe last Agriculture Lecture today. We seem to have lost the boat that has been in sight the last few days\n","42":"\n\nGot under\n\na blanket last night first time for some weeks Much cooler today\n\nThe troops are making more noise than ever as they get near home Put on extra clothes – sox –\n","43":"\n\nAnzac day Holmston sent us a congratulatory Wireless – also one from the Mution workers on the Kunsh \nCh\n Concert in evening. Not a great success as it was a bit windy\n","44":" 26thj\n\nThere is quite a swell on this evening & we are rooling about as much as any time on the trip Am on Picquet. The fresh water tap forward is my post. The only tap I know is at out table so am doing my job well Religion is the main subject under discusion to night, judging from the language the opponents know more of blasphemy\n","45":" Rotenest Isle\n\nwas sighted about 12 noon & by about 2 we anchored of Freemantle The W.A. got there bags out & gave there hammocks Etc in The Dr came on & spent about 2 hours on a farcical inspection put a thermometer in each mouth & eventually about 7 PM it was given out than no one was to land & the W.A. are to do 7 days quarantine One more case of the rotten incompitence & incapacity of the army & Gov officials generally From here about1 mile out Freemantle does not look much\n","46":"\n\nAbout 1 PM the W.A. went off on an old punt. It was showery & looked a miserable turn out for men returning to there homes. We put on some meat & a lot of water & moved out about 10 PM. The Red X & YM sent some cases of very good apples on for us We hear the WA had a great reception ready for us. But I doubt it as the 7 days quarantine seems to be a fixed regulation.\n","47":"\n\nThis has\n\nbeen our roughest day so far. It is not bad. Headed across the Bight tonight supposed to be calling at Adelaide. Have enjoyed some W.A. papers very much\n","48":"\n\nHad the Portholes closed last night about the first time. A fair sea running but not much wind\n","49":"\n\nSea smother to day an impromture Concert last night Bean lectured (Wed)\n\non Australia not very bright. Lost","50":" at Poker first time I have played for money in the army. Have been playing a good deal of Crib lately. Our temperatures are taken daily & we go through a fumigation\n","51":"\n\nHave sliped a day some of above should bee put in here. Each day is so much alike that one loses count.\n","52":"\n\nKangaroo Isle sighted about 10 & we are now \n\nabrest of its Wind (12-30) Like most of our coast it is an uninteresting looking place. Anchored at 11 PM at Semiphore Not much of a place to look at\n","53":"\n\nThe Port Dr came on & looked us over. The S.A then taken of in a decent tug. Apples were sent on board Colliers were tied on each side & in the intervels between “Smokos” a little coal was put on board. Being Sunday I heard the men got 5\/- per hour Puled the anchor up at 10 PM & made another start. Played Poker until midnight won 1\/11\n","54":"\n\nA beautiful day. But then I prefer the air on this coast to any where else I have been The sea is like a harbour little white capped ripples a shade darker blue than the sky. The coast is in sight most of the time does not look inviteing – a hard careless sort of coast – like its inhabitants Victorians & Tasmanians paid today. Band took up a colection in aid of its self Gambling in full swing\n","55":"\n\nClose to land\n\nthis morning – Cape Otway Ringbarked hills with green grass & odd patches of cultivation. Went through heads & anchored about 12 midday. Went through the Dr farce & went on up the harbour in the evening Anchored off Port Melbourne for the night\n","56":"\n\nRivalie at 5 tied up about 7 & soon after the Vic got of & were taken away per Motor After a fair delay We could get on the wharf if so inclined\n\nbut could go no further. Traded some stones & pulled out about 1-30 The Red cross put some Dailey Papers on also Top Cigs Matches - - Chocolate Tined fruit – Apples & jam Not a great deal for each man but very good what there was of it. It was a cloudy day & rained at times All the little delays are very irritating but feel quite satisfied tonight being on the last run. Wine alloted to new tables am on the opposite side of same deck.\n","57":"\n\nThe Grim Grey Coast in sight all day Paid £ 5=0.0 Passed some shipping calm bright day a good deal of gambling tonight\n","58":"\n\nThis is \nThe Day\n Have put our Hammocks & Blankets away. Chops for Breakfast\n\n1.30. Just picked up the Pilot & will turn in at the Heads presently. So the \n\nadventure is over. Two years ago every thing seemed new one did not know just what to expect – now it is all old.\n\nHave been quite close to shore for about an hour Houses thick in places as if they were pushed over from the city a big cemetny \nly\n just like a cabbage patch. Sea calm weather beautifull Picked up the Quack soon after 2 PM & had the usual. A\n\nTug from the Comfort Fund met us at the Heads with Band & greetings. Issued with passes from 2 to 4.30 Tied up at Wooloomooloo Wharf & got off at 4.30. Motored to Anzac Buffet & was met by most of the family. The Red X supplied tea & real cake. Then motored to East Hills. Decorated with Flags. the fatted calf was \n\nbubbling in the Pot Realized dimly that I was a hero.\n\n"}}