{"Document Name":{"0":"Diary_0368","1":"Diary_0368","2":"Diary_0368","3":"Diary_0368","4":"Diary_0368","5":"Diary_0368","6":"Diary_0368","7":"Diary_0368","8":"Diary_0368","9":"Diary_0368","10":"Diary_0368","11":"Diary_0368","12":"Diary_0368","13":"Diary_0368","14":"Diary_0368","15":"Diary_0368","16":"Diary_0368","17":"Diary_0368","18":"Diary_0368","19":"Diary_0368","20":"Diary_0368","21":"Diary_0368","22":"Diary_0368","23":"Diary_0368","24":"Diary_0368","25":"Diary_0368","26":"Diary_0368","27":"Diary_0368","28":"Diary_0368","29":"Diary_0368","30":"Diary_0368","31":"Diary_0368","32":"Diary_0368","33":"Diary_0368","34":"Diary_0368","35":"Diary_0368","36":"Diary_0368","37":"Diary_0368","38":"Diary_0368","39":"Diary_0368","40":"Diary_0368","41":"Diary_0368","42":"Diary_0368","43":"Diary_0368","44":"Diary_0368","45":"Diary_0368","46":"Diary_0368","47":"Diary_0368","48":"Diary_0368","49":"Diary_0368","50":"Diary_0368","51":"Diary_0368","52":"Diary_0368","53":"Diary_0368","54":"Diary_0368","55":"Diary_0368","56":"Diary_0368","57":"Diary_0368","58":"Diary_0368","59":"Diary_0368","60":"Diary_0368","61":"Diary_0368","62":"Diary_0368","63":"Diary_0368","64":"Diary_0368","65":"Diary_0368","66":"Diary_0368","67":"Diary_0368","68":"Diary_0368","69":"Diary_0368","70":"Diary_0368","71":"Diary_0368","72":"Diary_0368","73":"Diary_0368","74":"Diary_0368","75":"Diary_0368","76":"Diary_0368","77":"Diary_0368","78":"Diary_0368","79":"Diary_0368","80":"Diary_0368","81":"Diary_0368","82":"Diary_0368","83":"Diary_0368","84":"Diary_0368","85":"Diary_0368","86":"Diary_0368","87":"Diary_0368","88":"Diary_0368","89":"Diary_0368","90":"Diary_0368","91":"Diary_0368","92":"Diary_0368","93":"Diary_0368","94":"Diary_0368","95":"Diary_0368","96":"Diary_0368","97":"Diary_0368"},"Date":{"0":"unknown","1":1054.0,"2":1055.0,"3":1056.0,"4":1057.0,"5":1058.0,"6":1059.0,"7":1060.0,"8":1061.0,"9":1062.0,"10":1063.0,"11":1064.0,"12":1065.0,"13":1066.0,"14":1067.0,"15":1068.0,"16":1069.0,"17":1070.0,"18":1071.0,"19":1072.0,"20":1073.0,"21":1074.0,"22":1075.0,"23":1076.0,"24":1077.0,"25":1078.0,"26":1079.0,"27":1080.0,"28":1081.0,"29":1082.0,"30":1083.0,"31":1085.0,"32":1086.0,"33":1087.0,"34":1088.0,"35":1089.0,"36":1090.0,"37":1091.0,"38":1092.0,"39":1093.0,"40":1094.0,"41":1105.0,"42":1106.0,"43":1108.0,"44":1109.0,"45":1110.0,"46":1111.0,"47":1112.0,"48":1113.0,"49":1114.0,"50":1115.0,"51":1116.0,"52":1117.0,"53":1118.0,"54":1119.0,"55":1120.0,"56":1121.0,"57":1122.0,"58":1123.0,"59":1124.0,"60":1125.0,"61":1126.0,"62":1127.0,"63":1130.0,"64":1131.0,"65":1132.0,"66":1133.0,"67":1134.0,"68":1135.0,"69":1136.0,"70":1159.0,"71":1160.0,"72":1166.0,"73":1167.0,"74":1169.0,"75":1170.0,"76":1171.0,"77":1192.0,"78":1193.0,"79":1194.0,"80":1195.0,"81":1197.0,"82":1198.0,"83":1199.0,"84":1210.0,"85":1211.0,"86":1214.0,"87":1215.0,"88":1216.0,"89":1217.0,"90":1218.0,"91":1219.0,"92":1220.0,"93":1227.0,"94":1231.0,"95":1232.0,"96":1233.0,"97":1242.0},"Entry":{"0":"\n\n","1":" Kantara Suez Canal.\n\n Everything and everyone in preparation for the march out again into the desert. Oh! that desert no one relishes the idea we had fondly imagined that we \nwont\n were done with it during the interval from the last diary up to the commencement of this one. I have been down to the Imperial School of Instruction at Leitoun working very hard at Signalling and telephony. Nothing very interesting to chronicle only of course technicalities \nthat\n I did not keep a diary because I had too much work to do and too much night study. After coming back and rejoining the regiment at Kantara I had about a week in camp and then I was sent down to Port Said for a weeks’ rest. Being the last of the party we only got to Port Said the remainder of the regiment had 7 days at Alexandria where we had all resumed again we all got fitted out and everything is packed up ready for the march. There has been a great deal of speculation the past week or two as to our future destination the majority firmly believing we would not go out into the desert any more. Some said Salonika some Upper Egypt some to England and others maintained we would go to Mesopatamia. But I was firmly convinced that\n\nWe would go back to the desert and so it is.\n","2":" \nDieudar\n Dueidar\n\nWe marched from Kantara this morning full marching order and at about 4.30 pm we came to this place. The","3":" Australian Light Horse have their camp here my horse was dead tired when we got into camp and was quite content to lie down in the sand. The horses will not drink this water in the desert on account of it being brackish and if they don’t drink they soon knock up. We had the some trouble with them on the last occasion. Some of them would not drink properly even after 4 months in the desert. Many of them had to be sent back to Kantara in consequence and now we are going to have the same trouble over again. The dew is very heavy here at night and the blankets get wet and at 6 oclock am they have to be rolled up and packed on the camel and they are not unrolled until night the blankets being damp the whole time with no chance of drying .\n\nWe are now (12 noon) halted under a group of palms having a rest. The date season by the way has nearly finished but there are quite a good number on the trees yet\n\nAnd they are very wholesome and good I think we shall have plenty of them at some of these palm groves further out. Our Arab camel drivers are in the height of their glory now when they can get their favourite dates – their principal article of diet – \"Saddle up!\"\n\nArrived at Romani late in the afternoon. Familiar old place. No trace of any camp not a stick left where the Regiment evacuated to go to Kantana we are camping for the night close to the water troughs and facing the desert towards Katia or Qatia. The graves of our men who were killed at the Battle of Romani have been fixed up and they look very nice. We had a shower of rain this evening just a short one the first since we were camped at Wartdan last February, plenty of lightening over the Mediterranean but a long way off. I dread going forward as I have had a good share of aeroplane bombs and high explosive shells they did not bother me for a long time but \"Continual dropping wears away a stone\" they say and I am not at all anxious to go and face\n\nit again. I am not afraid and I shall go forward with a stout heart for the sake of the Great cause and for the sake of others of my comrades who must go forward with me and as far as I am capable I shall not shirk my duty in any shape or form but I am nevertheless not keen on facing those aeroplane bombs and any one who has experienced an air raid will know what I mean cant write any more as the wind is blowing the flame of the candle all about so \" bus \" for tonight .\n\nAwake for morning in the bowl of night . The rain has gone and the sun is shining again everyone busy on his rifle, must keep them in good order\n","4":" Romani\n\nArrived safely at Hod. El Nagleich the identical spot where we bivouacked for several days after the Battle of Bir El Abd.on August 9th .The weather has been cloudy all day and rather cool – rather a wonder for desert country several horses suffering from gripe owing to drinking too soon after feeding this morning several of our aeroplanes hovering around all day watching for signs of any Taubes.\n\nLater 6.45 .It is dark in these latitudes about 5.30 pm although just at the present time we have the moon shining , she is about half full at present. I am writing this by the aid of an electric pocket lamp and I am just waiting to feed the horse before going to bed. The horses are mostly lying down being very tired the journey from Romani to here has been over some very difficult ground being particularly soft and a good few hills which are most difficult to negotiate.\n\nOur daily ration consists of 1 tin of Machonocie Ration 1lb of bread 4 men to a tin of jam and 6 men to a tin of milk also tea and sugar. Also plenty of good water which follows us each day on camels the water of the desert being pronounced unfit for human consumption the horses poor devils are obliged to drink that or go without and there are plenty of them who up to the present refuse to drink it although this is the 3rd day out. Cases occurred when we were here before of \ngoing\n horses going without water for many days and had to be sent back to the base x If the horses only knew as much as we know!\n\nrather long trek tomorrow so we are informed and I must not write too much by the aid of the pocket lamp or I shall have the cell polarized. Good night\n\nLater 7.15pm\n\nReveille 5.30am\n\nBlankets loaded on camels at 6.30 am\n\nWater horse at 6.00 am\n\nMarch out at 8.30am\n","5":" Hod El Ge`eila\n\nAbout 1.30 am we had a heavy shower of rain which lasted for about half an hour most of the men got wet through – not being prepared for such contingencies we are now halted about 1 mile east of Bir El Abd for a spell, of about one hour we give the horses a drink then off saddle and the horses have a roll in the clean sand which is very beneficial to them then put the pot on and make a drop of tea and have something to eat the horses are enjoying the contents of the nose bags. The sand has been very wet coming along this morning and the horses perspired a good deal 3 of our aeroplanes came back from El Arish going back to Kantara flying very high.\n\n6 pm. Arrived at a group of palms don’t know the name yet very ideal spot The whole brigade are camped here we may stay\n\nhere for a few days and we may go in the morning . The troops who occupied the Hod before us have left all sorts of shelters behind they must have made themselves rather comfortable I am at present occupying a bower built of palm leaves and it will make an ideal spot when the sun gets too strong . rather flat and uninteresting country about here nearly all flat and covered with low scrub and of course the inevitable soft sand . The railway goes on for an indefinite length beyond here some say not far from El Arish. The palm trees in this Hod are covered with the most lovely crop of dates and they are delicious although they are fast going rotten on the tees There must be hundreds or thousands of pounds worth of this fruit wasted on this desert this year on account of the Bedouin Arabs having been collected and interned as prisoners of war many of the Bedouins have joined with the Turks as they are invaluable as scouts in this desert country . we, having no use for these dates from a commercial point of view – at least at present – must of course let them go to rot on the tree. I think it is a great pity all the same they are most excellent eating and \n\nThey save regimental rations . The most of the men have wet blankets to get into tonight or none at all . I had a good wide water proof sheet and so, mine are fortunately dry Have been getting the Signal gear out this evening and we are now preparing to do our work the telephone has been installed\n\np.s. All these palm groves are called \"Hods\"\n","6":" Hod El Geeila\n\nSpell day had a visit from a German Taube. He flew over us and dropped bombs on Bir El Abd which is about 4 miles NW of here. He nearly ran into several of our shells which were fired at him .Our aeroplanes as usual nowhere in sight – until he had gone.\n\nNo further visitations from Fritz and his flying machine during the afternoon but tomorrow ? This palmgrove or \" Hod \" is called Hod El Geeila don’t know of any further movements at present hope we soon scatter there are too many of us in a heap here for my liking. Have just scaned a memo from office stating that the horses will go out tomorrow morning at 8 oclock to graze just how they are going to manage\n\nthat I am at a loss to know because as far as I can see there is nothing but small dry looking bushes and sand. But the manifesto says that the horses go grazing at 8 oclock so there it is. Theres not to reason why \"- I am now putting in all spare time on to the study of shorthand (Pitman`s) I find with the amount of writing I have to do I am at a serious loss and where I particularly noticed it was at the School of Signalling at Zeitoun where I had to do such a power of writing when taking notes that ordinary longhand was quite inadequate for the purpose so I decided that after I had got through \"David Copperfield\" that I would \nnot\n read anymore books until I had as Dickens put it \"Tamed that savage beast Stenography \" All my signallers have developed the Bridge playing habit very badly so much so that they \" must finish this hand \" before doing anything they are asked to , must make an alteration in that way very soon. I hope soon (DV) to put everything down in this diary in shorthand instead of the laborious longhand which is such hard work . It will mean a minimum of space with a maximum of information. The Australian mail closes on the 8th instant . Had the order today from Brigade\n\noffice prohibiting the men from cutting any more palm limbs off for making shelters the reason being that if we cut all cover the aeroplane will be more easy to locate us. There is not too much protection as it is without cutting more of the limbs down. Must make every endeavour to get out of Fritz`s sight as much as possible.\n","7":" Hod El Geeila Tues\n\nThe horses went out grazing this morning there was quite a number of tufts of grass which was a slight change and was infinitely better than standing in the lines and taking the chance of being bombed the Taube however did not make his appearance this morning, not all day although there were several of our men were floating about in the air. We heard that 4 or 5 men at Bir El Abd were blown to pieces as the result of bombs which were dropped there yesterday also several camels. These grammalogues are rather difficult to negotiate . I have just had a good two hours on them and I dont know whether x stands for \"on\" or but or whether\n\nx stands for should or all. But if I have two hours each day at it I shall soon master these little intricacies. \n\nWrote and posted 3 letters to E.J. E.B. and H.L. with Xmas greetings they should get those close to Christmas as mail today I got none why don’t one’s people be a little more considerate for those of us who are out here in the never never they little know how it helps us to remain cheerful under adverse circumstances. So, I write letters and get none in return in other words I am returning good for evil.\n","8":" . Hod El. Ge`eila\n\n10 AM. About 2 miles East of the camp the horses are grazing close at hand and are scattered about for fear of aeroplane raids and I am sitting down on a commanding sand dune . I have endeavoured to make a sketch of the country looking towards El Arish which is in the blue distance. I have not done much sketching lately so I am rather out of practice.\n\n7 pm Same date Night has decended again and the moon is shining very bright and everything is at peace under the old palm trees. Memo from office \" \" one man from each troop to go to BIR EL ABD tomorrow to purchase Canteen stores, what are canteen stores ? \n\nExtra groceries, pickles jam sauces hams rice sago etc etc etc.\n\nReceived from the ordonance Dept today 12 miles of telephone wire (DI) and 6 Stevens (old type) phones. This class of phone is next door to useless as each individual instrument requires the services of an expert mechanic to keep it in working order and they are always getting out of repair on account of the most important parts being exposed to the damp and dust. We are requisioning for D3 phones if procurable. \n\nReceived a letter today through the adjutant relating to the circumstances surrounding the death of Signaller M. Spry who was blown to pieces close to me last November on Gallipoli I have been asked to render a statement giving the fullest particulars. The circumstances are very vividly impressed upon my memory because the 8.2 \" shell came down and burst with a deafening roar about 3 yards from me\n","9":" Hod El Geeila\n\nThe late King Edward`s birthday and 2 years ago today I stood on the flying bridge of the \"Star of England\" about 9.30 in the morning and watched the \"Sydney\" make her wild dash out from the flank of the convoy and go at full speed in a westerly direction to fight and smash up the German Cruiser \"Emden\"\n\nsurvivors of both crews please note the date! Will they ever forget it?\n\nHad to trace a map – a panorama sketch of the position at Romani have also been doing some other sketching work which I have not been able to complete before on account of being down at Zeitoun for 6 weeks and then a week at Port Said and then the march out here. \n\nAbout 12 noon a Taube was sighted making for our position , We got the horses clear off the line and got away very prompt but there were too many guns sending shells after him and I think he was scared to come in any closer for fear of meeting any of our own machines which may have been hovering about and so thinking discretion the better part of valour he turned and flew back towards El Arish. He dropped 4 bombs however on some of the troops who are holding the line away ahead of us, I do not know with what result. These Taube`s don’t like to meet our airmen up in the blue but if suddenly faced with that danger they are not averse to having a go for their money so to speak although they very often make off before danger threatens \"We don’t want to fight but by jingo if we do,sort of feeling. We were very glad to see him disappearing in the clouds\n\nA patrol of about 12 Bedouins tried to pay us a visit early last evening but they ran into one of our Cossack posts which are on duty around the place and a sharp volley was poured into them one camel being left behind.The Bedouin are still going.\n\nThey were mounted on swift camels specially adapted for that kind of work They were no doubt a \"feeler\" for some Turkish Force further out in the desert. Anyway they had better not come \"feeling \" around here too much. I know that particular crowd wont . We are all in a glorious state of uncertainty because we don’t know which way the cat is going to jump We may stay here for weeks and we may not stay for hours and as to where we are going, no one can imagine.\n\nThe horses are in real good condition and they are quite fit. Truth to tell I am not averse to staying in the desert in the least only those dreadful Taubes get me. I have a holy respect for them.\n","10":"\tFriday Hod –El-Ge`eilar\n\n\"Any man who is deficient of either rifle or bayonet will be court martialled \" (Yesterday`s orders)\n\nHorses grazing all morning putting saddles in dubbin in the afternoon completed the sketch of the Romani front where the graves of the men are\n\nwho were killed in action\n\nThe latest report to hand is that the Taube which flew over Salmana and neighbouring places was badly hit and as reported yesterday she dropped 4 bombs which was correct but she dropped them about 2 miles from anywhere to lighten the load and was seen by the advanced post {52 Division) to be slowly going down. Surely our gunners have not established an unprecedented record?\n\n7pm. Just handed in the Daily \"Signallers parade state\" which sets forth Officers 1 NCOs 4 Other Ranks 12 Total 17 Horses 18\n\nLance Corporal Campbell was thrown from his horse at Kantara when we were there and suffered considerable injuries so he has been left behind. I hope he comes along soon as we cannot afford to lose good men we have not got too many. Have been informed today that 6 signallers will probably be required next week for outpost duty some where out in front we are about 7 or 8 miles inland and away from the sea and in tonights orders appears a notification to the effect that all submarines which are seen to be immediately reported. On the face of things it seems the height of nonsence. But the order has come from General Head Quarters and is addressed to All Troops concerned particularly those near the coast\n\nbecause a few days ago the P&:O Liner \"Arabia\" was torpedoed close to Port Said and sunk. There were (so the report goes) hundreds of women and children aboard. They have been rescued. The liner was torpedoed without warning (The usual Hun method)\n","11":" Hod El Geeila. Saturday\n\n13 of our airmen heavily laden with bombs passed over the camp early this morning on their way to El Arish to give Jacko a real good \"strafing\". 13 machines carrying 8 bombs each = 104 bombs. They are going to give Jacko a taste of what he delights in giving us. Inspections of the camp by General Dobell. The commander of the Division- The usual farce. We are going now to shift our horse lines to leave more room for the squadron to get out in case of an air raid. The latest order from General Head Quarters is published for information to all troops concerned.\n\n\"Suspected Spy\"\n\nSixth Manchester Regiment reports man dressed as Australian, wearing drill tunic and slacks felt hat turned up left side with badge under right rim brown boots no belt clean shaven dark hair and complexion age about 30 stout big hands wearing rhumatic ring on third finger of left hand and \n\nis riding bay horse with long tail and mane. He may be wearing Sergeants stripes. States he is lost and belongs to some other unit. He carries maps.\n\nThe very fact of him wearing the Australian badge on the RIGHT side of the hat is sufficient evidence to detain him as a spy. Also he does not state what unit he belongs to. A spy to do that sort of things is a brave man.\n\n11.45AM\n\nA German Taube flying approximately 9000 feet up came up from behind and if he had intended bombing could have done so before we got out but fortunately he turned and went East flying higher than I have ever seen an aeroplane yet. He looked like some gigantic dragon fly . The guns as usual were sending shells after him. I am wondering what is going to happen when he flies home and encounters those 13 machines of ours which went out early this morning. We must expect retaliation and we shall have to be on the qui vive for the next few days.\n\n7.30 pm\n\nJust giving the horses their last feed for the night, they know the time and they let us know when feed time comes in case we forget. We went out this afternoon on a sham fight we were careful not to take any ammunition with us for fear of\n\naccidents .A squadron of ours went out and took up a position in some old Turkish trenches about 2 ½ miles south of this camp where we had a scrap with them before and they had a most wonderful system of trenches with a splendid \"field of fire\". They were no doubt built under orders of some of the best German Engineers .To guard against detection by our aeroplanes they had interlaced cut bush and sticks amongst the sand thrown up so as to minimize the risk of detection from overhead.\n\nNote\n =Aeroplane reconnaissance is never too reliable .The machine must keep up at least 5 or 6000 feet to minimize the risk of being brought down and from that height very little detail can be observed. They are no doubt armed with the best field glasses and telescopes but one must not forget the great vibration of the machine when one considers how frail the machine is in its construction and then attached to that there is Gnome motor Engine of at least 200 horsepower one can well imagine the tremendous vibration which results – Our own airmen inform us that when flying our own (Known) camps at the height that a Taube would fly –say that it is impossible to see the camps and the only thing they can see is the shadows thrown by the tents in the morning and late in\n\nthe afternoon. And these are the favourite times when the Taubes make their appearance. In the present camp there are no tents and we are protected by thick palm leaves therefore it would be a physical impossibility to locate us even at a few hundred feet and unless they have information that we are there (by spies) they would pass us every time being totally ignorant of our presence. But when a Taube appears we must act under instructions from higher sources and stand to our horses and file out in case he \ndoes\n know we are there and decides on having an air raid. Looking at things from a common-sense point of view it would be the height of folly to wait until he let go a couple of bombs before we did get a hustle on and get out. Because if that was the case there are a good many of us who would never get the chance to get out and many men and horses would be killed and wounded. We have profited by experience at Romani. Through being in close formation 9 men and 25 horses were killed outright and many wounded and with ONE bomb\n","12":" Hod El Goeila Sunday\n\nChurch parade and Brigadier General Cox inspected the horses. I am a member of the Canteen Committee and we met this afternoon and we \n\nwere informed that although we have over £500 to our credit we have to hand all accumulated funds to the staff paymaster and it means that if we require an amount of money for the purchase of canteen stores with a view to forming a regimental canteen, we must requisition to the staff payment which might mean a long delay and by the time the money arrives and the stores purchased we may be hundreds of miles off, so a regimental Canteen pro tem is in abeyance. Been out grazing horses all afternoon. Parade state has gone in and now I am going to have two solid hours struggle with \"that savage beast stenography\"\n","13":" Hod El Geeila Monday.\n\nGrazing horses all morning \n\nThe artillery were practising on our front at some targets and they were working in conjunction with one of our aeroplanes which dropped smoke bombs to indicate the targets. Signalling practice all afternoon badly wanted too some of the signallers are getting very backward in their reading which is so important Cameron and Wilson went out about 3 miles to send to the others who were near camp and they had conveniently forgotten\n\ntheir heliograph stand thereby necessitating the exclusive use of the small flag which meant so much extra manual labour. There is no limit to some peoples stupidity. The other day there was 16 aeroplanes of ours which went out and not 13 and all arrived back safe but cannot get any particulars as to the damage inflicted on the Turkish camp which they bombed.\n","14":" Hod El Geeila Tuesday\n\nSignalling and grazing in the afternoon very hot no wind\n\n15th Nov 1916 Hod El Geeila Wednesday\n\nLong distance Heliograph signalling Saddles in dubbin in the afternoon. A great quantity of canteen stores arrived this afternoon – a miscellaneous collection of goods. Comes in handy because we have had no fresh meat for two days now and the popular rumour is that we don’t get any more. But for my part I am sceptical about that because we have the railway right up from Kantara and trains constantly running.\n\n7.30pm Am having a great struggle with \"that savage beast-stenography.\" I am now having a fierce tussle with or 16 and as I go along the task becomes increasingly difficult but I shall strangle that savage beast – stenography – yet I am not going (DV) to let it get the upper hand of me and say (DV)\n\nThere has been a good wind blowing all day and tonight the temperature is rather cooler than usual. Mather has got to do stableman again tomorrow for not doing what he was told today as a punishment. He is rather sore about it, but instead of doing what he was told re cleaning the lines he sat about playing cards, Lance Corporal Campbell arrived at SALMANA by train from Kantara tonight but we could not send a horse for him as no horses are allowed off the line after dark out in these regions There are outposts and picquets out in all sort of inconceivable positions at night and they know \n\nthat they should not be any prowling horsemen roaming about the desert after dark and they might be tempted to use the old saying \" shoot 1st and challenge after\" So we shall send over to Salmana first thing in the morning – and in daylight.\n\nCampbell will probably have a cold bed for tonight but he may get worse. This particular HOD was lately tenanted by the","15":" L H Brigade and they have left a lot (quite a lot) of little things behind them and these \"little things\" are hard to define against a grey flannel shirt and they have a bad habit of staying as long as they can. There is some sort of a rumour about shifting to a healthier and cleaner spot soon . I have not got any of these \"little things\" yet nor any of the signallers but some of the men have picked them up but whether they have picked them up here or whether they brought them along with them is more than I can say.\n","16":" Hod El Ge`eila.Thursday\n\n12 months ago today I had a Turkish 8.2\"\n\nhigh explosive shell landed about 5 yards away from me killing one of my signallers (M Spry) and crippling for life his mate another signaller named Sinclair. He has lost the sight of both eyes. That is one of my narrow escapes.\n\nInnoculation parade today have been inoculated again against cholera. \n\nwe are done about every 3 months my left upper arm is one mass of punctures with the hyperdermic syringe where I have been inoculated against cholera, typhoid, enteric, para-typhoid, cholera again &: goodness knows what next We get accustomed to these inoculation parades and don’t so much mind them now although at an earlier stage we did not view them with much favour.\n\nBeen out grazing in the afternoon. A sudden order came around stating that all surplus baggage is to be packed and to move out of camp for Kantara in the morning we have 5 signalling panniers and we only are taking 2 of them and sending the rest back.\n\nCampbell arrived back this morning and he gives us a vivid description of the visit which the German Taube paid there a few days ago. The natives as one who knows them were terror-stricken and ran helter skelter in all directions. The Taube only dropped 4 bombs but they took a heavy toll of the natives. No damage of a military nature was done. The people of Cairo got a particularly bad scare as such a thing as a Taube has never been dreamt of over the city being too far inland they imagined\n\nBut these flying men are getting more expert and more daring and they are constantly improving their machines so it cannot be wondered at that one of them took it upon himself to pay Cairo a visit .\n\nBy the same token one of our own men on about the same flew right on to Jerusalam much further than the Taube went. Have been enjoying some of the stores which the good people of Australia have so kindly sent us. The people of Australia have stood splendidly behind us and we realize that they are doing their best for us and we on our part shall do our part in return. Big Australian mail again and as usual not even a post card for yours truly and I write regularly .And the people to whom I write have no idea how hard a struggle I have to do that. Especially now when we are either moving about the desert or getting ready to move. Because we go almost at a moments notice when we do get the order.\n","17":" Hod El Ge`eila Friday\n\nBeen out long distance signalling all morning and grazing in the afternoon. When we go grazing in the morning we generally take a couple of bags and fill them with wood for the cook as the wood he has issued is not sufficient for his needs and it always pays to look after the cook as much as possible. No wood no dinner!. It has been very cloudy all afternoon and a cold wind was blowing .Quite a change to what \n\nwe have been accustomed to . I sincerely hope that I do not have to spend another summer in Egypt. The last one was killing Especially when we were in upper Egypt and the first few months out in the desert at Romani.\n\nTwo of our aeroplanes went out near El Arish the other morning and dropped 180 lbs of explosives on a large Turkish camp by moonlight. Quite a new departure for aerial warfare. They must have caused great consternation amongst the Turks – and \"others\"; Very soon now we shall have to shift our camp from out of the palm trees among the horses and sleep on the sand bank which runs along the back of the camp the ground around these trees is condemned by the medical authorities. We are living too close to the horses anyhow which in itself is considered unhealthy.\n","18":" .Hod El Ge`eila .Saturday\n\nVery cloudy and a cold wind blowing off the sea all day. Long distance heliograph signalling. Some palpable blunders, must have more hard practice. Also the large flag must be introduced which the lads don’t relish, give them anything but the large flag ! Some one did not take their telescope with them and consequently could not read the small flag when the light failed on the Heliograph. Sunday tomorrow, they will have time to think it out .Cameron has been giving me a hand tonight for about\n\n2 hours 5min my shorthand lessons and I have been getting along famous Large mail again today and still no luck for yours truly I sincerely hope that the people concerned may read this and feel ashamed of themselves. Washed some clothes I hate that operation always did but cannot help it.\n\n7.30 pm. Same date. Some one in the outpost line has just let a round go out of his rifle probably through fingering with the mechanism in the dark to see ( or rather feel ) how it was working. Result a strict enquiry tomorrow and someone will have to toe the line. That sort of thing usually happens where so much ball ammunition is carried. One day some months ago two of them let off their rifles within 5 minutes of each other it happened under the palm trees near Katia. One of them got a bullet through the foot.(his own foot fortunately ) I say fortunately, advisedly because through foolishly handling a loaded rifle I would sooner see him put a bullet through his foot than mine. Anyway it was just before the battle of Romani and so he will not have much trouble making that bullet wound fit the Romani fight nicely.\n","19":" Hod El Ge`eila SUNDAY\n\nSunday and church parade. Which the lads detest. It is surprising how they will invent excuses to dodge church parade with one excuse and another. One says cant I stay behind sergeant I have some washing to do? \" No ! I say you had time \n\nyesterday for that and you will have plenty of time tomorrow\" another one says I cant go I have got to get my hand dressed ! \"well get it dressed before you go \" ! another says \" I think the telephone line is down between here and Brigade can I go and repair it Sergeant ?. \"Yes I say by all means – after church!\" Then one will say \" Sergeant I am a conscientious objector\"! \" Well all right \" I say \"get on parade and march to church ,there is no one going to force you to hear the service\" So by the time the conscientious objector has gone that far he always sees it through. Of course the whole thing is a piece of bluff and if the sergeant is soft and yielding he would never get anyone on parade because they are never at a loss for an excuse to dodge church parade.\n\nOne of our aeroplanes flew over the camp late this evening flying at such a height that the marks were indistinguishable to the naked eye and only with the aid of powerful binoculars could the markings be seen. I got a scare for a minute but as soon as I saw this (Drawing of a roundel) and not this (Drawing of a German cross} I felt satisfied which reminds me of an amusing incident which happened a few days after the battle of Romani . Everyone including cooks belonging to the Regiment had to fall in and we marched to a high place just north of the camp and formed a square and Brigadier General Meredith\n\nthe ( then ) commander of the Brigade addressed the Regiment commencing after this style \" Major Bourne, officers non commissioned officers and men of the 2nd Regt I must heartily congratulate you on the splendid work - - and so on. The usual toshery about doing good work and taking the brunt of the battle etc. During this harangue a German Taube came sailing merrily overhead and being so late in the evening the \"heads \" never bothered to look up (probably considering it to be one of our own machines flying back to Kantara) and during the Brigadier`s speech which at this point was quite impressive there was a good deal of smiling and tittering going on and occasionally a head would be cocked on one side and a man would steal a glance up at the Taube to see which direction he was travelling and a good deal of nudging each other and whispering some of them never heard half of what the Brigadier said they were listing for a bomb to come whistling down from above, but he was only reconnoitring as it happened and after flying over our camp for several minutes he made off .Looking around the ranks at the time it reminded me of a group of fowls all huddled together in some corner of the yard and cocking their eye aloft occasionally to watch the movements of\n\na hawk. In ordinary circumstances on the approach of a hostile plane a wild yell \"Stand to your horses ! \"would be heard and a helter skelter scramble would be made to get the horses off the lines.\n\nMajor Maxwell and Major Chambers both arrived from the Cavalry School at Cairo this evening.\n\n20 th November 1916. Hod El Ge`eila.Monday\n\nThis is really written in part on the 19th and I thought being as this is a journal of a private nature and concerns myself and my signallers and the regiment I thought that a biograpahy of the characteristics and description of these men of mine might not be out of place. It may prove interesting I don’t propose to devote too much space to each man otherwise I should soon fill the book . So firstly we start on the senior n.c.o. (1) Corporal C. Cameron No 859. Good and particularly smart at his work when the spirit moves him but horribly easy going when it doesn’t , Well educated, very even temper in fact no temper at all which must be expected from a man of that temperament. His principal hobby, shorthand and German. We twit him about learning the Hun language but he says it has a fascination for him (or ) rather forgetful at times which is decidedly embarrassing to him (and me) Has that characteristic Australian fashion of bending both ankles over when standing at ease which looks unsoldierlike\n\nHas also has the habit of cocking his head on one side likewise his hat purses up his lips at the corners looks you straight in the face and takes all you can give him in the way of abuse or corrections etc. That type of man is hard to impress.\n\n(2) Corpl A.G.Wilson. no. 11\n\nAn ex naval man but has a rooted objection to discipline and so long as he is not asked to take responsibility then so long is he happy . an expert signaller but on occasion displays a temper which is typical of him being Irish. Very secretive &: \"close\" type of man and as a rule never says more than is necessary, but thinks a great deal. Never speaks of private affairs nor past experiences. Is one of my original signallers who joined with me at Ennoggera and has gone through it all to date doesn’t like church.\n\n(3) Corpl C.H.Smith No 217\n\nSometimes called \"Smig\" ( a corruption for Smith) a conscientious worker and reliable. very particular and careful about his belongings always takes the greatest care of his kit, horse saddle etc. prone to using bad language very frequently probably it will wear off as he gets older. A typical Steele Rudd type of an Australian lad. A good optimist and a good soldier has never had any previous military experience but so far has turned out well. The pity of it is that his education has been neglected somewhat but which could easily be remedied if he only applied himself to it whole heartedly.\n\n(No 4) Lance Cpt Campbell J.H. No 1236\n\nSmart clever, well educated, young .early 20s\n\nI should say and barring accidents has the world before him. If I ever leave my present position he is the man I should like appointed my successor. A smart signaller . He is of course young and inexperienced but he will grow out of that and he is the right type of man \nbecause he does what he is told without question\n and that fact \nalone\n makes him stand apart from the others in my estimation.\n\n(No 5) Signaller C.W.Allan No. 1387\n\nquiet and obedient , a meek sort of man well educated, always in weak health which handicaps him, but the hard usage of the service is gradually building his constitution and he seldom now has any physical complaints. Is not a too brilliant signaller on account of the strenuousness of the training required very willing at all times and obliging another type of secretive man and does not talk too much. Not a good rider being somewhat handicapped physically\n\nNo 6 SIGNALLER W.Barry. No 1131\n\nQuite young not 20 I should say. Speak to him for half an hour and he will only look at you. Says very little thinks very much. Has a habit of standing upright and looking at you during the whole conversation never opening his mouth once. Has a temper of his own but tries not to show it. Educated. Loses his \"block\" when things go wrong at the distant station and sometimes ends in making the station at the end making a hash of things. as he\n\ngrows older much nonsence will be knocked out and much sense will take its place.Tries on occasion to be sarcastic but miserably fails\n\nNo.7 Signaller W.Boyer.No 3J9A\n\nOriginally transferred from the 3rd L.H Regt couldn’t get along with the signalling Sergt there. A good signaller and the type of man who always tries to do the right thing as far as he is able. Never questions any order given. Always takes it for granted that an order is given to be obeyed first, middle and last . most obliging. Does not intrude, friendly with everyone, very talkative, is sometimes subjected to fits of brooding (the \"fed up \" feeling ) Then everything goes wrong, much to the amusement of the others, mends watches in spare time generally succeeds in breaking them.\n\nNo 8 Signaller J.H.E.Butler No 304\n\nUsually called \"BUTZ\" for short. Frail ,Fickle &: fastidious! A.A.A. There is a saying amongst us \"When Butler is on parade we are all on parade.\" Everlastingly late but can never be made to understand that : must have a mental kink in that direction. He is on a sure 5 piastres the first time I see him first on parade. I could as easily make it 100 piastres with equal safety. Apart from that is decidedly clever and well educated age perhaps about 19 passable signaller would have been much more expert had he not been such a bird of passage First he learned signalling then he drifted \n\ninto the ranks of and became a trumpeter From there he went to the Lewis gun detachment even going to Leitoun to the School of Instruction to qualify came back and became a signaller again. Neither fish, flesh nor fowl – nor a red herring !. Has been trying unsuccessfully to enter the Royal Flying Corps : chief hobbies , pencil drawing at which he is decidedly clever and aeroplanes. Comes from Tasmania where the \"devils\" come from. Very musical , and plays on a one string fiddle made out of all sorts of odds and ends. Is a particularly good sleeper and like the Tasmanian Devil does not like being disturbed.\n\n(No 9) Signaller J.C.Dorricott No.\n\na rather tall man with red hair and a sharp nose of uncertain age, Has got past the frivolous stage , possesses a good fund of common sense and knows how to use it. A good signaller is devoted to his horse. An Englishman and has a decided country accent . thoroughly reliable never questions any order which he gets\n","20":" Hod El Ge`eila Monday\n\nSignalling all morning. Grazing in the afternoon did not go . Have a sore finger where I cut my finger some days ago and septic set in am having formentations on it after being opened shall be all right in a day or two.\n\n21st November 1916.Hod El Ge`eila .Tuesday\n\nSuddenly received orders this morning to pack up and go to BIR-EL-AB in full marching order, we went there to be \"dipped\" as the boys express it ie fumigated. Some of the men have contracted lice in this bivouac left behind by the 3rd Brigade and as a precautionary measure we had to put our clothes and blankets into large covered railway vans which were connected by means of steam pipes from the locomotive and some disinfectant, we all stripped off and first got into a bath of water into which a good deal of creosote had been placed, and after having had a dip we got out and put our cloaks on as a preventive against sun burn. Some had no cloaks with them or had put them with their other clothes in the fumigator and so for about an hour had to run about in the sand in their bare pelt, that is what some people call art isn’t it?\n\nIf a Taube had made its appearance at that time there would have been a holy scatter, we were told that if one did make its appearance we were to bolt for our rifles and bandoliers and prepare to fire on it.\n\nI cant imagine a more ludicrous sight than about 20 or 30 of them in their bare pelt armed with a rifle and having a bandolier on. The Taube man would certainly think the British troops had suddenly gone \"Magnoon\" (Arabic for mad.) and I could imagine the surprised look on the faces of his superiors when handing in his report at headquarters.\n\nArrived back at this camp about 1pm. Shifted my bivouac this afternoon a little away. I am studying short hand and I have not had much peace in my last place on account of the signallers craze for \"Bridge\" Every possible minute they get it is devoted to bridge playing, and if the truth is known there is not one of them who can play a really good game. They never play for honours and just when I would be endeavouring to decipher some of those mysterious circles and difficult angles for which shorthand is famous I would have to listen something like this..\"what the blank blank did you play the queen for couldnt you see that I had the lead? The other one would\n\nsay \" I had nothing else anyhow I had his Jack\" then the oponants \"why didn’t you play that blanky ace and get the lead you are a blank fool\" Well says the other one \" I was watching dummy ! there is not too much noise going on when they are actually playing but at the termination of each hand then pandemonium breaks out and it is impossible to concentrate ones mind during that interval and it is a happy release when they take up their hand for a fresh game.\n\nThe next man on the list for classification is \n\n(No 10) SIGNALLER. A.R.NATHER No 1179\n\nVery short and stumpy in appearance very boyish looking face Hails from Manchester or thereabouts been in Australia some time. Not too good at signalling but passable. His eyesight is not too good which is a serious handicap for a Signaller. Pleasant disposition grows. very excited at times when things go wrong (at which no one takes any notice)\n\nNo.11 O`Halloran R.W. No 1685\n\nAt present under going a 6 weeks course of signalling at the School of Instruction at Leitoun near Cairo. Commonly called \"Dick\" he is what is known in Australia as a \" Hard Case\" and in his way something of a comedian. Always has a ready and witty answer to any question. Is always\n\nwilling and obliging but his pet aversion and it is a pet aversion – DICIPLINE-There is a good deal of what soldiers call \"messing about\" in the service which means literally any order or orders being first given and then (apparently without ryme or reason ) countermanded to put up with that sort of thing requires years of practice hard discipline and the patience of a JOB. This sort of thing is at all times a great bugbear but we all have to bow to the inevitable on such occasions. And \nthat\n really is OHalloran`s prejudice. For example the officer says lead 2 horses to water each man. I repeat that order when the horses are off the line, along comes a fresh order Each man must lead 3 horses! . on such occasions O`H is heard at his best and his remarks are really worth recording . passable signaller but he will become expert when he comes back fro the signalling School; Suffers very much from \"Aeroplanitis\" which means lilterally shock to the nervous system on the approach of hostile aeroplane and the anxiety and horrible uncertainty as to whether he will drop bombs or not. We all suffer from the unpleasant malady to a greater or lesser degree \"O`H\" suffers from it to a greater degree than any other man I have ever met.\n\nIt is no fault of his because he had the misfortune when in Melbourne\n\na couple of years ago to be run over by a motor car going at a high rate of speed and had his pelvis broken and other internal injuries besides suffering from severe shock to the nervous system. So when a Taube comes in sight \"O`H\" starts to tremble but we all fully understand his feelings.\n\n(No 11) SIGNALLER.Leach.G.W. No J59\n\nKnown to the others as \"GUY\" Good signaller but never does any work voluntarily and always waits to be ordered. very crafty and is always ready and eager to show up those who are in authority by insinuating comments always wholly out of place. But is always cunning enough to keep within the pale of the law and is rarely caught. If he is caught he can generally concoct a good story and wriggle out. Then he looks for opportunities to play off on those who have been responsible for bringing him forward. was sent to the school of Instruction after repeated pleadings to me and when he got there played the fool generally with the instructors and got sent back to the regiment in disgrace. Signallers are hard to train and also difficiult to maintain and therefore at present we cannot spare him.\n\nNo12 SIGNALLER A.D.Findlay No. 1161\n\nOnly commenced signalling about 5 months ago therefore not too experienced yet ( It takes 12 months hard training at least\n\ncons\n\nto make an efficient signaller and then only by \nconstant\n practice)\n\na morose type of man and in my opinion giving to much brooding (probably regrets he ever joined)\n\nIs possessed of a bad temper when the fit seizes him as his horse could testify if he could speak. Altogether a man of strange moods. At one time he becomes very communicative at another he goes for hours even days without hardly ever speaking.\n\nNo 12 Signaller J. D. Mercer No 785\n\nIn a gentle and unoffending sort of way is overcome with the exuberance of his own verbosity (to quote Gladstone). Was at the school of instruction the same course as I was .Another man whose pet aversion is dicipline – pure discipline. Cannot be reasoned with to understand that dicipline is the means to an end. Has led the care-free life of the western country of Queensland and doubtless imagines that it should always be so in spite of the fact that he is in the army. A good and capable man and will work admirably if no such things as Stars and stripes get in his way. The moment the people with stars or stripes (authority) do so then so soon does he rebel.\n\nNo 13 Signaller John Stringer No 15\n\nThe last one for classification but by no means the least, as his\n\nRegimental number implies is one of the original Signallers who joined with me at Enoggera in","21":" and with the exception of a brief spell at Malta suffering from that common malady of Gallipoli –dysentry. Has been a \"sticker\" right through to date. Commonly known throughout the regiment and most of the Brigade as \"Jock\" Is Scotch by birth but has none of the Scottish accent fairly tall and dark a middle aged man with iron grey hair and a black moustache, \"Jock \" is always seen to the best advantage when he had about 3 days growth of thick black bristles then he looks a character indeed. Much respected by all who know him on account of his great stock of sound (typically Scottish) common sense and his cool judgement and clear headedness (provided it is not too soon after pay day and a canteen handy.) On those occasions \"Jock\" is possessed with anything but clear headedness. Is a splendid signaller and is a tower of strength on a signal station. A most conscientious worker and obeys implicitly all orders (having previously been a military man he understands the meaning of that mysterious word Dicipline which so few in this army do) I made him a lance Corporal\n\nonce but \"Jock\" had no hankering after higher things If he wanted anything done he did it himself believing in that maxim. He was therefore not much of a success as a non commissioned officer and prayed to be allowed to revert to the permanent grade &: solely at his own request it was done. I freely state that scores of times I have depended on his judgement and his alone and if some knotty problem presented itself., I have often asked \"Jocks\" advice. A cool and capable man under fire which I can testify to on many occasions.\n","22":" 1916.Hod El Ge`eila.Wednesday\n \n\nSame date 8.45pm. Just went out into the horse lines to see my horse before going to bed (my usual custom) the night sentry on the Staff and Signallers lines coming on the scene saw me at my horse and the following conversation took place.\n\nThe sentry \" What are you doing there?\"\n\nMyself- \" who do you mean me?\"\n\nThe sentry – \" yes you\"\n\nMyself – \" Oh that’s all right\"\n\nThe sentry- \"Its not all right you`d better get out\"\n\nMyself \" that’s all right I am in charge of this line\"\n\nThe sentry \" no you are not I`m in\n\ncharge here and you had better clear out before the sergeant of the Picquet comes along. Theres been too much stuff \"Pinched\" off this line lately.\"(There has been so many petty thefts of saddlery off our line lately that I have been to Head Quarters and complained and now the sentries on the the Staff and Signallers have had drastic orders on that subject \n\nmyself . \" I am in charge of this line horses saddles men and all\"\n\nI had been standing close up to my horse during all this dialogue and then I came out the sentry evidently recognizing me.\n\nThe sentry \" Oh! Its \nyou\n is it. I thought it was some one who had no business here.\"\n\nGood soldier : that man some of them would see all sorts of unauthorized persons come into the lines and \"\"pinch\" what they wanted without a word or question\n\n22nd November 1916.Hod El Ge`eila.Wednesday\n\nwashing parade today for anyone who had any washing to do \n\nJorgensen has been promoted Saddler Sergeant and is now busily engaged on our saddles which are very bad nothing having been done by previous saddler. About 20 reinforcements arrived tonight from details at \n\nMoascar. Near Ismalia\n\nEverything is packed up now ready to go on to our next camp I believe at BIR-EL. Mazar somewhere about 20 miles nearer theTurks. We will then be right on the outpost line\n\nFinlayson, one of the original Signallers came back tonight he has been away sick and by the same token Mercae goes away tomorrow on transfer to the Camel Corps at Abbassia.\n","23":" Hod-El-Ge’eila Thursday.\n\nWe have sent on our heavy baggage to Bir-El. Mazar by rail and we go tomorrow The first march is half way to Mosefig (pronounced (MOSSFIG) we hope to reach our destination next day. Received a parcel with several pairs of socks very handy and acceptable. \n","24":" Mosefig Friday\n\nPacked up and left Hod El Geela this morning at 11 a. m. and marched along through the desert. The trackless desert! There are little tufts of course looking grass growing all about and low scrubby bushes but there is no hard ground – all sand and extremely heavy going for the horses, we have limber wagons with us as part of the 1st Line Transport. The wagons have broad tyres clamped on to the ordinary tyres (about 9 inches wide).\n\nThese are called sand tyres and here are a wonderful help. For the most part of course we have the old reliable \"Ships of the desert\" the camel he is very reliable – very sure – a real old plodder. He puts one foot in front of the other and goes along mile after mile and never stops till he gets to the end of the journey. His pads are specially adapted to walking over this soft sand and I have noticed that no mater if he has a heavy load on or whether he has only his own weight his pads don’t go any further into the sand. He is a wonderful creature. The camel drivers are in a way wonderful people. They plod on leading those camels over the soft – and at times burning hot sand – bootless for many miles hardly ever stopping. When we meet them along the track we get the Eternal Question \"Give it Cigarette\"! Give it \"Backsheesh!\" or \"Give it mongarie\" (Arabic for food). They get well fed but the rascals are always asking for something just to keep up the traditions of the race.\n\nReveille is at 5.15 am in the morning and we are to hop out of the blankets, water, stack and load blankets and have breakfast and move off for our destinations at 7 am. My breakfast for the morning will consist of a pound tin of \n\nvegetable & meat rations made hot on the fire, bread, jam, and tea with plenty of milk (Ideal) we cannot complain about rations we get well fed . There are times of course when things are a little \"tight\" but they are only spasms and we are soldiers and can put up with a little inconvenience now & then. This time tomorrow we shall be about 15 miles nearer \"Jacko\" and each man (apart from Signallers) in the Brigade is carrying 200 rounds of ammunition. Each man has a spare bandolier full of cartridges around his horses neck. And each Lewis & Maxim gun is carrying 3000 rounds per gun So \"Jacko\" had better keep out of range.\n\nThe Signallers by the way only carry 50 rounds as they scarcely ever use any ammunition they having communications to keep up at all times and consequently have no time for shooting and the more fighting there is going on the more messages are going through from the Regiments to Brigade and vice versa and the more important these messages become so where would the commander of a Regiment be if an important message was in course of transmission and the Signaller left his telephone or Heliograph to have a shot at the enemy? And beside the Signallers have to carry heliographs which weigh about 15 lbs and telescopes and stands and flags etc etc\n\nand if in addition to this he had to carry 200 rounds of ammunition how is he going to do it!\n\nSome days when dreams come true they will suddenly awake (The \"heads\" I mean) and realise how useless a rifle is to a signaller and weighty and he will be armed with a revolver the same as the machine gun Squadrons. But we generally take a long time to wake in our army.\n\nOur Regimental Sergeant Major Menzies Sergeant Barton and Corpl Allan Brown left us this morning for England having obtained commissions in some of our Infantry Batallions they will have 3 months training in England and then they will be sent to France and either \"push\" or get \"pushed\" The average length of life for a 2nd Lieutenant in France is 8 weeks and the popular saying amongst us is \"He is either a Corpse or a Captain\" in that time.\n","25":" Arnussi Saturday\n\nArrived here at this palm grove about 4 oclock pm. Rather a long march over undulating sand dunes. Halted for several hours to water at a place called BIR el Malha only a well in among the sand dunes. The water at this well was particularly vile\n\nsmelling stuff but extremely good to drink very strange but true and is often the case in these desert wells. The major part of the water procurable has no smell but is brackish and not fit for human consumption. This place where we are to stay for a few days is only a small clump of date palm trees and the water is particularly good our own water by the way is sent up from Kantara by rail and transported by camel from the nearest railway station across the desert. The receptacles are flat tank like vessels made of strong galvanized iron and very strongly made & called \"fantassie’s\" I don’t know if that is Arabic or not. All fires out by 5.30 and no lights after that hour. So runs the manifesto issued from the brain of the great Staff at Brigade Headquarters. Last night our lights were out and fires deadened. A corresponding order in the Navy is \"Darken ship\" so we darken ship accordingly and the strange part of the thing is that the lights, fires, candles lamps etc are blazing merrily and any scouts of the enemy anywhere within miles can see them and if he (\"Jacko\") had any artillery handy he would plant a shell right into the middle of the lights. Of course Brigade imagine that no one can see their lights. But the regiments must put out all lights after dark \"Oh! How we do muddle through!\"\n\nIt gets dark somewhere about 5.30 pm and it remains so until nearly 6 am rather a long night without lights to pass a few hours away. B & 6 Squadrons on out post duty tonight and 6 Signallers.\n\nThe Signallers have now got their work cut out and they will all be employed & no spare time. They will be on the same footing as they were on before the fight at Romani (Nearly 4 months. I don’t know how long this particular \"Stunt\" is going to last but I do know that we will be up to our eyes in work for some considerable time to come. No matter how big or how small the patrols are they must be accompanied by Signallers for the information to get through.\n","26":" Arnussi Sunday 1916\n\nThe night was cold and it was a struggle to get disengaged from the blankets. I slept on my saddle blankets and had 2 blankets and my oil sheet over me. That oil sheet of mine is a very good one because of its width and no cold air can penetrate it. \"B\" Squadron has gone back along the track we came by to take up a position on outpost duty among the sand dunes about 7 miles more of a flank guard than anything else. They are on a \n\nbearing of 252 ° from here. Wilson and I heliographed to them this morning. The telephone is installed now from Brigade to us and to the various regiments of the Brigade. Plenty of low scrubby bushes on these sand dunes now and – clean sand – more sand – and still more sand – Sand in the tea, soup, in the mouth in the clothes, blankets, boots, socks and in fact everywhere it is possible for sand to get. We chew sand at each meal and when I was at the school of Signalling I went to a dentist in Cairo and it cost me £ 2\/10 to get my teeth repaired in consequence of so much sand-\n\nI suppose I shall be busy here surveying the whole outpost line the Brigadier and all Commanding Officers were out this morning viewing the positions for outposts to be placed. A Bedouin arab was brought into camp this morning by some of our patrols but I believe he is one of our intelligence branch of which we have quite a number who get periodically \"Captured\".\n","27":" Arnussi Monday 1916\n\nI shall in future be compelled to write up this journal in the daylight on account of not being able to use any light at night time and the nights are long without a light. \n\nPatrols going out in all directions scouting for signs of \"Jacko\" we are about 15 miles from El A Rich here and that 15 miles is important we have I believe to get there before this is over. What is before us. The nights are rather cold and it is quite a struggle getting out of bed. A message came through late last night to the effect that a strange Officer had been seen in the 8th Manchester lines asking questions and also in the 157th Brigade somewhere on the outpost line. He was asking questions about the disposition of troops & guns etc when he had gone they suddenly bethought themselves that he may be a spy and sent a message around to all concerned to that effect, instead of detaining him on suspicion. Really there is no doubt about the thorough incompetence and block-headeded stupidity and general muddle-headed-ness of these \"Tommy\" Officers and men generally. The spies always make for the \"Tommy\" lines knowing that they can get all the information they want from that quarter. I notice that they are never reported noseing around the Australian lines at\n\nnight. They would soon be challenged. All of us (Australians) are very indignant about these spy episodes and we refer to the \"Tommy\" and the \"Tommy\" Officer in particular with contempt well – when they are such fools\n\nand blockheads as not to question questionable people prowling around their outposts at night they deserve it all. These messages are continually coming through on the phone and they always come from the \"Tommy\" lines about suspected spies In some cases giving most accurate descriptions and I repeat that these gentlemen never prowl around the Australian outpost line. All training and Signalling practice automatically ceases now and we are doing the actual work. I have been working this morning by heliograph at about 7 mile range with one of our outposts. There is nothing to report about the movements of \"Jacko\" so far although he is not far off. Corporal Cameron went into Bir El Mazar station this morning and brought out all our spare Signalling Equipment we have that in abundance but men is the trouble we cannot afford to lose a single one of them now. Mercer who was transferred to the Camel Corps at Cairo came back yesterday.\n\nWe thought he had gone for good but he came back the trouble being that his position had been filled by someone else who had got in before him. All the Signallers apart from Mr Letch & myself we can muster are Corpl Cameron Corpl Wilson Corpl Smith L\/Corpl Campbell, Allan, Barry, Boyer Dorricott Leach Mather Butler Finlayson Findlay Mercer Robinson, Stringer McAuley Baldwin.\n\nShould have at least ten more in case of emergencies it leave no margin at all in case of any casualties we must go forward and do the best we can.\n","28":" Armussi Tuesday 1916\n\nTo day opens with a magnificent sunrise one of the most beautiful pictures I have ever beheld words fail to describe it. So I shall refrain. Butler Campbell and Barry on patrol at 0600 Corpl Cameron & Boyar on patrol at 8 am. 3 men on night outpost tonight and 3 on the phone we are all on duty. We have now got clipping machines in the regiment and are going to clip the horses and the weather is cold and as time goes along it will get much colder. Only last night we commenced to put blankets on the horses at evening stables and now they are going to clip all the long and\n\nwarm coats off them.\n\nA frequent expression much heard in the paper \"John Bull\" is \"Oh for a Business Government!\" My expression – much used – is \"Oh how we muddle through!\" Its simply astounding but we ","29":"\n muddle through somehow.\n\nReceived about 6 letters which have been sent to the Leitoun School of Instruction and have just been returned also a parcel from E. J. Leith 2 plum puddings. hooray! \"Quise Kateer\" as they say in Arabic which means \"Very Good\".\n\nThe time now is near midnight on the","30":"\n\nThe scene is 70 or 80 miles due East of the Suez Canal away among the undulating Sand dunes of the Sinai Peninsular. The only character is ME! Why is this? Well first I am taking a turn on the telephone as most of the signallers are now out on outpost duty on the surrounding hills and a cold job it must be too with no shelter.\n\nI am lying in a bivouac constructed of dried palm leaves in the cold sand and the candle burning inside a box. The only light in the camp and the reflected rays of light are carefully \nscreened\n screened away from the East (the direction of \"Jacko\"’s Scouts and patrols I came on duty at 9 oclock and ordinarily I am only required to do 2 hours, then go off for four hours and then on for another 2 but working \n\nthings on that basis it means getting up at 3 AM and remaining on duty till 5 (the coldest time of the night in these latitudes) so I shall remain on duty till 2 am and then sleep till 6 when everyone has to get up. Besides the other two will have a longer sleep.\n\nThe telephone receiver is close to my ear and I can hear the various outposts calling to Brigade and telling the operator there that so & so is \"all clear\" each hour and periodically Brigade call us all up and get the \"all correct\" report just to see that all the operators are awake. Some one is speaking now from the extreme left of the whole line of outpost \nlines\n back to Division asking about times of trains running to Kantara. All this is many miles away. Occasionally some one on the outpost line calls the Brigade operator and asks the time, which is given, and silence – the silence of the great desert world around us reigns supreme.\n\nAs I lay here and write this it brings to my mind the last time I did any duty on the telephone and that was on the 18th of December 1915, the night we evacuated the trenches we had held at \"Destroyer Hill\" on Gallipoli.\n\nI had been specially told off by the Colonel to remain behind and send \n\nthe last message through to Brigade. \n\nThere were three final messages to be sent through on that memorable night. The Regiment left in three separate parties for the boats which were waiting at \"William’s Pier\". The first party (Known as the \"A\" party) left about 8 oclock. The second (B) party left about 9.30 pm and the last party (C) and the last of them to leave at 10.45 pm. I had to remain behind and wait until the tail of the column had disappeared around the corner before sending the message as otherwise the naval authorities arranging the transport of troops with the barges out in the harbour to the troopships anchored there would be given wrong times and everything was times to the minute.\n\nSo I sat down outside the dug-out which did duty for a telephone box and looked down the gully to watch for the tail end of the troops to disappear around the corner. At 10.45 pm the last man disappeared and I went into the telephone box and put my hand on the key intending to send \"L.H.A.\"","31":" Light Horse Brigade Head Quarters) and the telephone refused to \"buzz\". Previous to this I had tested the instrument and it was in good going order. This was extremely annoying because so much depended on that \"C\" message getting through to Brigade and being transmitted on the the Naval \n\nAuthorities at the beach. And I had been specially detailed to remain behind and that particular message was entrusted to me. The Colonel having every faith in me.\n\n It must be understood that a telephone is not of much use unless one can make it buzz when calling up the distant station. The mere voice stands a poor chance of getting through to the Brigade operator who has sometimes dozens of lines to attend to and with everyone buzzing \nhim\n to attract his attention one can always get through but the voice is completely drowned \n\n(Diagram is drawn here showing three squares linked by lines – alongside top square is written – Destroyer Hill Trenches Known to Signallers as \"Y.Z.\"- the middle square, to the right, has written alongside it – 12 LLH Rgt \"M H\"- and the lowest square, on the left, has written alongside it – Brigade Head Quarters \"L.H.A.\"\n\nThe above rough diagram gives a rough idea of how I got the message through eventually. I tried that phone by all methods known to me how to get a contrary phone to work (and I know a few) but it was no go. And time was pressing. That message should have gone through many minutes ago minutes were by the way of vital importance on that, and the succeeding night when the final Evacuation took place. I tried with the voice but there was so much buzzing and talking going on that it was impossible to get a hearing. As a last resource I decided to try and get through by the \"M.H\" (1st Regiment) line. I tried with the voice but the 1st Regiment operator was in communication with some one away over at the 5th Brigade miles away, and when he had told me in the most gory and lurid language to get off the blanky line and not interrupt I had no choice but to wait, and the man at the other end was the slowest operator I ever heard taking a message (evidently a Novice). There were frequent interruptions and it went something like this \"Yes I got that but what was after that\"? \"M.H\" – \" \"At the time stated\". The other end – \"At the what\"? \"MH\" – \"At the time\", - \"Time\" no TIME\" T-I-M-E\"! The other end – \"Oh yes of course \"time\" \"Yes\"? M.H. (dictating) \"Stated\" The other end – \n\n \"What was that\"? MH. \"Stated\". \"What\"? how do you spell it M.H.- \"S-T-A-T-E-D \"! The other end \"Yes I got that \"after stated!\" and so on.\n\nGood heavens would he never get that message through! The clock (or rather watch. was ticking on and the regiment would by now be near the beach and no notification of their arrival and on such a night too! To say that I swore lustily, heartily, roundly, ungentlemanly, would be putting it very mildly. Apart from that the danger was great I was the only solitary man holding the whole of the Destroyer Hill and trenches rather a big job for one man and the Turks could easily have found out that I was all alone and hey presto! for Constantinople. It would have been madness to fight ","32":" af\n \n\nSo after a delay of over 20 minutes \"philgarlic\" got his precious message through and \"M.H.\" attended to me. I said \"for Heaven’s Sake put me through to Brigade my buzzer has gone wrong I am over 20 minutes late now.\" He got to work and I could hear him buzzing \"L.H.A.\" for all he was worth presently a reply came back. Brigade – \"Hello\" M.H – \"Y.Z wants you he has got an important message.\"\n\nBrigade operator to me. \"Hello! Y.Z do you want me\" M.E – \"want you? by Hell if I could get near to you I’d get you too you blank Etc Etc. What the Marble Arch do you mean by \"plugging me out\" (He had pulled the \"YZ\"\n\nplug out when taking some other message to lessen the noise on the instrument and had forgotten to plug me in again.) \"Damn you I said \"I have got a message here most important a matter of life and death and you go and plug me out The Brigade operator – \"I Didn’t plug you out\"\n\nI gave him a candid opinion of himself and all his family history asserted that he had positively been a liar since he first learned to articulate and was likely to continue so for the rest of his (short I hoped) life. And would he now very much oblige me (or the naval authorities at the beach particularly) by taking this last message as it probably be the means of saving many valuable lives\n\nHe took that message in the quickest time I have ever sent a message through yet. A bit different to the one quoted above and then I destroyed the wire disconnected the phone went outside and put my pack on. After various contortions I succeeded in getting my arms through the slings of the pack and then found that I could not get through the \n\ndoor of the dug out to reach the telephone. \n\nHad to take the pack off again and get the phone cane out and struggled into the pack picked up the rifle and started off down the hill\n\nBut it never rains but it pours I came to think of the important message I had left on the table. Good Heavens was there ever such a similar chapter of accidents? Had to come back and unpack again and go inside and that got for dammen message I had revenge I kicked the lamp through the roof of the dug out and left it burning (2 AM now and I must go off)\n\n29th Wednesday 1916 ARNUSSI Wed \n\nHaving a rest today clipping horses, Butler was sent into Mazar to fetch back 2 bags of telephone wire and as usual he did the wrong thing and brought back two \nCOILS\n ! instead of the two bags. Extra duty on the telephone for that.\n\n30th Nov 1916 ARNUSSI – Thursday. –\n\nNothing to report-\n\n1st December\n 1916 ARNUSSI ~ Friday ~\n\nThis proposed shift of ours seems to be long deferred for some reason or other For my part I am not \"bursting\" to go. All our horses are being clipped and shod probably that’s the delay. Very cloudy today yesterday afternoon a Taube came over and hung around Mazar about 4 miles back and it seemed as if he dropped bombs. However our anti-aircraft guns opened up on him and there hundreds of puffs of smoke in the sky where the shrapnel was bursting around him. Some went dangerously near. It is a very difficult matter to shoot with any degree of accuracy at these \"birds\". They twist and dive \"every which way\" as Mark Twain said.\n\nThere is no doubt \"Tempers does Fugit\" here we are in the last month of 1916 and the war still goes on with undoubted rigour. It seems as if it will never end.\n\nIt was a grand sight yesterday afternoon to see our planes chase the Taube just like a lot of eagles after one but the Taube had got too \n\nmuch start before our men could get up to his altitude and anyway he had too much pace for our machines even starting level. Those Taubes can go about 115 miles per hour probably a little more if pressed whereas our machines can only go 98 per hour. So the only time there is an aerial fight is when the Taube comes back to give battle then it’s a sight worth seeing.\n\n(Diagram showing a straight line with dotted lines coming from it. Marked on the straight line are the following:\n\nBIR AL ADB with a dotted line going down to HOB EL GEEILA,\n\nBIR SALMINA . MAIN CARAVAN\n\nBIR MOSEFIG. ROUTE TO PALESTINE\n\nBIR EL MAZAR with a dotted line going down to ARNUSSI and a dotted line from there going up to GERERAT\n\nEND OF LINE with a dotted line going across to EL ARISH (TURKISH) and under this line is written: about 18 MILES)\n\n2nd December 1916 Arnussi Saturday\n\nWent out on patrol today. Escort to Brigadier General Cox to our new Camp GERERAT – about 5 miles further out in the desert towards El Arish – we shall be going there in a few days – should have been there for some time now but the water was not satisfactory. The Engineers have been working at deepening the wells.\n","33":" \n\nEverything very quiet. Church parade. Getting ready to move to Gererat tomorrow at 10.30 am.\n\n2.45 pm. A Taube came over-\n\nhead and was trying to reconnoitre but those planes of ours have been sailing around all afternoon and the Taube came right into a hornets nest for no sooner had he appeared in sight than our machines set after him he did not wait but turned tail and flew – literally flew – with one of our machines in hot pursuit followed immediately by 2 more flying some distance behind. Our man got \ngot\n on the flank of the Taube and headed him off and emptied a few shots at him which apparently missed for the Taube flew away in a North Easterly direction making for some great banks of white clouds eventually disappearing.\n\n We have now got the Australian Flying Corps on the job and not as formerly when a Taube could come along of his own sweet will and stay as long as he liked. When a Taube is sighted now the procedure is for one plain to mount straightaway and make for him and the other planes also mount and go on either flank at full flying speed hoping by this means to cut him off or he may turn from the pursuing plane and turn into either one of them. So the Taube now has to look out for himself and literally speaking his job now is not plain sailing. \n3pm\n up to now about 5 of our planes have returned and we only saw about 2 go out!\n\nSome of them are still in the air buzzing like angry bees.\n\nCpl Smith & Mather have returned from Zoabatia where they have been on outpost duty with B Squadron for some time. Dorricot the third man has gone to the Field Ambulance (Hospital) suffering from Dysentry.\n","34":" GERERAT Monday\n\npacked up and vacated our previous camp at 10.30 am. Had to carry our blankets on the saddle and there was some fearsome looking bundles too. I borrowed a Kodak and took a photo of my horse. I don’t think I could have found room for anything else I even had a shovel.\n\nTrakked across the desert and came into this camp at 10 00.\n\nThere is nothing to write about at this camp – just a camp among the undulating sand dunes. We have a long way to water rather too far I think.\n\nNo 1 outpost is 150 ° } (bearings taken )\n\nNo 2 outpost is 209 ° } (of the outpost positions)\n\nto camp 280 °\n","35":" GERERAT Tuesday\n\npatrols going out all day.\n\nThere is a patrol of 20 men and 2 Signallers (Wilson and Mercer) under the command of Captain Brown\n\ngoing out this afternoon at 5 pm they are expected to be away the best part of two days. They are ordered to travel as light as possible, no blankets nor greatcoats. They are going out ahead somewhere among the innumerable sand dunes and desert which is in front of our position. We are all joking with them and saying that they will be captured and taken to Constantinople. I have lent my fur coat to Wilson and I tell him to be particular to ask the Turkish Commander (through the interpreter) to be allowed to retain that coat and I can get it off him after the war! A German Taube came directly overhead at 12.30 pm and caused some excitement for a few brief moments. He dropped 3 bombs but about a mile although if he had continued to drop them about the 5th or 6th would have landed in the camp. It was the old familiar (but greatly dreaded) whistling sound of the bombs coming through the air. They landed with a terrific reverberating crash and splinters (fragments) fairly screamed through the air. We led our horses quietly off the line and dispersed he flew past us on to Mazar then the guns got after him and our own machines and he went back along the coast for home. \n\nNo good being frightened of them as Josh Billings would say \"If yer gits em yer gits em\" and that’s all about it. I heard a fellow say recently \"If your name and address is on em you’ll get them\".\n\nThis special patrol which has come out has orders to go to the Wadi El Arish South of Gel Arish itself and will go inside the enemys lines – and ask for water several engineers have accompanied them. They are going on a very dangerous mission I wish them luck.\n","36":" Gerarat Wednesday\n\nMail day. Got 3 papers. I was ordered to go out at 6 this morning on a special patrol in support of Captain Brown’s patrol which left last night and had everything ready but later it was cancelled the 3rd Light Horse were doing it. Have been eagerly searching the horizon all day for signs of the patrol which went out last night up to now – no signs. (2 pm)\n\nOur cook Smythe has gone away as cook to the A.I.F. Canteen Staff back at Railhead and we had Watts from C Squadron in his place but he has no love for the job and he went this morning.\n\nNow we have Campbell hope he sticks to the job its such a nuisance having to change cooks because it takes some time to get established and get into the running of things, George was a good cook and we were all sorry when he left us. I only hope he does not give satisfaction where he has gone and that he may come back again.\n\nCaptain Hockey our Quarter master went away sick yesterday and has gone back to the base – somewhere, we never know where men go to when they evacuate sick.\n\n3.30pm\n\nThe patrol has safely returned they have gone quite 20 miles in an Easterly direction penetrating the Turkish lines without seeing any signs of any Turks and tested the Wadi (Valley of El Arish for water but the nature of the ground was too hard and none could be found which may necessitate a slight alteration in the original plans.\n\nNumbers of Bedouin Arabs were encountered which were however not molested. They were \"Some\" Scared at the approach of our men. The men state that the cold during the night and early morning was intense. The horses have covered nearly 60 miles with less than an hours rest and for the most part the journey was over undulating Sand \n\ndunes, but near El Arish the ground is stoney & good going. In doing this work a very successful reconnaissance has been accomplished.\n","37":" Gerarat Thursday\n\nI went out this morning with a special patrol going about 12 miles forward of our present position to reconnoitre and take bearings of the various positions. No Turks were encountered en route but every indication of recent patrolling by camel patrols which they doubtless send out under cover of darkness of course we do the same so its all in the game of war.\n\nWe saw the Minerat of the Mosque at El Arish from a high sand hill so we have seen \nsome\n of the place which we are going to take (I believe that is the arrangement) El Arish is a rather large city with about 30,000 inhabitants that was before the war. It is an important trade centre and is on the direct \n\n caravan route between Jerusalem and the Holy Land generally and the Suez Canal El Arish I believe stands on the Egyptian border beyond it is the Holy Land. Dozens of patrols are out each day and night constantly on the qui vine.\n\nThe Heliograph is playing a most important part in these desert operations and I don’t know what we should do without it Despatch Rider would be totally out of the question. The only trouble about it – or rather I might say – disadvantage – is that the instrument requires an experienced operator – both for operating and also in reading it. But fortunately I have at present a good supply of good and efficient operators.\n\nThe telephone lines to the outposts are laid along the sand from headquarters to the various posts and we frequently have great trouble by having these lines broken by the various patrols who are trekking across the desert. The worst trouble is at night because the patrol does not realise that the line is broken and consequently ride on totally oblivious to the damage they do, it cannot be helped. In the daytime when the line is broken it can soon be seen and remedied or a report will be sent back to say that the line is broken. The unfortunate linesman has great difficulty to find the ends of the broken wire in the dark. He will run one end through his hands as he goes along but the horses\n\nwho break the wire generally continue to carry the other end a good distance away on their legs.\n\n8th December 1916 Gerarat Friday\n\n2 years ago today or rather tonight we walked from Cairo main Station out to Maadi Camp leading our horses (a memorable march that) \nour\n \n\nOur Aeroplanes are busy this morning flying in the direction of El Arish probably to give \"Jacko\" another issue of \"Iron Rations\". They do him good. They are on the same principal as a few fleas on a dog – they keep him moving -. By the same token they keep us moving too when the Taube retaliates.\n\nHave been repairing and over-hauling all the Heliographs this morning some were very full of sand which cant be helped. My dear old \"John Willie\" the most inoffensive horse in the world suddenly went \"Magnoon\" this morning when I was grooming him and he kicked me on the knee – laid me out for a while no damage done only \"Contusion and slight shock to the system\" poor old fellow I verily believe he understood the enormity of the offence because when he kicked me he jumped back to the full extent of his chain and stood looking at me \n\nwild-eyed and appeared thoroughly frightened.\n\n(Drawing of grass and on the left another drawing labelled: \n\nSection of Sand-covered Root). \n\nAlongside the main drawing is written:\n\nSpecimen of JOINTED GRASS found in the SINAI PENINSULAR principal article of diet for the BEDOUIN’S CAMEL. Horses are fond of it too","38":"\n\nThe remarkable thing about this grass is that there is a coating of pure sand around each root which is fast to them when pulled up. Grows to a height of about 3.ft.\n\n9th December Aererat Saturday\n 1916\n\nHeavy dew in the night which explains how plant life in the desert exists in the rainless regions. It is necessary to have an oil sheet (waterproof) to put over the blankets at night \n\nto guard against getting wet. Last night was full moon and it was almost as light as day. The nights by the way are long. We have to \"douse\" all the \"glims\" at 1900. and there is nothing left but bed then.\n\nAbout 9.30 today a German Taube came right overhead flying about 6000 feet up and the strange part about it was that only 5 minutes previously one of our machines came over from the same direction both could be seen in air at the same time although many miles apart both totally oblivious to the presence of the other and both flew away in a northerly direction. About an hour afterwards our plane came back. We are clubbing together with money and Sergeant Matthews is going to the AIF Canteen further back along the line to purchase canteen stores.\n\nA prospectus has reached us asking us to invest in war loan stock redeemable in 1925 at 4 %.\n\nLewis the transport driver was transferred to the Imperial Camel Corps this morning.\n\nThe Railway had reached Kilo 123 when we first came to this Camp (4th Dec.) and it has now reached the 127th Kilo. From the 123rd Kilo onwards they are making a double \n\nset of lines the reason is obvious.\n\nOur Lewis gun detachment used their Lewis gun (anti aircraft) today for the first time in this camp but one might as well shoot peas at these Taubes for 2 reasons. (1) There is no fire observation to tell how the shots are going and (2) He is invariably out of range. He is cunning enough to see to that. His Aneroid Barometer indicates when he is beyond rifle and machine gun range. Artillery shells can (and do) catch him sometimes but the chances are small.\n\nLatest news. Asquith has resigned and Lloyd George supercedes.\n\n7pm (Written by Moonlight)\n\nLatest from the telephone. Increased enemy activity at El Murra (4 miles away) Outposts must be vigilant and report any suspicious movements of the enemy. I am going out with a special patrol as the Signaller tomorrow to El Murra there are some Engineers going there to test for water\n\nHave just given the horses their 7.30 feed and now for bed.\n\nWilsons mare\n \n\nWilsons mare Lady Barratt by name got loose the other night and caused hell’s delight by galloping all around the camp over everything and everyone all the picquets attempt to catch her failed. She is the worst horse in the whole regiment when she does get loose. Last night again she slipped her head collar and went careering around through the camp the unfortunate Sentry on our lines going frantic we told him it was simply impossible to catch \"Lady Barratt\" but the poor fellow had to make some sort of attempt as part of his duty. She kept each sentry busy as they came on duty. But the amusing part of it was She would persist in galloping at racing speed (and she \ncan\n travel too) right through the officers bivouacs upsetting buckets etc in her mad gallops. The bivouacs by the way were just palms sticks stuck in the ground with a few bushes around and on top to keep the dew off and the officers were afraid to go to bed for a long time thinking she would collide with their frail shelters Some one \nsaid\n yelled \"who owns that horse\"?\n\n \n\nNo one spoke and they didn’t find out till this morning. Now \"Lady Barratt\" has to have a heel-rope on in case she gets loose again.\n\nShe kept me awake for about 3 hours and she missed my bivouac (\nan\n a waterproof sheet spread on flag poles) by only a couple of inches several times. And she wound up her performance by drinking some one’s water in a bucket which the fellow had carried through the sand about half a mile and eating a couple of loaves of bread.\n\n10th Dec\n 1916 Gererat SUNDAY\n\nI went out with a special patrol to several places on ahead where it was reported \"Increased enemy activity\" we started off well protected by a screen thrown out in front we went to – and beyond – where the enemy were reported but no signs of Turks were observed at ABU ARTAA, EL MURRA, & UM ZUGHLA. All was clear the last named place is about 10 miles further out than Gererat: portions of the town of El Arish were plainly visible. We started back for camp about 4 oclock and finished the journey in the dark. We were coming along at a good fast pace when a figure on top of a sand dune in front called out \"Halt!\" We \ndid\n halt too. There is no mistaking that challenge. \"Who are you?\" \"Friend\"! \"Advance one and be recognized!\"\n\n \n\nThe major rode up to the foot of the sand ridge and said \"Patrol of the 2nd Regt returning from UM ZEGHLA\". The voice on top – \"That’s no good to me come up and be recognized\"! Our Commander said \"Its damn steep, climbing up there Im Major Chambers of the 2nd Regt\". The voice – \"All right pass on! Its wonderful the amount of authority a man possesses when he is on outpost duty one private can do what he likes with any party of men or any officer no matter what rank. That deadly .303 pointing straight at me has a magical effect. When he says \"Halt\"! you Halt. There is no second command. Three times we were halted and recognized.\n\nThe country ahead of here is mostly undulating sand dunes with scant vegetation and the further out the ground gets harder and is much better going for the horses being hard crusted sand and further out again in the vicinity of El Arish is stoney country with less vegetation. There is a great range of rocky mountains which run in a Southerly direction from El Arish with some very high peaks very suitable places for observation and Signalling Stations some of the peaks being 1000 feet.\n\nWhen we were out we heard some bombs being exploded back towards our lines some where and later on a Taube came past us flying very low and going at a terrific speed making \n\n \n\nfor El Arish his headquarters Cannot account for such tremendous speed unless he was hit by some of our Anti-aircraft guns and was anxious to get home in safety to save the machine. Later report states that there were two Taubes and that one of them got brought down. That may be but we only saw one return. Also (report says) Armussi our previous camp was bombed (the \na\n New Zealanders are there) but don’t know the result. We are as bad off here for news as if we were thousands of miles away Its surprising. For instance a Taube comes over and drops bombs on a neighbouring Camp or on one of our railway stations we hear the rending crash of the bombs quite plain and see the white puffs of smoke from the bursting shrapnel all round the plane and see the plane depart for home at top speed generally to prevent aerial combat with our machines. But we scarcely ever hear the result of the air raid So the only reliable information is anything which happens to ourselves.\n","39":" GERERAT MONDAY\n\nButler is very much before the public eye lately. Yesterday he had an interview with the Brigadier as he is getting an appointment in the Royal Flying Corps at Kantara and last night he was on telephone duty on the outpost line and Major Birkbeck the Commander \n\n \n\nof the outposts found him asleep on duty. He has been brought up before the Signal Officer this morning as a temporary proceeding but the case has been returned to the Commanding Officer to be dealt with later on. Butler states positively that he was not asleep and the prosecution alleges that he was and so the matter stands.\n\n11.15AM. Result of Butlers case \"Severely reprimanded\" don’t let it happen again.\n\n12.30 pm. Same date.\n\nJust had another Taube scare we could hear him coming but could not locate him on account of great clouds when he was visible there was a holly Scatter to get clear of the camp. We spread out to the four winds of heaven like a drop of oil on water. He came directly overhead and when he had passed our camp he let go 3 bombs They came down through the air like express trains they make terrifying sound – and they burst the other side of our watering place among the sand dunes – no damage done He came back to see the result of his work – circled around a while – and then flew home. Much to our relief. The popular cry is \"Stand to your horses\"! \"Scatter\" \"Get to Hell out of it\"! The slowest men at other times are generally the first away on these occasions.\n\n \n\n12 th December 1916 Gererat Tuesday\n\nMade a \"diagram of Communications\" this morning showing where our telephones are situated on the outpost line. At 12 noon the Taube paid us another visit flying very high but did not drop any \"Iron Rations\" on us much to our relief. But I think he dropped some back further. The guns opened up on him and he was seen to escape through a patch of smoke puffs. I am thinking that he will lay with the cat till it scratches him so to speak. One of these days he will assuredly come to grief.\n\nBought a camera from Probert a No 2 Brownie quite new so I have got a new toy now.\n\nOHalloran came back from the Signalling School yesterday that makes our total strength 19 men. \n\n13th Dec 1916 Gererat Wednesday\n\nI have been on a lookout Signal Station looking out for signs of a patrol of ours which went out this morning. Rather warm work sitting in the sun all day. Our aeroplanes have been active all day flying in all directions ready for Fritz But he did not appear today luckily for himself. The patrol which went to UM Zuglar was fired upon by Turkish outposts. Long range shots only but shots nevertheless.\n\n \n\n14th December 1916, Gererat 1916 Thursday\n\nOur planes very active this morning Mercer bought into camp an unexploded German bomb when returning from outpost duty last night. The most foolish thing he could do I think! It is highly dangerous to meddle with it. I took measurements of it and several men photographed it and then it was given a military funeral with all honours. \n\n(Then follows a drawing of the bomb with total length being shown as 59 cm. The top portion is marked HANDLE and the next section, shown as being 4 ½ cm, is marked – metal collar or guide for keeping the bomb upright. The next section is shown as 15 cm and is marked – Pear Shaped Bomb. The drawing is continued on the next page.)\n\n \n\n(This portion of the drawing is marked STRIKER and shown – Length of pin 29 cm.)\n\nThis \"Striker\" hits the ground and Explodes the charge contained in the pear-shaped body. The body of the bomb by the way is made of cast iron and the pieces fly \"every which way\" when it explodes quite an ugly looking arrangement.\n\n2.30 pm.\n\nUp to now our aeroplanes have been exceptionally busy streaking across the blue dome of Heaven from one point to another especially towards midday and for some time after. But just as they have gone down again and at half past two a ‘plane was sighted and lo & behold she was a Taube! Now was there ever anything more annoying? Hour after hour those machines of ours had patrolled the blue vault above keeping up for hours at a stretch and at times going as high as any Taube normally goes (about 6000 to 7000 feet) There were 6 of them together circling around like huge dragon flies and no sign of the Taube and as soon as they come down the Taube appears. He drops 5 bombs about a mile\n\n \n\nfurther west than this camp. Machine Guns going mad, our own Lewis Gun joining in the general chorus aeroplanes rising up liked winged creatures after him but hopelessly left behind both as regards speed and altitude. And so Fritz scored another point. If it wasn’t for the tragedy of the thing it could be a decided comedy. It would almost seem as though Fritz had stayed calmly out of harm’s way perched up in a cloud as it were and watched the gyrations of those planes of ours and then when the coast was clear he just hopped off his perch and came soaring over the camps \"wihitherso ever he liked\" I wonder what would happen if he were a dozen!\n\nI have used the term \"Fritz\" because these enemy airmen are either Austrian of German: no Turk ever ventured so far from mother earth. A Turk does not care how high he goes so long as he has one foot on the ground\n\n15th December 1916 Gererat Friday\n\nwas sitting down to breakfast this morning at the cookhouse and I heard a far- off low hum – reported this – but no one took any notice. About 5 minutes. The hum became louder and someone looked up and said \"There he is!\" Sure enough it was a Taube but coming from the \nNorth\n instead of the \nSouth\n.\n\n \n\nEveryone was craning his neck looking for Fritz from his usual direction with the consequence that he got right overhead before he got clear of the line He flew away South and finally disappeared in the blue. Our planes came charging out from their base but Fritz had got a good start. Luckily he did not drop any bombs on us. Some of our men went out and we could plainly hear loud explosions in the Turkish lines. Several miles East of here. If Mr Fritz drops one bomb we drop 10 on him. But he must continue dropping them on us as often as he can its all in the grim game of war. We usually get a good deal of amusement out of these scares. \n\nIts funny to watch the antics of some of the fellows in getting their horse clear of the lines. The horse sometimes will not open his mouth to get the bit in then, as usually happens – the chain gets stuck, around the rope where he is fastened to – which wastes much valuable time or probably the man cant find his head stall, then a desperate search ensues. The nosebag is nearly always on (He nearly always comes along at feeding time) and there are two small leather tabs on either side of the Headstall to keep the bag in position. The bag must be removed first \n\n \n\nand these tabs sometimes get stuck or are hard to open. \"In short\" (as Mr Micawber says) a dozen things may happen before one can get away from the lines with a clear start. And, a clear start is very essential! \n\n2.30 pm. Just been interrupted to get prepared for a General Inspection by General Sir. Phillip Chetwood who is the new Desert Column Commander along with Major General Chauvel Commanding the ANZAC Mounted Division. He was our old Brigadier until after the Evacuation of Gallipoli. General Chetwood was a Cavalry Brigadier during the memorable retreat from Mons! He looks a live sort of person.\n\n16th December Gerarat Saturday\n\nWent out this morning on a special patrol with some officers belonging to the Divisional Staff. They are out reconnoitring and taking careful compass bearings and various other pieces of information destined to become useful soon. We went much further than any previous patrol getting about 5 miles from El Arish. We saw plenty of Turks on outpost duty a good distance off we did not fire on them and they did not fire on us probably realising that there would be plenty of time for that. They have outposts all along the sea coast\n\n \n\non the main Caravan Route and there are no outposts a mile or two inland. There are reported to be plenty of Turks for the defence of El Arish but then we have got plenty of troops to attack it and \"we fear no foe in shining armour\"!\n\nAbout 2.30 pm. A Taube came over the camp we were many miles out and we heard distinctly the distant clash of bombs and the banging of guns which were shooting at the Taube – needlessly to say – missing him at each shot. He sailed away but came back again towards the camp where one of our ‘planes were rising to meet him. \n\nThen he flew off hotly pursued by one of our machines which was left hopelessly and helplessly in the rear. They came close to where we were out in the plain and continued to shoot at each other at long range. When the Taube had gone beyond reach of our man he turned about and came back intending to have a go but our man had gone back then the Taube shut off his engine and Vol planed down towards his nest. Who ever that airman is he has courage to say the least. After he was driven off by the guns he came back and dropped 4 bombs on one of the Camps behind killing several men. One of these days he will go too far. Then he will be like the pitcher which went\n\n \n\nto the well once too often – and got broke. \n\n17th December Gererat Sunday\n\nWe had church parade about 500 yards away from the horse lines I was patiently awaiting \"Fritz\" for 2 reasons one was to break up this absurd parade under such conditions and secondly to see the mad scramble to get back to the horses to get them clear of the line I cant imagine anything more amusing under Heaven. \n\nLast Sunday we had their ridiculous church parade close to the lines we have patrols going out both day and night and outposts in various places and we (the Sigs) are finding 14 duties each day with 17 men and when there is a chance of getting some little rest \"Oh! You must go to church!\" The parson lays at full length all week day and night and only bestirs himself at meals and then he comes on on Sunday morning and \"yanks\" us out for church. I don’t blame the parson but I do blame the rotten system of working things in that respect.\n\nEach of us got a Billy can today from Australia filled with a multitude of good things.\n\nAbout 2.30 pm this afternoon braving all hidden dangers a German Taube was sighted over some of our\n\n \n\npositions back along the line. Now, all morning there has been 17 of our machines over the Turkish lines bombing hell out of them and this afternoon about 7 or 8 of our planes have been patrolling the blue Vault of Heaven for signs of Taubes. And right amongst them like a hawk among chickens is seen a Taube! Was there ever such brazen cheek? He did not drop bombs – probably hadn’t time – and at least 4 or 5 of our planes at top flying speed after him.\n\nThe Taube sailing away as gracefully as a bird and as usual leaving our machines hopelessly and helplessly in the rear. Talk about speed, it was the very limit. But he got away safe although Fritz played no monkey Tricks today inviting our fellow to \"Come on\". He was quite content to make leave a clear pair of heels behind him. \n\nOur planes have just come back buzzing like angry bees probably at their disappointment at not getting close. It would be interesting to catch a couple of those Taubes then Fritz would have to look out for squalls.\n\n18th December 1916 Gererat Monday\n\nvery heavy dew it was last night it was as though it had rained.\n\n \n\nAbout 10.30 am this morning I was out visiting one of the Signal stations when a Taube was sighted away back among the various camps. Presently the artillery commenced shooting at him but he was literally miles above their highest shots. It was wonderful, the \nundecipherable\n altitude he reached. Our planes started off ahead of him flying towards El Arish to endeavour to cut him off and rising gradually. But The Taube came flying over the heads of them and sailed away like a Huge bird for home. Barring accidents Fritz has the situation well in hand every time and enemy and all as \nhis\n he is one cannot help but have the greatest admiration for him; for his wonderful pluck and his dash and his cleverness. As Napoleon said to the British \"I hate them, I hate them, yet I cannot help but admire them\".\n\nRSM Crane SQMS DRN Walker Sgt Pat Jones & a few more back from Details yesterday\n\n19th December 1916 Tuesday\n\nWent into Mazar about 8 miles across the desert back along the line to attend the dentist to get a tooth filled – found on arrival \n\n \n\nthere that he could not do it – says it wont stand filling – suggests I wait until an opportunity to visit a professional man in Cairo – it will have to be crowned. On the way going in Two Taubes came over making for Mazar. Found on arrival there that these two devils had paid the place a visit successfully dodging the anti-aircraft guns and between them dropping 14 bombs all over the camp. Not much damage. The Y.M.C.A. tent was blown to rags a bomb had hit first on the corner of the large tent remarkable to relate no one was hurt. Although 2 natives were killed and one camel a very small loss considering.\n\nOur planes (13) went over the Turkish lines above El Arish at a place called Bir Saba where the Turks have a base and dropped 86 bombs with great effect. They did not drop them haphazard but \nwith\n systematically. They were bombing all day which proves that the bombs were dropped in the proper places. Our secret agent reported that it had a terrible moral effect on the troops there. They scattered for miles over the desert – The piano in the YMCA was wrecked.\n\n \n\n20th December 1916 Gererat Wednesday\n\nOur aeroplanes are out early this morning and circling around – of course there is no Taube – Big lot of Canteen stores being distributed very cold this morning and heavy dew. S S M. Fanning has come back to his Squadron as S.S.M. and R.S.M. Crane officiates as the R.S.M. Expecting a move out into the desert shortly.\n\n2.30 pm.\n\nSudden order pack up & get! now for it! pack all saddles and get rid of all spare \"dimmage\" and now we have the saddles packed and ready to put on. The 3rd L. H. Brigade camp came past the camp at 3.30 and they state that they are going on. Which means that they are going only as far as possible probably El Arish if there is not too much opposition. El Arish is reported to be clear of Turks but don’t know how true that is. I believe every one on our side is moving. The next few days will be busy. Hope we have plenty of shells – and plenty of aeroplanes for the daytime.\n\nHave just drawn 2 days rations shall certainly be out all night it will be like the old reconnaissances we took part in at Romani.\n\n \n\n21st December 1916 EL ARISH! Thursday \n\nEl Arish at Last belongs to us!\n\nWe started out from our old camp Gerarat at 6 pm and started for the desert. The 3rd Brigade and Imperial Yeomanry went along the coast where their (the Turks) outposts have been observed at various times. The New Zealand Brigade went out to the Wade El Arish and around behind them to try and cut them off and the 1st Brigade took a position behind the two. We marched in \"column of route\" during the exceedingly long and painful night march. Not a wink of sleep and about 10 minutes spell each hour. At daylight this morning found us sweeping towards the town like a huge net. But Jacko had flown! He must have smelt a rat. I am sitting on a sand dune about a mile away from El Arish writing this and there is a cold cutting wind playing around. Today is rather a memorable one in the history of Egypt it marks the 2nd anniversary of the Expulsion of the Turks and the end of the Turkish Rule which had prevailed for 400 years. Two years ago we paraded the streets of Cairo and annexed the country for Great Britain.\n\nLater Report same date.\n\nBivouacked in among the Sand Hills to the N. E. of El Arish all soft sand. Bad spot for wood took 20 minutes to collect enough sticks to boil the billy.\n\n \n\nWhen the horses were going down to water near the beach Someone set off a contact mine near the water troughs and unfortunately killed a Sergeant Major and a Sergeant of the 1st Light Horse Regiment. They were literally blown to pieces must be careful and not go sightseeing around El Arish.\n\n3. pm.\n\nMoving off from here further down on the flat too far from water here. A Taube has been dropping bombs on our railhead miles back and he came sailing warily over us on his way back home.\n\n22 December 1916 EL-ARISH Friday\n\nThis place is close to the Sea and we can see all sorts of craft out in the water. About 4 or 5 cruisers Torpedo boats and monitors & mine-sweepers came close in also general transport ships presumably to discharge stores. Our railway which has been built up from Kantara only (at present) reaches KILO 127 that is about 16 or 18 miles west of El Arish. They will doubtless soon bring it right along. The Bedouin Arabs about here run about the place unmolested I don’t think they can do us much harm now. It was the roving bands of the desert that we were after. They were for the\n\n \n\nmost part spies and scouts attached to the Turkish Army. I have some sort of idea that we are going further on although I have heard no particulars. Down by the sea shore are palm plantations and large spaces with fig trees and there are the usual mud huts near the shore now the whole of those places are mined and it is highly dangerous to go sight seeing about here one may easily trip over a wire connected to a mine and get blown to (I musnt say where the Censor is looking!)\n\nOur camp is on the flat country about 2 miles North West of El Arish among a lot of fig trees and for once by way of a change we are not on the extreme advanced position. Someone else is in front. Its quite a treat to get back from the front line for once. There is so much work to be done so many duties to be found. When we are on the advanced outpost line a whole Squadron per day & night is on outpost duty and there are patrols to be found for various places some of them have to go out at all ungodly hours of the night. There are now 17 signallers doing duty and we have had to find 14 duties each day which did not leave much margin for rest. Sometimes they would\n\n \n\ncome off the telephone where they have been on duty all night and go on patrol come back in the afternoon and go on outpost duty at night next morning stableman or mess orderly and probably on the telephone at night or perhaps next morning go out on one of the permanent Signalling stations for the day. A complete day off is hardly ever known.\n\nWhile we are back from the outpost line the duties are eased up a good deal. At present we have only 3 men working the telephone which is connected to Brigade Head Quarters about a mile away. I am sleeping under a large fig tree and I have my waterproof sheet spread on the branches to keep off sun by day and the dew by night. There is a great scarcity of wood in this place one has to go about and pick up sticks no longer than a lead pencil and takes about 20 minutes searching before one can find enough to boil a Quart pot. Any other army it would perhaps not matter but the Australian Soldier must (simply must) have his drink of tea. I had a bad pain in my head yesterday through not having a drink of tea in the morning.\n\n6 of our aeroplanes went overhead early this morning to pay Jacko a visit and to drop \"Visiting Cards\" and by the same token a Taube paid\n\n \n\nus a visit but kept well away.\n\nJust signed a memo from Regimental office stating that we may move tonight and men must not take too much trouble erecting shelters. So probably we shall be on the outpost line again – maleesh –\n\nThose two men belonging to the 1st L H Regt who got blown to – that place – yesterday foolishly picked up a floating mine and still more foolishly dropped it after a good examination – moral – Don’t pick up and throw down – Unexploded bombs or floating mines. \"Let sleeping dogs lie\" Several casualties are reported today from men who have tripped over wires connected to bombs etc. We must understand that the enemy has only recently vacated this \"joint\" and he is full of \"Ruses de Guerre\" anyhow we fixed up all sort of contrivances for Jacko when we evacuated Gallipoli so it cuts both ways.\n\n23rd December 1916 EL MAGDHABA Saturday.\n\n5.30 pm. Last evening saw us packed up in full marching order, full water bottles full days rations, the unexpended portion of the days ration and 3 horse feeds and we marched out of camp and struck out South along the Wadi El Arish we got about 3 miles out and halted there for some unaccountable reason until 1 oclock in the morning. The night was – for those latitudes – very cold. I had taken a rubberized rain proof coat instead of the regulation great coat thinking it would\n\n \n\nbe warmer but have since learned differently. The information we got at this stage of the proceedings was as follows. \"An enemy force of about 2000 have concentrated at MAGDHABA about 22 miles S E of El Arish. These are doubtless a detached force from those who have evacuated El Arish to the northward. Our aeroplanes have located them whilst out reconnoitring and report that they are holding a strong position on arrival at MAGDHABA 2 Brigades of the ANZAC MOUNTED DIVISION will go around the left flank 2 Brigades to go around the Right flank and endeavour to cut off any possibility of retreat 2 Brigades to make an open frontal attack to find out enemys disposition and keep him occupied while the others \"get into position\".\n\n The whole of the Anzac Mounted Division under the Command of Major General H G Chauvel CB. reinforced by mounted troops of the 5th Mounted Brigade, Indian Mountain Batteries and several Batteries of 18 pounders commenced a long silent and rapid march along the Wadi to MAGDHABA. This Wadi or wide dry river bed stretches for miles into the interior and the going is good the sand being hard and crusted and very suitable to the horses. No words of command to be given no talking and worst of all no smoking. Anyone who is not a smoker cannot\n\n \n\nrealize what that means in its true meaning. If a man being a smoker \nge\n can get a smoke now & again it helps to soothe the nerves stimulates (apparently) the brain and passes the time pleasantly – but \"No smoking till sunrise\"! So the long and soul killing and mind-punishing bitter cold march commences. I said \"bitter cold\" so it is for these latitudes we gaze at the stars following first one, then another, as the direction changes, we are never tired of watching the progress across the vast expanse of the great dome of star spangled blue above – the great and beautiful constellation \"Orion\" with his magnificent diamond belt and the highest star in all the Heavens \"Sirius\" at his head. In its track across the blue \"Orion\" almost turns completely over. There are other things too – one thinks of home and friends when no conversation is permissible and the brain must remain active. And one often wonders what are the thoughts of those around one. At such times the brain opens one of those little almost-forgotten cells and reveals for inspection as it were or review some little incident which has lain hidden away perhaps for years and that wonderful grey matter.\n\nThese night marches are not without their humourous side too naturally so with so many men of different temperament The officer and I ride side by side the whole time occasionally exchanging \n\n \n\nwhispers about certain things connected with our work - then lapse into silence again. Then some ones horse stumbles and a smothered oath is heard and something to the effect that he has got four blanky feet cant he keep on them does he want as many feet as a blanky centipede before it is safe to ride him? Etc. Etc. Then he lapses into silence.\n\nAs I go along busy with my own particular thoughts, a horses head appears one side or the other followed by the neck then the rider sitting bolt upright and sound asleep. A sudden lurch forward brings him up with a jerk and he opens his eyes and stares around bewildered not knowing for the moment where he is. He can see troops all about and it takes some time to locate his bearings before he reins back and rejoins his proper section. He is very much awake now and determines to keep awake but the enforced silence soon takes effect and off he goes again. Generally when they come abreast I lean over and give him a sharp push which has a magical effect. Then the officer will suddenly increase the pace and go forward and get lost among some of the leading sections. He comes back and rather unnecessarily tells me that he dozed off, we make a joke about it and silence reigns\n\n \n\nagain probably the next moment \nI\n my horse gradually increases the pace and I am in the arms of Morpheus & pull up with a sudden jerk and want to get the others to come along till my place comes opposite then I rejoin. Sometimes the two of us go off together and on such occasions the signallers who are riding in sections behind straggle about and loose their places and some little time is wasted in getting order restored. For as soon as we go off \"wool gathering\" some one else has lapsed and things generally get mixed for a time. Men have been known to go the whole length of the column on a night march and sound asleep and sitting upright and our Trumpeter Sergeant has gone along for miles in the saddle sound asleep and never woke up. People outside the army could scarcely credit such a thing. \n\nSo we reached a place about \n3\n 2 miles away from the Turkish position Australians New Zealanders Camel Corps Indian Batteries our own batteries Yeomany and various odds and ends which go to make up a Division. Feed the horses and have a snack. Aeroplanes come overhead and go out to the Enemy position and the machines come down close at hand there are good places for landing and the observer gives the \n\n \n\nGeneral full particulars about the disposition of \"Jacko\" and his forces as near as he can he cannot of course go too low down to look for fear of being brought down. Although those airmen of ours are very daring and come down thousands of feet lower than a Taube ever does.\n\nOur Brigade the 1st consisting of the 1st 2nd and 3rd L H Regts and the machine Gun Squadron move forward and the various Brigades move off to their respective places and the fun commences. Our Aeroplanes up to about 9 a.m have dropped about 50 bombs and as they discharge their Cargo they come back with the latest report and load up with more high Explosive bombs and go aloft again. But \"Jacko\" is a wily rascal and when he sees our men come over he hops into deep narrow pits already dug for that purpose and gets out of harms way to a great extent.\n\nWe start off at a walk first and make straight the Turkish position. Then we trot and open out and for miles we move like the eccentric rods of an engine moving to the left then the right then back then forward then half left half right and move forward the whole time presently Swish – Bang! comes a shell which explodes at short range \nSiv\n Boom goes the gun again\n\n \n\nand after the lapse of several seconds Swish – Bang! much nearer this time. A few seconds after Boom – Swish – Bang! again, right in the spot where we have just vacated. Everyone moves to the left he trains his guns on our left and it nearly always takes at least two shots to find the correct range when he has found the correct range we have suddenly galloped of to the right some of the shells burst overhead and spray the leaden pellets about but strange to say no one is hit we still are gaining ground and getting nearer to the muzzles of those \"Swish – Bangs\". Then their machine guns open on us cutting up the dust all round us and the rifles open out as well. After a while we get that close that – well anything might happen. The order suddenly comes to retire in the same musical-ride fashion which we do the guns following us up to their extreme range. There is something decidedly exciting and facinating in this game of shell-dodging I have done and experienced some queer things since this war began but this is certainly the most Novel. The idea was to concentrate his fire and attention on us while the other Brigades worked around the back of him which they did successfully. I don’t think we lost any men in our manoeuvre although\n\n \n\nthe bursting shrapnel caused several horse to bolt some of them going right through the Turkish position and got clear away without a scratch. I had the greatest difficulty to hold my fellow especially when he turned about.\n\nWe had done our work and left the front of the position to the 18 pounders and the Indian mountain guns and some beautifully accurate shooting was obtained. The action developed into an artillery duel.\n\nLater on in the afternoon we made a flank movement and by that time \"Jacko\" was not so active with his guns probably out of action or else some of them removed.\n\nThe Turks fought gallantly up to a certain point (they always do that) and then the collapse came. First one batch surrendered and then another batch & so on our men closing in like some invisible vice tighter and tighter until what was left of the force who had been fighting were prisoners in our hands. As near as we can estimate at present and without any actual figures to hand there are between 700 and 800 prisoners for the most part unwounded and 2 guns. The casualties sustained by the Turks cannot be ascertained at present. Corpl Waddell of B Squadron was killed and there were several wounded other\n\n \n\nregiments had a few casualties. The","40":" Light Horse lost their Adjutant and another officer. Altogether the Expedition did not turn out too bad and it proves again the inestimable value of the Colonial Horsemen as desert fighters. The bulk of the credit for this little skirmish should go to our gallant and intrepid flying men who have shown such pluck and resourcefulness in gaining valuable information; coming down to within only hundreds of feet to obtain it thereby risking life and limb to say nothing of the valuable machines.\n\nWhen the whole business was over just at sundown we herded all the prisoners and sent them on to El Arish and after taking all rifles and ammunition and other war material and sending it back and a few little things for ourselves principally water proof sheets which are superior to our ow – we started for El Arish but the night march coming back was different we could smoke and converse and so the time passed more pleasantly. We halted at about 9 30 to 10 pm and again from 2 30 to 3 and the usual 10 minutes halt each hour. \n","41":" El Arish Sunday\n\nArrived safely back to our camp and are having a rest. The distance we covered during the recent reconnaissance\n\n \n\nto Maghdaba could not have been far short of 60 miles and only about half a dozen horses had to left behind to come along slowly. That constitutes a record. The Horses were splendid all through Everyone been having a good sleep all day they deserve it too after being two nights out of bed and fighting a severe action as well I awoke at 5 30 Am on the morning of the","42":" and did not get 5 minutes sleep until about 9 o clock on the morning of the","43":"\n","44":" El Arish Monday\n\nChristmas Day! How Tempus does Fugit. Last Christmas day I was on board the Allan Liner \"Ionian\" between Lemnos Island and Alexandria coming back after the Evacuation of Gallopoli Christmas dinner was Fray Bentos, and Army Biscuits No 5!\n\nToday I have one tin of apricots and I am going to celebrate the day with them Hoping for something better next Christmas. In the \"orders for the day\" appears the following \"The C O wishes all ranks a Merry Xmas!\" Oh! The irony of it! Also \"The C O wishes to thank all ranks for their splendid conduct during the recent engagement at Maghdaba and regrets to announce the following casualties -:\n\nKilled in action – Corpl Waddell\n\n \n\nWounded – Sergeant Allen and 7 others. \n\nSergeant Allen was shot through both arms. All the signallers have rigged up some fine shelters with some of the captured Turkish oil sheets. Sticks being very scarce in these regions the Turks carry with them short lengths of Jointed Stick and these are filled with a socket each short stick I mean\n\n(Drawing of a tent, on the side of which is written – Sketch of Bivouac Supported by joint sticks – and also a drawing - of a ?socket?, against the top of which is written – Shoulder which fits into the iron frame – and below which is written – Iron - and alongside the drawing is written -\n\nEach stick about a foot in length and as many as are necessary can by joined together – about one inch in diameter)\n\n (A further three small drawings follow – alongside the left one is written – Canvas Case for Jointed Sticks – and alongside the top one of the two on the right of this is written – Iron head Section of tent peg about 9\" long – and alongside the lower diagram is written – Iron tipped for penetrating ground. It is chisel edged. Total length about 8 inches)\n\n \n\n(Sketch of an entrenching tool. Alongside which is written – Sketch of Turkish ENTRENCHING TOOL Length 22 inches weight 1 ½ lb (about) )\n\nComing home the other night from Maghdaba Stringer took the Helio off his back to make a pillow during one of those 10 minute Halts and got up and got mounted and forgot all about it and it did not strike him that he had missed it until next day.\n\n \n\nTo-day the Heliograph Case came back one of the 2nd Brigade brought it in seeing \"2 LH\" marked on it but a valuable Heliograph and Duplex Mirror and 2 spare mirrors the lot costing £ 14 is lost for good and all. I don’t know why they bothered to return the case they might have kept that to carry the Heliograph in, or thrown it away. Maleesh. We have several more back at our base store at Bir El Mazar.\n","45":" El Arish Tuesday 1916\n\nAbout 3.30 Am this morning the rain came down in torrents and those who were not well sheltered by water proof sheets got wet indeed. This rain is something of a rarity here because it scarcely ever does rain in these latitudes I think the reason is that at present we are so close to the coat of the Mediterranean Sea Everyone’s blankets and belongings are out during this morning.\n\nLater details about the amount of prisoners we captured the other day Our \"6\" Squadron brought in 1100 and the Camel Corps who stayed behind captured between 200 and 300 more when they came in to get water from the wells The total amount is close on 1500 altogether And the First Brigade captured 4 guns I reported 2 at first but it subsequently transpires that there\n\n \n\nwere 4. They are those mountain battery guns short barrel and mounted on a small carriage but they are very effective and can throw a shell weighing 10 or 12 lbs easily 5000 yards and on that account are to be respected. They are not of course so swift and deadly as those dreaded \"75’s\" but they’ll satisfy me\n\nMajor General Sir Phillip Chetwood C.B.D.S.O. General Officer Commanding Desert Column is coming this afternoon we have to have a parade for him I \nmust\n must get ready.\n\nLater,\n\nwe (the whole Brigade) formed up and waited for about 2 hours for His Highness to come along, when he did arrive he said that he was proud of our of our performance at Maghdaba and said that we had done well and that what we did should ordinarily have taken 3 nights and 4 days to achieve He also said that with all his long experience as a soldier he had never heard of mounted troops being successful in capturing an enemys entrenched position\n\nThen after the parade it came on to rain and continued on through the night\n","46":" El Arish Wednesday\n\nRained all night never got wet\n\n \n\nmiserable for the poor horses \n\nThis morning we went down to the beach and rode the horses into the breakers just for a bit of exercise – good fun. The sun is shining and all wet things are out drying but the sky looks ominous. Saw a large waterspout this afternoon a good distance out at sea.\n","47":" El Arish Thursday\n\n7.30 am, I am sitting under the shelter of my bivouac out of the rain Shane\n\njust boiled the billy and had some \"mongarie\" and I don’t care now which way the wind blows. We are due for another 80 mile reconnaissance very shortly. We almost wish Sir Phillip Chetwood etc etc etc did not have such a \nopen\n good opinion of us because we are to do a much worse \"stunt\" than last time don’t know if there is going to be any fighting at the end of it I hope so if we have as much success as we had last time. Just found out that amongst the lot of prisoners we captured at Maghdaba was a Brigadier General and a Colonel but the man we were hard on the heels of was the German Commander of the forces in these parts Von Krasse or Von Krans. In starting out from El Arish that night we were delayed five hours on account of rations not being drawn in time. The night\n\n \n\nwas very dark and the camels with the supplies missed us and consequently we were delayed in getting rations and horse feed. We could have gone on as most of us had sufficient rations for at least 24 hours but the horse feed was the trouble so we were unavoidably delayed and consequently reached Maghdaba several hours after \nsunrise\n daylight. The Turks got wind of our approach about 7 a m and Von Krasse or Krans promptly bolted so we missed the biggest fish of the lot. \nMaleesh\n. We will catch Von \"Iron Cross\" yet. A Turkish Doctor we captured told us that it was the happiest day of his life he said that there was a great deal of internal trouble amongst the Turkish forces themselves and the Germans and Austrians and there was no money and supplies were difficult to obtain and transport.\n\nA significant fact which I noticed the other day was that although the Turks fought gallantly – up to a certain point – and then had a white flag handy to hoist. That white flag was always handy they had it with them.\n","48":" El Arish Friday\n\nSome rain during the night. Been reading \"Monsieur De Rochefort\" by H. De Vere Stackploole. good book\n\n \n\nAuthentic figures are now available for the first time about the result of the recent fight (or \"operation\" as they call it ) at Maghdaba.\n\n1290 Prisoners including 40 wounded and 45 officers \n\n- 97 enemy dead buried by us\n\n2 Regimental and 2 Battalion Commanders amongst the prisoners \n\n40 horses and 100 camels \n\n4 mountain guns and personnel \n\nabout 1000 rifles and 100000 rounds of Quantity of military stores and equipment \n\nOur casualties were\n\nOfficers – 5 Killed 7 wounded \n\nOther Ranks – 17 Killed 117 wounded. \n","49":" Skeikh Lowond Saturday\n\nStarted off this morning from El Arish about 8 a.m. In the rain and the weather has been very showery all night. Quite a Novel thing riding in the rain had almost forgotten what it felt like However it was brought forceably to our minds there was a strong wind blowing off the sea Marched about 18 miles along the coast to this place which is only 10 miles from Rafa which stands on the Egyptian-Turk border. A strong detachment has gone forward from here including the Brigadier and some of the Divisional Staff\n\n \n\nofficers presumably to make a reconnaissance towards Rafa which latter place by the way is our future objective and I am thinking that it will not be so much of a walk-over as the Maghdaba Stunt this is in their direct line of retirement and those 4 centimeter guns are along this route somewhere. The remainder of the Brigade remains here as a sort of reserve to the strong detachment which has gone forward on the reconnaissance. We go back to El Arish tomorrow sometime. The weather looks showery and we can fully expect plenty of \"Mooya\" during the night. I have one blanket and a rubberized rain-proof coat so I have a chance of being dry. Most of the boys have one blanket and their cloak. Have collected a good quantity of firewood and have a good fire burning.\n","50":" El Arish Sunday\n\nGood bye for Ever good old 1916.\n\nShades of Hades! What a night I had!\n\nThe weather was threatening all night and cloudy and there was occasional misty rain and I only had one blanket which and my rain-proof coat and the sand was very wet So the only thing to do under the Circs was to ly down on the cold\n\n \n\nwet ground with a very cold wind blowing and an occasional shower and they say misfortunes never come singly I had a very pleasant toothache to make me still more comfortable Oh! I said enjoy myself. Out again at Quarter to 5 this morning to saddle up and \"stand to arms\" we only did it this morning on account of being in such an advanced position we were only 10 miles from Rafa and although we had a \"screen\" around the whole camp of one whole regiment we were taking no chances\n\nWe started back at 8 Am and reached El Arish at 1.15 p.m. across the undulating sand dunes. The country about Sheikh Zowond is much the same as the rest of the country hereabouts undulating sand dunes low bush with an occasional tree of fair girth which is rather a Novelty. All along the sea coast are high irregular-shaped sand dunes with no vegetation on them. When the wind blows here it is \"some\" wind there is no protection whatever God help us if it snowed. 9 signallers for outpost duty tonight they will be in want of a sleep by tomorrow. Our horses had a bad night of it last night we did not take our line and they had to be linked together which did not give them a chance of lying down as\n\n \n\ntheir heads are only about 2 feet apart and if one of them throws his head around he disturbs about 3 on each side of him. My poor old fellow on one occasion badly wanted to scratch his ear but when he bent his head round the others pulled the opposite way and so poor old \"John Willie\" had to forego his scratch.\n\nA story has been in circulation recently that the Infantry are complaining that they do all the digging and we do all the fighting and therefore take all the gilt off them, and now they say that they want a chance to take Rafa well if that’s true I for one will certainly not stand in their way and I shall be most happy to sit on some prominant sand hill about 2 miles away watching the operation through my field glasses. I have had enough of \"Glory\" of that sort. Enough and to spare! I have’nt got cold feet but by the same token I am not one of Kiplings \"Thin red ‘eroes\".\n\n- Exit 1916!-\n","51":"\n\nEL-ARISH SINAI PENINSULAR\n\nAnother milestone reached in the progress of events and years we buried poor old 1916 at 12 oclock \n\n \n\nlast night and a new year was ushered in. The sun rose this morning in his accustomed place and time . And he will go down this evening in the same old spot. Let us draw a line across and add up as it were and see or rather review what we have done during the old year\n\nI have not got my other diary to give exact dates that has gone to England last October but here is a brief review.\n\nWe left Heliopolis after the evacuation of Gallipoli and were refitted with clothing and accoutrements on the 14th January and went out to Western Egypt The \nSennuise\n Senuisi a warlike race of fanatics inhabiting the northern part of Africa were causing a lot of bother we went from there several hundred miles South away into upper Egypt as they the Senuisi were delighted to be breaking through we stayed there until April and then got hurried orders to pack up and go down to the Suez Canal and away out into the desert to Romani. Met Jacko there marching across the desert to attack the Suez Canal and take Egypt back again. Poor old Jacko lost a ripe plum when he lost Egypt and after holding it as he had done for 400 years it was hard to be hunted out and have the gate slammed in his face and we cannot wonder \n\n \n\nat him making desperate endeavours to take the place. But Egypt is not for Jacko quoth the raven \"Nevermore\"! Jacko is to be finally and utterly crushed and put back well within his own boundries \nwhere\n and have his fangs drawn and dictated to.\n\nThen we had the Battle of Romani Quatia and the severe engagement at Bir-el-abd where the Turks put up such a desperate resistance when they were routed. The greatest pity is that we could not follow them up on that occasion. Then came a short spell and I went to the School of Signalling at Zertowi and when I rejoined the regiment they were enjoying a rest at Kantara and all of the men were having a short fling down at Alexandria then pack up and march into the desert again and from place to place further out each time until one fine night we make a bold bid for and occupy El Arish. And the end of the old year finds us just returning from a reconnaissance to a place 18 miles up the coast from El Arish and only 10 miles from the Turko-Egyptian Border. Sandwiched in between these incidents is of course the scrap at Maghdaba where we did such good work. So that, in the main – constitutes the work done in the year 1916 – what does the year 1917 hold for us? Peace I hope.\n\n \n\nPeace we all hope and according to the signs of the times peace it will be.\n\nAbout 9.30 this morning 3 Taubes came sailing overhead and one of them was directly overhead before anyone saw him. Fortunately he didn’t \"let go\" our first intimation of the visit was the machine gun started rattling away we thought they were testing one of their guns. We are used to them and rarely have 2 made their appearance but this time we had 3 of them There was a strong wind blowing at the time and consequently we could not hear their engines. The horses were all the way down near the beach at water and the Taubes went over that way and dropped about half a dozen bombs they went off with deafening crashes No one was hurt as far as we can ascertain at present and no damage done. One of our planes was up at the time and we went after them at full speed but they went away and we saw no more of them\n\nBeen working with a shovel making a dug-out to get in out of the rain and cold wind and it will come in handy if Fritz drops any bombs too close here that is if the horses are out to water although he generally pays us a visit when the horses are on the line – feeding and the men at meals. There is a terrific wind blowing and great difficulty is \n\n \n\nexperienced in getting about there is a perfect sand storm and the sand penetrates everything. It’s the first sand storm we have experienced for a long time Fortunately I am about 2 feet 6 inches below the surface and I am dodging most of it although I am getting a fair share.\n\nOur boys will be all smiles tonight I have just been over to the Quarter Masters store and drawn some rum.\n\nThe Turks secret agents been supplying Jacko with the information that we go to water at certain stated intervals hence the 3 Taubes visit near the water troughs this morning well it don’t take us long to become wise on active service we soon learn a lesson Now we go to water at irregular intervals. Anyhow there are too many horses watering at once 3 regiments and a machine gun Squadron and departmental corps or as Crane calls them \"Odds and Ends\" Im glad I have a subterranean shelter because above ground its decidely windy and cold.\n\n \n","52":" El Arish Tuesday ~\n\nCold wind blowing all night and much drift sand. Our aeroplanes went out this morning in a high wind to reconnoitre and probably bomb \"Jacko\" up at Rafa. The latest information to hand is that there is increased enemy activity at Rafa. Some one suggested that the Turks were going to attempt to recapture El Arish. If that is the case there \nwill\n be increased enemy activity. \"Jacko\" will be very active getting back again.\n\nAll day long there has been blowing a fierce wind with fine drift sand which simply smothers every thing we look like dustmen. And the cold is something to remembered too I have to make periodical excursions outside and shovel the soft sand off the roof of my dug-out otherwise in a short while I could be inundated. No wonder cities get buried We have several large pieces of stone at the cook house to rest the dixies on and these are a kind of marble and have been cut for building purposes. Where they came from in the first place what buildings they were intended for and how that got to such a barren sandy place etc remains a mystery.\n\n \n\n3rd January El Arish 1917 Wednesday\n\nHad very little sleep last night I was awakened by a loose horse galloping about and then the rain came down very heavily for goodness knows how many hours the blanket which I have stretched over for a roof began to leak and hey presto! the water commenced to ooze through and dripped through However I got over to one side and dodged a considerable portion of it but some of the \"bedclothes\" got wet. \"Bedclothes\"; - good word that. Sounds homely. My mattress is a good one there is plenty of it in fact is spreads over the whole face of the Sinai Peninsular – SAND! And I have had same mattress now for many a long month now and may have it for a long time yet I was awake until close on 3 this morning and during that period I did a most extraordinary thing I sat up during the night and consumed 4 slices of bread and jam. The reason for such an extraordinary thing is this. Since we have arrived at El Arish we have been on what is officially known as \"Mobile Ration\" which consists of Bully Beef Biscuits army pattern Huntly and Palmers No 5 armour plated, fitted\n\n \n\n(full page sketch of a plant with note at side as follows):\n\nSketch of Cultivated plant found in the Sinai peninsular. Cultivated by the Bedouin Arabs. Has lily-like leaves and has a tuber like an onion sometimes as large as 8 inches in diameter. Cannot find out as yet what its uses are. It is not edible and cattle will not touch it, perhaps it has medicinal properties.","53":"\n\n \n\nwith rivet holes ready for rivetting on to any tank which has a shot hole in it. Guaranteed to withstand all animates – and hammers!.\n\nCheese; very good and appertising but most frightfully binding\n\nRaisins, to act as a laxative and counteract the cheese so to speak.\n\nFigs – dried, preserved, don’t get them too often\n\nTea and sugar, plenty.\n\nMilk. The \"Ideal\" brand also good.\n\nMarmalade\n ! \nMarmalade\n ! \nMarmalade\n !\n\nAnd still more Marmalade! Nufsed. I will not waste any more good English in these pages re Marmalade as I want all the space to record other things but I think hard.\n\nBread. Fairly often in fact we get it almost daily now.\n\n \n\nThat is a \"Mobile Ration\"\n\nNo fresh beef and no vegetables which is the new essence of life hope to be put on those two in a few days now.\n\nSo I might say that pro tem we are being badly fed. The camels available for bringing our stores and horse feed etc from Railhead are inadequate. I don’t know why. I must not question these things and the railhead is now about 6 miles from El Arish and huge gangs of the Egyptian Labour Corps are working at high speed to bring the railway up here with as little delay as possible. Hence the ‘mobile Ration\" Hence the inadequacy of good nourishing food, and hence the Bread and Jam stunt in the middle of the night. It is the first time since our arrival in Egypt from Gallipoli that I have complained about bad rations and ordinarily we are fed fresh beef and vegetables in abundance but just at present things are \"tight\". In a day or so things generally will alter. There is a large A.I.F. Canteen back along the line at BIR-EL-mazar but they have not been able to get any stores up to us yet. my stomach rebels at Bully beef having had enough and to spare of that \"muck\" on Gallipoli\n\n \n\nWent out to exercise the horses this morning along the sea shore we walked them close to the waters edge and it was good fun watching the antics of them as each big breaker came ashore Sometimes coming up to the girth. The wind has been blowing something terrible during the night and this morning and waves were very high. There is a small mine sweeper run ashore – close by where she ran ashore several days ago in a gale. Great waves are breaking over her and she lies helpless on one side\n\nThere is some sort of a mad rumour to the effect that Australia has asked for a separate peace sounds too good to be true. Kaiser Bill will be saying Gott strafe Austria! He has \"strafed\" everyone else up to now.\n\nThere is also another rumour much nearer our hearts than that and that is \"Get ready to move at 12 hours notice\"! We may be going to take Rafa it may be soon and it may not eventuate for a few days but there it is.\n\nC Squadron is on out post duty tonight which will require 9 signallers. I don’t envy them if we have a night such as last night the wind rain and cold was something scarcely credible for these latitudes.\n\n \n\nMethod of putting down horse lines in sandy desert country: pegs are useless. Two grain sacks are buried at each end with the line rope passed round leaving a hitch at one end for straining and 2 small sand bags\n\n(Drawing showing the rope and the cornsacks and sand bags. Under the rope is written GROUNDS LEVEL whilst at each end of the rope is written CORN SACK and towards the left and the right is written SAND BAG ANCHOR)\n\nare buried midway with a short piece of rope, wire etc as additional anchors. Five minutes work with a shovel will soon dig the sacks out again. The sand is emptied out and these sack are carried on the saddle to the next camp.\n\n \n","54":" El Arish Thursday.\n\nRained all night and those who had not made special precautions got wet. My dug out has stood the test imposed on it. The men on outpost duty had a miserable time of it and were glad when morning came. Exercised the horses this morning and gave them a good stiff gallop along the sea shore where the sand was hard. It did them good poor devils they were perished with the cold. They will insist in turning their backs to the wind and the blanket blows up around their ears and does not do much good as regards warmth.\n\nGot paid today. Whatever for I don’t know there is certainly no way of spending it we get paid in 50 piastre notes I got 7 of them. There are some natives selling half ripe tomatoes down at the water trough but they wont have change that’s a certainty. There is no loose change about. I wish we could get near that A.I.F. Canteen Oh! The irony of things. There is the A.I.F. Canteen, an \nAustralian\n Canteen mark you! back at Bir-El-Mazar and the place is infested with British Tommies and \nall\n the Australian Imperial Force is out here at El Arish! The Tommy’s invariably rush the\n\n \n\nplace and as a rule the Australian has to shove in where he can and yet the Tommies have their own Canteen But such is the perverseness and cussedness of things on active service. Latest Rumour is the \nthe\n Infantry are not going to rush Rafa but us again. Our men are saying when the Blankety Blank are those gory lurid sanguinary Infantry going to do anything? The sun has not shown his face the whole day and the wind has been a perisher.\n\n5th January 1917 El Arish Friday\n\nAs if ashamed of his conduct yesterday old Sol shone gloriously as if to make up for lost time today. It rained very heavily during the night, and there are some very sorry-looking clouds hanging around the horizon. Exercised the horses along the sea front and let them wash their legs in the briny which does them good. I have been feeling slightly feverish the last couple of days I think I must have contracted a chill when we went on that last reconnaissance out to Sheikh Zowond 18 miles away. I laid down on the soaking wet ground and a cold wind blowing and my blanket was wet and I have been having a lot of rain soak through the roof of my dugout so it all helps\n\n \n\nButler, our tired man has gone to Kantara to interview the O\/C Flying Corps with a view to transferring he will be gone several days. Just heard on the news that Sir Phillip Chetwood got \"Strafed\" for not notifying General Head Quarters that he was going to smash things up at Maghdaba. General Sir Archibald Murray the Commander-in-Chief has given him a \"wigging\". Anyhow we did good work and Sir Phillip Chetwood is as I thought a real live Cavalry leader one with some push and go. Young and vigorous not a fossilized old fogey of the antequated old School. He will do us for a Commander If the report is true we should be sorry to hear it \n\nPaid Jimmy Probert for the Kodak £2.\n\nHooray! An issue of fresh meat & vegetables At last! There’s corn in Egypt yet.\n\n6th January El Arish 1916. Saturday\n\nMounted troops about one Brigade have just arrived from somewhere. They are making down to the South probably going to make their camp there ready for the \"Push\". I felt very feverish last night and my temperature was over 100 ° Feel a little better this morning Fresh meat for breakfast welcome change Part of the line washed away during recent rains and a supply train fell off the line the other day – 2.30 pm – Just had a Taube scare. A Taube flying at about 10,000 feet passed over here and was making for some of the places back\n\n \n\nalong the line. He always has a great \"set\" on railhead he can see the line plainly and he knows that at the end of the line there must necessarily be a construction gang at work so whenever possible he bombs that place. Two of our planes were well after him and they disappeared at a high rate of speed through the clouds. 6 Signallers for outpost duty tonight Lovely and warm all day.\n\nSergt Parker has charge of the culinary arrangements for Signallers. Regt Staff and Transport Drivers, known collectively as \"The Staff\"\n\n7th January El Arish 1916 Sunday\n\nWe commence the days proceedings at 6.30 by stables (grooming) then feed them breakfast – a misnomer – but nevertheless breakfast. We break our fast in some sort of fashion which is some sort of consolation. Church parade at 8.15 Cameron Campbell and Shire were conspicuous by their absence Reported the occurance – severe talking to – Excuse – didn’t have time to have breakfast. Good Lord – if they didn’t have more breakfast than I did there was ample time! However let it pass as the soldier said when the shell flew past him. 9.30 a.m water horses and just when we have got back to the line and tied up the horses\n\n \n\nThe magical order came \"Stand to your horses\"! \"Get out!\" \"Scatter!\" Away we go out of the plain O’Halloran and I share the same \"possie\" ie hole in the ground – safe position – bomb-proof shelter. Anything you like to call it but known here popularly as a \"possie\".\n\nTwo Taubes came over head and when they got close enough the machine guns started rattling at them and greatly to our surprise proper anti-aircraft guns; sent shell after shell in the air after them the first couple of shots going perilously close. I made sure the Taube \nwas\n hit several times; it seemed so from my position. He came down lower and we thought that he had been \"winged\" but he daringly came down lower the better to see where he could drop his bombs, presently he let them go and they went whistling down thousands of feet and crashed with a fearful detonation. The other fellow flew over our position and dropped 4 bombs close to our camp killing 3 horses and slightly wounding one man. One bomb did not explode. Then they cleared out with our planes on their heels seeing them off the premises as it were. Later Our machines\n\n \n\nhave just returned safely. The regiment has just had 7 units sent them – only 7\n\nHave not been feeling too well all day don’t know what is wrong!\n\nTo quote Kipling – \n\n\"Ive got a head like a concertina\n\nAnd a tongue like a button-stick\n\nAnd a mouth like an old pestater\n\nAn’ I’m feeling a bit more’n sick\".\n\nThe unexploded aerial bomb which fell near our camp this morning should have had a decent – and quiet – burial But some of the boys cannot rest content so they pulled it about, looked at it from all angles, let it fall, kicked it, photographed it, and then I see someone has just gone past my dug-out with it swinging in his hand. The odds are of course that it \nis\n a \n\n\"dud\" after dropping so many thousands of feet and not exploding there is a fair chance of it not going off just now, but – it was made and meant to explode, and a movement in a certain direction may start it into activity and most unexpectedly it may go off and then someone – whoever survives – will say they did not think it was dangerous. \"Let sleeping dogs lie\".\n\nLast couple of days have been facilitated by shoals of pelicans gyrating in the air like troops at drill they are interesting to watch. They form all sorts of military formations over us.\n\n \n\n8th January El Arish 1916 Monday \n\nI had been feeling very seedy last night and after seeing the Doctor who gave me some pills I was told to go straight to bed which I was glad to do. Well about 9.15 pm the moon was shining beautiful and bright I heard the far-off buzz of an aeroplane which I judged rightly to be a Taube, coming straight over the camp. Immediately the order was given to clear out and simultaneous with that he dropped 2 bombs just behind the 1st Regiment lines and about ¾ of a mile from our camp they went off with a frightful crash waking any who were asleep at the time. I went out half dressed in the cold night air which did not do my condition any good and jump on the horse’s back and gallop off into the night and across the open. The Taube or Taubes dropped bombs all over the place. No one in our camp we were scattered about the desert and it was quite half an hour before we got back again about 11 bombs were thrown down altogether, and hundreds of rounds from their machine guns were strewn around. Everyone took over where possible I was sick and the cold wind did not do me much good. Last night was a favourable opportunity\n\n \n\non account of the bright moonlight.\n\nThe Regiment is parading at 3.15 pm this afternoon to proceed to Sheikh Zowond they will bivouac there for several hours then pack up and go on at 1.30 pm and be in position at daylight and engage The Turks the idea is to try and capture Rafa and then return to El Arish. They may have a bigger job than they bargained for. I am excused duty so I am not going and if they have a time like the last stint out that way I am thankful am not going in my present state of health at any rate I may be sent away sick yet shall see how things are by tomorrow. Had another aeroplane scare today but he did not come too close the guns got on to him and I believe he was hit. He disappeared very quickly 2 of our machines chasing him.\n\nCaptain Franklin and about a dozen men just arrived from Moasvar and they are going out straight away with the regiment rather sudden order that.\n\n \n\n9th January El Arish Tuesday\n\nNo Taubes paid us visits during the moonlight so we had a peaceful night of it.\n\nThe whole Anzac Mounted Division has gone to take Rafa no news has come back yet our machines have been flying backwards and forwards all the morning. Been feeling sick again today, don’t know what is wrong went to our 1st L.H. Field Ambulance but all doctors have gone out. At 11.30 a Taube came over from the South side of El Arish and the first intimation we had of it was the loud crash of 5 bombs one after the other presently the machine came into our field of vision. The anti-aircraft guns banged shell after shell into the air but none hit the Taube allthough some of them were close He even had the audacity to come back and fly amongst the bursting shells He sailed away however and went north along the coast.\n\n3. pm No details as to how the scrap has gone yet. Thought I heard guns or bombs once or twice but the distance is great for such sounds – 30 miles\n\n \n\nStill getting sick. \n\n10th January 1916 El Arish Wednesday\n\nNo authentic news has percolated through yet from the front line at Rafa! Only rumours I quote several\n\n(1) The Australians have been successful in capturing a redoubt\n\n(2) The Australians and Yeomanry has had many casualties\n\n(3) 3,000 Turks have been surrounded \n\n(4) A Turkish Division has been surrounded.\n\nThe moon was obscured last night by clouds and it looked like rain in fact a few drops did fall but not much. I was glad it did not rain for the sake of our boys out on the open country. \n\nThis morning the sun is shining beautifully and there is a cold wind blowing \na\n Our aeroplanes are flying to & fro the whole morning just before dark last night there was 7 of them came back together like birds coming home to roost.\n","55":" Field Guns arrived back here and a heavier gun has gone out\n\nNot feeling much better am run down and want a spell.\n\n12.30 pm. Same date The troops have just returned from Rafa\n\n \n\nbattle stained weary and dead sleepy. They report having the hardest time of any desert fighting up to now The places they captured were well-nigh inaccessible The Turks had redoubts on the surrounding ridges and to approach them from any angle it was necessary to move across level flat country with positively no cover whatever. They got it thick and fast both from high Explosive shells and from dozens of machine guns. However after fighting desperately all day that is from daylight to dark they succedeed in capturing the whole place which was considered impregnable by the Turks. The Turks trenches were filled up with dead they have suffered heavily. About 6 or 8 of this regiment have been killed and a good number wounded.\n\nCorporal Cameron one of my best Corporals and one of the best signallers I had \ngot\n was fatally shot through the head and buried out there poor fellow I was sorry I always liked him, he always had a very pleasant disposition. However he has gone to his fathers where we all must go He had a premonition of his death he told me often that he was going to be killed out here in the desert and just as they were going into action he said\n\n \n\nto one of the signallers\n\n\"I put up with a lot of pain when I had my finger taken off. I wonder how much more pain it would be to have my head knocked off!\"\n\nThe Turkish bullet went clean through his head he was moving for some time after being hit but hopelessly beyond human aid. He was in an advanced position \nposition\n when it was found impossible to rescue him on account of heavy machine gun fire. He was buried by his own men. He and Sergeant Jack Barnes are lying together having both crossed the Great Divide where we all must go.\n\nThe captured prisoners number close to 2,000 and some guns and other war material Shall get official figures in a day or so.\n\nOur troops have sustained some rather heavy casualties but the gains\nfar\n has compensated for that\n\nLast night about midnight our aeroplanes were gyrating about in the air scaring those who happened to be awake They were dropping flares and the anti air craft guns were sending star shells up probably making arrangements for meeting Fritz when he comes on some more of his midnight stunts\n\n \n","56":" El Arish Thursday\n\nHorses and men having a well earned rest today. Captain Franklin who left us on Gallipoli sick and went to England has just arrived back and he is taking over the duties of Adjutant Vice Lieut J Warson. Captain Franklin makes our 6th Adjutant since the regiment was formed in 1914. Captain Goucher was the first He was promoted Major then Captain H.J. Tiddy who went away sick and eventually got back to Australia – and stopped there! – Then Captain Alan B Steele who went away with Colonel Glasgow with the 13th Infantry Brigade to France Then Lieut A.R. Norris who transferred to the Egyptian Camel Corps in Cairo Then Lieut John Wasson who goes back to his original troops in 13 Squadron and now Captain Franklin We have had four different Commanding Officers 1st Lieut Colonel R.M. Stodart 2nd Lieut Col T.W. Glasgow","57":" Lieut Colonel S.W. Barlow","58":" Lieut Colonel G.H. Bourne D.S.O. \n","59":" El Arish 1917 Friday\n\nYesterday afternoon a report came in from the outpost line to say that a Taube had come\n\n \n\ndown on the desert owing to engine trouble and that a party of men had gone out to fetch the machine in. But up till now I have not heard further details and I have not seen any signs of any plane, probably a cum granosalis yarn. I must be careful with these yarns because if I recorded all of them I should have a separate volume. I have always been careful in this journal to stick to fact as far as possible; occasionally a \"furphy\" has crept in but not too often. I cannot afford the space for rumours I want it all for facts. Here is a little vignette of some of the fighting the other day and the incident is true. One of our flying men had been over Beersheeba bombing enemy reinforcements which were trying to come to the rescue of their compatriots at Rafa. A shell was fired at him and a pellet went through his petrol tank. He could see that it was useless to go on so he had perforce to volplane down and he landed safely inside the redoubts which were surrounded by our men a heavy action was in progress at the time and Jacko was fighting on all fronts so to speak. When our air man came down a Turkish Officer and 9 men rushed out from their trench and took the airman prisoner. They had searched him\n\n \n\nfor all valuable documents money etc and were just moving off with their prize when the New Zealanders came up from the opposite direction and captured the lot of them much to the delight of the airman who returned and patched his petrol tank – got a supply of petrol and flew home safely.\n\nButler J.H.E. No 304 our slow man has been taken on by the Flying Corps and he has been finally transferred there so the man who went with him and who was an unsuccessful candidate with the Royal Australian Flying Corps can have a go at John Herbert Ellison Butler and we here in the regiment breathe a hearty sigh of relief. I cannot imagine who will be habitually last on parade now the refontation has gone. He was a holy terror for being last on parade He simply would be the last man \"Even though the Heavens shall fall\".\n\nOfficial list of Casualties up to date\n\nKilled in action:- 124 Sgt J.P. Barnes 352 Sgt A. Matthews 135 Sgt E.C. Cowley 859 Cpl Cameron 962 L\/Cpl Anthony 1080 L\/Cpl M. Angus\n\nDied of wounds, Pte J.J. Boyle 2634 Pte J.F. Crozier\n\n \n\nWounded:-\n\n174 Cpl Lever H.E. dangerously.\n\n1062 Pte. Ryan E.M.\n\n2877 \" Fisher C.H.\n\n890 \" Soul A.W.H.\n\n2658 \" Stanley, A.\n\n147 Cpl Evans C.W.\n\n2391 L\/Cpl Underwood R.\n\n245 Pte Saull. \n\n2784 Pte Barnes P.E.\n\n1389 \" Boyter H.\n\n1576 \" Farquharson C.W.\n\n1043 Sgt Stevens S.\n\n1158 Pte Doyle J.A.\n\n2633 \" Cunningham. H.\n\n2179 \" Cook. J.\n\n2839 \" Ross H.\n\nExtract from Routine Order dated 12 - 1 – 1917\n\n\"The C.O. wishes to convey to all ranks and especially \"A\" Squadron his appreciation of their gallant behaviour during the action at Rafa and wishes to thank the following whose names have been mentioned to him for self-sacrifice shown under heavy fire\n\nCpl Evans C.W.\n\nS.S. Lancaster F.W.\n\nPte Ross H.\n\n \" Reid. T.\n\n \" Holson C.C.\n\n \" Weeks\n\n \n\nTwo Taubes came over here about 3.30 p.m. and dropped several bombs no damage done. The anti-air-craft guns pelted them with shells and we in our present positions got all those shells, pellets and nose-caps which rained down after bursting in the air. I wish they would shift those guns they are beginning to be something of a nuisance we have to duck for cover from the descending shells the bombs which Fritz drops are nothing compared to it.\n","60":" El Arish Saturday\n\nCloudy and some little rain. The Regiment paraded in full strength this morning for Major-General Chamal the Commander of the Anzac Mounted Division and he told us a lot of flim-flam about being good fellows: - proud to command such men – good work dome – devotion to duty – etc etc ad nauseum. When we were on parade my ears were strained for the low hum \nwhich\n of a Taube which would put an end to the harangue but no luck and when we marched back to our own lines we formed a square and read\n\n \n\nout the proceedings of a Field General Court Martial on Pte G.E. Jarman who got 60 days for being insubordinate to Major Birkbeck One of the best officers we have in the regiment and he certainly didn’t deserve what the fellow called him but there is no limit to some peoples cussedness. However he has got 60 days to think matters out.\n","61":" El Arish Sunday\n\nChurch Parade I do not know what is going to happen one of these Sunday mornings if a Taube suddenly appears in the offing and starts to drop bombs. I am inclined to think that there will be a scatter of great magnitude.\n\nA Taube \ndid\n pay us a visit but some time after church parade but he did not come too close no shots were fired at him and he made off again. By the way these machines are not Taubes but \nare\n Aviatiks. The Germans use 3 classes of planes (1) The Albertross monoplane (not seen much much) (2) The Taube and (3) Aviatik\n\n(A drawing of two planes, the one on the left labelled TAUBE and the one on the right AVIATIK – both have iron crosses drawn on their wings)\n\n \n\nSo, as the word Taube is disagreeable and incorrect and more for the sake of a change I shall give these birds of prey their proper name when referring to them \n\nButler went on to Cairo for further interview and he has now come back until he gets his Commission and eventually goes back to the Flying School, we all thought he had gone for good. He only got back late yesterday and he has been late on parade 3 times already that’s the class of man who gets a Commission usually in the A.I.F.\n\n4.30 pm. Suddenly the order comes \"Saddle up\"! \"Get ready to move out at once!\" All the horses are out to water so we have to await their return which will take at least 20 minutes until they are all back In the meantime what has happened Campbell who is on the phone states that the outpost on Hill 160 about 3 miles out have seen a large body of mounted men about 150 presumably Turkish Cavalry about 1½ miles east of their position 2nd Regiment get mounted and cut them off. The horses come back at a gallop and instead of being fed as they thought they were saddled up – rapid instructions from the \n\n \n\nCommanding Officer to me about Signalling Communications and rapid instructions to the men as to what equipment to be carried and disposition of signal stations. Fortunately every man is well trained and so things move smoothly and quickly In 20 minutes we were on parade mounted and moving off into the desert. The route lay across high sand dunes and the sand was soft and heavy going for the horses we passed the outpost on Hill 160 and went about 2 miles beyond. Scouting parties and patrols flew out at all angles and scoured the surrounding sand dunes. But no signs of the enemy and no trace of hoof marks in the sand. We have been hoaxed most cruelly more for the poor horses than us. And when we found out that the \"Tommies\" were the people who were out on outpost duty we could clearly understand the positions. These \"Tommies\" are simply the very limit in stupidity, incompetence and crass ignorance and they suffer I should imagine from Aviatikitis Turkitis, Bedouin Arabitis, and brain and stomatic hallucinations. This 5th mounted Brigade which forms part of our Anzac mounted Division is the fly in the treacle, the thorn in our side. Whenever they are sent to do anything we can always expect that they have as usual made a\n\n \n\nhash of things or we have to go out at great risk and sacrifice to come to their aid. Their operations at Quatia and Oghratina fully prove that. So when we found out that they were on outpost duty we fully expected that we would have a wild-goose chase. These stunts are no joke we have to push our horses along over soft sand well over the fetlock at each step and miles of patrolling totally unnecessary. All through the incompetence and ignorance of some of these Johnny haw haw officers who thought don’t yer know that there were some fellahs on the skyline as it were. And they are in the Anzac mounted Division! Not one of the rubbish are fit to be an Anzac. These remarks which are set down here can be fully endorsed by every officer and man here so there is not personal prejudice. And I should be the last one to say these things if they were not strictly true because I have been a \"Tommy\" myself for eight years so I know both sides. The remarks of the men have considerably more embroidery on them than I should care to write here. We got back about 8 oclock and then had tea because it must be remembered that tea was just ready\n\n \n\nwhen we saddled up and had to go without it.\n","62":" months ago today we left Heliopolis for Wardaw in western Egypt.\n","63":" El Arish Monday\n\nHeavy fog all morning. Two of our aeroplanes went out scouting about 4 oclock this morning and just after 6 they came back There was two of them and they each had an electric light at the tip of each wing which looked rather pretty. They reminded one of some swinging Chinese lanterns I am feeling real good now after the attack of influenza.\n","64":" El Arish Tuesday\n\nHave been out on patrol all day with \"C\" Squadron in the direction of Sheikh Zowond we went out about 10 miles and another patrol of the same Squadron went further inland. Some Turks have been giving themselves up lately on account of our incessent aeroplane attacks and its beginning to get on their nerves. So we went out a good way in case we saw any stragglers but had no luck\n\nFritz came over the camp this morning and dropped 4 bombs which exploded near the Camel Corps lines about 2 miles\n\n \n\naway from us. But he did not wait long. About an hour after he had gone about 10 of our machines flew over heads when we were going out on patrol making for the Turkish position at either Rafa, Beersheeba or Gaza they were heavily laden with \"Iron rations\" for Jacko.\n\nLater on I saw 8 of them return out of 10 which went out probably 2 had gone around further but the odds are that they have been brought down by Jacko’s anti air craft guns. These flying men are too daring. The Turks or whoever they are who fly over our positions seldom get brought down because at most only 3 of them come out at a time and they never take any risks scarcely coming down lower than 6 or 7000 feet whereas I have seen those machines of ours come down as low as only a few hundred feet to successfully get their objective. These men of ours take greater risks and very often have to suffer being brought down through being too daring. Anyhow I only saw 8 machines come back out of 10 If the Turks have succeeded in bringing down 2 of our machines he has done a good days work because these machines cost\n\n \n\nsomewhere close to £ 1000 each the engine alone costing at least £ 800 To say nothing of the gallant men who are in them whether they are killed or are forced to come down through accident it means that they are lost to us in any case and good flying men cannot be found every day.\n\nWhen will this infernal bomb-dropping ever cease? It gets positively on our nerves. First we send over a flying squadron to drop bombs on the Turks then they return the compliment which sends us to the four winds of heaven. Over goes our machines again to pay that back and back comes Fritz again. We scare hell out of Jacko and by the same token he scares hell out of us. And so the rotton game goes on. Its good fun for the airmen of both sides but what about us poor worms down below. I often fancy an ant must have the same feeling when he sees the huge sole of a boot descending upon him These everlasting bomb scares play the duce with the nerves, and that is perhaps with one or two aviatiks, what must Jacko feel like when he sees 10 and sometimes as much as 16 machines coming?\n\nHe calls lustily to Allah Ill bet\n\n \n","65":" El Arish Wednesday\n\nBeen living in idleness today with an ear constantly strained upwards. A lot of gift stores arrived today for the regiment and it was distributed There were many cases of stuff such as pickles, jam fruit, Tinned vegetables tobacco and cigarettes wearing apparel etc etc. We thank everyone very much for their great kindness and consideration its really good of the people back in Australia; there is no doubt that they are standing well behind us, we are particularly thankful here at El Arish because we have not got a canteen where we can purchase stores to supplement our rations. The A.I.F. Canteen has not been able to transport their stores up beyond Bir El Mazar as the line is not yet complete and military stores have first consideration, so these gift stores coming now are a real boon and we are very thankful indeed The people who sent those things never wrote \"NO\" on \ntheir\n ballot paper Ill bet.\n\n18th January El Arish Thursday\n\nWe are settling down to a peaceful life by the look of \n\n \n\nthings There is a Syllabus of Training out \nfor the\n up till the 26th instant Such as \"Care of arms\" \"Fire Control and discipline\" march discipline and night marching etc.\n\nCongratulations have been coming from The King and the war Council The Sultan etc to the troops here for driving \"Jacko\" outside the Egyptian Boundary. I cannot of course foretell the future but I have some sort of idea that we will not go any further. The Turks have evacuated Rafa. Numerous prisoners continue to come in they state that these bombings are the very devil. Those plains of ours which went out the other day dropped 100 bombs on the Turks at Beersheba.\n\nAn aviatik came over here this morning flying very high the anti-aircraft guns got busy and he flew away he did not drop any bombs and I cannot for the life of me see how he could do any good from a reconnoitring point of view because he was at least 8 or 10,000 feet up and it is impossible to get any information from that height. However it was his duty I suppose to come over our place and make his report to his headquarters I have got a very bad tooth one of the back ones and the dentist\n\n \n\nsays he cannot do anything with it as it is too far gone for ordinary filling it wants crowning and the only hope is to go to a practical man and I cannot manage that yet. In the meantime it aches as only a very bad tooth can, and the only remedy I can find is pure Carbolic Acid and I have burned my cheek & gums and lips & tongue with the terrible stuff – but it cures the toothache. Toothache takes a good deal of good humour and optimism out of a man and these things are very much needed out here where we are having a hard life of it. I suppose the upshot of the whole thing will be that I shall have to get that infernal molar yanked out. It will be much to my regret if such is the case.\n\nThe result of the capture of Rafa are\n\n1437 unwounded prisoners\n\n106 wounded prisoners\n\n4 guns 6 machine guns\n\nand a lot of rifles and ammunition, and war material. Also a smashing defeat of the Turkish forces which they can not well afford, several German Staff officers were included in the net.\n\n200 dead were left in the trenches\n\n \n\nwhich we had no time to bury The hour was late and the reinforcements were reported coming to the aid of their Compatriots. The real truth about this Rafa stunt was that the G.O.C. found that the Turkish position was too strong to be taken and orders were hastily sent out to retire. The 5th Mounted Brigade got the order and retired accordingly back to Sheikh Zowond about 10 miles Our Brigade were getting the order when they were just fixing their bayonets preparatory to charging the Turkish positions. When the Turks saw the bayonets coming too close they they promptly threw down their rifles and up went their hands The New Zealanders away around the other side did not get the order and they too were closing in on \"Jacko\" much to his anxiety and the Turks around that portion of the redoubt also \"Skied the Towel\". When our Brigade saw the way things were going they refused to comply with the order and so saved the situation and when the New Zealanders did eventually get the order to retire they had Jacko beat and so no one with the exception of the","66":" mounted Brigade obeyed the order. One might put it down to the impetuosity of the Colonial Troops but why obey such an order when victory complete and decisive was within reach?\n\n \n","67":" El Arish Friday\n\nSignalling practice commences must keep on practicing otherwise they will become stale. I am starting another class of supernumaries today\n\n1103 S. Felochow \n\n638 W.C. Nicholson \"A’ Squadron\n\n1472 A.C. Wooster\n\n21A E. Best \"B\" Squadron\n\n2244 R.B. Argus \n\n1261 T.O. Perkins \"C\" Squadron\n","68":" El Arish 1917 Saturday\n\n \n","69":" ","70":"\n ","71":" A. G. Hospital \n\n ABBASSIA CAIRO\n\nFrom previous references in the journal it will be observed that I have or had been having a deal of sickness. I tried to fight against it but the climax came on the","72":" when I was sent away from the Regiment what my complaint was at first I was at a loss to know but it transpired that I was suffering from Neurasthenia and Debility. The neurasthenia predominating I was sent back to the","73":" Field Ambulance one of our advanced hospitals and after being examined by the Medical Officer (Major Cave) I was sent back along the line to the","74":" Australian Stationary Hospital at Mahamadya . After staying there 2 days I was sent to the","75":" Casualty Clearing Station at Kantara and after 2 doctors there I was sent to the","76":" Australian General Hospital at Abbassia near Cairo where I have been ever since.\n\n \n","77":" ADEN\n\non Board H.M.H.T. \"WILLOCHRA\"\n\nTo resume writing the journal again. Ever since about the","78":" I have not been in a fit state to do any writing not even letters. \nThe\n \n\n \n","79":" H.T. WILLOCHRA\n\nWe have been detained here since the","80":" instant on account of a German Raider which has got loose somewhere in the Indian Ocean. This raider had another ship with her which was laying mines – dropping them anywhere. The minelayer has been captured – or sunk – but the raider is still at large and she is armed with 6 guns.\n\nSeveral ships came in yesterday from Colombo escorted by a French Battleship.\n","81":" ADEN\n\nStill held up here – for what? God knows. Some say more raiders have appeared on the sea. What is the navy doing? People say that the navy cannot be everywhere but surely they can run to \n\n \n\nearth – as it were – a paltry steamer or two. Again what is the matter with our Secret service agency They are throughout the whole world. Again the question why not employ the Japanese Navy they helped us before? But there seems no answer to these questions and meanwhile we are held up here at Aden The most Godforsaken hole in the British Possessions A large mail boat left here last night for Australia. Why cant we go? Wait & see I suppose!\n\n \n\nWe get shore leave each day from 2 to 5 but one soon tires of that there is nothing much to see The only place of interest is the tanks but tanks for holding the water supply of Aden. These tanks are of peculiar construction. There are very large rocky mountains around Aden and when it rains which is seldom the water runs down the crevices of the hills and is collected in huge \n\n \n\ncemented tanks There are about 8 of these the largest one has a holding capacity of over 4 million gallons.\n\nThese tanks were the work of the Ancients and no reliable history is available. They were discovered accidentally in 1854 by the then resident British Governor who had them cleaned out and improved \n\nA large part of Aden Town is close to these tanks which is about 5 miles away from\n\n \n\nthe Aden at the harbour. The road lies over high hills and very winding & are quite good going.\n\nThe natives here speak both Hindustani & Arabic They are a distinct Indian type.\n\n- Later –\n\nA steamer going out from the Harbour this morning about 10 miles away ran into a mine and came back in a sinking condition and as near as I can ascertain she has been beached.\n\n \n\nThe ship is a good way from us over against an island and appears to be rather low down. A small mine sweeper left here this afternoon she had evidently intended going out without saying Goodbye because one of the 6 inch guns sent a shell after her. That had good effect and she came back into harbour.\n\n \n","82":"\n\nWe came here on the","83":" and we picked up the anchor this morning at about 9.30 and put to sea escorted by H M S \"DORIS\" armed with 11 6 inch guns and several smaller guns. The Battleship \"EXMOUTH\" also left; escorting 3 steamers to Bombay The \"DORIS\" is only escorting us. We have parted company with the \"Exmouth\" and her convoy as they are making for Bombay and we to Colombo.\n\n \n\nThe books I have read on board are\n\n\"Jane Eyre\", \"Innocents Abroad\", \"America at Work\" by John Foster Frazer, \"Heroes of the Farthest North and Farthest South\".\n\nWhen I was in the 14 A.G.H. I read \"Peter Simple\" \"The Broad Highway\" \"Jane Eyre\" \"The Four Georges\" by Thackeray \"King Solomon’s Mines\" \"Old Curiosity Shop\" \"The Retreat from Mons\" \n","84":"\n\nReached Colombo today at 12.30 pm.\n\n \n\nColombo","85":"\n\nAfter nearly a months wandering we have got so far.\n\nThis is an ideal spot. A gem of the ocean. Streets nicely laid out – clean, large shops. Everyone busy, no idling about like Towns in Egypt, no filth, clean race of people these Cingalese. The most beautiful heads of hair of any race I have ever seen. Their coiffure is simply wonderful they use cocoa-nut oil on the hair and their hair is black and shiny and all the men wear their hair long like a women and usually worked into a \"bun\" at the back. Most curious effect to a European and they all wear semi-circular hair combs like those used by small girls in European countries. The hair is well brushed back and the comb inserted hats are only worn by Cingalese in good positions.\n\n{Next is a drawing of a man’s head and hair showing comb and bun, and another drawing of woman’s head and hair showing comb and bun}\n\n \n\nTheir complexions are shiny black fine featured good looking and the great thing which strikes a person just coming from Egypt is the clean way they live. Malay Town which is a short distance from the European quarter is a model place.\n\nMoonstones are very common here in Colombo and can be purchased very cheaply\n\nIn the course of my wanderings I have come across some wonderful things the work of both nature & man but of all the things wonderful, made by human hands I have seen it here. To explain: I saw in several shops which have ivory carvings for sale a piece of pure ivory, the exact size and shape of a tennis ball with \neight\n balls carved inside it. I saw plenty with 5 and 6 but the one with 8 balls inside was the most wonderful The thickness of each ball would be about 1\/16 of an inch in thickness and each one was not only cut out but beautifully engraved. The last one (the eighth) was about ¼ of an inch in diameter like a small marble each ball was separate, each moved at the touch These wonderful ivory balls are made by the Chinese who alone possess the secret.\n\n \n\nI am extremely sorry I did not have the necessary money by me to purchase that interesting piece of carving, it was only 25 rupees\n\nThe Commanding Officer Commander L. S. Grace R.A.N. who is in command of all the ANZAC troops on board gave us unlimited leave the only fly in the ointment was the scarcity of \"Filoose\" anyhow we had a good time we had rides in motor cars all over Colombo all done by the YMCA and Red Cross people and very good they have been to us. They not only gave us free motor rides and a \"spread\" but they have put on board a cargo of fruit and cigarettes for us on the journey down to Australia.\n\nLeft Colombo on the","86":" escorted by H M S. \"DORIS\" the man-of-war which escorted us from Aden She has 10 – 6\" guns so we have nothing much to fear from the raider who is prowling around these waters. This raider is still at large and she has placed a lot of mines at points where ships will pass\n\n \n\nwithout regard to the loss of life or property \n\nThis raider uses a sea plane to locate ships but those escorted by men-of-war are left alone. There is about 6 or 8 sea planes just arrived at Colombo with French crews and we hope to soon hear that the raider has been located – and sent to the bottom crew and all.\n\nWe have on board about 60 French Colonials of various regiments from Numea and New Caledonia – French Colonies in the Pacific \nwho\n they are the remnants of various regiments who have been fighting in France. They are going back for a short spell.\n","87":" at Sea.\n\nDull monotony. Everlasting sameness. Ship only going about 9 ½ knots and to think, we are capable of going 18 knots. Finished reading \"The Return of Sherlock Holmes and \"The Drums of War\" by H De vere Stackpoole.\n\n \n\nConcerts and impromptu stump speeches each evening to pass away the time. Quite a crop of budding politicians among the Company.\n","88":" At Sea.\n\nAbout 7 A m this morning we approached the Cocas Islands a group of small Islands in the Indian Ocean mid way from Colombo to Freemantle. About 2 miles away on our Port side we passed the battered remains of the German Cruiser \"Emden\" which was sunk by gunfire and beached by HMAS \"Sydney\" on the morning of the 9th November 1914.\n\nThis route, through the Cocas group is I believe unusual. Ships generally go around the group, but with troops they generally come past here to let them see the remains of the \"Emden\".\n\nThere is of course nothing much to see actually only a battered and twisted hull battered almost beyond recognition by the Sydney’s 6 inch guns on that memorable morning.\n\n \n\n{Here follows a drawing of the Islands with a dotted line from the top of the page to the bottom marked at the top \n\nS\n\nAnd at the bottom\n\nN\n\nAnd along the line are the words\n\nfrom Colombo to Freemantle\n\n and an arrow to one island with the words\n\nPosition of wrecked \"Emden\" \n\nAnd an \"x\" marked \n\nSandy Beach \n\nThen one island marked \n\nNorth Keeling Island covered with Cocoa Nut palms\n\nwhilst on the right hand side of the page the top two islands are marked\n\nSouth Island\n\nCocas Island\n\n(with an arrow and the words \n\nwireless station destroyed by \"Emden\")\n\nand the last island is without a name}\n\n \n\nI stood on the flying bridge of the \"Star of England\" on the morning of the 9th November 1914 when we were passing the Cocas Group on our way to Egypt with the first Expeditionary Force. The \"Sydney\" was on our port side, and being nearest to the Cocas Islands when the call for help came from the wireless station there she turned and made off at flying speed in that direction. An idea of her speed may be imagined when in 12 minutes she had completely disappeared. That was about 9 A.M. At about 11.40 A.M. we received the marconigram \"Sydney engaging enemy cruiser Emden\". A little later came another marconigram \"Enemys cruiser beached and burning action still proceeding\".\n\nA little later \"Sydney now chasing enemys collier \n\nThe \"Sydney\" came upon the collier and the crew were already in the boats waiting, they had scuttled her and had\n\n \n\nleft her to sink. The crew were taken on to the \"Sydney\" and to make sure a couple of shots were fired into the vessel to expedite matters and the \"Sydney\" raced back to the Emden again, putting her completely out of action. Then with the prisoners and the worst wounded she steamed for Colombo. One of the \"Empress\" line of steamers passed us at a great speed next day going to the North Keeling Island to take on the remainder of the \"Emdens\" crew, fix up the ruined wireless Station bury the dead and so on.\n\nSo ended the career of on of the worst pirates the sea has ever known. Her last piratical act was to destroy the huge oil tanks at Madras\n\nThe night before she was destroyed she passed with 20 miles of our huge fleet of 42 ships. Her Commander Captain Von Mueller stated that he knew that a large force was on its way to Europe but he thought that we had gone on ahead and so he missed the golden opportunity of his naval career. Why? Because he could have dogged us like a wolf and waited for darkness and then like a bolt from the blue could have put on full speed and charged through us and his torpedoes\n\n \n\nwould have taken a heavy toll before either of our escort could attack her and having got in amongst us the situation would have been critical It would have been difficult to open fire on her for fear of hitting another ship.\n\nSo she lies there on a narrow strip of beach a battered, shattered and rusting wreck, no longer a menace to the seas and the ships which sail thereon\n","89":" At Sea\n\nAll hands fall in for church at 10 o’clock on the boat deck. \n\nWe are now in that part of the Earth’s Surface where both the \"Great Bear\" and the \"Southern Cross\" can be seen at the same time a rather unique experience as the \"Great Bear\" is generally only seen in all northern latitudes and the \"Southern Cross\" is to be seen in all southern latitudes. At about Aden is the highest where it can be seen\n\nThe \"Cross\" hereabouts is rather high in the heavens and the weather last night was very\n\n \n\nclear and the \"Cross\" looked very beautiful I have waited for many long months to see it again Shall I ever leave it again? It seems like an old friend to me.\n\n\"Oh star of hope whose tender beam\n\nFalls on my spirits troubled dream\"\n\nHomeward bound for the land of the Southern Cross! I don’t seem to realize it even yet. I shall wake up yet and find myself sleeping under a bush on the Sinai Peninsular on in some dug-out on Gallipoli or I shall wake up after one of those 10 minute spells at each hour on one of these never-to-be-forgotten soul-killing night marches again.\n\nNow for a short description of conditions of life on board the \"Willochna\" The ship firstly is 8000 tons we left Suez on the 8th March, did a record spin to Aden and were hung up for 14 days waiting for an escort to Colombo 3 days in Colombo and now we are approaching Fremantle which we hope to reach next Thursday. This ship has two propellers and 16 knots is an easy matter for her but the old battleship \"Doris\" out in front cannot go much more than about 9 ½ knots \n\n \n\nher boilers are very dirty so report says and we must of course dog on slowly behind her No hope of getting away on our own she would soon stop us if we felt so inclined She is armed with 11 – 6 inch guns so the question of stopping us would be an easy matter\n\nNo reveille is sounded on board but breakfast is at 7.30 plenty of water for bath or wash and plenty of bath rooms. The majority of men on board are crippled and incapable some with arms off some have lost legs some still have great gaping wounds from the last two actions which we fought – Maghdaba and Rafa – so the duties are very slight A good many of the men who have had various sicknesses and not badly wounded have recovered to a great extent although when we first went on board there was scarcely an able-bodied man amongst us. We have about 7 Sisters with us and they do a great deal of work in fact there would be plenty of work for 7 more. These sisters are splendid and most self-sacrificing\n\n \n\nand devoted to their duties I don’t know what us poor devils would do without their tender nursing The death roll would be very much greater if they were not in these military hospitals. They are the only mothers some of us ever knew I have a tender spot in my heart for these splendid women\n\nWe walk about the deck all day in anything some in pyjamas some in \"shorts\" - anyhow – no one takes the slightest notice how we dress we go on church parade the same, plenty of good book to read, arguments and discussions galore all the friendliest spirit, concerts, lectures impromptu stump speeches, essays, any thing to make the time pass pleasantly\n\nDinner at 12 noon, good food and well-cooked, served up a bit rough we admit but why worry about such details the food is there and plenty of it? Some of them growl about the food, chiefly the men who have never been within 50 mile of the firing line and certainly men who have never roughed it on service. So we let them grumble and pass on.\n\n \n\nTea at 5 pm Everyday something different; always a change of diet. The ship is a regular home and I for one am thoroughly satisfied. Lights are switched off at 10 and then some argument crops; up and must be discussed we don’t seem to have had time enough during the day but must wait till the lights go out – sleep time in fact. I am as bad as the rest but I mention what really does happen.\n\nNext morning at about 6 oclock some one who was disturbed last night by us arguing wakes us all up by saying \"Six oclock all you noisy people, now is the time for that argument, now let us hear all about it not after lights out\"!\n\nNot a word\n !\n\nSergeant Fallick is the leader, he is a veritable mine of knowledge on things political, he is a modern Demosthenes and he generally picks on me as his opponent I am always quiet until then but then the fun starts and goodness knows when it is likely to end. Fallick walks \n\n \n\nabout the ship now with a huge book entitled \"The Commonwealth Year Book\" giving statistics on all subjects and with that book he can put up some fearful arguments. Sergeant Dill is also a noisy member but he doesn’t care about giving in when cornered Sergeant Pascoe is most telling in his discussions but he has an unfortunate voice – too pitched – too soft and with Fallick and Dill and myself he stands a poor chance of getting a word in edgeways when once the discussion gets going\n\nSergeant Tyrell is also a local politician but he has a difficulty in speaking coherently as he had the misfortune at the actions at Rafa to have his bottom jaw blown off with a Turkish bullet. McSweeney and Campbell and several others are hopelessly outclassed\n","90":" at sea\n\nGreat ructions in the Starboard Dormitory the other night. The boys were skylarking about and their lights which were showing directly out to sea were not screened which is the usual procedure now a days. The Second Mate came on the scene and told them to screen the light or else put it out. They did neither and some one in fun\n\n \n\nsaid \"We’ll put your light out\". The second mate got furious and threatened all sorts of penalties if they did not comply with his order The boys only laughed at him and his orders and to crown all someone hit him over the head with a pillow. That did it. Every light in the ship went out – switched off from the engine room. So for two nights we have had \"lights out\" at 7 pm as a penalty – Truly the innocent suffer for the guilty!.\n\nTo night however the lights are on again and if they are not screened, out they go again. The whole thing is nothing but a piece of bluff and officiousness, the second mate being the sole cause. He had better watch out for another pillow.\n\nThe weather has taken a sudden turn and it has been cold all day with a strong wind quite a change to what we have been having lately\n\nAll West Australians are getting ready to leave us at Fremantle and they are not sorry either\n\nThere are several of the 2nd Regiment on board going back to Australia \n\n \n\nmyself Sgt Stevens Corpl Evans both wounded at Rafa Ptes Smith Lane Smellie & Graham.\n\nAm reading Hansen’s \"Farthest North\"\n\nCopied from the \"Commonwealth Year Book\" First Convoy to Europe –\n\n- DIVISION- \t\tOfficers \t.OR.\t\tTotal\n\nDivisional Headquarters\t\t 21 \t-\t 65 -\t 86\n","91":" Inf Brigades \t396 -\t11955 -\t12351\n\nRegimental Light Horse\t\t 25 -\t 511 - \t 536\n\nDiv Field Arty HQ & 3 Bdes \t 82 - \t 2118 -\t 2200\n\nDivisional Arm Column -\t\t 19 \t 564\t -\t 583\n\nDivisional Field Engineers -\t 21\t -\t 610\t - \t 631\n\nDivisional Signal Company\t -\t 6\t -\t 157\t -\t 163\n\nDivisional Train -\t\t 30\t -\t 667 -\t 697\n\nThree Field Ambulances -\t\t 30\t -\t 732\t -\t 762\n\nAttached (Veterinary, Pay, Nursing, Ordnance etc Services Chaplains, War Correspondents Interpreters etc -\t 68\t -\t 298 -\t 366\n\n Total Divisional & attached 698\t -\t 17677 -\t18375\n\nLight Horse Brigade\n\nHeadquarters -\t\t\t 8\t -\t 28 -\t 36\n\nThree Light Horse Regts\t\t 75 -\t 1533 - \t 1608\n\nLight Horse Signal Troop. -\t\t 1\t -\t 42 -\t 43\n\nLight Horse Brigade Train -\t 7 -\t 153 -\t 160\n\nLight Horse Field Ambulance. -\t 6 \t -\t 112 -\t 118\n\nAttached 3 Chaplains -\t 3\t -\t - - \t 3\n\nTotal Light Horse Bde and \n\n attached\t100\t -\t 1868 -\t 1968\n\nGrand Total","92":" Convoy\t\t798\t -\t 19545 -\t 20343\n\nGrand Total 2ns Convoy. \t\t564\t -\t 10597 -\t 11161\n\n \n","93":"\n\nFremantle was sighted soon after daylight. Came alongside about 8.30 Am.\n\nAbout 30 West Australians got off lucky beggars they were sick of the long journey. The people of Fremantle gave us a good welcome I was the Orderly Sergeant for the day and had a great deal of running about on various jobs. We had some splendid gifts of fruit etc very good of the people\n\nNo leave to the shore was granted because some of the troops during the past had got ashore and great difficulty was experienced in getting them aboard again In fact we have some of them on here who missed the ship last time I am glad to say some of them got well punished\n\nSteamed out from the wharf about 5.30 pm The battleship Doris leading but she left us about midnight and now we are alone and going at about 14 knots instead of the slow pace of about 9 knots. Hope to reach Melbourne on the eve of Anzac day.\n\nHeavy ground swell and strong\n\n \n\nwind and we have got something of a roll on.\n","94":" At Sea\n\nSince leaving Fremantle a couple of days ago we have not seen any land nor any shipping we have I believe had a course appointed by the Admiralty which has been much further south than the ordinary track of traffic. The \"Doris\" has gone she left us the first night leaving Fremantle we have had some very heavy swells and at times the ship has done some terrific rolls\n\nThe spirits of all on board are gradually going up by leaps and bounds. We expect to reach Melbourne on Wednesday morning The weather has been very cold for the past couple of days and we have been a good deal in the blankets just to keep in out of the cold. The journey is now nearly completed it has been a long and tedious and anxious one and we will be glad to get it over especially those men suffering with nerves.\n\n \n","95":" At Sea\n\nCold and windy. All kits to be taken down to No 5 hatch to be fumigated Drizzly rain and we are not used to that.\n\nPte James Howard Mitchell of the Canterbury Mounted rifles died this afternoon at 1.15 pm from spinal paralisis caused through wounds received in action at Rafa on the","96":" and he was buried at sea at 4 pm the whole ships company being present. The burial service was read by Chaplain General Mackay our \"padre\".\n\nThe ships engines were stopped during the ceremony. \n\nOh the irony of Fate! He was severely wounded at Rafa and only expired today, one days steam out of Melbourne. We have been delayed through the \nGerman\n Raider which has been floating around\n\n \n\nthe ocean and we were hung up for a full fortnight at Aden then we had to go at a pace of only 8 knots because the Cruiser \"Doris\" was not capable of going faster. Left to ourselves we could have easily gone at least 16 knots. So through hanging about on the water for so long, the poor fellow died He could easily have been home in the ordinary course of events that privilege must be for ever denied.\n\nHe suffered great pain and prayed death to relieve him. It came at last.\n\nThere was to have been a concert tonight – a good one – to wind things up so to speak, but it has been cancelled.\n\nMy head has been aching today don’t know if it’s the weather or not. But there it is.\n\n \n","97":" Victoria Coffee Palace Stanley Street Brisbane.\n\n\"The shouting and the tumult dies\n\nThe Captains and the Kings depart.\"\n\nThe roses have faded, the long journey ended – and we are indeed home at last! What a long journey, what suspense at times!\n\nWe landed at Melbourne on Anzac Day – a most appropriate time I thought – and we had a magnificant reception from the citizens of that city. We were cheered and hurray-ed from Port Melbourne to the Red Cross home just over the Flinders Bridge. We were granted leave immediately up till 11 pm. The long sea voyage being over and the excitement of the reception and the roar of traffic in the streets made my head giddy and I for one was glad to get into a nice comfortable bed.\n\nThe next day we all paraded and \nabout 45\n were taken in\n\n \n\nmotor cars through the street to the railway station en route for Sydney. We of course left the Victorians and the South Australians behind.\n\nArrived in Sydney next morning about 10. oclock and were accorded another hearty welcome there and taken in cars to another Red Cross home. Left Sydney at 7. pm same day travelling all night had breakfast at Glen Innes and lunch at Wallan Garra. Changed trains there and travelled to Brisbane reaching there at 9. pm were given a splendid reception by the towns people. Motor cars to the Kangaroo Point Military Hospl.\n\nMy nerves were in a somewhat damaged condition when the journey was ended and I went to bed on Saturday night and stayed in bed all day on Sunday On Monday I was \"boarded\" for discharge – on Tuesday I had to give evidence before the Pension Authorities and pass the Commonwealth Doctor and now the papers have gone to Melbourne to the Defence Dept. to be finally signed and then my discharge from the A.I.F. is complete.\n\nAm I glad? Am I sorry?\n\n \n\nI regard it with mixed feelings First I am glad to be away from all responsibility and the worry of looking after men the training of men and \"dry-nursing\" them etc. The responsibilities of communications and the hundred and one little incidental worries and annoyances so common to army life, and the freedom from active service in the field. Complete immunity from those Reconnaissances , long forced soul-killing night marches. Those long dry hot thirsty day marches patrol duty, bomb scares, Fights in the desert etc. etc. The getting back to civilization to ones friends and relations and \"in short\" living a life of silken ease. All very nice all very fine\n\nNow for the other side of the \nQuestion\n Question.\n\n The war is not over yet and it seems as though they are only now beginning to \"shake things along\" and every able bodied man is needed in the field. Reinforcements are not coming along as they should be – whaffor? Ships loads of men coming back who have been broken in the war. Casualties lists lengthening not shortening.\n\n \n\nThere are also such a host of seemingly eligible men who have not joined yet and have no intention of doing so which makes one almost ashamed of the sex. That is why I am not too keen on remaining here. My thoughts are always with my splendid Regiment and with those gallant lads I have left behind who are \"carrying on\". God bless them all and as far as possible give them a safe return. For my part I am at present a \"returned empty\" – a back number – one, who tried to do his duty as far as was humanly possible . And when I recover completely which may unfortunately take some time I hope to go forward again and take my place in the ranks of our deathless and brilliant army. Because I know that we are fighting for our homes, liberty, justice, and right.\n\n"}}