{"Document Name":{"0":"Diary_0445","1":"Diary_0445","2":"Diary_0445","3":"Diary_0445","4":"Diary_0445","5":"Diary_0445","6":"Diary_0445","7":"Diary_0445","8":"Diary_0445","9":"Diary_0445","10":"Diary_0445","11":"Diary_0445","12":"Diary_0445","13":"Diary_0445","14":"Diary_0445","15":"Diary_0445","16":"Diary_0445","17":"Diary_0445","18":"Diary_0445","19":"Diary_0445","20":"Diary_0445","21":"Diary_0445","22":"Diary_0445","23":"Diary_0445","24":"Diary_0445","25":"Diary_0445","26":"Diary_0445","27":"Diary_0445","28":"Diary_0445","29":"Diary_0445","30":"Diary_0445","31":"Diary_0445","32":"Diary_0445","33":"Diary_0445","34":"Diary_0445","35":"Diary_0445","36":"Diary_0445","37":"Diary_0445","38":"Diary_0445","39":"Diary_0445","40":"Diary_0445","41":"Diary_0445","42":"Diary_0445","43":"Diary_0445","44":"Diary_0445","45":"Diary_0445","46":"Diary_0445","47":"Diary_0445","48":"Diary_0445","49":"Diary_0445","50":"Diary_0445","51":"Diary_0445","52":"Diary_0445","53":"Diary_0445","54":"Diary_0445","55":"Diary_0445","56":"Diary_0445","57":"Diary_0445","58":"Diary_0445","59":"Diary_0445","60":"Diary_0445","61":"Diary_0445","62":"Diary_0445","63":"Diary_0445","64":"Diary_0445","65":"Diary_0445","66":"Diary_0445","67":"Diary_0445","68":"Diary_0445","69":"Diary_0445","70":"Diary_0445","71":"Diary_0445","72":"Diary_0445","73":"Diary_0445","74":"Diary_0445","75":"Diary_0445","76":"Diary_0445","77":"Diary_0445","78":"Diary_0445","79":"Diary_0445","80":"Diary_0445","81":"Diary_0445","82":"Diary_0445","83":"Diary_0445","84":"Diary_0445","85":"Diary_0445","86":"Diary_0445","87":"Diary_0445","88":"Diary_0445","89":"Diary_0445","90":"Diary_0445","91":"Diary_0445","92":"Diary_0445","93":"Diary_0445","94":"Diary_0445","95":"Diary_0445","96":"Diary_0445","97":"Diary_0445","98":"Diary_0445"},"Date":{"0":"unknown","1":271.0,"2":272.0,"3":273.0,"4":274.0,"5":275.0,"6":276.0,"7":277.0,"8":281.0,"9":282.0,"10":283.0,"11":284.0,"12":285.0,"13":286.0,"14":287.0,"15":291.0,"16":295.0,"17":297.0,"18":298.0,"19":299.0,"20":300.0,"21":301.0,"22":302.0,"23":304.0,"24":305.0,"25":306.0,"26":307.0,"27":308.0,"28":309.0,"29":310.0,"30":311.0,"31":312.0,"32":313.0,"33":314.0,"34":315.0,"35":317.0,"36":318.0,"37":319.0,"38":320.0,"39":321.0,"40":322.0,"41":323.0,"42":324.0,"43":325.0,"44":326.0,"45":327.0,"46":328.0,"47":329.0,"48":330.0,"49":331.0,"50":332.0,"51":333.0,"52":334.0,"53":335.0,"54":336.0,"55":337.0,"56":338.0,"57":339.0,"58":341.0,"59":342.0,"60":343.0,"61":344.0,"62":345.0,"63":346.0,"64":347.0,"65":348.0,"66":349.0,"67":352.0,"68":353.0,"69":354.0,"70":355.0,"71":357.0,"72":358.0,"73":359.0,"74":360.0,"75":361.0,"76":362.0,"77":363.0,"78":364.0,"79":365.0,"80":366.0,"81":367.0,"82":368.0,"83":369.0,"84":370.0,"85":371.0,"86":372.0,"87":377.0,"88":379.0,"89":380.0,"90":381.0,"91":382.0,"92":383.0,"93":384.0,"94":385.0,"95":386.0,"96":387.0,"97":388.0,"98":392.0},"Entry":{"0":"\n\n","1":" I was awakened at 2am by the Sucani (pron. seekunny) a coolie quartermaster.\n\nI got dressed & went round to the Marconi Room which was under the bridge, facing aft.\n\nI sat down at the instruments & at 3am I began to feel queer. The saloon berth had done it. I had just time to get to the side when \"up she came\". As waves were washing over the deck I had to scramble back to the Marconi Room. Placing the phones over my ears I drew the chair near the door & putting the door on the hook just ajar I sat down & went through all kinds of agony. My repeated \"wurp\" \"wurp\" woke Teddy who advised me to call the Sucani & get a cup of tea. I got it & drank it, but alas another \"wurp\" made me lose half of it, the remainder following the next \"wurp\". It’s a beggar said Teddy, I remember my first trip across to America. I could not get up at all. Try a dry biscuit & I did. It stayed down just long enough for Teddy to get to sleep when \"wur’r’r’p\" & I lost it. Instead of doing as Teddy had advised & keep on eating & drinking I stopped as it was a pity to waste it. The Sucani who was watching me with a sad & wise face had several narrow escapes in dodging my supper. I looked at \n\nmyself in the mirror & saw that I was white & trembling. So soon I had wished myself an Electrical Junior & cussed myself for going away from a \"good job\". The pictures were falling off the wall, and crockery in the pantry next the Marconi Room was rattling away & crashing to the floor. Down came the clock with a crash on to the instruments & next minute a bookshelf followed. I tried to sit on the chair but I could not. Getting up I walked to the door & opened the port hole. Outside everything was dark except where a few lights here & there showed the Coolies in oilskins & sea-boots battening down the hatches. Waves were racing over the deck & washing all loose gear overboard. One particularly vicious \"wuff\" or \"milestone\" the A13 struck swung the open port back on my head, at the same time racing across the deck it stove the cook’s cabin in as though it were paper, & almost washed them over the side. I sat down again nursing my head & almost longing to founder & end it quickly. I did not care if I never saw Sydney again.\n\nTeddy who was wakened by this, began to hum \"A life on the Ocean Wave\" at the same time wedging himself between the bulkhead & the bunk boards. I put in a most miserable time until eight o’clock when I wakened Teddy and went out for a breather, but had to return as the A13 was wallowing in the trough of the waves like a pig in mud. The wind howled through the rigging all day & threatened to blow anyone over. About 1pm a cry of \"Fire\" was raised. The A13 was hove to & an examination made. The Captain & all the officers had pale faces, as fire is dreaded by all. It was located amongst the fodder in No1 hatch which is right \"forrard\". A hydrant soon extinguished it & everyone gave a sigh of relief, as the A13 headed south again. That night I felt much better & had come to the end of my troubles with seasickness. The soldiers poor fellows were lying in heaps in their quarters uttering groans & wupps alternately. The soldiers were quartered on the shelter deck \"forrard\" which is reached by a gangway down No1 Hatch. There are numerous tables with small sideboards to keep the utensils from falling & at the end of each is a cupboard on the bulkhead\n\nwhich contains the articles of that particular table. The space is lighted with electric light & in the extreme portion of the bows are the store room, canteen, prison cells & the sergeant’s mess. Notices are attached to the bulkhead instructing in the case of fire etc. \nSmoking below decks strictly forbidden at all times.\n The prison cells are simply small cells with a few bars for a window & a rough bed, the cells being isolated from the men’s quarters. Bread & water is the food allowed to the unfortunates put into quod. Hammocks, which the soldiers sleep in may be slung below – from the deck above, or may be slung on top with the sky for a covering. The bugle sounds Reveille at 6am when the soldiers arise & have a bath & pack their hammocks. 7am start cleaning down decks etc. Eight am feed horses & then begin breakfast. Smoke-oh up till 9am & then for work – and plenty of it. Horse stalls to be cleaned, decks hosed, etc etc.\n","2":" nothing out of the ordinary happened until 3pm when Captain Jackson sent a wireless message down to be transmitted to Hobart radio asking for any instructions. Being on shift it fell to my lot to send it.\n\nMy heart beat fast as I started the machinery & \"tuned up\" on a few \"V’s\" which are used to test the machinery with, each \"V\" crackling across the rotary gap like a pistol shot. If the silence chamber is left open during the sending of a message, it can be read all over the ship. It was my first message sent officially & I was very excited. Hobart radio was about one hundred miles away. The actual transmission of the message which has an abbreviated signal is \nVih\n (Hobart) \nde\n (French word for from) \nGEH\n (Katuna) \nQRU?\n (when followed by a question mark means \"Have you anything for me.\" Without a query it means \"I have something for you.\" The words underlined being the actual message sent. In a few seconds there was a distant but very clear response to my call. It was \nGEH\n (ie Katuna) \nde\n(from) \nVIH\n (Hobart). \nHear Melbourne weather forecast 19 words 25th. No 1 GQ\n (all stations ie that is it was for all stations as well) \nGEH\n (to Katuna particularly) \nOcean forecast. Southerly gales passing from straits\n (Bass) \nbut continuing over Tasman sea, sea smooth to moderate elsewhere.\n In my anxiety I missed the word \"Tasman\" but it was repeated on my asking him to repeat \"word between \"over\" and \"sea\". The \n\nreply is usually \nVIH de GEH\n (as before) \nNo1 OK. TKS\n (thanks) \nom\n (old man) \nVE\n (finish). Yes we knew all about the southerly gales and it was very cold. The sea moderated somewhat but the A13 would still viciously roll from one side to the other until the weight of her engines would counteract her tendency to lie flat. She would then return to the other side & so on. A word here may be said about wireless signals, a brief explanation being given of their transmission & reception. Those familiar with electricity should have little difficulty in following.\n\nThe ariels may be imagined as the radiator & the hull of the boat is used as a return (via the intervening sea, land or both). Alternating current of convenient voltage is generated usually by a rotary converter driven from the ship’s direct current mains. This passes through various switches & choke coils (to prevent any kick back from the self induction of the transformer) and to the transformer. A rather massive telegraph key is included in the low voltage circuit & controls the current to the transformer. This transformer of special design transforms the low tension current to a very high potential \n\nin the order of about 100,000 volts. This high tension current of course is very dangerous & a spark will jump across the terminals sometimes up to twelve inches or more.\n\nThe length of spark does not indicate the power of a station\n as is usually believed. It is the \ncurrent\n in the secondary (within limits of course).\n\nIn parallel with the high tension leads, which are connected to a spark gap of various design, usually two hardened zinc hemispheres, are connected a condenser & an inductance. These latter two instruments by their capacity, determine the frequency of this circuit. On the condenser being charged to its maximum potential it discharges itself across the spark gap & as known charges itself reversed in polarity. The oscillations created in this circuit by the discharging (up to thousands per second) of the condenser across the spark gap set up exceedingly high frequency oscillations in the inductance, which in turn is \nin\n coupled to the radiating circuit inductively. The radiating circuit then is the ariel in series with the secondary of the inductance, earthed at the lower end. The amount of coupling of this \n\noscillation transformer as it is termed denotes the selectivity of signals.\n\nOnly single or two phase current is available in the primary of transformer.\n\nFor those who follow this:- \n\nIt will be seen that the transmitting station is actually an open circuit radiator.\n\nSo it is, and the circuit is completed through the distant ariel, instruments & earth return thus:\n\nSupposed complete circuit is shown by arrows.\n\nThe wave length of a station is explained thus\n\nIt must be assumed that a transmitting station radiates these oscillations in definite length waves determined by the size & capacity of the ariel & instruments principally. The \"commercial\" wavelength of stations is 600 metres & may be demonstrated thus.\n\nassumed waves being 600 metres from crest to crest. This can only be determined by formula or special instruments. Naval wave length is 1800 metres wave length. Now, a receiving station must be \"tuned\" to respond to the transmitting station therefore – unless otherwise arranged – all stations must work on a 600 metre wave length. \"A\" working to \"B\" on a 600 metre wave cannot hear \"C\" working to \"D\" on 1800 metre wave but by tuning up to 1800 metres he can hear \"C\" but he then cannot hear anything but on 1800 metre wave. If several stations (in range of one another of course) work on 600 metres it is almost impossible to hear any one at a time. Being tuned to 600 metres, any station in range can be heard, and this confusion of several stations being heard in the phones at the one time is called \"jambing\" & the only remedy is to either alter wave length (rarely done) or to \n\nwait until the rest have finished. The wave length is altered by the varying of instruments in coupling & capacity. The signals, listening to the transmitting, are like pistol shots, the current jumping across the spark gap with a vicious spurt. To those familiar with electrical machinery it is like a \"kick\", only decidedly pronounced.\n\nIn the receiving station they are received in a pair of head telephones in the form of a sharp \"purr\" – in the form of dots & dashes as the morse code is used. The tone is generally very soft, unless very faint in the case of long distance or loud if anywhere near. The pitch varies a great deal but in the case of the Telefunken system the note is piercing & cannot be mistaken. This system has many advantages over the Marconi system, & is generally used on high powered stations. Atmospherical disturbances such as storms, perhaps hundreds of miles away, all cause the ariel to respond, as a lightning discharge has no fixed wavelength & may be called \"broad wave\". Moisture, dirt, etc all cause serious trouble & at times put a station out of service. Wireless is very whimsical & subject to changes in the temperature, & the presence of any electrical machinery, especially alternating current.\n\nWith this outline it will be understood that at times an operator has an unenvying time.\n\nFrom noon the previous day till now, the average speed of the A13 had been 6 knots. At four o’clock that afternoon land was sighted & gradually drew nearer. The coast is extremely steep & is chiefly huge basalt columns. At last we came to Cape Raoul at the entrance of the River Derwent. On rounding this cape we came beam on to the swell & for some minutes had an exciting time in keeping our feet. It was just dusk & as we proceeded up the harbour a pilot boat came out to meet us and after satisfying himself he boarded the A13 & the pass signal was hoisted. Each night this signal is changed, the night referred to it was two white lights over two red lights. When a pilot boards a steamer for the purpose of piloting her, he becomes the master of that ship until he has finished his mission, & is held responsible for the ship. Should he issue an order, it is open for the captain to issue a contradictory order should he think advisable, but in his case, if anything (\nthat\n) happened to the steamer through this contradictory order, there can be no claim made \n\non the insurance company in respect of damage done. Should the pilot make an error, the insurance of the ship holds good just the same, but as soon as the captain contradicts him the insurance risk ceases. As we passed the forts stationed near the entrance, searchlights were played continuously on us. The water was quite smooth here & the air \"nipping\".\n\nWhen about half a mile from the town the engine room telegraph rang \"STOP\" & gradually we slowed down until the pilot yelled out \"Let go\", and with a rattle of machinery & ringing of the ships bell, the A13 was anchored in about 100 feet of water. At every 15 fathoms of anchor cable there is a shackle & as each shackle passes over the windlass, a ring is given on the bell & this way lets the pilot know when enough cable is out, when he calls to \"stop\". The town of Hobart could be seen alight with electric lights at the foot of snow capped Mt Wellington. It looked a very small town & there was no noise or bustle such as is heard in Sydney on a Friday night. Nine o’clock was just chiming on the Hobart Post Office & the first difference I noticed was between our cracked Town Hall chimes & the sweet tones\n\nfrom Hobart Post Office chimes which could be heard quite clearly on the cold air. Mount Wellington with its snow capped summit formed the background & looked like a huge hill. Being dark it was almost impossible to form any opinion of the surroundings. Teddy’s first concern was to crawl into his bunk & go to sleep & I used to chaff him about missing Hobart’s beautiful scenery. He had not been to Hobart, but even then bed was his \"home\". I soon followed him & awoke at six am","3":" hearing a lot of bustling outside the door. \"Where are the two operators\" called out Captain Jackson. \"In bed sir.\" \"Pull them out quickly.\" Hearing this talk I jumped up & began to dress but had only donned a shirt when the second officer came & turned us out for \"Muster\". I saw everyone lined up & wondered what \"muster\" was. Teddy in his \"panjamas\" as the carpenter called them & myself in my shirt found that Hobart air was rather cool. The Port Doctor then examined each of us by looking at our faces & smiling. All being well on board he gave the signal for the quarantine flag to be lowered & passed the A13 for a berth. I got dressed after this & was astonished to find his lordship Teddy fast asleep as if nothing had happened. The A13 was \n\nberthed at the Ocean Pier at seven a.m, & an armed guard of Tasmanian trainees in full war paint was stationed at the Pier to prevent \"visitors\". Numbers of military big guns admired & criticised the A13 & fussed around like a number of blowflies – all noise & no use. After a great deal of Persuasion I managed to get Teddy out in time for breakfast, & Teddy’s troubles began then. Instead of finding his place at the table, he found it, & others filled with the military big guns who only wanted a \"snatch\" for breakfast. If that was only a \"snatch\", no wonder Teddy felt concerned about his breakfast, for a \"grab\" would have ended all hopes of a bit of breakfast. Of course, as one \"head\" finished his \"snatch\" he would \"Excuse me Sir rather busy\" etc & would pass the word to the next hungry head & a few moments later he would appear at the saloon door & begin his apologies thus:- \"Er-er- Excuse me\" – er-er – \"Good morning major\" er – \"having a little breakfast\"? Er – \"I am going up town to get mine now\" er-er. No! no! from the major in the act of placing himself outside some fish. Sit down. Captain doesn’t mind er er \"do you?\" Oh! no. & Teddy would walk back to the cabin, his hands in his pockets, & a look like\n\n\"three pennorth of heaven help us\". \"Never seen anything like it\" he would say. Breakfast was over by nine thirty & the soldiers began to load fodder & munitions – 100 cases of rifle bullets, a few artillery guns & other odds & ends. At five p.m. work ceased for the day & the soldiers were given leave to go ashore. We were allowed ashore at any time, as long as the officer in charge knew, in event of anyone wanting us. Teddy as usual got into bed at seven o’clock – Hobart having no fascination for him. I naturally strolled ashore to see what a town was like.\n\nHobart. Tas.\n\nThe streets are wide & well kept, clean & blocked. The first thing noticed is the absence of traffic. No crowded trams like in Sydney, nor lines of vehicles tearing down the streets. Passing a kind of small square pond with a number of small sailing boats tied up, one comes to Macquarie Street, which is one of the main streets. The Council controls the trams which are very small & double deckers with seating accommodation for 34 on top. All entering & leaving these trams must be done from the rear end, being like an old bus in appearance. They are painfully slow & rattle along like a poison cart in\n\n\"outback\" country. Their leading feature is their cleanliness which surpasses Sydney trams. It costs 3d for a ride the length of a Sydney 1d section. Cardboard tram tickets are issued & a hole punched in it. The tram tickets bear the following ….No.Ticket.Pay.Again. There are only about six different lines & I chose the one to Sandy Bay, but returned in the same tram as there is nothing to see but houses. Air brakes are not in use on the trams & it looks queer to see the guard winding up the hand brakes. But for all that they do not threaten to kink one’s back like Sydney trams do. The customary trolley pole with a wheel is replaced by a wide bracket: - \n\nthat runs along the line wire & makes a perfect imitation of rusty machinery & sparks like a roman candle. The guage is very small indeed, but the trams can deal with the small traffic.\n\nThe Policemen who stand at the crossings are a smiling lot – like alderman on a holiday. They are mostly big, stout men & wear a helmet with a metal badge large enough to hide behind. Their knowledge is good to middling as generally they admit with their smile that they \"Don’t know\".\n\nThe Railways are worst of all. Hobart station is a dark dirty platform without an official in sight, & seems altogether neglected. The trains themselves are small\n\nfew & on a level with New South Wales in some of this State’s old railway cars. Only one train every six hours.\n\nThe Ferries of which there are but two boats cross & recross the harbour every few hours. A weird old vehicle punt makes a few trips a day. It is a wonder it floats at all & is a work of art. It was eventually an old ferry boat. The Harbour is large, well sheltered & deep. It is very smooth but at times squally winds blow down from Mt Wellington & make it gusty in places.\n\nThe shops are a very mixed lot & are mostly dirty shabby places that sell cheap articles.\n\nPaper boys congregate in scores & screech out \"Mercury\". A person purchasing a newspaper from one of these boys is sure to be set upon by the remainder like a number of crows. The Paper (\"Mercury\") is a very countrified paper & has about three issues daily. The last edition is usually a sheet of paper, one side blank, & the rest filled up with short stories etc. Often with old war news dished up with a new appearance.\n\nThere are no buildings anyway out of the ordinary. The G.P.O. being about the largest. The university is a fine building in the Domain but has no special features. Two picture shows is the extent of amusement. No theatres. Bands play in the few parks on Sunday evenings usually. Their masterpiece is \"Lead Kindly Light\" & this is \n\nprobably their way of showing their sentiments as the parks are unlighted.\n\nHobart summed up without prejudice is a sleepy old town such as may be expected from a backward country.\n\nIn Hobart\n","4":" Today being the first Sunday on board I expected there would be a kind of service. Not much. Everyone put on their best duds & went ashore. Teddy & I opened up a Phonograph that was to be given to the troops later on. There were some familiar songs & several that caused an outburst of \"Cheese it\". Altogether the musical programme was a success as the papers say. In the afternoon I went by tram to the \"Cascades\" but was \"sold again\" as there are no cascades there. Cascade brewery is the only sight to be seen. The Cascades are at the foot of Mt Wellington, but to look up Mt Wellington is not an invitation to climb it, so I turned back to the ship.\n","5":" Horses were taken off the A13 & turned out to graze as there was no word of\n\nleaving Hobart. Teddy could not be persuaded ashore at all but eventually he gave way & we went for a walk. About eight o’clock he turned back \"for bed\". His opinion of Hobart was not worth","6":" \n","7":" Things were getting very slow indeed. The Chief Engineer had the boiler fires \"banked\" & there was no word of leaving. A Naval officer examined the life saving gear & inspected the men at fire drill. \n","8":" The Second Officer called us up to the chart room & seeing that nobody was hanging about he showed us the Naval instructions regarding the use of Wireless Telegraphy in convoy. That night we went to the pictures & in the interval the apprentice Roberts noticed some girls he had been to the pictures with a few nights before. They ignored Roberts however, so being rather hot-headed he blurted out \"You don’t know me now but you ate my chocolates the other night.\" It was rather rude I admit but we had to keep him quiet. The people of Hobart are homely & oh! so homely. In fact they look like a lot of wowsers to be expressive – they are not all wowsers by any means. They are like Teddy in retiring to roost at 8pm & arising with the advent of breakfast.\n","9":" Chief Officer, Teddy, Apprentice & myself decide to go for a sail so on being granted permission we got the coolies to lower the cutter, & hoisting the sail\n\nwe set out for a pleasant morning. Roberts began by falling over the Chief Officer who used a great deal of nautical language to ease his feelings. The Chief Officer was a short, fat, fussy little fellow of about fifty. He came from Gosport England. Anything sensational was his mark & what was not, he would soon make it. He was the most amusing of all on board with his antics & caused no end of amusement. Being Chief Officer he naturally got the greater half of any trouble, not that it upset him very much, but the least thing put him \"up the spout\". For instance 4 am. Chief Officer on watch \"Now then! now then! now then! & in a howling voice Hold her! Whoa! Now look at what you have done & so on until Teddy would mutter in his sleep \"Young(?) Cory on the move?\" & Captain Jackson would wander out in his pyjamas to enquire into the trouble. It was generally found out that the Quartermaster was steering 1 degree out of the course. At 7am. Sucani Hey! Sucani. Tell the Serang to tell Roberts I want the carpenter. When the Carpenter would crawl up the steps (he was almost crippled with rheumatics & blind in one eye) the Chief Officer would say\n\nNever mind – after Breakfast will do! So that is something of the Chief Officer’s ways.\n\nWell, we soon got into the middle of the harbour & made towards Sandy Bay. On the way we passed the ladies baths & several of the bathers were coming for a sail but as usual, when we went to get them they ran away squealing. Two girls on the esplanade seemed agreeable, so we headed towards them & in a few moments were in difficulties. Look out! look out; Whoa! yells the Chief Officer as the bottom came up & we were stuck fast. Teddy shed his boots & socks & got us off. The girls naturally thought it was a great joke. The Chief Officer could not manage the boat at all. Instead of answering the helm it would go any way, but the right way. On hoisting the boat on board the A13 after, it was found that the Keel had been bent, hence the trouble. Of course Captain Jackson was annoyed & swore a great deal, but he never learned the cause of it. Captain Jackson was very fond of girls or rather young ladies & would make any excuse for going ashore \"on business\", to everybody’s amusement, & only once he owned up to it by asking me to take his photo for a er-er- \"young lady in\n\nMelbourne.\" In nature he was reserved & rather sulky looking & seldom smiling. When \"getting busy\" he was a demon & quickly the word would pass round – \"Look out, the old man is on the move\" & there was no need to say it twice. Everybody was afraid of him & he knew it. Even the Sucanies would hide in the ash hoist until the way was clear. He was known for his \"don’t stop\" way in a storm. Nothing like that ever worried him, providing there was no deck cargo liable to shift, & also that he was in good trim. He was very like the Chief Officer in some things & would roar like a bull over nothing, & lose his onion as Teddy put it, over a trifle. He would calm down again just as quickly as he started. Very exacting in detail & when he said No! it was better to leave it at no rather than try & alter it. During the afternoon Teddy as usual went to sleep & I went up the Domain & joined in the amusement caused by \"Old Dick\" a religious fanatic spouting away. \n","10":" During the afternoon the whole of the Troops marched in from three miles out of the town, headed by a snowy white haired old lady, who would persist in\n\ncarrying the banner, to the soldiers’ delight. On the way in, someone stole their mascot, a dog. A reward was offered for its return & some forcible pieces of news inserted in the paper but the dog never returned.\n","11":" At eleven a.m. a British warship came up the harbour with her band playing \"Sons of the Sea\" & flying the Naval Ensign – white with union jack in corner.\n","12":" this was the escort. I had heard a warship on the wireless set several nights previously.\n\nNot a cheer arose from our men, but in respect our ensign was dipped & she answered, as she drew ahead of the German Australian boys’ Oberhausen, then a prize of war, & anchored. At twelve oclock another band was playing, so we all went up on the bridge to see where it came from. It was another battle cruiser the Ibuki, flying the \"Rising Sun\". Our ensign was dipped & she returned the salute. As our officers stated afterwards, it was one of the smartest actions they ever witnessed to see that Japanese battle cruiser anchor. She stopped in twice her length & before the anchor was down, a boat load of men was coming\n\nashore. The soldiers on the A13 climbed up the rigging & yelled \"Banzai\" until hoarse. Through a telescope could be seen the Jap sailors in white uniforms working like trojans & their officers were magnificently dressed & were here, there, & all over the place. Both cruisers had been scouting around the Pacific for two months & were rather dirty looking & rusty, especially so were her torpedoe nets. Soon after her arrival, an oil tank steamer came into Hobart to fuel the Ibuki & two colliers coaled Minnetau which was the British cruiser’s name.\n\nDuring the afternoon the Second officer, Military Doctor - Captain McKay Teddy & self went sailing in the cutter & when out about an hour got \"becalmed\" & could not move. Later on we sailed round the Ibuki & took some photos & once when a steam pinnace came our way we thought we were to be arrested as spies. The Ibuki had some large guns – 12 inch & when close alongside, it could be noticed how every available space is utilised without crowding. A beautiful little steam pinnace lay snug against her funnels & her wireless station was situated aft on the after deck.\n","13":" The sailing boat had been in use again & during the afternoon the Second officer & Teddy \n\ndecided to go for a sail. I was half inclined to go too but somehow I stayed. Captain Jackson was rather reticent about allowing them to go as a gusty squall was blowing. However he gave way & made them take a reef in the sails. One thousand lbs of fire bars were brought up from the engine room to be used as ballast. They are long slabs of iron used in the fire box of the furnaces. After some time, these firebars were placed in the cutter & the two set out. When less than a hundred yards of the A13 a gust of wind caught the sail & snapped a halyard. Slowly they drifted away, nobody knowing they had had an accident. At five oclock Captain Jackson returned & asked if the Second Officer & Sharples were back yet. On being told no, he began to fidget & \"got busy\". The Chief Officer of course got the brunt of it but consoled himself & tried to comfort Captain Jackson with the fact that he had prevented Roberts the apprentice from going. At six oclock Captain Jackson sent word to the Navy Office to the effect that two of the A13’s officers were adrift on the harbour. Word was immediately sent to the forts near the mouth of the river to keep a good look out. The 3rd Officer got into communication with the Ibuki by means of the morse lamp & the\n\ncommander was going to arrange for one of his steam pinnaces to take up the search. Just then a red flare was noticed away out towards the heads. Word was thereupon sent to the forts to send the examination steamer to their assistance. At the same time the searchlights found them & as a coincidence, the pass signal up the harbour for that night was a red light. After a lot of trouble & by the assistance of the searchlights they were towed to safety, & spent the night on the pilot boat. At 1pm","14":" the Second Officer & Teddy were sent back to the A13. Teddy’s only concern was the loss of his cap & being cold.\n\nAt noon the Ibuki, now spick & span, left Hobart for N.Z. from whence she was to escort the N.Z. transports. At 1pm the Minnetau followed. \n","15":" During the morning the Coolies were discovered to have chicken pox in their quarters. By arrangement with the Health authorities the Coolie quarters were disinfected, it not being necessary to quarantine. The Coolie quarters are situated as far off as possible, over the vessel’s screw. They are small & have no cabins, but the bunks are arranged like shelves. The Coolies smoke here until it is stifling. Dirt they love.\n\nAccording to their religion (Mohammedan) they must wash in running water. To do this they don a robe or loin cloth & standing on the after deck pour jam tins of water over their head. They have other religious principles such as putting mustard seed oil on their hair etc. All these quaint ideas must be allowed & their representatives in Calcutta, Bombay & other ports, see that they do get them too. They are slow workers but will do a wonderful amount in their own way. They work at one speed always & nothing can make them hurry, nor can they be persuaded to forsake any particular routine they follow. It is better to leave them alone. They are not backward at stealing if they are not likely to be caught but the Sucanies (quartermasters) & the Serang (Chief) can be trusted without fear, they being a higher caste than the others. They do not value life at all once their blood is up & threaten murder wholesale. They are remarkable in their ways of purchasing goods. They go ashore with £1 & come back with boots, coats, hats etc etc & about","16":" left. When they draw any money Serang stands by & demands so much \"backsheesh\" which they dare not refuse for Serang would belt them with a cane later on.\n\nThe coal wallah or stoker works away at the furnaces in the blazing heat in the tropics & never murmurs because they will sleep in front of a fire in the tropics & like it. Being used to the great heat it does not affect them. A white man going outside & into the sun without a hat would be sunstruck but a Coolie will work all day in it. Steam pressure is always maintained without a bit of trouble until they do not get their share or imagine they are being \"done in\". Then the trouble begins & ends as soon as they are put right again. Their chief man is called Serang & he is practically the overseer. The sailor is termed a Calassey & the lowest caste of all is the Topass who does all the dirty work. Their pay ranges from £2\/10\/- per month for the Serang to 10\/- per month for Topass. Their chief food is a bilious green looking curry made from rice, curry powder, beans & meat. When eating they all squat round the big brass bowl containing the curry & \"dive in\" with their hands. The coolie cook is called a \"Bhandarry\" (pronounced bandarry) & he sits alongside so as to hear the verdict on his cooking. Each coolie thus gets his share which he begins to \"mix\" with his fingers. When thoroughly fingered,\n\nit is crammed into their mouths & swallowed. The Coolie’s kitchen is a filthy place. The bhandary wears a waistcoat & a loin cloth & is the most criminal looking person imaginable. His special dish is \"cherpody\" (pronounced shuppoty) or bread. Teddy called them flap jacks. The bhandary has a beard like a goat & a few fly’s legs for a moustache. However, the cooking is done on the surface of a coal stove & the result of the cooking is not enhanced in appearance as it gets covered in cinders. These flap jacks are like a crumpet only larger & as tough as rubber. Serang has amongst his stipulated terms a loaf of the ship’s bread each day. Flapjacks evidently upsets his digestion. They will not eat dead meat hence the necessity of carrying live sheep. Serang also must have the sheep’s heart to eat. The Sucani is the highest paid coolie & he receives £2.13.4 per month, as he has a higher position & one of trust. The coal wallah or stoker is a pitiable object to look at. As thin as a clothes peg with burnt feet that are always blistered & look like horn as the coal wallah does not wear shoes. His hair & eyebrows burnt almost away, & he is generally filthy dirty. At 8 bells he goes down to take his watch at the fires, with a flapjack & a tin of water. After four hours he comes up with a smile, & has his bath and \n\nsleep till 8 bells again when he takes another shift. The time on the ship is kept by several chronometers so that any error in one clock is allowed for in another. Some vessels have five chronometers which keep Greenwich time. Time is most important & an error of 1 second may throw calculations out 60 miles. Greenwich time is only used for navigation purposes. Otherwise the time used is that of the particular meridian. At 12 noon the Sucani at the wheel reaches up to the ship’s bell hung over the wheel & strikes 8 bells – in 4 sets of 2 rings. 12.30pm one bell or one stroke. 1.00pm-2 bells 1.30pm-3 bells 2pm-4 bells & so on up to 4pm when 8 bells are struck again. This goes on day & night with the difference made in the first & second \"dogwatches\" between 4pm & 8pm. Thus at 4pm 8 bells are struck. Five oclock 2 bells. Six o’clock 8 bells. Seven oclock 6 bells & Eight oclock 8 bells. During the time between sunset & sunrise a Calassey is stationed at the bow of the boat to give warning of any approaching steamer or land & he repeats the bells rung from the bridge on a larger one in the bow. Every hour too he sings \"Batti-atchi\" in a weird voice which means \"lights all right & burning bright\". He is in a position to see all the ship’s lights.\n\nShould he see a light from a ship or a land light he signals it to the bridge by giving the large bell either, one bell for port side (left) or two for the starboard (right). He is relieved every four hours, in fact everyone is relieved at eight bells except the wireless operators. The chief officer keeps a watch between 4 & 8am & pm. Second officer 8 & 12am & pm & Third officer 12 & 4am & pm.\n","17":" Orders to embark were received hurriedly & everyone was in a bustle. Teddy was sick of Hobart & so was I. The soldiers had breakfast at five am & were sent out to get the horses. Gangways were soon erected & a large squad of soldiers laid coir mats over the decks ready. Strict sentry had been maintained day & night & nobody was allowed to pass the barrier at the entrance to the wharf without a pass although when known it was not necessary. This was strengthened now to guard against strangers who at times were inclined to look upon the guard as a joke but the point of bayonet put joking aside. H.M.A.S Geelong was berthed at the same pier as the A13. The assistant operator on that boat came over & would\n\ntoast himself on our cabin heater, (steam) there being none on the Geelong. Being the last day perhaps we decided to fix him up. He was a real \"old woman\", always poking his tongue out \"looking for strawberries\" & taking medicine for imaginary ills. However our chance came that morning. After talking about the wireless set for a while & asking questions, he went out to buy a paper – evidently to read whilst sitting on the steam heater. We’ll fix him said Teddy as he ran two leads from the emergency coil to the door handle, shutting it at the same time. The spark gap was closed right down so as to give him a good one without fear of injury, and on testing it there was quite a shower of sparks. When the electrodes of this coil are opened 10 inches & the key pressed, there is a sharp \"burr\" & a spark like a small stroke of lightning. Great care is needed when handling this coil as it \"stings\" badly. Teddy sat at the instruments with his hand on the key & I walked to the porthole. In a few minutes he came along the dock rubbing his hands & getting ready for \"a warm\".\n\nI gave the \"wink\" to Teddy & jumped into my bunk, almost knocking my few poor brains out on Teddie’s bunk. Grabbing the door handle he was just turning it when Teddy \"sat on the key\". There was a prolonged \"burrrr\", sparks & a vicious tug – or rather \"let go\" – at the handle, but he never stayed to read the paper.\n\nAt ten am the soldiers arrived with the horses & the artillery sections for the \"Geelong\". The horses behaved well & slowly but surely they were embarked. Some of them gave trouble by standing at the bottom of the gangway & refusing to go up. A few ropes & a dozen soldiers soon put him on. Some had to be blindfolded but in the end at five pm the last horse was placed in his stall. The work of making the horses comfortable cleaning up, feeding & watering took a few hours to do but with our full complement of soldiers (about 120) it was soon done & they were granted leave – excepting a few required for \"picket\". The third officer, Teddy, Roberts & myself then went ashore & to the Palace Pictures. The programme was the usual thing. A lovesick man & a demure girl etc etc & the Hobartians being such a homely lot evidently \n\npreferred this particular kind. By arrangement amongst ourselves, each time the lover with a vicious dart would impress a kiss on the sweet maiden, we would put it into action on the back of our hands, the sound resembling anything but a kiss. Teddy then made a discovery on the programme – patrons are invited to join in the chorus of \"It’s a long way to Tipperary\", with the orchestra. At half time or rather interval Teddy bought chocolates I bought oranges & the others bought sundry other \"kill-me-deads\". At last the song came & we broke in on the second line as we lost the first line swallowing chocolates. The key notes got rather mixed & I must say it was b. Teddy evidently got the right note for he began to beef it out in fine style. The first verse ended in a decided win for the A13. During the next verse Teddy broke his G string & the result was awful. Roberts got a bit of chocolate stuck in his windbag – windpipe I mean so I decided to leave it. On the last line, instead of it being a crescendo effect, it fizzled out altogether. There was no encore so we agreed that the Hobartians did not \n\nappreciate good music so we got up & left – not forgetting to swap a white electric bulb for a red one we wanted for photography on board.\n\nWalking back to the ship we passed a house with a candle burning near the window. Naturally we just glanced at the window – & further back & saw a lady in the act of removing a stocking. Of course we were shocked, so much in fact that several of us let out a stifled moan of anguish, to the lady’s evident discomfit for she immediately blew out the candle.\n","18":" At eight oclock the pilot boarded the A13 & after breakfast the took his place on the bridge. At nine am the A13 gave a long blast on her whistle & slowly drew out. There were some very pitiful scenes between the soldiers from the Geelong & the A13. Some were brothers & others sons & never have I seen such a heartbreaking farewell. Civilians were blocked by the police who took no chances & erected the barrier several hundred yards up the street. The Geelong’s buglers played \"Lights out\" just before we got out of earshot & it seemed so weird, especially as it is rather a familiar to those who have heard \n\nit in camp. Our destination was not known to the soldiers.\n","19":" We were now out of sight of land & the soldiers were not told where we were going to. They therefore singled us out as the ones to tell them but we could not as only the ship’s officers knew. They made shrewd guesses by the position of the sun & tried many catches to trip us up. \"Say\" \"what speed are we going\"? About twelve knots. When do we touch land again – Don’t know. Such trips as these were placed before us again & again & in the end it became a case of being like an oyster. Our first horse died today & was dumped over the side. That night the soldiers slung their hammocks on the deck as it was very smooth. At two oclock (am)","20":" I went out to get some fresh air for a few minutes & found the soldiers all asleep in their hammocks & some on the deck. Some were in their hammocks & some were out, some snoring like pigs but all asleep. There was Mathias from South Australia who had a very heavy growth of face moss, mouth wide open & half out of his hammock. Each roll of the A13 threatened to land him on the iron deck. The few\n\nshaded electric lights threw a faint glow over their features & they seemed peaceful enough. Poor fellows they had given all in leaving home & were on an errand of death perhaps. The picket sitting on a bag of chaff reading a book. Looking down the hatch could be seen another picket sitting on a box evidently thinking of home. The horses stood quietly gave no trouble. Looking up to the bridge could be seen the Second Officer walking from side to side. Sucani \"Bugwhiskers\" at the wheel, his face just aglow with light from the binnacle, on which he keeps his eyes. Yes! What a little band we were, miles from land, & yet nobody seemed to recognise the fact of going to war. Wrapping my \nkn\n overcoat around me, it being rather cold I sat down at the instruments to take my watch. Teddy had drawn the curtains across his bunk & was fast asleep. Outside, a solitary Sucani stood like a statue, waiting in case he be needed. A faint whispering in the phones, which, when \"tuned\" a little sharper turned out to be the station on Flinders island, was sending the weather forecasts broadcast to the stations in all the states. These weather forecasts are transmitted from Macquarie Island wireless \n\nstation where there is a Meteorological Bureau to Hobart & are then relayed on & they then appear in the papers that morning. Little do we think when we read the forecast that it was sent from a little room on an ice continent away south of New Zealand, during our sleep. A little later it ceased & nothing could be heard but the \"breathing\" of the magnetic detector, caused by the variations in the magnetic field which is far too small to measure, it being infinitesimal but the high sensitiveness of the wireless phones record it. During the morning the soldiers had some revolver practice by shooting at bottles thrown over – each bottle getting a hail of bullets as it floated astern. When the supply of bottles was at an end, hats, plates, & other articles followed. In the afternoon it was decided to vaccinate the soldiers. They were lined up on the deck in single rank & bared arms. No excuse was accepted & those who refused to be done would be put ashore at next port & returned. Several saw their opportunity in this way out & refused. They were returned. One by one the entered the\n\nhospital & were vaccinated, the sergeant standing by with the roll book so there was no evading. The hospital was a strong little building on the port side amidships. It was fitted with two bunks with spring mattresses, electric fan, & good ventilation. Two A.M.C. corporals attended to the patients with every little need. The first patient was still in bed with crushed ribs received on the day of leaving Hobart. Next room contained an enamel bath, hot & cold water laid on, sterelising tray & medicine chest, the whole hospital being well fitted. Immediately the soldiers got out of sight they washed the lymph off consequently few \"took\". \n","21":" At 6am a cry of whales on starboard quarter was raised, two large ones being seen quite close. About eight am a large waterspout was sighted some 8 miles away, & which the A13 carefully avoided. A steamer also passed on the way to Adelaide from Capetown. \n","22":" At three a.m. \"Bugwhiskers\" came to the door & said \"Tea sahib?\" (sarb). His usual practice was to awaken me at 2 bells (2am) – Teddy turning in at a quarter to two. He would just tap me on the back & say \"2 bells sahib\" & when I answered him he would leave – but not until I answered. \"Bugwhiskers\" was the only one\n\nto be trusted not to forget & he was always on time. I was listening to a station with a powerful clear note that could be heard above all the x’s (atmospherical disturbances). I had heard this station several times before & he was getting louder each night but still he was a long way off. On hearing his call I found it was H.I.J.M.S. Ibuki. She was on the way to Albany with the NZ troops & at the time was nearing Australia. She was in continual communication with NX – the naval base at Albany W.A. She had three distinct notes, one rather low pitched, a medium, & a penetrating note that was heard for hundreds of miles. It was the Japanese system of wireless telegraphy. By the judicious use of these three notes & by using several call letters it appeared or would appear to the enemy as if a number of warships are working. A warship’s wireless note & tone of signals cannot be mistaken for another. They have secret ways & secret instruments. A \"wind-bag\" or sailing ship passed 4 miles on the port bow at 6.30 am. During the afternoon Fire & Boat drill was carried out. This is done very Saturday afternoon while at \n\nsea. At 4.30 pm the A13’s whistle sounds a long blast & the Captain calls out either Boat stations or Fire stations. Taking a fire for instance. \nThe whole crew\n, excepting the man at the wheel, the officer on watch & the engineer on watch, & the wireless operator on watch,\n must turn out\n & he forms up in line on his allotted place. The Coolies form up in a line of their own. The other two officers (Second & Third) have charge of the two divisions & they mark the roll before starting to lower the boats. This is to save anyone being missed. When right the Captain calls out \"Fire in forepeak\" or maybe \"Fire in No 4 hatch\". Being on watch at this time I always missed taking part in this. Each man then takes part in the drill. On the command \"Boat stations\", assuming it is necessary to leave the ship on account of the fire, each man hastens to his boat as arranged. On the word \"Lower away\" the boats are swung out on the davits & the men lined up. The boats are not lowered & this drill is not done is a roughs sea is on, as it entails too much risk. Great rivalry was shown between the Starboard Boat & the Port Boat – which two boats only were used for drill – in the desire \n\nto race one another. The Starboard boats always won excepting once & that was the cause of bitter words being said to the men on that particular boat. \n","23":" Today the sea began to rise & there threatened to be some rough weather. By following the chart it showed that we were nearing Albany. The soldiers were completely lost & gave up all hope for the time. We were to reach Albany that evening if possible before sunset, as, after then the warships prevented anyone entering until sunrise the following day. At 9pm a little spot of revolving light was seen. The soldiers then soon got their bearings & guessed correctly. It was Breaksea Lighthouse at the entrance to King George’s Sound. It was impossible to make Albany that night so speed was reduced to less than 2 knots. The sea was now running very high & gave the A13 a time wallowing in it. \n","24":" At 6am in thick rain & heavy sea, the Melbourne (warship) came out & semaphored to enter the Sound & to ride near the entrance until the sea moderated. Passing through the channel between Breaksea Island & the mainland, the A13 dropped both anchors & rode head on. Through the veil of rain & mist could be seen dozens of\n\ntransports & the officers amused themselves in picking out the familiar ones. The sound is in appearance like a large bay with a narrow entrance blocked by two large islands that appeared like two huge smooth boulders just dropped in the entrance. H.M.A.S. Melbourne stood in the entrance all day & night keeping watch. She looked like a black wasp.\n\nDuring the morning the Flagship (Orvieto) sent a wireless message to the transports to the effect that the junior operator would transmit for practice purposes & all operators were to receive it. At about eleven am the general call C.Q.\n\n(all stations) was given & we all prepared for the practice. Whatever was sent is not known. It was mutilated beyond reception. It was our friend \"X\" from the Marconi Co who, instead of taking an easy pace was trying to exceed himself with the resulting consequences. It was reported however & \"X\" was relieved by another who was slightly better but far from good. Evidently a great deal of preparation had been taken in fitting up the flagship’s low powered set which had a range of 15 miles (radius). Teddy was very concerned over the possibilities of this set, as he put it, Heaven help the transport 15 miles away. Naturally, as is usual in most cases undertaken by \"military muddlers\" the efficiency of this low powered set was almost nil. The principle instrument was a magneto (from accounts learned later) driven by a small D.C. motor, and consequently the result was to be expected. The resulting note was ragged & broken, often fizzling out in the middle of a word, picking itself up later on. The operator generally tried to overdo the speed rate & made an awful bungle of it. We were now forbidden to use our own wireless sets for the purpose of transmitting a message unless in extreme\n\nemergency, on account of their long range. Communication was to be carried out by means of flags hoisted to the jumper-stay. During the afternoon a wireless message was sent from the Orvieto for the Katuna to weigh anchor & proceed to her berth as arranged. Old Chippy the carpenter was thereupon sent for to stand by the windlass to hoist the anchor. The starboard anchor was hoisted & the port anchor was almost \"home\" when the windlass somehow slipped back a stroke. This gave the anchor a corresponding slip which resulted in the windlass losing control completely which in turn resulted in the anchor plunging to the bottom at the same time stripping the teeth off the main driving drum & tearing the eccentrics clean out. The Chief officer naturally got the blame as he is in charge of this operation, although as a matter of fact it was a misfortune due to the windlass slipping. We were now powerless to heave the \"hook\" up at all. Captain Jackson stormed & swore but soon quietened down & came to me with a message to be sent to the Orvieto stating our position & need of urgent repairs. I ventured to remind him of the instructions not to use the wireless but was met by \"Dammit what’s the thing \n\nfor if I cannot use it.\" I then transmitted it to MOJ the flagship & although I ran the converter as slowly as possible to minimise the range, I can imagine the resulting strength as received by MOJ & the transports at such a short range. However MOJ acknowledged it OK. An hour later another message for the A13 containing a caution re using wireless. Flags must be used in all cases it read, but in practice it was simply impossible to carry on thus. Had the person responsible had any thought of efficiency in signalling it would have saved much worry & anxiety to supply each transport with a \"tuned high frequency buzzer\". The cost is about 4\/- & the result would have been excellent, instead of waiting hours till answered by flags. \n","25":" At 4 a.m. there was a splitting crash that echoed all around the Sound. It was a 6 inch gun fired by H.M.A.S. Melbourne across the bows of the S.S. Essex, who failed to stop when ordered, but there was no hesitation on the part of the Essex after that gentle reminder. At eight a.m. the last Australian transport arrived & berthed. All day long wireless messages were sent, cancelled, altered & sent again.\n\nIt was annoying to say the least of it & Captain Jackson remarked rather strongly on the \"----- Australian methods\". The procedure when about to transmit a message by wireless is as follows. The officer in charge (on H.M.A.S. Melbourne) issues the orders for the day which are usually transmitted \nin code\n by wireless to the Flagship. Here they are de-coded & transmitted on the low powered set to the transports. Before being transmitted to the transports, the Flagship hoists a certain flag signal ten minutes previous to transmitting. This signal serves as a warning. The transports now hoist the same flag signal \nat half mast\n. Ten minutes after being hoisted on the flagship, the message is transmitted by radio (usual term for wireless). If transport receives the message OK, then the flag signal is \nhoisted to the full\n, but not unless the message is received OK. Until the message is received the flag signal must be left at \nthe half\n when if necessary it will be transmitted again. Usually it was never repeated & if missed, that ended it. The messages were many & of little importance. Private so & so. Number so & so etc etc. Left wife & children without support etc. Tug boat will \n\nremove him at such & such a time. Private – – required by police etc, etc, etc. Hour after hour they came. \n","26":" About ten am the mail boat (a chartered tug) came for letters & delivered those for each transport. Letters were to be left open for the censor. Those letters closed would be delayed a fortnight before being posted. On this tug boat was Major McCall who was the C.O. of 16th Engineers Signal Troop at Victoria Barracks & with which troop I serve. He & numbers of others were to meet on the flagship at noon for the purpose of attending a meeting – the outcome of which was generally the same; Many good intentions. There were several tug boats chartered for the use of the navy & on one boat were two elderly ladies & two girls who evidently intended going the rounds on a pleasure trip. By the look of their faces – green – their dishevelled hair & agonising \"wupps\" it could be seen that they were far from being happy. One girl lay with her head on a sergeant’s knees & another threatened to overbalance but for a grip on her ankles. It was a great sight & all enjoyed it – but from experience we pitied them. Just before lunch the N.Z. transports arrived with H.I.J.M. Ibuki.\n\nOne thing against the N.Z. transports was very prominent & that is their lack of courtesy which is general. Whenever a warship, cruiser or other vessel of such kind passed an Australian transport it was made a strict practice, & rightly so, to show a mark of respect by dipping our ensign to that vessel. The warship always acknowledges it by repeating the salute. Even amongst the Australian transports this practice is followed but amongst the N.Z. transports & the warships it was seldom carried out. From the moment they entered the Sound they began to officiate & it became necessary to stop it. In other ways, such as their transports, management, food, etc they can run rings round the Australian Red Tape methods. \n","27":" New parts to the windlass arrived during the afternoon & were fitted – the work costing some £120, a sum that was extortionate. A feature of the Australian methods may be noted here. Stores had been ordered in Albany by the Steward & no facilities were given to get them aboard the A13 & permission would not be given to get them. Typically Australian. It was beginning to get very tiring being hid up in the harbour & everyone \n\nwas anxious to start. Another one of the 16th Engineers was also met. It was S.S.M. Haynes better known as \"Iddi umpty\", who was on H.M.A.S. Euripides. Two men, one naval & one military were now appointed to the A13 to signal by flags when necessary. Their particular duty was to keep watch for the flag signal \"ZMX\" previous to a radio message, & to give the operators notice, also to see that the signal was hoisted when received. They were not much use – the military man being a perfect source of trouble –. He seldom saw the flag signal & often gave notice when too late. To put it plainly they were unreliable.\n","28":" At 4p.m. a radio was sent to the A13 to take up our position in the lines. The transports lay at anchor in three divisions as would be at sea only in the reverse order. That is, the flagship instead of being nearest the entrance to the Sound was closest inshore. At the head of each of Second Division & Third division was a sub-flagship. The windlass was just repaired in time & we took up our position in No 1 division at 6pm. Shortly afterwards a very long message was sent\n\n \n\nto all transports regarding method of leaving the next day. At 4am steam was to be raised so that at 6am a head of steam sufficient to steam at 12 knots was possible. At 7 am the convoy headed by the flagship would leave. First division, each, & in turn would follow the Flagship out to sea. Second division & third division to follow & to form up – Second division on port (left) side of 1st division & third division on starboard (right) side of 1st division. \n","29":" – SUNDAY At 4 am the coolie firemen were banking up the fires & gradually the pressure guages showed the rising pressure. All the transports were swinging at anchor & could be discerned by their lights. Everything was quiet & there were no indications of anything unusual. The warships were still keeping a watch & although invisible in the darkness they were all alert. At 6 am the sun was about to rise, & threw a soft golden light over the Sound. It was a beautiful day, & a Sunday morning. Small jets of steam could be seen issuing from the exhaust pipes of the transports & the A13 was beginning to shiver slightly. All of a sudden the Argyllshire’s exhaust pipe began to roar like a fog-horn as the enormous \n\nforce of steam began to escape. One by one the transports began to follow – issuing clouds of steam & smoke. It was like a huge iron foundry, & a wonderful sight – 38 ships laden with good men setting out on a serious mission. Sharp on seven a.m. H.M.A.S. Melbourne steamed out towards the entrance. She was stripped for action & flew a large union jack at the foremast & the Australian naval ensign from the gaff at the mainmast. As she passed each transport saluted & was saluted in return, but again the N.Z. transports showed their utter lack of courtesy. A little astern, followed the Flagship also flying an ensign at the foremast. Each transport thereupon hoisted her ensign (over the stern from the flagstaff there) her code number & her speed cone. This latter was a canvas cone that was hoisted according to speed, for instance at full speed it would be hoisted to the full & when the engines were at half speed the cone was lowered to half & so on, thereby indicating the speed to the transport following. Bands then struck up martial music & it was a sight never to be forgotten. Each & in rotation as before explained followed in order out to\n\n- Formation -\n\n- in -\n\n-\nConvoy\n-\n\nBetween transports ½ mile\n\nBetween divisions 1 mile\n\nWarships 2 miles out\n\nLength of Convoy 5 ½ to 6 miles\n\n \n\nH.M.AS. \"Melbourne\"\n\n \n\nSub Flagship - Convoy Flagship - Sub Flagship\n\nHMAS Sydney - 2 miles -\n\nWiltshire - Orvieto - Euripides \n\nA18 - A3 - A14 \n\nMedic - Southern - Argyllshire \n\nA7 - A27 - A8 \n\nAscanius - Pera - Shropshire \n\nA11 - A4 - A9 \n\nStar of England - Armadale - Afric \n\nA15 - A26 - A19 \n\nGeelong - Saldanha - Benalla \n\nA2 - A12 - A24 \n\n Port Lincoln - Katuna - Rangatira \n\n A17 - A13 - A22\n\nKarroo - Hymettus - Star of Victoria \n\nA10 - A1 - A16 \n\nMarere - Suffolk - Hororata \n\nA21 - A23 - A20 \n\nClan MacCorquodale - Anglo Egyptian - Omrah \n\nA6 - A25 - A5\n\nLimerick - - - Miltiades \n\n- - - - A28\n\nWaimana - - - NZ Flagship Maunganui \n\n- - - - Tahiti\n\n- - - - Athenic\n\n- - - - Ruapehu\n\n- - - - Orari\n\n- HIJM Ibuki – 2 miles\n\n2 miles astern\n\nHMS Minnetaur\n\nsea & took up her position. On leaving the entrance a radio was sent to first division to reduce speed to 7 knots until second & third divisions got into position. H.M.A.S. Pera’s engines broke down temporarily & dislocated the first division. A radio was then sent to A13 to keep up in position. There was a great deal of trouble over the position keeping until the masters became accustomed to the close order, as they are used to a wide sea to steam in. In a few hours everyone settled down to the journey. H.M.A.S. Melbourne led the convoy two miles ahead of the convoy. Two miles behind H.M.A.S. Melbourne was the flagship & a mile on either side was a sub flagship & behind them were the transports. Two miles outside either flank (division) was a warship which appeared like a toy but great confidence was placed in their presence. Two miles astern was H.M.M. Minnetau which was picked up two days later. (See plan) The warships occasionally changed places.\n\nOn the warships there were two men stationed at the very top of the foremast, in telephone communication with the officers below. They had a long range of vision from their position & gave warning of any\n\napproaching steamer. They of course kept a continual watch by radio day & night. At night they were invisible as they show no lights, & the only sign of their presence was an occasional flash from their morse lamps. Captain Jackson was very nervous with the close proximity of the transports & certainly, at times the Saldanha would slow down without any warning & the A13 would have to swerve sharply out of line, which resulted in a caution from the warships & also caused the rear transports to swerve out too. A special \"revolution table\" was compiled on each transports for the following purposes. At night, the only means of ascertaining the distance of say the A13 from the preceding transport is by \"taking a sight\" with a sextant. At the mainmast & directly over the stern (at a certain angle to the surface of the sea) are two white lights & these are for taking sights.\n\nBy this means it is possible to tell the exact distance from the next transport (or any other for that matter). To keep the required distance may require an additional revolution of the propeller per minute to maintain the position, so the necessity of the revolution table which was used for that purpose. It may seem absurd but one half a revolution too many (per minute) will bring the transports abreast of each other in an hour or two hence the necessity of a \n\ncorrect speed. Everybody was glad to be \"on the way\" once more many were the jokes passed about the German Cruiser Emden meeting the convoy. Many cautions were issued this night regarding the obscuring of all unnecessary lights. Message after message was sent by morse lamp from the warships stating that such & such a transport was showing a light in such & such a position. They named the exact place of the light. On the starboard side could be seen a long line of red lights & on the port side a line of green lights which are the required navigation lights. Ahead, could be seen two dim white lights that had yellow bunting wrapped around them until just visible. Astern was a weird sight – a huge black mass with a red & a green light on either side, rolling lazily from side to side like a big monster. \n","30":" Trouble with the Southern was practically constant as she was a 9½ knot boat being forced to do 11 knots. At night the flames could be seen roaring out of her funnel. Her speed practically determined the speed of the convoy. During the early hours HIJM Ibuki had received the news of Britain’s declaration of war on Turkey & she now sent it to the convoy \n\nWarships, with their high ariels & special instruments can receive wonderful distances & when nearing Aden they received the war news sent out on \"long wave\" from Poldhu trans atlantic station in England. The news in question did not cause any unusual excitement at all as It was thought that our destination would be England. The weather began to get squally again on rounding the Lleuwin & blew \"great guns\". \n","31":" At two am on taking my watch it was blowing a howling gale & a high sea was running. The wind howled & whistled through the rigging making hideous wails & moans, & sitting down at the instruments I began to write my diary up to date but it was impossible. First the ink would slide off the table & then the lamp stand. Then the crockery in the pantry next to our cabin would rattle like fury. Lightning discharges were crackling in the radio phones like crumpling brown paper, & yet through it all could be heard Perth radio to Geraldton radio with press news. A few moments later the Melbourne would get into communication with Perth by radio & carry on code messages. The Melbourne however being so near, it was necessary to tune him down to stop the piercing noise. All of a \n\nthere was a vicious roll that cleared all the books off a shelf & woke Teddy up, \"Catch ’em\" he squarked out but I was not an octopus as the clock came down next & I tried to save that. Teddy then began to sing a \"Life on the ocean wave\" at the same time digging his knees into the bunk boards to prevent being slung out. For some time after he kept repeating in his sleep \"A life on the ocean wave\". In the morning it was a magnificent sight to see all the transports rolling & pitching & throwing clouds of spray over themselves. The cruisers, with their great mass, when they bury their noses in a wave, rise, & the wave sweeps from stem to stern. At times the Sydney would almost disappear in the trough of a wave & the transports would rise as a wave rolled under them until her nose was high up in the air. She would then plunge down into the next wave & send the spray flying all over her. The Hymettus who was astern of the A13 would bury her nose in a wave until her decks were awash & would then rise until the wave passed under her. From the A13 it appeared splendid, especially as the sun was just\n\nrising astern, & each time a shower of spray flew over the Hymettus, it appeared like a halo round her. Naturally the A13’s decks were awash & it was very funny to see the assistant steward demonstrate \"legs in the air gentlemen\" by upsetting himself someone’s breakfast, through trying to walk the steep angle of the decks. Even old Tiddles & Tommy the ship’s cats had to dig their claws into what they could. Two of the military officers lay in bed as though dead, alternately cussing & \"wurping\", & wasting breakfast. Sergeant Seagraves – the \"bum-sergeant\" – crawled out of his bunk with a bilious look on his dial, to our amusement, & began to wash in warm water, which caused some very unpleasant remarks to be passed by the soldiers. He then put on a pair of tango socks, forgot to tuck his shirt tails in, & forgot to put his leggins on & sundry others. He then crawled upon the bridge in his duds & his shirt hanging out, & wanted to know \"Why the water was not turned on for the Horses.\" Captain Jackson met him as he was on the way to his bathroom & used some strong words to Sergeant dear & told him to go to ------ out of it, & get dressed before he came \n\nback again. Poor Sergeant did look silly & we were so rude as to laugh at him, because he was so fond of telling us that \"you’ll learn someday\". He learned anyhow. His heart’s pride was his moustache – a bonzer cricketer’s – eleven a side – like a doll’s tooth brush. To our delight, he was put out of the saloon – not because of his \"giddy giddy gout act\" – & had to dine with the men. In the afternoon two transports were picked up with the cruiser Minnetaur, the three of which came from Perth. \n","32":" During the afternoon the second officer began his tricks that brought some furious words from Teddy & I. He always came & woke Teddy at 4pm when he finished his watch. I protested but he continued \"on the bounce\" & Teddy took it all without a murmur. He tried it on me later on but I threatened him with sudden death. Teddy & I then slipped into the third officer’s room & would have a chat while Captain Jackson was asleep. At night we would get the phonograph & Teddy would sing to it – breaking all records (not literally). He had a bonzer voice like a nanny goat.\n\nWhether he could sing or not he helped to make a good noise intended to keep the military doctor awake, because he gorged himself like an iguana whilst we waited for our turn at the table. It succeeded admirably. Teddy’s masterpiece song was \"When the chicken chewed the brass-work off the fender\" in D b. It started well & worked itself into a southerly buster by degrees. Roberts could also sing \"Who drove the nail in baby’s head\" with effects. The third officer, Teddy, Roberts & several of the engineers would occasionally render \"Hold your hand out naughty boy\" \"I’d do as much for you\" & others that we had records of for the phonograph. The third officer & second officer each had a mandoline & would play well together until Teddy chimed in. \n","33":" The Chief Officer in whose room Teddy & I were for a few moments asked me to write up some accounts for him in my spare time. This I did, & each time, they were wrong through his mistakes in not having the correct data. An argument then arose as to my age & he said 25 if a day & married too he added. I told him my age & he would not believe me then. As to being married I said, I am never going to. I am \n\nhe said. Someday when I can find someone to have me. He was about fifty then so he will need to hasten. The Chief Officer was a very nice fellow & a real old fusser. He had spent his early days at sea on a sailing vessel & knew what hard work was. His appetite was rather large & fastidious. I’ll have a little ---, no I won’t, --- yes I will --- er is it well done? When he got it he would say I never asked for it. At four pm a little cloud of smoke was seen away on the horizon. As it drew nearer it was possible to see her name by the aid of a telescope. It was the R.M.S. Osterley, homeward bound. She endeavoured to pass between the first & third divisions but the Ibuki kept her outside. As she passed, the passengers could be seen all over the rigging – all having a splendid view of such a big convoy.\n","34":" Today we entered the tropics, & find it is just warm enough to be comfortable.\n","35":" Early in the morning HMS Minnetaur & the cruisers met together & then H.M.S. Minnetaur sent the following message to the Australian Troops:- \"Have been called on other service & \n\nleave you with every wish for a victorious time. If you get at the Germans give them Hell. It has been a pleasure to escort you & I assure you that your escort will protect you until safely landed.\" She gradually faded away out of sight astern evidently to return to South America to the Cape of Good Hope & Monmouth battle with German Cruisers. I had previously received this news about 3 am & given it to the \nChie\n Second officer. The flagships & cruisers each sent him a message of farewell. During the afternoon special orders were sent by radio stating that \nall lights\n excepting navigation lights must be obscured & \nall wireless\n stopped. New Zealand transports to close up between the Australian divisions. Masters of transports must see that this is done & any cause for caution will be increasing the responsibility of the escort. Several suggestions were also made regarding torpedoes & it was evident that there was a risk that night. Strict wireless watch to be maintained & in case of distress transports must continue to keep lights obscured. \n","36":" At two am I took my watch & on looking outside there was not a sign of a transport except for the navigation \n\nlights & everything seemed in suspense. The pickets were asleep on the bags of chaff – the officers are not strict regarding the pickets being asleep as they seldom require calling – the horses standing quietly & the old A13’s engines going thump, thump, thump. Little did any of us know that two hours ago we passed an enemy cruiser only 15 miles away. The escort evidently knew that the enemy was close & kept a strict watch steaming up & down the lines of transports. At 6 am I laid the phones on the table & had a shave & a wash occasionally listening in the phones for a few seconds. At 6.20 am on picking up the phones I heard the NZ transport Arawa who also had a low powered wireless set, calling HMAS Sydney & saying \"Did you hear Cocos Island sending SOS?\" I, naturally, waited for a reply but none came for a few minutes until the Orvieto called the transports to \"stand-bi\" & keep quiet. I then woke Teddy & he said to keep a strict watch & if anything further came through, to call Captain Jackson. Some minutes later on looking through the port hole I saw the warships all together signalling by flag to each \n\nother. H.M.A.S. Sydney then turned round & gradually increased speed as she steamed down the transports between first & second divisions. As she came abreast the A13 she was belching thick black smoke from her funnels, & the water was pouring over her bows on account of her speed. Her guns were out & decks cleared & the remaining articles of furniture etc that are left until the last minute, were being thrown overboard. She soon faded out of sight astern so, summing things up, I told Captain Jackson at breakfast time & he asked that a watch be kept for news. The cruiser Sydney kept in touch with H.M.A.S. Melbourne but being all in code we could not decipher it. It was about the fight between the Sydney & Emden however. At midnight that night we had passed Cocos Island about fifteen miles off & the Emden was close around there. (See the official description of battle at end of this book for a reliable account) Evidently the Emden’s intentions were to destroy Cocos Island radio station, cut her submarine cables, thereby isolating her from the world & then attack us at night from the rear. She would never have put up a fight, with a hope of winning but she would have torpedoed the rear transports \n\nshelled as many as possible & then run for her life. However she was 24 hours too late. The first word of the result of the battle was received at noon when H.M.N.Z.T. Maunganui called up H.M.A.S. Sydney by radio & sent the following message:-\n\nMany congratulations from NZ expeditionary force on result of first action of Australian Navy. Maunganui’s music room practically empty & could be used for wounded if convenient.\n\nTo H.M.N.Z.T. Maunganui from H.M.A.S. Sydney:-\n\nEnemy has stranded herself to avoid sinking. Casualties two killed, thirteen wounded. Enemy was the Emden (1157)\n\nLater on in the afternoon the Orvieto called all transports & gave the following:-\n\nH.M.A.S. Sydney started off for Cocos at 7 am. At 9.30 she had sighted the Emden travelling at full speed. She was able to get in range in twenty minutes, at the same time she signalled that the chase was going north. At 10.45 the Sydney\n\nwas engaging the Emden briskly & at 11.12am the latter had to beach herself to avoid sinking. Her foremast & three funnels were down but the flag was still flying. Sydney then went after Emden’s collier, took the crew off her & then sunk her. Sydney returned again to Emden who surrendered. The extent & nature of the German casualties are not known but they are bound to be severe. Our own casualties required hospital treatment which was probably found on Direction Island. The Emden had had time to destroy the wireless station & to cut one of the cables, a second cable is intact & possibly a third. All the instruments were destroyed excepting one which was buried but is in use again. The wireless operators deserve much praise for sticking to their post & sending out distress signals & for saving instruments. H.M.A.S. Sydney per \nTV\n (Orvieto)\n\nThis welcome news was posted up in the soldier’s quarters & soon drew a crowd. In a few minutes the news was common. Every transport signalman asked the next transport did he hear the news. Crowds besieged the Marconi Room for details but were turned away, saying there was no more. That night at dinner Colonel Hawley who commanded the A13’s troops, gave the\n\nToast \"The King\" \"The Sydney\" & several others. When my turn came for dinner there was the Chief Officer, Teddy. Third officer, Roberts & myself. Pinto the Cabin boy filled all the champagne glasses excepting mine which he was about to do when the Chief officer smacked his lips & said \"Here’s to the King\" without moving off his chair, & gulped the champagne down. He, being the senior officer, it was his place to propose the toast. He then called Pinto in & had some more & would have been going strong only the bottle was empty. The soldiers drank to the Sydney in tea & water & then got drunk on Hobart beer. So much for the A13’s appreciation.\n","37":" The day broke with a beautiful sunrise that gave the sea an orange tint. The sea itself was as smooth as a sheet of glass. As far as could be seen there was not a ripple excepting where the transports sent out an ever widening ripple from their bows. The transports steamed along steadily, each transport issuing a long thin stream of smoke from her funnels, which smoke rose straight upwards. Not a breath of air\n\nto ease the scorching heat. As midday approached the heat was stifling, the ship’s officers being in white uniforms. In the Marconi Cabin the heat was almost unbearable. The soldiers were clad in a pair of trousers & a white hat only. Mathias wore a pair of underpants cut off at the knee, a singlet, & a woollen cap. O’Reilly the Irishman, wore a pair of dungaree trousers turned up to the knees. His back was sunburnt & blistered but still he was happy. The soldiers were leading the horses around the limited space on the lower deck. The Marconi room faced No 3 hatch & by looking out of the door it was possible to see them leading the horses. Scottie, the leading light in providing amusement, was leading his horse round & round clad in a shirt. The heat below was awful & the sun beat down on the decks so unmercifully that it was necessary to put awnings up. At two p.m. a radio was sent to the transports that convoy fire drill would take place at three pm on the signal from the warships, soldiers to take part. Later on a message was sent to certain transports reprimanding their captains for not covering their lights the previous night. The A13\n\nwas complimented for her obscurity. At night it began to become cloudy & the heat became moist & suffocating. The pickets away down on the lower deck could only do one hour watches. Several fainted & had to be carried up. I went up \"forrard\" after my watch & saw the soldiers sleeping on the top deck. How sad it looked. Some 120 men crowded together in hammocks & some on the bare decks sprawled out in all positions to try & keep cool. I turned in about nine pm but could not sleep. \n","38":" Sucani woke me at a quarter to two, & I was just dozing again when there was a vivid flash that lit the ship up like a searchlight & a swish like a cane cutting the air. Following this came a tremendous crash that shook the crockery in the pantry & made the A13 shiver. Teddy came rushing inside in his \"panjamas\" in a great state. I was rushing outside & met him at the door. Everybody’s thoughts turned to the Karlsrhue which was supposed to be with the Emden. We all rushed to the side to ascertain the cause & expected to see a battle. Being half asleep\n\nI admit I was scared but order was restored when the Second officer sang out that it was only a fireball & to look out for rain. The soldiers, he afterwards said, were so scared that they fell out of their hammocks & for a few moments were so dazed as to scramble anywhere. Some came running round the deck in an aimless fashion & without any apparent intention. In a few moments rain, and large drops too, fell & gradually increased until a beautiful shower was falling that made the air somewhat cooler. Such was our first experience of a tropical thunderstorm, there being no sign of the approaching storm, beyond the clouds. Naturally there were some who did not come out of their cabins – they knew they said –. The Chief Officer could not find his slippers he said. The steward was not going to get up for that & so on.\n\n11th November During the afternoon a radio was sent that, as a death had occurred on H.M.A.T. Ascanius, ensigns would be lowered to half mast. At three p.m. flags were lowered & the Ascanius dropped out of line & the soldier was buried with military honours. In ten minutes\n\nthe Ascanius was steaming back to her position. It cast a gloom over all, so solemn a service. That evening beautiful cool breezes sprang up & eased the trying heat. To add to the comfort as it were, the military bands on several of the transports could be heard very softly in the distance. It is remarkable to notice the difference bright music makes in the soldiers. There was no swishing of water owing to the calm sea & it brightened the men up to hear such pieces as the \"Soldiers Chorus\" from Faust. After the band had played God save the King they all turned in. \n","39":" About three a.m. I met O’Reilly who was on picket duty, & we sat on the rail & had a long chat. He was very fond of his sister & asked me to forward some photos to her. He then took me down to see his own horse & the way he treated her was a credit to him. Man that he was he thought the world of her & when he went up to her, & called her by name, although asleep, she pricked up her ears & rubbed her nose on his shoulder. Poor creatures, cramped together in the terrible heat, each with nostrils widely extended & breathing heavily, they were a \n\npatient, devoted lot. When it was time to awaken the relieving picket he said Let him have another hour’s sleep, so we sat on the rail & he talked about his home life until it was time to wake the relief. I then took up my watch for an hour or two, and as there was \"nothing doing\" I went out for some fresh air. On looking in the Cook’s galley I was astonished to see the Sucani \"Smiling Morn\" asleep in front of the fire with an over coat on. Evidently Hades would be a home for him. Going down the engine room the heat was so great that one’s temples feel like bursting. The engineer on watch was sitting at his desk his head held between his hands. The speaking tube in communication with the bridge whistled & getting up he went to it. \"Give us another revolution\" came from above, & going to the controlling levers he increased the speed to the required amount. Huge cranks moved up & down with a clank, clank, clank, making an awful noise, yet this one man has complete control of the whole machinery that towered up to the skylights. A few grimy coolies emerged from the stoke hold covered in coal dust & with burnt hair, their beady\n\neyes flashing as they passed. \"Cassib (storeman) get me a lamp\" he called to one. \"Yes sahib\". (sarb) From the boilers there was a throbbing that, to one unused to it, made one’s head ache. It was too hot for me so I left. At 9.30 am the A13 crossed \"the line\" in thick misty rain. Various remarks were made referring to it, several \"feeling the bump\" Teddy of course must play a lark & put a fine hair across the lenses of Mathias’s field glasses so that he could \"see\" the equator. It was very amusing to see the soldiers shave one another in the hairdressing saloon which was simply an unoccupied horse stall with a few bags of chaff in it. On the wall was written \"We do not give matches to Bums.\" Great amusement was also caused by the soldiers having a bath, the water being turned off just as they are covered in soap. It was necessary to wipe it off in such cases & the disgust of the bather was very great. \n","40":" Unlucky 13 again. It may here to be mentioned that on 13th of October chicken pox broke out in Hobart on the A13. Thirteenth day in Hobart the Second officer & Teddy were blown out towards the \n\nheads. Thirteen white ship’s officers on the A13 & I was the 13th of the list. Today fire broke out on HMAT Karroo & some of her forage was badly damaged by fire & water. The Karroo & several Australian transports with the NZ transports were sent ahead to Colombo. \n","41":" A beautiful sunrise was the advent of a \"snorter\" of a day. The sun rose like a ball of polished brass & the rays almost burnt into one’s flesh. It was the most trying day so far. It was also probable that the convoy was in what is termed by wireless authorities a \"dead zone\" as the signals were so weak as to be practically unreadable. The horses also were very restive & plunged & stamped, thus adding to the difficulties. It was necessary to close the cabin door to shut out the noise. I was trying to sleep but it was impossible. Teddy struggled to hear the messages & the perspiration ran off his forehead in big drops. My pyjama coat was wringing wet with perspiration & sleep was out of the question. I relieved him for a while but it was impossible to decipher the signals. On the Orvieto the operator is situated on the bridge away from all disturbances but on the A13 we were in a cabin without any\n\nventilation or light as the ship’s dynamo is stopped during the day. Being on the same deck as the horses did not add to the chance of receiving weak signals. Engine room temperature 120 degrees. Deck 92° & cabins 87°. \n","42":" At 5.30 a.m. I went up on the bridge with a message. It was so cool that I stayed there chatting to the Chief Officer. I thought I could smell spices or curry powder & remarked about it, being informed that we were not far from Ceylon. A few seconds later I noticed Point de Galle lighthouse on the southern end of Ceylon. The Chief Officer’s vision must have been warped for he had been \"looking for this light for hours.\" As day broke the land became clearer. Seen through a telescope it appears as if shrouded in heavy mists. Numbers of dhows & catamarans were passed. They were fishing & one dhow had hooked a shark & was getting a lively time. Serang was looking at the island with longing eyes as it is near his home, so I ventured to ask ‘What place is that Serang\". The answer I got was indicative of his patriotic spirit. \"Killarney sahib\" was his reply. Special radio messages were sent\n\nregarding the instructions for anchoring in unison on arrival as all Colombo would be out to see the transports arrive. At two p.m. the convoy drew into Colombo & on a gun being fired on the Flagship the whole convoy anchored. At Colombo there are no wharves so we were required to anchor outside the breakwater.\n\nColombo\n\nColombo is a very pretty little town situated on the foreshores. There is no harbour, as the place is open to the sea. A breakwater however provides a shelter from the disastrous monsoons. Looking ashore, the appearance is very pretty. A long beach faces the sea, on the right of which stands a large red brick building owned by Lipton’s Tea Co, surrounded by grass lawns & tall palm trees. A railway runs through an avenue of palms & disappears in the distance. Rickshaws may be seen in scores on the roads that lead through well kept lawns. All the men wear white suits & white helmets as the heat is severe. The Government buildings are bright red & show with striking \n\ncontrast against the yellow & green foliage in the forests in the background. Away in the distance can be seen the blue hills, shrouded in mists. Many flags were flying from the buildings to mark the arrival of the convoy. A very large hotel near the beach is pure white & has several rows of bow windows. On the left is the Governor’s residence standing in a cleared space between the tall palms & the forest. It was here, to our utter disgust that Captain Von Müller of the Emden was banqueted by the authorities. Cingalees parade the streets in white \"nighties\" & a black \"gamp\" which makes a very comical picture. It is very hard to distinguish between male & female Cingalee but if one is working it is safe to assume that it is a female. The females carry baskets of coal to the railway trucks whilst the men sit down & smoke. Quaint old barges move slowly about the transports & \"bum-boats\" as usual are plentiful. Cingalees row out in their boats & for a trifling sum they do washing that is a credit to some done in our cities. Two Cingalees rowed out amongst the transports but were turned away. \n","43":" A radio\n\nwas sent to the A13 to proceed to the inner harbour for water. The captain & second officer were ashore so the Chief officer & the pilot navigated the A13 through the narrow gates in the breakwater. These pilots are British & live in luxury. They have a native to carry their small hand bag & they themselves are dressed in spotless uniforms of white & polished buttons. In the harbour (inner) which is simply a portion protected by three breakwaters, were the Japanese cruiser Ibuki, & the British cruiser Yarmouth. Outside, was the quaint old Russian cruiser Askold with her five tall thin funnels. The inner harbour was packed with transports & not very far away was the Anglo Egyptian who was just moving out towards the outside transports. Suddenly she dropped both anchors & went \"full astern\" but too late. With a crash she struck the breakwater near the gates, sending up a shower of spray. The tugboat Goliath immediately went to her assistance & towed her near the shore for fear she would settle down. The damage was practically speaking slight & she afterwards took up her position outside. In absolute silence H.M.A.S. Sydney steamed down the lines of transports & took up her berth. No cheering\n\nwas allowed on account of the wounded Germans on the Sydney. Two Cingalees then came out in a barge & dived for money, & never did they miss the coin. Sharks will not touch black races so they have no fear of them. Quaint old rowing boats were pulled about the inner harbour by perhaps eight Cingalees who sit, two in a seat. The helmsman chants a few words & they reply in a chant at the same time pulling on their oars, which look like the ace of spades on a propstick. They row rythmetically & it is quite a novel sight. For perseverance they would be hard to beat as one Cingalee was trying to row a barge of ashes by himself. For some minutes the barge would not move & it then gradually moved away & it was beyond his power to stop it then as it collided with a buoy. A water barge & a steam pump came alongside the A13 at dark & began to fill the ship’s tanks. Chippy the carpenter was given the job of looking after the operation. The soldiers were forbidden to go ashore but some slid down the hawsers & went ashore. Next day they were fined £1 each, as a roll-call was taken after dark.\n","44":" At two am I took my watch feeling \"up to putty\" as I had had\n\nvery little sleep on the way from Albany on account of the restive horses & the heat. However I amused myself as best I could to pass the time away. From 2 am till daylight seemed a week sometimes. Suddenly there was a hubbub & shouts of \"hey panea (parnee) wallah\" (water boy) from Chippy who had been asleep & had just awakened & found that the panea wallah had also gone to sleep & the pump had almost stopped. As no answer came Chippy dropped a great lump of wood on the roof where the water boys were asleep. The result was good for several of them came tearing out, one hitting his head on the doorway on the way out. Being disturbed so suddenly, they naturally gave vent to their feelings by using Cingalee language that I did not understand but Chippy evidently did for he replied in very strong words. By daylight the tanks were filled & the A13 took up her position with the first & second divisions. At 11 am these two divisions headed for Aden in charge of the cruiser Hampshire (British) or as he called himself \"Hants\". The third division & the N.Z. transports remained to take water as they were fast boats & could pick up. \n","45":" The heat is still stifling & during the afternoon a horse just outside the Marconi Room\n\n& down No 3 hatch began to kick most viciously. The Vet was called & tried to quieten the animal but it got worse & as he said its blood was overheated & it was temporarily mad. It kicked so much & reared about that it was necessary to remove other horses from nearby. The Vet injected some drug time & time again but it had no effect, the horse simply standing shivering with fear & wide open eyes kicking & snorting, until I almost gave up hope of sleeping, but towards midnight it quietened down. \n","46":" Another \nschor\n scorching day & a glassy sea. At 10 am there was a cry of Whoa! Whoa! & various other ejaculations from the Chief Officer on the bridge, & at the same time the A13 swung out of line owing to her steering gear failing. The Chief officer of course ran amok & yelled orders by the score. H.M.S. Hampshire however dropped back & came over asking if we needed assistance. In an hour we were on our way back to our position & from astern it was a magnificent sight as it was possible to see the whole convoy.\n","47":" A soldier met with an accident today being kicked by a horse which split his chin in two. He was placed in the hospital with another soldier whom we nicknamed oyster eyes on account of his large eyes. \n\nOyster eyes although unaware of it, was going to be returned as he was found to have consumption. About 9pm the third division was sighted astern & by midnight they were up in position. As they drew up, I was talking to the Chief Officer about the signalling by morse lamp at the same time reading one to him. He then chimed in after me echoing every letter as though he read it until I lead him astray & he owned up that he was \"not too good on it\". A coolie had been rather free with Roberts & asked him \"What’s time boy\". For an answer he got a dot on the snitch with a red paint brush that effectually closed his mouth. \n","48":" At two a.m. it was stifling with the heat which was increasing each day. I was sitting on the rail in my \"panjamas\" having some air & ready to duck if Captain Jackson should appear, as he often prowled around at any hour. About 4 a.m. I heard a kind of hissing & moaning. Looking ahead, I saw a Very’s light (white rocket) racing skywards. This was a prearranged signal to stand by the radio for urgent message. To show how watchful our signallers were, I had received & delivered the message before he woke up. It was the Euripides of the third division calling his division to stop their engines at once – two men overboard. As it\n\ndid not concern our division I waited & shortly afterwards the Orvieto called the first division to stop their engines immediately - & added operators not to leave instruments until further orders. Here was a problem – to send the message up to the bridge & to stay at the instruments. However I left them & called Captain Jackson giving him the message. I was astonished to see him with all his bed clothes on & a kind of coat over him, as if it were cold. \"Dammit what do they want to fall overboard at this time of the day for\" he asked. I could not explain, & left him to reason it out. As I took up the phones again I heard H.M.S. Hampshire calling the Orvieto & telling the flagship to lead the first division away. The tones were so sharp & precise that I thought the cruiser was about to \"blaze away\" at someone. The Orvieto thereupon repeated the direction to be taken but several of the sub-flagships \"jambed\" in & caused me to miss part of it. I was in a fix as we were liable to run the next transport down or be run down, & they all depended on my receiving the message. To add to my anxiety the Second Officer repeatedly called down the ventilator \"Anything doing\". \"Shut up\" I yelled back \"How can I hear with you yapping\". It was \n\nnot very polite but it served the purpose. Luckily the message was repeated & I got the position. Looking outside the door, the transports were rather out of line & the Hampshire & Ibuki had their searchlights on two transports. It was afterwards stated that the Ascanius had collided with the Shropshire & carried away a lifeboat & crumpled her bow somewhat but no men were lost as thought. I felt very shaky after this little item & felt very relieved when we were all on the way once more. The promptness in which the cruisers acted was wonderful & just showed that they were prepared for an emergency. On account of the Euripides constantly jambing it caused great anxiety & had not the cruisers taken the case in hand there may have been worse results. The battleships work their radios very quickly, not in regards actual speed but each message is sent at an even rate & there is no jambing consequently no need to repeat, & by this way they get through their messages smartly. They slip away at times & reappear just as quickly, issue orders, change the course & so on in a steady methodical way. The N.Z. convoys are fitted far better than the Australian. There is less red tape with them consequently more satisfactory results. They are all \n\npainted a dull slate grey & at night they are absolutely invisible as regards showing lights but the Australian transports are often like a liner with a regular blaze of lights showing. The N.Z. soldiers are well fed & the boats fully manned. The Australians – judging by the A13 & a few others there is room for great improvement. Of course one cannot expect as many comforts on board a transport as on a passenger boat, but there is no excuse for the following: About this time the soldiers began to complain of the tainted food so an enquiry was made with no results – only natural. However the Steward admitted to Teddy & I that when he heard that an inspection was to be made he had the meat \nwashed in Condy’s Fluid\n \"to kill ‘em\". The meat Teddy & I saw being put on H.M.A.S. Geelong in Hobart had an odor that would run rings around bi-sulphide of carbon. It was actually slimy. The substitute – bully beef – well a man would need a carding machine to masticate it with, & enough salt in it to make the men always thirsty. If pounded with a hatchet I believe it would have turned the edge off it & then\n\nresumed its normal shape. Another thing the NZ’s can show the Australian points on is the interest the flagship takes in the transports. Every morning the flagship of the NZ convoy would call all his convoy up & after wishing them \"Good morning\" (by radio) he would give the warnews & any other messages & replies that may be of interest. The Australian method ---------Cq (all stations) Orders for the day (given) War news will be sent during the afternoon. (too tired now?) The war news I would often get at 3am from a warship perhaps up at Bombay in India or else from Aden. An hour later another message would be sent cancelling the previous one & issuing another which often had to be altered again. I am not prejudiced against the flagship nor anyone in particular, but never-the-less the way orders were issued, was disgusting, also, on the flagship the \"heads\" (wooden I think) had a special room for this & another for that, & a special stall for so & so’s horse & something else for so & so. To cut a long story short there were enormous sums of money wasted in carrying out each officer’s particular desire, instead of giving them a good serviceable room\n\n& let that suffice. No! Lieut ------- must have green curtains, Major ------ wants two electric lights instead of one. Poor old operators want a \nloan\n of an electric fan – can’t get it, want a small section of sleep – can’t get it. \n","49":" At 7am the A13 swung out of line again & dropped astern owing to a mishap to the engines. H.M.S Hampshire also stayed with us to render assistance if necessary. As the NZ transports passed ahead, they could be seen firing at a trailing target thereby getting in rifle practice. It had been asked if the Australian transports could alternately drop back a little for rifle practice, but it was turned down – only natural too. Teddy was disgusted with the Australian methods. Pinto the cabin boy now took a little amusement by playing my \"stringatina\" when I was asleep & singing DO. RE. ME. So. So. until I threatened to break his thick skull & Teddy threatened to \"tap him on the boko\".\n","50":" About 8am H.M.S. Hampshire disappeared astern: to chase a steamer believed to be the Hawkes Bay, & returned later satisfied. At nine am there was the \n\nwelcome cry \"Land oh\". It was the island of Sokotra off the North east corner of Africa, near the Gulf of Aden. The island is inhabited by several thousand Arabs who are cannibals & live in caves. It is 70 miles long & 20 miles wide – like a huge lozenge. The surface is very rough & the mountains reach far above the clouds. The coast is extremely rough & precipitous & on account of there being no lighthouses it is necessary to keep a sharp look out for Sokotra, especially during the monsoons. It took all the afternoon to pass the island & in the water could be seen numerous sharks that had evidently been brought by the horses. Long pieces of red seaweed like sausage skins were floating about too. This seaweed is luminous at night & looks like large pieces of rhubarb.\n","51":" Being in the Gulf of Aden & also near that port, HMS Hampshire & the Orvieto left us & proceeded to Aden. The distress signal was to be used in case of being attacked & the cruiser would return. The soldiers by this time were beginning to get hungry so they were presented with a box of eggs. Snakes: when their hats were knocked off they all began to whistle. They were beauties & did not add to ones appetite. \n\nThe steward had been missing lots of little items lately. I saw the soldiers wrapping themselves around these delicacies in the early hours of the morning. Today the soldiers just helped themselves to the stores as usual only they were hospital stores & they would not have been touched had this been known. Anyhow the signaller posted on the bridge for our benefit (?) grabbed the most important of the stores – a bottle of brandy. He drank it all & must have excited his pugilistic desires for he donned a pair of boxing gloves & toddled up on the bridge to fight the Second Officer against whom he had a grudge. Luckily, for him, the Chief Officer had just relieved the Second officer so he was turned away without any fuss. He then went below deck & fell asleep in a corner. Colonel Hawley had occasion to call the signaller when a muster was called to see who pinched the stores. Buckling on his sword, & getting ready as we supposed for the battle, he was accompanied by several other officers, down to the signaller. Certainly there was a strong smell of liquor so Colonel Hawley tapped the signaller on the shoulder & as he woke up Colonel Hawley \n\nsaid \"Signaller\" \"Yess (hic) zir\" \"You are drunk\"!\n\nSignaller – \"Yezzur so (hic) am I.\"\n\nHe was proved guilty however & put into a cell. This little episode was the means of revealing a general plan to rob the cabins by a few of the soldiers who were known to have a shady character. They say forewarned is forearmed so anyone caught prowling round the cabins would be arrested & anyone caught inside a cabin may be shot. A coolie was also posted at the saloon door to keep watch. Ether was to have played the part as anaesthetic during the \"job\".\n","52":" At 4 am when the Chief Officer took his watch the Coolie had moved away from the saloon door as he began to Yell Calassey! & when he turned up he docked him one rupee as a caution. Today was the hottest day so far. The sea was like polished silver & there was no wind at all. At 4 pm we drew into single line & entered Aden. What cliffs there were. The land was awful, broken, & nothing but desert as far as the eye could see: The sea board was a mass of precipices such as are not seen in Australia. Away on top of these cliffs was a little building – the signal station – & it looked like a minature doll’s house. At the foot of the cliffs\n\nis Aden radio station which receives all cables from parts of Africa through Berbera radio in Somaliland. They are then cabled onwards from Aden as there are no cables at Berbera. Along the summit of these cliffs are quaint old forts that look like tiny sand castles, no bigger than a pea. Aden township is very small indeed. There are no wharves here as in Colombo also. The heat when anchored was worse than ever & the fumes & smells that came up the hatches was awful. The whole appearance of Aden & its surroundings is \"nature unadorned\" & is very impressive. Teddy & I were both feeling about done & thought we would be given a night’s rest – no fear of that while Captain Jackson was on board. By asking the other transports by means of the morse lamp on the bridge, whether they were keeping a watch they said no, that the sub-flagships were keeping one. Anyhow we had to whether or no.\n","53":" At two am I took my watch again & went outside as it was too warm inside. All the transports were moored in the harbour & at each hour there was a succession of different toned bells as they each struck the hour. At 7 am. the convoy moved out of Aden, great care being necessary in weighing anchor not to foul the submarine\n\ncables. H.I.J.M. Ibuki was left here with H.M.A.S. Melbourne & HMS Hampshire took charge of the convoy. A radio was sent shortly afterwards saying that H.I.J.M. Ibuki was off to South America. Farewells were exchanged by radio & away we steamed towards Suez – a five day’s run up the Red Sea. At 4 pm as we approached Hell’s Gates at the entrance to the red sea between Perim & the African side, special radios were sent & all ensigns, flags & lights were taken in & put out, as the country here belonged to Turkey. Perim is a small low lying island that looks like sun baked mud. Numbers of ships may be seen sunk here. This island is a coaling station & has the reputation of being able to supply coal, ice & Kola (drink) On the left side of Hell’s Gates is Abyssinia & Perim & Syria on the right. \n","54":" About 8 am the convoy passed the Twelve Apostle Islands (Turkish) & Jebul Tiere. Another scorcher Engine room temperature 136 degrees. Numbers of Indian transports were passed as they were returning to India for more troops. H.M.A.S. Geelong had recently been giving great trouble in not maintaining his position. At dusk every day the Geelong was in position but by daybreak the next morning the Geelong would be three miles behind.\n\nThis was so frequently done that HMS Hampshire threatened to take the Captain off & replace him with one of his own men. The trouble was over the stokers who refused to stoke the fires because beer was 2\/6 per bottle & cigarettes 6d \neach\n. \n\nThe Geelong was then taken out of the line & some stores were transferred from the Flagship.\n\nThat evening some excitement was caused by a soldier attempting to throttle a coolie. The coolies thereupon began to get excited & talked about Kill! Kill! & like words but it was smoothed over but a caution was given the soldiers not to interfere with them. So far there had been no certain orders as to the convoy’s destination but today a message contained the words – When we get to England. Teddy was delighted with the news as he had been eleven months out from England. \n","55":" About eleven a.m. a radio was sent from the flagship regarding orders sent from the Admiralty at Whitehall London, concerning our destination. Teddy pricked up his ears & sat up in his bunk as I read the message to him. When I got to the word Alexandria – Egypt his face fell at once, as he expected to hear Southampton. Poor Teddy, it put his appetite off. \n\nThe news was soon around the ship & the soldiers were all eager to get anywhere. The South Australians especially wanted to get on the desert. Frequent empty transports were passed as they thrashed their way back to India for more troops. \n","56":" Pass P&O mail steamer outwards bound. The sunrises in the Red sea are absolutely beyond my power to describe. They are supposed to be the second best anywhere in the world. Shortly before sunrise the clouds assume a dark violet colour which is rather lighter in colour towards the edges. As the dawn fades away the clouds gradually change colour & just before the sun rises they appear like great clouds of froth of a beautiful pink tint. The best view is obtained of the clouds over the horizon where the sun rises. As one watches them they gradually change from dark to light green thence to other colours & finally to a crimson shade almost like flames of fire. The sun then rises, & the colours fade away, but instead of the sun being dazzling, it is just like blood & can be seen hanging like a peach as it were. It stays like this perhaps for an hour & then warms up. At dusk it sinks as it were, into the sea, appearing the same blood colour, but the water is \n\njust like fire & the clouds are all tipped with flame colours. Often for two hours after the sun has set, the sea, which is without a ripple, is like polished copper. The shades of colours are too vivid to describe. Today was the hottest day of all the trip. The engine room registered 140 degrees & to venture down there was like walking into Hades. The fifth engineer cam up after his watch & the perspiration was running off his singlet & trousers which were wet through, & trickling away on the deck. Teddy & I both felt very tired & irritable, especially as the bum sergeant & others would stand outside the cabin door & practice signalling until we were sick of the sound & sight of the morse code. The second officer & the bum sergeant donned a pair of boxing gloves & had a few rounds. There was only one hit split into two parts – \"a tap on the boko\" & \"a job on the solar plexis\" & our friend the sergeant cam through the air like a hailstone, ending with a crash against the officer’s cabins. \n","57":" The weather now began to moderate as we entered the Gulf of Suez, which gradually narrows towards Suez itself. Cool breezes blew over the convoy & once more the awnings were removed from the hatches \n","58":" At four am we passed Mt Sinai of biblical interest on the starboard side, which was made the more beautiful by a glorious sunrise shortly afterwards, in which long shafts of golden light appeared to shoot out from the sun like searchlights. The Gulf was now so narrow as to be able to see land on either side. Egypt on the left & the Holy Land on the right. On the Egyptian side was all desert, desolate & barren excepting for an occasional signal station of white stone colour. On the other side was a more desolate land, as Teddy put it, \"If that’s the land of milk & honey\" then the bees & cows must have a rough time of it.\" The wind now increased to a stiff breeze & the sea began to rise, but the weather was just magnificent & made us all feel somewhat happier. At two pm we came to Suez which is a very small town indeed. It looked like a \"dead-end\" to me. \n\n(Sketch of Suez Bay)\n\n \n\nA warship was there as a guard & was sheltering in a little cove. All around as far as can be seen is huge sand cliffs & desert, miles & miles of sand. The canal is not visible from the position we are in but looking further inland the ships in the canal appear to be steaming through the desert. We were all very tired & looked forward to having a little rest, but no fear of that on the A13. The operators on the other transports were having a rest & we kept a watch for no purpose whatever. Scores of Bum-boats ply their wares consisting chiefly of Turkish cigarettes, post cards & curios. That night there was a cold blast that almost set us shivering. This is typical weather here. During the day the heat is fierce & at night there is almost a frost. \n","59":" At 10 am a fleet of ships was seen coming up astern with a huge warship. It was an Indian convoy being escorted by the French cruiser Dupleix. The convoy contained some beautiful ships of the \"Bibby\" line that trade to India. As soon as the convoy anchored, the Indians began their physical culture on the decks & through the glasses it could be seen what a magnificent lot of men they were. Not as some may imagine – a lot of dirty black soldiers. \n\nTheir complexion is bronze & their appearance in uniform is a credit to them. Great broad shoulders & knotted muscles that stand out like whip cord. Our own soldiers were delighted with them. The warship \"Dupleix\" was the most powerful I have ever seen in appearance. She had an enormous beam & short thick funnels, set so low that spark arresters were necessary to protect the decks. The men too were a magnificent lot. As Suez bay is not a very large place one can imagine what an impressive sight it was with all the transports. At three pm the A13 received orders to enter the canal. A very nice French pilot came out shortly after & the A13 set out for Port Said. The convoy was now broken up & each transport took its own way & was to call for help if necessary & a warship would always be nearby. As we passed Suez township which is very small a lot of little Egyptian children were coming out of school & were singing. Several Moorish women also stood on the bank of the canal which appears to wind up the main street. A curios sight was the fact that some Egyptian students were parading the street dressed up to \"dicky\" with canes, gloves, felt fur hats & cigarettes. An armed guard was now placed on each transport to reply to any hostile firing later \n\nas some 30,000 Dervishers were supposed to be about to attack the canal. Soldiers in their dark uniforms with red piping, their faces as black as night stood to attention in their sentry boxes as night stood to attention in their sentry boxes as the transports passed & were cheered by all the men. On the right bank is the awful desert as far as the eye can see, with an occasional Arab & his camel slowly plodding along through the thick sand. The Arabs & Egyptians dress alike & wear trousers of ample size the seat of which reaches to their ankles, a waistcoat & coat of the brightest colours, filthy dirty too & on their heads the Arabs generally wear a coloured handkerchief & a few stray beads etc. They are very much like the pirates we read of in boy’s books. The canal is just wide enough for two boats to pass – one being tied to the bank. In about an hour we were well out of the township & had the desert on either side. Shortly after leaving Suez we passed a French Steamer the Eugene Crocos who was tied to the bank to allow the transports a free way. There were several French ladies on board & as may be expected, they received a hearty cheer as we passed. Their reply was a perfect shower of kisses & such emotional exclamations as \"Good, brave\n\nAustralians\" They threw their handkerchiefs & flowers to the men & it is well that it only took a few seconds to pass as there was every possibility of them shedding their hats & boots & throwing them. I tried very hard to get a handkerchief but missed it. The old French Chef – as fat as an alderman – stood in the galley doorway & threw kisses, picking them off his lips (\nlike\n) with little jerks. At 6 pm, we drew into Great Bitter lake & as we had no searchlight we dropped anchor till morning. On navigating the Suez canal it is necessary for a steamer to have a searchlight, which is picked up at either Suez or Port Said before entering the canal. The searchlight is fixed in the bow of the steamer & throws a diverging beam of light that lights up either bank & thereby aids navigation. The canal has an average depth of 30 feet & at night it is very pretty steaming through. One side is lit at intervals with red lights & green on the other, both being in the water & mark the limit for vessels to approach the banks. On the left side for a time after leaving Suez is a long stretch of thick undergrowth with trees that are reflected in the glassy surface of the canal. Steamers cannot steam at full speed through the canal as their screws stir up the bottom so it is necessary to go half speed & then stop until the \n\nmomentum needs another \"kick\". Great Bitter lake is about 20 miles from Suez & the canal runs through it. It was a glorious moonlight night & the other transports with searchlights could be seen slowly steaming as it seemed through the desert, showing a great shaft of dazzling light. I was feeling about \"done\" for want of sleep & the excitement I think bore me up somewhat. Tiny canal boats kept watch over the canal all night. They are beautiful little gunboats, perfect in proportions & as an idea as to their dimensions it may be noted that the funnel is about 10 feet high & their beam is about 12 feet. They can travel about 36 knots & have a very shallow draught, suitable for the smooth waters of the canal but too small to venture into rough seas. \n","60":" At two a.m. we were alone it seemed in the desert. The stillness was intense & the bright moon was reflected in the water as in a mirror. Three am there was a clang-clang, clang-clang,-clang-clang, as the sucani struck the hour. How desolate it looked, the awful solitude of the vast desert almost playing on one’s nerves. The soldiers were all asleep on the foredeck, their faces easily discernible in the moonlight. Looking aft from here there was only one person awake it appeared & that was the sucani who dozed on the \n\nbridge. The pilot lay asleep on the saloon settee & the Second officer was fast asleep in his clothes on his settee. How I envied them, not that they got more than I, although they certainly had more time, but I was at the stage of \"passed sleep\" & felt physically tired & yet my head was working away quite easily. I longed to crawl into my bunk in the quietness & have an hour or two. No watch was necessary, but it was only Captain Jackson’s cussedness that kept us up. Daybreak was the most magnificent I have ever seen. On one side the moon was setting as it seemed into the lake & gave the lake & shore a decidedly green colour & on the opposite side the sun was giving the clouds a pink tinge & the desert seemed shrouded in a crimson mist caused by the reflections of the sun’s rays over the desert. Gradually the green disappeared & gave way to the rising sun which rose like a huge transparent red ball. All the beautiful paintings & pictures in Art Galleries cannot compare with the soft colours of these sunrises & sunsets which change from one colour to another & are so soft in hues in tints as to be totally different from the usual Australian sunrises & sunsets which are generally a blaze of dazzling light. At 6am the A13 weighed anchor & \n\nentered the canal again. On passing through the Bitter Lakes there were several Egyptians shooting ducks with antiquated shot guns & each time a gun went off, the soldiers would jump, thinking it was being fired at the transport. On the left bank of the canal are signal stations at about 5 mile intervals & these stations pass word to steamers on the advice of another steamer passing. On the right bank were garrisons of English & Indian troops, quite close enough to speak to. The Indian troops would signal messages to the transports by means of flags & their sending was perfect & a pleasure to read. As we came to a deep cutting where the banks rise somewhat higher than the steamer, we could see the machine guns trained on the canal, field guns, sand bag forts, & barbed wire entanglements at the rear to prevent an attack from that quarter. The Indian sentries stood like carven stone, their hands folded over the muzzle of their rifle & their dark eyes looking straight to the front. A fine lot of men indeed but very ferocious looking. Then the English Tommies with their \"broad\" speaking, all quite happy & with smiling faces. It was very comforting to know that they were not enemies. The Indian troops’ English officers are easily picked out by their \n\nupright carriage & sharp words. On the left bank were Egyptian boys employed with camels in widening the canal. They wear a kind of nightgown & a fez cap. They sometimes have donkeys drawing trucks of sand over temporary rails & in this proceedure they do not spare the donkey but belabour it with great waddies of wood. The camels have boxes (two) on his back & kneels down until they are filled. It is then led away & emptied. Numerous dredges are employed in keeping the correct depth, manned by Frenchmen. The dredges are wonderful & are kept beautifully clean. A long pipe arm reaches over the bank of the canal to well back from the bank. The deposit is then pumped through this large tube to the rear. Numbers of Egyptian boys threw themselves down the canal banks yelling all kinds of fury against Germans & exclamations of -S\"Good English\". It was nice to know that even here there were friends. As the transports pass through the canal, a small tidal wave precedes each steamer owing to the displacement of water. At one pm word was received from a signal station to tie up to the bank to allow a French cruiser to pass. The last thirty miles of the Suez canal is in a \"dead\" straight line & from the transport it appears like a long path. Slowly the French cruiser the Desaix drew nearer. Our \n\nmen were drawn up on the boat deck & stood to attention. When passing, which the cruiser did very slowly so as not to draw us into the bank, we dipped our ensign as a mark of respect & she returned the salute by slowly lowering her huge ensign (French) & hoisting it again. At the same time our soldiers came to Present Arms & the French sailors stood to attention the length of the ship. The Admiral was on the bridge, and was in full dress uniform with medals & gold braid galore. He was an elderly man with snow white hair & clear features. Cheers & hearty ones, then broke out from both vessels, & the cruiser gradually drew astern. As she passed the men could be seen asleep near the guns & the cleanliness of the cruiser was magnificent. Every piece of brass & copper shone with a brilliant lustre & the decks were as white as milk. As the distance widened, a bugle on the cruiser sounded some unfamiliar call evidently French & our bugler replied with \"Reveille\", but why this mournful call nobody knows. It was a stirring sight & will never be forgotten by those who saw it. As Port Said is approached it is possible to see the Suez Express train which runs quite close to the bank on the left side. It winds itself through the thick undergrowth near the canal \n\nat this particular spot. In appearance it seems smaller by far than NSW railways, but for speed it could run rings round NSW. At 2 pm we drew into Port Said at the Mediterranean end of the Suez Canal. The first noticeable feature is the great number of steamers in the small harbour. Warships & aeroplanes were here in plenty. HMS. Swiftsure, one of England’s large warships was here & maintained control. Small torpedo boats, cruisers, destroyers, submarines & other craft were here & there. Two huge French cruisers were anchored not very far off. Port Said Radio (S.U.B.) was only a quarter of a mile away & when this station was transmitting, it was possible to read the message by listening to the sparks crackling across the condenser protective gaps, which shows the power being radiated. As the strength threatened to burn out the phones it was necessary to earth the ariel. Two large French aeroplanes were throbbing violently on the quay. The way the small war craft keep in touch with headquarters may be interesting. Each of the cruisers & other vessels have a particular call signal for this purpose. Take one (name not known) who’s call was G9. This vessel also has a certain time, say seven minutes past the hour & seven minutes past the half hour. At this time \npunctually\n this cruiser will call G.9. – nothing more. The operator on the \n\nwarship in charge knows the time & call of each cruiser & as each one gives its call on the given time it is known that all is well. Should a vessel fail to report on time there is a search made immediately. Captain Jackson went ashore & arranged for coal, but in the meantime two barges were alongside & were coaling. A message was also sent saying that the A13 was not to be coaled so the Chief Officer ran yelling Whoa! Whoa! Stop! Stop! & so on until the whole transport was in an uproar. Things were put right later & the work of coaling began again. The Egyptians place two long beams of wood up against the transports from the coal barges. One plank is used for the upward journey & the other for the return. The coal is carried in small baskets & is tipped down the hatches, the method being very tedious & slow but with the numbers employed it is remarkable the amount of work done in a few hours. During this operation however the Egyptians set up a continuous howl & yell that is deafening & strange to say, the more noise they make the faster they work. Operations are also carried out by oil lamps & with the awful noise & being tired as I was I was forced to try & get away from it all as my nerves were so far gone that I felt I could cry, big as I was. Teddy was very drawn & had dark rings under his eyes & we each knew \n\nthat things were getting too strong. We were both strung up & began to realise that if things continued much longer we would either break down or perhaps make an error that may lead to disaster. So far we had succeeded in avoiding errors, but now, in our present state it may occur easily. Relief came at last. HMS. Swiftsure said \"Transport operators need not keep a watch tonight as I am keeping a continual watch.\" We were delighted with the news but imagine our thoughts when Captain Jackson refused us & said, \"Better keep one in case of accident\". I leave the question of the sense of this & also his thoughtfulness of us to the reader. We were disgusted, but swore to be even with him by not receiving war news & in not telling him all the news of interest we were capable of. We had now been 52 days out from Hobart & out of mere consideration may have been given a rest – no fear of that on the A13. An error on our part & possibly hundreds of lives may be lost. I do not wish to overestimate an operator’s position but the reader can form his or her own opinion, on this matter. Teddy was very concerned about the Second Steward who abhorred water. He had not had a bath, to our knowledge, since we left Sydney & as Teddy put it he \"whooped through this boots\" an expression that certainly conveys his state to the reader. He was rather deaf so it was safe to talk without him hearing. He had a way of \n\nheaping his plate with fish, meat, & pudding in several heaps on the one plate. As one course was finished a slight turn of 60 degrees & the next course is ready to be attacked. Harbour traffic in Port Said is extremely heavy & it is well worth watching the natives handle their boats. They run great risks though one boat getting within a few feet of a transport’s propeller which began to revolve & almost cut them to pieces. The A 13’s propeller by the way weighs 4 tons. They managed to evade the screw however at the same time yelling like maniacs. In Port Said it is safe to call any Egyptian Hassan or Abdhul as they are nearly all these names. Teddy invited Hassan to cut his hair after he (Teddy) had ascertained his qualifications. As they seemed good Teddy gave the word to \"Let her go\" Snakes & didn’t Hassan go it. He had a number of soldiers waiting & at 6 a time he was making his fortune. He simply grabbed it in one hand & lopped it off with a pair of scissors that had been used on cutting sheet iron. Teddy spat it out of his mouth & groaned as the scissors got stuck & tore the hair out. In a few minutes Hassan had finished & began blowing the hair off Teddy’s head, until Teddy had to tell him to \"mahanna jow\". A few Egyptian conjourers gave displays in their rowing boats \n\nas they came alongside & considering their limited space it was very well executed. The soldiers of course bought \"appeels\" \"orangess\" & \"Turkish delart\" from the bumboat man. It is very funny to hear the bartering. A bumboat comes alongside with his wares, generally fruit, postcards, cigarettes, & clothes (& if one whispers \"whisky\" he can generally find a bottle under a seat). Well the bumboat man throws a rope up on deck with a basket attached & if one wants to buy an article it is necessary to ask \"How much so & so?\" \"Two sheeling\" comes the answer \"Too dear Abdhul\" \"One seex\" back again from Abdhul \"No! only ninepence Abdhul\" & the latter will reply \"No, No sar\". Pretend to go away & Addhul quickly shouts \"All right, send money down\" (no tick from them) \"Cost me three sheeling, but me good man\" so forth & so on. The soldiers had a much more effective way, as follows:- \"How much oranges\" – \"Two sheeling dozen\" – \"Send one up & let me taste it.\" The bait takes & one is sent up for a sample. As soon as the bumboat comes alongside & is under the soldiers, two of the latter hold a beam of wood over the bumboat & threaten to drop it on top of the bumboat if they try to get away, or if they don’t pass them up at say sixpence a doz. It works admirably & when finished buying, the bumboat man generally gets a bucket of water emptied over him as a \n\nparting shot. The Egyptians are very coarse in appearance & in manner and are most ignorant, except in the arts of deceiving & thieving. This only applies to a certain class of the race, as there are some very well educated Egyptians. I was walking past old Chippy’s cabin when I heard a volley of language, so I went to see what the trouble was over & found Hassan the barber whilst flourishing a razor about had cut Chippy’s finger & Chippy was calling him rather bad names. Hassan’s only reply was \"All right soon – not deep\" but Chippy thought otherwise. A fine building is the Suez Canal Buildings which has two domes inlaid with mosaic. At 11pm the coaling operations had been completed & silence once again reigned. I had a little sleep up till 2 am","61":" when I again took my watch. The harbour was full of transports & at each hour there was a medley of bells, some deep & some cracked. HMS Swiftsure could only be placed by her searchlight which was kept on the canal. The town was in darkness & the only sign of life was a stray call of \"Abdhul\" followed by a string of Hindustani. About 4 a.m. H.M.A.T. Karroo shifted her berth & in the operation a barge almost got destroyed through coming too near her screw. \n\nAt 7am the A13 was ordered to anchor 3 miles out of the harbour. As we slowly passed the remaining transports cheer after cheer went up from both sides. The A13 was accompanied by one of the tiny canal boats which, when we anchored, kept a watch over us. During the morning a message was sent to all transports as follows:- \n\n\"A torpedo boat will visit the transports & assistant operators will be transferred to HMS Swiftsure & thence to HMAT Karroo & will be returned to Sydney.\" In a way I was pleased but yet very dissappointed. However, Captain Jackson immediately communicated with the Flagship & said that I was not a naval rating & that I was a member of the ship’s crew. On this, I was ordered to remain. As evening fell, the little torpedo boats kept in close for fear of submarines as we were now in the Mediterranean.\n","62":" At 6pm the A13, under cover of night, weighed anchor & headed for Alexandria on the mouth of the river Nile. Again the Swiftsure gave permission for the operators to have a rest but Captain Jackson – \"There may be some German warships about.\" Supposing so – could we get away? could we fight them when there were \n\nonly three rifles & a few revolvers on board. We were absolutely disgusted & for some time Captain Jackson’s ears must have burned. The Chief Officer came into the cabin for a smoke after dinner & he offered to call us should captain Jackson prowl around, but in view of the risks we kept watch. To see \"how it would work\", every morning when Captain Jackson would ask \"any news\" the answer would be \"Not a sound all night as the warships are coding all messages\". It never had any effect, beyond showing that \"someone\" on board felt rather uneasy about Germans. Of course the Chief Officer would occasionally see strange sights – through not using enough water in his cough mixture – & would enlarge on them, until he swore he saw a submarine & naturally everyone \"Kidded him on\" & then laughed at him. \n","63":" At 5 am the soldiers were preparing to disembark & at 9 am the coast line could be seen on the horizon. As we drew near Alexandria, a boat put off with a pilot & met us. The pilot boat, as usual, worked past the A 13 & came up astern & almost got chopped \n\n \n\nup by the A13’s propeller. A gangway was lowered & the pilot boarded. He wore a long frock tailed coat, grey trousers & a fez cap. The other pilots in the boat all sat like Hindus with their legs crossed & arms folded. When the pilot took charge, the A13 drew slowly into the harbour. Occasionally here was a sound of \"Dammit\" which was Captain’s mild expression of annoyance. His full blown outburst of language was unprintable. \n\nAlexandria is practically open to the sea, & has a number of breakwaters to protect the harbour. \n\n(Sketch of Alexandria harbour)\n\nThe harbour was full of boats including twenty six German prize steamers all heavily laden. The N.Z. transports were unloading & had occupied all the available wharf space so we were forced to remain at anchor some three miles from the town. During the afternoon Captain Jackson sent word that as there was no flagship in the harbour we need not keep a watch. Snakes! you should see the way we got to bed, clothes & all after making Pinto the cabin boy bring refreshments & gave him strict instructions not to dare & open the door. The weather was ideal & we slept until well after dinner when we got dressed & went ashore in a bum-boat. I will now try & describe our visit to Alexandria. The trip ashore was novel. The boat was just an ordinary rowing boat, somewhat larger & stronger with a single mast & a leg of mutton sail. The Arab rowed all the way & the second officer steered. The Captain had previously \"coughed up two of the brightest\" all round & told us not to get into mischief. The first thing I noticed was the few lights in the streets, the awful hovels, & the vile smells. The streets were almost all cobblestones & were full of puddles of \n\nwater. The smell was awful & reminded one of bi-sulphide of carbon – which is perfume compared to the back streets of Alexandria. We met a few Gendarmes in the street & after enquiring for Rue de Gameli were put on the track for the main street. On entering this main street the surroundings were much better. The Second officer, & several others went one way & Teddy, Roberts & myself went further into the town. I admit I was all eyes & rather excited. Such strange sights – In a grocer’s shop were several of the Arabs squatting on the floor smoking. The curios & peculiar dress of the inhabitants all kept my mind filled. Music there was plenty of some very good & some awful. As we neared the centre of the town the noise & hubbub increased & with the quaint eastern scents & the incense & other queer attractions I felt almost carried away. Electric trams tear along the street at a pace that puts Sydney trams out of sight, the driver jumping on the bell & making the people scatter in all directions. The trams have two cars – the front one for Europeans & the rear for natives. As the town is almost inhabited by natives the rear car was always full. Should an Arab dare & enter the European’s car \n\nhe was immediately hauled out. The Arabs wear long trousers as before stated & the Egyptians wear a nightgown affair & the men are often bare footed. Dainty little French girls in the shops were all on for a lark with the newcomers & were continually cracking jokes, & smiling in a fascinating way. Their peculiar walk, with their neat dress & hair \"upholstered\" in the latest fashion & their lovely pink fingers were enough to entice anyone. As this city is the most notorious city in the world we had to be very careful, especially so not to be lured to the native quarters as this often ends with fatal results. I had a \"squirt\" in my hip pocket & Teddy had a French dagger. I was awakened from my dream as it were by someone clutching my coat & turning round I saw an awful sight. By appearances, a young girl of perhaps twenty, a dreadful deformity with a baby in her arms begging for money. The poor thing turned up two eyes that had a cataract on them & the expression was pitiful. Teddy gave her some & she hobbled away. I can see her now at times & it was the most pitiful sight I ever saw. As soon as Teddy produced \n\nmoney to give her we were besieged from all sides by a horde of nightgowned spectres fighting to get near us & yelling Sair! Sair! & putting out a fist for \"the dibbs\". They were soon scattered by a policeman. I then fastened my eyes on a rather handsome Egyptian young woman who wore a bamboo affair with three brass rings down her nose & her face was covered from her eyes down. A vicious prod in the region of my refreshment room brought me to my senses as Teddy cautioned me to \"eyes off\". It is very silly to admire the married girls in Egypt as a faithful husband will not hesitate to put the damper on intruding affections by means of a knife. After that lesson I resorted to my old ways & kept them away – well away. Arabs & Bedouins do not value a human life any more than we do a fly’s life, so to ask for trouble is very unwise. Suddenly an Arab boy appeared as if from out of the ground – like Sydney tram troubes in an accident – & said for \"Seexpence\" he would take us to the pictures & a concert. \"Let her go then\" & he walked well ahead & we kept him in sight, following him through street after street until he took us to a low flat roofed building. On \"coughing up 9d each\" we were \n\nushered into the hall & immediately saw our mistake, but it was too late. The only other whites in the building were two officers off the troopship Ascanius, so we moved over & sat behind them in case of trouble we would be together. They were anxious to get out too so we arranged to get up shortly & leave. Suddenly the musicians opened up the chorus on stringatinas & mandolins & the whole audience began to chant to it. The noise was awful & the vicious looks on their faces made me feel very uncomfortable & to add to my discomfit I found that the Arab boy who led us here was seated behind us & would not budge. Coffee was brought on a tray – very small cups – & with a glass of water which cost 1\/- a cup &, as we believed, it was drugged so we left it. An Arab had evidently misbehaved himself for two Egyptians held the doors open & a Gendarme with fierce eyes & a thick moustache grabbed him by the scruff of the neck & the seat of his trousers & literally threw him out & down the steps into the street. The Arab boy behind us still pestered us to have a \"hubble-bubble\" (a pipe much the same as an Indian Hookah)\n\nbut we declined with thanks & got up quietly & left, as there was every possibility of a brawl. Our friend the Arab boy still pursued us in his nightie but he flew for his life when Teddy threatened to break his head – if he could. On the return to the A13 we saw some brawls in the hotels & several Australian soldiers \"outed\" for the time, & arrived on board at 1 am. \n","64":" We stayed on board all day & slept. At about 5 pm Captain Jackson called for me & told me that I was to return to Australia on H.M.A.T. Star of Victoria. As before, I was pleased & yet sorry to leave as Teddy was a jolly kind fellow & we got on very well together, but it was useless to protest so I packed up ready to leave. \n","65":" After breakfast Captain Jackson sent work to me to go to the chart room & arrange about leaving. This was all arranged & we (Captain & I) were just leaving for the Consul’s office to sign off when a Naval officer came aboard to see Captain Jackson. That was my fate. In a few minutes I was called to the Captain’s room & entered. The room was full of smoke from cigars & a smell of \"fire water\". The Naval officer rose & began \"Er-er- I believe you are to return to Australia by H.M.A.T. Star of Victoria & er-er\n\n\"there is not much room on her & er-er- as Cap(hic)tain Jackson says, I think you may (hic) remain. Thank you that will do & Captain Jackson just winked the tiniest little wink – he won & he knew it. Teddy was very pleased & even helped me unpack. I said many nasty things as this was the third time I had packed up & had to unpack again. Packing is a woman’s work. A man cannot \"get ’em all in\", but by Teddy’s & my strength we managed it. To celebrate the event, Teddy Second Officer, Electrician, & self went ashore. At 2 am","66":" we started for home in a garry (pronounced garee) & by an officious guide who called himself Gallagher we found ourselves miles from \"home\". At 4.00 am we found a boat & were rowed outside the breakwater, as the wind & rain were rather too strong to beat against, & then beat back into the harbour. As all the transports were in darkness we could not find the A 3 until about 4.30 am, when, wet through & stone cold we boarded & crawled into our bunks. At eleven am a pilot took us into a wharf & the horses were disembarked. They were very frisky & broke away\n\nat times, but for all that they were very weak & could not be ridden for quite a month. The Arabs were a continual nuisance & several times the policeman had to hunt them away. I went for a run up Alexandria in a garry with some letters & had a prowl round the town. One incident I forgot to mention is that while anchored at Alexandria in the harbour an Egyptian custom’s launch came alongside & at twelve noon the crew, one by one knelt on the deck & prayed, their faces towards Mecca according to the Mahommedan religion. Time & time again they bowed & scraped until their foreheads touched the deck & no doubt to the majority of us it was a peculiar sight, but no one interfered with them in their prayers. \n","67":" There was another farewell just before night as the soldiers off the A13 came & said goodbye. O’Reilly, Mathias, Scotty & others all turned up & we assured them that they had our best wishes & that we would return to Australia for more men. They parted with every confidence of success & we all hope they get it (success I mean). More trouble for the Saloon cook – a native from Colombo where we engaged him – absconded & left us without one. So far I had only received one short letter from home whilst in Port Said – a postcard. \n\nTeddy had not had any for some months & was very dissappointed. \n\n13th December At three p.m. Roberts who was very unsatisfied with his position on board, & who had been planning to \"skin out\", quietly packed up his duds & left. At 4 pm the Captain missed him & a search was made. Naturally we knew nothing whatever. As he could not be found, the Consul was notified & at 4.30 pm the A13 drew out from the wharf & turned towards Port Said again. When past the danger zone, the pilot was taken off & we streamed away to Port Said. \n\nFinis of \n\nForward \n\nTrip\n\nThe Return \n\nto \n\nAustralia for more \n\nTroops \n\nLeaving Egypt on","68":"\n\nCalling at \nPort Said\n\nSuez\n,\n\nAden\n,\n\nFremantle\n,\n\nMelbourne\n.\n\n13th December A gentle breeze was blowing as we turned from Alexandria & I felt so happy that we were returning. The A 13 was in very light trim & was vibrating badly as her propeller was half out of the water. Our watches began once more & Captain Jackson asked that we keep a sharp watch etc, etc, in case of Germans. \n","69":" At 8 am the A 13 drew near Port Said & waited for a pilot but as none came we entered on our own. A long breakwater extends out from Port Said & in the centre of this breakwater is a large bronze statue of De Lesseps – the French engineer who constructed the Suez Canal. Our berth was in the usual place for the mail steamers. As soon as breakfast was over we sauntered out to have a look around. The ship was fairly clean now & the coolies were putting the finishing touches. Fratelli – the famous mandoline expert came on board & tried to sell them but we were \"dry\". He played Il Trovatore on a mandoline beautifully & that was enough to make anyone buy an instrument but, as I said, we were \"dry\". Ostrich feather men then boarded & gave us a fine time pestering us to buy. \"Ah! do sair, I have a wife & family & cannot pay the rent, & other \n\nwoful tales that would not take. One was a cross between an Egyptian & a Jew. His \"conk\" betrayed the \"Yid\" in him. He wanted me to buy a boa for £2\/10\/- but it was more like a long bottle brush than a boa. Another Egyptian with a \"snout\" like a plum duff produced some feathers & a fan which I beat him down from 15\/- to 10\/6 for two feathers & two fans – his original price being feathers 15\/- each, fans","70":" each. That was the best bargain I ever made, but it cost several hours wrangling. Water was pumped into the A 13’s tanks & at 4 pm the pilot flag was hoisted. Shortly afterwards, an old pilot boarded & away we steamed. A searchlight had been provided & as we entered the canal it was lighted. I was very interested in the generator for this light, it being a French pattern with a long, thin, but very massive commutator that delivers 70 amps at 100 volts to the light. An Arab boatman is also taken through in case it be necessary to tie up at any time. This man caused great trouble by pestering everyone to buy \"Turkish delart\", - good stuff only made with the feet. I intended to state that the searchlight generator is driven by turbine coupled to a steam pipe & revolves at a very high speed. The land on either side of the Canal had \n\nbeen flooded to prevent the enemy from reaching the Canal. As the sun set, it turned this water into a colour like molten metal, the most beautiful tint imaginable & all the A13 seemed to be bathed in golden light. This lasted for two hours after sunset but with it came a perfect plague of mosquitos that were very small but sting – why they were on a par with rattlesnakes & death adders. Teddy & I sought refuge in front of the Second officer’s electric fan, as the little devils could not hang on in the wind. It was very pretty sailing through the canal, the searchlight showing off either bank. The same garrisons of troops were passed & the sentries could be seen walking up & down the summit of the bank as they kept guard over the soldiers sleeping. What an insight it was. War, in its grim reality, not camp time when sentries may be bribed with a bottle of \"fiz\". Failure to answer the sentry satisfactorily meant death. Failure to obey a warship & that also meant a warning shell & anything further of course was a hole that could not be darned. Yes! Orders were to be obeyed now & no evading them either. No two chances, no arguing, just to be obeyed. \n\nSuez was reached at 6.30 am & the pilot & searchlight were taken off. A half an hour was spent waiting for letters & possibly Roberts but as neither appeared, the engine room telegraph rang \"Full ahead\" & gradually Suez – the place that fascinated me because of its rugged situation – gradually faded out of sight. HMAT Saldanha was ahead of us & H.M.A.T. Hymettus followed in our rear. Photography on board was a great trial. When everything was ready there was a pillow stuffed up the little ventilator & towels etc hung over the port-hole. When the A 13 lurched it meant hypo over everything & when Teddy did any developing it was a perfect mess of liquids & ejaculations of \"Isn’t it a bonzer\"? \"Yes! What is it?\" Venus of Milo in a snowstorm\" \"Psyche in the bathtub\" etc etc. Teddy was a good photographer – yes a bonzer.\n","71":" The weather was becoming warm again & we did not look forward to it either. The A 13 was being painted from stem to stern & was clean & tidy once again. I missed the soldiers now & time seemed to hang more heavily than when they were on board. The","72":" Engineer broke out in a rash & was placed in the isolation hospital for fear he had infectious sickness. The only chance he got to \n\nroam about was during the small hours of the morning & at about three am he would appear at the door of our cabin clad in a singlet & white trousers & would sit down on the step & yarn away until daylight when he would creep back to the hospital. He was Scotch & was always praising the Heilanders. Several others of the white crew were Scotch & Teddy & I used to visit their mess room & listen to their tales & such beauties they were. The Chief Steward was in bed with a touch of fever & was very bad. He was English & when he began to spout it was time to knock off as he would yap – yap – yap & drown everybody else. His great fear was Germans. I would lie in my bunk, hidden by the curtains & when he began to prattle on about the possibilities of striking a mine & other comforting things to expect I would draw Teddy’s attention & try & make him laugh. Chieffy Steward as Pinto called him would often allow his voice to get away & disturb me in my endeavour to sleep. I generally squirmed around a little & grunted & he would then keep quiet for a second until I snored. Then he would begin once more but before he had got a full head of piffle going I would yell out like fury & he would skedaddle out of the cabin\n\nfor his very life. His talk & the Chief Officer’s ideas were enough to drive anybody mad. The temperature today was 88deg in the cabin. During the afternoon a line of ships could be just discerned with the telescope away on the port bow. It was an Indian Convoy of twelve ships bound for Suez. That evening cool breezes sprang up & the barometer began to fall. \n","73":" At two am Teddy woke me with the news that we were \"in it\" once more. I wondered what he meant but as soon as I felt the rolling, I knew & felt quite happy over it – to Teddy’s disgust. He had a novel way of waking me. He would get into his pyjamas & then into his bunk & would lean out & whisper Hey! Hey! \"You dopey son of a gun\" & so forth. I generally waited until he leaned a little further over & would then make a sudden grab at him & would either land him on the floor or else frighten seven devils out of him. His one trouble was \"SSh - - SSh - - you’ll wake the old man.\" One night I took half his bunk boards out & hid them, carefully spreading the mattress over the gap, expecting to see him go through into my bunk. He did too – legs in the air gentleman style - - but unfortunately I was too slow in getting out of my bunk with the consequence \n\nthat he fell on top of me. As day broke the sea rose & the wind was a fairly stiff breeze. Teddy had been frequently waking owing to the monotonous tick – tick of a loose article somewhere that rolled about. Neither of us could find what it was & Teddy could not get to sleep owing to it. All day long the sea thumped into the A 13 & sent spray over her bridge. That evening I was in the bow of the A 13 getting the lovely cool air before retuning to roost when I saw long luminous snakes I thought, preceding the A 13, crossing & re-crossing one another in front of her forefoot. I watched them for a time & then went for Teddy but on my return they had gone – of course I was not sober according to the others but I was told that they were probably porpoise. \n","74":" far wireless messages had been very few & far between but at 3 am I heard Q.T.S calling a warship & knew that the Empress of Russia was not far away. At 7 am we passed the Twelve Apostle Islands which were shrouded in the misty haze although on Jebel Tiere – the largest of them could be seen the lighthouse of white stone away on its summit but as this belongs to Turkey it was in darkness. The islands are almost rocks & can hardly be termed islands. Half an hour later Q.T.S \n\nseemed to be very powerful so I walked out to have a look round. At the same time the engine room telegraph rang to stop as the Empress of Russia – an armed merchantman – signalled to heave to. A flag signal was then sent to the A 13 but owing to Captain Jackson ramping & swearing, the Chief Officer could not read it. Over went the code signal book & then the pencil as Captain Jackson roared out \"What the ! ? ! does he say.\" At last the message was received – Keep fifty miles north of Sokotra owing to supposed enemy’s cruiser\". That was the talk for some days after. Gradually the A 13 drew away as the Empress of Russia seemed to fade into the mist like a spectre that had emerged from practically nowhere, warned us & then disappeared again. The heavy sea was now hindering us & speed was down to 7½ knots. \n","75":" At 12.30 a.m. The A 13 passed through Hell’s Gates & passed Perim. At 10.30 a.m. preparations were being made to enter Aden. Chippy was brought to the fore again & rendered me an account of his life on the sea whilst waiting. What dreadful, barren, waste land it was as we drew into Aden in a smooth pale blue sea & a beautiful clear sky. Porpoise followed ahead & gambolled in the water as \n\nthe A 13 almost ran them down – but not quite as a little speed extra & they were safe. Porpoise are most interesting fish to watch. They are often of enormous size & frequent warm waters in preference. They belong to the few fish who’s tails are parallel to the surface of the water. To watch them swim is fascinating as they can travel faster than any known fish & every few seconds they give a peculiar gasp as they jump clean out of the water & dive again. They do not seem to move their fins at all as they race along, under & over one another, but always too fast to be overtaken. They keep well to the surface as rule & can be easily seen, & although several dozen may be in a school, never do they collide with one another because of their quickness. As we drew near to the great cliffs & gaunt rocks that shield Aden, a little pilot boat put out to a steamer waiting to enter. The A 13 therefore stopped her engines & just glided along by her own momentum. The signal \"Have you anything for me\" was hoisted & the pilot answered \"no\", so after receiving further instructions from a miliary officer on board to keep 100 miles north of Sokotra we drew away from another of the fascinating lands of desert & rugged cliffs bound for Fremantle. \n\nThe very possibilities of danger appealed to Teddy & I & although no doubt a very undesirable thought in itself. All lights were therefore shaded & Captain Jackson, the Chief Officer & the Chief Steward began to develop imaginations & spread weird tales, & naturally the \"poor old operators\" were called upon to \"Keep a sharp watch\" \n","76":" At 1.30 a.m. A ship passed & signalled \"Who are you\" & \"where to?\" but the only reply was in edging well away from her. Dutch boats were very busy on their wireless stations & passed messages to one another from the Red Sea to towards Aden. Several pieces of war news were received & of course were fuel for all to talk over. \n","77":" Still in dangerous waters & the divvel’s own day too. Hot & stifling with a sea like glass. At evening the course was altered towards Fremantle. H.M.A.T. Saldanha was still in sight & the Captain on that steamer kept pigeons & two of these escaped & flew to the A 13. A message was therefore sent to us to \"catch ’em\", but words are cheap & every time any attempt to catch them was made they shook their little tales & away they flew. Captain Jackson was all on for shooting them & making a pigeon pie. \n","78":" Yes! remarked Teddy in disgust. \"In Wigan all the boys are out in the meadows playing football or else in the snow \n\nhaving a fight\". \"A life on the Ocean wave cooped up on this old tub compared to it\" Eh! What? I remarked that I wanted to see London but he assured me that I would not be charmed by the appearance of London in winter. Slush, mud, rain & cold are the main sights to see. We then began to consider starting a Wireless Telegraphy School in Sydney & make \ntons\n of money etc. Anything to talk about. It gets very tiresome with nothing but old news to rake up. At breakfast for instance. Enter Captain Jackson & Chief Officer who sit in their places. Next comes the Chief Engineer & the same old question is again asked \"What speed is she doing etc\". Enter Teddy. \"Anything during the night?\" No! Sir! Enter his worship the author. \"Any news during the morning?\" \"Yes sir! War news from Bombay H.M.T Thunderer torpedoed in the North Sea. Germans in Antwerp. Allies progressing favourably. Wouldn’t the Chief Officer bite. Pinto of course would immediately tell the Chief Steward & in a few moments the news was known all round – and Teddy & I would morse code \"Liar\" to each other by means of our feet. We dared not wink for fear of letting the cat out but how we laughed when alone. After breakfast there was a natural rush to our \n\ncabin for details - & how nicely we spun them. At night time our news was construed into fabulous tales of disaster & triumph. The next spasm of \"War news\" came when the last lot was worn out. How the Chief Steward would put his theory on our news & enlarge upon them. The Second officer always met us with \"You horrible liars\" – expressive if not polite, but he enjoyed the fun with us. \n","79":" & two days north of the Equator, with a heat enough to hatch eggs in a few hours. A special dinner was prepared for six p.m. & perhaps we all understood each other for lunch was very mild indeed. Six p.m. & with the stroke of the bell on the bridge we strolled into the saloon meeting the Chief Steward who waited for our testimony as to the table. Splendid. Spiffing etc. Decanters of wine with cards attached bearing the Compliments of the Season from Captain Jackson, Jellies & Ice Cream – a feast for the Gods. Everyone got to the end of the menu in time & some hung on to the last few dishes to \"fill in time\". Teddy & I came a good last & we waited for the Third Officer & kept him company. Without reflecting or finding fault we all noticed that the wine was by no means over proof but rather \"wet\" & was enough to send a milkman to gaol if he added as much \n\nwater to his milk. The third officer finished at last – we were \"de trop\" – & we toddled out into the air. A meeting was then held in the Second Officer’s cabin & champagne & music were the leaders. Musical items were rendered up to midnight & by then throats were rather dry so they were wet again & the party disbanded & a confab was held in the Steward’s Cabin where the most glorious lies & abominable untruths were told. The Chief Engineer was debating on social questions & the \"’ere ’eres\" were jerked out in spasmodic grunts. He was just waving his finger, about to expound a great theory when I put my face up to the port hole & whether it was the contour of my dial or whether surprise on his part I know not but that theory froze in his throat & his eyes I thought would fall out of his head. I quickly withdrew & listened to him saying that he saw someone, something – – don’t know etc so I faded into bed. \n","80":" Two a.m. there was someone at the rail wurr-r-r-pp: wurr-r-p & evidently in great distress. Chief Steward in his bunk dressed & with boots on. During the morning it was necessary to pack a gland in one of the cylinders which took about an hour \n","81":" I nipped a hammock from the hospital & had been \n\ntrying to sleep in it but only succeeded in being turned out on the deck that had been painted with crude oil & my plight may better be imagined than explained. At 5.30 am the A 13 crossed the Equator. Flying fish are very numerous about here & southwards, some attaining very large size. They are somewhat like a very large dragon fly & skip along the surface of the water for considerable distances & then generally strike a wave & disappear. A strong light will attract them readily, & occasionally they are blown with great force against the ship which results in a mangled fish. In the afternoon the officers held a musical performance, outside the saloon door. All wore singlets & a pair of white trousers. Teddy as usual rendered his songs & the second steward – Jim – supplied the base to the music on my stringalina. He was very deaf & consequently ignorant of the discord emanating from the strings which he pulled as if plucking a duck. \n","82":" In the Doldrums again & fierce heat & damp moist air. Poor Teddy lay in his bunk with the perspiration rolling off him. I, myself had lately been parading the deck from 2 a.m. till 5 am in my pajamas with the coat undone. I was lovely & cool like this if any breeze was blowing, & made me feel quite happy at times but when the sun rose, it \n\nsoon killed any high spirits. Tiddles the ship’s cat had yesterday given birth to a kitten which died & today she deliberately jumped overboard. After lunch I sorted out a few shirts & singlets that needed a wash & set about extracting the dirt. I soaked them first & then began to rub & scrub until the perspiration ran out of me. A little of this soon settled the question so I only washed the necks & cuffs & then hung up to dry. There being no irons to iron with, it was necessary to sleep on those clothes until they were as well as ironed. Washing had been done in Alexandria but all the buttons were either mangled off or else out of shape so it was now necessary to use wire & nails for buttons. No wireless messages had been received so far & not a scratch was to be heard in the phones, but after dinner today a faint but clear note could be heard from Bombay radio.\n","83":" At 4 a.m. the darkness was intense even the water being hidden & not a star was visible. The weather was getting slightly cooler but was still humid. At midnight every night a \"sight\" is taken to check the position of the ship. The officers know the stars as well as we know our own streets & at a glance will say \"there is Orion\" there are the Seven Sisters & so on. The Pole star was just out of sight now. \n\nThis star is a very small one & is only visible north of the equator. It is only recognised by the two stars forming part of the Plough, which point to it thus:\n\n(diagram of ‘The Plough’)\n","84":" Early morning began with a heavy sea & thick drizzling rain & a dull leaden sky, which increased as the day wore on, making everything miserable. Teddy & I sat at the doorway & yarned about some fresh war news to spread around. \"I knew it\" said the Chief Officer who by the way always imagined he had heart disease & at the time was holding his side as if in agony. \"Knew what?\" said Captain Jackson coming on the scene. \"That the Germans were about to invade England\" he replied. \"Dammit man where did you get that from\" & an argument began that caused us great amusement. Of course the Chief Steward was in his glory & spread butter on the news. \n","85":" The last day of 1914 was at hand & a nice day I don’t think. The sea was very heavy & the rain thicker \n","86":" Still raining & very heavy sea. I was feeling very sick & tired but had to keep going as to \"be sick\" simply meant throwing \n\nmy shift on to Teddy.\n","87":" Radio messages again in range – Perth working to Geraldton (W.A.) showing that we were nearing Australia. \n","88":" Seas are still very heavy & everyone has a sore back through continually swaying to oppose the motion of rolling. The A 13 being hampered by adverse currents & winds should have been in Fremantle by now but still has 450 miles to go.\n","89":" A howling sea with gale of wind raging all night. Lying in my bunk it was a glorious feeling to rise up & up & then sink down again almost taking one’s breath away. By the light of the table lamp I could see Teddy dozing off so I got up & relieved him. He was feeling very sick so I got him some hot brandy & let him turn in. The A 13 was rolling like a barrel & the waves washing over her decks like over a submarine. The sea was running very high & a thick haze present owing to the presence of land. I had been watching the huge waves slowly but surely rolling towards us & several times I expected we would be swamped. The waves would tower above, a dark green colour & as they drew near, my heart would beat faster as I expected them to crash on us but there is a sensation of rising as the A 13 would climb this hill of water & as the wave passed under us there would be a \n\ndelirious feeling of falling through space, that takes one’s breath away & feels like walking on air as the A 13 would dive down into the trough of the next one & would bury her nose in it & send a great green roller tearing over the decks. During this rolling I almost fell over the side as the A 13 took one beam on & swung over so sharply that I almost overbalanced. This same lurch brought the Captain out to see what was wrong & at the same time it turned Teddy out of his bunk & sent the crockery in the pantry all over the floor. I got the fright of my life through it & of course I was laughed at for not going over. \n","90":" At two a.m. Teddy awakened me & said that Fremantle was very close. I got dressed & went outside & there, away in the distance could be seen a revolving light on Rottennest Island – twelve miles from Fremantle. What a great work navigation is & how perfect it is. For just a month the A 13 had been steaming along, buffeted by gales & blown out of her course & yet she is heading for Fremantle as true & as straight as an arrow. No need to grope about the coast, nor even to alter the course. The way is like a beaten track to those who understand the sea. The moon was just half & the sky was clear & the water calm & everything seemed so peaceful. When five miles or so off Rottennest Island we got into communication \n\nwith the lighthouse & received instructions by means of the morse lamp to proceed slowly towards Fremantle & a pilot would bring out sealed orders. At this time we were ignorant of the state of the war so we asked Rottennest Island Signal station for war news but as usual there was none. (Another work for us) At 5 am the pilot came out & came on board with sealed orders to proceed to Melbourne. After a little chat about the war news he wished us bon voyage & cast off. The Chief Steward then came blustering in with a paper he got off the pilot. He soon lost the run of it & Teddy & I handed it to the engineers – what was left of it. The sun rose with a blaze of crimson light over Australia & I must say I felt very impatient now to get to port. As we turned round to leave, HMAT Saldanha entered & we each dipped our ensigns on passing. That morning was the most glorious & peaceful I had ever seen. It was Sunday & the sea was a beautiful crystal blue, calm & clear & the land could be seen quite plainly. I spent the morning sitting in the sun up forrard & I must say it was a perfect day. At 4 pm the sea began to rise & the wind blew with increasing strength & once more the A 13 began to flounder in the sea. \n","91":" At two a.m. we were just \"turning the corner\" round Cape Lleuwin & the sea was a snorter. Every few seconds there was a \n\nsickening thud & the A 13 would bounce with the force of the blow. The men call these \"milestones\" & they put a great strain on a ship’s back. We were getting the force so heavily on account of our light trim. I went up forrard to my usual place clad in my pyjamas to see the most awe inspiring sight possible. The moon was quite bright & the sea was a mass of white crested waves that hurled themselves against the A 13 with a vicious thud & were sent back again in a shower of spray like fine snow. The wind too was moaning a shrieking & was so strong that I was afraid that I should either be blown overboard or else have my pyjamas blown away so I got hold of the ironwork. It was a magnificent spectacle from where I was, as I could see all over the ship as she plodded along throwing the waves back like froth. Shipwreck – what an awful word & how it struck home at the time. On land we do not realise the awfulness of shipwreck & what could a boat do in a sea like this. The very thought of shipwreck was enough to chill one’s heart. Teddy always remarked in rough weather that in England all the parish churches pray for \"Those in peril on the sea\" in stormy weather & there is always a prayer for those in the North Sea exposed to danger. How often do our Australian churches think of those away from their \n\nimmediate vicinity. Plenty of time for arguing about No License & other debates but very seldom do we hear a prayer for those at sea. I often wondered if the people at home ever thought of the dangers \nat sea\n to their soldiers – not from bullets so much but while on the sea. In Australia he (Teddy) said if it rains or a squall rises, every body makes for home & never gives a thought to the man behind the gun as it were. It is the same everywhere. How often do we think of the engine driver who has our lives in his hands as he tears through the country. Very seldom – he is paid for it . . . quite so. At sea everybody respects the Captain & the officers under him for it is upon their command & judgment that our lives depend, & yet, what a helpless band we are, each in his own sphere. Captain – responsible for all. Officers answerable to him – Operators ready to send out a call for help. Three letters only & what a meaning it has. S.O.S. Simply three dots, three dashes, & three dots & when heard every other message, no matter how important, whether Government or Public message must stop & the S.O.S. call must be answered. Should the operator name any particular station in reference to a distress call, then that station is responsible for the assistance to be rendered. Any abuse of this call \n\nis liable to bring most severe punishment. And what a great institution this Wireless telegraphy is. Isolated from the world & perhaps on fire a ship calls CQ (all stations) S.O.S from (ship’s call letters) & every ship that hears that call is bound to render assistance – not a case of excuse for not going – but is actually forced by act to go to the distressed one. Land wireless stations hearing a distress call from a ship immediately use their full power & call QRT which commands all stations to stop transmitting immediately. There is no \"wait a minute\" The words are precise & final. From the charts in the land station the position of all boats within range is known & from this land station all orders are issued & no matter how important a message may be it has to wait as no station dare to transmit until the distressed one is relieved & the controlling station calls CQ . . . OK. Not speaking for myself at all I would like to draw attention to the patience & perseverance of an operator. He is generally looked upon as a gay young fellow at an easy game, but what is behind the position? A great deal more than we suppose at first thought. He is often taxed to his utmost to overcome atmospherical conditions & the resulting phenomena & a most intricate machine to handle – not a toy but a scientifically constructed machine that is capable of great results if handled well but in an \n\ninexperienced hand it is a very dangerous machine. People say \"Why it is simply tapping at a key\" \"Quite so but that \"tapping\" takes years to learn & there is far more than a mere tapping to do. There is a maze of wires each with a purpose & the operator must be familiar with them all. After the little I saw of Operating I am convinced that it is a noble but sadly underpaid profession for when his actual self stands forth he is the second last to leave a ship in distress & only then when he can do no more. All honour to those at sea, for they fear nothing. A year at sea would make more of a man than several on land. \n","92":" Sea again down to smooth. Potatoes off the Menu owing to the supply giving out. A new dish was made Bully beef rissoles & my snakes talk about salt & leather – Even Captain Jackson would not look at them & worse than that they were tainted. Teddy painted the cabin with white enamel & made an awful smell of turps. No sleep that night & on \n","93":" Teddy & I were both about \"done\" & longed for Melbourne. We each buoyed the other up with such remarks as \"Never mind Melbourne is near.\" \n","94":" Very cold & need for three blankets each, but sleep comes with it what little can be got. S.S. Demosthenes en route to England sends short war news at 8 pm. \n","95":" Washing clothes early in the morning. Pass a four masted barque bound for Adelaide. That night Adelaide (VIA) called H.M.A.T. Saldanha but could not get an answer for some time. The sea was very calm & peaceful & at eleven pm. Mount Gambia Radio (VIY) South Australia came into range. \n","96":" The sun rose in a splendour of golden light & over a peaceful sea. Decks were hosed & cleaned ready to make port. At 6 am I reported that Melbourne Radio was in range & a message was sent to the Naval Authorities advising our arrival at midnight. Great trouble was experienced in getting this message through. At about ten o’clock (a.m.) we steamed through an enormous shoal of porpoise some thousands in number. At 2 pm a dense fog came down like a blanket & then the trouble began. Every 45 seconds or so the whistle would almost deafen us as it sent out the warning. A fog tends to stop sound & at a short distance our whistle would have been inaudible. There was no sleep that morning & I felt absolutely physically & mentally tired out. We could not find our bearings to enter Port Philip so steamed along at a very slow rate. At this time if anyone makes a noise he will surely be jumped upon by the Captain as all ears are strained for the approach of another vessel. The fog lifted later on & we put on full speed. On passing the rip, searchlights played \n\nupon us until we hoisted the pass signal. A pilot then took us up to Port Melbourne & anchored at just on three am\n","97":" I did not wait for anyone but earthed the instruments & closed them down & jumped into bed clothes & all. Muster was the next I remembered & we then steamed into the pier. As most people know Melbourne I shall not remark upon it.\n","98":" At 5 pm I left Melbourne by train for Sydney after bidding farewell to all on board, which I admit I did not like doing. Teddy came down to the train & as we parted I felt that I had lost a great friend for he had been very kind to me. He is still away at the Dardanelles & if ever I get the chance of doing him a service I shall be there. \n\n"}}