{"Document Name":{"0":"Diary_0491","1":"Diary_0491","2":"Diary_0491","3":"Diary_0491","4":"Diary_0491","5":"Diary_0491","6":"Diary_0491","7":"Diary_0491","8":"Diary_0491","9":"Diary_0491","10":"Diary_0491","11":"Diary_0491","12":"Diary_0491","13":"Diary_0491","14":"Diary_0491","15":"Diary_0491","16":"Diary_0491","17":"Diary_0491","18":"Diary_0491","19":"Diary_0491","20":"Diary_0491","21":"Diary_0491","22":"Diary_0491","23":"Diary_0491","24":"Diary_0491","25":"Diary_0491","26":"Diary_0491"},"Date":{"0":"unknown","1":1383.0,"2":1384.0,"3":1385.0,"4":1386.0,"5":1387.0,"6":1388.0,"7":1389.0,"8":1390.0,"9":1391.0,"10":1392.0,"11":1393.0,"12":1395.0,"13":1396.0,"14":1397.0,"15":1398.0,"16":1399.0,"17":1400.0,"18":1401.0,"19":1402.0,"20":1403.0,"21":1404.0,"22":1405.0,"23":1406.0,"24":1407.0,"25":1408.0,"26":1409.0},"Entry":{"0":"\n\n \n\n","1":" Canal Area. Ypres\n\nThe 5th. & 7th. Bdes. attacked at dawn under cover of a tremendous bombardment which did not sound as loud as we expected here but was doubtless well heard further back. The assault was launched at 5.40 a.m. The aircraft were like bees flying very low. The cannonade settled down to a steady level before 8 am at which time the 23rd. Battn started to move up to near the Lille Gate in platoons. We settled down to issue of extra ammunition rations and water and got ready to move at 9.40. The rain during the night had not affected us much here beyond making the ground soft and sticky and the morning is a showery looking one with gleams of sun. That there should have been rain at all at this juncture after so much fine weather goes to affirm the superiority of the German God to ours! News through at 9.20 that our people are definitely on the blue line with very little fighting at 8 o’c and captured 130 prisoners. Big counter attack expected at 10 am. \n\n \n\n20\/9\/17 Canal Area\n\n10.40. Had just given the order to advance when Burrage our liaiason with Division came with an order to stand fast. A few seconds later a runner brought us news that the third objective had been taken. The morning is now a bright sunny one and the guns & aircraft still active. Our bivouacs here are situated in a belt of trees among a lot of transport. Occasional trainloads of wounded pass here & from them the fellows get occasional chunks of dinkum long before it reaches us officially through regular channels. Among the men we have a few cowardly curs and now have 3 in the guard room who we will try & force up at the point of the bayonet. One man paraded to Stewart saying he was frightened. Young Scanlon after good work for 3 months cleared out at the first shell burst. 11.30 am. The sky has clouded over. We are still sitting down here waiting for orders and the guns are fairly active. No Taubes. I got the band over and it is playing some selections while we wait. Wounded going through state, that things are going well up\n\n \n\nin front. All the transport lines are situated hereabouts and at them are all the odd details of each Regiment. Deducting a fatigue of 75 men I now have available for fighting a battalion of about 450. Our 100 casualties and the details at Caestre of course account for some of the balance. Though flat and devoid of any hill features the country round here must have been very interesting & pretty. Just now with the advent of winter the trees are starting to shed their leaves. At 11 am we received a message that the two flanks were on their objectives and rumour has it that from their pillboxes the enemy are “kamerading\" freely. But your wounded here is always discursive and his impressions gleaned in excitement are not always the most reliable and trustworthy. A man lies unconsciously one finds. Our lines of advance are very definitely laid down in the operation order and we shall have to make some reconnaisances today to ensure being able to get up. Wounded say our people alright\n\n \n\n20\/9\/17 Canal Area Ypres\n\nin the front but that the two flanks are catching it hard, far more wounded of theirs than of ours. Put in my waiting list of N.C.Os for commissions and only hope that the chaps picked manage to live through this scrapping. The prisoner we captured the other night was very useful for the amount of information we got from him. The band is playing rather low operatic music which is hard to hear over noise! About 2.15 a Taube came over above one of our observation balloons & commenced firing his machine gun at them forcing the observers to descend by parachute which succeeded after much twisting. A few big shrapnel are landing round us here. Three of our chaps wounded out on fatigue this morning burying waterpipes. All sorts of rumours are current mostly that the operation has been most successful but that things on the 1st. Divn front are a little held up. The 8th battalion is mentioned as having suffered a good deal.\n\n3 pm. No orders to move yet.\n\n \n\n20\/9\/17 Canal Area Ypres\n\nTowards evening the air activity became very great. As regards the air superiority we simply just \ntook\n it today without any parley at all. Received orders to stay in present camp all night – great furphies flying round but general opinion is a successful day.\n","2":"\n\nHeavy bombardment about dawn and a Taube over doing some m.g. fire. A bright sunny morning in which we received orders to carry out a relief tonight – absolutely no informatory details, an obscure situation and taking over positions that yesterday were well behind the firing line of the Imperial German Army. At 9.30 left on horseback with my faithful little band – Bunning, Rodda, Wolff & Davis & Stewart. We rode up towards Ypres and then struck overland on a corduroy road past the lake of Zillebeke to that great architectural feature the Great Wall of China which we found rather more delapidated than it was when\n\n \n\n21\/9\/17 Ypres\n\nwe were up here about a year ago. There are a number of heavy batteries round here and their vicinity has been badly shelled behind each battery is a little crop of crosses. Hereabouts were also a few tanks being used as tractors. The morning was a delightful sunny one. Rode up to BirrCross roads and there dismounted. Groped a way down below through dark and sloppy electric lighted dugouts to the staff quarters and there saw the General. Rode on up the corduroy track up past Chateau Wood – this track was very busy with 18 pounders moving forward right up to new positions in rear of Westhoek ridge. Shells and other traffic also going over roads that up till yesterday’s attack had been quite impassable owing to shell fire. A number of dead horses lying about and in one place was a limber all in pieces the men in it had evidently been blown to bits if ominous dark patches and\n\n \n\n21\/9\/17 Westhoek Ypres\n\nstrange little heaps spoke truly. Crossed over the Westhoek ridge and were soon into the territory newly captured. The ground very much shell torn and and plenty of German material lying about bombs etc. Some of our dead men lying there in crumpled funny heaps one chap absolutely cut in two his dark blood like pitch all round him. Someone had thrown a few sand bags over them. About ½ mile from our old front line came up to four pill boxes which served as HQ & RAP 25th Battn. The Huns were asleep when our boys arrived yesterday and they had great fun killing them. The floor of Norries dugout was even yet aflood with a stinking mess of blood and water. Outside in a dreadful weltering heap lay the corpses of about 20 Germans two were clasped in one another’s arms. Stretcher bearers as I stood there took some one of ours away and buried him. The firing\n\n \n\n21\/9\/17 Westhoek\n\nline is about ¾ mile ahead of here – a really splendid advance and done by some units with hardly any losses. The evening was very quiet and permitted a tremendous lot of movement hereabout. Walked back to our horses noticing some of our own dead with arms and legs off and took to the saddle of Birr X. Three Taubes came over and did some grand bomb dropping sending up several dumps. Made the pace back to camp reaching same about 3.30 desperately hungry and athirst. Rapidly issued orders for our move forward at 5. Rested a little and at 5 commenced our intervalled march to China Wall and tucked the chaps away there. Just at dusk the S.O.S went up the Germans delivering a counterattack on what seemed to be a big front. We got into touch with BdeHQ at once and I decided to stay still until the bombardment stopped. We were very well out of it &\n\n \n\n21\/9\/17 Westhoek\n\ndid not have a shell within coo-ee of us though enjoying a grand birdseye view of the whole battle field. Tongues of living flame seemed to jump out of a thousand gun muzzles. During this strafe a Taube brought down one of our drachen in flames the occupants getting out by parachutes. We pushed on at 8 and had a miraculously quiet run in not a shell within hundreds of yards of us. In due time arrived out in the marshy dip where Norries pillbox was and took over from him. Sergt Bailes and another killed and Thwaites said to be badly wounded. All the companies were in and their relief complete by midnight and we bade farewell to Norrie and Co. who trudge back to Halifax Camp. Here let one say that among officers I have rarely heard so much cheerful bad swearing & oaths as here and I am glad that my regiment is free of it comparatively. After taking\n\n \n","3":" Westhoek\n\nover we had a quiet night but just at dawn the S.O.S went up on our right bringing down the heavy barrages. A heavy fog also came on but no attack developed. A shell blew out one of our posts killed 3 and wounded 7. A runner of the 23rd. wearing the ribbon of the Military Medal came in and said he had seen one of our chaps with his leg blown off and another partially disembowelled & shrieking. “Terrible\" was his only comment. In an hour or two a stretcher was brought down to R.A.P with a blood stained body very much blown about and one poor foot missing. I ordered a German overcoat to be put over the poor face and the lads buried it. They also buried a tangled heap of dead Germans and some souvenirs were found in the ratting. Hunt found a heap of dead Tommies of the City of London Regiment – relic of their unsuccessful attack. About 8 a.m.\n\n \n\n22\/9\/17 Westhoek\n\na fellow named Day who did Pozieries Bullecourt and all other stunts came in with a fit of funk. “It is awful all my mates are killed or wounded I can’t stand it &&\" so sent him back to the Transport Lines. Preliminary orders arrived for me to extend my frontage to double what it is now by taking over more on the left and there is talk of the whole Division moving out tomorrow. Shifted quarters to a pillbox in front – the Germans are filthy and our men shovelled out loads of muck that stank. Colonel Brazenor came in during the morning. Overhead the Taubes were very active and drew a lot of fire from our m.g.s. The conversation of the details who occupy the other half of this place is funny. “Gawd\" says one “our b--- 18 pounders whistle like --- galahs.\" The 23rd. caught a fat German sergt. major, yesterday, who had got lost.\n\n \n\n22\/9\/17 Westhoeke\n\nAfter lunch things were very quiet and I went up to our front line (supports). The two coy. h.q.s are within about 200 y from here. Rodda was in a pillbox near some old gun positions which were much torn about by shell fire. A disabled 77 mm. gun was standing still in the place it had been knocked out. The ground is shell torn to a remarkable degree and the men are spread about in little posts dug deep down. When rain comes the place will be dreadful and even now some of the places are commencing to fall in and crumble. All the men seemed fairly cheerful but A-G were a bit rattled owing to their whole post catching it this morning. Gay had a terrible end poor chap and died in great agony – Bunning had to send him away on a stretcher to die as his cries were affecting the men. Rodda had a filthy experience last night. He was in a pot when a shell burst and a piece of soft naked body hit him fair in the face – a shell had blown a body to pieces. Bunning was\n\n \n\n22\/9\/17 Westhoeke \n\ncrouched in a rotten little trench devoid of any sort of cover. Walked back to BattHQ. The Westhoek road is still very clearly discernable & wanders along the waste of desolation but still retains some of its characteristics as a pleasant country road – in one place there is a little green bank nearly untouched. Our track lay through marshy shell holes and will need raised duckboards or bridges in wet weather. In one shell hole lay the body of a young German soldier in water up to the armpits. It was like a waxen image – dead white face bright blue eyes and their ugly steel helmet. Little Fry the runner remarked “He ain’t been ratted yet surely.\" On arrival back at H.Q. we found that the redoubtable OP. Hunt my batman \nhad\n been out early in the day and duly ratted the corpse. My OP Hunt does not miss much!. The General called in during the afternoon and had a yarn. All our men tonight are on fatigue. Our LGs. put in some work at Taubes. Heavy barrages put over on our left at 6 p.m. very heavy.\n\n \n","4":" Westhoeke \n\nDuring the night there were some heavy bombardments with crumps but nothing very much doing until 4.30 am. when the S.O.S. went up on our right. Our guns replies heavy but the stunt soon died down as soon as it became evident that he was not attacking. About daylight 3 German prisoners arrived and shortly afterwards 3 more. Our 23rd. had noticed them enter a pill box in No Mans Land and then went out and captured them. They were in full marching order had their steel helmets on and stank like goats. They were pretty well ratted before reaching us but I collared a couple of their caps and some other souvenirs. The contents of the packs were pillaged by our runners and others. A shell landed in one of A Coy posts this morning and killed 5 wounding 10. “Red\" Wright, No. 72 another of the old originals was killed De Bourbel was wounded. In the R.A.P. which here adjoins they had last night some bad cases and there were many groans. Ducky Johnson the 23rd runner will probably\n\n \n\nlose his leg. One of our men rather elderly died on a stretcher last night of plain heart failure. At 7 a.m. our artillery opened up in a practice barrage which was very effective and powerful. The retaliation was weak. The aircraft were vigorous. Major Margolin C.M.G. 16 Batt. and his O.C.Coys came up reconnoitring & will relieve us tonight here. They hop over in 3 days time – some troops ‘the Anzacs’. Sent out Hunt & a few others in advance. Towards evening the aircraft started again and the enemie’s flew very low all our L.G.’s and Vickers firing vigorously but without any success. At one time there were 55 machines in the air some coming down very low. It is amazing that we can’t hit more by the bullet. One of ours crashed this morning near our “D\" Coy and the pilot was killed. This evening one (Fritz’s) came down on our left. Just about dark we put up a terrific barrage on the left and his retaliation was extremely heavy as he sent up S.O.S. calls by greens & reds.\n\n \n\n23\/9\/17 Westhoek\n\nHis barrage line was on this gully and fortunately missed our line – evidently by its intensity he has put more guns on this barrage work. About 8.15 things were quiet once more and a glance outside showed the whole place wreathed in smoke and fumes and an almost perfect quiet save for the hurtling sound of heavies wobbling over high up in the air and the rattle of an occasional machine gun. Today the Hun has had stretcher parties out collecting wounded working under the red flag. In one place he had an open cart and did not seem to be using much ceremony in the manner he was putting people into it – possibly gathering in his dead. Young the runner is a little dark boy of about 18 very quiet and clean always. His brother was killed at Bullecourt. Despite his quiet looks he is one our dags and can use filthier language than many others. Cold blooded, callous to agony and dirty sights, this child of 18 (a veteran in service) is one of the peculiar products of the War & its work.\n\n \n\n23\/9\/17 Westhoek\n\nMajor F Tubb V.C. killed on our right today. The relief by the 16th. Battalion passed off very quietly and well. They had a couple killed coming in. Going out we had hardly a shell. Nearing the Birr X roads we passed very close in front of some heavy gun batteries. The flash and concussion nearly knocked us over more than once. Our horses were waiting and we pushed on down to the Asylum. There was a 10 mile trudge in front of our tired lads but fortunately a shell transport convoy passed and many got a ride in the lorries. Rum tea and chocolate were waiting at the Asylum. A long walk from the road to Dominion camp some slept by the roadside. As the camp was occupied by the 48th. we had to bivouac until next morning. A chilly night. Stew and hot tea were waiting for them. Everyone was extremely tired and knocked up with fatigue.\n\n \n","5":" Dominion Camp\n\nA lovely sunny day. No one got up until late and then everyone was tired out and lacked energy. Took a couple of short summons against men who were A.W.L. from the line and then met the doctor and walked ¾ hr into Reninghelst for a bath – quite the best since Erquinghem. How good to soak and get the dirt out of the pores. Made a few little purchases and then returned. A very dusty place full of troops. On the big shell dump near the station a good number of Chinese coolies were at work. At camp found plenty of letters to answer and lots of clerical work to take in hand. The quantity of paper used in the army is wonderful! Right back here seems very far away from the War and it is hard indeed to realise what we were up against only a few short hours since. Our typewriter hard at work keeping returns etc. up to date and dealing with correspondence.\n\n \n","6":" Dominion Camp\n\nA clerical day. Recommendations for honours and rewards, promotions of N.C.O.s, court martial summaries and general routine matters. In ally with an attack of nasal catarrh these form a pleasing mixture. The weather was quite lovely but a little on the warm side. The General was around about 4.30 and I went round to BdeHQ at 6 p.m. and had our future objectives pointed out to us. Dinner at 7 – a very tasteful display of flowers in the table decorations and an excellent dinner washed down with champagne. Colonels Brazenor Duggan & James made up the party with the staff and the good wine put a sparkle into eyes & conversation. All military talk a mere civilian would feel out of it. Over the table we fight bloody battles over again and change from the red scenes of Pozieires to the mud & wet of Flers.\n\n \n\n26\/9\/17 Dominion Camp\n\nTurned out early in full fighting order as part of the Corps Reserve. The 4th. & 5th. Divisions attacked at dawn under heavy bombardment and we had to be ready to move forward in support. At 7.30 am Major General Smyth & Staff rode up and commenced an inspection commencing on the 21st. Battalion. No comments were made but I was amazed about one or two things and paraded all the officers and told them so in no unmeasured terms, ordering another full inspection at 2.30 p.m. in the afternoon. Word commenced coming through with news of success and the enemy freely surrendering but the English and our extreme right in trouble with their part. Received orders to remain standing by ready to move at a few minutes notice. Went over to Colonel Duggan and yarned for a while there seeing Padre Lamble. Roused the band up for their dirty instruments and put much acid on every way.\n\n \n","7":" Dominion Camp\n\nAfter lunch an N.C.O. from D.H.Q. showed the new signal rocket which ranges 2250 yards. Inspected all the companies again this afternoon and found them excellent: My heart to heart talk this morning produced good results. Went to BdeH.Q. during the afternoon and had a tete-a-tete with the Babe. Back and we had our Officer’s Mess once more this evening. Good to see all the faces round the dinner tables. After mess I told them all I know of todays & the projected operations and complimented them on this afternoon’s turnout. The evening was quiet, and I ordered all the blankets to be issued to the men so they can sleep warmly. King returned from the 6th. Trg. Battalion after being over there since Xmas last. At BdeH.Q. got a good quantity of medal ribbons to keep on hand for the many M.Cs. D.C.Ms. MMs etc.we are going to receive in the near future!\n\n \n","8":" Dominion Camp\n\nFirst thing sat as President of a Court Martial on a man of the 2nd. Pioneer Battalion and as he pleaded guilty finished off the case in quick time to everyone’s satisfaction I hope. Remained indoors – lazy or a little unwell.\n","9":"\n\nPresident of 3 F.G.C.M’s today and awarded several sentences of penal servitude to those concerned. After lunch inspected a couple of companies and then decorated 3 chaps with the Military Medal. Attended at Bde.H.Q. at 4p.m. and met Genl. Sir W.R. Birdwood and General Smythe. The former had a good deal to say about things in general. He speaks with no affectation and was a wise choice for handling our force. After mess went round to BdeHQ and spent the evening in consultation with the General getting all the details for our stunt which takes place in a few days from now.\n\n \n","10":" Dominion Camp & Zonnebeke\n\nAt 9.30 am left for the line and had an uneventful ride as far as the Beelewarde ridge. Shelling had been heavy and big stuff was still coming over. Cannot write of the filthy & disgusting sights we saw on our journeys – the German and our own dead are awful. Mutilations & scattered fragments of human bodies. Reconnoitred the front line headquarters and supports having a m.g. turned on us. Our S.B.s working with flag (white). The English know nothing & care less. Our boys are worth dozens of them – one Scout Corpl who had been up here a few hours knew more than all their Colonels. Broodsende and its surroundings are as plain as day & not much damaged yet. Returned to camp saw the General. Taubes bombing us during the evening – searchlights going. Today’s disgusting sights made me want to vomit even after 21\/2 yrs. of it.\n\n \n","11":" Dominion Camp. Esplanade Saps Ypres\n\nA fine sunny day. Early reveille and cleared the camp by 7.45 a.m. Marched to Ypres. Baird evades by first self inflicting a wound with barbed wire in his hand and then being warned for trenches throws a fit on the road. Sent the doctor after him. We are quartered in the ramparts in dugouts and cellars – good protection but dirty and miserable. At dawn there was a tremendous bombardment lasting over an hour. Last night Taubes were over the camp all the time dropping bombs. What with them & our m.g. fire there was not much sleep for anyone. Searchlights very active and pinned one Gotha for quite a good long time. Went over to see Duggan and the General & found them established in the Cavalry Barracks. A Nissen hut being finished we took it for the night. Good deal of air activity & a little shrapnel. Specialists went up tonight. Arrangements for our assault are now well forward. They have the red diamond painted on the helmets.\n\n \n","12":" Esplanade Saps Ypres\n\nAircraft very active last night and while at a conference with the General at BdeHQ one dropped a couple of large ones close to us covering everyone with dust and dirt. A noisy night. At dawn very heavy barrages were put down. The day was very fine. Orders arrived and summoned all officers together and discussed them with everyone. We also got plenty of maps and photographs. All the men hard at work getting issued with their fighting gear – bombs entrenching implements etc.The modern soldier goes into action loaded up like a pack mule. At 9.30 sharp our extremely heavy practice barrage commenced and continued for an hour. The Hun retaliation was said to be weak. It is something to be once more quartered in the historic town of Ypres – the one time Oxford of Belgium – now white ruin & waste. During the afternoon the officers got their men in groups with maps & aeroplane photos and went over the operation. Today we have excellent photographs taken as recently as yesterday over Hunland by the R.F.G.\n\n \n\n1\/10\/17\n\nJust at dusk a heavy strafe started which I think must have been German as we are not commencing until 8.15 pm. I was glad at having held the Battalion up until conditions settled down well. At dusk all the men got outside piled arms and waited for the word to commence moving. Today has been very busy with issue of orders, arrangement of details etc. and our work has not yet commenced until we march up to the line. I would not be surprised if Fritz had come over at dusk tonight. The march up to the line was uneventful except that by taking a wrong turning we went round in a circle and had much extra walking. All the chaps laden up to the teeth plenty of pack and other transport about. Fortunately it was bright moonlight and at last our wanderings landed us at Kit and Kat where water and machine gun magazines were picked up. Reached a pillbox in Hannebeke wood not having a shell near us. It had been an old artillery position\n\n \n\n1\/10\/17 Hannebeke Wood\n\nand a 4.2 gun was still standing in it emplacement knocked right out. The pillbox was not a bad one. Someone complained of dead Germans sitting in a tunnel but our witty doctor said one would not expect to find live ones there now. A considerable amount of gas was put over during the night and the mustard smell was perceptible but did not warrant putting on the masks. It made me feel ill and with the close smell of herded men and the stink of the filth on the floor I nearly vomited. Got very little sleep. An order arrived from Bde. to relieve the 23rd. 24 hours earlier than we anticipated and I\n","13":"\n\n (indecherable) had to send up for Bunning and Rodda at once to make necessary arrangements. Bunning was shaken having had men killed beside him and others wounded. I put both these chaps to bed. Rodda is a dear fat thing.\n\n \n\n2\/10\/17 Hannebeke Anzac\n\nAt 6am our guns lashed out on another of their heavy practice barrages. Enemy retaliation was very light. On its ceasing Stewart myself and these two OC’s pushed across to Anzac to see Col. Brazenor and make arrangements for our move. Davis & Woolf also came in here later. Bazeley had been sent up from Division to look at wire and had a rough trip. Returning we brought him with us and met General Smythe on the track. The ground is awfully ploughed up and the sickening stench of putrefaction pervades all. Had a sleep after a cup of tea & got some broken rest during afternoon. Our artillery did another barrage at 5 pm. Our casualties to date about 6 killed 13 wounded since midnight last night. The S.B.’s are splendid fellows and show up to great advantage up here.\n\n \n","14":" Ypres Anzac House\n\nAt about half an hour after midnight went up to the front line with Savage Stewart and others and had a windy passage across the valley. At intervals duckboards blown out and huddled forms of dead men sprawled alongside. Reached the rear trench and saw Davis and Kohn and fixed the boundaries on the J.O.T. It was a good light and quite possible to read a map under it. Walked overland to the front line getting some machine gun bullets round us. Found the hedge which is such a feature & so excellent a boundary line. The lake of Zonnebeke showed up clearly in the light. Some flares were fired and the high ruins of an old church looked very beautiful on the other side of the shining water of the lake. But it was no time for admiring the scenery and we pushed over a bit of No Mans Land and found Rodda\n\n \n\n3\/10\/17 Ypres Anzac House\n\nsitting a deep shell slit cut in a trench. Yarned there for a while about our charge and then moved back to Battn. H.Q. all of a muck sweat. Managed to get some sleep before dawn and got up about 10 am. The day was a busy one preparations in full swing. At 8 pm I moved off with my party for the Battle HQ’s on the Lake and there saw Rodda and dear little Kell – the later I much fear for the last time. Got everyone packed in Stewart meanwhile looking after the markers on the J.O.T. The evening was quiet but our little slit of trench was only 60 yards from the Boche post where m.g. fire was kept up all the time and frequent flares were fired. All stayed very still while the flares were up in the air and while the bullets were rattling along the parapet. A long wait in miserable cold and a little drizzle before forming up time.\n\n \n","15":" Ypres. De Kneot Fme \n\nAt 3.30 am the companies silently filed on to their J.O.T’s where they had to lie for two long hours. They were distributed in shell holes. All went well until 5.30 a.m. when the enemy opened up the heaviest of barrages and in our little trench we quaked and closed our eyes. Several times we had direct hits on the parapet and were nearly buried. This barrage was evidently the prelude to an attack, later said to have been timed 15 minutes later than ours. Anyway we found crowds of troops when we did actually go over. Meantime this terrific barrage continued and our guns responded. I was in a dreadful state of nerves and nearly broke down all together as I thought our chaps must be catching it on the tapes and also that they might advance on the sound of our gun fire and so get cut to hell. My whole body was ashake and it took a great effort to pull myself together.\n\n \n\n4\/10\/17 Ypres De Knoet Fme\n\nPunctually at 6 a.m. our barrage crashed out positively overwhelming the already intense noise of the enemy barrage. Such drum fire I have never before heard in my life. Brave men leapt out in their waves into this hell – everyone a brave man for it is a dreadful business. As soon a s they jumped off they met parties of the enemy evidently in j.o. positions and McIntyre was killed here. Blanchard went round to the left of the lake and is now missing. Dear little Frankie Kellaway has not been seen since we jumped off. The smoke of the barrage was thick and rain started to fall making the ground slippery. Prisoners now commenced to come in and we discovered them to be of the Prussian Grenadier Guards. Used them to carry their own groaning wounded. Crowds of prisoners now flocked in some from the left flank. Our barrage continued all the time and one\n\n \n\n4\/10\/17 Ypres. De Knoet Fme\n\nfeature was the never ceasing rattle of machine gun barrages. After a while our barrage stood on top of the ridge representing our Red Line and all the chaps were grouped & talking. It looked very odd. Detached parties of prisoners kept coming in. Stewart went out to the corner of the lake and found the machine gun post not mopped up. Occupants all inside were induced to come out by putting a bullet into the pillbox - a bag of 30 men and 3 machine guns. The enemy fire was starting to creep on to us when runner arrived for our new headquarters at Dd Knoet farm. Pushed off for there and had no sooner vacated the other place than Fritz blew it off the map completely killing the staff of the artillery liaison officer there. Our road was over torn and marshy shell holes and shells were whistling very close all the time.\n\n \n\n4\/10\/17 Ypres. De Knoet Fme\n\nOn our track we passed a couple of dead 22nd. boys lying sprawled out on their backs – the familiar purple and red diamond showing up. Beside one was a thick gush of blood. Germans also lay about. About half a mile in was the group of pill boxes known as De Knoet Fme and for these we made getting winded and chased by shells. These were new places and some wounded men tried to crowd into them. My headquarters contained two occupants one was lying on the floor groaning of two wounds in the leg. He had lost a lot of blood. A German doctor came in later and dressed his wound. His cries and moans were all “Kamerad\". After a couple of hours I saw the glaze of death in his eyes and gave him a drink of water. Later a series of moans was followed by the death rattle in his throat and we tossed the body outside with another one who had been bayoneted.\n\n \n\n4\/10\/17 Ypres. De Knoet Fme\n\nMy battalion was now down to about 290 in strength and was dug in well on the ridge. Our doctor was wounded beneath the knee by shell. Poor little Cox the runner was killed also Sgt Craner, Lowery, & I think Sgt. Jones, Cpl. Hornan and others. The artillery officer was badly cracked at the door while letting a pigeon go and lay groaning there all day. I had no morphia to give him. Capts. Pearse, Godfrey & Harriot are all dead so is Brewster. Fine men and gallant soldiers all. My batman, Hunt, was wounded in the leg. There were no stretchers and our wounded lay about all day. Davis wounded in the face remained on duty. The enemy has exact range of this dugout and got several round here today. In the afternoon we got a number of prisoners from a headquarters. One of the officers\n\n \n\n4\/10\/17 Ypres. De Knoet Fme\n\nwas able to speak English. We got valuable maps and orders from them. During the afternoon they massed for an attack but our guns got on to them. A wet evening. Wounded still lying about. At 6.45 the S.O.S went up and a heavy bombardment ensued. No result known yet. A very bloody and day of death today. At about 9 p.m. a little German was brought in. An aspirant officer of artillery who was caught in this mornings stunt and wounded in the head. A decent little chap. He was sick with his blood stained head and vomited freely. I made him lie down. Later Colonel Duggan called in & shifted over here with me. In trying to get more accommodation I had a dreadful experience. Just behind here is a pill box that this morning was absolutely crammed full of Germans. As they did not come out 5 Mills bombs were put into them with dreadful results and the whole\n\n \n\nlot were one dead mass. During the day the place was reconnoitred with a view to cleaning the pillbox out but everyone shunned last night. Last night Duggan’s coming caused a crisis of accommodation and Smith & I decided to go over and see if anything was possible there. We flashed a torch and its beams shone on the white dead faces of German soldiers sprawled in heaps one on top of another. Suddenly out of it all came a low voice faint with pain “Mein leiber kamerad, mein leiber kamerad\". There was a movement on a bench and there we found a live Fritz with a shattered leg. We gave him a drink and he cried to us not to leave him being nearly mad with the horror of lying in pain and semi conscious in a cave of dead. He tried to hold Smith and cried like a baby but War is brutal and it is not just in the eyes of ones comrades to succor the enemy and use labor and aid that\n\n \n","16":" Ypres & De Knoet Fme\n\nare wanted for our own chaps in a similar plight. So we left him there in the darkness of dreadfulness crying & moaning and the last words we heard “Oh: mein leiber friend!\". Perhaps he will be dead before morning if he is not we shall get some of the next batch of prisoners to get him out. The dreadfulness of it all is enough to make God weep. Tonight I sent out and brought in a poor badly wounded chap who has been lying in a shell hole full of water all day his two dead mates beside him. He was brought in moaning and chilled to the bone, we fixed him up for the night as well as possible. An S.O.S went up about midnight and I have orders to attack with my force of 190 and deliver a counter attack on the enemy if they succeed in piercing our line. Issued all the necessary orders for this and discussed it with everyone. A quiet time came on about midnight.\n\n \n","17":" Ypres & De Kneot Fme\n\nStood to arms at dawn and awaited counter attack which did not arrive. The morning turned out bright and sunny and extraordinarily quiet not a shot or shell being fired. It was the same on our side. More ammunition coming up I suppose. Went round the camp & found them all well but very dirty & tired out. Crowds of parties moving round and a few scattered prisoners coming back. This quietness continued all day. Colonels Murphy & Ralph of 18 & 20th respectively came round and arranged relief for tonight. Duggan reported his patrols well forward and no opposition but later events did not confirm any ideas of evacuation. About 7 S.O.S signals went up and terrific barrages of m.g. fire & artillery were put down without anything happening. We moved back to Hannebeke Wood. Bogged several times heavy rain conditions miserable especially for the poor men. A couple killed one’s head and shoulders blown off cannot identify. Orders now for another attack. I have 200 boys dog tired and miserable. Rest of the day quiet.\n\n \n","18":" Hannebeke Wood – Front Line\n\nThe night was piercingly cold and I could get little rest. Lay huddled with feet in a sandbag. The poor chaps out in the cold are having a terrible time and now all have to go on to fatigue from 7 a.m. till noon. I tried my hardest to get them exempted from this and represented to the G.O.C but fruitlessly. At 9.30 left for the 18th. H.Q. and saw Col. Murphy. A long trip but the going was not bad. En route noticed a dead German off whom all the clothes had been stripped by an explosion. He lay half buried the naked flesh all like dirty putty. Passed several little posts or “possies\", their two occupants in each case lying dead beside them where they had been killed. Shell holes full of water contained Germans the effect of the water seemed to check the usual pinching and emaciation of features that in general follows death. Instead faces are blanched the purest white and are exactly like wax figures. Passed several half bodies legs and trunks – these of our own men. The whole rear area was alive with men working – pioneers artillery etc. Some \n\n \n\n7\/10\/17 Hannebeek Wood & Front Line\n\nguns hopelessly bogged in the mud. The condition of the ground is terrible all torn to pieces. Pushed on up to Murphy and found him in good fettle. His people did a raid this morning and captured 15 prisoners of Prussian Polish regiment. Saw a couple of them coming out of the C.T. Went down the C.T. and took a birdseye view of the country. It seems good & untouched much like Bapaume used to look from Flers. Returned to our dugout going very fast to get home before the commencement of a big practice barrage. It opened up about 11.30 and was a fine sight. How the ammunition supply is maintained is wonderful. Rain started at lunch and continued all the afternoon. Our troubles now started. All the company comdrs reported the men in a bad state and not fit to go into the line. Some were so exhausted that they would not go for their food. Those I saw were quite done up poor fellows. Told the General of our low morale & depression but received orders to carry on. The arrival \n\n \n\n7\/10\/17 Hannebeke Wood & Front Line\n\nof 100 details from Caestre seems to be our only hope. At 5 p.m. started to move up and had a nightmare of a journey over the mud. When we reached the S.O.S went up all along the line and heavy shelling started. Shells started bursting thick and we rushed for the nearest pill box which happened to be De Knoet farm. Crouched in against the back we had a little refuge. I was struck by a piece of stone on the shoulder and at first thought of a wound. Some of the others were wounded. Ducked into the place and took shelter there for a while. A rough walk up to BattnHQ. Just at the entrance a shell burst and I saw someone being pulled out and put on the parapet. Smothered in mud from head to foot we staggered inside dreadful looking people. This promises to be a second Flers. The relief dragged on hour by hour and it was indeed a crucifixion of the flesh for the poor tired out fellows. Some were nearly crying. For those who did not turn up from Ypres there is no contempt too deep.\n\n \n","19":" Broodseinde Ridge\n\nAt about an hour before dawn the relief was “complete\" about 110 rifles on 500 yards taking the place of over 320. The trenches are in a dreadful condition the men being up to their knees. All the while the shelling continues on both sides. We had a number killed and wounded one chap was blown absolutely to bits and cannot be identified by any means at all. At about 4 a.m. turned in for a little sleep in the little adjoining cell in this concrete place and slept on till about 9 a.m. The B.M. then came in and confirmed the attack orders so we set to forthwith to get to work and issue our own operation orders. Brought Rodda down from the line and put the poor tired exhausted old chap to bed. All the morning busy on orders. At noon called down all the company commanders and discussed the plans. Poor dejected & depressed chaps. I preserved a cheerfulness that I did not feel. Sent Davis and Tayles out. Towards evening it became wet and the place flooded\n\n \n\n8\/10\/17 Broodseinde Ridge\n\nThe evening was very quiet except for a rattle of musketry and some bombing on our right. Again as on the 4th my nerves broke out – a trembling set in – quite involuntary. The rain has made conditions terrible. It is like flogging a dead horse to get anything done by runners or others. They take the message and soon turn up saying they cannot find the place or some other lie. The men are done, absolutely done & finished. Poor Bunning tonight was well out to it. There were a few shells very close here & we had our candles put out more than once. The evening was quiet except for a rifle and bombing stunt on the right evidently a German raid of some kind. Just before midnight Stewart Rodda and Savage went forward to lay out the J.O.Ts a risky job. As our barrage commences behind our own front line it will be necessary to bring all our men well back to jump them off. My task is to make two strong posts and attack with a battalion 90 strong on a 500’ front!!!\n\n \n","20":" Broodseinde Ridge\n\nStewart and Rodda did not get back from viewing the J.O.T until about 2.30 am and with them brought Coghlan & Savage. The former had laid out the whole on his prismatic compass in a very short space of time. Stewart and Rodda were mud up to the eyes and very done up & tired. A man of the 18th. wandered in after being out in No MansLand since 2 days ago. A member of a party attacking a pillbox he took refuge in a shell hole and had quite exciting adventures. His account, picturesquely illuminated by all the oaths of the hardened campaigner, sounded very funny. Reports indicate that the boys are in fair heart considering all things and we trust for them to give a good account of themselves at hop off time. Now (3.50 a.m.) there is a good amount of crumping going on but nothing extraordinary. At 5 am the barrage lashed out but was feebler than usual and enemy retaliation very hot. Sniping & m.g. fire heavy.\n\n \n\n9\/10\/17 Broodseinde Ridge\n\nThe first news we received was from Braithwaite who advised at dawn that he was all correct in his position & no losses. Macfarlane the runner then came panting in about an hour later mud up to the shoulders but cheery and making the rather rash statement that the “Hun can’t kill me\"! The shelling and m.g. fire continued very heavy for some considerable time after. We had frequent reports from Braithwaite by ‘phone and the 24th. reported that they were held up in front of Daisy Wood – the first indication we had of things being bad. A runner came through Braithwaite with a message from Bunning that he was in position as marked by a message map and that Campbell of the gunners was killed and our Skene Smith badly wounded. Sniping very bad. The Hun rushed them here but our chaps inflicted about \nabout\n 30 casualties on them. During the whole day we had really little\n\n \n\n9\/10\/17 Broodseinde\n\nnews except what could be gleaned from Braithwaite over the telephone. The sound of rifle and shell fire was great and dirty work was in progress. We saw 3 coys. forming up for counter attack and put the artillery on to them. On the left the 5th. Bde did alright but we are well goosed. A just reward for trying to do things with poor exhausted chaps. Sent frequent reports to Bde.H.Q. and had good liaiason with all other units. Not very many wounded came past us but many and prisoners went down the road bound for the rear. Towards evening another hate was on. Just at dark I had word from Braithwaite but none at all of Bunning although we received a report of his place being taken by Fritz. The S.O.S went up from it at 5.38 and after that there was silence. We gave Bunning up for lost entirely. An hour after some wounded came in from Anderson’s party. They had a rough time all mud covered.\n\n \n\n9\/10\/17 Broodseinde\n\nYoung Dooley was hit on the tapes but refused attention. Skene Smith badly wounded was left in a shell hole and old Jack Campbell was killed. The two Vickers guns were knocked out. A good many dead. A Company of the 48th. now came in (10p.m.) and relieving us commenced. It is strange how silently men die. A chap goes out in the dark and nothing is ever known until he is found lying there. In the dark one treads on them. Delighted to hear that Bunning is O.K. he has had a devilish time the last few days. The mud just now is beyond words in our communication trench it is up to the crutch. Bloodstained rattled and stupefied some men are a little deranged and speak strangely of shells & shelling. Our battalion strength now down to 60 and good Australian boys lie dead and stiff on the ground with mud in their hair and blood on them. A dreadful game.\n\n \n","21":" Broodseinde\n\n12.10 am. Bunning rang up to say that he had evacuated his places on account of being surrounded. I leave it to his judgment entirely. He says SkeneSmith is dead. Poor young mother and her 3 weeks old baby. Keith Anderson is in a dugout up forward with a bullet in his knee. Dooley probably dead in some shell hole. A merry game! The evening was quiet and gave us an opportunity to re-organize and get the relief in. Probably the enemy all doing the same. All our folk unanimous as to the utter inefficiency of the barrage on this flank. Slept until about 8 a.m. when K Anderson arrived with a bullet right through his leg but still very cheerful. They were cut up by m.g. fire and only about 6 reached their objective which they had later to evacuate. Vickers gun blown to pieces and two Lewis Guns also lost. Men trickling in bullets in heads & bodies – bad for the chaps lying in shell holes.\n\n \n\n10\/10\/17 Broodseinde\n\nCharacteristic of this constant shelling is the manner in which graves are upturned and their occupants disinterred. One comes too and little shell holes full of clusters of dead Germans and it is remarkable how soon the human body starts to shrink and crumple up. At about 10 am Bde. rang up and asked me to leave Stewart in charge and come down to Sans Souci. Did so and had a fairly quiet passage down across the mud. The stretcher bearers had a devilish hard plug across here. Duckboards commence now about our old J.O.T. The ratting of enemy and our own dead is an institution – one chap with a jack knife literally cutting hunks out of a German. Reached BdeHQ and saw the General. Walked down to Ypres and had a rest with James at Esplanade Saps before going on to Canal area where we rested in curved iron shelters on the bank of an old Canal. Few tired chaps dribble in.\n\n \n\n11\/10\/17 \nBroodseinde\n Canal Ypres\n\nCleaning up. All bivouacked in little shelters dug into the canal bank. About noon rode down to the Transport lines and there saw Miles and others. Then rode down to Reninghelst for a bath. Near some camps I saw General Birdwoods car and later himself and General Brand. He called me over and we chatted for a while about recent operations. He was taking a march past from the 4th. Brigade which was again coming up to the line. The men were looking very fit and fresh. In Reninghelst had a most luxurious hot bath and a clean change of clothing and returned to camp about 4. Dealt with some routine stuff read papers etc.and rested all the evening. Tried a new batman named Mouldy – I hope he is different to his name. A fine clear evening many observation balloons up. The mud is drying up and tomorrow morning the 4th. & 5th Divisions will hop over the top.\n\n \n","22":" Canal Area Ypres\n\nFor their attack the 4th. &","23":" Divns. struck dreadful conditions as heavy rain squalls started during the night & towards morning there was a bog in all directions. At 6 a.m. we had reveille and it was the devil packing up gear etc. in such a crowded place. At 8.15 moved off to the station and found some delay with the trains but managed to get away eventually about 10 o’c. About Reninghelst a pleasing change comes over the country but the touch of winter is on everything and today is cold and raw. The hopfields are now bare. The monastery of Mont des Cats stands high on its peak and is the home of the Trappist monks. Marched by muddy roads to our old billets outside Steenvorde. A pleasant girl who speaks English served us with coffee and bread & butter. Groves and others reached us from B.\n","24":" Billets near Steenvorde. Wet. Dined with General Paton.\n\n \n","25":" Steenvorde\n\nA busy day submitting honors and rewards for our recent actions. Matthews took summaries for F.G.C.M’S. During the morning General Paton was round to look at the men and billets and just before lunch Major General Smythe came and stayed for a while. Heard of Reggie being missing. The country round here is green and pleasant but now is starting to become bleak and wintry in appearance. The men are all housed in barns and outbuildings. The padre conducted church parade at 9.30 and was a busy person for the remainder of the day rushing here and there holding services. Hope to be off to Paris in a few days time and got Bunning and Davis to apply for their English leave. Rodda also could do with a little change to Paris I think. Will get busy on the morrow starting our specialists off again – sigs, gunners etc. have all to be trained.\n\n \n","26":" Steenvorde\n\nRode into Bde.H.Q and saw the General regarding the promotion of some N.C.Os. Many troops of calvalry Indian & British and lancers trekking towards St Omer apparently. Rather futile people in this War. Steenvorde a fair sized place with a rather conspicuous church tower which is not solid but ribbed and can be seen through. The main pave Poperinghe road leads into the closely packed houses of the town. There is the usual square and rotunda. Not many shops. Bought a few odds and ends from a pretty miss but her thoughts were miles away and it was an effort for her to concentrate her mind on toothbrushes and collars. Met General Bob Smith in the street and yarned with him for a while. His stature and general appearance are a great asset to him in a military sense. Rode home again by the winding roads. Over everyone just now there seems to be a feeling of lethargy & fed upness – I know\n\n \n\n15\/10\/17 Steenvorde\n\nthat I have it myself. The men all seem very quiet and dopey and I can see it will be necessary to get to work and stir things up thoroughly in the way of amusement and recreation for them. The fizz has long since gone off the War and everyone is most heartily sick of it all and wants to see it end. Last tour of duty we had more deserters than ever before in the history of the regiment and it hurts to think of good work spoilt by these bad ones. From here we see the flashes of the guns but hear no bombardments. The troops about and all the military business must make existence here a very different thing to what it was before the War. Some of our 6th. Division details reached us today men who have not been in France since the Pozieres fighting. The padre writing to the people of men he has buried. Our new doctor, Stevens, seems a good young chap.\n\n"}}