{"Document Name":{"0":"Diary_0238","1":"Diary_0238","2":"Diary_0238","3":"Diary_0238","4":"Diary_0238","5":"Diary_0238","6":"Diary_0238","7":"Diary_0238","8":"Diary_0238","9":"Diary_0238","10":"Diary_0238","11":"Diary_0238","12":"Diary_0238","13":"Diary_0238","14":"Diary_0238","15":"Diary_0238","16":"Diary_0238","17":"Diary_0238","18":"Diary_0238","19":"Diary_0238","20":"Diary_0238","21":"Diary_0238","22":"Diary_0238","23":"Diary_0238","24":"Diary_0238","25":"Diary_0238","26":"Diary_0238","27":"Diary_0238","28":"Diary_0238","29":"Diary_0238","30":"Diary_0238","31":"Diary_0238","32":"Diary_0238","33":"Diary_0238","34":"Diary_0238","35":"Diary_0238","36":"Diary_0238","37":"Diary_0238","38":"Diary_0238","39":"Diary_0238","40":"Diary_0238","41":"Diary_0238","42":"Diary_0238","43":"Diary_0238","44":"Diary_0238","45":"Diary_0238","46":"Diary_0238","47":"Diary_0238","48":"Diary_0238","49":"Diary_0238","50":"Diary_0238","51":"Diary_0238","52":"Diary_0238","53":"Diary_0238","54":"Diary_0238","55":"Diary_0238","56":"Diary_0238","57":"Diary_0238","58":"Diary_0238","59":"Diary_0238","60":"Diary_0238","61":"Diary_0238","62":"Diary_0238","63":"Diary_0238","64":"Diary_0238","65":"Diary_0238","66":"Diary_0238","67":"Diary_0238","68":"Diary_0238","69":"Diary_0238","70":"Diary_0238","71":"Diary_0238","72":"Diary_0238","73":"Diary_0238","74":"Diary_0238","75":"Diary_0238","76":"Diary_0238","77":"Diary_0238","78":"Diary_0238","79":"Diary_0238","80":"Diary_0238","81":"Diary_0238","82":"Diary_0238","83":"Diary_0238","84":"Diary_0238","85":"Diary_0238","86":"Diary_0238","87":"Diary_0238","88":"Diary_0238","89":"Diary_0238","90":"Diary_0238","91":"Diary_0238","92":"Diary_0238","93":"Diary_0238","94":"Diary_0238","95":"Diary_0238","96":"Diary_0238","97":"Diary_0238","98":"Diary_0238","99":"Diary_0238"},"Date":{"0":"unknown","1":238.0,"2":239.0,"3":240.0,"4":241.0,"5":242.0,"6":243.0,"7":244.0,"8":245.0,"9":246.0,"10":249.0,"11":250.0,"12":252.0,"13":253.0,"14":254.0,"15":313.0,"16":314.0,"17":315.0,"18":316.0,"19":331.0,"20":342.0,"21":352.0,"22":353.0,"23":357.0,"24":363.0,"25":364.0,"26":365.0,"27":366.0,"28":367.0,"29":368.0,"30":372.0,"31":374.0,"32":376.0,"33":377.0,"34":378.0,"35":381.0,"36":382.0,"37":384.0,"38":385.0,"39":386.0,"40":387.0,"41":388.0,"42":390.0,"43":391.0,"44":392.0,"45":393.0,"46":394.0,"47":395.0,"48":396.0,"49":397.0,"50":398.0,"51":399.0,"52":400.0,"53":401.0,"54":402.0,"55":403.0,"56":404.0,"57":405.0,"58":406.0,"59":407.0,"60":408.0,"61":409.0,"62":413.0,"63":414.0,"64":415.0,"65":416.0,"66":417.0,"67":418.0,"68":430.0,"69":431.0,"70":432.0,"71":436.0,"72":438.0,"73":439.0,"74":440.0,"75":441.0,"76":442.0,"77":443.0,"78":444.0,"79":445.0,"80":462.0,"81":464.0,"82":465.0,"83":466.0,"84":467.0,"85":468.0,"86":469.0,"87":470.0,"88":475.0,"89":476.0,"90":477.0,"91":489.0,"92":493.0,"93":496.0,"94":498.0,"95":499.0,"96":500.0,"97":501.0,"98":502.0,"99":503.0},"Entry":{"0":"\n\n","1":" The day for assemblingin Camp has come at last!\n\nI had pictured it for many weeks past after I had finally made up my mind what I should do in the most momentous event in the history of the World €“ A European War! The great day which many of us have talked & thought for so long is now upon us and who can say what will be the outcome of \nthe\nthis awful cataclysm!\n\nWhat it has cost me to leave my darling Wife &Children God & myself alone know. It is all I can do to keep the tears back and the lump in my throat is very large!\n\nBut my duty has beenvery plain & clear & there wasonly one thing to do €“to place my services unreservedly before Major Onslow,my Officer Commanding the 9LH NSW M.R, after the Declaration of theWar on the 7th August 1914, &let him decide the rest.\n\nMy dearest Zara realized the situation at a glance & although we both knew all the sacrifices it meant, our joint resolution was that I should\nsho\n and would do only one thing.\n\nShe & \nthe\nmy children are the dearest things to me in the world & all I have lived for apart from trying toplay the gamethroughout my life.\n\nWhat an experience if I come through &ifIdon't well \n...\nI have done my duty & left a heritage for my children. When all is said & done what\n\nelse are we living for!\n\nDear Joyce & Geof can't realize of course what all this means & it is better that they cannot:they seem to be happy in the thought \"well their daddy has gone to the War\". How I love them all & so many think I am so hard andunsentimental. May it please God for me to return to them! The future is in His hands & I am content.\n\nPoor dear Zara how hard it will be for her at times, in spite\n\nof everyting, for there must come \ntimes\noccasions when no one willcheer herand she will be all alone to think &to think.\n\nAs for me, I shall be busy all the time & there is nothing like work on occasions like this.\n\nI have no illusions about War. I realize all itsdiscomforts & its terrors, but it has its sublime side too & thesatisfaction in having done ones duty is very greatto most men, at least this must be my satisfaction & my\n\nconsolation & it is.\n\nMy friend \"Tony\" Weaverhas undertaken to manage my legal affairs, assisted by my goodold friend DavidMoses (who has placed himself at my disposal at all times) & Zara \nwho\nI have made my Attorneys.\n\nThis alone has involveda great sacrificefor me after 10 years of hard work. I had at least worked up a good little practise. Mr Parsons myclerk will attend to the details & I have to letKenneth Wasbittgo, but I\n\nhope he will return, if I do.\n\nThe Permanent Trustee Companywill be my executors, assisted by Zara, & Weaverwill be my solicitor in this event.\n\nThere have been many things to attend to but even these must have finality & so everything is done at last.\n\nOn the day of arrival in Camp there was little else to do except to settle down in quarters &see that\n\n\n\nthe men who had volunteered for servicewere comfortable.\n\nThehorse lines and other tents had to be pitched and eeryone worked with a will.\n\nThere were only a few officerswho reported amongstthem being Major Onslow, NettletonCoxSmith, Russell and Nichol €“ all the best fellows I should have said.\n\nMajor Holman was here too shaking things up in his best style &never sparing himself.\n\nSo far as I can see at present Major Onslow is to command, Holman is to be Adjutant,Vernon is to be 2nd in command, Smith O.C of one squadron, Granville\n\nanother & Captain irwin ofthe 3rd. I don't like Granville very much €“ he has a bad manner, but he mayimprove on acquaintance.\n\nAs to Onslow he is a fine fellow in everyway, but he has no initiative his deputy saves him all the time. I think he\n\nfeels very much the responsibilty which has devolved upon him & is wiselyfeeling his way all the time. He is a most responsiveman & will always do a thing if he thinks it is wise whether it comes direct from himself or not.\n\nHis position in private life is like my own (except he is mch better off) so far as leaving his wife & family are concerned.\n\nVernon the 2nd is one of the best fellows in the world. I really love\n\nhim: he tries to play the gameall the time: he has a good deal of confidencearising out of the fact that he has had War experience & many years service.\n\nWe are the greatestfriends &it has helped me alot having him of myside & toexchange confidences. He is leaving his wife & 3 children & depends entirelyon his pay:his business as an architect came to an end at once on the outbreakofwar\n","2":"\n\nNow I hear Onslow isto go into Hospital & to be operated on for appendicitis. Most unfortunate for him & for us. Iam indeed very sorry for he is a fine fellow.\n\nNow I hope Major Onslow Thompson may be induced to take the command.\n\nI should have said all the other officers are excellent fellows, keen & enthusiastic, but mostly very young & awaiting theirexperience just I am myself.\n","3":" It is now reported Major Thompson has refused to take command except he is allowed to make his own choice of officers €“ this would mean displacing several & he does notwant to do this, so it is probably he will not command after all €“ this will be a great loss & I know \nit\nhe would add 50%to my confidence. €“he is one of thefinest men & a born leader.\n","4":" Still much to be done & many men to be sworn in. This War has caught\n \nAustralia 10 years too soon &the result is that many men who have possed out are to be called in again (voluntary) as the 1894 Compulsory Cadets are still under 21 &cannot be takenexcept at their own wish & with their parents consent.\n\nSome good men are presenting themselves & the selection will not be easy.\n\nWe are almost totally unequipped.\n\nWe are living in tents & there is no doubt this regular & plain way of living is most beneficial. We start workat 5.45 am & the mornings are very cold.\n\nSo far I have not been able to get beyond squad drill with my men, but this will not do them any harm. They are a good lot & will improveevery day.\n\nAll through my work I am everlastinglythinking of Zara & the children.The fellows often say I look\n\nworried & I only wishI were not leaving them in this way €“ there is no doubt the path of dutyis often paved with very hard stones, but dear Zara is very brave.\n\nI have received many letters from all sides, & there is no doubt the War has broken down all barriers & cementedall people irrespective of race creed or class.\n","5":" 8 14\n","6":" far the equipment has been very incomplete & with theexception of the men generally \nimproving the\ncarrying out squad drill & the principal formations of dismounted troop drill there has been very little for them to do\n\nOf course Camp Routine has been preserved in every way & the class of men erolled has been excellent\n\n\n\nSo far I have a most excellent lot in my Command€“ the Machine Gun Section& I want the very best too, for I recognize it is the most important part of the Regiment€“ 27 men in all & 35 horses 4 waggons & limbers 2 guns & a great lot of equipment.\n\nThe Regiment is 536 including 23 officers.\n","7":"\n\nEveryone has been very kind to me & I do appreciate their good wishes.\n\nIt helps me in this great wrench from my dear ones€“ Thank God they are keeping well & I see them whenever I can.\n\nZara is the bravest little woman in the world to me & my darling children, well I can't think too much about them€“ it unfits me for work & I really have lots to do.\n","8":"\n\nTo day is Sunday & by invitation I went to the Neutral Bay Club at 5 P M where there was a big roll up of members to say \"good bye\"\n\nAbout half a dozen fellows proposed my health & I replied, although I felt the great difficulty of properly doing so.\n\nThey presented mewith a set of razors Joyce with a gold bangle & Geof with a watch.\n\nI felt very much saying good bye to so many who had really been my great friends & their last action has cemented the friendship between us much more.\n","9":"\n\nI have now seen EricVera ZilStella & Gladys.The two first had to leave for home & I felt very much on parting.\n\nThere is no doubt we have been drawn together very much durig the last few weeks on account of my going to the front.This in itself is a great thing to have achieved.\n\nEthel will be down latter.\n\nI have had many letters from all sides.\n\nMrs L W Levey & Mrs B. D Cohen who have alwasy been my close friends came out to see me last Sunday week.\n\nMrs B. D & I had a long chat & there is no doubt she understands me€“ I am really very fond of her too.\n\nMrs L W. is very fragile & I would not be surorised to leaarn of her early demise.\n\n\n\nMy dear friend Mr Moses as usual has done all in his power to help me. He is indeed a real friend & nothing is too much for him to do. My indebtedness to him is very great. & he is a dear old fellow. I wonder whether I shall bespared to see him again.\n\nZara & I paid them all a visit & I kissed Mrs Moses when I left.\n\nDear little Debbie & I have been life long friends & nothing\n\nhas ever disturbed our relationship. She seems now to be happily married & has a dear little girl.\n\nI know she understands me better than most people & I am very sorry I have not so far been able to have a quiet last talk with her before I go€“ perhaps I will later.\n\nIt is still hard to realize that one is taking part in the most momentous event in history & I keep saying what wiill the end be & where will we all be this time in 1915!\n","10":"\n\nCol. Meredith has just been appointed our new Commanding officer. He is at present a complete stranger to me, but I am determined to try & like him & I beleve he is a very good fellow, but my disappointment in not having Onslow \n&\nor Onslow Thompson is very great.\n\nEach would have given me personally great confidence & so much depends in this work on havingyour man\n\nOnslow by the way is very much better but cannot hope\n\nto get away with the","11":" Regt of L. Horse.\n\nMy disappointment is very great\n","12":" Every day here shows how much we are still waiting on equipment & I do not see how it wil be possible to\nget\nleave Australia for a fortnight.\nyet\n\nIn the meantime the Germans seem to be prospering wost marvellously on land. Their well organized force is meeting with the success I felt certain would happen after their years of preparation\n\n\n\nEvidently they had made up their minds about this Campaign for many years \npast\n, but they cannot win in the end€“ that appears clearly impossible but there will be painfulloses in men & money before that end result is achieved.\n","13":" Istill continue to receive presents & cards from so many people & how there is absolutely nothing that I want.\n\nI am sorryto have to say my dear friend Mrs L. W, Levey died on Saturday the","14":" exactly a week after she had been out to see me.\n\nI made a special point of going out yesterday to attend the funeral & found afterward the Funeral was not till this afternoon & I cant go then.\n\nHad a talk with Debbie on the telephone & she is coming out to see me on Thursday.\n\nHad an unfortunate experience with one of the men to day who was insubordinate. I threated him with dismissal, but on consideration gave him a chance again, but never again€“ this is too big & important an enterprise to take any risks. I never had an experience like this before, but I feel I have done right in giving him another\n\nchange\nchance.\n\nI am Orderly officer tomorrow & I must end for tonight for I must be up at 5.45 am in the morning.\n\nMy darling & my children are however last on my thingsto do as I end this page, they must always be the same\n","15":"\n","16":" much has happened to me between the last time I have written a line and these that I hesitate to begin again but I know I shall\nnever\nnot regret having noted some of my experiences.\n","17":" I will begin again to word some of them, that I may read them in the long days & nights to come€“ that is if I live & I if don't some one else may do so\n\nhad been in charge\n\nMeredith admits this!\n\nThere is nothing for me to do now, but waitdevelopments.\n\nThe Brigadier Onslow & Col Arnott are most annoyed at my treatment, but have advised me to stand by & wait events which I will do.\n\nPoor Zara is very upset too & the position is most difficult in every way. One would imagine such a state of affairs was impossible after making all the sacrifices I have done.\n\nCol Meredith now finds he has too many officers & it is necessary for some of us to go. I have just been thrown from a horse & the excuse is I am not efficient as a rider & he wishes me to resign, but I wont. However the same result is achieved & I have to go. I need hardlysay how upset I am at the great injustice which has been done to me\n\nAll agree with me in the Regiment, but there is no appeal.\n\nI have been placed in a very awkward position which would not have arisen if Onslow\n\nSuffice it to say that Colonel Meredith rejected me from the st Regt having to get some of his own officers in, as there was not room for all. I had the bad luck to bee thrown off a very fresh & unmanageable horse & this was the excuse.\n\nBad luck seemed to follow me after that & I was in Camp for 3 months with various Units & doing lots of work for v little pay, but in the end I did some good & thank heavens\n\nit has turned out all for the best for now I am assured of my promotion & I am with Colonel Arnott & Major Onslow two of my own Brigade & men who understand me which Col Meredith never did. How I have suffered all these months from all all sorts of petty & other anxieties.\n\nMy darling little Wife has given me great encouragement & help, when things have seemed to go wrong.\n\nMy experience has been a splendid one & what\n\n\n\nsplendid loyalty I have had during this time. The men have been ready to fo anything\nfor me\n& go anywhere for me at all times.\n\nThese men will give a great account of themselves when the day comes, but what of their training! The simply absorb the details as they are given, but the equipment is so slow in coming in & there is so much to do. The men are full of enthusiasm for the work.\n\nThe horses generally are a good lot &\n\n\n\nwill even up greatly as time goes on\n\nThe officers are a fine lot too. of course none of them have had much experience, but they are keen & intelligent. Better fellows one could not meet.\n\nIt is curious to observe the growth of Regiment. First there a single officer who has not bee able to get into a Regiment already established,& he is given charge of some men who are in the same position as himself then more come in from Barracks & more officers:\n\n\n\nSome one voluteers for the job of quartermaster & then tents & men & officers join from day to day . One day a C.O is appointed & then things begin to move more rapidly The officers have to be chosen & \nsome\nso many apply that the task is a most difficult one. The red tape & conditions are in many case very arbitrary & many good men are lost & either drop out or go and volunteer elsewhere. Lots go to England at once.\n\nCol. Arnott is now the C.O of the","18":" L H Regt A.I.F & he is doing his best to organize his Regiment on the best lines, but the task is indeed a great one. It is difficult to say who is to blame for the state of things but it nearly breaks one's heart to see things as they are.\n\nNo rifles or bombs & we are within a few days of sailing.The men are entirely raw & green & know absolutely nothing.\n\nI have been given 2 M. Guns 20 years\n\nold! It is almost incredible & the public know nothing of all this & even if they did they would not believe it.Perhaps they will some day! You can never tell.\n\nOn the","19":" we had to report to a L. H School under Major Holman at the Agricultural Ground & work commencedthere in earnest. I did not mind that, especially as I was able to get home every night & be with those who are so dear\n\n\n\nto me. I have arranged all my affairs & have had long talks & conferences with Mr Moses who poor old fellow is devoted to my interests.Weaver too is very good, but he is careless & cannot,I am sorry to say.\n\nThe Colonel wants me to be","20":"in Command of a Squadron but now he has just as suddenly detailed me to M. G. work again & he has taken off a man who I believe to be a first class man at the job.\n\nHe is a Duntroon man & very smart but the Colonel has a rooted objection to the these Duntroon fellows: Goodness knows why!\n\nOne day the Colonel appeared at the School & we now know that it will not be very long before we have to go back to Camp; in the mean time we are entirely out of touch with the Regiment & there has been so much organization to do. When we return to the Regiment it will be like caos \n\nI have seen all the family.\n\nThis War has drawn us all together tremendously & I think they have all learnt or tried to understand me better than before. I confess I have been a problemfor some of them!\n\nAs for Zara & the children they have been nearer & dearer to me every day & as the time approaches for my departure the days are all too short\n\nAt last we have to leave on a definite day:€“ the","21":"December\n\nAre we ready to go. Absolutely No!\n\nIt is really disgraceful of the Authorities to send us away like this: We are most improperly equipped. The men are untrained & our horses have only come forward the last week€“ and yet we are supposed to be going to make War against the best organized forcethe World has seen. It will be murder for many of us, but what\n\nis to be done€“ Nothing!\n\nWords are impossible to describe the dreadful state of affairs & yet one must smile & smile& try to play the game all the time.\n\nI was at home on Sunday the","22":"of December for the last time.\n\nAll my spare\ntime\ndays the last 3 months have entirely been with Zara & the children & never a happier 3 months have I passed.There has been such splendid sympathy & understanding.\n\n\n\n\n\n\n\n\n\n\n\nMany of my Uniforms & equipment are incomplete, nor can they be before I go! And I have not been paid! Incredible, but true.\n\nZara & the children came up to Camp on Wednesday & we all had tea in the open together.Zara packed up for me for tomorrow we leave Camp by Road for Sydney. My horses have been chosen & a nice three they are€“ Suttor helped me€“ he is a good fellow & we are the best friends.\n\nZara & the Children left by Car at 10 PM & were kindly driven down by Bruce Arnott all the way. The dear children were so tired, but so good & I loved having themwith me. The wrench between duty & my love for them is indeed a great one, but it has got to be seen through now & please goodness I will return to them full of maturity & experience.\n\nI wonder what the future has in store!\n\nI rang up Zara & she was very well, but disappointed I would not see her tonight, as I had hoped.\n\nWe left Camp at Holdsworthy at 3 PM on the","23":"\n\nWe arrived \nat Strathfieldat 6 PM\nat Colonel Arnotts Strathfield house 6 PM to bivouac. I slept by the telephone all night, as a consequence I had one hour's sleep.\nall night.\nThe men were very cheerful for it rained in the night. They are indeed a good lot of fellows.\n\nThe Colonel had a very nice dinner for us & Mrs Arnott was very kind. We were up at 4 am & left there at 5 am & we got to the boat at\n\n7.45 am. I should have been there 3 hours earlier, but the blocks were greasy & the horses were green, so I which I did.\n\nThe horses & men were embarked by 11.\n\nZara the children were not allowed on the Wharf till we were cast off & the planks were up.\n\nThe poor things suffered terribly & so did I. I simply could not speak at all, but it had to be gone through, as part of the job.\n\nWhen on submits to the conditions of active service it is no bed of roses & that is the end of it.\n\nThe parting between those who are the dearest to me in the world is too great & sacred for me to say all I feel & I could not if I wished\n\nZara came out while we were in the stream but Icould only see her for a few minutes, as I was on duty all the time€“ having been appointed Adjutant. to the ship.\n\nI have been through so much all day that my brain was dull & heavy to night & I could not suffer any more€“ all I know is that my wife & children were constantly in my thoughts.\n\nGodhelp them & preserve them tillI return is my fervent prayer & in God do I implicitly trust.\n\nWe left at 6 am & I never saw them again although I had hoped we would not leave till 9 am & then I should have done soas Zara would have got a\n\na launch & come off.\n\nSuttor who was detailed for Duty tried\n\nColonel Arnott missed the boat! What a state the poor fellow must be in.\n\nWe have now been at sea for 3 days. No wireless of any kind is allowed & we are entirely cut off from the world.\n\nWe expect in afew days to be in Freemantle\n\nThe sea has been remarkably calm I have been ill a little, but I have not been as bad as I thought.\n\nThe horses too are standing the strain splendidly, although some of the poor brutes are suffering keenly.\n\nEveryone on the ship is very kind& nothing is too much trouble for the ships company.\n\nI have as Adjutant but I do not mind this, as it keeps my mind well occupied.\n\nI did notsee Eric or Stella on the wharf before I left, but ZaraDoy & Geof Gladys, Vera, Debbie Zil, Arthur Peel & others were there\n\n\n","24":"\n\nToday I have felt as fit as a fiddle€“ it is rough too. I can hardly believe myself. I am eating 3 meals a day & hardly feel the rocking motion at all.\n\nOf course I am busy all day & have much to occupy my mind. Nothing of real importance occurred. A report got round the ship that Britain had met with another disaster€“ there was nothing in it at all. They call it \"Latrine\n\nwireless\" & an excellent name too! I have publishedin orders that if any news arrives the men will know.\n\nThe job of Adjutant suits me well€“ Onslow is such a fine fellow & so easy to get on with.Altogether we are a happy lot here.\n\nThe men cleaned out stables all the morning & exercised the horses & in the afternoon all the saddlery was taken out & sorted & cleaned.\n\nRather a big job, but a so necessary one.\n\nThe men appreciate the splendid food they are having after the Camp cooking which is so much rougher\n\nThey are a jolly lot, but I do wish they were better trained & equipped but it is to be hoped they will be before they are allowed to take the field.\n","25":"\n\nWe arrived in Fremantle on Saturday night after a remarkably fine trip from Sydney. We never lost a horse & I was only ill one day.\n\nEveryone on board most friendly & we are a happy ships Company.\n\nWe are not allowed to use the Wireless at all except for Urgent Messages. Onslow is an excellent fellow to get on with.\n\nI find the work as Adjutant keeps me busy & is very congenial\n\nOn Sunday we drew up at the Wharf & Onslow & I landed & went up to the Barracks. Everyone received us well & are most anxious to do all they can for us.\n\nFreemantle is a flat dusty town of 25000 people.\n\nSpoke to Dorris Rosenstam & Nellie Blaine. They were very surprised to learn I was there. Will see them later if possible.\n","26":"\n\nMet some of the 10th L H officersin Perth & them a fine lot.\n\nTook 3 of them to dinner with me to Freemantleas I was up at Perth to-day. A very pretty town & the people I have met seem a large openhearted lot.\n\nSaw GeorgeJoseph. He is not doing too well & I hear his wife is giving him a lot of trouble.\n\nWired to Zara every day & finally got 2 telegrams from her in reply. The dear\n\nlittle girl & the children are well. May God protect them while I am away! I cannot think too much about how much it haunts me to leave them, but I have done the right thing & I am satisfied with that.\n\nThe","27":"officers had us to dinner at their Club tonight & then to the Theatre afterwards. They were most hospitable & we had a good evening.\n\nWent to see Dorris & Nellie this afternoon & had a happy hour with them.\n\nThe home is a fine one & Dorris' two children dear little girls.\n\nAltogether I was impressed with the possibilities of Perth.\n\nWe left Freemantleon the","28":"","29":" There were a few people on the Wharf to wish the troops off but there were no restrictions against the troops such as there were in Sydney.\n\nGeorge Joseph came down to the ship, but I had a very busy day & Iwas not able to give him any time at all.\n\nThe horses were Shipped quietly & without any hitch or confusion.\n\nWe lost 5 deserters at Freemantle\n\nWe left exactly at 5.30 PM & sailed S.W in order to meet the rest of the Convoy coming from Albany. Expect to pick them up next day.\n\nFelt ill & squeamish, but I have still lots to do\n","30":"\n\nSeveral CourtMartialsto be held & I have to work them all up myself€“ it is an interesting experience.\n\nTwo N.CO have to be reduced for leaving the ship without leave\n\n& being drunk. The work was done with all solemnity & with every care that the prisoners recd every thing in their favor. Both were convicted & it seems to have produced a salutary effect on the ship's discipline, which however has always been good.\n\nPicked up the rest of the Convoy€“ about 18 ships to day A most interesting & historical event.\n\nWonderful how they have formed line€“ there are three with us \n\nThe little Submarine AC2 hovers all round & as our escort We are","31":"in the lead of the Right Division. It is hard to distinguish others on the ships, but I have seen several of the officers of the","32":"L H who I know.\n\nThe signaling between the ships is done most effectively both by flags & lights€“ the wireless is not used owing to the possibility of the E being near.\n\nIt is interesting to think what would happen if he did come. We\n\nbelieve other escorts are all round us doing their job.\n\nAt night the sight of the ships in line in mid ocean is most impressive.\n\nDay & night€“ it is just the same Something quite different to what one has ever seen before. The Submarine steams under her own all the time & easily on the surface can go 16 Knots an hour\n\nThe CO of the AMC has typhoid & we have signalledfor a female nurse on the Convoy but there is none in all the ships\n\nTomorrow Colonel Beeston comes to the ship to see what can be done with the case.\n","33":" This morning Colonel Beestonrowed over in mid ocean from the Berrima. The whole Convoy had to stop & the sight & event was most interesting.\n\nAll the ships had to slew round & await the order to go ahead. It took fully an hour to accomplish the\n\nobject.\n\nMajor Onslow has written very decently to the Minister of Defence about me. There has been no occasion, I have simplytried to do my duty.\nall the time\n\nI am feeling ever so much better.\n\nReceived a parcel of books: they must be from Myers, but no card came with them. I will write to him anyhow.\n\nI am now on the Indian ocean for the first time. We expect to see Colombo in a week.\n\n\n\n\n\nI wonder how my dear ones are indeed!\n","34":"\n\nHave paid all the men 1\/- per day for 20 days. This is the rule for Troops on Board Ship\n\nTerribly hot & the horses & all of us are suffering a good deal.\n\nHad some gramaphone the other night€“ it was a beautiful evening & with the lighted transports all round the scene was most romantic.\n","35":"\n\nLast night as we were going to Messa message came through from the Flagship that Duncan Campbell a NZ trooper had died & that he would receive a Military Funeral at 8 PM. Major Onslow & I announced the fact to the Troops & at once a gloomsettled down on the ship At the apptd hour all the fleet stopped & it was indeed a solemn moment to see all these ships in mid\n\nOcean pay their last respect to a soldier who 14 or 15 thousands of them never knew but who at the same time was one of themselves.\n\nWe all wondered what were the actual feelings of those men on the death boat the lights of which we could see flickering a mile away. This was the \nfirst\nsecond death on record amongst us. It is sad to think his people are in ignorance & must be for some time to come\n","36":"\n\nWe had a humorous day with sports, half of which we could only finish, as the management was\nnot good\nindifferent this was to celebrate crossing the Line this morning.\n\nLater we received notice that another man had died on another boat & his burial would be at 6 PM with Naval honors. I went on the bridge & watched the body being committed to the deep€“ it was indeed another solemn moment. The fleet stopped for 10 minutes & then on\n\n\n\nagain at full speed€“ we expect to be in Colombo tomorrow and so everything passes.\n","37":"\n\nWe arrived at Colombo early to-day & anchored in the inner harbor.We are to stay there 24 hours at the most.The ship is anchored 2 miles at least from the shore & the row in is rather trying on a choppy sea.\n\nI had to go off to send cables & to attend to other business & had not much time to look round as I had to return for dutyat 5 PM to allow Onslow to go off to dinner. I rowed out alone with two niggers who sang\n\nto keep up their spirits as they rowed in the heat.\n\nThe town was most interesting to me in the short glimpse I had of it but I am in hopes of seeing something more of the place tomorrow.\n\nFirst paid a visit to Flagship with Onslow & saw B\/Major. This ship is most elaborately fitted & I sawmany fellows I knew on board€“ amongst them was Shellshear, who could not reveal his joke, but I gipped him about Colonel Beeston& his & this quietened him at once. Everything was bustle & activity\n\nthere.\n\nI had charge of ship tonight & the way the coolies worked all night was most interesting to me. They are indeed a most fascinating people & every phase of life absorbed byme €“It was so entirely new.\n","38":"\n\nThree other officers & myself got away earlyto day & we went round the town & its outskirts in a Car. We had breakfast at the famous Gall Face\n\nHotel,then for a ride in a rickshaw\n\nWe went through thenative quarter & the the markets & then back to town. I bought dear Zara some blouses & a kimono\n\nI sent her a cable & wrote her three long letters. Other letters & post cards to others. I was in hopes of receiving a reply to my cable, but alas I did not\n\nIt is now a month since I left them all & how long it seems! I do wishindeed I could hear\n\n\n\nfrom\nZara\nhome, but I suppose it is not to be. I do miss them terribly & they are ever in my thoughts\n\nI do hope she receives safely my small gift.\n\nI spent a most interesting½ day in Colombo & came away well satisfied with my experience. How Zara would love it all. It would appeal to her absolutely on all its phases, but a week would be enough I think really\n","39":"\n\nWe left Colombo at 9 am on Friday.\n\nTonight there was a real scare. About 9 PM a signal came through that the Enemy had been sighted.\n\nI went up on the Bridge & another signal came through what we were to do in case we were attacked. I was kept going till the small hours putting out lights etc. As I stood on the Bridge every minute expecting an attack my thoughts were full &strange, but nothing happened after all, but the mental phrase & anxiety were there just the same\n\nThe ship steaming through the night with signals by Morse passing and re-passing was weird \n& absorbing\n€“ I will never forget the experience. The Submarine had its orders to attack at once. The fleet were to scatter & assemble at a point named.\n\nOur course has been changed twice since the scare & we are now proceeding up the Indian Coast on the West & we have no idea yet where were are going to finally land.\n\nIn Colombo the town houses of the chief residents are ideal Wide Halls, Lawns & fine gardens everywhere.\n\nThe labor trouble is resolved there, The Cingalese are splendid servants.\n\nI have never seen anything like the smartness of the clerks in the Telegraph office & they were all natives too. They could give our fellows in Australia many points.\n","40":"\n\nAnother death on the Themistocles€“ this is the 5thdeath at Sea€“ 4 being on the one ship alone.\n\nOnslow not at all well & he has a high temperature.\n\nDe Low removed from the command of the Transport A35. He certainly is a most peculiar fellow & I can understand anything happening to him.\n\nOf course I got no reply to my cable at Colombo at it is now nearly a month since I heard from home€“ most trying, but it is just what I knew it would be, so I must not complain\n\nI suffer a good deal with this wretched nausea & it so unfits one for work.\n\nI have a very poor batman I lost Reid under peculiar circumstances & another officer has got him now. Reid went to quarantine for about 2 months & wanted\n\nhis discharge: in the meantime I had to ger another man & Reid not getting his discharge another officer then took him on.\n\nI dont think I mentioned that I got my promotion as from the 16thDec 1914. I am now","41":"in Command of B Squadron: I was temporarily in command only of the M.G Section but did my best to put everything in good shape & order there to again hand it over to the officer €“Thorne who succeeded me.\n\nThere was little doubt from my observation on the Flagship€“ Ulysses that the officers there were by no means pulling together\n\nThe two Doctors€“ Finn & Kenny are hard citizens€“ one has just said he was going to take a mans horse when he got killed & he meant it too. These Doctors care as much about others as their dam instruments do. They rejoice in cutting up & looking after themselves! Curiouslythey are not bad fellows & one gets a lot of fun out of them on the whole,\n\nWe are now off the Coast (West) of India steering in the direction of Aden\n\nWe are keeping well out of the beaten track, in case there should be any of the Enemy's stray cruisers round.\n","42":"\n\nTwo more men died at sea to-day. This is the","43":"from the Themistocles& the sports had to be suspended while the funerals were proceeding.\n","44":"\n\nReported at noon that a strange cruiser was on the starboard bow. It was some time before we could make her out & not before the submarine was sent off at full speed to investigate€“ a very interesting interlude. It turned out the cruiser was one of the\n\n\n\nRoyal Indian Marine with troops on board going in the direction of Aden. She must have thought also we were a strange sight.\n\nThe Wireless has caught a message from the Japanese Flagship 40 miles away that Suez is being attacked by the Turks. The Flagship is the Fujiyama.\n","45":"\n\nHad some fun to-day. Kenny the M.O. told the troops not to obey my order to wear Cholera Belts, as he did not believe in them. I pretended to make a lot out of this & got Onslow to agree to send a message to Col. Beeston P.M.O asking for instructions in view that ships orders had been held up to ridicule. I went up to the Bridge & did the thing in regular style€“ all except sending the message!\n\nKenny believed I had done it all right & we had a good laugh.\n\nThere is a tremendous expenditure of water on board (at least 50 tons per day are being used) by the 376 men & 285 horses.\n\nOnslow is better again & has escaped what seemed a certain case of typhoid. This is a great relief to me & to all concerned. He is really a fine fellow.\n\nWe have now lost 4 horses & we are nearing Aden where we hope to be at noon tomorrow.\n\nNo one is to land & mails are to be sent off\n\nby the Ulysses. I will only send dear little Zara a postcard, as this is the only chance of her getting the communication quickly. I wonder how she & the children are!\n\nWe keep up a regular supply of men in the Hospital€“ all sorts of accidents happen to men & the Drs keep very busy always. Last night one man's hammock dropped off the hook & he hurt his head & back on the end of the table.\n\nWe certainly have been a long time at sea€“ 5 weeks to-day€“ a week Sydney to Freemantle€“ a fortnight between Freemantle & Colombo & a week between Colombo & Aden. We stopped 1 week at Freemantle.\n\nAm working up F. S Rep, but it is really very difficult to do any solid reading on board & I thought I could do so much too, before I started.\n\nIt is possible we may be fighting the Turks in a fortnight.\n","46":"\n\nWe arrived at Aden at 10. am. The Ayrshire was 30 or 40 miles behind, but there were 17 ships in the Convoy & it was a fine sight when they all dropped anchor together. Aden itself is something quite different to any place in Australia. The headland was desolate & barren & the great range of Hills called BehelNansam was most precipitous€“ the highest point being 1726' high. On the top of one was a flag station, & on another\n\nwas a Turkish Fort. A few Somalis came out to trade, as we were really anchored right outside the outer harbor.\n\nI had to go off to the Flagship on military work in the ship's boat & I admit at once, although it was an interesting experience, it was also a dangerous one€“ the Captain of the ship said afterwards he ought not to have let me go. I had to jump into the boat as she came up on a wave &\nthe\na big sea was\n\nrunning.\nwas a very big one indeed\nWhen I got to the Ulysses I had to climb up a ladder to get on board & down again to come back again. I felt very tossed up when I got back to the ship, but \"cracked hardy\" all the time & so did Suttor who did not feel too well either.\n\nI met the Brigadierin charge of the Convoy Colonel Monash€“ a Jew€“ & he seemed a very decent fellow. I also had a long talk to Shellshearwho gave me the latest news, but there was\n\nnone of outside events: we are all very disappointed at being so much cut off from the outside world, when so much is happening in it.\n\nI also met some of my old friends of the 13thBattalion who all seemed glad to see me.\n\nOnslow is still not too well & I am a little anxious about him.\n\nI got a telegram from my darling Wife which had not reached me at Freemantle€“ it was to congratulate me on\n\n\n\nmy promotion€“ I only wish I could hear how the 3 of them were & Shellshear said the same to me to-day.\n\nNothing of any importance in Convoy orders which were forwarded to-day.\n\nWe are still a very happy lot on board & quite contrary to what they are on the Flagship, so I hear.\n\nWe sailed at 5 PM from Aden€“ no one was allowed on shore.\n\nAll we could see of the habitations were Barracks & guns.\n\nThere seems to be very extensive military accomodation for this other outpost of the Empire.\n\nWe caught up with the Persic, the Suevic& the Ceramic which had left us one day before we got to Colombo. We have no idea of the reason of their going.\n\nShellshear said that they all had great respect for Monashon board & that he was a very able man.\n\nI sent Postcards from here€“ Aden€“ to all at home. They will all be censored & sent from Port Said at the earliest.\n\nThey have a great crowd of officers on board the Flagship. They wear Khaki trousers & white shirts & stars on their shoulders!\n","47":"€“ Sunday.\n\nChurch service for R.Cs at 6.45 am and for C of Es at 11. AM\n\nPassed two P & O Liners €“one going to Australia & the other to Japan. Both ships saluted the Convoy. Truly wish I had been able to send a few messages home by the former.\n\nWe are in the Red Sea & every place now is full of interest & association.\n\nI got up at 2.30 am to see the lights of Persia\n\nThen there were other lights in the red Sea likely carried on by Turkey, but now occupied by Britain as part of the spoils of War.\n\nWe passed more ships to day than on all the other days of the voyage€“ now 5 weeks€“ put together. Amongst them was a fast converted Canadian (C. P. S.) Cruiser patrolling this portion of the sea & going along at a great rate. She signalled good luck to the Convoy€“ a man died\n\non the Ceramic to-day. The 3 White Star Boats are again with us & in line on the port Division.\n\nCuriously the sea has been rougher here than anywhere else so far & it is the Red Sea!\n\nMy dear ones are constantly in my thoughts & I do wish I could hear how they are, but I have to grin & bear it.\n","48":" Anniversary Dayin N.SW & I forgot all about it till the day was nearly over.\n\nWe€“ our ship€“ I mean have fallen out of our Estate, as a Black Germanhas pushed us out of position & got in front of us in the Line. We are using Bengal Coal & this partly accounts for the trouble.\n\nHow the Captain cursed & we all felt being beaten very much.\n\nNews of a British \n\nVictory on the North Sea has just reached us.\n\nOnslow is not at all well€“ I rubbed him last night. I feel & we all do€“ very anxious about him.\n\nI have now quite settled down to the work of the Adjutant & would not mind taking on the Regiment after my experience.\n\nVery angry with Suttor for his irresponsible ways & I gave Hession a doing tonight also\n\nKenny the M O also made me very annoyed & altogether I had a trying day.\n\nWe are nearing Suez The Sea is very calm. I have no batman & have others looking after me€“ this on account of being transfered back to B. Squadron\n","49":"\n\nWe have broken down in the small hours & are now about 30 miles behind the restof the Convoy with the exception\n\nof the \"Ayrshire\" which does not count€“ a great disappointment.\n\nAnother important incident is that the troops have been accused of stealing Ships Stores€“ the allegation was of the Chief Steward. It fellthrough completely& we are now waiting for the Captains apology in writing.It appearsthe Chief Steward has been selling the liquor to our troops & now to cover up the deficiency he has blamed the troops for stealing the amount. We. have\n\njamed Courtof Enquiry & K. R's downthe Captains throat & he is shivering in this shoes. We have been most serious in our manner & altogether we have had a rare old lark.\n\nThe Chief officer is enjoying the fun too for he is deadly opposed to the Captain.\n\nEarly this afternoon we got among small Islands on the red sea & then on to the Sinai peninsular with the Mn in the\n\n\n\ndistance. They ranged up to nearly 8000' & were a fine sight. I saw the place where the Jews were supposed to have crossed the Red Sea & as I stood on the Bridge & gazed into the desert foreshores& the Mountains behind my mind was full of all sorts of thoughts of the days in the distant past.\n\nWe are still behind the rest of the Convoy.\n\nWe presented the Prize Money this afternoon\nfor\nwon on the 11thinst\n\n&","50":"inst. Not many ships have been passed today.\n\nI find the Uniforms made by R. Reid & Co are absolutely disgraceful.\n\nWestons groom had 40 odd beersin Freemantle!\n\nHad some good lessons in Knot tying to-day. & I had some fun trying afterwards to demonstrwhat i could do & I could not!\n\nThe A. M. C. won the tug of war.\n\nWe are now getting into the first lot of cold weather.\n\nand the effect is very strange after the extreme heat.\n","51":" We met the Convoy at 4 am at Suez€“ a beautiful sight in the early morning.\n\nWe anchored here all day. I made 2 visits to the Ulysses on official business & met a lot of officers. I had tea with Col. Beeston & sent \nthem\nhome two three postcards\nhome\n. They will not however be posted till Port Said, although it is quite\n\neasy for the Military Authorities to deal with them at once€“ this is a way they have in the Army!\n\nCol Beeston is a fine little fellow & we quite enjoyed his association while he was on board with us. He told me to-day he fell into the water, boarding the Themistocles at Aden€“ this was the same day as my own roughexperience. He was nearly drowned, but was pulled on board by the seat of his pants. This is the ship on which all the deaths have\n\noccured€“ he told me the M.O. had his tail down completely, everything was doing wellbut that he had now put an end to the trouble.\n\nBice is on board the Ulysses suffering with an appendix, but has not been operated on yet€“ I don't quite like Bice& he doesn't understand me.\n\nSuez is a large town & very busy at present.\n\nThe NZ troops have landed here.\n\nWord & orders have just reached us of the misbehaviour of\n\nthe troops in Cairo of the 1stDivision & that all leave was going now to be refused to us. This is how the actions of a few affect the many. Most damnable & we are much annoyed.\n\nThere is little doubt after looking round the various ships we are very comfortable here, although the other boats are more luxurious.\n\nThe sea is as calm as a milk pond here & all the Transports lighted up made a beautiful\n\nsight.\n\nNews just received that there has been fighting up the Canal 4 miles from here & we have our bridge sandbagged with a M. G, also in readiness. We also have an armed Guard for emergencies.\n\nOnslow is better.\n\nSaw Col.Monashto-day.\n\nMy two horses keep well€“ I have still one to to chose from B Squadron.\n\nI can't realize that I am at Suez. It will be so strange to talk of all these experiences if ever I get back.\n\nCol. Beeston told me that he had more experience during this voyage than during the whole of his life before & I can well understand it.\n\nKenny has \"gone off\". I don't quite trust him now€“ he is too irresponsible & bloodlike . You can seldom him to do anything correctly & he is a terrible loafer in many military ways, You have to live with a man to know him.\n\nI have settled with Kenny€“ he was under a misapprehension & everything\n\nis now all right between us€“ I told him this was not the time for misunderstandings & he was pleased I spoke about the matter.\n","52":" Weston & Kenny went on to the Ayrshire last night. Things are from happy over there & they have given us all the prestentconcern.\n\nThe Colonel seems to have done nothing except harass all his officers & there is no loyalty at all. Onslow is much upset & so are we all, but we are determined to pull together & remedy things, when we\n\nland. Westons description of his experience was most amusing, although it had its serious side. He had to go & come back in a \"bum\" boat. The Arabs were funny fellows & the noblers of whisky we gave them when they got back would have killed most men, but they drank them right off.\n\nToday we started for Suez at 10 am. We were","53":"in the order of the procession of ships. We are advised that we may have some\n\n\n\nfighting or rather that the Turks are not faraway& are likely to fire on us. We have therefore protected the Bridge with Bags & Bales & mounted the MG on the forward deck.\n\nWhat a day of interestit has been. We got into the Canal people cheering us at Suez as we passed there. Then row after row of entrenchments on both sides of the Canal€“ they were beautifully made & were manned by Gurkas , Sikhs, Punjabis, N Z Troops & Britishers, all\n\ncheered us as we passed in turn. We could speak& signal to many.\n\nThen we passed Warship after Warship &\nstood\nthe Guard presented arms. There was much cheering& enthusiasm shown & the kinship was strong.\n\nAt 3.30 PM we pulled up€“½ the Convoy€“ & anchored for the night. At this point 7000 Turks were seen a day or so ago. We will move if they fire on us & a French War\n\nship is standing by in case of trouble.\n\nIt was my decision to mount the Gun & every boat did the same, so I was pleased I had suggested the idea.\n\nMails close for Port Said tomorrow & I have written a long letter to my dear little Girl with a lot of Post cards & loving hope she gets them safely.\n\nTonight we pulled up in the Big Bitter Lake. What a beautiful night! but very cold on the water.\n","54":"\n\nTo-day we started into the Canal again & almost at once we came upon scores of guards of Gurkas, Sikhs with splendidly fortified post. They were just perfectly constructing exactly as they are laid down in the Books. We saw young striplings of Englishmen in command.\n\nWhat splendid fellows these Indian troops are & how proud men must be to lead them & I will bet they go anywhere.\n\nEvery yard was of interest.\n\nN Z Troops & others from S. A were there too & made a good show.\n\nAbout 10 or 11 we all got right into it just before we came to Ishmalia €“ another place of interest & where the Khedive has a summer residence. There were many troops there too.\n\nAbout 11 am we saw some patrols comingin retiring one at a time & all the trenches being manned & with other troops in reserve. There seemed to be hundreds of mounted troops\n\ncoming in to the attack & there was a little excitement. We mounted the M. Gun, & put the men into the lying firing position & all was eagerness & keeness for a scrap. It was a splendid\nlittle\nexperience& one that one of us will never forget. All the details of the trenches, barbed wire entanglements & fortified houses were perfectly built according to the Rules as laid down. Even the horses and camels of which we saw numbers\n\nwere entrenched, so were the living tents of the officers & men.\n\nWe heard tonight that one British & officerhad been killed coming in at night after their aeroplane had broken down.\n\nIt was really most exciting seeing these hundreds of horsemen bearing down on us & the Patrols coming in. This was the first taste of the very real thing.\n\nThe expressions on some of the men's faces were extraordinary€“ most of us laughed,\n\nsuppose for want of something else to do.\n\nI know I felt quite calm & elated with a fearful spirit of fight & aggression predominant. Quite a different feeling to any I have ever really experienced before. Any moment any of us might have been right into it & it really is hard or even another obliged when you are moving as we were on the Canal all the time\n\nWe would dearly loved\n\nto have stopped & had a proper scrap.\n\nWe passed several men of War & we turned out the Guard& saluted with present arms.\n\nThe \"Swiftsure\" & \"Ocean\" were two of the largest vessels & it helped one to realize England's power of Empire.\n\nThe Admiral on the first named turned out & returned our salute. As close were, we could have almost jumped on to her decks\n\nHow some of these experiences must open the eyes of the boys from outback.\n\nI must say at once to-day's experiences were some of the most interesting of my life.\n\nAlthough no under fire actually I can say that it might have been opened any minute€“ and the feeling is one of excitement & exhilaration rather than otherwise.\n\nI suppose this is occasioned by reason of the fact that it seemed some of winding up to our long voyage & it seemed in the nature of things.\n\nWe got to Port Said about 8 pm. Suttor, Kenny, Finn Weston & I went off on leave to see the sights of the town & we saw\nsome\nof them.\n\nIt certainly is one of the worst places in the world, Everywhere one is the flamboyant cry & everything & anything\n\nis done if you pay for it.\n\nHotels keep open all night & the shops will do the same if you want them to!\n\nAll dress here as Egyptians with the Fez etc.\n\nI sent a long letter to Zara by the Pilot who was a very pleasant Frenchman with a low refined voice & full of pessimism as to the result of the War.\n\nA Lot of the men broke leave here, but none got drunk€“ all returned in the small hours & were placed\n\nunder open arrest for trial next day.\n\nThe Colonel came on board the next day. He is very very jumpy & he is giving us a lot of anxiety. Onslow & all of us cannot understand his ways & manners at all\n\nSomething heavy is on his mind. We are all much concerned for he is one of the best fellows in the world. He is very thin & worn.\n\nThe boat had many bum boats round it with people selling all sorts of\n\nthings, & musical honors.\n\nEvery minute was full of interest.\n\nThe men & women coal here & it is wonderful the work they do€“ nothing like it have I seen anywhere. They are merely like flies on a plank.\n\nSaw one or two officers Hogue & others from the Suevic.\n\nBeautifully cool weather of course this is winter.\n\nHeard to day the attackwe saw yesterday ended in 5 NZ & 30 or 40 Lancashires being killed,\n\nWe seem to have now\n\nlost touch with AE2.\n\nLeft Port Said at 3 PM. A beautifully calm trip to Alexandria where we arrived at 6 am on the","55":"\n\n\"Bum\" boats all round us in a few minutes & the place seems a big one from the boat view.\n\nHad a Court Martial yesterday. I was Prosecutor. The prisonerpleaded guilty & was fined £2 for leaving the ship without permission.\n\nKenny & I had a passage\n\nat arms€“ he being one of the Court. Suttor presided & Stephenson was the other member.\n\nOnslow is better.\n\nThe situation at the front grows no better nor is there anything new to chronicle.\n\nWe feel we are now getting into touch with the real world of things, but I cannot realize I am so very far away from my dear ones & from Australia.\n\nWent off to the Ulysses with Onslow, but all the Staff had gone on by train the night before.\n\nWe then went to the Ayrshire & saw Col Arnott & others, but I must confess I have many misgivings about the future of the Regiment: I don't like Colonel Arnotts condition at all.\n\nSent a cable to Zara per Weston who when he returned with an account of his experiences was most amusing.\n\nWe also visited the Suevic & had some \"fiz\"€“ I have hardly drunk anything else except Champagne\n\nsince I have been on board.\n\nMet Verge, Oatley & Ryrie of the","56":"L H.\n\nThe first person I saw when I got up on deck was young Hill.Spoke to the Brigadier and Major Lynch. We tried to get leave for the men, but could not manage it.\n\nThe Coinage question is very difficult in all the new places & the language barrier is also very great. French is spoken here generally\n\nThis place is one of the oldest in the world The harbor is full of\n\ncaptured German's Ships.\n\nI saw Barney Somerville & had a yarn to him.\n\nI am told that the shops and streets are beautifully laid out & everything is done in the Hotels on the best lines.\n\nWe will probably go to Heliopolis by train tomorrow.\n\nWe came into the Wharf out of the stream at 5.30 PM Onslow had all the men fallen in & out them on their honor & granted general leave\n\ntill 10.15 PM\n\nHe placed a strong guard on. I went with young Asher who was acting as disemabarkation officer to see that the men returned in proper time. Asher lost his way on the wharves at about 11 PM & instead of seeing Alexandria I saw nothing at all. However the general night's experiences were interesting, but I had a bad fall on the wet cobble stones of the wharf.\n\nNext day 105 men left for Maadi at 10 30 am Therre was much to do get them\n\naway to time. Owens & Maulant got very drunk & were placed under arrest.\n\nWe are indeed very weak on N.C.O.\n\nThe next team left at 6.30 PM & we were able to clean up the ship beautifully.\n\nFelt very much having to say good bye to the Chief officer Captain & others€“ the next day the 3\/2\/15, but all these things have got to have some finality.\n\nWe slept on board the night of the","57":"Feby 1915 & slept in\n\ntoo, the first time for many weeks This was after the troops except the Rear Party had left.\n\nWe, Onslow & I had to see that everything was cleared right out of the ship in the way of stores equipment etc as a Certificate had to be given. We decided after this was done to have a few hours to ourselves in Alexandria, as we certainly had earned it. We left the ship at 1 PM. Then we drove to the\n\nHotel with a guard as we had to take away from the Fort3 prisoners of ours who had been arrested the night before.\n\nThen we dispatched the Guard & prisoners to Maadi, after which we had lunch, met Finn & Kenny & withthem for a most beautiful drive visited the Catacombs Pompeys Tomb & Pillar\n\nWords fail to describe the interest these places had for me\n","58":"\n\nBack for dinner at 8 PM. Then to a music hall showwhich was very poor. The morality of the City is very bad & the sexual relations are very flamboyant\n\nHow I wish I could hear from home & my darlings€“ this idea permeates everything I do & think.\n\nWe intended to do the \"wicked sights\" tonight, but were too tired & besides we had seen so much already.\n\nHad a beautifully comfortable night's rest in a bed for a change.\n\nWe had to leave Finn & Kenny behind here, as they were going to a different Camp. We were very sorry to part indeed.\n\nOnslow is a fine fellow to travel with & we get on famously.\n","59":"\n\nLeft for Cairo at 9 am & arrived there at 1.30 PM\n\nWent to Shepherds for instructions for G. O. C. Hdqr are there.\n\nSaw a Colonel on the Staff a very\n\nsmart fellow & he gave us all the information we wanted. We will have some lunch & leave for Maadi at 2.20. PM.\n\nArrived at Camp at 3 P.M. Had to walk through a very pretty suburb first of the same name alone. Then into the desert sand. This is indeed a new experience, but you get used to anything in time.\n\nI am camped with Rutledge & I wonder how we will get on together. He is aMajor & I his Captain &","60":"in command. I doubt if the experiment with him will be a success for he is very weak in his work & has rather lost himself with promotion, but I am determined to do all I can to help him & the Regiment.\n\nThe Colonel seems better in spirits, but he is still not too well. All seem so\n\nscared of him & there is no real sympathy between him & his officers€“ which is a bad thing for all concerned. I do hope Onslow will be able to right things€“ he is the only man who can & I know he means to try\n","61":" \n\nThe Camp is a very large one. I am still & have a lot to do arranging everything. So far we have everything very importantly arranged\n\nAn Arab Contractor&\n\nhis servants do everything by contract at so much per day.\n\nIt is extraordinary how these people fuel upour ideas & we theirs€“ I suppose it is a question of the dominant race.\n\nOn every side are matters & things which interest me\n\nI am sorry to say the Regimental officers are rather a mixed lot & there is not that cohesion & sympathy between us that one expects\n\n& works for. However I have Onslow Higgins & Suttor as friends & am content.\n\nI forsee trouble with Rutledge who is very unsound & bluffs his way through. However I endeavor to play the game with him, if he will let me, but he is difficult to get on with.\n\nThe people here are very friendly to us all. They are very kind & hospitable & have offered us baths whenever we\n\nwant them€“ this is a great boon after a day on the desert.\n","62":" \n\nReceived my Australia mail the latest letter was dated","63":" was dearest Zara.\n\nAll was well with them: she was very lonely & sad. The dear children also wrote me sweet little letters\n\nI got letters also from the other members of the family except Zillie. They were very kind to Zara after I left.\n\nThe letters brightened me up greatly.\n\nHave not yet decided whether to send for Zara & the children yet. Would dearly love to have them, but the question is not easy of solution movements & the fast approaching summer.\n\nSuttor & I are both exercised in our minds about the same matter. He wantsme to cable for Zara alone, but\n\nI will not hear of the idea.\n\nI feel 20 years younger since my letters arrived.\n","64":" 2 14 \n\nHave constantly been in Cairo. I am very laid up on account of the pay due not yet being paid. We are all the same. This treatment is very disgraceful & it is almost incredible thatwe should have been sent away without being paid these sums due€“ so many of the men have been\n\ntreated in the same manner & I feel very sorry for them & I have done all I can to remedy the matter.\n\nCairo is very bright at night. The Hotels are full of attractive women & men in Uniform these days. The scene is a brilliant one often & I only wish Zara was here to enjoy it too.\n\nPerhaps she will be later\n\nI met some very nice people named\n\n€“ having letters of introduction to them & N.Bentivitch from Jack Myers\n\nThey were rather cold at first, but as the evening progresses they all opened out. Bentivitch I have read of for years in the Jewish Chronicle. He is a lawyer & at once struck me as clever. the others are known here very well & are Bankers & consequently very wealthy.\n\nTheir home is a very large one & inter alia\n\n\n\nthey have a synagogue on the premises. I spent a very pleasant evening there.\n\ni also met on the same day a Mr Jessula who spoke 9 languages & is a resident here.I went roundthe town with him & he pointed our & explained many things.\n\nI also visited the synogue which is a splendid building & a fine piece of work inside I was introduced to the President€“ a certain\n\nPasha who invited me to call on him He has been a soldier & I may do this if I have time.\n\nLast week I visited the Pyramids & the Sphinx at Mena I climbed up Kheops & went inside to the various chambers. The whole experience was most interesting & I was absorbed in all its associations & splendor. They are most monumental works\n\nindeed. I shall forget having been there. One has little idea of the immensity of them all. The Climb up is hard one. Two Arabs pulled pushed & hauled me up. A magnificent view at the top. After we got down.\n\nI went through the passages to the Kings & Queens Chambers. These passages are on inclines& it would be impossible to get up & down them without assistance.\n\nof some kind. Already 2 Australian troops have been killed trying to go up or down & I can easily understand how this would happen.\n\nI have written very long letters to my darling wife & only hope all is well & that she will get them all right.\n\nPoor old Mr Moses is in my thoughts & I wonder how he is.\n\nThe Colonel seems better & things are proceding in a more even way.\n\nMet a Mrs Bentley. She had a type of red hair & she dressed in mauve, so I concluded she \"knew things\".\n\nIt is hard to realize when one sees so many people in Town that we are so near the theatre of War, but I feel certain that all these men who are enjoying life, will\n\ndo their job when the time comes & there is no reason why they should not have some \"play\" after a hard days work.\n\nHave met Generals Birdwood & Walker. Both fine men. Their methods are direct, but they are gentlemen all the time.\n\nHave not seen Kenny or Finn at all.\n\nMet Stokes at the Hotel. His wife was there. It is astonishing the number of officers wives who are here.\n\nI visited some Mosques, the Citadel some Indian soldiers who had been woundeddown the Canal & Tombs to day€“ Sunday.\n\nIn the morning came with me & in the afternoon Mrs Stokes,Mrs King (a pretty little woman just married)\n\n& Stokes. Altogether I had a good day.\n\nIn the evening, the Colonel Onslow & Suttor dined with me at the Continental. We had dinner the night before with Onslow, passed a good evening, as the wine was good. \"Fizz\" is a common thing these days, but I cant afford it myself. Onslow is always so kind & liberal.\n\nHad to do some official business this afternoon & we\n\n2 or 3 hundred of the Turks who had been captured on the Canal. They are a motley crew. They were captured in Kas-el Nil Barracks, an enormous place.\n\nThe wounded Indians brought home to one the stern realities of War. They are fine fellows, with no complaints One is compelled to feel more & more every day how small & insignificant he is.\n\nI have just been appointed Commander of the Brigade M Guns & it has appeared in Brigade & Regimental Orders. it is a big job & I feel the responsibility of the position very much indeed. Most fellows think it a a big thing. Onslow's Cousin from the Indian Army is at present helping me in the work of training. He is a fine fellow& quite young. He is on General Birdwoods staff.\n\nThis work takes me away from the Squadron a lot, but I am at present on its strength, although practically on the Staff. Things will probably develop on this behalf shortly & I am simply waiting events.\n\nI have seen Vernon, & many others of the","65":" L. H. They all seemed very pleased to see me & they are a fine lot of fellows. These days Cairo is indeed the meeting\n\nplace of Australians.\n","66":"\n\nI have been very slack in entering up this diary owing to being more or less busily engaged & having so much to do & think about.\n\nThe Brigade training took up a lot of time. I find Onslow of the","67":"Bengal Lancers who is assisting me & who is A.D.C. to General Birdwood a very fine fellow€“\n\nhe is like all the Onslows, so easy to get on with & he knows his job too.\n\nHad another visit from the General himself, but he is very quiet & watcheswithout worrying me at all€“ he soon sees things, as they are.\n","68":" \n\nVisited Sahara with a partyof fellows\n\nfrom the Brigade€“ about 15 guns in all We went through Memphis & several most interesting Mastabas & tombs. A great day for all of us. I am lost in wonder at the historical side to all & the time oh the time it all means. The day before I visited the Egyptian Museum Which I suppose is the richest in the world in ancient Egyptian antiquities I found that by going alone, I was able to do\n","69":"","70":" much\n& think so much better.\n\nI dined with Smith Edmonds & Kater at the St James Cafe & we afterwards spent the evening together & had a jolly time\n\nThe Colonel seems better, but still far from his real self€“ he is very & you never know whereyou have him.However on the whole I get on with him very well, but his condition does not make for the com-\n\npetency of the Regiment& it causes us all a lot of anxiety.\n\nOnslow feels the position keenly€“ in many ways he reminds me of poor fathers ways, just at the time when he was so worried & worn with mental anxieties.\n\nWe are getting used to the Desert, but takes a lot of getting used to all the same.\n\nThe other night Suttor & I were\n\nin town together. We were quite sober, but we had dined well! Missed the last tram & caught a motor out. We were very tired & the car broke down in Old Cairo. We did not bother but later were awakened by Chisholm & Hordern with a sentry standing over us. They had dashed by & seena Car on the road pulled up & came back. There we were fast asleep, but\n\nby Jove they were good Samaritans!\n\nHave cabled several times to Zara during the last few days. First advising her not to come on account of uncertainty; then position improved & I cabled her to come when I found so many other wives here.\n\nThe position got worse meantime & finally I cabled her to go to England. This she is now\n\ndoing but I am afraid I will not see her & I am terribly disappointed, but what can I do. We may leave any day now.\n\nShe will get letters from me at Colombo fondly advising her. I have written Oscar who will do all he can I know & meet her & the children on their arrival in London.\n\nIt will be fine for Zara having the trip€“ there is every\n\nreason for her doing so. She will feel she is no so far away, but Heavenknows it will be far enough.\n\nShe will realize her ambition & I hope will have a most enjoyable trip for she leaves tomorrow the","71":"\n\nI wish I were there to see her excitement bubble & happiness & I only trust she will have a good trip & may my\n\ndarling children also keep well. Mrs Suttor is\nkeeping\ncoming too.\n\nThe Guns are making progress.\n\nThings are indeed moving at present & already several Battalions have left Egypt.\n\nI think we are now to go to Turkey as the Dardanels are being forced & already are reduced by the Allied Fleet \n\nHad dinner with Broadbent last night.\n\nHow I have enjoyed the two mails I have received from home Thank God all is well with my dear ones & so are the Girls & Eric. \n\nWe are very short of officers€“ two are ill.\n\nI still find Rutledge difficult I have had it out with him &\n\nthings are better, but I am sorry to say I am afraid they will never be quite right. He is not fit for his job & altogether too young. I wish I had an older & experienced man over me. As I am with the Guns I do not see so much of him, but it gets me out of touch with the Squadron, which will be most unfortunate a service.\n\nHave just arranged a dinner for the N S W Mounted Rifles officers in Egypt about 16 in all to be held on the","72":" at the Continental.\n\nThe Hotels are very fine here & we have nothing like them in Australia\n\nSeveral however are closed up on account of the War.\n\nIt is most embarrassing the relationship between myself & Rutledge & I am most concerned about it. He is quite impossible so far as I am concerned. I don't know how it will end, but I must speak to Onslow & the Colonel about it soon€“ it cant go on.\n\nA was started here & we all gave 15\/- each. Anexcellent enterprise & it was astonishing\n\nquickly work was completed.\n\nI have just been elected on a sports Committee for the Brigade: they are to be held on the 6thinst.\n\nHave asked Mr & Mrs Perkinsto come to dinner afterwards at €“ The Continental.\n\nI am dying for some mails€“ the last letters from home were dated the 25 January 1915.\n","73":"\n\nLetter from Oscar dated the 18 Feby€“ nothing in it, but delighted to hear from him.\n","74":"\n\nCabled to Oscar to meet & arrange for Zara & children arriving on the 16th April.\n\nHave not been in to Cairo much lately. The truth is I have so little money€“ this business is most untoward & would have all been avoidable if I had been paid before I left Sydney by the D.P.M. Quite inexcusable treatment.\n\nWalker at 8 PM every Monday & Friday to discuss S. Regulations.\n\nThe Colonel seems better. Still carrying the load of his\n\nresponsibilities & he has a private worry I know which is not helping him€“ I am very sorry indeed for him for he is a fine fellow\n\nOn Sunday last we visited the Barrage. First the Colonel & I went to the Arabic Museum which is full of antiquities dating from the 10thto the 14thcenturies. This however is quite modern by the side of many things in Egypt. They have a fine English Catalogue to help one out of the maze\n\nI am still at work with the Guns. I wonder how we will get on when the real moment comes€“ sometimes I have many misgivings€“ the men however are a good lot.\n\nHaveordered a pair of Field Boots as an experiment.\n\nHave now made all arrangements with Cooks to store my baggage & have begun to considerthe cutting\n\ndown of all unnecessary things.\n\nHave a little Lieut Proudfoot of the Sikhs assisting me with the Guns€“ he knows his job but I dont like him very much€“ he is too taciturn for me & we have little in common. I liked Onslow A D.C to General Broadbent very much indeed & we got on famously.\n\n8\/3\/1\n\nWent out with the Squadron & did some hard horse work. This was the first time I had done this. Rutledge did not make matters too easy, but I am determined to play the gameby him.\n\nYoung Elliott of Duntroon College I had to siton to day pretty \n\nExpecting Australian mails in any day. My darlings have now been at sea\n\non the Medina for some days & how I wonder how they are!\n\nTelegraphed to Oscar ro look after them in case I should be suddenly called away & to feel they will have someone to look after them on their arrival in London. I expect his reply shortly.\n\nCannot give Zara any fresh news in my next letters to Colombo as to where we will be,\n\nThis is absolutely unknow, but I do think we are bound for Turkey€“ as the British Fleet are now concentrating on The Dardanelles, where some fine shooting is being done\n\nSome Australians have already left Egypt for an unknown destination. This is Colonal McLaghlans 2nd Inf. Brigade.\n\nThe desert sun & sand are very trying these days.\n","75":"\n\nWe\nhad\narranged a dinner by the officers of the N.SW M R in Egypt€“ 14 were present. Onslow presided & we had a jolly gathering at the Continental. Colonel Antill made a very good speech€“ he had only arrived from Australia that day.\n\nThe learning proceeds apace every day but I feel thereis so much for these fellows good mettle as they\n\nare to know.\n\nThe Guns are doing going well & every day shows some improvement.\n\nThere are many little matters which require more adjustments to settle, but somehow one does get through all right. Keep your head all the time is the great maxim in soldiering.\n\nGeneral Walker is a fine fellow & a leader A Round fair head with large luminous eyes, a square jaw & an uprightfigure. Very incisive & deliberate\n\nin his speech You feel he knows his job & what he saying to be true. He has a fine lot of ribbons.\n\nMost fit able & reasonable & one could follow him anywhere. He his certainly made of the stuff of successful generals.\n\n10\/3\/15\n\nI have at least 2 fine little horses & they are gradually settling down, but the new fodder is making them much thinner.\n\nLetters from home! I feel 10 years younger for a few hours after they arrive & one can scarcely describe the feelings of pleasure one has on again after so may days being in touch with those dear to him: My darling Joyce has had pneumonia. Not a word from dearest Zara about this, but Hel wrote. Of course Zara did not want to worry me, but the dear child\n\nmust now be better, otherwise they could not have left on the 3rdMarch for London. I feel they will not see me.\n\nThey are timed to arrive at Colombo on the 25thMarch & Port Said on the 6thof April; London on the 16thApril.\n\nHow I wish I could see them, but probably it is not to be, & I must reconcile myself to the position & I have done so\n\nMrs Suttor is with Zara.\n\nA telegram from Oscar to day says he has arranged everything.\n\nEric & Stanley Benjamin have now enlisted. I am very pleased to hear that anyone has done his duty & I felt they would when they found they himself could.\n\nWe hear 10000 troops are again being sent from Australia.\n\nLast Saturday night I entertained Mr & Mrs Perkins at the Continental Hotel. They had been\n\nvery kind & hospitable to me.\n\n17\/3\/15\n\nWe get up at 5 30 am & Stables at 6 AM from that moment till bed time we have\nlittle\nfew spare moments to ourselves.\n\nGot letters from home an my dearest Z said how ill dear little Doy had been with pneumonia that she had been in Glengarlen where\n\nthe treatment was most unsatisfactory. She was very thin & it was hoped the voyage to England would do her much good.\n\nThey left by the Medina on the 3rdinst & already they are between Freemantle & Colombo & quite cut off from news of me. I live in hopes I will get a cable from Colombo on or about the 25thMarch€“ in the meantime I am very anxious about them all.\n\nThey are coming 2ndClass & I am sorry for this, as\n\n\n\nI am sure Z will not enjoy herself so much, However she had evidently to choose between that & not coming€“ of course she could not arrange these details as well as if I had been with her poor little girl. No doubt Mr Moseshowever has done much to help her with his usual advise & counsel.\n\nIt appears to me now quite likely that they will be able to come to Cairo for a fortnight or\n\nso, as there is no immediate prospect I think of our leaving for some weeks.\n\nI hope indeed I will see them, but I am afraid for any disappointment these days.\n\nLetters from the others said that Eric & Stanley Benjamin had enrolled€“ good luck to them.\n\nZillah has returned to N.Z, but no letters from her€“ she is a poor correspondent. She is evidently very tired of Sydney. Vera has gone home & Enid\n\nMarks is married.\n\nHave tried to get permanent job on the Brigade Staff, but so far it was not encouraged, consequently I have returned to the Squadron. I am most unhappy in the present position of officers. Rutledge & I are entirely unsuitable to one another. He me with the other troop leaders & has tried to get me sent to Alessia. I have done all I could\n\nto make matters better, but I am sorry to say the position is quite an impossible & embarrassing one. I am on the point of appealing to the Colonel. Have spoken to Onslow & Higgins & I have the sympathy of both€“ it is a most unfortunate position€“ brought about by Rutledges incompetency & the fact that I have to act in a dual capacity€“ B\/M Guns & 2ndin Command of the Sqn. I am much concerned & very upset at the turn of affairs.\n\nHave been out with B Sqn during the last few days & have learnt a lot of new experiences of this work which really is entirely new to me, for I have devoted so much time to Machine Guns too much time in many ways, but it is to be hoped it will be well in the end.\n\nI am delighted to say the Colonel has improved in health tremendously.\n\nI had dinner on Saturday with M. €“ he had some most borish people there & I had a wretched evening. He is a fine fellow & I liked him tremendously but I told him what I thought of some of his guests!\n\nThe next day Sunday I went to the Law Courts & had a most interesting morning€“ 2 Egyptian Judges & one British in the Criminal Court which was conducted\n\nwith dignity & decorum\n\nI was afterwards taken to the Barristers Room by one of them introduced to others had coffee & exchanged cards.\n\nHad lunch alone at Continental Grill Room & then out to see Vernon at Heliopolis. First visited McLean in the Hospital there€“ a beautiful building. Then to 1stL H afterwards where I met some sincere old friends & officers.\n\nSaw Meredith too. His attitude is rather strange, but I don't mind that. Vernon has had a hard time with him since leaving Australia, & he had to appeal to the Brigadier.\n\nIn the evening I visited the Mooseri family & had a most excellent evening . They remind me of the Levy-Cohen family in Sydney. They have many interests here, are very rich & respected. \n\nPassover is approaching & I believe some preparations are being made by the Jewish community to entertain the Jewish soldiers of whom there are a number in Cairo.\n\n23\/3\/15\n\nThe anniversary of little Jacks death & poor Winifreds Birthday!\n\n4\/3\/15\n\nWe fought the 1stL.H Brigade to-day fromabout 8 am to 3 PM. It was a splendid day & the biggest thing I had taken part in. Both sides did fine work. I had a great view of the operations & helped to hold the key of the position under the Colonel who did very well.\n\nSome of the incidents were most exciting\n\nfor the country was wild & difficult.\n\nI have now settled down to my riding & quite understand my horses which are really good beasts€“ especially \"Bluey\"€“ a roan.\n\nNo letters from Zara who arrives in Colombo tomorrow€“ only one from dated","76":"\n\nHad a long & very satisfactory talk with the Colonel on Sunday. We\n\nwent out together to visit an Bedouin Arabs home€“ which was interesting.We saw something of their life & they were as proud as possible of us as their visitors!\n\nAfterwards we dined at Shepherds €“ he as my guest. He told me he quite understood the difficulties of my position with Rutledge & \"to carry on\" as all would be well in the end & that I was not\n\nto worry about seeming to bethe 5thwheel on the Coach & I won't!\n\nVisited last night Catouchi Pasha. Had dinner there €“a magnificent home & I liked them very much indeed. I will go again & had a very cordial invitation to do so.\n\nElliott is leaving very angrywith Rutledges . I will report him\n\nfor his conduct to day while on parade. Sorry to have to do this, but I have had quite enough of his conduct which is most disrespectful. Have had to do this through Rutledge, who of course was most dissatisfied.\n\n25\/3\/15\n\n1stL.H Brigade returned from their route march\n\nVernon & a dozen others dined with us tonight.\n\nI have suffered all day from a abscess on the jaw & had to have a tooth pulled out. I had to get leave from Parade.\n\nI hope my darlings have arrived safely & well in Colombp to day\n\nReceived a cable later saying all were well.\n","77":"\n\nHad a long talk with the Colonel about things Regimental. He quite understand the position\n\nbetween Rutledge & myself & says he is perfectly satisfied with my work etc. This helps me a lot. He tells me that I cannot adopt a negative attitude, so now that he understands I can carry on Rutledge & I are not getting on at all, but I don't mind so muchnow in view of the Colonel's advice. I shall to Rutledge, as long as I can, but the position is very trying.\n\nI find I get on so very much better with the fellows in the 6thwho have many more things in common with me that our other lot.\n\nThe above is written on the trainon my way to Port Said to meet Zara & the children.\n\nThe natives are absolutely overawedby our men. The farmertakes everything lying down, for all that they are very clever but slow & dirty. Their ways of living are strange.\n\n\n\nThe women are quitechattels & sleep in the yard with the animals. Their houses are devoid of furniture for the most part & very dirty.\n\nThere are hundreds of villages everywhere, made out of mud bricks.\n\nA chief rules & his word is accepted as final in all internal disputes. Often this man has a very humble position outside for example he may be a hall porter or conductor.\n\nThe women are very\n\n\n\nembarrassed if you approach them & quickly hide their faces behind the veil.\n\nThe sheep are a breed between goats & sheep & are all colors from brown white & black.\n\nThe children are very dirty & the way the flies cling to their eyes is appalling Most of them in consequence have very bad eyes when they reach manhood & womanhood.\n\nThe Fezis a useful article. it is said to be very cool & never blows off.\n\nThe native can sleep\n\nanywhere & they seem to be quite oblivious of the sun. Of course there is very little shade & the ages have enabled them to ignore the hot sun which in the middle of the day is very warm.\n\nOur","78":"L. H Brigade certainly gave a good account of themselves the other day against the","79":"L. H Brigade & this did us a lot of good.\n","80":"\n\nThe Eve of Passover. Went to Shoul & afterwards home with M. Racannuli €“ an Italian & Greek family. Received very hospitably & passed a pleasant evening & had Seder as well. The service is somewhat different to our own. The house was most refined & well furnished. They certainly understand this sort of thing here.\n\nNo Rabbi officiated & they are in their Jewish Ministers.\n","81":" \n\nThere are now French English Australian NZ Indian & Ceylon Troops here about 200000 men at the least.\n\nA wonderful meeting place€“ Egypt in fact is a splendid base for distribution of troops.\n\nWe are certain to go to the Dardanelles, where already fierce fighting by sea has taken place€“ so far we have lost 2 battleships & the French one. I hear some wonderful\n\nrange shooting has been carried out.\n\nI do work intermittentlywith the Squadron & Brigade M. Guns€“ it is not altogether satisfactory, but I do my best.\n\nI find the Brigade Major a fine fellow ready to help always. I also like the Brigadier very much, but I am afraid he is not a strong soldier€“ these Brigadiers are very small fry amongst so many seniors here.\n\nHave had several meals during Passover at the houses of Mooseri & Cattari. I like them all very much.\n\nMrs Perkins also is very kind.\n\nIt is still a great inconvenience not being paid.\n","82":" & a holiday except for Stables€“ went into Cairo & a motor drive with Higgins Weston & Suttor.\n","83":" \n\nCarried out a manoeuvre before General Birdwood & the Regiment shaped fairly well\n\nNotice just viewed that many Troops are to get on the move, but the Light Horse are to be kept back for the present€“ possibly we shall go into barracks, as the summer is now coming on very quickly.\n\nThe 1stAustralian Division under General Bridges goes first to Alexandria & then on to the\n\nDardanelles€“ there are at least in the former place 20000 French Troops.\n\nWe have not been reviewed at all at Maadi. All the other Divisions & Brigades have had several at different times €“ the last one by General Hamilton. We are a little out of the way where there are so many others.\n","84":"\n\nA big street Riot in Cairo by Australian British & NZealanders. Several killed & wounded. Altogether a most unfortunate affair & great aspersions are now being cast upon us, they say are many are undisciplined & that the officers are afraid of them! Anyhow it is a thousand pities & I feel the reflection greatly.\n\nThe facts are difficult to collect, but it would appear the trouble started in an assignation\n\nhouse where a N.Zr got stabbed, the house was wrecked by others, the Red cap Police were called out & fired on our fellows witout much warning. There were many thousands present. I visited the scene quietly afterward with Mce. Mooseri & I am sorry to say I observed a lot of wanton damage.\n\nLeave is now stopped for all for going into Cairo & we want to goto Port Said so badly for Zara arrives\n\non Monday. Anyhow we shall abide our time.\n\nSuttor is a fearful bluffer & really I feel he will fall in terribly one of these days€“ he blows hot & cold all the time & you simply cannot pin him down at all. I have to be very careful with him indeed. He is coming to Port Said with me & was inclined to do all sorts of things to get away, but of course he would not have dared to do any of them.\n\nWaited patiently & word came along that we could get leave to go to Port Said to meet Zara & Mrs Suttor, so we will leave first thing on morning.\n","85":" Came into Cairo early & left there by 11 on train for Port Said. A dirty but interesting trip down€“ an excellent lunch is provided on the train & it is a pity they cannot do the same thing in Australia.\n\nThe Indian Troops are most impressive€“ their loyalty & efficiency are very predominant. The officers too are very competent.\n\nIshmalia mid-way between Cairo & Port Said was full of troops, mostly Indians.\n\nGenerals are as thick as peasin Egypt these days & Colonels are small fry indeed.\n\nOur horses have not yet settled down to the smell & appearance of camels\n\nI am close communication with Oscar every week & he will look after Zara the children when they arrive. This is great comfort to me.\n\nHad nice letters from Mrs Joseph & Violet last week.\n\nThe Colonel is very generous when we are with him in town: as some slight return I have had to him to dinner with me twice€“ it is great to see him in such good form again.\n\nIt is rumored we are to have a medal for Egypt partly for the Canal affair & also to commemorate the accession of the Sultan.\n\nI have now seen all the chief sights of Cairo & am getting a little tired of merely coming into town, but still the change from the desert is a great relief & now that dear Zara & the children are coming it will make a great difference to me\n\nThe defences on the Canal were most complete.Coming up through the Canal we saw one side of each, now on journey to Port Said by Rail we are able to see the other sides Some of the troops have dug themselves right into the Ground\n\nI am sorry to say there are very few who have recd anything at all in the Regiment.\n\nHiggins & I get on famously & I am sorry\n\nhe has not yet got his Captaincy.\n\nI have never seen a more united family than the Mooseri one. They are all in mourning for a young Son aged 25 who died about 6 months ago.\n\nArrived in Port Said at 4.30 PM. Suttor & I went round & investigated the place. Tried to see the British Consul for Pass Ports for Zara & Mrs S, but found out afterwards by enquiry\n\nsame was not necessary as we were here to meet them.\n\nMet some nice people on their way to England on the train, after having seen their sons off to the front from here.\n\nMet some of the R N Division fellows€“ there are 11000 here & they consist of all the Naval Brigade Units collected together. They are organised as Infantry, wear the names of Battleships & have bands on their khaki uniforms to\n\ncorrespond with the similar ranks in the Navy. Many of the officers are very young indeed. They had not met any of the Australians till they met me.\n\nYarned with an interesting American till 11 PM€“ the boat is expected at 10.30 am in the morning.\n","86":"\n\nUp early & met a curious fellow named Chard who had been with & was going to England\n\nto reform the Worcester Regiment€“ he did not like the want of discipline in our forces & undoubtedly it is a real failing, but one cannot expect anything different considering how our forces have been raised & bustled away.\n\nZara & Children arrived safely. They are very well & were in fact sorry to leave the ship where they had made many friends€“ even getting used to the 2ndClass where Zara very bravely\n\nhad gone to save money€“ she is real little brick. I am delighted to have them.\n\nWe left for Cairo at once & what a day €“ the train€“ a \"hamseen\" was blowing & the heat & dust were awful.\n\nTo Hotel Continental where things got better for they have a lovely big room & are ever so much more comfortable.\n\nMrs Suttor & Zdo not get on & I am very sorry.\n\nWas a little disappointed\n\nthat Zara did not know one or two things about my affairs in Australia, as I was relying so much on this, especially as to my back pay etc, which is still outstanding! This since","87":"Sept 1914!!\n\nI did not stop in tonight having said I would return by 1. AM tram to Maadi. This evidently also upset Zara & I only acted out of a sheer sense of duty & much against my personal wishes, still duty is duty all the time & nothing\n\nwill ever make me see otherwise.\n\nThe children are well but Doy is thin & a little pale. They are so dear to me.\n\nPoor Mr Moses, from Zara is simply wonderful & his efforts & work for her before her departure were absolutely super-human almost. I am really greatly in his debt & her accountof what he had done & the letters he wrote her absolutely broke me up.\n\nI have had to cable\n\nhim for some money, as Zara's has gone direct to London on account of her uncertainty about stopping here. I did not like doing this, but there was nothing else to do.\n\nMrsStokes has been very kind in advising me how to act here & will be a great help to Zara generally. Her husband left for Turkey about 4 weeks ago.\n\nZara I know will thoroughly appreciate life at the Hotel\n\nThere is no doubt Zara has been a real little Trojan since my departure & Doys illness gave her great worry & trouble.\n\nIt appears now she was quite happy at \"Luton\". If I had realized this, I would not have sent for her, but have no regrets at having done so, for the experience for her & the youngsters will be a splendid one.\n\nTook them to the Citadel & the Zoo on Sunday. They did appreciate all\n\nthey saw.\n\nWe met a charming man there named Colonel Anderson Director of Stores who paid us a lot of attention showing us over the military factory & afterwards entertained us in his quarters.He had a fine collection of antiquities & bric a brac\n\nReceived a cable for£80 from Mr Moses.\n\nLetters from Oscar who is well. He is offended with Mr Moses & does not understand that he\n\ncannot draw Bills without notice, as we have very little money at current account & the Banks will not grantan overdraft. I have written to him endorsing Mr M's action. Oscar has bought several articles of equipment for me in London.\n\nZara is already been invited out a good deal & likes the friends I have made here very much indeed.\n","88":"\n\nIt is very trying these days on the desert. Soon we shall have to modify our working hours although we are not working what I call hard at all.\n\nThe Colonel quite understands me & I am very fond of him. He understands his job well.\n\nOne of our fellows has just returned from Alexandria & he was associated while there with the Foreign Legion! This equals all my imagination.\n\nThe Hotels here have set themselves out to be courteous & considerate to all of us, especially if you are their resident. Zara is very happy at the Continental in consequence, but we must go slow with our money.\n\nMr Gum has placed his garden at our disposal€“ it is on & a beautiful spot.\n\nAll the","89":"Australian Division have now left here & were followed by the Australian & NZ\n\nDivision being known as the Australian & NZArmy Corps. This is exclusive of the Light Horse for the Dardanelles Peninsula is no place for them. I am certain Australia will now make a name for herself, but the cost is going to be very heavy. Already provision is being made for 70000 casualties!\n\nOur horses have now been clipped & are making some improved on the Egyptian fodder\n","90":" We are getting up a Dinner & Ball at Haloman€“ by the officers of this Brigade. I hope Zara & I will both be able to go.\n\nA VenetianCarnival at Shepherds on Saturday Night was a charming picture €“ nearly all the conventions were dropped & Zara thoroughly enjoyed herself. She is looking very well & black does so suit her.\n\n\n\nI am not doing very much Machine Gun work now, but have been with the Squadron the last few weeks. Rutledge & I seem to be getting on better. I hope so & that it will be permanent.\n\nI find it somewhat expensive going into dinner to Cairo & will in future go after Mess. Have given up the Secretaryship of the Mess €“ I have been at it for so long that I think others should now have a shot at the work.\n","91":"\n\nI have omitted to enter up my days & impressions for a fortnight or so. The reasons are somewhat varied€“ chiefly because I have had a good deal on my mind during this time. The Children have not been well having suffered somewhat from the effects of .\n\nZara has had lots of invitations & is really facinated with Cairo & so are the children & I hope this experience for them will last all their lives for both are\n\nvery observant.\n\nIt is a great delight to me to take them everywhere & everyone here who I have made the acquaintance of has been very kind.\n\nZara has worriedme a good deal herself. The dearest little girl in the world she is to me & nothing she can do will every alter my great & deep affection for her, but she does such wilfulthings & nothing she enjoys more than a good flirtation€“ she has now another with Higgins the Adjutant. I have spoken to them\n\n (see over two pages)\n\nboth, people are talking & she allows Higgins to monopolise her time & attention at my expense & I find now constantly he is in her company.\n\nIt does so upset me (not from any spirit of jealousy although I am jealous indeed of her good name) but because it causes her name to be bandied about makes a fool of me & the practiceis so dangerous & it means so much to the 4 of us who are so alone in the world, but she will not desist\n\n& I have to put up with all the annoyance. It seems so strange to me; she comes all these thousands of miles to be with me & here is the result. Throughout I have the greatest confidence in her self control & character, but who can tell what all this will lead to.\n\nHiggins himself under a cloakof fine manners has for the time facinated her, proved a false friend to me & there me. I love, of course, for Zara to have all the pleasure she can, but seems a little cruel\n\nof her to act so, just as I am on the point of going away right to the front, perhaps never to return. However nothing can alter the great love for her that I have & perhaps some day she may more readily realise what a very real anxiety she has given me, but I do not complain so very much for the dear children are absolutely devoted to me & quite understand. Zara makes as her excuse that I am far too serious for her & says although she has a deep regard for me, finds very often\n\nshe cannot put up with the situation & hates the idea of the marriage tie. All this has meant much talk & tears & I have now gone through it so often that I ought perhaps to be somewhat used to this experience, but can a man devoted to his wife ever get used to others always being with her & the feeling that he himself is an & is not wanted. Zara herself says she is sorry & knows my feelings & cannot understand so she says that I can still continue to love her, but I do all the more with the usual worlds & human's contrariness\n\nInwardly I trust in God & have the feeling that all will be well in the end & this alone can at present be my comfort.\n\nWho would have thought that when I left her in Australia a few months ago I would have this load of trouble ever again for she was indeed my loving little wife her whole thought & attention being for me & mine, but I will try not to complain for I love her with all my heart & soul.\n\nSometimes I think I must be greatly to blame & must\n\nbe a very trying person to live with on account of my seriousness & earnestness in all things.\n\nHiggins I find is Respondent in a Divorce suit & that his history is the usual adventurers one. His name is not Higgins & altogether his past is what these facinating white-haired irresponsible mens always are. It is so easy for them to break up a happy home when it all means so little to them.\n\nAnd I am on the Eve of leaving my dear ones! I write with the greatest pain & distress\n\nI find that I am getting on much better with Rutledge & generally things Regimental are much happier.\n\nEach mail brings me news from homeall are well & Oscar keeps me well informed every week of his own welfare & that of his wife & child.\n\nEric has now joined the Expeditionary Forces, but I have no idea who he is with & when he leaves Australia..\n\nSince I wrote last there has been an attempted assassination of the Sultan. A Court Martial tried & condemned the prisoner who was executed a few days ago. He was a individual. The Court was conducted with all solemnity & the list counsel engaged for the prisoners defence. I could not get off to attend.\n\nTroops have now landed in the Dardanelles & any day will come word for us to move. We hear few particulars of\n\nWar€“ most matters being kept away on account of the native population which is not trusted.\n\nI spend every night in Cairo nearly with the Children & Zara€“ the Colonel allows me when I am not on duty to do this. I am trying to arrange for them to come out to Maadi.\n\nWe hear very little news of dear Australia these days.\n\nTook the children to some French Sports the other day. The foreign atmosphere\n\nwas very funny & so different to our own.\n\nI have a new batman who is a most excellent fellow.\n\nGeof came out yesterday & spent the day with me. What a dear good fellow he is. He loved being here, but got a bit of the sun, as it really is too hot for children to be out from 12 till 4 PM\n\nHe went for a ride on a donkey, made friends with everyonein his own sweet little way. Oh Godhow I love him!\n\nDoy spent the day elsewhere & enjoyed herself. I am\n\njust as fond of her & she absolutely understands me & makes up for so much that I miss in affection.\n","92":"\n\nMy darling little Geof is suffering from the effects of Sun. He got some when in Camp out here with me at Maadi: No children should be allowed out now after 11€“ till 4 PM. He looks terribly ill & I am very anxious about him, but he is so brave & uncomplaining.\n\nWhile fresh in my mind I must also record\n\nanother great worry & following on what I have already written above. I had felt all the afternoon while with Zara she was very irritable & had something on her mind. While with the children tonight Higgins rang her up€“ I gathered this only, but proved correct afterwards. We had some sort of dinner together, but by no means were we happy.\n\nAfterwards after seeing that the Children were happily placed & in bed, I went to sit with her on the Piazza of the Hotel. She then admitted that she was waiting for me to go & for Higgins\n\nto come in which he had done all by arrangement.I once left & said the position to me was quite impossible & said I would not come in again until she sent for me.\n\nNeed I say how upset I am, but I know I have got to put up with it, for I cannot make a scene or take any action. This Zara knows & here I am one of the unhappiest of men because she has this infatuation after coming these thousands of miles to see me. The result is I am not seeing her at all, as I want to & it seems so cruel to me\n\nMy love will be in the children, but I cannot alter my affection for Zara who has done so much & meant so much for me in the past.\n\nShe describes Higgins as the \"moth round the candle\" & simply enjoys leading men such as he on. Some men who were treated so would soon take action, but I cannot for my childrens good name & future is always present before me, but I am the most miserable of men & I really do think I have tried to do my duty to Zara who curiously says she still\n\nhas a great affection for me. I can only trust to time & circumstance & rely on my God as the way out.\n\nThis morning I watched carefully some goings of Native prisoners all in irons who work close by our Camp. Some are 25 yearmen & all range from 7 years to life sentences. What an outlook. There are 3 classes & they are 2000 in all guarded by 300 Soldiers & 150 Warders\n\nThey are always interested in us when we pass them every day.\n","93":"\n\nWord has just reached here from the wounded who are coming back to Alexandria & Cairo in thousands of the attack by our forces on the Dardanelles.\n\nThe attack began on the morning of the","94":"at dawn & barbed wire & stakes were fixed under the water€“ the Turks were entrenched right down to the beaches.Many of our fellows were while landing & the bravery was splendid. They landed & pressed on for 7 miles\n\ninland€“ noting could stop them€“ the fixed bayonets & charged & charged. Colonels Thompson, McLaurin Irvine& many of my close friends & associates have been killed.\n\nThe wounds are very bad€“ some cases€“ disembowelling heads cut off, testicles shot away & thelike. Holes with spikes & men fell down & were rescued alive after hours of suffering.\n\nMachine Guns, Shrapnel were terrific & I hear the supporting fire rom the Fleet was deafening€“ the Queen Elizabeth shell is 5' 6\" high!\n\nOur fellows are very impatient at not getting away, but our turn must come later, when the business begins.\n\nI have written a long account of the close facts for publication to Gail Myers & hope to get the manuscript if I return.\n\nThere are 4 large hospitals here already quite full.€“ all the men really are most cheerful & joke about their experiences & all want to get back again. About 25000 Australians & N.Z supported by French & British Troops took part€“ it certainly is the biggest thing Australia\n\nhas had in her history & how will the people at home thrill as they read their morning papers this week!\n\nIt is hard to realize Colonel Thompson & McLaurin are nomore!\n\nSome Battalions got almost exterminated.\n","95":" Wounded arriving here every day.\n\nThe Allies captured 12000 prisoners, but the orders were no prisoners.\n\nA Troop Competition took place in the Regiment & Zara rode out to see it€“ she enjoyed the outing.\n\nPostcard from Chambers to come out to see him€“ he is wounded.\n\nMcNaghten is too with shrapnel & 2 bullet wounds.\n\nCannot get rooms for Zara at Maadi.\n\nHome letters to day€“ all are well.\n\nMost of the local horses are stallions.\n\nThe open air eating & drinking is very attractive€“ this can be done easily on account of no rain.\n\nZara still gives me a lot\n\n\n\nof worry with this chap Higgins who pesters me with attentions to her.\n\nAt times I am really very miserable & Zara admits my point & feelings, but says it is in her blood & she must flirt€“ my consolation must be to trust her & rely on the experience of the past€“ but it is naturally very hard, when I realize how near I am never to see her or the children every day.\n","96":" Marched to Halaman & lunched in the desert€“ not well.\n\nWord just received that we are to leave for the front in 2 days. After this all my thoughts were of Zara & the Children & my present not too happy relations, but I shall not despair fr I feel it is only a harmless flirtation, but the situation has worried me a lot, owing to the uncertainty of everything &I \ndid\nwant\nher\nso much to myself these last few weeks without misunderstandings\n\n\n\nSpent the evening with Zara & the chidren & I left ever so much happier, for I feel Zara is absolutely true to me, but feels at times she must have a little flutter of this kind.\n\nI trust her absolutely & the future is entirely in her hands.\n\n8\/5\/15\n\nWord has just been received by me to report as Brigade Machine Gun Officer to Captain Hastings who will have the 3rdBrigades 1st","97":"","98":"Guns under him. I leave for the front with him\n\n\n\nat once & this is indeed the biggest thing I have ever tackled. Hastings & I are to report to the G. O. C. Army Headquarters€“ we shall have 18 guns under us€“ it is an enormously big responsibility & who shall say what it holds in store€“ I only trust I shall be equal to the task\n\nI shall spend the last few hours with Zara & the Children.\n\nI shall never see the Regiment again. We leave by the Kamerona from Alexandria on Monday at daylight\n\nLeave here by Special\n\nMany men envy the opportunity I have & there is no doubt it is a big chance to distinguish oneself. May the Great God help & protect me in this big undertaking, which so few really understand!\n","99":" He also protect my darlings who I leave behind!\n\nThis will be the last entry in this book & I must keep another from now onward.\n\nI shall leave my darlings knowing they are the very dearest things to me in the\n\nworld€“ they are all I live & hope for.\n\nI am often so sorry I cannot reconcile myself more easily to Zara's adventures which have never turned out seriously, but it is so hard to look on when I want her alone & there are so few who really care or understand what must be a somewhat difficult person to get on.\n\nI am sure it must be difficult to live with someone who is more or less a slave to conscience & duty & therefore with all my heart & soul I forgive my darling little Girl for any pain\n\n& trouble she may have given now feeling convinced she meant no harm, but was impelled to take this form of happiness on account of association with me who is such a dull person.\n\nI leave her with my love for her intact & unbroken.\n\n"}}