{"Document Name":{"0":"Diary_0159","1":"Diary_0159","2":"Diary_0159","3":"Diary_0159","4":"Diary_0159","5":"Diary_0159","6":"Diary_0159","7":"Diary_0159","8":"Diary_0159","9":"Diary_0159","10":"Diary_0159","11":"Diary_0159","12":"Diary_0159","13":"Diary_0159","14":"Diary_0159","15":"Diary_0159","16":"Diary_0159","17":"Diary_0159","18":"Diary_0159","19":"Diary_0159","20":"Diary_0159","21":"Diary_0159","22":"Diary_0159","23":"Diary_0159","24":"Diary_0159","25":"Diary_0159","26":"Diary_0159","27":"Diary_0159","28":"Diary_0159","29":"Diary_0159","30":"Diary_0159","31":"Diary_0159","32":"Diary_0159","33":"Diary_0159","34":"Diary_0159","35":"Diary_0159","36":"Diary_0159","37":"Diary_0159","38":"Diary_0159","39":"Diary_0159","40":"Diary_0159","41":"Diary_0159","42":"Diary_0159","43":"Diary_0159","44":"Diary_0159","45":"Diary_0159","46":"Diary_0159","47":"Diary_0159","48":"Diary_0159","49":"Diary_0159","50":"Diary_0159","51":"Diary_0159","52":"Diary_0159","53":"Diary_0159","54":"Diary_0159","55":"Diary_0159","56":"Diary_0159","57":"Diary_0159","58":"Diary_0159","59":"Diary_0159","60":"Diary_0159","61":"Diary_0159","62":"Diary_0159","63":"Diary_0159","64":"Diary_0159","65":"Diary_0159","66":"Diary_0159","67":"Diary_0159","68":"Diary_0159","69":"Diary_0159","70":"Diary_0159","71":"Diary_0159","72":"Diary_0159","73":"Diary_0159","74":"Diary_0159","75":"Diary_0159","76":"Diary_0159","77":"Diary_0159","78":"Diary_0159","79":"Diary_0159","80":"Diary_0159","81":"Diary_0159","82":"Diary_0159","83":"Diary_0159","84":"Diary_0159","85":"Diary_0159","86":"Diary_0159","87":"Diary_0159","88":"Diary_0159","89":"Diary_0159","90":"Diary_0159","91":"Diary_0159","92":"Diary_0159","93":"Diary_0159","94":"Diary_0159","95":"Diary_0159","96":"Diary_0159","97":"Diary_0159","98":"Diary_0159","99":"Diary_0159","100":"Diary_0159","101":"Diary_0159","102":"Diary_0159","103":"Diary_0159","104":"Diary_0159","105":"Diary_0159","106":"Diary_0159","107":"Diary_0159","108":"Diary_0159","109":"Diary_0159","110":"Diary_0159","111":"Diary_0159","112":"Diary_0159","113":"Diary_0159","114":"Diary_0159","115":"Diary_0159","116":"Diary_0159","117":"Diary_0159","118":"Diary_0159","119":"Diary_0159","120":"Diary_0159","121":"Diary_0159","122":"Diary_0159","123":"Diary_0159","124":"Diary_0159","125":"Diary_0159","126":"Diary_0159","127":"Diary_0159","128":"Diary_0159","129":"Diary_0159","130":"Diary_0159","131":"Diary_0159","132":"Diary_0159","133":"Diary_0159","134":"Diary_0159","135":"Diary_0159","136":"Diary_0159","137":"Diary_0159","138":"Diary_0159","139":"Diary_0159","140":"Diary_0159","141":"Diary_0159","142":"Diary_0159","143":"Diary_0159","144":"Diary_0159","145":"Diary_0159","146":"Diary_0159","147":"Diary_0159","148":"Diary_0159","149":"Diary_0159","150":"Diary_0159","151":"Diary_0159","152":"Diary_0159","153":"Diary_0159","154":"Diary_0159","155":"Diary_0159","156":"Diary_0159","157":"Diary_0159"},"Date":{"0":"unknown","1":1695.0,"2":1696.0,"3":1697.0,"4":1698.0,"5":1699.0,"6":1700.0,"7":1701.0,"8":1702.0,"9":1703.0,"10":1704.0,"11":1705.0,"12":1706.0,"13":1707.0,"14":1708.0,"15":1709.0,"16":1710.0,"17":1711.0,"18":1712.0,"19":1713.0,"20":1714.0,"21":1715.0,"22":1716.0,"23":1718.0,"24":1719.0,"25":1720.0,"26":1721.0,"27":1722.0,"28":1723.0,"29":1724.0,"30":1725.0,"31":1726.0,"32":1727.0,"33":1728.0,"34":1729.0,"35":1730.0,"36":1731.0,"37":1732.0,"38":1733.0,"39":1734.0,"40":1735.0,"41":1736.0,"42":1737.0,"43":1738.0,"44":1739.0,"45":1740.0,"46":1741.0,"47":1742.0,"48":1743.0,"49":1744.0,"50":1745.0,"51":1746.0,"52":1747.0,"53":1748.0,"54":1750.0,"55":1751.0,"56":1752.0,"57":1753.0,"58":1754.0,"59":1755.0,"60":1756.0,"61":1757.0,"62":1758.0,"63":1759.0,"64":1760.0,"65":1761.0,"66":1762.0,"67":1763.0,"68":1764.0,"69":1765.0,"70":1767.0,"71":1768.0,"72":1769.0,"73":1770.0,"74":1771.0,"75":1772.0,"76":1773.0,"77":1774.0,"78":1775.0,"79":1776.0,"80":1777.0,"81":1778.0,"82":1779.0,"83":1780.0,"84":1781.0,"85":1782.0,"86":1783.0,"87":1784.0,"88":1786.0,"89":1788.0,"90":1789.0,"91":1790.0,"92":1791.0,"93":1792.0,"94":1793.0,"95":1794.0,"96":1795.0,"97":1796.0,"98":1797.0,"99":1798.0,"100":1799.0,"101":1800.0,"102":1801.0,"103":1802.0,"104":1803.0,"105":1804.0,"106":1805.0,"107":1806.0,"108":1807.0,"109":1808.0,"110":1809.0,"111":1810.0,"112":1811.0,"113":1812.0,"114":1813.0,"115":1814.0,"116":1815.0,"117":1816.0,"118":1817.0,"119":1819.0,"120":1820.0,"121":1821.0,"122":1822.0,"123":1823.0,"124":1824.0,"125":1825.0,"126":1826.0,"127":1827.0,"128":1829.0,"129":1830.0,"130":1831.0,"131":1832.0,"132":1833.0,"133":1834.0,"134":1835.0,"135":1836.0,"136":1837.0,"137":1838.0,"138":1839.0,"139":1840.0,"140":1841.0,"141":1842.0,"142":1843.0,"143":1845.0,"144":1846.0,"145":1847.0,"146":1848.0,"147":1849.0,"148":1850.0,"149":1851.0,"150":1852.0,"151":1853.0,"152":1854.0,"153":1855.0,"154":1856.0,"155":1857.0,"156":1858.0,"157":1859.0},"Entry":{"0":"\n\n","1":"\n\nReveille 6 a.m. – Load Motor Lorries and accompanied by the 27th Battalion Band we leave Bertangles for the Old French Town of Rouen – Having Australian Drivers on the Motors can you wonder that we travel at a reckless pace through country ad village on a wild endeavour to prove each Lorry the fastest – Beautiful Landscapes and Farms that are very rich in Crops – Rest at Neufchatel – Lunch – Journey resumed – German prisoners working on the roads –\n\nCovered in dust & feeling tired & sore after such a long journey and we arrive in Rouen three hours before the expected time –\n\n Unload Lorries & camp in 1st A.G.H. - Meet old acquaintances including Jack Moran – Australian Sisters – Our camp just out from the Town on a pre-war Race Course – A run into the City & Return.\n","2":"\n\nRehearsal – \"The Coves\" accept a most cordial invitation from a number of Australian Sergeants and after having partaken of a Dinner, we enter-\n\ntain, and in turn are entertained- I spend night in Town in different flats where these Sgts & W.O.s are billeted.\n","3":"\n\nBreakfast in Rouen – Return to Camp – Parade, Rehearsal & Preparations for Evening Show –\n\nRouen – A fine old City – Manh churches & Cathedrals. Visit most important of these. \n\n- Streets, Old Buildings & Historical Spots are teeming with interest – To stand in their midst, is to live many years ago, when Britain\n\n& France were great enemies. – The Bridges across the River Seine – The Old Arch and the strange clock adorning it – \n\nMany Nurses & W.A.A.C’s in town –\n\nThe Slums of Rouen – Purchase of English Book, while the chance is good –\n\nThe Curiosity Shops – \"Oh, for a thousand pounds!\" \n\n- W.O. Rogers – Sgt. Cox – Stf. Sgt. Blanchardt – Show.\n","4":"\n\nVisit Australian Pay Office – Spend afternoon in \n\nTown – Visit Gros Horloge - Muse´e Des Beaux Arts, the Bourse, the Markets etc etc – (For detailed account of these various places see \"Guide to Rouen.\" – Shopping – \"American – French\" advance.\n\nShow at 11th Stationary H.\n","5":"\n\nIn Rouen there 30 different Hospitals – We hope but do not expect to show at everyone –\n\nThe Cathedral Notre Dame perhaps even larger than that of Amiens, proves grandest spectacle & greatest structure in Rouen\n\nWonderful specimen of Gothic architecture. – Dates back to 1201 A.D. A morning rehearsal and an Evening entertainment\n","6":"\n\nRehearsal – Entertain patients at varius wards of A.G.H. – Show in th Evening to \"Engineers\" at St, Etienne\n","7":"\n\nA day of days! – at 10 a.m. we leave camp for Rouen & there take Excursion Launch up \"River Seine\" – Our 27 Batt. Band is also on board\n\nAnd provides good music – Apart from a score or so of ‘khaki-clad\" youths, the passengers are all French Civilian – Beautiful and inspiring river scenery – Must surely compare with the World’s best – Arrive & disembark at \"La Boville\" (a French Village on the Seine of picturesque & natural beauty) After Lunch we divide into parties & make a tour of inspection – \"Old Chateaus\" & (Castles) - Statues – Landscapes - & Rivery Scenery – Melle Jeanne. Candelibe - A\n\nmost interesting afternoon which provides a very good if unorthodox lesson in the French Language – Leave La Boville at 8 p.m. & journey back in the twilight of a perfect day – The many riverside gardens lend to the waters a scent laden atmosphere, delicious fragrant & soothing –\n\nSweet slumber crowns a day such the Poets love to write about. \n","8":"\n\nRehearsal of\n\n \"the Grafters\" – Correspondence – Parcel from Home – Entertain patients during the afternoon –\n\nIn the evening we give an informal concert to the Sgts., of a S. African Unit – \"Lechenberg\" proves a most appropriate recitation.\n","9":"\n\nParcel of Old Mail posted to \"Elm Bank\" (also Rouen Views) – Rehearsal – More allied gains – \n\nA very popular & enthusiastic entertainment given\n\nAt the Army Bakery (North) – many W.A.A.C’s present – Return to camp \"Champ des Courses\"\n","10":"\n\nRehearsal of \"Grafters\" – \"The Arabian Nights Entertainments\" – Ward shows – Night performance at the Army Bakery (South) – We are afterwards treated in a good hospitable, colonial fashion. \n\n- August. – 1918 –\n","11":"\n\nRehearsal of \"Grafters\". Washing – Diary – Parcel from Maggie – Free afternoon – Once again I have pleasure of a very interesting walk around Rouen – Museum –\n\nIn the evening we entertain the Sergeants of 1st A.G.H. – A good friend, advocate & supporter in Pte. A. Wilkins who makes all arrangement for the Coves.\n","12":"\n\nGreater portion of day spent in Rouen – Fred R, & self make interesting survey of the many market stalls (Market Day) –\n\nA strong resemblance to Cairo – A pleasant trip by tram-car to \"Bon Secour\", which is on a large hill and is the highest point of Rouen – Beautiful panoramic scenery of the town & the River Seine – Second visit to the Cathedral – \n\nOrgan in action – The slums of Rouen & their quaint buildings. \n","13":"\n\nMorning Rehearsal & Preparations for Evening – At 8.30 p.m. the \"Anzac Coves\" open at Theatre Francaise (Rouen) to an overcrowded house of soldiers & civilians – \"Grafters\" played for the first time –\n\nThe theatre is a very old building & must surely contain a great history – Its interior fairly captivates one with its histrionic atmosphere. – A long night.\n","14":"\n\nFourth Anniversary of \n\nDeclaration of War. Great Allied gains on Western Front – Letter writing in the morning – Matinee at the theatre during the afternoon and Night Show to follow –\n\nAn incident of interruption during the \"Burglar Sketch\" – Dramatic ending to \"the Prayer\" – The close of a long & busy day. Tiresome walk back to camp.\n","15":"\n\nMorning spent in packing goods after the shows at Theatre\n\nFrancais – A wet afternoon during which I indulge in a little reading – (Arabian Nights) – Evening spent in company of several Sgts. From Eschelon, who have practically a mansion for billets (Leave it to the boys with the hats turned up on the side!) \n\n- \"Opium Den\" – \"El Dog & \"A Letter to the Front\" –\n","16":"\n\nA day in camp at A.G.H. concluding with a much appreciated show at Y.M.C.A. – after\n\nwhich Billy Dick and myself have a last look at Rouen (Tower where Jeanne de Arc was imprisoned & spot where she was burned at the stake)\n\nFrench cafe´s & French cooking – Sunset on the Seine – Return to camp.\n","17":"\n\nAccompanied by the 45th Batt. Band the \"Anzac Coves\" leave Rouen by train from Le Havre – Arrive destination 2 p.m. – Tom Satterby now a \"Cove\" – Havre – Its buildings\n\n& streets – Sea front – a gold mine discovered in the shape of an English Book Shop –\n\nWe are camped at No. 4 Convalescent Camp, which has chiefly (for its occupants) British & American Troops. – Bed.\n","18":"\n\nDiary – Completion of \"Arabian Nights Entertainment\" – An afternoon free from duties is spent on the \"Havre\" beach – Unlike our Australian Beaches, pebbles (round & white)\n\ntake the place of sand – \n\n- To come to town from Camp by shortest route we travel daily by the \"Funeculaire \" Railway down a gradient almost perpendicular – The first of its kind yet encountered – Letters to Australia & England.\n","19":"\n\nCommence \"De Profundis\" – Preparation of New Items – Visit & give entertainment at No. 2. British General Hospital – In Peace Days the building in which we\n\nperform, acts as a huge saloon for passengers travelling to & from America by the Franco-American Liners – \n","20":"\n\n\"De Profundis\" - Leave Havre at 3 p.m. in motor lorry for Etretat – \n\nAfter a two hour journey along country roads, made beautiful by \"rich\" cornfields & Nature’s landscapes\" – we arrive at this sea-side village where we are to entertain at the No. 2 American General Hospital – Our\n\nroute having run parallel with the Ocean we receive full benefits of exhilarating sea breeze – At night we give first show in the American Y.M.C.A. to American Soldiers, Nurses, Surgeons & Independent American people –\n\nGreat enthusiasm greets & dismisses – the Anzac Coves.\n","21":"\n\nSabbath – A free morning gives the opportunity of seeing \"Etretat\" in all its beauty, on a glorious\n\nSummer’s Day – The sea side resort is neither \"Manly\" or \"Bournemouth\" & yet in many respects resembles both to a great degree – While lacking the size & importance of Bournemouth and the sands & surf of Manly, it is more picturesque than either – A resting & pleasant resort for Parisians & Tourists –\n\nThe Coves indulge in a morning swim which is greatly enjoyed by all – \n\nIn the afternoon we give our \"second entertainment\"\n\non the promenade outside the \"Casino\" to a great number of patients, the majority of whom are American & Australians –\n\nThe inhabitants of \"Etretat\" are for the greater part wealthy & fashionable French & American Citizens, the latter of whom are closely following the interests of the great American Army. \n\nI am afraid \"Father Timer\" will not permit me to give a detailed account of Etretat – suffice it to be said that it is the most beauti-\n\nful spot yet visited during two & a half years in France – and it has captivated me for all times – After our tour of the past month I now have visions of some future return to France - One cannot realise it is the same country that contains the many old dirty villages where we have at times been billeted. – \n\nThe Yanks – yesterday & todays have just been \"brothers\" to us all – They are indeed champions! – Splendid in every way - \n\nThe American Sisters (Nurses) cannot be praised too highly - They love their work, and have much sympathy & consideration for our sick & wounded Anzacs, all of whom laud the hospital & its staff to the utmost \n\n- The end of a day made perfect by French scenery & seaside – American fraternity & hospitality and sincere Australian Appreciation - \n\nA new acquaintance of importance is Bunny Southwick late of the \"World\" newspaper \n\nNew York & now editor of a U.S.A. Army paper entitled \"The dooins\".\n\n- Return to Havre\n","22":"\n\nRehearsal – Diary – A quiet run into town & return – Afternoon show at No. 39 General Hospital and Evening performance in Officers Quarters of same Hospital.\n\nAug. 13th\n\nLetters despatched to \"Home\". \"Elm Bank\" & \"Etretat\". Completed my reading of \"De Profundis\"\n\nand am much impressed by Wilde’s philosophy despite his reputed weakness & immorality – Pack up costumes etc & leave for Australian General Base Depot where we entertain upwards of 2.5000 Australians – Entertained by Sergeants Mess.\n\nAt this Australian Base Camp I have much pleasure in meeting Jack Grose, --Hill, (from Balmain) Jack Bondetti (Hunter’s Hill) and O. Jonsen, N. Fettel, C.Evans, H. Leach,\n\nJ. Morris, T.J. Peaston (late of 7th Field Amb.\n","23":"\n\nTwenty first anniversary of Maude’s birthday – Best wishes – A new book \"Little White Bird\" (J.M. Barrie) – An afternoon walk with Fred & Bobby to Harfleur, which is the \"great scene\" of Shakespeare’s Henry V. Being actually in this famous district I have no difficulty in creating visions of \"Harry the King\" – \"His fighting Englishmen\"\n\nSt. Crispin’s Day\" etc. and I cannot well refrain from repeating those popular line (which were the outcome of the Bard’s imagination) \"Once more into the breech dear friends, once more, or close the wall up with our English dead!\n\n- Evening entertainment to men of \"Australian Infantry Base\" – After which a most acceptable supper is tendered us by Officers & Sergeants.\n","24":"\n\nReturn to Le Havre\n\nAnd make preparations at the Grand Theatre where we are to show for two nights – The House is a very good one indeed and its intercom is a most imposing structure –\n\nFine stage with good settings – First show goes remarkably well – audience comprises Americans. Australians Pommies and French people – Wordy warfare in which I am not defeated – Kindness of YMCA Ladies.\n\nReturn to Le Havre\n","25":"\n\nMy admiration of J.M. Barrie – Second and last night at the Grande Theatre. Very successful show – French Operatic Company will perform to-mororow – \n","26":"\n\nThe beach of Havre – Departure with proper. – ties etc. for Etratat – A speedy van in Motor Am. balances – Back to the picturesque seaside village. – A show given to our American friends goes better\n\nthan can ever be anticipated.\n","27":"\n\nSabbath – The band attached to ourselves (45th Batt.) arrives, from Havre, and plays on the Casino Promenade, much to the enjoyment of the patients & French people – Meet and converse with Madame La Comtessa de Saint Hilaire (Countess) – also daughter & son.\n\nThe sea cliffs, the beach,, & the village – Reluctantly we leave Etratat & unfortunately\n\ndo not expect to see the pretty little village again.\n","28":"\n\nAn Entertainment given in the camp where we are billeted (No. 4 Con. Camp) – Read \"The Little White Bird\" – Rehearsal.\n","29":"\n\nReturn shows (two) given to Officers & Men of No. 39 General Hospital –\n\nRehearsal – Letter writing Book Purchases –\n","30":"\n\nRehearsal – Letters – Diary – Return show at\n\nA.G.B.D.\n","31":"\n\nPalgraves Golden Treasury – Meet Eric Kidman. - Visit the Dentist & have two teeth treated – Return to Havre & show at Crystal Palace (Y.M.C.A.) -\n","32":"\n\nLetters written to Home. Diary – Rehearsal of Monologues – Evening Performance at American Motor Park.\n","33":"\n\nLetters – Palgrave’s\n\nTreasury – Entertained in the Evening by Australian Ladies of the Y.M.C.A. – Mrs. Neven & Miss Divers – Sydney. Misses Clark. Chapman. MacDonold (Tasmania) Miss MacNeil – W.A. – a real enjoyable Australian night!\n","34":"\n\nSabbath. Tom A. & myself endeavour to visit Tronville but are unsuccessful – Tram journey to St. Address – Seated on the heighest point of Le Havre which commands a wonderful panoramic view of the town & surround\n\nIng country we spend peaceful afternoon – At night we take opportunity of seeing & hearing the Opera – La Traviata – in French.\n","35":"\n\nCommence my study of the French language – Better late than never –\n\nEntertain Seargents at A.G.B.D. – Short account of the Y.M.C.A. Evenings written for Australian Papers.\n","36":"\n\n\"Golden Treasury\" \"Hugo’s French Course\" –\n\nRehearsal –\n","37":"\n\nVisit the Dentist at A.G.B.D. – In the evening I see first Picture Show (French) since coming to this country – Strange to say the girl playing \"lead\" in Star Picture is Enid Bennett from our own Australia.\n","38":"\n\nShow at 40th General Hospital is cancelled – Study of French & English – Wonderful battle successes – Australians always prominent.\n","39":"\n\nMail from Australia – French – A game of billiards at Y.M.C.A. - Again meet Miss Divers (and Y.M. Worker) – H.D. McIntosh in London. – Dentist.\n","40":"\n\nEdition of Aust. Mail – Letters also from England – Study of French continued daily. A new Poem – Show at A.I.B.D. \n\n- Letters answered –\n\nSeptember.\n","41":"\n\nLast performance of tour given at A.I.B.D. (Harfleur) – Supper in Officers Mess.\n","42":"\n\n\"Hugo\" – An afternoon stroll in the company of those who speak the French language –\n","43":"\n\nMore Australian letters to hand – also parcel – Final visit to the Dentist – Preparations for departure –\n","44":"\n\nLast day in Havre. – Meet Bert Fergusson & Charlie Bourne –\n\nEntrain at 4.30 p.m. at Gare De la Merchandese - A long journey in cattle trucks. Disappearance of our Comedian (H.Shaw.)\n","45":"\n\nArrive and disentrain at Corbie (8 a.m.) – In the afternoon we are billeted in the ruins of a \"school\" (L’Ecole Communale) and its attached dwelling place – Our Hall (?) well ventila-\n\nted with shell-holes –\n\nAs \"Corbie\" is a deserted town, as regards civilians it does not take long to furnish out our billets –\n","46":"\n\nProvisions for seating – A morning of manual labour in addition to rehearsal – A new engine (for lighting) – the first since our loss at Bailleul, arrives from England –\n\nFirst show in Corbie – Excellent results.\n","47":" \n\nRehearsal – Show\n\nFatigues etc. – An interesting but pitiable survey of the ruins of Corbie – The interior of a deserted Home,& what it holds for those of sympathy - What is looking? – Jack Neil.\n","48":"\n\nThe collapse of a wall in our dressing room and the fortunate escape of some of our Boys –\n\nHaving a good billet (compressing several rooms) the \"Coves\" decide to set them in the best of good order.\n\nThe most elaborate proves to be the Oriental Room of Messrs. Reade, Gannon, Roberts & Sawyer – My own a very small room is lined & furnished entirely with blue & has blue ornaments blue blinds, blue book case blue table, blue chair etc. and is called the \"blue room\" – \n\nHow long will it last?\n","49":"\n\nRehearsal –\n\nIntroduce a Comedy – (Eastern) written by myself and we commence working on it. Show – \n\nLetter writing.\n","50":"\n\nBusy days – Preparing of new numbers – Our show becomes decidedly better without our \"late comedian\" – \n","51":" \n\nNews of the death of Clarrie Hems –\n\nWeather – becomes colder – Defeat of German counter attacks – Show as usual\n","52":"\n\nStill at Corbie – Meet members of \"Kookaburra\" & \"Sentimental Blokes\" – \n\nFor the first time we stage sketch entitled \"Non- Suited\"\n\nCast:-\n\nThe Clerk in Holy Orders - . G. Sutherby\n\nThe Girl – F. Reade\n\nThe Barrister – Self\n\n - Very successful – An excellent show to a crowded hall. – \n\nAustralian & English Mail – A fitting conclusion to a good day.\n","53":" \n\nFirst rehearsal of \"An Eastern Romance\" – Letter writing – Harold Williams now at Harefield \n\n \n\nOur Engineer Dvr. Smith leaves for Long Service Furlough in Australia – After the show I write a new dramatic sketch for what is called \"The Burglar\".\n","54":"\n\nSabbath – Further decoration to the Blue Room. – Wash clothes – write letters. Weather warm & oppressive.\n","55":" \n\nA never to be forgotten storm – Thunder & lightening as I have never seen before heard or witnessed it. Show as usual.\n","56":"\n\nMore Australian & English Letters, all of which contain good bright news – \"Non-Suited\" still going strong. Rehearsal of \"Eastern Romance\".\n","57":"\n\nRehearsal & Show – Change of programme – Letter writing etc. – My memory plays me false for the first time in the History of \"The Coves\" – I recite part of Xmas Carol, and then suddenly came to an abrupt stop. \n","58":"\n\nRehearsal & Show – Derive much pleasure from reading short biography of R.B. Sheridan & his play \"The rivals\" – A visit by General Carruthers.\n","59":"\n\nFurther British Advance in which Australians greatly distinguished themselves – Commence reading \"The Bancrofts\" – a book of delightful Theatrical Reminiscences – and I also read for the first time the \"Monkey’s Paw\".\n","60":"\n\n\"The Bancrofts\" – a very interesting book of Theatrical Reminiscences – Rehearsal, Show – Wet weather.\n","61":"\n\nLetters written to Australia & England – Washing Day – Task of re-writing the \"Eastern Romance\".\n","62":"\n\nPreparations for change of programme –Complete reading of \"The Bancrofts\" – Closed with a sigh, to be long remembered. – \"Tabloids\" – a farce trag-\n\nedy is played for the first time with wonderful success: Cast:-\n\n\"Sherwood\" (a playwright) F. Reade\n\n\"Thorndike\" (Old Actor) F. Crossley’\n\nKnight (friend of Sherwood) J. Gibb.\n\nProduced by Frank Crossley.\n","63":"\n\nRehearsal of music & dialogue (\"Eastern Romance\")\n\n- The approaching Winter is now most marked –\n\nCommenced reading \"Merry Wives of Windsor\" (Shakespeare)\n\n- Show -\n","64":"\n\nHaving a free evening owing to Engine troubles, - I take the opportunity, & write new and original sketch entitled \"£500\" – Up to date this is certainly my best effort.\n\n- Morning rehearsal.\n","65":"\n\nLetters from London – complete a new poem –\n\nRehearsal of \"Eastern Romance\" & \"The Burglar\". Show resumed. – Crowded house – Cold & wet weather.\n","66":"\n\nRehearsal & Letter Writing. A long &\n\nInteresting walk – Scenes of March & April battles – Cheerful War news.\n\n","67":" \n\nA few of the Coves visit a neighbouring hall & see a performance given by \"The Fanciers\" – a British Concert Party - New concerted themes written – Collaboration with Billy Dick our Pianist.\n","68":"\n\nSabbath – A morning walk along a rather picturesque canal – Coming to suitable resting place, I become seated on a fallen\n\ntree trunk & write a Recitation or short story in Prose – it is the best of my many poor efforts at prose-writing. – Letters to Home & London. Rewrite a number of previously written poems etc. – Preparation of \"Humorous Lecture on Gas\" – taken from \"Punch\". - Early to bed for a change.\n","69":" \n\nRehearsal of \"Eastern Romance\" – \"The burglar\" etc. – Our new man is missing (?)\n\nNo he is not!\n\nOctober.\n","70":"\n\nOur Engine & Dynamo being under repair we deem it inadvisable to show – A visit to the \"Pedlars\" (a neighbouring British Council Party) – A new poem & two new concerted items written.\n","71":"\n\nBulgaria no longer a belligerent – Unconditional surrender – Depression throughout Germany –\n\nRehearsal & read \"Shelley\" – Letters answered.\n","72":"\n\nRe-opening night – Small but enthusiastic audience - Continued allied successes – Are we approaching the end faster than we anticipated? Study my parts in \"The Monkey’s Paw\" –\n","73":"\n\nStill in Corbie & feeling well satisfied – In less than three weeks I have written two sketches, two poems, one monologue and four concerted themes. (The latter for the show) –\n\nFurther British & French successes.\n","74":"\n\nAn abrupt ending to morning rehearsal – Orders to move - In two or three hours we make preparations for departure and load three large motor lorries with personal & Theatrical properties –\n\nA journey of 17 kilometres (almost 11 miles) brings us to Bray-sur-Somme where we are to enjoy the privilege of entertaining our \"1914 Boys\" who are just about to leave for Australia. Bray – (quite recently in German hands) presents \n\nA scene of great disorder. A heavy day – Before turning in I am both amused & enlightened by \"Innocents Abroad\" \n\n(Mark Twain)\n","75":" \n\nSabbath – A few of our boys including myself return to Corbie for purpose of collecting the balance of goods belonging to \"The Coves\" – The country between Corbie & Bray – Original German\n\nBritish front lines of trenches, and of course \"No Man’s Land\" - Here a damaged or perhaps a fallen\n\naeroplane, there a skeleton - Everywhere trophies of War. – First show to the \"1914 Boys\" takes them by storm, and their reception throughout takes us in a like manner.\n\nDiary & Post-Card autographing completes a long day.\n","76":"\n\nTwo shows to the \"Old Boys\" – Great enthusiasm prevails – \"Sari Bair\" – An interrupted matinee & some small incidents concerning same. General Birdwood arrives to bid his original men \"good-bye\" – A sincere speech by the\n\nGeneral is followed by a great outburst of cheering from the Boys – after which they shoulder \"W.B.\" (Birdie)\n\n & carry him to his car – Before completing the action, however, the General quite happily allows himself to be stripped of buttons, numerals and badges. It is plain to see that he is overcome by the scene & is genuinely sorry to see the last of his Gallipoli men.\n\nI would like to know if any other General has such an affectionate regard for \"his Army\" or the Army for him.\n\nAlso if any has been similarly treated or appreciated.\n","77":" \n\nRehearsal & Two shows after which we receive orders to prepare for an early morning departure on the morrow -. \"Romeo & Juliet\" and an incident concerning its conclusion. (Gallipoli)\n","78":"\n\nAfter loading three lorries, we bid the \"1914 boys\" adieu and leave Bray – The first town of importance we pass through is Amiens. – How very different it appears to when I\n\nlast saw it – The beautiful green avenues & parks, in addition to a great many notable buildings have suffered considerably – but what I miss most is the gaiety, the smiling faces, the chatter of French tongues, the flower stalls – all of which made Amiens so bright in the past – Our route lies for the greater part along the banks of the \"historic Somme\" – \n\nAt six o’clock after a journey of 90 k.m. (56 miles) we arrive at a town called \"Eu\" – \n\nThe darkness of the night together with a misty rain does not \n\npermit a survey of our new quarters. – Unload lorries – Bed at midnight.\n","79":"\n\nLast night we slept in a large attic of an Old Monastery – Adjoining it is a large Chateau dating back to William the Conqueror – Since then it has passed into the hands of Louis Philip whose descendants occupy it at present. Its interior has been graced by Queen Victoria. Monsieur Tallyrand etc. etc. – During the day we do more unloading & packing and also move into billets, which by the way\n\nare neither clean nor working – A little diplomacy, however, secures a furnished room for \"C.J. & myself\" –\n\nSweet slumber.\n","80":"\n\nAre, or at least, is the new billet going to prove as comfortable as at first anticipated? –\n\nComplete the reading of \"innocents Abroad\" (Mark Twain) – A free afternoon allows a few of us to visit Le Preport – a seaside resort & naval depot – The weather however is against sight seeing. \n","81":"\n\nA rainy day during which the \"Church of Eu\" is visited. A never to be forgotten evening – \"The Buskers\".\n","82":" (Sabbath)\n\nNews of another move – But why so soon? – Probably to-morrow. That will make \"three in one week\". \n\nSplendid news from all fronts – Cyril (one of our oldest members) leaves our ranks and takes up a position of importance and trust in Camp Commandant’s Office. \n","83":"\n\nNothing unusual happens during the day which is a wet and dismal one. \n","84":"\n\nLoad lorries and leave \"Eu\" at 10 a.m. A journey of one hour and half bring us to Abbeville a town of a fair size, which was heavily bombed before the enemy were forced back. \n\nWe take over the Municipal Theatre (a fine building) and give opening show the same evening. \n","85":"\n\nRehearsal & Show. Good house. Splendid reception. Commence the preparation of the \"Monkey’s Paw\". \n","86":"\n\nExcellent War News. – Important towns recaptured. Brilliant achievements of General Foch – Rehearsal Shows and study.\n","87":"\n\nChange of programme. – Many Australians in town – In taking Lille & Douai General Birdwood has his wish of \"1916\" gratified. \n\nMild weather – The Town of Abbeville\" – A medley written by myself & set to popular melodies goes very well indeed – Commence reading \"Address on the Drama\" (H.B. Irving).\n\nOct.19th\n\nComplete \"H.B. Irving’s\" very interesting book – What a great profession belongs to the true actor; Yes, and in its truest sense how noble is the art of acting.\n\nSome names I have grown fond of – Burbage.\n\nBetterton. Garrick. Kean. Kemble. Macready. Coquelen & Irving.\n\nTonight we have given a capital show to a capital audience and the \"Comforts Fund\" capital is thereby increased.\n","88":" (Sabbath)\n\nA very busy day – During the morning we move to another hall in town. In the afternoon I am busy making arrangements for my production which is coming off to-morrow night.\n\nThis evening I am about to attempt the answering of \"twenty-seven\" letters which came to hand yesterday.\n\nOct.21st\n\nA \"heavy\" day – Dress Rehearsal – Preparation of stage & properties – Booking – In the evening \"Saa - eeda Digger!\" (A Romance of the East) is played for the first time to a very small audience – I am neither satisfied or disappointed _ I must wait & see. – Our manager \n\n(?)\n","89":"\n\nRehearsal in the morning – Evening free. A chance of seeing & hearing \"The Grousers\" (English Show) is readily accepted – A great show. – Commence reading Eugene Grandel.\" (Honoré de Balzac)\n","90":"\n\nSecond night of \"Saa-eeda Digger\" – Audience lager and more enthusiastic. The show goes with a great swing – and I believe for the \"Anzac Coves\" a record number of laughs is scored - \n\nComplete reading Eugene Grandel.\n","91":"\n\nLetters from London - and to Australia – Congratulations on last night’s performance of \"Saa-eeda Digger\" –\n\nPresident Wilson and his judicious replies to German Peace Talk -\n\nDespite the time of the year the weather is fine and far from being cold.\n","92":"\n\nWe leave the Old Theatre and take over the New – Our Eastern comedy is still on the bill and the audience consisting mostly of Australians\n\nIt makes a great hit - Booking duties & rehearsals during the day – The criticism of Major Maclaine, a \"Gentleman of Scotland\", who is interested in theatricals. He says (despite the fact that he is in charge of a very popular Concert Party): \"Saa-eeda Digger!\" has been well written & produced. It is the most original & artistic show I have seen in France. The artists have been excellently cast for the several characters. If there is any fault it is that in parts it is a little too artistic for troops.\n\n\"At the same time it is screamingly funny & really spectacular. Truly a great show.\"\n\n- Then he went on to speak of the acting of two of our people – Hughie Gannon was one of them.\n","93":"\n\nRehearsal of \"Monkey’s Paw\" etc. In this town of Abbeville my time is well occupied – but I manage to join Y.M.C.A. Library, my first book being \"Wisdom & Destiny\" by M. Maeterlinck.\n\nTo-night’s performance the first of the week – \n","94":"\n\nSabbath – Diary – Letters to Home & England – Wisdom & Destiny\" – \n\nMail from Scarborough included a book entitled \"The Treasures of Hamille Maeterlinck) Love’s labour suddenly terminated by a movement order. In a very short time we pack up and leave Abbeville – Return to Eu.\n","95":" \n\nDuring the day we do a great deal of advertising and consequently open\n\nTo a \"capacity house\" –\n\nThe Eastern Comedy makes a decided hit, as at Abbeville – Congratulations by the Major – Letter writing.\n","96":"\n\nA short comedy ‘contemplated’ – Good news – Austria accepts Allies’ terms.\n\n- First rehearsal of Xmas Panto – \"Sinbad the Sailor\"\n\nOct. 29th\n\nConclude Maeterlinck’s book on \"Wisdom & Destiny\" – Previously I have but known this famous author as a Dramatist, now I know\n\nAnd appreciate him as a Philosopher – The Book is productive of most fruitful thought – Letters from London – The weather still favours the Allies –\n","97":"\n\nA day of wonderful news – Turkey surrenders unconditionally – Revolutions start in Vienna & Buda-Pest – The Austrian Premier is assassinated –\n\nAfter a run of nine nights \"Saa-eeda Digger\" is taken off, to be revived again later –\n\nFriday (Oct. 30th) marks the first anniversary of Roy’s Great Sacrifice – I write a simple but sincere tribute.\n","98":"\n\nRehearsal & change of programme – Missing\" letters from Home come to hand – Another of Maeterlinck’s books are read – \"The Treasure of the Humble\" and much enjoyed. \n\nThe end of a great month and one which brings us nearer to Home.\n\nNovember.\n","99":"\n\nRehearsal of \"Sinbad\" – Many are the rumours heard during the day. One concerning ourselves is that we are shortly going to Lille. – Letters written – \n","100":"\n\nThe good news continues - Rehearsal and Show.\n","101":"\n\nSabbath – Rehearsal – Letter writing. - Bad weather sets in. -\n","102":"\n\nA new Allied Offensive on Western Front – many\n\nare confident that it will be decisive. Great unrest in Germany – Change of programme – for the first time (with much success) I recite \"A Letter to the Front\" – and my own sketch entitled \"The Heart of a Burglar\" is also played for the first time.\n\nCast:\n\nThe Burglar … J.T.G.\n\nThe Girl … T. Sutherby\n","103":"\n\nLetters to Australia and England – Read \"The Seen and the Unseen at Stratford \n\n-on-Avon – British & French Advance – Rehearsal of Panto. and Show.\n","104":"\n\nResult of Allied conference at Versailles – \"The only armistice we can offer the Hun is unconditional surrender\" – He must come to Foch with the \"white flag\" – Popular action – Further Allied successes in the field – Continuation of bad weather –\n\n\"Venice\" (D. Pidgeon) provides interesting reading.\n\n \n","105":"\n\nChange of Programme – *\n\nA new recitation entitled \"Retribution\" – and a new & intensely dramatic sketch (by W.W. Jacobs) \"The Monkey’s Paw\" – The latter proves a remarkable first night performance – \n\n- The Cast:\n\nMr White – T. Crossley\n\nMrs. White – T. Sutherby\n\nHerbert (their son) – H. Gannon\n\nSgt. Mjr. Morris & Sampson (a solicitor) – J. Gibb.\n\n- a great hit is made by Tom Sutherby whose emotional\n\nActing is splendid – \n\n- Congratulations all round – \n\n* German delegates arrive in Paris \"re\" the Armistice – and now the entire world awaits the outcome of this conference – Excitement in our town of \"Eu\".\n","106":" Rehearsal of Panto – Many letters written –\n\n- The conference is over and Germany has 72 hours in which to submit to terms – Failing that the War will continue and the longer it lasts \n\n \n\nthe harder our terms must\/will become –Rejoicing in France – Influenza epidemic continues in London and many people are buried daily. –\n\nJust as we are about to give our show, we receive orders to pack up and be ready to move on the morrow. – News from Herb.\n","107":"\n\nGeneral Von Mackensen and six German divisions captured in the early morning. –\n\nToday’s movement order\n\n \n\nCancelled – Abdication of Kaiser Wilhelm – Riots in Germany –\n\nThe Allies advance along the whole line – Half of the prescribed 72 hours have gone by. – We are expectantly waiting. \n","108":"\n\nSabbath – Loading of lorries – Visit local cinema – Quite calm & composed the troops and peoples of the Allies – await the conclusion of the \"72\"! Germany has till 11 a.m. to-morrow to decide.\n","109":"\n\nAs it is decreed that we must rise at 5 a.m., we do so, and are fortunate enough to see a wonderful & inspiring \"red dawn\". Could there be a more fitting & majestic herald of \/to the joyous tidings which we receive a little later. At 11 a.m. hostilities cease, the Armistice has to be signed, and after four years of War & bloodshed, during which the Divine Laws of the Almighty have been\/are ruthlessly corrupted, \"Right prevails over Might – and – Honour, \n\nTruth,\n\n MISERY & DISTRESS \n\n& Justice reap their reward – the reward of Victory, followed by Peace & Happiness – \n\nMy thoughts are firstly of the \"Deity\" and \"Our Saviour\" and then of Australia, Home, and \"my Mothers\" and –\n\nThe Kaiser & Crown Prince leave Germany & go to Holland – German monarchy & despotism at an end –\n\nSocialists take command.\n\nRevolutions in Germany –\n\nDuring the day we travel 130 miles in motor lorries –\n\nAnd passing through Picquigny. Amiens – and between Cambrae and St. Quentin we arrive at Le Cateau at 9 p.m.\n\nDuring the journey evidence of the good news is shown by the display of flags & bunting – and the hope – \n\nLast of all are the German prisoners working on the roads, who wave and smile as we pass – Our own lorry is well decorated and attracts considerable attention –\n\nSpend night in shell shattered & deserted shop –\n","110":"\n\nAwake & feel much refreshed after a wash and a cup of tea – the first of both for 36 hours – mere detail!\n\nLe Cateau. A town of fair size with large church & municipal buildings and important factories & machinery works – Captured or taken in 1914 by the Germans and recaptured by British in October of this year – The town is badly damaged and the Hun has deliberately destroyed houses of manufacture together with plant – Streets and dwellings \n\nabound with German writing and military terms – Bridges & railway crossings were heavily mined during the Hun retreat, but these destructions have since been repaired –\n\n- Visions of the \"Good news\" in Australia.\n","111":"\n\nA poem entitled \"The Day of Peace\", written during the day – Also letters. An afternoon survey of Le Chateau – \"The Daily Mail\" with its Armistice Terms and London news provides great reading. \n","112":"\n\nA quiet uneventful day – Rehearsal of Pantomine.\n","113":"\n\nLe Cateau full of troops –\n\nLetters to Australia & England.\n","114":"\n\nOn the outskirts of this town are large vegetable gardens which were used by the enemy during the occupation of this area. The cabbages,\n\nTurnips etc. that he has left behind are most welcome – also the huge stock of coal which he could not move in his great hurry.\n\n- Rehearsal.\n","115":"\n\nSabbath. Letters, Rehearsal & Reading – \"Silas Marner\" – \n\nSee the \"Pierrots\" (25th Div. Concert Party) who were showing in London just previous to our own season. – Later in the Evening, in the company\n\nof six other \"Coves\" I go to the Mess of the G.O.C. where we entertain many H.Q. Officers – Their quarters are in the Chateau that Prince Ruprecht (son of Kaiser) had for H.Q’s. –\n","116":"\n\nThe Terms of the Armistice are being carried out as dictated – Part of the German Fleet in British waters –\n\nBobby Roberts leaves for Paris. \n","117":"\n\nFred Reade returns from London with new costumes – Tales of London in the \"New Peace’ –\n\nRead \"King John\"\n\n- Rehearsal .\n\n- Another visit to the \"Pierrots\" – Excellent show.\n","118":"\n\nGerman mines still exploding in the neighbourhood –\n\nDress rehearsal of all Corp men –\n\nRumour hath it that we are to proceed to Germany for two or three months – Rumour also hath it that we are shortly to proceed to England. Which is correct? Neither I expect. – A dramatic episode entitled \"The Brother\", written during the evening.\n\nNov.21st\n\nRead King Richard II – Rehearsals of Pantomime –\n\nOnce again the pro- \n\nposed tour of U.S.A. is spoken about –\n\nWill we go? Yes! Why not.\n\n- A concerted item –\n\n\"The Dream Girl\".\n\nLetter from Herb, who will shortly leave England for France.\n\n- The reading of many sketches – \n","119":"\n\nDuring the day many explosives are heard – They are Old shells being exploded out in the fields \n\n- Diary. Rehearsal of Sinbad.\n","120":"\n\nNew members join our Party – Continuation of Rehearsals but no shows –\n\nNew verses written\n","121":" (Sabbath)\n\nFurther additions to the strength of our Company – Le Cateau holds but little interest for us, and the days are now most uneventful –\n\n\"Sinbad\" – Letters.\n","122":"\n\nLetter from Herb\n\nwho with Marl is now in France (A.G.B.D. – Havre)\n\n- There is still a chance of his joining \"The Coves\" –\n\nA sketch entitled \"Army Discharge Office\" written during the day –\n","123":"\n\nRehearsal – Commence another \"Maeterlinck Book\" – \"The Life of the Bee\" – It is highly interesting – In the evening we visit the G.O.C’s Mess for a second time and there entertain General\n\nMonash and other Officers – The General’s speech. -\n","124":"\n\nMore song verses written – \"The Life of the Bee\" – \"Where is the Australian Mail?\" \"How do I know!\" All right don’t get nasty.\n","125":"\n\nW.O. Carlisle arrives back from Havre – News of Herb – Weather growing much colder – Scarcity of news – Another visit to the Pierrots.\n","126":"\n\nThe return of civilisation to Le Cateau – Many come back only to find their Homes either looted or one mess of wreckage.\n\n- \"Emerson’s Essays\" –\n\nRehearsal (Twice daily)\n","127":"\n\n\"Emerson\" continued – Letters to and from England – Pantomime costumes arrive from Hyman’s (London) –\n\nGreat progress with \"Sinbad the Sailor\".\n","128":"\n\nSabbath – Rehearse during the morning & again in the Afternoon – A new recitation written – Also letters – Many French soldiers (picked troops by their appearance) pass through our town on their way to occupy German territory.\n","129":"\n\nA day of rehearsal, and also preparation for to-morrow’s move.\n\n- Diary – \n","130":"\n\nPack up, load lorries and leave Le Cateau at 9 a.m. – During our journey (by road) we halt at one point to allow the King & Prince of Wales to pass. The Royal party are at present visiting French Towns.\n\n- Arrive 2 p.m. at Avesnes. A good but crowded billet.\n","131":" \n\nA day which is spent at the small hall where we are to show – The Germans have left it in\n\nrather a poor state and we find it impossible to open in the evening.\n","132":"\n\nThe hall a small but compact building – very suitable for dramatic work and sketches – House booked up by mid-day.\n\n- Afternoon rehearsal –\n\nNight show –\n\n\"A Letter to the Front\" –\n","133":" \n\nAvesnes is a fair sized town and apparently of industrial importance \"avant la guerre\"\n\nFor some time, \"Le chateau, a commanding edifice, was the residence of the Ex-Kaiser and Hindenburg. The people of Avesnes have suffered greatly during the last four years and are now a broken town, poverty stricken populace – \"The spirit is still there though, I’ll warrant!\" –\n\n- Letters written & received\n\nShow as usual.\n","134":"\n\nRehearsal of Panto – More of Emerson’s Essays read –\n\nMeet Harry Creer\n\nFrom Balmain – Sid Alder & news of Harry.\n","135":"\n\nSabbath – Letters & Xmas Cards from Australia make a good beginning.\n\n- A morning walk to St Hilaire – German rail-road destruction – \n\nLetter writing – \n","136":" \n\nRehearsal & Show. Pay day. \n\nThe new Camp Commandant – Major McFarlane –\n\n- Letters to Home\n","137":"\n\nRehearsal of \"Sinbad\". Mild but rainy weather –\n\n\"Emerson\" & \"Shakespeare\".\n","138":"\n\nThe first word \"re\" demobilisation papers.\n\nAust. Corps. H.Q. leave Avesnes for Havre – \"Anzac Coves\" remain.\n\nShort poem written.\n\nLast night of present programme. – Success of \"A Letter to the Front\" –\n","139":"\n\nA little fury –\n\nLetter to Mr. Fitzsimons – \n\nNews regarding Paris Leave.\n","140":" \n\nGreat unrest in Germany – Read and very much enjoy \"Daddy – Long-Legs\" (Jean Webster) Change of programme – \n\n\"The Burglar & the Girl\" once again – Hughie leaves for Valenciennes.\n","141":"\n\nAssasination of Czar & Family –\n\nAttempted suicide\n\nof the Kaiser – National dispute between Holland and the Entente –\n\nArrival of President Wilson in France –\n\nGreat political campaign by Mr. Lloyd George –\n","142":"\n\nA day which consists entirely of Rehearsal & show.\n\nDec.16th\n\nAustralians still moving forward to Northern Areas –\n\nSocial & Political\n\nTroubles in Germany –\n\nRequest for Allied Aid – \n\n- \"Emersons\" whiles away the evening hours.\n","143":" \n\nHughie returns –\n\n - Good news concerning leave to Paris –\n\n- Cold rainy weather –\n\nAllied troops impress the peoples of Cologne and other Rhine towns.\n","144":"\n\nPantomime preparations – Letters & Diary – Uneventful days in an uninteresting town, where\n\nboot-laces may be bought for 5 francs a pair, soap for 4.50 & sugar for 25 francs a kilo.\n","145":"\n\nLast show in Avesnes.\n\nSome good friends in the R.A.P.t. – \"Emerson’s Essays\" – Our different versions of the \"Village Concert\" – \n","146":"\n\nA morning of preparation – At 2 p.m. Fred, Harry & myself leave Avesnes bound for Paris.\n\nThe first stage of the journey from Avesnes to Le Cateau is made in a motor lorry – We rest for the night in this latter town & enjoy the hospitality of the owner of the billet which we occupied a few weeks previous –\n","147":" \n\nRise 6 a.m. and walk 8 kilo’s to Bertry.\n\n- At 10 a.m. entrain for Busigny – Then on to Cambrai – Change trains at Cambrai –\n\nfor Amiens – Spend 7 or 8 hours in Amiens and sleep on station.\n","148":"\n\nTake Paris bound train at 3.30 a.m. and arrive there at 7.30 a.m. – Report to A.P.M. & Military Doctor at \"Caserne Pepiniere\" - A lecture which is necessary – First glimpse of Paris – Drive to Windsor Hotel (Aust. Y.M.C.A.) Thence to Salvation Army Hotel in Rue des Petits Champs where a room is booked –\n\nA journey in the Metro (Underground Tramway) to Hotel de Ville from where Fred & I cross the Seine and enter Notre-Dame the largest church in Paris founded in 1163 – The exterior presents a grand spectacle of towers, spires, statues, reliefs and carvings - Capacity 20,000 people – Largest Organ in Europe. Interior – vast but sober & simple –\n\nFirst impression of Paris: A great city of beautiful & imposing\n\nbuildings, boulevards, streets, parks, columns, statues, and a light-hearted, merry and enthusiastic populace –\n\n - Evening visit to Cinema and early to bed for I am rather fatigued.\n","149":"\n\nBy special invitation three of us visit \"La Madaleine\" and attend a service given for \"departed French Heroes\" –\n\nThe Mass conducted in ceremonious fashion by the Arch-Bishop\n\nand supplemented by two Grand Church Organs, one Orchestra and Parisian Operatic Vocalist is extremely impressive.\n\nIt is religiously indescribable – \n\nLa Madaleine (or Church of Mary Magdalene) was commenced by Louis XV in 1764 (Cost £520,000) – The scene of street fighting during revolution of 1789-92 –\n\nVisit Place de la République where stands the Army & Navy Leave Club.\n\nMeet Miss Butler, founder of the \"Corner of Blighty,\" and greatly enjoyed the privileges that the fine institution affords –\n\n- The Corner of Blighty and its Origin –\n\nAn afternoon trip (with Guide) to Castle of Versailles, which greatly dwarfs Buckingham Palace –\n\nVersailles Palace commenced in the 17th century by Louis XIII – remains now central portion of present edifice – Reconstruc-\n\n-ted by Louis XIV – Residence of Royal Families till 1789 - Imposing gardens, fountains & walks\n\nAt night we return to Paris and enjoy a Variety entertainment at the Nouveau Circuit.s, fountains & walks – Magnificent chambers, galleries and works of Art – (See Guide Books).\n\nAt night we return to Paris and enjoy a Variety entertainment at the Nouveau Circuit.\n","150":"\n\nShopping in the Rue de Rivoli (a fashionable street, famous for its arcades)\n\nLetter writing – A stroll along the Rue do Rivoli and into the Gardens of the Tuileries (originally the site of \"tileries\" – hence the name) – Beautiful lawns gardens & walks. Also fountains and statues – Must be seen in Summer to be fully appreciated –\n\nIn the Evening (by request), a few of our \"Coves\" give a short entertainment at the Corner of Blighty – and then accompanying Fred Reade I visit Monsieur & Madame Griffie\n\nAnd great enjoy Parisian hospitality – Songs & supper.\n\nDec.25th (Xmas Day 1918)\n\n(Noel) – Spend a few minutes at Notre-Dame (Xmas Mass) –\n\nA very pleasant promenade along the Champs Elysees, the entire length of which lies between the Arc de Triomphe & Place de la Concorde – Laid out in the 17th century – Resort of pleasure seeks –Scenes of animation – Very fashionable quarter. \n\nCross the Seine by Pont Alexandre III, the most imposing of the thirty odd bridges which cross the Seine –\n\nPass in turn Palais de l'Élysée (residence of Pres. of Repub.) – and then Grand Palais & Petit Palais both of which contain works of Art, but at present like many other institutions are closed to the Public, owing to Wartime removals of paintings – \n\n- At midday we visit Madame & Monsieur and \n\nGreatly enjoy a French Xmas Breakfast, – included in the many dishes is an English pudding for the two guests. – A pleasant afternoon and a Xmas Dinner at 8 p.m. given to a dozen Australians and a Canadian by our dear friend Miss Butler – A very merry and light hearted Party.\n\n- Midnight celebrations in the Boulevards – The end of a very happy Xmas Day –\n","151":"\n\nVisit Place de la Bastille, where stood the Old Bastille prison destroyed by the mob on","152":" (Revolution) In the centre of this Place stand the \"July Column\" - - Memories of Doctor Manette and 105 North Power – \n\nPlace de la République and its Grand Statue on which is depicted the various stages of the French Republic –\n\nAnother visit to Madame \n\nGriffie (whose home is near Toulouse, but who, with her husband is doing work of National importance in Paris) – With Madame & Monsieur, - Fred & I go to the English Theatre and see \"General Post\".\n","153":"\n\nA morning walk – Boulevard, Rues & Parks – How very rich Paris is in all three. – Meet Ian McLay, W. Green & Frank Jones)\n\nIn the afternoon Mc & I visit the Alhambra\n\nWhere we witness an excellent Charity Matinee – Later we go to the Olympia and occupy a stage-box for which we do not pay and necessarily must vacate – The Music Hall and their Promenades - *\n","154":" \n\nAnother visit to Notre-Dame and some old churches in its vicinity –\n\nThe Morgue, which I am not allowed to, enter –\n\nThe Place de la Concorde\n\n(according to Cook’s, the finest Place in Europe)\n\n Situated between Garden of Tuileries and the Champs Elysees – It has a tragic history. During a fireworks display over 3,000 were killed & injured – Later it was the site of the Guillotine when so many were beheaded during the Reign of Terror –\n\n- In the centre of the Place stands the Obelisk of Luxor, a sister stone (weighing 240 tons) to Cleopatra’s Needle,\n\nFountains & Statues also adorn the Place – and on it were encamped in 1815 the British Army and in 1871 the Prussians – Admission to the \"Pantheon de la Guerre\" reveals modern art – This huge painting which took 19 Artists over three years to complete is a masterpiece of united effort – Its landscapes as realistic as its portraits are lie-like – Magnificent! \n\nPere la Chaise – (the National burying Ground of France) It covers 110 acres & contains some wonderful tombs.\n\n- In it are buried Chopin. Rossini. Balzac. Racine. Moliere. Oscar Wilde etc. \n\n- In the evening a party of us go to the Opera House (the largest & no doubt the most magnificent Theatre in the World) and hear the Grand Opera – Aida – The gorgeous production is only\n\nequalled by the remarkable standard of Voices. – Beechams Opera greatly suffers in comparison – \n\n- Opera House interior –\n\n- Paris by night –\n","155":"\n\nMorning & afternoon trip in ‘Charabancs’ around Old Paris –\n\nMiss Butler proves more than an ordinary guide and makes the excursion doubly interesting – \n\n- The places of importance visited are the Musee de Cluny – Roman\n\nAmphitheatre & Remains - Pantheon – St. Etienne – du Mont – Island of Cite (Lutetia: the original Paris)\n\n- Interesting facts regarding all of these will be found in the \"Guide Books\" – Paris: Its Life & Morals –\n\n- Cinema –\n","156":"\n\nA day chiefly spent in walks around this beautiful Paris, which I have quickly learned to love and to marvel at – \n\nOne future day I shall again visit and admire its Art & Beauty –\n\n- \"O London whatever were you thinking about, to sit by the roadside and delay in the great march of progress! –\n\nThe Trocadero. Palais de Justice – Paris Railway Station – Superior Underground Tramways – Stock Exchange – A third visit to Madame Griffie, for whom\n\nI have written a poem entitled \"Australians in France\" – Madame’s musical compositions and the achievements of her brother & sister – The Paris Conservatory of Music & Dramatic Art –\n","157":"\n\nNew Year’s Eve – Visit the Eiffel Tour (Highest structure in the World – 984 ft) – A wonderful landmark – (See Guide) \n\n- Napoleons Tomb – in the Church of the Invalides –\n\nIt was to this spot that Napoleon’s remains were brought from St. Helena. Near the entrance (in the chapel) is written – \"Je désire que mes cendres reposent sur les bords de la Seine, au milieu de ce peuple français que j'ai tant aimé– \n\nAdjoining the chapel & tomb is a large hall containing War relics & captured Standards. – \n\nAnother part of \"des Invalides\" – visited con-\n\n-tains ancient & modern pieces of cannon & also the remains of a destroyed Zeppelin – \n\nIn the evening a previously arranged meeting of Australians on Leave in Paris takes place and we all journey to the \"Folies- Bergere\" a music hall of much popularity to spend the last night of the Old Year in a good Australian fashion –\n\nTo describe the proceeding would be rather difficult.\n\nIt will suffice to say that we achieved our object in view – after which we marched along the Boulevards with French, British, Australian, American Flags to the accompaniement of cornets, bagpipes, drums etc. and singing the \"Marseillaise\" and \"Australia Will be There\" – So ends in a happy fashion a year of bloodshed, sorrow, Victory & Peace.\n\nA Happy New Year to All.\n\n"}}