{"Document Name":{"0":"Diary_0405","1":"Diary_0405","2":"Diary_0405","3":"Diary_0405","4":"Diary_0405","5":"Diary_0405","6":"Diary_0405","7":"Diary_0405","8":"Diary_0405","9":"Diary_0405","10":"Diary_0405","11":"Diary_0405","12":"Diary_0405","13":"Diary_0405","14":"Diary_0405","15":"Diary_0405","16":"Diary_0405","17":"Diary_0405","18":"Diary_0405","19":"Diary_0405","20":"Diary_0405","21":"Diary_0405","22":"Diary_0405","23":"Diary_0405","24":"Diary_0405","25":"Diary_0405","26":"Diary_0405","27":"Diary_0405","28":"Diary_0405","29":"Diary_0405","30":"Diary_0405","31":"Diary_0405","32":"Diary_0405","33":"Diary_0405","34":"Diary_0405","35":"Diary_0405","36":"Diary_0405","37":"Diary_0405","38":"Diary_0405","39":"Diary_0405","40":"Diary_0405","41":"Diary_0405","42":"Diary_0405","43":"Diary_0405","44":"Diary_0405","45":"Diary_0405","46":"Diary_0405","47":"Diary_0405","48":"Diary_0405","49":"Diary_0405","50":"Diary_0405","51":"Diary_0405","52":"Diary_0405","53":"Diary_0405","54":"Diary_0405","55":"Diary_0405","56":"Diary_0405","57":"Diary_0405","58":"Diary_0405","59":"Diary_0405","60":"Diary_0405","61":"Diary_0405","62":"Diary_0405","63":"Diary_0405","64":"Diary_0405"},"Date":{"0":"unknown","1":1417.0,"2":1418.0,"3":1420.0,"4":1421.0,"5":1422.0,"6":1426.0,"7":1427.0,"8":1428.0,"9":1429.0,"10":1439.0,"11":1440.0,"12":1441.0,"13":1442.0,"14":1443.0,"15":1444.0,"16":1445.0,"17":1446.0,"18":1447.0,"19":1448.0,"20":1458.0,"21":1459.0,"22":1460.0,"23":1461.0,"24":1463.0,"25":1483.0,"26":1484.0,"27":1485.0,"28":1492.0,"29":1493.0,"30":1494.0,"31":1495.0,"32":1496.0,"33":1497.0,"34":1498.0,"35":1503.0,"36":1504.0,"37":1505.0,"38":1506.0,"39":1507.0,"40":1508.0,"41":1523.0,"42":1524.0,"43":1541.0,"44":1555.0,"45":1574.0,"46":1575.0,"47":1576.0,"48":1581.0,"49":1582.0,"50":1587.0,"51":1590.0,"52":1592.0,"53":1593.0,"54":1596.0,"55":1597.0,"56":1601.0,"57":1607.0,"58":1608.0,"59":1616.0,"60":1617.0,"61":1623.0,"62":1624.0,"63":1633.0,"64":1638.0},"Entry":{"0":"\n\n","1":"\nLeft Godford for Southampton changed at Salisbury arrived at the boat Wharf about 12.30 o’clock, had a fairly good crossing and arrived at Le Havre that night.\n","2":"\nMarched up to the base camp where we stayed for three days, were finally medically examined equipted with rifle bayonet, gas helmets, ammunition and after going through the gas chambers left for Castre on the night of the","3":" .\n","4":"\nIt was frightfully wet and we had a long march of 12 miles to the train in which we were captives for 24 hours.\n","5":"\nArrived at Castre camp. Fritz was bombing and was not altogether friendly towards our entry into France. We stayed here until the","6":" as the battalion was coming out of the line after the Ypres stretch for a long promised spell.\n","7":"\nWe motored from here to a place called De Lettes and then had another long push to Eruy St Julien where I officially joined up the 45th Bn.\n","8":"\nFrom the","9":" to the","10":" we spent most of the time cleaning up and drill parades in the morning.+ sports in the afternoons and on the","11":" we started an 8 days route march passed through Bomy and Fruges, arrived at Russeauville and billeted 15th Kilos\n","12":"\n\nLeft for Wambercourt a distance of 10 kilos.\n","13":"\nLeft for Torlefontaine, 12 kilos, plenty of apples and the country very pretty. The apples helped eke out scanty rations.\n","14":"\nLeft for the Somme region arrived Fontaine –S- Maye billeted 12 kilos. \n ","15":"\nResting here a day & leave granted to Crecy. Saw the cross and old battlefield. Had a feed of steak and chips. very hard to get. Also plenty of apples.\n","16":"\nLeft Crecy for Hautvilliers, 10 kilos.\n","17":"\nLeft for Frauleu, 16 kilos dinner on route.\n","18":"\nLeft for destination St. Quentin arrived & allocated good billets 15 kilos Walked round village which is a fair size and close to the Channel.\n","19":" \/2nd Dec\nTime taken up with usual parades inspections sports. Leave granted to Ault a lovely little spot on sea coast. Leave\n\nalso granted to Eu and Freport two most lovely places. \n","20":"\nLeft for divisional school at Oust Mares. Rented bedroom with Cliff Bingham & then we went into Em for tea at a Belgian place. A sort of 99th rate eating house where we could get a feed for nix. Sweet are the uses of adversity.\n","21":"\nLeft for the next village Marest got another bedroom with \"Bing\". Village very modern. English style. Built by Sunlight people .Nice people .Rue de Fichen was the name of our swagger abode .Factory now making ammunitions.\n","22":"\nHurried recall to Battalion packing up for forward area returned to St. Quentin. \n","23":"\nLeft for Eu and entrained for Peronne area Amiens and Albert. Arrived destination about midnight, had a drink of tea spent the next 48 hours on Peronne Station unloading etc from trucks.\n","24":"\nLeft for Haut Allames. Firtz attacking heavily at Cambrai, all the country around is spoilt. Peronne and villages around are in ruins .Peronne once been a large town. Billeted in huts here out side of the \"once was\" village.\n","25":" \nFrom the","26":" to","27":" we had our usual parades taking ridges and stunts every day. Was sent into Peronne for a week on salvage work and on the","28":" was warned for the re -assembly of the Div. School. At Haut Allames which continued until","29":" when \n","30":"\nwe returned to the Battalion. The weather all during our stay up here was\nintensely\n cold.\n","31":"\n Left H.A. marched to Peronne & entrained for Bailleul 14 hours in train-had slight collision one truck smashed..\n","32":"\n Arrived Bailleul detrained and marched to Meteren .Snowing very heavily, was on guard during the train journey and things altogether looked blue. \n","33":"\nLeft Meteren for Gadewaersvelde five miles & entrained for the front. Left train near Brasserie & marched to tunnels at Spoil Bank & rested oh blessed rest.\n","34":"\nRemained in the tunnel until after lunch & Battalion left for front line.\n","35":"\nFrom the","36":" to","37":" was in front line in reserves. Was in a pill box when in the line on company headquarters. Had trench fever very badly.\n","38":"\nWas warned for Divisional School again at Scherpenburg and for the first fortnight was still very bad with fever but picked up again.\n","39":"\nWalked into Bailleul to get something for Leonie’s","40":" birthday but only managed to get a lace collar hand made. It was certainly very dainty.\n","41":"\nRejoined battalion at Parralt Camp after finishing the 4 weeks course at the school and passing fairly well visited La Clytte & Looe etc.\n","42":"\nFrom","43":" to","44":" was doing fatique right up to the front line at spoil bank & left on this day for Bailleul. Billeted in a very clean barn on a respectable sort of farm as farms go over here. People very kind and always willing to give one hot water to wash in as it was very cold first thing. \n Paid one or two visits to Bailleul while here, we were a mile or so out of the town and also saw the smart set.\n","45":"\nOrdered to the front again to assist on the Somme. During the last three weeks Bailleul was being shelled heavily and bombed at night. People forced to evacuate. It was a very sad sight to see them leaving their homes. While here I was on the telephone in the orderly room and on the Sunday before leaving was warned for a school but owing to the German offensive starting again all schools were broken up. Motored to Arras stayed at Bailleulmont with Scots Guards.\n","46":"\nLeft Bailleulmont for Albert sector 9.30pm marched all night distance (33 kilos 22 miles) fighting order arrived at Senlis 7am. Very weary tired footsore shoulders aching. Rested for two hours & then went up to Mellencourt.\n","47":"\nFritz shelling very heavily. The people had only left the village that day & we saw the last of them go. Meals were left on the tables & on the fire. Dig in and that night up to Deinacourt. Here we stayed a day or so. I forget the exact time in reserves. Then we went up to the front line and were in an outpost for 24 hours. Fritz holding one end of this trench and we the other. After that we came back to the front line & here I spent Good Friday, Saturday & Easter Sunday. That night we were relieved by another Company & took up another portion of the Front Line in front of Dernacourt which was no mans land.\n\nFill in later.\n","48":"\nRelieved by","49":" Division 6^ Brig and marched to Baizeux where we billeted in barn very wet weary tired and hungry.\n","50":"\nA few H.V. Shells came over fairly close. Left for Querrien a long march, billeted stayed here until the\n","51":"\nwhen we left for Cardiuette about six miles - here we stayed for 2 days and on the\n","52":"\nmarched into Frechencourt 6 kilos .Lovely day- arrived in billets.\n","53":"\n Left for La Houssoye 4 kilos, billeted. Here we stayed until the","54":" Many air raids by Fritz and the Madonna from Albert Cathedral fell on the","55":" by Fritz shell fire. \n","56":"\nLeft for La Houssoye for Querrien 4 kilos. While here saw Tom Holt several times & stayed here until the","57":" when the Battalion went up the line. I was left out with the reserves. Villiers- Brettoneux was the front they went to.\n","58":"\nReserves left for Allonville and were camped in the wood there until the","59":" when we had a long march to\n","60":"\nBerteancourt. This was a fairly nice place and a good way back almost out of of guns unless the bombard was very heavy. The reserves were called up but I still remained out.\n","61":" \nLeft for the transport lines. Marched from Berteuucourt to Vauxy spent one night in tents & on the\n","62":"\nReached T lines at La Mont & stayed there until the \n","63":"\nwhen we left for Amiens where the Battalion joined us early on Wednesday morning \n","64":"\nStill at Amiens in the Rat House.\n\n"}}