{"Document Name":{"0":"Diary_0392","1":"Diary_0392","2":"Diary_0392","3":"Diary_0392","4":"Diary_0392","5":"Diary_0392","6":"Diary_0392","7":"Diary_0392","8":"Diary_0392","9":"Diary_0392","10":"Diary_0392","11":"Diary_0392","12":"Diary_0392","13":"Diary_0392","14":"Diary_0392","15":"Diary_0392","16":"Diary_0392","17":"Diary_0392","18":"Diary_0392","19":"Diary_0392","20":"Diary_0392","21":"Diary_0392","22":"Diary_0392","23":"Diary_0392","24":"Diary_0392","25":"Diary_0392","26":"Diary_0392","27":"Diary_0392","28":"Diary_0392","29":"Diary_0392","30":"Diary_0392","31":"Diary_0392","32":"Diary_0392","33":"Diary_0392","34":"Diary_0392","35":"Diary_0392","36":"Diary_0392","37":"Diary_0392","38":"Diary_0392","39":"Diary_0392","40":"Diary_0392","41":"Diary_0392","42":"Diary_0392","43":"Diary_0392","44":"Diary_0392","45":"Diary_0392","46":"Diary_0392","47":"Diary_0392","48":"Diary_0392","49":"Diary_0392","50":"Diary_0392","51":"Diary_0392","52":"Diary_0392","53":"Diary_0392","54":"Diary_0392","55":"Diary_0392","56":"Diary_0392","57":"Diary_0392","58":"Diary_0392","59":"Diary_0392","60":"Diary_0392","61":"Diary_0392","62":"Diary_0392","63":"Diary_0392","64":"Diary_0392","65":"Diary_0392","66":"Diary_0392","67":"Diary_0392","68":"Diary_0392","69":"Diary_0392","70":"Diary_0392","71":"Diary_0392","72":"Diary_0392","73":"Diary_0392","74":"Diary_0392","75":"Diary_0392","76":"Diary_0392","77":"Diary_0392","78":"Diary_0392","79":"Diary_0392","80":"Diary_0392","81":"Diary_0392","82":"Diary_0392","83":"Diary_0392","84":"Diary_0392","85":"Diary_0392","86":"Diary_0392","87":"Diary_0392","88":"Diary_0392","89":"Diary_0392","90":"Diary_0392","91":"Diary_0392","92":"Diary_0392","93":"Diary_0392","94":"Diary_0392","95":"Diary_0392","96":"Diary_0392","97":"Diary_0392","98":"Diary_0392","99":"Diary_0392","100":"Diary_0392","101":"Diary_0392","102":"Diary_0392","103":"Diary_0392","104":"Diary_0392","105":"Diary_0392","106":"Diary_0392","107":"Diary_0392","108":"Diary_0392","109":"Diary_0392","110":"Diary_0392"},"Date":{"0":"unknown","1":372.0,"2":373.0,"3":374.0,"4":375.0,"5":376.0,"6":377.0,"7":378.0,"8":379.0,"9":380.0,"10":381.0,"11":382.0,"12":383.0,"13":384.0,"14":385.0,"15":386.0,"16":387.0,"17":388.0,"18":389.0,"19":390.0,"20":391.0,"21":392.0,"22":393.0,"23":394.0,"24":395.0,"25":396.0,"26":397.0,"27":398.0,"28":399.0,"29":400.0,"30":401.0,"31":402.0,"32":403.0,"33":404.0,"34":405.0,"35":406.0,"36":407.0,"37":408.0,"38":409.0,"39":410.0,"40":411.0,"41":412.0,"42":413.0,"43":414.0,"44":415.0,"45":416.0,"46":417.0,"47":418.0,"48":419.0,"49":420.0,"50":421.0,"51":422.0,"52":423.0,"53":424.0,"54":425.0,"55":426.0,"56":427.0,"57":428.0,"58":429.0,"59":430.0,"60":431.0,"61":434.0,"62":435.0,"63":436.0,"64":437.0,"65":438.0,"66":439.0,"67":440.0,"68":441.0,"69":442.0,"70":443.0,"71":444.0,"72":445.0,"73":446.0,"74":447.0,"75":448.0,"76":449.0,"77":450.0,"78":451.0,"79":452.0,"80":453.0,"81":454.0,"82":455.0,"83":456.0,"84":457.0,"85":458.0,"86":459.0,"87":460.0,"88":461.0,"89":462.0,"90":463.0,"91":464.0,"92":465.0,"93":466.0,"94":467.0,"95":468.0,"96":469.0,"97":470.0,"98":471.0,"99":472.0,"100":473.0,"101":474.0,"102":475.0,"103":476.0,"104":477.0,"105":478.0,"106":479.0,"107":480.0,"108":481.0,"109":482.0,"110":483.0},"Entry":{"0":"\n\n","1":"\nIn Arabian Sea. Sighted several vessels going east. Lectures and reading.\n","2":"\nSame routine. Was vaccinated in 3 spots on right arm.\n","3":"\nNo lectures. Attended both church parades; also \"sing song\" in evening between dinner and evening service. Singing extremely hearty; All familiar tunes. Practice for\nfire\nalarm for Collision.\n\nJANUARY1915\n","4":"\nLectured to men in morning, and to nurses and men in afternoon. Campbell discussed the question of changing guards from \"ceremonial\". Snapped officers playinghockey.\n\nPassed \"the Brothers\" 30 miles to starboard in the afternoon, two high flat topped islets very similar in outline. Seaweed. Met several vessels &including one transport.\n","5":"\nPassed Cape Guardafuiat 7 a.m.\nPassed\na steamer \"Thermos\" to starboard at 6 p.m. Never passed anything mobile before! Gave 3 lectures. Saw 2 feluccasto port this morning.\n","6":"\nFelucca to starboard 3 miles off at 7 a.m.\n\nAden 3 p.m. anchoring outside harbour & flying yellow flag, Big grey liner \"Empress of Russia\" anchored 1mile away. Stayed till 11 p.m. Repairing machinery.Left ½ an hour after the converted cruiser. Mountain behind Aden titanic. Moonrise beautiful. Lectured \n3\n 4 times, Officers, Tasmanian nurses and men (twice).\n","7":"\nEntered Bab-el-Mandeb by western side of Perim at 7 a.m. \"Empress of Russia\" and another converted cruiser \"Himalaya\" (P.&O.) watching the entrance & examining all vessels. \"Liebenfels\" a German prize from Bombay with cargo entering just behind us. Met 11 a.m. another converted cruiser \"Empress of Asia\" going South. Passed Jebel Hamar and lighthouse on Abu Ail at 5 p.m. Beautiful white just within the straits.Weather fine, cool.\n","8":"\nSaid to be 12 converted cruisers in the Red Sea. No other ships; sea, and no land all day.Lectured to Officers of C.H., nurses, & men.Weather warm. A lot of dragonflies came on board at night.\n","9":"\nNo sight of land or ships. Very rough wind (head) early this morning; roughest sea since Bass Straits. Lectured to Officers and men. Weather cold. Nausea for a while this morning; but had all my meals. Vaccination practically no result.\n","10":"\nAttended Church parade & evening prayers. Passed Daedalus shoal 1.45 p.m. Officer of the day.\n\nJANUARY1915\n","11":"\nEntered Gulf of Suez 7 a.m. desolate country on both sides. Arrived Suez 8 p.m. Doctor naval Military Officers came off. Finished letter home. Saw snow on mountain to the east of Gulf of Suez.\n","12":"\nSaw a lot of letters fall into the sea; hope mine was not amongst them. Am Officer of the day (5th time). Left Suez & entered Canal 12.45 p.m., passing close to battleship Ocean. Indian troops lining the shores of Canal with trenches wire entanglements etc. Some troops along Canal near Ismalia saidthey were Australian Engineers. Heard the Turks were 2 days march from Ismailia. Arrived Port Said about 2 a.m. Coal & water.\n","13":"\nWent ashore for 2 hours. Left for\nAlexandria\n5 p.m. Colonel Martin went to Cairo for orders.\n","14":"\nArrived Alexandria 8 a.m. Pleasant weather. Probably all be landed here. Anchored. No shore leave today till 6 p.m. when 48 hours allowed to Senior officers. Tonight cold wind from the north west.\n","15":"\nWent ashore. Strange polyglot crowd, Egyptians, Italians, Greeks, Arabs, French, Jews, British. Went to Cook's, Pompey's Pillar, Catacombs, Canal to Cairo etc. U.S.S. Tennessee came in & anchored near us, landing 500 Jewish refugees from Turkey.\nMany went trip to Cairo leaving ship at 6 a.m. & returning 11 p.m. Weather cold & windy.\nSent 3 post cards to mother (pictures) without writing\n","16":"\nShowery morning. After lunch went by train to Ramleh & visited 1000 bed military hospital prepared for sick Indians from France. Orders out for disembarkation of all troops tomorrow.\n","17":"\nRas el tin English Hospital and Indian Hospital again with Follitt & Kay; walk through town. Lunch at Star of Italy restaurant Toussoun Pasha Street; tea at Piccadily tea rooms.\n\nJANUARY1915\n","18":"\nOn ship all day. Col. Giblin called to Cairo tonight & took Campbell, Capt.Col Bryant & Major Powell also called & went. Expect orders to entrain in the morning. All equipment ashore except 2 motor cars.\nP.&.O. boat with wounded Indians? arrived here.\nAdvance party of No 2 GeneralHospital went to Cairo.\n","19":"\nOn ship all day. Another advance party of No 2 General Hospital went to Cairo. No word from Giblin; but Boddam got wire from Campbell– \"Nothing doing yet.\"\nHave got a cold, otherwise well.\n","20":"\nOfficer of the day again– my 6th time! More than a fair share. No news from Giblin. Foggy morning; warm afternoon. On ship all day.\n","21":"\nOn ship all day except for an hour when Follitt, Sutherland and I took a boat and photographed the Kyarra, Tennessee, the lighthouse and the Khedive's Palace.\nRussell wrote on this date to me from Mount Morgan tellingthat the papers had announced the arrival of Kyarra at Alexandria.\n","22":"\nWent up to town and with Atkins took a (Garry?) to the Messa Gardens. Fourth rate! I saw some lantana and prickly pear there under cultivation! Drove there along bank of Mahmoudiyah Canal; back by another road. Found on returning to quay that the Kyarra had removed to a berth near the breakwater.\nNo 2 Genl. Hospl. to go to Cairo on Sunday.\n","23":"\nUp town with Maclean. Visited Army Service Camp atGabbari (Men) and met Captains Willard and (the Vet) McKenna. Lunch at \"Star of Italy.\" Heard on returning that Clearing Hospital goes to Cairo also tomorrow. Dinner at Khedivial Club with Giblin Campbell and Boddam 16 P.T. Drove back to ship, 7 piastres.\n","24":"\nTo Cairo, arriving 12.40 p.m. Heliopolis 2 p.m. Officer of the day.\n\n\n\nJANUARY1915\n","25":"\nLodged in palace of marble and granite. Immense place; cost£2 million pound to build and another million for fittings. Walked to new camp forming at aerodrome for new forces arrived from Australia shortly. Magnificent small new city built on the desert.\n","26":"\nTrain to Cairo in afternoon. Saw Shepheards & Grand Continental. Had a lemon squash with Carlile at latter. Col Giblin came in in motor to see about news just to hand that ½ Hospl. to go to Canal. Later news says whole Hospital to go, also 21 nurses and the No 1 Stationary Hospital.\nBegan our own mess today; very satisfactory. Off tomorrow to the front!\n","27":"\nLeft Palace of Koubbeh Railway Station (Heliopolis) 3.30 p.m., Cairo 4.45 pm. All Clearing Hospital,\n½\nNo 1 staying and 21+7 nurses. Left Major Powell & his lot as Ismailia. Arrived Port Said 12.15 a.m. without any adventures. Saw H.M.S. Swiftsure & 1 or 2 others in the Canal; also a big camp at Ismailia & others along the bank, also a lot of camels. \nDetrained\n 7 a.m. of","28":" detrained. Went in cabs to Eastern Exchange Hotel. Nurses to the Hospital.\n\n28 Thursday\nTook up quarters in a school for young orphans taught by French nuns (and 1 Irish one) opposite Jardin de Lesseps and the fine Catholic Church. Went to the aviator's funeral as far as the church. Had 10stretchers made up as beds in one big room. Meals & Bed in Hotel. Are evidently to act as a base Hospital. Saw Indian Hospital.\nNew address Asile Condreux. Port Said.\nSet up 1 large room full of stetchers with sheets etc\n","29":"\nBusy\nsettin\nclearing out rooms & setting up beds, instead of stretchers. Gave directions for number and location of lights in all rooms etc. Bed & meals at Eastern Exchange Hotel. Saw seaplanes yesterday & today ­­­– Officers quartered in nuns' cells. Mine St Marie de St. Imelda's! Nuns are of order of Le bon pasteur.\n","30":"\nSaw 8 big Australian transports anchor here. Went on board the A30 and saw Major Croll & D'Arcy Hetherington. Also saw on A32 Herbert McLaughlin, Jock Orr & many other Mount Morganites. Took 17 of our Indian wounded & 1 wounded Turk from Railway Station to English Hospital in Ambulance.\n","31":"\nVisited Government Hospital to see Sick Australian landed yesterday.\nSlept on board S.S. Aenne Rickmers german prize, Capt Haskell, am under orders of Capt Weldon Intelligence Dep.\n\nFEBRUARY1915\n","32":"\nLeft Port Said 6 a.m. Passed El Galos & El Arish & Gaza. Landed a man between Gaza & Askelon a Bedouin. Waited off shore till 3.30 a.m. of Tuesday for return of Capt Weldon & party, since 11 p.m. Not far from Jerusalem now! – 45 miles only Two \nfl\n other flyers aboard, Hillas & Paul, & 2seaplanes.\nSaw boy with broken arm. Hillas sore chin Weldon cough.\n","33":"\nCame back to Coast off El \nT\n Arish. 3 Flights by Hillas & Paul, planes not able to rise high enough to go inland one caught fire on starting & was slightly damaged & had to return – easily repaired. Got several snaps of planes. Inspected ship. Quarters & men’s closets dirty.\nCoast line low; Hills behind El Arish. \nInspected ship\n Patients – boy with broken arm and man with corneal ulcer. Paul Otorrhea Hillas.\n","34":"\nToo windy for any flying, & sea too rough for planes to be launched. Dodged about off El \nT\n Arish all day. Could see the town & a tall minaret about 3 miles off. Late in afternoon saw H.M.S. Doris closely examining the coast inshore of us. She passed us just before dark.\nPatients, corneal ulcer, Paul, Hillas, Captain.\n","35":"\nDoris passed us again during night. Cruised slowly about all day out of sight of land. Too rough to launch the seaplanes, or to take off the men \nfrom\n near Gaza.\nPatients, corneal ulcer Hillas, Captain.\n","36":"\nDodging about off El Arish all day. Sea too rough for launching planes.\n","37":"\nPaul made flight S.E. from El Arish to Mowellah and Kosseima, nothing much seen. Hillas’ machine rose with difficulty, reexamined on ship & fault remedied; then rose again, until stopped by rain.\n","38":"\nPaul made successful reconnaissance over Beersheba & saw about 20,000 troops. Then flew to near Hebron, but couldn’t get enough altitude to go over Hebron. Very successful flight.\n\nMy birthday also A. Cintré.\n","39":"\nMet S.S. Rabenfels, another German prize ship off El Arish. Captains Todd and Herbert and a French “pilote” came off to us in a boat. They are to take up our work whilst the Aenne Rickmers goes into dock at Alexandria to be cleaned. Left for Port Said.\n","40":"\nArrived at Port Said 8.30 a.m. after a very interesting trip. Landed \nat\n and reported at AsileCouvreux and at Military Headquarters. Major Newland of 1st. Australian Stationary Hospital at Ismailia visited us at night. No casualties been admitted into our Hospital during my absence. Giblin has done an appendectomy & Gordon a hernia during my absence. Nothing else. Found 3 of our men in med ward, slight ailments Got letter from Mother dated","41":"\n\n10 Wednesday\nGiblin & Gordon went to see the battlefield. Genl. Williams visited our Hospital during forenoon. Yesterday I found letters frm Major Jackson & Cap Follit & Pte Polssonwaiting for me. Jackson been treated badly.\n","42":"\nWalked to end of breakwater.\nGot I.O.U. from Giblin for 21.16.11 balance of pay due to him of embarkation, and signed receipt for samein acquittance roll. (Got 600 piastres from him about 2 weeks ago, in notes.)\n","43":"\nWalked through Arab quarter, took photos. Got 300 piastres.\n(Got 300 piastres from Giblin,) Got a letter from Smithson.\n","44":"\nWalked with Lieut Carlile through native quarter and out to our Camp near Railway Station.\nOnly 1 man in medical wards\n","45":"\n18 nurses returned to Heliopolis\n\nFEBRUARY1915\n","46":"\nLast 2 nurses returned Heliopolis.\nHospital dismantled & equipment packed. Mrs. Croll had gone on a visit to Cairo, and did not return here.\n","47":"\nWaiting orders to return.\nDonald Mackenzie called. Was in Port Said looking for lost equipment. Went to see him at Hotel after dinner.\n","48":"\nStill waiting. Mackenzie returned to Cairo.\n","49":"\nStill waiting. Got word this morning to send an advance party to Cairo, 1 Officer & 20 others; also 1 officer, 1 N.C.O., dispenser & 8 men to be detailed to go to Australia on transport Suffolk in charge of invalids. Captain O’Brien to lead1st. party; Lieut Carlile the party to Australia. Major Gordon’s birthday, entertained the officers at dinner at Eastern Exchange Hotel.\nWent to say Goodbye to Sr Masie Malachy.\n","50":"\nCompletely removed all traces of the AsileCouvreux as a Hospital. French Consul turns out to be business manager of the nuns, & is very annoyed at our going so soon. Wants £200, building in statu quo. Contractor’s bill is well over £200 also.\n","51":"\nMoved out to our Camp near Railway station on the sand\n","52":"\nLeft Port Said 12.30 p.m., arrived Cairo 4.30. Trainto Base details Camp Abbassia between Cairo & Heliopolis in Base details Camp.\n\nFEBRUARY1915\n","53":"\nMet Captain Kenerie here Quartermaster of Camp. Very pleased to meet. Went into Cairo in afternoon and came back by trainto Abbassia Station & then walked.\n10th A.S.C. from Alexandria is in Camp here under Major Smith.\n\n23 Tuesday\nWent to aerodrome in morning & met Jackson, Foxton, Kay, Col Cannon, Major Carter, Luther, Willis, Frank Moran, & Lt. Harvie. Had lunch at Shepheards (24 PT ) & went to Mena Camp in afternoon, Saw Col Sutton, Major Read, Cap Fletcher & the Pyramids. Motor car both ways with Campbell & Boddam. Recd. from Col Giblin 500 P.T. to","54":"\n\n24 Wednesday\nVisited Citadel and Mosque Mehemet Ali in a.m. bought chair, bath, bucket and lantern. Visited native bazaars in afternoon. With Giblin & Mattei. Heliopolis in evg, Jackson, McLean, etc.. Met Graham Butler, Major Butler, Cap Goldsmith etc.\n\n25 Thursday\nAbout the Camp. Went to Heliopolis in evening & had yarn with Jackson McLean.\nRecd. from Col Giblin 183 P.T. being with the 500 recd. on 23rd one fortnight’s pay. Also received 683 P.T. another fortnight’s pay. Am paid up now to","55":" And have drawn 600 + 300 PT against the £28 owing to me at date of disembarkation,","56":"\n","57":"\nNews came to be ready to go on on Sunday next.\nGiblin paid me a cheque for \n1130\n Piastres + cash thus redeeming his I.O.U. for balance of my back pay. No pay due now, except current pay.\n","58":"\nWent into Cairo and changed cheque for 1130 PT at Anglo Egyptian Bank.\nSelected another horse in place of Brown mare. Bay Gelding (2–122)\nLetter from Russell dated","59":"\n","60":"\n“Standing fast”. Rode to Heliopolis and said Goodbye to McLean, Syme, Jackson etc.\n\nMARCH1915\n","61":"\nRode out the Suez Road and through the Aerodrome Camp. Returned 1.15 p.m. and found orders for entraining had come for C.H. 5.15. Entrained at Abbassia in 2 sections; made up train at Cairo. Left Cairo 7 p.m. Arrived Alexandria 12 midnight.\nLeft my big trunk at Cook’s Cairo, – to be sent for when required.\n","62":"\nOn board B.I.S.S. Malda. Other units already aboard No 3. Field Amb, under Col Sutton, No 4 A.S.C. 3 other transports went out. Saw Devanka with Major Stewart as S.M.O. aboard pull out. Also saw Ionian off; Suffolk went in the night. All entrain Infantry exceptions.\nWent up to town in afternoon & photographed Mehemet Ali & had a look at the Scotch Church. Posted book of views of Alex to Mother; bought 2 rolls of films.\n","63":"\nNo I. A Stationary H arrived at breakfast time, & embarked at once. Ship left Alexandria 2 p.m. heading North by West. Lemnos said to be our destination. There is a Field Bakery & Field Butchery on board. Ship’s position at noon is “To Randeliusa Id. 129.\nPosition 34.34N,23.10E.Run 218 miles Noon","64":"\n\n4 Thursday\nSea calm. Only one engine running.\nSighted land on port bow about 3 p.m. – Karpathos; Passed it in the evening. For position see entry last page, bottom.(At noon 34.34N,23.10E)\n","65":"\nAt 8 a.m. Patmos was abeam to starboard and we later passed close to Nicaria on starboard; other islands to port.Position at noon,37.41N, 25.49E.To Lemnos 136.Distance run 223. Sea calm. Went “slow” from 1 p.m.Passed Khios at dusk.\n","66":"\nEntered Mudros Bay, Lemnos Id. , & anchored 7.25 a.m. 5 others transports at anchor, – Suffolk, Devanka, Ionian Condor Castle & Nizam all containing Australians except which has Territorials (or Regulars). 33 vessels in the bay; 3 big warships, severalsmall ones, destroyers & submarines, including the Australian A.E.2. Shores of bay beautifully green & cultivated. Harbour landlocked, (and \nGreek\n?) Several heavily laden Colliers here.\nThis is our advanced base.\nPosted letter to mother – goes via Malta; (Egyn. stamp).\n\n7 Sunday\nRoute","67":" miles. I led the C.H. through Mudros. Another transport arrived during night, 6 mine sweepers during the day.\n\nMARCH1915\n","68":"\nH.M.S. Lord Nelson came in this morning. She was in action yesterday in Dardanelles & got a shot below water line. Several other warships came in & went out. Read Kipling’s Jungle book.\nTent amb division went on shore from3rdField Amb under Major Butler.\n","69":"\nA Messageries liner came in early & anchored amongst the warships near the entrance.\nAll troops on Malda landed & had route march for 6 miles. Troops from other ships landed, 3rd. Brigade. Returning we all climbed up a rope ladder to ship. When on shore visited Telanea & another village, Varos.\n","70":"\nCold misty day, 200 landing, as there was a strong south wind, too rough for boats.\nQueen Elizabeth in the Bay.\n","71":"\nBright sunny day. Landed at Point, & walked 9 miles, saw north & east boundaries of Island, Mt. Athos, Thrasos, Samothraki (all snow capped), Imbros & both sides of Dardanelles. Saw larks, molehills, & myosotis (forget-me-not) marguerites, & crater of old volcano (cultivated). Met Med Off of Marines who landed last week at the Dardanelles & got cut up – lost 40 out of 250.\n","72":"\nLanded on West of Bay & marched 8 miles. Wild thyme, magenta ranunculus. Passed through very old village of Sapi. “Ef Karisto” = “Thank you”. “Kali mari” = “good day”. Re-embarked at Portianos pier, 42 big ships in the bay, including 26 transports, 1 of which is the Franconia, Cunarder 18,000 tons. 5 transports one French. Some French warships and a Russian. Oil tank, Colliers, Queen Elizabeth, Indefatigable, Triumph, Sudan (Red Cross) etc\n","73":"\nRowed an oar to H.M.S. Queen Elizabeth, 8 & 15” guns etc. and boarded Aenne Rickmers, which was torpedoed at 2 a.m. in Gulf of Smyrna 2 nights ago. Big hole in starboard bow. Captain Gaskell, Captain Weldon & Lieut Paul also “Ginger” Chief engineer still on board. McWhae, Prior, Conrick, Carlile & Ford with me. All very pleased to see me.\nI rowed 6 miles.\nSwiftsure& Euryalus & Dublin & other ships here.\n\n14 Sunday\nRowed to Annie Rickmers 2 miles – only Gaskell aboard examined result of explosion.\n\nMARCH1915\n\n15 Monday\nRoute","74":" miles, I led the Cl H home. The 3rd brigade (3000-4000 Infantry).","75":" Field Ambulance, Clearing Hospital. Most of war ships gone out of harbour. Queen Elizabeth went yesterday. Campbell insubordinate. Found that the Annie Rickmers people had called on me in my absence and left a card.\n","76":"\nRowed to Annie Rickmers 2 miles & photographed the hole in her bows, outside & inside. McWhae & I asked them to dinner. Couldn’t come.Spoke to Giblin about Campbell’s conduct. G. said that C. had already discussed the “incident” with him. I said it was impertinence on C’s part to do so; and asked G. to warn C. that under similar circs I would place C under arrest.\n","77":" –\n\n17 Wednesday\n 18 Thurs\nWalked to Mudross with Capt Atkins and bought some coloured handkerchiefs. Saw a lot of bright uniformed Frenchmen. Saw our horses looking well. Weather stormy. 5 Castle Line transports full of troops left suddenly this afternoon. General Ian Hamilton said to have arrived today.\n Walked 6 miles. Saw Polsson? my old \nSergt\n Corporal Clerk, in 9th Infry.\n","78":"\n 19 Friday\nMarched 10 miles, including visit to northern harbour. Saw Greek church built on site of some old ruin; pieces of marble and scraps of pottery about – ancient Greek.\nWeather rough. Mail leaving here. Some of Castle liners returned.\nMajor Butler of Hobart has daughter of Fred Brewer as nurse to his children.\n","79":"\n 20 Saturday\nBlowing a “full gale”, S.W.; strength “8 or 9”.\nShip snagged her anchors, & had to take up a fresh position. Many boats of other ships littering the beach. Vessel under easy steam all day to ease strain on anchors.\nGale from S.W.\n","80":"\n 21 Sun\nCalm morning, several torpedo boats came in this morning. Heard bad news – that Irresistible & Ocean & a French cruiser \nhad\n has been sunk in the Dardanelles & another French cruiser disabled, & the Indefatigable had to be beached on Tenedos. All lives lost on F cruiser. Wind increased to gale in evening from N.E. with rain. Cold. 1st Stationary Hospital said to be about to reembark. Rumour that we must all be ready to leave the Island in six days.\nNo service on ship – Weather too rough for Chaplain.\n","81":"1915\n","82":"\nOn ship. Bay rough. Reports of movements to take place affecting units on ship.\nQueen Elizabeth & Dublin returned here from Dardanelles; former being hit herself one shot going through a funnel.\nField Bakery to go on shore.\n","83":"\nC H received orders to tranship to Gloucester Castle, but no barges were sent. So Gloucester Castle put to sea without us.\nSeveral transports arrived, and most of the Castle liner transports departed.\nRead Ruskin’s Crown of Wild Olive and Cestus of Aglaia.\nSent a sovereign to Haswell per Boddam.\n","84":"\nWent with Giblin on board Dunluce Castle & met General McGrigor in Command of the base, Col Maher D.D.M.S., Major Thom & Capt Gilmour. Sea too rough to return, so went in tow to Mudros landed, walked up town & to Stationary Hospital, & rowed back to Malda in evening when sea calmed.\n","85":"\nStrong cold northerly wind & rough sea all day. Nothing doing. Did some practice with semaphore and dealt with Sergt. Remington and a man for smoking on horse deck.\nRead Barrie’s Auld Licht Idylls .\nSent post cards to Alec & Jess & to Major Maclean.\n","86":"\nOn ship waiting for orders. Most of ships gone out of harbour. French transports re-embarking horses. Capt Mattei left C H exchanging with Corbin of 1 A S H.\nSea calm. Bakery and Butchery sections left ships for the shore. Heard news of fall of Przemysl; and of second attack on Suez Canal by the Turks.\nRead the Golden Book of Marcus Aurelius, and did semaphore with Colonel Sutton.\n","87":"\nLanded with C H for practice in hill climbing, but were recalled at once, owing to threatening weather.\nMarcus Aurelius. Semaphore with Sutton.\n\n28 Sunday\nLanded & chose site for camp. Church service by Archdeacon Richards of Zeehan.\n5 weeks’ pay due to me.\n","88":"1915\n","89":"\nC H landed & did some tent pitching. Officers went for a ride through Rosopol. Inflexible here from Tenedos; 21 bodies were found today in one of her watertight compartments. She has two tripod masts. Queen Elizabeth still here. German Seaplane reported to have dropped bombs on Tenedos Island.\nAenne Rickmers still here, with seaplanes on board.\n","90":"\nStormy day; strong wind from SE. No landing.\nRead R.L. Stevenson, & did semaphore.\nHostile aeroplane seen early this morning by several, over northern side of Island.\n","91":"\nGot men on to making a Gihon’s cot on a stretcher.\nBig mail arrived from Egypt. No letters for me or for Clearing Hospital; so read Index to Johnston’s Atlas whilst others were reading their letters.\nOn ship all day. Other officers went for a ride.\n\nAPRIL1915\n","92":"\nLanded, and rode to Mudros and Rosopolsaw many wild ranunculi and butter cups.\nBoarded the Soudan, Hospital ship. She took the wounded from the Dardanelles to Malta recently (140). Inflexible, Queen Eliz Triumph & 4 or 5 other big ships here still. Also Aenne Rickmers, Colliers, supply ships, and the transports of Australians only\n","93":"\nService on board. Did censoring all day. Wrote to G.A.R. and mother & cards to Jessie.\nFinished modifying stretcher into a Gihon’s ambulance cot.\n","94":"\nSports in afternoon; Concert at night.\n6 weeks pay due to me.\n","95":"\nRode to Kastron with Giblin, Gordon, Corbin, Campbell & Boddam. 30 miles. Called on Commandant.\nShip shifted her anchorage nearer mouth of harbour.\n\nAPRIL1915\n","96":"\nVery cold windy day. Did not leave ship, Nizam is tied up alongside.\nRead Kipling ­­­– The light that failed. Read also 2 old \nQueenslanders\nCapricornians& 2 old Morning Bulletins – from Pte Brighton.\n","97":"\nHorses embarked on Nizam & Wagons transhipped to Nizam from Malda. Several battleships went out of harbour. Aenne Rickmers drifted ashore during the night. Yesterday 3 launches \nwere\n foundered in the Bay. 3 F.A. to go to Nizam except Bearer Division which goes to Ionian. Heard we are to go to Ionian tomorrow & horses to go to Suffolk.\nOn ship all day.\n","98":"\nTransferred to the Ionian (Allan line). Weather warm and fine. Saw Samothraki covered with snow again; ditto Athos.\nAn Australian troopship (the third today) came in just before dark, her men cheering loudly as she came opposite us. Met Major Stokes and many others.\n\n8 Thursday\nWent ashore for a couple of hours & bought 62 lbs of charcoal, the unit owes","99":" for it. Several Australian transports arrived crowded & cheering. Said to be 175 transports and 200,000 troops to come. Steamer Virginia flying American flag was siezed by Canopus and brought here. Said to have guns and ammunition for Turks and Turkish Officers aboard. She is being unloaded into lighters. Very few warships here, but harbour filling up with transports & water & oil ships.\n","100":"\nMail arrived here last night by transports from Alexandria. Sorted on Malwa, now the Headquarters boat. Our post(Ionian) contained 17 letters for me & 4 bundles newspapers 3 parcels books & 1 parcel B.M.J’s . Also a cable for me from Russell, posted from Egypt ­­­– “Major Richards Australian Clearing Hospital, Egypt, Passed leaving Malwa England exceptional advantages. Richards.” What does the latter part mean? I am so pleased he has passed.\nWrote to mother before I got most of my letters as there was a mail going out this afternoon. May God comfort my wife with husband and “baby” both so far away.\n","101":"\nWrote to Mother & Jessie & Russell & Mrs. Croll & Mrs. Butler. PC’s to Russ, Alec, Mrs. Lyle, Lillie, Read all my letters over several times.\n","102":"\nSaw all over the Queen Elizabeth, the biggest warship afloat. 8 x 15 inch guns, shells weigh 1920 lbs. . Several other big transports came into harbour. Queen Elizabeth is 600 feet long & draws 34 feet.\n","103":"\nCol Giblin went ashore with some of the men & went routemarch to the north of the Island.\nI fear Russell may have accepted an appointment in the R.A.M.C. which is likely to mean a Regimental Medical Officership in France. May God protect our boy against mutilation or death.\n","104":"\nMany transports coming in \nfor\n for several days past; berthing in pairs. Harbour very full.\nOn ship all day.\nWrote another post card to Russell in case letter went astray ­­­– addressed P.& O’s S.S. Malwa Port Said Egypt \nUrgent\n​.\n\n14 Wednesday\nUnit ordered to pack kitbags for transfer per \nto\n “Osmanich” to the Base.\nPontoons made by Engineers.\nLecture by Colonel Weir C.O. of 10th Battalion, in the Gallipoli peninsula, giving proposed landing place of","105":" Brigade & giving details of defensive preparations on land.\nOn ship all day.\n","106":"\nOn ship all day. Rearranging my baggage. Heard \nfrom D.A.D.M.S.\n that the C.H. is to be converted into a bearer division and to land on Gallipoli peninsula with the covering party, making the beginning of the land attack to capture the ports. Volunteered to lead, if there is to be a separate bearer division. In that case, will land on the first day. Have asked O’Brien, Atkins & Carlyle (all agreed). We will be in the thick of it.\n\n16 Friday\nHeard we are to be taken on board cruisers and destroyers to Gallipoli Peninsular & then transferred to Barges and towed ashore. 2 Companies from 10th Battalion went on board the “Prince of Wales” this evening, fully armed, for practise for ","107":"\n 3 hours, then returned to Ionian. Engineers also went. Heard a Turkish destroyer which escaped from Dardanelles some week or 2 ago, had attacked a transport & fired 3 torpedoes at her at 100 yards, all missing; destroyer sunk by Minerva.\n","108":"\nIonian moved away from Suffolk, and anchored just inside boom at mouth of harbour. Heard that a Turkish destroyer had fired 4 torpedoes at a transport and missed with all; but that 60 to 100 men had been lost through one boat falling on another when men in alarm were taking to the boats. Giblin & Corbin to be in advance party; not Carlyle.\n","109":"\nCaptive balloon, seaplane, submarines & destroyers all very busy about mouth of harbour.\nAgamemnon near us has her hind funnel badly wrecked & shrapnel holes in fore funnel.\n\n\n\n\n\nAPRIL1915\n","110":"\nService on board last night by Rev McPhee. \"A few more years\", \"Nearer my God\", \"O heavenly father\". Communion, of which I partook.\n\n"}}