{"Document Name":{"0":"Diary_0430","1":"Diary_0430","2":"Diary_0430","3":"Diary_0430","4":"Diary_0430","5":"Diary_0430","6":"Diary_0430","7":"Diary_0430","8":"Diary_0430","9":"Diary_0430","10":"Diary_0430","11":"Diary_0430","12":"Diary_0430","13":"Diary_0430","14":"Diary_0430","15":"Diary_0430","16":"Diary_0430","17":"Diary_0430","18":"Diary_0430","19":"Diary_0430","20":"Diary_0430","21":"Diary_0430","22":"Diary_0430","23":"Diary_0430","24":"Diary_0430","25":"Diary_0430","26":"Diary_0430","27":"Diary_0430","28":"Diary_0430","29":"Diary_0430","30":"Diary_0430","31":"Diary_0430","32":"Diary_0430","33":"Diary_0430","34":"Diary_0430","35":"Diary_0430","36":"Diary_0430","37":"Diary_0430","38":"Diary_0430","39":"Diary_0430","40":"Diary_0430","41":"Diary_0430","42":"Diary_0430","43":"Diary_0430","44":"Diary_0430","45":"Diary_0430","46":"Diary_0430","47":"Diary_0430","48":"Diary_0430","49":"Diary_0430","50":"Diary_0430","51":"Diary_0430","52":"Diary_0430","53":"Diary_0430","54":"Diary_0430","55":"Diary_0430","56":"Diary_0430","57":"Diary_0430","58":"Diary_0430","59":"Diary_0430","60":"Diary_0430","61":"Diary_0430","62":"Diary_0430","63":"Diary_0430","64":"Diary_0430","65":"Diary_0430","66":"Diary_0430","67":"Diary_0430","68":"Diary_0430","69":"Diary_0430","70":"Diary_0430","71":"Diary_0430","72":"Diary_0430","73":"Diary_0430","74":"Diary_0430","75":"Diary_0430","76":"Diary_0430","77":"Diary_0430","78":"Diary_0430","79":"Diary_0430","80":"Diary_0430","81":"Diary_0430","82":"Diary_0430","83":"Diary_0430","84":"Diary_0430","85":"Diary_0430","86":"Diary_0430","87":"Diary_0430","88":"Diary_0430","89":"Diary_0430","90":"Diary_0430","91":"Diary_0430","92":"Diary_0430"},"Date":{"0":"unknown","1":731.0,"2":732.0,"3":733.0,"4":734.0,"5":735.0,"6":736.0,"7":737.0,"8":738.0,"9":739.0,"10":740.0,"11":741.0,"12":742.0,"13":743.0,"14":744.0,"15":745.0,"16":746.0,"17":747.0,"18":748.0,"19":749.0,"20":750.0,"21":751.0,"22":752.0,"23":753.0,"24":754.0,"25":755.0,"26":756.0,"27":757.0,"28":758.0,"29":759.0,"30":760.0,"31":761.0,"32":762.0,"33":763.0,"34":764.0,"35":765.0,"36":766.0,"37":767.0,"38":768.0,"39":769.0,"40":770.0,"41":771.0,"42":772.0,"43":773.0,"44":774.0,"45":775.0,"46":776.0,"47":777.0,"48":778.0,"49":779.0,"50":780.0,"51":781.0,"52":782.0,"53":783.0,"54":784.0,"55":785.0,"56":786.0,"57":787.0,"58":788.0,"59":789.0,"60":790.0,"61":791.0,"62":792.0,"63":793.0,"64":794.0,"65":795.0,"66":796.0,"67":797.0,"68":798.0,"69":799.0,"70":800.0,"71":801.0,"72":802.0,"73":803.0,"74":804.0,"75":806.0,"76":807.0,"77":808.0,"78":809.0,"79":810.0,"80":811.0,"81":812.0,"82":813.0,"83":814.0,"84":815.0,"85":816.0,"86":817.0,"87":818.0,"88":819.0,"89":820.0,"90":821.0,"91":822.0,"92":823.0},"Entry":{"0":"\n\n","1":"\n\nSat 19th\n\nLes asked Ser.Maj.Wright to ask Maj. Granville if he could stay with the last party tonight, but getting no satisfaction he paraded himself, with the result that Kirkwood (Lithgow) received orders to go with the 4.30 party & Les is to wait with us; Two large shells fell very close today , one falling in the sap near the water tank the lad on duty guarding the water was within 5 yards of where the shell fell, the shock knocked him down, & we all thought he was a \"goner\" but he cooly got up in the smoke sat down on a ledge & surveyed the cloud of smoke as he lit his pipe he took it as cool as anything I have seen; A large fleet of warboats & destroyer came on the scene at Cape Helles this afternoon at 3 oclock & are bombarding away as hard as they can go. It may help to distract the\n\n19-12-15\n\nTurks attention off us a bit as we are bidding the Peninsula Goodbye some time tonight or early tomorrow morning; Everything has gone along smoothly so far & only the 1st. L.H. remain ashore belonging to the 1st Aus. & New Zealand Division.Les has been put on the FH phone in place of Tomlinson who is being sent away as he has a sore foot & he loses his head too easy at anyrate to be on duty.\n\n20-12-155\n\nMon 20th\n\nHad a very exciting & interesting time last night; We fell in & filed into the trench at 5 o`clock shortly after the 4.30 party had left for their boat; About 3 mile of trenches from Destroyer Hill to No.2 sub-section of this Regt. was manned by 11 men only including the Adj & 2 signallers Traill on Destroyer Hill & Leask on Camel\n\nHump; There were 48 men left altogether & we had one to every post at No 1 sub section which is close to the beach between No 1 Outpost & Walkers Ridge & in the bottom of the gully; Everything was going along quietly enough until 11 oclock when Walkers Ridge reported that the sergeant on duty saw about 100 Turks going down the Gully from Walkers, we were spinning tales to kill time, (4 at each post, & one observing) when Major Granville & Lieut Mack came running down the trench & ordering us to \"stand to\" as they passed us; we sprang to our posts with a good supply of ammunition on the parapet by us & anxiously awaited the Turks to show themselves; Meanwhile Granville had sent a sergeant & 5 men up the gully to ascertain the strength of enemy & to give us warning of their approach fortunately it was a false alarm & the patrol went well\n","2":"\n\nup the gully & reported there were no Turks in the gully feeling much relieved we went on yarning till 3.15 am this morning when we received the orders to throw away all the spare ammunition on the posts & file out; We were just ready to start for the beach when 2 mines were fired on Walkers one under the Turks firing line & the other under the second line of defence the tunnells were 50 feet below the surface but 2 tons of amonal were in each mine ,& the flame leapt high in the air; 2 men on Walkers had been left to fire the mines while the remainder were on their way to the beach; As soon as the mines exploded the Turks (who were not hurt by the explosion) opened up a heavy fire with rifle & machine guns; We arrived at Watsons Pier just as the men from Walkers were embarking & no time was lost on the beach; as soon as we were out a little way from shore an old howitzer on the beach\n\n20.12.15\n\nwas blown up; We were put on board a transport & as we headed for Lemnos the Turks were still firing away at empty trenches. I wonder how long it will be before he realizes that we have left & he is fighting empty trenches; We were the last Regt. to leave & as no one had been wounded it was not necessary to leave the 3rd Field Ambulance behind & they came away with us & very pleased they were; It was a great feat to get so many troops away without having any casualties, it was previously estimated that 2000 men would be lost in the evacuatiorn , & we got away scot free; We arrived at Lemnos about midday & were transferred to a large transport with others on board managed to have an hours sleep there & were then brought ashore & put in camp here at Mudros very tired erected 3 tents for the Sqd & turned in having only the bully & biscuits we brought with us & only the water we had with us\n\n20.12.15\n\nTue 21st.\n\nThis morning was dusty & wintery; water seems very scare here, can get hardly enough to drink & washing is out of the question ; We put the tents up anywhere last night & had to take them down again this morning & put them in a line but just as soon as we had them down it commenced to rain, most of the lads who remained out had a rough time , we erected one tent & crammed into it till it steadied down & then had to put them up in the mud & then dig the mud out with our entrenching tools; We were issued with one blanket to two men last night , & to-day we received another blanket between two men again; Had a muster parade today & was told by Col. Cox that he had just received news that we were to go to our horses as soon as could get transports & I hope it is not long as we\n","3":"\n\ncannot say we are having a particularly good time here;\n\n It is a great sight coming in to Madros Harbor filled with troopships & warboats, & nets everywhere out to stop submarines coming in; We received word to-day that the Turks were bombarding our positions very heavily yesterday & to-day they charged Lonesome Pine & after giving it a good bombing they took the position . I guess they received a surprise when they found out no one was there, it is also reported that the warboats fired on all our old bivouacs & blew up any stores left behind most of the lads left notes behind thanking Abdul for the use of the ground he had there also for the fair fight they had given us also assuring them that any food left behind has not been poisoned, but is quite good; I am in charge of B Troop while we are here as they have no N.C.O. with us\n","4":"\n\nWed 22nd.\n\nHad orders at 10 oclock this morning to pack up and clear the lines &were bustling to get away from camp by 10.45. the camp is about 2 miles from the piers where we embarked & were played from the camp by an infantry band, another one met us half a mile further on; After all the bustle to get away from camp we had to wait for a couple of hours just off the pier as the boats were not ready for us, some English Tommies who were camped in barracks by the roadside offered to boil a \"dixie\" of water for us & the drink of tea was very acceptable, we brought a loaf of bread & a tin of jam each with us & it was a good thing we did as the sun was getting low when we got on the first boat, & were transferred to a \"ferry\" & after waiting on it till after dark\n\n22.12.15\n\nwere transferred onto the the troopship Hororata & a beauty she is too they were expecting us on board early & had dinner ready for us but as we did not turn up it was thrown overboard, we made the best of a bad job & had some dry bread & a little later some soup was brought along there is something like 2000 troops aboard the majority I believe are New Zealander MR the whole of the 1st LH Bde are on board;\n\nAbout 40 bags of mail turned up for the 1st L.H. Regt last night but only one or two bags were sorted out before we left. The remainder is with us at present; Everyone in great spirits in anticipation of once more getting back to civilisation but the old Gallipoli Peninsula gave me the best time I have had since I enlisted & glad we all are to leave Lemnos behind us\n\n \n","5":"\n\nThurs 23rd\n\nPut in a very quiet time today on board had rifle examination this morning; We have only eleven men to each table & the food gives no cause for complaints, I am in charge of this mess table also of B troop on parades but have very little to do & are having a little holiday; The Colonel told us at dinner time to-day that we would soon be fighting again & the sooner we are at it the better as I would much sooner be at the front than being messed about ‘falling in’ every few minutes for some parade or other; I commenced to write home to-day but gave it up as a bad job as we were told that no letters are allowed out of Egypt for 6 weeks; It is a grand sight here the harbor is filled with boats of every description from motor launches to Dreadnoughts, we passed close by one of our submarines when coming in from Gallipoli\n","6":"\n\nFri 24th.\n\nLeft Mudros at 9 o`clock this morning , & as soon as we were clear of the submarines nets we had to put on life belts & have to have them with us always, an artillery gun is also ready on the stern with two machine guns in case a periscope is sighted; The weather has been rather chilly & drizzling rain during the last day or two, but are getting into warmer air tonight.We are getting plenty of good food here & having an easy time. Capt White (Adj) is getting himself well disliked on board he called the sergeants together yesterday & gave orders that the N.C.O.s are not to mix with the men in Egypt, & everything is much stricter that it was before we went to Gallipoli; He will find the men will not stand too much of it.\n\nHaving a good time on board here & are getting into warmer weather. Had a very decent Xmas dinner for soldiers; roast Beef & peas, soup & pudding & Meredith proved a sport & treated us to a dozen cases of wine (1 bottle to 4 men) A New Zealander died on board today from Meningitis One would think by the amount of Crown & Anchor played on board that this boat was a \"gaffing school\" & they would not be far wrong; Two torpedo boats came close up to us this morning apparently patrolling for submarines but have seen no sight of them since; Hot water baths are turned on for the troops & quite a treat they are to us feeling a little squeamish tonight & am sleeping on deck\n","7":"\n","8":"\n\nArrived at Alexandria about 10.30 this morning & had to wait anchored out till 5 oclock as all the wharves have ships alongside. It is very interesting watching the sea-gulls of which there are thousands fighting for the food thrown overboard it is also amusing to see the police boats hunting away any boats that make our way after Baksheesh but the police themselves are as bad as the others so long as their Officers are not looking; Filed off the Hororata onto the train about sundown & were soon on our way to Cairo\n","9":"\n\nMon 27th.\n\nWe left the train about 12.30 this morning at Zietoun & had nearly 2 miles of a march into\n\n27.12.15\n\nour old camp \"the\" Aerodrome\" here tea was ready for us; Reid & Francis raided one of the tucker boxes & we had a snack & turned in; It was sunrise this morning before we got up & met plenty of old Regts lads, also Ally Hargreaves from N.mine & heard from him that Geo.Young Roy Forsyth & Jack Dugan are at Abbassiah with the infantry; It is also said that a Regt of Light Horse made up of Reinforcements left here mounted for the front a fortnight ago; Had a parade this morning only to be told by the Colonel that we had played the game in Gallipoli & he hoped we would play it here & said a percentage of us could get leave after dinner. I decided to visit the A.V.C & see Arthur Welch; hunted him up. Had dinner with him & then went to\n\n27.12.15\n\nAbbasiah to see Morgan who appears to have a good job amongst the Red Caps drilling prisoners; made arrangements to meet Morgan in Cairo for tea; Arthur & I put in the afternoon seeing the sights & playing draughts in the Soldiers Home. Met Morgan at tea time & then went to the pictures & returned to camp about 10 oclock.I guess the Colonel would not have taken me for one of the Ki-wi Reg if he had seen me as I had on a pair of slacks, dirty boots, the same tunic I took to Gallipoli minus one or two buttons, & an old hat that has seen a good deal of rough usage on the Peninsula, still I had a very good day & arrived back in camp with no one the wiser for my absence\n","10":"\n\nTue 28th.\n\nHad no parades this morning but looked up the Sig. gear & found the pannier just as I left it in the transport last May, gave Arthur a visit before dinner; After dinner there was a muster parade & the Regt was reformed; 2 Sqd is cut out of the Regt. as the 12th L.H. are to be reformed; Ally Hargreaves is now in D Troop C Sqd; Andy Butter & Mc Farlane & Cole turned up this evening they have been away sick McFarlane said he saw Stan in Malta & he was then knocking about on crutches; Having finished tea this evening I took a walk down to the billiard room had a game & a chat & then came back & turned in early\n","11":"\n\nWed 29th\n\nShifted into fresh tents this morning & our Webb equipment was handed back to the Q.M. Ser. & all our belongings are now lying loose in the tents; After dinner we were issued with saddles & bridles & then I asked Major Smith (who is OC of C Sqd) if I could get 6 weeks furlough & was told that I had no possible chance. I then asked for 4 days to go to Luxor next week but was told there was no chance & that we would probably be going away again in 2 or 3 days so I had to be satisfied with leave to Cairo tonight Went in with Arthur & Morgan & had a good time at the Kursaal; having tea afterwards we met Bottomly & had great fun coming back to Camp with a couple of Frenchmen.Bottom speaks French fluently & is a character\n","12":"\n\nThurs 30th.\n\nJust got nicely into bed last night at 11.30 when we were all awakened to supply mess tins & straps also some saddlery that the 3rd Light Horse were short of as they had to leave here early this morning; They also took all our signalling gear; to-day we had horses issued to us; Went to the A.V.C. again this morning for a few minutes; After tea Les Peters & I went to the billiard room had a game & then went in to Heliopolis & wrote a letter at the Y.M.C.A. & bought a silk flag for 3\/- on the way home; We are having an easy time here & discipline is not near as strict as the Adj. promised us it would be coming over on the Hororata\n","13":"\n\nFri 31st.\n\nToday Les, Reid,Traill & I had some flag practice which saved us from falling in for parades with the troops. We were given our black kit bags to-day & I was glad to see that a new pair of boots I had in it was not removed & practically everything still remained. I scaled away at stables this afternoon & went into Cairo with Arthur & Morgan Welch & Bottomly & had a very good time, going to the Empire pictures the tea & back to Heliopolis in a carriage. Morgan is doing 3 days C.B. but took the risk of scaling out, we have been getting bags upon bags of mail since we arrived there\n","14":"\n\nSat 1st.\n\nArrived home last night to find C.Sqd had been put on inline Picket, I expected to get into a row over being absent last night but it went along alright. This morning the sigs went out mounted & did very little flag waving as it was our first ride for 8 months, some of the horse are more than half inclined to buck; I asked for leave this morning & secured a pass from 2PM till 10PM & was then told on stables that no passes were to be given as we were still on inline picket till 6 oclock; However I had arranged to go out with Arthur & Bottom & securing my pay £10-0-0 while stables was on\n\n1-1-16\n\nI scaled out as soon as I was paid, & came to Cairo parted with Arthur & Bottom & went to a Greek Dentist to have 3 new teeth on the plate, & while he was doing it wrote a letter or two at the Soldiers Club in the Gardens, then bought a Dnoto Fountain pen (75 P.T) & a watch (65 P.T.) &: I am now pretty well fitted up again for Active Service;\n\nIt was very funny with the Greek dentist as he could not speak a word of English & to arrange the price he had to call in a French neighbour before we could come to terms. Bought some silk & sent it to Meg & Edie also sent away my diary & then came back to camp\n","15":"\n\nSun 2nd.\n\nWas not caught last night . This morning there was Church Parade, I evacuated the camp while stables were being done this afternoon, met Arthur at the A.V.C. & decided to call at Abbassiah & see Morgan on our way to Cairo, & we were just in time to see him as he was in the Ambulance ready to go to Hospital sick, so Arthur & I went with him to the hospital & then went on into Cairo & had a very good time, Had an Egyptian supper composed of minced meat & rice mixed & cooked over hot coals; unleavened bread, tomatoes onions, & several other dishes which I cannot put a name to; Arthur had been there scores of times before & knew the Egyptian customs & style of eating, everything is very clean & every convenience for washing before dining, no knives\n\n2-1-16\n\nor forks are used, all that is required in your fingers & pick up what you eat with a piece of bread between the fingers \n\nAfter this feed which only cost 5 .T. each we went through several business streets where Arthur is well known as he & Bottomly are regular customers here & had a good arguing with the shop keepers, always going away without buying anything, we then got into the native quarters & went through them till things looked as if trouble was ahead of us. so we turned back; The natives have no good feeling toward the English & a man takes a risk by going too far away from the main streets; We arrived back in camp soon after 10 oclock after having a good nights outing\n","16":"\n\nMon 3rd\n\nMy absence was not missed again last night; This morning we had a kit inspection, & received some more equipment; Les & Reid had to go on duty at the orderly room for a while at dinner time as both the sigs on duty were away on messages & as the parade was a mounted one this afternoon, & it was raining a little, I decided to make myself scarce rather than get wet, so I went down to the Billiard room & played billiards all the afternoon, & got back to camp soon after six oclock had a feed of tinned pineapple & put the rest of the evening in writing in the mess room; again my absence was not noticed\n","17":"\n\nTue 4th\n\nHad a muster parade this morning , & had Regimental drill on the desert till dinner time; This afternoon we had mounted work again but was not out long before we got wet. & was brought back to camp again; We were issued with more equipment again today & I scaled away at stables again this afternoon & went to the Hospital with Arthur & Bottom to see Morgan: & then went on into Cairo; Morgan looked quite well again & was in the best of spirits; Last night we had a fair amount of rain & all who slept outside had a wet time of it; The weather has been very cool the last few days\n","18":"\n\nWed 5th\n\nHad Regimental drill this morning, but broke out of the ranks to do signalling practice; Was issued with a pack horse at dinner time to carry signalling gear; Was also issued with signalling equipment (new) & put the afternoon in doing nothing; Les received a pass from dinner time , & I scaled off as soon as I had fed the horses & taking the Kukri in to post it went to Cairo; Called to see Morgan as we went & found him improving fast; Arthur & Bottom went in with me & we had a very enjoyable time, but found it was too late to send the Gurkhas`s knife so left it at a cake shop where we are regular customers & came back to camp early; Was surprised on weighing tonight to find I weigh 12 stone 5 lbs.\n","19":"\n\nThurs 6th\n\nThis morning we had some practice setting & aligning the Helio. also flag drill; Bugger work this afternoon; Geo. Young called to see us at dinner time & is looking well on it; Had to fall in at 6 oclock this evening as we are on inline picket for 24 hours & am \n remaining in tonight for a change.\n","20":"\n\nFri 7th\n\nStation work this morning & I was busy after dinner drawing more equipment; Was dismissed off in line picket at 6 oclock this evening & then went to Abbassiah with Butter Hargreaves & Bull; to see the N.mine lads there but found they had left left this morning, so Hargreaves had a game of Billiards & then came back to camp.\n","21":"\n\nSat 8th\n\nApplied for a pass for the day to go to Cairo to arrange some money matters. The pass was given but Major Smith asked me also to buy 10\/- worth of thick cord to use instead of baggage straps as they are not obtainable; Came to Cairo & arranged for £75-0-0 to be paid to Father also 5\/- per day from the 1st of January; then succeeded in finding the cord to suit ; after hunting all over Cairo for it; & arrived back in camp at 2.30, & having nothing better to do went back to Cairo again; Posted the Kukri home today; Had tea at the New Obelisk & then went to the Kursall & witnessed the best programme I have ever seen arrived back in camp at 9.30\n","22":"\n\nSun 9th\n\nThis morning we went out mounted with B.Sqd. Sigs & put the morning in signalling with Helios; Les received a pass to town from dinner time & I put the afternoon in at the A.V.C. as the last snapshots of me were a failure I sat again; \n\nAfter tea Arthur Bottom & I went to Cairo; Morgan left Hospital at 3 oclock today; & he met us at Heliopolis & went in with us; We intended going to the Kursaal but found it filled & the doors shut, so we had supper at the Egyptian Cafe & then tea at the cake shop & then came home; We had geat fun in the tram , the compartment we were in had several Greeks & French & Bottom was at his best & caused plenty of amusement.\n","23":"\n\nMon 10th\n\nHad more Helio work again this morning & put this afternoon in packing up & getting our gear ready to go away, it is to be a muster parade tomorrow & and an in inspection by Col.Cox to see that we are properly equipped .The Signalling panniers were packed on the transports this afternoon, I put the evening in writing\n","24":"\n\nTue 11th\n\nThe Bde was on parade today & inspected by Col. Meredith, came in late off parade & put the evening in doing nothing; At 3 oclock Nelson & I went to Cairo, had a bath at the National & I arrived back in camp before 8 oclock & heard Stan was out to see me I had no idea he was in Egypt & very much surprised to hear the news\n","25":"\n\nWed 12th\n\nThis morning started Les & Reidy on sig. practice & then went with Peters to the billiard room & played billiards till dinner time arrived back to find Stan here, & put the afternoon in visiting Browne (2nd Regt.) & looking for Major Smith to see if Stan could draw money here. But could not find him, Stan went back to No.2 Auxiliary Hospital, & I went to the A.V.C. to see Arthur, but could not find him, concluded he had gone to Cairo & decided to follow, failed to meet him in Cairo, & came back to Heliopolis, & went into a cake shop for tea on my way to camp. & found both Arthur & Morgan there, had supper together & then walked to Morgan`s camp with him & returned home shortly after 10 oclock; We were supposed to go away today, but put off till Friday; collected £1 the Adj (White) owed me for a wager\n","26":"\n\nThurs 13th\n\nCame out in orders yesterday that the 12th Regt. were not to be reformed but used up as Reinforcements for the other N.S.W. Regts 10 ops at a time needless to say the Prince of Wales` own does not relish the idea of being reinforcements to us; We have been issued with a pack horse to carry our signalling gear & did not go on parade this morning but put in some time fitting the pack saddle on.As soon as I had finished dinner I went to No.2 Auxiliary Hospital & gave Stan his mail which arrived this morning, then came back to camp & was paid £2-10-0.Then to the A.V.C. & went to town with Bottom & Arthur. Met Stan at the Kursaal at 6.30 & then put the evening in at the Picture Show & then back to camp, we have everything ready for the road tomorrow\n","27":"\n\nFri 14th\n\nEarly reveille this morning & soon had our tents down & ready for the track to left camp at 9 am followed by the 2nd regt; Saw Stan as we passed the Hospital; We had a very good journey the day being glorious, & the country looks fine; Soon after dinner Reid had trouble with the Pack horse & I stayed behind with him to fix the pack & took good care not to catch up to the Regt again before we got to Barrage; It was after dark before we commenced to put down the lines but did not lose much time; We were only issued with bully beef & bread for tea but fortunately we had brought some tinned fruit which came in very handy; A guard was put on the bridge tonight to stop anyone from going to the village\n","28":"\n\nSat 15th\n\nThe 2nd Regt led the way to-day it was a lovely ride through Barrage with gardens on either side but we soon were following the line along with the desert on our left & a small canal on our right; It was very heavy travelling for the horses as they sank to their fetlocks in the soft sand; We halted for an hour & a half for dinner at midday & got into camp at Wardon well before sundown but it was moonlight before we had the lines down & the horses fed & watered; There is miles of tents here filled with English Tommies (The 53rd Division) Les & Reid went to the canteen after tea & came back with a supply of tinned fruit & biscuits\n","29":"\n\nSun 16th\n\nThis morning the horses were taken off the line 3 horses per man, & the rest of us put up breast lines to picket the horses to & a rough job is was digging holes 4 feet deep in loose sand to put the posts in, but we had the lines ready at dinner time;\n\nThis afternoon we were issued witht the same tents that we had at Heliopolis & put them up; The transports & all baggage came by train; We were given our black kits tonight a few of these went astray probably with the 2nd Regt mine amongst them but hope to get it tomorrow; Water pipes have been laid down to troughs close by the horse lines & are very handy these were only completed this afternoon; It looks as though we are in for a dull, quiet time here\n","30":"\n\nMon 17th\n\nThis morning the Regt went out leading horses for exercise while B & C. Sqd Sigs went onto the first lines of ridges signalling with helios; I believe the Tommies have patrols along these ridges every night on the look out for the enemy; We have a fine view of green fields & canals on the northern side of the Railway line but on this side (the southern) there is nothing but desert; This afternoon we had no parade but stayed in our tents as it was showery;Les & Reid went to the Canteen as soon as stables were dismissed & bought 10\/- worth of tucker; I was put on Cpl of the feed party at 8 oclock.\n","31":"\n\nTue 18th\n\nWent out for signalling practice again this morning & led the pack horse out for exercise; This afternoon it was showery again & no parade I went to the 2nd L.H. to try & find my black kit bag but with no success; \n\nI had to hand over the Helio & Stand, also Field glasses to Traill this afternoon as he is going with 3 H.Q. \n\nsigs tomorrow morning with A Troop, A Sqd to some place on the Nile & 35 miles from here, they have to work 3 sig stations, & are on patrol to keep any enemy away as they are afraid they would turn the canal in the Nile, which is quite close & cut off Alexandrias water supply at least that is what we are told\n","32":"\n\nWed 19th\n\nThis morning orders came out that two Australian Camel Corps are about to be formed & volunteers are asked for who would take Ser-Majors jobs also commissions & about 80% of the C.Sqd. put in applications today;C.& B Sqd.Sigs went for a ride this morning to exercise our horses & this afternoon we had some message sending with H.Q. Sigs. We have been having very poor food here & been putting in complaints daily & are faring a little better at present. At 12 oclock today A Troop (A Sqd.) left for their new job, Lieut Mack went in charge of them, & by all accounts they should have a good time; This camp is named Beni Salaam.\n","33":"\n\nThurs 20th\n\nLes was on duty on the phone in the Orderly Room this morning & Reidy & I went out & had practice mounted with Head Quarters. This afternoon Leask & I went out onto the ridges mounted & sent back messages to the others Sigs in camp per Helio. Nelson app;lied for a commission in the Camel Corps & was recommended as Dowling & McFarlane.\n","34":"\n\nFri 21st\n\nWorked today the same as yesterday; this afternoon after stables all the men who applied for commissions & 2.M.Sergt`s jobs were lined up & received a speech for the Col. telling them that he could not understand why so many put in, as they were joining a no. fighting unit;\n","35":"\n\nSat 22nd\n\nThe parade this morning was only to clean our saddlery: Were issued with more gift goods today; No parade at all this afternoon & I put the afternoon in writing;I feel a little sorry now that I did not apply for a commission in the camel corps but was afraid that I would have been made Quarter Master Sergt instead of getting a commission & I would sooner stay where I am & wait for a rise in a fighting unit than go on as Q.M.S. with transports D Troop of C.Sqd are on patrol duty on the ridges overlooking the camp tonight; One troop of the 1st Regt do patrol work one night & a troop from the 2nd Regt do the next.QMS Moylan, Frost & Sgt Browne went to Cairo on business a few days ago & stayed away 2 days overtime & arrived back last night, were up before the Col today, but let off\n","36":"\n\nSun 23rd\n\nChurch parade this morning conducted by Sol Green & I attended I think the Reverend gentleman must have been sent to war by the Church of England on account of him not being a \"wowser\" as he is rather partial to a wee drop occasionally & suits a certain part of the men.This afternoon we had nothing to do but kill time till stables; the Corporals of C.Sqd have a tent to ourselves; After tea most of the lads put the remainder of the evening in while the daylight lasts boxing & wrestling received a parcel from home today in excellent order; We have been getting much better food the last couple of day so our complaints have done some good\n","37":"\n\nMon 24th\n\nMounted work again this morning as usual & signalling practice dismounted this afternoon Leave can be had for men to visit Cairo from 6 AM till 7 PM so long as they have a \n reasonable excuse \n","38":"\n","39":"\n\nThis morning it was very windy & dusty & the dismiss was blown as soon as we had finished saddling up; & we put the day in doing nothing but keeping in out of the dust; Received two parcels from Edie.T. this afternoon Peters H.Q. Signaller was kicked this afternoon by a horse breaking two ribs & was sent away to Hospital; Mumps are getting rather prevalent in the camp & a good many are being sent away with them.\n","40":"\n\nThurs 27th\n\nDismounted Sig work this morning; Leask & I went out mounted with the helio, but it came up cloudy & were caught in a shower of rain coming home; The 2nd Regt played the Tommies football this afternoon which resulted in a draw neither sides scoring .Had a letter from Stan today saying he was with the details at Heliopolis.\n","41":"\n","42":"\n\nLeask & I went out mounted this morning & sent back messages per Helio to camp; This afternoon C.Sqd played the remainder of the Regt. Football & were defeated by 10 points to 5; I applied for a pass to visit Heliopolis next Monday; B troop is on picket on the ridges tonight; I believe 3500 men are missing from the Inf Camp at Tel-el-Kebir\n\nBde H.Q. so I saw S.M.Davidson secured my pass, & ran most of the way to the WArdan Railway station & came into Cairo with A.M.S. Mc Keowan Easterbrook & Sert.Mathison& Scott. We arrived at Cairo at 9 oclock, I then went to the cake shop on the offchance of meeting Arthur Welch but found I was too late as he had just gone; I then took a carriage to Cairo Railway Station & caught a tram to Heliopolis; arrived at A.V.C. & found I had beaten Arthur home, so lay down on his bed & waited only a short time before he turned up; He told me had just left Stan & we took after him at the double catching him at the head of the lines; There was a demonstration today in Cairo by some Egyptian Army reserves that were called up & they declared themselves Turkish & were rounded\n\nup by English & Aust. soldiers into a street, a few shots were fired & 9 of the Egyptian reserves were killed but everything was very quiet tonight.\n","43":"\n","44":"\n\nThis morning I left Stan just before breakfast, went to the A.V.C. to see Arthur & Bottomly, & then went to Maadi & saw Les Regan. Ted Oates & Mabray & came back to Wardan by the 5 oclock train & heard another version of the demonstration yesterday & a more probable one; it is said that the Egyptian Reserve were called up for the Camel Corps. they paraded before the Sultans Palace making a demonstration, they said they objected to Australian Officers over them & wanted their own officers & they dispersed quietly after the Sultan had spoken to them\n","45":"\n\nTue 1st\n\nMounted parade today till 2 oclock then had dinner & had nothing to do this afternoon;We played the 2nd Regt a football match this afternoon & it was a draw after a good game the scores being (3 points each, put this evening in throwing a medicine ball about till it was too dark to see; A metal road has been made from from Wardan station down to the camp, it is marvellous the pace these niggers can put down a road.\n","46":"\n\nWed 2nd\n\nAs the Sigs are having agood deal of work to do at Teira Lieut Mack asked\n\n2-2-16\n\nfor another man to be sent out & Les left here by the 7 oclock train; Nelson received a pass to visit Cairo today & we had the same old parade of mounted work till 2.P.M. & then finish for the day; This afternoon C Troop of A.Sqd played D troop football; The 2nd Regt. also had a match going\n","47":"\n\nThurs 3rd.\n\nMounted drill again this morning; this afternoon 2 teams from this Regt played a football match I was playing & managed to get filled up with sand & was beaten by 3 points to nil. Received a parcel of medicines from Edie today\n\n4-2-16\n\nFri 4th\n\nMounted drill as usual today & this afternoon our team had an easy win over the 1st Welsh miners winning by 18 points to three; The 2nd L.H. were beaten by the Welch R.A.M.C. the scores being 3 to nil; A canteen is now opened for the 1st L.H. Bde & there is some dissatisfaction on account of them charging us dearer prices for goods than what they charge the Welch Tommies, both canteens are run by the same people & they refuse to serve us at the Tommies canteen. Our Brigadier (Col Cox) was brought to the canteen last night to see if anything could be done to fix the matter up; I expect to see the canteen come down some day if it is not a little more reasonable\n","48":"\n","49":"\n\nHad rifle & kit inspection this morning, & were also paid. I had to take a shift on the phone this afternoon as 3 Sigs received passes to town today; Two teams of this Regt played football this afternoon; The Welch miners did not take their beating too well yesterday & have not proved themselves sports; We had a few good showers of rain late this evening;\n\nSome gift parcels were distributed today amongst the troops. The 2nd L.H.Regt held sports today & in the alarm race the bugler blew the alarm; The English officers hearing the alarm stood the whole 53rd Division to arms & sent a messenger over to find out the reason; they thought the enemy must have been sighted close by, but found there was nothing doing, but it caused some excitement for the Tommies\n","50":"\n\nSun 6th\n\nChurch parade this morning & this afternoon B Sqd beat C. football by 3 pts to Nil, Percy Treasure came out today & I sent a note in to Stan by him; A fine rumor sprang up today that we will be away from here before next Sunday, destination unknown, but probably to \n Salonika; I fancy it is only a rumor.\n\n7-2-16\n\nMon 7th\n\nThis morning Nelson was busy getting Sig. gear from the 2nd Regt. & the Signal Troop, to make us up to strength .A Troop of the 2nd Regt left this morning for Terieh to relieve Mack, & the Sig. gear Traill took with him is to be left there for the 2nd Regt. Sigs; It is now a certainty that we are leaving here to relieve the composite Regt. near Alexandria; I accomodated a Tommy who came along this evening looking for boxing, but he was no champion\n","51":"\n","52":"\n\nI have had a pain in my left side since Sunday, & decided to see the Dr. this morning to see if there was anything wrong inside, but it proved to be only a kink probably from football. So I had it paintd with iodine & put on light duties for the day; \n\nThe Troop of A Sqd men arrived back from Tierieh this afternoon, & said they had a very good time there; Some reinforcements arrived today to take the place of men who are still away sick, Matheson & Treasure amongst them; A good many lads are blithered tonight; Cpt. Lindsay received leave of absence for 4 days to meet his father who is on his way from England to Australia; Lindsay left here last night\n","53":"\n\nWed 9th\n\nNelson received a pass to visit Cairo today & I was left in charge; We went onto the Ridges & started on Heliograph work, but a fairly strong wind was blowing grit all over us & getting in our eyes; so decided to put the morning in riding we went several miles into the desert, but found nothing of any interest only ridge after ridge & every ridge looking the same as the one we had just left.We arrived back in camp shortly after one oclock; The 2nd L.H. had an easy win in a football match against the Welch lads this afternoon winning by 11 points to three; Yesterday an English Tommy was hung up at the triangle (Field punishment) for failing to salute an officer) then put in the guard room where he commited suicide by cutting his throat;\n","54":"\n\nThurs 10th\n\nMore gift goods were distributed today; Had long distance Helio work this morning; This afternoon A.Sqd. beat B Sqd football (5 pts to nil). The Brigadier (Cox) objects to the Bde being split up & is trying to stop the 1st Regt. from going away next Monday unless the Bde goes; sorry to hear today from a letter from Will that Uncle Orvill had died\n","55":"\n\nFri 11th\n\nMore Helio work this morning & nothing doing this afternoon; After tea Les took the lamp out a little way from the lines & sent back to give Reid some practise; The Regimental parades are for the most part practising Cossack Post duty with an occasional sham fight.\n","56":"\n\nSat 12th\n\nThis morning the bugle had us out of bed at 5.30 & were told to pack up & be ready to move away at once; We left Wardan Railway Stn about 12 oclock after having loaded our horses & gear; We had a very interesting trip, with only two stops on the journey, one at Wastar, here we found an English Station Master & was surprised to find such a fine town there, Beni Suef is the separating point of Upper & Lower Egypt & was our next stop; The country looks fine all the way from Wardan here; We came to our destination about 3 oclock at Beni Mazar, & after the usual hour or so to get everything unloaded & put on the transport we were led by an Egyptian Officer through a native village & camped in some old mud yards, put the horse lines down & ready for bed by eleven oclock\n","57":"\n\nSun 13th\n\nReveille at 6 oclock this morning. Led the horses out to the Canal to water. A Greek was on the scene early & did a good trade selling bread jam etc.; B Sqd stayed a village named Fant & are to do patrol duty from there; about 50 miles towards Cairo; A Sqd are about 30 or 40 miles farther on from here; Each squadron had a train each; I believe C.Sqd of the 2nd Regt. went through late last night & are going out farther still; A Troop of this Sqd went out at 10 oclock today to look for a camping place for us tonight we followed at 1.P.M. & after a 9 or 10 miles ride through cultivated lands, we crossed a canal on barges & camped close by a village on the edge of the desert. Armored trains patrol the lines now & it is expected that we shall clash with Senoussi’s shortly\n","58":"\n\nMon 14th\n\nThe Colonel went in on a special train to Beni Mazar this morning, he is to meet the General there; We are camped right by a graveyard & there was a native funeral today; Early this morning two Egyptian soldiers came in off the desert on lovely white camels, they had been scouting & were mounted on the fastest camels I have seen; The Egyptian Soldiers are acting as guides to us & seem very good men.\n\nB troop left here at 1.30 today to guard a weir about 6 miles away; Head Quarters & C.Sqd are together here also the machine gun section; We have a troop out every night on Patrol; I have to go out with 3 men tonight mounted to a well about 1 mile in the desert; & signal back to the troop on the ridge by the camp if we see any armed Senoussi coming\n","59":"\n\nTue 15th\n\nWent out to the well with 3 men of D Troop last night & found the well was right by a tomb & received orders from Lieut Wright to stop any natives from coming near the well & to take them prisoners & were to halt any number up to a dozen before giving the alarm; Nothing happened during the night & by the yapping of jackals in the desert they seem to be pretty plentiful; Sergeant Griffiths appears to be troubled with nerves early in the game as he was the Sergt. of the troop on the hill & stood his men to arms early this morning & said he saw us galloping in but he only fancied it as we had nothing to disturb us; It appears as though they expect some fighting here as batteries of artillery have taken up positions about a mile\n\n \n\n15-2-16\n\nbehind us amongst the cultivation fields; Les goes on the patrol tonight & Reid tomorrow night, as we are the only 3 sigs available will will have it pretty constant; The troops are getting a good deal of work to do getting the camp in order, fatigues, Etc. the whole Sqd on fatigue this morning Tents were erected last night after tea; yesterday afternoon we put down breast lines for the horses & dug up several skulls & pieces of skeletons while digging the hole, we can dig down a couple of feet anywhere here & strike skulls; Dave Lindsay turned up here this afternoon after his trip to Suez; The Col. Adj. & Nelson went away early this morning by train & arrived back tonight ; This afternoon Les. Reid & I went out to the well & put the lamp up, we intend to leave it there day & night\n","60":"\n\nWed 16th\n\nThe signallers have some work before them now; The Military have taken over the telephone service is this part of the world; Head Quarter Sigs are now working a telephone from the house of the Mayor of this village A Sqd Sigs are to work a phone from Shusha where they are now camped & B Sqd from Ezbet Bughra; These stations are off the main railway line to Khartoum. The Head Quarter Sigs are to leave here & work the phone on the main line at Fashan, Maghagha Beni Mazar & Samalut, & our Brigade H.Q. are at Minia & have communication with the 2nd Regt. further South. There are two villages here one on either sides of the canal Sandafa on the East & Bahnasa on the West where we are camped, the C.Sqd Sigs are to work the phone from\n\n16-2-16\n\nhere when H.Q. move; This morning we saw a jackal from the camp amongst the tombs, also a fox; All men who are not of fatigue work here during the morning put in their time digging trenches on the ridge just above the camp; This morning a horseman was seen to ride in close enough to observe that a party of men were trench digging he must have also seen the guard on the well & then turned & rode off into the desert again; he is a mystery but must have been an enemy scout .The Mayor of the village presented us with 2 steers & two sheep, also some native bread & some eggs today, the bread is not up to much but better than biscuits it is made of native meal. This afternoon I went out with the troops on patrol & went 3 or 4 miles into the desert, & saw nothing but jackal tracks. Reid is on duty at the well tonight\n","61":"\n\nThurs 17th\n\nYesterday Major Smith, Cpl Biggs & 4 men went for a long ride through all the native villages around here to see if the roads are good enough for the transports to travel over. They received a warm welcome by the natives everywhere, & they could not do enough for them feeding both horses & men at every village they visited, & the Egyptian land owners all gave pressing invitation to stop for supper saying they would have a banquet in their honor; About 2 oclock this morning several natives from this village came to see the colonel , they said they wanted to get their women-folk away as they were afraid of an attack being made here, but they went away satisfied when told that they were quite safe in the village; \n\nLast night flares were fired into\n\nthe air constantly for half an hour but they were a long way in the desert but it proved that the enemy are not a great way off; Today the Mayor of the village sent over 2 calves again for the squadron; A troop went with Col. Meredith today to patrol along the canal & had a royal time at a French landowners place, he supplied the lot with dinner composed of ducks, beef & mutton, also whisky for those who cared for it; A large landowner offered to give two large houses for the men to use as barracks also a house for officers, but the Col. declined the offer as he said the camp was now struck & we are in a more suitable spot if we are attacked; I am on duty at the well tonight & a patrol of 4 men are constantly on patrol several miles in the desert both day & night; tonight being the first time the night patrol go out.\n","62":"\n\nFrid 18th\n\nThis morning Cpl Guthrie went in to Beni-Mazar with a party of 4 men to bring out more ammunition (52 cases) I had a very easy time at the well last night went to bed as soon as it was dark & never woke till sunrise;\n\nA transport goes from here to B troop every , & they are having a very fair time by all accounts but fare no better than we do for tucker; Boxing after tea & then went to the canal with several other lads, & had a swim; The niggers selling, Egyptian cigarettes, matches, candles, & occasionally bread & jam charge terrible prices 1\/- for a small loaf of bread; An Egyptian Officer has turned up a few times , & brought the prices down a little, but the natives send them up again as soon as they leave.\n","63":"\n\nSat 19th\n\nKerosene has run out here & we cannot keep the lamp alight all night now & it was brought in from the well last night; & Smithers was on duty at a different post in the desert last night. This afternoon I went over to see the lads in B Troop. I went as guard to the transport with Sergt Doyle & Charlie Burke, We took them over some bread for a change.\n","64":"\n\nSun 20th\n\nSome gift goods were distributed today (sent by Mrs Vernon) I was not lucky enough to get any, had nothing to do today, but am on duty on mounted patrol tonight; Sutherland the despatch rider says we are likely to have a scrap within a few days, but probably a little higher up the river\n","65":"\n\nMon 21st\n\nLast night the mounted patrol of 3 men & Corp. Johns had an adventure probably with a jackal as they could not make out what it was in the dark so, halted it & challenged 3 times & then fired a shot & saw nothing more; This morning while the transport was going over to B Troop one wheel broke through the earth into an old tomb that had been hidden; The Dr & Maj Mills & several lads secured curios out of it such as old coins etc.; Was on duty last night with the patrol out to the North; I sent down 10\/- worth of bread to B Troop today , the name of the village they are camped by is Sequela. Had some rare fun boxing tonight; An Aeroplane flew over us into the desert this afternoon\n","66":"\n\nTue 22nd\n\nWent down to B Troop today as escort to the transport & had a very interesting time; brought a mail down from the station with us on our way back; The Col. Adj. & all the Officers went away for dinner today & had a troop as escort; The Col. & Officers all got rather merry & after dinner 4 or 5 natives were showing our men how the Senoussi`s fight galloping on ponies & firing as they went ; The Col. told the Adj to show them one better so he ordered the troop to mount & fix bayonets & charge mounted, They say they had a fine days sport, & there are always plenty of volunteers to go on any of these trips\n","67":"\n\nWed 23rd\n\nSome English troops have taken over from our machine gun men at Sequela & are guarding the bridges. B troop do nothing but mounted patrol work; The Tommies are making their post very strong for defensive purposes & barbed wire has been laid down through the crops; Nothing happened today beyond the usual routine of stables Etc.\n","68":" 24th\n\nWas on mounted patrol duty last night; & this morning I was kept busy getting things out of the black kits for B Troop; This evening 8 men under Capt Higginson went out to try & surprise some Senoussis who come in close every night & there tracks are very plain\n","69":"\n\nFri 25th\n\nThe special patrol saw nothing of the camels last night & 8 men are to go out again tonight. This morning all N.C.O.s & any privates who wished to fell in & had to do one hours duty they are supposed to be learning how to salute by numbers Etc. & hardly know whether to take it as a joke or not & object .A telephone line is being erected from the Railway Station to this camp; We have an interpreter with us, an Egyptian he joined us 3 or 4 days ago. Old mail has been turning up here very constant but it is all for lads who have been wounded or left us sick Cpt. Bigg was sent to Minia today with a poisoned arm; We are living well at present plenty of bread & fresh tender meat.\n","70":"\n\nSat 26th\n\nLast night several natives went between the men on the special patrol with donkeys & camels loaded with burcene ; they did not know that they had gone through till they saw where they had crossed their tracks during the night; Johns & had an argument this afternoon but the Col came on the scene during the first round & stopped the fight.\n","71":"\n\nSun 27th\n\nWas on mounted patrol last night but had a very quiet time, a patrol from B Troop managed to catch a couple of Bedouins a few night ago who came in to buy burcene & they are at present in gaol. 5 Lovetts Scouts are attached to us & are to go out on camels with natives scouting a couple of days at the time received a parcel from Stan tonight.\n","72":"\n\nMon 28th\n\nThe Cpls still have to fall in daily for lectures but I am exempt from them & they are only a farce at any rate; they do nothing but tell yarns Scotty Hamilton was on patrol yesterday & shot a gazelle; Foxes are very plentiful about here & see several every day from camp.\n","73":"\n","74":"\n\nL le Measurer commited sucide by shooting himself at Heliopolis a couple of day ago as he was not allowed to rejoin the Regt. It is reported that the Senussis have retired from here & are making their way back across the desert, they could not have stayed long as their food & water would have run out & apparently they decided not to fight. I am on mounted patrol again tonight.\n","75":"\n\nWed 1st\n\nIt is reported from good authority that the Senussis had another bit of a scrap at Mersa Matru a few days ago, & received a bad time of it, both their leader & 2nd in command being killed; Nothing happens here of any consequence but the patrols are now told there is no necessity to go out so far on the desert when on patrol duty; Some of the lads have volunteered to clean out the wells from which we use the water; Reid went down this evening to do a shift There are two wells within 600 or 700yards from camp, & we use the water out of these for washing, & get drinking water from a well about a mile further into the desert, the depth of the wells are from 25 to 50 feet. \n\nNelson , Tomlinson & Smithers are to go to Zietoun to a school of instruction next Friday they will be away 3 weeks\n","76":"\n\nThurs 2nd\n\nPut in this morning taking over Signalling Equipment from Nelson;\n\nThis morning an English Tommy was accidentally shot (at Sequela) by a machine gun, the bullets went through both legs above the knees & he died while being bought to the train at Sandafa; Capt. Wells had to go down to attend to him.\n\nCaptain Higginson appears to have sobered up for the first time since we have been here, & celebrated the occassion by saying everything has to be \ndone\n much stricter, & is getting himself well disliked in consequence but I suppose it will only last for a few days; Reid goes on the ‘phone with Head Quarters Sigs tonight & we do no more patrol work for some time at anyrate.\n","77":"\n\nFri 3rd\n\nHigginson as drunk as ever again today; Sgt. Nelson, Smithers, Reid, & Cpl Guthrie left here this morning to proceed to Zieteoun to the School of instruction; We are short of N.C.O.s at present & I volunteered today to be Cpl of the piquet & guard every third night to make it easier on the others, the heat is increasing daily & there is no danger now of being attacked.\n","78":"\n\nSat 4th\n\nWas Cpl of the guard & piquet last night; Some natives erected a building here a couple of days ago & have started a canteen as their prices are exhorbitant & we have very little money as we had received no pay since leaving Wardon\n","79":"\n\nSun 5th\n\nIt is reported that we leave here (Bahnasa) next Tuesday or Wed. & are to go to Minia & that English troops are coming here to take our place, nothing out of the ordinary happens here the days & rather warm to be comfortable but the nights are quite chilly, I brought the set of boxing gloves & we make use of them pretty well every evening\n","80":"\n\nMon 6th\n\nI heard yesterday that last week an order came to the Regt. asking for applications for Signalling Officers, Nelson was rcommended, also Traill by the Colonel. Traill is a nephew of Meredith & that accounts for his recommendation; Leask also applied & is a far better man than\n\nTraill, but Nelson is the only man in the Regt.capable of taking the job \n\nThis afternoon one of the English scouts attached to us captured 5 natives with two donkeys a good way out on the desert & brought them back they were cross exmined by the Colonel through the interpreter, they said they were going to the salt lakes for salt. A penalty of 2 years can be imposed for going out at all at present, but the Col gave them the benefit of the doubt & told the Egyptian Officer to let them go, the Officer then asked if he would give them a good thrashing before letting them go but the Col. objected; \n\nI have been pretty busy today getting all the Signalling gear together ready to move, but an order came through this afternoon to remain where we are till Thursday morning\n","81":"\n\nTue 7th\n\nThe Patrol caught another nigger on the deset last night\n\nCapt Harris turned up at the camp this afternoon, also a big gun Egyptian paid the Colonel a visit, he had an Egyptian body guard with him. The natives are digging up old ground (black) & carting it on camels & donkeys to the banks of the Canal where it makes a rich bed to grow crops. The ground they are digging is over old tombs, & some rare, ancient souvenirs can be had for the picking up, coins that must be thousands of years old are quite common also old fashioned lamps made of earth (baked) mummies are also common; \n\nThe Tommies attached to us are rather good company, & are having a very amusing argument on conscription tonight.\n","82":"\n\nWed 8th\n\nOne of the 2nd Regt men was found floating down the canal yesterday by some of A Sqd. men he had been drowned & was fully dressed; We have been very busy today pulling down tents & carting everything to the Station, getting ready to move off early tomorrow morning; B Troop came back from Sequela & joined us this afternoon; Some English Yeomanry are camped by the Canal tonight ready to take up our place here; I am on picket again tonight as all the other Corporals were out last night; Soon after I had fallen in the piquet, the Adjutant sent for me to go into Sandafa with the Interpreter to get a mechanic to fix the phone which was not working too well; We were having\n\n8-5-16\n\na pretty smart canter to the punt when the Interpreters horse galloped into a hole & turned turtle, but was not hurt & we continued our journey after I had gone back to camp to capture his horse; It was nearly midnight before I got to bed.\n","83":"\n\nThurs 9th\n\nReveille this morning at 5.30 & we were soon on the track; The horses had an easy time of it this morning as we had to cross the Canal on a punt, a couple of mile from camp & the horses while waiting had a good feed of green barley; We met B Sqd about 11 oclock, & the Regt took the wrong road & most of the afternoon was put in resting the horses, as we only travelled about 15 miles & did not strike camp till after dark; Today has been a little cooler than the days have been lately & had a very fair trip; Soon \n\n9-3-16\n\nafter we had crossed the canal a native boy about 12 years old floated down the stream. It is a nice ride throught the cultivation plots but we had a fair amount of dust this evening; & are rather short of tucker\n","84":"\n\nFri10th\n\nWere hauled out of bed at 5 oclock this morning after sleeping on a very rough piece of ground that had been cultivated & lost no time in getting on the road again, we had had to pass through a village with very narrow streets, & one troop of us had to go back to give the limbers a hand to get through, we had great fun getting the G.S. waggons around the sharp corners, & knocked a few bricks out of the corner of one or\n\n10-3-16\n\ntwo houses but managed to get through O.K.; about 12 oclock, B Sqd & Head Quarters continued on their journey & C Sqd turned off to the right & going through another native village we came to a clump of palm trees in a mud wall, where a part of the 2nd Regt have been stationed. \n\nhere we put down the breast lines as this is our destination for the present; Major Smith said he expected a message from the 2nd L.H. from off the desert by helio during the afternoon & I put in the afternoon looking for a flash which never came; Reid & I have to attend to a telephone that is set on a post here, but as it rings when called up, we are not tied to it, & sleep under it during the night; A canal is running within a few yards of the camp & it is about half a mile to the edge of desert with cultivated fields between us\n","85":"\n\nSat 11th\n\nHad no calls on the phone after 11 oclock last night & slept like a top; This afternoon I washed out my flannel & intended having a swim but as we were told at dinner time that swimming in the Canal was prohibited, I contented myself with standing in the edge of the water & having a bath in full view of the general public going along the road on the opposite side of the Canal, but as the general public consists exclusively of natives & it appears to be the custom with them to strip off anywhere they want a wash, it didn`t much matter.\n\nA good many lads have bought short fishing rods from the natives & have good sport fishing, the fish they catch are only a few inches long but makes good sport & I suppose they would be alright to eat, if they caught enough\n\n11-3-16\n\nIt is rumoured here that 60,000 Australian Infantry troops are going to France & some of them are on their way now; Leask told me that Maj.Mills had recommended him very strongly to Col.Cox for a commission as a Signalling Officer before Leask heard applications were called for , so both he & Traill should have a good chance of getting one as Col Meredith recommended Traill. Our Sigs are at every station where there is a telephone switch board so as we can do business on the same line as the Egyptians & it is very amusing at times to hear the Aus & Egyptians trying to make each other understand \neach other\n\nSome Egyptians started a canteen going here for the Queenslanders & can buy chocolate, porridge, cigarettes, tobacco & beer, also tinned fruit, but as we have received no pay since leaving Wardon we cannot afford to buy too much\n","86":"\n\nSun 12th\n\nOur tents were brough from Minia station this morning & erected this afternoon; Reid & I have a tent to ourselves with the telephone by the tent pole, we are having a particularly easy time as we can move about anywhere within hearing of the telephone bell & come back to it when it rings, we go to bed anytime we wish & trust to the phone waking us; \n\nToday has been lovely neither too hot or too cold, & the spot we camped on would be considered a perfect place for a picnic at home & it is a holiday in reality for me, One troop has to go out every night on patrol. Also a troop during the day so with the guards & horse piquets fatigue & patrols , the ordinary troopers have a fair amount of work to do\n\n12-3-16\n\nThe name of the place we are stationed at is \"Hassan-pasha\"; The Regimental Head Quarters are at Tukh-el-Khul also two troops of B Sqd, the other two troops of B Sqd are at Nazlet-El-Adib with the machine gun section, & A Sqd is at Ezbet-Sou-Doon\n","87":"\n\nMon 13th\n\nThe native have been fighting amongst themselves all the morning as one or two outsides come on the scene & squatted down by the Canteen & started opposition & the owner of the Canteen strongly objected, \n\nabout dinner time Capt Higginson hunted them all away except the Canteen owner; We were paid £ 1-10-0 last night & the Troopers £ 1-0-0 & tonight several lads went into the village looking for adventure the natives complained that they were making a row in the village & a party was sent to arrest them at 8 oclock; \n\nLieut Snow received a telegram tonight asking if he would consider a transfer to the artillery Ammunition Column, at Tel-El-Kebir\n","88":"\n\nTue 14th\n\nWe have been told that no mail is to leave Egypt for 6 weeks on account of the movement of troops from here to France; The Interpeter is now camped in this tent. He is a Christian, also a young Egyptian who was in England studying for a Dr. when war broke out is here & seems a very decent fellow, he also is a Christian, & says that practically all the natives in this village are also Christians; \n\nEleven bags of mail for the 1st Regt is at Tuk-El-Khul, I am doing a fair amount of work here at present, but it is not very labororous as it is all book work; The Col objected to Snow transferring to the Art. Amm. Column, the Col is always nasty in this respect, & does not like anyone to leave the Regt. even to better himself; \n\nBoxing is very popular every evening we make good use of the gloves\n","89":"\n\nWed 15th\n\nDavies who went ot Heliopolis with sick horses from Bahnasa arrived back here yesterday & says that nearly all our reinforcements have been transferred to the Ammunition Column & are to go to England. he said Stan is also trying to transfer, but was told that no Signallers would be taken.\n\nReceived orders at dinner time to go onto a hill in the desert about 3 miles from here & try to pick up the signalling station at Minia with the helio. The trumpeters took over the phone work. We had an enjoyable ride through the cultivated fields (Reid & I) & had no trouble in getting in touch with Minia about 10 miles away & arrived back in camp to find a mail had arrived for us, also a parcel of Cocoa & milk from Stan;\n","90":"\n\nThurs 16th\n\nA message came through on the ‘phone last night that we were to pick up Sig Stations fromNazlet-El-Abid, Tuk-El-Khul & Ezbet-Sou-Doon today & had to be on the station from 8.30AM till 5 PM daily. so we left camp early this morning & had no trouble in getting in touch with Minia but the sun soon clouded & we could do nothing; Some natives from a village close by came up to see us working & one could speak English a little, & as we were leaving to come back to camp at 1 oclock, he asked us to have tea with him, & as we were in no hurry decided to humor him & were soon under a huge covering made of bags & enjoyed as much\n\n16-3-16\n\ntea as we could drink with the heads of the village served in small tumblers, We had great fun showing them how to regulate the telescope & field glasses & they made a couple of very amusing discoveries throught the telescope; We left them soon after 3 oclock & Reid & I had an argument as to who could tied the sheaves the fastest & \nafter\n to settle the argument dismounted & gave our horses to one of the farm hands to hold & set to work tying barley sheaves & in a short time had finished off all the barley that was cut. We arrived back in Camp just on stables after putting in a very enjoyable afternoon .\n\nHad several rounds with the boxing gloves after tea & then a bash in the river; A rumor is afloat that we leave here shortly, we have heard nothing of it yet, but the natives tell us we shall soon move!\n","91":"\n\nFri 17th\n\nWas out on the desert again today. but Minia was the only station we could get into communication with; The Colonel came down today & the 3 men who were the cause of the disturbance in the village a few nights ago were up before him but discharged;\n\nHad tea with our native friends at the village on the edge of the desert when coming back to camp; 3 camels were sighted on the desert West of Nazlet-El-Abid this afternoon but they made off back into the desert when the patrol tried to approach them, & special patrols are being sent out from all villages where troops are stationed tonight in the hopes of catching them; \n\nBoxing still booms every evening after tea.\n","92":"\n\nSat 18th\n\nThis morning there was a crowd of natives with donkeys, goats, sheep, fowls etc waiting to cross the river on the punt when we were going out this morning apparently making into a small village close by us to a fare;\n\nHad tea again with out friend Abdul Hamid when going onto the desert this morning & promised to call again this afternoon, but as we went a couple of miles towards Tuk-El-Khul at dinner time in hopes of getting on higher ground (without success) we came into the village a different way & did not call on him; It was windy today & very unpleasant on the desert with the fine sand blowing all over us; I am trying to raise the energy necessary to learn Arabic; Fleas are very troublesome here\n\n"}}