{"Document Name":{"0":"Diary_0197","1":"Diary_0197","2":"Diary_0197","3":"Diary_0197","4":"Diary_0197","5":"Diary_0197","6":"Diary_0197","7":"Diary_0197","8":"Diary_0197","9":"Diary_0197","10":"Diary_0197","11":"Diary_0197","12":"Diary_0197","13":"Diary_0197","14":"Diary_0197","15":"Diary_0197","16":"Diary_0197","17":"Diary_0197","18":"Diary_0197","19":"Diary_0197","20":"Diary_0197","21":"Diary_0197","22":"Diary_0197","23":"Diary_0197","24":"Diary_0197","25":"Diary_0197","26":"Diary_0197","27":"Diary_0197","28":"Diary_0197","29":"Diary_0197","30":"Diary_0197","31":"Diary_0197","32":"Diary_0197","33":"Diary_0197","34":"Diary_0197","35":"Diary_0197","36":"Diary_0197","37":"Diary_0197","38":"Diary_0197","39":"Diary_0197","40":"Diary_0197","41":"Diary_0197","42":"Diary_0197","43":"Diary_0197","44":"Diary_0197","45":"Diary_0197","46":"Diary_0197","47":"Diary_0197","48":"Diary_0197","49":"Diary_0197","50":"Diary_0197","51":"Diary_0197","52":"Diary_0197","53":"Diary_0197"},"Date":{"0":"unknown","1":1581.0,"2":1582.0,"3":1588.0,"4":1589.0,"5":1590.0,"6":1591.0,"7":1592.0,"8":1593.0,"9":1594.0,"10":1600.0,"11":1605.0,"12":1634.0,"13":1643.0,"14":1656.0,"15":1704.0,"16":1709.0,"17":1710.0,"18":1711.0,"19":1712.0,"20":1713.0,"21":1714.0,"22":1721.0,"23":1728.0,"24":1736.0,"25":1742.0,"26":1747.0,"27":1748.0,"28":1757.0,"29":1759.0,"30":1760.0,"31":1761.0,"32":1762.0,"33":1763.0,"34":1764.0,"35":1765.0,"36":1767.0,"37":1768.0,"38":1769.0,"39":1770.0,"40":1773.0,"41":1774.0,"42":1775.0,"43":1778.0,"44":1779.0,"45":1780.0,"46":1781.0,"47":1785.0,"48":1787.0,"49":1788.0,"50":1789.0,"51":1793.0,"52":1800.0,"53":1809.0},"Entry":{"0":"\n\n","1":" 1\/18\nTwo years today since we \nreached Mar\n landed in Marsalles & if anyone had told us then that the war would still be as desperate as ever we should have laughed at the possibility & yet the Germans are making their greatest effort & have regained all the ground they lost in the Somme Fighting of 1916-7\n\nWe are still up near Ypres which is quite quiet after last years Autumn Fighting though I expect we are pretty sure to go south soon to relieve some \nof the\n Division down there.\n\nOne effect of the German Advance has been to stop all the 'peace-grousing'\n\nthat goes on for lack of any other subject & it has had the same effect in the old country to automatically settle all strikes & trade disputes\n\nThe nation would have been false to its traditions if it had not been so\n","2":" 6\/18\nAm writing this in the train at Goedaersvelde in the truck with the horses having come on here today from La Clytte & we are just waiting to start 6.45 p.m. destination unknown but at a guess The Somme again \nwhere\n","3":" Bertangles (Near Amiens)\ndetraine at Amiens yesterday morning after an al night journey & arrived here about 2 p We are billetted in a \nsqu\n large group\n\nof farm buildings with the usual 'rectangular smell' in the middle of Bairnsfather describes it. \n\nAmiens nearly deserted, the houses & shops all shut up & the few people left all seem preparing to go – we saw lots of carts filled high with household goods & groups of poor old women carrying \ntheir\n bundles \naway\n of clothes etc. Very wet last night I slept in an old Farm cart that was \npushed\n under the Cart Shed so quite dry.\n","4":"\nHave found out that these are the farm buildings of the Chateau of the Marquis de Clermont Tonnerre a Bertangles canton Villers Bocage\n\narrondt D'Amiens, Somme to give the full name & address I saw on one of the farm carts. His son a colonel in the French army was killed just a couple of days – before we arrived\n","5":" ","6":"\n 11 (I think)\nI had to take my chestnut mare down to the Mobile Vet. Section. She was bombed at Dickebush last october & a splinter of iron had worked up to the surface & set up a big swelling that had to be lanced. So yesterday afternoon I had to set out to the Company at St Leger & get another horse & arrived back this morning at 10 am. to find everyone loading up for a move It is now \n3 p.m.\n 4 p.m. & we are to move off in an hour\n\nFritz has made another push up near Sailly & it is possible that we are being rushed up there. As I was coming back this morning from the Company I met thousand of British Cavalry going through at a fast trot – \nlimb\n horses & men sweating with the exertion It is all very different to the fixed Trench warfare we have been used to.\n","7":" (Near Morbecque Flanders)\nWe reached Amiens about 7.30 on the evening of the","8":" It is deserted by civilians & already shows signs of severe shelling. As we entered the suburbs we heard the shells going over, each explosion getting louder as we neared the Station\n\nWe had just turned into the entrance of the station when a big shell exploded right in the centre of the Station Yard which was already crowded with troops waiting to entrain. I felt the splinters flying past me & I was 50 yards from the burst – I have no idea how many it got\n\nThe order was given to clear the station & we marched off down the road till the shelling was over – We \nwaited\n halted there till long after dark – bitterly cold & raining & did not entrain till about midnight in pitch blackness –\n\nNo light job entraining horses in \nblack\n raining blackness \nTravelled\n In the train until 3 p.m of the","9":" & detrained near Hazebrouck & immediately \"hooked in\" to our waggons\n\nSaw many walking wounded on the road & the last 3 days the roads have been crowded with refugees – the most pathetic sight imaginable old men & boys & women of all ages with their children \nall with\n some with the \nfarm\n carts drawn by horses, donkies & dogs or the poorer pushing wheelbarrows or carrying their poor little\n\nbundles of clothing\n\nWe reached our camp that evening about 6 p.m. & as Fritz was not too far away we were issued with extra ammunition & we fully expected a call out that night. But it did not come & yesterday we moved again – we were ready by 10 a.m. but did not eventually move off until 1 p.m. making towards Sercus – we were halted for some time about 1 kilo from the latter place at a crossroads just the 4 waggons in charge of the Sgt. – When the Sgt drew our attention to a man dressed as an officer standing at the X roads with a map in his hand having a good look\n\nat everything. The Sgt didn't like the look of him – so he took two of us up to \ngain\n also get our impression – he was close cropped, sallow complexion & his clothing was a very scratch \naffair\n get up – just what might have been got together on a battlefield – We had a good look at him & then went back to the waggons 50 yds away We had no sooner turned back than he set off walking at a good pace in the opposite direction\n\nWe all agreed that it didnt look too right So the Sgt jumped on his horse & trotted after him We got out our rifles in case there was any trouble & he made any resistance\n\nWe saw the Sgt stop him & make enquiries & not evidently being satisfied brought him back\n\nin the meantime one of our staff cars came to the X Rds & I baled it up & told them we had got a suspected spy So they waited for him, asked him a few questions & then put him into the car & took him off as he got in he gave the Sgt the bitterest glance imaginable & then we heard about an hour after that he was a genuine officer! And now I wonder which is the most 'cut up' the Sgt or the 'Spy'?\n\nWe \ncame\n did not stop at Sercus but made our way back to Wallon-\n\nCapel which we reached about 7 pm. I had just got my horses fed & was settling down when I had to turn out again to take some rations on to near Morbecque 6 kilos away for a party on foot that were going on there – we eventually reached the place at about 10.30 pm. dead beat – This was last night.\n\nToday I have been back to Wallon-Capel\n & I am stopping here for the time \nbeing\n","10":"\nSince above we have moved from Morbecque to \nanother\n Wallon-Capel & then yesterday to St Sylvestre Cappel where I am writing this. – after we arrived about midday I had to take a load of rations on to the\n\nChateau at Eblingham where I stopped the night & came back this morning – The Chateau Farm Buildings like every other building about here was packed with refugees\n","11":" Anzac Day (Near St Sylvestre Cappel)\nsince we came here Fritz has started shelling the village steadily day & night – He has knocked several houses about & last night put one through the roof of the Church – He put one \ninto\n near our waggons & horses but fortunately it proved a 'dud'.\n\nToday we changed our billet to a farm about a ½ kilometre from the village \nHe has\n \nWe have had bombs by night here\n – Very heavy bombardment \nin the\n these last two nights – as heavy\n\nas I have heard also bombs.\n","12":"\nStill camped on the outskirts of Sylvestre Cappel – have nothing to write about just waiting (that is what we all feel) for Fritz's next big effort. We are having moonlight nights & Fritz is doing a lot of night bombing round about here – varied with long distance shelling – he put half a dozen big shrapnel over the village last night.\n\nFrom a small party, some 12 of them – German prisoners brought down a week ago I got a ration of their army bread. Black, sodden looking & most unpalatable stuff\n\nimaginable – & when one thinks that the army gets the best of their food – one wonders what the Civilian Bread is like.\n\nNine of the dozen were mere lads, they claimed to be 19 but hardly looked it & had evidently only just joined up their regiments from the depot by the look of their uniforms\n\nI have just heard that my name has been sent in to Headquarters amongst others for a furlough to Australia I can hardly realize the possibility after nearly 4 years now of this life. When my\n\nturn will come – I have no idea but it is something to be \"on the list\"\n\nVery hot weather this last few days & the country is looking lovely\n","13":"\nStill in the same spot nothing of unusual interest to note – \nhe has\n Fritz has kept up a steady shelling of the village night after night all the civilians have left & the buildings are steadily crumpling up – We \nare just\n have had a few fragments of shell drop round us although we must be 400 yards away \nEvidently the shel\n & one man\n\nwounded – But we are nicely out of his zone of fire except when he makes bad shooting as he did the other night & lobbed four heavies into the farm in the next field to us and made \nD.A\n Divisional Artillery who were billetted there make a hurried exit – They had a marvellous escape no one hurt although two shells fell in the farm yard within a few feet of where men were sleeping\n\nThis is in the French area\n\nnow & we have lots of French Soldiers billetted in neighbouring farms – tough hardy looking men they are I have no idea how one got the idea that Frenchmen are small men – They are every bit as big as the Britisher\n\nTheir infantry on the march do not seem to keep any regular step – each to his own stride in a sort of shuffle, but they get along at a great pace There transport seems very rough & ready – vehicles of all descriptions – not \ntwo\n\nthe few standard patterns we have & their horses very poor but then the latter do not get the generous feed that ours receive.\n\nStill they do the work & that is the main thing\n\nWe have just read in the papers that the War Cabinet has promised to refrain from bombing Cologne on Corpus Christi day at the request of the Pope. Coming on top of the shelling of Paris & bombing our hospitals at Etaples Our so-called government\n\ncouldn't have done anything more to depress the troops like this – The army is disgusted & the French Civilians – all Catholics the same – when will those so-called leaders of the Country take the gloves off and tell the Pope to mind his own damned business.\n","14":"\nStill in the same camp just waiting for Fritz – \nhis\n It is common talk that a big attack is imminent – expected tomorrow I think they are ready for him.\n","15":"\nStill in the same camp although we are to move in two or\n\nthree days – Fritz has failed to attack up here as expected – He has been making a further bold bid for Paris but his attack as broken down again & Foch's counter offensive has compelled him to retreat from the Marne as he did almost 4 years ago. – Speculation as usual is very rife as to where we are bound for – perhaps out for a rest or to another sector of the front\n","16":" Wardrecques\nwe arrived here on Saturday – it is a pretty little village some 8 kilos from St Omer where we are to entrain tomorrow morning We are all packed up ready\n\nto move out at about 3 am.\nbound for some part\n","17":"\nWe \nentrained\n arrived at St Omer just nicely daylight – the grey old Cathedral looked a lovely sight rising amid the yellow walled red tiled houses with the dawn for a background. \nleft\n\nThe 'Comforts Fund' was as is usual now ready for us on the Station & we had a hot cup of coffee \njust as\n just before leaving – We arrived at Longpre in the late afternoon & immediately trekked out reaching Brucamp \nafter d\n at dusk – after fixing up my horses & having something to eat, as the\n\nbillets were all crowded. I & McNicholl made our 'doss' in at old cow shed – It was just going 11 p.m as I wound up my watch \nfor the night\n a long day. This was yesterday – Up early \nlittle\n this morning & done a long trek with many stiff hills and pulled in about 4 p.m.\n\nAllonville is the name of the village – we are back in the 'old Somme' country which we know so well – it is our old \"rest area\" \nof 1916-7\n during the Somme Fighting of 1916-7 – Now it is just behind the front but D.V we will have Fritz away\n\nfrom it & very soon too – as I think \nthere is a big\n there are big things doing. Just heard that No 1 Coy who are somewhere near us – don't know where' was bombed last night & had 32 horses knocked – No men I believe\n","18":"\nGood news being coming through all day, – (am writing this in my blankets – our Australian Corps has advanced nearly 10 miles – got practically the whole of the guns opposite them, some 10,000 prisoners including a complete C.C.S. with nurses a railway train filled with\n\nreinforcements & that Fritz's are coming down driving their own transport – this I got from a Signal Coy. This is only on the Australian Sector – others are doing pretty well\n\nOur H.Q moved up at Midday at an hours notice but I am left behind with my limber until I get further orders All the 4 GS. waggons have gone up & I am here on my own\n","19":" 13\/14\nI moved up the following day the","20":" to a little place called Blangy-Trouville a few kilos behind Villers Brettoneux which was about our line on the","21":" The line is many miles ahead\n\nof that now & Villers is only in their heavy gun range & bombs which he is very constant with nightly –\n\nI am writing this from Villers B. as I came up here last night – The Division is I believe pulling out for a few days rest – Our Infantry could do with a few months after what they have gone through.\n\nHot weather & the dust in the roads terrific – the traffic on the roads has been enormous but this will be relieved in a few days if not already the railway will be connected through with the advance\n\n& that will ease the roads.\n\nThe ground is all\n The country all round is pockmarked with shell holes most of which have fell harmlessly but I have just been to see the results of a chance shell which more than paid for itself. It was a direct hit on a battery of tanks just near here that were parked up some 15 of them – \nready for the advance next morning\n loaded up with petrol & trenching material ammunition etc ready for the advance next morning. The one hit was blown into halves & fired\n\nthe fire & exploding ammunition attacked the adjoining tanks & all except three were destroyed These three the drivers managed to get away. \nA man\n\nA man who was in Amiens yesterday told us that the people were streaming back in thousands.\n","22":" Foilloy\nWe moved in here yesterday morning from Villers-Bret – some 5 kilos distant – It is another ruined village near Corbie on the banks of the Somme. There was a Fritz aeroplane flying very very low over Villers B at daybreak yesterday & he must have observed something for we had only\n\njust got away from the Chateau when he put some shells into in & inflicted I hear several casualties on the incoming H.Q.\n","23":"\nThe Div. has gone in again three days ago & I have been \nbusy\n taking rations up to advanced H.Q. some 9 kilos up from here The Tanks went through here for two successive nights just before the Div. went up this was a sign of Dirty work at the Cross Roads & this last two days there has been a steady stream of prisoners coming back – I met one batch of 200\n\non my way up yesterday – The whole of the track up is \nstrewn like\n marked out like a paper chase with German Gas Masks that the Fritzs have discarded.\n\nHad a pretty wakeful \nnight\n time last night there was a roaring bombardment of our guns on our sector – & then although I thought we were pretty well out of range here he started put a steady shell every few minutes \nwith\n into Corbie the town that adjoins this the other side of the river & being a bright moonlight night of course Fritz was dropping\n\nhis eggs & playing his machine gun on to the ground also perhaps a \nhot pint cup of hot strong\n pot of hot strong sweet coffee made\nfrom canteen purchases also had its wakeful effect.\n","24":" 6\/18 Fouilloy\nThe Div has been back here for a\n The last few weeks have shown the most complete change imaginable – From having \"our backs to the wall\" as Haig said in his message to the troops the Germans seem to be in full retreat from Ypres to Rheims. It looks as though the intend to go back to their old line of the Spring. He is going\n\nas slowly as he can & I think his idea is to delay in as much as possible so that the allied armies have no time to organise an attack on his line of defence before the weather breaks for the winter.\n\nThe Div has had a weeks spell & other troops have gone on ahead of us – It is now our turn to \ntaking\n take up the running again & we are to leave here in the morning at daybreak with some 30 kilos to do.\n\nLabour Companies have been cleaning up the town & Corbie & \nI have\n there \nalready\n are already a few civilians back\n","25":" Halle Nr Peronne\ngot here about 3 pm after a long trip of between 30 & 40 kilos passing through Bray – Maricourt practically all country the Hun has been driven from this last month – Perhaps one of the most bloodstained areas in the world four times has this same stretch of country been fought across. One signboard in German \"Nach Fricourt 6.5 Kilo brought back to us memories of The Somme of 1916\n","26":"\nThe Div is in the line again opposite St Quentin \n& advanced He has gone up on the\n & the\n\nwhole army is practically facing Fritz in his old Hindenburg Line – Advanced H.Q. has gone up. & I expect if the weather keeps fine there will be a big effort to move him \nout of\n back from this line before the winter sets in\n\nMoonlight nights again & the Hun has been over bombing but has met rather a warm reception in this sector 4 machines down in two nights. From what I can see the R.AF are using a new stunt. Evidently a night fighting patrol is up. At anyrate what we saw was the\n\nsearchlights picked up the Hun & immediately our 'Archies' opened on him. Some seconds after \none\n another plane dashed into the searchlight on the tail of the Hun – Showed its code light & the Archies eased fire\n\nThen we saw the big bombing plane come tumbling down\n\nOne could hear the cheering \nfrom for miles\n from every camp for miles.\n\nAs soon as the German Retreat began we had an order issued warning us \nof\n to beware of German Booby Traps Bombs & mines laid in dugouts etc which exploded\n\non entering or removing an article such as a Helmet \nor other s\n. \nThe rotteness of the Hun is\n Four men of the","27":" Battn were killed a few days ago by one of his vile traps There was a dead German on a stretcher & they went to bury him – on picking up the stretcher they released a bomb which killed four of them The vileness of the mind that could think of such a dirty idea.\n\nThere is another tale going about but I can't vouch for the accuracy – it seems too incredible except nothing seems too dirty for him.\n\nThere was a diving board in one of the Somme Pools an inviting place on a hot day – The first man dived & never came up – a second man went in after him – he never came up The rest investigated & found them both impaled on bayonets under the water.\n","28":"\nAm in a Reinforcement Camp Nr. Peronne on my way back to Australia for a furlough – There are some 25 of us from the Company We arrived in this morning – several hundred out of the Division &\n\nare moving on in the morning. I believe we are going by rail through Italy – then across to Alexandria\n","29":"\nWe marched \nyest\n back yesterday to Bray-sur-Somme some 18 kilos where we are being assembled with the men from the other Divisions – We are beginning to feel that we are really on our way.\n","30":"\nMade a start at 9.30 this morning from Bray on our long train journey – ","31":" of\n There are 30 of us in one horse truck. – There is a kitchen truck – one half of the train draws tea at midday & the other half stew – then vice versa\n\nin the evening. We have to sleep with out heads to the sides 15 on each side & dovetail our feet into each other – The trucks are not 8 feet wide so the opposite mans feet come up \npretty close at\n to one's shoulders\n","32":"\nGot up tis morning & the first station I noticed the sign of was Longueville & then a little later passed through Nogent-sur-Seine so we are now well S.E. of Paris\n","33":"\nFound ourselves this morning halted in a big railway siding we were fallen in & marched up to a rest camp a \nfew\n near by & had breakfast – Have just\n\nhad a hot shower & we are to fall in again at 11 a.m. The scenery is quite changed hilly & timbered I believe we are in the Rhone Valley at St Germain au Mont D'Or. \nLeft\n\nLeft here at noon & soon reached Lyon & have been travelling down the Rhone Valley – a moving picture of Towns & villages Farms, Orchards & Gardens.\n","34":"\nWoke up this morning to find ourselves in Marseille Station & have been travelling all day close to the coast towards Italy – getting some glorious views of the Mediteranean\n\n& I\n This is I suppose the Riviera as we are en route for Nice & Monaco I believe\n\n5 p.m. are halted for an hour at Cannes right alongside the end of the promenade. Some of the men have been having a swim\n","35":"\nPassed through Nice, Monaco & Monte Carlo in the evening too much except to see enough to wish it had been daylight. Woke up this morning to find ourselves halted in Savona which we are just leaving \njourneyed\n along the coast as far as Genoa then we have turned off \nin the\n at an angle & are now in Novio. Since we left the\n\ncoast the country has been getting flatter. All these towns remind us of the European parts of Alexandria \nFlats seem to\n Everyone except the richest seem to live in flats\n\nThe country has so far been \nhilly\n mountainous with the little vineyards orchards & farms – Down the valleys & hillsides are the beds of streams & rivers at present quite dry but during the winter I expect they become roaring torrents of water\n\nHardly any of the coun\n The country people go about bare foot & even in the towns nearly all the children & the women\n\nfolk of the poorer classes can all be \nseen to lack these\n seen barefooted \nI did\n \nI have never\n One is struck by the beauty of the \ngirl\n children & young women – black hair & eyes beautiful olive complexions & a graceful figure which they carry with a dignity & pride all their own, rich or poor \nthey seem to be very proud\n \nyet\n\nYet on the other hand one reflects that one has never seen so many wrinkled leather faced old women\n\nWe are passing through the plains of Lombardy now – more\n\nfertile but not such interesting scenery as the Ligurian Coast. We have just halted at Voghera for an hour to have a wash shave etc at a Rest Camp along the Railway & the \nbugle has\n trumpet has just sounded the \"Get aboard, get aboard\"\n","36":"\nWoke up this morning to find the train just pulling into a siding at Faenza & we were marched into a rest camp near by where we have had breakfast & a shower. it is a beautiful camp laid out between avenues of trees with little wooden kiosks \nwhere one\n kept by Italians where\n\none can buy postcards, curios etc. I am writing this in the Canteen whilst having a drink of beer. The Colonel of the Camp has just been in to announce that we are to be marched through the town so that we may see it \nals\n and also give the Italians a chance to see some Australians\n\nOct 1 Casalbordino-Pollutri\na \nlitt\n tiny port on the Adriatic coast down which we have been travelling since last evening\n\nThe country looks very poor & life primitive so what it must be amongst the hills we can see in the distance\n\ncut off from modern transport except for an occasional light railway one can hardly imagine.\n\nI am writing this at midday in a siding at Termoli where we are having one of our many halts to let another train through.\n\nBully Beef & Cigarettes are better than money in this part of the world – we have been exchanging them for grapes & tomatoes all the way down the line. Constantly \npassing\n meeting troop trains of Italians from Albania & Salonica dirty, slovenly looking men they are.\n","37":" Tarante 4.30 pm.\nat last our railway journey is over & we have\n\njust detrained & are in a rest camp overlooking the harbour The town in the distance looks \nan insignificant\n a very ordinary little place – before the war just a port of call for coastal trade but now it is an important base \nfor\n both naval & military for the Macedonian \nFront\n & Turkish Campaign & I don't suppose there was ever so much work & money in the place before.\n\nThe country has been very monotonous these last two days & we are all glad to have got this stage of the journey over – 8 days in the train\n","38":" \nS.S.\n H.M.T. Ormonde Glasgow\nwas on\n\nbaggage \ngurd\n guarde down at the jetty all last night – There was an early reveille 4.30 am \nwe\n and we went aboard the ship which is lying out in the harbour in lighters We were all aboard by 10 a.m. She is a big lump of a vessel some 15000 tons I believe – very fast & comparatively new. There are ","39":"\n a lot of 'Tommies' on board going with us to Egypt for the Palestine & Bagdade fronts.\n","40":"\nS.S.\n H.M.T. Ormonde \nwith\n 10 a.m.\nWe have just pulled out of the inner harbour through the very narrow entrance which divides the town – & are now\n\nwaiting \nto\n in the outer harbour We are one of a convoy. The town looks a good deal bigger from this side & spreads along the front on either side of the entrance.\n\nWe had \"stations\" assigned to us all yesterday in case of torpedoing & from now on one has to wear a lifebelt all day & sleep with one at hand at night Also, no sleeping, is allowed below deck\n","41":"\nStill waiting in the outer harbour and the only thing that has been moving in the last 24 hours has been the \"Furphies\" or Rumours. \nWe\n Turkey has chucked it in; Austria has made a peace with Italy; Germany has\n\napproached the U.S. through Switzerland & agreed to 11 of their 14 terms; We are stopped because there is a 2 days armistice & no movement of troops; We are sailing today; We are sailing Thursday; We are to disembark the Tommies & are loading more Aussies & going straight through to Australia. These with their many variations have been floating round.\n\nAs we came out of the inner harbour yesterday the shipping was 'tooting' on their syrens & a great crowd at the harbour entrance cheered us as we passed through. It seemed\n\nvery unusual as these people must see transports coming in & \nout every\n out as a daily sight But \nthe\n if there is any truth in the peace talk this would have accounted for their enthusiasm\n","42":" 8 a.m.\nWe have just \npulled out around\n passed through the outer mine barrier there are only two ships 'The Ormonde' & a captured German Boat the 'Kaiser Lynd' bothe carrying through we have three destroyers as an escort \n& are\n An Italian airship has just passed overhead I don't know whether she is part of our escort or just on regular submarine patrol.\n\nHave been on guard since 5 p.m\n\nlast night & finish up at 5 p.m. tonight\n","43":"\nIt is just getting dusk as we are running into Port Said having had a \nsmooth\n calm & uneventful journey\n","44":"\nWe did not disembark last night as expected, but this morning the British Troops have been getting off & the Ship is we believe taking us on to Kantara this afternoon (kantara = E1Qantara on Suez Canal)\n\nWe shall be glad to get off for she is a \nHungry\n Ship. We have sent in complaints & the only effect was to have some rigmarole read out about being on \"Lines of Communication Scale\n\nof rations\" \nbut the officers messes\n & although we dont get even enough bread & margarine to satisfy us the officers \nare\n are still managing to eke out their existence on about 8 or 9 courses for dinner & then they expect & ask us to vote for conscription\n\n4 p.m.\nSince 2 p.m. we have been steaming slowly down the canal – it is very hot & the scenery very uninteresting on the east side just a flat sandy waste with \nsigns\n the peaks of a range of hills in the distance the western side is pretty much the same except for the Railway line & the road while the monotony is\n\nbroken occasionally by \na Station & tying up place for ships\n \nthe green trees & palms\n a patch of green trees & palms surrounding a \nbungalow\n series of bungalow buildings of the Stations or tying up place for ships.\n","45":" Kantarah\nStill on board ship We reached here at dark the last mile or so we were passing one huge Base Camp – an endless series of stacks of \nfodder & cases\n bales of fodder & bags & cases of supplies. This is \nI believe\n the main base for Palestine & also I believe for Salonica. It is a monotonous looking place to look at this morning\n\njust a huge camp & railhead bounded on one side by the canal & on the other three sides by a waste of sand & tufts of desert grass.\n\nThe Padre handed out a bottle of wine through his Cabin window to some of the men sleeping on the deck near him Said it was to break the good news that had just come through that Germany had agreed now to evacuate Belgium & France before discussing peace. If it is true it looks like a complete climb down.\n","46":"\nWe got off the boat yesterday at 5 p.m. & marched\n\nto the Station \nsome\n a mile away. There was a hospital train filled with men from the Palestine Front – British Australian & N.Z. Indians all burnt so brown that colour was no distinction\n\nThey were mostly malaria cases & very weak & thin they looked It made us realize that each front has its particular hardships & the Winters of France are probably counter balanced by the flies & heat of Palestine.\n\nAfter the usual delay at the Station we \nleft\n started at 9 p.m. in open\n\ntrucks with low sides about 40 of us in each squatting on our packs. It was a bright warm moonlight light & really the trucks were better than the stuffy carriages. It is not very far but with the usual side tracking it was 5 a.m. before we reached this camp just outside Suez where we are waiting for our boat for the longest but final stage of our journey\n","47":"\nFour years yesterday since we left Sydney.\n\nGot a pass yesterday & went into\n\nSuez with Jones. Took a gharry out to Port Tewfik which is the entrance to the canal. \nCame back , did a bit of sho\n & on returning did a bit of shopping & had a walk through the native Bazaar followed by dinner \nat\n of Roast Chicken followed by an omelette, then a cup of Egyptian Coffee at a Native Place sat at the usual little table on the pavement outside the shop.\n\nAfter that to the open air picture show. There was an australian Gazette showing \n& amongst\n & one of the scenes was of wounded\n\nAustralians returning & the welcome waiting for them & we both confessed it brought a lump to our throats \nthat\n to think what was waiting for us.\n\nGreat news posted up in the Suez Y.MCA, Lille & Ostend evacuated.\n\nThen a walk of a mile back to Camp \nin the\n \nabout 9 p.m.\n in the cool of the \nevening\n night.\n\nIn the brilliant sunshine\n In the day time the dazzling sunshine \nwhen one can see all the poverty & filth\n it is all hard & garish and one hates the East but in the cool evening with \na brilliant moon\n\n& stars it\n the brilliant stars & a sky like purple velvet everything is softened & The warm colours of the houses & the natives \nsitting round their\n in their long robes sitting \ndown\n round the doorsteps make one forget all the poverty & filth \n& one\n It is then that one can appreciate Kipling when he \"hears the East a calling\".\n","48":"\nWe left Suez yesterday on board the Port Sydney & are now steaming down the Red Sea – Although only a medium\n\nsize boat she promises to be a more comfortable ship than the bigger ones \nfrom\n – There is only one troop deck \nwhich is big","49":" the portholes will be open all the way \nexcept\n unless perhaps we strike very rough weather\n\nThe food so far has been very good – we are now on the Australian Ration Scale & it is very much different to the British Scale which we experienced on the hungry Ormonde.\n","50":"\nHave had several very heavy squalls today – for a few minutes each it has blown\n\na hurricane & the rain has come down in a mass – so thick that the syren had to sounded as in a fog. & then as suddenly we have steamed into clear weather – \nbut it has\n","51":"\nPassed Aden last night & are now \nsailing due\n steaming almost due East – It has been cool for this part of the world due I suppose to the strong winds which we have had continuously – They are the Monsoon winds\n","52":" Colombo –\narrived here yesterday morning after a very smooth journey. We got leave\n\nashore for a few hours – Went ashore in lighters & then marched up to the Barracks two or 3 hundred yards from the wharf where the YMCA had some dinner ready for us – a \nramb\n rickshaw ride & ramble round the shops in the afternoon & the ladies of Colombo gave us all tea at the YM in in afternoon – I had to be back on board by 5 p.m. as I was on guard that night.\n\nCoaling is nearly over & I expect we will leave here some time this evening\n\nHeavy showers of rain these last two days & the atmosphere\n\nis as steamy as a \nwashhouse\n laundry.\n","53":"\nWe had a run\n\nGood news has been coming over the wireless apace these last few days. We have been waiting for the inevitable & last night came the rumour & it was confirmed this morning \nthat\n on the noticeboard that Germany had surrendered & signed our armistice terms, \nThere was\n\nIn 4 days time we should reach Fremantle.\n\nAmen\n\n"}}