{"Document Name":{"0":"Diary_0358","1":"Diary_0358","2":"Diary_0358","3":"Diary_0358","4":"Diary_0358","5":"Diary_0358","6":"Diary_0358","7":"Diary_0358","8":"Diary_0358","9":"Diary_0358","10":"Diary_0358","11":"Diary_0358","12":"Diary_0358","13":"Diary_0358","14":"Diary_0358","15":"Diary_0358","16":"Diary_0358","17":"Diary_0358","18":"Diary_0358","19":"Diary_0358","20":"Diary_0358","21":"Diary_0358","22":"Diary_0358","23":"Diary_0358","24":"Diary_0358","25":"Diary_0358","26":"Diary_0358","27":"Diary_0358","28":"Diary_0358"},"Date":{"0":"unknown","1":2015.0,"2":2016.0,"3":2017.0,"4":2018.0,"5":2019.0,"6":2020.0,"7":2021.0,"8":2022.0,"9":2023.0,"10":2024.0,"11":2025.0,"12":2026.0,"13":2027.0,"14":2028.0,"15":2029.0,"16":2030.0,"17":2031.0,"18":2032.0,"19":2033.0,"20":2034.0,"21":2035.0,"22":2036.0,"23":2037.0,"24":2038.0,"25":2044.0,"26":2045.0,"27":2108.0,"28":2109.0},"Entry":{"0":"\n\n","1":"\n\nTo-day at 12 o’clock the ship stopped for a few minutes while we buried a Seargent who died yesterday. The burial service was conducted by Padre Finigan of the","2":" Australian division. The Buglars blew the last post as the body was slipped into the sea.\n\nThis Seargent was badly gassed when in france, and was being Invalided home, but the heat in the Red Sea was too severe for him to pull through. As a rule, the men that have been gassed are taken home via the Cape of Good hope, as the heat that way is not nearly so severe as the Suez Canal Route, and therefore not so dangerous to their lives.\n\nAt about 3 p.m. this afternoon we crossed over the Equator, and the distance that we have travelled since leaving Colombo is 491 miles up to 12 noon.\n\nJune\n\nAt noon on Monday the ships position was Latitude 2.44 degrees South and Longtitude 87.55 degrees East. The wind is strong and rather a heavy sea is running. No incident has happened on board that is worth mention.\n\nOn Tuesday the","3":" the ships position is Latitude 6.0 degrees South and 90.28 degrees East. The distance that we have travelled from 12 noon yesterday to 12 noon to-day is 245 miles. At about 7 o’clock in the evening I attended a lecture on Bolshevism by Mr. Slowman the Head Master of Sydney Grammer School.\n\nThe position of the Ship on Wednesday was Latitude 9 degrees 15 minutes South by Longtitude 93 degrees 07 minutes East. The wind has been blowing very strong all day. The distance that we have\n","4":"\n\ntravelled for the 24 hours is 253 miles.\n\nOn Thursday the wind was still fresh and the sea slightly rough. The distance we travelled ending at 12 noon was 250 miles. The Ships Position was Latitude 12°.32 South by Longtitude 95°.44 East.\n","5":" the","6":" afternoon saw the wind die down a good deal, and it is now much more comfortable on deck. The weather is beginning to cool off a lot, now that we are nearing Australia. The Ship’s position at 12 noon was Latitude 18 degrees 57 minutes South by Longtitude 102 degrees 57 minutes East, and the distance we travelled for the 24 hours ending at 12 noon was 274 miles.\n\nToward evening it again blew up very rough and became quite cold. The sea began to rise considerably. The rain also came down in torrents which made sleeping on deck very uncomfortable, nevertheless a good many men slept there through the night. I did not attempt it my-\n","7":"\n\nself, but slept between decks. All through the night the sea continued to run high.\n","8":"\n\nThe position of the ship at 12 noon was Latitude 22°.04 degrees South by Longtitude 104.51 degrees East and the distance travelled for the 24 hours was 236 miles. The wind and sea are still very heavy as a result of last nights severe storm.\n","9":" morning when I came on deck I was surprised to find a clear sky and all the rain gone. The wind slackened down a lot. It had changed round from the South to a South Westerly quarter, and it is now blowing head on to the ship. All through the day the sea continued to run high which made the ship pitch and roll about a good deal. At noon when the ships position was taken (by means of instruments provided for\n","10":"\n\nthe purpose) it was found that we had only travelled 256 miles as against 274 miles for the previous day, a difference of 36 miles which shows plainly that the sea was not too smooth. A Wireless message was received on board to-day (direct from Perth W.A.) to the effect, that all troops will be Qurantined for a short period when we reach Australian ports.\n\nOn Wednesday evening at dusk we arrived at Fremantle and anchored just out off the harbour entrance, as it was too late to enter that night.\n","11":" June the","12":"\n\nThis morning at 7 a.m. we weighed anchor and entered the harbour, and moored at wharf E in the Outer harbour at about 11 a.m. All the West Australians were got on shore after about an hour’s messing around. There was a fairly large crowd of men, women and children waiting on the wharf to welcome the boys home, and they were getting very\n\nJune\n\nimpatient and annoyed with the time it took to get the boys off. After all the troops had disembarked we were allowed to go on shore for an hour or two before the ship sailed. We were not allowed to go out of Freemantle, so it did not take me long to see round the place, as it is only very small, there is about three fairly busy streets in the place. I walked about for a while and then returned to the ship.\n\nAt 4 p.m. we left the wharf and started on the voyage to Adelaide. Seven or Eight men missed the boat but it was entirely their own fault. They were clearly given to understand that the ship was leaving at 4 p.m. and that they were due back at 2.30.\n\nA lot of men came aboard drunk and were fighting amongst themselves. One Officer made a \n\nJune\n\ngreat row, he wanted to fight everybody he came across, eventually another Officer came and took him away before he got into any trouble. How the men managed to get the Liquor, I don’t know, as all the hotels were closed. I suppose they got it on the quiet from men who carry it around and sell it in the streets. There is a lot of men who run Sly grog shops, and who do nothing else but sell bad whisky to the soldiers when they arrive. Judging by the way these men were fixed the Liquor must have been extra bad. A good many had the horrors.\n\nOn the","13":" we rounded Cape Lewin in a rough sea and the wind blowing very strong from the South West.\n\nOn the","14":" we entered the Great Australian Bight. The wind and sea is very rough. But fortunatly the seas are running the same\n\nJune\n\nway as we are going, as they do not make the ship roll as much as they would do if they were broadside on. As it is there is a great deal of movement in the ship.\n\nJune the 14th\n\nTo-day we are well into the Bight. The sea is in an awful turmoil. Breakers are comming right across the upper deck which is at least 20 feet above the calm water line. The wind is very strong and is lashing the waves into spray which blows right over the whole ship. The surface of the water is covered with white froth and foam.\n\nToward nightfall the wind died down but the ship is still rolling and pitching much more than it was yesterday. On deck is very uncomfortable and it is almost impossible to walk about the decks. They are slanting too\n","15":"\n\nmuch. Down between decks everything is wet and things are strewn about the floor. Plates, cutelry and kits as well as blankets and hammocks and lifebelts are all mixed up to-gether. It is impossible to keep things tidy as the movement of the ship rolls everything moveable into the centre of the deck.\n\nThe","16":" was a beautiful sunny day, a vast improvement on the two proceeding days. A rather high swell is running the result of the late storm. I hope we do not get any more weather like the last two wild, wet and miserable days. Bad weather at sea makes everything and everybody cold, wet and miserable.\n\nOur Position at noon was Latitude 55 degrees 31½ minutes South by Longtitude 131 degrees 11 minutes East which according to the chart is about three parts of the voyage across the\n\nJune\n\nBight.\n\nOn the evening of the","17":" we reached Adelaide and anchored just off from the entrance to the outer harbour. It is 10 o’clock at night and is too late to go inside. The harbour is too small for a boat as big as the Leicestershire to go in and turn about in the dark.\n\nJune the","18":" 1919\n\nThis morning at about seven o’clock we weighed anchor & entered the Outer harbour where we were soon moored to the wharf & the disembarkation of the South Australians soon commenced, by 11 o’clock every South Australian was off the boat. In the afternoon were were allowed on shore within a mile of the ship, at 3 p.m. we were entertained to tea by the Y.M.C.A. who were assisted by the ladies of the V.A.D. At 5 p.m. we were allowed leave to Adelaide city, special free trains\n\nHOME AGAIN\n\nLeicestershire Troops Landed.\n\nThe South Australian troops by the steamer Leicestershire were landed at the Outer Harbour at the expected time – 11 o’clock on Wednesday morning. As the special train from Adelaide to meet the vessel did not leave until 10.32 a.m. relatives travelling by that train were too late to witness the arrival of the vessel, and most of the men had landed. About 10 minutes after the disembarkation had started a tremendous cheer was sent up by the soldiers on board. The crowed opened up a passage way, and Mr. \"Sammy\" Lunn arrived beathlessly on the scene. He was the \"important personage\" who had received a greeting which was a record one coming from a visiting troopship. Led by Mr. Lunn the crowd which had then gathered returned the greeting. Lieut. A.B. Mortimer, the disembarkation officer, was assisted by Lieut. A. Mitchell and Staff Sgt. A.N. Gardiner, Sgt. W.J. Stephens boarded the vessel at the anchorage, and addressed the men on repatriation, Returned Soldiers’ Association, and army reserve. The War Duchess and the wharf were decorated with flags in honour of the soldiers’ return, and the Y.M.C.A. department, assisted by the ladies of the V.A.D. provided refreshments and \"smokes\" in the No. 1 shed. The South Australians were briefly welcomed by Major J.J. Hughes, A.P.M., on behalf of the State Commandant (Brig.-Gen. J.M. Antill, C.B., C.M.G.) owing to illness, the Mayor of Port Adelaide (Mr. R.H. Smith) was not present. Lieut. P. Buller represented the District Naval Officer (Capt. C.J. Clare, C.M.G.). Lieut. L.C. Colley commanded the military guard, and W.O. Guthrie was in charge of the naval men. Wharf leave was granted to the eastern State men, who to the number of 960 were entertained at tea by the Y.M.C.A. between 3.30 p.m. and 4 p.m. in the No. 1 shed, after which they listened to an enjoyable concert in the new Y.M.C.A. Hall at the harbour. Selections played on the wharf in the morning by the District Military Band under W.O. Stanley were greatly appreciated by the soldiers. The Semaphore Cheer-up Society distributed \"Welcome home souvenirs\", and also provided refreshments for the naval and military guards. The vessel, which is coaling, was expected to leave for Melbourne at a late hour on Wednesday evening or early on Thursday morning. Officers landed were:- Major T.R. Mellor, Capt. A.H. Fraser, Lieuts. W.H. Baker and G.C. Lewis, A.P. Stone, A.E. Pape, C.D. Gibb, C.A. Hewitt, P.J. Jackett, J.G. Sweeney. Imperial soldiers disembarked were:- J.B. McMillan, F. Sachery, S.A. Tucker, E. Atkins, W.J. Whelan, C. Baldwin and J. Messer. Extra men to arrive were:- 2137, Pte. A.F. Garrie; 3727, Pte. A. Matheson; 4930, Pte. T. Hooper; 2699, Pte. R. Williams; Lieuts. A.P. Stone and T.C. Stephens. Men who did not arrive were:- Lieut. C.S. Brown, Capt. G.W. Firman, Chaplain J. Lee, Lieut. W.H. Baker, 51822, Pte. F.P. Lamp; 53668, Pte. C.T. Marchant. The total of all ranks landed was 114.\n\nwere run for us, & we were given a complimentary ticket to the \"Pav.\" Cinema Show. I walked up & down King-William St. & other parts of the town for a while & then went in to see the Pictures.\n\nThe last train back to the ship was 10.5 p.m. & we all had to catch this or miss the boat.\n\nI was not able to see too much of the town nor could I form much of an opinion of what it is like generally, because it was too dark, and a person cannot see much the first night in a new city. One thing I did notice though, is the very wide streets & the wide Railway gauge – it is much wider than the N.S.W. gauge this being 5 ft. 2½ inches wide.\n\nWe are taking a little more coal on board here, all the cranes are going as hard as they can, we are expected to be leaving very late to night or early to-morrow morning.\n\nOn the","19":" we steamed out of harbour at 7 a.m. At 12 noon were were well on our way with the South-Australian Coast on our port side quite close, we continued\n","20":"\n\nto keep the land in sight until towards evening, when it blew very hard & the sea began to swell so we had to put further out to sea for safety. By 10 p.m. it was frightfully rough & the ship was tossing & pitching a lot. The following day the sea had calmed down a lot but it is still very rough. At about noon we sighted the Coast of Victoria which we kept in sight until night.\n\nAt 2 a.m. we were all woke up by the sound of the ships syren. The noise caused a bit of a scramble among some of the men, who thought it was a signal to come up on deck with life belts on & stand at their boat stations. It turned out later to be the call for the Pilot to come out & take charge of the ship going through the rip & in the harbour.\n\nIt was rather rough going through the Rip, the ship rolled & creaked a good\n\nJune\n\ndeal. It is the Pilot’s duty at all Australian harbours to come out to sea & Pilot the ship through the entrances to her anchorage.\n\nWe entered the heads of Port Phillip & anchored just inside opposite the Quarrantine Station.\n","21":"\n\nAt 9 o’clock the Quarrantine Authorities came aboard & inspected the ship & examined all the men to see if they had any signs of the \"Flue\" or any other disease amongst them. As no sign of any disease was discovered the ship was pronounced clean. At 10 a.m. we weighed anchor & proceeded up the Bay towards Melbourne, arriving at about 1 p.m. All the men are going to disembark at Melbourne. The Queenslanders are going off first, then the New-South Welshmen, & last of all the Victorians. The quota for Queensland & New-South-Wales are going overland to their destinations. Two trains will be waiting on the wharf for us when we arrive.\n\nAt 2 p.m. we disembarked from the steamer straight on to the waiting trains\n","22":"\n\n& we left shortly after.\n\nRefreshments were served to us by the ladies of the Victorian V.A.D’s during the journey.\n\nAt Albury we had tea at 8 p.m. & then changed into the New South Wales trains. On the New-South-Wales Railway were allotted a sleeping berth each & I had a very comfortable bed.\n\nWe arrived at Moss Vale at 7 a.m. on the morning of the","23":" & had breakfast served to us on the Platform, soon after breakfast was finished we started on our journey once again arriving at Sydney at about 10 o’clock. The Victorian & New-South-Wales people gave us a very warm welcome at the different stations we stopped at.\n\nFrom the Central Station Sydney, we were driven by motor to the Anzac Buffet in the Domain, where we were examined & if fit given our discharge. I was discharged straight away & given Leave from June the","24":" to","25":"\n\nOn my arrival at the Buffet everybody that was in the place was\n","26":"\n\nsinging out to me, or if everybody was not calling me it sounded very much like it, they were on all sides I did not know where to look, & felt properly lost. The first I saw was Allice Lewin, Lil Finigan & Gladys Albert. When I got inside I was met by Alma, Etta, Saidee, Wally Lewin & Esme. Outside the rest of my friends crowded around & on the trip home we were all in one Taxi-Cab about 15 of us, every where they could possibly poke a flag out of the car they had one. On arrival home the front of the house was hidden behing strings of flags of all sizes & shapes, & the house, ground, & gardens was all cleaned & polished up for the occasion.\n\nFor dinner Polly & Stan all the Lewins & ourselves were here. The dining room was adorned with flags of \"Welcome Home\" & colored streamers, & looked lovely. I spent my leave rather quietly, not going away at all & not taking any of the consissions that the Railway department allowed me. I had a free pass on all Government tramways during my leave. The only time I went\n\nJuly, August,","27":"\n\nout for pure enjoyment was when the Peace Celebrations were on in Sydney.\n\nAll or most of the Public buildings & business places were lit up with electricity & they looked lovely. The Water & Sewerage buildings were in my opinion the best effect. All the Flags of the Allies was the design, & they were all lit with their natural colors.\n\nDuring my Leave I bought a Camera & got a good deal of amusement out of Photographing people & objects.\n\nOn","28":" I started work at the Painting trade with Wintle & Wintle Contractors of Mosman Bay. This is the first work I was able to get since the termination of my leave on July 30th. Just at that time work was very scarce about Sydney & there were thousands of Returned Soldiers on the unemployed list at the Repatriation Department. The Repatriation Department procured this job for me. I was just about one week on their roll & drew sustenance pay to the value of £500.\n\n"}}