{"Document Name":{"0":"Diary_0062","1":"Diary_0062","2":"Diary_0062","3":"Diary_0062","4":"Diary_0062","5":"Diary_0062","6":"Diary_0062","7":"Diary_0062","8":"Diary_0062","9":"Diary_0062","10":"Diary_0062","11":"Diary_0062","12":"Diary_0062","13":"Diary_0062","14":"Diary_0062","15":"Diary_0062","16":"Diary_0062","17":"Diary_0062","18":"Diary_0062","19":"Diary_0062","20":"Diary_0062","21":"Diary_0062","22":"Diary_0062","23":"Diary_0062","24":"Diary_0062","25":"Diary_0062","26":"Diary_0062","27":"Diary_0062","28":"Diary_0062","29":"Diary_0062","30":"Diary_0062","31":"Diary_0062","32":"Diary_0062","33":"Diary_0062","34":"Diary_0062","35":"Diary_0062","36":"Diary_0062","37":"Diary_0062","38":"Diary_0062","39":"Diary_0062","40":"Diary_0062"},"Date":{"0":"unknown","1":1910.0,"2":1911.0,"3":1913.0,"4":1914.0,"5":1917.0,"6":1918.0,"7":1919.0,"8":1922.0,"9":1923.0,"10":1924.0,"11":1928.0,"12":1933.0,"13":1934.0,"14":1935.0,"15":1936.0,"16":1937.0,"17":1940.0,"18":1943.0,"19":1944.0,"20":1945.0,"21":1946.0,"22":1947.0,"23":1948.0,"24":1949.0,"25":1953.0,"26":1955.0,"27":1957.0,"28":1959.0,"29":1960.0,"30":1961.0,"31":1963.0,"32":1964.0,"33":1965.0,"34":1966.0,"35":1969.0,"36":1970.0,"37":1972.0,"38":1973.0,"39":1975.0,"40":1976.0},"Entry":{"0":"\n\n","1":" M. Clemenceau the great French Premier has been wounded by an anarchist named Cottin. M. Clemenceau was on his way to his residence from the Peace Conference at Versailles when his assassin made a deliberate attempt on his life.\n","2":" M. Clemenceau’s wound which was at first considered slight has now been declared to be a dangerous one as the lung has been pierced. Sympathetic crowds of his countrymen have waited outside his residence to hear any news as to their beloved \n\nleader’s condition. A more popular statesman the M. Clemenceau has scarcely ever existed. He is an old man, well over 70 years of age so that apart from the seriousness of his wound he would probably have a hard job to pull through. So far however no account as to his condition has been published. This old man took over the reins of his government at a very critical period of the war for France and electrified the whole country with his spirit and determination to crush \nthe\nand drive out the invaders.This huge task has now been \n\ncompleted and for the last two months M Clemenceau has been the \"Tank behind the Brick Wall\" at the Peace Conference. He is known throughout France as \"The Tiger\" and the name is certainly a fitting one.\n","3":"\n Went to a dance given by the Canberra Girls in Sutton Veny. Had a very enjoyable evening and returned home with Monty Manning and Harvey about 3.30 this morning. Awoke from my slumbers about 8 o’clock and was informed by my room mate Capt. Butler that I was to report to Bde Hqrs at 10 o’clock to receive orders\n\nabout embarking for Aussie. I hopped out had breakfast and buzzed off to Bde where I was told to report to No1 Command Depot Sutton Veny to await embarkation on the Derbyshire for Australia. 750 men are leaving this depot for the same boat next Sunday. Altogether she is booked to carry 1700 troops. Lieuts Cockram Austin and Langford and myself were allotted one large cubicle. We are a very fine crowd of fellows Ahem.\n\nHerb came along from Bde Hqrs mid afternoon where he is working in the Records Office \n\nand after having afternoon tea together Greenhill House Y.M.C.A we hired a car & went for a spin out Maiden Bradley way. \n","4":"\n I saw a Medical Officer this afternoon who sounded my heart and then asked me to sign a \npaper\n declaration stating that I was quite fit to return to civil occupation without a pension from the government. All the officers who are going on board the Derbyshire who could be mustered were told off for duty with the men this afternoon. I was given command of a company of about \n\n200 men. A number of the officers are away on leave and it looks as if they will not be able to get back in time to prevent themselves being taken off the boat roll.\n","5":"\n Innoculation for Flu has been proceeding apace with all men who are going home on the Derbyshire and the Euripedes.\n\nThe Sergeants in the Depot gave a dance in \nthe\n one of the canteen huts huts which provided a very pleasurable entertainment for \nthe\n all who were able to dance.\n\nI went along at the invitation of some of the Sgts but only stayed a couple of hours. \n","6":"\n Today has been the most glorious day we have had since being here this year. Nights continue to be fearfully cold though.\n\nThis afternoon Lt Cockram and I went along to the Canteen hut and took several snaps of the workers. They are a very bright bunch of girls. \nIn the afternoon\n We were afterwards entertained to tea by two of them. A splendid little story was told me by one of them. She was riding a bicycle in a little village a little time ago and was passing a old woman & a couple of kiddies. The old woman called out something apparently to the\n\nnippers who took no notice. So the cyclist drew their attention to the fact that someone was calling them but the nippers only responded \"us doesn’t belong to she\", which on careful consideration is fairly good English.\n\nGen. McCay who for many many moons has been G.O.C AIF Depots in the U.K is being relieved by Gen. Rosenthal. Gen McCay is and has been for a long time about the most unpopular leader in the A.I.F. This in some leaders spells success but not so in his case by any means. His unpopularity goes back further than I wot of as the 5th battalion pinched a case of whiskey from \n\nhis tent in Mena Camp (early in 1915) which he has carefully put by and cherished for a \"rainy\" day. The \"rainy\" day didn’t come off for him.\n\nHe is being returned to Australia shortly and we are wondering whose boat he is to go on. The","7":" Aust Division has never forgiven him for the frightful stunt we did on the19th","8":" our first stunt in France when we had 8000 casualties in as many hours with over 50% of killed. 480 men were taken prisoners mostly wounded who were unable to help themselves and had noone left to render them any assistance. \n\nI have heard two very ugly rumours of his doings in England as G.O.C A.I.F. Depots here. Ever since the A.I.F came to England we have had a large number of deserters and other undesirables who have caused no end of trouble and expense. About 12 months ago it was decided that these bounders should all be rounded up. At the end of 6 months our M.P.s and detectives had just about taken in the lot. They were awarded a G.C.M presided over by Gen. McCay himself who promptly \nallow\n granted all the men a clean slate & let them go and they disappeared again with the result that the fair name of \n\nAustralia has been \nsunk\n pushed further & further into the mire by frequent acts of violence and robberies committed by these men who for the most part are not Australian born but are proud to wear the uniform of the Anzacs.\n\nThe other rumour concerns the disposal of \nthe\n all spare mess and other cash which is devoted to what is called the G.O.C’s fund. Exactly how the money is used nobody seems to know, but \nrumour\n hath it that the generous Gen. McCay is using a considerable portion of it to make a good fellow of himself namely by giving £5 to every one of our own Lewes men and other army criminals. Of course all \n\nthe foregoing are only rumours and if they are not founded on fact then it only goes to prove the esteem in which this unworthy leader is held by men who have served under him.\n\n1st March\n Herb and I visited the Canteen Hut tonight at the invitation of some of the girls there. We had tea & then blew into Warminster in a taxi hoping to find a dance on at the Town Hall, but we found the place absolutely deserted with barred gates up at the entrance. After wandering around aimlessly we decided to return homeward and as the girls refused to be driven we walked back to the canteen (a distance of about three miles) in the \n\npouring rain.\n\nIt has been my misfortune hitherto as a rule to strike a girl who became emotional as the hour of parting drew nigh but these two were made of much sterner stuff and were very sensible so that our parting was a cheerful and not tearful one.\n\nThe girl workers at the Y.M.C.A. canteen and Salvation Army huts have had a strenuous and often a very rough time in the camps in Bath England and France but they have \nhad a\n stuck to their good work gamely. The diggers are not exactly a complimentary crowd but a more appreciative lot of fellows do not exist.\n","9":"\n I said goodbye to Herb this \n\nmorning at 0500 and went across to the camp where the men were. At 0820 I marched into Warminster with the second party being headed by our own splendid little band. Just before getting on the train tea & food was served out by the Y.M.C.A. and the band played some more. At 1000 all hands got aboard one of the G.W.R. Corp trains & were soon comfortably seated without too much crowding.\n\nIt had rained cats & dogs prior to and whilst marching into Warminster but now all the clouds had gone & the silver lining showed bright & \nclear\n sunny. We stayed a short while at Bristol where we had a good view of the suspension bridge. Arrived at Exeter \n\nwe stayed for half an hour and the Y.M.C.A. again came to light with good old tea. Our band got out here and rendered a couple of very fine selections. Soon after leaving Exeter we came to the sea front and travelled along it for miles in fact nearly all the way to Devonport. It was a pretty journey and I enjoyed it immensely whilst I was able to keep awake. We arrived at Devonport about 16.30 and went straight on board the Derbyshire where a steward showed us to our cabins. We were then informed that tea was on in the saloon and I bolted down. I was told that fourteen nurses were on board & the first person I saw on entering\n\nthe dining saloon was Sister Caren the girl who nursed me in West Maitland hospital when I was 15 years of age. I met her again in a box at the Albert Hall on Empire Day last year. She is now on her way to Aussie with her pal Sister Goggin from W. Australia. \n\nBoth these girls have seen hard and continuous service in Egypt France and England.\n\nWe had a good talk & I then had a good look round the Derbyshire. She is a 6000 ton boat of the Bibby Line. We have about 1700 men on board. They are fairly tightly packed. Food is pretty good so far although the arrangements for giving the food out to the men seem a little bit fut. The chief steward however informs me \n\nthe scheme he has adopted \nshould\n will work alright but I don’t believe him. The Sergts. have not been catered for decently. Devonport is full of naval craft of all sorts. H.M.S Tiger is quite close to us and Admiral Beatty’s flagship \nthe\n H.MS Lion \nhas\n is about 400 yards ahead along the wharf. On our right is the Ben Bow the biggest naval boat in the British Navy some say. She certainly is a tremendous size. The aeroplane ship H.M.S. is near by also. She is a peculiar looking craft. No funnels or rigging are to be seen at all. Her funnells slope back to the stern beneath the landing platform on top.\n","10":"\n I am Company Orderly Officer for C Company today. Capt Titford has taken over the job as O.C.\n","11":"\n We passed Gibraltar this morning at about 06.45. It did not look very imposing or impressive in any way though as it did not show up very clearly.\n\nOur trip has been a most enjoyable one since passing by the Bay of Biscay when a big number of troops and even the crew and one of the ships officers became a little bit green.\n\nTime on board is passing away rapidly and happily. Our band has been giving splendid selections daily with the exception of one or two days when it has been almost impossible to remain on deck at all.\n\nThe Y.M.C.A. has not forgotten us even though we are \n\non our way home to Aussie. Gramaphones peg quoits deck quoits reading & various other forms of amusement in which the very fine piano plays a prominent part.\n\nAll the boys are as happy as larry. The food on board is excellent and is easily the best we have ever experienced \nsince\n in troopships. Nurses & officers fraternise a little more oftener than when they first came on board and it is highly amusing to watch a couple of lovebirds billing & cooing. \n","12":"\n Our passage continues to be very smooth.\n\nA concert was given \n\nby our concert party last night. Unfortunately a strong wind blew up towards the commencement & and it was rather difficult to hear clearly. Space is so limited on board that it is hard to find a place really suitable for a platform where all can hear to any advantage.\n\nEducation classes have been commenced on board under the supervision of the Educational Officer. The boys are taking a great deal of interest in many things, he tells me, and his classes are well attended daily. \n\nA good assortment of \n\nreading books is in circulation amongst all on board and it is common to see groups lolling in the sun deeply engrossed in the pursuit of the girl by the villain. Many of the books are very instructional though. Every kind of book can be found in some digger’s hand. The Educational Officer is selling a select number of books of on all sorts of subjects. His stock is nearly run out. \nbut\n I have got in for four of them.\n\nSpinning Jinnies and the common game of House are easily the most\n\npopular forms of amusement on board amongst the diggers. Of course the two-up kings have their little game thought the game is not played nearly so promiscuously amongst these chaps as is generally the rule with a crowd of our men. We seem to have a specially select group of men. It is a pleasure to talk to any of them. Their language of course continues to be rather livid but it is a habit which is hard to drop.\n\n ","13":"\n The Mediterranean Sea has been as calm as a mill pond all day. We anchored at Port Said about 5.30pm. We \n\nare back once again to the land of sun, sand & flies.\n\nLong before we sighted Port Said the familiar neat triangle sails of the Jippy cadamanangs could be seen \nin\n dotted along the horizon.\n\nThe splendid break-water showed up clearly. Everybody was on deck to see whatever could be seen.\n\nThe town showed up at fist like a hazy white blob then as we drew nearer, distinct outlines of streets & buildings kept everybody’s eyes \nglued\n occupied trying to see more. We passed a very old warship which has been stationed in Australian waters.\n\nNext we passed an English family ship homeward bound with happy tourists with their wives & kiddies crowded along the gang ways waving and shouting. \n\nAn obsolete French destroyer next passed us looking like nothing on water.\n\nThe grand statue of De Lesseps we passed on our starboard side & I think everybody endeavoured to get a snapshot of it. Cameras were everywhere to be seen on the boat deck.\n\nAbout 10 minutes previous a tug came out to meet us and let the pilot on board. The pilot appears to be the only man worth a cent when a ship reaches port.\n\nBig posters common in every port next presented their advertisements to our eager gaze. As we are a ‘dry ship’ I heard many groans over the hoarding Ushers famous whiskies Liptons Tea etc.\n\nNo one was allowed off the ship but \nsome\n there are \nalso\n usually a number of chaps who cannot be kept on board and this proved to be no exception to the rule. About dusk two men worked their way hand over hand along the heavy mooring hawser to the canal bank. A number of others stripped themselves placed their clothing on life belts & pushed\n\ntheir clothing in front of them to the bank. They then dressed & darted off. The CO troops (Major Jacobs) as soon as he heard of the matter placed a strong patrol on the Canal bank and also ordered a boat patrol to prevent further escapes. \n\nHe also ordered strong guards to be placed all over the vessel to prevent attempts to escape.\n\nA good deal of difficulty was experienced in trying to get the men for duty in my company as most of them were by this time either in bed or already on duty. The fall in was sounded and a good deal of confusion resulted.\n\n \n\nA most unfortunate affair occurred between myself & my company commander Capt. Titford M.C. M.M. I was ordered to do the seemingly impossible and I \nreplied\n spoke (in a language quite unbecoming any officer), to Capt Titford. The unfortunate part of the business was that it occurred in front of the men. I consider that the happiest man in the world is the man who is on good terms with himself and I am glad to say that I have since apologised to my worthy O.C.\n","14":"\n Last night was the warmest night we have had since leaving England & the heat \ngrew\n became so intense during the forenoon today\n\n \n\nthat nearly everybody discarded their winter underwear. \n\nColonel McGleesh of the Light Horse with \nhis wife\n seven other Aust Light Horse officers joined us today for home together with two ladies.\n\nWe took a supply of meat & vegetables on board \nand\n this morning. The turnboat men did a roaring trade over the ships side \nthis\nfrom early morning \nand\n right up to the time of our departure.\n\nAt 2 p.m. our pilot having come on board we weighed anchor and steamed slowly past the Euripedes which \nhad\n came in about 6.30 A.M. & anchored just \n\n \n\nahead of us. She was carrying big crowd of our boys & nurses who crowded to the sides of the ship to see us off. The Euripedes is a much faster boat than ours and many remarks of a good natured variety were passed between both ships. Such \"We’ll get the flags out for you\". \"Have you any letters for us to take home for you\". Our band struck up \"Goodbyee\". \n\nOn our port we passed a huge native camp, the occupants of which rushed to the bank & cheered & yelled wildly. They always have done it and I suppose they always will. They are a queer crowd.\n\nA little further along we passed a \nlittle\n tiny cemetery with its small wooden crosses so common in France. On the starboard side little of interest could be seen beyond the primitive horse drawn tram: and yet we all gazed and gazed. There is something very fascinating about this Egypt. What it is I cannot define & I have never struck a man yet who could. \n\nWe came to a huge dump of war materials of every description on the Port side about 5 p.m. It is considered by some (who think they know) to be the largest dump used in the war anywhere, but one of the Light Horsemen tells me \n\n \n\nthat there is a larger one at place called Ludd, hereabouts. A little further on we came to the bridge which Gen Allenby had built so as to run a line through from Alexandria to the front line. As the front advanced so the line was continued with the result that it is now possible to travel by train from Khartoum to Constantinople & any \nother\n part of Europe. This bridge represents a pretty piece of engineering.\n","15":"\n We are now well into the Red Sea. It looks like a myriad of a twinkling mirrors with sun streaming upon it..\n","16":"\n A very powerful head\n\n \n\nwind has sprung up. It is almost impossible to stand on the front of the boat deck at times. With the exception of a few daring ones the ladies never attempt it.\n","17":"\n We entered the Gulf of Aden this morning about 8 A.M. the wind has eased down a little.\n\nI completed the narrative of Pte Finlay a returned Prisoner of War from Germany. His experiences have been many & varied & make good reading.\n","18":"\n After about five days of heavy gales we have now almost absolute calm weather. Practically the only breeze there is, \n\n \n\nis that made by the ships way.\n\nThe \nweather\n temperature has risen considerably & most of us are beginning to feel the heat pretty badly.\n\nVery little of interest on board to break the monotony. The band always draws an appreciative audience. We have had one concert on board for the men so far but there is no indication of another one being promoted so far.\n\nWe have a Sports Officer & Sport Committee on board but they are apparently not a business firm.\n\n \n\nEven the sea seems to have conspired to defraud us of its usual interesting sights.\n\nOccasionally we run into a shoal of porpoises. Flying fish are to be seen skimming over the\nwater\n glassy sea at a terrific speed for such small fish.\n\nI often watch them to see how far they will fly. They usually only fly for a distance of a couple of hundred yards but occasionally a good performance is witnessed when four or five hundred yards is reached. They always rise into the air \nfor\n about \n\n \n\ntwo feet from the water just before plopping in again.\n\nI have not seen them any higher from the water than the \ncould\n length of their bodies with the exception as stated above. They touch the water with the tips of their tales & fins every little while whilst in the air; exactly for what reason I do not know.\n\nWe are now in the Indian Ocean.\n\nYesterday we passed several islands both to port & starboard & glasses & cameras came to light at once. Nobody seemed \n\n \n\nto know the names of them. Some said that it was the mainland of Africa, others said that it was Sacotra Island. I am inclined to think that it must have been the latter.\n\nThe sky is dotted with Cirrus & Cumulus clouds.\n","19":"\n After a hot night we steamed into a strong cool breeze and about 10 A.M. passed Minny Coy Island.\n\nAt 10.30 A.M. The breeze freshened into a gale though the sea still remained fairly smooth. Ahead of us the sky is black with stratus & cumulus clouds.\n\n \n\nAt 11A.M. the rain fell in sheets.\n","20":"\n We reached Colombo & dropped anchor in the harbour about 3.30p.m. Much speculation as to whether we will be allowed ashore or not.\n","21":" P.M. Instructions received from the shore authorities to the effect that all troops may go off our boat but that the town must be strongly picketed. \n","22":"\n All Companies fell in on their Parade decks at 7.30 A.M. Picket parties were told off & we \nwent\n filed on to barges. At 9.15 A.M. a small tug pulled the whole bulk of the 6 huge barges \n\n \n\nto the wharf & we lined up & marched up to the barracks. I was warned for duty \nat\n for 2 p.m. As it was then 10A.M. I didn’t have much time to look round & buy things at the same time. I decided to do the shopping. I went off with Lts Young Reynolds & McIntyre to the Galle Face Hotel in Rickshaws along a good asphalt road built along the sea beach.\n\nRickshaws with their dusky human beasts of burden were dashing about every where. \n\n \n\nWe parted with our natives at the hotel for a very small amount about half a rupee each (ninepence in English money). We had a cool drink each a splendid cup of tea with cakes\nand some\n bananas & paw-paws. This latter fruit I had never tasted before & I must say that with the lime & a little sugar they were very nice indeed.\n\nWe then wandered into a silk shop in the hotel premises. After being pestered with business cards & natives trying to cajole us into buying some\n\n \n\nstones & beads. We were instantly offered chairs by the native shopmen & asked in English what we would like to see. I was \nnot\n terribly keen to see anything but was highly amused at Mr Young (who travelled through these parts in pre war days). He asked for all sorts of silks to be shown him, priced them & talked about them for the best part of an hour. After having almost everything in the shop pulled down & handed to him for close inspection he wandered out without buying anything. \n\nJ. Ramsamy’s shop \n\n \n\nThere was method in his apparent madness though for arrived \nat\n back in the town \nhe\n we all strolled into another branch of Ramsamy’s business near the Bristol Hotel & he compared the prices of the same silken articles there before buying anything.\n\nWe entered jeweler’s shops, ‘milliners & men’s wear’ shops and several other places going from one to the other in Rickshaws. We always managed to have a small argument with the Rickshaw man about the fare but we invariably won or so imagined.\n\nWe went to the Grand Oriental Hotel for lunch & had a very good meal\n\nfor about 3.50 rupees each. We wandered around the town for a bit after lunch until we were due to report to the barracks for duty.\n\nEverybody seemed to be enjoying themselves a treat. Rickshaw after Rickshaw dashed past us, some on their way to the Cinnamon Gardens, some to Mount Leviniere others to Galle Face Hotel & many other places. All wore a broad smile & I think the natives enjoyed themselves equally as much as we did.\n\nThe Indian strikes me as being a much \n\n \n\nbetter businessman than the Egyptian. You can have an interesting bargain with the Indian & finally get \"the goods\" whereas you would probably end up with a much more inferior article with the Jippy after a very tame piece of bargaining. Of course one wants to know a little bit about the values & prices of silk & other cloth materials generally before buying on a big scale. I only bought what I required and felt quite satisfied with my purchases which is the main\n\n \n\nthing.\n\nI was unfortunate in having to go on duty at 2 P.M. as it spoilt the day for us. We were unable to go outside of town hardly as by the time we had finished our shopping & had lunch it was time to go on duty.\n\nI was told off to take charge of a Piquet on No 2 Post & Lieut \"Brolga\" Brett put the lot of us (myself and 8 men) in Rickshaws & took us to our duties. We came first of all to No 1 Post which was on the first bridge along the sea front road \n\n \n\nleading out of the town towards the Galle Face Hotel. Here the line of Rickshaws were stopped and Lt. Brett got out to post the men & issued instructions in a royal manner. A great deal of jabbering then commenced from the natives who hadn’t been paid so he gave them 25 cents each and \"Imsheed\" them all except the number required to take myself & my party along to No.2 post. Away we raced with Brolga leading shouting out to his Rickshaw man to go faster & threatening horrible penalties to come with his stick if he did\n\n \n\nnot. He continually shouted out words in Egyptian and French in a fluent manner and from the waving of his hand I could see that he was trying to direct the native where to take us to.\n\nWe got into a blind alley finally at the end of which the native put his shafts down &am \nasked\n with one hand to his head asked for a payment. He was immediately assailed with a string of pure Australian from Brolga who had by this time dismounted and ordered us all to do.\n\n \n\nHe then ordered the natives to pull their rickshaws off the stone barricade & on to a path which was studded at intervals with blocks of stone in the centre.\n\nAgain the natives demurred & again Brolga burst forth into a torrent of abuse which had its effect. We were now quite near a bridge or a main road on which we could see a group of Aust soldiers & a number of natives gathered greatly interested in this sudden appearance of a string of rickshaws being pulled over this forbidden ground.\n\n \n\nBut this was not the piquet which we were after and after a little peering round we spied it perched on a railway bridge across the canal about 400 yards away. But to get there we had to get down a very steep flight of stone steps on an embankment. Brolga told the natives that if they didn’t like to follow us with the Rickshaws they would get no pay. This was very hard on the natives of course but the whole thing was too humorous to explain. It was the \n\n \n\nlast straw for them. Some of them fled back to town for fear they would be made to go over still more impossible ground & and still receive no pay. Others stood & looked at us in a very miserable manner. Brolga didn’t urge them to come down this bit of ground I am pleased to say & presently my man ran up to me & salaaming asked for his pay which I promptly gave him. Having posted us Brolga left us. I cannot even now understand why an officer should have been told off to take\n\n \n\ncharge of a piquet of four men. I have never heard of such rot in my life before. It was a broiling afternoon. I could feel the heat gnawing its way to my very inside & I was one continual lather. I was told that we would be inspected at 4.30pm but nobody came along so I wandered up to the barracks about 5pm to find out what was doing & I met Brolga dashing along on a rickshaw he yelled out that my piquet was recalled & that I had better trot along to the boat so \n\n \n\nI sent a man down to \nmy\n where I had left my piquet to make sure of their being recalled, got in a rickshaw & went down to the wharf. I then jumped into a rowing boat with some of our N.C.Os & away we went for the Derbyshire with the tug pulling along her ungainly barges full of our chaps just in rear of us. I put my parcels down in the cabin & dashed up on deck to watch the others coming in. Some queer sights were seen. Although liquor was cut out for the men, officially, they \n\n \n\nseemed to have got equally as much as if no restriction were placed on \nthem\n it. One man jumped overboard from the launch in the middle of the harbour & refused to be helped on board for some time. He just swam around & enjoyed himself until the launch turned round for him. Another chap \"thredded\" into the sea parcels & all as he was about to put his foot on the gangway of the old ship. Two men came on board in a complete suit of silk civilian clothing \n\n \n\nand their uniforms done up in a bundle under their arms. They had had a very good day apparently. So far as we know at present everybody came on board except one man who holds receipts for £50 part of which belongs to another man who is on board.\n\nThe behaviour of the boys was the best I have ever seen anywhere, due entirely to their own self-respect & their own common sense & not to any efforts on the part of the officers to keep order or any \n\n \n\nMilitary Regulations. One man had to be helped on board by his mates but no trouble whatsoever was caused to anyone in Colombo & no disturbances occurred amongst themselves except a small tiff which ended in a couple of good blows in the barracks & was stopped by Capt. Titford.\n\nWe have set a good example for the next crowd to pass this way.\n\nColombo is a very pretty place & is well worth a visit by anyone who can appreciate oriental mannerisms, & are not \n\n \n\nafraid of \na little\n heat. The hotels are very large & airy & the services are all good. The tram service is not an extensive one so far as I could judge but it serves all that is required. The country round about is very pretty & cool. It is well irrigated. The main streets of Colombo are wide and very clean. The natives are all exceedingly respectful to the white man & are not afraid of work. They are extremely well built as a rule: lithe & muscular. They wear as few clothes\n\n \n\nas possible and are as glossy & black almost as it is possible to be. I cannot understand how they stand the tremendous heat without a hat though. The business class of native for the most part wear European attire but most of the silk & carpet shopmen wear their Oriental costume.\n","23":"\n The natives finished coaling our ship last night and we pulled out of the harbour bound for Aussie about 2A.M. this morning.\n\nWe have a new black crew aboard, rather \n\n \n\na trial too if the language of the chief mate & the Chief Engineer is anything to judge by.\n\nThe ship \nhas\n only \n doing\n did about 7 knots a hour this morning due to bad coal and inexperienced firemen.\n\nBut she picked up her old speed of 13 knots this afternoon. \n\nThis afternoon was the balmiest we have had since leaving England. Everybody slept or lolled around on deck too tired to move hardly. If only I could have found a few tin cans I should have been delighted to \nhave\n\n \n\nmake a large noise & worry them into some sort of activity.\n\nThe best bit of excitement we have had occurred about 6.30 p.m.\n\nWe had just finished a bun-fighting competition on the forward well deck & were looking forward to a concert at 8 P.M. when the cry of man overboard was heard. Lt Ahern rushed straight up to the bridge where he found the Captain & told him that the man had fallen over from the starboard side at same time throwing a life buoy overboard. The Captain immediately rang\n\n \n\nto have the starboard engine stopped so that the man would not be caught in the propellers. He then had the ship turned around & the engine stopped in a very small space. It was a smart piece of work. A boat was lowered in a very seamanlike manner with the second mate & some of the black crew in it. It was quite dark \nby\n at this time & as the man in the water made no sign of his whereabouts it was \nvery hard\n impossible for them to see anything or anybody except a few lifebuoys\n\n \n\nwhose lights were flaring. Mr Peters the fourth officer also jumped into a boat \nto see if he\n on the Captain’s orders & with some more of the black crew was lowering away when Major Steele one of the doctors on board jumped in also.\n\nBoth boats were pulled around for a long time but no sign of the man could be seen anywhere. The fourth officer when passing the second officers boat asked \nif\n what he thought of the show & the second in his characteristic abrupt \n\n \n\nmanner replied \"Sharks\". Suddenly somebody shouted out \"There he is\" and Mr Ahern again threw a lifebuoy to the spot indicated. But the man seemed \nto\n not to need assistance for he caught hold of a rope at the boat’s side & was hauled aboard & carried to the bridge. The ship’s doctor was called for, but his services were not required for the Captain revived \nthe\n him with hefty lam in the ribs with his boots. It is the \nusual\n custom to treat natives in this way but up till now we all\n\n \n\nthought the man overboard was a digger. That was why Major Steele rushed in the boat & got his lovely white Colombo suit spoilt with salt water & other matter from the ships bowels. He said that he thought perhaps he would be able to do a lot for him in the way of artificial respiration if he were drowning. \n\nMr Peters also said that had he known it only a nigger he would probably not have been so alert. Certainly he would have taken care to cast off the \n\n \n\npainter from his boat before pulling out from the ship’s side. As it was his oarsmen were trying to \npull\n tow SS Derbyshire behind a rowing boat. But the skippers roar soon reminded him of his amissness. \n\nBoth boat crews were disgusted at having to pull around after what they thought was a white man then to find that the man \nwas\n had got aboard without their assistance & last but by no means least to find that the victim was a nigger.\n\nThe chief engineer \n\n \n\ntells me that the natives often jump into the water when they get overheated. It must have been very hot indeed in the engine room yesterday as it was bad enough on deck.\n","24":"\n We have been looking forward to a deal of fun whilst crossing the line but it has gone off very quietly principally I suppose because of the fact that we have all been across before with the exception of the Ship’s doctor. This poor beggar had the wind up a treat as it was rumour- \n\n \n\nred that he was to receive a special treatment for this crossing the line disease. Very little happened to him though. He only had a syringe full of water squirted into his cabin by Major Steele and a dixie of cold tea emptied in through the porthole by the diggers because they had been disturbed \nfrom\n in their sleep.\n\nVery little happens to raise the welkin on board. Pillow fights between the officers & nurses are of daily occurrence though of short duration. They nearly end in the route of the mere\n\n \n\nman because umpteen nurses appear on the scene as reinforcements with other weapons besides pillows.\n\nBrownie of the Light Horse is always well in amongst these rows. He takes delight in aggravating people when they least wish to be worried. \n\nDeck Quoits are in full swing today again. Major Steele had a game today with Major Clowes & a couple of others at which roars of laughter were to be frequently heard. The mirth became so great that everybody began to get a bit suspicious \n\n \n\nLt Cochrane had been discovered walking around the deck this morning quite oblivious of the fact that a large notice had been pinned to his coat tail bearing the inscription SUNDAY SERVICE. It was no wonder then that people began to get \na bit\n uneasy this afternoon. After a while they began to feel their coat tails & Major Steele had the good luck to find the mirth provoking notice firmly fixed in his stern sheets.\n","25":"\n It rained & blew hard about midnight last night. Very few of us went \n\n \n\nto \nwent\n bed until very late as practical joking is rife on board amongst the officers.\n\nOne chap on board who is known as the \"nurse\" \nor Native\n has been tackled several times but each time foiled his opponents until \nto\n last night when he found his pyjamas beautifully knotted. The only thing which sort of damped the feelings of myself and Lieut. Anderson was the fact that we being cabin mates of the \n\n \n\n\"Nurse\" and the jokers not knowing exactly which \ncabin\n bed the \"Nurse\" slept in, knotted every pair of pyjamas in the cabin & we had to spend about an hour untying them. The first person to catch a Fools Day’s joke was the Ship’s Master, Captain Adamson. He trotted around for a while with the notice \"1st April\" pinned to his coat tail. The crowning joke of all though was played on the \"Nurse\".\n\nAt 11 o’clock Capt. Titford called a meeting of C. Coy Officers in the smokeroom & after telling us something which we already knew, we sauntered out.\n\n \n\nThe \"Nurse\" who is on our Coy. for once did not expect trouble, \nbut\n & before \nwe\n he knew where he was, he was seized by five pairs of powerful hands and held whilst a couple of others dressed him up in a nurse’s costume & blackened his face. A notice \"Native Ayah\" was then pinned to his blouse & he was carried around the boat deck to the delight of hosts of diggers & the remainder of the officers.\n\nIt was a most humiliating affair but it was well merited.\n\n \n","26":"\n Instructions received from the Defence Department to the effect that we are to go to Fremantle where we will discharge all Western Australian troops & coal.\n","27":"\n Later instructions from Defence Dept. cancel our proceeding to Fremantle & order us to proceed to Albany. The Western Australian people on board are very much annoyed about it.\n","28":"\n The first bit of Australia was seen this morning about 6 o’clock. I saw it about 7 o’clock. We passed Cape Leeuwin about 11 o’clock.\n\n \n","29":"\n Fine beautiful day, calm sea.\n\nWe entered Albany Harbour about 8 A.M.\n\nNo tug boat came out to meet us here, no pilot came aboard to steer us in. Instead a neat little launch met us just outside the entrance. A man stood up & shouted out to our Captain: \"I can’t come aboard sir. Will you follow me in slowly?\" As we entered, the yellow flag was run up to the top of the forward masthead. The entrance \nwas\n is a narrow one. We made a big turn to the right & saw Albany \nto\n perched on the side of the low hills in a huge arm or \n\n \n\nbay of the harbour. We did not go alongside the pier & nobody on shore appeared to know that we had arrived. No motor launches \nor\n, rowing boats or sailing ships were flitting about. The place might have been quite deserted for all we could tell. Only two other steamers could be discerned in the harbour. One of these The Berrima came in about an hour after we had cast anchor, also from England with homeward bound Aussies. Not a speck of smoke even could be seen rising up from the town houses. Never have I seen a sleepier or more quiet\n\n \n\nseaport town. The harbour is a well sheltered one with numerous graceful indentations along the edge. Short scrubby bushes appeared to be growing over the hills in various shades of brown & greens with not a sheep, horse or other animal to lend life to the place. In fact the scene was considerably marred by a number of white bell tents which had been erected on our port side \nas we entered\n & on the opposite side of the harbour to that of the town as a quarantine camp. They were pitched almost at the waters edge in an enclosed area. Behind them were \n\n \n\nseveral red painted bungalows also part of the quarantine camp apparently. A number of soldiers could be seen there who \nhad\n arrived yesterday from England. Very little beach could be seen along the shore, although I have been told \nsince\n that a very fine beach exists some where here.\n\nSoon after we arrived a couple of coal hulks were towed on either side of us and made fast. Preparations for coaling ship have been very interesting in all the Eastern ports & of course everybody watched our own Australian method equally as \n\n \n\neagerly. But we were sadly disappointed. The sleepiness of the place seemed to have settled on these fellows in fact they gave one the idea that they might at any minute down tools & sit down. \nBut the trouble was\n Twelve o’clock had struck & the men knocked off for dinner having made no progress whatsoever in their preparations for coaling ship. At one o’clock they resumed operations & we were able to see the cause of the delay. This ship has been built for eastern trading & the coal holes have been \n\n \n\nbuilt to fit in with the eastern method of filling. The method adopted here was that of erecting a long trolley line reaching from above the hold of the coal hulk to the \nthe\n coal holes of the ship, then hoisting the coal up in baskets (each holding 7cwts) to the trolley when it was wheeled to the coal holes along the line & the coal tipped in. The holes are so small however that most of the first basket full found a bunker in the harbour so this idea had to be abandoned & another plan formulated. The chief officer now came \n\n \n\nto the rescue & ordered the \ncovers of the\n hatchway amidships to be opened & the trolley lines on either side run to it. After much shouting from the coalers & jeering from the boys on board the lines were arranged satisfactorily & coaling began at 2 \n.30\n P.M. A great cheer went up from the boys when the first basket full was tipped in. But the coalers were not \nnot","30":" slow now. They were different men altogether & they worked as if they were determined that the good name of the \n\n \n\nAustralian waterside Workers would be vindicated & they certainly succeeded. \nFive\n Nine men working on each hulk (six men filling, one man on the winch & two on the trolley & basket above, tipped coal into the old Derbyshire at the rate of about 2 ½ tons to the minute. At six o’clock they knocked off again for tea.\n\nDuring this time the health officer had held a long conversation with the ships captain O.C troops (Major Jacobs) & the adjutant (Captain Rossiter) at the foot of the gangway.\n\n \n\nA medical officer came on board & inspected the hands & arms of everybody on board to satisfy himself that no small pox existed on board. Despite the fact that we have so far a very clean health bill it was reported in the W.A \nnewspaper\n Times that a case of small pox had broken out on our boat soon after leaving Colombo.\n\nAfter an exasperatingly long wait in the sun the Western Australians, two nurses & five others were allowed off. They have to do three days in quaran- \n\n \n\ntine before being allowed to go to their homes. Had there been any cases of flu or smallpox on board they would have been required to do a week in quarantine.\n\nThis procedure is being adopted at every port at which we are to call so that the glamour of homecoming will be slightly blurred for all concerned. Still it is a very necessary step as deaths are still occurring from flu in Melbourne, Sydney and Adelaide and at a dangerous rate though of course the death rate has not nearly attained the height of \n\n \n\nflu casualties in \nEngl\n Europe. Interstate traffic between N.S.W. & Queensland has been closed for an indefinite period and another innoculation campaign has been decided upon for Sydney.\n\nAll possible precautions are being taken against an increase in flu cases throughout Australia.\n","31":"\n We are having very good weather in the Bight. A long lazy swell causes the ship to rock pleasantly like a baby’s cradle.\n","32":" I awoke this morning about 7 o’clock and stared out of my cabin porthole.\n\nWe had stolen into Port \n\n \n\nAdelaide during the night and the first sight to meet my eyes was the graceful peak of Mount Lofty the famous pleasure resort \njust behind the\n about seven miles beyond Port Adelaide. Adelaide itself \nwas\n is not discernable from the ship.\n\nThe River enters the sea just the other side of the Mail Boat Jetty.\n\nAbout 10.30 A.M a steam launch came alongside with the Health Officer and a naval officer who was heard to say to the Ship’s Captain that we proceeded direct to Melbourne \n\n \n\nafter taking on 400 tons of coal and that we would not as at first ordered proceed to Hobart. This news spread all over the ship like wildfire & telegrams to this effect were sent off by most of the Victorians.\n\nAt 11 o’clock two coal hulks which had been towed alongside began pitching dust about.\n\nAt 1 P.M. sharp all the South Australians left the ship for \nsome\n quarantine prior to being allowed home. Their farewell was a sober one. They were pleased of course & \n\n \n\na few jests were passed between their launch & our ship as they steamed off but no wild hilarity marked their departure. We might be leaving home instead of going home if only manners & faces were to be judged by.\n\nThis quarantine business is having a marked effect on the spirits of all on board.\n\nA notice was issued to all on board that people going to Sydney would not be quarantined at Sydney provided our health list remains on the same level. \n\nAt 1.30 P.M. word went\n\n \n\nround that we have to call at Hobart before Melbourne after all. Much groaning from the Victorians as a result.\n\nPapers were sent on board this morning & they were eagerly sought after by all. The flu epidemic comes in for a lot of consideration in the columns of The Register. Mr Kidman the cattle king prophesies a higher price for meat. Victoria has launched its first big steamer. Sydney has adopted an improved method of dealing with meat supplies & that is about all the news which interests me at present. \n\n \n\nWrangling still goes on in Russia, Austria, Germany & some of the Balkan states on a fairly large scale & the Peace Conference crowd seems to be pushing ahead \"better no faster\".\n","33":"\n A placard containing the names of all officers nurses & passengers on board was presented to the Ships Captain tonight. Major Jacobs made the presentation after a lengthy speech full of disjointed statements. I have never heard such a sickening effort at speechmaking. \n\nThe skipper replied \n\n \n\nin characteristic terse style of the \nnavy\n British manner.\n","34":"\n We steamed up Doncaster Channel in Tasmania about 3 P.M. & anchored in Barnes’ Bay.\n\nWe passed a queer little lighthouse on our starboard side called Ironpot Lighthouse. The quarantine station could be seen tucked away in a little nook near the mouth of the Derwent River. We discharged the Tasmanians about 45 in all pushed off again about 4 P.M. The little we have seen of Tasmania & the waterway has impressed me very much.\n\n \n\nThe coast is rugged but vegetation of a big variety grows right down to the waters edge. We saw very little of the dwelling places but a Sergt Major on one occasion drew a lot of attention by shouting out that he was able to see his home & spent a great deal of time pointing it out to his mates.\n","35":"\n \narrived at\n.Entered Port Philip Heads early this morning & anchored off Point Nepean opposite the quarantine station. This station is the best situated of any we have seen yet.\n\nThe usual formalities\n\n \n\nhaving been gone through\nthe\n with the Health Officer the Victorians to the tune of about 400 were discharged about 10 A.M. Very few officers & nurses are left on board now. A tremendous lot of handshaking had to be gone through before they all got away.\n\nAt 11.30 A.M. we were on the move once more & passed through the heads amongst the myriad of whirlpools & jelly fish at 12 noon.\n","36":"\n Had a good game of bridge with the Ship’s Captain (Captain Adamson) Brolga Brett & Capt Rossiter. We played for 6d 100 points \n\n \n\n& I managed to get a shilling out of the Captain. He is the best bridge player I have ever seen though & I am inclined to think that he let me off lightly.\n","37":"\n Sydney heads at 6 A.M. we anchored just inside the heads. Ferries from Manly & Circular Quay are dashing by all the time. The quarantine station is just across at the North Head & looks anything but homely. All the people on the ferries are wearing masks as a protection against the flu.\n\nWe do not know yet\n\n \n\nhow long we are to be quarantined for or even if we have to be quarantined at all. It is now 9.30am & nobody has been across to look at us even, let alone give any orders.\n","38":" A.M.\n A tremendously big shapeless human form known as the Health Officer has arrived to see us at last. He was greeted with loud cheers by the boys for having taken the trouble to look us up at all. He inspected everybody & then gave us the glad news that we would be kept in quarantine on board here for seven days. \n\n \n\nThis immediately put everybody in a fearfully bad humour & I received some of the backwash of the flood of indignation from the men when I went below to examine their food. They were nearly as savage as I was. From our anchorage here we can see the Manly ferries dashing to & fro with their loads of summer\nclad\n dress clad trippers waving & yelling. At various periods all day until late at night boats containing relatives of chaps on board came along & created a bit of a diversion for the fed up troops.\n\nManly. Rose Bay. Mossman\n\n \n\nMiddle Head, \nThe\n Heads & Circular Quay (in the distance can be seen.\n","39":"\n The men have given a good deal of trouble during the last few days on account of our being quarantined with no apparent reason. However this afternoon the quarantine boat came alongside & told us that we are to disembark tomorrow about 2 p.m. This put everybody in a good mood almost immediately.\n","40":"\n Landed from SS Derbyshire at Wooloomooloo Wharf about 3 P.M. Driven to Anzac Buffet. Met Clare Flo. Arthur Harold Dorrie and Clarrie. Driven \nin state\n to Hal’s home & given a royal welcome. \nThe day\n had arrived after \n\nfour\n over four years & a half of slush & slaughter.\n\nHere endeth the eventful period of my \n\nlife I hope.\n \n\n \n\n"}}