{"Document Name":{"0":"Diary_0080","1":"Diary_0080","2":"Diary_0080","3":"Diary_0080","4":"Diary_0080","5":"Diary_0080","6":"Diary_0080","7":"Diary_0080","8":"Diary_0080","9":"Diary_0080","10":"Diary_0080","11":"Diary_0080","12":"Diary_0080","13":"Diary_0080","14":"Diary_0080","15":"Diary_0080","16":"Diary_0080","17":"Diary_0080","18":"Diary_0080","19":"Diary_0080","20":"Diary_0080","21":"Diary_0080","22":"Diary_0080","23":"Diary_0080","24":"Diary_0080","25":"Diary_0080","26":"Diary_0080","27":"Diary_0080","28":"Diary_0080","29":"Diary_0080","30":"Diary_0080","31":"Diary_0080","32":"Diary_0080","33":"Diary_0080","34":"Diary_0080","35":"Diary_0080","36":"Diary_0080","37":"Diary_0080","38":"Diary_0080","39":"Diary_0080","40":"Diary_0080","41":"Diary_0080","42":"Diary_0080","43":"Diary_0080","44":"Diary_0080","45":"Diary_0080","46":"Diary_0080","47":"Diary_0080","48":"Diary_0080","49":"Diary_0080","50":"Diary_0080","51":"Diary_0080","52":"Diary_0080","53":"Diary_0080","54":"Diary_0080","55":"Diary_0080","56":"Diary_0080","57":"Diary_0080","58":"Diary_0080","59":"Diary_0080","60":"Diary_0080","61":"Diary_0080","62":"Diary_0080","63":"Diary_0080","64":"Diary_0080","65":"Diary_0080","66":"Diary_0080","67":"Diary_0080","68":"Diary_0080","69":"Diary_0080","70":"Diary_0080","71":"Diary_0080","72":"Diary_0080","73":"Diary_0080","74":"Diary_0080","75":"Diary_0080","76":"Diary_0080","77":"Diary_0080","78":"Diary_0080","79":"Diary_0080","80":"Diary_0080","81":"Diary_0080","82":"Diary_0080","83":"Diary_0080","84":"Diary_0080","85":"Diary_0080","86":"Diary_0080","87":"Diary_0080","88":"Diary_0080","89":"Diary_0080","90":"Diary_0080","91":"Diary_0080","92":"Diary_0080","93":"Diary_0080","94":"Diary_0080","95":"Diary_0080","96":"Diary_0080","97":"Diary_0080","98":"Diary_0080","99":"Diary_0080","100":"Diary_0080","101":"Diary_0080","102":"Diary_0080","103":"Diary_0080","104":"Diary_0080","105":"Diary_0080","106":"Diary_0080","107":"Diary_0080","108":"Diary_0080","109":"Diary_0080","110":"Diary_0080","111":"Diary_0080","112":"Diary_0080","113":"Diary_0080","114":"Diary_0080","115":"Diary_0080","116":"Diary_0080","117":"Diary_0080","118":"Diary_0080","119":"Diary_0080","120":"Diary_0080","121":"Diary_0080","122":"Diary_0080","123":"Diary_0080","124":"Diary_0080","125":"Diary_0080","126":"Diary_0080","127":"Diary_0080","128":"Diary_0080","129":"Diary_0080","130":"Diary_0080","131":"Diary_0080","132":"Diary_0080","133":"Diary_0080","134":"Diary_0080","135":"Diary_0080","136":"Diary_0080","137":"Diary_0080","138":"Diary_0080","139":"Diary_0080","140":"Diary_0080","141":"Diary_0080","142":"Diary_0080","143":"Diary_0080","144":"Diary_0080","145":"Diary_0080","146":"Diary_0080","147":"Diary_0080","148":"Diary_0080","149":"Diary_0080","150":"Diary_0080","151":"Diary_0080","152":"Diary_0080","153":"Diary_0080","154":"Diary_0080","155":"Diary_0080","156":"Diary_0080","157":"Diary_0080","158":"Diary_0080","159":"Diary_0080","160":"Diary_0080","161":"Diary_0080","162":"Diary_0080","163":"Diary_0080","164":"Diary_0080","165":"Diary_0080","166":"Diary_0080","167":"Diary_0080","168":"Diary_0080","169":"Diary_0080","170":"Diary_0080","171":"Diary_0080","172":"Diary_0080","173":"Diary_0080","174":"Diary_0080","175":"Diary_0080","176":"Diary_0080","177":"Diary_0080","178":"Diary_0080","179":"Diary_0080","180":"Diary_0080","181":"Diary_0080","182":"Diary_0080","183":"Diary_0080","184":"Diary_0080","185":"Diary_0080","186":"Diary_0080","187":"Diary_0080","188":"Diary_0080","189":"Diary_0080","190":"Diary_0080","191":"Diary_0080","192":"Diary_0080","193":"Diary_0080","194":"Diary_0080","195":"Diary_0080","196":"Diary_0080","197":"Diary_0080","198":"Diary_0080","199":"Diary_0080","200":"Diary_0080","201":"Diary_0080","202":"Diary_0080","203":"Diary_0080","204":"Diary_0080","205":"Diary_0080","206":"Diary_0080","207":"Diary_0080","208":"Diary_0080","209":"Diary_0080","210":"Diary_0080","211":"Diary_0080","212":"Diary_0080","213":"Diary_0080","214":"Diary_0080","215":"Diary_0080","216":"Diary_0080","217":"Diary_0080","218":"Diary_0080","219":"Diary_0080","220":"Diary_0080","221":"Diary_0080","222":"Diary_0080","223":"Diary_0080","224":"Diary_0080","225":"Diary_0080","226":"Diary_0080","227":"Diary_0080","228":"Diary_0080","229":"Diary_0080","230":"Diary_0080","231":"Diary_0080","232":"Diary_0080","233":"Diary_0080","234":"Diary_0080","235":"Diary_0080","236":"Diary_0080","237":"Diary_0080","238":"Diary_0080","239":"Diary_0080","240":"Diary_0080","241":"Diary_0080","242":"Diary_0080","243":"Diary_0080","244":"Diary_0080","245":"Diary_0080","246":"Diary_0080","247":"Diary_0080","248":"Diary_0080","249":"Diary_0080","250":"Diary_0080","251":"Diary_0080","252":"Diary_0080","253":"Diary_0080","254":"Diary_0080","255":"Diary_0080"},"Date":{"0":"unknown","1":1023.0,"2":1024.0,"3":1025.0,"4":1026.0,"5":1027.0,"6":1028.0,"7":1029.0,"8":1030.0,"9":1031.0,"10":1032.0,"11":1033.0,"12":1034.0,"13":1035.0,"14":1036.0,"15":1037.0,"16":1038.0,"17":1039.0,"18":1040.0,"19":1041.0,"20":1042.0,"21":1043.0,"22":1044.0,"23":1045.0,"24":1046.0,"25":1047.0,"26":1048.0,"27":1049.0,"28":1050.0,"29":1051.0,"30":1052.0,"31":1053.0,"32":1054.0,"33":1055.0,"34":1056.0,"35":1057.0,"36":1058.0,"37":1059.0,"38":1060.0,"39":1061.0,"40":1062.0,"41":1063.0,"42":1064.0,"43":1065.0,"44":1066.0,"45":1067.0,"46":1068.0,"47":1069.0,"48":1070.0,"49":1071.0,"50":1072.0,"51":1073.0,"52":1074.0,"53":1075.0,"54":1076.0,"55":1077.0,"56":1078.0,"57":1079.0,"58":1080.0,"59":1081.0,"60":1082.0,"61":1083.0,"62":1085.0,"63":1086.0,"64":1087.0,"65":1088.0,"66":1089.0,"67":1090.0,"68":1091.0,"69":1092.0,"70":1093.0,"71":1094.0,"72":1095.0,"73":1096.0,"74":1097.0,"75":1098.0,"76":1099.0,"77":1100.0,"78":1101.0,"79":1102.0,"80":1103.0,"81":1104.0,"82":1107.0,"83":1108.0,"84":1109.0,"85":1110.0,"86":1111.0,"87":1112.0,"88":1113.0,"89":1114.0,"90":1115.0,"91":1116.0,"92":1117.0,"93":1118.0,"94":1129.0,"95":1130.0,"96":1131.0,"97":1132.0,"98":1133.0,"99":1134.0,"100":1135.0,"101":1146.0,"102":1147.0,"103":1148.0,"104":1149.0,"105":1150.0,"106":1151.0,"107":1152.0,"108":1153.0,"109":1154.0,"110":1155.0,"111":1156.0,"112":1157.0,"113":1158.0,"114":1159.0,"115":1160.0,"116":1161.0,"117":1162.0,"118":1163.0,"119":1164.0,"120":1165.0,"121":1166.0,"122":1167.0,"123":1168.0,"124":1169.0,"125":1170.0,"126":1171.0,"127":1172.0,"128":1173.0,"129":1174.0,"130":1175.0,"131":1178.0,"132":1179.0,"133":1180.0,"134":1181.0,"135":1182.0,"136":1183.0,"137":1184.0,"138":1185.0,"139":1186.0,"140":1187.0,"141":1188.0,"142":1189.0,"143":1190.0,"144":1191.0,"145":1192.0,"146":1193.0,"147":1194.0,"148":1195.0,"149":1196.0,"150":1197.0,"151":1198.0,"152":1199.0,"153":1200.0,"154":1201.0,"155":1202.0,"156":1203.0,"157":1204.0,"158":1205.0,"159":1206.0,"160":1207.0,"161":1208.0,"162":1209.0,"163":1210.0,"164":1211.0,"165":1212.0,"166":1213.0,"167":1214.0,"168":1215.0,"169":1216.0,"170":1217.0,"171":1218.0,"172":1219.0,"173":1220.0,"174":1221.0,"175":1222.0,"176":1223.0,"177":1224.0,"178":1225.0,"179":1226.0,"180":1227.0,"181":1228.0,"182":1229.0,"183":1230.0,"184":1231.0,"185":1232.0,"186":1233.0,"187":1234.0,"188":1235.0,"189":1236.0,"190":1237.0,"191":1238.0,"192":1240.0,"193":1241.0,"194":1242.0,"195":1243.0,"196":1244.0,"197":1245.0,"198":1246.0,"199":1247.0,"200":1248.0,"201":1249.0,"202":1250.0,"203":1251.0,"204":1252.0,"205":1253.0,"206":1254.0,"207":1255.0,"208":1256.0,"209":1257.0,"210":1258.0,"211":1259.0,"212":1260.0,"213":1261.0,"214":1262.0,"215":1263.0,"216":1264.0,"217":1265.0,"218":1266.0,"219":1267.0,"220":1268.0,"221":1269.0,"222":1270.0,"223":1271.0,"224":1272.0,"225":1273.0,"226":1274.0,"227":1275.0,"228":1285.0,"229":1286.0,"230":1287.0,"231":1288.0,"232":1289.0,"233":1291.0,"234":1292.0,"235":1293.0,"236":1294.0,"237":1296.0,"238":1297.0,"239":1298.0,"240":1299.0,"241":1300.0,"242":1302.0,"243":1303.0,"244":1304.0,"245":1305.0,"246":1306.0,"247":1307.0,"248":1308.0,"249":1315.0,"250":1316.0,"251":1317.0,"252":1318.0,"253":1319.0,"254":1322.0,"255":1323.0},"Entry":{"0":"\n\n1916 ","1":"\n\nGot up. 7 oclock roll call had breakfast after went near Steenvorde Church parade Brigade here new reinfcts with Battn went picking cherries with Jim . turned in fairly early still holding\n","2":"\n\nGot up and went physical jerks afterwards went out Bayonet drill came in raining lectures rest of day Shepherd still here Fokestone on home leave heard from Uncle had a read and turned in still at Godesveldt.\n","3":"\n\ngot up Physical jerks afterwards went out came on to C Coy working Coy in evening on various drill done nothing much did not feel too good came in 2-5 Corp Salter spoke.\n","4":"\n\ngot up 6 & went Physical after break rained was going to have Battalion attack put off owing to rain after drill with box respirators had dinner afterwards half holiday had game pontoon & 500 wrote to Clarke HS C & A.H C turned in about 8 oclock.\n","5":"\n\ngot up had physical jerks and after breakfast had more drill after dinner had inspection by Foxton 2 blankets helmet & other stuff very wet weather signs of clearing up still at Godesversveldt turned in still holding few francs.\n\nPlatoon Sergt Dewhurst Corp Salter Jim Kalzow gone to 11 platn Lopez emerson me Hodges & Russia still here all new fellows.\n","6":"\n\nGot up for Phys jerks had nothing after break inspection by Shepherd & Foxton after good dinner moved to B Coy & then aff Battn band playing to Station got on train at Godesversveldt & went through Poperinghe to near Epres was billeted here had bit of sleep in barracks good bunks.\n","7":"\n\nGot up 2 oclock & went out fatigue on trenches had bit of breakfast and got up to trenches very slippery sliped a good many times see Hill 60 and work and villages heavy bombing very quiet here making and improving saps few bombs in evening came back about 12-30 through the town of old Epres 25th mount Sorrel\n","8":" \n\ngot up about 6 oclock had breakfast and went out on fatigue through Ypres to work on laying tram line to trenches afterwards at 4 oclock. had tea and turned in on board bed very comfortable fairly good few aeroplanes shuns searching for batteries \n","9":"\n\nGot up about 8 oclock and done nothing all day still good weather German shelling planes all day very quiet in front line see Cloth hall and other notable buildings of Epres town very bombarded see Zillebic lake a very big lake on fatigue at night fairly hard letter from Miss Isham transports at night trucks 7-10.\n","10":"\n\nfine weather\n\nGot up about 7-30 had breakfast and had a clean up and then went out to work in Epres collecting bricks after that came and had dinner after dinner had tea went off after tea no pay yet went and had another stroll through Epres see some more splendid buildings back at 8.30 went loading trains about 15 loads came back & turned in shelling old Church our planes up all day.\n","11":"\n\nGot up 7-30 fine day fairly good sleep had bacon bread & jam break after went on fatigue still on bricks for stables out Poperinge good easy job came back about 10 oclock still holding pay.\n","12":"\n\nThursday morning on fatigue from 2 - 12 came back on saps to billet had dinner and had bit of a sleep afterwards had tea went to Battalion Hdqrts as dinner went up near trenches turned in for the night fairly fine weather.\n","13":"\n\nIn morning went up to trenches A B & C a few times very hard shelling minnies and shell batteries\n\nSanctuary Wood machine guns and Zillebec very cold turned in at night.\n","14":"\n\nAfter fairly good sleep went up Brigade Hdqrts and to trenches shellings very heavy – Macready killed & Arnold wounded went up to trenches messages twice in evening very heavy shelling on our right a raid afterwards\n","15":"\n\nGot up late & went up to trenches very cold day balloons and aeroplanes up shelling light in morning on trenches on night duty runner Con Really still here not a tree not hit here in Ypres machine guns very heavy on plane and on Ypres roads to trenches.\n","16":"\n\nGot up after few despatches at night to all companies went to Brigade Hdqrts despatch had a good sleep shelling here fairly heavy raid by 27th got repulsed the huns Germans had a balloon up soon went down on guard at house very heavy shelling cold here no lights no tea and overcoat to cover a man at night.\n\n Watherspoon 4249 A Coy\n","17":"\n\nStill here at Hdqrts an old rotten farmhouse a light shell would knock the whole lot in pieces had a few runs to Davidson Street shelled me with shrapnel through Suanctuary Wood so had to go round to Vince Street went up twice to all companies at night raining hard got very wet turned in Sorrels Dump shelled.\n","18":"\n\nGot up about 11 oclock had breakfast and went up with Tommy officers up Vince Street through Wood to Winnepeg Street & St Peters St up to “D\" Coy & A Coy went back same way after light bombd of minnies after dinner went on guard guarding up to Hdqrts Fritz shelled 26th Hdqrts very heavy relieved at night by Northumberland Fusiliers and slept near Asylum 7& trained 4 oclock came to Goderwarsveldt.\n\n ","19":"\n\nAfter 4 oclock walked past Steenvorde accompt by band and walked to a farmhouse marching to about 12 oclock full pack up blanket fairly done up about 4 miles past Steenvorde after a bit of a meal of steak had a sleep and wrote notebook up raining hard turned in fairly early.\n","20":" got up fairly late and went to Steenvorde for a bath had a pen and c holder after bath fairly warm came back and had a look down. Had dinner in town after dinner voting on – conscription After that very cold no rain. Still here in farmhouse and had a letter from Miss Isham also paper turned in early Capt Donisch still here.\n","21":"\nGot up pretty early and started on route march passed through Steenvorde with band and went toward Cassel passed round Cassel and went about 10 mile for the day and was billeted in a fine old chateau of Joseph Duvett lived 103 years old fine gardens turned in in a very flash room.\n","22":"\nGot up early had bacon and resumed march that morning march 4 mile off St Omer billed again that night in a dirty old farm quite different from last night very strenuous marching & had job to find billets very quiet here diff from last Sunday at Epres very cold 2 blankets turned in fairly early.\n","23":"\n\nBilleted here all day at an Estaminet done nothing all day much nearly broke not bad weather fairly good tucker turned in early inspection by Capt Donisch of equipment rest of day to ourselves.\n","24":"\n\nShifted again very early after breakfast went through St Omer to Arques strenuous march leading transports on trains went on train local at Arques and had a long time in train about 9 or 10 oclock arrived at Saint Rigeur and had another strenuous march to Forenflot about 36 miles from Albert not bad marching but very tired turned in with bombers raid on an apple room Frenchie locked same\n\nTrained through Bolonge Sur Mer Etaples & Calais\n","25":"\n\nWet night got up late and had breakfast shifted billets to one near cooker Forenflot not bad town very quiet on our way to Somme again worse luck cleared up in evening no pay shortage of tucker stakes again wrote letters turned in very early good sleep\n","26":"\n\nStill in the villiage here very wet day got up late no tucker much 1 loaf 36 men not too good no pay yet raining hard all day transport proceeded again direction of Albert had stew for dinner done nothing all day tucker very poor and little it.\n","27":"\n\nGot up at about 4 am and got ready and had no breakfast owing to being in a hurry proceeded from Forenflot and went about 5 mile from here and got on French motor transports holding about 25 went through Amiens and St Saviour and got out at Derancourt few kls from Albert and stayed here at night in rotten old farm house poor tucker stakes.\n","28":"\n\nGot up at about 8 oclock went out not much of a place slightly bombarded stayed here all day very little tucker and not much doing feet inspection and kit inspection nothing else doing all day C. Coy paraded \nowing\n over iron rations wanted to charge us 1\/8 for tin of bully about 2 issues while we have been in France turned in farm barn open to wind and rain no pay yet heavy bomb at Albert.\n","29":" \nMonday\n Sunday Oct\n\nGot up late and about 9-30 went to Church parade very wet day Pator & Brigade Major at service after dinner very light tucker went and left Derancourt and went through Montauban and stopped near Fricourt wood turned in big German dugout had a feed and turned in 10th Battn here.\n","30":"\n\nGot up about 8 oclock and after breakfast went and stacked ammunition dump very wet weather very light day though heavy work plenty of traffic here cooked our own tucker got paid done nothing else in daytime got flooded out in dugout so turned in in tent had a fire very wet and muddy hearing bombardment right along line.\n","31":"\n\nGot up late had breakfast Hodge & Lone in cookhouse no ammunition loading in morning got a letter from Miss Jackson fine day lighter bombardment see King Georges hill from here also Mametz Fricourt very light day in morning went over to canteen in evening turned in early & went to bed Taube dropping bombs searchlights on him but too high up\n","32":"\n\nFine day got up and had breakfast did not feel too good Transport still going strong still very muddy getting better tucker Dodds & Hodge cooking\n\nLone went on Court Martial loading 60 lb HE & Shrap also bombs & fuses on\n\non tommies, Canadian & Australian Transports good days work 25 or so turned out after tea working up to 12 oclock plenty of work some tucker about the same made a fire & turned in fairly early.\n","33":"\n\nGot up about 8 oclock had breakfast and went on transport loading again plenty of work all day Prince of Wales Duke of Connaught & staff through today finer weather rains at night bombardment still fairly heavy am now writing diary and see Fricourt Wood lit up with Transport tents etc did not go on work here camped in a tent others camped in German dugout just by road leading to Montauban turned in fairly early.\n","34":"\n\nGot up about 8 30am & had breakfast and then went out on fatigue on 18 pound shells &","35":" shells loaded up wagons all the day fairly heavy work at it all day up to your knees in mud after dinner very light tucker went out again Germans bombd Fricourt Wood shelling near Ob balloon turned in early very cold 25th Battn moving up to line we C Coys still on fatigue. \n","36":"\n\nGot up again about 8 oclock & went loading up till about dinner time after heavy loading all the morning had rough dinner & moved up to Battn C Coy got to Battn about 4 o’clock & had tea Battn band playing afterwards the Battn moved up to line at 12 oclock very heavy walking walking for about 6 or 7 hours too late for 8-15 Charge Sunday morning went past Le Sars very muddy up to your thighs 6 hours in mud. \n","37":" carried bombs up to line to B Coy about 7-30 with Flecher very muddy about 830 severe bomb by us &\n\nlater ‘B’ Coy 25th C in supp & other Battn of 7th Brigade attacked & took two lines of trenches very muddy “C\" Coy carrying Trans \n\nA Coy in reserve shelling us in supports all day long B Coy heavy casualties Capt Wise killed & Gen Paton 7 Brigade severely wounded got rations up see 24th Battn one company shelled in evening few killed C Coy on fatigue all night Sergt Dewhurst killed & few others had no sleep shelling 9-2 ½ (Gen Paton died a few days after)\n\n6th Monday\n\nStill in supports & cold weather no blankets or overcoat not much fatigue still C Coy runner about 10 C Coy still shelling up pretty heavy B Coy cut practically to pieces got relieved at night by 6th Brigade see Bapaume Tower from here just as relieving Germans opened up shrapnel shells mess have something got out safe & moved down to camp very wet French sending up big flares etc Taube up got down to billets & went in fairly done up very tired & sick out plane up sending message for us to get under cover German observation balloons up.\n","38":"\n\nGot up and had breakfast very heavy rain had a good day of it glad to get warm tucker again band playing slept nearly all day still the batteries are pounding away did not go out much felt too tired and raining too hard got plenty of sleep Few up for court martial leaving trenches Macdonald came through all right (prisoner killed & few wounded had good night sleep\n","39":"\n\nGot up about 8 oclock after breakfast 17 men went on fatigue and the rest had rifle inspection rumors going about we were moving up again hope not. feeling bit better big mob went up to Doctor did not do too\n\nmuch in evening about 3-30 moved down to Mametz to Fricourt hut very muddy here Orderly Room Price evacuated and I took his place while away these huts very good and dry big 12 inch firing near here.\n","40":"\n\nAfter bad nights sleep diarrear got up fine day few runs up to Hdqrts C Coy got about 50 men getting better tucker 19 Battn moved out went on bath parade no clean clothes in evening went over to transports & got a new pair of boots very cold owing to having no new socks turned in early not feeling too good cold weather not agreeing with the Australian at all still very muddy here up to your knees ranks up here\n","41":"\n\nGot up late & had breakfast very bad with diarrear and feeling cold all day gave in more socks C Coy on fatigue some went to baths Fricourt still C Coy runner we were moving up Flers way again hope not C Coy came back about 6 oclock fatigue had dinner and turned in 5 blankets.\n","42":"\n\nRather dull day not too hot either C Coy 40 men on fatigue still getting fairly good tucker hearing bombardment last night and today still going strong no mail in sent pcds to HSC & May Jackson still C Coy runner not much doing turned in early near Fricourt Wood in iron huts.\n","43":"\n","44":" nothing much all day very muddy here still in huts plenty of taubes up did not have to do much running after dinner not too much bread we moved up to the trenches and walking nearly all the night arrived at \n\ntrenches at about 12 oclock and relieved the 19 & 20th Battn at Flers the ridge in front of Bapaume not taken yet getting finer weather Jim not too good \n","45":"\n\nIn trenches at C Coy headquarters had to report to Hdqrts after went on runs from Hdqrts to C Coy Hdqrts Fritz bombarding pretty heavy shells landing near had no rations much so hard to get stuff up to the trenches did not have to run much had no sleep running all night.\n","46":"\n\nAfter running all night no sleep went and took a Company of 20th Battn up to trenches after ward came back & had to go up to C Coy & do running at about 7-15 a severe bombd started by us and at about 8 oclock am the 25th & 26th & 19th & other battn charged \n\nPS. 20th Battn charged about 5 times\n\nand took a couple of lines afterwards a message went up the line & I took it up Taubes brought down and fritz put up a barrage on Tucks sleep very solid about 12 oclock I got \nblown\n incursion caught me & could not get and had to go to doctor about 8 oclock left trenches and went to 7th AMC tent after that got shifted by motor & went to a camp near Albert about 5 oclock Capt Donesch killed.\n\nWednesday 15 Novr\n\nGot up about 8 oclock and had no breakfast after that had a stroll round not feeling too good had a bit of dinner about 12 o’c no break very poor tucker about 3 oclock went & got in Red Cross train about 200 fellows travelling all night the tucker was very light on this train had no blankets not sorry when arrived at destination.\n","47":"\n\nArrived here at Rouen about 7 oclock in morning had a bath warm and after seeing the doctor went & had a sleep turned out for dinner the tucker in this English hospital was very light all sorts of fellows here Austs & tommies turned in very early that night in a good bed and had a good rest. 1st for a year or so.\n","48":"\n\nSee Doctor after breakfast the tucker was still very light so many here very cold weather looks like snow nurses fairly attentive here & look after a man doctor ordered me plenty of rest did not sleep in daytime 4 meals a day here but they are very light turned in about 8 oclock getting medium slept fairly well Con Reilly with me here in same ward \n","49":"\n\nGot up 7o’c snow on the ground had breakfast and Doctor came round about 8 oclock said nothing feeling none too good very cold had more medicine had a shave after dinner went for stroll rained in evening slept fairly well at night some fellows off to Convel Camp & Blighty getting medicine from Nurses.\n","50":"\n\nStill here in hospital at Rouen had a sleep in morning Doctor came round and putting fellows with wounds first 2 or 3 days in to Convel Camp then back to Battn put me Convel Camp tucker very poor went twice for dinner Somme still going on Bapaume not taken yet did not feel too good owing to diarrear very dull weather plenty of Australians here all sick men here turned out at 6-30 am not much of a hospital\n","51":"\n\nGot up early still got diarrear had light breakfast tucker very poor went out in evening left this place 11 Genl Hospt and went further up the road to another convalescent camp turned in very early in a very drafty place in a tent.\n","52":"\n\nGot up about 6 oclock had breakfast very light here worse than last place see Doctor after waiting an hour told me I would go to base hospital done nothing rest of day had avery neavy cold went Rouen in evening and see some pictures not too bad walked about 3 miles Rouen a very big town Cathedral about the best in it had 1st London Pipe band at No 2 Con C.\n\n22nd Wednesday\n\nGot up early and had another poor breakfast took blankets up on parade waited another hour amp; see Doctor said How are you told him was all right only to glad to get out this place & get a feed for dinner had a bit of bully & 1 potato with a piece of plum pudding about 4 inches square between 8 men in evening left here and went to another camp about 10 minutes walk 4 Inf base had a bit of stew & turned in\n","53":"\n\nStill in 4th Inf base had breakfast fairly good tucker here better than before very heavy cold after drawing rations had dinner & about 8 oclock got on a train after buckstew tea travelling all night over Seine at Rouen very slow travelling alept very little that night 8 in carriage raining alittle Tommies & Scots on train about 300 Scotie Officer in charge passed 3rd Divn moving to action for first time.\n","54":"\n\nArrived at Etaples crossing bridge got up to 2nd Div & went up to","55":" lines see Con & Hodge & Jim Bales L Cameron & Anderson & others here had a bit of tucker & managed to squeeze in tent felt very tired at night very big camp here & plenty knocking about very sandy place here light rain falling camped on a hill overlooking river or something.\n","56":"\n\nGot up early but did not go on parade done nothing in morning after dinner went and see Doctor in evening said I had had influenza gave me 3 days L D after that went and had tea and in evening had a walk about very big camp see Etaples very windy in evening Con & Hodge went up to Battn turned in very early about 150 25th men here.\n","57":"\n\nGot up about 6-30 & had medicine after that went on a light fatigue at that for about ½ hour & then went for a walk around & after dinner of meat of spuds went & wrote letters one to P Bartlett & H Sleinmetz HSC & M & Mrs Clarke V 2M in evening after walk about the camp turned in still getting medicine\n\n27th Novr Monday\n\nAfter getting medicine went and got \ninnoculated\n in left arm very fine day mob went out to Bull ring sun out see trains here leaving Etaples still feeling a bit cold. 1st 2","58":" & 5 Divns only details down here done nothing much all day very sandy place here tommies & NZ & S African base here turned in early only tents here sheds & here.\n\n\tMiss A Clarke\n\n\t“ May Jackson\n\n “ J Clarke\n\n “ P \n\n\t“ Tessie\n","59":"\n\nGot up early and had light breakfast getting fairly good tucker here got inoculated about 11 oclock by Corporal A en C afterwards done nothing much all day fine day rumour getting paid done nothing much all days in evening done \nno\n got paid 20 francs in evening went nowhere in evening turned in about 5 oclock very cold.\n","60":"\n\nGot up about 6 – oclock and went for breakfast getting plenty of tucker here and standard bread very filling 2 Zeps brought down & Rumania practically finished did not see Doctor through Orderly Corps fault so marked us duty very cold weather now set in on picket at night had a fairly good time on bridge came back early & turned in send 5 letters away see other page\n","61":"\n\nGot up about 6 oclock had breakfast and after putting equipment together had to fall in on C.O. parade went for route march to Etaples Market Sq & about 3k’s out very cold came back and had dinner after had more drill rifle etc about 1 hour & ½ not too solid frame Cameron & Anderson left for line about 11 went up turned in very early nothing doing down here much.\n","62":"\n\nGot up sound of bugle & had breakfast after breakfast went on CO parade route march got warm sun out Germans advancing still on Bucharest Wrote to M & D & HSC did not go out on evening parade owing to being on Etaples Bridge picket at night bit cold today came back from Etaples and turned in Bill bowie & Jim Bales still here.\n","63":" \n\nGot up pretty early and went on guard at 8.30 on guard at 2 en’s store and guarding prisoners very cold on guard after on shifts 8-30 to 10-30 2-30, 4-30 very cold on at night on guard had a little sleep under blankets had good fire going all night plenty of barb wire guarding prisoners Bill & Jim & others went up the line.\n","64":"\n\nAfter very cold night on guard came off 10-30 and after inspection of lines by Colonel came back to tent had dinner & turned in dead tired got up for tea very good tucker on today after tea turned in had a fairly good sleep.\n","65":"\n\nGot up about 7 oclock and had breakfast very good tucker went out about 10 oclock route march near Stella Plage back was with us came back about 12 oclock & went out in evening for about 2 hours on company drill & bayonet drill came back nearly dark & had tea after went to pictures with 2 others had English pictures on very good turned in very windy.\n","66":"\n\nGot up very dull day after breakfast went on parade again had bayonet and other drill fairly easy morning did not feel extra good hear we were getting paid Charlie Andrews 4th back here raining & fairly cold got paid 80 francs in evening by Lieut afterwards turned in fairly early.\n","67":"\n\nGot up for breakfast, mess orderly for day rotten job, in morning done Company drill. After drill had finished came back for dinner, after dinner had of, no drill, Sergt letting me have a spell, wrote letters and then turned in, had a read, fine weather.\n","68":"\n\nGot up and had breakfast, tucker not quite so good today, no word of moving yet, on blanket fatigue in morning carrying them, on same in evening. Eddy barely back here, working well did not have to work too hard.\n","69":"\n\nGot up, raining too hard for drill so stopped in tents all day, very rotten weather. Bucharest and Rumania practically finished, very big reforcings in Germany, very little doing on French and English fronts, went in Etaples in evening and had a look round, sent present home, calendar, turned in 8.30.\n","70":"\n\nGot up early and had breakfast, no drill all day owing to heavy rains, had a read and wrote letters to M and D LHC and AHC, went after dinner to PO and got PO for 16\/-, sent to Dad for Xmas presents, not holding too much, in evening turned in very dull, Beasley down, went in evening to hear a lecture on war.\n","71":"\n\nGot up fairly late and about 10 am went to Church parade, very good preacher, Rev Taggart, in No 2 Mess, but after that done nothing, turned into bed after dinner owing to cold and rain, got up for tea and turned in again. C Andrews going to England, slept fairly well.\n","72":"\n\nGot up early, had breakfast, bread and jam, then went out on parade, came in and fell in 10.45, went out to Bull ring, very long walk, big heads out there. Went through poisonous gas with helmet, not box, came back and went through tear shell gas, came back from Bull ring, had dinner and was finished for the day. Bucharest fallen.\n","73":"\n\nGot up early and after breakfast, fairly good, and went out Bull ring shooting, raining heavy, had 3 rounds and then 12 more shots got 14 out of 15 on target, 5 bulls, 2 good shooting, first two shots not too good, came back and had dinner and after 5 oclock tea turned in.\n","74":"\n\nAfter breakfast went to see Doctor, not feeling too good, and got Duty, this Doctor puts everybody on Duty, one fellow put on duty and in two days dies, done nothing all day, me and Peter up, went and wrote letters in evening at SCA, to Miss Amy Clarke and others, turned to early.\n","75":"\n\nGot up early and went up to Doctor and got two teeth out, one of the back ones pained very much, glad when it was over. Turned into bed as gums were very sore, done nothing. Germans peace proposals going about. C H Smith back here.\n","76":"\n\nWent out Bull Ring about 8 oclock and raining very hard, when we got out there, big cemetery here about 400 graves, went on bayonet fighting and rapid loading. Bull ring big training ground for Australians and tommies, after 12 oclock dinner marched back and had dinner, went and sent regtd letter home, 14 and 15 Rein is here also details, crowded camp.\n","77":"\n\nGot up but did not go out Bull ring as most of Details were inoculated and had 24 hours off, tucker very scanty now owing to such a lot reints and Details being here, nearly 3 000 drafts going out every day, lots of old hands from Pozieres here that got wounded, very dull weather here, damp, no arrangements were made here for Reints that came, camping everywhere.\n\n17th Decr Sunday\n\nGot up again about 8.00, very poor tucker, being by now on after went back to tent, nothing to do, carried ammunition for Draft joining Battn. French advanced, 9 000 prisoners and peace proposals turned down, dining again in mess huts very full up, went and wrote a letter in SCA feeling much better.\n\nMiss Isham\n\nRevd Tessier\n\nMonday Decr 16th\n\nHad breakfast, not too good now, very few loaves of bread, got ready for Bull Ring. Parade but did not go out on it owing to wanting shortages, got same and done nothing for rest of day, varied up rations, in evening heard Bell was killed, Clabling in charge of 11 Platoon, Dodds down here. Turned in early, 6 blankets.\n","78":"\n\nGot up and had light breakfast and got ready for Bull Ring, only 5 on our draft 9 95 very few out, had Rifle loading and then bayonet drill, at 11 oclock had ½ hour drilling and then went back and had 1 hour bombing and then Company drill, fairly light drill, very cold, heavy fall of snow in evening.\n","79":"\n\nGot up again and went down mess hut, was told need not go on parade so helded Summerfield with the hut mess work, very fine day, sun out and snow still lying about, went and wrote a letter, had no letters for a few days.\n","80":"\n\nGot up early for draft, cold in morning, got warned again for Draft for the line again, on light fatigue, got into blankets pretty early owing to the cold weather. \n\nSmith and Burgess going up about 150, Smith went to 7th machine Gunners and Burgess got crimed with 5 years hard labour","81":"\n","82":"\n\nAmbulance\n\nHospital – 26 AGH\n\nQuiet day\n\nAbout same time Doctor sent me to hospital owing to internal troubles arising out of Trench fever and thoroughly run down, temperature.\n","83":"\n\nHospital still, Doctor round said plenty of rest, done nothing all day much, getting things ready for Xmas, had a read and sent a letter home, in evening sisters were round singing carols, turned in about 7 oclock feeling fairly good in.\n","84":"\n\nFine weather.\n\nGot up fairly early and had breakfast and had ham and eggs, eggs were not too good, hard, some games and then went in for Xmas dinner, very good, afterwards had a game and then had a good tea, afterwards had a sing song and gramophone going and spend a very good day, turning in about 8 oclock, sisters worked hard.\n","85":"\n\nHad breakfast, still in hospital, done nothing in morning, baring a little dusting of the ward. Doctor finished looking at me and said I needed time, said I would not be fit for a good time yet.\n","86":"\n\nHospital\n","87":"\n\nHospital\n","88":"\n\nHospital in Etaples, still going strong here, slept fairly well, Doctor round.\n","89":"\n\nHospital\n\nStill in Etaples, up all day feeling none too good, old American Doctor, ordering fellow with influenza glass of water every half hour.\n\n \n","90":"\n\nHospital recommended for England, wrote a letter from Etaples 26, AGH Home, not feeling up too much, helped in the ward all day, AD nurses here, plenty of Australians here of all battns, some 3rd Divn in already, Eddy Craven gone to England and all men over 40 years of age.\n","91":"\n\nAt Etaples Hospital all day, done nothing, in evening got ready for blighty, after tea left in motor ambulance and arrived in train travelling all night to Le Havre getting very poor tucker on this hospital train, had a bit of a sleep, few tommies in here.\n","92":"\n\nAfter travelling all day, very weary journey, arrived at Le Havre at about 6 oclock, went on the Braemar Castle and went down below, very good, sail started about 11 oclock, very smooth, very good staff of AMC nurses here and look after a man well.\n","93":"\n\nStill in hospital at Bristol Southmead. Sam Keys and Humphries, who was woulded here me go out for drives to parties and have a good time, light fatigues being on here, Billiards here and other games and plent of reading so have plenty to amuse ourselves with.\n\nFrom 3 –","94":"\n\nStill in Bristol Hospital, Doctor says am fit to go out so expect to go out any minute, left on morning of –\n","95":" – 17\n\nProceeded to Bristol – about 15 Australians, and caught 12 oclock train to Paddington, 1 mile a minute train, first stop London, for rest of day ,stayed at Union Club in evening.\n","96":"\n\nOn Leave\n\nStill in London and looking round, in morning met Charlie Bonnor from France, had a look round the city, not altered much, went home about 6 oclock and very glad to see me, slept well.\n\n1917","97":"\n\nStopped in all day owing to rotten weather, had no letters, see Uncle, Kelsey Park.\n","98":"\n\nNot much of a day, went in evening to see Uncle John and Lily, not much difference, had some tea and came away in evening.\n","99":" to","100":"\n\nWrote to Best\n\nPte J McKee M and D\n\nMiss May Miss T Nosely\n\nJackson and Horseferry Rd P.O.\n\nASC\n","101":"\n\nPerham Downs\n\nCamp No 43\n\nVery cold and snowing, got issued with clothes, no rifle nor equipment.\n","102":"\n\nDrilling all day, very light route marches, very cold, snow and water frozen everywhere.\n","103":"\n\nWent out drilling. Physical jerks and route march, still in No 3 Camp, not much of a place for tucker but better than France anthow.\n\nTidworth and Ludger Shall the nearest towns too here, the NCC working on roads round here\n\nC Bonnar\n\nRevd D Tessier\n","104":"\n\nIn morning out on Physical jerks and after went for a small route march, after we came back about 12 were dismissed for the day, met Dorrington and another of 6 Co and went to Tidworth, very small place, planes up, went and wrote letters in evening.\n","105":"\n\nSunday wrote to C Bonnar, Revd Tessier, on Church parade in morning, snowing all all 4 inches, very thick, on parade. Did not go anywhere owing to the cold.\n\n4th to the 8th\n\nWrote to Charlie Blowner\n\nRevd Tessier\n\nA H Clarke\n\nMiss N McKinnon\n\nMiss A Clarke\n","106":"\n\nGot out of morning parade, snow still on ground, very cold. America probably coming in the war, no sign of end yet, still at Perham Downs, went to YM in evening.\n","107":"\n\nPut in application for down Horseferry Road Clerking, more route marches all day, snow still lying all over the place, Gregory in camp and few 25th fellows staying here, tucker not bad, very rough, must expect that.\n","108":"\n\nThe weather has been cold but sun out all day, done Physical jerks all the morning, fairly good, had good dinner and in evening went for another route march. Had no letters from anybody.\n\nWrote letter M and D 11\/2\/17\n","109":"\n\nWent on the parades and in evening on a route march, did not hear any more of the application that I put in, still plenty of snow about, turned in early. No 2 platoon now.\n","110":"\n\nOn parades, am Classified, about 2 oclock got examined, Doctor said I was fit, marked for No 1 platoon, done nothing all day much, in evening went to YMCA.\n","111":"\n\nAfter morning route march came back and was told that should have stayed in for transfer. Heard nothing more, went and got transferred to No 1 platoon, soon be in France again I expect.\n","112":"\n\nDid not go out on any parades and had to stand to for draft, not a bad day, snow not melted yet, had no mail whatever, turned in early.\n","113":"\n\nIn morning had to go past Doctor, get very poor examination here. If you say are not feeling well they do not examine you just mark you. Dating in evening, shifted over to No 4 camp, not bad tucker over here, better than nothing, gave pay book in, giving out new pay books.\n","114":"\n\nMy birthday, fine day but cold, went and see another doctor, marked me fit would not give you any say in the matter, had a very light morning of it, poor dinner, went over to YM after dinner.\n","115":"\n\nIn morning went out on drill, this is one of the worst camps that I have been in, absolutely no management. I went and had guard drill from 3 – 4 pm and then went back to huts for a starvation tea. This camp is supposed to be a training camp like the Bull Ring at Etaples but its nearly all guards and piquets.\n","116":"\n\nIn morning after break went on guard, very particular guard, went on headquarters guard shifts from 11.30 to 1.30, plenty of saluting, will be glad when am out of this camp, had no sleep as was up 5.20, 7.30 same at night, turned out once or twice.\n","117":"\n\nCame off guard about 9.30, done nothing in morning, felt very tired after dinner, tucker improving a bit but still pretty bad for a camp in England, snow all melted, in evening went on bombing and other drill, called in at 3.30 for enline piquet, another night not to myself, had to keep in a hut, must not go out.\n","118":"\n\nCame off enline piquet in morning and went to Doctor as was feeling run down, marked me Duty and medicine and came back, put on guard went on at 11.30 for another 24 hours, fairly sick of it, different guard from before, did not have to present much, very cold at night.\n","119":"\n\nCame off guard and did not go on anything, had the day to myself for a wonder, went over and see Burrows 57th Battn and we knocked around, had tea, bit of cake and 2 slices of bread, allowance very light ones at No 1 Camp but very good at No 4, went to bed early and slept well.\n","120":"\n\nOn bombing and rifle range and bayonet work, heard I was on the next draft for France. Channel entered by German submarines, marked on Enline piquet at night, went over to No 1, had some good soup for dinner, turned in in another hut for the night at No 5 camp, did not have to turn out.\n","121":"\n\nStill on physical training and bombing, plenty of 25th fellows here, did not have a hard day, no pay yet, have not had any since have been in this camp, went over to YM and then turned in.\n","122":"\n\nStill on old routine, work, bombing and bayonet exercise, supposed to go tonight but did not go owing to traffic being held up in Channel, the Details got paid I got none owing to my pay book being at Horseferry Road.\n","123":"\n\nOn Physical jerks on Perham Downs and bayonet work and bombing. Getting better at bombing, not a heavy day, had no rain for a long time now, went and see Burrows and he’s getting a p for here, came back and turned in, had a read.\n","124":"\n\nIn morning on parade, Johnny Walker out on bombing and bayonet work, very good morning, not much dinner, went to rifle range in evening but did not do any shooting owing to being tired, went over to No 1 Camp and see Burrows, he and all men in No 1 marked C2, lucky went to Ludgenshall and spent a very pleasant evening, turned in about 9.20.\n","125":"\n\nIn morning went on parade and went shooting, went through that, best one of about 30, 2 of us after that went and had bombing, in evening warned for draft and after medical inspection went over to find Burrows, could not find him, left that night from Tidworth, changed at Andover and had a sleep when arriving at Boulonge. \n","126":"\n\nIn morning got up and out of Folkestone, did not go out anywhere on in private houses, had fairly good tucker and a sleep, 1 blanket, after dinner left on transport escorted by destroyers. Cargo boats, about 10 escorted over by the destroyers, very cold, life belts on, arrived that night at Boulonge and went to a camp, a long hill to climb up.\n","127":"\n\nStayed a Boulonge Camp all that night and had some tea and dinner, at 1 oclock moved off and went through Boulonge and got on train to Etaples, country looking very much the same as when I left it, before arriving at Etaples about 9 oclock and went to Detail lines and turned in.\n","128":"\n\nIn Etaples 2nd Div base camp again, had another farce of a medical inspection and clean spare stuff, have now got change of underclothing. Waterproof oilsheet, 1 blanket, oilskin and have a big load, done no drill only an inspection, few of the old boys here, no change in this camp, few of old boys here.\n\nPay Book No 186,347\n","129":"\n\nGot up and had breakfast, tucker not so bad here but better than Perham Downs, done nothing that day barring a route march with full pack up a bit, cold no sun out, had plenty of blankets so turned in for the night, 10 details from England for the","130":" Battn.\n","131":"\n\nIn Etaples, still nothing to do, rumour we were leaving today but do not think so, nothing to do, no drill for the Details, no rain but a bit cold so turned in very early, went over to pictures over the Tommies base with young Archer, not bad.\n","132":"\n\nGot up early and 5 am that morning got up, had light breakfast and went to Etaples Station, Draft about 90 for 2nd Divnand got in train and went through Abbeville and through to Albert travelling in cattle trucks in about 30 in a carriage and got to Albert about 3 oclock and went to 1st Anzac Reint camp and turned in for the night.\n\nP.S. Were in Albert with Watson of B Co that night.\n","133":"\n\nGot up about 7.30 and had breakfast of bully and buiscuits and jam and got pack up, went out on parade ground and went and got box resperator and went through gas in an old Albert house and then got pack up and went on a route march towards Contatmaison, stayed there in the Piveer Camp and turned in for the night very tired as pack was heavy.\n","134":"\n\nGot up and went and got buckshee tea and had a feed of bully and buiscuits, did not have to do anything in morning.\n\n4th March Sunday\n\nHad very tight tucker and in evening got shifted over to Battn camp about ½ hours walk away. Serg Bell and Sam Anderson here, had light tea, bully and turned in, 6 in a tent, went on ration fatigue for the line.\n","135":"\n\nStill in a tent and had some tucker, got up late, on ration fatigue from Martintunrgh to over near Warlencourt, came back a good 5 mile march up there, turned in early.\n","136":"\n\nGot up late as was tired and after a wash turned in till dinner time and after dinner went on ration fatigue to Warlencourt to B Co. had long march through mud, shelling, about 3 oclock see the Butte de Wailencourt and Sugar Mills, came back to Martinpurgh very tired as were carrying through plenty of mud, turned in about 10 pm very quiet shelling.\n","137":"\n\nA very windy cold day, slept in a good part of the morning as was very tired from last night. Battn not out of Line yet, went to Walencourt on ration fatigue, got back late that night and had a good sleep, very tired, went to soup kitchen.\n","138":"\n\nStill on ration carrying for the line shelling Bapaume Road, after coming back and having some soup turned in tired again, moment we turned in had to turn out again for a change, left immediately for Warlencourt, arrived in same and slept, so tired to in rotten dug outs, snowing, very cold.\n","139":"\n\nStill in these dug outs or an old house, just a board covering your head, very crook, opened a barrage of fire round us, got no body, in evening carrying up bombs and sand bags for attack, up in front line when attack was put off, owing to scouts saying bard were was up, came back, tommies went over, 200 prisoners.\n","140":" Sat’y\n\nStill in Warlencourt, snow melted, came back to 26 avenue, did not come across company so came back to Villa camp, did not have much tucker, went back and got attached to B br 2, no rations, poor shelter, no dugouts, left and came back to tent at Villa camp and turned in for the night, with 4 blankets, ist sleep for 3 nights, very tired.\n","141":"\n\nGot up about 8 oclock and after having a wash, fine day, observatory balloons up, left Villa camp and went up to Battn in Martinpurgh, att’d to 6 Company again, did not know many new hands, left at 9 oclock and walked to Becourt, went in huts, not far from Albert, raining, 1 blanket, slept well.\n","142":"\n\nGot up late and had some breakfast, had a wash, done nothing much all day barring cleaning up rifle, in evening went with Watson to Albert. Had a good time, the Battn nearly all getting pay, I did not get any, got some mail, very cold, can only hear distant report of guns here.\n","143":"\n\nGot up and had a bit of drill, charging, etc, did not have to do too much, on very poor rations, ¼ loaf of bread and had 1 tin of jam to 6 fellows, fairer weather, turned in fairly early, big sick parade on.\n","144":"\n\nStill in becourt camp, not too much drill to do, no word of going up the line again, rather cold, inspection by General of 7 Brigade, Jim badzour still Sergt Major, wrote some letters home, turned in early.\n","145":"\n\nGot up late feeling none too good, after morning parade of Services , Machine Gun inspection, had dinner, tucker getting bit better, ¼ loaf per man, still on the 2 up, no rumour of shifting yet, went over and see 6th Battn in evening, the old 4 of 25th.\n","146":"\n\nDid not have to do much, out on Bayonet drill and other stuff, bombing , fairly fine day, turned in early, no word of moving up yet, still in Becourt camp. 9th Battn in Scotts redoubt, heavy bomb’t.\n","147":"\n\nStill here, got up fairly early, went on Lewis Gun instruction after that, gas drill and then dinner, heard 5th Div’n got Baptume and Light horse through, hope it’s right, had 4 letters.\n\n \n","148":"\n\nOn escort duty to Albert from Becourt, took 4 prisoners and brought them back to Battn, fine day, not feeling too good, have not gone up to Doctor since have been in France this time, turned in very tired.\n","149":"\n\nGot up early and had to fold blankets up, a move up the line again, moved about 11 oclock and marched from Becourt to the Bapaume Road and from there to Bapaume. Bapaume still on fire by the Germans, moved about 3 miles past Bapaume and got in some Billet in a small village which was burning, had not been shelled much, has a sleep 11 pm, overcoat and oilsheet.\n","150":"\n\nGot up again at 5 am and had another route march, nearby the Germans 23rd had a charge and got cut up, I was on outpost duty on a road stopping Germans shelling all round, very cold, snow, hail and rain, see 6th Brigade charge and get cut up, we dug in and got shifted again at night, rain, snow, etc.\n","151":"\n\n3 platoons of 6 moved up to front line and 12 platoon in support, did not have to do anything, felt rotten, made a bit of a dug out along the road to Mrgan near Sugar Mill not far from Vuraquant, very cold, could not sleep owing to cold, having a hop over.\n","152":"\n\nGot up, had nothing to eat much, getting very poor tucker, nothing to drink owing to Germans poisoning water, big craters in road and trees\n\nall down along road for observation, carrying rations to C Coy, turned in afterwards, very cold, slight snow falling, see German plane brought down, some relation of Kasiers, see another firing a german, had a bit of a fire going from the wood of sugar mill.\n","153":"\n\nC Coy still in front line, Germans shelling very light, went over AMC for embrocation for chest, Major Lees killed and Hybard evacuated, our planes up all day, getting shelled, none brought down, Germans very quiet, shelling Vuaquart (court) headquarters, turned in again after hearing the good news of a hop over in the morning. C Coy got relieved.\n","154":"\n\nC Coy still in line, suppose, done nothing all day, no word of shifting, got a drink of tea very cold, shell about 2 of C Coy when in line, killed, 3 wounded, very light shelling in evening, we moved back to Sugar Mill and along the road our batteries shelling a bit, I was guide for 9 Platoon, heard the hop over in morning, had nothing to do all day, fine day.\n","155":"\n\nFine day, aeroplanes up all day, Fritz shelling, no word of moving yet, had a fire going, getting more tucker, which is quite time, had no hop over yet, has to come off though, had a fairly good sleep, had everything packed up for a move, this road leads to Ecouist and St Mein, had a good sleep, that night very light shelling.\n","156":"\n\nGot up fairly early and had fairly good rations, heard we were still hopping over, had to stand to in supports as A Co was going over in attack on village. 2 Brigades we opened up about 5 oclock and got our objectives stopped along road and dug in, in evening shifted back to Sugar Mill, turned in after making a fire over, had a overcoat on, very tired.\n","157":"\n\nGot up about 4 oclock and had breakfast, still C C Coy in support for front line, fritz shelling very light, after standing on road near Vrauacourt stood down about 7 and went back to billet, got my rations, made a fire and had a good sleep, in evening fritz sent over gas, got a bit of it, gas shells, got relieved by 4th Div 57th! and marched back through Bapaume, past Town Hall (Still burning) and marched back through to Walencourt and turned in a camp near Le Sars 1 blanket.\n","158":"\n\nGot up about 8 oclock and after getting breakfast, 1 loaf 14 men, poor rations, had dinner and left about 1 oclock and reached Bargentin Huts about 5 oclock, got a blanket and turned in, very warm, the country looking very muddy, still cold, Jim Cradyow over 12 platoon managed to secure some dog buiscuits, woke up cold about_\n","159":"\n\nGot up and had bacon and tea, got 2 loaves to 5 men, must be winning, had a good dinner and left for Bayliten, few went to hospital that were gassed the other day, raining fairly hard, reach Contalmaison and stayed at Acid Drop Camp, got a few letters, very tired, muddy, raining, turned in huts, drawing 2 blankets, first time have had blankets for a good time.\n\n \n","160":"\n\nGot up fairly late, raining, had breakfast ¼ loaf issue, no jam or butter, no more news of front, turned out finer, in the day shortages taken want the men to pay for them, inspection in evening by 12 platoon officer, done nothing rest of day, nowhere to go, raining, wrote letters.\n\nMiss A Clarke – H T Clarke – Corpl H S Clarke – Pte McKee – W J Clarke – Pte Bartlett\n","161":"\n\nGot up not too early, had breakfast, very light tucker, just enough bread for two small slices, on more inspections by Capt Foxton, thinks a lot of himself, had a hail storm in the evening, plenty of mud here, graves all round the place here Contalmaison, turned in early, eating buiscuits out of a dump.\n\nMiss J Isham – M A Clayton – Mr and Mrs Honywood – Mr J Benjamin L A C – Miss May Jackson – Miss B Moseley – Miss A Clarke.\n","162":"\n\nIn morning went on Church parade and after that had dinner, getting 4 to a loaf, very wet, had nothing to do for the rest of day so wrote letters. Germans still getting pushed out of some of the villages, turned in early.\n","163":"\n\nIn morning, after breakfast very light, had machine gun instruction, Lewis now attached to same for a while, getting snow, rain and very cold, had a bath, nearly cold, no clean underpants, door open on a man, all the time very cold, snowing very hard.\n","164":"\n\nGot up for another poor breakfast and went on Lewis gun instruction, done nothing all day much, very light and early snow. Sergt Major Jim Cradgow going to England, turned in again early in evening, poor tucker, snow.\n","165":"\n\nGot up, raining and snowing, machine gun instruction, Capt Carol back, not in C Coy, getting bit better tucker and still on Machine Gun instruction, in evening had nothing to do as was a holiday, in evening turned in early.\n","166":"\n\n2 loaves to 5, we are winning, still raining, still in Acid drop Camp near Contalmaison, on Serves gun instruction all the day, did not have a hard day of it, turned in early, Capt Carol back here.\n","167":"\n\n3 to a loaf and jam to 4, not too bad, good Friday and on Serves Gun again, in evening had nothing to do so went up to Flers, see lot of dead not buried here yet and fellows over at Pozieres say dead not buried, this is fairly right for fellows who given their lives, not to be buried now there is no shelling here this side of Albert, turned in as was raining hard.\n","168":"\n\nGot up and had breakfast, good bread issue, and after inspection of gas helmets went for a route march through Mamely Wood and about 4 mile came back and had about an hours drill and then got dismissed, not a bad day, turned in early, no signs of moving up again, not sorry.\n","169":"\n\nGot up early as was not feeling too good and got exemp from duty, did not do anything before dinner, still in Acid Drop Camp, Contalmaison, after dinner not bad tucker.\n\n8th April Sunday\n\nWent to Flers and buried some dead, our fellows still lying out there, see Sergt Bell and a fellow named Bennett or Perrett, W. Aust, buried 3, had a good, came back in eveing and had some tea, after that turned in. \n\nLetters Dzard and Soldiers Club, M and D and Leon.\n","170":"\n\nGot up, ¼ loaf a man, and went shooting with Serves gun, had about 30 rounds, after that came back and very cold, turned in, got a letter from Miss Jackson and home.\n","171":"\n\nInspection by Officer Carol and after a blissard of wind and snow came back and had Lewis gun instruction, no sign of shifting out of this camp Acid Drop, snowing, turned in early.\n","172":"\n\nGot up and went sick, not feeling too good and got no duty, done nothing in morning, snow on ground and very windy, in evening the Battn had off, snowing like anything, about 3 inches thick, turned in early feeling none too good.\n","173":"\n\nGot up and went to see Doctor again, did not see him owing to Orderly Corpl being too late, had inspections all day, too wet for G O C inspection, raining hard, heard we were moving up again, would not wonder, did not feel extra good, still at Acid Drop Camp (snowing) Contalmaison Circus.\n","174":"\n\nHad G O C’s inspection, done nothing all day, had a read at night and wrote some letters, still snowing and raining, got ready for moving up again.\n","175":" Sat’y\n\nGot up about 5 oclock and got breakfast, moved up through Pozieres along Bapaume Road and struck about 3 mile out and camped near a village first in front of Bapaume, slept fairly well.\n","176":"\n\nGot up about 5 am, moved towards the line, had to stand to as 4th division got a cutting up and was saved by 20th Battn counter attacking, a wet day, got soaking wet, getting very little tucker, came back in evening and turned in near village.\n","177":"\n\nGot up late and did not have to do anything up to 5 oclock, still here waiting to move up, still in bit of an old poste near a German dugout, raining, snowing and very cold, not much tucker.\n","178":"\n\nGot up, fine morning, done nothing all day, only light fatigues, raining and snowing in evening, very light tucker, slept well, extra blanket, turned in early as was hailing and snowing.\n","179":"\n\nGot up cold, had a shave, still here in reserves, done nothing all day, in evening got word we were shifting so got everything together, pulled me out to stop behind to organize machine gunners when they came out, shifted about 5 oclock and went up the Vaux and Vruacourt Road, made a bivvy and turned in.\n","180":"\n\nStill here on Water and different fatigues here, in transports, lines of 7th Brigade, few wounded Green and McKay, fairly fine day, about 3 miles from the German line and about 2 miles to Noreuil, turned in fairly early and slept fairly well.\n","181":"\n\nOn fatigue all day down at old village, trees chopped down fruit and see cemetery, and Church blown up, village and all round here recked and no good, plenty of rumours flying about about the end of the war, getting bit better rations, had a stew for dinner and a bit of stew for tea so scored well, fairly heavy bomb’d going on.\n\nSat’y","182":"\n\nThe Battn still up the lines and about 90 25th back here on fatigues in reserves, went on blanket and wood fatigue, had a game of soccer, getting ½ of a loaf so we are winning, Taubes over, our planes up, a barrage of fire on a village, turned in about 9 oc.\n","183":"\n\nIn morning got up in time for breakfast, after that went and done some spud cleaning and then had dinner. Fritz over in his plane dropping pamphlets or letters, machine and anti aero guns on him, got away, done some fatigue and turned in early.\n","184":"\n\nFine day, for a long time, done some cooks fatigue and then went over to canteen, came back and got some wood, feeling good, Fritz over trying to get our observation balloon, burnt one, no news of Battalion, still up the line.\n","185":"\n\nAnother fine day, heavy bombardment up the line, Fritz still going strong, still attached to Lewis machine gunners, got a bit cold in evening, managed to borrow a few francs, still doing well, tucker fairly light here barring N C O’s who have a loaf a man, the mens issue.\n","186":"\n\nFine day, got up for light breakfast of ¼ loaf a day, still back here at transport lines in reserve, no word of shifting further, Fritz over in his planes, heard Albert out of bounds.\n","187":"\n\nGot up not too early and had a good feed of bacon, 3 to a loaf, went on cooks fatigue, done nothing on rest of day, still in transport lines near Vaux on Vraucourt Rd, heavy shelling by naval guns, no pay, living on gov’t hard buiscuits, Sergt’s living well here, Moreil supports, heard we were over the top in morning.\n","188":"\n\nStill in Transports lines, done a little fatigue in cook house, getting bit better luckier, heavy bomb’t on left sector, Fritz naval guns shelling about here, Brigade band playing, bit cold, turned in, heavy bomb’t still going on strong, did not sleep too well, 4 to a loaf.\n","189":"\n\nOn cooks fatigue still, fine day, fritz naval guns still shelling line, not many planes up, no word of shifting yet. Still up here about 2 miles from Norveil, heard Battn was over tomorrow, had a light day, heavy bomb’t at night by Fritz up Norveil way.\n","190":"\n\nA fine day, on cooks fatigue in morning, nothing else to do all day. Brigade band here, very light bom’t in day, plenty of planes up, no word of Battn moving out yet, Fritz over several times in day, machine gun and anti guns on him, got away, fine day, turned in early.\n","191":"\n\nAnother fine day, heard Battn in reserve line had as easy day of it, no word of shifting, one of our planes brought down here. Pilot riddled in bullets, heard he died, light day, plenty of rumours flying about about end of war, Battn still up between Vlaux and Norveil, turned in early feeling good.\n","192":"\n\nAnother fine day, Fritz over again, got too hot for him so he turned back, light bomb’d, still getting fairly good tucker, no word of shifting yet, done nothing all day, had a lie down in evening.\n","193":"\n\nShifted from Transport lines nearer Bapaume and got in tents, very good camp here, plenty of grass, fine weather, done nothing much all day, new reinforcements 16 and","194":" Bill Cowie the 25th Battn moved away from here about 11 oc for hop over.\n","195":"\n\nStill in tents and a fine day, cleaned rifle, plenty of time to ourselves, chats giving a lot of trouble, did not get any mail, few more wounded and killed last night, heavy bomb’t and hop over by tommies, turned in early in the tents, no word from Battn, still reserve machine gunner.\n\n4th Friday Friday\n\nAnother fine day, getting 4 to a loaf, not bad rations, lucky not being up the line, reinforcements were on drill, we done nothing, got our gear on in evening and went to another camp, got lost by Leve Jackson and after marching 3 or 4 mile, arrived in a Camp near Bapaume.\n","196":" Sat’y\n\nFine day, very hot, in morning went for walk in Bapaume, had a read and look round, nothing doing in camp, still 4 to a loaf, last night arriving in camp. Fritz just above us bombing, brought down about a mile away, railway line laid down here, went to pictures in evening in Bapaume.\n","197":"\n\nIn morning went in Bapaume and had a look round, went and had a read in Church Army Hut, in evening missed a parade and done nothing. Fokestone back here, Fearless Fred over Camp, still dry and hot weather prevailing, Battn still up near line.\n","198":"\n\nIn morning got up, Fritz over again last night, had new boots parade in morning and evening done nothing much, went and see pictures and concert in Bapaume, came back early and turned in.\n","199":"\n\nRaining all the morning, in evening went in Bapaume, had a look Round, had a read in Y M, not a bad evening, about 10 oclock severe bomb’t opened up and had to stand to, turned in about 11 oclock.\n","200":"\n\nGot up early and got pack together, had breakfast and moved off through Bapaume 9 oclock and got to Contalmaison birens about 12, full pack up, fine day and arrived at Acid Drop Camp and stayed there that night when the Battn came in.\n","201":"\n\nHere all day at Acid Drop Camp, did not have any drill, very lazy day, no mail in yet nor no pay, waiting for pay book still, Machine Gunners got a severe wiping up this time up the line.\n","202":"\n\nFine day, on Lewis Gun in morning, rest of day to ourselves, got paid in evening, had a very light day, rumours of Battalion moving up again, hope not, turned in early.\n","203":"\n\nIn morning on Lewis Guns organizing Battn, in evening went and had a swim, afterwards went to Albert, had a good time, came back fairly late and turned in. \n\nJim and Evans, Mrs Hawkins, Miss Mosely, H T C Clarke, G Hank, M and D.\n","204":"\n\nIn morning went on Church parade and had Brigade band with us, not bad, had nothing to do for the rest of day, still camped at Acid Drop Camp.\n","205":"\n\nStill here, had some machine gun instruction in morning and evening, fine weather, had fairly light day, Capt Bond now over the Company.\n","206":"\n\nIn morning went on parade and done nothing much barring Lewis gun, had firing formation, in evening went to Albert, the town now very quiet, Bullecourt not all taken yet.\n","207":"\n\nStill at Acid Drop Camp, Contalmaison, had a very light day owing to it raining, in evening had a bit of a lecture on huts, no letters lately, more home leave being given out.\n","208":"\n\nGot up in huts and about 9 oclock went on parade, again on Lewis Gun, did not do much, in evening went out again, everything now looking green over this country, Delvil Wood, etc.\n","209":"\n\nGot up early and got blankets ready, about 9 oclock the Battn moved out and through Contalmaison and moved through Becourt to Albert, through Aveluy and Bouzincourt to Senlis where we camped for the night with Boulke and Evans.\n","210":" Sat’y\n\nStill here on parade, in morning rifle and machine gun, Senlis, like other French villages made of mud and wood though everything is now looking nice and green, in evening went to estaminet and turned in early.\n","211":"\n\nGot up early and at about 9 oclock had a route march through Senlis to Church, had an inspection by G O C and came back by Capt Bond of C Coy.\n\nH and J C, Miss Moseley, J Clark, Sister Boyd, Cpl H S C.\n","212":"\n\nIn morning C Coy runner, did not had to do many runs, had a fairly good time, fine weather, still in Senlis, see Albert from near here and beyond the battlefields.\n","213":"\n\nStill runner to B H Q, had an easy time of it, did not feel up to the pitch, turned in about 10 oclock, fine weather, raining a little, everything nice and green.\n","214":"\n\nIn morning had a few runs and after a run to Beaucourt, had a good few runs to Headquarters and after that turned in fairly early, fine weather, pretty warm.\n","215":"\n\nGot up in time for a bit of breakfast and after more runs had some dinner, still in Senlis, 1 man per platoon given leave to Amiens, pass booked am, out of town by 7.30, have to walk back, no bus.\n","216":"\n\nFine day, very warm, still at Senlis and not doing too bad as runner, fairly easy time, no letters today, in an old house, about a dozen rooms.\n\nRed’d A Tesser, J Curry, Miss Jackson, R Benjamin.\n","217":"\n\nStill runner, had an easy day, fine weather, Senlis very good surrounding here and had a shower of rain later in evening, fighting still going on at Bullecourt.\n","218":"\n\nAnother fine day, Brigade went on Church parade, came back about 11oclock, not much money knocking about now, turned in about 10 oclock, very light now at 10 oclock.\n","219":"\n\nStill a Senlis, nothing to report, still runner, Capt Bond over C Coy, not a bad fellow but not as good as Carroll who is in blighty,\n","220":"\n\nSenlis still going strong, fine weather, sports Battalion did not go in for any, not up to the mark, too stiff.\n","221":"\n\nFine day, nothing else to report, went for run in evening to Warloy with McArdell, stopped writing to Miss Mosely, sick of her.\n","222":"\n\nBrigade sports on in evening, Battn in morning, went to rifle range, bad shooting, still runner at Senlis near Boozencourt, turned in fairly early.\n","223":"\n\nStill fine weather, Battalion of 2nd Div still having a good spell, 6th Brigade at Warloy, still going on strong, here nothing else to report.\n","224":"\n\nStill runner and in evening sports Brigade held 27 and 28 Battn, taking most of purses, we won the tug of war.\n","225":"\n\nStill fine weather and everything looking grand. Boxing held in evening, Mr Barlow crook, after seeing boxing had a read and turned in fairly tired.\n","226":"\n\nStill at Senlis and nothing else doing, fine weather, had plenty of runs during the day. As Tiger Delaney was away good part of day, turned in about 10 oclock\n","227":" to","228":"\n\nAt Senlis in fairly good billets, getting very good weather, still runner, had a few long runs out to range near Albert and towards Warloy, got paid here 20 francs from Mr Barlow, leave given to Amiens, Capt Bond over C Coy.\n","229":"\n\nGot up at about 5 oclock and moved off the Brigade and after marching about 4½ kls arrived at a siding and trained from there to Bapaume, arriving here about 11 oclock, had some tea, nothing doing rest of day, turned in early, not feeling too good, in tents.\n","230":"\n\nStill in tents near Bapaume and done nothing, the Battn went on Church parade, very fine weather but very hot too march, in Bapaume looking very smashed up, not much running.\n","231":"\n\nFine day, nothing doing much, did not go out on any parades, the morning parade from 6.30 to 10.30 – 3 pm to 6 pm, still runner, feeling bit better.\n\nMiss Isham and Borne. Wrote Miss McKinnon\/Clayton and Felix Homer, M and D, A H C, J A Borne.\n","232":" to","233":"\n\nStill Runner for C Coy at Bapaume, went into Bapaume, see pictures and see Church bombarded and cellar full of skulls of revolution, a marvellous sight. Every house here smashed up, the Coy doing raids nearly every day, not feeling good, touch of trench fever, cooler weather, Allies still going strong, line at Bullecourt.\n","234":" to","235":"\n\nStill in camp near Bapaume doing drill, mostly raiding and bombing big field, days still getting fine weather but not too hot, had a good look at Bapaume, have not got pay book yet though always have a bit of money, now holding about 6 francs, getting good tucker, here all","236":" Divy camped, about here no word of war ending, America going to do big things. \n\nPlenty of observation balloons up, no mail from anybody so am not writing.\n","237":"","238":"\n\nDone nothing much on","239":" got some equipment from dumps, Battalion still at Bapaume, feeling fairly good, very few rains on night of 28th very heavy storm, snapping trees around Bapaume, in pictures at time","240":" no mail being taken, did not go out on parade, fine day too hot, fearing another evacuation near Sins, no sign of shifting here yet.\n","241":" to","242":"\n\nDone nothing much Saturday, the mob was out drilling and it rained a good bit, Sunday there was Church parade on in morning, got paid in evening, still getting fairly cold weather. \n\nIn papers American troops landed in France, turned in fairly early as it was cold in Bapaume on Saturday looking at pictures.\n","243":"\n\nDid not have much to do, had a fairly good dinner and in evening to the dump for equipment, had a look a church which is smashed up a good bit, in evening went to pictures, see Charlie Chaplin, not bad and other pictures, turned in early.\n","244":" and","245":" and Wed\n\nStill in camp, more raids, practicing, fairly fine weather though a bit cold, very little doing, have not got pay book yet but holding few francs, did not get all, Wed evening off.\n","246":"\n\nStill at Bapaume, feeling over last night moonlight, Coy out attacking, fine day, 1 of our observation balloons brought down, Company came in about 1 oclock, Fritz planes over all day, papers talking about the Americans.\n\nMr and Mrs Clarke, Miss Isham, H S and A H Clarke, Rev Tessics.\n","247":"\n","248":" to","249":"\n\nStill at Bapaume, going strong as runner, plenty of field days, Tiger in clinque, fine weather, plenty of running now Tigers away, no word of shifting, went to pictures when different films were shown, Fritz shelling Bapaumea bit, great aerial activity all along the line, Russia making another big advance, English doing very little now though, can hear very heavy bombardments at times from here, had a few letters.\n","250":" and","251":"\n\nStill at Bapaume camp.\n","252":"\n\nWent on route march and left with band leading and Col Norris, went through Haplincourt and Fermecourt, altogether about 10 miles, came back bit tired, in evening about 40 of our planes going over, nothing else doing, Russians 30,000 in 13 days, British not attacking.\n\nMiss N McKinnon, S C Tossins, Mrs Jackson\n","253":" to","254":"\n\nStill going strong with Battn doing stunts etc, Thursday went to pictures, half holiday, about 160 francs, not bad weather, showery, tiger still here, on Friday night Divn night manoeuvres C Coy, got out of being Duty Company, fine day Saturday, 10 platoon on guard at Beaunatre, rest of C Company on guard and fatigues, holding about 140 francs.\n","255":"\n\nIn morning after a wash, and shave went to Beaunatre to a advanced where 10 platoon was, big aerial fights all day, fine day, nice and warm, no mail from home so did not write any, no word of shifting, night manoeuvres tonight. Divisional attack. \n\n"}}