{"Document Name":{"0":"Diary_0492","1":"Diary_0492","2":"Diary_0492","3":"Diary_0492","4":"Diary_0492","5":"Diary_0492","6":"Diary_0492","7":"Diary_0492","8":"Diary_0492","9":"Diary_0492","10":"Diary_0492","11":"Diary_0492","12":"Diary_0492","13":"Diary_0492","14":"Diary_0492","15":"Diary_0492","16":"Diary_0492","17":"Diary_0492","18":"Diary_0492","19":"Diary_0492","20":"Diary_0492","21":"Diary_0492","22":"Diary_0492","23":"Diary_0492","24":"Diary_0492","25":"Diary_0492","26":"Diary_0492","27":"Diary_0492","28":"Diary_0492","29":"Diary_0492","30":"Diary_0492","31":"Diary_0492","32":"Diary_0492","33":"Diary_0492","34":"Diary_0492","35":"Diary_0492","36":"Diary_0492","37":"Diary_0492"},"Date":{"0":"unknown","1":1410.0,"2":1411.0,"3":1412.0,"4":1413.0,"5":1414.0,"6":1415.0,"7":1416.0,"8":1417.0,"9":1418.0,"10":1419.0,"11":1420.0,"12":1421.0,"13":1422.0,"14":1423.0,"15":1424.0,"16":1425.0,"17":1426.0,"18":1427.0,"19":1428.0,"20":1429.0,"21":1430.0,"22":1431.0,"23":1432.0,"24":1433.0,"25":1434.0,"26":1435.0,"27":1436.0,"28":1437.0,"29":1438.0,"30":1439.0,"31":1440.0,"32":1441.0,"33":1442.0,"34":1443.0,"35":1444.0,"36":1445.0,"37":1446.0},"Entry":{"0":"\n\n \n\n","1":" Steenvoorde\n\nA day in billets. Took a walk round during the morning and found a good deal of room for improvement as regards stacking of gear and general cleanliness. Nearly all the men are now either Lewis gunners or signallers and the breaking up of the 6th. Division has resulted in the return to us of many old chaps who have been away ever since Pozieres and before. It is rather interesting to speculate how they propose to reinforce the divisions now that recruiting has nearly ceased and the supply of recovered wounded has been so fully exploited. We expected General Bob Smith to dinner but he did not arrive. Bunning and Davis both went on English leave tonight. After mess addressed the officers on the need for bucking up their men and so on. All impatience I await my leave warrant for 4 short days in Paris and thereafter hope to be able to work the oracle for Rome and for Naples.\n\n \n","2":" Steenvoorde & Boulogne sur Mer\n\nA fine sunny day. Sent Stewart in to BdeH.Q. early to arrange re my leave pass and then settled down to doing nothing most heartily all the morning. Norman came in just before lunch and Stewart returning with my Paris pass I packed in no time and rode into Steenvoorde with Norman. A good fresh gallop, the country looking as pleasant and attractive in the sunshine as it looks harsh and disagreeable in dull weather. At Bde.H.Q. General Smythe’s car was waiting and Brown and myself got aboard and set off to get Duggan. His headquarters are at one of the usual type of farm but rather a more smelly one than they usually are. From here there is an excellent view of the old monastery of Mont des Cats perched up on top of its hill. Back to BdeH.Q. and picked up Savage and then commenced our drive to Boulogne. We passed through Hazebrouck and St Omer and passed through very many villages full of Canadians.\n\n \n\n17\/10\/17 Boulogne\n\nEverywhere the maple leaf was much in evidence. Our car tore along and a cold biting wind made us keep our heads down rather than allow any admiring of the scenery. Outside St Omer on the Eublinghen side is an old mill tower which reminds me of Bishop Hatto’s castle. Just as we were about 30 kms. from Boulogne we ran into rainy conditions. The country hereabouts is very pretty and not much touched by the War. The road passes over high places and a wonderful scene is spread below – a gigantic basin of “lanscape target\" country all chess boarded and criss crossed by hedges. Not far out of Boulogne our rear axle went phut and we had to come slowly into the town. Put up at the Terminus hotel. There were many nurses about and it was very good to hear English voices. Booked up a room for the others but ascertained that there is a train for Paris at 9 pm.\n\n \n\n17\/10\/17 Boulogne\n\nHad a talk with the R.T.O and then returned to the hotel and a medium dinner. Caught the 9.5 train which was about half an hour late. You have to climb up into French trains as there are only platforms about 6 inches high. Travelled all night in the train and got a little broken rest sitting up. A compartment crowded with French officers and soldiers, hermetically sealed and all breathing & puffing heavily.\n","3":"\n\nReached Paris about 7 a.m. and collared a taxi at once driving to the Elysee Palace Hotel in the Avenue des Champs Elysees. Asked the cocher the fare and he fired the usual jargon of French numbers at me. Carefully gave him 4 francs and did not realise until inside that my huge tip must have been about 2 ½! The room allotted me was the same one as last year & recognising\n\n \n\n18\/10\/17 Paris\n\none who last time was foolishly lavish with tips, the femme de chambre and all her minions were lavish with greetings. Turned straight into bed and slept until midday. Had a dejeuner of café au lait and rolls before going out. Took the Metro. to the Opera and from there executed some purchases in the way of clothes. Paris is just losing her green dress and winter is commencing to walk abroad. The ladies are wearing dresses of dark material and seem just as charming as ever. Much glad eye about. The street crowd is a gay one. Many French officers in their red gold braided kepis with the Croix de Guerre and other decorations on their tunics. Now and then an “as\" passes in his airmans dark uniform. Children carrying the day’s supply of bread. Long rolls about a metre\n\n \n\n18\/10\/17 Paris\n\nin length. The policemen standing at the street corners with arms folded under their capes – persons of importance these and full of the dignity of office. The autobusses like juggernaut cars plugging along. The cafes with a dwindling outside crowd and the little cabarets with the inscription that the directory may be there consulted. At Brentano’s bought a map of the tube and some Xmas cards to send to folk at home. A few Australians in the streets more Americans. Servians Italians Russian and representatives of all the Allies. A few Portugese also. Everyone seems to have a temporary wife and two sirens were fastened on to two Billjims in the Boulevard des Italiens. There is a type of fat well-fed & dressed Frenchman who is the satyr incarnate. One sees specimens at intervals standing in\n\n \n\n18\/10\/17 Paris\n\nthe boulevards eyeing the passers by. Every “mutile\" of the war wears to double decoration of Crox de Guerre and Medalle Militaire as some slight compensation for his lost limb. At the theatre there is little doing. The Opera is closed, but at Opera Comique tonight is Madame Butterfly which sadly I miss. The Paris tube is an excellent institution and so well arranged as to make it nearly impossible for even the foreigner to mistake his train. The first class carriages are painted white and their Tate car like interiors are always full of a good looking and fashionably dressed crowd. The military element predomines in every collection of people. Came home to my hotel the Alma station being 50 yards from its front door. The crises of coal makes these places colder than in times past & hot water is not always on.\n\n \n\n18\/10\/17 Paris\n\nAt 5 o’c I met Ella and we spent quite a long time in conversation. At 7 I left to try and find the Rest. Margeraux renowned for its fish but got hopelessly lost after much vain voyaging in the tube. Ended up at the Café de la Paix and dined there deriving much amusement from watching the old bucks with their little bits of skirt – bad old devils who ought to know better. The girls are now wearing hats a la Americaine not at all pretty. Big cigars and powerful motors seem to characterize the army of the U.S.A. The waiters in these Parisian cafes are comic, and very amusing are the overseers usually shapeless and podgy with good living. The carving is done by them – a good carver saves much money to the firm.\n\n \n","4":" Paris\n\nAt 9 o’c got up and went round to the A.P.Ms office to report and then to a theatre office and booked up for some Opera Comique. To Cooks and made all inquiries re an Italian tour and then promenaded. The view looking towards the Opera in Avenue d’l Opera is very fine indeed and many are the magnificent buildings. Returned to the Hotel and met E. and her father and with them made the Bois. There the autumn has not yet smitten the leaves and it is still green. The crowd does not come out until 12. A few horsemen & women – some of the latter looked exactly like men as they cantered along. It was very beautiful among the trees and the people seemed to feel the freedom of the country. Returning we enjoyed the excellent view towards the Arc de Triomphe. Went for lunch to Café de la Paix and had a splendid dish of frogs served with vegetables.\n\n \n\n19\/10\/17 Paris\n\nFrom there by devious tube routes to the Church of the Sacre Coeur at Montmartre. Perched right on top of this historic hill it is reached by many stairs leading up to it and has a very Eastern mosque-like look about it. The climb made me quite puffed and the view from the platform was not too good owing to the mist which hung over the whole of the city. Inside it is new and gaudy in looks and a service commenced with much genuflection and candle lighting. A fat monk was preaching when I left. Back by tube to hotel and after a rest came down and met E. taking her out to 5 o’c tea. The way these folk discuss the demimonde is frank and amusing. Had some cakes and iced coffee. It was dark when we came out & walked back. This Avenue des Champs Elysees is most magnificent – at night full of lights.\n\n \n","5":" Paris\n\nHot bath. The water is on today. Went by tube to Concorde and did the gardens of Louvre & Tuileries but there was a heavy fog and they did not show to advantage. The flowers and fountains here must look very well in time of peace. The statuary as usual very fine. Passed through the courtyards of the Louvre to the church of St Germain from the tower of which sounded the death knell of the Hugenots so many years ago. Inside the old stained glass windows, a few worshippers and the smell of musty old age. Returned via the Grand Magasins du Louvre to the hotel and met. E. going for a walk up the Champs Elysees through the same places. Returned by tube and then went up to Webers meeting Padre Lamble Sandford\n\n \n\n20\/10\/17 Paris\n\nand others out in front of Maximes. The French have some extraordinary notions in the way of the beautiful in beards and moustaches and the most hirstute and ugly fat man generally owns the prettiest little girl. The average man of 35-40 here is unhealthy fat and runs to a big corporation. Dined a little too well and then went along to the Opera catching a taxi which ran me to the Saint Chapelle. Owing to it being dull the beautiful stained glass there did not show up well. Gained admission to the corridors of the Palais de Justice and saw the crowds of lawyers in black gown white bands and black hats pacing up and down in earnest converse with their clients on matters of law. Now to the Notre Dame which is\n\n \n\n20\/10\/17 Paris\n\nso dark inside. An old nun calling for doles for the poor and another holding out a brush of holy water for the fingers of the faithful. A dreadful cold and dark place to sit inside. In a place of such world wide reputation the Church of Notre Dame is disappointing in the extreme. Walked down the Boulevard St Michel a splendid street that is the main artery of this Latin Quartier and \na\ngained the Jardins du Luxembourg which is a great playground for the children who are there in crowds with their nurses. The green trees and terraces make a fine scene. Returned by tube to the Hotel just about dog tired and dead beat so had a lie down and a bit of rest. A strenuous business is leave! At 5.30 met. E. and left at 6.30 for Arrigonis where soup with poissons & spaghetti with a ¼ Chianti did not go too badly at all. Now\n\n \n\n20\/10\/17 Paris\n\nacross the street to Opera Comique where “Werther\" was being produced. A large queue waiting for the pit doors. Had a seat in the stalls – a fine theatre but nothing like as beautiful as the Grand Opera is. Exits and fire arrangements generally far behind Australia. I should fear a fire here. The music and the opera were both good but not anything like the other operas I have seen here. A pleasant polite audience. Returned home by tube after devilish wandering in all directions owing to being carried past my station. Dodged the usual crowd of girls looking for sleeping companions and turned into bed very tired just about midnight. A very full day with not a moment wasted from rising to returning.\n\n \n","6":" Paris\n\nBreakfast in bed and did not rise for bath until about 9.30. Feel much refreshed. Made the Champs Elysees. There were crowds towards the Bois walking up and down – the gayest dresses and uniforms. Nursemaids with kids, soldiers and officers of all the nations airmen and naval officers. Each with his lady – an animated spectacle. In spite of a chilly fog the ladies wear open necked dresses. Dogs clad in boots and rugs – ridiculous. Returned to hotel about midday and then went up to the Café de la Paix for lunch afterwards to the Opera Comique. “Amoreux de Catherine\" preceded the “Roi de Yys\" the music and acting in the latter very fine and much better than “Werther\". The excessive politeness of the French is very noticeable at a place like this – the bowing and apologies. The claque or paid applauders was very noticeable at the Folies\n\n \n\n21\/10\/17 Paris\n\nBergere the other night but not evident at the Opera Comique to any great extent. An undesirable custom. It was dark when the theatre came out. Returned to hotel by metro. And then made a long journey by tube on the map to locate the renowned Restaurant Margeraux in the Boulv. de Bonne Nouvelle. Found it and as it was rather early walked up & down the thronged pavement the electric lights showing green through the fog. Inside the restaurant the scene was very gay many Frenchmen giving their families their weekly dinner out. Some enormously fat men here in Paris mountains of flesh and stomach. Sole Margeraux is the renowned dish of this place and made the proprietor’s fortune. It certainly is very good indeed. Walked down the Bde. Italiens and returned home to bed at 10.30.\n\n \n","7":" Paris\n\nAbroad early and went to the Continental in quest of Rodda who had not arrived. Bought some bonbons and made some other commissions round the Opera quarter. Again a dull and foggy day. Found it quite impossible to buy any biscuits as they are not now made so one shopkeeper told me. Returned to hotel and met E. – together we made the streets looking at shops. She took me to a magnificent grocers shop – surely the most wonderful in the world crowded with people buying all sorts of things in jars and bottles. A loud vociferous crowd this. Returned to hotel afoot and then left for lunch at Henris with a list of his specialties. A fine place very chic – item 18 francs. Disgraceful in war time and quite inexcusable. Wandered round the Bourse and other places in the afternoon & at 5 o’c went out to afternoon tea at the Ambassadeur and it was very pleasant here. Item 6 francs. Now back\n\n \n\n22\/10\/17 Paris\n\nto hotel via the dark Champs Elysees and then per metro. To Bould. des Italiens for an outdoor dinner consisting of a lemon squash by way of reaction from Henri. \n\nReturned for a rendezvous but waiting miserably cold a long time. Cleared out at 10.30 getting a note from Rodda just on the death knock. By taxi to Gare du Nord and secured a seat in the Calais train by the kind offices of a busy cold footed redcap alert for a tip. Five days at hotel with breakfast 80 fr. Tips 18.\n","8":"\n\nTravelled all night and all day in various trains bored to extinction and at dusk landed back at Steenvoorde. Walked out to billets and found all well. 25 MM.s out of last stunt. The band played at dinner and it was good to see all the cheerful faces of the boys round the table – good chaps all of them. Busy writing all the evening. Leave for Rome is through.\n\n \n","9":" Steenvoorde\n\nRode into Steenvoorde to BdeHQ and arranged to leave for Italy tomorrow via Paris using General Smythe’s car. Came out to billets with Cols. James and Brazenor and we had coffee together in the mess. In the afternoon paraded the men who won decorations and addressed them. Also took the new young officers and gave them advice about their duties. In the afternoon later attended an excellent football match in which “A\" Coy played the rest of the Battalion. After mess Colonel Moseley came along for particulars of Rome &c. A cold blustery night. Sent Cawthorn in for my move order. Stewart & Kohn both off to Paris tonight and I expect to pick them up down there. Things seem now to be going well here and concerts sports football &c have roused the men out of their dopiness. During the evening move\n\n \n\n24\/10\/17 Steenvoorde\n\norder arrived and I decided to push off with Stewart and Kohn as the Divn. Car does not go until the afternoon. A wild blustery night for our ride to catch the 1 a.m. train at Goedensvelde. Handed over the command to Major Matthews and got my batman, youth called Mouldy, to pack up all my gear. Now look forward to a dreary 24 hours in the train.\n","10":"\n\nA dark cold ride along muddy roads practically running along the border of France and Belgium. Silent farmhouses treelined roads. Here and there a tent or camp. The flash of the guns was very vivid lighting up the whole sky. Sound there was none of any kind except the rough wind. Reached Goedensvelde station and entrained there after a wait of a couple of hours. Travelled all night in the train and reached Calais about 7 am finding an Officers Rest Club. A dreadfully\n\n \n\n25\/10\/17 Calais\n\ncold wind. Spent the morning up till noon here and then caught the Paris train getting good seats by tipping MPs. Had lunch in the dining car, served up well and quickly and spent the rest of the day mostly drowsing. The weather still bad and made the scenery uninteresting. Reached Paris at 9 p.m. and took taxi to Hotel Continental and got a room. Our old friend the hall porter was rather well oiled and confined his attention to giving particulars about the lack of hot water for baths &c and had less to say about the dangers of Paris.\n","11":"\n\nDid not wake up until 9 am & could not get a hot bath owing to the present restrictions. Went down and got a hot shave and hair cut instead. Met Rodda Stewart & Kohn – the former slept out last night!. Went the rounds of the Consulates &c for my passport. Used a taxi all the time and\n\n \n","12":" Paris\n\nranged in my travels from the Champs Elysees to the Palais de Justice. Had not previously noticed that on the rose window on Notre Dame’s front the foundation of the stonework is made to represent images. At the Prefecture of Police and at the various consulates other people were very busy with passports too. Returned to the hotel and taxied off to a little dinner party at Henris but only took a couple of courses and some frogs as the others wanted to visit the paymaster. Went to Cooks and arranged tickets and then to “Old England\" in Boulevard de Capucines and got a suit of civilian clothes hat shirt &c and a trunk. Came back again to the hotel. At this Continental now there are many officers, naval and military staying. We, down on a few days permission get no idea of the true Paris. All our\n\n \n\npaths lie in the flowery & rich places and we see nothing of the life lived by 99% of the people. One mile’s radius from the Opera covers all our travelling and knowledge and most who think they know Paris, “know\" London similarly – by an extensive acquaintance with Piccadilly. The Opera is the hub and the dominator of the city streets and catches and pleases the eye everytime we pass. LtCol Hon M.V.Brett was most aimiable on interview this morning and possesses a few decorations (including the Legion de Honneur) and Zena Dare for a wife. Today is a dull day & a little chilly. Went on a fruitless quest for the Elysee Palace – it was dusk and from here looking back towards the Place de la Concorde the sight was remarkable. This beautiful street all alive with the lamps of scores of taxicabs. At hotel donned mufti the first time for 3 years and felt very strange.\n\n \n\nThe ground floor is a grotto round which runs a stream with little rills of water. Really an extraordinary place. \n\nReached bed well after midnight. Up and had a hot bath at 8.30 and then went by Metro. to the Gare du Lyon to book my passage for Modane. The Metro. is one of Paris’ wonders, so clean and handy. Stewart and Co. are going out to Versailles today and have nice weather for it. The trees are losing more leaves everyday and by a fortnight’s time the aspect of winter should be all over the city. Went down to the Elysee Palace at 11.30 and met .E. Together we made the streets and went round shopping. Paris has an enormous stomach and morning is the time to see tons of foodstuffs ranging from fine wine to chestnuts changing hands. Grocery shops stocked full of all delicacies and discriminating buyers there busy. To Cafe de la Paix for lunch and then to Cooks and paid 1000\n\n \n\nfrancs for Italian trip, received all the documents and changed some money in lire. Went to Caserne Pepiniere and drew 200 francs of pay. A murky fog settled down on the city just after lunch and the air was extremely cold. The Elysee palace is most sumptuously decorated and has real Gobelins tapestries but during the War it has become more of a family hotel. The Continental is not by a long way so luxurious but is now better heated and being always full of a floating population the service is very good. Waste much money on leave, needlessly buying expensive food and travelling in expensive way. Will try plain clothes as an antidote to this but it seems to do a city cheaply one must know well so as to be at ease. Tips a sore point and one in uniform can risk no brawl or repulse no importunist. Some of the French Colonial Armies have great breasts of medals.\n\n \n\nA party of Russians at Cafe de la Paix at lunch. An officer aiguletted and wearing the Legion of Honour. All ate and drank voraciously & like pigs. At 5.30 went down to the Elysee Palace and there met .E. and took leave. Returned to Continental and packed. Everyone hanging round for tips in a disgusting fashion and palms had to be well oiled. Taxied to Gare de Lyon. At the Place de la Bastille an electric tram cable had blown out and blazes of electricity lit the whole place up for some minutes as bright as day. Got into the station & reported to the RTO then found the train and comfortable sleeping car. Had for companion a civilian going to Salonica. Some beautiful women to see him off. It is remarkable how these people perfume themselves. Slept fairly well in between the sheets though a little seasick by the train movement.\n\n \n","13":" Modane\n\nAwoke at 8 o’c to find myself well among the Alps and running down between Aix les Bains and Modane. The tops of the mountains had snow on them and parallel with the railway ran a river full of big stones – as far as I could make out the Sere. The route was very pretty as we ran through valleys and gorges, sheer heights going up on either side. On top of one snowy height was perched a stone building probably religious in nature. Came into Modane about 10 and changed trains there. An English RTO. and a naval and military staff. After leaving here we passed through the long Mt Cenis tunnel and on coming out found ourselves among enormous peaks and about 6 inches of snow on the ground. At Modane we changed to Central European train. Noticed here a soldier of the Bersaglieri with feathered hat. Just before going through\n\n \n\n28\/10\/17 Mt. Cenis\n\nMt. Cenis tunnel customs officials went through our baggage. The country now becomes very rugged we are travelling among high snow clad mountains with clouds scudding low past. There is thick snow everywhere but coming down a valley we seem to run out of it. The ground from now on was free from snow and we ran into a very precipitous gorge Le Sorgie where there were great views and narrow winding roads. Had lunch in the dining car and then ran into Turin. The people here hang their washing out on the balconies and it quite spoils the look of the houses. Even now one can notice an untidiness that you do not see with the French. The water power seems to be fully utilised and there are electric light standards everywhere. Found at Turin that we had a wait of 4 hours so went up the street for a look round. The streets are straight and wide\n\n \n\n28\/10\/17 Turin\n\nall the shops are arcaded. There are any amount of soldiers who look dirty and indeed many of the people look so too. Paris makes one critical. Walked down the Corsi Vittoria Emmanuel II to where there is an enormous statue of this gentleman and then round a square under arcades nearly all the way. Saw the Mt Cenis statue and got into a quarter with good smart shops. Cinema shows going and gendarmes wearing ordinary military uniform but 3 cornered cocked hats. Got into a church and found a priest preaching a sermon to a few people who were not too attentive. Wandered back to the train again. In the streets many beggars and old chestnut roasters. Left Turin at about 8.30 and wasted no time then in getting into bed. Slept well all night and did not wake until about 8 am to find ourselves running through flat dry treeless plains and\n\n \n","14":" \n\nclose to the sea. On consulting the map I recognised one island as Elba. Plenty of gum trees here and the landscape is not unlike Australia being mostly grazing country carrying scattered herds of long haired long horned cattle. The houses now revert to Egyptian style almost – finished are the thatched rooves of France. Here we have blank walls full of windows and tiled rooves. Outside the little station houses along the railway line we have swarthy towsled haired dirty looking females. Ran into Rome about 10.30 and at once picked up by Cooks people and taken in hand. A guide led me to a gharry and we drove round to Fontane to report to the Military office. Here was a collection of shaven monks and some priests. At the corner of the street are 4 fountains well carved & dating from 15 century. Spent some time with the passport people and then drove up to Hotel Regina passing several fine large public buildings & a couple of palaces.\n\n \n\n29\/10\/17 Rome\n\nRome seems to have any amount of people living on the church – monks of all kinds shaven and bearded frocked and unfrocked. After lunch went out with my guide and we drove to the church of St Peter in chains where is a wonderful statue of Moses by Michael Angelo. It is lifelike to the extreme and they say that the old sculptor, then 88, struck it with a hammer when completed saying “Speak!\" From here we could see a house said to have been occupied by one of the Borgias. Next pulled up at the Colloseum exactly like the pictures. An enormous place and still remarkably well preserved. It could seat 87000 spectators most of the marble facings have been stripped away but the masonry nobody could shift. The dens of the wild beasts, the prisoner’s cells and the underground passages still remain. Now to the Church of St Peter (?) without the Walls very mosque like and they did the match and alabaster trick. The front of this church is all gold mosaic work & very beautiful\n\n \n\n29\/10\/17 Rome\n\nIt was raining as we returned. Pulled up at the English cemetery and saw the graves of Shelley & Keats – the name of latter this wet afternoon was truly writ in water. To the Corso and there saw the enormous monument to Victor Emmanuel – a most imposing and enormous work. This quarter is very fine. Near here there is a fine fountain by MAngelo from which the waters of a very old spring issue. Near the Colloseum saw the triumphal arch of Constantine. Returned to hotel and then went out for a walk to do some shopping. Many altercations between cabdrivers. In the poorer parts both the houses the shops and the street crowds remind me very much of Cairo. The houses are ugly and the old bare wall type. Dined at hotel and feeling desperately tired, turned into bed early.\n\n \n\n29\/10\/17 Rome\n\nSaw also the Tempis Ercole an old Roman temple long supposed to be of the Vestal Virgins but now not so. A modern tiled roof. The gharries here have umbrellas fixed to the front seat and these cover the driver. The places seen today were S. Pietro in Vincoli, Colesses S. Paolo fure le mure Inglese Cimitero, Tempio Ercole\n","15":"\n\nIn the morning saw Pantheon Piazza Novona, Castel. S. Angelo. S. Pietro Pinacoteco Vaticiana. The column of Marcus Aurelius and the Forum of Trajan and its column. On both of the latter the Christians have taken down the old Imperial statues and put up their miserable Peter and Paul. The column of Marcus Aurelius is decorated all round with bands of carving in the marble. Awoke at 7.30 and had a very tiny breakfast and no bath owing to the heater\n\n \n\n30\/10\/17 Rome\n\nbeing out of order. Crowds of different people hover round here waiting on one. Went out to the Pantheon which is still magnificently preserved and has its big inscription to Agrippa still quite intact. Enormous marble pillars front the temple. Inside it has been converted into a Christian chapel and the Italian kings are now buried there. The dome is open at the top and rainwater comes through there to the floor beneath where an old Pagan altar used to be. A splendid old place. Drove to Piazza Novona where used to be an open air theatre, now it is all built round and two fine fountains play in the centre of the place. In the time of \nthe\n old it was the Circus of Domitian where contests used to be held. Drove now along a shaded street bordering the Tiber and stopped the carriage there to get out and have a look. On\n\n \n\n30\/10\/17 Rome\n\nthe muddy waters of the Father of Rivers there were patches of foam. On the opposite side rose the old Castel S. Angelo where Hadrian was buried. His coffin was taken away & is now used as a font at St Peters. The dome of St Peters rises in the distance and the Vatican buildings are beside it. Drove up to St. Peters the largest cathedral in the world –an impressive sight. Large collonades on either side. Entering we saw two great bronze doors filched from the Pantheon and re-decorated according to Christian ideas. The size of the place strikes one on entering and the amount of work put into the wall decorations – none of the bareness of St Pauls London. Went round all the tombs of the Popes where the statuary is wonderful and saw Canorus great lifelike lions. The paintings are also very fine and\n\n \n\nmany are all mosaic work and not painted at all. Under a huge canopy is St Peters tomb with 98 lamps always burning. Went right down into this shrine and saw the tiny box full of relics. Looked up into the exact centre of the great dome. Behind here is an altar with huge bronze and gilt figures. In this enormous place one loses all sense of size – a tiny dove has really wings 7 feet in length and a small cherub is really larger than any giant. A few black gowned shaven monks wander round sandal footed. It rained all the morning. Now to the Vatican picture galleries for a look round and saw Titians & Rafaels masterpieces – all very wonderful. The sentry of the Swiss guard wears yellow & black uniform and carries a pike. Saw also the Forum and Column of Trajan. The column is the original of that\n\n \n\n30\/10\/17 Rome\n\nVendome column at Paris. Bought a ticket for Carmen tonight. After lunch went up to the Quirinal hill and had a look at the Quirinal palace – an ordinary building. From here a good view is to be had. From here we drove down to the Baths of Caracalla, a gigantic mass of ruins. It is an enormous place of brick and the swimming baths and the different chambers are still clearly visible. The floor and walls were all mosaiced, and portions even yet are intact. The arches and high overhanging walls cannot fail to impress one. When it was in full repair it must have been a wonderful place. There used to be a stadium adjoining. Saw the place where the Rape of the Sabines took place and then set out for the Appian way and the Catacombs of S Calixtus.\n\n \n\n30\/10\/17 Rome\n\nOne was increasingly reminded of Egypt when going along this road by the appearance of the houses all stuccoed and with washed walls, by the bamboos and other vegetation, the smells, the little canals, and even by the many bullock carts driven by drowsy peasants. Some of the human habitations were not much better than pigstyes. We passed on this Appian Way many tombs one was of a brother of Caracalla who died by his hand. On top of another some workman has built his house. At last we came out on to a little place out on the Campagna and a monk gave me a taper and led me downstairs to the little underworld of catacombs. All the sides of the passages had been tombs but the bodies of most were taken away to the Churches about 900\n\n \n\n30\/10\/17 Rome\n\nwhen the vandals were about Rome. In others could be seen bone dust for in the damp air here the disintegration ought to be rapid, yet he showed me the body of a woman not completely crumbled and still with its black hair clearly visible. The lettering and the primitive carvings on the little slabs fronting the tombs are crude in the extreme. There are also many private chapels down here underground. We spent about half an hour down here and emerged into very nearly an Australian landscape. The country is open and in big grass paddocks with ranges of blue hills in the distance. It might have been a piece of the North Eastern district and the many gumtrees about made it all homelike. But the hills were the Roman\n\n \n\n30\/10\/17 Rome\n\nSabine and the Appenines and we were on the wonderful Appian Way. Drove back to town and then went afoot. Round the Cross the people were taking a great interest in new proclamations just posted up and evidently something to do with the War. The 4.30 Communique was feverishly awaited and heads could be seen bent over the papers in the cafes. The many fountains here diversify the streets. The trams seem good and generally round the quarter here it may be said to be a fine and beautiful city. The scaffolding is still up in places round the statue of Victor Emmanuel. They speak well of their King here. Bank of Italy has gardens in front. Waiters bow low. Went to Carmen at Teatro Cotanza 9-12.30. A fair performance. Unshaven actors but fine music.\n\n \n","16":" Rome\n\nEarly the morning was fine but later it started to rain heavily. Went first to Cooks to arrange tickets sleeping berth &c and then drove up to the Vatican. The Italians seem to favour the umbrella greatly – all the gharries carry one and itinerant vendors and workers set up big ones. The rag fair was in full swing under the shade of umbrellas. Passed the front of St. Peters and noticed the gardens of the Vatican on the way into the galleries. Saw the great paintings and tapestries, some of the latter by Rafael are magnificent. The Sistine Chapel was closed today owing the preparations for a big requiem for the late Pope but, after some trouble, a 5 lire note proved a good key and we got inside. At first one is a little disappointed but a few minutes are enough to show one that this is\n\n \n\n31\/10\/17 Rome\n\na very gem of gems. Over the altar is Michael Angelo’s last judgement – in one corner is the object of a papal secretary with asses ears for prudery. The side walls are also painted. The roof is the most wonderful part of the Chapel and the figures stand out in the painting like statues. You can see the figures apparently standing feet out of the ceiling but really all is flat and it is all painted. In a hall not far from here is a picture of the Christian religion taking the place of the Pagan. Viewed from whatever side you get the Cross on the same angle. Passed through room after room of peinture to the sculpture galleries. Here are the relics of the decorations of many an ancient house. All are figleaved and some have even had garments of \n\n \n\n31\/10\/17 Rome\n\nbronze added – just because we are so much more civilized than their barbarian makers! Here there is a statue of Diana seemingly on the point of movement. The Disc Thrower, The Lacoon, The Appollo Beveldere, several Venuses and a lovely bust of Antinous and also a full sized statue of him. The expression on these is such as to make one go back for one more look. Praxiteles is also represented here by various works. There is also a gladiator scraping himself. Viewed from the left he is sad, in front quite satisfied and as you walk round to the right a broad smile seems to come on the marble face. Saw also Rafaels Transfiguration and many pavements from old palaces. Frequently through the streets we come on fountains both old & modern – some very elaborate & large\n\n \n\n31\/10\/17 Rome\n\nAfter lunch drove up to the Forum Romanum. The approach hereto is through squalid and old quarters and one sees that the two little pieces of slate for public urinals are quite usual. The Forum is an oblong place full of ruins in the midst of many buildings. In the distance rises the Colosseum. On the side we entered is the Tabellerium . The old arches, the pillars and the ruins are partly overgrown with green grass and trees have now been planted among them. To tread the Via Sacra, to stand near the Rostrum, to see the temple and abode of the Vestals – these are not things given to everyone. The pavements were trod by the mightiest soldiers and some stones are even yet marked where the mob played their games of chess or of draughts. The old drain leading to the\n\n \n\n31\/10\/17 Rome\n\nCloaca still is standing. From here we went out to a place the other side of the Tabellerium and there saw some gigantic statues recovered from the Forum. Also one of Marcus Aurelius riding. In a cage here they have a live wolf and in another some eagles. Now drove to the Hill Janiculum and got a magnificent view from its top. The whole city is spread beneath and its 7 small hills were pointed out. Through all wanders Father Tiber, beyond the city walls stretch open fields and grassland with the towering Appenines bathed in afternoon sun for a background. To their right are the Sabine hills and then the Roman Hills with their 12 white little villages. We returned by a road skirting the Vatican gardens and reached the fine Cavour square. The driver put me down in the Corso gay with\n\n \n\n31\/10\/17 Rome\n\nits afternoon pleasure and shopping crowd and from here walked home to the Regina Hotel. After dinner went down past the Quirinal to Pension Boos and towards the Apollo variety hall but did not go into either of them in spite of their vaunted charms. Walked up and down the street watching the people – in the cafes. Theatres and shows do not commence here until 9 or 9.30 and finish after midnight. The gendarmes seem to be always in couples and look as if they have stepped out of a romance of a hundred years ago, wearing their long black capes and their 3 cornered hats. The fountains of Rome seem to be numerous and good and are always playing both by day and by night. Sweet peels of bells ring out from old churches at every hour and the quarters. Until late at night the cries of vendors come from the streets but none can compare with the man with the papers whose “Italia! Italia\" is loudest.\n\n \n","17":" Rome\n\nA lovely day. Left the hotel at 9.30 and drove to the station to catch the train for Naples. The Italian soldiers all wear capes and many officers carry their useless swords. At the stations baggage is handled by women porters and it seems strange striding along behind a woman carrying one’s baggage. There are some English M.P.’s and other Tommies – all fit and capable. It would be interesting to know the number of “A\" class men on these jobs that could so well be filled by older men. The third class on this Naples train is very dirty and the workmen a most motley & dirty crowd. Had a good journey down passing through mountainous country part of the way. Long after we left the environs we could see Rome stretched like a map below us and the dome of St. Peters stayed in sight until distance made it fade away. Passed Capua and the\n\n \n\n1\/11\/17 Naples\n\nriver it is on and reached Naples at about 3.30 being duly met. The first thing that arrests attention is Vesuvius on the crater of which was hanging a large white fleecy cloud. Right up this and the other mountain sides are scattered white buildings in clusters and alone. Naples was enjoying a holiday on account of All Saints Day and many people were in the streets. Drove to hotel and then went on up to the hill near Bertolinis hotel to get a good birdseye view of the city. From here the isle of Capri is in full sight and the whole city lies beneath on the shores of the beautiful bay backed up by Vesuvius and the high hills. The city is a crowded one, full of quaint crooked streets and smells. The goat and cow owners drive their beasts round to the customers and sell them milk. Nothing I have yet\n\n \n\n1\/11\/17 Naples\n\nseen reminds me more of Cairo. There are the same open boothy shops and the sellers of all kinds of odd foodstuffs. There seem to be thousands of kids here and hundreds of little babies. The latter all look happy and their mothers lavish kisses on them. Some of little girls are very beautiful even if ragged. Every child seems to be taught to beg from the start and carries a small cardboard box, even while at play, which it thrusts forward to the chance passer by. On the other hand old age here must be hard. Poor wrinkled old women with leathery skin mumble toothlessly outside their dwellings and the poor tottering old man gets many a bump from passers by. The Castel Nuovo is a big place with two round towers and is now used for barracks. The entrance archway is very fine. The main street is the\n\n \n\n1\/11\/17 Naples\n\nVia Roma and a fine long street too. Went to the Cathedral of St Januarius and walking into the old church saw the font where Constantine was baptised – a circular stone well. In this church is kept the sacred blood of St Januarius which performs to miracle of liquefying thrice a year. The air here was full of fumes of incense. Here and there in the streets are little shrines usually with a candle or other lights burning and passing men take off their hats. My old guide and the coachman were constantly touching their hats. Many stop and cross themselves and pray. Returned to the Hotel du Vesuve. Just in front is the sea front and the old Castel dell Ovo now used as a military prison. My guide is very devout but nevertheless was most solicitous that feet should not stray on flowery paths under anyone less capable than him!\n\n \n\n1\/11\/17 Naples\n\nAfter dinner went up to the Via Roma by train and found the street full of a crowd walking up and down. Many of the shops were open. The chief Mecca of the promenaders was a big arcade in which are many cafes and good shops. There was also a string band playing and people of the better sort evidently put in most of their time walking up and down. The beggars are dreadful. Two poor little boys about 6 – one crouched asleep against the wall on the pavement, the other, blind, sitting silent with his poor little sightless eyes and small face turned up towards Heaven. In out of the way places round corners and up side streets sit these poor devils of all ages clamouring for alms. The inhabitants quarrel a lot among themselves and exchange blows with sticks and fists accompanied by a great deal of tongue thrashing – just like the Gyppies!\n\n \n","18":" Naples\n\nA little rain this morning and an overcast sky. The Castel dell’Ovo spoils the outlook from my window across the Bay. Vesuvius this morning is dimly seen through mists and the slight winds have roughened a little the waters of the roadstead. Went about 10 a.m to the Museo Nationale and saw the Drunken Satyr, Farnese Bull, and many other masterpieces. Many of these have come from Herculaneum and Pompei those from the former have been turned black by the action of the lava and those from the latter have been turned green by the same agency. They also have many marvellously fresh paintings taken from the house walls and also some masterpieces of the middle ages. Admission was gained to a locked room where obscene but beautifully artistic articles and pictures are kept. The glass and earthenware of ancient buildings is preserved\n\n \n\n2\/11\/17 Naples\n\nand also the jewels and toilet articles some of which are lovely pieces of art. Went up to the station about noon and could not help noticing how much the donkey is used here and what queer contraptions they have in the way of carts. The Neapolitan conscripts are kept waiting their drafts in big barracks and are taken for the Army amid the deepest lamentations of all their kin. They are despatched secretly at night for the front at irregular hours. Noticed a clamouring mob of women round some food vendors near the Municipal offices. Left for Pompei by electric tram which has no less than 23 stopping places en route. As we went along an excellent view was to be had of smoking Vesuvius on one side and of the Bay, Capri and Sorrento on the other! The line runs among intense cultivation\n\n \n\n2\/11\/17 Naples\n\nconsisting of vegetables and vines. Crowds of people have lately been coming to Venice from Padua and other places affected by the enemy advance. Today was dull and the place did not look its best. Reached Pompei about 2 and sat down to lunch in the restaurant at the station. Had just commenced when music broke out behind and I found 2 boys standing there with guitars or piccolos and they sang and played right through the meal. Passed through a turnstile into the village which is just like one expects after seeing so many photographs of the place and reading so many books about it. The pavements of the streets are worn into ruts by the traffic and the streets are well laid out & narrow. The house of the Vetti is well preserved and really even now\n\n \n\n2\/11\/17 Naples\n\nmust be very like it was 2000 years ago. The portal painting is libidinous and encased in wood of which the guardian has the key. The garden is extremely pretty with its original fountains and statuary still in position. The dining and other rooms are well decorated and painted. The wine shops, bakers ovens, and brothels are still plainly visible, the latter having their emblem outside and the pavements of the streets bear phallic symbols pointing in that direction. Inscriptions and scribbling on the walls are quite plainly visible and the dog and “Cave Canem\" are on one doorstep. The Forum and Theatres are interesting. The public well has its marble worn smooth where people drinking used to put their hands when leaning over. In a small museum are the casts of bodies just as they fell and many\n\n \n\n2\/11\/17\n\nhousehold articles such as bread fruit, rouge &c. Six or seven plain skeletons lie in one place. A feeling comes over one that this is holy ground and the eyes have only to be closed to imagine robed figures gliding along and the full tide of life 2000 years ago, now once more flowing. The hills rise sharply from here – Vesuvius and other peaks and the villages cluster on the hillside. In the temple of Isis saw the image and machinery by which fraudulent priests made it roll its eyes and talk. Returned to train and to Naples. It was raining as we drove through the streets full of animated crowds and bright lights. A thousand odours assail the nose and all sorts and conditions of people pass and repass on the footways and on the road. At the Vesuve dined well.\n\n \n","19":" Naples\n\nCalled at 6.30 a.m. bathed and breakfasted. A sunny morning which made the mists rise. The waters of the bay very calm and blue and the city lying fresh and white curved round it. A column of sailors passed with a band marching badly. Little carts drawn by donkeys passed their driver cruelly beating them. Left the hotel at 8 a.m. and drove to the station about half an hours drive through the rough lava paved streets so full of the picturesque crowd. Put into a uniform I would not fancy these people as fighters. Got a good seat in the train and travelled up to Rome again being impressed with view from the train as it passes through the hills – the Eternal City dominated by St. Peters lying spread out in the far distance. Went over to Cooks and then put in the wait of a couple of hours by taking a walk round the streets. About 4 oc crowds of people began to gather about the square near the station & Diocletians Baths and about\n\n \n\n3\/11\/17 Rome & Florence\n\nhalf an hour afterwards a great funeral drove up. First of all policemen cleared the way and then came a band wearing helmets drooped with black feathers and playing a funeral march. Then came banners and members of different societies – much chattering & laughing – these people love a spectacle. Then a gilded hearse covered with gilded angels weeping, drawn by 6 black horses with nodding feather plumes and driven by the damnedest old pirate that ever stepped out of “Treasure Island\"! Gold laced coat breeches cocked hat and a perruque. He kept urging his horses on and exchanged occasional remarks with the crowd. I think the funeral was that of a deputy who was assassinated the other day. They pulled up near the station and the coffin was evidently being taken away somewhere by train. Left Rome at about 5 and had\n\n \n\n3\/11\/17 Florence\n\nhad a good journey to Florence having for company three Italian officers who are very ceremonious in their greeting of each other. Got into Florence about midnight, and no one meeting me, felt very strange and solitary. However spied a fly and it ran me up to my hotel, the Grand Hotel Baglioni, which is not far from the centre of the town and the station. They were full up but my room having been reserved ensured me getting in. Apparently a good big and comfortable place. In most of these hotels there is someone who speaks English and everywhere French is well known. Today has been an exceedingly pleasant mild sunny day and tonight is very agreeable. A good bedroom with a bathroom opened off from it and a double bed.\n\n \n","20":" Florence\n\nA lovely day. An old man called as guide and proved very good being an Englishman. Went first to San Lorenzo church the front of which has never been finished. Inside a mass was being said. Saw some statues by Michael Angelo. The cloisters open into a pretty garden where many cats used to find a refuge until they became too fat and people ate them. Entered the Mausoleum of the Medici – a truly magnificent place lined with the most costly mosaics. The whole decorations consist of small pieces of precious stone let in – coats of arms &c just as if they had been painted. Walked up to the Palazzo Vecchio and found some of the statues here sandbagged up in case of air raids. In this square is the spot where Savonarola was burnt – a circular bronze slat marks the spot. The copy of Michael Angelo’s “David\" is here. Saw the Loggia\n\n \n\n4\/11\/17 Florence\n\nder Lanzi. Went into the Galleria degli Uffizi and saw many great paintings by Rafael, Rubens, Titian &c. In sculptures saw the Venus de Medici &c. From the windows here a fine view is obtained of the River Arno and its bridges and of Beatrice and Dante’s walk. The Ponte Vecchio is an old bridge built all over with goldsmith and jewellers shops. Saw the Cathedral which is entirely faced with marble. The dome is very large being little smaller than St. Peters at Rome. A service was being sung while we were in. Went across the street to the Battistero and there saw a christening in progress. All the infants have to be brought here. The two bronze “Gates of Paradise\" were walled up but we saw one a little inferior. The ceiling is all gold mosaic work and rather crude. The campanile of the Cathedral is also marble encrusted & very tall\n\n \n\n4\/11\/17 Florence\n\nThe Church of Santa Croce is the Westminster Abbey of Florence and is an old barnlike building. Here are the tombs of Michael Angelo, Machiavelli (whose residence also is still intact) Rossini. The Palazzo Pitti is an enormous place and contains the Pitti Gallery. Went in here and saw more great masterpieces in painting and in statuary. Being Sunday there were crowds in through here today. Afterwards took a stroll in the sun through the fine Boboli Gardens which are very extensive and go round this Pitti Palace. At 4 pm went to “Faust\" at the Pergola theatre – a long performance not finishing until 8 pm. The music was good and the acting fair. These Italians are given to spitting rather disgustingly at all times and places even at the dining table.\n\n \n","21":" Florence\n\nGot up at 4 am to catch the early train for Milan. This Hotel Baglioni is most comfortable and luxurious and fairly full. In Florence at the present time are a good number of refugees from the territories most near to the war zone. The question of tips in these places, when one does not know the language, is rather serious. One is helpless and there are so many who assist. Fortunately a few pence often suffices. If going early the day concierge takes care to wish you a pleasant journey the night before! In case he does not see you again. The scenery after leaving Florence was very good but interrupted by constant tunnels which left the windows blurred with steam. The mountains here are rugged and high and beautiful views disclose themselves. Ran into Bologne on time seeing a number\n\n \n\n5\/11\/17 Bologne & Parma\n\nof British Tommies there. Later we passed French troop trains. The country in Tuscany is well cultivated and the vine is trained into growing trees. Haystacks often have a live tree for their central support. Parma has a number of perfumery factories. The Italian passengers were all of a good class and seem unreserved. The whole compartment soon becomes engaged in full conversation and the gesticulation is so excessive as to be amusing. The habit of spitting so common among the men is rather disgusting and they are by no means pretty eaters. The train commenced running late and was overcrowded. The War traffic becomes thick on the lines as was evidenced by the number of trains passed and the nature of their freight. Reached the crowded station of Milan at about 5 pm.\n\n \n\n5\/11\/17 Milan\n\nand went to the Hotel Metropole. A splendid city and I was chagrined to find it necessary to leave at 8.30 in the morning. The city appears the best I have seen in Italy so far. The Cathedral is a most beautiful place built nearly entirely of marble pure white and a mass of graceful pinnacles, each of which has its statue, big or little according to its size. The whole effect is one of lightness and airiness. These plains and cities of Lombardy are rich and would be great booty places for an invader. This is the most populous town in Italy. After dinner went out to have a look round and also to have a look at the Cathedral by moonlight. Unfortunately there was no moon and a rising fog. In front of the Cathedral is a very busy train terminus and centre. The rapacity of Continental hotelkeepers is almost beyond belief.\n\n \n","22":" Milan\n\nGot up early and found a dull foggy morning, the grand Cathedral towering up in the half light. Had a breakfast of cafe-au-lait and rolls at a little restaurant & found, when finished, that the light had much improved. Went inside the Cathedral but would say that it needs a strong bright sunny day to make it look its best. Large columns line the aisle. The shape of the church is a distinct cross and over the centre is a large dome. Directly beneath the floor here is a shrine and tomb of Saint Carlo much patronized by praying folk. In two side chapels masses were in progress. But the charm of the edifice is in the exterior – the pure white marble, the countless pinnacles and the statues. Could not go up to the roof owing to it being so early. Walked through the Galleria Vittorio Emanuele which is a big arcade with fine shops and leads through to the Piazza della Scala. The Scale theatre was in use for Red cross work. Came round now to the\n\n \n\n6\/11\/17 Milan\n\nPiazza de Mercanti which is a quaint old mediaeval place and surrounded by ancient buildings. Owing to the early hour could not go out to see Leonardi de Vincis “Last Supper\" but returned instead to the Hotel where I settled up and took a bus for the station. Left in the 9.20 train & changed back into uniform the first time since leaving Rome. The country between Milan and Turin is much like portions of France, intensely cultivated and well irrigated. At Turin found quite a small military colony – the Prince of Wales, Painleve & Lloyd George are a few of the heads who have been here lately. A number of French officers about too. Had a good run to Modane passing through magnificent Alpine scenery and had a quick run through the Mt Cenis tunnel. At Modane got a sleeper and M.P.s & others nearly killed themselves doing things for me all on the chance of a tip. Bad news today & flocks of French Alpini going through.\n\n \n","23":" Modane – Paris\n\nSlept badly in a bunk in a sleeper all to myself and woke up to a dull morning near Sens 50 miles from Paris and a fine large town. The country bears the touch of winter now – full rivers and sluggish stream & bare trees. Passed through the great forest of Fontainbleu which looked very beautiful with all the autumn tints on the leaves. Pulled into Paris at 9.30 and I found that I had got up an hour too early owing to not changing my watch back an hour at Modane where Central European time is left behind. From the Gare du Lyon taxied to the Continental for a shave and then went down to the Elysee and got a room. Raining like the deuce. Went up to the Opera and to Lloyds Bank to change some lira but not being a customer they would not do it for me so had perforce to have recourse to Cooks and lost very heavily as Italian exchange is all to blazes. Went down to\n\n \n\n7\/11\/17 Paris\n\nHotel de Ville by tube and then walked round Notre Dame and the Margaux to the Tour d’Argent in Quae Tournelle for one of their celebrated ducks but they only serve to couples, so made an excellent lunch other how. Noticed the Frenchman’s charming habit of kissing his girl at the coffee stage quite regardless of anyone else present. Just when the wine warms his viens – a nice custom. From here went round to the Bds St Germain & St Michel – marching on the map – on down to the Luxembourg Gardens now full of dead leaves and almost deserted today on account of the wet weather. Went into the statuary museum full of the most perfect white statues artistically arranged and also saw some of the paintings. Rodin’s statues are very fine indeed. Took the tube at St Germain-de-Pres and came back to the Opera House. Did\n\n \n\n7\/11\/17 Paris\n\nsome shopping thereabouts and walked down to the Madeline tube station. Returned to hotel (now much warmer and cheery than last month and had a long wait for nothing before going out to dinner. Was in plain clothes and strolled round the Bourse before going to the Bde de Bonne Nouvelle to the Restaurant Margaux where the “sole marguery\" was as usual quite excellent. Tete a tete little parties here and perfume. Walked slowly down the Bd. Des Italiens to the Opera. Here were people sitting in the phonograph shops listening to music by telephones. Pavement strollers casting their meshes round for passers-by. Old men with young pretty girls – money covers all! The front tables outside the cafes are now quite deserted and the nip in the air calls for greatcoat. Returned to hotel being tired with this full day and turned in about 10 o’c.\n\n \n","24":" Paris\n\nDid not rise until 8.30. There is now hot water every day and all day here. Went by tube, in uniform, to the Gare du Nord and took ticket for Calais tonight. Returned via Gare d’Est and there found a woman run over and the trains dropped. She was tangled up in the machinery but still alive and making much noise. The fire brigade sent a part to get her out. A whitefaced crowd – but as a Frenchman said to me “Life is cheap these days\". So I left with him and he directed me to a tram that ran me down to the Opera. Bought some papers from the old woman at the corner kiosk of the Bde. des Italiens and then walked down to the A.P.M’s office. Took tube at the Tuileries and was back at Alma by 11.30. The Elysee is quite full of people and tres chic. For lunch went up to Cafe de la Paix and had a light meal. Then took tube at the Opera for Chateau Rouge and walked from there “marching on the map\" to the Church\n\n \n\n8\/11\/17 Paris\n\nof the Sacre Coeur. It was not the best of days for a birdseye view but better than last visit here. The whole city lies spread below and strange to say it is from this distant place that one receives the best idea of the grandeur of the Eiffel Tower. This enormous church itself, with its Oriental looks, does not appeal to me much. Inside a service started, a priest leading recitation of the Rosary. Now passed down the long stairs that lead from this high hill. Near the bottom sits a dirty long grey haired old man with a cockatoo – he was there last time and apparently does not move all day. What an existence! Took tube at Les Abbesses back to the Opera and went down to Brentanos for a book. Where is there a street to match Avenue de l’Opera? From Tuileries came by tube back to the hotel. The Paris tube is wonderful and today and yesterday has carted me many miles from one end of Paris to the other.\n\n \n\n8\/11\/17 Paris\n\nCleanliness, rapidity and frequency are features of the trains and the directions and indicators are so plain that no foreigner can go wrong however little he knows Paris. Went for dinner up to Arrigoni’s and had some jolly good Chianti. My alert friend the garcon is still on the old job and a fine smart chap. Here is a little word of comfort and unconventionality. You take two hours over dinner, reading the papers, or talking to a girl, nobody takes any notice of anyone else. The cost of a meal is very moderate and you are not hurried away because here is a place away from the rush but yet always full and lively. Took a walk up and down the lighted boulevards afterwards then back to hotel. Left there at 10.50 by taxi for Gare du Nord & went shrewd on tips. Secured a seat in the train – all the carriages heated and warm but look forward to travelling all the night long.\n\n \n","25":" Calais\n\nHad a fairly comfortable \nable\n night and slept sitting up. The countryside looking very green and comfortable. Trucks of sugarbeet going from the sidings. Reached Calais about noon and then sent a signal wire for the mess cart to meet me at Poperinghe at 6 pm. Calais is to all appearance the most bleak and uninteresting of coastal towns and Belgians and Flemish (people dull of feature and of tongue) infest it.\n\nIn Rome and other parts of Italy noticed the manner in which the cloak is thrown over one shoulder in an enveloping fold instead of being allowed to hang down. About all these people retain of the ancient grace and dignity of the toga! Had lunch at a little place close to the station which was not so well patronized as upon my last visit here. Left Calais at 1.20 and had an uneventful run to Hazebrouck where changed trains for Pop. Ran into Poperinghe at about 6 o’c and there found the messcart waiting. Enemy\n\n \n\n9\/11\/17 Poperinghe\n\nplanes must have been about as many searchlights were focussed just about the town. The flashes of the guns announced the presence of War once again. Drove for 2 hours along rough dark roads with lorries, limbers and motors silently passing. Men trudging on in twos and threes. Occasionally a flare across the sky as some dump catches fire. Pulled up at a hut where the QM.s stove is located and soon got settled down with Miles and the others. Mud and cold everywhere. A few shells screamed overhead towards Belgian Chateau but they appeared to dud owing to the wet ground. Thewlis came staggering in about 9 o’c deluged in mud whitefaced and shaken having been blown up by a shell when going along with the packs & rendered unconscious. Got him put to bed and he soon recovered. This is a change from Rome and Paris! Slept well except for the detonations of a big gun which shook the hut like a drum\n\n \n","26":" near Ypres\n\nA cold wet day very raw & nipping. Mud & dirt everywhere. Stayed indoors and read and wrote letters. Up the line the battalion is in support and is having a quiet time about 4 casualties up to date. Eitelberg, one of our originals, who was posted to the 23rd. was killed on reconnaisance. Today we had charcoal braziers for the first time. At dawn there was a hop over somewhere on our right and the big guns were active thumping away at distant targets. Our chaps have been doing good work in the way of bringing down Taubes or keeping them up at a respectable height by their bullet barrages. Some Australian mail came in today. A dirty life this after being on leave. Food covered in black smuts from charcoal fire served up by dirty unwashed servants. Really we have some villainous looking devils in the AW.\n\n \n","27":" near Ypres\n\nAnother sloppy day. The Battalion comes back from the line this morning the relieving Tommies going up in daylight. Five Taubes came over about 10 am & dropped a number of bombs. They make very skilful use of the clouds. Antiaircraft guns and m.g’s opened intense fire. Moved down to another camp about noon near Ypres and preparations were there made for the Battalion coming out of the line. The whole campsite was filthy dirty & muddy and the huts unlined & cheerless but they will seem like Paradise to the men from the line. They began to trickle in after lunch and everyone was down by dark and making themselves at ease. We march 10 miles tomorrow to Wippenhyoek. Our casualties this time very light – one Corpl was killed coming out.\n\n \n","28":" Ypres & Wippenhoek\n\nEarly reveille and turned out on the march at 8 a.m. Traffic was tremendously congested with transport and troops and our progress was very slow in consequence. Fortunately the day was fine and sunny but the march was hard on the men’s tender feet. The wet has played up considerably with the boots. On the route we marched past General Birdwood who had a few things to say!. Got the “oil\" that we are to have 3 weeks out of the line and the quiet trenches afterwards. Reached tents and hut billets at Wippenhoek (just inside France) and got all settled down fairly comfortably for the night. All in fair heart after last trip up the line but Italian news is far from cheery and inspiring. Night fell very early and was cold and dark.\n\n \n","29":" Wippenhoek\n\nA dull grey and chilly day with the sound of a raging and unceasing bombardment from the front. 400 of the men bathed this morning at Houpoutre. Thewlis applied for Paris leave and Abercrombie returned laden with the regimental typewriter. All the Caestre people including some officers from the now defunct 6th. Division turned up and rejoined. A terrific bombardment raged until well after dark.\n","30":"\n\nPresentation of medals by General Birdwood. A messed up parade on Brigade’s part. After lunch a conference at Bde full of wrangles!. Rode home through the dark along silent roads in a misty rain. Padre to hospital.\n","31":"\n\nRaw cold day with early twilight. Pay day. Sports in the afternoon provided some amusement. Now have officers definitely in charge of sports canteen reading rooms &c. Leon Barbier called on a visit. Amusingly downhearted about La Guerre.\n\n \n","32":" Wippenhoek\n\nAnother grey dull day. James came over for some Courts Martial and stayed to dinner. During the morning specialist training but we blew “dismiss\" when cold rain started. Cleared up after lunch for tug of war and other sports including horse & mule races. Some of these provided much amusement. Looking round from here the country is seen flat and with a few scattered farms surrounded by trees now bare of leaves. Should be rather pretty in spring but now it is a typical old world winter scene. A few of our planes circling round. Pay was issued yesterday and the usual waste in drink takes place for a couple of days and they then go poor for the rest of the month. Recommended Bunning for an instructional job at a School\n\n \n","33":" Wippenhoek\n\nHalf holiday. Some good tugs of war. Had a conference of company commanders. Cawthorn unwell. A bleak day.\n","34":"\n\nUp early and got all preparations in train for our move. Cleaning up camp. Dark clouds like approaching snowstorms. Ammunition crackling merrily in the incinerators! Left at 12 \na.m.\n and had a good march along fair roads passing through Westoutre. Before coming into Locre we pass through good country and over one prominent ridge with woods and a windmill on the top. Here there is a water storage reservoir and pumping plant. Tommies and Jocks passing – some extra clean transport. Locre a small village undamaged and neat, one of the few left in Belgium. Outside the Mairie flies the national flag. The peasants all in Sunday clothes and wearing their sabots or wooden shoes. Got into camp about 4 p.m. a fine comfortable camp about 2 miles out of Locre. Our doctor Stevens back from leave.\n\n \n","35":" Locre\n\nBusily engaged all the morning on the improvement of the camp raising duckboards &c and drainage and by lunch time had the job well advanced. There is much danger of fire in a place like this. Military labor is a most wasteful thing. Alderson & the padre got away on leave the former to Paris. After lunch football matches were on the board – inter company goes. General Paton came round and inspected our lines. By 4 p.m. it was nearly dark. Dull grey clouds very low, bleak bare trees, a ground mist rising and a raw cold striking through one. Such is the outlook in this part of Belgium on an afternoon at the beginning of winter. It is pretty country in the spring but now is the time one’s thoughts turn to sunny southern climates. Great keeness on the part of our guards just now and much practice to be good. Long and cheerless evenings these of winter! Lecture after Mess.\n\n \n","36":" Locre\n\nMore improvements to the Camp and salvage work. Specialist raining went round and spoke with those engaged at it. Magazine filling against time causes some interest. Their parade ground is on a hillside with copses in the background much reminiscent of the woods of the old Marquise at Flessells , Somme. Made an inspection of the huts with the Orderly Officer and the doctor and was met in the middle by Norman & others. After lunch the afternoon was devoted to company sports and games. The peasants round here put liquid sewage on their fields – a dreadful stench. Most people here speak quite good English their own language being not dissimilar. Great swank and ceremony tonight at the guard mounting parade. The band sergeant lacks energy & requires constant prodding.\n\n \n","37":" Locre\n\nA wet and drizzly day. The morning was utilised for the purpose of sewing tabs & buttons on greatcoats to keep the flaps out of the mud. Specialist training was also in progress but there was a lot of loafing and the conditions of the camp in general was not good and warranted my getting the company commanders up and giving them a talking to. After lunch there was a football match played in the mud and the dark and weeping skies cast an early darkness over the scene. Am sending the Band sergeant & Burrage over to England for fresh band instruments and hope for more music out of the band then. Rode down to Locre at 6.45 for dinner with the General. The three other Colonels were there but there was a lack of vitality about it all. The G&BM are off on leave in the morning early which probably accounts for it. \n\n"}}