{"Document Name":{"0":"Diary_0407","1":"Diary_0407","2":"Diary_0407","3":"Diary_0407","4":"Diary_0407","5":"Diary_0407","6":"Diary_0407","7":"Diary_0407","8":"Diary_0407","9":"Diary_0407","10":"Diary_0407","11":"Diary_0407","12":"Diary_0407","13":"Diary_0407","14":"Diary_0407","15":"Diary_0407","16":"Diary_0407","17":"Diary_0407","18":"Diary_0407","19":"Diary_0407","20":"Diary_0407","21":"Diary_0407","22":"Diary_0407","23":"Diary_0407","24":"Diary_0407","25":"Diary_0407","26":"Diary_0407","27":"Diary_0407","28":"Diary_0407","29":"Diary_0407","30":"Diary_0407","31":"Diary_0407","32":"Diary_0407","33":"Diary_0407","34":"Diary_0407","35":"Diary_0407","36":"Diary_0407","37":"Diary_0407","38":"Diary_0407","39":"Diary_0407","40":"Diary_0407","41":"Diary_0407","42":"Diary_0407","43":"Diary_0407","44":"Diary_0407","45":"Diary_0407","46":"Diary_0407","47":"Diary_0407","48":"Diary_0407","49":"Diary_0407","50":"Diary_0407","51":"Diary_0407","52":"Diary_0407","53":"Diary_0407","54":"Diary_0407","55":"Diary_0407","56":"Diary_0407","57":"Diary_0407","58":"Diary_0407","59":"Diary_0407","60":"Diary_0407","61":"Diary_0407","62":"Diary_0407","63":"Diary_0407","64":"Diary_0407","65":"Diary_0407","66":"Diary_0407","67":"Diary_0407","68":"Diary_0407","69":"Diary_0407","70":"Diary_0407","71":"Diary_0407","72":"Diary_0407","73":"Diary_0407","74":"Diary_0407","75":"Diary_0407","76":"Diary_0407","77":"Diary_0407","78":"Diary_0407","79":"Diary_0407","80":"Diary_0407","81":"Diary_0407","82":"Diary_0407","83":"Diary_0407","84":"Diary_0407","85":"Diary_0407","86":"Diary_0407","87":"Diary_0407","88":"Diary_0407","89":"Diary_0407","90":"Diary_0407","91":"Diary_0407","92":"Diary_0407","93":"Diary_0407","94":"Diary_0407","95":"Diary_0407","96":"Diary_0407","97":"Diary_0407","98":"Diary_0407","99":"Diary_0407","100":"Diary_0407","101":"Diary_0407","102":"Diary_0407","103":"Diary_0407","104":"Diary_0407","105":"Diary_0407","106":"Diary_0407","107":"Diary_0407","108":"Diary_0407","109":"Diary_0407","110":"Diary_0407","111":"Diary_0407","112":"Diary_0407","113":"Diary_0407","114":"Diary_0407","115":"Diary_0407","116":"Diary_0407","117":"Diary_0407","118":"Diary_0407","119":"Diary_0407","120":"Diary_0407","121":"Diary_0407","122":"Diary_0407","123":"Diary_0407","124":"Diary_0407","125":"Diary_0407","126":"Diary_0407","127":"Diary_0407","128":"Diary_0407","129":"Diary_0407","130":"Diary_0407","131":"Diary_0407","132":"Diary_0407","133":"Diary_0407","134":"Diary_0407","135":"Diary_0407","136":"Diary_0407","137":"Diary_0407"},"Date":{"0":"unknown","1":1147.0,"2":1148.0,"3":1149.0,"4":1150.0,"5":1151.0,"6":1152.0,"7":1153.0,"8":1154.0,"9":1155.0,"10":1156.0,"11":1157.0,"12":1158.0,"13":1159.0,"14":1160.0,"15":1161.0,"16":1162.0,"17":1163.0,"18":1164.0,"19":1165.0,"20":1166.0,"21":1167.0,"22":1168.0,"23":1169.0,"24":1170.0,"25":1171.0,"26":1172.0,"27":1173.0,"28":1174.0,"29":1178.0,"30":1179.0,"31":1180.0,"32":1181.0,"33":1182.0,"34":1183.0,"35":1184.0,"36":1185.0,"37":1186.0,"38":1187.0,"39":1188.0,"40":1189.0,"41":1190.0,"42":1191.0,"43":1192.0,"44":1193.0,"45":1194.0,"46":1195.0,"47":1196.0,"48":1197.0,"49":1198.0,"50":1199.0,"51":1200.0,"52":1201.0,"53":1202.0,"54":1203.0,"55":1204.0,"56":1205.0,"57":1206.0,"58":1207.0,"59":1208.0,"60":1209.0,"61":1210.0,"62":1211.0,"63":1212.0,"64":1213.0,"65":1214.0,"66":1215.0,"67":1216.0,"68":1217.0,"69":1218.0,"70":1219.0,"71":1220.0,"72":1221.0,"73":1222.0,"74":1223.0,"75":1224.0,"76":1225.0,"77":1226.0,"78":1227.0,"79":1228.0,"80":1229.0,"81":1230.0,"82":1231.0,"83":1232.0,"84":1233.0,"85":1234.0,"86":1235.0,"87":1236.0,"88":1237.0,"89":1238.0,"90":1240.0,"91":1241.0,"92":1242.0,"93":1243.0,"94":1244.0,"95":1245.0,"96":1246.0,"97":1247.0,"98":1248.0,"99":1249.0,"100":1250.0,"101":1251.0,"102":1252.0,"103":1253.0,"104":1254.0,"105":1255.0,"106":1256.0,"107":1257.0,"108":1258.0,"109":1259.0,"110":1260.0,"111":1261.0,"112":1262.0,"113":1263.0,"114":1264.0,"115":1265.0,"116":1266.0,"117":1267.0,"118":1268.0,"119":1269.0,"120":1270.0,"121":1271.0,"122":1272.0,"123":1273.0,"124":1274.0,"125":1275.0,"126":1276.0,"127":1280.0,"128":1281.0,"129":1282.0,"130":1283.0,"131":1284.0,"132":1285.0,"133":1286.0,"134":1287.0,"135":1288.0,"136":1289.0,"137":1290.0},"Entry":{"0":"\n\n","1":"\n\nAnother book is to be inflicted on those who would dare to read this stuff unreadable as most of it is by reason of the writing & lack of news.\n\nWe all wondered this a.m. if Johnson got away last night as he did not come back we presume he did so.\n\nWill Fryill again we are indeed a small family with plenty of work & few to do it.Still it keeps us cheerful that is the main thing.\n\n'No mail for you\" is the title of a poem in the orderly Room & it truly expresses the average Billjims opinion of the mail service & it is about right.We are all getting restless again hope some mail will soon come.\n\nIt still keeps cold & I do not envy Johnson his crossing today.\n\nThe Colonel looks fit& well after his trip.\n\n\n\n\n\n\n\n\n","2":"\n\nWe have had more snow & tobogganing was all the rage today.I was upset for the first time. Came off when we were doing 30 miles per hour on the hard hard snow.I was number 4 thanks to the quantityof room taken by Curley,had about ¼ square inch in which to sit.\n\nWhen I found myself squatting in the half frozen snow I had to laugh at myself asthe big fat roundO'B fell off his slide about 20 yards away ½a minute later I had to laugh aloud.\n\nThe slide is no respector of persons & does not for aminute consider your dignity nor appearance.\n\n\n","3":"\n\nA little bit warmer in the sun today than any we have struck for the past weeks. But out of the sunshine it is mighty cold.\n\nI went along with the C.O. tothefront lineC.C.S.sat Varennes. The noise up there was absolutely deafening. These 3 C.C.S.s are close together closer than almost any with the exception of 2 A.C.C.s but these places are more exposed. We attended a meeting of the 5th Army Medical Society. While there we found out that the noise of guns was due to an attack tonight by 63rd Division (R.N.D.) . They are after a big trench & without doubt this will be the coldest night engagement our chaps have had.\n\nThe noise & the appearance of the frontline is unlike we ever can imagine & I am glad I was able to get up close.It must be seen to be believed.\n\n\n","4":"\n\nA big Victorian mail came in last night but not a particle for me.\n\nFriday however I had my revenge for this morning. I had my second parcel from Edna a beautiful iced Christmas cake which arrived absolutely intact. As she had sent it for the mess the C.O. immediately started to say things.\n\nWrote my mail this afternoon.\n\nTonight quite unexpectedly I got the remainder of my mail and two wopping parcels from home.\n\nHowever they think of the things I hardly know but if they knew the absolute joy of receiving them they would be more than happy. We live like kings. The socks and the leather jerkin & cap makeme so comfortably warm that I feel I could stick this climate any old time. A night invasion by the Canadians into our mess. What a crowd they were. Begrudged them every minute they stayed here because they greedily\n\n\n\n\n\nate my cake & not only that but my precious mail had to wait while they lingered on & on enjoying themselves.\n\nHeard a whisper tonight that U.S.A.had declared war but cannot believe it. They are \ntoo proud to fight\n.\n\n\n\nFebruary 5th\n\nYes it is true & America is in with us. What does it mean? Will Germany throw in the sponge? Can she now fight the whole world for I believe allthe other neutrals with the possible exception of Switzerland will come in.\n\nThis much I pose thatif thereis any peace treaty it will be signed in Switzerland.\n\nI feel so keenly about it & I feel that it will not be long now before we go home that I wrote to Mum & Dad & to Edna.\n\nWe anxiously await tonights papers putting last nights news we also wonder what will happen next. It looks as if Germany will violate Dutch territory. She must have food. It took America 2½years after the Allies practically to the day in thestate of war commenced at 11 o'clock","5":"\n\n\n","6":"\n\nThe C.O. was away all day today having a conference with the D.M.S. . We waited late dinner for him & werejolly pleased. He came back greatly bucked.\n\nWe are to move and right up close to the front about 2 miles away from Albert & less than 2 miles away from Buirewhere there is always an Australian Field Ambulance.\n\nIt will be great too for we are in the Anzac Corps.\n\nWe truly are fortunate for the 3rd Division is away up north & not likely to meet them for which in a way we are not sorry.\n\nThe news about America is still exciting our attention & sooner or later it looks as if a declaration of war will come any moment.\n\n\n\n\n\n\n","7":"\n\nThe Colonel was off betimes this a.m. for he is to spend the day with the D.M.S.inspecting our new camp site. Strange to say it is a place with an English name Edgehill while around it are all French villages\n\nWe may probably remain at this spot only a couple of months althowhen the big advancecomeswe want to go right up to Miraumontnow in German hands.\n\nCertainly it looks as if weare the pet show of our D.M.S. and I quite saw that anything our C.O. is asking will be granted by the D.M.S.\n\nI am finding that my string of patients is gradually getting longer and longer and I am afraid that I shall be the best known Australian in these parts.\n\nI wish however I did not speak the lingo for they have me and no one else.\n\n\n","8":"\n\nThe dismantling of our camp started today just about 4 months after our arrival in this delightful spot.\n\nWhere we are going is in the slope of a hill which slopes in 2 directions. A railway siding is right alongside of us& we shall be the nearest to this railway. We are to take in all kinds of cases & we are to be ready within 14 days \"if it thaws\".\n\nHad a long letter from Whiting today. He says that Langevacuated himself with a dilated heart. He is having a pretty hot time in his advanced station. I do so hope that he will be able to rejoin us when Page goes out. He has met General Holmes about New Guinea. Had letters also from Charlie Kater& Arnold Tuck. Both Guys are very well and anxious to meet me as I am them.\n\n\n","9":"\n\nOur poor old camp is getting more & more dismantled & it is hard to realise it is the old camp of say last Sunday. We got all our men back yesterday & for the first time since we left France we are an united unit.\n\nWe have sent out advance party to prepare the camp but after 25 days of continuous snow & frost the ground is absolutely unworkable & we cannot get on with the work.\n\nTonight we had a surprise time, mail & my whack of it was a huge bundle of papers and two letters from home. Everybody else got a big budget of letters but as there were about mails from Australia within 20 days we can expect letters any old time.\n\n\n","10":"\n\nWe are going along famously with our moving but up to date they have been able to do nothing at the other end. We do not know now when we shall move & for myself I am not sorry.\n\nWe are all a miserable lot of fellows with the silly old Somme cough. Twenty nine, all the patients of both places & ourselves, have this wretched cough. You just go ahead coughing for almost 10 minutes without any result. The head lifts off & falls down again & we feel about 90 years old. Sent off some pcs today saying that we were moving in case anyone turns up.\n\nAm afraid Scotland will not see me for a couple of months. If I can get there when it is warmer I shall be quite happy but then will be the spring offensive & herewill be \"hafoo\".\n\n\n","11":"\n\nWe handed over to 29 C.C.S. yesterday so today inmany many weeks we hadan absolutely free day.Intended I would get off all the letters I owed but with a thousand & one interruptions I was hardly able to get off any. It is always the way I find still I did write a few & was thankful.\n\nWe invited over the officers of 29 at leastthe old ones whom we knew first & had dinner together but the beggars seemed so loth to leave so that it was nearly midnight before their C.O. realised it. Then to make matters worse Page started speaking to me ofhome life, it was 2 a.m. before I put out my lamp.\n\nI had spent a couple of hours in the dentists chair previous to this so you can imagine I did not feel very cheerful. It was great to go to bed knowing I had not to get up early.\n\n\n\n\n","12":"\n\nI thought I would have to go to the new camp today but was agreably surprised to find I will again go to the dentists instead. How we all look forward to going to the dentist.\n\nTook a pitiful farewell of all my patients all of whomseemed jusst a alittle bitsorry I was leaving & the greater bulk of them were mighty surprised when I refused to take any money for treating them. It appears that the French doctor is paid as soon as he visits. Alas for them. Still when I said 'Cane fait rein ' they looked open eyed & afterwards smiled. I had all sorts little children old men and young girls and aged women. They said they would never forget the Australians & I really believe we left a good impression in this place among the civiles as they call themselves.\n\n\n","13":"\n\nLeft Gezaincourt with Henleyat 11 a.m. and after going through Raincheval, Warloy, Henencourt& Ribemont ,eventually we arrived at the site of our new camp Edgehill. We were absolutely famished it was ½past four before we had a bite to eat. However the segeants of the 13th C.C.S. were mighty good to us & put their mess at our disposal & we soon made short work of our food. Henley was feeling mighty seedy so I packed him off to bed. We were given empty double lined tents which the old unit had been unable to take away owing to the frozen state of the ground. They are quite the most comfortable and cosy tents I have ever slept in. I walked all round & inspected the mess& saw what work was being done. The cold wind and the severe cold made me thankful we did not come here a month ago & glad I am that the winter is practicallygone. I was so fagged out tonight I fell sound asleep and knew nothing in a few minutes.\n\n\n","14":"\n\nA bright sunny morning. It was quite a change to wake and find the sun shining in through a tent door. This was never possible in our submerged valley at Gezaincourt.\n\nHad a good look right around the camp. It is almost an ideal spot. We are on a slope which goes right down to the railway line but it is so gradual that it is almost unnoticeable when walking up. I am quite sure we shall be a good deal more fit than we were in our old camp.\n\nAll the water here is frozen hard and it is quite amusing to see the water fatigue carrying great blocks of ice which we have to melt with steam from the Cooker.\n\nThe C.O. Page & Padre McAuliffe arrived here last night. Received a parcel& newspapers from home & some papers from Edna but no letters.\n\n\n\n\n\n\n","15":"\n\nA beautiful clear day. Up betimes and working hard. We get full value of the sun here for which I am mighty thankful but the wind is bitter.\n\nTaubes were over this morning & this afternoon. There are anti aircraft batteries all around us & the air is simply a mass of fair white puffs wherever the airships are.\n\nIt must be mighty uncomfortable to have these shells bursting all around.\n\nWent with Page this morning down to & across the Ancre which is about ¼mile from the camp.\n\nHad a good survey of the camp with the C.O. & suggested some alterations. Fairly good news today with regard to the submarine campaign although it hurts a bit to read about the sinking of the Afric.\n\n\n\n\n","16":"\n\nThis place is a delightful boghole these days from about 10 am to 4 & then it starts to freeze again. Luckily for us the wind has dropped & we are truly thankful. The old sun isvery cheeringbut we want the thaw even although the may be totally unlike any mud we have ever seen before. Sawthe engineer lieutenant& got him to get ahead quickly with the erection of our Nissen huts. He is a fine boy named Naylorattached to the Anzacs. He played representative cricketfor Lancashire. Poor chap hehas a bad heart & I recommended him for evacuation. Page has been over to the Rest Camp near us partner & found out Charlie Perkinson was there, also Joe Metcalf. It appears as if the C.C.S.around us arefull of but I am delighted to say I know none of them.\n\nThere is a big strife coming off in a day or so & I am detailed for 45 C.C.S.\n\n\n\nFebruary 17th\n\nHad a fairly busy day today. Padre McAuliffe & self instituted ourselves an officers fatigue & spent the afternoon humping duckboarding up to our lines. Just as we had finished afternoon tea received news that 45 C.C.S. wanted us to start helping them. We waited till after dinner & then went over about 8. \n\nEach C.C.S. is taking hafooand then knocking off. First of first Smith Medladsfinished about teatime & then 45 started.\n\nJust as I was about to push off Padre Muschampblew in from leave. We all fell on his neck with joy. We expected Johnson would be back but we had no news & neither did he.\n\n\n\nFebruary 18th\n\nGot back from 45 at 5.30 a.m. was sound asleep by 6 and slept away merrily till 11 a.m. Got up & then started at 11.30 to work again. Stuck it till 1 p.m. Cameover for lunch & then had a little more rest. After 4.30 we started again & worked on steadily till 7.30 p.m. Came over & had dinner & then wentback alone at 8.30 to work steadily on. I was surprised how fit I felt & feel that with just a few hours sleep I can do quite a lot. \n\nHave heard conflicting stories of the strafe but apparently it has been successful. Would like to see the official bulletin but our papers are coming a day late getting no London papers at all. First mail has started to arrive & we now hope we shall get it fairly regularly.\n\n\n\nFebruary 19th\n\nI slept in this morning till 11 a.m. although I had breakfast at 9 a.m.We finished up the job at 4 5 at midnight.We had 95 major ops & there were two tables working the greater bulk of the time and we were able to do95 ops in that time.The time wasted in the place is awful. Work started at6 pm","17":" & finished at midnight 18-19. That means each op took an hour. But the lack of organisation in that unit is criminal. I consider that in our unit with a staff of 4 we would have cleared up that job in 18 hours.\n\nWent with the padre for a walk toBuirewhere the AnzacRest Station is situated. Saw Charlie Parkinson & MajorLaws.\n\nRoad frightfully muddy but feel I was due for the exercise after the time we spent in the theatre.\n\n\n\nFebruary 20th\n\nA quiet day today.Padre Muschampand I walked down to the Anzac Corps Rest Station just for exercise. Met Charlie Parkinson looking fit & well & wearing the Military Cross ribbon.\n\nHeard that Phil Parkinson had the misfortune to take malaria as soon as he landed in France and has been there ever since.\n\nHad a letter from Charlie Kater today saying he was back with the Battalion. He was sorry he missed the famous stunt of the 13th. It appears the 17thwere sent to do a job got it in the neck and had to retire. Then the old 13th came along cleared the Bosches &held it. Charlie said they expected at least 1V.C. & numerous other honours & thought his chums would get one. Charlie says his opportunitywill come another time.\n\n\n\n\n","18":"\n\nIt is raining at last the first time since some days before Christmas. We do not mind this however because it means that we shall have spring with us in a few weeks.\n\nThe ground now is just as soft as it was hard a few days ago so soft in fact that the ground will not hold our tent pegs they pull out.\n\nPage & Smyth have been away working at M.S.M. today.\n\nHad an invasion this afternoon of the","19":" F.A. Majors Macartney & Laws & Lieut Wheeler.\n\nIt is good to see all these chaps.O'B & I were warned tonight to be ready for another heavy time after they are to attack again very shortly. We toddled off to bed early.\n\n\n","20":"\n\nA squelchy foggy day but a day of good cheer.Had a perfect invasion of Anzacs & we really feel that we are among those we know.\n\nHad a visit from Doc Harris who went through with me at the shop.Heard that Billy David was \nkilled\n with the Highland Regiment.Harris is with 2nd Aust F.A. temporarily attached to","21":" S.M.D.\n\nPoor old Johnny Smyth has go the mumps &was sent off to No 3 C.C.S.at Puchevillers.It is truly a wretched complaint for he feels fit& well. I wrote to his sister asking her to cale his wife. \n\nI have heard stories today from all sides which have cheered me meekly with regard to the way things will go for us very soon. It does look as if the next 6 months will be mighty good to us. After all Kitchener may not be far out.\n\nHad no mail for two days.Boulogne is closed.\n\n\n","22":"\n\nTruly it makes all the difference from a social point of view where we are located. Henley today had to go to Anzac engineers to find out about some things we urgently require when he ran across a mess mate of ours in the old days in Melbourne. He is in charge of all outdoor engineering work and controls a small army of Boche prisoners.Lt Granbers told us that Cedric Whiting met four ex-members whom unfortunately we had to leave behind in England, was just a few miles further on so he decided on the spot to ask them to come along to mess tomorrow night that was ifGranbers could see Whiting. In these days of so called thaw precautions we are mighty handicapped for practically nothing but light ambulance & horse run vehicles are\n\n\n\nallowed on the roads & so we are dependent on the kindness of G.S. Waggons of friendly Australian F.A. for all our things.Our ambulance has to be used by the C.O. to stir along things at H.Q. Truly the Colonel deserves the greatest praise for all he gets us for he is so persistent that the Heads treat him as the unjust Judge did the woman in the parable.\n\nWe moved in to four double lined tents today & at present I had to share a nissen bow hut with Henley. Later on Fay & Johnson will probably come in. Would give a lot for my old tent but it will beavailable for we are very short of tents & need all the bell tents for personal & isolations.\n\n\n","23":"\n\nEveryone today is working at full performbecause up till a late hour this evening the silly D.M.S. wanted us to open tomorrow.That however was utterly impossible & we told him so & in his largeness of heart he decided to let us have two days now.You should just see our camp.I believe every third fellow in the unit must be a carpenter. At least it looks so.For the past few days there has been a very heavy mist & all the time vague rumours are going about that the Germans are on retreat way back past Bapaume.At any rate oneof the objectives of last Saturday's attack which was no timefell into our hands today with very little opposition.Then it is believed there probably Some that awful place which has held up our attack since July 2nd will fall too.\n\nWhiting & Granbers to mess & all merry. Whiting looksfit & we were delighted.\n\n\n","24":"\n\nWe are getting some glorious days now but the roads are in such a bad condition we can do very little towards helping the good work of the camp.\n\nToday I had a visit which made me very happy for Charlie Kater & his friend MacDowell came into the mess. I had heard they were just a couple of miles away & sent a message by Major Fletcher that I was here.Charlie is still the same old quiet boy who takes on everything.MacDowell is modest and talks just a little more.Charlie was proud that Mac had the day before got the M.C. for splendid work done in offensive by the","25":" Charlie was sorry he was not in it but he was away at a school. Iwalked nearly back to their billets with them &left them with the understanding that they would come again soon.\n\n\n","26":"\n\nFurther news from Johnson says that he is to go before a medical board which means that probably he will not join the unit for months if ever.\n\nHad a nice note from Lang today telling me that he was being boarded to Australia as permanently unfit. Its mighty hard to think a fellow of 27 develops a heart which will always be a source? of anxiety for him.He was always so well & fit except for the time in Egypt and the early days at Larkhill.It seems mighty strange that all four of our captains have been hit with serious sickness since the unit arrived in this side.I did not think that O'Brien would outlast the whole lot of them.Major Fiaschi & Capt Evans both of NSW joined up today to help wth the heavy work.\n\n\n","27":"\n\nToday the old D.M.S. wanted us to take a hut as the 45 & 1\/1S.M.D. were not nearly full. They pulled up & told us that we would not need to take it till tomorrow.\n\nEvery one of us here does fatigues & it is mighty good of them to see officers & men bending their backs trying to help in the good work for us & shall most certainly have totake on tomorrow & there are scores of things to be done. The C.O. is not being helped very much by outside calm & so it makes it doubly hard.\n\nWe are to take in all sorts of cases &do as best we can with them. Everyone is keen for work but the manual labour is a delightful change after so much indoor work. Started letters to Mum & Dad & to Aunt Bessie but the Lord above knows when I shall finish them for I get mighty tired.\n\n\n","28":"\n\nTwo months of the New Year gone & what have we as a unit done.Certainly we treated a few sick men & no wounded but now we start a new life in one of the most important positions on the Western Front. We got orders from H.Q. that we must be ready tonight although the C.O. said he would require 10 days, tin heads have given us 6. At any rate we are game & sincewe had to be for we took in tonight for the first time inless than 4 hourswe had 4 of the most serious type of case mainly two wounded abdomens.\n\nPage& I worked on solidly till 8.30 doing a 17 hour continuous sitting with 2 tinybreaks for meals. More than¾ ofthe cases are our boys very brave they are, but they are even much more serious than any cases we had at Gezaincourt. I am writing this the next day.\n\n\n","29":"\n\nWhat an auspicious start for the month the papers announce this morning.\n\nFirst there is the magnificent response of the British people to the War Loan over £1000 million pounds being raised,then comes the news of a probable big retreat even further back than we first anticipated. It looks probable that the Hun will go right back to the orginal Hindenburg Line by the line of strongly fortified towns which are close to the border of France, Lille Douai Cambrai and St Quentin. Then lastly there is the splendid news of the fall of Kut-el-Aman and all it means to the tottering fall of Turkish power in the East. Our troops will now dash in for Bagdhad & the others will come in from Egypt towards Beersheba & the Mohammedan will quit the Holy Land district for ever.\n\n\n","30":"\n\nThis is a day for straightening things out & really we feel we want it for after doing about 55 or 60 ops in 36 hours, there is just a little work in dressing and sorting cases, in making up stocks and seeing that everything is all right. We heard this afternoon that we shall probably have to take intonight late & as I have been O.M.O. since 9 a.m. it will be just my luck to do this night stunt.\n\nWe did a few minor ops this p.m. & while we were at them Humphrey Lloyd one of the chaps who used to be in my year & now in R.A.M.C. came along to see John Smyth & was delighted to find that he had not come in vain for he saw me & that was a little compensation for not seeing Jack. Truly this move to this spot is quite the best thing that could have happened to us. Received the first edition of our Austn mail & a parcel fromLucy Lack.\n\n\n\n\n","31":"\n\nWe were at it strong all day today. I was O.M.O. till 9 a.m. & then had to continue on duty till 7 p.m. so great was the rush of cases. I had practically no time to write any letter for the whole of this week & I do not know what I can do unless the C.O. relieves me.\n\nThe O'B was doing O.O. but as the cases were so big & serious he had to go off to the theatre & work to relieve the pressure.\n\nAt 7 o'clock the C.O. said I must knock off & get to bed so I did but I had to write a few lines home & to Edna for the mail closes at midday tomrrow.\n\nHave not seen a paper or had time to look at one today.Had a small evacuationof ,I admitted 3 Australian officers today none of whom I knew.\n\n\n","32":"\n\nWakened up about 8 a.m. today after a most refreshing nights rest the best and longest I have had during the past week. It is a wonderful thing to think that after good sleep the whole outlook on the world is totally changed. I hardly know how I got to bed last night because I felt too tired to even undress. I wrote a few lines to Edna & Mum & I was ashamed to send the letters for it looked as if I have been so neglectful.\n\nReceived the rest of my Australian mail with the exception of the papers which are still at the P.O. awaiting transport.\n\nHad a visit from Harry Rowell of Adelaide who is an R.M.O. with A Battalion. He looks mighty well.\n\nWent off duty tonight at 7 pm after having been on continuous dutyfor 34 hours\n.\n\n\n","33":"\n\nThis morning when we wakened there had been the biggest fall of snow since we came to France fully 4 inches laying on the ground. It is not a bit cold & it looks ridiculous to see a real spring sun shining and just a little bit of warmth in it.\n\nHad a very big evacuation nearly 200 leaving us.This afternoon the beautiful snow picture had almost disappeared and the land just looked a squelchy bog.\n\nReceived a letter from Miss Smyth in reply to one I sent re Jack. Have had no word from Laing so presume he has left for Australia poor beggar.\n\n\n","34":"\n\nA day of slush and muddy water for the sun shone brightly and before noon not a flake was left everywhere. The melted snow was lying as water on the surface. I had a fair take in and we have been busy right through the day and it will probably be till the early hours of the morning. Nil of importance to report.\n\n\n","35":"\n\nI have been wondering why Charlie did not come over again to see us but a letter from him today tells me he is in charge of the Amiens picquet, a mighty responsible job I should think considering the size of the place.It was good to think he was living at such a decent hotel for he has had a mighty rough passage all the yearsof service. To live in a big hotel is a mighty change after in their unclean billets and muddy trenches. I should dearly love to get along to Amiens & may be able to do so on one of our off days.\n\nWe might be able to have that deferred dinner which we promised one another when we met way back in Liverpool 1914.\n\n\n","36":"\n\nCapt Page is beginning to get matters for me, have now started the 2nd week in March the time he was promised relief this week.\n\nThe political news from Australia about the double dissolution both state & federal houses deciding to close up shop & stump the country has helped him to be more unsettled because he is a keen politicianand wanted to have a finger in the pie.\n\nWe are all mighty glad & feel that whatever the outcome the political atmosphere will be cleared & we shall get a Government more fitted to carry out a national policy.\n\nHad letters today fromJohn Arnold back, he is very well.\n\n\n","37":"\n\nToday has been a good day for us & we are very happy because old Johnnie Smyth returned from his trip in isolation with mumps. He looks mighty thin but is otherwise well and glad to be back with us.He told us that Keith Whiting got 3 weeks sick leave after mumps but he did not want any & was only too glad to be back at work.\n\nHeard fairly definitely that Johnson will not return to the unit. Fay is to take his place and I think he should do pretty well as a sort of adjutant.At any rate he will have plenty of work to do.At present every ward is full.\n\nColonel Newland of South Australia whoseH.S.I used to be at the Children's late tonight Page.It does seem strange that after 3 years or more I should once more work with a man whoseH.S.I used to be.\n\n\n","38":"\n\nCapt Page is all excitement today because he is going back home.He expected to move off but was surprised when he found that red tape had to be set working. Howeverthe C.O. is doing his best and that will help to push the wheels.\n\nWrote to Dick Jenkins & Arnold Lack, Johnnie Smyth & the O'Brien went to Amiens today.I wanted to go pretty badly but there was too much work here.\n\nGot a today to say that a man named Kelly was coming to our unit apparently to take the place of Johnson so it will be Goodbye to Willie the Hun and all he stood for. He is the third officer of our small unit to leave us within the first year.\n\n\n","39":"\n\nReceived the Australian mail today just a nice littel packet for me. Wrote to Mum Phyl & Edna.\n\nThis afternoon I went with the C.O. & Colonel Newlandto Corps Headquarters. This is in a very big chateau supposed to be a replica of Versailles.The grounds are likewise laid out with avenues & woods as there but the whole thing is a cheap imitation of the real thing. In addition no attempt is made to copy the fountains of Versailles. Still to see such a place in such a locality of tiny& rather dirty villages was a great surprise.\n\nWent along with the C.O. to one of our and saw quite a lot of fighting fellows in it. Wassell is C.O. Kennedy, Roy North, Whiting, Kirton & Browne are all Sydney men and there is the one M.O. & the quartermaster who came from somewhere else.\n\n\n","40":"\n\nOur busy day.\n\nReceived the rest of my Australian mail with the exception of one letter.\n\nThe news today from all fronts decidedly good.Heard tonight that Baghdad had fallen for which the Lord be thanked.\n\nThe fall of Irles yesterday & the capture of 300 prisoners at mighty little loss likewise good reading. Had a visit from Capt Page's brother who was decidedly optimistic.He is a splendid fellow.It was most fortunate too because Capt Page left us tonight at 9.30 p.m. and his brother arrived to see him at 6 pm.\n\nI had the most awful attack of nostalgia I have had since I came on service. The fact that Page was actually going home to Australia and might possibly see or at least ring up home,I wanted to go too.\n\n\n","41":"\n\nA fairly quiet day.\n\nCleared the hospital as far as possible this afternoon after a fairly strenuous morning.\n\nThis afternoon went with Fay to the Anzac workshops and also to Meaulte and Albert.\n\nFiaschi & Evans replaced by Kirton and Willard.\n\nGot Henly to get me a little birthday present (3 spoons) for Mum. Heard that our 2nd division had taken trenches making the holding of Bapaume practically impossible for the Germans.\n\nTruly the good news which comes to us from day today is very reassuring.Our casualties are so high.The Hun withdrawal certainly delays our offensive but still considering we lose no lives it is well worth while.\n\n\n","42":"\n\nI was O.M.O. which is a fairly light job.\n\nHad a visit from Padre Edwards who came over with us on the Buda. He is C of E chaplain with 4th Divn Artillery & he told me he would see Arnold Lack's O.C. to see if it would be possible for dear old hipto get over to see me. At present they are about 8 miles from here but as I have no transport it would be easier for hip to come to me.I can just imagine the joy of Best &the girls when we do meet.Padre Edwards is always as good as his word although he tells me that where they are at present they will only remain a very short while.\n\nReceived the last of my Australian letter mail today but no papers. Capt Kelly J.P. who has relieved Johnson turned up today so that means goodbye to Willy the Hun.\n\n\n","43":"\n\nOur take in today.\n\nWhat a locality this is for meeting M.O.s whom I know.\n\nI have just cast around in my mind & find that within a five mile radius there are men whom I know to the number of 20 or more & that without any mental effort or feat of memory. Probably if I knew the names of the battalion M.O.s Iwould know a good many more.\n\nToday Arthur Wilson & Harry Purcell came along while I also had an unexpected & welcome visitor namely Stanley Walker of Ballarat the boy who was a 1 pip sub in the \"C\" Coy A.N. & M.F.F. & who was my pal in the New Guinea show. He is now a captain D.A.C. with the 4th Division. Still the same clean old chap & quite like old times to yarn with him. Hope to see him again soon if we can work it.\n\n\n","44":"\n\nAfter a fairly heavy evacuation Fay and I took the afternoon off & went over to the Anzac workshops & to Albert. The Anzac shops are well worthy of a visit & reflect the greatest credit in Grimlees. He is a sterling good chap & my got to know him pretty well at Larkhill & at the Domain.\n\nHe is a Scot but a good Australian in spite of only being in Australia 3 years. Heard a wild rumour this morning that the Madonna had fallen from the Cathedral Notre Dame de Brebieres but we saw it & it is still in the old position. Our men are within 800 yards of Bapaume & the Germans appear to be evacuating the place & making a very feeble attempt at resistance.\n\n\n","45":"\n\nSt Patrick's Day the first anniversary of the formation of the unit andthe brightest Spring Day we have had up to date.\n\nPadre Colonel and Fay to Amiens.\n\nNews flashed through this a.m. that Bapaume has fallen & for this we are all thankful.\n\nThe 5th Division (8th Brigade) went in this a.m. without opposition.\n\nHad a visit this afternoon from Arnold Lack. He looks splendid and we were both delighted to visit one another. It is years since I met the Boy & I know all at home will be glad to think we have met on the plains of Picardy.\n\nArnold has not changed a scrap. He is the same lovable boy only a tiny bit older. I must thank Padre Edwards for arranging that Arnold could get away, hipwill call & thank himon his way back. He left a few trophies which I shall send home for him. We had tea together and then he went off.\n\n\n","46":"\n\nToday is is blowy not nearly as nice a day as yesterday.\n\nIt is our taking in day & so is a very long one. We started at 9 a.m. Wonderful to relate we got in the first Cavalryman wounded, a Yorkshire Dragoon wounded by machine gun fire well over the other side of Bapaume. He is the first man wounded in cavalry action since late 1914 & so is quite a rara avis .\n\nThis evening too we got the first Anzac mounted man (13th L.H. Regiment) wounded knee.\n\nWe have actually had wounded men too from the other side of Peronne.\n\nA semiofficial piece of news tells us that our army and the French have advanced 4 miles in a 14 mile front also that Peronne is in our hands.\n\nIt certainly looks as if the old Hun had decided in a general orderly retirement & that there is possibly something behind his apparent retreat.\n\n\n\nMarch 19th\n\nWhat a day of excitement this has been.\n\nThe C.O. says this is the biggest advance since","47":"\n\nWe had to drink the health of the Allies.\n\nFirst of all the advance of our troops with the French has been over a front of 22 miles and a varying depth of 10-15 miles.\n\nThe French has entered Noyon a very large town in which they found refugees from St Quentin.\n\nSt Quentin is said to be in flames & the Germans are behind that city. French villages for the past 2½ years under German control have been freed and the excitement is intense.\n\nNews of a Zeppelin raid over England 30 in all of reported down in England and 2 in France.\n\nlCan anyonewonder why we are excited. We shall be home soon.\n\n\n","48":"\n\nA day of wind and rain a day of absolute quietness.\n\nNo quite so much news through today although what we have heard is good.\n\nFirst we heard that the French have taken 5000 prisoners, then our cavalry have covered an area of 40miles to the north & south of Arras without being in touch with the Germans.\n\nThen our divisions are moving and thereare said to be no Germans 16 miles the other side of Bapaume. The ground is said to be free of shell holes and to be very suitable for cavalry.\n\nPlenty of mounted men about. Had a visit from Capt Whiting this afternoon.\n\n\n","49":"\n\nOur take in day and we have been kept going very busily since about midday. Late tonight John Hardie of Brisbane one of my year mates was brought in wounded. He is R.M.O. to the 21st Battalion & only on himself after having been able to 150 of his men. Got a piece of H.E. in both heels and also in the back Blighty. Hope he goes ahead well. Working pretty solidly now, suppose we shall finish tomorrow morning sometime.\n\nMy wards full of heavy medical cases but must do my bit in theatre.\n\n\n\n\n\nMarch 22nd\n\nWent along about lunch time today to see John Hardie who is doing well. Did not get up till 11 as I did not finish in the theatre till well after 3 a.m.\n\nHad a visit from Thomas who preceded me as a resident at the A.G.H.Have not seen him for nearly 2 years. He was one of the lucky ones who left in the Osterley in","50":" Saw him last when I was at Adelaide on leave. He looks very thin & has a nasty colour.\n\nCharlie Wassell came over this afternoon to see John Hardie.\n\nWith Doc Harris next door it looks as if ourunit had decamped down here. They are all with Ambulances or battalions.\n\n\n","51":"\n\nWhat weird weather we are having for we have had wind snow rain & sunshine all in a few hours today.\n\nThere is a lot of talk abut Spring but if this unsettled weather continues I can see spring delayed.\n\nAt any rate it is delaying our advance.Today too all sorts of weird rumours about Turkey having thrown in the towel & the fall of Lille.\n\nCertainly one of the Hohenzollerns has been brought down in his aeroplane & missed being an inmate in our C.C.S. by just abut an hour as we were forced to close when we took in 300 although we had plenty of room.\n\nHe landed in no man's land & tried to run back but was shot in the foot & belly.\n\nHe is the first royalty to be wounded in this war & the Germans taken him to be dead according to their press.\n\n\n","52":"\n\nA glorious afternoon for I knew little of the morning having got to bed at 4 a.m. after admissions all night, sitting and getting up at 11 a.m.\n\nHad a surprise visit today from Archie Collins who looks remarkably well and who while on service has put on two stone in weight & looks just as he should do.\n\nAnd also a visit from Fred Wall who is R.M.O. to the 6th battalion. He was with me at the A.G.H. when Lucas had the chickenpox.He also looks fully fit.\n\nIts just splendid to see all these chaps but they are tired and we all share that common disease nostalgia.Tonight at 11 p.m. all the clocks go on one hour in conformity with the daylight saving scheme.\n\n\n","53":"\n\nI wakened up this a.m. with a sore throat feeling a little bit shivery and was greeted by O'Brien with the news that I had got the measles.\n\nI really thought he was joking but the set of symptoms together with the rash on my chest finally settled that & so I have to go off to the South Midlands for isolation. Such is my shear misfortune. I will not have to go awayif weget a rush of work & I could not be replaced & that is not fair to the unit.\n\nHave cabled home & to Edna because the silly old papers will say I was sick in hospital.\n\n\n","54":"\n\nThe trip over here yesterday was thoroughly poisonous.I did not imagine these beautiful French roads could be so dirty.In addition instead of coming here to Puchevillers we had to come via Amiens so that it means nearly 4 miles along dusty roads before I hoped out of the car and showed myself to the heads. It seemed ridiculous to ask to see your chest & arms and also the throat. Then I was politely informed that the officers measles ward was full but they might have a bed for me.\n\nHowever as soon as I arrived there, there was abed but I was overjoyed when the orderly asked me if I would have a bath, the most pleasing thoughtful suggestion I have heard made for months.\n\nImagine to my surprise when a cheery voice I knew greeted me. It as old Doc Harris of Newcastle who has often been down to see me. He is with the C.C.S. next to us & was an inmate here less than 24 hours. Possibly he gave it to me as we have seen a good deal of one another since he came over. There are several other Australians here as well as 4 Aust sisters on the staff.\n\n\n","55":"\n\nAfter sleeping fairly well the first night in a bed the first I had struck for many many months, I had a beastly night last night & so today wakened with a T. The silly old rash is thick and on me everywhere but should disappear by tomorrow.\n\nHad a visit this a.m. from Col Turner who is C.O. here & an old personal friend of our C.O. The C.O. had written him a letter asking that I might be sent back as soon as honour was satisfied. He thinks I look blooming & it does seem a great shame that I have to stay in bed.\n\nThinking things over quite quietly I believe that this old measles business has been in our hut sometime & that probably our new sisters have introduced it for some of them have had a suspicious rash. Fay at any rate had a remarkable rash but he was fortunate enough not be be spotted.\n\n\n","56":"\n\nIn the paper this a.m. I have read that there is a big measles epidemic in England and that a good many notables including Lady Carson & Princess Patricia of Connaught have had this childish complaint. It is not the same as the silly old measles I hadas akiddy for then I was seriously sick & the rash was a great nuisance.\n\nToday however the rash has quite faded and so I am going to try and write off a couple of letters but with what success remains to be seen.\n\nThe Australian mail should have arrived with the unit last Monday afternoon but up to date I have received none although I very much doublt if they will forward mine as I am in isolation.\n\n\n","57":"\n\nThis is a funny old ward and almost every regiment in the 5th Army is represented in it. The M.O. who looks after us is a man of few words of average height deepset dark eyes, straight up and down as thin as a piece of string. Sometimes he speaks always the same words in a flat monotonous drawl,\"How are you this morning\", sometimes varied by \"Getting along alright\". I don't know why except he looks so hopeless but I just feel when he comes into the ward that I want to laugh. I try hard not to do it because I know he would think me one of the Australian Barbarians.\n\nWrote to the C.O. today telling him I hoped to be out by Wednesday at the latest perhaps I shall try for Tuesday. I'd like to get out the same day as Harris and then the same Ambulance would do us.\n\n\n","58":"\n\nToday the orderly informed us that all the mail arrangements have been altered here so that I wrote to Edna& Mum as they will sterilise our letters for us before sending them on for us. Australian mail leaves Albert on Sunday I think.\n\nGot up today for the first time, it was a mighty relief to get out of bed. A beautiful moonlight night tonight a fair one for an air raid but this old place is too far back for the enemy to do much damage.Still as we think all nights equally likely I suppose it doesn't warrant mention in an old diary like this.\n\n\n","59":"\n\nThe end of the first quarter of 1917 & up to date the war has gone well with us. Everyone is mighty annoyed at the torpedoing of the Asturias although it is good to think she has not gone down. We actually did have an air raid last night just as I was finishing my second Australian letter.\n\nAll the lamps were suddenly extinguished & everywhere were sounds of shrill whistles. Got up in all my war paint today Had a yarn with the C.O.here & likewise met Capt Barker a boy who was a first year student in Adelaide in 1913. He has just qualified & is here with the same old complaint. We are getting a few empty beds but they filled this afternoon. Only a couple of more days here thank the Lord.\n\nToday the nearby officers mess was burnt down about ¼ hour after we finished breakfast. It was all over in a couple of minutes.\n\n\n","60":"\n\nA quiet old hospital Sunday with practically nothing to do & all day to do it in. Had a beautiful hot bath today quiet the best since I arrived in France & for the first time for many days I felt free from infection. It was just great to get rid of my old measley clothes put on some which were to say the least of them not measley.\n\nA bright sunny morning in truth but on this afternoon it was heavy snow. How quickly the days & hours bring changes yet some wiseacre says, \"Oh to be in England now that April is there\". Well he can have it as far as I am concerned but dear old Australia would suit me just at present.\n\n\n","61":"\n\nI asked old Shrapnel today if I could return to my unit tomorrow. Shrapnel is the one becameof the M.O.s who looks after all measles & meningitis cases. He is just about as quick as a slow moving elephant & has a vocabulary of 4 or 5 pet phrases which he hurls at the most inoffensive at the rate of one word in 2 minutes. At any rate he is a first rate chap & says I may leave tomorrow which is good news.\n\nI am taking Doc Harris with me so that it won't be a tedious trip like the coming here was & it will be our own ambulance.\n\nStrange to say the artillery officer opposite me is Arnold Lack's battery commander & when I spoke to Harris this chap struck up & asked if I were the friend for whom Padre Edwards had asked leave for Arnold to come and see me. He is in with the measles & is a jolly fine chap.\n\n\n","62":"\n\nAfter a great deal of difficulty owing to the snow storm having broken down the lines the officers of the 2\/1 S. Midland got onto our office & it seemed a terrible while till our ambulance came for us although it was only half past 3. I said Goodbye to this place for many reasons with happiness but chiefly because I want to be with the unit as I feel a move is imminent. Got back & recieved a hearty welcome & although I say as shouldn't ought I believe they were glad to see me. But thenews exceptfor war news was of not to good a character.\n\nOn Satuday night we had a disastrous fire inour hut and all the other inhabitants except myself lost every stick of clothing except what they stood up in. I lost my clothes but it seemed as if those things I valued most went first. All the little gifts of home which Edna and Mum gave me have gone in smoke a good many of the letters too. These are irreplaceable & it is the sentimental value which makes the loss so great. I felt utterly miserable.\n\n\n","63":"\n\nIn connection with that old fire I lost a good many things including some letters which I had never seen which were waiting for me on the table but as luck would have it the Australian mail had not arrived & so my latest letters are safe. I only discovered this today for my letters turned up safe & sound & although I lost some I had not replied too still I have these last ones.\n\nI heard tonight too that poor old O'B is to be evacuated from the unit sick. Sister Wilmot& Col Newland have decided on this.The O'B only waited for me to come back so that the unit would not be actually depleted of officers.\n\nFay left while I was away & we have a new captain named Fooks from S. Australia how S.A, is holding its own as we have3 M.O.s from there.\n\n\n\n\n\n\n\n\n","64":"\n\nA beautiful bright sunny day & there is great excitement among us as we may get a move any day now right up to the forward area too. As there is nothing definite but will be tomorrow I am not saying more here.\n\nThe dear old O'B left us today & great was the sorrow of the unit. The men all loved him & they were nearly as sorry as he was. He is a sterling good chap in every way & one of the few R.C.s I ever liked.\n\nPoor old O'B could hardly keep back his tears when he said Goodbye. It sounded pretty hard when the C.O. said he could not keep a place for him How our little unit will have suffered since we came to France. We have only lost 3 men but now Laing Johnston Page Fay & O' B have left since we came here & Whiting just before we left England. We only have 8 officers including the Q.M.\n\n\n\nApril 6th\n\nWell the news has come through about our move & we are to go to Bapaume or to be more exact just about ½ a mile to the left of it.\n\nThe C.O. has been away ¾ quarters of the day with the D.M.S. and late this afternoon the advance party went forward.\n\nToday does not seem a bit like Good Friday although we had a splendid church parade this morning & the men looked in first class trim. They wanted a football match this afternoon but the moving taking place tomorrow & our having to open on Monday everyone had to get busy packing up. The men are in great heart& it is fine to be 6 miles in frontof field amublances of the 2nd & 5th Divisions. It is a remarkable thing too that we shall be 12 kilometres in front of the advanced operating centreof the","65":" Army.\n\n\n","66":"\n\nNever to my dying day shall I forget this day & the sights I saw. We (Col Newland & self) left Edgehill at 9.30 & up we came part of the way in the motor lorry. No wonder the Germans evacuated. No wonderour fellows got heartily sick of the this advanced area. We saw it all. Pozieres which cost Australian 33000 casualties is just a howling wilderness. There is nothing but a railway signboard with the name to mark the place. To usthere is no town intact for miles. The ground is churned with shell craters, there does not seem to be a square yard of untouched ground. Graves are everywhere but all buried were Canadians. The Australians are buried away to the right left. Bogged & useless tanks lie about. The village of Le Sars is just a mass of demolished frameworks & piles of bricks It wasn't till we struck the Grevillers ridge that we saw any houseswhich were untouched & it was quite a cheerful sight. Bapaume taken by our 8th Brigade & the 6th Brigade is a mass of ruined houses & our of land with the main railway behind & our siding in front of our site.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n7\n\n\n","67":"\n\nIn yesterday's description I could say little or nothing about actual things & I cannot now. After yesterday I would believe anything I read in the way of descriptions of war's ravages. Bountiful German dugouts are about here everywhere and their wire netting intanglementspractically surround us.\n\nI heard a fine story yesterday about 50th Battalion (South Australians). There were given a job to do. After it was done & it was successful on calling A Coy roll 0 officers & 18 men answered. Every officer was killed.A whole platoon of roughly 50 men and 20 officers it was thoughtwere lost. Later they were discovered notwas alive not the officer. The officers one of whom was Josewhose brother I know had not a revolver cartridge left while all of the men had not a rifle cartridge among them. They had fired their all having been surrounded by the Germans & not a man had surrendered. What a record to leave. Why a death like that is grander than anything. What proud mothers fathers sweethearts and wives. Does Australia slip back while we have such men as those.\n\n\n","68":"\n\nWe ceased manual labourtoday at 11.20 & started to receive. It was pretty solid work for the first lorry load of our stuff only arrived here at 4.30 pm on Saturday. We have been going solidly with manuallabour as I have ever done in my life & now they start us with the other.\n\nWell I managed to find enough to do to keep me out of the theatre till 4 p.m. when I relieved Smyth & at 2 pm there was every prospect of an all night sitting.\n\nColonel Maynard Smith, Consulting Surgeon 5th Army is to live with us. He came this evening.\n\nThe war news is just splendid although I did laugh at Cuba declaring war.\n\nAmerica's huge loan will be of help. Splendid news from Vimy Ridge a fine victory We have done well too in our strafe.\n\n\n\n\n","69":"\n\nHave hardly had time to stir or know it was today. We ceased operating a 4 a.m. this morning and stopped receiving at 7 a.m. I have been going solid since 10 a.m. & expect to be finished tonight at 10 p.m. & then to bed.\n\nHad visits today from General ProuseD.M.S. A.I.F. & General Skinner D.M.S. Vth Army.\n\nThey are delighted with our progress & think we are great wonders.\n\nNo3 C.C.S. from Aveloyare to be beside us & they arrived to inspect the site today & to open on Friday. I wonder if they will be able to do it.\n\nMajor MacKenzie of the 3rd F.A. blew in this p.m.& told us the strafe was expected any time. I haven't spoken about the manual labour done by everyone but I must say I am proud of our unit & it is fine to see the officers doing as well as the men.\n\n\n","70":"\n\nA cold dull day but it is better than snow. The wind is high. The strafe did not take place last night but should tonight.\n\nGlorious news from the Vimy Ridge and fancy capturing so many officers & so many guns. A whole battery of 9.2 in addition to the 5 inch stuff. Why such a thing has not been done before in this war. First & third armieshave got to all their objectives. I heard today too that we have the air supremacy again & that up till now we have encouraged the Hun in the thought that he was our master. This direct from the R.F.C. .\n\nToday General Birdwood came round to see the wounded Anzacs and he spent a couple of hours here. These days of oursare worthy of any praise they win & Birdwood should be pleased to lead them.\n\n\n\nApril 12th\n\nWhat a funny old place this France is. I have always been told that April is a very uncertain month & so it is. Any men who were woundedlast night must have had an awfultime for it has snowed heavily& they just arrived here absolutely stone cold.\n\nWhat interesting stories they do tell & how heavily the 1st& 4th divisions have paid for their brilliant yet modest effort. And yet they do not complain that the others did not come up.\n\nGeneral Gough visited the camp today, the first time our Army commander has seen us &he was jolly nice& also complimentary. It did the C.O. a world of good& he thoroughly deserves it.\n\nNo 3 C.C.S. areworkinghard next door& today I saw King & Dubbeswho worked with us for a while at Edgehill.\n\n\n","71":"\n\nOur taking in day and not a very heavy one I am pleased to say Had a visit today from Capt Whiting who has just come out of the line. He has been working the A.D.S. for the 12th Brigade & had a huge amount of work to do owing to the brilliant work of that brigade. It is a great pity to think that the British troops failed us. Got two letters from Edna from the 2nd A.C.C.S. although correctly addressed. Another one at least is still missing.\n\nFred Le Messinier now a major with the","72":" F.A. came down tonight but did not stay long as we were fairly busy. He looked splendid.\n\n\n","73":"\n\nA nice quiet day & just such a one as we love.It was good to get a little respite & to be able to bathefreely.Yesterday was fairly strenuous & so today we took things fairly quietly. This afternoonMajor Wollard one of the temporary attached men & myself went for a most interesting walk into Bapaume. Such a scene of absolute destruction & ruthless wreckage I have never seen or imagined before. There is no doubt about there not being a single house or shop intact.We went just everywhere & not a sign of wholeness could we find. It looked to me as if it had been an earthquake without any fire. I saw the famous statue of Faidherbewith just the base left.\n\nWe have been under heavy bombardment all day & one shell from a 6 inch lobbedwithin 30 yards & so . Theastounding owing to the ground being so soft buried itself in the ground fair sized crater,It fell at the back side of anempty ward.\n\n\n","74":"\n\nA fine Sunday morning so I got up early & went to church. The cases started to pour in at about 9 a.m. & from that time untill 9 p.m. we got them pretty solidly so much so that we switched most next door aaltogether. We had 190 seriously wounded.To give a face of them and Fred Le Messenier Whiting & Brook from the 12th F.A. came down and gave us a hand & we were delighted to see them.\n\nHave not had my home mail yet although men at the unit got theirs nearly a week ago.\n\nWhiting came down to dinner.\n\nDad and Mum's wedding day.\n\nThe Germans attacked us in a forest today a got a good many but we counterattacked, gt allour men back again & 300 of the enemy.The Hun too handed back freely 130 of our wounded. I wonder if he is going to withdrawherestill further.The Hun has strafed us heavily all day shells lobbing all around.\n\n\n\nApril 16th\n\nA perfectly deadly day as far as weather is concerned for we have had glorious sunshine rain & snow all within one day.The terrible was they wereplaced in the for if the day is sunshine & ends up with snow it is quite different to one which begins with snow and ends with sunshine.\n\nWe are still ploughing through our cases for complete 7 days, now 9th to now16th,we have done 177 on average of 25 major ops per diem of which a very great number were particularly long& tedious cases.\n\nWe finsihed up tonight after 11 pm & as I started work yesterday at 11 am,I can say it has been for me the longest continuous haul I have had. Still the others worked pretty hard & who am Ito complain.\n\nGerman shellingof this spot was intermittent. This seems to have centred more on Bapaume although he sent at least6 nights close to us.\n\n\n","75":"\n\nA fairly quiet day so far and the first opportunity I have had to write a line since Saturday night.So far too today we have not been shelled.Up till now however it has rained heavily and now it is sleeting. I just wonder when the spring will really come for it is bitterly cold.\n\nThe good news of our advance & the fine work of allies is being continued. Everyone is very optimistic & it is quite good to see the way even the wounded look on therecent events in spite of their having to lie and in the snow & rain with wounds such as I have never seen before.\n\nHeard from a German Sergeant Major that the gun which shells us is a 6\" Naval gun which is quite easily moved at the village of Anisy.Later an old shelinggun has started at the same old tricks.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nApril 18th\n\nToday the sun did not shine too brightly for me. This afternoon an officer of the 13th Battalion came down to see if we could give him any light with regard to the missing men of his unit. We did so.Just as he was leaving I spoke of McDowell Charlie's friend & said how pleased I was that he did the intelligence of the unit & that he was safe. I walked out with him to show him the way to the le Grand & then said I was pleased too my cousin was still atAmiens.Something made me mention Charlie's name, his face quite changed for he said Charlie was killed on the 11th. He was wounded by barb wire and came back with some others for a dressing and then just as he was moving off having said goodbye to the others because he was leaving them, a big shell fell in the midst of the little crowd of 13, killed 7 wounded 6. Charlie was one of the 7.The M.O. diedof wounds a little while later at the ambulance dressing table. Only by yesterday's mail did I receive a\n\n\n\npostcard photograph of Charlie & his friend McDowell taken while he was in Amiens. Certainly the wrting was dated","76":" but the field post office mark was 14.4.17, 3 days after he was killed. I wonder if they found it among his kit for the envelope was signed by him. A couple of hours later the post came in telling me that McDowell was condoling with us on the loss of his greatest friend & our loss of a brave chumsoldier & a Christian gentleman.\n\n\"Dulce et decorum est pas patria mori.\"\n\nMcDowell has gone to England on leave & so I shall defer wrting to him for a week or so & then I shall write asking where Charlie is buried & if possible I shall visit the grave.\n\nI shall try to cable Mum but that is such a difficult matter that I shall be extremely fortunate if it gets through.How I shall write to them I do not know for Charlie was an orphan & it was the Innisfarlanes who really loved him.\n\n\n","77":"\n\nToday is our receiving day & things are fairly slack. I always like it to be like this because it means that our boys are for the time being safe. I do not mind at all how many German woundedwe treat but it hurts a bitsee so many of our brave boys going out into the blue never to return to their native land. I believe big things are on foot again & oh for a couple of fine days for I feel if we got that & about 6 weeks of fairly decent weather that by the end of May the Hun will be out of France. The news from the French front is decidedly good & it is gratifying to know that in the attack the Germans made on us about 6 days ago no less than 14 battalions were hurled against our","78":" divisiion & sevenbattalions of the Prussian Guards. Over 1500 dead were counted by us round Lagnicourt. It sounds brutal to talk of the dead so but it is an indication of the severity of the fighting. The Australian loves the open fighting\n\n\n","79":"\n\nA beatiful bright sunshiny day. I did not get very much sleep last night & was up with the lark today to enjoy the first decent bit of sunshine we have had for a mighty long while. We are all resting today for tomorrow we expect the advance to start again & then we can expect heavy days for some time to come.\n\nHad another new arrival to the unit yesterday a man named Humphries who is a fair age but only recently graduated in Sydney. At last the heads are beginning to realise that we have a little bit of work to do here & we are getting the assistance we need.\n\nWrote to Mum about dear old Charlie today & it hurt a good deal to have to do it.\n\n\n","80":"\n\nAt last it does look as if we are to get some decent weather.\n\nThis afternoon I went for a walk with the padre to get some flowers for a little garden we are put round our tents.\n\nWe went to what was once the finest little town I have seen.All the houses were of fairly recent date & had roofs which were either tiled or slated.\n\nBut oh what awful destruction there was. I do not believe I have ever seen anything exactly like it. If the destruction of Bapaume was fiendish this then was actually devilish. Bapaume is an important centre but this almost ideal spot was of little import. Here we saw the inside of a rather fine church blown inside out, fruit trees chopped down and broken unsuitable for any use. The gardens & farm instruments broken up & ruthlessly destroyed. Huge emplacements, mighty trenches with wonderfully fine dugouts destroyed, railway line & yet around it all such a deathlike stillness with the primroses & daffodils in flower just reminding us even here that nothing can ever die.\n\n\n","81":"\n\nAfter a fairly quiet daytime yesterday the night was furiously heavy & we had 3 bad abdominal cases, one of whom happened to be McHenley's cousin a jolly fine boy whom I had met several times at Edgehill. He should do fairly well andColonel Newland thinks he will do better than any other he has had. Truly thought today I should have time to write up my mail but we had a few cases left to run which took longer than I expected & so I depended on the night to help me. But at the special request of General Birdwood we took in his chauffeur who happened to be accidentally wounded. It looked quite a simple case but after a couple of hours patience & application we had to give it up. \n\nToday too we evacuated the Sergeant I always looked as peculiarly my own. Poor old chap he got nephritis & so we had to send him in as he was doing no good here. I was bitterly disappointed to have to give him up for I hoped if it were possible that he would go back with me. He was a splendid chap in every way & was the best liked man in the unit.\n\n\n","82":"\n\nAnother glorious sunny day. A huge artillery bombardment took place all last night & right throughout the morning. I saw a most interesting air fight between one of our plains& 2 Taubes.The Taubes just cleared for their lives& after our old bus had fired at the flying Hun he turned round & back to the observation balloon which he was so jealously guarding. I do not think I ever saw anything as this for the Hun easily was the faster & there were 2 of them to our old bus. I suppose sometime or other we'll get some fast ones now & then work out. It was my first view of a real air battle & it was thrilling. I should like to see one with say 10 planes a side.\n\nIt was good to read yesterday that two of our T.B.Ds put to hun destroyers sinking 2 & damaging a third so that she would not get back to port. That will teach them that the Channel is still ours. \n\n\n","83":"\n\nIt looks as if at last we have supremacy in the air for yesterdays communique tell us that our machines brought down 22 enemy aeroplanes & 7 kite balloons while we only lost 4 machines. Hard too that we did not get all we were after yesterday with mid front although 2000 prisoners were left on our hands.\n\nThere is a story told of the Australians by the officers of the 11th Manchesters. Nine Australians got isolated and were surrounded by the Huns. First of all 6 Australians were killed in the hell hole then the remaining 3 having used up all the ammunition available fixed bayonets & charged. They too were killed but when in the late afternoon the Manchesters went up to relieve this isolated post they found all the Australians dead but they also counted 160 dead Huns round this hole. Not too bad an average about 17 or 18 men a piece. Are we degenerate? Do we easily surrender. No wonder the German hates us.\n\n\n","84":"\n\nThe further we get away from this wonderful day in the history of Australia the more wonderful it will appear to me. I never tire of hearing of the story of Anzac the day on which as it went our young Australian nation received its baptism of blood & really became a nation.\n\nIt will be a day of holy joy to many many hearts & also deep deep heartache for those who do not know what the word \"Resurgium\" means. For some the light of their lives went out for others they have learned for the first time the meaning of that word sacrifice.\n\nAs wesilently honoured the toast of absent friends we all felt that they were not very far away from us. We did the best we could do. May Anzac be an inspiration to us all.\n\nReceived some of the later Australian mail today & a letter from Arnold Lack.\n\nOur take in day & the tightest we have had up to date.\n\n\n","85":"\n\nWe have all had the gardening mania lately & yesterday I walked over to Grevillers to get some plants for my garden. I got a good selection primroses, daffodils, daisies, violets & some other tubers which I do not know butwhich will certainly flower very soon. It takes off a good deal of the bareness & it does seem a shame that these gorgeous flowers should shed their loveliness near what is a wilderness made by the hate of men.\n\nI have had a spring cleaning today & have tried to set a few things right. Had to turntoday for electoral papers as I am to be the returning officer for our unit for this Commonwealth election. Why it should be my lot I do not know although i know the C.O. was mighty fed up by the last one when the Referendum was taken. There are such a lot of minor technicalities.\n\n\n","86":"\n\nLast night we had the surprise of our lives for an aeroplane came down to within 30 feet or so of our lines. The pilot dropped a letter & that letter was for me. Just-it-was Dick Jenkins & he dropped his letter in an aerial mailbag which had a double pennant of Red Yellow & Blue. It was addressed so that thefinder would deliver it to me. He gave our position & said it was by air. He had flown over our place the night before at 5000 feet & although dropped the bag about 20 feet from our boundary in next door,I did not get it till he had passed over for the last time & then he sailed away. He handled his machine very gracefully & the whole of the 2 C.C.S.'s just held their breath while he did therevolutions.It was great to see him & I only wish I knew it were he. Still I wrote straight away & maybe he'll come again now he knows our actual location.\n\n\n","87":"\n\nMum's birthday.\n\nWe were inspected by General Birdwood this a.m. & his inspection was well worth having. We all shook hands & then he spoke to the men individually.They appreciated this immensely.He is quite a naturalman and this they appreciated.Strange to say it was the first time we have ever been inspected for an Australian welcome.No man's pigeon& overhere although the D.M.S. A.I.F. has visited us twice,he has never seen any of the men & only inspected our operatingtheatre onhis two visits.\n\nThe rest of the Australian mail arrived to day all correct except for one letter which Mum said she typed for me.\n\nFred Hall & Arthur Wilson came down to see me today. Wrote a large Australian mail for it goes out first thing in the morning.\n\n\n","88":"\n\nA glorious day. I was quite pleased when I got up this a.m. quite early to go to church at 7.15. Truly the morning is the best time in these spring day for it does look as if afterthe longest & severest winter ever experienced in Europe we are going to have a very early and long summer. But we cannot get everything and he would certainly be a hard man to please who did not feel happy with such days as these. Curtin who left a few days ago on leave is certainly a very lucky chap to strike weather like this for his leave. I really do wonder when we shall strike anything like a rest when we shall be able to go to England on leave. Still the longer and harder we work here the sooner we shall all be home again.\n\n\n\n\n","89":"\n\nThere we are at the end of the first month in the spring offensive & looking all over the frontit does look as if we have done more than ever before orin thetwo years preceeding this one. The daily news is not quite so exciting.\n\nToday we took the poll in the unit for the general elections of the Commonwealth& on medevolved the strenuous duties of Assistant returning officer. The poll passedoff very quietly but as it is open for the use of patients right up till Saturday night at 8 o'clock,I can see that I shall have my work cut out for there is a good deal of inkyexplaining to be done.\n\nit is fine to think however that our fellows will be given the chance of recording their votes. I will leave no loophole for any complaints & it does look as if things will have to be definitely decided this time.\n\n\n\n\n","90":"\n\nAll sorts of rumours are floating about with regard to the big offensive & when it does take place there will be a good deal doing. It is delightfulto think that no one knows just exactly when it will take place because in so many cases previously some knowall has let out the cat and that is no light task for anyone to fight against. Our brave boys are greatly bucked up at their prospects. True division instead of isolated divisions had charge of this for it produces better communication & trust in the units concerned.\n\nThere must be an Australian mail pretty close up. Heard that the Medina was torpedoedbetween Marseilles & Englandso that the mails will have left thank God.\n\nI can do without papers or even parcels but the letters are too precious to lose.\n\n\n\n\n","91":"\n\nThings must be working up to a head because tonight our little unit is fairlycleared out every Australian for miles has cleared to us. We got a large A-T away this afternoon & the C.O. has advised us to bed so that something must be doing. Our take in tomorrow starts at 9 a.m. so it will mean an all night sitting probably now. We have erected an extra nursing section to deal with walkers & also more rest tents. In placeof this & now at a push we can take 700 walkers and light cases.\n\nWell let the battle rage & success to our brave boys everywhere.\n\n\n\n\n","92":"\n\nWell the battle has commenced in real earnest for our forces are operating over an 80 mile front & up to date this is the biggest battle of the war. I'm writing this some days after the date which appears above. We started receiving at 9 a.m.& by 11.15 a.m. had in 378. We switched men to next door & before 3 o'clock were taking in again. In two lots we took in over 800. I am in charge of all the walking cases & have had over 600 cases myself in 78 hours. Work why nothing we have ever struck anywhere was like this. our men have great heart and they tell me that the old Hun cut it mighty hot. They were not out to take prisoners & that after all should be the main idea in a death struggle like this is.\n\nNever thought for themselves always the other chap. Typical of our boys.\n\n\n","93":"\n\nStill the battle rages & is likely to rage as far as I can see.\n\nHad a visit this a.m. from Capt Bean who is the official representative of the Australian press in France. He was very for hours hearing the stories of the men & trying to get their accounts of the battle. We are still going mighty strong. My old dressing tent has just done magnificently & the C.O. is delighted. It was an opportunity & I'm glad that I was able to manage it successfully for him. Ourswas new staff conceptfor Smyth ithad been handled surprise as before. They were Battlersfor work. The sisters too have done splendid work.\n\nI do hope the Colonel gets \nsplendid\nrecognition for the grand task he has done. It is a terrible pity that he has not hit it off too well with Howse.\n\n\n","94":"\n\nStill keeping on keeping on. How every mans sticking itis surprising for the men still move in & they give braveaccounts of things up the line. They all praise the stretcher bearers & everyone says that the Hun recognises no flag of truce althoughwe did his. Such fiendish conduct just fills our chaps with utter loathing for the German & if anything that hate for him just increases. The Field Ambulances have lost fairly heavily over this show in casualties although I am pleased to say that practically none were killed.\n\nI received a birthday cable from all the folks at home just saying they had not forgotten. That is just like them but if things go on lilke this there will be no birthday or anything else for me.\n\n\n","95":"\n\nIt is Stan Wellingtons birthday - I wonder if he would be surprised ifI did not know what day of the week it was. Day hasrun into night & night to day this strafe time that we do not know either the time orthe day.\n\nBy amplereferenceto the Padre's diary he informs me it is Sunday & so I shall try to think it is although in these partsone day differs from anothervery slightly.\n\nWe now have with us another surgeon by name Curry. He has been sent over from 44 C.C.S.& already we find himof great use & it does give some of us a little relief. If Curtin would come back it would make it possible to run a day & night staff. His term will soon be up I think.\n","96":"\n\nThings are still going fairly solidly with us for the first four days, up to 9 a.m. today we had performed300ops, all of fair size in ourtheatre, seventy per day with at a maximum four tables working is a prettyfair average & I feel & know the C.O. is mighty proud. Considering we could not have had 2000 admissions this is a very big average.\n\nWe got to bed this morning about 4.30 & at 8 a.m. were up again to start work at 9. As the cases are accumulating we never seem to be able to clear right up, we are going to make an attempt today even if we have to work for hours & hours & hours.\n\nOur boys aredoing so splendidly. I heard today of Sir Douglas Haig's letter to Birdwood inwhich Haig said that the Australian effort there wouldmark one of the military units of this war. BravoAustralia.\n","97":"\n\nI can hardly write today because I am so sleepy. Yesterday I had 3 hours sleep in the very early morning & I am just coming off a thirty hour continuous stint in the theatre. The all round work both inside & outside has been mixed, is a mighty fine thing but inthese theatres with the sun 80 or 90 & hot sterilisers, anaesthetics & sometimes acetyline flows going, it becomes absolutely stifling. However the C.O. advised us to bed today at 3 p.m. I have decided if I am O.M.O. tomorrow that I shall stick there tillI have to get up for the taking over. It will be our take in but that is a good thing for I like to see our braveboys when they first arrive bless 'em.\n\nI had a visit from Jimmy Hairthis evening. I have not seen Jim for years & was mighty glad that at last he is here. Good old John Smyth got his majority today for which the Lord be praised. He deserved it.\n","98":"\n\nMy birthday & what a dayit has been. I purposely wanted it to be so for I went to bed yesterday afternoon at 3 p.m. & got up this a.m. at 7. Certainly we had had a mighty heavy time but it was good to feel that just for a while the world could go on without you.\n\nThis morning I received a birthday cable fromEdna andthis afternoon brought me the first division of the Australian mail & what better birthday gifts could I have. When Dick flew over this a.m. hedropped a note to say that he had just received an Australian mail so I knew ours must be mighty close. Admitted a Major General tonight - the mighty fuss of heads about him would make you think he was a little tin God. Such people are at abig discount here & it is great to feel that they just becomeas little children here.\n","99":"\n\nI had a very swift night last night receiving. As I had to be on duty for 24 hours continuously I had planned that I would write as many letters in the slack hours of the morning as possible but alas there were no slack hours so I did not get a line written. Eventually at 9 a.m. I was relieved & I went off to bed about 10. But it was beastly hot that I could not sleep & so I got up again.\n\nThis afternoon Dick flew over & dropped a note to say that he was unable to land and that they were moving off but he did not know where. We actually saw one another & waved.\n\nExpected the rest of my Australian mail yesterday but it did not arrive. Got to bed tonight at 9 p.m. &am writing this to show that I really have been in bed early for once this year.\n","100":"\n\nStill no Australian mail and I am beginning to wonder if the NSW mail is not at the bottom of the sea.\n\nI have beenworking hard all day on the strafe statistics and find that from the 3rd-10th May both days inclusiveour unit did 524 operations & for that time we admitted 2770men. That means that fully 20% were operated on an average of about 60 operations perday forthe 8 days. For 4 of the 8 days we averaged 79 so that some idea can be gauged of the work done by our little unit. If the C.O. does not get some good distinction out of this I shall be mighty surprised. King's Birthday will not be long in coming & perhaps then we shall get something.\n\nI had a visit last night from Harold who told me that he was going up north again & would not see mefor some time. He looked well & I was glad to see him.\n","101":"\n\nLate last night the postal orderly sprung on us the news that the Australian mail would go out today after saying that there would be no mail till 27th. I had sit up late writing. I didn't mind that but I do hate sending away letters written in a hurry for I always like to think a little about what I write.\n\nThe Australian mail arrived this afternoon \nafter\n the outwards mail had gone. Just my luck.\n\nThe C.O. sprang a surprise on us tonight although I was not surprised. He was mighty annoyed at Smyth being made a major & me. I knew this. I thought it would not be long before he got rid of one of us. Now that this has happened I shall seek out first opportunity to clear out although I hate to leavetheunit especially if he ifhe gets the man he wantsas my successor. After the way Smyth & I worked for him he might have kept his nasty remarks to himself.\n","102":"\n\nI didn't sleep much last night thinking about things ingeneral & especially theprobability of a move. If I do get to the 12th field ambulance I should befairly happy then for I know everyone there. All are young Sydney chaps of my own time except Sid Le Messeurier & I knew him pretty well. Many are moving up north too so I would see another part & by no means the worst part of the line.\n\nWe had a cricket match today officers v men & it was thoroughly enjoyable. Our little cricket pitch is quite handy &it does seem strange when playing cricket so close up to the real things. We take inagain tonight & as I am O.D.I expect to have a fairly heavy time as the fifth Division are doing something pretty big. The Hun is trying his hardest to hang to Bullecourt. Austin Curtin & the Australian 12th F.A.men went off to their unit today. We were sorry to miss them.\n","103":"\n\nIt has passed into Monday without my making it, wehave a mighty lot of work to do. I got off to sleep about 10 a.m. & got up before 4. It was such a beastly hot day that I could hardly sleep a wink. I gave them enough work to keep them going for a good long while. It seems to me as if our work is notletting up a bit. I think from the communiques our sectorof the whole western front is the only one in which any fighting is being done. Everyone here seems mighty depressed about Russia. I cannot tellwhy because by then is silenceor if the yellow see fit to suggest all sorts of things what do they know.Russia has always been a mystery & will remainso to themwho do not understand Bethmann Hollweg's statement & reference has not come to light yet & I cannot believe it will now at any rate. They will give them submarines till the end of June to see what they can do.\n\n\n","104":"\n\nBullecourt & Rouen areours. Will the Hun now start another big retirement because I haveheard from Artillery engineer & G.S.O.s that he will have to do so. Certainly the fighting about Bullecourt has been severe & the way the Hun has desperately attacked & counter attacked only strengthens me in that view.\n\nHollweg's statement was to have been made todaybut he has not made itup to date & nowthe papers say he will not make it till July.\n\nAlthough I have not seen any actual figures the Hughesiteshave had a splendid victory in Australia. I do hope it means real genuine progress for Australia for we want to take our place properly as a grown daughter should & that will only happen while the best men guide our destinies & the best offering are certainly the party we know.\n","105":"\n\nThe political news from Australia is decidedly encouraging & we were greatly pleased to know that the Soldiers vote actually put Mr Flynn in in an a electorate wherethe wretchedGerman vote actually displaced him. Ifeel now that dear old Australiahas partly redeemed itself for that awful vote in October last. Possibly she will never be able to wipethat right outbut at any rate a good strong capable government will be able to pilot us through the stormy seas & then at the proper time perhaps a new government of patriots will arise who will be at to do their best for the country & not to \ndo\n the Country.\n\nStill soldiers first if thesechaps will do their best to win the war then we shall be able to forgive them a lot. We all want to come home soon.\n","106":"\n\nWas inundated today with old Australian newspapers so have decided to go right through them & bin all the useless ones. I thinktime the great bulk must have come by the boat because they turned up dated 1st January & the other papers were dated as far as March 10thso that there must be a screw loose somewhere. I must write home & ask themto send the weeklies & a strong daily welterimportant news in it. If I have to have this mail the postal people will not allow readdressed papers to follow me to another address. When I see the great bags of papers that arrive from , then I begin to realise what a great salethe papers must have in Australia. However weare a mostnaturally workinging system got at last 5 bags of papers from Australia per fortnight. Yet the about a paper faminein England.\n\n\n","107":"\n\nAt last we are able to see a little daylight through our work & areable to think a bit clearly. I must candidly admit that for the past week my mind has been in a perfect fogwhich seems a silly thing to say for we have had nearly a week of easierwork. Stillit is so. I never feltso jolly tiredthat iI did not care to a single thing & have developedinto almosta pefect loafer. Itis mighty hard work being a loafer here.\n\nHad a visit from Fred Walltonight. He said he was feeling a bithomesick (who does not?) and wanted cheering up. This is a new role for me butit is good to see people whom one knows apart from those with whom you work daily.\n\nOur mess lately seems to be the retreat of Army medsout of work.Still it is good it is so.\n\nMay 19th\n\nI have have beenworking jolly hardthe last few days with statisticsfor the unit's work during the strafe May 3rd-May 10th & I find that the the work done is really remarkablewhen closely analysed.\n\nJust fancy we had 2670 wounded & we managed to operate on 524 of them which means that 20% of the admissions were surgically treated. In an ordinary surgical time such as the July strafe lost from 7-10% was the average while 10% was considered wonderfully. We only had 3 attached mento help& that for only part of the time. We averaged our 65 operations per day for the whole 8 days. Considering we had no day staff, no night staff but we justdid their best,it was a tributeto the splendid work that we actually got a bit of praisefrom the D.M.S.","108":" army, a man who is sparing with his praise as he is sharp withhis tongue.\n","109":"\n\nA very quiet day for us although we are supposed to be receiving. I do not believe that in the first 12 hours we received 6 patients. Our boys are holding the line splendidly but are anxiously awaiting to receive the relief for which they have waited so long. I dohope when they are all out that they will be given a goodposition in another part of the line. In the last Anzac orders is printed Sir Douglas Haig's despatch to General Birdwood & it containsthe highest promise. Certainly the Russian Guard & theWestern will have a different opinion of the stamina of the Australians after this fighting. It is something to be proud of in these parts where the Australian coat of armsfor the whole place is just swimmingwith the memoriesof the brilliant feats of our boys.\n","110":"\n\nToday the C.O. sprung a surprise packet on us, sentmeoff to Amiens in charge of 5 other officers for a day off. With the exception of the enforced10days absence when I had measlesthis is the first day off duty I have had since or before Christmas.\n\nI was delighted that I had the trip because the trip up Grevillers was just when all that country,Pozieres, Le Sars, Courcelette, Warlencourt and other places hallowed by precious blood were a howling wilderness. Today nature has wakened & it all looks perfectlyallighted.The bright fresh green lushof spring has spread right over the land & it looks delightful. While even just great yawning shell holes & broken down trucks arecarpetted with the greenest undergrowth & they havelost all their ugly bruises.\n\nWe had a splendid day in Amiens & for the first time I saw the cathedral which was beautifully clear. The earliest date I noticed was 1632. It was but majestic. I want to see it again before describing.\n","111":"\n\nA wretchedly miserable day today for it has drizzled all day & everything is sloppy & muddy.\n\nTonight General Birdwood, Colonel Manifold & the A.D.C. dined with us and we had to parade ourselves because as the general had entertained our sisters we had to return the compliment. Eight of the sisters with 8 of the officers formed the dinner party. The rest of our staff were entertained in the sisters mess & as we numbered 38 all told it was a pretty big crowd.\n\nI must say the General made himself just as decent as is possible for anyone to be & was glad he did so. He has a manner which is easy to understand & he has a wonderful memory for names & faces. As far as it was possible it was a delightful affairbut I hatea crowd & would have given a good deal to be absent. Still rigid etiquette wouldnot allow me my freedom.\n","112":"\n\nA glorious bright day quite a change from yesterday.\n\nHad 2 interesting fellows in today. Two Australians captured by the Hun from the 4th division who have escaped, were taken to Lille where they were made to work. Say that Lille is just as in ordinary times. Plenty of people about & all doing some sort of work. They say also that they were shockingly fed, are all being kept in the front area as reprisal for our atrocities. They were fed on turnips & stuff something like thin soup stock. Had a piece of bread as big as a thumbnail. They also say that the Hun is very badly fed. One of them was shot as he returned by our chaps but that is not a surprising fact. They say they preferred death by being shot to death by starvation.\n\nRcd first letter portion of Australian mail today.\n","113":"\n\nThe old Man's Birthday & Empire Day. For the very first time we toasted our Empire on active service. We just feel that we all want to be back by next Empire Day & that day then will be the finest and best day for the Empire celebrations we have ever had because we understand what Empire means now as we never did before the war.\n\nIts good to be able to meet men from all over Great Britain & Ireland & also from the overseas & to feel we are one big family.\n\nThe Hunhas been busy todaywith his big guns & he'sbanging away but as per usual ofimportance happened. It is surprising how many duds are fired. It must cost a good deal in wasted ammunition.\n","114":"\n\nThis morning Bell and I went for the first walk I have done over the fiercely foughtcountry which altogether summed up formedthe site of the great Somme battle.\n\nWe went in from Grevillers to the famous Loupert Wood following on the top of the Grevillers ridge. All round us to the south & east-west were places famous in history. Away on the skyline we could see High wood & Delville Wood. Closer to us were Le Sars & Coursellette . Still further to the left were Ligny & Thilloy & the famous Battle of Warlencourt. Directly in front by the Valley of the Ancre. Away to the right were Isles of Miraumont. The Loupert Wood we went right round & it was well worth a visit. The trenchs machine gun positions dugouts & shell holes were wonderful. Yes we had that awful sickening smell of dead men & horses. None who has not ever seen such sights & smelt them can realise & yet over all place thegolden & glorious sunshine to help us to forget the bloody struggle.\n\nMay 25\n\nToday in the afternoon I was working hard when suddenly the C.O. informed me that I with 3 Sisters was to dine with the Lt. General Sir William Birdwood at Corps Headquarters. You can imagine my surprise. However, I had to grin & bear it & after going I was delighted to think I did. We had 4 generals in all as well as several highly placed staff officers. We dined in the open air & it was one of the most homelike meals I have had since I joined the service. If I amasked to go again I would jump at it. It just impressed me with an opinion I have that in the highest ranks of the service the best men are to found &the crusty majors & lieutenant Colonels are the ones which are the most objectionable.\n\nWe were back by 10 o'clock p.m. but it was a good night.\n","115":"\n\nWhat gloriously fine days there are just now. The sun in the middle of the day is so warm & yet the early mornings & the afternoons & evenings are delightfully cool.\n\nToday is our receiving day & yet we are not overworked. Certainly our staff is being reduced & this is just what it should be. We are losing poor old Riley tomorrow & he is being replaced by a young chap who should have left Melbourne ages ago. He was wearing the uniform & hanging for dear life on to a cushy job in St Kilda Road Base Hospital. Riley was just a dear old chap & representative of that type of general family practitioner fast dyingout in Australia. He is one of the best informed & most polite men I have ever met. He certainly was a bit old & we carried him on our shoulders but still we did not mind that so long as he stayed. He thinks he is being pushed out.\n","116":"\n\nToday is Whitsunday & although feeling awfully weary I got up at 6.45 a.m. to go to church. I am afraid the explanation of weariness is simple. As yesterday was our receiving day & I did not anaesthetise during the day I naturally thought it would fall to my lot to work at night. The result was that I did not look at the list. Imagine my surprise when I found at between 12.30 & 1 a.m. that I was not on the list at all. \n\nToday the last of my mail arrived, 3 letters from Edna & one from Sister Roman. It was just the timingof fate that the mail should go out before I could possibly acknowledge receipt of the letters.\n\nI have had a really lazy day but am going to bed at a respectable hour.\n","117":"\n\nA gloriously fine hot day today. For the first time since coming to this place our little C.C.S. is practically empty.\n\nReceived an invitation from Col Waters, town Major of Bapaume to help in a cricket match & so 8 of us are going up to play at 4 o'clock.\n\nIt seems quite strange to say it after the winter we have had but today it feels as hot as it used to do in dear old Australia.\n\nIt is exactly 2½ years today since I first sailed away from Australia & I once had the silly idea that the war would last 6 months. I am afraid I did not hold that idea very long. \n\nHave just received a cable from Edna saying she is needed for service & asking my approval. God keep her & bless her & let her arrive safely.\n","118":"\n\nSent a cable to Edna saying I was delighted to know she had been accepted & also wanting to know when & where. I hope the censor will be good at the other end & will let her reply.\n\nThe match yesterday was an inglorious defeat for we only scored 28 & our opponents 73. In our second innings we retrieved & lost 4 for 73 but it was too late. However we have asked for our revenge on our own ground.\n\nThe news from the Italian front looks startlingly good. I have always placed morefaith in the Italians than may havebut it must be their ignorance of Italian physiography which makes them so impatient about the progress made. Truly the old Rusian is a broken reed at present but later on he should do well. What he wants is leadership & the Allies want to give their best.\n","119":"\n\nThe Italian push still goes on & they are doing splendidly. It is great to think that our aviators& artillery are truly helping. It would be fine if the Italians take Trieste. The timetableis that the bulk of the population is Italian for to blowthat city to pieces would do a lot to counteract the needless blowing up of Albert & Arras. \n\nI wonder why we do not near Zeebrugge & these other coastal bases ofthe Germans where they could do good work if surrounded by a screen of torpedo boats. But if I get airing my strategy I shall probably get into trouble with Censor or G.H.Q. Sometimeshowever it slips out in spite of myself. Changing the French command encouraging but the nation trustsPetain & all asked who was thisNivellewho has come forward half French half English of the ' of Deal'.\n","120":"\n\nHow this month has gone. It is almost unbelievable that in this short while so much could have happened to us. I suppose it was the way day ran into nightfor the first half of the month that has made it go so quickly. We must have received 5000 patients & done over800 operations in this last month, a record which any C.C.S. has reason to be proud of considering in the last half we have admitted about 1000 & done not more than 150 operations. Tonight wehad a visitfrom the 5th Divisoinal folliesthe first show given to our unitsince we left . It was a might good turnout & I was glad we had a bumper house for they had gone to great pains to get the whole thing up.\n","121":"\n\nThe C.O. returned today from a trip to Arras. He left yesterday with Col. Merricke& went up near Doullens. He says that considering how close it was to the actual line as compared with Albert it has got off wonderfully well.\n\nApparently the Germans made a dead set at the station for it is absolutely unrecognisable. Likewise the Cathedral and any conspicuous landmark. Still Arras did not get the amount of shelling Albert did but got more bombs.\n\nThe countryside about here just now is with field flowers. The buttercup has spread its yellow pall everywhere. The clover is gorgeous likewise the forgetmenot & the daisies. Truly what this country loses in winter it makes up for in spring & summer. It is a land of delight now.\n","122":"\n\nQuite a day of weird atmospheric conditons. Still the padre & I went out for a good walk & discovered a beautiful orchard. The gooseberries, black & red currants were well forward while the pears & apples were comingon well.\n\nWe have been greatly worried all day by a new German gun on this sector, an 4.5\" Navalgun which fires very viciously & the shells had sight. It has fired all day but up to date has done no harm.\n\nWe got nota little suspense today when we found that our C.O. got a mention in Haig's despatches, one of the Imperial troops. This was rather good for he is in the Imperial list as distinct from the overseas troops. I was sorry I refused an invitation to MerrickesAmbulance close to Arras for I would very much like to see that city which the C.O. says is very interesting.\n\n\n","123":"\n\nA Sunday and the King's birthday. A gloriously fine day and one I would like to spend in the front line for the athmosphere is so clear.\n\nAs was to be expected it has been a great day in the air and the Huns have been fairly busy but it is no use saying anything to the contrary, our fellows have the Hun filled with dread for he does not return for we seem to have 3 planes for every one of his. We are daily expecting news of the great push up. Had a letter from Arnold Lack yesterday to say their men close to Armentieres & the 27th Field Ambulance is up there. Although it is 3 weeks today, no word re my transfer to that Ambulance. I wish something definite would come so that I might know just what to do.\n\n\n","124":"\n\nWhen we saw the birthday list of honours today I was just a tiny bit disappointed & surprised for there were just a few I did not expect who got honours & a few who were left sadly lamenting. They I do not know but I suppose it will always be so.\n\nEven ourD.M.S. got nothing, our Colonel Maynard Smith, the Consulting Surgeon, nor our C.O. while GeorgeByrne got a D.S.O. I do not know much about his work but I hardly think he would get it unless for something fine although old George is a little bit casual. He is bitterly disappointed the C.O. did not receive an honour for he has worked as hard as any D.M.C. in uniform& has withtwo wonderfully fine nurses organised for all the stunts splendidly while his show has been one of the brightest posts anywhere the D.M.S. has always used ours as a show place & his turn will come one day.\n\nJune 5th\n\nToday I had a visit from Col Toll. I only a couple of days ago that he heard from some of our Sisters that I was with the unit so promptly he rode over with his M.S. to see me.\n\nHe does not look a bit different although since having leaving New Guineahe has had a bad time with malaria& he has been twicewounded once rather seriously. \n\nToday we played 4th Corps Engineers, the match was quite exciting. They made 94 then we had 9 wickets for 93. I was last man in. I missed the first ball, the next was driven for a 2 & \nI\n had won the match. With my partner we knocked up to 103 & then he was bowled. They chaired me & I felt about as big as a threepenny bit.\n\nJune 6th\n\nThe C.O., Col Newland Smyth & Fooks went to Amiens today & left me in charge of the camp. Tonight I went over to Braithcourt to see Colonel Toll & had quite an enjoyable evening. It is a mighty long walk from here but to see such a great chap & to have a yarn about the old New Guinea days with the whitest men who went in that fire was worthit all. \n\nWakened this morning to find myself immortalised in verse & also presented with a bat for having had the luck to make the winning stroke yesterday in a cricket match we played against 4th Corps Engineers. The poetry was not bad or the bat, quite a smart piece of work. The boys of the unit will have their bit of fun.\n\nHeard the offensive up north started today.\n\nJune 7th\n\nAfter an absence of exactly 4 weeks old Dickflew over tonight & dropped a very interesting letter. He is now stationed 12 miles W.N.W. of St. Quentin. He has told me he is due for leave in a couple of months & wants to know if I would get mine with his & that we might try to get away together. He suggested further France or Italy.\n\nHowever I should like to know a little more definitely about Edna's arriving & so shall wait a while. Still it was good to see the dear old chap again for a bit. I know it must mean a lot to Vesyto know that he is well. Flying is a mighty seriousbusiness these days & every time they go up they risk their lives. Dick suggested flying back to Australia, buta bad idea. You could carry the pilot.\n\n\n\nJune 8th\n\nThe good news still comes in from the north & we are a little elated by it as I think our braveAustralians must have done all they were asked to do as is so usual.\n\nIt is really a remarkable thing for up to date I have hardly heard of one instance when they have failed. Our missions have always reached their objective but when the show has failed it has been due to failure of their flank supports which have always been Tommies.\n\nArnold found has been slipping ina few but they have distant & nameless. Our hasbeen with the night a few being Hun planes but mainly our wretched Archies. I think they should not be allowed to fireexcept in thedirectionof the German himself. We had a in a day or so as to who lost his& Archie died.\n\nJune 9th\n\nThe old Hun seems to have got more than he bargained for up at Messines & that the losses there must have been the greatest in the world. I should like to see the number afterwards. Fancy the amount of stuff that 450 tons of ammunitionwould .\n\nI hope good old 3rd Division had its baptism of blood & it took all its objectives & also those of our 4th Division so that the 4th can move when the","125":" should be our version. They were upon a time calledthe","126":" the \"neutrals\" but they can hardly be that now. Sir Douglas Haigis reported to have said that this Messines show was the most successful stunt doneat any time in France. It is a fine thing for usto be associated with such an effort.\n","127":"\n\nThis place just lately has hardly been done overfor with an Australian Division at rest round herethere has been plenty doing in the way of visitors. As soon as the news of Sister O'Dwyer's decoration got about I think practically every officer in the division must have made it his business to come & congratulate her formally. Although deservedly popular because of her brightness, still Sister would have been a great deal happier if they had written instead ofcoming because it is very difficult to entertain here.\n\nThe Australian mail went out today so I had to write up myletters which I could not finish last night & post them straightaway.\n","128":"\n\nThis good work up north continues & I am gladtoo because the old Kaiser about a week ago had the cheek to say that our offensive was finished. It must have given him a sickening blow to find that the Messines ridge which absolutely dominated the Ypres & Armentieres sector of the line is now his no longer.\n\nWrote to Dick today to say I was sorry I could not give him a definite answer re leave. I thought possibly that a reply to my cable would arrive today but it did not. \n\nHad a little party tonight to celebrate the arrival of Sister O'Dwyer's Red Cross. If any girl within A.A.N.S. deserved it I am sure she did for she has done wonderfully fine work. We are ahappy family here nowalthough the great bulk of us arenot young.\n","129":"\n\nHad a visit today from Sir William Hensingham consulting physician to the C.S.S.s in France. He is greatly interested in the awfully common disease known as P.U.O. which is in my opinion a remittent fever due most probably to a protozoan parasite in the blood. An investigator seems to have found fairly conclusively that the louse is the carrier. However I have arranged with the C.O. to have a special ward for those cases & as far as possible I am going to see at any rate clinically what can be done. He agrees with me that the parasite is protozoan & now he has put up a special case to the D.G. asking that a special be sent over to investigate & do special work on the blood of these patients.\n\nI shall keep regular charts of them all & note downanything extraordinary.\n","130":"\n\nHad a visit this afternoon from Jack Barton who used to be Superingon the . He was looking mighty well & we had a good old yarn about old times. He was saying that there was an honour board up on the old with the names of all those who had gone out on service. It was great to have a yarn with him because it is a very long while since I had any news about some good pals I made in the old ship. I was disgusted when he told me that B.Rs had made no provision for any of their permanent staff who had volunteered. B.Rs made a tremendous splash about patriotism but there are dozens of men who have done their bit by their employers staff. Jack said that Chursenwas going out tomorrow & the old second were coming back.\n\nOld has been freed to abdicate himself.\n","131":"\n\nWe are still worrying about our Australian mail for it was 3 weeks yesterday since we had an Australian mail & I am just wondering when we shall have our next.\n\nHeard a vile rumour said to have come through the Bank of N.S.W. that our mail has gone down. Capt Bodham, A.D.C. to one of our generals, told us today & he was telling us that the Hun was retiring up north & that our advanced were some thousand yards or so ahead & had not made contact with him. Also that the art treasureswere being removed from Lille by the Hun & very probably he will retire there quite shortly. Oh it is a great war but I wish that it would soon end for all of us.\n\nAt midnight had a gas alarm & the old Hun put over gas but it did not do us any harm.\n","132":"\n\nGrandma's Birthday today. I hope the cable which she should have received last Monday arrived in time.\n\nHead today from most reliable source that Sir Douglas Haig believes that the war will be over in November. Well if he is right we shall not be a bit disappointed & even if I am wrong when I say it will be over by the end of the summer, it is better to be two months out & somewhere near it than to go about with a big face & say that the last 7 years of the war will be the worst. There is no doubt that a cheerful face and one that can still smile even when it looks as if the Russians were not playing the game is worth a mighty lot.\n\nA mighty successful Hun raid on London yesterday, bad luck to them about 100 killed & 450 wounded.\n","133":"\n\nA delightful day today but we got it in the neck today. Fifth Corps had a stunt which gave such a lot of casualties that we had to take the overflow. Between 9 & 4 we got in over 300 & then switched to 29 C.C.S. This kept us going solidly as then the operating commenced. Out of this little lot we have 61 ops to do & that I am certain it will mean an all night sitting for us.\n\nPoor old Johnnie Smyth is still right sick & his is not getting a bit better. Looks to me as if he is in for a bad time.\n\nAfter giving a diphtheria throat myself a few days ago,I was greatly relieved today when the report came back today negative.\n","134":"\n\nWe eventually cleaned up our 61 ops of which Bill & I did 23 at least & then I toddled off to bed at 6 a.m., he had the four tables going all night. The sad part about the show was that we were successful at the two flanks but the centre was held up & we had to come back.\n\nA rash came out on poor old John Smyth today & we have had to send him off to isolation with scarletfever. His is a slightly atypical case but it is pretty definite. Poor beggar he has had no luck because with bronchitis, trench fever & mumps, scarlet, he has practically run the lot of so called infectious diseases.\n\nHad General Wisdom in to tea today & he says the war will be over by September. Unfortunately I did not get a chance to ask him his reasons.\n","135":"\n\nI was so tired & lazy yesterday after an all night sitting that I did not write any of my usual Sunday letters.\n\nI half expected I would get a cable from Edna today but up to date nothing has turned up. I would dearly love to know if she has left Australia.\n\nI do not know what has happened to the mails because today the men got their Melbourne letters up to & including May 1st while I got Sydney & Adelaide papers of similar date but never a line from anyone. I wonder if the mail has gone astray or if our mail is the last to be sorted. Now we have practically no Victoria officers there is no mail for the officers while there is plenty for the men.\n\n\n","136":"\n\nYesterday was the 102 Anniverwary of the battle of Waterloo,while present indications point tothe lowcountry once again becoming the cockpit of Europe.\n\nThe success of the Messines push & the news I heard today that the french had placed the Belgians north of us & also that our George had gone up there with mobsto make a big push with 20 division between Ypres & the sea makes it looking possible that the next fighting will be there.\n\nThe padre next door assures me that the preliminary bombardment started there last Sunday. Up to date we have had no news of it in the papers & Colonel Gray, our new consulting surgeon, knows nothing of it.\n","137":"\n\nThe C.O. asked me today if I would like my English leave in the near future or if I would prefer to wait a while to see if Edna comes over & I decided to wait. At least in a week or two I shall have her letters or else some more cables telling me something definite. Still no news of the position of the mail why we still do not know. Heard today that the submarine sinkings have once again gone up & might beexplained I suppose by the poor weather & the long nights.\n\nHad a field card from Arnold Lack saying he goes O.K. & also a letter fromFrank Mitchellasking for a transfer.\n\nI wonderhow many new books I shall fill because when I left I thought it would be a couple at most. But I must be patient.\n\n"}}