{"Document Name":{"0":"Diary_0480","1":"Diary_0480","2":"Diary_0480","3":"Diary_0480","4":"Diary_0480","5":"Diary_0480","6":"Diary_0480","7":"Diary_0480","8":"Diary_0480","9":"Diary_0480","10":"Diary_0480","11":"Diary_0480","12":"Diary_0480","13":"Diary_0480","14":"Diary_0480","15":"Diary_0480","16":"Diary_0480","17":"Diary_0480","18":"Diary_0480","19":"Diary_0480","20":"Diary_0480","21":"Diary_0480","22":"Diary_0480","23":"Diary_0480","24":"Diary_0480","25":"Diary_0480","26":"Diary_0480","27":"Diary_0480","28":"Diary_0480","29":"Diary_0480","30":"Diary_0480","31":"Diary_0480","32":"Diary_0480","33":"Diary_0480","34":"Diary_0480","35":"Diary_0480","36":"Diary_0480","37":"Diary_0480","38":"Diary_0480","39":"Diary_0480","40":"Diary_0480","41":"Diary_0480","42":"Diary_0480","43":"Diary_0480","44":"Diary_0480","45":"Diary_0480","46":"Diary_0480","47":"Diary_0480","48":"Diary_0480","49":"Diary_0480","50":"Diary_0480","51":"Diary_0480","52":"Diary_0480","53":"Diary_0480","54":"Diary_0480","55":"Diary_0480","56":"Diary_0480","57":"Diary_0480","58":"Diary_0480","59":"Diary_0480","60":"Diary_0480","61":"Diary_0480","62":"Diary_0480","63":"Diary_0480","64":"Diary_0480","65":"Diary_0480","66":"Diary_0480","67":"Diary_0480","68":"Diary_0480","69":"Diary_0480","70":"Diary_0480","71":"Diary_0480","72":"Diary_0480","73":"Diary_0480","74":"Diary_0480","75":"Diary_0480","76":"Diary_0480"},"Date":{"0":"unknown","1":647.0,"2":648.0,"3":649.0,"4":650.0,"5":651.0,"6":652.0,"7":653.0,"8":654.0,"9":655.0,"10":656.0,"11":657.0,"12":658.0,"13":659.0,"14":660.0,"15":661.0,"16":662.0,"17":663.0,"18":664.0,"19":665.0,"20":666.0,"21":667.0,"22":668.0,"23":669.0,"24":670.0,"25":671.0,"26":672.0,"27":673.0,"28":674.0,"29":675.0,"30":676.0,"31":677.0,"32":678.0,"33":679.0,"34":680.0,"35":681.0,"36":682.0,"37":683.0,"38":684.0,"39":685.0,"40":686.0,"41":687.0,"42":688.0,"43":689.0,"44":690.0,"45":691.0,"46":692.0,"47":693.0,"48":694.0,"49":695.0,"50":696.0,"51":697.0,"52":698.0,"53":699.0,"54":700.0,"55":701.0,"56":702.0,"57":703.0,"58":704.0,"59":705.0,"60":706.0,"61":707.0,"62":708.0,"63":709.0,"64":710.0,"65":711.0,"66":713.0,"67":714.0,"68":715.0,"69":716.0,"70":717.0,"71":718.0,"72":719.0,"73":720.0,"74":721.0,"75":722.0,"76":723.0},"Entry":{"0":"\n\n","1":" Anzac Gallipoli Turkey\n\nAt 1945 after a quiet afternoon we put two rounds of rapid fire into the enemy on an agreed signal – a flare thrown up from our trenches! Had already got into a good elevated position with periscope in order to observe results. Our fire coming in a sudden burst formed a most excellent ruse and drew a great deal of fire. \n\nAbdul sprang to arms and the hail of bullets they put into us proved their trenches to be fully manned. Probably new troops as all appeared jumpy and although our men only fired two rounds they continued to pump lead into us for quite a considerable time. \n\nThe firing spread right along the line and now at 2106 is still going strong\n\nWhile out a bomb landed and exploded a few feet from where my seat usually is so absence was providential. Looking in periscope while heavy fire was on, the enemies line vivid with flashes. Our parapets while two rounds being fired one sheet of flame lighting up the soldiers faces In daytime flash not noticeable. All hands enjoy fooling enemy like this and making them think we are coming out If he comes at us so much the better. It is all the boys hope for. At 2230 we are going to give him 3 rounds rapid. Will go up again and \n\ntake up the same station, although by its height it is very exposed and quite likely to be well bombed out. Great rumbling of artillery at Cape Hellas pointing to a continuance of the battle that has been raging down there for two days now. At 2230 gave our Turkish friend another little prod with 3 rounds of the best and got about 4 back and a few bombs, \n\nOur signal a flare which thrown by us landed about 6 yards in front of his parapet which shows how close our trenches are. It burned furiously and well under cover could watch whole scene through periscope but could see no movement. Machine guns spitting out very venemously. Turned in 2240\n","2":"\n\nPitch dark at the stand to arms 0430. 31 details arrived and nearly dead with climb lay asleep on parade ground in all attitudes. Their scared look when bullets about very amusing also their remarks – only a month ago we were the same. Worked on instead of returning to . Very heavy bursts of rumbling cannonade in distance towards Cape Hellas. Things quiet here. Bombs at night look like plain crackers coming through the air but the blaze of explosion quite sufficiently indicates the difference. Slight slip in \"C\"’s trenches disclosed soldier buried in wall. One leg broken off & lying on ground other protruding. Very difficult\n\n29\/9\/15 \n\nin places to find clear spot. Two dugouts started in same locality for sleeping in had to be abandoned owing to corpses being struck. What a lovely time we are going to have this winter \n\nsleeping in these holes with decaying corpses a few feet above or beside in the earth. All the water will infiltrate through graves and run all over us. \n\nThe vegetation of Turkey in poor country of this nature appears to be of just a few species. The rhododendron and a small prickly bush (holly) seem to be the principal and cover these sandy hillsides. Nowhere is a greater height than about 4’ 6\" attained Dwarf oak trees about 2’ 6\" high are come across now and again and sage and thyme grow wild among the undergrowth. Wild olive bushes are also intermingled with the other undergrowth. An examination of the country in front of us (looking across to the Turks trenches) through the limited reflection of a periscope shows pleasant country side open and green cultivated in parts & with an occasional white house or village. \n\nOn the right towards AchiBaBa the scene is quite Australian in look. The mountain blue in the distance and a level expanse of country this way with scattered trees. Looking inland towards the other flank is a range of hills with similar land about. A shallow salt lake extends inland some distance from Suvla Bay. Where we are situated beggars description one can only say that we are perched on a hillside and chasms & ravines lie below. Rugged country like a huge river basin .\n\nBird life is scarce. Only an occasional one is seen. Insects are limited to flies and some ants. Centipedes flourish\n\n29\/9\/15 \n\nAt 1730 went down to Bde. HQ and saw Bde Major re. Returned through saps and came out in firing line. Shell from 75 plunged into bank 10 yards away burst and deluged me with clods and fine dust. In firing line new 3.7 mortar just placed fired a couple of bombs but enemy artillery were waiting and put a 75 in.\n\nIt burst in the next post wrecking it fortunately they were all in the tunnels at the time. Nothing could be seen for some seconds on account of the dense acrid fumes of the high explosive. A close shave. Splinters lying all around us. Continued working mortar.\n\nTheir artillery and machine guns miss no opportunity as their information is good.\n\nUneventful evening and to bed at 2130.\n","3":"\n\nRose 04.30 and after stand to arms left with Major Smith and Dr Drummond for a swim at Anzac Cove Went through burial ground and along big sap to beach. Remarkable the amount of stores there. Ketch lying in shallow water about 200 yards N of pier, sunk by Beachy Bill. Jack Tars handy men about beach. Dugout and blanket settlement up cliff. \n\nHad clothes all off first time for 14 days and had a good wash and swim off barge. Lovely sunny morning view of sea perfect. Two large white hospital ships looked well. The delightful precipitous islands of Imbros and Samothrace throwing blue shadows over calm water. Our green valley like a funnel.\n\nThe song sung here to a popular tune\n\nIn my little home in a Trench\n\n(Tune Little grey home in the West)\n\nI\n\nI’ve a little wet home in a trench\n\nWhich the rainstorms continually drench\n\nThere are dead Turks all round\n\nAll polluting the ground\n\nOh they give us a beautiful stench\n\nUnderneath in the place of a floor\n\nThere’s a mass of wet mud & some gore\n\nAnd the \"Jess Willards\" bear\n\nThrough the rain sodden air\n\nO’er my little wet home in the trench\n\nII\n\nThere are snipers who keep on the go\n\nSo you must keep your old napper down low\n\nAnd their star shells at night\n\nMake a deuce of a light\n\nWhich causes the language to flow\n\nThen biscuits & bully we chew\n\nFor its weeks since we tasted a stew\n\nBut with shells bursting there\n\nThere’s no place can compare\n\nWith my little wet home in the trench\n\nWords generally known among men but the author anonymous.\n\nChanged all clothes after swim shaved brushed up & eat enormous breakfast of beef & biscuits\n\n30\/9\/15\n\n1045 Seaplane flew across and went very low across our trenches and the Turks. Their shells bursting remarkably close to her and following her right along leaving delicious looking cream white puffs of smoke cloud. Shot after shot just missed and the trail could be traced by the slowly dissolving puffs of smoke which took a long time to disperse. Got out my telescope and had splendid views of machine - a beauty. Propeller racing in the sun like golden wheel. Could not spot aviator. As soon a seaplane disappeared could hear sounds of another aircraft and biplane passed over in opposite direction but very high up. Artillery also going fairly close to her. Both of them a beautiful sight on this lovely sunny morning \n\nNoticed 3 or 4 heads and shoulders and some limbs sticking out of side of hill and put the pioneers on covering them up. Am much afraid that when rains occur the sides of this steep hill will slip as there are now very few bushes left – that natural revetment being gradually taken for fire wood. God knows what ghastly sights & stench we shall have to put up with when these land slides do occur. \n\nA quiet afternoon but busy with odds and ends. Trenches spotlessly clean\n","4":"\n\nCould eat a meal off floor of fire trench Sent Coustley out to beach to see what could be picked up for the mess He returned with reply that he had not bought anything as a man told him the stuff was \"pinched\" Wish now I’d sent my batman Mitchell.\n\nIn evening going through personal things of dead men ready for sending back to next of kin. Have as a rule to go very carefully through all papers and letters, a necessary precaution as pain would only be caused by sending some of the things found home to a man’s people – particularly after our stay among the vicious Caireans. In all cases bibles and religious books found and some intensely religious letters These on bodies in clothes. Bed 2130\n","5":"\n\nBright moonlight at stand to but raw air. When sun rose it disclosed heavy fog, sea obscured and only the top of this position and the opposite hills on our second line of defence could be seen above the eddying mass of white vapour. Slight mist falling. Doubled all the sentries and took other precautions against surprise. Two men killed and buried before breakfast. Turks machine guns laid at top of parapet made sweep of fire and caught these two looking over.\n\nOne machine gunner committed suicide blew every particle of brain out and portion of head gone. Instantaneous fused bomb found under his pillow. Strain evidently too much for him. Traces of doubtful syphilis. Court of Inquiry to sit on case. \n\n0924 Delightful spring morning like Australia only occasional shots being fired. Quiet afternoon. Little ruse tonight – going to drag a dummy right along our front with a wire attached. Will the Turk bite? (N B Egypt On meeting two Egyptians say Saida (Sigheader) and touch forehead and then chest. As appears to be dress from which RC nuns dress has evolved may not this custom be the origin of of R.C crossing\n\n1\/10\/15\n\nAbdul very jumpy tonight and jerking a lot of lead into the landscape. Bombs & the crack of bullets around here but row always greater on left as the reports echo and recho down Shrapnel valley with the sea at the foot making a sounding board.\n\nNotice a great many getting heavy and haggard with constant strain and any repulsive sight seems to haunt their memory. Probably a characteristic of this trench warfare – when moving, changes of scene would keep the mind lively and occupied.\n\nBusy clerical day with no Orderly Room Sergt. Faring well as regards food – for \nbreakfast\n porridge (biscuits ground down with condensed milk) bacon (very fat) and bread & gooseberry jam \nlunch\n Ration maconachie beef Rice & raisins bread & jam \ndinner\n Bacon, batter fritters strawberry jam and bread.\n\nStood to arms 1530 all batmen out too. All know their alarm post. \n\n(\nEgypt\n) (Chanties sung by Arab grooms One chants, others repeat in chorus & so on. Enormous trays with large lamps the sweet meat sellers carry on their heads. Water carriers watering side streets from goat skin bags. Filthy little bootblacks around tram at Heliopolis, \"You wanner boots clean Misser Captn You wanner brush Mr Sergeant Major Mackenzie You gib it half piastr\" Georgette and the half piastr Little white skull caps and pinky swathe of turban. News boys \"Times Egyptian Daily Mirror Daily Exskotch. Al Moka tram Times London Philip Dragoman at Shepheard. The other wall eyed old devil of Ex Continental fame \"Yes! Yes! orright orright. Yes very good very nice. Abbotts dragoman on excursion with )\n","6":"\n\nStand to 0430 , Brigadier round Could get no sleep after the carry on. Lovely morning. Aeroplane up but Abduls shooting not as good as usual although he put the white fleecy puff of bursting shells all round the target. Territorial’s camp growing at Suvla quite a number of tents on beach and inland about ½ a mile in among comparatively pleasant surroundings, grass, trees and fairly level country, another camp about battn. probably artillery did not bombard this morning early but have now started searching for artillery Road gun. Shells whizzing very close overhead. Our snipers crept out last night and watched Abdul at work on his trenches.One turk gave himself up to 21st battn-had only one boot.Gave orders all our dead to be buried without boots or any other clothing likely to be of use to those who are left. Siege battery at work from some miles away and landing on Turks trenches just about 200 yards from here with resounding crashes.\n\nThe Indians and their mules great workers. The uniform a neat one of khaki; - lithe little men liking Australian very good each man managing three mules and going along these grades at an ambling trot. They must be in good training.\n\nDown fire trench twice shell carried away the sand bags at usual elevated post.Surveyed whole scene carefully through periscope. Trenches running for miles the poor old earth seamed and furrowed and torn about with them. Inspected German officers trench through secret machine gun post using telescope.\n\nYarning to men along firing the line – all merry and bright. Evening quiet – for here. Mail in, a few letters to hand. Essy Bunting’s mother enquiring about his death. The funniest thing today was Capt A’s `precipitate bolt for any old dugout when Abdul started throwing shells in on the bomb mortar. All hands in rest trenches naked chasing lice\n\n2\/10\/15 \n\nQuite a feature of the life in trenches is the morning lice hunt – all the way along the support trenches are men sitting in the sun naked picking & searching over their garments with the most intent & painstaking look so as to miss nothing. At other times during the day a man will sit down and unbuttoning his clothes try and root them out. The visitation at times is almost unbearable, one almost \ncrys\n. Vermigelli and lice powder are articles of issue and act fairly well. \n\nThe comments are amusing - the sport is called big game hunting or \"looking for gold dust\". One fellow says \"I wouldn’t be happy if I wasn’t lousy\". \"I pick em’ out every morning, brush their feet and put them back again\".\n\n2010 – to a vermin haunted couch\n\n0000 Abdul went mad, shouted and blazed like hell into us. An old bird is not to be caught with straw and 22nd Battn. did not fire a shot in reply. Which defeated his object viz. to draw fire from us.\n","7":"\n\nUp at 0430. Hanley \"A\" Co bullet in head. Saw doctor at work. He has a feeble fighting chance of recovery After lunch down to Whites Valley to see Jack but after much hunting found Brocon’s Dip is where he is located. Missed him so sent orderly with note. Monitors buzzing in this afternoon. Very little freeboard and one central mast with fighting top Suvla Bay active more tents going up and the bay full of men o’war. Beachy Bill putting a few good shells into the beach. Siege battery planking Abdul a few big shells blow back dangerous to ourselves as splinters land round these headquarters. Road parties hard at work making the road, heavy work\n\n3\/10\/15\n\nPutting message in tin and throwing it over to Abdul asking Turks to desert to us and pointing out way to come in, also arranging pass word for them to give sentries. Interpreter went up to forward sap and was calling out Osmanie perdarsher – \"Turkish brothers\" but the irony came in as every time we shouted \"Turkish brothers\", a good big shell landed on his trenches from our battery in rear. \n\nWhen day broke we could see a corpse just out in front. At dark a man will crawl out and drag him in. We shall have to get on early as \"Turkish brother\" will be on the same racket. \n\nMonitors putting some good shells into Turkish trenches. The sea very still and dotted with little craft, sweepers & perfect sunset.\n\n2020 A most exciting evening. Threw a message over into Crator in a bottle asking them to come in and assuring them of good treatment. At 2000 12 seen coming towards us on left but by bungling they were fired on by machine gun some of them came quite close (about 6) and cut entanglements a little which we let them do. Went up with Major Newcombe and he called out to them in Arabic but got no response. Other small groups seen on other spots. Our men kept them covered but did not fire as we are most anxious for intelligence reasons to get a prisoner or two. \n\nReturned to HQ and met interpreter and Major Anderson and took them along to Tambour. A long way through firing line and through tunnels & passages in pitch dark – all blocked up with waiting men standing to arms. An electric torch if shown in trenches silhouettes the heads of the men as they poke them over the top observing, the periscope being useless at night. Major Anderson would persist in using his, despite being told and the men saying \"put the light out\" had no effect.\n\n3\/10\/15\n\nReaching secret galleries on Tambour warned him on no account to show a light but just at a ticklish spot he switched it on. Was annoyed, but one of the \"warbo\" a good big Australian with bayonet fixed rose to the occasion. \"Put out that - light, you – old fool\". The light went out and stayed out. Interpreter called out to Turks and they said \"don’t fire\". He told them where to come in and how but only answer was 12 shots aimed at him. Walked back along trench and with Slater could hear them calling out from their trenches. They called out \"At ten oclock\". \n\nWent back to HQ Yarned to Drummond. At 2710 went up trenches again and tried a little ruse – dragging tins across \nhis\n our front from C to D. Got about half way and wire broke. In disgust fired 6 out of revolver at them and went back and turned in. \n\nAt 2240 \"D\" xx a nasty position to handle, 21st have Quinns Post & Bloody Angle. Wire netting to keep bombs off\n","8":"\n\nHad a nasty tumble in dark. Pioneers grading path left a step about a foot high. Cut knees open (wearing shorts) think also broke funny bone. Very tired slept soundly and was nearly late for stand to 0430. Went back to bed after and slept till 0830. Another man shot through brain not dead yet. Unfortunate that the only part of body exposed in trench warfare should be a vital part – the head. Bullet struck a man’s bayonet & broke in two. A lovely morning. While at breakfast heavy bombardment started shells bursting everywhere and the air full of fumes. Dirt dropping from the walls of mess dugout with concussion.\n\nGully full of shrapnel. Cooks shaken up - splinters\n\nfalling in Reg. office. Heavy rifle fire on left probably shell fire covering an advance. I am sitting on 3 boxes of the most powerful bombs on the Peninsular so if anything hits here it is \"cuckoo\". 75’s taking dirt off parapet just in front in their skimming flight. Siege battery pouring high explosive into enemy’s Johnstone Jolly’s trenches. All our guns belching out. Their shells skimming past at rate of one a second from 75’s alone.\n\nA brisk morning; - and a pair of little birds singing as if no war or bloodshed was on. Eight or 9 shells bursting round here simultaneously. Bombs going right and left. Nothing from warships yet. Both Turks and ourselves in the dugouts. Heavy firing round Cape Hellas. Splinters still catching us here. Aeroplanes up registering shots. In firing line sandbags and traverses much cut about owing the shells landing – one stripped a rifle of all wood work and charged magazine but left in the chamber the unexploded cartridge. Noise big factor.\n\nAll ready for gas attack any time always carry little bag slung over shoulder with a gas helmet in it with mica eye shield. Chemical in helmet neutralise effects of the gas by turning it into salt. Also respirator. Both damp with the chemicals. Sock wrung out in it is a good antidote. Gas sprayers for driving the gas back and special men for their manipulation all ready for use.\n\n1043 Very quiet now save for an occasional rifle shot echoing down the valley. Abdul showing bayonets over his parapets for a while but everything now returned to normal.\n\nDelightful day, beautiful sun and blue calm seas. The two isles of the blest lying peaceful \n\n4\/10\/15\n\nHave not had boots off for a week, feet stink and the pattern of the socks is driven into the skin. Lousy too and filthy but quite happy. Involuntary exclamations that leap to men’s lips. Heard two this morning \"Good loving J - Dear b – C -\", when they were merely expressing surprise at the damage done by a shell. \n\nTurkish for come here \"Boo-ri-gler Gel\".\n\nDraft arrived last night Col Hutchison among them. Two of our men reporting back. Inspected some ammunition. Some American made very nicely finished and beautifully clean. Opened cartridge. Propellant little black round beads like black beads children thread. Put a match to contents and they flared away with great blaze. Opened up Australian made, little sticks of resin coloured stuff like lengths of thin cat gut 2 ½ inches long, also burnt slowly. \n\nMan from 23rd Battn just called in and said Jack had been taken away to hospital with sore throat. Another mail in 15 bags for battalion all hands sorting. Result of bombardment this morning when all men were put in the saps 1 man badly cut up with serious shrapnel wounds 4 rifles broken 23rd 1 killed 3 wounded 24th 4 killed 12 wounded.\n\nParcel of gift stuff sardines figs biscuits came to hand.\n\n1605 Went down to 6th Field Ambulance to see Jack and found him lying on stretcher in hospital looking ill with diarrhoea & tonsillitis. Gave him some letters and cheered him up as much as possible. Great climb back through saps past mules and Indian Camp and sweated like a pig. Fatigues carrying heavy stores on their shoulders feel the pinch but take their time on the job always\n\n4\/10\/15\n\nBounteous feast of fresh roast beef figs fancy biscuits bread and chocolate thanks to Lady Hamilton & Queen Alexandra or some other old \"pots\" in the Cold Country. At 2000 demonstration by our people on the right machine guns and heavy rifle fire with shells from torpedo boat destroyers. Not an adequate reply as far as could be judged from here. Shrapnel smashed one chap up, serious wounds in head, arm back, legs and hips. Brains protruding but may recover. Rifles twisted into shapeless mass and denuded of all woodwork. \n\nMail to hand, letters from Daisy and the old 500 school and Mrs F. all reeking of eucalyptus on account of meningitis scare. Retreat folk as usual. Pair of socks from Ef. Bed tired 2130.\n","9":"\n\nStand to arms 0430. Sea and hills just commencing to be visible through growing dawn. Censoring letters one gentleman describes last nights operations \"An entertainment was held last night starting with an Overture in the shape of rockets commencing at 7.55 pm. The first item was a solo by an Eighteen pounder followed by a Duet from a 6 inch Howitzer and a Four Pounder which was loudly applauded. The Applause sounding very much like Rifle fire. The third item was an Irish jig by a 12 inch Naval Gun which drew unstinted applause. The Next Item was by the whole Company with the throwing of Bouquets in the shape of Bombs and Artillery shells. The performance was very lengthy and some members of the audience were much cut up about it and called for their stretchers before the Grand Finale. \n\n5\/10\/15\n\nThey will celebrate their interments this morning. The remainder of the audience retired very bored to their dugouts and pulled their blankets over their heads to shut out the noise. It is expected that the casualty list will benefit \nvery much\n considerably by this effort. The management desires to express their appreciation for the generous contribution made to the list by Abdul & Coy Ltd \" \n\nPut a few bombs into Abdul from special Japanese mortars and tomorrow will move it back 250 yards to give them some more Round the firing line and Turks potting at periscope could see them working in German Officers from the secret emplacement.\n\nShovels and hands coming up. Getting a few shrewd shells in on them, steel work replacing wooden in parts Their entanglements much added to last few nights. \n\nWent along to A Co on right, chipping with all the warbo. Telescope in secret station for observing could see Dead Turk lying in hollow in ground. Yellow cap and apparently one of our overcoats. Our chaps say some of them wear no uniform at all. This with fact that they use black kit bags and sew up blankets for sandbags point to faulty equipment. One fat Turk lying groaning in front of Lone Pine. Two Sgts went out to try and get him but were both wounded. We through interpreter offered to bring him in or let them do so but no answer. Consequently poor fat Turk died in agony, although we called out for him to crawl and come in. \n\nAm getting \"trench stale\" and soft for want of exercise – decided to go for a swim every morning after stand to instead of sleeping\n\nexercise needed here. \n\nIf I return and sit at last\n\nBeside some hearth-fire safe and sound,\n\nMaybe I’ll send some tales around\n\nAbout our doings of the Past\n\nOf stairs that twist from musty lanes\n\nWeird dens of sin with latticed doors\n\nFierce gasping fights in corridors\n\nSlave market walls with rusty stains.\n\nPeach-colored dawns with opal mists,\n\nThe snaky camel-train that steals,\n\nPast oxen plodding round the wheels,\n\nGold bangles loading women’s wrists.\n\nThe flash of anklets through the dust\n\nVeiled women round the village well\n\n(What dark eyes say no tongue may tell\n\nOf hate of hate, of lust of lust)\n\nA hundred breeds of men that meet\n\nAnd strive with tales in broken speech,\n\nSad tales of homes far out of reach\n\nBarbaric music weird and sweet\n\nHuge tombs of priests and dust of kings\n\nRising beneath our careless tread,\n\nWhile bristling kites swing overhead\n\nA thousand thousand wondrous things\n\nStill heaps beneath the outspread flag\n\nThe wolf-like captives pleading eye\n\nThe firing party plodding by\n\nQuiet heads beneath a bloody rag\n\nAre heaps of clothes that clutch and sprawl\n\nAnd ghastly boys who fight for air\n\nOld twisted mouths, wide eyes that stare\n\nBlue skies and sunshine over all.\n\nIf I return to sit and weave\n\nThese tales and watch the homefire burn\n\nWhen I return – if I return\n\nDo you believe that they’ll believe.\n\n5\/10\/15\n\nGetting a touch of influenza am turning in at 2030 and the trusty Mitchell is bringing a hot rum and milk Will try and sweat it out. Too much sickness in trenches – wastage of men is awful, Hospitals in Egypt want shaking up to push a few out.\n\nRoused out of bed at 2213 with report from Mackay that two Turks were lying down in front of parapet and wanting to know what to do as they would not respond to \"Boo-ri-gler Gel\". Told him to use his discretion and turned in again. Believe an interpreter came in afterwards and told them how to come in if they wanted.\n","10":"\n\nUp late for \"stand to\" and at down went down to beach with Curnow for a swim. Went in off a barge and had a thorough clean up. Climbed back in fine style. Cruiser bombarding enemy’s trenches. Changed boots and clothes and put on Ef’s socks\n\nAbdul very quiet. Graveyard being improved immensely and well looked after. Good view of Gaba Tepe from beach – pleasant open country. Suvla Bay full of war ships and cargo boats and all brisk looking. \n\nNothing doing this morning. Influenza sending a number to hospital. Japanese bomb gun having a pot – blowback severe. Artillery getting on to Gun Ridge – aeroplane spotting.\n\nCrosses some very large marking graves on top of cliff – many a one elsewhere absolutely forgotten particularly in among dugouts in Wire Gully\n\n6\/10\/15\n\nDuring afternoon went down to 6th Field Ambulance and beach, Jack taken aboard hospital ship this morning and sent to MUDROS. Said to be pretty bad – doubtful what the illness is. Query diphtheria. Quiet evening. After stroll round fire trench turned in.\n","11":"\n\nAfter stand to left for morning dip at Anzac Cove with doctor. Quite dark still at 0545 days becoming shorter. Had good dip. Amusing to see the tough looking crowd the fatigues are – all kinds of uniforms and all bearded and filthy. Noticed several new shrubs coming through the big sap Thomsen to Beach party vice Lewis transferred to Engineers\n\nDirecting a fatigue party at the shore at the present is an Imperial officer, very ‘Imperial’ in his monocle waxed moustache & cane He has a habit of putting one hand to his eyeglass and with the other pointing his cane at various boxes. ‘Put that heah that theah and those theah over heah’ The men took to mimicking him. One day he turned round to find 5 or 6 with their identification discs in their eyes and sticks in their hands taking him off. For a moment he flushed Then rose to the occasion Tossing his monocle into the air he caught it neatly in his eye as it fell ‘None of you can bally well do that he drawled \"so theah\" None of them could either, and he is very popular with them now\n\n7\/10\/15\n\nDugouts damp and unhealthy – cannot lie down on a warm day without waterproof sheet and at least one blanket underneath to stop damp coming up from floor. \n\nQuiet during day. Went down mines and tunnels with Bazely, wonderful maze with charges all laid ready to blow up. Drives all timbered by our expert miners, pitch dark, forward firing line just ready for breaking through. Right under them in many cases. They are on same game but we go deep to avoid meeting. Different levels reached per rope down shafts Crouched right at end of each drive on their own are listeners with lighted candles and fixed bayonets. One hour shifts – a tedious job sitting feet under ground just listening for the Turks. Occasionally they blow us up – we retaliate. Last occasion the depth below was too great and their explosion only caused the floor of tunnel to lift like a wave and then subside again. A wonderful labyrinth – quite a relief to get into daylight once more.\n\nQuiet until after tea. Remarkable to state there has been no artillery bombardment today. A few usual sharp sniping until 2030 when first Divn made demonstration sent up parachute rockets, opened heavy rifle and machine gun fire and torpedo boats started firing broadsides on to enemy’s trenches. The enemy evidently had a demonstration readied up too for they opened very heavily a second or two before our folk started. Noise prodigious. So hot that our men had to stand to arms here but not a shot was fired although on our right \"A\" Co. they whipped it in pretty thick. All of sudden they seemed to get the jumps (perhaps some of war ships shells landed right up here) and then the event of the evening occurred. I think the incident must have occurred from some Turk who lost his block as they would not give show away otherwise\n\n7\/10\/15\n\nAt 2045 a verbal report from A Co \"Gas on our right\". Phoned them to verify and received message in confirmation. Collared helmet (gas) and respirator. Received message gas was emitted from bomb. Reported to Brigade. Went up to have a look at it with Major Smith. Shortly after leaving Reg office a sweetish smell (not unpleasant) became noticeable – something like rodoform. Reached firing line and passed on to A Co. all men there looking like divers with their heads covered with gas helmets and respirators. Some of the \"nuts\" said they had lost their respirators or could not find them and consequently thought of the alternative of the sock drenched in u. Some had socks they had been wearing continuously for weeks soaked in the liquid and plastered over mouths. A desperate remedy but it worked all right. Others complained that though they could produce the sock they could not produce the other necessary not being able to rise to the occasion.\n\nReached spot where donning of our helmets and respirators became imperative. Sweet smell overpowering and dreadful irritation to eyes which felt as if being burnt out, ears almost bursting, knees weak. Went right in under blankets put up as usual by spraying squad but their antidote did not seem very effective as the gas slowly spent itself. Searched for bomb case but could not find it. Almost overpowered had to retreat and took a while to recover. 2 men laid out. Later on recovered bomb case and the gas slowly dispersed. Eyes very much affected unable to sleep for over an hour\n","12":"\n\nGood swim with Drummond and Major Smith Remarkable appearance the cliff presents running up from beach. A mass of dugouts terrace on terrace. Fires puffing about.\n\nQuiet morning. A slack day in the interior economy of Regiment Feeling ill with influenza which is alright up till about noon but after that makes me very miserable. Turned in at 1400 and slept a feverish sleep until 1700 worried by flies and \"nervy\" sudden explosion of shells and big guns waking me up with a start frequently. Hope to be alright soon.\n\nSoil here is a limestone formation my dugout is pretty well hacked \nup\n out of limestone. Being on slope it is always like a tomb, chilly and damp, and it catches every gale off the Gulf of Saros and Aegean Sea.\n\nIn evening went into question of C -- . Engineers will explode a mine at 1400 today. They can hear Abdul working a few feet away so hope to blow him to hell before he does the same to us. Later two men are to creep out climb up side of the C – inspect interior and report what is there. Rather a ticklish job as the C – is garrisoned and any head poking over the top is likely to be blown off at once without further parley. However they only have 4 yards to crawl as they will emerge from a secret underground tunnel Returning they will be exposed to rifle and machine gun fire at about 100 yards range but there are no lack of volunteers for the job. \n\nRain came on during evening. Place sticky and filthy Sea roaring. Rain driving in on blankets while asleep. To bed 2130\n","13":"\n\nA cold night and the \"stand to\" was in pitch dark – mud clinging everywhere. Still feeling unwell so did not go for swim. Heard later that wind and rough water caused considerable rise in tide mark, washed away two piers, dislocated water apparatus and threatens store stacks. Wrecked ketch turned turtle . Barges adrift and tossing about Everyone put on half rations only ½ a gallon of water per day being issued to each man \n\nLittle scheme on the C – failed to reach fruition. The Turks got in first and blew us up, however their Engineers were a few feet out and no damage resulted. We will concoct another scheme. Meantime where they least suspect underneath them is sufficient to blow a few of Islam’s disciples to the deepest hell, - just waiting to be touched off. Man named Reid \"C\" Co. missing. Disappeared last night at 2300 left all equipment deserted his post and cannot be found. Men speak of groans heard over parapet but nothing in sight this morning This man was blown clean off firing step the other day by a shell but was absolutely unhurt since then he has not been quite rational. \n\nTurk crept up to 21st lines last night, probably to surrender. They let him poke his head right over parapet and then blew his face off – buried him this morning. Bullet caught one of the burial party in the leg, they took him to hospital Shell landed in hospital blew them all out, 3 wounded. Hotham, Fraser and Gaunt all dead. Keeping correspondence with hospital as evidence of difficulty in eliciting information\n\n9\/11\/15\n\nRain had peculiar effect on acoustic properties of this place. After first shower machine gun fire sounding like pom poms, ordinary rifle shots like the same, bombs also shells every sound magnified and rather alarming at first. Ground very hard\n\n10\/10\/15\n\n0430 . Stars bright tried to pick up Great Bear and Orion but unsuccessfully in the few seconds I had to spare. used we are to the rifle fire. At present the place is reverberating with rifle discharges. rumbling down the valley but one does not notice it After the first day or two\n\nExtracts from diary of captured Turkish officer\n\n24th August Arrived At Ouzoun Keopho. We will remain here until evening. We are about 200, the majority ghazi, even some of the men have not yet their wounds healed and they are gallant who run to avenge\n\n25 Aug We reached Kara Pinah at 6 hours instead of 7.30. This is a Christian village and the laziness of the inhabitants is understood from the fertile but uncultivated ground.\n\n1 Sep 1915 There is tea every morning and regular food. There are always olives and raisins. This regularity I had not seen at school\n\n2 Sep 1915 In firing line are instruments for seeing closer without being seen. I had hardly lifted instrument when bullet broke it. This welcome not too pleasant. I am careless of the dum dums bursting round me \n\n4 Sep Bomb dropped from aeroplanes cause us great damage. The men have left everything to God and expect to be killed every moment. Machine guns firing from enemy trenches only 30 metres away deprive us of many of our dear comrades. My ears are deafened, the ships ceased firing, with fixed bayonets we await enemys attack\n\n5 Sep Our battalion will take over the trenches today. I say that our part was safer than the other because while on the right the opposite trenches are almost touching each other, our distance is about 150 metres\n\n(From 2nd to 5th applies to sector directly opposite us, and to our left AW)\n","14":"\n\nSwim at beach off a water barge, All stores wet and tangled up with gale and piers damaged. Barges in many case thrown broadside on up the beach and waterlogged a terrible mess and a blow to their neatness. Constructing a new terrace about 30’ up cliff and stacking some stuff there. SAA Carts and other vehicles (hundred) in line along the beach nearly all awash to axles \n\nGaba Tepe looking its best by growing dawn ---- viewed from sap opposite Indian Camp. Hospital ships changing places\n\nQuiet morning here in trenches and continued all day until about 1645 when our Islamic friend started to get closer inch by inch in his underground digging until we were much afraid we would have to blow him up Orders flying round and kept at work here until knowing what to get on to next. \n\nAt 1900 their tunnel seemed to take a turn away from us judging by sound but on the morrow it is hoped to break right up inside, push a force up and take the C – with cold steel, under cover of the night and then command place. Quite a far amount of rifle and machine gun fire tonight and the dead eerie sound of bursting bombs everywhere around us Bed Aired at 2142\n","15":"\n\nRain and cold for the hour’s \"stand to\" but grapped a towel at \"carry on\" woke Doctor and got a glow up walking briskly through saps down to the beach. Had a good brisk swim but appeared to be shortwinded. The tug up the hill on the return journey is a killer but whole operation from leaving here to getting back is 1 hour. Clean\n\n11\/10\/15\n\nCan hear little birds singing around, as a rule they are very scarce. Several bushes covered densely with yellow flowers – the only blooms seen so far since arrival. Quiet day with shower of rain in afternoon which we could see coming miles away over the ship strewn sea and over from Suvla Bay. Went up to observation post and pulled sandbag out and had a quiet look through my telescope at the trenches of our dear friend. Such an untidy place spotted loop holes &c but really at such short distance the naked eye almost takes it all in. \n\nAt dark 3 men crept out and went as far as C - , found it consists of two separate holes both with little holes like trap doors in the bottom Returned unseen and reported, only the usual exchange of shots and bombs going on this evening really nothing special. \n\nThe man Reed who has been missing for some days suffering from loss of memory, wandering along beach near 1 Div. HQ, turned up again in charge of someone who found him quite deranged and a nervous wreck and he will have to be sent away at once. Quite normal until about a week ago when a shell blew him clean off the firing step but did not injure him. \n\nQuiet night and so to bed\n","16":"\n\nRain, and cold wind pitch dark. Evidently raining again during the night. Growing dawn – glimpse of Cape Gaba Tepe through break in the sap. The beach cemetery looking well kempt and neat. Good swim off lighter and clean and fresh after it, well worth the tiring climb back. Passed thick patch of graves on hillside. Officer’s, and at his feet scores of little tin & wooden crosses in rows. In fire trench 2 .\n\nLovely sunshine at 0900 noted two birds singing but could not se them\n\n12\/10\/15\n\nBlue dancing in breeze – cruisers standing off in line with Chessboard but out of range. Quiet day as regards actual fighting but busy in other respects. Some preparations for the little show that will take place any time now. Mail arrived and all sorted – not a very large one but acceptable. Great waiting for Canteen stuff to come, made place ready. Only up fire trench a couple of times. \nP.\n has no grip on his company. Nothing doing during evening – a little rain. To bed early.\n","17":"\n\nStand to 0455 pitch dark & cold. Carry on 0540. \n\nWith Drummond for a swim alright in but deuced cold out. Down and back in ¾ hour getting into form again. Sun bright this morning, but wind icy – all the waves flecked with white caps.\n\nLittle bombardment & \nbayonet\n bullet work today but our men are working like slaves taking tons of earth of the mines and drives and tunnels we are putting out.\n\nThe earth is shot down chutes down the side of the hill and is gradually covering up one neat grave with head-cross. It will be completely underground in a day or two and it will be one more nameless grave. Our men are picking and mining like devils spurred on with rum. The enemy we can hear doing the same as we approach they recede, then they are heard elsewhere and we have to countermine no rest after one another all the time. Mines ready laid for touch off but the ground between the trenches has under it hundreds and hundreds of yards of subterranean passages Bde HQ a dugout driven right in alongside a grave its occupant can only be a couple of feet away and on the other side are more\n\n13\/10\/15\n\nRound gully before lunch – view from dressing station very good. \n\nNotice field artillery guns and transport SAA carts painted indefinite daubed colours in irregular patches and covered up with bushes to avoid discovery. 1505 our artillery including some new guns on hill opposite opened fire – some venomous reports.\n\n1545. First blood, Brooks \"A\" Co blown up – dead. Shrapnel. \n\nDuring day and last night large flocks of large birds flew overhead southwards in long chains migrating from here as the winter is fast approaching. Today has been very cold and sharp, the sun though shining has little warmth in it. Perhaps the birds were ibses going to winter in Australia – their strange call echoed through the night. Some sports in the trenches trying pot shots at them with their rifles. Apparently some thing doing on the left judging by the rifle fire there. Busy all evening on canteen work and early to bed\n","18":"\n\nThe cold piercing. Curnow Drummond & I had good swim but wind very cold. Got a good glow up walking back from beach. All night the cry of the migrating birds was to be heard. Abdul seems to have a new snipers post – we have not been worried since sand bagging the parapet and gully higher up but this morning a bullet hit and sent dirt all over me in my dugout. All activity is under the ground these days mining and countermining. Working like demons with\n\n14\/10\/15\n\npick and shovel the whole 24 hours and expecting to be blown to hell any moment. 300 bags of spoils taken out yesterday and tipped down slope engulfing a number of neat wooden crosses and making nameless graves of them. The listeners with lighted candles crouched at the head of the drives patiently waiting and listening for enemy working \n\nThe artillery effect on infantry is remarkable. The knowledge of effective support from our own guns raises morale up to high water mark while nothing starts more cheery remarks than the sight of a few good shrewd damagers landing on poor plurry Abdul. The lads hate the enemy’s 75’s, gone with a whistle & crash before one can say dammit. Four more wounded men died and buried on beach. Quiet evening and so early to bed\n","19":"\n\nCold again Went for a dip with Drummond water very sharp and rough, showering over barge side a little. A short swim quite long enough and the wind whistled round legs while drying off. Water pipe from barge pumping. Men harnessed to large trucks with ropes hauling coal. Back to mat before breakfast reading. Good appetite and excellent steak for breakfast. Several dogs have wandered over from Turks lines orders are these must be shot at once an account of disease - rabies\n\n15\/10\/15\n\nVery slack in the firing line nothing doing, but great activity under the ground. Getting Reg. office sandbagged up to keep wind out, but two windows to be left to allow sea to be seen from here Remainder of day very quiet spent it reading until 1530 when called to Bde for orders. Orders issued for a big ruse or demonstration in which the whole Army Corps is participating. \n\nAll hands will stand to in dark at 0400 in the morning and on rockets, will belt lead into Abdul. Then with bayonets and dummies sounds with tins followed by cheers and whistles, orders shouted &c. should frighten 6 months growth out of our coloured friends and we hope to draw their fire – artillery may land them a few ticklers too.\n\nOtherwise things tonight are very quiet had a little stale heavy pudding cake for tea and never tasted anything more delicious. Overhauled rifle and other kit and only hope the barboushes come at us in the morning. Brigadier Col. Spencer Brown round the cooks asked \"What do you do with the bones\" Tough old cook \"What the hell do you know about bones\" Brig. \"Well, a shearers cook knows a little\". T.O.C. \"I was cook on a ship and then had 9 months on a station & can lose any shearers cook\". Gift of cigarettes came to hand yesterday. 3 packets of woodbines per man\n\nMachine guns on left have been having some good duels up there today, spitting away most venomously. Card came from Jack yesterday – reached hospital somewhere\n\nBed early\n","20":"\n\nUp and into full fighting kit (an operation taking 30 seconds) at 0330. All cooks batmen &c turned out. RSM & Pioneers at ammun. reserve everyone took post. At 0400 on signal the demonstration took place, two mines exploded near Crater and shook the whole earth. Our rifle fire was not heavy enough in volume to draw much from them but when the Turks were all standing to and their trenches full our artillery suddenly opened. \n\nThe big shells bursting on crowded trenches must have killed & wounded a fair number. Only a couple in reply from them.\n\nSounds of intermittent cannonade from direction of the Narrows and also from towards Cape Hellas. All quiet here 0500 except for the usual cracking sound of bullets landing and the reverberation of others down Wire Gully\n\nPetrass returned from \nCape Hellas\n Imbros last night with canteen stores. Sending Hogarth with 4 men to bring them up at 1000 this morning – mules ordered for then Large orders cleared place right out and our £ 32 was cut down to £ 18. 24th £400 down to £ 25. Fresh stocks arriving so our big order should go through without trouble. Getting contents of boxes so things may be bought by the box in future. Rough trip over there\n\n16\/10\/15\n\nNormal until 1200 when heavy shelling commenced, started by our guns. 75’s whizzing very close, one burst on bank in front, plenty of splinters flying. Siege battery landing heavy shells on Turks in Johnston’s Jolley. Very severe blow back from burst. Swim very good earlier. Slip in \"C\" Co had to be well revetted mans body disclosed partially embedded Rested for hour in dugout. Rising at 03.30 makes one sleepy. Rumours of a mail on the beach. Padre and QM share dugout down valley – the lion lying down with the lamb. \n\nBuckley at Malta progressing favourably we hope. Poor old Hughie the companion of a few nights out and Shepheards dinners in Egypt. The red robed waiters there, gliding, the Eastern food and surroundings. The meal ending with sugar melon or other melon and cafe on the terrace. Sault’s best for supper. Cosmopolitan. Encroaching on street – beggars boys pushing flowers through but melting on a stern \"Imshe yallah ! \"orright Misser Captn. Tier of quaint red brick buildings picked out in different colours. Partisserie Sault. Cafes arabe filthy with chattering crews back gammon & jabbering Perhaps Arab reed & string band Epicerie. lamps with \n\n16\/10\/15\n\nCrowds round about dark. All nationalities well dressed Europeans chattering & laughing. Arabs selling sticks and native cloth, postcards &c. Refuse men at camp in dungarees, & water carters. Women in desert sifting refuse straw for grain.\n\nBed 2045 Long yarn to Bert Curnow\n","21":"\n\nUp and stood to 0450. A raw morning. Carry on 0545. Sent RSM to wake Drummond but found him busy with man with brains blown out. Waited and after he had finished went for usual dip at beach. Cape Gaba Tepe lying green in the growing dawn. \n\nReinforcements drilling on their flat ground, a few drops of rain. Discussed Pepys and Charles II, Oliver Cromwell &c while walking along. New road takes sudden twist across old, so returning had stiff climb at the \"Dirty Dog\" up loose sand and rubble. This locality free from sickening stench of decomposition that was so noticeable when we first came to Anzac. No dirty work lately.\n\nDavis \"B\" Co had top of skull completely blown off by a bullet. If a man gets hit in the trenches he generally dies as the wounds are in the head and the whole brain is often scooped out by a single bullet. The force on impact, at such short range with bullets fired by powerful long range explosive, is disastrous. Shrapnel wounds also severe if catch properly but as rule other parts of the body are exposed to them which gives a man a chance. Body lying on stretcher close to dressing station with only tunic overhead and all the sick parade laughing & chatting round about, taking no heed of what would have been an awe inspiring sight a month or so ago. So mercifully hardened do we get to war’s dark side\n\n17\/10\/15\n\nThe artillery have been more than usually active the guns on Pluggers Plateau firing at odd times reply from enemy only from one or two guns which points to artillery inferiority. With the Territorials Cruisers have been banging away all day – reported Turks damaged a hospital camp.\n\nWhat firewood there is handy on adjacent slopes is rapidly being used up for cooking purposes so the longer we stay the further afield they will have to go. Notices have to be written out on tin, as wooden notice boards soon disappear for firewood. Feast of Bearim is round again 18 – 20th so we are ready in case of fanatical attack. Two spies walking round asking questions, very daring men evidently officers. Death for them if caught\n\nMail in, put fatigue on & made arrangements for prompt sorting. Issued tobacco ration. building up stock of rum. Will make cache to store candles &c against the winter.\n\nAndrew collared 36 eggs and sent them up. Had understanding re canteen stuff for mess. Tonight being Sunday the parsons are wandering round but find no congregations Bullets dropping past overhead nearly spent make weird moaning sound at times, at others, just a buzz like an annoyed wasp. Stand to arms long after dark tonight which seems rather farcical the days are drawing in so much now that time will have to be made 1800 or 1815 instead of 1830\n\n17\/10\/15\n\nWent to bed at 2000 tired\n","22":"\n\nPitch dark and silent soft rain falling at the stand to arms, evidently been raining during the night, the whole place very sticky with clay mud. Still raining & cold at the carry on so did not swim but turned in again and slept soundly until 0800 without my boots on – about the first time I have risked taking them off since being here. Roused by Mitchell shaved dressed and had two eggs, some toast for breakfast. Did not inquire where the eggs came from, - trust a soldier servant to forage round.\n\nQuiet this morning. Our bag was two yesterday – killed by our snipers in secret post in Tambour. I dare swear our shells yesterday caused a few funerals among Turks. I wonder if the mourners chant. \"He was the best man ever known\" like they do in Egypt.\n\nLetters to hand two from home. Geo Thwaites says Caddy dead over here. Today is a typical Australian dull winter’s day after rain.\n\n1528 It has been another quiet day - the big siege battery shells hurtling overhead sound so deliberately plodding away through the air like some big bird with beating wings. A pause of a few seconds and then a resounding crash and roar as it finds its billet. Large shell landed at top of Gully while talking to Thomsen and we could hear large splinters blowing back crouched into bank until we heard it falling aimlessly into something soft\n\nBert Curnow in for a talk during afternoon\n\n18\/10\/15\n\nArranged to domicile the 24th reserve company in rear of firing line the other side of parade ground. more mail 2 from Jake & a parcel. Some angry looking warships in Suvla Bay with nasty fighting tops. The white tented Territorial Camp on hillside is growing larger. Salt lake appears to filling up with the approach of winter. Put out barbed wire entanglements during night two men wounded. Otherwise quiet turned in at 2000 and read Times.\n","23":"\n\nCold at \"stand to\" and read magazine by lamp light. Let Regimental Sergeant Major try his hand at doing the morning Report. Called for doctor and found he had a busy night. Body of Cooper \"B\" Co killed lying round corner Very thin hands clasped, poor chap & bullet thro’ head.\n\nWent for swim water churned up a bit & cold wind. Feeling very fit. Artillery started early and made things very willing – Turks shooting not too good. Their 75 shells coming lower than ever previous and clipping the top leaves off the rhododendrons on the parapet outside Shrapnel blowing back into Reg office & CO’s dugout\n\nSir Ian Hamilton’s farewell order came out & General Munro takes over. War declared against Bulgaria. Pte Malloch \"A\" Co reported back from Malta pale and nervous, crouching when 75’s passed overhead so refrained from showing the base of the big shell that blew him up which we keep lying just outside the dugout. Had his wet equipment driven into his stomach but they appear to have got it out again for him.\n\n19\/10\/15\n\nHe says Major Derrick died the second day after he was wounded but was ill himself and only knows what he was told by medical orderlies, Capt Buckley was disembarked at same place but Malloch was not aware of the fact. It was Asiatic Annie with an 8.7 that blew the three of them out.\n\nParcel from Jake arrived with socks, handkerchiefs chocolate &c which came to me in terms of her letter although it seems bad luck the consignee missed them. One man wounded today in. Rained. Letter from Jack from hospital at Lemnos saying he is getting on alright but has diphtheria. sure enough Turkey (or this part of it at least) seems a devil of a place for centipedes. Watson got a nasty bite.\n\nCO complained of flies in his cap but could see nothing. One time later a 6\" specimen thrust his head out. He had apparently been living there some time. Despatched it with a bayonet. They find harbourages in the crevices between the sandbags and come out at night. The sound of a little thud as one drops in the darkness of the night in the dugout is quite enough to cause a frantic grab at the adjacent bayonet & much striking of matches.\n\nCensoring letters – one man heads his Vermin Villa. \n\nRSM unwell – hope he has not been trying to do too much. He is a willing lad and does not speak out if he finds too much is being put on him. A cold night and quiet here. Rumble of artillery over towards the Narrows. Close escape from bullet, scattered dirt across me\n\n19\/10\/15\n\nObservations on the weather here: -\n\n\"From October 10 to 14 there is a period of uncertainty; sometimes a south westerly wind, which veers round to the north west and a good rainstorm. The first distinct drop in temperature now takes place (about the 10th to the 14th) one feels autumn in the air, the nights continue fairly warm, and this period continues fine & generally calm up to about the 20th sometimes the 18th or 19th – when a well defined & most absolutely regular period is entered upon. \n\nThis spell begins with three or four days of very heavy northernly or north-westernly winds sometimes a gale, generally accompanied by rain for several days and it is this period – from October 20 to October 25 – which is intensely interesting to naturalists owing to the passage of all kinds of birds, the sweeping past of the last of the quails, the arrival of the first woodcock, the clockwork precision of the passage stockdores (pigeons); in fact it is the moment of the big migration, when the air night and day is full of birds on the move. \n\nTowards the end of October, and in the way of a countercoup or reaction to the northerly gales, there is generally experienced a fierce three or four days of southerly winds, sometimes gales. It is to be noted that these gales or changes in the weather are usually of 3 to 7 days duration the first day being the shortest, and for some of these regular winds, the natives have special names November generally, almost always comes in fine with a lovely first ten days or so. It however becomes rather sharp at night and there is to be expected a very marked period now of cold weather – a cold snap in fact. This snap in generally in the second or third week of the month, and only last a few days, the weather going back to fine warm and calm until about the end of the month. Barring such cold snap, the weather is fine and wind is absent, and many people\n\n19\/10\/15\n\nconsider it the most glorious month of the year, the sunsets being especially fine In the last days of November or the first days of December another period is entered upon. There is generally a heavy south wind lasting from three to seven days, which is succeeded by a lovely spell of fine weather, generally perfectly calm & warm, which brings one well through December. Onward from such time in December, say a little before Christmas or just after, the weather varies greatly. \n\nThe marked periods are past - the weather may be anything, sometimes calm and mild, varied by rain, with strong north winds, but no seriously bad weather, in one word, no real winter weather need be looked for until, as the natives put it, the Old New Year – otherwise the New Year, Old Style, which is January 14, our style – comes in.\n\nAfter January 14, or a few days later, the weather is almost invariably bad; there is always a snow blizzard or two, generally between January 20 & 25. These are real bad blizzards, which sometimes last from three to seven days; and after, anything in the way of weather may happen for the next six weeks or two months. The snow has been known to lie six weeks. Strong southerly gales succeed as a rule, the northerly gales, but one thing is to be noted that the south & west winds no longer bring rain, it is to those who have relations or friends in the Dardanelles let them send good warm stockings &c. It is the Turks who will suffer from the cold, they cannot stand it long, and being fed generally mainly on bread they have no stamina to meet cold weather. Most of their troops come from warm climes –\n\nPeninsular Press\n","24":"\n\nDark very late so had to prolong the stand to arms. R.S.M. very unwell, with pain. Let him lie in and arranged breakfast to be taken to him. Swim spoiled by having to clamber out on barge covered with coal dust. Destroyers lying close in and firing for’d gun. New road taking devious course and being cut through old buried refuse stinks a good deal. Saw graves of whole platoon on hillside. At head, officer’s with white large cross, and his feet about 40 small crosses of wood & tin jambed close together – his men. \n\nNormal day with cold bleak wind. At night fire or beacon on Imbros for about half an hour at 0730 which died out rapidly. Flash of cruiser’s guns very rapid & vivid. Caught sight of a shell from our Artillery Road gun in transit. Bed 0845\n\n21\/10\/15\n\nRSM still very unwell so stayed in for \"stand to\". Morning swim under difficulties as they have taken deck out of barge. Quiet day. Canteen stores on beach, sent party down but they say boxes too heavy; tried to get mules. Andrew sent up Reynolds Newspaper London for 3rd so got some \"dinkum oil\". Rain squall blew over at 0500 from Buyuk Anafarta & Suvla, could be seen coming from long distance Clouds very low almost touching Plugges Plateau of course being on a hill top, this is to be expected. \n\nRe Div order about parlying, it turns out on 21st where lines are 20 yards apart, the warbs were yarning to Abdul both parties leaning over their respective parapets & swapping bully beef and other eatables. Petrass reported back from Imbros but was only able to get about £ 40 worth of stuff, instead of £ 158 owing to the\n","25":"\n\nweather there being too rough for the store ship to unload. This means delay & money back to the men in many cases. They will be disappointed. Had salmon, cake & margarine for tea tonight. Owing to fatigues, a few posts vacant at \"stand to\" but made the Wire Gully post up to full strength to carry on. Daily rum issue to our 86 miners approved. Censored letters some very large & interesting. Last night bright fire or beacon visible on Imbros. Men amusing in their expressions. One had clean blankets all neatly spread on firing step ready for bunk when Turkish bullet hit old sandbag & contents smotherd the bed. Look of intense disgust and then the remark in most aggrieved tones. \"You Turkish b---- bastards\". The tone was the amusing part. Bed 0202.\n","26":"\n\nBig mine fired at Lone Pine at 0000 but slept too soundly to hear it. Stand to 0455. RSM still bad, cold dark & windy. 0530, Demonstration by first Divn on our right not extra much rifle fire but cruiser firing shells in as fast as the guns could be served. Our snipers in Tambour do good work causing some funeral parties to Abdul every day. Bagged 2 yesterday. Will have to delay \"carry on\" on account of possible attack in response to activity on right. \n\nOne of the men wakened up by another (a Scotchman) to take his relief, Says \"It cant be time yet, all the watches have stopped\". Scotchman took 5 minutes to see point.\n\nMan writing home says he is so thin he has to wear his greatcoat to throw a shadow. Others remark they hope to be in the Sultan’s harem before Xmas. Poor lads they deserve a good fling upon our return to civilisation. \n\nCapt Morris returned from with the canteen stores after a trying trip owing to rough weather. I leave for Imbros on Monday morning on a similar errand and look forward to the change. The trip takes about 4 days and is a job that requires vigilance all the time. We had orders to detail a Capt\n\n22\/10\/15\n\nfor the job so trust AW to detail himself ! Hear stories of a little village there where a decent meal is to be had and donkey rides to it from camp. Whisky 8\/- a bottle and lager beer also procurable. Will suit some but not a \"wowser\" like myself !! C.O. is a staunch Rechabite but returned from a tour round the trenches when the miners were getting their daily \"dose\", and remarked that he found the smell very enticing and felt he was cultivating a liking for the smell of it.\n\nMonitor lying alongside cruiser today – two big guns one for’d and one aft and an anti-aircraft gun pointing skywards. A blustery, bleak, wintry day the sea rough and foam-flecked, and looking grey & forebidding, the swim at daylight was a chilly business and as they are breaking up the barge I had a devil’s own job to get out of the water, struggling for a long time to haul myself out much to Drummonds amusement.\n\nMore miners reported from 18th Battn. Taking out over 400 bags of spoils daily now – air pump working. We are driving right underneath Abdul’s trenches. Went to bed at 1050 and read for a while\n","27":"\n\nCold & dark & bleak at stand to. Cutting wind. Had to keep the lads standing a long time as day was slow in breaking. Reneged on swim and went back to bad. Slept in until 0800, \n\nWent to Bde HQ and got orders for Imbros trip. Worked my batman in as one of the men to accompany me as the party.\n\nLeave on Monday at 1400. Dead Engineer lying in sap shot through lungs by sniper. Sea rough & foaming. Expect a seasick trip on Monday\n\n23\/10\/15\n\nAbdul put out some wire and pulled in his firing line a bit in one place last night. Rumours of big moves on mainland and in the West. Quiet day but busy with returns. It has been cold. Up to present I have worn shorts and bear knees but nevermore while this snap continues. \n\nDuring after noon with Curnow went to B8 secret m g post and searched the Turks trenches with telescope. Really their work is \n\nwonderful, the trenches are fortifications we will never shift them from with anything but the bayonet and a force about doubled. Trenches covering the hills and in some cases going back hundreds & hundreds of yards. Through telescope could see them moving about one chap walking along trench quietly dressed in grey overcoat, two others chatting and some more using a crosscut saw.\n\nThurlow, the Kings prizeman lying in his snipers nest with telescopic rifle, telescope &c watching them waiting his chance for a kill. Tried a shot or two at 1500 yards but the strong wind spoilt his shooting. He roams round all day waiting a chance and generally gets a couple of \"kills\" at least per day. Nothing doing in evening. Abdul has some fine entanglements out, trestles facing Lone Pine – a very real obstacle to an advance. All the A Co lads growing beards making it very hard to recognise them. Lovely sunset. Bed 2053. A wintry icy day\n\n24\/10\/15\n\nUp and out in the dark and during stand to worked off a few odd Alexandria jobs for 3rd Eshelon. mornings very dark and stood outside Reg. office waiting for it to get light enough to give the carry on. An impressive sight in trenches to see all the troops lined up to their posts every man standing like a statue armed to the teeth, their bayonets held close in to the side, and absolute silence being insisted on. A grim sight. The command \"carry on\" (given when dawn has brought enough light for us to watch enemy movement) is the signal for the strain to relax & those off duty dismiss & turn in. A very trying hour standing there these cold mornings.\n\nThe light was slow in growing today and I had to wait a long time standing on the pathway before the signallers could forward the order. In the distance two hospital ships gay with lights & the Red Cross plainly marked in coloured lights. Dim outlines of other craft just visible. Some getting away before daylight to avoid being seen. Anzac might be full of transports during night but before daylight comes they stand out miles to sea In the foreground and seemingly just beneath feet, deep dark depths in which perhaps an eye of fire or light denotes a dugout Pluggers Plateau looming up against the skyline – a rugged silhouette. Cold wind off the sea\n\n25\/10\/15 \n\nGave Mitchell some orders for the better securing of the dugout against these gales. Capt Bennett at breakfast – the only way we know it is Sunday is by his appearance. Raw wind. Very quiet today so far all wearing greatcoats At Bde HQ talking to Capt Thorn.\n\nSpoils from tunnels now being emptied over cliff near parade ground as well as into Wire Gully. Read & censored letters this morning. Some light rain up to 3 o’clock. Went up firing line, things quiet, yarning to men all complaining of cold but very cheerful everywhere. The Turks have fires, probably braziers, in their trenches and the smoke could be seen rising in places. Greatcoats the order of the day always warn over equipment. Men asleep on firing step getting wet. \n\nThe large dugouts now being completed will be cosy – one central passage with recesses or bunks driven off them. Chief cause of discomfort is the broken sleep. 1 hour on & 2 hours off breaks into a man’s rest too much, but is very necessary as at night a fellow starts to see things if on sentry any longer than an hour. Standing there observing & sniping in this cold nearly freezes them. All old soldiers now and used to discomfort – see the beach fatigue lying out in open curled up anywhere in greatcoats fast asleep or huddled together like little children, filthy & tired. If their people could only see them! \n\nWent to secret machine gun post with Jack McCaul and examined Turkish trenches through telescope. At 1200 yards could see party collecting wood with bags & hatchets chopping out the roots. Our snipers popping at a periscope and the Turk waiving washouts with it until our bullets got too close. McCaul killed a man there a little earlier. Their barbed wire a very efficient obstacle. Our trenches on skyline and very even & regular. Theirs an irregular mass. Good\n","28":"\n\nloopholes & head cover everywhere. They are in a hollow and drainage should big problem when wet weather sets in properly. It is a wonderful sight to see their fortifications running right back trench after trench Could see them at work with pick & shovel. Poor old fat Turk’s body still there and sinking gradually into ground Colonel Burston invalided away. \n\nMitchell improved dugout and dug down making a raised bed of earth on the other side. Sound of heavy rifle fire on left and heavy cannonade with big guns beyond Suvla Bay and round Narrows & Hellas. Sounds of birds migrating overhead & calling to each other. Turkish snipers sending bullets whizzing very dangerously close along path in front of Reg. office. Bed 2030. Message received not to go to Imbros tomorrow, perhaps weather too rough.\n\n25\/10\/15\n\nBright vivid moonlight at stand to and cold. The moon is wonderful here & in Egypt no wonder the star & crescent are so often met with . This symbol is on every cartridge, and takes the place of the red cross on all flags. Peart arrive from Alexandria with a few details. Also reported that Hunter & our 3rd reinforcements have arrived. Over to Bde HQ lovely warm morning quite a change and perfect view from there. \n\nQuantity of goods from Egypt on the beach unable to buy gumboots there. Buckley gone to England. Quiet sunny morning. 130 odd reinforcements &c on the parade ground. Our old friend, Vreinna there and one or two others. Hurried them out of the way for fear of shells\n\n25\/10\/15\n\nVery amusing to hear our veterans pulling their legs. They anticipate a rest but I doubt whether 130 will make very much difference as tunnelling is progressing apace and over 1500 bags of spoil removed daily. Went down to secret post in \"D\" Co overlooking German officers and searched the place with telescope but could detect no movements of any sort. Returned to lunch. Went down to secret post in \"A\" Co with Drummond & Curnow and had telescope over the whole place. Saw a few Turks working and marvelled exceedingly at the strength and amount of labour expended in their trenches, probably a lot of the work is done by civilian gangs of Armenians under taskmasters. \n\nReceived Kitchener’s message. My advice is \"dig\". Went on to Lone Pine trenches & saw Capt Parkes and Frawley. Good deal of head cover. In one place they are directly opposite to 22nd trenches and it was novel to see our own trenches just as the Turks see them. They are marvellously neat and clean looking compared with their irregular lines but this very regularity has its serious drawbacks.\n\nArtillery started 75’s flying round passed through several posts wrecked with shrapnel so took shelter underground in tunnel until bombardment ceased. Going back found reinforcements wondering what sort of a place this was with so much ironmongery hurtling about. Saw Foote in 23rd lines. Glorious sunset\n","29":"\n\nMajor Smith laid up with tonsillitis. Quiet evening & turned in at 0800. Read \"Old Curiosity Shop\" sent over by DeBoos.\n\n26\/10\/15\n\n\"Stand to\" altered to 0530. Carry on half an hour after, a great concession & much appreciated. Noticed cooperation of bombardiers & machine guns Just as the bomber throws the bomb the machine gunner sends in a burst forcing them to keep their heads down so they cannot see where the bomb is going to land. Turks adopt the same practice so the sound is \"rattle – rattle\" bang ! \n\nMany men lousy & wear trousers inside out as lice congregate in seams. Some funny sights. Some change their underclothes weekly – the change consists of turning the garments inside out. The Navy are making an extensive bombardment on all the front today from Cape Hellas up to north of Suvla. Met Capt Curnow & with him went along to Courtney’s & Quinns Posts through 21st along to 17th battalion. Trenches nothing like as clean or good as ours & in 17th are very shallow ones head being only about 4 inches below the line of fire. The renowned Quinns is well fortified and overhead and evidently keeps off the bombs Looking through periscope their trenches are very close and potting away consistently. Lying in between are relics of the last fray. Saw Proudfoot, Saxon, Bradford and others. Retchford unwell. Navy putting in a few shells\n","30":"\n\nPeart dealing out goods Hogarth supervising. I always laugh when I think of the wag who got 4 hours pack drill for the heinous offence of saying \"Kiss me Sergeant\". The amusing evidence \"He said \"Kiss me Sergeant\" in tones of what appeared to me to be blasphemy \"Lord J--- C--- who trod on my b----y foot\".\n\nPioneers roofing Reg office, went round looking at odds & ends all afternoon. Quiet in firing line. Wallaby rifle stands erected – ingenious contrivances for laying rifle on different objects & worked by a dial register, one scale giving angle of traverse and the other the elevation. The rifle is laid but the recoil is absorbed by springs consequently aim is not deflected. Saw shot after shot put through an enemy loophole. Rifle is laid in daytime and most firing done at night. \n\nG.O.G. returned for hernia his frozen insteps impelled him rake up this complaint,heavy a good riddance. Very quiet up firing line potting away\n\nA good trap Note 1 Pitfall in front of parapet - Ground level - barbed\n\nBed at 0810. Very heavy and loud cannonade of the big guns for about 20 minutes from our Navy. Read for a while & then to sleep\n","31":"\n\nMoonlight at stand to arms. Woke Doctor at 0600 and went for swim – used coal barge swept clean by heavy seas. Water good but very rough and swimming difficult, hard to get out without being bumped. Fatigue of Indians working on new terrace for stores – sleeping soldiers huddled up anywhere tired out.\n\nCame back via new road. Very close morning and somehow the weather today seems to have made me dreadfully irritable. The staff are getting hell roused out them. Will go & walk it off; \n\nBursting shells very close big splinters blowing back after burst and thudding into bank 0950. 75’s skimming within inches of roof and bursting down gully. Parties hard at work removing miners spoils – 1500 bags a day. A light Horse trooper attained record in sniping Got his 199th Turk yesterday, every hit carefully recorded and verified by independent observer, often an officer\n\nSevere bombardment this morning on sea & land, everyone lying low 2 men killed 3 wounded by a shell from Asiatic Annie over the Asiaside of the straits. A fine sunny day but a heavy sea on roaring in with foam flecked waves a beautiful sight. Body unearthed in parapets by shelling\n\n27\/10\/15\n\narranged for reburial. The most glorious sunset. Sea a dark blue rough with white crested waves dashing in, vivid blue sky but in the west a sudden blaze of gold. Lying at anchor a cruiser & a hospital ship every detail standing out very clearly. \n\nSearched enemy trenches from secret gun position using telescope but could see no Turks. Spotted their mules and a colony of dugouts or what seemed like gun positions about a mile and a half away. Water rations here small and after portion for cooking is extracted leaves very little for each mans portion. Dialogue today. Sgt dealing out water. Man said nothing but stood gazing at the little flood swirling in bottom of his mess tin as if fascinated\n\nSgt\n - \"Well, what the \"ell you looking at?\"\n\nPte\n - \"Nothin, just wishing I was a b --- canary\"\n\nFor some accountable reason I have been in a most irritable mood today ever since morning and not a few round about are also aware of the fact. Today after very cold weather, has suddenly come in quite hot, with winds from the opposite quarter perhaps the atmospheric conditions have something to do with the irritability\n\nMuch struck by religious books etc I find in the kit of nearly every man killed, all showing signs of constant use although the owner may have in life been a veritable waster. \n\nWeather funny going round trenches CSM Porter using periscope as a and\n\n27\/10\/15\n\ndoing a \"can – can\" dance to the amusement of quite an audience\n\nTurned in early\n","32":"\n\nOn half rations of water today owing to rough weather. Also back to bully beef and army biscuit. Round back of hill and via Dressing station to our store. Much struck by the altered appearance of the place since we came here – good graded roads and the whole place cleared and terraced. Saw padre at Store, much overworked as he has to prepare 9 men for confirmation\n\nA heavy billet – the padre’s Indian mule drivers jabbering away, they are from the mountain district in north of India and are decidedly Mongolian in countenance. Good little workers they are too. Taube aeroplane up aloft circling round. Parcel of mouth organs came from England & some gifts cigarettes are advised from Lady Hamilton’s fund Mudros. G O C sent back by Ambulance as fit for duty once more. Major Williams APM had a talk about courtmartials, very interesting as he has a waggish twin Capt Bridges, son of late G.O.C. – decent fellow. Sprayers at work with disinfectant so engineering work can be carried on where corpses uncovered. Major Swift messes alone today. \n\nWent to bed early and lay for a while just listening to the rattle of the rifles just in front and the deep dull boom of exploding bombs. The rattle of machine guns, ours a dull low sound theirs staccato & sharp and all the time enemy bullets pit – a – pat into the sandbags just overhead – an occasional richochet shrieking off through the air like a lost soul What an insane business this is\n\n29\/10\/15\n\nUp betimes for stand to but felt very tired. Enemy sniping very persistently during night probably our rifle laying machines causing them losses – Sent 2 to 23rd as more use for them there.\n\nDoctor unable to swim so went alone. Barge driven ashore gave good place to dive off. Usual destroyer standing bombarding the left. slight sea on. Returning came through cemetery Egyptian labour camp & Indian mule drivers on right. Passed unexploded 8.2 shell lying on ground probably from Chanak or from the \"Goeber\". Before breakfast watched Beachy Bill trying to hit brigs and lighters bringing stores in, but unsuccessful in their shooting, little fountains of spray raise all around them.\n\nArmy biscuit for breakfast, bread supply stopped by rough weather. Returning from swim ascended steep cliff direct to Sig. office instead of following winding road Noticed a little clump of yellow daises in bloom Several limbs of bodies protruding so put pioneers on covering them up. Visited Brauns Hill at 1115 and turned out the post there. All correct. Inspected Turks lines but no movement visible Arranged to change the garrison – the job is an easy one & will give ailing men a rest from the firetrench. \n\nSaw Capt Willis for first time since landing here. Believe while shelling was in progress the other day the Maltese labourers ran amok dashing about scared and some and some were pushing their heads into small holes leaving the rest of the body exposed ostrichlike! At 1145 a heavy bombardment started, nearly all the guns of Plugges Plateau shelling the enemy’s 75’s were very thick. At 1200 a mine of 150 pounds of guncotton was exploded under Abdul. The\n","33":"\n\nearth lifted slightly and then fell back underfoot and the sound was a low muffled boom. After cessation of the shelling and when the enemy would commence moving about from dugouts, the siege battery suddenly put in some beauties which must have killed some Islamites\n\nRound big sap & passed several stretchers en route for dressing station. About 1330 engineers entered sap where mine had been exploded taking precaution of wearing gas helmets. Unfortunately these proved useless and the results have been serious. There are three men still in the tunnel where they collapsed so they will probably be \"mafish\". Lieut. Bowra who was chatting to me here about an hour ago is reported dead but I hope not. Bazeley & Rodda are also bad. A good many affected\n\nThe scene at the Dressing station is distressing the poor chaps writhing in agony so much that they can hardly keep them on the stretchers. Staff of doctors and dressers hard at work. Hope Bowra is not dead & others progress alright.\n\n1515. C.O. says Bowra dead and two others. I sent Bowra off to fire the mine just an hour before. Chatting a long time & actually said \"It is time to go up & touch her off\". A nice chap. Most of the men laid out are rescuers who the fumes affected. Thom also reported dead. 1545. Went up to \"A\" Co and had a good spy round through telescope. Some shells and bombs landing on\n\n29\/10\/15\n\nGerman Officer’s trenches. No movement in enemy lines beyond the base of an occasional shovel depositing some dirt over parapet. 1700, Ptes Spelling and Goode dead \"C\" Co and Stewart sent to hospital – mine fumes. Roused hell out of pioneers for leaving corpses lying about so casually. Found them sitting down eating tea & so on with corpses in the middle & some others blocking up gangway. Everyone gets very callous.\n\nEnemy putting in some lovely shells, big ones bursting down valley. 75’s have been coming right on us here today, am thinking if roof will take more sandbags Quiet evening. \n\nDead buried by candlelight. Bed 0820\n","34":"\n\nMoonlight at stand to. Constant dysentery. Enemy putting some shrewd bullets one after the other into & just over parapet had to crouch along to dugout. Met Capt Curnow 0615 & went to beach. Dived off a cheese barge Very good. 1st Brigade returned Lying in dugouts & on beach, old soldiers. Our men in Lone Pine jeering at Turks whose bombs were dropping short. Very heavy rumble of big guns on our right nearly all day. Curnow called in and went up lines with him. \n\nOn way passed place where excellent view can be obtained.\n\nGaba Tepe projecting low out into the blue water all in shadow, save where an odd ray through light clouds showed up mirror-like on sea. Achi Baba and the range rising about 10 miles away fertile pleasant looking country in between but at present rather unhealthy for anyone going that way owing to shrapnellitis ! \n\nFrom B9 with telescope could see Turks gathering wood men working, others with their small vari-coloured caps walking with their rifles slung, mules trotting round with water barrels & swarthy drivers\n","35":"\n\nWas awakened in middle of night by orderly with despatch – merely a bunch of correspondence of trivial matters from Brigade. Cursed. Moonlight at stand to. Suffering from dysentery so had neither swim nor breakfast. Back to bed and case of self inflicted wound reported. Went down to dressing station found one of our reinforcements had developed cold feet and put a bullet through his body – not serious but plenty of blood Had Court of Inquiry assembled inside 5 minutes and his evidence taken. Stopped evacuation from peninsular and warned Provosts staff Hope to get this man sentenced to good stiff term by Court Martial \"pour encourager les autres\"\n\nStick bomb cleared hill and burst down slope a good shot right from enemy’s trenches. Padre down – it must be Sunday Mass proceeding on parade ground. When time hangs heavy I smoke an occasional cigarette, am almost an \"habitual\" smoker. Enemy sniping very slack but plenty of rattles with machine guns. \n\nAbout 1130 a thick fog came up from the sea suddenly and turned a sunny day into a raw cold one. One could see it coming blotting out everything as it advanced. Doubled our posts in firing line. Sending away dead men’s kits. Letter from Buckley written from Valletta just prior to departing for England, Says he feels funny in head. Derrick died two days out. Man who was buried by \"Asiatic Annie’s\" shell escaped from hospital and was wandering round the firing line. Mental balance evidently disturbed\n\nKennedy (rheumatism) invalided to England. During afternoon picked up some machine gun work from Stewart, in order to be able to work a gun myself as a last hope. Andrew up – beach party to be changed tomorrow. Arranged details. Ordered to proceed to Imbros tomorrow for Canteen stores. Shelling started after tea\n\n31\/10\/15\n\nGas again, bad in C.22. One man very bad with it. Tapping alleged to be heard under us, perhaps Abdul working away Some of them were wandering about outside their trenches, and great confabulation was heard. About 2000, some good shots being put in by cruiser. Some wind and rain. Expect Imbros expedition will be postponed again Bed 2030. Read for a while. Bullet planked right inside and buried into the limestone near bed\n","36":"\n\nBad with dysentery. Chilly after & during stand to. Turks tapping heard right under our trenches. Siege battery shook up Johnston’s Jolly landing shells in trench apparently used as cooking place. A lovely fresh morning the sea dark blue and white crested. Imbros showing up very plain. Everything clearest.\n\nA heavy sea on, dashing up on beach. Too rough to land water so probably too rough for canteen expedition – at the least a rough passage assured\n\nReinforcements drilling and doing their musketry down in gully. Three bags of mail arrived. Letter from Daisy. More mail to follow. Warships lying out, looking very close their grey paint as like seawater as anything could be. At 1200 reported to Bde HQ with party for Imbros, nice and sunny. Reached beach and found it sea swept and deserted. Unable to land anything. Saw P.M. who said there were no doubts about the seas being too large for safe passage and prophesied resumption of the service perhaps tomorrow but quite dependent on sea moderating. Returning to Bde HQ killed a viper about 12 inches long and vicious looking. Completed the journey from here to beach and back in half an hour. All the men puffed \n\n1\/1\/15\n\nIn firing line could see Turks working after firewood about 1500 yards away. Through telescope could large object raise up from between crater & our trenches. At first thought some of the men were having a joke and were waving a sort of large scarecrow about from side to side. Closer investigation showed that the thing was probably a very large periscope wrapped in sacking and hidden from view of our chaps in front by a fold in the ground. Evidently being manipulated from a secret tunnel recess. \n\nMcDonald \"A\" Co died of wounds. Bombs from trench mortar in Johnstons Jolly bursting round here and likely to do damage. Hitherto they have been bursting harmlessly in midair \n\nBed 2030\n","37":"\n\nMelbourne Cup Day. Still bad with dysentery. Up at \"stand to\", carry on 0600, but mornings getting dark at that hour now’a days. Quiet during the night. Slight wind today and sunshine. Sea calmer. C.O. unwell. \n\n \nAn Anzac tall story\n \" A Gurkha was taking a Turkish prisoner down to the beach. The Turk suddenly broke away and ran off. The Gurkha stood still and threw his \"kukri\" (knife) The Turk called out \"You missed me you – \" The Gurkha said \"Liar ! shake your head !\" The Turk shook his head and it rolled of and fell at his feet\"\n\nThe enemy have evidently realised that their bombs into \"A\" Co have hitherto been doing no good, and have lately been sending them twice as far landing them down the rear slope and dangerously close round here. The bombs are made of a brass shell case standing about 2’ 6\" high and labelled \"Carlsruhe 1904\" about 4 inches in diameter at base, fitted with a wooden plug & detonator and full\n\n2\/11\/15\n\nof explosive and iron filing – or old jagged S.A.A. cases. The tail is a stick one and steers the affair & the mortar must be a powerful one to carry as it does\n\n1915. Have kept closely to headquarters all day but am feeling better tonight, Dr having prescribed for me. Bed early\n","38":"\n\nHad a good night. Read from \"carry on\" until breakfast time. At Bde. HQrs talking to Thorn - on half rations of water again. B’dier storing things up considerably. Q.M. dropped in during morning. Lovely day and sea very calm. Only odd shots going, but shells dropping apparently out of sky in to odd spots. New gun probably on Chessboard. Have seen plan showing name of every enemy battery occupying the trenches opposite to us so our Intelligence Service has been doing a little.\n\nAeroplanes very active yesterday & the day before, one or two up this morning. Yesterday they put some machine gun slots into my little observatory in B8 wounding two. \n\nMail reported to be on beach. Reading today that population of Imbros is 9200 & that of Samothrace 3000 mostly Greeks.\n\n\"Beachy Bill\" at about 1445 commenced shelling beach and put in some damaging shells but some very erratic ones too\n\nAt 1600 a 4\" inch from new gun hit No 10 post in \"B\" Co killed 1 wounded two. Got shell & shrapnel bullets, very likely the same gun that was landing them round here at noon Angle of descent seems to be very steep, perhaps the gun is some distance away Received letters &c. Mail not all up yet. Turned in at about 2015. Quiet night. Search lights sweeping over from Narrows, some cannonade\n","39":"\n\nQuite well in health. Usual routine followed up to noon. Sea rough and very picturesque. The valley below seems to become more and more denuded of undergrowth daily and with its now well made and graded road is quite a different place to the scrubby and precipitous ravine up which we climbed a little over two months since\n\nSome gift articles from Lady Hamilton’s fund arrived and were duly distributed, some unpatriotic dog though having appropriated some money & chutney alleged to be in the parcel when dispatched\n\nThe Valley full of men who are coming to take part of our line off us – a good target for shrapnel but their aeroplanes have not been aloft today so the enemy gunners are probably unaware of their presence there. - After lunch some cold rain fell just enough to make the air fresher and the ground muddy and the sun shone out for the rest of the afternoon \n\n\"Beachy Bill\" rather busy but our artillery much more so it is said one of our shells the other day killed 5 Turks and wounded 27 others. The howitzers and the siege battery certainly do good work. A Turkish sniper got Todd \"B\" Co while emptying sandbags Probably served him right for exposing himself and he was taken away pretty bad, shot through back. Rumbling bombardment over towards Achi Baba. It is wonderful how used we now are to shells going overhead and give them no notice, and can generally tell by the sound where they are going & whether ours or the enemy. When they start to get close one sits up and takes a little interest and wastes no time dreaming before diving into dugout. \n\nThe below\n\n4\/11\/15\n\nis a translation of message thrown into us by the Turks probably a counterblast to ours of a similar nature asking them to surrender –\n\n\"To our Brave Enemy\n\nI have spoken with people from different parts of AsiaMinor. I asked them what the English people were doing. In the parts where the English walk they quickly make plenty of friends whatever they want is procured for them. In places they walk amidst gardens and streams. They are living in good health with the friends they have found. The Turks are doing all the work for the prisoners. Come! surrender! the hospitality of the Turks will make you well\"\n\nWe get plenty of information from deserters and from prisoners and know a good deal about strengths dispositions etc`\t\t\t\t. At 2040 starting with a steady \"dribble\" from machine guns the enemy gradually worked up to a great fusillade of heavy musketry probably to cover a counterattack on some trenches our right advanced last night. Bombs whizzing very close only a foot or so overhead and bursting down the valley passing like streaks of fire. We did not reply unless targets offered.\n\n2100 slackening off but our machine guns are letting out an occasional burst so some target must be presented. Quite a lively interlude – some excitement to appreciate after the dullness of late. Like old times Mitchell putting roof of iron of my dugout after dark stirred up a nice little hornet’s nest the snipers poured it in so close he had to leave the job until black darkness set in. Bed at 2200 fully equipped and ready\n","40":"\n\nQuiet night after their outburst Did not sleep again after carry on. Brighter around about 0800. Turks did attack a new trench of ours on the right of us last night but we beat them off. Attack was only a short section & of the nature of a sortie. The flares, rockets and other illuminations last night made the scene as bright as day. \n\nThe morning sea calm and the smoke rising listlessly straight up from the funnels of the warships lying in Suvla Bay. \n\n1030 A lovely warm sunny morning craggy Samothrace showing up frowningly. Went up to B8 with telescope and could see Turks working away at their sandbags under cover and some sitting in the sun on the slopes enjoying the warmth. Talking to Curnow & Thomsen found them digging into their dugout. Arranged with to go down to beach this afternoon. C.O. busy with an orderly room Roberts \"A\" Co alleged asleep on his post and a Cpl. (mg) of 24th when on ½ rations of water drank the reserve water used for water jacket. Great neglect hope he goes up for it \n\n26th Batt down in valley still. Haze coming up over Suvla in distance. Artillery quiet. During the afternoon some big shells landed hereabouts and came closer to headquarters than ever one beauty landing close beside sig’s office on slope just in front sending clouds of dirt and rubbish up into the air shaking a few out of their graves in the process. Another followed immediately and a few more down the gully, 75’s also whizzing round, Met Craig and then took shelter in the Dressing station for a while\n\n5\/11\/15\n\nwatching other bursts. Continued down road to beach passing the mule drivers (Indian) in their neat uniform driving in pairs their mule teams of four. On each mule a wooden frame holding on either side 3 petrol tins of water for Wire Gully tanks. Lower down the 26th Battn watching the shells all round and paying no heed to safety only venting a \"gorblime\" if one bursts too close\n\nPassed Egyptian & Maltese Labor colonies to beach which was very busy – the water smooth & the ships looking well lying out of artillery range, tugs & lighters being unloaded. A good deal of seaweed being thrown up and stacks being moved further back beyond high water mark. Bread and fresh meat being unloaded and sentries with fixed bayonets patrolling it. Saw Gurkhas standing near stack of empty rum jars and one pulled a cork out of jar at the bottom upsetting the balance of the stack which crashed over frightening hell out of \"Johnny\" as our men call Gurkhas.\n\nPassed venerable old man with flowing grey beard evidently head serang of the labourers. Continued along to north beach which was so altered as to be almost unrecognisable a breakwater has been made by filling a ship with sandbags and driving her full speed ashore where wanted. Old paddle steamer hard at work on a tow line New huts of wood built right into the cliff side have been constructed for the beach fatigue party. Men hard at work constructing dugout for officers &c. Passed enormous ordnance stacks of greatcoats saddlery equipment and rifles &c which have been collected from around and placed in neat piles for overhaul and reissue. A small cemetery with very few crosses the prevailing tombstone being a square piece of wood neatly painted\n\n5\/11\/15\n\nA large number of large snowy marquee tents denote a Territorial Casualty station and further round the ammun column also under canvas The whole scene thronged with soldiers working on different jobs fetching carrying digging and doing a thousand and things. Dress nondescript Egyptians Maltese Gurkha’ Tommies Australians all going hard. Passed large stacks of heavy shells for the howitzers, which battery is a few hundred yards further on but quite concealed from view. \n\nEspied a tent marked YMCA with tables & writing materials all this under shell fire and at the front . Behind a shed marked canteen guarded by sturdy military police, a waiting queue being outside the door closed and only two allowed in at a time. Bowled up & by virtue of rank ushered in with much deference the door closing with a bang after us. Not a sign of any goods in sight and we were informed all sold out. Craig discoursed on general subjects occasionally dropping hints about always previously having stuff kept specially out for him until at last his talk and the magic of my three stars perhaps led to the introduction of 2 cakes and 6 strings of figs, item 5\/6. The figs very nice and threaded on a rush or flax & tied in circles each string holding about 30 figs. Carried our bag back like\n\n5\/11\/15\n\na couple of old dames returning from market taking turns. Gaba Tepe lying quiet and peaceful with this lovely sea all around. Had steady climb back up road when a big 6\" shell struck a foot below top of hill (a shade more elevation & it must have caught us) and threw cloud of dirt upwards. We took cover to escape shrapnel which lashed round us like a summer storm. The gentlemen on the top of the hill at once commenced to execute a war dance and passing a verdict of \"gordstruth\" continued tea just as if it was not a miracle they were not all sent to eternity. \n\n1800 Word of expected attack on our right so all hands very alert. Machine gun slashing bullets past this place like flight of birds close following each other. The evening was fairly quiet except for rattles of machine gun fire and occasional shells from our artillery and warships Four men bathing knocked out by shrapnel. Night fairly quiet a few stray shells and flares of various kinds, rockets &c finishing off Guy Fawkes Day\n","41":"\n\n0430 Our gunboat dropping shells on Abdul, recovered at 0700 buse of new 6\" shell that landed here yesterday. A nice sunny day with a calm sea but cool in the shade\n\n75’s flying about divine afternoon. Todd \"B\" Co dead. Official message states – Patrobus won Melbourne Cup 7 to 1. Posted news up in trenches. \"Right close\" begun. M gun bullets flicking past like angry wasps & hellish close. To bed at 1815 tired\n","42":"\n\nHad to prolong the \"stand to\" until 0610 on account of bad light Dawn did not arrive until that time. Enquired into rays of light reported During night Abdul under fire put out about 60 yards wire entanglements Sent men down for 19 bags of mail and received some letters As the padre was at breakfast I conclude that today is a Sunday On to bully beef and biscuits again for some reason. Much better on two meals a day considering how little exercise we get. \n\nThis morning the sea is idle and hardly a ripple. Searching with telescope notice large boom at Suvla Bay lying like a snake on the water. This is only visible under extremely calm conditions. The Bay still has the cargo vessels there and some warboats. Further inland of course the trenches of the second line of the English defences can be followed. The salt lake is dry, growing canvas camps on the hillsides and along the beach, and between Cathedral pinnacle and the Bay is pleasant countryside. \n\nTwo big hospital boats fine vessels lying at anchor and the usual fleet of sweeps and destroyers also about. The cruiser anchored out of shell range and behind a quaint craft with a heavy gun for’d painted a peculiar colour that is very excellent disguise one old sailing store ship is also at rest. Much afraid the messed up & delayed canteen trip to Imbros will never come off as we hear no more stores are there available. Rather disappointing after looking forward to it\n\nof late during the night our guns have developed a habit which must of necessity be most aggravating & annoying to the Turks, to wit, at odd intervals sending a big shell over into their fire trenches. It is believed to be their practice to fully man their trenches at night and rest during the day so the effect must be great on full trenches.\n\nQuery\n \nEgypt\n Noticed great many tumblers and acrobats among the native children wearing tights and spangled doublets turning somersaults and doing contortionist tricks. This class seems nomadic. Gipsies in England are frequently referred to as \"the Egyptians\" and if indications are anything there does seem to be some connection between gipsies and this class of native not only in looks but in habits as well.\n\nTaubes aloft yesterday dropped bombs but our aeroplanes are much more enterprising and give great aid by their work in reconnoitring. We opened on Taubes yesterday with antiaircraft guns which have never been used by us before although the enemy have a number of fire many shots without result. \n\nAfter lunch through telescope again scrutinised the sea. The ironclad behind the cruiser was painted white and had a big gun for’d and steel turret and superstructure. She stood right in a bombarded the Chessboard judging by sound and flash she would be 4 – 5 miles away but the concussion dislodged loose earth of dugout walls. She then steamed south. Met Capt Avinon at 1400 and walked around to North beach passing the mules & and Indians with heavy cartloads of meat and saw four horses two being ridden and two lead The first we’ve \n\n7\/11\/15\n\nseen here. Passed men carrying cakes & strings of figs from YMCA canteens. The beach the usual hive of industry Wounded & sick lying near new pier waiting to be taken off by the hospital launch. Maltese & Egyptian labourers about and not a few Greeks. Some big \"goolahs\" lying in a heap. At YMCA canteen crowds waiting in an orderly queue controlled by MP’s\n\nOn return heavy shelling from 75’s to which our batteries replied.\n\nWhen corpses are exposed by shells tearing away parapets it is found best to leave them there until pioneers arrive with bag. The other day a shell sent one three months corpse flying head first out and when a man essayed to pull the identification disc off the head came away too.\n\n1924 Damn Turks can be heard at their entanglements again snicking and hammering. We are putting in some rapid and some machine gun fire.\n","43":"\n\nDawn disclosed 20 yards more barbed wire pushed out by Abdul. \n\nVery chilly and sharp morning succeeded by lovely warm sunny day but very cold in the shade. The sea very calm. Nothing much doing. At lunch a good search from secret post disclosed only an odd mule whisking round corner of track otherwise very quiet in enemy lines. We attacked last night on right and gained objective with small loss. Lone Pine also pushing on to enemy workings and their tunnel yesterday disclosed 12 very dead and buried Turks who had to be carted away piecemeal and reburied. \n\n21st Batt did the \"right close’ which relieved the strain on us. Bombs & m.g’s quieter tonight. An old bad egg up again some time since in the person of our\n\n8\/11\/15\n\nold friend Pte. Emmanuel Vienna chronic cooks fatigue man. The gentleman had the misfortune the day we left Le Caire to sustain an overdose of Biere des Pyramides & whilst reclining on the highway a gharry run over him and he had to go to hospital. However he’s here at last doing his bit. Emmanuel ! – and the irony of it, the low nickname he gets is \"Tucker\" Vienna. One does meet some characters What about old Hannaberry. And Ralston’s indignant reply when questioned why he didn’t embark with us. Carragher & Nicholas are doing good work in the firing line. Bed 2015.\n","44":"\n\nVery dark at stand to and cold withal having perforce to relinquish \"shorts\" once more in favour of warmer breeches. \n\n\"Carry on’ 0620. At 0635 the Turks fired a mine, the place rocked with the earth tremor and unpleasant fumes came right down our trenches. Their engineers calculations must have been all out as no damage occurred to our underground works and their mine was of shallow depth as the upper surface of the ground is broken into a small crater. In Lone Pine our chaps very neatly broke into & collared a big stretch of their tunnels and some trench which we now hold. Round trenches fixing up taking over and found latrines filthy and other things.\n\nPadre gradually unloading himself of censoring. Busy here just before lunch, sea is as calm as a pond. destroyers suddenly started dashing round and round at full speed (probably after a submarine) around cruiser. After lunch cruiser steamed along and \n\nbombardedtheright 1st Divn putting in broadsides for a while aeroplane spotting. At1415 we up to B8 and had good spy round with glass nothing much doing. Could see the provisions coming up and a long way off small parties picking berries& wild olives (Noticed walking round todaythat someof the shrubs are bursting out with wax coloured white berries.\n\n9\/11\/15\n\nSaw a Turk about 1500 yards away sitting in the sun engaged in the occupation everyone daily indulges in, in our trenches and which is known as the pastime of \"lousing\". wearing a grey cap & a greatcoat, his other garments spread out carefully on the ground beside him he was picking every thing over with scrupulous care. Fired two shots at him at 1500 yards with telescopic rifle but he took no notice. Thurlow (our \"crack\") tried a few but the range was too great, the nearest bullet landing 20 yards to the right. 1900. We have patrols out in front seeing what they can pick up. \n\nHow appearances alter here half the men wearing breeches turned inside out to avoid harbouring in seams. Cruiser has had a busy day manoeuvring about and firing. Rather hazy out to sea. After dark being such a calm sea the hospital ships looked very well, outlined in red & green lights from stem to stern and a complete reflection showing up in the water. Major Smith developed pleurisy and off duty as consequence.Never tasted it before coming here but has now acquired the taste Bed 2015\n","45":"\n\nSome rain during night and a little mud about at stand to arms. Could have Turks sapping under us. Patrols saw nothing while reconnoitring beyond sandbags being repaired on parapets. Cruiser uses very powerful electric lamp for signalling by day as well as night being dull & cloudy today it shows up wonderfully. Constant stream of fatigue men carrying bags of spoils from tunnels and tipping them in front of Signal Office where quite a lot of new ground is being added to our \"back yard\". Before dark enemy rocked in some shrapnel and being a dull evening\n\n10\/11\/15\n\nthe bursting flash of the shells was very pretty. Today is the most sedentary day I’ve spent since arriving in Anzac. Have been siting down all day & had no exercise. Feel nothing like as \"fit\" and alert as in Egypt where the tough raining made us hard as nails. After dinner in the evening heard Tom sounded on a ship’s bugles. The first bugle call we have heard for 2 months, and a sound it is to gladden a soldiers heart ! Remember the massed buglers of the Westminster Dragoons sounding \"Officers Mess\" at Kasr el Nil Le Caire. listening from a houseboat on the Nile with the whole scene draped in wonderful night, who could forget ?! Nothing doing during the evening. Bed 2000\n","46":"\n\n\"Stand to\" altered to 0600. Things much the same only Abdul put two more parcels of wire out. Thurlow killed a Turk in one of their pits. Our patrol could see them moving about a little, some bombing was done from CRATER we will probably have some good men & true with a little cold steel waiting to receive their visit. The sea this morning rough with a westerly breeze the grey vessels matching the troubled waves in colour. Major Smith ill pleurisy, doctor will probably send away. Mackay acting second in command. Shall go as OC ‘D’ Co ? Gas still bad in C2 one man affected this morning and work had to cease\n\nWent over with CO & had interview with Brigadier Colonel R Spencer Brown – he has \n\"force\"\n\nQuiet day bustling up respirators and so on. Dense haze over sea, although sun has been bright during the afternoon. R Smith left for\n\n11\/11\/15 hospital. Andrew has swollen face Roberts unwell. A few close shells this afternoon. Engineering started near Dressing Station. Expression heard today: - \"A man cannot be said to have lived till he’s kissed his ladye & kylled his manne\". Wrote letters until 2000 and then went to bed. All retire early here. Proposed to make our tea hour after stand to arms 1800 in future Jerry the cook went to hospital yesterday the \"handover’ hasn’t the sober man’s constitution. \n\nSearchlights very active from direction of the Straits and throwing fitful gleams across the sky. Before turning in had a little flutter of excitement to finish off the day. At latrines enemy machine gun started the bullets flowing a constant stream not a foot overhead clipping through shrubs on parapet which were agitated as by wind. When bullets commenced flicking earth on level with shoulders concluded it politic to crouch down for a while then creep out on all fours. Flicking over my dug out now to bullets are passing like a horde of hungry wasps buzzing with anger. \n\nSearchlights flashing across sky all night. At 2035 heavy fire & bombing started on the left near Popes and looked like a general go in the people opposite letting their machine guns run wild for a bit but all gradually became quiet During the night heavy rain set in so today am wearing gumboots. So slippery near Regtl Office at stand to that it took about five minutes to \"step\" up the slope.\n","47":"\n\nAir washed clean everything standing out very clear to the eye. Raining nearly all morning and cold too. Enemy & ourselves both quiet no artillery firing on land but warships up Suvla Bay rumbling. After lunch with Curnow went to B8 and through telescope could see Turks much busier then usual. Strings of laden mules and horses passing and repassing, for the first time visible in two places one higher up the winding track. Many soldiers moving along also. Could see parties gathering wood, but how unfortunate it is the naked eye can see none of these unaided else how many kills we would get – but then the distance is too much for our rifles. Along firing line - Pedler digging in right down feet below ground level. \n\nBazeley took an unexploded 75 shell to pieces, - a lovely piece of delicate mechanism every part most beautifully finished and turned. Base of shell for about 9\" full of black powder. High explosive striking pin &c forming separate part connecting with nose.\n\nWent round back of hill, now completely altered, walking right down comparatively easy what was previously extremely steep. \n\nTerraces, cook fires, working parties, spoils from tunnels provides good building up material for reducing grades. Big mail reported at beach. Bomb reported to have landed on 23rd Battn & killed a few wounded others. Dam stick bombs are b – o. Have had a few narrow escapes damn ‘em & they’ll probably get me yet\n","48":"\n\nQuiet night our patrols could see the enemy working and others about they seem beggars for wandering about over the bullet swept ground. A loud scream was heard about midnight so someone probably stopped one. Dark dull day, saw crew busy on destroyer doubling up and down aeroplane passing overhead very fast. Persistent rumours today that Lord Kitchener has been having a look round but probably all furphey although it was officially announced he was coming to have a look at the Eastern front.\n\n1766 bags of mail landed for the Army Corps. We have message for fatigue so hope for some mail tonight. Climbed up hill for exercise. Two meal of a day racket is working well – tea after stand to. Enemy quiet so far today. Both our artillery & theirs taking things easy last few days.\n\n1745 Now hear officially Kitchener was here two days ago. New crater caused by mine the other day wants watching and machine gun is laid on it for tonight. About 1700 some 75’s knocking round and splinters nasty. Had some fairly close. Lamp alight at 1730 After \"stand to\" read Cawthorne having got commission Salmon took over RSM. What responsibilities these youths shoulder to the disgrace of men who stay at home. This youth of 19 is the Reg. SM of 1000 men and in attack is the key of the system that supplies every round they fire. And look at Cawthorne and the other boys leading men in a life & death affair like this \n\nDrummond came up two days ago\n\n13\/11\/15\n\nand together we watched a tiny speck shining brightly in the waves between hospital ship and a buoy and moving slowly We decided it must be a partially submerged petrol tin with just the corner showing It now turns out it was a submarine periscope as one was sighted on that day. Mackay round at 2000 after rum. It is remarkable how many have got into habit of taking a night cap of this strong spirit – a habit I‘ve not contracted though always on for a taste if there is a chance of good rum & milk. To bed 2015 bright beautiful moonlight, a lovely scene. An occasional big bomb bursting in a blinding flash and some shells from one of our new heavy guns on the North Shore tearing very hard overhead. Marvellous moon light in this part of world.\n","49":"\n\nUp at stand to Abdul busy and bustling as usual. Mail in not many letters. Mine fired at Lone Pine at 1100, not much concussion Heavy rumbling of big guns down to the south. Today Sunday busy rigging up standard for a flying fox down the gully.\n\nTunnel through from dressing station started, entrance well boarded up. Aeroplane up flying low and a good deal of shrapnel round it. Cruiser standing well out. Only the Suvla hospital ship in sight and all quiet on sea. A dull day with grey skies. Mail coming in during day and a parcel & some mittens from Jakey also arrived, and some snaps. Busy with clerical work after lunch Recd first of the London papers from WND. Met Curnow at 1530 and went to Gun Lane Field Artillery officer explained all about 18 pounders there and found it interesting. Gun pit a fair distance ahead but gun a neutral one. Sergt had better knowledge and gun was dirty, so critical does soldiering make us\n\n14\/11\/15\n\nAll round firing line and supports on the right men cooking. Bombs bursting, men all talking about the Xmas the papers are so full of. Strange man in 23rd who evidently knew me inquired re Jack, seemed to think he’d gone further than Lemnos. Buckley writes from London and complains of a partial paralysis from shock.\n\nI find the two meal system a day good. Breakfast 0830 and dinner at 1800 after dark good appetite and feel no need for anything in between Vigorous outdoor work might perhaps call for more fuel. 12 more bags of mail coming up. Rough sea probably no mail tomorrow. At mess Colonel Mackay, Hogarth, McLennan Stewart & self ! Conversation turned on ecclesiastical law. Parcel arrived by mail. Read Times of 22\/10\/15 and noted the general depressing aspect of things. Stood surveying the scene in moonlight and turned in at 2030.\n","50":"\n\nUp at \"stand to\" some rain made paths slippery, night was a quiet one not much frightfulness. Diving morning visited quartermaster. Working parties quiet transforming the whole gully road going right below us, cooks on terraces sandbags everywhere. Earth from tunnels enables place to be built up hollows filled and grades reduced. Salmon new CSM settling down, put the pioneers directly under the\n\n15\/1\/15\n\njurisdiction of the QM to get more work out of them. Shrubs out in red berries, our men eat them & Turks can be seen out collecting them in bags. Sent a few home in a packet. Some bushes have white waxy blooms. Ants getting the honey. Artillery quiet here today but down south a terrific cannonade is raging and continues all day. \n\nAfter lunch went down to 6th Field Ambulance to see Major Smith. Found him nearly better and should be out tomorrow. Lloyd McKay also there, Lloyd bad. Extremely heavy sea on, the breakers dashing right up on the beach with a roar. Beach deserted all boats standing well out. Gaba Tepe and the other capes very pretty with troubled water all round and nice flat country extending inland. Indian mule drivers chattering. They have their own Red Cross people. Donkeys & mules very handy – these fellows know how to manage them. \n\nEnjoyed climb back nothing like it used to be big parties doing pick & shovel work reducing grades and road making. Artillery limbers covered with bushes and painted all colours of rainbow noticed with pleasure on tailboard of each the starred ensign of the Commonwealth. 145 miners drawing rum. Quite hardened topers each man tosses it off neat with great relish. Rain lightening & thunder. The place so slippery that I measured full length on path & could only climb up by dragging self along by sand bags, uch. an \nEnglish\n officer reported in as artillery observer – so \nEnglish\n Lightning very vivid\n\nRead Times Bed 2025\n","51":"\n\nRough night. Turned out at stand to in gumboots and then with telescope went up firing line. Reconnoitred from B8 but could not glean much beyond seeing that our shells have knocked over some of Abduls entanglements Returned via Curnow who is rotten with septic. From parade ground splendid view washed clean, Samothrace a deep blue. Suvla full of warships. I have never seen the mainland of Turkey and Bulgaria stand out so plainly – the whole a study in blue. A wintry Gippsland day\n\n1500 Sunny & bright aeroplane on usual daily round. Some shells, shrapnel & 75 at lunch time Long killed in \"A\" Co machine gun. Box of gift stationary & tobacco arrived. Earth from tunnels is building up quite a parade ground near sigs. office, near Dressing station tunnel is well in & flying fox has been erected to take spoils down valley. How the scene has changed since we landed. Precipitous slopes have been graded down, hillsides terraced scrub cut, chasms filled in. Cooks are all neatly on terraces, mule carts running up & down road where previously everything had to be conveyed on the backs of sweating men. Round valley dumps extending covering graves & crosses\n\n21st QM fatigue man bushy beard & rabbit skin coat, bare arms like cave dweller. Sea very tranquil, 3 hospital ships in and great number of sweeps & tugs getting close inshore for nights work. Cruiser throwing shells inland with boom & crash\n\n16\/11\/15\n\nMajor Smith returned from hospital but is still unwell. Lovely coppery gold sunset behind Imbros, - delightful shades of blue there, always are in these seas. Quiet evening. \n\nNote in dead man’s book \"Picket in Cairo from 9 to 8 16\/8\/15 walking the slumes of the washer and the comperment we get is picket no bleddy good five fives twenty five picket on want zigazig\" How like those damned niggers!\n\nBed 2030 Slept soundly until called on 17\/11\/15 at 0555 and then again till 0625 when the faithful Peart came to dugout. Gave carry on and then prepared Morning Report. Patrol saw Turkish sentry on barbed wire fast asleep standing up. Others at intervals. Base rumour going round that Abdul has captured 5000 miles of wireless with which he intends to repair his entanglements in front of Jolly blown away by us. The enemy active with stick bombs two landed on bank a few yards from Regtl HQ and one blew up one of the Bde. watertanks. \n\nShaved early Mitchell still a good steady batman and quite reliable everything runs quietly perfectly clean. Went down slope near Sig office and reaching road climbed back the front way, fairly clean everywhere and cooks busy but noted a few points to \"roar\" about, 5 & 6th Battns landed from Rest camp and bivouacked in valley, found place so altered and improved by us as to be almost transformed. Capt Comins ill thyphoid & Col Bennett also left at Lemnos. \n\n3 hours drill a day and issues of beer and stout. Sea rough again today Watched torpedo boat destroyer through telescope nose dipping right under and seas sweeping her from stem to stern. cruiser & hospital ship labouring Beach white with foam large rollers coming in. Less rations again until \n","52":"\n\nDuring afternoon went up to B8 but owing to gusty wind & general unpleasantness of day Turks seemed to be keeping close to earth. Saw a few mules loads of provisions and saw one Turk full length come out stretch and louse himself. Work proceeding underground and they have raised or planted in pit sharp pointed stakes which it is thought they may attempt to connect into entanglements with barbed wire tonight. Accordingly laid rifle machine to sweep & pick off a few. At 1700 went down slope and saw a body uncovered but dumping spoils tomorrow will conceal. Had look at graves of officer and all his platoon. Some little boards only had \"Identity unknown\" climbed up for the exercise & found padre looking pale yarned for a while and then round via Dressing station home.\n\nAt 1600 took long periscope up to observation post and had a good at the pleasing landscape over the rear of the Jolly. Rum sauce & plum duff for tea. Censors tales. One man writing to donors newspaper tobacco fund said \"Thanks for your gift which was much appreciated. Of course when divided up each mans share was necessarily small but we trust the fountain of your generosity is not yet dried up\". Another by diligent reading discovers the Kaiser to be the Beast of the Revelation & dilates thereon at great length. The letters to Doll &\nto\n the romance of the Candles also spring to mind. \n\nGreat scenes at beach biscuit & bully afloat piers being bashed about, transport wagons being carried out to sea about 500 men working to shift stuff and generally a scene of merry hell. Artillery nearly inactive the last two days pointing to (1) shortage of ammunition (2) ‘saving up’ to give us one crowded day as previously. 1900 raining & slippery, bags fell from wall of office. Torrential rain set in being at its heaviest at 1930 at which hour Abdul sent up two flares and commenced heavy fire with rifle mg & bombs so some of the coys. had to stand to arms The whole place was soon a flood, the water streaming past the Regtl. office like a waterfall the interior was soon an inch or two deep. In my dugout it was beautifully dry inside but\n\n17\/11\/15\n\n6 inches of water all outside, latrines flooded. The firing line in a terrible state & men spent a wretched night.\n","53":"\n\nUp cold wet & bleak at stand to. Does rain always make Turks jumpy? Carried straight on instead of going back to bed, put on gumboots and went up trenches. At intervals all the way up found parts under water, the men’s dugouts washed out kits and blankets soaking & muddy. All cheerful and\n\njoking ; \"gorblime & fishermans holiday, wet & no fish Along firing line in \"B\" Co all muddy & filthy. Got on firing step & put periscope up just as the glorious sun appeared above the horizon. It was a lovely sight, One sudden burst of gold behind the mountains of Asiaright in rear of the Turks trenches & just across the Dardanelles. A glowing rosy blush that extended slowly across the heavens – something to remember. Continued through ‘A’ Co & found things still sloppy. From B8 could see enemy periscopes, two, examining the ground in front. Evidently very respectful of our snipers as only exposed them for a few seconds. No other sign of life in their lines. \n\nReturning through 23rd lines & was talking to Ward. Cruisers \"Endymion\" & \"Grafton’ change places out here. Only craft in sight today is hospital ship a long way out altho’ sea much calmer than yesterday.\n\nMajor Smith had pair of socks to spare so thought to give them away to someone in the firing line. Approached one wag & said \"My people are sending me too many socks. How are you off?\" Answer \"Sir I’ve got a pair for every day of the week\" Says Major \"you’re well off\" Wag,\" Yes but it’s the same pair.\"\n\nEngineers to blow up counter mine & yet enable our main work to continue undamaged, work in threes\n\nBlow up 1 or 2 at counter mines\n\n3 continues – enemy destroyed\n\n18\/11\/15\n\nThings continued quiet in spite of a little artillery go until 1530 at which hour Curnow came along! Meantime the cold was damnable feet like ice so we took a walk down to the beach. Beachy Bill had a couple of pots at us but only a floating wisp of shell smoke showed the burst. Continued down and found the beach crowded with fatigue men busy shifting goods to further above high water mark. Big fatigues on terraces Watson’s pier almost washed away no shipping near shore. Passed Sikhs and Gurkhas and motley degenerate looking crowd of Greeks & Maltese. Beachy Bill put a shell within a few yards of us. Turkish aeroplane aloft dropped bomb into water sending fountain of spray straight up. Our anti aircraft gun burst a shell just underneath & plane turned sharply and planed down homewards.\n\nBreakwater ship smashed about by storm and one tugboat a wreck. Mules hard at work, drivers calling out \"Boosh! Boosh!\" Returning noticed a few men drunk on broached rum but did not \"see\" them as it means 2 years penal servitude if detected. Beachy just missed us with another shot so we came up thro’ sap. During gale last night tug overturned near hospital ship and sunk our last three days homeward mail – 100 of mine. Through burial ground 1 board \"In memory of 55 comrades\", another 2 brothers ‘D’ Alton.\n\nBack up hill and met Dr Mackay. Recalled conversation of two men who been appointed to sanitary squad discussing new work (1) \"This war may last for ---- years too!\"\n\n(2) \"Years! it may last for f --- ever!\"\n\nAll quiet after tea. Reported that man was buried with gas helmet & respirator on body Asked the Pioneer Sgt. where the hell he thought the gentleman’s soul was bound for that he had to give him those articles Furphey around that coffee & Nicholas 24th killed by a 75. During early\n\n18\/11\/15\n\nBeachy Bill continues pot shots in the dark shelling the beach. About 4 a minute for a short spell. Pair of socks arrived from Mrs Nash. To bed 2030. Enemy continued shelling beach all night and our guns retaliated two to one by shelling Jolly & Chessboard. Bitterly cold\n","54":"\n\nUp in the pitch dark but kept warm by flannel shirt issued last night. Busy summarising intelligence and other work until 0730 Enemy shelling beach continuously, our cruiser is unable to pick up the gun. Enemy plane up very early but disappeared. Took walk down hill and climbed up before breakfast. Over to Bde. at 1130 and saw periscope in gun very ingenious Saw General Legge in lines at Wire Gully. Aeroplane up. 4 big hospital ships in. Sea calm & dotted with sweeps & destroyers. \n\nEnemy shelling beach all the time – must have put in hundreds of shells today. After lunch went up to B8 & had usual scrutiny of Turks position. Saw one in purple baggy trousers a white doublet and white skull cap stroll leisurely along in open sap. Thurlow had a dead bead on him just as he turned into a communication trench. Another about 400 yards away behind loophole poked his up for a few seconds. Thurlow has been stalking him for day but purposely did not fire but lay back quietly to give the other confidence. Next time his head comes up will be his last. A battle of wits. \n\nEnemy opened with 75’s & and went very close here clipping tops off shrubs one shell landed in ‘B’ Co cooks blew up water tanks and damaged about 16 utensils. Beyond knocking a couple of men over no other results. Took walk down hill & up\n\nAt sunset went to Dressing Station & talked to Dr. \n\nCruiser dealing out some shells\n","55":"\n\nVery dark and cold at stand to Uneventful night except for a little signalling by lights from near farm house 2 miles behind Abdul. Wind freshening and roughing up like a few days ago \n\nStill on bully beef and biscuit. Water half rations the men have had no issue for three days and in consequence unable to wash or shave. When on half rations all the water goes into the tea, personally though, loving a good hard swig at the water jug at home I have not had a drink of straight out water for 3 months, only a cup of tea at each meal. \n\nAfter breakfast went to B8 and saw many Turks coming and going in Mule Valley besides mules with heavy loads of goods many with bulky loads like tents or tarpaulins. Pte CF Roberts \"A\" Coy. sentenced 2 years imprisonment with hard labour for dozing on his post. Read sentence in fire trench to as many as could be brought to within earshot. Proceedings solemn and made an impression though am certain the sentence will be suspended for the present. \n\nUsual \"wag\". Remarks overheard, \"Struth!, hard labour! – that’ll be worse than death to Roberts\". Prisoner is a noted loafer \n\nBleak wind all day. Climbed up hill to get circulation going. Recommenced 3 meals daily vice two. Cruiser before lunch bombarded rear of Jolly violently and over towards Beachy Bill, 6 big guns going off together made great roar. Aeroplane spotting with puffs of enemy shells alround some very close, saw her dodge one by suddenly altering course. C O. suspended. Major Smith assumed command. Mackay second in command. constructing kite on parade ground. Special care is being taken to guard against attack in stormy weather, it is thought Abdul may come at us then particularly as our supplies are disorganized owing to rough weather. It is dark at 1720 nowadays. Mail (strays) a few letters and papers to hand.\n\nBeing bright moonlight our patrol did not go out but some of their snipers were seen to sneak out and potted at the heads of our sentries showing up over the parapets. Price \"A\" got one through the brain and is pretty sure to die. A fine young chap always clean and willing and a favourite of mine ever since he joined the Battn. One of our old hands who served through Egypt & feel\n\n20\/11\/15\n\nhis loss very much. Smith \"B\" Co. dead otherwise quiet during night.\n","56":"\n\nMajor Smith still in command. C.O. like Achilles keeps to his tent. Bitterly cold before dawn and later a piercing wind from Gulf of Saros combined with a ledden sky makes greatcoats & mufflers the rule. Water supply again very scanty and sea roughening up again probably cutting off communication once more. Proposal to make Mitchell bachsheesh Corpl of batmen turned down by me. Fatigues carrying sandbags are my envy today, good warming exercise. This place will be hellish cold in snow time. Proposal mooted for material strengthening of show by a little straight cut. Some reserve work for us then most likely. \n\nReply re B’dier & C.O. should today come from A.A.G. to settle present condition of affairs which is meantime \"dem’d unsatisfactory\". Sent ORS Peart down to 23rd endeavouring to elicit some information re Jack, whose long continued silence is causing me some worry. He elicited nothing but the promise to send information up. With Major Smith went up firing line and located our position on Mortar Ridge also picked place for our snipers to sneak out to. Price died poor chap and am anxious to have his death avenged. Smith’s brother very broken up took his brother’s belongings. The two brothers were on the one post. \n\nWe blew mine up at Russells Top during morning and since then \n\nbombing and firing have been very vigorous. Very quiet and very cold. Sea said to be fairly calm. Being Sunday Peart went to service at Cook’s fires One day is so like another here Sunday is not noticed In fact it is my busy day and I know that Abdul’s bullets are just as deadly then as any other day. Talk of an issue (in fact it’s approved) of margarine or butter cheese, oxo peasoup vegetable & chocolate in lieu of rum. How can they do it when it is impossible to land water even\n\nBed at 2030\n\nA hopeless dawn! Biting cold, pitch dark Turks evidently keeping as quiet as we are. No water again Things quiet until our cruiser started to get on to their camp when their guns commenced on us. Dressing station going to be shifted Drummond moved into Deanery. Bde HQ will take place of Dressing Station. \n\nAm supposed to sail for Imbros at 1200 but seas too rough & cold At 1230 reported to Bde. and received passes and orders. Special private commission to get a \"gorblime\" soft cap for Thorn, a British warm and enquire price of other things as also urgent entreaties to bring back a bottle of brandy & whisky each for Major RS & Major H Collected party & proceeded to North Beach Sea fairly calm. Crowd round MLO’s office. View from beach looking up cliffs there (Cathedral Rock, Snipers Cleft & dugouts) remarkable. Gradual slope and white tents in foreground\n\nRepresentation of nearly every Bde. in Anzac with 6 men each & in addition all the men for fresh vegetables who were unable to proceed yesterday Obtained passes from ornate official in coat who announced Major Chamberlain would have to sign Went outside and presently a message arrived from the otherside telling of rough conditions there so mafish. Announcement made per megaphone \"No ferries today\". Much disgust. Heard one Sergt Terrier remark \"Their Nivy’s erfraid. Immediately stepped up a veritable son of the sea blue eyed & bearded. Peaked cap white sweater tall & bronzed. \"Say the agin\". No response from Terrier \n\nReturned to firing line passing usual Indians mules Maltese & the cosmopolitan crowd here Discussed change of mining shifts. Piercing cold on these heights sheer 400 feet above the sea. Pte Walters courtmarshalled at Russells Top and found guilty. Sentence pending B Major indicates our winter quarters where we dig in down gully but to my mind the massing there points to a\n","57":"\n\nstunt or fair dinkum hurling of flesh & blood Australians against barbed wire entanglements before winter starts. \n\nNoticed when on beach today how large and impressive the cruiser & hospital ships appear from that level. Looking down on them from the trenches they are diminutive. Elicited information that Abdul’s stands to at similar hours to us. Mules are coming down pass again today. We hope to open on them with machine \n\ngun when good targets arise. Wastage of war. Two months ago we put 100 men on a detached job, only 64 are now there the remainder killed wounded or evacuated sick from the peninsular. Tait & Dexter (6th) looked in. Remarked on tired out, washed out, strained anxious look in our faces – the very thing we noted in theirs on taking over. Deep set tired eyes\n\nBed 2015 Constantly disturbed during night, messages alarms and excursions – the signallers seemed to live in my dugout.\n","58":"\n\nVery bleak. Enemy snipers crept out again. Will try & trap them if prisoners could be taken without noise. Cold again. Will try for Imbros again. Busy censoring during the morning very cold and 1200 met my party at Bde HQ and proceeded to beach. About 150 others waiting there. In doubt for a long time since whether trip would take place however. NTO stated trawler had left Imbros at 1400 and we should leave at 1530. Later warned from boat filled there. Long wait. \"Captn Kettle\" very active and Wilkins on M.L.O. Other naval men a fine type. \"Grafton\" cruiser in\n\n23\/11\/15\n\nMessed about until 1830 when the NTO announce only chance of getting away was to go out on a horseboat and unload trawler of bread. Embarked on horseboat and comfortable enough down below with Gurkhas, good little chaps kukris on belt at back. Three officers so different in type to our Australian. One wearing shirt outside breeches like Gurkas grey hair small & smart other little dandy, eyeglass and enormous fur collar turned up alround and Gurkha felt whitish hat.\n\nEventually reached trawler, came alongside & went aboard. 133 of us much to astonishment of crew who had just completed stormy trip Set to with fatigues and unloaded 10000 loaves of bread into horse barge and bitterly cold pulled out beyond hospital ship and anchored Col Wilson returning gave me a commission to bring a case of neck oil back for him. Mitchell found cooks galley and got steaming bowls of tea and some bread & jam hewed from sea. Anzac recalled our first landing. Land lying dim and the rattle of mguns rifle and bombs.\n\nManaged to get below into crews quarters reeking with every smell imaginable seamen & soldiers lying everywhere. Slept fitfully in half sitting position on corner of seat Uncomfortable as this was it was much preferable to being on deck in the cold\n","59":"\n\nUp at 0430 and had cup of cocoa. Sailed out 0500 and had smooth cold passage to Kephalos. Entrance in good bay, boom across. Cruiser, monitor and others there Breakwater constructed out sunken steamers. Went ashore rocky craggy stony place. Larecamp Passed Egyptian labourers going out senking heighe – ho!\n\n24\/11\/15\n\nRaided cocoa stall & had cup cocoa 1d & cake large 6’. On to camp passing Greek labourers building houses out of rough stones and mortar. Reported very poor mess. Put order into canteen but too many there as a ship is again being unloaded today tomorrow will be just as good. Left for Panaghia village with Lieut Kent & his orderly & Mitchell Passed field bakery and G.H.Q. out of town and were told by MP where Generals house is. Country stony & barren. At boundary had passes vized by police and waited for mule\n\nGuard tent on slope surrounded by trees like lightwood. Road sloping down to pleasant little rill with bracken on banks. Some vines growing and a squirrel sporting there. Hangars & aeroplane sheds in with planes coming & going. Took two ponies and reached Panaghia at 1315, the road a mere mule track through stony barren country. High stony hills the tops of some wreathed in mist deep valleys oaks, poplars and short brush. \n\nVillage neat & pretty. Mosque, Turkish lab\n\nAt Hotel had lunch 3 boiled eggs a cup of Turkish coffee and some bread and honey. A second rate sort of restaurant. The village streets cobble stoned and winding reminds me something of Baccus Marsh The natives for the most part clad in European clothes but some keep to the native costume dark with pantaloons and doublet. Youngsters in the street calling out \n\n24\/1\/15\n\nand chicolet. The prettiest little kids I’ve ever seen – the little girls perfect in feature and fair of face – little Helens. Went up the street shopping called in and bartered with Greek owners. Most on offer, spirits & wines but having made a lucky deal early in the day with canteen people did not have this worry. Bought some condensed milk few walnuts &c at reasonable prices. Drove some hard bargains along the other shops, sellers very funny rogues all, one chap clinched everything by raising right hand & saying \"I swear it\". \n\nWaiter at eating house said that there were 9 villages in the vicinity\n\nWe saw three. The \"front door\" being the sea and the back door the road we came our entrance to Panaghia. All the way from Kephalos the country bore signs of having once been cultivated but is now deserted perhaps owing to the ravages of war and blasting influence of the Turk. The aspect of the whole countryside with its rocks and ruggedness, its hilltops shrouded in mist, and the barreness of the soil must have bred a hard race of men in olden times and the very harshness of the landscape would inspire the songs of Homer. \n\nNoticed that the little farm houses were made of rough stones cemented with mud the roofs being the same one single chimney and no windows. At rear generally a small enclosure probably for folding the sheep during snow. The sheep longwooled and black nosed. The women in the \n\n24\/11\/15\n\nvillage being Christians are not veiled but their shirts are worn as pantaloons. Returned after dark & looked right down on the camp – a sea of tents. Our old muleteer doubled at times along the mule track stopping at each wayside spring for a drink. On reaching camp found all kit missing owing to shift taking place during our absence. Imbros generally appears to be a barren place not very wide. The view across to the Peninsular showed Achi Baba Suvla Bay &c. Mess at 1700 reading Bed 2015\n\n25\/11\/15\n\nSlept in tent very cold with rain & wind. Dysentery again. Up at 0700 and Kephalos looked dreary. After breakfast went over to Canteen and managed after much trouble to buy 61 cases of tinned and other provisions. These I had stacked beyond canteen boundary and the men built a dugout with waterproof sheets on roof using the cases for walls. Sentry mounted, Also bought 240 oranges for 10\/-. In the morning bitter cold and raw Went to Ordnance and bought a pair of slacks and a mackintosh cape for £ 1. First had to get chit from officer 2nd Find corporal and indicate goods required he made out requisitions in triplicate and still retained goods. 3rd Went back to officer and he signed requisitions, 4th Took reqs down road and round corner to Field Cashier and paid him the money he signed. 5th Took reqs back to Ordnance Corpl he gave me one back and the goods, so completing the operation. A triumph of red tape \n\n25\/11\/15\n\nMotor lorries and motor cars running about landing place, motor bike and trailer with mails. Road from wharf up to Rest Camp very busy. Crowds of soldiers coming and going, singing gangs of Egyptian labourers wearing dark greatcoats and swathed in blankets, Greeks & Maltese some in native costume. General Munro in Salonika General Birdwood here. Rumours of an advance over in Anzac. No aeroplanes up today owing to inclement weather. Breakwater of harbour composed of sunken ships their mast giving the place the appearance of being crowded with shipping. Rough sea, the monitor standing well in. One officer bought oilskin by getting into touch with naval stores. Gum boots also on sale. Creeney Adjutant of Rest Camp mess poor and managed by a bearded gibbering padre\n\nDifficulty arisen regarding transport of these stores as the only craft are small trawlers which carry bread and meat to the peninsular and are fully laden without taking anything else. Arrangements are said to have been made to take away 20 cases daily which is ridiculous and my small lot amounts to 61 cases and some have 280 even. The men have built a dugout of the cases and sleep inside roofed with waterproof sheets held down by heavy waterpipes pinched from adjoining works. Wrote a letter to Bde explaining difficulties of transport & handed it to Moncur 6th Battn who goes back in morning. Wrote & read during\n","60":"\n\nand swapped yarns and experiences with other veterans of the trenches until about 2045 and then turned in.\n","61":"\n\nSlept fairly well but bad with dysentery and had a violent fit of vomiting but felt alright afterwards. During the morning aeroplanes were very active coming & going all the time, several being aloft at once. Went down to pier and saw N.T.O. with reference to transport of canteen goods. After waiting about a long time after lunch ASC wagons commenced to turn up and gradually carted a lot of stuff away stacking it on wharf. Great battling for the wagons and squaring of drivers but I was not successful in getting \nthem\n any away. \n\nHeavy rain set in about 1900 – standing out on road the whole time I was soaked particularly about the feet and legs. The climax arrived at 1915 in a torrential downpour with thunder and lightning. Told my men they could settle down for the night and rest assured no change of location would take place. They built a large fire and were very comfortable around it until flooded out. The men on the wharf had a bad time the lower boxes being awash. Was crossing to mess when the downpour occurred and water was soon 6 inches deep lightning, thunder tents coming down and generally merry hell. Wandered about\n\n26\/11\/15\n\n\"quite at sea\" in more ways than one at times almost crouching down to ground with the violent gusts. Lightning showed way to mess and getting inside found the floor of the mess tent a bog. Puttees boots & socks wringing wet. Cooks working under great difficulties but all looked forward to at least a good hot cup of tea. Presently a crash denoted the cook’s tent blown down and we had a little cold meat. Rum neat was the only available drink so went dry. At 2000 waded up to tent in gully and found tent still standing but floor too wet to sleep on. Got into E.P. tent among crowd of batmen details &c with Lieut Terry and slept fairly well considering. Smell of unwashed men very strong – soldiering indeed gives us some strange bedfellows!\n","62":"\n\nUp at 0700 and down to wharf Boat sailed but only took about 50 cases leaving rest. Saw Capt Stow at Canteen & he advised no chance of transport until 1800 so took things easy.\n\nWearing wet boots puttees and socks no joke. Raining still – Mon Dieu! was ever such a god forsaken place as Kephalos. Turkish prisoners under guard some tough looking cases too. Funeral of two men killed yesterday in aeroplane accident Walked over to hangars and had good look over the different planes there \n\nVery simple they look, but the engines are wonderful. Glass floors to observe thro’\n\n27\/11\/15\n\nCruiser making for bay beyond hangars for shelter. A good deal of motor transport connected with R.N.A.S. HQ located in stone buildings. Mud everywhere still bad with dysentery and expect jaundice The latter is welcome as showing one was finished with dysentery and become acclimitized. GHQ now shifted to Lemnos 26 & 27 Battns taken there too. This place is going to be called HQ Dardanelles Army. The Camp arrangements of this Rest Camp faulty – sanitation very bad indeed Sea rough. Monitor & other warboats in the breakwater formed of sunken ships making shipping look heavier than it is. \n\nSome big men among the Turkish prisoners Greek & Egyptian labour seems wasteful the latter particularly so. They seem to feel the cold and are just masses of moving blankets very gaudy in some cases. Every spare minute they are scratching away and feeling. British army pattern slacks are better than our breeches and puttees can be worn with them. The whole uniform is much neater. \n\nField bakery a great sight rows and rows of Aldershot ovens. \n\nDuring early morning got tin of cocoa (good) at stall near wharf for a penny and also bought big hunk of plain cake, warm doughy & sweet but better than issue biscuit. \n\nAt 1700 though still threatening better weather conditions prevail, but still rotten. Imbros looks lovely from over sea but I don’t want to come here again\n\n27\/11\/15\n\nCold during afternoon and heavy rain set in during the evening. Brought blankets down to tent near mess and having made tent secure turned in early. Wind and rain howling and roaring round\n\nsea dashing over pier and carried some canteen stores stacked down there. Tent flapping terrifically. Rain teemed till 0000, but slept fitfully until then Suddenly awakened by other occupants just in time to grab tent pole. Held on there for 20 minutes while others got on to tent pegs. Bitterly cold and got little rest until 0800, bad with dysentery\n","63":"\n\nUp at 0800. Sunday. Saw it snow for first time falling in driving flakes hills covered with snow. Biting wind. Took pick & shovel and trenched mess and built up a dry floor inside. Spent day huddled over brazier. 151 Bde & a lot of 54th Division leaving peninsular. Waterbarge driven ashore and things smashed up. Went down to beach at 1700 and found things in a terrible state. Great seas dashing over the dummy Dreadnaught and crashing in beyond breakwater Road awash and pier apparently not existent\n\n28\/11\/15\n\nCanteen stores stacked down there are in danger of being washed away. All warships cleared out to sea or gone round other side of island. Two trawlers ashore and picket boat went aground on some wreckage while we were watching N.T.O. sent out orders for boats to be abandoned and crew taken off or told to try and swim off. 8 Greeks aboard her taken off another vessel in distress.\n\nA memorable scene, terrific gale blowing nearly dark and heavy seas smashing in. The searchlights and signal lamps of the dark monitor & torpedo boats lighting up the scene. \n\nReturned to camp and found my party very comfortable in their dugout of cases. Thank God I did not take them on to the pier. See no prospect of leaving here for a while. Visiting own tent found all snug & well stayed but rattling like the devil in the wind. More snow this afternoon. Prepared for evening by laying in ingredients for a rum punch and plenty of fuel for brazier in mess also chestnuts to roast and a good stew. Gott strafe our enemies. What a Sunday. Never felt colder in my life. Put up in tent of (OC Greek labourers)\n\nSlept long & snug\n","64":"\n\nRose at 0830 slept well and warm. Still very cold and windy but not so bad as before. Snow still about and all water pipes frozen. Pools covered with ice an inch thick and stayed so all day. Found mess filthy and no sign of breakfast. Sat round brazier yarning until 1000 when bacon came along and we put it on the brazier & eat slices with fingers using big hunks of frozen bread. The old padre who runs the mess has no control over servants who do as they like and leave the place filthy with food and dirty dishes. Reason for breakfast fiasco said to be pipes being frozen and no water available.\n\nAfterwards went to Greek canteen and had a penny cup of cocoa and then to seafront. One big cargo steamer high and dry on the ground and swinging about big seas dashing right over, destroyer wrecked, pinnaces tugboats big lighters, the hospital \"beetle\" and other craft all ashore. Thousands of pounds of damage. Trawler T19 upside down. Saw submarine in difficulties beating out through breakwater entrance. Monitor and other warboats all snug. Piers washed away and road much damaged. Wind still very strong and the cold intense. All my men comfortable. Lunch the usual scrappy meal. The Irish padre & the rest of the heads left for Panaghia to make a night of it and will no doubt succeed Six inches of snow across the road to there\n\n29\/11\/15\n\nSat by brazier yarning until late in afternoon. No prospect of getting off until sea much abated and new boats arrive. They seem to be pulling a lot of troops out of the peninsular for Mudros Two French divisions from Helles sent to Alexandria and fresh English troops arriving probably for Servia. \n\nThis camp is shockingly mismanaged and everything seems upside down right throughout the whole island. Ordnance and the Canteen seem to offer a very fine field for waste and loss of money. All because England doesn’t get these things organized in peace and have a trained army so every man can get to his post and carry on with work he is acquainted with instead of the present mixup where a solicitor’s clerk does his best as a canteen sergeant while the manager of a big grocery firm is perhaps pioneer sergeant\n\nThe temperature last night fell to 11 deg below freezing point. Boisterous night but nothing like as bad as last night. Turned in at 2100 still in tent of O.C. Greek Labour Corps (Lieut Hannan Notts & Derby) and with four blankets and 2 overcoats slept warm and well except for dysentery. Froze hard during the night the water in mugs going solid and elsewhere over half an inch thick\n\n30\/11\/15\n\nSun shining brightly but wind still strong at 0830. Broke ice and washed still bad with this damned dysentery. After breakfast walked down to pier and saw MLO he says a few days should see us off Big gangs at work clearing up road being mended. General Birdwood down there. Submarine still in port, damage must amount to thousands. Large steamer will be refloated probably and jack tars at work on capstan were hauling the \"beetle \" off.\n\nTrawler which set out with some canteen stores returned after a fruitless rough cruise all up & down the Gulf of Saros. Twelve case of one lot were washed off. Returning saw Turkish prisoners under guard working on road drainage, some of them very fair smart looking men, others dirty hangdog & swarthy. Take them all through they are a fine stamp of man. Most of them wear small turban round the fez. \n\nThe cold still intense and snow around but later the wind dropped and sun was warm. Aeroplane made up for enforced idleness of last day or two by extra activity and were departing and returning from the peninsular. Very pretty to see them landing and on setting out to watch their gradual mounting. After lunch went to Ordnance and bought cap for 1\/6 and puttees for 1\/10 very reasonable Went up to GHQ to pay this huge amount\n","65":"\n\nto Field Cashier and drew £ 5 on my paybook. Printing section and mechanical workshops in stone buildings. Returning got warm with walking and found being out of doors quite enjoyable. Four funnelled cruiser came round here again from her shelter on the other side of the island. She narrowly escaped going on the rocks the other night over here. \n\nThe heights of Gallipoli viewed from here showed up white with snow in the sunlight. Sea very much calmer today. Rumours of heavy shelling and casualties at Anzac also talk of an attack on Lone Pine which I don’t believe. Panaghia party returned padre to hospital with jaundice. At night the monitor alongside stranded ship searchlights going and gangs at work lightening her & pumping out.\n\nTwo villages here put out of bounds owing to smallpox. Turned in 2100 slept well\n","66":"\n\nSlept on till 0900 fine clear sunny morning. Aeroplanes very pretty rising and alighting. Some went back to Anzac today without their goods, wired Bde for instructions. Received reply Wait for usual boatservice. Don’t forget our commissions ! (A bottle of whisky & a \"gorblime\" cap) Got some books &c from Adjutant and sat in sun reading. Went for a walk up past my Army Headquarters and climbed hill in rear. Could look right across island surrounded by sea. Water calm and Anzac easily picked out by the shipping there. Further south Achi Baba looking blue & peaceful not at all like the bloodstained hill it is. Helles further round & beyond Asia(minor) also a seat of war\n\n1\/12\/15\n\nAfter lunch went down to beach and had a look at the wreckage which has been thrown up – something remarkable. Pieces of fittings, masts, spars and drift wood of every kind. French destroyer being pumped out preparatory to refloating. Tug boat with hawser on to waterbarge and capstan on shore manned by Jack tars and soldiers pulling away at her stern. Big cargo ship still high and dry thrashing away with her propellers and sending showers of spray up, hawser out from her stern and HMS Swiftsure hauling like the very deuce but still she sticks however she has turned round a bit since starting \n\nA very fine sunny day and it was enjoyable strolling along the beach. Gangs at work blasting rock and repairing road where it has been washed away. Watched Egyptians carrying stone, dirty brutes all swathed up in blankets – their weak and diseases eyes telling of syphilis and the vacant imbecile stare on many faces speaking a tale of heaven knows what secret vices.\n\nMet Capt. Edwards 6th Battn and then walked along to the office of the A.P.M. and secured a pass to the island of Tenedos which shows up blue and enticing some miles to the south and off the Asiatic littoral. Being definitely here now for some days decided to take advantage of the opportunity of seeing some more of the world. A trawler leaves at 0800 returning 1800 the same day. I hope to God we don’t get marooned there or there’ll be hell to pay! \n\nComing out of A.P.M.’s office heard some explosions and found our antiaircraft guns on hill tops and on the ships blazing away at a Taube which had ventured over. She made off but was not hit. Our planes soon out in pursuit. Big parties of Turkish prisoners road making good workers. Saw a Greek passing go near one as\n\n1\/12\/15\n\nif \nthe\n to speak but sentry instantly made at him with bayonet so he cleared out. Prisoners all well cared for and contented and are good workers. After tea retired early to bed. Under armed guard in rest camp are the lunatics - broken by the trenches and the sights seen there. \n","67":"\n\nUp at 0630 and after breakfast with Edwards Kent & to the pier. Watched floating off of pinnances and clearing up of wreckage and at 0800 found we had missed Tenedos boat and sailed on Trawler 696 for Helles hoping to catch her up there. Old skipper bluff old seadog who mellowed on being introduced to a bottle of the \"cratur\". Loaded up with fresh meat &c. He had a dreadful time driving gale beating up and down the Gulf of Saros for three days – out of his compliment of 92 passengers 30 had to be admitted to hospital suffering from exposure.\n\nPassed out from Imbros past the \"Swiftsure\" and the \"Europa\" (4 funnels) and other craft looking quite busy. The island itself looking craggy and windswept the few white houses visible on exposed parts and poplar trees in the valleys. Snow still on the higher peaks. A Taube flew overhead and dropped some bombs and the air was soon full of shrapnel smoke from our antiaircraft guns. Tuomy in good form with endless jokes. \n\nThe Peninsular showed up clearly in the lovely bright sunlight and behind were the snow capped mountains of Asia. Watched shells bursting on Hill 971 and Achi Baba and gradually drew towards Helles. The bluff going up from the beach cut into terraces on which were resting troops. Bursting shrapnel alround and spent shells and bullets splashing about in front of us. Torpedo boat destroyer passed at full speed Water calm\n\n2\/12\/15\n\nOn reaching Helles we saw the Tenedos boat already under way but our old skipper like a sport hoisted a signal blew his whistle and as she lay to he ran alongside and let us on board. The new ship was a smaller trawler K39 with a Scotch skipper named Sandy, as big a wag as the other one. We passed the entrance to the Dardanelles and saw where the forts had been bashed to pieces and proceeded south along the coast of AsiaMinor. The country flat near the shore, the few scattered villas and forts lay in ruins and the mountains behind in Asiaall snow covered and very pretty. \n\nPassed a barren island called Rabbit Island and went alongside a monitor and left her mail. She was in a strait surrounded by nets as a protection against submarines and looked a most extraordinary craft with her single mast and her 10\" guns. An aeroplane passed overhead very high and suddenly banked steeply and almost touched the water. On Rabbit island was a hangar. The monitor had a little seaplane aboard. Proceeding on our voyage we made Tenedos at noon. \n\nA single peak rising out of the water at the foot of which was a snug little village of the usual type. Among the cluster of houses rose a single tower surmounted by a cross – a Greek church. Built right into the rock and right down to the water is a citadel evidently a stronghold in ancient times now French headquarters for their forces and a row of the usual windmills on the skyline. Came round a small breakwater into a snug little harbour full of small craft. Went off in a bumboat and on landing were assailed by the usual crowd of children and guides. The village similar to Panaghia but larger and cleaner. Went to café to had an excellent lunch of fish boiled in olive oil, stew cooked in oil, butter beans, small cakes, bread butter, cheese the colour of chalk and absinthe & ale\n\n2\/11\/15\n\nNoticed a number of French troops about in varied and ill fitting uniforms. Did some shopping at a little store spotlessly clean called \"The Three Friends\" run by three partners. Very dear but the traders were honest seemingly. Toblers cocoa ¼ lb,1\/2; Black & White Whisky 6\/- bottle. went up street and found very interesting wild looking Greeks in native costume & pretty little youngsters. Met 2 English nurses in street and they were as glad to see us as we were to see them. Talked for a while and learned that they lived up in the Citadel and were working in a new French hospital just established. Hard faced girls but it was treat to meet them. \n\nIn a shop further down encountered a naval officer who had been on the \"Powerful\" and yarned for a few minutes. Saw large two storied building with French sentries on duty and orderlies running in and out. Turkish cemetery behind stone wall all overgrown & a donkey feeding among graves. Nurses said the Turkish quarter was of interest but would be nothing new to us after Egypt. \n\nReturned to boat again at 1400 – fare of boatmen 2d return Set off for Helles and called in at monitor again to drop two men. Some French soldiers and a marine aboard this trip. The mountains of Asiaa lovely sight with their snow cloak in the sunlight. Skipper a canny Scot introduced me to innermost recesses of his cuddy and introduced a bottle of Johnnie Walker. Reached Helles just in time to see 4 o’clock trawler setting out. Signalled her and she came alongside, we hopped over. We have had wonderful luck as regards just catching trawlers today being\n\n2\/12\/15\n\naboard no less than four during this journey and striking \"sports\" as skippers every time. Came past CAPE Helles and one is struck by the narrowness of the straits of the Dardanelles. The fort on the southern extremity of the cape blown to pieces the whole place now being crowded with our troops in their terraces. Big flashes & puffs of smoke denoted shelling. \n\nMade for Imbros Found Sparrow on board with a party for vegetables for the Division. Learnt that Lone Pine have been catching it. First indication was a number of red flags (small) on Abduls parapets and then a hail of heavy ten inch howitzer shells on L.P. blowing in our saps by the craters they made in their explosion and burying the miners. 150 casualties out of 600 garrison 60 killed including Dr Green. Fighting in the tunnels but no attack. If they had our men would have been at a great disadvantage. Very cold there – 4 inches snow in trenches \n\nCame into Kephalos about 1900 and drew alongside pier going dead slow as it is a ticklish piece of navigation. Drew alongside another lighter and got ashore. 40 men arrived for armoured cars. Searchlights active all the way across. Found Camp shifted up gully and dined in mess on bully beef & Worcester sauce. A lot of Imperial officers came in tonight – no words of getting our stores off yet. Tents pitched on hillside in made ground & pegs loose\n","68":"\n\nSlept in until 0930 and then went down to wharf and saw N.T.O. Red trawler returning to Anzac this afternoon will clear the wharf of canteen stores already there. On ascertaining what stuff is available will arrange transport to shift our stores down there. A dull cloudy day and appears to be working up for a storm of some sort from the south. Monitor towing a trawler off sandbank. Crews of these trawlers and their skippers are fine men. Rough, dirty cursing but the real British breed. Nothing too much for them to do for a soldier, kindness itself to the wounded and sick. \n\nSome of the canteen parties got away and we drew lots for the precedence with the remainder. I leave with my party on Tuesday night but if other craft are available probably much sooner than that. In Panaghia are to be seen quaint old taverns where the men foregather and quaff mastic. The price is 1d per glass and 1\/- will treat the whole run. To the music of an old orchestrelle or mouth pipes the men engage in a lumbering country dance which has no beauty for a foreigner.\n\nJack tars very busy with capstan and tackle refloating launches &c blown ashore during the storm. Greek labourers blasting rock and repairing road under direction of the engineers. Cocoa & cake in the little stall much rushed by those in search of a warm drink on a cold day. Walked up to G.H.Q. with White and had a look at the war news up there but nothing of importance chronicled. Ship with the 2400 cases of Old Orkney has gone up to Suvla Bay so is not expected back for a week at least\n\nTurned in early\n","69":"\n\nUp at 0830, quite warm and close. Went up to Panaghia with Mervington walked the whole way up and back, 12 miles in all and appreciated the crystal rills at the two old little springs on the road. A stony rough track, the tinkle of sheep bells sounding from the valleys – as these bells have different notes the effect is very musical. Poplars and oaks and olive trees (like our lightwood) are the main trees, a short green stunted scrub or heather covers the stony rises. Some of the peaks are very abrupt and lift their barren tops up in a wreath of cloud mist. The only traffic on the track was a few mules loaded with stores, most of the muleteers in native dress and gave the local greeting \"sperra!\" \n\nOver a ridge the village of Shinuidi came into view nestling comfortably in a hollow on the mountains just before reaching there are forests. A turn in the track to the right brings Panaghia into view with a broad road running straight on to the sea. On the top of the bluff there is another village. The road wanders in among cultivation and olive trees until the old cobblestoned street comes into view.\n\nAt the London and the High Life at 1300 the same tale was heard: - \"Dinner finish\" so we went further on into a little Greek tavern and had a good plate of a meat stew and potatoes taken off the fire at the end of the room and a plate of honey with plenty of bread. The whole washed down with plenty of wine – light stuff costing a penny a glass. An old looking little inn this with its other diners labourers clad in the circular caps & stockings\n\n4\/12\/15\n\nAfter lunch crossed bridge and passed old overgrown graveyard surrounding old Greek church. Went in and found old women sweeping out. Rudely built in front with large beams as rafters. Inside large candles and chandeliers with glass pendants like the old church at Vieux Cairo Paintings on the wall and tapestries of silk with images of sacred people let in, the needle work joining up alround them. On desk old looking missal and bible. The small altar in a sort of inner shrine. Old crone hovering round saying \"Christo! Christo!\". \n\nIn the street saw the Greek padres in their black robes and hats telling their beads. Long hair done up in a topknot at the back and flowing beards. The girls and children in the street beautiful in face and figure. Went to old shop with clean looking old owner and bought some tinned fruit and honey. Small boy interpreted. Squad of Tommies marching through invaded place & there was much vociferention and bargaining until they were disposed of. \n\nBack along street into other shop where old rogue presides bought case of Black & White whisky for £ 4 and paid in notes and one sovereign. The sight of the latter nearly sent him mad \"By God, I love it\" and eventually to get the gold he knocked off the odd money & arranged the loading of the mule. All this extra for one little sovereign! A good instance of depreciation of an inconvertible paper currency. The Greeks will accept a sovereign in payment for a purchase of 24\/- which otherwise would have to be paid for in a £1 note and 4\/- of silver. Loading the mules a great business watched\n\n4\/12\/15\n\nwith great interest by the local residents. One fine looking smiling woman had a beautiful good natured baby in her arms on which I bestowed \"un pen\" as backsheesh. Left the mule to follow on in charge of an orderly and walked home. These hills and dales with their peaceful villages lying in the afternoon sun looked very pretty. The occasional springs and little streamlet offer a welcome drink to the traveller How much would we give to have one or two in the trenches. \n\nComing into camp passed antiaircraft guns and their crews and Turkish prisoners camp – the latter surrounded with barbed wire fences the prisoners housed in bell tents and carrying their dixies of food from the fires where they have their own cook. Further along met others returning from work all wearing the tarbousch & chatting gaily. Some weeds but most wiry tough looking gentlemen. An aeroplane flew very low and watching it alight skimming along on its wheels round to its shed. \n\nSaw signallers and looked up my men. Arranged with Capt Stow at Canteen for transport for my cases at 0930 tomorrow morning and hope to get a trawler for Anzac the day after next. The troops now get rum every night and all take it. The cry \"Fall in for rum!\" is a very popular one. Roused hell out of Mitchell and put the fear of God into him He has been getting a bit slack but now is running about finding work and cut my hair today\n\nBed early\n","70":"\n\nSlept badly owing to aching feet which have not recovered from their freezing a week ago. Had a sponge down outside the tent. Transport taking Canteen stores down to pier and stacked in shed there ready to leave at daylight tomorrow. Navy still busy cleaning things up, a diver looking like some queer crab crawling about half submerged patching &c.. From north of Suvla came sound of heavy bombardment by ships guns. Turkish prisoners all wearing fezs but of much different style to the usual Egyptian tarbousch, being more like a soft skull cap with the tassel\n\nCreany showed me book of Arab phrases sold in Le Caire revised up to date containing the local equivalent for all the soldiers saying. – off! Up to – , F.O. &etc. Transport very busy running to and fro and buying and selling going on briskly at Canteen. \n\nAll the Canteen party who left this morning returned again with their goods after the round tour to Suvla Anzac & Helles. At Anzac they were heavily shelled and no barges being available they had to bring all their stuff back again. This delays my getting away for another day which is annoying as I have advised Brigade to expect me and arrange mules. My men all sleeping down at wharf on the stuff. Officers who returned report heavy bombardment over there the air white with shrapnel.\n\nBed 2015\n","71":"\n\nRheumatism in feet and dysentery. Small troubles though and probably due to getting soaking wet last Sunday. Field bakeries in full blast this morning being one long line of fire. Aeroplanes landing and setting out circling round to get the required elevation. Crows are very prevalent on the island, some partridges and a few smaller birds of different kinds. Owls hooting round the camp at night. Received word just before bed would take 80 more cases for Anzac\n","72":"\n\nTurned out at 0455 in pitch dark & got down to wharf. Stacked boxes on pier and subsequently on trawler. Sailed at 0700, passed French warship with heavy fighting tops and several of our own meno’war. Made Suvla Bay at 1100 amid some shelling. A well defined \"street\" and many dugouts for which a great rush was made on each shell burst, \"Royal George’ & \"Glory\" in harbour, had to heave to a couple of times for mails &c. Pinnaces brought smartly alongside by midshipmen. Both of these boats looking very shipshape and smartly uniformed officers pacing the quarterdeck. At 1200 pulled into Anzac. From the sea the cliffs look impossible and the enemy trenches on Chessboard &c.\n\n7\/12\/15\n\ncatch the eye at once. Lighter came off and took away stores. Stacked them on beach near pier pending arrival of mules. Climbed up to trenches passing along beach had a few shells from Beachy Bill landing very close. No one walking on the sand at all, quite untenable. Found things slightly altered dressing station moved to parade ground C.O. reinstated. Bunning, Slater & Grieg all sent to hospital ill. Curnow goes tomorrow will his septic. \n\nA very trying time during bombardment at Lone Pine. 8.2’s tearing place to pieces. Dead collected in bags piecemeal. 48 hours silence caused Abdul to send out patrols. We killed 150 of these. One corpse had 5 shirts on it. Found some letters from home. Bed early. Heard of the death of Percy Comins QM 6bt – one of the best. Two war correspondents on boat this morning. Bean & Malcolm Ross\n","73":"\n\nAm not resuming regimental duty until tomorrow. Canteen stuff came up in carts about 1600, stacked it and put a guard over it. Disposed of all private consignment for officers – the oranges very much appreciated. The cold snap accounted for a lot of our chaps and they had to be sent to hospital with bad feet and legs due to frostbite. Also being \n\n8\/12\/15\n\non a quarter ration of water made things hard. A fairly quiet day with a moderate dose of 75s and about twilight a number of heavy 8.2’s crashed over. A 5 inch howitzer levelled a portion of the parapet and tore up the ground thereabouts but no casualties resulted. \n\nWith Major Smith inspected the new tunnels forward from old dressing station site. Fine tunnels they are and perfectly safe. Places for Regimental office and other dugouts (Adgt Slc. in command) also either commenced or marked out and I think it splendid safe place if C.O. will only move in there. Some of the 25th attached on engineering work mostly repairing damage done in L.P. but just restoring things as they were – a recurrence of same sort of thing will occur on any subsequent bombardment. All say that affair had every appearance of having been mathematically worked out. \n\nWarships doing some shelling Sea very calm and any moving boat making long trail. Imbros looking dim and enticing. Tallyn to hospital. Poor old Bert Curnow went in this morning full of septic. Bed 2015\n","74":"\n\nDistributed Imbros stores among units and took over at 1600. Bazeley awarded the Military Cross for his bravery in gas fatality and Kruger & Stone got the D.C.M. Good luck!\n\nCleared off arrears in office work and settled down to usual routines Brigadier & Thorn going to Egypt. Brigade Major into hospital Colonel Gwynne taking over the command. Fairly heavy shelling during afternoon the enemy seeking to knock out gun on Plugges Plateau. Shooting very accurate every shot landing in fine style within inches of each other. Our artillery getting ready to bombard farmhouse flying German flag away in rear of Abdul’s lines. Sniper spotted pickelhauber in enemy trenches. Made Mitchell thoroughly overhaul and oil rifle revolver and all other fighting gear. Great trouble over gas helmets and respirators balancing them up. \n\nC.O. agreed new regimental quarters in tunnel perfectly secure but all light will be artificial passages narrow of necessity owing to great weight of earth on top of tunnels. Drummond’s birthday today. Good many sick and lame after the snow and ice. Butter now on issue and cheese. Also Oxo and chocolate Rum every day. Full scale not always operating owing to difficulties in landing &. No hospital ships in today in fact very little shipping and warships quiet. Tallyn & Stockfeld both sent to hospital – the form phtisistical and the latter with diptheria sent Peacock to take his place, Abbot said to have neuritis. Bed 2015\n","75":"\n\nVery dark at stand to arms 0600 but rather warm than cold. Just after turning in last night Abdul suddenly sent up red rockets and poured in a very heavy fire. Went out to office again but within ten minutes conditions were normal. Otherwise a quiet night. After breakfast went up firing line to B8 and had a good search round with telescope but owing to smoke hanging round a decent view could not be obtained. Since my travels a good deal of barbed wire has been put out by us but no other changes are noticeable. \n\nTalking to some of the lads in \"A\" Coys lines . Craig glad to get back there once more, - Elmiger to \"C\" in his place. At 1430 noticed a sort of minature Zeppelin over the sea and apparently belonging to us. A sausage shaped gas bag with one end inclined upwards slightly and on the depressed end another cuplike gas bag. Depending from the gas bag was a rope and which at intervals were five black objects which gradually reduced until only one was left. I saw one fall off leaving a train of black smoke behind it. The whole affair appeared to be captive to one of our cargo steamers lying off Suvla. \n\nWent down communication tunnels and gave some directions about the digging of the regimental office and other headquarters dugouts there. Inspected the faces there which are now well under the centre of the hill The space being confined the Engineers are able to work two faces at once by driving a little tunnel in first and then opening up a face further on leaving the remainder of the first to be completed by another party. Are very close In some places moisture filtering through the roof of tunnel. Iron piping put in to take drainage off adjoining sap.\n\nThe navy (\"Europa\" principally) opened up very heavy bombardment about noon socking in broadsides into Olive Grove with deafening noise and provoking no reply beyond a few odd seventyfives. Most of the lads however remarked \"We’ll have to pay for this\"! One chap in a letter says \"I am so greasy that if you look at me your eyes slip off\". Fortunately we now get a full ration of water. \n\nA company of the 25th Battn. is attached to us, Stockfeld going away sick sent up from the beach a fowl he had there to Roth. It escaped and some 25th caught it, condemned it to death and put it in the pot. We made it rather a joke against the two 25th officers we have in the mess that their men as \"visitors\" to this Regiment should do such a deed! Colonel Gwynne round and our line is to be further re-arranged. We take on Wire Gully and extend as before along to B8. As recompense for increased line we get all mining taken off us by 21st who go into reserve and we also get our beach party back. \n\nColonel Spencer Brown goes to Egypt (he has asthma) to organize a L.H. unit. Persistent rumours that I am to be Staff Captn 6th Brigade – a job I don’t want as my promotion to Major will come sooner by waiting here for my company. The weather dull & close a total change to the cold snap. Evenings quite warm Abdul has partly put out another inner row of entanglement behind his others. In places the old ones are very knocked about by our shells\n\nBed 2040\n\n11\/12\/15\n\nAfter stand to arms washed and then made tour of inspection of rear of hill and found things slack and very dirty after my fortnights absence. Roused R.S.M up and ordered Signallers Pioneers and Headquarters area to be thoroughly cleaned up and kept so The shift to left took place today. Beach party returned and some miners relieved but not enough to fully man our line The 5th & 6th Battalions the 6 & 7th Field Ambul some artillery & ASC moving today – a compact little force complete in itself. The 7th Bde also rumoured to have received orders to be ready to move at an hours notice. Rumour, however all of this. \n\nFrom today censoring is to be done under Coy. arrangements. Capt RH Norman 5th Bde appointed Staff Capt here which leaves me secure in 22nd Battn. Staff Captaincy no good to me but I was afraid I might get orders to take it on the same as I got about this Adjutancy. \n\nOperations fairly quiet today on both sides beyond the usual shelling nothing much happened CQMS Bregenza Stopped a shrapnel bullet in the head and has gone off to hospital and another men caught one in the thigh and was taken off on a stretcher to Casualty station. Message received at 1800 all officers heavy baggage to reach beach tomorrow. What’s doing!?\n","76":"\n\nOrders also to send out patrols so arranged to have patrols up the two gullies nearly all night. Man named Paton ‘A’ Co missing since yesterday, disappeared between trenches and beach. He is an eccentric, so may turn up meantime M.P’s have his description Invited to two parties tonight. 1 to discuss some B & N in Major Smiths dugout at 2100 with Major and Mackay & Capt Pedler, the other biscuits & sausage with Colonel at 2030. Query Can I do both?. \n\nMost of our sappers relieved but some still on Brigadier has collared our new intended Regimental office for himself Nature of the ground compels us to go in a good long way in the other tunnel to get adequate depth of earth overhead. Bed early. Patrols saw 3 corpses unburied (enemy) in Gully.\n\n"}}