{"Document Name":{"0":"Diary_0019","1":"Diary_0019","2":"Diary_0019","3":"Diary_0019","4":"Diary_0019","5":"Diary_0019","6":"Diary_0019","7":"Diary_0019","8":"Diary_0019","9":"Diary_0019","10":"Diary_0019","11":"Diary_0019","12":"Diary_0019","13":"Diary_0019","14":"Diary_0019","15":"Diary_0019","16":"Diary_0019","17":"Diary_0019","18":"Diary_0019","19":"Diary_0019","20":"Diary_0019","21":"Diary_0019","22":"Diary_0019","23":"Diary_0019","24":"Diary_0019","25":"Diary_0019","26":"Diary_0019","27":"Diary_0019","28":"Diary_0019","29":"Diary_0019","30":"Diary_0019","31":"Diary_0019","32":"Diary_0019","33":"Diary_0019","34":"Diary_0019"},"Date":{"0":"unknown","1":1026.0,"2":1027.0,"3":1028.0,"4":1029.0,"5":1030.0,"6":1032.0,"7":1033.0,"8":1034.0,"9":1035.0,"10":1036.0,"11":1037.0,"12":1038.0,"13":1039.0,"14":1040.0,"15":1041.0,"16":1042.0,"17":1043.0,"18":1044.0,"19":1045.0,"20":1046.0,"21":1047.0,"22":1048.0,"23":1049.0,"24":1050.0,"25":1051.0,"26":1052.0,"27":1053.0,"28":1054.0,"29":1055.0,"30":1056.0,"31":1057.0,"32":1058.0,"33":1059.0,"34":1060.0},"Entry":{"0":"\n\n","1":" Weather still showery but shows signs of clearing up. Usual fatigue & \"working parties\" out on the various jobs that we have in hand, & I can tell you I have my work cut out of a morning getting them together for they are so scattered & the new hands are not used to the game yet, it takes them a terrible long time to get ready, & as for water they are always wanting it, they have not learned to control their thirst yet, all the old hands never touch water unless they absolutely need it & a man is much better for it for you never know when the time may come when water is unprocurable & you have to go without for 2 or 3 days (I have done it before today) that’s when it hurts the heavy drinkers.\n\nThis afternoon the Germans gave us a lively 20 minutes, it being a dull day they took advantage of it & run an armoured train along & gave us some of her 5.9 \"bucksheesh\" they knocked about 20 yards of our trench right in & filled it to the top otherwise no damage was done.\n\nReceived a few more details last night & the R.E fatigue party was returned they are putting all P.B. in their place they are hunting all these jokers out of their Loft Base jobs wherever they can be found, & putting P.B. (Permanent Base) men in their places, the latter are chaps whose wounds & illness’s won’t let them come to the front any more, but who are still capable of working on these soft snaps, which the big husky mal-\n\ningers have been monopolising ever since the \"Landing\" some of them, how it must have hurt to be sent back to their U`nits after being so long away, England has been full of them, but now a lot of them are getting bundled out, & instead of swanking up & down the Strand & Picadilly, they can strut about in the sloppy trenches & skite there if they feel so inclined, for would you believe it these class of wasters have far more to say about things they have never seen than men who have actually been through it, \"strange but true.\"\n\nAs I was walking down \"Hedgerow\" I met one of our old original H. Coy. Men, he went away from us at Mena, got a commission in the British Army & was sent \"to Cape Helles\" & \"Suvla Bay,\" from there he\n\nwas sent to Salonika with the \"Munster Fusilers\" & took part in the fighting there at the time of the great \"Servian\" retreat, I asked him what he thought of the Servians & he said that no one could give that little nation praise enough he reckon they are splendid, great big good natured chaps, you would hardly know them from an Englishman until they start to talk, he reckons they fight as fierce as tigers, & are as hard as mountain ponies,\" the chaps name was Mullarkey & he was always a very fine fellow, he had 2 stars up but he dropped one to get back to the Australian Army again\n","2":" Last night I had a party of 20 men repairing the blown in portion of trench, & we had just nicely started \n\nwhen old Fritz opens a pretty heavy bombardment with every class of gun & explosive he has, & I can tell you things were pretty willing for the next couple of hour’s, you could hardly hear yourself speak for the roaring, crashing shells & bombs, most of the fire seemed to be on A. & B. Coy. but we got the backwash of it, pieces of red hot steel & iron were constantly digging in all around us & the steel helmets saved many a man from a nasty crack, for these small pieces hit with some force, our guns especially the Belgian battery of 75’s retaliated hot & strong & we had the last say, our guns were blazing away a good 15 min’s after he had ceased fire I don’t know what his object could have been but I think it was on account of our mortars they have been punishing\n\nhim pretty severely of late.\n\nIt was the newer reinforcements first baptism of fire & it frightened the life out of some of them while others seemed to enjoy it like a huge joke, however we got it finished about 11oclock & just as we were knocking off the Major & Capt came around to have a look at how things were getting on, & they reckoned I had made a good job of it & were well pleased, the Capt said we need not \"stand to\" this morning so we had an extra hour in bed.\n\nEarly this morning (Black Thursday\") so nicknamed by the boys on account of the light rations issued on this day always they principally consist of bread & matches) the Captain lost a good ring between his dugout & the Signallers possy & he offered a bottle of whisky to anyone who found\n\nit, so the boy’s are having a pretty keen search for it you can bet, but I fancy he will never see it again for the mud is so deep & sloppy.\n\nThis morning I hear that the reason of the heavy German bombardment last night was that they were withdrawing a Division & were sending them to the Somme\" I pity them, but if they thought this ruse would succeed they evidently were greatly mistaken for our guns were shelling away beyond the lines & on to their lines of communication, & in spite of the violence of Fritz’s shelling he only succeeded in wounding 2 men in our Batt. But it is no good saying one thing & meaning another the Germans are \nnot\n as good marksmen as the British they may have been better perhaps at the beginning of the war, but no, not now.\n\nthis afternoon the Germans fired a mine under a portion of the 15th Battalion’s trenches & wiped about 20 of them out we distinctly felt the concussion down here where we are, but we heard no report only felt the ground tremble like an earthquake & rock for an instant or so.\n\nThey also raided the 16th. & broke in & captured about 7 but they paid very dearly for it, for the ground was littered with their dead as they were returning so they got nothing out of it.\n","3":" Have had a party of last nights details, building a new latrine, & during the morning we were shelled twice & luckily no one was hurt, I had a narrow escape for I had a fair sized piece of wood knocked clean out of my hand as I was using it. Last night I noticed a big circle round the moon a pretty sure sign of coming\n\nrain & miserable weather. I hope it holds fine for a few more day’s so as to allow us time to get out while it is fine. So far the weather is nice & mild bar for the rain, but we have struck no cold as yet & I don’t think we will before November after that I’ll bet she’s a freezer.\n\nSince we have been in here we have received a fair lot of reinforcements, so that now the Coy is fairly strong again which is much better, for it lightens the work all round. At present there is a lot of talk among the boys of the coming Referendum\" & Conscription in Australia, & from what I can make out, it seems to me that Conscription won’t have such an easy win in the Army as a lot of people think, for there is a mighty big opposition to it over here, most of us seem to think that Australia has contributed\n\nquite enough men for a young & growing country, it does not do to take all the men away, of course we would all like to see the shirkers & etc. roped in & made to face the music no one has any time for them, but half of them would be useless & would be a nuisance to every one. Last night our chap’s put gas over on to Fritz, I don’t know what the result was but there was a terrible commotion in his lines alarms going all over the place.\n\nWe have been using a lot of defective ammunition lately Yankee\" stuff I expect. Saw some armour piercing bullets this morning, they are used principally against the steel loopholes, & they will pierce nearly an inch of hardened steel so loop-holes are only deathtraps to fire from the Germans were the first to use them & now they are getting them back\n\nJust behind my dugout we have 4, 240 lbs mortars built in ready for action, but they don’t care about firing them, they reckon they make too big a crater, when we attacked at \"Pozeries.\" They put 7 over all at equal distances between our trenches & the German’s, they were for the men to take cover in between the rushes on the way across, the men got in them alright but they had great difficulty in climbing out for the next rush, & no wonder for the average crater from these monsters measures something like 30 ft across & is easily 12 or 15 ft in depth.\n\nOne of our officers Capt Price has a battery of 6 rifles grenades & he is firing them all day long, he gives them no rest from them\n\n7th. Yesterday evening Captain McKenzie Jack Price & I reconnoitred a piece of open ground at the rear of our firing\n\nline, over which we were going to cut a communication trench to reach the International\" by a quick cut in case of attack, we were quite exposed to old Fritz especially in one place & here he had 3 shots at us, but he must have been a poor marksman for he never hit any of us & we were not more than 300 yards away from his trenches after having a look at what had to be done this evening back we went, & reached our lines safely, the ground is just a mass of great shellholes so we are going to join them together & when completed it makes a good trench there is grass out there up to your knees for us animals except rats have grazed on it for the last 2 year’s I’ll bet. After dusk Mr Lancer & I took 50 men out with shovels & got the \n\nmen into position & started them off they worked real well & by 9.30 had a trench nearly finished, about 7.30 Mr Lancer left & so I was in charge of the whole bunch, we dug up several big shells including 5.9’s & \"rum jars\" Just before 10 oclock B. Coy’s bomber’s went over & bombed the Germans in their trenches, & then D.A & C. followed in turn at different hours during the night, they were all very successful & entered the German trenches in spite of their opposition, one of our Coy chaps had a rather trifling experience during the bombing uproar, he along with the others hopped into the Hun’s trenches & proceeded to lay about him with his bombs when they were heavily attacked on both flanks by German bombers so they all clambered out on top where\n\nthey could get better shooting at them & during the confusion & smoke & dust kicked up by the rival bombs he missed the rest, & wandered off into \"No mans land\" which is nothing but a maze of crater’s, old trenches & blown in dugouts in these he was speedily lost, & landed up against the German trenches & into these he pitched his 3 remaining bombs & then scuttled off towards ours but he found out as others have before him the difficulty of approaching our trenches unseen, & being on his own he was immediately shot at, had the men in the front line only known that one of our men had not turned up they would not have shot at him, but the officer on coming in through some mistake reported \"all correct,\" the chap then crawled along the line some distance\n\nwet to the skin & cold as ice for it rained heavily during the night, & he had nothing but his flannel on, at last he decides to go no further but to get as \"close to our line as he could to wait for day light to come, at last he spots a periscope & sings out, out bobs a steel helmeted head as surprised as you like, he tells him to hang on for a while while he goes & gets someone to help him in, but the chap never waited, but jumped into our barbed wire & tore his way through & leaped into our trenches before the surprised Hun’s could get a shot at him he was dead lucky to get in safely. From information they got last night the \"Brandenburgers\" the Kaisers most famous troops are in front of us, we also had a cut at them down at \"Pozeries\" & the boys dished them up properly\n\nWe had 2 men pretty severely wounded & that was all our casualties, & the other Coy’s were about the same, they had far more volunteers than they needed for this daring piece of work, for daring it was & they followed the terrified \"Sausages\" down their trench bombing them all the while & driving them like a flock of sheep.\n\nReceived my pay book back from England this morning it was being audited Some letters arrived for me last night Some of them make reference to my photo’s they reckon I look pretty crook & show traces of the hardships I have undergone hanged if I know they seemed alright to me when I sent them, however they have caused Len & I a good bit of amusement The 3rd Battalion are taking over from us & we are shifting into reserves\n\nthis evening as soon as it gets dark enough having completed our 10 days in the trenches I am writing this sitting in my dugout having just come off duty & I have a few minutes to myself before tea. Len & Dave Murray are playing draughts on a cloth handkerchief sent me by Mrs Mitchell, it was a very handy little thing & not a few get a bit of amusement out of it, & while away some slow hours I don’t get much time for it myself though I can’t say that I am fond of the game Bridge\" is the game I like to play, Len & I as partners take some beating at it too The guns on the Somme\" can be heard very distinctly today, so I expect we are making another big attack down there on that once beautiful but now shell torn & ravaged part of lovely France one can never forget it \"La Belle France\" \n\n8th. I had a lovely experience last night. I had charge of the last party that moved off from our old positions at 8.30. Something like 60 men not a bad swag for a corporal to look after, well on the way down we had to follow a tramline a part of the way, & down both sides of the line there are great holes 3 parts full of water made by old Fritzie’s shells, this little line is our means of bringing nearly everything to the firing line & all night long it is crowded with trucks going both ways, well as luck would have it just as I was passing one of these big waterholes a truck, or something, hit me & knocked me head first in, I fairly dived into it with every thing I possessed, full marching \n\norder rifle & all. I went under right out of sight & I had some difficulty in rising for I was heavily weighted, & when I came to the surface I found that my rifle was at the bottom so down I had to go after that & scoop it out of the soft mud what a nice weapon it looked the Germans need not have been afraid of me if they had attacked me with a rifle like that, to my surprise the water was not the least bit cold I thought it would have been freezing but I was in a beautiful state green slimy weed’s hanging all over me & water running off like a wet rag. I thought my watch & fountain pen was spoilt but neither of them were hurt though nearly all my papers & letters were spoilt\n\nI felt that disgusted & wild with myself that I never uttered a single word, never swore once, not that I don’t swear oh no\" but I felt that full up, to full in fact for words however the night was fine & by the time we reached our dugouts nearly 4 miles away I was beginning to get dry, & as soon as I got the men sorted out & fixed up I turned in & changed my clothes Dave Murray lent me a clean flannel & I had underpants & socks so I was pretty right for the night\n\n4.30 this morning we were all roused out for fatigues & wasn’t there some swearing & cursing we had an early breakfast & away we went up to the firing line to work for the Engineer’s, arrived\n\nthe party had to carry A frames & etc to the sap where the work is going on the trench is nearly full of water & we have a pump working on her & all men have great big \"gum boots which reach nearly to their thighs. About 11 oclock I thought I would take a run down to the canteen & get some stuff for the boys & myself, so I borrowed one of the 3rd Battalion’s mens coat, for each Batt. runs a canteen & they wont serve other Batts you know, & they are easily told by the colours on our tunics, each Bn. having a different color, so we swap coats now & again when we are near one anothers canteens so as we can buy some things, well I put the borrowed tunic on, & forgot to throw my box helmet over my shoulder\n\nnow this is very much against the Army rule’s for we are never supposed to be without them day or night I was hurrying down the trench & I bumped into a 3rd Batt. officer he spots me without the helmet, & pulls me up & asked me where my helmet was I answered him readily although I was taken by surprise, what Coy. do you belong to was his next question & I told him so I did but not of his Batt, well he said don’t let me catch you without it again & off he walked.\n\n.As soon as we arrived here last night Len & another chap named \nGilligan\n WATMAN had a fight, it appears \nGilligan\n WATMAN called him a B- & Len into him & knocked him out in a couple of rounds it was an easy victory. \n\nPay day this evening & the boys are all buzzing around.\n\nAbout 200 yards to the rear of us there is a Belgian battery & this morning I heard the battery commander giving the ranges, they kick up a nice row\n\n9th. Reveille at 3.45 this morning a real cockies hour, we had our breakfast & \"fell in\" by 5 oclock & then marched over to Coy. Hqr’s where the parties were drafted on to the various jobs & then marched off. I had a day off & Captain McKenzie Jock Mackie Bob Porter Jack Price & myself went up & had a look at our Assembly trenches where all have to meet in case of attack, they are beauties & half full of water it would be impossible to get in them we would have to lay outside in\n\nthe great shellholes, we saw some fine partridges around here. A rather funny thing happened on the way back, we were all walking bunched up instead of in single file for the road round about this part is very dangerous for the Germans shell it heavily. While we were walking along in this fashion an Engineer Major came along on a bike, & he pulled up opposite us, & roared out at the Captain, What the Hell do you mean by this sort of thing you dopey silly -, get into single file at once & he roared a treat, no one answered him & the best of it was that the Capt never had no stars up & anyone would take him for a private\n\n& he could not say anything so he took it lying down & walked on, when we got a bit away we had a great laugh over it.\n\nI have been busy writing letters all day today for one of my mates is going to England on leave in a day or so & I am getting some ready for him.\n\nWhere we are camped now is right amongst the gun’s & tonight they had a bombardment & they were roaring all round us 75s 18lbs 6 inchers & all the rest of them one of our aeroplanes was directing the fire, & Fritz was firing at him like mad with his machine guns but the plane took no notice of them but kept on flying close in & signalling the effects\n\nof the hits & etc.\n\nTonight we tapped a German wire & got a message to the effect that they were going to blow a mine up at 6.15 but they did not state the date, so all the men this evening have been withdrawn so if he sends it up it wont do much damage. I hear tonight that General Birdwood has gone to Salonika, does it mean that we are going there or has he left us I hope not the latter, & besides none of us have any desire to leave France to fight, she will do us.\n\n10th Early rising again this morning & we were away by 5 o’clock, on our way to Chester Farm\" & from there to the crater, that we hold, a mine was the cause of it & you should\n\nsee the gaping hole it made in the ground & the earth is thrown up all around like a small mountain the whole concern is shaped like a basin & is easily 70 feet deep, & from one place on it we have a bonzer \"observation post\" & yesterday they could see hundreds of German’s at work behind the lines, of course they never got shelled. As we were coming across some open ground this morning taking a short cut for it was not light enough for the Germans to see us, we saw hundreds of partridges & some beautiful pheasants, they are fine big birds, this war is giving the wild life around the war affected area a good chance to breed for the place is rapidly growing wild & young trees are springing up all over the place & scrub & long grass\n\nare taking possession of the paddocks Just down close to our Hqrs there is a peculiar sight a big German shell sticking in a tree & a good ½ of it is hanging out it must have been nearly spent otherwise it would have gone right through the wood. We were caught nicely this afternoon in the trenches for the Germans started to shell heavily the very exact place we were working in & things were far from pleasant for some considerable time, a couple of men were killed & a few wounded & some big dugouts were blown right in, our guns replied to their fire & things were what you would call mixed for a while.\n\nThere were some Staff officers through here at the time having a look round & our Colonel (now Acting Brigadier) \n\nwas among them my word he is a fearless man how he has not been killed long & long ago beats me, for he would not dream of sending a man where he would not go himself, we have never had a Colonel like him before & he has made the Battalion what it is today, one of the finest in the whole of the Australian Forces if not the best, for believe me the 1st Battalion has a fine name & record & we are taught to live up to it, first in name & first in everything else in many ways it does not pay to have a good name for so many hard & difficult jobs are given to you simply because of your record, & we are then in honour bound to make a success of it or perish in the attempt, this sort of spirit is beginning to make \n\nits appearance in the Battalions of the 1st Division & they are struggling one against the other to show the finest performances, this is what all Armies should be like & have plenty of the Regimental spirit which makes one think his own particular Regiment is the very best & he for one would never disgrace its name.\n\nAll the English Irish & Scotch troops have these sort of things to look up to but Australia being a new country had none previous to this war now she, or rather the 1st Division can look up to such battles & fights as \"The Landing at Gallipoli\" \"The Cape Helles Charge,\" \"The 19th of May\" the terrible \"Lone Pine battle\" & the Struggles on Sari Bair\" Then we come to France & the greatest \n\nbattle of all The charge on \"Pozeries\" which belong to the","4":" Division entirely, & our Battalion was one of the Batts to lead the charge & my humble self was one of the first over the parapet & into \"No mans land\"\n\nAfter us came the other Divisions & they all done very fine work but the honor of the charge belongs to the good old","5":" Division, & they have never failed yet in anything they had to do, nor lost an inch of ground once gained, what made the capture of Pozeries\" all the more creditable to the Australians was the fact that the English had 3 times before assaulted this stronghold & the longest they held it was 2 hours & they were then driven out, when we went over there were any\n\namount of English dead lying everywhere, showing the slaughter there was for the place, but in spite of their thousand guns & their attack they never shifted the Australians. I’ll never forget how pleased the English & French were when they knew for certain that we were holding Pozeries\" firmly & were actually advancing, English officers bought beer & cake & etc for the boy’s in fact they would do almost anything for us & the French although we could not understand them showed their delight at the Anzac’s success, \"Anzac they used to say \"Anzac\" bon \"plenty Anzac finish Allemand\" which meant that if we only had enough Australians we would wipe the Germans out, & it is a fact that\n\nwhen we captured \"Pozeries\" the whole French line cheered right from the \"Somme to Switzerland, & Australia’s name was made that day with both French & English soldiers for they had proved themselves even better than their Gallipoli reputation led them to believe.\n","6":" This morning rose at the usual unearthly hour & had breakfast, & was then informed that my platoon would not be for duty today, but that I would be taking a party from another platoon of course I pricked up my ears at this & over to the Sergt. Major I went & if I did not tell him off\" well may I be shot\" he was trying to work a point on me but he found I was not so green as I looked & the result was that he had to find another Corporal in my place, he got one from the bombers\n\nIt is very warm this morning I am afraid rain is handy\n\nHad all the men cleaning up around the dugouts this morning for there is to be an inspection this afternoon by the Colonel, & he is very particular Also took all shortages this morning for the very latest is that we are going down to the \"Somme\" but before we go we are to have some training in street fighting & etc, I thought we would not be along without something like this turning up for we are nearly full strength again.\n\nThis afternoon I took my letters over to the old Chateau: where my mate is camped with the Light Trench Mortar Battery or otherwise the Stokes\" gunners\n\nhe was out at the time being up in the trenches so I left them there with one of the chaps who promised to give them to him.\n\nWe are living pretty well just at present plum puddings cake & etc being the order of the day for we have a bonzer canteen & they supply us with plenty of money.\n\nIt has been windy & dull all day but rain is hanging off well so far\n\nSome of the","7":" Battalion were round here today having a look at our billets they are coming here I believe.\n\nThis evening we had a nice game of football officers & all had a go funny you know football about 3 miles behind the lines it was in a nice little grass paddock all among the guns & howitzers.\n\nToday Len had a party up in the trenches & he got a bonzer piece of driving band up there, we are going to have it fixed up for Xmas, & send it home.\n\nThe Belgians are bombarding heavily tonight, & the air is all quivering with the vibration from their gun’s\n","8":" Up again at 4 a.m. it is surprising how warm the mornings are just at present why I never have my tunic on until it is time to fall the men in, I thought by this time it would have been freezing & to all of us it has been a most agreeable shock.\n\nI am off again today the result of the \"Telling off\" I gave the Sergt. Major yesterday morning I reckon it does the world of good to shake them up now & again.\n\nAt the present time \"two up\" is very popular among the boy’s they play it every opportunity they get, some of them win large sums of money & many others go broke, but it is no use trying to put gambling down in the Army for they will always find some way or other to gamble & \"two up\" is I think about the fairest\n\nSent 5 £ away yesterday to London for those Card’s; they have been ordered a good long while now, & will come in handy for Xmas\n\nWe were relieved tonight & just as we moved off all the guns around us opened fire on the Huns trenches for we were sending over raiding parties, the noise from the hundred or so guns nearly deafened us for it was one\n\ncontinual roar, & the ground shook & trembled from the continual concussion, vivid red stabs of flame were darting out from the most innocent looking places you could imagine, its perfectly wonderful how they can hide a gun, why I have almost walked on top of them without knowing one was there we walked right through the middle of them & in some places we were that close that you could feel the hot air of the gun on your cheek & the report would almost seem to lift you off your feet, we could hear the shell quite plainly as it whistled over our heads, on its way to the German trenches, it was a fine sight, to look up there, where the shells were bursting in one contin-\n\n-ual blaze, which combined with the many coloured flares made the scene quite a brilliant one, that is of course from our point of view, it must not have been too nice for those in the trenches.\n\nThis fierce bombardment lasted exactly 10 minutes, but during that time many & many a German met his death for the boys had been over, & they reported that the German trenches were half full of dead men, & they accounted for what was not killed by the shells \n\nOne party killed a party of 4 Huns on the way over I suppose they were out on patrol & got caught.\n\nAll the raids from what I can hear were successful & there were a large number of them somewhere about 40 I believe during the night, the 3rd Bn. met opposition for the\n\nBoches were waiting for them with bombs but it was no use for they entered the trenches just the same. The Germans hardly replied to our fire I can’t make the squareheads out lately. We had to march nearly 4 miles to rail head just outside Ypres where our train was waiting for us, when all were in away we went & got out at the usual place & from here we marched to \"Devonshire\" billets where we arrived about 10.30 & the cooks who had gone in front of us had hot tea waiting which was very acceptable after this we went to bed & slept soundly till Reveille.\"\n","9":" This morning we handed in our box helmets & steel hats & all were very pleased to get rid of them for they are a terrible nuisance\n\nto carry about. \n\nAfter this we all \"fell in\" & were marched off to the baths, it is a fair step there, but it is worth the trouble for you feel ever so much better after it they have a very cute way of driving you out of the baths when you have been there long enough, each batch is allowed a certain time, & when that is up, down come’s the cold water, & By Jove it is cold the room is cleared in a couple of shakes I can tell you, for no one will waste time arguing about the cold water. Captain McKenzie was sent away suddenly today to England he is going into a School of Instruction\" I am sorry he has gone for he was pushing Len & I along, now I expect we will be forgotten.\n","10":" Up early this morning for we are moving on again, breakfast 6.30 & after that we had to get everything cleaned up huts all, & move off at 7.30, we marched out punctually to time & skirted Poperinge\" with its tall towers & spires showing up nicely against the clouds, we walked steadily on spelling for 10 minutes after each hour of walking, the roads were in fine condition & the weather cool & I think it was one of the best marches we have done for practically never a man fell out during the 12 miles & that is pretty good considering we were carrying every thing we possessed I saw Tom Flattley on the way down just over the Franco-Belgian border, we went through a town right on it \"Watou Abeel\" here \n\none side of the road is French & the other Belgian but you would never know it for there is practically nothing to tell you at present.\n\nWe finished up in \"Steenvoorde\" & in the centre of the town, people were selling great rolls of cloth they had them placed on stands, all French or Belgian towns that I have seen have a fair sized square in the middle of their town & all roads lead into this.\n\nAfter we were billeted we bought some coffee off the old dame at the farm house & had a bit of dinner for we were fairly hungry, & our \"cooker’s\" had got lost on the road About 3 oclock Len came up & we went into the town with 2 or 3 more for a good feed for we were\n\nall longing for a good dinner, we went into a butchers shop to buy some sausages, & we took a turn for the French girl on the sausage machine, for it was pretty heavy to turn & a soldier always likes to help a girl, we took our sausages to a shop & here we had them cooked our dinner when served up consisted of 3 big sausages per man the other 3 had 4 eggs each for I never touch them, about a pint & a half of tender green peas, potatoes, bread & butter coffee & custard & fruit (peaches) the bill was very reasonable 13 francs for the lot, we struck several girls here who could speak English real well, they were Belgian refugees & had been here since 1914 when they fled before the advancing Huns\n\nThey have got a nice church here & I was in it for a while, it is amusing to watch the French people coming into church, they first all walk up to the \"Holy water\" & then cross themselves & when they get opposite the altar, they bend their knee right down, the place was full of little girls & most of them were praying & a few were saying \"confession\" in their little boxes.\n\nAny amount of women barbers at work here, it seems funny to watch them Saw Captain Jackson & Lieut. Beckett this evening they have just come back from England\n\nOn the way down we saw a pretty sight 2 aeroplanes starting off for their flight, they work up a great pace before they leave the ground\n\nIt was funny down in the town tonight to see all the boys ducking in & out of the butcher shops buying meat for a good feed, for we were all more or less meat hungry & practically the whole Battalion was in, & against \"orders\" too.\n","11":" is round once more & when we rose this morning at 5.30 it was raining heavily, but it turned out to be a shower only, I went over & drew our rations for we were camped some little distance from the rest of the Coy. & by the time we had breakfast the rain had stopped & things looked lovely & green. A lot of the boys got drunk here & I had a terrible job to get them ready to move off in time, even then the Machine gunners left a roll of blankets\n\nbehind & there was a stink over it. We started off in high spirits, & everything went well for a long time, we went through some of the loveliest country as ever I have seen it laid between Steenvoorde\" & Cassel\" we gradually climbed a fairly steep hill with very sharp turns, & lined on both sides by beautiful rows of trees some of them a great height, & I noticed a lot of huge oaks among them with ivy nearly choking & smothering their old trunks, but when we topped the ridge & looked down on the lovely valley which sloped away to the North West almost as far as the eye could see & gradually opening out into a vast alluvial plain of whose richness one could have no doubt once he looked & saw the rows & rows\n\nof newly harvested stacks & other young crops already beginning to get green, as we got further round there was an even more beautiful sight for in the distance less than a mile away built on the slopes of a hill was a fine little town (Cassel\") & perched far on top was an old Castle\" with solid looking stone houses crowded all round it & an old square towered church was plainly seen, & we could hear the chimes of the old church bells as we slowly plodded on, for it was church time & the French people were all on their way, dressed in their Sunday best, the majority of their dress very old fashioned which make the girls look older than they really are, I’ll bet the old bells recalled many & many an old time memory, of other days when we didn’t\n\nalways carry rifles & dress by \"the right\" As we slowly followed the winding road around this pretty hill, we gradually climbed on to a ridge which led up to the town, & you could look down on both sides of some of the most beautiful scenery as ever a man could wish to lay his eyes on, nothing but littles clumps of pretty trees & green crops & beautiful grass, & talk about flowers they were there of every possible hue & variety chrysanthemums, dahlias, roses, pansies daise’s, I never saw the like of some of them, they were simply beautiful.\n\nAll along the roads the hedges were smothered with black berries & they were hanging dead ripe within reach of us as we marched along & needless to say we made the most of our opportunities, & the blackberries suffered\n\n \n\nAfter passing \"Cassel\" the road led down the hill on to the level ground & here we passed some beautiful mansions set back from the road in a patch of green trees, & round all of them there were beautiful lawns & fountains playing, & most of them had a fine stream of clear water running past the lawn & over & along these little streams of water hung lovely spreading trees some thing like what we read about on the South American rivers, I think & with the exception of the South of France this was the finest part of France that I have so far seen.\n\nThe Germans had been for a short while round this part for I saw the marks of their shrapnel in several places, notably on the gasometer.\n\nWe were bound for \"Noordoopene\" & quite naturally lost our way & marched nearly 4 miles out of our track, didn’t we swear when we had to \"about turn\" for we were foot weary & tired for we had already marched 12 miles, however we reached our billets in time, & the space they had allotted for the Coy. was not half enough so there was more trouble, but this was fixed up eventually, we then had a feet inspection, & after that all the Platoon commanders with the exception of mine shouted beer for their men.\n\nA Small mail came in here & I received 4 letters out of it so I done alright We are camped in a lovely little place & the paddock surrounding the barn is as green as it possibly\n\ncan be & Len & a lot more are playing football for it has turned out a lovely day just a tinge of cold in the air which makes one feel splendid & gives a good appetite.\n","12":" Len & I slept in an old waggon last night for the barn was crowded, & we both prefer when possible the fresh open air, the night was lovely & starry till nearly 3 oclock when we had a sharp shower, but we never shifted only drew the blankets over our heads & let her rip.\n\nHad a bonzer game of football before moving off for everyone was in fine spirits & the morning was absolutely grand with just a tinge of winter feeling in it\n\nWe moved off sharply at 8 & picked the rest of the Battalion up lower\n\ndown, as we were moving off we had a sharp little shower of hail the first I have seen in France.\n\nWe marched through beautiful country for hours & hours, & 2 places in particular I will never forget, one of them was when we climbed a long ridge & saw through the great gap between the clad hills, one of the loveliest panoramic views of the country as ever one could wish to see, as far as ever the eye could follow right away to the horizon which must have reached nearly to the coast, there stretched endless miles of lovely green country covered with trees & big towns & villages all over it, they showed up splendidly for the sun was shining brightly which set their white stone walls & red tiled roofs off to perfection\n\nbut the \"masterpiece\" was to follow for we were gradually climbing a rise, & at last we reached the top & nearly everyone was startled into an exclamation; for the scene that laid in front of us beggared description, right at our feet a fine wide river was flowing & houses were built all along the banks, & canals & lakes were to be seen everywhere, the town of Watten\" is situated here, & the surrounding country could be followed plainly with the naked eye until it lost itself in the distance, everything looked to have a lovely colouring over it & so green & restful, & cattle sheep & horses were grazing peacefully all around us, & behind us & on the top of the hill\n\nset in a clump of nice trees there was a fine old castle, I could have looked on the beautiful landscape for hours, & I was so wrapt up in France, however I was brought back to earth by a basket of French cake & biscuits being thrust under my nose by a little French girl, & these were very welcome for I was very hungry.\n\nThe Major let us rest here for nearly ½ an hour, he recognised the beauty of the place, & gave us the full benefit of it, from here the road led down a pretty steep hill into the town itself, where the French or should I say the Flemish people were all out to see us march through their pretty little town\n\nOne thing is very noticeable in most part’s of France & that is the lovely lace curtains that are in the majority of their windows they do look nice & homelike,\" oh she is a lovely country the more I see of it the better I like it, for it forces the beauty of itself upon you, I can quite imagine why it is that the French are so patriotic a people & well they need to be for they have surely one of the loveliest countries on earth for their birthplace.\n\nWell we finished up our march just on 2 oclock during which time we covered 16 miles in full marching order pretty good going as soon as we got our packs off the football was produced\n\n& we had a rare rough & tumble game for nearly 3 hours, now what do you think of that, yes it is true & I was about the first one out, we played in a lovely paddock of green grass where if you fell you couldn’t hurt yourself, 2 of our officers came out & had a scramble with us\n\nThere are some magnificent walnut trees where we are billeted some of them must measure 60 feet across from one side to the other & they are loaded with nuts & the boys have been knocking them down all the afternoon\n\nNo.9.Platoon are stiff they have lost nearly all their blankets somehow or other, we are more fortunate for I got ours as soon as they hit the\n\nground almost, you can’t beat getting in first\n\nGot hold of a sovereign today they are pretty rare things nowadays, so rare that I have almost forgotten what they were like.\n\nOne of our chaps collared a pretty expensive turnip the other day he pulled it out of a little patch as we were marching along the road, now this is very much against the rules & an officer caught him & sent him up, the turnip cost according to the fine 25\/-, so now whenever the boys see turnips they sing out to one another & ask \"who wants a turnip\"\n","13":" This morning we rose fairly late for all were very tired after our trying 3 days march, & I was stiff & sore all over, from the effects of the football\n\nafter the heavy march, but the morning was a beauty, sun shining brightly birds singing, & ducks, fowls, cows & pigs all kicking up a noise outside it reminded me of the old farming days what a country of contrasts, the firing line, & then the lovely country behind.\n\nWe had a parade at 9 oclock, it was for the voting on the Conscription question & we had everything ready in fact all the A’s & some of the B. had already voted, & I was just about to record mine, when a \"runner\" came through from Hqrs to say that the voting was postponed till the 19th or 20th, so that settled the thing, we then took our platoons list of \"shortages\" again I would not like to say how many times we have got to take these before we get the articles.\n\nbut the shortages\" are always treated as a joke in the Army.\"\n\nThis over we were dismissed & then the football was produced & soon all the boys were up to their neck in it oh\" how I would like some of my people to see this lovely country I am sure they would love it as much as I do for it is so beautiful, & I believe every man is better in his heart for seeing & living in it.\n\nWe got a lot of lollies this morning from the \"Comforts Fund.\"\n\nHad a short parade this afternoon & had to get all the men’s name’s who have passed their shooting test before joining the Battalion They also got all the mens signature’s who had put in for the \"Anzac Book\" it cost us 5\/-.\n\nWe are all filled with hope for this afternoon Mr Yate’s told me that we would be moving on again in a few days, I asked him if we were going to Blighty\" but he only laughed & said he could not tell, but every one seems to have it in their heads that we are going to England or Salonika\"\n\nWe are camped at present in an old barn & are sleeping on straw, it is bonzer & warm quite a change to the cold & muddy trenches.\n\nThe boys are in great spirits tonight & Len is one of the ringleaders in the rough & tumble that has been going on, \"no man standing\" cockfighting & etc, this rough play has been taking place in a good lump of an empty bag well covered with\n\nplenty of straw, it is too thick for anyone to get hurt very much on it\n\nRain has set in tonight, but we can’t complain for we have had quite a stretch of fine weather\n\nWe all had cocoa for tea tonight & it was bonzer.\n\nThe name of this little village is \"Nortlelingheu\" rather a long name for such a small place isn’t it\n","14":" This day 2 years ago we sailed out of Sydney harbour on the old \"Afric,\" & of all those hundreds of fine men who left the \"Sunny South\" on that day there remains but a mere handful, it looks very much as if one of our chaps words will come true, he said when we left that we would be able to bring all the men who were leaving with \n\nthe 1st Div. back to Australia in a rowing boat, how we all laughed at the idea but unfortunately it is fast coming true, there are but 4 left now in my old original Coy. H. I wonder what a fellow would have said if he were told when we left Mena \"that he would be one of the 4 lucky ones who were to be spared.\n\nRather cloudy & dull this morning but I don’t think it will rain.\n\nThis morning 12 men from each platoon had to be detailed for Musketry Instruction nearly all of our new hands were sent for I think they are far more in need of it than the older hand’s\n\nParade as usual this morning, rifle & platoon drill, had to detail 8 men for platoon bomber’s, & 4 for Lewis gunner’s, platoon is nearly\n\nall details.\n\nFrom 10 to 11 this morning we practised rushing trenches in waves digging communications, & fatigue parties following up the waves. Have seen plenty of hares & partridges round about here.\n\nThere is a very strong rumour round here tonight that one of the officers has gone away for an embarkation officer, & then again some reckon we are going to the Somme\" again in a few day’s, so what are we to believe but in spite of all the pessimistic rumour’s we are still in hopes of going to Blighty\" though it does seem to be too good certainly, but why not bring the 3rd Div. over & let them have a go they have never struck a blow since they were\n\nfirst formed & lately \"John Bull\" has been giving them a nasty knock or two they are a joke with all the Australians in France\n\nThis afternoon on parade, when all the \"details\" were fallen out, we had 6 men & 10 N. C. O.’ s left, all the rest were bombers, machine gunner’s signallers, & etc, we have a very good system now & every man in a Battalion is a \"specialist at something or other, this system makes the Australian Army a very competent one for we have competent men to teach in each branch of the Service.\"\n\nTo-day was pay-day & consequently a good many of the boys are on \"show\" tonight & things are quite merry\n","15":" There was a very heavy shower of rain at \"reveille\" this morning, but it cleared up nicely afterwards\n\nThis morning instead of our usual parade, we had lectures on \"open order fighting\" & etc.\n\nAfter this was over those men who had not voted on the conscription affair were hauled up again & recorded them, one thing about this seems very peculiar to me, there are any amount of chaps among us who have seen quite a lot of service, & yet because they are under 21 they are not allowed to vote while people out in Australia who have never seen a shot fired in anger are allowed to vote on this important question. I guess the people in Australia will get a terrible shock when they get our return for the feeling is very much against conscription.\"\n\nThis afternoon on parade a message \n\nwas read out, that had been sent by General Birdwood, although not saying so in the message one could easily see that he like all the other military men favored conscription, but I don’t think his letter made any difference to the votes.\n\nWe recorded our votes on a small piece of white paper with 2 squares marked Yes & No after we had voted, we put them in a pink envelope & sealed them down.\n\nWent for a fairly long route march this afternoon & they made the pace a cracker. After coming in off the march I issued out the clothing & etc I had requisitioned for a few days back the trousers & tunics were what the boys called \"Tommy Stuff\" & you have no idea how we hate \n\nto have their clothing issued out to us, it is only natural that we should like our own distinctive uniforms best, & all like to look like Australians, you should hear the men performing & swearing some of them refuse to have anything at all to do with it, they prefer to wear their old Australian uniforms, till it almost falls off their backs rather than wear the English uniform & quite right. I fail to see why they can’t keep the supply up to us, rather than let it go to some of the shoddy manufacturers & contractors in England from what I have seen of the various manufactured articles during this war, well Australian goods have nothing to fear by comparison if a line can be drawn from such articles\n\nselected at random from a large list as, \"jam, butter, meat, tinned goods, clothing of all descriptions, leather goods such as harness & boots, yes & even the Lithgow rifle, now that its former faults have been overcome has nothing to fear by comparison with its English brother, the B. S. A.\n\nTo-night is the night for rumours each one that comes in has a different tale to tell, some say we are going to the Somme\" some Salonika, some Blighty, others think Arras, which looks to me the most likely for I see by the papers that there have been very heavy bombardments down there lately & that’s a pretty healthy sign of coming battle in that quarter, but it don’t matter much I suppose for wherever we go there is\n\nbound to be plenty of strafing.\"\n","16":" Last night was fine & starry but frightfully cold we shivered nearly all the night for a single blanket is not to warm for the end of Autumn in France. This morning for breakfast we had plenty of porridge, bacon, tea, & etc. Captain Jacobs shouted the porridge for the boys.\n\nThe boys played up again last night they had been drinking rotten strike me dead rum, it nearly drives them silly especially when taken on top of wine, if I had my way I would settle the drinking question for ever I’ll bet.\n\nWe started off on our march about 12 oclock, & if we did not have a trouble to get some of the men along well it’s a pity, one chap got grabbed in my platoon before we cleared the town \n\neven, the R. S. M. pulled him out.\n\nOn the way to St. Omer 2 of my men started fighting in the ranks more trouble; but I got them separated before any damage was done, several of them were that drunk that they could scarcely walk & kept falling over in the road.\n\nWe reached St. Omer just at sundown & marched across & then along the canal & into the big railway yards there, where our train was waiting for us, trucks were allotted us & they were filthy & parties had to be detailed off to clean the horse dung & etc from them, this done we got the men in & settled down. Some of the boy’s got permission to visit the canteen just outside the yards, for we had no food since morning & all were very hungry, the majority got back in time to catch the train, while a \n\nfew are still there, there’s a nest of trouble waiting for them when they return. Just before we started another one of my chaps got shot in the clink, he was as drunk as a lord & kicking up a noise when the Capt. spotted him with a bottle of this \"strike me dead rum,\" he ordered the chap to give the stuff up but he refused & gave a lot of cheek, so the Capt. gave him in charge, he could not do anything else the way he was abused, some fellows look for trouble alright.\n\nThere is a bonzer big canal running through St. Omer & it was crowded with big barges loaded with all sort of products from the country further up & here & there could be seen cutting about, fine British motor boats carrying the Union Jack they were\n\nquite a nice size.\n\nSt Omer is a fine big town & has some large buildings in it. I noticed some very pretty girls as we marched through her, the girls seem to be one of the first thing a chap looks for, & I can tell you a large majority of the boy’s judge a town by its girls & the boozers\" (or pubs) the closer the boozer’s the better the town\n\nThis town was General French’s Hqrs at the beginning of the war.\n","17":" Well here I am sitting up in my bed which is in an old house, my platoon are occupying one of the top floors & we have straw & our blankets, & by the \"Holy Moses\" we want them for we have been & are yet nearly frozen to death, we left St. Omer\" last night about 5.30, & in a few minutes after leaving both doors were shut tight for the sun had set, & the gentle breeze\n\nwhich was blowing cut like a knife soon all overcoats were out & the boys all laid closely together to keep the warmth in, during the night we passed through Calais, Bologne & Etaples at the latter place we heard the bugles sounding the \"Last Post\" as we went through a lot of the boy’s thought we were off to Blighty once we got down in this part but I was not deceived for I guessed they were taking us the round about way, for what reason I don’t know but I suppose they have it all worked out.\n\nThis was one of the coldest nights I ever experienced it was on a par with my first night under the Pyramids in Egypt I nearly froze to death, my feet I could not feel, & try as we would we could not get warm, you should have heard the language, but all the swearing\n\nnever stopped the frost or cold so we had just to grin & bear it, we are now beginning to get the cold weather, how we are going to stand it when the snow & hail comes along I don’t know, I’m thinking it will put half of us out of the running, we shivered & our teeth chattered all night long, we arrived at Longprenz just as day was breaking, here all got out of the trucks & fell in\" I was that cold that I could hardly give \"my orders\" my voice sounded like a drunken man’s thick & unsteady, & soon we were on the move & our footsteps sounded like a rapid tatoo on the hard frost road, we all had our packs on over our overcoats & in this way we marched for hours & hour’s we passed over a fine river a couple of miles from the station.\n\nWe walked miles & miles before we got\n\nour feelings back again, & if we stopped for more than 10 minutes at a time we nearly froze, about 7 oclock the sun rose, & there was never a cloud in the sky but even though the sun shone brilliantly there was no warmth in it \"oh how we all longed for the good old Australian sun, they said when we started out that we had 7 miles to walk but it turned out to be nearer 10, & I can tell you we were nearly done when at last we sighted our billets, we had to go down a fairly steep hill into it & a couple of the boys got nasty cracks from slipping on the glassy surface.\n\nSome of the country looked lovely as we came through with its mantle of white laying all over & the sun shining on it all, that is of course if you cared to look on the beautiful as it appeared\n\nbut the majority had no time for anything like that, they only thought of the cold.\n","18":" Very very cold last night, & a sharp frost this morning, made one pull some funny faces while shaving before sunrise in the open.\n\nHad a parade this morning & the R.C’s were marched off to church in one of the little Catholic churches round here while the rest of us went out on parade for our padre is away crook. Most of the morning was put in on physical jerks & running about to keep the men warm for it was very cold out in the air, had a little Coy. drill & finished up on a route march.\n\nOn getting back they held an Orderly Room\" & dealt with a few cases & some of those who played up the other\n\nday when we were moving are getting a Court Martial.\n\nThe reason why we are drilling today (Sunday) is because of the ways the boys have been playing up the last 2 or 3 days, coming home drunk & kicking up a frightful din, it would not be so bad if they only kept quiet but no, they must shout & sing at the top of their voices & be heard for miles around a lot of the newer reinforcements are responsible for it & we have to suffer, I reckon that’s a rotten system, but the drunks cop out in the long run for they get fined pretty heavy. Last night a fine big parcel arrived from Mr Duke it was packed in a box & weighed about 30 lbs & had plenty of eatables in it which in our present circumstances were very acceptable, for tucker is fairly scarce round here \n\nRumour has it that when we leave here it will be in motor buses & we go straight to the firing line & hop over,\" what Bon! The kids round here come round collecting bully beef for French prisoners of war in Germany This afternoon we had Battalion parade for the purpose of reading out the results of 2 Court Martial trials, one of them was charged with being drunk \"while on active service\" & \"striking his superior officer\" he pleaded not guilty but the court found him guilty\" & he was sentenced to 2 years hard labour, it was not good enough for him for he was a useless malingering waster who had never done a real days soldiering in his life he had spent most of his time in the Venereal Hospitals\" & loafing about at the different Base’s, the other chap was charged with desertion, he got as\n\nfar as the border of Switzerland & there he was copped he got 15 years penal servitude, they were both bad looking fellows, the Major seemed considerably cut up about this sort of thing occuring in the Battalion & he gave us a little lecture.\n\nLen & I have been enquiring about sending money to England, but find we can’t do so, unless we have some dependent on us living there.\n\n2 chaps out of my platoon are getting a Court Martial over their drunkeness. I done my best to keep them out of it but they took no notice so now they have to face the music.\n\nThere are plenty of apples about our billets & we are making the best of them.\n","19":" This morning turned out a little warmer than most of them, & a good\n\njob it was for we were moving at 6.45 & all was hustle & bustle to get things cleaned up & packs ready by that time. We fell in punctually to time, & then the Capt. had a look round the joint he reckoned outside the billets was disgraceful & he was pretty right for the drunks never used the latrines & made a terrible mess all over the place.\n\nThe sun was just rising as we marched out of Brucamps\" & the roads in places were sloppy but once we reached the high ground they were bonzer, they reckoned we had to march a mile to the place where we were going to catch the buse’s, but the military miles are notorious, they are a good match for a cockies mile at any rate this mile turned out to be nearly 3 & we were all cursing & blinding everything when at last we struck them, they were \n\nall lined up along the road, there must have been hundreds & they were all French there were a lot of colored troops with them, one for each bus to help the driver they come from Madagascar & were not at all bad looking, they all had bonzer warm fur coats on made from goat skins I think, they looked very comical but I’ll bet they were warm for they reached nearly to their shins.\n\nAfter a bit of manouvering 30 odd men were told off for each & one of these blacks led each party to the motor, they seemed very pleased as they led the boys down, it seems to be a regular thing with the French to run their troops to the firing line for these buses were fitted up for the purpose seats, rifle racks & all, they shifted the whole Brigade at one stroke in this fashion something like 4 or 5000 men\n\na distance of 30 miles.\n\nOn the way up we ran through some fine towns including Amiens, the country round here is far more undulating than the other parts of France that I have seen.\n\nThe whole of our Divisional Transport was on the move & they stretched for easily 5 miles we passed them on the way up.\n\nWe passed hundreds of German prisoners working on the roads & railways, some of them were fine looking men but the majority were miserable looking speciemens who seemed only to pleased to be safe, I saw several of them driving traction & oil engines\n\nWe reached our destination about 5 miles from Albert about 2 oclock just close to where we hopped out, we saw some enormous guns & caterpillars, & thousands upon thousands of big shells, they were every where, in the trucks, on the ground in fact\n\nwherever you looked.\n\nFrom here we had to pick up our packs to walk, & by Jove it was a snorter we were bound for Fricourt 9 miles away & to me it seemed one of the hardest marches as ever I have done, we had had no tucker since breakfast so you can guess how we felt, & we were a very straggling tired lot that eventually pulled up at some long low huts where we are spending the night 75 men to a hut, we can hear the guns booming away & the horizon is lit up with the flash of the guns.\n\nAs we came in tonight I counted 27 balloons all in a line & any amount of aeroplanes, one I saw was a brand new design & was double engined she was one of our fast planes 120 miles per hour.\n\nThere is a canteen here on the spot & Charlie Tonkin, Len & I are going to\n\nhave a feed of fruit biscuits & etc tonight.\n","20":" We moved off this morning at 10 oclock on an empty stomach for the rations did not turn up till after breakfast, the roads were in an awful state imagine if you can water slush & mud over your ankles & in places to your knees & us pushing our way through it dodging motor cars, motor wagons caterpillars, guns of all descriptions & size from the giant 16 inch down to the 18 pounders, & talk about horse transport well there were thousands of them carrying ammunition, hay, biscuits & bully, clothing, timber & etc. all going for their lives, & every now & then a lorry load of wounded would pass by us on their way to the hospitals most of them looked rather pleased with themselves for they would stand\n\na good chance of going to Blighty\"\n\nIt was one of the most wearisome marches as ever I have been on, for we held up every few hundred yards by the heavy traffic.\n\nAt last we got on to the \"Bazentin Road which carried us nearly to \"Delville Wood\" the place which cost so many men & of all the sloppy dirty walks as ever I have been on well this one takes the bun, it was neither mud nor water but it was about the same thickness as cream, & as we went along we got covered with white mud from head to foot, talk about a mess we were in you would scarcely have known us, especially some of the boys who came \"gutsers\" & fell in the rotten stuff, well we reached our destination at last just back\n\nof \"Mametz Wood\" which is still full of German & British dead, the ground round here is just a Labrinth\" trenches everywhere you look, the Tommies had a pretty tough job to drive them out of here I’ll bet.\n\nYou should see the joint where I am writing this in, 3 hours ago there was mud 8 inches deep where my bed is, but having no dugout I set to work & scraped the rotten mud off drove some stakes in & stretched my waterproof over it, I then collected what bags I could find & put them down, there are hundreds of us sleeping in the same sort of joints for they have some room only for a few hundred men of each Batt. & they are crowded in little canvas lean to’s, we are in reserve here about 5 \n\nmiles behind the firing line, & there are great guns all round us.\n\nJust opposite us the metalled road ends, & if ever I saw a bog in my life well it is here all carts are double banked when the reach here, & you should see the struggling it takes to get through it, there is no water among this mud, just pure sticky clay 3 feet deep, & horses get stuck in it let alone wagons, our boys were helping fallen down horses up tonight it is impossible to describe it for it is a regular glue pot. I saw tonight one of our little machine gun carts which is drawn by 3 men stuck, & 2 horses & about 20 men had to drag it out, & the traffic never ceases there is one perpetual string of vehicles day & night\n\nAbout 200 yards from us there are great watering troughs, & of an evening it is the sight of a lifetime to see the never ending strings of horses & mules going to & from the water they reckon there are 12,000 horses or mules in this valley & I believe it. I pity the poor horses for they are bogged nearly half their time & they are covered with mud from head to foot, in this rotten rainy weather they look very miserable & they have to work very hard, toiling & struggling all the day long dragging shells, water, tucker & etc for the needs of the thousands of men who are engaged in this gigantic battle the guns never stop firing, & just at the rear of us there are some enormous guns & when they fire they fairly shake the hills. Trains are running everywhere up here they are building the line as they advance.\n","21":" \"Oh what a night we had never a wink of sleep, & nearly frozen to death & it rained like blue blazes, so when we crawled out this morning we were wet to the skin & aching all over, a more miserable looking lot of men you never saw, for the rain beat in on us all the night & the roofs of our waterproofs leaked & our overcoats sucked up the cold moisture from the ground, it’s a wonder to me how on earth men stand it for the conditions are awful at present & show no signs of bettering for the rain is still pouring down & we are like blocks of ice, some of the chaps are lucky Len among them for they have decent dugouts. I have about 18 in. square of dry place where I am writing this, my blanket is sopping wet my overcoat ditto & my feet & hands are almost beyond feeling & I have to do a bit of manouvering to\n\nkeep the water off this book, oh I can tell you I am writing under difficulties.\n\nLast night the 3rd Batt.s band was playing they had a great fire going\n\nNothing but fatigues this morning, drawing ammunition, steel helmets, gas helmets, rations, & various other things.\n\nI have seen quite a number of the 53rd round here including a few of the old hands who joined it when the Batts were broken up at \"Tel-el-Kebir,\" nearly the whole of the Australian Force is here & there is going to be something doing next time we hop over. Saw no less than 46 aeroplanes up Although we are but 5 ½ miles from the firing line, the place at night time looks more like some big town with its thousands of lights & fires, it beats me as how the Germans don’t shell the place to pieces for there is nothing to stop them\n\nfrom running a balloon up at night & they can see our lights & fires for miles.\n","22":" Still alive & kicking had a little better rest last night for it ceased raining about 6, our chaps bombarded something terrific all night it was one constant roar & rattle, old Fritz poked a few over among us, & one 9.2 lobbed about 15 yards to the left of our little shanty throwing dirt & mud all over us, it was wonderful no one was hurt for it did not lob more than 3 yards from where the 2nd Batt. Bombers were sleeping with only waterproofs over their heads, talk about narrow shaves.\n\nYesterday evening everyone was issued with their steel helmets & gas bags for we are supposed to be ready to move off at an hours notice for the firing line.\n\nWhen I got up this morning a most \n\npeculiar thing happened me. I had only walked a few yards, & a sickly dizzy sensation came over me, & I nearly fainted I could scarcely stand up & staggered to some packs & sat down, it lasted about 5 minutes & then went off I fancy it was the extreme cold that affected me Biscuits instead of bread issued this morning along with jam, butter & cheese\n\nSome Australian artillery is going through here today mostly field guns.\n\nThe weather looks as if it has taken up at last, the blue sky can be seen & the sun is shining, once the ground hardens there will be something doing for the country simply swarms with troops the 5th Div have had their charge cancelled twice now through the weather 300 Germans gave themselves up last night, they were starving & had had no\n\nfood for 3 days, they can’t get through our shell fire it is too severe.\n\nAbout 200 tons of coal have gone past here towards the firing line today, the railways are very busy getting munitions & etc to the guns & men.\n\nI notice we are using a lot of old Fritz’s little wicker baskets to pack our shells to the guns in, they go by mule pack each mule carrying 8 18 lb shells, it is the only way they have a chance of getting it to some of the guns during the wet weather even then the mules have a struggle to get through the vile sticky stuff\n\nThose 2 chaps who were sentenced by Court Marshal to 15 & 2 years gaol are still with us & I believe they have to go in the trenches & do their bit, that’s what they want for a certain class only get into trouble so as they will get clinked & \n\nwont go to the trenches, they are kept under guard the whole time & are allowed no liberty what gutsers\" they have come\n\nThere are a lot of German graves round here, which they buried themselves before the offensive, they have the names, regiments & all on the crosse’s which are blue or a large majority of them are.\n\nWe have a lot of aeroplanes up this evening & the Germans are shooting like fury at them following them everywhere with their guns Len handed Capt McKenzie the money we have on hand today, to keep until after the scrap is over, & if neither of us live to claim it he is going to send it home.\n","23":" The whole Coy. was out on fatigue last night, we had to march for 2 miles through sticky clay in which you sank to your boottops at every step, & if you did not have good laces in them you would\n\nleave them to rot in the clay, the whole country for miles around is just one great quagmire of glue pot clay.\n\nArrived at our destination which was a great dump on the railway line where everything is unloaded for the Armys need Here is to be seen a narrow gauge German line & dozens of ruined trucks which our artillery have destroyed, how on earth the Germans don’t shell this dump gets me for at night time it resembles a busy town with its hundreds of bright lights, trains whistling motors too-tooing, men shouting, the creaking of the heavily laden transports & the rumble of the slow & ponderous caterpillar\" as it hauls some gun along the crowded road or pulls a motor out of the bog, they are splendid are these great caterpillars\" they will go almost anywhere & very rarely get bogged for they have no wheels on the\n\nground only a great endless chain of grips about 2 ft 6 wide these revolve round 2 big cog wheels inside & so draw the engine along.\n\nWhen we pulled up we found we had to wait from 6 to 9 before the trucks containing the sleepers which we were to unload would arrive, so the boys started singing one Coy. against the other & in this way we passed the time away, but we had a terrible job to keep ourselves from freezing for it was frightfully cold & the wind cut like a knife.\n\nWe got to work about 9 each Coy had 2 trucks to unload, & the sleepers had to be carried 600 yards up a rotten mucky road 2 men to a sleeper, it took us till 1 oclock to move these sleepers something like 2000 they are being used for making corduroy roads for the winter, a lot of the boys done a good bit of poling on their mates, this\n\nwas real bullocking work carrying these sleepers, but officers & all took a hand in it When we finished we came home by the railway line which has just been newly built & I got a lovely buster slipped on one of the slippery sleepers & down I come fair & square I got a nasty bruise or two out of it, of course I did not say anything,\" oh no, we reached our miserable home about 2 oclock & the cooks had hot tea waiting & an issue of rum, & we badly needed a hot drink for we were nearly all dead beat for we had had a strenous night. Woke up this morning chilled to the bone & shivering like a leaf one of the coldest & raw winds imaginable was blowing straight in on us, & I for one did not give a hang what happened I felt that miserable it is nearly impossible for us Australians to keep warm in this weather & we sleep with all our clothes on, in fact we dress to go to bed &\n\nthen we nearly perish, I don’t think we have much of a chance of standing the winter here & I for one have no wish to sample it, all the boys look very miserable & drawn up, all we talk about is the good old sunny days of Australia the finest place in the world oh how we all look forward to our returning to her never more to roam I’ll bet.\n\nI got a few backsheesh shirts & underpants for my platoon this morning & they are badly needed by the boy’s\n\nOld Fritz dropped 10 big shells just about where we are billeted last night & 9 out of them were duds, the soft ground is responsible for this I reckon, one of them knocked a dugout in but luckily no-one was hurt.\n\nThis morning Len & Lieut Lee went away to the Field Cashiers\" on business, they got horses from the Transport\" & rode in\n\nThrough all this bad weather the \"charges\" have been put off, & they may not take place now till next Spring, yesterday morning the Germans attempted to take a position off us they got half way across & then they got stuck in the mud, & the boys killed everyone of them, so that ought to be a lesson to us. Big mail in tonight I got 2 parcels out of it one from Aunt Carrie & one from Miss Duke they both came at a very opportune time the socks & knee pads especially will be handy Tonight I get my third promotion I am a Sergeant tonight, pretty rapid you know. We have just had a rifle inspection the first one for some time\n","24":" Was flooded completely out last night by a heavy rain storm just as darkness was setting in, \"what Bon,\" so some of the boys made room for me crowded as they were in their miserable dugout, & lit a fire\n\nat which I dried myself & clothes for everything I possessed was sopping wet \"oh a soldiers life is a beauty in such weather but as soon as we get back into dry billets we forget all the hardships, its wonderful in what good spirits the boy’s keep, they laugh & joke over it all, as if it was the fun of the world, there are a few going to hospital the extreme cold & exposure affecting the weaker ones, my feet is what gives me the most trouble I simply cannot keep them warm, & we all know if your feet are cold the rest of your body is likewise There is a little sunshine this morning, it looks as if it has a mind to clear up, but the wind don’t mention it, it chills us to the bone, if it would only drop things would not be so bad\n\nHad a rather short ration of bread this morning 7 to a loaf, so biscuits were introduced\n\nto make it up, the food take it all round is not so bad considering the difficulties that have to be overcome before reaching us. This morning our planes brought a Taube a beautiful buster \nthis morning\n a pretty hope they have got of scouting round here the air is lousy with our plane’s.\n\nOld Fritz made another attack last night but it was squashed like a rotten tomato.\n\nLen received 2 parcels last night from his English friends nearly all cakes & etc.\n\nThis afternoon I made out a \"Nominal Roll\" of our Platoon, & all N. C. O’s.\" have to have one in case of accidents.\n\nAll our Brigade are being issued with yellow patches for their backs today or tomorrow, sure sign of a hop over.\n","25":" About midnight I was woken up by one of our Sergts. to come down to the officers dugout & get instructions for to-\n\nmorrow mornings move, all the platoon Sergts were there, the orders were that we were to move off at 8 in the morning taking our overcoat waterproof & blanket with us & leaving our pack behind.\n\nAfter getting our Orders we went back to bed & reveille was at 6, I had no time to lose for I had to slip round to wake up the boys for they were sleeping far apart, draw the rations bombs, sandbags, & etc to see that they were issued, & then I had to get my breakfast & pack up as soon as I could, the morning was very threatening & cold as blazes,\" so things were not too pleasant, after breakfast we fell in\" & each platoon detailed some men off to clean up the possies before moving off. I left some letters & my diaries with Jack Hayes & instructions what to do with them in case the worst happen’s, the march up to here where I am writing this in \"Delville Wood\"\n\nwas a most miserable affair for it rained heavily the whole time other roads don’t mention them, we passed scores of big guns on the way up all covered up with tarpaulins ready for action whenever wanted, & piles of great shells laying all around them, these shells for the big guns are generally placed on slides side by side in a row, for they are too heavy to juggle about easily, & on the slides they can roll them right up to the guns, in some places the 6 inchers were almost wheel to wheel.\n\nWe reached \"Delville Wood\" after a couple of hours marching & here we are camping out in the open among the great shell holes & fallen timber, we have got a lot of fires going, & at the present it has ceased raining, but we are all wet to the skin, this is the place where the S. African Brigade fought so well & were pretty well wiped out, she is nothing but a vast cemetery & has been turned over & over by the Germans & \n\nBritish bombardments broken gun emplacements are everywhere to be seen & the remains of trenches & dugouts that have been wrecked, & timber is lying all over the joint. (I had to knock off at this point for the Germans started to drop heavy shell all round us, & we had to move our men further down the wood), on the way down we passed some enomorous guns they were firing away & when we passed in front of them the report nearly lifted us off the ground one of them \"was named \"Busty\" it was chalked up in big letters on his barrel, the country simply swarms with guns wherever you look you will see them, standing out in the open no attempt whatever being made for concealment, I watched them firing some 380 lb shells they have a small lift attached to the gun, & they roll the shell on to this then hoist it up & swing it in close to the guns barrel, it is then pushed home the \n\ncharge of cordite rammed in, the great breech block closes, & then fix the lanyard on, by this time the gun has been sighted & laid & the gunner takes a final squint & pulls his sight apparatus off the barrel, for the tremendous shock of the discharge would break the delicate instrument, at a signal all the gun crew put their fingers in their ears & off she goes, she jumps back like a two year old & you can watch the shell as it tears along through the air quite plainly, looks as big as a cricket ball at close quarters, they fairly roar as they shoot along, almost before the gun has hit the ground, the Tommy gunners have got hold of her, thrown open the breech, & the smoke is blown out & the same performance is repeated, it takes about 4 mins roughly to fire a round from these big gun’s.\n\nAbout 4 oclock we moved off for the firing\n\nline, & had to squeeze our way up with the 6th Batt. They were on the move at the same time We reached our destination after wading through acres of mud & rivers of water, we had to go into an old trench half full of water & these are our quarters for the present.\n","26":" Last night a company of the 5th Batt got lost & ended up by stopping for the night in my queen of a trench, where we are camped is right opposite Flers, & this morning Len & a few more went over & after rummaging round brought back some carrots potatoes turnips & etc. they got them out of the gardens in her, for you know before the British offensive people lived in her but now she is smashed to pieces.\n\nThis morning the Capt & I went to the firing line & on the way up we passed 3 big \"Tanks\" that had been put out of action by shells, I was very anxious to see one of these famous\n\nmachines, after all I had heard & read about them, they are a most peculiar shape something like an egg only the angles are more acute, something after this style the little strokes are where the machine guns or 6 lbs are placed, the whole concern \nlikes\n lies flat on the ground & is moved along caterpillar fashion for it is almost covered with an endless chain of grips & these are driven by motors inside the machine, they are ponderous affairs & nothing but a direct hit from a shell would stop them for they are all steel, a proper land \"Dreadnought\" inside one of them was the charred remains of 2 men, it looked to me as if the shell had set the petrol tank alight & they had been burnt to death, from a distance a \"Tank\" looks somewhat like a threshing machine with the wheels off. We passed any amount of dead men on the way up both ours & German, these were all killed in the last charge when Flers was taken\n\nWe had to run the gauntlet in one place for about 200 yds, for we were quite exposed to the Germans but they never shot at us, we then went through a shallow trench to the firing line, & here we had a look at a job we had to do this afternoon, I can’t make old Fritz out although he can see hundreds of our men quite close to him he never shoots at them, they work all day long right under his nose & real close to him, I think he is frightened of giving himself away for at the present time he is hiding anywhere & never discloses his presence from fear of our guns which never stop night or day. The Colonel was up there also & we had a short yarn with him & then came back, & had dinner such as it was a piece of dry bread & water yes & I thought I was lucky to have it one can’t be too particular these times if ever I get back Ill be able to sleep out in the yard anywhere & in all weathers & live on\n\nthe smell of \nof\n an oily rag.\n\nWell we went up this afternoon I took 24 men with me, & we got sopping soaking wet, we only worked about an hour & down she come by the time we reached our dugouts\" & by the way we felt so disgusted & miserable that we walked over the top & in full view of the Hun guns for nearly a mile, did not care if we stopped one or not, arrived at our dugouts expecting to find them fairly dry but no we found about 2 ft of water in it & half the dugouts fallen in & us wet to the skin & nothing dry to change into, all our blankets & overcoats sopping a pretty state of affairs, & you may not believe it judging by the writing & the book but I am at this present moment cold as ice wet to the skin, & no dry clothes, & as hungry as a hawk enough to kill any man & nearly every Australian is in the same mess to-night \nof\n on this famous \"Somme\"\n\nYou can see quite plainly the tall spires of Bapaume from here it is Englands objective & it does not look very far away, but it means the same to Germany as Verdun to France & they will fight to the last to retain it, on either sides & to the rear of her there looks to be fairly heavy patches of wood & one fairly long ridge to climb, this I expect is where they will offer a desperate resistance, the ground for miles around is nothing but a mass of shell holes it looks from a distance like a well fallowed paddock the result of the thousands, yes & millions of shells that have been poured on to it\n","27":" Never had a wink of sleep all last night just laid there & nearly froze to death in my wet & sopping clothes \"Oh what a night.\" \n\nThis morning I took another party of 28 men up to \"Flare Alley\" to work on the trench there, I know you won’t believe me when I say that the mud there is up to your hips\n\n& men have to go backwards & forwards all day long through this awful stuff, a couple of trips through it & you are nearly knocked out for it is terrible hard work pulling yourself through the sticky clay, the 6th Bn are in an awful place nearly up to your arm pits & still men stick it, but if it is bad for us what must it be like for Fritz for he has 10 times the amount of shell fire to contend with than us, 6 of them gave themselves up last night, they could not stand it any longer.\n\nIt has turned out rather a nice day, & this evening the sky is thick with shells aeroplanes & balloons, they brought one of ours down by shell fire & we shot one of theirs down so honors are even but we have 20 times as many up as Fritz We are moving into the firing line tonight & just at present they are shelling our Hqts \n\nlike blazes & they have hit a few I know.\n","28":" Wet again today Im hanged if we can get 2 fine days in succession. Had a big party out last night in \"Nomans Land\" digging trenches out towards the Germans, my wasn’t it cold just freezing we had no casualties but a lot of narrow escapes from the German shell fire.\n\nI brought the party in at 5 & went down & drew our rations which now includes daily a fair tot of rum per man, the men seem to think they are better for it but I don’t think they are any warmer than I am & I never touch the stuff.\n\nHad an unexpected visit from G. Vaughan this morning he has got a commission & has had it nearly 3 months, I’m glad to see him with a star\" for he is quite a good sort is George.\n\nA German plane brought one of ours down\n\nthis morning followed him right to the ground it was not a bad fight & the old German deserved his win.\n\nEarly this morning Dave Murray & I went fossicking about round towards the old wrecked \"Tanks\" from there we went over to \"Guedecourt,\" & I think I saw the most dead men both British & German that I have seen in France the ground is just littered with dead men & horses, arms legs, heads & etc lying all over the place, the worst place is just on the edge of the village they must have had some machine guns hidden there & they caught the men as they rushed out of the trench & over the road, however the place is a shambles & stinks something awful, so we beat a hasty retreat which was just as well for us for a few minutes after we had got away from it they started to shell it heavily with 5.9s We have given them a terrific bombardment\n\nthis afternoon nearly every gun must have been in action & the vibration was very pronounced, Fritz showed his good sense & kept fairly quiet while it was on.\n\n9 Boches gave themselves up last night, as one of them was passing us he pointed to one of the patches on our backs & said \"No Bon,\" he knew what the patches were meant for.\n\nA little while ago I unearthed a good store of Fritz’s iron rations, & we had a good feed off them his tinned meat is something like brawn to taste, & is very good.\n\nIt is cruel to see the state some of the men are in, they have to wade through mud right up to their arm pits, & in this awful state they have to stop for it will be several days yet before we are relieved its enough to kill any man, it would not be so bad if we had dry dugouts to go to or had a change of clothing, but no, neither of these are to be had.\n\nHave been bad all day & night with diarohhea & pretty crook too, I fancy it must have been the water which I got from the shell holes, for we have had no other for several day’s now, you have no idea of the difficulty of transport here horses & mules struggle along up to their withers in mud it is something awful & it never seems to stop raining.\n","29":" Last night we were withdrawn from the firing line the","30":" & 4th Bn. relieving us & the 2nd. talk about a weary march to our present dugouts, mud 3 ft deep & water water everywhere as tired as could possibly be & a pretty heavy load to carry, besides our guide got lost & walked us round in a circle, & when at last we struck our trench we were about finished for the men were dead beat, the next thing was to get my men in to shelter\n\nfor there was the same of tale of insufficient shelter, however after a lot of arguing swearing, persuading, & bounce I got them all under shelter of some sort or other, that is one thing a Serg. has to do look after his men before himself, he is judged a lot by that during the night it rained & I got wet again as per usual in fact I have never been dry since leaving Fricourt Camp some time ago & yet I have not a cold, though nearly ½ the Coy. are crook, my feet suffer most for I have a very bad pair of boots & have no chance of getting another just yet awhile unless of course \nI go\n out & kill a Hun or two which is not very likely, though I might have a chance tomorrow morning for our Batt. is going over early in the morning we are chosen for this attack again speaks well for a Batt. dosn’t it. one Bn each Bde I hear is hopping it.\n\nHad a fairly liberal issue of rations this morning & we want them badly too we also had 14 pair of clean socks per platoon not enough but better than none at all I suppose This morning Len & I received a fair batch of letters they cheer one up considerably when things are miserable. Aunt Carrie especially is a very cheerful writer & I must say all Aunties have acted tip top to Len & I for they all write regularly & send lots of parcel’s, while I am afraid they do not hear too often from us, of course we have not the inclination nor time for letter writing & I’m sure they understand that part of the business.\n\nThis book is nearly in pieces for it has had a very rough time & has been knocked about all over the place but so long as it hangs together till it gets home that’s all I care for it can be recopied again.\n\nWhen we move out of here tonight we are leaving our blankets & overcoats behind which is just as well for they are both as wet as can be.\n\nThe sun is shining nicely this evening for a while & the stars come out quite thick but when morning breaks it is gloomy looking & raining cats & dogs.\n\nThere were dozens of air fights this evening but I only saw one machine brought down & she was a Taube.\n\nOld Fritz had a few balloons up & the consequence was he shelled our reserve trenches pretty heavily with 5.9’s & shrapnel but he only wounded 2 men for all his shell’s & strafing.\n\nTo-night I watched the Germans searching for some of our 18 pounders who were firing like blazes on his trenches they put shells all round them, but still\n\nthe cheeky little field guns kept plugging away, I was expecting every minute to see the gun & its crew go flying sky high, but no, I’m hanged if he could hit it & the battery was still firing when he knocked off. Had a shave this evening, first one for 10 day’s & I wanted it bad enough as you may guess, but everything has been against a man lately & we have been so miserable & wet, however I borrowed an article here & there & scraped my face clean again for a man might just as well be killed clean as dirty.\n\nSent a fatigue over to Flers village where our Hqrs are, to draw 48 hours iron rations this in preparation for the charge. Had a fairly liberal issue of rations this evening, bread, jam, butter cheese, bully, milk, bacon, raisins, pork & beans, tobacco & matches, one of the best for some time\n\n3rd. Well we did not go to the trenches after all last night, but I think we shall be after the Huns early tomorrow morning, it did not rain last night only a very heavy dew & by Jove it was cold none of us got hardly a wink of sleep our feet trouble us so, where I have been sleeping since we came into these trenches is a little nook cut out of the wet ground & it is about 3 ft wide & 4 long, on this ledge 3 of us doss, with our legs hanging out in the cold wet trench, so you can imagine what a rosy time we are having but still there is no grumbling all take it in good spirit, although it is a soldier’s privilege to growl, & at times some of them exercise their right to the utmost, we have had a good fire going all the morning we go over into Flers village whenever we want wood there is plenty of it there, the remains of the houses & etc.\n\nThe 1st Pioneer Battalion have been working on the trench we are in for the last couple of day’s it is the remains of an old German trench & they are strengthening it in case of having to fall back on it.\n\nThey put some big shells dangerously close to us this morning, one just seemed to miss my head & landed a few yards off me throwing earth & muck all over me, but still no damage done to life or limb\n\nEverything very active this morning guns, shells aeroplanes, balloons are everywhere to be seen & you can hardly hear yourself talking.\n\nJust close to where we are camped there are 6 big crosse’s erected to the memory of 72 men & 4 officers who are buried just here, 12 men to a grave they belonged to the 21st K.R. Rifles (Yeoman Rifles), they got cut about properly & all were killed on the","31":"\n\nThis evening we were shelled very heavily\n\n& I had another very narrow escape, in fact got knocked flying head over heel’s, it lobbed about 3 yards from me on the side of the trench a few men were hit a few seriously\n\nGot issued with our sheepskin vests tonight they came at a very opportune time for the nights are very very cold.\n\nHeavy artillery duels all the afternoon our guns have been powering away like mad. Have been pretty crook ever since the concussion from the shell, she shook me up pretty badly & made me real sick & a crook headache\n\n4th. By Jove I was crook last night & for several hour’s a sort of colicky pains used to run through my stomach & nearly double me up I think it must have been the effects of the concussion, or the water from the shell craters this is the only water we have to drink, & I think there is something left in the crater from the explosion of the shell.\n\nOne of our chaps went over to Flers early this morning & got a great bundle of dry wood, with this he made a great fire opposite my dugout, we then got a can of petrol water & put it on the fire, & soon she was boiling merrily & didn’t we enjoy the tea, you have no idea how we miss our tea it means a lot to us I can tell you.\n\nLast night nearly the whole of the Batt. were out digging a new communication trench to bring our wounded down on stretchers (\"White Flare Alley\") so called on account of the white chalky soil it passes through, it will be completed tonight & will be a mile in length 3 ft wide & 5 ft deep that’s good going you know.\n\nI have been very busy all the afternoon issuing sand bags, bombs, 303, flares, getting the picks & shovels together, & tins of reserve water, for tonight we are going to attack a very strong German position & everyone has to carry something or other.\n\nI finished everything just about dusk & then the following day’s rations came unexpectedly to hand, it was impossible for each man was to carry his ration with him so I issued them in bulk along the trench & all hands sailed into them & had a great blow out for once.\n\nMr Lancer came back just before we moved off he was dead stiff & had to come with us During the afternoon all the N. C. O’s & officers talked over tonights attack.\n\nWe moved off at 7 oclock sharp in single file the pace was very slow for all were heavily loaded & the ground was sticky & muddy as could be we took our time for we only had about 3 miles to go, & we had to be in position by 11 oclock We took the long way to White Alley trench, it was not bad going till we branched off into \"Grass Lane\" it is \n\ncalled Grass Lane\" out of pure Sarcasm for it is a sunken road & is covered with 3 to 4 ft of slimy sticky white mud \"oh it is something awful, one experience of this Somme\" is enough for a lifetime for we have all like Napoleon discovered another element mud, it is so bad that often & often without a word of a lie a man gets bogged & the clay is so tenacious that it takes 3 men to pull him out, & then again you will come to another place where do what you will it is impossible to stand on your feet, & over you go fair on your side or the broad of your back in the frightful stuff, these sort of busters are so common now amongst us that we don’t even swear, just take it as a matter of course, we are constantly wet through to the skin & our clothes absolutely covered with mud, these are the conditions under which the great Somme\" offensive is\n\nbeing carried out day by day cruelty to human beings I reckon, they feed us as well as they can but we are always tired for a mile in this mud is worse than 5 on a hard road but still the game proceed’s & the men toil on unceasingly The position we are taking up for our attack was well out in \"No mans Land\" & we had to go over the open to it, now this is pretty ticklish work with a mob especially when you are trying to get the men there without the enemy knowing it for they are constantly sending up flares, & when these go up the men have to stand perfectly still, for the slightest movement gives the whole show away & over comes the machine guns & shells, & then finish.\"\n\nWell after a lot of manouvering we got them into position, 9 & 10 platoons were in the trench while 11 or 12 were laying out at the back of it about 2 yards away for both sets of platoons moved practically together\n\nWe were in position about 9’oclock & shortly after Capt. Jackson brought some of B. Coy. along & put them at the rear of us again, they were our supports for this attack was being carried out by C. & D. Coy so far so good, but the men began to get restless & some of B. Coy. started to sit up & just then the Huns put a big bright flare up & evidently spotted the steel hats he immediately sent 2 or 3 more big flares in rapid succession, & satisfied himself that troops were there, it was not many minutes before the shells started to fly around but happily for us he mistook the wrong trench we were hiding in & all the 5.9’s lobbed harmlessly over our head’s which was just as well for us, for we would have been murdered in cold blood, slowly the hours dragged by for we were cold & miserable laying on the wet ground, but the Knock out was to come \n\nabout an hour before the hop over, it come in the shape of a blinding storm of rain which soaked us through & through & nearly washed us away \"oh what bon\" we all felt as happy as the boy that killed his father, but we had to lay there & take it like Britons, the sheep skin vests came in very handy here for they kept our bodies fairly dry & warm but the rest of us was as cold as ice, the Heads made a great mistake at this point for they should have postponed the attack for the ground wouldn’t carry a cat let alone a man with a load up, however we were to find this out afterwards to our sorrow About 11.30 Fritz became very suspicious & kept on sending flares over towards us & at last he was satisfied that there was something dirty doing, & up went his artillery & S.O.S. flares when I saw these go up I said to mate who was lying alongside me that the game was up & \n\nthat we might just as well go over at once or go back to our trench for we were discovered & once the element of surprise is lost in a case like ours well things are bound to be very warm & willing, he kept on sending up his artillery flares they are something like a Catherine Wheel only much larger & more powerful & are of a dark red to pink color & we still had ½ an hour to go before our guns put the barrage on his trench, at about 15 min’s to go over came his shells & they fell all round us, & he opened fire on us with machine guns & rifles all along the line\n\nAbout 10 mins to go we got the order to fix bayonets & get ready. I had no officer with my platoon so I was in charge of it & had to act the part of the officer, the fire at this point was getting very hot & all knew that we would have our work cut out for Fritz was waiting for us as we were soon to find\n\nout to our bitter cost.\n","32":" A couple of minutes to go & all were straining at the leash, the moon had almost gone down & there was a faint ghostly light over all save when the flares lit every-thing up in a white shimmering light & the ground could be seen to be all watery & shiny all of a sudden the strain was over, & so were we, I was the first one of my platoon (as I should be) to hop over & I gave a few more a helping hand for the sides of the trench were steep & slippery & off we rushed, as soon as we showed up the flares were sent up in batches which lit everything up like day, & showed us men falling everywhere & the boys struggling through the mud bogged nearly to the knees for the ground was as soft as a well fallowed paddock after a storm of rain, I was forcing my way through as fast as I could & calling for my men to keep up \"& box on\"\n\nJust before we reached the German wire (which was not smashed at all for the artillery fire which was supporting us was shocking about 20 shells & it was over, a \"barrage\" they had the heck to call it) I got a terrible buster fell fair into a big shell hole full of mud a nice state I was in to be sure but I scrambled out as soon as I could & made a rush for the wire having no wire cutters I had to force my way through as best I could & the consequence was that I got badly cut all over & ended up by getting hung up in the stuff for all the world like a sack of wood chucked on to a heap of barb wire, but I felt nothing at the time for my blood was running hot & we only thought of getting in their trench, the fighting by this time was very fierce, shells, bombs, mortars, & worse than all liquid fire bombs were falling amongst us like hail, they used\n\nto go off with a terrific bang nearly stunning one with the concussion & splashing one all over with this burning scorching liquid it was awful, one poor chap I saw struggling on the ground with his clothes & equipment alight he was rolling over & over in his agony I ran over & threw wet mud all over him that put it out, shortly after this I had one of the most thrilling minutes of my life for I was rushing as fast as the wet & slippery ground would allow me down a shallow trench towards the German parapet where I could see their \"trench mortars\" & bomber’s in action when I was about 7 yards off them or so a Hun rushed out at me & made a desperate lunge at my body, I must have parried quick as lightning, & more by luck than anything else I was in time & his bayonet slid down my rifle & stuck in the fleshy part of my leg, went\n\nstraight through my puttee & thick trousers, my\" didn’t it sting I thought it was right through my leg, for a sharp stinging pain went through my body & it was with difficulty that I kept from yelling out, but kept my block & before he could draw his rifle back for another attempt I shot him dead & he fell at my feet, quick as I could I let fly two more bullets at the bomber’s & I’m certain that I got another one for I saw him fall down among his mates & they at once scattered I don’t know how my third shot got on for he was on the move, all this happened in a few minutes or I should say seconds I could hardly define the feeling’s that ran through me when I butted like this into them, first of all the blood ran to my head & I saw nothing all seemed blank, then like a flash of lightning my\n\nsense’s returned, & I was cool, calm, & collected, or I should not be alive tonight, the next feeling was one of cold anger & I felt fit for anything & regained my normal feelings, at this point I never felt the pain in my leg at all, I saw at a glance that I had no chance of getting through for the bombs were falling pretty thickly so I retreated a few yards & took stock of things, what a sight met ones eyes for practically all the boy’s were killed or wounded with their faces towards the Huns \"poor devil’s\" & all the wounded who could walk, were making their way painfully towards our own trench, Good God our first attack had failed & when I realised this I felt quite faint & sick, the Huns were still firing & bombing like mad the incessant chatter of the machine guns were making a fine row & over all the \n\nheavy howitzers were falling fast scattering death & destruction everywhere. I crawled out towards their barb wire & slipped into a shell hole & tried to bandage my wound I was covered with mud from head to foot & a fair bit of blood was coming away from me, in a few minutes time the remnants had rallied & Capt. Jackson was leading them out he walked as calmly & as cooly among the bullets as if he were on parade & called on the men to follow him for the honour of the Battalion they responded nobly but what could men do in such boggy ground & against such overwhelming numbers, it is a fact that wounded men have been trying to get out from the firing line & have been found with just their head & shoulders out & a ticket round their necks, dead as a door nail, too weak to struggle\n\nout & there they have perished miserably \"poor devils,\" but I am rambling & must get back to where I left off, the remnants of the Batt. charged gamely but we had not the ghost of a chance for the machine guns mowed us down in rows, I could have cried with disappointment & rage when we got the order to get back to our own trenches it was the first time we ever had to acknowledge defeat & I can tell you it hurt some, I can quite understand how a beaten army feels after this affair, the worst of it all was that in spite of the bravery displayed by the boys all our losse’s were in vain, the truth of the matter was that they underrated the strength of the position & they sent a couple of Coy. to do what it would have taken a Bde & the result was that we got cut to pieces our casualties were about\n\n75 % of the men engaged, it was the hottest engagement as ever I have been in & how I escaped is a mystery for the air was stiff with bullets they were singing past like a swarm of bee’s, my only dread in those charge’s is the fear of getting hit in the stomach, for that is the worst place of all & there is very little hope for one & you die a lingering death apart from that once I am over I don’t care so much.\n\nThe Germans were there in hundreds & you could see their heads over the parapet like a row of palings, & those of the boys who were left made pretty shooting at them Our officers suffered heavily again Lieut’s Lancer, Finlayson, McIntyre, Philips, were killed & Mallarkey, Steels & a few more are missing, while nearly all the remainder were wounded. Len’s officer\n\nwas wounded so he had to carry on like myself & act on his own.\n\nWe got all the wounded in I think & the remainder of the Battalion rallied together in an old trench half full of mud, I had a great weight lifted off my mind when I heard that Len was safe it is simply marvellous how we live through it. I saw him once right down on the German parapet rallying his men & bombs & bullets were like hailstones\n\nFrom here we made off back to our own trenches nearly 3 miles away for the attack had failed & we were a sorry looking lot as we slowly ploughed our way through the mud now knee deep again after the heavy downpour I was about the last man of the C. Coy home for my leg was very painful & I was absolutely done scarce move one leg after the other so done up was I, & cold & miserable don’t mention it.\n\nI threw myself down in the cold dug out miserable & wet, & soon I was fast asleep, woke up about 10 & I had to make out a list of all those of the platoon who were killed wounded & missing they amounted to a little more than ½ my strength.\n\nAfter this I went over to Flers where our Medical Hqrs were to see the Dr about my leg he put the needle into me in case of lockjaw & bandaged it up properly I then went back to the Coy.\n\nThe same afternoon ours guns opened a terrible bombardment & a couple of brigades of Australians made a most successful attack advancing nearly a 1000 yds & capturing 3 lines of German trenches, so they made up for our bit of bad luck.\n\nOur bombers had a very hot time\n\nout of 32 engaged only 8 returned & among them was Len’s mate Young Holmes he is a fine fellow & done some very fine work in this attack.\n\nI am giving him today 4 diaries to send away for me & a bunch of letters he can be trusted if anyone can I am also going to get him to call on Mr Duke for me, he will be glad to see him.\n\nWe have been hammering the life out of them lately with our heavy guns of which we have hundreds, & talk about stacks of ammunition they are eyeopeners.\n\nWe brought a couple of Taubes down this evening they ventured too far over our lines\n","33":" Old Fritz blew a couple of our guns out today & killed their crews.\n\nWe left our present quarters this evening & are going out to reorganise for in our present state we are\n\nuseless, & what a weary walk we had nothing but mud, mud, & still more mud we arrived at the camping ground thoroughly knocked out, & to make matters worse most of the boys boots are ruined & I know the nails stuck into my feet until they bled, but still I plodded on, we will be reequipped in a few days or so for our clothes are absolutely ruined & only ½ the boys have rifles.\n","34":" One of the coldest nights I ever experienced was last night & I never had a wink of sleep, & our big guns kept up a perfect roar.\n\nAbout 11 oclock this morning we shifted out in a heavy storm of rain & we had to plough our way through many feet of slimy mud, the 9th Bn are taking our place in the line\n\nWell this is about the finish of the little book & you must take no notice of the scribble for you have no idea of the difficulties I have had to put up with in the daily scribble, wet mud, rain, cold, personal discomfort & all but still I have never failed to put my days entry into it & hope it reaches home safely It is now raining heavily by way of a change, & Holmes is almost ready to go so I must cut it short & say goodbye for a time I will send the others along as I complete them for I intend to keep it going until I either get knocked out or the war finishes, at this date both Len & I are safe & we are out behind the firing line for a few days so don’t worry \"Finish.\"\n\n"}}