{"Document Name":{"0":"Diary_0360","1":"Diary_0360","2":"Diary_0360","3":"Diary_0360","4":"Diary_0360","5":"Diary_0360","6":"Diary_0360","7":"Diary_0360","8":"Diary_0360","9":"Diary_0360","10":"Diary_0360","11":"Diary_0360","12":"Diary_0360","13":"Diary_0360","14":"Diary_0360","15":"Diary_0360","16":"Diary_0360","17":"Diary_0360","18":"Diary_0360","19":"Diary_0360","20":"Diary_0360","21":"Diary_0360","22":"Diary_0360","23":"Diary_0360","24":"Diary_0360","25":"Diary_0360","26":"Diary_0360","27":"Diary_0360","28":"Diary_0360","29":"Diary_0360","30":"Diary_0360","31":"Diary_0360","32":"Diary_0360","33":"Diary_0360","34":"Diary_0360","35":"Diary_0360","36":"Diary_0360","37":"Diary_0360","38":"Diary_0360","39":"Diary_0360","40":"Diary_0360","41":"Diary_0360","42":"Diary_0360","43":"Diary_0360","44":"Diary_0360","45":"Diary_0360","46":"Diary_0360","47":"Diary_0360","48":"Diary_0360","49":"Diary_0360","50":"Diary_0360","51":"Diary_0360","52":"Diary_0360","53":"Diary_0360","54":"Diary_0360","55":"Diary_0360","56":"Diary_0360","57":"Diary_0360","58":"Diary_0360","59":"Diary_0360","60":"Diary_0360","61":"Diary_0360","62":"Diary_0360","63":"Diary_0360","64":"Diary_0360","65":"Diary_0360","66":"Diary_0360","67":"Diary_0360","68":"Diary_0360","69":"Diary_0360","70":"Diary_0360","71":"Diary_0360","72":"Diary_0360","73":"Diary_0360","74":"Diary_0360","75":"Diary_0360","76":"Diary_0360","77":"Diary_0360","78":"Diary_0360","79":"Diary_0360","80":"Diary_0360","81":"Diary_0360","82":"Diary_0360","83":"Diary_0360","84":"Diary_0360","85":"Diary_0360","86":"Diary_0360","87":"Diary_0360","88":"Diary_0360","89":"Diary_0360","90":"Diary_0360","91":"Diary_0360","92":"Diary_0360","93":"Diary_0360","94":"Diary_0360","95":"Diary_0360","96":"Diary_0360","97":"Diary_0360","98":"Diary_0360","99":"Diary_0360","100":"Diary_0360","101":"Diary_0360","102":"Diary_0360","103":"Diary_0360","104":"Diary_0360","105":"Diary_0360","106":"Diary_0360","107":"Diary_0360","108":"Diary_0360","109":"Diary_0360","110":"Diary_0360","111":"Diary_0360","112":"Diary_0360","113":"Diary_0360","114":"Diary_0360","115":"Diary_0360","116":"Diary_0360","117":"Diary_0360","118":"Diary_0360","119":"Diary_0360","120":"Diary_0360","121":"Diary_0360","122":"Diary_0360","123":"Diary_0360","124":"Diary_0360","125":"Diary_0360","126":"Diary_0360","127":"Diary_0360","128":"Diary_0360","129":"Diary_0360","130":"Diary_0360","131":"Diary_0360","132":"Diary_0360","133":"Diary_0360","134":"Diary_0360","135":"Diary_0360","136":"Diary_0360","137":"Diary_0360","138":"Diary_0360","139":"Diary_0360","140":"Diary_0360","141":"Diary_0360","142":"Diary_0360","143":"Diary_0360","144":"Diary_0360","145":"Diary_0360","146":"Diary_0360","147":"Diary_0360","148":"Diary_0360","149":"Diary_0360","150":"Diary_0360","151":"Diary_0360","152":"Diary_0360","153":"Diary_0360","154":"Diary_0360","155":"Diary_0360","156":"Diary_0360","157":"Diary_0360","158":"Diary_0360","159":"Diary_0360","160":"Diary_0360","161":"Diary_0360","162":"Diary_0360","163":"Diary_0360","164":"Diary_0360","165":"Diary_0360","166":"Diary_0360","167":"Diary_0360","168":"Diary_0360","169":"Diary_0360","170":"Diary_0360","171":"Diary_0360","172":"Diary_0360","173":"Diary_0360","174":"Diary_0360","175":"Diary_0360","176":"Diary_0360","177":"Diary_0360","178":"Diary_0360","179":"Diary_0360","180":"Diary_0360","181":"Diary_0360","182":"Diary_0360","183":"Diary_0360","184":"Diary_0360","185":"Diary_0360","186":"Diary_0360","187":"Diary_0360","188":"Diary_0360","189":"Diary_0360","190":"Diary_0360","191":"Diary_0360","192":"Diary_0360","193":"Diary_0360","194":"Diary_0360","195":"Diary_0360","196":"Diary_0360","197":"Diary_0360","198":"Diary_0360","199":"Diary_0360","200":"Diary_0360","201":"Diary_0360","202":"Diary_0360","203":"Diary_0360"},"Date":{"0":"unknown","1":558.0,"2":559.0,"3":560.0,"4":561.0,"5":562.0,"6":563.0,"7":564.0,"8":565.0,"9":566.0,"10":567.0,"11":568.0,"12":569.0,"13":570.0,"14":571.0,"15":572.0,"16":573.0,"17":574.0,"18":575.0,"19":576.0,"20":577.0,"21":578.0,"22":582.0,"23":583.0,"24":584.0,"25":585.0,"26":586.0,"27":587.0,"28":588.0,"29":589.0,"30":590.0,"31":591.0,"32":592.0,"33":593.0,"34":594.0,"35":595.0,"36":596.0,"37":597.0,"38":598.0,"39":599.0,"40":600.0,"41":601.0,"42":602.0,"43":603.0,"44":604.0,"45":605.0,"46":606.0,"47":607.0,"48":608.0,"49":609.0,"50":610.0,"51":611.0,"52":612.0,"53":617.0,"54":618.0,"55":619.0,"56":620.0,"57":621.0,"58":622.0,"59":623.0,"60":624.0,"61":625.0,"62":626.0,"63":627.0,"64":628.0,"65":629.0,"66":630.0,"67":631.0,"68":637.0,"69":638.0,"70":639.0,"71":640.0,"72":641.0,"73":642.0,"74":643.0,"75":644.0,"76":645.0,"77":646.0,"78":647.0,"79":648.0,"80":649.0,"81":651.0,"82":652.0,"83":653.0,"84":654.0,"85":655.0,"86":656.0,"87":660.0,"88":661.0,"89":664.0,"90":665.0,"91":668.0,"92":669.0,"93":670.0,"94":671.0,"95":675.0,"96":681.0,"97":682.0,"98":685.0,"99":686.0,"100":689.0,"101":695.0,"102":696.0,"103":709.0,"104":710.0,"105":717.0,"106":718.0,"107":723.0,"108":724.0,"109":725.0,"110":731.0,"111":732.0,"112":733.0,"113":734.0,"114":735.0,"115":736.0,"116":737.0,"117":738.0,"118":739.0,"119":740.0,"120":742.0,"121":744.0,"122":745.0,"123":746.0,"124":752.0,"125":755.0,"126":756.0,"127":757.0,"128":758.0,"129":759.0,"130":760.0,"131":761.0,"132":762.0,"133":763.0,"134":764.0,"135":765.0,"136":766.0,"137":767.0,"138":773.0,"139":774.0,"140":780.0,"141":781.0,"142":782.0,"143":783.0,"144":787.0,"145":788.0,"146":789.0,"147":794.0,"148":795.0,"149":796.0,"150":797.0,"151":801.0,"152":802.0,"153":817.0,"154":819.0,"155":870.0,"156":871.0,"157":872.0,"158":873.0,"159":874.0,"160":875.0,"161":876.0,"162":877.0,"163":893.0,"164":894.0,"165":896.0,"166":899.0,"167":900.0,"168":901.0,"169":902.0,"170":903.0,"171":908.0,"172":909.0,"173":916.0,"174":917.0,"175":918.0,"176":926.0,"177":928.0,"178":930.0,"179":931.0,"180":932.0,"181":955.0,"182":956.0,"183":958.0,"184":959.0,"185":960.0,"186":961.0,"187":962.0,"188":963.0,"189":964.0,"190":965.0,"191":966.0,"192":967.0,"193":968.0,"194":969.0,"195":970.0,"196":972.0,"197":973.0,"198":974.0,"199":975.0,"200":980.0,"201":981.0,"202":982.0,"203":992.0},"Entry":{"0":"\n\nJly ","1":"\nCalm weather all day, boat is well fitted up as a transport, meals are good. Did a little drill & cleaned rifles etc.\n\nJly","2":"\nWeather rougher today, a number of men sea-sick, rounded Wilsons Promontory about 9 a.m. Boat stopped from 1 P.M. till 3.30 P.M. engine having run hot. Continued running, but about 4.30 turned round & made for Melbourne.\n\nJly","3":"\nFound ourselves at one of the Port Melbourne piers. At 11 a.m. we all went ashore & went by train to Flinders St. Station, Melbourne. Went to the Exhibition Buildings, Acquarium, Art Gallery & Museum. Returned to boat about 4 P.M. The piston rod of engine having been straightened meanwhile. Lunched at the Crystal Cafe today.\n\nJly","4":"\nWent to Church Parade at St Lukes, South Melbourne, church decorated Violet Sunday.\n\nJly","5":" \nLeft Port Melbourne at 7 a.m, passed another troopship.\n\nJly","6":"\n\nFairly calm all day. Have been suffering from Tonsolitis forthe past three days.\n\n\n\n\n\nJly","7":"\nRained most of last night & today, passed another boat. Have a beautiful cold but Tonsolitis better. Fairly rough.\n\nJly","8":"\nShowery weather, very off colour myself with a form of influenza.\n\nJly","9":"\nFine weather, overtook another boat.\n\nJly","10":" \nFine weather, passed C.Leeuwin about 4 P.M. Influenza rotten, bad head & almost deaf as well.\n\nJly","11":" \nArrived Freemantle10 a.m., had early lunch on board then went ashore, marched through the town and outskirts.\n\nJly","12":"\nWent up by train to Perth, about 12 miles, had a good lunch at Boans. In afternoon took a hurried run in a launch across the Swan river to the Zoo. Got back to boat about 5 p.m., and the day ended with a pretty rowdy time aboard, started by a couple of men the worse off for liquor.\n\nJly","13":"\nEdwards, the ring-leader of last night's disturbance wasescorted ashore & handed over to the military authorities for court-martial. Left Freemantle about 8.30 am. Still off colour.\n\nJly","14":"\nWeather unsettled & showery & searougher today.\n\nJly","15":"\n Beautiful day, drilled a bit.\n\nJly","16":" \nShowery weather, but hot & rough. Did some washing.\n\n\n\nJly","17":"\nCalm weather. Nothing doing.\n\nJly","18":"","19":"\nCalm. Church service in morning. Threw letters overboard in a bottle, one home & one to Dan.\n\nJly","20":"\n\nBeautiful weather but hot, swung our hammocks up on deck, in horse-bores. Ship fumigated for measles.\n\nJly","21":" to","22":"\n (Sunday)\nBeautifully calm weather but hot. Church today.\n","23":"\nCrossed the Line about 6 a.m. Went through the usual dipping ceremonies at the hands of Neptune.\n\nJly","24":"\nAltered course to almost north, running half pace in order to pass C. Guardafui during the daylight, on Thursday morning.\n\nJly","25":"\nFine, & a little rougher, running half speed most of the day.\n\nJly","26":"\nPassed C. Guardafui at 2p.m. Saw hundreds of porpoises.\n\nJly","27":"\nSports on board. Did not see land at all today.\n\nJly","28":"\nEntered the Red Sea 10 a.m. Saw three warships near the entrance (British), one of which fired across the bows of a Greek merchantship which quickly brought her to a standstill. Passed numerous islands including Perim. Small islands are seen for nearly 100 miles after entering the Sea.\n\nMet four boats, Sports continued on board & concert at night. Sat at bow of boat till midnight watching the phosphorescent gleams\n\n\n\ncaused by occasional porpoises and thousands of fish. Met another warship at 1 a.m.\n","29":"\n (Sunday)\nVery hot. Passed a number of boats. Did not sight land today. Church in evening.\n","30":"\nPassed a number of boats. Saw land in evening (the Great Bear).\n","31":"\nPassed Dedalas Light House about 9 a.m. and the Brothers Rocks about 5.30 p.m. Saw a number of boats. Sighted land both early in the morning and in the evening. Much cooler today.\n","32":"\nReached Suez at 3 p.m. anchored about half a mile from the Canal near a good number of steamers. The land to be seen on either side is nothing but desert. Saw Jacob's Well in the distance on the Sinai Peninsular.\n","33":" \nDisembarked from the \"Clan Macewen\" about 4 p.m. & were towed across to Suez in barges. Slept the night on one of the Suez Station Platforms. A number of Indian troops, returned from the Front also encamped near by.\n","34":"\nLeft Suez at 7.a.m for Cairo and Heliopolis, had to change trains at Ismalia \n. \nLarge numbers of Indian troops at certain points along the line. We followed the Canal as far as Ismalia \n\nmostly a succession of lakes that far. Beautiful crops\n\nof corn and cotton growing on either side of the Line between Ismalia and Cairo, irrigated from the Nile. The 6th of the 6th re-inforcements left us at Cairo for Mahdi, & we came on to Heliopolis & went into camp.\n\nAug 7th\nIn the afternoon went into Cairo by tram (6 miles) which cost only 1 Piastre\n \nequal to about 2 ½First Class. Splendidtrams, 1st, 2nd &","35":" Class compartments. Saw a train of Australian wounded arriving Heliopolis from the Dardanelles, going to the beautiful Palace Hotel which has been converted into a hospital. Had cool drinks at the Groppi& dinner at the St. James, both of which are good. Went round the chief part of the city which I very much like. The population comprises every nationality one can think of, a good per centage being French.\n","36":"\nChurch Parade in the morning. In afternoon went into Heliopolis & took photos with Bob.\n","37":"\nWent into Heliopolis, in the evening to Picture Shows & wandered round the town.\n","38":" to","39":"","40":"\nNothing exciting happened, Egyptian Feast of Bairam during this time","41":" to","42":" inst. included). Cairo was accordingly placed\n\n\n\nout of bounds. The","43":" 18th, 19th & 20th Battalions leaving tonight (15th inst. for the Front). Received news a few days ago that our regiment has been cut to pieces at the Dardanelles, & is to return to be reformed.\n","44":"\nCommenced having mounted parades in the evenings as well as the early morning parade. Went Heliopolis in evening.\n","45":" &","46":" &","47":" &","48":"\nNothing exciting happened, have had lectures on musketry in afternoons instead of mounted parades, have been on the \"Off duty\" list for the past couple of days with lumbago & a strained backcaused by a rough horse. Capp, Jones & selfwent to Cairo tonight (19th inst). Strolled round the immoral quarters to see for ourselves if all that is alleged to happen in these quarters is true, and must say these parts of the town are a disgrace to Cairo.\n","49":" &","50":"\nThe 4th Re-inforcement (fourth) to our Regiment left today (Sunday 22nd) for the Dardanelles under Lieut-Col Meredith, also some 3rd Re-inforcements which were left from the last batch who went across, & some wounded returned also. Church Parade as usual 10.15 a.m.\n","51":"\nHad a very enjoyable and educational day today. Bob Chapman &I both secured leave from 9 a.m. till 10 P.M. First of all, we went Cairo & were met by a Guide at the tram terminus. We engaged him to show us the principal Mosques. We went to the \nSultan Hassan Mosque\nto begin with. This is considered to be the Show Mosque of Egypt. On entering all mosques one has to put on slippers, &engage a guide to take one through. This mosque cost £600,000 to build, & was built first of all 600 years ago, but portions have since been restored. Napoleon bombarded this Mosque about 110 years ago, & the effect of his shells, though they did not make a very great impression on the walls, is still to be clearly seen \nas clearly to be seenas the day they were bombarded\n. The next Mosque we visited was the \nEl-Rifai \nor\n Ishmael Pasha Mosque\n. Built only 30 years ago, over an old Tomb 400 years old. This Mosque is just across the street from the Sultan Hassan Mosque. Ishmael Pasha who built this Mosque was the grand-father of the present Sultan of Egypt. This is also a very fine Mosque.\n\nNext we visited the \nMosque of Mehemet Ali\n, also known as the \nCitadel \nor \nAlabaster Mosque\n. The interior of this Mosque is magnificient, &it is the most beautiful in Cairo. The beauty of the domes & the architecture altogether of the roof inside this building \naltogether\n baffles description. The Architect who designed the inside roof of this Mosque had his eyes taken out by Mehemet Ali, in order that he would be unable to construct another such roof. This Mosque was of course built by Mehemet Ali, who was the first Khedive\n\nof Egypt. In order to obtain the throne, Mehemet Ali invited all the Mamelukes (the then reigning house of Egypt) to come to the Citadel to a feast to be given in their honour. The Mamelukes were noted as great fighters, & they came mounted on their beautiful chargers & in great array. When Mehemet Ali hadlured them all into a great square, bounded on all sides by high walls & barred wiindows, the great porticos closed behind them, &Mehemet Ali then opened fire on them from hundreds of muskets. The Mamelukes, unable to escape or defend themselves, were all slaughtered, save one EminBey\n\nwho was supposed to have taken a tremendous leap over the paraphet to the ground beneath, & though his horse was killed he got away & took shelter in the sanctuary of a mosque. This however is untrue, in reality, Emin Beywas forewarned at the last moment of what was to happen & did not attend the feast, & fled from the country. We saw the scene of the massacre, also the spot of the supposed leap of Emin Bey. In the centre of the mosque is a beautiful chandelier, a gift to Mehemet Ali from his friend Phillip XVI of France. In all there are 2000 lamps in the interior of the mosque. The floor is covered by beautiful Turkish carpets (red). The Dome in the Centre is 220 ft. high, & length inside 150ft. Most of this Mosque is built of alabaster, I purchased a sample inside. When inside the Mosque, the calls of the Doves on the minarets outside produce quite a weird sound. The Mosque itself was built only 100 years ago by slaves. The Citadel portionwas built by Saladan the Great1156 yrs ago. He obtained all the foundation stones, &stones for the walls etc. from the outer walls of the great Pyramids\n\nof Gheza. From the Citadel can be seen the Mokattan Hills, which are quite close, &from which the great stones of the Pyramids were quarried, also on these Hills is situated one of Napoleon's forts. Also can be seen the ruins of an aquaduct built by the Romans to convey water to the citadel from the Nile. The Citadel at the present time is garrisoned by British, Indian and Australian soldiers. We saw some of Napoleon's old Cannon, also a number of new British guns ready for action. The next Mosque we visited was Kherbet\n,\nor usually known as the\nBlue Mosque\n. This was built 450 years ago by Abraham Allah. The blue tiles used in its construction were brought from Italy. This mosque is not to be compared with eitherof the three foregoing ones.\n\nI forgot to mention when describing the \nCitadel \nor \nMosque\n of \nMehemet Ali\n, in the centre of the large square, outside the entrance to the mosque, is a large round, sort of fountain, where the Mahommedans used to wash themselves three times before praying, close to this is a well 300 ft deep to the Nile. Bob photoed me here.\n\n\n\nAfter seeing the Blue Mosque we drove down to the Markets or Bazaars, &walked through them, then returned to the St James, arrived there 3 o'clock & had a late & hurried lunch. We then went out tothe Pyramids by tram. Rode a camel down to the Sphinx & round the three great Pyramids. Went through the Temple of the Sphinx. This is constructed with huge blocks of Alabaster, Granite and Limestone. The Alabaster coming from Jerusalem, the granite from Assouan, 500 miles away, & the Limestone from the Mokattan\n\nquarries over the nile near the Citadel, like the Limestones of the other great Pyramids.\n\nNapoleon, when he invaded Egypt, fired a cannon at the Sphinx, smashing off its nose. The head & shoulders of the Sphinx have been cut out of solid granite rock. Went through the smallest of the three Great Pyramids. They are of course most wonderful in their construction. Had photo taken on the camel at the Sphinx. TheArab guides were a source of annoyance to us, in their perpetual cadging. Returned very tired to Cairo. Had dinner at the St. James & then returned to camp at Heliopolis. While speaking\n\nof the Pyramids and the Sphinx, the Pyramid of Cheopswas erected about 3750 B.C. & took 30 years to build (10 years to quarry the stone, 10 years to fashion the limestone, &10 years to build). There are in all seventy Pyramids extending from Ghizeh to Medum,sixteen only having been identified. Eachof these was built as a royal tomb, at the time of the fourth Dynasty. The height of the Pyramid of Cheopsis 451 feet, each side is 755 feet long at the base. This one Pyramid contains enough stone to erect a wall (4) four feet high & one foot thick round the whole of France. It covers an area of 13 acres.The second largest Pyramid (Chephren) stillhas the smooth outer covering of granite for some hundred & fifty feet, from the top. The Sphinx is the oldest structure in Egypt, was probably repaired by both Cheops & Chephren.It is a huge image of the Egyptian deity \"Harmaokis\" the \"God of the morning\". The encroachments of the sand have by now covered a great deal of the Sphinx nearly to the shoulders. The\n\n\n\nSphinx is 140 feet in length, that is its body, while the head is about 30 ft. from forehead to the chin, &14 ft. across. The front paws are 50 ft in length. The height of the figure is nearly 70 ft\n","52":" to","53":"\nNothing of any consequence happened.\n","54":" & 31st Sept 1st\nWent through our Musketry course, firing at both Application & Rapid Fire at from one to five hundred yards.\n","55":" ","56":" to ","57":" ","58":"\nWent to the Kapsaal in Cairo, on the night of the 2nd. Cairo again on night of the","59":" inst.\n\nAug ","60":"\n (Sunday)\nAfter Church Parade Jones & I had passes till 10 P.M. Went to the Zoo, the chief attractions of which are its very fine grounds, &the extra good specimens of Giraffes and Rhinoceri. There is also to be seen a very good collection of Gazelles, Bucks & similar animals, but the larger animals such as Lions, Tigers, Pumas etc. are very poorly represented. We left the Zoo at about 4.30 p.m. & continued our journey to the Pyramids. Rode down to the Sphinx again on a Donkey, afterwards went\n\nthrough the great Pyramid of \"Cheops\". Went to both the King's & the Queen's chambers or Tombs. It is certainly a great mystery how they managed to construct this Pyramid, unless they possessed some powerful machinery in those days similar to our present day winches & cranes etc. At the Kings Tomb, half way up the Pyramid, is a block of limestone weighing 49 Tons, & there are any number of blocks almost as heavy. Had a very nice dinner at the St James before returning to camp.\n\nAug\n","61":"\nWent to Cairo in the evening with the intention of buying souvenirs, but did not succeed in getting anything.\n\nAug\n Sept 7th-12th (Sunday)\nEarly in the week the 5th & 6th Re-inforcements were formed into a Squadron, &allotted our horses, so thatshould point to our going as L. Horse when we go to the Front. Went to Cairo on three orfour nights through the week. \nSent DorothyFly Whisk by Reg Post\n.\n\nThe 8th Re-inforcements arrived on Friday, the","62":" being detained at Liverpool in quarantine with measles.\n","63":"\n","64":" to ","65":"\n","66":" \nDoing mounted work every morning. Went into Cairo on a couple of occasions at night. Things getting very stale in Egypt.\n\nSept 18th\nWe were ordered today to prepare ourselves for sailing immediately to the Front. Only 17 men from the 6th of the Ist re-inforcements selected to go with the 5th of the","67":" & some wounded returning to the Front. Went Cairo tonight for the last time & had a good dinner at the St James.\n","68":"","69":"\nLeft Aerodrome Camp at Heliopolis at about 7.30 a.m. marched to Zeitounwhere we entrainedfor Alexandria. Left Zeitouna 9.30 a.m. & arrived at Alexandria about 3.30 p.m,here we embarked on the \"Georgian\" but anchored in the Port for the night, the railway line from Cairo to Alexandria runs all the way through the irrigated land from the Nile.\n\nAlexandria appears to be about the nicest town I have yet seen in Egypt & has a more European appearance than Cairo. There were a large number of boats in\n\nthe Port including a number of transports & Hospital ships.\n","70":"\nLeft Alexandria at about 7.30 a.m for Gallipoli. Had the bad luck to be placed on the \"Submarine Guard\" which lasts for the whole trip. They say there are eight or nine transports in all going across with us, but so far I have only seen two others besides ourselves. The Submarine alarm was sounded once today as a practice drill. Had a very calm run today.\n","71":"\nWonderfully calm today, saw a number of boats in the distance\n","72":" &","73":"\nThe run from Alexandria to Gallipoli usually occupies about 50 hours butwe are still ducking round, dodging submarines. Last night the ships officers informed us we were then only 12 hours sail from Alexandria, &it was then 60 hours since we had left there.\n","74":"\nArrived Lemnos last night &anchored in the Bay, which appears to be a fine natural Harbour. The entrance to the Harbour is protected\n\nby a double row of anchored mines & no boats can pass these after dark, during daytime however the barrier is opened to permit of traffic passing. The island appears to be most barren & devoid of any vegetation. In the distance can be seen a large encampment of soldiers. There is a big fleet of warships in the Harbour, the greater number British & the rest are French. About 10 a.m. today we steamed up through the lines of warships & merchantmen& again cast anchor. Two or three boat loads of British Tommies left the Harbour today for Gallipoli. The tucker aboard the boat is the worst I have yet struck. Wrote to Mother today.\n","75":"\nStill anchored in Mudros Bay, Lemnos.\n","76":"\nStill anchored, on the Georgian, at Lemnos. We received orders today to pack up our things in order to proceed to the Dardanelles, but as usual the order was later on countermanded & we spent the night in MudrosBay.\n","77":"\nStill on the \"Georgian\" in MudrosBay\n\nChurch held aboard by naval chaplain\n","78":"\nLeft the \"Georgian\" about 2 p.m. & went aboard HMS Sarnia. Left Mudros Bay at 3 p.m. with another Troopship, with \"Tommies\"aboard, & arrived off Anzac about 7 P.M. where we anchored till 11 o'clock. We were then transferred to a barge & towed ashore. Both tugs & barge went aground on the Beach & we were consequently over two hours in landing, eventually landed by running a number of donkey carts into the water & crossing on them. Two warships were bombarding the Turkish positions all the night, but there was not a great deal of rifle fire going on. Had to march about 1 ¼ miles, mostly through a sap to the position held by our Regiment known as No. 1 Post Anzac.\n","79":"\nOur section was drafted into A Troop of A Squadron.In afternoon had a swim on the Beach & at 6 P.M. went into the trenches for the first time.\n","80":"\nSpent last night & until 6 p.m. today in the trenches. The warships bombarded the Turkish trenches fairly heavily last night, the shooting from them being wonderfully accurate. The position at\n\npresent held by our Regiment is within a few hundred yards of the Seaon a high hill South of Suvla Bay. A month ago there were no trenches whatever here except the one sap from the Beach up to our encampment, now our position on the hill has been greatly strengthened by makinggood trenches all round the hill, our trenches also extend down the gully furthest from the sea &up again on the other side almost to the top of the second highest hill in the vicinity. Here only 50 yards separate our trenches from the Turks, and the enemy are so strongly entrenched here that it is almost impossible to capture their positions except at a great loss of life. On our left flank our trenches run for about five miles parallel to the coast & extend past Suvla Bay. Our immediate neighbours on this side are the","81":" Light Horse & then NewZealanders, then a big army of British Tommies, probably not less than130,000 men. Here the country appears to be much more suitable for an advance by our men, not \n\nbeing nearly so hilly as here. Considerable advance has been made here lately & no doubt the idea is to swingthis left flank right round & extend it right across the peninsula. The Turks on Achi Baba &all these other hilly positions would then be competely cut off & it would be only a matter of time before they would be compelled to surrender.\n\nOn our right flank is the 20th Infantry Battalion, they are on a higher position than ours & the distance between the trenches of that Battalion & the Turks is only 36 yards. The British Warships in the Bay do some marvellous shooting every night on to the Turkish trenches here, they have to fire over our fellows heads, miss them by a few feet & land the shells in the Turkish position. This they appear to do with perfect accuracy though the warships are at least five miles off usually. Have been doing some sniping today, but we have the Turks fairly \"wet\" here & they hardly ever show a head. About 2 miles to the right of us is the hill up which the first famous\n\nlanding of the Australians & New Zealanders was effected. it seems incredible to think that anyone could possibly capture these heights even though they did manage to land. Shells from the warships were screaming over our heads a good deal last night & landing amongst the Turks on the right doing a good dealof damage to their trenches. Practicallyall day & night can be heard the roar of artillery & the fire of the warships down off Achi Baba. \nWarships\n Aeroplanes go up daily \nhere\n reconnoitering for guns & observing positions etc & at times opening machine gun fire on the Turkish trenches, the Turks reply with anti-aircraft guns but have not succeeded in \"winging\"one since I've been here. Our Regiment was most severely cut up some time ago in a charge & there are now very few men left of the old original regiment, one complete Squadron, B, is now composed of men from the old 12th Reg. The flies here are damnable.\n\nOct 1st\nWent down to the Beach today & had a swim & collected stuff for making some sort of a \"home\". Went into the trenches again at 6 p.m.\n","82":" &","83":"","84":"\nDoing sapping & outpost duty alternately.\n","85":"\nAbout 10 o'clock this morning the Turks attacked on our left & opened up a bombardment by their artillery, machine guns, & rifle fire, extending from our left flank to about Popes Hill. A number of shells landed on Walkers Ridge & other positions near by, but the Turks attack completely failed all along the line & cost them probably a good number of men.\nSouth of here, probablyabout Achi Baba & at the entrance to the Narrows we could hear tremendous cannonadinggoing on early this morning & which lasted for a couple of hours.\n","86":" to","87":"\n)\nThings nice & quiet,doing sapping & outpost duty alternatively. Two of our fellows were shot yesterday only a few yards\n\nfrom our \"tent\"by a sniper, one died immediately, but the other was only slightly wounded. Two others were wounded, one a stretcher bearer very seriously, & the other was hit through the ribs when on outpost duty. It was telephoned in to us last night from hill 60, on our left & about two miles distant that the Turks were using poisonous gases there, we got our respirators in case of emergency but fortunately did not require their use. Held our first Church service today on the \"battlefield\".\n","88":" to","89":"\n)\nSpent another very quiet week, chiefly outpost duty & sapping. demonstrated all along the line at 3.30 a.m. on the","90":" inst.\n","91":" to","92":"\nThings still very quiet, weather much colder with light showers each day & night during the week. The balance of the","93":" re-inforcements & all the","94":" re-inforcements arrived here tonight (Sunday).\n","95":" to","96":"\nNothing much doing this week, yesterday the warships were bombarding very heavily south of us probably\n\non Achi Baba. Have been suffering a good deal with a bad back since arriving here.\n","97":" to","98":"\n\nFor the past eight or ten days beautiful weather has prevailed. On Thursday night the","99":" L.Hoccupied immediately after dusk a Turkish trench which they manned only at night. The Turks on discovering that they had been forestalled attacked our men with bombs etc., more Turkish re-inforcements were brought up but our fellows cut them to pieces & held the captured trench. On Friday night there was also some attacks on our left flank in from Suvla Bay. Earlier in the week there was a great dealof heavy bombarding by warships & artillery off Achi Baba, & we hear that the French captured three trenches on the slopes of the Fortress, however I am disinclined to believe this, it probably being just one of the rumours one hears every day. German airships yesterday dropped bombs near Anzac Beach but without doing any damage.\n","100":" to","101":"\nNo very exciting fighting this week. The men belonging to the old Regiment were sent away to Lemnos for a spell. Lord Kitchener arrived here yesterday on a short visit of inspection accompanied by a number of staff officers. I believe that by his instructions we are to have a canteen on the Beach, also we are to prepare for six months of \"peace\", that is, we shall merely hold the positions we now occupy & not attack the Turks. Evidently they intend to attack Turkey via Salonica & Bulgaria. It appears to be impossible to advance further here except at the cost of a huge number of lives.\n","102":" to","103":"\n\nNothing of much importance has happened during the past fortnight, barring the usual artillery duels & occasional bombardment of the warships, however we captured a couple of trenches at different points. A couple of days ago the Turks with the use of heavy howitzers succeeded in burying 120 of our men at\n\nLone Pine, however only about 20 were killed. This occurred through our men taking shelter in a tunnel while the Turkish artillery was bombarding, & the Turks succeeded in burying them alive, however the big majority were rescued.\n\nSnow fell towards the end of this week & it has been bitterly cold in the trenches at night, though one only does three hours on active sentry duty he has to keep walking briskly up & down the trench all night in order to keep warm, it being impossible to sleep.\n","104":" to","105":"\n)\nStill preparing Winter Quarters.\nYesterday the warships opened a very heavy bombardment of a Turkish Railway bridge some miles inland & succeeded in demolishing it. The Guard which for the past couple of weeks has been at Imbrosreturned today.\n","106":" to","107":"\nSome very heavy naval bombardments have taken place during the past week. Had rather an exciting time a couple of days ago when a party of us were round at Headquarters on fatigue. The Turks\n\ncommenced to pour the shrapnel into us, wounding four of the party, one seriously. Events of the past few days seem to indicate an evacuation by us of the Peninsula. Different Battalions & Regiments have already gone, as well as a number of Batteries, also a good quantity of supplies. Everyone is wondering whether it means a total evacuation within the next week or so, if so there will be many lives lost in doing so. There was a very heavy naval & artillery bombardment on our left, round Suvla Bay last night, & today I notice a captive observation balloon hanging over the Bay. Have been tunnelling chiefly during the week. Capp, Jones & myself were recommended for commissions in the Infantry but the old Colonel would not allow us to leave the Regiment. Leith Lamrock obtained a commission in the","108":" Battalion a week or so ago & I believe Bob Chapman is also getting one.\n","109":" to","110":"\nDuring the week practically all the troops have been withdrawn from Anzac & Suvla Bay. The\n\nevacuation up to the present helped by beautifully calm weather has been most successful. Today (Sunday) there are only about 4000 troops holding all the Anzac positions which up to the time of the commencement of the evacuation were held by over 40,000 men. The Ist L.H. Reg. has the honour of forming part of the covering party to the withdrawal. We hear that tonight is to be the final night & all going well the Peninsula at Anzac & Suvla will be totally evacuated by us at daybreak. During the past week they have been sending away all the most valuable stuff from the large stacks of supplies on the Beach, & the remainder which would be of any material value to the Turks is being either burned or destroyed. Should the Turks attack us tonight it will be almost certain death for all of us now remaining on the Peninsula, however they will pay very dearly as we are ready for them & have ample deadly machine guns besides our rifles, bombs, etc. Practically all the artillery has already been taken away, but the warships still remain in close watch & \"Johnny Turk\" has had many a nasty\n\nexperience of what they are capable of doing. We have erected additional barb-wire entanglements all along our line to arrest an attack by the enemy.\n","111":"\nThe evacuation of the Peninsula which was a great and successful operation was completed by 4 a.m. this morning. I was very glad to have been one of five men forming the last patrol of the Peninsula. At 6 p.m. yesterday all our Regiment left our position with the exception of 60 of us who were picked men to form the covering party.\n\nThe withdrawal from the positions held by us was commenced soon after dark from both flanks & worked towards the centre. By 3.30 a.m. all our positions except Walkers Ridge & No. 1 Outpost which was held by us had been abandoned, apparently without the Turks being aware of the fact. About midnight a bombardment by the warships down near Cape Helles& an attack by our Infantry there helped to take the Turks attention away from our points of operation. This attack was also very successful & I believe\n\ntrenches were captured there by the French & British. At 3.45 a.m. we received orders to withdraw, but owing to the order not being in codeMajor Granville who was in charge refused to act upon it. It was nearly half an hour before this error was officially corrected, thus delaying us considerably & making us absolutely the last unit to leave the Peninsula, instead of the 20th Infantry Battalion from Walkers Ridge who in the ordinary course of events would have been the last. Before leaving their position this Battalion succeeded in blowing up the Turks on Walkers Ridge. This was the signal for heavy machine gun rifle fire from the Turks who apparently were expecting an attack to follow; however we all reached the Sap leading to the Beach without being hit though bullets were flying thick & fast. We were conveyed in barges to the S.S. Prince Abbass which was waiting for us out in the Bay. The evacuation of the Peninsula was a wonderfully successful feat, especially when one considers the most\n\ndominating positions held by the Turks. All the artillery with the exception of one howitzer were safely removed & this one was blown up at the last moment, all our machine guns were also withdrawn at the last minute & most of the supplies were previously either taken away or destroyed. Of the 100,000 troops withdrawn from Anzac & Suvla Bay the casualties were almost nil. It is very doubtful whether or not the Turks knew that a total evacuation was to take place. A fortnight or three weeks ago we did not fire a single shot from any of our trenches for 48 hours, this greatly helped us to extricate ourselves without the Turks being sure we were not again playing the same game, also during the last few days \nthree or four of\n our aeroplanes were continually patrolling Anzac day & night in order to keep German planes from taking observations. The withdrawal of all the troops from Anzac & Suvla is undoubtedly a good move. The failure of the Suvla\n\nlanding & the fact that the Turks occupy all the chief dominating positions on the Peninsula & have so strengthened them to make an an advanceby us an awfully costly undertaking, justifies the withdrawal, & the men will be far more useful at other points of the war area. The navy did some excellent work in the Gallipoli operations & everyone have wonderful faith in its absolute supremacy. Their gunnery is nothing short of marvellous.It seems that they intend to hold the positions on the south of the Peninsula from Cape Helles to Achi Baba.\n","112":"\n\nWe left Anzac Cove before daylight & arrived at Lemnos Island & anchored in MudrosBay about 9 o'clock. We were all completely fagged out & slept till about 2 p.m. Later on in the afternoon wewere transferred into Lighters, &again into still smaller craft & landed at Mudros East. There are no wharves at Mudros, & the Harbour, though large & well protected is very shallow\n\n& the boats cannot come close in as in Sydney Harbour. We humped our packs & kits etc for a couple of milesto the camp near East Mudros.There are something like 150,000 troops now in camp at Lemnos.\n\nDec 21st\nHad a brute of a night last night, awfully dusty & windy & today while we had our tents down it began to rain heavily, wetting ourselves &most of our belongings. We were told by the Brigadier (Col Cox) today that we should be returning to Egypt as soon as a transport was available & that in our next operations we would be mounted. This news was of course received most gladly. This will probably mean a month or more of mounted training in Egypt, as we shall have to be freshly equipped & both horses & men will require some training again after the spell away from mounted work.\n","113":"\nWe received our embarkation orders today & left camp this morning again\n\nat 11.30 \nam\n, however it was dark before we were finally aboard the S.S. \nHororata\n, the boat which is to take us to Egypt. She is a very fine troopship, well fitted up and very clean. There are about 2000 men aboard but we have ample room. There is a piano aboard and the lads were very merry tonight after their long weary spell on the Peninsula.\n","114":"\nStill lying in \nMoudros \nBay all day. This boat had a 4.7 inch gun mounted on her as a protection from submarines, we are also mounting a couple of our machine guns. All the larger transports now have guns mounted on them.\n","115":"\nThe \"Aquatania\" came into the harbour last night. She is a beautiful looking liner now converted into a Hospital ship, and one of the largest boats afloat. We left Mudras\n \nHarbour about 8.30 this morning. Heard today that they intend making cavalry of us when we arrive in Egypt and are arming us with swords and lances. Hope this is true.\n","116":" (Christmas Day)\nThis is the first Xmas I have spent upon the briny seas, however we are having quite an enjoyable trip, the sea being calm and the weather most beautiful. Our Xmas dinner today consisted of roast beef and green peas (dried), plum pudding and Port and Claret. It is quite a treat to again have good bread to eat. Bread on the Peninsula was very often considered quite a luxury and we have paid as much as 2\/- per loaf for it there, while during the earlier part of the campaign as much as 5\/- was often paid for ½ lb for awful tinned butter?, & 1\/6 for cakes of chocolate procurable anywhere else for 3d.\n","117":" (Boxing Day) Sunday\n:-\nArrived at Alexandria about 10 o'clock this morning, and anchored. Drew into the wharf in the afternoon and disembarked about 5.30p.m. Entrained immediately for Cairo and thence Zeitoun\n \nwhere we arrived at 1.a.m on \nMonday \n","118":"\n:-\narrived in camp about 2.a.m. and had a sleep. Did nothing much today but at\n\nnight Capp Jones Smith and myself went to Cairo I had a good dinner at the St James Hotel.\n","119":"\nHave been busy today re-forming the new Regiment before preparing to leave, mounted.\n","120":" and 31st and","121":" and","122":"\nHave been busy during the week re-forming the Regiment. I have doing mounted drill. Have been in Cairo once or twice, last night we went to the Kursaal, there being a very good show on there. ( Don't forget the monkey)\n","123":" to","124":"\nKept going all day doing mounted drills and being equipped to move off mounted. Have been Cairo about every second night, have been winning consistently at \" Crown and Anchor\" and more than paying my expenses.\n","125":"\nLeft yellow kit bag at Cooks branded No. 1040. M. E. PEARCE,","126":" A.L.H. Reg.\n","127":"\nThe First \nLight \nand Second Light Horse Regiments left Heliopolis at 9:30am under Colonel Cot. Our route lay along the valley of the Nile for most of the journey we were close to the Alexandria to Cairo railway line. We had\n\nlunch on the banks of one of the irrigation canals not far out of Cairo. Soon after lunch we passed through Caliuli. From here to Barrage where we camped tonight our route lay through beautiful rich irrigated country on which is grown corn , cotton and * Berseem to perfection, the latter crops being very similar to lucerne. We arrived at Barrage about 5:30pm and we immediately put down our horse lines and camped for the night.\n\n*Berseem - (called dreice when dried)\n","128":"\nLeft Barrage at 8:30am for Wardan. Barrage is one of the prettiest places along the Nile. It is situated just where the Nile divides itself into seven separate streams. There are a number of bridges across the different streams at this point and on each is a small fort in which is kept a permanent garrison of Egyptian soldiers. The gardens here are the most beautiful I have ever seen. We arrived at Wardan at about 4 pm. The camp is close to the railway and about half a mile from one\n\n\n\nof the Nile irrigation canals.\n","129":"","130":" 17th,","131":"\n\nDoing mounted parade work & fixing up the new camp at Wardan\n","132":"\n. \n\"A\" troop of\"A\" Squadron were detached off yesterday to go on patrol duty about 30 miles north of here, accordingly we left camp at mid day today & went as far out as Khatatba a distance ofeight miles, here we camped for the night on the banks of the canal which supplies Alexandria with water from the Nile.\n","133":"\n\nLeft Khatatba about 9 a.m. accompanied by a most \"important\" (in his own estimation) Chief of native police, who acted as guide & interpreter. We passed through a number of dirtmud villages situated on the banks of the Nile, & our entry into each village caused great excitement amongst the Arabs. who, apparently had not been accustomed to seeing soldiers passing through their towns. The native women ran for their lives into their mud homes on catching sight of us, or those who didremain in a safe distance\n\ncovered their faces with their black cloaks. On seeing us they approached along the road two or three native police would run out to meet us, & after securing orders from the Chief of Police accompanying us would run on ahead to the village, where, with the assistance of a number of other native police all armed with big \"waddies\", they proceeded to round up all its inhabitants, very much like one rounds up a mob of fowls & to shut them up in their mud houses, so that, on riding through the streets of the village the only signs of life we saw were hundreds of barking dogs & much \"perturbed\" fowls, the eyes of hundreds of the populace glaring through cracks in the doors or walls, however the smell of the lanes & back yards was quite sufficient to keep our attention fullyoccupied while passing through these villages. Villages I say, in size they resemble one of our small villages, but in population I think the equal that of many of\n\nour fair size t\nowns\ncountry towns, without including their flocks of goats, donkey, fowls & sheep all of which live in the mud houses with their owners & one might almost be excused for adding them on to make the population figures. The Mayors & more enlightened members of the villages however gave us most cordial receptions, bringing us out \"backsheesh\" (gift) oranges, roast Turkeys, & a great deal of cakes etc. of their own manufacture, the latter \"dainties\" however needless to say we politely refused.\n\nWe arrivedat Teiria about twenty miles north of our starting point early in the afternoon & camped there for the night. Our route during the march lay between the Nile and one of the irrigation canals, on either side were very fine crops of Broad Beans, Berseem & Barley. \n","134":"","135":" 22nd &","136":"\n\nour troop split up into three separate camps, each one stationed on the banks of the Canal which leads out ofthe Nile to Alexandria & from which Alexandria receives\n\nits water supply. The Nile itself runs along on the other side of us & in places very close to the Canal, in some places not more than 15 yards separate the two, & as the water in the Canal is 12ft higher than that in the Nile, hostile troops could easily cut the bank between the two & so drain all the water from the Canal into the NIle, thus cutting Alexandrias water supply. Our duty then is to patrol about forty miles of this Canal day & night. We hardly expect an attack though bands of Bedouins & \"Senussies\" are operating out about 50 miles in the desert. The remainder of our Regiment are still in camp at Wardan, when they again take the field we shall no doubt be withdrawn to join them & be relieved by some other unit.\n","137":" to","138":"\nDoing patrol duty along the Canal. Mentioned above.\n","139":" to","140":"\n\nNothing of much importance doing. Quite satisfied with our job of patrolling the Canal, but we hear today, much to\n\nour disappointment that we are to be relieved in a day or so by a troop from the 2nd\/L.H & we are to rejoin our Regiment at Wardan. As we have only just got things in going order & settled down nicely to quite an easy & free life we are much annoyed, however it's the Military all over, & we are used to it by now.\n","141":" 7th:-\n\nPatrolling the Canal as usual. One Troop from the Second L.H Reg. arrived to relieve us.\n","142":"\n\nLeft the Canal at 8.30 a.m., went back a much shorter was than that which we went up by. Arrived at Khatatba by 12.30 p.m & had lunch there. Reached Wardan camp at 4.30 p.m.\n","143":" to","144":"\n\nReceived an alarm at 5.30 a.m yesterday morning to be ready to leave camp by 9 o'clock. By 2 P.M the last of the three special trains moved out of Wardan conveying men, horses, transport waggons & all gear of the Regiment. We had practically a clear run through to Samalut, where our Squadron bivouaced for the night.\n\nSamalut is situated about eighty miles south of\nWardan\nCairo on the main Alexandria to Khartoum railway. Our other two Squadrons are camped about seven miles north of Samalut along the railway line.\n\nThe country round here is very rich, the Nile valley is a good width & the usual crops grown flourish exceedingly well. There are extensive groves of date trees roundSamalut - the neighbouring villages which add to the appearance of the country.\n\nWe spent today (Sunday) fixing up our camp & in the afternoon had a swim in the Canal\n","145":"\n\"A\" Troop received orders to\nbe\nmove off by 9 o'clock this morning from Samalut on the bank of the Canal & our orders are to patrol along near the fringe of the desert. Our patrol is about 12 miles in length & we have also to guard two camel tracks which lead in here from the desert, & to allow \nno one\n\nno one whatever to pass in an easterly or westerly direction.\n","146":" to","147":"\n\nPatrolling along the fringe of the Desert west of Samalut. We connect with the","148":" L.Hon our left while one of our own Squadrons is on our right. The onlycontact we have had so far with the enemy was in the capturing of a couple of prisoners (Bedouins) a couple of days ago. All along our patrol where the desertand the irrigated Nile valley meet one another are numerous villages, the inhabitants of which are mostly Bedouins. They are for the most part a pitifully poor community & their homes consist chiefly of a few corn stalks thrown together in the form of a very rough hut and in these awful places they spend their\nwhole\nlives, yet appear contented enough. At present we are not in a very enviable position, being under quarantine restrictions, the adjoining native village of Shusha being in the throes of a very serious plague known as pneumonia plague. There have been numerous deaths to date.\n\n\"B\" Troop arrived here yesterday from Samalut to assist us on the patrol.\n","149":"\n\nWhile a couple of other men & myself were out \nit\n in the desert doing Camp Guard today the half squadron (A and B troops) moved camp to a village about 4 mile north of Shusha known as Ezbit Sidhoum. The other two troops stationed at Samalut also moved out to this camp today. The reason we moved from Shusha was because of the plague now raging there.\n","150":" to","151":"\n\nPatrolling as usual. Went to Samalut yesterday loading reserve rations & horse feed.\n","152":" to","153":"\n\nStill patrolling along the fringe of the Desert, however the Senussieshave, according to information received gone further south. Went by rail to Minia (about 20 miles south of Samalut) one day last week, as guard over some ammunition which was sent from here. Minia is a fairly large town & we should have had plenty of time to drive around\n\n \n\nit, had the military authorities taken charge of the ammunition, instead of keeping us guarding iton the minia platform from 11 a.m. till 4 p.m.\n","154":"\n\nHad a most interesting & pleasant day today. Four men, two NCO's & one officer from each Troop were sent out on reconnaisance work, to make a note of all roads, canals, drains, bridges, ferries etc in the vicinity. Our party went first of all toSamalut, which place was en fête, it being market day there. Market days are not held very frequently in these places so we were very fortunate in witnessing the spectacle. Samalut was simply thronged with natives dressed in many different shades& modes, from the latest European style down to the simple \ngarment worn\ntorn & dirty garment worn by the little Arab street urchins & doing duty as a shirt. In the market place, which was a perfect Bedlam, in which some thousand or two natives had congregated, were for sale camels, donkeys, oxen & all\n\n\n\n \n\nKinds of animals Known & used in Egypt, together with all Kinds of agricultural products & articles of native manufacture. Over the various stalls in the market place were hung wide cloth shades of every colour & conglomeration of colours imaginable. After partaking of various cooling lubrications in Samalut, we went out again & splitting up into pairs proceeded to take notes on the various roads etc, in the vicinity & to verify the military maps. At about mid-day a dozen or so of us had assembled at a point previously arranged & we were invited into the house of the Omdah* of one of the villages. Here we were given very nice tea & biscuits, cigarettes etc, however we were unable to stay here long as we had to fulfil our invitation to lunch with the Omdah of the next village at 1.P.M\nWe were late in arriving at this next village, & did not have lunch till 2.p.m however the Omdah treated us right royalty, giving\n\n* Mayor.\n\n \n\nus any quantity of whisky, beer etc, not to mention the various courses of turkey, pigeon, lamb, cheese & fruit, which they insisted on us eating till we could eat no longer. After such hospitality being showered upon us, we were now beginning to got a little merry & we did not take our departure till about 4.30. On arrival at the next village we were treated again to \ncl\nshay!!! (tea) however before leaving we were successful in obtaining another couple of \"wads\" which \ngreatly contributed to a very merry rideback to camp\nassisted by the contents of our \"water\" bottles greatly contributed to a very merry ride back to camp, where we arrived at dusk. Tourists of Egypt, after spending hundreds of pounds in \"seeing Egypt\", would never have the opportunities of coming into contact with the natives, both the higher classes & the lower classes as we have here & thus\n\ngetting a good insight into the native life& customs.\n\nApl.28th\n\nUp to the present we have been putting in a most monotonous time here doing outpost duty & patrolling the Desert. Our Reg has been very unlucky as practically all the Australian Infantry have gone to France & most of the Light Horse Regts. have gone either to the Sinai Peninsula or the Canal. From all appearances we are to remain indefinitely in Egypt to help defend the place. It is now very hot & this & the two months to come are the ones during which the Kamseen's* blow very frequently. The filth which has accumulated for ages past in the different villages is not very pleasant stuff to have blown in your eyes almost continually.\nFlies are awful & Egypt generally is about the last place on God's Earth which I'd choose to live in.\n\n* Kamseen (Arabic meaning fifty). The winds which blow very frequently in Egypt during the months of\n\n\n\nApril, May & June, at a velocity of approximately 50 miles per hour.\n\nApl.29th\n\nToday has been about the most miserable day I have yet put in. Last night, Jim Capp, one of the very finest fellows I have ever known & my most intimate friend in the army passed away, apparently through heart failure. Though about nine of us slept in the one small tent, none of us were aware of his death, until morning, though there is every reason to suppose that he died not later than ten o'clock at night. He apparently died without the slightest pain or movement. He & I formed a permanent half section & have been together almost ever since I enlisted. He was a man possessing a very fine character, was most scrupulous in everything & was very well liked and respected by all. An enquiry was held here today concerning his death. He is being buried in Cairo.\n","155":"\n\nThis afternoon all the Squadron with the exception of \"B\" Troop moved out to the new camp now being laid out at El . This camp is only 4 miles south of Ezbit Sidhoum, and is situated on the edge of the desert. From all appearances it is to be a big camp & will be the base from which all operations in connection with the building of the line of block houses out to the oasis, will be conducted. This oasis is about 130 miles west from here in the middle of the Desert & is now occupied by the Senussies & Bedouin Arab tribes. Block houses are to be built about every 15 miles between here and the oasis, wells will have to be put down at each \noasis\nblock house & we shall thus eventually drive the enemy tribes out and occupy the oasis.\n","156":"\nA party of us (fourteen in number) moved this morning to the pontoon\n\nbridge at Shusha. While here we are to guard the bridge, some of the Cheshire Engineers are camped here. For the past month we have been attached to the 53rd (English) Division but I think that very shortly the Regiment will be re-attached to the 1st A.L.H. Brigade & in that case we shall probably be sent to the Suez Canal.\n","157":"\nConsiderable processions of armoured cars, ambulances waggons, transport waggons, & camel trains over the bridge today. Hind & I rode into Samalut in the afternoon.\n\nMay 12th \nWe were relieved from Bridge Guard at Shusha on the 9th by another party of men & went to the camp at El Wany Essa. During the last couple of days we have been escorting camel trains out to the 1st and 2nd Block Houses. This morning we arrived in camp, having escorted in the camel train which left here three days ago for the second Block\n\nHouse. Had an awful job to get the camels to the camp. The nigger drivers had been without water for nearly two days & had practically no sleep since leaving here, & they kept repeatedly falling asleep & then off the camels. They would then commence crying & asking for moya (water). They had been promised water when they arrived at the First Block House, but when they reached there the ----- of a Tommy officer refused them any & sent them on a further six hours trip to the camp here.\n\nMay 13th\n\nLeft the El Wany Essa Camp at 3 p.m. Fed horses & had tea in the Police Square at Samalut. Commenced entraining horses about 6.30.p.m. Also loaded a \ntremendous\nlot of forage & other stuff. Left Samalut about 8.30 p.m. & went by Cairo, Zagazig, Binha, Salhia & then along a new line to El Kantara on the \nCo\nSuez Canal. We\n\ndetrained here & after crossing the Canal had an awfully hot 10 mile ride to camp situated about due East of El Kantara. There are a lot of mounted men camped here including a number of English Yeomanry. The defences of the Canal appear to be most formidable, & there seem to be a large number of men stationed all along it. The","158":" 6th and 7th Regts are about 15 miles further East than we are on the Sinai Peninsula. The heat here is most severe, there is no shade whatever for the horses which are having a bad time. Water is by no means plentiful either, & we have only the clothes which we stand up in with us. This camp does not present a very cheerful prospect for our future here. While saddling our horses after detraining on the Canal, we saw a large troopship passing through. She was the\n\nA.71 & was from Australia, she had some artillery on board & I have been wondering if Claude was amongst them, he was expecting to leave about the time this boat would be leaving Australia. Our Brigade is expecting to be sent about 17 miles further East beyond the 1st line of trenches to do patrol work.\n\nMay 18th\n\nLeft the camp (situated about 10 miles East of El Kantara & known as Hill 70) about 3 a.m. & marched about 17 miles in a N.Easterly direction to Ro\nu\nmani This position is situated about 4 ½ miles South of the Mediterranean Coast & about 30 miles East of the Suez Canal. The 6th &","159":" Regts are also stationed nearby. This is the 1st line of defence of the Suez Canal & is held chiefly by mounted men.\n\nMay 20th\n\nOur squadron left camp about 3.30 this morning & went out to Katia, the scene of the recent raid by the Turks on the British Yeomanry. The Yeomanry were evidently\n\nsurprised here & attacked at night by a strong force of the enemy. The greater part of the Yeomanry were evidently either killed or taken prisoner. We buried one Turk, the","160":" Regt. having previously buried all the dead bodies, both British & Turk. We counted 100 dead horses in one place & over 50 camels in another.\n We saw larg\nThe road from Egypt to Jerusalem runs past Katia. Christ is supposed to have gone along this road when he travelled to Egypt from Palestine. At Katia there is a very fine well supposed to be over \nof\n2000 years old & at which Christ drank when passing there.\nWe burned a large number of Bedouin huts along the Oasis, & brought in about 11 prisoners (Bedouins) & a few goats & sheep. The last couple of days we have heard very heavy cannonading in the north presumably British monitors in the Mediterranean shelling the Turkish base about 25 miles East of here\n\nI was one of the Advance Guard today & though we only went about 10 miles East of here, had a considerable amount of cantering about over the heavy sands, quite sufficient for my horse.\n\nMay 23rd\n\nYesterday the","161":" and","162":" Regiments, \"C\" Squadron of this Reg. & two Regts. of New Zealanders went out some distance into the Desert apparently with the intention of surrounding a Turkish mountain Battery which the aeroplanes had reported out there. Whether the Turks had \"got wind\" of our intentions or not we do not know, but our fellows were unable to locate any guns, they however came upon a Turkish patrol of 9 men mounted on camels, however they were only successful in capturing one of them, the camels being too slick over the sand for our horses.\n","163":"\n\nThe","164":" Regt. left here at 3.am, theyare we hear going first of all to El Kantara\n","165":"\nTonight about 11. o'clock one Brigade of New Zealand mounted Rifles and the","166":" ALH Reg. moved out of camp. The plan of operations was to camp the following night at \nOgl\nOgratina, about 12 miles from Romani, to leave there about 2a m &go out a further\nsix\nor\neight\nmiles and attack the Turkish Outposts. This plan was carried out as far as possible, however only one outpost was attacked, 15 Turks were killed & one captured. We arrived back at Romani about 8 p.m on the 31-15-'16. At Ogratina we saw the dead bodies of a number of Turks &British Tommies killed about a month ago when the Turks surprised & cut up a Reg. of English Yeomanry.\n","167":" '16\n\nThis morning a Taube flew over our camp & dropped 8 bombs. She was something like 3000 ft up consequently her shots where not very accurate, however she got 2 good shots on the","168":"L.H Lines. She was successful in Killing 8 of our men & about 40 houses.\n\nOn sighting the Taube we rushed to our horse lines, cast off & scattered as quickly as possible, thus our losses were not so heavy as the","169":" Reg. who had not the time to get their horses away. The very heavy explosion & the machine gun shooting &the general pushing about caused many of our horses to become panic stricken, &a great number got away &racedfor miles across the Desert. Six hours after the raid, some of our horses were reported at Port-Said some 25 miles distant, &our Reg. alone must still be 30 or 40 horses short independent of those killed &wounded. We had only machine guns to ward off the raiders, however 2 anti-aircraft guns arrived during the day in preparation for any further visits. Besides the 8 men killed, 17 were wounded, &about 70 horses were also hit.\n","170":"\n\nSquadron left camp at 12 o'clock last night, & went out to dig wells at a\n\nplace about 1½ miles South of Ogratina. Were successful in obtaining a good supply of water for the horses being only slightly brackish. Was on the camel escort, guarding the supplies, the camels were in bad condition & very weak &we had a very bad trip with them. Arrived back in camp about 8.30 p.m. very tired &hungry, having had no sleep whatever for two nights, & only 1 slice of bread &jam to eat during the past 30 hours. My horse still out of action having been kicked on the stiflewhen at Ogratina on our last \"stunt\" &later having run a nail into his fetlock. \nHeard today of a big naval battle in the North Sea but have no official details yet.\n","171":"\nOur Brigade & a few New Zealanders left camp at 4 A.M. on another hare brained \"stunt\". The object was to go out about 25 miles & surround a Turkish post & capture all there. Wearrived at Ogratina at 10 A.M. & camped under the date palms until\n","172":" P.M. when we filled out & marched out a further 13 miles. We were unfortunate to run into a heavy fog & thus loosing our bearings in the Desert. Wehad to camp until 7 A.M. next day before the fog had risen sufficiently for us to takebearings. At 9 A.M. on the 11-6-'16 we were attacked by a number of Bedouin & Turks. The engagement lasted for threehours but the shooting was at very long range from 1200 to 2000 yards & very little damage was done on our side, & no doubt the Turks did not suffer very heavily from us. Soon after we were fire upon, one of our 'planes & reported the enemy to be only 160 strong with 80 Camels. This affair shows clearly the utter absurdity in these \"stunts\" as, though our force was vastly superior to that opposed to us, we were unable to outflank them or otherwise inflict any losses of any extent upon them, for the following simple reasons:- Our horses, after\n\ntheir long heavy trip over the loose shifting sand were nearly done & they they had a further 25 miles to go in a direct route home, the men were tired & had only a very little drop of water remaining, & the Camels on which the Turks were mounted are a great deal faster that horses in the Desert, i.e. the loose sand Deserts similar to the Arabian. Arrived back on Camp at Romani at 11.45 p.m. Our horses were absolutely knocked up, & all the men very tired & hungry. We captured only 2 Bedouins with Camels laden with ammunition & bound for Quatia. They evidently intended burying it there for use later on in another attack upon our camp. Some of the bullets fired at us were very rough, leaden & of about 44 calibre, these were of course used by the Bedouins, the Turks having up to date rifles. We destroyed Turkish wells about 25 miles East of Romani.\n","173":"\nThe Brigade, suported by the New Zealanders\n\nwere, a few days ago out on another two days \"stunt\". They returned however without any prisoners, thebirds having previously flown. I have for some days been suffering from a poisoned hand & other complaints so did not go out on the last \"stunt\". Yesterday a Squadron (twelve machines) of our aeroplanes passed over the camp en route to El Arish the Turkish Base, where they descended to within 200 ft of the ground & bombarded the Aerodrome. They destroyed two enemy 'planes & wrought tremendous damage. Three of our 'planes were down, but eventually two of these returned safely.\n","174":"\nReturned last night from another three days & three nights \"stunt\". Went out past Bir-el-ab. The 3rd L.H. were to be the attacking part on this occasion, we being in support. However the Turkish outpost succeeded in getting away in the nick of time again, the","175":" L.H. just being in time\n\nto see them disappearing over the hills on their camels. We brought in the engine & other parts of an aeroplane which had been brought down a couple of miles past Bir-el-ab, also 4 Bedouin spies captured near the 'plane.\n","176":"\nEnemy aircraft have visited us each morning for the past three days, they however, have not bombed us or any of the other positions. On each occasion we have displayed lightning skill in getting the horses off & away from the lines. Today we witnessed an aerial fight, our 'plane had the better of the contest all through & eventually drove the Aviatik off. Our 'plane descended at Rail Head having about 50 bullet holes through her, two of which were through the petrol tank. The Aviatik when last seen was said to be rocking & it is doubtful whether she succeeded in reaching El Arish in safety. Our Battle 'plane arrived \ntoo\n late for the encounter. \n\n\n","177":" '16\nIt is just twelve months today since we left Australia in the \"Clan Macewen\", it seems quite two years, however a good deal has passed since this time last year. The Second Brigade have returned here after their spell at Hill 70, they have relieved the New Zealanders.Weather fairly hot, foggy mornings, & the dews which which fall on the Sinai Penin. are by far the heaviest I have ever seen\n","178":"\nStill very hot & monotonous here. We are out on some \"stunt\" about once a week. Last week the","179":" &","180":" L.H. Brigades went out to different points about 15 miles East of here. On arrival there we formed one long line which stretched from the Sea to several miles inland in a Southerly direction,the distance between each pair of men was about 40 yards. On the way back we burned all native villages & brought in all Bedouins we could find. We hear the Reg. is very soon to be relieved from here, themen are very run\n\n\n\ndown only half of them being fit for duty. These long \"stunts\" combined with the great amount of night work we are getting, the excessive heat, & bad food etc are the cause of such a great deal of sickness. We have been out of bed every morning at 3.30 a.m. ever since our arrival here. German 'planes have visited us fairly frequently of late but have not \"laid eggs\" on us for sometime.\n","181":"\nDuring the past week things have taken a big change here. About five days ago our aeroplanes reported large forces of Turks advancing from El Arish. They are now entrenched at Ogratina & Sageer, They also have outposts entrenched about 2 miles this side of Ogratina. A Brigade of Light Horse goes out every day until they come in contact with the enemy. What skirmishing there has been up to the present has been confined to the Light Horse. We have had a few casualties\n\n\n\nup to date & have taken over twenty Turks prisoners. Had a lucky escape from being hit a couple of days ago. We were in the advance screen & I had my horse \"Chunder\" hit in the ribs. The bullet first hit the saddle flap turning it slightly. The Vet. has taken the bullet out & I hope to soon have my horse back. The opinion of the \"Heads\" appears to be that the Turks are preparing for a big attack on the Suez canal, to be made by an army of something like 100,000 men. Such an attack must end in disaster to them.\nThings have been very busy here and at Kantara during the last few days, large numbers of guns have been hurried out all along this","182":" Line of defence. We hope that if the Turks are going to attack, they will not delay it too long, we are ready for them, and for a spell after we have \"towelled them up\".\n\nJly","183":"\nHad a very exciting day. The","184":" Reg. acted as the advance screen today, & we got into touch with the Turks about 3 miles past Katia. \"A\" Squadron occupied Hill 245. \"A\" Troops when doing outpost duty were nearly surrounded by a body of Turks sent out to Outflank us. Immediately we commenced to retire from our position the Turks opened a heavy machine gun & rifle fire on us & bullets were very thick round us. Luckily the Turks over-estimated the range & the bullets went high otherwise few of us would have got away. We retired at the gallop for nearly a mile & the Turks came on & occupied the position we had held. We must have seen nearly a thousand Turks near Sageer today, but the range was too long for much sniping. They are well entrenched on the hills round Sageer. Were also fired on heavily while trying to\n\n\n\nwater horses today. \"A\" troops had really marvellous luck. Long, Roper, & Rinaldi were hit & a few horses, one had to be shot. We shelled the Turkish positions this side of Ogratina, & they also fired few shrapnel shells but they fell short & only hit an odd horse.\n\nJly","185":"\nBig Air Raid here today, three Taubes were over and dropped 24 bombs and a number of hand grenades & thousands of darts. Casualties were very slight however, they were apparently trying to hit the Artillery. Our Brigade was out in touch with the Turks all day. Very few casualties today out there.\n","186":"\nToday the second Anniversary of the Declaration of War by England on Germany, the Turks officered by a large sprinkling of Germans attacked Romani. The attacking force is estimated at 18,000 men & the objective was to take Romani and the Rail Head perhaps as a preliminary to another attack on the Suez Canal. However\n\n\n\nwe inflicted such a severe defeat upon them that I believe they will not contemplate another attack upon these positions or the Canal. We (the Light Horse) were called to arms about 1 A.M. and hurried out to certain positions upon which we knew the Turks were advancing. The","187":" and 3rd L.H. Regts which were doing outpost duty had come into touch with the Turks about midnight. The 1st, 2nd,","188":" 5th,","189":" 7th 8th, 9th, and 10th L.H. regts and one Reg. of Mounted New Zealanders were practically the only troops engaging the enemy up till about 8 A.M. These regiments in accordance with pre-conceived plans kept the enemy in check & gradually retired thus drew the enemy on and into the trap which had been laid for them. Just as day was breaking the Turks yelling Allah, Allah, Allah, and Finish Australia etc. charged us South of Katib Gannit, however we easily beat them off and inflicted heavy\n\ncasualties. About 7.30 the Turkish Artillery opened fire on us & their shooting was very good, & they killed a fair number of horses, but not many men. Our own artillery did not commence until about an hour after that of the Turks. It did admirable work & it was largely due to its excellent shooting that the Turks were so badly beaten. On the Northern & Eastern defences the enemy heavily shelled the redoubts for some hours with high explosive shells, They also dropped hundreds of bombs but no great damage was done & when the Turks charged the redoubts in the afternoon they were mown down in hundreds by the Scottish & English Troops defending them. In the afternoon the 2nd L.H. Brigade took 400 prisoners. In the evening all the mounted men worked round to the right flank, the Infantry taking our places. More Infantry re-inforcements\n\narrived about dusk & lined the hills on the left flank of the Turks. Here we had the attacking Turks on our right flank seriously threatened with being cut off. Unfortunately for us the enemy did not attack us on the morning of the","190":" but under cover of darkness retreated to Katia. The 3rd L.H. Brigade operated on our extreme right & severely harassed the retreating enemy. The Turks in their hurried retreat from Romani abandoned a battery of Artillery in perfect order, a large number of machine-guns and thousands of rifles. A large number of the enemy also discarded their gear before leaving the battlefield. This afternoon (the 5th inst) most of the L.H. supported by two regiments of English Yeomanry & a battery of guns attacked the rearguard of the enemy at Katia. We charged for some distance on horseback with fixed bayonets but were only able to enter the Southern end of Katia, the enemy\n\nhaving splendid cover amongst the date palms & being well supplied with machine-guns, & their artillery from Ogratina were shelling us heavily. However the whole attacking force was wonderfully lucky having very few casualties. The Yeomanry were the only Regts which suffered at all severely. Under cover of darkness we withdrew to Romani, our horses & men being completely knocked up, hungry & thirsty after the two days strenuous battle. The casualties up to the present are approximately, Turks & Germans Killed & wounded 3000 & prisoners 4000. Our own casualties all told would not amount to 1000 men.\n","191":"\nMost of the L.H. have been resting horses & men yesterday & today but I believe we move out again tonight. Yesterday our infantry entered Katia without resistance, the Turks having retreated the previous night. Our Infantry\n\nhave been following up the retreating Turks & there was some fighting near Ogratina this morning but have not received details up to the present. Some hundreds of prisoners arrived in this morning & the monitors off the coast have been trailing up the retreating Turks all the morning. The enemy have received a most severe defeat & I do not think they will ever attempt another attack upon the Canal. It was a most interesting and exciting battle, being all open fighting. The","192":" L.H. Brigade had about 230 casualties all told. Colin Smith had his arm broken by a machine gun bullet & is now in hospital. He should get a good trip to England out of it. Thus I am now the only one left in the Regt out of our old section which had kept together for over twelve months.\n","193":"\nThe total number of prisoners taken at the Battle of Romani & the two following days is now estimated at\n\n6000 men. Left tonight on a camel; escort to Ogratina.\n","194":"\nThe Anzac mounted division (comprising almost all the Light Horse & a Brigade of New Zealanders), one Brigade of English Yeomanry and \none\n Battery (\nonly\n) of Artillery attacked the Turks at Bir-el-ab at 11 A.M. The fight was very willing & the Turks seemed to have shells to burn, & they killed & wounded a large number of our horses & a fair number of men. By 2 P.M. we had driven the Turks back about 2 miles & at one time were in occupation of Bir-el-ab & amongst some of the Turkish stores. At 2.30 P.M. a retirement was ordered, our artillery having run short of shells & we ourselves not having too much ammunition left. While retiring we were subjected to very heavy machine gun & artillery fire. We had some hundreds killed & wounded today, but we gave the enemy an equally unpleasant time of it, & had they only sent\n\nus plenty of artillery & shells instead of having them lying idle at Romani we should have had the Turks in a bad way. It was a bad day for us, one of our best tent pals poor little Nobbs killed, & another Roger Parbury wounded (not severely). \"Nobby\" died wonderfully game, he was hit in the side by a piece of shell, & also had his arm badly gashed. He was conscious almost till the last & died in the sand-cart as they were taking him in. Just before he died he merely remarked that it was the fortune of war. He was only 21, was an only son, in a family of eight. He was a jolly fine pal in every way, was a very game soldier & being so young it seems awfully sad that he should be killed.\n","195":"\nThe Turks last nigt retired to a position about 4 miles beyond Bir-el-ab & we entered the oasis early in the morning. Sixteen guns arrived at Ogratina today from Romani. We hear that a force of\n\nmarines & other British troops have landed at El Arish, the object being to cut the Turks off. It will no doubt be our work to harass the enemy as much as possible while he remains near here, however owing to the lack of water for horses & men & the distance the Turks are away from our base (25 miles), it is impossible to do much, only mounted men can be employed against the enemy across the Desert.\n","196":"\nAll the mounted troops engaged in harassing the enemy near Bir-el-ab returned today to their respective camps, the Turks having left this district & gone further South. We (the","197":" Brigade) are leaving here tomorrow & going to a place somewhere near Ismailia. Our duties there should be fairly light probably patrolling the Canal. The Brigade is badly in need of a rest, we having been over seven months more or less in the Desert\n\n\n& our three months here have been very severe on men & horses. Six cases of Cholera have been reported, it looks as thought the Germans have been putting germs into some of our wells further out.\n","198":"\nWas innoculated today for Cholera.\n","199":"\nThis afternoon the Brigade was addressed by Major General Cheval, who thanked the Brigade for the fine work done during the past three weeks. From what he says it seems they intend to give this Brigade a rest, but we are not to go away from Romani, & shall be given leave to Port Said only, hence much disappointment in the camp.\n","200":"\n\"A\" Squadron went to Mehomedich & spent a very good day in the surf. Six of us procured a case of sherry, & there were great wrestling combats in the water. One Squadron from the Reg. is now to go to Mehomedich every day so that our turn should arrive every third day.\n","201":"\nI have been the mounted orderly to the Camp Commandant at Rail Head for the past three days. About another 100 Turkish prisoners were brought in here during the past few days. They were captured out from Bir-el-ab & were in a bad way generally.\n","202":"\nDetails of Battle of Romani (Official)\nEstimated Enemy Force - including artillery & engineers - 18000 Rifles\n\n3 Battalions 3000 strong each took part in rearguard action at Bir-el-ab on 9th inst.\n\nEnemy Losses:-\nPrisoners in hand including 49 officers = 3930\nKilled & buried by us = 1251\nGermans = 25\nWounded, Killed, & buried by enemy = \n4000\nApprox Total = 9206\n\nOur Losses:-\nKilled = 202\nWounded = 882\nMissing = \n 46\nTotal = 1130 \n\nCaptured from Turks:-\n4 Mounted Btry Guns, Complete with 400 rounds per gun.\n9 German Machine Guns\n2300 Rifles\n1,000,000 Rds S.A. Ammunition\n25 Sets Mtn. Btry Pack Saddlery\n160 Ordinary Packs\n1 Aeroplane, 3 Petrol Tanks\n100 Mules & Horses\n500 Camels\n2 Complete Field Hospitals\n","203":"\nHave been getting some good swimming every second day at the beach lately.\nGot fifty hours leave commencing from this morning. Left Mehomedich 0900 & arrived Port Said about 11 15. Colin Smith whom I came up chiefly to\n\n\nsee has gone to No 3 Gen. Cairo. Took some interesting photos today including the Statue of De Lesseps, the French Engineer of the canal. Brought up a Turkish rifle & other souvenirs of the Battle of Romani but I'm afraid I shall have trouble in either getting them stored or sent home.\nPort Said was raided early this morning by three Taubes, 3 soldiers & 6 natives were killed.\n\n"}}