{"Document Name":{"0":"Diary_0432","1":"Diary_0432","2":"Diary_0432","3":"Diary_0432","4":"Diary_0432","5":"Diary_0432","6":"Diary_0432","7":"Diary_0432","8":"Diary_0432","9":"Diary_0432","10":"Diary_0432","11":"Diary_0432","12":"Diary_0432","13":"Diary_0432","14":"Diary_0432","15":"Diary_0432","16":"Diary_0432","17":"Diary_0432","18":"Diary_0432","19":"Diary_0432","20":"Diary_0432","21":"Diary_0432","22":"Diary_0432","23":"Diary_0432","24":"Diary_0432","25":"Diary_0432","26":"Diary_0432","27":"Diary_0432","28":"Diary_0432","29":"Diary_0432","30":"Diary_0432","31":"Diary_0432","32":"Diary_0432","33":"Diary_0432","34":"Diary_0432","35":"Diary_0432","36":"Diary_0432","37":"Diary_0432","38":"Diary_0432","39":"Diary_0432","40":"Diary_0432","41":"Diary_0432","42":"Diary_0432","43":"Diary_0432","44":"Diary_0432","45":"Diary_0432","46":"Diary_0432","47":"Diary_0432","48":"Diary_0432","49":"Diary_0432","50":"Diary_0432","51":"Diary_0432","52":"Diary_0432","53":"Diary_0432","54":"Diary_0432","55":"Diary_0432","56":"Diary_0432","57":"Diary_0432","58":"Diary_0432","59":"Diary_0432","60":"Diary_0432","61":"Diary_0432","62":"Diary_0432","63":"Diary_0432","64":"Diary_0432","65":"Diary_0432","66":"Diary_0432","67":"Diary_0432","68":"Diary_0432","69":"Diary_0432","70":"Diary_0432","71":"Diary_0432","72":"Diary_0432","73":"Diary_0432","74":"Diary_0432","75":"Diary_0432","76":"Diary_0432","77":"Diary_0432","78":"Diary_0432","79":"Diary_0432","80":"Diary_0432","81":"Diary_0432","82":"Diary_0432","83":"Diary_0432","84":"Diary_0432","85":"Diary_0432","86":"Diary_0432","87":"Diary_0432","88":"Diary_0432","89":"Diary_0432","90":"Diary_0432","91":"Diary_0432","92":"Diary_0432","93":"Diary_0432","94":"Diary_0432","95":"Diary_0432","96":"Diary_0432","97":"Diary_0432","98":"Diary_0432","99":"Diary_0432","100":"Diary_0432"},"Date":{"0":"unknown","1":976.0,"2":977.0,"3":978.0,"4":979.0,"5":980.0,"6":981.0,"7":982.0,"8":983.0,"9":984.0,"10":985.0,"11":986.0,"12":987.0,"13":988.0,"14":989.0,"15":990.0,"16":991.0,"17":992.0,"18":993.0,"19":994.0,"20":995.0,"21":996.0,"22":997.0,"23":998.0,"24":999.0,"25":1000.0,"26":1001.0,"27":1002.0,"28":1003.0,"29":1004.0,"30":1005.0,"31":1006.0,"32":1007.0,"33":1008.0,"34":1009.0,"35":1010.0,"36":1011.0,"37":1012.0,"38":1013.0,"39":1014.0,"40":1015.0,"41":1016.0,"42":1017.0,"43":1018.0,"44":1019.0,"45":1020.0,"46":1021.0,"47":1022.0,"48":1023.0,"49":1024.0,"50":1025.0,"51":1026.0,"52":1027.0,"53":1028.0,"54":1029.0,"55":1030.0,"56":1031.0,"57":1032.0,"58":1033.0,"59":1034.0,"60":1035.0,"61":1036.0,"62":1037.0,"63":1038.0,"64":1039.0,"65":1040.0,"66":1041.0,"67":1042.0,"68":1043.0,"69":1044.0,"70":1045.0,"71":1046.0,"72":1047.0,"73":1048.0,"74":1049.0,"75":1050.0,"76":1051.0,"77":1052.0,"78":1053.0,"79":1054.0,"80":1055.0,"81":1056.0,"82":1057.0,"83":1058.0,"84":1059.0,"85":1060.0,"86":1061.0,"87":1062.0,"88":1063.0,"89":1064.0,"90":1065.0,"91":1066.0,"92":1067.0,"93":1068.0,"94":1069.0,"95":1070.0,"96":1071.0,"97":1072.0,"98":1073.0,"99":1074.0,"100":1075.0},"Entry":{"0":"\n\n","1":"\n\nWed 16th\n\nHad a very quiet time today nothing to do except the general routine of stables etc. Good war news from all fronts, but we are not likely to be troubled in this part of the world again; James received a letter from Nelson today saying he was doing well, & we have heard that Sgt Selff has died as the result of his wounds from August 4th \n\n5 Signallers names were sent in today to go to the School of Instruction at Zietoun; 50 men from this Regt can get leave for 48 hours to visit Port Said\n","2":"\n\nThurs 17th\n\nMajor Granville called me up this morning & said he had recommended me for a Commission in the Infantry, also for a Com in this Rgt as Signalling Officer & asked me if I wanted to withdraw my application for the Infantry & wait for a Commission here, I told him to leave both in & I would take the first to come along; Sgt Maj Frost (B Sqd) was up today for assaulting the Interpreter but got out of it; Sig Cpl Bassan is to be Court Martialled for taking a Prismatic Compass off a dead Officer at Hamisich a few weeks ago & not handing it in, On account of the outbreak of Cholera all leave to Port Said has been stopped, it is stated that tubes have been found addressed\n\n17.8.16\n\nto a German Med. Officer who was here, containing Cholera germs & every precaution is being taken to counteract the attack, all the Med. Officers were called together today to hold a consultation. A concert in the YMCA tonight went off very well & there was a good number of Scotch Artists present & large attendance of both Scottish & Australian soldiers.\n","3":"\n\nFri 18th\n\nSeveral fresh cases of Cholera were reported this morning & we had to rinse all our waterbottles out with hot water disinfected. B Sqdn went to the beach swimming today & put the day in there, a AIF wet Canteen is being erected close by the YMCA. Nothing but the usual routine of work\n","4":"\n\nSat 19th\n\nC Sqdn went on a swimming parade today & a good many of Head Quarters went with them, Aeroplanes are rarely seen around here now quite different to what it was before the Turks came, the enemy planes only come as far as Qatia & they have been dropping bombs & arrows there every morning; The Infantry have camps at all the Hods to Bir-El-Abd & I believe the 3rd Bde of Light Horse are camped at Bebabis we have no scarcity of camels for transports as we are using all captured from the Turks, it is said all the guns & ammunition captured was send to Belgium\n","5":"\n\nSun 20th\n\nA Sqdn went on swimming parade today, & at 9 oclock Ted Mills & I also decided to go & it was well worth the 5 mile ride \n\nMahomediah is a picture the Hospitals are on the Beach within a few yards of the sea off which a cool breeze is constantly blowing, & it looks like a small town with electric engines running on the line to Railhead; At Railhead a party of Tommies are kept busy all day filling thousands of Fantasses which are brought empty & taken away full by a constant stream of Egyptians & Indian Camel transports, all the Indians are armed but no Egyptian is allowed to carry any weapons;\n\nAn Armored Train is also at\n\n20.8.16\n\nRailhead, her principal armaments consists of two Pom Poms & Lewis guns fired through port holes; After having a swim, also swimming our horses we had dinner & arrived back in Camp at 3 oclock this afternoon; \n\n65 famished Turks came in to Bir-El-Abd & gave them selves up this morning; Gen Chauval who commands the Anzac Mounted Division, has made complaints against Gen Lawrence for not getting the English Infantry up in time to capture all the Turks during the recent fighting, we knew they had some words over it on the field, & now hear Chauval is not letting it drop; A good many lads are suffering with a touch of dysentery, but cases are sent to hospital, as they are frightened of Cholera\n","6":"\n\nMon 21st\n\nHad a bad time myself last night from diarrhoea was on the go all night & and there is a large parade (sick) this morning, I have been feeling very sick all day & have done nothing by lay about doing nothing; Our horses are being inoculated against glanders today; The troops around Bir-El-Abd have been busy lately digging up all the Turkish graves & have recovered it is asserted over 1,000,000 rounds. The Turks dumped the ammunition in a hole & then put a layer of sand then a dead body & then filled it in. \n\nA few more Turks came in today in an exhausted condition they arrived in camp tonight. \n\nB Sqdn went on swimming parade this morning\n","7":"\n\nTues 22nd\n\nA wet Canteen has been erected by the YMCA & was opened today & good many of the lads are rather merry tonight in consequence; We went over to the Field Amb. again this afternoon for our second innoculation against Cholera, I have been feeling very sick today but am better tonight we had a visitor from the 6th L.H tonight & had rather a gay time here, nearly every tent in the Regt has some Scottish lads in it tonight as our chaps have been rather free & easy today & made pals with the Scots at the Canteen; Mergha Mac went away to hospital a couple of days ago he had been drinking very heavy for some days\n","8":"\n\nWed 23rd\n\nI broke the plate of my teeth last Sunday & had to go to the Field Amb again today to have impressions taken; A party of 6 men & Sergt Bernie was sent out at 6 oclock this morning with pack horses to bring in more ammunition that has been dug up; All bad cases of diarrhoea are sent to a quarantine camp near Quatia, only 2 men of the 10th Light Horse died there & both these refused to be inoculated\n\nmen are getting well & the Cholera scare is over. The aeroplanes report that all the Turkish troops have evacuated El-Arish \n\nsome boxing tonight amongst the lads\n","9":"\n\nThurs 24th\n\nOn account of our horses being innoculated against glanders we were not allowed to ride them yesterday, today a party from B & C Sqdn went swimming; Got my teeth back from the dentists this afternoon; Last night Ted Oates & Maybury came over & paid me a visit, it is rumoured we are to go to Bir-El-Abd at the end of this month to relieve the 3rd Brigade, \n\na concert was held in the YMCA tonight & was one of the best I have heard;\n\nRenaldi was sent into Port Said a few days ago to get goods for the Officers mess & was held there on account of Cholera, but managed to get back today.\n","10":"\n\nFri 25th\n\nFeeling off color again this morning but was not bad long. A swimming party went to Mahomediah again today. A young Catholic Padre turned up here a day or two & occasionally drops on for a chat. Maj Granvilles promotion to Temp. Lieut Col. came out in orders today. It is Capt Whites birthday today & some officers from the 6th & 7th Regts have come over tonight & are celebrating it, & by the noise they are making they must be having a good time; some of our lads have full Scottish uniforms packed away now; the two Jeffreys went away to a Scottish Camp to look for beer, & got too drunk to come home, but they turned up tonight OK.\n","11":"\n\nSat 26th\n\nAs Brig. General Cox came back from England today Col Meredith has once again taken command of the 1st Regt. at stables this afternoon Cox inspected the horses & men, I handed in all the Begbie Signalling Lamps today & are to be issued with Electric Sig Lamps tomorrow,\n\nnothing out of the ordinary happened today\n","12":"\n\nSat 27th\n\nNo Church parade this morn held tonight instead & had a good congregation; Both Jeffries are still on the spree and put under open arrest tonight, Frank was on day stableman & is being wheeled for leaving the lines I can see no charge against Fred, & as he was transferred to C Sqd yesterday he does not affect me\n","13":"\n\nMon 28th\n\nHad some lamp practice last night; Neither of the Jeffries were tried today & I think Freds case must fall through, the Adj gave orders to place both under arrest, & he cannot find a charge against Fred as he was in the vicinity of the Camp all day yesterday & altho’ he was merry was far from drunk, Capt White (Adj) has been waiting to catch both of them.\n\nIt is said that we are going to \n Sity \n Sidi Beach (Alexandria) for a few days spell in batches shortly, but we hear so many rumors we cannot take any notice of them; had some more Lamp practice again tonight, & have orders for a 5.30 reveille every morning & have to do 1 hours drill\n","14":"\n\nTues 29th\n\nReveille at 5.50 this morning & had musketry from 6 till 7 then stables & breakfast at 8 oclock. Frank Jeffreys was reprimanded this morning by Major Granville for being drunk & leaving the lines but no charge was put against him, he is Major Granvilles groom, & it is not an uncommon thing for them to be both drunk at the same time & when they are they are both on the same level & Jeffreys tells the Major what he thinks of the Officers (Granny included) & says when the Officers stop drinking he will & it generally ends up in a wordy argument, \n argument\n but the Major never crimes him & it is quite comical if one is handy enough to hear the arguments, Jeffreys would\n\n29.8.16\n\nhave been sent back as an undesirable when we first came to Egypt the only thing that saved him was his fine horsemanship but he was continually crimed till at last Colonel Meredith got tired of punishing him & one morning when Jeffries was up before him he said; now, look here Jeffries you’re a good man with a lot of failings & as punishing does not seem to make any difference. I am not going to punish you any more & I will see what kindness will do, & Jeff has not been crimed since & although he still gets on the spree occasionally he is not near as bad as he was, & is one of the best men in the Regt where there is anything doing; \n\nWe have been getting good\n\n29.8.16\n\nwar news lately. heard today that a Division of Greeks refused to retire from the Bulgarians & were fighting. also heard tonight that Roumania had declared war on Austria & if this is right the end of the war cannot be far off. I am giving all the Signallers Lamp practice every night now; Today we were issued with a tin of Melon & Lemon jam for a change, it is the first time we have not had marmalade since we have been here; \n\nSwimming parties go to Mahomediah every day but I always have a few odd jobs during the day to attend to & cannot very well get away but believe we are to have a few days at Sidi Beach (Alexandria) shortly & will ‘be’ able to get plenty there\n","15":"\n\nWed 30th\n\nWent over to the YMCA tonight & received the surprise of my life when I saw Mr James YMCA Sec come hobbling along with an American who speaks like a Yank & is attached to the YMCA in the Ezbekieh Gardens (Cairo) & as James took French leave to visit us before he went to England & the Yank came with him, James received a great reception here & was kept busy till a late hour as he brought all the latest news from the Aus Gen Hosp. (3rd) at Cairo, of the lads who were wounded here; We have decided to go over the battlefield tomorrow morning, but I think James is foolish to do much work yet as his leg is far from well, it is rumored tonight that our trip to Alexandria is off\n","16":"\n\nAt 8 oclock this morning Mr James Mr Baker (The Yank) Jimmy Leask; two lads from the 2nd Regt & myself went over Mt Royston & Meredith, & over a large part of the country where we were fighting. James & Baker were collecting trophies & taking photos of graves dead camels etc. We had a spell in a Hod & found plenty of the dates ripe & had a feast on them had our photos taken in various positions & had a very enjoyable morning arriving back in Camp soon after mid day; James & Baker returned to Cairo on the 4 oclock train this afternoon.\n\nThe Concert tonight in the YMCA turned out to be the best we have yet had, leave to Port Said is to be granted to 4 men from HQ. & 6 from each Squadron\n","17":"\n\nFri 1st\n\nLindsell, Elliott, Wride & Ingham went into Port Said on the 8 oclock train this morning on leave; Nothing of any consequence happened today. I have all the Sqdn Sig working on the phone now; Bassans Court Martial came off today & has been postponed till tomorrow. I heard today that Sergt Sutherland (Bde H.Q.) has also applied for Sig Officer to this Regt. & as Col Meredith left yesterday & is on his way to Australia on leave I am not too confident of getting it although Major Granville is doing all he can to get me the Commission\n\nWe are pretty busy here as we have lamp practice every night. 5 Enemy planes bombed Port Said yesterday & I believe a couple of them were brought down\n","18":"\n\nSat 2nd\n\n4 more men were sent away for leave today but owing to a breakdown on the line the men had to wait a Railhead till mid-day for a train instead of leaving at 8 oclock; Mr James returned from Cairo today & said Nelson & Smithers both left for England yesterday We have only 3 Sigs & one Cpl (Sig) left in the Regt today as Law got leave & Nelson &Locke left today to proceed to School of Instruction \n\nBassan’s court martial was continued today but we have not got the verdict yet. I am taking a shift on the ‘phone from 8 till 12 tonight; & applied last night for leave to Port Said tomorrow. James sent a cable home for me from Cairo.\n","19":"\n\nSun 3rd\n\nThis morning R.S M. Mc Keown Sgt Laney & I rode to Mahomedia & caught the 9 oclock train to Port Said. the line is only a small one & we dropped the sides of the truck & let our feet dangle within a few inches of the ground but as we were crossing some points about half way to Port Said one of the lads was pulled off but was not hurt & we continued our journey – after putting the sides of the trucks up, it was a rather rough journey as we were packed in as close as it was possible to get; the sea was within a few yards of us on out right all the way down & sand & salt lakes on our left. We arrived at Port Said after mid day & there was a rush for boats to get us across the Canal & we.\n\n3.9.16\n\nmade the mistake of taking things easy, as we found the Continental, Royal & Hotel De La Poste all filled up, but we managed to secure beds at the New Britain & had our meals at the Continental, as soon as we had finished lunch we decided to visit the Hospital & see a few of the wounded men who are there but found when we got across that the Hospital is in quarantine as another case or two of cholera had broken out in it, so we engaged a cab for the afternoon & put the time in driving around sightseeing & ended with a walk along the break-water & then to the Continental for dinner then had a walk around the town, & then I found my way back to the Britain & ready for bed at 8.30.\n","20":"\n\nMon 4th\n\nRose this morning at 6 oclock had a cup of coffee & bread & butter while dressing; had my boots and leggings cleaned & then strolled round to the Continental, had breakfast at 7.30 & arranged for a room for McKeown, Laney & myself for tonight, as soon as we had finished breakfast we took a walk down to the beach & had a hours swim then fresh water shower, & a cup of tea and cake at the Empire Club run by Aust. Ladies on the leach & it is a treat to have them there & everything very reasonable; Arrived at the Continental for lunch & then drove to a photographers & had some post Card photos taken \n\nCpl Lumb A.M.C joined us at dinner\n\n4.9.16\n\ntime as he came down today, we had our photos taken separately & then in a group; Then we drove down to the Beach & put in an hour or two there, snapped a Soudanese Coast guard, had refreshments & then back for tea; I forgot to say yesterday afternoon we put in a hour looking over the Jupiter (warboat); After dinner tonight we took a walk around the town & bought a melon (sugar) & at 9.30 went to the Cinema, & the pictures were very good & were going till 11.30, we then made back to out room made a hole in the melon & were ready for bed by midnight; Everything is very dear here 3\/- for bed & 3\/- for each meal\n\n4.9.16\n\na cup of tea & bread & butter cost 1\/3 & every thing else equally as dear; I was surprised to hear that Les Smithers left for Australia on the Escanius, Col Meredith was in change of the wounded men returning & Nelson is also with them.\n","21":"\n\nTue 5th\n\nRose this morning at 5 oclock went across the road & had a feed of ham & eggs & as we were crossing the Canal a sea plane came out right in front of us & we had a great view of her rising off the water; the train left at 7 oclock but about half way back to Mahomedia we had to wait for a train coming into Port Said to pass us & as we\n\nhad to wait for some time, a good many of the lads went in for a swim, it was 12 oclock before we got to Mahommedah & we rode the horses back to Camp that the men going on leave rode over; we arrived back in Camp after having a very enjoyable holiday; \nMajor\n Col. Granville received leave to visit Cairo yesterday & just managed to get through in time as no one is allowed to go any further than Port Said from here now on account of a case or two of Cholera breaking out in the Hospital at Port Said, Ireland has overstayed his leave & is to be put under arrest when he returns\n","22":"\n\nWed 6th\n\nYesterday morning a Sqdn of our aeroplanes dropped 96 bombs on Maghara where the Turks now have their Head Quarters; Palm bushes have been placed around the tops of all the Infantry tents here as our aeronauts say tents with a few bushes placed on them are invisible & cannot be picked up from the air; I went to the YMCA tonight to have a yarn with the Sec (Mr Velvin);\n","23":"\n\nThurs 7th\n\nHad a letter from Ted Edwards today saying he is in the detail Camp at Moascar & wants to rejoin Regt; As I could not get anyone to apply for leave, Ted Mills &\n\nI put in for leave again last night; A Concert was held as usual in the YMCA tonight & was very good; a lad in the 6th Regt got in with some Infantry going to France some time ago, reported when he got there was sent back here under arrest & was awaiting his Court Martial when the Turks attacked us, he asked to be allowed join in the fight & was refused, so he broke away from Camp & went out on foot & done some marvellous work bringing wounded men from firing line to the Ambulances, he was bringing his sixteenth man in when he was killed, he has since been recommended for the V.C. he won the DCM on Gallipoli\n","24":"\n\nFri 8th\n\nReceived our passes this morning & rode to Mahomedah. the train left at 9.30 & we got to Port Said soon after midday, had lunch at the Continental then took a walk down to the Empire Club, & tea, bread, Butter & Cakes here, & at sundown walked out along the breakwater, put in half an hour yarning to some old gentleman fishing there & got back just in time for the finish of a game of water polo played by two teams off the French cruiser Porthieu, & got back to the picture show just in time for the 6.30 to 9 performance, but it was rather stale to me as I had seen them a few nights ago & the same pictures were being screened, got to bed at the Continental at 9.30\n","25":"\n\nSat 9th\n\nI slept in this morning till 7 oclock, & then went down to the beach for a dip in the surf before breakfast. after breakfast we went to he photographers to see if our photos were finished & found they were not, & put in till dinner time driving around; had dinner at the Continental & went into a billiard Saloon for a game soon after & I received the surprise of my life when Morgan Welch walked in as I had no idea he was in Port Said on Police duty, heard from him that Arthur was in England (Salisbury Plains) & as he was with two friends, who he was showing around, we made an appointment to meet at 7 oclock at the Continental, after we had finished\n\nplaying billiards we went to the Empire Club once more & had tea & out on to the breakwater again, met the old gentleman fishing again & came back to town with him, & had a drink of coffee, arrived at the Continental at 7 oclock met Morgan & his friends & put in till 9.30 walking about the town seeing where the bombs were dropped during the air raid on Port Said & eating fruit which is very cheap at the markets; at 9.30 Mills & Morgans friends decided to see the late picture show as a new programme was on & Morgan & I had a cup of coffee & then went back to barracks where he is stationed. Morgan then came back to the Continental with me; Morgan looks better than I have ever seen him looking & is trying to get in a L.H. Regt.\n","26":"\n\nSun 10th\n\nRose this morning at 5.30 & had a feed of ham & eggs & caught the train at 7 oclock back to Camp. we had only got half way back when on account of a high sea running we found several hundred yards of the line was covered with sand & the water running over the line; while a working party was building the line up we undressed & had a very enjoyable dip in the surf, we had to run back a mile onto a loop to allow the train bringing the men on leave to pass us, it was 2.30 before we got to Mahamadiar & 4 oclock when we got back to Camp; \n\nLeave in the 2nd Bde has stopped from today & they go out to Bir-El-Abd tomorrow to do patrol work\n","27":"\n\nMon 11th \n\nThe railway now runs to Debabis & Infantry troops are on the move going out, a strong rumor is circulating that 3,000 Turks are at Bir-El-Salmana & we shall be going out shortly to try and hunt them out; The Camel Corps are stationed to the South of us & are to be the advance guard when we attack; Daily parade are now held from 9.30 to 11 AM & from 2.30 to 4 PM. I am giving the Sigs buzzer work during the day time & flag a lamp practice after tea. All leave to Port Said is stopped from today & the line along the coast is washed away, & the men have to return through Kantara.\n\n12.9.16\n\nTue 12th\n\nThe 2nd Brigade pulled their tents down today as they are to remain at Bir-El-Abd for some time; The Colonel called me up today & told me he was very sorry to have to say that Sergt Sutherland was getting the Commission in this Regt as Sig Officer he said the Brig promised him to give me the first vacancy in the 2nd or 3rd Regt; \n\nthe Regt had a Mounted Parade today but the Sig did not have to go but carried on as usual. I received a letter from Ted Edwards yesterday wanting to be claimed back to the Regt. he is OK again & in Details\n","28":"\n\nWed 13th\n\nSig Cpl Bassan & Tpr Hastie was up at the Orderly Room again this morning to receive sentence as they were found guilty of receiving stolen property from Lieut Pearce whom they found dead at Bir-El-Hamisieh. the article they were tried on was a prismatic Compass, Bassan sentence was to be reduced to the ranks & 60 days hard labor & Hastie 80 days No 2 Field punishment; Col Granville has appealed against it & much indignation is shown by everyone in the Regt & General Lawrence will be a wise man if he keeps well away from this Regt unless he wants to be counted out. Everyone is very dissatisfied in being attached to an English Division & the Officers are cursing if anything\n\n13.9.16\n\nmore than the men; Lieut Moore is also on trial today by Gen Field. Court Martial he is being tried on the same charge as Bassan & Hastie;\n\nA good deal of gambling goes on here & a spot between this Regt & the 2nd is known as Monte Carlo, as lads meet there from everywhere every evening & two-up is in full swing till all hours of the night. A crown & anchor board does a good trade by the A.I.F. \n but was raided\n but it was raided last night by the Military Police who took the board & about £ 8 that was on it; The men who owned the board are late reinforcements arriving here on the 3rd of August (on of the Coo-ees)\n\nAt Tel-El-Kebir about 100 men are there who appear to be attached to nothing & are\n","29":"\n\nKnown as the \"neutrals\" & are a fine collection of \"take downs\" one lad there a few months ago discovered one of the Neutrals using a double headed penny & was kicked about so badly for making the discovery that he died next day; \n\nThe Dr has been giving demonstrations today of how to carry a wounded man on horseback & we had the usual parade\n","30":"\n\nThurs 14th\n\nYesterday afternoon an Austrian Officer was brought from Bir-El-Abd, he had given himself up to our patrols, Turks are coming in daily & the Austrian Officer say the Turks will all surrender as he does not believe any of them will fight but the majority of the troops\n\nthere are Bedouins who are more anxious to fight then the Turks are;\n\nThis morning Sig Law & I had to attend a board of enquiry & give evidence concerning Sig Richardson & Tpr Roberts who have been missing since August 4th; We expected to go out on a stunt tonight but it has been postponed till tomorrow night. Went over to Bde Head Qrs this evening to see about a ‘phone to take out with us. It is asserted there are 3,000 Turks at Bir-El-Mazar which is 25 miles West of El Arish & 20 miles East pf Bir-El-Salmana The Camel Corps are to attack the Turks who are entrenched & we are in reserves & only go 9 miles East of Salmana; I hardly think this attack will be successful\n","31":"\n\nFri 15th\n\nA shower of stars fell on this Regt this morning as Johnny Keegan, McKeown, Hordern, Guthrie, Gray & Sutherland from Bde Head Qrs came out in orders & are going out on this stunt in charge of Troops. McKeown is Q.M. Sutherland came over from Bde this evening to take charge of the Sigs; the Regt formed up at 6 P.M. & moved off at 6.30\n","32":"\n\nSat 16th\n\nWe travelled all last night & arrived at Bir-El-Abd soon after daylight this morning. unsaddled, fed & watered our horses had breakfast & commenced to make ourselves comfortable for a morning sleep but was not\n\n16.9.16\n\nleft in peace long as soon our battleplane passed over us making west, & shortly afterwards our Bristol Scout also came followed by an enemy plane that was flying between the Bristol & the sun & managed to get quite close, & above the Bristol before she realised she was followed.\n\nthe Bristol was not in a position to fire & the Taube had things all her own way. the Bristol swung around short & tried to climb, but the Taube was too quick & shortly afterwards our plane volplaned down still being fired on by the Taube who then bombed Qatia; We were not troubled after dinner with them & put the afternoon in sleeping. drew rations, water & horse feed this\n\nevening; to-day has been rather hot, but the nights get quite chilly here coming on morning;\n\n17.9.16\n\nSun 17th\n\nRose at midnight last night & left Bir-El-Abd at 1.30 arrived at Hod –El-Salmana at daybreak watered our horses here & pushed on arriving at our destination 18 miles from Bir-El-Abd & 7 from Bir-El-Mazur where the Turks are entrenched at 10 AM. We could hear the Artillery guns banging away all the morning as we came out & at & oclock this afternoon we heard the attack was a failure as the Turks were too strongly entrenched to be driven back; The 2nd & 3rd Brigade attacked & had very few\n\n17.9.16\n\ncasualties, we can hear no news of the Camel Corps who were to attack from the rear & it asserted they were not in the fight; The 2nd & 3rd Bde came back at 3 oclock bringing 19 or 20 prisoners with them these were captured while out on patrol & look fine, strong, healthy young men & were all wearing very good uniforms; We acted as rear guard back to Bir-El-Salmana, where we watered; the 2nd & 3rd Brigades camped here & we pushed on back to Bir-El-Abd arriving here at 10 oclock after a rather trying day as it was very hot & our water soon disappeared. a few drank the well water at Bir Salmana, but I did not care to take the risk of Cholera.\n","33":"\n","34":"\n\nRose at sunrise this morning & left Bir-El-Abd at 9 oclock & and had a good trip to Romani when opposite Oghratina I was given a message to send per helio to Hatib Gannit , so Jock Elliott, Wride & I fell out, but could not raise them & the Brigade has a good lead on us, so we visited a small Hod on the way home & we had a good feed of ripe dates.\n\nwe arrived in soon after the Bde, & fixed the ‘phone up in the Orderly Room, & found the line down & put in an hour repairing it in the dark. It is said that the Camels were unable to travel to Bir-El-Mazar on account of sore feet & did not turn up\n","35":"\n\nTue 19th\n\nWe heard today there there were only 1,000 Turks & 40 machine guns at Bir-El-Mazar & as soon as the fighting commenced the Turks commenced to retire to El Arish leaving only 150 men with machine guns to fight a rear guard action, the 2nd Brigade was depending on a Turkish Sergt who volunteered to lead them into the Camp but the Sergt took them the wrong way & had them lost for some time & it was late when they got into action, it is stated that an enquiry is to be held over the attack, the Camel Corps failing to get around the back of the Turks was the principal cause of the attack failing. The Turks had no Artillery\n","36":"\n\nWed 20th\n\nThis morning the usual leave was granted for men to visit Port Said, but this afternoon an order came through that only men who were not in before were to go. A very popular rumour is afloat that we are going to Zeitoun shortly and are to be issued with swords & lancers & and are to train for cavalry Nothing out of the ordinary happened today & we are living the same old quiet life as we did before the stunt.\n","37":"\n\nThurs 21st\n\nA board of enquiry is sitting today to inquire into the loss of binoculars etc lost in the battle on Aug 4th I was called 4 times this morning to give evidence;\n\nLt Moores Court Martial was also continued today; Jock Elliott (Head Qr Sig) was told to report to Major Lawry this morning to take over from Cpl Bassan; this morning the Sigs had station work & this afternoon I gave them a lecture; A fatigue party has been busy today erecting a Sergeants Mess out of horse shades (canvas) & a meeting of the Committee was held tonight to arrange rules etc.\n","38":"\n\nFri 22nd\n\nHeard today that Lt Moore was honourably acquitted Usual Sig Parade this morning & cleaned our saddles this afternoon. The Adj (Capt White) refused to sign the rules for the Sergeants Mess today as he said that\n\n22.9.16\n\nKings Regulations say the President must be a married man, put in some time tonight fixing up tables, stools etc & it is ready to commence tomorrow. A few Turks still come in occasionally on Camels & give themselves up to the troops on patrol around Salmana\n","39":"\n\nSat 23rd\n\nGot a supply of goods in the Sergeants Mess today & opened it tonight; The Officers went down to the Hod below our camps & had a practice game of cricket this afternoon; they are to play the 2nd L.H Regt next Saturday; Nothing startling happens here lately.\n","40":"\n\nSun 24th\n\nHad a very quiet day there was a Church parade this afternoon but did not go. leave has been stopped to Port Said with the exception of the men allowed to go in for a weeks spell at the Rest Camp & these have to be recommended by the Dr.\n","41":"\n\nMon 25th\n\nWas told confidentially this morning by Sutherland that the 1st L H Bde leave here Thursday morning for Hill 70 & are going to Maadi; \n\nThe Sergts mess is now going strong & it is good to have nothing to do but stroll up to the Mess for meals\n","42":"\n\nTue 26th\n\nSome of the troops have been away from Camp doing musketry lately & this morning Head Qrs had orders to go, we left here at 9.30 & went down with A Sqdn, after we had finished we went down into a Hod & had a good feed of fresh ripe dates & got back to Camp at 1.30 this afternoon.\n\n27.9.17\n\nWed 27th\n\nA muster parade was held at 8.303 this morning at the rear of the Horse lines we were then marched over & the Brigade formed up between the 2nd and 3rd L.H. Lines.\n\nGen Chauvel come on the scene &\n","43":"\n\ntold us were leaving Rom,ani for Kantara tomorrow morning & gave us some good advice Three 2nd L. Horsemen were then decorated for conspicuous service on the Peninsula, one Military Cross and 2 DCM’s; \n\nWe have been kept very busy today preparing to move Chauvel said we were going to Kantara as our horses needed a spell; Camel transports have been busy all the afternoon taking equipment to \nthe\n Railway head.\n","44":"\n\nThurs 28th\n\nReveille this morning at 3 oclock, fed our horses and saddled up, had breakfast & filed off the lines at 4.30 & formed up West of the Camp, stopped for breakfast.\n\n28.9.16\n\nby a large palm grove & we all had a breakfast of fresh ripe dates ; Arrived at Hill 70 soon after midday, watered our horses & came up to a camp just vacated by Tommies with stables, mess huts everything very convenient & comfortable but in the filthiest state I have ever seen a camp & Gen Cox blew up the English Officers (left to hand over) properly & told them they would hear more of it from the G.O.C. \n\nWe have always been very particular when leaving a Camp to leave it perfectly clean & the Tommies who were camped here are going to Romani to take our place there & they may benefit from the example this places looks as though it has not been cleaned for weeks.\n\n28.9.16\n\nI was fortunate enough to get a tent to myself here, I dine in with the R.S.M. Frost, & have mats all over the floor, a table & a bed in my own tent & as I brought a blanket with me from Romani I should be comfortable. We had a decent trip across, & as the day was cool it would have been good only we got a fair amount of dust; put in some hard work at stables this afternoon making some improvement on the horse lines.\n","45":"\n\nFri 29th\n\nReveille at 6 oclock & stables at 6.30 as usual The Regiment fell in at 9.30 on the horse lines & put in till midday stables cleaning up\n\n29.9.16\n\nthe horse lines & on Head Qrs lines alone we Kept 2 Camels & a horse on a sledge carting the manure away. At 2.30 this afternoon we all commenced work again finished cleaning up the lines, pulled down saddle racks that were a disgrace cleaned up the feed heaps etc & were kept hard at it to have the Camp looking respectable by 4 oclock, (afternoon stables) \n\nThe English Army has the name for cleanliness, but they have not been living up to it here & I do not think the horse lines have been cleaned up once since the camp was pitched, even when we were out on stunts\n\n29.9.16\n\nmiles away from any camp we always had to bury any tins etc before we left the ground we camped on overnight, & horse lines & everything else had to be spotlessly clean in Camp\n\n A YMCA & Canteen combined run by Tommies is only a few hundred yards from us\n","46":"\n\nSat 30th\n\nA general parade was held this morning & Colonel Granville read out some Orders from the G.O.C impressing the men on the necessity for saluting Officers the Military Police have had orders to take the names of any men they see who fails to salute an Officer as they pass & O.C’s have had orders to make the punishments\n","47":"\n\nas heavy as possible on offenders so I can see some fun ahead & expect to see all the Australian Troops in this part of the world doing 28 days detention before we are at Kantara long. some more English rot. Apparently the English Generals in command here think they are going to turn us into English Tommies ways through punishment but I fancy they are more likely to strike trouble; Had a little more cleaning up today & now the camp is perfectly clean The 2nd Regt was outputting there horses over hurdles today. they are making a good start to spell their horses, we took ours off & led them around for an hour to exercise them this morning\n","48":"\n\nSun 31st\n\nA Church Parade was held this morning in the YMCA & all men who did not go were put on fatigue, cleaning up etc, General Cox came around & inspected the horses & Camp generally at 10 oclock. a couple of 2nd L.H. Brigade (6th Regt) arrived here today for lunch. they came with the advanced party & are to take over this camp when we leave tomorrow. They say practically every man in the 2nd Brigade got drunk at Romani yesterday, & Gen Chauvel has stopped their leave for 3 months in consequence & today he is going to give them a lecture on several subjects including drunkeness, saluting discipline etc. It was rather comical to hear a lad from the 6th Regt expressing\n\nhis opinion this afternoon on the Light Horses Brigades being turned into fatigue parties to clean up Camps after the Yeomanry had left them & to top matters up an English Tommy rode up dismounted & put his nose bag on his horse filled with the best Australian chaff while our horses who have been doing all the heavy work have not seen the color of chaff since they came to Egypt but are fed on barley straw (Tibbin) We have heard rumors that consignments of chaff have been sent to Egypt from Australia for us, & it would be interesting to know what quantity has been sent, for we know where it goes to this end, it is all reserved for the English troops, our horses\n\nare fed on barley, bran & occasionally a mixture of molasses & straw.\n\n2.10,16\n\nMon 2nd\n\nPut in this morning cleaning up & getting ready to move on, had lunch at 11 oclock & at 11.30 filed off the lines & took our horses down to the troughs watered up & formed up to the West of the troughs put our nose bags on our horses & waited for the 2nd Brigade to arrive, they turned up at 1.30 & we commenced our journey to Kantara, had a very decent trip in & had to wait for some time before we could cross the Canal\n","49":"\n\nas the bridge across was closed to us, as soon as it opened we were very much surprised to see Roy Tancred coming \nRoy\n across in a limber on his way to the Hospital with piles, arrived in Camp before sundown to find our tents up & horselines ready for us & a good meal ready; Quarter Master Sergent Moylan came out in orders tonight as an Officer in the Camel Corps. All the Sergeant Majors & myself were called into the Orderly Room tonight & received a lecture from the Adjutant & I can see some fun ahead as he promised to\n\n2.10.16\n\nto give us revertions, guard room, & everything he could think of if we fail to attain the same standard of efficiency & discipline amongst the troops as we had before we went to Gallipoli & we have to get to work tomorrow & have them springing to it straight off the mark & it is time we were straightened up as everything is very slack, & there is no discipline at all amongst the men.\n","50":"\n\nTue 3rd\n\nReveille at 5.30 this morning, & when we fell in for stables at 6 oclock all the blankets had to be\n\n3.10.16\n\nfolded & neatly packed by the tent door & all our belongings & equipment packed tidy for inspection. the men got out fairly well & there were no complaints today, as soon as the men were dismissed from stables practically all of us made for the Canal & had a dip before breakfast, but as we have only half an hour between ‘stables’ & breakfast, reveille & stables will be 15 minutes earlier in future to give us more time for swimming, parade at 9 oclock, but it was to put the finishing touches on fixing up the Camp\n","51":"\n\nWed 4th\n\nAnother dip this morning before breakfast, mounted parade this morning to exercise our horses & went a couple of miles along the fresh water Canal. The parade this afternoon was to clean saddles; 50 men from this Regt (myself included) go to Sidi Bisha for a week in the Rest Camp; 50 more go on the 7th & 50 on the 9th. busy tonight cleaning leggings boots etc ready to go in;\n","52":"\n\nThurs 5th\n\nCabban came on to Head Qrs this morning to take charge while I am away, left the Camp (mounted) at 8.30\n\n5.10.16\n\nthis morning to ride to the station at Kantara & had a good trip to Sidi Bisha arriving here at 4.30 I slept a good part of the journey as the Sergeants & Warrant Officers had a carriage to ourselves we were not crowded.\n\nOn arrival at the station we were marched into the Camp & orders were read by an English Officer who seems a decent chap (but by rights he should still be at School) it was too late to get passes to visit Alexandria tonight so we went in without after walking a couple of miles we got a carriage & drove to a tram terminus & went in by tram; Sidi Bisha Camp is\n\n5.10.16\n\nabout 8 miles out of Alexandria. went to a French Restaurant for dinner & put in the evening looking around Alexandria in a carriage. Lindsell & Laney were with me. we arrived back in Camp at 10 PM\n","53":"\n\nFri 6th\n\nReveille at 6.30 had a shave, breakfast at 7 oclock then a swim in the surf. were warned not to go in the surf when black flags are flying as the surf is then considered dangerous. the black flags were flying this morning as the sea was a little rough & its was lovely on the surf we were not long in before an English Officer\n\n6.10.16\n\n(about 14 years old) & some Mounted Military police rode up & ordered us to come out we did so after we had finished our swim. we were lucky in getting down early as later in the morning the Military Police started collecting their clothes when they would not come out; A roll call at 6.30 & 12.30 daily has to be answered to see no one is absent we received our passes to Alexandria from 2 PM till 11 PM this pass does us all the time we are here. we were given our passes at 1 oclock & did not wait for lunch but made tracks to catch the first tram, about 50 donkeys were waiting for us & Laney, Lindsell, Bains, Todhunter\n\n6. 10.16\n\nWright & I were lucky enough to catch a donkey each & the first tram had dinner at the French Restaurant put in the afternoon walking the streets & at 8 oclock met Jock Edwards (a friend of Bains) who was doing things in style as he has a motor car engaged for the day. we put in the rest of the night feasting & driving about in the car at 10.30 we dropped Edwards (who is staying the night in town) & broke records in getting back to Camp the road is perfect & as there was no traffic we had a clear run & cut the 8 miles out in 18 minutes, before dismissing the car we arranged for him to be here in Camp \n\n6.10.16\n\nto pick us up at 1 PM tomorrow Bains is a 1st class Warrant Officer in the Ordnance & a character, but Edwards who is a private is one of the hardest seeds I have yet met,\n","54":"\n\nSat 7th\n\nWent down the road this morning & tried another Sergeants Mess as we did not feel satisfied with the one we breakfasted at yesterday & found a slight improvement, had a very rough shave by the same Gippo as we patronised yesterday Went down for a dip the black flag was still flying & we went in amongst some rocks which the Military authorities considered safe but they\n\n7.10.16\n\nconsidered the breakers too rough for surf bathing, but by the time we had finished swimming in the smooth water the black flags were lowered & we went in again in the surf but were warned not to go out above our depth, by the same English Officer who should still be at school, there was not a decent breaker & it was practically swimming in clear water, they treat us as if we were a lot of kids & even in rough weather the surf here cannot be compared to the ordinary surfing at Manly. Our car failed to put in an appearance this afternoon & we went into Alexandria per tram, had dinner at the French\n\n7.10.16\n\nRestaurant. arranged for a car to meet us at the base at 10.30, then went to the Kursaal but found it was about to come out, then went to the Cinema & it finished a few minutes after we arrived, then went into \"The Pops\" till 10.30 it was 10.40 when we got to the base & found Wright & Todhunter had gone out in the car so we had to hire another & got into Camp at 11.30\n","55":"\n\nSun 8th\n\nThe black flag was flying again this morning so we did not go down for a dip; Our car met us at 1 oclock this afternoon & we went to Montasa\n\n8.10.16\n\nHospital to see a few of our lads who are there but when we got to the gate we were held up by a guard as we had no pass to enter the grounds, so we rang up Sister Evans whom we had heard about but had never seen & she got us in, put in a hour yarning with them. went on to Aboukir passing an Aviation School; at the Hotel here we met a Frenchman we knew who was employed in the Russian Bar (Cairo) while we were in Heliopolis, coming back to Alexandria we drove through the Nouza Gardens & it is the best I have even been in, we landed at the French Restaurant for dinner at 7 oclock\n\n8.10.16\n\ndismissed the car with orders to meet us at 10.30 at the base, & then went to the Windsor Hotel played Baines a game of billiards went to the American Kursaal till 10.30 & found it very good. then caught our car & had a glorious ride out along perfect roads\n","56":"\n\nMon 9th\n\nCaught a cold & sore throat yesterday & do not feel too bright this morning slept till dinner time; the car turned up at 1 oclock went to the French Restaurant for lunch done some shopping till it was time to go to a Cinema Show. arranged for the car to meet us\n\n9.10.16\n\nat 11.30 as the Cinema ran on till that time, the pictures were very good; yesterday was the Egyptian Xmas & Alexandria looks rather gay with flags flying & everything decorated up for the occasion. Arrived back at Camp at midnight, previous to going to the Cinema we witnessed a game of hockey on skates between a team from the American & English navies, the Englishmen scoring an easy victory & it is a very exciting game to watch.\n","57":"\n\nTue 10th\n\nBad cold in the head today went in a 1 PM per motor had dinner at the Hotel Bonnard & then went around to the Windsor\n\n10.10.16\n\n& played billiards had a cup of tea & cakes at Groppi’s & had an hours spin in a car to put in time till 9.30 then went to the Kursaal & at 11.30 met our car at the base & came a round about way, back to Camp & enjoyed the spin.\n","58":"\n\nWed 11th\n\nLaney & I went around to see Hop James this morning soon after breakfast & then went to the Orderly Room & got passes from 10 oclock as we wished to go for a spin in the motor Mustafa our driver arrived up to time & we had a trip around pulling up at the Windsor Hotel in time for dinner. had\n\n11.10.16\n\na very quiet time this afternoon & at 9 oclock tonight we caught the motor car & came back to Camp A few American sailors are knocking around Alexandria & they have no trouble to buy an argument but the lads have behaved very well here & I have seen no more than half a dozen lads the worse off for liquor\n","59":"\n\nThurs 12th\n\nCaught the train at 10.30 this morning & had a good trip back to Kantara. I slept the greater part of the journey, we arrived at Kantara at 4.30 & found\n\nhorses there to meet us to ride into Camp; Ted Edwards arrived back here from Moascar today, & Bassans sentence has been suspended & he also came back looking very thin, he says he had a rough time doing hard labour & for 3 days had nothing but bread & water. Cpl Morrice also arrived back today he was wounded on Aug 9th at Bir-El-Abd.\n","60":"\n\nFri 13th\n\nRifle inspection this morning at 9 oclock & then a mounted parade leading horses for exercise, we went up the fresh water Canal a\n\ncouple of miles & had a spell in the shade of the trees getting back to camp in time for stables, put in tonight writing letters. I have a fairly heavy cold which does not seem to improve\n","61":"\n\nSat 14th\n\nWent to the Canal for a dip before breakfast this morning. there was the usual rifle inspection at 9 oclock & mounted parade but I did not go as I had to fix up some lists of requisitions; Men going on leave tomorrow had to record their vote this afternoon to decide whether we are in favor of conscription or not; An appeal from the Premier (Hughes) was\n\n14.10.16\n\nalso distributed, am not feeling too fit on account of cold. the Sergeants have secured a piece of wire netting & are using it as a fishing net. scores of fish from 6 to 10 lbs each are caught in the fresh water Canal daily & we have more fish than we can eat every morning for breakfast.\n","62":"\n\nSun 15th\n\n7 lads frorm Head Qrs went to Sidi Bishr on leave today some of the Sergeants went fishing again today & caught about 2 cwt. A few boats came through the canal & that is all we have to break the monotony but there is some talk of a football match shortly.\n\n15.10.16\n\nPolling day here & the majority of the lads favor conscription but there are a good many against it. Some of the lads, returned from Sidi Bishr today. Wall being the only man for H.Qrs. I still have a heavy cold.\n","63":"\n\nMon 16th\n\nVoting again today otherwise nothing out of the ordinary. have a good deal of work on stables as we have 32 horses on H.Q & only 6 men to look after them a good deal of traffic goes through the canal during the last day or two; It is asserted here now that the Turks have a large force at El-Arish but as this Brigade is now Detached from the Division it is hardly likely we shall be sent out even if El Arish is to be attacked. \n","64":"\n\nTues 17th\n\nAnother party from this Regt went in to Sidi Bishr this morning & no more is to go but about 50 men who have not gone to Sidi Bishr will be able to get leave to go to Port Said Went for a swim in the Canal this morning & did some washing, a launch coming up the Canal with some speed up brought a wave or two along that broke well up the stone sides of the canal & a good many lads who were too low to get their clothes away from the edge had to swim about collecting them after they had gone; Soon after dinner today the Brigade lined along the road & Chauvel drove by in a motor, we cheered him off. he is going to England on 6 months furlough.\n","65":"\n\nWed 18th\n\nMy cold is improving & I swam across the Canal this morning Several of our officers were fishing in the fresh water canal today & had their names taken by one of the Military Police; George Edwards, Guthrie, Wright were amongst them. they have been getting into trouble lately as they as they ran foul of the Military Police in Alexandria & Edwards Knocked one of them out; they had their names taken on that occasion too; Nothing of interest & the same old routine of stables fatigues etc. We are working very short handed on account of the lads being on leave in Alexandria.\n","66":"\n\nThurs 19th\n\nThis morning we were busy erecting a spring board in the Canal; a party of men have also been busy erecting 3ft 6 in hurdles, so we shall be having some amusement shortly, A large passenger boat went through the Canal tonight making for Australia; Today being the second Anniversary of our Embarkation at Sydney was celebrated by the Officers & a good many Sergeants having a \"night out\" Col Granville, Major Irwin & Capt White are away at a School of Instruction learning the Calvary drill; A bombing school is about ½ mile from us & a machine gun school a little higher up the Canal & one would think a war was on to hear the rattle & explosions\n\n20.10.16\n\nFri 20th\n\nThe usual routine of work & a swim again this morning; Heard this afternoon that Lieut Coxall (Sig Officer of 3rd Regt) has been sent to England on furlough & he is not likely to return as he is not wanted here, & that a Troop leader from the 3rd Regt has been sent to the School of Instruction (Zietoun) to be trained as a Sig Officer to take his place; The lads who went to Sidi Bishr on the 13th returned this afternoon McCauley & Quarmby contracted diptheria there & have been sent to hospital.\n","67":"\n","68":"\n\nThe parade this morning was to ‘dubbin’ saddlery & a swim this afternoon. the days are getting much cooler now & shorter; Major Smith called me up tonight saying that he had a message from the School of Instruction asking if Hargrave would be allowed to go down temporaly as an instructer I advised him to turn it down as he would probably be kept there & Olly says he would rather not go. 80 new remounts came here for the Regt tonight; Passenger boats going through the Canal on their way to Australia makes one envy the people on board.\n","69":"\n\nSun 22nd\n\nReceived 10 more remounts in Head Qrs this morning , & as we are a long way over strength they make a good deal of extra work; This evening more men returned from Sidi Bishr; Lieut Sutherland took bad with Appendicitis yesterday & was send to Hospital. I saddled up a good sort of remount this afternoon to see if it was any good, & she gave me a few lively minutes as she apparently thought she was only an ornament but I managed to come out on top; A couple of football fields are handy to the Camp & a good many lads go down soon after tea practising\n","70":"\n\nMon 23rd\n\nThis morning Jimmy Leask & I took out a couple of remounts to see if they were any good both horse proved to be good ones. Edwards, Locke, & Currey from Head Qrs went on 7 days leave to Port Said today General \nMurray\n Lawrence & Cox inspected the horses & Camp this afternoon Mergha Mack came back to the Regt yesterday & was sent away again this morning on a stretcher. I believe whisky has the best of him; Went over for a game of football this evening & another lad & I collided & has has a lovely headache in consequence\n","71":"\n\nTue 24th\n\nA few of the last lot of lads in Alexandria ran foul of the Military Police & were pinched. they arrived back tonight; RSM. Frost has had hard luck as his Com is expected to come along any day he has a bad septic arm & has been trying to hang on till he received his promotion but has to go away tomorrow unless he wants to lose his arm. he is a cert for Australia as septic sores will not heal in Egypt. I went to Bde Head Qrs today & got some application forms for Commissions but have decided to wait till Colonel Granville comes back from the School before putting them in; Received a nasty kink playing football tonight\n","72":"\n\nWed 25\n\nToday I heard a rumor that we leave here in a week to go out & take part in an attack on El Arish It is also asserted that two or three \"tanks’ have been taken out to past Bir-El-Abd & we are anxious to see them in action\n\nFrost went away today; C \nTroop\n & D Troops of C Sqdn played a drawn game of football this afternoon neither sides scoring. Frank Hobson who is with Bde Head Qrs (grooming) was one of the lads who got into trouble with the Tommy piquet in Alexandria & put in 36 hours in the caracol. The usual swim this morning & nothing but the general routine of work; Every night a passenger boat goes through the Canal\n","73":"\n\nThurs 26th\n\nHave not been feeling too well today; Packed up our kit bags today, only a towel, shirt & two pairs of socks & shaving kit to be kept out to take out with us, a good many think we are going to Upper Egypt, but most of us think it will be the Peninsula (Sinai) again the 2nd Brigade out again today they have been camped at Hill 70 & have been getting leave to Alexandria We were expecting to leave tomorrow but latest reports tonight say we are to stand fast. It is reported that El-Arish has been practically evacuated by the Turks, only about 500 left there now (aeroplane reports)\n","74":"\n\nFri 27th\n\nParaded to the quack this morning & was much relieved when he said it was nothing serious & I would not have to go away; Another football match was played this afternoon between A & B Sqdn, a win for A; applications have been called for, for transfers to R.A.F.C. needless to say a good many applications went in but I did not apply as I am in hopes of a Commission in this Bde before long. tradesmen, clerks etc were called for.\n","75":"\n\nSat 28th\n\nCould faintly hear heavy shelling this morning. probably Monitors up the Coast. It is\n\n28.10.16\n\nconfidently asserted that we shall be in El-Arish for Xmas The 3rd L.H Regt held sports today down on the flat, & 2 teams from the Sqdn played a drawn game of football; Col Granville came back from the School of Instruction this afternoon but is leaving again tonight on the 10 oclock train on a days trip; Major Irwin & Capt White return from School of Instruction tonight Mergha Mack came back to the Camp again this afternoon looking well but do not expect him to last long as the drink appears to have him beat; \n\nI fancy he is only returning so he will hold his seniority he should be due for this third star shortly\n","76":"\n\nSun 29th\n\nThe 3rd Regt had a sports meeting today which opened with a swimming race from the other side of the Canal across to this a distance of 198 yards it was a good race with 9 competitors; then 3 heats for the 100 yards running Championship for the Bde then horse jumping & some good jumping was witnessed with several falls to break the monotony but no damage done, then the final of the running Championship which was won in fine style by a Queenslander & a lad from this Regt ran second; Then the sports were wound up with a long\n\n29.10.16\n\ndistance swimming race, across the Canal & back & the same lad proved a winner again Then a team from the 1st Regt played the machine gun Sqdn football & scored a win (6 to 3) followed by another team from the 1st Regt playing a team from the Field Ambulance, again scoring a win (6-0) Stables this afternoon was postponed till 4.30 in consequence one of the best days sport I have witnessed; There appears to be a good deal of doubt now as to whither we shall leave here or not for a few weeks; The weather is now perfect & we are not at all anxious to get back on to the desert in a hurry\n","77":"\n\nMon 30th\n\nHad two more football matches today with teams from the Regt; Camels arrived today here at Kantara on their way to Bir-El-Abd, they came from Minia (Upper Egypt) more pontoon bridges have been erected across the Canal & a great quantity of railway rails etc have been going out lately, it looks as though there will be something doing about El-Arish very shortly; Another order came through at 4 oclock this afternoon to hold ourselves in readiness to move at any time, but we are still short of a good deal of saddlery to move off complete, as we have been issued with horses but no saddles\n","78":"\n\nTue 31st\n\nAnother mob of Remounts came in today & we managed to get rid of 5 of our horses as we have not the men to ride them & they were sent to the Squadrons. At 3.30 this afternoon we led two horses each from the lines & went round in a large circle marching past Gen. Dobell who was inspecting them then filed on to water had a lively time riding my horse bareback as he roots a bit but I managed to come out on top once again. It seems a certainty that we are going out past Bir-El-Abd the day after tomorrow & we cannot post letters here after 8 oclock tonight.\n","79":"\n\nWed 1st\n\nFeeling pretty bad today on account of the shaking up my pony gave me yesterday afternoon & went to the Dr again this morning & although he assures me I am alright I am far from well, but have decided not to go to him again unless I get worse as he may think I am malingering & he seems to think I am O.K. Received an order through this evening that we are to leave here at 9 oclock tomorrow morning on out trip back into the desert & we have been very busy in consequence & had our last dip in the Suez this afternoon. We are still short of a good many saddles but some may come tonight.\n","80":"\n\nThurs 2nd\n\nFixed up as many make-shifts for bridles as possible this morning, Reveille at 5 oclock struck & rolled tents at 5.15 then stables & breakfast at 6.30 & left the Camp at 9 oclock this morning had to wait for half an hour before we could cross the Canal, soon after we crossed the Canal we passed a barbed wire yard containing Bedouin women & children & a few old men but no signs of a man fit to carry arms they have all joined the Turks long ago; We arrived at Hill 70 & found it deserted, only the sheds remain at Hill 70 we had dinner & came on to Dueidar & camped for the night, not far from the 5 L.H. Regt. I felt crook all the morning, but feeling fairly fit this afternoon\n","81":"\n\nFri 3rd\n\nReveille at 6 oclock this morning & the Brigade moved off at 9 oclock, we were leading the Regt yesterday & last today, stopped for dinner (by the same Hod as we breakfasted at when we were coming in from Romani) at midday & arrived at our old camp at Romani before sundown, we also found Romani deserted at least the part of Romani where we camped \n\nwe bivouaced for the night to the East of the old Camp just above the water trough, tonight Laney & Sergt Scott went to Railhead & came back with £ 2 worth of tinned fish, fruit etc they had a mile march each way & we have a good supply on hand, the weather is cool & we are having a very decent trip\n","82":"\n\nSat 4th\n\nReveille at 6 again this morning had a shower of rain last night & thunder & lightening was heavy & we we expecting a ducking before morning but it did not come & we left Romani at 10 oclock this morning & had a very decent trip to Negiliat arriving at 4 oclock fed our horses, put our horse lines down & made ourselves comfortable & had tea well before dark; It has been cloudy today & looks a little like rain again tonight\n","83":"\n\nSun 5th\n\nHad a heavy shower of rain at 2 oclock this morning we covered our heads over & managed to keep fairly dry although our blankets got wet & they were rolled in bundles at 6 oclock\n\n5.11.16\n\n& loaded on the Camels so we shall have wet blankets to sleep in tonight; We left Negiliat at 8 oclock this morning arriving at Bir-El-Abd at 1 oclock for dinner, we found a little township at Bir-El-Abd & quite a busy centre, Hospital tests YMCA Canteens in plenty. we left Bir-El-Abd at 3 oclock & proceeded to Hod-El-Ge’eila about 5 miles South of Bir-El-Abd & had our lines down well before sundown. This Hod is large enough to hold the whole of the Brigade as soon as we were settled I connected up with Bde HQ with phone; & the Sigs have to run it all night; When we are travelling transport Camels come along with us to carry blankets, signalling gear cooking dixies etc. Have damp blankets to sleep on tonight\n","84":"\n\nMon 6th\n\nEarly this morning an enemy ‘plane came over dropping 6 bombs on Bir-El-Abe Killing 5 & wounding 7 men. horses were sent to Salmana this morning to meet some of the men who came from Kantara on the train; Major Lawry has been left in charge of the Details who came from Moascar to Kantara yesterday; This morning A Sqdn (with Capt White in charge) was sent to Hod Willegha, & a Troop from B Sqdn sent to Bir-El-Geisi; Watson & Sturgeon (a supernumery) went with the troop to Geisi; Lieut Smith (Bde) went out with some of the Sig Troop to connect the lines up, we were connected up with Willegha tonight but the line is not finished to Geisi\n","85":"\n\nTue 7th\n\nReveille at 6 oclock this morning I then saddled Roger up & ready to go to Geisi with Lieut Smith & some of the Sig Troop to fix up the Communications, the mornings are rather cool & Roger very nearly succeeded in putting me on the ground twice before I got him away from the Camp. a large English Camp is between us & Geisi & they are the dizzy limit they have helio. stations every two or three hundred yards & none of them could tell us the names of any of the hills or Hods about them they are 52 Division & we received permission to use their lines as far as they went, this saved us two to three miles of wire laying\n\n7.11.16\n\nwe had the line finished to Geisi by mid-day & connected up We found a steep sand hill here very high, (an ideal Sig Station) & found Watson in touch with stations in every direction. New Zealanders in front, Tommies & our own troops on the flanks & rear; I received orders to send another Sig out this morning & sent Teddy Mann, & have decided also to send Edwards out tomorrow as there is plenty of work for two good helio. men, & I can see a busy time ahead on this post, we arrived back in Camp tonight before sundown & found a large \n English \n Australian mail waiting for us.\n","86":"\n\nWed 8th\n\nAn inspection of the lines this morning by Gen. Cox & Gen Kater . horses are led out daily & allowed to pick grass & there is fairly good horse feed here in tufts; at 8 oclock tonight a party of twelve men on Camels were seen approaching an Outpost at A Sqdn & when halted they turned & made off S.W. the sentry fired on the, & killed one Camel they were pursued by Mr Moores Troop but they did not catch them, they were Bedouins & apparently came in to Willigha after dates, only a few late dates are obtainable now; I sent Edwards (Sig) out to Geisi today & am teaching 6 more men for ‘phone work.\n","87":"\n\nThurs 9th\n\nThis morning an enemy ‘plane came over again & our Anti Air-Craft guns at Bir-El-Mazar done some exceptionally good shooting apparently doing some damage as the ‘plane dropped her bombs at random & made back over her own lines This morning I fixed up a phone in the CO’s & Adjutants shelters; 12 miles of wire & 6 ‘phones to each Regt was issued yesterday; It is reported that we are to attack the Turks 7 miles this side of El-Arish on the 17th of this month; I brought along a set of gloves with me & they earned some good amusement this evening the ground is hard here in the Hod & good for boxing\n","88":"\n\nFri 10th\n\nElliott came over this morning & took two ‘phones back with him Jack Watson also paid us a visit arrived late this afternoon after tea we went across to the 2nd Regt & had a look at a German ‘phone they are using. had a yarn with Mercer & invited him across for a spar any evening he feels in the humor; I have decided to go out to Geisi tomorrow with Watson as the line is in a pretty bad state & requires a good lot of insulating tape in places, the Regt. has neglected the Regimental war diary during the last month & today the Adjutant (Lt Garbett) borrowed this diary to get some dates & notes\n","89":"\n\nSat 11th\n\nWatson & I left Ge’eila at 7 oclock this morning & proceeded along the line mending it as we went, our journey half completed we were held up by some Tommies who told us to look out for a German spy dressed as an Australian riding a bay horse with a long mane & tail he is carrying maps & tells anyone he meets that he lost the main body while on patrol & is trying to find his camp. we arrived at Geisi for an early dinner & then I rode back on my own & rather enjoyed the ride as the weather is perfect, arrived back in Camp early & had some more boxing after tea, while some of the lads amused themselves kicking a football about\n","90":"\n\nSun 12th\n\nJimmy Leask went to Bir-El-Abd today to see Jim Traill & found he had just received a Commission in the Camel Corps. An enemy ‘plane came over again today flying very high; 12 of our Aeroplane left here yesterday morning & Bar Sheba received the full benefit of the bombs they took out, the aeronauts profess to have made a mess of the enemy aerodromes there; McLaughlin (commonly known as Gin Gin) is batman & groom to Jack Wright (RMS) & keeps us well amused at meal times being one of the hardest doers I have yet met & any arguments that crop up during the day is settled after tea with the gloves\n","91":"\n\nMon 13th\n\nHad a Regimental parade this morning, there was a good deal of amusement caused at dinner time by the despatch rider (Dean) trying to ride my pony down to water bareback, Dean was thrown 4 times, then two other lads decided to ride him but shared the same fate, & Dean walked & led him down. a number of men & horses from details arrived this afternoon. The Artillery a mile or two to the East of us had some practise this morning; \n\nI received a parcel from home today; 8 or 9 aeroplanes coming from Kantara way flew over after sundown tonight & landed at Salmana, Cpl Cabban sent away with rheumatics today\n","92":"\n\nTue 14th\n\nThe ‘planes that came over yesterday left Salmana at midnight & bombed a town near Maghara early this morning, a good many lads are suffering from \ndysentry\n diarrhoea & I have a touch of it myself today Our planes have been very active lately & go out bombing regularly they say they get great targets in Palestine, the aeronauts here are either Australian or New Zealand on this front, Mad Muir (New Zealand) & Mad Roberts (Aus) have the greatest names for dare-devilness Roberts took Capt Hudson (our Bde Capt) up at Kantara just before we came here they went up three thousand feet\n\n14.11.16\n\n& dived two thousand feet towards the earth, Hudson thought his time had come & was looking a bit scared when he descended; Our Avatiors claim to have brought down two Fokkers & destroyed another in a hangar in a raid a few nights ago; Major Lawry came in charge of the remounts from Kantara but returned by train this morning he is in charge of the Detail Camp.\n","93":"\n\nWed 15th\n\nLocke rode Roger out for exercise this morning & managed to ride him after being thrown once; The lads in the Sqdns\n\n15.11.16\n\nreceive a fair amount of work with piquets, patrols, fatigues etc they are kept going fairly constant but it is one of the easiest times I have had; by digging 3 or 4 feet we can get water anywhere here & it was rumored that we are camped on unhealthy ground & should be moving out of the Hod tomorrow but believe a later order says to remain where we are; Edwards was out fixing the ‘phone line from Geisi the night before last & arrested for a German spy by a Tommy patrol, but they did not hold him long as he soon convinced them that he was genuine. Some good boxing took place tonight after tea\n","94":"\n\nThurs 16th\n\nIt is rather exasperating to us hearing of the coal strikes at home. The Sigs at Divisional Head Qrs heard a message in reference to it going through to the enemy on wireless yesterday & they put in the day jamming it. It is a pity they cannot work along without strikes while the war is on\n\nThe usual grazing parades today; & this evening we got word to say we are to move at 9 oclock tomorrow morning & are to go to Willegha about 2 miles from here. busy tonight packing panniers 3 getting ready to move\n","95":"\n\nFri 17th\n\nHad to bustle around today to get the lines cleaned up & ready to move off at 9 oclock arrived at Willegha at 9.30 & found A squadron has a very comfortable Camp; the Hod is only big enough to hold one Sqdn & C Sqdn struck Camp to the East of the Hod & B to the West, The only drawback is, we have to go about half a mile to water our horses; Put this afternoon in erecting shelters & making ourselves comfortable. A Troop of Anzac Mounted Police came along this evening for experience in patrol & Outpost work & they are likely to get it; \nHarold\n Leo Peake is with them, & had a long yarn with him tonight.\n","96":"\n\nSat 18th\n\nLasts night an order came out stating what Squadron was to water first, second & last, nothing was said about Head Qrs, & the R.S.M. told me to get in where I could & if we were first down to the trough we water first; Reveille here at 5 oclock & stables at 5.45, I got the H.Q men away early but they did not go far before Lieut Blackett halted them for a few minutes, & then the Orderly Sergt. stopped them & told them to water after B. Sqdn; Smelt an argument at mid-day stables & decided to go down myself; We were first to water with B Sqdn right on us. the Orderly Sergt (Reid) pulled us up & said we follow B Sqdn, I told him he was out of order & had a very enjoyable\n\n18.11.6\n\nargument with the Orderly Officer (Otton) Lieut Guthrie (B Sqdn) &Reid told them I intended to have an understanding before afternoon stables, arrived back & put in a complaint which meant another argument which resulted in Head Qrs being allowed to file off early & water first always; Here we have a helio station which also acts as an observation post, & all messages from Geisi are sent by helio for practice, we are also in Communication with every station for miles around with ‘phone; Patrols are always out in front during the night. We are guarding the flanks here & there is not much danger as a long dry stretch of Sand dunes are on our left, duty Sqdn stands to arms every morning\n","97":"\n\nSun 19th\n\nA Church parade (C of E & Catholic) was held at 10 oclock this morning. Received word today that things are looking rather serious in Australia, it is asserted that several places in Sydney had narrow escapes from being burnt down the the I.W.W.’s & that all the workers in \nAustralia\n N.S.W. have decided to go on strike if the men who were called up for home defence are not liberated, needless to say practically everyone here is disgusted, & the men in Australia would be flattered if they could only hear a few of the remarks made about them & Patriotic Australia; Innoculated against Cholera again this afternoon\n","98":"\n\nMon 20th\n\nSore arms are fashionable today on account of innoculation; Sergt Browne went to Bir-El-Abd this morning to buy food & brought Mr Frost (AIF Canteen) back with him for dinner; Frost says he will send orders out on camels for us, so we should not be short. Lieut Geo Edwards left here a few days ago with an Abscess in the ear, & we heard that he has died from it. he was a good Officer & very popular; Today we built a wire fence around the Hod, A Sqdn moved out & we put our horses in for the night tying 2 horses to one tree. Sent Cpl Elliott & Sig Collins out to Geisi today as they are getting a good deal of Sig work out there\n","99":"\n\nTues 21st\n\nMuster parade at 9 oclock this morning & rode to Bir-El-Abd & had our blankets & clothes fumigated to kill lice, it was one of the silliest parades we have yet had, as very few if any of the lads here are troubled with them. we arrived back in camp at 3 oclock this afternoon. Roger gave a good exhibition of rooting this morning & got rid of me twice before I beat him; Heard today that we are going out in front in a few days & expect to be fighting by the 29th\n","100":"\n\nWed 22nd\n\nThe Geisi telephone line was taken up today & all work has to come through visual.\n\n22.11.16\n\nwhich means sigs on the hill all night with a lamp This makes the duties on the Sigs pretty hard; Lieut Smith paid us a visit today; We are leaving here the day after tomorrow & anything going by train goes tomorrow; 17,000 French Calvary have landed in Egypt & I believe they are to go Mecca way. Major Smith arrived back & took charge of C. Squadron the day before yesterday Enemy planes are never seen in this part of the world now, & there is no doubt we have the supremacy of the air; Busy tonight packing up our gear ready to load on the Camels at 6.30 AM; R.S.M. Frost came here today with 38 reinforcements, we were all surprised to see him. his arm completely cured\n\n"}}