{"Document Name":{"0":"Diary_0163","1":"Diary_0163","2":"Diary_0163","3":"Diary_0163","4":"Diary_0163","5":"Diary_0163","6":"Diary_0163","7":"Diary_0163","8":"Diary_0163","9":"Diary_0163","10":"Diary_0163","11":"Diary_0163","12":"Diary_0163","13":"Diary_0163","14":"Diary_0163","15":"Diary_0163","16":"Diary_0163","17":"Diary_0163","18":"Diary_0163","19":"Diary_0163","20":"Diary_0163","21":"Diary_0163","22":"Diary_0163","23":"Diary_0163","24":"Diary_0163","25":"Diary_0163","26":"Diary_0163","27":"Diary_0163","28":"Diary_0163","29":"Diary_0163","30":"Diary_0163","31":"Diary_0163","32":"Diary_0163","33":"Diary_0163","34":"Diary_0163","35":"Diary_0163","36":"Diary_0163","37":"Diary_0163","38":"Diary_0163","39":"Diary_0163","40":"Diary_0163","41":"Diary_0163","42":"Diary_0163","43":"Diary_0163","44":"Diary_0163","45":"Diary_0163","46":"Diary_0163","47":"Diary_0163"},"Date":{"0":"unknown","1":359.0,"2":360.0,"3":361.0,"4":362.0,"5":363.0,"6":364.0,"7":365.0,"8":366.0,"9":367.0,"10":368.0,"11":369.0,"12":370.0,"13":371.0,"14":372.0,"15":373.0,"16":374.0,"17":375.0,"18":376.0,"19":377.0,"20":378.0,"21":379.0,"22":380.0,"23":381.0,"24":382.0,"25":383.0,"26":384.0,"27":385.0,"28":386.0,"29":387.0,"30":388.0,"31":389.0,"32":390.0,"33":391.0,"34":392.0,"35":393.0,"36":394.0,"37":396.0,"38":397.0,"39":398.0,"40":399.0,"41":400.0,"42":401.0,"43":402.0,"44":403.0,"45":404.0,"46":405.0,"47":406.0},"Entry":{"0":"\n\nLeft Holsworthy Camp, today ","1":" 7.30 p.m. for Woolloomooloo wharf to embark for active service at the front & raining a treat too travelled till about midnight stopped for about two hours to feed and water our horses arriving at the wharf 7 A.M.","2":" the work of embarking commenced at once we were all aboard by mid-day and left the wharf at 2 P.M. anchored in mid-ocean till next day. sailing at 3 P.M..\n\nThe Suevic a fine boat of 12,500 tons second largest boat, the Ceramic being the largest 18,000 tons carrying the 3rd and 17th battalions, 2,500 men. Our boat the Suevic is fitted up in splendid style. A Squadron horse boxes being on the top deck, B Sq on the mid deck, C Sq. on the lower deck our lot having by far the best position, on the upper deck, plenty of fresh air & more room for exercising. The stalls are just wide enough for a horse to stand comfortably. We have to clean them out every day there being a spare stall to every 8 horses we move them from stall to\n\nstall, muck out we call it, this is all done before breakfast. After breakfast mats are put down and the horses exercised, it is wonderful how quick they get & how soon they get their sea legs.\n\nThen at 10.30 a.m. there is a general inspection by the Colonel after that midday stables 11.30, then dinner 12.30, nothing more to do till 3 P.M.. when we exercise till 4.30 then evening stables & tea at 5.30. After tea we indulge in games of different sorts, throw ball, boxing gloves, single sticks, punching ball ect also plenty of books to read.\n\nOur sleeping and eating quarters are situated right for'ard. A & part of B Sq on the lower deck, C & rest of B Sq on the mid deck, the troops being divided into messes certain number to each table, depends on the size of the table, their are 20 at our table. hammocks are swung over the table, in which we sleep, being taken down every morning folded up & put in a bin made for the purpose, racks overhead where we keep our kits, & a sharp look out one has to keep on them too or you will find a few things short when one comes to look them up.\n\nTwo mess orderlies are appointed every day their duty is to bring all food down & serve it out, & to wash & clean up. Everything is cooked & supplied by the\n\nships company, for breakfast we have porridge & stew sometimes we have fried steak & coffee, for dinner soup, roast meat & vegetable & sometimes pudding, for tea bread & butter & jam, sometimes stewed fruit, so you see we are living a bit better than we did in camp. Once a week we get an issue of fruit (apples) 2 each.\n\nDiary –\n","3":"\nSailed out of Sydney Heads to-day at 3 P.M. We were not out above an hour when a lot of the boys were seasick, some of them were very bad. Bulty & myself are splendid no sign of seasickness.\n","4":"\nStill great weather lovely calm sea, busy day scrubbing & exercising horses. Sighted Green Cape also passed a mail boat going to Sydney.\n\nWe have something over 500 horses on board & nearly 600 men, officers & all.\n","5":"\nOne case of measles reported today, still good weather. We have two 4 in. guns on board, the ships gunners were drilling today.\n","6":"\nNothing of interest today, still the same routine of stables, exercising, washing decks, eating & drinking, ect, just entering the Australian Bight, having a concert tonight.\n\nFriday","7":"\nStill beautiful sea, one of our horses had to be shot to-day & thrown overboard, there is another one will die during the night. Met one of Burrawong Renold's boys to-day, Aubrey Renolds, strange that I never ran across him before considering he is in the same Squadron as myself, C Troop. Our Troop leader Mr Hordern presented each of us with a pipe and tin of tobacco for Xmas present, he also presented the Regiment with a huge Xmas cake.\n","8":"\nNothing of interest.\n","9":"\nAllocated Life-Belts & Boats to-day also positions in which to form up in case of fire.\n","10":"\nAnother horse overboard to-day, expect to be in Albany early in the morning, have caught a slight cold.\n","11":"\nArrived in Albany Bay this morning 6 A.M. Anchored in Albany Bay waiting for the rest of the troopships (& our escort) there are 15 anchored here at present, the smallest 12000 tons and the largest 18000 tons, the Ciranic, the largest boat ever sailed into Sydney Harbour. It is a grand sight to see them all alight in the bay tonight. The Coast is very rough here all Mountains, can's see any sign of the town, posting some letters home today\n","12":"\nStill anchored in Albany, a few of the lads put off today as medically unfit. Some of the boys caught a few fine fish this afternoon.\n","13":"\nNew Year's Eve sailed out of Albany at 9 A.M. a grand sight it was to see the 16 Troopships sailing in one long line, as far as the eye could see. At present we are steering in N.W. direction, where we are going none of us know, the only escort we have seen so far, is a Submarine, but no doubt there are some Cruisers close handy.\n","14":"\nWe had a concert on board to-night, it was a great success. One of the lads on the Persic was consigned to a sailor' grave to-day, we all slacked speed just while he was cast overboard.\n","15":"\nChanged our course again today travelling more north still having a splendid trip.\n","16":"\nNothing of interest.\n","17":"\nBoxing tournament commenced tonight\n","18":"\nNothing of interest.\n","19":"\nNothing of interest\n","20":"\nDead calm, very hot, getting into the tropics\n","21":"\nNothing of interest\n","22":"\nNothing of interest\n","23":"\nNothing of interest\n","24":"\nCrossed the line this morning. 3 P.M. another horse died today\n","25":"\n13 of the boats left us today, going to Colombo, we & the other two White Star boats are going to coal up at Aden.\n","26":"\nPassed two Indian Troopships to-day.\n","27":"\nPassed the Maldive group of islands. Inhabitants are black, we passed quite close. Saw a party of them putting out to sea in their fishing smacks.\n","28":" Nothing of interest.\n","29":" Holding a concert to-night, conducted in first-class style.\n","30":"\nNothing of interest.\n","31":"\nPassed another island today, a very rugged coast.\n","32":"\nThe ship's crew gave a concert to-night and it was splendid, conducted in first-class style, the Ships Doctors assistant was done up as a girl. A lot of us\n\ngot quite a shock, we thought at first that he really was a girl.\n","33":"\nAnchored in Aden today 2 P.M. we are coaling up, expect to be here a couple of days, no sooner anchored than we had a dozens of natives around us selling cigarettes, sweets & fruit, a good deal of the Jew about them too. You can always beat them down in their prices. The town of Aden is built on the side of a great mountain & runs right down to the shore, they have some fine Barracks & several forts on top of the mountain.\n","34":"\nStill taking on coal, niggers all over the boat & a dirty looking lot of wretches they are too, all black labour here. We have been feeding them on bread and eggs today, (the eggs were sent down for our breakfast, but were not too fresh) you would think to see them eat that they had not had a feed for weeks, they divide the food up amongst them pretty well they do not seem to be greedy that way. There was a bit of excitement here early this morning, a gun from one of the forts was fired across the bows of a French mail boat, she did not adhere to some of the harbour rules. She very soon did after the shot was fired, the authorities a very strict\n\nhere. they have a big search-light moving around the harbour all night. It is a very pretty sight by night, all the boats alight, the town of Aden, & the forts on the different Peaks.\n","35":"\nFinished coaling this evening, have moved outside the heads and expect to move off in the morning, are waiting for the rest of the boats that went to Colombo.\n\nOne of the fellows at Aden was telling me that they had rain here the other day for the first time for eleven years. There is a well in Aden supposed to have been put down B.C. & still getting water out of it & some of the reservoirs were built during King Solomon's time.\n","36":"\nArrived in the Red Sea early this morning. All boats slacked speed at 12 noon today during the burial of one of the infantry on the Siramic, happened to see his burial, the boat being just in front of us, they just wrap him up in canvas, put lead in, place him on a plank & slide him into the ocean.\n\nWe have just passed what they call the 12 Apostles in the Red Sea, it is 12 hills in a line.\n\nRumoured that there has been a Turkish warship sighted.\n","37":"\nWe are having a splendid trip trough the Red Sea thanks to the time of the year, not a bit hot. Had a little excitement on deck this morning, I was exercising our Sergeants horse & stopped to groom her; both the Sergeant and I were grooming away when the chain that we have for tying up in the stalls got fast in the crack of one of the deck forms, of course, she pull straight up & away she went around the deck with this form scattering men & horses all directions, however she pulled the halter off & we caught her after a little bit of trouble. First of all she kicked, I was brushing her hind legs when she lashed out knocking off a bit of skin & catching me on the leg, but I was too close to her for her to hurt me. She is a cranky brute all together. However a little incident like that we rather enjoy, it breaks the monotony.\n","38":"\nWe had another concert tonight it was a great success.\n","39":"\nArrived in the Gulf of Suez today 3.30 P.M. Arabian side appears to be all desert, expect to be in the Canal by night. We had a wireless through to say the Turks were along the canal snipering & to\n\ntake all precautions, our Maxim guns have been brought up & barricade put up, & decks all cleared, to give free scope for the two 4 in guns we have on board. The bridge has been barrackcaded.\n\nA boat passed us yesterday which had two bullets marks on her funnel.\n","40":"\nAnchored at Suez this morning 7 A.M., swarms of natives around us selling cigarettes ect. We got some papers today the first since leaving Sydney, there was a rush for them too. Suez is a fair sized town, right at the mouth of the canal. Got Xmas card from Pearl today, had been sent on from Melbourne.\n","41":"\nLeft Suez this morning entering the canal 10 A.M. We are right on the scene of activities now, the 7 Battalion, New Zealand and Indian troops had a scrap with a small party of Turks two night's ago, right here at the mouth of the canal. One begins to see the serious side of the business now. They are splendidly entrenched, barb wire entanglements around each camp. We passed two British Man o' Wars this morning, one in the canal and one just before we entered the Canal, there is just room enough for two boats to pass, being only 100yards wide, one has to be anchored then. The infantry on one of the New Zealand boats have disembarked at Suez. There are 70,000 Turks\n\nmarching on to the canal.\n\nThe nights are getting quite cold, have had to start rugging our horses again. ","42":"\n expect to get through \ndrifted\n the canal, are only allowed to travel at 5 knots an hour.\n Have anchored at Ismalia tonight about halfway through the canal. There are a big encampment of Indian & British troops here.\n\nSaturday 30th Jan. 1915.\nDrifted during the night on to a sand bank, are having some trouble to get off this morning, they have had to tie a rope on to the Persic & drag us off, have just got clear. This is a big lake, came through two yesterday. Saw two biplanes rise from the shore this morning, they are scouting round watching the movements of the Turks. Still passing British & Indian troops, they are lined right along the canal, there are supposed to be 60,000 Indians troops alone. They are busy making trenches & putting up barb wire entanglements.\n\nHave had a bit of a stiff leg these last few days where that horse kicked me, went to the Doctor, he says that I have a little water under the knee, swollen a good bit & \ndamn\n painful, but I expect it will be right in a day or so. Passed another Battleship today the Swiftsure. There is a battle inland now we can see the smoke from the artillery.\n\nTwo Pages are missing here---the following are taken from a hand-written copy which was done soon after returning to Australia.\n\nReached Port Said 4.30 amidst great cheering. Just after we anchored two sea-planes rose from the water and flew around us. Grand sight to see them swim along the water and then rise like a great bird; they alight on the water too. They have two little boats on each side of them. One of our hospital boats is here and several Australian nurses.\n","43":" Sailed out of Port Said 7.45 a.m. expect to arrive in Alexandria to-night. All bustle today, packing.\n","44":" Just anchored at Alexandria wharf 8 a.m. B. & C. Sq. are going off today; we are not going off till tomorrow. Great crowds of natives\n\non the wharf and a dirty-looking lot too. The native police have their work cut-out keeping them back. Alexandria is a big shipping port and is a fair-sized town. One wants to come out here in the East to see the fashions. Why, you see women and men wearing harem skirts. One thing to me seems a very peculiar custom, the women wear veils, or they are very like masks, over the face. If they are married they wear a bridge from the forehead to the nose, if they are engaged they just wear a veil from the nose -- hiding all the lower part of the face. There are a fair sprinkling of Europeans, mostly ........\n\nContinued in diary.\n\nmostly French here.\nLast lot of B & C just left 7 30 per train for Cairo about 6 hour trip.\n","45":"\nJust finished loading our kits & trucking our horses & on the train bound for Cairo. Our journey by water over, after a record trip losing only ten horses & the rest in splendid condition, in fact some of them better than when they went aboard. I am sure my horse looks better, never had a thing wrong with him all through.\n\nWe are travelling through some fine country, all irrigated, every thing beautiful a green, tis all laid out in little blocks like one great huge garden, seems to be all lucerne & barley. The barley is much the same as our own but the lucerne is a bit different, they call another name, but I can't think of what it is now.\n\nJust passing through some of the lower classes quarters & quaint looking places they are, built of mud & go up to a peak with a window in the top puts one in mind of a great ant bed, to see the way they are built in close to one another that they only had a limited amount of ground to build on\n\ninstead of thousands of acres. just crossed the River Nile 12 45. most of the ground around here is irrigated from the Nile.\n\nEvery here & there one sees groups of women & children shepparding little herds of mules, camels & goats on these plots. The plough they use is a wooden one, same, I should think, our pioneers used in Australia, they have two Buffalos yoked to them. Just arrived in Cairo 3 P.M. had every thing off in an hour, horses & all, & ready to move off to our camp, a distance of 8 miles. have to walk & lead our horses. Just arrived in camp 8 P.M. & jolly tired we all are. 8 miles of a walk is no joke after 6 weeks on the boat.\n","46":"\nNot much sleep last night with unloading transports & fixing up camp, it was pretty rotten, & a dusty hole we are in too, we are camped on the same ground as the first Light Horse. they have moved out to Hele'opole.\n","47":"\ngetting settled down in our new camp now alright, the nights are very cold, the wind cuts like a knife, of course this is the middle of winter here. I am afraid our horses wont do too well here, Rye chaff we have to feed on, it is not chaff at all\n\n"}}