{"Document Name":{"0":"Diary_0265","1":"Diary_0265","2":"Diary_0265","3":"Diary_0265","4":"Diary_0265","5":"Diary_0265","6":"Diary_0265","7":"Diary_0265","8":"Diary_0265","9":"Diary_0265","10":"Diary_0265","11":"Diary_0265","12":"Diary_0265","13":"Diary_0265","14":"Diary_0265","15":"Diary_0265","16":"Diary_0265","17":"Diary_0265","18":"Diary_0265","19":"Diary_0265","20":"Diary_0265","21":"Diary_0265","22":"Diary_0265","23":"Diary_0265","24":"Diary_0265","25":"Diary_0265","26":"Diary_0265","27":"Diary_0265","28":"Diary_0265","29":"Diary_0265","30":"Diary_0265","31":"Diary_0265","32":"Diary_0265","33":"Diary_0265","34":"Diary_0265","35":"Diary_0265","36":"Diary_0265","37":"Diary_0265","38":"Diary_0265","39":"Diary_0265","40":"Diary_0265","41":"Diary_0265","42":"Diary_0265","43":"Diary_0265","44":"Diary_0265","45":"Diary_0265","46":"Diary_0265","47":"Diary_0265","48":"Diary_0265","49":"Diary_0265","50":"Diary_0265","51":"Diary_0265","52":"Diary_0265","53":"Diary_0265","54":"Diary_0265","55":"Diary_0265","56":"Diary_0265","57":"Diary_0265","58":"Diary_0265","59":"Diary_0265","60":"Diary_0265","61":"Diary_0265","62":"Diary_0265","63":"Diary_0265","64":"Diary_0265","65":"Diary_0265","66":"Diary_0265","67":"Diary_0265","68":"Diary_0265","69":"Diary_0265","70":"Diary_0265","71":"Diary_0265","72":"Diary_0265","73":"Diary_0265","74":"Diary_0265","75":"Diary_0265","76":"Diary_0265","77":"Diary_0265","78":"Diary_0265","79":"Diary_0265","80":"Diary_0265","81":"Diary_0265","82":"Diary_0265","83":"Diary_0265","84":"Diary_0265","85":"Diary_0265","86":"Diary_0265","87":"Diary_0265","88":"Diary_0265","89":"Diary_0265","90":"Diary_0265","91":"Diary_0265","92":"Diary_0265","93":"Diary_0265","94":"Diary_0265","95":"Diary_0265","96":"Diary_0265","97":"Diary_0265","98":"Diary_0265","99":"Diary_0265","100":"Diary_0265","101":"Diary_0265","102":"Diary_0265","103":"Diary_0265","104":"Diary_0265","105":"Diary_0265","106":"Diary_0265","107":"Diary_0265","108":"Diary_0265","109":"Diary_0265","110":"Diary_0265","111":"Diary_0265","112":"Diary_0265","113":"Diary_0265","114":"Diary_0265","115":"Diary_0265","116":"Diary_0265","117":"Diary_0265","118":"Diary_0265","119":"Diary_0265","120":"Diary_0265","121":"Diary_0265","122":"Diary_0265","123":"Diary_0265","124":"Diary_0265","125":"Diary_0265","126":"Diary_0265","127":"Diary_0265","128":"Diary_0265","129":"Diary_0265","130":"Diary_0265","131":"Diary_0265","132":"Diary_0265","133":"Diary_0265","134":"Diary_0265","135":"Diary_0265","136":"Diary_0265","137":"Diary_0265","138":"Diary_0265","139":"Diary_0265","140":"Diary_0265","141":"Diary_0265","142":"Diary_0265","143":"Diary_0265","144":"Diary_0265","145":"Diary_0265","146":"Diary_0265","147":"Diary_0265","148":"Diary_0265","149":"Diary_0265","150":"Diary_0265","151":"Diary_0265","152":"Diary_0265","153":"Diary_0265","154":"Diary_0265","155":"Diary_0265","156":"Diary_0265","157":"Diary_0265","158":"Diary_0265","159":"Diary_0265","160":"Diary_0265","161":"Diary_0265","162":"Diary_0265","163":"Diary_0265","164":"Diary_0265","165":"Diary_0265","166":"Diary_0265","167":"Diary_0265","168":"Diary_0265","169":"Diary_0265","170":"Diary_0265","171":"Diary_0265","172":"Diary_0265","173":"Diary_0265","174":"Diary_0265","175":"Diary_0265","176":"Diary_0265","177":"Diary_0265","178":"Diary_0265","179":"Diary_0265","180":"Diary_0265","181":"Diary_0265","182":"Diary_0265","183":"Diary_0265","184":"Diary_0265","185":"Diary_0265","186":"Diary_0265","187":"Diary_0265","188":"Diary_0265","189":"Diary_0265","190":"Diary_0265","191":"Diary_0265","192":"Diary_0265","193":"Diary_0265","194":"Diary_0265","195":"Diary_0265","196":"Diary_0265"},"Date":{"0":"unknown","1":752.0,"2":753.0,"3":754.0,"4":755.0,"5":756.0,"6":757.0,"7":758.0,"8":759.0,"9":760.0,"10":761.0,"11":762.0,"12":763.0,"13":770.0,"14":771.0,"15":772.0,"16":775.0,"17":776.0,"18":780.0,"19":781.0,"20":782.0,"21":783.0,"22":784.0,"23":785.0,"24":786.0,"25":787.0,"26":788.0,"27":789.0,"28":790.0,"29":791.0,"30":792.0,"31":793.0,"32":794.0,"33":795.0,"34":796.0,"35":797.0,"36":798.0,"37":799.0,"38":800.0,"39":801.0,"40":802.0,"41":803.0,"42":806.0,"43":807.0,"44":808.0,"45":809.0,"46":810.0,"47":811.0,"48":812.0,"49":813.0,"50":814.0,"51":815.0,"52":816.0,"53":819.0,"54":820.0,"55":821.0,"56":830.0,"57":831.0,"58":832.0,"59":833.0,"60":841.0,"61":842.0,"62":843.0,"63":844.0,"64":853.0,"65":854.0,"66":855.0,"67":856.0,"68":857.0,"69":858.0,"70":859.0,"71":860.0,"72":862.0,"73":863.0,"74":864.0,"75":865.0,"76":869.0,"77":870.0,"78":871.0,"79":872.0,"80":873.0,"81":874.0,"82":875.0,"83":876.0,"84":877.0,"85":878.0,"86":882.0,"87":883.0,"88":884.0,"89":885.0,"90":886.0,"91":889.0,"92":899.0,"93":900.0,"94":920.0,"95":929.0,"96":933.0,"97":934.0,"98":935.0,"99":936.0,"100":944.0,"101":945.0,"102":946.0,"103":950.0,"104":951.0,"105":952.0,"106":953.0,"107":954.0,"108":955.0,"109":956.0,"110":957.0,"111":958.0,"112":959.0,"113":960.0,"114":961.0,"115":962.0,"116":963.0,"117":964.0,"118":965.0,"119":966.0,"120":967.0,"121":968.0,"122":969.0,"123":970.0,"124":975.0,"125":976.0,"126":979.0,"127":980.0,"128":981.0,"129":982.0,"130":985.0,"131":996.0,"132":997.0,"133":998.0,"134":999.0,"135":1000.0,"136":1001.0,"137":1002.0,"138":1003.0,"139":1018.0,"140":1019.0,"141":1020.0,"142":1021.0,"143":1023.0,"144":1024.0,"145":1025.0,"146":1026.0,"147":1032.0,"148":1033.0,"149":1034.0,"150":1039.0,"151":1040.0,"152":1041.0,"153":1042.0,"154":1043.0,"155":1044.0,"156":1045.0,"157":1046.0,"158":1049.0,"159":1054.0,"160":1055.0,"161":1059.0,"162":1064.0,"163":1065.0,"164":1067.0,"165":1068.0,"166":1069.0,"167":1070.0,"168":1072.0,"169":1073.0,"170":1074.0,"171":1079.0,"172":1084.0,"173":1087.0,"174":1088.0,"175":1089.0,"176":1090.0,"177":1091.0,"178":1092.0,"179":1093.0,"180":1094.0,"181":1097.0,"182":1099.0,"183":1100.0,"184":1101.0,"185":1102.0,"186":1109.0,"187":1119.0,"188":1120.0,"189":1121.0,"190":1124.0,"191":1128.0,"192":1129.0,"193":1130.0,"194":1131.0,"195":1134.0,"196":1135.0},"Entry":{"0":"\n\n","1":" to","2":" We have had an exceedingly busy time reorganising & getting ready for active service again. I was orderly sergeant for the","3":" week in camp & the parade states proved a perfect nuisance. Being strange to most of the men, it took me a few days & the transfers of men in & out of the squadron was abnormal. It was hard to know who was in & who was out, but at the end of the week we got things sorted out & now we are getting along quite smoothly.\n\nMost of the deficiencies in equipment have been made up. A good deal of our saddlery had disappeared during our absence at Anzac. The niggers about the camp, I think, are responsible for a good deal of the shortage. We have been doing 2 mounted parades a day squadron drill & regimental & one route march to Helouan which went off very well. I am still riding the same horse I have had all along. He\n\nhe is a good doer & goes well. We had a splendid dinner in Cairo at the Metropole Hotel on the","4":" in commemoration of a safe return from Anzac. After dinner we went to the Kursaal which opens at 9.30 & closes at 12. It is a variety entertainment, but is the only place in Cairo where you can get much amusement now. I am very tired & fed up with Cairo. There are too many troops in Cairo & they have made most of the places best worth going to out of bounds. Restrictions on leave are also more severe that it is hardly worth your while leaving camp.\n\nOur","5":" Reinforcements arrived on the","6":" nearly 100 strong. We have enough men now for close to 2 regiments. Several of our men who were out on the Western frontier & took part in the fight with the Bedouins on Christmas day where they accounted for 600 returned. They say a lot of the Egyptian Garrison deserted & joined the rebels.\nQuite a lot of rain had fallen here this month, quite 2 or 3 times a week rain has\n","7":"\nfallen. I have received quite a lot of mail lately especially papers. Parcels are a \"wash out now that the New Year is well in. I have got most of my letters answered. I have met several chaps lately I knew before, among them are Les Whipp, Eric McMurtrie, McCulloch & Jack Hickey. I was also told that Keating was in camp here but I do not know what units most of them are serving with. Jean McCarthy of Deer Vale has gone back into hospital again, this time with a sprained ankle. I made a new allotment of my pay. Our back money which was due to me is not going to be paid is the money we did not draw at Anzac, so I am down on to 3\/5 a day, & the allotment I made will now amount to","8":"\n\n20th Janry to 31st General Birdwood came out & inspected us. We marched past him in Squadron Column. We had another route\n","9":"\nmarch to Helouan across the desert & several parades in full marching order, so that we can pack up & get ready to march out quickly I went to the races on the","10":" & spent a good afternoon winning a few shillings after paying expenses. I met Henry Newing there & arranged to meet him on Monday. On Sunday I remained in camp & wrote some letters. I have received letters from Frank, Violet Blair & from Aunt Carrie & replied to all. On Monday I went into town & got my pay book fixed up, making a new allotment of 5\/1 drawing the remaining","11":" here.\n\nI called on Newing at Ordnance & had dinner with him & he gave me a good new military riding overcoat. I also called at the Vacuum Oil Co & had a yarn with some of the heads. They said they were pleased to see me & asked me to call again. There has been a fair bit of rain lately & more has fallen this year than for years previously. I had tea at York House\n","12":"\nat night went with Harry Newing to Mrs Warner's house near the Central Rly Station whom Harry has got to know here. There are 5 in the family & they have the knack of making you feel right at home at once. I just caught the train back to camp in time. I was in again 4 nights later & we had a splendid evening. I did not bother this night about getting home in time & stayed at the ordnance store all night & got a car back just before stables.\n\nOn","13":" I was on inlying picket & on Sunday went into town again & had a good time. We thought we were leaving on","14":" but word came through on Thursday after we had everything ready for departure that it had been cancelled. Most of the infantry are at Tel-el-Kebir & on the canal. There are also Light Horse & other troops at Wardan about 40 miles from Cairo. Tom Kirton of Dorrigo is in the","15":" has only been here\n","16":"\nabout a week. I went into town on the","17":" & met Cousin Will Douglas who is now in Cairo. We had tea together. He is a very quiet chap & talks very little. He arranged to come out next Sunday & see me. On Saturday afternoon several of us obtained leave. It rained all the afternoon & part of the night. I had tea with Harry Newing & afterwards met some Indian doctors from the Citadel. We spent a very pleasant evening & I caught the 9.30 pm train back to Maadi.\n\nOn","18":" I remained in camp & wrote some letters. Cousin Will did not turn up. We all received billies a couple of days ago & found them very acceptable. Mine was sent by Mr A E Turnbull of Savage Club, Melbourne. I wrote to him acknowledging the gift.\n","19":" In the morning we prepared for the inspection of the Brigade by General Ryrie. At 1.30 we fell in & marched out about 2\n","20":"\nmiles & the whole brigade formed up under a hill. There was a large crowd out there watching & they say we looked well. We had a photo taken but I believe the plate was accidentally broken after we moved off. We marched round & formed up again but it was too late then to get another picture.\n\n8th Febry In the morning we prepared ourselves for a route march to Helouan where we are going to bivouac all night. We started at 1.30 pm & it took us a fair time to get there & it was dark before we got things fixed up for the night. There was a concert at the Tawfik Palace Hotel & it was fairly good. An Italian Opera singer gave us a couple of songs. Madame I believe it was. The bivouac was very successful & we had very little trouble. We moved off about 9.30 in the morning & got back to camp shortly after 12. We were paid in the afternoon & I drew £10\n","21":" The 2nd LH Bgde sports were\n\nheld today & they were a success. The 6th LH won most of the events. I went into Cairo in the afternoon & had a good hot bath & came out again shortly after tea.\n","22":" Was Regtl. Orderly Sergeant. It is a fairly easy job but the waiting about all day I don't like. You are continuously on duty for 16 ½ hours & it gets a bit tiresome. I received some letters this week from Mother, Kate, Doug, Cousin Will Gordon & Nell Ferguson also a pair of sox from Violet Blair. The weather in the day time is fairly warm now but the nights are still cool & you can always do with a few blankets.\n","23":" Usual cleaning up parade in the lines all the morning.\nI stayed in camp in the afternoon. Attended church parade on Sunday morning & went out to Abbassia in the afternoon to see Will Douglas but he wasn't in camp so returned to Cairo & called on Henry Newing. He was out, so I thought it was good enough then to get back\n\nto camp.\n\nMonday 14th There is to be a Brigade competition & every troop is to be judged to see 1st, the best troop of each squadron. 2nd, the best troop of each regiment &","24":" the best troop in the Brigade. There is to be a cheque of £28 divided amongst the winning troop which must consist of 1 officer 2 sgts & 24 men. We have a fortnight to prepare for it, so we started today. We had a good bit of rain at night.\n","25":" Received a letter from Arthur Blomfield. He is in the","26":" Infty Bgde, so I wrote to him to arrange a meet. Peter Gosling of Dorrigo came out here to see us. He is the same old spark. We went to the picture show but didn't stop long as we didn't like the programme.\n","27":" We did a solid mornings work at troop drill & there is a considerable improvement already. In the afternoon we had rifle exercises & guard mounting duties. Our troop were inlying picket at\n","28":"\nnight. We had very little time to get ready & under the circumstances turned out fairly well. The picket went to the pictures at night.\n","29":" Lt Smith, being orderly officer, I had to take the troop all day & we had a fairly strenuous morning. The Colonel was hovering around all the time. He can be very critical & sarcastic at times but I got off fairly light. Our Squadron is also training to play football against \"A\" Squadron next Saturday.\n","30":" Applied for leave & got it from 9 am. with Sgt Conrick I went down to Tel-el-Kebir catching the 11 am express, arriving there at 1 pm. Found Arthur Blomfield in the 1st Battalion & we had a rare old yarn. Watson was also with him. I caught the 9.45 pm train back to Cairo & reached Maadi about 2 am.\n\nSaturday 19th Cleaning up day in camp. We shifted our line of tents & got new mats for our tent. It looks well now. Was warned for main guard tonight & put in nearly all\n","31":"\nthe afternoon cleaning up for it. All the detail sergeants were away at a dinner. The guard turned out looking very clean. We had a bit of trouble about 9 pm. One man a patient of Lunar Park got the DTs but we got the inlying picket out & the AMC took him away in a car. It took 5 men to hold him. We had him on a stretcher & got him back to the hospital in a car.\n","32":" Had a fairly quiet day on guard. Cousin Will did not turn up. Sgt Long came out but \nI\n did not have much time to spare. He wants me to come down to Alexandria to see him. Promised me a good time.\nWas relieved off guard at 5 pm. Wrote a letter to Kate & went to the Soldiers Club for supper.\n\nMonday 21st Squadron drill in the morning & practice in picketing horses. Times for the different troops were D 4 – 40 sec. C & B 5min & A troop 5 min 3 sec which was very good seeing we have had very little practice\n","33":"\nWe put in the afternoon checking equipment & allotted the horses & fixed up permanent sections.\n","34":" We had more squadron & troop drill in the morning also practice in picketing horses. We received marching orders for Thursday. The Brigade is going to Serapeum on the Canal. I went into Cairo at night with Stan Rogan & we had tea with Harry Newing & a yarn later with the Indian major. Caught the 9.30 train back. We were medically examined & also paid. I drew £3\n","35":" A full marching order parade was held in the morning for the purpose of checking equipment. All shortages were made up. In the afternoon we packed our kit bags & generally had an easy time. Went into Cairo after tea. The best part of the 6th Regt were in. Met Sgt Young & 3 of the 3rd Battery artillery & we spent the evening together. Booked tickets at the Karsaal Music Hall. The show was very good for Cairo, all the\n\nAllies being represented in the performance Finished up with a good supper & a motor car back to camp.\n","36":" We had a very busy day packing loading & cleaning up ready to march out tonight. There was a good concert in the Recreation Room after tea given by Cairo residents. Had a good supper at the Soldiers Club & snatched a couple of hours sleep. We saddled up at 11 oclock & marched off at 12.10 am.\n","37":" Arrived at the Railway trucking yards at 2.30 am & soon got everything on the train. A few ladies very kindly provided tea & cocoa, sandwiches & cakes. I got another hours sleep before the train moved off We had an uneventful journey reached Serapeum about 11 am Saturday. We had a busy afternoon getting the lines down & the tents pitched. We were all pretty tired at night & lost no time getting to bed.\n","38":" In the morning C & D troops went to the canal for a swim. The water was\n\nFebruary –","39":"\nfairly cold but it was very enjoyable. It is a little over 2 miles from our camp to the Canal. We have nearly a mile to go to water our horses in the fresh water canal. In the afternoon we worked on the lines improving them\n","40":" Mounted parade all day The Brigadier was out & we also saw Genl Birdwood & staff. We took our lunches with us. The sand is fairly heavy & it is impossible to do much fast work. We are faring fairly well in the matter of food. There are dry canteens handy, but the prices are very high\n","41":" work as yesterday, but here most of the time is taken up looking after your horse as the arrangements are not nearly so good here as at Maadi\n","42":" Cleaning up day in camp also swimming parades.\n½ of the squadron goes in the morning, the rest in the afternoon\n","43":" Mounted parade all day. There was a heavy wind blowing all day & a lot of dust & sand flying\n","44":"\nabout. Made things pretty miserable. An Australian mail came in during the afternoon I received several papers & letters from Frank & Doles\n\nFriday 3rd I was informed today that I was to go to the school of Instruction this afternoon. I was the only NCO from the 6th One officer, 4 Machine Gunners & 2 Signallers also came along We left Serapeum at 7.30 pm & reached Mokasa near Ismailia shortly after 8 pm where we detrained. We received a hot meal at the NZ Infantry camp where we stayed the night.\n","45":" Entrained again at 8 am in open trucks. The weather was fairly cool & cloudy We picked up many more at Tel-el-Kebir & reached Zeitoun shortly after noon. Were placed into quarters right away 8 or 10 in a large square tent. I went into Cairo at night. Picked up Harry Newing & the major\n","46":" Had a good sleep in the morning.\n","47":"\n& went into Cairo with Jean McCarthy in the afternoon. Had tea at York House & came back to camp fairly early as I was feeling tired.\n\nMonday 6th First day instruction. I shall never forget it. 2 hours solid marching & platoon drill in the morning & I was breaking in a pair of new boots. It was slightly better after breakfast in the musketry class & we had a fairly solid afternoon at rifle exercises & it was very hot too.\n","48":" We were given 2 hours company drill in the morning. More musketry instruction & a lecture on discipline. In the afternoon usual training & more musketry instruction. The day was fairly warm. It is a big cram here & you have to concentrate your mind on the work if you dont want to be left behind\n","49":" More company drill before breakfast. A few of the movements are\n","50":"\nnow getting into my mind but it is not too comfortable getting out in front when you have had so little experience in infantry drill but making mistakes helps you to learn. More musketry & a lecture on care of arms, instructions in loading positions, use of cover & visual training.\n","51":" More progress in infantry drill, extending in skirmishing order. This is easier especially the signals as they very much resemble Light Horse drill We had a lecture on Outposts in the morning & more musketry instruction, mechanism use of cover visual training\n","52":" to","53":" The course at the school was very solid throughout, but there is no doubt you learn a great deal there. I was generally too tired of a night to go to Cairo, but generally went in on Saturday afternoon & sometimes on a Sunday. I was \n","54":"\nat Maadi & it is greatly changed. Most of the details have volunteered for the artillery so also have some of the officers.\n\nWe have a fine lot of fellows in our tent 4 N Zealanders & the rest of us Light Horse. All did very well in their exams. We had 1 musketry exam at the end of the first week 1 Company drill exam in the 2nd also a","55":" musketry exam & during the last week a written test I obtained an average percentage of 91 & got my certificate There were all sorts at the school including West Indians & Maoris Scotch Regiments predominated as there are a lot here. We had a concert on the last night & it was very good. Many splendid artists assisting. I went to the Kursaal a couple of times. There was a very good show on. We left Zeitoun on Saturday the","56":" in open cattle trucks. It was fairly cold in the afternoon. We were 7 hours in getting\n\nto Ismailia which we reached at 7 pm At 10.45 pm we got a train to Serapeum which we reached at 11.30 pm It didn't take me long to find my tent & get to sleep\n","57":" oclock reveille It was much better than 5 am & 5.30 am get-ups at the school Did practically nothing all day except go to church. Took over orderly sergeant in the afternoon. It is a fairly easy job. The weather is warm & the flies are getting very thick.\n","58":" Usual mounted parade & food for man & horse. There is nothing much doing in the way of drill. All spare horses are taken off the lines & exercised the squadron often pulling up at the canal for a swim. Received some letters 6 altogether & answered one or two\n","59":" to","60":" Usual parades & occasionally night operations when numbers get lost & turn up at all quarters It is wonderful the number that\n","61":"\nmanage to get back to camp shortly after dark\n\nOn Tuesday 4th April we left Serapeum at noon. The Brigade marched to Moaska that afternoon & camped there the night. The next day they marched the rest of the distance across the desert arriving at Salhia about 2 pm Wednesday. I was with the baggage party & we came on by passenger train to Zag-a-Zig where we stayed the night. We had leave to go up to the town & got a decent feed. Arrived a Salhia before 9 next morning passing through beautiful irrigation country. The niggers are terrible thieves there & even shot at an officer of the guards when interfered with. Salhia is a good site for a large camp & the whole mounted division consisting of 16 Regiments Australian & NZlrs will be here within a few days We soon got settled down. There are mess-sheds canteens & shops & a good water supply. Our Brigade were the first\n\nto arrive the NZlrs coming 2 days later getting here on the","62":"\n","63":" to","64":"\nWe had a fairly easy time while at Salhia. There were very few drill parades, mostly exercising horses. The weather at Salhia although there is only 20 miles of distance from the canal & practically on the same level is much cooler & there are next to no flies. The Sgts mess has a good flyproof shed for dining in & also started a canteen.\n\nFor the last fortnight from the","65":" to the","66":" I took on the catering for the mess & was kept very busy. I got a percentage of the profits for the extra trouble. Have been doing very well for mail since coming to Salhia but havnt written many myself. On the","67":" we got news that the English Yeomanry were in trouble on the canal & on the","68":" the 5th LH marched out at daylight We were to follow 3 days later\n","69":"\nBut at 12 oclock on the","70":" we marched out of Salhia & reached Kantara just after 7. We heard there that a full regiment of Yeomanry had been surrounded & captured also a general. Large numbers of Turks are reported in the vicinity. We only stayed at Kantara about 3 hours & had a feed & a wash. We were about ready for bed then; but we weren't destined to get any sleep till 2 am The night was cool We passed large camps of hosps; ambulances going backwards & forwards also strings of motor lorries with stores & supplies.\n\nAfter 3 hours sleep we were up again; fed & watered our horses The camp here 12 miles on the desert side of Kantara is a busy bustling scene of military activity. We saw 8 aeroplanes going out all in one long string like a line of birds. At 9.30 we left camp & started for the rail head. We had several halts & the day was fairly warm & the going heavy being mostly loose sand. It was fairly late when\n\nwe reached the railhead & there we got our water bottles filled, but there was no water for the horses & as they were watered so early in the morning when they will drink very little they must have been thirsty. Some Tommies were at the rail head & they gave us all sorts of accounts of the fighting at Katieh, so we began to think we would meet Turks any moment.\n\nOur squadrons provided scouts as part of the main advance guard the next morning starting at 7 oclock we marched 3 miles & came on a deserted engineers camp. The niggers about 600 of them had to leave it after the Tommies went back. We pushed a couple of miles further on & reached the Yeomanry camp My party of scouts rode through it Everything was lying about, but we had no time to get the loot & we halted a mile past it & the main body 6th &","71":" occupied it & found all sorts of good things, beer & champagne\n\nspirit, tinned edibles. The Tommy officers seemed to lack nothing. We found a theodolite, golf sticks & one officer even had his boot blocks, which helped to boil our billies. Our horses & ourselves had started in the morning without water & we thanked the Tommies for clearing out when we found their water supply, so we got our water bottles filled again. We went no further that night so improved the wells & managed to get our horses some water which was slightly brackish, but which they drank eagerly. They were terribly thirsty being on the march practically 2 whole days without water.\n","72":"\nSome more provisions horse feed etc were obtained from the other deserted camp of the Yeomanry about a mile away. Our troop went out early to Katieh the scene of the fighting & brought in 5 wounded men, but one man died on the way in. We also found a dead sergeant who had nearly got back to camp. He had\n\nbeen wounded & managed to get away from the scrap. His horse was dead near him. We got several natives, some of them women as prisoners but most of them were let go again. The wounded had had a very rough time & had been out 3 days before we got them. The Turks had bound their wounds up & left them food & water, which the wandering Arabs had taken off them. They tried to strangle one man & cut another about with a knife. They were brought in on camels & must have had a rough ride as they had to be brought in 6 miles. Our Squadron was on outpost at night, & next morning\n\nThursday 27th\nwe came in at 5 oclock, had a quick breakfast bully & biscuits & got away at 6.15 with stripped saddles. We had several shovels. Both Chaplains came with us & about 8.30 am we came upon the scene of the fight. There was a large number of empty shells & shrapnel bullets lying about the ground & everything pointed to prove that the\n","73":"\nYeomanry had had a rough time. They were only about 100 strong & were suddenly attacked by 800 Turks with guns. Most of their horses were killed & several camels. The ground was littered with dead men horses & camels & during the morning we buried about 45 men 6 of these being Turks & 2 camel drivers the rest being English. Worcesters & Gloucesters. Most of the dead were stripped of their clothes & the stench was horrible. The burial party was taken from my troop & they had to wear respirators. The Turks had buried some their own dead themselves. It was a wonder they didn't follow up their success as the main camp was deserted by the others when they heard the Turks were advancing. Lord Pascoe & many others were taken prisoners Judging by the number of empty bottles he & his officers had evidently been living well, they even had a travelling bed-stead. At the main camp there was a fair bit of furniture Some of the Tommies came back\n","74":"\nto their camp the day following our occupation of it to get some of the things they left behind but those Australians were a hungry and an eager lot & never left anything for them. We told them to go & get their wounded mates in. C Squadron went on to Oghratina the day we were at Katia & there they found 3 wounded, 2 Tommies & a Turk who had been there 4 days. They used to help one another. One was severely wounded & the flies were already in the wound. He had to be carried on a stretcher across the sand for about 10 miles it must have taken 8 hours to get him in.\n\nThe Turk was shot through the eye. He said he had been fighting in Gallipoli & that they had a lot of Germans with them who said they only had to get to the canal when they could go straight to Paris & on to London as the Germans had taken those places. Our men who went to Oghratina said there were 200 dead there, so it must have been some fight & like the Katia where hardly\n","75":"","76":"\na man got through without a wound. The slightly wounded were taken away as prisoners. Most of the severely wounded must have died on the battlefield as it was 3 & 4 days afterwards that we reached there. Next day Friday the 7th LH went out & buried the dead at Oghratina. It was not a very nice job but we had had our share the day before. An aeroplane comes over every morning & drops a message. It flies down real low so we get the news almost as quickly although we are 30 miles from the canal. All our water, food etc is brought from the rail head by camels. We have no tents & sleep on the sand.\n","77":" to","78":"\nThings are getting a trifle monotonous out here. Of course at any time we may get some excitement as we are the furthest lot of troops out at present & the Turks are reported to be in large numbers at El Arish. So our patrols may clash at any moment. We are doing our own cooking\n\n& are living fairly well. The horses are looking fairly fit, but my own opinion is that a bit more feed wouldn't harm them any especially as they are on harder work here most of the country being drift sand & up & down hill it is solid work & more than 3 miles an hour is impossible. An Australian mail arrived on the","79":" & I got a couple of letters one from mother & another from Doles & I also received a fair number of papers which were very welcome as we had had nothing to read for days.\n\nOn the","80":" my troop went out to Tina Bay, about 6 miles from here as an escort to a party of engineers. It was alright being on the beach but it would have been better had we been able to have a swim, but then we were there for work. Most of us havn't had our clothes off for a fortnight & the company which sticketh closer than a brother are getting noticeable.\nOne of our aeroplanes was forced to descend a few days ago & although\n","81":"\nwe sent a few parties out, have not been able to locate it. Heard later that the Turks had captured the aeroplane.\n\nSunday 7th\nWe left Romani at 1.30 pm & marched to Qatia both the 6th &","82":" Regts camel train ambulance. We are going to the Turkish camp at Bir al abd to make a reconnaissance in force. After watering our horses & attending to our minor wants we left Qatia at 8 pm & arrived at Oghratina at 11 pm. The moon was only a few days old. We fed up again & snatched 2 or 3 hrs sleep, got our water bottles full & at 4 oclock our advanced guard got away & we followed at 4.30 am. The riding was slow as the country was mostly drift sand. We reached Bir-al-abd to find the last of the Turks clearing off in the distance. They left nothing & we didn't even get a shot at them. Our aeroplane followed but I didn't hear how far they went. It was impossible for us to continue the advance as there was only a limited\n","83":"\nSupply of water so we left again at 10 am & got back to Oghratina at 2 pm. We were all feeling very stiff & tired. Filled our water bottles up again, made some tea & about 3 oclock we were off again & reached Qatia about 5 pm & were back in camp by 6.30 pm, watered fed & groomed our horses, fed ourselves. We were all in a hurry for bed, but were informed we had to go on outpost at 8 pm. It was a weary troop that dragged itself along the mile of sand to No 2 Redoubt. However, we put everyone on & made the duty as light as possible.\n\nTuesday 9th\nThe weather is getting very warm again. Our troop was on day outpost in the afternoon. We heard of successes in France but cant get the full strength of things\n","84":"\nHad a full day in camp, but was out on outpost at night. There was a very heavy fog & it was after 6 on Thursday morning when we came in.\n","85":" to","86":"\nWe put in the usual existence\n\nin camp till Monday, when our regiment was ordered to leave at 1.15 Our direction was E.S.E. & we knew before it started that it was not going to be easy, as the map showed so much drift sand added to that there was not so much water as we had on the last route & besides the day was very hot. We reached Katia at 4 oclock carrying 2 days rations. We watered our horses & boiled our quarts & got as much feed as we could beneath our belts, as we didnt know when we would get another chance, as we were on the verge of enemy country & the orders after leaving Katia at 7 oclock were no smoking no talking & of course no chance of making any tea.\n\nWe reached the wells at Sagia at 9.15 pm & here we watered our horses again (very few of them drank) & then we fed them. The camel transport arrived just after us & we got our water bottles filled again. We then made ourselves as comfortable as possible till 2.30 am when we munched a few biscuits had a\n\na good drink of water & at 3 am we marched last. The going was heavy & several times our horses could hardly get a footing going down some of the sandy slopes. Progress was very slow about 2½ miles an hour & the sun very early let us know the day was going to be warm. We sighted the enemy's patrols about 8 oclock. Our squadron was advance guard & our scouts got very close at times but as they got on one ridge the enemy would be retiring to another & what is difficult to understand they never fired a shot at our scouts. One party left their breakfast cooking on the fire.\n\nWe followed for nearly an hour & came upon several new wells and wooden troughs & about ½ a ton of wire. The troughs we packed together & burnt & we threw the wire down the wells C & D Troops here took the opportunity of watering their horses & it proved afterwards the best thing we did all day. The main body did not come so far & consequently did not water. At 9.15 we turned back. It was very hot\n\n& a strong hot wind was beginning to blow from the south east across the desert. The water in our bottles was very warm & at 11 oclock it was that hot as to make it undrinkable. The heat was intense & the wind was blowing very strong. The flies were down to it & gave us no trouble at all. Our throats were already parched & the sun being on the back of our heads made us feel giddy.\n\nAt 11.15 we came to an oasis in a hollow & we got into the shade of the trees. It gave us little relief as there was scarcely a breath of air & the temp must have been 120° There was a well here but the water smelt strongly & we were ordered not to touch it But it was impossible to keep a lot of the men away, some were staggering & a few fainted. I had my bottle half full of hot water & so I made a fire & boiled some tea. This made me feel much better but my throat was just as dry after I had drank. At 12.30 pm we got the order to mount & push back to Sagra . It seemed as though\n\nthe wind was blowing off the furnaces of hell. An hour later we reached Sagra in scattered groups mostly & here we found the NZealanders very done up & they had got most of the water. It was impossible to get any water for the horses. The water here was brackish, but as I drank the first pint I thought it the sweetest I had ever tasted. There was a great scramble here for water. Men were rushing around a lot of them half silly. Some were frothing at the mouth & I saw one man put a bucket of water to his lips & finish the lot. Many more men were so weak they couldn't go on.\n\nThe Aust & NZ ambulances were here & they were able to give a lot of assistance. For myself I drank a couple of quarts & felt as though I could drink a couple of gallons. I got my bottle full again & so did most of the others. It was no use stopping here We had to get on & water the horses & it was 6 miles further on & the heat was now intense. This part of the ride\n","87":"\nwas the biggest strain for all, horses & men. C & D Troops were the most fortunate as our horses were the stronger having had water in the morning. At about 3.30 pm we reached Katia & got water for our horses. You ought have seen the poor brutes drink & there was a great deal of satisfaction in getting it for them. I was feeling very weak, but got my horse several buckets & a few more for some others. A lot more men were vomiting here & after I had another ½ a gall of water to drink, I felt the same way myself & later on got rid of the overdose of water I had taken.\n\nStill feeling all the time I could drink a few more gallons. We helped one another as much as possible, stripped off our shirts & threw buckets of water over each other & tied wet clothes around our necks. We boiled our quarts again but I could eat nothing; had eaten nothing all day. I threw several buckets over my horse & gave him a feed. We rested for about an hour & at 6 pm\n\nleft for Romani feeling much stronger & in fairly good spirits. We passed 2 or 3 relief parties going out & at 7.45 reached the Romani wells & at 8.15 marched into camp. Tea was ready for us, but I was sick again. However I persevered & forced myself to eat & felt much better At 4 am next morning was up again feeling fairly fit. We sent 28 men back to hospital & there many more sick in camp. The NZealanders had many more cases than we had.\n\nI don't think anybody even from the hottest parts of Australia had ever gone through such a rough spin Had we followed the Turks for another hour we would have been done & it would have proved a calamity. Anyhow we have the strength of these desert stunts now & it is wonderful in a few hours how a strong body of men can become utterly useless\n\n18th \nToday was much cooler. We takes the horses into the shade of the palms, each man taking a feed for himself & horse\n","88":"\n& stay there throughout the heat of the day. The 1st LH arrived here today. The","89":" went out to Oghratina last night. We heard the NZ had got into contact with some Turks out there.\n","90":" to","91":"\nThe weather has been much cooler but nevertheless we have been sending the horses out under the palms each day; on Sunday we took the horses over to the sea for a swim. Went over to the","92":" LH & saw Sgt Mjr Davidson & Douglas Cooper. Cecil who was at Nottingham with me is also in the","93":" but is not out here with them having got sick & gone into hospital. On","94":" the Regiment left camp at 7 am. They are going 6 miles S.E. of Bir-el-Abd & will probably be away 3 days. I was not feeling too good the heat evidently has affected me. I reported sick & got sent into hospital at Port Said. I stayed there a week & was feeling pretty good when I left for Cairo. Could have gone back to the\n\noa3825040\n","95":" –","96":"\nthe same night. It is a nice little camp in an oasis. There is a big change noticeable. Railway in full swing & many more camps. I got some mail including letters from cousin Carrie & Meg, also letters from Carrie mother & Doug. & numerous papers. During my absence the Regt had 3 or 4 trips into the desert & got into touch with the Turks capturing some camels & killing & wounding a few Turks. They also dug some wells at Oghratina which will make these stunts much easier. There is a fair bit of aerial activity & our machines try & engage the enemys planes as often as possible.\n\nThe horses are looking fairly well. The months spell at Hill 70 did them a lot of good but they felt the first big reconnaissance to the East of Bir el Abd about 30 miles each way 60 miles altogether in the 2 days. Many of them had sore backs. On the","97":" the","98":" &","99":" LH & the Wellington Mounted Rifles\n\nleft camp & reached Katia just before dark. Some of them pushed on & got into touch with \na big\n outposts of a large force of Turks near Oghratina & fell back to Katia. Aerial reconnaissances report large bodies in several places, so we got every available man out. At daylight on the","100":" our advanced bodies exchanged shots. Our aeroplanes were very active & dropped several bombs. In the afternoon A squadron supported by B made a demonstration in front of the Turks. We were supported by artillery. A Squadron had 1 man wounded. The Turks we found in large force & we withdrew & got back to El Maleh about 3 am. We put in all next day in camp resting as we were very tired. At 1.30 am we started out for Oghratina. Our Squadron was outer screen & B & A troops did the scouting. We rode right into the Turks outposts & drew a fair bit of fire. In places we rode as close as 30 yds & not one man\n","101":"\ngot hit. One horse was wounded in the shoulder. We withdrew to about 1200 yds from the Turkish position & sat down & watched them all day. We did not fire a shot B Troop got 1 Turk prisoner also his camal. He was very thirsty & kissed Frank Fitzgerald Seemed to be very pleased at his treatment. The Wellingtons got 8 prisoners & they got their photo taken quite a number of times. They must have felt quite in the We left Oghratina at 6 pm The Turks made no movement at all. We got back to camp at 11 pm & got 4 hrs sleep.\n\nThe","102":" Brigade went out just after midnight of the","103":" got into touch with Abdul & had 2 men killed & 4 wounded. An enemy machine said to be a Fokker appeared over our camp & was attacked by one of our biplanes. They had a savage & long fight. The Turkish machine had to descend & both our pilot & observer got wounded. Heard later that the pilot died shortly after getting his machine back\n","104":"\nWe rested in camp all day on the","105":" & at 1 am on the","106":" we set out for Katia. 'C' Sqdn went out to Oghratina & we heard a fair bit of firing as they neared the Turks.\n","107":" to","108":"\nWe have been going solid all the week. Every alternate day we go out to meet Jacko & have inflicted numerous casualties & taken several prisoners. The","109":" Brigade had the biggest scrap at Magoubra . Our artillery & machine guns have also done useful work.\nOn the","110":" Lieut Pearce Corpl Thorne & 2 others stayed out on listening post. The Turks surrounded them about midnight & Mr Pearce was killed. The others had a lucky escape & were about 8 hrs in the enemy's lines. They eventually got out & reached Hill 70. \"B\" Troop is without an officer now so also is \"C\". On the","111":" at midnight we set off again & there was desultory fire all day. The Turks are fairly active & strongly entrenched. Their aeroplanes are busy & on the morning of\n\nJuly –","112":"\nThe","113":" bombed the camps here. There were several casualties. They made 2 raids during the morning. Our air craft guns didn't get in such good work as the other day when their firing was beautiful to watch. A good deal of mail has come in & I received 3 letters 1 from Doug 1 from home & one from Doles. The weather is still very hot, but the days are getting noticeably shorter. I took over orderly Sgt.\n\nMonday 31st \nIt is a solid job these & you are running about nearly all day & still have to go out on all the stunts. We went out again at midnight. My troop was left flank guard & before we got to Katia we were heavily fired on & had to gallop back. The artillery dispersed several bodies of the enemy during today. We got back to camp about 10 pm on the","114":" Spent next day in camp & went out again at 1 am on the","115":" We surrounded the Turks in strong force but there was\n\nno big action. Artillery was fairly busy. Returned to camp at 10 pm on the 2nd . The 1st Brigade put out some squadrons on outpost on the","116":" & they were heavily attacked on the morning of the","117":" The fighting was heavy. The 2nd LH being particularly conspicuous in the rearguard fighting. We only had 3 hrs sleep on the night of the","118":" & were mounted & away before 4 oclock At dawn our position to the South & S west was heavily attacked. German aeroplanes dropped numerous bombs & the camp was shelled.\n\nFighting was very solid nearly all day. The Turks pushed us back for nearly a mile but they lost heavily our artillery & machine guns & rifle fire doing a lot of damage. Our regt was on the extreme right & we had to hold off an enormously superior force. They got round our flank & we had to withdraw & gallop back. We got away all our wounded & then went round further on the right\n\nWe got up extra men NZs & Yeomanry on the right of us again & got the line joined up to Hill 70. The Turks encircling movement was thereupon commenced & the NZealanders with a sharp attack captured a hill making it impossible for the enemy to get away. They surrendered in hundreds In the morning we pushed forward right along the line A B & D troops of B Squadron were the screen of the","119":" regt & we had a good morning hundreds more prisoners were taken some made some resistance but were quickly overpowered. We could have caught hundreds more had our horses been fresh, they had not any water for nearly 2 days & our progress was necessarily slow. We got booty of all description, stacks of ammunition equipment etc. At 3 pm over 3000 prisoners were taken. We pushed them back to Qatia where they held a strong position. We were all very tired & done, had no food that day with the exception of some\n\nTurkish dates we found & we were all fairly weak. The only water we had was some dirty looking stuff we got out of an oasis but it tasted well to us. We dismounted near Katia nearly 16 or 17 regiments of LH took part & we advanced in short rushes across the marshy ground before Katia We came under heavy rifle & machine gun fire also howitzers & field guns. We got what cover we could & lay there for 4 hrs. We were not properly supported on the right & about 6.30 we withdrew. The fire was dreadful, but we got all our wounded back.\n\nI never felt so done in all my life. I could no more run than I could fly & I don't think I cared whether I got hit or not. My tongue & mouth was so swollen I could not chew a biscuit. Pieces got between my teeth & gums. When I got some water it did not relieve me a bit. We left Katia about 7.30 & rode back to El Maleh camp getting there after 10 oclock\n","120":"\nThere was a good hot meal waiting us when we got back & we were not long turning in. There was a lot to do in camp next day, states of men horses & equipment had to go in, burial parties organised etc. I was still fairly tired all day. The horses still look a bit the worse for wear. Heavy fighting went on all day. Some of the fresher mounted troops & a lot of British infantry were engaged.\n","121":" to","122":"\nWe had a quiet spell in camp, with the exception of a few enemy planes with bombs there was no excitement. Our horses are getting stronger fast. On Tuesday the strongest horses & men of each regiment marched out at 3 pm reached Katia before dark watered & had tea & pushed on. The funny part of it was that Tommies along the route said to us, You have missed the fun Hurry up & get in for your cut. We have given them hell, etc.\nWe rode all night\n\nwith occasional halts of a few minutes & bumped the enemy shortly after daylight. They suddenly sent a shell (high explosive) near us & followed it up with some more. My troop was on left flank guard. Some Turkish rifle fire broke out & as we were nearly a mile to the NE of the main body we fell back & joined them. There was nothing much doing during the morning except heavy shelling on both sides, the enemy using mostly high explosives which did frighten us more than they did hurt. Had the ground been hard many of us would have got hurt. We used nothing else but shrapnel & I believe our guns did the enemy a lot of damage. The","123":" Wellingtons of our Brigade attacked in combination with other dismounted troops on the right & they got a hot reception. Both regiments charged with bayonet & Jacko fell back. We then ran short of ammunition & having pushed on too far both regiments\n\nhad to fall back under heavy fire. Our regiment came up & supported them & we also fired nearly all our ammunition. Casualties were fairly heavy but the wounded were got back. The coolness of everybody was inspiring. We held on till dark & then we returned to Oghratina hungry thirsty & tired. We got rations & water & went back next morning.\n\nThe N Zealanders occupied Bir-el-Abd the Turks retreating through the night. We did nothing next day, but our troops occupied Salmana. Jacko was well back on his own sand hill & was retreating S.E. Our aeroplanes were heavily shelled each time they appeared over Jacko's lines we counted 140 shrapnel bursts after 1 poor aeroplane & then it sailed quietly away.\nWe stayed out till Saturday night & returned to Katia. On Sunday morning we got back to camp here at El Maleh I was terribly dirty. Had no shave for 7 days. Soon got a blade to work & got a bath & a\n","124":"\nchange into light clothes. Breakfast was good porridge & ham bread & coffee after days on 3 biscuits & bully a day together with what we could pick up of the rations Jacko left behind. Beer was also on hand again so we thought we were in a garden of roses. We hear we are going to get a spell.\n\nCholera has broken out in the Division & we are in quarantine. One lot of men got away on leave, but no more are to go. I have received several letters during the week & wrote many myself. We are having a fairly easy time Last Thursday we went to Mahemadia for a swim in the briny. The horses enjoyed it as well as ourselves. Many of us got sunburnt & the bandolier & rifle slung now is very painful On Friday I was over at Divisional H'Qrs with a party of 25 men pitching tents. We did a solid days work & it was very hot. Flies are getting worse. During the very hot weather they don't give very much trouble, but now it is cooling off they come again. On Saturday I went over\n","125":"\nto the Scottish Rifles camp to see Cousin Will, but found he was gone to hospital\n","126":"\nWe got a good supply of beer whisky & cigars to day Many NZ sergeants visited us & things were very busy & merry up till \"Lights out\". I went over to Railhead in the morning to help load the stuff We had Church parade at 6.15 pm. There was a big turnout. An aeroplane came over in the middle of the sermon It was funny to see the parade officers & all with their heads right back gazing & no one taking any notice of the parson.\n","127":" to Friday 25th\nWe had a quiet time in camp. Just have to water groom & exercise our horses. They are beginning to look quite fit again. Several chaps in this regiment have been recommended for commissions in the infantry but none of the Sergeants in \"B\" Squadron were nominated. They reckon they cant do without us. I have had several letters lately & having plenty of spare time, have\n","128":"\nwritten several letters. The NZealanders got 65 prisoners last Tuesday. They are in quarantine as they had cholera among them. We have also had a case or two & have all been inoculated twice. I was over at the 7th last Tuesday giving evidence in a case against a man named Ryan who was accused of insolence to an officer. On Thursday we gave Sergt Back, who has been promoted to Signalling officer, a send off .Some of the officers received further promotion & they celebrated the occasion till the early hours of Friday morning. They must have been in great spirits several tried to ride one horse & taking a familiar sanitary mark on the hill charged it in short rushes. It was very funny.\n\nA canteen has been opened handy Not to be outdone the troopers visited it & had a night out also. Many of the sergeants have had a good run also & we have managed also to get a little bit of fun. NZealanders of the Wellington Mtd Rifles who have been attached to us often visit us & we try &\n","129":"\nvary the monotony a bit.\n","130":" to","131":"\nThe Brigade has been getting leave to Port Said. 10 &percnt; are allowed to go each day Some get 48 hrs & others 72 much a matter of luck & how the trains run It is 26 miles on a narrow gauge line in open trucks & they are crowded. It takes about 3 hrs to go in & I can say it is a relief to get there. All the hotels are crowded with soldiers on leave & they are out for a good time too.\n\nI got in the morning Port Said was bombed & there was some excitement for a time. However we did not let bombs trouble us long. We had some good \nfeeds\n, champagne, suppers, hot baths, sea bathing, afternoon teas & ices & a general gorge of everything. I got some cool clothes as we still are served with a thick winter issue & the weather is still very hot especially in Port Said. The horses have been going off lately, the vet says they have sand colic. We have got\n","132":"\nsome new ones & about 15 &percnt; of the old ones have had to go away. Things are very quiet about here now. Aeroplanes come over occasionally & drop some bombs A few scattered parties of Turks & Bedouins have been captured & brought in. We have now had nearly a month's spell, only an occasional patrol or camel escort to do. Still we manage to do a bit, exercising & looking after horses etc. It is very slow & monotonous & I wont be sorry even when we get out at Bir-el-Abd, 50 or more miles E of the canal & do the outpost & patrol work again. A big wet canteen has been opened close to the camp so everybody is feeling satisfied. We received the Anzac books we paid for some time ago I sent one home.\n","133":"\nAs leave is still being granted & many of the men had gone twice I put in again & got 3 days & left by the train at 10.30 am from Mahemadia getting to Port Said shortly after 1 oclock\n","134":"\nthe journey 26 miles is very slow & tiresome The line follows the sea beach. Went for a swim in the afternoons & also for a row We pulled out to the \"Suevic\" the vessel we came over in & had a yarn with some of the crew who were still there. Was also on a couple of mail boats & the passengers were very kind & gave us all the books they could. On Sunday we packed up our belongings only taking an overcoat & singlet & a pair of sox & our saddles.\n\nWe thoroughly cleaned up camp & slipt out of the lines at night. We were mounted & away by daylight & reached Katia about 7.30 am. had breakfast, watered our horses & then pushed on. We got to Oghratina about noon & reached Hassaniya a little after 2 oclock. It is not much different to any other camp & we cant have near the comforts we had at Et Maleh no mess no tents or other comforts We have to make the bare issue suffice. The water supply is\n\ngood & the weather is getting cooler but the flies are still bad. On Saturday morning at 3 am our Brigade left camp & marched to Ganddel NE from our camp at Hassaniya. We reached there shortly after daylight & stayed there till 4 pm My troop was on left flank guard At dark we were joined by the","135":" Brigade & the artillery (8 guns) & we marched all night. It was very tiresome having had no sleep for nearly 2 days.\n\nWe reached within 2 miles of the Turkish camp at daybreak The","136":" Bgde went to the right & we went straight on. The Turks were well entrenched & we should have been 2 miles further north. As we were in the wrong place at daylight we had lost the element of surprise & it was impossible for us to make a frontal attack. We engaged them till noon","137":" inflicting casualties & taking 15 prisoners, our artillery shelling their trenches. Our aviators were very daring & did good work. On the way back we found water for our horses & selves We had a spell & boiled our billies at 3 pm\n\n& left again at 4 pm reaching Salmana at 8 pm where we watered fed & got a few hrs sleep before pushing on at 4 am. We got back to camp at Hassaniya at 7 am Monday & we were all glad to get back & have a decent sleep. After 1 week in camp where we had an easy time our squadron went out in support duty for 48 hrs. Our horses had a good time, we had plenty of feed & water & any quantity of dates. We were relieved by a squadron of the","138":" An Australian mail came in & I got a couple of letters one from home & one from Doug.\n\nA canteen has been started both dry & wet. It proved a great boon as we could get nearly anything we wanted. Sergt Wilson of C Squadron who went in to buy the canteen stuff had very hard luck. He fell under the train & got both legs cut off. He was taken to the","139":" Genl Hospl at Port Said. I believe is likely to get on alright. Sergt McNair also had a bad accident while in\n\nPort Said injuring his spine. There was big consignment of gift goods from Victoria Racing Club, butter, tinned fruit tobacco & cigarettes, sauce tinned milk & fish. We lived very well for a few days afterwards.\n","140":"\nB Troop was detailed for camel escort to Oghratina. We got there at 10 It is a tiresome job as the camels travel slow. We had lunch fed & water our horses & brought back an English Yeomanry Captain who is taking over the camp for his Brigade when we leave. On the 29th at 7 am the Brigade marched out of Hassaniya for Romani at 3 pm & occupied the old ground we first camped on last April.\n","141":"\nRode over in the morning to see Cousin Will of the","142":" Scottish Rifles who happens to be only ½ a mile from our camp here. I found him easily enough & stayed & had lunch with him & we had a great yarn about different things. He looks very well, but says he is\n","143":"\nfed up of the desert.\n\n1st October\nWe struck camp at Romani & the tents went on to Hill 70 where we are going to camp for a while so as to get our horses fit again. We are going to get a fair amount of drill & discipline as the heads reckon we are very slack. At 1.30 pm the Brigade paraded & General Chauvel addressed us & afterwards presented Lieut Finlay of the 7th LH a DCM he won at Cape Helles. After tea I went over to the Canterbury Mtd Rifles to see Sgt Lockington a cousin of the Kogarah Lockingtons but he was away on leave at Alexandria.\n","144":"\nWe got away from Romani at 8 am The morning was very warm. It was a fairly solid ride to Hill 70 – 18 miles! & we did it in 6 hrs having 5 or 6 halts The camp at Hill 70 was practically deserted There are mess sheds & horse sheds. We got to work straight away fixing things up & I was Sqdn orderly Sgt. I had a very busy time parading fatigue parties for\n\nOctober1916\ndifferent duties\n","145":"\nEverything is being done very regimentally again & it comes very hard. We were very busy all day getting the camp in order. Water is scarce it is hard to get any to wash yourselves with & I would sooner be back on the desert where we had the wells. We got our mess tent up & sent in 2 sergeants to Port Said to buy things for us so we ought to be alright in a few days when we get fixed up properly.\n","146":" to","147":"\nWe have half an hours dismounted drill in the morning & from 9.30 to 11 am mounted drill in the morning. In the afternoon we have no parade but stables is at 3.30 pm so you don't seem to have too much time to yourself. Leave is being granted to Port Said again 2 men per troop to the rest camp for 1 week & 1 man each day for 48 hrs. 6 per troop were also sent to Alexandria to the Sidr Bishi Rest camp for a week. As there were not many financial\n","148":"\nEnough to go. I went myself & we left camp at Hill 70 at 5.45 and rode to Kantara & caught the 9.30 am special train getting to Alexandria at 4.30 pm. The change of air camp is nicely situated near the beach & there is every facility for the troops comfort. A large amount of freedom is granted & the troops have only to keep themselves & their camp clean. We are allowed leave from 2 pm to 11 pm. The tramway is nearly 2 miles from the camp & is a good stiff walk; a good service is run.\n\nAlexandria is the best place I have been in, it is more European than the other towns in Egypt. The Residential part of the town is very pretty & there are many beautiful houses & gardens. I called in on my old pal Bill Long at the Records Section & we put in the afternoon & evening together & had a box at the Alhambra. There was a big crowd mainly military & quite the largest number of white women I\n\nhave seen since I left Australia. The show was an amateur one & did not appeal to me very much. We got back to camp at about midnight.\n","149":" to","150":" \nThe week at the rest camp stands out as the best I have had since coming to Egypt. Breakfast was usually the only meal we had in the camp My favourite place of dining was the Hotel Bonnard It was very quiet only a few civilians & officers being there & they were very friendly. There was a nice drawing room & we had some good music as Geo Berrie was very good on the piano & could play almost anything. We went to see \"Pops\" also some selections from Italian opera which were very good. We had a box on each occasion. Also visited the \"Kersaal\" & the Casino but both these shows were common & vulgar, some after the cheap music Hall style. On the Sunday we drove out to the Youzah gardens & they are very\n\npretty I never saw better collection of hot house flowers. The gardens are about 4 or 5 miles out of town & quite a crowd flock out there of a Sunday afternoon. There is a big foreign population in Alexandria mostly European of which the Greeks predominate The houses are mostly built on the flat system. It saves a lot of room but I don't like it. It is no wonder the people flock to the Gardens on Sundays after being tied up in a house all the week.\n\nWe did not indulge in any sailing, although the opportunities were there & a 32 footer only cost £1 to hire. We frequented the Skating Rink & made a few friends, including 3 little school girls, who made a great impression on us. We took their photos & used to see them every afternoon. We used to have a good swim every morning. The weather was beautifully warm & the sea calm. We were very sorry when the","151":" came & we had to\n\ngo back. We left by train at 10.30 am & got back to Hill 70 at 8 pm.\n","152":" to 27th\nGot back to the same old routine stables exercising horses every day. An easy time but very slow. It took me 2 days to get over my trip, during those 2 days I had long lapses of forgetfulness wasn't living on the desert at all! Another party went to Alex on the","153":" followed by others on the","154":" & the","155":" I believe no more are to go after the","156":" lot. However leave is still being granted to Port Said but it is a dingy slow place & little better than being in camp.\n\nJack Cheater the SQM went on leave & I took over his duties. There is only about 2 hrs work to do each day & you are practically your own boss. It is the softest job I have had & I only wish it would last. An Austln mail came in on the 23rd & I got 2 letters one from home & the other from Doug. Having plenty of time I got the bulk of my correspondence\n","157":"\nAnswered. A parcel sent by cousin Meg also arrived. We have rumours that we are going East again. It is probably correct, but I don't think any of us want to go that way again.\n","158":" to","159":"\nStill in the Hill 70 camp pursuing the same monotonous round of duties. The weather is getting cooler & the days shortening. Football is the popular sport each squadron has a team & nearly all the spare time is put in playing. Alexandria leave has been cut out & men are going for 7 days to Port Said. However it is possible to get special passes to Cairo & Alex from the Port Said rest camp which makes it fairly good. The Regt has been doing its course of musketry again. The range is a very poor one. I got the","160":" highest score in the squadron The shooting right through was very satisfactory Received my first Xmas parcel on the","161":" Some West Indian troops came out to the Hill 70 camp. They are big on boxing \/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/\/, play the\n\nbanjo & drink beer. They all seem to have money, but get an additional ½ crown a day on to the English rate. On the","162":" B Troop was detailed to proceed to Hod Arris & we got away at 8 am on the","163":" leaving only some men who were going on leave to Port Said & a few special duties. One troop from C Squadron also came The morning was very foggy till after 10 oclock. We reached there at 11 am. It is a good place containing several acres of palm trees. Camels followed us with rations & fodder & we soon got settled down There are only 2 patrols & 2 outposts each day to find, the rest of the time we can loaf about, write, read, smoke or play football. Water is plentiful both fresh & well water. On the","164":" I took the patrol & first went to Bada, S of E 5 miles There is a good palm grove there & wells. Pushed on N of E & reached Jaffia another 3 miles Here again are good wells & we\n","165":"\njoined up with the other patrol. Signalled back to camp & waited till about 1 oclock. Came back through Simara where there are plenty of dates & got back to camp about 3.30. Our pay had been sent out, so we drew the money which is of not much use to us here. Our rations come out every 48 hrs also horse feed. We have got nearly all our horses clipped & they look much better for it. Mosquitoes are very busy here have got my forehead bitten all over\n\nWe do a bit of revolver practice of which I find myself pretty good. Also have a football, but had the misfortune to puncture it. The nights are very long & candles scarce, but Farquhar & myself play the officers bridge & have beaten them every time & I am not an expert with the cards. We got some mail on the 17th. Received 3 letters one from home also a parcel with 2 pairs of sox\n","166":"\nwhich were very acceptable. Football is going very strong in the camp & the 6th have only been beaten once by the","167":" but hope soon to get their revenge. We have a splendid team together & inter squadron matches help to keep them in condition. Have played a few games myself in the troop & squadron matches & feel a lot better for it.\n\nOn","168":" we marched back to Hill 70. There are substantial rumours that we are going East again in a few days. Our patrols have been nearly in to Palestine & there has been several encounters with them. A good deal of bombing is being done on both sides. On the","169":" we marched out from Hill 70, travelled all day & got to Romani just before dark. Romani looks deserted now to what it used to be. Pushed on again next morning & stayed at Khurba. Next morning we left the railway\n","170":"\nline, marched to Hassaniya where we watered. We got to Bayoud about 1 oclock put down our horse lines & made ourselves as comfortable as possible. We relieved an English Yeomanry Regt & they left the camp in a dirty state. Flies are very numerous here while at Hill 70 we hardly had one. The days are very cool & the nights cold. There is plenty of work here, patrols outposts, escorts etc.\n\nOn the","171":" I took the patrol & joined up with a patrol of C Squadron. I picked up a fine length of Manilla Rope. It will just do for picketing B Troop, being about 25 yds long. Also found 2 Scotties of the Scottish Horse Cavalry who were lost. They had got a couple of miles off their track. Every second night we get outpost here & the nights are very cold on top of the sand hills. A few days after we got here an enemy aeroplane dropped 5 bombs but the aim was very bad, the machine being very high up &\n","172":"","173":"\nout of range of our machine guns We are rather out of the way here & there are no canteens. The nearest Bir el Abd is nearly 10 miles away & as the army ration doesn't offer any choice in your menu, I went with a couple of men & pack horses to Bir el Abd to buy stuff for the Squadron. The 7th HLI were camped there so I went up to see Lieut Todd who is engaged to Cousin Mattie He got my horse watered & fed, provided drinks, smokes & a good meal for myself We had a couple of hours yarn & he got a horse & rode back about 7 miles on my homeward journey with me.\n\nOn the","174":" I took the patrol to Gamel, a splendid oasis with good water where a squadron of the","175":" are camped. It is just an hours ride from here. On the afternoon of the","176":" we got inoculated for cholera again & at dark a company of Australian Cavalry arrived They went on again next morning & tomorrow morning a Squadron of ours goes out to\n","177":"\nmeet them to carry out some reconnaissance in the Hills to the South East. We got a big Australian mail, some papers & parcels. I got letters from home & from Kate & Doug & answered same next day. Also sent cards & letters to relations in England & Scotland. On the","178":" we got about 30 reinforcements with some new horses which were only fair. I took over orderly Sergeant on the","179":" for a week. It is a fairly good job in this camp as it gives you every night in.\n\nAn enemy aeroplane came over on the","180":" but dropped no bombs. Heard later that one of our anti aircraft guns brought it down near Salmana. A lot more gift parcels arrived during the week & they were very welcome. We lived better for a few days in consequence. On the","181":" B Squadron went out to Zagadan about 12 miles SE of here. The camel corps went further, but didn't meet with anything. Another mail arrived on the","182":" I got letters from\n","183":"\nhome from Doug, several papers & parcels from Mr & Mrs John Scarvell & from Doles. During the week the Anzac Mtd Division less our Brigade marched into El Arish with scarcely any opposition. On the","184":" they pushed on & struck the Turks at Magdaba where after a sharp fight they took the Turkish positions which were made well, several being of concrete. 1130 unwounded Turks were taken prisoner & their casualties were heavy. Our total losses could not have been much more than 1\/10 of the Turks. Our brigade was very disappointed not being in this show. The wounded & prisoners were all got away by sea which would be much easier than by the rough desert railway. On Xmas day I was out with 7 men all day at a place called Reuisat. It was very cold & in the afternoon it rained enough to wet the ground. We got back to camp at dark. More puddings & Xmas billies arrived so we have got enough\n","185":"\nplum duff for a week. Boxing day was cloudy & cold. At night there was a thunderstorm & heavy rain. Nearly everybody got wet as their bivouacs are made more for sun shelter than for rain. I was lucky having a little old canvas tent which let in a bit of water but nothing much to worry about.\n","186":" week was very miserably spent on account of the rain wind & cold. As soon as the rain dries the sand swirles everywhere with cutting fury There has been little sun & the horses have been feeling the cold severely. We got a rum issue on the last day of the year, & the only one we had during the year issued. An Australian & English mail arrived on New Year's day. I got 5 letters altogether which is a bit of a record for me Have been putting in the last few days drawing some maps of the Turco-Egyptian frontier on a smaller scale so that they will carry easier in the pocket.\n","187":"\nThe New Year came in wet & cold & windy On the","188":" it fined up. A & B Troops went to Reuisat & Zagadan. Zagadan is 12 miles SE of our camp. 6 of us struck south from Zagadan & followed out some Bedouin tracks in a westerly direction as it was too late to follow them East. We came across the place where they had their goods & chattels packed & covered up. We got papers & next day sent out some pack horses for anything useful in their stack.\n\nOn the night of the","189":" we got some more rain, but it fined up again next day. More mail came in & I got 2 parcels & a few letters. On the","190":" the Anzac Mounted Division attacked Rafa on the Egyptian Border & had a stiff fight eventually capturing the place. The ground was bare & without cover & our casualties were over 500. Over 2000 prisoners were taken & the Turks had 600 casualties. Our troops suffered some from British\n","191":"\nshell fire, but don't know to what extent.\nOn the","192":" Major Genl Chauvel inspected our camp here & was well pleased with the appearance of horses & men. Major Genl Watson inspected us the following day. Sports were held at Hassaniya but our Regt didn't take part. C Squadron played the","193":" 2 games of football, the first was drawn & the","194":" C Sqdn won by 5 to nil. The weather has fined up again but the nights are cold. Things are quiet again on our front.\n","195":"\nI went over to Hassaniya & got some maps. Saw Jean McCarthy & Stan Rogan I stayed with them for a couple of hours & got back here just before dark. I got a letter from Cousin Carrie in London. There was an Australian mail last week Got 3 letters 2 from home & 1 from Doug also some papers including \"Gazettes\" This place is getting monotonous. Have been here 2 months now. Outpost every second\n","196":"\nnight & often day duties. It is not very hard but we are away from everything on our own, so we are all looking forward to a change. There are many rumours about reorganising & going somewhere else, but time will tell. Still many of the \"prophets\" get very close.\n\n"}}