{"Document Name":{"0":"Diary_0297","1":"Diary_0297","2":"Diary_0297","3":"Diary_0297","4":"Diary_0297","5":"Diary_0297","6":"Diary_0297","7":"Diary_0297","8":"Diary_0297","9":"Diary_0297","10":"Diary_0297","11":"Diary_0297","12":"Diary_0297","13":"Diary_0297","14":"Diary_0297","15":"Diary_0297","16":"Diary_0297","17":"Diary_0297","18":"Diary_0297","19":"Diary_0297","20":"Diary_0297","21":"Diary_0297","22":"Diary_0297","23":"Diary_0297","24":"Diary_0297","25":"Diary_0297","26":"Diary_0297","27":"Diary_0297","28":"Diary_0297","29":"Diary_0297","30":"Diary_0297","31":"Diary_0297","32":"Diary_0297","33":"Diary_0297","34":"Diary_0297","35":"Diary_0297","36":"Diary_0297","37":"Diary_0297","38":"Diary_0297","39":"Diary_0297","40":"Diary_0297","41":"Diary_0297","42":"Diary_0297","43":"Diary_0297","44":"Diary_0297","45":"Diary_0297","46":"Diary_0297","47":"Diary_0297","48":"Diary_0297","49":"Diary_0297","50":"Diary_0297","51":"Diary_0297","52":"Diary_0297","53":"Diary_0297","54":"Diary_0297","55":"Diary_0297","56":"Diary_0297","57":"Diary_0297","58":"Diary_0297","59":"Diary_0297","60":"Diary_0297","61":"Diary_0297","62":"Diary_0297","63":"Diary_0297","64":"Diary_0297","65":"Diary_0297","66":"Diary_0297","67":"Diary_0297","68":"Diary_0297","69":"Diary_0297","70":"Diary_0297","71":"Diary_0297","72":"Diary_0297","73":"Diary_0297","74":"Diary_0297","75":"Diary_0297","76":"Diary_0297","77":"Diary_0297","78":"Diary_0297","79":"Diary_0297","80":"Diary_0297","81":"Diary_0297","82":"Diary_0297","83":"Diary_0297","84":"Diary_0297","85":"Diary_0297","86":"Diary_0297","87":"Diary_0297","88":"Diary_0297","89":"Diary_0297","90":"Diary_0297","91":"Diary_0297","92":"Diary_0297","93":"Diary_0297","94":"Diary_0297","95":"Diary_0297","96":"Diary_0297","97":"Diary_0297","98":"Diary_0297","99":"Diary_0297","100":"Diary_0297","101":"Diary_0297","102":"Diary_0297","103":"Diary_0297","104":"Diary_0297","105":"Diary_0297","106":"Diary_0297","107":"Diary_0297","108":"Diary_0297","109":"Diary_0297","110":"Diary_0297"},"Date":{"0":"unknown","1":1465.0,"2":1466.0,"3":1467.0,"4":1468.0,"5":1469.0,"6":1472.0,"7":1473.0,"8":1477.0,"9":1479.0,"10":1480.0,"11":1482.0,"12":1484.0,"13":1485.0,"14":1486.0,"15":1487.0,"16":1488.0,"17":1489.0,"18":1492.0,"19":1493.0,"20":1494.0,"21":1495.0,"22":1497.0,"23":1498.0,"24":1499.0,"25":1506.0,"26":1507.0,"27":1508.0,"28":1509.0,"29":1510.0,"30":1513.0,"31":1514.0,"32":1515.0,"33":1534.0,"34":1535.0,"35":1542.0,"36":1543.0,"37":1544.0,"38":1546.0,"39":1550.0,"40":1553.0,"41":1556.0,"42":1558.0,"43":1561.0,"44":1563.0,"45":1565.0,"46":1567.0,"47":1568.0,"48":1569.0,"49":1570.0,"50":1571.0,"51":1572.0,"52":1575.0,"53":1576.0,"54":1581.0,"55":1582.0,"56":1583.0,"57":1584.0,"58":1586.0,"59":1587.0,"60":1588.0,"61":1590.0,"62":1591.0,"63":1592.0,"64":1593.0,"65":1594.0,"66":1595.0,"67":1604.0,"68":1605.0,"69":1606.0,"70":1607.0,"71":1608.0,"72":1609.0,"73":1610.0,"74":1612.0,"75":1613.0,"76":1614.0,"77":1615.0,"78":1616.0,"79":1617.0,"80":1618.0,"81":1619.0,"82":1620.0,"83":1621.0,"84":1622.0,"85":1629.0,"86":1630.0,"87":1631.0,"88":1632.0,"89":1633.0,"90":1634.0,"91":1635.0,"92":1636.0,"93":1637.0,"94":1638.0,"95":1639.0,"96":1640.0,"97":1641.0,"98":1642.0,"99":1643.0,"100":1646.0,"101":1647.0,"102":1648.0,"103":1649.0,"104":1650.0,"105":1651.0,"106":1652.0,"107":1653.0,"108":1654.0,"109":1660.0,"110":1661.0},"Entry":{"0":"\n\n \n\n","1":" ’17 \n\nUp to the last minute almost, I was doubtful as to getting on the draft. It is only ten days since I left hospital and only last Monday that the Doctor let me go back on duty; but Sergeant Miller helped me through. The idea of being amongst the last of our batch of reinforcements to go over I don’t like. There is one man of our crowd who is trying to avoid the draft – Peters. He has already avoided three, owing to dental troubles; and thought he broke his false teeth by falling in the hut. The others who are here are all eager: but Williams who went away with me on special leave has not turned up yet --- two days overdue.\n\nWe fell in, all correct, at 6.30, and didn’t get away till 11. A crowded train, with numbers of men returning to the front, and very disgruntled at it. Reached Southampton in the afternoon, and had to wait about till 8 o’clock, the position being relieved by a few light refreshments. It was at Southampton that a Conducting N.C.O. in charge of our draft about a month back, lost himself. He sneaked away up town, got drunk & forgot the draft, which went over & reported without him. The poor chap had come over on 6 months duty in depots; but they sent him back for this episode; & he was killed almost a soon as he arrived.\n\nMost of us new men are curious, excited & eager; the old hands are a bit morose over returning. In the big sheds\n\non the wharf station there were numberless different units with the packs and equipment in lines marking their position. There were a mixture of races, including some colored ones. The wait was tiresome, but the embarkation was rapid when it started. We simply went on board in a continuous line receiving our life belts as we trailed round the deck, and then right down to the lower decks to stack our equipment. Then some biscuits & cheese & hot tea issued. The only thing more solid since early morning breakfast was the tin of \"bully\" between three issued before leaving Camp & eaten in the train. The boat, which used to travel from Harwich to Antwerp, was packed to many times its travelling capacity. Not an inch of room anywhere; and if a \"tin fish\" got us it would have had a haul. When I tried to walk the deck, I had to pick my way painfully between sleepers lying on top of one another almost; but, as all lights were out, moving became painful. I went to sleep standing up against the rail. Couldn’t find any room to sit or lie down. We were slipping out of port, before I had come on deck from stacking my kit, with two destroyers bounding about near us; and we seemed to pick our way through an amazing twisting of lights. At the last light a grey destroyer seemed to take us into custody and we went into black night with the whole vessel shaking as it got to top speed and chased a dim stern light on the destroyer. Other destroyers now & then rushed up close to us during the night, more noticed by swish of water than noticed by the grey shadow interfering with the glint of \n\nthe waves. \nI woke looking at new l\n","2":"\n\nI woke looking at new lights, and we were threading our way into Havre. Didn’t get in until quite late. Berthed near us is a big American transport which is said to have brought 5000 Yankees over. The port of Havre we saw was not attractive; but the dock-wards parts of few towns are attractive. Seeing drinking shops with \nthe\n titles like \"Elephant & Castle\" to attract the Tommy soldiers, amused me. Women with fruit to sell chased us, & did good business in the halts upon our march: one of them seemed only to know \"Appoos! – appoos! three for a penny each!\" She was selling pears. I told you a lot about Havre when I got over before; the men at our camp are mainly different now; and only one remembers my having come over as someone else. He reckons we will be bundled off to the line straight away, as the Battn. is going in, and he says it was badly cut up.\n","3":"\n\nWent through gas masks tests, and then had a long march, mostly uphill, to the gas school where what looks like an army corps of men were put through the gas chambers, and given \"gassing\" about gas by instructors. I got a queer sensation looking over a crowd of the Tommies. It seemed to me that a lot of girls had smuggled into uniform. Of course it was the \nfact of\n impression given by their pink, fresh faces, and the fact that many of them are so young. It gave me a sick feeling though, to see them. I understand we entrain for the north tomorrow.\n\n(Will keep this going, sending it when I can.)\n","4":" \n\nWe did not move out until the","5":" and then we had to get out at 5.30, with a long march to the Station, although I found that the line we passed several times was the one we travelled subsequently. It was snowing a bit, & the streets were slippery. The entraining business was a slow, messed up proceeding; but the French people sold us long thin loaves at a franc each (say 10d) When we got our car, a cattle truck to hold \"6 horses or 36 men\", we got a fire going with the aid of coal stolen from the engine & a biscuit tin; and we had a skirmish with the M.Ps who wanted the thing out. We kept the door closed, stifling with the smoke, for a long time. And after the M.Ps, with the aid of all the officers in the army – or what looked like it – had the fire out, we made provision for starting it again as soon as we started. It was bitterly cold & we needed it, although the smoke worried quite as much as the warmth pleased us. \n\nAll we got on the way up was \"bully beef\", \"Maconochie\" cheese, biscuits & dry tea which we had to make by getting water from the waste pipes of the engines when the train stopped. Still 30 men in a truck, with their blankets spread, keep one another warm. It didn’t please us to see our officer empty chicken bones from a plate out of the window of the carriage where he was enjoying life. However, at Hazebruck, which we reached in the evening of the second day, on which it snowed heavily, we scored revenge, even if a vicarious one. We transferred to another train there; and as I was passing along the track by the cars, an\n\nofficer who was supervising unloading operations asked me to \"lend a hand there\". I was passing when our Corporal Lewis pulled me up; and when we got to our car – a real carriage compartment this time – we had a really nice case of Christmas delicacies with us. It included tinned chicken, tinned lobster, muscatels etc.\n\nWe arrived at Caestre at midnight or thereabouts , and marched out to a concentration camp just outside the village, which is a quaint one with a queer old church. From there we could hear the guns. They were constantly at it, making a sort of metallic rumpty to rum! – reminding one very much of a printing establishment in full blast.\n\nIn that camp recently men wandering about with braziers which they swayed in the wind to make the contents burn up attracted Fritz airmen & the place got well bombed, with many casualties resulting. They are careful of their lights now. We were in tents but they were all painted with camouflage, & surrounded by little bunches of sandbags a foot or so high to give protection from bursting bombs. We stayed two days at Caestre, during which the camp got full up; and then we were put into motor waggons, and rushed up through Balleul, (a place I want to inspect) and some other towns to Kemmel. I am now with the Battalion allotted to B Co. Platoon 7.\n\nWas given quite a nice reception by the boys, when they\n\nheard my name. They have heard of the business which resulted in Capt. Pearce’s downfall, and seem to appreciate it. No doubt it makes things better for me – the officers seem to know me and quite a lot have already spoken to me. I met a man named Lanser coming back to join D Co. & became acquainted. He is a cousin of Miller Lanser. Miller was killed a week after he returned with his commission. He seemed greatly liked.\n\nKemmel is the first really knocked-about place I have seen. The least destroyed houses have the windows stuffed with sand bags & boards & are put to military use; other places are now piles of rubble; the church is a wrecked & the monuments in the churchyard are knocked every way; there are little graves with wooden crosses & the French tricolor flown on them right in the town. The Y.M.C.A. is in the Town Hall. \n\nSingularly enough a rather fine Chateau, which, before shells made a mess of things, was surrounded by a fine ornamental lake & grounds is practically untouched. It is stated that the place is owned by a German; but I think the more likely solution is that the Germans imagine it to be used as a hospital. Anyway, its convenient for headquarters.\n\nWe are living in huts in \"Rossignol Camp\". The huts, which each hold about 30 – or would if the platoons were\n\nnot so weak – are built close up against the trees at the side of the road & the roofs are camouflaged so as to protect us from observation by enemy ‘planes which come over daily. When they arrive there are sharp whistles for \"take cover\" & you hear the anti-aircraft guns \"tutting\" away everywhere.\n\nThe artillery gets to it hard every night, but, strangely enough, it is not as disturbing or pronounced here as it was at Caestre. It may be I am more used to it, but I think that the acoustic property of the hills have something to do with it. I believe that the cause of their agitation is a desire to make good the Passchendaele push.\n","6":"\n\nBowen & I decided to have a look at the front line today. Bowen came over with me, and is also anxious to see things. We were pursued & brought back, & told not to be foolish, and that, anyway, our \"tin\" hats would have to be worn. We put them on & tried again, & had a rather good time wandering through old disused trenches & tangled wire. Discovered a graveyard in a place called \"Irish House\" where there was one big cross to a lieutenant \"and 32 men of the Gordon Highlanders, died July 1916, buried","7":" by the Irish Fusiliers. We were climbing a ridge over which I hoped to really see\n\nsomething, when a snow-storm started, and as I couldnt persuade Bowen to come on I went back with him. War, as far as we are concerned just now – we are in reserve – is a quiet thing. I have met practically no drill since I have been in France & very little discipline. We have a fall-in in the morning, a rifle inspection, & a few games, & the rest of the day is ours.\n","8":"\n\nI discovered that there is one place in Kemmel where there are still civilians – a quaint little shop with vulgar, highly colored cards & an assortment of all sorts of foods. Some diggers were knocking at the door, which was closed, and when I got near a woman opened it & said \"Horsh! Horsh! you will wake the baby!\" Fancy waking the baby that seems undisturbed by the guns! – for there really is a baby there, it seems. But fancy also civilians hanging on in the battered place!\n","9":"\n\nHave discovered three things. Neuve Eglise, Dranoutre, and a man to play chess with me at the \nSchool of arts\n YMCA – Beebe, who was a member of the School of Arts, Sydney. He belongs to another \ntroop\n battalion. Neuve Eglise is the headquarters of our","10":" Brigade, and is almost as badly smashed as Kemmel. Taking a straight line between Neuve Eglise \n\nand Kemmel, and creating a triangle upon it, you can find Dranoutre about the apex. It is the nearest town where ordinary life is going on – including the estaminets, and was worth the visit I gave it. Eggs and chips are also obtainable there – with bacon if you bring your own slice, issued every morning. I had four eggs & a cup of coffee for 2 francs.\n","11":"\n\nWe had quite a fine Christmas, but it opened badly. Weather is very cold, and the ice on one of the ponds in our camp was frozen hard. A lot of the boys made a slide & were enjoying them selves when a Fritz ‘plane came over. Some of the boys did not take cover, and there was a crash & a squeal suddenly. What had happened was that an anti-aircraft \"dud\" dropping, had landed right in the pond, cracked the ice, & cause two casualties with flying ice-pieces. The argument is now whether the men will be charged with S.I.W.. Charges for self inflicted wounds are very frequent now - & the wounds need not be willfully self inflicted. These men might suffer for failing to obey an order to \"take cover\" \n\nFritz ‘planes have been dropping handbills behind our lines informing the people that he intends to come over for Christmas, and I fancy that \"something doing\" is anticipated. We got an inkling of it last night - after\n\na glorious day. The dinner was quite good. A lot of poultry had arrived for the officers & somehow we managed to get at least a flavor per man in our own dinner, which was roast beef & desert. Any amount of plum pudding that we could eat followed, with, subsequently figs & custard – or what was meant to be custard & .\n\nThen we had a double issue of rum and an issue of Red Cross Comforts – Chocolate, cigarettes etc. The C.O. Division sent round beer for each platoon; and the CO. Battalion did likewise – a big dixie full per platoon. Then the O.C. Company got a brain wave & also sent round a dixie-full for each of his platoons; after which the O.C. platoon decided that it was up to him. Then, of course, we shouted for ourselves & each other; and as the \nBattal\n Divisional Canteen had plenty of beer things became hilarious & noisy. \n\nThe noise had just stopped & \nthings\n slumber was settling on the camp when the \nRSM\n C.S.M. woke us up by breaking in & telling us we were to sleep with our rifles & equipment handy ready to fall in, as Fritz was expected to attack in force. I felt that \"the moment had come\" & lay awake waiting for it for some time, but when I went to sleep nothing disturbed me till this morning.\n","12":"\n\nWe have been lately out on some queer fatigue each day. We go out – one day it was to Messines \n\nwhere, they are altering the level of the road – digging it down, to avoid observation. We had to try and pick & dig a roadway that was like hard glass. Here I came near shell fire for the first time; for Fritz peppered the locality all day. The feeling I had was merely intense curiosity, & a desire to watch the landing of the shells, which brought me reprimand. This carelessness about the shells surprised me – I had anticipated having a bad time at the first experience. We also worked at Wulverghem, loading G.S. waggons with ballast. \n\nThe whisper amongst the boys however, is that some day-time move from Fritz was anticipated, & we were to be handy, if wanted. At Wulverghem there is a curious sign on a tree which has been given additions. The original sign was \"To Berlin 1916\", to which an Australian, adding a pointing hand, indicating the other direction had attached below \"To Australia 1917\" \" by way of the dressing station : . Another wag had added a hand pointing downward with the sign \"To Hell 1917\"\n\nToday on guard. Tonight I believe we move in to the line.\n\nAm getting this away, now, as the chance comes.\n\nHM\n","13":"\n\nAs a preliminary to moving into the line we handed in our felt hats & all blankets but one, to the QM store. To me, naturally, the move was full of interest: my curiosity about the line will soon be satisfied. The boys, who have noted my anxiety to wander forward, tell me I will soon know all I want to know. To tell the truth I don’t think I would be sorry if the trip \nwould\n in were put off a day or so; yet in spite of a kind of apprehensive feeling, I know I would also feel disappointed. \n\nWe carried our packs, then following the example of the experts I carried mine \"Gallipoli fashion\" – just fastened on the small supporting straps, which are looped so that the arms can be slipped in them. This enables the casting of pack in a moment with out\n","14":" contd\n\ninterfering with the rest of the equipment. It proved very convenient during the short halts. We moved off in platoons at fifty paces distance, directly darkness commenced – at I suppose 5.30, though we fell in at 4.30. We moved off by what is known as the \"Gordon Road\"; and, directly we struck it, orders were passed back in whispers, and strict silence was insisted upon. This must have been quite unnecessary, as it was quite 5 or 6 kilos before we got to our position in supports, and nothing could have been heard ten miles away; but the enforced silence, and the shuffle of the long shadowy line through the darkness was awe-inspiring to a new man. It gave a sense of impending danger We progressed slowly, with many halts; and I thought that we were near the end of our journey when we left the road & took to the \"duckboards\". By this time the\n\nDec 30\n\ndarkness was very intense, & nothing could be seen but the shadow of the man ahead of you, a brief length of the duckboards upon which we were walking, & the occasional deeper blackness by the edge of it, where there were shell holes. The duckboards were very slippery, and accounted for many falls, which are not pleasant, especially with full equipment; & the presence of these black holes to fall in increased \nit made one more\n nervousness about them. Contrary to my expectations the duckboard track proved a very lengthy one before we reached our destination; but towards the end the Germans made things better for us by their habit of sending up \"flares\" – very much like the thousand times magnified stars from what are known as \"Roman Candles\" – which, though a long way away, threw some light on our paths. Our track went down suddenly & we\n\narrived in a pitchy black place known as \"The Ravine\" which is \"supports\" in our sector.\n","15":"\n\nThe ravine is a deep natural trench in the hill side, which affords wonderful shelter from enemy fire; and naturally lends itself to the making of dugouts, with which its steep sides are perforated. Unfortunately the mouth of the ravine opens slightly towards the German lines and movement during the day is not approved. It used to be a German position, & most of the German dugouts are on the side looking towards our present front line. The officers have these, which are much better than ours. In one of them is a beautiful enamel stove. From what is left it appears that the Germans had electric light, an electric pumping system to keep the dug outs drained; & they certainly had proper pegs to hold equipment & shelves for food etc. I struck what appears to one to be a sort of perpetual motion\n\nsystem – electric power pumps the water out of the dugouts, & the water out of the dugouts goes to make power. I pointed this out to Bob Humphries, an officer with whom I have become friendly. He says that the British principle is not to spend time on improving positions as the policy is to move forward: but this position has been held for a long time without any move, & a greater care to comfort would ensure better health among the troops.\n\nOur dugouts are noisome places. The one where I and six others are located has a pool of stagnant water in the entrance, into which planks, sacks and blankets have been thrown to make a track – but going in in the darkness one usually goes in up to the ankles. The water has made two lower bunks near the entrance unusable. There is a stink in the place which some of the men who reckon\n\nthey can tell the distinctive smell of a dead German from that of any other dead man reckon to arise from a Hun buried in the end of the dugout, which has fallen in – with the Germans it probably communicated with some other exit & provided ventilation. You can see where the equipment pegs etc have been, but they have gone; and useless electric wires pass along the roof. Still, the place is warm; & being many feet at below the hill above us is quite safe. There is a big dugout capable of holding almost a battalion dug down into the ground about twenty feet under the level of the ravine itself. Its floor is slippery with water; and sometimes the pumping apparatus to keep it from becoming too bad fails altogether & a flood is threatened. \n\nThere are already signs of illness, \"trench feet\" having developed\n\nin some men.I suspect, from a knowledge of some of the men reporting, that the main reason is a desperate desire to keep away from the line. The Huns threw a lot of poison gas in the vicinity of the Ravine.\n","16":" \n\nManaged to get on a \"Fighting Patrol\" by asking the O.C. platoon, \nto put\n who was taking it out to put me on. He is a nice fellow, but has a reputation for windiness. He urged me that I did not want to rush things, especially as a man with any family: but when I urged journalistic eagerness to see things, put me on. When we were waiting to go out he did not appear: he had gone sick; and the Sergeant, Viv Stevenson was ordered to take the platoon out. That is how I got my first view of No Mans Land & the line: but matters were very quiet, except\n\nfor the Fritz flares, which gave us all the light we had, and were constant, and the occasional startled barking of machine guns – \"tut-tut-tut-tut-tut – like awakened dogs, bursting into a chorus of noise. We have a system of outposts here – not regular front line tenches; & the only sign of a \"line\" I saw was a few men standing by some mounds of ruins, reinforced with sandbags, here & there.\n\nThe night was very dark, I hardly think I could have found my way back, myself. The twisting duckboard track, broken \nhere & there\n in places by shell fire, & the difficult muddy path twisting round shell-holes, was puzzling in the extreme. The whole ground seems pitted with holes, merely separated by a fretwork of natural country; and the whole place is swampy. Even without falling into shell-holes we were up to our knees frequently. As I had anticipated feeling my first experiences rather a strain; I\n\nwas pleased to find that I had no windiness at all – I was more concerned about falling into shell holes than by the machine guns, though the bullets \"pinged\" pretty close over us sometimes when we had to go down. The purpose of these fighting patrols is to support the idea of the Australian Command that wherever we go we are to be \"Masters of No Mans Land\". We are supposed to tackle & drive off any German patrols we find; and these methods have established a moral ascendancy over Fritz which causes him to be very windy when opposite to us. We met nothing however, & did not stay out long. Stevenson, who was in a pretty lively condition, said that if it wasn’t good enough for the O.C. to go swimming in No Mans Land it wasn’t good enough for him. He found a pill-box, & we stayed there for an hour or so, when he took us back, having written out a \n\nreport in which he referred to violent opposition etc. I was moved to write a little doggerel on \"The fighting patrol\", when I came back, which has already become popular with the boys.\n","17":"\n\nWe are now in \"the line\" our outpost being a post known as 5011. It is merely a semi-circular series of mounds, with really no protection at the back. I have not been able to analyse what it had been, because I am only in this position in the night time. At night all but two of us move back to a pillbox. The strength of these places is enormous. To get into ours we go down a sinking incline, & crawl through a narrow entrance. The space inside is only\n\nabout four feet high, the immediate roof being massive tree trunks stretched across at, I suppose, about ground level, or at all events the level of the mounds of the ruins which are the nest of the pill box. Above there is an enormous superstructure of cement blocks, sandbags, some tree trunks more cement & more sand bags. A direct hit with a big shell might kill us from concussion, but our situation in the ground would probably save us. \n\nAn incident of the moving-in rather shook the calm which I find rather to my surprise possesses me. As we were moving up the duckboards in the communication trench, we were asked to stand aside by a M.O. to let\n\na wounded man past. He was a ghastly sight, looking greenish and pain- racked, & covered with dark slimy patches – blood & mud. From some of the men following him down, we learnt, while we were still halted, that he had gone out on a patrol the previous night, and the party did not know he had been hit until they missed him when they came in. He was lying out in the slush & snow, wounded for 30 hours: it was impossible to go out to look for him before tonight. This brought to me the possibilities, and gave me a sick feeling. It was very pleasant, when we arrived\n\nat our post to be immediately called for a patrol!\n\nWe had the makings of a stunt \ntonight\n this morning. Fritz seemed fidgitty, and his machine guns were rattling constantly; and all of a sudden he laid on a barrage, which seemed to fall between us & supports. I had just ducked into a small dugout we had at the front for a smoke, when the \"stand-to\" came. The artillery barrage was accompanied by an intense concentration of machine-gun & (I suppose) rifle fire; and, while it was duck – duck all the time, as the bullets spat viciously, we had to keep a sharp look out. But, strangely enough, all feeling except a glorious warming of the blood, seemed to pass from me – we were expecting an attack\n\nto follow, of course. Corp Edwards, a fine chap, who had been right through the business, was in charge of our post & he comforted us by assuring us that if an attack came we would be wiped out but we would have to stick it out as long as possible to give \"supports\" a chance. \n\nThen our own guns opened up and Fritz shortly stopped. While our big fellows sent shells well back our eighteen pounders, whose sharp \"biff!\" reminds me of a first class fighter breaking suddenly into a fistic argument, laid a beautiful barrage on what, I suppose, was the German line. The line of fire was as straight as if it had been ruled; & in the dark night it was a magnificent display with rocketing pieces of shell spraying upward, just like rockets. The display was helped by the way in which the Germans used red, blue, green\n\nand white flares, & once or twice, red ground flares. The sight so enthralled me that I was leaning over our parapet when Edwards pulled me back. It was well, for Fritz opened up again, spraying a few shells all around us; and then he also laid a barrage – at his own line! Apparently he thought that we had attacked & got a footing in his trenches. We heard the bells ringing for stretcher-bearers, all over the place, subsequently.The stunt filled me with an actual sense of enjoyment, especially after a few \"pings!\" on my steel hat had given me a sense of confidence.\n\nWe do duty for about 13 hours, the nights being very long; the warm rations which arrive in large containers on the thermos flask principle are intensely enjoyed oi the cold night, & their arrival makes welcome breaks.\n","18":"\n\nHave been down with an attack of trench fever and feel dopey. I was strangely exhilarated up to a certain point, and just amused at things. \n\nFor instance some of the boys had brought sandbags in which to hang their rations from the roof of the pill box to dodge the rats & mice; and, waking up while the others were \nquite\n fast asleep, I roared with laughter to see these hanging bags just swarming with mice, while my own stuff, near my head, was unattacked. Throughout the night my high spirits prevailed; but when the relief came, & we had to move back, my energy seemed to go suddenly, it was a misery to lift my pack to my shoulders, & my legs became quite weak. I could do no more than crawl, and dropped right out of the rush back, which it appears is always a rather helter skelter proceeding. Men passed me, saying \"Shake it up, Mercer; youre liable to catch machine gun fire, here\"; and I didn’t care - I hardly knew where I was, and didn’t care much for that either, nor for the machine guns when they started. The feeling struck me that if I was hit it would save me a lot of trouble. By the time I got back to the old dugout in the Ravine, it seemed that I had been toiling back for hours; and I had a vague remembrance of losing my waterproof, which caught on a post & was pulled out of the straps on my pack; and of being passed by an officer who urged me to get off the duck boards quickly. The next I knew was that Wells, our O.C. was saying \"Come on Mercer; it’s stand to!\" In the trench, which is just above the Ravine, I imagined I was in a produce store, the sandbags, somehow, seeing piles of pumpkins. & the machine gun absurdly appearing to me as a parrot! Don’t remember\n\n\"Stand down\" being given; but after a sleep, I felt all right again in the afternoon; so much so that I volunteered to take the place of a man on a fatigue to bring up rations from Clarks’ Dump, where the light railway finishes; thinking that he naturally would relieve me of a later fatigue. But he proved no sport, and almost immediately I returned I was on a fatigue carrying \"flying pigs\" to the Russian Trench Mortar. These shells, which have wings like the blade of a propeller, weigh 154 pounds and \nhave\n contain, in the shell, 56 pounds of amonal. In tests they made holes 37 feet across & 18 feet deep! When they go off the contusion can be heard even down in our deepest dugout – the one twenty feet down; & the explosion of the charge when it \nallights\n a-lights miles away can be distinctly felt. The idea is that we are trying to break some locks in the Comines Canal which will flood the lowlying German positions. As the Germans have been searching for the mortar the ground all round is pitted with shell holes; and the carrying of the huge shells in the darkness, two of us supporting one shell tied to a pole, is awkward work. Immediately after this, I was out with a camouflage party; and then came the call to carry boxes of 303 – service rifle ammunition. We were very shorthanded – platoon strength down to 25, - and there is a lot of work to do; but this beat me. SAA. is heavy, & the duckboards in the communication trench are broken in places by shells, & full of water at the bottom. When I went down I thought I had been hit; the next thing I distinctly recollect was that the doctor was in our dugout stating my temperature at over a hundred. \n\nThe M.O. wanted to send me back, but as I protested he\n\nconsented to my staying; but I had to go off duty for a couple of days, & rest: if I was not substantially improved I was to go back. The rest seems to have improved me; anyway I have got back to duty again; and I have carried rations out to our old post, amongst other things. I’m still dopey & a little feverish: seems to get better, but am played out almost immediately. A peculiar symptom is the curious tricks the eyes play. Looking at Fritz flares I was amazed to see a red cross in the centre of them. Thought it a new kind of flare; but although the same illusion struck me time after time, I assured myself by asking others that it was nothing but an illusion.\n\nThe man who was brought down after lying out in No Mans Land died shortly after reaching the ravine. We have had only a few casualties; but sickness is very prevalent; & the men who line up with trench fever and trench feet make a big daily parade. A lot of gas has been thrown about too, & some are gassed.\n\nAfter the stunt in the line Edwards put me on to the patrol to the next post, which is held by Tommies – The Devons – and is in the centre of what used to be the church in Holebeke, now only mounds of rubble. In this church are the remains of a aeroplane & the graves of an English airman & pilot who came a crash there.\n\nAt the post next to us on the right the sergeant in charge, I hear, had a bad time with a couple of his men. One of them, an ex-clergyman, swore like a bottle-oh when told that he would have to go to the top of a flight of steps (the support is in the ruins of a house) to keep his watch. He apologised later, saying that he knew that as a clergyman he should not have used the language, but he lost all\n\nhis nerve at Passchendaele. Another man was a jockey who, out of the line, was the cheekiest man in the platoon. He had been fourteen months in France & this was his first visit to the line, so he has done some dodging. Coming in, he was white faced & silent, and, having in mind his usual cheeky verbosity, the question kept being asked \"Where’s Ringie? When it came to his turn for post he shook in his blankets, refusing to move. Maginnis, the Sergeant, thinking him ill, let another take his place; but seeing him all right, later, ordered him onto his post. Ring refused. Maginnis gave him five minutes. In that five minutes the ex-jockey got away. He has reappeared after being missing for 3 days. It appears that he has been hiding down\n\nin the deep dugout for that time, & having drawn no rations has had nothing to eat. His appearance looks pitiable; & instead of suffering for his act he is to be sent back to the horselines. Against these occasional incidents the conduct of most of the boys is splendid. The man next to me on post was shaking like a leaf, when the stunt I recorded occurred, and he spoke irritably when I tried to make jokes but he showed no sign of doing anything but sticking to his job: he is severely war-worn, & nervy because of it: and I suppose he knows the horrors at the back of some threats better than I do.\n\nA man in my platoon, Carson, claims to be the last survivor in the Battalion of the","19":" reinforcements. They have been worked and quickly – mostly wounds of course\n","20":"\n\nDec 7\n\nHave neglected this business and must pick it up someway as best I can. \n\nThis day our company moved back to Rose. Wood, which is adjacent to the Ravine and bivouaced in trenches which seem to have been badly knocked about. C & D Companies have gone in, & taken possession of the Ravine & front line.\n\nAs a matter of fact there is really a gap in the line in front of Rose Wood, but the ground is so low lying that it is practically impassable. We get a very bad time here, as is already evident, from machine gun fire, & shells, chiefly gas. D Company had a number of casualties while in this position.\n\nThe doctor, who would not let me go back to the line, ordered me back here in advance of the Company, & one of the men in the platoon who was out because he going back to a school humped my pack for me. I got into a very nice dugout, but discovered during the day that a Fritz machine played right across the entrance. When the Company arrived at night there was a quarrel between the signallers & some of the sergeants as to who were to have the place. I was glad to leave it to them. \n\nI am sharing a \"possie\" with Sgt Maginnis. It is a section of trench that has been cut off by the demolition of some of the original trench by shells. Originally it was part of a German system. Hanging\n\non a tree just above us are two big blocks of concrete suspended by steel wire – portion of a pill-box that has literally been blown sky high.\n","21":"\n\nIn a position near our trench there is an iron \"tree\" which is an example of German ingenuity. It looks exactly like a tree even within a few feet, but it is a hollow iron cylinder inside, with steps for a man to climb to the observation post or snipers post up at the top, where the tree looks as if it had been shell splintered. The broken \"boughs\" etc make a nice screen.\n\nMaginnis has found a buried \"pill-box\" with an opening in the side of our trench, & drained it out. He intends to use it, as he reckons our present shelter, which is only corrugated iron, covered with beams of wood & a few sandbags at a blind end of the trench, is unsafe. Part of the roof certainly looks as if it is ready to fall in with a few solid shell concussions; but \nMag\n though he wants me to share it the entrance to Maginnis’s pill box necessitates a painful crawl, & I prefer to take the risk with a place it is easier to enter. I have an inclination to rheumatics and don’t like stooping more than necessary. We are fairly comfortable here, and can get a brazier going, & make tea & toast during the day. I cadged\n\nquite a good lot of tea & sugar from the cookhouse; & there is the Red Cross Coffee & milk too. During the last few days we have only had a few fatigues, and no one has been called upon to do more than one a day. I was out on a wiring fatigue near our old front line position last night. Tonight my job is merely bringing up rations from Clarks Dump.\n","22":"\n\nOur platoon is told off for ration carrying to the front line for 8 days; and I got the job of going to my old post, 5011, which is the hardest job of the lot being the farthest out & jutting into Fritz’s line, so to speak. Its bad, because the sort of feverish cold I still carry with me brings the rheum to my eyes, and makes it more difficult than ordinary to see my way. Still I volunteered for it, thinking the posts would go round so that we would have turns of the difficult & easy ones; & although this is not to be done, there is no use in complaining. \n\nBowen, who went with me, complained about my being slow, so I told him to go ahead if he liked; which he did. At 3011, a post on the way out, I heard that he was about 12 minutes ahead of me, so I apologised when I reached 5011 for being late, thinking he would have got there fully twenty minutes ahead of me – but he had not arrived. After waiting for ten minutes\n\nI went in search of him & found him at last, right in front of the post. When I called softly to him he twisted round towards Fritz, and started to swear quite loudly; which started the Hun machine gunners.\n\nBowen seemed annoyed, & inclined to blame me for his wanderings. I learnt, when I got back to the cookhouse that he had refused to wait for the \"buckshee\" which is a ration carriers perogative. I did. However rotten I feel I always have an appetite, & the stuff for the line is good. The food & the tiredness I felt made me heavy, & dragging through the mire, which was knee deep, on the way back to Rose Wood was a weariness. \n\nWhen I saw what I though was solid ground I was just saying \"thank God!\" when I flopped over, head downwards in a shell-hole. It saved me, for, at that moment, a splatter of machine gun bullets whistled over the top; but I was soaking wet, & covered with mud. However, such was my weariness, I simply lay down just as I was, with my blanket around me, drank my rum, & dropped into a sound sleep feeling warm as toast in spite of the wetness. As a matter of fact one gets used to that. Since we came in I have seldom been fully dry, if ever.\n","23":"\n\nMaginnis tried several times during the night to induce me to change into his pill box; but I was too sleepy & comfortable to stir, in spite of his drawing attention to the way the shells were falling. This morning he seemed surprised to see me alive; & he showed me three nice new shell holes in a small semi circle round my position, which was undamaged. It must have been sheer weariness that had kept me asleep under the circumstances.\n\nMy appearance must be rotten, for when I went down to the ravine about an engineering fatigue – it appears that we are \nnot\n to be limited to one fatigue, the M.O. stopped me & asked if I was reporting sick. He told me to report tomorrow; but I don’t intend to, believing I can last out, and get better when we go out for a rest. The engineering fatigue was repairing some camouflage Fritz had shot away, & would have been quite a nice job if Fritz had not interfered in the middle of it.\n\nThe\n There is a bad shortage of paper – it is unobtainable at the canteen at Rear Battalion Headquarters in Ouraet Wood to which I went for the boys this morning. Even when we were back it was impossible to obtain decent writing blocks at the Y.M.C.A. or elsewhere. All they have is soldiers writing tablets, which are no good to me. I borrow some typewriting paper from Hdqrs when I can, but it’s poor stuff. Candles also are unobtainable almost, and they are badly wanted.\n","24":"\n\nA beautiful morning, and everything quiet. Owing to the mistiness that prevailed in spite of the sunshine it seemed safe enough to get out of the trench & stretch a bit. There was a tang of spring in the air; and it made me feel as if I was getting rid of mouldiness. Another man in number six platoon, got out of his possie too. Then a shell came over, suddenly, and it got him.\n\nMaginnis reckons I am off duty today. I don’t know how he worked it but he reckons I am not fit. Its rotten to have everybody remarking about me looking ill. We are having a raiding party tonight, and I have asked to be included. I want to see as many of the features of the war business as I can, of course. The raid will be sort of revenge for the incident of this morning; but, seeing that it was the artillery away back that settled the account of Brown (he died of wounds) and we are attacking infantry, it is hardly a just revenge.\n\nThe authorities have just discovered that smoke is a great enemy of gas, driving it out of dugouts etc; and we have received orders that a bundle of twigs is to be kept in each dugout, to set on fire when gas is heavy & penetrates into them. Quite a lot of our fellows have got slightly gassed, and speak as though they have sore throats.\n\npp. 77 – 79 omitted in error\n\nEvidently something missing 11 –","25":"\n","26":"\n\nApparently my protest against transference to the Salvage Company has not had any effect, yet. In spite of my present rotten condition, I could have held on, especially as the Company is due to come out of the line, and, they say, have a holiday; all the same I found it a drag to carry my equipment out, and was glad of a lift on the light railway. During my return to the line I was alright; but it was the subsequent heavy fatigues that broke me up; being shorthanded the work was very hard. Last night Collins (another man who is joining the Salvage Co: he is from D. Company, and is very war worn) spent the night at the Q.M. Stores in the old camp at Rossignol. There we found the two Coxes & Ferrier, of my platoon, who had been sent back to go to various schools some time ago, besides some others, still waiting to know where to go to, and having a good time.\n\nIt seems very unfair: these men are amongst the biggest & most solid in the platoon, & left it very much weaker than it was before; and their absence caused more work to be thrown onto the other men, already overworked: yet they are not attending the schools for which they were withdrawn. Ferrier is a nice fellow: it was he who humped my pack from the Ravine to Rose Wood when he was going out to the school he has not\n\nyet reached. It is not the fault of the men, but of the system. Ferrier himself told me that at Havre he was offered a classification that would keep him there, because he would be an acquisition to the football team the \"heads\" were organising; and I know that members of the Battn football team are kept out of the line in order that no risks will be taken of losing them. This seems like taking war seriously!\n\nAt the QM Store we helped ourselves to whole rolls of blankets for the night, had a fine tea with all sorts of extras, and found rum plentiful. It was different to the line! Collins & I got a lift on a G.S. Waggon to Dranoutre, where we found the salvage Company housed in very comfortable billets in the stables of a large house, and with fine braziers going.\n","27":"\n\nThe Salvage Co does not work on Sunday; \nand\n today was my first day at work with it. We drove out in a G.S. Waggon as far as the vehicle limit & then marched ahead to our light work. Having been sent out because of \nmy\n sickness I found myself carrying 6\" shells from an old artillery position to a dump by the light railway where they can be picked up. A 6\" shell weighs nearly 94 lbs! – a nice weight to carry any distance on one shoulder!\n\nThe Salvage Co numbers approximately 70 members \nand\n who are supposed to be drawn from all the units in the division – their is one Salvage Co to each division and \ntheir head organisation\n they constitute the Salvage Corps, which has its head organisation at Corp Headquarters. The men are supposed to be those who need a rest from the line – the work is heavy, but it is done during the day, and the Company is housed in comfortable billets, where an undisturbed sleep can be obtained, & clothes can be dried by the braziers; but as far as I can make out, nearly half the Company have never seen the line; while the acting O.C. is a man who has never seen the front since Gallipoli, and never intends to. Have not seen him yet; but the accounts of him are not pleasant. Apparently the largest working party is 40: the rest of the company is occupied in fancy jobs. However the unit, whose job it is to retrieve all sorts of military material, does very useful work, the value of the salvage running into millions. The most important work seems to be retrieving shells from abandoned artillery positions, - sometimes those left when our guns moved forward. Each shell is valuable; and as each man in a day may handle twenty or more the \nextent\n value of the work is great. The shells are handed over to the Ordnance Dept, which\n\ntests and attends to any that need attention, & sends them back to the artillery.\n","28":"\n\nWorking in the vicinity of Ouraet wood we were shelled, and the working party had to be withdrawn.\n","29":"\n\nAn order having been made that G.S.Waggons will not be available to take us to work, we have shifted billets to the vicinity of Irish House, in order to be nearer work. The billets are small huts, our own being composed of large curved sheets of iron, with broad corrugations, covered with sand bags; and we have a fire-place in it. It is \"a house\"\n","30":"\n\nWe have been working shells from old artillery positions in the vicinity of Ouraet Wood & Clark’s Dump. As a rule Fritz is very good. The Battalion is out in supports at the back of Ouraet Wood, and the idea is that the Division is going out for a rest very shortly. The boys are having quite an easy time – which they deserve; but I certainly have not benefitted by my transfer to the Salvage Company. The shell-carrying is very hard.\n\nI heard that Peters, the member of our reinforcement who distinguished himself by avoiding drafts to France, died in England a week after I left. He was actually the first member of our lot to die\n","31":"\n\nSaw today a stirring air fight. A German airman\n\nwho has been troubling a great deal, flying over at an amazingly low elevation which must have given him a splendid sight of our position, and darting away directly the anti-aircraft guns started, only to return unexpectedly in a little while, was intercepted by two of our ‘planes, which followed him up & down, preventing his usual break away; and a ding-dong battle ensued. \n\nOur ‘planes seem to have come from nowhere, & must have been waiting at a great height. The battle ended in damage to the Fritzer’s petrol tank, and with that on fire, he made a desperate attempt to get away, but came down suddenly. We have heard that he crashed just in front of our lines; and the boys stood up, careless of fire, and cheered.\n","32":"\n\nFritz subjected the area in front of Ouraet Wood and \nwhat is\n the vicinity of what is known as F track to a heavy bombardment today, evidently being after the track. To reach our work we passed down the track in single file, extended order; and as the shells fell as we were passing, it is a wonder some were not hit. Repassing at night, we found the track blown to pieces in half a dozen places. In the vicinity of what is known as the Catacombs the ruins of Wyschaete, their is a cross with the inscription \"To an Heroic German, name unknown\". Often the title \"brave\" is applied by one foe to another; but this\n\nis rare and makes one envious. The track of the light railway runs over the line of some old German trenches and in a gutter they have made to carry out the water, erosion have exposed the top-boots of a German soldier sticking out, with a bone showing through a tear in one of the boots. He was evidently buried by a shell explosion before the territory became ours; and the light railway track has been piled over a grave of which, noone, realised the existence. The feet are small, and letting imagination play I picture him as a dancing man – jovial & fickle, - & probably well-loved: and he will remain amongst the missing of whom no one knows the fate. \n\nAll over\n All over the ridges \nat the\n hereabouts from Messines north there are tremendous craters, the work of explosions caused by our engineers who sapped under the German positions, & blew them up bodily. These explosions started the British advance. In some of the craters a cathedral might be lost. There must be hundreds of Germans buried & unrecovered in these places. \n\nGreat care is taken of graves, usually, and all over these ridges there are many with two pegs each with different numbers. One is the German registration number, the other the British. Where men falling in No Mans land, long fought over, had to remain unburied until the ground was captured, there are graves, like the one in the Irish House burying\n\nground, which bears a cross to a lieutenant & 32 men of the Gordon Highlanders, \"\nburied\n died","33":" buried","34":" by the Irish Fusiliers\". Still, even in the areas which have long been supposed to be cleared of the unburied there are still some who have been overlooked. \n\nI was searching for wood in what remains of the trenches \nbefore after\n above Irish House – they are so battered that in places, the hollows are in front or behind the trenches, which are filled up, & the barbed wire is battered down, or covered with upheaved soil – I dragged some old \nremants\n remnants of sacking from what I thought might be posts among amongst some wire & found a skeleton, of what by his clothes was a Tommy. He must have fallen in an attack, against the wire, which he seemed to have grasped. I hunted up a padre, & told him about it, so that he could arrange for the burial.\n\nOne of our men who is going on Blighty leave is taking this to post, with some M.S.S. I am having trouble with the O.C. of this Company over my writings and have written to the Censor \nthrough\n to whom I am going to send my stuff direct for him to Censor.\n\nA gap again –","35":" –","36":"\n","37":"\n\nWe have shifted camp from Irish House to Voormezelle, and are in tents in a field near the ruins of the Convent. At the gate of this convent the Germans crucified a Highlander, and, I think, a Canadian. The men object strongly to being in the tents; and other men, who are billeted in the vicinity are annoyed: they say the tents will be observed and will draw fire.\n\nMy notes have been suspended for a while. I had a painful accident with some cordite – sixteen bags of 4.5 \ncordite\n charges which we are in the habit of bringing back with us to throw in handfuls on the fire (it burns with intense heat, & dries the wood) were lying in one of the corrugations of our hut, & I was sitting cross legged beside it before the fire, when a spark must have caught it, & the whole lot went off. \n\nFortunately cordite needs to be confined to explode, & this simply gave off an intense flame which filled the hut, but mainly swept round the iron towards the roof. I woke the other two, who were sleeping, & we shot into the air, myself singed like a cinder. The blanket over the doorway was also burnt to a cinder, but the fire did not damage much that was not near it. It took my hair off (I was needing a haircut); and its result was that a good deal of my skin came away like scorched leather, and I\n\ngot bad sores on the arms & face where I had been scorched. The pain was intense; but I could not report sick over it because of S.I.W. – the cordite being prohibited they would have reckoned my injuries self inflicted wounds.\n\nThe company has got into the habit of being badly shelled; and we have had to clear out of areas were we were working, at the double. I would rather be in the line myself, where you know what to expect: in this work shells will land amongst you when everything seems peaceful.\n\nOn one of these occasions we were working near \nDamm\n Damm . In this vicinity there is a extensive semi-circular embankment, and when Fritz slaps shells on one side of it we have to shelter on the other. In Damm Wood on the side nearest Fritz there is a large German graveyard (it used to be well back of the German line) which, since he lost it Fritz has knocked to pieces in searching for our batteries, which, really are mainly on the other side of the bank. One day while we were sheltering, bones from this graveyard came hurtling over the bank, scattered by the shells.\n\nOn another occasion we watched German shells falling apparently, right on one of our artillery positions, at the extreme end, from us, of this bank. Fritz seemed to have the range perfectly, and we saw pieces of iron\n\n& timber go up with each shell burst, men running away, and a couple of stretcher-bearers busy. When the Germans grew tired & ceased, we went over, - myself & a few others- to see the damage; and some diggers who were collecting various tinned goods grinned cheerfully and replied to a question \"Two chaps got nice blighties\". Such light casualties seemed marvellous. \n\nAnother battery near the same place had this experience; on three nights in succession one of the guns – the same one each time – has been hit but not a man was hurt, although a shell crashed into and destroyed a nearby dugout just a minute after its occupants had left it. Of course such luck does not always hold, a big shell which landed in the light railway yards, about two hundred yards from our camp, got six men last night – all killed.\n\nThe cause of this activity is the bright beautiful weather, which gives wonderful observation. We see Fritz’s balloons every day, & it is not surprising if, with strong glasses they see us.\n\nThe \nbattalion\n Division is holidaying at Meteren; and I have written to the CO. Battalion asking to get back again. For a long time I woke every morning stiff with rheumatism, but that is going, with the warmer weather, which is quite spring like. The Salvage Co is working however; and as the Fifth Division is \"in\" the Fifth Salvage Co is also on the job. \n\nBeing with the Division in charge of the area that Co\n\nclaims all the best areas and we are thrust into regions where we get nastily shelled sometimes. Our C.O. never visits the working parties when they are in advanced positions, so that it doesn’t matter to him. \n\nWhen we go out to work we take lunch with us & \"boil the billy\". The \"billy is usually three petrol tins, and one man is told off to \nget\n make the tea each day. The man on this job became a casualty & the job went begging until I took it. To me it seemed to offer a relief from the carrying of heavy shells; but I soon learnt the reason of the refusal of the men to take the \"soft snap\". The smoke of the fire is liable to draw fire at times; and it is a rotten thing to be by oneself when the shells are falling. The possibilities of being hit with noone to attend to you make themselves gruesomely present. \n","38":"\n\nWhile working above \"the Crater\" where a number of bones, presumably Germans’, have been dug up by shell fire, I found a thigh bone that must have belonged to a giant. Placed with its lower end against my knee, the bone reached up to within three inches of my arm pit.\n","39":"\n\nThe weather had become bitterly cold again, a sharp wind making matters unpleasant.\n","40":"\n\nThe rottenness of living in tents is now being made apparently.. Fritz is beginning to throw shells at\n\nour encampment & in the neighbourhood; in fact his artillery activity is becoming very prominent.\n\nA matter of remark amongst the troops all round is the way in which the neighbourhood of the \"Belgian Mission\" escapes all attention. Neither our boys nor the Tommies have much faith in the Belgians believing half of them to be traitors to the cause for which we are fighting, and some happenings are certainly curious. For instance we leave by a certain track crossing a road at pretty well a fixed time every evening, returning at very much the same time towards night; and shells fall on that crossing always about the time that we cross. No casualties so far.\n\nVisited Ypres which I was anxious to see with Jock Ormsby, who has long shared my dugout & tent - a nice chap, ex medical student, who took to planting in the East. He was the only man willing to go. The New Zealanders are greatly in evidence in Ypres; and a good deal of tidying up is being done, clearing up the ruins. The \"Belgian Restoration Society\" has buttressed what remains of the walls of the Cloth Hall (which is all but ruins, however) with massive wooden beams. Hardly a house is left, certainly none undamaged, the whole place being a wilderness of rubble. The only place with\n\na sign left intact is \"L’Aiglon D’Or in the railway square – a cafe, of course uninhabited. Just as we turned back from the railway square a shell landed in it; and thereafter shells poured in quick succession into the place. We made haste to get out; we had no cover to get into, & felt like rats in a trap.\n\nThere was no means of judging where the next shell was likely to fall, when Fritz was firing at random into the place; it might land on top of yourself. \n\nA matter that surprised me was that a tall chimney stack had been left standing. It must have been an excellent firing mark for the Germans & its removal would seem elementary wisdom. \n\nOn the road back from Ypres, which had been quiet enough, previously, we passed a newly dead horse, and a broken wagon, and other signs of shelling\n","41":"\n\nBeautiful weather has come again; and it is really spring. There are birds and rabbits disturbed in areas towards the line where we are working; it seems strange to see them living undisturbed in the scenes of war. A blackbird perches every morning on a bough of the hedge near my tent, being quite a pleasant friend.\n\nThe beautiful weather has brought increased artillery activity however. Our own artillery \"stunts\" every night, and often during the day; and Fritz is\n\nkeeping up his end. He drenched our neighbourhood with gas.\n\nWe are working, now, on Brandenmolen and towards Hill 60. It is \"a rough joint. This morning, after filling my petrol tins at the water pipes near the advanced dressing station, I was having a rest when the shells started to come over. Some piece from the first made holes in my petrol tins, which probably saved my legs. I took cover at the \"trot\".\n\nTell me if you didnt receive all of these. I suspect interference with my mail and I can’t always get a man going to Blighty to post it there. My O.C. & I never meet each other without having a thrust or so; and I know he hates the idea of my writing back to Australia – especially since I went over him to the Censor.\n","42":"\n\nOur camp was bombed last night, but no damage was caused except wounds to two horses. During tea time two, the camp was cleared by the arrival of some shells. With the knowledge that Fritz has us in his minds eye, like this, it is certainly not nice being in the tents. There are dugouts available, but they are scattered, and our admirable O.C. says that he wants to keep us all together. He is nicely housed himself.\n","43":"\n\nShell fire has \"got the wind up\" me, at last. I saw a man killed by a piece of shell where he should by all the laws of chance been perfectly safe. He must have been over two hundred yards from where the shell landed; he was getting into a dugout, the shell, to get him had to pass between the apex of a triangle formed by two beams of stout wood; the piece of shell hit him just on the join of the rim of his steel hat with the crown, & should really have been diverted; but it made a hole in the tin hat & a horrible mess of the man’s head. \n\nNow the of every piece of shell in the air scares me & I look for cover. I had another experience of how far a piece of shell can travel too. Later on with an ordnance man I was standing by Middlesex Dump watching the big shells landing on Brandenmolen\n\nwhen a piece ca\n which was the top of the opposing slope, when a piece of one shell came whistling past us. It must have covered a quarter of a mile. Fritz’s shells seem to have improved marvellously; although the reason why so many of his shells were \"duds\" is, I suppose, that they fell in sloppy ground. We have a wonderful fuse \"106\", which must be a fearful thing to Fritz. The ordnance men tell me that a shell fitted with this fuse will explode if it touches a shell of tissue paper. This quick burst gives an above-the-ground explosion which naturally spreads.\n\n","44":"\n\nGot the shock of my life today. We have a bathing parade & half holiday every Thursday, & exploring, I got in marshy ground, which I was cursing, yet had reason to be grateful for. I suddenly imagined that a whole house was falling upon me, screaming in every brick as it fell, and simultaneously, I was thudded to the ground. When I had sense enough to notice anything, I saw the base of a ten inch shell sticking out of the ground. It scared ten years growth out of me . If it had not been a dud I must have been mingled with the scattered landscape.\n","45":"\n\nThere is every indication of a big stunt coming. Our Division is relieving the Fifth; and I can’t\n\nunderstand not receiving an answer to my application. Any amount of men would rather be with the Salvage Corp. than the battalion, but I feel the other way. The Germans have been throwing big shells right back in Bailleul L Clyste,, Poperinghe etc. and doing a lot of damage. All night we hear the big shells singing overhead; and also the drone of the planes, ours & theres, laden with bombs. We get a bomb or so ourselves, & some shells. Our own artillery is getting stacks of ammunition ready; and the rumour is that there is to be a 36 hour barrage laid on to open a stunt.\n\nOne of the men from the Company was sent back to Corps Headquarters at Bailleul the other day, \nand\n a transfer that roused the envy of the rest of the Company, which is getting strained with living in these tents, subject to fire. When that town was being shelled with the Huns long distance guns, he & four others got into a cellar. The motor-driver of the Salvage Corp wanted to get in to, but was told there was no room. Just as he had turned away an armour piercing shell broke right through into the cellar & killed all five men!\n","46":"\n\nWas shell-chased from Brandenmolen to near Voormeziele today. Fritz’s observation balloon must have noticed us working, for shells landed right amongst us. It seemed that some of us must be got by the first; but the boys came running right out of the smoke, & noone was hurt. But Fritz lifted his fire & commenced to range right onto the old artillery positions (abandoned) behind which we had taken cover, & we had to get. I had two sandbags, filled with broken ammunition boxes for the brazier fire tied together & slung over my shoulders; they must have made me a mark for the whole party, for when we scattered, the shell fire followed me. Each new shell appeared to land just where I had ducked down when the previous one came. I only got out of it when dead-beat. I lay down under a haystack near the White Chateau, feeling that, whatever happened I couldn’t make another run. I had been jumping into shell holes, & against tree trunks as each shell exploded, & I was wet & muddy & bruised. A sympathetic Corporal in charge of a battery Canteen opened it up & gave me a dixie-full of beer. Don’t remember ever tasting anything so glorious. Mine was the satisfaction of being the only man to bring back any wood – the others who got home long before me, & reckoned I was gone,\n\nhad thrown theirs away.\n","47":"\n\nLast night Fritz deluged the whole district with gas. Heard them going \"whoo-oo-op-pop!\" all night long; & we had to wear gas masks A lot of our boys have been gassed with mustard gasses in the line; 95 in one lot. The little graveyard near the bluff is rapidly filling, very largely with gas cases. Today I got a piece of shell, as small as dust near my eye. Fritz landed some ground shrapnel to meet us on the road near the Convent, which exploded right in front of us; yet noone was hurt. I was amazed to find no damage; but later I felt an irritation near my eye, and one of the boys – Williamson – extracted the bit of iron.\n","48":"\n\nMore gas last night; and today we could not work because of the way in which the German gas-shells were landing in the place were we intended to work. We did a few little jobs near home; & in the afternoon went to St Eloi; but Fritz started to shell that badly. We had to make a break for Lake Zillebeke; & came home a roundabout way skirting its edges.\n","49":"\n\nGerman proclamations to the people at the back have been spread by aeroplanes, announcing that he intends to come over. We are expecting a big stunt of \n\nour own, which may surprise Brother Fritz. There is another of the iron observation trees of the Germans near Voormezeele. It is even a better specimen than the one at Rose Wood. Round the trunk, near the broken \"branches\" is very fine wire netting supporting ivy leaves like the millinery in a lady’s hat, which look very real. The base is reached by a sap from what used to be a German trench. Three bombs were dropped near the camp tonight.\n","50":"\n\nWorked towards St Eloi. Fritz shelled heavily but we could see he was trying to get some ammunition trucks standing near a 9.2 battery, by Lake Zillibeke. We were working when the explosion occurred. A shell must have landed right in one of the trucks, for it blew up bodily, the noise being most terrific & terrifying. It was magnificent to see way the men from the 9.2’s butted in to save the other two trucks from the fire caused by the one in the centre which had blown up. \n\nMore gas last night; and the Germans big shelling keeps up. Our own guns seem rather more quiet than usual. We think they are building up for a big stunt.\n","51":"\n\nFritz had the audacity to land a shell alongside the canteen \nwhen\n (Tommy Artillery) where we get our beer when we have the money – it is the best\n\nbeer I have tasted in France. There are rumours that the Germans have made a push some where down south & made a big headway. The reports take all sorts of shapes; but such a lot of men seem delighted at anticipating the worst and crediting victories to the enemy. We had more gas last night, having to wear masks. Fritz seems to be giving the place a drenching. I went to see the battalion, which is in Ridge Wood, but could not discover the C.O.\n","52":"\n\nIt is pretty certain now, that the Germans are making a big headway in the south, \n& have\n and have overrun a lot of country in a day or so that it cost us many painful months & thousands of lives to gain; besides which they have captured a mass of material. We have received orders to get all the angle irons & bared wire screws we can from the old barb- wire entanglements hereabouts, which in itself is significant of a need that looks desperate – especially as the articles are wanted in a hurry.It is nasty work, as the wire has practically rusted onto the irons.\n\nWe have been allowed to leave our tents and take to dugouts, and we have struck the tents. It is about time. The order came when Fritz knocked what remains of the upper walls of the building beside us off; but we had been twice chased out of our\n\ncamp by shelling, before that. The falling masonry fell on an improvised cookhouse, inside, burying five men, but only one was hurt.\n\nWith three others I have a dugout, that, after the exposure of the tents gives a great sense of rest & security . It is a cellar, about eight by ten with two bunks on each side, an arched brick roof, & all the ruins of a big house on top as a pad between us & danger. We have a nice stove in it; & can have a light all night without fear of Fritz ‘planes seeing it.\n\nEight men were killed & wounded by a shell which landed in an engineering dump at the back of us. The Division is evidently being withdrawn & sent somewhere else.\n\nSmall gap,","53":" –","54":"\n","55":"\n\nWe left Voormezeele, marched to Ridge Wood & entrained. The country through which we travelled (in open trucks) looked very beautiful, & peaceful & prosperous: the possibility that war may visit it soon seems awful; yet the reports from the south makes things look very black. After detraining we marched to a little place called Wippenhoek near Boeschepe. No-body seems to have any idea about what it is intended to do with us. but we seem likely to move a lot, and most of us, for that reason left a lot of carefully collected souvenirs at Voormezeele.\n","56":"\n\nHave no work to do, but were concerned for the first time, with some drill, and cleaning our rifles etc. The Company is joking about our being \"Britain’s Last Hope\". There is practically no news, but plenty of wild rumours. Most of us took a walk to Poperinghe, where we could see the damage that had been caused by recent shelling. The sight of two white children’s cots in the ruins of one house made me feel mad. I came across a few of the Platoon of the","57":" Battn outside Pop. and asked Wells to help me to get back.\n","58":"\n\nWe had practical holiday for several days but on this day left our billets at 5.30 am and moved\n\nto Godeswardveldt , where we entrained for Amiens. Apparently an idea that we must be kept in good form has stuck the authorities, for we were given a hot meal, from our own cookers before they were shipped & the train started. The journey was tedious; and we arrived at Amiens at night moving straight out to billets at Allonville. It was too dark to make any observation of the way; and we were all extremely tired: the march to Allonville itself was a long one. Our cooker had travelled ahead, and we had a hot meal waiting; after which sleep came quickly.\n","59":"\n\nOur billets are in the barns of a filthy old farm-house, a place that is full of the stench of rotten straw & refuse. The whole place is old; in the centre of the yard which the building surround is a regular cesspit of decayed matter, covered with straw, into which one of our horse sank nearly to his body. The whole village of Allonville is a wretched one; with the exception of a couple of big houses the houses are huts of a sort of plaster over rough wood frames. The people are filthy & morose; in the centre of the village is a pond into which the drainage of the place seems to have run for centuries. Other villages in the neighbourhood seem to be much the same;\n\nthe houses seems to lack the neatness & cleanliness of the towns of more northern France, as the people lack their gaiety. But these people are mainly old, the young men having gone to fight & the young women work for their country; they have lived under the shadow of the war for years & it is no wonder if they are not joyful.\n\nThe Battalion is in billets alongside US - model barns etc belonging to one of the big houses. I have made myself acquainted again & hope soon to be back. The battalion expects to have a brisk time; but does not know where it is going, and just at present there is nothing to do at all. We of the Salvage Corp have what is known as \"the petrol tin stunt\"; we were told off to scour the country for petrol tins intended to contain water for the front line – another instance of the shortage of material, & the necessity for filling the gaps caused by the stuff that has fallen into the hands of Fritz. Fatigue parties from the Battalion were put on the same work. The result was a large stack of tins, although we took our time over obtaining them, & explored the country. The villages – of which there are many within easy distance – have all the same features; a church showing prominently, one, or sometimes two, proud houses, a stagnant, slimy pond\n\nin the \nstreet\n village square, or centre of the town, houses like barns & pig styes, and a people dull and dreary, who all look worn out & tired of life. And the wine in all the places is enormously dear, and very bad.\n\nThere seems to be no clear knowledge at all as to where Fritz is; but guns are starting to the south, & at night we can see flares – the invariable sign of the German front line. Fritz has made a big bite; and whether he is held even now, is doubtful. Some believe that Amiens must fall; and we hear the big shells already, sailing over to its destination, now & then, at night. \n\nRumor, for we get no papers, is busy talking about what the Germans are doing in the north, too: in fact it is more or less officially announced that he paid us the compliment of coming over directly our backs were turned & has made big headway.\n\nIt seems inconceivable that he should have taken the ridges from Messines upwards however; we always claimed that we could hold them against the aggregate German armies; and, here, we are confident of keeping the Hun back; but we are fearful of our wings. A lot of the boys talk about the inevitability of our being cut off & annihilated. \n","60":"\n\nIt is said that a German spy was caught dressed in the uniform of an Australian officer. The spy system, by all accounts seems to have\n\nbeen marvellously worked. Stories told by the Tommies give tales of orders issued which led to confusion – orders, in some cases, for withdrawal. A A.S.C. man told me that his unit got orders to go to Peronne; could not find out why they were there, or to whom they had to report; then somehow – the information came in such a way that noone knew who was responsible, where sent back to Corbie, where they were furiously told that they should not be there & were ordered forward to Bray.His story that cyclists in Tommy uniforms have been scouring the country warning the people to evacuate, with the result that the roads becoming congested with fleeing people & their goods hampered reinforcements for the line and supply columns is amply corroborated by others. The place is full of stories about spies being caught & summarily shot. One of them says that a man dressed as a major who came to an Australian unit of the second division with an instruction that they were to withdraw was shot dead by a junior officer; and inquiries justified the officers action; no such instruction was authorised, & the man was a spy.\n\nThe A.S.C. man told me some yarns about the deserted villages ahead. In Corbie, hearing a commotion in a house, they broke in (he & others) & found that before the owners fled they had locked\n\nabout seventy fowls in the house, which were half starved. Of course, the Tommies had a great feast. Here it is pathetic to see the people waiting with their chief household goods laden on carts, for the signal to fly. Little sorrowful caravans go by, now & again too; families already in flight. \n\nA whole lot of tanks went by this afternoon on the way to where ever the front is. We lined up to give the lumbering things derisive cheers, which, of course, increased whenever any of them came to a standstill, & failed to get a move on again, as three of them did. Although nobody anticipated a very cheerful time ahead – or a very long time either – we are all making the most of our holidays\n","61":"\n\nLast night the air seemed humming with ‘planes mostly German I think. Fritz must have his entire fleet hereabouts. A little attention was paid to Allonville, but most of the nasty stuff, no doubt was for Amiens & the railways. We could hear the thud of bombs in the distance; and when the ‘planes were not about we could hear the high notes of the big shells passing. This morning I was very weak as the result of dysentry, which seems to have affected many men here; and was given two days \"no duty\". Rather farcical when\n\nthere is no duty at all, going. Stilll, one of our batch of reinforcements is being evacuated from the same cause. The news is around that the first Battalion is going to the line tomorrow. I saw Bob Humphries, who is second in command of B Co, & he said he’d gladly try to get me with them. The second brigade, which was fixed in adjacent villages, seems to be \nfalling\n going back instead of forward. There is a growing intensity in the gun stunts to the south which seems to indicate that Fritz is getting up his artillery. It seems, now, certain – in fact it is official – that the Germans have gained big successes in the north, and that the Pork & Beans (Portuguese) simply ran away from a position we reckoned impregnable. \n","62":"\n\nIf anything, the German air activity seems more intense; & the \nguns are\n big shells are certainly giving Amiens a bad time. The","63":" Battalion moved out with the rest of the brigade, but their direction was back towards Amiens. Possibly they are going to another portion of this front. It seems from \"orders\" that the Germans are fairly well held here, although likely to make a little more headway to the south. One division may be going there. It seems that our other divisions are responsible for holding the Hun rush.\n","64":"\n\nWe left Allonvile yesterday afternoon (12th) for Amiens. As we marched we could see and hear, an occasional shell arriving ahead of us, and once or twice he hit the vicinity of the road just outside the town, on which we were travelling. We could see the damage caused by the shells in the town, the streets of which were covered with splintered glass, while many fine buildings were badly smashed. The dull echoe of shells landing here & there amongst buildings sounded as we marched through. We did not go to the Amiens railway station, but to a place called, I think St Jean, where we found the rest of the division waiting to entrain. They say that ninety (90) men of the division, getting loose about the town, became casualties last night through bombs & shells. The town seems all but deserted. After the usual weary wait we entrained; and by the time darkness commenced we were moving – going north. We hadn’t gone far however, before we were pulled up, and we remained pulled up for three hours, while German ‘planes, buzzing like bees, bombed us. I was playing draughts at the time; but my opponent couldn’t concentrate & the other boys wanted the candle out, though it could not have shown through our truck. Personally I would have\n\npreferred anything to inactivity: to sit listening to those planes, & the bursting of the bombs, & feel the occasional rattle of the trucks when a bomb dropped near, was murder – it was even worse to hear the engine of a ‘plane stop suddenly, and then wait for the fall of the bomb, wondering where it was coming. However, when Fritz had finished we moved off, although we had a couple more stoppages while Fritz performed. This morning we were able to notice, in several places, the German failure to hit the line on which we were travelling, although he got very close sometimes, & the holes his bombs had made looked unpleasant. As we travelled, nearly every road appeared to have its fugitives – old bent people & young children carrying bundles & accompanied by carts of every description, carrying their household goods. It was a heartbreaking sight. Detrained at Hondeghem & tried to get information about the position of matters; but nobody seemed to know. All we could extract was that the line that Fritz had reached was not definitely known; and it was not known yet what was to be done with us. We had a hot meal, & rifle inspection, being lined up beside our packs; & then there\n\nwas along wait. In the meantime we found an empty canteen, with plenty of beer in it and naturally did not let the beer remain to (possibly) fall into German hands. A Tommy told us a disreputable story about how the Tommy officer in charge of the unit to which the canteen belonged – a Labour unit I suppose – had simply called his crowd together & marched them off, on receipt of a windy message that Fritz was coming through.\n\nAt last, some of the companies got into battle order, and marched off, leaving their packs just where they were. It seems they are going straight to the line. I saw Bob Humphries, who says he will see I join up in a day or so. We ourselves moved back to Marie Cappel, a very pretty village, near Cassel, and where placed in tents there. We are all pretty well fagged.\n","65":"\n\nBelieve we are to resume the petrol tin stunt; in the meantime, today, we had more holiday, which however Fritz did not keep: the AA guns were in a constant state of agitation. As usual did a lot of exploration. Marie Cappel lies on the side of the hill, - the highest land in this flat district, on which is Cassel. Although it is only 156 metres at its highest, it is a very dominating eminence in the flat country. We explored Cassel, a survival of an old walled town, whose Barons must have been able to bid defiance to the higher rulers of old before modern munitions were thought of. There are survivals of the old walls; and a yearly carnival celebrates the survival of a tradition about giants who made their stronghold on the hill. It is the most attractive town I have seen in France & I would like time & money to spend there.\n\nMarie Cappel has been turned into a concentration camp to gather up the men who have been scattered from their units during the recent demoralisation of the Tommy units. I counted 28 different units in the camp to which our little Company’s tents are attached. Picquets go out searching the countryside, and as they meet stray soldiers order them to fall in. They march in at night in parties that have become numerically strong. Some of the men are without equipment, having jettisoned it in their anxiety to get away, or because they were weary of carrying it Besides this men from rest camps etc are being poured \n\nin, irrespective of their state of health, to fill the lines up again. The system seems to be to draft the men out again, to their units as quickly as possible, yet last night the camp was overcrowded & men had no place to sleep but under the hedges. The plight of some of the men is pitiable. They have had no food, and there is none for them when they come in. We shared our rations, which are plentiful, with many who were worst off, and admitted men to our tents until in my own, there were 27 men. A waiting party was formed and there was a stunt. The idea was that the line was \nbeing\n going to be attacked, & the waiting party had to be in readiness to march out & pick up G.S Waggons which were to be waiting to rush them forward. The signal was given by an aeroplane which circled three times round the village church, hooting, and the waiting party got away promptly. It soon returned however: & it turned out to be only a practice stunt.\n\nAn Australian Corporal, who shared our tent, was in charge of a dump at which officers luggage was stacked in Ballieul. He reckons the Germans have that place now. Before going he had the job of setting the officers goods which he says included banjos etc – on fire & speaks of it with satisfaction. He declares also that £ 40000 of Red Cross goods were destroyed before he left. That seems a shame, since a prompter distribution\n\nwould have saved the waste. The Red Cross people are generous enough, but the military heads are inclined to grudge giving the stuff. We had been going without in the Ravine because there was \"no stuff available\": but when O’Grady, the Battalion MO, said that he would not sanction the Battn doing a further period in the line, and only yielded on condition that the men were supplied with extra comforts, such as Tommy Cookers. Cocoa etc, the goods were promptly found. O’Grady was a fine M.O. but when he got a touch of gas, the heads got rid of him, & saw to it that he did not return. He was too good to the boys.\n\nThis Corporal, who is incensed with the Germans for robbing him of his nice job in Ballieul – he will have to go back to the line now – came loaded with sandbags loaded with bread, tinned food, chocolate etc which he had taken from the Red Cross dump before it was destroyed; yet he says that men have been caught taking the stuff, which was to be annihilated, & crimes entered against them!\n\nFrom our heighth , we can see the blazes of burning towns, one of which is generally reckoned to be Ballieul.\n\nHalf way to Hondeghem there is an aerodrome, now deserted. The airmen have got further away from\n\nthe line. Down there, while the camp is overcrowded and men are sleeping in the drizzling rain without cover, there are fine comfortable huts, unoccupied. A few of our men, being uncomfortably crowded, slept there last night, order or no order. The air-people know how to look after themselves; and there are deckchairs, lounges, & fine stoves in these huts.\n\nA curious thing about these towns – Cassel, Marie Cappel, and Hondeghem is that a good portion of the original inhabitants have got away, not liking the approach of war, while their businesses are now in the hands of refugees from towns now, in all possibility, in the hands of Germans, who are quite satisfied to go no further. They have a profound confidence that Fritz is stopped, which still seems uncertain to us.\n\nAccording to stories I hear, the Portuguese did not cut and run as some people assert. For three days they stood a deadly gruelling with gas & shells, & stood it well; but, when the front line gave, supports & reserves gave way with them, allowing the Huns to march easily over ridges that should have cost him whole armies, and making a desperate gap in the line which had to be stopped hastily.\n\nLast night I got the instruction that I am to\n\nget away to the Battalion tomorrow, though noone can tell me where to find them. I may have to enquire of Fritz if I wander too far – nobody knows exactly where the line is.\n\nThe Chinese labour companies, which are always kept well back from the firing areas, have shown the usual panic; some of them being completely scattered – the officers in charge could not calm their frenzy or keep them together. Three big Chinamen wandered into Marie Cappel – which really is St Marie Cappel - today, one which a bandage round his head. When a Fritzie ‘plane came over and the \"archies\" started to fire they were scared to death. The three of them scrambled to \"take cover\" behind an empty wine cask standing in front of an estaminet; & in their consternation they overturned the cask, which rolled away leaving them sprawling on the ground.\n\nDuring the afternoon some French armoured cars the crews of which look a fine body of men, were arriving in Cassel. The night we were leaving Amiens, I am reminded, we saw the Guards arriving. In spite of the train journey they had just completed they were polished & dustless, & certainly looked fine; although their regard for their \"smart\" tradition seems ridiculous in the face of the desperate condition of matters. \n\nThis goes away with the driver of an A.S.C wagon who is going to hand it on in a C.S.S to the first man with \" blighty\" he thinks worth trusting.\n\nGap here ","66":" – 23\n","67":"\n\nThere must remain a gap in this record which I am unable to fill, because I can’t remember the days on which events occurred: the days have been a blur; and my platoon has been smashed with a shell, leaving myself & only five others. I fancy I must have got shocked a good bit by the explosion of the shell that did the damage, for I have felt a dazed feeling ever since, & no inclination to do anything but what I had to. Indeed we have been worked very hard, and when we have not been in the line we have been on fatigues, patrols, picquets etc.\n\nI joined the Battalion from Marie Cappel, and had to spend nearly a whole day searching for it until I was absolutely wearied out with carrying my pack etc; yet I had hardly located them near Borre, \nbefore\n & had thrown myself down, before we got moving again & shifted further up. It was just as well, for it seems that the old billets were shelled & bombed shortly afterwards & knocked nearly to pieces\n\nInstead of number 7 platoon, I joined no 8 with Bob Humphries in charge, & Sgt McKye a very fine chap, but a bit of an outlaw, as Sgt. We were on fatigues – carrying up wire, & material, & digging new trenches, & so on, for a day or so; and when we went in\n\nwe went in with bayonets fixed, and Happy George (Capt Steen, our Company Commander) riding ahead on his horse. We were in artillery formation, of course; but the sun had not gone down, and Fritz must have got good observation of us. It looked as if someone had gone mad; but the idea that prevails is that we were out to create a diversion for the French, on our right, by making Fritz think we were to attack, whereas the attack was to come from them. It didn’t, but it may have been anticipated. We were somewhere up towards Strazeele. Of course the Germans shelled us as we were going down a hill-side and made things unpleasant. When the shell hit us, I had dropped out to fasten my equipment, which had worked loose, & was just joining up again when the shell landed. There wasn’t much feeling about it; I don’t know whether I was knocked off my feet or not, but it seems that all that was left of the platoon were the four Lewis Gunners, who were the last \"four\", Phil Knight, (the second sergeant) & myself – who should have been were the shell hit. I have since heard that seven were killed & eleven wounded and that Bob Humphries & McKye were both killed. Humphries always used to say that\n\nhis luck – he had been right through & had never been wounded, although only once away from the Battalion for three months – would not last, & that when he \"got it\" he would get it badly. He was always a good friend to me, & had promised to get me sent to an Officers school when these stunts are over. It was offered me once before, when we were up in the Ravine; but I had only just joined the battalion and I thought that in consequence of some sarcastic verses I had written about \"the Fighting Patrol\" there was a desire to get rid of me. I did not think it fair I should go, until I had more experience. All I knew after this shell came was that Phil Knight was shouting \"Artillery formation! No 8!\" He must have been hysterical; it seemed an absurd order. If he had said skeleton formation he would have been right. We must all have been hysterical; for we were laughing, all of us, at trivial things: one was that Happy George’s horse, which he had been riding, had disappeared, I don’t know how we got to our position or when; but I know we moved quickly. The post we had was just a few mounds for cover – no trench or anything. For a couple of days we all of us felt pretty\n\nshaky, I think; I know I felt as if I had ceased to live; yet we managed to do everything that was necessary. When Stacy, our C.O. came round – he is not popular, but everybody admits he is a fine soldier, & stays cool as a cucumber, without flinching or attempting to take cover when ironmongery is flying; & he comes round regularly to see how things are going – Phil Knight asked for reinforcements. They finally sent in 2 men but I think we had to wait a long time for them, & another man got wounded, in the meantime.\n\nThe Germans attacked us three times in the daylight, but we could see him coming and he had to come a long distance, and was a fine target. I was amazed at the way they attacked, coming over in close formation, with heavy packs, tools, & a spare pair of boots hanging down – for, I suppose, the march to Paris. It seemed absurd to expect men to show any dash in an attack made like that, but it was terrifying rather, to see them approaching in numbers; yet the only time we really had cause to think they might get through we stopped them with a volly of Mills’ bombs, each of us throwing three in quick succession. When\n\nwe looked up, after the explosions had taken place, expecting to have to meet them with the bayonet, they had faded away like mist, except for the dead & wounded. From the packs we have gone through, they were bringing over rations for several days. Some of their food was quite good; and they had English matches in their packs – probably from the YMCA’s they have over run. A man named Gilchrist of A Co. (I think) had a lot to do with stopping the Germans. He got out with his Lewis & played upon them while they were massing, making casualties according to popular reckoning, of hundreds. The statement that the German officers advanced behind their men, driving them forward to the attack, which I never believed, has had ample verification in these stunts. I distinctly saw an officer kick a German who faltered, & threaten him with a revolver. I had a pot at the kicker, but don’t know whether it was I who got him.\n\nThere was an absence of artillery fire, and so things were quite good. We don’t know where the Germans are; and apparently they don’t know where we are, so it is no good wasting shells, which are being used\n\nmainly on the roads & opposing battery positions, when these are discovered. Being so short handed we were not expected to do patrols, but we did for our own sake a lot of work on our position. We made holes in the ground, a couple of feet deep, to give us cover, & to sleep in.\n\nJudkins, one of the two men sent to reinforce us, proved a tip top help. He came back with me from the hospital – he had been to Bulford, - & because he openly declared he would not go to France till he had to, I used to think him a shirker; but he isn’t. He gathered a lot of spare rifles, charged them, & when we were attacked was hopping from rifle to rifle emptying them, which helped to impress the Hun with our defence. Some of the rifles were German; he got the cartridges too. The position was one where it seems you could do anything you liked during darkness when there was no attack, and there was a lot of souveniring.\n\nDirectly we came out we were put onto all sorts of picquets & fatigues, some of the fatigues including packing up equipment rifles .303 etc which is scattered everywhere; and we were sent on picquets to the villages, naturally deserted; to prevent looting\n\nAs a consequence we are living like fighting cocks. There was any amount of poultry, sucking pigs etc. left by the inhabitants, but they are rapidly disappearing; & there is plenty of sugar, and tinned goods in the houses; while wine is a frequent discovery.\n\nIn Strazeele I saw a sight that made me boil. The place is burning, & the fires give light; and in a doorway of one house, I saw a tiny child lying as if it had grown tired of looking for its friends & gone to sleep. I thought that might be so, but when I stooped over it I found a big hole at the back of its head, & all its curls matted with blood. I felt as if I could go back straight to the line, & pitch into a stunt.\n\nI have visited Caestre again, which is quite close to where we are, which is near a village called as near as I can get it \"Thistwarli\". That was, I think, two nights ago; we were doing picketing work. The estaminets were doing a good business, & the inhabitants carrying on as usual; and one girl, when I asked her if she wasn’t going to get away, said laughingly: \"Allemand not come here!\". But our picquet had hardly been withdrawn before the Germans started a bombardment, & ever since the place had been bombed and shelled. Today, I thought I would go in\n\n& see the damage. It is a mass of ruins, streets littered with broken glass & debris, & through broken walls, the inside of the houses can be seen with coffee still on the stove & wine in glasses, half drunk. Of course it is empty: the people simply had to leave things as they were, and clear.\n\nOn the road from Caestre there is a team of four horses \n& a broken\n - all dead, of course – and a broken waggon. The outfit was caught by a bomb. The horses legs & heads are broken & grotesquely twisted, & the entrails of one are hanging out. It is a ghastly sight.\n\nWe are in billets – our company – in a farmhouse building, with plenty of good straw to be on, & a litter of pigs, which is rapidly decreasing, on the premises. \nToday we got some batches of reinf\n Planes try some bombing, but have not got near our premises, if they are the objective.\n\nFritz is trying some long distance shells, big fellows, at a battery near-bye; and, as they fall erratically, they are not pleasant to hear coming. At night the darkness seems lighted, away into the distance, by a series of bonfires, where farms & villages are burning.\n\nToday we received some fair sized batches of reinforcements, and the strength of No 8 is being made up. Lt Wilkinson is to take\n\ncharge of us. We had what transpired to be a practice stunt for an assembly: but it nearly gave some of us heart disease when we heard that we were to be rushed into the line, where \"matters are looking black\". Personally I think we have Fritz held. It seems funny that we hold him so easily; but I think two things are mainly responsible: Fritz is beaten already when he knows he is fighting Australians and (2) our fellows down to the windiest, have no inclination to do anything but hold on to the last; the approach of a massed attack is terrifying but it does not scare our men off. War being greatly bluff, the men who can bluff longest win through.\n\nThe \ndivisional\n battal. canteen seems to have nothing but bachelor buttons and Army Club cigarettes. Matches are hard to get (we are practically living on our R.X. issue of 1 box a week) and I have had to cadge paper from the B.O.R. A bullet tore into my haversack while we were in the line, & smashed the bottle of ink I always carry with me, making a mess.\n","68":"\n\nHave started making notes in my little Red Cross diary, as I don’t appear able to remember details with any accuracy. One of the German big shells lobbed right onto the billets of one of the \nTommy\n batteries and killed five.\n","69":"\n\nWe were out on a trench digging stunt, and wiring, making reserve positions; and just as we were finishing were well & truly shelled. The whole country is a network of trenches, now, These will be the defences for a new resistance every hundred yards or so if Fritz comes again. This is a change to the old policy, when our front line & support positions were considered enough; if anyone was to advance it was to be us.\n","70":"\n\nBattalion had some sports and a concert More trench digging at night.\n","71":"\n\nWe moved up towards the line, tonight, taking what seemed to me to be a very twisty track, until we struck our possies near Meteren.\n","72":"\n\nWe are located in supports, one platoon to a field, our position being simply pits dug in the ground, close to the hedge, tented with tarpaulins which has hedge-boughs thrown over for camouflage. Inquisitive ‘planes keep coming over during the day, so we have to keep close Fritz gave us a strafe in the morning, aiming most likely, at an international post in a \n\nchateau adjoining our position. There are some deserted dogs, that have evidently been great pets here; and when the firing commences they creep into our dugout & nestle against us, trembling and appealing for consolation with their eyes. It was quite pathetic. I don’t know who has been using these positions but the straw at the bottom is the most verminous I have met. I have been afflicted before; but was quite clean when I came in, & now am swarming with great big fellows. At night we went out to the front line, just outside Meteren (we had to pass through portion of the town, battered out of recognition, which is a grief to the boys who holidayed here) and dug trenches, without being disturbed very much, except for a few mortar and a lively stunt on the road with ground shrapnel & \"whiz – bangs\". Our predecessors have blown a big hole in the road & felled a big tree across the roadway to block Fritz if he manages any more advances\n","73":"\n\nHeavy shelling about all our fields, this morning resulted in casualties in No 5 platoon & C Company We went out at night and dug some more trenches.\n","74":"\n\nMoved up tonight into close supports very near \nour old\n the trenches we have been digging & wiring which we have to man if any attack comes. This\n\nis in consequence of an advance – a slight one – made by the third brigade last night or early this morning. We had to dig our own positions on the lines of the ones we have left, act as our own ration carrier, carry wire & wiring irons up handy to the line etc – a busy night. Lt Wilkinson had just been telling us that our position was a good one, as long as we kept quiet & did not let the Germans know we were there, when a trench mortar in our field gave Fritz his issue. A position is likely to be quiet when a t.m. invites the enemy’s fire. Had a couple of casualties through fire on the road, & \"Knock-out is missing.\n","75":"\n\nBusy on digging & wiring again – putting a strong barrier of wire before the trenches we dug previously. No 7 was withdrawn before the job was finished, owing to machine gun fire. We followed when our job was completed; after which Fritz blazed away at the place we had just left. Later Phil Knight with Judkins Scholes & myself when out & completed the job No 7 had not done, in record time.\n","76":"\n\nWe moved into front line, our position being in hop field, where, if you are not careful in moving about, the loose wires from the hop poles make an infernal racket as they are disturbed, clashing against one another. The position is a very decent little trench, which used to belong\n\nto Herr Smidt. The men we relieved say that everything is very quiet, & the Germans opposite (wherever they are they are a long way away) are passive resisters. In a recent stunt our fellows went over, captured the front line without a shot being fired, taken all the men they found prisoner; & waited to gather in the ration carriers!\n","77":"\n\nWe did some wiring, to secure our position; and then at 4.30 am, participated in a hop-over with the French, who are on our left; \nat 4.30\n At five the two whites went up to show how well we had done. It is a mere rectification of the line and it was an easy stunt. \n\nThere are a lot of unburied German dead, about & the atmosphere is putrid. We buried one Hun, lying near our trench, in broad daylight; yet Fritz did not fire a shot. Also a man hopped over the top to chase back two cows that were wandering towards the German lines. For a long time we have had cows on the Battalion strength, & the fresh milk is good. Other incidents during the day went to show that the opposing Huns are a lifeless lot. Nothing could induce him to fire a shot; & under the circumstances, it is difficult to keep the youngsters & newer men quiet. One man got into a bean field near the side of the trench\n\nand lay on his back reading a magazine. Tim Martin who had been missing, came down in broad daylight fully drunk, & standing at the top of the trench informed us that he had found wine. At 10.30 pm we sent cylinder gas over to Fritz as a present. Though we are comparatively quiet (we get hard stuff thrown at us of course, & our guns send considerably more back) the French seem to be stunting continually, by the barrages laid on. They are magnificent. When they start we can see the long line of Fritz flares going up all the way towards Kemmel; and the long hill slope at the back of us, which culminates in Mont des Cats is a mass of gun flashes. Our platoon is 19 strong all told. While on observation post about fifty yards in front, in a hedge, I got a shock. A party of Germans had approached, and I waited with a bomb ready for them; but they did not come. In the relaxation from the tension I had felt I unscrewed the bomb \nI had\n on which I had been depending, and found that it wasn’t detonated! Subsequently we found 2 dozen undetonated bombs in the trench! The episode, conjuring an imagination of what might have happened, has set my nerves on edge. I can’t see a bomb, but I want to inspect it; and I cannot accept any one as an honest bomb.\n","78":"\n\nPaddy McGirr, who is a brother of McGirr M.L.A., & who I gave the name of \"Colonel\", which stuck, was killed by a shell while coming into the line. He was classified as C class but fought for the chance to come over, got his eyes seen to, & was fitted with glasses and died before he got to the line! About a dozen of our batch of reinforcements have been killed, while many have been wounded.\n\nFritz is expected to attack. Our little lot had a scrimmage with a patrol which came too close & we got a prisoner who gave us this information. Fritz laid on a barrage & we \"stood to\", but nothing happened, except that our guns gave Fritz a barrage very much heavier than his. At 10.30 we again laid on the gas. In these cylinder attacks the gas is so strong that, although the cylinders, which go over with a rustle like silk skirts, are thrown well over, & the wind is generally blowing towards Fritz, we have to wear our masks and are warned. I made a misjudgment of the time; & before I could get on my mask got a whiff which made me deadly sick.\n","79":"\n\nPractically a repetition of the previous night – some artillery stunts & gas. We did some wiring, practically completing the position.\n","80":"\n\nRain has made things disagreeable. The trench was\n\nflooded, & the damp roof in many of the little dugouts we have made in the side of it came down. We were all wet through, & uncomfortable; but fortunately the sun came out. Fritz threw a lot of trench mortar stuff over, & came nastily near our possie – for which no doubt, we have to thank our indiscreet youngsters who insisted on showing where we are. Our gas went over again at 10.30. Fritz must be having a bad time.\n","81":"\n\nOne of our ‘planes brought down in No Mans’ land nearly opposite us was burnt by volunteers who went over and brought back the machine gun. There is a rooster that crows in No Mans’ land, & has already lured two of our chaps & three Germans to destruction. Where to have been relieved, but an attack was expected, so we stayed on.\n","82":"\n\nDuring the day German aeroplanes attacked our trench positions. They come down at a slant, blazing away, then soar upwards behind us, & coming back, repeat the operation, continuing the repetition until tired. We all thought of the £ 20 & 3 weeks holiday that come to a man who brings down a ‘plane & fired, cheerfully exposing ourselves; but our nonsuccess which was amazing, put the \"wind up\" & shortly we would get into our dugouts when \nthe\n a ‘plane attacked. The\n\nfeeling passed from joyousness at a prize to one like a rat cornered by a hawk. Our relief came at 2 am, and we went back helter skelter all the way to Circus. Passing through Strazeele the Germans punctuated the passing of each company with shells. It is marvellous that noone was killed. We picked up G.S. Waggons at Caestre.\n","83":"\n\nTo wake up to a day of peace, with nothing to do; wash the dirt off; shave; have a bath; get clean clothes; explore uninhabited villages knowing that you are clean, and ripe for civilized food and drink is one of the compensations of war. Wine, owing to the sudden demand has sprung to 7 fcs for the cheapest stuff & eggs & chips are almost unobtainable; but still the spell, which is for eight days, is enjoyable. We found that complete peace is a delusion, for Fritz, seeing that we are now neutrals, is not playing the game; he bombed us and the neighbourhood all last night, and one man in D. Co. was killed by some of our own Anti-aircraft stuff.\n\nSlight gap","84":" to","85":"\n","86":" \n\nFrom our billets at Borre, which we left at 7.30, we moved right into the line at Meteren, much to the right of our old position and a bit in advance of the old line I am deadly sick while I write this and am keeping down to my notes in my Red Cross Diary with little elaboration. Gas. Shell-shock, & overstrain, I think, is the trouble with me.\n","87":"\n\nIn the listening post in advance of our position I had the extraordinary luck not to be seriously hurt by any of four pieces of shell that struck me while a bit of a stunt was on.\n","88":"\n\nLieut , a man I have got to like, was killed whilst on patrol. \n\nHad fits of shivering, a sort of ague, which someone reported to Wilkinson who wanted me to go out, but I wouldn’t, as an attack is expected. Wilkinson thereafter gave me nips of rum at regular intervals to keep me going. I got out with a raiding party the work of which proved easy & successful. The action seemed to do me good.\n","89":"\n\nHands swollen up, & more shivering. Again refused to go out; but I had no interest in how matters went. A rather large\n\nnumber of shells were sent over to find the trench positions. and there were, also mortars & bombs.\n","90":"\n\nOur relief arrived promptly at 10.30; and we dropped back to support trenches, in which our positions were simply portion of the trenches roofed with boards etc. Just before we went a severe dose of gas was given to Fritz.\n","91":"\n\nAn attack on our line is expected. Supports were heavily shelled; and, when the heavy shelling was over, Lt Wilkinson \nwho\n was wounded by a chance burst of shrapnel. Usual fatigues.\n","92":"\n\nVery heavy shelling in the morning, during which the fire scorched the whole neighbourhood. Phil Knight is again in charge of the platoon. Shrapnel wounded another man - \nBeesly\n Beesley – while he was standing in the trench. More sickness, though it didn’t keep me off fatigues. Action appears to benefit me; it is lying in the trench that hurts.\n","93":"\n\nThe boys in the line repelled an attack easily. We \"stood to\" but were not wanted\n","94":"\n\nFritz makes every fatigue a nightmare by sniping reserve lines with machine guns. He seems to have all our tracks well marked. On a front line fatigue nine out of sixteen of us were hit and getting the wounded out was strenuous.\n\nPoor Phil Knight was wounded on another fatigue carrying wire; and at the same time bullets struck the wire I was carrying on my shoulder. Knight subsequently died. At 10 pm relief came & we moved out to a position near Borre. Had to wear gas masks as we went out for a time\n","95":"\n\nOur camp was shelled with a result of nine casualties, including D Company’s assistant cook who was blown into the air. Selected for a picquet at St Marie Cappel, but I was hardly able to march there. Have been queerish ever since the platoon was smashed, but fancy that if I can stick it till we get a real spell which the Battalion has been anticipating, I will pull through. What has made matters worse is my inability to rest. I can only sleep for a few hours, and all the rest of the time I feel I must be doing something. I put myself on all the fatigues and patrols there are, and if nothing is doing get digging, improving the trench position. The sweat pours off me immediately, & I get in a fever, & soon become exhausted with exertion; but almost immediately, after I have been told to rest, I want to get back & do some more. My shaking fits have been recurring during the last few days; and carrying my pack or blanket & equipment, for a few weeks now, has seemed a nightmare.\n","96":"\n\nFrench headquarters are at St Marie Cappel and we are there to see that our boys do not intrude. The business is done with side-arms only; and in two hours tour of duty on picquet; so that it is easy enough. The Frenchmen here are very friendly and have fraternised with us – that is, the soldiers; some of the civilian population are more suspicious than friendly. Two excited men from a farmhouse near came searching for three fowls which had disappeared; & the sight of two feathers near our tents roused them to a frenzy; but the other feathers had been discretely buried. The fowls tasted very nice.\n\nIn the afternoon, while I was on post three French soldiers came along and asked excitedly \"Have you heard the news, Dig-gare?\" They said the Germans had been pushed back 3 miles, and had lost 10000 prisoners in the Chateau Thierry district. They joined hands & danced round me. Later, the women & children had flowers in their hair; everybody was smiling & laughing. The whole village was humming with excitement. The Germans have been pushed back eight miles & lost 25.000 prisoners. When the estaminets opened it was ten miles, and 40000 prisoners; and before they closed (which they did not do until long past the regulation hours) the word was that the whole bulge of the German push down south has been\n\ncut off and the Crown Prince’s army is falling into our hands. The estaminets were crowded, & men were on tables singing & dancing; the Marseillaise was sung a dozen times & we Australians were practically made the guests of the revellers, wherever we appeared. I left early because my head became almost unsupportable with a dizziness which afflicts me sometimes, but, very late, a crowd of French soldiers came back to camp singing & laughing, with the bulk of our boys. They fastened a piece of paper, by string, to the tail of the tunic of one of our men, Reilly, and while he hopped & wriggled about, the rest, also hopping, tried to set fire to the paper. This meant that matches & lighted candles were flashing all over the place; the humour of the whole business was that a number of the Frenchmen belong to the anti-aircraft guard, whose duty it is to see that all lights are extinguished. Fortunately no ‘planes came over; & in view of the \"victory\" down south the display of spirit seemed forgivable. It is also amazing, this childish ability \"to go gay\" in view of the distressing circumstances under which the French have lived. This village has not been badly touched, but the tower & front of the church had suffered from bombs, & the clock has been placed out of action. \n","97":"\n\nWent down with aching head, giddiness & dry fever, combined with shiverings. Was put off duty\n\nbecause, every time I stood up. I commenced to reel. There is no news of the success against the Germans. The ration-cart brought back the news that there have been more casualties in the camp at Borre, and the boys have had to spend some time in the trenches in the neighbourhood of the camp.\n","98":"\n\nCould not walk to doctor; too ill. Sergeant tried to find French M.O. suggested I should rest all day. Giddy each time I rose.\n","99":"\n\nSaw Divisional H.Qrs doctor, who is located at Sylvestre Cappel; a very decent sort, who gave me a thorough examination. No duty; to report again for hospital if not improved.\n\n- 3\n\nAfter doing nothing but lie down for a couple of days, felt better. We were suddenly relieved in the afternoon, & given marching orders to join the battalion, which has gone back to Circus. Saw one of the French soldiers who had been celebrating the German defeat, & reminded him that there was complete silence about the alleged victory, which apparently, had never occurred. He said \"No; but it was a splendid night, diggare!\" His division is moving out to go south. \"Texas Jack\" an officer (Booth is his name, but he is given the other name because because of the way in which he hangs himself with revolvers) offered to leave me \n\nbehind but I elected to march with the boys. My pack was put in the ration cart. We got away about 8.30 and reached the Battalion after midnight.\n\n`June","100":"\n\nSick as a dog after the march, Doctor offered to send me to hospital, but I am trying to hang on. Doctor suspects influenza. My bones are aching. Today","101":" doctor wanted to send me to hospital; and when I objected gave me \"medicine & duty\"! But Wilkinson told me to stay off parade & rest.\n","102":"\n\nThese are the entries in my little Red X diary :-\n","103":"\n\nAt 8 am. left for Borre & the line: didn’t report sick; lasted march, but dropped at finish – dizzy & sick, and unable to eat.\n","104":"\n\nDoctor says \"Debility\", & sends me out. At","105":" Fd Amb. doctor suspects Malaria, but endorses debility. Arrived No 15 C.C.S. doctor says \"shell-shock, and debility\".\n","106":"\n\nN.Y.D. Pulmonary Tuberculosis\" Oh Hell!\n","107":"\n\nAmbulance train to No 2 Canadian Stationary Hospital.\n\nThe doctor told me I was to report before the Batt moved out for the line, but naturally I didn’t. Geo Abrams, (the Sergt) said that I could not last the march but I managed, although the whole world seemed staggering for the last few miles; and I was just reminding George that I had told him I \ncould\n last the march, when I flopped.\n\nI had the upper bunk in the ambulance going back; and the top of the cover had nice holes in it where shrapnel or something had hit it. It was nice to look at this while we were pulled up near","108":" Brigade Headquarters near which Fritz was throwing heavy stuff & shrapnel. We were pulled up for an hour there. I got dopey\n\nduring the journey back, and don’t remember the 3 Field Ambulance much, but know that the journey was rough, owing to shell holes in the road.\n\nNo 15 CCS is at St Omer or nearbye, and has the good fortune to have escaped bombing, so far. It was gorgeous to have a warm bath and lie in clean sheets. and the treatment & rest is splendid. The great question amongst all the patients is \"Is mine a Blighty?\" By unanimous consent mine is; and the doctor’s reports, which I have quizzed, are alarming and lengthy. If I get out of bed I shake all over, and the others howl for me to get back into bed again. \n\nDirectly I arrived in my ward the man in the bed next to me asked \"You’re an Australian aren’t you?\" and then added, \"I can always tell you Australians\". Of course I had no uniform, having changed into pyjamas, so I was surprised; but I notice you can pick all the Australians, quite easily, even in their pyjamas. There is something distinctively \"Australian\" about us all, it seems.\n\nThe journey in the train was surprisingly comfortable. We went to Calais first & then down to Boulogne. At Calais there were a lot of signs of Fritz bombing, especially some marvellous big holes which showed \n\nvery good efforts to get the bridge. The No 2 Canadian Stationary Hospital is at Outreaux, outside Boulogne; and we had a long Ambulance journey through the town to reach it. The driver told us that the Germans have been doing severe bombing and caught a fleet of Ambulances the other night on the road from Calais to Boulogne. Just by the hospital is a building that has been bombed; but we have had peace so far since I came. One of our nurses, a rich American girl, supplies the ward with cigarettes & fruit and strawberries & cream, even.\n\nI am getting tired of bed; but they won’t let me out, and indeed, I shake when I get out; but I can’t sleep much, and the feeling of restlessness which got me in the line, irritates me a lot, specially when I have nothing to read, & the lights are out. I am marked for England; and I understand the doctor regards my case as serious; but none of them seem to make out what it is. One doctor & the Major have been in three times & sat on the bed and asked endless questions. I think, myself, that my condition is just a result of overstrain – carrying on while I was sick, and then trying to do too much when I was really exhausted. The boys were very good to me in the line when\n\nthey knew I was ill. If I happened to be asleep when any work came along for which I was supposed to be due, they would get someone else in my place, & not wake me up. One night, I woke up suddenly & found myself alone in the trench. A horrible nightmare of an idea that the line had been abandoned & the whole lot wiped out came to me; but then I remembered & got out on the wire fatigue. \n\nAnother night I found Judkins had taken my place on post, though it was my turn; & he didn’t want me to take over from him. On another occasion, after I had been having some shivering fits, George Abrams brought me along a dixie with rum in it, & said the boys had all subscribed half a spoonful – a fine thing when the way in which rum is prized in the line is considered. \n\nOf course, I did what I could for the boys: wrote letters for them, gave them advice, & helped to get matters rectified for them in paybook mistakes etc; & I used to tell them yarns; but I appreciated their acts of consideration, especially when a lot of them turned out to give me a send off when I left in the ambulance.\n","109":"\n\nI am at Clapton Hospital, London, a rather bare place, which used to be a workhouse – it must be cold & cheerless in the winter. Left No 2 C. Stationary Hospital on the","110":" and went on board the \"St Denis\" at Boulogne. Whenever the stretcher was going to be carried I wanted to walk; but was shoved back again. When we were going on board, the man on the stretcher ahead of me proved to be Hampton, a new arrival, since it was smashed, in my platoon, and a man who was with us a Marie Cappel when I became ill.\n\nHe has it in the leg, & has come, also, to this hospital. His wound came in a hopover, a week ago. The curious thing is that I wrote to him & two others to make sure of having my pack & things in it looked after; and Hampton tells me that the other two, poor Somerville, (who got the fictionally frequent but war-rare \"shot through the heart\"), and Leyton, have both been killed.I came over to England in a pyjama coat merely, the Hospital being short of things; & I have very little with me, though what I have includes the inevitable pen & bottle of ink. I don’t seem able to keep fountain pens, having lost three. I suppose the souvenirs in my pack are gone.\n\nIt was almost as glorious to see the sea again, having not seen it for six months, as the sense of lying in clean sheets was on the first night in hospital. I managed to get a bunk near a porthole, & kept my face glued to it. A destroyer raced backwards & forwards alongside us; and right into the distance we could see Britain’s \"police of the sea\" keeping the Channel clear. \n\nA rather fine thing, when the ambulance train moved out of Dover, was the way the people gave us a cheer as we passed. As they \nhave\n probably have done this daily for four years it must be rather wearying for them; but evidently they think it a duty.\n\nIt seems, from what Hampton says, that the line has been substantially advanced & Fritz well pushed back between Meteren & Morville.\n\nAbout Morville an artilleryman in the train told me that the Germans were in one end of the town while our troops, supposed to be withdrawing, where in the other end; but both sides were sampling the wine left by the inhabitants, and did not worry about fighting. His battery lost only two guns & they were rendered useless to the enemy.\n\nIf Fritz had come on instead of staying\n\nto get drunk, he ought to have been very much more successful. Perhaps the french wine had more to do with stopping him everywhere than our force. The line against him was very weak. Ourselves, we used to hold a Brigade front with a Battalion; & at last our Battalion could not have been much over 400 fighting strength. When we were relieved by Tommies it always seemed that a fearful crowd came along. Perhaps our system of having only a few men in a position was best. It saved the chance of casualties; but then \nmen\n were wanted to do the work.\n\nWhile we were at Cercus, a town nearby, called Morbeque, was wiped out by shell-fire. I was in there when Fritz dropped his preliminary shells: in spite of all that may be said he usually gives a few days warning before he pours shells into any place – or it may not be a warning but only range finding. \n\nA bright little kiddie, who did not seem to know whether to be frightened or not, was near me; so I gave him my hand & took him home. I found his Mother with three younger children, one a baby. The estaminets were better in Morbeque than\n\nmost places, and I was there when Fritz commenced the wiping out. It was awful. We helped the people to get out. I went to this woman’s house, but found it deserted – apparently the family had got away, though when I had urged the woman to go, she shook her head, clinging to her home in the strange way these french people have. What was strange was the noiselessness of the people’s despair. One woman, who had delayed to get a bundle of household goods, had one of her children killed by a piece of shell beside her; yet she did not utter a cry, but simply took the hand of another child & went. Outside the village, where the people, exhausted with flight, were lying under the hedges, they spoke in whispers, as if they were afraid that the shells would hear & follow. Morbeque was ruined when I last saw it, but it was better than Herzebruck, a big railway junction. In this town a lot of our fellows got into trouble for looting. \n\nThe doctors have not yet decided what is wrong with me; but they are certainly treating me very seriously.\n\nWhen we reached Charing Cross we were met by women who gave us hot tea &\n\nbiscuits; and our stretchers were carried out by voluntary workers – old, or physically weak men who were not fit to be soldiers, but enthusiastically do this work. When I saw my bearers I wanted to get out & walk worse than ever; but they did not let me drop. Flowers were thrown in to us in the Ambulance – a nice idea.\n\nFritz was over the \nday night\n week before we arrived here, on a bombing excursion, and did a lot of damage near this hospital. A big barrage of searchlights is put on nightly, searching the heavens for marauding Germans. I lie awake at night and watch them.\n\nWhen I asked the doctor when he thought I’d be fit to return to France he seemed to think the question a joke; so I dn’t think an early return likely. The doctor here has assured me that he does not believe in the consumption idea, however. That worried me a lot, because consumption it seems to me, necessitates a semi-isolation from ones family, if it is severe.\n\n"}}