{"Document Name":{"0":"Diary_0339","1":"Diary_0339","2":"Diary_0339","3":"Diary_0339","4":"Diary_0339","5":"Diary_0339","6":"Diary_0339","7":"Diary_0339","8":"Diary_0339","9":"Diary_0339","10":"Diary_0339","11":"Diary_0339","12":"Diary_0339","13":"Diary_0339","14":"Diary_0339","15":"Diary_0339","16":"Diary_0339","17":"Diary_0339","18":"Diary_0339","19":"Diary_0339","20":"Diary_0339","21":"Diary_0339","22":"Diary_0339","23":"Diary_0339","24":"Diary_0339","25":"Diary_0339","26":"Diary_0339","27":"Diary_0339","28":"Diary_0339","29":"Diary_0339","30":"Diary_0339","31":"Diary_0339","32":"Diary_0339","33":"Diary_0339","34":"Diary_0339","35":"Diary_0339","36":"Diary_0339","37":"Diary_0339","38":"Diary_0339","39":"Diary_0339","40":"Diary_0339","41":"Diary_0339","42":"Diary_0339","43":"Diary_0339","44":"Diary_0339","45":"Diary_0339","46":"Diary_0339","47":"Diary_0339","48":"Diary_0339","49":"Diary_0339","50":"Diary_0339","51":"Diary_0339","52":"Diary_0339","53":"Diary_0339","54":"Diary_0339","55":"Diary_0339","56":"Diary_0339","57":"Diary_0339","58":"Diary_0339","59":"Diary_0339","60":"Diary_0339","61":"Diary_0339","62":"Diary_0339","63":"Diary_0339","64":"Diary_0339","65":"Diary_0339","66":"Diary_0339","67":"Diary_0339","68":"Diary_0339","69":"Diary_0339","70":"Diary_0339","71":"Diary_0339","72":"Diary_0339","73":"Diary_0339","74":"Diary_0339","75":"Diary_0339","76":"Diary_0339","77":"Diary_0339","78":"Diary_0339","79":"Diary_0339","80":"Diary_0339","81":"Diary_0339","82":"Diary_0339","83":"Diary_0339","84":"Diary_0339","85":"Diary_0339","86":"Diary_0339","87":"Diary_0339","88":"Diary_0339","89":"Diary_0339","90":"Diary_0339","91":"Diary_0339","92":"Diary_0339","93":"Diary_0339","94":"Diary_0339","95":"Diary_0339","96":"Diary_0339","97":"Diary_0339","98":"Diary_0339","99":"Diary_0339","100":"Diary_0339","101":"Diary_0339","102":"Diary_0339","103":"Diary_0339","104":"Diary_0339","105":"Diary_0339","106":"Diary_0339","107":"Diary_0339","108":"Diary_0339","109":"Diary_0339","110":"Diary_0339","111":"Diary_0339","112":"Diary_0339","113":"Diary_0339","114":"Diary_0339","115":"Diary_0339","116":"Diary_0339","117":"Diary_0339","118":"Diary_0339","119":"Diary_0339","120":"Diary_0339","121":"Diary_0339","122":"Diary_0339","123":"Diary_0339","124":"Diary_0339","125":"Diary_0339","126":"Diary_0339","127":"Diary_0339","128":"Diary_0339","129":"Diary_0339","130":"Diary_0339","131":"Diary_0339","132":"Diary_0339","133":"Diary_0339","134":"Diary_0339","135":"Diary_0339","136":"Diary_0339","137":"Diary_0339"},"Date":{"0":"unknown","1":1249.0,"2":1250.0,"3":1251.0,"4":1252.0,"5":1253.0,"6":1254.0,"7":1255.0,"8":1256.0,"9":1257.0,"10":1258.0,"11":1259.0,"12":1260.0,"13":1261.0,"14":1262.0,"15":1263.0,"16":1264.0,"17":1265.0,"18":1266.0,"19":1267.0,"20":1268.0,"21":1269.0,"22":1270.0,"23":1271.0,"24":1272.0,"25":1273.0,"26":1274.0,"27":1275.0,"28":1276.0,"29":1277.0,"30":1278.0,"31":1279.0,"32":1280.0,"33":1281.0,"34":1282.0,"35":1283.0,"36":1284.0,"37":1285.0,"38":1286.0,"39":1287.0,"40":1288.0,"41":1289.0,"42":1290.0,"43":1291.0,"44":1292.0,"45":1293.0,"46":1294.0,"47":1295.0,"48":1296.0,"49":1297.0,"50":1298.0,"51":1299.0,"52":1300.0,"53":1302.0,"54":1303.0,"55":1304.0,"56":1305.0,"57":1306.0,"58":1307.0,"59":1308.0,"60":1309.0,"61":1310.0,"62":1311.0,"63":1312.0,"64":1313.0,"65":1314.0,"66":1315.0,"67":1316.0,"68":1317.0,"69":1318.0,"70":1319.0,"71":1320.0,"72":1321.0,"73":1322.0,"74":1323.0,"75":1324.0,"76":1325.0,"77":1326.0,"78":1328.0,"79":1329.0,"80":1330.0,"81":1331.0,"82":1332.0,"83":1333.0,"84":1334.0,"85":1335.0,"86":1336.0,"87":1337.0,"88":1338.0,"89":1339.0,"90":1340.0,"91":1341.0,"92":1342.0,"93":1343.0,"94":1344.0,"95":1345.0,"96":1346.0,"97":1347.0,"98":1348.0,"99":1349.0,"100":1350.0,"101":1351.0,"102":1352.0,"103":1353.0,"104":1354.0,"105":1355.0,"106":1356.0,"107":1357.0,"108":1358.0,"109":1359.0,"110":1360.0,"111":1361.0,"112":1362.0,"113":1363.0,"114":1364.0,"115":1365.0,"116":1366.0,"117":1367.0,"118":1368.0,"119":1369.0,"120":1370.0,"121":1371.0,"122":1372.0,"123":1373.0,"124":1374.0,"125":1375.0,"126":1376.0,"127":1377.0,"128":1378.0,"129":1379.0,"130":1380.0,"131":1381.0,"132":1382.0,"133":1383.0,"134":1384.0,"135":1385.0,"136":1386.0,"137":1387.0},"Entry":{"0":"\n\n","1":" AUSTRALIA\nLeft Liverpool 3AM.\nEmbarked on SS Marathon at 6.30 and drew out into stream. Left harbour at 1pm. had a good view and was able to speak to family on wharf. The ‘Encounter’ and a destroyer are accompanying us.","2":"\nReveille 6am. Beautiful weather. Sea calm. Ship fired two shots with her stern gun. These are the first shots we have heard in the war of course. They were only practice shots. Comforts sent aboard where distributed – two parcels for me.","3":"\nWeather raining in the morning but fired up with fresh sea. afternoon sea became rougher and night came on with heavy seas. Retired at 8.30. Ship is heaving and staggering nearly all are now asleep in quarters.","4":"\nMeeting with rough seas approaching the Bight. Were joined by 4 more transports this morning – can see Mr Pearson’s boat the one Leonard is on.","5":"\nToday is the roughest yet. Seas breaking right over the bows and sweeping the decks. Have been put on guard. The weather is bitterly cold it is said we are in the Bight – the convoy consists of ‘Ulysses’ ‘Marathon’ ‘Port Sydney’ ‘Pakeha’ ‘Tofua’ ‘Therakina’……….’Shropshire’ and 8 (?) others.","6":"\nMorning broke clearer with seas calmer but during day rain set in with rising seas. We are not yet out of the Bight and expect to make Fremantle on Sunday. Had a yarn with Theo Meillion on deck at night.","7":"\nNot quite so rough today but a heavy sea towards night. It is said that the ship rolled to an angle of 45 degrees and remained so for 3 seconds last night of course the rumour is ridiculous.","8":"\nToday it is again very rough and it is said the glass is still falling. Have been watching the ‘Tofua’ pitching and rolling like a cork. Seas have been breaking over the deck and one man was hurled up against a winch by one and rendered unconscious.","9":"\nWe are now getting seas on the port bow and the ship is rolling rather much. It has not rained but the sky is still cloudy. We have apparently turned slightly N.W. and should make Fremantle by Sunday.","10":"\nStill the same endless stretch of sea only broken by the other ships of the convoy. The weather is still dull with a rather calmer sea.","11":"\nDuring last night a cruiser joined us on the port side. The weather is misty and the sea calm as a millpond. Attended C of E service in the morning and Y.M.C.A. in the afternoon.","12":"\nBefore daybreak we where able to see lighthouse. Sae calm. 11.45 am on guard on mess deck and we are just drawing along side wharf in Fremantle Harbour. Route march and leave in afternoon. Spent a few hours in Fremantle not impressed with town.","13":"\nShip drew away from wharf at 6AM and anchored in stream. The day has been glorious We drew away from stream and steamed westward at 4pm.The sunset was gorgeous and the sea calm. Before leaving the DC was taken off and new command put on. 13 of our men where left behind.","14":"\nThe dawn broke with beautiful and calm weather which continued throughout the day. It appears that all but 2 of the missing men where brought out in a tug at midnight – Eric Bull and Tom Sleeman have missed the boat. Attended a short service on deck.","15":"\nThe weather is still clam and beautiful. This afternoon all the stragglers which had been bought out and put on the ‘Marathon’ were transferred to their respective ships in mid ocean.","16":"\nThe weather continues fine and the sea calm. The water is a beautiful blue and gorgeous sunrise and sunsets have been general since leaving Fremantle.","17":"\nStill the weather is fine and calm. There is no sign life about. The birds have all forsaken us. A sports meeting was held on deck this afternoon. Have rotten throat and cold.\n27 WHITSUNDAY","18":"\nAttended service on port side of Promenade deck. Conducted by Major Foreman (Meth) and Communion afterwards held in Saloon. Weather is still beautiful. Wrote several letters both yesterday and today. 11 in all.","19":" WHITSUN MONDAY\nNothing particular occurred today - the sea is still kind and the weather fair. The night was beautiful moonlight and I stayed on deck soliliquising and brought a hammock up and slept on the fore hatch.","20":" WHITSUN TUESDAY\nArose at 5.10 and after bathing went on deck as usual. At 8 o’clock we all paraded and forming 4 deep facing outwards. This was because of a burial of a man on the ‘Tukarina’. Which boat went about 2 miles ahead of the convoy for the ceremony. The flags were flown half mast.","21":"\nHave been 8 days out from Fremantle and the weather is still fine. Full dress parade was held this morning and this afternoon was devoted to washing clothes and writing letters of which I have written a great number since leaving Freemantle.","22":"\nContinued fine weather with a fairly heavy swell. Rose about 5 and bathed as usual. Wrote home in the afternoon. The evening for the past few nights have been beautifully moonlight. It is rumoured that we reach Mauritius on Tuesday.","23":"\nWeather still glorious. We are supposed to be just within the tropics so our course has been W.N.W. Wrote to K in afternoon, retired 8.45.","24":"\nOn guard today. The weather is OK. Boxing tourney held in afternoon. Wrote to all the girls and Mr Lack. The moon was brilliant at night. Slept on deck.","25":" JUNE\nOn coming off guard had shower and was in time to attend Communion service at 11. Saw several flying fish do good heights. Evening again moonlight.","26":"\nParade took place on Saloon deck and will for future which is improvement. Have been allotted to lifeboat No 7. During parade where shown knots and splicing. Concert was held on port Saloon deck aft after tea. Evening moonlight.","27":"\nAbout 10.30 land was sighted which proved to be Mauritius. It is an interesting place from appearances. Is covered with high and clear cut peaks. H.M.S. Diris left us here and 2 Japanese cruisers took over the convoy.","28":"\nThe weather today is very nice and clear with a very calm sea. Another island was sighted about 6 o’clock which however I missed stated to be Reunion Island. The convoy is in the same formation with the 2 Japanese cruisers in the lead. Have seen plenty of flying fish today.","29":"\nThe day passed off uneventfully with the weather perfect. A cool breeze blowing over a blue calm sea tempered the sun’s heat. We are travelling south west and have been ordered to hand in the mail before tomorrow night. Should make Durban about Wednesday.","30":"\nToday we ran into a rather severe wind storm which continued throughout the night. Had a lecture in the afternoon. About teatime we had a very heavy rain storm. Mail closed today and I posted 25 letters and 6 postcards.","31":"\nThe sea worked up during the day and at night the ship was rolling heavily but the sun shone warmly. Sports help in the afternoon. Yarned with ‘Scully’ on deck after tea.","32":"\nOn guard today but was relieved to be able to attend Communion at 11 o’clock. My position was in wheelhouse. The sea worked up at when on duty 10pm-2am a following sea was hurrying us along whilst now and then it broke over the port aft.","33":"\nWeather still good. About 4pm the convoy divided one cruiser and 6 boats including the Marathon went ahead whilst the remainder dropped behind. Had a rainstorm about dusk.","34":"\nOn getting up this morning land was visible towards which we where making. At breakfast time it was quite visible with farmlands dotting the hillsides. Convoy proceeded into harbour of Durban. We went alongside. Route march in the morning, leave in the afternoon. Had lovely time.","35":"\nThe vessel coaling yesterday and all today. Route march in the morning, leave in the afternoon. Saw Mr Pearson today and Len last night. Had dinner tonight at Royal Hotel also last night. Went into the surf baths. Weather beautiful. Had rickshaw trips and did some shopping. Returned 9.30.","36":"\nThis morning we had another route march and was granted leave till 4.30 as the ship was to sail at 5. Went to the Zoo, Art Gallery and Museum- tried to get message through to Bill Kerkaldie on ‘Awchese’ which is in port but failed- Vessel drew out into stream. The Suffock collided with the Ulysses and smashed a hole through the Ulysses hull.","37":"\nAt 12 o’clock weighed anchor and left port with one cruiser ASCANNIUS, TOFUA ,TUKARINA . Very sorry to leave Durban having had a bosker time.","38":"\nTravelling south along the coast which is quite clear, today being perfect. Forgot to mention there where thousands of Tommies in Durban. We where told that including us (13,000) there where 35,000 troops in the town.","39":"\nThe weather very rough today with green seas sweeping long and sheets of spray enveloping the vessel. It was rather cold also.","40":"\nSea still rough but moderated towards evening. About 7.30 pm we passed a hospital ship all lit up. Think it was the OXFORDSHIRE . Are just about rounding the Cape of ( Good Hope)? and should reach Cape Town tomorrow. Half an hour later we passed another hospital ship.","41":"\nAt day break land was in sight and we proceeded into port coming alongside wharf at 12 noon. Thus arrived at Cape Town but got ashore at 7pm to 10pm the rest of the troop were granted leave at 2pm. Being dark when I was on shore could not see much of town. Table Mountains very clear with cloth on it.","42":"\nShould have sailed this morning but when ropes and gangway where cast off and tugs alongside sailing was cancelled. Granted leave from 2pm to 10pm. Visited Art Gallery, Museum, Gardens and took train to sea point and returned by train to town arriving about 5.45. Had a good look about the town, which is bigger than Durban with more whites.","43":"\nAt 7am moved to a wharf at right angles to that occupied by us the last two days. Washing parade until 12 noon. Leave granted in afternoon. Football match between F. A & Infantry former won 47 to 3. Saw match for 20 minutes & went into town . Sent cable home. Went to Parliament House & heard debate where we saw Botha Mr Merriman & others. Returned to ship at10 o’clock.","44":" JUNE1917\nDay broke dull and cold. At 7.30 am pulled out from wharf and anchored outside. At 10.15 we left accompanied by auxiliary cruiser ‘ORAMA’ and 5 others of the transports viz ’ASCANIUS’, ‘SHROPSHIRE’, ‘RENALLA’, ‘TOFUA’ and ‘TURAKINA’. Sea calm but cold continued throughout the day. Passed a whaling vessel at 5.30pm.","45":"\nToday have been travelling in a northerly direction and the ship has been rolling more so than on any previous day of our trip. The sea has a big swell which is striking us broadside. The air is warmer than yesterday but still chilly. A number of applicants for the Royal Flying Corps and convalescing Tommies joined us at Cape Town.","46":"\nAgain on guard occasioned by my speaking on Parade on Monday last and for which I was awarded 3 guards. Such penalties for petty offences are more petty spiteful than those given at school. One would think that men are pupils in an infants school. Day was beautifully calm.","47":"\nMy post on guard was Cells. The prisioners last night gave us some trouble and threw water over the Military Police on guard on 3 occasions – I had to parade a man of our guard to the C.O. for being asleep on guard. Fixed some photos. Day again beautifully fine.","48":"\nWeather dull but sun came out in afternoon when the orchestra gave a concert. Completed a letter home. Have heard rumours of the proceedings when we “cross the line”.","49":"\nAt daybreak a steamer was sighted on the horizon. The ‘ORAMA’ with all guns out went after her. It appears it was a Norweigan vessel of 5,000 tons and she put on full steam put up 17 knots thinking the ‘ORAMA’ was a German. She was overhauled by the later and her papers examined then instructed to alter her course. Weather beautiful and night moonlight.","50":"\nAgain the day was fine and as we are well in the tropics it was fairly warm. The sea was calm as the harbour practically and scarcely any motion was noticeable in the vessel. The night was beautifully moonlight. It is rumoured that another rebellion in Ireland has broken out.","51":"\nToday has been really hot and we are close to the line. Plenty of flying fish are to be seen. His morning we dropped out of the line and indulged in some gun and rifle practice. The gun fired about 8 shots. The war rumour today is that the Russians have launched 3 offensives and that the ‘MONGOLIA’ has been torpedoed.","52":"\nUsual Saturday morning alarm did not take place. Sports held in afternoon and after an exciting pull with the engineers the F A won the final tug of war. Alarm was sounded at 5.30 whilst the evening service was being held on deck. Should cross the line tonight sometime.","53":"\nDay very hot. Stated to have crossed the line at about 3A.M. so that we are now in the Northern Hemisphere. A general alarm took place at 11.30 the siren being sounded for this purpose for the first time.","54":"\nA burial on the ‘ASCANUCO’ took place. On guard today. In afternoon at 3.30 the “Neptune” ceremonies were held in honour of crossing the line and were a splendid success. Just as they concluded at 4.30 all men were ordered on deck with their boots on, a fire having been discovered in the coal bunkers. Relays were sent down and the fire got under control at about 11pm. One of our men fell down the stokehold and severely cut his face and head.","55":"\nToday has been refreshingly cool. We expect to reach Sierra Leone tomorrow morning. We saw a fine shoal of porpoises this morning. The mail closed on board yesterday. Sent letters to K and home.","56":"\nThis morning we arrived at Freetown the capital of Sierra Leone. W. coast of Africa. It is a small place and unhealthy. All the fleet anchored in the stream. It is very warm and muggy. Natives have been out in their canoes diving for coins. A pair funnel cruiser is here .The entrance has a huge net across it to keep out submarines.","57":"\nToday the officers went ashore but we have no prospect of going. The weather is sultry but not very hot. Niggers have been coaling but they are very lazy. Had war news of Russian success. Several fellows have been taken ill with a sort of fever.","58":"\nThis morning a heavy rainstorm burst over the place and the niggers again did some coaling. More chaps ill with this fever. It is rumoured we leave here tomorrow. A peculiar sickness has broken out. About 10 F.A. fellows being bad.","59":"\nAt 8am we drew out from Sierra Leone and now starts the final run to England. Orders came out to the effect that from now on our lifebelts must now be carried continually. A boxing contest took place in the afternoon. Did some washing etc.","60":"\nWe now occupy the tail of the right line instead of as hereto for the head of the left line. We are making good speed stated to be about 13 knots. Weather fine & cool. Did some photo printing in afternoon and wrote to Reg Stone. Sickness is still bad about 30 of our chaps in or just out of hospital.","61":"\nLast night the cruiser fired 3 shots across the bows of a steamer near us and compelled her to alter course. Today the weather has been beautiful towards evening freshened up with sea rising.","62":"\nThe sea is rather rougher today and a stiff headwind is blowing which is rather chilly. Commenced another letter to Kath. It is said we get home next Tuesday or Wednesday.","63":"\nToday was on guard. Some of the men are assisting in the stokehold shovelling coal. The weather is cool fine. Tonight the cruiser (MANTUA?aux) dropped to the rear of the fleet.","64":"\nThe day dull and cool. Came off guard. Kit bags brought up from the hold in order to get anything necessary out of them and pack them prior to disembark. The ‘MANTUA’ again at dusk dropped to the rear. Light up to 8.45pm.","65":"\nThe weather is fine and cool. Today the convoy has commenced evolutions as precautions against submarine. Each ship is going a zig zag course turning sharply every few minutes. It is very interesting to watch. A vessel appeared away on the horizon but soon disappeared.","66":"\nWeather fine and sea calm. Nothing doing in morning. In afternoon sports were held and were successful. Followed fancy dress ball on deck. Rumoured that a man fell overboard on the ‘BENALLA’.","67":"\nOn guard today. Attended farewell Communion Service at 11 o’clock at which about 60 were present. Weather fine and sea calm. Service held in Well deck 7pm.","68":"\nMorning damp & misty but fine during the day. Rumour that we will joined by destroyers shortly are rampant. At night farewell concert held on deck. Had a super before going to bed.","69":"\nAt 2.20 were joined by destroyers (6) which came up out of the mist. No 86 came quite close whilst (58) is slightly in advance . Later 2 destroyers left us and went off with the cruiser. The weather is misty.","70":"\nToday has been foggy and wet. The destroyers are fine, flying her there everywhere. Some wreckage floated by including a wheelhouse. The sea has been rather rough. We should get in tomorrow early. On guard in charge of a guard watching the rations to be taken ashore tomorrow.","71":"\nPassed Eddystone Lighthouse am. Arrived in Devonport 6am. Remained on ship all day and night after proceeding to wharf. Saw Plymouth Hoe Harbour full of shipping and war vessels destroyers etc.","72":"\nEntrained about 2pm. Journey took us through Devon & Somerset. Country looked gloriously green. Went through Exeter. Arrived at Amesbury at 10.15 pm and marched 5 miles to Lark Hill. Arrived about 12. Bed 1.30 after having bully beef & biscuits & tea. Slept in tents in ‘isolation’.","73":"\nSaw Eddie Corbett. Reveille 7am. Parade 10am. Nothing much done in morning. In afternoon went over to the village of Amesbery and saw old church building about 14 th century. Looked through it, had tea and went to concert in Buffet. Walked back about 8.15. Enjoyed it all immensely. Saw Stonehenge.","74":"\nWas tent orderly. All stayed in during the morning. In afternoon went over to Durrington. Had tea at Y.M.C.A. there and went to church in evening. Church built 11th century. Pulpit placed there during reign of Queen Elizabeth. Enjoyed it muchly.","75":"\nReveille 5.30. In morning moved guns. In afternoon dentally examined. Wrote letters in evening. Airman was looping the loop during evening. Wrote up diary before going to bed. Cabled home. ","76":"\nDid not do much work. Lecture and physical drill in morning. Nothing doing in afternoon. \nWEDNESDAY 24 JULY 1917\nAgain not much doing. In afternoon sports meeting was held and much enjoyed it. Went in for bowling at wicket and nearly won it.","77":"\nAfter an easy morning in afternoon we were again inoculated and then dismissed to our tents. Mail came in and I got 10 letters. Mother 1, Mabel 2, Eth 1, Kath 1, Mirrie 1, Charlie 1, Cec 1, Marie 1, Joyce 1. Was very glad to get them.","78":"\nInoculation giving rather painful results - arm sore and bad headache. More letters from Father 1, Marj 1, PC from Cec Ford.","79":"\nLittle fatigue work in morning. In afternoon to Fighledean where we saw ‘The Spreading Chestnut Tree” and Blacksmith shop. Went on to Durrington and had tea there at Y.M.C.A. tent and stayed to an open air concert there. Arrived back at camp at 9.30. Many airplanes flying around today.","80":"\nYesterday met Arthur Long fresh from Egypt where he had met Cuttie. This morning we had church parade and as it rained in afternoon we did not go out. Wrote letters in YM hut and went to bed early.","81":"\nRaining on and off during day which made everything miserable. In the evening we went to the YM hut again and wrote to Lance and Bill. Had a letter today from lance and he is in England and says he will come out some day next week and see me. Says Bill is in the “Nestor”A71.","82":"\nStill raining dismally. Did little rifle drill in morning. Formed part of a firing party at the funeral of Sgt Morrison of the A.F.C. who was killed Sunday. Buried at Fightledean. Had a look in Barracks of the Flying Corps. Tea was provided for us there on our return from funeral. Were taken over in motor lorries.","83":"\nThe weather is most miserable and cold. Little gun drill in morning and physical exercises etc. In afternoon signed up our pay books. It looks as though our tent is leaking and we are in for an uncomfortable night. Tonight messed in marquees.","84":"\nIn spite of wet slept very well with waterproof sheet both under and over me. A number of the chaps slept in the stables. Still raining but cleared slightly during the day. Was again inoculated and results are rather uncomfortable. At night wrote several letters home to the girls.","85":"\nWeather is still bad with muddy parade ground. Feeling rather sore in arm after inoculation but not as bad as after last weeks injections. Nothing much doing – Had a nice letter from Aunt Ben to which I replied – Wet feet yesterday and today.","86":"\nRather wet in morning during which we had a Kit Inspection. In afternoon Jim Sully and I went to the village of “ Shrewton” a nice little place about 4 miles away. Had rather nice tea, bought a loaf of bread cost 11s. Returned to camp about 9pm.","87":"\nWeather fined up considerably. In morning usual church parade. In afternoon Jim and I went to Lake a small village, Woodford, Middle Woodford where we had tea – Great Durnston where we stayed to service in a church over 900 years old. The walk was beautiful. Returned 9pm.","88":" BANK HOLIDAY 1917\nThe weather is fine and warm, did some gun drill in morning & physical exercises in afternoon. In evening wrote letters & wrote up diary.","89":"\nWeather rather bad again. In evening wrote letters and received telegram from Lance saying he would arrive at 2pm tomorrow. I am looking forward so much to seeing him. Received a letter from dear old Stewart.","90":"\nRaining steadily all day. At 2.30 Lance arrived. I got off for afternoon. E had a great time together Learnt for the first time he had been wounded under left eye. Had tea together then motored over to his camp at Perham Downs 14 miles away. Hope to arrange to meet during weekend.","91":"\nCommenced mess orderly duties for week as it is now my turn. Weather is much clearer and sunnier. Aired clothes and did a little washing. In evening wrote to Lenna & Stewart.","92":"\nNothing doing – still on mess orderly which seem to be a soft proposition – continued showering throughout the day & evening.","93":"\nWeather much finer than has been for some days. Received a letter from Lance saying he had been sent to Weymouth in the expectation of being sent home to Australia. In afternoon as meeting old Lance was out of the question I went over to Durrington & had a pleasant time.","94":"\nWeather still pleasant after dinner went to Fighledean and then returned to Durrington where we had tea after which we attended service which was held in the meadow. Had another note from Lance.","95":"\nOwing to no gunners being allowed to do duties and I had to relinquish mess orderly and go out on gun drill etc. Wrote to Lena, Boyden as well as other letters in evening. Weather very showery.","96":"\nThe weather again very showery. In afternoon we were drafted into our batteries I being put into No 2. Met ‘Sproggie’ Cameron in camp this morning and had a yarn to him.","97":"\nCommenced duty in new battery and was put into A group gunners for instruction. This it is rumoured may interfere with our leave as after completion of course which is supposed to be uninterrupted we should be ready for draft. Hoping otherwise however.","98":"\nIn morning was put into ‘B’ class Gun Squad but in afternoon managed to get back into ‘A’ squad. Went to Durrington in evening after tea had a pleasant time arrived back about 9.","99":"\nGun drill physical drill etc during day. Mail from Australia given out. Had letters from K, Lenna & Ethel, Mabel, Joyce Lance Mr Merriman and the bank. The latter say no money has arrived which is very unfortunate.","100":"\nGun drill all morning. In afternoon Jim Scully and I went to Amesbury, The Lake Great Dunsford & Woodford and had a most pleasant afternoon. Took several photos and returned to camp about 9.30. Had a letter from father & Aunt Ben.","101":"\nIn morning firstly ‘stables’. After breakfast went to church parade. In afternoon went to Durrington with Littlemore and then on to Amesbury where I met Jim & we went to church together which we enjoyed. Arrived back at 9pm.","102":"\nIn morning we where inspected by the Duke of Connaught who is very like the late King Edward but has no beard was quite close to me and he spoke to several of the boys in a most friendly manner. In afternoon again put back into ‘B’ Group of Gunners. God must have some reason for the change.","103":"\nThis morning took on job of” limber “gunner for one week, Weather very unsettled. Jim Loder went on leave with other today. Went to concert tonight.","104":"\nWeather still showery & unsettled. Nothing much doing. In evening went to a concert at Y.M.C.A. Hall but it being very poor left early.","105":"\nAgain the same routine – nothing to record much. Weather bad as usual. In evening Sully and I went over to Durrington put in an hour there driving home at 9pm. Put in for a ‘road pass’ to Salisbury for Saturday.","106":"\nRaining. Aust mail in today. So far received letters 2 from Mabel,Mirrie, Ethel Marj & Audrey, Mr Robinson, Father but none from K. In evening wrote some letters.","107":"\nFine weather today. In afternoon have procured ‘ROAD PASS’. Sully and I went into the town of Salisbury and had a very enjoyable time. The great cathedral is magnificent & stupendous. In evening went to an entertainment. Left at 9pm. Arrived in camp 10.40pm.","108":"\nIn morning weather was very pleasant but remainder of day was very wet. In afternoon Littlemore & I went to Durrington had tea there & went to church. Walked leisurely home arriving 9pm.","109":"\nToday has been very wet indeed and so things are a bit miserable. In evening Sully & I wrote letters in Y.M.C.A.. Received 2 papers from Kath.","110":"\nWeather very cold 54o & rain, wind & mud. Usual training during day & wrote home in evening. Nothing of particular note occurs.","111":"\nWeather atrocious rain wind & mud. Court Marshals (3) read out during parade this morning. Cleared up towards evening when I wrote home & to Aunt Ben telling her that the leave I was expecting was off.","112":"\nToday has been weather similar to previous day. Wet & cold. Usual drill. Received letter from Aunt Ben. In evening wrote letter as usual.","113":"\nToday unexpectedly granted leave so telegraphed Aunt Ben telling her. Expect to leave lark Hall in the morning about 8am. Paid etc during day. Cleaned leatherwork etc during evening.","114":"\nReveille 5.30. Breakfast 6.15 left camp 7.30 for Amesbury. Train left 9.50 arrived Waterloo 1pm. Marched to HQ’S A.I.F. Horseferry Rd dismissed – caught train for Buckhurst Hill 3.35 & arrived at Roebuck Hotel 4.15 – met Aunt Ben’s cousins Lottie & Edie. Went for a walk with latter. Tea 8.30 Retired 10.15pm. Wet in morning fine in afternoon.","115":"\nRose 8am. Beautiful day. In morning with Cousin Lottie took a bus into London through Woodford etc, east End Whitechapel etc. Saw monument. Went on London Bridge, saw Tower Bridge, Mansion House, The Bank Exchange etc. Returned 1pm. Afternoon went to Sidney’s house to tea. Came back went with Edie & Lottie. Retired 10pm.","116":"\nLeft Buckhurst Hill 10am. Arrived London 11. Went to Bank NSW fixed up money. Went to Saunders & Shepherd, saw Mr Holland, had lunch with him. Went to St Paul’s Cathedral, Y.M.C.A. saw Roy Clack. Went to Clements & Newling had a look over works. Arrived back Roebuck Hotel 6.15 – Went 20 mile motor trip. AIR RAID 11.30 to 1am this night.","117":"\nWent to dentist 9.30 – 10.30 thence into town. Went over Tower of London & up Monument. Then to Y.M. headquarters. Had lunch, had a long walk round West End. Called Stewart Dawson’s Regent St. Left town 5.30 for Woodleigh. Also went to Art Gallery & called at Clements & Newling.","118":"\nWent into town. Saunder’s & Shepherd, saw Mr S & Stewart Dawson. Met Lottie went taxi ride round Hyde Park saw Buckingham Palace, Marlborough House & West End then to His Majesty’s Theatre to Chu Chin Chow Oscar Ashe etc very pretty. Raid last night. Killed 11, wounded 62. Big Thunderstorm.","119":"\nWeather fine. Rose at 8.15. After breakfast played piano player. At 11.30 went for drive with Edie called on Mrs Linder near the ‘Roebuck’ and met Phyllis her daughter. Returned home to lunch and Bertha ( Mrs Riley) was there. In evening Sydney called. Very regretfully took my leave at 6.30. Have had a glorious time and they have been so very kind to me. Arrived camp 1.30am.","120":"\nToday did a little drill am on guard tonight. A draft goes on Tuesday and I think ‘Sully’ is in it. Weather is beautiful. On guard at 5pm.","121":"\nOn guard still wrote to Lance 8am & Mr Lack & Cut. Relieved about 6.45 & then went to Durrington with Sully who is to leave for France with draft next week. Returned about 9.15.","122":"\nIn morning attended church parade & Communion afterwards. After dinner went to Durrington with Littlemore and wrote to R Stone, commenced letter home. After tea went to service 6pm which was well attended. Returned 9.","123":"\nWeather fine today. Drill all day. In evening wrote letters. Tonight received a parcel from Reg Stone which proved to be a tin of Arnott’s Biscuits and which are very acceptable.","124":"\nDraft in which was Sully left today. Weather fine. In evening wrote letters.","125":"\nWeather beautifully fine. Nothing doing but rumours of being on draft next week seem persistent. Wrote letters in evening. Commenced one to K.","126":"\nNothing to record much. Received a paper from Ethel & ‘Sydney Mail’ from K. In evening did a little extra “gunlaying” & then wrote & finished one to K. Weather fine.","127":"\nWeather still fine. Plenty of gun drill today. Another ‘Mail’ arrived from R but no Aust letters. Had a letter from Aunt Ben.","128":"\nGun drill. Fine day. At dinnertime was warned for draft which was rather sudden. In afternoon went into Amesbury returning about 9pm.","129":"\nStables before breakfast and church followed by medical examination afterwards. Then wrote letters. At 4.30 – 5 reported to stables and then went to Durrington to church. Arrived back at 8.45pm.","130":"\nDrill as usual all day. Aust mail delivered. Received 8 letters which were very welcome. In evening had a yarn with Jimmy Loder and wrote some letters. ","131":"\nWeather very miserable. More Aust mail from home K 1, Aunt Al & Aggie etc also had a letter & a number of cards from Edie. In evening wrote to Mother who I learn in letters has been very ill. Tonight it is cold windy & wet.","132":"\nRaining very heavily today. All morning was lectured to by Major Jackson on Barrage Fire. In afternoon it was still raining so we again had lectures. In evening wrote as usual.","133":"\nIn morning went on to usual drill. In afternoon went through our gunnery tests but I am afraid it was not too well done as a whole. Our detachment however only had one error. In evening went to bed at 8.30. Did no writing which was exceptional.","134":"\nIn morning went through a series of barrage fire. At 2 o’clock were officially warned that we were on draft. Went through a dental inspection. Sent a cable to mother 25 th Sept. Wrote in evening.","135":"\nIn morning handed in our surplus clothing to QM store. Went through Battery gun drill in gas helmets whilst smoke was sent across the battery. In afternoon did extra gun drill- laying etc. In evening went into Durrington with Jimmie.","136":"\nIn morning church & medical inspection. In afternoon did writing and then went to Durrington with Jimmie Littlemore, Theo Meillon. Had tea there & then went to church. Returned about 8.30.","137":"\nIn morning went through the ‘gas’ room. In afternoon after lecture went through a gunlaying test and passed. There seems to be some doubt as to whether we go tomorrow. In evening wrote letters to K & home.\n\n"}}