{"Document Name":{"0":"Diary_0517","1":"Diary_0517","2":"Diary_0517","3":"Diary_0517","4":"Diary_0517","5":"Diary_0517","6":"Diary_0517","7":"Diary_0517","8":"Diary_0517","9":"Diary_0517","10":"Diary_0517","11":"Diary_0517","12":"Diary_0517","13":"Diary_0517","14":"Diary_0517","15":"Diary_0517","16":"Diary_0517","17":"Diary_0517","18":"Diary_0517","19":"Diary_0517","20":"Diary_0517","21":"Diary_0517","22":"Diary_0517","23":"Diary_0517","24":"Diary_0517","25":"Diary_0517","26":"Diary_0517","27":"Diary_0517","28":"Diary_0517","29":"Diary_0517","30":"Diary_0517","31":"Diary_0517","32":"Diary_0517","33":"Diary_0517","34":"Diary_0517","35":"Diary_0517","36":"Diary_0517","37":"Diary_0517","38":"Diary_0517","39":"Diary_0517","40":"Diary_0517","41":"Diary_0517","42":"Diary_0517","43":"Diary_0517","44":"Diary_0517","45":"Diary_0517","46":"Diary_0517","47":"Diary_0517","48":"Diary_0517","49":"Diary_0517","50":"Diary_0517","51":"Diary_0517","52":"Diary_0517","53":"Diary_0517"},"Date":{"0":"unknown","1":1223.0,"2":1225.0,"3":1226.0,"4":1227.0,"5":1228.0,"6":1233.0,"7":1235.0,"8":1244.0,"9":1248.0,"10":1252.0,"11":1254.0,"12":1255.0,"13":1256.0,"14":1257.0,"15":1258.0,"16":1259.0,"17":1260.0,"18":1261.0,"19":1262.0,"20":1264.0,"21":1265.0,"22":1266.0,"23":1273.0,"24":1280.0,"25":1284.0,"26":1291.0,"27":1292.0,"28":1293.0,"29":1294.0,"30":1300.0,"31":1301.0,"32":1302.0,"33":1304.0,"34":1305.0,"35":1315.0,"36":1316.0,"37":1320.0,"38":1321.0,"39":1329.0,"40":1330.0,"41":1332.0,"42":1333.0,"43":1338.0,"44":1339.0,"45":1340.0,"46":1341.0,"47":1358.0,"48":1360.0,"49":1377.0,"50":1379.0,"51":1380.0,"52":1381.0,"53":1382.0},"Entry":{"0":"\n\n \n\n","1":" I went to Brighton spent one day there & from thence to Eastbourne & Worthing, Two seaside places almost identical with Brighton, went to see Hurstmonceaux Castle and reported back to Perham Downs at 1 p.m. on","2":"\n","3":" Arrived Perham Downs and after a lot of frigging around I was classified B1A3\n","4":" Still charging about from camp to camp & from Hut to Hut\n\nI went into Luggershall to day. It is a one horse show. I suppose the locals\n\n \n\nare prejudiced enough to call it a village.\n\nWe have some characters in detention. One has been masquerading as a clergyman and has married many soldiers even including Lieutenants & Captains \n\nHe would not have been caught only he got drunk and gave himself away. Another won £120 at two up and is charged with 106 days A.W.L.\n\nAnother bantam about 4 feet wore short trousers & socks and has been selling papers.\n\n \n\nAnother went into a military tailor’s place and tried on a","5":" Lieut’s uniform and hit the tailor between the eyes & \"imshied\" After this he went to a hospital and asked the boys if they were satisfied with their food. Going out the gate he asked the corporal for a couple of shillings as he had left his purse. The Corp. insisted on his taking a couple of pounds. He took it. That’s all. A big 6 foot chap went for an issue of boots.\n\nQ.M. \"What size\" Priv. \"14’s\"\n\n \n\nQ.M. \"Hm\" Toss him 2 pairs of sevens\"\n","6":" Anzac day. All the Anzacs & decorated men paraded by themselves and honor was paid them by the rest of the camp.\n\nA Church parade & march past by Colonel Knox, Camp Commandant. Half Holiday in afternoon which was taken up by Boxing, Wrestling etc. The new division has been named \"Fragments of France as it contains only men who have seen active service.\n\n \n","7":" I have been put in the new division and the 137 others who came with me are the foundation of the 63rd Battn (B. Co)\n\nThere are many conjectures what they are going to do with us either Reinf div, Reserve, To France Mesopotamia or elsewhere. Have discovered Eric Booth in adjoining 62nd Batt.\n","8":" This English weather is terrible. A days scorching a day’s wind & dust and then cold, bitter cold. I have been building ovens or at least supervising the building, instructing Sgt. Cook on them. The\n\n \n\nO.C. of the Imperial Cooking school at Jellalabad Barracks at Tedworth came along & took me in his motor to the school, put me in the hands of a S.S.M. and showed me how the ovens etc. were to be built and I am to see that they are built the same. This is a soft cop for me.\n\nTedworth is a one eyed village of two or three streets and seems to be nothing but barracks all with indian names. Putra, Lucknow, Allaharabad etc.\n\n \n\nIt is marvellous the appliances they have to prevent the waste.\n\nThere is a chap here who has a mania for walking. He has walked a trench round his tent 6ft deep. We call him Dick Whittington.\n","9":" Half the company refused to go on parade this morning until properly fed. The O.C. Talked them over, they went on parade & the tucker improved. Luggershall has 1 street with a few shops, plenty of rifle ranges, slot machines and other devices to\n\n \n\nextract money from soldiers.\n\nThere is old ruins surrounded by an outer & inner moat also a cross. These crosses in various parts of the country mark the spot where the body of a royal personage was laid down on his way to his last resting place. Hence Kings Cross, Charing cross etc.\n","10":" Have been through another examination for N.C.O. and look like coming out well. Church parade. Our old friend Colonel Logan was on Parade. Issued with another lot of Equipment.\n\n \n\nWe have a chap here so cross eyed that when he crys the tears roll down his back. He was put in charge of a section one day and he said \"Fall out the man I am looking at\". They all fell out.\n\nThe camp and its environments (woods etc) is a harbour for women of loose morals and much harm is being done among our boys, the Bulford total being steadily swelling.\n","11":" Have started a course of Physical Training under an imperial W.O. \n Cigarettes have gone up \n\n \n\n1d for 10 1½ for 20. Consequently they are very scarce.\n\nConcert at 7.15 by Southampton Party.\n","12":" The general term for anybody detailed for duty of for any disagreeable job is to say they \"Came a gutser\" I have \"come a gutser\" I expected more from the examination than I got viz Lance Corporal, but I have prospects. One of the disappointed candidates said if the examiner’s brains were dynamite they wouldn’t blow his hat off.\n\n \n\nThe Australian nom-de-plume for cooks is \"babbling brooks\".\n","13":" Left Perham Downs 12 noon for Wareham played off by No 1 Com. Depot band Wareham Camp is a home. Uptodate cook houses Huts, mess tables etc. It is a fine town very picturesque, the second oldest town in England. There is a bridge with the inscription that \"anybody damaging it etc is liable to be transported for life\" I wish this by law was in vogue now as it undoubtedly meant Australia or Van Dieman’s Land now\n\n \n\ncalled Tasmania.\n","14":" A great saying here if anybody interrupts a conversation is:- \"I am talking to the organ grinder not to the little fellow on top in a red jacket\" or: - \"When I can’t turn the handle myself I will let the little fellow on top have a go\":- From Wareham, the towns of Bournemouth, Poole, Swanage, Corfe’s Castle & Weymouth are handy. (shown on Encl. P.C.)\n\nLt. Col. Abbott has been attached as C.O.Batt.\n\n \n\nI am still anxiously waiting for a band to be started here. A curious idea in regard to the arrangement of Huts, is that nothing is to be hung on the hooks or placed on the shelf. These must be purely for ornamental purpose. The men from the depot (convalescent) wear many coloured bands on their rt arm. Purple ---- Staff, Green B1A4 or active service Yellow not classified Red Tanks Blue B1B or H.S. They call the men who are for Australia\n\n \n\nor incapacitated \"Tanks\" because they are, naturally, very slow getting about.\n","15":" Went to Stowborough and Cold Harbour. They give names like these to villages (?) of 2 houses and a post office or Hotel. (18) We were inspected by Brigadier General Antill Brig. of","16":" Brigade.\n","17":" Went to E.Holme and East Stoke, two villages close by. Not long ago when Winter’s snow & cold was the main feature of the country people said that they would give\n\n \n\nEngland to the Germans and apologise for the state of it\"\n\nBut now England is a veritable garden. By the roadside are myriads of violets and golden papilleonaceous flowers, while the fields are golden with buttercups and white with small daisies. The trees are green and the April showers seem to be a month late.\n","18":" Went for a walk towards Corfe castle as far as half way house, 2½ miles.\n\n \n","19":" Bull ring has begun for those who have not seen active Service.\n","20":" Went to Corfe Castle, a fair sized village about 4½ miles from Wareham, the main features of which are the Castle and the church. The Church has been rebuilt (1860) but the tower dates back to 1260.\n\nThe Castle as cards show has been a great stronghold and in Cromwells time, it was besieged for 3 years but was finally taken by treachery. Part of this was built\n\n \n\nin 690 - 700 A.D. and the remainder in 1066 by William I. The outerwalls and a great portion of the Castle was undermined and blown up with gunpowder, so great pieces of masonry lie upturned all round. King Edward I was Killed here and his body afterwards hidden in a well close by. During the siege, they stripped the lead from the roof of the church and used them for bullets. For further information see Guide Book\n\n \n\nIt was in the immediate vicinity that King Alfred burnt the Cakes.\n","21":" Went for a walk to Arne, on Poole Harbour & Hide Hill both villages and that’s all.\n","22":" I have a real Aus Aboriginal sleeping next to me. He is a big burly chap and my eyes ! talk about snore. I don’t think pete could have competed with him, in fact I never thought a human being could kick up such a row.\n","23":" Have been on Quarter guard. Here is a conundrum\n\n \n\na man has to get 100 head of stock for £ 100, & pay £ 5 a head for horses £ 1 for cattle and 1\/- for sheep. How many of each Answer: - 19 horses 1 cattle 80 sheep.\n\nInspection by C.O. No Church parade.\n","24":" Wishing to fall the Batt’n in, in the new style, the adjutant said \"fall out, Gentlemen\" meaning the officers. Two privates, fond of a joke fell out also. The adjutant being a sport just said \"fall back you two Gentlemen\". Having done 3 guards\n\n \n\nand 1 B.O.C. in a week the C.O. was good enough to give me the week-end off and I came here to Bournemouth. It is rightly called the garden of England for many varieties of rhododendron flourish in profusion, while laburnum and many other flowers make the park one mass of colour. The number of women-folk and their excellent taste and quality of dress makes the place very bright (and interesting) It is a very big town and is very picturesque.\n\n \n\nJust across the water a mile or so away is the Isle of wight and a very desolate place it looks, great rugged chalky looking cliffs. All along the beach are bathing machines and huts. We had a delightful morning dip; the water having hardly a ripple\n","25":" Started Bombing School Sent for band instruments A notice in one of the London lavatories reads:-\n\n \n\n\"owing to the scarcity of paper, the public are requested to use both sides\"\n","26":" At 6 a.m. the Brigade left Wareham for Hurdcott about 42 miles distant. This is the longest march we have done so far and there are many doubts as to how the mens feet will stand it. We are to do it in 3 days in instalments of 17,9 & 16 miles for the respective days. \n\nIt is lovely weather and we averaged\n\n \n\njust on 3 miles an hour including 10 minutes every hour spell. We quite enjoyed the march and at dinner-time which was 10 a.m., for we had an early breakfast, we had done 10 miles. The country was very beautiful as it is all under cultivation. At 2.30 p.m. we arrived at Shaftesbury a fair sized village which was a very welcome sight.\n\nWe were bivouacked in a big paddock &\n\n \n\nlaid down in our platoons so that we could unpile arms and move straight off.\n\nNobody was allowed to leave camp to go into Shaftesbury, * but the boys took it into their heads to go in, so they went, despite the efforts of the M.P’s, pickets and appeals from the Brigade Major so in the finish they had to declare an \"open camp\".\n","27":" The next night we\n\n* Shaftesbury should read Blandford\n\n \n\npassed through Shaftesbury and at 2.30 pm on\n","28":" we came through Fovant where we were met by a band which played us into Hurdcott, No 7 Camp.\n","29":" Hurdcott is a fine camp. The villages around are Fovant 1½ miles, Dinton 2½ mls, Broadshaw 2½ mls Barton 2 mls & Wilton 4½ mls.\n\nAll along by the camps in slopes of the hillside are various regimental crests done in chalk, including\n\n \n\na rising sun 100 yds across and a map of Australia 200 yds across over which is floated the Australian flag.\n","30":" I have been through a bombing school and for last fortnight have been instructing on bombing.\n\nSome of the instruments have arrived but our difficulty is to find players. We are trying to draft some over from","31":" T.B.\n","32":" Left for Musketry School Bhurtpore Barracks Tidworth\n\n \n\nIt is to finish on","33":" and to be a pretty stiff course.\n","34":" Am having a good time and have the privilege of Sergeant’s mess. Tommy Instructors etc. Went to see \"The Belle of New York\" at the Garrison Theatre. Very good. We get passes every weekend but are not permitted to travel by train. Rot!\n","35":" Went by motor to Andover and Salisbury for the Week end.\n","36":" \"Care of Arms\" Exam. Came out fairly well\n","37":" \"Aiming & firing\" Exam\n\n \n","38":" T of E.T. Exam.\n\nAn episode in France I call to mind, when at Armentieres, as soon as we arrived, the first few days we opened a pretty heavy strafe. Consequently in retaliation the Germans lobbed a good number on the town. The estaminet keepers were frantic and ran about saying \"Australians No bon, No bon, plenty bombard. Finish Couchez\"\n","39":" Left the school with a first class pass for musketry & Lewis Gun.\n\n \n","40":" Have not been at Hurdcott a day when I was put on guard\n","41":" Have switched into the band.\n\nThe battalion is dashing over the tops of the hills taking imaginery positions while we stop in camp & practice.\n","42":" The allies have started the big push to-day Met Cec, Crockford, and we are trying to get his transfer to the Band.\n\n \n\nMiss Lena Ashwell’s concert parties of which there are a considerable number, often play at the Y.M.C.A’s and we spend many enjoyable evenings there.\n","43":" Playing Batt. out to all day stunts. While the battn work we go out getting filberts & raspberries.\n\nCec. said \"If only our people could see us now they would think we were all right\".\n","44":" Went to Hastings for 2 days and had a ripping time with Kit Went all over Hastings\n\n \n\nCastle but \"came a gutser\" over the extension I was expecting, the telegram arriving just after I had left\n\nAug 25th The","45":" Division has been gassed and there are very few survivors of my old battalion.\n\nWe were to have been reviewed by the King this week, but owing to the way the 3rd had been cut about, drafts have gone from every N.S.W. battn in the","46":" We sent away 300 to make up the 36th, My old Batt.\n\n \n\nBeing a bandsman I was held back. Our band is progressing favourably. We have only 17 players but a good balance & a surprising volume for our number.\n\nAs a recreation we play \"Finlandia\" one of the finest tone poems I have heard.\n\nWe have a great stock of music, including many pieces like \"William Tell\" which we may never be able to play, but which makes our repertoire look impos\n\n \n\ning. \n\nThe weather now is very good but we have frequent stretches of wet weather probably caused by the heavy bombardments. Our bandmaster now is W. May late bandmaster of Newtown. The 36th are trying to claim us for our old batt’n. but the Colonel here is very reticent about letting us go so we don’t know how we will get on.\n\nWe have a hut to our selves now & are as happy as poss.\n\n \n\nOn Saturday mornings we play for the troops so that they will learn to march. The boys think the world of us & recognise that the band is the soul of the battalion.\n","47":" Just played a draft away of 50 to Dinton for Rolleston & Codford, there to have 3 months training as signallers before proceeding overseas\n","48":" Lt Mackenzie O.C. ‘D’ Co who has been on Gallipoli was applied to for 2 days leave by the greatest outlaw in the battalion\n\n \n\nHe refused it but in the morning called him up and said he had reconsidered his decision.\n\n\"If I had not granted it you would have taken it wouldn’t you\" \"Yes sir\" he said.\n\nWell we don’t want any A.W.L’s. here so I grant your leave. If 2 days is not enough wire for 2 more, if that is not enough wire again, and when you think you have had a holiday come back.\n\n \n\nThe Lt has lost the balance of his senses and has become a military maniac & was taken away to-day.\n","49":" Got 56 hours leave to London. Went on the Thames to Kew Gardens. On Sunday there was an air raid scare, but nothing happened.\n\nWe saw some of the damage done by the previous raids. One of the lions at Cleopatra’s needle was badly mutilated.\n\nAll damage is immediately repaired and a week later you would not think there had been a raid.\n\n \n","50":" There have been a lot of rumors as usual about the disposal of the battl’n. Some say demobilisation & back to our units Some think we are off to Wareham, etc. I, with Asquith, say \"Wait & See\".\n\nWe had a grand sports to day on No 7 Camp grounds & we the band had to play all day.\n\nThere were some fine fancy dresses, the best being a monkey and several swagmen just such as one\n\n \n\nsees in Aussy.\n","51":" Am on draft back to my battalion.\n\nThe","52":" Division is demobilised & we leave to-day or to-morrow to go back.\n","53":" Farewell No 4 Diary\n\n"}}