{"Document Name":{"0":"Diary_0439","1":"Diary_0439","2":"Diary_0439","3":"Diary_0439","4":"Diary_0439","5":"Diary_0439","6":"Diary_0439","7":"Diary_0439","8":"Diary_0439","9":"Diary_0439","10":"Diary_0439","11":"Diary_0439","12":"Diary_0439","13":"Diary_0439","14":"Diary_0439","15":"Diary_0439","16":"Diary_0439","17":"Diary_0439","18":"Diary_0439","19":"Diary_0439","20":"Diary_0439","21":"Diary_0439","22":"Diary_0439","23":"Diary_0439","24":"Diary_0439","25":"Diary_0439","26":"Diary_0439","27":"Diary_0439","28":"Diary_0439","29":"Diary_0439","30":"Diary_0439","31":"Diary_0439","32":"Diary_0439","33":"Diary_0439","34":"Diary_0439","35":"Diary_0439","36":"Diary_0439","37":"Diary_0439","38":"Diary_0439","39":"Diary_0439","40":"Diary_0439","41":"Diary_0439","42":"Diary_0439","43":"Diary_0439","44":"Diary_0439","45":"Diary_0439","46":"Diary_0439","47":"Diary_0439","48":"Diary_0439","49":"Diary_0439","50":"Diary_0439","51":"Diary_0439","52":"Diary_0439","53":"Diary_0439","54":"Diary_0439","55":"Diary_0439","56":"Diary_0439","57":"Diary_0439","58":"Diary_0439","59":"Diary_0439","60":"Diary_0439","61":"Diary_0439","62":"Diary_0439","63":"Diary_0439","64":"Diary_0439","65":"Diary_0439","66":"Diary_0439","67":"Diary_0439","68":"Diary_0439","69":"Diary_0439","70":"Diary_0439","71":"Diary_0439","72":"Diary_0439","73":"Diary_0439","74":"Diary_0439","75":"Diary_0439","76":"Diary_0439","77":"Diary_0439","78":"Diary_0439","79":"Diary_0439","80":"Diary_0439","81":"Diary_0439","82":"Diary_0439","83":"Diary_0439","84":"Diary_0439","85":"Diary_0439","86":"Diary_0439","87":"Diary_0439","88":"Diary_0439","89":"Diary_0439","90":"Diary_0439","91":"Diary_0439","92":"Diary_0439","93":"Diary_0439","94":"Diary_0439","95":"Diary_0439","96":"Diary_0439","97":"Diary_0439","98":"Diary_0439","99":"Diary_0439","100":"Diary_0439","101":"Diary_0439","102":"Diary_0439","103":"Diary_0439","104":"Diary_0439","105":"Diary_0439","106":"Diary_0439","107":"Diary_0439","108":"Diary_0439","109":"Diary_0439","110":"Diary_0439","111":"Diary_0439","112":"Diary_0439","113":"Diary_0439","114":"Diary_0439","115":"Diary_0439","116":"Diary_0439","117":"Diary_0439","118":"Diary_0439","119":"Diary_0439","120":"Diary_0439","121":"Diary_0439","122":"Diary_0439","123":"Diary_0439","124":"Diary_0439","125":"Diary_0439","126":"Diary_0439","127":"Diary_0439","128":"Diary_0439","129":"Diary_0439","130":"Diary_0439","131":"Diary_0439","132":"Diary_0439","133":"Diary_0439","134":"Diary_0439","135":"Diary_0439","136":"Diary_0439","137":"Diary_0439","138":"Diary_0439","139":"Diary_0439","140":"Diary_0439","141":"Diary_0439","142":"Diary_0439","143":"Diary_0439","144":"Diary_0439","145":"Diary_0439","146":"Diary_0439","147":"Diary_0439","148":"Diary_0439","149":"Diary_0439","150":"Diary_0439","151":"Diary_0439","152":"Diary_0439","153":"Diary_0439","154":"Diary_0439","155":"Diary_0439","156":"Diary_0439","157":"Diary_0439","158":"Diary_0439","159":"Diary_0439","160":"Diary_0439"},"Date":{"0":"unknown","1":372.0,"2":385.0,"3":386.0,"4":387.0,"5":388.0,"6":389.0,"7":390.0,"8":391.0,"9":396.0,"10":401.0,"11":403.0,"12":404.0,"13":405.0,"14":406.0,"15":407.0,"16":408.0,"17":409.0,"18":410.0,"19":411.0,"20":412.0,"21":413.0,"22":414.0,"23":415.0,"24":416.0,"25":417.0,"26":418.0,"27":419.0,"28":420.0,"29":421.0,"30":422.0,"31":423.0,"32":424.0,"33":425.0,"34":426.0,"35":447.0,"36":462.0,"37":463.0,"38":464.0,"39":465.0,"40":466.0,"41":467.0,"42":468.0,"43":471.0,"44":480.0,"45":481.0,"46":482.0,"47":483.0,"48":484.0,"49":485.0,"50":486.0,"51":487.0,"52":488.0,"53":489.0,"54":490.0,"55":491.0,"56":493.0,"57":494.0,"58":496.0,"59":497.0,"60":498.0,"61":499.0,"62":500.0,"63":501.0,"64":502.0,"65":503.0,"66":504.0,"67":505.0,"68":506.0,"69":507.0,"70":508.0,"71":509.0,"72":510.0,"73":511.0,"74":512.0,"75":513.0,"76":514.0,"77":515.0,"78":516.0,"79":517.0,"80":518.0,"81":519.0,"82":520.0,"83":521.0,"84":522.0,"85":523.0,"86":524.0,"87":525.0,"88":526.0,"89":527.0,"90":528.0,"91":529.0,"92":530.0,"93":531.0,"94":532.0,"95":533.0,"96":534.0,"97":535.0,"98":536.0,"99":537.0,"100":538.0,"101":539.0,"102":540.0,"103":541.0,"104":544.0,"105":545.0,"106":546.0,"107":547.0,"108":548.0,"109":549.0,"110":550.0,"111":551.0,"112":552.0,"113":553.0,"114":554.0,"115":555.0,"116":556.0,"117":557.0,"118":558.0,"119":559.0,"120":560.0,"121":561.0,"122":562.0,"123":563.0,"124":564.0,"125":565.0,"126":566.0,"127":567.0,"128":568.0,"129":569.0,"130":571.0,"131":572.0,"132":573.0,"133":574.0,"134":575.0,"135":578.0,"136":579.0,"137":580.0,"138":581.0,"139":582.0,"140":583.0,"141":586.0,"142":587.0,"143":589.0,"144":590.0,"145":591.0,"146":592.0,"147":593.0,"148":594.0,"149":595.0,"150":596.0,"151":597.0,"152":598.0,"153":599.0,"154":600.0,"155":603.0,"156":606.0,"157":607.0,"158":608.0,"159":609.0,"160":610.0},"Entry":{"0":"\n\n1915 January \n\n","1":"\n\nAt Meadi\n\n1915 ","2":" \n\nDance Tewfik Palace Hotel.- Helouan\n","3":"\n\nLeft 8 pm train for Luxor\n","4":"\n\nLuxor:- Karnak, Tombs of Queens\n\nMedinet Abou\n\nCollossi\n\nLuxor Hotel. \n","5":"\n\n5.45 train Luxor to Edfu. Edfu Temple.\n\n2.15 train to Assonan\n\nSaw dam\n\nGrand Hotel\n","6":"\n\nDonkey ride up Nile some 4 or 5 miles, to Philae in boat.11am to Luxor\n","7":"\n\nKarnak before bkfast to Tombs of Kings over mountain to other tombs.\n\nLuxor Hotel. Monstapha`s \n\nTrain to Cairo\n","8":"\n\nReported 10 am\n","9":"\n\nBde Ball at Helouan. £125\ncc\n","10":"\n\nMoved Bde to Heliopolis. Marched through the cemetery area of some miles, past the Citadel down Sharin Mahommet Ali, the Governorat, Warzor, Alakassin, S to Heliopolis.\n","11":"\n\nTo Meadi in evening and saw early arrivals of 5th,6th and 7th LH Regts and","12":" Bde.\n","13":"\n","14":" Bde scheme out to the Kanka sand drifts.\n","15":"\n\nLt Weir with reinforcements reports arrival at Abassia Reinf.camp.\n\nDinner continued met several new","16":" and Onslow. Dinner with R Horden and W Charlie. Dance at Mrs Devonshires.\n","17":"\n\nto town in afternoon for drive round Rhoda Island and past zoo.\n","18":"\n\nSaddled and left at 3 - for outpost line from hut in NE direction. Dug trenches till 12 midnight – returned camp 2.15 am.\n","19":" \n\nOut with NZ Mtd Rifle Bde and inspect the trenches N of old Suez railroad.\n","20":"\n\nDivisional scheme 7 am to Abbassia then to old Heliopolis and El Marg returning 6 pm.\n","21":" \n\nTo Barrage – where the main canals that feed the Delta branch from the Nile beautiful gardens with trolley rails and rides along all the principal walks.\n","22":"\n\nDivisional field firing to Abassia Barracks Manchester ASC officers mess in evening – at invitation of Capt Ison\n","23":"\n\nDinner at Continental with Capt Green and Major Glasgow. Mrs. S M Gandy and Miss Gordon Smith. Dancing afterwards at the Hotel. Met Hyman and Fuller for 1st time since their arrival.\n","24":"\n\nIn camp\n\n15 Mon\n\nCaught 7 am train with Bdr A Cols of 2nd and","25":" Rgts to Kantara examined the advcd post 1m out where fight was. To Tussum and Serapeum by boat; saw several Turks remains. Back to Temalia and returned camp 12 midnight.\n","26":" \n\nField off. Of day\n\nVisited Abassika Detention Barracks. 151 Aust and NZ soldiers in. Lts Weir and MacMillan joined with 51 reinforcements.\n","27":"\n\nCapt Ison came to mess afterwards went to Helipolis House – met Col Everett and Genl Douglas the E.Lancs Div`l Cmdr.\n","28":" brigade training. Outposts along Taufigia Canal from Obelisk to El Birka,\n","29":"\n\nDivisional training – attack on Inf FA and LH along Old Suez Road. Saw and killed 1st snake same colour as sand.\n","30":"\n\nBirthday\n\nCol down at S Canalso stayed in camp. Toasted H.M. in mess at night.\n","31":"\n\nIn camp’\n\nShort byc ride into Heliopolis in afternoon and broke chain.\n","32":"\n\nRegt. training on allotted area.\n\nLecture in evening by Gen Cunliffe Owen from front.\n","33":" The following days are a succession of Regimental training schemes and drills, varied by khamaseens, only few evenings off.\n","34":"\n\nGetting warmer but still a little cold in early morning.\n","35":"\n\nIn a Khamseen to Sakkira with Wal Cox, misses Claydon and Hedges. Car to San Giovanni. Ferries over the rivers. Donkeys to Marrick and train back to Cairo from Bedrasheen\n","36":"\n\nNose inspected by Dr Barratt (Major) at Heliopolis Hosp. x rays – very painful after for some days so do not ride.\n","37":"\n\nA Sqn go by road to Barrage to practise crossing rivers by means of ropes endless.\n","38":"\n\nWent by train to Barrage with Dr Fullerton. Had tea – and dinner at Mr Smith the chief engineer of the Barrage System\n\nA Sqn swam horses and B arrived per road.\n","39":"\n\nSaw B Sqn AHQ swim their horses\n\nGardens very full in afternoon had a quiet loaf about and took some snaps\n\nC Sqn arrived\n","40":"\n\nRode back with Clark, on Merrington`s horse, from Barrage – arrived 1.30 pm road all had cultivation as far as Shukra. Took photo of village St and sent home.\n\nThe big riot in the Wazh-el-Birka from 4.30 to 9.30 PM \n","41":"\n\nThe feast of Shem-el-Messim for the breathing of the zephyrs. Owing to a severe sandstorm or kamseen the Regt got 200 yds from camp and did not reach the cultivation along Gabal and Siraquis canals we were ordered to. I left camp 5 minutes after them and searched for 1½ hours then stayed with LHFA in cultivation. The Egyptians this day merry make in the fields and all is holiday.","42":" day of the turn of the seasons. Tents were filled with sand etc.\n","43":"\n\nKamsin stopped\n","44":"\n\nNew brown horse bad attack of sand colic.\n","45":"\n\nHorse had 3 injections of stigmine\n\nClarke and Gwillian up all night with him.\n","46":"\n\nHorse little better. Clarke up all night\n","47":"\n\nRoute march of the Bde through Heliopolis, Abassia, Railway Sq, cut off a corner along Boulac, to Kasr-el-Emi, Vieux Caire, Babs-el-Youn to Meadi, Dined with Geo Onslow. Boxing at","48":" Bde Stadium\n","49":"\n\nLeft Bivouac at Meadi about 7.30 am and rode to Helwan. March discipline much better. Native children fairly cheeky. Saw some of the Turk prisoners at Toura. Rode past San Giovanni up to Helouan. A bivouached behind the Tewfik Palace Hotel.\n","50":"\n\nThe Regiment crossed the two arms of the river Nile – and island between, on 3 punts towed by a launch, on the 1st or widest ea holding 25 horses. A by 2 punts on ropes on Bedrashin side. All went to Sakkara in between. Took from 8.30 am to 8.10 pm; no break.\n","51":"\n\n2nd Regiment do their crossing and the","52":" remain in Bivouac behind the Tewfik Palace Hotel. I ride to Sakkara with Regtl HQ and the drivers who did not cross before, very good concert in Hotel grounds in evening by the Bde. Mde Spunger played opera and the Italian consuls wife\n","53":"\n\nMessage to report to Board to sit on the damage done in the Wazir area of good Friday. So took the three horses and Gwillian and rode home from Helouan,had lunch with Col Cox at Meadi en route. This was the day of A and NZ landing. \n","54":"\n\nReported and found myself next senior to the President Lt Col Fallows T.D.\n\nGallipoli doings of others. The landing has achieved under very heavy fire, some of the earlier boats never reaching land at all. The navy mistook the landing place by half a mile N, the place they were going to being\n","55":"\n\nPractically impregnable. Directly they touched shore they jumped into water, some over their heads. As they touched the shore they fixed bayonets and drove Turks up and over the precipitous heights for about 4 m. Officers and men mixed. Men did not wait for orders but fought as seemed most natural in general line. Had to retire to position we found ourselves on arrival later as no support. Several thousand casualties.\n\nExamination of hills show an almost impossibility of advance. Kit and dead everywhere. Heroic stands for 2 or 3 days without water and food\n","56":"\n\nOn the board to assess damages for the Wazir riot. Lt Col Fallows TD leaves and I am appointed president.\n","57":"\n\nOn the Board. Held at Soldiers Club.\n\nWounded just beginning to arrive at Heliopolis.\n","58":"\n\nOn the Board.\n\nOrganizing hospitals all over Cairo, including Luna Park\n","59":"\n\nCol Meredith away for a holiday on the Nile !!\n\nVisited hosp to see Cl Edwards and Sgt Fizpatrick and others.\n","60":"\n\nOn the Board\n","61":"\n\nOn the Board\n","62":"\n\nBringing a portion of the Board work to a section completion in case we are to go\n","63":"\n\nWarned we be leaving about Sat night without horses so worked hard and finished 33 of the cases and wrote and signed reports. From 9am to 8pm without leaving the room.\n","64":"\n\nTold that I was to take the regiment and we were to leave Sat night. Short notice.\n","65":"\n\nLeft camp at 11.30 pm and marched with heavy packy to Helmieh entrained at 4.20 for Alexandria.\n\n9th. Issued with puttees and infty pants. Embarked on DEVANHA with 30 on the Kingstonian. Fine weather. \n","66":"\n\nO\/b the P and O SS Devanha are Col Chauvel and staff 1st and 2nd regts, several infantry details, wounded officers returning and various officers to replace etc. Also the carts and blankets of bns that had come in her originally. heard many details of the fight.\n","67":"\n\nAt sea – no other ships in sight. Passed some beautiful islands like Saros and Lemnos.\n","68":"\n\nAnchored at Helles point on Cape Hellas and watched the shelling. Passed within 1 mile from SS Scotia but could not raze G.Randell, moved up coast and anchored ANZAC Bay near Katta Tepe.\n","69":"\n\nLanded beginning 6am. Went on a destroyer about 400 of us. Then into lighters holding about 80 each. Dowling E S struck by shrapnel in the mouth . Waited an hour or two (1st and 2nd Regts.) and then marched to Monash valley and bivouacked. The bullets fling all night 6` above. Visited Quinns post and Popes post, awake all night\n","70":"\n\nAt 8 am visited Popes Post to relieve him – completed at 1.30 pm. Continuous firing over trenches night and day till 17-18th. Divided post into 3. Precipitous clayey shale with much to do to dig into proper cover. Up all night.\n","71":"\n\nFiring all day. HQ 2nd LH had suffered a great deal form bombs throwing. A at night arranged bayonet attack on Turkish trenches on Quinns extension. 70 lef and 46 were casualties. Major Graham K and most officers wounded. Failure to some extent. I had Regt up all night and moved them from L to R as reports came on telephone\n\nc\n","72":"\n\nEarly at midnight the noise became abso deafening every rifle poured rapid and bombs were thrown one pre 2 minutes on Q hill. Subsided at 5 am. Recommended Crisp for bravery in gully of Deadmans Hill. Donovan of Q. Up all night\n","73":"\n\nSame noise all day and night, a hand or head over the trenches immediately hit. Many escapes and clothing pierced. At night`1 Cpl and 4 men of 16 tried to rescue a machine gun the dead and scattered rifles and tools on Razorback or Deadman`s hill; did not get Smell from dead very trying. Kit littered all over the hills and valleys.\n","74":"\n\nI turned Regt out\n\nAbout 12.30 the enemy`s fright died down a little but an attack had been prepared for at 3.50 am with cries of Allah the whole A and NZ posts were rushed. We drove\n\n off some 50, killing many some in our trenches, our 1st hand to hand fight. Nichols arm hurt.\n\nThey tried in front of Quinn`s and Courtenays posts till 10am and gave up. Officially we are told they had 2000 dead and 5000 wd. Relieved during a heavy fire fight at 3 pm by","75":" LH. \n\nI am hit in the calf but by richochet only and cary on. \n\nToday killed 11, Wd 17 (taken away) \n\nLined inner defence trenches at night.\n","76":"\n\nAfter 6am went into bivouac in valley. Bullets lob in our dugouts and sound very dangerous. Casualties","77":" 2 killed 4 wounded. Armistice white flag by Turks. We lined trenches at night \n\n21 Friday\n\nWent to Anzac Cove for a swim – 1st bath since landing and 1st time boots and socks off. Casualties in valley 4 wounded.\n","78":"\n\nFairly quiet day. We landed and sent up 2 Japanese bombs howitzers. High general led on to our beach for armistice. Cas 1 killed and 2 wounded. Wrote a letter to M.V. no incidents. Turk dead piled in acres. Rained","79":" rain since leaving Str of Victoria\n","80":"\n\nFairly quiet day. No casualties from sniping a record – but the usual 1 or 2 sick sent back\n\n24 Mon\n\nArmistice from 7.30 am to 4.30pm for enemy to bury their dead. Each side buried those half way between ea others trenches.\n\nCounted 51 dead opp of post that C Sqd was at in various stages. Saw Germans Saw sev curios. Many of enemy \n","81":"\n\nWore our equipment. Few Australians and NZ all past recognition and removal.\n","82":"\n\nDown to Anzac Cove with Clark for the swim I have daily. Had b\n\nreakfast after coming out, on the beach. HMS Triumph blown up by a torpedo off the shore.\n","83":"\n\nOceassional stands to arms. Swim under bullet fire. Had 1 killed and 2 wounded by shots down Monash Valley.\n","84":" same as yesterday.\n\nWorking parties. Swim\n\n2 wounded today. Stood to arms from 4.30 pm to 2.30 am as Turks massing at left head of Monash Gully.\n","85":"\n\nSame. Road to beach very dangerous from machine gun fire and bullets.\n\nAbout 40 men hit by Turks marksmen while drawing stores from supply depot, before 10am.Weather warm \n\nI man of ours wounded.\n","86":"\n\nGot up at 3.10 am and at 3.30 heavy mine explosions and the Turks shelling bombing and machine guns; they rushed Quinns Hill and took trenches; reported L-Cpl Grimson`s took 12 prisoners himself and joined the trenches again after searching in them for Turks \n","87":"\n\nSome 60 of 10th ALH and some 30 or 2 NZ inf rushed out from Quinns to pull down the sandbag building in front and fill in the trench only 4 of 10 who were not casualties. Result more successful than not. No swim.\n","88":" and","89":"\n\nYesterday quieter. I placed C Sqd on Popes Post in right section.\n\nSwim in morning. Met Clarence Pyke.\n\n1 June Tuesday \n\nQuiet last night but we were to have made an attack on Quinns and Popes. Found 1 off 1 sgt 2 cpl and 24 men as picquet in NZ Valley. 4 wounded\n","90":"\n\nBrought A and B Sqdns to Popes and with C filled the two left sections, in 3 \n\nSqns. Quiet night.\n\n2 wounded. Lt Birch of","91":" killed.\n\n3 Thursday\n\nOn Popes.\n\nGenerally quiet. Lce Corpl Grimson in charge of the sniping posts. With 6 others \n","92":"\n\nOn Popes Hill\n","93":"\n\nOn Popes Hill\n\nL Cpl Grimson wounded. Lce Cpt Keyes put in charge.\n","94":"\n\nOn Popes Hill\n","95":"\n\nOn Popes hill\n\nLetter from Grandell\n","96":" \n\nOn Popes Hill. Went to see G. Randell on Sicilia. Had lunch. Found the Cpl – R Skone – a cousin. Very pleasant and clean on boat. Came back with Gen.Godley.\n","97":"\n\nRelieved at 9 am by 3rd Regt LH. Retired to Valley on West of Popes and organized bivouac areas etc. Water arrived from ships and is stored in tanks. No casualties in Monash Valley owing to enemy snipers marked by our own. No casualties. \n","98":"\n\nAt work on the road in our bivouac up the watercourse of the valley. About 10 to 15 feet wide.\n","99":"\n\nIn Valley bivouac\n","100":"\n\nIn valley bivouac. Penetrated gully up hill found a night outpost of the Turks – brought back some equipment curios.\n","101":"\n\nIn valley bivouac.\n\nPadre Merrington and also padre Green held communion services opposite Regt Hdqu dugout. Latter was the 1st had seen here – about 43 communicants.\n","102":"\n\nIn valley bivouac\n\n15 Tuesday\n\nIn valley bivouac\n\nJune 1915\n\n16 Wed\n\nIn valley bivouac.\n\nCapt Lawries – A Sqn went on to right of Popes Hill in lieu of a squ of 2nd LH. While 2nd relieved 3rd LH.\n\nSS Sicilin left Anzac. Shelling beach.\n","103":"\n\nIn valley bivouac.\n\nShelling beach again some swimmers being nearly caught.\n","104":"\n\nWrote to G.S. for supplies from Cairo – sent PT 200and list of tobacco etc. and food.\n\nL.C.Bland hit.\n","105":"\n\nIn valley bivouac.\n","106":"\n\nIn valley bivouac\n","107":"\n\nIn valley bivouac\n","108":"\n\nIn valley bivouac\n","109":"\n\nRegt goes to Popes .Quiet in front\n","110":"\n\nOn Popes.\n\nNo attacks of consequence.\n\nSgt Barry hit.\n","111":"\n\nOn Popes\n\n2 wounded\n","112":"\n\nOn Popes. 1 wd.\n","113":"\n\nOn Popes\n\n1 wd.\n","114":"\n\nOn Popes\n","115":"\n\nBourke and Monaghan killed. Turks rushed down gully after reverse on Walkers Top – about 200 – 250 of them. Broadbent carried 1 gun to left and we drove them back easily with many casualties about 10.30 Pm on.\n\n4 wounded. Nash of","116":" regt K.\n","117":" and","118":"\n\nTo hospital ship Sicilia due to indig, dysty, and general weakness.\n\nRegt took up bivouac at Section H.Q. Monash Valley.\n\n1 July Thursday\n\nOn Sicilia.\n","119":"\n\nOn Sicilia. The wind made the beach landing too dangerous and the bringing of wounded on to Sicilia too difficult. She was to go to Lemnos, but they could not land me nor transfer me to the Neuralia.\n","120":"\n\nArrival Lemnos 40 miles away. Huge Brit and Fr navies in . After midday moved into the port and was landed at 5.30 pm.to No 1 Hosp, No food till 10 to 10 pm. Lt Green of Inniskilling Fusiliers ,Ealing London\n","121":"\n\nWalked with Capt Williams and Lane out to a Greek village 2½ m. out. Villages and houses poor. Lunched on hopbeer sardines and bread. At 3.30 went on b Arragon and later on to Prince Abbas with 4 others for Anzac\n","122":"\n\nAt 11am getting in to Lock Esk from Pr. Abbas an enemy submarine appeared about 5o yds off and the two boats parted hurriedly – Major Rutledge having Knox`s box – went to Imbros and lost it there – I went to till 4.30 when got on Lock Esk again – ashore 11.30 pm and thence to bivouac.\n","123":"\n\nAt 5 am went to beach – rung up for Rutledges batman and he came and took charge of his goods.\n","124":"\n\nMajor Rutledge returned but had to leave Max`s box on Prince Abbas.\n\nB Sqn went into Popes Post.\n","125":"\n\nIn bivouac at 3rd Setn HQ\n","126":" wd.\n","127":"\n\nIn bivouac.","128":" Sct HQ\n","129":"\n\nDitto\n\nCas Thomlinson killed going for the mail on beach.\n","130":"\n\nLt Edmonds with 123 others (8 old and 118 reinforcements) arrived\n","131":"\n\nPopes Post\n\nTodays state 50 officers and 417 other ranks to which add Padre, M.O., and 3 AAMC\n","132":"\n\nPopes Post shelled\n\n3 wounded on Post\n","133":" wounded on Beach.\n\nANZ MO attached vice Wells\n","134":" \n\nCapt Fraselin arrived and NZ dr went\n\nApplication for temporary Lt Col returned not granted. Col Meredith still in command and can be brought here at a moments notice. \n","135":"\n\nCame down off Popes went into Bivouac in gully\n\nPreparing defence of gully\n","136":"\n\nArranged C Squ on Hill Station – A Sqn in gully and Tinsons post and B Sqn in reserve.\n","137":"\n\nLast days of Ramadan – expecting attack of Turks.\n","138":"\n\nWent on destroyer Colne with Col Stoddart and 2 NZ officers to view the coast towards Suvla Point – ES Sutton and Sgt Gregory and 1 or 2 others wounded swimming\n","139":"\n\nA chill from being out at sea yesterday\n","140":"\n\nInfluenza or fever. Handed regiment over to Capt Laurie as could not leave dugout\n","141":"\n\nCarried down to beach and put on board Hosp ship REWA\n","142":" \n\nREWA\n\nGen Birdwood in \/bd got him to assist that I be transferred to next ship instead of being taken away. Rewa fever\n","143":"\n\nMoved 0\/bd Gloucester Castle and anchored still off Anzac\n\nCol Rowell came 0\/b\n","144":"\n\nGloucester Castle – fever\n","145":"\n\nGloucester Castle\n","146":"\n\nTransferred to Sicilia, from the G Castle which went to Alex.\n","147":"\n\nNot well enough to get up but had wanted to get ashore for impending advance\n","148":"\n\nSicilia\n\nDuring night English troops landed at Suvla Burnu and there was severe fighting all day. Saw our troops on part of 971 west side.\n","149":"\n\nSpent last night Imbros. Back to Anzac. Thence to Mudros\n","150":"\n\nAt Mudros\n","151":"\n\nLeft Muidros for Alex\n","152":"\n\nAt sea\n","153":"\n\nArrived Alex midday. Left by Hospital train for Cairo 8 pm got there at 12 midnight.\n","154":"\n\nAt No 2 Austr Gen Hosp, Gezireh\n","155":"\n\nGeof came in. Also Col M\n","156":"\n\nGot up and went to see Capt Hore. \n","157":"\n\nDrive round Gezireh with Wootten\n","158":"\n\nTown had lunch with Col M and saw several friends.\n","159":"\n\nLunch at La Toscana with Geoff.\n","160":"\n\nTo Helmieh and saw Col M and reinforcements 50 leave for Anzac. 12th Regt and Geof F Weir in hospital.\n\nMrs.Gandy and Miss Nunn called.\n\n"}}