{"Document Name":{"0":"Diary_0485","1":"Diary_0485","2":"Diary_0485","3":"Diary_0485","4":"Diary_0485","5":"Diary_0485","6":"Diary_0485","7":"Diary_0485","8":"Diary_0485","9":"Diary_0485","10":"Diary_0485","11":"Diary_0485","12":"Diary_0485","13":"Diary_0485","14":"Diary_0485","15":"Diary_0485","16":"Diary_0485","17":"Diary_0485","18":"Diary_0485","19":"Diary_0485","20":"Diary_0485","21":"Diary_0485","22":"Diary_0485","23":"Diary_0485","24":"Diary_0485","25":"Diary_0485","26":"Diary_0485","27":"Diary_0485","28":"Diary_0485","29":"Diary_0485","30":"Diary_0485","31":"Diary_0485","32":"Diary_0485","33":"Diary_0485","34":"Diary_0485","35":"Diary_0485","36":"Diary_0485","37":"Diary_0485","38":"Diary_0485","39":"Diary_0485","40":"Diary_0485","41":"Diary_0485","42":"Diary_0485","43":"Diary_0485","44":"Diary_0485","45":"Diary_0485","46":"Diary_0485","47":"Diary_0485","48":"Diary_0485","49":"Diary_0485","50":"Diary_0485","51":"Diary_0485","52":"Diary_0485","53":"Diary_0485","54":"Diary_0485","55":"Diary_0485","56":"Diary_0485","57":"Diary_0485","58":"Diary_0485","59":"Diary_0485","60":"Diary_0485","61":"Diary_0485","62":"Diary_0485","63":"Diary_0485","64":"Diary_0485","65":"Diary_0485","66":"Diary_0485","67":"Diary_0485","68":"Diary_0485","69":"Diary_0485","70":"Diary_0485","71":"Diary_0485","72":"Diary_0485","73":"Diary_0485","74":"Diary_0485","75":"Diary_0485","76":"Diary_0485","77":"Diary_0485","78":"Diary_0485","79":"Diary_0485","80":"Diary_0485","81":"Diary_0485","82":"Diary_0485","83":"Diary_0485","84":"Diary_0485","85":"Diary_0485","86":"Diary_0485","87":"Diary_0485","88":"Diary_0485","89":"Diary_0485","90":"Diary_0485","91":"Diary_0485","92":"Diary_0485","93":"Diary_0485","94":"Diary_0485","95":"Diary_0485","96":"Diary_0485","97":"Diary_0485","98":"Diary_0485","99":"Diary_0485","100":"Diary_0485","101":"Diary_0485","102":"Diary_0485"},"Date":{"0":"unknown","1":1003.0,"2":1004.0,"3":1005.0,"4":1006.0,"5":1007.0,"6":1008.0,"7":1009.0,"8":1010.0,"9":1011.0,"10":1012.0,"11":1013.0,"12":1014.0,"13":1015.0,"14":1016.0,"15":1017.0,"16":1018.0,"17":1019.0,"18":1020.0,"19":1021.0,"20":1022.0,"21":1023.0,"22":1024.0,"23":1025.0,"24":1026.0,"25":1027.0,"26":1028.0,"27":1029.0,"28":1030.0,"29":1031.0,"30":1032.0,"31":1033.0,"32":1034.0,"33":1035.0,"34":1036.0,"35":1037.0,"36":1038.0,"37":1039.0,"38":1040.0,"39":1041.0,"40":1042.0,"41":1043.0,"42":1044.0,"43":1045.0,"44":1046.0,"45":1047.0,"46":1048.0,"47":1049.0,"48":1050.0,"49":1051.0,"50":1052.0,"51":1053.0,"52":1054.0,"53":1055.0,"54":1056.0,"55":1057.0,"56":1058.0,"57":1059.0,"58":1060.0,"59":1061.0,"60":1062.0,"61":1063.0,"62":1064.0,"63":1065.0,"64":1066.0,"65":1067.0,"66":1068.0,"67":1069.0,"68":1070.0,"69":1071.0,"70":1072.0,"71":1073.0,"72":1074.0,"73":1075.0,"74":1076.0,"75":1077.0,"76":1078.0,"77":1079.0,"78":1080.0,"79":1081.0,"80":1082.0,"81":1083.0,"82":1084.0,"83":1085.0,"84":1086.0,"85":1087.0,"86":1088.0,"87":1089.0,"88":1090.0,"89":1091.0,"90":1092.0,"91":1093.0,"92":1094.0,"93":1095.0,"94":1096.0,"95":1097.0,"96":1098.0,"97":1099.0,"98":1100.0,"99":1101.0,"100":1102.0,"101":1103.0,"102":1104.0},"Entry":{"0":"\n\n","1":" After breakfast went down to Piccadilly by tube and from there on to St James Palace and watched the ceremony of guard mounting carried out. Great deal of frill but I am still satisfied my battalion could turn out smarter men at drill and rifle work – but then we cannot compare the pre-war Guards with the men in them now. Lunched back at hotel and then went to the Scala theatre to see the Somme pictures most of which was \"tripe\" but one reel got fairly close to fact when it showed the dead lying about. Went up Fleet Street and had dinner of pigeon pie, toasted cheese and a pint of bitter at \"Ye Olde Cheshire Cheese\" and came away feeling very full. Old fashioned waiters like old John Bulls. Little benches, oak partitions, and candles for light. The down the Strand through Leicester Square dodging the joy girls and to Her Majesty’s and saw \"Chin chin choir\". They don’t play the National Anthem at the end of the show. The stone used in the buildings of importance here has the peculiar property of going white with age. Westminster Abbey is a dark dull building but portions have gone quite white & and appear snow covered. This is more marked in the case of St Pauls where the whiteness shows up very strongly against the dark portions. Standing in Fleet St. one gets a splendid view of the old cathedral dominating the whole street and showing hazily through smoke and mist. Hoare and Co’s bank is a dingy venerable place. Passed Downing St again and saw the poky residences of the Premier & Treasurer. Called at L\/O for letters. Plenty of beadles & so on around Threadneedle Street and clerks wearing ordinary sac suits & bell toppers. The Exchange is going white too. Its text above the entrance seems out of place \"The Earth is the Lord’s & the fullness thereof\". \n\nLondon & Ludgershall\n","2":" Attended the mounting of the guard at St James and did some shopping thereafter returning to hotel for lunch. Took taxi to Waterloo Station getting a fine view of the city from the bridge. Left at 1pm for Ludgershall (Perim Downs Wiltshire) travelling down with Davis and others. Reported at Camp and allotted a good room in a hut.\n","3":" Still here on Perim Downs – a fine but very cold day with a piercing wind. Winter here must be awful. Walked into Ludgershall a couple of times and poked around camp bored to extinction and imbibed whisky and sodas. Disgusting to see the cold footers hanging round here swanking it over everyone. Men who have been sent here from their regiments for acts of cowardice and unfitness for command instead of being branded as such and put in a special camp and stripped of uniform are allowed to hang round on training jobs posing as Lords of Creation.\n","4":" Received orders before lunch to report to Rollestone to join a draft for France and the Commandant lent Major Currie and I his motorcar. We had a very pleasant spin over the chalky plain now so thickly populated with military and pulled into camp & received orders to take 960 men over to France with us leaving here at 2.30 am. Having duly dumped them at the \"Bullring\" at Etaples we hope to get a clear run right through to Ypres. Very good mess dinner tonight –wine cigars and full menu and the staff capt. said their exceptional mess man runs it on 2\/- per diem. An English major at dinner relating at great length to an M.O on his unfitness owing to shell shock some time ago but shrewdly pumping the doctor to find out the reasons for tapping knee re for reflex; and so on with other questions really I fancy just to find out how to outmanoeuvre doctors on his re-examination. Casually picking up a paper in the mess, Currie found he had been awarded the D.S.O. the first he had heard of it.\n\nFolkestone – Boulogne\n","5":" Roused at 1.45 am and after a bowl of cocoa and some bacon fell in the draft and took over 230 of them. In the dark the Band led off with them and we marched 5 miles through winding sweetsmelling Wiltshire lanes and meadows until we reached Amesbery where embarkation took place or rather entrainment. We reached Folkstone about noon and the men were at once taken out of our hands by a staff and housed in a big terrace facing the water. The officers adjourned to a hotel close by and lunched, shaved and washed. The coast of France was quite plainly visible from here. The town is a busy one and plenty of girls seem to be about. Our men seem to have all the vices. They drink heavily – the air in the ranks on the march down was that of a malt house. They gamble, the chief pastime in the billets in France. They whore – but this is the least of their failings now Cairo has been left behind. The conduct is uproarious and full of boisterous good spirits. Immediately on getting inside the 3 storied place here men must needs sit on window sills high above the ground and \"chip\" passers by. In private life they would not dream of such boisterous conduct but the uniform encourages their spirit. These observations are a comparison – taking the British tommy as the standard. Fell in at 1.40 and marched on to a boat with about 1000 others aboard and sailed for Boulogne escorted by torpedo boat destroyers. One of our shark shaped airships was manoeuvring over the water The motion of the boat creating a feeling of nausea I slept for the two hour journey. We made Boulogne about 5 and a staff of NCOs took complete charge while the officers had afternoon tea. On coming out everything was ready for the march off but the men had started straying and altogether showed marked indiscipline a great contrast to the trained veterans of the old regiments. We climbed a devilish steep winding street up to a camp where a staff again took control and tonight we sleep in tents for the first time since leaving Egypt. Boulogne harbour is not very large and there \n\nBoulogne\n\n16\/9\/16 appear to be a lot of sailing vessels in port. The town has the usual dingy appearance of the middle class French town. The old port is full of twisty streets – the new has many hotels. There is a statue of Napoleon to commemorate his invasion of England! Tea at the railway station was of the usual railway station style both in price and quality. It seems strange to find ourselves back among French surroundings so different to England. Some women beautifully dressed and lovely in appearance. The stinks of the town in places remind one vividly of Cairo for the Frenchman does not abhor a stench, he rather considers it in the light of a necessary of life. At the camp there are big wireless aerials. We had dinner in the Salvation army place where there is a special mess for officers.\n","6":" Slept in warmth until 7.30 and after breakfast the whole were medically inspected on chest and arms for spots. Moved off at 2pm and marched down to the station and embarked in cattle trucks for Etaples. The men marched fairly well through the town. Dinginess and absence of paint struck one and the pretty women were also very nice. Old cobbled streets and verandaless buildings and a dirty foreign look overall. Our train was a very long one carrying 1700 troops and slowly puffed down to Etaples. We marched a short distance to a camp drawing rifles en route and then had dinner while the sergeants fixed up the bedding down & feeding of the men. After dinner messed round & got valise and put down an indefinite number of whiskey & sodas. Saw quite a lot of Bde. men here. Slept in a new hut which has been erected as a sergeants mess and made a good bed with blankets and my valise. The officers mess in this camp is quite a home and very well fitted up and furnished. Today was Sunday \n\nEtaples\n","7":" Day was ushered in with heavy squalls & rain continued until well into the afternoon. After lunch went down to an Ordnance store and bought a waterproof overcoat. This store was quite the most businesslike place I have ever seen in connection with Ordnance and it would be a boon if they had similar places close up to the firing line. Rain cleared up later in the afternoon. The village of Etaples lies in a hollow and is a grey stone & red roofed old place apparently a fishing place. Formal mess in the evening. Kings health, band, and so on and feeling in a conversational mood yarned with some new officers who had not seen active service and regaled them with war experiences and tales of old battles fought and lost until after 10 o’clock.\n","8":" Awakened by Adjutant at 7.10 and told to take charge of a parade for the Bull ring at 7.40 which left no time for washing or shaving. A major handed me over the command of the parade and I took charge of the whole show 1479 men and only had one subaltern. Marched the whole crowd off about 2 ½ miles to the Bull Ring where instructors took charge of all the men and gave them excellent training. With some other officers I went over the mechanism of the Lewis gun and then we did some firing with it until 12.30 when the parade formed up again & and marched home. Owing to lack of officers the marching and discipline on the mass parade is extremely slack but in the Bull Ring there is no nonsense as there are plenty of old sergeant instructors who run the whole show. It is a memorable sight to see so many thousands of troops English and Dominion working intensely. A train load of Huns went through during the morning. After lunch it rained and was very cold. I had a cold bath and clean up shave and spent a slow evening in the mess. Turned in early and slept until about 3 am when some new arrivals came in and woke me up. \n\nEtaples\n","9":" Stayed in bunk until late and after breakfast hung round in the mess \"bored stiff\". During morning received orders to be ready to leave for the trenches at 3 am tomorrow morning. After lunch drew new clothes and equipment from the Quartermaster without any of the usual vexatious hesitation and red tape that as a rule accompanies any ordnance transactions and idled round all the afternoon. Went to bed about 10 arranging to be called by the corporal of the guard at 2.45 am. Various homeless officers blew in during the night drifting in and out again in search of somewhere to sleep.\n","10":" Wakened by guard at 2.45 and after a wash had some breakfast in the mess. During the cold candle lit repast Elmige and Davis strolled in. Still dark when I took over draft of 336 men with only one other officer and marched them to the station. Arrived there our trouble commenced and there was a rush on the office of the RSO to get the necessary papers in which I came off second best in a verbal interchange with an Imperial Major. Found the train waiting and then ensued a nightmare of an entrainment. Insufficient accomodation ill trained men, and bungling and finally 100 men were left standing on the platform and every coach was apparently full. The RSO was by turns roaring raving & entreating & we packed the men in on top of others and eventually the train started off leaving a little bunch of others & myself standing on the platform. I swung on a footboard and the others did the same. A cold dark journey to Boulogne with its Napoleon looking out towards England and then to Calais coasting the sea. The country now became waterlogged and marshy and a sampan shaped boat appeared part of each household. St Omer with its ancient ruined abbey was passed and we struck through pleasant country to Hazebrouck. Dropped some of the men at intermediate stations and crossed the border into Belgium , the only view of the crossing being a station with Douane on it.\n\nPoperinge\n\n21\/9\/16 Ran over a motor lorry and blocked the line and disentrained and marched to the station. Guide conducted us to Bde. HQ where General Gellibrand asked me to stay and we had a pleasant dinner & so to bed. The country hereabouts is exceedingly flat far more so than the north of France and is canalised. The chief landmark is the hill of Cassell near Fleete some miles to the South. On top of this hill is a large monastery and we marched round the other side of this place on our way to the first Battle of the Somme. Now at Ypres this hill is still our chief landmark. The land has a slightly rank sodden appearance and is well cultivated by those peasants who remain in the locality. The poplar and the elm appear in planted regularity and the pollard willow appears to be peculiar to these wet low countries.\n","11":" An exquisite sunny day. A Taube flew over after breakfast and was treated to a good shelling. Our planes were active. The boom of a big gun occurs occasionally and something fairly large went hurtling over our heads into Poperinghe. The camp here is pitched on extremely low ground, most of which is boggy clay. The men are housed in huts. The roads are muddy and much cut up and transport is continually passing. The reports of shells and lighter artillery reaches from in front and also the rattle of machine guns. The General left for Paris this morning on 10 days permission and it seems as if they are keeping me here until my promotion comes out. The weather is getting much colder and the days shortening as Autumn comes to us. In a look round one sees a thinning of the foliage as the trees recommence the process of getting under bare poles. Our observation baloons remained up until quite late a cold job for the observers. An artillery rally took place about 7. Yarned after mess with the Bde. Major and Staff Captain. The peasants hereabout are rude and uncivilised kinds wearing rough moleskin clothes. They appear dirty in person. Flares at night define this Ypres salient very clearly.\n\nPoperinge\n","12":" Belgium looks very well this morning for, after a cold night, a warm sun is shining and entices one to bask in it. Early there was a good artillery rally in front of us and the guns seemed to keep up a rumble all the morning. During the night some Zepps sailed across going West and our searchlights and aeroplanes were active. The women remaining here are by now thoroughly coarsened by soldiers and freely indulge in filthy epithets in their conversations with men. There is no open vice though and possibly despite their careless speech, their morals remain good. Stayed in Brigade camp all day and after lunch went to sleep until awakened by Padre Devenford whom it was a pleasure to see again. He poured out all his troubles and received some good advice in return for he is a fine little chap. All day one of our ‘planes has been in the air but the line appears to have been quiet. The roads here in wet weather will be just about impassable for vehicles. The country is so low lying that the occasional sluggish canals surely cannot drain the land. Davis and Elmiger walked in at mess in the evening and we had a good pitch in the evening.\n\n24\/9\/16 Slept in late and after breakfast set out to find our transport lines to arrange for a horse up to the trenches tonight. Walked over open fields and cultivated places – all clayey and promising of plenty mud in due course. Bare top poles standing up and bunches of beans or some other plant seem to be drying outside each house. Found Mills and some of the other old heads and then went over to the transport lines for a cup of tea. An old French interpreter was there packing up and was a great character. Stayed yarning until 12 and then went round the roads in a 1st Divn motor car reaching BHQ for lunch. Slept all the afternoon and had an early tea and rode through Ypres to Battalion Headquarters. The road is a good cobbled one and passes through many a hamlet quite wiped off the earth by shells.\n\nYpres\n","13":" Entering the historic city of Ypres was one felt another of the many strange experiences passed through since leaving Australia. One cannot but feel affected passing for the first time through a place where so many brave men have fought and died. The convent shell–riddled, is the first large building passed and after that one rides through a large city full of debris and wreckage, a place where not one house remainswhich is not damaged and devastated. Walls full of gaping holes; glassless windows and tottering ruins met the eye everywhere. A sense of desolation that is a very monument to the awfulness of modern warfare. The old cloth hall is wrecked and the winding streets lead round it to the market square which is a wilderness. Fine buildings lie in ruins all round, civil life is entirely absent and the city is a place of silence and darkness the only light being that from a candle or two in dugouts and the only sound the rumble of transport wagons and the footsteps of stray soldiers wandering along in the gloom. A more utterly destroyed place it is impossible to imagine. It can never be rebuilt after the war its commerce will probably pass to some neighbouring town that has escaped comparatively unscathed. Leaving the town we pass the gaol and then reach open country once more. The town is walled but we could not see them owing to the darkness. Fatigues of trudging men carried engineers stores and the reflection of flares and the rattle of gunshots let us know of the close proximity of the firing line. Found Battn. HQ in an old cellar under a ruined building and saw the CO & others. A small stunt was on. 8 of our chaps were lying out in No Mans Land waiting to kill a German patrol which every night by the same route. We waited quietly at HQ for news of the success of the plans, so calmly do we deliberately in war plot the death of our fellow beings! Suffering tonight from a heavy cold, streaming eyes and all the other inviting accompaniments. Intercepted some letters for me at the Post Office.\n\nYpres Salient – between Menin Road & Sanctuary Wood\n","14":" Snatched 3 hours sleep and at 3 am rose & prepared the Intelligence Report and at 4 left with the C.O. for the firing line, being led by a runner. It was a raw dark morning and we went across open paddocks to the left of the position and without the guide would most certainly have been lost. The glare of flares all round us and the rattle of m.g. fire disclosed the position of the trenches. Owing to gaps in the trenches it is quite easy to walk out by the high road into No Mans Land. Getting into the trenches roused Main and then walked along finding the men standing to arms and slipping and sliding all over the place on the greasy duckboards. At places the trenches fall away to breastworks but danger is minimised by the distance across No Mans Land. Reaching Sanctuary Wood we found it to be a place of the dead and reeking with the stench of corpses. Shells have smashed every tree and the stumps stand up bare and gaunt like telegraph poles. The earth through the wood is a shell pitted waste. Dawn was breaking as we again made back for BHQ and dived into our brick kiln home and had breakfast. Down below in this tunnel day does not differ from night and candles are going all the time. Slept until 3 pm in the afternoon and then had dinner. Blinking from the darkness the dazzling warm sunlight of late afternoon seemed strange. Went over to \"C\" Coy and hard a yarn with the remainder of the old hands there. My dugout here is of the German type, reached by stairs and is shared with the Colonel. It is a dripping wet place and the water for washing is drawn from the floor under our beds. The trickle of water continues all night. Close behind us is a large ornamental lake. A quiet evening nothing doing. \n\nYpres Salient \n","15":" Slept in the deep water sodden and dripping dugout and it did my heavy cold no good. Got up at 3 am. and and summarised the intelligence reports and then stayed at the telephone while the CO. went round the line. Breakfast at 7 and then back to dugout , to warm which the batmen had put in a huge brazier. It warmed the air in layers. The top portion was hot and steamy but the lower was cold and dank with the chill of a vault. In pyjamas slept until 2pm and then came out to the warm sun of afternoon. Dined at 3 and stayed in the headquarters (the subterranean blackened oven of a brick kiln) lit by candles and a carbide lamp day and night. At 4 pm. we put over a lot of shells and trench mortar bombs to Fritz on our right front and he responded with a few odd ones. Later he put about 6 shells close round here but hit no one. Tried new records on our phonograph before tea which we partook of at 8 p.m. Read and yarned all the evening. Quiet except for the rattle of machine guns and the glare of flares. Turned in at 10pm. \n","16":" Up at 3 am for intelligence purposes and stood by the phone while C.O. went round stand to arms. Wretched creeping out of bed and sitting round in the old brick kiln! Back to bed about 8 am and stayed there until 2p.m. and then had lunch. About 4 there was some of rifle fire continuing for some time on the English front. The artillery was active on both sides and the Germans put some shells very close round us here 4.5 stuff – too close to be nice. A fine afternoon but some rain fell earlier in the day. Feeling much better today and able to take an interest in things but feel disinclined to do overmuch until promotion takes place. Making tea and preparing meals at varying hours, the batmen are kept busy. about 9.30 brought in the papers. Not the slightest movement during day here as the Huns have all the higher ground.\n\nYpres\n","17":" Called at 3am and prepared Intelligence Report and read until 7.30. Dressed and got ready to go on into Ypres and see Jack. Left our Battn HQ at 10.30 with RSM Porter and crossed by duckboard tracks until the ruined city came in sight. It is a walled town compactly built inside a large thick wall outside which is a moat. Entrance under the wall is by means of a tunnel & you then find yourself in a street of ruins which leads to the centre of the city. Not one house remains whole and rugged skeletons of brick are all that stand. The large market square is reached and one can stand there and let the scene of devastation sink in. On the four sides of the square where were formerly hotels, shops and houses remain nothing but debris. The old cloth hall is a majestic ruin of what must have once been a triumph of architecture. The statues with which its front was adorned now lie in fragments on the ground and those that have not fallen from their niches are defaced. I met Jack at the HQ and we walked round through the cloth hall to the shell of the Cathedral. We sat down there on the fallen pillars and shattered columns and yarned. The headquarters is in a ruined hospital – a fine old building that is well \"dinged\". The lower portion well sandbagged up is habitable to a limited extent. Great fissures are in the walls and the fine entrance hall is blown to bits and most of it mural tablets are destroyed. Met Fovode here and had lunch and dinner with Colonel Brazenor. Guns bark from among the ruined houses and the Hun was furiously blazing at some of our aeroplanes circling overhead. Ypres represents the neck of a battle which widens out in the Salient. Crammed close together within its walls this must have been a fine compact city of comfortable dwellings and prosperous business places. Now not one is whole. Relief was completed in good order and all hands were into these billets by midnight. During the night the 8th did a raid on their front.\n\nYpres\n","18":" Dull and cold and miserable in these shattered ruined billets. What it is like in very bad weather I cannot imagine. The ceilings all falling in and the floors wet with rain and walls damp and mildewed – absolutely cheerless. There are guns close round us and their sudden barking is a shock to the nerves. During the morning the Hun put some shells in close round here and I found that my nerve is not the steady imperturbable thing of the past but that the once unheeded swish of an approaching shell now makes my bowels turn to water and my knees quiver. James is our MO vice Craig. C.O. Crowther & Stewart all away and I am in charge. All the men are asleep in cellars underground getting some rest before tonight’s fatigue. Arranged for the baths. There are three baths and they are kept going all day so the whole battalion can be bathed in two days. This building was the hospital and its decorations appear to have been of a rather tawdry character plenty of gold paint, cardboard moulding and indifferent statues mostly of a religious nature. The enemy trenches are only two miles away – this salient is a mistake without doubt. \n","19":" Left at 8.30 am on horseback for Bde. HQ and passed through a small village on the road which is as badly \"dinged\" as Ypres. Noticed the names of streets up in two languages – French and Dutch. Reached Bde H.Q and found that the prisoner we were to courtmartial had been sent to hospital so we rode home again. Passing the Cathedral on riding up to our billet we were struck with the huge blocks of stone that have been blown up whole by shell fire. Coming across the square a shrapnel shell burst directly overhead but fortunately missed us. Spent the afternoon and evening writing. After dark the enemy commenced sending odd shells over into the town and we replied with a strenuous bombardment of dozens of guns that rocked the old town. After we eased he still continued to send some over. This hospital (Notre Dame) bears date 1680 but the front portion is far later in date than that. The men are all on fatigue at night and the junior officers accompany them. They trudge off cheerfully. \n\nYpres\n","20":" During the evening the enemy’s \"minnies\" became a shade too active in the front line and our guns commenced to plaster them and kept up a heavy bombardment till late in the night, shaking these crazy ruins with their reports and filling the air with acrid smoke.\n","21":" Woke up and commenced strafing my batman Hunt who commenced today for not being in on time and found that the clocks had been put back an hour on account of the change from summer to winter time. Went into the status and promotion of NCOs with the Colonel during the morning and took control of the mess at headquarters. After lunch attended church parade about 30 in the ruined chapel in front of the building. A very tawdry place this has been gilded columns of wood! Lath and plaster ceilings and gaudy woodwork and gold paint. Blown about and splintered with shells it shows up in all its false finery. A dull quiet afternoon with planes up and \"archies\" coughing at them. About 4 the enemy commenced putting over \"77 pip squeaks\" and 4.5 inch shells. These came very close and many burst on the square just outside. Some landed in the ruined cloth hall and further damaged the tower and front façade wreckage. At dusk when the bombardment had ceased I went round to the Belgian barracks for a bath. A fine building whose strong walls have made a good resistance to the German artillery but which is well ruined nevertheless. The baths were rather crude but the hot water quite removed the grime of our last stay in the trenches. Spent the evening writing and turned in at about 10 pm. A quiet night.\n\nYpres","22":" During the morning all temporary NCOs were paraded for inspection by the C.O. and we went into the matter of permanent promotions. In peace soldiering and at first in our AIF we used to choose our non.coms. almost entirely on a smart personal appearance but now we dont pay much attention to that but rather favour the \"dags\". Give me \"dag\" for any job that wants doing. A wet cold day we did not stir outside once. This hanging round in dugouts and billets where we are continually under hostile observation makes us soft. It will be a relief to get back once more to our hut camp at Erie.\n","23":" Wet and cold. The Germans kept as quiet as we did and the only event here during the day was the arrival of 5 cases of backsheese for the men. Read all day and yarned with Dr James.\n","24":" Left early on horseback for 24th headquarters and sat on a courtmartial with Colonel Fitzgerald and . Dealt with two cases, one forgery the other disciplinary. Returned during the afternoon. Wet and sloppy. Great activity is always behind the firing line. Camps full of troops in huts, sawmills at work, transport lines, horses wagons mules motor transport and a thousand and one odds and ends.. Each time one rides through the town here it is with fresh wonderment at the devastation and the completeness of the ruins. After changing to the Belgian barracks for a bath in three or four tin dishes of very hot dubious water in an enamel bath and then changed completely into clean clothes , ready to go into trenches again. Scheme now on foot for supply daily of clean socks. One pair on the man, one on , one for the handwashing.\n\nYpres","25":" New reinforcements arrived and paraded for inspection at 11 am. Loafed round and supervised cleaning up during day. At 6 pm CO. and staff shifted to firing line and I left at 8 with an orderly. All of our gear in charge of batmen went on with the transport. Our route lay along a road thronged with troops in small parties and small detachments of transport. Behind lay the shattered sombre ruins of Ypres, in front a low lying flat dark region with ruined houses. Even the trees are broken about by gunfire. The light of flares lent a fitful illumination to the scene. They showed the great salient here appearing in front on both flanks and almost behind one. The flares seemed of a different kind to the old variety and hung suspended in the air for a long time, perhaps parachuted. Reached Battn. HQ in the ruins and settled down to an all night vigil without any sleep at all. Gas alarm on right.\n","26":" Remained up all night. Orderly from \"C\" Co got lost coming from firing line and was found wandering about by Grieg. Very easy to mistake directions particularly if wet as there are no landmarks, and it is a simple matter to wander out past our own lines into ‘No Mans Land’ and stumble into a German trench. Went to bed at 8 am and stayed there until 2 pm. During remainder of day things were very quiet and stayed so until evening when mail and rations arrived. Some rattling of machine guns and bombing on the flanks but all quiet on our immediate front. Retired to bed again at 8 pm but did not sleep well until late. Artillery liason officer with us and Dooley arrived with the QM.\n","27":" Called at 3 am and put on thigh boots. Found C.O had to see General so took over the inspection of the front line, slipping and sliding in the mud and slush using a long staff to preserve balance. Flares continuous &\n\n7\/10\/16 some appear to be fired from No Mans Land. Went right along the line past muffled sentries and sleeping men. Many of them sitting up wrapped in greatcoats with heads bowed on chests. A hard life. The engineering work done was unsatisfactory in centre coy., and on the left the material failed to reach its destination. The difficulties of getting heavy material over muddy wet ground in the dark are great and stuff gets taken to the wrong place and so on. Sanctuary Wood is well knocked about and so are all the trenches on that flank. No Mans Land is a desolation of mud churned up earth , gaunt broken trees and shell holes full of water. Dawn had already commenced to break when we left the firing line and started to progress homewards. China Wall is an immense long wall of sandbags well named. CO. had left when I got back and took over. The people on our right captured a German this morning. He had been firing flares in No Mans Land and some of our chaps slipped out and after bayoneting his arm made him prisoner. Caked with mud he proved surly and refused Bilpin’s proffered cigarettes and hot coffee and roused feelings of regret at not finishing him off. This place is extremely quiet now and yet no sector is so hot when things are doing. Every inch of ground is historic and drenched with British and German blood. Just outside our dugout door are graves and well filled little cemeteries full of white crosses abound. Spotted a batch of graves clustering around a shrine further back the other day – rather an appropriate spot. Repairing our front line the other day men found a body just under the duckboard and digging deeper found another duckboard with yet another dead man beneath it. \"Strafing\" commences early in real earnest and we commence preparation for local hates and unpleasantries. Good mail last night and Effie sent wattle blossom from the loveliest river in the world. Quiet evening yarning with the Artillery liason officer and turned in to bed at about 8.45 pm. Pioneers pumping the water out of chilly mildewed dripping dugout.\n\nYpres ","28":" Called at 3 am and turned out into the dark and took charge of headquarters while the C.O. went the rounds of the trenches. Our patrols came on nothing in their adventurous travels and indeed, we think there is not much in front of us except for wandering policing patrols. Greig compiled intelligence reports and despatched same with wind and situation reports. The work in \"B\" Co was again not up to standard and Hunter took over from Elmiger who goes to \"C\". Crowther left this morning. At about 8.30 the enemy commenced shelling here with shrapnel but no casualties resulted. Too much movement round about this morning. The rest of the day was quiet and plans were matured and discussed for a raid. In the evening King came down and this was gone into. Bed 8.30 pm.\n","29":" At 3 am carried on again. A quiet morning but rather dark and cold. At 8.30 our guns commenced a strafe on the Hun wire and provoking little retaliation. The day was a dull grey one and the only aeroplane which came across had to fly very low. The Huns shelled him heavily and he kept company backwards and forwards until his job was finished but always on a different tack and elevation. The aircraft stuff is all black smoke shell as distinct from the white of Gallipoli and early days here. The C.O. of the English battalion on our left dropped in. He is a Capt. and has a battalion 60 strong! Monocled and very good sort. Yarned for a while and had some whisky. Other people concerned happened along later in the day and discussed details of raid. Bed 8 pm.\n","30":" 3 am commenced work on Intelligence reports. At 8 our guns cut wire for 10 minutes but provoked no retaliation. Things very quiet during the day. Busy with details for our \"jolly boys\" but the General called in during evening and told us of postponement. Furpheys flying round and gradually materialising in the familiar fashion re our next visit to the Somme. Furpheys which are persistent are true often.\n\nYpres ","31":" Awakened after an unsettled sleep by the CO coming in to the dug out and remember saying \"Good morning! What’s the time\". He replied \"Between 4 and 5, I have compared the two Intelligence Summaries!\" After dozing for a few minutes I got up and dressed and on reaching the dugout they stared at me in amazement as it was only half past 2. The whole incident of the conversation was an hallucination or the effect of an exceptionally vivid dream. The C.O. had certainly entered the dugout but had not spoken nor had I. Subconscious mind. Remained up and yarned until 4.30 when he went the rounds. Signed the intelligence summary. We go out tonight and raid is postponed pro tem! Went back to bed after breakfast and slept until 12.30. A very quiet day and beyond putting a few 77’s in our front line the Bosche kept quiet. The CO of 23rd arrived about 7 pm and I set off with a runner & Hun for Ypres. The country is well pitted with shell holes mostly old. A couple of shells passed overhead and burst in the town. This is a good example of a walled city. Beyond the city wall there are no houses but once inside you find them jammed right up to the ramparts. The moat is wide and full of mud and rushes. There is a fine church in ruins. Reached billets and found the mens’ quarters in a most filthy condition with foodstuffs and rubbish. Furphey: That we follow the first Div to St. Omer and spend 6 weeks in rest there do a stint on the Somme and then garrison Southern France during the winter.\n","32":" In Ypres billets quiet day. In the evening went out to the rear of gaol and laid out some practice trenches for raid – a few Hun shells. At 5.15 pm he dropped 3 4.5 H.E’s into our billet at Hospital Notre Dame killing 1 man wounding 2. The dead man Dawson received an almost direct hit and was nearly blown to pieces. The head was intact with a portion of the body and the pieces took a lot of gathering up. Turned down proposal to bury him beside other graves in backyard and told Pioneers to put remains in a bag and carry to cemetery. Went to Baths but no one in attendance. At 6.30 pm our artillery started intense shelling for a raid by 7th Bde.\n\nYpres","33":" Furphey today: General Birdwood has been to Salonika and has just received 300 German taken prisoner and passed our Div this morning. A dull day. Played poker in the afternoon and came out square on today and yesterday. Went down to the ruined Belgian barracks for a bath before tea and then went down to open grassland near the gaol and watched our’ string’ party practice crawling and so on. Some gun fire, the flashes casting a weird illumination everywhere. The Tommies practicing too and they blew up a little mine or small bomb near us. Fellows keen and should make a \"do\" of it. C.O. has gone up to front line tonight as we are sending out a party of about 9 to tackle a little post in an old trench in No Mans Land. Doctor and stretchers also standing by. This town full of transport at night and crowds of troops moving to and fro. In this billet tonight are over 1000 men. What a haul for Fritz if he put a shell circle round & then got his heavies on to the centre of it. come up nightly and have unenviable jobs one way and another. Doing work every night must pall on them. Robertson did not return from Blighty when his leave expired and now writes that he happened to strike the bad luck of being stung at Boulogne en route. The Battalion could do with a month’s intense training plenty of hard drill and no fatigues as we have so many green reinforcements who are not like our old proved returns. My nerve since Pozieres is damnably weak and the screech of a shell overhead causes me to experience a sinking feeling in the stomach. It was not always thus. Getting wounded has frightened me surely. Stayed up late awaiting C.O. 9 of our men went out tonight to bomb a post of Fritz’s but found him out.\n\nYpres","34":" promoted Major dated 11\/10\/16. \"No C.O. to get this antedated to August last if possible. Up early and took over command of the Battalion from Colonel Smith. He left at 10 am on leave to England for 14 days and the command of the 22nd Battn on active service is entirely in my hands. Took a summary of evidence in a charge of desertion and then pottered round all day mostly on correspondence which has been accumulating of late. During the evening Fritz opened up a bombardment on our lines. No s.o.bs or much gunfire from us. Our raiding party practising – mostly crawling and so on. \n","35":" More \"furphies\". That the 1st Div have handed in all box respirators and steel helmets & that we move in four days. Salonika much talked of but the Somme more. Disbanded raiding party. Fritz shelled us here early a couple of shells coming right into the building. 2 English tommies wounded. Otherwise quiet and did odd jobs.\n","36":" Started the taking of referendum votes when a message arrived postponing poll for 3 days. Many furphies today and preliminary order coming through. A very fine cold day and the weather forecast predicts 2 of frost tonight. A Taube came over about 5pm and was subjected to a very severe bombardment but not brought down. One of our chaps was soon up after him. Major Flecker arrived to relieve our M.O. James who goes on leave tomorrow.Get no exercise here confined indoors all the time. In this house there are a lot of drawings on the walls after Bairnsfather but I have not discovered anything special about them. There are a great many obscenities not after Bairnsfather however. A lot of our officers are away at schools – it is a phase of this war. I.O.& Q.M.up after dark unenviable jobs theirs but with advantages nevertheless. This place full of guns among the ruins and our shredded building reverberates with each salvo. One of the men said \"I know why they put off the voting – they know there’s too many noes!\n\nYpres","37":" Up early and breakfasted and then walked out through Lille Gate to the railway dugouts. The thick ramparts have a breach in them here and a stone causeway runs across a broad and deep moat full of water. The country is then for some distance of a marshy nature and covered with bulrushes. A good many brass hats were about. A wet slippery walk across the fields but the day is a lovely one. Reached 24th H.Q. and found Watson returned so we sat as a court martial and dealt with 3 cases. Returned before lunch. Just near the railway is a very full cemetery – the neat white crosses grouped as close together as it is possible to pack them. Some acres of dead men. Further on, almost hidden by grass was a smaller plot of rude unpainted crosses rotting into the tall grass. In a dirty dingy farm outhouse were a number of duckboards and a notice over the door \"Brigade Mortuary\". Lying on one of the boards was a shapeless blanket shrouded body, all sewn up ready for burial. One of the boys – his day’s work over and a cipher from the military standpoint, no further use to the army. Our guns in rear of the town were putting over heavy stuff some miles across and I stopped, listening to slow methodical whining progress of the shell. The enemy was also planting some fair sized stuff into the town and knocked down some more of one of the towers. This has been a fair and smiling city but now it is a stricken waste. Furphies are becoming substantiated and orders now commence to materialise. Major Hugo Flecker A.A.MC has reported to relieve James to go on leave. Carl Thomsen left tonight for the Flying Corps and spent the evening in with me. What a great brotherly feeling there is between all we old Yarra Borderers. Only 3 of us left in the Regiment now. Poor old Bert, Hughie, Biggsley, Percy Collins Dangerfield & Retchford dead and others wounded. Raining tonight.\n\nYpres","38":" The \"dinkum’ arrived early and we issued orders immediately. The 11 Northumberland Fusiliers took over from us and four of their officers dined with us. We move tonight by train from Ypres to somewhere this side of Popheringe and then march to Ottawa Camp (Gd4C65) and after short rest there we leave about 9am the morning after for the Steenvorde area in France. The English officers very decent chaps and mostly all old campaigners. Only when the Battalion has to move do you realise the enormous amount of baggage there is. We have withdrawn one of the mens’ blankets from them to be carried on motor transport and have to shift this with our own regimental stuff tonight. All the officers baggage and cooking utensils as well as office gear, company stores, ammunition and machine guns to say nothing of cookers and the rations for 1000 men. With our original battalion full of trained men all this would be simple but as it is we have a corps full of young green soldiers and this march will be for them possibly their first on service. During the afternoon I called up the company commanders and reviewed the orders with them and then having done my part, sat down to a game of patience. The execution of instructions devolves on them and the man in the ranks. Our guns have been fairly active today but Fritz has not replied. Bairnsfather’s pictures of the last half hour before going in and before leaving the trenches are very true. We have an unsettled feeling and cannot fix the mind on anything. This is always so before a tour into the trenches or a shift. One delicate matter I have had to fix has been a matter of rather hard potting among some of the younger officers and they had to spoken to straight out from the shoulder. Their officers got on to the cleaning up and all the chaps turned out of their billets. The Tommies commenced to arrived about 9 pm and the CO.\n\n \n\nYpres& Ottawa Camp","39":" was an elderly Major accompanied by his H.Q. officers – a decent crowd. Their M.O. was a Melbourne man Haines by name. They had an easy time on the Somme this time and we spent a couple of hours exchanging reminiscences of different portions of the line. They also know Madame Chavasse of the shop of Burberry in Armentieres \"the Boeuf\" and the lady of the John Bull shop. Some of these estaminet, girls are known right through the British Army from Ypres to La Basse. Rain set in and troops continued arriving in the building until in its confines we had about 1600 men. At 9.45 pm our unit started to move in parties of 50 at 2 minutes intervals –full packs up and all gear. The square was busy with transport and troops. Our chaps splashed on through the mud to the rear of the Asylum where all halted. Mc Lennan had been detailed as entraining officer and had all of our arrangements made. Presently a dark armoured train glided up and the men made an excellent entrainment. We set off at a steady pace and the driver pulled up at Vlamertine and we disentrained. I had a guide waiting here and he guided us to our camp along dark muddy roads. Coming in we passed some English Fusiliers and a horse in the . I had sent Miles on ahead to alert the hosts and we marched straight into allotted billets. The cookers served up hot tea to every man before turning in. An excellent night’s work and all arrangements worked very smoothly. Plenty of accommodation and a large mess room. We had supper of cheese and onions. A great relief to get back to a place where we are out of shell range and can expose lights. The grass in the huts is very boggy and . The men were very funny mimicking the they have been with today.\n\nOttawa Camp near Poperinghe Belgium19\/10\/16 In billets(huts) all day. Very wet morning teeming with rain and we were glad not to be on the move. Country looks thoroughly drenched, the many poplars are shedding their leaves and appear under \"bare poles\". An extremely flat landscape relieved only by an occasional Flemish windmill. Many ponds with their characteristic fringe of clipped and pruned pollard willows. A number of English troops also here. After breakfast drew up move order covering our advance from here at 5 am tomorrow. Providing for marches of 45 minutes with 15 minute respites and a halt for lunch 1 1\/4 hour. Stewart and the went on ahead to make a reconnaissance of the road as far as the French border. Abeele. In the morning there was nothing doing owing to the rain but after lunch a strict foot inspection took place. Every man had to wash his feet and then have them inspected by an officer. Bad corns blisters or other troubles were seen to at once by the M.O. Major Blecker. The Tommies have a band which played at nightfall and I gave leave to a number of men to go to a picture show up the road. It was quite dark about 4.30 and the night proved to be a very wet and sloppy one with a piercing cold wind. Were it not for the duckboards one might easily get lost en route to the latrines. Today would have been a very wretched day for a long march and we hope the morrow will be better. Arranged for the men to so carry their water sheets and blankets that they can easily detach and use the former as a cape without the latter becoming wet in the event of our experiencing anything like as tempestuous weather conditions as obtained today.\n\nSteenvoorde","40":" This morning early was one of the coldest I have ever experienced in my life. Hunt awakened me from a chilly sleep at 5.30 am. It was pitch dark and the cold seemed to strike right through blankets and coats. We fell in at 7.45 and at 8 am we moved off in column of route with our transport wagons in rear. The day was a fine one and we marched spells of 45 minutes to the hour and 15 minutes rest. Being in good time we took two hours over our lunch. There was much traffic on the roads - artillery amc and many other mobile troops. At one halt there were a great many German prisoners constructing railway yards. Hereabouts we noticed some big puffs of shrapnel to our rear and I was a little anxious until the Battalion got out of range. Two Taubes came over just after one of our airmen had been giving a most daring exhibition of his art in looping the loop, diving and other things. The \"archies\" flecked the whole sky but the Taubes escaped. At Abeele we saw the Corps Commander and just outside the village there is a large aerodrome above which many aeroplanes were flying. Some of the side slips and dives were most audacious. One chap came to grief his plane dived into the ground and was wrecked but he escaped alive. We halted while some of the men released him from his seat. He said \"What has happened, did I hit the ground?\" One of our wags at once replied ‘Too b--- true you did old cock\". He was able to walk home. We passed from France into Belgium hereabouts. A post marks the boundary. We now begin to see more decent people and pretty girls. The women are very industrious in the fields. The country round this side of that striking landscape Mont des Cats is very beautiful and quite different to the ordinary monotonous scenery. \n\nSteenvoorde 20\/10\/16 Here we have meadows trim, and neat old thatched farmhouses embowered in belts of trees. The 21st were billeted about here and Colonel Forbes rode along with me towards our destination. The marching was damned bad owing to our having many new comparatively unseasoned men. Few fell out but the fours were uneven and ragged. Arrived in the village of Steenvoorde. We found that we were a little too early for our billeting parties. The church has a rather peculiar tower – not solid. You can look right through the steeple in \"slits\". We passed a cemetery before this and therein upon the verdant sward between the crowded tombstones of highly respectable burghers - a lordly Australian, doused with the hop fumes rising from the good ale within his bosom, I took a recuperative sleep in the hallowed spot. To avoid a halt in the town, kept going through the market square and then continued straight ahead and on what later proved to be the correct road. Soon we met McLennan and the companies were then drafted off to their destinations. Very much scattered all of them. The men were commencing to flag and one crowd became quite a rabble and called for a few biting comments to its O.C. But it’s easy to rouse – the men are green and want plenty of training. Our H.Q. billet was uninviting in outside looks but not bad inside with two canopied beds. The walls plastered with the usual religious pictures and certificates and some educational certificates too. Noticed today at Poperhinge the same shaped gables on public buildings as are seen on the hotel de Ville & Church of St Vaast at Bailleul and elsewhere. The Trappist Abbey of Mont de Cats (1832) dominates the whole country from here and should give a fine view of the front at night. \n\nSteenvoorde","41":" In billets all day. In the afternoon rode into the town and saw the General about more officers but there is a deadlock and though the establishment is 34, I have to run the battalion with a total of 14 deducting the 5 on H.Q this leaves 9 company officers for 800 men. Steenvoorde is a little cobblestoned country village with some old twisting streets and a small market square. Had a good ride along the road and back. After ten all the ballot papers came in and had perforce to be sorted and bagged up. The result will I am sure be a great and overwhelming majority of \"noes\". Held orderly room and sentenced one man to 21 days H.P. No.2 for being absent without leave from marching off and dismissed a charge against one of the old chaps who was suddenly taken ill and fell out without leave. Fulton and Groves put up stars today. In the evening the move order arrived and I issued the necessary orders in connection with the march. We form part of the Brigade column of route and clear the starting point at 11am. Buysscheure is our destination where our billet is a good little place and the old people kind and considerate. They speak Flemish and French and their rooms are most abundantly decorated with crucifixes and pictures of a religious nature. The houses of the south are said to show quite as conspicuous an absence of these outward devotional aids. All the Coy commanders came in at 9 pm for supper and we discussed tomorrow’s plans and arrangements. This pleasant country is a charming change to the uninteresting land around Ypres. Cold chill night.\n\nCassel, Noordpeene, Buysscheure","42":" Heavy white frost but a clear sunny day with feeble strength in the sun’s rays. Being Sunday the sound of church bells steals across the fields. One would like to dally here in this peaceful smiling district instead of going back to hell on earth. I had timed our column to move off at 10.40 a.m. but at 10.30 all being ready we moved off and passed the starting point at 11 am. A cold wind made riding very cold. The road soon commenced to twist and turn in a rather tortuous way as we came towards Cassel. Colonel Watson rode along with me and we noticed with interest how strongly Cassel is situated from a military standpoint. First the road circles round a rather tall hill thickly wooded and the ground rises slowly up to it. The whole country spreads out on the other sides in a delightful panorama. Rounding the wooded hill we come on Cassel – a fine old medieval town crowning a height. Several battles are said to have been fought at the feet of this height – The French v the English & Protestant v Catholic in Hugenot times. This would be a dear old place to linger in during peace days. We made a detour and skirted the town and so missed seeing its winding and quaint old streets. Our route took us past some fine chateaux in one of which a fountain was playing. Some of the grass and woodland just here reminded me very much of old pictures of English country and the lanes were just like Devonshire. Marching on the map we went through quite a lot of\n\nCassel, Noordpeene, Buysscheure 22\/10\/16 villages each of which had a fine church some of great age. All the people today were wearing their best clothes. To clear a village with our transport column I had to march the men for an extra 10 minutes which was a bit of a stinger and when the whistle blew they all gave a thundering cheer of relief. The cookers soon came up and served out dinner. After an hour’s halt we pushed on again and had good marching along lanes and pleasant winding roads some of which took extremely sharp turns at times almost right angles. Our billeting parties did not meet us where we anticipated and I began to think it would be necessary to billet the battalion myself. We soon found ourselves going across unfenced open cultivated land and from a high spot on the ground a very great extensive view spread before us. In the distance was St Omer with its spires and towers looking blue with distance. It was no easy thing to find our way with no other guide but a map. Soon the spire of Buyscheure church appeared above the trees and we halted the column and then rode on to reconnoitre. Near the old church we found our billeting party and marched into billets. I was quartered in a two storey building with Monsieur le Cure – a decent old chap in pants and cassock who spoke very little English and cracked a bottle of wine with us. This little village has a Maire-'ess' and the 'Maire' is her son a bright boy of 12. The church tower is 700 years old, the rest of the church 300. No old tombs as the graves are used again every 30 years or so. Altogether a good place this and today’s march has taken us through lovely country.\n\n \n\nBuysscheure, St Momelin, Serques, Nort Leulinghem","43":" The small commune of Buysscheure is the boundary between Flanders and France and the Flemish language is spoken as far south as St Omer. Excellent billets here which we were loath to leave. We passed our own battalion starting point at 10 a.m. and made for the Brigade point which we passed at 11am. The Battalion was leading an extremely long column which stretched for a mile or two! The country was again very pleasant and we pulled up for lunch from 12 to 1.30 the General joining us in a snack. We have taken a most roundabout course today and are further away from St Omer tonight than we were yesterday. As the whole Division is in billets close round, this roundabout method is necessary. Passing the through the extremely dirty little hamlet of St. Momelin where we saw some filthy little children we came to a canal on the bank of which we marched about 4 kilometres. Noticed the pointed sampan like boats the farmers use & winding road through delightful sylvan glades took us through the dearest little villages nestling with the thatched roofs round their stone church. Eventually struck the Route National a grand road of metal and straight as a die.. The men sore footed and tired but some of them always vociferous and chippy. Remarked during a halt how careless we are of the conventions. Men at once squat down on latrines dug right out in the open and ease themselves in full view of passers by. No attempt is made to avail ourselves of the privacy afforded by hedge or bush. The women are not spooked - they take no notice.\n\nNort Leulinghem 23\/10\/16 These coarsenesses will take a while to eradicate on return home. Coming out on the Route National we pushed on towards our destination going up some steep hills that took the wind out of the boys. It now started to get dark and the country became open and treeless. Our billeting party met us and it was an extremely tired column that marched into the tiny village of Nort Leulinghem. From the road this little place is quite invisible but as you surmount a ridge the little place discloses itself beneath. The men soon got with their billets and the serving out of rations and blankets had to be done in the dark. My billet was in the best house in the village - a place with a fine garden in front.. The people of the house consisted of an old lady and her daughter who seemed lonely. Monsieur was le Maire and after 30 years in that office had just lately died. We talked for a while over une verre de vin et les petits gateaux. Orders arrived and having issued mine I went along to bed in a fine bed in a clean little bedroom. Madam had not retired and I remonstrated with her for staying up but, like the hospitable soul she was, she insisted.\n","44":" Got up late. A rather damp day. Put in the morning reading and writing – all the men resting for their long march to St Omer this afternoon, the subsequent entrainment and the expected long march to follow. This morning madame sent in a cup of coffee lashed with cognac.\n\n \n\nSt. Omer 24\/10\/16 At 2.30 pm the column moved off and in light rain we swung over to the main road. Some drunks but not very many. Halted outside several little villages and near St. Maertin we had tea after which the transport moved on. Here we talked to some children who showed us a granite column erected on the scene of a battle fought between Bayard and Charles Temeraire. The men sang choruses and some very ribald songs while waiting. Continuing the march we skirted the outside of St. Omer and came up to the station. Women and kids came up calling out \"Chocolat, Boulli beef, zaq a zaq£££££££££\" The train consisted of carriages for 700 men and the balance comprised of the usual trucks some of which were in a filthy condition and not fit to put men in. Our movement order provides for an arrival at Longpre at 4 am travelling all night via Abbeville and Etaples. The canal system hereabouts is elaborate and connects up with railways. We questioned a lad about his homelife. He was of the average class and had his primary school certificate and a good knowledge of mathematics and geography. His father was conscripted and works in the coal mines of La Bassee. They were refugees to St. Omer and only had meat once a week generally on Sundays – either fowl or rabbit. About every second Sunday they have snails or frogs for dinner. These they get from an old man who catches them in the surrounding marshes. They also eat horseflesh sometimes. We pulled out of St. Omer about 10.30 pm and ran on in the darkness all night. It was miserable crouched up on the seats and got extremely cold towards dawn.\n\nLongpre, L’Etoile","45":" Our route was via Etaples –Abbeville and all night we were travelling. It was raining most of the time and intensely cold and uncomfortable. When it became light we could see that we were running along the Somme and its marshy surroundings. There was far more water in the river and marshes and lying around than when we were last here. We disentrained and Longpre and only had a short march to L’Etoile through somewhat marshy lands. The village is a small one and its church its built on a projecting wooded bluff. The first billet allotted me was in a most comfortable house but we vacated it for a deserted chateau which promises to be equally uncomfortable. Some drunks missed the train last night and much to my disgust today \"Tracker\"Hunt failed to disentrain with us but turned up later on another train. The absence of meat (see 24\/10\/16) in pleasant dietary and the way they thrive on vegetables bread should be a good argument for vegetarians. Cold and bleak and the damned batmen cannot get fires to burn! Indeed there seems to be no coal or other fuel available in the village. Went round after lunch and climbed a bluff on top of which an old church is situated. From the graveyard there is a splendid view for miles round. The Somme flows between low banks and masses of poplars and elms cover the river flats. Their leaves are autumn yellows & reds. Neat farms and open cultivation gives the scene a landscape – target appearance. The landscape has a chalky subsoil and is not as fertile or as densely populated. Our billet is an old chateau owned by Comtess de Lila Paola who the concierge says is an actress now very \n\nL’Etoile 25\/10\/16 old and who has not been in residence here since the war having another place at Boulogne. This is a new fashioned chateau and is rapidly going to rack and ruin. The walls are tapestried and the room we mess in has some very fine original oil paintings. One is a gruesome thing depicting a huge gallows tree all hung over with corpses dangling from its branches. Some are new some are old and a rank vegetation growing luxuriantly beneath the boughs sprouts through the skeletons which have fallen. Crows pick the bones. We unearthed a pianola and have revelled in Strauss, Wagner and selections from all the operas. There is a fine ebony table in this room – made of ebony cunningly inlaid with mother of pearl it is worth a great deal. All this good stuff is much knocked about and the good carpets are deep in dirt and rubbish. I have a sitting room which is excellently furnished with a fine writing table and chairs and a bedroom containing bookcases full of standard French novels. Tried four cases at orderly room and dealt out 14 days F.P. to some drunks. This curse of drink commences as soon as we get into billets. We are about 15 miles from Amiens but if Smith gets back in time I hope to have a run in there to feast the eye once more on the carved dream of stone that is the exterior of the cathedral. All the clothes I had in the wash have been stolen and in consequence I have no change in underclothes. The French are deplorably weak on sanitation. Latrines are on the pit system and the reek that ascends from the decomposing excreta is enough to turn the boldest stomach. Life in a little village like this must be a simple thing devoid of excitement. \n\nL’Etoile","46":" Awakened by Stewart (Adjutant) at 2 am with a move order and issued one of my own at once. We remain here until tomorrow but our transport leaves at 8 this morning and is right detached from us for two days. We go tomorrow by motor buses As all our baggage had to be taken too it was necessary to have all officers kits at once. A wet and cold day. Laid down a program of work which had to be substituted by lectures etc. Owing to not having full maps our billeting people went to the wrong Ailly and I had to send another officer to the other place and then arrange an exchange on the busses passing through the other village. Rumours of big French push and our route lies more southerly than last time. After lunch the weather cleared and a pleasant sun came out. The companies were on parade from 2pm to 4.30 pm and did drill and inspection work and also physical exercises and games. Quite a change for both officers and men to get out and do some drill. All companies went a little out of the village on open ground. Went round with the Adjutant and saw them all. The sun shining on deep greens still wet from the recent rain was very beautiful and twisting little hedged lanes led into the village. Many fields near the river are dry in summer but at this season are completely under water almost. A good deal of quiet steady \"potting\" is in progress. Men today have improved their appearance greatly by cleaning their clothes and smartening up generally. Waited for orders all the evening and eventually issued my own after seeing Col Forbes ( 21st) and arranged to have the men standing by early in their billets. \n\nL’Etoile, Amiens, Buire 27\/10\/16 Orders arrived after midnight and provided for a 3½ mile march before 9.45 am the men to carry their two blankets and to wear their greatcoats. At Monfleur we embus into French busses. A cold windy morning with threatening skies. The doctor is most patiently putting together a jig saw puzzle on which he was also working until late yesterday evening. FleckerMD, CHM, FRC,& is a persevering person. We commenced our march at 8a.m. and left the village by a side road by which we dodged climbing a steep hill. It was very wet underfoot and a cold wind was blowing which made us glad that the men had their greatcoats on. Passed through the little village of Brocon which has a small church with a studded spire. The road descends a steep hill after leaving here and the boys were just about blown when the spell came. All carrying two blankets. The wind was bringing down showers of autumn leaves. We pushed on to Moufliers and waited outside the village until our turn came and then pushed on. Hundreds of motor buses under French officers and driven by French drivers were waiting for us. Nearly all of them wore skin furry coats and looked like teddy bears. There were many natives some coal black, wearing these coats and steel helmets. The whole of the 7th Brigade were getting into the busses and there was much running to and fro. Orders kept reaching me from the French, General Paton and General Gellibrand and also from the AA & Q.M.G: Eventually the other people got clear and the French sent up a big chain of motors opposite us. The drivers each took 28 men and in about 10 minutes all were aboard and I was in a nice little motor car with a French officer who wore the Croix de Guerre & the 22nd Battn was sliding off on wheels: We had a very good\n\nAmiens, Querrieu, Ribemont, Buire","47":" journey and a non stop run passing through the familiar country down to Amiens and noticing near Ailly the remains of an old Roman camp the fosse still being visible. Thence on to Amiens and passed through its outskirts. Many French soldiers billetted here and I saw some blacks dallying with white women. A few of our Indians about – heard it said there are some souvenir Indian picannins round about. We had a short halt just outside Amiens and a pretty fresh faced girl came along selling cakes. The men were urinating all round her but she took no notice – the French care little for these things. We now passed on through Querrieu passing through some delightful green forest and meeting a great deal of transport. Our convoy swung along like a long train. The country now began to appear war stricken and there were crowds of Hun prisoners under guard at work on the roads. Our motors dumped us at Ribemont – we had enjoyed our motor ride. Formed up on a piece of waste land and having met a guide, we pushed off towards Buire. It was a short march but very muddy and we passed Germans sweeping the mud off the road. Entering the village of Buire we found that we had to go into close billets and have the maximum of crowding with a minimum of comfort. H.Q. not too bad. The whole Brigade is billeted in this village. Rain commenced as soon as we got under cover. It is very funny to hear the boys talking alleged French. Had a glass of a liquor called grenardine - a syrupy thing made from pomegranates and a cup of coffee made by Madame. French people can make coffee. Turned into bed, and slept very soundly.\n\nBuire (Picardy)","48":" After a hasty breakfast hurried off to the Bde. and spent the whole morning with the other C.O’s and General Gellibrand discussing many topics. The whole place very mucky and full of creamy mud. The streets of the little village are thronged with troops, an old poor church with an old tower is in the centre and possesses a clock that is going. Had all O.C.s up to a conference during the afternoon. Jack came in for tea and stayed for the evening. The doctor was talking to the old people and getting details of the 1870 war etc.\n","49":" Colonel Smith returned early and I handed over things to him. At 11 am we had a church parade in a large barn. A wet cold day and quite cheerless. Stayed in and read all the afternoon until called out to settle a claim brought forward by a man who said some of our soldiers had stolen a large door belonging to him and having taken it away had used it for firewood. The people we have been among lately are all quite remarkable well disposed and friendly towards us. It has been our custom quite to look at the inhabitants as suspicious but there is nowadays no reason for this. The lads got their pay tonight and naturally rushed the old dame’s coffee and cake supplies. Their French is very funny par example:- \"Ung coffee\": \"Doo cake\" etc. When the troops are here and have the money these people do very well but then soldiers are not always here. Sent a cheque to tonight. A fine clear night with star spangled sky. The leaves are falling fast on the wings of Autumn winds and the foliage of the trees takes on a yellow tinge. Rumoured that a Gallipoli ribbon is to be issued in a few days - the Egyptian colours being used. Hope this is true.\n\n \n\nBuire sur Ancre. Picardy ","50":" Morning parade by companies, attack practice in waves in the fighting order of greatcoats buttoned back and blankets rolled. In among rows of trees, all planted in their rows and becoming barer as leaves flutter down each second to the ground on the wings of the wind and carpeting the mud with a thick pad of leaves. Round all the companies and then walked out of the village to some trenches and selected ground for the afternoon’s work. After lunch we fell in as a Battalion and marched off to the selected parade ground. It commenced to rain as the men plugged along and soon started to teem in real earnest. In a very short time everyone was soaking and slipping all over the place. We carried out an attack in facsimile and took three objectives and then formed up in the torrents and returned home – a very bedraggled crew.. After a change of clothes, read and chatted round one of these French stores – sensible warming and cooking apparatus. Dr Craig came to dinner and spent evening with us. \n","51":" Went to 24th Batt. headquarters and tried 4 cases – 3 of desertion and awarded these 3 – all bad eggs – 10 years penal servitude each. In the afternoon rode over to Heilly and had a bath at a Brasserie there. Very muddy. The sun shining on the leaves of the trees looked very pretty. Evening orderly room some of the men were up for assaulting Porter and took a long time to thrash out. Porter a pretty sight with black and yellow face and had to go to hospital with injuries due to the book\n\nBuire-sur-Ancre & Amiens ","52":" We notice vivid flashes fleeting across the sky all night long as bombardments take place only 10 miles away but we do not hear a sound. At Boulogne I have heard the guns myself and there are those who say the \"boom\" can be heard in England yet we can’t hear them here. The same phenomenon is noticeable in trench raids and other operations involving an intense bombardment. In the area affected, the noise is not noticed – there is only the sound of \"phut! phut!\" like so many airguns. Another thing which is striking is the musical chiming of this music of death. Each gun barks in different tone and if the guns are kept methodically served by the gunners their note must come in at regular intervals. Hence we have a chiming hellish tune. Rose at 6 am today and walked to Mericourt station with orderlies and the Dr Flecker. Took train for Amiens and had an extremely slow journey. Traffic blocked further progress about 2 miles out from the city so we left the train and pushed on afoot. Much low lying ground and intense cultivation of villager’s plots. Hundreds of German prisoners at work on roads and railways. Saw some very fine looking N.C.O’s among them. Caught a train at the outskirts of the city and rode in, passing a small column of young soldiers marching at the slope and carrying colours draped in mourning black. Today is All Saints Day or the Fete of the Dead and all France is paying a tribute to its dead. Most shops are closed, people are in black and wreaths are \n\n \n\nBuire-sur–Ancre, & Amiens Picardy 1\/11\/16 being put on the graves of \"les braves\" who have died pour La France. The French soldier carries an equipment which seems much lighter than ours and can be cast off easily. A spare pair of boots is carried one boot of each side of the pack. Coming into the Rue des Trois Caillons we commenced shopping and kept hard at it. It was delightful to see the daintiness of the French shop – girls - so vivacious and attentive and withal so neat and dainty. In accordance with the usage of these Continental countries, baths are rarely indulged in by the people but the women keep themselves to all outward appearances and clean as new pins. The effect of no baths is noticeable now and then is the sweaty smell of armpits and I think it is for this reason that scents are so freely used by them. Amiens is essentially a French city. All the troops in the streets are the piolus in their horizon blue uniforms. The officers look extremely smart in their well fitting tunics and gold braided kepis. All ranks wear their medals the Croix de Guerre and Legion of Honour are common and look very well. Trams running along the streets, dainty women passing and all the comfort of civilised life emphasised – and 30 miles away poor devils grope in the mud for one another and die in the rottenness of decaying flesh. To Goeberts, a café near the Banque de France and ordered lunch. Tried to get some frogs but there were none on. This fine place much frequented by the French and British officers. Dined in epicurean style on French dishes \n\nBuire-sur-Ancre & Amiens. Picardy 1\/11\/16 (than which there are no more tasty). Grave superior vin and crème de menthe. To the cathedral and sat down on the opposite side to take in the beauty of the frontal stone carving. Entering we went all round and found that a fragment of the bone of John the Baptist seemed to attract a great deal of attention and much reverence from the devout passers by. Magnificent stained glass rose windows so extensive that you marvel how the slender tracery of masonry can support its weight. Public urinals only screen part of the body. Saw men switch round against walls in open streets – no one took any notice. Much struck today by the superiority of French organization over ours. All their young men are sent to the trenches; guards and L. of C. work is done by old men and fathers of families. They can be billeted at home. With the English strapping young chaps are loafing round guarding Hun prisoners and doing light Base jobs. It is rotten. They badge all their trench fighters – the man who has never been right into it has no stripes to show. With us the coldfooter is screened. Left by train at 3.40 and arrived back in time for tea. At 7 pm attended a concert given by \"D\" Co. It was rather scratch at first owing to the talent being rusty but improved vastly towards the end. Quite a break in the monotony and God knows the private soldiers life is monotonous soul killing existence. Dr James returned from leave.\n\n \n\nBuire– sur-Ancre. Picardy","53":" A wet day. Stayed inside all the morning and took down a summary of evidence in the case of Rhoden. Furphey today we move to Fricourt tomorrow. After lunch took the Battalion right out to open ground on the top of a rise a couple of miles out. Carried on with physical exercises and bayonet work followed by close order drill. Men very keen. Weather cleared up and wind dropped. Dozens of our aeroplanes up manoeuvring around and plenty of sausage balloons up both on our own and on the French front. Espied the white caps of two nurses in the distance so the Colonel and self rode round the hill and cut them off and asked them if they had seen any troops drilling round there. Stayed and talked to them for a while - nice girls. Formed up in mass and marched home. View from here is very extensive and on all the ridges are scores of white bell tents. Some are hospitals but most are camps of troops. In the valleys lie the little snug villages swollen out with military additions. Mud and water everywhere. The men all very keen on their work as they always are when there is anything doing. It is pathetic to think that all the keen lads we took in last time are all out of it now and replaced by these young novitiates , most of them fine big men. The largest are in \"B\" Co and the smallest in \"D\" Co. Conference of officers in evening.\n\nBuire–sur–Ancre, Fricourt, Mametz","54":" Early breakfast. All hands on cleaning up. At 9am we passed the starting point and commenced our march to Mametz. The filthiest muddiest march imaginable, each step the horses took splattered drops and splashes over everyone in front. The scenes we passed through were marvellous. For miles we formed part of an enormous slow moving never ceasing chain of traffic consisting of soldiers , horse and motor vehicles, artillery etc. Stretching in all directions were camps of cavalry, troops and depots – like some enormous ant heaps. We passed one casualty clearing station with its special railway siding and train waiting. The mud was shocking, one man stepped off the road and became hopelessly bogged. If these roads were not good the condition would be hopeless. Traffic control is a matter of great difficulty and the traffic police have their work cut out. We passed Albert and then came on various ruined villages until we reached Fricourt and Mametz where such fierce fighting was in progress last time we were here. Nature is kind and mercifully hides the scars made on the face of the country. The splintered and torn woods, where thousands of shells have crashed and torrents of blood flown have now grown a thick green underbrush which touches the lower boughs of the stumps. The thousands of shell holes are being welded together by a carpet of green grass and craters are less noticeable. As we pushed on all the ground we marched over was land that had been wrested from the Germans and the drainage from the roads was being led into their old trenches. Towards the end of the march there were many checks and halts and we passed \n\nFricourt, Mametz Wood Camp 3\/11\/16 tired worn out troops returning from the trenches dragging their little Lewis gun carts. A good many Lancers were about – rather futile and useless surely. Plenty of cavalry camps. Disgusting to see the number of young English tommies hanging round behind the line on soft jobs. The French will have none of this and put their old men on the light work and use the young lads for the fighting. Switched off through a sea of mud to a camp of semicircular huts each of which holds 4 men. Formed up on a hill until the 7th Bde got out. The afternoon was fine and clear and the activity of aeroplanes was remarkable. There were scores aloft all the time circling & swooping. There were also 30 to 40 balloons up both ours and the French. Heavy shells kept coming over frequently and tearing into the wood and its surrounding roads and dumps – screeching big things which sent up fountains of debris. Saw 2 men knocked. Thousands of troops marching and counter marching – hundreds of camps and bivouacs in the sea of mud containing hundreds of thousands of troops. The area is packed tight with soldiers. Reached our billet and settled down – a furious bombardment raged all throughout the latter portion of the afternoon – the whole air shaking with the reverberations of it. At one part of the route today 4 men passed carrying a corpse on stretcher unknown nameless and going from nowhere to the same place. Managed to get reasonably comfortable in the semicircular huts but the gluey mud everywhere was awful. \n\nMametz, Bazentin–le-Petit, Delville Wood, Front line, Longueval","55":" At 11am we moved from Mametz and owing to an order not having been issued early enough there was some mix up in the issue of rations and some chaps had to carry sandbags full which proved a heavy burden for them. The sun was shining as we plugged through the mud and water and we found the main road crowded with transport and troops. At rear of our columns we had a guard with prisoners and as they had bayonets fixed it caused some comments from the Tommies we passed. Long strings of mules with little baskets for carrying shells kept passing us. The march was an exhausting one and there were very few spells given by the CO. Rode along with the doctor shepherding lame ducks. All the time we were passing through little camps and bivouacs where troops were moving & as far as the eye could reach the trenches crossed our track everywhere. At one point we passed a cemetery which was completely torn to bits and on a fragment of one tombstone ironically enough there was inscribed \"Concessiar des . After leaving Balentin-le-Petit guides met us and \"B\" was switched off to Longueval. Went on with the remainder. Delville Wood has been a large wood but has been tremendously strafed and all the trees are ruined. Tram lines run through and there are plenty of big guns. We had to be careful in passing not to mask the fire of batteries. Shells were landing round and we had one man hit. Coming out of the wood we encountered open ground over which the going was heavy and we had to dodge a good many which were dropping round closely. From one high point we were rewarded by a splendid view of the whole front. Stretching straight in front was undulating country and we could see Bapaume quite distinctly. Away on the right an attack was in progress and we could see barrages on which turned a line of trench into a line of white smoke. Something similar was doing on the left and the smoke hung round in the wreaths like a fog.\n\nFront line, Delville Wood, Longueval 4\/11\/16 Our destination proved to be a long earthy trench innocent of any revetting..Hopping in the first thing trod on was a dead man. Found the CO in a wretched dugout and no other accommodation so went back with the padre and the Adjutant of the battn. we relieved. It was now quite dark and the shell bursts lit the whole scene in front as with fairy lights. Through the plucking mud we trudged nearly dead beat and after many a fall and slip we reached Delville Wood again.. Some men gave us some biscuits which tasted good. The issue is softer than what we were used to at Gallipoli. Dozens of signal wires used & disused underfoot everywhere. After great toll we reached the outskirts of Longueval and after much rambling located our people and found them in tents they had pinched. The padre and I turned in. The floor of our tent was a carpet of mud inches deep and we had no blanket or any covering whatsoever. Buttoning up our waterproofs we lay down in the mud with our steel helmets for pillows. The wet bit right through and nearly froze us to the bone. One very heavy rainstorm made us fear for the tent but it remained standing. About 12 Fritz put over some shells.\n","56":" Awoke stiff with the cold and had just got outside the tent when it collapsed on me and all my gear. Sent Hunt back to the QM. to get coats etc. Very heavy guns back here started a bombardment about 9.15 am. A filthy rotten life with awful mud. Went up to Divisional Headquarters in the morning and saw Norman who said General Paton wounded and Col. Fitzgerald also. The men here made themselves fairly comfortable by digging their tents in and making all fast. No water supply and we replenish our cookers from the water in shell holes. Wet after dark. Several bombardments and Huns put up many red flares. Lively flashes tearing across wild sky and got us belching out \"Lord what fools we mortals be\"; turned up at 10.30 pm having been blocked on the road for 6 hours and only got his rations delivered up the line by 5am. ","57":"\n\nLongueval, Delville Wood & Battle front 6\/11\/16 Saved an altogether sleepless night by Hunt arriving with some coats and a blanket. Up and away with Thwaites to the trenches passing through the muddy remnants of Longueval. Piles of shells standing by the roadside and great activity in Delville Wood where the rows of big guns were very impressive. In the ruins of the trees crowds of men were working on trenches and other constructional work. Outside the wood we cut across country which was being shelled intermittently and was almost devoid of grass being just one clayey plain full of shell holes. Lines of batteries of light guns belching out. Passed many little bumps of field grey sticking out of the mud. In one place a couple of jaws full of teeth were all that remained of a face. Somewhere else a pair of boots encircling hose \"a world too wise for their shrunk shanks\" and withal a stink. Many graves under water. Saw our shells bursting all over German lines and got into our trenches and had lunch with CO. Took a good look through a telescope at Bapaume and saw the clock faces of the Town Hall. Returned via the wood and came back into camp. Hunt had made things very comfortable and Bazeley came along during the evening. A very clear sunset and crowds of observation balloons up all on one sector. Big guns putting over shells occasionally with deep booms and echo. A clear calm quiet night. It was piercingly cold and I was sleeping on a bed & stretcher raised upon two boxes. This proved unfortunate as the cold cut up underneath and rendered sleep nearly impossible. A troubled slumber. Some very big guns kept firing and their concussion shook the tent 6 inches at times. Heavy cannonades.\n\nMontauban & Longueval","58":" In the early hours searchlights and anti-aircraft guns were extremely active and it was said later that a Zeppelin had passed over. An incessant cannonade in progress always – if not on our immediate front then on either flank. Some very heavy guns spoke at intervals. Bitterly cold morning and Bazeley and myself lay in blankets talking for a long time until our batmen brought in our dinner. We got up about 9 and thanked God we were not in the trenches with the rest of the Battalion. It started to rain about 10.30 and continued steadily after that. The long strings of mules with packs of rations and ammunition continued to pass as usual the drivers muffled up and miserably soaked to the skin. Sledges were in use across the mud flats instead of limbers. Lines of mules in a transport line opposite this tent – standing dejectedly in the cold and slush. The guns take no holiday on account of wet but fire as usual thus adding to the discomfort of Fritz. He does not send back 1\/6th of the shells we fire at him and in this respect operations here differ from those at Pozieres. Our tent commenced dripping having become quite saturated. \"God help the poor devils in the trenches!\" From here I can send telephone messages right through to the CO. Delville Wood has great festoons of wire from tree to tree and in places posts carry dozens of artillery wires. Many are old broken ones. All across country wires (mostly D’s) lie on the surface and trip one up if not heedful of them. Hogarth and others reported back in the afternoon and set off for the trenches. Heavy continuous rain set in. With a brazier we managed to get comfortable. Hunt returned from A1lbert with no better results than two French newspapers. In spite of the tempestuous elements our gun fire showed no slackening. No shells near us here.\n\n \n\nLongueval or Delville Wood","59":" Slept well and warm and got up about 9 am intending to go up to the trenches but Major Mal. Smith dropped in to live at our place and told us that the Battalion has moved to a new place further forward and that poor old McCormick was blown to bits last night. Head arm and a leg blown off God rest him. Very cold all day but mostly fine. Stayed in & wrote letters and read. Our planes active all the afternoon but much in trouble from the wind flew like wild fire before the wind over the enemy’s lines but had to slowly battle back against the wind so slowly that at times they appeared almost stationary and so afforded a good mark for anti – aircraft guns. There have been about 3 heavy stunts today in the artillery line besides an incessant steady undercurrent of rumbling. Mud remains bad and mules passing are thickly caked with it and their tails appear almost solid. Gas balloons up late in afternoon when the wind had dropped. Fierce and continuous bombardments all night and a few shells landed near us. Taubes active and flew all over us. \n","60":" A good warm sleep. Great air fights this morning in a bright blue sky. Many of our Planes and Taubes up and much bombarding by anti-aircraft guns. Our planes avoid the Taubes and seem to leave them to the guns. Muddied all or tents. Poor tired exhausted devils started staggering in all covered with mud and full of tales of hardship from the front line. Many dead from heavy shellings sustained there and some men fell and lay in the mud too done up to proceed further. Made tea and dispensed rum to the poor chaps and made arrangements for tentage. The aircraft of Fritz is looking up and doing good work. Dead lying round everywhere.\n\nDelville Wood 9\/11\/16 The Taubes have had our airmen well and truly bluffed and have been running rings round them all day. The night was bright moonlight but bitterly cold and inclined to be frosty. Fritz did one stunt with his artillery but on neither side were the guns as active as last night. Slept fairly well on an ambulance stretcher but the guns were disturbing. \n","61":" Awakened by 3 or 4 23rd officers arriving absolutely \"dead beat\", and found that after being the front line (which even hardened veterans describe as a butcher’s shop) for four days they are being sent back here for a rest. Only handfuls of men arrived the others falling by the way, being evacuated sick etc. The poor devils were nearly out of their minds and some were rambling and could not speak coherently. Feet were awful once boots were taken off it was impossible to put them on again on account of the swelling. So those men who complained we walked right over to the Field Ambulance and handed them over to the doctors there. One case was awful the swellings extended right up the thighs and it was said to be the worst case of trench feet seen so far. The spectacle of that shining light of Melbne University Mr R E Hain barrister & solicitor sitting on a box scraping mud off trousers and boots with a bayonet giggling sillily all the while nearly insane with exhaustion would have been an eye opener to some people of the horrors of war. Pasco and another lad though tired to death couldn’t sleep for thinking of the things they had seen so we doped them heavily with fiery rum which is mostly methyl alcohol and burns the very gizzard out of one. A fine day with warm sun and the Taubes are over once again with our \"archies\" potting at them. The way our aeroplanes dodge them makes me think that they must have superior machines in speed and armament to their previous ones.\n\nDelville Wood 10\/11\/16 About 11.30 am a Taube came over and a fight ensued with one of our planes. The anti-aircraft guns also got going and presently the Taube crashed down to the ground from a great height one of its wings coming down after it. After lunch amid great cheers from the men another plane was seen to fall from where a fight was going on but recovered itself before reaching the ground and flew away. This, however, was one of our own and must have had a sideslip. Aeroplanes fire at each other with Lewis guns and the sound is a \"bubbly\" rattle. The report of anti-aircraft guns is also different from ordinary guns firing having a hollow sound. At sunset the enemy put several shells round the camp but hurt nobody. Our observation balloons are up in scores and very close together. They are sent up in a kind of echelon covering one another off. From sunset onwards a most deadly and uncanny quiet set in, an absolute silence taking the place of the usual rumble and roar. It was eerie. The chaplain turned up mud up to the waist and we are putting him up. All blankets came out today and I have laid in reserves of rum, sugar, tea and biscuit with some pork and beans to set up any poor chaps who dribble down. Trench feet are our curse. Orders are issued that men must change their sox and rub feet. How can they do it up in front when a man can’t sit down. Covering the feet with whale oil is the only preventative. Hot beef tea was served out after dark and all here are quite comfortable. A plane went across about 6 and shot a flare across the sky, our searchlights tried to pick it up. The deadly silence of guns continued until long after midnight. Heavy reaper and binder rattle of some heavy air machine. Things were very quiet on the Western Front. \n\nDelville Wood 11\/11\/16 At 4.15 am a heavy and intense bombardment commenced and continued until dawn after which the usual rumble and roar kept up all day. An air fight took place while having breakfast. With the Padre went across to the 6th Field Ambulance and found many sick being evacuated. Their tents are situated on a rise lined with many guns. This morning a shell killed young Thomas brother to he of the and while there they buried an officer of the 5th Bde. his head a mass of bandages and an ugly blood daub remaining on the stretcher. Heavy guns all along this ridge – their shells resting behind them. Got onto the road which was muddy and crowded with traffic and pushed in to Delville Wood. Soon came to an open piece of ground covered with dead men. They lay as they had fallen in the fight. The first body was that of an officer evidently a platoon commander, his cap had fallen from his haversack and lay alongside. Only a few bones and shreds of skin remained in his clothes. All round lay the bodies of men in their full equipment the corpses covered thick with dead black maggots like rat dung. The steel helmets were still on the heads being held on under the jawbones by the chin strap. Turning over one helmet a complete head covered with dark brown hair was found inside it. One head was lying shrivelled up some distance away from its body and in the centre of the parting in the hair was the neat little hole which showed where the fatal bullet had entered. One man appeared to have been almost divided in two as his breast and the front of his body was there but back of body and thighs were missing. Several skulls were lying there quite devoid of any flesh or hair as if their owners had been dead for ages. We remarked how Nature is her own scavenger. There was a man who had been cut in two by a shell. He lay on his back with all his equipment still on him. Out of his own body as soon \n\n \n\nDelville Wood","62":" as life had flown had come hundreds of little organisms which working silently had set to work and completely eaten and destroyed all the soft parts of the body, and, their work finished, these little black maggots lay dead themselves thick all over the corpse. There was no offensive smell and all were slowly sinking back into their Earth Mother. Noticed a German field boot on a decaying leg and also a field grey overcoat riddled through and through. The way the many bodies lie should say that the men were attacking and had to pass through a barrage. They lie where they fell. There was very heavy fighting in this same well named \"Devil’s Wood\"! Men live, work and have their \"bivvies\" in among these sights. Very many hard at work on road scraping and construction. Coming back we walked overland rather than by road and stood in one elevated place watching our big guns in action long tongues of flame leaping from their throats. Returned to camp and had lunch. The Germans started a stunt pouring in shells on the right. Our people responded. Out of surplus rations I have accumulated plenty of tea sugar – nearly 90 lbs of sugar @ 6 per lb. How the army is fed up at public expense! A heavy fog came up about 4 pm and brought night conditions as its companion. The temperature shows much warmer weather conditions than the last few days and although we had a roaring red coal fire in a brazier, it was left to waste its warmth outside. Shrewdly suspect that there are some dead men a very few inches under our beds as the ground of the tent floor reeks with a putrid stench when dug up. Turned in and went to sleep before 8 pm but was awakened by stray men stumbling tired into camp and cursing volubly – what a world of comfort the soldier finds in the letter \"f\" and how the sexualisation of conversation acts as his safety valve! Comparatively quiet night. \n\n \n\nDelville Wood","63":" Colonel Forbes was here early and arranged to have a yarn at 3 pm today. Dull misty moon with considerable artillery activity. Most unpleasant smell pervading the tent we have regretfully come to the conclusion that it is pitched over some corpses and that we are sitting on top of some dead bodies. We lazily decline to inquire too far into this as we might have to shift the tent if we found such to be the case. The Brigade Major rang me up before lunch and wanted me and the company here to move up \"toutes de vite\" to the front line. Issued orders and commenced a hurried packing up and was just about to start when he rang up again for me to remain here but for all the men to go ahead. At 3pm all the officers save Fraser and Anderson, and all the men except some sick, pushed off and left the tents empty. As yesterday a fog came up before dusk. It was pitch dark at 4.45 and a very heavy and sustained bombardment then commenced. Rumoured that the Scotch did a successful advance and that our 5th & 7th Bdes have a stunt on the 14th inst. About 6.15 pm the Germans commenced violent cannonade evidently a counter attack and our guns replied. We are nearly stunk out tonight by the smell of dead men buried in this tent. It permeates everything and the stink seems to hang in the air in gusts. We shall shift the tent tomorrow. \n","64":" 6.15 am Intense and sustained furious bombardment for ½ hour along all our front here. Furpheys. (1) That on 23rd Germans have requested armistice and are retiring into their own territory!! (2) 7th Bde going direct to Marseilles (3) Guards marching up to take Bapaume (4) 3rd Div. retained in England under orders from Australia. Colonel Watson leaves for England and Fitzgerald takes over. Foggy day.\n\n Delville Wood","65":" At 6.45 an intense bombardment took place and it was rumoured later that there had been a hop over. German retaliation was heavy. Poor devils are probably out there now digging hard to get some sort of shelter from the shelling they must inevitably get. The wounded from the unsuccessful stunt of 2 days ago are probably many of them, still lying out in the cold and desolation of No Mans Land. It is a raw cold day today and the air is full of the smell of gun smoke and the odour of explosives. Furphey (1) That we shall all spend Xmas in England (2) That Plant and Gellibrand are leaving us (3) The Scotties are in a village to the left of Bapaume (4) That this mornings advance was on a front of 4 ½ miles (5) That 36 Zepps raided England and caused 2000 casualties- 6 brought down. (6) That we have made a push on a 13 ½ mile front and taken Beaumont Hamel and 3000 prisoners. All the morning there has been great artillery activity and constant rattle of machine guns. Our wounded are passing through and seem to be in support to the attackers last night. It is rumoured that the AWO left battalions reached their objectives but that the 25th is having a great go with the Prussian Guards. 60 prisoners so far. Shortly after lunch a bright flaming object dropped from the clouds and fell to earth and our anti aircraft guns came into action almost at once. Colonel Forbes said it was a Taube shot down. Went over to the 6th Field Ambulance and found them shifting camp having been well shelled all round during the day. Good many stretcher cases lying round on the ground and walking cases plodding through the mud down to the motor ambulances which were drawn up in long rows. Found the padre near the cemetery and had a look at a dead boy there- Gunner Crawford all bloody and torn with mud in his matted hair. Only 19 he looked too young to be dead. Buried him on the spot without a blanket for shroud even.\n\nDelville Wood 14\/11\/16 Some men very badly wounded and shell shocked. Came away as a splinter of shell plunged into the mud alongside. Very heavy shells falling and in the dull afternoon their bursts showed up like fire. A heavy battle raging. Returned to camp and was called up to see Forbes who attached me to Divn H.Q. to represent the Bde. All men in the camps were organised and left under cover of the dark for positions in close support. I remained at D.H.Q in the dugout of the Signal officer. Livid gun flashes after dark denoted a slightly slackening battle. Keeping communications going is a big job. Linesman out patrolling their wires. Heard that Brigadier General Beresford has been killed. Fritz had some sausage balloons up today and our usual echelon plot was also up. Forbes left at 5.45 pm and handed over to me here. A day of great battle and extremely hard and bloody fighting. The flash of an 18 pounder is most noticeable at night and lights up the whole surrounding locality for the minute. Found it very useful in illuminating the narrow duck boarded path round D.H.Q. Slept in the top bunk in the dugout, the Signal Sergeant below and spent a good night.\n","66":" Returned to own camp at 7 am. A bitterly cold and raw morning, a wind that cuts like a knife, and slight traces of ice on the ground. Padre turned up and told us Major Nicholas had been killed going up last night. Poor old George. DSO and just married. Cut almost in two. A cold night for the wounded , some had to lie on stretchers for 4 hours. Young Abdul (Quinn) had an awful wound in the leg and was very low. Head wounds bleed profusely but when washed generally disclose only a small puncture. Anything large results as a rule in an instantaneous death.\n\nDelville Wood 15\/11\/16 At about 11 am a Taube came over and dropped a bomb and soon after we heard a shell scream over. It landed right in a tent and blew it to ribbons and also blew to pieces three officers of the 20th Batt. Captn Rush Lieut Gavan Duffy and another. A fourth was quite mad with shock from the sight of his mangled comrades. Comparatively quiet morning on the part of our guns - probably because we are replenishing our stocks of shells. Fritz pounds away all the morning. We cannot find out how things stand up there. \"C\" Co comes out tonight and I am arranging for each man to have a nip of rum, a drink of hot tea and some stew and a blanket as soon as they arrive. Bazeley came down early to complete arrangements. Being very cold stayed in blankets reading most of the day. A few shells came over during the afternoon. The one that landed this morning cut two officers completely in halves and scattered pieces of intestines and limbs for a hundred yards round. An awful sight. P.J. Thorn wandered along about the gloaming having been in Egypt ever since the Gallipoli days. Heavy cannonade about 5.30 pm and many gunflashes. Things appear considerably mixed out in front and losses heavy but our people are doggedly hanging on. Gas barrage was put up on our Flers Tr. this morning but without effect as the percentage of duds was high. Two men Quinn and another were killed by direct hits. Sent two of the old birds on leave to England this morning one of them was \"J.C\" so called from his celestial bearded face on Anzac. Today has been intensely cold. Turned in early. \"C\" Co. 80 strong (out of 139) marched in during the night and had a hot meal and warm bed on arrival. Some shells landed close round during the night and adjoining camps had to be vacated by their occupants. It froze hard. Leave men returned – ports closed. \n\nDelville Wood","67":" A cold and frosty morning with about an inch of ice on all water. Bright sunshine which favoured airwork and the Taubes soon came over bomb dropping. Beaucoup bombardment by \"archies\". The Taubes are coloured white and are very hard to pick up. They favour high flying and sudden dives of about 1000 feet when the shells burst too close. A few black woolly bears in among the many white ones. Doley and his men are all tired, worn out and fed up but we hope to get them cheery again with warm food and some sleep. Eating bully beef and biscuit with dead men lying all round is not very nice. The enemy put a few shells round the road but up until dark things were quiet. Furphey. That this is to be Anzac front for the winter once we have taken the ridge overlooking Bapaume. That leave for men is being revised on an enlarged scale. About 11 am a Taube turned turtle and fell behind our line in rear of Flers. Many sausage balloons up but the guns remained quiet. Darkness sets in at 4.30 pm. Very cold night.\n","68":" Intensely cold sunny day the ground frozen hard and ice an inch thick. Icy wind. We feel the cold very much and sick rate is big. Never since leaving Melbourne has our esprit de corps been so bad and our morale so rotten. Constant hard work and heavy losses without any leave to the men or any other alleviation of their monotonous work has made them all quite fed up. So many new men who are not known to their officers affects our fighting efficiency. Our old chaps could do wonders – until we get these new men by themselves and train them hard they will never do any good. They don’t try to stick it out and and readily get lost & fail to reach their destination if sent off anywhere. The ground is frozen today and thick ice remained all over the pools and shell holes all day. It was quite impossible to keep warm by wrapping up so I gave it up and retired into blankets before lunch. At about 3 pm Brigade Major rang up with orders\n\nDelville Wood & Frontline (N. of Flers) 17\/11\/16 for me to take command of the","69":" Battn with Captain Elwood as Adjutant and move with a full fighting company and 4 Lewis guns to Bde H.Q. there to pick up guides for the front line trenches. Packed hurriedly a few things and got over to 24th H.Q. and had a bite of tea and set off fully laden at 4 pm when it was growing quite dark. The men followed behind having been recalled post haste from fatigue work and the poor devils were very tired. Pushed on through Delville Wood and soon struck the duckboards and reached B.H.Q who are located in a set of very fine 30 feet deep dugouts. The interior looked like a commercial office with telephonists and others and the General was sitting there in a sheepskin vest and gave me my orders. With aides went across to B.H.Q and found them similarly located and then commenced to go up to the front line mostly to my surprise by very fine trenches. Usually impassable on account of mud they had frozen hard and the going was quite good. We fell over many times but plugged ahead and soon came to a place where it was necessary to freeze into stillness and from here on we encountered the brave dead lying where they had fallen. Eventually we plunged into a trench and found the 27th Batt. H.Q not at all a bad dugout and Col. Slane was there. The digging of a new trench by his men was in progress and I did not take over until this was complete some hours after. A Corporal shot through the eye was our first wounded and the Engineer officer was next shot through the back. The enemy are 40 yards from here and their flares fall well over us. A few shells kept whining overhead but on the whole the show was fairly quiet. Snatched a little fitful sleep. Sigs in communication right through to the General. They are good lads & it’s fine work.\n\nFront line (Flers) 18\/11\/16 Snow fell about 3 am in powdery flakes and covered the trenches in a coat of whiteness. Ferguson moved off about 3.30 for his new position. At 6.30 a very heavy strafe started on our flanks and enemy pumped much stuff past us – some rifle fire and machine gun tick-tacking but nothing doing on our immediate front. White flag has been most extensively used by us to bring in our wounded from No Mans Land – the aftermath of a recent charge. The snow remained on the ground nearly all day and looked like coarse frost – the thaw setting in everything became mushy and sloppy. The poor devils of men – their hardships make one’s heart bleed. They crouch up together in the trenches huddling under waterproof sheets. The German trenches opposite us are said to be even worse than our own. Heavy cannonade in the afternoon and the earth shook with many and repeated concussions of heavy shells. Low menacing rumble extending to our right. The surrounding country is a torn and tattered mass of troubled earth in muddy heaps. The trenches and their parapets are full of Lewis magazines S.A.A. rifles equipment and a thousand and one other things. Our wires frequently cut but still communication was maintained. This dugout was built by the Germans and is of standard size, the timbers are all cut to fit and dovetail into each other. At about 3.30 pm went round our front from flank to flank an experience that was not very enviable. The Huns were shelling heavily and making the landscape take on the appearance of a ploughed paddock. The thaw had set in after the snow and the clay sides of trenches and saps were exuding moisture and making everything awfully slippery and unpleasant. Going left from Battalion HQ to reach the terrace we commenced to see dead men lying on top of the parados. How shrivelled and \"light\" a dead soldier looks as he stays sprawled out ungainly face downwards. \n\nIn Action Flers","70":" Very many gumboots lay embedded in the mud and close inspection disclosed sometimes detached legs and feet in them. In a shell hole full of water the thin white lipped face of a young dead German smiled at us in a ghastly way. On the ‘terrace’ a man accosted me and accused me of stealing his pick. Sheepskin coat, steel helmet and a coating of mud make one look anything but an officer and gentleman. 77’s and other light shells kept sniping us as we crept along bowed double and dashed across open spaces. Trenches were only 2 or 3 feet deep in places and underfoot were queer unshapen objects embedded in the mud and assuming corpse like shapes. One neat little grave had a cross inscribed \"here lies a German soldier’. In the mud and slush were small groups of men huddled miserably up together – our firing line garrison. Some had attempted to construct \"bivvies\" but others sat huddled up in pairs sitting silent. Pushed right along my whole battalion front floundering at times up to the waist in a solution of creamy mud and semi – melted ice. We could see the Germans working in their trenches about 100 yards in front of us. All rations and ammunition are carried up nightly to us. Sanitary arrangements there are none. Men use shell holes as latrines or deposit excreta upon an old sand bag and then throw it over the parapet. In short my men are in a dreadful scene of mud, pain and desolation and every inch of ground is saturated with blood of warring men. All day shells whine and tear overhead and rip further into the landscape. Days are short and the nights are long and full of discomfort to the boys. A few of them are using \"Tommies cookers\" which burn solidified alcohol in an old tin. The Australian rum we are being issued with is excellent and the genuine article. We settle down feet underground in our evil smelling crowded dugout to another night. A constant reverberation shakes the dugout & the concussion of shells makes our candle flames quiver – at a heavy concussion they expire.\n\nIn Action Flers 19\/11\/16 Awoke in the small hours of the morning after a snatch of sleep and despatched our intelligence report to B.H.Q. One of our patrols had a man hit and in the face of all practice the Corporal went in to get assistance for him. The Corporal is now missing and must have walked straight into the German lines near the maze. He may have managed to get into their trench alive. Went out just before dawn to the terrace and found the trenches in a shocking condition. The feet sink in at every step and one needs to be strong to get along. At times I sunk waist deep in the mud and cold water. Every time one puts a hand out it is felt to be nearly frozen by contact with the frozen or thawing ground. About 10 we had a little excitement when a man burst in and reported that the Huns were only 20 yards in front of us and digging hard. Someone else reported seeing them at work and looking across at us. The latter part proved true but the other was much exaggerated it being the same rough 100 yards away that we have been cognisant of all along. Put extra men on sniping hard at this work and also Lewis gunners. Considering the desirability of applying a few Stokes mortar bombs and sent the mortar officer down to take his angles and targets. An officer of the Lancs relieving us on 21st arrived and went round the line. He and an artillery liaison officer who arrived later were quite exhausted by their travels. At about 1.30 pm a pleasant faced English boy officer arrived with proposals to blow Fritz about with 60 lb bombs. We evacuated portions of our trench to let him get to work and he \"dinged\" the people opposite quite well and knocked a lot of their work about. In the retaliation the bomb Corporal was wounded in the back. Otherwise things quiet. These conditions of active service where telephones cannot be too extensively used, have given rise to a new and very fine product of our Army. He is the runner. Picked men from the companies they are used for all sorts of odd jobs. Carrying messages from Battalion to Coy. H.Q guiding rations to other parties and reliefs.\n\nIn Action Flers 19\/11\/16 These boys are invaluable and by the very nature of their work they should be chosen from among the bravest of the brave. Most of our military medals and other decorations are gained by these chaps for fearlessly carrying on under fire and traversing barrages etc. They are usually exempt from all fatigues and a portion of the drill they hate so much and in action, wear a red brassard. They fancy themselves very much. To tell an outsider that they are \"carrying despatches\" is to state a very proud fact. An old overturned \"Tank\" in rear of our lines is a great draw for Fritz’s shells. He expends salvoes on it. In the heavy barraging the smell of picric acid becomes very intense and fills the nostrils. Signallers jargon Runners guided in the new people relieving and had a quick entry. The journey exhausted many of the new men coming in and they fell in the mud. Two had to be dug out. Early in the evening a man came dashing over our parapet from No Mans Land and jumped into our trench. The sentry nearly had 6 inches of steel into him before he could say that he was an Engineer officer who was plotting out a new sap to the left of the Maze. Our rations have been coming up in sandbags and arrive sodden with the wet. No water having come up tonight I arranged for some men to go out with petrol tins just about dawn and collect water from the shell holes. Pte. Fraser got a bullet through the brain and would probably die before reaching the M.O. Hard work getting stretcher along the trenches. Runners all perch at steps of this dugout – their talk is very funny. What experiences some of them have had. Gallipoli Lemnos Egypt France and hard times and bloody in all of them. One chap said \"My mother would cry blood tears if she could see me now. Wet sox and wet skin and been so for days. Very delicate at home pleurisy but was never better than at present. At 10 pm went out to see how relief was going. Poor wet boys struggling along dead beat lacking strength to pull one foot after another. Done to death my heart bled for them. I am certain some will drop on the road.\n\nIn Action Flers","71":" The men out digging the next trench in No Mans Land had a rather exciting time but working in the shell holes they managed to avoid casualties. The enemy evidently thought we were coming at him and sent up a cluster rocket and opened a barrage behind the portion affected and kept it up for 15 minutes. Otherwise the night was a comparatively quiet one. The new men and their officers were all busily engaged groping round and trying to make themselves at home. Stayed awake all night but managed to get a little sleep from 6 until 10 o’clock when liaison officers in distress commenced to drift in upon us having had great trouble in finding their bearings. One was an English chap and his disturbed tones and general out of place appearance would have been comical if the whole thing had not been so tragic. This morning men went out collecting water from the shell-holes and we found it fairly good but impregnated with chemicals –phosphorous etc. So much explosive has been pumped into the ridge opposite that all water drained therefrom is all tainted in taste and a little unpalatable. A Bosche shell landed on top of our dugout and the concussion put out all our candles. In the front line a piece of shell caught one of the runners just above the heart and left him very sore. The spirited lad stuck it out without complaint. They are all dags. \"David\" is one of the leaders of them. Heavy cannonade about 7 pm. Mud awful and dreadfully sticky just like glue. A man pinked just through the arm and dressed in this dugout. Huns belting hell into our old tank and making it decidedly warm round there. Only just putting ones head outside the door is sufficient to ensure getting quite a mud bath. Attempted to scrape mud off boots with a knife. Clothes quite stiff with mud both inside and out and I am most horribly lousy and creepy all over the \n\nIn Action Flers 20\/11\/16 What delight to get a clean change and a bath. In the evening about 10 our rations and plenty of water arrived per carrying party. Fellows chatting in the dugout and the talk the whole evening was of shells big and small, of operations and stunts, of men getting killed and wounded and of the dead men out in front. So absorbed is every mind in the war game that very little else enters into our conversation. Heard tonight that young Camp had been killed. Tomorrow night we look forward to being relieved by the Royal North Lancs and after returning to our camp at Carlton Trench we entrain for Dernacourt. Many of the chaps will fall by the way before we reach that camp I am certain. For food we \"pig\" it eating bread and jam Maconachies with any knives or forks about. Food rations arriving for the boys tonight – plenty of food and water for each and some solidified alcohol for the Tommy cookers. We all have about four days growth of whiskers on and are generally unwashed and unkempt. Sleep in old blanket or two with wet mud off boots, pieces of food and God knows what underneath. Our aeroplanes buzzing over tonight. Fritz has put thousands of shells the last few days into the ridge just behind us until it is just like a torn up heap of dirt. All these shells are wasted as only a few lone m.g.s are located there. The weather has much improved and things are not too bad in the trenches now albeit sticky & slushy. Our phone wires cut again by shells this evening but the fault was soon located by the linesman. We also ran a branch line out from my dugout to that of our excitable friend the English liaison officer. Our runner was out with him when the bit of shell over the heart laid him out. Liaison remarked \"never mind its Blighty for you\". Runners reply was characteristic. \"B.. Blighty\" and he stayed on here to avoid being sent away. \n\nIn Action. Flers 21\/11\/16 Got a little sleep after 11pm but was not allowed to slumber long without some interruptions. The situation continued fairly quiet but just before dawn Fritz went quite mad evidently anticipating an attack. He sent up many signals to his guns and put up a heavy barrage behind us pumping hard also into the unfortunate ridge. The morning was frosty and the mud positively as tenacious as glue. Flares fell well over us, one nearly dropped on our dugout here. No more digging was done last night on the little trench commencing last night and I do not propose to start any tonight either in view of our relief. Rations appear good and all satisfied today. Am sending Lieut Rigby out in charge of our guides to lead in the new people. The glimpse got from our trenches towards Bapaume is a very pleasant one – nice green fields and pastures delight the eye. Much different to the desolate waste behind us. Furphey that our heavies have knocked down the clock tower. Sig jargon..\" emma e.as pip emms 10 words 20th three. Our bombing post spotted 3 enemy snipers who had crawled out from their trench during the night. They were only a few yards from our men whose presence they did not realise. Arranged to let the post withdraw a few yards at dark and then drop some bombs on them. We heard that Fritz had been seen moving along a road a half mile or so in rear of their trenches. As a thick fog was on we surmised there would be a fair amount of traffic there and got our batteries on to it. They will tickle this spot up during today. Quite a feast this morning – some petit- beurre biscuits and cold cocoa and the English papers for the 17th. Not having had clothes off for some days now I feel very crumby. Another liaison officer arrived to relieve our friend Hart and it amused our Australian \"dags\" to hear the affectation of their speech. You can make no greater mistake than to despise a man as a nincompoop for these little national characteristics so different to ours. Very often \n\nIn Action. (Maze & Bayonet tr. Flers) ","72":" the fellow with the monocle is one of the best and for decent chaps you would have to go a long way to find better than these English officers once you know them. Having a suspicion that Fritz had started a new trench in front of our right I went up to have a look at it. Found the trenches much improved by the chaps digging. Particularly in the sap down to the terrace there a party had much improved it by knocking in the sides and covering over a lot of things that formed the bottom of it. Shrewdly suspect we would find many dead men hereabouts. Two lying up on the parados. One in his sheepskin vest lay face downwards. Slightly bald on top I arranged to have some dirt thrown over him. At the entrance to this Maze it would be an easy matter for any one to walk straight on towards the hostile trenches despite our bomb stops. Memo:- To get a Stop! Look! Listen! Board put up here. Continuing found the boys all happy (quite a contrast to when the weather was bad) and working away improving things. Now and then a pair of legs sticking out denoted someone buried. Rounding a corner we saw a funny sight. A fog which concealed objects 100 yards off enabled some movement in No Mans Land and lying down beside a dead German just as if he were kissing him was one of our lads. He was methodically rifling the dead man. All he found was a gas mask and greatly bewailed the fact that he was \"too ripe\" to permit going through the inside pockets. (Reminds me of an incident at Pozieres. A dead man had a belt on him but was much bloated. The boys hesitated to undo or cut the belt but eventually compromised by letting the gas out by puncturing the stomach and then undoing the buckle). One of our dead boys lay on his back on the other side his glazed eyes looking up to the sky and a wound in the throat being the fount of a purple stream down his clothes. The ground all round here, as we stood and quietly looked round under cover of the fog was one churned up mass of shell holes – not a blade of grass in sight. Some trench wire out in front of Bayonet trench.\n\nBayonet Trench Flers 21\/11\/16 Our line hereabouts most irregular and twisty. Out in front our dead lie thick – hundreds in trim rows just as the machine guns mowed then down. Poor boys! Back across country to the terrace. Rifles and spades used to mark the track. The old tank lies in the midst of a storm centre. Special attention is paid to pasting its vicinity. a grave here with a small cross made by our chaps \"Here lies a German soldier. We bear no enmity against the dead!\" After tea (which consisted of nothing else but nothing to eat and a cup of cold cocoa) our old friend the Company Commander of the Royal North Lancs. turned up and went into details of the relief with him. After that our English liaison officer also turned up and we spent a very pleasant evening yarning with two of the most decent English officers I have ever met. Royal Lancs. was an old Mons veteran who told us tales of the great Retreat and some stories of Hun atrocities and Liaison was a Gallipoli veteran of the 29th Div. Splendid chaps both of them and genuine sports. The enemy shelling was normal and one shell landed right in the middle of a crowd of the Tommies but hurt none. The relief was a hell of a muddle the men arrived few in numbers and quite done to death and exhausted. Some fell in the mud and lay there with their guns near the tank quite out to it. Due to bringing them up in gum boots which tore all their trouser buttons off and tripped them up every step they took. \"Sandy\" another young officer and \"Davis\" both decent chaps came in quite speechless with exhaustion and nearly crying. All my officers out helping things and in short, merry hell everywhere. 10.30 pm. I hope to get things a bit straight soon parties seem to be getting lost and rambling about all over the place. The enemy is very silent and it is suspected that he is also on the same game. Let’s hope he is in as big a fix. Issued orders holding all the men out on the terrace so in the event of trouble there is a reserve but at present there are a 100 yards of trench without a single man in it. Spread their men out as well as possible and made a sort of chain along the front line.\n\n \n\nBayonet Trench Flers","73":" Midnight came and we kept finding men shorter. Some poor devils were absolutely done and had to be dug out by \n\nour chaps. Others were barefooted having lost their boots and four were gathered up wandering round No Mans Land. A hell of a mix up. About 1 p.m. we reported \"relief complete\" and were just moving off when we found a Lewis gun crew not in position – the men utterly exhausted were lying round in the mud inert and helpless. Arranged to have them left in reserve. Pushed off about 1am through a little barrage the sap was like glue and I had fallen down and commenced panting before reaching the terrace. We went like hell past the tank to avoid the fate of the many dead men lying round it and I was slipping and sliding and cursing and so physically done up that I was struggling like a drunk. Reaching a place a little further off we eased up and only had a few shells round us. There was a fog and we soon lost our bearings in spite of our expert guides. Compass was useless and there were no landmarks. Going Heavy. After much wandering we struck a tram line a long distance out of our way and plodded along it. The fellows soon commenced to knock up and fall out but I did not mind as they could easily come on along the rails later. The shells landed close round us and fortunately the wet ground caused many duds. It saved our lives. Reaching one secluded spot I gave permission to smoke and instantly regretted it for they turned a battery on to us.\n\nThe wet ground again caused duds and saved us. The road seemed never ending and we were all just about done when we struck Delville Wood and the road. The latter was awash with about 6 inches of cementy mud through which we waded getting soaked all over with it. We turned into where we thought our camp was but could find nothing owing to the mist and we wandered round miserably until dead beat and done. The sound of chaps lost calling out came from all roads. What a filthy exhausting life. It ended up in us all tired and worn with fighting dropping down exhausted in the mud and lying there in a frost until dawn had come. It came still with a blanket \n\nLongueval – Fricourt 22\/11\/16 fog and we resumed wandering again but could not see more than a few feet in front until we struck the road when we made for D.H.Q and got a guide. He also lost us and last we reached the camp. Frew took over command of the 24th Battn from me and after breakfast I went over to my old tent and found them all cleared out. The next spasm was to walk to Fricourt which makes about 30 miles I covered on foot altogether. Pushed on along the railway line and eventually staggered into camp covered with the sweat of faintness, 4 days growth of beard and inches of mud. They gave me some whiskey and soon made me feel better. In huts again. Slept after lunch and then walked down for a hot bath which was a shower and lovely. Found one of my kitbags has disappeared and roused up all concerned. Plenty of letters and papers now here and a degree of comfort. We talk over the battles we have fought and so on and I must say that the last 24 hours have been about the most strenuous ever experienced by me. Everyone very much engaged in letter writing and glad to be out safely from our second bout in the Battle of the Somme. The mud round here is also very bad and quite an army is ever working on the road sweeping and mending. Dark early and a cold evening followed. Very rarely have been as dog tired and weary as tonight the last 24 hours has indeed been most strenuous. Every muscle had an ache but it was not long before we all were fast asleep in our valises. It is delicious to get into pyjamas once more. The men appreciate this rest and change. The night was intensely cold but I slept as snug as could be. \n","74":" Breakfast in bed. Shaving involved the removal of long black bristles a quarter of an inch long, the growth of these last days. At 11am turned out smart and clean in best uniform cap leggings and spurs.\n\nFricourt &Dernacourt 23\/11\/16 An orderly had my new horse outside. A smart looking little black mare. With the Colonel rode along quite good roads to Dernacourt. Stricken woods and shell scarred earth are being prepared for human use again by the kindly restorative acts of nature with her green-leaf clothes. At the edge of Mametz Wood is a very large trim cemetery with neat rows of crosses and permanent caretakers. A lovely sunny morning. A Taube flying above was shot down by our guns. Passed through Mealte where the Welsh and Grenadier Guards were in billets. Every man was spick and span with dazzling buttons and neat fitting clothes. Saluting was most punctilious and one’s hand wearied performing them. The German NCO’s in charge of working parties also have to salute officers. Some of these Huns are fine looking chaps. The little tail pockets are a characteristic of their tunics. Reaching Dernacourt we went to Bde HQ and had lunch with the General and after that went to 23rd. Found Jack was at at a school some distance away. Sent cable home saying we were quite well and fit. The village of Dernacourt is about 5000 & has an old church bearing date 1733 - a white stone place. Returning via the same road we made the pace and found the Guards had an excellent drum and fife band parading in the traffic. More strenuous saluting!. Some fine tall men in these regiments. Road fairly free from transport. Orderly carried 40000 francs drawn for pay tonight and Bde. Xmas Cards had also turned up. In the evening wrote up the War Diary covering all our operations. Our casualties 5 - 21st\/11\/16 and killed 48 wounded 153 sick. Quite a comfortable mess here with the MGO Sig. officer & Bomb officer in addition to our usual small family. Bugles sound last post.\n\nFricourt ","75":" Dr James received orders to leave for Rouen and Dr Springhope reported in his stead. Slept in until late and then arose and dressed in my purple and fine linen. A chill grey day. Read and wrote all the morning. Big lot of comforts for the men came to hand including a new phonograph and records. After lunch wrote more letters for King to post in England and then set off with Colonel to walk to Pommiers Redoubt but we found it was too far away for us and returned. Nature is restoring this country to a peaceful aspect the hellish Mametz Wood is growing a thick underbrush and green shoots are springing from every lopped tree. A grass carpet covers the scattered shell holes. Colonel received orders to report to Bde H.Q with his kit so I take command again. \n","76":" Cold grey day with some showers. C.O. went to Brigade. Issued orders for a move to Dernacourt tomorrow at 10 am. Parties at work building new huts alongside others here. 68 men on sick parade this morning on the bluff stakes with the new doctor. Sent 20 out to join up with the working parties. In the evening the C.O gave a dinner to the officers and the \"bats\" served up a good turn out. Hors d’oeuvres, soup, fowl, meat, sweets, dessert liquers & cigars. A merry crowd. Only 4 of those who left Melbne survive all the rest were new faces – rather pathetic to we old hands. All fresh and full of enthusiasm. From tomorrow hope to be able to send 45 men daily to Amiens on leave and to bump an increased number to England. Much heartburning about leave – it is inadequate men never get a break in the monotony.\n\nDernacourt","77":" It was raining heavily early and continued until just before we moved out of Fricourt. All hands got to work early to leave the huts clean. Set off in companies at 300y interval for Dernacourt. My little horse very frisky and smart but easy to ride. Road as usual crowded with all kinds of vehicular traffic and very busy. The German prisoners struck one as being exceptionally ugly but their NCO’s (who salute smartly) were alert and brisk looking. Our Guards were thick in Meaulte and always turn out smart even on the dirtiest fatigue. Our billets at Dernacourt were close and uncomfortable and all the Headquarters officers had to share one small room between them. Padre Campbell (24th) stayed to lunch with us & being Sunday our Padre had a service in the afternoon. A poor uninteresting village this all muddy and with very few inhabitants. News through today of bad days in Roumania – the Germans seem to do what they like. After tea had all the Company Commanders down and had a talk with them about different points - chiefly the appearance and smartness of the men. They get careless in dress and speech & very familiar with officers as they come so much into close contact with them in the trenches. Laid down a programme for tomorrow. At Orderly Room took a summary of evidence against one of the old original men on a charge of desertion. It is very noticeable that more men are deserting than formerly – generally good men too. The old head has been through every stunt and seen his mates blown out each time and at last his nerve fails him and he disappears until after the battalion comes out. A heavy penalty is then his. Pathetic!\n\n \n\nDernacourt","78":" Morning parade 9-11.30 was devoted to cleaning up – haircutting, shaving and washing of new clothes to take the place of worn old ones. It is a source of great and deep dissatisfaction - this issue of tommy tunics to our men. Naturally their national pride rebels at wearing the British uniform when we have a National uniform of our own. Rightly or wrongly the Australian soldier looks down on the English tommy as a being inferior to him not only in physique but in intelligence also. Having these tommy tunics foisted on us we try to make the best of it by cutting off the bright buttons and sewing on bone ones. The men only two willingly do this, and some also try to manufacture a belt but it does not add to the appearance. Fortunately the old slouch hat saves the situation. By lunch time the chaps were losing the exhausted and dirty \"trench\" look and becoming quite smart. The whole battalion is being bathed at some big baths on the Meaulte road. After a nice sunny morning rain clouds gathered after lunch and it became very cold and bleak. Except for a visit to Bde HQ remained inside all day and went into the completion of establishment in regard to our specialists. Made bombers, gunners, signallers, pioneers all up to full strength and, of our depleted coys the QC’s have very few available men left. In the evening Col. Smith came round and after an evening devoted to argument and writing sought a chaste and virtuous couch at an early hour. English leave has been augmented and more officers sent.\n\nDernacourt","79":" Foggy nearly all day. Busy cleaning up for inspection by General Legge. Found \"A\" Coy bad but all the other companies were good but still far removed from what one would like. Walked round ranks carrying walking stick and looking severe passing stern remarks about a little rust here and some mud there. Private Billjim gazed straight ahead like the good soldier he is , but one could see the old dear Australian \"don’t care\" look and a waggish gleam at the back of his old eye. Billjim reckons ceremonial and frill are undemocratic and not much good to him. Still \"it is the Army\" and the old chap tolerates it. I chuckled when going round to see old Charlie Sawyer’s funny old face grinning straight ahead. Had all officers up for a pow-wow before tea and discussed many points with them not the least being that of the allotment of leave. \n","80":" All up early and parades fell in at 8 am a very cold sharp morning. After final inspection by their officers at the billets all marched to a parade ground just outside the village and were there reviewed by Major General Legge. Formed up in mass with transport and other details in rear. Waiting was a cold job and I let the men pile arms and walk about. After the parade was formed up they did some marking-time and son on to keep themselves warm. Reviewed the GOC with the general salute and then went round with him. He pounced on some dirty pouch ammunition and we also found that the boots were in a very bad condition and leaky. Any other points I bluffed off hard. \n\nDernacourt 29\/11\/16 On the whole the inspection was good and he was pleased. Afterwards the Battn marched past well and I took up my stand beside him while he took the salute. Returned to billets about 11a.m. and had the rest of the day off. An inspection like this has a great smartening up effect and I noticed that the saluting in the street is excellent and cannot be bettered. Pedler came over for lunch and we had fierce arguments over duration of the war etc. Later the M.O. and self went down to a football match between our lads and the 2 Brd. The latter won. The days are exceedingly short and it was quite dark at 4pm. Yesterday we passed a funeral procession – tiny boy acolytes in little surplices and a French soldier in his kepi wearing a stole. Followed a rude cart with deal coffin and a number of French soldiers in horizon blue. Today saw the village Cure wearing a black cloak and a biretta. Held orderly Room at 5 pm but have had very few offences lately and no drunkenness at all. This village as usual is situated right down in a hollow and you are on top of it without being aware of the fact. Issued orders for move of the transport in the morning to our new area. We follow by train the day after tomorrow. Phonographs out in the billets and some gift books add to mens’ pleasure. Judged \"D\" Co to pick the cleanest platoon and chose No. . They get all leave to Amiens tomorrow – a boon much appreciated.\n\n \n\nDernacourt","81":" About 6pm the Staff Captain came round with an invitation to dinner and things at Brigade HQ were being done in fine style. The General was away but RS\ttook his place ably supported by Colonels Forbes and Brazenor. The B.M and the rest of the staff were en force and it was a merry gathering. Pope frowned down from the wall on frisky subs and a very decent interpreter while the wine flowed freely. Champagne and Benedictine were consumed with gusto and many reverend seniors unbent. Col. Freddy blinked owlishly & Dr supplied the comic relief. All carried home a mixed cargo and carefully deposited same on the gardens at billets.\n","82":" Cold and dull. Parade drill etc. German prisoners cage close by. Had to keep men moving all the time to keep them reasonably warm. Transport moved. On parade grounds watching drill it was bitterly cold. Rifle exercises were splendidly smart and plenty of drill quips. In the evening Guel’s Company (\"D\") gave a concert in the YMCA hut and it went very well. Some good talent was brought to light and everything went with a swing after some blindfold boxing bouts had taken place. Much ragtime and some good songs. The Australian soldier is a very sentimental bloke and loves to sing ballads of roses on graves death stricken hearts etc. One chap recited \"The Man from Snowy River\" very well and Podgy K’s ragtime batman ragged. A piano had been borrowed and brought down on a handcart. Altogether quite a good turnout and a break in the monotony. Reaching billets orders for tomorrow’s entrainment were waiting.\n\n \n\n \n\nDernacourt, Vignacourt & Flessells","83":" A cold clear morning which later became very foggy. All our valises and surplus gear had gone ahead yesterday but we had a motor lorry to carry one blanket per man and a little mess gear. Passed the starting point past the old church at 9.45 am and marched to Edgehill some Grenadier Guards being in front of us. Big railway yards here and much traffic on road and rail. Formed up on some open ground and sent the fellows over in batches of 8. Entrainment was done in good order and time and we set off at 12.15. About 3000 men aboard - a large train. Crawled along to Amiens. Noticed many Germans at work and also once more observed how the French always put old men on their guards and also by having a good military system they just put uniforms on their workers and the army runs the railways etc themselves and only pay the low army wage. Tedious stoppages occurred en route and then we actually passed Flessels – went past it. They detrained us some miles ahead and marched us back. That’s the Army all over – once before they took us 14 miles past a station we were to billet at and then sent us back trudging on foot. Fritz does not do these things. It was as cold as one could imagine in the train and we did not reach Vignacourt until 7 pm. Detrained and marched to Flessels. Grooms had our horses waiting. A bright moonlight night with frosty cutting air and ice on the roads. Swung along good roads and reached Flessels and good billets of which more tomorrow. Fine bedroom with sheets &other comforts.\n\nFlessells","84":" A delightful sleep in a good French wooden bed with eider down quilt. An airy large room with a sacred picture on one wall and a simple graven crucifix upon another. White curtains a wardrobe and a look of comfort. This is a large house built in the usual rectangular manner with offices and out buildings all round the yard and about half an acre of intensely cultivated vegetable garden in rear with lots of glass cucumber frames etc. Monsieur is a Government official of some kind. The womenfolk are homely and leave their wooden sabots without the door whenever they enter. The mess is a fine large room with hanging lamp and large oak table and a carved oak dresser in it. Over everything there is an air of solidity and cleanliness and no striving after outside appearances. About 10 am went round to look at the billets. This is a large place about 6000 and the winding old streets are lined with sleepy old houses. An old chateau is in the centre of our area and it has good grounds. The entrance to most houses is by a narrow gate which discloses the usual filthy farmyards beyond which is the farm door. Ice was lying thick over all the ground and we walked out of the village along winding embanked lanes to where there was some open ground. The view here was very pretty a wood dull grey and bare of leaf bounded the field. At one corner was an old, old house all gables and corners and behind still was the old village. The morning was devoted to foot inspection and to the cleaning up of the billets and the afternoon was spent the same way. \n\nFlessells","85":" Dull and cold. All the twigs on the bare trees covered with icicles which drop off and strew the ground underfoot. Marched through the village and out to a piece of open ground for Church Parade. All the Brigade was drawn up in a hollow square with a Band. General Birdwood attended. The little Padre preached well and shortly. Very cold standing there but all men had on their greatcoats and their sheepskin gloves. After the service the General presented DCMs and Military Medals to the men who have won them – a simple ceremony. French peasants passing stopped to watch the gathering. After the service the officers stood fast while the men returned to billets at the double. The General had a few words to say about care of feet etc. After lunch went with all Coy. Commanders to the Divn School – an old chateau still occupied in part by the Marquise. Dated 1740 it has an old tower of the 11th century and we assembled for a lecture by Col. Bridges G.C.O.1, in an old little hall – apparently a banqueting hall which had an old walled up gallery for the musicians. The lecture was on the \"Duties of Officers\". It was very cold for the floor was flagged. Pitch dark when we came out into the open again. Held Orderly Room – a job I hate and had to punish hard two jolly good men for missing their train at Amiens. \n\nFlessells 3\/12\/16 Some trouble today in the way of claims from people for damage to property. One dame claims 50 francs for fowls stolen and tells very circumstantial tale of men creeping out of hen yards with fowls under their coats. Possibly true and we shall have to pay but some of these folk never miss putting in a claim to every unit that comes in. Some of our chaps are rather careless and think that, like in the bush, they can go out and cut down trees etc for firewood. The Marquise is much disturbed at the loss of about 40 young trees whose growth he has been very carefully watching. At one billet the old dame is of a very amorous turn of mind and wishes everyone to sleep with her. My French is not progressing at all. Rarely do we get to a place where one can converse with the people and then do not have the time to spare. Tonight for the first time for a long while I am sitting down to read books. Generally the daily paper and tactical stuff constitute all my reading matter. In this little village I do not think there is a single man of military age left – the Army has claimed them all. How much better is the French organisation than the English! It is very hard to find the way about in this village because the streets wind most erratically. We now have 3 phonographs which are under the padre (Durshford) and in the men’s billets for their use and disposal. He also has a small organ for sing-songs.\n\nFlessells","86":" Parade 9-12. Marched as a Battalion to a little trim paddock near the station and carried on with a syllabus of drill and musketry. Specialists (Lewis gunners bombers and sigs.) were all busy on their special work. The ground was frozen during the morning but the sun caused it to thaw and become slippery. Examined some NCOs for their stripes. Same programme in the afternoon. Give the men 2 hours off in the middle of the day as it is quite dark by the time the afternoon parade is over. My batman is a great character and a great talker to his kin. At present I understand that he is running a Crown & Anchor School and in one night cleared 1700 francs. The people of our billet are very nice and kind to us and do all they can. There is a shortage of coal and kerosene at present. Most of the women go about bareheaded and wear a knitted shawl over their shoulders. This is a centre for tapestry work, like Bailleul is for lace and there are looms in many houses. Nearer the firing line the people are poorer and many houses depend for their daily bread on what the soldiers leave and what they can pick up. As we expect a batch of reinforcements tonight, made arrangements for a hot drink to be ready for them and some blankets made available. Have been so busy the last few days and the days are so short that I have not been able to find time for a look round the village. Must try and have a walk in the wood tomorrow somehow. \n\nFlessells","87":" Another dull and cold day. Fell in and marched to our compact little parade ground and carried on with musketry and drill. Nearly every man has a cold and they are like a pack of dogs barking with their coughs. Examined some of the new reinforcement NCOs and found good talent among them in some cases. Most of them are very smart musketry instructors and good drills. Some are \"deep thinkers\" and have stuck hard to their Base jobs. One chap Mills is extraordinarily smart on the rifle ‘but’ has little weight with the men who have composed a riddle about him. \"What is the difference between a Mills bomb &Mills?\" \"One can be carried into the firing line & the other can’t.\" French save a lot of money by their organisation. All men are called up and put into service. Hence the road workers wear uniform and carry on with their pre-war work but only draw the low military rate of pay. Crowds of rooks hovering about this afternoon. The old Marquise was out walking in his wood. The men drilled in their great-coats as there were intermittent showers. Heard a few Orderly Room cases and took down a Summary of Evidence. Party returned from English leave minus Sailor Parsons! Some headings of little worries culled from notebook. Iron rations and steel helmets, Straw, Socks, substitute for postal Corporal, Duties mounting Recomm.French system, Boots, Shirts, Cardigans, Sheepskins, Hats, Box repirators etc. The boys have been working hard so I battled for a half holiday for them tomorrow and got it.\n\nFlessells, Vignacourt, Amiens","88":" After breakfast went with Dr Stanbrook in a motor ambulance to Amiens. It was a cold bleak day. Needless to say ambulances are not supposed to be used for conveying officers on pleasure trips nor was the city on the route of the driver of this car but the transference of a few francs opens all doors and smooths out all paths! Reaching the Gare du Nord we alighted and proceeded to Café Golbert and interviewed a vociferous chef regarding the menu of dinner. We tried hard to get a dish of frogs included in the bill of fare but they are now out of season and one might as well order strawberries. Thence up the street to do some shopping. French soldiers and officers all wearing their medals and looking very smart and businesslike. In the several shops smiling and lively girls attend to one’s wants as if attended to you is a pleasure. They do all branches. In search of petit calecon m’selle quickly comprehended the desire for short ones \"Comme ca\" pointing kneewards. Pyjamas are very dear indeed over 25 francs for an ordinary pair. Glassware is cheap. In the streets there was any amount of glad eye from the latest things from Paris – these girls certainly know how to dress. To Golbert again for lunch with a bottle of Graves Superieur and Crème de Cacoa. Several Generals and many other officers there too and some French officers with their fancies. Cost 20 frs – quite extortionate. Some more shopping and then to the Cathedral. Pigeons and other birds have fouled the central porch (now sandbagged) and have their nests in the statuary. Beggars hang round the \n\nAmiens, Vignacourt &Flessells 6\/12\/16 doors and in one entrance in the street I saw a notice on a shop requesting people not to give money to mendicants. Candles were alight before the long bronze statue in the side chapel – old stained glass windows have a patchwork look and designs are hard to follow but great skill has been shown in piecing the glass together. The sacred bone relic of St John the Baptist was not attracting its usual crowd. Some of the notices are rather funny – they request people not to spit nor to bring dogs into the edifice. Before lunch we had cafe and a yarn to a major in the ranks. After leaving the church we passed the Palais de Justice (now a hospital) and reached the Rue des Trois Caillaix once more. Some French nurses passing. We met Col. Smith and went along with him making a tall trio. Stanbrook 6’ 6 ½ Smith 6’ 2, myself 5’10 ¾. At a fish shop snails were on sale. Found Smith’s car crowded by the CO of Dir. Sigs was passing at the time and we arranged to pick him up at 5 and get him to run us home. Commenced another walk and then went into a café for some coffee. Rather a garish place with a Piolu kissing the barmaid but the black café was good and some French subs were there whispering things to bits of fluff picked up. It was now dark and streets crowded. Motors &trams dashing past and great bustle. An infection seemed to seize the blood and to be inflamed by the glances and magnetism of soft eyes etc. Major’s motor drove up and we dashed off homewards a bitter cold wind cutting us to the bone. No speed limit. Dropped out at Vignacourt church and soon jumped into another car and landed home in time for a good tea.\n\nFlessells","89":" Not a gleam of sun. All day a raw fog hung over everything. Drilled in the morning down near the station and in the afternoon had them all on artillery formations and attack practice. Lewis bombers and gunners also busy.\n","90":" Another raw cold day. As it commenced to rain, sent all the men back to the billets for instruction there and let the afternoon parade also take place there. Colonel Bridges GSO1. inspected during the afternoon. Very nice people at the billet here they allow our men to come into their dining room and yarn etc. Colonel Smith, N. Proudfoot and Hepburn were round during the afternoon late.\n","91":" Wet again, President of a Court-Martial with Capt. McNeil and Tovode as members. Tried one man and awarded 12 months hard labour. Ordered afternoon parade in the billets to consist of musketry tests. Went round the billets about 2.15 preceded by one of the runners and found them all hard at work – in some cases by candlelight, owing to the daylight failing so fast. The streets were all slushy underfoot. In judging distance it was found that the tendency was to overestimate a good deal. In some of the companies there are a good many new N.C.Os just arrived in reinforcements and most of the old men have been evacuated sick. \n\nThis means that a fair number of new N.C.O.’s who have never been in trenches are put in command of veterans and of course there is a somewhat nasty feeling engendered. It is only a phase of course. King returned from leave. Great preparations for our dinner tonight when all military society are dining with us in an upper room somewhere in an estaminet.\n\n \n\nFlessells 9\/12\/16 The menu of the dinner is as follows.\n\nSardines a la Fleurbaix\n\nPotage de la Surface de Cantonnement\n\nPoissons du Chemin-de-fer du Nord\n\nSauce d’ Enquinghem\n\nOie a la Tank Jus Flessellas\n\nGras Morceau de Flers\n\nLegumes a la Casque du Gaz\n\nPatisserie du Camp de Carlton\n\nChocolats de la Boue de Somme\n\nGateau Marche de la route\n\nBiscuits former les faisceaux\n\nVins de Pozieres\n\nLiquers Ypres\n\nThe General (Brig General J Gellibrand 6th Bde) was present and three Colonels. I presided and we passed a very pleasant evening in song and talk and devious tracks led homewards. A feature of this life is \"dopiness\" very often men who might be regarded as among our smartest suddenly lose all their dash and become very dirty in appearance and sluggish in mind. In Egypt vice perhaps proved a drain on some mens’ mentality. Here it seems to be chiefly due to staleness and monotony. In N.C.O’s this \"dopiness\" generally leads to C.M.’s and reversion to the ranks. Colonel Smith reported back as the Brigadier has returned. The latter looks very far from well and prevailing opinion gives him about a fortnight with us here. Some good talent came out at our dinner – Evans sings Welsh songs and Slater tells good stories. Our little French Brigade interpreter brought the house down with some neat repartee. Bed 11 pm. \n\n \n","92":" Church parade 11am bitterly cold arrived in a most un- Christianlike frame of mind owing to ‘B\" Co. being late for parade but we fortunately arrived on the Brigade grounds just in time. Padre Bladen dilated on the sin of getting fed-up. After lunch rode out with the other Battalion Commanders and reconnoitred the ground for a tactical exercise. The General was out also. Had a good gallop back over the fields. There are many hares and partridges about here. At Orderly Room dealt with 4 cases and inflicted punishments. A hateful job. One chap got three days F.P. and had never had a crime before. He seemed a good boy. It hurt to stain his clean conduct sheet.\n","93":" A lowering grey morning. Nearly all the men were away on duties and baths but the rest were marched out to a place about 2 1\/2 miles out in open country. It was very cold and ice lay heavy on the ground. The country is of the \"landscape target\" variety and something like that near Noordpeene looking towards St. Omer. The thick rectangular woods are leafless and a straight out drive through one of them would be very pretty in springtide. In the distance is the steeple of Vignacourt church and to the left topping a rise one comes suddenly on a tiny compact little village with its houses packed tightly together and forming almost a perfect square. Went over the ground for our attack with the officers and, returning, had a good gallop over the open. It rained heavily in the afternoon and in the evening \"A\" Co had a very fine concert in the chateau hall – a place that has seen many nights of musique for the remains of an old minstrels gallery is still there.\n\n \n\nFlessells","94":" We awoke to a world white with snow an inch or so deep and heavy flakes kept dropping noiselessly. It was a very beautiful sight the twigs of the trees all outlined in virgin white and a mantle of purity over everything. At 9 am we marched out to Haystack Hill along slushy roads the fields on each side all covered in snow. Carried out an attack practice it was cold indeed and everyone was fed up by the time for moving in and all were wet up to the knees. With greatcoat and socks wet the men cannot get comfortable at all because there are no means of drying them. The snow remained on the ground all day but thawed a good deal in the afternoon. Had all officers in on a conference at 11.30 and spent the rest of the afternoon in the mess reading. At twilight there was an extraordinary sight – an air full of crowds of circling birds. We put it down to their having to go far afield for food and then returning to roost before dark. Very glad that we are not in the trenches today. Foot rubbing and baths filled in the afternoon for the men and we hope to give them a little easier time for the next few days. Attended \"D\" Coys dinner in the evening and it was splendid. 170 Australian bucks feeding. Scene a large shed with tables down it. 20 mess orderlies passing dishes from hand to hand. Lashings of poultry beer wine fruit etc. Enormous helpings against which the stomach rebelled but the boys left nothing on their plates their appetites are enormous and they love a square feed. A few speeches. I responded to the toast of the Battalion and the Padre proposed Fallen Comrades.\n\nFlessells","95":" Today we sacked our cook and 3 batmen and the mess has improved. Beggs is the new cook and had bad luck lately. His wife died, one child died, he got trench feet, and the very day he was off on English leave, he developed V.D. Dick examination proves him well again now. A fine cold morning. Rode out with Battalion to practice ground and there we carried out our attack. Major Genl. Regge and G.S.O 1 & 2 were there. Aeroplanes worked with us but misty air thwarted them. There were about 2500 men engaged. Afterwards all officers conferred and Colonel Forbes and myself criticised the operation. Col. Bridges uttered some commonplaces. The General was evacuated sick again today and RS. went back to Brigade. All boots for us arrived today and proved to be of the Blucher pattern. As the men are right on the ground we would have been very glad to take even these rotten things but our damn fool R.Q.M.S refused delivery. This boot scandal – the issue of an excellent English boot first, then the scrapping of our good Aust. ones and the cancellation of all contracts in Australia, then as soon as that is done, the heaping on us of miserable shoddy – this is going to be heard of after the war. In the evening all the officers came down to a conference and we went over tomorrow’s operation. My French is not progressing at all – rather going back. I get no time for talking to the people but some of the men are quite fair linguists now. Crosier sketched me about 4 but just missed the expression again. Last time was on the Peninsula in the Reg office. Bed 1015.\n\nFlessells","96":" Marched out again to Haystack Hill and carried out a Brigade attack with three battalions in the line, acting as umpire with Colonel Forbes and Maberly Smith. We had an aeroplane out with us and carried out some good communication with him by means of the ground sheets. All our messages reached him. The airman was a sport and responded in morse on his Claxton horn to a cheerfully obscene message sent him by our signallers. After the operation was complete we had a conference of the officers and the umpires and the Brigadier spoke. From this open country it was rather striking to notice how the church steeples in the villages dominate the country surrounding and how useful they are as O.P’s. Marched back as a Brigade and the afternoon was spent as a half holiday. At 4 pm went round the Brigade Mess at the Chateau and there met General Legge and had afternoon tea. He spoke on the scheme for training our reinforcement drafts and on other matters being extremely adverse to our men wearing the golden Anzac saying other people could wear peacocks feathers if they wished in a place rather suitable for hot weather fashions. The hard life here is rough on poor old patriotic devils over 40 who have enlisted. They can’t stand the life. One of them who has been off colour for some days dropped dead today in their billets. Dark very early cold and raining. The village streets quite dark the candlelight from the billets comes streaming out through the crevices. 360 pairs of boots came today and not before they are needed and about the same number of blankets also turned up. At B.H.Q. met the little airman who worked with us this morning – a decent little chap with a good sense of humour. Bed midnight. \n\nFlessells","97":" Not feeling well with la grippe stayed in bed until midday. All parades in billets so men had a quiet day. In the afternoon the little demoiselle Georgette Dubray came in and had afternoon tea with me and she tried to teach me French and I to teach her English. A pretty little girl with a delightful accent. At mess we asked Thwaites and Fulton to dine with us and had a jolly little dinner. Macgregor & McLennan came in afterwards.\n","98":" All baggage left with the transport at 8 a.m. & our billeting parties also went ahead to Ribemont. We follow tomorrow. Another wintry day so stayed inside all the morning and little Georgette came in and we read together. Her accent delightful. \"Meester Peeckweeck poot hees skates on and toook hees gloves of\". Monsieur presented his bill for 80 francs for use of mess for 14 days. Rather extortionate we think. Co. is in great delight over good news from Verdun where many prisoners have been taken. Much talk about peace these days. Colonel Smith came round at lunch time. McCartin goes to Brigade as Signalling officer. The men are having an easy day and getting on to the cleaning up of the billets and the ground surrounding. The Padre is doing excellent work among the men – the Dr. gives our party for leave some sage advice and information as to procuring \"Dreadnoughts\". At 4 pm had a splendid hot bath in a wooden tub and feel as clean as the proverbial pin. A few cases of AWL at Orderly Room. Wrote a few letters and read until fairly late. \n","99":" Awoke at 3.45 and no orders for move had reached me so roused up Stewart and found that he had done all necessary. However, mine being the responsibility mine should be the orders also. Informed him so. Rose at 5am.\n\nFlessells 17\/12\/16 Breakfast at 5.30 am. Cold and dark. At 6.45 said farewell to Madame and Georgette and we marched down to the Flessells station – the whole brigade turned out. The 21st Batt. looked well with very neat packs. Ours were anyhow and, to my disgust the QM reported quite a lot of blankets and other stores dumped. after a fairly long wait at the station which we spent in walking up and down, the D.A.Q.M.G.informed us that Anzac had forgotten to order the train! So all ranks turned round and went back to billets where the good people were very glad to see us. Georgette gave another lecon francais but the poor little devil being full on olfractory considerations forced it be concluded soon. A born coquette. At 1.30 received orders to move at once to station. Some billets being 10 minutes away it was 2pm before we moved off. On arrival RSO and other people were quite excited as time was short but took no notice of them. Had a few words with RS upon the same subject but the storm blew over soon. Entrainment well done. (Before lunch paraded all officers and delivered some very caustic and bitter remarks to them regarding slack turnout and carelessness re government property. One or two flinched at biting remarks for temper lent point to remarks!) Train moved off about 3 and we had a good journey via Amiens to Edgehill. Here we got out and marched to Ribemont. Many troops on the move. The guns could be plainly heard. A 3 kilometre march along broad roads and found fair billets. The men had hot tea on cookers for them. The men are mostly in good bunks of wire netting in barns etc. Retired late. A cowshed is adjoining my bedroom!\n\nRibemont ","100":" Interior economy all day. A village of creamy slush. Prisoners under guard at work on the road. Not a bad little village this but full of soldiers and most uncomfortable. Some new reinforcements arrived for us. A very worrying day not feeling very well and a great deal of annoyance over shortages in the way of socks and other necessary things and turned in early feeling very tired. Ribemont would be quite a good little place in days of peace. It is some size and on its outskirts is D.H.Q surrounded with trees now all bare of leaf. The old church is in a sea of mud and its square is used as a dump and other things for rations and stores. Bunks are fitted into all the buildings. My room is in through a stable door and has a cow shed next door where cows champ their food in the darkness. The room is very comfortable and has a couple of old hunting scenes on the wall and a religious certificate. Awakened late by the Adjutant with orders etc.\n","101":" The 21st moved off early. Ice was lying thick all over the ground and the air was very sharp and cold. Orders out for inspection by General Legge so busied myself making preparations. Some men to the baths today. At 2 pm the ceremonial inspection took place in a snow storm of powdery flakes which soon turned the ground white. Result satisfactory very few comments and tremendous improvement from his inspection when we came out of the line first. Our last reinforcement having had only a little training were not on parade with us but had a separate inspection. Result was complimentary. Colonel Somerville very obliging re ordnance issues. Snow thick on ground.\n\nRibemont ","102":" Great bustle and stir early as all packs had to be dumped before 7.30. After breakfast went out into the street which presented a very busy scene with activity. Moved off at 8.30 as a brigade with intervals between the units and companies. Snow still lying on the ground but the day was sunny and pleasant. Had an excellent march to Fricourt the roads so busy last time were comparatively free of traffic and the troops marched well all in their steel helmets and fighting order. We had a couple of halts on clear ground and when we came abreast of Fanny Durack of Albert we began to realise that we were again entering the territory wrested from the enemy. It is interesting to see the two original opposing sets of trenches and then the succeeding positions which were occupied and fought for. Coming to Fricourt we formed mass on a clear space flanking the huts on ground usually a bog but now completely frozen solid. The 18th were still in the huts and I found Colonel Murphy there. We foregathered and discussed old times until he moved off at 2pm. Also saw Col. McKenzie of 19th and got some furphies about things in general. Spent the afternoon settling down, tried some cases at Orderly Room. Very cold today. Stewart far from well and M.O. sent him to hospital in the evening and I put Cawthorne on the job in his place. We soon get comfortable in these huts they are good.\n\n"}}