{"Document Name":{"0":"Diary_0135","1":"Diary_0135","2":"Diary_0135","3":"Diary_0135","4":"Diary_0135","5":"Diary_0135","6":"Diary_0135","7":"Diary_0135","8":"Diary_0135","9":"Diary_0135","10":"Diary_0135","11":"Diary_0135","12":"Diary_0135","13":"Diary_0135","14":"Diary_0135","15":"Diary_0135","16":"Diary_0135","17":"Diary_0135","18":"Diary_0135","19":"Diary_0135","20":"Diary_0135","21":"Diary_0135","22":"Diary_0135","23":"Diary_0135","24":"Diary_0135","25":"Diary_0135","26":"Diary_0135","27":"Diary_0135","28":"Diary_0135","29":"Diary_0135","30":"Diary_0135","31":"Diary_0135","32":"Diary_0135","33":"Diary_0135","34":"Diary_0135","35":"Diary_0135","36":"Diary_0135","37":"Diary_0135","38":"Diary_0135","39":"Diary_0135","40":"Diary_0135","41":"Diary_0135","42":"Diary_0135","43":"Diary_0135","44":"Diary_0135","45":"Diary_0135","46":"Diary_0135","47":"Diary_0135","48":"Diary_0135","49":"Diary_0135","50":"Diary_0135","51":"Diary_0135","52":"Diary_0135","53":"Diary_0135","54":"Diary_0135","55":"Diary_0135","56":"Diary_0135","57":"Diary_0135","58":"Diary_0135","59":"Diary_0135","60":"Diary_0135","61":"Diary_0135","62":"Diary_0135","63":"Diary_0135","64":"Diary_0135","65":"Diary_0135","66":"Diary_0135","67":"Diary_0135","68":"Diary_0135","69":"Diary_0135","70":"Diary_0135","71":"Diary_0135","72":"Diary_0135","73":"Diary_0135","74":"Diary_0135","75":"Diary_0135","76":"Diary_0135","77":"Diary_0135","78":"Diary_0135","79":"Diary_0135","80":"Diary_0135","81":"Diary_0135","82":"Diary_0135","83":"Diary_0135","84":"Diary_0135","85":"Diary_0135","86":"Diary_0135","87":"Diary_0135","88":"Diary_0135","89":"Diary_0135","90":"Diary_0135","91":"Diary_0135","92":"Diary_0135","93":"Diary_0135","94":"Diary_0135","95":"Diary_0135","96":"Diary_0135","97":"Diary_0135","98":"Diary_0135","99":"Diary_0135","100":"Diary_0135","101":"Diary_0135","102":"Diary_0135","103":"Diary_0135","104":"Diary_0135","105":"Diary_0135","106":"Diary_0135","107":"Diary_0135","108":"Diary_0135","109":"Diary_0135","110":"Diary_0135","111":"Diary_0135","112":"Diary_0135","113":"Diary_0135","114":"Diary_0135","115":"Diary_0135","116":"Diary_0135","117":"Diary_0135"},"Date":{"0":"unknown","1":816.0,"2":817.0,"3":818.0,"4":819.0,"5":820.0,"6":821.0,"7":822.0,"8":823.0,"9":824.0,"10":825.0,"11":826.0,"12":827.0,"13":829.0,"14":830.0,"15":831.0,"16":832.0,"17":833.0,"18":834.0,"19":835.0,"20":836.0,"21":837.0,"22":838.0,"23":839.0,"24":840.0,"25":841.0,"26":843.0,"27":845.0,"28":849.0,"29":850.0,"30":851.0,"31":852.0,"32":857.0,"33":858.0,"34":859.0,"35":862.0,"36":864.0,"37":883.0,"38":884.0,"39":891.0,"40":966.0,"41":967.0,"42":968.0,"43":969.0,"44":1000.0,"45":1001.0,"46":1002.0,"47":1004.0,"48":1006.0,"49":1019.0,"50":1028.0,"51":1029.0,"52":1030.0,"53":1031.0,"54":1032.0,"55":1037.0,"56":1038.0,"57":1039.0,"58":1040.0,"59":1041.0,"60":1042.0,"61":1045.0,"62":1049.0,"63":1051.0,"64":1066.0,"65":1067.0,"66":1068.0,"67":1069.0,"68":1070.0,"69":1071.0,"70":1072.0,"71":1074.0,"72":1076.0,"73":1077.0,"74":1078.0,"75":1079.0,"76":1080.0,"77":1081.0,"78":1082.0,"79":1083.0,"80":1084.0,"81":1086.0,"82":1088.0,"83":1089.0,"84":1090.0,"85":1091.0,"86":1092.0,"87":1093.0,"88":1094.0,"89":1095.0,"90":1096.0,"91":1097.0,"92":1098.0,"93":1099.0,"94":1100.0,"95":1101.0,"96":1102.0,"97":1103.0,"98":1104.0,"99":1105.0,"100":1106.0,"101":1107.0,"102":1108.0,"103":1109.0,"104":1110.0,"105":1111.0,"106":1112.0,"107":1113.0,"108":1114.0,"109":1116.0,"110":1117.0,"111":1118.0,"112":1119.0,"113":1120.0,"114":1121.0,"115":1126.0,"116":1127.0,"117":1159.0},"Entry":{"0":"\n\n","1":"\n\nOn our way back from Kits 139. With kit bags Passed 3rd Brigade\n\nHad a swim\n\nSaw Dave in distance\n","2":" 1917\n\nParaded re transfer out of No 1 Coy.\n\nWed 17 1917\n\nWent down to see Dave Roth. He looks well. Trying to get me to the 10th LH\n\nThurs 18 1917\n\nTransfer went in just waiting for reply \n\nFriday January 1917\n\nJan 19th 1917\n\nSupper Sargents. J R. Paper train to camp\n\nJanuary 1917\n\nSunday\n\nFirst quiet day since arriving in El Arish. Wrote several letters.\n\nMonday 22 17\n\nFrightfully windy sand flying in every direction\n\nJR Birthday\n\nJanuary 25 \n\nSate de Danse\n\nDirige Par\n\nMr Sindicas (near cosmography\n\nSate de Danse\n\nRue Boulac\n\nMons,Mosssery\n\n(near Petrograd)\n\nSunday 11 1917\n\nLeft No 1 Coy ICC 10 am . Joined 10th A.L.H. Reverted to rank of trooper at own request.\n\nSaw Dave Roth both afternoon and night\n\nFebruary 1917\n\nMonday\n\nMet Father Goodman MM\n\nHe is RC chaplain to 10th batt\n\nTues 13 1917\n\nWent over to 2nd Brigade. Saw lot of 7 ALH boys. Met J McAuliffe\n\nMarch Saturday 11 1916\n\nSailed away in Orsova A67 from Sydney.\n\nFirst day at sea lovely weather. Ocean like glass. Fine boat. Well looked after\n\nSunday 12 1916\n\nWent to mass. Fr McAuliffe on board. Good trip so far\n","3":"\n\nArrived in Port Melbourne 9 am or thereabouts.\n\nLanded. Went for a March. Went into Melb 6.30. Had good look round. Taxis – fares and attention changed. Rather amused with attention added to the fare.\n","4":"\n\nStill in Melb. Had route March through city to Royal Park and back to boat. People unenthusiastic. Cold and distant. Went in to Melb again in the night . Went to Tivoli.\n","5":"\n\nMarch to Albert Park, guests of Red Cross Ladies. Excellent lunch. I had lovely 20 mile drive in car. Back to Melb at 1.30 special leave to purchase .\n\nSaw the block and the styles. Girls smostly done up, but still cold and distant.\n","6":"\n\nLeft Melb at 3pm for Colombo. Only got 1 wine from home. No letters or word from anyone else. Aust Flying Squadron joined us here before leaving \n","7":"\n\nAt sea, good weather and fine trip. Appointed Sgt Major for trip. Also on sports committee for trip.\n","8":"\n\nHad scratch concert on board.\n\n \n","9":"\n\nMass again\n","10":"\n\nGood weather making a good passage.\n\nOrsova a lovely ship.\n\n \n\nMarch\t 1916\n","11":"\n\nArrived Freemantle 9pm. Anchored in stream. No one allowed ashore\n","12":"\n\n(Had sport meeting)\n\nLeft Freemantle 12 noon after 14 hours stay. Sent mail ashore. Saw Freemantle newspaper.\n","13":"\n\nBoxing tourney.\n\nGood sport and bouts keenly contested.\n\nO.C. troops is one of the best. He is Lt Col Nicholson (of Newcastle)\n","14":"\n\nGood concert\n","15":"\n\nPlayed cards\n","16":"\n\nSketched and wrote letter\n","17":"\n\nWrote letters\n","18":"\n\nSports.\n\nLt J.P.G.Cox and self are secretaries. We are able to hold 75 yd sprint straight.\n","19":"\n\nMails closed 5 pm today will be sent ashore at Colombo\n","20":" –","21":"\n\nMedical lecture\n\nSaturday April 1\n\nArrived Colombo 6am. Got ashore 3.45 pm. Marched to barracks (40 min) Stayed G.O.H. Went all around also to Circus.\n\nBeautiful sight coming in breakwater, natives very interesting .Very hot.\n","22":"\n\nVisited sights of Colombo in rickshaw. Temple,Galle Face. Park Gardens. Bought silk at native shops. Spent £2-5-0.\n\nThoroughly enjoyed stay. Cost 15\/- for 2 days, very cheap\n\nLeft Colombo 10.30 pm\n","23":"\n\nWrote long letters about Colombo . Small monkey brought aboard from Colombo. Pet of the ship\n","24":"\n\nBoxing contests\n\nFlying fish still plentiful sea like glass\n","25":"\n\nOff Persian Gulf \n\nVery smooth trip\n","26":"\n\n500 miles from Aden\n","27":"\n\nIn the Red Sea very very hot.\n\n \n","28":"\n\nArrived at Suez. A khamseem was blowing and the dust like a dense fog so we anchored until tomorrow\n","29":"\n\nSunrise most gorgeous no wonder they write of the wonderful colourings of Egypt. Left Suez 2pm for Tel el Kebir, some in cattle trucks . Arrived at 8pm. (in the desert). Moonlight Marched 1½ miles to our camp very chilly\n","30":"\n\nHad a look at the desert. Bare barren and sandy. Les Spragg,Tom Reid, Reg King, Barrett and Montring to see me. Vic Masters also\n","31":"\n\nWent to Cairo with Vic Masters. Shall never forget my first day in Cairo went to Pyramids and Sphinx and all round Cairo.\n\nThe Mousski is the most interesting part of Cairo.\n","32":"\n\nHad to work all day\n","33":"\n\nAnzac Day – Holiday Sports etc at Tel el Kebir\n","34":"\n","35":"\n\nTel el Kebir camp work, heart, dust sand and more work. An absolute nightmare will be glad when I can get out to the regiment.\n","36":"\n\nNothing doing in L.H. scrapping so the drill goes on day after day\n","37":"\n","38":" \n\nTel el Kebir\n","39":"\n\nTel el Kebir\n\nDrill and usual routine nothing worth recording\n","40":"\n\nLeft Tel el Kebir 5.45 pm mounted for Moascar\n","41":"\n\nArrived Moascar 12 noon\n","42":"\n\nBathing parade Great Lakes, Ismaelia, Suez Canal.\n\nHMS Euryalus anchored in Canal.\n","43":"\n\nWent to Ismaelia. Pretty town\n\nConditions at Moascar are far better than Tel el Kebir.\n","44":"\n\nWas transferred to Imperial Camel Corps Austn Reserves, Abbassia, Cairo\n","45":"\n\nCairo\n","46":"\n\nBest home I have been in since I joined the military viz the I.C.C. Abbassia (Aust Reserves)\n\nFine lot of fellows, the other sergts. Especially SSM Robertson (SA) Sergt (now) Lieut Williams N.S.W.\n","47":"\n\nEasy work – plenty of leave – trips to Cairo.\n","48":"\n\nPlenty of camel drill\n\nSome very amusing incidents occurring every day.\n","49":"\n\nMet Hughes Hiddelston Sgt A.P.C. friend of Muriel Roberts. Went to Arabic wedding on his invitation. Funniest experience I have had.\n","50":"\n\nLeft Abbassia with 39 men 8.30am to join No 1 Coy ICC . Arrived Gara on the Nile 9.30pm\n\nCamped the night Beautiful scenery down the Nile which was in flood.\n","51":"\n\nLeft Qara 8.30am for the 150 or so miles across the desert . Train broke down at 12 noon after climbing the escarp. Another engine sent on and we left at 12 MN arrived Sherika 6 am Sunday . No camels for my section so will have to wait.\n","52":"\n\nWe formed the full comp` to a company of camel Corps . 180 strong.\n","53":"\n\nSherika is an oasis in Libyan desert – very fertile on the oasis but bare and barren away from it. \n\nSettling down to camp routine.\n","54":"\n\nCapt Wright (an Englishman) is O.C. and is a peculiar man. Has several favourites in the Coy. He does not seem to like Australians. Lt. Grime one of the officers is a most useless fool. Lt Mills seems a decent chap and capable.\n","55":"\n\nTwo sections under Lieut Mills moved out to occupy Dahkla Oasis, about 80 miles from Khargah Oasis.\n","56":"\t\n","57":"\n\nAnother section went to reinforce other two sections at Dabkla\n","58":"\n\nDahkla taken with the 175 Senussi prisoners. Main body of Senussi got away aided by spies. Camels knocked up so unable to chase them\n","59":"\n\nMet Lieut Dawson late of","60":" now with Flying Corps – at Sherika\n","61":"\n\nMet 3 Sergts from Flying Corps who came over on Orsova with me\n","62":"\n\nWent over to Flying Corps. Had a machine explained to me.\n","63":"\n\nWent out per camel towards Temple of Hibis in Kharga Oasis. 9½ miles. \n\nDid not get to Temple but saw the remains of an ancient cottage. Started to get dark, so the officers wanted to get back. Quite dark before arriving in camp. Journey 2½ hours each way on rotten camel.\n","64":"\n","65":" and Monday 12 and 13\n\nDream,dream, of her who awaits an enveloping attack of you.\n","66":"\n\nShooting on range tons of work\n","67":"\n\nRange again\n","68":"\n\nFatigues for the Coy which is coming in from Dahkla\n","69":"\n\nShooting again\n\nI put up very poor score. Eyes played up. Cold hardly see target.\n","70":"\n\nErecting tents for remainder of coy\n\n \n","71":"\n\nBig mail from Australia arrived. 20 letters, pcl and papers.\n","72":"\n\nLeft Sherika with 10 men to act as escort to convoy CTC from Khargeb to Tenida (Dahkla oasis) at 2.23. visited ruined city, saw mummies,visited Temple of Hibis, date 2000B.C. or so in the Persian dynasty. Wonderful carvings on stone walls. Arrived Khargeh about 6 pm.\n","73":"\n\nBought 100 oranges for trip.\n\nBreakfasted CTC. Train with Senussi prisoners arrived from Dahkla 10.30am. Took snaps. Visited village in afternoon. Very interesting cultivation prolific. Mud houses mostly underground. Filthy hovels .Visited the Omla who gave us afternoon tea English style. Had a swim in big fresh pool of unknown depth. We leave tomorrow.\n","74":"\n\nLeft 7.30 am with the convoy of 200 camels and about 80 natives.\n","75":"\n\nStill travelling\n","76":"\n\nOn the road again.\n","77":"\n\nArrived near the oasis of Dahkla at dark. Halted for night. Will go in to the village of Tenida in the morning.\n","78":"\n\nArrived in Tenida 7am Went down the village bought eggs. Residents very poor. Senussis robbed of everything.\n\n \n\nNov-Dec 1916\n","79":"\n\nWent down the village – got more eggs for tea and sugar\n","80":" Dec.1\n\nLeft for the return journey.\n","81":"\n\nStill travelling back pleasant weather but very hot in day and cold at night.\n","82":"\n\nArrived Khargeh 4.30pm\n\nCamped the night\n","83":"\n\nLeft for Sherika and got back to camp 12noon.feeling very fit.\n","84":"\n\nGot word No.1 Coy to leave Sherika tomorrow to concentrate at Gara. Probably to go to the Canal.\n","85":"\n\n3 sections left per camel for Gara 110 miles. 2pm\n","86":"\n\nStill going\n","87":"\n\nGoing strong\n","88":"\n\nStill travelling\n","89":"\n\nArrived in camp Gara 11 am\n\nLeaving here for Kantara on the canal on Thursday\n","90":"\n\nBusy getting ready for our long trek. Our probable destination is El Arish.\n","91":"\n\nEverything ready for leaving tomorrow wrote several letters.\n","92":"\n\nLeft Gara per camel for oasis junction. 5 miles entrained camels and baggage and left at 4 oclock for Cairo\n","93":"\n\nArrived Cairo station 1030 am had lunch and left for Kantara at 11.30. Passed thro` Tel el Kebir Moascar Ismaelia and arrived Kantara about 5pm. Unloaded camels and baggage and camped for the night.\n","94":"\n\nStarted on our long trek 7am.Passed several graves of L.H. on the journey saw lots of dead horses.\n\nArrived at Duedar and camped for the night. There was a battle here last Easter Sunday between LH and the Turk. The LH held out ; numerous graves.\n","95":"\n\nLeft very early. Passed thro Katia and then 5 miles south of Romani. \n\nStill seeing graves.\n","96":"\n\nStill going. Arrived Mazar 2pm camped.\n","97":"\n\nGetting ready to move off to the scene of action. Fixing up camels and rations and saddles\n","98":"\n\nLeft Mazar 2.30pm arrived Kilo (?) 7 pm had tea and pushed on thro the night. Awful journey (rough) fell down sandhill with camel.\n","99":"\n\nArrived El Arish 8.30 am camped outside the town about 5 miles away. L.H. captured the town.\n","100":"\n\nAll day in camp El Arish\n\nMoved out 9.20 pm Travelled all night, very cold arrived scene of battle 8am. L.H. scouts and advance guards in touch with enemy.\n","101":"\n\nThe battle of Magdaba My No.1 Section – No 1 Coy led by Lt Williams DCM led the Camel Corps into action very tired sleepy and hungry went to sleep under fire battle lasted all day. Turks surrended 1283 prisoners numerous guns rifle and ammo. We had 6 casualties. Lt Williams\n","102":"\n\nBack in camp El Arish resting after the battle.\n\nRained during night everything wet also everybody – very cold.\n\nMonday 25\n","103":" Wet and cold and miserable. Bully biscuits for dinner.\n\nActing QM. Trying to keep dry which is impossible.\n","104":"\n\nWet and cold\n\nWork early and late\n\nRiver appeared in the wadi caused by rain from the hills.\n","105":"\n\nWet again also very cold plenty of work\n\nDrawing rations from the beach - 2½ miles away. Rations are brought up in steamers and sent ashore in boats.\n","106":"\n\nThursday 28\n\nStill wet and cold\n","107":"\n\nShowery weather, went down to the beach. Great load of stores. Landed from steamers\n\nMine sweeper ashore last night.\n","108":"\n\nSqually weather\n\nSunday 31\n\nTerrific gale blowing no shelter. Everybody wet. Rained during night \n","109":" . All 1917\n\nWent down to beach bombarded by German Taubs. 3 shells fell down into the sea. Remainder went into palm groves. 13 casualties amongst British troops. Terrific wind blowing. Had the coldest swim I ever had.\n\nNotes For 1917\n","110":"\n\nNothing doing very squally and showery\n","111":"\n\nStill raining wet blankets every night. Expecting to have colds and rheumatism. Well so far ordinary routine of camp. Rumours of big battle to come off at Rhafa.\n","112":"\n\nPlenty of work at QMs job. Fine day very cold\n\nMemoranda\n","113":"\n\nRained again in showers. Wind very cold. Met a lot of old friends. Lt Lamb, Lt Dawson","114":" LH Lt Bell 2 LH all in","115":" Coy ICC\n","116":"\n\nNothing of note today.\n","117":"\n\nWork very hard today all bustle whilst issuing rations at 8 pm moonlight our camp was bombed by Taubs 2 bombs dropped 30 yards away. No damage. Moving out to Rafa for battle tomorrow.\n\n"}}