{"Document Name":{"0":"Diary_0351","1":"Diary_0351","2":"Diary_0351","3":"Diary_0351","4":"Diary_0351","5":"Diary_0351","6":"Diary_0351","7":"Diary_0351","8":"Diary_0351","9":"Diary_0351","10":"Diary_0351","11":"Diary_0351","12":"Diary_0351","13":"Diary_0351","14":"Diary_0351","15":"Diary_0351","16":"Diary_0351","17":"Diary_0351","18":"Diary_0351","19":"Diary_0351","20":"Diary_0351","21":"Diary_0351","22":"Diary_0351","23":"Diary_0351","24":"Diary_0351","25":"Diary_0351","26":"Diary_0351","27":"Diary_0351","28":"Diary_0351","29":"Diary_0351","30":"Diary_0351","31":"Diary_0351","32":"Diary_0351","33":"Diary_0351","34":"Diary_0351","35":"Diary_0351","36":"Diary_0351","37":"Diary_0351"},"Date":{"0":"unknown","1":1462.0,"2":1463.0,"3":1464.0,"4":1465.0,"5":1466.0,"6":1467.0,"7":1468.0,"8":1469.0,"9":1470.0,"10":1471.0,"11":1486.0,"12":1487.0,"13":1517.0,"14":1518.0,"15":1522.0,"16":1523.0,"17":1528.0,"18":1550.0,"19":1551.0,"20":1557.0,"21":1558.0,"22":1559.0,"23":1560.0,"24":1566.0,"25":1575.0,"26":1576.0,"27":1582.0,"28":1583.0,"29":1584.0,"30":1585.0,"31":1586.0,"32":1587.0,"33":1588.0,"34":1590.0,"35":1591.0,"36":1592.0,"37":1609.0},"Entry":{"0":"\n\nArrived in Havre on ","1":"","2":"\n - Humped our packs to Base, five miles out. That night went into City & dipped our nose in foaming beakers & gazed on the wine while it was red: Everything gay & bustling The French, unlike the English, do no take their pleasures sadly. We had a bon time among the sprightly Mame Belles: on","3":" we started\n\non our dreary pilgrimage to the \"Line\" No better equipped soldiers ever started out on the \"Great Adventure\" than we We had everything complete. So different to my first experience at Etaples in 1916\n","4":" \n\nLeft Base on a miserable wet morning 4 div represented marched 5 miles to station. entrained 32 in a truck at 4 pm travelled all night & half next day. passing\n\nthrough St. Pol - Hazebrouk and other places. The journey was enlivened by song & story. The former mainly sentimental & the latter gruesome causing the new reinforcements who formed part of our assembly; to gasp for breath: Detrained at - Hazebrouk. which is a fine big manufacturing towon in N\nth\n France. Here it was that Haig had his head quarters He had to shift through Fritz shelling the place\n\nwith long range guns from La Bassee 16 miles away. We got off at \"Caestres\" just a mile off Belgian border. Went to 5\nth\n Div rest Camp. A muddy and desolate hole. Tired & spent we were just laying down our blankets when Fritz aircraft came over & it was douse all lights. Most uncomfortable. Got to bed & slept the sleep of the deadbeat soldier.\n\non","5":"\n\nWe left rest camp in Motor Vans for front Line. Got off at KemmelHill a dreary spot 10 kilometre from that most pathetic heap of ruins that represents the once flourishing town of Epres .All night long the angry mutter of the guns on this the most dangerous salient on the Western front kept up a hideous \nLul\n melody surely the most grim\n\nLullaby that ever rocked a soldier to slumber A couple of hundred yards from us a couple of Howitzer batterys kept up a continuous Strafe: At intervals of about 5 minutes. Fritz would plump in a High Explosive shell. on a blind search to locate the Batterys. In the morning, went up to the dugouts & joined the Company. Had a\n\nrapturous welcome from all the old hands who were left. Alas, the number had sadly dwindled. Quite a lot of my old pals had \"Gone West\" Big Dan Smith, Warboys, Tom Ferris, among the number: Reported to Coy Head quarters. Just then eight German Gothas came sailing over the Camp. The quickfirers & Archies were on action immediately. Three of our Australian Airmen tackled em. A lively\n\nbattle ensued, up among the drifting clouds. A roar of cheering greeted the spectacle of one of the raiders crashing earthwards in a burst of flame. Another Hun gone to join the hosts in the great Beyond. That night I was one of a wiring party 600 yds behind the front line. Fritz made things very lively for us. Three times did he chase us off the job. He slung everything at us.\n\nShrapnell, ()&","6":" s Had a couple of narrow escapes. Got home at midnight & turned in. Just an item in the nightly life of a modern soldier. On the way up passed the historic crater that was once Messines. Nearly a Division of Germans lie buried beneath the great upheaval. A wonderful tribute to the skill of the Australian Mining Corps. Am to go up again on the same job tonight.\n\n\n\nProspect by no means alluring.\n","7":"\n ","8":"\n.\n\nHad a hell of a job last night. Was one of a fatigue party carrying Stokes Shells to a trench mortar position behind the front line. They weighed 54 lbs each & we had to carry em a mile over shell holed & muddy ground. To add to the enjoyment Fritz used to periodically play a tune on his machine gun & the bullets hummed over our heads like bees\n\nTwas a regular nightmare Tis a wonder we had no casualties: Coming back we came down the famous \"Hun's walk\" through the buried town of Messines Rows of overturned pill boxes, each full of dead Huns lined the walk, forming a dread avenue. The boys say that grim Spectres of ghostly Huns patrol the death walk. hence the name. \"\nThe Huns Walk\n\" The smell of dead bodies was the worst Ive smelt.\n\nsince we were in \"Bayonet\" trench at \"\nFlers\n\" last year. Got home to the Dugout dog-tired & my pal. \"\nDutchy\n\" had a big fire blazing & some prime \"Coffee Au Lait\" simmering thereon:\n","9":"\n Went & saw the quack this morning. One of the shells had dropped on my big toe & squashed it considerable. No Duty for me tonight. So for once Fritz will not have me for a target.\n\nLater\n - How lucky was I. Fritz caught our wiring party on the Duckboards & blew Christ out of em A corporal & Private killed & young Oscar Farrell had his left leg blown off, at the ankle. In the morning we are shifting back to Rossignol Camp. past Ramilles & the battered village of Kemmel Tomorrow we entrain for Boulogne where we are to spell for a couple of months. Our Brigade, the\n","10":"\n, took by storm the famous Fritz Stronghold of \"\nPolygon Wood\n\" on the \"Passchendale Ridge\" It was there that the","11":" Batt were driven mad by the sight of their best officers being treacherously shot by wounded Boches, after the latter had put up their hands & yelled \"Mercy Kamerad\": The boys caught the Boches at Breakfast & used to Bayonet em & then toss them on the burning\n\nembers & leave em to frizzle: Dreadful retribution but tis no Kid glove business this & Fritz is as treacherous as a black snake. The only good Germans are \"Dead uns\" Oh. Happy release; today we left the line area & entrained for the Village of D\nesv\nres, 12 miles from Boulogne.\n\nHave been in this place several days Found the people charming. The French\n\npeople are the best ever. Treating us like toffs. Grogan & I are billeted at a bonny place - Papa - Mama & two charming Mame'zelles - our efforts to patter French create endless mirth. The girls have taken upon themselves the very heavy task of teaching us the language. Tonight is Christmas Eve. Festivities run high: We are\n\ngoing to Midnight Mass with the family Will forever remember the sunny tempered people of Southern France. They are all that has been said of 'em. Tres Bien --\n","12":"\nSnow has been falling all night & this Christmas morn has dawned with a mantle of snow over everything. At 6 am the bells\n\nring out in praise & a stream of villagers the women all hooded & shawled. the men all in their best Blouse & peaked cap promenade to Church. There is a festive spirit abroad. All the good Monsieurs & Madames with their brood of giggling Mademoiselles & Garcons radiate with \nthe\n happiness & \"Bon Jour . Australien Soldat\" Bon Ami Bon Chance is the watch word of\n\nthe day. The troops had a fine dinner. We dined \"en Famile\" Roast Sucking pig & Turkey - Pomme De Terre - delicious. Tres Bein. Finished with an uproarious evening at Julie Sauty Duracq's Estaminet Where the buxom Madame with the bright black eyes dispenses the wine that cheers to thirsty troops. Am training for the Battalion boxing event\n\nDaily walks through surrounding forests & boxing before a circle of gaping Frenchmen.\n\nSince writing the above events have moved quickly. The Batt. championships came & went & I won the Welter & Middleweight events easily. Unfortunately I jarred my left hand very severely - had to forfeit in the Brigade events. It was unfortunate\n\nas I would have had very weak opposition & would have won without any trouble I then had a sharp tussle with a bout of Trench Fever but came through it alright. The Brigade marched out of Desvres at two o'clock on the morning of the","13":" It was a grim & silent flitting in the wee small hours Thre was neither beat of drum nor\n\nbeat of drum nor blare of trumpet to sound our passing Just a few hastily opened windows, showing Mamezelles & Madames 'en dishabille' A few \"Adieu Australien Soldats\" \"Bon Chance\" & the shriller chorus of the garcons & Filles as they bade farewell to the splendid soldiers who had made such a fine impression on the towns people. On the evening of the\n","14":" \n\nWe were in the front line trench. We are in on the left of Warneton: I am attached to no 10 platoons Lewis gun. There are six of us & we are holding an isolated post on the left flank Fritz is 130 yards across from us. I am writing this seated on a sandbag with a row of bombs on the parapet in front of me I am day sentry &\n\nmy pals are all in the little dugout sleeping the sleep of tired & weary soldiers Fritz is putting Minnen werfers & pigeon bombs all round us but luckily so far he has not located us. There is a damned sniper skimming the parapet every few minutes. He is a nuisance & I'm going to have a go at him in a few minutes\n\nWe are going out tonight to try & locate Fritzs Pigeon gun. We'll bomb Hell out of it if we succeed. It's a glorious sunny day: 'Planes of both sides are up & doing in Cloudland \"Ping\" there goes that Bloody sniper again. He must be fixed or he'll get one of us as sure as Hell. Well Au Revoir diary 'til I get another scribbling chance.\n\nWell quite a decent interval has elapsed since I last scribbled in thee my diary. We were relieved at the end of five weary days. Had a few casualtys & poor little Smithy & Rowley Peck have gone to that Bourne from which there is no return. Smithy had been with the Batt. since the landing in France. He had seemed to bear a\n\ncharmed life. Now he is dead. I was laughing & joking with him an hour before he \"Went West\". A shell got him on the duckboards near 'Coy' Head quarters. Verily one never knows the hour of his passing. Rumours fly about, everyone is on the 'qui vive' It is the","15":" & Fritz is expected to push at any moment There will be\n\nHell to pay when he does. The slaughter will be awful The \"black Angel\" will be kept busy visiting Australian homes. The Island continent will be plunged in mourning. We had a patrol fight with the Boche the other morning. Dawn was just creeping over the land. We met in No Man's Land. It was hectic while it lasted. Fritz broke & ran. There\n\nthe machine guns \nsta\n started to Clack busily The air was laden with the teetering, whispering, death. We came in. Took two prisoners & na pooed a couple more: There will be another couple of seats vacant in some Munich 'bier garten' when the roll is \ncalld\n called. Such is this trench warfare: The toll is always being paid. Every night a few\n\nSouls wing their flight to the 'Maker'\n\nDuring the past two weeks have been out superintending the training of the","16":" Divvy team of boxers. We were billeted in the town of Bailleul just on the Belgian border: 'Neuve Eglise' is a little town five miles from the front Line. All day & night Shells whizz over & around it. Yet girls & women & little\n\nchildren dwell there in perfect contentment. The spirit of the French people is wonderful. There is a partially demolished Church which dates back to the","17":" Century. The modern & the Ancient are jumbled together in a bewildering fashion. Cheek by jowl with a jaunty stuccoed, red tiled, villa will be an ancient, gabled, eaved & moss grown\n\nthat stood sturdily when Cardinals were the uncrowned Kings of France & our old friends. D'Artagnon, Porthos, athos & Aramis played their amazing pranks. A filthy dung heap flanked by an evil smelling cesspool, usually occupys a commanding position in front of the only door, in the average French Peasants cottage. Within that cottage you may find\n\nbits of wonderful old walnut furniture. In the corner a massive Grandfather Clock may bear the makers name & the date of construction. 1746 & I saw one that was fashioned in 1793 & it still ticked sturdily on The massive four post \nbead\n bed & the clock are generally heirlooms & are handed down fromgeneration to generation Another valued\n\npossession is the huge old fashioned Cradle that has rocked the infants of the Revolution into the rosy land of Dreams It still rocks its tinymorsels of humanity & \ndefys\n \nold\n defies old Papa Time & successive generations of mischievious youngsters to place it 'Hors - De - Combat': Surely they were great & cunning craftsmen in the brave days of old.\n\nBut I have digressed. A dozen German prisoners have just tramped down the road under escort. They were taken last night & look pretty miserable. Three of them wear spectacles, a couple are mere boys. A nondescript lot. Will stop now & await a favourable opportunity for further scribbling.\n","18":"\n ","19":"\nst \nYesterday we finished the boxing stunt\n\nmy team secured three Championships - Welter - Feather - & Light Heavy weights. So the result was \nevid\n evidently satisfactory. Birdwood dished out the prizes. & as usual made a pithy little speech. Just before we left to join up the Battalion I witnesed a little incident that brought into bold relief the Spirit that animates the French. The 199 class of youths had that day been called to the\n\nColours. Bands of shining youths paraded the streets, plentifully bedecked with the rosette & tricolour ribbon, Their enthusiasm was \ngold\n good to behold They chanted the 'Marseillaise' & other martial melodies: A band of these youths surged into the Estaminet where we were indulging in a \"Wee \"Doch & Dorrich'\" — Singing all \nthey\n the time, they linked hands & danced around us \"Tres Bon Australie\"\n\nSoldat \"Mes Braves\" \"Vive Le Australie\" \"Bon , Mes Comrades\" \"Bon pour Le Guerre vous\" \"Abas, Le Allemande\"\n\nAm resuming where I left off a couple of days ago Reported back to the Batt. The Quack (Doctor) sent for me. He is a boxing enthusiast. I had to give him a full, true & particular history of our fistic doings The hand which I injured while boxing for the Championship at Desvres is coming against me\n\nmy sight is also faililng So yesterday he sent me back to the","20":" field ambulance at \"Locre\" to be X Rayed & have a sight test: Had a ten kilometre walk; (seven & a half miles) \"Locre\" is a Belgian village just across the Frontier The Ambulance is located in a fine brick building which was formerly a convent. A few of the nuns still linger on in their old home, caring for a band of orphan children, whose parents fell victims to\n\nthe Boche in the first whirlwind rush, in 1914. In the front garden are three carefully tended graves. A British General, lies buried there, along with a Colonel & a Lieutenant: Graves are a feature of the Landscape all over this advanced area. Wherever you turn, your eyes are \ngreated\ngreeted with \nthe\n \nlittle\na cluster of white crosses. Flanders & Northern France is one huge graveyard \nLast night I slept in a tent with half a dozen others\n\njust out of the \nLine\n. After tea, a roaring fire was lit & we gathered round the improvised stove (an oil drum, with holes pierced in it.) A bayonet comes in very handy for chopping firewood & perforating kerosene tins etc for braziers; The conversation was confined solely to the war Each man there had carried his life in his hands. All had grown callous (outwardly at least) to death and disablement:\nWhat wonderful copy was\n\nlost to the journalist or novelist, as each man ina calm, matter of fact manner detailed this little experience or that: Each containinga wonderful, vivid, splash of human interest: Around any dugout fire on the Western front one can run the full gamut of thehuman emotions. Pain & pathos, Laughter & tears, all are there; What mattersisthat he whotonight tells the merry jesting story dealing with his adventures in \"Blighty\"\n\nwill, ere the morrow's sun be set, be in a shallow grave, hastily hacked out & shovelled in by a fatigue party who are working in fits & starts, in the intervals when Fritz's flare's die down. From the lips of the slim youngster in the corner comes the grim story of the fight for\"Mouquet ","21":"\n farm\".\nAnother kid, barely out of his teens is retrospective& culls incidents from his repertoire of\n\n\"three years soldiering\"\nHe is a war hardened veteran; \"twenty years old,\" - Ye Gods; Back & forth doth the conversation ebb & flow. Places, familiar to the outside world as famous battlegrounds are spoken of in the proprietoryfamiliar spirit of those who have been there. \"The Somme\" Albert, Contal Maison Bernafay Corner. Montauban Delville wood . Trones Wood Factory Corner . \"Pozieres\" Sausage Gully . Flers\" Bayonet Trench : Needle trench\n\nVillages\nSunray; Flers. Ligny Thilloy, Baupaume. Lagnicourt. Bullacourt 'Morchese'. Polygon wood & the frightful \"Epres\" sector Passhindale Ridge Anzac Redoubt. Menin Rd, \"Clapham Junction\" Messines, Daylight Corner Neuve Eglise: Warneton, (plug Street) Plogsteete\nThese are the names that will live forever in the memory of Australians who have fought in France. So the talk flows on. Old fights\n\nare fought over again The names of dead & gone comrades crop up. here & there. \"So & so, oh yes poor begger He was killed at Bullecourt.\" \"A H.E. got poor old ----just after Bapaume.\" They never found his head.\" --- \" Snipers got so & so going up to Polygon\"; while ---- got gassed at Passhendale.\" & so on 'til \"Lights out\" warn everyone that it is time to bed down. Verily this is a land\n\nTopsy - Turvy indeed.\nWill finish now for awhile.\n\nAm resuming where I left off a couple of days ago. Had a motor ride to \nMontxxxx\nMont De Cat in order to undergo a sight test.\nThe hospital is located in an old monastry, charmingly situated on a hill, from whence a delightful view of the countryside can be obtained. You enter through an arched gateway of stone which dates back to the","22":" century. Your eye is then\n\nsaluted by the sight of a jovial Friar, in cassock, hood & sandals. With tonsured pate, rubicand countenance & generous girth the old chap might have been \"Simon the Cellarer\" himself The ancient portion of the Monastary is still inhabited by the Monks. Each has his own little cell, as it was before the reformationlong ago Visions of the doings which \"Boccacio\" has Imortalised in his wonderful book. \"The Decameran\" flashed through my mind\n\nas I strolled through the gloomy environs; I have a great reverence of the ancient. Old world survivals like this are a never failing source of interest & delight: In this little book of notes. I am not dwelling overmuch on the daily drudgery that marks the life of a modern soldier. Every day, whether on fatigues back in supports, orcrouchedin the front LIne, we are under fire. Hairbreadth escapes are the rule & not the exception. Even perils & dangers can\n\nbecome monotonous.\nCasualties are of daily occurance\ns\n: Everysoldier is at heart an optimist. That is just what sustains them throughout the ordeal. So if there is not sufficient Blood & fire in this screed please excuse the war weary scribe: Saw Major Willie Redmond's grave quite recently. He is buried in a quiet old Convent Garden, at \"L\nocr\ne\", in Belgium. The good sisters tend the tiny plot with loving care:\n\nIn a flowerbordered six feet of earth, surmounted by a simple white wooden cross, the famous Irish Patriot, politician & soldier, sleeps his last long sleep. His dramatic last appearance in the House of Commons & fervid plea for all parties in Ireland to sink their differences & work in Unity & Goodwill, lent, to his death, in actions, a few days afterwards, a glamour that has made a great impression \nin\n on the minds of all Classes in the British Isles. He died\n\nfor his Country & principles. A man can do no more.\n\nM\narch 20","23":"\nHave just imerged from another spasm of frightfulness Still unharmed, Our Company Commander \"went west\" yesterday. A shell got him. also three others. 'Na Poo' the lot. My old pal Tom Grogan got a smack through the leg the other night It is finish war for\n\nfor him, which is a blessing. The following little drama occurred in \"No Mans land\" the other night. Fritz came over & aimed bombs at the inmates of one of our strong posts He killed three & took a couple prisoners. Our chaps heard the racket & counter-attacked. TheFritzies departed 'tout suite' leaving one of their number to bring in the two unarmed\n\nprisoners. Halfway across 'No Man's land' the prisoners attacked the guard. A punch on thejaw dropped him. & then they enthusiasticallykicked the Teuton to death & retired to our lines. Such is the hideous reality of war; stripped of the glamour, it is but a scurvy business, at best What so you say, Oh my Diary ??\n\nFritz sent several toy balloons over yesterday, filled with propaganda stuff He implored us in very indifferent English to \"turn it up\" before it was \ntwo\n too late. Considering that we have raided him nine times in fourteen days, both killing & taking prisoner a number of him on each occasion —\n\nHis cheek is rather hectic is it not: Of late I have forgotten to worry A large acquaintance with German Artillary Its sheer waste of good animal tissue (ditto emotional.) to indulge in gloomy suicidal worry. If a large meaty shell is going to come along & cut you off before the worst has happened: Well! \"Ce Le Guerre\"\n\n Garcons &\n André ) Belle\nxJulienne ) Filles\nxPhilomen ) of\nAlbert ) Devres\n Alexandre ) ","24":"\nx Madeliene Louise \n\nFernand Hanquez\nDevres\n\nThe above chap was a little crippled chemist of Desvres. He was a volatile little chap & was daily a most interested spectator of my training operations. He was a quaint & lovable personality & a great friend of mine.\n\nJimmy -\n\nJacques - Jean\n\nAugustine Ducros\n","25":" Ami dans Australia\n\nLe . Bon . Fille\n","26":" \"18\n\nAm writing this sitting on the steps of a wayside shrine of the Virgin & Child Just on the outskirts of the village 'Thieushouk' We are on the march (And a forced one at that) The long expected German Offensive has come at last. Fritz has broken through the British Line on the Somme. All the places we (the Australians) took from him last year; he has taken back from the \"Tommys\". As usual\n\nwe (being Storm troops) are being shifted in a Hell of a hurry in order to bring us in to assist his progress Already the third Division of Anzacs have been in action. They have achieved one of the greatest & most briliant bayonet charges in the history of the war We entrain tomorrow morning at 7 am & We will be in action the next day. Since writing the last lot of notes previous to these have had\n\na Hell of a rough time. We were in Hillside Camp at the back of Neuve Eglise. Fritz got the range to a nicety & started to shell us like Blazes. His second shell got two huts killing nineteen & wounding eleven The horse lines were here also I have been mentioned for good work getting horses away while under fire I also rendered first class assistance to\n\nthe men who were hit. I & an orderly room Corporal were fifteen minutes, on our own tending to the stricken men before assistance came to us. Everybody cleared out tout De Suite With the exception of myself & one other everyone evacuated the doomed Camp. Fritz shelled it for 48 hours & killed 27 & wounded 40 odd within a radius of 400 yards He couldnt shift us though. Pat Russell & I\n\nhung on & guarded the pack store, A.M.C. & Post Office. It is rumoured that we may get a decoration. I knoweth not, nor care. As I write, A bunch of French school Kiddie's have happened along. To them & a bunch of Chinese Coolies, I am evidently an object of absorbing interest. The slant eyed Mongolian is very prevalent about here Battalions of them are engaged (well back from\n\nthe \"firing Line) \nin labor\n in railway Construction & Salvage work. Tis a weird contrast, \nto\n when you seethe French kiddies devoutly cross themselves when they pass the \"Shrine\": Meanwhile the \"Pagan Chinee\" gazes in round eyed amazement at the Curious little Grotto with its enevitable statue waxen Candles & Floral Offerings: So Do Pagan & Christian rub shoulders, cheek by jowl, in this land of Topsy Turvy\n\nthat is the France of 1918. Must stop now Our brief halt by the wayside is over. It is 'En Evant'. \nWh\nWhere doth my Destiny lead me, I wonder.\n","27":"\n0th Marc\nh 1918\nAt last I am able to snatch a few minutes in order to jot down a few notes. Well, you all knowwhat has happened during the past week. The greatest Clash of armed hosts this old world has seen; \"is on\".\n\nThe Boche has attacked with phenomenal fury on a fifty mile front He has broken through the British line in several places. In places the Tommys have fought like the Paladins of old. Alas, at other points in the Line they have offered but faint hearted resistance. We marched for three days & then hopped into the big stouch. We came through Doulen right along to 'Bus' Here it was that the Tommy\n\ninfantry & artillary run away & left a gap of five thousand yards in the Line for the 'Boche' to pour through. As usual we were hurled in to stop his progress. We and the New Zealanders were hurried up in Big Motor vans. All along the road we met disorganised bands of Tommys without equipment or rifles & some evenwithout boots going for the lick of their lines. We jeered, cursed, & reviled them in measured\n\nlanguage & loud. Four miles beyond the little village of 'Bus' we met Fritz. He greeted us with a brisk fusilade. Rifle & Machine gun fire: without waiting for orders our chaps & the Pig Islanders hopped out of the vans fixed bayonets, flew into extended order & went slap bang into Fritz. We chased them back a mile, Rounded up a big bunch of 'em & then consolidated: One Sergeant & ten men brought\n\nin 140 Fritzies. Officers and Men: The Boches told us that they had not had any opposition \nsince\n all the way from Baupaume: We are now on the march to chuck ourselves in front of Amiens. The","28":" &","29":" Divisions are holding him easily back at 'Bus'. We, the","30":" Division are promised a big hop over within three days. There will be brisk bayonet work. Fritz does not like facing us\n\nat all. We are too Breezy for him. Some how or other a great number of the Tommy regiments do not seem in love with their job. Fritz has a great contempt for them. The Jocko Canadians & certain picked English regiments are good fighters, but there are a lot of faint hearts among the alleged British Bulldogs. Am writing this by the light of a quitting candle precariously perched on a bayonet. Reveille at 4 am then forward again. Good night.\n","31":"\nth\n April.\nWell here we are again; since dipping into you last, little notebook, we have been all round the world. At least so it seems to me We were supporting the French at Gentilles Wood we \nbib\n \nbivouced\n bivouaced there for three days. We were then marched six miles across country to the village of Aubigny Tis indeed a pathetic sight, these hastily abandoned villages.\n\n\n\nThe people have evidently grabbed whatever was most convenient & handy & cleared out. There, are the little deserted homes with all the sacred family treasures at the mercy of rough soldiers. The Tommys when they ran away from Fritz's advanced patrols played particular havoc with the erstwhile peaceful little hamlets. Tis plain to the eye that this smiling countryside of the plains of Picardy has been\n\noverrun by a demoralised & completely out of hand army. When we came into this area, we found bands of straying, forlorn & hopelessly lost \"tommys\" Without officers, equipment, rifles, they were indeed a sorry lot. We were ordered to round em up. Most of em belong to the","32":" Army. Unlike their comrades of the","33":" Army, who fought gloriously & contested every inch of the ground lost, these libels on\n\nthe name of Englishmen are a sorry lot. It is a fact which I suppose not one of the lieing war correspondents will put on record, that when we \nwer\n & the New Zealanders met Fritz the other side of 'Bus' there was 8000 yards of ground totally undefended, leaving a gap in the Line. We filled that gap. Now here just a mile from the old world town of Corbie, the same thing\n\nhas happened again. When the","34":" Australian Brigade entered this village where I am writing these notes. \"Hamelet\" they found five thousand yards of the Line vacant, but for the presence of seven British Cavalry men who were prepared to hold this place to the death. They had four machine guns. Just fancy seven brave men resisting an army. It is epic.\n\nThey greeted our men like men rising from the dead & told the shameful story of how the artillary & infantry had retreated as soon as Fritz fired a shot. Well here I am sitting in the house that was once Monsur Le Curies. Last night we slept between sheets & ate off China plates. We drank the Abbis wine & in his absence voted him a\n\njolly good fellow. He evidently did himself real well, the old rascal. Meanwhile we are dwelling in the odour of sanctity. We eat, drink & are merry for tomorrow at dawn the","35":" Brigade is to \"hop the top\" & attempt to drive Fritz back a mile or more. These notes are punctuated by whizzing shells. One has just carried away the steeple of the quaint old Church\n\nacross the way. We are only six hundred yards from Fritz. Yes a sight to see our brown faced lads attired in the snowy linen shirts of some departed rustic dandy. They have come out of the indiscribable misery of wet & muddy bivouacs. We are not carryingeven a blanket. For days past we have camped in dripping woodsmuddy ploughed fields beneath the meagre shelter\n\nof the bank of some sunken sheltered road We have had a lot of Casualties. but all around the boys are sharpening their bayonets & the bright blades will reap a merry harvest tomorrow. Tonight we sleep in beds amid eiderdowns & patchwork quilts galore. For many, it will be the last sleep until Gabriel's Trumpet sounds the \"great\n\nReveille\", Tomorrow, many a voice that is tonight upraised in jovial song, will be stilled for ever \"Ce Le Guerre,\" who cares?\nYonder on the brow is our objective, the sinister & illomened village of \"Hamel\". Apres Midi, Don & I were sent back to the ancient town of Corbie. The old place is siimply running with Champaigne: Fritz is shelling it intermitently. Our\n\ntransport lines are there Tis a scene of pathos. Shops & dwellings have been looted. Tis as if Attila & his hordes had overrun the place. The famous Abbey of Corbie has been hit in several places; by shells. Tis indeed a a wondrous piece of masonry: For eight hundred years it has withstood the buffets of old Father Time. Unlike so many famous edifices of antiquity.it stands today as it was\n\nbuilt in the","36":" Century. There is no modern restoration to mar the work of the old masters. Tis a wonderful monument to the exceeding worth of those long dead craftsmen. Don & I explored the interior. Priceless relics are strewn around. The High Altar is a gaping ruin. Wonderful examples of the woodcarvers art are scattered everywhere; An illuminated vellum missal is lying forlorn at the Altar Steps\n\nIt was evidently the work of some Studious old worldscribe who like Gerard in Reades deathless story \"The Cloister & the hearth\" sought for the favour of Cardinals & Kings, in the days before the Germans introduced the Printing Press: into Europe.\nPassing along the \"Place Thiers\" opposite the Abbey we saw enough to convince us that War is indeed Hell. \"Fancy coming Home & finding things like this\" quoth Don to me. We had\n\nvoiced the thought that was flitting through my mind: Childrens toys, intimate garments of \"La Femme\", Wardrobes overturned & the contents strewn to the four corners of the Earth windows smashed. Empty & partially emptied Champaigne bottles, laying all over the place & an aura of fermented & spiritous liquors enveloping all Here was a life size doll, there a kiddies toy gun, with a piece of string looped to\n\nresemble a rifle sling Yonder a grannys cap Ancient stovepipe bell toppers, reminescent of a long past decade Family treasures all. Relics of old Decency & Wedding days of the long ago. Family Albums \nin the\n bound in blue & red plush, containing the inevitable, baby in flowing lawn garments. the inevitable, blushing bride & bridegroom, in a provincial sartorial setting. Ancient dames all frills\n\n& chignons & cameo brooches. What an atmosphere of homelike peacedoththese things carry. And now mute & pathetic they clutch at ones heartstrings and I think of other homes in a far off land beneath the Southern Cross & pray to God that war may never cast its sombre pall over mine own dear land: down the street, the tinkling of a cracked & discordant piano salutes our ears \"Good Bye'ee, dont Cryee\n\nwipe the tear, baby dear, from your eyeee\" Bon Soir, old thing; Cheerio, Chin Chin, Na poo tooral, oo \"Good Byee\"\nThe lilting chorus rings out on the frosty air. Curiosity impels us towards the scene of revelry. A strange sight \ngrats\n greets our eyes. A bunch of our boys are holding wassail is a strange sight. Picture the main room of what was once apparently the leading 'Estaminet' of the place\n\nVelvet covered lounges, Dimmed nickel & brass work everywhere A noble & shining array of bottles on walnut shelves: On the walls hang gilt framed pictures, alas, chipped & tarnished & in all sorts of grotesque positions.\"Napoleon on the eve of Austerlitz\" hangs by one cord. \"Joan of Arc\" receiving the homage of the Chieftains of France is a noble & dignified print but the dignity of the\n\nSaintly maid is marred \nby a\n where a fragment of debris, flung up by a vagrant shell, has smitten: Little round, marble topped tables, covered with dead or dying \"Marines\" Wine runs freely, the floor is sopping with it. A little marble statuette of the Virgin & Child, has a \"\ntin\n \nhat\n\" for its 'Halo'. The \"virtuoso\" at the piano, is a laughing veteran of perhaps twenty years of age; All round, in\n\nsprawling picturesque detail & disarray are grouped the roysterers: The health of the absent Boniface is pledged in foaming bumpers. A roar or welcome greets us; \"Entrée.\" \"Come on\" - pop in, Jimmy\". Wot about a song\", (I am by way of being a bit of a camp fire vocalist) (dont cher know.\") Brimming champagne glasses find their way miraculously into our grasp. We linger a while, finally taking a boisterous farewell at the Conclusion\n\nof a doleful ditty wherein a youth in all the glory of \"Spurs & bandolier, muddy boots & a venerable silk hat that might have been the 'Mode' when ladies donned the Crinoline\" lifted up a rather alcholic & ultra submerged tenor in praise of a lady named \"Gueneveive\" What, though the tinkling of piano notes & the rollicking choruses were punctuated by the clatter of falling timbers that was once a home;\n\nwhile the ground trembled & fearsome explosions reechoed through the doomed town. Whizzing shells, bursting bombs are but minor incidents in this strenuous life of ours. \"Has the rations come up,\" Is there a rum issue tonight,\" \"What sort of billets are we going to\" These are the things that count. Just as we were leaving all \nHell\n seemed to have broken loose. All round machine guns, crackled & spat; Archies coughed\n\nin staccato, measured chorus. High over all \ncome\n comes the unmistakable burring hum of Fritz planes. There, high overhead were the enemy aircraft; five of them. The air seemed alive with bursting shrapnel Calmly & serenely they sail along. \"Boom - Boom\" - come the falling bombs -- There is a brief lull in the deafening noises. Clearly comes the brassy tinkling notes & the rousing, roaring chorus: \"I want to go\n\nhome, Oh my, I dont want to die, I want to go home;\" then swiftly changing \ncome\n comes the defiant opening bars of the -\"Marseilleuse\"- Here in the midst of Armageddon, these Australians sing the wonderful battle Hymn with a verve & fervour & savage joy, that could not be surpassed by the Children of the Revolution\nThe above is a little page torn from the Book of War as we\n\nsee it here in the early spring of 1918:\nNow before I say goodnight little book. Just across the narrow street is a high brick wall. It encloses a tiny plot of ground A minute \"Gods Acre\" In a shady corner are six mounds of new red earth In each is stuck a beer bottle, neck in the earth In each bottle \nis\n a piece of paper is enclosed On each piece of paper is a name & a number. For these are\n\nsix graves. We buried these poor boys where they fell. Perhaps some day, crosses & wreaths may mark their last resting place. Today, a mound of red earth & an empty beer bottle form their sepulchre: Today I stand & gaze in pitying silence Tomorrow I may tenant as hastily scratched agrave myself. So do we live veritably from minute to minute, hour to hour & day to day; Good Night —\n","37":"\n\nWell quite an interval has elapsed since I last scrawled herein.\nThings have happened The Priest's house is a heap of ruins. An eight inch shell lobbed right in the kitchen\nLuckily we were all outside watching the acrobatics of one of our number as he manfully essayed to milk a goat. I am writing this propped up in bed in 3 ward of No 2 B.G.Hospital\n\n"}}