{"Document Name":{"0":"Diary_0231","1":"Diary_0231","2":"Diary_0231","3":"Diary_0231","4":"Diary_0231","5":"Diary_0231","6":"Diary_0231","7":"Diary_0231","8":"Diary_0231","9":"Diary_0231","10":"Diary_0231","11":"Diary_0231","12":"Diary_0231","13":"Diary_0231","14":"Diary_0231","15":"Diary_0231","16":"Diary_0231","17":"Diary_0231","18":"Diary_0231","19":"Diary_0231","20":"Diary_0231","21":"Diary_0231"},"Date":{"0":"unknown","1":1671.0,"2":1672.0,"3":1673.0,"4":1674.0,"5":1675.0,"6":1676.0,"7":1677.0,"8":1678.0,"9":1682.0,"10":1683.0,"11":1684.0,"12":1690.0,"13":1698.0,"14":1703.0,"15":1705.0,"16":1706.0,"17":1707.0,"18":1708.0,"19":1709.0,"20":1711.0,"21":1714.0},"Entry":{"0":"\n\n","1":" night","2":"\n\nOn night duty – second night.\n\nAs soon as I was finished this morning I cleaned up one or two concert party matters & went to bed, arranging to be called for 2 oclock rehearsal.\n\nTom Beech forgot, however, & and when I met Whent the younger later on, a suggestion about his desire to \"chuck it in”, ostensibly because of a postponed rehearsal (not necessary), but really because of some inherent strain in him which makes him annoyingly unreliable, I told him in plane language\n\nthat it would be better for him to do so.\n\nNecessary to bustle about in the late afternoon & evening to get the concert party on the move; nothing much having been accomplished up to date. Burlesque put back for use in the next concert & a definite arrangement made for singers to get their songs off.\n\nTonight we have not had a very busy time, & some of the staff are lying about the floor in inartistic attitudes testifying to that fact. A Fritz aviator came over very early & dropped some light bombs on either side of our field, but we were \n\nquite unharmed. \n\nArgument as to whether he tried to bomb us – despite the red cross on the roof. This struck me as childish considering that there are artillery men in paddocks all round here, not to mention anti aircraft guns.\n\nFreddy Smith – the Staff dispenser – has been learning French during the night, & has amused me considerably by his quaint facial expressions, & his weird pronunciations. \"Ils ont \" he gave us: \"eels zonk” – suggestive of bombs falling on us.\n","3":" night\n\nGot through most of my correspondence last night.\n\nToday has been very successful but I got a very small amount of sleep & feel consequently, rather sleepy tonight.\n\nOdd jobs before going to bed - overtime (about 10.30) & called prematurely early to receive & play for a big dry singer of the","4":" Field – Sgt Sellars – who is to help us next Thursday.\n\nBeautiful weather today, & I was\n\nglad to be able to squeeze in the time to bath this evening.\n\nThe added brightness to the evening service. There is a real improvement in attendance at the Sunday night services compared with the ones when I \nfirst\n arrived back at the","5":"\n\nFritz is evidently on some big raid by planes tonight, for fully a dozen – probably more have gone over in the last half hour. Many can still be heard\n\nsomewhere overhead, & bombs have been dropped over beyond Hazebrouck.\n\nBuccanara, the rather dryly humorous old bearer of the","6":" who is now an officer in one of the battalions, visited us tonight for a chat. He is coming to the concert next Thursday. Only when up the line is there anything wrong with the life, thanks be, & that is not for long. At the back they get well looked after.\n","7":" night\n\nSince last writing my round has been simply work (military & educational) & sleep.\n\nDuring the night I do preparation work or write parodies for the concert, or learn some shorthand when there is nothing to be done in the way of attending to patients. A few influenza cases may be relied upon every night, but beyond that there are not spent many cases – that is wounded.\n\nTonight there has been a raid in which our boys wore certain kinds of hats. The number of wounded was only about half a dozen, & of those only one was serious. We seem to have dealt with 4 worrying machine guns. \n\nI have been losing some sleep lately owing to the fact that a substantial portion of the day is taken up with necessary attention to flagging details of the concert preparation. With Bill Drew as music man, & Ploughs & Wheat as stage managers there is not a great deal for me to do as there has been in the past: Still they have not yet acquired a sense of responsibility.\n\nThe Frayne & Burnett style of society is not particularly good for me at \n\npresent, yet it is necessary for me to meet such difficulties. They are the members of the party; and although Frayne is far better than Burnett in that respect, there is a terrific looseness of expression. The deadening effect of the war seems to have killed any social pretention augmenting desire for betterment, and their only form of expression has become one of immoral suggestion …………………….\n\nYet I am not inclined to side with\n\nthose who, like Rixon, would avoid such people except where absolutely necessary. If one is strong, there should be no danger.\n","8":"\n\nYesterday evening we held the concert we had been preparing all the week, and it was successful. During the day many chaps have come along to me & congratulated me on the result of our efforts. As a matter of fact, owing to the study circle\n\nwork, & other occupations that have engaged me, the actual success of the concert was due in no small measure to the very Drew (as musical director) & Wheat & Ploughs (as stage managers) backed me up. They worked well.\n\nWe had a bible study period tonight, and the subject, \"Christian growth”, while very well treated in papers from George Walton & McIlroy, was only, as Vic Hall put it, nibbled at. It should have been\n\nsubdivided, & seeing that it deals with practical problems of life in the army, it could well have been spread over several periods.\n","9":"\n\nWe finished our week of night duty last Friday, & since then, although going on all early morning parades, I have escaped the others by doing some useful box making for the goods of the concert party. We have plenty of \"props” now, supplied indirectly by the German offensive, for \n\nthey have been recruited from such evacuated places as Hazebrouck, Borre, & Caestre\n\nSince the concert finished I have been getting us some overdue sleep, & getting to grips with my correspondence which was almost overdue. Classes were not altered by the concert work, but have gone more smoothly for me since.\n\nI was thinking today what a tremendous amount of impressions on the relations between Germany & England, the causes of the war, the probable ending & state after it (generally\n\nsummed up in the odious expression \"the War”) have been given since 1914. As the time lengthens out; & the chance of an ending still fails to appear, one gives detailed views, half prophecies & reconsidered views, so that each of us must go over nearly the whole gamut of possible points of view. Tom Smith & I had a beneficial discussion today, & although I laid down my definite ideas of the comparative morality of each side (how changed from when I came away), we managed\n\nto be more thoughtful also more argumentative than usual. When I met Tom first in the Peninsula he was terrifically forceful & pragmatic, so that we seem to have been destined to be antagonistic (for he is not always sure of his bases of argument). Yet some chance has prevented us from having more than one or two square arguments, & now, weary of the war & with no spirit to energetically use his brain to refute anothers, he is quite open for thoughtful passive discussion in certain moods. Even war weariness can\n\nbe a blessing.\n\nAlthough the Americans arrived in the locality some time ago, & some have been attached temporarily while on the way up to the line, it was not till last week that a party of medical sergeants & officers arrived for experience with us.\n\nOn the whole they have been very undemonstrative, quiet & not energetically obvious, while working in perfect harmony with us. Theirs is certainly a truly democratic\n\narmy, for the relations between the officers & men are purely those of equals. The N.C.O.’s with whom I have talked are quite positive on the affinity which exists between Americans & Australians. It seems, from what they say, that being free & thoughtful they feel uneasiness in mixing with people that are conservative & bound by traditions; but find the happiness of common ground immediately with Australians. One would not expect the English type\n\nof soldier, or military & political ideals to appeal to them, but I am sure that when they have learned to appreciate the good points about the clodhopper who is quite a frequent type, in the British Army, & the men of tried ideas who are the average in the ranks, they will, like the Australians, settle down with them. Then the omen of the present Independence Day rejoicings in England will come true.\n","10":"\n\nYesterday, for the first time in my week off nursing duties & on parades, I did some army work. I was put on wad making, and put in the morning, from 7am till dinner time, on carting bricks, and placing them in position on the wad which we are making for the motor transport on account of the skidding which the earth causes in wet weather.\n\nFor what I could acquire out of the \n\njob, I volunteered to go to Caestre today to load waggons with bricks from shell-demolished houses. As I only worked for about half an hour, and got quite a lot of useful stuff, such as artistic pictures for our bivouac, I am not sorry I went.\n\nCaestre is not very much worse than when I passed through it on the way out of the line a few weeks ago. It is now on the line of communications of\n\n \n\nan English division, and an R.A.M.C. are running the A.D.S. at the chateau.\n\nRopers, Blackwell, \"Gunner”, & I went through nearly every house in one side of the village, and although the new feeling that we get on viewing first hand destruction effects among civilian property wears off to a certain extent, the prevailing sensation of rank & duty confusion remains as strong as ever.\n\nThere is a map displayed at one of the entrances to Caestre, showing where every machine gun emplacement for the defence of Caestre is. Practically every possible stretch of approach is covered, even in the rear.\n\nAbout a mile this side of Caestre, and about half a mile that side of the railway I noticed a large quantity of barbed wire entanglements; extending to a\n\nwidth of a couple of hundred yards; with a quadruple wired fence in front of them. Behind the entanglements was a fine series of trenches, & these were labled \"main line of resistance”. It seems to me from this that falling back on Caestre the defenders of the front line will hold that & do as much execution as possible while reinforcements fill the main line, & other trenches to the rear, when the Caestre defenders\n\ncan retire through this line & leave the oncoming hordes to become committed in a bloody attempt to assail a well selected & fortified line. The cost of taking the main line of resistance, would, according to those plans, be simply frightful & long even for Hindenburg. May the scheme be followed out.\n","11":"\n\nVery quiet but busy day today.\n\nWere no parades, and during the morning commenced to read up some pamphlets I have shelved for some time. In the middle of this Mr \n\nGarland, the WO. came along with a request for me to clear up some concert party stuff which is reposing in the end of the dental hut, to be used for patients in the event of sudden offensives. Sorted out the gear\n\nthen it was dinner time.\n\nSwanson came over during the work & lent me a couple of Educational Gazettes, which I appreciated. He is still with the Artillery as medical detail, and having a good time.\n\nDid some good work on notebooks this afternoon, slightly interrupted by adjusting the front of the bivouac to deal with sudden heavy showers.\n\nConversational French, second\n\nlesson, with the Interpreter Mr Minster, tonight, followed by a good Bible study period discussing Justification.\n\nThe \"acceptance by faith of the atonement” by Christ for our natural sins (which is Justification), is a stumbling block to many. Although the question was clear to us and made more real perhaps by the discussing the point remains:\n\nHow are these things to be made clear to the unthinking drifters.\n\nThe \"practical difficulties” evening should go a long way to clearing this vital point up.\n","12":"\n\nSince writing last I have gone through various stages of dissatisfaction with the slow moving lazy members of the concert party who are spoiling the good ones. As a result I have helped to thoroughly ‘rouse it’ up, & got a live man (apparently) for the position of musical director. He’s Corp. Edgar of the Motor Transport. By resigning my seat on the committee I have made room for\n\nhim, and relieved myself of a great deal of responsibility at one and the same time, without preventing myself from extending the same practical help in the future as in the past. I shall do the burlesque work.\n\nMeanwhile the study circle have plodded along, and now assure us of their assisting probabilities in the future, sufficient to justify us extending the movement.\n\nAn hour after the concert party business was cleared up I got a meeting of all the known teachers in the unit, & we decided to have discussions in committee on the extension scheme.\n\nTonight I am working far into the hours to clear up back correspondence. Jack Woodyard, having relieved me of the Arithmetic course, has enabled me to pay more attention my own work & letters in the future.\n\nThese scrappy notes are the direct result of my midnight energy.\n","13":"\n\nAs usual under such circumstances, I have let the schemes of unit recreation & improvement run away with me to the extent of one week.\n\nA common dispute with Vic Hall born of irritation produced by his tendency to make every fine point a subject of endless discussion (helped ably by my\n\nirritable self no doubt), led to my leaving the bivouac for a few days since I have been on night duty. I returned to day, but I am afraid that, for my part at least, it will be hard to get on to an intimate footing again. He is very clever, and probably more capable than I as far as work is concerned; but the endless discussions that are always provoked by his justifications of himself of his actions grate on my nerves. He is supremely egotistical, and\n\nhe was evidently spoilt as a child, which accounts for his childish desire to prove himself right, and reluctance to give way in the smallest trifle. Never mind, we may get on alright now; in any case we can knock along in the bivouac with Burt Simmott, without any trouble till such time as we leave here.\n\nIt is curious to note the change that has taken place in our attitude to one another since we took over the old bivouac\n\na few weeks ago. Our first disputes were tempered with a natural desire to get to the bottom of each with a view to knowing each other better. The later disputes were characterised by less tolerance. For my part, I was very intolerant & quite wrongly so. Still it seemed to me that no amount of looking into disputes and settling points would do any good so long as one of us was selfish & self willed. I dont feel at all inclined to be anything more than an acquaintance\n\nto Vic. now because it appears we are incompatible. At the same time I have gained a great deal of good from his company.\n","14":"\n\nAfter two or three committee meetings the scheme was put into practice yesterday. My first English class was about 30 strong, & the Arithmetic nearly as many. I went to the Psychology in the evening, and enjoyed a good lecture by Barlow.\n\nI noticed Capt Bruce was there.\n\nNow we are to go up the line.\n\nEverybody is packing up, and a new excitement is abroad. We shall discontinue the classes after tonight, because some of us will go up tomorrow afternoon. Plenty of hard work is required to outline some sort of scheme for continuing the classes up the line. Correspondence will meet the difficulty in the main. If we do something while it is quiet up there\n\nit will mean a great deal. of help.\n\nWhen we come out again, the scheme will automatically start again.\n\nI was talking to some German prisoners who were taken at the capture of Merris. One was a Reg. Medical Officer, who had studied at Munich; another was a private, who had been in the original German attack on Belgium, & who, through a 15 years stay in Belgium, could speak French fluently.\n\nHis attitude was that power is futile: The more we advanced the nearer peace would be, because the civilians & soldiers of Germany, while thinking quite differently from them, had to act with the military party. The soldiers are so supervised that they may not leave either the front line trench or the rear without a pass. Military police prevent it. As for the civilians: well, we know how much power the Reichstag has.\n\nI tried to speak as man to man. His friends did not understand French so he had nothing to fear in speaking thus to me. In any case, he told me, he was only speaking the thoughts that are in every German soldier’s mind.\n","15":"\n\nOn Tuesday evening we held a committee meeting \nto\n to decide, among other things; how we would carry on up the line. While the meeting was in progress, news arrived that the orders for proceeding up the line were cancelled. It seemed that a divisional move was imminent: Accordingly, classes were not discontinued.\n\nI spent most of Wednesday in writing up \nand\n articles & reports of our scheme\n\nfor \"La Chatte”, the unit magazine. Classes were held in the afternoon as usual & suddenly, in the evening news arrived confirming the rumours of a divisional move. The","16":" Div. were coming to relieve us, in fact their advance guard came during the evening. We were going out to join up the other Australians (who \nwere\n are in the Somme), and, as an army corps go into the Rheims battle. The latter part was pure rumour.\n\nYesterday evening we took the waterproof sheets off the roof, & partly dismantled our fine old bivouac, leaving a shell which, in its half trimmed condition, reminded us of the evacuated cottages.\n\nLiterary circle box of books, the \"Chatte” box, & the Concert party box, were hurriedly packed & put on the waggons, & I proceed to sort out the books I really needed for a possible fortnight away from the waggons, \n\npacking the rest in a biscuit tin for secret conveyance, by motor ambulance\n\nTo day the main body of the 88th British Field Ambulance arrived, and enterprising members of that unit took over our bivouac. At the present moment they are busily engaged in hammering & otherwise attending to it.\n\nThe various members of our unit are spread about on the grass round the pond, having lost their homes,\n\nwhile their packs recline in alleged straight lines on the \"parade ground” this side of the pond.\n\nI chatted to one of the 88th Amb., & he told me how \nthis am\n this unit retreated with the 29th Division from somewhere up near back to Abiele, by way of Bailleul. There was not a great deal of artillery fire, but the bearers found it very difficult to evacuate their patients\n\nas there was never a dressing station in the one place for long. Also, the bearers had to keep a wary look out for their location, because Fritz advanced in such an irregular line, that they could never tell exactly how far away the nearest Fritz advance guard was \naway\n, although they might know how far away a particular part of the line was, \naway from them.\n\nConfusion reigned.\n\nReinforcements arriving by lorry were told to fix bayonets at once & hurry into the line, whence \nthey\n many shortly returned wounded, to be taken away by the lorry that brought them up. Infantry men wandered about the fields, some going towards the line but many away from it; all of them having lost their units.\n\nIt was into such a state of affairs as this that our Division came, detraining at the siding which is in view of this camp, in the dip between us & Hazebrouck. (Looking towards the line at the nearest point – Merris – Hazebrouck is on our right). As soon as they were detrained they were told to fix bayonets & hop right into Fritz to prevent him from reaching Hazebrouck. Many stragglers told our\n\nboys that it wasn’t much good, Fritz was coming on in swarms, & \"You can’t stop him”. This sentiment, which has repeatedly been referred to by our boys, \nis\n was undoubtedly voiced by many stragglers. I hesitated to write it until it was confirmed, as it subsequently has been by civilians & the British soldiers themselves. In justice to the good old B. A. I must add that the stragglers\n\nseemed to have been so demoralised as to voice it. Apparently some of the younger, or less capable officers were responsible for a great deal of the demoralisation, by the frightful example they set.\n\nHowever our boys went in and marched, or rather deployed right up to the road beyond Strazeele before they struck a Fritz. Here they came upon the scene of the glorious stand \n\nby the Guards, most of \nwhom\n the survivors of whom they had passed on their way up. Here they dug in.\n\nFrom that day to the present they have held \nfirst\n a front first from Meteren \nalmost\n to the Nieppe Forest, then \nfrom\n round Meteren, & lately from in front of Merris to the forest. In the first day after the rush there was only the Aust 1st Div. in the front line on the whole sector protecting\n\nHazebrouck. What divisions there were behind I don’t know. I do know, however, that our Div. General, Gen. Walker was put in charge of the defence of Hazebrouck with power to collect the stragglers & assimilate them into the Division. I heard he collected 3,000. At any rate I know that quite a number were attached to the Division at the time that the Guards were out\n\nresting round here, & that our boys reported very favourably of their work. Our chaps are under the impression that it is the officers who are to blame for a great deal of the blundering & demoralisation.\n\nOur record in this sector is brilliant. First the formation of a front line, then a brilliant if abortive attempt to gain Meteren. In this case there was\n\nno preliminary barrage, & a perfect hail of machine gun \nbullets\n fire from the ruins of Meteren met our boys. Then in various raids our line was advanced a fair distance. Finally Merris a large village was captured. Add to this the large number of raids for demoralising the Germans, which our infantry carried out (at one time they had a raid every night for a\n\nfortnight or so), and the record is complete, with a gain of some \n3\n 2 or \n4\n 3 miles on a very narrow sector.\n","17":"\n\nYesterday evening at 8 pm we marched out of our old Main Dressing Station where we had spent so many weeks, and marching round the siding to the outskirts of Hazebrouck, boarded motor lorries at 10 or 11 p.m.\n\nSoon after we started many beams of searchlights began to \nseen\n appear, betokening the approach of our old\n\nfriend the Bosch on a bombing raid. As it subsequently turned out, it is a wonder we did not receive attention; for we were a pretty long column (the whole of the 3rd Brigade) & for part of the time at least, we had our headlights blazing.\n\nAfter we had left our old camp, by a remarkable coincidence, Fritz dropped \nthree\n 2 egg bombs in it, & five aerial torpedoes round, about.\n\nThat was the first time it had been bombed since we first formed it.\n\nLanded at Hoer at 1 A.M, waited interminably in a share for \"comforts fund” cocoa & Australian biscuits, then started on a 4 kilo march. I was so tired & sleepy that I almost went to sleep \nstanding\n as I was walking along.\n\nReached Questede (where we formed up the 2nd Field last Nov.) \n\nand dropped down to sleep in the same farm grounds (now a rest camp) as before\n\nEnglish class this afternoon\n\nRain all day.\n\nMud and quagmires.\n\nSaturday 3rd Aug.\n\nIt has been raining again tonight and Bar Smith has just arrived with the information that he doesn’t know much about wars, but this at any rate is a b...... The result of the rain!\n\nWe had a small English class again to-day, & otherwise I have been reading & making a few notes.\n\nThis afternoon Vic Hall came along with the information that he was thinking of taking up a course in economics with the University Correspondence Schools, & giving up all the study circle work except shorthand. He asked my advice. I told him it would be unprincipled, which he didn’t like, referring me to Barlow’s advice which was favourable. Because mine was\n\nunfavourable (I take it), we quarrelled. Anyhow he went off suddenly when I was in the midst of some straight talk. \nUndoubtedly he is rather petty & mean. So mean is he, that because he has been incapable of organising the Scheme, he feels justified in clearing out. Thus he is not great enough to play a small part\n\nWell I suppose we are all like \n\nthat at times, but I cannot be favourably disposed to drawing out of anything, either in my part or on anybody else’s. Perhaps I could have done more good with Vic by speaking mildly, & not abruptly & rudely as I did in fact. If I had, would it have made him worse? In that case what would be the best course.\n\nThis is the first case that\n\nI have come across for a considerable time, where my acquired tact has failed me. I have been unable to cope with the difficulty, chiefly, I suppose, because I was not humble enough to avoid treading on his corns & wounding his tremendous self pride. Perhaps by working myself into his affections I could have done more.\n\nMonday morning\n\nWe were supposed to be moving out at dinner time, but that is evidently knocked on the head, for the 9 oclock parade was dismissed on account of rain & nothing more has happened.\n\nSince then, taking advantage of an attempt by which Garner was trying to show Vic Hall the mistake of applying himself too much to the acquiring of knowledge, in which I detected the self satisfaction & egotism referred to, to show him the fundamental mistake he was making. Result: absolutely nothing\n\ngained but slight (only slight this time) unpleasantness. The harvest may be reaped soon or late. I spoke plainly enough, backed up by Garner.\n\nYesterday morning Teddy Rutledge (the spoilt child kind of major who presides over the Concert committee) took us out for a long route march through Hueringhem where we had cocoa on the way down, & back through woods & side lanes. We were amused by the laden variety of bearers on the way down. They would, from time to time give excellent\n\nimitations of Teddy’s querulous drawl, such as: \"What about a long long Trail.” (reference to his song obsession); or \"What are those flies doing on Kitty’s legs? (he is in charge of transport); or \"This is the right war, it’s on my map. A propos of the last remark someone added sotto voces \"It was a good map in the last war”.\n\nDuring the afternoon I wrote to Rita (from whom I am dying to get the next batch of letters) & did some other reading & writing. In the evening I did some shorthand.\n\nTuesday 5th August\n\nLeft (Questede) Quiestede at 3 p.m today in rain.\n\nDuring the morning, while I was drawing some water from a water bore in the courtyard of the farm, the Colonel came along and in passing asked me if I had noticed the Chapel in the corner. I went in with him, through the ordinary cottage door of an ordinary whitewashed cottage, which formed one side of the quadrangle, whose other sides were barns, and then through to the right. We went into what appeared to\n\nbe an old store room, but when my eyes became accustomed to the light I was able to make out the old but beautiful Gothic work on the ceiling or rather supporting it. At each corner of the room these arch shaped things (I cant think of their name) formed an artistic medium between wall & roof. They are familiar to all who have seen gothic chapels. The maid told us that there were, or had been, four such chapels; one at each corner. She told us that the place\n\nhad originally been a chateau belonging to an old family.\n\nIn the light of what I had learned from the Colonel’s very kindly given information, I looked in the whole pile of buildings anew & from a different point of view. I found that the form of a square (made up as \nreferred\n explained above, by barns & a long cottage) was \nbuilt\n formed by barns & such structures on to what remained of old buildings. At each corner was a round tower\n\nwith loopholes, looking strangely at a place sandwiched in with rickety typical modern French outhouses. The stream that we had to cross by means of a rickety bridge (made by laying planks over the axle in a pair of wheels sunk in the water), evidently formed the moat in old times.\n\nAnother point of interest was the fact that over the arch which led to the big barn (forming the side opposite\n\nthe cottage) was a coat of arms, - a rose or some such emblem surrounded by floral work. The big barn was C section billet, & was also used for concerts, as we could see from the chalked up notices of previous visits by evening concert parties.\n\nPassed through Hueringhen & then through Blecques, where I noticed a very old church in pure Gothic style, to Helfaut, where we had tea in a paddock \n\nAfter tea Tom Smith & a couple of others strolled with me into the village, saw the start of a hurdle cross country horse event (for officers – British – only); bought some biscuits at a good Y.M.C.A. where Tom played ping-pong, & referred to Stan Dalton as a modern Drake, because he dallied with the game; went into an estaminet & had coffee or beer, & Tom became almost faint when, in answer to a half hearted demand for rum the \n\nanswer was in the affirmative.\n\nWe are now, 27 of us, in one of our old friends the horse-boxes, at Wizerne, (where we were once before) bound for the Somme. The news came out rather suddenly yesterday. Before then we were under the impression that we were going to the Boulogne area for a rest. Now it seems we are leaving the train at a place the other side of Abbeville, whence we shall be transported by motor lorries\n\nstraight into the line near Albert.\n\nThe 3rd will be running the A.D.S. – which is the most forward Ambulance position (the bearers are always in the forward area, whichever post their unit is running, unless things are quiet) and it appears there is likely to be a stunt on. I hope that the bombing experience the 3rd underwent on their last hurried trip to the Somme, will not be repeated. The hurried recall either for that matter.\n\nLovely evening – clear & warm\n\nWednesday 6 August\n\nThe journey through the night was accomplished quickly, but it seems to me a terribly long way round. Since Jock took command (it may be merely coincidence) we have been subject to better treatment on the march or move from place It may be that Monash, who replaced Birdwood in command of the Aust. Corps. recently, is responsible for this. He is renowned as a advocate of the minimum amount of marching for troops; & he put it into practice with the 3rd Division, \n\nwhen he was in charge of them.\n\nSo we move more quickly now, & more comfortably: coffee or cocoa supplied by Y.M.C.A. or Aust Comforts Fund appears at stopping places. Last night at Wizerne we each had a cup of cocoa & 10 White City cigarettes; which are above the ordinary run. At the same time, there should be quicker communication with the Somme from the Northern sector, than a night’s railway journey via Abbeville.\n\nAt present we are dodging about a \n\nfew kilos the other side of Abbeville from the line. We detrained the transport at Pont Remy, & now are returning, with frequent stoppages, to a station not far away, where we are to detrain.\n\nThe next move will be, I understand, by motor lorries from a point about 3 kilos from the station, straight up to the line. The latest papers show Fritz to be retreating from the Albert Sector, probably because of the new line near the Aisne which\n\napparently threatens his flanks, so it is fairly certain that we shall go into some hot stuff. My opinion is that it is far more pleasant, from the personal feelings of the soldier towards shell fire, to be retreating than advancing. In retreating, the artillery fire is often quite small because he has no time to bring his guns up straight away; but in advancing there is always a hellish concentration of shell fire\n\nSunday 10 Aug 1918\n\nMarched out of L’Etoile, near where we detrained, & in which we spent a very comfortable day, to a point along the road where the infantry of our brigade were ahead already resting by the road side. After about an hour’s wait a pack of motor char-a-bancs arrived, & the whole collection of us boarded them. By now news had arrived of the commencement by our boys, the Canadians, Tommies \n\n& French, of an offensive over the whole of the Somme area.\n\nVery rough motor ride over by roads during which we tried to sleep, but failed miserably. Somewhere about three oclock in the morning (it may have been earlier) we descended just outside Amiens, & marched to a big school, where we found our transport had already established themselves. Had tea & went to sleep on the top floor of the private quarters.\n\nNext morning our tent subdivision were put on cleaning up two or three large class rooms, converting them into dressing rooms & rooms for housing patients. That afternoon the bearers went up the line & we were ready to receive any overflow of patients.\n\nThe news up to then was that the 2nd 3rd,","18":" &","19":" Divisions were all up the line & had advanced a considerable distance, & had captured thousands of prisoners & many \n\nguns. We saw two or three thousand prisoners marched through Amiens that day. Les Frayne & I walked up to the","20":" Field Amb., overflow walking-wounded post & found the lorries busily taking away load after load of wounded while a few number both of ours & Fritzs were lying around in the grass outside the marquees, drinking cocoa, & eating biscuits. The scene was a busy one.\n\nLater Les Frayne, Les Burnett (both \n\nin B Tent Sub) & I went for a walk along the canal. I was struck by the terrific desolation of the city. It is not shelled nor bombed now; but all that can be seen is the preoccupied military life. The civilian life is dead except for the very infrequent old men & old women one sees outside old houses doing nothing. \nOthers\n The desolation of the town, which is of a great age, is impossible to be described. We noticed where all the roads & the bridges\n\nover the Somme canals had been ruined when Fritz was threatening the town, & also the various notices appealing to men not to loot the houses. Most of them, if not all, were nailed up, & guards on the canal bridges prevent soldiers going to the city & principal part of the town. That is, I take it, practically desolate. We saw the cathedral from its undamaged side at some distance, & admired the wonderful predominant\n\nsilhouette it made against the sky. We then sat in a moored boat in the canal, with trees, brushing its sides; for our view, backed with houses punting the canal. In normal times at the period of the evening, the promenade at the top of the canal embankment would have been thronged with people (normal war time of course); now it was absolutely deserted. On the way back I chattered to four old civilians, three women \n\n& a man, who were seated in front of a kind of tenement building (it was not unlike a Bermondsey scene). They were overjoyed with the good news.\n\nNext day we worked till dinner time & then we were to have gone on night duty, but received sudden marching orders instead. Inside of an hour the waggons were packed & the transport together with us tent sub. men marched out. We went through Daours, a \n\nbut knocked about village (the most forward bombarded village I think), where we had tea by a tree lined canal, & then on to Villers Brettoneux, through the old forward area, making 16 kilos or 11 miles in 3 hot dusty hours.\n\nShall I describe Villers Brettoneux or just leave it to the imagination as about 4 times worse than Fletre, already described? It is just an organised heap of bricks & smashed up\n\ndomestic things. The church has just one fragment of wall standing of its former beauty.\n\nThe advance forward had cleaned up a room in the school, & here we had tea. Then Les Frayne, Les Burnett, George Goode & I went on guard over the waggons for the night. Going on guard immediately after such a march was not cheerful, but had to be done. As soon as we arrived\n\nFritz came over flying low, & dropped a few bombs round about. We soon found a reasonably comfortable cellar, & the others got to bed while I went on the","21":" shift. No more bombs came anywhere near, & I turned in about 12 & got to sleep somewhere near 4 oclock.\n\nThis morning when we got up, orders had arrived for us to move to a flour mill (where I am writing this)\n\nnear the main road where it leaves the village. While waiting to move off Stan Walton & I walked to the railway station where the name of the village still remained, but where the line showed sad usage from shells, then out of the village parallel with the line, following a tank track.\n\nWe saw where the tanks had massed & hopped off the day before yesterday; where our line\n\n \t\n\n"}}