{"Document Name":{"0":"Diary_0277","1":"Diary_0277","2":"Diary_0277","3":"Diary_0277","4":"Diary_0277","5":"Diary_0277","6":"Diary_0277","7":"Diary_0277","8":"Diary_0277","9":"Diary_0277","10":"Diary_0277","11":"Diary_0277","12":"Diary_0277","13":"Diary_0277","14":"Diary_0277"},"Date":{"0":"unknown","1":1149.0,"2":1150.0,"3":1166.0,"4":1208.0,"5":1212.0,"6":1221.0,"7":1222.0,"8":1223.0,"9":1224.0,"10":1225.0,"11":1233.0,"12":1234.0,"13":1240.0,"14":1241.0},"Entry":{"0":"\n\nFrance\n\n","1":" &","2":" 1917\n\nThe old town of Boulogne looks well in the vicinity of the Quay but as we climbed the slopes on the outskirts we passed through shockingly made streets, sordid squalid tenements, and a slum population. We slept in what are called rest huts, and although it was sternlyprohibited many of our boys had a festive time in Boulogne that evening.\n\nNext day we were marched back to town & entrained in cattle trucks for our destination. It was a slow moving train & the little French\n\n\n\n \n\nchildren, who are inveterate cadgers, breasted the embankment along the line for cakes and pennies. Most of the women looked sad and careworn. After travelling some distance we passed through cities of tents, accommodating all branches of the Imperial & Dominion troops, past hospitals & \ngraves\n cemeteries until at last we were dumped off at a point close to the sea.\n\nWe were marched to a storehouse where rifle & bayonets, spick & span & greased, were served out with great celerity, & finally we reached our training camp where we were to get a final polish up before going onto the front line. This camp was separated from the town of Etaples (called by all soldiers \"Etaps\") by a stream\n\n\n\nthe bridges of which were manned by the well \nble\n beloved military police. Altogether there must have been over fifty thousand men \nin those floored\n at this place living in floored tents. There were mostly Scotch and English regiments & every sector was well provided with mess rooms, canteens etc. I have no hardships to look back upon during this period of training. The food, in my opinion, was better than in Salisbury Plains & although the snow was plentiful the recreation huts were comfortable. We had concerts, lectures and a pretty good dry canteen. The wet canteen provided a very poor beer for half a franc a \nfranc\n pint. The best treat I can remember was a concert given in our mess room by the\n\n\n\nFirst Lifeguards Band. I have never heard a military or civilian band play operatic selections equal to the \nbands\n First Life. An amusing feature of all sectors was that the \"clink\" was always established at the corner on the road so that detachments passing up and down would \nsee\n be able to view them. Inside this barbed wire enclosure Sandy McTavish who had been \"fos'o the noo\"could be seen strutting disdainfully up and down whisking his kilts and looking defiance at the whole world. It was noticable that the Australians fraternised more with the Jocks than the Tommies & used to go to each others rescue when the military police were effecting arrests. The Aussies and Jocks had not\n\n\n\nthat disciplined patience \nthat\n which is so marked a characteric in the English Tommy Atkins, who is also a trifle more conservative in his ways.\n\nThe \"Bull Ring\" which we had been led to believe was an awful ordeal to go through turned out to be not as severe as Salisbury Plains. We had some hectic digging, bayonet fighting, instruction in the manipulation of barbed wire & various other tricks in the wholesale murder business, but there was nothing in it to make any healthy man squeal.\n\nOne of the most popular resorts in the Camp was a big cinema show, 3d admission, two sessions an evening, & it must have been a gold\n\n\n\nmine for the people running it.\n\nThe news came one day that we were to go up to the line in order to make the acquaintenance of Fritz, so most of us got a stock ofdainties at the canteen.\n\nAt 4 o 'clock in the morning we had to turn out for breakfast. It was pitch dark, and the snow was thick on the ground. After a Scotch breakfast we had to load up everything & over our packs we wore a long macintosh cape, making us look like a mob of dromedaries. There we were - standing in front of the great recreation hall with the snow pattering steadily down - for an unconscionable period. Miitary authorities\n\n\n\neither move off at a moment's notice or dwell in a certain spot till the troops are madwith impatience. Making all allowances for picking up absentees or checking generally the requirements or shortages of the draft, I can't see what benefit could be gained by keeping men for two hours in the snow, excepting, perhaps, to test their hardihood.\n\nAt last we made a start down the road & reached the large railway station at Etaples, where we had another long wait, but we beguiled the time by drinking milk cocoa (free) & eating cakes at a moderate charge. There were a number of Portuguese soldiers on the station & very nice fellows, but of course\n\n\n\nwe couldn't understand each other. They were mostly medium sized men, sallow complexioned & dressed in a drab uniform like the French. They did not convey the impression of being a sturdy fighting race, and during the time I was over there I never heard of them sharing in the heavy fighting. I believe they were mostly used in supports & . Anyway these Potuguese knew about Australia & several intimitated that they would like to go there. Late in the evening the train sped into the terminus, the town of Albert. Long before we reached there we could see the strange spectacle of the gilded Madonna holding the infant Jesus in her arms dangling head downwards\n\n\n\nfrom the tower of the Cathedral. It had been struck by a shell, & it was surprising that such a large metal structure did not break away by its own weight. Most of the houses in the town had suffered from shell fire, as we noticed on our way to a midday rest camp. In the evening we were in town on leave but it was dark & miserable, most of the former inhabitants were still away. There were a few shops open for the sale of odds & ends & \nthere were\n two establishments for the sale of beer. An inspection of the first one satisfied me. Hogwash beer was being served out in 2 lb jam tins at a franc. A woe begone looking middle-aged woman\n\n\n\nwas serving out the vilest slush I have ever tasted & to style it Beer was downright blasphemy. The woman ejaculated \"Merci Monsieur\" as she raked in the francs, and it occurred to me that instead of looking doleful she ought to have worn a most serafobic countenance on the profits she must have been making for I'll guarantee that for a few pence worth of ingredients I could have made a gallon of better flavoured beer. And to see the Tommies donating almost a day's pay for a trifle over a pint!\n\nNext day we commenced our march over bad roads,the land on either side being pockmarked with shell\n\n\n\nholes. We had begun our pilgrimage through the tragic Somme. Desolation everywhere - broken barbed wire, empty shell cases, not a human being in sight, not even a cow or a horse.\n\nLate in the afternoon we reached an Anzac Camp - Semi-circular galvanized iron huts mounted on flooring a few feet from the ground. Some melancholy traces of former fighting were here in the shape of hastily filled in graves, some of them bearing the inscription \"An unknown British Soldier\".\n\nNext day early while it was raining we pushed on & \nleft\n left the road to cut across the country on duckboards which had been\n\n\n\nlaid irregularly among the shell holes. A slip off any of these duck boards meant immersion in one of the holes, all of which were almost full of water.\n\nI heard one of the boys behind me say:\"Old Dad (meaning me) is bound to come a cropper before we get through\". All the same I got through without an accident.\n\nIn the afternoon, all more or less exhausted we reached the wreck of a fine village, the streets of which were cobblestoned & the survival of some really fine houses were evidenced by the walls & gateways. In France the term village means more than it does in England, because\n\n\n\nan aggegation of farmers some of them very well to do will have their dwellings together instead of living on isolated \nfor\n farms - in fact many of these villages are really small towns.\n\nUnder the impression that we were to put in the night at this place, we threw off our packs & settled down to rest, but in about ten minutes we were peremptorily lined up by a hard faced sergeant major who carved us into three lots like a butcher & hardly giving us any time to say Good bye to our mates,the section to which I was allotted were marched off. We crossed a small railway line & past a magnificent\n\n\n\nsystem of dug outs which had survived the most ferocious shelling. These, though we did not know it at the time, were the outer defences of Bapaume, which a German General expert had declared to be equal to a second Gibraltar. It was beginning to get dark when we marched into the smoking ruins of Bapaume. This was a couple of days after the Germans had evacuated the town. The only troops in the place were Australians and they were lounging about bewailing the fact that there were no canteens established & discussing the probability of the Australian comforts fund happening\n\n\n\nalong in the next day or two. Our small party were taken to the","3":" battalion billets, an old machinery depot off a disreputable looking right of way. Here we were handed over to our new platoon sergeant who told me we were in \"boskerino\" quarters as he proudly led us up a shattered staircase into a grimy looking room where special doorways had been made by obliging shells. We were shown floor space on which we threw our accursed equipment & drew our issue of rations. Our new comrades gave us curt but cordial greetings. Most of them were seated round a Kerosene tin doing duty as a stove.\n\n\n\nand were \"chatting\"their underclothing, i.e., removing the vermin therefrom & casting the insects with caustic comments into the fire. This gruesome feature of the actualities of warfare made me shudder but our Corporal said comfortingly, \"You'll soon get used to them, old boy; there's no escape from them\". And so I eventually found. Even the officers, who have special privileges in the way of changes of clothing, & can keep their blankets separate & have orderlies or batmen, as they are called, to wash their things, can't escape the pest altogether.\n\nIn the morning the weather was clear & bright\n\n\n\n& overhead there were two enemy aeroplanes at which our anti-aircraft guns were firing shrapnel. It is a curious sight. Where half a dozen shells have exploded you see half a dozen bunches of smoke like whifs from a cigar lingering in the air. It is a magic sight to observe an enemy machine come down in flames. Our boys raise a great shout while the poor devils in the plane are getting incinerated. \nWhenever\n In all our marching round about Bapaume we came across wrecked aeroplanes like so many shot birds here & there. Also stranded tanks. These ungainly looking monsters\n\n\n\nwere somewhat at a disadvantage at this time, as the Somme area on account of the soaking, yielding nature of the ground was awkward for operations. But an improved type subsequently was of tremendous service in the \nchu\n checking of Fritz.\n\nI was cast for duty in the Quarter guard, the prisoners being members of our own battalion, several for being absent without leave & a few for dodging out of action.\n\nOne young fellow had been given two chances but his heart had failed him when his platoon were at close quarters in the evening. I don't know what became of him - the fact of his being\n\n\n\na mere lad of 19 no doubt saved him from extreme punishment. In the Imperial British Army the death penalty is enforced, I believe, in the case of these \"squibs\", as they are called.\n\nWhen off duty from Quarter Guard, which lasted for a week, I took every opportunity to explore this ancient town. There was not a single undamaged house. Not only were the houses, cafes & shops in tumbling ruins but back yards and pretty little gardens where many a genial party had assembled were all shell holed & heaped with rubbish.\n\nThe grand old Cathedral presented the appearance of\n\n\n\n \n\nhaving been demolished by a Titanic hammer. Broken aisles, smashed monuments, costly stained glass windows, oil paintings of scriptural subjects - all mixed up in one awful heart rendering ruin. Down in a crypt we found a vast number of old human skulls. But there was no one there to give us any information about the old edifice.\n","4":" 27\n\nTown Hall Blown Up\n -\n\nIn the City Square it was noticable that the tall brick tower of the Town Hall had survived shell fire & the ground floor had been occupied by the Australian\n\n\n\nComforts Fund. In fact it had already distributed a large amount of tobacco, cigarettes & cocoa. On this day as I had to go on guard at midnight I told the Sergeant to wake me up at 11.30 so that I could toddle down to get a can of cocoa for the guard, an intimation that it would be ready for us having been already made. When the sergeant shook me up before 11.30 I rolled over in the irritable sleep of exhaustion & told him to go the land of good intentions.\n\nJust before 12 oclock I had to get up, & they asked me if I hadn't been awakened by the explosion. No I had not. \"Well\" , said a comrade, \"I thought everybody would\n\n\n\nhave heard it for miles\".\n\nJust then the Sergeant came in as I was about to take post, 'If you had gone when I woke you up first\", he said \"you'd have been blown to glory with the others.I can see you are reserved for the hangman.\" Next morning they were still digging any wounded and dead men from the debris. It was believed that the tower was blown up by an infernal machine timed to explode at a certain period after the Germans had cleared out. I couldn't ascertain how many victims there were for we marched away the next day to a place named Mametz,\n\n\n\na choice military camp salubriously situated in a muddy area.\n\nWhile here I went over the field of Pozieres - under snow- and it was a sad & desolate spectacle; all the trees about there bare & stricken by shell fire as if by a comprehensive blast of lightning. I was told that our glorious dead lay there for months before being interred. On this field the Australians won, lost & regained their ground with a dogged pertinacity unsurpassed by any of the glorious achievements of the famous Light Division in the Peninsular War.\n\nDuring our rest at Mametz\n\n\n\nwe marched to a warm bath house where a sort of shower had been fixed up by perforated jam tins adjusted to a pipe. We were also able to exchange our shirts & socks for supposed disinfected clean ones. It was, however, a most unsavoury place. The floor needed scrubbing;the men who served out the clothing were a mangy looking lot, & some of our fellows said they found \"chats\" on the alleged clean clothing handed to us.\n","5":" to","6":"\n\nWe marched back beyond Bapaume,this time to be in Supports for the front line. The weather was wet\n\n\n\n& miserable when we camped on a semi-swamp behind some batteries where there were some gigantic naval guns. We had some boards & rough bits of timber over which we spread tarpaulin & managed to get some sleep & keep reasonably dry, the guns meantime roaring all night. The next evening we cautiously made our way in small squads to a hollow on the road passing to the village of Lagnicourt. There were a few dug outs in this place which were promptly grabbed by those who got in first. Two of my platoon mates - one a school teacher\n\n\n\nand the other a cabman - initiated me into the art of making a dug out. We had a couple of candles & slogged away until we were temporarily fixed up for the night, our roof being some tarpaulins and timber, but the ground was too moist for stability & we had a more or less miserable time until we went into action. Now while we were there Fritz's shells were coming with uncomfortable frequency & proximity.\n\nWe were in this position:we were to have a smack at Fritz in a few days & at the same time we were expecting that he might come over & have a bang at us. One might say!\n\n\n\nMajor Poole warned us to be ready in battle order & to rest with our boots on. At dawn when word came through that all was clear the Sergeant Major came to each dug out saying:\"All right boys, take off your boots & go to bed again.\"\n\nBed! Great Caesar, a trickle of rain water was running over my water proof sheet & gently insinuating itself into my blanket, so I crouched further into the damp clay side of our \"grave\" & fitfully dozed off again. We were expecting to go over any day now. On","7":" my platoon Sergeant Sharpe came to me &\n\n\n\n\n\ninquired my military age. I told him 44. \"Oh, but you're older in civilian life\", said the Sergeant; \"Now look here you haven't got the activiy of the young men, so I'm giving you a job as baggage guard down at the village (Vaulx).\"\n\n\"I came here for the real thing\", I said.\n\n\"Yes, that's all right\" said the Sergeant, \"you'll be all right going over - I know you're game enough, but we may have to come back in a ding dong hurry & then you'll be left behind, & you know what that means.\"\n\nI cut short further discussion by saying I was determined to go over with the boys\n\n\n\n\n\nand that if it came to a bolt home I could stop a few Germans being a good shot.\n\nCounter Attack atLagnicourt\n","8":"\n\nInstead of our fellows storming Fritz's position on the famous Hindenburg line he came over & captured our front line.\n\nWe were roared out at daybreak. Captain McDonald pointed out the line for my platoon to advance on & to make ourselves secure if the enemy were in strenth on our front. There is a somewhat dreamy sensation in going into action for the first time.\n\n\n\n\n\n\"So Fritz is coming over\", said a Corporal; \"I don't see any sign of him yet\". We were scattered by this time among the shell holes which were half full of water. As we advanced I saw a straggling mobin the roadway, some of their artillerymen. \"The Huns are coming: the Huns are coming\" they yelled.\n\nCorporal Sparkes, who was half an hour afterwards sniped through the head, gave them an encouraging invitation to join us & go back, but they moved on to safety. As we crossed the crest of a ridge we found ourselves in line with other companies all in extended formation, &\n\n\n\n\n\nthen the bullets began to whiz past our ears. Just ahead from a clump of bushes I heard the \"tack, tack\" of a machine gun, so I promptly popped into a shell hole & fired steadily the same as my comrades were doing. The firing ceased from the bushes & a white rag was displayed. As we advanced cautiously about seventeen scared Germans ran out with their arms up snivelling \"Mercy, Comrade\". The tension on our fellows' nerves was relieved & they burst out laughing. A couple of men were detailed to take them to the rear after they had been searched for concealed weapons. They were\n\n\n\n\n\nsurrendering in other parts of the field - and so we progressed past killed & wounded, leaving a number of our own poor fellows behind, the companies got mixed up; there were three lines stretching for over a mile on our front & they would be diverted according as to how the enemy showed a disposition to fight. I saw our Sergeant Major at one point order German prisoners to carry our wounded back. They haughtily refused, being under the impression that prisoners could do what they liked. He produced an automatic pistol & put a forcible exhortation on to them. They promptly\n\n\n\ntook up the wounded & the Sergt Major intimated that if they gave any trouble on the road they would be shot. Some of the German corpses had been very big men, but the prisoners were in a good many cases down right malingerers. An officer ordered me to search a couple of apparently wounded men for weapons. I found nothing wrong with them but blue funk & passed them back to do some work. Many of the prisoners made no pretense at being glad to be out of the mess. In one case a batch of Germans with two machine guns had played havoc with our lads & then when they\n\n\n\n\n\nsurrendered\n\nwere surrounded had the impudence to hold up their arms - they received no mercy.\n\nI lost a lot of good friends who left Sydney with me on the \"Ascanius\" and strangely enough they were quiet well behaved, sober men & calculated to make far better citizens than many of those who survived.\n\nIn the last advance up a slope we were shelled very steadily - in fact it was touch & go all the time. A few dozen of us got into the front line trenches that had been captured that morning. I found myself in a small trench on my lonesome. There was\n\n\n\nplenty of food & clothing left. Suddenly a dose of shrapnel opened over these trench lines. I crept into a niche in the wall of the trench & for fully half an hour these shells, which come with a underline hiss & explode with an angry gutteral roar, searched our new muddy homes. A few minutes after quiet was restored I looked out over the parapet. I saw some drab figures hastily diving into a trench about five hundred yards in front & emptied my magazine at them. Then there was a lull & Corporal Denny Reid shouted across as if he were in a public park. He told me to go over directly & join my\n\n\n\n\n\nplatoon Sergeant in another trench about 100 yards away. He told me some exciting & amusing incidents. Lieut Armitage single handed & without a revolver - just carrying the ordinary stick - captured a dug out containing three Germans & two machine guns. One of our platoon found a wounded officer in a shell hole & demanded his wristlet watch. \"Oh, no, no\" said the German, \"me officer\", as if satisfied that a German officer was loot proof. The Aussie's production of an automatic pistol, however, was an effective judicial decision as to ownership. Some good work had been done with rifle grenades, especially with\n\n\n\n\n\ntroublesome dugouts. A Mills hand grenade exploded in a dug out destroys or puts out of action any small \ngarison\n party that may be there.\n\nI cautiously made my way across to my platoon but no attempt was made to snipe me. There is a curious calm after a fight, & as we had completely out classed the enemy, regaining all we had lost there was no immediate danger of further attack. The trench we were in was little better than a water hole. On one side there were niches in the wall for food and bombs & niches to lie down in or repose half sitting up. The floor was ankle deep in mud. \nOn this\n Standing on\n\n\n\nthe ground. We were out of sight & secure from snipers' bullets. There was a cut earthy step so that for firing purposes we could stand up & take aim over the parapet on which our rifles with fixed bayonets rested. Two of us had two hour turns for guard duty which simply amounted to keeping a vigilant eye out for an attacking party, Sergeant (now Lieut) Sharpe and Corporal Briggs being in charge. Fritz kept his flares up all night. By this means any figures coming over the skyline can be detected. At 4 o'clock in the morning just as dawn was about to break the order was given to \"stand to\".\n\n\n\nEvery man stood up ready to seize his rifle on the chance of a morning salutation from the Huns. But nothing transpired & presently Lieut Armitage sauntered over from one of the other trenches with a gallon rum far under his arm. He sat at the end of the bench close to the corpse of a gigantic young Teuton. We had a stiff nip all round & it livened us up considerably. It had a fine bouquet, a quality of rum in fact that cannot be obtained for money.\n\nThe day dragged slowly on & we were discussing the probability of being relieved in the evening. We did a \nquickly\n quiet little bit of sniping at 800 yards, but the Hindenburg\n\n\n\n\n\nthe outposts, which we were up against, remained quiet & inactive.\n\nSure enough about 9.30 in the evening the relief came along, and although I was glad to get out of it I felt sorry for those young lads that were to get down into what looked like nothing else but a muddy grave. The relieved men from the other trenches were coming along, & we started on our journey in single file, the Sergeant leading. Suddenly, Fritz's flares went up & we knew what to expect. Like furious devils the shrapnel chased & burst over us, several men being knocked out in the first\n\n\n\n\n\n\n\nfurious blast;all the time we were negotiating the pools of water & the shell holes. Two or three young fellows who couldn't keep up wailed \"Don't leave your cobbers\". I noticed they were the most selfish fellows in the company - the sort of men who carry out the old army gag \"Blank you;I'm all right, Jack\". It always is the way with the men who believe in the Gospel 9 to 1;they are the first to squeal when in trouble. I tumbled into a shell hole with a comrade, the shrapnel meanwhile spreading about fast & furious.\n\n\"Where's my tin hat\", shrieked my mate, holding\n\n\n\n\n\nhis hand over his head to ward off possible shrapnel rubbish.\n\n\"I think I'm sitting on it\", I rejoined, and reaching down I seized his steel helmet & jammed it on to his head with a soldier's benediction & exhortation to keep quiet. I also said we had better remain there until the firing slackened down a bit, but he was too \"nervy\" & sped away after the others. I didn't fancy being left by myself & decided to track off the line of firing & make for where I knew the sunken road to be. Covered with mud I cautiously found my way to the sunken road in about half an\n\n\n\nhour & found the lads streaming home in hundreds. All the dug outs along the road were packed with \nfellows dodging the\n our men. Captain McDonald was there & told me to make my way past the village to our dug outs near the road \"only a couple of miles to go\", he said.\n\nBut fortune favors the brave, or the devil looks after his own. I pulled up at the Australian battery which had been captured by Fritz the previous morning & regained during our counter attack. They had hardly any room in their little hut but they made me welcome & put me on a box in front of their little\n\n\n\n\n\nfire. I was soon quite at home & found that there were some Melbourne printers in the bunch & we were soon comparing notes. The issue rum came along & I had a real \"woodener\". We chatted away & had some supper. Then the relieved gun shift came in for their rum & I, in spite of protests that I had had my share, received another stiff nobler. They explained to me that an issue had been sent for a full battery, but there were several men short so that there was a welcome surplus. All this time the guns were belching forth messages over to Fritz & when an officer came along he ordered\n\n\n\n\n\n\n\n\"Salvo\" , the guns of the battery going off simultaneously, making our little hut rock & shake with the concussion. I rolled over to sleep in a corner & had about eight hours uninterrupted repose. After breakfast these good fellows wouldn't let me touch my own rough rations. I made my way home to the dug outs & put in a few more miserable days.\n","9":"\n","10":" to 30\n\nI got a rest at the village of Vaulx as my eyes were bad, probably due to tear shell gas - in fact I thought my sight was doomed. The\n\n\n\neyeballs were like hot coals & tears gushed over them like spring water, causing acute pain.\n\nI rejoined my unit at a camp near Bapaume where we had a go-as-you please time of it until about six days before the battle of Bullecourt.\n\nDuring this spell I went over to the old Bapaume cemetery. Even this spot had not escaped the shells, some of the tombs & monuments being knocked about. The family vaults of the old families - the Bonifaces, Faunes, Meunier, Legrand & so on were undisturbed, but at the northern end of the cemetery room had been made for German graves, such imposing Hun names\n\n\n\nas Lieuts Barcke, Rumpf, Schultz, Becker, Schubert, Schriener, Brunkman & Kortz being there interred as \"Ruht in Gott\". Their regiments from the Garda Junker to the Reserve Korps being denoted.\n\nThe Australians had a quiet corner for the late Major R.K. Pybus 10\/4\/17, killed by high explosive;Lieut J.R. Kay,","11":" Battalion, killed in action 26\/3\/17;Lieut E.J. Clarke, 43rd battery, Australian Field Artillery, 15\/4\/17;Corporal S.W. Taylor, 41st battery, killed in action","12":"\n\nThere was a fine avenue of trees in this old cemetery from a great stone gateway on the main road to the crucifix which always occupies a commanding position at every \n\n\n\n\n\nVillage in France\n","13":"\n\nAll preparations were in hand for the long projected attack on Bullecourt & the battalion joined up a large proportion of the second division at Noreil, the base of operations. The shelling was particularly ferocious & the aircraft was unusually active.\n\nOn","14":" late in the evening I was detailed to go with a party carrying machine gun ammunition in panniers. This is a job I cordially hated. A soldier with all his impediments carries from 80 to 90 lb, & to further load him with boxes of\n\n\n\nbombs or panniers of cartridges is a beastly infliction. All the way we were subjected to casual sniping & an occasional heavy shell. We reached a sunken road \nwas\n where a welcome rest was called for. I lit my pipe & started chatting to a fellow, & when I looked round for my party found that they had gone on. Anyhow I got the direction \nto another another sunken road or railway cutting\n and started off on my own, having to avoid stumbling over dead bodies on the way & at last with a gasp of relief I toddled in & found Lieut Moore who was in charge. Then I got ready like the others for a short sleep. It\n\n\n\nwas still cold & I had no blanket; only my heavy overcoat. However I got hold of an old horrible blanket & was about to doze off when our bombardment of the German position commenced. It was a holy terror. I believe six hundred guns were used;the guns flamed & roared for miles. Nothing, we thought, could live under such a fire & yet the eight waves of Australian troops who were lying down waiting for the barrage to lift so that they could storm the German position, found that Fritz & his machine guns were ready as quick as the opportunity presented itself. Some of our men asserted that a lot of the division were killed by\n\n\n\n\n\nour own barrage. Anyhow this is certain, the enemy turned a searchlight on those long lines, or waves of men, & then \"poured in\" a most destructive fire. Two attacks were launched on the German positions but confusion was created by some person giving the order to \"Retire\". It was alleged that a German officer hoodwinked our boys with this order, but at all events it led to confusion. There was unquestionably some very brave fighting but all I can commit myself to saying is that the losses were not justified by results. I could never get - and I was not in a position to ask - a detailed coherent account of fatal\n\n\n\nBullecourt, but there was blundering somewhere. An inquiry was afterwards held as to who had given the order to \"Retire\" but I think it was fruitless.\n\nAt break of day they mustered us to pick up the rest of the 20th battalion & when we emerged from the sunken road what a sight presented itself - thousands of men were scattering to shelter slowly as if worn out;stretcher bearers were conveying the wounded. The dead were everywhere & surgeons were doing the best they could for wounded men who were too numerous to be taken quickly to the casualty station. We had\n\n\n\n\n\nonly gone a short distance when we were hustled back for bombs. There was disorganisation & some of the young officers were not equal to the task of straightening things out. In the afternoon all that was left of the 20th battalion were conducted by Lieut Moore along some shell swept trenches to an old German trench. We each carried two boxes of bombs over some exposed ground & then along an embankment. Shrapnelbroke fiercely over the track we were following. Two men in front of me toppled over dead just as\n\n\n\nwe passed some stretcher bearers serenelycarrying wounded - four men to each stretcher - as if they were on a fair field without danger of sudden death. We passed machine gun pits where men were sitting up as if playing cards or having a snack but on closer view their ashen faces showed that they were dead while outside the actual trench there was a chain of corpses for close on a mile. Eventually we reached our destination & proceeded to establish ourselves, having at certain points to run the gauntlet of machine gun fire. Here we were for several hours in a choice\n\n\n\n\n\ninforn\n inferno the enemy sending up white & colored lights, as if for pyrotechnic display, meanwhile shrapnel whiz bangs & high explosives adding to our casualties. A whiz bang went off in the chamber next to the one I was standing in & I thought my head was split in two, but the concussion made me deaf for a few days & eventually I found that the drum of my left ear was destroyed.\n\nLate at night we were ordered back to the sunken road & before \nto\n 2 o'clock in the morning taken back to clean up the long trench for the reliefs, & on their arrival\n\n\n\nwe left that field of slaughter & struggled back to Noreil exhausted & glad to find ourselves still alive. Out of a full battalion of over 1000 men we numbered about 154 men of the 20th, & that was about a fair average for every battalion in the second division.\n\nIt was a sad muster when we assembled at our quarters near Bapaume. So many of the old familiar faces gone for ever, so many in hospital & so many reported missing which meant that they were dead in some lonely spot or in the hands of the enemy.\n\n\n\n\n\n\n\n\n\n"}}