{"Document Name":{"0":"Diary_0225","1":"Diary_0225","2":"Diary_0225","3":"Diary_0225","4":"Diary_0225","5":"Diary_0225","6":"Diary_0225","7":"Diary_0225","8":"Diary_0225","9":"Diary_0225","10":"Diary_0225","11":"Diary_0225","12":"Diary_0225","13":"Diary_0225","14":"Diary_0225","15":"Diary_0225","16":"Diary_0225","17":"Diary_0225","18":"Diary_0225","19":"Diary_0225","20":"Diary_0225","21":"Diary_0225","22":"Diary_0225","23":"Diary_0225","24":"Diary_0225","25":"Diary_0225","26":"Diary_0225","27":"Diary_0225","28":"Diary_0225","29":"Diary_0225","30":"Diary_0225","31":"Diary_0225","32":"Diary_0225","33":"Diary_0225","34":"Diary_0225","35":"Diary_0225","36":"Diary_0225","37":"Diary_0225","38":"Diary_0225","39":"Diary_0225","40":"Diary_0225","41":"Diary_0225","42":"Diary_0225"},"Date":{"0":"unknown","1":1204.0,"2":1208.0,"3":1220.0,"4":1221.0,"5":1223.0,"6":1224.0,"7":1225.0,"8":1226.0,"9":1232.0,"10":1233.0,"11":1234.0,"12":1235.0,"13":1241.0,"14":1242.0,"15":1243.0,"16":1244.0,"17":1245.0,"18":1246.0,"19":1259.0,"20":1264.0,"21":1269.0,"22":1270.0,"23":1288.0,"24":1291.0,"25":1295.0,"26":1296.0,"27":1303.0,"28":1304.0,"29":1305.0,"30":1311.0,"31":1332.0,"32":1333.0,"33":1334.0,"34":1343.0,"35":1345.0,"36":1346.0,"37":1347.0,"38":1348.0,"39":1354.0,"40":1355.0,"41":1356.0,"42":1357.0},"Entry":{"0":"\n\n","1":"\n\nArrived here from Weymouth exactly a week ago\n\nDuring the ensuing time I was put in a draft for France, issued with kit for service gave in all extra kit not required so that I was left with what I stood up in & a change of underclothes.\n\nNext we were to leave last Thursday, then the draft was broken up & another lot including\n","2":" was formed.\n\nThat went away & I was in the next one when an idiot in my hut caught mumps & now we are isolated for 24 days.\n\nShall write home to see if Dad can come down for the week-end.\n\nThe routine is drill, fatigues & route marches.\n","3":"\n\nStill in isolation. Have continued so far with route marches every day.\n\nEvery day we march from 9 till 11.30 & 2 till 3.30 or 4, with the exception of some fatigues.\n\nYesterday we had an all-day stunt. We went to Wollop, a village near here, & had our rations at an inn supplemented by beer, cider & sloe gin.\n\nDuring the day we marched 20 miles & had a very enjoyable time.\n\nToday we were drilled for some hours and informed that we are to make part of an emergency ambulance to go to Bulford next Tuesday for the Kings Review.\n\nThat will be a new experience, to be reviewed by the King, but it will be rather tiring I fancy\n","4":"\n\nDefinite news today that we go to Bulford on Tuesday for King’s Review.\n\nHeard from Dad today that he cannot come down just now; I fancy it will not be possible to see him before I go over.\n\nWere drilled all the afternoon by a Capt.\n\nFeeling fairly fit & happy & am quite anxious to get over to France to try my luck\n\nIt will need to be good I fancy for the boys who left in the draft after the one I should have gone on have lost several wounded already\n\nIt is fairly obvious that we shall strike the big advance right in the middle\n\nI don’t feel particularly down in the dumps about the war, but I must admit that the Army has no attractions for me.\n\nI have not heard from Rita for weeks, but the U boats probably account for some letters from her. Nevertheless I feel a little anxious.\n\nWeather improving just now & the real Spring is apparently nearly on us\n\nAct 4 Scene 2\n","5":"\n\nAm attached to","6":" Field Ambulance at Wareham.\n\nDuring isolation I came to the conclusion that it would be useless to try to get back to the","7":" for even if I did it would be only to go stretcher-bearing.\n\nI therefore made application to be sent here as N.C.O., but although I repeated the application no reply was vouchsafed.\n\nTried to get paraded to A.D.M.S. when he reviewed us on the day before the King’s Review, but Craig, the W.O. refused, so I waited till after we had returned\n\nfrom Bulford & immediately went over to Tidworth to see Col. McWhae, A.D.M.S.\n\nHe, with no ado, gave me what I asked for,- a transfer to","8":" Field Ambulance with addition of a note recommending my dispensary capabilities.\n\nI had some trouble with Mr Craig & also with Major Johnson, O.C. Parkhouse, but we got over that & here I am.\n\nThe King’s Review was a days enjoyment.\n\nWe left early and arrived at Bulford marched straight to our position.\n\nWhilst we were standing\n\neasy there the King arrived & crossed by us to the Pavilion, for we were on the extreme left: More standing at ease while he reviewed the troops starting from the extreme right\n\nIt was a magnificent sight to see the thousands of troops lined up on that huge field\n\nI happened to be in the second section & was therefore quite near to him when he arrived at our end.\n\nThen came the march past.\n\nThe troops went to the right extreme of the field & wheeled round so as to come back pa the Pavilion\n\nin column of companies. As we progressed toward the other end we saw the first troops begin to march past. They were the Light Horse, and looked absolutely magnificent in their long lines.\n\nAfter marching quite a mile we marched past in fairly good order, the review was at an end.\n\nWhile the mass of troops was sitting down in the left corner of the field the King came along on his way out, & one & all left their food to help the parting cheers\n\nI came down here yesterday evening & was put in H Section.\n\nTomorrow morning I parade in front of the C.O. Col. Marks & present my credentials.\n","9":"\n\nYesterday morning I paraded to C.O. and he told me what I already knew, i.e. that the ambulance had three dispensers, but one was an infantry man. If his transfer went through he would get the place; if not I would be called up. \n\nFor the present my services were urgently required for fatigues.\n","10":" kind of him.\n\nYesterday & to day I have been spraying mumps huts & mounting guard over swill tubs; neither very intelligent, but fairly easy, & leaving plenty of time on my hands.\n\nAstonished to find that the infantryman dispenser is my old friend from Brisbane –Syd Baker.\n\nIt is rather an awkward position to be waiting to step into the shoes of such a decent chap.\n\nHe is self effacing & modest & I really believe I is anxious to consider all others before himself\n\nHe transferred to \n\nthe infantry a year ago & went to France with them.\n\nAn instance of his modesty is the fact that he went up to the Col. after I had told him about the dispensary job, & asked him to get a definite answer in regard to his transfer, as he did not want \nto stop other people\n from getting on, or words to that effect\n","11":"\n\nTo day I have been exerting myself in the role of cart horse, on blanket fatigue with the Q.M.Sgt.\n\nYesterday was Anzac Day, but being our duty week we worked (A Section), & were promised a holiday next week.\n\nAs a matter of fact I managed by luck to get a couple of hours of after dinner and in the evening I went to a show at the Empire with Alec Nunan, whom I have dug\n\nup in B Section of the Ambulance.\n\nHe & Billy & I were together at Tel El Kebir and on the journey over through France.\n","12":"\n\nCook’s fatigue today & on the whole easy. Scored a good dinner out of it anyhow.\n\nWent for a walk this evening and hired a byke for next Wednesday\n\nProbably be able to go to Weymouth on that day.\n\nWeather still warm and good.\n\nPress is clamouring for food economy & every day the submarine trouble grows before our eyes, so that it is becoming quite evident that despite Germany’s very serious plight, we are faced with a critical few weeks ahead.\n\nIf we can last out & beat the submarines this summer we are through. If not, all goes for nothing & Germany wins.\n","13":"\n\nHad half holiday in return for working (?) last Wednesday. Hired cycle for afternoon & starting at 12.30 p.m. for Bournemouth, reached there, after a splendid ride, at 2 pm\n\nFound Aunt had moved from Lincoln Avenue to Orcheston Rd, near Em’s.\n\nAunt was astonished to see me, & so was Bert, who by good luck, I found at home.\n\nEm amp; her husband (who is the Sec of the Chamber of Trade) were both in & so was Rachel. \n\nIn fact I think I saw all except those on active service.\n\nAs a matter of fact I was delighted with a very pleasant afternoon. The last time I saw them all was just before leaving for Australia, but they impressed me just exactly the same for all the change I have gone through.\n\nEven the dim memories I have of those days long ago, when as a little kiddie cousin Jim made me sing “I’m a Dandy” are all pleasant, They seem to make one at home & one of the , straight\n\naway, & that is why I like them.\n\nThey are all ordinary Hampshire people, none of them , unless it be Ron Plumer who certainly is a good business man, but they have hearts of gold Em especially is a hard working genial loving & loveable woman.\n","14":"\n\nRoute march.\n\nWe started at 9.30 & marched across country, including too big hills, to Worbarrow, a little village right on the sea. It is situated in a cove lined with large white cliffs.\n\nActually on the sea there\n\nwere only a couple of houses & a coastguard station, & after a snack of bread & cheese, when we went on to the pebble beach, we only sighted one man & a few girls, evidently spending a quiet holiday.\n\nOnly A Section went on this march & it was led by Capt Merrilees, known as Gertie & Mary Lees on account of his girlish ways. He appears to me to be a very decent chap, albeit a trifle fussy. On that march he was very good as a leader anyhow.\n\nBy the time we reached home we had covered\n","15":"\n\n17 miles, but I was in no way tired by it. In fact I went to a concert with Aleck Nunan in the evening.\n\nFriday 4th May\n\nToday was spent in lectures to give us an easy time after yesterday.\n\nThe morning lecture by Cpl Merrilees dealt with the circulation, & the afternoon by the same, dealt with the digestion.\n","16":"\n\nKit inspection in the morning & in the afternoon walked five miles to\n\nWool where I had tea walked back\n\nIt was hot walking there but very cool coming back for a chilly wind sprang up. Accomplished quite a record in walking back in 50 minutes – without a rest & an average of a mile for ten minutes.\n","17":"\n\nBrigade church parade in the morning attended by the General.\n\nSlept during the afternoon & went to the pictures with Alex. Nunan in the evening\n\nHe told me various\n\ntales of his adventures with girls at Harefield Hospital & in walking afterwards we met Scotty from Weymouth who is detail to a Battalion in this Brigade\n\nThe above artistic design was put in while I was being “spoken to” by a decent chap in the hut. He was telling me of an experience he had when at the Isle of Wight on 48 hour’s leave recently.\n\nHe met a teacher by accident who invited him home & in the end he spent his night in Freshwater at this residence\n","18":"\n\nInoculation today which I missed, & on that account Capt Straun (who is likely to be our major) lectured us on bleeding wounds & antiseptics.\n\nBoth were interesting the former characterised by the undressing (partial) of various of of number, & consequent stoppage of all kinds of arteries with numbers of imaginary lives saved\n\nA story brought up incidentally is worth recording: -\n\nTwo men had their legs shot off in a dressing station & the only stretcher bearer\n\nnear succeeded in arresting bleeding for ten minutes until help arrived. He managed it by kneeling between the men & pressing with thumb & long finger respectively in the groin pressure points, thus stopping four arteries with two hands.\n\nIn that & other deeds he was subsequently awarded the V.C.\n","19":"\n\nLaziness in not writing up before.\n\nThis is a perfectly horrid day muggy, wet & oppressive\n\nPlayed piano for two church parades this\n\nmorning & wrote letters till dinner time.\n\nThis afternoon I read & wrote - (the former a treatise on education) & this evening, after going to a picture show till eight, walked to the village & had cups of tea at the Congregational Hall\n\nLast Sunday our unit held a special church parade in St Martin’s Church in the second oldest in England. This was the first service since 1887, -- Jubilee Year.\n\nWe ran a choir & I played the harmonium.\n\nIn the afternoon\n\nI called on two teachers who live just outside Wareham, in response to an invitation sent through Davidson of Parkhouse. They entertained me well with food & music & showed me over the School\n\nOn Tuesday night I went to London on 48 hours leave & found Billy Molloy was staying at home while working at Headquarters.\n\nWhile in town I saw “Damaged Goods” the play on the great Scourge, & it made a great impression on me for it was well acted.\n\nIt is the first play that has been produced in\n\nEngland which deals with the vexed question of V.D. & the fact that it is the first is a good instance of the hideous hypocritical attitude of the present day moralists.\n","20":"\n\nWent for route march with full packs up, to Corfe Castle, an easy days march all told & made pleasant by the two hours halt in which we explored the Castle.\n\nThe chief point of interest as far as I was concerned was the fact that a\n\nsailor once stood on the top of the highest remaining wall. It must have required some nerve ----- more than I possess at present.\n\nWe traced the original castle. It stands (or its ruin does rather) on an isolated hill which is pointed both at the front & rear. The front faces towards where the sea lies some dozen miles to the south, & it is reached by a stone bridge over the dry moat\n\nImmediately inside the gate is a stretch of green sward sloping steeply upwards towards the Castle\n\nThe old staircase ran up\n\nfrom the left corner sheer up to the summit of the hill on which the Castle stands, while round the edge of the steepest part of the hill the outer rampart runs & the ruins of the corner bastions still stand.\n\nWe climbed up as high as possible into the part which was once the main hall & noted that the building was evidently once four storeys high.\n\nHistory – Saxon (I think) of about Alfred’s time -- Edward the Martyr’s death -- In Elizabeth’s time the owner was Governor\n\n supreme in the Isle of Purbeck -- Cromwell demolished it when hunting the Royalist’s party.\n\nWent to tea with the teachers again on Wednesday & enjoyed a musical evening.\n","21":"\n\nWent for a route march to day – 15 miles with full pack – effects nil, so I am in fairly good nick.\n\nThe route lay through the plantation & birch country which is common\n\nround here. The effects are chocolate brown, sepia, myrtle green & light green, which are produced respectively by the plantation cone covered soil, the fir-tree trunks the oak foliage & the birch foliage. The bright blue background of the sky makes a fitting blend with the harmony of such a scene.\n\nIf this war were over it strikes me as an ideal holiday to camp out in such country & live a wild free life, unfettered by any conventions. Following the idea on I fancy that such a life would be\n\ndelightful for a honeymoon.\n\nPerhaps I may be able to realise such an idea, if Rita is agreeable, & I return safely.\n\nEvery day finds me more disgusted with the conservatism of England; the ridiculous clinging to old ideas, such as the old weights & measures (to mention only one common instance), the hypocritical & prudish ideas on morality; all fill one with a feeling of contempt for those who have allowed us to become so insular.\n\nThe teacher of Landon School has opened my eyes to the hold the \n\n \n\naristocracy (!) of England has held over the Schools until quite recently; in fact even now they have a tremendous influence in scholastic affairs.\n\nFor instance Lady Rodgett at the “Hall”, (the occupants of which have always governed the school) would allow no girl leaving school to go into any thing except service, for which she fitted them out; as she owned the houses their parents occupied, they had no other choice. That is a very significant fact, & it happened until within the last few years\n","22":" \n\nCommenced duty week yesterday, & I, being in the tent division, am on the observation Hosp.\n\nIt is a good job \n\nThere are three of us with a Lance Corp who is an oldish steady old chap, who knows his work fairly well, but is not very quick. He is a nice chap.\n\nThe other two are young & very straight kind of chaps & full of life.\n\nWent to Bournemouth on Saturday afternoon & saw aunts & uncles.\n\nHeard little Flo play the piano & played myself, & enjoyed the evening\n\nArrived back at 1 AM.\n\nWent over to the School on Sunday afternoon – stayed till about 8.45 pm\n\nFeel bluey tonight on account of a brush with the enemy, represented by Capt Merrilees – who is a terribly jumpy individual & says the most ridiculous & pointed things. I think his heart is right, but his head runs away with him at times.\n","23":"\n\nNothing much has happened but something is about to happen\n\nWe are to leave this beautiful town for the miseries of camp on Salisbury Plains\n\nThe original rumour said last Wednesday, but fact will make it this Wednesday or Thursday.\n\nLast Wednesday I gave a lesson on Australia to the kiddies of Sandford School. They were interested & greatly responsive.\n\nI have been out frequently to Sandford & spent very happy times there discussing\n\nall manner of topics with the mistress, She has been unfortunate in love affairs & the result is a peculiarly distorted idea of men\n\nShe thinks that they are all libertines & that 90% of girls give in to their passions, & those who don’t are not wanted.\n\nCertainly men are bad, but I refuse to believe them to be so bad as that, and I cannot believe that the majority of girls has bad morals. We live in confusing times, but bad as the effects of the war undoubtedly are, they have not reached that level \n\nIn one idea at least I am\n\nin thorough agreement with her & that is the absolute uncertainty of life today\n\nNone of us is secure for five minutes together.\n\nIt is hard for a man to follow out his ideals honestly under these circumstances, for every hour is a tremendous struggle. But if he gives in & flows with the tide he is only choosing the shadow & sooner or later he will return to search for the substance\n\nNo letters from Rita again this mail.\n\nI do so want to have a nice long letter from the dear little girl to encourage me\n\non the way; but it is not forthcoming. Probably letters have been written but lost in transit.\n\nThe daily life of the ambulance has not varied much, & my position is just about the same. I am hovering between the tent division & stretcher bearers at present. If the latter job falls to my lot I shall go through to the last, but I shall not last as long as I should on the tent division.\n\nI must try to scrape together some remnants of shattered faith, & put trust in the workings of providence without fretting from day\n\nto day over the ultimate results of each step I take. That fretting habit is the cause of more unhappiness.\n","24":" \n\nWe started yesterday morning at 5.30 from Wareham. I had goodbye to Mrs Brooks at the School overnight, & on our way through town most of the population waited to see the last of us.\n\nWe marched 10 miles before dinner & finished at Blandford (17 miles) at 3 p.m. Here we camp in a big private park on the outskirts of the town\n\n& I assisted as part of the tent division in erecting two bell tents. My feet behaved very well & altogether I was pleased with the way I maintained cheerfulness during the most dreary parts.\n\nTown was placed out of bounds, but the troops went there just the same in approved Australian fashion, & open town was declared at 7.30 p.m., being all that was possible on the part of the authorities.\n\nGeneral Anthill (in charge of the Brigade) is rather a bullying kind of man\n\n& does not seem to lose an opportunity of letting loose at our Col. who takes it all smiling.\n\nYesterday afternoon one of the Staff captains came bustling up, on our arrival, & quite excitedly \ninformed\n pointed out a flag marked pitch as our ground on which to bivouac.\n\n“Yes” answered the Colonel “are’nt they pretty flags?”\n\nWe left Blandford at 6.30 this morning & are now a further nine miles on our way. We reached here at midday & stay the night in a fine hilly paddock\n\noverlooking a valley.\n\nThe position is 3 miles south of Shaftesbury, through which we should march to finish with 13 miles tomorrow.\n","25":" Fovant\n\nWe arrived in Fovant Camp at midday on Friday & found everything ready for us – even beds made\n\nThe position is not nearly so bad as we had been led to expect, & our actual camp is rather good.\n\nLord Werley reviewed the","26":" Brigade on Saturday & the Ambulance was adjudged the smartest on parade\n\nI don’t get at all well with A Section officers, however, They dont seem particularly struck with me, & on the whole I am not strangely taken with them so, the feeling is mutual.\n\nFrom now on I have no desire whatever for stripes. As long as the war lasts I will work, but then finish with all things military.\n","27":"\n\nToday I applied to be returned to the","28":" Fld Amb as permission was given to those who served on Anzac.\n\nLately I have got very dissatisfied with\n\nthis unit, chiefly because I have felt & am quite certain that I have been deliberately pushed in the background, which is hard after 2 yrs service.\n\nWent on 2 days leave last Sunday at reveille, but to return in time meant catching 5.40 from Waterloo on Monday afternoon, so I left it till Tuesday morning & was given one day","29":" Field Punishment – quite normal & also perfectly fair.\n\nHad an evening at the theatre for my trouble.\n\nNot feeling in the pink lately for some reason. Had four letters from Rita in a fortnight much to my pleasure.\n\nHave been writing to her every day lately, as I know what great pleasure they will give her.\n\nWe are supposed to be going either in one or three months, which is not known for certain.\n\nWe made our wills this week\n","30":"\n\nThe letters to Rita of the last fortnight will, in them selves, serve as a diary, so there is no need to keep so closely to this\n\nWe are still drilling hard & the general effect of this camp & surroundings on the men is depressing.\n\nIt is not that there is not good scenery near, but the actual camp commands only a bare hill, & that naturally has a depressing effect.\n\n \n\nWilton Church \n\nSt Nicolas\n\nSt & Mary\n\nFoundation","31":"\n\nConsecrated Bishop Denison of Salisbury","32":"\n\nExpense of Hon Sir Herbert","33":" of","34":" Earl of Pembroke assisted by mother\n\nCost £ 30,000\n\nStyle Lombard – develop. Of old Byzantine or later Romanesque\n\nRepresents Basilica or Roman Court of Justice\n\nEarl of Pembrokes Estate \n\nSchool 1660\n\nTitle 1551\n\nStepping stones\n\nArchway containing Norman statuary\n\nNero Caesar Hannibal\n\nStatues from Italy of Venus Medici Nero\n\nLord \n\nEntrance only part of original left.\n\nCardinal Wolsey’s walk.\n\nPainting in house of Cardinal walking alone\n\nBurial pound of men who fought against the \n\nBack of house.\n\nremainders of the famous cedars of Lebanon 1660\n","35":" – 07 \n","36":" – 14\n\nTop blew off\n\nRear part of house work of Imgo Jones 1660\n\nShakespeare 1700 statue In March light from invet at 6.30 7 hours on ShakespearShakespeare\n\nFountain on side of house Inigo Jones 1660\n\nAustralian gum tree (stringy bark) – \n\ngrowing in garden () on side of house\n\nOld bed recovered from 200 yrs\n\nOld drayser\n\nStatue of Marcus Aurelius\n\nFront = North\n\n(Old front = East (Wolseys)\n\nHouse in form of square with quadrangle.\n\nStatue of Marcus Aurelius\n\nMK \n","37":"\n\nTwo leaves in London.\n\none – returned A.W.L. & received a day’s F.P. No 2.\n\nSecond quite unexpected & so enjoyable all the more.\n\nLily’s birthday - small autograph album must better it later. Small disturbance at home with D.Q. with Molloy for the front apparently.\n\nHave written him, but would not call when in London\n\nMental upheaval that caused, the letters to Rita to become more regular have not subsided\n\nAm advanced in a good many ways. – a little firmer in character – less prodigal with money – more inclined to do any work at hand – and \nhappier\n\nGreat lapses from time to time, but am fighting as hard as I ever fought before to once & for all make something of myself. The glimpses I get from time to time of what I might become if I persevere make the fight well worth while.\n\nYesterday we attended a brigade battle manoeuvre\n\nReveille 5 AM, moved off 6.15 & picked up 3 battalions marching about 3 miles from here.\n\nat 4 miles turned off road in bush & advanced quietly by the side of hedges, across fields, keeping in touch with rear of infantry.\n\nAt about 10 our outposts got into touch with enemy (69th Batt) outposts who retired our main column, just as dinner was \nready\n timed (Dinner. one piece bread & salmon)\n\nNext we moved off & negotiated a large hill & a ridge, coming on massed infantry in a hollow.\n\nHere was General directing operations of infantry to attack main position of enemy on large hill topped\n\nwith wood, a mile away.\n\nDrizzle turned to steady rain & we","38":" retired to a wood where dressing station was imagined to have been erected.\n\nAttack did not develop, but we abandoned fighting at about 3 to return in heavy rain.\n\nHumour: rice on feet- - short-cuts - climbing hills & collapsing – sliding down other side & collapsing. Gyrations of stretcher bearers on muddy hills. Capture of runners by our own men.\n\nRelations with Cpl Merrilees & Major Strachan have a little improved lately.\n\nFancy latter is inclined to have favourites & does not care a rap about the rest as individuals. If he gets a dislike for a chap he works off his feelings by mean actions.\n\nGertie has developed his eccentric mannerisms & is a little less popular than before In some ways has improved & in others not\n\nGenerally less noisy.\n\nMeans well but fails lamentably.\n\nWrote & Curry yesterday.\n\nView from front of camp\n","39":"\n\nFortnight ago today news reached Fovant that the Anzacs were to move off for Perham en route to old units. Previous evening our concert party (under Geo Street) gave a performance. It was sports day & farewell dinner of","40":" Good food & plenty – with beer & cigarettes.\n\nWe presented “East Lynnoleom” a burlesque on East Lynne, & I took part of Sir Frances Levison. Successful & complemented on following morning by officers.\n\nArrived Perham on Sat.\n\nevening & found it a rather miserable details camp.\n\nDiscovered broken rib from performance – appointed hut corporal when in C Coy & later transferred to B.Coy.\n\nYesterday\n\nInspected on Monday by the Duke of Connaught on a hill near the camp.\n\nOn Friday – yesterday – marched over in company with other A.M.C men, A.S.C. & Engs, to Parkhouse.\n","41":" the beginning & the end of this book is Parkhouse\n\nBetween times I have accomplished absolutely nothing from a military point of view but in every moral sense I am better.\n\nThe training I had with the","42":" has done me good physically, & the difficulties & oppositions followed by failures, have made me more determined, less egotistical, more humble & generally far better.\n\nAm marked A Class & expect to leave in next draft (first for 6 weeks & more) for France.\n\nBetter luck in the future!\n\nNil desperandum.\n\n"}}