{"Document Name":{"0":"Diary_0515","1":"Diary_0515","2":"Diary_0515","3":"Diary_0515","4":"Diary_0515","5":"Diary_0515","6":"Diary_0515","7":"Diary_0515","8":"Diary_0515","9":"Diary_0515","10":"Diary_0515","11":"Diary_0515","12":"Diary_0515","13":"Diary_0515","14":"Diary_0515","15":"Diary_0515","16":"Diary_0515","17":"Diary_0515","18":"Diary_0515","19":"Diary_0515","20":"Diary_0515","21":"Diary_0515","22":"Diary_0515","23":"Diary_0515","24":"Diary_0515","25":"Diary_0515","26":"Diary_0515","27":"Diary_0515","28":"Diary_0515","29":"Diary_0515","30":"Diary_0515","31":"Diary_0515","32":"Diary_0515","33":"Diary_0515","34":"Diary_0515","35":"Diary_0515","36":"Diary_0515","37":"Diary_0515","38":"Diary_0515","39":"Diary_0515","40":"Diary_0515","41":"Diary_0515","42":"Diary_0515","43":"Diary_0515","44":"Diary_0515","45":"Diary_0515","46":"Diary_0515","47":"Diary_0515","48":"Diary_0515","49":"Diary_0515","50":"Diary_0515","51":"Diary_0515","52":"Diary_0515","53":"Diary_0515","54":"Diary_0515","55":"Diary_0515","56":"Diary_0515","57":"Diary_0515","58":"Diary_0515","59":"Diary_0515","60":"Diary_0515","61":"Diary_0515","62":"Diary_0515","63":"Diary_0515","64":"Diary_0515","65":"Diary_0515","66":"Diary_0515","67":"Diary_0515","68":"Diary_0515","69":"Diary_0515","70":"Diary_0515"},"Date":{"0":"unknown","1":953.0,"2":956.0,"3":958.0,"4":959.0,"5":960.0,"6":961.0,"7":962.0,"8":964.0,"9":965.0,"10":966.0,"11":967.0,"12":968.0,"13":969.0,"14":970.0,"15":971.0,"16":972.0,"17":973.0,"18":974.0,"19":975.0,"20":976.0,"21":980.0,"22":981.0,"23":982.0,"24":983.0,"25":984.0,"26":985.0,"27":986.0,"28":987.0,"29":988.0,"30":989.0,"31":990.0,"32":991.0,"33":995.0,"34":996.0,"35":997.0,"36":998.0,"37":999.0,"38":1000.0,"39":1001.0,"40":1002.0,"41":1003.0,"42":1004.0,"43":1005.0,"44":1006.0,"45":1007.0,"46":1008.0,"47":1009.0,"48":1010.0,"49":1011.0,"50":1012.0,"51":1013.0,"52":1014.0,"53":1015.0,"54":1016.0,"55":1017.0,"56":1018.0,"57":1019.0,"58":1020.0,"59":1021.0,"60":1023.0,"61":1024.0,"62":1025.0,"63":1026.0,"64":1027.0,"65":1028.0,"66":1029.0,"67":1030.0,"68":1031.0,"69":1032.0,"70":1036.0},"Entry":{"0":"\n\n \n\n","1":" Saw a Statue of \nBoadicia\n represented in a chariot driving 2 horses with the following inscription: – Boadicea, Queen of Icene Who died A.D. 61 after leading her people against the Roman Invaders. On the axles are knives about 15? long evidently for cutting people down.\n\nWe then paid a visit to \nPetticoat lane\n. It is crammed with barrows and people buying. The majority of the vendors are jews. Sunday morning is the regular market day. Here vases were sold for 8\/- per pair which would\n\n \n\nbring £2 in Australia.\n\nThe hands of the munition Workers are stained yellow like nicotine, with lyddite.\n\nPassing through Petticoat Lane we saw \nDirty Dick’s\n Hotel, which as booklet says Owing to Dissappoint by the death of his intended wife a few days before their marriage he let things go to ruin & locked up the room in which was prepared the wedding breakfast, which was consumed by rats and not entered for 40 years.\n\nWe then went over the \nBotanical Gardens\n and found them very beaut\n\n \n\niful. The garden, walks, lakes & flowers are the best that London can boast of, and cannot be said too much of.\n\nThe English people are mad over the Australian Soldiers. \n\nThey wont look at the Soldiers in caps but love hats. The English & Canadians are not in favour at all except in country towns.\n\nThe attitude of the upper class is denoted by the following experience of one of our boys. He asked an old lady the way to Earl’s court she said “I will take you in my car” which she did and afterwards invited him\n\n \n\nto dinner. He stopped with her 4 days and found she was Lady Trotter & kept 8 servants.\n","2":" Played at opening of Y.M.C.A. Hut to-day by General Sir Henry Slater.\n\nPeople who have lived in London all their life do not know half that we do about the city.\n\nThe policemen & ’Bus Conductors do not seem to know anywhere outside their beat or ’bus route & people seem not to have heard of places that have often made us incredulous the other side of the world\n\n \n","3":" Started practicing the Mass bands of the Brigade.\n","4":" Divisional Church parade on Common near Camp","5":" Brigade Band Played past. Presided over by the Bishop of Salisbury from one of the Roman Tuberlix or burial grounds.\n\nAfter church parade was a march past and general salute to General Monash.\n\nAbout 80 German Prisoners arrived here to-day, nearly all of which had lost limbs, under a strong guard.\n\n \n","6":" Have been informed we are beginning our final course of training and as a start go for a 8 mile route march with full pack up.\n\nSugar is 5d & 6d a pound and in Birmingham will not be sold at all without tea.\n","7":" Went to Figheldean and saw the old chestnut tree which inspired Longfellow to write “the village Black Smith” The old shop is still used as a blacksmiths.\n\nAcross the way is the old church mentioned in the poem.\n\n \n\nAlongside the path is the grave of Sheppard, who died 1825 aged 85 who is supposed to be the blacksmith spoken of.\n\nOn entering the church, on each side is the plaster figure of a knight in armour lying, and at the feet of one is crouching what appears to be a dog.\n\nIt is a beautiful church made of flints and appears to be very old. The oldest tombstone we could discern was dated 1724.\n\nWe ascended a spiral stone staircase into the belfry, where we had\n\n \n\na fine view of the church.\n\nOn the wall is a notice saying that £100 was contributed towards seating the church providing 196 seats were reserved for people belonging to the parish. Figheldean is the prettiest village I have seen. \n\nThe houses have all thatched roofs with large overhanging eaves.\n\nOn coming back we got lost on the downs but the air was so pleasant and bracing and the scenery so restful that we did not mind our 10 mile walk before we got back to camp.\n\n \n\nWe passed the headquarters of the Flying Corps, and saw a remarkable display of aeronautics. Planes were landing and ascending constantly and at no time there were less than 8 in the air.\n","8":" Food since we have been in England has been good but not enough. Only half the amount of rations allowed by the Australian Government is issued by the Imperial Government.\n\nThis is augmented by the sum of 5½d per day per man allowed on the canteen fund and the sale of bones & refuse.\n\n \n","9":" It is very cool this morning signifying I suppose the approach of winter.\n","10":" This afternoon our Brigade Band marched to Fargo Hospital and rendered a programme to the patients who number 800, mostly Australians. There are also about 150 Germans in an enclosure surrounded by barbed and electrified wire and guards with fixed bayonets. We were told that one of the Germans attempted to throw some iodine in a nurse’s face who was attending him but a guard skittled him with an entrenching tool handle.\n\n \n\nAnother German stabbed a nurse not seriously wounding her but a guard used the bayonet on him and, well he won’t do it again.\n\nThe wounded boys say they are fed shamefully while the Germans are spared nothing.\n","11":" One of the boys has received a letter from France, and from what it says it appears that ","12":"\n steel helmets are issued to our boys at the front and the writer got 40 days for boiling eggs in his.\n\nA.M.C. Lesson to-day.\n","13":" The Germans have a dread of Australians according\n\n \n\nTo the latest story concerning them. One says “\nAn\n 3 Englishmen shot at me half a dozen times and missed me, but an Australian, he fired once and killed my father”.\n","14":" &","15":" Stretcher work.\n","16":" Have seen my first Rangefinder. It cost £15 and stands on an iron tripod about 9? of the ground\n\nBack view 1\n\nFront view 2\n\nIn the back you look through what looks like a \n\n \n\npair of opera glasses. In side is a periscopic arrangement so that you are looking through the ends as shown in fig 2. Focussing the object you see it as depicted below\n\n 3\n\nusing the thumbscrew marked x in fig 1 you twist this until the object is perpendicular with its inversion as shown, and the same distance from the thin black line in the middle. The rangefinder is now set and on raising the dial cover marked v in fig 2 the range is shown.\n\n \n\nEach company is taken out to the trenches ½ mile from the camp where they stay for 2 days & nights and instructed in bomb Throwing first with dummies and then real bombs.\n\nAt 9 p.m. we were marched to the trenches where we were treated to a demonstration of light bombs. The First was in the shape of a parachute rocket which was fired over the enemy’s position and slowly floated down showing a bright white light for the space of from 3 to 5 minutes illuminating the country for 3 or 400 yards round. The\n\n \n\nnext was a red light used in the same way but as a signal only to artillery etc. This does not illuminate at all. \n\nThe last one we saw was a bright light without the parachute fired out of a revolver. This was as bright as the first but does not last so long.\n","17":" Church parade 6.45 to 7.30. We then went on leave for the day to Salisbury and had a glorious day. ","18":" Training Camp Band played Programme in park this afternoon\n","19":" At 12.30 pm the Brigade Band 60 strong ,made up of the whole of the 36th Band\n\n \n\nand the Balance picked from 33, 34, 35th bands.\n\nWe were inspected by Brig-Gen’l Jobson, then marched to Amesbury Station\ned\n where we entrained and pulled out at 2.15 for Torquay.\n\nWe were to be entertained by the Mayor & Citizens of Torquay and to play 2 programmes on Russian Day\n","20":" \n\nWe changed trains at Exeter to the Great Western Ry. and noticed that all this company’s Engines have a name on the side. The carriages are much more comfortable but even these have no lavatories nor supplied\n\n \n\nwith waterbottles. From Exeter we travelled a good deal along the coast so that for miles you could toss a stone into the water from the carriage.\n\n \n\nThe scenery is delightful. Bathing machines and canvas dressing sheds line the seaside resorts which abound here.\n\nWe passed Axminster where the famous carpets are made also an old castle such as we have read about in a forest in which we could see quite a number of deer. We arrived at Torre station at 7.30 a.m. Where we were met by the mayor and aldermen of the town with a special 2 decker\n\n \n\nTramcar was waiting to convey us to the Princess Peir. The people had not seen very many Australians before and they gave us such a reception that confirmed our idea that the English people stand alone in hospitality.\n\nOur tram drive down beautiful though narrow streets lined by chestnut trees was very enjoyable. At the Clock Tower we got off the tram and played “Wessbury” as we marched to the Princess Pier.\n\nPrincess Peir & Gardens are one of the features of Torquay The peir runs out into the Bay, called Torbay, about\n\n \n\n600 yards and on the end is a theatre. On arriving at the Peir\n\nwe stowed our instruments & stands in a room set apart for the purpose and fell out to be introduced to our hosts with whom we were to be billeted. In some cases the hosts themselves were their to meet us & where they could not come, a troop of boy scouts acted as guides. The biggest Hotels, The grand, The Hydro, The Victoria & Albert etc. each took 4 or 6, and in these places the ordinary tariff being 7 guins a week, and we being even more looked after than the guests did very well. Myself & mate were billeted with\n\n \n\na widow lady whose husband died in January leaving her with a daughter about 17 and a beautiful house.\n\nArriving there at 9.30 we had supper which was prepared for us, the old lady mothering us as she called it and making us very comfortable. We each had a room to ourself with absolutely everything one could wish for. The daughter and her friend then took us out for a couple of hours showing us round the country which consists of picturesque lanes overhung like a bower with trees, Ivy covered hedges on both sides, lovely roads etc. To make things even\n\n \n\nmore enchanting it was near full moon. We got to bed about midnight tired but happy as larks, and slept well in the lovely soft beds.\n\nAt 6.30 in the morning the daughter woke us as arranged and took us for a stroll on the moors till breakfast time at 8’ o’clock. She also took us up to Chapel Hill to see the old Chapel. The history of this is not known although it is known to be over 5 centuries old. It is a stone building with stone roof like an arch and walls 4? thick, about 35? x 20? with hip roof. The floor is of very rough stone. From this hill a magnificent\n\n \n\nview of Torbay & the town is obtained. After breakfast we had to fall in at Princes’s Peir Where we boarded a special tram and were taken by the Mayor and alderman for a sight seeing tour as far as Paignton. It was teeming of rain otherwise we could have seen more than we did but we braved the rain a good deal and at 3 different places they stopped the tram and took us for a walk showing us different parts of the coast such as Brabbacombe Beach etc. The people were delighted with the Australian “Coo-ees” which they insisted on hearing every few yards\n\n \n\n(Just over the moors is Dartmoor with its famous prison)\n\nAt 12.30 we were entertained at dinner at the Pavilion Café by the Mayor & Corporation. It was served in 5 courses finishing with Coffee & biscuits. In the pavilion is also a theatre which surpasses many of the London theatres for beauty & class. After dinner we played a programme in fairly good style to a very big crowd. The admission to the peir where we were playing was 7d As well as the band Performance was an Orchestral Recital and grand concert featuring Miss Vesta Tilley, Arthur Bouchier etc. also swimming and aquatic sports. After this was over\n\n \n\nwe were given tea on the Peir. We played another programme from 7.30 till 9.30 when even larger crowd were there. They lined the slope down to the beach and encored every piece “Moonlight Bay” we couldn’t play enough for them. Next day we were due to catch the tram at 9.30 to go back but the Mayor was so pleased with our performance & behavior that he wired for an extension of leave.\n\nAt 9.15 the answer had not come so we were lined up ready to go when we heard all the girls cheering and we wondered what was doing when the Mayor came along with a big smile on his face and a\n\n \n\ntelegram in his hand from the General granting an extension of leave. Of course we gave a Coo-ee and marched back to the peir playing “Westbury” There we stowed our coats and were dismissed till 4 o’clock. We went up on a headland to get a view of Torbay when an old gentleman came and attached himself to us and favoured us with a morning’s most interesting tour of investigation. Torbay is where Sir Francis Drake mustered his ships before going to meet the Armada. After this he took us Torre Abbey, by far the oldest and most\n\n \n\nvaluable estate is this part of England. The old gentleman’s father had been in charge of the gardens so His influence stood us in good stead. The estate belonged to Lord (Colonel) Cary who died a month ago and the Cary’s whose ancestors stole it from the monks. There is said to be a curse on the place as for the last 5 generations the direct heir has died before coming into posession. The son of Colonel Cary has just been killed at the front so that the grandson will come into posession. Lady Cary sent down to say that we were to be shown the dining room\n\n \n","21":" the servant took us in. We were amazed with the thick carpets, beautiful furniture, Silver plate etc. but what interested us most were the paintings of all the dead & gone Carys looking down at us \nfor\n from the walls just as you read about in books. On one of the pictures is the inscription, Presented to Lord Cary by King Charles II. \n\nWe were then taken into the chapel and there over the altar was a painting of the “Crucifixion” by Raphael, said to be the most valuable in all England. We also went into the Towers, crypts & dung-\n\n \n\neons. \netc\n We also laid in some stone coffins there, and went into the barn where the Spanish Prisoners were kept in the time of the Armada. It is very dark the only places for light & Ventilation being long narrow slits for windows. The whole place seems to be built so as to be easily defended with little loop holes to fire out of. We had some Devonshire apples but I did not think much of them.\n\nWe then were taken round the gardens and hot houses which were the most Wonderful I have ever seen. Grapes 2? long Peaches etc are growing in the hot –\n\n \n\nhouses and apples and pears growing on the wall like Ivy. The flowers, Roseries etc. I cannot describe they are beyond imagination especially the begonias.\n\nPart of this abbey was pulled down by Oliver Cromwell and big blocks of masonry lie about upset\n\nAt 4 o’clock we played till 4.30 and then moved off to the station in a special tram playing “auld acquaintance”. The parting with the people on the station was quiet touching. Indeed some of the girls were crying and at 5.30 the train moved\n\n \n\noff carrying us back to Salisbury.\n\nWe got back to camp at 1.30 a.m. marching through mud up to our ankles.\n","22":" Church parade in morning and parade & programme in Durrington in aid of Salisbury Infirmary for Wounded Soldiers.\n","23":" Got Telegram from Harry to say he was leaving for Aus on Thursday\n","24":" The goat which was presented to us at Torquay, being a Billy has undergone an operation to-day, but is progressing favourably. A.M.C. Lec to-day.\n","25":" The battalion went out\n\n \n\non the downs and had a day’s skirmishing under Service conditions we taking our positions as stretcher bearers.\n\nOn one of the Roman Tumilies described in No 1 Diary we found lots of little shells. It seems hard to believe that at one time it was submerged since on this very ground Julius Caesar fought 55 B.C. and shells could hardly retain their shape intact for 2000 years at the least. Although they don’t look like it they may be earth mollusc’s.\n\n24th The whole battalion fully equipped with ammunition waggons, water carts, Carts, cycle corps, stretcher-\n\n \n\nbearers etc, marched off at 9 a.m. for a day and nights bivouacing to Shrewton about 7 miles away. Arrived at 11 a.m. in continuous rain. After a feed of Bread & Cheese the troops marched away in extended order to some trenches where they commenced work, some digging, some on trench warfare & manoeuvres all in the pouring rain. The only shelter in the place was a tent pitched by us as a dressing station for the A.M.C. and in this we spent the majority of the afternoon. About 5 o’clock the doctor took us to an old deserted farmhouse\n\n \n\nof about 15 rooms and in this we are comfortable while the troops are having a terrible time. There being no one to disturb us, some played cricket with pieces of palings and jam tins while I with a couple of mates went for a stroll when we came across mushrooms in galore 5? across. We collected 4 hatfulls and went down to the cook and got ¼ lb of butter, a handful of salt and a dixie lid. We then cooked them and there was enough for a good feed for the whole 28 of us.\n\nWe then went down and got our blankets and made\n\n \n\nourselves comfortable.\n\nIn the yard I found an old chain with 2? links this I took up to my room and, the farmhouse being very large old & deserted, seemed to be just the sort of place for ghosts. I had everything arranged for a gigantic scare at midnight. We went to bed at 8 o’clock and went to sleep and woke at ¼ to 5 next morning and thought of our ghost. As we had missed our golden opportunity, we thought we would try it in the semi-daylight. So putting on our boots we stamped slowly up two or 3 steps of the\n\n \n\nwooden stairs, then rattled the chains, two or three more steps, then a dismal sort of howl, then some more chain. Some of the chaps were more scared than they cared to say but the daylight spoilt the joke to a big extent, and Syd’s ghost is universally known in the battalion.\n","26":" The boys when they go out anywhere in the train write their name & address on a piece of paper and say they are “Lonely Soldiers” and would like a letter etc. & throw them out the windows to the damsels on the Station All sorts of replies are returned. Proposals of marrige\n\n \n\nParcels of cigarettes & Stationery stamps etc, & invitations for weekends.\n\nOne of the boys whose aim was only to get all he could and comment after on the softness of these kindhearted “Pommies” had a letter sent to him by one (myself) which took him down a peg. It said that “the writer was an Australian herself and really pitied him. Firstly because if he could not get a friend without public begging he must be a poor specimen of an Australian. Secondly if, seeing how the English people were treating you boys, if they have overlooked you it must be because you are old & ugly and therefore not interesting\n\n \n\nto me, and lastly, if he intended to keep this letter as a keepsake and momento of his giddy days she was sorry that his request did not fall into the hands of Someone with a more romantic nature than himself. Finally she said “I know how you boys are fond of smoking and I pity you. So if you will write I will send you some “Smoker’s Cure” which is said to be very good.” Not knowing that the letter was written by me & sent to a friend down the line to be posted, he has asked me to write a scathing reply to her which I am going to do this morning. I will not put any address inside\n\n \n","27":" that, though her reply will not be delivered, it cannot be sent back to him. I will then write him another enclosing some “Rat Poison” saying that is the best cure she could get.\n","28":" We played a programme at Bulford Institute from 5 to 7.\n\n28th Our mascot after the operation: -\n\n“Farewell, a long farewell to all my greatness.”\n\n(Henry VIII act III sc IV)\n\n \n\n29th An observation balloon is continually on the lookout for Zeppelins close by the Camp There are Raids almost every day on the South Coast.\n\nRoumania\n has now entered the war by declaring war on Austria. Italy has also extended her declaration to Germany.\n\n30th One of our boys is very musical. He has drums in his ears, internal organs, & his feet hums.\n\nBread is 1\/0½ per 4 lb loaf steak 1\/8 lb and Rump is priceless.\n\nHarry left for Australia yesterday.\n\nPlayed a programme at\n\n \n\nBrigade Officers Mess in the worst conditions possible. Pouring rain, and covered with a tarpaulin full of holes, and stacked like Sardines. Nevertheless the programme was very creditable and we were complimented by General Monash.\n\n30th It is still wet & miserable.\n\nChanges of Officers are taking place. Colonel Logan the battalion has been transferred to 9th Training Camp\n\nAt 6.30 a Concert was held in the Y.M.C.A. Hut & was presided over by the Lord Mayor of Bristol. The following was the program\n\n \n\nOpening address by the Bishop of Bristol.\n\nGOD SAVE THE KING\n\n“Carry On”\n\n“Good Luck go with you”\n\nMiss Pattergell\n\n“The Glow worm”\n\n“That dreamy Lullaby”\n\nMrs. P Smith\n\n“Captain Mac”\n\n“Gilbert the Filbert”\n\nMr P Smith\n\nViolin Solos “Songs of Scotland”\n\nSelected\n\nMiss Prendergast\n\n“A long long trail”\n\n“There’s a land”\n\nMiss Brett\n\n“The Canadian Canoe”\n\n“Such a pair”\n\nMr & Mrs P. Smith\n\n \n\n“The Sergeant with the Whiskers”\n\n“Sundry Stories”\n\nMiss Pattergell\n\nVio Solo “Barcarolle” (Tales of Hoffman)\n\nSelected\n\nMiss Prendergast\n\n“Old Fashioned cottage”\n\n“Tell my dream”\n\nMiss Brett\n\nDuet “What spell is in the twilight”\n\nSelected\n\nClosing address by Brig Gen’l Jobson\n\nGOD SAVE THE KING\n\n31st Good weather again\n\n \n\nSep\n\n2nd 1st Inoculated for Para-Typhoid to-day.\n\nTo-day I received a copy of the History of Torre Abbey Copied from Old Papers & records\n\n“The History of Torre Abbey”\n\n“The situation of Torre Abbey in the olden days must have been ideal. Placed on the sea coast of Devon it looked southwards across Torre Bay towards Brixham and it is said to have been the best provided of all the 35 houses of the English Premonstratensian Canons\n\nIt was founded 1196 by William Brewer was endowed with much property in the neighbourhood and was given the patronage of several churches & chapels. The Abbey of Welbeck became the mother house of Torre, sending one\n\n \n\nof their number Adam with 6 companions to start it. But after 3½ years Adam was translated to Newhouse as Abbot. The list of the superiors of Torre is far from complete and little is known of the history of this important abbey beyond what may be gathered from the lately published records of the order in England. One curious story connected with the house in the 14th Century. In 1390 the Bishop solemnly excommunicated the unknown person who spread about a story that the Abbot of Torre, William Norton had murdered and beheaded on of his Canons, Simon Hastings. This accusation the Bishop pronounced to be an infamous falsehood as the canon in question was actually alive and had been seen at the\n\n \n\nabbey. In the year 1456 the Abbot of St Radegund’s was the representative in England of the abbot of Premontre and he posessed the power to visit over the houses of the order. We hear nothing of interest later as we have no record of another visit to Torre abbey for some years. The last abbot was Simon Rede elected and confirmed by the King in","29":" He and his fellow canons surrendered the monastery to Henry VIII in","30":" before the Commissioner William Petre. The abbot and his religious sect each received a pension. One of the Canons, John Estrige, died within a month of being expelled from his old home. In 1543 Henry VIII granted the abbey to his favorite John St Ledger who sold it the\n\n \n","31":" year to Sir Hugh Pollard. In 1580 Sir Hugh Pollard’s grandson conveyed the property by deed to Sir Edward Seymour of Berry, Pomeroy. \n\nIn 1599 Thomas Ridgeway, ancestor of the Earls of Londonderry bought the whole estate in 1653. Sir John Stowell bought part of the estate including Torre Abbey. In 1662 the Abbey Ruins were purchased by Sir George Cary of New Parke Hants in the hands of whose descendants it has remained.\n\nWilliam Brewer was descended from Radulphus de Brueria who held 6 manors as one of followers of Baldwin of Exeter one of William the Conqueror’s Generals he had one son, William Brewer the Younger (who died\n\n \n\nchildless and was buried in the chancel of Torre Abbey Church.)”\n\nThe stone coffin is still to be seen, but the part of the abbey where it was placed was razed to the ground by Oliver Cromwell during the Restoration\n\n“The 716 years during which this site has been known as Torre Abbey may be divided into 2 periods. The 343 years during which the buildings were occupied by the Premonstratension Canons and the subsequent 373 years as a private Residence.\n\nThe name Spanish barn (now used as a coach house is undoubtedly derived from the fact that 397 prisoners prisoners from the galleon “Capitana”\n\n \n\ncommanded by Don Pedro de Valdez captured from the Spanish Armada and brought into Torbay on the","32":" were incarcerated in the building while the vessel was being dismantled”.\n\nFor breakfast we often have hash made of mashed potatoes with onions cut up very small mashed in and small pieces of bacon to flavor it. Try it, mother, if you ever read this, it is lovely.\n","33":" Left Camp at 8.30 AM for two days marching & billeting. We were provided with a midday meal and set out Marching. We passed through \nShrewton\n a small rural village 5 miles from\n\n \n\ncamp. After another 6 miles we came to Chitterne at 1 pm. another small village where we ate our midday meal and were shown to Flint Cottage where we were billeted. The front rooms were utilised as the battalion H’q’rs and guard room.\n\nAt 4.30 till 6 we played for the Officers mess in the rain and then had tea We then played through the village and I think they thought the end of the world had come as they had never seen Australians before nor had they heard a band for a long while.\n\nArriving back at our\n\n \n\nbillets and turning in between the few blankets we had (about 1 per man) we had no longer closed our eyes and began to think of sleep when the alarm went and we had to dress and fall in outside H’dq’rs, again in the rain. After seeing all present & correct we were dismissed independently to our billets.\n","34":" Rose at 7 a.m. played a few marches and started back to the camp 10.10 a.m. Past through Codford and Wylye two small villages. These little villages always lie in the indentations of these undulating plains\n\n \n\nYou see a clump of trees in a hollow, and, looking closer you see numerous buildings with thatched roofs and large overhanging eaves. coming closer still you see it is a little village with 3 or 4 main streets, & a church, which is generally used as a school, the rest of the week. The streets are in some cases not \nknown\n named except the ones which lead from one village to another. These are called by the name of the village they lead to. Fell out at 12.30 for dinner, we have travelled 8 miles. On each side of us are large fields of purple heather and\n\n \n\na little farther on hedges of holly, Hawthorn and lots of other trees which we don’t know the name of. We ate some \nelderberries\n which also grow in profusion, and some\nsloes\n which are like small plums only about twice as sour and about 20 times as bitter.\n\nA body of troops were sent forward in advance we did not know what for until we were passing a clump of bushes when all at once the bushes started to spit fire and the troops that were ambushed had us in easy range. The advance guard\n\n \n\ndropped into a fold of the ground and returned the fire (of course all with blank) cartridges) the A.M.C. & Transport waggons making a detour and halting about half a mile ahead.\n\nAfter a reconstruction of our troops we continued our march through \nWinterbourne Stoke\n and back to camp via the Stonehenge arriving at 5.30 after marching 19 miles for the day.\n\nWe are feeling tired, especially in the shoulders where the equipment strap cut us. Our feet are allright as we well soaped our socks\n\n \n\nWe passed 2 graves of flying men with stones erected on the spot where they were killed.\n\nType of captive observation balloon used over the camps on Salisbury plains\n","35":" Ordinary routine again.\n","36":" through Figheldean where we left the troops to go on skirmishing, while we broke of and paid a visit to the Royal Flying school. At this school are 200 officers, and the whole of the quarters are large bungalow-shaped buildings made of Fibro-cement.\n\n \n\n(A Zeppelin was brought down by Lieu Robinson in flames last night at Cuffley for which he received a V.C.) \n\nIt looks like a little town. There are also large workshops where the aeroplanes are made and repaired. We tried our hardest to get a fly but only three succeeded, who won on the drawing of matches. These were taken up for about 10 minutes in Farman biplanes, and Armstrong-Whitworths. They were supplied with helmets and goggles and Triangular blocks with ropes attached were placed under the wheels. The machine was then started by twisting the propellor a few times when the blocks were pulled away and the machine ran down\n\n \n\nthe slope with ever-increasing speed When the ascending lever was pulled over and the machine rose like a bird.\n\nIn one of the sheds were 4 “Bristol Scouts” ready to be sent over to France. These aeroplanes are the best they have for manoeuvring.\n\nWe then played a few marches while the Aero. Officers dined then marched down and awaited our troops whom we played back to camp.\n","37":" Marched to Shrewton Where the troops were instructed in trench war\ne\nfare and manoeuvres while we enjoyed a quiet siesta under\n\n \n\nthe trees as gentlemen should. The empty salmon tins around tell of the good time we have been having Er – “Pass the Cigars Orderly” We then spent the morning writing letters, playing cards etc. until it was time to play the troops back.\n\nFlying through the air is something like sailing on the water. There are what are called pockets of air or air waves and when the planes pass over them they lift considerably as a ship does passing over a wave.\n","38":" 150 men out of each battalion throughout the division were sent over to France\n\n \n\nthis morning at 9.0 a.m. to reinforce some of the battalions in action. They marched away to “So-long Letty” without any ceremony save a parting cheer.\n\nWe then went down to Amesbury where a collection was being made for the Star and Garter home for disabled soldiers. We also saw a lot of german prisoners being marched to a camp. Among them were two of the Prussian Guard. They looked insolently happy and carefree. They were marched to Rolleston where they were placed in a camp surrounded by barb wire entanglements. \n\nDuring the night 5000 Australian troops of Reinforcements left camp for france. Received\n\n \n\n2nd para-typhoid inoculation\n","39":" Went over to the German Prisoner’s camp. The German’s are camped in tents surrounded by a fence of barbed wire 8 ft high and numerous sentries marching round with fixed bayonets. They are a big stamp of men and have been sent from Dorchester Prisoner’s camp where they have been since","40":" There are several of the Prussian Guard among them. One of them was asked, by one of the boys who understood German What he thought of Australians He said he was told that if he saw two men with gold teeth calling one another b – s\n\n \n\nThey were Australians.\n\nThey say the rates of pay are Privates 3½d Corps 5d serg. 7 per day They wear their stripes on their collars . They look perfectly happy and well fed.\n\n10th Marched 7 miles to trenches near Shrewton with stretchers, where we had our first taste of stretcher work under service conditions at the front, returned at 3 o’clock.\n","41":" Musketry and Range practice at Larkhill Ranges \n\nSpent the morning marking\n\nToday. App 1, 2, 300yds\n\n \n\nThe targets are in pairs. One bull’s eye and one figure target ballanced and hinged in the centre as per diagram. Each bullet hole is pasted over with a small peice of paper the same color as the target, which is made of canvas.\n\nThe marking is done with a disc on a stick black on one side & white on the other, and a red & white flag\n\nBull – White disc placed over Bull. F.T. 4. Bull 4? ring 25 pts\n\nInner - Disc waved backwards & forwards in front of Target. F.T. 3 Bull 8? ring 20 pts.\n\nMagpie - Disc twisted round F.T. 2 Bull 12? ring 15 pts\n\n \n\nOuter – Black disc moved up & down F.T. 1 Bull 4 in 12? ring & \n1 wide\n 10 pts\n\nP.M.I to be indicated after marking.\n\nA miss or washout is indicated by waving a red & white flag in front of target.\n","42":" Range practice continues\n","43":" Range practice continues\n","44":" Bitterly cold night. Weather perceptibly cooling. Middle of Autumn in colder that Sydney’s Mid winter.\n","45":" Field practice to finish our musketry course. We were marched out to Beach’s Barn Vedette where we laid down our instruments and took up rifles. We were\n\n \n\nmarched into a trench by fire unit keeping down out of sight. Before this however 2 scouts were sent on ahead to the trench. These would fire one shot to get the range and communicate it to the N.C.O who with his men, at the sound of the shot advanced into the trench with rifles at the high port. The N.C.O would then give the order to load and then give the range as 500. He will then give the fire order and say “up” when the men will rise and fire the number of shots ordered and get back into cover. The target in this case was a patrol of 5 wooden\n\n \n\nmen exposed for 30 secs. At different ranges 2 to 500 yds\n\nThe band shot well and were complimented getting 36% of shots fired, hits.\n","46":" Brigade parade this morning on 34th Batt. Parade ground to announce the conviction of Pte Leslie 36th A.I.F. in that he did, on 6th Aug leave the lines and wilfully strike his superior officer Corp – on the side of the head. Accused pleaded “Guilty” and was sentenced to 2 years penal servitude with hard labor in one of His Majesty’s Prisons.\n\nNew Orders for Reveille. To march up and down\n\n \n\nthe front of Camp, Sound the Regimental Call, Play “Sons of the Brave” the Regimental march, then play “Advance Australia” through once at 6 a.m.\n\nWe have orders to pull the white ribbon, numerals, and infantry badges off our shoulder-straps.\n\nIssued with another blanket.\n","47":" Our Brigade work has now commenced with a review and inspection of troops by Brig Gen’l Jobson and Gen’l Monash on the common by the Stonehenge. There were two march pasts in close column of Companies while the mass bands played, also a General Salute.\n\n \n","48":" Brigade work continued by a 3 days marching & billeting to Market Lavington 17 miles away. We started at 8. a m and marched away with 4 stretchers which after a miles march, by the kindness of the doctor were put on the cart. We marched past the graves of the flying men who were killed on the plain when aeroplanes were in their infancy.\n\nNext we passed through Shrewton, a little town or rather village previously described.\n\nThe next village we passed through was \nTilshead\n 12 miles from camp This\n\n \n\nis rather a big place of, I should say 1200 inhabitants, 2 or 3 old fashioned inns, a church and a school.\n\nWe passed through a rather pastoral district, and the land that was not utilised for farming was, in places covered with heather in Bloom. It is nice when you are in among it but from the distance it looks just like a brown smear on the plains.\n\nAfter this the road was entirely covered over like a bower with big green trees. Sometimes Chestnuts, sometimes stately elms, beeches Oak and now and then rows of poplars. All along\n\n \n\nthe sides of the road, the hedges of Hawthorne, Briar elder- berries etc were intertwined with blackberries with plenty of ripe berries on. But as luck would have it every halt we made, either they were on the wrong side of the road or there was none where we halted. Whenever resting on a march, troops must always fall out on the left side of the road, the officers only being on the right. Coming into a town the boys were making wild snatches to get some when one of the simple village folk said “Poor boys, they must be half starved the way they\n\n \n\nare grabbing for the berries”\n\nIvy is absolutely a pest here. You see large trees absolutely covered with it. banks, hedges stones, gullies, everywhere it fastens itself to whatever it can cling to. It forms a carpet on the ground, it covers the houses, in fact it is everywhere.\n\nNext we passed what is called the Robber’s stone which is a stone pillar 2? square and 6? high. On it is fastened an iron plate which says that on that spot 4 highwaymen attacked and robbed a gentleman but they were pursued, one of the robbers being killed.\n\n \n\nWe then went through West Lavington which is almost a town, by far the largest of the villages we have yet visited. This is accounted for by the fact that the train runs close by the town. We saw a few old houses with inscriptions that they had been built by public subscription for the people who had been ruined by the Great Flood. We also passed a home for old pensioners.\n\nWe then came to market Lavington where we were billeted in farm-houses. As usual we came off best and were billeted together on the second floor\n\n \n\nof a butcher’s shop in the main Street.\n\nStrange, here the men “forget to die” they are so old, and active with it. The place must be very healthy.\n\nApples are very abundant here. The trees are loaded, but I have never yet tasted any that I like as well as the Hobart apples.\n","49":" Marched about 5 miles where we (the band) reclined against a haystack in an elevated position and watched the Brigade at war, 2 battalions against 2 with blank cartridges under war conditions, Our battalion at the 35th winning by\n\n \n\na strategic flanking movement. The other Battalions all had their bands with instruments. But our Major with his characteristic eccentricity ordered us to take stretchers instead. The Brigadier roused on the major and despatched a motor transport back to camp for our instruments and music, so we played a programme on the square. The inhabitants were delighted as they had never heard a band like ours before.\n","50":" At 10 a.m we left for home and arrived at camp 4 pm. We took the same route back which is about 17 miles each way.\n\n \n\nAt Westbury, a few miles from Lavington they have a big white horse on the slope of the downs made by stripping the turf from the hillside showing the chalk underneath. It is supposed to be a representation of the horse ridden by Alfred the Great in his battle against the Danes.\n","51":" Practice for Divisional Review to be held next week.\n","52":" Brigade sports \nto be\n held on the downs near Rifle Range. Mule races etc were held.\n\nThe band are absolutely exasperated with the major who stopped our weekend leave after it was granted from Brigade Hq’rs. and we were\n\n \n\nall dressed and waiting for passes.\n","53":" Last night 12 \naeroplanes\n Zeppelins visited Essex and S.E. districts round London doing considerable damage to minor properties, and killing 30 and injuring 99 people.\n\nThe first hint of the raid had come in the shape of Policemen tapping windows and telling people to be careful because Zeps were about, so most of the people decided not to go to bed but stayed up to see the Zeps. The night was very dark and cloudy and at 11.30, the noise of a Zep could be heard like the sound of a threshing machine\n\n \n\nIt was invisible however being above the clouds. Suddenly the clouds parted and a searchlight fixed her beam on the Zep. She zigzagged about to try and get out of sight but the anti-aircraft guns broke out and shells were bursting all round her. She looked like a big sausage. She began to tilt then righted herself but the silver tint began to assume a ruddy hue and she slowly began to descend. Suddenly she burst into flame, looking like a piece of waste soaked in paraffin on fire, then collapsed and fell to the ground. The petrol tanks caught fire and she lay\n\n \n\nlooking very like the framework of a scenic railway. The people were jubilant and sang patriotic songs in the street.\n\nAnother Zepp was disabled and came to earth in Essex the crew of 22 were taken prisoners. People came in a continual stream to see it.\n\nThe bombs are dropped from a basket suspended by a rope up to 5000 ft. long, containing telephone and electric lights and bomb throwing apparatus.\n","54":" Divisional Band practice preparatory to playing for the Review on\n\n \n\nWednesday. Nearly 20 bands were in attendance and were divided into 4 groups to play for the march past. One band to relieve the other in succession, marches to be separated by six beats of the drum at the intervention of each new band. Our march is “The last Stand”. The others strange to say are playing German marches “My Regiment” and “Tiekes Old Comrades”.\n","55":" Rehearsal of to-morrow’s review.\n\n27th Review of Australian troops by King George at Bulford on Salisbury Plns. Troops were pouring on \n\n \n\nto the Parade ground from 8.30 am. The King arrived at 11.15 on a coal black horse When the whole of the troops came to the “present” and the Massed Australian Bands played the Royal Salute of 6 Bars of “God Save the King”. With the king came a group of about 20 military officers and a banner bearer carrying a flag with the King’s coat of arms. On the flagstaff at the saluting base also floated the King’s flag. The bands then took turns to play the inspection march while the King accompanied by Gen’l Monash the O.C. 3rd Division Rode past and\n\n \n\ninspected the troops. The band then changed position to 100 yds from, and facing the Saluting base. The King took up his position and the march past began. First came 11 batteries of artillery each consisting of 4 guns and 4 ammunition waggons. Then came the 9th, 10th, &","56":" Brigades, A.M.C., ASC, New Zealand Artillery & Infantry, also Various brigades from Tidworth, Bulford & Perham downs Camps. As troops passed the Saluting base the commanders of each unit i.e. C’O’s Battalions, wheeled off to the right and took up their positions where they re-\n\n \n\nmained till after the review when the King shook hands with them as they filed past. The parade took 1 hour and 15 minutes to pass and occupied about 4 miles. They marched past in close column of platoons. The massed bands embraced about 25 bands from various camps approximately 650 players. \n\nAfter the march past was over the massed troops cheered the King as he passed on his way from the ground. Troops marched back to their several Camps.\n\nThe whole was carried out in a manner that could not but redound to the credit of Australia and Australians\n\n \n\nAltogether 50,000 troops took part.\n","57":" Field Firing at Beach’s Barn. Brigade marched through Netheravon, still another village, 5 miles from Camp. It is a superior village to most of the others, but still – a village! 3 miles farther on we came to Beach’s Barn where we (the band) lay down watching the aeroplanes. We saw some very fine flying, looping the loop, spiral descents, wheeling etc. The bristol Scouts are absolutely marvelous. When turning the stand on their end. We returned at 5.30.\n\n \n","58":" We have at last been granted leave to London, so we leave Amesbury station at 5.49 pm arriving at Waterloo station at 8.30. Went out to Kentish Town in the tube and had a look round. Arrived back and slept at Salvation Army hut.\n","59":" Have found out that at every big Railway Station there is a buffet where soldiers can get refreshments free of charge. Waterloo, Liverpool St, Paddington etc. We has Breakfast at the War Chest Club near Horseferry Rd then went and booked beds at Buckingham Gate, a place for soldiers without\n\n \n\nequal in London. We then strolled down the West End in the most aristocratic Part of the city and returned to the Anzac Buffet in Victoria St for dinner. After dinner we strolled through Hyde Park and along by the Serp. passing a beautiful Statue of Peter Pan on the way. Next we came to the Albert Hall and Albert Memorial. The Albert Memorial is a seated Statue of Albert the Good and all round the base, the life size figures of the great Masters of Music, Painting, sculpture, architecture etc. It is the most\n\n \n\nexpensive statue in London. Opposite is Albert Hall, the largest hall in Europe. It is circular and about 150 ft high. After tea we went out to Liverpool street.\n\nDuring the day we visited Grandmother and Aunt Rose who is a jolly old sport and made us very welcome.\n\nAt 12 o’clock the clocks were put back an hour to correct time.\n","60":"\n\nWe had a look at Westminster Cathedral a very curious looking place very unlike a cathedral in appearance, and the \n\n \n\nmassive Natural History & Victoria & Albert Museums. We then went down Oxford st. Park Lane, Bond Street etc on the ‘buses and were just in time to see the Life Guards with their band Marching back from a church parade. They wear khaki instead of their gaudy uniforms but they are fine big men all over 6?. We then saw the Grenadier Guards church parade in their Red coats and busbies, it looked Splendid & the Music was excellent. We then saw the anti-aircraft gun crew at practice as an aeroplane passed\n\n \n\noverhead.\n\nWe then went to hear the Republic Garde Band, the best military band in the world Who came on a visit from France, to return a visit made by a band of our guards to France some time ago. They gave an open air performance at the Horseguard’s Parade at 12.45. They are entertained at Hotel Cecil. Thousands and Thousands of people cheered them, especially when they concluded with “Marsellaise”.\n\nWe dined at the Buffet where I met Harry. He spent the afternoon with us at a concert at Albert\n\n \n\nHall. Albert hall from the gallery presents a remarkable appearance of unparalleled magnificence. There are 8 galleries and seating accomodation 40,000. There are special Royal boxes for the King and royal family The Albert Hall Orchestra of some hundred performers was to me the very best that could be heard. I have never known that such a performance was possible.\n\nAt 10 o’clock the searchlights were searching for Zepps which they knew were about and in the morning we read that another Zep has been brought down\n\n \n\nin flames.\n\nThey know when the Zeps cross Belgium, and can tell just about where they are. \n\nThere are what are called 3 circles and every circle the Zep crosses the people are informed their whereabouts by either 1 2 or 3 short flashes. Otherwise no search lights are used until the Zeps are within range when about 12 streams of light pick up the Zep and the guns roar out often putting paid to her account.\n\nCaught 10.20 train back to Camp our leave having expired.\n","61":" Shifted camp about\n\n \n\n1 mile further away from the station.\n\nHave a new C.O. Colonel Simpson V.C.\n","62":" The ground is so sloppy that it is suggested we wear our identification disc on top of our heads in case we get bogged. As we get very little practice during the day we are voluntarily doing ½ an hours scale practice each night starting this evening.\n","63":" Trench warfare under war conditions Marched through a little Village called Orcheston. Carrying in wounded for SB’s.\n\n \n","64":" Field work for the Brigade, Our battalion acting as a flank guard.\n","65":" Weather still wet and miserable.\n\nThe morals of English girls seem to be of a very low standard and even what one would take for the better class comes language and general demeanour, that in Sydney would token a street girl.\n\nNo day parades owing to night stunt which, owing to the wet did not come off.\n","66":" Play’d at Artillery Sports 2 till 5.30. The wind making things un-\n\n \n\ncomfortable. Sports very interesting, included tent pegging, mule races, hurdles etc. Big Zeppelin raid expected to night all lights extinguished at 6.30.\n\n100 extra guards were placed over the Germans.\n","67":" None came. Played at Amesbury for church parade and programme in street after. This is the first time I have ever heard of a band playing round the street to make the people come to church. Seems more like a patriotic concert.\n","68":" On Monday we left camp for a week in the trenches by Bustard inn. For the \n\n \n\nFirst few days we, as stretcher bearers, had medical lectures while the men in the ranks did trench work. On wednesday and thursday We attacked and took trenches as in real war conditions.\n\nOn Friday General Birdwood came to see our work to see if he thought we were fit to relieve the","69":" Division\n\nAn attack was made on a line of trenches with aeroplanes and under artillery fire, Light bombs etc. I was put in charge of “C” Co SB’s and at each charge we had about 20 casualties to deal with. We were complimented and assured a speedy departure for France.\n","70":" Back in camp “Thank Goodness”\n\n"}}