{"Document Name":{"0":"Diary_0099","1":"Diary_0099","2":"Diary_0099","3":"Diary_0099","4":"Diary_0099","5":"Diary_0099","6":"Diary_0099","7":"Diary_0099","8":"Diary_0099","9":"Diary_0099","10":"Diary_0099","11":"Diary_0099","12":"Diary_0099","13":"Diary_0099","14":"Diary_0099","15":"Diary_0099","16":"Diary_0099","17":"Diary_0099","18":"Diary_0099","19":"Diary_0099","20":"Diary_0099","21":"Diary_0099","22":"Diary_0099","23":"Diary_0099","24":"Diary_0099","25":"Diary_0099","26":"Diary_0099","27":"Diary_0099","28":"Diary_0099","29":"Diary_0099","30":"Diary_0099","31":"Diary_0099","32":"Diary_0099","33":"Diary_0099","34":"Diary_0099","35":"Diary_0099","36":"Diary_0099","37":"Diary_0099","38":"Diary_0099","39":"Diary_0099","40":"Diary_0099","41":"Diary_0099","42":"Diary_0099","43":"Diary_0099","44":"Diary_0099","45":"Diary_0099","46":"Diary_0099","47":"Diary_0099","48":"Diary_0099","49":"Diary_0099","50":"Diary_0099","51":"Diary_0099","52":"Diary_0099","53":"Diary_0099","54":"Diary_0099","55":"Diary_0099","56":"Diary_0099","57":"Diary_0099","58":"Diary_0099","59":"Diary_0099","60":"Diary_0099","61":"Diary_0099","62":"Diary_0099","63":"Diary_0099","64":"Diary_0099","65":"Diary_0099","66":"Diary_0099","67":"Diary_0099","68":"Diary_0099","69":"Diary_0099","70":"Diary_0099","71":"Diary_0099","72":"Diary_0099","73":"Diary_0099","74":"Diary_0099","75":"Diary_0099","76":"Diary_0099","77":"Diary_0099","78":"Diary_0099","79":"Diary_0099","80":"Diary_0099","81":"Diary_0099","82":"Diary_0099","83":"Diary_0099","84":"Diary_0099","85":"Diary_0099","86":"Diary_0099","87":"Diary_0099","88":"Diary_0099","89":"Diary_0099","90":"Diary_0099","91":"Diary_0099","92":"Diary_0099","93":"Diary_0099","94":"Diary_0099","95":"Diary_0099","96":"Diary_0099","97":"Diary_0099","98":"Diary_0099","99":"Diary_0099","100":"Diary_0099","101":"Diary_0099","102":"Diary_0099","103":"Diary_0099","104":"Diary_0099","105":"Diary_0099","106":"Diary_0099","107":"Diary_0099","108":"Diary_0099","109":"Diary_0099","110":"Diary_0099","111":"Diary_0099","112":"Diary_0099","113":"Diary_0099","114":"Diary_0099","115":"Diary_0099","116":"Diary_0099","117":"Diary_0099","118":"Diary_0099","119":"Diary_0099","120":"Diary_0099","121":"Diary_0099","122":"Diary_0099","123":"Diary_0099","124":"Diary_0099","125":"Diary_0099","126":"Diary_0099","127":"Diary_0099","128":"Diary_0099","129":"Diary_0099","130":"Diary_0099","131":"Diary_0099","132":"Diary_0099","133":"Diary_0099","134":"Diary_0099","135":"Diary_0099","136":"Diary_0099","137":"Diary_0099","138":"Diary_0099","139":"Diary_0099","140":"Diary_0099","141":"Diary_0099","142":"Diary_0099","143":"Diary_0099","144":"Diary_0099","145":"Diary_0099","146":"Diary_0099","147":"Diary_0099","148":"Diary_0099","149":"Diary_0099","150":"Diary_0099","151":"Diary_0099","152":"Diary_0099","153":"Diary_0099","154":"Diary_0099","155":"Diary_0099","156":"Diary_0099","157":"Diary_0099","158":"Diary_0099","159":"Diary_0099","160":"Diary_0099","161":"Diary_0099","162":"Diary_0099","163":"Diary_0099","164":"Diary_0099","165":"Diary_0099","166":"Diary_0099","167":"Diary_0099","168":"Diary_0099","169":"Diary_0099","170":"Diary_0099","171":"Diary_0099","172":"Diary_0099","173":"Diary_0099","174":"Diary_0099","175":"Diary_0099","176":"Diary_0099","177":"Diary_0099","178":"Diary_0099","179":"Diary_0099","180":"Diary_0099","181":"Diary_0099","182":"Diary_0099","183":"Diary_0099","184":"Diary_0099","185":"Diary_0099","186":"Diary_0099","187":"Diary_0099","188":"Diary_0099","189":"Diary_0099","190":"Diary_0099","191":"Diary_0099","192":"Diary_0099","193":"Diary_0099","194":"Diary_0099","195":"Diary_0099","196":"Diary_0099","197":"Diary_0099","198":"Diary_0099","199":"Diary_0099","200":"Diary_0099","201":"Diary_0099","202":"Diary_0099","203":"Diary_0099","204":"Diary_0099","205":"Diary_0099","206":"Diary_0099","207":"Diary_0099","208":"Diary_0099","209":"Diary_0099","210":"Diary_0099","211":"Diary_0099","212":"Diary_0099","213":"Diary_0099","214":"Diary_0099","215":"Diary_0099","216":"Diary_0099","217":"Diary_0099","218":"Diary_0099","219":"Diary_0099","220":"Diary_0099","221":"Diary_0099","222":"Diary_0099","223":"Diary_0099","224":"Diary_0099","225":"Diary_0099","226":"Diary_0099","227":"Diary_0099","228":"Diary_0099","229":"Diary_0099","230":"Diary_0099","231":"Diary_0099","232":"Diary_0099","233":"Diary_0099","234":"Diary_0099","235":"Diary_0099","236":"Diary_0099","237":"Diary_0099","238":"Diary_0099","239":"Diary_0099","240":"Diary_0099"},"Date":{"0":"unknown","1":1116.0,"2":1117.0,"3":1118.0,"4":1119.0,"5":1120.0,"6":1121.0,"7":1122.0,"8":1123.0,"9":1124.0,"10":1125.0,"11":1126.0,"12":1127.0,"13":1128.0,"14":1129.0,"15":1130.0,"16":1131.0,"17":1132.0,"18":1133.0,"19":1134.0,"20":1135.0,"21":1136.0,"22":1137.0,"23":1138.0,"24":1139.0,"25":1140.0,"26":1141.0,"27":1142.0,"28":1143.0,"29":1144.0,"30":1145.0,"31":1146.0,"32":1147.0,"33":1148.0,"34":1149.0,"35":1150.0,"36":1151.0,"37":1153.0,"38":1154.0,"39":1155.0,"40":1156.0,"41":1157.0,"42":1158.0,"43":1159.0,"44":1160.0,"45":1161.0,"46":1162.0,"47":1163.0,"48":1164.0,"49":1165.0,"50":1166.0,"51":1167.0,"52":1173.0,"53":1174.0,"54":1178.0,"55":1179.0,"56":1180.0,"57":1181.0,"58":1182.0,"59":1183.0,"60":1184.0,"61":1185.0,"62":1186.0,"63":1187.0,"64":1188.0,"65":1189.0,"66":1190.0,"67":1191.0,"68":1192.0,"69":1193.0,"70":1194.0,"71":1195.0,"72":1196.0,"73":1197.0,"74":1198.0,"75":1199.0,"76":1200.0,"77":1201.0,"78":1202.0,"79":1203.0,"80":1205.0,"81":1206.0,"82":1208.0,"83":1209.0,"84":1210.0,"85":1211.0,"86":1212.0,"87":1213.0,"88":1214.0,"89":1215.0,"90":1217.0,"91":1218.0,"92":1219.0,"93":1220.0,"94":1221.0,"95":1222.0,"96":1223.0,"97":1224.0,"98":1225.0,"99":1226.0,"100":1232.0,"101":1233.0,"102":1234.0,"103":1235.0,"104":1236.0,"105":1237.0,"106":1238.0,"107":1240.0,"108":1241.0,"109":1242.0,"110":1243.0,"111":1244.0,"112":1245.0,"113":1246.0,"114":1247.0,"115":1248.0,"116":1249.0,"117":1250.0,"118":1251.0,"119":1252.0,"120":1253.0,"121":1254.0,"122":1255.0,"123":1256.0,"124":1257.0,"125":1258.0,"126":1259.0,"127":1260.0,"128":1261.0,"129":1262.0,"130":1263.0,"131":1264.0,"132":1265.0,"133":1267.0,"134":1268.0,"135":1269.0,"136":1270.0,"137":1271.0,"138":1272.0,"139":1273.0,"140":1274.0,"141":1275.0,"142":1276.0,"143":1277.0,"144":1278.0,"145":1279.0,"146":1280.0,"147":1282.0,"148":1283.0,"149":1284.0,"150":1285.0,"151":1286.0,"152":1287.0,"153":1288.0,"154":1289.0,"155":1290.0,"156":1295.0,"157":1296.0,"158":1297.0,"159":1298.0,"160":1299.0,"161":1300.0,"162":1302.0,"163":1303.0,"164":1304.0,"165":1305.0,"166":1306.0,"167":1307.0,"168":1308.0,"169":1309.0,"170":1310.0,"171":1311.0,"172":1312.0,"173":1325.0,"174":1326.0,"175":1327.0,"176":1328.0,"177":1329.0,"178":1330.0,"179":1331.0,"180":1332.0,"181":1333.0,"182":1334.0,"183":1335.0,"184":1336.0,"185":1338.0,"186":1339.0,"187":1340.0,"188":1341.0,"189":1342.0,"190":1343.0,"191":1344.0,"192":1345.0,"193":1346.0,"194":1347.0,"195":1348.0,"196":1349.0,"197":1350.0,"198":1351.0,"199":1352.0,"200":1353.0,"201":1354.0,"202":1355.0,"203":1356.0,"204":1357.0,"205":1359.0,"206":1360.0,"207":1361.0,"208":1362.0,"209":1363.0,"210":1364.0,"211":1365.0,"212":1366.0,"213":1367.0,"214":1368.0,"215":1369.0,"216":1371.0,"217":1372.0,"218":1373.0,"219":1374.0,"220":1375.0,"221":1376.0,"222":1377.0,"223":1378.0,"224":1379.0,"225":1380.0,"226":1381.0,"227":1382.0,"228":1383.0,"229":1384.0,"230":1385.0,"231":1386.0,"232":1387.0,"233":1388.0,"234":1389.0,"235":1390.0,"236":1391.0,"237":1392.0,"238":1393.0,"239":1400.0,"240":1401.0},"Entry":{"0":"\n\n","1":"\n\nWe were given a holiday today and stayed in bed until 11.30 doing various things when we got paid. At 2 p.m. we had a parade for rifle inspection and after I cleaned the hut and myself thoroughly. Had a shave and wrote up diary in evening. Ingram on shift 7 to 1 a.m. Cloudy but mild with wind and guns normal. Fritz sent over several whizz bangs to 2nd Division Ambulance. Great run on canteen to day by troops from everywhere sold out in evening and we couldn’t get what we wanted.\n","2":"\n\nUsual routine until after dinner when I repaired to Bernafoy for a load of wood and chopped it before going out at 4.30. Received 8 letters all very interesting. There has been heavy shelling on both sides since yesterday and our duck walk was torn up in numerous places and Fritz also blew up many portions of the Decauville track especially near Longueval and also the R.E. dump at Flers. Night cloudy and windy but mild and no rain. Worked very strenuously and got down to 10’. & felt tired on arrival home. Waited up for Ingram who came in an hour later and after tea & some bread & jam soon went to sleep.\n","3":"\n\nFeel very tired this morning but arose about 10.30 & wrote this up and started answering letters. Dull windy day. Read paper and wrote letters in the afternoon and evening until 10.30. Thought I might be off so took French leave and Dave did not dispute it. Ingram home at 1 p.m. Rumours of leaving on Friday but heard nothing further yet.\n","4":"\n\nStayed in bed all morning and afternoon till time to get up and read paper and wrote letters. Dull cloudy with a little rain and prospects of more. Just as we were going Cpl Jellings told me to wait for Mr Rogerson at 5 p.m. Went out with him and followed him round on the job and met Pellen and Mursell. 12 holes now going and 4 being revetted with galvd. iron and sets. Usual shelling. Arrived home about 10.30 after an interesting talk on the way and after getting coffee wrote a letter until Ingram came home. We could hear Fritz’s plane over but he apparently did no damage & searchlights failed to pick him up.\n","5":"\n\nRained in morning fine in afternoon but cold evening with moon and later misty rain. Stayed in bed all morning and got up about 2 p.m. and on to job taking ropes for windlasses. Our working party didn’t come so we deepened some more holes and knocked off at 10.30. Fritz’s aeroplane manoeuvring above and apparently a Rumpler. came back early unwell. Ingram home at 12. Usual shelling. Planes active in afternoon and balloons up Mueller back & Dowling to return. We are staying in with Division but Army Corps may go out soon.\n","6":" Epiphany. Saturday 6\n\nSlept deeply until 11 a.m. and got breakfast or rather dinner at 12. 2 parcels. Sarah – unknown. Stayed in bed until 3 when I visited Ludlow Day off to-night and am going out to survey our positions to-morrow morning at 8. Went early to bed and had a good sleep.\n","7":" after Epiphany. Sunday 7\n\nSet out about 9 and was surprised at the daylight appearance and no of dead all along especially outside Delville and surrounding the tank into which I looked. No guns left. Also deep dugouts in german old lines. Surveyed Nos 10 to 15. 10 being near Grandecourt. Here was some of the 18 pounder batteries. Day was fine and frosty a little misty and a M.G. was located in Needle Trench to deal with low flying planes used once but at long range. Tanks are scattered frequently. Fair amount of shelling and shrapnel landed rather close. Returned about 2.30 and after tea wrote letters. Savage gone to School of instruction and Kernot to follow.\n","8":" – If you have not already taken advantage of the Insurance Coupon, to so to-day.\n\nRested all day and wrote some more letters. Fine day and sunny. Went out at 4.30 and very heavy wind and a fair amount of rain and very miserable working. We waited in the trench for about 15 minutes but no party came so we carried on ourselves. Came home tired and wet and read paper.\n","9":"\n\nIngram woke me up at 5 by stepping on my toe which annoyed me muchly. Didn’t get breakfast as the cooks didn’t call so at 10.30 got up and lit the fire. Very cold but no rain. After dinner wrote this and read surveying. Started as guide with Avery at 4.30 for the Inf party and went through Delville to B.H.Q. Only 1 officer & 21 men came instead of 50 men and N.G.O.’s. Carried sets me as guide to Needle Trench about 2 miles away over an unexplored duckboard. Raining & miserable. Party of 20th from Montauban second trip met Sinclair & Rogerson who called me corporal Inf party calling me “Sir\". Carried two pieces each growling whole way & work seems badly organised. Returned at about 10.30 tired and to bed.\n","10":"\n\nStayed in bed all day and in afternoon read papers. Day fine, cold but cloudy. Finished “Life\" in the evening. My day-off.\n","11":"\n\nAt 8.30 Corp Thompkins told me to take his place at Flers dump. (I was asleep at the time) and should have arr at 9 but arr at 10.10 for which Bolton had to report to Bgde Party of 20 men and carried out to dump near dugouts on trucks as well as unloaded pontoons. Special train at 3 arrived at 4 and took a load up. Infantry very hard to handle. Very strenuous day and finished at 6. Snowing all morning and very cold. Went to bed after reading chronicles but slept badly.\n","12":"\n\nArose at 7.20 and arrived at work at 9. Only work to do unload pontoons and carry to dump and inspect advanced dump. Showers of sleet all day and in between brilliant sunshine and clear observation. Home at 4. and after tea, read and wrote this up. Fritz’s plane came over and afterwards his land travelled over was shelled. Dugouts to be left to-day and parties to work day shift on the M.G. positions.\n","13":"\n\nArose at 10 to 8 but got on to the job at 9 all right. Only work was to unload and stack from 3 pontoon loads. Intensely bitter west wind all day with some sleet and very cold standing round. In the afternoon a heavy “strafe\" with howitzers took place and particularly on our left. Presumably one of our daylight raids. Got home at 3.45\n","14":" after Epiphany. Sunday 14\n\nSet out as usual at 8. Not so cold but very foggy. Unloaded the usual pontoons and at 3 got a note from Bolton per drivers telling me to meet Mr Price’s party at 5.30 to show them the forward dump. Turned up at 6 and found dump as expected at 7 On way home fell in mud at Road Crossing in the Delville. Returned wet miserable tired and hungry at 8 and soon after a good meal turned in dirty. Phenomenally quiet artillery all day. Infantry party of 10 from 52nd Batt growling as usual.\n","15":"\n\nOn to job as usual but routine altered to-day. Caught train to Longueval and there unloaded 4 pontoon wagons after dinner putting it on to 4 trucks and luckily got a train soon after. Back to B.H.Q and unloaded and checked material. Finished at 3 home at 3.45. After tea removed some of last nights mud read the papers and wrote letters. Bought a watch and odds and ends. Rumours of moving to Le Sars on","16":"\n\nSome work with a good party 52nd bombers and knocked off at 2. Frost last night and thick ice. Foggy and intensely cold all day. Good mail in. Cleaned clothes and in evening read letters and papers.\n","17":"\n\nUsual work and loaded two pontoons to the trucks. Knocked off at 2 and when I got home cleaned up a bit and had a good \nwatch\n wash. Spent evening reading and writing. Not very cold but very heavy snowfall which continued all day until about 5\" everywhere.\n","18":"\n\nStill snowing but not cold. No party so had to load two trucks myself and take them to B.H.Q. Home at 4 and spent evening writing. Seems to be pretty certain of a move probably to a new sector on left. Some say to North of Arras.\n","19":"\n\nArrived on scene at 9.30 and party had been waiting since 8.30. Unloaded pontoons but couldn’t get a train. At 3.30 about 8 all came in together and we had to knock off on account of congestion. Home at 4.30 and had a shave and a general clean up. Bed at 10. Still cold and plenty of snow.\n","20":" – Your name must be registered before any claim can be recognised under the Insurance Coupon.\n\nDowling now on job. Started at 9.30 after putting dubbin on book. Got two trains through and home about 3. Rested in evening. Still cold but invigorating. Rumours to move on 26th to Sausage Gully near Pozières.\n","21":" after Epiphany. Sunday 21\n\nStill cold. Usual routine with 2 trucks. At 12.30 pontoon pulled in and with out warning shells from heavy howitzers came over seeking guns. First two night over our heads about 20 yards away scatting buckets and stones everywhere & we were lucky to dodge them. About 12 came over all dangerous and three shrapnel which killed one and wounded two of the 6\" How battery. I hastened up the other end of the Dump and into a trench. Drivers unhooked and home for their lives and left pontoon until next morning. Home at 3 and got mobile more.\n","22":"\n\nUsual routine, one truck. Home at 2.30. Wrote letters and had a bath after tea in dugout. Move in a day or two for sure. Very cold and more snow to-day – Artillery active on front to-night. No 3 Section got shelled coming from work the other night – Murray shell shock.\n","23":"\n\nUsual – 1 pontoon. This morning between 12 & daylight very heavy almost like snow only frost. Very bitter cold day but perfectly clear day with sun which made no impression on the ice. One motor engine left out had its water jacket & circulating pipes cracked by the ice water and was utterly broken. Water freezed immediately when put out and ice about 2\" thick everywhere. Considerable aerial activity on both sides & heard one Taube come down. Ingram got sack from C.R.R. & no more coal. Plenty of wood but won’t burn all night. Slept very cold and glad to get up. Frost on inside of our dugout roof and curtain stiff with ice. Home at 2.30 Had a good bath in dugout.\n","24":"\n\nUsual – one pontoon although another should have come up in afternoon. Intense cold & keen enough to cut. Fine all day and much aerial activity. Home at 4. Fritz shelled railway siding where are 4 naval 4–7\" very heavily all the afternoon. Section not gone out to-night. May move on Friday so got my kit together to-night. Very great amount unfortunately.\n","25":"\n\nUsual. Cleaned up yard and carted all timber to Dump at B.H.Q. Home at 2. Carted a good stock of wood in for future use. May not move for 3 or 4 days yet. Wrote letters in evening. Another frost and fine day but not so cold.\n","26":"\n\nCold & bitter wind but frost lighter. Supposed to be a truck on big siding but shelling was still going on so came home at 10. Parcels for Ingram. Spent afternoon chopping wood and evening in a quiet rest. Aerial activity great and heavy artillery on right. Clean up camp to-morrow.\n","27":"\n\nCold wind all day. No duty. Cleaned up in morning and chopped wood in afternoon. Considerable aerial activity. Very heavy bombardment in early morning and later heard Fritz attacked but was barraged off and suffered severely. We took 600 prisoners and counter attacked taking three trenches which we held. We are supposed to attack again to-night and heavy guns have been active all day. Ingram may join C.L.R.\n\nJanuary, 1917. 4th after Epiphany. Sunday 28\n\nNo duty. Wrote letter in morning and cleaned up and in afternoon brought some more firewood. Ingram joined C.L.R. and took all day to get mobile leaving dugout dirty and stayed in dugout till 9 when he took Kelly over drunk. S.M. came round to Dave to order a guard picket (“as many men as you like\".) I was put on 3 band to call all cooks. Further stated drill order parade at \n9.30\n. Dave gave it out as ","28":"\n. To get to-morrow morning off although he didn’t tell me so. Fine day out frosty with cold strong east wind.\n","29":"\n\nBill Thomas woke me at 4.10 having slept in so I arose and entered diary, had a shave and cleaned the hut up and then woke the cooks up which took some time. Finished cleaning hut in morning and chopped some wood Large consignment of comforts came in afternoon and besides these I procured a new tunic a little small & took a parcel to Ingrams who comes over to-night while I get mobile. Breakfast at 7 Fall in at 8 & move at 9. Drill order parade at 9.30 in morning. Day fine and not quite so cold. Moving to Bazentin-le-Petit.\n","30":"\n\nEarly up and fell in at 8 then cleaned camp and started at nine via Montauban and down to quarry and over line past Bazentin to a camp near a big wood at 12. Railway close and appears to be a large place. Canvas covered square huts which appear very leaky and a bad stove. Mad a bed and did fatigue of water which has to be brought on railway about ½ mile (12 in hut). Very cold. Two big german howitzers close by evidently abandoned & blown up and a big dump of old shells just behind us. Heavy howitzers quite close. Shell landed just in front coming up. Very cold and sunny in morning and snowed heavily in afternoon.\n","31":"\n\nCold cloudy in morning sunny in afternoon. Parade at 7 and another (rifle inspection) Did 2 fatigues in morning and afternoon took a stroll and a joyous adventure organising stoves of which we have four on hand – and one now fairly warm compared to last night. Slept badly and very cold. Big mail in. Very interesting in this hut and everyone very lively full of joie de vivre.\n","32":"\n\nDid fatigue all morning carrying wood and after doing fatigue in afternoon cleaned up and in evening we had an impromptu concert party headed by Gadjet. Good fun & he is very good entertainer. Heavy strafe on our right started at 7. Days apparently getting warmer. Heavy snow fall early this morning. Cloudy only a little. Major Dowling & Kernot inspected work this morning. Mail in to-day.\n","33":"\n\nHut orderly all day and only had to clean hut. Wrote letters and read all day. Didn’t go to sleep till 12 last night and slept cold again. Day sunny but still cold and fairly windy. Chaps in this hut gone silly over stoves and changed another to-day with result that we are nearly smoked out.\n","34":"\n\nUsual routine. Day fine but cool. In evening Fritz attacked on our front but I hear was repulsed. Heavy bombardment all night and started again this morning at 10 o’clock.\n","35":" Septuagesima. Sunday 4\n\nUsual. Day sunny but cold. To go on guard to-morrow at 9 p.m. Parcel from home. Rumours of America severing diplomatic relations with Germany. Lined hut with hessian.\n","36":"\n\nCloudy and cold. Usual guard duties. 971 & on. Aerial activity. Wrote and read in intervals. Fierce bombardment on our right all night eased during day. Rumours of American fleet mobilised. Day off to-morrow.\n\nNo work to do. Inoculated in afternoon by Hayward. 4 men gone out to work on M.G. positions from each section. Ground terribly hard. Strong, very cold wind S.E. blowing all aerial activity. Off guard at 9. Slept well.\n","37":"\n\nDay fine but same wind & aerial activity – Felt very sick all day and had to carry wood for cooks in morning. Slept nearly all day and feeling better to-night – Filled with straw and am very comfortable and warm.\n","38":"\n\nSunny. Strong wind not so cold. Aerial activity in morning artillery active all day. No duty. Go to work to-night at 5. Set out over intensely slippery duck walks (along Longueval Road, then duck walk on to job about 1000 yds behind line in a valley. Intense artillery on right quiet where we were except one recent shell hole 10 yds from job & in direct M.G. Fire which was unpleasant. Ground terribly hard and worked well with I.P.S.H.S & N.C. Home at 1 and after some tea and coffee slept well\n","39":"\n\nStayed in bed all morning and in aftn. had a shave and a good wash. To go out at 5 with Sgt King. Now find it is old job thanks to Dave! No wind and good moonlight but time dragged. To be a raid on to-night but I didn’t hear anything until early in morning.\n","40":"\n\nStayed in bed all morning. Fine and warmer & no wind. Told I would get to-night off but order countermanded and supposed to go out with Walsh wiring (?) Feel tired and feet bad. Decided later I wouldn’t go out so risked it and was all right. Slept well and was refreshed.\n","41":" Sexagesima. Sunday 11\n\nDay fine and warmer but very heavy frost last night. Wrote letters and read all day. Ingram visited us left at 5. Started out at 5 well out on the left of the dugouts. Work not too bad but about 9 Fritz lobbed some heavy stuff close and we were told to scatter However last one fell right close to a party and Geddes was killed and his head smashed to pulp. Munro wounded in wrist but not very seriously & Hardwick shell shock. 6 of us went into a trench & then picked up the corporal & after taking Munro to station came home and made some cocoa and went to bed\n","42":"\n\nDull not so cold. Got up just before dinner. Snowed in afternoon & then thawed a bit but froze again later in the night. Went out at 5 and wandered about doing a little work all night until 11.30. Home very tired.\n","43":"\n\nStayed in bed all day. Windy and cloudy. Parcel & papers.\n","44":"\n\nCloudy and thawed a bit but froze hard again at night and pegging difficult. Out at 5 with inclusion of 8 reinforcements who badly got on our nerves and couldn’t work. 2 out coming home. Carried a bit and spent an unhappy night home at 1 Cold very bad. Stunt on night in front \nlast\n to-night\n","45":"\n\nSunny and thawed a bit. Up at 3. Work at 5. Everyone had to go out and rumours of going up line shortly to put in strong points & in a stunt. Worked solidly all night until 11 when we came home. Two gas alarms and we got tear gas fairly strong.\n","46":"\n\nUp after dinner. Cloudy in morning, sunny in afternoon and fairly warm. Big explosion at Ammun. dump at about 7 and another hour after which shook the earth. Presumably our dump near Fricourt or perhaps more to right. Fritz getting very active. Our bombardment heavy in front all morning. Inoculated at 3 and felt very sick at work. Got lost under Daves guidance and spent a rotten night. Carried pickets all night and home via Railway line dead tired and ill. Rained in evening but cleared later and didn’t get wet.\n","47":"\n\nFoggy all day. Sick all day and missed sick parade. To act as guide to-night. Got badly lost and after wandering round returned at 10 Home at 11.30 very tired.\n","48":" Quinquagesima. Sunday 18\n\nFoggy. Got up at 12 and on to work at 1. Knocked off at 4.30. Home dead tired and to bed at 9. Quiet\n","49":"\n\nFoggy. On to job at 8 and not much time for anything. Easy working day but feel very tired. Carried and put in short pickets screwed up long pickets and carried barbed wire. Quiet day. Heard latest Australian mail was sunk. Home at 5 and after tea and clean up went to bed.\n","50":"\n\nRained nearly all day First parade 7. Scabies parade 8 and onto job at Turks Dump with section – not too much work but felt tired nevertheless. Carried barb & laid out some Trench wire. Home at 4.45 after visiting High Wood where are 3 tanks one with shell through it which ignited the petrol. Cleaned up, washed feet and read till 9.\n\nFebruary, 1917. Ash Wednesday. Wednesday 21\n\nFoggy but mild. Usual routine carried and put in some pickets. Wired in afternoon. One big shell fell fairly close and Fritz strafed supports heavily all day. Bed 8.30.\n\nFebruary, 1917. Thursday 22\n\nFoggy. Rained at dinner time. Usual wiring work. Fritz heavily shelled hollow below us.\n\nFebruary, 1917. Friday 23\n\nFoggy. Usual wire routine. Fritz shelled our surroundings early this morning and the shells screamed close over the camp.\n\nFebruary, 1917. Saturday 24\n\nFoggy and slight frost last night. Usual routine. Quiet. No night party to-night and rumours of stunt or raid by “9th\".\n\nFebruary, 1917. 1st in Lent. Quadragesima. Sunday 25\n\nFoggy in morning sunny late afternoon. Usual routine till 11. when Brigadier of 3rd Bde told us to go home as Fritz had retreated 2000 yds & probably 18 miles eventually. Brigade moved up closer during day. One man of 9th told us patrols were over 4 lines of trenches towards Bapaume. He shelled obviously from that way at long range. Home at 12 and had a good bath. Altercation with Dave in morning and S.M. told me to go pipe pushing to-morrow at 9.30 for 3 days school. Welcome change. Feeling rather unwell with diarrhoea. Infantry moving up closer.\n\nFebruary, 1917. Monday 26\n\n7 Parade & reported at 9.30. Nos 3 & 4 section moved to Factory Corner at 9 & other sections to follow when billets ready. Moved off at 10 with Mackenzie Mitchell & Groth per railway line to C.R.E. at Tricourt Farm in easy stages and thence to destination about a mile away arriving at 2 and got some tea and found billets after reporting in Armstrong huts. After tea visited canteen at","51":" F.A at old chateau and went to bed at 9 (Lights out). Slept rather cold and floor hard.\n","52":"\n\nBreakfast at 7.30 and after a general clean up fell in at 8.50 and humped all the heavy gear on to job about a mile away. General interesting lecture on appliance till 12.30 when we had dinner with tea. Passed time in afternoon till 3.25 & then came home and after tea went for a stroll towards Albert and then to bed.\n","53":"\n\nOn to job at 9 and during day pushed in 84 ft and home at 4. After tea went over to cavalry camp close by and saw British Dragoon Guards and various Indian Cavalry Home and had a shave before bedtime.\n","54":"\n\nGot all material ready for charge but explosives only came at 1. Blew up at 3.30 in presence of a Brig general & a collection of officers (Lavinia) After inspecting crater went home at 4 and after tea came up to drivers with our gear so as to push off with ration cart in morning at 8 o’clock. Got papers and also hear all our company is up with old camp as base & Dick Lord wounded. Got to bed at 9 after coffee & slept well.\n","55":"\n\nUp at 7 and got breakfast from drivers and pushed off along Bontalmaison road and on to old camp. Our two sections are back. 1 & 2 still. Wrote letters & notes in after noon. Frosty and dull in morning but clearer in afternoon.\n","56":"\n\nFrosty and dull all day. Up at 7 parade and out to work at 8. Went to Turks Dump and carried duck boards up track until 4.30. Home at 5.45. Guns howitzers near Flers & 18 prs well up in front of us. Got orders to go out to dugouts in Le Barque 6 of us & prepare position for rest of section at 8.30 in morning.\n","57":" in Lent. Sunday 4\n\nSet out with heavy packs at 8.30 & were lucky to commandeer a truck near Clark’s Dump & pushed out to rail head at the Abbey (just below). Sunny day with frost & keen wind so we had to wait till dark as the bank. Hexham Sunken Road was right under observation. Butte de Warlencourt in front and guns on it audaciously. Le Sars in front further. Set out at dark and travelled over very rough ground to Yarrow Bank & thence per rough duck boards to old german trench this side of Le Barque. Dugout two entrances with 3 short drives where we sleep. Bed at 10 and did 1.20 gas guard. Not much room. Cook our own food. Fritz 1100 yds on far side Le Barque 1000 yds from here which is under snipers fire.\n","58":"\n\nNo fires allowed in day time so had breakfast at 6. Misty & later sunny. Work at 10 cleaning up and dinner at 2 (hot) as it was misty. Carried on till 6 and tea at 7. Rations to come to-night. & more men to-morrow. Bed at 9 after reading letters. To go out at 9 to-morrow. Division going out rumoured to Armentiers. Snowed fairly heavily.\n","59":"\n\nCold and snow still about. Ready at 9 after a fine breakfast in bed and carrying party came at 10. Perkins & I set out up Sunken road on to duckwalks and by Yarra Bank to Turks Dump. Rest followed in 2’s & we were lucky to get a train right to Bazentin arriving at 1. Under observation right to Turks dump & very clear & shells pretty close. After dinner fell in at 3.30 in marching order and cleaned up huts. Had shave & wash and after tea read papers and got mobile. Reveille 6 in morning Parade 6.30. Breakfast 6.45. & move off at 7.30. – no bon.\n","60":"\n\nDay cloudy & cold strong S.E. wind. Set off about 8.30 with 3 blankets arrived at Tricourt at 12 & in very draughty huts with broken bunks. Freezed again. Got billet mobile & played bridge in evening until bedtime. Rumours of moving about 11th to Poperingle & waiting here till division comes out.\n","61":"\n\nReveille 6 & parade 6.30 when we marched round for “physical drill\". Rifle parade 8.30 & dumped bottles till 12. At 2 fell in & cleared old barb wire. Dave threatened to make some of us – laugh one of these days when half didn’t come out for work. Bridge in evening – Extremely cold wind all day & everything froze. Slept better\n","62":"\n\nCheck parade 6.30 & fell in at 9 for guard first shift. Cold but wind not quite so strong. No special incident. Wrote letters during intervals.\n","63":"\n\nAll day off. Rested, cleaned up and wrote letters. Rotten day. Cloudy, raining & murky\n","64":" in Lent. Sunday 11\n\nSunny part of day & cloudy rest. Usual parades inspection of arms and dismissed. Played bridge in morning. Leave to Albert at 3 after Savage practised giving orders on us and being sent back for belt. Very slow – no pictures – Church service instead. Didn’t wait. Home at 7.\n","65":"\n\nDull and cloudy but not cold. Made a duckwalk in morning & in afternoon wrote & read. Read papers in evening and bed at 9.\n","66":"\n\nDull, foggy and cloudy. Did some knotting & shovelling work in the morning. Issue of new paybooks, yesterday. No work in afternoon.\n","67":"\n\nNo work only parades. Foot wash in afternoon. Dull and cloudy and rained a bit. Wrote some letters.\n","68":"\n\nCloudy and cold strong N.E. wind. No work in morning except parades. Leave at 2. Saw show by Anzac Coves 5-6300 only moderate Home 7 bed 9. Heavy bombardment towards Bapaume, all day. Troops 30 miles beyond Baghdad.\n","69":"\n\nParade 6.30 went for a run up road at 8.30 parade went sick to see dentist. No luck come again at 2. Came at 2 but couldn’t get my turn and told to come at 2 next day. Spent evening playing bridge and bed at 9.30. Everyone very keen on gambling in company.\n","70":" St. Patrick’s Day. Saturday 17\n\n6.30 run up road and dismissed at 8.30. Dave asked if I could drive internal combustion engine. Yes. Packed up at 12 & after dinner went over to 149th R.E. & told to come again at 5. Brought kit down and after interviewing the O.C & giving a pedigree told me to go up to Tricourt Farm to-morrow at 7.30 & take over pumping plant. Stevens in klink through promenading with a motor car. In a good hut with bunks for night. Official news of occupation of Biefvillers, Le and Bapaume this morning by 5th division. Czar abdicated in favor of Czarevitch, Grand Duke Nicholas acting as regent. Bonny day with bracing wind but I have a rotten headache.\n\nMarch, 1917. 4th in Lent. Sunday 18\n\nUp in good time & after breakfast and getting some bread set out. Savage was very decent and showed me all points and after a trial run he left for Tricourt village. Driving opposite C.R.E. & have a little house 6 x 6 with two bunks and stove to cook rations made of weather board. Gave her a run in morning and afternoon & all went well with the 5 HP. Pettors fr except worn bearings. Pumping to reserve tanks of about 15000 gals from deep well. Boiled tea and got to bed at 9 after seeing a friend from a nearby pumping station. Day cloudy.\n","71":"\n\nDay cloudy with strong N.E wind & rain in evening. Cooked bacon for breakfast & ran her at 10.30. No inspection & only rations & fuel came. Another run in evening. Went over to 3rd coy in evening & got a letter. Home at 7 and wrote diary till bed at 9. News. Enemy 15 miles beyond Bapaume. fallen. Success at Ypres. French success on 22 mile front to a depth","72":" miles. Rumours of first german line captured from coast to here. Australians to spend another fortnight here & then rest for a good while & ten train journey.\n","73":"\n\nStrong N.E wind. Usual pumping. Refused to go in morning so cleaned cylinder of carbon Cigarette ration came\n","74":"\n\nStrong intensely cold E wind Cleaned cylinder thoroughly Officer round in afternoon wrote letters. Went over to coy. Moving on Friday. Read till bed 9.30. Went in to Albert in evening and purchased some goods for the larder. Saw Hughes and Rogers and an old chateau with caves.\n","75":"\n\nUsual pumping. Day cold and windy. In evening went for a stroll up to Y.M.C.A\n","76":"\n\nCompany and D.H.Q moved out in morning. Cleaned cylinder and had a look round the evacuated camps and collected some magazines, jam and fire wood. Went down to Tricourt Village as pump wouldn’t work but it recovered. Cold & windy day.\n","77":"\n\nIntensely bitter N.E wind all day. Pumped twice. Tricourt village men came over in evening & Lozenge Wood men in morning for magazines. Rotten rations.\n","78":" in Lent. Sunday 25\n\nDay cool but fine and sunny. Summer time established. Took engine to pieces in morning and finished job in afternoon and then filled the tanks. Cleaned up & tea of peaches. Wrote to Melv in evening. Heavy guns firing rather heavily all day towards Bapaume. Tightened pump stuffing box and works better now.\n","79":"\n\nDay windy squally & some rain Pumped once. Visit from officer. Better rations. Didn’t get up till 10.\n\nDay finer but squalls of rain and sleet. Cleaned engine in morning. Pumped in afternoon and went over to old camp and carried some wood. Plenty. Acetylene gas lamp burning well. Read magazines.\n","80":"\n\nNo pumping as only a little water was taken. Carried another sack of wood in aftn. and visited Savage in even. Better rations with 4 fire buckets wrote letters in intervals. Rumours of german concealed mine blowing up 60 Australians & 7 german spies as civilians caught. Day fairly fine with squalls of rain. Heavy gun firing close here. Evidently on train.\n","81":"\n\nDay windy and squally rain all the time. Didn’t get up till 9.30. Pumped in afternoon and early to bed after reading a bit.\n\nAll alone here now. Man permanently on tanks. Pumped in afternoon and collected some wood and also a bundle of papers of secret intelligence old left by D.H.Q. and specimens of two new bombs. After work read these interesting papers giving guns and men opposed on this front as well as every imaginable bit of information re Fritz mostly gleaned from prisoners and judicious observations. Read till after 11. Day squally with fair wind.\n","82":"\n\nDay squally with hail. Fair S.E. wind. Up at 7. and cleaned hut and engine room thoroughly. Good deal of water going out. In intervals read reports of Intelligence. After dinner started up but cylinder head packing blew out & had to cut a new washer. Worked at 4.30 to 6 about and tank nearly empty. Tried bombs. One a smoke other red flare. 148th R.E take over on Sunday. No ration came. Bed at 10.30.\n","83":" Sunday 1\n\nDay windy & rainy. Ration came in morning. Up at 9. Cleaned up and got more fire wood. Pumped 1 ½ hrs in aftn. & after cleaning myself went to Albert for provisions. Exchequer 2 1\/2f. Paid end of week perhaps. Service at Y.M.C.A. very sloppy. Home at 9 and read paper before bed.\n","84":"\n\nUp at 8. Day strong S. wind and heavy snow storm at 5. Pumped in morning and a lot of water going out. Rations & officer came at 9 – wrote letters in aftn. & turned in early and continued at 7. & read Surveying and French.\n","85":"\n\nDay fairly sunny & high wind \n\nPumped in morning & again in evening and cleaned her thoroughly. Leaking badly in parts. Read artillery in evening till 9.\n","86":"\n\nDay fairly calm and snowing nearly all day. Up at 9.30 and cleaned up till 12. Then re-packed joints and pumped. Daylight till 8 now.\n","87":"\n\nPumped 11 – 13. Rations very bad \n\nBonza day. Saw Colman in afternoon.\n","88":" Friday 6\n\nUsual sort of a day. Raining and miserable. Engine not working well. Pumped twice & saw football in afternoon. Hodgson spent night with me on way back to company from applying in A.F.C. Spent pleasant evening & he lent me 10f & some bread.\n","89":"\n\nDay N wind & rained a bit some sunshine. Pumped in evening. Man round for report at 9. Hodgson went at 10 after getting up at 9. Got some wood from nearby. Wrote letter in afternoon. Bed at 10 after reading “Royal\".\n","90":" Sunday 8\n\nPerfect day and I cleaned everything and made things shipshape during day. Wrote letter in evening and pumped at 5. Bad rations again with half a loaf of bread.\n\nApril, 1917. Easter Monday. Monday 9\n\nWindy and rainy. Pumped even.\n","91":"\n\nStrong wind and some snow. Cleaned up thoroughly.\n","92":"\n\nUp at 7. Day windy some sun and rain in afternoon. Waited for rations came about 10.30 with Farr Saffin near here. 3 letters & 56 big parcels all food stuffs. Read and sorted parcels all day. Also asbestos and wrench came. Engine wouldn’t go at night. Tank empty. Cleaned cylinder and put in packing. Bed at 10 very tired after filling tanks a little.\n","93":"\n\nUp early and cleaned everything but not working well yet. Day snow and windy and unpleasant. Brigade moved out to-day. Rumours of 4th division being cut up and they came down to-night.\n","94":"\n\nDay better – some sun & wind, mostly cloudy. Up at 9.30 and wrote letters till 12. Pumped in afternoon and then went into Albert. Got a paper and then went to “Anzac Coves\" at 7. Very excellent entertainment & I enjoyed it. Back at 9.30 and read papers till 11. Arras battle reported\n","95":"\n\nDay sunny with rather strong wind. Aeroplane activity all night and early this morning and also some motor buses came to Tricourt camp this morning. Went down for rations and got some letters only one from Melv. Wrote letters in afternoon. News of evacuation of Lens salient. and 3rd Brigade holding their objective. Pumped in evening and went over to village to see Savage. Spent a good evening home at 12.\n","96":" Low Sunday. Sunday 15\n\nUp late. Pottered about all day and pumped in evening. Read surveying in evening until bedtime. Very heavy bombardment to-day and to-night towards Bapaume. Drizzling rain all day not much wind.\n","97":"\n\nUp at 9.15. Pumped in morning & again afternoon, not going well. Overheating. Probably circulation bad. In evening went to pictures – fair – close by and afterwards to Water point. Day fairly fine & sunny but squally rain in evening.\n\nApril, 1917. Tuesday 17\n\nDay very windy only a little sunshine. Pumped at 12 after getting rations and cleaned up everything in afternoon until evening. Savage came over and stayed till 9.30 taking back 2 chairs from 12th Bde huts. Brigade moved out this morning. Bed very late after reading.\n\nApril, 1917. Wednesday 18\n\nDay dull & drizzling rain. Up at 10! and cleaned up. Read surveying in aftn. & evening. Heavy bombardment last night. Bed at 10. Bombardment still going on.\n\nApril, 1917. Thursday 19\n\nDull all day. No pumping. In afternoon Savage came over & we went into Albert with 1 other not a good show on.\n\nApril, 1917. Friday 20\n\nFiner day & pleasant. Up at 9 & got rations. 1 letter. Read in afternoon and got new stove & then tried to pump. No good engine choked with oil. Spent till 6 cleaning her & must continue to-morrow. Man coming round to-morrow for pay & may mean a move. Read till 11. Hodgson came on his way to England for observatn. A.F.C. Very heavy bombardment on.\n\nApril, 1917. Saturday 21\n\nWas up early and tried to run her. In afternoon brought Savage over who kindly fixed her up by altering magnets & governor and I feel more confident now. Went down to water point for ration of tea and home to read paper till 10. News of Corpse transformation and big concentration on west front.\n\nApril, 1917. 2nd after Easter. Sunday 22\n\nDay fine with some wind. Up at 9.30 and after cleaning spent day in writing, washing & various duties. 15th F.A. moved in and I saw Paternoster from Gawler. 15 Brigade also in Mametz camp. Rumours of Australians going out for 6 weeks spell and then to Armentieres. Also war will be over before we again go into trenches.\n","98":" St. George’s Day. Monday 23\n\nNice day a bit windy. Rations not very good. Spent day reading & writing & in evening read surveying & looked at carburettor which appears all right. Fritz planes over this morning. 5th Pioneers in and much washing going on.\n\nApril, 1917. Tuesday 24\n\nLovely day small wind. Got up at 8 and after fixing pumped full and afterwards thoroughly cleaned cylinder and engine room and hut. Engine running very sweetly. In aftn. went to see 15TH F.A. & saw Paternoster. Smith gone on leave & Close in 14th F.A. . Went to an excellnt concert at 5 in YM.CA Scotts. Redoubt by","99":" Division troop for entrance. Very fine. After spent evening at Water point & enjoyed tales of leave. Perisistent rumours of approaching peace and Austria said to have declared for peace unconditionally. Feel extremely light hearted and almost light headed.\n","100":"\n\nDay dull and windy some sun. Up at 10 and cleaned up. Did some more writing. Pumped in afternoon and went to same concern in evening. Bed at 10.30. Australians supposed to be off this front by","101":" and we are to go too.\n","102":"\n\nUp at 9.30 and procured rations which are not good cloudy all day. Decided to try for pay in aftn. so walked over to Bapaume road about 2 and after waiting a while received 60f. In meantime inspected an old tank which soon started up and we rode for a while in her. Visited Y.M.C.A. and then caught a lorry to Albert. Accosted by M.P. not being properly dressed. Mat Savage & Johnson got in first to second show of which was very fair although old items. Home via Mametz at 9.30 & after reading paper to bed.\n","103":"\n\nDull & threatening – Up at 8.30 & cooked bacon Savage came at 9.15 but went to Bapaume alone as we weren’t ready. Pumped a little and after cleaning up went down to W.P. at 11.15 & started for Bapaume Rd at 12. Caught a lorry and rode through town on road to Tricourt & then walked back. Very dusty but enjoyable. Through Pozieres & Le Sars. Numerous tanks smashed on way and some aeroplanes. Le Sars a scrap heap of wood. Every house in Bapaume been attended to & also trees cut down. 2 E.F.C canteens. Y.M.C.A Picture shows etc are going well. H.V. shells from Naval H.V. gun came over but were harmless. Some dinner at E.F.C. canteen & bought biscuits in Y.M.C.A. at Spring Garden Camp. Engine running well but got hot and knocked. Bed & wrote till 9.\n","104":"\n\nLittle cloudy mostly pleasantly sunny. Up at 9 and washed some clothes. Tried to pump but engine refused duty. Cleaned her up and pumped again in evening. engine good but overheated probably scale in water system. Had a bath in evening. Davenport came up from W. Pin aftn. & we acted the goat wrote letters in evening.\n","105":" after Easter. Sunday 29\n\nPerfect day. Up at 8 and went down to A.M.C. for teeth. No good, come again to-morrow. They were voting so I voted too & then went down for rations which only came at 11.30. Only fair. Tried to pump but ran hot again. Went down to company and got some more asbestos and also got leave to Amiens 8 a.m. to 7 p.m. to-morrow. Home about 5. Tried to pump but still hot. Saw Savage in evening & got some told troubles. Bonza mail to-day & two from Melv.\n","106":"\n\nFine day. Up at 3 and went down to Davenports at 5.30 and left at 6.15 A Albert at 7. 8 before a lorry came and arrived Amiens at 9.45. Good ride but not much to see. Had a haircut & shampoo and after a walk saw cathedral and then dinner. Spent afternoon walking along main streets and going for a train ride. Bought several small articles and tea at 6. Got some beer on way home and out of town at 8 near barrier waiting for conveyance. Waited till 10 I caught R.F.C. lorry to Albert arr at 11.25 home at 12.30 very tired and tumbled into bed.\n","107":"\n\nDay windy but fine. Felt very tired all day. Woke when Savage came round at 10.30. Got up and spent all day cleaning engine and looking for defect. Oil all clotted with water. Pumped a bit a still hot. Went down to Davenports for tea who arrived home at 12.30. Savage was over at 9 to pay for pipe & stayed till 10.30 when I turned in but didn’t sleep too well.\n","108":"\n\nDay fine and warm & some wind. Up at 7 and pumped half full. Ran hot then. Had a good breakfast and cleaned up till going for rations Still feel pretty tired. Cleaned up every thing until Savage came over at 9. Just the same and pumped half full in two tries. Had tea and in evening went to pictures with Tricourt Village & point chaps – Very good show. Home tired at 9.\n","109":"\n\nFine day but unpleasant dry wind. Up at 8 and cooked breakfast and cleaned up and ran engine in morning. Slightly better & pumped tank about 1 ft from top. Officer round yesterday & intends to close this point. Pumped again in afternoon and only would go for about ½ an hour & also cleaned carburettor. Went to pictures. Change of programme in evening – Very good. Read some surveying before bed.\n","110":"\n\nUp at 8. Day hot with a good breeze. Cleaned cylinder and took down water circulation. Savage came round in after. but we could discover nothing wrong. Tried to run her again but same result and must be inadequate cooling system. Wrote letters all evening until 10. and then pumped as much as she would go.\n","111":"\n\nDay fine but thundery looking and rained in evening a little Heavy firing. Usual routine and still same. Bearings heating.\n","112":" after Easter. Sunday 6\n\nWindy but sunny. Pumped tank full and cleaned her thoroughly in morning. In aftn. down to Bottom Wood and a good promenade – Read some magazines in evening I obtained.\n","113":"\n\nDay cloudy but pleasant. Up at 9.30 and at 11 a lorry came with men from 5th Army RE workshops and took away my plant by 1. Saw Savage and he may close too. Have to wait till to-morrow for everything to go and then return to 148 Coy in evening to await new job. Went to tea at Savages and saw pictures in evening Home at 8 and wrote letters. Very good pictures. Send Kit by ration wagon to-morrow\n","114":"\n\nCloudy. Up at 9 and took kit down to wagon and got rations. After dinner packed up and got away by 3 to 148 coy meeting Savage & 2 other men also going back. In evening went for a walk to Y.M.C.A. & lights out at 9.30. In tents with 5 other very amusing “chums\". got 1 parcel.\n\nMay, 1917. Wednesday 9\n\nFine day. Up at 7 and after wash had breakfast and paraded at 8. and was asked if we wanted to return to companies. I said “yes\" and went away about 11. to Bapaume. 1st Divn. seems to be going out","115":" Divn. out already & I couldn’t trace company so returned to water point & slept the night there Only a little water came through & saw Bolton & he told me to come over to on next day. Bed at 12 after reading.\n","116":"\n\nLovely day. Up at 10 and after dinner came over to chateau at 1 to join coy as soon as possible. Passed day pleasantly and in evening went to Albert to show with Davenport which we found we had already seen. Got a beer and home at 8.30. Thundery & some rain.\n","117":"\n\nDay very warm. Went down to W.P. at 9 and to D.H.Q. . To Tricourt Farm in afternoon & C.R.E. Corps Troops, and got some rhubarb. Aeroplane M.P. Scout came down close by through scarcity of petrol. Bed at 11. Bolton gave us some beer.\n","118":"\n\nVery warm day. Up at 8 & helped Burnop to clean up – am waiting ready to return to Coy if not coming out. Coy not coming out yet so set out at 10.30 after some beer and caught a lorry but had a wait on road for some time. Walked from Bapaume to Bancourt & on to Coy near aviation Gd. about 3 miles after passing","119":" D.H.Q. Price M.C. Dare & Jacobs M.M. & me promoted l-c don’t know why. Got tea – letters and read till dark. No sign of moving. Our gramophone in full swing.\n\nMay, 1917. Rogation Sunday. Sunday 13\n\nDay cloudy & sultry & heavy shower in morning. Up at 7 and after breakfast did drill order at 8 and no other parades for the day. Some more mail. Amused myself reading in afternoon and evening and bed late about 11. Rained during night and roof leaked and got wet a bit.\n","120":"\n\nDay a bit rainy and cloudy. Check parade at 7 & drill order at 9. No work and got my boots mended. In afternoon went near Tricourt for a good hot bath & passed rest of time reading chronicles, and Motor Manual. Gramophone spring broken.\n","121":"\n\nDay cloudy and one shower. Parade at 7.30 & drill order at 9 for squad drill & then company drill with transport. In aftn. went to a gully close by and selected M.G positions for practice. Good football match with 3rd A.S.C & were unlucky to lose by 4 points. Read in evening Motor Manual.\n","122":"\n\nCloudy in morning & drizzling rain all afternoon and evening. Breakfast at 8 and drill order at 9 and did some squad drill me operating a while and company drill till 11.30. Fell in at 1.30 and marched to Velu about 3 miles and did some trench digging for reserve M.G positions behind old german wire Wrote all night\n","123":" Ascension Day. Thursday 17\n\nDull all day. Rained a good deal last nt & got a bit wet in leaky hut. No parades and read & wrote in intervals Saw soccer match in evening won by us.\n","124":"\n\nDull & warm. Inspected by C.R.E in morning no parade in aftn. Read & wrote more. Saw soccer match against 1st Fd Coy lost 4 to 0 & also a good rugby match afterwards.\n","125":"\n\nCloudy & sultry. On guard to-day. Played No. 4 in afternoon & made 3 out of 36. They made 85. Plenty of rum about in evening & some made nuisances of themselves. Didn’t sleep much.\n","126":" after Ascension. Sunday 20\n\nHot day. Played rest of section in morning each making 41. me 0. In aftn wrote, read & watched cricket. Moving to-morrow to Bazentin. Spent a lively evening with candles flying about.\n","127":"\n\nDay cloudy & very sultry. Reveille at 5 & breakfast at 5.30. Fell in at 6 and after cleaning billets moved out at 7.15. Arrived at Ovillers at 12.45. Very tired but visited Becourt saw-mills and got my pack and to chateau for canteen stores. Had a good bath in evening & wrote this up & read papers until dark. Moving Henincourt in morning.\n","128":"\n\nDay very wet. Up at 6 and moved off in rain through Albert, Millencourt to Henincourt. Fair billets & 2nd Coy also here. Arr at 11 & went for a walk after dinner dinner. Mail in. Slept well on grass in open. Some drunks about.\n","129":"\n\nFine day. Spent intervals in making things more comfortable. Up at 7 and drill order at 8.30. Went for route march to Lavieville & returned at 10.30. Drill order again at 2 & did squad drill. Some drunks & rather amusing. Some reinforcements in. Slept out again.\n\nMay, 1917. Empire Day. Thursday 24\n\nFine day. Check parade at 7 and drill order 8.30 and marched to Bresle & back arrived at 11.30. Fell in again at 2 and were dismissed. Played bridge in afternoon and cleaned up thoroughly. Leave to Amiene to-morrow.\n","130":"\n\nDay fine & warm. Walked over via Lavieville to main road after parade at 7 and rode to Amiens arrived at 10.30. Thoroughly enjoyed day and had good meals. Started out at 7.30 & walked to Querrau & then rode to Franvillers walked home via Bresle & Lavieville getting home at 12.30.\n","131":"\n\nLovely day. Parade at 7. & again at 8.30. Walked to a wood and sat down till dinner time. In aftn. played No. 3 beating them. In intervals sent my photographs & sewed on colours & stripe.\n\nMay, 1917. Whit Sunday. Sunday 27\n\nUsual parades & 1 ½ hours M.G instruction in morning & played cricket in aftn. Wrote all evening. Fine day\n\nMay, 1917. Whit Monday. Monday 28\n\nFine day but shower in evng. 7 Parade & Marching order at 8.30. Had to return to shave & clean-up. Came back &amp. had to return again & discard packs. Marched to Sports ground &","132":" Bgde Gen Leslie inspected us. Savage was \nnot\n congratulated. Fell in at 12.15 and had a bath at Bresle & rest of aftn & evening wrote letters. No 2 on picquet to-night.\n","133":"\n\nFine day but rained in evening & had to sleep in. M.G in morning & played signalling company football in evening. Won by 2 points.\n","134":"\n\nDull day but slept out as usual. Played Sig Coy cricket won on","135":" innings by 1 run. The new bat was broken.\n","136":"\n\nDay fine. Usual parades & M.G in morning & cricket in aftn & No. 4 beat them by 3 runs 24 & 21. I made 5. Wrote some letters & played gramophone in evening.\n","137":"\n\nFine day M.G & march in morning Paid in afternoon. Rumours of moving on Monday further back. Football in evening v 2nd Coy. We won by 5 points after good game.\n","138":"\n\nDay dull & rained a bit in evening. M.G as usual – & cricket v 1st Coy in evening. Lost by 40 runs. Slept in.\n","139":" Sunday 3\n\nFine day. Dentist in morning filled one tooth and killed nerve in other. No parade in aftn. Tooth aching a lot. Played 2nd Rugby won by 9 points. Slept out again after writing some letters\n","140":"\n\nDay fine, on guard all day from 9.A.M. Nothing eventful. Good guard. Soccer in evening \nlost by 10 to nil\n drawn.\n","141":"\n\nDay fine and warm. After guard cleaned up and in aftn. spent a very pleasant aftn. with Jack at Aveluy Lost Rugby match by a 4 to nil\n","142":"\n\nUp at 6 and after 7 parade set out at 8 arriving about 12.30. Very hot day and stiff march through Lavieville, Buire & Morlancourt to about a mile past Bray Village. In afternoon had some and rode round Bray on bike. Very deserted & few shops and has been shelled slightly. Bonza river with fish and had a dip although rather too deep. Fair billets. Spent evening trying to fix gramophone. Looked thundery in evening so slept in.\n","143":"\n\nUsual check parade at 7 and fell in at 7.45, and marched about 3\/6 mile to river with our pontoons. Spent morning loading & unloading pontoon drill. Stopped at 11. Parade 3-6. Hot in morning and rained with thunder in afternoon and fairly heavily in evening. Did trestle bridging in evening. Bathing except in one deep hole prohibited. Sinclair back from English leave.\n","144":"\n\nDay dull and sultry. Worked on pontoons all the morning and stopped at 12.30 and spent aftn. reading.\n","145":"\n\nDull and sultry. Worked on rafts all morning till 12.30 & in aftn. filled will and read and wrote till bedtime.\n\nJune, 1917. 1st after Trinity. Sunday 10\n\nDull & thundery. Worked on bridge all morning.\n\nJune, 1917. Monday 11\n\nDull and thundery. Practised worked on bridge and night work. Very good swimming sports in afternoon In morning we were first in erecting bridge 1st Coy 1st in dismantling &","146":" Coy nowhere.\n","147":"\n\n9.55 It Dull & Thundery. Practised bridge with 15 pontoons in morning & in afternoon put up 15 span bridge in presence of Gens White . Heavy & long day.\n","148":"\n\nFine and warm. Finished boat races in morning & fell in at 5.30 & rode on pontoons to Froissy & , played R.E. soccer good game won by 2 to nil.\n","149":"\n\nFine day. Parade at 6.30 & 8 went down to river and had had a turn at forming piers. Home at 12.30 and swimming parade at 2 and soon after I came home and spent afternoon and evening washing clothes and writing letters. Rumours of special order by Haig saying war was to be over soon.\n\nJune, 1917. Friday 15\n\nVery hot all day. 7 Parade and 7.45 went down to river. Colonel rather touchy and kept us working till 1.30. Fell in again at 3.30 for bathing parade and after read paper. Paid in evening at 7 and got some wine. Bed at 10.\n\nJune, 1917. Saturday 16\n\nDay hot – 6.30 parade & fell in again at 9. And practised rafting all the morning. Until 1. In afternoon swimming parade & I afterwards got a paper and read ME all evening. Concert in evening by D.E. disgraceful & seen Nolan & all officers drunk in front of French civilians & Tommies\n\nJune, 1917. 2nd after Trinity. Sunday 17\n\nVery hot all day. Had a bathe in morning and got wet all over – so had a washing day. In aftn. read & got paper. Wrote letters in evng.\n","150":"\n\nDay hot and thundery in aftn. In morning ran out a raft and at 2.30 full marching order for kit inspection. Passed rest of day pleasantly reading various useful things.\n","151":"\n\nUsual parades. Spent morning collecting pontoon equipment until colonel told us we were like helpless ants and took charge to our disgust. Swimming parade in aftn & after got a paper & read various things. In evening went for a swim with Berkett, Macmillan, Phillips and learnt something of the art. Heavy thunderstorms several times came up.\n","152":"\n\nDay fair and some rain. On guard at 9 and at 9.30 took Snookes down to be tried. Case dismissed so stopped guard at 10. In aftn. made up raft for 5th division to float down to Corbie to-morrow Guard again at 8. Rugby match 2 & 3 V 1 drawn.\n","153":"\n\nFair day but rained heavily in evening. No parades & rest of section guarding pontoons. Read and amused myself in various ways. 9\n\nJune, 1917. Friday 22\n\nSome rain. Formed bridge in morning practising for competition to-morrow. In aftn. parade at 2.30 for field dressings.\n\nJune, 1917. Saturday 23\n\nNo 1st parade as S.M. hadn’t recovered from night before Competition for bridging in morning. We were first on time but were disqualified 2nd Coy –","154":" Coy. 2.30 drill order – Bonza mail & spent rest of day enjoying it.\n","155":" after Trinity. Sunday 24\n\nParade at 6.30 and church parade at 8.30 until 10. Marching order at 2.30 and had a minute inspection by the mayor. Spent rest of day writing letters. (again)\n","156":"\n\nFine day a little rain in evening. 6.30 parade & 7.45 drill order then marched down and did forming up competition. 2, 1 3. Marching order at 2 and inspected by colonel. uncomplimentary. More mail – spent rest of day writing. Soccer football in evening V 28 C.C.S. I didn’t go. Won by C.C.S 3 to nil.\n","157":"\n\nFine day and fairly warm. Usual parade at 6.30 and went down to river at 7.40 and old detachments formed bride and back again at 9.30. Put on belts and paraded at 1st Company for lecture at 10. on prevention of venereal disease for future progress of race after war. In afternoon down to river and practised rowing and tug of war for competition on Thursday (sports.) 9 in F.O.W. team. Had another row in evening until 9 o’clock.\n","158":"\n\nDay warm a little rain with thunder. 6.30 parade and drill order at 9. Then marched to river & practised for morrows events. In afternoon at 2.30 went down for swim and came back late. Spent evening writing.\n","159":"\n\nRained a good deal last night and flooded some out. Fine day and very heavy thunderstorm in evening our roof like watering can. 6.30 parade & 8.30 down to river races late at 10.15 instead of 9.45. Parade at 1.30 and home 5.30. and after finished letters Tug of war won by 2nd Coy I pulled rottenly. N.S.W. interstate. H section inter company race.\n","160":"\n\nFine day. 6.30 parade. Fell in at 9 and went down to river and collected gear. Parade at 2.30 drill order & then broke off Pay at 7.30.\n","161":"\n\nRaining steadily all day from about 1 to next morning. Usual parade at 8.30 marched down to river and as no work went for route march to Cappy & back by Froissy. No parade in afternoon so read papers played bridge in evening.\n","162":" after Trinity. Sunday 1\n\nUp early and caught train for Amiene at 7.10. Arr Rosieres and got coffee and onto Amiens after changing trains. Made some purchases and went to Cathedral at 11. Lovely organ and music. Dinner fair and met Fe and Ayliffe & Baker. Saw pictures (fair) & caught train at 5.10. Home at 9 after coffee at Rosieres after pleasant day – Report of landing of American troops.\n","163":"\n\n(Residents abroad should now order this Diary for 1918.)\n\nNo 6.30 parade as sergeants evidently not recovered from previous evenings potations. Drill order at 8.30 & went for route march to Froissy and Cappy. Home about 11.00. No parades in aftn. so enjoyed some reading. Went for a swim in evening and read some more. Gray a fool. Fine day.\n","164":"\n\nFine and warm. No 1st parade. Fell in at 8.30 for drill order & gas bags and went for route march near Cappy where we spent ¾ of an hour in swimming home at 10.30. Read. Parcel from A.S. Drill order for squad drill at 2.30 and spent an hour pleasantly in the shade. Broke off wrote and read. Much transport moving through here.\n","165":"\n\nHeavy and long thunder shower this morning and I got wet & had to shift. Dull with a little sun. 6.30 check 8.30 same parade and home at 10.45. Read in intervals all day. 2.30 drill order and did a little squad drill until 3.30. 2 & 3 VI Rugby in evening won by 1st 9 to 6 after a good game.\n","166":"\n\nDull day. 6.30 parade & drill order 8.30 and marched to Cappy & back by Froissy. Drill order at 2.30 and took 6 men for fatigue to drivers for afternoon. Read in evening.\n","167":"\n\nLovely day. 6.30 parade & 8.30 drill order and marched to Proyart via Chugnies & Chuignolles and back on main road at 11.15 Fatigue order at 2.30 and cleaned up drivers until 4. Went for swim at 6.30 & heard two mills bombs explode near Froissy. Getting on well. Afterwards heard drivers fishing with bombs & one killed 4 others wounded and 2 implicated. One not expected to recover.\n","168":"\n\nLovely day. Up early & caught train for Amiens Walked about all day till 6 & met Hayward & got to place about 6.30 with a big crowd of others 134 altogether and I knew quite a lot. Cost 15f and had a wonderful dinner and jolly old time with old friends. Over at 10.30 and home by Motor Ambulance a joy ride through Albert right into Bray and home at 12.30. feeling much fresher than I thought I would be. Avery with me all day.\n","169":" after Trinity. Sunday 8\n\nAnother thunderstorm this morning and I had to move again and got wet. Very severe. Didn’t attend first parade and Parade at 9.30 and were dismissed. Wrote letters all the morning. Fell in at 2 & marched C.Cs. for burial of Cockburn. Home & finished letters.\n","170":"\n\nDull day & some wet mist. 6.30 parade & saw doctor in morning. Rained during Scabie inspection. Fell in at 2.30 & were dismissed for day.\n\nJuly, 1917. Tuesday 10\n\nFine day. Up early and after dressing set out on bikes for Buire with Burkitt who has a very bad jaw ache. Went via Meaulte. Big crowd there for dentist Met Wemyss and Holosche. Got my tooth filled at 3 and home at 5 Burkitt remaining 3rd Batt 11 casualties by bombs.\n\nJuly, 1917. Wednesday 11\n\nFine day cool nights. 6.30 parade & 8.30 drill order. Marched to pool & back at 10.30. Aftn. 2.30 drill order. Went down under cover and discussed sports to be held on Saturday.\n\nJuly, 1917. Thursday 12\n\nUp at 6.25 and prepared for leave However just missed the train. So came back and usual swim at pool. In aftn. at 2.30 went down to river and practised for Saturday’s sports. Only lukewarm enthusiasm. News of engagement at Going to Montdidier to-morrow. Moving shortly. Lovely day.\n\nJuly, 1917. Friday 13\n\nFine and warm. Caught train at 7 and continued right on to Montdidier. Taken for Americans Had a look round fairly large town and then dinner. Various sightseeing in afternoon. Lot of French on leave for celebrations to-morrow. Caught train at 6.25 and home late & tired.\n\nJuly, 1917. Saturday 14\n\nDull and thundery. Parades as usual and at 8.30 some went down to prepare course rest dismissed. Wandered down at 2.30 and watched sports till 5. Fair sport. Lost 2nd prize in sweep by 1 no. Rained heavily by morning & got wet again a little. Very fair concert by 1st Coy in evening. Back at 11. See 1st division down here for about 10 days.\n\nJuly, 1917. 6th after Trinity. Sunday 15\n\nFine day & some wind check parade at 7.30 and all were late. Drill order at 9 and dismissed. Church parade at 11 but after waiting half an hour & no parson turned up were dismissed for day. In afternoon wrote letters.\n\nJuly, 1917. Monday 16\n\nRained a good deal last night and got wet a bit. Fair day. Usual parades and went down for swim. Rain in aftn. & were dismissed. Lot of 1st div here and some drunks. Sergeants again to-night.\n\nJuly, 1917. Tuesday 17\n\nFair day. Usual parades. March towards Proyart. dismissed at 3.30.\n\nJuly, 1917. Wednesday 18\n\nRaining and dull nearly all day usual parades Morning squad drill below dismissed in afternoon. Vigorous preparations for Saturday football.\n\nJuly, 1917. Thursday 19\n\nDull all day. Usual parades. 8.30. Marched to Froissy in charge of King and sat down till time to come home. Fell in at 2.30 and were dismissed. Fell in at 3 and blankets were fumigated at 1st company. Did some washing in evening.\n\nJuly, 1917. Friday 20\n\nDull & some sun. Told last night to go to Amiens but Naylor took my place. Usual parades. In morning went for march along canal. In aftn. got boots done. Received violin in evening.\n\nJuly, 1917. Saturday 21\n\nFine day. Usual parades. Boots in morning. Drill in evening. Rugby match V. 9th Batt. Won by 5-3.\n","171":" after Trinity. Sunday 22\n\nLovely day. Corbie matches off. Guard at 9. Two prisoners took down to O.R. at 10.\n\nJuly, 1917. Monday 23\n\nLovely day warm. Off at 9 after gas inspection. Wrote letters all day. Swim in evening. Moving Wed or Thurs\n\nJuly, 1917. Tuesday 24\n\nSultry. Gas lecture by N.C.O. at 8.45 and worked on Froissy ground till 11.15. 5th div came at 2. only teams. 2. Soccer won 3-2. 2nd Aust won 10-12 to 6-6.","172":" Rugby won 29 pts to nil. Late home to tea. bed early & read.\n","173":"\n\nThundery cool day. Parade at 8.45 drill order and dismissed to clean equipment. Went for swim Marching order at 2.30 and after a lot of cleaning up were dismissed Played bridge in evening.\n","174":"\n\nFine day inclined to be sultry. Missed 1st parade by being too lazy. Fell in at 8.45 and dismissed to clean round huts. Played bridge. Fell in at 2.30 and dismissed & played bridge again. Went for swim in evening. Bed early Marching order to-morrow at 8. Probably moving at 12 from Albert or nearby for 12 hr journey to Steenwerck.\n","175":"\n\nFine & sultry. Parade at 6.30 and after getting ready fell in at 8 and afterwards final cleaning up. Went for last swim Dinner at 11 and got ready and fell in at 11.45 and marched off. Two drums rotten. Hot march and arrived Albert in 2 ½ hrs. Got some tea and food and boarded train. Off at 4. in closed trucks to Amiens, Canaples, Doullens st Pol to Steenbecque. Slept a little. Beer episode Some of","176":" with us. Rotten cold.\n","177":"\n\nFine cloudy day. Arrived destination 2.30. Helped unload horses & marched off via Morbecoue past Wallon Cappelle to a farm house. Breakfast & slept till dinner. Slept again till tea time. Bad billets & sleeping under trees. In evening went with Taylor to Hazebrouck. returned at 9. Very nice place. Then bed. Country very pretty and intensely cultivated and everything very clean. Slept well.\n","178":" after Trinity. Sunday 29\n\nStorm. At 6.30 parade only a few attended and kept waiting until all turned up. 7 of us missing & to provide a picquet to-night. Very funny. Drill order 8.30 for march Heavy close storm caught us & took refuge in farmhouse. Very fine cloud effects. Back after long march at 11. Dismissed parade at 2.30 & wrote letters in spare time. Still raining.\n","179":"\n\nDrizzling rain all day. Wrote letters in intervals. Reinforcements, Kernot here. Orderly corporal. Felt all right. Rumours of moving to build baths for division about 5 miles away.\n","180":"\n\nDull all day. No parade. Fell in at 8.15. marching order and marched to Blaringham arriving after 9 kilo march at 10.30 near church. Had dinner & moved up to 5 D.H.Q. and pitched our 8 tents. 4 in ours. played bridge after tea as it started to rain again.\n","181":"\n\nRaining most of all last night and to-day. Up at 7 and breakfast 7.30. Read and wrote all morning. Very heavy artillery yesterday near Messines. Wrote letters in aftn. and bridge in evening. On picquet.\n","182":"\n\nDull all day drizzling in morning & I stayed in bed Rest went down to baths. Went for walk in aftn. & 5.45 marched back to camp arr at 8. Bed.\n","183":"\n\nNo parades in morning. Stayed in bed till 11. 2.30. drill order parade for check. 5 check parade & 9 check parade. A M.P. on duty. Drizzling rain all day.\n","184":"\n\nShowers of heavy rain during day. 6.30 parade. 8.30 drill order & gas helmets and did some drill. 12 check parade 2.30 drill order went for some route march and got caught in severe shower. 5 check parade. 9 check parade. 9.30 lights out. Visit from Mitchell.\n","185":" after Trinity. Sunday 5\n\nClearing up and some sunshine Usual parades. drill in morning Dismissed at 2.30 & usual check parades.\n\nAugust, 1917. Bank Holiday. Monday 6\n\nCloudy & fairly sultry. Usual parades. In morning drill and gas practice. In aftn. march round main road to Morbecue. Home at 4 & check parade at 6.\n","186":"\n\nFine day. Usual parades In morning. Semaphore and gas helmets. In afternoon reconnaissance. Phillips Little Christian Taylor towards Hazebrouck round home by Wallon Cappel. Wrote up results in evening and gave in at 9.\n","187":"\n\nFine day. In morning got my boot repaired. In aftn. route march up to hill and round home. Usual parades. Long march map better than I expected.\n","188":"\n\nBreeze, fine and light showers. Ordinary parade at 6.30. Marching order at 8.30 & cleaned up and played bridge till 11.30. Started at 12 behind brigade. 1 hr for dinner played cards. Skirted Hazebrouck and past Birdwood’s saluting base. Through Foret Nieppe to Merville & onto Vieux Berquin camped in farm 2 miles on arr about 7. Check parade at 9 good soon sold out. Plenty of good pears and some other fruit . Hazebrouck raided by planes last night and A.A. shrapnell barrage put over – Hazebrouck bombarded early in morning and a didn’t carry pack.\n","189":"\n\nWindy and fine. 6.30 check parade at other billet. 8.30 drill order and gas helmets. Major on parade and severe regimental discipline. Inaugurated “awkward squad\" in which I attend for not shaving. A place with numerous factories nearly raided last night. A.A guns in action & shells fell fairly close.\n","190":"\n\nFine and some showers. Heavy shower at 9.30 Orderly corporal all day usual job Washed clothes in interval\n","191":" after Trinity. Sunday 12\n\nFine day & isolated showers. In morning did squad drill and surveying. In afternoon dismissed Finished term on squad drill with Sgt Gentle at 4.30 washed cloths and read in evening. Usual parades all day.\n","192":"\n\nFine day. Marching order at 8.30 and helped drivers to clean up & inspected there by General Lavinia. C.R.E. & staff captain Waited some time while inspection was on and a parley afterwards In afternoon some squad drill and lecture on German fortifications. In evening went on leave to Vieux Berquin & home at 8. Not very interesting.\n","193":"\n\nFine day. Usual parades. Fell out at 9 for farm work with Taylor and Prince and worked all day during parade hours at tying sheaves. Beer and milk provided. In evening washed clothes and did some of my equipment in spare time. Shower in evening. Cricket match in aftn. against T.M.B. won by us.\n","194":"\n\nFine day and some showers On first parade & guard at 9 with 4 men. 5 prisoners. Rotten guard usual routine. In aftn. S.M. butted in as prisoners were playing cards and promised us awkward squad and later reprimand by Major me. Eventually nothing occurred. I was quite right. Ticklish time and didn’t get much sleep at night. Few showers.\n","195":"\n\nFine day some clouds. S.M. only allowed us half day off. In time I washed equipment very thoroughly. In aftn. L.C.’s & 2nd C under Beck for drill. Tried to smooge. Very slow work on elementary rot. In evening played cards. Feel tired.\n","196":"\n\nPerfect day with breeze. Usual parades. N.C.O’s parade till 11.30 & again from 2.30-4. Played bridge in evening.\n\nAugust, 1917. Saturday 18\n\nFine day. Usual N.C.O. parades In afternoon at 1.30 marched to near Doulieu and played 2nd Coy cricket. Lost by about 58-52 by Grahams bowling. Shower during match. Bombing raid very severe last night all round here.\n","197":" after Trinity. Sunday 19\n\nUsual parades Fine day & some wind. Church parade at 9.30 at","198":" Batt. back at 11.15. Aust mail in. Drill order 2.30 & were dismissed. Usual parades Read and played cards Raid again\n","199":"\n\nPerfect day. Usual parades H.C.O’s drill as usual. Played cards in evening & wrote letters in intervals. Another raide 2 machines brought down.\n","200":"\n\nPerfect day. Usual parades marching order at 9 & Kit inspection afterwards. N.C.O. drill as usual Raid last night a little earlier about 9. Wrote in evening.\n","201":"\n\nFine day bit cloudy. N.C.O. drill in morning. Dismissed at 2.30. Match v 2nd Coy cricket lost by 11 runs. wrote letters & had a bath.\n","202":"\n\nWindy & bit cloudy N.CO drill. Usual parades In aftn. Limber with Little to Vieux Berquin. Back at 5. played bridge in evening. Football match v 2nd coy won by about 4 goals.\n","203":"\n\nVery windy, cold & some cloudy. N.C.O. drill in morning. Bath in aftn. at Outersteene. Back at 5 Wrote in evening.\n\nAugust, 1917. Saturday 25\n\nFine day windy. Usual parades N.C.O’s drill in morning & in aftn. ditto but broke off as no one else was working. More writing\n\nAugust, 1917. 12th after Trinity. Sunday 26\n\nFair day. Heavy rain in evening & I got all my things wet. Church parade at 10th at 9.30 . Back in aftn. instead of watching football divisional championship v","204":" Batt lost by 9 pts by bad luck. concert 6.30 very good spoilt by rain.\n","205":"\n\nCloudy windy and cool. Orderly corporal all day usual duties. Rained last night and got most my things wet.\n","206":"\n\nVery strong S.E. wind all day abating at night. Usual parades. Some were inspected by Gen Plumer yesterday. Did some fatigue work in morning for ½ hour and aftn. squad drill. Letter from A.S\n","207":"\n\nStrong wind again. N.C.O drill in morning. Wiring in aftn. usual parades. Some showers.\n","208":"\n\nWindy but finer. Visited dentist 2nd F Amb in morning but not much done. No parade in aftn. and read.\n","209":"\n\nCool day & dull. Guard all day. quiet with Little. Didn’t sleep much as Cupit didn’t act\n","210":"\n\nWindy and dull. Bath parade 11.45 & row with S.M. for not attending and Kernot ordered us on 12.30 parade with drivers. At 2.30 he tried to get us on fatigue but Price objected. Down for bath with drivers; avoided further parades and unpleasantness.\n","211":" after Trinity. Sunday 2\n\nUsual parades. Better day. 2 church parade with ground sheets but raining so cancelled Dismissed in aftn. Read.\n","212":"\n\nUsual parades. Perfect day. Last night awakened several times by bombs, machine guns & art bombardment. Little’s F.G.C.M. in morning with Christian and pleaded guilty. In aftn. ½ hr fatigue & rest of day read.\n","213":"\n\nPerfect day. Orderly Corporal. Expect to go up line shortly. Usual parades and work. Read in intervals.\n","214":"\n\nPerfect day. Great raiding activity last night and bombs fell fairly close. This morning two german planes hovered over Bailleul for 15 minutes attacked by many M.GS & AA guns but both eventually got off Bailleul bombarded a lot lately. Painting all day signs for use up line.\n","215":"\n\nFine day. Bath in morning and made a mimic strong point in aftn.\n\nFine day sultry and warm. on parade till 10 when Sinclair came with orders to be ready within 20 min in drill order with 1 ration Marched at 11 towards La Motte and after lunch worked hard digging dummy trenches 3’ wide & 9\" deep until 7.30 when we arrived home very tired considerable excitement about moving but may be here for another week yet.\n","216":"\n\nFine day, misty in evening. Guard all day. Men up at 4 and onto same job. I slept in till 7. Back at 11. Good guard and quiet with 4 men on.\n","217":" after Trinity. Sunday 9\n\nFine day and warm. Off guard at 9.30. & rested in morning while others went to 10th Batt Church parade. In aftn. tried to write to Melv but Mitchell came. In evening news of moving to-morrow\n","218":"\n\nFine and warm. 6.00 check parade and told marching order with blankets at 8. Fell in cleaned up and off at 9 to where we caught motor lorries 14m each and come via Outersteene Bailleul & Dickebusch to behind Ypres. on main road. Did numerous fatigues & rested & read paper \n\nArtillery & aircraft lively, 10th not moving, Bailleul fine town and only slightly shelled. Guns, cross roads railway & balloons close by. Fritz shelled heavily at 7 and Summerfield was wounded in left buttock. I standing alongside. Took him over to dressing station and home about 10.\n","219":"\n\nDay fine Aircraft very active In morning late for parade a 7.30 In morning righted pontoon & afternoon unloaded pontoons and erected and house. Finished 7 Quieter. Not going out to-night and are duty section.\n","220":"\n\nDay fine & windy. Spent morning finishing and filling in camp shell holes. Quieter, afternoon off and going out to-night at 2 to make road just behind front. 1, 2, & 3 back about 10. No casualties but plenty of gas and fairly warm work getting in and out.\n","221":"\n\nFine day. Up at 1.30 and off on pontoons at 2 through Ypres. Very lively and is shelled continuously A motor lorry was caught out of a convoy and set alight & he shelled heavily and we had to go round. Used incendiary shells with red glare showing up everything. On to Menin Road and to job. \n\nI was laying bearers. Fair job. Shelled a dump and fired cordite and shelled continuously through which our drivers had to go. Home all night although lively all round. Planes were over at daylight low and kept us busy. Breakfast & slept a little in aftn. tea at 6 and bed 7.30 till next morning. Home 9.30. 3 horses wounded.\n","222":"\n\nFine day. New job on right of old. Started at 3.30 and job at daylight near 3rd Div Artillery which was firing so we had to shift. Job filling shell holes & making a pack & inf track of 300 yards. Very lively artillery & an column was caught and 3 wounded badly and 4 horses killed by 1 shell close to us. \n\nMenin Road, an evil place searched thoroughly. Our pontoons were caught by two shells on Hell Fire corner on Menin Road and Warrington corduroy & 3 mules wounded and pontoons stopped in holes. Miles wounded in face & not expected to live & Tanges – Tunneler light wound in rear. Luckhurst & Waine also wounded in legs. Home at 10 walked both ways.\n","223":"\n\nFine day & weren’t called till 4. Out on job and did some work but had to stop at 8.15 probably as a bombardment was expected. Home at 10 and walked both ways 12 enemy planes flying low over here about 11.30 and dropped 2 bombs and all got away safely. Spent afternoon writing and reading. Work at 9 to-night and out on pontoons but blocked on Warrington Rd as it was blown up and walked rest. \n\nShelling intense and stopped work several times – Luckily no one hit although 3 & 4 struck it heavily. Walked home usual way & still strong. Very tired. Each section digs a strong point after stunt Probably on Wednesday.\n\nSeptember, 1917. 15th after Trinity. Sunday 16\n\nHome usual way at 5. and slept \ntill\n nearly all day barring mealtimes. Out again at 9 & 3 of","224":" Squad in by Menin Road on to job. Bombardment easier but plenty of gas shells and got it once or twice thinly. Carried up stunt material for strong point and stopped about 10 to 3 and came home. \n\nMotor caught on Menin Road and another capsized on Corduroy. Shelling lighter although our guns heavy. Some men lost their way and didn’t get home till 8.\n","225":"\n\nDay cloudy. Home at 4.30 and slept till 7 breakfast. Slept again till 12 and didn’t sleep much in aftn. as big gun firing close by so cleaned up and wrote a little. Out again at 9 and usual job Fritz shelling very heavily all round & we had to take shelter several times and machine gun bullets plentiful. Fixed up our dump for stunt before knocking off and home late – at 4.\n","226":"\n\nDay fine and slept with intervals for meals till evening when we carried over copper. McKenzie stayed and talked till 11.30. Our night off. Only half of sections went up.\n","227":"\n\nDay fine. Stayed in bed till 10 and moved copper again. Day spent variously in cleaning up and getting 3 ½ days ration etc. Cloudy. Lecture by Price to H.C.O’S re stunt in afternoon.\n","228":"\n\nFor Stunt See Appendix.\n","229":"\n\nHome about 8 and after cleaning up went to bed and slept soundly.\n","230":"\n\nUp at 9 and waited about till 10.30 Day fine and cloudy. On pontoons on to job with Price on mono-rail – worked till 6 & home at 8. Williams missing. German heavies active & shelled all round us & we had to retire to dugout dressing stn. Numerous splinters flying about. One big shell landed right on our road and we had to repair road. German planes always active and shot down balloon \nthis\n last evening at nightfall. Walked home via Ypres.\n","231":" after Trinity. Sunday 23\n\nDay cloudy but no rain up at 4.30 & left at 5 & onto mono rail Worked uneventfully till 12 and rode home on pontoons. Job likely to prove white elephant. Home via Warrington Road. German heavies very active shelling systematically everywhere & we had to gallop through a heavy barrage on Warrington Road near Bund & things were fairly hot. \n\nCleaned up in afternoon and wrote up diary Graham quite nice Had to go to bed early as no candles. Paid. Fritz attacked balloons again but got wind up before completing job last night.\n","232":"\n\nLovely day misty in morning. Set out on pontoons for job at 10.30 and arrived about 12. Fritz strafed junction of our road and got 3 horses and a limber and things unpleasant before we arrived. I loaded here two wagons of rails and took them to new part of job beyond wood and on right of our road along old road. Work on top of hill and I considered it foolhardy. Heavies falling all round us and at length chased us into an old german trench. On left of Glencorse road on hill a battery was bombarded where prisoners were working corduroying and several wounded.\n","233":"\n\nGas shells used and small H.E. guns were knocked. Back on to job and crump shrapnel burst over us at 5 to six so retired. Fritz had good observation and had two balloons up and paid some attention to working parties although perhaps ours too small.\n\nTuesday Hell\n\nSee Notes.\n","234":"\n\nFine day a bit misty. Didn’t get up till 9 and found the work cancelled for the day. 50 prisoners came down this morning and heard 5th Div had captured their objective in spite of all. Spent morning cleaning up and went over to 12 gun and watched it for some time Other gun smaller. Also watched observation balloon. In afternoon wrote diary and some letters. Bed about 10 and have to go out to work again at 4.\n","235":"\n\nFine day. Out on pontoons to Hell Fire Corner and walked out to left about 7 ½ miles where we started forming. Rumours of working till 1.30 and did very little work all day as some argument about direction of line. Some shells searching behind us but not too close.\n\nGen Lavinia passed by and got chased by shells. Bremmer and Kernot knocked us off at 12 and we came home riding on motor lorries cleaned up and at 7.30 was having a wash when I heard my leave pass had arrived and started to-morrow. I was annoyed as no warning whatever was given. Went down with Price to C.R.E. & saw Hayward\n\nSeptember, 1917. ","236":"\n 27\n\nfor scabies & vermin – and came back and got our passes. Supposed to get train at 1.30 at Poperinghe. Decided to wait till morning as not much chance of catching train. Train at 10.30 to Boulogne. Bed about 11.\n\nFriday 28 \nSaturday\n\nGot up at 4 with rest and after breakfast shaved and got kit together. Went out with Sharp on limber at 7 and had a pleasant ride on a beer barrel. Tried to go by 10.30 but nothing doing. Went to Talbot house and had a look round Poperinghe. Went to a concert troupe Wanny Wans at 6 and enjoyed show.\n","237":"\n\nStayed at Talbot House until 9.30 and then went down to station and waited until 1.30 in the cold. Fritz bombing close by & A.A. guns busy.\n","238":"\n\nDidn’t sleep on journey and very tired. Arrived about 6 six o’clock and spent a long time waiting at station. Moved off through Calais about 2 miles to wharf as we alighted at Les Fontinetta. Here we stayed again doing nothing till about 12 when we went on board without trouble and crossed quickly on a good steamer & water and wearing lifebelts and escorted by destroyers with a H.S.\n","239":"\n\nUp at 9 and waited about till 10.30. Day fine & cloudy. On pontoons onto job with Price on mono rail. Worked till 6 and home at 8. Williams missing. German heavies active and shelled all round us and we had to retire to dug out. dressing station. Numerous splinters flying about. One big shell landed right on our road and we had to repair it.\n","240":" after Trinity. Sunday 7\n\nDay cloudy but no rain. Up at 4.30 and left at 5. and on to mono rail job. Worked uneventally till 12 and rode home on pontoons. Job likely to prove white elephant. Home via Warrington Road. German heavies very active shelling systematically everywhere and we had to gallop through a heavy barrage on Warrington Road near Bund. and things were fairly hot.\n\nCleaned up in afternoon and wrote up diary. Graham quite nice. \nHad to go to bed early as no candle.\n\n"}}