{"Document Name":{"0":"Diary_0503","1":"Diary_0503","2":"Diary_0503","3":"Diary_0503","4":"Diary_0503","5":"Diary_0503","6":"Diary_0503","7":"Diary_0503","8":"Diary_0503","9":"Diary_0503","10":"Diary_0503","11":"Diary_0503","12":"Diary_0503","13":"Diary_0503","14":"Diary_0503","15":"Diary_0503","16":"Diary_0503","17":"Diary_0503","18":"Diary_0503","19":"Diary_0503","20":"Diary_0503","21":"Diary_0503","22":"Diary_0503","23":"Diary_0503","24":"Diary_0503","25":"Diary_0503","26":"Diary_0503","27":"Diary_0503","28":"Diary_0503","29":"Diary_0503","30":"Diary_0503","31":"Diary_0503","32":"Diary_0503","33":"Diary_0503","34":"Diary_0503","35":"Diary_0503","36":"Diary_0503","37":"Diary_0503","38":"Diary_0503","39":"Diary_0503","40":"Diary_0503","41":"Diary_0503","42":"Diary_0503","43":"Diary_0503","44":"Diary_0503","45":"Diary_0503","46":"Diary_0503","47":"Diary_0503","48":"Diary_0503","49":"Diary_0503","50":"Diary_0503","51":"Diary_0503","52":"Diary_0503","53":"Diary_0503","54":"Diary_0503","55":"Diary_0503","56":"Diary_0503","57":"Diary_0503","58":"Diary_0503","59":"Diary_0503","60":"Diary_0503","61":"Diary_0503","62":"Diary_0503","63":"Diary_0503","64":"Diary_0503","65":"Diary_0503","66":"Diary_0503","67":"Diary_0503","68":"Diary_0503","69":"Diary_0503","70":"Diary_0503","71":"Diary_0503","72":"Diary_0503","73":"Diary_0503","74":"Diary_0503","75":"Diary_0503","76":"Diary_0503","77":"Diary_0503","78":"Diary_0503","79":"Diary_0503","80":"Diary_0503","81":"Diary_0503","82":"Diary_0503","83":"Diary_0503","84":"Diary_0503","85":"Diary_0503","86":"Diary_0503","87":"Diary_0503","88":"Diary_0503","89":"Diary_0503","90":"Diary_0503","91":"Diary_0503","92":"Diary_0503","93":"Diary_0503","94":"Diary_0503","95":"Diary_0503","96":"Diary_0503","97":"Diary_0503"},"Date":{"0":"unknown","1":2021.0,"2":2022.0,"3":2023.0,"4":2024.0,"5":2025.0,"6":2026.0,"7":2027.0,"8":2028.0,"9":2029.0,"10":2030.0,"11":2031.0,"12":2032.0,"13":2033.0,"14":2034.0,"15":2035.0,"16":2036.0,"17":2037.0,"18":2038.0,"19":2039.0,"20":2040.0,"21":2041.0,"22":2042.0,"23":2043.0,"24":2044.0,"25":2046.0,"26":2047.0,"27":2048.0,"28":2049.0,"29":2050.0,"30":2051.0,"31":2052.0,"32":2053.0,"33":2054.0,"34":2055.0,"35":2056.0,"36":2057.0,"37":2058.0,"38":2059.0,"39":2060.0,"40":2061.0,"41":2062.0,"42":2063.0,"43":2064.0,"44":2065.0,"45":2066.0,"46":2067.0,"47":2068.0,"48":2069.0,"49":2070.0,"50":2071.0,"51":2072.0,"52":2073.0,"53":2074.0,"54":2075.0,"55":2076.0,"56":2077.0,"57":2078.0,"58":2079.0,"59":2080.0,"60":2081.0,"61":2082.0,"62":2083.0,"63":2084.0,"64":2085.0,"65":2086.0,"66":2087.0,"67":2088.0,"68":2089.0,"69":2090.0,"70":2091.0,"71":2092.0,"72":2093.0,"73":2094.0,"74":2095.0,"75":2096.0,"76":2097.0,"77":2098.0,"78":2099.0,"79":2100.0,"80":2101.0,"81":2102.0,"82":2103.0,"83":2104.0,"84":2105.0,"85":2106.0,"86":2107.0,"87":2108.0,"88":2109.0,"89":2110.0,"90":2111.0,"91":2112.0,"92":2113.0,"93":2114.0,"94":2115.0,"95":2116.0,"96":2117.0,"97":2118.0},"Entry":{"0":"\n\n","1":" Sutton-Veny\n\nA hot day. Many men have applied for leave and there are many changes in the quota. Inspected the huts of No. 3 Company and noticed a great improvement in camp sanitation this morning. The Billjims had the usual number of more or less well grounded grouses on the matter of food. In the evening watched Gorman and others gambling at card roulette in the mess.\n","2":"\n\nA quiet idle day in camp and in the evening took a walk in the woods close to the camp.\n","3":"\n\nInspected lines. Roused up the camp Quartermaster and made some different arrangements about food question. Afternoon went with Major & Mrs Blanch to tennis and after mess went to an evening given by the nurses and passed the time very enjoyably until about 10.45.\n\n \n","4":" Sutton-Veny\n\nWarm. Inspected the huts of Hinchcliffe & Gorman’s companies and found the lines excellent. Afterwards tried about 12 men for various offences giving fairly light forfeitures of pay. In the afternoon went down to Group HQ and there found James awaiting Senator Pearce and Genl McNicoll. Went over to Greenhills about 4 with Gorman & Hinchcliffe and had afternoon tea. This place is a modern mansion and a centre of much amusement for the troops. There are croquet and tennis lawns as well as billiard rooms. The whole place is a hive of amusement and set down amid very fine grounds full of the finest trees now in full green leaf many arching overhead & roofing the avenues.\n","5":" Sutton-Veny\n\nWas well messed up by James about a trip by car to Tidworth. In the afternoon tead at Greenhills watched tennis and in the evening took a walk in the wood.\n","6":"\n\nA most unpleasant windy morning with dust was followed by some showers. In the evening the quota had a dance and VADs and a few nurses were there. In all about a hundred couples.\n","7":"\n\nHad expected to go to London for Investiture today but non-arrival of the necessary wire from the Lord Chamberlain postponed the trip. No. 38 Quota were paid today prior to their embarkation and it was amusing to see the schools of twoup players that at once commenced in their lines relieving the troops of their hard earned cash. Went to a cricket\n\n \n\n13\/6\/19 Sutton-Veny\n\nmatch this fine afternoon and then had tea at Greenhills. After dinner took a walk with Thewlis along quiet shaded leafy English lanes. Nestling back in one we found an old church, graveyard and an ivy covered rectory. Further on rising from a pool was an enormous shady tree of I know not what species and several tiny thatched cottages with the traditional rosebushes growing up outside them. The girls about are in most cases pretty and seem to be learning how to dress.\n","8":"\n\nAnother loafing day. Went to a Boxing Match in the afternoon and saw some good fights. In the evening took a walk with Capt L.H. Smith of the 2nd Tunnelers and went all through the wood which adjoins here. At 10.15 it was still broad daylight.\n\n \n","9":" Sutton-Veny\n\nSpent this quiet Sunday idling and walked with Pike in the evening.\n","10":"\n\nCaught a train before 10 at Warminster and in an hour had reached Salisbury – not a particularly large town. In shopping found the prices much below London ones. Many old buildings here. Turning down a side street went under an old gateway and stepped into quite another world. This was the Close of the Cathedral. Green lawns, high shady trees – a large expanse of trim open ground bordered with creeper covered houses. In the centre rises the Cathedral – not enormous not over ornamented but with a fine high plain spire. When you look close the pointed elaborate stone carving becomes evident. The big front doors were wide open and the whole interior flooded with air\n\n \n\n16\/6\/19 Sutton-Veny\n\nand bright sunlight – contrast to the sombreness and mustiness of many continental cathedrals. Old recumbent effigied tombs of crusaders and others and very fine brass and iron work on the choir railings. After coming out took a walk round the close and enjoyed the slightly distant view of the building. Caught a train back to Warminster at 1 and had tea at Sutton Veny Greenhills. After dinner went with Blanch to tennis and afterwards to No. 1 AGA and a long talk with Sr Donaldson.\n","11":"\n\nA boring monotonous day. Tried a few Orderly Room cases, had afternoon tea and watched some tennis for awhile in evening.\n","12":"\n\nDitto. Visited hospital in evening.\n","13":"\n\nIn afternoon the nurses came to afternoon tea and dinner and at night we had a fine & enjoyable dance.\n\n \n","14":" London\n\nUp early and caught the 8.19 train at Warminster station getting a lift in by an ambulance. It was wet and people welcomed the change after something very like a drought. The country all along looking very pretty. Reached Paddington at 11.30 & put up at GW2 Hotel. Then tubed into town and went to Horseferry Road and saw Coleman. To a Jew tailors for some medal ribbons – he and the girl who sewed them on talked in Yiddish. To the Grosvenor Hotel for lunch and then walked down to Belgrave Sq and saw Plant at the R & R HQ and found that perhaps we shall go home on the Wiltshire about 4th July. Came out near the gateway of Hyde Park and rode up to the Bank on the top of a bus. A rather wet ride but a good way to see London. Today the conditions were rather unique too\n\n \n\n20\/6\/19 London\n\nas we had a steady driving rain and low black clouds which made the thronged streets look like pitch. Back to Piccadilly and round Charing Cross doing some shopping. After dinner went in to town again and first of all to Covent Garden and then to Drury Lane. Saw Robert Lorraine as \"Cyrano de Bergerac\" a one-man show rather touching. The rain had kept a lot of people away and you could not call the house good by any means. Lorraine has a peculiar way of bowing when he takes the curtain. There were few people round Piccadilly and the Strand owing to the rain. There is something charming about the quiet old churches one runs up against sandwiched among the modern buildings. A good view from the Thames enbankment of London under rainy skies.\n\n \n","15":" London\n\nTo Old and New Bond streets and went to Chappell & Co’s famous music shop and then down Bond St where abound. Several sharp showers. Round the Strand did some more shopping and then went back by tube to GW2 Hotel Paddington for lunch. At 2 pm went up to the British Museum where, unfortunately, the Egyptian rooms were not yet open but I saw the Rosetta Stone, the Elgin marbles and other Praxitiles work and the famous Portland Vase. Particularly interesting were many old Roman paintings much like those in the Naples Museum and a lot of Roman and Greek jewellery – some well made. Took bus down to Trafalgar Sq. where workmen and firemen were putting long ladders up the Nelson Column in connection with the War Loan. The two fountains were \n\n \n\n21\/6\/19 London\n\nfull of kiddies paddling in the basins and sailing boats & pieces of wood. Crowds of Anzacs and other soldiers with their girls sitting round on the stone balustrades. Went into the National Gallery here – not all open yet – and saw many masterpieces. Pictures by Turner, Whistler, Gainsborough, Van Dyck, Rubens, Velasquez, Titian and many others. Then came home for a rest and a siesta. At 7.30 went in to the Globe Theatre and saw Marie Lohr in \"L’Aiglon\" – fine play very well performed and all centreing on her. An exhausting and heavy part. Then went down to the Trocadero and had pea soup, an omelette and ice with squash for supper for 5\/2 – reasonable considering the chicness of the place. A jazz band worth watching. Had an interesting talk with an American who was in a German Lancers Regt until about 20 and then visited Berlin in 1919 – a decent chap.\n\n \n","16":" London\n\nA very fine morning. Rose late and went to Hyde Park very crowded and gay. Rotten Row had a good company of riders though what they can see in trotting up and down like public performers before multitudes of people I cannot understand. Met 2 Australian sisters from Salonica and walked up and down talking with them until 1 o'c when I tubed back to Paddington and had lunch. Then caught the 2.40 express which reached Westbury in a splendid non-stop run at 5 pm the engine picking up water as it rushed along out of long troughs beside the rails. The countryside was looking very verdant after the rain. Settled down on arrival to a quiet evening in camp.\n\n \n","17":" \nLondon\n Sutton-Veny\n\nOffice in the morning. Wrote all the afternoon and walked out in the evening – through woods along green winding lanes passing little thatched houses creepered and flowers surrounded.\n","18":"\n\nAfternoon went to Bath with Davis by train and between Westbury and Bath at this season the scenery is just about as beautiful as typical English scenery can be. The town is a fine prosperous one in appearance but round the station old dingy dwellings of a poor type spoil the general appearance of the place in a way that would not be tolerated in progressive Wiesbaden. Had a look at the Abbey exterior with its peculiar angels standing on their heads descending stone Jacob’s ladders. Via the pumproom up to the main street where I had a photograph\n\n \n\n24\/6\/19 Bath. Sutton-Veny\n\ntaken. Then with Davis to the house of a Dr Scales where we had tea with the family. A good view from here of wooded gentle uplands all hedge intersected. Round the Bath streets are many invalids and peculiar old bathchairs drawn by individuals quite as odd in appearance. Some of these chairs are even carried to the expense of having glass covered in front and look like mummy coffins as they are pulled along. As a \"bad\" I don’t think Bath is in the same street as Wiesbaden. Caught the 6.30 train back to Sutton Veny flying out from Warminster in one of the many cars plying for hire. Missed dinner but the mess cook knocked up an A1 omelette. Found a few things to do before bed. \n","19":" Sutton-Veny\n\nHad a rather tempestuous morning. Blew up the O.O. for not attending men’s morning meal and then told the OM off so strongly that he later delivered an ultimatum. Duncan was ordered off today suddenly so I got the Staff Captains and gave him a proper doing too.\n","20":"\n\nUneventful. Some nurses came and played tennis and danced afterwards.\n","21":"\n\nWent to Bath by a train at 10.58 and there saw about some photographs. Only stayed in the town for half an hour and then caught an express to London. The journey between Warminster and Westbury is uninteresting but between Westbury and Bath and Bath and Swindon there is some of the prettiest scenery I have seen in England. Reached \n\n27\/6\/19 London\n\nPaddington at 3.30 and tubed at once to Piccadilly where I booked a room at the Jermyn Court Hotel. From here tubed down to Victoria and Walked to Belgrave Square where I found that my ship sails on the 15th and is the Chemnitz. Saw Plant and Norman both came out at Hyde Park Corner and so returned to the Mecca of Piccadilly. Took a walk up the Strand and bought some medal miniatures and then went to Trafalgar Sqre. Nelson has enormous ladders leading up to him and the whole place is decked out like a fete with booths for war bond sales. In the evening went to Covent Garden there to see the Barber of Seville. A barn of an opera house. Returned to Jermyn Court Hotel and was asleep by midnight.\n","22":" London\n\nAfter breakfast tubed up to the Bank and drew some money and then hurried back to Piccadilly and took a taxi to Buckingham Palace. Went into a reception room there and found myself drafted in among many generals and a few other colonels. Colonel Frybery VQM GDSO two bars was also there. Flunkeys stuck small hooks on our coats and the sound of \"Gorsave\" from outside announced that George was on the dais. There were three VCs and these filed ahead first. I was about twentieth and stepped up to Geo. wearing the slouch hat and getting quite an ovation from the crowd who were seated on chairs listening to a Guard’s band playing. The King is small\n\n28\/6\/19 London\n\nthin and miserable looking & has a very red nose. Leaving the dais I was seized by other flunkies who took my decorations & clapped them in as many small boxes. I left the precinct at once and had some lunch. At 2 o’c went to Covent Garden to see \"La Boheme\". Thomas Burke sang very well in Italian but Mimi used English throughout. Coming out the cries of news vendors \"Piper! Piper!\" Peace signed!!\" Coming out into the Strand there were crowds about, many flags little gay gangs walking up & down and every sign of a very merry night here if it does not rain. Went down to Grosvenor Hotel then back to the Strand where pandemonium was raging. Crowds \n\n28\/6\/19 London\n\nof youths half tight dancing. All hotels very busy and pots being passed out along lines of waiting girls and women. Trafalgar Sq. was absolutely packed and fireworks and singing crowds abounded. Reached Leicester Sq. by going along side streets and so to Piccadilly. Here girls were carrying \"ticklers\" – long brushes and thrust them into the faces of passersby. Confetti was thrown and and gangs of men and women from all grades of society were dancing freely. The crowd swayed senselessly backwards & forwards the air full of the sounds of squeakers and rattles. A raging happy and well ordered rabble. Girls all free and easy and all talking to strangers. This all kept going till after midnight when I turned in.\n","23":" London\n\nBreakfasted late and then went to Hyde Park and watched the riders on Rotten Row. A very gay crowd. Dined at Jermyn Court. Caught the 2.40 back to Camp and spent the evening at the hospital.\n","24":"\n\nSpent a rather busy morning at the office dealing with a lot of matters and received orders to go to Hull tomorrow evening. Went down and saw the General, wrote an Order of the Day for the troops and then commenced packing up. Afternoon tea at Greenhills and then caught the 5.30 train to London arriving there 8.15. Put up at the Great Western at Paddington and dined there. Went into Piccadilly and afterwards had a trip out of Warwick beyond Paddington. Met a friend from Whitechapel. Bed 1.30 am.\n","25":" London\n\nA busy day. Went up to the Bank but found it closed owning to a general holiday for balance purposes. Mr Blogg retired from the service yesterday – Mr Jeans was there but I deemed it wise not to bother him on Balance Day. Went to Belgrave Square on top of a bus and there got orders from Plant. To the Grosvenor Hotel for lunch. Meeting of the Red Cross – off to Berlin. Then to R & P HQ and saw Generals Monash Wisdom and – the later gave me orders. Then to Horseferry Road to arrange other details. Had an early tea at the Great Western Paddington and went by tube to King’s Cross catching a train for Hull. Our journey was a good one and in Lincolnshire and Yorkshire we passed through\n\n \n\n1\/7\/19 London\n\nmuch farming and agricultural land. Very flat. Reached Hull about 11 and used motor transport to get down to the boat transporting our drunks in a box car. The \"Chemnitz\" is a vessel of 8000 tons and had been used by the Huns for transport work in the Baltic. The reek of new paint is over all. The men were soon stowed away on a troop deck (our advance parties were more than 100 in total and issued with a blanket apiece and some tea and food. Afterwards the officers had some too and then all turned in between white clean sheets which are luxurious after hairy and blankets. Crowds of painters carpenters and others busy on the fitting out of the ship.\n\n \n","26":" H.T. \"Chemnitz\" Hull.\n\nThoroughly explored the ship during the morning and allotted the accommodation. Crowds of carpenters caulkers busy and much gear coming aboard. Many other ships also lying in these docks. Gave all the men leave after lunch. Had tea and then went up into Hull myself – the quarter round the quays is dirty and squalid. The people in the trams poorly clothed and dirty. Many youngsters barefooted. Some fine shops but generally the city seems uninteresting and dull. Had dinner up the town but it came on to rain so I returned early to the ship and put in a quiet evening. Steady rain falling. Our departure from here is not yet fixed probably the day after tomorrow.\n\n \n","27":" \"Chemnitz\" Hull\n\nA quiet day aboard the ship. I had a talk to Captn Young, the Master, and arranged some things with him. Reid the elderly Chief Officer is a character and there is also a pilot aboard. The ship began to look a bit more trim by noon and was inspected by the Admiralty surveyor and others. Afternoon I went up the town and did some shopping. Hull had a half holiday today and the city was deader than ever. A slummy place and wretched type of people. Going to sea builds up their bodies a bit and makes up for wretched houses. A good deal of eating to do here but the sea air and smell of wet paint send up ones appetite. Other ships with lesser crews are alongside.\n\n \n","28":" \"Chemnitz\" Hull\n\nFiner day. Expect to sail tomorrow morning and sent McLean out to arrange billeting the troops in the decks. Went into Hull which was very busy and animated today and did some shopping. In the square there is a statue to Wilberforce who holds a scroll of papers in his hand. Viewed from one aspect this gives the statue a ludicrously obscene look – on a wet day something 1000 times worse than the Brussels mannequins. This is a C3 population all right – poor rickety kids anaemic girls and mutilated men – arms legs & fingers missing. Wretched slummy dwellings. After dinner round the docks and saw a coaling machine at work tipping whole trucks of coal into chutes to the bunkers.\n\n \n","29":" \"Chemnitz\" North Sea\n\nAt 9.30 we cast off from Alexandra Docks Hull and a pilot took us into a lock after some very skilful handling. The wives of some of the stokers were down to see their husbands off as it will probably be nearly six months before the crews are back here again. Wives babies and mother in laws respectable clean people. Out in the Humber we passed several wicked looking monitors and a couple of cruisers – one was dazzle painted. Afterwards a cold wind made us keep in and the ship though rolling a bit was remarkably steady and there was no vibration. One hardly knew that she was moving at all. Our pilot for the Down was playing cards all the evening with Miles & Co. I talked to Pederick.\n","30":" \"Chemnitz\"\n\nMorning found us off Dover with its white chalk cliffs. A steady sea running and a dull sky. We voyaged along steadily all day passing other craft at intervals. McLean was busy drawing up orders for the ship and Miles and Galway each as energetic in their own department. A confined cramped space on a ship and one very soon tires of it.\n\n7\\7\\19\n\nFound ourselves coming into Plymouth Sound at breakfast time passing training ships and moored destroyers and other men o’ war. Tied up at the wharf opposite several cruisers which were in the docker’s hands. Ugly squat craft \"Tenneraire\"& \"Collosus\" with large guns. Sent someone off up the pier to \n\n \n","31":" \"Chemnitz\" – Devonport\n\nsee the Embarkation Staff and at 10.00 Captn Harrison & Grose and Commdr Hewitt RN came aboard. Went all over the ship with them and at 11 am the train arrived with 500 of the troops aboard. They were soon stowed away in their decks and given lunch. A second lot came at 3 amid rain and then some more at 5. The latter included 40 released prisoners from Lewes gaol of whom 6 were in close arrest and forthwith put into the cells behind iron bars. Great bustle and excitement all day and further inspections with an imposing train. In the evening most of the troops turned in early being tired out with their long journey. The Prince Ludwig alongside and the Freidricksran (taking Hughes tomorrow) also close.\n","32":" \"Chemnitz\" – Devonport\n\nA fine bright day. At 9 am we pushed off from the pier and went out to a buoy. Crowds of seagulls covering the water here. The men’s breakfast this morning was bad probably owning to the ship’s cooks being unused to doing for large numbers. I made a very cursory inspection of the ship and found things settling down into shape. After lunch all men assembled at their boat stations wearing their life belts. In the evening I gave an address to all the officers on their duties and then met General Nisdown who had come aboard and wanted to see a troop deck. Went round with him and the Master Captain Young. By 10 pm most men were well settled down in their decks.\n","33":" \"Chemnitz\" Devonport\n\na lovely sunny day. Got up early. At 8.30 a brig came alongside and turned us round after which a pilot took us out. We passed Plymouth. a fine esplanade with a good statue of Drake and another in memory of the Armada’s defeat. The old Eddystone lighthouse has been re-erected on this place as an ornament. Passing several warships the crews stood to and manned the rigging giving us cheers which we returned. Quite a number of old wooden wall three deckers are moored here being used now for training ships. The Freidricksran carrying some families, nurses & about 1000 troops was lying in the channel waiting for Billy Hughes to come off in a launch. The harbour here is a pretty one, the wood clad slopes of Cornwall coming down\n\n9\/7\/19 Chemnitz – Devonport\n\nto the water on one side and the houses of Plymouth, Southport or Devonport covering the Devon side. Nestling in among some old trees is the old house of Lord Mount Stephen. Our pilot brought us out a very winding path and we passed several ungainly monitors manned in our honour. A \"U\" boat (86) with English submarine experts on board was doing a fast trip steaming past us and giving up her secrets to Naval engineers. From the open sea before reaching the breakwater one could get a splendid view of the three Devon cities. Steering well out to sea we soon left England behind and the famous Eddystone lighthouse came into sight perched on a small rock – lonely in the middle of the sea. I carried out an inspection and went through all the deck finding that this \n\n9\/7\/19 Chemnitz\n\nmorning’s breakfast was not too good due to green crew. In the afternoon we ran into a heavy fog and could only progress by half speed with great whistle blowing. A swell came on about 4 and a few retired but by dinner conditions were much quieter. The matter of cooks here is a rather difficult one to fix and I see that we shall have to pay the chaps we have on duty on the way back. In the evening all the boys got up on the awning deck with a piano and had a good singsong. Passing my window I recognized Freddy Higgins a Sergt of the Pay Department – sometime of the YBs a subaltern then later spoke to him. W. Neelands came in for a talk during the evening. On the awning deck a piano was playing till late and all joined in an impromptu concert.\n","34":" Chemnitz Bay of Biscay\n\nInspected the ship with Capt. Young and found things fairly good the meals better and all fairly satisfied. The Bay of Biscay was calm enough today and I don’t think that thus far anyone has been ill. Our R.C. padre (Padre Fox) is a good chap and a fine versatile conversationalist. Sports material was distributed today and much used. The Band played in the evening and then a dance was held in the dark to piano tune. A white horsed sea making boat toss a bit tonight. We are miles out from land as far as the eye can see is a tossing waste of waters. Some men stand watching it for hours – it is like watching the leaping flames of a fire. The waves are everchanging as they dash on.\n","35":" Chemnitz\n\nSpent the morning walking round talking to different men specially two very fine L.H. chaps from Egypt. Inspected the forward galley which is so terrifically hot that men can hardly bear the heat inside. The sea fairly calm but plenty of white crests – we noticed several sea gulls – the first birds since leaving England. In the afternoon we had deck cricket going and some boxing bouts and my very pugilistic friend Walker presented one with his photograph. Jazz band and concert party practicing and dancing and singing on the decks. An artilleryman weighed his issue today and found the bread to be 16 oz weight per loaf. The night much warmer and a lot of chaps came on deck to sleep.\n","36":" Chemnitz\n\nWarm and sultry. We are off the Straits of Gibraltar and passed two large steamers one of which was evidently coming out of the Mediterranean. Inspected the troop decks. They were all splendid and some of the chaps had put great efforts into their ornamentation. It would have done a housewife’s heart good to see them. The clink birds are still occupying their cells and one has a baptismal card up on his wall. \"One Faith, one Hope, one Baptism!\" About noon went up on to the f’castle head and looked over at the deep violet sea being ploughed back. In the evening on an improvised stage our concert party, all dressed in period costumes, gave a good concert. I had a good yarn with Capt. Young afterwards mainly about his trooping experiences.\n","37":" Chemnitz\n\nSunday and a hot one. We are going through a deep blue sea its wave crests dancing in a bright sun. Padres Fox and Ash held church parades – the latter I attended feeling rather queer before it was finished. Retired to bed before lunch and went back again after. It was hot enough today for the wear of light tunic. Several other officers down with sore throats. The S.M.O Marshall operated on a chap this afternoon. He had poisoned his foot through rubbing crude winch oil into a cut. On the promenade deck after dinner had a talk to Capt. Young. The British seafaring man is a fine product very different to their effeminate landsmen. In bed at 7 and called in Dr. Marshall. Temperature 102 and feeling very ill.\n","38":" Chemnitz\n\nFine and warm. Still unwell. Hard on the starboard bow – the Cap Verde islands. There was some haze which spoilt the view but they seem hilly and white villages are planted on the steep hillsides. After running along the coast for some time we passed a very high peak – which seemed to be the termination of a chain. I take this to be Teneriffe. It went up high like a large cloud and remained in sight until we were many miles away from it. On this deck the men play games and sing – some of the tunes they sing over and over again. One is \"How can you keep them down on the farm after they’ve seen Paree\". Rather pertinent. Our consumption of fresh water is still much too high.\n","39":" Chemnitz\n\nOff Africa. In bed sick.\n","40":" \" \" \"\n","41":"\n\nDoctor diagnoses complaint as influenza and I feel rotten. We are about in line with the Gulf of Guinea and weather is hot. Things are going just like a camp on the boat – all are settled down now and the ship churns away out of sight of land. Sea like a smooth lake. Tonight Diggers Parliament. Padre Fox advocates Prohibition and Ash opposes.\n","42":"\n\nReceived small wireless budget today. A fine cool breeze though we are not far from Sierra Leone. Feeling heady and sleepy but much better. This afternoon a meeting of a Farmers Convention. Tonight for the first time the Southern Cross came into sight but I, being in bed, did not see it.\n","43":" Chemnitz\n\nStill in bed. It keeps hot and we should go over the Equator tonight. A concert was held for the troops.\n","44":" Crossed Equator today – a pleasant day which after dark (6 pm) became decidedly cold and the equatorial temperature called for a blanket in bunk. flying fish today. Sunday.\n","45":" Got up and feel weak but it was good to go out on deck and see the miles of blue sparkling Equatorial sea. The Atlantic runs in long rollers and though the sea was calm and no white horses yet one could see the steady underlaying breakers coming along. It was dark at 6 pm and then Padre Fox gave a lecture on the South Sea Islands. A dark cool night with bright stars. No doubt the Southern Cross is on view but I could not find it.\n","46":" Chemnitz\n\nA duller day with a cool head wind and a fresh sea. Towards evening the water got as choppy as we have had it yet. For the officers there are tournaments in dominoes quoits. For the men the same as well as cards and the band playing. Quite a number of the officers are off color with bad throats. Long grey rolling seas in the evening and sometimes a school of bonitos. Bed 8 pm.\n","47":"\n\nA dull windy cool day. Rose at noon. a bunch of fine bad characters have meeting place outside my cabin window and sitting on the deck regale me with their crimson language – unconscious of being heard. There are useful titbits of news gleaned this way. Dancing on the promenade deck until 9.\n","48":" Chemnitz\n\nA dull blowy but warm day. About the latitude of St Helena and we get a good daily budget of wireless from Ascension. Eve on promenade deck the Diggers Parliament met and discussed White Australia some good speeches. Today a whale was seen spouting by some.\n","49":" Received a wireless from Cape Town that we can grant leave there. A windy dull day. After lunch there was a kit inspection but it received by 2 Coys who went on strike & gave them to understand I did not care a -------- if they paraded or not so the thing fell flat and I secured my ends by putting them on their honor to hand in their surplus gear which they did. The less men have to do the less they want to.\n","50":" Chemnitz\n\nA rolling pitching sea today. Rose for lunch and then sent a wireless to Troops Capetown. Our run yesterday was only 240 miles owing to current and hard sea. It got very rough towards evening and the fiddles had to be put on the dinner table. Followed an excellent concert by the Concert party though some of them had been feeling a bit seasick.\n","51":"\n","52":"\n\nDid an inspection of the whole ship this morning when the porridge and potatoes were the chief grouse. Also visited the hospital.\n","53":"\n\nFine and breezy. Washing day. The whole ship like one big clothes horse covered with all sorts of washing. Pay too today and in the afternoon sports. Yarning with Capt Young until dinner time.\n","54":" Chemnitz\n\nDid the rounds of the ship which is full of active gambling schools – House, Crown & Anchor and Twoup because yesterday was pay day. One of our clink birds put the acid on me for exercise. The sea very smooth and oily and totally without white horses. After lunch it became very red and appeared full of scum like fish spawn. Chief officer says this is \"whale food\". After dark we passed several flashing lights from South African light houses and before dawn came to a standstill just outside Cape Town breakwater.\n","55":"\n\nEntered the breakwater and anchored early an enterprising paradox passing aboard a \"Cape Times\" together with his business cards. A medical officer & customs man came off as we had the \n\n31\/7\/19 Cape Town\n\nyellow flag flying. Behind a breakwater was snuggled quite a lot of shipping. The dominating feature of Table Bay is the Table Mountain which towers over the bay and was mantled in a thick white fog or tablecloth. The craggy sides of the mountain are bare and rocky like les Alpes Maritimes. The town fringes the bay and further East rise two other mountains or hills less high and craggy. One is called the Lion and a good stretch of imagination will make one fancy a likeness. The \"Boorara\" with 49 Quota aboard pulled out out 10. A Dutch port doctor came aboard and gave us a clear bill of health & a dismal account of what a time they had with ‘flu here. 12 ½ % of the population died. Dead carts no coffins & later in\n\n31\/7\/19 Cape Town\n\nthe morning the AIF Staff Officer and a doctor came off and told us that we could not land owing to influenza on board. This was not true and I knew that the reason was that no berthing was available. But it would never do to tell the troops this or they would want to be sent off in boats. So we said the ship was in quarantine. Galway, our very good sports officer and one of the men were put off in order to go to local hospitals for operations. They were slung over the side on stretchers. It is an exquisite fresh sunny day today and we are at anchor about 1 ½ mile out from the town which lines the shores of the bay. It is a good day for visibility and one can read the ship sights. All\n\n31\/7\/19 Cape Town\n\nshops are closed today (Saturday) and until Tuesday next for the Peace holidays. One can now see Table Mountain perfectly with its craggy sides partially tree covered. Directly behind the Town Hall embowered in trees are what appear to be the best and most chic local residences. This view is not unlike Australia. About 2 pm came off a barge of niggers and coal and commenced the slow business of coaling by means of handfilling sacks and then hoisting above by winches. The Capt. Expects to sail for Durban before noon tomorrow. On the opposite to the one on which we are being coaled there is a big launch busy pumping water into our tanks. The troops cooped up aboard\n\n31\/7\/19 Cape Town\n\nspent the afternoon watching the niggers and gambling. The evening shades on Table Mountain were specially beautiful, a white cloud cascading down part of the slopes like a waterfall. Later only a small lot of cloud rested on the mountain and a good idea of its \"Table\" formation could be obtained. After dark the view of Capetown by night was memorable. The shore was a mass of bright twinkling lights spangling the rising slopes and much resembling the Bay of Naples by night. The concert party tonight gave an excellent program of music and songs. Just as I was sitting down to supper after it a deputation from all troop decks headed by one Finn put in an appearance\n\n31\/7\/19 Cape Town\n\nand demanded leave or they would take possession of the ship boats. We called down the Captain and got his assurance that we leave tomorrow at 11 but the troops were not satisfied. Accordingly I reported their demands and intentions to Shore Authorities and asked for a launch to come and take off Smythe and a couple of men. During this conference angry faces surrounded the cabin windows and crowds were gathered on the decks to be subsequently harangued by their delegates. Up until a late hour no reply was forthcoming to our request for a launch and nearly everyone turned in for a sleep. The balance of the night was quiet and slept until 7 am.\n","56":" Cape Town\n\nFirst thing about 20 men broke ship and went ashore on a lighter. Niggers arrived alongside to coal the ship but were stopped and intimidated by some of our malcontents. I could have got the job done as I addressed all the troops at both ends of the ship and soundly rated the gaol bird element. However an order came off shore for coaling to cease and then another ordering us to come in alongside. A pilot came out and took us in at 11 am and we berthed opposite a British cruiser and near the Prinz Ludwig. The Cap Polonia 22 000 tons was also in. the Staff Officer came aboard and we discovered that the Port doctor yesterday signed our clearances on the ship yet went off and told shore authorities\n\n1\/8\/19 Cape Town\n\nthat we were in quarantine, a misrepresentation which has led to all the trouble. The troops were given general leave and I went up to the Castle by car. Once away from the Docks Cape Town reveals itself as a town and not a city. It is nothing like as big as I expected and resembles a big Australian provincial town. Plenty of gums heighten the resemblances. Ugly niggers abound. Through the main street to the Castle a peculiar sort of half Citadel half barracks place where I saw \n of \n a full Colonel – a funny old South African bird and officially complained about their blundering yesterday. From here to see General Ravenshaw the G.O.C. at Mt Nelson hotel.\n\n1\/8\/19 Cape Town\n\nTo get here we passed through some fine residential streets. The hotel is well situated & has good grounds and in the lounge were many foreigners – Dutch, Italians, French. This hotel was famous during the S.A. War and was cleared out by Kitchener who stripped all hangers on there back to England on one occasion. Saw General Ravenshaw who was in mufti & about to go out golfing. Though at first brusque and disinclined to talk I pressed him enough to induce him to talk for half an hour and complained about the port authorities messing us up. From here through quiet streets to the boat. No trams at all on account of a strike make the town look\n\n1\/8\/19 Cape Town\n\neven more dead than before. Stayed on the boat until after dinner and then with the Master took a cab up the town. All decorated for peace celebrations tomorrow and at the Standard Bank of South Africa a stand erected to view the procession. Some fine well stocked shops. Saw a fair performance of Peter Pan at the Opera House and then went to \"Maximes\" for supper. Comment here on the cheapness of meals. If it were not for the impressive and unusual Table Mountain I should feel inclined to say that Cape Town would be a dull and ugly place. The natives are poor weedy wretched looking folk.\n","57":" Cape Town\n\nDelay in getting a\nships\n pilot made us stay alongside till 9. Several sharp squalls came up. As soon as we got out past the breakwater she started to pitch heavily but happily no rolling. Some of the local people flashing little mirrors from their houses by way of greeting. This used once to be very prevalent here and many houses doing it made a novel and pretty sight. As we got well off shore the boat rolled so heavily that things were sliding from one side of the ship to the other. I had to go to bed sea sick at 10 am and stayed there all day. The mess decks were crowded with sick men. At times the ship rolled to an angle of 30° and we felt it all the more coming straight from port.\n","58":" - \nCape Town\n Chemnitz\n\nMuch smoother but all the same too rough for church parades. Cold. We left 20 absentees at Cape Town. Carried out an inspection of the whole ship and found too many men down below in the decks. A following sea this afternoon and the wind drives showers of spray all over the ship. A dull night.\n","59":"\n\nRain thrashing gray low waves this morning and on our port bow low land with breakers. Nothing exciting to record. In the evening taxation of bachelors provided a theme for the Diggers Parliament.\n\n6\/8\/19\n\nLovely sunny day with blue dancing white capped waves. After our Cape Town 12 hours ashore the doctor washed out 43 men. Today is one of the S.A. Union Peace holidays. The land in sight Natal\n","60":" Chemnitz\n\nis low light brown rather barren in appearance. A few woods & scattered houses. Just before lunch a pilot came out from behind the breakwater and took us right alongside the Durban pier. Coming in – to the right is a low wooded slope covered with the houses of the residential suburb of Bevia. On the left another wooded cliff. Entering a fine harbour shows itself very pretty. All the ships in were dressed in honour of the peace celebrations. Plenty of cranes for handling coal – this and the plenitude of cheap labour makes Durban renowned as a coaling station. Embarkation officer came aboard soon and all the troops were left off on leave. Went off myself and was at once struck with the rickshaw boys fine tall muscular Zulus 1-2 with head\n\n5\/8\/19 Durban\n\ndresses of bullocks horns and feathers their calves painted white. Arrived up the town – we dismissed the rickshaw man and went down to the fine esplanade and promenade where great rollers came in and where a dangerous current run out. Crowds of well dressed people were here and mingling with them were all sorts of blacks Hindus and Kaffirs. At the end of the esplanade were many side shows one was a Bodyless woman – a girl with no body apparently who spoke to us. Done by her lying on a plank and then padding a bodice to complete the illusion. White dresses and white blouses here. Plenty of open verandahs and alcoves – local architecture. The main square centres a fine business quarter the Town\n\n5\/8\/19 Durban\n\nHall and Municipal buildings are really fine and were all draped and decorated for the Peace celebrations. The shops and general lay out of this place beat Cape Town own out of sight. We went to the Royal Hotel near the main square and sat down for a while until S.M.O. & Padre Fox came along. Dined with them at Hotel being waited on by coolie Hindu waiters. Processions sent us down towards to the beach again where were gay crowds, confetti and plenty of fireworks. Talk of a trip to Pietermaritzburg if the trains suit. We took a rickshaw back to the boat. Billy Hughes and Freidericsruh are here and the Durban Castle also. Bed 10.3.\n","61":" Durban\n\nA lovely fine summery day. Went up the town and found it very busy after yesterday’s celebrations. Rode in a rickshaw drawn by a nigger who leant well back and made it propel him. Some women about wearing long pumpkin shaped masses of hair – fine sturdy brown women like men in physique. The type of nigger seen here is a very fine type. In the afternoon with the doctor had afternoon tea at the Royal and then back to the ship once more. After dinner with Smythe to the Club going by one of their excellent trams and then down to the Beach where we heard our Concert party playing to a small audience in the YMCA hall. Pay (half) on Friday morning – will the troops abuse this privilege.\n","62":" Durban\n\nFine and warm. The \"Persic\" and \"Indarra\" both arrived this morning. The \"Fras oz Montes\" a Portugese steamer full of Hun deportees also here. Niggers busily loading up the Clan cargo ship alongside us. Only the officers on these steamers are white. All the men (even the quartermasters) are black. The black wharf labourers work well and are not childish idlers like the Gypsies. From these quays good trams run up to the main part of Durban (about a mile). En route are any amount of Indian (Hindu) women. They wear gold plaques in their noses and carry many bangles and other jewellery. The men all white clad turbaned (or fezzed) and silent footed. Many like the Egyptians wear a kind of \n\n7\/8\/19 Durban\n\nlong overcoat over their native robes. As far as the local native are concerned – the average wharf labouring man is a weed but the Zulu type (the rickshaw men and others) are fine well built chaps about 5’10\" or 11\" on the average lithe and agile. No wonder they are good fighters. Rarely one sees the wax head ring. The heads of hair of some Kaffirs are done with oil I think and made into many little curls or twists. Some carry big things in their ears. The women are fine hefty specimens. Stayed aboard until late afternoon & then went to afternoon tea at the Royal Hotel. Remark that there seems to be more fat white women here than elsewhere. In some cases it seems almost a \n\n7\/8\/19 Durban\n\ndisease. Is this due to having so much work done by nigger servants. Went down to Lords Cricket Ground and saw a team from our Ship play a Durban team. A fine ground. Coming back to the boat passed the scores of people returning from work – a polyglot lot. In one place a little piece of India – two women cross legged sitting nursing their babies. Nostrils pierced to hold gold ornaments. Perhaps we shall not get away until Tuesday owing to coal shortage. Remained on the ship all the evening and had a bath turning in early to sleep. Round the wharves there are always scurrying crowds of flitting natives going from nowhere to the same place.\n","63":" Durban\n\nIssued a half pay to the troops today. Many cases of petty thieving going on. We expect to move into a new berth today and coal getting away on Sunday morning all being well. A hot muggy steamy day today. After lunch our boat had berthed in a fresh place alongside a train full of coal. With Dr Marshall went up the town to meet Padre Fox. Then had afternoon tea on one of the alcove verandah places so suitable to this climate. We now went down to the native markets – a most interesting place. Passed many Indian shops where crosslegged tailors & bootmakers were at work and where there were tawdry jewellers shops full of their brass ornaments. Near the markets there is a mosque into which we looked like a\n\n8\/8\/19 Durban\n\nhall carpeted. Two seated men praying. Entering the native markets we found booths with all sorts of goods for sale and I bought a round little box. The old doctor sat on the ground and had boxes of all sorts of herb remedies. Men and sturdy looking women consulted them. Rows of stalls with meat cakes sweetmeats re for sale. Betel leaves and lime also popular. The star sight was the Zulu rickshawmen’s canteen. Behind iron bars in a large shed are tables. These were crowded with the Zulus. All over 6 feet wearing only white ornamental shifts their heads crowned with spreading bulls horns and feathers all talking at top voice and gesticulating. They looked like a lot of beasts. We dined at Twines after going\n\n8\/8\/19 Durban\n\nfirst to the Club and then went to the Beach and heard a Green Diamonds Concert. Back to the ship by rickshaw the drawers clucking and whistling in their peculiar way. Coaling in full swing. Crowds of niggers running up the gangways with their coal baskets and disappearing into the bowels of the ship.\n","64":" At Orderly Room handed out 28 days detention to as evil a man as ever came before me. Only a bayonet close enough to him kept him in check. Coaling still busily proceeding. At 10 am left for the railway station where we booked to Amanzantoti and left at 11. We soon ran out into open undulating country covered with low grass and some low busy jungle. It was much\n\n9\/8\/19 Durban\n\nlike Australia with its dull brown monotone colour. We passed many little stations each with its crowd of Kaffirs and quota of Indians. The farm houses just like ours at home. We passed extensive fields of sugar cane – passing natives were chewing sticks of it. Reached Amanzantoti at lunch time and went down to the fine beach where long rollers of the Indian Ocean come sweeping in. After dining set off on an exploration tour. All the land round here is a native reserve and we crossed dry grass, low hills until we came to some of the low beehive like kraals. Inside they have hard earth floors and a fire in the middle – no chimney. After one’s eyes get used to the darkness inside\n\n9\/8\/19 Durban\n\nthere are a few household utensils to be seen and the whole of the family sitting round in varying stages of dirt & nakedness. There is usually a baby or two. The children are all stark naked and have pop bellies all swollen out through stuffing themselves with mealies. The women are unkempt and dirty, their breasts flopping about. Usually they hid these with a blanket but one woman threw her blanket away & posed for a photograph for 1\/ and would have disrobed entirely for 2\/6. Generally they showed a good idea of the value of money. Saw an old man with heart & kidney disease lying in a hut of his own sick. The women carry the babies on their backs where the kids sleep comfortably. Most natives seem to have a couple of wives however poor they seem.\n\n9\/8\/19 Durban\n\nMy impression is that civilization must be good for these people as their native condition is little above that of brutes. Civilization, however bad, could hardly still further debase them. At 4.30 we caught a train back once more noticing the jungle, some monkeys in the trees and the sugar cane plantations. In general the dull colour of the landscape is much like Australia. Visited the fine Durban Club and then dined and wined at Twines Hotel. The shops along Durban streets are verandahed in Aust. Fashion. Visited native markets again and found them all closed. The mosque lit up tonight. Coaling still in full swing at the boat but no sailing till Monday.\n","65":" Durban\n\nThe Orsova came in early with women and families and anchored in the stream. At 10.15 with the Captain (Young), Padre Fox, Dr Marshall Gorman & Hayes took rickshaws to the Emmanuel R.C. Cathedral and we were admitted with the Mayor of Durban to the Bishop’s House. There were many priests robbing. We all passed into the church to the seats of honour reserved for us. Not a very large cathedral, new and plain. Pontifical High Mass in honour of the Jubilee of the Bishop of Natal was celebrated. The music was Gounod’s Messe Solonelle. The Bishop of Port Elizabeth was the preacher. It was a rarely good service and the fine music & rich vestments added to its sensuous appeal. Reached the ship about 1.30 for lunch. Close to the docks is a whaling station.\n\n10\/8\/19 Durban\n\nI saw a big whale on a train being taken along to be cut up. White bellied and several times the size of the locomotive. Stayed on board nearly all the afternoon as it was wet. At 7 pm went by motor launch over to the \"Orsova\" which was anchored in the stream. She is a fine boat with splendid decks and fitted up luxuriously. Meet Mrs Corney and others – mostly nice girls. Also met some of our Sisters and the cattiness between both parties is really rather funny to watch. Generals Tivey, Burgess and Griffiths were also on board. Crowds of wives, brides and babies. After leaving one got a small idea of what a floating hotel a big passenger ship like this is. Some of the young girls coming out know little about what they are coming to\n","66":" Chemnitz\n\nCleared port about 7 and Miss Edith Campbell was there to say adieu. It came on very rough and I was seasick – many others too. In the evening it was calmer and bright moonlight. We steamed into a shining path of silver moonlight. On the horizon a tinge of aurora australis.\n","67":" A rough tempestuous day with huge seas sweeping the decks so dangerously that we had to order everyone below. Showers of spray. Tried a number of orderly room cases. One of breaking into the hold with a master key which I confiscated. There is a bad criminal gang aboard this ship. Turned into bed after dinner but slept none too well owing to heavy rolling all night.\n","68":" Chemnitz\n\nSpent an hour or two trying cases at Orderly Room. Another rough tempestuous day with everything sliding all over the place. One continual feeling of nausea all day. Some of the men wretchedly sick and have not eaten a bite during the voyage since leaving Durban.\n","69":" Ship’s inspection this morning was one long round of complaints mostly because we asked the troops to eat rabbits this morning. Perfectly good but the complaints are frivolous and come from a minority. Met the Master Chief Steward and OM in conference about the food at 2 pm and the result is that we cannot do any better. I calculate over 200 of my complement are military criminals. A much smoother day today.\n","70":" Chemnitz\n\nAlthough the weather was fine we ran into heavy seas this morning and all the recently recovered sea sick people soon collapsed again. Found on the inspection down in the lower decks the air was thick enough to make one squeamish. There were fewer complaints about food today though bread was one item. New – that is all that is wrong with it. Some of these complaints are made by criminals and cold footers and makes one feel inclined to hurl the offending bread, stew or whatever it is at their miserable heads.\n","71":" Much smoother today. On inspection this morning found all pretty correct. The ship is getting very monotonous and we shall not be sorry to reach home. The wind was howling and whistling all night – a wild night at sea.\n","72":" Chemnitz\n\nLovely sunny day. Church parades. I inspected the whole ship and found things not bad. A ridiculous complaint about the mare puddling from one agitator received no sympathy from me.\n","73":" A fine day. Boxing in the afternoon. This journey has now entered into its monotonous stage. The sea blue and calm and greatly in contrast with last week. All kit bags issued today for Customs Declarations.\n","74":" The question of fresh water wants looking after as the troops waste a lot. 28 tons daily is the allowance. 47 we used the other day. Inspection found all pleased and contented today. Weather has much to do with morale. Rolling waves this afternoon. Band playing Evening Concert.\n","75":" Chemnitz\n\nA good swell on today but nobody sick. Usual inspection and no complaints. Pay Monte Carlo look about by reason of crown & anchor. Sports during afternoon.\n","76":" A fine day. Sunny and calm. Boat drill in the afternoon. In the evening the Captain got a wireless ordering us to call in at Adelaide.\n","77":" Fine and uneventful. In the afternoon a dead whale furnishing a banquet for birds floated past. In the evening a fancy dress ball on the promenade deck. Our concert party girl made a splendid VAD and as a padre was incomparable – shovel hat and black coat\n","78":" Finalised B history. A cold day some rain. Read and wrote all day. Excellent concert tonight.\n","79":" Inspection was the only work. Spent remainder of this fine Sunday signing pay roll.\n","80":" Chemnitz\n\nGetting rougher. Many white dancing caps on the waves today. Usual inspections – a good round. Had a conference of OC Caps to fix up the charging of things short. Evening one Sergt Smith gave a lantern lecture on sheep.\n","81":" Dull and rather cold. Morning inspection furnishes good exercise. Some of the lower decks are rather stuffy. Cigarettes are getting very short now and the Canteen has now run out. Food and general conditions are good at present -- quite a change to a few days ago when all the cooks as well as all the men were seasick and squeamishly unstable.\n","82":" Fine but rougher. Sent Smythe round on inspection. Plenty of poker being played now. In the evening a concert.\n","83":" Chemnitz\n\nFeeling rather unwell with a chill. Remained all day in bed. In the evening the Diggers Parliament had its final session.\n","84":" Got up about noon. At dawn this morning land was in sight – our first sight of Australia after an absence of 4 ½ years. The \"Wakey, Wakey! Man\" had an easy job rousing the men sleeping on the promenade deck this morning. \"Wakey, Wakey, Wakey!!!\" \"Aussie, Aussie, Aussie! Here’s your land!\" \"Get up and see the kangaroos and emus!\" \"Shake a leg and look at all the smiling faces on the shore!\" A low dull grey coast line and a grey rolling seas with glints of and low wheeling seabirds. At lunch we were somewhat about Albany – a little later came in dull squally conditions.\n","85":" Chemnitz\n\nOut of sight of land today and having a quiet passage over the Bight. Fine and fairly smooth. Usual inspection – no complaints. Most of the officers play cards all day and concert at night where I made a speech of thanks to the concert party.\n","86":" Stayed in bed till midday. A lovely sunny afternoon. Read.\n","87":" now 5\/9 in a Tote on the day’s run – 236 miles. It was raining this morning and most of the men were down below. Received message from Adelaide that we must arrive before 4 pm if our SA & WA chaps are to disembark. The \"Orsova\" passed us during the day en route for the same port as ourselves. Capt. Young thinks we’ll arrive before 4. The Chief Engineer (in grease overalls) reports his engines going better.\n","88":" Chemnitz\n\nA cold blustery day. During the night we passed land and a light house. Busy this morning taking in blankets hammocks of the WA and SA chaps. Everyone much excited – we expect to be in at 2 pm. Plenty of fellows coming up wanting to get off for leave to visit relatives and other pretexts at Adelaide. The day cleared up later on and in pleasant sunshine we came to anchor off Port Adelaide at about 2 pm. having earlier in the day passed Glenelg. Three doctors came on board to carry out a quarantine inspection and they counted all the troops. The embark officers also came aboard and brought £ 12000 in notes for pay. One of these gave an address and asked for complaints with the result that we were closeted up with a kind of committee until 7 pm. At about 4\n\n2\/9\/19 Pt. Adelaide\n\nwe moved into a berth vacated by \"Orsova\". After some delay we managed to get our SA & WA off but the crowding jostling and general undiscipline of the men reached its climax when a general rushing exodus took place down the gangway and on to the wharf. The ship was soon nearly empty and I went to bed.\n","89":" Doc, Padre & Hinch had a night out. We sailed at dawn and had a smooth run all day. It was very pretty running between Kangaroo Island and the mainland (Cape Jarvis) cliffs and surf. Trouble with fresh water persists today.\n","90":" A busy day. Blankets and hammocks checked. Mess gear parcels called in. Paid over &pound5000 out to Melbourne men. We passed Cape Otway light at 8 and expect to be at the Heads in 4 hours.\n","91":" Melbourne\n\nAt 6 the steward brought up my breakfast and I found that we were rapidly approaching Melbourne being just off Snapper Point. A fog then came up and we gradually felt our way ahead until we reached Hobson’s Bay. The old Chief Officer was busy in the chart room with chart and ruler. At 8.30 we anchored near Gellibrand light noticing the old Cerberus and were inspected by a doctor from the port. Then went over to Port Melbourne new pier. The first people I saw on coming in were General Brand and Mr G.H. Wise. Gradually we came alongside and motorcars & charabancs drove up and took the troops away. The disembarkation worked quickly and like clockwork. Handed over \n\n5\/9\/19 Melbourne\n\nsome cash and then walked up the wharf among the crowd at the end where Jack was waiting. We trammed out home together & I was much struck 1) with the filthy dirty uncleaned streets covered with horse manure 2) the smallness and narrowness of the Central station 3) the general dinginess and want of paint round St Kilda Road and Government House. The old cable cars also. Reached home and lunched and after an hour or two there returned to the ship with Valerie and Jack. The Prinz Ludwig had come in and all her troops were going away like ours did this morning. We found plenty of drunks aboard and left for Sydney at 5 pm running quietly down the bay. Round the pier our screws churned up much mud.\n","92":" Chemnitz\n\nPassed Wilsons Promontory early but I did not see it completely. Saw high cliffs and some stray islands. A lovely sunny day with a sea absolutely unruffled. Ordered all men up on deck and checked kits and cleaned decks. In the distance low blue land in sight.\n","93":" Another fine day. Passed the \"Themistocles\" early looking very beautiful and trim. Passed Gabo about 7 with a slight roll. All day ran along in sight of low coast and blue distant hills. Paid all on board.\n","94":" Up at 4.30 and at 5 it was just dawn. Ahead could be seen the low cliffs outside Sydney Harbour. Absolutely no sign at all of the entrance which takes a sharp right angled turn. We lay out here awaiting the pilot and in the bright sunlight of a lovely\n\n8\/9\/19 Sydney\n\nSeptember morning we entered Sydney Harbour. Noted the two Heads (favourite places for suicides) and was at once struck by the great beauty of the scene opening before us. Manly was left on our starboard side and we ran in among delightful islands and passed coves and tiny bays. The islands and mainlands covered in thick green timber and with fine comfortable looking houses. We anchored in Chowder Bay to be medically inspected and then ran up past more beauty spots to Wooloomooloo where we berthed and the troops went off. It had been a busy morning checking all the gear and handing back all the stores to the ship. The Domain bathed in sunshine comes right down to the wharf here. At 11 we moved round\n\n8\/9\/19 Sydney\n\npast Milsons Point and passed the \"Australia\" looking very spick and span, some submarines and a number of other war boats. About noon we berthed at Dalgety’s wharf. Undoubtedly Sydney is a lovely place. At 2.30 went off with Maclean & Miles and walked up through fine business streets to the Hotel Carlton then to Circular Quay and afterwards to Victoria Barracks. Dined with Captn Young tonight at the Carlton. A smell of boronia everywhere. Impressive free and easy waiters, no \"Sir\", no excellent attention. Dowdy look of people at and after dinner owing to lack of evening dress. Bad service in bars and barmaids. No elec light at bedhead. Good food and wine but not enough forks &c. Bare & comfortless lounge. \n","95":" Sydney\n\nWet morning. Walked round Pitt Castlereagh & George Sts and booked opera seats at Palings to & saw MacGowan re lunch. All men seem well dressed including working class and their clothes are clean. Narrow footways & verandas.Visited Horderns and other \"sights\". Went to Faust.\n","96":" \n\nFine. Went over to Manly and had a look round getting a good toss going across the harbour. No one surfing too cold. Fine long breakers. Back to hotel dinned and then went to a matinee of \"Madame Butterfly\" with plump Amy Castles in the title role. Met MacGowan in the evening and went out to dinner with him at his very nice place and family at Hunters Hill. Beautiful lights on the water at 11 pm returning.\n","97":" Sydney\n\nA lovely day. Went to the Bank and saw all the heads including Norman Grieve Magnus Sharp and others Have arranged to lunch with Grieve at 1.30.\n\n"}}