{"Document Name":{"0":"Diary_0478","1":"Diary_0478","2":"Diary_0478","3":"Diary_0478","4":"Diary_0478","5":"Diary_0478","6":"Diary_0478","7":"Diary_0478","8":"Diary_0478","9":"Diary_0478","10":"Diary_0478","11":"Diary_0478","12":"Diary_0478","13":"Diary_0478","14":"Diary_0478","15":"Diary_0478","16":"Diary_0478","17":"Diary_0478","18":"Diary_0478","19":"Diary_0478","20":"Diary_0478","21":"Diary_0478","22":"Diary_0478","23":"Diary_0478","24":"Diary_0478","25":"Diary_0478","26":"Diary_0478"},"Date":{"0":"unknown","1":589.0,"2":590.0,"3":591.0,"4":592.0,"5":593.0,"6":594.0,"7":595.0,"8":596.0,"9":597.0,"10":598.0,"11":599.0,"12":600.0,"13":601.0,"14":602.0,"15":603.0,"16":604.0,"17":605.0,"18":606.0,"19":607.0,"20":608.0,"21":609.0,"22":610.0,"23":611.0,"24":612.0,"25":613.0,"26":614.0},"Entry":{"0":"\n\nSaturday\n\n1 Aug: 1915\n\nEgypt\n\n5 Am Massed bugles of the 5th Brigade sounded well in Reveille. I did not hear ours go. Early parade until 8 o’clock and company drill. Practised close column wheel for ceremonial presentation of certificates. At 8 o’clock formed up and Brigadier handed subalterns & n.c.o.’s their instructional certificates. Did not do the wheel after all, - after all the great preparations. Battalion dismissed half an hour early.\n\nAfter breakfast counted pay and at 10.30 commenced paying the men Then busy until 1 pm. and was late for lunch.\n\n3 pm. Left for Cairo with Capt. Buckley and . Engaged guide for Old Cairo at \"Continental\". Struck a bargain with him for P.I. 15. He wanted 20. Went per gharry through residential portion and saw fine school like barracks – now used for hospital . Outside the gate crowd of natives squatted on the ground waiting with a bier for the corpse. Passed another funeral lower down. The body carried on shoulders of bearers, much chanting in a kind of low wail. Deceased’s hat on top of upright pole on bier.\n\nReached Roman acqueduct built to convey water from Nile to Cairo. Big piece of\n\n","1":"\n\nwork. Apparently ended in large terminal building on which is Arabic inscription. Past hovels and rubbish heaps to quays. Quite a forest of masts, raking all ways, boats discharging building materials of all kinds brought from lower down. Turned inward and reached high blank wall of wood and brick. Down stairway to narrow door leading into filthy street. Howling beggar with tongue cut out, grunting for alms. Another small door and knocked. Opened and found ourselves in Church of St. Barbara, built by Copts shortly after Christ and still maintained by them. Gallery for women, as they are kept separate. The whole place redolent of great age. Altar covered with altar cloth fabric almost falling to pieces. High narrow ceiling with frequent cross rafters. Guide produced a taper and we descended to the crypt beneath the church. This cave was first used and the church erected over it. The crypt is full of supporting arches and appears\n\n1\/8\/15\n\nto be hewn out of solid rock. Outside the church and in this crypt the symbol of the cross is met with frequently. At intervals in the sides of the passages are small recesses marked with sign of cross cut out of the stone. Said to be for use as tombs but not large enough. At end of passage is a slightly larger recess with a small well about 3 feet deep and 3 feet diameter sunk into stone. Usual stories about Holy Family resting there. They seem to have rested everywhere! The whole place shows no sign of damp but there is a dank smell like a cellar everywhere. Came up again into body of church and inspected screens which are said to be wonderful work. The design is in ivory of which small pieces are let into the wood like mother of pearl. The woodwork is being restored and, in some cases, there will not be much of the original left. Hailed by coloured gentleman in Tarboush and carrying offertory plate embossed with cross. He volunteered the information that he was a Copt and pointed out how his features differed from Egyptians. Left the place and went through the\n\n1\/8\/15\n\nusual crowd of halt and lame. Small girl with no arms very persistent in thrusting the stumps before us. Quite a number of diseased human wrecks crouched in filthy rags on ground too comatose even to beg.\n\nThrough a garden and across more rubbish heaps to the Greek Church. The original church is now in ruins, and the new one in circular form is on top. The ascent is up a spiral staircase. Watched a service to conclusion – apparently cross between Church of England & Roman. Congregation consisted of one girl who confessed afterwards. The place reeking with incense. From the balcony a fine view is obtained. Directly beneath is old Cairo – a mass of filthy hovels, many nearly roofless and those with roofs have them covered with lumber and household rubbish. The people are little better than beasts to exist under these conditions. Men and women alike attend to the functions of nature on the spot – no sanitary ideas are given effect to. Human excreta lying all round and the ground and walls\n\n1\/8\/15\n\nblack with deposits of urine for hundreds of years. The hot sun neutralises the results of this state of affairs to some extent though it is no wonder disease is so prevalent. In the distance outside the city wall are the graves of bygone generations mingling with the sand of desert. Thousand of tombstones – the tombs of the Marmelukes stand out plainly.\n\nRight across the whole front extends the Roman Acqueduct like an enormous wall; on the right along a ridge are about 15 or 20 small towers which are the base of wind mills erected by Napoleon to grind grain for his troops.\n\nThen to the Nile and by boat to Isle of Rhoda. In the boat were a typical crowd of natives. We had to sit among them, and the stench of them was awful. On the way to the Nilometer on the island we encountered a native foaming at the mouth and shrieking with rage. The cause of the trouble was the action of some New Zealanders in illtreating a native with their bayonets. The Nileometer is a well directly connected with the river – on the side is marked a sliding scale of feet &c, \n\n1\/8\/15\n\nThe place was very dirty fowls and ducks running about.\n\nAt 6pm to Saults for a drink and walked about till 8.30 and then dinner at Shepheards. While at dinner an officer reported to the General that soldiers were setting fire to natives goods in the streets. \n\nAt 9.20 on the terrace noticed a glare and smell of burning and proceeded to the scene – the commencement of the \"red light\" district. Two large 4 storey buildings were ablaze. The crowd was most orderly. The natives vanished like magic, all lights doused and shutters down. They have not forgotten previous treatment when a \"battle\" starts in the Wazir. The fire brigade seemed up to date and had a good pressure. After about 4 places (some very large) were gutted and others much damaged the fire got under control. The narrow streets in rear were 12 inches deep in water. The Yeomanry turned out, a cordon blocked all approaches and two squadrons were drawn up in front of Shepheards. We did not wait to see the completion of fire\n\n1\/8\/15\n\nextinction but went for a ramble through the Wazir. Places that were usually going strong were silent and in darkness. About ¾ mile in we encountered Wazir life in all its entirety. Glare of light and blare of music. Dances, songs, native plays were in full swing. The women in crowds in their doorways decked in all the colours of the rainbow and displaying in old Eastern style their allurements. Occasionally behind iron bars were groups seat\ning\ned flirting with their fans in the windows.\n\nEventually after a lot of this we lost our way in a maze of streets and emerged in time near the Mousky. We had another look at the fire – now only a few glowing embers among the ruins of the houses and pensions. Tram at 11.30.\n\nBed 12.30\n\nSunday\n","2":"\n\nReveille 6 Church parade 7. Men looking smart in new helmets and tunics. Afterwards inspection by Major Smith. Breakfast. At 9.30 set out for Obelisk at with Major Smith Derrick Caps. Abbot Drummond Buckler & Lt. May Very pleasant ride. Our\n\n2\/8\/15\n\nOur horses objected to the camels but we passed so many they became quite used to them. The country was delightfully green (all irrigated) cotton sugarcane datepalms flourishing. The obelisk prettily situated in a small grove of trees and looking as fresh as if erected yesterday. Returning we called at the Church of the Holy Family where they rested and to the Virgins tree where she rested. I wonder if they found this resting hard work.\n\nAll these places green and fresh, nice gardens and so on – a change from sand sun and ‘sorrow’. We came out on a road near Abbassia and reached camp again at lunch time.\n\n2.30 To the hospitals and saw Green and some other of our sick men. Green rather downhearted. He gets no better of the septic poisoning and is getting thinner; although I swore to him he was looking well and putting on weight.\n\nRemainder of afternoon & evening in camp. In orders tonight, no leave for Cairo at all. The City is out of bounds. The result of last nights conduct of the troops.\n\n2\/8\/15\n\nAt midday saw a large Arab funeral passing the Roman Catholic Cathedral An Arab band lead, marching at a most extraordinary dead slow pace and playing a haunting tune – a crying dirge, – on their instruments. Behind them followed children carrying large white wreaths and so on. The corpse on a hearse. Everyone in pure white – evidently the mourning colour.\n","3":"\n\nAnnounced at early parade that in consequence of disturbances in Cairo all leave is stopped to Cairo, Heliopolis and no man allowed to leave the Brigade area. Double sentries on all round the Camp. At 5pm left for Tower No.2 on Suez Road to bivouac. Put out outposts in the dark taking boundaries for from stars. Pole star right, Great Bear left. Withdrew outposts at 11 pm and all turned in with clothes on sleeping on sand.\n","4":"\n\nRose 5.30. Moved off 6.30. Company in firing line, myself O.C. frontage 2 platoons 200 yards. Second line of 2 platoons. O.C. Major Derrick\n\n4\/8\/15\n\nFought rearguard of a force retreating. Blazing hot and dusty. Reached Camp at 10am. All just had enough – one man fell out. Men tired out but all have to go on guard. Bde duties tonight\n\n4. pm Mounted as Captain of the Day\n\nNone of the Coy. on parade. Remdr. returned from night entrenching at 9.30\n\n11. Turned out guard, one sentry on No 8 post behaved in a most extraordinary manner. As I approached he appeared to be sitting down. He saluted and then turned three somersaults and landed with his rifle & bayonet almost through a tent. He got up groaning and said he was ill owing \"a little ale\" he had before coming on guard\" Smelt his breath which was alright and left him moving briskly on his beat. Sent officer of the Guard back to relieve him and put him in guard tent under observation. Field officer reported No 6 lying down on his beat away from his rifle and put him under arrest. He said he was lying down with his ear to the ground listening. Am satisfied that some beer must have been going round, probably taken on in water bottles\n\nTurned in at midnight\n","5":"\n\nOrderly Officer. Returned balance of pay. Pte Dean died of diphtheria and most of his platoon out. Evening parade woodfighting. Done on bare desert with wood represented by two men Called up by C.O. and in opposition to my wish, appointed Adjutant . However being ordered to do so have no option. Feel leaving A Co very much but have resolve to get back by some means or other.\n","6":"\n\nStayed in taking over Adjutants work and clearing up mess. Trench fighting in evening. Returned & after dinner continued with DeBoos counting\n","7":"\n\nOn early parade order read from GOC Sir John Maxwell stating conduct of A & NZ troops in recent disturbances was disgraceful & a slur on memory of dead. He says complaints are frequent of conduct, assault of women, robbery & One soldier under arrest for murder. These actions only those of a very few – a \"push\" \n\n5 pm Left for bivouac in same spot as previously. A Co supplied outpost. Everyone turned in and asleep at 9 pm. Slept very well till 4 o’c when sand got into All arrangements good, men enjoyed the change. Bright starlit night, spent some time with trying to pick out constellations. Nothing like lying out in bivouac to make one notice the stars\n","8":"\n\nReturned to Camp at 9.40 am.\n\n‘C’ Co fought a rearguard action attacked by the rest of battalion. I was with supports, country very good, a succession of ravines at close interval allowing the force to be spread out between \"traverse\" of rentrants and yet close at hand and compact.\n\nWord from H.Q. 10 % leave for Cairo now - Plenty of work in office.\n\nThink it a mistake to be there too much as something always turns up if you wait\n\nJack came up; we had a few minutes talk & then had to attend to about half a dozen different matters that cropped up just by going over to office for a minute\n\n8\/8\/15 \n\nContd\n\n3 pm left for Cairo with Capt Pedler and Buckley. Took gharry for Mousky and then walked on. The whole narrow street very busy and full of colour and life. Touts very annoying at first but soon melt on \"Imshi Yallah\", and threat with walking stick. Continued up Neuvre Rue; noticed quaint street cries. Sukker melons some cries very musical. Leaving European shops reach native bazaars. Tatooed donkeys and sheep, goats on footpath, the street covered with ¼ inch mud from watering. Native women shopping; one with dropsical feet, her shoes only fitting over heel and toe. The flesh bulging out like balloons and shaking like jelly. Her appearance otherwise normal. Beggar with red growth on left side of face, protruding about 3\" and extending from left eye to chin – probably lupus. The fez sellers selling small gold braided caps for Ramadan. Saw man carry bundle of tarboushes 12’ high \n\n8\/8\/15\n\nSome fine looking Moslem women daintily dressed – high heels , white yanunaks guarded by two Nubian Eunuchs. Beautifully figures and plenty of \"glad eye\". It is hard to realise they are the same race as the filthy hags sitting in the gutter. Could now see end of street and stopped at corner of Charet – el – Azhar. Consulted map and went round corner to Gami el Azhar – the moslem university. The minaret beautifully carved the stone appears to hang from the balcony like folds and tassels of cloth. The same stone carving over gates and on adjoining buildings – over 1000 years old. Crowds along footpath in front of big wall some praying others rocking in ecstasy. Went right round building which is said to contain 9000 students from all over the world. No guides coming forward. Saw the Gate of Barbers. Returned to side and hired boy to show us over. Put on slippers and mosque attendant leads on. In big courtyard 700 alabaster pillars very ancient. Crowds about. Saw rooms allotted to different nations\n\n8\/8\/15\n\nInside floor covered with mats professor sitting down surrounded by pupils expounding Koran. Guides keep hurrying us on by looks we receive our presence is resented. Tomb of Azhar behind railing. Small mosque further on apparently very old. Great many lying about asleep. Boy reading to old man who apparently was in extremis. Hurried out by guides to street. Wandered on through side streets towards Citadel Road. Saw man weaving frail loom worked by foot. Spat at by women sitting in front of mosque. Peddler & Buckley returning amorous glances of better class girls. Tram to Ezbekieh Gardens. Rested for ½ hour and read paper. Tea at Saults and then to ‘Dreadnoughts’ to fill in time. Vera there. Thursaal 10 o’c. Good show. Casino 12, crowded to doors with officers same old song but very few girls Probably given up going there on a\/c leave stopped early in week. Never seen place so busy 1 pm. Bed 2\n\nLeft Pedler behind – Garden St,\n","9":"\n\nChurch Parade. Brigadier & staff there. After breakfast to mat. Jack came up. Lunch then more mat. Tea. Office till 8. Read Bed\n\n9\/8\/15\n\nEarly parade platoon & company drill. Read till lunch time and slept after. Evening platoon fire direction & control. Returned to camp after dark. The days are closing in rapidly.\n\nThe weather from now on should be cooler; fruit will ripen and so on. The flood waters are coming down the Nile and will probably lead to an increase in mosquitoes. Jack came down after mess.\n","10":"\n\nRoused before 5 by cries of the native news boys. \"Baaper Timaz Egyptien. Morning Baaper\" To hail the newsboy the cry is \"Tallaheno\" or \"Egeree\" (Come here). \"Thuni\" (how much) They generally ask for one piast. When wanted to clear out just order \"Mafeesh\" (finish) or \"Imshi Yallah!\" Which is a curse.\n\nLeft at 6 on Bde. route March past Aerodrome Gd. Towards tramway sheds. Heliopolis looked a city of white palaces in the early \n\n10\/8\/15\n\nmorning sun. It was very pleasant moving along. Past golf links into the desert and at once adopted the \"blob\" formation to clear a shell swept zone. Formed up again at Tower No 2. The whole countryside covered by little columns of men about 10 in each, moving along like snakes. Returned to camp across desert with advanced flank & Rear Guards out. The hillsides furrowed with trenches probably where yeomanry have been at work.\n\nEvening\n Companies in attack. 3500 rounds of blank issued. Working independently attacked towards water tower, the work was good. Looking down from hill no one would have known that 600 men were scattered all over the surface of the grounds in front. Looking closely the distinct waves of skirmishers could be seen and the crack of the rifles as each small rush was made gave an indication of the dispositions. As dark came on the flash of the rifles became very pronounced. Formed up and moved in – in the dark\n\n10\/8\/15\n\nStanding on the water tower hill a fine view in the sunset. To the left Cairo with its minarets the Citadel and the twin minarets of the Mosque M. Ali being the most prominent land mark. In the distance the dim outline of the Pyramids. Closer, the Light Horse Camp. In front Heliopolis the domes of the palace; and the Ibrahim Palace and Mansion de Baron standing out. All around the desert with not a sign of vegetation but varied by the sand hills sweeping away in rear. Dotted all over the desert, small ant-like groups hardly distinguishable from the sand. Rumours of the fall of Achi Baba. Great preparations at hospitals for the receipt of wounded. My batman Mitchell seems to be turning out well. He has the tent very clean & comfortable for me, mats and chair, writing table and place for clothes &c. Lamp dishes & buckets & a number of other things have materialised\n\n10\/8\/15\n\nHe has evidently been \"foraging\" around and \"acquiring\" these luxuries.\" I ask no questions!\n","11":"\n\nEarly morning\n Relief and occupation of trenches. Returned to office after Batt. moved out. Went out later had good two mile gallop across desert over to foothills Hundreds of light horse at work. Lecture Major Blamey 10.30 giving experiences in landing and subsequent operations on Gallipoli. A good many gharry drivers about the Camp. The gharries are like phaetons and go along at a great rate. The driver who always wears a tarboush sits on the box. He has a badge on his arm. On each of the two horses on the collars are tinkling bells. The driver all the time calls out Meenak, meenak ou ar meenak\" his voice going up and down the scale according to the possibility of a collision. In among traffic it frequently reaches a scream followed by a luxurious flow of Arabic. The tariff is painted up inside each gharry but they are great robbers and always ask 10 piastres even when the fare is only 3. They skinned us pretty well at first but we are too shrewd now and get in on them\n\n11\/8\/15\n\nEvening parade\n Advanced & rear Guard by Comp. Only one company out, all the rest on duties. Bde & Cairo. Early tea and into Cairo. To Sheapheards and read until 9.30. Left for soldiers home in Red Blind Street and met Major Derrick & Buckley at the picquet rendezvous. Donned Military Police brassard and set off with Redcap Corpl. on rounds. Ejected Yeomanry from drinking shop and closed it up. Returned to street and commenced searching houses. Doors of all rooms opened at once on the word \"police\". All civilians in first house – all the soldiers having fled. Next floor Egyptians. One door locked loud protestations \"Mafeesh Alexandrie\" but on opening discovered L. Horseman. Picquet threw him out. Called out to brawl gave men concerned 3 chances to clear out and then arrested them and locked them up. Next street two soldiers very drunk, woke them up dressed them and turned them loose. Then among Greeks \"Tiger \"Lily\" a beautiful girl and in fact all of this household splendid looking specimens, \"Tiger Lily\" well named – tigerish in every way. About 20 Yeomanry \n\n11\/8\/15\n\nhere saying Goodbye! Picquet threw them out. After this through innumerable French, , & Native houses finding an occasional soldier and the usual number of civilians. No privacy where Picquet concerned, all doors open at once. Some queer sights. One soldier looking for trouble and obliged by Sergt. Nelmes who applied police grip and threw him downstairs. Quite sober and subdued when he reached the bottom step. To Garden St. All places clear except Cherie Verts who hailed D most affectionately and embraced him in front of the Corpl. of picquet. Rather embarrassing. Some tarboushes on premises. To Russian place Josey Manta in good form. Fanny at Alexandria. No one at premises. 12.15 dismissed picquet. To Cafe Egyptien for a drink. Waitress lives near Kasr el Nil . To Casino nothing doing. With Buckley to X Cont spent half an hour chatting. Same crowd with one exception. G’ette sliding down fast. Gh – ta returning 7 days.\n\nTo Casino. All Yeomanry officers celebrating departure, commandeered band and gharry racing in street \n\n11\/8\/15\n\n1.30 Tram, 2a.m. Bed\n","12":"\n\n4.45 Up and shaved. Platoon drill & bayonet work. Roused buglers up 21st Battn to Citadel and Kasr el Nil as garrison\n\nEvening parade\nBattalion advanced and rear guards. Went about 2 miles out towards Suez Road and in rear of new rifle range on which firing has commenced. Fine view of Cairo from high ground, the Pyramids (all three) very distinct. The broad ribbon of green along the Nile brings home what the river means to Egypt. On both sides barren desert and sand everywhere. Between a broad expanse of trees houses and cultivation. This narrow strip which is Egypt carries a tremendous population. Away from where the river water can be carried is wilderness. \n\nReturned in dark. The weather much cooler and rather windy. It looks as if we shall be here some time as all the yeomanry are being relieved of garrison work by our Division\n","13":"\n\nEarly parade. Fell in battalion and then came in and had breakfast. Went to Cairo to draw pay with Corporal Be Boos. Very pleasant morning passed canal on way in – full of nude men scrubbing down donkeys. All the cemeteries full of crowds like meetings - Mussulmans celebrating Bairim. Went per gharry to Pay Office & drew pay cqe. Returned to Bank, had long wait there. To Kasr el Nil barracks. Very animated South Nott Yeomanry moving out for Gallipoli, 21st Battn going in. \n\nRumoured Australians all round Achi Baba and cut off Turkish supplies. 5th Bde. sailing for destination unknown. Think Suez to relieve AAC. Are we going to Citadel? Peculiar to see the women being taken out to the fields on kind of lorry. Narrow lorry crowded with black shrouded figures squatting down – like nuns. Man walking along side driving the donkey. A great many new Australians roaming round Heliopolis. Just arrived – no helmets & no salutes! Great many fat men in tram no waistcoats They have their trousers cut very high up so they button over paunch. Gives them funny look\n\n13\/8\/15\n\nWent to Bde. office at 4.30 pm and received orders there for Battn. to be in position three miles out on sand dunes at a position corresponding to the I in Be\ni\nt el Sharia on the map at 6.30 pm. Fortunately suspecting some such order had made a few preliminary preparations. At 5.20 the Battalion fully equipped marched out each man fed and carrying a ration. Machine guns in timbered wagon. Transport with food picks & shovels also following. We were first battalion out. Reached destination right in centre of sand hills & stony rises. Took up position in conjunction with other Battns. & commenced entrenching. \n\nVery difficult to site trenches owing to nature of ground – field of fire in some cases very limited. Machine guns & trenches commanded watercourses. The men worked all night in two hour shifts and were just about done by morning. Turned in by Major Smith about 10 on sand with saddle as a pillow. The stars very bright and a low scented breeze blowing. Perched up on hill valley of desert with date palms in distance just discernable in the moonlight. The only sound the steady work of diggers with occasional change of shift. Slept until 4 am, all hands\n\n13\/8\/15\n\nstill entrenching in the pitch dark\n","14":"\n\nTook a walk round and found works nearly complete men quite out of sight in some places 10 feet down, the whole place a mass of zig–zag intricate burrows. At 4.30 every man stood to arms and remained under arms in his allotted position with bayonets &c fixed until dawn. Inspected some picks and found them quite bent up and useless through work in sandstone and shale. \n\nAt 6 issued rations and formed up. Found that horses had broken away so led column in on foot. Very hot walk all clothes saturated. Shower Mail to hand 4 letters – no news. Busy morning with correspondence. Talk of a raid in Cairo tonight. No pay to be issued until Monday - Bdiers order. \n\nBusy day in office seem to have been about there all day. Stayed in camp during evening, about the first Saturday night spent in Camp since arriving in Cairo. Only leave allowed for Heliopolis. Longest evening since arriving here. A – . very amusing went up street and returned well p. for 10 P.I. with pictures and 2 gharries thrown in.\n\nBed 10.30 \n\n14\/8\/15\n\nMen have girls names for us all. Derrick Daphne, Smith Sara, Crouch Cassie, myself Winnie and so on\n\nThomsen asking any complaints as Co. ord. officer. One man said not enough salt in stew. Another turned round ‘What your xpect eh’ flowers on yer grave! Jeanette in Sergts mess ordering the nigger \"Egeree them -- plates – yer.\"\n\nLast night only one water cart out quite unmistakable. Pte. A (\"good\" family) Er is this the water cart? Eh what? Pte B. \"Aw, no . This is a – furphy\" \n","15":"\n\nChurch Parade. Clean & good turn out. Inspected H.Q.’s All men in camp – no money. McIvor \"For God’s sake lend me a few piastres, sir, there not a smoke in the tent.\"\n\n2.30pm Left for Cairo, Shepheards. Gharry to Kasr el Nil barracks. Went over place with Derrick. Front part built by Napoleon. Rear old palace, beautiful rooms with carved ceilings falling into decay. Steep spiral staircase leading down false passage. Officers Mess beautiful room.\n\n15\/8\/15\n\nwalls silk tapestry cornices gilded and beautifully carved. Painting on wall over 200 years old, red very vivid and fresh, lost art of pigmentation. Mess there and with Buckley round European quarter. 10.30 went to picquet and commenced the search. Stray brawls. Continued no respecters of persons. Through Arab quarter of Wazir tortuous streets with the sound of the tom – tom and the squeak of reed pipes like bag pipes everywhere. Can – Can dances. Australia very good very nice. Women covered with bangles rings on feet and hands. Shining dresses of gay colours headresses of gold beads and pendants, heavy earrings negresses, Egyptians & half castes. Sitting in doorways. Tarboushes everywhere – gharries &c.\n\nPassed through native vegetable market . Took wrong turning and emerged near Abbasis. Marched back to Alexandria and midway between Red Blind & Garden St. Searched place there beautifully furnished. Tableaus so called \n\nGarden St. Saults & then tram\n\nBed 2.30 am\n","16":"\n\nRose 4.45 am. This inspection of battn, very slow in getting out. Each man carrying full marching order & all worldly belongings. Interesting sight looking over scene from horseback. \n\nOpener ranks 10 paces, waterproof sheet flat to front, kit stacked neatly on it. \n\nDesert quite animated in front of while checking.\n\nAll tents cleared and cleaned for inspection 10 am. \n","17":"\n\nAn uneventful day but plenty of work, stayed in camp in evening. Rumours most persistent about our leaving for the front shortly. Everything points that way, pay office say so and have sent our clerks back. Plenty of returns called for about strength &c, hard to tell what is furphy and what is truth but believe this is the \"good oil\". Col Huthcison & Watson said to have got it from Brigadier. Monday week named as day\n\n17\/815\n\nBattalion drill. General Legge out and had good talk with him. Remarked carrying rifles – trail no good in file slung across right arm best. In South Africa always used that method himself easy to slip it down across saddle. General Legge faithful to Australian hat. Smart march in, sent band right out to meet the column.\n\nMorning – rumours more circumstantial. Sorted out kit and repacked trunk. Quite ready for action now.\n\n12 noon. Had long talk with Brigadier Elmiger & Batson to return. – Bazeley, Stockfield & King recommended for comms.\n\nEvening. Advanced & rear Guard\n\nDefinite word arrived from Bde. H.Q. that we move on Monday next. Great celebration in mess.\n","18":"\n\nCompanies in attack. Office\n\nEvening Battalion in attack – \n\nMessed up. Quiet evening\n","19":"\n\nUp 4.55. Fell in battalion and then returned to Camp after a good gallop. Changed early breakfast and to Cairo with DeBoos to pay office. To Anglo Egyptian Bank\n\n19\/8\/15\n\nNoticed same smell there as National Bank in Melbourne. To Pay office making all arrangements for leaving. Strolled round streets in Savoy quarter until 10.30 and then met DeBoos. By gharry to Gann Sultan Hassan built 13 Cy near Citadel. Narrow street one mosque on either side. The wall of Sultan Hassan very high and sheer with few windows. Up steps and entered a porch – immediately struck by splendid lofty appearance of place and beautiful carving of stone work. Passed inside small glass windows with exquisite light coming through. Into courtyard old washing place on four sides enormous recesses arched very high above ground, lamp chains hanging from roof. Across courtyard to two massive doors one with steel bars in front of it. The door a mass of beautiful metal work – inlaid gold and silver. The other door all metal stripped off by the French\n\n19\/8\/15\n\nduring invasion. Passed through into chamber of Hassans tomb. The lofty roof (sandalwood) most exquisitely carved and decorated. The corners looked like beaten copper work. The tomb solid alabaster surrounded by railings. On stone floor two rings of trapdoor leading to the vault of the Sultan Hassan’s family. Looking from window could see the outside stonework of the mosque scarred with Napoleons cannon. In two places the cannon balls are still visible embedded in the hole they have made in the stone. Saw reading desk of wood most exquisitely inlaid with ivory. Space to hold book very large evidently large manuscript Koran. This mosque easily the most impressive seen in Cairo but is apparently not used very much despite its big proportions.\n\nTo Citadel Guide through mosque M Ali twin minarets towering overhead \n\n19\/8\/15\n\nHe treacherously killed all the Beys one hundred years ago and then built this mosque to recover his reputation. The alabaster gives the mosque an ancient look. The courtyard and washing fountain Clocktower from king of France. Inside Tomb of M Ali. The floor richly covered with carpet. The chandeliers glittering with glass – the centre one enormous – 2000 lights in mosque at night. Reading desk and pulpit. Rising sun near pulpit, setting over door. Four enormous pillars \nnear\n supporting dome – not alabaster on account of great weight. The stone cornerwise quite transparent when lighted match held behind it. Outside through Gurkha and Sikh wounded to ramparts. The whole city spread out at our feet. The Nile like a silver ribbon and the green band of palm trees \n\n19\/8\/15\n\n&c along its course. \n\nThree deserts Libyan on right, Sahara, & Nubean. Heliopolis desert Red desert. In the distance Sakkara pyramids closer the Ghiza. Roman acqueduct Tombs of Marmelukes. Guns frowning over city from ramparts on left.\n\nLarge mosque on left very noticeable surrounded with high walls.\n\nLeft Citadel and home to lunch\n\nSmall meal in \n\nEvening – assault from trenches Bayoneteers, bombardiers, diggers. Formal mess B’dier. Arrangements not too good. After mess 20 nurses arrived from Palace Hospital for the evening. Arrangements evidently bungled again as they were not asked to dinner but came without having any themselves. – I shrewdly suspect \n\nProceedings tame looked in twice but not enough girls so p. off. Very dead. only lively spot in the evening \n\n19\/8\/15\n\nHad narrow escape, Buckley also full up Time hanging very heavily but would go soon enough in some society. Picquet swayed balance towards nothing doing\n","20":"\n\nBayonet fighting. Platoon and company drill. At 10 00 into Cairo to Pay Office and Bank. Bought draft at Bank, long wait with crowd. Saw Canadian officer. To Pay office. Saw Major Garr and others about Ulysses accounts. At 12 commenced some shopping electric torches &c. Returned in time for lunch. Made arrangements for bivouac. Early tea and moved out at 5 pm for night outposts (Brigade) with relief at dawn. Route via Heliopolis across golf links towards Suez road. Line approximately from water tower and tramsheds straight across.\n\nOutposts in position in a sort of way. Bivouaced in hollow well sheltered. Two companies on \n\noutpost line. Bright moonlight everywhere sand hills on either side. On the left the old Suez Road. About 9 pm the 7th Brigade marched by, quite invisible to the unaided eye but given away by the rumble of the transport. Tried with binoculars and could distinguish men and horses easily. Turned in 9.30 and slept with full equipment on and with saddle as pillow slept till 3.45 am.\n","21":"\n\nAll roused then and stood to arms until daybreak. Very tedious standing still with bayonets fixed waiting. Heard scattered firing along the outpost line. Breakfast and then formed up for return with advanced and rearguards. Morning\n\n21\/8\/15\n\nmedical inspection &c. Lunch and office. 4 pm Left per gharry with Curnow & Thomsen for Cairo. Went to Rue de Mousky and strolled up to Bazaars. Met a Greek funeral. Bearers in front carrying wreaths with ribbons denoting donor. Police in white in front. Greek priests and attendants carrying cloth embossed with cross &c held at four corners. Then hearse gold painted. The horses covered with black trappings trimmed with gold braid and plumes in their heads. Top of hearse wooden ornament gold painted. The driver the most comical figure conceivable. A negro Egyptian half caste dressed in 17th century coat & breeches\n\n21\/8\/15\n\nwith superabundance of gold lace. Enormous hat (like an Admiral’s three cornered one put on sideways) covered with gold braid too. Looked like some throatcutting pirate. Following the hearse the mourners and two coaches driven by pirates. Reached place on right with richly decorated terrace (open air) very elaborate ceiling with gold &c. Inspected place. Two women lying on beds on floor covered with bedclothes. Said to be a sort of refuge. Touts very persistent. To Hatouns and inspected his wonderful collection one small table wanted £ 275 for. Bought small obelisk and bowl and strike for PI 20. Great quantity of old nature wood work (wall decoration external) stored away there. Its making now \n\na lost art. Hatouns workshop closed. Owing to no tourists they say. All their skilled workers and cunning craftsmen dismissed. Say they can easily get them back when required. To brass bazaar and watched making of brass goods Lovely little incense burner for mosque inlaid with silver. Electric light stand for reading table. Brass snake holding in mouth shade worked in brass, covered with mantle of beads £ 2. Children 6 years old doing the punching out with little chisel and hammer. The aim always correct no need to watch hammer. Saw wood worker turning wood on lathe. Lathe worked by bow with loop round spindle and then worked rapidly backwards and forwards with \nleft\n right hand. Left hand holds chisel manipulated by big toe. Past Egyptian cafes full of \n\n21\/8\/15\n\nArabs sitting there playing backgammon. Past old mosque lit by gas floors heavily carpeted and doctors expounding Koran to groups around them. No admission on account of holy day. \n\nBought tarboush at stall. Seller wanted PI 20 but beat him down to PI 5.\n\nReturned by tram at 7 pm. Tea and then to Gordon House at 8.15 to meet J. Waited for a while as on day duty and did not come off until 8 o’clock. To Hotel and took gharry for obelisk after usual bargaining. Closed at 25 piastre. Had ideal drive in moonlight through Zeitoun and village between green irrigated fields of cotton and flax and dwellings. The villagers in groups singing, many lying\n\n 21\/8\/15\n\nasleep out in open. Reached obelisk and went for a walk after inspecting it through narrow paths between different plots. Delightful smell of greenery everywhere. The obelisk surrounded by trees and crops looking as fresh as if erected yesterday instead of 5000 years ago. The whole quiet peaceful scene so still in the moonlight was only 100 years ago the scene of a most bloody battle with about 70000 troops engaged. J very cut up about B’s approaching departure and ours seeing so much of casualties. inclined to worry. Looking very well in red. Returned to gharry and after another hours delightful drive reached hotel again. Souper a deux and\n\n21\/8\/15\n\nthen for a stroll and goodnight. \n\nTo Camp – great singing in native compound. One leader chanting first, the whole in unison repeating the same thing. And so to bed.\n","22":"\n\nReveille 6 Church parade 7. Very smart in helmets and new colours. Inspected afterwards with Major Smith. Met Curnow and walked down after breakfast to Moslem cemetery at Zeitoun. Vaults with side entrance all tombs with double tombstones. Infested with vultures.\n\nNo move to take place from here now for 10 days Mitchell transferred to Divisional signallers – a good batman lost. Interviewed several others but not impressed so far.\n\n22\/8\/15\n\nStayed in camp all day\n","23":"\n\nMitchell returned by Sig. Dec. DHQ as unsuitable most pleased. Busy - hear we are off on Friday. To HQ to see Field Cashier with other Adjutants. They are very comfortable there all white building. From window some idea obtainable of native life, women washing and general backdoor scenery of the better class civilian native.\n\nTo 24th After very hot walk. Two iced lagers!! Evening Platoon work\n\nIn Camp\n","24":" Battalion drill. Came into office. Busy preparing for departure all sorts of furpheys going round but apparently Friday the most popular day. Krozier finished painting forwarded it on to Melbne. A beastly dusty day with hot wind – the worst since leaving Broadmeadows. Everything filthy\n\n24\/8\/15\n\nCompanies on outposts in evening. Mess & so to bed\n","25":"\n\nLovely morning. Up & fell in parade. Bde. in artillery formations but came in again almost immediately.\n\nBusy all morning. More dust in afternoon. Made all arrangements for bivouac but found it cancelled. Went out to circular entrenchment round transport park and improved it. Returned early. Battalion came in after dark and the fours looked well swinging along to the band. Arrangements in connection with battle firing.\n","26":"\n\nBattle firing with ball ammunition. \n\nReveille 3.30. Moved whole battn. out at 4.45 fully equipped. Saw a tarboush exactly like the statues seen at museum same face features & c general line from tarboush to feet. Seeing\n\n26\/8\/15\n\nhim in the dusk gave one quite a start his silhouette startlingly like a statue of Rameses or someone else. It shows the type is still in existence and that the fine old race has handed down its features, at least, to these weaklings. To Pay office with Cpl De Boos.\n\nA misty morning, the second since arriving in Egypt and the only sign we have had of any moisture from the heavens. Much more mist this morning than previously. Just sufficient moisture to keep the dust from kicking up. A good Victorian downpour would wash \nthe\n places away that have stood for ages in this mild climate\n\nOn way to tram Basilica at head of street made most impressive view. On coming closer too many early morning\n\n26\/8\/15\n\nsmells to let one pay much attention to architecture. Large flock of goats with shepherds. Noticed most houses of any size with two doorkeepers. Native cafe full of niggers sucking hookahs. Native string band resting.\n\nPassed 23rd marching back to camp with bayonets fixed, splendid swing and splendid suntanned big men. Our Brigade has won its reputation of being Australia’s physical best. The survivors of so many medical examinations cannot have much wrong with them. The full lips & weak mouths and lack lustre debauched looking eyes of Egyptian tram passengers most striking. Among this better class even the amount of eye trouble most marked.\n\nCrowd of women (nunlike) at well carrying kerosene tins of water on the head balancing without any effort\n\n26\/8\/15\n\nCultivation & flocks among thick growth on irrigated land, palm trees occasionally. From canal masts of native boats just visible. \"A louer\" signs very frequent en route. Plenty of water wheels usually in small grove of large trees, with the unfortunate cow or bullock on its never ending journey \n\nBab el Hadid barracks garrisoned by Australians, built by Kitchener to dominate Rly station fortified no windows loopholes in masonry always in state of siege. Reached Pay office and then walked back to Bank. En route tried at chemist for rubber sponge for Major Smith am told all run out. At French place bought aluminium pocket cup. Round to Opera square and got sponge at Italian drougherie. Passing the shop was an albino \n\n26\/8\/15\n\napparently a European. Pure white hair and eyelids . Hat covering upper portion of face eyes closed. Saw very old Arab and his wife, poor old folk quite out of place among bustle and although so filthy apparently helping each other along. Old woman sat down in middle of street. \n\nThe street sellers busy this early morning, crying their wares the baskets carried on their heads. Fruit & vegetable (small marrows) &c and the fruit of the prickly pear. Some of the cries very musical. To newsagents before reaching \n\n Continental and a chat to Mimi. No Times London until tomorrow.\n\nThe shiek’s tomb & mosque at entrance to lower part of square seems quite out of place among all the modern buildings and bustle round about\n\n26\/8\/15\n\nThe buildings in this European quarter (round Bank &c) very fine and in many cases much more imposing than Melbourne. No trams makes the locality much more quiet. Passed the house Napoleon made his headquarters while in Cairo apparently used as a moslem’s residence now as their windows are concealed by the mouribisha woodwork now so rare. The woodwork a close screen the only opening being that in which the goolah is placed to be in the draught . In the garden of this place a very fine banyan tree its branches throwing roots down to the earth beneath. Passed motor ambulance with three English\n\n26\/8\/15\n\nnurses. Distinct glad eye. To National Bank of Egypt a fine bank much more capacious and substantial looking than the Anglo Egyptian The Govt bank & issue of notes. Changed pay into 175000 piastres in 50 P.I. notes. The clerks a much better class than the other Bank. Returned per gharry to tram. The cutting of the Khaliq done at old Cairo last night – a ceremony as old as time, handed down from the ages. The ceremony formerly involved human sacrifice but is now losing its significance as a festival. In Sharia saw mixup between donkey on footpath & one attached to watercart - much shrieking and yelling by drivers before disentangled and driven off \n\nBack to camp. Passed over desert through mess sheds. As soon as we were discerned by the men they gave three rousing cheers and continued for some time. Quite an ovation! Got company commanders and had pay issued within a quarter of an hour. Great excitement and many \"furpheys\". All tents ordered to be struck at 6 am tomorrow morning and returned to Ordnance. Have to see Brigadier at 6.30 pm tonight for further orders. A typical Egyptian day, very hot and enervating during the noonday till about 6\n\nSweat streaming off one in rivulets all clothes soaked through and sticky.\n\nEvening to Brigadier with C.O. reams of orders - all reinforcements to do musketry. Early mess and then hard at orders, rattled them out and arranged to take back balance of pay but no one came to light, too much of a rush. Interrupted a number of times by men wanting to get away with us. One Ryan from 7th Reinf walked all the way up when he heard we were off. He said he was signaller RAN and would give his life to come and pleaded very hard to come but it\n\n26\/8\/15\n\nwas no good as there was no vacancy. It was hard indeed to say \"No\". All having been paid today the argument of the Camp was exceptionally loud. Proud containers of 30 piastre worth of beer holding forth in all directions on the factual situation and other things. They are good chaps and after the spree (by tomorrow their money will have gone) are good as gold. Nichols ‘A’ along after doing 28 days with consequent loss of £ 7 pay, very\n\n26\/8\/15\n\ninjured in tone as he had only been allowed 4s\/2d for his fortnights work. How can a man keep his self respect on 4\/2 !!.\n\nSgt. P ------ giving evidence as to obscene language \"How could the relief keep from laughing Sir, Kiss me Sergeant\" he said and what sounded like sacriledge \"Lord J C who trod on my foot\".\n\nBed 11.10 pm. I have been going since 3.30 this morning without a break – a strenuous day indeed \n\n"}}