{"Document Name":{"0":"Diary_0200","1":"Diary_0200","2":"Diary_0200","3":"Diary_0200","4":"Diary_0200","5":"Diary_0200","6":"Diary_0200","7":"Diary_0200","8":"Diary_0200","9":"Diary_0200","10":"Diary_0200","11":"Diary_0200","12":"Diary_0200","13":"Diary_0200","14":"Diary_0200","15":"Diary_0200","16":"Diary_0200","17":"Diary_0200","18":"Diary_0200","19":"Diary_0200","20":"Diary_0200","21":"Diary_0200","22":"Diary_0200","23":"Diary_0200","24":"Diary_0200","25":"Diary_0200","26":"Diary_0200","27":"Diary_0200","28":"Diary_0200","29":"Diary_0200","30":"Diary_0200","31":"Diary_0200","32":"Diary_0200","33":"Diary_0200","34":"Diary_0200","35":"Diary_0200","36":"Diary_0200","37":"Diary_0200","38":"Diary_0200","39":"Diary_0200","40":"Diary_0200","41":"Diary_0200","42":"Diary_0200","43":"Diary_0200","44":"Diary_0200","45":"Diary_0200","46":"Diary_0200","47":"Diary_0200","48":"Diary_0200","49":"Diary_0200","50":"Diary_0200","51":"Diary_0200","52":"Diary_0200","53":"Diary_0200","54":"Diary_0200","55":"Diary_0200","56":"Diary_0200","57":"Diary_0200","58":"Diary_0200","59":"Diary_0200","60":"Diary_0200","61":"Diary_0200","62":"Diary_0200","63":"Diary_0200","64":"Diary_0200","65":"Diary_0200","66":"Diary_0200","67":"Diary_0200","68":"Diary_0200","69":"Diary_0200","70":"Diary_0200","71":"Diary_0200","72":"Diary_0200","73":"Diary_0200","74":"Diary_0200","75":"Diary_0200","76":"Diary_0200","77":"Diary_0200","78":"Diary_0200","79":"Diary_0200","80":"Diary_0200","81":"Diary_0200","82":"Diary_0200","83":"Diary_0200","84":"Diary_0200","85":"Diary_0200","86":"Diary_0200","87":"Diary_0200","88":"Diary_0200","89":"Diary_0200","90":"Diary_0200","91":"Diary_0200","92":"Diary_0200","93":"Diary_0200","94":"Diary_0200","95":"Diary_0200","96":"Diary_0200","97":"Diary_0200","98":"Diary_0200","99":"Diary_0200","100":"Diary_0200","101":"Diary_0200","102":"Diary_0200"},"Date":{"0":"unknown","1":1090.0,"2":1091.0,"3":1092.0,"4":1093.0,"5":1094.0,"6":1095.0,"7":1096.0,"8":1097.0,"9":1098.0,"10":1099.0,"11":1100.0,"12":1101.0,"13":1102.0,"14":1103.0,"15":1104.0,"16":1105.0,"17":1106.0,"18":1107.0,"19":1108.0,"20":1109.0,"21":1110.0,"22":1111.0,"23":1112.0,"24":1113.0,"25":1114.0,"26":1115.0,"27":1116.0,"28":1117.0,"29":1118.0,"30":1119.0,"31":1120.0,"32":1121.0,"33":1122.0,"34":1123.0,"35":1124.0,"36":1125.0,"37":1126.0,"38":1127.0,"39":1128.0,"40":1129.0,"41":1130.0,"42":1131.0,"43":1132.0,"44":1133.0,"45":1134.0,"46":1135.0,"47":1136.0,"48":1137.0,"49":1138.0,"50":1139.0,"51":1140.0,"52":1141.0,"53":1142.0,"54":1143.0,"55":1144.0,"56":1145.0,"57":1146.0,"58":1147.0,"59":1148.0,"60":1149.0,"61":1150.0,"62":1151.0,"63":1152.0,"64":1153.0,"65":1154.0,"66":1155.0,"67":1156.0,"68":1157.0,"69":1158.0,"70":1159.0,"71":1160.0,"72":1161.0,"73":1162.0,"74":1163.0,"75":1164.0,"76":1165.0,"77":1166.0,"78":1167.0,"79":1168.0,"80":1169.0,"81":1170.0,"82":1171.0,"83":1172.0,"84":1173.0,"85":1174.0,"86":1178.0,"87":1179.0,"88":1180.0,"89":1181.0,"90":1182.0,"91":1183.0,"92":1184.0,"93":1185.0,"94":1186.0,"95":1187.0,"96":1188.0,"97":1189.0,"98":1190.0,"99":1191.0,"100":1192.0,"101":1193.0,"102":1194.0},"Entry":{"0":"\n\n","1":" Wed 6\/16\n\nletters from Nell & Jack also papers from Syd yesterday Viv much better got his voice back again. The Boys are being knocked about in the Trenches. John had his two feet blown off got his knife out & cut one away & applied a ligature himself then had to wait hours to be taken out.\n","2":"\n\nSame old thing, no snow yet but cold enough for it. The Boys come out tomorrow night. Pay £2-0-9. deferred £17-10-0. Up to your waist in mud in the front line, can only go between support & front line at night. Grenadier Guards also 59th AIF marched out leaving wounded in dug outs one of the guards was rescued after 4 days this is dinkum. 59 Pioneers swear it is true they saw them.\n","3":"\n\n2nd division has gone out reduced to 1800 how are they going to keep this up. Raining to day, had to shift to dug-outs, beautiful, have to give up our Posies to others coming in why couldnt they take the dug-outs, seeing its only for one night, but this Batallion is run by all the others in the Brigade for instance our Boys have done 8 days in front line & supports right off, no others have done this & its not that they are any more fit. \n\nThe more I see of the Australians the more I am convinced that they are the most foul mouthed bragging, malingering crowd in this war all they think of is food, women, drink & to see who can curse the worst, my honest opinion is that they are mostly a damn lot of wastrels & cowards always talking of how to get to blighty or home & they expect to beat the huns with this material (I don’t think.) Pay 2-1-9, deferred 17-11-0 got sudden orders to Pack up & go another 2 miles towards the line 3 P.M. we are now at Delville Wood & the guns are going merrily, in dug-outs here about 4 ft high & 5 ft long. Only here two days I think. Sergt. Livingstone ill again, think he will go to blighty, if so I get his Job, hope so.\n","4":"\n\nOn fatigue, our Boys came out last night & a lovely time they had, getting fixed up in these rat holes mud & slush up to your knees. Our dug out dripping water all night, found myself lying in a Pool of it about 3 am. wonderful how the Rheumatism keeps off. Bread & \n\nnight got some Pioneers 3 killed 4 wounded & 3 shell shock. \n\nPay £2-2.9 deferred £17-12-0. \n\nRaining & miserable water dripping into the dug out. Blankets, coat & everything, wet. Had bread & milk for dinner. \n","5":"\n\nrained all night, water outside, just on a level with our dugout if it rains today must shift somewhere never seen anything like it mud & water everywhere, and bitterley cold. What they expect the Australians to do in this weather beats me. The Pioneers have been taken out of it, so ought we, in fact all of us & finish this dam war. I can see myself laid up with Rheumatism soon can feel it in my legs at night. \n\nBread, cheese & margarine to day. They are thinking of giving us gum-Boots at last. Can’t sleep for the cold and dampness.\n\nPay to day deferred £17-14-0 owing £2-4.9.\n\nits dark here at 4. & daylight about 7. am. We get our tea or dinner I suppose they call it about 4.30 or 5 we have no candles so imagine us at the only hot meal of the day, in the dark instead of giving it us at 12. when we only get tea & Bread & Jam & cheese if you can get it. \n\nA fellow shot himself in the foot either accident or otherwise & no wonder its enough to make us all shoot ourselves this pig’s life. No wonder the huns are wining & they are.\n","6":"\n\nPay £2-5-9. deferred £17-15-0. \n\nweather cleared last night & to day is fine & bright. \n\nour Planes were up early this morning & the usual gun fire started Later Fritz sent his up & things get merry none were brought down & fritz only hung on the edge as it where & then got for home. \n\nNo cigarette issue or Tobacco or Matches, the more uncomfortable you are at the front the less you get. \n\nthats because they give the QMs Job to boys same with the rum if the boy feels molified you get it when you should. If he feels a bit wet & and cold ‘Oh’ the morning will do or any old time. Men of 40 to 50 are kept in the ranks who would see the Job carried out & these young fellows are given the easy stay away from the line Jobs & this spells efficiency in the Australian Army, if it wasn’t for the wonderful spirits of the men don’t know what would happen. \n\nHaven’t had a bath for 2 months and am lousy feel like the dirtiest tramp I ever saw. Am told we are here for another 7 days. \n\n3 PM raining again. Livingstone gone to hospital again, am in charge, time they recognised me I think.\n","7":"\n\nSnow everywhere this morning must have been a heavy fall as the ground was covered several inches & this on top of the rain & mud its raining again now & we go into front line at 1. P.M our dug-out ringing wet, am lying in sandbags that ooze water wonder how long I’ll stand it Bread &Jam again one would think we were a lot of children they were feeding the men away back get their Bacon & stews etc & can buy anything else they want. Its a great army no doubt the water is about 3 inches from the entrance of our dug-out . Got 2 P\/Cd ago yesterday. Some shells got very close last night. \n\nPay £2-6-9 D. £17-16-0\n\nordered back to Thronnes Wood. The boys gone into Trenches again owing to the 53rd declared unfit by Dr. Pretty stiff I think.\n","8":"\n\nPut in a lovely night. Packed like sardines in a hut, had been turned out of several before we got this one had our Knees up near our chins all night. splashed about in the mud until dark before we were settled \n\nTheres no doubt the 55th is about the worst managed Bat in the line men are brought to a place & no accomodation provided, when you get there, are told to get in anywhere, & they say are we wining, I dont think\n\nA lot warmer this morning & the sun is trying to come out. \n\nHave had diarrhea for 3 days. \n\nMade a mistake in dates Pay now £2-5-9 deferred £17-15-0 \n\ncan’t eat anything goes through me as soon as I get it down had a piece of onion & small piece of Bread & margarine for dinner. \n\nAnother lot of the Boys off to England to day, wish I was. \n\nThe hut is full with men a dinner some standing others sitting on the floor in the mud, its wonderful how dirty one gets in his habits, we eat it now as well as sleep in it. \n\nAnother shift to another hut truly our man in charge ought to get his brains brushed\n","9":"\n\nshifted here in the dark as usual had all day to do it in but our man of brains thinks the night time the Proper time to send men floundering about in the mud we are back about ½ mile from the camp & have to walk there for our meals. Who says this isn’t high intelligence.\n\nPay 2=6-9. 17-16-0\n\nhave still got the diarrhea bad. \n\nShould be leaving here soon now thank God. 2 months of the Somme.\n","10":"\n\nAnother shift yesterday we are in a dug-out again & the rain drips all over us but that is nothing out of the common \n\nrained hard last night in fact it does nothing else here. Still got the diarrhea caused by wet feet etc. have not had dry feet for a month now some of the fellows haven’t even got sox & most have only the one Pair. thats their own fault however as we were issued with 3 Pairs some time ago \n\nOur Boys come out tonight then we go back for a spell. \n\nPay £2-7-9 £17-17-0\n","11":"\n\nCold with frost & ice. \n\nMen coming out Tomorrow then back 2 miles to Montauban another batch going to London to day. tried to snow at dinner time.\n\nNo letters for some time now. \n\nAm Alright again but Viv has got it now & looks played out think he will not stand it much longer. \n\nRumours that Austria has given up the struggle, hope so. \n\nSnowing 2 PM.\n","12":"\n\nMoving off this morning at 12. for Montauban \n\nPay £2-9-9. £17-19-0 \n\nfog & mud up to your knees.\n","13":"\n\nGot here Montauban about 2 oclock & the mud here is worse than Thronnes Wood, unsafe to get off the duck boards In huts so are dry. \n\nGot papers from Kate & Mrs Parsons. \n\nvery cold today \n\nPay £2-10.9 £18-0-0 \n\nHeavy gun fire last night must have been an attack \n\nLeave here in 3 days time for 3 weeks.\n\nA month on the Somme to day & our second visit hope its the last.\n\nViv very Poorly can’t eat & got diarrhea & generally broken up. Not much better, myself but must not let him see that.\n","14":" 19\/12\/6\n\nleft Montauban about 16.30 arrived here at Dernancourt about 2 Pm Pretty done up \n\nsnowing & cold \n\nViv anyhow, must see Dr. \n\nstay here two days then on again \n\non duty till 9 P.M.\n","15":"\n\nsnow frozen on the ground & a lovely morning \n\nhad a bath first for 2½ months feel grand.\n\nViv went to Dr exempt from duty hope he perks up now looks a bit better this morning. \n\nMoving off again tomorrow by Train I think \n\nPay now £2-12-9 deferred £18.2-0 \n","16":"\n\nRaining & as usual slushy mud & cold looks like snow, clouds very low & blowing hard.\n\nmove off tomorrow about 3 Kilos away, trip to england seems a long way off. \n\nViv still crook. \n\nPay £2-13-9. £18.3-0. \n\nread to day of the Caledonia being sunk & the Capt taken Prisoner this is the boat we came from Egypt in. in June last.\n","17":"\n\nUp at 6.30 Bks 7. off at 8. Buirre 9.30.\n\nRaining all the time wet through. Got Rheumatic feet bad expect it will mean hospital if not better soon. \n\nPay £2.14.9. 18.4.0 £. \n\nRain stopped & a fine afternoon, much better than last posi cleaner etc.\n\nHave to shave every day now. \n\nwill spend Xmas here & New Year at Rainneville.\n\nFunny thing about the Boats I have been in Oratava went down tilbury docks London, went to Westralia in her that trip. Elingamite went down 3 Kings NZ. came from W.A. in her New Caledonia from Egypt Here\n","18":"\n\nPaid 20 frs to day 14\/4 leaves me £2-1-5 deferred £18\/5\/-\n\nthis day 12 months ago went on board Suevic at Sydney what a difference in one year. There hot summer here blowing a gale & Rain now & then & cold snow soon I think.\n\nno letters for a month & Parcels missing.\n\nfull up of Police work will Join up Coy again I think & finish it. treated like dirt by bounders I wouldn’t know in civil life.\n","19":"\n\nRained all night \n\nThe Reinforcements got here at 11 P.M. no Blankets poor devils.\n\ngoing to have swagger dinner Tomorrow NCOs wait on us. \n\nNice & fine this morning \n\nChurch Parade Gen Birdwood came to see us yesterday. \n\nGot new Pr Boots about time, wet feet for a month\n\nXmas Eve what a contrast to last then suffering a recovery effects of send off on 22nd only Intoxicated twice since once at Heliopolis & once at Fleurbaix. not bad for 12 months. wonder where I shall be next Xmas. \n\nComforts funds being given out to day. special dinner tomorrow. 6.30 \n\nsitting round oil drum brazier got to go on duty at 7 to 9\n","20":"\n\nBlowing your whiskers off. Rained early but cleared a bit \n\nPromises to be a flat Xmas no parcels no letters for a month & very little from comfort funds. \n\nAlso great disatisfaction with our know all sergeant last night & the night before kept us out about 3½ hrs instead of two as we are supposed to do will make it hot for him if he is not careful, drunk whilst on duty is not the sort of thing for a sergeant to be found out in, its just spite & nothing else He’s an apology for a man anyhow. Never does a tap, marches round cookers all day or else sits round a brazier & comes out at 9 PM to put lights out. \n\nPay £2-3-5 £18.7-0 \n\nfinished up again at 10 P.M.\n","21":"\n\nXmas comforts not so bad after all Lollies, Tobacco, cigarettes, dates, Cake, cocoa, Roast beef & Vegt & Plum Pudding so did not do so bad\n\ndrill started to day at 7. AM. 9 to 12, 2 to 4 \n\nsuppose they are having good time in Sydney \n\nReported to Sergeant Livingstone at 9.10 PM., re lights found him incapable, hardly able to stand up told us to get home to bed. \n\nPeterson, Viv & I met him just before Tea he was then half seas over. \n\nHave had a bad time with my Tooth got the A,M.C man to put chloroform in it, am going to dentist tomorrow. \n\nPay £2-4-5. £18 5-0\n","22":"\n\nRained heavily last night, a heavy gun fire all day yesterday also last night. \n\nBeen to Dr go to dentist this morning. \n\nwonder how Sergeant feels.\n\nViv picking up again, the rest is doing him good \n\nTooth stopped aching but jaw swollen.\n\nPay. 2-5-5 £18.9.0\n\nReported at Sergeants Mess Sergeant Livingstone not there waited about till 9.25 then went to bed no one knew where he was Sgt. Major Hanson had not seen him either.\n\nGot Tooth out dentist said there was an absess under it nearly broke my Jaw Just as bad after getting it out as before \n\nquite light headed to night.\n","23":"\n\nface very much swollen and very tender had a nap in the afternoon have not slept for a week more than an hour a night, glad I got it out all the same.\n\nSergeant & Peterson seem on very friendly terms. Just what I suspected the other fellows no good & will want to be watched. \n\nSergeant turned up at 9 tonight to do duty first time for 3 days & nights & he gets 10\/6 a day for it. \n\ngot to bed at 9.30.\n","24":"\n\ndid not sleep all night, chats nearly drove me mad the place is lousy.\n\nThe General is inspecting this morning Viv had to go on Parade with A. Coy. \n\nRained nearly all night.\n\nPay due to day £2-7-5. 18.11-0 got Paid to day. 14\/4 Balance now £1-13-1.\n\nViv returned to his Coy by Livingston Couldn’t do this without the usual lie said he was claimed by the Sgt Major \n\nS.M. says he’s a Bl-dy Liar he did not claim him & could not if he wanted to\n\nsuppose I shall be the next, if so look out Livingstone I have a card for you\n","25":"\n\nViv with his company now dont know how he will get on fancy he wont last long & will soon be in hospital\n\nPay due £1-14.1 £18.12-0\n\nViv got skinful, Pissed on man lying in his bed, too dilly to light a match, just as well he has gone back to Coy.\n","26":"\n\nlooking like rain, church Parade \n\nSergeant down at 53rds Knows the Q.M there (Rum).\n\ngot New hat & Tunic yesterday thanks to Major Cowie \n\nSergeant tight again nearly so in the afternoon, he went to Albert for whiskey for Mess. dinner at night Signallers had ditto also officers high old time for them, miserable for us.\n","27":"\n\nNew Years Day, Holiday, Viv on fatigue a lot of drinks last night. Bag-Pipes etc & more comforts today.\n\nwonder if the war will finish this year. \n\nPay due £1-16-1. 18.14-0\n\nLivingstone drunk again, came to us at ¼ to 9 too sick to do any duty went to bed, wonder what he really has to do in his Job.\n","28":"\n\nhad four men on fatigue to look after this morning \n\nthe guns are giving fritz hell this morning. \n\nPay 1-17-1. £18. 15-0\n\nSergeant half drunk again last night did not appear at 9. had to go round on my own wonder what he gets 10\/6 a day for think I shall give up the Job\n","29":"\n\nWet & windy \n\nleaving here tomorrow 20 mile walk.\n\nletters from Nell &Jack 2 from Syd cards from Jack & Carol & a Parcel from Nell this morning \n\nWrote to Nell to day. \n\nSergeant drunk again fell down in the mud last night & did not know how he got home looks Pretty this morning, fingers all cut & doesn’t remember anything.\n","30":"\n\nup at 5.30 Bks 6.30 move off at 8. we did not leave till 10.30 \n\ngot to Franville at 12 caught Motor Bus part of the way.\n\noff again tomorrow 17 mile march to near Rainville. Rained all the way, wet through, awake all night chats. \n\nBig village this & untouched by huns. \n\nPay £1-19-1 £18-17-2\n\nSergeant cleared out as soon as he fixed us up in a billet still on the Booze \n\nViv went to Pont Remy to Rifle instruction school for 5 days. \n\nthink I will get another Job at next billet – coffee stalls etc, hope so fed up with this Job \n\nhave written to Nell but not Posted yet.\n","31":"\n\nup at 6. BK 6.30 moving off 8.30 \n\nSergeant & Pike both crook Pike very drunk last night. \n\nPay £2-0.1 £18-18-0 \n\nMarching 17 miles today 6 yesterday. \n\n4 P.M. Arrived here \nFranville\n Flesselles very tired & foot sore, all the men got here. Record. \n\ngetting that other Job tomorrow I think.\n","32":"\n\n16 months to day since I went into camp at Show ground. \n\nCold, Rained all night but fine today feels like snow \n\nthat other Job no good so must stick to Police after all worst luck.\n\nPay £2.1-1 £18-19-0. Amiens bombed last night by Taubes.\n","33":"\n\nNice & fine at last hope it remains so\n\nSergeant actually came out on duty last night at 8 PM. first time for months. \n\nChurch parade to day.\n\nPay £2-2.1. £19-0-0\n","34":"\n\nPay £2-3-1. 19-1-0 \n\ncold with sleet snow not far off \n\nhad a hot shower this morning & clean clothes stopped scratching for awhile, here for another fortnight I think. \n\nFootball match this afternoon. \n\nSergeant in one of his usual snaky moods again, did not appear to close up Pubs & did not see him at 9. so went to bed at 20 Past he came in later.\n","35":" \n\nSnowed during the night everything white this morning \n\nA new man joined us in Viv’s place. \n\nBapaume & Peronne are being bombarded we go in again in a few days (Friday) 2 Coy’s go Tomorrow our usual luck.\n","36":"\n\nMore Rain & snow bitterly cold, \n\ngetting another man for Police \n\nD. & C. Coys moved off this morning the rest of us go on Friday. \n\nThe Trenches are awful so they tell us. Pneumonia, fever & Trench feet have pulled out the 2nd division \n\nSergt on duty last night from 8 oclock & drill all day to day.\n\nhad best Tea since I joined the Army Roast Beef Bld & Bkd Potatoes & Turnips dish full\n\nPay 2-5-1 £19-3-0 Paid to day 14\/4 (20 francs)\n","37":"\n\nheavy frost, commenced to snow at 11.30 still at it 1-30 but very light, cold. \n\nPay to date due £1-10.9 – £19-4-0 \n\nsnowing hard when we went to bed. \n\nViv returned last night\n\nTwo letters & a Parcel for him still no letters for me.\n","38":"\n\nRained during the night so the foot of snow I expected was melted. \n\nPay 1-11-9 £19-5-0\n\nlooks like a day of rain, much milder \n\nnot going to the front to day. \n\nLobster, coffee Beer & Whiskey for supper tonight living high for once. \n\nSnowing.\n","39":"\n\nRain, Sleet & Snow bitterly cold, \n\ngoing back tomorrow by Train. \n\nGot 2 letters from Nell & Jack. They are thinking of going to hobart, let em. I wont. \n\nViv still in rest Hospital. \n\nPay £1-12-9. £19-6-0\n\nwrote to Maude & Nell not Posted, \n\nlast night in the Barn with the cows.\n","40":"\n\noff this morning, everything inches deep in snow a lovely sight & not so cold \n\nfunny getting to W.C. all covered with snow & falling thick the most uncomfortable 5 minutes I have Put in. This is the best fall in have seen. \n\nLast night a big fire near church about 10 P.M. \n\nGoing to Buire for 3 days then on to Road fatigue work for 10 days\n\nThe Boys are all out snowballing. \n\nPay 1-13-9 £19-7-0\n\nleft Flesselles at 12.30 arrived Buire at 3.30 about 22 miles. Passed through Amiens & Corbie Amiens bigger than I thought Corbie also large Town The snow in the Trees very beautiful \n\noff to the Front Tuesday morning.\n","41":"\n\ngetting New Gas Helmets & generally getting things fixed up expect there will be something doing this time\n\nViv with his Company again feet nearly right. Hope he comes out of it alright. \n\nGas drill this afternoon.\n\nPay £1-14-9. £19-8-0. \n\nGas Parade to day with New Helmets went through it alright. \n\nLiv & Pike gone to Flesselles for Prisoner. \n\nVery cold more snow coming. off again Tomorrow morning\n","42":"\n\noff to Fricourt up at 5.30 did not sleep all night, got Parcel & Papers. \n\nleft at about 10.30 got here 2 P.M. Guns & mud again\n","43":"\n\nSnow a foot deep on the ground this morning, last night freezing, a beautiful sight but when it thaws what ho. \n\nLivingstone not reported yet he & Pike on the drunk I expect.\n\ngoing farther up the line Tomorrow morning.\n\nPay £1-16-9 – £19-10-0. \n\nBoys hard at it snowballing & making snow-men not so cold now, but alter on we will catch it.\n","44":"\n\nSnow still deep on the ground, moving off at 12. for Adelaide Camp 2 weeks fatigue. \n\nPay 1-17-9 £19-11-0.\n\nLivingstone not reported yet attended C.Cs orders last night in his place. \n\nViv crook with diarrhea, looks Picture of misery wish he was at home out of this \n\nhe’s no more fit to be in the Army than Tony is God knows how he will end up, by the look of him he is soon due at the Hospital. \n\nRum issue first for a month. \n\nLeft here Sydney Camp for Adelaide Camp at 12.30 arrived Adelaide about 3 PM very tired carried full Pack with 2 Blankets. \n\nSnow everywhere the whole country white sweated like I would the hottest day in summer. \n\nGreat confusion when we got here a general mix up 55 & 56\n","45":"\n\nFreezing hard, ground like iron, snow hard, \n\nLivingstone & Pike returned with Prisoner \n\nthank the Lord for the sheds & Braziers\n\nwrote to Nell & Will. Viv in Hospital again\n\nPay £1-18-9 £19-12-0\n","46":"\n\nfreezing hard ground & Snow like iron \n\nhaving good spell these two days. The French are Pouring it in on our right. have been all day.\n\nPay £1-19-9 £19-13-0\n\nViv still in hospital. \n\nSent letters to Nell. Maude & Will. \n\nexpect to get away soon for London 31 went to day. \n\nfearfully cold & snow everywhere. \n\nOn duty till 8 P.M. \n\nhad some Rolled oats today Bought it & made it.\n","47":"\n\nstill frost bound & Bitterly cold how they stand it in the Trenches, God knows, only an Overcoat\n\nViv being sent to a Hospital today very weak best thing for him. \n\nPay 2-0-9 £19-14-0.\n","48":"\n\nstill frost bound & cold. \n\nViv still in Rest Hospital. Moving tomorrow they say. \n\nLivingstone in one of his usual stinking tempers.\n\nPay 2.1-9. £19-15-0 \n\nWrote to Carol & Jack, Syd, & Mrs Parsons. \n\nViv gone to Hospital looking very bad. \n\nName Taken for Blighty go this week hip-hip. \n\n2 P.M. snowing thick.\n","49":"\n\nvery heavy frost last night, country still white & the coldest yet. \n\nWent about 3 miles to see Viv & take him his things found he had been sent on, dont know how he will get them now should have taken them with him. \n\nGoing blighty on the 28th \n\nnot moving today \n\nmore Reinforcements coming in must be a stunt on soon.\n\nPay. 2-2-9. £19.16.0\n\n1 P.M. The water Taps are still frozen, cant get any water\n","50":"\n\nsame to day, frost on the snow five minutes in the air outside & you dont know if you have any hands or feet \n\nyesterday & to day sun shining but not enough power to melt the snow, wake up in the night shivering two Blankets & overcoat on all the same\n\nPay £2.3-9. £19.17-0. \n\nGetting near to my trip now. \n\nThe Australian Army has at last started to economise Boots, Tunics, sox, shirts, Boots etc are to be gathered up in future & will be allowed for to the Platoon that brings them in 2\/6 for Tunic, & so on down to sox 6d \n\nTerrific Bombardment been going on these last 3 or 4 days also Air fights 2 huns brought down yesterday. \n\nHaving fairly good time here this time, duty 2 hours a day. Canteen would be alright if not so bitterly cold.\n","51":"\n\nFine & cold snow still on the ground frozen \n\n3 more days, then for Blighty. \n\nCant sleep for chats & the cold. \n\nhave to get ice & melt in over the fire, no water, all the mains been frozen for four days.\n\nPay £2.4.9. £19-18.8. \n\nhuns very busy with their Taubes these last 2 days. Consequence they are shelling us only a little way from here. 11\" at that. Got about 12 Tommies yesterday working near our fellows. \n\nNo word from Viv he may have gone to Blighty.\n","52":"\n\nsame as yesterday frost more severe if any thing \n\ntwo more days, how they creep on. \n\nPay £2-5-9. £19-19-0.\n\n3 P.M. wind blowing hard & snow flying off the ground everything freezing have to cover up your ears or get them bitten off. \n\nOn duty tonight 2 hours 6 to 8 it will be lovely. \n\nHow I wish Tomorrow was Sunday.\n","53":"\n\nShifting camp to \nTronnes\n Bernafay Wood, awfully cold \n","54":" think I am going Blighty Tomorrow after all. Just my luck as usual. 12 oclock all leave cut out, curse it. I must be a Jonah & no mistake. \n\nTerrific Bombardment this morning at 5 our fellows must have gone over also they must have been nearly frozen God help those who were wounded. Guns still going like fury.\n\ngot Xmas Parcel from Comforts funds Tasmania nine came from Jeweller at Launceston a real good Parcel, all the Boys got one each also from Tasmania\n\nMontauban Brigade camp. the name of this Camp \n\n29th Div went over last night took 200 & 3 nearly got it still, great Bombardment going on.\n\nSunday 28\/1\/17\n\nArrived here \nTronnes\n Bernafay Wood Camp about 3.30 fearfully cold, draughty Hut & no coal or coke \n\nexpected to be called out last night as reinforcements for the 29th division as they started Big counter attack. The Artillery was sufficient so were let alone.\n\nThe coldest night I have put in, one of the windows was blown in Twice by the concussion from the guns & the wind nearly turned us into ice-men. glad to get up. Snow still on the ground & like salt all frozen. \n\nExpect to get away about Wednesday. \n\nMoved camp again from C to D. same place as last when here on our 2nd visit. \n\nBoys gone into the line to day. \n\nParty going to Blighty tomorrow wonder if I am in it.\n","55":"\n\nAm not going to day, Perhaps on the 4th.\n\nstill heavy frosts & fine. Snow still thick on the ground. \n\nPay. £2.8.9 £20.2.0. deferred. \n\nletter from Maude.\n","56":"\n\nWeather changing no sun & snow commencing to fall as if it was not cold enough already. \n\nFritz sent a lot of shells over us last night luckily they went some distance away \n\nMust write to Maude to day. No news of Viv yet \n\nmay not get away for two weeks now\n\nPay £2-9-9 £20.3-0 \n\nletters from Nell & Syd & Jack sent letter to Maude & Launceston Friend of the Xmas Box. \n\nSnowing hard 8 P.M.\n","57":"\n\nMore snow the frozen stuff covered up with fresh about 2 inches deep, very cold, on last night from 6 to 8 to day 7. to 9. am 1. to 3 pm 7. to 9 pm. \n\nsent letters away this morning\n\nPay £2-10-9 £20.4.0 deferred\n\nmore shells over last night 11 out of C. Coy wounded last night.\n","58":"\n\nnot so cold this morning looks like rain hope not. \n\nheard yesterday my ticket is made out so may leave on the 4th after-all.\n\nhad a shave & wash first for a week, all water frozen & no chance at fires, have very bad cold.\n\nPay £2-11-9. £20.5.0. \n\nNell & Boys in Hobart by this time. Furniture as good as gone I suppose no doubt she expects me to make good with my deferred Pay I don’t think.\n","59":"\n\nsame old thing snow still here & more coming \n\n53rd raided Fritz last night. \n\nletter from Maude last night & Papers from Mrs Parsons\n\nPay £2.12.9 £20.6.0\n","60":"\n\n9. am expecting to get away to day some time painful operation of shaving to be gone through\n\nheavy frost, big crowd back from blighty last night.\n\nPay 2-13-9. £20.7.0\n","61":"\n\nTerrific Bombardment last night went on for hours, must have been big advance. Still going strong 10. a.m. \n\nExpect to leave for Blighty today. \n\nPay 2.14.9. £20.8.0\n","62":"\n\nstill here, \n\nlast night an attack was made & a 2 mile front taken Guns Gee Whiz I guess there were some \n\nPoor Lieutenant Vogan died from his wounds one of the best fellows I have met over here a perfect gentleman God take him. A lot of boys getting wounded.\n\nPay 2-15-9 20-9-0\n","63":"\n\n600 Prisoners brought in yesterday, giving Fritz hell lately, going strong this morning (the Artillery). \n\nPay 2-16-9. 20.10.9\n","64":"\n\nbeen bitterly cold these last 3 days North wind blowing \n\nnothing important\n\nPay 2-17-9 £20.11-0\n\n ","65":"\n\nStill blowing cold, \n\nheavy firing all night & especially this morning . \n\nPaid to day 14\/4 20 francs leaves me £2.4.5, £20.12.0\n\nI change Trains at Kilmarnock for Prestwich. \n\nNot feeling too good got an awful cold & cant sleep. food up to Putty. \n\nhave not heard anything of Viv yet \n\n278 Reinforcements arrived today \n\nAm told that leave has started again might get to Blighty some day.\n","66":"\n\nHuns tried to get over last night but were blown to pieces, Bombardment awful.\n\nNot so cold today, got a change of clothes. \n\nexpect to be here till 20th of March now\n\nPay £2-5-5 £20.13-0 \n\nBoys going in.\n","67":"\n\nAnother win for the British on Sunday took Gandecourt an important village near Baupaume \n\nstraffing going on like old billy oh day & night\n\nnot so cold yesterday & today beautiful weather if the wind only died away but it cuts through anything. \n\nPay 2.6.5 £20.14.0. Expect to get leave on the 15th now.\n","68":"\n\nFritz tried dropping bombs on our light Railway this morning, but luckily hit ground with no one on it, had they (the 3 Bombs) fallen this side of Raily would have played the devil.\n\nA glorious day the sun getting warmer every day but very heavy frost, sat in the sun nearly all day just lovely\n\non duty 7 a.m. to 9. 2 pm to 4 8 P.M. to 10. we do 6 hours a day now \n\nPay 2.7.5 20.15.0\n","69":"\n\ncloudy & a little sleet this morning, \n\nleave nearly here now. am getting very impatient\n\nQuietest night I remember on the Somme our People must have been moving up the guns even now 10. a.m. theres hardly a gun fired. \n\nPay 2.8.5. £20.16.0\n","70":"\n\nA thaw has set in & its getting like the old Somme we knew, mud & mud, \n\nnothing of importance all day, Gas alarms at night Fritz put it over but it did not come our way. \n\nPay 2.9.5 £20.17.0\n\nSent to Brigade Head Quarters at 4 PM for special duty am quartered near Sugar Refinery controlling the Troops going in to the line. \n\nBitterly cold wind blowing went on duty 4.30 to 7. nearly frozen\n","71":"\n\nPut in an awful night had two blankets & coat but shivered all night the coldest I have felt yet, heavy frost.\n\nPay 2.10.5. £20.18.0\n\nJust been into what is left of a wood to get some for a fire. \n\nPlenty of shelling going on on both sides. \n\nEskimo Walk.\n\nGuillemont on the Right & Delville Wood left. nearly blown out about 3 oclock shell 6\" lodged about 10 yds from dug-out sent mud etc flying all over us, close touch. \n\nstill very cold Frosts & winds.\n","72":"\n\nSlept better last night got a lot of Bags to sleep on. Going out for wood this morning\n\nPay due £2.11.5 deferred £20.19.0\n\nhave no idea when going Blighty now, cant get any letters away either. \n\nIce 3 ft. thick in shell Holes\n\nThursday 15\/2\/17 Continued\n\nhave to get water, that is ice out of shell Holes, farther up, the other day Boys were getting water this way & Boiling it for their Tea, one of Fritz’s shells lobbed right in Shell Hole & unearthed 2 dead Tommies & one German. Hows that for a horror just imagine drinking that water. \n\nSun nice & warm today & the frozen ground is thawing so of course Plenty of mud. \n\n57th had a raid last night 2 killed & ½ doz wounded got 9 german Prisoners do not know how many dead. \n\nKeeping fritz on the jump. \n\nHeavy gun fire all day to day.\n","73":"\n\nTerrific explosion this morning one of our ammunition dumps blown up sounded like a thousand guns going off at once dont know how many killed & wounded\n\nOur Planes in great Nos the most I have seen this trip, time too, fritz had it all his own way, \n\nexpect to be here till the 26th March God knows when I will get leave now. \n\nGetting good food here & a comfortable dug-out so do not mind. \n\nTo day the big bombardment is supposed to start 4 days of it, so far there has been a lively time of it all the morning & fritz is blowing up our duck-boards on the way to the line \n\nPay 2.12.5. £21.0.0.\n","74":"\n\nFoggy & misty rain, good bye snow, sooner have the snow, the ground is mud again & getting like it was for our 1st & 2nd Trip here. Hope we soon get out of it now. \n\nThe weather don’t stop the guns & they are busy as usual Our Fellows are Bombing & Raiding fritz’s Trenches every night now & has him Jumpy\n\nPay 2.13.5. £21.1.0 \n\nwrote to Maude & Nell \nbut not posted yet\n \n\nforgot to say do my own cooking here been at it 5 days now\n","75":"\n\ndense fog all day yesterday could not see 50 yds away, ended in rain last night, found our dug-out flooded & had to pack up & shift at 11 PM. no sleep all night. Blankets & Waterproof sheet wet \n\nheavy firing all night. \n\nfog again this morning same as yesterday snow all gone & nearly all ice but mud, a regular sea of it.\n\nPay 2.14.5 £21.2.0\n\n56th came out tonight dead beat had a good raid 2 killed. took Prisoners £ killed a lot of huns\n","76":"\n\nRained a lot during the night foggy again this morning. The thaw in Properly nothing but mud now till spring \n\nFritz seems very jumpy so the boys say, food very poor all through the Army Aus & English. \n\nOught to get out of this front in 11 days \n\nsent Nell’s & Maudes letters yesterday.\n","77":"\n\nRaining & miserable water dripping in dug-out, also cold wind blowing, \n\nsame old routine nothing much in Artillery line last night too foggy that dense you could cut it with a knife.\n","78":"\n\nStill fog & slight Rain, not much artillery fighting, can’t see 50 yds away. \n\n54th going in tonight. \n\nPay. 2.17.5. £21.5.0\n","79":"\n\nGas alert again last night, same every night. \n\n55th went in last night to supports. \n\nfog & Rain today. \n\nArtillery busy. \n\nPay 2.18.5 £21.6.0\n","80":"\n\nsame as yesterday fog. very little gun firing \n\nPay 2.19.5 £21.7.0 \n\nCold & miserable.\n","81":"\n\nFrost this morning first for more than a week hope it continues & freezes the ground again anything better than the mud. \n\nCorp got drunk yesterday. \n\nOur shift now is 3 hrs 12 min on. \n\nstill foggy. \n\nPay. £3.0.5 £21.8.0 \n\nfearfully cold wind blowing.\n","82":"\n\nFrost & very cold with the usual fog very thick\n\nPulling dug out to pieces. suddenly discovered that it is too low, too wet & generally speaking up to Putty after being in it two weeks \"Oh these Officers\"\n\nPay £3.1.5 £21.9.0. \n\nbeautiful, clear sunny afternoon first for about a month. \n\nexpect plenty of Artillery duels tonight. \n\nletter from Viv, in hospital Southampton getting alright.\n\nBapaume evacuated by Huns also 4 Villages.\n","83":"\n\nfine & getting clear. rained a little in early hours \n\nwriting to Viv today.\n\nArtillery active last night Fritz sent about a doz close handy. \n\nPay £3.2.5 £21.10.0\n\nfirst touch of spring, Larks singing this morning & myriads of Birds about. sun quite warm when the clouds get out of the way getting cool in the evening.\n\nOur guns going all day. \n\nwrote to Viv & Posted it. \n\nGot duck-boards in our dug-out now changed to another dug-out to day. got Bosker fire quite compfy. \n","84":"\n\nA Beautiful Morning sun shining brightly but clouds coming up. \n\nOne of our Planes brought down yesterday Pilot killed, observer got off wounded, \n\nGun blown up last night 4 men killed 2 drivers & Horses got off \n\nPay £3.3.5 £21.11.0 \n\nArtillery going all night & still going fritz doing the same.\n\nContinued\n\nTuesday 27\/2\/17\n\nglorious fire tonight Petrol Tin, top cut off & tin Jabbed with Bayonette full of holes about 3 lbs coal rest damp chips etc, still do great. \n\ngreat artillery activity on both sides.\n","85":"\n\ndefinetly known that Fritz is retiring good luck to him may he keep it up. \n\nCloudy & cold at 5.30 am \n\nterrific barrage put up by us on the Right must have gone over. no news yet. Fritz sending a lot of Shells over here but doing no damage, \n\nhear that we dont go out till April now. \n\nPay 3.4.5. £21.12.0\n","86":"\n\nLetter from Syd saying Uncle George dead about the 5th Jany. left Loo & Maude Property but nothing to us Boys Uncle Jack gets the bulk.\n\nWrote Maude, Syd & Viv & Posted them\n\nfine & clear plenty of aircraft about & plenty of artillery tonight will be worse\n\nPay £3-5.5 21.13-0\n","87":"\n\n55th came out last night, going back to train for the big stunt coming off soon this will not be a healthy spot, when it does\n\ngot letters from Maude & Viv Maude did not know of legacy when she wrote it no mention of it. my letter will surprise her.\n\nsevere frost & fog this morning we get them together here very liberal in France tried hard to snow this afternoon sago fell for awhile \n\nPay £3.6.5 £21\/14\/0\n\nPosted letter to Loo to day mail goes out tomorrow for Ausi. \n\ndug-out fell in this morning lucky we were up or might have been killed one poor chap was, up in the trenches\n","88":"\n\nnothing doing much today, same old frost & fog & same old canons bellowing all day \n\nthink the 14th Brigade go over in 4 days time, Bapaume I fancy, we are about a mile from it now 3 more villages taken during last few days. \n\nNo word of leave yet. \n\nPay. 3.7.5 £21.15.6. \n\nGas Alarms twice, had us up with helmets on, creepy feeling waiting for gas, all ended alright.\n","89":"\n\nletter from Nell & Jack first since Jany 13\/17. 50 days. they left for Hobart on the 27 Jany, good luck to em, \n\nvery heavy fighting on the Right this morning & the Barrage terrific still going strong 11. a.m.\n\nPay 3.8.5 £21.16-0. hurrah Paid 100 francs 3-11-8 leaving me in debt 2\/3. what next.\n\none of our Planes came down on fire Just near us but only engine trouble too much petrol no one hurt.\n\nfighting on the Right still going on \n\n8. P.M. No rum issue sundays. \"ah. me\"\n\nBitterly cold wind blowing though fine\n","90":"\n\nSnow again about 1 ft deep winter all over again just as things were drying up. \n\nthink we go out in 11 days time \n\nowe 1\/3 deferred Pay £21.17.0.\n\nwrote to Nell at Hobart. \n\nfine again in the afternoon & snow melting. fine moonlight night. Fritz sending shells over us again.\n","91":"\n\nheavy shelling by fritz again this morning, bitterly cold wind blowing, 20 odd planes up, more snow coming \n\nowe 3d deferred £21-18.0.\n","92":"\n\nStill very cold wind blowing, snow nearly all gone again\n\nPlenty of air Battles yesterday 2 Fritz & one of ours down \n\nexpect to get out of here on the 20th now\n\nPay 9d deferred pay 21-19-0. \n\nwind changed to nearly North & like the Kaiser is a row \n\nmore snow coming\n\nJust done my two hours on & never felt the Cold any thing like it before & we thought winter was over, only just starting I think it will snow yards deep tonight.\n\nforgot to put down that I cook for myself here BK Porridge (I buy this) Bacon & steak, Tea, cocoa or coffee, Toast & Margarine & Jam Hows that But it wasnt always so, only since I came up here\n\nJust off sentry go 9. p.m. ground frozen at 4 pm wind blowing 70 miles an hour\n","93":"\n\ndid not snow last night but starting now 8. a.m wind the same north. \n\nbeen snowing all the morning just like our southerly busters only snow instead of dust wind over 80 miles a hour, can hardly walk against it, suppose they call this a blizzard. We call it something else.\n\nfritz bagged a lot of the 54th & some of the 56th & 55th \n\nhear there is another division being formed the 6th looks like the end of the war.\n\nGot bad cold on the chest & no wonder. \n\nPay 1\/9 deferred £22-0-0\n","94":"\n\nWind dropped last night, but at it again to day from the South & just as cold, no snow last night\n\nPay 2\/9 def £22.1.0\n\nbeen snowing all the morning all is white again just starting winter I think. \n\nA lot more of the 14th Brigade wiped out, heavy fighting going on now on our front. \n\n400 pm. Artillery duel terrific & snow falling thickly looks set in for to night.\n","95":"\n\ndid not snow last night, heavy fog, wind dropped much warmer this morning, snow thawing so mud again. \n\nPay 3\/9 £22.2.0 \n\nnot too well.\n","96":"\n\nfine at last, rained a little during the night.\n\n54th had a great number of casualties.\n\nPay 4\/9. £22.3-0.\n\nlooks like thunderstorm coming up, what price this climate 2 days ago Blizzard now spring weather\n","97":"\n\nletter & parcel from Maude yesterday in Uncles Will after all \n\nToo warm to last as I thought & it rained like hell during the night, was up with a Torch filling up holes in the roof with chunks of mud, got soaked.\n\nGuns still going all the same \n\nPay 5\/9. £22.4.0. \n\nit’s a lovely morning again, sun shining, stiff wind blowing but not cold, Spring is on us.\n\nTuesday 13\/3\/17\n\nNo rain last night, foggy today but clearing, \n\nletters from Nell & Jack 2. Tony 1. Viv 2. wrote to Maude.\n\nCapt Palmer killed yesterday dug-out blown in on him good soldier gone one of Australia’s best. \n\nViv tells me I got more than him, in legacy. \n\nPay 6\/9. £22.5.0\n\nCapt Chapman also missing expect he is gone \n\nthe 55 is losing most of their good officers.\n\nWednesday 14\/3\/17\n\nRained again last night & still raining. \n\nsome new guns opened up near us last night & kicked up a hell of a row. 6\" naval I think.\n\nPay 7\/9 £22.6.0. \n\nWrote to Viv & am writing to Nell\n\nRained all the morning & looks like plenty more\n\nguns going strong on both sides fritz sending them very close to here all day\n","98":"\n\nRain & mud, Cold wind from the North this morning, but it’s drying up the mud, Fritz’s artillery very active this morning.\n\nPay 8\/9 £22.7.0\n\nletter from Viv answered it & \nowe 20 francs\n. Says Nell has had her hair-dyed & & that Grace Box sent her £2.0 0 for Xmas Box very secretive about it never mentioned it herself.\n\nPaid 20 francs leaves me 5\/9 owining them.\n","99":"\n\nFrost & fog, lovely clear night last night. \n\nPosted letter to Nell, Viv & Maude \n\nowe","100":" deferred £22.8.0 \n\nno more news about going but leave is starting again I hear\n","101":"\n\nBeautiful Morning stiff breeze blowing & drying up the ground, \n\nArtillery very active the Big Push cant be far off now \n\nOwe","102":" deferred £22.9.0\n\n"}}