{"Document Name":{"0":"Diary_0214","1":"Diary_0214","2":"Diary_0214","3":"Diary_0214","4":"Diary_0214","5":"Diary_0214","6":"Diary_0214","7":"Diary_0214","8":"Diary_0214","9":"Diary_0214","10":"Diary_0214","11":"Diary_0214","12":"Diary_0214","13":"Diary_0214","14":"Diary_0214","15":"Diary_0214","16":"Diary_0214","17":"Diary_0214","18":"Diary_0214","19":"Diary_0214","20":"Diary_0214","21":"Diary_0214","22":"Diary_0214","23":"Diary_0214","24":"Diary_0214","25":"Diary_0214","26":"Diary_0214","27":"Diary_0214","28":"Diary_0214","29":"Diary_0214","30":"Diary_0214","31":"Diary_0214","32":"Diary_0214","33":"Diary_0214","34":"Diary_0214","35":"Diary_0214","36":"Diary_0214","37":"Diary_0214","38":"Diary_0214","39":"Diary_0214","40":"Diary_0214","41":"Diary_0214","42":"Diary_0214","43":"Diary_0214","44":"Diary_0214","45":"Diary_0214","46":"Diary_0214","47":"Diary_0214","48":"Diary_0214","49":"Diary_0214","50":"Diary_0214","51":"Diary_0214","52":"Diary_0214","53":"Diary_0214","54":"Diary_0214","55":"Diary_0214","56":"Diary_0214","57":"Diary_0214","58":"Diary_0214","59":"Diary_0214","60":"Diary_0214","61":"Diary_0214","62":"Diary_0214","63":"Diary_0214","64":"Diary_0214","65":"Diary_0214","66":"Diary_0214","67":"Diary_0214","68":"Diary_0214","69":"Diary_0214","70":"Diary_0214","71":"Diary_0214","72":"Diary_0214","73":"Diary_0214","74":"Diary_0214","75":"Diary_0214","76":"Diary_0214","77":"Diary_0214","78":"Diary_0214","79":"Diary_0214","80":"Diary_0214","81":"Diary_0214","82":"Diary_0214","83":"Diary_0214","84":"Diary_0214","85":"Diary_0214","86":"Diary_0214","87":"Diary_0214","88":"Diary_0214","89":"Diary_0214","90":"Diary_0214","91":"Diary_0214","92":"Diary_0214","93":"Diary_0214","94":"Diary_0214","95":"Diary_0214","96":"Diary_0214","97":"Diary_0214","98":"Diary_0214","99":"Diary_0214","100":"Diary_0214","101":"Diary_0214","102":"Diary_0214","103":"Diary_0214","104":"Diary_0214","105":"Diary_0214","106":"Diary_0214","107":"Diary_0214","108":"Diary_0214","109":"Diary_0214","110":"Diary_0214","111":"Diary_0214","112":"Diary_0214","113":"Diary_0214","114":"Diary_0214","115":"Diary_0214","116":"Diary_0214","117":"Diary_0214","118":"Diary_0214","119":"Diary_0214","120":"Diary_0214","121":"Diary_0214","122":"Diary_0214","123":"Diary_0214","124":"Diary_0214","125":"Diary_0214","126":"Diary_0214","127":"Diary_0214","128":"Diary_0214","129":"Diary_0214","130":"Diary_0214","131":"Diary_0214","132":"Diary_0214","133":"Diary_0214","134":"Diary_0214","135":"Diary_0214","136":"Diary_0214","137":"Diary_0214","138":"Diary_0214","139":"Diary_0214","140":"Diary_0214","141":"Diary_0214","142":"Diary_0214","143":"Diary_0214","144":"Diary_0214","145":"Diary_0214","146":"Diary_0214","147":"Diary_0214","148":"Diary_0214","149":"Diary_0214","150":"Diary_0214","151":"Diary_0214","152":"Diary_0214","153":"Diary_0214","154":"Diary_0214","155":"Diary_0214","156":"Diary_0214","157":"Diary_0214","158":"Diary_0214","159":"Diary_0214","160":"Diary_0214","161":"Diary_0214","162":"Diary_0214","163":"Diary_0214","164":"Diary_0214","165":"Diary_0214","166":"Diary_0214","167":"Diary_0214","168":"Diary_0214","169":"Diary_0214","170":"Diary_0214","171":"Diary_0214","172":"Diary_0214","173":"Diary_0214","174":"Diary_0214","175":"Diary_0214","176":"Diary_0214","177":"Diary_0214","178":"Diary_0214","179":"Diary_0214","180":"Diary_0214","181":"Diary_0214","182":"Diary_0214","183":"Diary_0214","184":"Diary_0214","185":"Diary_0214","186":"Diary_0214","187":"Diary_0214","188":"Diary_0214","189":"Diary_0214","190":"Diary_0214","191":"Diary_0214","192":"Diary_0214","193":"Diary_0214","194":"Diary_0214","195":"Diary_0214","196":"Diary_0214","197":"Diary_0214","198":"Diary_0214","199":"Diary_0214","200":"Diary_0214","201":"Diary_0214","202":"Diary_0214","203":"Diary_0214","204":"Diary_0214","205":"Diary_0214"},"Date":{"0":"unknown","1":1028.0,"2":1029.0,"3":1030.0,"4":1037.0,"5":1038.0,"6":1039.0,"7":1040.0,"8":1041.0,"9":1042.0,"10":1043.0,"11":1044.0,"12":1045.0,"13":1046.0,"14":1047.0,"15":1048.0,"16":1049.0,"17":1050.0,"18":1051.0,"19":1052.0,"20":1053.0,"21":1054.0,"22":1055.0,"23":1056.0,"24":1064.0,"25":1065.0,"26":1066.0,"27":1067.0,"28":1068.0,"29":1072.0,"30":1073.0,"31":1074.0,"32":1075.0,"33":1076.0,"34":1077.0,"35":1091.0,"36":1092.0,"37":1093.0,"38":1094.0,"39":1098.0,"40":1099.0,"41":1100.0,"42":1101.0,"43":1102.0,"44":1103.0,"45":1104.0,"46":1105.0,"47":1111.0,"48":1112.0,"49":1113.0,"50":1114.0,"51":1115.0,"52":1116.0,"53":1124.0,"54":1134.0,"55":1135.0,"56":1136.0,"57":1137.0,"58":1138.0,"59":1139.0,"60":1140.0,"61":1141.0,"62":1142.0,"63":1143.0,"64":1144.0,"65":1145.0,"66":1146.0,"67":1150.0,"68":1151.0,"69":1152.0,"70":1153.0,"71":1154.0,"72":1155.0,"73":1156.0,"74":1157.0,"75":1158.0,"76":1159.0,"77":1162.0,"78":1163.0,"79":1164.0,"80":1166.0,"81":1167.0,"82":1169.0,"83":1171.0,"84":1172.0,"85":1178.0,"86":1195.0,"87":1196.0,"88":1197.0,"89":1201.0,"90":1202.0,"91":1203.0,"92":1204.0,"93":1205.0,"94":1206.0,"95":1207.0,"96":1208.0,"97":1209.0,"98":1210.0,"99":1219.0,"100":1220.0,"101":1221.0,"102":1222.0,"103":1223.0,"104":1224.0,"105":1238.0,"106":1242.0,"107":1244.0,"108":1246.0,"109":1254.0,"110":1256.0,"111":1257.0,"112":1258.0,"113":1271.0,"114":1284.0,"115":1285.0,"116":1298.0,"117":1304.0,"118":1310.0,"119":1320.0,"120":1321.0,"121":1323.0,"122":1324.0,"123":1325.0,"124":1329.0,"125":1330.0,"126":1331.0,"127":1333.0,"128":1334.0,"129":1335.0,"130":1336.0,"131":1337.0,"132":1339.0,"133":1350.0,"134":1351.0,"135":1352.0,"136":1353.0,"137":1356.0,"138":1357.0,"139":1358.0,"140":1359.0,"141":1387.0,"142":1402.0,"143":1437.0,"144":1438.0,"145":1439.0,"146":1444.0,"147":1446.0,"148":1452.0,"149":1481.0,"150":1482.0,"151":1491.0,"152":1517.0,"153":1531.0,"154":1532.0,"155":1581.0,"156":1592.0,"157":1604.0,"158":1606.0,"159":1667.0,"160":1687.0,"161":1688.0,"162":1691.0,"163":1692.0,"164":1701.0,"165":1702.0,"166":1703.0,"167":1704.0,"168":1705.0,"169":1724.0,"170":1736.0,"171":1737.0,"172":1775.0,"173":1818.0,"174":1819.0,"175":1822.0,"176":1838.0,"177":1853.0,"178":1859.0,"179":1868.0,"180":1869.0,"181":1873.0,"182":1887.0,"183":1901.0,"184":1925.0,"185":1935.0,"186":2005.0,"187":2009.0,"188":2020.0,"189":2041.0,"190":2046.0,"191":2065.0,"192":2066.0,"193":2067.0,"194":2068.0,"195":2070.0,"196":2083.0,"197":2084.0,"198":2085.0,"199":2086.0,"200":2089.0,"201":2090.0,"202":2091.0,"203":2092.0,"204":2093.0,"205":2094.0},"Entry":{"0":"\n\nSydney. ","1":"\n\nLiverpool\nI left Liverpool Camp with the Reinforcements for the Show Grounds outside of which we had a review and were afterwards dismissed. I came home and said good-bye to mypeople and then went down to the Donohues andleft forthe Show Ground at 11.30pm.\n","2":" -Show Grounds Dalgetty's Wharf \"Ceramio\" \"Heads\"\nWe arrived at the Show Grounds at about 2a.m. and got ready to march to the boat. We arrived at Dalgetty's Wharf at 6a.m and went straight on to the boat where we were shown our quarters. I dumped my gear and ran up on deckand then the \"Ceramio\" moved out to the stream and I sawthe last of my friends. We were paid our last land pay and then settled down to ship life. We sailed out of the heads at 5p.m. and shortly after I gottobedtired out.\n","3":"\nWe had a good breakfast and then church. After church we had all sorts of games until bed time.\n","4":"\nYesterday we saw the last of Australia and we shipped into the Indian Ocean. I threw overboard bottles with messages in them whilst passing the Bite.\n","5":"\nAs there wasn't much to do all day I killed time in writing letters & playing cards. Got to bed at 10pm.\n\n\n\n\n","6":"\nWe have settled down to the monotony of life aboard ship and we have organised games for drill.\n","7":"\nWe saw a peculiar light in the sky and cannot make out what is can be, otherwise the same as yesterday.\n","8":"\nWe had a peculiar breakfast this morning cheese and pickles. We shipped from \"K\" deck to \"A\" deck.\n\nFriday","9":"\nWe had sports today all sorts of games and boxing.\n","10":"\nWe had to dress up full marching order and afterwards got our pay.\n\nSunday","11":"\nIt is getting very hot as we are nearing the tropics. The sea was smooth as glass.\n","12":"\nI mounted guard but there wasn't anything doing It's very warm with full dress on.\n","13":"\nI came off guard and had a shower bath it's nice and cool. I mucked about all day and had severalsleeps.\n","14":"\nI got sunburnt this morning as a result have been uncomfortable all day.\n\n\n\n\n\n\n","15":" - Durban.\nAt 3a.m. the rattle of anchor chains through the hawsepipewoke me up. Sleep was out of the question so I and Ron got up and went on deck. Later on we steamed into Durban harbour and berthed in the wharf. At 12p.m. we had a march through the town and were dismissed at 2:30p.m. We (Ron and I) had dinner and went for a stroll. Durban is a very pretty town and the people are very hospitable. We had tea and went to the pictureswe eventually got back to the boat and to bed by 11p.m.\n","16":"\nWe sneaked off the boat at 10a.m. and caught a tram to BulwerPark tram rides free. We then came back and went to the zoo. After looking at the the animals we came back to the Y.M.C.A. and met a young lady who invited us to tea. We hada evening and were sorry to leave.\n","17":"\nWe had the usual march and then steamed out of Durban with the best wishes for good luck from the white people. We left at 3:30p.m. and huggedthe coast to Capetown.\n","18":"\nWe had church parade and afterwards watched the coast. It is a very rugged coast.\n","19":"\nWe are nearing Capetown so are cleaning up our things in readiness for leave.\n","20":" Capetown\nWe are outside Capetown. The view is simply glorious. There are mountains all round and the clouds are driftinglazily over the tops. After the usual march Ron & I went to a cafe and had some dinner. We went to the museum where we met Mrs Newell and two other ladies with their kiddies. We had a splendid time and they took our photos. They left us and we had some tea after which we went piratingand hooked two tabbies. We went for a walk to the pier and then saw them home. we got back to the boat at 1am, tired out.\n","21":" \nWe had the march and came back to the boat. We left Capetown at 2pm but there weren't many people down at the wharf. We settled down to the usual monotonous routine. \n","22":" \nWe had some more sports today and incidently we are in theAtlantic Ocean.\n\n\n\n\n","23":"\nThere isn't anything to put down for a week\n","24":"\nA chap jumped overboard and delayed us two hours while they were looking for him. Mad as a rabbit. We are having a lifebelt drill and alarms come at any time now.\n","25":"\nEverything is just the same. Land was sighted this afternoon. I think it is the Cape Verde Islands\n","26":" St Vincents\nWe reached St Vincents at about 3pm and we soon had a crowd of bumboats around us also riggers would dive for coins and never miss bringing them up. We left at dusk and are going like anything.\n","27":"\nThe sea is changing its disposition its getting rough. Up till nowI haven't been sick.\n","28":"\nEverything is alright for three days\n","29":"Bay of Biscay\nWoke up at 3.am.with everything on the floor we are having very rough weather. You can't go on deck or you'll stand a good chance of being taken overboard. We played cards. I am 17 and 1 dayold. No fuss though.\n","30":"\nIt's very rough today, though strange to say I haven't been sick yet. Windy as anything.\n","31":" -Plymouth\nIts still rough but the wind has died down a lot we are nearing Plymouth\n","32":" -Dinton Fovant\nWe were up at 5.30am and had our blankets and hammocks rolled up and our kits packed ready for disembarking. It wasn't till 6pmwhen we got off the boat. We then caught the train to Dinton. We marched to Fovant camp and got to bed dog tired.\n","33":" -Fovant Wilts\nWe got up at 9am and had breakfast and then got our kit bags. Weslept nearly all day.\n","34":"\nDrilled all day and the same camp routine for 13 days.\n","35":"\nEverything the same to the","36":"\n\nThursday 14th December\n","37":" -Rollestone midnight\nI was one of 20 men for an advance guard to Rollestone camp. We marched to Dinton, where we unloaded a truck and loaded another. Then we got in the train and went to Amesbury. We\n\n\n\n\n\n\n\nunloaded the trucks and loaded up G.J. waggons. Then it came on to rain. We got in a waggon and were driven to Rollestone. I won't have another ride such as that one. We got to Rollestone at 12 midnight and got our hut. We, Ron and I turned in with another chap as no provision had been made for us.\n","38":"\nWe started drill again and its the same up to the","39":"\n","40":" -Amesbury, London, Waterloo, Bullddog Club\nWe lined up outside our huts and I received 16\/- as my leave. I paid back 2\/- I owed and my fare cost 7\/- leaving me with 7\/- We marched to Amesbury station and caught the train to London. We got to Waterloo at 1pm and walked around until weeventually found ourselves at the Bulldog Club where we booked beds for 3 nights. We had a game of billiards and thenwent to bed.\n","41":" -Edgeware Rd., Elephant & Castle, Peckham Rye, NunheadCamberwell\nWe got up at 9:30am and had a wash and breakfast and then started to look for Uncle Frank. We got the tube at Edgeware Rd, and got off at the Elephant and Castle where we caught a tram to Peckham Rye. I went to a post office but they told me to go to Nunhead. I was advised there to go to Camberwell Town Hall and as luck would have it one of the clerks\n\n\n\nremembered the name and gave me the address. I eventually arrived there at 3:30pm and Ron & I were given a royal welcome. We had something to eat and then Uncle and I went for a walk he on businessI on pleasure. There was a fog like pea-soup. We got home and into bed at 12pm.\n","42":"\nWe went round to Aunt Alice &Louis & Clara. They were surprised to see me. I &Uncle & Ron came back and had dinner and then I had a lie down & smoked. After tea some friends came in and we had an impromptu concert party. I got to bed at 12pm after having enjoyed myself.\n","43":"\nAfter breakfast Aunt Kate took Ron & I around to see Aunt Fran. She couldn't make enough of us and hugged me oh bonser. After staying for an hour or so Ron & I went to Clark & Sons where Frank works. He gave us a feed and then came round to Waterloo for we had to go back to camp. He left us & we played billiards went for a walk & lost our way & slept at a Y.M.C.A. and caught the early train back.\n\n\n","44":"\nWe caught the early 6:25am train home and after walking from Amesbury arrived in camp at 3pm where we reported ourselves back to the orderly room. We then went on guard. 8 prisoners out of 32 escaped its as cold as ice this guard.\n","45":"\nWe dismounted guard at 4pm & I got innoculated. I got to bed pretty early tired out.\n","46":"\nEverything the usual routine for 6 days.\n","47":" -Folkestone\nWe marched to Amesbury where we got on the train for Folkestone. We are going to France. We got to Folkestone pretty late and got our billets where we spent the night.\n","48":" -Calais, E Aaples\nWe got ready to catch the boat for Calais. Ours was a paddle wheeler. We got there without anything out of the ordinary happening and eventually caught the train for E Aáples. We arrived at E Aáples late tonight and slept in the dining hall.\n\n\n\n\n","49":"\nWe were given tents and after fixing ourselves up we marched to the stores and received our rifles and bayonets.\n","50":"\nDrilled all day. The tucker here is not too plentiful. Work \"bookoo\" hard.\n","51":"\nWent on church parade. Here endeth 1916.\n","52":"\nParades are the routine for 8 days.\n","53":"\nWe had a fall of snow today so we had a few snow fights during smoko. Bed early is the place.\n","54":"\nA big advance but nothing but monotony to write about. I became a follower of Christ on the","55":"\n","56":"\n\nWent on dental parade but bar waiting about all day nothing was done.\n","57":"\nExactly the same as yesterday.\n","58":"\nI got one tooth filled it took all day though.\n\n\n","59":"\nI had to go to the Bull Ring at last and learn to be a soldier but I came home? tired than when I started.\n","60":"\nWent on the Dental parade again but there was nothing done.\n","61":"\nI got another tooth filled today.\n","62":"\nI had to go to the Bull Ring again today.\n","63":"\nWe got our tin hats and other things prepatory to joining up the Batt.\n","64":"\nSame old drill on the same old rations\n","65":"\nWe got paid today so I & Ron had a good old feed at the Y.M.C.A.\n","66":"\nSame old drill again\n","67":"\nGot up at 6:30am & got everything ready. We marched to the station and entrained!\n\n\n\nAlbert\nWe proceeded very slowly to Albert where we camped in No 1 Anzac Rein. Camp. We'd hear the guns and seethe flashes.\n","68":" -Shelter Wood\nWe went for a walk through Albert this morning and saw the destruction the hun had caused. We got back and joined the Batt. which was at Shelter Wood. We were shown our huts and lost no time in getting to bed.\n","69":" ","70":"\n February\nWe had to","71":" miles for a bath which was certainly not worth the march.\n","72":" -Martinpuich\nWe marched 8 miles to the trenches near Martinpuich. The bayI was in (B.bay) was in supports so Ron and I got a dug-out & got to sleep.\n","73":"\nI woke up at 3am with the \"wind-up\" me Fritz started bombarding. I got to sleep about 5am and got up at 10am.\n\n\n","74":"\nThe hun was pretty quiet all day so after getting our rations at 7:30pm we proceeded to the front line. He sent a few whizz-bangs over and sniped with a machine-gun but never got any. We reached the front line at 11pm and stood to at once.\n","75":"\nIt is very quiet today but the No 24 post is getting some whizz-bangs.\n","76":" -Gunpit Alley\nWe were relieved at 10pm by the","77":" and after slipping,sliding and falling we reached the reserve lines at 3:30am three hours bucks heesh. We were glad to get to bed.\n","78":" -Villa Camp\nGot up 12 noon and got our rations. We had dinner and then a mob of us marched to Villa Camp where we stayed three days.\n","79":"\nWe shifted back to Shelter Wood and spent the night there.\n\n\n\nBayzieux\nWe marched to Bayzieux a place about 12 miles from Shelter Wood. Its a muddy, nasty and stinking hole. We got to bed early\n","80":"\nGot up at 8:30am and went to the Dr. He gave me no duty so I went and had a sleep.\n","81":" -Laveirville\nWent to Dr. Got no duty so went with the waggons to Lavierville and brought back the rations. I had a good feed at Lavierville. Thursday also.\n","82":"\nCame a \"gutser\" had to drill all day and tomorrow.\n","83":"\nWe had a route march this morning and I had a sleep this afternoon\n","84":"\nWe had parade every day now for 3 days.\n","85":" -Becourt\nWe packed up our kit and marched to Becourt a distance of about 10 miles. When we got our huts & blankets I was very glad to get to sleep.\n\n\n","86":"\nWe had a big day today for the past fortnight we have been doing drill starting from a recruit up to a solider. We have bombing today machine-gun firing and then our kitinspection and a medical inspection. We are joining the Batttomorrow so we packed up.\n","87":" -Bapaume Road, Grevillers\nMarched from Becourtalong the BapaumeRdto a ruined village called Grevillers wethe Batt is.we got our quarterswe had teaand then got to bed.\n","88":"\nGot up at 8a.m. and went on fatigueswe have to shift mud of which there is tons. We had a good days work.\n","89":"\nI joined the scouts today and am learning to be a signaller. I had a sit by the fire and then hopped into bed. 8 toa loaf of bread.\n\n\n\n\n\n\n","90":"\nWe packedup this afternoon and had tea and then held ourselves in readiness to move at a minutes notice.\n","91":" -Favreuil, Vaulx, Lagnicourt\nWe moved off at 3am up to trenches outside Favreuil. It started to rain and it made everything nice and slushy. After a whilewe shifted upto the support lines outside Vaulx where we made dugouts.That night we went across the fields to Lagnicourt. And didn't fritzsend em over.We had to get out and carry coils of barbed wire fagged out as we were up to the front line. We finished at 1am and then Ron and I found that somebody had pinched ourhome so we had to go and find it which we did at last and got to sleep sitting up.\n\n\n\n\n","92":" -Vaulx, Favreuil\nI woke up at 8a.m.cold as an iceberg and fixed up some breakfast for ourselves. Ron & I then hunted for things to fix up our dug-out and at last made it tres bonne, We then slept until about 2p.m. when we carried more barbed wire. We finished at 4.30p.m. & went to pack up our gear. We were relieved at 10 p.m. while theshells were crashing overhead. We got off with only a few wounded to the big building in Vaulx where we had hot tea &stew which was very welcome. We then marched on to Favreuil where we billeted in an old fritzhospital we soon settled down to sleep.\n","93":" -Bazentin\nGot up as cold as ice we only had ourcoats in which to sleep in. Had breakfast at 11.30a.m. We moved off at 1p.m. to Bazentin where we had two blankets.\n","94":" -Fricourt\nGot up and had an early breakfast. We marched to Fricourtand reached there in time for dinner. After dinner Ron went to the canteen & I cleaned our guns which were badly in need of it.\n\n\n\nI then had a wash first for 3 days& got to bed.\n","95":"\nWe had a kit inspection and an inspection of rifles & equipment. Needless to say my gear had Sommemud on it so I had to clean it off.\n","96":"\nWe had a gas helmet inspection this morning I met Fr. Burns this afternoon & had a good chin-wag to him.\n","97":"\nWe had the usual compulsory church parade and then set about to clean the rest of the mud off our clothes & gear. I wrote a couple of letters & got to bed.\n","98":"\nI was given instructions in the Lewis machine gun all day so slacked all day.\n","99":"\nWe stood-to to move up the line at a moments notice but the call never came so we went to bed.\n","100":" -Bapaume\nWe moved up to tentsoutside Bapaume. It rained all the way up and is still raining so the ground is slightly? muddy. However we were too tired to notice a little detail like that so got to sleep in the Y.M.C.A. marquee.\n","101":" -Noreuil\nWe fixed our equipment battle order and stacked our packsand at5p.m. we moved up to Noreuil. Going across a field under observation fritz started to tear it in so we lost no time in getting to the sunken road where we relieved the Batt. However everything went alright and we were asleep by 11p.m.\n","102":"\nI got up at 10a.m. and had something to eat fritz keeps an accompaniment with coal boxes and H E's. At 5p.m. we started to shift a dump of 36,000 bombs up to the front line. I carried 6 boxes (6 dozen bombs) in three trips and then we were dismissed so dropped off to sleep.\n\n\n\n\n","103":"\n\nSladiewoke me up at 6a.m. and I got up feeling that something was doing.. There was.. I helped to man the parapet and let loose three clips at 800 yds and had the satisfaction to see four drop. Shells were flying all over the place and the support lines were hell for some time. I was on the gun so had to move further up. Fritz was driven backfor we were too many for him and he lost hundreds of men. That night we shifted over to the other side of the village and dug ourselves in and got to sleep.\n","104":"\nWe went through the usual trench routine.\n","105":"\nAfter practising the stunt for a week or more and generally advertising it we moved up once more past Noreuil.\n","106":"\nAt about 3 a.m. we moved up to the sunken road at Noreiul. At 3.45 a.m. the barrage fired out with one appalling crash and everything was deafening. At about 4.30 we had to put our masks on slick for fritz put over some gas. After a while the wounded started to come in so as there wasn't anything we could do we shifted back to Vaulx.\n","107":"\nWe shifted back to Fricourt by the C & E.R.where we joined the Battn.\n","108":"\nI joined the signallers today. Nothing much to do.\n","109":"\nI went to the D.R.S.to see Ron but he had been evacuated to Blighty.\n","110":"\nWe marched to Senliswhere we stayed the night. I purchased a silk scarf.\n","111":"\nWe continued our march to Contay. Words cannotdescribe this vermin infested hole.\n","112":"\nWe had a muster parade this morning & some reinforcements came in. The heads decided to give us a half-day off.\n","113":"\nWe had a short march to witness a French mortar barrage it was \"bonne\". The whole of our stay here is one long grind of monotony and looking at my diary I cannot see anything of note.\n","114":" -Puchevillers, Achiet-le-Grande, Biefvillers\nPacked up and shook the dust of Contay off us (not so the vermin) and marched to Puchvillers where we entrained for Achiet-le-Grande. We detrained and marched to Biefvillers where we relieved the 60th Bn. After waiting for 3 hrs we were given our tents so we lost no time in getting to bed.\n","115":"\nWe had the usual old kit inspection to see who had dumped his greatcoat or ammunition and then I wentwith the Sigs.\n","116":"\nA storm came up and blew our tent down and wet everything. As our tent was s\nlightly\n ripped the officers? graciously\n\nconsented to our using one of their tents that happenedto be empty so we accordingly used it and stuck to it.\n","117":"\nTime flies. We attended a memorial service to the late Major Gen.Holmes. The service was very good. If half of the officers I know followed this mans example there would not be so many damned snobs.\n","118":" -Warlencourt,Bancourt, Beaulencourt, LuparkWood\nWe are doing practice stuntsnow and during our stay here we attacked? Beaulencourt, Bancourt, LuparkWood with great vigour. On each stuntI went to sleep.\n","119":" -Pozieres, Albert\nI was having breakfast bacon & eggs (I don't think) when I was given a pass to Amiens so I got away for my life. I caught a lorry to Pozieres and another one to Albert & eventually got to Amiens at noon. I had a wash and some lunch then mucked around looking at the sights. I bought some things & sent them home from Amiens. I caught the train back and got to bed at 11pm.\n\n\n","120":"\nI was inoculated again this morning and had the day off. Nothing to do and plenty of time to do it in so I done it.\n","121":" -Bancourt\nAt about 7p.m. we fell in and marched to Bancourt. We had a rest until 2a.m.\n","122":"\nWe fell in after a drink of coffee at 2a.m. and had an unsuccessful lookfor a dump which we were supposed to guard against fritz. Not finding it we were marched up a bit more and had another lie down. At 5a.m. we marched in single file to the hopping off line but instead of hopping over we sat down and smoked till about 8a.m. when we joined the rest of the Bn & had breakfast. We marched back to camp and I slept through dinner.\n","123":"\nWe had a foot inspection by the quack & I also got my wool off. We had a bath parade so I went to the cinema in Bapaume. They (the pictures) were tres bonne.\n\n\n","124":" -Miraumont, St Omer\nWe packed up our cleaned the camp out and after dinner we marched about 14 miles to the railway station near Miraumont. When we slipped our packs off I went down to a stream near by and had a bath then came back & had tea. We entrained at about 8p.m. for St Omer.\n","125":" -Arques\nI must have dozed off for I woke up with an uncomfortabe bumping going on. I fixed myself up with some breakfast and then sat down at the open side of the truck. The scenery as we passed was beautiful and worth seeing. We arrived at St Omer and marched to the village called Arques. It is about 4 Kilos from St Omer.I had some tea & laid down on the straw in the billets & went to sleep.\n","126":"\nWoke up fully dressed and was surprised to see that I hadn't undress-\n\nAlquines\ned overnight. Anyhow we had a marchthis morning and prepared ourselves for the regular old routine. Except for some days when we had bathing parades down the lagoon nothing else occurred that could be reported. Every other day we had practice stunts for wood fighting and Alquines.\n","127":"\nGot up at 4.45a.m.and rolled the blankets into bundles of ten & then put our packswith them outside our billets. Then we fell in and started for Alquines. The fifteen miles at first was rotten and the last five miles (not Kilos) we (No 7 platoon) finished up fresh as daisies. We started a whistlers band. We got to bed early nevertheless.\n","128":"\nWe fell in with our waterproofs on for its raining hard & went for a five mile march. There was no parade this afternoon so we played cards till bed time.\n","129":"\nWe were paid today but wecan't get tobacco of any description and there's no issue. This place is the worst I've been in& I've been in some rotten places.\n\n\n\n \n\n","130":"\nWe went for a small march this morning (10 miles) and had our dinner with us. This afternoon we had organised games and then marched home? again.\n","131":" -Fromentil\nWe marched to Fromentil and carried out a practice stunt for wood fighting.\n","132":"\nPacked up and marched for 3 miles with it up. We then dumped our packs and marched back to Arques. Got to bed fully dressed.\n","133":"\nI was told to pack my gear up as I was leaving for the Base. I got my forwarding papers at Bde Hq.& walked to St Omer. I got on the train at 12.30p.m. and had my dinner aboard. I played dominoes with some tommies till I dropped off to sleep.\n","134":" -Harfleur, Le Havre\nWe pulled up at Harfleur station & I got out and walked to the base at Le Havre where I met J.Quigley. He got me some dinner & a couple of blankets so I had a sleep.\n\n\n","135":"\nI was warned for guard soat 6p.m. we fell in & marched about 8 miles to No39.G.H where we mounted guard.\n","136":"\nWe came off the Hospital& marched back to camp. The guard was a sweet one. 2 on & about 20 hrs off. The march was the worst part of it. We had supper when we got back.\n","137":"","138":" Thur. & Friday I was on fatigues today I am on guard. At 10a.m. I was taken off guard and handed all my kit in. After dinner I went with the draft and boarded the train at about 1a.m.\n","139":" -Rouen\nI reported myself to the O.R.at the No.1 A.G.H at Rouenand then went to a tent &had a sleep till 3p.m. I then got a mattress & some blankets.\n","140":"\nI was put on Section 3 as a general\n\n\n\norderly. The work at first for the first week was interesting but after that it soon gotmonotonous. Rouen is a prettybig town with the River Seine running through the centre. There are plenty of hills round about and the view as seen from the top of the cathedral is tres bonne. During the first fortnight I had my photo taken but needless to say they turned out rotten.\n","141":"\nMy mate having gone to Blighty for 14 days leave I was told to actas nursing orderly. I have to sponge of couple of patients beside other work. Its not a bad job if you get a chap who is a good general orderly. The chap with me is not up to much but I tell him to do it & he accordingly does it.\n","142":"\nThere is not much to do today so I am having a sit down. During my stay here I have become an expert at stretcher-bearing for there is plenty of it to do when a convoy comes in or an evacuation goes out. Its not bad in the day time\n\nbut when you have to get up at 1a.m.and do it its no joke. It has been raining for close on a week now and I think the winter is going to set in. Nights are cold and mornings colder.\n","143":"\nAt about midnight I was assailed with shooting pains in the head and legs a violent headache and dizziness I was admitted into hospital that night and passed a very restless night.\n","144":"\nI was very bad today and could eat nothing all day.\n","145":"\nA lot better today. Four days later I got up.\n","146":"\nI was up today when I had another bad attack touched nothing all the next day.\n","147":"\nA lot better today four days later I got up & two days after I was discharged to day duty\n\n\n\n\n","148":"\nI was put on Sec. 5. and everything went alright till\n","149":"\nI could hardly walk with pains in my feet. I was put off duty.\n","150":"\nI went on sick parade & was given ten days light duties in the Post Office. It isall writing up and the time passed all too soon.\n","151":"\nI was put on Sec 12 a heavy surgical ward and I didn't do too badly now & then my feettroubled me.\n","152":"\nI was admitted into hospital with strained sinews of the feet and I had a good rest until the","153":" when I was discharged.\n","154":"\nI reported to the General duty N.C.O. and was given a job wheeling\n\nbarrow loads of sifted ashes until 12 noon when I got changed and after dinner went to town. I came back and wrote some letters & got to bed.\n","155":"\nThe convoys of gassed patients began to arrive and we were kept busy for a week then wounded from the push began to arrive and today the","156":" is pretty slack.Nothing but convoys & evacs for nearly a fortnight.\n","157":"\nI worked right through until 8p.m. & was warned for night duty to start at 12p.m. I started at 2a.m. on Hut 5 very heavy surgical cases.\n","158":"\nWas put on Section 4 till 11p.m. then Hut 5 till 6a.m. then Hut 3 till knock-off then came down to the tent & had a sleep. Got up at 4.30p.m. had tea & a bath & prepared for work.\n","159":"\nI have finished night duty and am put back on Sec. 5. I here we are having an easy time.\n","160":"\nI have been warned for Blighty leave tomorrow.\n","161":"\nWe left Rouen at 8p.m. passing through Etaples where we got off and waited 4 hrs for a train. Caught the train and got off a couple of miles outside Boulogne and had some dinner and caught the boat for Blighty and got there at 2p.m.& Horseferry Rd 7p.m After I went to Peckham.\n","162":"\nLeft for Glasgow at 10.00pm\n","163":"\nArrived in Pollock St.,at 9.a.m. and saw Jack that afternoon.\n","164":"\nLeft Glasgow after a good holiday there and got to Peckham 10a.m. next morning.\n","165":"\nAfter breakfast had a sleep. Was disgusted with the company.\n","166":"\nGot to Victoria Stat 6a.m & got train at 8am & got to Folkestone where we crossed to Boulogne. I stayed here till 8pm when we caught the train for Paris.\n","167":"\nGot to Paris at 7.30am & had a look at the Place de la Concorde Champs d'Elysees Boulevarde des Italiens& the Opera house. Caught Rouen train at 11a. & got to Rouen at 4.00p.m. and the camp at 5p.m. got to bed early.\n","168":"\nWas put on Sec 1and had\n\n\n\n\n\na fairly busy time there.\n","169":"\nWas shifted to Sec.12and have been going strong ever since.\n","170":"\nRicked ankle carrying stretchers and got three days light duty working in O.T. watchingoperations. Have up to date written to everybody.\n","171":"\nI was put on night duty on Hut 3 where there are some very bad cases. I worked here for 12\n\nnights when I contracted septic poisoning so I was admitted into hospital.\n","172":"\nI was discharged and put on Section 4 night duty. This ward is one of the heaviest medical wards all broncho- pnuemonia patients I had 16 deaths in 9 nights. At last my nerves would not stand it and on","173":" was\n\nput off.\n","174":"\nRouen is going mad over the signing of the Armistice. I went into town at 3pm but came back at 7pm as there were too many crowds and went on duty at 8pm.\n","175":"\nWe have ceased to admit convoys and are rapidly discharging all patients for we are closing the hospital.\n","176":"\nWe are cleaning up the camp and taking materials down to Ordinance. Everybody's working hard to get it cleaned up for we are anxious to get to Blighty.\n","177":"\nWe had our Xmas dinner and everybody is enjoying themselves. I am on night duty in the Orderly Room as telephone clerk. No calls have come so far.\n\n\n\n\n","178":"\nAt 12 midnight some of the boys brought the fire bell outside the huts and heralded in the New Year so everyone in our unit sawthe Old Year out.\n","179":"\nWe packed up and marched to the River where we embarked on the \"Karnak\" where we stayed the night.\n","180":"\nWe steamed down the Seine and one will go far to see more prettier natural scenery. We got to Southampton the next morning early and in the evening we entrained for Warminster where ambulances took us to the hospital.\n","181":"\nI was put on duty on one of the german wards. The huns do all the work while we see that it is done. I stayed here for a fortnight.\n","182":"\nI was put on the telephone for a fortnight. Sweet job.\n","183":"\nAfter a weekin the Orderly Room I was put on Ward 3 night duty. I had 3 weeks here and then was put in the Q.M's office.\n","184":"\nI only had 10 days here when I was put in the Ration Store owing to one of the men being sent home. Lucky beggar.\n","185":"\nI started in the Ration Store and although hard work it ismore to my taste. I remained here until","186":" when I said goodbye to the A.G.Hand to Hovant.\n","187":"\nI was paid and wasted no time in getting to Waterloo. Having booked rooms at Faulkners\n\nHotel. I &a cobber went and had a look around. Two days later I left for Northampton where I had an enjoyable 9 days.\n","188":"\nI went back to Havant and a week later I was put on a boat roll. Ye gods I am nearly home.\n","189":"\nWe left Havant and after staying the night in London we embarked on the \"Karmala\" of 1200 tons. Later we left for Devonport where we picked up the troops.\n","190":"\nGood-bye Blighty - we steamed out at about 3pm.\n","191":"\nWe berthed at Capetown. In the evening I went to Woodstock to see some friends but was disappointed as they were at Kimberley.\n","192":"\nI and a friend wentto town\n\nand had a general look around. We went to the Tivoli in the evening and saw a first rate show.\n","193":"\nI was on duty in the wards all day.\n","194":"\nWe went to the Museum this afternoon and afterwards we were shown over the United Tobacco Company's works where we saw cigarettes and tobacco in the making.\n","195":"\nWe left Cape Town today and had a very enjoyable trip to Fremantle which we reached on 8thAug..\n","196":" the","197":"\nHaving obtained leave from the ship I went to Subiaco where having met my friends I stayed the night and arrived back on board in time for duty.\n","198":"\nI spent the morning on duty and this afternoon at Subiaco. Arrived on board at 7pm.\n","199":"\nWe steamed from Fremantle today and had a good trip to Adelaide which we reached 3 days later.\n","200":"\nWe arrived in the outer harbour today but could not berth until the","201":"\n","202":" \nHaving obtained leave we went to Adelaide a very nicely situated town and had a look over the Art Gallery and different places of interest returning on board at 10pm.\n","203":"\nWe left Adelaide at 3pm and arrived in Melbourne at about 4pm on the","204":" We entrained\n\non the wharf and started for home.\n","205":"\nAt 3pm we arrived at Sydney platform and were driven in cars to the Anzac Buffet where I was welcomed back by my people. After fixing up my papers I was driven home where I saw my Mother. There ends my diary.\n\n\n\n \n\n"}}