{"Document Name":{"0":"Diary_0501","1":"Diary_0501","2":"Diary_0501","3":"Diary_0501","4":"Diary_0501","5":"Diary_0501","6":"Diary_0501","7":"Diary_0501","8":"Diary_0501","9":"Diary_0501","10":"Diary_0501","11":"Diary_0501","12":"Diary_0501","13":"Diary_0501","14":"Diary_0501","15":"Diary_0501","16":"Diary_0501","17":"Diary_0501","18":"Diary_0501","19":"Diary_0501","20":"Diary_0501","21":"Diary_0501","22":"Diary_0501","23":"Diary_0501","24":"Diary_0501","25":"Diary_0501","26":"Diary_0501","27":"Diary_0501","28":"Diary_0501","29":"Diary_0501","30":"Diary_0501","31":"Diary_0501","32":"Diary_0501","33":"Diary_0501","34":"Diary_0501","35":"Diary_0501","36":"Diary_0501","37":"Diary_0501","38":"Diary_0501","39":"Diary_0501","40":"Diary_0501","41":"Diary_0501","42":"Diary_0501","43":"Diary_0501","44":"Diary_0501","45":"Diary_0501","46":"Diary_0501","47":"Diary_0501","48":"Diary_0501","49":"Diary_0501","50":"Diary_0501","51":"Diary_0501","52":"Diary_0501","53":"Diary_0501","54":"Diary_0501","55":"Diary_0501","56":"Diary_0501","57":"Diary_0501","58":"Diary_0501","59":"Diary_0501","60":"Diary_0501","61":"Diary_0501","62":"Diary_0501","63":"Diary_0501","64":"Diary_0501","65":"Diary_0501","66":"Diary_0501","67":"Diary_0501","68":"Diary_0501","69":"Diary_0501","70":"Diary_0501","71":"Diary_0501","72":"Diary_0501","73":"Diary_0501","74":"Diary_0501"},"Date":{"0":"unknown","1":1851.0,"2":1852.0,"3":1853.0,"4":1854.0,"5":1855.0,"6":1856.0,"7":1857.0,"8":1858.0,"9":1859.0,"10":1860.0,"11":1861.0,"12":1862.0,"13":1863.0,"14":1864.0,"15":1866.0,"16":1867.0,"17":1868.0,"18":1869.0,"19":1870.0,"20":1871.0,"21":1872.0,"22":1873.0,"23":1874.0,"24":1875.0,"25":1876.0,"26":1877.0,"27":1878.0,"28":1879.0,"29":1880.0,"30":1881.0,"31":1882.0,"32":1883.0,"33":1884.0,"34":1885.0,"35":1887.0,"36":1888.0,"37":1889.0,"38":1890.0,"39":1891.0,"40":1892.0,"41":1893.0,"42":1894.0,"43":1895.0,"44":1896.0,"45":1897.0,"46":1898.0,"47":1899.0,"48":1900.0,"49":1901.0,"50":1902.0,"51":1903.0,"52":1904.0,"53":1905.0,"54":1906.0,"55":1907.0,"56":1908.0,"57":1909.0,"58":1910.0,"59":1911.0,"60":1912.0,"61":1913.0,"62":1914.0,"63":1915.0,"64":1918.0,"65":1922.0,"66":1923.0,"67":1924.0,"68":1925.0,"69":1926.0,"70":1927.0,"71":1928.0,"72":1929.0,"73":1930.0,"74":1931.0},"Entry":{"0":"\n\n \n\n","1":" Gourdinne\n\nHad all the company commanders up at 9 a.m. and discussed some points of discipline and some details of Demobilization and Repatriation. This morning all are busily engaged blancoing their equipments and we also have a number of working parties out. A coal dump with a slack guard was found and the result is that today all our transport has been busily carting coal from it to us the whole day long. Xmas dinners are calling for a very great deal of work. There are potatoes and flour and a thousand varieties of Canteen goods to be bought. In Charleroi we managed to get hold of all the crockery we needed for the occasion. Something round about 200 sets in all. Officers scouting all round the countryside trying to get more.\n\n \n\n23\/12\/18 Gourdinne\n\nThe little Keithlet has done wonders today bargaining in French with farmers and generally fixing things up. The weather extremely cold and showery. Towards the evening we had a fine lot of canteen stuff come in and also drew our Xmas puddings.\n","2":"\n\nA fine day at 10.30 all available men lined up in the square to bid farewell to our 1915 quota of old battlers whom I shook by the hand individually and then the band played “Auld Lang Syne\" after the crowd had given three hearty cheers. In a G.S. wagon our gallant batch then went over to Nallines . Mounted my chestnut and rode over there too meeting General Robertson at BdeH.Q. We then walked down to a ground where most of the Bde was formed up.\n\n \n\n24\/12\/18 Gourdinne\n\nAfter practising the General Salute and being photographed several times, the Prince of Wales arrived with Sir J.T. Hobbs and others. A small pallid youth with a soft petulant face devoid of firmness. He slouched round the ranks shook hands with me and asked where the Battalion was billetted. He then pinned on some medals and took the march past. Back to Gourdinne and wrote all the afternoon. Great ceremony when our guard changed over band &c. Went to “C\" Coys dinner at 5.30 and the General & BM McCall came in. To “D\" Coys dinner which was better. Crowds of civilians came in – a great event with them. Made a speech and then slipped away. Tonight is dark and a little powdery snow – the first of the season – is falling.\n\n \n","3":" Gourdinne\n\nAwakened by the strains of our band playing Xmas carols. The snow of last night was still lying on the ground in patches but the day turned out finer later on. The day was observed as a close holiday. We are making a good many new improvements round the village. Our changing of the guard called out a big crowd again today. The people at my billet made me a present of a box of sweets & signed a card with all their names on it. Went to A & B Coy’s dinners which were splendid. All the chaps were in great form. I made two speeches signed hundreds of autographs and then returned to my billet. The sound of roisterers going home gave the streets a merry ring. Everyone was in the very best of good humours tonight.\n\n \n\n26\/12\/18 Gourdinne\n\nA fine Boxing Day which was observed by us as a holiday. I made the rounds of billets and found them fairly good save for a lot of tins lying around. Brigade Major came in and joined in the inspection. Afternoon we were beaten by the 24th Battalion at football. Heard today that 1st and","4":" Divisions are to go to Germany accompanied by DA’s of other units but that no move is likely from here for another month yet. Attended HQ. dinner. They had the barn tastefully decorated and all the mademoiselles of the village were waiting on the tables. Rode over to Bde, dined in their mess and made a couple of speeches.\n\n \n","5":" Gourdinne\n\nPiercingly cold day. Did a short round of the billets and heavily strafed a lot of people being in an ill humour. Our cleanliness and general sanitation is bad in the extreme. From today I fancy that it will be very much better. Afternoon was too cold for sports so spent it indoors reading. Orchestra played at mess in the evening.\n","6":"\n\nSteady rain falling all day. Made an inspection of the lines of “A\" Coy and of HQ. this morning. The General, Staff & Colonel James came to our mess dinner at 6.30. it went off very well except that some of the youths might have got merry a bit later! Plenty of speeches and there were a few under the table. My groom ? of the night of General’s dinner was Col James!\n\n \n","7":"\n\nOn the whole this was a wet day and far from pleasant. A visit to the mess this morning showed that windows had suffered from revellers last night and there were a few sore heads and pale faces in the morning. It is a good thing the day is Sunday. Afternoon Bazely called in a car from Division on his way to Walcourt and told us that the Bde.HQ had got home alright. The mounting of our guard was an attraction that drew a good crowd this afternoon but some of the younger N.C.Os need a good deal of instruction in their duties. Wrote and read. It was dark at 3.30 pm – I must take more exercise than at present. Our village is very quiet today.\n\n \n","8":" Gourdinne\n\nThe people here nearly all wear the ugly but cheap wooden sabots and it is a custom to carry a kind of pannier on the back something like the Yukon pack. Did a round of the billets first thing this morning and found them pretty good all things considered. Two companies routemarched this morning and two went to hear Pat Gorman give a lecture on our History. Afternoon walked past the outskirts of Thy le Chateau and then over to the outskirts of Somzee. Densely populated country this and villages are frequently scattered all over it. Today we had to despatch about 20 men in all on different guards. The arrival of six Tommies to assist Bill Bailey provided some comic relief this afternoon. Officers bridge tournament after mess.\n\n \n","9":" Gourdinne\n\nThe General came over during the morning and with him I inspected the billets. He has a bad memory for names and for faces which is a drawback. Found the billets good. This afternoon there was a soccer match between 23rd and ourselves which we won. Colonel James came over and spent all the afternoon here. I had arranged for the men to be paid today & to have general leave into Charleroi tomorrow. After dark there was great merriment in cafes. Old Tom? Willis of the transport came to see me and stayed the whole evening discoursing. Turned in about 11 but our band stayed up and, in the square, played in the New Year to the strains of Auld Lang Syne and the encores of the civilians.\n\n \n","10":" Gourdinne\n\nDull day but fine and nearly everyone went into Charleroi on leave. Having been paid only last night most of the troops have pockets full of money. After lunch rode over to Thuilles via Bozee Cour sur Herbe and found it to be a quiet place mostly tenanted by R.A.F. I have 20 men altogether on coal and ration guards there and they are all housed in fair comfort. Between Thuilles and Cour sur Herbe the country is bleak and open. Berzee is down in the same deep gully or ravine as Thy le Chateau. My chestnut was rather skittish but the ride was an enjoyable one. Madame Crochelet asked me to an evening they are having tonight. At mess Evans prompted by P J Abercrombie was proudly & loudly proclaiming\n\n \n\n1\/1\/19 Gourdinne\n\nthe glories of Wales. After dinner issued orders for his exile to Thuilles. Went to my billet where I found Matthews Kennedy & Chalmers with Raoul, Marthe, Yvonne, Malle, 2 Madames and a few old people. Wine was produced and at first I thought everyone was going to be unnaturally quiet. However persuaded them to sing Le Brabencon and Marseillaise after which we had a very gay evening drinking wine and cognac and having a large supper of such cakes as we never saw in France. “Le gourmandise, c’est pas beau – mais c’est bon\"!. Did a line with Yvonne much to the chagrin of Percy. It had struck 12 on the clock when we took leave remarking that New Year’s Day 1919 was finished and had given place to the 2nd day of January.\n\n \n","11":" Gourdinne\n\nThe Battalion is getting ridiculous now and we only have 450 here. This morning turned out all available men and then went out and watched them do some drill. Afterwards inspected the Lewis gunners under Little Turner and found all their guns and parts in very fair order. Afternoon there was a football match between two companies. A raw cold afternoon with good visibility and looking down the long valley running down from Thy le Chateau to Laneffe one could see spires of numerous little villages clustering. General Birdwood is going to inspect the Battalion at Nallines tomorrow so there is much heartsearching on the manpower question.\n\n \n","12":" Gourdinne\n\nHad a look at the horses and harness this morning and then walked with Thewlis down to the old flourmill on the river bank. Near a small shrine there was a large heap of German shells which I ordered be put away out of the reach of children. At 3 pm rode over to Nalinnes to the Chateau. The 24th Bn was formed up in the square. While yarning inside with Colonel Ralston and others General Birdwood came up and was received with the General Salute. After walking round he came inside and met myself and others but talked in generalities. Had a talk with Sir Charles Rosenthal and then went into afternoon tea sitting next to Sir John Hobbs now i\/c AW. Opposite sat Generals Birdwood\n\n \n\n3\/1\/19 Gourdinne\n\nand Robertson. Conversation was on demobilization and League of Nations. Upon the later question Clemenceau and Wilson seem to be at variance. The amalgamation of units seems to be the next step when strengths still further fall. General Hobbs was wearing his 1914-5 ribbon and on my return I found a letter from General Birdwood enclosing a piece for me. Rode back at a good pace through the dark and was rather late for mess. Afterwards went to a Euchre tournament which all the officers were taking part in a cafe\n\n \n","13":" Gourdinne\n\nMade an inspection of A Coy’s billets with the doctor and then came round through Headquarters. Near the band billet was a little old shop where two men were busy manufacturing sabots. With a piece of green elm timber and a few sharp augurlike instruments they soon turn out these simple but very unsightly wooden shoes. At the schoolmasters billet I met a man just back from Russia and who tells awful tales of misery absolute among the unhappy Russians and Poles. He was in Berlin just about Xmas. and speaks of great misery there. How War drags hundreds of unfortunates into its clutches. These people of this family have in them a strain of Russian blood and one little girl has the almond eyes and\n\n \n","14":" Gourdinne\n\nflat visage of the Tartar. They produced a bottle of wine here and we had a couple of glasses. This afternoon was played the final match for Football Premiership","15":" V 24th. Won by 23rd. in their last kick. A great crowd came to see this match. Sir Chas Rosenthal, General Robertson and many of the gilded Staff. Word today that 1000. 1915 men leave the Division soon for home. After the football Colonel James came along for a cup of tea and a tete-a-tete. Our chaps today were most ardent and hard supporters of 23rd. By W.R. came orders for 5 officers and 71 others for Australia. Returned to billet at 9 p.m. and had a fairly long talk to old Madame and took a cup of coffee.\n\n \n\n5\/1\/19 Gourdinne\n\nCold and dull. Bare black trees gaunt but the country a vivid green never seen in Australia. This morning was erected a RAF hangar for our Cinema on Monday. Afternoon was squally and the officers beat the sergeants in a football match. On rather a height the old village clusters round its 400 year old church and looks grey and exposed. The Maires house and farm are solid and luxurious of their kind and built on the most solid stone and all electrically lit. After the football the sergeants & officers again met in the evening and played cards in a bridge tournament. Thus did we spend our Sunday. Yvonne (Chalmers Marraine) is down for the day an unsophisticated maid.\n\n \n\n6\/1\/19 Gourdinne\n\nDull and threatening day with a cold and piercing wind. Practically all the available men were engaged on the erection of a hangar and its preparation for a cinema show tonight. With K Sutherland I picked the 73 men who are to go back to Australia on the draft of veterans. Our Headquarters and Transport accounts for a good lot. The afternoon was still threatening when I walked over to Nalinnes going through the tangled undergrowth of a bare bleak wood. Saw Colonel James and had a talk to him and then went down to Bde.HQ where I inspected our Guard. With James walked out to a Soccer Match ourselves V 24th and saw a good game drawn. Going home with Matthews and Davis twilight came down on a scene dreary and wintry in the extreme.\n\n \n\n7\/1\/19 Gourdinne\n\nInspected H.Q. billets this morning and found them fairly good. Took in 28 men for the manning of the Section. We put up Mons colours today. K Anderson has gone up to Brussells for a little leave. In the afternoon H.Q. beat D Co at football and a couple of hockey matches provided some distraction. Jack rode over and stayed talking for a while. We had a look at the old Maire’s horses in their fine warm electrically lit stables. At 5.30 we gave a free Cinema show in our hangar to all the little enfants of the village. There were great squeals of delight at all the antics of “Old Bill\" in the pictures. After mess found that a little mail from Australia had arrived – up to the 31 October.\n\n \n","16":" Gourdinne\n\nRode over to Nalinnes to Bde.H.Q. and there attended a Conference presided over by the General on certain questions of reorganization in the Army. Had an interesting yarn to James and others and then came back. Horse very fresh and bucking and prancing on the slippery roads. The sun came out and the afternoon was pleasant and mild. There was a great go at football between B & C Coys. A good crowd there and the barracking was very keen. No sign yet of Pat Gorman returning and I told Bde H.Q. that I would not consent to his going off on any other jobs in future. The officers essayed a small dance this evening but only 1 M’selle turned up so they made couples among themselves & waltzed to band music.\n\n \n","17":" Gourdinne\n\nA wet and blustery day. Sat over the fire for the whole morning doing nothing but read. Went for a walk about 2 pm. up through the Bois de and Bois de Camau . Through the latter runs a small stream dammed in places and there is a rather rugged little gorge. In spring this must be a fine piece of scenery. Looking round from an elevation one sees a good extent of wooded country. Quite backblocks and this is the most densely populated country in Europe. Australia has much to learn regarding afforestation. After mess read and wrote in my sitting room where the shrill cries of the baby of the house proved annoying. To my billet a little after 10 and found Madame and all the family in bed.\n\n \n","18":" Gourdinne\n\nA fine day. Carried out an inspection of billets in company with our eccentric Dr Millett. They were not in bad condition. Pat Gorman has returned from leave after a somewhat adventurous tour after books for the Educational Service. We had some Veterinary officers round classing our horses but otherwise things were dead quiet in our village and “the Square\" was void of life and animation. In the afternoon went down to Gorman’s billet and we had several arguments about conditions in Australia after the War. Stayed here till late investigating the contents of parcels. Evening read that wonderful paper the “Times\" – every line of interest.\n\n \n","19":" Gourdinne\n\nMade an inspection at 10.15 & while thereon engaged the General came along and after a walk round came to my sitting room for a yarn. Rien de nouveau. Walked over nearly to Nallines after lunch to see a Soccer match between ourselves and the 24th. It resulted in a draw. A very cold and raw day and the bare woods looked repellant. After dinner I walked round to Kennedy’s billet and there found Yvonne Legait. With Raoul & Marthe we had a most pleasant evening. It is good once more to meet a good pleasant girl. She can speak no English but we managed alright in French. She teaches in a school near Charleroi, is 22 and only wants a manicure and coiffure to make her a beauty.\n\n \n","20":" Gourdinne\n\nSunday morning. Gorman and Matthews went out shooting and got a hare and a good bag of “Longbec\" – a small bird with a very long beak. After lunch I walked over to Nallines and there found that both Colonel James and Savage were out so I walked back through the Woods. Jack came over to see me at about 5 p.m. and we read Australian letters together. He stayed to dinner and afterwards Sergt AJ Wiltshire 24th. came over and had a family reunion cemented by several glasses of spirits and prolonged till late. Horse thieves are very active round here at present and our picquets need to be very alert. Read the Times until after 11 and then retired to bed and sleep.\n\n \n","21":" Gourdinne\n\nA loafing day. Matthews left on English leave and will probably not return here. Afternoon there was only an unexciting football match to vary the monotony.\n","22":"\n\nAgain a quiet day. I made an inspection of H.Q. and found the Transport not too good but they had been having a great jollification on last night and all had sore heads this morning. The football match B v HQ was won by H.Q. Ryan broke his ankle while playing. Brown S.C. and Maier interpreter came in for a talk. Keith Sutherland was tired tonight and has been working too hard so I shall try and get him away for a little leave. A fine capable kid this and would work till he dropped.\n\n \n","23":" Gourdinne\n\nAn unpleasant cold day. The whole of the 1915 draft paraded at 10.30 looking very well with their new ribbons. All the village was turned out to see them off. I shook hands with each one of them and the Band then struck up “Auld Lang Syne\". Under the R.S.M the Band then swung round followed by our standard bearers and the column swung out of the square followed by the cooker. Many of the men felt the parting keenly and I was not unmoved myself. Mounted my horse and rode across country to Bde HQ where I saw the General and had a talk to him about Honours & Rewards among other things. Afterwards went with Brown BM to the corner of the square and saw our draft swing through under K Anderson. The General\n\n \n\n15\/1\/19 Gourdinne\n\nsaid he would call for me tomorrow morning at 9.15 for our motor tour to Namur & Brussells. Returned for lunch and spent the afternoon on routine work. On telling M’slle of my trip she said “What about the hare?!\" so I arranged to dine with them tonight. She was making pancakes (called gallots) one at a time in a sort of press which she held over the fire. These people live well as regards food but bodily cleanliness is not their strong point and baths are rare. Had a splendid dinner at 7.30 and plenty to eat and drink till 10.30 with Fernand, Raoul, Marthe, M’slle & Gorman. Becaisse and lievre were the pieces de resistance. With beer & Burgoyne we made revel. These Belgians eat tremendously and cook well.\n\n \n","24":" Gourdinne\n\nThe General and Colonel James called for me in the Divisional car at 9.30. The morning, though cold, was sunny and we set off through Somzee and Laneffe until we hit a big main road leading due East to the Meuse. Our way led through gentle green undulating country sprinkled with many villages and thick woods until we came to Bioul where the place became oozingly wealthy in appearance so to speak. Here there was lovely old Chateau dated by 1500 with splendid grounds and many of the houses we passed were old turreted places. The country now got more hilly and rugged as we came in sight of Meuse Valley. We entered at Riviere on a splendid delightful run along the river very like the drives along the Corniche d’Or at Monte Carlo. There were glimpses of\n\n \n\n16\/1\/19 Namur\n\nfine chateaux nestling in woods. The river fine and broad was in spate. High on either side rose rugged bluffs. We reached Namur at about 11 and its forts overlooking the Meuse seemed unhurt. The town was a busy residential one but there were no signs of factories. It seemed a better town than Amiens was. We swung out of here over rolling open country passing through pretty diversified country including much woodland until we reached Louvain. Here we made a stop noticing the elaborate façade of Eglise St Michel into which we could not get. Continuing to the square we found the whole placed as razed as parts of Abbeville. The celebrated library exists no more save as a heap of ruins. The Hotel de Ville is uninjured and\n\n \n\n16\/1\/19 Louvain\n\nbears date 1700. odd. The outside is elaborately carved and niched but has a new look. We went inside and were shown the fine Council room and then a museum from which the Huns had taken all the best. Some addressed and sealed packing cases were still in one room. We walked round the old Cathedral opposite and judging from pictures it had been very fine but the whole interior was burnt. All round here there is nothing but wreckage. We now took the Brussells road and traversed low country. Just before coming into the city we saw the musee de Congo Belge which is delightfully situated overlooking terraced grounds and woods. Through a beautiful forest (now\n\n \n\n16\/1\/19 Brussells\n\nleafless) we came on rather ugly suburbs. Soon ran into the fine town and put up at the Palace Hotel. I thought the buildings in many cases looked as if painting and renovation were crying needs. The Rue Neuve is a crowded and fashionable street and here we located Hislop and the Brigade rest house. Plenty of theatres and cinemas. Had afternoon tea and cakes for 4. 20 francs. Promenaded after dark and located the Hotel de Ville which seen by electric light seems a splendid square bordered with old buildings all of maedival architecture. Saw a monument to Nurse Cavell and her hospital. Theatre Royal or Opera House is not imposing viewed from the outside. Shops well stocked but seemed dear\n\n \n\n16\/1\/19 Brussells\n\nRested at the hotel for an hour and then bought some tickets for Faust at the Theatre Royal tomorrow night. The old hall porter with whom we booked was detected flagrantly attempting to swindle us out of 10 francs in the change. While waiting for dinner everyone rested in the lounge and fine stylish girls (not quite equal to the petite Parisienne) walked in and out with all the airs and graces so peculiar to their class. We dined in the restaurant quite well for 10 francs being shrewd enough to avoid the dishes pushed by the headwaiter. Walked down the brilliant lighted streets where flashing electric signs pointed out café and picture show. The latter all showing fine Allied war films – I see the hand of the propagandist. From the crowded cafes came sounds of plenty of music and\n\n \n\n16\/1\/19 Brussells\n\nthere were buskers in the streets. We went into a large picture show at a cost of 3d each and sat at tables where beer was served. An excellent programme of pictures was thrown on the screen. At 10.30 returned to hotel lounge and sat there talking with the General and Col. James. The demimonde activity was apparent and English officers of the war time abounded. At 11 p.m. James and I went to the Gaiety tea shop which apes the Cairo casino. Dancing and drinking. Scores of girls. Some clad in tights and others daringly dressed and seeming to have bare legs up to the waist. Suggestive dancing, drinking and importuning the place was fast and furious and fellows were openly caressing their girls. Constant cadging for band and dancers. Café Madrid was quiet at 1 pm and 1.30 saw me in bed.\n\n \n","25":" Brussells\n\nTook a walk down the Rue Neuve early and went through the Arcades there where I bought some books. Then returned and met General and James and we walked down to the Church Beguinage 1656 which has a whitening stone front. Inside it is moderately bright and full of pungent fumes of incense. Now down to the Grand Place and Hotel de Ville. This square which is the hub of Belgium’s history is charming. Gilded flagpoles had been erected for recent celebrations and many of the surrounding old buildings had, wrongly, I think been touched up with gilt. The Maison des Corporations (which a card vendor said was once the Parliament) is a fine old place. Facing the Hotel de Ville is a whole row of Gothic architecture including the Maison du Roi. The Hotel de Ville is a gem and\n\n \n\n17\/1\/19 Brussels\n\nand its tower beautiful. Entering the Council Chamber we saw the fine Gobelins. Apart from them I thought the room gaudy and it was full of Dutch smells and stuffiness. We now saw the Ball Room where Wellington and his officers danced on the eve of Waterloo. The oak lining of this room is remarkable. We now descended the shire and got a splendid view of the compact well laid out city. One could look right past houses and streets out to open fields, haystacks and see old windmills at work. By devious streets we came to the Mannekin Pis – not big as I expected – but a tiny little stone baby boy peeing a constant stream of water into a basin below. Girls and women laughingly point out the little man to passersby and close by\n\n \n\n17\/1\/19 Brussels\n\nshops are full obscenely humourous postcards which take him as their text. We now had a long walk through some opulent, some sordid streets until we came to the Palais de Justice from which high place another fine panorama is seen. This building is enormous and modern. £2000000 of massiveness with an Egyptian or Babylonian touch. I did not care greatly for the place. Inside the reek of foul tobacco, stale air and traces of urine make one realise that here is the Dutch strain again. Even the custodians were puffing long pipes foul smelling. We entered one court and saw several witnesses heard being sworn by uplifting their right hands. Walked back to our hotel and could not but marvel at the great number of antique shops\n\n \n\n17\/1\/19 Brussels\n\nsuch well to do seeming and luxuriously fitted up places. Lunched quietly and then rested in my room all the afternoon. About 5 p.m. it commenced to rain and I took a hurried walk down to the Galleries Royale and round the secondhand bookshops. Dined at the Palace Hotel with the General and James and then went down to the Opera or Theatre Royale as it is called. We found here that we were rather early so we walked up to the Boulevard Anspach. This is a remarkably fine street and straight as a die. Handsome shops line each side like Boul Mich at Paris and it is most brilliantly lit by the street lamps close together which stretch in two long lines for what seems to be miles. A very fine place indeed. We walked up\n\n \n\n17\/1\/19 Brussels\n\nand down this very fine crowded street until 7.15 when we returned to the Theatre. Entering we went up stairs and then into our very good seats. The Theatre Royale of Bruxelles seems to make no pretence to rivalling Paris as far as ornament and fittings go. It is very badly ventilated and being also artificially heated the smell is soon unpleasant. “Faust\" was played on the whole very well but the first act was not too good largely owing to his beard being not white, long enough, or well fitting. Between acts one could walk out and I met Keith Sutherland, Carricks and Howell all who were having a good time. At the Hotel afterwards we had supper and there was dancing – the gayest scene here. Continued till 2 or 3 in the morning but I left at 1.\n\n \n\n18\/1\/19 Brussels\n\nFeeling very tired this morning with so many late hours. If keeping on at this for long one would have to make a rule never to rise before noon. Breakfasted with the General and we had an omelette & coffee 11 francs = 9\/2 which is absolutely wicked. There was quite a thick rain falling at 10 a.m. and we resolved to wait until 11 and then to go out in a closed car to finally see the sights of the town. The car came at 11 and we paid our bills and away. It was wet enough to be unpleasant and cold enough for the few flakes of snow which fell later. Went down to the Boulevard Anspach and saw the state of Anspach then taking the high road to Waterloo. The car cut out the place for about 15 miles till we came into sight of the lion surmounted\n\n \n","26":" Waterloo\n\nmound of Waterloo. We drove up to the foot of the mound which is rather disfigured by some restaurants and cyclorama built up against it. Passed the French monument – an eagle at bay dying but still striking. The fields here are gently undulating and would conceal many troops in their folds. Drove now to Charleroi – black busy and full of mines and factories. Now to BdeH.Q. (1.30) and lunched. Reached Gourdinne at 2.30 in plenty of rain and settled down to any amount of paper warfare and got rid of some postcards and other stuff from Brussels. Our officer’s mess is shrinking in size daily and tonight was a very small family. Drank cognac & talked before bed with Meurice & Marcelle.\n\n \n","27":" Gourdinne\n\nA dull and cold Sunday. At 3 p.m. the Battalion paraded in the square to receive an address from the civilians. All the enfants and the best people were there. The old policeman stepped forward and apologised for the old Burgomaster whose 84 years rendered it impossible for him to risk the cold. The policeman read an address compiled by our friend M. Legait and we then read it to the men in English. I then read a reply and the Brigade interpreter translated it into French and let the Belges have it. They gave generous applause, we gave 3 cheers for the citizens of Gourdinne and our band played the Barbencon. We then adjourned to the Burgomasters place and roared the address at him. He\n\n \n\n19\/1\/19 Gourdinne\n\nfittingly responded and tears rolled down the cheeks of his housekeeper. Altogether the function was a distinct success but marred by nonproduction of a bottle by the Maire!. Ration strength of battalion is now 367 only if Hughes’ figures are right.\n","28":"\n\nFine and uneventful day. I walked over to Bde.H.Q. in the evening with Gorman and had afternoon tea there. No fresh news. Came back through the Woods over boggy paths which today are frozen hard. In the twilight the many lights of surrounding villages are twinkling. Mess was a merry meal by reason of fellows back from leave and the presence as guest of our old friend Col. (Dr) Simmonds. Cold and frosty night.\n\n \n","29":" Gourdinne\n\nA fine frosty day with a mild sun and roads as hard as iron – quite a spring day. With 40 of the men set off for Nalinnes and there heard a lecture by General McNicoll on demobilization and Repatriation. Afterwards walked briskly back with Davis in time for lunch. We are now going to get on to our Repatriation Precedence Rolls and mine is the thankless job of picking who goes home and when. The walk to and from Nalinnes was about 10 kilos and feeling need of a rest I put in the afternoon by a hot stove reading and writing. Pat Gorman and others went to Bouvree to some Races which are being held. Last night under influence of some point blank wine sundry gentlemen were going round looking for blood & other ‘b’s.\n\n \n","30":" Gourdinne\n\nFine and sunny but roads frozen. Car called for me at 9 and Nallines was the next stage where picked up BM. Now rattled rapidly into Charleroi passed Marcinelle and came through a squalid quarter to Marchienne. There are plenty of mines and big factories. In the place at Marchienne I met Colonel Ross General Wisdom & others and then judged the platoon competition. The 28th. won with a fine turnout. After a march past adjourned to a fine Chateau 7th. BdeHQ. & had a drink with the General. Met the Baroness who speaks fluent English. Motored home in good time for lunch and spent the afternoon doing nothing. Our village is very quiet and things want rousing up to keep people from dopiness. Mess at 6 is always a reunion of all the officers and an event looked forward to.\n\n \n","31":" Gourdinne\n\nLast evening spent a very happy few hours with Gorman chez Yvonne Legait. Sitting round the table we had singing and discussed all the scandals of Belgium – the Baroness de Vaughan &c. Yvonne is something of a beauty – natural and unaffected but does not look strong. M. Fernande Crochelet was with us and it was midnight when we parted. This morning it is a leaden sky and powdery drifting snowflakes are falling on the frozen roads and footways. Inspected Headquarters billets. Afternoon took a walk through neighbouring woods – snow lying round still among the grass and roads and paths icebound. To the edge of Thy le Chateau & then home. Yarned with Gorman and then read and wrote after Mess.\n\n \n","32":" Gourdinne\n\nSixty good men and true moved out this morning under the care of C.S.M. Reggie Day D.C.M.M.M. Headed by the band they looked very well indeed. Just after their departure came in the General who had walked over. Showed him our Pozieres plate and had a yarn with him – touching for one thing on a proposed amalgamation of the 23rd. with us. Owing the drafts leaving our Band has become steadily weaker and weaker but can still knock out a tune. Gorman has practically finished his history. Cold raw afternoon. I walked round the outskirts and round the woods about the village and came back glowing. Ration strength now 320. Had a yarn, a cup of coffee and some pancakes with Mere Crochelet.\n\n \n","33":" Gourdinne\n\nMade an inspection of billets in the company of Adjutant Keith Sutherland and others. After lunch rode over to Haie Nallines with Gorman and there saw Jack and had a yarn with Major Pascoe. Returning found Stewart had arrived here on leave. At mess there was much chatter as H Smith and some others were lively. Afterwards went round with the Doctor to visit M. le Cure. He has a comfortable house and is a fine old chap. His nephew speaks good English. The Cure showed me a well hidden secret drawer in a sideboard where he hid a rifle during the War and also produced some old parish records dating back to 1600 and written in dog Latin and old French. Very interesting talking to the old chap and hearing his experiences. He gave me a copy of La Libre Belgique.\n\n \n","34":" Gourdinne\n\nA day of snow. It was falling gently in very light feathery flakes just about breakfast time and roads and rooves were snow white with it. All the morning it steadily continued until after midday. As it had cleared then I went for a walk with Pat Gorman to Somzee and down to the outskirts of Laneffe. Round here were many houses which had been burnt in 1914 by the Huns apparently for no good reason. We walked back overland. People’s faces look peculiar on a snowy day. Against the white background they seem as yellow as Chinese. A great crowd of officers to lunch today. Abercrombie & some others were unusaully conversational at mess. Had supper with Madame & Mselle and enjoyed much badinage.\n\n \n\nStill covered in snow. Inspected H.Q. billets this morning. Afternoon expected Sir John Hobbs but he did not arrive. In the evening there was to be a concert run by the Y.M.C.A. by artists who were to come from Charleroi. Transport went wrong and they did not turn up which was a pity as Billjim and his mademoiselle had assembled en masse. A walk this afternoon across the snowcovered country showed much beauty in white. All right for a change, a few days of this snow are enough. Had interview with several officers this evening regarding jobs on Transport and other matters. Our electric light has partially failed and the village is very quiet indeed.\n\n \n","35":" Gourdinne\n\nSir John Hobbs was round this morning but had little to say. A small man in a big hurry. Visited our printing office to see the production of the paper. Afternoon Jack & Major Pascoe called round and were discussing the projected amalgamation. After mess the officers had a euchre party and I went round. The lady of the house is named Cherie and has an anemic dirty looking husband who is as weak as she is robust. Yvonne and her Mother and Father were there but the rather squalid surroundings put me off their society. Jack Cowan is unwell and had to go to bed early. Madame heated him a brick for his feet and this is called a fiancee! Snow is still lying all around today. At lunch we had Millar who is just back from the Rhine.\n\n \n","36":" Gourdinne\n\nStayed inside all the morning nearly and handed out some severe Orderly Room punishments on account of some prisoners who escaped last night from the guardroom. Stewart came in for a talk and I largely rewrote the last chapter of our History. Afternoon cold and foggy. I walked down the valley to Thy le Chateau which was quite like an Alpine scene. The snow thick over everything and all the ponds around the foots of the trees were frozen. The village of Thy le Chateau has been fairly busy but the Hun removed all the machinery from the factories there. Came back to my billet and read and wrote. Irritable today. Had a talk with Jack Cowan and little Turner. Supper with Madame Crochelet.\n\n \n","37":" Gourdinne\n\nRaw cold and roads frozen like glass. Inspected billets and found things very good. Harricks was busy getting his men ready for draft. Tried a man at Orderly Room for selling petrol to people here and remanded him for Court Martial. The wearing of sabots here is nearly universal and they are made out of green blocks of wood. During the afternoon Colonel James & Capt Brown came over and I walked back part of the way with them. As we returned across country a dull mist had settled down on a snowcovered vista. The official Photographer took pictures of the assembled battalion in the square. Had a talk with Gorman re our history which has now reached an interesting finale.\n\n \n","38":" Gourdinne\n\nGround still snowcovered. Put in the morning in warm room revising the History of the Regiment and selecting for it what photographs we are going to publish. This day expected the General to come over but he has not been near us for a long time. Must go and see him this afternoon. After lunch walked over to Nallines and found the General to be out. Called on Colonel James and with him walked over to Haie to 23rd. Bn.H.Q. There fixed up details with Beith for 200 men to come over on Tuesday. Returned to Bde. & arranged to stay on here until mid March. A long dreary walk home in the dark amid powdery snow. A cinema show tonight did not “marche\".\n\n \n","39":" Gourdinne\n\nSnow was falling steadily in heavy flakes at 8 o’c and continued until well on the morning. Arrangements under way to receive our draft of 23rd. men and held a Conference at 10.30 a.m. little Les Turner G Bailey, P Chalmers, Mackinnon and Howell are now on the Staff. Spent the afternoon up at our Printing Office and then round at Yvonne Legait’s where they were making pancakes with the aid of a kind of iron book in which they fold the dough. Today was a cold snowy day with few charms for outdoor walking. We spend 14000 francs a pay here on a strength of 250 men. Plenty of money circulation due to the troops. Dined with the General at Nallines and farewelled Brown. A very pleasant dinner.\n\n \n","40":" Gourdinne\n\nThe General made a speech extolling Brown and we drank several rounds of Benedictine – now a rather rare commodity. Fierce arguments raged about the Transcontinental and other home railways and re the break of guage. I worded the G. round to my way of thinking on the question of the 23rd. transfer. A 24th boy came in with his head bandaged up due to being sandbagged he said. McColl had a car and ran me home in it – a swift run along frozen hard roads. Snow deep on the ploughed fields on either side of the track and upon all the house tops. Turned in at once all the family being well and truly in bed. A cold frosty night.\n\n \n\n2\/2\/19 Gourdinne\n\nWorking away on historical stuff all this Sunday morning and then after lunch took a walk to Somzee and then back by a cross country track. All is covered inches deep in snow and yet life is very active. Everywhere on the snow are the prints of bird’s feet and the pad marks of animal’s hooves. The afternoon’s become lowering and dull fairly early and a sort of haze steely white seems to settle down early. The village compact with snowcovered rooves looks cosy and comfortable. No wonder the people keep close indoors this weather and take no exercise – there are few inducements to outdoor life. Evening had a family party at Madame Crochelets and talked, joked and ate a tart.\n\n \n","41":" Gourdinne\n\nAgain cold. Inspected the Transport at 11 a.m. and found them good on the whole though their morale has altered since armistice. At work on the history again and using plenty of paper in its typing. Afternoon walked down to Thy le Chateau – a dull dirty village this cursed by ugly factories. Snow covered and bleak. Received a preface tonight from General Birdwood for our book and Gorman got his Captcy. Had a talk with Fernande at the Brewery and he is full of what he did on a recent shooting hunt after wild boar. Plenty of money and food - he leads an idle life. Evening a good deal of writing and again historical work. Joy and singing in estaminets rum issue and balance of pay.\n\n \n","42":" Gourdinne\n\nMore snow this morning. I went round the billets we are giving to the 23rd. with Hughes. Just before lunch they marched in and were soon settled down. Jack and Beith came and had lunch with me. Latest rumours seem to indicate that our next draft will be postponed. After lunch I had the greatest difficulty in tearing myself away from a good fire and going out for a walk. With a climate such as this I don’t wonder that the Belgians lead such a very sedentary life. Took a half an hour stroll along snow covered roads and over snow carpeted fields. Thin powdery flakes keep gently drifting down. Spent the evening reading until 9.30 and then had a yarn with the Crochelet family.\n\n \n","43":" Gourdinne\n\nCarried out an inspection of H.Q. billets and was thereon engaged when the General arrived. With him discussed a lot of details & it was decided that I assume command of the 23rd. too in about 3 days time. The Brigade will probably move to Marcinelle in about a fortnight. I had a good go in with the General on the question of getting our 1915 officers home he argued in a circle but eventually came round to our idea on the matter. After lunch I went over to the 6 FieldAm at Nalinnes walking through the woods. There I had a talk with Colonel Savage and arranged for Millett to be fixed. Snow was falling rather heavily and there was a cold raw wind that went right through clothes and everything. Coming home all\n\n \n\n5\/2\/19 Gourdinne\n\nthe paths were covered deep with powdery snow and it drifting down all the time covered me with a coat like a snow man. I was glad to get back to a fireside. It continued to snow after dark and lay inches deep over all – walking along one’s feet sank right into it. At mess who entertained a dreadful loquacious “May God Bless the Reading of His Holy Word\" person from the Y.M.C.A. who afterwards tried to give a concert & failed. I am rather fed up with them. Took Jack round to Legaits and we put in a very pleasant evening singing and talking – I acquire more and more facility daily. Yvonne has Percy in chains that may become permanent unless he takes a pull and asks for leave or something else to get himself away quietly.\n\n \n","44":" Gourdinne\n\nAn utterly uneventful day but cold as ice. Snow inches deep. Cafe with a cousin of Crochelets returned of Paris. Fat unwashed party tonight in all about 2 ½ tons of Belge.\n","45":"\n\nSunshiny but bitterly cold. Visited our Printing office and then the Brewery. Too cold to do aught else but hug the fire. After lunch walked to Thy le Chateau and there saw Colonel Courlette C.R.E 2nd Divn & had a yarn & whisky with him. His men shooting game & danger caused my visit. We discussed Italy and other warm places. The wind driving frozen snow in front of it like sand. My hairbrush frozen hard and stiff. Rumoured that we move up to Marcinelle on Wednesday next. The fireside the only place tonight.\n\n \n","46":" Gourdinne\n\nBitterly cold. Ears feel it. The snow lies inches thick on the ground and a light North wind cuts like a knife. A bright sun devoid of warmth makes a glare. Towel like a board – hairbrush and toothbrush also. Could not muster energy enough to do anything but cling close over the fire in my room. In the afternoon essayed a walk but going in the snow was heavy and the uncomfortable cold soon drove me back home. Life here is getting rather a bore and I shall not be sorry when our move makes its appearance. Pat Gorman is still hard at work on the history and has this evening gone to Corps H.Q. to see if he can find out the why and the wherefore of a premptory summons there timed for noon tomorrow. I went round to Legaits and\n\n \n","47":" Gourdinne\n\nAlthough the same kind of day as yesterday, today was fortunately a little warmer. In the morning I went up to see Blatchford at his Printing Office and then walked over snowy paths to see Beith and have a talk with him. After lunch made off for Nalinnes over snowy roads inches deep which made going heavy. Through the wood and down to James’ billet where I had a yarn and then met the General. He walked nearly back to Gourdinne with me discussing future events. At Crochelets at 4 pm there was a family reunion and we ate hot cakes like muffins (great eaters) and then all sat round singing snatches from Rigoletto Faust & Carmen. Bought a bottle of Benedictine and with it later gladdened the family’s heart.\n\n \n","48":" Gourdinne\n\nCold but sunny. Snow lies thick everywhere but it is not soft under foot now – it is as hard as a board and the surface again freezing it becomes like iron. Stayed indoors all the morning but did a short promenade after lunch – the scenery is uninteresting though. At 4 and again at 5 held conferences regarding our forthcoming march and other matters. At mess Abercrombie came in and started his usual fierce arguments. A merry meal was mess as always. Afterwards to my bureau and find that now I have 23rd. as well as my own matters to attend to. The incoming of the “Time\" afforded reading matter enough till 8.30 and I looked in at the Picture YMCA show.\n\n \n","49":" Gourdinne & Charleroi\n\nFine and sunny. Band playing in the square. In company with the Keithlet set off on horseback via Somzee to Charleroi. About half way we left the horses and took a motor lorry. Reached Marcinelle and had a look at our new billets which are good. My place boasts a fat Madame and some kids. The aspect of the town round here is quite commercial and suburb like. After a talk with Millar APM I met Cowan and took he and Sutherland to lunch at the GFC which had been once the Bourse. Here we had a good meal with some Huns assisting the waiters. Then a walk round the streets of well stocked shops and back over a canal where barges were in a lock. Large mine slagheads and poppet heads abound.\n\n \n\n11\/2\/19 Charleroi\n\nOn the 13th. a local performance of Carmen is billed. We returned along the main road catching a lorry as far as Somzee. The temperature today is quite mild although snow covers the land everywhere. Back at Gourdinne at 4 and the chief excitement was an outbreak of fire near where H.Q. cooker used to be. A chain of workers with fire buckets soon put it out – no damage. Cinema going again today. Went round to Legaits to say “au revoir\". Yvonne Raoul & Marthe there. I cannot forgive these people for not washing. The human smell of unwashed bodies gets overpowering when the room gets warmed up. They speak of the French as dirty but if the French womans kitchen is not spotless her body at least is not an offence to the nose.\n\n \n","50":" Gourdinne\n\nA very fine sunny morning but the snow still lies heavy everywhere. All bustle and preparation for the move, limbers dashing round and valises blankets and other gear are being carted about. There were many tears shed in Gourdinne this morning. Mdlle Lucienne I think must have kissed nearly half the Regiment. At the Mairies the bonne was crying her eyes out so much that she could hardly present me to make my adieux to the old man! At 10 am we moved off a motor lorry carting all the men’s packs. The day was good for marching and the sun warm enough to make us soon dump our coats. We were ploughing along through snow with the temperature the same as that in which\n\n \n\n12\/2\/19 Marcinelle\n\nwe often ploughed through the desert sands of Egypt. The roads were so slippery that one’s thoughts had always to be of one’s feet. Lunch on the road – we went into an estaminet and ate bread and jam with cheese and coffee to the tune of a musical box. With band at head we entered Marcinelle at about 2.30 p.m. and passed D.H.Q in style with flags flying. Major General Sir C Rosenthal took the salute. Found our billets all right. I am in a good house where there is a little girl called Marie Antoinette about four years old. The house is electrically lit and has a central heating system with radiators. There is unfortunately a wretched shifty Belgian smell about the whole dwelling – a mixture of \n\n \n\n12\/2\/19 Marcinelle\n\ncooking smells and the usual unwashedness. Wandered round the slippery streets after mess and there were not a great lot of people about. Cinema shows took the attention of a good many.\n","51":"\n\nAnother good fine day. Had only a parade for inspection this morning and then let the men break off. Went round all the billets accompanied by the General for part of the distance. On the whole I think that the 23rd are housed the best part of them in an old hospital. After lunch went up the streets of Charleroi and being market day there were good crowds of people about. Little K. Sutherland leaves here today for England. \n\n \n\n13\/2\/19 Marcinelle\n\nIn our area the Brigade cinema has set up and tonight it was going and a band was playing. Had an early mess and went with Dr David to the Cirque to see Carmen. The building was ramshackle and draughty and all plastered with advertisements. All things considered the players put up a good performance. Our seats cost us 3.75 and as much smoking as one liked was permitted. The last act was fairly good but, in falling, poor Carmen’s legs went well up into the air. We walked down to a café for some coffee but it was dreadful stuff nearly pure chicory and tasted bad. Canal and locks here all frozen over and covered with ice. Reached billet at 10.30 – the reek of stale air and cooking fills the whole house. Slept soundly all night.\n\n \n","52":" Charleroi\n\nWent up to the station at about 11 a.m. to catch the celebrated Boulogne-Cologne express but times are not certain – anything between 7.30 a.m. and 3.30 p.m. To the lounge at the Officer’s Club to read and to write. Took a turn up the streets which are very slippery. The shops all seem well stocked and busy. The Canal down the centre of the town must look very well in Spring when its banks are green with its tree leaves. Had lunch at the Officer’s Club and there met Colonels Courlette and Ralph. A good lunch for 3.75 fr. At the station today there were many horses being entrained mostly of our 5th Division. After repeated visits to the station we found our train there at last and set off on our journey to Germany. Picked Colonel Davis of the 26th. up and\n\n \n\n14\/2\/19 Charleroi\n\nwe all got into a special carriage reserved for Colonels only. The train is a hospital train and the journey splendidly comfortable. Our travelling companions were a Canadian padre and a Staff Lt.Col. of the Staff of the Military Governor of Cologne. Drinks and sandwiches were served round by orderlies on the train and about 8 p.m. they made the bunks and everyone turned in between blankets for a sleep. A most comfortable journey just like wagonlits electric light artificial heat. We passed Namur and Liege in the dark and it was 3.45 a.m. before the orderly\n","53":"\n\nwoke me up to say that we would reach Cologne in half an hour. A cup of tea and some biscuits then put in an appearance and lights straight ahead told us that we were nearing this important German town. Came into the fine station and made our way outside. The first thing to meet the eye was the twin towers of the Dom or Cathedral looming up overhead. Crossed the dark & silenced plaz and found billeting arrangements at the Dom Hotel where a squareheaded\n\n \n\n15\/2\/19 Cologne\n\nyoung Hun gave us a chit for the Hotel Westhof. Arrived here we were shown to good rooms and turned in. Artificial heating made the rooms almost unpleasantly hot. Owing to constant ringing & chiming of the Cathedral bells it was difficult to get to sleep. Up at 8.30 and had a good bath after a haggle with a surly fraulein who knew more English than she admitted. Took a walk round to the Officers’s Club and with Davis and Corlette began a chase after D.P.Ms and the Town Major. Through bluff and the latter we got rooms at the Dom and then took a long walk up to the Opera House. The town is a fine and solidly prosperous one full of good shops. The people in the streets resemble their town & one has to keep repeating that these are accursed Huns otherwise it would be pardonable to mistake them for English. Nearly all the men are wearing military greatcoats or tunics but civilian hats. Those who are in\n\n \n\n15\/2\/19 Cologne\n\ncomplete uniform are very punctilious about saluting. The policemen all wear a kind of military uniform & carry swords. The trams are all up to date and clean. The girls are clean and seem well dressed and good in looks. Some give the glad eye but the majority are apathetic and some hostile – these latter generally wear some mourning badges. The Opera House is not an imposing place but it is big. Here we tried for tickets for the Operas but there was keen competition. Not far from here we saw the Hahnentor which is one of the old gateways through the city walls and has been preserved. A good deal of walking brought us back to the Cathedral which we entered. Rather dark at first its interior is not unlike Rouen. Lofty nave and in the centre a whole wealth of glass. Old vergers in scarlet gowns sit all day in this tomblike place. There is\n\n \n\n15\/2\/19 Cologne\n\na fine rising pillar here supporting the tower. Lunched at Kaiser Wilhelm Hotel with the A.F.C and met young Schafer and another. Out in front is a statue of the present Kaiser’s father and the irreverent airmen recently crowned him with an appropriate vessel which the Fire Brigade had to remove later on. Walked down once more past the Dom and came down past the station to the Hohenzollern Bridge which is a fine structure. Walked out on it and got our first view of the Rhine. Fine and broad with a swift current her waters were carrying little flots of ice. We walked right over the other side of the Rhine. A dull low mist prevented our view from being a good one. Coming back we went up to the Opera House again a long walk. I went in and had a loge which a\n\n \n\n15\/2\/19 Cologne\n\nsilent fraulein and an American officer shared with me. The Opera is a splendidly constructed place inside and the audience large and affluent. Many blondes among the clean looking quietly dressed and natural complexioned girls. The men (many squareheaded) wore good civilian clothes, though one officer was in uniform and carried a sword. Noticed several older men with cheeks much disfigured with duel scars – the number of spectacle wearers is alone remarkable. One sees few children under 5 and no babies. The infant mortality is said to have been very high. The Opera was Mignon which was excellently staged and acted and the music was lovely. Dined at the crowned Officers Club and then returned to Dom Hotel to write and bed.\n\n \n","54":" Bonn\n\nsmaller than Cologne. The streets were full of a Sunday crowd and many shops were open. Crowds of fine looking healthy young men many in partly military attire and bearing the army stamp. The girls fresh & natural looking – many very pretty. The buildings very fine and solidly picturesque – little difference between here and England. The usual number of squares and all the shops well stocked. Clothes seem shoddy shabby and cheap while boots have cloth tops & wood soles. Some excitement was caused by an armed guard marching up a squad of arrested civilians some of whole looked very surly. To us everyone was servilely civil and much saluting and crawling. Noticed a church 1692 and could not but be struck with the prosperous solid look of Beethoven’s home town\n\n \n\n16\/2\/19 Bonn & Cologne\n\nLeft at 1.30 am and reached Cologne for lunch an hour after. Walked then to the Opera house and found that the little Scotch Corporal had not been able to get any tickets for Madame Butterfly so we told him to try the Magic Flute on Wed. Walked round the streets now full of Sunday promenaders and noticed a big park of motor lorries all newly handed over and under the guard of N. Zealanders. To the Apostles Church which dates from 1100 & something and has a fine dome and lots of gold mosaic. Enjoyed watching the Sunday crowds and only had one incident of hostile looks. Picture shows and cafes crowded. Germania café was full and so was Simplicimus so we had afternoon tea at the crowded E FC club item 1 ½ m.\n\n \n\n16\/2\/19 Cologne\n\nWhen we came out it was dark and Lochstrasse was packed with Hun civilians and soldiers promenading and electric signs actively indicated picture shows. Walking up the street three little girls behind us made audible coquetting remarks in English while one good looker in front after a scowl repeatedly smiled and eventually turned (with a smile of invitation) down a side street. We returned to the crowded Simplicimus to a tea room and there sat at a table and drank Rhine wine while a man sang songs of the Rhine and an orchestra played. The civilians here all seemed prosperous and well dressed. They drank a lot and we noticed ladies & gentlemen getting politely tight. A good\n\n \n\n16\/2\/19 Cologne\n\nlooking girl drank to our healths by a simultaneous and unobserved raising of her glass and did this several times. Our second bottle was timely concluded about 7.30 so we saved the situation by going down to the Club for dinner where we met two Canadian Colonels & had a yarn with them. After dinner I returned to Dom Hotel where a good fresh looking fraulein unlocked my door. Crossing the square the twin dark towers of the Dom rose up into the grey clouds and a few drops of rain gave small promise for tomorrow. In the streets at this hour civilians were few as curfew at 9 pm orders them all indoors and they are liable to a fine if out. Their flag banned, ours floats in several places.\n\n \n","55":" Cologne\n\nA very wet rainy morning. After breakfast walked down to No. 4 Squadron AFC at Kaiser Wilhelm Platz and had a cup of tea with them. On the way back called in at St Gereon’s church which dates from 1219 – a heavy smell of incense. Gilding and sombre stained glass. Visited St Andreas church where a priest came in carrying the host from some sick bed. He was preceded by a boy with bell and censer. To St Marin Himmelfahrt which is large and has a fine carved pulpit. Enjoyed a quiet look round shop windows. In the streets there were many workers clothed in semi military garb. The streets and footpaths are kept beautifully clean and the whole city reflects great credit of its municipality.\n\n \n\n17\/2\/19 Cologne\n\nTo the Cologne Cathedral which strikes one as resembling Rouen’s interior. Walked to the centre and the + cross arms are full of good glass. Some windows were taken out at air raid time. A verger showed me round the tomb & of the Sanctuary. The pillars inside the aisles of the church are very fine. From the Dom Hotel the windows look right out on to the Cathedral. Met Davis and Courlette and with them dined afterwards walking round different shops. In one they told us that the mark is now only worth 43 pfennigs and consequently all prices have risen. Davis was pricing little objets d’art et deluxe and it is marvellous here as in Paris how these luxury shops can get a living. Went to an Eau de Cologne\n\n \n\n17\/2\/19 Cologne\n\nand they bought some eau which is now only sold to the Army and then at extreme prices because of the shortage of alcohol for manufacture. We had afternoon tea at the Club and then promenaded again until we met Colonel Adey. Went to a restaurant with him and had some Rhine wine amid luxurious surroundings. Then to Simplicimmus where a concert was in progress. Comic and other turns all in German and a richly dressed and chic audience. We invited two French officers to our table and they proved to be tremendous sports. One called “Disdonc\"!. They were both graduates of St Cyr and very hard and severe in their comments on the Boche. After\n\n \n\n17\/2\/19 Cologne\n\nSimplicimus we dined & wined them at the club and the Entente Cordiale was cemented in many libations. To Davis room where a flacon of eau de vie disappeared and they fell on our shoulders chanting “excessivement bien!\" Out into the night air on a long and disputatious pilgrimage to Bob St where a long meat queue was waiting and the APM was present. Courlette & I left here and wandered home on an all too narrow road and were soon asleep. Davis and the others tried to awaken me at 3 a.m. but could not. Somehow I fear that our gallant Allies will not catch the 7 am train tomorrow morning!. The Fraulein femme de chambre says Gott stafe England & Deutschand unter Alles.\n\n \n","56":" Cologne\n\nUp in good time and had breakfast but neither Davis or Corlette were in good form and the former elected to stay home. Left the station at 10 in the Coblenz train and as far as Bonn the scenery was uninteresting. Just the other side of B. hilly country starts and big bluffs go up from the waters edge . On the top of some of these wooded crags there are the ruins of old castles. From here on the scenery was grand – long stretches of water and background of hills. Just before coming into Coblenz it is rather ordinary. Round about the Coblenz station one does not get too good an idea of the place as there are many vacant allotments. We had lunch in the American YMCA club and then made for the centre of the town. It was thronged with\n\n \n\n18\/2\/19 Coblenz\n\nAmericans and there were fine open places and gardens. In the State Theatre opera performances were billed. Walked along the river front – the opposite bank of the Rhine here is precipitous and crowned by a large fort similarly situated to Edinburgh castle. At the junction of the Rhine and the Moselle there is a gigantic equestrian statue of Kaiser Wilhelm I. We climbed up on the pedestal of this and were rewarded by one of the most magnificent views imaginable of the junction of the two rivers and the surrounding country. The public buildings of Coblenz facing the river are worthy of their situation. We left by 4 pm train and a little American YMCA worker was\n\n \n\n18\/2\/19 Coblenz\n\nquite good company on the trip. Andernach is situated right on the Rhine and from the train can be seen a large part of the old city wall preserved and incorporated in the modern buildings. Brohl Sinizig and Remagen we also passed. The Rhine should look lovely in Spring viewed from a boat. Reached Cologne at 7.30 and dined at the Club where some of the youths were a bit merry.\n","57":"\n\nAt 10 a.m. set off with Corlette & Davis in a car the Second Army lent us and took a run first up to the Opera House and then out to the Aerodrome. Arrived there we had a look first at the nacelle of a Zepp. which was on a train and got a piece as a souvenir. Then round the drome where many old Hun aeroplanes were still lying. One was made of corrugated iron – \n\n \n\n19\/2\/19 Cologne\n\nor some substance very similar. There was a gigantic Gotha here – 5 engined – which gives some idea as to what we can expect in the way of bombing planes in years to come. This enormous plane could carry over 50 men and underneath it there was great room for bombs. From here we went a long run right through the town and crossed the Rhine at the Hohenzollern bridge. Run right up to Mullheim then which is also a fine clean little city and then across a bridge of boats passing the Military Governor’s billet! (We had earlier seen General Plumer’s home). The twin towers of the Cathedral were looming out through a bit of fog as we made for them. Saw the R.F.O at the station and then dismissed our car and had some lunch. After that we\n\n \n\n19\/2\/19 Cologne\n\nwalked round the shops and I then took the Battalion colours down to the Rhine and from a landing stage dipped them in the water. Round the Fishmarket there are old dark narrow streets and old aged buildings – quiet squares. To the Cathedral and went inside. The hot dull smell of incense and warmth. Many windows removed. Before a Service commenced an old beadle in scarlet gown cleared the course. At 4 p.m. went up to the Opera House with the others and saw Mozart’s Magic Flute – a complicated thing magnificently staged. The promenade at the theatre here is very fine. We were in a box which cost us nothing at all. After dinner we went down to the Cologne Bologne\n\n \n","58":" Cologne\n\nexpress and got into our bunks. Slept comfortably all night and then awoke to find that we were out of Germany and nearing Liege. Namur we passed about midday and ran down to Charleroi about 4.30 pm. At my billet I found a good Aust. Mail waiting and soon settled down again.\n","59":" Marcinelle\n\nA quiet day. In the morning walked round the billets talking to different folk and for the remainder of the day read and wrote. There was some rain after dinner and a walk into Charleroi revealed nothing much except that the conduct of some of the officers at the ERC Club leaves a good deal to be desired. This town is very well lit by electricity.\n\n \n","60":" Marcinelle\n\nPrinting office and other details this morning and then went to BdeH.Q. with James to argue out with the General the question of our band. Rain came on after lunch and after a bit of countermarching nearly everyone was formed up in the square at Marcinelle to hear Billy Hughes deliver a rattling good speech. General Rawlinson was there too and the troops very much liked his oration. At its conclusion there were crowds of people wanting autographs &c. Influenza is very bad hereabouts now and many deaths are occurring. General Robertson goes to leave tomorrow and then to D.H.Q. so the Bde. is mine. Spent a pleasant evening with the doctor opposite and his charming wife.\n\n \n","61":" Marcinelle\n\nThe doctor and his wife did Gorman & myself in style yesterday evening. He is elderly and speaks good English. They produced some excellent old wine which made us merry. This morning the General left on his trip to Cologne and I took over from him. At 10.30 we had a Brigade church parade in the Cinema Hall and Generals Rosenthal Martin and Birdwood were there. After parade B. met all the senior officers of the Divn. and talked a good deal about things in general. The question of War Gratuity was mentioned by him as very likely. He and W.M. Hughes seem rather at loggerheads as politicians & Imperial soldiers don’t fuse. In the afternoon I took a walk up the streets of Charleroi\n\n \n\n23\/2\/19 Marcinelle\n\nwhich were animated owing to Sunday. Could not help being struck by the weediness of the youths and the pallor of the girls. One rarely sees a good looking healthy girl like ours at home. The town is dirty due to so much factory smoke and grime. Had afternoon tea at the mess. The evening was spent in the company of first the lady at Major Berth’s billet who produced cakes & coffee. Jack came in there & I went along to his place and engulfed some wine and ate more cakes all the while talking about 13 to the dozen with the daughter of the house & her mother. Did not get into bed until late. This suburb full of bricks mortar and unloveliness.\n\n \n","62":" Marcinelle\n\nBreakfast at Bde.H.Q and put in all the morning going round billets and talking to different ones. Influenza is again becoming prevalent and an order now directs the closing of cinemas and public places of amusement. In the afternoon took a cruise round the crowded streets of Charleroi and penetrated as far as Haute Ville where there are many buildings which were destroyed in the fighting of 1914 between the Germans and French here. In the evening accompanied Harold Smith round to his billet where we were entertained by the Town Clerk of Marcinelle. A nice house. He has many decorations including L’Ordre de Leopold. Fine charming & hospitable people who produced wine & cognac\n\n \n\n25\/2\/19 Marcinelle\n\nOrders arrived for Col James to go to England and I spent most of the morning with him. Visited both the printing offices 22nd. and 24th. The latter have a very fine up to date machine. Several mines are around this quarter of the town and their ramifications are said to extend miles under Marcinelle. Conditions are bad men do 10 hours a day at the coal face lying on their sides crouched up with a lamp between their teeth. The air is so hot that they can only wear a pair of light cotton drawers – for their hard life they get only 10 francs a day. They keep little finches with which they have singing competitions and one time they used to burn their eyes out with red hot wire to make\n\n \n\n25\/2\/19 Marcinelle\n\nthem sing better. They also have cockfights and the winning cock is piped around the town. People here speak of the region of Mons as being a very musical one and tell of every night the families singing round the family circle – like the Legaits at Gourdinne. During this afternoon did odd jobs and at dark went up to the railway station for a bath – a fine station. A walk up the crowded streets full of people & gay with electric signs made one realise that \nthere\n here is a city. At mess we farewelled Covney at BdeHQ in champagne – he is getting married. Afterwards I yarned with some Belgian people about food, Huns &c.\n\n \n\n26\/2\/19 Marcinelle\n\nA varied morning spent rambling round the billets and yarning with different people. I saw Turner’s people and found him well dug in. Visited the Transport and quite a lot of horses have now been sold off. Had a yarn with Mdlle Anna and Madame Marcelle Bertrand. Afternoon I spent reading until 5 pm when I went to the Berlitz school and had a good lesson in French from a young girl locked up in an overheated room that, in characteristic fashion, smelt strongly of human perspiration. From here went to the Hotel Sierbertz where James was given a rousing farewell at a mess dinner. I made a small speech. After went straight home passing several sad ships passing in the night.\n\n \n\n27\/2\/19 Marcinelle\n\nFirst thing round to the 22nd. and had a talk with Davis & Gorman. Then went down to the 23rd. end of the billets on canteen business. There are many funerals here daily owing to the grippe and mourners and hearses are only too frequent. In the afternoon saw Griffin 23rd. discussed the scandal of their badly managed canteen & put him on the job as an auditor. Some rain & hail came on just before Miller and myself walked to Marcienne au Mont – fine houses up here and from a football ground an excellent view of all the factories of Charleroi belching out fire & smoke. Girls working on top of the slagheaps shovelling coal – poor slaves. The 7th. Beat","63":" Bde at football. Spent the evening with Dr. and Mrs. Mathys in conversation.\n\n \n","64":" Marcinelle\n\nAfter a talk with Davis and Gorman this morning I visited the Echo Office. From there went down to see Jack who is in bed unwell and from there to H Smith’s dwelling where he is being killed by kindness. Took a walk up the town and found Ecole Berlitz closed. Nothing else of interest. One sees few good looking girls here – those who are belles are unhealthy in appearance. In their custom of public urination the women here are nearly as bad as the men of the place. Visited Jack again during the evening and he seemed better. Believe that a few officers unworthy of the name have been hitting up things at Cafe Centrale & elsewhere.\n\n \n","65":" Marcinelle\n\nTo the 22nd. this morning and had a yarn there to different ones. Filling in time is a soulkilling job. Took lunch walked down and saw Jack who appears better. Then promenaded a bit further round. Mines all round here – a busy town. In the evening took a walk round the streets all thronged and electric lit. Crowds of soldiers everywhere. On returning I went round to little Les Turner’s billet and found him there and a little flapper of 18. Had some chocolate and a long talk with Madame about all the things the Germans used to do here. Up the street fairly late there was a shooting affray in which two of the notorious “Kelly Gang\" were eventually captured.\n\n \n","66":" Marcinelle\n\nUsual morning yarn round at 22nd. At 1.30 left for Gourdinne in a Ford ambulance and commenced a round of visits. Madame Crochelet produced a good bottle of wine and then I went round to Legaits and had coffee and biscuits with the charming Yvonne & family. Then down to the Brasserie where were M. Fernand, Mdlle Anna, The Secry of the Commune & another friend. We drank wine and talked and they had all long since reached the conversational stage. They are a wise race and have all the pleasures of imbibing without ill after-effects by observing proper restraint in keeping away from drunkeness. Gave Yvonne a lift back to Charleroi in our car and after dinner I wrote and read.\n\n \n","67":" Marcinelle\n\nToday was rather wet. Went round the 22nd. and 24th. in the morning. Work is a minus quantity now nearly save for a daily inspection of rifles. We despatched a good many horses to the Base today under Jim Farrell. After lunch there was little to do save read until 4 when I went into Charleroi which was closed to troops. Today there was a Labour manifestation or general strike for the privilege of working 8 hours daily. Processions and bands. Went to the Ecole Berlitz for a French lesson. Good linguists here most of the girl teachers speak several languages. One could understand from this cross examining system how a school like this could be used for espionage or as a “bordel\". Wined and yarned all the evening with Monsieur Corneille and went to bed on rosecolored cloud.\n\n \n","68":" Marcinelle\n\nShowery day. At 10 am Capt Denny M.C. a onetime Attorney General of South Australia gave an address on Repatriation in the Cercle Catholique. Afternoon I walked down to the 6 F Ambulance dentist and had some teeth stopped and then went back past Jack’s billet where he is still in bed and only slowly recovering from influenza. Went up the Charleroi streets – not many troops were in today as the \nstreet\n town is temporarily out of bounds. Spent the evening with Dr Daniel and met several families.\n","69":"\n\nA fine springlike day. Worried little Sir John Hobbs called in the morning and in the afternoon I walked to a football match at Mont sur Marcienne from where is got a fine view of Charleroi\n\n \n","70":" Marcinelle\n\nWet and showery. Battled round the billets in the morning talking to various people. Major Davis, E Thewlis and Jack were some of these. Was sitting in my billet when Pte Charlie De Boos walked in on his way over to England. During the afternoon walked up the town and had my French lesson at the Berlitz school – a place always to be associated with overheated rooms and the smell of stale human perspiration. Thence to an ornate coiffeur (the brass chafing dish is always the sign) for a haircut. At mess were Denny (A\/BM) Hislop Hay (Red +) Miller, Fethers, Jackson and Loydhouse. At Brussels Opera House men and women use the same Herren & Dammen. Spent the evening yarning to W Debois – a flu patient.\n\n \n","71":" Marcinelle\n\nUsual round of 22nd. &c in the morning and after lunch went up to the fine Charleroi railway station where one gets a fine bath after dodging military police about. The tram system here is good and up to date and in a town as scattered as this proves of no small value. At BdeHQ we had an early mess and at 6 all hands went to the Cinema with little Andre the 7 year old kiddie of the people of the house. The pictures were splendid and the audience large as all the troops had taken their ladies to the show with them. Afterwards we had a supper of oysters and beer at the mess and then I found at my billet a chapter of history to edit for Gorman – les Belges! After mess teased little Les & Simone chez eux.\n\n \n","72":" Marcinelle\n\nWent to the 22nd. And 24th. but there was nothing unusual so returned to Bde. at 11 a.m. to find the General returned from his Rhineland excursion and we discussed affairs of State until a late hour. Took a tram after lunch to Marchienne au Pont and went to 7th. Bde H.Q. where I saw the Baroness. The mess is nothing less than a baronial hall, deep oak panels armour coats of arms and an enormous open fire place carved. Souvenirs from China where a member of the family once was Belgian ambassador. To a doctor’s house nearby with Colonel Davis. With his charming daughter & wife we drank coffee & champagne the latter in honour of Davis’ birthday. Mais ils sont salle – les Belges! After mess teased little Les & Simone chez eux.\n\n \n","73":" Marcinelle\n\nAt 11 a.m. conferred at D.H.Q with Generals Robertson & Martin and Colonel Davis about running a fair at Charleroi a month hence and also decided on the method of reorganizing the Brigade and Divisional Staff as demobilization progresses. Gave Bazeley an order on Cooks for plain clothes so I will be equipped for Switzerland should occasion later offer. After lunch visited BnH.Q and found that our 1915 men have evidently had to leave England without any of their promised comforts as I sent over 1000 francs by an officer Bailey and he cannot now account for same. Pending a written report I am suspending judgment but should an\n\n \n\n9\/3\/19 Marcinelle\n\nexplanation not be forthcoming toute de suite I shall put him under arrest. Afterwards visited H Thewlis and while there Mme. Germaine came in. Had cafe and departed to H Smiths billet and found a Madame from Gourdinne there. She had heard Smith was ill and brought eggs and butter though desperately poor. How genuinely hospitable these people are. She kissed me on leaving. Drank cafe and brandy with Msieur and went back to my billet un peu . And this is Sunday – 6 pm. Evening visited Jack and then Beith. At the latter place met the daughter of the house and a nurse. Saw the latter home – tres gentille. Plenty of coffee and cakes and grand hospitality demonstrated.\n\n \n","74":" Marcinelle\n\nPresided at a conference of Battalion commanders at BdeH.Q. and discussed matters of general import. Then to 22nd. and early back to Brigade. In the afternoon got my portrait taken for passport and then promenaded back to billet. Lesson at Ecole Berlitz at 4 until 5 and then back to G office Division where Miles was looking for me. Tried to work Davis into the job of Gala representative. To Dr. Matys for dinner. M. Jansin & his wife were there too – a lawyer. Very nice people. Mme. Matys is still a beautiful woman and has been a beauty. What epicurean feasts – such fish pates, such wine. Bottle after bottle carefully chosen and graded for taste. Till 11.30 we ate drank and talked.\n\n"}}