{"Document Name":{"0":"Diary_0306","1":"Diary_0306","2":"Diary_0306","3":"Diary_0306","4":"Diary_0306","5":"Diary_0306","6":"Diary_0306","7":"Diary_0306","8":"Diary_0306","9":"Diary_0306","10":"Diary_0306","11":"Diary_0306","12":"Diary_0306","13":"Diary_0306","14":"Diary_0306","15":"Diary_0306","16":"Diary_0306","17":"Diary_0306","18":"Diary_0306","19":"Diary_0306","20":"Diary_0306","21":"Diary_0306","22":"Diary_0306","23":"Diary_0306","24":"Diary_0306","25":"Diary_0306","26":"Diary_0306","27":"Diary_0306","28":"Diary_0306","29":"Diary_0306","30":"Diary_0306","31":"Diary_0306","32":"Diary_0306","33":"Diary_0306","34":"Diary_0306","35":"Diary_0306","36":"Diary_0306","37":"Diary_0306","38":"Diary_0306","39":"Diary_0306","40":"Diary_0306","41":"Diary_0306","42":"Diary_0306","43":"Diary_0306","44":"Diary_0306","45":"Diary_0306","46":"Diary_0306","47":"Diary_0306","48":"Diary_0306","49":"Diary_0306","50":"Diary_0306","51":"Diary_0306","52":"Diary_0306","53":"Diary_0306","54":"Diary_0306","55":"Diary_0306","56":"Diary_0306","57":"Diary_0306","58":"Diary_0306","59":"Diary_0306","60":"Diary_0306","61":"Diary_0306","62":"Diary_0306","63":"Diary_0306","64":"Diary_0306"},"Date":{"0":"unknown","1":1392.0,"2":1393.0,"3":1395.0,"4":1396.0,"5":1397.0,"6":1398.0,"7":1399.0,"8":1400.0,"9":1401.0,"10":1402.0,"11":1403.0,"12":1404.0,"13":1405.0,"14":1406.0,"15":1407.0,"16":1408.0,"17":1409.0,"18":1410.0,"19":1411.0,"20":1412.0,"21":1413.0,"22":1414.0,"23":1415.0,"24":1416.0,"25":1417.0,"26":1418.0,"27":1419.0,"28":1420.0,"29":1421.0,"30":1422.0,"31":1423.0,"32":1424.0,"33":1425.0,"34":1426.0,"35":1427.0,"36":1428.0,"37":1429.0,"38":1430.0,"39":1431.0,"40":1432.0,"41":1433.0,"42":1434.0,"43":1435.0,"44":1436.0,"45":1437.0,"46":1438.0,"47":1439.0,"48":1440.0,"49":1441.0,"50":1442.0,"51":1443.0,"52":1444.0,"53":1445.0,"54":1446.0,"55":1447.0,"56":1448.0,"57":1449.0,"58":1450.0,"59":1451.0,"60":1452.0,"61":1453.0,"62":1454.0,"63":1455.0,"64":1457.0},"Entry":{"0":"\n\n1.\n\nWriting by the Billet doors – a great lofty thatched barn – after 3 in the afternoon, waiting for Frank from the Orderley Room to start for Steenvoorde.\n\nTonights our last night here, that is our last night by report. Tomorrow at some time we for stunting(starting?) again…for the A.D.S. in its new advanced position. \"In a shell ‘ole\"! to quote Medcalfe.\n\nToday I’ve written a letter – ‘If I should die’ – to keep in my pocket case. There’s the idea in my mind, not overwhelming nor overpowering, but the idea there and so I’ve written.\n\nAnd the dead number many I know, and the latest Norm Reed, of a type –Jake perfected. And he had a great nature with a splendid character. He is one who has made the dead the \"Rich Dead\" – and Rupert Brooke is another.\n\nEvery hour at the M.D.S. at Dickebusch brought dead splendid types before you, and one I remember before the others was a Serg. North… one leg was compound fractured, the other amputated at the knee..for a whole day he marvellously fought death – he breathed hardly and only by hard winning\n\n","1":"\n\nof each breath for the whole afternoon..and when he died his face was full of the pain of his wounding, but full also of an infinite calm.\n\nAnother, of the 19th Battalion, his leg amputated. Consciously he fought from the time of his redressing…after an infusion of saline he fought harder, slept then and was evacuated. There was another Serg. of the","2":" who lay aside of death for two hours, then he rallied and an infusion saved him.\n\nBut North I noticed before them all – only two others were in the resuscitation lines with him…and his perfect features, broad forehead and thick soft hair, and his pressed lips and sensitive nostrils.\n\nOne of the other two died, and the other rallied to be evacuated to C.C.S. I sat by North then, and wondered on all things. Nothing could be done for him beyond what had been done, and he was dying.\n\nHis struggle for life strong against death, but he died, and the pettiness and littleness of life about went on. Away across the world a home was to know agony and pain.\n\nAnd the ultimate gain? Down the generations lying histories that tell of a wounding war, of brave men and nobleness.\n\n\"Honour has come back as a King to earth\n\nAnd paid his subjects with a royal wage.\"\n","3":"\n\nBack from a walk about Steenvoorde and an evening in a private house with the conversation of two fine Flemish women, Frank buying from them a baby’s bonnet of lace and ribbon.\n\nIt should have been a night solely of enjoyment, but I’ve the feeling of isolation – of loneliness in the crowd, and of talking and laughing without knowing, \n\n‘My heart aches, and a drowsy numbness pains my sense\".\n\nand in the Billet now though alongside musick playin’ & singin’, and card players and talkin’, I’m alone.\n\nThe night’s brilliant and lively with the moon, and a mile away the Bosch is dropping bombs.\n\nI have lain and thought of nothing, conscious of all but away from myself. Coming in, Frank left me to go across for orders. I leant on one of the struts and watched a group of players, and discovered myself a while later seeing nothing.\n\nTomorrow? Why tomorrow I may be\n\nmyself with yesterdays Ten Thousand Years.\n\nThis was how I felt after the Factory Corner stunting of Feb. and March, Becordel, lured the melancholia.\n","4":"\n\nDickebusch-Ypres\n\nChateau Segam\n","5":"\n\nYesterday at midday from Steenwoorde marched from billet through town, to fields two miles the other side, a march in all of about three and a half miles. Then enbuss’d behind the 8th Batt., to within two kilos of Dickebusch. Then another march of about 5 or 6 kilos to our home of this minute.\n\nC. Section up last night at 9, shortly after our arrival – then B up this morning at 5 a.m.\n\nThe marching part of journey up over dust deep roads – cobbles under the heavy layers. The second marching along roads heavy with lorries, working parties, staff cars, ambulances and the chattels of war.\n\nThe stream up and down only progressed at a slow walking, and coming down between two mounted parties, four carrying shoulder high a stretcher, and two following behind. In the haze of dust and of evening it was a symbol of the day.\n\nAll night long about here he bombed, heavily and at intervals of short whiles, short whiles when only the occasional boom noise of a near big gun, then a rattle of machine guns, of sharp single rifle shots and then the hellish smashing crump of the bomb.\n\nWe are in an old still partly standing house in a wood, by terrible paraphernalia of war, and all through the wood and about he dropped his compacted hells, one landed clean 10 yds. alongside our ‘room’ – an upstairs apartment. It dropped by the side of one of the numerous ponds, penetrated deeply in the soft earth and exploded, the walls rocked like the walls of a ship striking fully a heavy sea, again at three this morning this happened twice.\n\nSleep was nightmarish.\n\nFrom early we’ve been heavily bombarding, heavy close drum fire of thousands of guns. Yesterday morning early we heard below the carrying sounds of the guns, and it lasted till midday.\n\nWe’re waiting and with no knowing of when we’re going up, here we have relieved the 14th – our sister Ambulance. Then only here the rendezvous.\n\nWe passed coming here last night, bivouacked in an open field, the 8th Battalion. We had semi-proof walls about us. They nothing.\n\nWord was about last night of Peter Mac having lost three fingers, and Hank, being slightly knocked, bombs over Pop., and they there without passes and after 11. They’ll be S.I.\n\nOct. 1\n\n4.\n\nTurning in, but for a sleep tonight. In a low dug out, heavily heaped with time rotted sand, bag’d blocks, and from time innumerable.\n\nA mail in today – three letters from home, one from Mother July, from Grandma, and a letter Geoff had sent Mother from the land.\n\nAlready the word of Muston being turned into Flats, Lindsay evidently the Architect as Mother mentions Court spending a day there.\n\nOutside the dugout Frank and self yarning to two of the 54th and their yarning full of the elation of all their objectives taken.\n\nWaiting the busses outside Steenvoorde yesterday, the 8th waiting too, a party of them strolled over to talk, they mellow with rum, consequently ready for stunting.\n\nIn their first innings in this sector last week they’d only two killed: they by our own barrage.\n\nTo some others that joined in after they’d yarned a while, they introduced us as the 1st ANZAC . A.M.C. full capitals – and with becoming dignity. The new arrivals honoured us: and talked of their M.O.\n\n\"Our old quacks a M.C.: if yer sick ‘e’ll give you the benefit of the doubt every time! What d’you think of that?\"\n\nAlways their talk is full of colour – they’ll take a dozen trenches in an hour, and all the while in no spirit of boast or brag. Simply they’re full of the pride they have of their own mates – that we have of them.\n\nAnd now too they’re admirous of the Artillery: one tonight gave word of its being ‘now an Artillery man’s battle’.\n\nOn the Somme it was an Infantry man’s, and the beggars made it all their own.\n\nSupper tonight: Mat in a small parcel of a towel and pair of sox (a hundred thanks for the sox Mat) enclosed a tin of asparagus, and a small tin of sweets. So for supper, asparagus.\n\nYesterday morning I read half of the selected Poetry of Brooke: this morning back to Keats, and read fully.\n\n\"I stood tip toe upon a little hill\". Yet I haven’t read \"The City of Fear\" fitingly, it should be read in Ypres, where it was written.\n\nThe ‘City of Fear’ to me, on the Somme was Bapaume.\n","6":"\n","7":"\n\nSgt. Green woke me early, to go up to Menin Road a runner, had to turn it down after a trial in the yard. Ankle too twisty.\n\nSo Blue Herring up in my place. This time yesterday morning the guns one long heavy drumming. Now there’s only the occasional heavy bored report of a howitzer. But this time Fritz was counter attacking – 9.25, and our practice barrage was timed for 9.30, and it was punctual.\n","8":"\n\nIn Egypt and till quite lately receiving the Bulletin after looking out Lindsay and Low, then the Red Page, I turned for Lawson. But a month or so back I read carefully a poem of M. Forest’s, and now his contributions are worth seeking beyond others. One of his of last week – Bulletin July 5, \"Grey Farm\". From a cable extract he took his poem, \"The Battle raged about Grey Farm\". Written in Queensland it might easily have been written here: all the atmosphere, of before war days and now, as in its six verses, all the beauties of its few days & the dull deadness of its war’d days. It ends,\n\n‘Grey Farm! The shadow of a dream!\n\nYour walls go with a crash.\n\nThe scream of shells, the roar of guns,\n\nThe piercing lightning flash!\n\nGrey Farm, you are a smoking heap,\n\nof shattered roofs and ash.\n\nAnd trodden grass, and buried flowers,\n\nand poplars split with storm,\n\nLa Mere is there no more to give\n\na welcome quick and warm.\n\nThough something on the threshold\n\nlies in bloody uniform.’\n\nIt might easily have been Luisenhof Farm in front of Ligney Thilloy, up from factory Corner, or Moquet Farm from Pozieres.\n\nWhen the second and third Battalion took Hermies suddenly from the Bosch, they were beaten back, heavily losing: and the cutting down of fruit trees and desolating they’d practised from Bapaume upwards, they’d no time to compleat. Just by Hermies, by the railway line, was a prettily formaly arranged garden, of two parts hedge divided, strawberry gardens and flowers one part, and apple and pear trees the other. In each part were small summer houses, and in one a dovecot – used then by our Artillery as an observation post. This was the \n\nGarden… full of bees and tall French hollyhocks,\n\nPale lavender and privet hedge, and \n\nfern leaved \"ladies smocks\"\n\nCoquetting with the formal paths a \n\nflare of scarlet phlox.\n","9":"\n\nTom brings word in this hour, of Ernie Brown’s dying of wounds, and Billy Keel being knocked.\n\n+6\n\n 3\n\n8.\n\nWorking Q.M’s. attached to Capt. Neeves rationing party, up & down to posts with rations.\n\nThree more wounded yesterday besides Billy – Pullen & Rowe and Owen Burton.\n\n9. To continue yesterday’s Diary.\n\nMail, Literary Supplement & a barren number and a T.B.C. letter re \"Certain Noh Plays of Japan\" - Cuala Press. This they can supply for half a guinea: while Baker’s ask the fancy price amongst their super. books at 25\/-. For Cuala Press book I’ll try further the T.B.C. While on London leave there in the morning I bought Cuala Press book of ‘Synge – by Masefield’, at half a guinea: in the afternoon – it raining so I did the Charing Cross Road bookshops – at Beaumonts then priced them to be sold copy at one guinea.\n\nTrip up now to Menin Road and the Ypres stations with rations. Evening: Trips to both stations quiet.\n\n10.\n\nToday – to have been the morning of the stunt – the roads to Ypres and Menin Road heavy with traffic – Artillery – guns and limbers, G.S. wagon of the Engineers with their limbers, & Infantry marching – in long single file, parties of about 50 men stretched with the same intervals between parties. Mostly 3rd Division – brilliant with colour patches. Then ordinary ‘Eggs a’cook’ unit patches on either sleeve: below, and on both sleeves red, black or gold square of sides 2\": and on their backs great 5\" square patches of red: and their runners, signallers, M. Gunners, etc., wearing their colour band above the cuff – and on it their unit patches overplaced.\n\nThey’re not as fit as the 1st Division lads – but they’re not just in after almost a four months spell.\n\nShells, and munitions, bombs, etc., long trains of full loads, one following the other along the light rails: then returning with the salvaged 18 pounder boxes, and bomb boxes.\n\nWord of more wounded today, Pullen, Rowe – Pullen was reported wounded a week ago, exaggeratedly and Owen Burton. just before we’d arrived at Menin Road post, Kinsett of the Transport knocked, one of his horses killed and other slightly wounded. The Transports 3rd casualty in France!\n","10":"\n","11":"\n\nYesterday up to Menin Road, we passed by the old square of Ypres, and the stark ruins of the Cloth Hall. Some more of its remaining beauty I saw today. Alongside of it yesterday for the first time, seeing it, I had the same emotion as when I’d July’s cable from Mother. Even in its terrible ruin there are faint tracings of its old loveliness, and in the magnificent standing of part of its shell’d tower there is all the pride of its old wonder. Passing through this afternoon one 13\" shell burst in its ruins.\n\n12.\n\nLast night up to the Canal dugouts a second time, with Ted Ackland.\n\nThe roads were almost lonely, the traffic lighter than I’ve seen it. The sky was only cloudy, with no promise of this morning’s early rain. We watched the horizons anxiously for the shrapnell barrage that warned of the taubes approaching, but we’d delivered our rations & reached camp long before the bombing hereabouts commenced for which ‘Laus Deo’.\n\nOct. 3\n\n13.\n\nEntry 197 of Journal 3.\n\nTwo trips of yesterday were with him, one to the Canal and one through Ypres to Menin Road, and the second to the canal at night. And in my first impressions I was all right.\n\nOn the Ypres road once he pulled up – to pick up from the dust a clip of cartridges. He hadn’t any ammunition, & he might want some if one of his horses got knocked. \"You’re supposed to report their wounding to the nearest Vet, but I’d sooner shoot ‘im than let them live in agony!\" And the language of an A.S.C. driver is always of colour – mostly of lurid colour: his was under splendid control, and \"useless carrier\" the most used. Slips in plenty there were, but they were quiet and not ugly. Souvenirs were mentioned, and the wounding of one of the chaps looking for them, \"My Ma‘d sooner me than 50 souvenirs!\" and he used the word Ma! And right through his company was good and proved him possessing a fine nature, unselfish and sympathetic, filled with the love of his horses, and a longing for home.\n\nOct. 3\n","12":"\n\n14.\n\nThe Bearers, or most of them out this afternoon: just outside Ypres by the canal coming back had a ‘Cheerio’ passing and saw for an instant Syd standing by the driver of the foremost lorry. He was standing seeing nothing and only dull wonder in his brain. Two he worshipped with a boy’s enthusiasm have died to him this stunt. His Father dead at home, & Ernie his sister’s husband dead of wounds at the C.C.S.\n\n15. October 4\n\nTo Menin Road stations with 1000 galls. of petrol for ambulance cars, and charcoal for braziers and cooking. Tom up with rations, and he stayed there.\n\nThe station’s crowded with walking wounded – and more Bosch than our chaps: but we’ve lost heavily in the taking of the ridge, and though all our objectives gained we’ve paid fully.\n\nIt seems the weathers broken: yesterday – the stunt postponed from Tuesday – then from yesterday – the morning dawned in thin mists of rain, and though the day cleared, rain drizzily and dully had it from early this morning.\n\nBut the stunt came off after its inevitable postponements, and the objectives are ours. Hanging in will be hard and hot fighting the day’s orders, for the fighters.\n\n16.\n\nThe boche has landed his shells – Bib describes their manner in a letter, but an immuteable sentence – all over the place. Passing through Ypres on our way back, one landed just by a big newly brought in crowd of prisoners.\n\nThis stunt’s taken Bosch seem a cleaner and better type than those of the first days of this salient’s stunting, but they’re only youngsters generally & rather deadened by shell fire.\n\nOne I was nattering to, and I asked him his age. He said twenty, but he only looked 17, or even 16, fair and boyish and slim. I saw his disc, and it was dated 1897 – so by that his 20 was correct.\n\nTalking to him one of our Inf. boys, knocked in the knee, and baring cheerfully a brown thigh to the winds, grins at the Bosch, grins to me, and says, \"Ask the barstard what ‘e thinks of our bloody artillery!\". Fritz shuddered. The Artillery’s barrages have been up to form lately.\n\nOct. 4\n\n17.\n\nA long sleep last night, ended in a queer dream, the Col. at the A.D.S. coming out to the wagon quickly from one of the dugout huts in the building’s ruin, asked me if I’d draw him my crest, asked me what it was, it meant, and how it was mine.\n\n18.\n\nIn the dugout last night Tommy and self had the company of three originals of the 12th Batt., they left behind here on water fatigue. The three of them, Tasmanians, and the chap who slept next to me an amateur runner of pre-warr days.\n\nTalking he brought the talk round to a book I’d laid by me, Rhyme(?) of a Red Cross Man. Jack in the Q.Ms. had unearthed it, and yesterday seeing me with \"The City of Fear\" loaned it me. He started then talking of Ginger Mick and The Sentimental Bloke, and he’s expecting them from Blighty. Then came the inevitable Kipling, Service, Dennis, Lawson argument, the argument that always arises, and always dies with nothing approved of the other sides arguing.\n\n19.\n\n\"Oh methinks how slow\n\nThis old moon wanes.\" Shakespeare\n\nAs we felt the first night in \"The House of Fear\".\n\n20.\n\nKilled today – wounded, then when back at his collecting post, killed – Maj. Hunt.\n\nAt Factory Corner – from Jan. 26 till March’s first week, he won his recognition as a brave --: after the advance from bayonet trench over Luisenhof and past Ligney Thilloy before Bapaume, he was awarded the M.M., for the usual awarding qualities – bravery in the field, and attention to wounded under heavy shell fire, the causes of decoration, that still keep up the pleasant legend of the sacrifice of the Medical Men. But apart, after Bullecourt he certainly carried his decoration, and on him it carried with it all it originally stood for. And the bearers have lost their best leader: he was as cool and careless under fire as Ernie, no greater praise can be written.\n\nWith the inefficient and callous weeds we’re getting now as Captains – callow youth rushed through a short course of theory, his loss is more than the loss of 4 of such men as M—and F--.\n\nCol. Williams, Capt. Hughes and Maj. Hunt since December 1916.\n\nOct. 4\n\n21.\n\nHome mail today.\n\nTwo from Mother, Aug. 4 & 12, one from Betty: one from Mat. So ten pages from Mother to read tonight in ‘a lousy dugout by candle light’ to misquote Service. Betty writes of receiving the post cards, and of two books arriving. The cards were of Lille, Arras, Rheims, Lens & another centre yet uncaptured, but the books? Were they Verhaerens Plays and \"Letters of J.B. Yeats\", but it couldn’t have been Yeats because it was only sent from London on the 6th June, but if it is I’ll not have to pay a fancy price later, as I’ll have to for the Cuala Press Dunsany book. Certainly I remember having Verhaeren and Yeats together.\n\n22.\n\nIn Chateau Segard, in the sandbag’d wall room, in the open grate of a once black marble chimney piece, in the ‘room’ the officers established themselves, now the 12th Batt. boys on water piquet are \"at-home’ off duty – during the day. Of the side not sandbagg’d remain the traces of its missing panelling, and the floor is earth and bricks, the ceilings lost its colour, and of its two windows and doors only a part of an opening for entrance is left.\n\nFrom it s remaining faint traces of decoration concerts, all typically French and tawdry obviously it was once a Reception Room – opening on to the terrace, and facing the stream.\n\nNow burns in the broken fire place the fire of a volunteer cook, and a merry party of a half a dozen followers of Rabelais tell tales to the entertainment of the ruins.\n\nThey’re great company, and a half hour’s yarning there is joy.\n\nBearers up in again tonight.\n\n23.\n\nThe day’s ended with a heavy hard wind that has blown across the rain and the heavy clouds. Still blowing, stars are here and there revealed in luminous patches, and the moon now behind long narrow flying clouds, blacking in silhouette the stark ruined and torn limbs of old trees.\n\nAn Edgar Alan Poe night, and we’re waiting anxiously for the Boche planes bombing, and for Jack to return too. He left suddenly by some order of Mr. Nieve – to go somewhere – somehow, and he’s still away.\n\nTom’s not back either from the A.D.S.\n\nOct. 4\n\n24.\n\nWriting now – for the sake of company. I’ve read again \"The City of Fear\". Of all war stuff, it the most convincingly true, and the horror of warr’s atmosphere is in it.\n\nRead aloud, its musick and strength would make the hearing of it something never to be forgotten.\n\nOver the grave\n\n‘Of the work that was spared for the sake of the work, by the verandahs of elder wars.\n\n‘Only one tattered pinnacle leers to the calm of the outraged stars.’\n\nOf the enormous heaping ruins of the Cloth Hall, what will be done. Standing still – torn terribly but still standing above all other peer pinnacles are the ruins of the town, and facing the Poperinghe Road entrance to the City is a great doorway, highly arched to the Gothic design, and bearing behind and about it great mountains of brick and stone and dust. Amongst its ruin too still is standing, terribly scrapped by shells and great explosions, the broken gables of another of the halls, or of a separate building in the Cloth Hall style.\n\nEven in ruin beautiful traceries still stand – some quite clean from tears, and still the fretting of one rose window with a triangular above it bravely shews traceried light.\n\nAs Rheims, some part of these ruins should everlastingly testify to warr’s hell fury, to warr’s horror, and to warr’s blindness.\n\nTo the horror and terror and blindness of war, not to hate and fury of individual peoples.\n\nTom and Jack are back, there’s been heavy shelling about the stations, and the rumour at the A.D.S. of two further killed, and 7 wounded. The Ambulance is in its Death throes.\n\n25. Oct. 5\n\nI cut it out of the Bulletin some while ago, and found it this morning amongst the Dad’s letters. A poem of M. Forest, \"Farms\". The argument last week at Steenvoorde was M. Forest’s sex. Could a woman write this –\n\n‘A wanton by a churchman’s side\n\nFlickers a fan of scarlet, set\n\nWith diamonds, and that fan sweeps wide\n\nAcross the land, and wider yet:\n\nThe while the dimpled hands of her\n\nProclaim themselves the arbiter –\n\nThe downward sweep a coutier breaks\n\nIts upward lift a monarch makes!’\n\nOct. 5\n\n26.\n\nRumour runs riot, now it’s of Marks, Dick Seymour and another missing. The 7 wounded and two killed, changes, and no real word of them seems known either at Menin Road or Westhoek, they are of the newly joined 25 reinforcements – new men from Australia.\n\nMail today brought a letter from the Australian Red Cross enquiring – from the Secretary Vera Deakin, after the manner of death and burial of Rusty Leask, killed at the Embankment by Bullecourt. The letter envelope addressed F.H. Molony spelt correctly. Who gave my address, surely not young Marly wounded by the same shell, though he could have been the only one. At Pozieres I wrote a letter of sympathy to his mother, and found from the O.R. his Mother was dead. Answered the letter, but cannot post it till we’re out. Also letter from Mat.\n\nThe Y.M.C.A. have been comfort stalling at Menin Road and in Ypres, and have been doing it well, cigarettes, cocoa, Biscuits and chocolate all in plenty.\n\nShelling today in Ypres got a number of Tommies and parties. Striking the road cobbles adds terror and double terror to the shells bursting.\n\nSuch a shell got our bearers on the 18 Sept.\n\nThe day cold, windy, but the sun shining, and blue skies between great white and grey clouds. Air planes over the last two days well in charge, but today – this afternoon a squadron of taubes over. To Night? !!\n\nToday posted, green envelopes, letters to Mother, Billy and Grandma.\n\nDinner today Spotty cooked us steak and onions, the last time I tasted steak and onions was in supports by Luisenhof Farm with George – Capt. in the 18th.\n\n27. October 6\n\nBack from Menin Road and the Ypres Station.\n\nThe entry that ends Oct. 4, 2 killed and 7 wounded. These were new reinforcements, newly joined from the Base. Another added to their number of killed, Jack Marks and Dick Seymour, now reported killed.\n\nThe squad was Jack, Dick, Mac and a new man.\n\nOctober 6.\n\nMac is reported only lightly wounded, but the A.D.S. people don’t know where he is. The body of Jack has been found, and by it some of Dick’s papers. Then Serg. Ridge, Transport, says he’s heard of Dick’s having gone through one of the other Aid posts, wounded.\n\nCapt. Davies wounded, and Morrie killed. Les is all right.\n\nCold grey rain skies, and fine dull rain, now the skies are darkening, and winter is here.\n\nGoing up with the G.S. Wagon, Marks driving, wrapped closely in my old Greatcoat, issued July ’15, Marks silent wondering at the rumour of his brother missing, and I losing it, Ypres road, in a dream of home, and of a wonderful room great and spacious, of large folios and lovely books, and of faded rich colourings, and fine pictures.\n\nComing back Marks silent and thinking of his brother killed, and the dead of these two stunts, my company.\n\nOn the Poy road repassed Frank Hungerford going up.\n\nOctober 6-7\n\n28.\n\nMail.. a letter from Court, the second or third in two years.\n\nAt about 3 this afternoon it rained heavily, and for an hour. After the sun shone a while, & Ted from tacking went over, and choosing a new grass spot, dug for the putting up of new horse lines, for his pair.\n\nOur horse transport lines are deep in churned slush mud.\n\n29.\n\nIn the Sydney Mail of July 11 are two short poems by Alan Seeger, one \"I have a Rendezvous with Death\" sends my order for his \"Poems\". They’ll make my reading before I order the 1st edit. of \"The Crock of Gold\".\n\nIt maybe he shall take my hand \n\nAnd lead me into his dark land.\n\nAnd close my eyes, and quench my breath –\n\nIt may be I shall pass him still.\n\nI have a rendezvous with Death\n\nOn some scarred slope of battered hill,\n\nwhen Spring comes round again this year,\n\nAnd the first meadow-flowers appear.\n\n30. October 7\n\nBack – 3 p.m. – from the Menin Road station and Ypres. The road by Westhoek blown up so traffic stopped. Raining and windy and bitterly cold. ‘Spotty’ came with us, and did the long miserable trip in super-misery between Marks and self on the seat – closely snuggling against wet greatcoats.\n\nOct. 7\n\n31.\n\nMet Alek Wilson and Mat. Miller turning in to our rendezvous – they details to 4th Battalion, and expecting to go up with the Batt tonight.\n\nAnd wearing the 28th Colours going through Ypres yesterday I’m almost certain I saw Jimmy Tubbs. The three 12th chaps still in the dugout; they were ordered to report by midday to 3rd Bgde. Hqs. – the order arrived to them per a Tommy Maj. at 2, so they’re hanging in till tomorrow.\n\nCapt. Davies – wounded when Morrie was killed, died of wounds yesterday. He’ll be a loss to the Ambulance, he being a gentleman and a Doctor. Back at Petit sec Bois, he chased me over the camp, to advise me to register a letter I’d placed for censoring, a letter containing 10 Francs. He was such Australian, so his popularity is half explained by his ancestry.\n\nThe bearers are out – in Ypres, one straggling tired party passed us, while we were held up by one of the corner congestions. Harold Long leading – a different Harold from he of Steenvoorde, and Andy and Mac and Jhonno’ – all tired and weary.\n\nOct. 7\n\nFrank Dunn too – changed almost beyond recognition. Later I saw him by the Canal, and the hour out had charged him as a tonic.\n\nThere’s no word of our relief. Jack stayed at Menin Road to take Serg. Wilson’s place, he evacuated sick, and Ted Reynolds here at the Wagon Rendezvous in his place.\n\nMail today – from Hendersons, John Drinkwater’s ‘Poems’ and an intimation of Shaw’s \"Sanity of Art\" being out of print and a 1st printing being available at 2\/6. ‘Letters of a Soldier’ trans. from the French from the T.B.C. That I’ll read, and mark passages – and send it to Mother. And another letter from Mat of six pages, a jolly chatty and good letter, received just an hour after my writing a dull cheerless letter to him – of missing and casualties.\n\nThe nights cold, and a grey laden sky is full of rain, but breaks of starr’d blue suggest the coming once again of the Boche raiding planes.\n\nOct. 8\n\n32.\n\nWord of three more being wounded: Major Frizelle, Maj. Kirkwood, and Martin the despatch rider. Now we’ve Col. Brennan, Maj. Lee, Capt. Fenton and the Q.M., Capt. Neeve, left. \n\nThere are no details, only the words.\n\n33.\n\nTo the A.S.C. dump by Dickebusch at 6 a.m.,and back to rendezvous by 8. Ted up in my place so alone here in charge of stores. George has just left after an hour’s yarning, of Shaw and Books, to him I loaned Frankeau’s \"City of Fear\". Speaking of Shaw he told a yarn of (Col. Butler of the 3rd).\n\nAll hours it seems Col. Butler blows into the office of the A.D.M.S., and the other day seeing by Basil some books, looked through them, Shaw’s ‘Doctor’s Dilemma’ caught his eye. Yesterday some mistake from the A.D.M.S. in the 3rd’s O. Room found his eye, and his anger turned against that office,\n\n\"Down at the A.D.M.S’s they seem to only eat and read Bernard Shaw!\" was his damning criticism.\n\nToday windy and cold, but the rain seems blown from the sky. The sun shines, but a bright light only.\n\n34. Oct. 8\n\nLate last night the wind finished the work half compleated some while back by a shell. A great tree by our track once had a torn shelled trunk, and a great piece had been torn from it. The wind crashed it down, where yesterday afternoon tanks had slept concealed.\n\n35.\n\nAll night long on our left the guns have been heavily bombarding, the flashing flickers made the world brighter than the full moon, and by night these flickerings make fantastick lively travelling of light from one cloud layer to another.\n\nWounded come down in Ambulances and great heavy motor lorries, and occasionally an odd man walks by the side of heavily trafficked roads. Some jocks are amongst the men on Menin Road – their kilt girt thighs and magnificent knees, grey with dried mud.\n\nOn the field the kilt is the only surviving relic of the days when war dressed her followers elaborately, and to us it is always an inspiration, meaning hard fighting and support.\n\nIt is mud, mud, mud, and the rain and wind mean misery and hell’s tormenting, the guns are callous, they know no sun, nor warmth of nature. All day long they dully roar, and shatteringly kill.\n\nOct. 8\n\nAll day long the youth of the world, with minds strung to breaking point march to the line; their eyes seeing skeleton ruins, gaping holes, and sudden showers of high flung earth and bricks – on happily just the man in front of him. All day long the Artillery are drawing to their guns long lines of mule teams laden with sudden compacted deaths, and all day long the unladen mules go back, save those the shell struck.\n\nAnd all along the road the old men sweep and clear – fill in and stamp hard the new torn hole – move aside the dead horse team,and the splintered limber or wagon.\n\nThe youth of the world winds up and down the road, to and fro through the low valleys, climb carefully the low ridge, and die suddenly – slowly, or comes back elated or dull’d.\n\nThe roads are full of the beauty of the world, and the terrible horror of war.\n\n36.\n\nMetcalf to Artillery Details – our man sent there in July just after Bobby Aspinall was killed, wounded the day before yesterday.\n\nOne of the A.S.C. horses here caught a piece of shrapnel in his left eye, so I acted the Vet.\n\n37. Oct. 8\n\nThis pay I’ll have to let the T.B.C. have at least 30 Francs, and I’d looked to sending to Barkers for James Stephen’s \"The Crock of Gold\".\n\nMurph and Ray have gone up and relieved Les and Buckholz from the advance post. Frizzle seems by report to be badly knocked – an abdominal, while Kirkwood is remaining on duty. Mac’s physical state remains shrouded in mystery.\n\nMail not in yet, expecting the October number of \"To-Day\".\n\nLater\n\nMail, a letter from the T.B.C., Oct. 3, Alan Seeger Diary and letters, Poems of Ledwidge, and Drinkwater’s Prose Papers not yet out of the publishers hands, but on publication they will be forwarded. They also regret their inability to find \"More Works of Max Beerbohm\".\n\nAnd a paper, \"The Sunday Pictorial\", Oct. 7. Over page I have gumm’d a map from their news page. This appears there under the title of ‘England in the War’ – ‘The Burden of the Sacrifice.’\n\n‘Reuters Agency is enabled to quote some later figures as to the proportion of English troops participating in the war, the publication of which is necessary in view of continued German propaganda that troops from other parts of the Empire are being made to bear more than their share of the fighting.’\n\nOct. 8\n\nSince July 31 up to date the proportions of men engaged are as follows:-\n\nEnglish – 70 p.c.\n\nOverseas – 16 p.c.\n\nScottish – 8 p.c.\n\nIrish – 6 p.c.\n\nThe casualty proportions are –\n\nEnglish – 76 p.c.\n\nOverseas – 8 p.c.\n\nScottish – 10 p.c.\n\nIrish – 6 p.c.\n\nIt is almost evident – to us – that the ‘German propaganda’ referred to, is simply the worded opinion expressed amongst ourselves.\n\nIt is a fact, that in every big advance, with the one exception of the Vimy Ridge, the Australian Divisions have taken their big share, and at every part of the line they have been put to, there has been increased activity on that front.\n\nAnd Vimy Ridge was Canada’s. C.E.W. Bean, from the same paper as the above numbers..\n\nIt is now allowable to state that the centre of yesterday’s great battle was occupied by a single solid phalanx of Australian & N. Zealand troops, which constituted the greatest force of Australasian soldiers or those of any Dominion that ever attacked simultaneously. The powerful Southern striking force formed the centre of the yet more extensive British line…\n\nThe using of the word ‘English troops’ for those Scotties before Polygon Wood is typical of the Englishman’s idea of Great Britain simply meaning ‘England’.\n\nOctober 9\n\n38.\n\nThe stunt by the 2nd Division has been fully successful, this morning the Ypres station and Menin Road posts fairly busy.\n\nAt Ypres saw Les, he relieved from the advanced aid post. The trip quiet and uneventful. The dead, shell-burst bodies of horses still lie by the Ad. D.S. The guns – the naval guns rather busy, and land in their work. The after flame and smoke from the 12\" howitzers near the comforts fund station seemed like the breath of some terrible old dragon. The flame smoke was a touch of colour in a grey and brown landscape: stabs of flame all spotted over it, and rush of sudden smoke in the sky.\n\nComes the rumour of the French & English attacking on our left, then being successful in gaining their objective, and of the advance begun by Newport.\n\nYesterday Paddy Hornstein shell shocked, and Jackie Lane wounded: various wounds from thigh down leg.\n\n39.\n\nThis afternoon reading Drinkwater’s \"The Storm\". In his preface – a note. Drinkwater says it has always been successful in staging – even before strange audiences.\n\nI enjoyed the reading of it immensely and will read it again. And I am glad now I wrote Mayhew for the 1st impression of ‘Olton Pools’.\n\nIt’s to ‘To-Day’ I owe the pleasure now in Drinkwater – new to my writers to read.\n\n40.\n\nTonight I’ve read again a letter-note I’ve carried since receiving it – last November, a note of no date, of heading 8 p.m., and folded to the address, ‘To Jake’s stable companion’.\n\nDear Old Val, and at Steenwerke Sister Stuart told of your being married. Our talk of Browning and Keats and Brooke, of Procter and of Byron. Two days and we were close friends of no reserves, and our walks in Picardy, they are memories I cherish, and I to think of you married, Dear Val, why?\n\nWalks over lovely hills, and our lives all the same, those lovely swift cloud skies, and great patched hills, of purple new turned earth, and young green, and that white road we were lost o\tn, that brought us to the crest of a lovely ridge – where it turned by three etched leafless poplars, faint but clear against grey-blue skies. And the rain we were caught in, and our happy anxiety.\n\nOctober 9\n\n41.\n\nEntering in the dug-out: between blankets, and with an issue of Rhum by the side. If the transport only knew.\n\nWalking over from the store, it was a walk by gun-flash light, there’s another terrible bombardment on – one long loud echoing booming.\n\nToday the three 12th boys left for their Batt. Garrey and Murph and that other chap,.. three Tasmanians and good company. In their place some of the 4th Division A.S.C. – attached to the Engineers.\n\nThe bombardment on our front, this morning at the Ypres station, talking to Les, he dressing one of the 2nd Divy., I spoke of the reported relief of tomorrow, the Inf. boy took me up. \"Are they returning us too? God, I’ll cry if they don’t: its bloody murder there.\"\n\nOver their putties they’re wearing wound sandbags, & the mud covers their legs to the thighs.\n\nTwo peoples, or funds all the Division thanks go to, to the Comforts Fund, and to the Y.M.C. At the Menin Road and Ypres their coffee and cocoa, and the cigarettes and biscuits come to the men when their worth is beyond estimate.\n\nDevonshire Camp Billets\n\n42. ","13":"\n\n\"He was a man who controlled his fear, so that you didn’t know of it: but he told us he was wordy – though he didn’t look it!\" Wilky tonight on Hunt.\n\nThe Bearers are back, and in a hut at Devonshire camp. I’m with them again, with a brazier in the middle and the sweet smell of burning wood, the evening ends in a yarning from between blankets.\n\nBut Ernie and Paddy are dead…sapper and Nick and Toby and dozens of others who made our brazier nights last year at Flers and Longueval are away and in the next huts new reinforcements take their places.\n\nOct. 11\n\n43.\n\nThis morning at 8.30, issued with underpants and shirt, new. Then on to Baths, and a hot wash. Last night we were a crowd of unshaven, unwashed roughs, we’re almost presentable now, though trousers are torn and putties and boots mud caked. Boots are all more or less well worn, and we’ve no bootmakers. Jimmy was killed early in the first stunt by the D.S. on Menin Road.\n\nIdiot French, Jargon French, jabbering French. Retaliation Farm, Sanctuary wood, Identification lines. Names of terrible suggestion.\n\nOctober 11\n\n44.\n\nPosted today letters of 8th, 9th and today’s note to Mother, answering letter from Missing & Wounded re Scottie Leask, and note written at Steenvoorde to Auntie Louie.\n\n45.\n\nToby has \"come a gutzer\". In a note to Clarrie dated Oct. 2 from Con. Camp, he expects to be back shortly. ‘The damn wound wasn’t half big enough, and it healed too quickly. They never operated on it, I can still feel the piece of shell: still I’m satisfied, you know it may do for a future occasion.’ Sadness has set in once again: I’ve two cigarette buts, four Y.M.C.A. Tickets, and a tray bit, to carry on the good work with.\n\nAnd Sol had a note from Peter, Peter in Blighty and expecting a board for Australia. Peter starts the note in writing, then adopts printing then back to writing, a page in all, and all Peter. \"Things are crook’ he prints.\n\n46.\n\nThis afternoon, after parade, I tried the country for a walk. The sun has been shining clear after days of grey skies and rain. But the roads are mud, and the country flat, and never a place without huts, or camp or horses or dumps, so back to hut Billet.\n\nWalking the old song of Father’s, \"In Old Madrid\" was running through my thoughts, and strangely, I thought I’d like to hear Hazel play its melody and wondered if her touch was lovely or hard.\n\nMick’s trying to light and set burning well an old battered last winter’s brazier. Wilk, and Archer and Willie are writing, accumulated mail debt of three weeks.\n\nIn between blankets,\n\nA walk to Ooderdoom with Frank, Arthur and Wilk with our various washing.\n\nHere’s tipping two of the stunts M.M.s, Tommy Eldridge and Bill Dunn. I’d like to see Wilk decorated and Willie Jesmond. Les Ford may be in the running for Advance Dressing work, RoRy Farlay bearers too.\n\nAt midnight Perk and Maj. Lee go on leave to Blighty. No mail today, or yesterday.\n\n47. ","14":"\n\nParade at 9, and dismissed after Roll call, then a green envelope issue, so letters may go home unread by the officers here.\n\nFor an hour this morning printing a list of Medical Pannier holdings, and then till now, near midday, reading more of Letters of a Soldier. They are such letters as I\n\nOct. 12\n\nwould write if I were true to my inner feelings, but the writer of these letters was purely an artist, I am a dilettante.\n\nMy library holds Drinkwater’s Poems, and Letters of a Soldier, and Brooke and Keats.\n\nFrom Letters of a Soldier, letter of November 19, in the morning, up till then I had never imagined how different is the courage required by this kind of anonymous warfare from the traditional valour in war, as conceived by the civilian. And the clamour of this morning reminds me in the midst of my calm, that young men, without any personal motive of hate, can and must fling themselves upon those who are waiting to kill them. And from ‘X = O’ of Drinkwater, Salvious:\n\nNor strange: who goes in company with death,\n\nWatching his daily desolation, thinking,\n\nOn every stroke, of all the agony\n\nThat from that stroke goes throbbing, throbbing, throbbing,\n\nForgets all hate. How should we hate the dead,\n\nAnd when death ranges as amongst us now,\n\nYou, Pronax, I, and our antagonists\n\nAnd friends alike are all but as dead men,\n\nMoving together in a ghostly world,\n\nWith life a luckless beggar at the door.\n\n48.\n\nBetween blankets, nailing rain against the Malthoid covering of the hut, and by candle light is playing poker over an improvised table. Archer reading in bed, and Wilk and some others out toward Ooderdoom.\n\nPay I drew 80 Francs, 30 will go to the T.B.C., 15 to Hendersons for the too long delayed orders for Poems of Alan Seeger and War Poems of Vernide.\n\nMail brought a letter from Elsie – newsy and of her new millinery venture by Grace’s studio in King St… the Oct. ‘To-Day’, and Poems of Ralph Hodgson… the third impression. Yet they are unread but the first poem. The Gypsy Girl, \n\n‘A Man came up too loose of tongue\n\nAnd said no good to her:\n\nShe did not blush as Saxons do,\n\nOr turn upon the cur:\n\nShe fawned and whined \"Sweet gentleman,\n\nA penny for three tries!\"\n\nBut oh, the den of wild things in\n\nThe darkness of her eyes.’\n\nClarrie had a note from Bert Reynolds – Blighty, and he doing well.\n\nFrom Les received a long letter of 9 pages from Basil – newsy – \"To Mum and the Girls\".\n\nBob has, it seems, lost my haversack of books – Masefield 1st edition of Martin Harvey, and a lot of Mother’s letters.\n\nPosted letters to Mat. & Court, square.\n","15":"\n\n49.\n\nGreyness over the skies, and the three trees by us like faint etchings, faintly and timidly drawn and partly coloured yellow green and brown red.\n\nNow the rains heavy, and the only light blown candles.\n\n50.\n\nPoems, Ralph Hodgson\n\nTime you old Gypsy Man.\n\nTime you old gypsy man\n\nWill you not stay,\n\nPut up your caravan\n\nJust for one day?\n\nAll things I’ll give you\n\nWill you be my guest,\n\nBells for your jennet\n\nOf silver the best,\n\nGoldsmiths shall beat you\n\nA great golden ring,\n\nPeacocks shall bow to you,\n\nLittle boys sing,\n\nOh, and sweet girls will\n\nFestoon you with may,\n\nTime you old gypsy man,\n\nWhy hasten away?\n\nLast week in Babylon\n\nLast night in Rome\n\nMorning, and in the crush\n\nUnder Paul’s dome:\n\nUnder Paul’s dial\n\nYou tighten your rein –\n\nOnly a moment,\n\nAnd off once again:\n\nOff to some city\n\nNow blind in the womb.\n\nOff to another,\n\nEre that’s in the tomb.\n\nOct. 13\n\n\"The Song of Honour\"\n\nI stared into the sky\n\nAs wondering men have always done\n\nSince beauty and the stars were one,\n\nThough none so hard as I.\n\nIt seemed, so still the valleys were,\n\nAs if the whole world knelt at prayer,\n\nSave me and me alone:\n\nSo pure and wide that silence was\n\nI feared to bend a blade of grass,\n\nAnd there I stood like stone.\n\nI heard the hymn of being sound \n\nFrom every well of honour found\n\nIn human sense and soul:\n\nThe song of poets when they write\n\nThe testament of Beautysprite\n\nUpon a flying scroll.\n\nThe song of painters when they take\n\nA burning brush for Beauty’s sake\n\nAnd limn her features whole.\n\nThe song of men all sorts and kinds,\n\nAnd many tempers, moods and minds\n\nAs leaves are on a tree,\n\nAnd many faiths and castes and creeds,\n\nAs many human bloods and breeds\n\nAs in the world may be.\n\nThe song of each and all who gaze\n\nOn Beauty in her naked blaze,\n\nOr see her dimly in a haze,\n\nOr get her light in fitful rays\n\nAnd tiniest needles even,\n\nThe song of all not wholly dark,\n\nNot wholly sunk in stupor stark\n\nToo deep for grasping Heaven.\n\nOct. 13\n\nI heard it all, I heard the whole\n\nHarmonious hymn of being roll\n\nUp through the chapel of my soul\n\nAnd at the Altar die,\n\nAnd in the awful quiet then\n\nMyself I heard, Amen, Amen,\n\nAmen I heard me cry!\n\nI heard it all and then although \n\nI caught my flying senses, Oh\n\nA dizzy man was I!\n\nI stood and stared: the sky was lit\n\nThe sky was stars all over it.\n\nI stood I knew not why,\n\nWithout a wish, without a will,\n\nI stood upon that silent hill\n\nAnd stared into the sky until\n\nMy eyes were blind with stars and still\n\nI stared into the sky.\n\n\"The Bells of Heaven\"\n\n‘Twould ring the bells of Heaven\n\nThe wildest peal for years,\n\nIf Parson lost his senses\n\nAnd people came to theirs,\n\nAnd he and they together\n\nKnelt down with angry prayers\n\nFor tarred and shaggy tigers\n\nAnd dancing dogs and bears,\n\nAnd wretched, blind pit ponies,\n\nAnd little hunted hares.\n\nFragments.\n\nReason has moons, but moons not hers\n\nLie mirror’d on her sea,\n\nConfounding her astronomers\n\nBut O! delighting me.\n\nGod loves an idle rainbow,\n\nNo less than labouring seas.\n\nBabylon – where I go dreaming\n\nWhen I weary of Today,\n\nWeary of a world grown grey.\n\nStill a few more to read, then I’ll use the book as a Christmas card to Mat.\n\n51.\n\nIn the afternoon leave to Poys. with Frank. An enjoyable afternoon and the town a pretty little place shining in one or two ugly spaces between quaint houses where bombs or shells have exploded. By the large church more bombs seem to have been dropped than in the other part of the town, and all its windows shew fragments of missing lights.\n\nFor supper a little of Malaga, some coffee and shortbread, and back to hut billet.\n\nNo mail today.\n\n52. ","16":"\n\nPosted to Mother a handkerchief and to Mr. Hadley \"Martin Hyde\" of John Masefield’s.\n\nIn Poperinghe bought Arthur Ransome’s ‘Bohemia in London’, 1\/- - 2.50 F., and saw a rush of ‘Colour’ – of lovely colour reproductions.\n\nOctober 14\n\n53.\n\nToday I become qualified to wear the two service stripe no-one in the unit wears, perhaps as well, for two look meagre beside the three many could wear.\n\nThe loveliest memory of today two years as the calling to mind, and it comes always fresh, of the sun setting and flinging its millions of golden arrows on the dark water… and after that the passing between the heads.\n\nThe night black and the water black, and suddenly the searchlight from South & Middle heads on the water and full on the A.17, and the ‘Captain Cook’, and the Captain Cook’s siren shrieked. \"You noisy barstard!\" and as he said it by my side he half sobbed. We were crowded on the first deck, embarked on our great adventure… two years ago. Those memories and of the months in camp are good. .. The crowded train that left Sydney at 11.30, and brought us to camp about 1, and the singing crowd on the station then, on the bridge and steps, and the rush for the taxi for the A.M.C. & Light Horse camps… and from the Measles, Mumps and V.D. Compounds too.\n\nLiverpool and those terrible winds that brought great clouds of red dust on them, and the heavy rain that swamped half the Infanty lines , and the rich sun and the road by the camp that we used every morning, the road between tall trees and one lovely patch of wattles.\n\nAnd how Liverpool we cursed!\n\nMail today from Elsie \"The Sydney Mail\" of July 18.\n\n54. October 15\n\nTo the coffee and cake shop by the rail gates of Poys. for supper with Clarrie and Frank, last night.\n\nFrom the camp by the time we’d reached the Popys. road, the mists had risen high from the ground: and the sky was blue grey, with the first faint stars coming out. I was watching them as their light came visible, when one great flame quickly grew over where the lines run. As it sank slowly into the mist the gold of it grew, and till it had fallen right out of sight and a while after, the then incense like rising smoke and sparks made a high fantasy into the night.\n\nOct. 15\n\nOn Poys. the planes dropped their bombs, quite unhindered by the eleven strong searchlights round the city.\n\nOnly for the fear they fought, the night effects, the tracer bullets, the searchlights, the star shrapnell flashes, and one lovely parachute light dropped, that fell slowly lighting all the city to the planes, the whole raid made loveliness unsurpassed, that meant hideous death and ruin about where the bombs fell.\n\nPassing the Y.M.C.A. by the camp a strong singing of ‘Lead Kindly Light’ carried far down the roads. No hymn can touch Newman for loveliness and popularity with the troops, and then singing of it is always a song to listen to.\n\nTurning in reading Ransome’s ‘Bohemia in London’, read three lovely little essays contained in it, \"The Bookshop of Bohemia\", \"Some Newspapers and Magazines\" and \"Ways and Means\". The book worth all the carrying of its hard cover about Poperinghe, and worth the keeping. Will pass it on to George.\n\n55. ","17":"\n\nUnderwood – ‘Hunty’ of Henencourt hears of his going shortly to Oxford to the O.T.C., and the morning offered the taking of my third journal to post in Blighty. I think I’ll keep it myself, though the carrying of it takes another book place.\n\nParcelled up ‘City of Fear’ and ‘Pawns’, addressed to Mr. Hadley, also ‘Poems’ to Mat. with the end of the years love. Yet to be censored. Later: censored by Phillips.\n\nTurned in early – a raid in progress, and during it two Gothas above us in the light of 11 searchlights.\n\nThe night clear and star’d, the stiff searchlights rising from behind the darkly silhouetted huts… a lovely sight.\n\n56. October 16\n\nTurned in last night reading \"The Point of View\" of Benson’s, and finished it at breakfast…which has been quite a meal since we’ve been here\" Porridge, Bacon, and Bread and Jam.\n\nA Route march, and back in huts read a while ‘The Letters of a Soldier’. They are all fine, and all well written. It is a book for quiet thinking, , after.\n\nOctober 16\n\n57.\n\nMail yesterday from the T.B.C., \"The Collected Works of P.H. Pearse\" and \"My Childhood\" of Maxim Ghorki … ‘Pearse’ I sold to Frank. .. ‘My Childhood’ I wrote for early in our Henencourt days… and it arrived yesterday. I loaned it to Bob, he being in the Post Office, and being keen on the Russian schools.\n\nToby back yesterday… only to Etaples to the No. 1 Canadian General, and he brings reports of its being a most terrible place, Mills with him, and Radis. Mills was evacuated sick early in this last terrible stunt.\n\nErnie Brown died of his wounds on the hospital train, after weeks at the C.C.S.\n\n‘Requiescat in Pace’.\n\n58. \n\nMail, a letter from Nick – from the 3rd Aust. Aux., doing well, and expecting his furlough, which he intends’ to spend the time in Ireland.’\n\nThe day ends coldly, and a wind has blown heavy clouds over the skies…grayness of sky and grayness of earth – rising mist.\n\nIn the hut six playing Rakish Kate, or some such fantastically named card game.\n\nOutside the wind.\n\nOctober 16\n\n59.\n\nA Route March this morning, about the camp and about and about. An aimless wandering along mud cobbles and mud roads. In two-deep formation, with Carnty my coverer. Always, with or without pack, on a Route March, unless the country is lovely and un-scarr’d. I lose all the distance, my thoughts always with books: those I have, those I’ve read, those I’m only waiting for.\n\nThis morning I was arranging, and shelving that collection of my dreams, of books of all periods, manner and forms.\n\nSide by side \"The Green Carnation\" and \"The Autobiography of a Boy\" – each quietly laughing with the other…. and telling of their exquisite satires…. Collins and ‘Pepys’ superbly bragging of conquests and their art. .. A.C. Benson alongside his beloved Walter Pater, and separated by \"The Sixth Art\" next to \"The Seven Lamps of Architecture\" – in its time rubbing shoulders with ‘The Adventurous Simplicissimus’ alongside Swinburne or Browning. And Cuala Press, W.B. Yeats books by ‘The Golden Ass’ and Vale Press, Morris by Bains’ Indian Tales.\n\nAll the charming, grotesque, loveable and beautiful writers, and poets and philosophers all happy in their placing, side by side.\n\nOctober 16\n\n60.\n\nThe Literary Supplement, Oct. 11, today… a dull uninteresting issue. It announces Frankeau’s ‘Woman of the Horizon’ – and I’m half for sending for it. Chatto and Windus announce Charleston’s \"Short History of England\", and the 3rd impression printing of Nichol’s \"Ardours and Endurances\". Always Chatto and Windus announce their new books more finely than the other publishers.\n\nIn ‘Notes’ Blackwells announce the first four volumes of a new library of classics. ‘The Sheldonian’ series of reprints and renderings of Masterpieces in all Languages…. a rather full covering and ambitious series… The first 4 include three attractive titles, \"Songs and Sayings of Walter von de Vogelweide\" Mennesange by Frank Betts (he of that all ‘Iron Age’ book of verse), ‘Sir Thomas Browne’s letter to a Friend’ upon the occasion of the death of an intimate friend, \"The Funeral Oration of Pericles\", trans. by Thomas Hobbs of Malmesbury and Mystical Odes of Jelahadin Rumi trans. by Reginald Hewitt.\n\nNo prices or dates of publishing are announced, but from now-a-days series they ought to be well and beautifully published.\n\n61. October 16, 17\n\nWrote to Jake, and to Mrs. Hadley, square, and to Aitkinson, 97 Sutherland Road, Forest Hill, S.E., and to Harold N. To Mother posted letters 13th, 14th & 15th. Owe letters to Betty, Geoff, Grandma, Mrs. Curtis, Mat. and the Whittels.\n\nDecorations to the unit to date from the first stunting of the advance MacCrae, D.C.M., Roy Findlay, M.M., and Birch, M.M.\n\n62. October 17\n\nFatigue this morning – the building of a mound of earth about the horse lines: protection against bombs dropp’d. Again 20 chaps up to Ypres clearing the way for a new light railway. Today Buckholz, Johnnie and Carty up. Leaving here at 6 a.m., they arrive back at 8 p.m… a long day’s heavy fatigue.\n\nRidge – Ridgway – back: he knocked at Bullecourt by the embankment R.A.P. about midday the second day.\n\nA cold day. Wrote to Erskine Macdonald for Street’s Undying Splendour, Coulsen’s From an Outpost and Under the Open Sky, by Harley Mathews, A.I.F. Enclosed a 10 Franc note. Yet to send 30 to the T.B.C.\n\nOctober 17\n\n63.\n\nTo Ouderdom tonight with Frank for the washing we left there last week….\n\nThis afternoon no parade. In one of the low mansard huts, an hour listening to musick… George practising some Hungarian Folk Songs he bought in London, Jack playing the Dulcetone. Songs with lovely and quaint melodies….full of passion and exotic loveliness…. I leaned against the side of the hut, and imagined a nice setting… a white highly ceilined room…. big windows, and white walls…. the half light of early night, and a soft light for clustered candles…. a concert grand reflecting on its black ebony wood the light of the candles…. the soft interrupted singing of George, and the repetition of difficult melodies…… the pauses of easy interested discussion, and the sung again, in the melody replayed, and myself in a deep great comfortable chair, leaning back from some lovely book – of verse or drawings, and a cigarette smoking unerringly and softly blue between my fingers, lost in the and beauty of the moment’s mood.\n\nNo mail today.\n\n64. October 18, 19\n\nRead again last night, and this time with all enjoyment W.B. Yeats Noh Play, The Hawk’s Well.\n\nThis morning a route march… to the Baths by Ouderdom..\n\nAn issue of green envelopes by Norm Reed’s successor….another S. Aust. man, and a late friend of Reed’s. He comes with a good name by reinforcements from the Base.\n\nOctober 19\n\nBetty’s Birthday\n\nLast night a dinner to the unit from canteen funds.... judged by hilarity and beer consumed it was a compleat success. The Troops shipped…. to be vulgar. But for sheer enjoyment such a dinner and night can only be spent by a small company, twenty congenial spirits at most. Becordel stands in our memory as the greatest of enjoyed nights… and of all that were there…who are left: Clarrie, Toby, Bill, Fell, McNeil & Sol. The others dead. P.B. back in Australia or in Blighty.\n\n66. October 19\n\nRelated in the Huts.\n\nEngland: an estaminet: Australians and Americans.\n\n\"Walt: I don’t think much of the god-damned beer, and its enough!\"\n\n\"No! it is been waiting three years on the counter!\"\n\nAnd another little pleasantry resulted.\n\n67.\n\n‘The Letters of a Soldier’, I have finished reading them this morning. It is a book as lovely and wounderful as an old poem. A book that should go singing of the \"rich dead\" down all the years to come.\n\nI have marked many paragraphs…. and they are all to my Mother, to take to her some feelings I haven’t well written.\n\n68.\n\nThe Mother, P. Pearse\n\nI do not grudge them: Lord, I do not grudge,\n\nMy two strong sons that I have seen go out\n\nTo break their strength and die, they & a few,\n\nIn bloody protest for a glorious thing,\n\nThey shall be spoken of among their people\n\nThe generations shall remember them\n\nAnd call them blessed:\n\nBut I will speak their names to my own heart\n\nIn the long nights:\n\nThe little names that were familiar once\n\nRound my dead hearth.\n\nLord, thou art hard on Mothers:\n\nWe suffer in their coming and their going:\n\nAnd tho’ I grudge them not, I weary, weary,\n\nOf the long sorrow – and yet I have my joy,\n\nMy sons were faithful, and they fought.\n\nOctober 19\n\nOh Lovely Head, P. Pearse\n\nOh lovely head of the woman that I loved,\n\nIn the middle of the night I remember thee:\n\nBut reality returns with the sun’s whitening,\n\nAlas, that the slender worm gnaws thee to-night.\n\nBeloved voice, that wast low and beautiful,\n\nIs it true that I heard thee in my slumbers!\n\nOr is the knowledge true that tortures me?\n\nMy grief, the tomb hath no sound or voice?\n\nFrom The Collected Works of P.H. Pearse, Maunsell\n\n69.\n\nCorps Order No. 756, 19.9.17\n\nby Col. E.T. Brennan\n\nStrength: No. 4066 Pte. Mitchell and No. 641 Pte. Algie W. were evacuated to hospital wounded on 17th inst.\n\nThe following were evacuated to hospital on 18 inst.\n\nNo. 8090 - Pte. Nicholson, H.E.\n\n9180 – Pte. Matthews, J.J.\n\n14318 – Pte. Stubbs, A.W.\n\n195 – Pte. Owens, C.V.\n\n14832 – Pt. Firman, W.H.\n\n8533 – Pte. Bottger, J.K.\n\n8514 - Pte. Bishop, J.\n\n7730 - Pte. Barton, R.O.\n\n14651 – Pte. Dival, S.V.\n\n9374 – Pte. Robbins, C.J.\n\n1256 – Pte. O’Houlihan, P.\n\n241 – L\/Cpl. Mulholand, J.L.\n\n1168 – Sgt. Reed, N.H.\n\n2406 – Pte. Maroney, R.W.\n\n101 – Pte. Brown, R.E.\n\n8667 – Pte. Cochrane, G.H.\n\n4316 – Pte. Young, A.V.\n\nover\n\ncontinued\n\nCasualties, Ypres Sector\n\nDeaths: The deaths are announced with great regret of the under-mentioned men of the unit, who were killed in action on 18th inst.\n\nNo. 9906 – Pte. Downie, J.\n\nNo. 187 – Pte. Flowers, F.\n\nNo. 16054 – Pte. Nix, J.C.\n\nBurial at Military Hut Cemetary on 19.9.17.\n\nCorps Order 758, 21.9.17\n\nWounded: No. 1224 Pte. Knight was evacuated to hospital wounded on 19 inst. Death: The death is announced with great regret of No. 14362 Pte. Nielson, C., who died of wounds received in action on 19th inst.\n\nCorps Order No. 760, 23.9.17\n\nStrength: No. 1962 Pte. Horsell, H., was evacuated wounded on 21st inst.\n\nCorps Order No. 761, 24.9.17\n\nStrength: No. 151 Pte. Bain, W.T. was evacuated to hospital wounded on 21st inst. No. 16126 Pte. Danslow, G.A. detached for duty A.A.M.C. detail 1st Machine Gun Coy. evacuated wounded 21st inst.\n\nCorps Order No. 766, 29.9.17\n\nDeaths: No. 1168 Sgt. Reid, N.H. and No. 1256 Pte. O’Houlihan, P., previously reported wounded 18.9.17 are now reported died of wounds 18th inst.\n\nCorps Order No. 767, 30.9.17\n\nWounded: No. 16285 Pte. Piam, E.A. was evacuated to hospital wounded 25th inst.\n\nCorps Order No. 768, 2.10.17\n\nWounded: the following men of Unit have been evacuated wounded –\n\nNo. 14498 – Pte. Squires, C.G., 28.9.17\n\n16661 – Pte. Crawcour, I., 28.9.17\n\n5514 – Cpl. Keil, W.E., 2.10.17\n\n4749 – Pte. McMahon, P.W., 29.9.17\n\nCorps Order No. 769, 3.10.17\n\nDeath: The death is announced with regret of 101 Pte. Brown, R.E., who died of wounds on 28th inst.\n\nAttachments: A party of 150 men from Infantry were attached to unit on 1st Inst. for duty as Stretcher Bearers.\n\nWounded: The following men of unit were evacuated wounded on 3rd inst.\n\nNo. 8665 – Pte. Burton, O.R.\n\n9141 – Pte. Rowe, R.J.\n\n9140 – Pte. Pullen, R.A.\n\nCorps Order No. 771, 5.10.17\n\nWounded: No. 1054 Pte. Brittain, C. detached for duty as A.A.M.C. detail 2nd F. Coy. Engrs: was evacuated wounded 4th inst. No. 13801 Dvr. Kensitt, H.W. was evac., wounded 3rd inst.\n\nCorps Order No. 771, 6.10.17\n\nDeath: The death is announced with great regret of Major G.M. Hunt who was killed in action 4th inst.\n\nCorps Order No. 773, 7.10.17\n\nDeaths: The following deaths are announced with much regret:-\n\nCapt. J. Davies, died of wounds 6th inst.\n\nNo. 305 – Pte. Morris, J.H.W., K.I.A., 6th inst.\n\nNo. 9767 – Pte. Seymour, R.R., K.I.A., 4th inst.\n\nNo. 7888 – Pte. Marks, M.L., K.I.A., 4th inst.\n\nNo. 17085 – Pte. Dobbs, D.W., - K.I.A., 4th inst.\n\nNo. 17045 – Pte. Murphy, R.H., K.I.A., 4th inst.\n\nNo. 16645 – Pte. Levin, H.G., K.I.A., 4th inst.\n\nWounded: No. 14563 Pte. Fletcher, F.D. detached for duty A.A.M.C. Detail 1st Aust. F.A. Bgde. evacuated wounded 6th inst.\n\nThe following men were evacuated wd’d. on the 4th inst.\n\nNo. 7769 – Pte. McDonald, E.G.\n\nNo. 6299 – Pte. Ryan, P.\n\nNo. 17053 – Pte. Spicer, W.A.\n\nOctober 19\n\nCasualties Continued\n\nCorps Order No. 775, 9.10.17\n\nWounded: Major T.J. Frizzel was evacuated to hosp. wounded 8th inst. Major N.E.B. Kirkwood was wounded on 8th inst., and remained on duty. No. 220 Pte. Laver was evacuated to hosp. wounded 8th inst. No. 223 Cpl. Havenstein, D.D., was sent to D.R.S. wounded on 8th inst. \n\nCorps Order No. 778, 12.10.17\n\nWounded: No. 165 Pte. Watts, R.C., was evacuated to hospital wounded on 4th inst.\n\nCorps Order No. 785,","18":"\n\nWounded: No. 17622 Pte. Hambly, W.J., attached to 1st Aust. F.A. Bgde. was evacuated to hospital wounded on","19":" inst.\n\nEnds Casualties to date of stunting since","20":"\n\nKilled in action – 10\n\nDied of wounds – 5\n\nWounded – 39\n\nCasualties – 54\n\nOctober 19\n\n70.\n\nGood old Horatio!\n\nMr. Bottomly!!\n\nJohn Bull!!!\n\nSo there will be no more warnings: watch Russia!... and we will read no more ex cathedra prophecies. You tell us of ‘discarding the mantle of the Prophet’.\n\n\"Not because I have found my data wrong, but there were so many people – Politicians, I think they are called – possessing and exercising the power to interfere in the conduct of the war, that everybodies calculations (including those of the Generals in the field) were being so constantly upset, that I came to the conclusion, that all prophesy – whilst that state of things endured – was in the nature of guess work, and decided to abandon it.\"\n\nOct. 6, 17\n\nBut, dear John, we readily forgive you, you have made Doug live for us: you tell us he –\n\n\" is essentially a military organiser and strategist… He is a man of mystery- never in a hurry, never ruffled.\n\nI was much impressed, whilst at Headquarters, with the implicit faith which every member of the staff has in him. In the middle of lunch he quietly left the table, and went into his office – where he remained a quarter of an hour, quite alone. \"The Chief has thought of something\", said one of the A.D.C.s, \" something important, to leave us\n","21":"\n\nlike this\".\n\nNow John, do be faithful to us, why are you keeping back such a lot – tell us what you had told to Doug, that ‘he quietly left the table – and remained away a quarter of an hour – in his office, quite alone’. And, you ‘were alone with him for some time before lunch’, and you tell us ‘we understand each other’.\n\nJOHN! DID HE TELL YOU?\n\nWhy must you \"\nnot\n tell us\", \"the date at which, and the circumstances in which, in the opinion of Sir Douglas Haig, the war will end\" – and did he really pass around the vegetables just like any footman or waiter:\"? How sweet of him!.... What a day you had John, lunching at Headquarters, and a day in the Trenches.\n\n\"Ah! but it was worth while\" you say, \"to have seen the boys fighting: to have sat with them, and shared their steak and chips in the dug-outs\".\n\nAnd the nasty Allemande sniped at you…\n\n\"Then, after we had left the trenches and were crossing some open ground, we got a signalled message to the effect that an observation baloon of the enemy had spotted us, and we were directed to separate and lie down. But, except for one abortive shell – which dropped very wide of us – nothing happened, and we continued our journey until we got into some natural cover. \n\nBut dear John, let me whisper it from the light point of the tip of my pen, is this true, ‘The war is won’, is it? John, who told you?\n\n71.\n\nA rainy cold dull day… and a heavy bombardment this morning and now.. the Boche has hardly counterattacked.. No word of its effects yet here.\n\n72. October 20\n\nThis morning early a long and terrible bombardment.. shells going over us to Poperinghe… and a raid somewhere near Pop. that dropped bombs of some terrible size.\n\nThe morning fatigue again to horse lines, and an early finish. Then with Ridge to Y.M.C.A. Hut, a letter written to Bet, dated yesterday, & tea and biscuits. Back to huts, the section had been paid..Dinner… Paid then with the Transport: drew 40 F. – which will make me overdrawn at the end of the month, and posted to T.B.C. 30 F. – and reminded them of \"Certain Noh Plays of Japan\".\n","22":"\n\n73.\n\nBob has loaned me Ogilive’s \"The Australian\". This morning at the Y. .. copied out Poems of Brooke, ‘The Bush’.\n\nOf its kind a decent little book of running verse…readable but not read with the enjoyment of Watson..Masefield… or any of the other great present minor Poets.\n\nOf Australians I place a woman – Nina Murdoch, as our sweetest ‘Minor Poet’.\n\n74.\n\nUnderwood leaving the Ambulance yesterday to join up the O.T.C. Oxford, took over with him to post to Mr. Hadley, my third journal – July to","23":"\n\n75. ","24":"\n\nYesterday – a day lost, and there’s no memory to write it up from… One thing only.. from the Y.M.C.A. borrowed E.F. Benson’s ‘David Blaize’ – and read it, to the chapter where the Head reads to the form Keats \"Ode to a Nightingale\": then in a remorse for my not reading him of late, and of a full desire for the full loveliness of the two exquisite Odes, I passed David Blaize for the Everymans edition… and I read to commit to memory the first two verses of the Ode to a Grecian Urn.\n\nAnd now I covenant with myself – and though I’ve done it many times since – again to learn each day that passes some verse or beautiful company of lines. And tonight I change the philosophy of Omar Khayham for the following of Thomas A’Kempis… and from now will look only for the beautiful, where before I’ve seen only the meanness.\n\nNick shall be my example.\n\nOctober 22\n\n76. \n\nAbout here – the Scottish Lines, Dominion and Devonshire, raids solidly till about 10. The first raiders seemed to have got over without any notice being taken of them: it was still quite light, and the only planes up seemed our own – the old Busse going over with bombs. About two miles away we heard dropped bombs.. then one of our own scouts planed down above us, signalling with his dismall mournful hum.. then suddenly a hundred bombs seemed loosed on us somewhere just out of our camp… in reality they were a fair and quite a safe distance, away. Early this morning rain filled the air, and so sleep was quiet till the commenced their usual \"Hymn of Hate\".\n\nIn the hut the subject ‘Gertie’ – Col. Graham Butler of the 3rd Field. \"There was old Gertie up at the sunken road – logging out the bandaging!\" It’s a pity we’ve not a few more like him. \"They say he led a charge at the peninsular – in only his shorts!\"\n\nOctober 22\n\n\"Really it was in two days that ended in his only possessing his trousers and boots and sox - shirt, tunic - everything else had gone towards dressings!\"\n\n\"Do you remember at ? – put on their tickets ‘Dressing Station under heavy shell fire’ – and send them on!\"\n\n\"He’s a good man is Gertie – and he looks after his men!\"\n\n77.\n\nA wounderful mail: one dear letter from Mother of Sept. 6 – written hurriedly to catch a suddenly heard of mail: one from Billy – in Blighty and doing well full of his old easy cheeriness, and one note from Elsie… And…. from the T.B.C. ‘Certain Noh Plays of Japan’ from the Cuala Press..and ending with a delightful note –\n\n‘..finished on the twentieth day of July, in the year of the Sinn Fein rising, nineteen hundred and sixteen.’\n\nNow of the Cuala books I’ve \"Passages from the Letters of J.B. Yeats\", \"Reveries over Childhood & Youth\", W.B. Yeats, \"Synge: An Impression by John Masefield\" – the wounderful poet on the exquisite dramatist… these if these mails have not been torpoeded.\n\nAnd from Henderson,s, Shaw’s ‘Sanity of Art’, Vernide’s \"War Poems\" and \"Poems\", Alan Seeger.\n\nVernide I think is ‘dud’ – except for one beautiful poem, To an English Sheep Dog.. which approaches – in a handling of homely sentiment, to the magnificence of Hodgson’s \"The Bull\".\n\nAnd from Beaumonts, a most courteous note: Index their newpress edition is 10\/6… To-Day by a misprint printed 1\/6… They await my instructions…but before noting this write of 1st edition of Masefield, of J.C. Squire and Hodgson’s Poems… the latter at half a guinea.\n\nBuck’s to blame for the altered dating of the last entries… last night in bed, starting to enter up, he informed me it was the 22, his manner left no room or reason for doubt… so after all I’ve not ‘lost a day’.\n\nThe day fine, and full of quietness, no Boche have yet been over:.. as yet. The rumour of last night – that five Zeps had been brought down raiding London is true…. but the French had the doing of it.\n\nOct. 22\n\n78.\n\nThe rumour has it we’re moving off tomorrow… an issue of tinned fruit tonight almost vouches for the rumour’s truth. The word is we’re for the M.D.S. again, wether at Dickebusch or Ypres is hazy. For our comfort it would be Dickebusch.. but …..\n\nGeorge was over tonight, and to him I passed the first five numbers of \"To-Day\"… so after his reading of them he’ll post them home.\n\nI could easily afterwards buy a bound number, but they appeal far more as a magazine, and for interest later, their pages of advertising are worth all their bulk.\n\n79.\n\nI write tonight to C.W. Beaumont for Masefield’s \"Philip the King\", for J.C. Squire’s \"Twelve Poems\" and his \"Lily of Malud\", 5\/-.. 4\/-… and 1\/-… Arrived Ecuire, Nov. 16. \"Laus Deo\".\n\n80.\n\nThe letter written: now writing in the O.R. Tent, with Frank and Blue… Blue in the tangle of a letter to the centre of his interest in Paris…\n\nFrank on his home mail.. self wondering on a drawing for the Anzac Bulletin.. seems it makes ironical smiles… on paper drawn, it seems then and of no value….\n\nBlue decides to write in English – \"she can understand that\".\n\nSince writing the above a drawing of the pond where we wash, and two Billjims washing: on one of the willow trees an old notice.. \"No washing to be done here\". Enveloped for posting to the Anzac Bulletin.\n\n81\n\nYe shall not, while ye tarry with me, taste\n\nFrom unrinsed barrel the diluted wine\n\nOf a low vineyard or a plant ill pruned,\n\nBut such as anciently the Aegean Isles\n\nPoured in libation at their solemn feasts,\n\nAnd the same goblet shall ye grasp embossed\n\nWith no vile figures of loose languid loins,\n\nBut such as gods have lived with and have led.\n\nW.B. Yeats, Intro. N.P.O.S.\n","25":"\n\nThe early morning cold and rainy,.. the raid last night heavy – a big number of bombs dropped: early this morning at 1, another raid.. we slept through it.\n\nWriting, started another letter to Mother, posted one of 4 days today, and wrote to Mr. Whitlet, and answered Billy’s letter.\n\nRumour is Tomorrow for the of Fear again!!!\n","26":"\n\nBELGIAN BATTERY CORNER YPRES\n\n82.\n\nWind blown rain ends the ..I take Kitching’s place, he staying back at the Devonshire lines with the Q.M.\n\nThere we’re attached to the 2nd, on fatigue about our overflow post, and a dressing station for local woundings.\n\nTwelve of us for the duties of . Tomorrow on dressings, from 9 till 9.\n\nThis afternoon on the heaviest fatigues since Sept. 1894… carrying a long distance heavy logs and iron for the building of new dugouts.\n\nOn the Kruisstraat met Jimmy Strange – he now a one star man: the last I saw of Jimmy was at the dinner in St. James in Cairo. He for a school for six weeks - with weekend leave to Paris every second week.\n\nTonight I meet Costrane, his name I’m not certain of – or Casteril, I remember by associating, when I first heard it, the Prof. who translated the Iliad or wrote some commentary on it. First I desired to know him, seeing him in a near tent at Liverpool….\n\nOf the Bearers, now Toby, Clarrie and Johnno are number 4’s, all left of the old bearers of A Section.\n\nOctober 25\n\n83.\n\nWriting, in the dressing room dugout, half dopey with chloroform, self inflicted.\n\nThe aidpost mostly for local sick parades, and dressings only of easy slight types.\n\nOne of the mornings earlier, a coloured man: they are employed only where none of us have seen them, only when there is no witness about: he with a slight shrapnell graze on his head:\n\n\"Didn’t you have a tin hat on, lad?\"\n\n\"Oho, noh!\"\n\n\"How’s that! hurt?\"\n\n\"Oho yes!\"\n\n\"A Blighty?\"\n\n\"Oho, noh!\"\n\nIn their spoken English they can run miles from the average Tommy.. but Tommy certainly leans fondly towards local dialects.\n\nOur world is a cupula iron dugout – about ten feet long: around us are old walls of a terrace, and a skeleton roof bravely rises over us. .. The light by candles and two old kerosene lamps: most of the chaps through have been our own Artillery boys, and the Infantry of the 3rd Brigade.\n\nThis is my first experience of working with sick parades… it reccommends me towards a detail job in one of the Battalions.\n","27":"\n\n84.\n\nOur Menin road post has been taken over by the Canadians: so far our bearers have not yet gone up: there hang a dozen rumours as to the work to be done when they do eventually start, most lean towards the stunt being in a new part of the sector – more to the left where the Tommies have been fighting.\n\nAll hangs in the air: wether we are to fight with the Canadians or in support to, or supported by, nobody seems to know.\n\n85.\n\nFinished and enveloped a letter of 8 pages to Mother, started on the morning of the 23rd. Billy’s and Mr. Whitlet’s still remain to be posted. No mail up today.\n\n86. ","28":"\n\nEntry 86 makes an entry necessary for inward calm… An advanced area… men, camps innumerable and horse lines about all the close trafficked roads. An area most especially favoured by the attention of the Boche – long distance shells, and bombs from planes.\n\nSince we’ve been here each night has seen the dressing room, working on shell and bomb wounds, all local woundings.\n\nThe station is a collection of dugouts – arranged for staff generally, medical dugouts and personnel and stores and gear.\n\nBy the late heavy rain, the dugout of the Q.M., Capt. Ruddock became flooded…so the dressing dugout is commandeered by him, and a tent is erected from the dugout buildings for dressings… at night no lights are to be shewn,…and the tent for dressings is a single cover.\n\nTo Boche planes up the tent remains simply a glaring piece of light, an evidence of the men camped and bivouacked about.\n\nOther dugouts of the personnel have long been flooded out, but the dressing room till now was simply a continuation of the officers quarters, screened off by a hanging of blankets…. Now their quarters become spacious for lounging by the fire burning day and night in a dug in side grate.\n\nAnd Capt. Humphreys, one of our new officers, instructs us in the dressing tent, that he strongly objects to cards being played here – shewing as it does a lamentable lack of keenness.\n\nIf refusing duty could in any way help the getting back of the dugout, I’d willingly stand the crowning to do it….\n\nOctober 26\n\nAs it stands, when bombing stunts are on, we must remain in darkness, completely unable to receive wounded or do dressings till the skies are clear.\n\nAll from the damned selfishness and entire lack of keenness of the Q.M. Capt. of the 2nd Field, and the Medical men in a desire for a larger dugout.\n\n87.\n\nNearing midnight… the night’s been hard and clear: a three quarters moon, and hard point stars are superb in a night of deep blue, of light horizons… and on the left flank, terrible bombarding has rolled on since early evening. Only rumour tells us here of the morning’s stunt… It was the Canadian affair, - some few reports couple the English, or the London Scottish or ourselves with their names, and all objectives were taken with very few casualties.\n\nNow clouds are slowly coming over… oh most desirable of sky decoratings.\n\n3 a.m. ","29":"\n\nFirst point to us, cases in, one a compound fractured leg… we brought him into the dressing tent, put on an improvised tourniquet – and Rube went down to .\n\nThe Boche planes were up.. so all light must be put out, the dressing had to be done by the light of his torch, and it took some time.\n\nThe only damned point where he scored, was that no bombs were locally dropped till he’d got back to his dugout.\n\nShelling hereabouts wildly – seemingly wildly anyhow!\n\n88.\n\nI have been reading Shaw’s \"The Sanity of Art\"… at the 42nd page the brilliance begins to tire, and the last of the pages have been read to wandering thoughts. \n\nStill the guns on the left keep their monotonous harmony, entirely without cessation, every few minutes rising heavily, to fall back again tiredly as before.\n\nOne of the wounded lads left a packet of photograph cards of great breasted heavy, sleekly beautiful animals….. They led to a yarning of the nude in art. Jane: if only Basil Mac were here, in Rube’s place. Rube has elementary ideas certainly, but Mac – mid yarn the shells, the cold, and the long hours away, and we’d know of no troubles, till the next cases come – or came in….\n\nShaw’s \"dud\": I’ll read Brooke. He’s of more inspiration that even Keats, in the line or by it.\n\nOctober 27\n\n6 a.m. Over the stunting – the guns still lewdly alive – the skies of the most wounderful mist grey-blue.. and through the thin poplars, just rising in rich white palely tipped mass- lovely clouds…the lightning of the guns for a while made sudden sponging of quick pale yellow.\n\n89.\n\n6 p.m. A Boche plane just over, and his bombs dropped near the station… entering in bed.: In the dugout tonight, the argument strong again on respective casualties of the different countries’ Troops… words: words, and windy words.\n\nThere are two words in the A.I.F’s vocabulary – two inimitable words, emphatic, picturesque. Rabelaisian and of a distinct meaning all their own.\n\nA Review by Birdwood, and an address: one of Mr. Bean’s reports, and Sir Douglas Haig’s congratulations, and one of these characteristic words.\n\nIn the terrible elation that follows, I hate myself, hate and feel curses almost rise, that even I try to impartially judge.\n\nAlways I hark back to the Arts, and for their achievances, try and ponder them, and then comes the knowledge we of necessity do the same – our damned duties report each day the bombing of \"enemy hutments and Billets\". And tonight terrible nightmares have been from a successful, Christ ‘successful’! – a successful, God the word shivers horror, bombing of enemy hutments and billets.\n\nTears came and sobs… and I couldn’t help them… dressing a shattered body, out in the night, by the cold hard thin light of the moon.\n\nHatred surges up, and the while you’re cutting blood and mud soaked tunics – feeling life blood thick on the stretcher, & winding white gauze over slowly welling blood and a muddied wound. Stretchers in the ankle mud – and their mates around the chaps they’ve carried over…. \"Any hasn’t been dressed\" – \"Over here digger.\"\n\nOh God, if I die I’m Australian.\n\nAnd then poor bodies lie under blankets… two chaps came over to me and said, \"he died mate! What will we do – he only came out of the line tonight, can we take him away in the morning!\" And I wrote the dead boy’s \n\nname on a ticket, and pinned it on the blanket, and I’ve been trying to read Keats.\n","30":"\n\n90.\n\nDressing Tent: 7.30 p.m.\n\n‘Lights out’ sounded at six oclock, in all the camps hereabouts…then bombs dropped by one of the dumps…. Four men, artillery 105th Hant. Battery A hit, one killed: three we dressed and evacuated.\n\nA long day of small dressings from a big sick parade.\n\nThe night cold, and misted: the moon tonight a cold full stain of pale gold. Phrases have been all night running through my mind… and the tall leaf losing poplars are lovely faint drawings in the mist. \n\n\"Skeleton trees rising soft from the mist,\n\nThat rise breast high from the ground…\"\n\nThey are the makings of a word poem.\n\nThe moon made the phrase in a line,\n\nThe green-cold light of gold…\n\nHarry asked me today – I received by mail four booklets of verse from Erskine Macdonald – when I was publishing my first book: towards it, today two phrases: the ones written in this entry.\n\nCasualties last night, from the bombing across the road amongst the 2nd Battalion bivouacks were 15 killed, & about 60 wounded: here three died and others sent on to the A.D.S. were only sent – \"given a sporting chance\". All of us were out, and considering the working in mud, and only by faint hidden torchlight, the bandaging and fixing of the casualties worked finely and quickly. Back in the dugout, I tried to kill memory with the reading of Keats… I read The Odes – to the Nightingale and the ‘Grecian Urn’ – and lay full of imaginings not to be lost, and wrote a hatred in this diary.\n\n91. ","31":"\n\nContinued entry of Oct. 27 – 89 – and one of those characteristic words makes them indication….. \"xxxxxxxx\"!\n\nThe other means absolutely nothing-\n\nI heard it a while ago used in its most full sense. \n\nSome few reinforcements arriving late in Cairo, were sent straight out to Mena, instead of to Zeitoun\n\nOctober 29\n\nand in the dark night were put into tents in the sand. One described the desert with the second created word….. \"In the morning, we got out of the tent, and saw miles and miles and miles of \"—all\"!\" Never has the desert been so splendidly described…. from an impressionistic view point.\n\n92.\n\nThrough the night, bombs in one of the Artillery camps, and shells about the station.. we in our dugout feeling the full concussion of each shell, and harbouring the Inf. chaps shelled out from across the road.\n\nThe Boche machine guns turned from his planes on the road, got only two Tommies – both wounds of great worth…\n\nA clear lovely sun…. Coming down the road, an Artilleryman walking between his two horses…in a closely strapped sheepskin, an issue cap comforter, its two square corners standing high above his head, and the foldings slantingly across his forehead… and mud washed wading thigh boots… a tall slim darkly complexioned boy, black blown hair over his eyes, dried flecks of mud on his face and bare hands…. A myth poem of the Transport and the roads of war.\n\n93. October 30\n\nYesterday afternoon down to the C.M.D.S. at Dickebusch with Murph for mail: saw Frank and brought back Alan Seeger’s \"Poems\" – and seeing Tiny, a pair of pyjamas, saw none of the aristocracy, they on nightwork.\n\nTerrible rumours there of an Italian setback – where 70 thousand prisoners were taken. Frank D. though vouches for its untruth – knowing a \"bonzer little Italian in England! – she not a Dago, but her father is!\"\n\nA long morning of unending sick parade,.. chloroform and a rainy beastly weather.\n\n94.\n\nThe T.L. Supplement, 25\/10. The controversy over the original folios of Shakespeare ends with a long letter from the author of the offending volume, including the evidence of Pinero, Jones, and Shaw. Pinero and Jones have no light to offer, submitting clear flat commonplaceness: Shaw shines splendidly, and incidentally really offers a rather suggestive theory…which thought upon easily appeals as the actual truth.\n\nI have cut out the letter and have admitted it to the envelope of the journal – with the poetry of M. Forest.\n","32":"\n\n95.\n\nTo the T.B.C. for Masefield’s \"Good Friday\", Tagore’s \"Sacrifice\" and Burke’s \"Twinkletoes\". The review of Alice Meynell’s new book, \"Hearts of Controversy\", Burns and Oates, 5\/-, mentions a Swinburne she includes in one of her papers – referred to as \"her outspoken essay on Swinburne\".\n\n96.\n\nMail – a letter from \"your old Auntie Louie\": a charming little note – of her liking \"the little Irish stories immensely, and the poems by Watson\", of the expected great raids during this moon,\" and of great preparations being made. \"I shall be glad when the next fortnight is over.\" \" It is a mild night: my thoughts are all with the boys at the front, and my prayers too. \" One thing is sure: we can go to bed, and feel we can have a quiet night!\"\n\n97. ","33":"\n\nEnds the last day of another month… Entering in the Dressing Tent – on duty as Night Dresser with Rube again. The Boche have been over already and one huge Gotha loomed monstrous overhead – full in the light of the moon… all the machine guns of the camps hereabouts centred on to him, and he turned directly over the station, and his bombs dropped by the Bretan’s dump. The night is clear – a perfect bombing night, only a few faint wrack clouds blowing over.\n\nAn hour since starting entry… a second raid on our left, about 400 yards off between the two encampments… about 30 bombs dropped in three batches. … At intervals long distance shells sing high over our heads, a slow faint whine.\n\nThis afternoon to the Kookaburras – their show about 200 yards down the Kruisstraat… a good show, and a wounderful \"girl\". Her dresses and manner splendidly original and convincing.\n\n…Our planes are going over now…. \"May they put the fear of God into their hearts!\"\n\nMidnight: pork & ham, hot Bully Beef, and Cocoa…\n\nNOVEMBER\n","34":"\n\n7 a.m. The night ended: easily over 200 bombs have been dropped, within a radius of 500 yards, on all our sides: and till an half hour ago there were no casualties. Then a small bomb on a bivouac by the dump caught slightly three 2nd Div. chaps and setting fire to a motor bike, burnt the hand of another. They have just gone back – the dump some 200 yds. ahead of us, after dressing.\n\nNovember 1\n\n98.\n\nLibrary: in the dugout here, and with Frank at the C.M.D.S.\n\n\"Certain Noh Plays of Japan\", Cuala Press\n\n\"Poems\", Alan Seeger\n\n\"War Poems\", Vernide\n\n\"Our Eternity\", Maeterlinck\n\n\"My Childhood\", Maxim Gorki\n\n\"Keats\", Selections, Rupert Brooke\n\n\"Imitation of Christ\", Thomas a’Kempis\n\n\"The Sanity of Art\", Shaw, Phamplet.\n\nThe \"Selected Poems\" of Rupert Brooke last night I sewed over its cover a part of a triangular bandage. Carrying it in the pocket is dirtying it.\n\n99.\n\nTorturously writing lying on my stretcher. The dugout’s cupula iron and on either side carries 12 stretchers in four sets of 3… 24 stretchers. Turned in 9 a.m. and slept till dinner: slept again, and tea, and so to bed!\n\nLast night, about this time,-‘sadness set in’: the rum bottle – jar rather – was placed ready for Nick to issue, on one of the rickety dugout forms… someone sat on the form… and the rum jar smashed its rum to the floor…now tonight Nick asks for loans of water bottles to draw the issue in – \"they won’t break even if they do fall!\"\n\nThe Kookaburras have made one song well known to the troops, its melody swings, and its fully appropriate.\n\nIf its in John Bull\n\nIt is so!\n\nIt is so!!\n\nIt is so!!!\n\nWe know H.E.O. never was a fool, \n\nHoratio’s a pal of mine. \n\nTo see the boys went up the line. \n\nAnd he damn near stopped a 5.9. \n\n-It says so in John Bull.\n\nIt is so!!!\n\nI always keep my John Bull’s by!\n\nThat is how I prophesy!\n\nThe war was over last July!\n\nIt says so in John Bull.\n\nReddy – Mons! and Barrett last night, had a rather disastrous box-on at the C.M.D.S. – so Serge informs us. Reddy carries bad black eyes from it, and Barrett has been sent to the bearers!\n\nNo mail today: the Channel too rough. Tomorrow is due, Masefield’s, \"Herod the King\" and two 1st editions of J.C. Squire’s from Beaumonts. Theirs is a bonzer little book shop – one of the gems of Charing Cross Road: It was on Saturday afternoon after seeing at Drury Lane \"Samson and Delilah\" that I discovered it: and tragedy was in its being closed.\n\nIn the windows were all books of appeal…a Vale\n\nNovember 1\n\nPress, Morris, \"The Hollow Land\" and priced a guinea: and a dainty neat \"Passionate Pilgrim\".\n\nOn Monday morning I was in there: and bought as a start Watson’s \"Pencraft\", the back faded finely from its shewing in the window: and to send home Craig’s \"Art of the Theatre\" and Symons – some books of his Theatrical essays. Then I bought \"Form\", at half a guinea, and later sent it home by Simpsons of Oxford Street, with a lovely vellum leafed book of sonnets, bound in and with two Cuala books.\n\nAnother Charing Cross gem is across from Beaumonts, higher towards Oxford Street: on the first Saturday that was open, and I bought de Talley’s ‘Poems and Lyrics’, a 600 edition, one of John Lane’s 1890 books…\n\nDrinkwater’s ‘Olton Pools’ was in the window, and Lionel Johnson’s \"The Art of Thomas Hardy\" – an old vellum covered book – with the signed etching postmark. The shop was full of Beardsley’s prints, and folios and books of Ballet and the Theatre. A fine green and ivory large paper edition of Bakst designs of The Russian Ballet held the place of high state in the window.\n\nFrank D. just expressed his desires for the night: ‘a Bulletin and a full pipe, and a comfortable bed’.\n\n100. ","35":"\n\nGeorge has come up to take the \"Duke’s\" place – he evacuated yesterday with a burnt and blistered leg.\n\nGeorge arrives with all the ills of the Army – and deafness. His gruntings and grumblings are a perpetual delight to me – when he’s not grunting I’m disappointed: he comes with medicines and now develops a desire for sick parade.\n\nAll last night not a plane over: this morning an even grey sky & for a while a faint drizzling. Duty tonight, so the hope is for the close greyness continuing…\n\n101.\n\nDuty: Dressing. The night as the day predicted. Another page of letter to Mother, and a two page writing to Geoff: parcelled up Coulson’s \"From an Outpost\" with \"The Undying Splendour\" and Mother’s book with Shaw’s \"The Sanity of Art\" and addressed to Geoff.\n\nNovember 2\n\nWrote to Erskine Macdonald again after From an Outpost, and reminding him of the not turning up of \"The Poetry Review\": the 4th issue of M.F. books, the October lot still ‘missing’,.. but judging from the quality of the first three batches the loss is not too terrible.\n\nThis afternoon with Frank D. to the Kookaburras again: a good show and enjoyed. Mail: a letter from Nick, doing well, and he wondering if he’ll take an offered 3 months at Boulogne: wondering!!!\n\n102.\n\nA casual remark of Hunter’s and a rum toddy – oh the loveliness inspired by the following reveries of a rum toddy – sets me thinking \"while the bore talketh\" of a camp we held once years ago at Stanwell Park. .. Years ago or 1911, or perhaps 1912…Gerald, and Geoff and myself,… and the first night they, Fort St., and I the S.G.S. had a great row of the respective merits and standings of the two schools. Oh God for that week again…we lived on tinn’d stuff, corn and beans and rabbit, and each of us promised three respective Mothers we’d eat of fresh meat once a day! Once a day, and only once did we ever see fresh meat. To keep our promise we walked to Clifton – came back through the railway tunnel – back at camp put beef steak on to boil – made for the surf, and compleately forgot our meat tea…. when we got back a dead fire was under a dried up billy, full of burnt cindered meat…..\n\nThree Pagans loose from all customary routine of school and home, free in the bush, by a rich sensuous surf… and now Gerald’s here in damned France, in the Flying Corp, Geoff about a qualified M.O., and I’m on night duty in an old operating tent – an R.I.P. for bombing raids!\n","36":"\n\n7 a.m. Not to be outdone by the mists and clouds, shells from midnight till now, a quiet night, and not a single dressing: the only visitor a 26nd Batt. boy after a drink…we stood him rhum. The day promises another full of mists and drizzle.\n\nAt 3.30 this morning our guns on the left opened out rather heavily, even to the guns about here: they slackened after an hour’s full going.\n\nNovember 3, 4\n\n103.\n\nFor a walk to Vlamertinghe with Harry, and missed pay while away… On duty tomorrow. Harry promises to relieve me during the afternoon so the intention is a trip to Dickebusch. Vlamertinghe and thereabouts Canadians. Through the town lorries and cars of wounded.. evidently they’ve just stunted.\n\nThe church a shell, the tower only two sides remaining… in one place a picturesque ruin. Only one sketch is there, the altar place of the side aisle, and the skeleton ugly tracing window, a side door leading to a bapistry, and across its opening a line, on it a washed shirt and a pair of sox…\n\nThe word comes from the C.M.D.S. of Major Frizzel’s wounds having turned septic, and he dying.\n\nThe bearers are out, and were down here this afternoon… they go in again on Monday or Tuesday. Sol has dreamed twice of his being killed.. he is the last of the alliance. Frank has gone on leave, Bill is transferred to the tent section and Peter is for Australia.\n\n104. ","37":"\n\nEarly morning, day dressing before the commencement of the day’s sick parade. Humphreys last night self evacuated to C.C.S. Grey cold mist, and grey cold skies. Last night at the C.M.D.S. a dinner in the officers mess to Maj. Kirkwood – his birthday – \"—an’ ‘e went to bed at 9 an’ the dinner was in aid of ‘im, an’ it lasted till 12\" and Maj. Lee’s D.S.O. and his transfer to office of A.D.M.S. – Stack going back to Australia. Gabrielle in the dugout this morning asking one of the Batmen if Lee had told the tale of his taking of a pill box with an Inf. boy – made a wonderful Bull: hearing it I instantly decided on writing to T.B.C. for Sheridan’s Plays. Gabrielle told the tale – and indeed – \"That’s Tig in origin!\"\n\n105.\n\nTo Dickebusch for , mail & a change. Mail – a return of the drawing I sent in to the Anzac Bulletin… \"The difficulty is as we are an official paper, 1st Anzacs might take exception to us encouraging insubordination: it seems far fetched, but that is the position\". The sketch was of irony: their reply fuller. Of the three Frank sent in, one has been accepted for immediate use, new jokes are asked for the other two. For the last – by far the better of the three – \"In the Rain\". I suggested –\n\n\"Sydney Harbour?\"\n\n\"Um … the Yarra!\"\n\nMail yesterday evening a letter of Aug. 19 from Mother.\n","38":"\n\n106.\n\nThis morning spent sketching – another trial for the Anzac Bulletin. The old sketch of Toby: writing in our billet at Henencourt the body of sketch, added to it some pictures from La Vie Parisienne…\n\nDear Liza – the pictures in the new billet make it quite like home! … In the dugout at Factory Corner, the first day in, Billy sacrificed for the general good a dozen Kirchner cards he’d carried with him.- \"We’ll put them up in the dugout and make it look like home!\"\n\nWrote to Bakers for \"Chastelard\" of Swinburne’s.. I’ll post tomorrow. Mail from M.D.S. not yet up.\n\nThis morning I sketched about here for an hour – result of wounded.\n\n107.\n\nMail: letter of Sept. 1 from Mat, and acknowledgment from T.B.C. of £1.1.0, also catalogue of reduced novels. Finished – by the receiving of two ‘La Vie Parisiennes’, sketch started this morning.\n\nIn No. 38 of Anzac Bulletin two sketches by Dyson: M.D.S. at Vaux, and cross to 4th Batt. at Pozieres. Two finely suggestive impressionistic sketches: must try the style.\n\nTonight shelling again hereabouts. Must subscribe to La Vie: the drawing by one Rene Vincent exceptionally fine: a style to aspire towards.\n\nNovember 5, 6\n\n108.\n\n\"Much later I realised that Russian people, because of the poverty and squalor of their lives, love to amuse themselves with sorrow – to play with it like children, and are seldom ashamed of being unhappy. Amidst their endless week days, grief makes a holiday, and a fire is an amusement – a scratch is an ornament to an empty face.\" \"My Childhood\", Gorki.\n\nTonight I’ll read it – and from even a casual looking through it, I discovered several most terrible thumb-nail sketches – \"Although he was usually talkative, good natured and merry, there were times when his eyes became bloodshot and green, dim and fixed, like the eyes of a dead person, and he would sit, huddled up in a corner, morose and as dumb as his nephew.\"\n\nThe idea of the Russian people being almost enamoured with sorrow is illuminating. Certainally judging from Gorki’s and Artzibashef’s and Tolstoi’s novels and plays this is the case: Almost through all I’ve read there’s been the obsession of sex and death.\n\n109. ","39":"\n\nA nightmare last night, with all the horror of reality about it: of Father, Billy and Geoff: Geoff was only dimly of the dream, Betty’s was the big place. The dream was of the country, by the \n\nNovember 6\n\nHooge Tunnel of the first advance. Father was well behind the lines and to him in his dugout I’d to take the word of Betty’s being killed in one of the pill-box dugouts. The full feelings of reality were in the dream breaking the word.. and it was there for the instant Geoff came to his part. Then I’d to go back to where she was killed – and collect horrible small pieces of flesh, and all the while I was doing it, the regret was all in my mind, that I’d never know her again, to live with or to love.\n\nThe morning cold and grey: early one streak of pale colour was broken low in the sky by the darker grey silhouette of the jagged ruin of the Cloth Hall’s tower… At 6 a terrible bombardment commenced…\n\nPosted 15 F. to Bakers and letter of yesterday for Chastelard, also the sketch for Anzac Bulletin.\n\nNo word yet from either or Mr. Hadley of my third journal.\n\nThis morning’s stunt by our chaps & the Canadians compleately successful. Being an outpost dressing station no cases have come through here. Word of its success comes from an Artillery chap knocked in the Kruisstraat by a blind shell.\n\nNovember 6, 7\n\n110.\n\nThe rumour comes from the C.M.D.S. of casualties in the bearers: Les Carr, Ernie Sims and Ernie Payne, killed: and Jack Rassbeck wounded.\n\nThis afternoon the sky of the colourings of the two Renaissances: an even gold sky, and almost brown red clouds… and later when heavy rain clouds came over, the horizon losing itself in the ground mists, and pale patches of blue and lighter grey blue clouds where the slow rain clouds moved across. By the road there a stunted old tree, black trunk and all its leaves brown and dying with the autumn. Night, and a heavy driven fire of artillery..a counterattack?\n\nMail: How long ago was it since I wrote for \"The Romance of Zion Chapel\" – at Wimereux,, and it arrives tonight… and Literary Sup. Nov. 1.\n\n111. ","40":"\n\nThe casualties we heard of yesterday were: Snowy Waters, killed. Heinz, killed – a new boy killed, and Jack Rassbeck wounded, head, arm and leg…\n\nJust the conventional \"I’m jolly sorry! Snowy was a jolly fine chap too!\" is the expression all round, and no more is said: only the sorrow is remembered, and a \n\nNovember 7\n\npain is hidden.\n\nSnowy was one of the Pozieres reinforcements, and his nature was great: always his manner was charming, and he’ll be missed as Dick Seymour, Ernie Brown, Paddy, and Norm Reed and the others. \"Requiescat in Pace.\" And Heinz, always by himself, satisfied compleately to remain unnoticed, but always friendly and good natured. He joined us at Factory Corner last January… Leask and Ray and Dick Hagger joined with him…all are out of the Ambulance… two killed in action, Leask at Bullecourt, and two P.B. .. Requiescat. (Hagger rejoined Boss St. Julien.)\n\nThis afternoon with Frank D. down to the M.D.S. for mail, issued there with gloves, cardigans and cap comforters. No mail.\n\nBy the side of the orderly room rested four crosses and a six-pointed star, in the graves of the men killed in the second part of this stunting.\n\nEarly this morning came the word of the capture of 3000 Boche by the Canadians, a 5.9 battery and Passchendaele villiage.\n\nNovember 7, 8\n\nNight Duty: not a single cloud in a cold starr’d sky.\n\nOne of the 2nd Field drivers in the dugout tonight just before coming on duty- I called \"digger\"! He turned around with, \"I’m not a digger – I’m in the Orderley Room!\" I’ve just finished making a sketch of it, and will send it along to the Anzac Bulletin. The drawing of Digger is not bad – neither is the Box Hut background, but the \"I say Digger\" is rather clumsily crowded on to the addressed…however. Finished, to post tomorrow letters of Oct. 28, 30, 31, Nov. 2 & 7 enclosing Aunt Louie’s letter of Pool at Devonshire Lane drawing and Stuart’s reply from the Bulletin.\n\n112. ","41":"\n\n5 a.m. To midnight quiet and no planes over: then the moon rose. Bombing’s been mostly across over the Vlamerhinge road and rail. Scattered vague shelling hereabouts: so far no casualties. A half hour ago the guns started a high chorusing, but are now easing off. .. There’ll have been Hell’s Delight by the newly captured part of the Passchendaele Ridge and villiage since midnight – from aerial torpedos & bombs. The holding will be worse than the taking.\n\nNovember 8\n\n5.30 a.m. – One long rumbling of big gun fire.. suddenly opening from slow speakings along the line. Shrapnell over Ypres.\n\nAnzac Bulletin, Sept. 26 – from the C.M.D.S… Two of the first of Will Dyson’s official drawings, \"Main Dressing Station, The Fourth\" coming out. ! A finely suggestive sketch of Veaux M.D.S. during the Bullecourt stunting last May – before the station was \"shell’d out\" and \"Memorial to the 4th Battalion, A.I.F.\" at Pozieres, a sketch that drafts well the barren nakedness of the place, and the few remaining stumps of trees.\n\nPhotographs in the number include a fine one of a Batt. studying a contour map of the Messines area – a similar map to the one of the ridge before Passchendaele, by the Devonshire Lines, Ouderdom. There’s a notice in the number that copies of official photographs are obtainable at 1\/- each.\n\nNovember 8\n\n113.\n\nTo leave Belgian Battery Corner today at 2.30, per foot.\n","42":"\n\nC.M.D.S. Dickebusch\n\n114.\n\nBeat the Bearers down by 5 minutes: in A. Section Bearers Marquee. Arrived here yesterday – per lorry – at 2.15. \n\nSo far I’ve not joined up the gilded aristocracy: till we leave here, I’ll keep with the Bearers: then join A nursing when I have to.\n\n Postage 3.60!!\n\nParcelled up for posting Seeger’s ‘Poems’ and \"Certain Noh Plays of Japan\" – to Mrs. Hadley. From her yesterday’s mail brought two photographs – one of Mother and one of Betty: neither do them justice: they’re badly finished. It was very decent getting them and very thoughtful of Mrs. H… We hear of all our Christmas mail to Australia being sunk – in the channel: all parcels posted between Oct. 15 and 20th so I lose my \"City of Fear\" and Drinkwater’s \"Poems\" and the presents to Mother and Nat. \"Letters of a Soldier\" too? The 27th Batt. passed the station about an hour ago – about 9 a.m.\n\nFourty miles by bus: starting Sunday morning… Fourty miles to no-one knows where. One rumour says 17 kilos from Rouen!. Another, a big reorganizing camp by Abbeville. It seems fairly certain though we’ll be out of the line for a good month, then back again to a new front.\n\nNovember 9\n\n115.\n\nThis morning at 10 oclock, in the Cemetry here, the bodies of Snowy, Heinz, and Muntz – brought down by the Bearers,: buried. No surpliced Minister – nor even a Padre – a short service by some Captain…\n\n116.\n\nThe Crosses waiting here since the first stunting of Sept., Oct. taken up by Syd and Neeve today.,,\n\nThe wagons loaded: they leave tomorrow – we on Sunday.\n\n117.\n\nThere is a tale after the manner of Boccaccio in \"Sinister St.\"… Clarrie’s blanks last night and tonight recall it…..\n\nAll of us had roughly three blankets each, after an hour at the C.M.D.S….when we put our beds down and, turned in, one of Clarrie’s was ‘missing’ and his complaints waxed lewd and complimentary – turning in finally with Ridge’s greatcoat taking the missing blanket’s place…tonight there are six blankets where this morning he had two, he ‘grunted’ only one.\n\nMail today – Registered from Harold of a 15\/- note… In a week I’ll forward it to Bakers for Symons’ \"Ideas of God and Evil\" – or to Beaumonts if \"Herod\" turns up for Masefield’s \"Daffodil Fields\" and \"Dauber\". 17 days since I wrote them!\n\nNovember 10\n\n118.\n\nEarly cold: and raining now… A marching order parade, full packs up at 9.30 – inspection and dismiss: general fatigue cleaning up station… The wagons have left in dull horrible rain.\n\nLast night the contrast between the old A Sectioniles and the new : our end of the Marquee Clarrie, Toby, Ridge, Mills and self, with the new men Harold, Tony and Galloway. Ridge with his dry lewd humour and Clarrie’s responding in Toby and self…. The rest of the tent grousing. Harry B. deploring the horrors of service, and new opinions by new men windying the air. Ridge is by Aristophanes.\n\nYesterday saw George Eaton, from him selection of English Prose of Masefield’s… ‘To-Days’ he’s sent on to \"Muston\".\n\nThrough the blown raining on the Marquee, the full throbbing of a new bombardment.\n\nEarly in the morning I dreamed of a book holding in its end pages a full list of books of verse by J.C. Squires.. of small books each of only 12 to twenty Poems.. and of a series of \"Lily of Malud\" – each small slim book the episode of a long lovely tale.\n","43":"\n\n119.\n\n\"They can drive Motor Cars – but I’m – if they can drive horses!\", Mills on the Tommy transport, just arrived – and already buggered. We heard them coming down by the side of the Marquee like a lot of Gyppos routed.. then \"Y’re – nhow!\" Somehow a Tommy swearing is always horrible: They curse with no saving satiric grace. Between Blankets…\n\nMail – Australia, and a letter of Sept. 9 from Mother… Betty’s going to some Lawson Boarding School – the flat’s not yet started, and a print from a photograph of the Dad. Yesterday would have been his birthday.\n\nSol and Les following are telling tales…\n\n\"Where’d y’er get the feevers Liza?\" \"Off an Aussy!\"\n\n\"Lucky --!\"\n\nAll day long the guns have been firing: all day long clouds have been closing over and heavy rain has been falling…still tonight against the wind and the long booming carries.\n\n120.\n\nRenescure,","44":"\n\nNight – after a long ‘Bus’ and route march from Dickebusch – somewhere near Saint Omer-\n\nRENESCURE, November 11.12\n\n in our old Barn Billet, with great openings in the roof’s thatching – clear patches of rich starr’d blue in the high shadows.\n\nTomorrow we entrain…. Tired for writing tonight.. but the trip was a sheer joy – through most magnificent autumnal tapestries…\n\nNovember 12\n\n121.\n\nYesterday… marched off from the C.M.D.S. about 10, to Winnipeg Camp: there en-buss’d with the third Brigade – attached to them since Sec Bois… we at the head of a long column…. By a wounderful stroke of luck and good management managed a top seat… From Abelle to Steenvoorde, a long straight oak bordered and then poplar lined roadway, the bordering trees magnificent brown and gold and crimson, and pale yellow and dying greens – great lovely blackened trees of lovely massed dying foliage. Then towards Cassell…never such magnificence of Autumn…was as lovely as the Rhone valley that first Spring we passed by it. Cassell… now as it was yesterday- a pale cold sun softly hazing it – an adventure to live with The Blue Mosque, Aix Cathedral, the hills behind Marseille, the country behind Wimille by Wimereux and York Minster…..\n\nNovember 12\n\n122.\n\nBack from a short enjoyed route march. Reniscure a rather pretty little village – its square tent filled and the tracks duckboarded… a charming little church and a fine tree hedge around it and its clustering cemetry… One chateau – about 150 yards from the roadway – a high building of apse ends with two small knobby turrets breaking the highly pitched roof of slate… the avenue of old trees finely coloured – black skeletons and brown green patching of dying leaves.\n\nA clear lovely early spring day and a warm sun.\n\n123.\n\nTwo Ballets suggested themselves to my mind coming back… a Ballet of Autumn – hoary subject – its setting from the winding climbing road to Cassel… just on one of its abrupt turns a little back from the road, a white stucco formal chateau, somewhat suggestive of Georgian architecture by the high iron gateways a great weeping branching tree, black, and long festoons of rich red brown and madder leaves…. the chateau patch of white through the vivid colour. As we passed down the road slowly hobbled an old little woman, wrapt in a great black shawl and her face lovely as an old miniature.\n","45":"\n\nThen a Ballet of Madness, or Fear. A Darkened setting – the ballet in a twilight, a living freize of semi nude figures writhing fantastically as carvings of a Buddhist Temple.\n\nEvening: early, but turning in. This afternoon to Reniscure villiage with Frank S. . The old stone chateau mentioned this morning inspected from end of avenue where it opens to the gardens in front…then we learnt it was 1st Divy Hqs. .. Met Les Ford and Johnny, they from the second chateau… a fine old brick building.. made a sketch of it, and then some rough outlines of the perfect little tracery windows of the church.. closed so no chance of the seeing of its inside. \n\nTo move off tomorrow.. stay here owing to road congestion, wether per foot, or by buss not known. Latest is though we are to buss the whole way – to somewhere by Abbeville, the transport to take the distance by stages…if Buss must try again for an outside seat.\n\nECUIRE\/","46":"\n\n124.\n\nSomewhere in Picardy, about 20 miles from Boulogne.\n\nReniscure left early this morning – 7.30, and on arriving here after a full day of marching, the whole Ambulance at 4.30…\n\nBilleted in a Farmhouse in a valley of autumn… and mud.\n\nNovember 13\n\nSomewhere about 18 miles marched in the day, through lovely country and on a lovely day… clouds filled the sky, so the sun was cold… The roads over high hills across lovely valleys, and stretching to long straight lines over high lands. .. Early in the afternoon, climbing a high hill, we rested awhile by a hayrick.. rich yellow land & brown stretching to a valley bright with the sun shining straight into it till the distance lost itself in blue and purple shadows,.. and faintly throbbing down the air came the long pulsations of big guns…..\n\nBilleted in a room of the Farmhouse – about 25 of us in all. Candlelight and firelight – a fine old tiled open fireplace between high pannelled cupboards and a brazier burning…all over the red tiled floor coats, books, packs and equipment paraphanilia thrown in heaps… outside a huge mud stretch, and the road.\n\nLast night a mail drawn from the villiage: one of Mother’s Sep. 6 and 14 and from Betty Sep. 24… Oh Mother myne, you pitied the poor postman bringing home all my books,..but you say not a word what books. .. Betty’s Princess Badoura arrived, so far Mother’s Bag missing. A letter to Mother from Geoff enclosed & Mother’s card from Mrs. Stafford and the Nov. \"To-Day\".\n","47":"\n\n125.\n\nLearn today from Johnson the name of the nearest villiage, ‘Ecuire’.\n\nThis morning wrote to \"The Practical School of Correspondence\" to the T.B.C. for \"Second Diary of the Great Warr\" by Sml. Pepys Jnr. – the first ‘diary’ is in its 7th edition & Robert’s \"Twenty Six Poems\" from Grant Richards. Posted too, two letters I’ve been carrying from Belgian Battery Corner.\n\n126.\n\nThis afternoon after Blanket issue parade a walk along and about with the two Franks…. Lovely sunken and valley roads, beautiful with autumn, long lines of bordering trees, tiny twigs losing their branching lines in a mist of faintness, in the twilight faintly blue-purple, the rich reds and browns soft blurs of colour. An afternoon of real beauty around us, a sense of quiet waiting over it all.\n\nBlue Herring, a dying sun ray on his head, a Mythopon of Autumn.\n\nNight – in the billet a wood fire, quietness, cards and low talkings. .. Tommy has a mail sorting for us, to be given out at 7.30, in half an hour’s time.\n\nKeats’ \"Ode to Autumn\".\n","48":"\n\n126.\n\nTwo years ago the prospect of France excited us: one year ago we were fondly imagining a wintering in England: now rumour riots of the A.I.F. for Italy!!!\n\nNovember 15\n\nMail last night from Victoria: This week is missing the Literary Supplement.\n\nDue now from T.B.C. ‘Good Friday’, ‘Twinkletoes’ and \"Sacrifice\", ‘Philip the King’ and the two books from Beaumonts – so looked forward to, still to arrive. The 15\/- from Nick to go to Bakers, after ‘Chastelard’ arrives, for Collected Poems of James Elroy Flecker….\n\nParade at 10 and foot inspection parade again at 11 and a route march till 12.30, Dinner directly on return….\n\nMajor Frizelle reported slowly mending – still too bad to move though and Capt. Black, wounded in a Artillery Detail, still dangerously hanging on….\n\nWrote this morning to Windsor & Newton for general catalogues.\n\n127.\n\nEvening, ..Johnny back from leave…. I asked him a while back, \"Well Johnnie, and how’s old Edinburgh looking!\" \"Oh, very quiet – just the same… a bit quieter than before the war… Not many men about – but plenty of Aussies!\"\n\nThis afternoon directly after dinner off by self with Keats, for a walk across fields behind us… a mile away in a valley of three hills, a shepherd and his sheep.. a rustick loveliness, land of softly rising lawns and straight lines of trees… and straight bounding a dawdling road a wood of green lichened trees, and foliage of \"Autumn’s gawdy liveries\"… deep over the red pathway soft layers of large fallen leaves.. silence broken only by a sudden startling of some birds, black silhouettes against flecked gold. .. A passionate paganism was the spirit of the place… a desire to assume the atmosphere and rush madly over the dead-leaved carpet- to spoil with red blood the beauty of a white-gold naide. \n\nAt the other side of the wood faintly through the tall trees and high undergrowth foliage, sweeping pasturing land of soft buff colours, and blue hills behind.\n\nOur original intention was on going down to the stream for a bathe.. a quick crystal stream over smooth coloured stones,..Eric G. & Frank S. and self..they working though in Orderley Room.\n","49":"\n\n128.\n\nAfter a wash this morning, back in the Billet. Clarrie and self over to Q.M’s for boots we put in for yesterday during foot inspec. In a corner of the store, we were told we’d find a bag of boots, get a pair from those… all were salvage – and old unmatching pairs….\n\nSuch is the issue manner of the 1st Field. .. If it wasn’t for our own salvaging the unit would be worse than the most tattered Boche prisoner after his capture in the deep mud.\n\nAfter 10 parade – with Frank D., out down the valley with sketch books. Frank sketched a fine little winding road and a cluster of farmhouses. I grouted more apples than were good for us.\n\nMail this morning, \"Philip the King\", \"Lily of Malud\" and \"Twelve Poems\" from Beaumonts, with a most courteous apology for their delay.\n\nNow for a reading, in the O.R. by a good wood fire.\n\nTomorrow for the road again…\n\nNovember 17\n\n129\n\nLast night at 9, word of no move today… postponed till tomorrow…\n\nFrank carries with O.R. equipment, a small library –\n\nMasefield’s Prose Anthology\n\nMasefield’s Phillip the King\n\nJ.C. Squires’ \"Twelve Poems\" & \"Lily of Malud\"\n\nWilde’s ‘De Profundis’, Vernide’s War Poems\n\nKeats… and Rupert Brooke…\n\nBob S. with wagons carries le Gallienne’s \"Romance of Zion Chapel\" and Gorki’s \"My Childhood\", both half read, and \"The Moods of Ginger Mick\"…\n\n130.\n\nAnd a Book Mail tonight after a walk through yesterday’s wood, with Frank S., \"Chantelard\", \"Sacrifice\" and \"Good Friday\".\n\n131.\n\nDiana has given birth to five pups…Spotty is the proud father…\n\nIn our Billet with the Bearers a great roaring fire- and a yarning about it… down in the cold vaulted dairy cellar, the A. Tent Section….\n\nA great and enjoyed route march this morning – a compleat circle about the Billet… past the wounderful wood – flaming rioting colour, inspired in Johnny the memory of Zig-Zag, and a clear flat platitude from the ‘living corpse’, \"The triumph of vulgarity!\"\n","50":"\n\nTonight in the Billet a long yarning with Serg. Sellers, Norm Reid’s successor – and Seller’s old friend. ,,coming to the Amb. to take Norm’s place, he had no idea whose place he was filling…. A yarning that brought Chaddy’s name in it – and men that have died of the war….\n\nSo far from the war that only rarely, faintly over the hill, comes the low long pulsation of the tired guns.. like the low beating of wind in old trees…\n\nBOIS ST.JULIEN. November 18\n\n132.\n\nLeaving Ecuire at 8 a.m. on arriving here to the worst Billets we’ve been in since","51":" at 2 p.m. … However the Aristocrats granted early the pick Billet, and so \"alls well\".\n\nThe Day splendid for marching – full ‘pack-up’…\n\nReport says we are the first troops billeted here with these peasants,… at any rate Madame has a deal to learn.. already a barrel of cider – full flavoured fine stuff – found in a cellar, is emptied to the dregs… Her supply of eggs and coffee exhausted… to her credit though a great well stored harvesting of potatoes..and the troops enjoy nothing so well as \"chip potatoes\"…. Turning in early, for a reading of Good Friday.\n\nNovember 18, 19, 20\n\n133.\n","52":"\n\nA day to write up tomorrow. Evening now – cold in a windy billet where anywhere not deeply between covering blankets is impossible.\n\n134. November 20.\n\nTwo days of no sun…. A mail last night – a charming little note from Bernice Edwell, and a forwarding note from Mother, Sept. 2… written the day before her letter I received at Renescure a few nights back. Mother writes of four books arriving from Edinburgh, since Betty’s book arrived two must be from Beaumonts, two from Edinburgh being the two I left in a sweet shop by the Hotel.. just leaving Edinburgh for York. The four will be Stephen’s \"The Rebellion in Ireland\" and a book of poetry – both read in the train to Edinburgh and Craig’s Art of the Theatre and a book of Symons essays.\n\nToday payed – drew 50 F., Tigne Lee paying: he back from attachment to A.D.M.S. A big batch of new reinforcements arrived during pay, played in by bagpipes… says Bib, \"They’ve got a – hyde ‘eh?\"\n\nNovember 20\n\n135.\n\nThe night of the 18th, read in bed, Masefield’s \"Good Friday\": rather disappointing – though the Madman a richly fine character. Pages 44, 45, & 46 high above the remainder. More of a dramatic essay than \"A play in verse\".\n\nThe night of the 19, the first play of Tagore’s \"Sacrifice\" collection… A Noh play of Nature triumphant… its rapid ending was a shock, reading I turned the page for its continuing.. then I slept on it…\n\nTo night I’ll read ‘Sacrifice’ again. .. Chastelard I’ll put aside for reading when all I have is through.\n\nToday I wrote to T.B.C. for Babfords Building Construction Elementry. The first chance I see I’ll try for a drafting job on staff – the unit’s rotten through and through – the officers more ridiculous than socialistic amateurs. Yesterday morning on parade the Colonel shifty and poor, all his statements for a permanent guard etc. being totally ignored by the W.O. – the only Military man in the whole show: not that Militarism is necessary, but a certain amount of unit spirit and discipline should somewhere obtain.\n\nNovember 20\n\nYesterday’s mail, the T.L.S’s Nov. 8 and 15, announcement of column ‘John YKats’ – 18\/-.\n\nThis afternoon a kit inspection, general borrowing front and rear lines… of sox, shirts, etc., a farce ridiculously gone through – a farce and an indignity.\n\n136.\n\nBilleted in high hilly and deep valley’d country of perfect colours under grey skies…wide landscape Hardy would write well of.\n\nThe Billet a long divided up barn – one of three forming the side of a great quadrangle, the cottage closing the fourth. In the square – all roughly cobbled and unevenly sunken a great mud, manure, straw and filth heap and rising from the centre of it all, a decayed dovecot…. our fatigue yesterday and today clearing up where the rotting heap too far trespassed. A smelly dirty job – especially for the Aristocrats.\n\nClarrie, Bill Tell and self, in for Boulogne leave for Thursday… Ambulance wagon from here: 3 from each section, two transports.\n\nMail today so far nothing heard of: box open now for ordinary envelopes.\n\nNovember 21\n\n137.\n\nMidday – after a long mornings route march – round hills and over them – good even walking and a fine grey sunless day. Kirkby led us: and contrary to Hamlet’s advice to the good player, for a long way kept conducting an invisible orchestra.. quite unconscious of us he’d saw the air first with his left arm then with his right – following some inventing of his brain…\n\nThen infinitely proud, and to our delight, he gave us a new movement – ‘Form Threes’,…\"Its for narrow muddy roads-\". Back at the Billet, met by the Col., he proudly demonstrated our new knowledge…\n\nTwo new men amongst officers, two newly fledged Army Medical Officers: one I remember at the Uni., doing part of the 3rd year Engineering.\n\nKirkwood remains the only man with our least confidence: the Colonel’s Amiens stunting, and his Paris, and Flaine and Rouen trips & let alone his general manner, demeaned him.\n\n138.\n\nThis morning before parade, the two 2nd Batt. chaps attached to our dental unit… several times I’ve spoken to them and found them typical of the best of the Infantry – typical of all the Infantry.\n","53":"\n\nIt is a pity, for the Bearers sake, they have been billeted with us. One of them this morning made the remark.. in general conversation, that the Infantry boys pulled together far more than in the Ambulance… amongst the Tent section clicheism is everywhere. .. we amongst the Bearers – I noticed it first joining the unit from the 2nd, and more so joining the Tent after Father dying – there exists a fine good fellowship, and a real sense of comradeship…. The Bearers and Tent Section are two separate and compleat units. The seven months in the Bearers are the best months of memory of two years.\n\n139.\n\nNight: a late walk with Murph down to O.R., wind, and then haze rain and cold evening. Tomorrow with Clarrie a day’s leave for Boulogne: Bill drawn out, only leave for ten from A Section.\n\nWill call on Merridens and the Wimereux Café….\n\nNo mail today. Wrote to Beaumonts – and for it used Nick’s 15\/- - for Tides, Drinkwater and \"Christ in Hades\" of Stephen Phillips.\n\nAll but Johnny, Carby and Blue B. on leave to Dures.. there’ll be misery for them returning.\n","54":"\n\n140.\n\nIn casual talking, today, I hear of Ken Saxby’s death.. he killed in the first Menin Road Battle early in Sept. Blue Herring saw in Ypres Eric and heard it of him.\n\nSo another of Australia’s finest adventurers finds his early Valhalla. Requiescat in Pace. The last time I saw him he was marching with the","55":" Battalion S.Bs…before that at Herrick I drest his wound – a gunshot wound directly over the heart…. before that, we took our ‘French leave’ together from Liverpool in 1915.\n\n141. November 23\n\nYesterday a day’s leave to Boulogne, a leaving line – 10 of us in all including a driver and rider – in a G.S. wagon,.. 10.30. The day dull, close misted early, grey clouded all day. Samur we passed through early – a quaint little township – the church by the square close clustered about with fantastick houses, built hard up against the porch, and the stone walls. It would make a pretty little sketch – colours soft and lovely, tiled roofs of rich shadings, and grey and yellow walls… Entering the villiage, for the first time in France – some rather fine private houses: new, obviously affecting a compromise between English, American and German styles – and successful in a design rather effective.. perhaps a craftsmanship idea too easily suggests itself, but they are worth the noting.\n\nThen to a half-way house, for Rhum and Malaga..think brown Malaga, and Rhum like Muscat.\n\nOver the cobbled roads, over hills and by valleys, by farmhouses and estaminets, we made a quick trip to Pont de Brique –…from the 5 kilos to Boulogne.- and on arriving at the church square about 12.30…\n\nEarly, passing poor houses, strung along the roadway, the Boulogne side of Samur, clattering over the cobbles, the peasants smiled at their doorways and clapped us on, the postman was going his rounds.. passing one poor cottage, just by the door inside stood a sturdy servant girl, reading her letter – her broom handle resting against her breasts.. she was carven of stone – not all our halooing reached her,\n\nNovember 23\n\nonly a Picardian peasant – all her world was in that note – from some lousy Billet or candle lit dugout. .. I should like to have seen her face… and his.\n\nA Tram straight away to Wimereux – and a meeting in the tram of Tom Gale: he expecting an early return to Australia. A short year has changed and aged him as ten of old whiles.\n\nThen to the Café – and an ordering of Cherry Brandies.. then to the Little Café – for omelette and ‘ot Rolls and Coffee – but ‘ot Rolls were of the past six months ago: so it was bread and butter… That cost us 14 F., last year it would have been 8 at the most. New faces and people at the souvenir shop.…the dear little woman of the rich talking has gone…and ugly efficient shopwomen fill her place.\n\nSo to the old home,.. and a meeting of old 1st chaps, men looking years younger & well. fuller if possible, and Mac., Basil Mac full of light laughing and lounging grace, and a Bath and the seeing again of the old home…\n\nJake has been wounded a second time, all the muscle of his left thigh blown away. This rich lovely bodies beauty broken.. lithe loveliness gone, an offering to bloody horror… And I saw the new Jake there… and there’s been tormenting in my mind since, to visualise him, to see and know his beauty…shorter than Jake, more stockily built, a grace of sensuousness, rather than of litheness and of wood pagan gods….\n\nThe horrible desire to possess, to absolutely own and know mine, to always have in sight… to passionately possess… to utterly destroy in a madness of lust and to entirely absorb till the uttermost beauty is known and realised and is part of self… The desire for a beauty that may not be thine… and that can never in any case be known…\n\nTo Merridens and a buying of Tagore’s Stray Birds, of a sketch book and the \"Book of Artimis… a walk around, coffee and cakes, and a Malaga.. so to the tram, to Pont de Brique.,, Dinner there, and a trip back along misted roads and faint lines of tree silhouettes.\n","56":"\n\n142.\n\nToday the sun’s out, a cold shining, but a splendid break from the mist that’s been over the hills…\n\nYesterday the rumours were all about Boulogne, and in Merridens an excitement. The rumour was of Cambrai’s fall to us, and prisoners numbering 8000: of guns captured, and 130 aeroplanes. For the advance there was no artillery preparation. Midday today no confirming word has reached us.\n\nTurning in: a windy, hurrying thin clouded sky, a half moon and a few faint stars for the instant seen, between a running tide of clouds. No mail.\n\n143. November 24\n\nMists blown to fine rain: over the hills fold follows fold of blown haze. .. Mail. Chas. Dawson Art corres. course.. written for from Ecuire. Posting today for J. Hassall’s book: possibly I’ll take his course: the winter will make any sketching hard, but it will be worth while keeping my hand in.\n\nShould like to make some Portrait sketches, Les or Blue or Frank D.. one of the new chaps, Marks – a fine Jewish face, delicate and aristocratic: would make fine study. Of all the new reinforcements he the only promising man – with a 5th Divy L\/Cpl., wearing 3 service stripes.. the rest cheap raw numbers.\n\n\"Stray Birds\" – all loveliness, full of fine epitaphs…\n\n\"Life is given to us, we earn it by giving it.\"\n\n\"The storm of the last night, has crowned this morning with glorious peace.\"\n\nThe Burning log bursts into flame and cries – \"This is my flower, my Death\".\n\n144.\n\nEvening. This afternoon to Desvres for a bath – a bath in a great cemented basin, twice the size of the Bondi baths – and the water warm, hot at the sides – half a Battalion in with us, men of splendid build, browned still from the summer. Part of the works of a great cement manufacturing… Will to Desvres the first fine afternoon.\n\nOutside a howling wind, and cold scurrying clouds. Candles in the Billet blown all ways – all churlessness. Early for a while the musick of \"Chu Chin Chou\" was in the long high barn, but the singing died as the wind grew.\n","57":"\n\n145.\n\nA cold clear windy night. Midday the first snow of the winter – light pellety stuff, that lived only a few minutes on the ground.\n\nSpent the evening with A Section, round a heaped log fire in the centre of their high square billet: talking with the new L\/Cpl. 4th Divy chap – Egypt, Marseille and the Somme.\n\nNo Mail.\n\nFatigue – a job of four days – cleaning steelwork and harness with Transport: with Tommy Barr.. a fine chap. Too cold and comfortless for reading lately – when I’ve had the best collection of books since Wimereux last year.\n\n146.\n\nMissing: the sandbag of books – ‘Ginger Mick’ with all the old autographs – ‘My Childhood’, and \"Romance of Zion Chapel\". Last seen by Bob S. on No. 4 G.S. Wagon.\n\n147. November 26\n\nAn ‘Interim’ letter to Mother – a description of Madame’s Kitchen: in the Flemish style.. writing here with Dick H…\n\nTommy Barr out with horses so harness fatigue off.. section out for route march.. full pack up…\n\n148. ","58":"\n\nEvening: This afternoon to Desvres with Johnny and Buckholz.. to the baths. Early only a few in, then later 8th Batt. players after an Aust. Rules game against the 5th Batt. Fresh from the game to the baths – white shorts and thin cotton jerseys. In the water and out they were like young Kings.. full of rich close-muscelled vitality. The water cold but fine.\n\nTomorrow we move: the word only to the Billets an hour ago. Haversack carries… ‘Stray Birds’ and ‘Sacrifice’ of Tagore: and Masefield’s ‘Good Friday’ and ‘Phillip the King’. The rumour says Courcelette, 10 miles away – closer by 10 miles to Boulogne.. and taubes.\n\nQUEHEN November 27\n\n149.\n\nNow within easy reach of Boulogne: somewhere about 2 kilos from main Boulogne road 2¾ kilos from Pont de Brique… A leaving Bois St. Julien early – after innumerable coffees and Rhum at Madame’s, at 9 a.m. and an arriving here about 4 p.m… to the best Billeting we’ve had in France....a fine stable building, new built and clean. A. Section now drawing for places, so ours is the pick of the buildings…\n\nThe day cold and dull..\n\nNovember 27, 28\n\nheavy rain during the night and early morning – and a starting in thin drizzling rain.. played to the Billetings by the two reinforcement pipers – to the excited wonder of the peasants of the road. Passing Samur, made on margin of Literary Supp. a rough note of the rather fine tiled façade of one of the pretty domestic houses. Tonight it makes the first sketch in new sketch book. Harry J. accepts tonight commiss. in M.Gs.\n\nA sing song…Serg. Sellers leading – a good voice, and fine to hear. Sully and Harry make well self appreciated backgrounds.\n\nNo mail drawn today: we the only movers of the Brigade, probably will be attached now to 1st Brigade again, being in their area.\n\n150. November 28\n\nEvening, a fine day. Morning B. and C. Sections fatigues. A. in supports, A walk with Ridge and half a dozen others to a near high hill.. and a most magnificent view of rich sombre greened and browned country.. Picardy and an autumn day. Read there half of Masefield’s perfect ‘Philip the King’: Mail brought \"The Second Diary of the Great Warr\" and \"Twenty Six Poems\", illustrations – a decoration to first ‘diary’ finer and richer than those of the 2nd by F. Ketterwell, Fish – who’s lately illustrated Frankeau’s \"One of Us\" would have been a more suiting ‘decorator’. Now my library’s bigger than its been before: means the necessity for the sending away quickly of some: and there’s reading in them for months. Today too, Nick finds the lost sandbag – thank God for the turning up of the autographed ‘Ginger Mick’.. of the 45 autographs on one page, 20 would be the most I could get together again.\n\nA letter long overdue, to Mrs. H. tonight: must send to Betty post of Ypres I bought in Poperinghe.\n\nConscription proclamation out on the walls… a scheme of selective conscription almost – in it too many loopholes of escape. The vote will be for…there’s strangely little argumenting.\n\nNovember 28\n\n151.\n\nT.L.S. Nov. 22, from Frank Richard’s column of books.. ‘We hear a great deal of a revival of interest in Poetry. Certain books have gone into a surprising number of editions. I wonder of what numbers those editions consist? In one case I hear of a reputation being based on edition after edition, each consisting of 200 copies. Of Thomas Burke’s \"London Lamps\" I printed 500, and the ed. is nearly exhausted, it is being reprinted. Of Cecil Roberts’ \"Twenty Six Poems\" I printed 750.’ \"London Lamps\" was a fine little collection: sent over to me by Gerald… must write to him, but have lost definite address: will use A.F.C…\n\nNotice in it too of a new series, The Talbot Lit. Series – critical essays by Irish writers rescued from file of papers and magazines. Fisher Unwin publishing…\n\n1. \"Appreciation & Depreciation\" E.A. Boyd\n\n2. Anglo Irish Essays: John Eglinton.\n\n3. French Literary Studies, Dr. T.B. Rudmore-Brown.\n","59":" T.L.S. announced a new series by Blackwell: will try it when it comes from the press.. also this last of Unwin.\n\nWrote tonight to Mayhew – after S.H. copies of \"Literature in Ireland\" by Thomas McDonagh and Boyd’s \"Irish Literary Renaissance.\n\n152. ","60":"\n\nTonight a ‘surplus’ of Canteen Funds, so a \"dinner!\" to the unit…\n\n\"I’ll give them a – dinner!\" says on each occasion Tommy King: and invariably the dinner is \"---!\"\n\nBasil Burdett up from Samur – from the A.D.M.S’s office: spoke to him of draftsman at H.Qtrs… Will later apply for next vacancy.. it will be a good disciplining for me, and there’ll be the chance perhaps of a bit of fagging for R.A.D.A. Intermediate and finals. No mail today…\n\nRead last night the last half of \"Philip the King\", and turned in, read Jan., Feb., Mar., of a \"Second Diary\". The \"Other Poems\" of volume marvellous narrative poems, richly done: It is as fine a volume as \"Lollingdon Downs\".\n\nToday Harry Barkell leaves the Ambulance – recommended for Board for Australia. Alf Whitcombe up from the","61":" – bringing to here lorries of D.R.S. staff and equipment, we to run here a D.R.S… Frank S. to Boulogne.\n\nBooks for tonight \"Second Diary\" and \"Twenty Six Poems\".\n\n153. ","62":"\n\nBib sees \"Second Diary of the Great Warr\"… \"Aren’t y’ having enough of the – war Frankie, without \nreading\n about it?\"\n\n\"Mdlle de Maupin\" still reigns supreme with A. Section… by me, Rydge’s reading, smoking as he reads as the dad did.. tonight he cutting a plug of black tobacco, then smelling it, made me remember dad again…as he would stand by the green dining room table, mixing on a spread newspaper, two tobaccos, light and dark, and then gently pressing it into old \"Black Cat\" tins.\n\n154.\n\nA cold clear night, clouded: the moon blue through slow thin clouds: in the soft clearness.. the Billet rich in blue shadow, the dormer windows of the steep roof yellow patches… the light of candles.… a quiet lovely night.\n\n155. ","63":"\n\nPayed: drew 40 F…overdrawn.\n\nA Bonzer Mail: one from Mother, Oct. 14, and one from Geoff, Oct. 2.. and from T.B.C. Twinkletoes – the 1st printing.\n\nMother writes full of new hopes of my chances of coming home….but..there’s hardly a chance in a hundred. .. Then if I did get home, there’d be the pain all over again of parting – unbearable even at this long distance.\n\nGeoff writes of his new life and of shearers cooks, of Macbeth, of Fitzgerald, and The Hound of Heaven… also Aeroplanes and engineering.\n\nFrank D. has two new cartoons up… Willy L. and Chudley – offsider to Joe B. Both good. Willie’s fine drawing. Murphy – of the \"Low Mob \" impresses, passing publick judgment general criticisms.. \"Willie’s not bad, but Chud’s ‘bloody bonzer’!\"\n\nTonight twelve months ago Clarrie and self slept under the table of the Col. Huxtable – the A.D.M.S… this evening at Merricourt.\n\nPosted tonight to Anzac D., \"I say Digger\", \"I’m not a ‘digger’ – I’m in the O.R.\", parcelled up for posting to Mrs. le Feire – \"Sacrifice\" and \"Good Friday\" and P.C’s of Ypres for Betty.. will post too, Bulletins to ‘Aunt Louie’…\n\n156. ","64":"\n\nLast night a full reading of Twinkletoes… Its real title \"A Tale of Chinatown\". Morrison’s \"Child of the Jago\" and Frank Danby’s ‘Heart of a Child’ years ago used almost the same framework, on which Burke has hung his \"Tale of Chinatown\"… but for its wonder of phrase, its sordid realism made even beautiful, and its fine drawing, Twinkletoes is the masterpiece of the three… The drawing of Chuck – the ex-pugilist full of worshiping love for Twinkletoes, and her fierce protector, is the finest thing in the book… a drawing fully abounding in fine phrases, of wounderfully lights, and rich backgrounding. Twinkletoes remains indistinct…. The ending is the most perfect of late novels.. terrible, ultimate; all the more powerfull for its final development of the horrible Cissy….\n\n\"She chuckled, she inspected her hands as she pondered – long cold hands and arms that hung like silver swords. Monstrous emblems arose in her mind and produced a condition of agreeable habitude. She had cast herself for the part of step-mother, and it appealed to her; it contained possibilities…. she drifted into reverie, and floated on adumbrations of luxurious indulgence… she would have compleat to do what she liked, and there could be no fear of subsequent trouble, for…. she would be in other quarters with Twinkletoes well broken to her will.\"\n\nThe gem of the book is the last chapter – XII… Chuck in his temporary lodging.. alone by an empty grate…\n\n\"The thought of his first meeting with Twinkletoes; how the loveliness of her had swept into his dusty soul, and cleared it of many foul spots. … The thought of his commonplace marriage, and the terrible woman who was Mrs. Lightfoot. The thought of his early athletic days when nothing had worried him: when he knew nothing of Beauty or love, and was content. The thought of the storms that Twinkletoes had brought into his placid career… All that was over. He was through. At last his hell had burnt itself out, and he was free of further torments. He sat, unable to move for many hours, until the wide afternoon shrank imperceptively into sumptuous dusk, and snow began dejectedly to fall.\"\n\nTwinkletoes is a book of strange\n\nDecember 1\n\nand lively beauty: of sordidness made perfect by wounderful love, of terrible tragedy. It is neither a moral nor an immoral book: it is a superbly well written book of consummate art.\n\nI will place it with Sadler’s \"Hyssop\", and McKenzie’s \"Sinister Street\": with Hardy’s \"Jude\" and Meredith’s \"Ordeal of Richard Feveral\".\n\n157.\n\nMail today – from T.B.C., Tree’s \"Nothing Matters\" and Joseph Conrad’s The Shadow Line: two books for withdrawing from T.B.C. Library.\n\nPosted \"Sacrifice\" & \"Good Friday\".\n\n158.\n\nToday I have been happy. .. Tommy B. out of emery paper, so no steelwork of harness to be polished…away then from the camp with Cecil Robert’s \"26 Poems\" – to the hills and across the valleys.. to a quaint tiny cottaged village – strung closely by the wooding road, a doll house architecture, each individual cottage primitative two windowed and low door’d front of white, shuttered brown or green an..short stocky Picardian girls, brownly rich of colour, pleasant faced and smiling. And oh, the pagans: three estaminets and no church.\n\nCoffee and curacao – though liquers sold against order of French government.. a long talk – sad French surely – with Myne Host, a peasant by de Chavannes.. two of his sons dead of the war, his admiration for the Frenchman, for the Australian and for all the Colonials, French and English… a proud Mother shewed me large framed enlargements of two sons.… and photograph of surely all the Picardian soldiers. Then more Coffee and Curacao – so to a second estaminet for bread butter and lovely sweet apple jelly placed by my coffee with \"Voila! Monsieur!\" Back then to Isques, through thin haze wind-driven rain…all the mists of the world over the valley, greyness everywhere.\n\nThis afternoon yarning with Frank D. and from him Speed’s ‘Science of Drawing’: a good book of theory and one to read later fully and sincerely… Frank shortly sending it home, copied from one of its illustrations\n\nDecember 1\n\na fine study of Borcas, by H. Speed.\n\nBlue Duncan, seeing sketch of Roy F.- \"Gee Frank, if Johnny Norton saw that, ‘e’d put it in Truth!\".. so quite obviously the pencilling of Roy is false.\n\nMac shews me tonight a fine 37th Batt., 3rd Div. Christmas Card..severely plain.. a small folding of stiff hand made paper, a gold outline of the Rising Sun, over the \"eggs a’cook\" colour patch. Black and Red, and in Black plain lettering the Christmas greeting… We should have had them: the reason ?...the influence of one man who has taken the place from the Ambulance it held in Egypt, in the Peninsula, in France….\n\n"}}