{"Document Name":{"0":"Diary_0187","1":"Diary_0187","2":"Diary_0187","3":"Diary_0187","4":"Diary_0187","5":"Diary_0187","6":"Diary_0187","7":"Diary_0187","8":"Diary_0187","9":"Diary_0187","10":"Diary_0187","11":"Diary_0187","12":"Diary_0187","13":"Diary_0187","14":"Diary_0187","15":"Diary_0187","16":"Diary_0187","17":"Diary_0187","18":"Diary_0187","19":"Diary_0187","20":"Diary_0187","21":"Diary_0187","22":"Diary_0187","23":"Diary_0187","24":"Diary_0187","25":"Diary_0187","26":"Diary_0187","27":"Diary_0187","28":"Diary_0187","29":"Diary_0187","30":"Diary_0187","31":"Diary_0187","32":"Diary_0187","33":"Diary_0187","34":"Diary_0187","35":"Diary_0187","36":"Diary_0187","37":"Diary_0187","38":"Diary_0187","39":"Diary_0187","40":"Diary_0187","41":"Diary_0187","42":"Diary_0187","43":"Diary_0187","44":"Diary_0187","45":"Diary_0187","46":"Diary_0187","47":"Diary_0187","48":"Diary_0187","49":"Diary_0187","50":"Diary_0187","51":"Diary_0187","52":"Diary_0187","53":"Diary_0187","54":"Diary_0187","55":"Diary_0187","56":"Diary_0187","57":"Diary_0187","58":"Diary_0187","59":"Diary_0187","60":"Diary_0187","61":"Diary_0187","62":"Diary_0187","63":"Diary_0187","64":"Diary_0187","65":"Diary_0187","66":"Diary_0187","67":"Diary_0187","68":"Diary_0187","69":"Diary_0187","70":"Diary_0187","71":"Diary_0187","72":"Diary_0187","73":"Diary_0187","74":"Diary_0187","75":"Diary_0187","76":"Diary_0187","77":"Diary_0187","78":"Diary_0187","79":"Diary_0187","80":"Diary_0187","81":"Diary_0187","82":"Diary_0187","83":"Diary_0187","84":"Diary_0187","85":"Diary_0187","86":"Diary_0187","87":"Diary_0187","88":"Diary_0187","89":"Diary_0187","90":"Diary_0187","91":"Diary_0187","92":"Diary_0187","93":"Diary_0187","94":"Diary_0187","95":"Diary_0187","96":"Diary_0187","97":"Diary_0187","98":"Diary_0187","99":"Diary_0187","100":"Diary_0187","101":"Diary_0187","102":"Diary_0187","103":"Diary_0187","104":"Diary_0187","105":"Diary_0187","106":"Diary_0187","107":"Diary_0187","108":"Diary_0187","109":"Diary_0187","110":"Diary_0187","111":"Diary_0187","112":"Diary_0187","113":"Diary_0187","114":"Diary_0187","115":"Diary_0187","116":"Diary_0187","117":"Diary_0187","118":"Diary_0187","119":"Diary_0187","120":"Diary_0187","121":"Diary_0187","122":"Diary_0187","123":"Diary_0187","124":"Diary_0187","125":"Diary_0187","126":"Diary_0187","127":"Diary_0187","128":"Diary_0187","129":"Diary_0187","130":"Diary_0187","131":"Diary_0187","132":"Diary_0187","133":"Diary_0187","134":"Diary_0187","135":"Diary_0187","136":"Diary_0187","137":"Diary_0187","138":"Diary_0187","139":"Diary_0187"},"Date":{"0":"unknown","1":834.0,"2":836.0,"3":837.0,"4":838.0,"5":839.0,"6":840.0,"7":841.0,"8":854.0,"9":856.0,"10":858.0,"11":868.0,"12":873.0,"13":874.0,"14":875.0,"15":876.0,"16":880.0,"17":884.0,"18":885.0,"19":891.0,"20":895.0,"21":898.0,"22":899.0,"23":900.0,"24":903.0,"25":905.0,"26":906.0,"27":908.0,"28":911.0,"29":913.0,"30":914.0,"31":915.0,"32":916.0,"33":918.0,"34":924.0,"35":926.0,"36":927.0,"37":928.0,"38":931.0,"39":934.0,"40":935.0,"41":936.0,"42":938.0,"43":939.0,"44":940.0,"45":942.0,"46":943.0,"47":945.0,"48":946.0,"49":948.0,"50":949.0,"51":952.0,"52":956.0,"53":957.0,"54":958.0,"55":959.0,"56":960.0,"57":966.0,"58":967.0,"59":968.0,"60":969.0,"61":971.0,"62":973.0,"63":976.0,"64":979.0,"65":981.0,"66":982.0,"67":983.0,"68":984.0,"69":985.0,"70":987.0,"71":989.0,"72":992.0,"73":993.0,"74":994.0,"75":995.0,"76":996.0,"77":997.0,"78":998.0,"79":999.0,"80":1000.0,"81":1001.0,"82":1002.0,"83":1009.0,"84":1010.0,"85":1011.0,"86":1012.0,"87":1014.0,"88":1015.0,"89":1019.0,"90":1024.0,"91":1026.0,"92":1027.0,"93":1028.0,"94":1031.0,"95":1034.0,"96":1038.0,"97":1041.0,"98":1043.0,"99":1044.0,"100":1049.0,"101":1052.0,"102":1054.0,"103":1056.0,"104":1057.0,"105":1058.0,"106":1060.0,"107":1061.0,"108":1062.0,"109":1063.0,"110":1064.0,"111":1065.0,"112":1066.0,"113":1067.0,"114":1071.0,"115":1073.0,"116":1075.0,"117":1077.0,"118":1079.0,"119":1082.0,"120":1083.0,"121":1087.0,"122":1091.0,"123":1092.0,"124":1093.0,"125":1099.0,"126":1100.0,"127":1101.0,"128":1104.0,"129":1109.0,"130":1110.0,"131":1111.0,"132":1120.0,"133":1122.0,"134":1123.0,"135":1124.0,"136":1129.0,"137":1130.0,"138":1132.0,"139":1143.0},"Entry":{"0":"\n\n \n\nI left Sydney on the ","1":" on the steamer Kanowna with 150 NSW women & 100 Queensland men. We anchored in the harbour for about an hour & sailed about 4.15, perfect weather favoured us all the way \nto Melbourne\n, though a few men were sick. We passed Gabo Island the following morning, the view being lovely. On","2":" we approached Hobsons Bay & after sticking on the mud we berthed at 5.30 PM & we were allowed leave from 6.15 to 12pm, we enjoyed our trip to Melbourne very much. Melbourne impressed us as a very clean & pretty city.","3":" at 1 PM, we cast off but lay in the stream till 5 PM, it commenced to drizzle & the weather got quite squally & a lot of the boys were sick. \n","4":" broke with rough weather, we ran out of our course to escape a gale, which the T.S. Suffolk, that sailed from Melbourne which sailed before us, warned us about, she however got the full strength of the gale while we only got on the outskirts of it. A lot more of the boys were sick, while I was off colour with a headache. (We also took on board 50 men from Victoria, 20 Tasmania 40 South Australia) Monday weather still rough & nearly all the boys were sick or off colour. Tuesday weather still rough & boys still sick Claude also. Wednesday weather a little better\n\n \n\n & some of the Boys also. Thursday weather broke lovely, the sea very calm, the boys soon recovered & begin to look forward to a trip ashore at Fremantle. Friday we sighted land about a mile away, very sandy, & desolate looking but quite welcome after the water. Saturday all eyes for Fremantle, we entered about 11.30 AM & berthed in the stream at 1.30 & were allowed leave till 10 PM we were taken to the wharf on launches. Claude met his aunt & cousin on the wharf & they invited me out to tea at Subiaco where we spent a very enjoyable afternoon, we then left after tea for Perth, there was a patriotic carnival on at Perth & our boys enjoyed themselves. Perth is a jolly little city it really surprised us both in size and the way they welcome anyone. Sunday we sailed about 9.30 PM & all hands were sorry to leave but the weather still remained perfect, the sea broken but no swell.\n","5":" also proved an ideal day with a calm sea. ","6":" weather still lovely and sea calm we are fast approaching the tropics. Wednesday the sea is just like a sheet of glass, it looks unnatural to anyone who has not travelled. Thursday sea resumed its usual broken condition, the weather being still perfect though hot. We had a boat station drill this morning & a boxing competition this afternoon which caused a bit of fun & we had a mock trial tonight. It was fairly good considering the time at the disposal of the artist, but it would have been better if it was held on deck, (it was held in one of the wards) as it was that hot and close that we were wet through with perspiration & a lot of us had to go outside long before it had finished. Friday weather still good though hot. Saturday we sighted Cocos Island at 8 AM & sighted North Keeling at 9.30 & sighted the Emden at 9.45 & at 10.15 we had a good view of her, at about","7":" mile distant, the Islands also presented a picturesque sight & extra welcome, because it is the first bit of life |(with the exception of 1 bird) we have seen since leaving Fremantle. Sunday very hot, we had church parade, we had a light shower during night. Monday very hot, but grew muggy & rainy looking\n\n \n\nduring the afternoon, we were paid this morning.","8":" it rained last night & we were driven to shelter. We sighted two steamers, one this afternoon and one tonight, they caused a lot of excitement. Wednesday weather cooler, Kit inspection over stolen money. ","9":" it rained all last night - & on & off today, the sea has a bit of a swell on & some of the Boys are sick. We had a boxing tournament yesterday afternoon & some of the bout were hard hitting affairs. Friday, was showery we arrived at Colombo at 2pm & obtained leave till 8 PM. \n\nColombo Harbour is made by breakwaters two from each side of the bay & a centre one giving the harbour two entrances. The natives are very excitable & the ferrymen have very heated arguments over passengers, but the Police soon settle matters, the natives have a very great respect for the Native Police & they don’t even argue. The ferryman will get as much money as possible, well the same applies to all of them & one has to be very firm, & careful of his money. The Police do not imprison the natives, but just give them a thrashing, hitting them on the head, neck or shoulders, they often cry but never hit back. \n\nWe anchored out in the stream, & were rowed ashore, the town was far different to what we expected, the roads are excellent (native quarters exempt) though the traffic is very light. The Rickshaw men worry you as soon as ashore leave the wharf & won’t take no for an answer, the kids are the last thing in begging, they will follow you a mile or two if they think there is the slightest chance of getting a penny, at first you feel full of pity for them, as they have a way of looking very pathetic, & if you give to one, well that is the end of it, you will have a hundred round you in a minute, catching hold of your hand & calling you to help little boy, some carry Babies to beg with, every adult seems to carry something to sell, rings, stones, elephants & everything you can think of & ask fabulous sums for them & then come down to almost nothing. The beach is very pretty, though it doesn’t seem to be used much, the walk round there & beyond is lovely for miles, it is the residential\n\n \n\nquarter, the road is lovely with green grass growing on the side & lovely residences all of which has tenants name on the gate post, cocoanuts grow everywhere, the road leads to the gardens, which are lovely, \"sensitive plants\" grow everywhere as do Colodiums. The natives think a lot of the British but hate Germans. The Native quarters of the town are squalid, but not too dirty, it is very interesting & amusing one could study it for hours. Kids will run alongside of you & sing Yip-i-addy-i-ay & its a long way to Tiperary & then ask for penny. The native quarter has narrow streets, down which double lines of Trams run, practically on the footpath. The ferns growing in Cinnamon Gardens are lovely, maiden hair fern growing as Sydney has never seen, all out in the ground sheltered by tree. Meals are very dear, also fruit. ","10":" fine hot weather, we were granted leave from 1.30 till 8 PM. Claude, Ray & I went for a walk round \nCeylon\n Colombo about 10 miles were covered, scenery was lovely. Sunday lovely day, men were granted \"Church parade leave\" & we sailed at 3.45, sea was very calm. Monday beautiful day, Tuesday also Wednesday weather still continues good. Thursday weather perfect. Friday ditto Saturday weather perfect, hundreds of flying fish were seen at night, attracted by the lights, we have seen odd ones for the last week. Sunday weather still holding good, we passed some islands this morning just after six o’clock, right on the horizon.\n\nWe had church parade this morning, we sighted African coast this morning & dinner time we were running abreast of it, a couple of mile away, we met a native sailing vessel going fast for the coast, though no inlet was discernible. We \nhad\n spent about an hour singing hymns tonight. ","11":" Weather perfect coast \nsighted\n close on both sides, for a few mile. Tuesday weather still good, islands close in with lighthouse on summit, on other side was volcanic looking islands, we drew up to the \"suffolk\" at 3 o’clock PM we passed\n\n \n\na lighthouse (showing three flashes). Wednesday weather dull & threatening, we had a marching order parade this morning. Thursday weather fine but hot, we were paid this morning, steamers pass fairly often now, this last three days, Friday we are in sight of land on both sides now, having passed Mt Sinia this morning, weather perfect. \n","12":" weather perfect, we drew up to our bouy at Suez at about 9 PM we slept on board & had breakfast next morning then we disembarked at 10 AM we were given 4 biscuits & a tin of bully beef & put into a disreputable train, though not crowded, at about 11.15 AM the train started on its journey to Tel-el-Kebir. All the way is nothing else but troops, camels galore & any amount of horses & mules. Part of the country is under cultivation though a lot of it is desolate. There a lot of Indians, English, New Zealand & any amount of Australians troops stationed. Tel-el-Kebir is a rummy place, though there is a lot natives there, there is not many houses, it must be a rotten hole when there is no troops there. We arrived there at about 3 PM","13":" We wasn’t served with any tea, & wasn’t supposed to for 24 hrs, it is pretty warm & the flies are a nuisance, we walked round the \"town\" after being dismissed (some of our chaps had to put up tents first) & bought some tea, we then came back to camp & had to sleep as best we could, some 15 to 18 a tent with no blankets. \n","14":" weather hot, we were given bread and jam, biscuits & tea (not much either) for breakfast, some of us were detailed to get blankets from the station 1 mile away, about 25 of us to each big hand cart, we had stew for dinner, bread & tea (not much of it) in the afternoon we were innoculated against Choleria, then the mail was given out & I was lucky in getting one, there was great excitement over the mail then we were issued with blankets (two) we went for a walk then went to bed. ","15":" breakfast bacon bread & tea (not much) weather still warm though the nights are very cool. Wednesday we were picked to go to the front, but owing to our not being properly equipped we were\n\n \n\ntold to stand down. Thursday I was picked amongst 20 odd others to do picket duty 2 hrs on 4 off. Friday very hot as hot as Sydney’s best. ","16":" leave was granted to 3 percent, I didn’t go. I was a bit sick in the morning through eating sour bread. Sunday still very hot (it was 116 degrees yesterday) we had church parade this morning & I voluntary went tonight. The village is out of bounds now. Monday hotter than Saturday, a lot of our chaps from Liverpool came in to camp today. Tuesday very hot, I was on fatigue work this morning, but laid down most of the time. \n","17":" very hot, was on fatigue (serving out lime juice) Thursday much cooler (While heat wave was on, it Reg 114 in shade) Friday nice & cool. Saturday nice weather Sunday on guard 2 hrs on 4 off. Monday Claude & I went for a walk through some farm land near the camp Tuesday nearly all the A.M.C. men visited the old 1882 trenches while on their route march about 2 ½ mile out, several chaps picked up relics. I received Lizzie’s letter in the afternoon. ","18":"\n The native paper boys are funny, they are not allowed in the Camp but they find their way in, getting out Egyptian mail, yesterdays news to-morrow good news today Lord Roberts dead. The Egyptian dawn is very interesting, the natives\n\n \n\nare soon getting about, they wash their feet & pray, then go about their work. They are very hard on their donkeys, one in a cart fell over & cut itself badly in several places it also had a lot of old sores. The natives put in the harness again, but one Boy’s made him take him out & get another donkey.\n","19":" weather good. Thursday also good. Friday on guard in the afternoon & night, in the morning we marched through the native quarters (our section) Saturday under orders to pack up, we left camp at 5.30 & entrained in trucks for Alexandria, we got away from Tel-el-Kebir at about 8 PM arriving at Alexandria at about 3 AM where we embarked, there being about 600 odd A.M.C. & about 1900 of other branches of the service. ","20":" we stayed in harbour all day & night, the food being very plain. Monday we left Alexandria at about 8.30 AM on the steamer Corsican of the \"Allan\" line about 11,000 tons, she has a 6in gun mounted on her stern, we are convoyed by two small cruisers on torpedo boats one leaving us about 5pm. Tuesday still lovely weather.\n\nWe rise 6 AM breakfast 7 AM parade, 9.30 dinner 12.30 parade 3 PM tea 5 PM. Our other escort left us today. Food is very bad, bread sour, porridge is crook & no sugar & milk, butter is like margarine & smells like little black ants, we soon run out \n\n \n\nof jam. Dinner, the meat is first cooked as soup, so as we have boiled joints & soup at the one cooking, everyone complaining. ","21":" weather good, sugar issued (but no milk) with porridge, stewed apples for tea, we often see transports & small patrol cruisers. Thursday it rained a bit last night, but the morning broke fine, the Orderly Officer stated better food was going to be issued, bacon for breakfast bread still sour, dinner as usual, we have another escort they work in relays, we are only without an escort for a few hours at a stretch. We have since leaving Alexandria, been steaming a very zigzag course, we have been having a couple of lectures on first aid, sometimes by our Sergeant & by some of our more experienced comrades. ","22":" sea very choppy a head wind blowing, it was pretty cold in exposed places. \n\nThough we wear lifebelts all day & have boat drill sometimes 2 or 3 times a day, we received a genuine alarm at 2 PM, a transport which left Alexan. about same time as we did was torpedoed (we were told something had happened close to us) so we had to stay at stations till 8 PM. we were allowed to go down for tea ½ hour being allowed, but on no account whatever was anyone allowed downstairs. After tea a French battleship appeared, coming in the opposite direction, she had no stern above water, 2 D. turrets were in the stern & one D. in bows she looked very impressive. Saturday sea very calm 9 AM a French T boat (very low lying, looking at a distance like a Submarine until her funnel smoked) appeared off the starboard side, she came on until she was about 100 yards off & then a gun sounded in the distance, her crew immediately ran to stations, uncovered her guns while she turned right round & went like the wind, something appeared to be doing. I met Mr Antill this morning & had a yarn with him. Wreckage passed us this afternoon. We were told to read in papers when we had the opportunity \n\n \n\nto see what happened on","23":" & see how lucky we were while on our trip through the Mediterranian. Sunday weather fine, though a bit cold before and after the sun appears. Rumour that transport \"Briton\" was lost with all hands has been denied, though something did happen.\n","24":" June, sea oily calm, weather good, Gibraltar sighted late in afternoon, we arrived there at dusk, but didn’t go right inside the harbour. Gibraltar looks all she is claimed to be, coming from the east, she rises straight out of the water, looking in parts, as though she has great concrete patches on the slope, so as to strengthen it, on the west or harbour side, it slopes a it more, the town seems to be divided in half, one each end, it looks very picturesque, the roofs are red, giving the place a nice tone, the harbour is of no account. The Spanish shore looks very inviting, nice green grass & small villages at the foot of small hills, giving the place a very peaceable look. Tuesday we went into the harbour to take coat & water on. We are fortunate in seeing two French submarines, one of which went under while we were watching, they either had none or their periscopes were lowered. We stayed all day at Gibraltar. ","25":" we left port about 7 AM with lovely cool weather, the old ship is shaking things up, she must be doing 13 knots, she only done about 9 or ten before reaching Gib.\n","26":" weather getting much colder, though it was nice in the sun, it rained a little tonight. Friday we had big gun practice, 1 shot being fired. We received news of Kitcheners death. I had my fortune told by a comrade & he told me a lot that is right & some that I hope is not. ","27":" it is very cold this morning, sea calm, Sunday. Ushant (France) sighted at 5 AM, we picked up our escort soon after, we sighted England about 1.30 PM & ran into Plymouth (Davenport first) about 4 PM. The entrance was very beautiful, the grass & trees being a treat after the sands of Egypt & the sea the farms seen give an added color to the \n\n \n\nscene, the soil or something showing up brick red, the sight greatly impressed our Boy’s also astonished them. The harbour is nothing, we anchored for a couple of hours & then had a shake up tea & then we were taken ashore in big launches & entrained, all blinds had to be drawn for fear of Zeppelins, we arrived at Exeter about 1 AM Monday & the good ladies there supplied us with tea & a bun, it was greatly appreciated. We arrived at Tidworth & went on for a couple of miles to some siding or station & detrained, we then marched about 4 miles to our camp, it had previously been raining & the place was muddy, though the camp itself was pretty good. We had bully beef & biscuits for the three meals, it was crook, a lot of us bought our tea. ","28":" June, still cold & bleak we had better food for breakfast. We done a lot of marching today. Wednesday still cold & bleak, the sun comes out for a few minutes at rare intervals during the day, we did a lot of marching this morning & signalling this afternoon. ","29":" June, weather much better, sun out most of the day, though not hot as the sky is very cloudy. We had lecturing & signalling today & was paid later on in the afternoon. ","30":" weather fine, though a cool breeze blowing lovely lying in sun, more lectures & signalling.\n\nI have a very bad cold, nearly all our chaps are so affected. ","31":"\n","32":" weather still lovely (in the sun). Hansen & I went for a walk to Tidworth (2 mile or so) Sunday only morning parade. Monday weather cold & threatening rain, sun came out at intervals. ","33":" best day so far. Wednesday we put our leave passes in, but had no luck. The weather is very changeable. Thursday it rained a little today. The pudding (Sago) was that watery, that there was nearly a bit of a riot over it, food is scarce & not too good. A lot of the chaps would not go to a concert (which is run by the N.C.O’s) tonight over the food question, as we get no satisfaction from the Orderly Sergeant. Friday 23 drizzling with rain we rehearsed the review for W.M. Hughes. Saturday the\n\n \n\nday when it really rained, except while at sea, I was on fatigue duty & didn’t attend the review. Sunday weather fine but a bit dull. We told to take 4 days furlough before leaving for the front.\n","34":" we went on furlough at 8.30 travelled to London (Waterloo) then marched to A.I.F. headquarters in Horseferry Rd we were supplied with dinner there at the Anzac buffet, it is a charity affair, they treated us handsomely, we (Vic & I) went to Victoria station from there, to catch the South Coast Railway train to Worthing, we travelled to Brighton in a Pulman car, we had to change there for Worthing, reaching Worthing at 4.45 after 1 ½ hours ride. We arrived at Uncle Will’s place at 5 PM just tea time, they were awfully surprised to see us. Uncle showed us round the pier & Promenade (it was raining) we then went to Aunt Nell’s place & surprised them. We had our sleeping quarters there. Next day Tuesday we & the girls (Doris, Bessie & Winnie) went to Brighton for the day & \n\nthoroughly enjoyed ourselves, the promenade & piers are fine also the buildings on the front. ","35":" we went for a bike ride all round Worthing & enjoyed it, it rained a bit at 7PM we went on the Promenade till 10 PM. ","36":" we set sail for London at 10.20 am, arriving at 12.45, we visited St Pauls & attended a service there, we also visited Buckingham Palace, Tower of London, Strand, Petticoat Lane & other principal places. We \nfell in\n had to fall in at 8pm, we were close on time, leaving there (Headquarters Horseferry Road) for Waterloo Station where we entrained for Tidworth arriving there about 12.45 we then marched to camp arriving there at about 1.30, we were given our mail, first Australian one, we were fortunate in having the Sergeant who had the letters, in our hut. Friday weather still dull at times. Saturday it rained during the afternoon I spent the afternoon writing. Sunday the weather much better, we played football in the afternoon & went to church at a place\n\n \n\ncalled Cholderton about 2 miles away.\n","37":" a lot of the Boy’s are going on leave (4 days). Tuesday weather fine,","38":" Australian mail delivered. I received 6 letters. ","39":" weather still good. ","40":" weather good tilll this afternoon when we had some heavy showers, we, Vic & I were on guard (inlying) all night. ","41":" showery all day. Vic & I are picked for the first draft to go to France, we were paid yesterday. Saturday weather fine we went to the pictures at Tidworth. ","42":" church parade 9 AM, I wrote letters most of the day.","43":" we had a couple of sharp showers, but otherwise the weather is fine, I am doing picket tonight at cholderton. ","44":" raining, weather cold. Wednesday weather still showery.","45":" pay day, also mail day. Friday weather fine, some of us went to Tidworth & had strawberries & cream. At about 10 PM word was given that we were to sail for France next day.\n","46":" weather fine, it was officially announced at 6.30 AM that we were to leave camp at 7 PM for France. We arrived at Waterloo Station at 1.15 AM & slept in the waiting room. ","47":" we marched from the waiting room to the South Western railway station (in the same building) we steamed out about 7 AM & arrived at Folkestone at 9 AM where we rested & had a snack, we embarked about 2 hours later with a lot of Tommies, Scotch & others, it is sprinkling with rain, we were well treated there. We sailed at 12 PM & arrived at Boulongne at 1.30 PM, we marched to a camp on a hill about 1 ½ mile out of town, where we spent the night, it rained a part of the night. ","48":" foggy weather we marched out of camp at 10.30 & entrained for Etaples, arriving there at dinner time, we marched all over the place before we found our camp. Tuesday, weather cold, food scarce, we have to buy bread. We were paid 10 francs today.\n","49":" we had to buy our own bread. W went to Virgo’s lecture tonight. ","50":" the first really find day, there are no clouds visible but it is hazy though fairly hot in the sun. Friday another warm day, we all had a steam bath. Saturday weather cold in the morning but in the afternoon the sun came\n\n \n\nout. We had a half holiday. ","51":" rainy looking & cold, but warm afternoon, we had church in the morning & attended a lecture by Mr Virgo the Y.M.C.A. Empire Sec. Monday rainy looking, we went for a route march about 7 mile or so to holiday resort, there is a ruined hotel (a large one) there, it was built on the sand right to the waters edge, but it didn’t last long as the foundation was no good, all that remains now is the front part, it has better foundation than the rest of the building, though it will all be down before long, it is 4 or 5 stories high.\n\nWe marched back through a village, it looked very poverty stricken, we went to a lecture tonight. Tuesday rainy looking we are on fatigue work at Etaples. Wednesday we went for a route march to Paris-Plage a small town just across the water from our Camp, it is about 4 miles or so each way, It is a very pretty seaside resort, well laid out & by the look of things, it must be a popular place, it has some nice buildings on the sea front. ","52":" turned out a lovely day. A draft to go to the front was finally selected. ","53":" another lovely day, I was on cooks fatigue all day. Vic & I went for our evening walk.","54":" I was on Cooks fatigue again today, the weather is lovely, but it got very warm in the afternoon, when I had a game of cricket.","55":" another warm day, I was picked in a draft to go to the front, but drew out, because Vic wasn’t picked to go. I played cricket in the evening. ","56":" weather still grand, I went to a lecture. Tuesday weather still good, I was on fatigue with the other boys, preparing the ground for Hospital tents. Wednesday weather warm, we are shifting quarters to another part of the camp. Fatigue in the afternoon at the hospital. Thursday weather still good. We received a challenge from the Artillery tea cricket match, we had game after tea. Friday I messed about all day\n\n \n\nwhile most of the others were over the hospital, we had cricket practice after tea. Saturday weather still good, we went over the hospital this morning, the cricket match came off this afternoon we had first innings & scored 87 they scored 92. I scored 10. ","57":" I was on the hospital fatigue all day. ","58":" under orders to proceed to the front.\n","59":" we left camp at about 5.30 & entrained at Etaples for Juchevilliers, we then marched to Val-el-Masion where a small camp has just been opened. ","60":" we loafed round all day & then marched out at 5.30, we marched about 7 miles to a place called Vardencourt near Contay arriving there about 9 PM. Thursday it rained a little in the morning, aeroplanes are common as they have been everywhere we have been to. Vic & I went for a walk to a village about 1 ½ mile away, it was full of Australians. ","61":" warm & muggy, we messed about all day. Saturday we went for a route march, it was very warm. ","62":" it rained a bit today we had a couple of small route marches. I went to a church service in the evening. Monday still showery we went for a route march. Tuesday still showery, we had a lecture. A steam wagon which was in the gutter since Monday was pulled out by caterpillar.","63":" still showery, also Thursday. Friday weather much better ","64":" weather fine, I hurt my thumb playing football. Sunday passed very quietly ","65":" weather fine, we left camp today for the firing line & stayed overnight at Albert.","66":" we marched through Albert at about 10 AM. It is a very old & poor looking place, only one decent building & that is the Church, which is ruined, the statue on top of the tower is hanging in a parallel position. Albert is a fair sized place, narrow streets, many of the shops & houses are in ruins.\n\n We arrived at Becourt (about 2 mile out of Albert) & had to clean up the billet (old building) there is a big battery just close to us & the shells whiz overheard. Last night \n\n \n\nwhen we were in Albert, Fritz sent a couple of big ones over near us, we had a big battery there. Taubes come over occasionally & our guns have a go at them, but so far they don’t seem to do much good. Flies are as numerous as in Egypt but they don’t annoy you so much. Claude came out of the trenches today.","67":" there was a big bombardment last night. Rumours say that the 1st Div. was cut up by our own fire while they were leaving the trenches, they lost more last night, than they did for 7 days. We are busy filling up old trenches outside our billet. Taubes came over again, but got away. More heavy guns have arrived round our billet & they were going strong this morning they shake you up some, they kept us awake last night. They shut up while Taubes are about. The weather is cool & dull.","68":" weather cool, we receive pretty good food here. The Boys are always looking for lice, so far I haven’t found any. Taube’s came over our lines.","69":" still trench filling. I left Becourt for La Boiselle about 9PM with about 30 of our chaps. We arrived there in about ¾ of an hour & fixed a dressing station up in a German dug out, it is about 25 feet or so deep. Last night previous to leaving Becourt several of us chaps visited the \"Crater\" made by a British & a German mine, it must be 50 feet or so deep & about a hundred y’ds across each way. The dug\n out is very strong & is divided into rooms, there are several stoves in it, it also has had telephone & electric light fitted up. There are several dug outs within 30 yards of this one. Saturday I have been messing about all the morning, the others are in the trenches. Fritz heavily bombarded us this morning, shells falling about 50 yds away, we returned the fire & have kept it up pretty hot ever since. I filled a lot of sandbags this afternoon, to make the dressing station \n\n \n\nBomb proof. Five German (Prussian Guard) prisoners were brought in tonight, 3 of them wounded, we were talking to them for a long time (trying to understand one another), it rained to-night.","70":" still rainy looking. We moved 8 of us off to the advanced D. station at 7.30 AM it rained during the day, just after tea, as usual the bombardment started, it lasted about an hour, guns roared alround us, the din was terrific, shells fell very close to us, which made us get into our dug out, later on one fell just outside, the concussion almost knocking us over. Monday we left the the Advanced station & met the others at the main dressing station. We marched off to our old Billet at Becourt, it was raining. We fell in again at 2PM & marched to Warloy near Contay, about 9 mile, where we were billeted.","71":" we marched off at 9.45 & camped the afternoon & night at Toutencourt about 4 mile away (in huts) after tea it blew terribly hard for about 45 minutes, numerous branches being broken off the trees, it teemed rain at the same time. Wednesday we marched out at 7.30 to place called Montrelet about 1 ¼ mile further on, it rained practically all the time & we were wet through, on the way we met a large number of Canadians, marching in the opposite direction. Rumours say & appear to be right, that \nwe\n are changing position with them. We are billeted in Barns in the village. ","72":" fine though rainy looking. Yesterday about 16 \"Anzacs\" were decorated by Gen. Birdwood, including one of our chaps, for conspicuous bravery. Saturday fine I was taken on strength of the","73":" Field Ambulance.","74":" we left Montrelet at about 9.45 AM & arrived at Longuevillette which is about 2 or 3 miles further on & was put up in billets.\n","75":" raining best part of morning, windy & stormy-looking in the afternoon. There is a lot of crops growing in all the parts of France, in which we have so far. When\n\n \n\non high ground, you can see villages nestling amongst the trees & in nearly all cases, they have a Church with a similar spire, there are Crucific’s all over the place. The houses are very poorly built, a kind of mud bound with straw on brick foundations. The stables are in front, house in the rear, with a farm yard in between, some have the surplous rain water in a hollow of the yard & all have a manure & rubbish heap in the Centre, for the fowls to scratch in, though the houses appear to be clean, the surroundings don’t seem to count. Every village has its water hole in the centre.","76":" a cold, rain looking miserable day. We are under orders to leave for Doullens, some time tonight. Wednesday we left for Doullens at 1.AM this morning. It was foggy though it turned out fine. We shunted onto another line & over the border into Belgium, we detrained at a place called Proven & marched about 5 miles & camped at a rest station just out side Poperinghe, the town shows just a few marks of bombardment. The day was rather warm. Thursday rather warm. I have been washing carts down. Friday fine, still washing carts. I went & had a bath this afternoon. ","77":"\n\nfine, though dull this morning. Sunday 10th fine, squad drill & Kit inspection. Monday, Claude came over Sat. we went for a route march this morning & the","78":" played the 6th at Australian Football this afternoon & were beaten. Tuesday we went for a route march this morning & were paid this afternoon. We played the","79":" Field Amb. at Rugby & won 5 to nil.","80":" showery & very rainy-looking. Thursday a wet cold miserable day. Friday a lovely day we played the","81":" Rugby & won 3 to nil. Saturday 16 weather fine, we played the","82":" at Soccer & won 5 to 1 & then we played them at Australian Rules & lost by about 12 Goals to about 5. Sunday lovely day I went to early morning communion at Poperinghe we are leaving camp at 10AM, we marched about 2 mile to Reninghelest \n\n \n\nwe were billet in huts. I was on guard tonight. ","83":" September,a wet miserable day. I went to a Y.M.C.A. Concert tonight, it was very good.","84":" fine day. Wednesday dull & rainy looking. Thursday usual route march in the morning, we played the","85":" Field Ambulance at Australian Football & lost. We had a few showers of rain. Friday route march, fine day. We played the","86":" Field. at Soccer & won 4 to nil I went to a concert last night & am going to another one tonight at the Y.M.C.A.","87":" lovely day we shift camp at 2PM. I received a letter from Doris. we arrived at our billets (the baths) in Poperinghe at about 3PM & were allowed leave at 7PM ","88":" lovely day. Monday lovely day. Tuesday. weather good, pay day Wednesday, fine morning, aerial duel shrapnel came down in the yard, it is rainy looking. ","89":" lovely day Also Friday. Saturday fine. Sunday fine. We played R.A.M.C. (131st Field A.) soccer today & lost by 2 to 1 ","90":" dull day. Tuesday light rain, we held a joint concert with the","91":" Field last night. Wednesday showery. I was scrubbing floors this afternoon. ","92":" fine though rainy looking. * I played in a possibly & probabal Rugby football match. Friday * (Saturday fine, on guard. Sunday I played Rugby football against the","93":" we won 3 to nil. ","94":" I received 37 letters. Tuesday rainy looking same as the last couple of day, but bright moonlight clear nights. Wednesday rainy looking, writing letters. ","95":" also Friday. Saturday we played the R.A.M.C. 131th Field Ambulance & won by 4 to 3. Sunday I played Rugby ","96":" fine I bought some presents Tuesday I received 15 letters. Wednesday we left Poperinghe for Steenevorde at about 10.15 & arrived there(about 8 miles) at about 12.45PM. After tea I went for a walk through the town.\n\n \n\nIt rained hard during the night. Steenvoorde is affair sized town, not quite as big as Poperinghe, but it is more select, better class shops, a lot of lace is made in both places. Poperinghe has 4 big churches, one has marks of German shells on the tower, a corner of the square being knocked off, it is not a spire, though the others are. The streets are cobbled & are narrow & winding, with a square in the centre of the town. The town is not ruined at all, though there are plenty of broken windows & shrapnel marks on all the buildings. Steenvoorde is intact, it has one big spire church, in a recess of the outside of the wall, is built a crucifix it is very pretty, being colored, with a background to it. It looks like the stage at the theatre.","97":" it is raining hard. We moved to another billet in the town after dinner. I went for a walk, after tea. Friday lovely day, frost this morning. We had a route march this morning. \n","98":" lovely day. Heavy frost this morning. We moved out of Steenvoorde at 10 AM We passed through Cassel a small village it is the prettiest & most select, that I have seen in France, it & the country surrounding is high & commands a good view of the country for miles. In a garden there, there was a lovely bed of flowering begonias. We stayed the night a couple of Kilo’s out of Noordpeene.","99":" we left our billet for St Omer arriving there (2 mile outside of the town about 2.15PM where we billeted in a farm. Monday fine, not as nice as yesterday. I went for a walk & helped to dig up carrots in the farm. Tuesday 24 sprinkling with rain, it is very rainy looking. We leave camp at 1.30 for Arques, about 4 mile away from Tilques, where we were billeted outside St Omer. Arques is on the opposite side of St Omer, we having to go back on the St Omer Rd for about 1 mile before branching off. We entrained at about 5.15PM \n\n \n\n& arrived at St Riquier about 4.30AM on Wednesday we had breakfast & marched 8 miles to a village called Ergnies arriving there at 11.30AM. St Omer is a large town with about 3 big churches, a nice railway station, which stands out prominently facing the bridge over the river. The country round about is very low lying on 3 sides of the town, it being under cultivation, it is very rich soil, growing onions, cabbage to perfection. A canal runs right up to the small river in the town, in the main Street every householder appearing to own a boat. Small canals run alround the gardens, the ground being that low lying, it must all be under water in the winter. There are a lot of apple orchards here so we had some good feeds. Thursday Raining. We had plenty of apples, there being a lot of apple orchards here.\n","100":" we fell in at about 6AM & marched 4 miles & waited for Motor wagons to drive us to a base, there must have been over 100 of them holding 30 men with their kits, they were great ponderous things. We started about 10AM & drove about 40 miles to a place called Denancourt (near Albert) passing hundreds of German prisoners working on the roads. We caught a glimpse of two tanks in a paddock. After disembarking from our Motors we were marched to our billets, which were cold & draughty. Saturday wet & cold Sunday Church parade in the open & rain. German prisoners sweep the mud off the streets. We were paid today.","101":" still cold & raining a little now & again. The nights are often very clear, not very cold, & the days rainy looking. On guard tonight. Tuesday, fine day","102":" fine morning a little rain in afternoon. I washed my clothes & had a bath. C Section tent Sub. Division left before tea. Thursday raining cleared up this afternoon. Warned not to leave the billets. \n","103":"\n\n \n\nfine, under orders & packed to leave. We left Dernancourt at about 10.30 & marched about 10 mile to Montauban outside of Bazentin, marching through Contalmais on. The march was slow & hard going, we repeatedly had to stop, traffic being heavy on the road, on one portion we werer shelled. We arrived at our Dugouts at dusk & turned in.","104":" we were at dawn & after breakfast we marched in fives (single column) about 2 mile to McCormicks post, where we went on duty carrying to the next post (Crest). We had some heavy carries, we got bogged with the first 4 men carry & had to get help.","105":" carry (6 men) we upset the patient, the mud being knee deep. We were shelled during day it rained at night. Sunday fine, 10.30 we moved further up to another post (1 mile) carrying there was better, though long, we were knocked up by night time, having had practically no sleep for 3 nights. Shells fall all round the posts. One carry my party met Infantry going \"in\" & in consequence, we were shelled all the way, one shell burst very close & smothered us with dirt. Monday done up (no sleep) showery we were relieved at 12 AM & went back to the Dump for 24 hours spell.\n","106":" we left the Dump & went on duty at McCormicks post 12 AM it was raining & my dugout was falling in, so I went in with 5 other chaps in another dug-out. I spent a cruel night, I sat up as the floor was wet. Wednesday weather fine easy day for us, it rained a little. There is an abandoned tank near us, so we had a look at it. It is about 9 yards long (body) two front wheels, working on a kind of lever, it is about 4 ½ yards wide 8 feet high, all the works were taken out so we didn’t see too much. The armour is only a little over ½ an inch thick.","107":" we were relieved about 10.30 & went to the Dump for our own spell, it is a nice day. I got\n\n \n\nEva’s parcel & 10 letters.","108":" we went on duty at about 10.15AM at the","109":" post. A taube was brought down by anti-aircraft fire, it fell like a stone, another was hit, & after wabbling & dropping for a while, righted itself. We had an easy day and night. Saturday news of Vic being wounded. We moved right up to factory Corner (about 5 mile from the base) it is close to the firing line, we had an easy day and night.","110":" we were relieved about 11 AM & went to the Base. I received Aunt Nell’s parcel & 2 letters, it is rainy looking though it hasn’t rained for about 4 days.\n","111":" foggy Morning we went on duty at the \"Crest\" Our 'boys' jumped over at 9AM (5th & 7th Brigade, with British on right & left of them) to do what the","112":" Brigade failed to do last Sunday week, we won two trenches, but believe we lost them again. I got hit this morning a piece of shell is still embedded in my pocket book. We are terribly busy carrying.","113":" fine, still busy, at about 3.30 we went right up to Goose Alley & had a very busy time, I nearly cracked up over it. Wednesday cold wind blowing, still very busy. We were relieved at 4PM & arrived at the base just as it was beginning to get dark. Thursday lovely day very frosty morning, mud frozen, got 4 letters. Sunny day though cold we left the Dump 1.30PM & went on duty at Drop Alley at 2.15PM. Friday, Frosty, ice an inch thick on the shell holes, Sunny but cold, we were relieved at 1.30PM & we went to North Post, we had an easy time. We have been lucky lately in securing German dug-outs, when we are not lucky we have to make our own. \n","114":" November, still cold, a slight fall of snow fell this morning, the weather now is a bit colder than our coldest in Sydney. We were relieved about 1.30PM. Sunday it rained last night & is cold & rainy looking now, I am having a spell, feeling a bit off color.","115":" fine. Our chaps went out yesterday, but came back tonight, as we are being relieved. Tuesday we fell in \n\n \n\nat 7.30AM & had breakfast at our headquarters & hung about till about 3.30PM & then entrained in trucks, travelled about 5 miles & detrained (not transport) & marched about 4 mile or so to our billets a few Kilo’s out of Albert (near Dernancourt) cold day.","116":" foggy, lovely day, went for walk late afternoon. Thursday lovely day, leave granted 10 per cent section to visit Amiens (1 day) daily. We went to the baths, but couldn’t get in.","117":" cold rainy looking went to the baths. Saturday steady rain all day.","118":" still raining, it cleared up tonight. Monday lovely day. Tuesday foggy & cold.","119":" I went on leave to Amiens, about 20 of us all told going in. We jumped on Motor lorries & arrived in Amiens (about 20 miles away) at 11AM. I visited the Cathedral, it being a beautiful building, though it is sand-bagged, as protection against bombardment. Amiens is a large city, narrow streets, nice shops, a light electric tram service runs in several directions. We caught motor lorries back to camp at 7PM after an agreeable day. \n","120":" foggy & cold we marched out at 10 AM to the & entrained at 1PM & after a slow journey we detrained at - 10 miles the other side of Amiens & we marched 5 miles to La Chaussee , where we billeted in barns. A small town, Picquigny by name, is about 1 mile away. Friday foggy, I am a bit off color, on lights guard tonight.","121":" still foggy. Monday lovely day, though a bit cold, played the Tommies at Rugby, we won 31 to nil, I played. Tuesday foggy & cold I marched out at 1PM with a fatigue party to go to the","122":" Field Amb, we marched about 8 miles to Viedecourt & billeted in huts. Wednesday very cold, on fatigue Thursday foggy,","123":" foggy still fatigue.","124":" as yesterday Sunday Pay Day, went to the town & had tea it being half holiday. Monday !! the sun came out for a while, but rained afternoon. Tuesday, snowing lovely sight. Wednesday we marched out at about 11AM & arrived back at La Chaussee at about 1.15PM. Thursday\n\n \n\non leave to Amiens, we walked a couple of miles & then caught a lorry, had a good day & we had a hot plunge bath. Trained it home about 8 miles it is","125":" weather still miserable, I received two Xmas parcels on Wednesday. \n","126":" weather still miserable.","127":" as yesterday. Monday. paid last night, we moved out at 5AM & marched to Bignacourt & entrained & detrained at Buire about 24 miles away we stayed a few hours at Buire & then C section moved to Ribimont where we billeted in a mill. Tuesday Snowing, we went on a route march.","128":" lovely fine day, Route march. Thursday it rained bit, a wild night. Friday we left the Mill at 7.30AM & arrived at Buire 8AM, & joined up with the other sections, marched out at 9AM going about 8 miles to \"(Melbourne)\" where we billeted in huts, the sun came out this afternoon. Saturday we marched out at 4 A.M. to a Dressing (HQuarters at Bernafoy) station (about 3 mile) a wild day. Sunday showery & sunny, we (some of the Boys) have a camp fire evening in a cookhouse, we \"Pudden\" & cocoa.\n","129":" cold & windy I was orderly room Runner. Tuesday fine though cloudy, still a runner. Wednesday still a runner, fine day. Thursday fine morning, we go into the line at 2PM we arrived at our post at about 4PM & put up in Dugouts. Duckboards are laid out on the path to carry on, they are very hard to carry on, we fell several times with our first carry which was just as it was getting dark.","130":" Dec, threatening rain, easy times Saturday same as yesterday. Sunday fairly busy, relieved at 3.30PM. Monday cold & & rainy looking, we opened a canteen.","131":" put on washing job. Wednesday had a bath, still on washing job. Thursday raining a little, a fine moonlight night.","132":" fine day, still washing. Saturday showery, at 3PM I went went went with a fatigue party, to dig dug-outs for a Bearers Post, it being too exposed we had to do it at night, it was moonlight at 9PM we finished, so we went back about 1 mile to another post to rest & \n\n \n\nsleep. The Post we are making is about 4 miles further on from headquarters. \n","133":" we stayed in bed all day, Our sleeping quarters are newly made Cor. Iron sheds dug in the earth, not yet finished, mud is 6 inches deep on the floor. we had to put corrugated iron on the floor, supported by wood, to keep the mud under, we slept fairly well the first night, (at 4.30PM we went back to work, we work real hard, it rained hard on our way back & we were wet through, the rain came in the shed at the top of the front wall, passed a fair night. Monday relieved at 10AM fine day. I received two parcels (McCarrons & Uncles) it rained tonight. Tuesday on general fatigue, cloudy & cold.","134":" rainy looking, we relieved the","135":" Field at 4PM I’m at Battery post. Thursday it snowed a little, easy times. Friday raining a little. Saturday same as yesterday, we have some bad night carries on the Duck boards ","136":" fairly warm though dull. Monday dull like yesterday, we were relievd at 3.45 by the","137":" on Fatigue.","138":" we left Bernafoy for Becordal by train (trucks) about 6 miles we arrived there about 3PM, slept in tents, it snowed hard last night, there is a fair fall. \n","139":" met Arthur Davies, put on ward duties. Friday 19 dull frosty weather. Saturday & Sunday dull & frosty snow still on the ground Monday off ward duties, paid today weather same. Tuesday 23 we left Becordal at 12 AM fine day though cold & frosty we marched to Albert (2 miles) & joined the others at the old Hospital. Wednesday weather same. Taubes are always coming over. Fritz shelled our camp with 12 in. shells, wounded three of us. Thursday, Friday, Saturday & Sunday the same. Taubes bombed & machine gun fired on us tonight it was moonlight.\n\n"}}