{"Document Name":{"0":"Diary_0069","1":"Diary_0069","2":"Diary_0069","3":"Diary_0069","4":"Diary_0069","5":"Diary_0069","6":"Diary_0069","7":"Diary_0069","8":"Diary_0069","9":"Diary_0069","10":"Diary_0069","11":"Diary_0069","12":"Diary_0069","13":"Diary_0069","14":"Diary_0069","15":"Diary_0069","16":"Diary_0069","17":"Diary_0069","18":"Diary_0069","19":"Diary_0069","20":"Diary_0069","21":"Diary_0069","22":"Diary_0069","23":"Diary_0069","24":"Diary_0069","25":"Diary_0069","26":"Diary_0069","27":"Diary_0069","28":"Diary_0069","29":"Diary_0069","30":"Diary_0069","31":"Diary_0069","32":"Diary_0069","33":"Diary_0069","34":"Diary_0069","35":"Diary_0069","36":"Diary_0069","37":"Diary_0069","38":"Diary_0069","39":"Diary_0069","40":"Diary_0069","41":"Diary_0069","42":"Diary_0069","43":"Diary_0069","44":"Diary_0069","45":"Diary_0069","46":"Diary_0069","47":"Diary_0069","48":"Diary_0069","49":"Diary_0069","50":"Diary_0069","51":"Diary_0069","52":"Diary_0069","53":"Diary_0069","54":"Diary_0069","55":"Diary_0069","56":"Diary_0069","57":"Diary_0069","58":"Diary_0069","59":"Diary_0069","60":"Diary_0069","61":"Diary_0069","62":"Diary_0069","63":"Diary_0069","64":"Diary_0069","65":"Diary_0069","66":"Diary_0069","67":"Diary_0069","68":"Diary_0069","69":"Diary_0069","70":"Diary_0069","71":"Diary_0069","72":"Diary_0069","73":"Diary_0069","74":"Diary_0069","75":"Diary_0069","76":"Diary_0069","77":"Diary_0069","78":"Diary_0069","79":"Diary_0069","80":"Diary_0069","81":"Diary_0069","82":"Diary_0069","83":"Diary_0069","84":"Diary_0069","85":"Diary_0069","86":"Diary_0069","87":"Diary_0069","88":"Diary_0069","89":"Diary_0069","90":"Diary_0069","91":"Diary_0069","92":"Diary_0069","93":"Diary_0069","94":"Diary_0069","95":"Diary_0069","96":"Diary_0069","97":"Diary_0069","98":"Diary_0069","99":"Diary_0069","100":"Diary_0069","101":"Diary_0069","102":"Diary_0069","103":"Diary_0069","104":"Diary_0069","105":"Diary_0069","106":"Diary_0069","107":"Diary_0069","108":"Diary_0069","109":"Diary_0069","110":"Diary_0069","111":"Diary_0069","112":"Diary_0069","113":"Diary_0069","114":"Diary_0069","115":"Diary_0069","116":"Diary_0069","117":"Diary_0069","118":"Diary_0069","119":"Diary_0069","120":"Diary_0069","121":"Diary_0069","122":"Diary_0069","123":"Diary_0069","124":"Diary_0069","125":"Diary_0069","126":"Diary_0069","127":"Diary_0069","128":"Diary_0069","129":"Diary_0069","130":"Diary_0069","131":"Diary_0069","132":"Diary_0069","133":"Diary_0069","134":"Diary_0069","135":"Diary_0069","136":"Diary_0069","137":"Diary_0069","138":"Diary_0069","139":"Diary_0069","140":"Diary_0069","141":"Diary_0069","142":"Diary_0069","143":"Diary_0069","144":"Diary_0069","145":"Diary_0069","146":"Diary_0069","147":"Diary_0069","148":"Diary_0069","149":"Diary_0069","150":"Diary_0069","151":"Diary_0069","152":"Diary_0069","153":"Diary_0069","154":"Diary_0069","155":"Diary_0069","156":"Diary_0069","157":"Diary_0069","158":"Diary_0069","159":"Diary_0069","160":"Diary_0069","161":"Diary_0069","162":"Diary_0069","163":"Diary_0069","164":"Diary_0069","165":"Diary_0069","166":"Diary_0069","167":"Diary_0069","168":"Diary_0069","169":"Diary_0069","170":"Diary_0069","171":"Diary_0069","172":"Diary_0069","173":"Diary_0069","174":"Diary_0069","175":"Diary_0069","176":"Diary_0069","177":"Diary_0069","178":"Diary_0069","179":"Diary_0069","180":"Diary_0069","181":"Diary_0069","182":"Diary_0069","183":"Diary_0069","184":"Diary_0069","185":"Diary_0069","186":"Diary_0069","187":"Diary_0069","188":"Diary_0069","189":"Diary_0069","190":"Diary_0069","191":"Diary_0069","192":"Diary_0069","193":"Diary_0069","194":"Diary_0069","195":"Diary_0069","196":"Diary_0069","197":"Diary_0069","198":"Diary_0069","199":"Diary_0069","200":"Diary_0069","201":"Diary_0069","202":"Diary_0069","203":"Diary_0069","204":"Diary_0069","205":"Diary_0069","206":"Diary_0069","207":"Diary_0069","208":"Diary_0069","209":"Diary_0069","210":"Diary_0069","211":"Diary_0069","212":"Diary_0069","213":"Diary_0069","214":"Diary_0069","215":"Diary_0069","216":"Diary_0069","217":"Diary_0069","218":"Diary_0069","219":"Diary_0069","220":"Diary_0069","221":"Diary_0069","222":"Diary_0069","223":"Diary_0069","224":"Diary_0069","225":"Diary_0069","226":"Diary_0069","227":"Diary_0069","228":"Diary_0069","229":"Diary_0069","230":"Diary_0069","231":"Diary_0069","232":"Diary_0069","233":"Diary_0069","234":"Diary_0069","235":"Diary_0069","236":"Diary_0069","237":"Diary_0069","238":"Diary_0069","239":"Diary_0069","240":"Diary_0069","241":"Diary_0069","242":"Diary_0069"},"Date":{"0":"unknown","1":744.0,"2":745.0,"3":746.0,"4":747.0,"5":748.0,"6":749.0,"7":750.0,"8":755.0,"9":756.0,"10":759.0,"11":760.0,"12":761.0,"13":762.0,"14":763.0,"15":764.0,"16":765.0,"17":766.0,"18":767.0,"19":768.0,"20":769.0,"21":770.0,"22":771.0,"23":772.0,"24":773.0,"25":774.0,"26":775.0,"27":776.0,"28":777.0,"29":778.0,"30":779.0,"31":780.0,"32":781.0,"33":782.0,"34":783.0,"35":784.0,"36":785.0,"37":786.0,"38":787.0,"39":788.0,"40":789.0,"41":790.0,"42":791.0,"43":792.0,"44":793.0,"45":794.0,"46":795.0,"47":796.0,"48":797.0,"49":798.0,"50":799.0,"51":800.0,"52":801.0,"53":802.0,"54":803.0,"55":806.0,"56":808.0,"57":809.0,"58":810.0,"59":811.0,"60":812.0,"61":814.0,"62":815.0,"63":816.0,"64":817.0,"65":820.0,"66":821.0,"67":822.0,"68":823.0,"69":824.0,"70":825.0,"71":826.0,"72":827.0,"73":828.0,"74":829.0,"75":830.0,"76":835.0,"77":840.0,"78":841.0,"79":842.0,"80":843.0,"81":847.0,"82":852.0,"83":853.0,"84":856.0,"85":857.0,"86":859.0,"87":860.0,"88":861.0,"89":862.0,"90":863.0,"91":864.0,"92":865.0,"93":866.0,"94":868.0,"95":873.0,"96":874.0,"97":875.0,"98":876.0,"99":877.0,"100":878.0,"101":883.0,"102":884.0,"103":885.0,"104":886.0,"105":887.0,"106":888.0,"107":889.0,"108":892.0,"109":893.0,"110":894.0,"111":895.0,"112":898.0,"113":900.0,"114":908.0,"115":910.0,"116":913.0,"117":914.0,"118":915.0,"119":919.0,"120":921.0,"121":922.0,"122":923.0,"123":924.0,"124":927.0,"125":928.0,"126":935.0,"127":936.0,"128":937.0,"129":938.0,"130":939.0,"131":940.0,"132":954.0,"133":957.0,"134":958.0,"135":959.0,"136":960.0,"137":961.0,"138":962.0,"139":963.0,"140":964.0,"141":965.0,"142":966.0,"143":967.0,"144":968.0,"145":969.0,"146":975.0,"147":976.0,"148":977.0,"149":980.0,"150":981.0,"151":982.0,"152":983.0,"153":984.0,"154":985.0,"155":986.0,"156":987.0,"157":988.0,"158":989.0,"159":990.0,"160":992.0,"161":993.0,"162":995.0,"163":996.0,"164":998.0,"165":999.0,"166":1000.0,"167":1001.0,"168":1002.0,"169":1003.0,"170":1004.0,"171":1005.0,"172":1006.0,"173":1007.0,"174":1008.0,"175":1009.0,"176":1010.0,"177":1011.0,"178":1013.0,"179":1015.0,"180":1017.0,"181":1018.0,"182":1019.0,"183":1020.0,"184":1023.0,"185":1024.0,"186":1025.0,"187":1026.0,"188":1027.0,"189":1028.0,"190":1029.0,"191":1030.0,"192":1031.0,"193":1034.0,"194":1036.0,"195":1038.0,"196":1042.0,"197":1043.0,"198":1048.0,"199":1050.0,"200":1051.0,"201":1052.0,"202":1053.0,"203":1055.0,"204":1056.0,"205":1057.0,"206":1075.0,"207":1076.0,"208":1077.0,"209":1078.0,"210":1079.0,"211":1080.0,"212":1081.0,"213":1082.0,"214":1083.0,"215":1085.0,"216":1086.0,"217":1087.0,"218":1088.0,"219":1089.0,"220":1091.0,"221":1092.0,"222":1093.0,"223":1094.0,"224":1097.0,"225":1098.0,"226":1100.0,"227":1103.0,"228":1104.0,"229":1106.0,"230":1108.0,"231":1109.0,"232":1111.0,"233":1112.0,"234":1116.0,"235":1119.0,"236":1123.0,"237":1129.0,"238":1138.0,"239":1140.0,"240":1146.0,"241":1149.0,"242":1150.0},"Entry":{"0":"\n\n","1":"\n\nMaadi\n\nI left the peninsular with the","2":" Div Head Quarter’s Baggage on","3":"\n\n(two days before the final evacuation) ‘Ence to Lemnos, Had a deal of trouble with the stuff, we had to handle it seven times all told. We landed at Lemnos on Friday 17 Dec &amp; got into camp with stuff that evening. Coulstock &amp; Tetley & I had a good look about for a few days, visiting the villages &amp; eating nuts & chocolate. Some horses came however & they wanted us to groom them so we just paraded & Hastie told us that we had done good work & he did not wish us to take on a job that we did not care for so we could go to the","4":" LH & go to Egypt with them & rejoin our unit there. We went to the 4th LH camp Thursday 23 Dec & Friday 24th we left Lemnos travelling on the \n\nR C Burgess 2803, 7 Field Co Eng 4th Sect Engineers Hdqr 2nd Aus Div\n\nJ. Blow 52 Baptist St\n\nD T Noil 18 Gillingham St. Victoria S.W. London\n\nMr G. Gibbins 118 Johnston St Annandale\n\nG A Haslam 1616 2 Remount Unit 4th Troop 6th Squadron\n\n2618 Corp. Brabner 7 Field Coy.\n\nEngland Sap. Burgess France, R C Burgess\n\nFiring Line Bert, elsewhere Bro.\n\nMrs T Brown \"Gowanlea\" Selkirk Scotland\n\nG King Tabbagong \n\nNo 3454 C Johnstone 9th Royal Scots British Ex F France\n\n214 SSM K Ross 13th Coy Imp Camel Corp Abbassia\n\n1184 Trp F G Rogers\n\nF F Anderson St S. Ken.\n\nNo 1209 Corpl John Rhys Thomas 3rd Troop C Squadron 1\/1 Welsh Horse Egypt\n","5":"\n\n\"Caledonia\" got into Alex on Sunday & disembarked on Monday morning & entrained right away for Heliopolis. I put in two days at this camp then came back to Maadi & joined up with my Regt I got back into my old A troop again. Received a bundle of 29 letters & a parcel from Bill & found my kit bag & it was fairly intact containing my two pairs of boots & a pair of leggings. The boys have been drinking up well & are making up for the time spent on the peninsular - It is not bad to have a free for a while.\n","6":"\n\nTelegraph 9 Double line parallel with Rway; single line following West side of Suez Canal\n\nBridges 10 Wooden Bridge over Sweet Water Canal at Lock 4 ft wide, carry 2 tons\n\nFences 11 Nil\n\nTime \n\nDate\n\nPlace Point on Suez Canal - Name\n","7":" m W of Station entrance - Rank\n\nto Bitter Lake – Patrol\n\nTo Right Flank Patrol\n\nNo of message Date\n\nNo 2 –","8":" \n\nText – In contact with enemy Patrol\n\nFrom No 3 Patrol\n\nPlace – 500 yds SE of old Farm House\n\nTime – 1030\n","9":"\n\nMaadi Camp\n\nI am on piquet to night it is not much of a job. There are 24 of us on for the squadron, just twice as many men as are needed - Johnson & I are on the last shift for our watch, 3.0 am until Stables in the morning. I was in Cairo yesterday & was at the dentist to get some teeth fitted. They costing &pound;4-0-0. I have to go in tomorrow night to get them. Trinder came back yesterday; he is taking charge of the troop & Bill is L. Sgt - Beuzeville corporal. The other night I was up at the Y.M.C.A. hut doing some writing & I met Charlie Gee & Mullins of the tramway ; they are at the Remount Depot. This morning the whole regiment was on mounted parade & we had a solid mornings drill. there was a lot of growling amongst the men because they were getting their legs bumped & squeezed in the lines; The horses as very fresh & look real well. I have got Stantons mare & she has gone well & steady so far – Received eight letters today so have not done so bad\n","10":"\n\nMaadi\n\nWent into Cairo to get my teeth yesterday. when I got in I found that I had left money at home & had to return to camp to get it. Teeth don’t feel too good have to go in again. Had a good time in town and got home very much after hours. J Woods Stevens and Hughes returned on Joe & Steve are in the troop but Hughes is it hard to get in. It is all drill & there is a great getting together of gear & a route march on Tuesday. I think we must be getting away very soon. \n\nLater I took a walk up to Maadi & went into the Soldiers Club. It was run by the folk of Maadi. One can get a cup of tea & two pieces of bread & butter for 1 Piastre – They are good folk; give all their time & just run it for the benefit of the Soldiers \n","11":"\n\nCairo\n\nI am at present waiting at the dentists in Cairo to see about my plate, it does not fit too well. I put in for a pass last night & they said I could get one alright from 3 oclock. We had to go on mounted parade with all gear up ready to move off at 2.30 & the marched us out to the desert & back again, it was 3.45 when we got back. I felt like blowing them up as I wanted to catch the 3.38 train & had to be here in daylight however I went to the Station & got a train at 4.40 which served alright. Every thing is packed ready to go off & we are wondering whether we will do a route march only or get a move on to-morrow – The front of Shephards Hotel is crowded with officers. The garrys are rolling along filled with people coming into town\n","12":"\n\nMaadi\n\nIt was all bustle this morning. I had to look around to find any blankets for they were not to be found when I got home from Cairo. last night indeed at first I could not find anything, but after a look about found my saddle & got my coat off it & then got a spare couple of blankets so was alright. I got all my gear this morning except one blanket. We had to pack up this morning & be away by nine oclock. We went to Heloun & returned this afternoon. I feel tired & not much in the humour to take charge of the stable pickquet, however we have got all the horses fed & the men are posted so I think I will turn in. Some of the men who went away with a composite regiment have come back tonight. they had a couple of brushes with the enemy & dispersed them. I don’t know where they were yet. That bally dentist kept my plate so I have to go in again to see him \n","13":"\n\nSoldiers Club Cairo\n\nWe were out on mounted parade this morning – My mare was fairly lively. They are tossing out all the chaps into the details who do show up too well. At dinner time I got a letter from Bert, he is on the Canal & is working hard. This after noon we packed our saddles just to put in time, when it came time for watering our neddies we had to dismantle them & take the gear to the tents, I put in for a pass to come in & get my teeth, it was a bit of a strain as I only had only 6 ½ pt & after making an excuse to Leo Godber & Johno I walst off got my teeth (which are OK this time thank goodness) & slipped down here to this caffe by my self where food is cheap, I don’t like spongeing on them though they are good chaps all of them.\n\nI was put in charge of the pickquet last night, I do not know whether that means I have got my stripe back or not. To night before I left I received a parcel with a scarf, some handkerchivs singlet etc from Aunt Uncle & Mother. I was glad to get, I thought it must have gone astray\n","14":"\n\nSoldiers Club Maadi\n\nWe were drilling today, has a fairly easy time of it, some one said it was because our squadron leader had a big night in town last night. He came & told me I was Lance Corporal again. Johnson is made L.C. also. I don’t know what they intend doing about Les Godber, he was supposed to have a stripe. This place is run by the people of Maadi, it has several rooms for reading & smoking in & others for meals. It is run at cost price & they give their time for nothing. We are to go on a route march tomorrow again. Reveille at 5.0, move off at 8.0. I don’t know where we are going, nor for how long, some say we are going to bivouac all to morrow night. Had a great laught at Les, he got merry in town he was dead funny. Evans is leaving my section to go with a mate so now I Have J Woods H & , not bad chaps at all.\n","15":"\n\nSoldiers Club Maadi\n\nWe were on the parade ground in full marching order at 8.0 this morning & went up to Heloun again, this time we went by way of the desert – had a pretty decent trip & got back about four oclock. Evans left my section & Joe Woods came in his place – old Joe is a thundering good sort. Got eight letters this evening so am well in the according to Vic – the troops are playing up in Australia, they want to send the beggars right into it, that would quieten them.\n","16":"\n\nMaadi \n\nThere was no parade this morning but we had to pull down the tents & have a general clean up, & this afternoon we did nothing. all the troop are on Inlying pickquet to night. I do not know how I escaped some duty. Johno is on Stable pickquet. Stevens took on a job of groom for Mr McKenzie our troop leader. Spinney & Tindall came out to have a look at us this afternoon – Tindall is out here for good but I think he will go into the details. Lucas had to drop out of the regiment as his shoulder would not stand the strain – he was telling me however that he has a chance of getting into the regimental stores. At the meal rooms at present one has to be on time to get a decent fill. We are supposed to get 8 ½d per day allowance now but we used to live a deal better on the old 6d per day which was allowed us before we went to Gallipoli. Someone must be getting something out of it. Such a scramble as there is around the dixie when it is brought in – one would think to look at it that it was a football scrum. To night there were two tins of salmon on our table & both were bad. It is a most beautiful night & I have just had a walk around Maadi, it looks well in the moonlight.\n","17":"\n\nMaadi\n\nWe had a nice comfortable sleep inside the tent last night, most of the boys were on pickquet that was why I slept in the tent. I think I will sleep in side tonight also as it looks like rain. The chaps came in & woke us up half an hour early this morning & the language in the tent was vile for a while. Went on Church parade this morning & this afternoon went up to see a couple of at the Remount Depot - coming back I met ‘perkie’ he is in the 7th Reg. I got yarning to him & as a result was late for stables & got a burst about it from Bill – I found that while I was away my mare had got caught in a chain & had hurt her leg – I am sorry about it & hope she soon gets right. Weston was out to see us to day & Doug Kenyon arrived back from Malta – he looks well on it. Weston brought some things out with him so to night we had cake, chocolate, peaches & oysters, a fine mixture but its wonderful what a chap can stand.\n","18":"\n\nThere is great speculation as to when & where we are to go. Tom Sherry has just come in & said that we are to leave on Friday & that we are to go to France. This is the very latest - came down after tea smoking a cigar, he was puffing on dog. Lucas asked him if he saw another where he picked that one up. I was seedy this morning had a touch of Gallipoli so as the mare’s leg was sore I did not go on parade, but this afternoon I turned out & rode Lamb’s horse, not a bad little beast & I enjoyed my ride. It has been raining to day & to night it does not look too promising. It a beggar to be broke. I went to go out to see the Troubs but Im . \n","19":"\n\nMaadi\n\nI rode my mare out this morning, she went well & I think her leg will be alright now – We did some fast \"dismount for action\" work, it was quite exciting at times, we had a great ride across the desert to shelter when a shower came on us. This afternoon we got paid, its fine to feel independent once more & to be able to buy ones own smokes. Johno received a parcel & we had another blow out after dinner of sausages tomatoes, asparagus, & cake. I am on picquet, they are coming the old trick of putting us L.Corps on as troopers again. It has been cold today & some sleet fell at one time – nearly all the boys are in town to night. I have put in for a 12 noon pass for tomorrow, hope that I get it. We are supposed to leave on Friday, that is the latest.\n","20":"\n\nMaadi\n\nWe paraded in full dress this morning, went for a short walk & returned to camp again – I went into Cairo in the afternoon\n","21":"\n\nMaadi\n\nWe thought that we would we be getting away either to night or in the morning but after we came in from a full dress parade we were told that it was all off & we had to get our kit bags back & strip our saddles again – There is a rumour of us going away on foot again – goodness what will be next. Walker (Lieu) took charge of our Squadron this morning, he let us stand easy most of the time. This after noon it rained very heavily & water is lying every where – its beastly cold too. Egypt is a dead queer place\n","22":"\n\nMaadi Y.M.C.A. Tent\n\nThere is a farewell concert here tonight & the place is crowded early, every seat is taken & the chaps are standing in all other available space. We had a quiet days drill to day. got finished up in good time. Don’t feel too good on account of a bally boil on leg which me up when riding. Regimental Srg Major of the Details has thrown in his stripes & came in to the Regiment as a Lance Jack – he seems a good & capable chap. no doubt he will soon get pushed higher.\n\nIm broke absolutely broke again & it’s a beast, when one is in with a lot of cobbers, one has often to pinch off so as no to seem to be too much of a I heard old Rossie going crook on Masher his old horse which he had to get rid of because the Capt considered him too lively. Shaking his fist, he said \"A man ought to put that right through you to think that after a man thinking of you while all the while I was on Active Service, you should turn a man down\"\n","23":"\n\nMaadi\n\nI put in a very bad night last night with my leg so went to the Doctors this morning & he marked me exempt from duties. Bill told me to clear off so I came down here to the Y.M.C.A, tent, as they were pulling all our tents down this morning & having a general clean up. The concert went off well last night the place was packed & the chaps outside cut holes in the mat walls of the tent to see through. The concert finished up with a Farce given by the Maadi people, - it was good but not quite the sort of stuff the boys appreciate most.\n\nThere are rumours of fighting on & about the Canal & that the","24":" LH Bde have had some casualties. The weather is beautiful just now, but cold of nights & mornings. The boys are in Cairo most nights so usually one is awakened at any old hour between \"Lights Out\" & \"Reveille\" as they return, - they are mostly pretty merry & one night one chap woke us all up so as we could see that he came home sober. This morning some of them got back ½ an hour before the bugle & of course woke us up. the abuse they got was awful\n","25":"\n\nMaadi\n\nI had another day off to day – have got the \"\" also now & feel pretty crook \n","26":"\n\nMaadi\n\nI have been off duty for four days now but I feel much better this evening & will be able to go on Parade to morrow alright. I believe on Sunday there was a bit of a riot in Cairo amongst the natives & couple of thousand of them paraded in front of the Sultan’s Palace & made some sort of disturbance. some Egyptian Cavalry were called out & they charged the mob. Several were killed & about 16 wounded\n\nThis afternoon Harold had a fall off his horse while leading three others, - he had a lucky escape, being dragged a few yards by the stirrup, - one of the horses grazed his forehead with its foot. Last night all the boys stayed in & were in bed before seven oclock. They were all about knocked up for want of rest with running into Cairo every night.\n","27":"\n\nMaadi Camp\n\nAnother day off with my crook leg I feel pretty well other wise except for a sore throat. Harold hurt his ankle yesterday when he fell from the horse & to day it is bunged up, he is also off duty. Every body has to parade this after noon for some reason, Cook Batmen & all. We have our own mess orderly on now & we get on a great deal better - \"Cookey\" from this tent has taken it on for us. a dry old stick he is too – The other day his old horse fell with him while cantering up into line from troop formation. I thought he was hurt but he got up all smiles & carried on. To day ie the anniversary of the landing in Egypt of the 6 L.H.R. I wonder where we will be next","28":"\n","29":"\n\nMaadi Soldiers Club \n\nI was on Day Stables all day to day a long job & plenty to do. When the horses are fed all the troop fall in & are dismissed & then one is kept busy watching that no horse throws his nose bag off. after they are finished one has to collect the bags, clean the lines, re pair any bad leg ropes etc until it is time to fill the bags again then water the horses on the line. I was out with Perky last night, we had a long yarn & a cup of tea. I was glad to see him, he has not altered much, nor has he become a \"dinkum\" Soldier yet. The Y.M.C.A. tent was crowded. I looked in as I came past, there must surely be a concert on to night.\n","30":"\n\nMaadi\n\nIt is raining again, it is becoming a terrible place for rain, this Egypt. Saturday it’s a sort of clean up day & during the afternoon we do nothing except feed the horses on green stuff. I received a letter from Bert. He is on the Canal at a place called \"Serapeum\", Ive never heard of it. The boys in the tent were talking of Anzac when I left, they do not speak of it as a rule – Fisky was there, he did not get over, but got 14 days in detention for trying to scale across. Joe Woods went into Cairo on leave & Harold Laebrand went with him.\n\nHarold was on pickquet but tossed \"Sonno\" who would do the lot, & I had to answer his name for him. The water is coming through the roof & most of the boys have to give up writing. I have struck a dry patch, in between the drips so am lucky. The roofs in Egypt are mostly flat, they are not made to keep the water out. If things keep going on like this though they will all have to get new roofs on their houses.\n","31":"\n\nMaadi\n\nOn Inlying pickquet to night & have made my bed up near the feed heaps. We have to sleep up about the meal room & its not a good place as the boys are making a beastly row playing two – up, such a noise. Dont give one much chance to sleep. This morning Mr Ryrie got all the old boys in the troop to get their photos taken – I hope they turn out alright. It rained all last night but it is nice & bright to night.\n","32":"\n\nMaadi\n\nAll we had to do this morning was pack our saddles, then we had an early dinner 12 o’clock, parading at 1.15 – It was a Brigade affair & they took us out on the desert, formed us up & had our photos taken. The Brigade looked well when formed up but on the whole the marching was bad. My mare went any way & I was glad when we got back. We did not get back until nearly 5 oclock & were in the saddle the whole time. I tell you my arm ached with the weight of the rifle for we were at the \"Advance\" nearly the whole time. Every one was growling at the other about the dressing & cramming – it was funny to hear the arguments. \n\nJoe Woods & I went for a walk around Maadi this evening & ended up with cup of tea at the Soldiers Club. To morrow we are to go for a route march to Heloun where we are to bivouac for the night – I hope its not wet or too cold, a terrible dew falls at this time of year & its not too good sleeping out. Two or three of our chaps have gone into hospital – they will have to go back to the Details I’m afraid. Its funny they tell us in the Regiment that if we do not shake ourselves together we are likely to be put back into the details, & in the Details they are told that if they do not do their drill properly they will be shoved into the Regiment. It’s a dead funny World\n","33":"\n\nWe got a move on at 1.0 pm & arrived at Heloun at a bit before sundown but there was very little water in the channel so it took a long time to water the horses & it was about dark when we were fixed up with horses on the lines & able to sit down to some tea. The majority of the boys went to a concert afterwards but Joe Woods & I went for a walk around the town – It is a quiet little place & has many good buildings also some smelly corners. I bought a packet of cigarettes named The Australian Flag. Joe & I gave these the cake for being the worst we had ever smoked so I kept the packet so I could give some to the boys next morning\n","34":"\n\nWe left early & I had a lively ride home as the mare knew that she was homeward bound & was anxious to get on, we had several little quarrels on the way & I think we were about even on it. We got paid during the afternoon & as there was a pass to spare I took advantage of it & went into Cairo. I received some letters before going in & some more when I got back – nearly all the boys were full on it & when I got back there was trouble brewing. One of the pickquet got drunk & was put in the gaurd tent & the Corporal of the pickquet was also put under arrest – They are treating old Beuzeville rotten, they had one Corporal to many in the Squadron & told him that his promotion was not confirmed so he had to revert to the ranks & Corp Cameron came into the troop.\n","35":"\n\nTo day seemed very like a Sunday as there was no parade to speak of. This afternoon the Brigade held their Sports & the 6th Reg pretty well scooped all the prizes. I was down for a little while – a number of Nurses were there & it’s a treat to see their fresh faces. After stables we were all formed up & received a lecture from our Squadron C.C. Mr Anderson. He is going to be heavy on the chaps who don’t play the game on stable pickquet. Perky was to be round to night & I am waiting to see him – Time he turned up.\n","36":"\n\nDrill as usual to day - quite an easy sort of day, longs smokes – Its funny to see the niggers come along as soon as we dismount for a spell selling chocolates & oranges – My mare wont give me a minutes peace when Ive got hold of an orange. Lost my shaving gear out of the tent & its all sorts of a blanky blanky. I had to get shaved by a Gyppo to night & he brought blood in more than one place.\n","37":"\n\nMaadi\n\nThe usual cleaning up parade this morning & half holiday this after noon. To night I am on in charge for the stable pickquet. The boys in the mess room where I am writing are gambling for all they are worth & they make a deuce of a noise over it too. Bill Ross is suffering from a swelled face & it looks like mumps but the other morning when our troop leader Mr McKenzie asked him what was the matter, Bill told him the face ache – This afternoon quite a number of boys went out to the races – I think the Colonel was running a horse & they wanted to get on to it. \n\nTo night for tea we did well as so many were away & Cookey our mess orderley put on Blanc Mange & preserved peaches – Yesterday the boys had to draw to see who was to leave the troop as we were one over strength & C Troop wanted a man, the \"lot\" fell to Rogers, one of the reinforcements – The weather seems to be getting warmer now, to night it is bright & clear & not too cold.\n","38":"\n\nMaadi\n\nI was at Church Parade this morning & for a change went to the non conformists. The chap who was preaching in spite of his queer style delivered a good sermon. This after noon I spent writing letters a job I don’t take to easily of late. The boys did not do too well at the races yesterday – They all came home growling at the tote. Bill came out of one race ½ pt the better & Perce put &pound;2.0.0 on a horse & got 10 pt in return above his stake. I heard of an officer who said he would lay &pound;200.0.0 to &pound;1.0.0 that we would be back in Australia within six months. I hope he wins all the money, but am thinking seriously of looking him up to have a bet with him. \n\nWonder will I get any letters tomorrow. I think that there must be a mail in. I wish they would shift us some where for a change I am getting fed up with this place & so are the rest of the boys, they are getting restless & irritable & one hears squabbles & bits of fights about – It was the same this time last year after we had been in Egypt for a while\n","39":"\n\nMaadi\n\nThis morning we did troop drill, I think it is to get us ready for a competition they are going to have to find the best troop in the Brigade. Some how I don’t think A of B of the 6th has much chance – We were on putting horse lines down this afternoon – It does not look much like going away when they are arranging these competitions & going in for this training. I wonder where we will all end up. Harold shouted Joe Woods, Jackson (the butcher who sports us a little bakseech meat some times) & myself to the pictures to night & after-wards we went up to the Soldiers Café & had some thing to eat. I am eating like a horse lately. Poor old Johno was wild this evening. We had come in from evening stables & Johno had received a letter which he started to read before going to tea, when in came a chap who wanted to a tooth pulled, Johno put the letter away gave a growl about it & got to work & when he had it out the chappie introduced his cobber who also wanted one out, Johno went crook but pulled the tooth for him. Sergeant Shannon & Crouch came back to day, they have had a good long spell in England. Stanton is still there & I hope he stays as I have got his mare.\n","40":"\n\nMaadi\n\nIt has been raining to day. Just a mizzle but unpleasant. This morning Capt Ryrie took the squadron off parade for drill, he formed us into \"Line of troop Collum\" when we got out on the desert & then gave \"Trot\" then Gallop. I wonder what Roley Weston would have said, had he been with us. He used to call the Capt \"Don’t over do it Harold\" We had quite a decent morning & I enjoyed it. This after noon we did not go out as it was wet but they dug us up out of our tents & took us into the stables & stood us there for an hour, just to keep us from going to sleep in the tents – I think I got 4 letters to day one was from Mr Gibbons – I was pleased to hear from him\n","41":"\n\nMaadi\n\nIt was fine to day after the rain, the air has a bit of nip about it. It was the usual mounted parade this morning but this evening we did some dismounted work, Gaurds & pickquets was the order of the day but we did not get much instruction – The Brigade Major came along & gave us a bit of a lecture & he tried to be funny & managed to keep us laughing most of the time he was speaking to us, I think though that he might just as well held his peace for all the benefit we got from his remarks – Mc our troop leader was glad when he finished up to for the major addressed himself to Mac all the time, & Mac was wondering whether he was joking or meant it half the time. \n\nMullins came down this evening & we took a walk around Maadi. What a quiet little place it is. Pretty in its way with its long avenues of trees & its houses with their nice fresh gardens about them. A Squadron has challenged B sq to a game of foot ball. I went out & had a bit of a run with them this evening. Bill says we will get well slopped\n","42":"\n\nMaadi\n\nPicquet to night but I did not have a bad time as I did not follow out orders to the letter indeed when I suggested to Joe Woods that he & I would work together as mates on the same shift he told me point blank that if we were to work as mates that we would split the shift unless on the first. Any way we happened to draw first shift, 8.30 to 12.0. The Orderly Officer came around at 10.30 so Joe & I tossed to see who would go to bed & who would stay on until 12.0 & I won.\n","43":"\n\nMaadi\n\nI feel a bit sore this evening on account of playing in a scratch match a game of footy with A squadron. A beat us bad but we went not so bad considering that we had not played together before. This morning instead of being dismissed after stables a usual, we were marched around to our tents & made to undo our blankets & fold them up all in the same way, it did make me feel like as if I could chew the ear foo the man responsible for the order, it does not look any better & takes 10 minutes longer to do, & thats a valuable 10 minutes out of the ½ hour before stables in the morning. Besides I used to roll my\n","44":"\n\nMaadi\n\nI had to do day stables to day or rather for half the day, it is not a bad job but I dont know that a chap with a stripe should be shoved on it, by rights. We had to shift into the next row of tents which C squadron occupied. There are more rumours afloat about our leaving shortly but I expect they are up to putty.\n","45":"\n\nMaadi\n\nI sealed church this morning, cracked sick, was in the unfortunate position of not having the cash to buy Boot polish & did not like to go dirty or be a hum on my mates so stayed & did some writing in stead. Played a game of footer this afternoon & was on the losing side. to night I met perkie & we took a bit of a walk & had a decent chat. Got a letter from Bert this morning, he say he will be in Cairo next Sunday so there is a prospect of me seeing him. I hope I do, perkie is going to try & get leave also.\n","46":"\n\nMaadi\n\nWell its dead jammy in a way I just fixed up an appointment with Bert for next Sunday & to- day is alive with rumours of a shift away from here this week. How ever they say we are going to Ismalia & that is where Bert is stationed so if we go on Thursday there is a possibility that I will see him before Sunday. There is certainly some move on for the troop competition is right off & it was to begin to day. This afternoon we did nothing only got our horses out & the Sergeants were making inquiries as to what equipment we still needed. To night Joe Woods shouted eight of us to the pictures, we were right in it\n","47":"\n\nMaadi\n\nThe squadron of the 12th Reg left here this morning The regiment which was Split up into reinforcements when it went to Gallipoli is now going to reform Their officers looked very swanky this morning clobbered up & with the black plumes in their hats It looks right for us to leave on Thursday we are all getting fixed up for departure They paid this afternoon so a number of the boys went into Cairo to have Their last fling before going away. I took the precaution of making up my bed outside as some of them are sure to come back well tanked up. Two up, Cards, & Crown & Anchor are being well patronised on every hand, It is marvellous the difference in the Mess room for a while after pay day. This last week it has been so crowded that one could hardly ever get a seat nor always get quite enough to eat, but to night the mess room was not half full & there was scram to burn\n","48":"\n\nMaadi\n\nNot much doing today, we packed our Saddles this morning & went out & stood for an age out in the sun until both men & horses were full to the neck of it. This afternoon we simply packed up our kit bags and got our gear together for the final move off. Jim Mullings & Haslem came around to see me this evening. Haslem looks anything but well He has had a rough spin & has been in hospital with pleuresy & pneumonia. They both went to the fight at the stadium but I declined as I did not feel much like watching the contest. Im afraid that my seeing Bert will have to be put off to a very hazy future Its stiff luck just when we had an appointment fixed up\n","49":"\n\nMaadi\n\nWe got orders to be ready to move off at 9.0 to night & all day we have been getting fixed up. Several of the boys are tanked & some were betting odds that some would be left \n\nbehind. Later we got word that we are not to leave until 12.00 Guess we will be tired out to morrow when we get to our destination. Serapeum is the name of the place we are going to \n","50":"\n\nTrain near Suez Canal\n\nB Squadron moved off at 12.0 last night & we had a nice quiet ride into Cairo. The saddles were left on the horses & they were put in the trucks, 10 in each, it did not take long to get them in. Went up a little way from the station & got a cup of Coacco it was OK. The train left Cairo about 5.0 am & we are still travelling at about 10.30, we are near Ismalia – had a sight of some gunboats on the canal a moment ago.\n\nSerapeum Later\n\nThe train pulled in to the station at about 10.30 & it was all bustle getting the horses off & the kit bags & gear out. We moved to about ½ mile from the station & linked horses & shouted for something to eat but we had to leave it & go & put down the horse lines – we got the horses on the lines before tea , it was biscuits & bully again\n","51":"\n\nSerapeum\n\nWe had to fool about the horse lines again & had to shift the tents 1 foot one way & two feet the other way. I tried very hard to get leave to go up to see Bert but after seeing Capt Anderson, the Adjutant, & Capt White about three times each, I was told that no leave was to be given. Our troop was on picquet but they did not have a bad go.\n","52":"\n\nSerapeum\n\nThis morning we had to pull up the horse lines & fix them again it was a lot of work. I hope theyare OK this time. It is a bad place for water. the drinking water is brought here by train & we get one water bottle full each morning. For washing we have to depend on well water as in the water in the channel is said to cause sores & \"Nile fever\" if it is used. It is an awful dusty & windy day. All ones food gets covered with sand. This afternoon A troop rode over\n\nto the Suez canal for a swim, a number of us swam right across, so have been on both Africa & Asia to day Stable picquet to night, its not much of a job, have to go on at 3.0 in the morning\n","53":"\n\nSerapeum\n\nThis morning we were surprised to be on parade at 9.30 but owing to there being no water for our water bottles we were kept a bit late. We went about a mile from camp & drilled all morning in the sand \n","54":"\n\nSerapeum\n\nCapt Ryrie took the Sqd out to day & we had a real easy time, we did practically no drill this morning & this after noon we simply took our horses out & let them roll in the sand – Crouch took a couple of photos of me & my mare. I hope they come out alright\n","55":"\n\nSerapeum\n\nWe cleaned about six inches of sand out of the tent\n\n & got down to a more solid bottom, we will have to buy some mats for it. Sand & dust gets in everything This afternoon we rode out to the canal & had a bonza swim. its fine to ride out in a free & easy way.\n","56":"\n\nSerapeum\n\nThis is the worst place I have ever been in to do any writing, the tent is always crowded & it is so windy & dusty that it is almost impossible to write in it. To night I am writing down at the canteen it seems a bit quieter here & there is a good light & a seat. These last two days have been particularly windy & the sand gets into every thing. I don’t know how much of it we must eat with our food. We have taken our dinner out these last few days & indeed it is much better than having it in the tents as we dismount for dinner where there is a bit of a break in the desert & it is not so bad.\n","57":"\n\nSerapeum\n\nThere was 35 men on Fatigue from the Squadron \nthis morn\n to day so that made us short handed we had to do two trips to water the horses. This evening we went down to the shops & imsheed in some & mats for the tent so we were a bit more comfortable To day has been another windy day & Im afraid that Ive eaten as much sand as food.\n","58":"\n\nSunday\n\nThis morning we all had to go to Church Parade, General Birdwood was there & he had a look at us. There are rumours afloat again that we are to go to France & that they are going to form up a division of Light Horse This after noon we rode across to the canal & had good swim, its a treat.\n","59":"\n\nSerapeum\n\nIt has been hot to day but thank goodness the wind has dropped so one can go about in comfort without having one’s eyes filled up with sand. I heard Joe Woods say the other night to dig for him at the stone out side the tent if he could not be found in the morning. I did not go out on parade to day, was on forage fatigue instead & I had a very easy day of it After dinner I managed to wash out a couple of shirts & a towel, its hard to get any washing done in this place The chaps spend nearly every night playing bridge, they take up the whole tent & a chap cannot make his bed down or any thing Heard rumours that we would be going to France shortly, I think its all moonshine\n","60":"\n\nSerapeum\n\nAs most of the Squadron was on Fatigue we did not go out to drill but Lieut Smith or someone got some harebrained scheme about having saddles on rails so they got us to rig up some iron rails to put the saddles on, One would think we were here for the rest of the year. To night there is the sound of great cheering coming from where the canteens are; from reports that are coming in I believe that the niggers who are running these canteens are having a really torrid time & the canteens are being pulled down. I am on in charge of the stable picquet to night, not a bad job, the horses are very quiet on it\n","61":"\n","62":"\n\nSuez Canal, Serapeum\n\nLast night A troop was on Inlying picquet , nothing to do but its not much chop having to keep ones gear on all night & expecting to be called out every minute, however I slept fairly well. This morning when we got up at 6.0, Beuzeville, Flanigan & I were told to get kitted up & 24 hrs rations & our haversacks & water bottles for we were to go on as body guard to the General. Lieut McKenzie said that we were on a good wicket & would likely be away for three or four days & go to Ismalia etc We had to go mounted & men were sent with us to take the horses back. \n\nHowever we found that we had to go over the Pontoon Bridge on the canal & report there for ordinary guard & our disgust may well be imagined when we were told off for our respective posts. There were nine on the Guard under Seg Collins & we started with 3 posts which were reduced to 2 posts later & I took place as Corporal. One thing it is quiet & we have a house to doss in, a room to each relief The buildings we are guarding are to be the Headquarters of the New Zealand & Australian Mounted Division which is being formed\n","63":"\n\nSerapeum\n\nWe got paid when we came in from Guard on Sat morning & I also received some letters. During the morning Mr Ryrie came in & handed me my pass to go to Ismalia on the following day. Next morning Hickey Crouch & I went down & caught the 9.3 tram from Ismalia, Crouch scaled up without a pass, he & Hick went up to Tel.el.Kebir – Ismalia struck me as being rather a pretty place but I did not have time to look around it as I had get out to where Bert was camped. I thought he was at Ferry Post but I found out that they had shifted to Moascar & I got out there at about 12 o’clock He looks well enough & I was pleased to see him we had a long yarn, he could not get leave to come into town so I stayed in camp until about 8 oclock with him. I was lucky to see him as he & his company are leaving to day & they think that they are going to France but I fancy that they will be bound elsewhere somehow To day I have done practically nothing - took charge of the forage fatigue this morning. To night some of the 5th &","64":" Regts went out on a patrol I expect we will be on it soon\n","65":"\n\nSerapeum\n","66":" night we had to go out on a patrol. It was hurry up at 5.30, we camped a mile out & Bill Ross took charge of the patrol of three men on the Left flank on the Rway line. Next morning we got in about 10.30, it was red hot & one did not feel much inclined to exert oneself much - I had to go on picquet to make it worse & was sleepy on it. Wish we would get out of this place some where where something is doing\n","67":"\n\nSerapeum\n\nWent out on parade as usual this morning & took mid-day meal with us. We had a good swim before dinner, did no drill at all. When we got back heard that we had to leave to morrow; later we were told to pack our kit bags & that C squadron & A & B troops from B were to move off at 9 o’clock in the morning\n","68":"\n\nGabul Mirium\n\nIt was late when we moved off & there was some speculation as to our destination when we began to move upwards along the bank of the freshwater canal, we did not go very far though before we boore over to the right to the Suez Canal; it was heavy going through the sand for the horses, they had a big load on, all our blankets had to be strapped on the saddles. \n\nWe halted behind some trees growing on the side of a small fresh water channel near the Suez Canal & after a while started to go down our horse lines. before we finished however some of us were told to go to a post some distance away Perce said we could ride ½ a mile hand over the horses then would have to do 5 mls boot & that made us think a bit & after we had ridden over a mile I was wondering if the next 5 miles were on the same scale as the first half? About two miles away we came to a neck of water, off the Suez C & here we dismounted & had to punt across 6 at a time. It was blowing a treat. Another ¼ mile & we were at our post. Perce & I were on duty 3 hours on & 3 off all night, it was cold & a bit wet\n","69":"\n\nGabul Mirium\n\nWe put up three tents yesterday & we had a gay go in the wind Nothing to do here all day but we have to patrol the Canal at night Johno & Cameron are on duty on the post Perce & I were on last night. We are having quite a good time Cookie took on the cook house & did great work to day. Porridge, Bacon & steak for Breakfast Curry & rice at dinner & steak & tomatoes for tea. Bread is a bit light & we would have had plenty only the bally camel when coming across the crossing took it into his head to sit down & think & he could not be induced to shift for a while, so our bread got wet; \n\nThere are 21 of us here all told. Mr McKenzie is in charge. There was also a nigger in charge of two camels but he stayed over the other side this evening & Cookie is a bit anxious as to how we will get to morrow provisions. The wind has dropped thank goodness I hope its warm to morrow, its too hanged cold to chance a swim so far.\n","70":"\n\nGabul Mirium\n\nEver since we left Serapeum there has been a stiff cold wind blowing, it makes the days rather unpleasant One thing on this post one can see something of the boats passing backwards & forwards along the Canal, last night a big P & O boat passed on its way to Australia. We are having a rosy time of it here, do nothing all day but eat & sleep or read, there is a good stock of old magazines on hand. \n\nCookie is the only one who does any graft he busies him self at the cook house all day. Porridge, bacon & eggs this morning, Meat & potatoes followed by preserved Pine apple & bread & jam for dinner & now we are wondering what is on the menu for tea The trouble is that they will not leave us on this post long, a week will just about see us out I think - Johno suggested that we should use ball ammunition if they come out to relieve us Each of us put 15 p.t into a mess account & a nigger comes out with the stuff on a donkey every day from Ismalia. It is fine to be away from the horses for a little while\n","71":"\n\nGabul Mirium\n\nI had a quick shift last night but was dead sleepy on it. To day was a bit decent so had a dip & it was good, I lay in the sand for an hour or so sun bathing. Last night that blamed camel lay down in the water again & got the bread wet; he was called nasty names & to night we watched him anxiously as he came across the water but this time he thought better of it. Cookie takes his rifle with him to the cook house saying you never know when a Turk might blaze at one from across the canal. Last night Johno called to him but Cookie never took any notice. – half an hour later Cookie rolled in when Johno was about asleep & yells \"What do you want\". It got Johno to be answered half an hour after wards. To day we heard some one running out side the tent. Johno yelled \"Go it Cookie\" Cookie said \"How do you know its me\" Johno reckoned he would know his in a thousand.\n","72":"\n\nGabul Mirium\n\nI hear Perce hunting Lamb out of his place where he is trying to have forty winks. Lamb is expressing himself with strength but it is no go he has to make room, Perce wants room to join in a game of cards Cameron & some of us put it to the nigger to bring us some lollies he brought us a small box & charged us 7\/- for it. They were the most expensive Ive ever had the pleasure of tasting The nig joined in a game of cards & won about 35 p.t. off them then floated – he is a shrewed cuss that nig. He comes out every day with a couple of donks & brings things to sell from Ismalia\n","73":"\n\nGabul Mirium\n\nYesterday I had a real good day in the canal swimming & during the morning we spent the time racing & jumping & the result is I am a bit stiff to day. Yesterday evening the General came out to inspect us, must have been satisfied as he remarked as he went away \"A fine lot of men\" Got a bit of a cold last night & have been content to lay down & read all day – had a swim this evening which freshened me up a bit.\n\nFlan has been telling us about himself. He was recalling the time when he was bound over to the dentristry so Johno questioned him to find out how he had advanced in the profession. Flan said I helped about the stables for a bit then I got inside & used to the door cleaning windows etc; Johno & the rest of us were knocked bandy.\n","74":"\n\nGabul Mirium\n\nThe Doctor came out this morning & told us that he thought we would be relieved to morrow so a general downcastedness is upon us. We have been having a happy go lucky life here not a care & little duty. During the day we cast aside clothes for the greatest party of the day, a hat & a towel being considered ample attire when a boat is passing by, it is only when the signallers give us the office that the Major, Col or the General that there is a general putting on of clobber. I wonder what they would think if we presented arms dressed in towels & hats – It livens one up to see the boats passing occasionally & I don’t know how we are going to carry all, our tobacco & cigarettes back. Johno is telling me about Flanagan & is amused about his phrases \"Let Gone bye be Gone bye\" says Flan. Flanagan has also been a butcher we have learned he carried the basket round for a few months.\n","75":"\n\nSerapeum\n\nWell its been a queer sort of day; This morning a message came telling us that we would be relieved during the morning & to have our dinner over by 11 oclock. We thought that some out of C squadron would relieve us but we found that it was infantry. There is surely something in the wind when they send Infantry to relieve us. We got away after dinner our horses were brought to us & I was surprised when got to the \"Oaks\" to see all the horse lines up & every thing ready to shift. We came straight back to the old camp all of us. Tom was telling us about some of the boats that passed. There was one that was passing & no bakseech coming to light so one chap snapped out \"Is Johnney Walker on board\" \" Yes, was the reply\" Then chuck the B--- over board\" was snapped back & Johnney was tossed over-board.\n","76":"\n\nSerapeum\n\nLast night we bivouaced out in the desert, (the whole Regt) A & D troops were the \"supports\" fortunately so the duty was not heavy, Some of the other troops who went out on \"out posts\" got bushed & they came back straggling in at all hours. I heard that some of the Infantry have been on a bit of a march & they run out of water & some of the lad fell out & there were two or three deaths. This morning when we got back it was red hot & we thought that we would not have to go out on parade however they took us out & we are having dinner now Under the oak trees on the bank of Suez Canal - I received a letter from Nanny Brown, Mum’s cousin She said that there is a parcel coming - I hope it soon arrives\n","77":"\n\nMoascar\n\nIt was an awful messed up morning, We had got our kit bags and Tents packed up yesterday & everything should have gone like clockwork but they fooled us about that way that in stead of moving off at 12.0 it was after 12.30 when we got away. I was glad to see the last of Serapeum it was a dismal hole, the N.Z. band played us out of camp. I noticed that a lot of artillery had just arrived there, it seems funny that one lot should move out & another move in. We rattled along in great style & nearing Ismalia the way was very pretty; through cultivation & trees. out side Ismalia there were hundreds of NZ troops in the water bathing, They looked fine. We got fixed up for the night about dark - Then Joe Woods Harold & I went to the pictures. It seemed quite a night out\n","78":"\n\nSelhai \n\nThis morning they turned us out at three oclock, & it was all bustle. When watering horses we struck trouble & were delayed but got away shortly after six. It was a long dreary ride across the desert to this place about 25 miles but into a fine camp here. We have the lines down & the tents up & already are more comfortable than at Serapeum. We have mess sheds here which are a boon after the sand. I felt a new man after a good \n\n& a shave\n\nTom was telling me how he was up before the Major this morning, he came along with the baggage on the train & it appears that he was doing a galloping stunt on a donk in the village here & rode express into a café where the Brigade Major was having some eggs etc. the donc propped & slid along the floor knocking the B.M’s table over. Tom was told to be more careful in future. I fancy the young beggar has been having a good time. hes wearing a vivid red handkerchief round his neck & I heard him tell Johno that he does not know how it came to be in his possession\n","79":"\n\nSelhai \n\nIt was a day of fixing up to day, we got our lines tidied & levelled off & now everything looks spick & span, our tent also is more comfortable we scraped off all the loose sand & damped it. The tucker is a bit light bully & a little bread it will be alright to morrow though, I expect. Its far more comfortable in the mess sheds though, we have a shed to each squadron so there are four decent sized tables to each troop & that is not too bad. There is a good deal of bother about the gear on the lines, A squadron declares that B & C are pinching all its stuff while B swears that A & C have got down on it for its own – then C is complaining that B & A are at its gear so that things are sort of a bit mixed – We are all wondering what is next. Many rumours are afloat, one being that all the Mounted Div is to come down here. There is a big mail in I believe, hope its true.\n\n7 April, 1916\n\nSelhai \n\nThere is a horrible rumour afloat to the effect the we are on the camp site of the 1st LH Bde, this after we have got nice & comfortable, our tent right up against the mess room & fixed up with rifle stand, wash stand & a place for our bandoliers & belts, its too much to say nothing of the work we did to get our horse lines in order – if the rumour is true, wont there just be a roar from the 2nd LHB ? it will surely cause a heat wave. They are deucedly long winded with their pay days recently. I wish they would pay, its rotten to be broke. Im on picquet to night & have drawn","80":" shift, will have to turn out at three in the morning\n","81":"\n\nSalhia\n\nHave had a bosker day, I was woke up at a quarter to six to go on fatigue & felt like going crook as its no joke to have to lump barley & corn on an empty stomach, however it was a soft job the rest of the day & I got time to have a good bath . I have heard that they have blocked us from using the water from the tanks for washing so I don’t know how we are going to get on now. I think they must be mad. I received a good mail yesterday & was glad to get the letters.\n","82":"\n\nSalhia\n\nI received a letter from Bert last night, he is in Ypres in France lucky beggar, he says its cold though. We had a beautiful two days wind storm through the week. I slept out side & could hear the boys tapping in the tent pegs all night. Our tent collapsed & fell across Godber, he only murmured some thing befitting the occasion & went to sleep again. We got paid to day thank goodness. Ive been broke for a long time.\n","83":"\n\nSalhia\n\nIts been a splendid day but hot. It makes one wonder how one is going to get on when the summer comes on. This morning I had to go as escort with Johno & to Orderly Room, I didn’t like the job much, they both did their stripes. It was a bit of bad luck for them. We are on in-lying picquet to night & Im tipping Ill be on stable to morrow night, then on the next night we are to go out & bivouac, that will be three nights on duty.\n","84":"\n\nSalhia\n\nWe went out & bivouaced last night & I struck horse picquet. We did a bit better than the other two troops the last time B Sqd were out at Serapeum they got lost in the desert & a lot did not get back until morning. We had to go out as covering party & came in to our lines at dusk.\n","85":"\n\nSalhia\n\nI went accross to the New Zealanders to have a kick with them at Football – Young Foster who is in their lot & whom I knew on the tramway was over there, he was packing his kit bag – he & I listened to the band for a while, then went for a walk. This morning we got orders to have out kit bags in by 4 oclock this afternoon. We are to move off shortly & by the talk we are to see a little active Service again. We take our horses with us this time.\n","86":"\n\nHill 70 Kantara\n\nWe packed up & got a move on about 12 noon & got down near Kantara at dark - here we had tea & moved off again at 9.30 pm crossed the Suez Canal & went along a good road to a camp 6 or 7 miles out – it was 2 oclock when we crawled into blankets spurs & all, dead beat.\n","87":"\n\nAnzac Sidings\n\nWe were up at 5.0 am & formed a guard for Ammunition as we advanced along the line to the Rail Head, near there we met with what was left of the Gloueschester Yeomanry – The rest had been captured by the Turks yesterday morning. We had to return & camp at the place with them as there was no water further on. None of the horses had a drink except the officers, I took my mare down & said she was an officers horse so she was dead lucky. I had a quart of tea but was not able to fill my bottle after.\n","88":"\n\nDesert\n\nUp at 3’0 am this morning & had to saddle up right away, no water for horses or men & gosh Im thirsty. We moved off about 5.0 & A troop formed the Advance Guard. There has been nothing doing so far, we are about 5 miles out in the desert from our camp & have been halted for some time. They don’t seem to know what to do, we are posted out & await any orders. Oh for a pot of Tooheys\n\nWe were relieved & came in about 3 oclock to the wells & gave our horses a drink. I thought they would never stop drinking, I drank about ½ a gallon myself. The water is a bit brackish but it went down alright. Our section dined on Tinned Sausages & tongue which I found in a deserted camp, so we did not do so bad. We saddled up again & came over a little way & put down our horse lines. I had to go on picquet worse luck\n","89":"\n\nRomania \n\nWe had the usual stand to at 4.30 this morning, but I was up a 2.0 on picquet & feel a bit dozy on it. We have watered the horses & are having a bit of a blow, there is only tibbin for our neddies & not too much but some one is going away for grain. We had a laugh at too chaps coming in off out post this morning, they had two bints with them – All niggers are detained at the camp – After being on fatigue cleaning up the tents that the Tommies vacated I had some dinner then Joe Wood & I went down & had a wash at the wells by throwing buckets of water over one another – The water is not nice to drink but better than nothing. Jack Cheater our Q.M.S. has been out foraging & came in with a load of tinned stuff – evidently these Tommy Officers lived high. Some of the boys found a god lot of whisky, not I however.\n","90":"\n\nKatia\n\nOn patrol 6 miles out from our camp 30 miles from Canal – We were on out post last night & came in about 5.0 am & saddled up & were out as a patrol again at 6.0 am. We saw nothing until we got to a little village called Quazia or Katia & on the hill past this we saw a lot of dead Tommies & Turks, they were stripped of most of their clothes & look a horrible sight.\n\nwe are at present posted on the hill in front as out-post while the main body bury the poor chaps. Behind the little grass bumps on the hill here are numbers of Turkish emptied shells & clips. The insects are so bad my mare wont give me a moments rest. There were about 70 dead buried, mostly Tommies. They must have put up a great fight against big odds. The horse lines were a distressing sight. The horses were all lying dead, tied up to the lines. We watered our horses at a big well & came in to camp arriving there hungary about sundown. We were pleased to see that there was plenty of food for us when we got in.\n","91":"\n\nWhen we arrived last night in camp Jack Cheater our Q.M.S. had water ready for our quart & a good stew, we also got issued with two loaves of bread & jam per section. it was great, the worst of this life a chap works up such a great apatite on it, lately there has only been a limited supply of bully & biscuits to appease same with. This morning we got some bacon & steak so did not do badly, we cooked it our selves. A squadron captured some Bedouins a couple of wounded Turks were also brought in. One of these Turks used to get food & water for him self & a couple of wounded Tommies & the Bedouins used to take it from them. One of them tried to strangle a wounded Tommy with a piece of Telephone wire but was unsuccessful. There was a wounded Tommy brought in yesterday. He had been out there for four or five days, What a time he must have had\n","92":"\n\nRomania \n\nWe fooled away the morning Took a vote that we would despence with the cooks we thought we would get more if we did our own cooking Don’t know how it will work. After dinner we had to go out as Advance guard again to Katia with General Ryrie & other officers, What a tale one can read by the tracks in the sand One place where some one had pulled himself along on his stomach & the mark of his fingers as he swung his hand forward for another grip One can imagine how long & painful was the journey Then behind each little mound some foot prints, the place where some one had been lying, & some empty cartridges with Arabic characters on them. I was starving when we got back to camp at dark & was glad to find that Harold had some meat cooked – Went on stable picquet later\n","93":"\n\nRomania \n\nWe had to shift our lines down into the low ground this morning, it was a good idea but every officer wanted the lines put his own way & the consequence was that we had to shift them several times. they did not have them down when I left camp. I had to come out to No 3 observation post with four men, I was glad to get out of the way. It is not much chop here though on this hill the sand blows continually. The other day the crest of the hill rose 4 feet owing to the sand which was blown there. One can get a glimpse of the old Medditereanan from the hill\n","94":"\n\nRomania \n\nOnce more the horse lines are fixed up & we have made a mi-mi to accommodate our section of four, it serves as a shelter from the sun during the day but at night it is of no use to us as we are usually on out post & when not on duty the troop have to sleep all together in the open Every one stands-to at 4 o,clock & there are \"no lights\" while it is dark consequently there is no smoking but of course when a mob of men have to get up at 4.0 & stand about until daylight the temptation to have a draw is pretty great. Pearce was Orderly officer the other morning he has a low irritating voice, he said \"when I give an order I expect it to be carried out\" & noticing a pretty healthy smell of tobacco he told old Bill to see the boys put their fags out. Bill had been indulging discreetly himself & when Pearce accosted him, he had to jam the lighted cigarette into his pocket & hold it there, & it would’nt go out so Bill was pretty red in the face against he got down to the end of the line with the strain of keeping back a flow of strong Australian language.\n","95":"\n\nRomanie \n\nNot much doing this few days, been on out post or picquet each night & one day went out on patrol. The tucker is more or less good, for a couple of days we got bully & hard biscuits but last night we got some bread, it was real good stuff. Sams said the man who baked it ought to get the D.C.M. It was thundering hot yesterday but to day there is a lovely cool breeze blowing, Last night I received a parcel from Madge, it was first rate, I had just run out of cigarettes & the chocolates were quite a luxery. Bill got a box of wafers fancy the old sport getting that fancy stuff. it did not last long\n","96":"\n\nKatia\n\nWe left camp to day at 1.30 too feed horse & man, gosh it was hot too. We camped at Katia & every one started to boil quarts for tea after watering horses. I had just taken one sip of boiling hot tea when we got the order to saddle up, so there was a cramming of bully beef & bread & a gulping of hot tea for 30 sec & we shoved on the old saddles & off once more, We had to go on out post until the two regiments were ready to move off The sand flies nearly ate me & my horse\n","97":"\n\nBir el ahb \n\nWe joined up with the troops as they moved away towards the East about eight thirty & kept going for several miles & then formed up at a place called Oghratina here we fed up & re filled our water bottles & grabbed what sleep we could while holding our horses. About 4.30 this morning we started again & this time we thought we would see some stouch but when we got to this God forsaken hole the Turks has floated. A Squadron saw the last of them. Here we are waiting for whats next. I suppose it will be return. Bill Ross is out, his hat off & the sun powering down on him snoring a treat. reported all clear. \n","98":"\n\nRomane \n\nWe watered our horses at a well at Bir el ahb such a scramble it was, our horses were mad for a drink, I bustled all I could & scored 2½ buckets each for Sams & mine & I think they were much better off than most. We stopped to fill our water bottles & have a snack of bully & biscuit at Oggeratina & pushed on to Katia where we gave our horses another bucket or two of water then we made into camp arriving a bit after sun down, horses & man dead beat. I had to go on picquet & was pleased I did not draw first shift so I could get a couple of hours sleep. We came back along a main caravan route could see traces of the turks along the way To-day we saddled up at 1.0 & went across to report to the 5 Reg (24 of us) we met their patrol about 6 miles out. The sand hill are numerous & we had several stiff climbs. We dismounted usually & led our horses up.\n","99":"\n\nWe left Romanai at about 2.0 oclock one reg of New Zealanders & the","100":" & proceeded to Katia; here we watered & boiled our quarts & had a good tea - Joe woods had boiled a piece of bacon & it went well - a bit after six we saddled & moved off again, it was quite pleasant riding along in the cool moon light night After about 5 or 6 miles we halted again & re filled our water bottles & fed up & did not remove our saddles – later we took our horses around to a well & gave them a drink, when we came back the section opened some bully & we had a snack then lay down with the reins hooked over our arms & tried to get some sleep – the horses were very quiet & I was awakened only too or three times with the horses tramping up against my shin bones, then there would be a little language & I would go off to sleep again\n","101":"\n\nAt ten to three we had to get up & tighten girths & by three we were on the road again – A troop were advance gaurd & later on B came up on our left. It was terrible country we passed through all enormous sand hills In places the horses would bog in the soft sand to their knees. We rode out & I lost count of time & every now & then I used to have a pull at the boiling water bottle The day was terrible a hot easterly blowing, learned that it was 120&degrees; in the shade at camp. We passed through a newly deserted enemy camp, some of them were such as they emshied. We did not get a shot but the New Zs had a couple of horses shot & captured 30 Bedouins These did not come back & they did not tell what happened to them. We halted past this old camp, B & C troop on the left were lucky they came on some wells & troughs so were able to give their horses a drink. My mare was panting & showed signs of fatigue After a bout an hour we turned & came back I finished up the water to celebrate the occasion, After a long while we came on a patch of palms where the\n","102":"\n\nmain body was camped A Tp was rear guard to this spot. I got a drop of stinking water here & washed my parched mouth with it After about an hour C & B moved off & I got in with the first of them Some officers & men started to throw in the sponge here. We got to the palms where we started that morning & I went on thinking I would get a for the mare but the water was so low that a man had to get in the well & fill the bucket with a qt pot - I got a drink when I got there & I staggered as I got up from drinking - then after a lot of bustle got my bucket full & I was rushed as soon as I got it, I handed it around to the famishing chaps until there was only a drop left then had a drink & half filled my bottle but I gave this to my section mates & Perce. Harold went out to it here & many others also. about 36 were brought in by the Ambulance. We started off for Katia about 4 miles, it seemed a hundred; J Woods horse knocked up & a lot of others; My mare was wobbly & panting but the plucky little beggar kept going. I got a bit feverish & was about all in when at last we sighted the well at Katia – here I drank about a gallon & a half & it’s a wonder it did not turn me up – Les Godber boiled some quarts &\n\nMay, 1916\n\nlater I had some tea but had not eaten any thing since night before – the mare drank so much that she looked like a tub – Capt Ryrie went down to it & looked bad – we gave him some tea & he went back with the ambulance. At six we started for camp & didn’t feel too bad considering We gave the horses some more water & fed up, they knew they were home & looked contented - Some of the chaps who had stayed in camp made tea for us & it was just great - I had some bread & jam & later went down & had a bath by emptying my buckets of water over my self & didn’t I sleep\n","103":" \n\nWe saddled up at 8.0 am & came out to some palms & hid our nags up in the shade, its burning hot but there is plenty water thank goodness, I just got a letter from Mum & Joe Woods got his long looked for parcel, Had a bit of an argument with Stevens. Harold is better this morning – he got in late last night so did Joe Bill & Perce & several others. Weve lost no horses as yet\n","104":"\n\nRomanai \n\nWe have been having a quiet time of it since we arrived back from the stunt on Tuesday. Each day we saddled up in the morning at about eight oclock & came over & tied our horses up in the shade of the palms. It is a beautiful day to day very different from Tuesday - In a tent at the Field Amb it was 127&degrees; & in the Brigs tent it was 123 – I would like to know what it was out in the desert where we were. The","105":" LH arrived here yesterday & I saw Hartnett & Rutherford had a long yarn with them last night\n","106":"\n\nRomanai \n\nWe went out to the sea & had a swim, it was near the old Roman sea port – seemed a fairly extensive city built - it was all in ruins, mostly buried. I found a few old Roman coins not much good but quite curios to me. My mare & I had a good time in the breakers only she was frightened of them a bit – I got a letter from Bert to night but none from home. We are going out for three days to morrow, hope it will be a better stunt than our last one. \n","107":"\n\nKatia 11.0 am\n\nWe saddled up & moved off at 7.0 this morning – it was the usual old bustle but we are getting used that now. Joe Woods did not come with us this time Harold went with the Signalers who are short of men. We came on here to Katia & watered our horses & have had an early meal as we might have to go out on Out post any minute. I hear that we move of from here at 7 or 8 this evening it will be a bit better travelling at night. There is a nice breeze blowing & it is nice & cool in the shade of the palms.\n","108":"\n\nKantara\n\nAt Stand to was told to be ready to leave at 5.30 for Rail Head & to go & get some stuff for the Squadron at Kantara – I had the requisitions in already - & I went for two troops each. Just missed the train but \"jumped the rattler\" at 9.0 in spite of being told we could not go by that train Got in & bought the stuff but could not get out away so have to stay the night \n","109":"\n\nKantara\n\nStayed alnight at YMCA – No blankets, its not much of a place at all though every one is very good, Its hard to get water & theres no where to go to get a cup of tea, I felt that dirty when I got up, so I went down to the canal & had a swim & felt much refreshed then I bought some sausages & fruit & had breakfast – I was told that the Regiment had left Romanai this morning at 3 am so it was no use putting the stuff on the train until we knew of their destination, I went down to Rail head by the 12 noon train returning by the 5.0 pm & brought the bandeliers & Rifles back with me. Arrangements were fixed up for our stuff to be taken to the Reg with a lot of Gift Stuff in charge of Col Woods the Clergyman. The Reg I learned is at hill 70\n","110":"\n\nKantara\n\nThis morning we got our stuff transported & loaded on the small gauge railway which goes near the camp at hill 70. & now are waiting for the engine to come along & take us off. There is a rumour afloat that we are under orders to go to France – I hope its true but doubt it very much.\n","111":"\n\nHill 70\n\nWe got the stuff on the trucks yesterday & had it landed here at dinner time. There was a great dishing out of goods during the afternoon – I was glad when I got it all fixed up, every one seemed pretty well satisfied. Perce left for the School of instruction last night – I hope he gets on alright. I am on guard on some timber & mats, have fixed up a bit of shade & would be fairly comfortable except for the flees whose name is Legion – Asked a Scotsman what he was doing out here, he said \"altering the contour of the desert mate\"\n","112":"\n\nHill 70\n\nYesterday morning I had to get up at 4.0 & go on a fatigue of building stables. The old segeant some how got an idea that I would suit him on the job so for me to be on permanent so I took it on, it’s a change, work 6 hour per day & exempt from other duties. I received a pair of sox sent to me by the Red Cross & also a parcel of cigarettes & chocolate from Madge.\n","113":"\n\nHill 70\n\nThe Colonel got a lot of stuff in Kantara yesterday & last night there was some free beer on but it did not last long. To day we bought some pine apple & milk & stuff so we are living not so bad. We are getting on alright with the stable but are about stuck for timber & nails now. We are getting marmalade every day on rations, & it comes in for some sarcasam Heard one of the boys yell out, when it was \"Section Leaders for rations\" \"Be sure to get marmalade. Yesterday morning there was an areoplane on Romani camp, it dropped near where the machine guns horses were & that where I used to sleep so reckon luck is still sticking to me.\n","114":"\n\nPort Said\n\nI have had a couple of days in this place Received 48 hrs leave on Thursday & will have to catch the 6.30 train back this evening. It is a very dead sort of place. nothing doing at all, but at least I have had a change & it was a pleasure to be able to turn into bed between nice clean sheets & stay there at your own sweet will, This morning I heard that a transport with Australian troops on board was in the harbour so I got a little boat & went accross but saw no one knew then I went around the harbour. We rode into Kantara the other night & I have been wondering if they will bring our horses in for us this evening.\n\nThe trams are characters here; there is only one narrow gauge single line with a series of loops. I tried to get a garry to take me to the native quarter but as that part is out of bounds I had to fall back on the old tram & such a tram it was, I felt ashamed of it. We went out all right, a mule pulled it along & was quiet spry but on the return journey the old mule felt tired & every time the tram stopped there was some kicking & bucking before it started again. We had three changes of mules in a mile.\n","115":"\n\nLast night I was on picquet & did not have a bad time, the horses seem to be very quiet here; Its red hot these days & a man does nothing all day but lay down & swelter in the tent. Tomorrow morning have to get up & go out on a patrol at 5.0 in the morning - I do not mind having a bit of a ride now, the horses are fresh & it’s a change. The nights are beautiful, cool & clear that is the one good thing about Egypt. Yesterday we had to turn out with an Areoplane scare, there was a rush for horses & we could hear the machine guns going for their lives. The plane turned their gun on the Tommies camp. I heard that two men were wounded, but doubt it; At Kantara however a couple of men were killed also some horses & mules This morning again we had to turn out, it’s a beast the lines are the deuce of away from our tents & it’s a long double. I hope there are not \ntoo\n many areo scares its too strenuous\n","116":"\n\nHill 70\n\nEvery day is red hot lately & a chap feels as limp as a well greased girth, but each night is perfect, the nights of Egypt are with out equal, cool bright & fresh. On Tuesday ten of us rode out to report to a patrol of Tommies some 7 or 8 miles out – we boiled our quart pots & had breakfast underneath the palms in a hollow. The trees were loaded with dates, I wished they were ripe. When we got back about 12 oclock, the rest of the squadron horses were all in the new stable, its a treat to see them in the shade. Tom has just come back from his leave in port Said he had a good time, was amused at the kids who were prepared to toss whether he should pay 3d or 6d for cleaning his boots On one side as I write they are saying \"Heads are right\" \"ten wanted in the centre\" etc On the other side its \"Three Kings here\" \"Full hand here\" such a place for gambling one never saw\n","117":"\n\nI believe that the very sameness of the weather in Egypt has an effect on a mans nerves as the monotony of the daily routine If there was only a thunder shower once in a while to break this invariable blue sky, hot bright sun shine & even the clear ness of the nights, its the inevitableness of the thing that gets on ones nerves. Bill was down having a little game, I would recognise his voice when ever bet. It was \"Sydney or the bush\" with him as I think at the finish it was Sydney for he was lucky & I notice he is making inquiries concerning leave this morning. I notice that the winners are never fools to gamble - Jack Flanagan has just been telling us about Liverpool where an officer used to take them out, & \"Give them \"destruction’ about trenches. My section is on Stable picquet - to day is not much of a game one has to fool about the lines all day, a good job we have our horses are in the stable, there is some shade that is one thing.\n","118":"\n\nPerce got back from the school last night they had a good time in Cairo & he looks well on it Most of the boys did well at the school also. Joe Woods is going on leave to night he is already contemplating the gorges of sweet melons & oranges etc he is going to have. I wish I was going in to Port Said with him. Rumour says that we are for the desert very shortly & I for one dont feel like going out to out post & thirsty stunts again. About 12 areoplanes flew over the camp here on Sunday - I believe they went out & bombed the Turkish camp at ‘Al c Reaeh’ which they set on fire & played up old Harry generally, but three of the machines were brought down. I have to go in with Joe Woods to night to Kantara as a horse holder.\n","119":"\n\nHill 70\n\nWell I dont think we are long for this place now I think we are for the desert again about Sunday. Tom Sherry & I put in for leave again I wonder will they grant it - the thought of the surf makes a chap love sick for the sea as a soldier leaving his girl at the old \"Loo\" wharf. I had just tied up my mare last night after returning from Kantara when the Squadron had to stand to as word of a cyclone came along but fortunately the wind did not choose to come our way. We had a parade mounted at 6.0 this morning to be inspected by Col Royston who is acting as our Brig in the absence of Gen Ryrie who is going to England on Leave He said he was pleased with the show & congratulated our Col. I suppose it was mostly kidshades Its close tonight\n","120":"\n\nHill 70\n\nI am at present on Brigade gaurd; its a soft job they dont bother us much but its red hot & the wind must be blowing right off Hades itself. We are to move off tomorrow morning at 2.0 am its definite this time & though the thought of going out there has given a sort of unpleasant taste in the mouth every time any one suggested it for the last week or two, now that its a ‘stone moral’ we accept the inevitable with out the slightest qualm – came over & got my blanket & sheets they are to be packed on camels. Joe Wood came home last night he looks cool in his pair of new slacks The water is about boiling in the water bottle makes a fellow feel sick to drink it still --- here’s luck, I must have a drop\n","121":" 24, 1916\n\nEtmaler last night\n\nWhen I got back off gaurd the horses were all taken out of the stables & linked up at the back, the lines & tents all cleaned up & every one had their saddles packed so I got to work & packed mine, had a bath, bought a water bag off a for 6 pt & lay down on the saddle blanket out of the road of the horses & went off to sleep. We were turned out at 1.0 am & moved off at two. It was a beautiful night & it was nice riding along with the cool breeze blowing in one’s face. One always thinks of the Sphinx, Pyramids & veiled women being connected with these nights of Egypt Still silent, mysterious, beautiful & . \n\nThen dawn came gradually & old sol rose up in front of us & very soon we had our coats off, he is a warm chap We arrived at about 8 oclock gave the horses a drink at the well & although the horses were famishing for a drink they turned up their noses at the brackish taste of it. We got our lines down among a few palm trees, some horses being lucky enough to score a shady spot. We are fixed up now again for a while tents & all. Stand to at 3.30 in the morning just the time I can do my best high pressure snoring stunt. Ill likely use some language when they wake me up in the morning. Our present camp is situated about ½ mile west of Romani.\n","122":"\n\nEtmaler\n\nAfter stables this morning I came over to the seventh camp about ten minutes walk, where there is a Y.M.C.A. tent its a fine institution, one can do a bit of writing here its a bit quiet & cooler than the tent.\n\n--- \"An’ square an’ all, no matter ‘ow yeh’ start,\n\nThe commin end of most of us is – Tart\"\n","123":"\n\nEtmaler\n\nWe had to go on out post last night Took our horses out & it seemed a farce as we had to walk as far as we rode - after we dismounted some of the boys were going crook a treat as its pretty heavey walking in the sand with ones gear up. The horses were linked up as a picquet of six was left in charge of them. I took a post with three others & did two hours shift with them. we had to stand to at 3.30. The Brid. came round in the morning. Bill Walford had to make a mull of chanenging as he did not ask for the Pass word but the old Brid did not say any thing. After Breakfast I rode over to the canteen at Rail Head to get some stuff for our tent but could get nothing except tinned fish & some Beans. Draper & I rode across to the Y.M.C.A. thinking we might get a drink there. but they were all laid out with over work there, the Doctor was there to see them when we were there. Met Tommy Ducker & he took us down to where we could get a drink of water & he made us a drink of coaco it went well. I have a night off to night & came over to the Y.M.C.A. at the seventh. The boys are buying cigarettes & things for all they are worth. They have a Phonograph hammering away like a circus band at a country show\n","124":"\n\nEtmaler\n\nI feel real fagged this morning & it as hot as the proverbial \"hobs\". On Tuesday night as I turned in about 9.15 I heard the order come to the Sergeants that the Squadron was to move off in the morning at 4.15, so was some what prepared, the shock was not so great & when I got up in the morning it was to the accompanient of the growls of the other chaps who had just been acquainted with the fact that they had to bustle round & get their saddles fixed up. We went out to Katia & as usual troop was advance gaurd, We halted on the hill East of Katia which was the scene of the scrap a couple of months back \n\nMy section had to go as out post on that hill & we breakfasted among the graves of the fallen Tommies From the head of one of these graves a skull was grinning at us. It was an unfortunate trip for me as Sams who went for water & took the water bags, came back minus mine - I think it was a mixture of carelessness, bad temper & crook luck with him. We left to wards evening (I was nearly forgetting a duel in the air between ours & an Enemy Areoplane, the latter imsheeing for his life) Coming back I was on Advance again & made the capture of a little wild white Pup, a shy frightened little thing she is. Last night I had to go on stable picquet, so had \npractically\n very little sleep. There are rumours about that we are going on a long stunt, starting tomorrow morning.\n","125":"\n\nKatia\n\nWhen we left Etmaler this morning the whole desert was wrapt in a curtain of fog, When some times we climbed on to the top of a sand hill we could see it stretching around us like a huge mosquito net; The air was damp & our clothes got quite wet Travelling was difficult & it took us a long time to get a proper move on We got to Katia shortly after daylight & made tea for breakfast We will stay here all day I think & will leave about 12 oclock to night. The mare is fit she has eaten all the feed I brought for her & is now on some bakseech - Im glad she is eating well some of the horses are a bit crook & off their feed already dont know what they will feel like to morrow after going all night. My hands are sore the flies have got to a couple of places where I had bark knocked of & they are septic, Dont feel too good any way. The palms here are loaded with dates, I wonder if we will be here when they are ripe. My mare has taken a fancy to them & every green date that drops near her she snaps up.\n","126":"\n\nCairo\n\nMy last entry was made at Katia & now I am writing while sweltering in side an iron truck at Cairo station. I did have a bad turn after we left Katia. Ill not forget it. I was crook & we rode all night until day break, on the Flank. Then after day break we wheeled about & came back. The main body halted at a Palm grove near Beir el Lieu McK with a remnant of A troop pushed on to Katia. I was all in Had a sort of fever & lay down in the shade of a palm until 4.0 Then we saddled up & went into camp with the rest. I could not eat & my hand had gone septic so had to go off duty \n\nOn Sunday night I was asked if I would like a trip to Cairo you can bet I took it on, I had to go with three others for our kit bags. We caught the 7.36 train for Kantara & that night put up at the Anzac Hostel where we have been staying ever since We had until this morning to do as we liked except some shopping Well the holiday is over now & it will be graft once more for a long time I suppose Its as hot as blazes. these damn Egyptoes have been shunting this truck about for the last hour I wonder they do they think I like it\n","127":"\n\nCairo\n\nWe got finished with the kits last night about 5.0 & I went back to the Hostel & had a good clean up & some tea. We arranged to catch the train back to Kantara at 11.0 next morning. We had an evening at the Egyptian Caffe & had a good time However we found out that we would be in plenty of time if we caught the 6.15 this evening so are putting in a quiet day at the Hostel. Its a case of \" money. The nurse is a soul of goodness, she has attended my hand every day & it had been pretty bothersome & to night she tells us to be sure to call in before we go & we will get some sandwiches to take with us \n","128":"\n\nKantara\n\nIts drab after Cairo We arrived at 18.0 last night the kits had not arrived so we looked about for some where to sleep. At last we decided to put in the night on a small pier which though hard was clean & had the advantage of being covered so we could keep out the dew which falls so heavy this time of the year. I slept well & this morning went to the V.M. Corp & in with Harold for tucker. My hand was sore so I got it dressed & when I came back in the after noon I found that Harold had gone to Port Said on Escort so I went up to where the Sergeant was with the Trans port to put in the night there.\n","129":"\n","130":" Kantara\n\nI had a good nights sleep, the Transport chaps have fixed themselves very comfortably & I was give a stretcher to sleep on; it was much better than the boards the night previous. This morning I breakfasted well on steak & bacon & then we came on with two wagons to unload the Kit bags & dump them at the station on Rail Head side & so now, here I am, the kits all in a heap waiting for the trucks to convey them to Rail Head. The Ser & have gone off some where so I have to stand by.\n","131":"\n\nRail Head Romani\n\nSlept on the Kitbags last night, comfortable enough except for an inquisitive flea, who awoke a blood thirsty feeling within me, nor was I satisfied until I heard his soul depart the body with a crack. The miserable waiting here, We cant get the camels until 4.0, to make it worse a chap has to hum all his tucker & I make a poor hum though when it becomes necessary I do it unblushingly – I saw Tom Sherry, he came over to see old Bill off who has gone into the camel corp ; I am sorry I was not able to have a word with the old chap before he left. The Reg. have been out on another stunt & shot one Turk & captured two Bedouins. The boys are very much disgusted as usual at the way they are taken out there, get a sight of the enemy & then hang off until he has time to imshie\n","132":" \n\nA.G.H. Cairo\n\nWhat a world it is. here am I stuck in a hospital ward in Cairo & its much the same as being in prison. true I can walk about but always between high walls & wearing these pyjamas all the time heightens the effect. There is nothing to do but read. The nurses are kindness itself & one gets every attention, there is plenty to eat & drink & to day we all got paid 10\/- each so I expect that I should be dubbed an ungrateful person indeed if I had a growl \n\nMy hands are getting well slowly & I was able to scribble a few lines home & now make an entry in here I must write up the back stuff a bit but not now, Im not in the humour & the hand is’nt too good yet – I got a long letter to write to Vic, reckon I ought to blow him up him taking notice of Madge, She’s--------ed\n","133":"\n\nNo 3 AGH Cairo\n\nThe sickly hours drag by so slowly that one would think that old dad time was at last getting tired of his weary march through the ages, he’s a contrary old josser to say the best of him for I guess if I got leave tomorrow he would put on such a spurt while I was out that I would likely find my self making excuses & intreaties to the sentry on the gate with reference to the lateness of my return. Sir Walter Scott & some lesser lights in the literary world have been the means of helping me to cheat the hour of some of his minutes but my back & neck aches with the eternal lolling about & I have to turn old Sir Walter face downwards & take a walk round, & swear a little just to ease my feelings.\n","134":"\n\n\"The Pilgrimage\"\n\nIt aint no use in swearin,\n\nIt aint no use to fret\n\nIt aint no use agrousin\n\nOr getting all upset\n\nThe wilderness is rotten \n\nAll dust & flies & tears\n\nBut the Israelites they stood it\n\nFor years , & years ,& years\n\nThe Willie – willies choke you\n\nThe dust storms get you down\n\nThe red sun spoils your beauty\n\nAnd burns you blue & brown\n\nThe drought is simply shocking \n\nAnd the thirst our Squadron fears\n\nWill only be abolished\n\nBy Beers, & beers, & beers.\n\nThe war wont last for ever,\n\nThis scrap will soon be done,\n\nAnd we’ll have done our little bit\n\nA straffing of the Hun,\n\nAnd when we get back home again\n\nAnd greet our little dears\n\nAll thoughts of Egypt will be drowned\n\nIn Cheers & cheers & cheers.\n\nBy Bluegum\n","135":"\n\n\"In a Tent\"\n\nOld Lawson has sung of the stringy-bark tree\n\n(And the old stringy-bark aint no stranger to me\n\nHe has praised the rough roof that has sheltered his rest\n\nAnd although Im no Lawson, Im doing my best, \n\nTo give thanks to the tent that has given a roof\n\nTo shelter my bunk when from padding the hoof\n\nThrough the dust of the desert Ive often been tired\n\nAnd to dream in the blankets was all I desired.\n\nThere are songs that are sung of the stitching of shirts\n\nAnd fellows who wrangle over various skirts\n\nEven Homer has told of heros who fought\n\nFor a tart known as Helen – ( I don’t think they ought.-\n\nMy theme is more humble, praps more to the point\n\nThe metres erratic and oft out of joint\n\nIn stating here that, to a certain extent\n\nTheres considerable merit attached to a tent.\n\nOn the edge of the plain where the desert sands glare\n\nOur tents are afly in the sand smothered air\n\nThe distant mirage spreads its shimmering gleams\n\nThat we never can reach like a river of dreams\n\nAnd the arch of the sky where the desert hawks wheel\n\nIts as hard & as blue as the polish of steel –\n\nBut in spite of the sand & the desert immense\n\nWe made it a home when we put up our tent\n","136":"\n\nIn the future thats coming to many I hope\n\nWhen our way through war’s tangle (patiently) (presently) grope\n\nWhen the roar of the guns into silence shall pass\n\nAnd the rugged shell splinters shall rust in the grass\n\nWhen the merciful years have softened the pain\n\nAnd the new generation is happy again\n\nThe days I am sure we will never repent\n\nWhen we carried a rifle & slept in a tent.\n\nEyes Right\n\nSer Sturgess L.H.\n\n\"The Lays of a Lonely Bard\"\n\nTo the 8 Reos of the 6 LH\n\nWritten by Tommy Ducker while away at Tel.el.Kebir\n\nSay listen to me fellows\n\nTo this woeful tale of mine\n\nOf how our reinforcements\n\nThought they’d out the German swine\n\nAt Liverpool we had three months to get ready for the fray\n\nBut damn it all we never thought\n\nThat in Egypt we would stay\n","137":"\n\nWe landed there one early morn\n\nAmid its dust & gloom\n\nWe’re off to fight we proudly cried\n\n(Jack Chisholm said to groom)\n\nAnd groom we did & never thought\n\nOf our first intentions bold\n\nUntil some lawless Anzac cove\n\nSaid that our feet were cold\n\nThen up arose, one Pippo bold\n\nSaid with an ugly leer\n\n\"And ‘ow about the ‘orses\n\n\"If we should shift from here?\"\n\n\"Do you suppose that anyone\"\n\n\"Can stand Egyptian sun\n\n\"And as for us we’re climatized\"\n\nAnd Turks they are a gun\n\nSo we groomed on; the Boys came back,\n\n\"We’ve had luck we said\"\n\nhey took it in & with a grin,\n\nThey thought \"You’ve worked your head\"\n\nAnd now we’re in the regiment\n\nAnd proud as proud can be\n\nFor ar’ent we the self same crowd\n\nThat were at Gallipoli.\n\nIn years to come when we get home\n\nAnd asked \"What did you do\"?\n\nWe’ll say \"Oh we were in the sixth\n\nAnd saved a life or two\n","138":"\n\nBut will not own up when we are asked\n\n\"Who’s life had we assisted?\n\nThat it was but a common horse\n\nWho’s leg rope had got twisted.\n","139":" now you know our history\n\nOf how we served the King\n\nAnd how we watered horses\n\nAnd made the brushed ring\n\nNow don’t proclaim us heroes\n\nFor we’re bashful to the core\n\nAnd when the war is over\n\nWe’ll be Civvies ever more.\n\nDucker 8 of 6th \n\n3 Aug, 1916\n\nOur permanent Four\n\nPick any of Australian Battalions\n\nOf Sydney or Melbourne, Light Horse\n\nSo I’ll sing of our 8th Reinforcements\n\nAnd our \"permanent section of course\"\n\nFor number one place we have Rogers\n\nWith pippo & I two & three\n\nTo complete the array there is Robert H May\n\nSome class of a section you see\n\nWell Ive heard of the cooks at the poor house\n\nThe ones that kill most of the lodgers\n\nBut not one can compere, though they all may be fair\n\nWith our section chef, Francis E Rogers\n\nThe way this lad cooks water\n\nAnd onions & bully & rice\n\nMakes us all feel decidedly billious\n\nThough all agree that his dishes are nice.\n\nAt tea we discuss our position\n\nAnd the bad way the war has ben run\n\nFor I had it first hand with Bob May to command\n\nIt would soon be the end of the Hun\n","140":"\n\nOur arguments continue till tea time\n\nOn subjects we all know about\n\nAnd during the noise amidst all the boys\n\nOld Pippo starts yelling \n\nBut although we argue & argue\n\nAnd that to only one thing all agree\n\nWhich is of course & that I think you’ll endorse\n\nThat we’ll soon be \"civvies\" & free\n\nSo here health to Australia & England\n\nAnd a curse to the bumper of war\n\nAnd that Mothers & sisters & sweethearts are happy\n\nIs the wish of the Permanent Four\n\nTommy Ducker\n","141":"\n\nBallad of Waney’s Desperate Doings\n\nNow Waney’s an Australian, an Australian to the core\n\nThe fighting blood is in him & he comes to every war\n\nNow ‘twas some where in Egypt that this desperado strayed\n\nIn fact I rather fancy he was ‘on leave’ in Port Said.\n\nIn a quiet secluded village, I think they call it Arab town\n\nWhere French damsels of ill virtue, & picquets hunt you down\n\nOld Waney wandered slyly carrying quite a dozen beers\n\nTill the cry of \"Help us Aussie\" made him prick up both his ears\n\nAnd girding up his loin cloth like Horatios of old\n\nWith blue mettle in his pockets advanced with mien so bold\n\nNow this awe inspiring spectre would the boldest man appal\n\nFor there stood three Light Horse men with their backs against a wall\n\nAnd facing them two Gippos with their wives & several sons\n\nWere forcibly demanding payment for some current buns\n","142":"\n\n\"Gib it. 2 piastre buksheesh cried one burly Soudanese\n\nThey replied, \"Ma f’eesh for loose, yer maris, analla booke emshe\"\n\n(Arabic for I have no money you blackgaurds)\n\nGet off the earth clear out)\n\nBut Waney \"Man of action\" & quick of thought is he\n\nChose two large hunks of metal & a deadly shot, shot he\n\nA cry, a thud, a pool of blood, did tell the deadly tale\n\nBut nigger reinforcements had heard that gruesome wail\n\nThey raced from lonely alleys they burst from every door\n\nThey called to one another & rolled up by the score\n\nThe original offenders had no faith in Roman gods\n\nDived straight into a gharrie & left Wane to face the odds\n\nHe was keen to stand & fight ‘em \"turn em down\" & go alone\n\nBut discretion outed valour & he tried to make for home\n","143":"\n\nBut his way was blocked by niggers And poor Warne would be no more\n\nIf he had’nt seen a Tabby beckoning through an open door\n\nShe was a winsome lassie as this lothario spied\n\nAnd killing several niggers he soon was by her side\n\nShe took him to her bedroom, stowed him well beneath the bed\n\nAnd made him stop there silently that tabby used her head\n\nHe gave her just one parting kiss a sort of souvenir\n\nOf how he outed twenty nigs & one large keg of beer.\n\nIn windy wintry evenings, when he’s back in New South Wales\n\nAnd there getting reminiscent & telling little tales\n\nHe’ll fill his pipe & fill his glass & in modest voice he’ll tell\n\nOf how he saved a pretty girl & the rising he did quell\n\nRowdy\n","144":"\n\n\"Pinched from Rowdy book\"\n\nmy Creed\n\nI would be true for there are those who trust me,\n\nI would be pure for there are those who care.\n\nI would be strong for there is much to suffer.\n\nI would be brave for there is much to dare.\n\nI would be friend to all the the friendless\n\nI would be giving & forget the gift\n\nI would be humble for I know my weakness\n\nI would look up & laugh, and love & lift.\n\nThe Road to El Arish\n\nOn the road to El Arish, Oh it aint the place youd wish\n\nFor a picnic with your or a spell\n\nFor the sand flies over all & your horse can hardly crawl\n\nAnd your twenty miles from what they call a well\n\nAnd the water when you get it well you try hard to forget it\n\nFor it taste as if it ‘ad been drunk before\n\nAnd the sun is over head pourin down like molten lead\n\nWhy the ‘ell did El Arish come in the war\n\n Why the ‘ell did El Arish come in the war\n \n\nTommo reccomends this sung to the tune of the \"Honeysuckle & the Bee\". he comes at it after the \"sixth\"\n","145":"\n\nOn the road to El Arish you get bully in your dish\n\nAnd you’ll eat it if you want a ponzer thirst\n\nAnd the flies they make you cry, but you kid your self its Pie,\n\nThough you own you’d even rather eat some German Wurst.\n\nAnd you have to guess a range for yer peepers need change,\n\nAnd you wonder if Jock Burk is one or two\n\nIts \"Shove it up from four to six’ Raise your head & see his \"\"\n\nAnd yer cobber says \"You’ve got him in the shoe\"\n\nOn the road to El Arish where the water stinks like fish\n\nThe Padre says three Joes have been before, \n\nThere was Joseph & his brother & later on two others\n\nBut those Joes were out for peace & not for war\n\nJoe Burk’s a different brand, he don’t feed out yer ‘and\n\nAnd he lurks behind a sand hill for a \"pot\"\n\nIf you get him in a Hod you may send him home to God\n\nThat supposing you’ve the luck to get him first shot\n\nOn the road to El Arish, wear Joe’s bullets going \"Swich\"\n\nThrough the date palms on the hod where your’e at rest \n\nBut we’ve taught him what he’s learnt & he got his fingers burnt\n\nApullin German Chestnuts comin West\n\nAnd he’s calling out \"Ma leish\" on the road to El Arish\n\nAnd the White flags always ready in his hand\n\nOh he’s crossing the Canal but he isnt going to yell\n\nFor the Boob is very quiet compared with sound\n\nWe were the Honey Honey Suckle\n\nJoe Burk was the bee.\n\nHe tried to sip the honey\n\nFrom our Camp at Romani\n\nWe’ve got him \"beaten and retreaten\"\n\nTo his base of course\n\nWe gained a victory for the good\n\nAustralian Light Horse\n","146":"\n\nThese titbits are out of Rowdy’s note book they took my eye as I know just what they are all about. Rowdy came in with the first batch of wounded from Romani, he is a cheerful cus & I have not been quite able to set myself down & rest since the wounded came in. My hand was in splints then but I felt pretty discontented to think that the boys out there were hoeing into it & I in here missing the whole blanky lot. The boys are all doing well, Im glad of that some of the less serious have already gone back to Montasa or the Regiment, these bullet wounds seem to heal quickly. The sisters have been worked to death nearly in this ward as its full of wounded, almost all the other cases being shifted to other wards. I being left here because the Doc grafted some skin on my hand & he was keeping his eye on me. The boys did splendidly out at Romani I believe. The Colonel went O.K. & was wounded out at Katia while wanting to see that all the boys got clear when they had to fall back.\n","147":"\n\nBrig Royston was the wonder & idol of the whole division he has earned a great rep with the boys, part of it being his ability to knock up horses. he got hit in the leg but when they wanted to dress it said, \"No never mind laddie, get me another horse\", Bill comes in almost every day to see us here. to night he called bringing me a pair of pants & spurs. he seems to be having a good time & likes his job – Im glad he has fallen in to a good possie, he is a real good sport. Ive had one after noon’s leave since coming here 4 hrs I extended it to 5½ on my own initiative & was told next morning that I was up for it but have heard nothing so far – That was on","148":" \n","149":"\n\nHot Summer Nights\n\n\"From the Bully\"\n\nDead ring for old \"Coogee\"\n\nHot summer nights; Hot summer nights!\n\nThe beach – a splash; soft tarts in tights;\n\nA glow of distant city lights;\n\nTi-tree in silhouette; a white pearl sky;\n\nOceans of lovers, lovers pass my eye;\n\nSoft, shaded grass; pale, shining sands;\n\nRomantic sighs; holding of hands;\n\nWhite tracks, with stealing shades of trees;\n\nSweet scents of earth; a gentle breeze;\n\n A glimmer of white; a sigh, a sneeze;\n\nFull lips of red, a kiss, a squeeze;\n\n A stealthy voice, a laugh, a rustling skirt,\n\nA world of whispers, & the world aflirt.\n\nMy oath, hot nights\n\nHot tarts in tights\n\nHot views, hot sighs –\n\nReal hot, my oath! Hot summer nights!\n\nHal \n","150":"\n\nNo 3 A.G.H Abassia\n\nI have had along stay in here, my hand is almost well now. only a bit weak. I had a chat to the Doc this morning & he is letting me go on to Montasa. I am glad, I don’t think it is quite fit yet & Im afraid the Doc wouldn’t let me go to the Regt for a few days as he says the hand wants some care yet. Its like quod here. Ive only been out for a few hours one Sunday after noon\n","151":"\n\nTrain Cairo to Alex\n\nOut of quad at last. Out into the street alive, alive with color & life. It was a brisk trip in the motor waggon to the station & now we are bowling along on the Train right merrily What a beaut it is after white wash walls & pyjamas. On each side extend fields of rich green above it is bright blue. here & there are drab villages with quiet shades of brown grey & orange only the dome of a mosque showing up with dazzling whiteness in the bright sun shine; patches of date palms with bunches of rich brown & wine colored clusters hanging, & in the field are the people working listlesly. \n\nAlong the road we pass some camels moving lazily, an Egyptian on a donkey, looking pompous under his big umbrella, Above the horizon some clouds as soft looking & white as wool drift ceaslessly along & merge at last into a shimmer among the tree tops. Egypt! unobstrusive, & quietly your Sphinx, camels, bright star flecked nights, & boundless sandy deserts.\n","152":"\n\nMontazeh\n\nRather a change this from the 3rd A.G.H. Smithy & I explored until we were well nigh knocked up at night. Its an interesting place, Plenty of room, the grounds are particularly extensive & well laid out but have been allowed to go wild a bit though that makes no difference to us. The trees are planted thickly & there are acres of them so that the shade they cat is dense & looks cool. The sea breeze is fresh after the hot air of Cairo & its a treat to walk along the sea front.\n","153":"\n\nOur Brigadier is full of cheer\n\nHe shouted out \"Hooray\"\n\n\"Youre making history\" he said,\n\nAnd then he rode away.\n\nAnd in this tale if you read on,\n\nYou’ll find out how its done,\n\nOf how old Abdul came to fight,\n\nAnd how a victorys won.\n\nWhen Abdul left Damascus\n\nWith an Army Corp or so,\n\nHe never even asked us\n\nPermission for to go.\n\nHe came along the sea-coast\n\nAnd swanked at Ber el Abd\n\nAnd uttered there a big boast\n\nOf the land that he had grabbed.\n\nHe marched to Ograbina\n\nAnd stayed there for a week\n\nAs much to say \"We’ve seen yer\n","154":" don’t give us any cheek\"\n\nAnd then he came to Quatia\n\nAnd camped around the well\n\nAs much to say \"We’ll face yer\n\nAnd give yer ---- hell\"\n","155":"\n\nAnd then he reached Et Maler\n\nAnd started his advance\n\nBut found against Australia\n\nHe had no ------ chance.\n\nHe thought that with his rifles\n\nHe would easily get through\n\nBut found that these were trifles\n\nTo old Man Kangaroo.\n\nHe brought up reinforcements\n\nAnd snipers by the score\n\nBut found this to his loss meant\n\nOur rifles spoke the more.\n\nHe tried to get around us,\n\nBut here he tried in vain\n\nAnd very soon he found us\n\nIn front of him again.\n\nHe cried out allah! allah!\n\nAs through him cold steeled seared\n\nBut discretion more than valor\n","156":" Allah disappeared.\n\nAnd Abdul taking Allah\n\nAs leader good & true\n\nHe also did a ‘yallah’\n\nFrom the wily Kangaroo.\n","157":"\n","158":" now I end up calmly\n\nFor Abdul ‘finish fight\n\nAnd the Remnant of his army\n\nIs retreating back in fright.\n\nTommy Ducker\n\nCan be sung to The \"Other Department Please\"\n\nfrom Tom Jones\n","159":"\n","160":"\n\nMontazah\n\nI put in for leave on Monday so after getting the signatures of the Sergeant Doctor & Adjutant on my application form the leave was granted. 2.0 am to 7.0 pm Nothing flash about it but I wanted to look at Alex & the glance I had was hardly worth the trouble as there was no time to go anywhere or do anything. I caught the tram from Ramleh to Sidi Gaber at 5.55 & when I got to the station the train was already moving away so I thinking that Sidi Gaber was on the branch line jumped on the train congratulating my self on catching it but I felt anything but elated 5 minutes later to find that I was on the Cairo express & that Sidi Gaber was the junction of the two Lines – It was 10.0 at night when I arrived at Montazah but as I had got the name of & address of an officer on the express certifying that I had made a mistake the Col. here did not trouble me about it \n","161":"\n\nMontazah\n\nThe world has got me snowed just a treat;\n\nCrool Forchin’s dirty left ‘as smote my soul;\n\nAn all them joys o life I ‘eld so sweet\n\nIs up the pole;\n\nFer ‘as the poit sez, me ‘eart ‘as got\n\nThe pip wiv yearnin’ fer ---- I dunno wot.\n","162":"\n\nSaw in a paper that –\n\n\"German submarines were in future to go about in couples\"\n\n& further that – \n\n\"We should endeavour still to find a ram for every \"U\"\n","163":"\n\nMontazah\n\nIn have still got a bandage on my hand. When I was in swimming one day I broke the skin on the sore & it is awfully slow at heal ing, I have felt anything but fit since I have been down here & I should be really jumping out of my skin. I was in Alex again yesterday with old Jim Suffolk, cant say that I enjoyed myself much. Jims a real old woman for shop windows. This afternoon I was walking along the beach with a young Welsh Corporal who was inlightening my ignorance on the subject history. He pointed me out a hale & hearty chap whom he said was blown up through 20 ft of earth on the peninsular & to use his own words \"It even blew all the lice off him\" After this I mean to accept his tales of Welsh history with the proverbial grain of salt.\n","164":"\n\nMontazah\n\nI am all ready for a move once more. The hand is blistered on the sore \nagain\n I hope its not going to turn septic again. Eggs for breakfast this morning. Its always a lively scene when eggs are on. One boy said he got one good egg out of four. he was told he was lucky. I got two out of three. In the boom. Some whisky knocking about last night evidently by the liveness of certain lads. \"?\" Where do they get it?\n\nBottled stuff prohibited; One bright lad said it was possible to get the chap behind the counter to sell a bottle to himself & influence him to make you a present of it. \n\nIt seems red hot in clobber again after doing the act for so long.\n","165":"\n\nGot my watch – its quite important I feel to be able to tell people the time in stead of asking it. Nine letter were given me also\n","166":"\n\nEtmaler\n\nBack with the Reg once more. It’s a homely thought of feeling. Not so classy at Montazah the tent is in the most unlovely disorder. I left at 2.0 yesterday & got at Sidi Gaber at 2.30 & had there until 3.50 so Pat Little & I caught a tram & flopped into Alex, we had an exciting trip back getting there on the tick. I sat tight when they cried \"Get out\" at Moasar & so came right on to Kantara. A Lan cashire lad took me under his wing & escorted me to a tent where I had a bunk for the night & a breakfast this morning \n\nCaught train at 9.15 & at last got to Romanai station. I was talking to one of the boys when his horse gave a jump & lobbed on my foot, good job the sand is soft or it would have been a trip back to the hospital again. The boys are all getting ready for Ber. el Abe & I just got back in time to pass in my Kit bags – Woods & are having a spin. Guess there is some dirty work going on by the way Joe is talking – Lea & he were arguing on Zeps. Lea reckoned that they were not so bad as painted. Joe said no & 200 lb bomb would nt hurt, only knock a bit of skin off if it hit you\n","167":"\n\nEtmaler\n\nLast night Tom, Harold, Jim Draper & my self took up a very strong position in the vicinity of the canteen & they told me many a lurid tale. Tom said that the handiest stuff he ever struck was some compressed apricots of the turks that they left behind when they retreated. They ate it , built dug outs of it if no other use could be found for it, it could be used in a most dignified manner as a substitute for paper. When the boys were out at Ber el Abe it was cold at night & they had no blankets, & even the officers were lurking about trying to pinch any indiscreet bag that might be for a moment ungaurded. Weary Walker used some beautiful language because some ‘Cow\" had cut a lump off his bag. To day its go for your life. Saddles packed, rubbish burnt etc. Ive been allotted a many pointed horse (sticks out well at the joints) The little mare had to go for a spell. Every thing is ready for a shift first thing in the morning . So now here s Tom asking me to go on duty near the canteen again, as its his last night. I might as well\n","168":"\n\nBer El Abe\n\nIts really Tuesday morning Time 3.0 am. Im on picquet – the Gee Gees are quiet & the old Moon is streaming bright & high, the old desert looks still & sleepy with the moon light glimmering on the sand but the crickets are chirruping away merrily enough\n\nWe left yesterday morning. I thought I would never get in the saddle it was packed so high & some dopey fool had hogged the mane of my horse; indeed I heard the boys betting \"He will\" \"He wont\" often, as my fate seemed to hang in the balance, twixt the ground & the back of the horse. The first have a camp in a Hod, it looks comfortable – The dates are ripe now. We were very charmed at the sight of the sight of our camp, not a tree for half a mile – Nearest water half a mile, that’s Booker. However the section have a bosker little bag home right near the horse lines. I am sitting at the door now & can see the horses at a glance. Johno is Snoring sweetly. Ive been stuck into No 3 section with Johno, Godber & Galaker. Harold has been made Lance Jack & stays in my section. It will soon be four now & then its \"Stand to\" How the boys will love it They have been spelling lately\n","169":"\n\nFor when you’ve come to weigh the good ‘an bad –\n\nThe gladness wiv the sadness you ‘ave ‘ad –\n\nThen ‘im ‘oo’s faith in ‘uman goodness fails\n\nForgits to put ’is liver in the scales.\n","170":"\n\nBer El Hassaniya\n\nThe section have got fixed up with a \"bivvie\" made of bags & palm branches, we are all fairly comfortable. The mob have been warned for out Post to night but I have to go on Brigade Gaurd. Its pretty hot & the flyes are enthuseastic – My new horse has given up eating & drinking; He’s too bally flash to come at compressed fodder & brackish water. Guess he’ll take a tumble to him self before long. Johno has been told that he has a chance to get a comision as a tooth yanker. \n\nWe have a rumour that we might get some stouch soon here. It strikes me that this desert is very rotten place to fight in. Nearly all the boys here have \"bivvies\" made out of Turkish \"bivvie\" sheets they are superior to ours. The dates are pretty ripe in places & they taste real good, much better than I thought they would. Its dangerous to sit beneath a date palm just now as there is always some blamed fool aiming rocks up trying to knock down some ripe dates down. The horses eat them & look for more. \n","171":"\n\nBir El Hassaniya\n\nI had to go on guard yesterday after noon on ammunition, it was a sweet job; especially for me, a very rough turn out though. I heard Myers this morning wondering if he need put on his boots & socks. He is an artist is Carl He entertained us with some of his Gallipoli experiences. His pet greivence at present is that Billy has been given a stripe\n\nOur bivvie at El Hassaniya\n\nFor Restfulness comfort & \n\nWith home would compare,\n\nWhat! Would you dare.\n\nSay, I don’t think\n\nGuess Ell is more near \n\n \n","172":"\n\nBir El Hassaniya\n\nIts ‘Ot\" as the proverbial \"Obs\", to day. now & then a breath of wind puffs along & feels cool & nice against ones sweaty face To night we start out on a stunt. We are going to look for stouch. Some one has an idea that Abdul is longing for a chance to toss in the sponge & take a trip over the canal, I wonder? We are carrying 60 Rds amm extra to help to persuade him that the desert is a very unhealthy place to live in. Thirty miles out! Wont it be a real joy ride in for the wounded. We are supposed to attack Sunday morning – I believe my horse is still doing a fast. I had to pet him & call him horrid names in the most soothing tone to coax him to deign to drink too buckets this morning & he ate a few mouth fuls of grain I pinched but guess he’ll come at it later.\n","173":"\n\nGilgaldri\n\nWe left Camp at 2.0 this morning, it was a nice cool ride in the moon light. Arrived here at about 5.30 am. I was stuck on out-post of course, did four hours. Horse still wont drink or eat also he landed me one on the shin & Ive a big blue lump on it now hope there is not too much running to morrow. We leave here 5.0 pm & B Sq. goes on Flank guard, you bet, never missed it yet. we attack 4.45 in the morning. There will be skin & flying to morrow.\n\nMonday \n\nTerrible thing happened last night, We unsaddled, drew rations, had a snack we drew two loaves & some scraps of bread per section. I put the scraps away & Gal said to stick the loaf in his water bucket on the saddle. This morning the loaf was gone. – Language - Cams horse ate it. The worst of it is we can hear Cam enlarging upon the subject of Bread as fodder for horses, while we have to eat scraps that are left\n","174":"\n\n \n\nWe started out at 5.0 pm yesterday & it was rather a decent sight to see the troops move off accross the long desert slopes in the glow of the evening sun. Our folk in old Aust would think it great to see their boys on a parade like that. We took the flanks of the column, riding in pairs, a few chain apart. My horse walked like a good ’un. It was along ride, but it was not unpleasant though we got very weary towards morning, what would a chap have given for a good old snooze! We had frequent halts, but day light found us on a big flat dried up salt lake & we wondered where the Turks were & why there was no rifle fire for the \"fift\" were out in front & we reckoned they ought to be into it. We messed about a good lot then finally A & B tps were sent to a post on the left flank Here we had a good view of the movements of the troops in front. Later there was a bit of artillery play & some rifle fire & planes circling round but it was tame a far as we were concerned\n","175":"\n\nBir El Hassaniya\n\nBack in camp again. We were on the post until a bout dinner time yesterday, then our mob began to drop back, & we fell back to the main body & were flank guard going back. They reckoned that if they had liked to press the attack the possie was ours but there was not much chance of holding it. A Troop got back to where the 3rd Bde was & here we were able to get a quart of tea made, & water our nags, it was a pleasant surprise. The old horse must have been feeling rotten but he came back with a bow in his neck & a tight rein on the bit, hes game. We messed about a hod for about an hour before settling down for the night, & swear, – it was murder, we got fixed up about 10 o’clock then I had to draw some rations for the troop. 12.0 I got in bed, 2.0 up again & then we got back here. Its good to be back again. Ive had a snooze, & some tea, the horse a drink & a feed The boys are all resting strenuously. Gosh how tired we all were this morning\n","176":"\n\nMy horse is a bosker you bet\n\nThe most saving horse I have met\n\nDon’t take any sorter\n\nTucker or water\n\nNor cares how much work he may get.\n","177":"\n\nBir El Hassaniya\n\nRations did not come to hand as usual yesterday & last night it looked very whiskery as far as tea was concerned. The tea was of brackish water & our tucker box was empty, some one suggested that we should go to a hod for dates but a mile is a long long way on this sand. Eventually we dug up some bully & biscuits so every thing was O.K. again. This morning the out look was even more dreary – the camels had not yet arrived, there was no feed for our nags & they were waving their empty nose bags about impatiently. Some of the boys were gazing disconsolately at a mere half biscuit that looked so lonely in the center of the saddle blanket which was spread on the sand as a table cloth How ever the Camel train arrived & we were able to appease the wolf in side, there was fresh bread no less & it was’nt very sour either. This is verily the Life.\n","178":"\n\nEl Hassaniya\n\nTwice mail has been passed round, twice have I received none It is some consolation though that Johno got a big parcel the contents of which were a welcome addition to this evenings tea. We are to move out to the front line of out Posts to morrow, this is the third time that we have been told that we were to move out but I think it is \"dinkum\" this time. The boys are lying about in front of their bivvies after having tea discussing various things, Egan is wondering how his sheep are? Woods says that he hears that after all it is’nt true that we are going to move back & going to France. Johno is wondering what would be a good name for our bivvie, Ivor Evans reccomends Arab-town; which is rather a slur on us especially Johno who goes about in shorts & whose skin is burnt a bonza brown. The sun is setting, he don’t with all the glory which attends his imsheeing at Gallipoli still the West is bathed in a most wonderful glow of rosy colour which deepens into a velvety blue & already there is a bright sparkle from the evening star\n","179":"\n\nFancy having a day of rest on Sunday. Yesterday we came out to the front line & put in most of the day on observation, last night seven of us took up a post on the old desert\n\nThe stars above shed forth their soft quiet light,\n\nFrom out the velvet black ness of the sky\n\nAnd like some evil phantoms of the night\n\nThin misty clouds go floating by.\n\nBeneath, the desert spreads its silent sands,\n\nAlong lone ridges steals the ghostly mist,\n\nA spirit grey lies brooding oer the land,\n\nThe night, all ears is gently crying, Hist!\n\nThere was no watch in the crowd so the shifts were a matter of guess work but every one seemed satisfied this morning. We had breakfast at this hod where there is a good well, what a treat to have a good wash & to lie down with a prospect of not being disturbed.\n","180":"\n\nEl Hassaniya\n\nYesterday morning we were relieved by a Squadron of the seventh & came on back to camp We were glad to see our old bivvies again. Talk of Xmas, there was a pile of Gift stuff for us. For each section 4 tins of 50 smokes & some Tabac, treacle 2 small tins of butter 2 of fruit 4 of lollies 3 candles, tin of onions 4 of sardines & some sauce A good lot of solid eating. The stuff had arrived for the Regimental canteen & some beer. I had to go on gaurd though that was the Fly in the ointment This morning brought mail it was great to get some letters again some back stuff came to hand. Johno got word to report to Div H Qs about his commission, he left this morning. All the other three boys on gaurd have imshied off to tea so now we’ll soon have finished Its been red hot but this evening a breeze is blowing & it has freshened things up considerably\n","181":"\n\nEl Hassaniya\n\nI am having a big loafe to day, just lying in the shade of the old bivvie reading the papers brought by the last mail & smoking cigarettes. There are several rumours afloat concerning a move for us. Last night all surplus gear was handed in by the sergeants & all the dismounted men were packed off this morning. Salhia was favourite last night\n\nfor our destination stakes but Johno came back a few minutes ago & he says that we are going to Hill 70 then back to . There was also big talk of being equiped & trained for cavalry work. I wonder what it feels like to be swinging on to the end of a sword\n\nIt came out in orders a few days ago that there was no truth in the rumour which seemed prevalent that the ALH was to move to France. Why they should take the trouble to contradict a rumour which has stalked amongst us continually since our arrival in Egypt – now I cant for a moment imagine its one of the pleasant characteristics of our army.\n","182":"\n\nEl Hassaniya\n\nBy all accounts we are to clear out to morrow morning at 5 o’clock We have received no orders Yet but it seems a cert. One thing it wont take long to pack up, though how Im going to get every thing on the saddle I dont know, the horse will have a rare load. The blighter got his heel gauled with the rope on Tuesday & is very sore on it. I drew 3 quid this morning. I wonder if we will get in near Cairo as a few seem to think or stay at Hill 70, the latter is not much chop.\n","183":"\n\nRomani\n\nWe hit this place up about 1.30 to day, a bit different it looks to when we came here in April – Canteen, Wet & dry & Tent, all over the place. We left El Hassaniya this morning about 7.0 am - I wondered how the old Dope would go as he was very sore on his foot but he came along in great style in fact he seems to do better on the We have been allotted tents, there were the usual arguments about who was to be in the tents. I waited till all was settled, then walloped myself in the tent with in. Its only for day or two anyway. I think we are to move on again about Sunday or Monday. \n\nThe desert had the joke with us before we left. We had packed up all our sheets & were sleeping on our saddles blankets our bivvies all dismantled when in the middle of the night blowed it it didnt come on to rain, a shower sharp enough to suggest great possibilities of discomfort. The boys are all lively & dont seem to be very tired after their long ride. Ive been wondering how I missed picquet, its ominous\n","184":"\n\nRomani\n\nThis morning we had to turn out of nice comfortable blankets at day light & pull down the tents – Its a good joke following in the tracks of the","185":" Bdg and cleaning up their camps for them. In an hour there was a great change in the look of the place, where the tents had been were bivvies of all sorts & descriptions, the boys are some class at rigging shelters now. This afternoon we had to parade in front of General Chauvel who gave us a lecture & presented a DCM to a chap in the","186":" Perce just came along & warned me for Gaurd, not a bad job considering we move off in the morning – I received a pretty decent lot of mail last night there was a letter from Bert dated 10 Sept so hes going pretty OK as yet\n","187":"\n\nHill 70\n\nWe are fixed up here once again & its no bally catch as yet, all \"Falling ins\" & \"dismisses\" & numerous fatigues. We left Romani at 8.0 yesterday morning & a long weary journey it seemed. I was real crook too & thought we would never get here. It was 2.30 when we got in & started to water our horses. its a treat to get to fresh water again & I had a bosker bath after evening stables. This morning we had to turn off from breakfast too abruptly for our liking & take the \"mad- mick\" & shovels & level the floor of our stables – We did do a yell but it looks much better now its done. They do some wonderful things in this military though, they brought back 50 fantasies of water all the way from Romani on Camels, we are all wondering \"Why\" - There are two sections to a tent so far but the details are to be all absorbed into the Regt so I expect we’ll have a few more in our tents, one thing it will mean more men for fatigue\n\n5th Thursday 3.0 pm\n\nBally Bunion\n\nIve just been to the Regimental barber belonging to the L.Fs he nearly broke my neck had no back to his chair, gosh! it was murder. These boys get up with the \"lark\", they make a most horrible row with their drums; its like a Chinese Xmas at 4.30 in the morning, then they go dubbling about in the sand as if they were getting \"well\" for the worlds championship. First thing I did this morning was to offer up a prayer of thankfulness that I was not born a Tommy\n","188":"\n\nBally Bunion\n\nYesterday morning I got up early & packed the old saddle & a little later the boys had to turn out, it was a releif not to have to fall in with them for they were marched off for some rifle drill. One boy told me that when they got the order \"Fix bayonets\" it was a mess; some of them could not even get their bayonets out of their scabbards much less \"fix\" them. H troop got away about 9.15 after waiting a long time for horse feed to arrive & we had visions of a little lonely post stuck away out on its own on the desert. As we went along we saw some deer, it seemed strange to see the pretty little beasts away out in the shelterless sands. \n\nWhat a shock we got when we topped the last hill of our journey to see a big camp with plenty sheds tents & water laid on. we would hardly believe it was our destination. After watering & feeding our nags which looked contented enough in the shed we got some stuff at the canteen belonging to the Lan. Fusiliers, a battalion of which are camped here, & had dinner. Perce came along while I was eating & told me off as Q.M. & I had to catch the 12.30 train to Ballah on the canal & draw rations. I met some of the A.S.C. boys who were camped at Anzac down there – I was down again this morning, 20 mins in the train & this evening I go down again & draw the rations early in the morning. A troop has to supply a patrol of 8 men & a N.C.O. day time only – We all wish that we were here for longer than three days\n","189":"\n\nBally Bunion\n\nI went down by the 5.30 train from here to Ballah. A little oil engine is what they use on the road. The Gippoes are making a splendid road along side the Railway line. its funny to see them, about a dozen in a row accross the road each with a stamper, they sing a song & keep a slow beat on with their stampers to the swing of the tune – I got to Ballah in time to be invited to \"dinner\" with the A.S.C. boys whom I knew at Anzac, they dished up roast beef & mashed spuds & some jam tart to top up with. This morning it was some bustle with the rations & I had to pull their officer out of bed before I could get properly fixed up with fodder & I caught the six thirty train by the skin of my teeth.\n","190":"\n","191":"\n\nPoor old Sam’s has got word that one of his brothers has been killed in France & the other wounded, he is cut up. I just have been over to consuld the list in front of Orderly room. Glad to see it has no Burgess on it. Stevens went off to hospital this evening he is pretty seedy & has a bad foot, he should have been away long ago.\n","192":"\n\nHill 70\n\nWe had a nice ride back from Bally Bunion, the sand was fairly firm for the horse’s feet, although rats or some animal of the sort has made burrows all over the place which proved a bit troublesome. Noticed some pretty white flowers after the style of the dafodil, they seemed out of place in the desert; More appropriate to the place was the snake that Tom killed, he was a short thick chap like a adder only he had spikes on his head, I remember seeing his picture some where when I was a kid & I used to think what a crook lot he looked, I had to go on in charge of the nights stable Picquet, its a twenty four hours job & I thought it would have releived me from a church Parade but Perce insisted upon my going & put an R.C. in my place. however the old Parson preached a decent sort of sermon so it wasnt such a strain as I thought it would be. \n\nI received seven letters to day three from two from Mum & two from Vie. there was also a photo of marg & Mother. We got paid yesterday so a lot of the chaps were pretty full last night. Corby was on second shift on Picquet & he talked to Burbank until his shift was up then turned into bed, had the hide to want Bur. to do 10 mins baksheesh for him. Now Im off to bed & wont I sleep just.\n","193":"\n\nHill 70\n\nThe troop is in a very disorganised state owing to the number of boys away on leave \"Tom the Terrible\" & Perce Barrow & several others are away for a week at Sidi Birsh \"Lucky beggars\" & some one goes every second day to Port Said for 48 hrs. The chaps who are left have counted their quids? over & over & searched every pocket hoping to believe there will be enough to go away on when the Sidi boys come back. Some are doing the old \"Sidi\" or the Desert stunt at the schools & \"Finish Sidi Birsh\" is a very favourite expression down there just now. Drill is \"off\" thank goodness. I only had one morning at it.\n","194":"\n\nHill 70\n","195":"\n\nHill 70\n\nSome reinforcements came from the detail camp last Friday evening & I was surprised to see one of Dowling Sts old hands amongst them. We got a couple in A troop & others went to B & D. Saturday evening I mounted gaurd with two new chaps out of D troop & one of these proved to be Barnes whom I knew at Wollongong seven years ago. Yesterday as we lined up for dismissal from Church parade a number of phamplets were issued out containing Bill Hughes appeal to the Troops on the vote on Conscription; Since then the question has been debated from every standpoint & I think to day the boys have been well nigh unanimous in voting \"yes\" They are still being taken before the orderly room a troop at a time. \n\nIn A troop we are all wondering who will be lucky enough to draw leave to Sidi Bishr when the Boys come back on Wednesday as there is some talk of moving back to the desert again shortly. Some of the boys who have taken leave to Port Said are going very crook because they think they will have to wait until last for their chance. Last night there was a terrible heavy dew, the tent got wet & shrank so that the pegs pulled out, so we had a job of repitching it this morning\n","196":"\n\nSidi Bishr\n\nWe are fixed up at the rest camp here, it seems a good place. What a weary trip it was down here – We left camp yesterday morning at about six & we got here at 5 in the evening. Right along the line the sight was one of green fields & water & perhaps one would have enjoyed it more had the seating accomadation been better but we were cramped up uncomfortably on the hard seats in dirty carriages & it was not until we got near Sidi Gaber that the boys showed any enthusiasm in their surroundings – Along here every thing looked to be greener & in greater profusion. Banana plantations palm maize, etc every where \n\nThe Nile is swollen with the flood – I heard some one remark that the waters had reached a higher point than since the year 1889 so its some flood & a muddy swirling old stream it was, the glimpse I had of part of it. We had orders read to us, they were lengthy & some caused some rude remarks & a deal of snickering from the Aussies – While the Tommies looked at us like so many Mother Grundy’s. Here is a sample --- \"When going to bed at night the rifle bolt must be removed & the sling loosened one end & tied either to the arm or leg\" The limit\n","197":"\n\nSidi Bishr\n\nOrders are treated with the greatest contempt & so long as we behave anything decently we are left severely alone. The senior NCO should have taken charge but all shirked the result \nbeing that\n yesterday being that there was no check on the boys who went through medical inspection, & as the M.Os signature to the roll was important to get passes I collected the names & got it signed & then argued the point with some of the Senior men until at last they saw that it was handed in to Orderly Room, As it was we got the passes late & a lot of the chaps had imshied off to town without them The passes are available from 2 pm to 1 pm daily, pretty decent - ) but as a matte of fact a lot of chaps stay in town all night & they are not molested so long as they do not get wandering about the streets before 12 or 1.0 noon. Beuzie Harold, Bill May & my self had a look round but got back early, about 10.30 We had a rattling good time though I like Alex better than Cairo, it seems more civilised.\n","198":"\n\nSidi Bishr\n\nWell the sand in the Times glass is about finish & in an hour we will say good by to Sidi & Alex. Such a time as we have had though. Gharries Trams. Gardens Hotels, pictures, Kersaal, & numerous other gladnesses have we injoyed, the joy of clean sheets on a soft bed not being the least, almost equalled by that of being able to keep clean, & possibly eclipsed by the joy of being able to order a meal of proportion & quality to suit ones taste & aputite. \n\nThen there s the joy of the \"Unexpected happening\" As on yesterday afternoon as Joe & I sat on a seat in the Park looking at some sorry buildings accross the road, a fair damsel sat on the end of the seat & said \"Excuse me,\" It was such a novelty to hear. English from a girls lips that I involuntary remarked \"You speak English\" & we had a pleasant little chat which ended in an to \"Come along to morrow & meet my Mother\" & as I am due at Hill 70 to night I had to decline but Joe is going to \"See Mother\" this afternoon, & I am wondering how he will get on. Its a real treat to exchange with some one out side ones own mob; & to hear the good old English by other than the rough voices of the boys. Every one looks fagged out this morning, the boys have been making the pace while in here, I dont blame them, goodness knows when we will get the next.\n","199":"\n\nHill 70 Sinai\n\nBack in camp again. I have felt a sort of home sickness since I came back & it is developing into a beastly feeling of restlessness; guess if we dont soon make a shift some where I’ll go dilly. Godber wants to know how a man who is \"Maknoon\" go \"maknoon\" perhaps there is something in the suggestion of his remark. Any how a weeks leave is no good, notlong enough by a","200":" Last night I was on Picquet a nice change after Sidi Bashr & Alex; had beetles off the chaff bags crawling over me all night. The leave to Alex is cut out now so I must be thankful to \nget\n have got my week in; they are giving a week to Port Said instead. Wouldnt have Port Said on my mind after Alex; no comparison. Joe Woods is due home to night I am anxious to see Joe to see how he got on after I left there as he had some thing of special interest in view. Harold , Beuzeville, & Tom Sherry put in for the camel corp to day, can almost hope that Pom wont get in. Hes a good sort & I’ll miss the old sport if he goes – Tom sent &pound;2.0.0 with Joe Woods when he was coming to Alex to me, it was deuced thoughtful of him.\n","201":"\n\nHill 70\n\nSlowly pass the days, each like its mate. lifeless things. The nights are different change less enough, but theres a feeling about that takes them out of the common place. The boys group in tents & mess rooms, over cups of coaco at the Y.M. or a bottle of beer from the Wet Canteen & talk of all manner of things; they are more cheerful, not such a feeling of bally endlessness about it all as there is of the day. A bright cresent moon is floating quietly above the western horizon & the clouds about it are streaked with silver while a faint rosiness of the after glow still lingers, the stars are brighter than diamonds & the sky looks like black velvet, the crickets are chiruping & the boys laughing. At the table at the end of the mess, the boys are playing cards & there is a clink of money as it changes hands & the flip flop of the cards as they are dealt round; some curses & a laugh. Some one out side, is whistling Every bodys doing it & a horse blows its nose.\n","202":"\n\nHill 70\n\nI feel tired to night, a bit sore too, I was weak enough to agree to play a game of footer & its a bit to strenuous for my liking, I think croquet would be just about up to my weight now. Jack Reid was copped by the Police in Alex; The officer asked him his unit, \"A fighting unit, sir\" he answered. Tomo was telling me of one of the boy at the Kersaal one night, presented a bunch of flowers to an actress, saw another he thought looked nicer so took the bunch from the first & gave it to the latter. Godber & Gal are going into port Said for a week to morrow - they have to go in full marching order in case we move off before they get back There was a general inspection this after noon wonder if any thing is in the wind. Stacks of rumours afloat a gain about an early shift but no one knows whether its the sand or back the other way. Hats new tunics are to be issued in the morning also its pay day again to morrow. nothing like money to give one the glad feeling. Wish I was home\n","203":"\n\nHill 70 Sinai\n\nThe first Brigade passed here to day at dinner time on its way out. Goodness knows how far out they are going, expect that they are releaving the","204":" Bde. It will be our turn next I think though some seem to think it will be some time yet before we roll up blankets. I heard Jackson the officer’s cook going crook to-day, he was told that six officers of the first Bde were calling in for dinner & seventeen of them rolled up. Guess some one would have to go short. Im pretty sore on it. B sqd played A sqd footer this after noon, it was a hard match & they beat us three to nil. Reckon the exercise is doing me the world of good, I fed up a treat to night at tea & Barnes & I are going to give the Y.M. a call soon & sample their cocoa. \n\nI was on picquet last night & to day Im glad to get the duty in - I’ll have a few evenings to myself now. We have been issued with tunics & hats the tunics finish far to soon dont do down much below a chaps waist while the hats have a six inch brim.\n","205":"\n\nHill 70\n\nBrownie has the chair at the tent he is talking school & footer. The latter is booming here at present. A & B sqds played C.sqd this after noon, there was no score but it was a great game. C is squeking, a good sign. The horses are fresh though they dont look too good; usually when we are going to water about half a doz get loose. We were duty squadron to day & its not much chop, we had hardly enough men to take the horses out. I feel as much inclined to writing as flying; wish they would move us somewhere thought dont have any longing to go out El Arish way. There is talk of a move shortly but I dont think we will move out, fancy we’ll go the other way.\n","206":"\n\nHill 70\n\nWe had a very rude awakening this morning Was on leave in Port Said, I went down in spite of my assets being low as 30\/-, thought the spell in the rest camp would go alright any way, & so it did. I had all my meals in camp & slept there every night, so did it cheap, pictures, concerts, Y.Ms etc putting in the time in a mild way. Was sweetly slumbering at six this morning when the S.S.m. came along, roused us out & told us we had to imshie to our Reg by the 7.30 am train so here I am. Been packing up as we move off to the old desert & closer to Abdul to morrow.\n","207":"\n\nRomani\n\nWe hit up Romani at sun down just got our lines down by dark The place is deserted all the troops have moved out; Dew is falling at the rate of inch per hour, we’ll be drowned by morning.\n","208":"","209":"\n\nIm tired of I’s & We’s of this journal so am going to introduce a Lance-Jack to its pages, Woods says \"hes not a bad poor ----\" but Woods neither knows nor cares, he is a personal friend of mine how ever, & what I dont know about him no one else does, some of his doings are strictly censored of course but if theres any thing worth the telling Ill be in a position to gaurantee the truth of it. For convenience we’ll call the boy Jack, I could never stand those double names so guess he \nwould\n likes them no better than I do\n","210":"\n\nHod El Bayoud Out post\n\nFour of us on Observation post on top of a high sand hill. Theres an ocean of sand around us, & we can see for miles. There is not much to see, The camp a couple of miles away, a few horse men & a camel train, & the smoke from the Railway engine in the distance Away to the left with a thick haze over it lies the old sea. Theres a nice cool breeze blowing & the sun is just high enough to make things feel cosy. We have had three days tracking. Left Hill 70 Thursday morning, lobbed at Romani that evening Next day we came to some wells a bit past Oggratina on the Railway line then yesterday we got to the camp here & releived some Yeomanry. We had pleasant trip though it was cold at night but we always managed to get our blankets off the camels – its not to flash for tucker, we struck a canteen near our camp on Friday night & bought some fish which helped us along a bit, - I havnt had a decent wash this last three days, water has been scarce, had this morning’s \"clean my teeth’ & bath in half a pint of water. We stood to at 5.15 this morning & came away to this post at six, we had breakfast out here. We expect to be releived at 12 oclock.\n","211":"\n\nHod El Bayoud\n\nLast night we were out on \nobservation\n Out Post; It was cold; I did not get warm until the sun rose after my shift. had a bit of bad luck too, we divided the time up into 1 hr 50 min shifts but had no watch so had to depend on the chaps on horse picquet at the foot of the hill about 40 yds away. They made a bloomer in the time & I didnt hear the whistle so the result was I did four hours & five minutes before I woke the next shift, - Joe Woods was a very disapointed man this morning when he woke to find that his shift was already done. The flies are terrible crook here, one would think that any decent self respecting fly would die these cold nights but these chaps come along as sure as the sun as lively & inquisitive as ever. The sand hills are very steep, & it is no uncommon sight to see a horse with the saddle girths round his flanks & his rider taking a sort of back seat. I was embarrassed in this way coming back from water on the morning of the 25th at Oggeratina – Dick sighted some camels & thought he was going to be grabbed so went at the hill like as if the old chap was after him. No doubt Dick thought he was & I slid out of the saddle just in time to keep from sliding over Dicks tail. Had quite a gay 2minutes\n","212":"\n\nBayoud\n\nI had a horrible feeling I was going to be warned for stable Picquet last night but I missed & Tom Sherry went on, & at 6.30 I had my bed made down in my bivvie & was well on my way to dreamland. I could hardly beleive it this morning when Perce went round making that beastly \"stand to\" noise at 5.15. Ten hours is a fair go any way so I could’nt grumble. I was sent down on pump fatigue after breakfast & felt that I had some thing against the cooks for being so late with breakfast as he had to break off eat ing to suddenly for his liking & saddle up & go to the pump. The wells are over half mile away. A sqad men did not turn up so he had a bit more exercise on the pump handle than I cared about then I drew to see who would releive the chap for dinner & lost so thinks I have had a crook morning\n","213":"\n\nBayoud\n\nA nice quiet afternoon at the wells yesterday where I took the opportunity of having a bath. I came back to the bivvie expecting to go on duty but though I gave a bit of cheek to the Sergeant so as to know my fate; no warning was forth coming so I put another 10 hours in the blankets to my credit. Ive been reading a book called \"Set in Silver\" just a bit of a love yarn with descriptions of old English scenery. I remarked on the contrast between the cosy \"Inns\" green hills & homeliness, & the airiness of my bivvy, the old grey sands & the utter desolation of this Sinai. Still even this place has a way (cant call it charm) of its own; especially at night; with its velvet & star bright sky, when the camels which may happen along bearing the rations & stuff seem weired things like ghosts out of the Arabian nights. There was a mail in, I was disgusted that I should only receive one letter, Johno received two parcels & thanks to him we had a decent midday meal. White bait & plum duff, otherwise it would been bread with a limited supply of marmalade\n","214":"\n\nBayoud\n\nI struck picquet last night; I did first shift so the duty was’nt too severe as I finished my shift at 11.20. It was with a sort of feindish delight that I hauled long Sam out of his warm bed to releive me & it was nice & comforting to think of him out in the cold while I was turning in to my snug nest. Theres a squeaky little bird dancing round in front of my bivy just now he is doing well on flies & he ought to get fat the perky little beggar, for there are plenty I wish he would bring all his cobbers along & clean the lot up.\n\nTime \n3.30\n I was sent out to no 2 observation post this afternoon, Thommo & I took first shift, he was telling me some yarn when we heard the Burr Burr of an Areoplane - we looked & could see nothing & thought we might have been mistaken but just as he started on his yarn again we heard the \"Burr\" once more & after looking a while we \"picked her up\" a white bright spec high in the blue; we put our glasses on her & though not sure of her identity we had our suspisions that she was a Taube. these were justified 2 mins later when she turned her body glinting in the sun, & showed the black crosses on her wings, just then she moved over the camp & we heard several explosions but there was no damage done – I think she scooted off to wards the East\n","215":"\n\nBayoud\n\nI’ll do a bit of scribbling to use up the last bit of light left to the day, its a grey evening, quite exceptional here & the crescent moon usually so bright just has an occasional dim glimpse of us. Ive had a lazy day been reading all the day. Buezie came in with a \"wire\" to the effect that El Arish was to be taken shortly & the Light horse would then shift to a \nnew\n front, The \"tale\" is so old that it ought to be sung to the tune Annie Laurie or some thing of the like. Harold has had a most wonderful excess of energy lately, He & Mc have clipped all the troop horses, they finished up today with the aid of the machines.\n","216":"\n\nBayoud\n","217":"\n\nBayoud\n\nWho would ever think of to day being Sunday – At this time in the cities the church bells will be chiming, calling the folk to evening service; but here however its as any other day. the strains of ‘Yip Yaddy are wafted along in squeaky from an old accordian in A Squadron whiled own nearer some one is singing \"In the gloamin\". I was on out post last night, it was cold, Im glad we got issued with a extra blanket to day also a cardigan jacket each\n","218":"\n\nBayoud\n","219":"\n\nBayoud\n\nIve had to officiate in the humble but necessary office of mess-orderley to-day, needless to say I dont feel at home at the job, when I get I feel the soldiering is a messy crook job to say the best of it. Im never at my best when on as M.O. To night Ive struck picquet; I dont mind it half as much; its funny why a chap can feel happy feeding & looking after horses while to dish out tucker to men he should feel the reverse. Its a beautiful night the moon makes light enough to read by, every thing has that blue look about it like in the scene called the \"Kingdom of the Future\" in \"The Blue Bird\" – A company of the Camel Corps is camped near us, they are going out on a stunt; one almost envies them, when one compares the amount of work they have with the Camels to what we have with out neddies – They watered to day & dont water any more for three or four days, they have six men on picquet for all the company 130, we have 12 for the squadron 150 horses. But I dont know - I like the old horses, hanged if I can feel any affection for the blamed camel. There is talk of B squadron going out on a stunt on Thursday. I wonder if we will. Some say that we are to move right out on the tenth. We all got another dose of cholera innoculation, a chap will be full of germs.\n","220":"\n\nBayoud\n\nI was on out post last night. two nights duty in succession. This morning A squadron went out to cover the retreat (if need be) of the cameloes who were having a look at Abduls possie in the Blue Hills. This after noon I was on observation – I was glad for it means that I have to night off & the blankets feel bosker I must say. There was a Field PC from Bert, dated 11 Nov so the boy is still going strong I am pleased to see. there was also a paper from Victoria & another from Wollongong. Yesterday I drew &pound;1.0.0 its handy as we some times strike a canteen \nWe’ve been --\n \n\nLater - Ive heard that neither the Camel men or A Sqd saw any thing while on the stunt\n","221":"\n\nBayoud\n\nI was waked up this morning from a sweet sleep by Sullys circular-saw- voice murmering Stand-to & very reluctantly crawled out of the blankets & donned the bandolier & Bayonet. Whew its cold these mornings, & bed is beautiful – Spurway came to light with some steak which he had saved from last night, it went well for breakfast, later as I was writing he brought down some nuts & lollies from his parcel for me to sample, Gal did likewise when he got home, & for tea he cut the cake from his parcel; its unfortunate that a tin of Kiwi was put in the same parcel as it certainly did not improve the flavour of the cake, Spurway said it reminded him of Joe Gardiners Boot Store. This evening 30 Reeoes came with 30 horses. The horses were not a very classy lot, there was some fun when the sergeants were picking them. Barnes came with his lot, they stuck him on Picquet to night. Gal tells of a mail at El Hassanya & a lot of gift stuff for the Regiment. I was reading of a conscription meeting at Newtown, Im glad Im not from there, theyre a poor cold footed mob - Three cheers for the Kiaser, I reckon that s the deadliest limit.\n","222":"\n\nBayoud\n\nPerce forgot to warn the men for observation posts this morning, so we had a bit of hurry up at stand to when he told us we had to go out. We took our quarts with us & boiled them out there & with the aid of a tin of bully bread & marmalade & a cake of Spurway’s we made a pretty decent breakfast. We sighted King’s Patrol about 10 o clock & got into communication with him, he reported firing East of , so Smithy flashed the message along to the camp. Later we heard the deep engine note of a taube it hove into sight flying high as usual, keeping south of the camp & making West. He flew almost directly over the post I was on, we heard the crackle of his Luis gun at the camp & I took a couple of pots at him. One would have thought that the shots had scared him for he wheeled his machine about & went back for his life the way he came.\n","223":"\n\nBayoud\n\nNothing doing today, just mooned about the bivvies reading & swearing at the flies which all ought to be dead at this time of the year but are with us in their millions. Woods tells me that rumour says that cables have come through to the effect that there is more trouble in Australia. I wonder what it is this time. Some one said something about Japan having a row with Russia that would be serious, but I dont beleive it, still the very thought brings in its train thoughts of the possibilities if such a thing was to happen & gives a chap the creeps fair; but theres no doubt it would bring the mob back in Australia to the \"Shun\" with a click. The Allies have a very black out look just now it seems to me. I reckon things never looked worse; then Aussie us down, sort of culls us damn fools for being here; it makes me feel sick.\n","224":"\n\nBayoud\n\nYesterday I was on gaurd up at the Regimental store, The gift stuff was given out, it did not amount to much. A peice of cake, half a dozen lollies each & two bottles of sauce & a tin of fruit for the section was our whack. We got the second dose of Cholera innoculation stuck into us yesterday & to day my arm is a bit sore This morning I went down to the wells, did a bit of washing & had a bath, thats a good morning’s work to my credit\n","225":"\n\nTo day Johno & I had our first shave since we left Hill 70. The adjutant was our nemisis other wise our beards might have grown until the birds started to build. Any way we got Charlie May to bring along his camera to see whether it would stand the shock our dials would give to its observing eye. Tomorrow we arise in the \"Still small hours\" & move off on a days stunt as support to the camel corps who are paying Abdul a surprise visit, I dont expect there will be any stouch, still a clean rifle wont be amiss. Capt Ryrie went very \"cold\" on the squadron this morning be cause when the ammunition returns went in they showed an enormous shortage; a lot of the chaps had neglected to bring the 60 round (extra) per man. He said some very rude things & I was glad I had brought the stuff along.\n","226":"\n\nBayoud\n\nYesterday morning at 3.0 clock we were turned out & saddled up, at least A & B troops did & at four oclock we moved off East, we went out about 13 miles to Zagadan & waited there until three in the after noon until the Camel corps who were making a raid on a Bedioun camp had signalled \"All clear\". I rode \"Paddy\" who is not doing much work & spelled Dick who got over the rope & his heels. Some more reinforcements came in yesterday & A troop got two. Last year this night I was getting ready to emshie from Anzac. Ill not forget that night. The work loading the barge & wondering all the while why \"Beechy\" didnt try to find us\n","227":"\n\nI was on out post, it was a cold night, but beautiful as every night is here, never the less my bivvy sheet was wringing wet with dew this morning. It was a fool of a post we were on surrounded by hills, Abdul could creep right up to it unnoticed, while the horses make noise enough to make our where abouts known to a radius of half a mile at least. The Transports with their limbers arrived last night Kicking up the deuce of a row – I was pleased to see Fiskies smiling old dial this morning as we came in past their camp.\n","228":"\n\nBayoud\n\nPerce Barrow & 8 of the troop went out on a patrol to Ruesatt 5 or 6 miles out East. I was with Parky, we had a very quiet & pleasant day. The boys were nearly all on out Post when we got back & before we had tea it was dark. These days are beautiful; there is much more colour about now. The skys are blue, & clouds white & fleecy, the sand has lost its glare & looks a soft greyish white; the mornings & evenings come & go attended with rich colour, not like Gallipoli with its glorious blaze at the rising & setting of the sun but quiet rich beautiful colour. Just the difference between wild mountain scenery & quiet green grassy paddocks with sheep & cattle grazing.\n","229":"\n\nRuesatt\n\nLast night after I had myself nice & comfortable in my bivvy & had got the blankets curled around me to my satisfaction, lit a fag which I tried vainly to imagine was not an \"issue\" one, & settled myself to a couple of hours perusing one of Jacobs enlightening works; I heard Perce’s voice shouting \"A troop\"! I cocked my ear despondently & heard the warning \"Is to be ready to move off on patrol to Ruesatt, two feed for man & horse at 5.45 in the morning\" so I had to \"turnout\" & collect some bully, tea & sugar, feed etc for the start off in the morning; And here we are. We have boiled the quarts & have had breakfast, Perce was elated at his quart being the first to come to the boil, & gave evidence of the fact but it got up-set so his elation passed from him to the rest of the troop & I heard some one quote from the scripture the words – \"He that was first shall be last\". The Signallers are perched on top of the hill which bears the name the rest of us are in a hollow with the nags, Most of the boys are busy with bridge & \"500\".\n","230":"\n\nBayoud\n","231":" Day; Cool & beautiful it was this morning. The boys had a bit of sport racing down a hill & over the sand for a . Red mond won it The onlookers had the sport though a half a dozen fell & rolled down the hill. We had a good tuck in for dinner Duff & fruit & cold meat It rained during the afternoon, a good heavy shower & it looks rainyfied yet The thunder is growling & lightening flashing, a big change to the usual tranquil weather – El Arish has been taken & some turks captured There was practically no fighting, no details to hand yet however.\n","232":"\n\nBayoud\n\nI took warning from the little demonstration the elements gave us yesterday afternoon & fixed my bivvy sheet up accordingly. It was lucky I did so as at lights out it came on to rain properly & continued on at more or less frequent intervals through the night. I was nice & comfortable & it was rather pleasant than other wise to hear it pelting down. All were not so well off. Brien settled down as per usual & when the rain came on he sat hunched up in a corner of his bivvy, he moved after a while & a wrinkle of blankets which had caught a good deal of water straightened out & sent the water under neath his shirt. \n\nBrien was saying \"Ferdie? (Ferdie was on picquet) \"Ferdie? Is it breaking yet? Why did nt you give me warning about it\" now Im all wet\". This morning Brien grabbed his sox, they were wet, he got a brand new pair put them on, jammed a boot on it was half full of water; & to finish up grabbed his hat in a hurry, he was late, put it on, got his head wet, his hat was half full of water too. Tom Sherry scooped out a possie outside went to bed, the rain ran in & about him & he had a bath, had to change in the rain & make his bed over again, this time on high ground\n","233":"\n\nA troop was on out post last night; I was out with Perce Barrow, a murky looking evening it was too We went out to \"Lizzie\". It came on to rain just after eight just as Spurway releived me to do first shift, I found that it takes practice & patience to get into blankets while its raining with out getting wet; I got myself & water proof pretty well damp while turning in & though I was warm enough I felt uncomfortable & didnt get much sleep all night. This morning the blankets weighed a ton, they were soaked & I was pleased indeed to see the sun come out nice & bright, giving us a chance to get our blankets dried. It remained fine all day but I hear a rumble of thunder so would’nt be surprised if we have a shower again to night. \n\nA Squadron went to Ruesatt & Zagadan to day so B sqd is on out post again to night, Im not on thank goodness, will strike duty to morrow night & the next night I expect Vague rumours of the fighting come to hand now & then, It appears that the first & third Brigades charged & took some concrete trenches at the point of the bayonet out past El Arish but they did not stay in position as they were not strong enough to hold it. 1300 prisoners were taken during the whole of the fighting.\n","234":"\n\nRuesatt\n\nWell its the beginning of another year & a queer old start it is. I came out here this morning with Perce Sherry & a few others on a patrol. Its a wretched day, cold & windy, the sand cuts ones eyes out – Bill Talford & I made a billy of soup with a couple of peasoup sausages – it was just the thing but dinner was not exactly a success as there is too much sand blowing. We tried a game of bridge but between wind & sand we had a rough spin & had to turn it in – I wonder what this year will bring? its sure to be eventful; not many would be game to profecy where or how we will be situated next New Year. I sincerely hope we will be away out of the Sinai sands before then. I think we will.\n\nBayoud 6 pm\n\nWhat a day its been to be sure, if to day is a sample of the year, then 1917 will be a corker. The desert has been turned back to front to day, the hills with straight backs to the south have straight backs to the north now & curves to the south. The track was obliterated for our return, our eyes & faces were cut with the sand, it was murder. The camp looks like as if there had been a snow storm over it, its all covered with fresh white sand\n\nI cleaned my bivvie out & got the sand out of it, shook the blankets & made it tolerably wind proof . Then I made my bed. Spurway & I had tea on bully & bread & marmalade, ¾ loaf bread, 1 tin bully & ¾ tin marmalade. The wind has not blown away our apatites thats one thing- Im comfortable now tucked in the blankets with my feet stuck in a long mail bag which I pinched. This is verily the life What a bosker New Year!\n","235":"\n\nThe year has not improved a scrap, wind & rain & duty, Patrol monday, Observation post Tuesday, picquet Tuesday night & all day Wed, then out post at night, & did’nt it rain, blankets got wet & I couldnt dry them to day, have to go one short to night, orders to put an extra one on the horse. Wet blankets to sleep in its Bosker. Last night A squadron went out after some Beduions, I heard some shots while on out post last night. They made a small capture. Brien again hurt his back yesterday & had to be taken away to day he seems pretty crook, cold as north pole\n","236":"\n\nThe weather is treating us better now, this last couple of days have been perfect. Sunday night we were on out post. I was tired as I had spent the day building a new rain proof bivvy, its some class too. Friday last I went to Ruesatt again, had a good time this occasion, when we got back the lines were shifted to the foot of the hill, a better place for the nags, but there was much gnashing of teeth as all the bivvies of the squadron had to be shifted except Gal’s, Johno’s & mine & some of the boys had made some beauts. Thomo had built a bonza & was telling us as we went to Ruesatt how comfortable it was, he had only spent one night in it, he had to shift next day The moon was bright Sunday night so we played cards until it was time to feed the nags, it was a cold clear night & we saw a slight frost in the morning. I received a letter from Bert yesterday, he has been made a Corporal for some good work in an emergency so thats good for the old sport.\n","237":" Bayoud\n\nWe heard yesterday that Rafa had been taken by us & also 4000 prisoners, our casualties about 700 no particulars. We expect a move out shortly now. I have been having a sort of washing & mending day to day; getting ready for the track\n","238":" Bayoud\n\nIt calmer to night but weve just been treated to three or four days of a blow & its been deuced unpleasant. Last night Brownie brought back a \"hot\" wire from Ber El Abd to the effect that Peace had been declared, of course its bosh but its the first time any one has had the audacity to broach this one so I had to record it\n\nBayoud\n","239":"\n\nLast night went on gaurd. Col came home late roaring a treat & overheard him say that we were to shift. To day things moved some. Men have already left for Hassaniya & we are to move tomorrow morning. A Reg of Yeomanry & 3 sects Camel corps are releiving us, twice as many men to do the work as we have.\n","240":" Hassaniya\n\nSince Sunday we have been here, three windy sandy days. I have got a bosker bivvy though & can defy wind rain or sand; We were supposed to stop here for several weeks but word came through to day that we are shifting again on Friday to out post El Arish\n","241":"\n\nOn Friday we pulled out from Hassaniya & took the track about 2.30 or 3.0 we camped near a place called . Saturday we came along to Marza. What a difference from when we saw it last on","242":" the Turks were in possession then & tried to be nasty Now the rail way runs through on its way to Al Arish & theres is quite a big camp. Y.Ms & Canteens. We shifted our camp about ½ a mile yesterday. I dont think we will be here long rumour says we shift on Thursday.\n\n"}}