{"Document Name":{"0":"Diary_0346","1":"Diary_0346","2":"Diary_0346","3":"Diary_0346","4":"Diary_0346","5":"Diary_0346","6":"Diary_0346","7":"Diary_0346","8":"Diary_0346","9":"Diary_0346","10":"Diary_0346","11":"Diary_0346","12":"Diary_0346","13":"Diary_0346","14":"Diary_0346","15":"Diary_0346","16":"Diary_0346","17":"Diary_0346","18":"Diary_0346","19":"Diary_0346","20":"Diary_0346","21":"Diary_0346","22":"Diary_0346","23":"Diary_0346","24":"Diary_0346","25":"Diary_0346","26":"Diary_0346","27":"Diary_0346","28":"Diary_0346","29":"Diary_0346","30":"Diary_0346","31":"Diary_0346","32":"Diary_0346","33":"Diary_0346","34":"Diary_0346","35":"Diary_0346","36":"Diary_0346","37":"Diary_0346","38":"Diary_0346","39":"Diary_0346","40":"Diary_0346","41":"Diary_0346","42":"Diary_0346","43":"Diary_0346","44":"Diary_0346","45":"Diary_0346","46":"Diary_0346","47":"Diary_0346","48":"Diary_0346","49":"Diary_0346","50":"Diary_0346","51":"Diary_0346","52":"Diary_0346","53":"Diary_0346","54":"Diary_0346","55":"Diary_0346","56":"Diary_0346","57":"Diary_0346","58":"Diary_0346","59":"Diary_0346","60":"Diary_0346","61":"Diary_0346","62":"Diary_0346","63":"Diary_0346","64":"Diary_0346","65":"Diary_0346","66":"Diary_0346","67":"Diary_0346","68":"Diary_0346","69":"Diary_0346","70":"Diary_0346","71":"Diary_0346","72":"Diary_0346","73":"Diary_0346","74":"Diary_0346","75":"Diary_0346","76":"Diary_0346","77":"Diary_0346","78":"Diary_0346","79":"Diary_0346","80":"Diary_0346","81":"Diary_0346","82":"Diary_0346","83":"Diary_0346","84":"Diary_0346","85":"Diary_0346","86":"Diary_0346","87":"Diary_0346","88":"Diary_0346","89":"Diary_0346","90":"Diary_0346","91":"Diary_0346","92":"Diary_0346","93":"Diary_0346","94":"Diary_0346","95":"Diary_0346","96":"Diary_0346","97":"Diary_0346","98":"Diary_0346","99":"Diary_0346","100":"Diary_0346","101":"Diary_0346","102":"Diary_0346","103":"Diary_0346","104":"Diary_0346","105":"Diary_0346","106":"Diary_0346","107":"Diary_0346","108":"Diary_0346","109":"Diary_0346","110":"Diary_0346","111":"Diary_0346","112":"Diary_0346","113":"Diary_0346","114":"Diary_0346","115":"Diary_0346","116":"Diary_0346","117":"Diary_0346","118":"Diary_0346","119":"Diary_0346","120":"Diary_0346","121":"Diary_0346","122":"Diary_0346","123":"Diary_0346","124":"Diary_0346","125":"Diary_0346","126":"Diary_0346","127":"Diary_0346","128":"Diary_0346","129":"Diary_0346","130":"Diary_0346","131":"Diary_0346","132":"Diary_0346","133":"Diary_0346","134":"Diary_0346","135":"Diary_0346","136":"Diary_0346","137":"Diary_0346","138":"Diary_0346","139":"Diary_0346","140":"Diary_0346","141":"Diary_0346","142":"Diary_0346","143":"Diary_0346","144":"Diary_0346","145":"Diary_0346","146":"Diary_0346","147":"Diary_0346","148":"Diary_0346","149":"Diary_0346","150":"Diary_0346","151":"Diary_0346","152":"Diary_0346","153":"Diary_0346","154":"Diary_0346","155":"Diary_0346","156":"Diary_0346","157":"Diary_0346","158":"Diary_0346","159":"Diary_0346","160":"Diary_0346","161":"Diary_0346","162":"Diary_0346","163":"Diary_0346","164":"Diary_0346","165":"Diary_0346","166":"Diary_0346","167":"Diary_0346","168":"Diary_0346","169":"Diary_0346","170":"Diary_0346","171":"Diary_0346","172":"Diary_0346","173":"Diary_0346","174":"Diary_0346","175":"Diary_0346","176":"Diary_0346","177":"Diary_0346","178":"Diary_0346","179":"Diary_0346","180":"Diary_0346","181":"Diary_0346","182":"Diary_0346","183":"Diary_0346","184":"Diary_0346","185":"Diary_0346","186":"Diary_0346","187":"Diary_0346","188":"Diary_0346","189":"Diary_0346","190":"Diary_0346","191":"Diary_0346","192":"Diary_0346","193":"Diary_0346","194":"Diary_0346","195":"Diary_0346","196":"Diary_0346","197":"Diary_0346","198":"Diary_0346","199":"Diary_0346","200":"Diary_0346","201":"Diary_0346","202":"Diary_0346","203":"Diary_0346","204":"Diary_0346","205":"Diary_0346","206":"Diary_0346","207":"Diary_0346","208":"Diary_0346","209":"Diary_0346","210":"Diary_0346","211":"Diary_0346","212":"Diary_0346","213":"Diary_0346","214":"Diary_0346","215":"Diary_0346","216":"Diary_0346","217":"Diary_0346","218":"Diary_0346","219":"Diary_0346","220":"Diary_0346","221":"Diary_0346","222":"Diary_0346","223":"Diary_0346","224":"Diary_0346","225":"Diary_0346","226":"Diary_0346","227":"Diary_0346","228":"Diary_0346","229":"Diary_0346","230":"Diary_0346","231":"Diary_0346","232":"Diary_0346","233":"Diary_0346","234":"Diary_0346","235":"Diary_0346","236":"Diary_0346","237":"Diary_0346","238":"Diary_0346","239":"Diary_0346","240":"Diary_0346","241":"Diary_0346","242":"Diary_0346","243":"Diary_0346","244":"Diary_0346","245":"Diary_0346","246":"Diary_0346","247":"Diary_0346","248":"Diary_0346","249":"Diary_0346","250":"Diary_0346","251":"Diary_0346","252":"Diary_0346","253":"Diary_0346","254":"Diary_0346","255":"Diary_0346","256":"Diary_0346","257":"Diary_0346","258":"Diary_0346","259":"Diary_0346"},"Date":{"0":"unknown","1":607.0,"2":755.0,"3":756.0,"4":757.0,"5":758.0,"6":759.0,"7":760.0,"8":761.0,"9":762.0,"10":763.0,"11":764.0,"12":765.0,"13":766.0,"14":767.0,"15":769.0,"16":770.0,"17":771.0,"18":772.0,"19":773.0,"20":774.0,"21":775.0,"22":777.0,"23":778.0,"24":779.0,"25":781.0,"26":782.0,"27":783.0,"28":784.0,"29":785.0,"30":786.0,"31":787.0,"32":788.0,"33":789.0,"34":790.0,"35":791.0,"36":792.0,"37":795.0,"38":796.0,"39":797.0,"40":800.0,"41":801.0,"42":803.0,"43":806.0,"44":807.0,"45":809.0,"46":810.0,"47":811.0,"48":812.0,"49":813.0,"50":814.0,"51":815.0,"52":816.0,"53":818.0,"54":820.0,"55":822.0,"56":823.0,"57":824.0,"58":825.0,"59":826.0,"60":828.0,"61":830.0,"62":832.0,"63":833.0,"64":834.0,"65":835.0,"66":836.0,"67":837.0,"68":838.0,"69":839.0,"70":840.0,"71":841.0,"72":842.0,"73":843.0,"74":844.0,"75":845.0,"76":847.0,"77":848.0,"78":849.0,"79":850.0,"80":852.0,"81":854.0,"82":855.0,"83":857.0,"84":860.0,"85":861.0,"86":862.0,"87":863.0,"88":864.0,"89":865.0,"90":868.0,"91":871.0,"92":872.0,"93":873.0,"94":875.0,"95":877.0,"96":880.0,"97":883.0,"98":885.0,"99":887.0,"100":889.0,"101":891.0,"102":893.0,"103":894.0,"104":897.0,"105":898.0,"106":899.0,"107":901.0,"108":903.0,"109":904.0,"110":905.0,"111":906.0,"112":907.0,"113":908.0,"114":909.0,"115":910.0,"116":912.0,"117":913.0,"118":915.0,"119":916.0,"120":917.0,"121":919.0,"122":920.0,"123":921.0,"124":922.0,"125":923.0,"126":924.0,"127":925.0,"128":926.0,"129":928.0,"130":930.0,"131":931.0,"132":932.0,"133":933.0,"134":934.0,"135":936.0,"136":937.0,"137":938.0,"138":939.0,"139":940.0,"140":941.0,"141":942.0,"142":943.0,"143":944.0,"144":945.0,"145":946.0,"146":947.0,"147":948.0,"148":949.0,"149":950.0,"150":951.0,"151":952.0,"152":953.0,"153":954.0,"154":955.0,"155":956.0,"156":957.0,"157":958.0,"158":959.0,"159":960.0,"160":965.0,"161":968.0,"162":969.0,"163":970.0,"164":971.0,"165":972.0,"166":974.0,"167":976.0,"168":977.0,"169":978.0,"170":979.0,"171":980.0,"172":981.0,"173":983.0,"174":984.0,"175":985.0,"176":986.0,"177":989.0,"178":991.0,"179":993.0,"180":995.0,"181":996.0,"182":997.0,"183":998.0,"184":1000.0,"185":1001.0,"186":1004.0,"187":1005.0,"188":1006.0,"189":1007.0,"190":1008.0,"191":1009.0,"192":1011.0,"193":1012.0,"194":1013.0,"195":1014.0,"196":1015.0,"197":1016.0,"198":1017.0,"199":1018.0,"200":1020.0,"201":1021.0,"202":1023.0,"203":1026.0,"204":1029.0,"205":1031.0,"206":1034.0,"207":1035.0,"208":1036.0,"209":1037.0,"210":1038.0,"211":1040.0,"212":1042.0,"213":1043.0,"214":1044.0,"215":1045.0,"216":1046.0,"217":1048.0,"218":1051.0,"219":1052.0,"220":1053.0,"221":1055.0,"222":1056.0,"223":1057.0,"224":1058.0,"225":1059.0,"226":1061.0,"227":1064.0,"228":1065.0,"229":1066.0,"230":1067.0,"231":1069.0,"232":1070.0,"233":1077.0,"234":1078.0,"235":1079.0,"236":1081.0,"237":1083.0,"238":1085.0,"239":1087.0,"240":1089.0,"241":1091.0,"242":1094.0,"243":1095.0,"244":1098.0,"245":1100.0,"246":1101.0,"247":1103.0,"248":1104.0,"249":1105.0,"250":1106.0,"251":1107.0,"252":1108.0,"253":1109.0,"254":1110.0,"255":1111.0,"256":1112.0,"257":1113.0,"258":1114.0,"259":1115.0},"Entry":{"0":"\n\n","1":"\n\nDear Nell,\n\nI enlisted today and I have bought this book to make a diary, during the time I am away at the front.\n\nI hope to get away soon for I am going into camp straight away, so I intend to start it off the day I sail, so that, from that day on you will have an account of what I did in the Great War.\n\nYour loving Brother\n\nHarry \n\n \n","2":"\n\nI have been waiting five months or thereabouts for the day that I would open up this diary; but today I make a start.\n\nMy company, the","3":" Reinforcements of the","4":" Battalion left Liverpool Camp at 2 P.M. From the Central Station, we march in procession through the streets to the Domain. There were great crowds in the streets and the fellows made a good show. We were reviewed in the \"Domain\" by the Governor and Major General McCay. Then we marched out to the Agricultural Ground where we are to camp the night as we will not embark till tomorrow morning. General leave has been granted till10 P.M. \n\n \n","5":"\n\nWe left the Agricultural Ground early. Special trams conveyed us to Circular Quay. My company was embarked by 7.30 A.M. No one was missing, but we were one man too many, he was put off. It was hard on him after training in the company for five months. The ship is the Orient Liner, \"Osterly\"; we are lucky to get such a fine boat. All the troops were embarked by 10 A.M. then the people were allowed on the wharf. As the ship drew away from the Quay we broke hundreds of ribbons with the people ashore, and there was much cheering, all the chaps were in great spirits. The ship anchored in the stream till she got her clearance; and there was much crowing by the ferry boat whistles. We cleared the Heads so after 1 P.M. We are away!\n\n \n","6":"\n\nA quiet Sunday and we are shaking down into our new home. Am comfortable enough, I’m with a lot of fine chaps. My company has for officers.Leiut Taylor.O.C.,Leiut Lacy, Lenahan, & Prescott, rather decent fellows. Our quarters are on the lower deck. The mess tables occupy both sides of the deck, in the middle are the hammock racks. We sleep in hammocks suspended from the beams above. There are 16 at my mess table, it is numbered, and our rations are portioned and served to mess orderlies at the \"galley\" amidships. \n\nAs the \"Osterly\" is carrying passengers we are rather cramped for deck space, for the promenade decks are reserved for them. The sea is quite calm.\n\n \n","7":"\n\nArrived at Port Melbourne at 8 A.M. Some one releived me of most of my money. Have heard this is a common nuisance on troop ships. General leave granted. I went out to North Melbourne to see Holdsworth. Found him at home and we had a jolly day of it; you bet I enjoyed being in my home town. There was some disturbance in the city; as I was returning to the ship about midnight I got into a rather a boisterious crowd. I don’t know what it was all about but some misguided burst of patriotic enthusisiam I believe. Anyway a couple of the fellows at my table received cracks over the head from policemen’s batons. I returned to the ship alright.\n","8":"\n\nThere was no leave today. Because some of the fellows were detained by the police in the city last night. I reckon that the \"John Hops\" made a mark of our fellows because they were conspicuous with N.S.W. pencilled on their hat bands. The Governor of Victoria, Sir. A. Stanley came onto the ship and delivered an address. The usual rot about, \"heroes going to fight.\" But they stop their leave because they get drunk. Holdsworth came down onto the pier and I was allowed to get off the ship to speak to him, and tell him good-bye. There was quite a crowd on the pier to tell us good –bye when the ship left the pier at 6 P.M. and anchored in the channels. We are not likely to get into mischief here. \n","9":"\n\nThe \"Osterly\" sailed at 3.30 P.M. We passed Queenscliff and Pt Lonsdale about sunset and I was able to get a good look at the old beach were we used to play when we were kiddies. I saw our old home quite plainly, the sight of that little old house where I was born woke a lot of memoires. We dropped the pilot onside the \"Rip\" just as the sun went down, rather a thrilling spectacle for there was rather a heavy swell on.\n","10":"\n\nMal-de-Mer has claimed many victims today. There is a heavy sea running. I have had no indication of sickness as yet but I am thoroughly enjoying this trip. \n","11":"\n\nGot to Port Adelaide at 6 A.M. A splendid wharf here. We were allowed ashore to play cricket and football. I walked a couple miles to the city and had a look around. Managed to get a ride back to the ship at Port Adelaide on a goods train. Adelaide strikes me as a pretty little city, must get a better look at it some day. The ship sailed at 5 P.M.\n","12":"\n\nGood weather and a smooth sea; so we had fire drill today. Everyman was allotted his position in the boats and detailed to his fire station. Then a blast on the steam siren and a furious ringing of the ship’s bell was the signal to get a life belt and get into position.\n\n \n","13":"\n\nThere was a church parade this morning. The service for Australian soldiers on Active Service is beautiful. The \"bight\" is unusually calm passed a steamer sailing parallel to our course.\n","14":"\n\nRaised the land again at 9 A.M. this morning, a view of bare, forebidding cliffs and blue hills in the distance. Was detailed for guard duty today; I have to stand at the forward companion ladder and keep the common troops off the promenade deck. Was on post when we rounded Cape Leewin, at 9 P.M. The sea was very rough there, and the ship was rolling a treat. There is a splendid light on the Cape; its flash must have been visible, 40 miles.\n\n \n\nArrive in Fremantle at 6 A.M. General leave till 3 P.M. I had a look round Fremantle; a music shop was afire, and about 50 of the boys, rushed in and rescued all the stock. Musicians came forward to play the instruments as they lay in the street; so we had a concert for half and hour till the place was extinguished by the fire brigade I slipped on board a train and rode up to Perth. Just had a look round, then returned to the ship. She sailed at 5 P.M. and by sun set we had seen the last of Australia; quite a crowd watched her sink down below the horizon. Nicholson’s the music people, presented my company with a \"Zonophone\" and records and it is alright. It was a piece of salvage from their shop. \n","15":"\n\nThe Indian ocean must be some place if we are to plough thro’ it for the next 9 days before we get anywhere. Was paid 10\/- today. The comforts fund bought us cigarettes, tobacco & chocolate. Calm sea.\n","16":"\n\nWe are well settled aboard here now. Have half an hour’s physical jerks before breakfast. Then about five hours light drill signalling, etc. during the day. The sea keeps wonderfully smooth, just like a pond.\n","17":"\n\nThere are preparations for a sports carnival. Each company will enter a team for the different events. A boxing tournament was conducted this evening. The ring being the hatch on the \"after\"well deck. The boxing was a very fair display. \n\n \n","18":"\n\nI’m mess orderly today; I have to report to the \"galley\" four times during the day to draw the tucker for the chaps at my mess table. There is plenty of food on this ship and it is good. For example; todays menu – Breakfast. Porridge (know to troops as \"burgoo\") Fried Meat Balls and Potatoes. \nDinner\n Soup. Roast Mutton & 3 kinds of vegetables. Stewed Fruit & rice. \nTea\n Bread,Butter & Jam. Supper 9 P.M. Biscuits and Cocoa. Cheese. The orderlies are responsible for the cleanliness of the troop deck. As there is oceans of hot water everything is thoroughly scrubbed. General inspection by the Commander of the ship every morning at 11 A.M. It is very sultry down between decks tonight many of the fellows are going to sleep on the main deck. I am right along side a porthole and can get a breeze if I leave it open.\n\n \n","19":"\n\nAnother sultry day, the sea is oily calm and the ship is making good time. We cannot be far from the \"line\" now. Met Viv Haswell today had a long yarn with him.\n","20":"\n\nI was picked for guard again today but managed to get out of it. Never did a tap all day. Saw a real tropical shower this afternoon, the scuppers ran with water. There was another issue of Cigarettes, etc\n","21":"\n\nThe company tried to do bayonet fighting, but 9\/10ths of ‘em were over with sea sickness or laziness, all the afternoon. A great concert was held by the passengers. The show was a good one, for there were one or two professional performers.\n\n \n","22":"\n\nI watched the sun rise over the Island of Ceylon. A gorgeous sight. The ship entered the Colombo breakwater at 6 A.M. We got aboard lighters & were towed to the landing stage. I went round the town in Ricksa, a sort of light cart drawn by a large buck nigger. I visited the barracks, and saw the principal buildings; it strikes me as an interesting place; would like to spend a week here. I saw a very fine regiment of Indian troops in the Barracks; the","23":" Punjabis. Palmer and I ate a great many strange fruits, for fruit is ridiculously cheap. The niggers are a great nuisance, there ar swarms of them, and if you don’t watch them they will charge exorbitant prices. We got back to the ship, she had finished coaling; and sailed at 10 P.M.\n","24":"\n\nFar out at sea on a glorious day. We passed an Orient Liner today, she was a splendid spectacle, as she swept past not 300 yards away. The boxing tournament was continued this evening we are being treated to some fine sport.\n","25":"\n\nLeiut Lenaham tipped that we would go to France; and tried to teach us some french phrases. He deserves decorating. The final of the boxing contest was fought and we had a concert in the evening.\n","26":"\n\nGuard work again. Passed clusters of islands this morning; came abreast of Cape Guardalfure (Africa) in the afternoon. Somalie Land is a dreary looking hole. All sand dunes and thorn bushes.\n\n \n","27":"\n\nWe are getting into a busy track now; 13 steamers passed outwards today. We were past Aden at 5 P.M. and are well into the Red Sea this evening. Aden is a bare sunsmitten place to look at.\n","28":"\n\nA chap died today, and they buried him this evening with military honours I saw a locust fall on the deck today and there was absolutely no land in sight.\n","29":"\n\nPay Day! We passed a french mail steamer today. She was in sight at daylight but it took us all day to catch her. The Stewards gave a good concert; and the Colonel gave out the prizes won in the sports competition. The ship’s captain, a very decent old chap span a yarn or two also.\n\n \n","30":"\n\nThe sea is wonderfully calm today, not a ripple, a perfect day too and we are in the dreadful Red Sea? We are warned for disembarkation tomorrow so there is much bustle and movement.\n","31":"\n\nIn the outer harbour at Suez at daylight. Draw alongside the quay and disembark at 4 P.M. Boarded the train that is to take us to Cario. The train is a \"keystone\" affair with its little engine and nigger box carriages. They are something like that Missisippi steam boat; when they blow the whistle, she stops! We are travelling very slowly over the desert There are interesting sights everywhere There are a great many niggers about riding donkeys and working in the gardens. Troops seem to be everywhere we passed one enormous camp.\n","32":"\n\nDetrained at Zeitoum and marched to Aerodrome Camp; Heliopolos..arriving there at daylight. We go into billets in big sheds made of wicker mats, they are very cool but hardly waterproof. The tucker is all wrong we have received none today, through some regulation that will not grant us any till we have been here 24 hours. Fortunately we are able to get plenty in the town nearby. We were attached to the strength of the First Training Battalion; and the Colonel inspected us. Went right down town this evening and had a good spread at a restaurant had a look round with some more of the fellows. I think I shall enjoy living here for a while. Met a couple of chaps I know already. \n\n \n","33":"\n\nThey get at it early here, only 15 minutes between Revielle and \"Fall In\". This means go for your life! There was an inspection by some Major General, didn’t catch his name. Hilton Scott, Seagrott, and I went down to Heliopolis this evening.\n","34":"\n\nDrew rifle for training purposes and went out and did some stunts on the desert. Went down town again in the evening. Saw the \"Palace Hotel\"; now an Australian Hospital. It is a very beautiful building.\n","35":"\n\nManaged to get leave to go to Cario this afternoon. Found the Anglo Egyptian Bank after some trouble, it is curious looking for any place in a foreign city. I met an obliging Egyptian \n\ngentleman who showed me the way to it. He was a garrulous bird very courteous in his manner but I had to be guarded with him for this place teems with spies.\n","36":"\n\nThe Battalion is for a new stunt tonight, having to lie in camp during the next three nights, resting on our arms so to speak. Each man has 100 rounds of ball ammunition, and orders to be ready to march off at a moments notice. An old precaution against a \"rising\" I believe. I hope something happens to make it worth while for there will be no excursions during the next three. It is my idea that these coons will never kick against the british rule, they know when they are well off, and have never seen such prosperity as they are enjoying now.\n\n \n","37":"\n\nWe have to go through the whole syllabus of infantry training here, right from \"Right Turn!\" by numbers. It is very monotonous, and we hoped to get something fresh here. The picquet duty is finished tonight. \n","38":"\n\nHad half a day off today; struck a good fatigue job; and Palmer and I got down into Cario. The more I see of this city the better I like it. The European quarter is very nice, with wide streets and gardens. We also inspected the native quarter and saw some surprising sights. Armed myself with a stout cane to keep off, the boot-blacks, beggars, and other pests. The evening’s amusement cost 5 piasters the cheapest I ever had. Got back to camp at midnight.\n","39":"\n\nPaid 50 piastres. They have been well earnt. There is something to learn here for we were taught two new company movements today. One, \"Artillery Formation\", is good as it was born of expierence; the other \"Forming Square\" has given rise to the rumour that we are to go to the western desert to fight the Senuissi. Rumours are rife at present for the boys are in great form and are spoiling for a fight.\n","40":"\n\nNo drill this morning. This afternoon, Palmer and I joined a party with a guide and went to see the historical sights of Cario. We visited a great many interesting places, including some of biblical fame. The Isle of Rodah where Moses was found\n\n \n\n \n\nan old Coptic shrine above the spot where Mary and the Child were hidden. Different Mohammedan mosque’s of artitectural interest, including the Mosque of Amr, which has 365 pillars supporting it and they are all different. The Mosque of Hosean, that was built of marble stripped from the Pyramids The palace of the Sultan, and a dozen other places. Altogether, a great day.\n","41":"\n\nAfter Church Parade; I led some of the boys to the Pyramids. Climbed to the top of Cheops; only Palmer and I got there, for it is over 400 feet high; carved my name on the top as is the custom. Some of the dates there go back a hundred years. Then we crawled into the bowels of it and inspected the tomb from whence they dragged the remains\n\n \n\nof the Pharoah, whose vanity caused this huge pile to be erected. It is a great mystery how they built it I give it up. The other two pyramids are smaller they are called Chepren and Mercereens. Then I observed and wondered at the supercilious expression of the Sphinx, that caused Napoloen’s artillerymen to try and blow its nose off. They made a mess of the Sphinx’ face but the expression won’t come off. And so home again after a ride on a camel.\n","42":"\n\nHave joined the bombing class under Leiut Loveday. The work is interesting, and we have a saying that \"a change is as good as a spell.\" We went down into the native gardens near Zeitoun for periscope practice today. Heard the song of the Camel Drivers.\n\n \n","43":"\n\nWorking with the bombing class today. We are nicknamed the \"Suicide Club\"; and it strikes me that a man will need plenty of sand to see this business through. Scottie came over from the Oasis where he is situated with the","44":" A.L.H. We went to a concert, by the local talent.\n","45":"\n\nGot a first class pass from the Bombing school, and a day off to go to Cario. Got an identification slip from Base Headquarters and went and drew £\n","46":" from the bank. Visited the museum, and viewed many interesting relics. I saw a set of \"diavals\" that had been taken from some ancients tomb. I always thought it was a new game. Spent the rest of the evening in town, and did myself grand.\n","47":"\n\nGot another all day pass, and went to Cario again. Spent the day in the city, went to a show had a good time generally. Back in camp at 11 P.M.\n","48":"\n\nSlipped off to Heliopolis, and made myself comfortable in the soldiers club. Stayed there all day; came back to camp and was sitting on my angerib (a wicker bed) when Sep walked in. Gosh! I was pleased to see the priceless old feller. We went down into town and had a veritable corrobborre. He had some grand tales of Gallipoli, and I am going over to his unit the, Camel Corps tomorrow. We have been camped within a mile of one another for nearly a month and did not know it. \n\n \n","49":"\n\nWent onto musketry today all the old stunts we did at Liverpool, except that they have a few pet flourishes here. Went down to Abassia and found Sep’s unit. Yarned with him a while, inspected his kit, camel, etc. then we went and had a beano at a dinkum eat-up joint in Heliopolis; struck Arch McIlveen there.\n","50":"\n\nWoke up this morning to find that the company had been awarded 7 days pack drill! It appears that 3 chaps had a row with a Military Policeman; and the men got into our hut and he could not find them. Then he ran to the adjutant, with a cock and bull story, and he awarded us this punishment for something we know nothing of\n\n \n","51":"\n\nCarried on the musketry today. This evening we were ordered to prepare our packs for our punishment drill. The company fell in with full marching order, at 5 PM. and demanded a inquiry. The adjutant rushed out and read the Riot Act, every man stood firm and demanded individually to be paraded before the Colonel. Was promised that we could see him tomorrow. Did an hour’s drill. Then was dismissed.\n","52":"\n\nSaw the Colonel and the punishment was wiped out. Our company was detailed for inlying Picquet instead; so we don’t score much except that we brought the adjutant a crash. Sept came over to have a yarn.\n","53":"\n\nThe punishment was called right off today, so I was free to go down to Abassia to see Sep. He was on duty so we had a quiet yarn.\n","54":"\n\nThe C.O. had us out for Battalion drill today rather an interesting change. Then we did an attacking stunt far across the desert. Got back to camp and was picked for guard. This has spoilt my record for dodging guards.\n","55":"\n\nCame off Guard and as it was St Pats’ day we had a half holiday. The M.P.s were busy catching the fellows who got to town too early; but I managed to get through to Abassia, then Arch Mc, Sep, and I had our photos taken in Heliopolis.\n","56":"\n\nWas taken as escort for prisoners from the Kass-el-Nil Barracks to Gizerch There were about a hundred of them. It makes a man sick to have to escort a fellow Australian between fixed bayonets down the street. Rather a heavy day for it must be 9 miles to Gizerch.\n","57":"\n\nThere was some very heavy rain last night, an unusual thing for Egypt. Most of the chaps got wet, because the straw roofs would not keep the water out. I managed to keep dry. Sept and I went to the Zoogicial Gardens. They are situated at Gizerch and are absolutely the prettiest I have ever seen. The footpaths are made like a mosiaic of pebbles; a marvel of beauty and patience.\n","58":"\n\nHad to pack up and shift down to the Kasr-el-Nil, barracks today. Marched out and got to the barracks at 11 A.M. We are to do Picquet duty in Cario. These barracks are said to have been built by Napoleon when he occupied Egypt. They are very extensive and could hold 5000 men I reckon.\n","59":"\n\nThis picquet seems to be a splendid job. I sit on a chair in the Café Petrograd for five hours drinking beers at the expense of the house; and that is my days work. I have discovered a home at last!! The other 19 hours I have to myself. I received some mail today, and I have leave for six hours tonight.\n","60":"\n\nStruck Jack Moore today; he is a Segt Major in the Army Service Corps, and has just returned from Western Egypt. Was paid by Leiut Prescott. Saw Kirkland in the street.\n","61":"\n\nAnother General inspected us today. There seems to be a deuce of a lot of spare generals on this Egyptian staff. Shepherd’s Hotel was full of them the other day when General Maxwell was leaving for England, or some place. Spent the evening intown with Sep.\n","62":"\n\nEverything quiet on the picquet. Have been transfered to Crotti’s Resturant; so now I have light refreshments at the expense of the house instead of beer. The amount of French pastry I can eat now is astonishing. \n\n \n","63":"\n\nOrdered away from Kasr-el-Nil at 9 A.M. Marched 9 miles to Zeitoum via aerodrome; and entrained at 6 P.M. in open trucks. I guess it would do a N.S.W. railway commissioner a lot of good to have been with us in those trucks, the crush was indescribable. We start for an unknown destination at 10 P.M.\n","64":"\n\nWe travelled all night, and it was bitterly cold travelling beside the Nile. Arrived at Alexandria at 6 A.M; and immediately embark on the Transport. \"Translyvania\". Troops are arriving hourly and are pouring aboard this ship and others that are ling around the quays. The ship leaves the wharf and anchors in the stream. I saw a South African Regt. arrive.\n","65":"\n\nThe transport sailed at 10 A.M. Alexandria is a busy port crowded with ships. The ship is under convoy and the fact that we have to always wear our lifebelts remind us that we are in the war zone. The submarines are bad just about here.\n","66":"\n\nThe torpedo boat \"Rattlesnake\" came alongside this morning, and we picked up our escort soon after; it is a small cruiser. I saw a fleet of minesweepers at work and the escort lead us through the swept area. We are sailing by a great mountainous island there is much snow on the tops of the mountains. A ships officer tells me it is the island of Crete. I looks very pretty this evening. \n\na chap fell over board this evening and the ship did not stop until ordered to by the escort. The cruiser picked him up after a search and he died of exposure shortly after.\n","67":"\n\nA beautiful day and the sea is calm and marvelously blue. This ship the \"Transylvania\" is was once a Cunard Liner; is about 19,000 tons, and is very fast, we must be averaging 17 knots. She is carrying 3500 troops; and numerous staff including, General Sir William Birdwood; Commander of the Anzac Corps and his staff. Which may account for the fact that we are sailing alone and at such high speed. The ship steers a zig-zag course; and we wear our life belts and stand by the boats all day I am stroke oar in No.12 boat. Sighted no today.\n","68":"\n\nOur escort left us last night. A hazy day, and by the way the ship is trembling we are travelling at top speed. There was a church parade there were four Generals attending. General Birdwood inspected us, he seems a decent guy. Passed an island called \"Montagne\" a french convict settlement. \n","69":"\n\nThe island of Corsica was an the starboard side this morning. General Birdwood addressed us, and told some stories of Gallipoli and the Landing. He is well mannered towards us and wears a patch of service ribbons that commands respect. Because of the short rations on this ship we have nicknamed her \"Starveania\". But our trip is nearly finished now as we cannot be far from France. \n","70":"\n\nAt Marseilles docks at 7 A.M. Was out at dawn watching for a sight of France.\n\nGot quite a thrill when two submarines rose to the surface about half a mile away, till I saw that they were flying the French Flag. A very busy port this;\n\nthe docking space is very conjested. Saw and enormous four funnelled Hospital ship. the \"La France\". Four, ridiculously small tugs swung our ship into dock; on the end of the dock sat a french soldier catching small fish like sardines. Landed at 1 P.M. and marched through the streets to the railway siding. The French people seem elated to see us. Entrained immediately and I got into a first class compartment, it seemed luxurious after travelling in trucks. Left for Northern France at 2 P.M.\n","71":"\n\nWe have been travelling for a whole day through the most enchanting scenery I have ever seen. I had not dreamed that anything could be so beautiful. It is spring time here and the orchards are in bloom; Such green grass, such blue sky and sea, it is great to rest one’s eyes on such a vivid contrast of colours after the burning desert sand of Egypt. It is good to see the smiling faces of the French people.They give us a great reception. A pretty, black-eyed mademoiselle, came to my carriage and distributed boquets of field flowers. One of the chaps asked her what she thought of Australian soldiers. She said we were like a lot of brigands ment as a complement I suppose, on our easy manners. We passed Lyons at 5 A.M. so leave the south of France behind us.\n","72":"\n\nPassed through Paris at 3 A.M. Nothing to see as the city is in darkness. Passed old trenches and barb wire entanglements, that show where the tide of war has been. Went through Amiens at 12 Noon. It is decidedly wintery up here. It is a shock to see the amount of women that work in the fields here, there seem to be no one left but the women and old men. We reached our destination, a place call Etaples; by the English Channel at 4 P.M. Passed through the armoury after we detrained; then marched up to camp in the lines of an English bus Depot. There is camp here, and there are a score of field hospitals close about. There is a fair sized fishing village down by the river mouth went down and had a look round it.\n","73":"\n\nI was a bitter cold night, with wind and rain. Busy settling down into camp routine. The camp commandant was to inspect us but the move fell through.\n","74":"\n\nThe inspection came off today, and he said the usual things when it was over. Then we went through a general medical inspection. An Aeroplane and and two Parseval Airships passed over the camp in company today.\n","75":"\n\nThe Australian units are ordered to be ready to move off to pitch a camp for themselves across the Railway line on the sand dunes. We were issued with a blanket and woollen underclothing against the cold which was very severe last night.\n","76":"\n\nCold and wet. We moved off at 2 P.M., and went and pitched a new camp on the Bolougne Road; beside a small creek. A new O.C. was attached today a cove named Bailey.\n","77":"\n\nMore rain and wet. The second Battalion came down today and we had to give up the tents we had pitched it was damn annoying. Located new tents, and slept all the afternoon. There was an issue of Rum the first since I joined; it was good for we are all feeling the cold intensely.\n","78":"\n\nHad a short parade. A schooner went ashore up the coast last night, 3 of the crew were drowned. The rations are not so plentiful here. The Bread ration is 6 ozs a day.\n","79":"\n\nWent on a route march through Etaples. This place has marvellously crooked streets, and a very fishy smell. The Bread ration was halved today only 3 ozs a man. We must have taken an enormous number of prisoners or something to cause the shortage.\n","80":"\n\nWent to the training ground that our boys have nicknamed the \"Bull Ring\". An English Office took the company over and put us through our paces. I think we surprised him. Troop trains pass continually on the line to Bolougne. Some New Zealanders passed today. My company was passed as efficient today in the list at the Bull Ring, and do not need further instruction. This is rather a feather in our caps. But we will have to supply Guards etc. \n","81":"\n\nThe company works on fatigue, while the rest of the units complete their training. Saw a splendidly fitted Hospital Train today, it was presented by \"Princess Christian\" whoever she may be. \n","82":"\n\nTwo men less in the tent today the \"Boob\" has claimed them. The company went on a route march to \"Paris Place\", a pretty little watering place about 7 miles away, but is of course \"out of bounds\" to troops. Marched most of the way through thick pine woods. It was raining as usual; it is always raining here. Borrowed a boat and rowed across the estuary and spent the evening in \"Paris Place\" The Military Police guard the bridge. Palmer was with me.\n","83":"\n\nWent on a washing parade to the Etaples laundry. Had my clothes washed in soda and soap, wished I could have got into the mixture myself. Bill Brew has been taken to join the Pioneer Battalion he is the first to leave my clique. Still Raining, we are lucky that we are camped on sand dunes. There is no mud.\n","84":"\n\nDrew Gas helmets from the Quarter Master. Went to the \"Bull Ring\" for instruction in their use. They are very uncomfortable to wear at first and take some getting used to. For the flannel fabric they are made of is soaked in a strong solution of Hypo and ammonia, and the fumes are very strong. But they are invalueable so no one minds the discomfort. \n","85":"\n\nAnzac Day. The Brigade marched out to a square field enclosed on three sides by pine woods; and there a memorial service was conducted. A very large number of our fellows were an parade there; a the whole parade gave the Royal Salute to the Memory of the Australian Dead. It was a very impressive ceremony. \n","86":"\n\nThere was a zeppelin raid on this base last night. The raider dropped nine large bombs, no damage was done; but a few casualities and large holes blown in the ground. One bomb fell about 150 yards away but failed to explode. I hopped out of my tent when I heard the racket and saw the \"Zep\" flying at an immense height. It disappeared straight away.\n","87":"\n\nAeroplanes were patroling last night, but the \"Baby Killers\" did not come again. Orders have been issued that all lights must be screened at night. The \"Zepplin\" has set them thinking. Spent the afternoon in Etaples.\n","88":"\n\nRoute marched to \"Paris Place\". This place looks as if it was built for scenes in a Theatre. Some of the quaintest artitecture is to be seen in the houses and shops. They are all quite new and are owned by a sydicate I believe. Got over the estuary again, and visited Paris Place this evening but was nearly \"pinched\" by the M.P.s. Had to swim back across the water. Some one had re-borrowed the boat. Shall have to be more careful.\n","89":"\n\nWas sunbathing on the sand dunes all the morning. Went and tried my rifle on the range. It is a little beauty and worth caring for. I was in great form too and did exellent shooting.\n","90":" May.1916\n\nWent on a swimming parade to \"Paris Place\". Rather an unusual season to be swimming in the English Channel. Was swimming round the wreck of the P.&G. steamer Scotra. Which was mined or torpedoed by the \"huns\" and run ashore. Evidently another ship was torpeoded near here lately for thousands of oranges are strewn along the coast. They are quite fresh and good. The rise and fall of the tide is extraordinary in these shallow seas.\n","91":"\n\nWent to the \"Bull Ring\" and had instruction in grenades. Threw live Mills Hand Grenades and used rifle grenades. The hand grenades are peculiarly deadly; and it is a strange sensation to throw one for the first time. There was an accident with one today and the instructor and another was killed, and five were injured.\n","92":"\n\nTo the Etaples Steam Laundry for a bath, and to wash my clothes. A big Australian mail was distributed. A very popular day.\n","93":" \n\nAt the training ground today the company went through a sort of obstical race over high walls and trenches carring all our gear. Very strenuous.\n","94":"\n\nRoute Mached 10 Kilometres to the east of Etaples. The country is very pretty now for spring is well advanced. There are no fences round the farms here or hedges of any kind; I wonder how the farmers know their lands. There are no detached farms, for the farmers cluster in villages and hamlets, so these small villages are numerous. Observed the system of billeting troops. There is a regiment of British cavalry billeted in these hamlets. They say they have been there for many months. They are having an easy time at present for they are not called on to serve in the trenches now. Was paid 14\/- when we returned. Went down to my Estaminet and spent some of this wealth.\n","95":"\n\nWent to the training ground and did some Battalion drill under young English officers. Most of these English officers are very young and generally are not popular with our fellows; we call them \"War Babies\". The one that had my platoon today wore a \"window in his eye\"; but he seemed a decent sort of chap. It poured rain all day.\n","96":"\n\nWe are all sick and tired of this ceaseless training, and there is no indication of a move to the trenches as yet, though all the fellows are in the pink of condition. There is a detention camp near here; where I saw men undergoing the punishment known as \"Crucifiction\". They are strapped to a beam with their arms stretched\n\nabove their heads for four hours each day. This cramped position is great torture I believe, especially in this biting wind. There is some complaint about Australian soldiers undergoing this punishment, while they are in British Detention camp; it is not allowed in the A.I.F.\n","97":"\n\nTook rations and marched to a place called \"Berke\". A very long march. More Australian mail today. Leuit Lacy is now O.C. of the Company.\n","98":"\n\nField Marshal Sir Douglas Haig; Commander-in-Chief of the Army in France; visited us today and made a hurried inspection. He is a smart figure of a man; though rather small in statue. There were an enormous number of troops at the \"Bull Ring\" when he came.\n\n \n","99":"\n\nReceived another issue of army tobacco it is of very fair quality this time. \n\nWashed clothes at the Laundry then went to the Tommies camp and had a \"Russian Bath\" in their steam house. It was a treat, the best bath I have had for a long time. I think it is a good omen, that we will not loiter here much longer. Futter has arrived from Egypt with artillery details. A letter form Sep, from El Alamien.\n","100":"\n\nGot a good job as Divisional Orderly went on duty to Etaples after being paid 20 francs. Spent the afternoon there. Fell foul of \"Charlie\" the Sergt.Major; we clapped bills and he wanted to put me in the \"clink\"; came the old soldier stunt of complaining to the adjutant. \n","101":"\n\nThey seem to be at a loss to know what to do with us; for I reckon the drill of this company is perfect; they come to us for all the ceremonial parties now. Went for a march beyond \"Camaires\" a fair sized town along the Bolougne road. It is pleasant to march among the green woods and fields. Went rabbiting in the sand hills this evening, caught one big fellow. I suppose the next thing will be an order against poaching.\n","102":"\n\nOn duty as orderly to the quarter Guard, an easy job. There were any amount of aeroplanes about today; stunting about the sky. One takes no notice of them now, for aeroplanes and airships are to be seen any day now. One big British airship named \"Silver Queen\", patrols the coast regularly, spotting for \"U\" Boats.\n","103":"\n\nThere was a Muster Call this afternoon, and we doubled up thinking a move was right. Nothing doing, it was apparently a practical joke. By the movement on the railway that runs by the camp we will be busy enough before long. Saw a regiment of French soldiers they are fine amiable fellows. Of a good stamp physically and nearly all cultivate fierce beards; they are called \"les piolu\" for that reason I am told. We were amazed at the clean shaven faces of our chaps. They said they were off to the Verdun sector.\n","104":"\n\nWas on guard yesterday and \"Charlie\" the D.S.M. tried to cross my beat, I wheeled him and he went crook; so I took this heaven sent opportunity to tell him what I\n\nthought of him; he told me to consider myself under arrest, then I jerked a cartridge into the funnel and ordered him to clear out. Reported it to the Orderly officer, and beat him again. Then some Anzacs who arrived from England this afternoon \"counted him out\". He is making himself unpopular.\n","105":"\n\nGot over to Paris Place again today got caught by the incoming tide, so had to go round by the bridge under the noses of the \"Jack\". Luck carried me through again. The boys are annoyed at the new company commander, and told him so. Don’t know his name, we call him \"Cuckoo\". He is a typical text book officer. We greeted his remark that the \"Book says\"; with a broad smile.\n","106":"\n\nWent with 18 other chaps to the \"Bull Ring\" and did sundry courses. The Australian division made a demonstration tonight with mines, artillery, rockets, and other \"property\". I suppose this is the grand final, as a draft is leaving for the forward area tomorrow. All cameras in the possession of the troops were seized today and all diaries and other writings were ordered to be handed in. I will risk it with this one, I guess.\n","107":"\n\nOn fatigue storing things at the Quarter Master’s store. Met Alf Morey the boxer chap there. Was riding on a wagon with a \"Tommy\" driver, and he tipped\n\nthe thing clean over. I nearly went under the load. Some of these English A.S.C. couldn’t drive a tack.\n","108":"\n\nOh! Day of Days! The company was warned to be in readiness to proceed to the forward area. Went under a medical examination. Several fellows were rejected. Drew shortages of kit from the Quarter Master Sergeant. Had to pay for a towel I had lost. What sort of a turn out is this where a man has to pay for his worn out kit after 10 months service and no new issues? Paraded in all our kit; did not mind it this time, now that we are pronounced fit for war. No one could look at this company of splendid fellows and think otherwise. Went down with Palmer, to the Café Les Voyageurs and cracked a bottle of champagne.\n","109":"\n\nReveille at 2 A.M. Marched out of camp, and entrained at Etaples. It was my first ride in the truck marked \"Hommes 40. Chevoux 8\". Travelled via Bolougne & Calais. Did not travel very fast. \"Bluey\" McMasters fell out of the train and had time to run after it and catch up. Arrived at the railhead, about 3 P.M. Detrained and marched to where the Battalion is in reserve to the \"Bailly\" sector. Am billeted in a deserted farm house, not far from the firing lines, as I can see all the flares that illuminate \"No Mans Land\" at night. The Germans are using a curious rocket far behind their line. They look like strings of flares and they rise to a great height. The front seems quiet and is nothing like what I expected to see. A dispatch rider has arrived with orders for us to go and reinforce the","110":" Battalion.\n","111":"\n\nMarched down to Head Quarters and were inspected by a gay old joker named Brig.Gen. Foot. He told us the order about the 11th Batt is cancelled. We are greatly relieved. Was ordered to join the 3rd Battalion. Reported to the 3rd Battalion H.Q, in the afternoon. Several officers inspected us there and put us through our paces for about an hour. We had quite an audience in the finish for I reckon we showed them what a real reinforcement company was like. Then the boys were distributed over the whole Battalion and the good old 14\/3 was no more. Palmer and I were sent to 16 Platoon D. Company. It was dark when we got to the billets and there was no one about. Lay down in the straw; we got a duece of a ragging when the mob came in after the pubs shut. They wanted to know \"how we came to hear about the war\"; In a physical arguement I got a black eye.\n","112":"\n\nAs all the boys were sober, they were more amiable this morning. Except for my eye, there is nothing to show for the initiation ceremony of last night. I did not expect to find booze in the reserve lines; but a few of we \"reinfo\" took our Platoon Sergeant; Harry Parker, is his name and bought him lots of beer. Now everything is all right. This company has none of the \"spit and polish\" of the 14\/3; all the fellows in it seem to drink and swear hard and the fact that we are \"D\" Company; of the \"Incomparable Fighting Third,\" goes to prove that they will fight like 14 devils. This evening we marched up to support in the \"Fleurbaix\" sector; and made ourselves snug in a billet about 2 miles from the firing line. Marching in the ranks of a fighting Battalion has made this one of the proudest days of my life.\n","113":"\n\nA quiet night. Today there does not seem to be a war on at all. The fact that we stay under cover as much as possible; alone, goes to show that the Huns are within range of us. We were detailed into fatigue and carring parties for the ‘line’ I go up tonight.\n","114":"\n\nWent out to the firing line last night. Received my baptism of fire, in a strafe that was going on. It was the healthiest fright I have ever had in my life. I lay in a stinking drain, almost entirely submerged in mud and water for a quarter of an hour, while shells shrieked and crashed and machine gun bullets mowed the grass about six inches above my head. One of the party was wounded before we finished the job. Got back to billet, covered with mud, at 3 A.M.\n","115":"\n\nCold and Wet. Worked on the tram-line from \"Tin Barn Dump\". Was caught in the open by another bombardment and sought the protection of my friend the ditch again. Did not mind it this time for our guns opened up and gave him beans; which was very comforting. The crossfire of his machine guns was very hot. There were no causualities. The peasants in this part of the world wear big wooden shoes, shaped like pontoons, and because of the amount of rain that falls in this region, I reckon they need them, the mud and slush is a caution, a man could drown in it; and splashing through it makes a man so tired, that I can throw myself down on the stone floors of my billet, and sleep in my saturated clothes like someone dead.\n","116":"\n\nMore rain, More wet, a whole week of it. Was working in the \"Dead Dog Avenue\" trench last night. We always sleep fully dressed; but tonight we are on the \"Qui Vive\" for some reason or other. There is to be a \"strafe\" I suppose. The \"daylight saving\" scheme comes in tonight; it won’t effect us much who work at night.\n","117":"\n\nFritz blew over a little gas attack last night, but it missed our sector. Our \"heads\" must have known; hence the warning. Our guns were very active, during the night, sending over a protest. Did duty as billet guard, and gas sentry; to warn the company of gas attacks, shells, and other annoyances that the hun is liable to send over anytime. An easy day. Paid 14\/-.\n","118":"\n\nWent to work at 7.A.M. this morning. Came back to billet at 1 P.M.; out to the line at 9.P.M. everything was quiet, back again at 3.A.M. Was building a dressing station. Witnessed a splendid air duel between four British planes and three Taubes. The Taubes were driven down. \n","119":"\n\nAs Sunday is our busy day, we went to the firing line via \"Dead Dog Avenue\", and worked. \"B\" Company’s billet was destroyed by Fritz’s guns this afternoon and all our tools were destroyed. We’ll soon get plenty more. A French civilian warned some of the chaps that the place would be blown up today; these civilians round here know too much; and I believe they would sell their soul for a franc. They all ought to be cleared right out of the fighting zone.\n","120":"\n\nWorked in the line until 12 Noon. got back, to find that orders were out for us to relieve \"B\" Coy from close Supports, that they might be re-equipped. Dug new trenches and occupied them; or rather repaired old ones. As there is no shelter this is a comfortless hole.\n","121":"\n\nHave digged a dugout, and have shelter of sorts. We were shelled vigoursly with 5 inch shells; they tore the ground up a bit but no one was hurt. Some of the chaps were out searching for nose-caps, as souvenirs. Don’t do anything here except keep our heads down.\n","122":"\n\nFairly rained 59 shells today. Fritz sent over hundreds of shells at a battery a few hundred yards in our rear. We had an anxious time while he was\n\nsearching for the range. Dirt flew over us in showers. We all breathed easier when he got set, though showers of debris came over us continually. He shelled everything in the vincinity but the guns were not put out of action. It was laughable to see the gunners scampering away from their position. A liberty the infantry do not possess. Received some mail.\n","123":"\n\nNot so many shells today a few fell about. Went up to releive the front line this evening. The releif was carried out swimmingly and without hitch. In my section of the line I occupy a dugout, measuring 6ft by 2ft with Wallace. Thanks to our labours during the previous weeks the line is in exellent repair. There was a thunder storm this evening.\n","124":"\n\nThe line here is a high breast work. Trenches being impossible because water is only 18 inches down. The breast work is very strong but a lot of labour is necessary to keep it in repair. I am on post observing the enemy line for four hours each night, and do fatigue in my spare time. The hun trenches are four hundred yards from this point, and our line is protected by a belt of barbed wire thirty feet thick. So I feel pretty comfortable.\n","125":"\n\nA quiet Day. I saw 10 of our aeroplanes up at once. They attacked the enemy observation balloons with patent bombs and burnt four of them. There is an airman on this front, popularly know as the \"Mad Major\", he seems to be the last word in fearlessness.\n","126":"\n\nThere was a big \"strafe\" last night with artillery. The din was terrific. I was nearly skittled by a shell that burst directly in front of me; within three feet of my face as I stood observing over the parapet. Was stunned and blinded for a while, but soon recovered. Received some newspapers.\n","127":"\n\nA fine day with a overcast sky. Our planes again attacked the german balloons and destroyed three of them. Our boys cheered when they fell. Fritz’s evening \"hate\" was rather prolonged today.\n","128":"\n\nOur trench mortars sent over some favours to the huns this morning but he seem peeved about the frightful\n\n \n\ndestruction they were causing in his trenches; and he opened up with his guns and tore the landscape about considerably. The rations are good here and we are able to get hot meals, for which Allah be praised!\n","129":" \n\nYesterday we suffered a terrific bombardment. The worst we have had yet. Our guns were active also and blasted the german trenches with a hurricane of fire. There is something unusual in the wind, for there are curious preparations going on; our rifles and ammunition have to be kept copiously oiled, and gas helmets are worn in the \"alert\" position. A squadron of 20 of our aeroplanes disappeared over the hun lines this evening. The most I’ve ever seen at one time. There will be a hot time in Hunland tonight.\n\n \n","130":" July.1916.\n\nWent out in front with a \"wiring party\" last night; repairing the wire entanglements in front. It passed off all night, though the enemy’s fire quickend a lot after we came in. The air squadron that passed yesterday evening returned this morning. A \"Taube\" attacked 7 of our planes today; but was driven off. It is said that it was Immelmann, the \"Eagle of Lille\". His \"stoop\" was unsuccessful anyway. \n","131":"\n\nI am sleeping under the stars while my portion of the trench is being repaired. The Wide Heaven is no cover for a man these stirring times. I miss my little 6 x 2 dugout when Fritz’s shrapnel is bursting over the trench. I am to go out on patrol at 11 P.M. A risky business, so I will leave this book with Wallace.\n","132":"\n\nCrept about in No Mans’ Land for an hour. We captured a Hun sniper, who has been troubling us for some time, he dropped from a willow tree almost on top of one of our chaps, who was armed to the teeth, but he forgot about all his lethal weapons, and punched the Hun in the eye, then gave him a shower of uppercuts that knocked him out. He was a Bavarian a rough looking joker too; dressed in tweed trousers and a blue butchers coat. As we were returning to our lines a machine gun caught us and one of our chaps was killed. This machine gun is operated by the crack German gunner on this front. He is known as \"Parapet Joe\" and I must say that if he could express his talent on a violin he would be called a genius. A very wild night, shells of every calibre rained down on our line.\n\n \n","133":"\n\nThe daytime is quiet here except for the regular doses of \"Hate\" that we receive from Fritz at 7 A.M. and 5 P.M. or thereabouts. He threw a lot of heavy stuff over onto some place in the rear; he has succeeded in setting fire to something by conflagration I can see. During my shift last night I got onto \"Parapet Joe’s\" emplacement; and kept firing at it till he got real mad and kept his gun firing on my bay for about five minutes. Have got my gear together for we are to be releived tonight. \n","134":"\n\nThe 45th reliveed us; their first time in the line, and the releif took some time. Marched through pouring rain to billets near Sailly-sur-Lys. The march was very fatiguing otherwise the releif was uneventful.\n","135":"\n\nRoute Marches are the order of the day here, I suspect that they are getting us set for a long march somewhere. Had a foot inspection and a bath (I needed the bath) this afternoon. Met Sergt Major Jack Moore, and Sgt Chisholm today. There are cherry trees loaded with fruit here and I pay them considerable attention.\n","136":"\n\nHad another good bath today. There are three things a man looks forward to here; a bath, a pay, and a good night’s sleep. Our Company Commander Captain Harris; (we call him \"Digby\") warns us to be ready for the road tomorrow. \"Digby\" is a god old sport, he buys us beer, plum puddings,and other comforts. A sure road to the hearts of the troops.\n","137":"\n\nParaded in full marching order at 8 A.M. Marched all the morning covered some 9 miles. We have halted at a billet near Merrio and we march on again tomorrow. Whither we are bound I know not.\n","138":"\n\nDid not get our blankets last night, the transport that is carrying them has moved on; but it was warm enough in the straw of the barn. Rested here all day waiting for the order to move. It will come some time tonight I suppose. Marched off at 11.P.M. \n","139":"\n\nMarched 5 miles last night, to the railway at Bailleul. Entrained 40 in a truck. Journeyed for some hours and detrained at a nameless\n\n \n\nstation. Marched 10 miles or so to a town called, Saint Guen. A nice little town; there has never been any Australians here before hence the surprise of the natives. The boys are taking this opportunity to enjoy themselves, for there is much innocent amusement and good liquor to be had here. \n","140":"\n\nAgain an early start, but we only went a few kilos, to another town called Vignacourt. Here I am billeted in the \"Billet Ideal\". There are chairs and tables and pictures on the wall. The \"Madame\" of the place is O.K. too, the one in our last place was a veritable Fury. She told us; or rather our Captain, that we were worse than the Germans, because we washed in her horse trough. What would she say if we burned her house.\n\n \n","141":"\n\nLeft Vignacourt at midday we got three minutes notice. This was a nice, clean, little town; and the people too seemed to be more intimate with soap than the Flemish. Covered 12 miles, and the battalion is camped in an old aeroplane hangar near Allonvillle. It is such a crush that many of the boys are sleeping on the grass.\n","142":"\n\nHave rested here a couple of days. Did a bit of field work in a pretty little wood nearby; where violets grow in profusion, much larger than our violets but like them have no scent. Some French anti-aircraft shells fell around this evening. One came through\n\n \n\nthe shed where I am lying and buried underneath me, but, fortunately it was a \"dud\" and did not explode. I wrote some letters in these unhealthy surroundings. \n","143":"\n","144":" is the","145":" Battalion’s busy day, so we rolled \"Matilda\" and hoofed it away from Allonville. Left Amiens in the valley through which the \"Somme\" flows and marched out along the Albert Road to Warloy, were we got quarters in a deserted farm. We may spend a few days here, it will be alright for this one horse joint boasts of a B.E.F. Canteen. We are not far from the front here, it is a very active one too for the gun fire is continuous, and very heavy stuff too.\n","146":"\n\nThey took our blankets today and there has been much inspection of gear and equipment. We have to stand by ready to move off at half an hours notice. We get plenty of that sort of thing. Old \"Digly\" gave us his views and instructions concerning the fighting we may get mixed up in. All we ask is; Lead us to it;\n","147":"\n\nMuster Parade today. 16 Platoon is 75 strong. We were issued with large patches of pink cloth to sew on our backs. A careful inspection followed. This afternoon we marched out through Albert. We are resting in a field now, alongside the road that leads to the front; English troops are passing back along the road\n\nthey are nearly all wearing German spiked helmets, and tell tales of terrific fighting. We passed a church in Albert that the Huns have destroyed it must have been a magnificent place. We have left our packs and over-coats stored in Warloy, and are in very light fighting order. Received a lot of mail you today.\n","148":"\n\nLast night we releived the","149":" Kings Royal Rifles, opposite the village of \"Pozieres,\" which the Germans hold. There has been terrific fighting about here, and this battlefield is a dreadful spectacle, for the dead still lie unburied. The trenches here are very rough. I was detailed off this morning with a party of 50 other chaps to go to \"Gordon’s Dump\", on carrying fatigue. Carrying ammunition, rations, and\n\n water to the firing line. The work is very hard, for the roads we travel are continously swept by shell fire; and we suffer loss that makes our burden heavier. 15 were knocked in my party today. It is about two miles up to our forward dump. Half the way is along Sausage Gully and is exposed to his observation and fire.\n","150":"\n\nYesterday and last night I did 7 trips to the forward dump. We have lost more than half our party so the loads are heavier, as the stuff must go up. I do not duck from the shells now. The sight of these stretcher-bearers carring out the wounded, would make anyone walk upright. They are heroes those splendid fellows. I get very\n\nlittle sleep an less to eat. My feet are swollen and blistered for I have no soap to treat them with. They are very painful. My party has made a forward dump of 200,000 rounds of ammunition, 5000 boxes of bombs, 2000 gallons of water, and rations for the brigade, and various other stores. And there are those who lie beside the truck with their loads who will never carry again. The Brigade attacks in the morning, and I shall go over the top with them. If this book is returned to you; Remember that I would not be elsewhere, than with these men you will be so proud of.\n","151":"\n\nThe Brigade advanced about a 1000 yards before daylight this morning. Capturing the village\n\nof Pozieres; and I got forward on the left to a small wood; where the fellows dug in. There was not much fighting here for the Germans did not stand. Helped dig the trenches then was ordered back to the carrying work. I had a shot at some Huns that were scuttling away. just before I left, and it releived my feelings a lot. There seems to be double the amount of material to carry now; I won’t last much longer, I am utterly worn out.\n","152":"\n\nReturned to the trenches last night where our boys are holding the ground gained. The 2nd Brigade has sent a party to work on the dump. The Huns have started a heavy bombardment of our position\n","153":"\n\nHave been under a terrible bombardment for three days now. Our trench has disappeared and we are holding on in shell holes. Have advanced in front of his barrage and are better off here. Have no food or water. Don’t know where the Battalion is. Was buried by a shell yesterday Palmer dug me out. He is not with me now.\n","154":"\n\nLast night we were relieved by the 5th Brigade. Found my way back to Becourt Wood. I found Palmer there he has a slight wound in the head. The cooks gave me a grand hot meal and I had a good sleep\n\nAll the chaps are utterly worn out; it sure was a big stunt. Many of the fellows are missing but they will doubtless turn up tomorrow. We will move off this evening.\n","155":"\n\nThe mob were singing as they marched through Albert last night. Bivouaced on the heights behind the town; where we got overcoats and lay down till daylight. Then I noticed that the chaps were gravely saluting me, and discovered that I was wearing some Captain’s overcoat with three stars on the shoulder straps. I have been a captain for nonce. We had a roll call; 16 Platoon mustered 23 men. Then we marched on to camp in the wood at Contay. There\n\nwas great shaking of hands amongst us for we have been through Hell. Both Generals Walker and Birdwood came to see us. Birdwood congratulated us on the work we did; he says that a British regular division that was on our right said they were \"proud to fight beside us\"; we did give the hun a nasty jolt in wresting such a strong key position from him. I washed my face and hands, the first time for a Week \n","156":"\n\n Started away again this evening and marched 10 miles. The transport took our packs but many of the fellows were too weak to march and ambulances picked them up. I don’t wonder now why a man needs to be highly trained to stand up to this job. It tried me out this time for my feet are very sore.\n","157":"\n\nOn again today till we came to Bonneville. Halted here and I went and had a swim in a stream. The first good wash I have had for many moons. I feel much better now. This town is not much chop.\n","158":"\n\nToday we reached our destination a place called Pernois. I have a good billet so I won’t mind staying here. The country is very pretty in this region; Picardy it is called I beleive. We had a church parade, it was more like a memorial service. We have lost many of our comrades, but they have died even as I would die. Our Colonel seemed very upset; he is a fine young fellow only 23 years old. \n","159":"\n\nCommenced our \"Rest?\" with the usual syllabus of infantry training. Our acting O.C. is not popular, so things are not as pleasant as they might be. It is very pleasant here surrounded by woods and a small river running past.\n","160":"\n\nHave been drilling hard all the week. Went on a long route march today. Old \"Digby\" came back this morning he looks none the worse for his shell shock. We gave him a cheer for we are all pleased to see him back. There a two very nice old French people in this billet, their daughter is very nice too. I am well in with them, and often take \"coffee royal\" with them. Was issued with a shirt and received a lot of mail this week.\n","161":"\n\nDid guard yesterday, and got another fist full of letters from home. A young soldier has come to visit the old people who live here, he is a Chasseur, and wears a gorgeous uniform of blue, red, and silver. He is from the Verdun front he says; and has taken possession of \"Yvonne\" in a way that makes us fit to bite our tongues with envy. Had a bit of a field day, today; the colonel reckoned we show a vast improvement, so we shall not \"Rest?\" much longer now \n","162":"\n\nPacked up and march off at 9.00. It was hot and after a rotten march we got to this ranch where we are bivouacked in an apple orchard for the night. We were issued with clasp knives.\n","163":"\n\nThere was rain today, and we marched through it to Herissart, where we went into billets. It is a fair sized place this with a canteen. We are permitted to write letters so will probably stay here a few days. Our boys seem to be popular with the garrulous old froggie that owns this joint. He showed us with much gesture with a rifle he borrowed; how he killed a Garman in 1870. One of the other fellows rode a colt he said was a bit of a buckjumper; and he was amazed to see the Aussie ride it barebacked. Captain Harris’s nerves are still bad, and he does not seem well, so the colonel has sent him to a job in the D.A.C. or something.\n","164":"\n\nA Brigade Church Parade today. General Birdwood was present, and \n\nhe presented several men with the Military Medal ribbons; it was beyond his power to give medals he said. There were two men of the","165":" Battalion decorated, both of \"D\" Coy. The Company has now, one V.C., two D.C.M.’s, and two M.M.’s We got the \"straight griffin\" from Birdwood, he says there will be no rest for anyone while the \"push\" is on. He uses some very endearing terms, this fellow; today he called us his; \"Dear old First Brigade, the boys with hearts of gold\";. The chaps don’t like this sort of thing; but I think he is a good General.\n","166":"\n\nParades as usual in the morning. We received our overdue pay, and then we marched to Contay and camped at the wood. Rained all day.\n","167":"\n\nLeft Contay yesterday morning and marched through Albert, a pipe band of the Gordon Highlanders play ahead of my platoon as we marched through the town. Rested some hours in the reserve line. Cold and raining. Then went over a terrible track to the front line, reaching it in the daylight. Of the Pozieres village not a trace remains, and this position on the left of the windmill overlooks Courcelette, so some one has been working while we were away. There is a good deal of shelling going on but happily not much comes our way. I got a bit of sleep in a Hun dugout. There were some very dead huns in it but I did not mind. They had a tunnel to a machine gun emplacement thirty yards long. \n","168":"\n\nIt continues to be fairly quiet Fritz pays more attention to the communications in the rear, of the part we occupy. The trenches are of a rough and ready character here, they have been knocked about by the artillery of both sides; still they serve; although obliterated in places. We get much more duty now being so much under strength.\n","169":"\n\nHad rather a trying time last night. Was lying out on the top of the parapet observing, under heavy fire for four hours; it gave me the \"Willies\" properly. One of his \"Pip Squeak\" guns was playing right at me for half an hour and gave me a bad attack of \"Wind Up\". Never got a scratch however. \"B\" Company has been\n\ncut up by our own guns, so we had to move down to the left this after-noon, to shorten our line. Our guns gave us a salvo too and killed some of 13 Platoon. Some one ought to be shot over this; for we cannot stop them. We are in a very exposed position here, if we are shelled no one will survive. Percy Wright was killed last night.\n","170":"\n\nHad another thrill last night went and lined the front parapet in preparation for an attack on Moquet Farm. The stunt was cancelled at the last moment. The Hun cannot know we are here for we have not received a single shell in this trench. He is sending them into the rear of us, hot and heavy. We have fooled\n\nhim I think. We were relieved in daylight this evening. The Huns must have seen us, for they gave us \"hurry up\" all the way out. This trip did not last long, but it was thrilling enough. Being releived on the aniveserary of joining made the event popular.\n","171":"\n\nWe are in billets in Albert; we got here last night; it saved my life. I had no sleep for 3 nights, but I had a splendid sleep today; and received a big mail, so everything is bright and beautiful again.\n","172":"\n\nBroke into the cellar of a ruined house yesterday and found a lot of wine. I lead my braves to it and we finished the lot before we left for Warloy \n\ntoday. It was a piece of gorgeous luck; and I am very popular today; if I do say it myself.\n","173":"\n\nReached Val-de-Maison, yesterday and a few details joined us there. A Brigade parade this afternoon at Savigcone. Birdwood came to issue D.C.M.s to those who distinguished themselves. The Third Battalion got 3, D.C.M’s and the Doctor got the Military Cross.\n","174":"\n\nDid a stiff march today, but as there was some rain last night the roads were good. This place is called Gezaincourt. We have struck a fair billet, though it is very verminous and has an extraordinary collection of odours, even for France and that is saying something.\n","175":"\n\nWe did not do much today so most of the boys found time to go and get drunk. \"Digly\" arrived back today, and ordered a muster parade this afternoon. He was disgusted he said; to see the whole company drunk. I borrowed five francs of him on the strength of being sober, and helping him with his horse. Will go to town this evening for we move very early in the morning and by the look of it no one will sleep much.\n","176":"\n\nMarched off at 3.A.M. Covered some distance to Doullens and entrained in horse trucks that had not been cleaned; they were filthy with manure Journeyed for some hours; passed many coal pits. Detrained at Popperinghe. Marched about four Miles to Toronto Camp.\n","177":" \n\nWe are fairly comfortable here and have been doing the usual parades. Yesterday the official news was read saying that Roumainia had entered the field on the side of the allies. Cheers! We are in Belgium now; the remarkable flatness of the country is very noticeable. The leaves are falling from some of the trees; and it continues to rain with the steadiness that makes me think we will need an issue of lifebelts shortly. Have received much mail lately. Our hut leaks too much to allow writing here.\n","178":"\n\nThe weather cleared today. Had a muster Parade, where the Coonel gave us some fatherly advice. This evening we were conveyed by train to Ypres; from there we\n\nwent to a position called \"The Bund.\" Releived the Royal Irish Rifles. I have a good shelter here. There is a branch of the Y.M.C.A, near; the first one I have ever seen in a dugout.\n","179":"\n\nMoved up nearer the line yesterday from here we will do carring fatigue for Engineers, Rations, etc. I have a good shelter, with bunks, etc. that some wag has named \"Rat Villa\". The rats are very troublesome at night; for they crawl all over one; and fight on the floor. I’ll back them to eat a hole through any thing; and some of them are an enormous size. There are some Canadians working near; they are characters. Some of their expressions are too droll for words. Fritz snipes at us with \"77\" guns here.\n","180":"\n\nHave an enormous amount of work to do here. They have promised us that this will be our winter quarters; and as the trenches are in a disgusting state we will have to fix them up, in the way we know how. Fritz \"strafes\" us a good deal with \"minnewerfers\"; as he calls his large trench mortars. These bombs make a terrific explosion; for they weigh about 100 pounds; I can see them coming too and that makes them hard to get used to.\n","181":"\n\nWent up to the front line trenches this morning and took over. The lines are close here between 30 and 40 yards apart. We are on \"Hill 60\" there has been terrific fighting here at times. It is very quiet now however.\n","182":"\n\nIt is creepy work observing at night with the lines so close that I can here the Boeches talking in their trench. They have a rifle fixed on this bay too it nearly got me last night the bullet struck the bag I was observing over and filled my eye with dirt. There is no place to sleep here and as the trench is full of muck we are in for a rough time. He only \"hates\" us with \"minnenwerfers\" and rifle grenades so things are quiet. We use the periscope on the day posts. A hun surrended with the information that the troops opposite have come from the \"Somme Front\" too. So the sector is quiet.\n","183":"\n\nWas releived this evening. Have a good possie in Reserves, so here goes for a good sleep.\n","184":"\n\nYesterday I had a good rest, a wash and a shave. Feel a new man. We may not expose ourselves here for the Hun will see us and turn on the frightfulness. We do fatigue at night and so keep out of mischief. We get hot meals at night now.\n","185":"\n\nCompleted a new trench today, because of its odour we christened it \"No4711\" \"Digly bought us some puddings today. He is a good poor beggar; it must cost a slug to by puddings for a Company. He promoted a sandbag filling competition in the Coy. The winning pair filled 34 bags and stacked them in 15 minutes. Saw Bill Brew working near with the1st Pioneer Battalion. Between the lot of us we have done wonders here and have made a beautiful position.\n","186":"\n\nWe were releived last night and came right back via the railway train to Halifax Camp. Did not get up till 11 o’clock. Then I went for a stroll this evening and had a good time in a neighbouring village; there were some jolly girls there. As usual a big mail was waiting for me.\n","187":"\n\nWent looking for a fatigue job yesterday spent the day looking for it. Found it just when it was time to knock off. Marched to the","188":" Divisional Baths and had a splendid Bath and a fumigation received a change of underclothes, after wearing the same shirt for 6 weeks. Was innoculated against some disease or other. I have all ready been dosed against every one I can think of. I drew a pass and went to Popperinghe.\n","189":"\n\nDrilling about the place is the order of the day. I drew a new Box respirator today, they are a vast improvement on the old one. I am taking an interest in the Lewis Machine Gun; it is interesting and will releive the monotony. We have been issued with Anti Frost Bite grease to rub on our feet to prepare them for the winter. Received much mail, it is the only thing that makes this life bearable.\n","190":"\n\nWe were paid 14\/-. As the weather cleared, we practised a little with the new Box helmets. The 3rd Battalion had sports this afternoon. General Plumer commanding the","191":" Army was present. It was decent of him not to make us parade to him. He wore a monocle, this old geezer, and looked so quaint.\n","192":"\n\nThe","193":" Battalion held a well organised sports meeting this afternoon and there will be a good concert tonight. 16 Platoon has a new officer, called Howard he is a character, too.\n","194":"\n\nBrigade Church Parade at Busseboom. Birdwood issued some more Military Medals and, D.C.Ms. He brought Andy Fisher along with him, and there was the usual loads of \"staff\". \"Birdie\" had his usual chat; but Andy spared us his speech. Went for a Bath.\n","195":"\n\nSpent the day packing up and getting ready to go to the line. Of course we had to leave the billets scrupulously clean; it is the trade mark of the","196":" Battalion. \n\nMarched off this evening; we have collected a band, and they led the way to the train. The old \"rattler\" conveyed us to a certain point, then we marched across country through hedges and across ditches till we came to this place; where I am living under the Lille Road. The","197":" Brigade were here. They are a good mob to come in after.\n","198":"\n\nWas posted as \"\"Gas Guard\", over a huge Strombos Horn, in the grounds of a fine Chateau, now more or less ruined. We call it \"Bedford House\". By the neglected ponds and gardens it seems to have been a fine place. But now the fine oak trees are splintered with shells and its rose garden is a cemetery. About 3.A.M. some one started a gas alarm.\n\nThen all along the front arose the most dreadful din I ever heard hundreds of horns were blowing and bells ringing, other noise making instruments going strong. I turned the screw on my Strombos Horn; and it immediately set up a frightful bellow. Then I rushed along the shelters waking the chaps by shouting; \"Gas! Put your helmets on!\" I was a false alarm however; someone got the wind up about the rising mist I suppose.\n","199":"\n\nWorking, fixing up the train line that runs along this road. I witnessed an air battle in which both combatants fell inside our lines. The German was flying one of our machines, so he caught \n\nour airman at a disadvantage. A quiet day generally. One of the chaps found some German newspapers in a field. I got a piece. They were dropped from a Taube I suppose. This is the reserve line here, so we will have to work for some days. Without a doubt the shovel is mightier than the sword in this section.\n","200":"\n\nBusy bagging up farm houses and making tramlines with them. We can easily put a farm house in bags when, the Huns have finished with it. The heads are much interested in our feet lately and try to kid me to dress them with some noisesome preparation made with whole oil. It does more harm than good. Dry socks is the solution\n\nof the wet feet problems. Got into an argument with the Brigade Major today he reckons he will break me. This is the sort of thing a man has to stand from these fellows; while he is tempory-acting-Lance-Corpral; by the Grace of God. A gun we call \"Quick Dick\" was playing on the road today; he made our work more exciting than usual.\n","201":"\n\nWas releived of my command over the braves who are building the \"C\" tramline; went on a new fatigue to \"Chester farm\". Stacked a lot of material and got away early. Picked blackberries within four hundred yards of the front line, as I returned to my little home under the Lille road. There was a \"gas alarm\" last night I put my helmet on and went to sleep\n\nin it. Wonder that I did not choke. The artillery of both sides was unusually active today.\n","202":"\n\nWe have been receiving reinforcements lately; we need them to. Went up to the big mine crater near the Yser Canal. This is a \"whopper\" crater. Have an elaborate plan of defences to carry out here, so will be employed for a while in the crater. \"Hinie\" only strafes us with rifle grenades at times so with a bit of luck we will have a good time one thing is certain, that no damn Brigade Major will come fussing round here. The Yser Canal is a fine stretch of water here because of the lock that is in it just \"inside\" our line. It is not long since this same canal was red with blood. Returned home via \"Thames Trench\" and the \"Bluff\".\n","203":" \n\nThe Bosche evidently objects to our unwonted activity in the crater and today he poured an unusual amount of rifle grenades and hate into our position so we left early. Coming home I caught a pheasant in a blackberry hedge. He was not very fat I suppose he was worried. The grounds round here are supposed to belong to King Albert of Belgium, so I can say I have eaten one of the Royal Pheasants. We received a rum issue. A good day.\n","204":"\n\nWas paid 20 Fr. yesterday. Working on the \"S.O.S.\" trench till 1300. Packed up this evening and went up to the line taking over \"32.R;\" trench. All these trenches are new ones built by our chaps; they \n\nare the last word in comfort. I could stay here for the duration of the war. Those trenches that have crisp business like names are all our own make those called after someones fancy are the old ones. There is the \"Orange Grove,\" \"Fir Avenue,\" \"Lovers Lane,\" \"Batchelors Walk\" I am all admiration for the English and Canadians who fought for these heights in 1914-15. This section is know as the \"Bluff\"; the trenches are from 30 to 50 yds apart. The situation is similar in every respect to \"Hill 60\" except that we are very comfortable.\n","205":"\n\nYesterday Fritz’s gunners drew an extra allowance of shells, and strewed them over our sector liberally. There was a bit of a thrill this evening when it was ascertained that the Huns had a big mine set under our\n\nposition. It is knowledge that sort of makes ones toes tingle. We have our extra hour’s \"stand-to\" night and morning in case he fires it off and tries to rush us. It is a very unpleasant prospect no matter how I look at it.\n","206":"\n\nOur pet mine has not exploded yet; and I still manage to sleep sweetly on top of it. Have been building a dressing station. Near Batt H.Q. I feel better down there, am not afraid to tread heavily. Hope \"Hinie\" nurses her a little longer for:- Hush!\n","207":"\n\nWent to No Mans land and assisted in a \"Trench Raid.\" Did not get into the German trench; the fellows who did caused some distruction. There was no information gained for one of our chaps killed the \n\n \"evidence\"; as he was bringing him back over No Man’s Land. I reckon raids are a useless business anyway. Was relieved this evening by the 14th Battalion. I was pleased to skip off the top of that mine. Boarded the \"rattler\" in Ypres; marching through the Lille Gate and through the town. This city has been utterly destroyed; I could not have imagined such a scene of indescribable destruction.\n","208":"\n\nReached Halifax Camp in the Dominion Lines early this morning had a few hours sleep, a tot of rum, and a snack. Then marched off at 9.00 did about 10 miles. Camped the night near Steenvoorde, which is just on the Frontier. Captain J.R.O. Harris, alias Digby rejoined us today. Will go and forage this evening.\n","209":"\n\nAn early start, did a god 12 miles and billeted near the village of Aneeke. Passed a very picturesque village today, quite the prettiest I have ever seen called Cassel. It is perched high on a hill; and its quaint red roofs and towers make it look like the coloured pictures of fairy cities. Beside it is the ruin of a grand old castle. Its great thick walls still standing, and its towers covered with ivy. A very charming country altogether. Passeded the evening in town, a very good place for tucker, and other comforts; a pleasant day! A pleasant world! Returned to camp and got a new blanket; have two now; am going to doss on the grass tonight.\n","210":"\n\nA stiff march today, about 20 miles. All the way we passed through charming scenery. If Picardy is is pretty in the Summer time; this Department-de-Calais is beautiful in the Autumn. Marched though the large village of Watten. Passed another large castle; much older than the one I saw yesterday; a real old Norman stronghold. Three companies, and all the officers are billeted in a big chateau here. It is a fine place; was the property of an enemy subject; and it has been seized by the French Government. Picked big, luscious, blackberries this evening. The signs say that we will rest here a day or two. We have hustled over 50 miles during the past three days wherefore the hurry I wonder?\n","211":"\n\nWas paid 20 Franc’s yesterday. I am enjoying the spell in this pleasant area. We exercise vigorously in the grounds of this chateau; and carry out some brisk route marches. Received some letters and parcels.\n","212":"\n\nThe Vote on the Conscription Referendum was taken yesterday. I don’t think the troops are keen on it. Did not get a vote. A battalion Parade; the colonel warns us that we will see more fighting before we are much older. Have orders to move off at midnight. I am sorry to leave my White Chateau, I doubt if we will ever get another home like it. Had a white frost this morning the first I’ve seen this winter.\n","213":"\n\nMarched about 7 miles to the railway at St.Omer. Entrained at 4 A.M. It seems a nice city, but this is usually our share of these big towns. Tramping through while it is asleep. Passed Calais, Bolounge and Etaples; detrained at Longpre. Crossed a fine stream, the \"Somme\" I believe and halted at this village; L.Etoile it is called. The name means; \"A Star\". Besides other things Rum! can be purchased in this exellent place; so the warriors are happy. There is an old roman camp on a hill top near, the ramparts and other defences are still to be seen. It is shaped like a star, perhaps that is how this place gets its name.\n","214":"\n\nHave had very heavy frosts the last couple of days. Church Parade this morning. Spent the afternoon round the town. Saw two lions that a resident of the town has in captivity; splendid beasts both of them. Dined off horse steak, it was good too, but I am ready to eat anything these days. Left this town in the evening; it was too popular, and spent the rest of the day in \"Les Moulin Rouge\" a hamlet 3 Kilos away. Had a physical argument with some Tommies. Got back home at midnight after a pleasant day.\n","215":"\n\nGot away early, and after a short march, we were met by a huge convoy of French motor-bus’s.\n\nThey conveyed the whole division about 35 miles. My Battalion was taken to a certain point from whence we marched through much mud; to a camp near Fricourt. Raining heavily. The French motor drivers seem to live on bread and choclate; and are dressed in huge hairy goat skin coats. \n","216":"\n\nMarched on through the rain; along roads conjested with traffic. Dumped our packs along the road and donned light fighting order. Halted on a place we call \"Mud Hill\"; though the whole landscape is a sea of mud; of the consistency of cream. Absolutely no shelter here, but I have found a possie in an old trench. Am drenched to the skin and covered with mud. Don’t enjoy the prospect of fighting in this weather.\n","217":"\n\nStill hanging on here while it rains with maddening persistency. Have sewed large patches of yellow cloth on our backs and are fitted out for a big stunt. I have never seen so many troops as there are massed here. At night the camp fires on the hills and in the valley look like the lights of a great city. The sight of the transport, and guns pouring along roads knee deep with mud is indescribable. Have excavateded a little cave for myself in the chalk; and only appear at meal times. We are ordered to be ready to move to the line at a moment’s notice. There are big things in the wind for our rations are very liberal, and we get rum every day. \n","218":"\n\nMoved up to the Reserve Trenches in front of Delville Wood. There has been fierce fighting in this wood, even now it is heaped with corpses. The mud here is sickening; I found a \"Tommy\" bogged in it, and it took four of us half-an-hour to get him out. He was in a shocking state of exhaustion; but game enough. I marvel how this city bred Englishmen stand it. The flashes of our guns illuminate the whole sky, we are very strong in artillery now. The German lines are visible from here; at night his rockets rise continually, Red, Green, White, and a beautiful yellow one we call \"Golden Rain\". I have a very wet home here, I’m afraid it will fall in on top of me soon.\n","219":"\n\nRain! Rain! Rain! We got some rum this morning, that is one bright spot in the day. My home collapsed on top of me last night. Spend a wet miserable day. Was attached to Brigade Head Quarters this evening. Went down and reported and set to and made myself a \"doss\" on a pile of \"Stokes\" mortar bombs; it is dry; but I guess I will go up if a shell hits this pile tonight. I shall make myself a home tomorrow.\n","220":"\n\nSpent the day contructing a nice new home. Succeeded in stealing much good material for same and I am very pleased with the result. Also pinched a pair of gum thigh boots; I need them\n\nfor the mud is over the knees in places. It is good to be attached to these high places; plenty of rum and rations. I will do duty as Gas Sentry. over the H.Q. dugout.\n","221":"\n\nThis job will do me. Four hours on, and eight off. We get shelled here otherwise an uneventful life. I rescued a packhorse from a bog hole in the road today. It is good to get a chance to do these poor beggars a good turn, they serve us well. There is a battery of howitzers in position near here. It is great to watch them firing at night. No light is seen in the gun pits, except a pencil of light from a electric torch that flashes over the sights, an even voice calls the fire orders from a dugout nearby; \"Range! Four, five, eight, O.; Charge! No. 5.\n\nCorrector! 1-5-6-0! Elevation! 3-6-0 degrees Direction! 10 minutes Left!\" I stop my ears as a voice cries; All ready! Sir!\" Immediately comes the order; \"Battery! Salvo! Fire!\" There is a blinding flash; a deafening report, that almost drowns the shriek of the projectiles as they fly over to Hunland. I inwardly endorse every shot.\n","222":"\n\nWent souvenir hunting in the Flers village this morning, inspected a crippled \"Tank\"; otherwise know as \"His Majesty’s Land Ship\". It is fine today; the first fine day we have had for a fortnight. Dried my blanket and overcoat in the sun. Our observers are making the best of the fine weather too; I counted 52 aeroplanes and 25 Observation Balloons up this evening Everyone’s spirits have risen\n\na lot too; my mate is outside this dougout; singing a touching ditty entitled; \"Just Before the Battle; Mother\" as he scrapes the mud off his clothes with a bayonet.\n","223":"\n\nOur Colonel, O.G. Howell-Price was sniped this morning. There is to be a stunt in the morning. I have been detailed as a special \"runner\" to bring back messages from the advanced position. Our guns are firing furiously; making one continual roar of sound.\n","224":"\n\nThe Brigade attacked this morning very early. Went forward with some of ‘C’ Company on the right; and after some unpleasantness, gained the objective. The 1st on the left were repulsed, and the 3rd retired from their unsupported position at \n\ndawn. It was murder to send men over the top in this weather; some were shot down as they stood waist deep in the mire; unable to move. I rejoined the Company. These trying conditions have been telling on the boys. There are some bad cases of trench feet. Word was received, that our Colonel has died of wounds. We will miss him for he was a very gallant gentleman.\n","225":"\n\nConditions are very trying here have no tobacco, not the least of my troubles. Two young Huns came in and surrended to me this morning; one was a cool specimen said his mother told him to surrender a good many Huns have given themselves up to us on this sector; they are mostly out of Saxon Regiments;\n\nthat have been stiffened with Prussian troops. They say they are sick of the treatment they receive from the overbearing Prussians.\n","226":"\n\nWas releived last night after another, nightmare day. Company Head Quarters drank the rum issue and got dead drunk; so the releif was go-as-you-please. The whole company got lost in this wilderness of mud. It took me hours to stagger out to an English Battery near Longwall. I think I fell a hundred times, but was with some other chaps who helped me up. The English gunners treated us handsomely; gave us rum and food and cigarettes. We all felt better then and laid down in the rain and slept till daylight. Found the Battalion in Trones Wood.\n","227":"\n\nWe are in Reserve in Trones Wood. Do a bit of carring fatigue taking engineers stores, etc. to the line. The officer that drank our rum has been sent away for his health. He ought to be hung. They sent old \"Digly\" away and left that fellow in command.\n","228":"\n\nThe","229":" Brigade releived us, and we moved back to Bermafay Wood. There is a Red Cross stall, with \"bacshee\" cocoa on tap, near here, it is very popular. Some mail was issued. had letters from home.\n","230":"\n\nMoved out to bivouac near fricourt. The boys were pretty weak so there was not much order kept; besides the road was crowded with \n\ntraffic. Saw the Prince of Wales today; he looked aggravatingly clean; also the famous, Guards Division; they are a fine, big, lot of fellows. Was paid 40 Fs.\n","231":"\n\nStruck camp yesterday and marched 9 miles or so, crossed the River Ancre and halted at this village Buire-Sur-Corbie. A very cold day. We have been issued with large sheepskin gloves they are exellent; in this frosty weather. This village is no class. Fooled round all day scraping the mud off ourselves and off our equipment.\n","232":"\n\nLeft Buire, and got aboard motor lorries. They conveyed us through Amiens to the town of Flesselles, distance about 30 kilos I have a good possie on a heap of straw where I hope to have a real good sleep.\n\nThere was some snow last night. I thought it was frost at first. Paraded early to hear that the fiat has gone forth; saying that we are very lax, and need to be straightened up; so the next week or so will be spent, doing infantry training, and \"physical jerks\", to make us fit to go \"once more to the breach\";. A nice district this; I am looking forward to a pleasant holiday.\n","233":"\n\nA week’s training in fair weather has brought back our old \"snap\". I guess we will not be long now. Wangled a leave pass to Amiens yesterday, got back this morning. After a dinkum good time; for it is a splendid big city, and has\n\n \n\nall the comforts of civilisation. A big shipment of Christmas parcels have arrived, so we eat much good, rich, food. Another holiday for me today; but we have orders to move at 4 A.M. tomorrow. So, all things bright and lovely. Finish!\n","234":"\n\nGot away at 7 A.M. The motor transport carried us to Dermacourt, from there ‘D’ Company, marched to a camp near Mametz. There is an air of mystery about this move I don’t know what is the meaning of it.\n","235":"\n\nMoved about a mile to Fricourt where we are camped in huts. I am told, that we are here to demolish German dugouts and salvage the timber; construct railways, roads, and\n\nother light labour, for eight hours each day. Working today clearing down a luxurious German dugout, it has several rooms, wall paper on the walls, electric light, and bell system. And proof against anything but british troops with bomb and bayonet. They say it was a hospital; for the body of a female nurse was found in one of its galleries. Not the first time I have seen traces of women in German dugouts. The Hun defences here were immensely strong; I will enjoy demolishing them. It is better than the firing line. Was paid 20.Frs \n","236":"\n\nContinued the salvage work yesterday. I went with a party this morning, to work on the construction of a new camp called \"Sydney\"\n\nIt is going to be \"some\" camp, winter quarters for the troops. All the huts are of the type known as \"Bow Huts\". They are all delivered in sections and have only to be bolted together. They measure about 25 feet by 14; and hold up to 40 men.\n","237":"\n\nEmployed these days on the railway at Willow Siding. Stacking sleepers, rails, and other junk. Wet foggy weather continues. Located Arch McIlveens unit about 200 yards from here. This is a good job; too good to last I’m afraid; although; it is very cold, and we sit around fires to keep ourselves warm, when there is nothing doing. This morning I heard a \"Tommie\" remark; \"Where there is smoke there is Australians, this weather;\".\n\nDecemmber","238":" 1916.\n\nWorked down at Sydney Camp today. Fitted some more \"bow Huts\" together. Last night Palmer, Agnew, and I went forageing to Becourdel, a ruined hamlet near here; found a B.E.F. canteen. Found the price of a case of whisky amongst us. Prepared an order; with the necessary signature of an officer; and managed to get a case of \"White Horse\". With various other provender we boys of 16 Platoon had a \"Barbecue\" last night I brought home a case of MacKenacies Meat & Vegetable rations this evening there was a tin for each of the chaps. Where did I get it? – Hush! It will keep the wolf from the door for a while. Hard work in this cold weather puts an edge on my appetite that would split a hair.\n","239":"\n\nDid a half days work today, then went for a bath; at the new bath house in the valley. I had not bathed for quite a while; and thought it would kill me, it was delicious however. Working on the demolishing gang. I am all admiration for the industry of the Bosche. His labour has made the country round here like a gigantic rabbit warren. I don’t wonder that he thought this position impregnable. Some of the communication tunnels are hundreds of yards long.\n","240":"\n\nHad a novel expierence yesterday; a fine clear day. Hamilton \"V.C.\" joined up again today, with other details and reinforcements. Have received much Christmas mail. Nothing to do today except keep warm.\n","241":"\n\nSpent the day loafing at Willow Siding. There is a big gun on the railway not far away. When it fires one feels the ground tremble about five seconds before the report is heard. It is a 9.2, and has a range of about 15 miles.\n","242":"\n\nDuring the last three days, we constructed a large drain. It is about three miles long. Some drain. There is rain every day. I collected several books from vacant dugouts the first I have seen for years.\n","243":"\n\nThe company has been re-organised and I have been selected as a \"wire cutter\"; a specialist of the first wave. I view these preparations with disfavour. Was\n\nworking on the old German line at Fricourt. Cold sleet and snow; there was only one fire; I could not get near it, till I removed the explosive from a German bomb and threw it into the fire; I had it to myself then, because the boys fled. A French civilian visited Fricourt under escort and recovered his cash box from the foundations of a house.\n","244":"\n\nFell for some heavy tumbling lately. Shovelling macdam into motor lorries. They say that 800 tons of macdam a day is used in the construction and repair of roads in this sector. Every yard of them has to be constructed over, shell torn grounds, that would bog a duck. It is almost impossible to recognise this place now as the same area\n\nwe passed over a month ago. It is a network of roads and railways. Comfortable camps have rose like mushrooms; generally, the work done is incredable. \"Gentle Annie\"; the gun on the railway found a mark this evening and fired several shots.\n","245":"\n\nHave shovelled enormous quantities of gravel lately. I really beleive that the\n\nregulation army shovel is winning the war. Was paid 20 Fr this evening, a very popular event. Will seek diversion; there is a train going out from Willow Siding presently; and I will be aboard and ride out to Dermacourt.\n","246":"\n\nComing home from Dermacourt with one of the fellows last night\n\na Military Policeman stopped us on the road and wanted us to show reason why he should not arrest us as deserters! The devotion to duty these gallant fellows show, is touching. He did not \"pinch\" us however; although my mate was sarcastic, and pointed out to him; that as a non-combatant, he should \n\nget himself paraded when he wanted to speak to fighting men. Spent the Day giving banjo selections on the gravel dump.\n","247":"\n\n\"Froggie\" drivers brought in another trainload of macdam. We sent it on, to pave the way to Berlin. A fall of snow this afternoon after a hard frost this morning. The snow covered up the hideous water soaked landscape and made it look clean and nice.\n","248":"\n\nMy last day on fatigue; threw my last shovelful of gravel into the lorries marked \"Road Repairs\"; and marched with the Company this afternoon to \"Melbourne\" camp where we rejoined the Battalion. The usual preparations; issue of Bombs, Ammunition, etc; before proceeding to the trenches. Have received a parcel of goodies from home; am saving them for the \"line\"\n","249":"\n\nMoved through a snow storm, via Montuban, to Bernafay Wood. Camped in little tarpaulin shelters for the night. A transformation has come over this area too. It is some comfort to know we are firmly consolidated here.\n","250":"\n\nWent into support. A good duckboard track all the way now. We have shelter in large tunnels excavated in the chalk. We are crowded into a sitting position all the time but it is dry, thank Heaven! There is no ventilation and the shortage of fresh air is very noticeable; no wonder, with all the steaming humanity that is packed into the place. Did fatigue half the night. The downpour of rain is increasing.\n","251":"\n\nStayed in the tunnel all day. Had our feet inspected several times; as trench feet is rampant amonst us. We get whale oil to rub on them, but I prefer dry massage. Received a new pair of boots for my broken pair. Have rubbed my\n\nissue of whale oil into them; it make keep the icy slush out when I go out tonight. I am with a party that carries hot rations to the firing line twice every night. The food is carried in large steel thermo. containers, that we strap on our backs. We go straight across the open as there are no trenches, they are either full of water or have fallen in. The foul air here is putting my candle out.\n","252":"\n\nDid two trips with the food \"containers\" last night. Fritz spotted us on the last trip and signaled his artillery with two green lights, got \"strafed\" very briskly for a while. The ground is covered with a frozen crust now. We break through it in places and sink to our knees\n\nin the slush beneath. Carring loads through this is very tiresome. Will go up and occupy the front line on the Guedecourt sector tonight; orders were gravely read, that there is to be no fraternisation with the enemy on Christmas Day. I suppose the \"heads\" think we will want to kiss Fritz under the mistletoe or something.\n","253":"\n\nLast night was the worst I ever \"put in\" in my life. Had some causualties in the company during the releif. Volunteered as a stretcher bearer. Six of us had to carry a wounded man on a stretcher, through the mud, waist deep in places. Got some rum when I returned to the dugout, but our Rations have been lost so there was nothing to eat except a piece of dry bread and \"Somme\" mud. This, and the memories \n\nof other Christmas dinners I had eaten; was my Christmas dinner this year. I am in a large German dugout where we sleep during the day time. No movement is allowed during the day for the position is much exposed\n","254":"\n\nReceived a small piece of Christmas pudding last night before midnight so yesterday was Christmas Day. The weather broke and it was fine and clear today. Was on \"day post\" and witnessed a fight between aeroplanes. One, burst into flames while flying at a great height and was destroyed. The town of Bapaume is plainly visible; behind the German line, the Hun defences before it seem very strong. This position is called \"Fritz’s Folly\"; why, I cannot imagine. The hun is shelling Geudecourt other wise the front is quiet.\n","255":"\n\nSpent a freezing night in the outposts. There is no shelter in these positions, they are just holes where we stand, deep in half frozen slush for 14 hours each night, watching the enemy lines across the valley. If he was to attack I’m sure I would be too cold to resist him. I am grateful for this dugout that enables us to get a sleep. We are due to be releived from the outposts tonight.\n","256":"\n\nWas releived from the outpost at 10 P.M. last Night. Came back to support in the tunnel. Went over to Flers at 1.30 A.M. and got the food containers; had to take them to the firing line. The weather is very cold. There is a Comforts Fund stall here issuing hot cocoa to the fellows. it is a splendid idea. We received a \n\ngood rum issue after our fatigue this morning, it made some of the fellows very drunk; so weak and exhausted are they. But it is wonderful how this stuff brings back your strength and enables one to sleep. These terrible conditions would kill a horse. I had not dreamed the human frame could stand such hardship. A german aeroplane came over and observed the entrance to this tunnel this morning. His gunners are busy dropping shells on the entrance now; he is making poor practice.\n","257":"\n\nOut again to the line with rations early this morning. Had a terrible time in the darkness and rain. The strain is telling on me and I am much weaker. Got down in a shell hole to escape the fire of a Bosche Machine gun; and when struggling to stand\n\nup under the weight of the steel \"containers\" I fell face down in the mud and could not get up. I was afraid I would drown there, miserably; but luckily some chaps came by; and dragged me out of the hole by the legs. Then I saw the two green lights rise out of his line and just had time to scuttle into cover, before the answering barrage arrived. Came back by a new route; because he was due to \"strafe\" the track at 4.30 A.M. so it was best to avoid it. This is one of \"Fritz’s\" good points; he is so methodical that one gets to know his routine, and is able to dodge a good deal of his \"hate\" by knowing just when a certain point is due to be shelled. Our 24 hours \"rest\" ? is up this evening, and we have to go back to the outposts at \"Fritz’s Folly\"; The weather is freezing cold.\n","258":"\n\nReoccupied the outposts last night I am posted on No.7. this time it is worse than the other one. We stand in the mud and water, from 5 P.M. in the evening until 6.30 A.M. the following morning. Dreadful cramp grips the muscles and sinews and the fellows cry with the agony of it. I became so stiff last night that, when I overbalanced, I fell like a log, face downwards into the mire and could not move for a while. No sleep today; the Hun has been trying to destroy these dugouts; he is using 11 inch, armour piercing shell. He has destroyed the H.Q. dugout thirty yards away, but has failed to get a direct hit onto this one as yet. Although this dugout is 30 feet deep, one of these shells will crush it like an egg shell. He has put some very\n\nclose, the concussion from them was terrific. There is an officer buried under the H.Q. dugout, some of the chaps are working trying to get him out.\n","259":"\n\nDuty in the outpost last night was a terrible ordeal. There was pitiless rain and the water rose and rose; it was bitterly cold too. One poor fellow collapsed, and although we tried to restitute him, he died. I survived the ordeal somehow and got back to the dugout at daylight. We were releived from the outpost at 10 P.M. I helped my mate, who was very sick; to Company Headquarters; where I managed to get a double issue of rum. Because of my exhausted condition it made me very drunk, but it gave me the strength of a madman, and enabled me to make \n\nmy way out over two miles of shell torn, water soaked, ground to our Reserve position in Gap Trench, where I crawled into a shelter and slept. Another night in that infernal outpost would have killed me; as it is I am utterly worn out.\n\n"}}