{"Document Name":{"0":"Diary_0298","1":"Diary_0298","2":"Diary_0298","3":"Diary_0298","4":"Diary_0298","5":"Diary_0298","6":"Diary_0298","7":"Diary_0298","8":"Diary_0298","9":"Diary_0298","10":"Diary_0298","11":"Diary_0298","12":"Diary_0298","13":"Diary_0298","14":"Diary_0298","15":"Diary_0298","16":"Diary_0298","17":"Diary_0298","18":"Diary_0298","19":"Diary_0298","20":"Diary_0298","21":"Diary_0298","22":"Diary_0298","23":"Diary_0298","24":"Diary_0298","25":"Diary_0298","26":"Diary_0298","27":"Diary_0298","28":"Diary_0298","29":"Diary_0298"},"Date":{"0":"unknown","1":836.0,"2":837.0,"3":838.0,"4":839.0,"5":845.0,"6":846.0,"7":847.0,"8":848.0,"9":849.0,"10":850.0,"11":851.0,"12":852.0,"13":853.0,"14":854.0,"15":855.0,"16":856.0,"17":861.0,"18":862.0,"19":863.0,"20":864.0,"21":865.0,"22":866.0,"23":868.0,"24":869.0,"25":870.0,"26":871.0,"27":872.0,"28":873.0,"29":888.0},"Entry":{"0":"\n\n","1":"\nDear Harry,\nI have not had any letters from you yet, I hope you are getting the mail allright. I sent word through to you by Uncle Rod.\n\n\n\n\n","2":" Stood to from","3":" 12 last night until","4":" past 1 this morning. different roumors were about, reported gasattacks and charge on our right about 20 miles distant, but do not know full particulars. ","5":" Dowling shot dead through the head this morning another one of our menshot through the chest, and not expected to live, german (wish-bang) pretty buisy, our own guns also buisy, quite during the night. ","6":" \nAnti-\nair-craft buisy mostly our own. shot in 3 places with shrapnel to-day. 2 more in B comp last night one shot in groin & other in leg, while doing Patrol duty, big gun buisy firing into german reserves naval gun, otherwise quite , about from 6 too just on dark one of our aroplanes was very cheaky coming very low over german lines and giving big gun direction. ","7":" Fine morning & night B.H.Q. machine gunner shot through groin, did not live long, went from firing line to Farm Port after to-day: this is the place were theM.G.s.got shot. ","8":" Cloudy morning, fairly quite during day but Fritzs machine gun gets buisy at night and plays over here, Throufarm, N.Z. Sapper wounded through shoulder last night, otherwise things quite.","9":" Raining this morning things quite, 4 casualities to-night 2 killed & 2 wounded all 1st Batt. two just aback of us & two in firing line.\n","10":" - Cloudy & damp this morning nothing much during day, 3 casualties during night, all three bad one abrasion wounds & and one face wound, both these from D. Coy. We had one in our own Coy shot througbelow shoulder blade coming out side of got to bed after stand,","11":" Cloudy to-day and quite during day except for occasional shell and M.G. fire during night. ","12":" Lovely morning aroplanes and shellingpretty buisy 6 of our machines in our spot early this morning we heard we are being relieved next Saturday. Quite night. ","13":" Bright \nnight\n morning a bit of shelling on each side, one of our (No 7 C) wounded through the wrist, quite during night. ","14":" Fine morning one prisonerkilled this evening and one of D Coy wounded through arm, had narrow squeak getting dead man. ","15":" Fine morning shelling on each side, aroplanes quite one up last night. Left hand into service. 20\/5\/16. Fine day most Bosche accidently killed. 21\/5\/16 to-day fine weather nothing doing here\n\n\n\n21\/4\/16 arrived in support, very wet, 9thBatt had 76 casualties at V.C. corner, 24 killed including 1 Officer, shelled yesterday their position but we have not heard nothing from them so far. 22\/4\/16 Nothing out of the common happened to-day heavyguns and still on the go but the huns have sent nothing here yet, still raining and has been pretty all day. Some officers & N.C.O visited the trenches to-day, & the main firing line & from all accounts they are very wet 23\/4\/16 Lovely morning anti-air-craft buisyit is a pleasure to see the sun. German guns shelled to-day a battery to the right of V.C. Corner airoplanes busy plenty of shells were fired at them, mostly our own airoplanes and german fire. 6 in high explosive shells were fired at the battery to-day, but done no harm, this particularly battery has been in the one position 7 months night ended up quietly. 24\/4\/16 Another lovely morning a taube was up very early, big guns quite to-day, anti-air-craft very busy, a few casualties today including one killed 4thBatt man. Heard that we will be going into trenches next Monday machine gun & rifle fire extremely heavy to-night.\n\nright) left weather cock farm to-night for firing line arrived safely. \n4\/5\/16 fine morning went down via V.C. Corner to A. No. C.got on wrong tracks, narrow squeak with piece of shell from anti-air-craft gun. A few planes up this morning. german shelled weather cock again 8 casualities all wounded as far as we know. 5\/5\/16 Cloudy morning our planes are up again, a good bit of shelling this morning on both sides. Very heavy bombardment to-night on our left& flares are up continually started about 1\/4 to 8 and lasted about 2 hrs. 6\/5\/16 Dull morning it is roumered that the germans attacked on our left last night, things seemed to point to an attack as big gun fire was very heavy & shrapnel seemed to be very constant. Have waited to hear of the being completeddiscovered where a german sniper is stationed this morning, a shell would shift him. 7\/5\/16 Heard that roumered attack on right Germans only got half way and returned to their trenches. They met with a deadly fire first German attack on Australians. Germans shelled D Company's lines this morning pretty constant and along a communication trench. There was one slight casuality as far as we know. ","16":"\nD.Coy got shelled this morning. Knocked the parapet over in one place nothing serious happened.\n","17":" Another fine morning to-day is annerversry day of the landing of Australians & Allied troops on Gallopoli, very quite (excepting a few shells from our battery and replys from the germans, rifle & machine gun fire to-night pretty constant. ","18":" Another fine morning nothing much to-day, a bit of bombarding on each side, rifle fire pretty constant, got mixed night. ","19":" Another fine morning things pretty quite during day, but about 1\/4 to 11 to-night there was a gas alarm & we all got out ready with gas helmets, as far as our front was concerned it was only a demonstration, but we hear there was an attack on our left. big guns pretty buisy.","20":" Fine morning nothing happened during day and pretty quite, excepting for machine gun & rifle fire during night. ","21":" Another fine morning & pretty quite, excepting for occasional shell fire. got warned to be ready for an attack about 12 o'clock. great uncertainty nothing happened though.\n","22":" Another fine morning nothing very startling a quite night","23":" fine morning 6 of our planes gave the germans some trouble early this morning they were surrounded with shots but none got hit that I saw & they continued their flight over the german lines. 1st Batt H.Q. shelled & 4 casualities all wounded a quite afternoon, nothing done here during night","24":" Cloudy morning few planes about our guns bombarded 4 O'Clock this afternoon a lot of planes up, but the german guns did not reply much no casualities as far as we know, 2 women& 2 children killed and woundedreported. ","25":" Fine morning, billet was bombarded this afternoon about 4 O'Clock. Leiutenent Elliott & Pte Sullivan killed Pte Horan wounded lost arm\n\nNornon (Great Rock) Avignon Lepentont (Woods After) Sorgueo - Brand Courthey (Orange - big place, very hilly around here & resembles very much the town of Orange in N.S.W. the mountain here covered with snow (Mondragon weir here, and we passed through a tunnel 1\/2 mile long (Pierrelatte) Donzere, river here (Montelimar, plentry of French soldiers here at railway gates and on the platforms, meet the river again here (Lautce) Lorilol, Luron) (Etoile) Portes) Tin's, Paul, Miard, Montpellier La Roche, De-Chun train meets river and this a great vineyard district. (Hermitage, Alexandra - Rochette, Cuvas, across the river (Andongetta) (St. Barmbert) T. Albon(Saliase) Lepacedersvoilone Clonas (Les-Roches, river again here (Tangris) Fienne, Estresesen, Chasse, Serezin, Gleijsin, St; Fon's (Lyon's arrived here 6-30 in the eveningthis is a large city (Collenges) Fountains on the Seine (Lantency passed through big tunnel here longest one yet arrived there 5-15 Thursday morning. \n\n left Wednesday 5 a.m.\n\nBlaisy-Bas (Les-Lairmsa) Alesia, Montbard, Aisy, Lorter, Tonnerre, Flogny, St. Florentin, Hergigny, Giogney (Fligmy-Vernon,Sens, arrived here at 25 past 2 river here again, but not the Seine (Pont-Sur-Yonne) Montereau (Ferner-Sour (Champange-sur-Seine) still on a river here but do not the name (Obericy) (Fontaine-le-Ponne) Chartettes, still hug the river here (Melun, arrived here 20 past 4 o'clock (Tosves river & falls here (Pontechierry) St. Seregen-Temues, river here, which is the Seine and fall's here also (Condiny - (Montauex tunnel here. Villars arrived here at 10 minutes to 5 o'clock tunnel here also Carbisco-Essonne thro a big town. Evey-Peit-Bourge still hug the river here (Rin-Oringis) Juvisy this is a very big place, and also the branch here for Paris Longeuem. Jong-en-Josas, Champlan. \nNeilo\n Nalioeau.\n\nThursday\n","26":"\n\nQuain No. 1 got here at day-light, this is a very big place (Piconigmy) Ally-Sur-Somme, long ave. (Abbeville - stopped here for about 3\/4 of an hour, (Voyelles, Garde, Rue, Qusan - Port - Nahen) Conchil-le-Imple field artillery here french 75's (Terton, Burette, St. Jofe (Etaples, big river here & a big canva's camp too. Higenhestul. Pont-de-Brigues, big munition factory here. (Poulongs-Somme. English channel in sight here arrived here at 10 minutes to 10 o'clock (Rinxente - Marguise) an observation baloon here & a big shed. (Caffiers - Guiners) Frethurn. (Calais arrived here at","27":" past 11 O'Clock & stopped for about","28":" hour for tea & had some dinner. (Calais, 12 hrs Soir) Pont-D'Adros.Audricco.Wattey-Eperlacqueres) Saint-Omer, this is a big place & arrived here at","29":" past 1 O'Clock (Ebblinghem, Marzenbuch. Steen - Bucaque - arrived at 4 O'Clock.\n\nMarched back from Steen-Bucaquetoo Ebblinghem a distance of '7Ms, arrived there late and were billeted about 12 O'Clock.\n\n"}}